{"id":67729,"no":48,"title":"Page 48","content":"As Linnette sat in the bleachers waiting for Cal, she wondered how she’d react when he told her face-to-face that he no longer wanted to be part of her life. For reasons she couldn’t really explain, she needed him to tell her in person. Ending their relationship with a phone call was just wrong. She saw Cal drive into the lot next to the park and climb out of his pickup. Her heart went on alert, and her pulse accelerated at the sight of him. The memory of all the good times they’d had together brought hot, stinging tears to her eyes. That embarrassed her, and she quickly blinked them away. As Cal approached, she stood up. He looked tanned and handsome, even more attractive than he’d looked before. He wore jeans and a Western-style shirt, and his Stetson was pulled forward to shade his face. “Hi,” she said evenly. “Welcome back.” “Thanks,” was his reply. He stood awkwardly in front of her, his thumbs hooked in his jeans pockets. “It’s good to be home.” No hint of a stutter, she noticed. She sat down again and he joined her on the bottom bleacher. For a few seconds, neither said a word. To Linnette’s way of thinking, Cal should be the first to speak. “I don’t want to hurt you, Linnette.” Well, it was too late for that. She was deeply hurt, and fighting not to show it. She tried to tell him to save his breath, but the words didn’t make it past the constriction in her throat. “I never meant to fall in love with Vicki.” “You’re sure you love her?” That was the important question. “I’m sure,” Cal said. “We have a lot in common.” If this was supposed to make her feel better, it hadn’t worked. She could see that he was waiting for her to say something, and despite the emotions that simmered inside her, she couldn’t. She’d wanted this meeting and agreed to see him when he’d phoned. She didn’t know what she’d expected—certainly not this crush of pain and loss. Perhaps it would’ve been best to simply walk away and not look back. Cal glanced at her. “Aren’t you going to yell at me or anything?” She managed a smile and stared down at her feet in their neat, polished pumps. “I thought I would, especially when you first told me. I guess I’m past the angry stage.” She wasn’t really, but couldn’t see any point in discussing it or telling him it often took years to get over rejection. At least that was how she felt about it. “I…I don’t have much experience in relationships,” she said. This grief was new to her, a life-lesson she didn’t want to learn—or repeat. “I know and—” “You don’t know any more about relationships than I do,” she told him. “No, I don’t,” Cal murmured amenably. “I think we both liked the idea of being in love.” She didn’t agree with him, but there was no reason to argue. “Perhaps,” was all she said. Cal sighed and looked out over the cove. “I guess your entire family’s upset with me, and I’m sorry about that. I like your family.” She shrugged. “Mom and Dad both think you’re the greatest thing since flu shots.” Cal cracked a smile. Then, apparently feeling it was necessary to predict a positive future for her, he said, “One day you’re going to meet someone who’ll love you more than I did.” Linnette supposed Cal meant that as a compliment, but it didn’t sound like one. “I should hope so. I’d hate to think getting dumped is going to be a regular occurrence for me.” “That’s not what I meant.” “I know.” Then, to her dismay, a tear escaped. Hoping he hadn’t noticed, she quickly wiped it away. She hadn’t anticipated this heart-wrenching sense of regret and wasn’t sure how to react to it. She’d truly loved Cal and tried to help him. Perhaps that was where she’d gone wrong. Perhaps no man wanted to be helped by the woman he loved—or thought he loved. “Vicki asked me if she should come and talk to you herself. I—I didn’t think that was a good idea.” “Probably not.” Linnette figured it wouldn’t look too impressive if one of the community health-care professionals scratched out another’s woman’s eyes. The thought produced a near smile. “I have an announcement of my own,” she said with false enthusiasm. Cal looked directly at her then, for the first time since their conversation began. “I’ve decided to leave Cedar Cove.” She made it sound as if she’d received the opportunity of a lifetime, when no such prospect existed. In fact, she’d be breaking her contract and her lease, packing her bags and walking away with no destination and no plans. “You’re moving?” He seemed shocked by that. She was astonished that he actually thought she’d stay in Cedar Cove. “I’ve always wanted to see other states.” “You have a job?” he asked. Not yet she didn’t. But it shouldn’t be a problem finding employment in one of the small towns that dotted middle America. “Do you think I’d move without a job?” she asked, implying what she knew he wanted to hear. “What did your parents say?” Of course she hadn’t told them yet. This had been a recent decision—made all of two minutes ago. And yet…it felt right. She had to leave Cedar Cove. It was difficult enough to recover from a broken heart, but it would become impossible if she had to see Cal and Vicki around town. No, the only reasonable solution was to pack her bags. “I’m sorry,” Cal said wretchedly. Linnette knew he was sincere. In two words he’d told her he would have spared her this pain if he could. “Don’t worry about it,” she said with a flippant air. “I’m learning lessons most girls learn in high school. I…I always was a late bloomer.” She stood abruptly, needing to get away. “Goodbye, Cal.” He stood, too, looking at the ground, shuffling his feet, obviously ill at ease. “I’ll always be grateful to you.” He’d be grateful. Well, that was nice, but it didn’t make up for the fact that he didn’t love her anymore. Linnette walked home to her waterfront apartment, which wouldn’t be home for much longer, and climbed the stairs. Not once did she glance back, which was an accomplishment of its own. Coward that she was, Linnette phoned the medical facility so she could talk to the personnel director and give notice verbally. A formal letter would be coming, she said. When she got off the phone, she wrote and printed out the letter, as promised. And then, because she needed to do something physical, she pulled out her suitcases and started to pack. Forty minutes later, her doorbell chimed, and for a fleeting moment, hope emerged and had her rushing to answer the door. But it wasn’t Cal, and she’d been deluded to even think it might’ve been. Instead Dr. Chad Timmons stood there. “You’ve given your notice?” he demanded, pushing his way past her, irritation written on his face. He was still dressed in his whites and had obviously come straight from the clinic. She nodded. “I won’t let you.” “Sorry, too late. I’ve already had that discussion with Alma McDonald,” Linnette said without emotion. “I’ve written my letter of resignation. Besides, what makes you think you can force me to stay?” “You can’t leave,” Chad insisted, his hard gaze holding hers. “Okay, so you had an important relationship go sour. Happens to all of us sooner or later.” It had never happened to her until now, and she wasn’t sticking around to see Cal and his new girlfriend together at every community function. Perhaps a stronger, better woman would be capable of that, but Linnette couldn’t do it. “Do you intend to run away every time you hit a difficult patch emotionally?” he asked. “Is this the kind of pattern you want to set in your life? Come on, Linnette, get a grip. You’re an adult. Act like one.” The harshness of his words felt like an attack. She stood up to it, though. In little more than a year, she’d experienced two disappointments in romance. She wanted out. Okay, her reactions were childish; she didn’t care. Besides, she didn’t know why Chad felt so concerned about this, since he was interested in Gloria, not her. Fine, she’d dealt with that, and really it hadn’t been so painful because Cal had entered her life. She’d sure made a mess of that relationship. “Sorry,” she said, meeting his eyes. “I’ll let you know where I land.” Chad frowned. “You’re really going?” She nodded. No one else knew yet. She still had to tell her parents and Gloria, but she was leaving Cedar Cove. That much was certain, even if nothing else was. Forty-Three “Allison.” Her father’s voice rang over her cell phone. “Could you stop by the sheriff’s office?” “Now?” she asked, glancing regretfully at her two friends. She was on her way to the Silverdale Mall for a much-needed shopping break. Her mom had let her use the car, and Allison had volunteered to drive. Since graduation, all she’d done was work at her dad’s office. She had less and less of a social life these days. It seemed pointless to date anyone else, because no matter how this whole arson mess ended, she loved Anson. “Yes, now,” her father insisted. “It’s important.” “Does…does this have anything to do with Anson?” Her friends looked at her, and their conversation instantly died. “It does.” Her heart leaped into her throat. “I’ll be there in ten minutes.” After apologizing to her friends as she dropped them at a bus stop, Allison reversed her direction and headed back into Cedar Cove. Her stomach was in knots. Something had happened. The sheriff’s door was closed, and Seth and Justine Gunderson sat outside his office. So did Roy McAfee, the private investigator she’d once gone to on Anson’s behalf. They all smiled warmly when they saw her. “Hello,” she said nervously. “Hello,” Justine said. “I think you’re supposed to wait here, too.” Allison took the fourth chair and twisted her purse strap around her palm. “Is my father talking to the sheriff?” she asked. Mr. Gunderson nodded. He began to speak, but the door opened then, and her father stepped into the hallway. He brightened when he saw her. “Can you tell me what this is about, Dad?” she asked, coming to her feet. “I sure can.” Her father smiled. “Actually, it wasn’t Sheriff Davis or I who asked to see you.” He held open the door and gestured her inside. Wondering at his words, Allison entered the small office and noticed Sheriff Davis right away. A soldier stood next to him, a handsome young man, wearing fatigues and a cap. The name tag on his jacket said Butler. Butler. No, it couldn’t be. Allison looked again. It was. “Anson?” she whispered, hardly able to believe what she saw.","sourceLink":"https://allnovel.net/6-rainier-drive-cedar-cove-6/page-48.html","bookId":1947,"book":{"id":1947,"title":"6 Rainier Drive (Cedar Cove #6)","description":"Storyline: 6 Rainier Drive (Cedar Cove #6) 6 RAINER DRIVE CEDAR COVE, WASHINGTON DEAR READER, As you may have heard, we\u0027ve recently had quite a shock. My husband, Seth, and I lost our business, The Lighthouse restaurant --- to arson. The investigation continues. The prime suspect is a young ex-employee named Anson Butler, who disappeared right after the fire. So Seth and I are trying to sort out our lives. (And let me tell you, this kind of crisis is not good for a marriage.) In the meantime, life goes on for everyone else in Cedar Cove --- with marriages, births, reunions and even the occasional scandal. One of the most interesting pieces of news is that Cal, who works on Cliff Harding\u0027s ranch, is now rescuing wild mustangs from Wyoming. I have to run --- I\u0027m meeting an old friend, Warren Saget, for lunch. Let\u0027s talk soon, and I\u0027ll fill you in on everything that\u0027s happening in town! JUSTINE","cover":"https://allnovel.net/images/6-rainier-drive-cedar-cove-6.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/6-rainier-drive-cedar-cove-6.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:05:00 AM"}}
