{"id":38951,"no":18,"title":"CHAPTER XVIII","content":"CUBA! At first he called it Juana, but we came afterwards still to use the Indian name. Cuba! We saw it after three days, and it was little enough like Isabella, Fernandina, Concepcion, San Salvador and the islets the Admiral called Isles de Arena. It covered all our south, no level, shining thing that masthead could see around, but a mighty coast line, mountainous, with headlands and bays and river mouths. Now after long years, I who outlive the Admiral, know it for an island, but how could he or I or any know that in November fourteen hundred and ninety-two? He never believed it an island. \n \n He stood on deck watching. \"Cuba—Cuba! Have you not read of Cublai Khan? The sounds chime!\" \n \n \"Cublai Khan. He lives in Quinsai.\" \n \n \"Ay. His splendid, capital city. Buildings all wonderful, and gardens like Mahound\u0027s paradise!\" \n \n \"But if it is Cipango?\" \n \n \"Ay. It may be Cipango. We have no angel here to tell us which. I would one would fly down and take us by the hand! Being men, we must make guesses.\" \n \n Beautiful to us, splendid to us, was this coast of Cuba! We sailed by headlands and deep, narrow-necked bays, river mouths and hanging forests and bold cliffs. We sailed west and still headland followed headland, and still the lookout cried, \"It stretched forever like the main!\" \n \n We came to a river where ships might ride. Sounding, we found deep water, entered river mouth and dropped anchor, then went ashore in the boats. Palms and their water doubles, and in the grove a small abandoned village. We had seen the people flee before us, and they were no more nor other kind of people than had showed in Concepcion or Fernandina. Yet were they a little wealthier. We found parrots on their perches, and two dogs, small and wolf-like that never barked. In one hut lay a harpoon tipped with bone, and a net for fishing. In another we found a wrought block of wood which Fray Ignatio pronounced their idol. \n \n We went back to our ships, and leaving river, sailed on in a bright blue sea. The next day we doubled a cape and found a great haven, but silent and sailless, with no maritime city thronging the shore. What was this world, so huge, so sparely, rudely peopled? \n \n We came to anchor close under shore in this haven. Again the marvelous water, but now it laved a bold and great country! We landed. Canoes fastened in a row, another village, most of the folk decamped, but a few brave men and women tarrying to find out something about heaven and its inmates. With toys again and pacific gestures we wiled them to us. \n \n There was upon the Santa Maria a young Indian who had chosen to come with us from Fernandina. He had courage and intelligence, was willing to receive instruction and baptism from Fray Ignatio, and first and last followed the Admiral with devotion. The latter had him christened Diego Colon. We taught him Spanish as fast and soundly as we might, and used him as interpreter. The tongue of his island was not just the tongue of Cuba, but near enough to serve. All these Indians have a gift of oratory and dote to speak at length, with firm voice and great gestures. Now we set Diego Colon to his narration. We of Castile had so much of the tongue by now that we could in some wise follow. \n \n Forth it poured! We were gods come from heaven. Yonder stood the chief god that the others obeyed. He was very great, strong, good, wise, kind, giving beautiful gifts! We were all kind—no one was going to be hurt. We made magic with harac—which we called \"gold.\" In heaven was not enough harac. So important is it to the best magic that a chief god has come to earth to seek it. We also liked cotton and things to eat, especially cassava cakes, and we liked a very few parrots. But it was gold that in chief we wanted. The man who brought the gods gold might go home with gifts so beautiful that there was never anything seen like them! Especially is there something that the gods call \"bells\" that ring and sound in your hand when you dance! Gold—do you know where to find it? Another thing! They desire to find a god who dropped out of the sky a long time ago, and has now a people and a great, marvelous village. Thinking he might be here, they have dived down to our land, for they dive in the sky as we dive in water! The name of the god they hunt is Grand Khan or Cublai Khan, and his village is Quinsai. Have you heard of him? They are very anxious to find him. The chief god with white hair and wonderful clothes—It is what they call clothes; under it they are as you and me, only the color is different—the chief god will give many bells to any folk who can show him the way to Quinsai. Gold and Quinsai where lives the god Grand Khan. \n \n As might have been expected, this brought tidings. \"Cubanacan! Cubanacan!\" Whatever that might mean, they said it with assurance, pointing inland. Diego Colon interrupted their further speech. \"There is a river. Go up it three days and come to great village. Cacique there wearing clothes. All men there have gold!\" \n \n Pedro Gutierrez spoke. \"They\u0027ll promise anything for a hawk bell!\" \n \n \"What do they understand and what do they not understand? What do they say and what do they not say?\" That was Martin Pinzon. \"Between them all we are fooled!\" \n \n The Admiral, who was gazing inland after the dark pointing finger, turned and spoke. \"At the root of all things sit Patience and Make Trial! \n \n \"Well, I know,\" answered Pinzon, \"that if these ships be not careened and mended we shall have trouble! Weather changes. There will be storm!\" \n \n He was right as to ships and weather, and the Admiral knew it and said as much. I never saw him grudge recognition to Martin Pinzon. It has been said that he did, but I never saw it. \n \n That night, on board the Santa Maria there was held a great council. At last it was settled that we should rest here a week and overhaul the ships, and that while that was doing, there should be sent two or three with Indian guides to find, if might be, this river and this town. And there were chosen, and given a week to go and come, Juan Lepe, Luis Torres and a seaman Roderigo Jerez, with Diego Colon, the Fernandina youth. Likewise there would go two Indians of this village, blithe enough to show their country to the gods and the gods to their country. \n \n The next day being Sunday, Fray Ignatio preached a sermon to the Indians. He assumed, and at this time I think the Admiral assumed, that these folk had no religion. That was a mistake. I doubt if on earth can be found a people without religion. \n \n Men and women they watched and listened, still, attentive, knowing that it had somehow to do with heaven. After sermon and after we had prayed and sung, we fashioned and set up a great cross upon cliff brow. Again the Indians watched and seemed to have some notion of what we did. \n \n The remainder of the day we rested, and on Monday early Roderigo Jerez, Luis Torres and Juan Lepe with Diego Colon and two Cuba men made departure, We had a pack of presents and a letter from the Admiral. For we might meet some administrator or commandant or other, from Quinsai or Zaiton or we knew not where. This was the first of many—ah, so many—expeditions, separations from main body and return, or not return, as the case might be! \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1516/45197.html","bookId":1303,"book":{"id":1303,"title":"1492","description":"简介： THE morning was gray and I sat by the sea near Palos in a gray mood. I was Jayme de Marchena, and that was a good, old Christian name. But my grandmother was Jewess, and in corners they said that she never truly recanted, and I had been much with her...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1516","creation":"Aug 1, 2019 12:24:49 AM","modification":"Aug 1, 2019 12:24:49 AM"}}
