{"id":38974,"no":41,"title":"CHAPTER XLI","content":"THE weather plagued us. The rains were cataracts, the lightning blinding, the thunder loud enough to wake the dead. Day after day, until this weather grew to seem a veritable Will, a Demon with a grudge against us. The Margarita sailed no better; she sailed worse. The Admiral considered abandoning her, taking the Adelantado upon the Consolacion and dividing his crew among the three ships. But the Adelantado\u0027s pride and obstinacy and seamanship were against that. \"I\u0027ll sail her, because San Domingo thinks I can!\" Stormy days and nights, and the Admiral watching. \"The Margarita! Ho, look out! Do you see the Margarita?\" In the midst of foul weather came foully back the gout that crippled him. I would have had him stay in his bed. \"I cannot! How do you think I can?\" In the end he had us build him some kind of shelter upon deck, fastening there a bench and laying a pallet upon this. Here, propped against the wood, covered with cloaks, he still watched the sea and how went our ship and the other ships. Day after day and day after day! Creeping eastward along a bad shore, in the teeth of the demon. The seas, the winds, the enormous rain wore us out. Men grew large-eyed. If we slept came a shriek and wakened us. We would put to land, but the wind turned and thrust us out again, or we found no harbor. We seemed to be fixed in one place while time rushed by us. Forecastle began to say, \"It is enchantment!\" Presently poop echoed it. The boy Fernando brought it to his father. \"Alonso de Zamorra and Bernardo the Apothecary say that demons and witches are against us.\" \"The Prince of the Power of the Air!\" said the Admiral. \"It may be, child! Paynimry against Christianity. We had a touch of the same quality once off Cuba. But is it, or is it not, Christian men shall win! And send me Bartholomew Fiesco. Such talk is injury. It bores men\u0027s courage worse than the teredo a ship\u0027s bottom!\" We thought the foul weather would never cease, and our toil would never cease—then lo! at the point of despair the sky cleared with a great clap of light, the coast turned sharply, sheerly south—he named the great cape, Cape Gracias a Dios—and we ran freely, West again. Coming in three days to a wide river mouth, in we turned. The shore was grown with reeds that would do for giants\u0027 staffs. On mud banks we saw the crocodile, \"cayman\" they call it. Again the sky hung a low, gray roof; a thin wind whistled, but for all that it was deathly hot. Seeing no men, we sent two boats with Diego Mendez up the stream. They were not gone a half league, when, watching from the Consolacion we marked a strange and horrid thing. There came without wind a swelling of the sea. Our ships tossed as in tempest, and there entered the river a wall of sea water. Meeting the outward passing current, there ensued a fury with whirlpools. It caught the boats. Diego Mendez saved his, but the other was seized, tossed and engulfed. Eight men drowned. The thing sank as it had come. The River of Disaster, we named it, and left this strip of coast that seemed to us gloomy and portentous. \"Wizardry! It\u0027s not to be lucky, this voyage.\" It was now late September. Next day, we anchored, it being most clear and beautiful. We lay beside a verdurous islet, between it and a green shore. Here were all our fruits, and we thought we smelled cinnamon and clove. Across, upon the main, stood a small village. Cariari the Indians there called themselves. They had some gold, but not to touch that canoe from Yucatan. Likewise they owned a few cotton mantles, with jars of baked clay, and we saw a copper hatchet. But they did not themselves make these things. They had drifted to them, we thought, from a people far more skilled. The Admiral cried, \"When and when and when shall we come to this people?\" I answered, \"I tell you what is in my mind, and I have got it, I think, from your inmost mind, out of which you will not let it come forth because you have had a great theory and think you must stand to it. But what if this that you have underneath is a greater one? What if the world truly is larger than Alfraganus or the ancients thought? What if all this that we have found since the first island and that means only beginnings of what is to be found; what if it is not Asia at all? What if it is a land mass, great as Europe or greater, that no one knew anything of? What if over by the sunset there is Ocean-Sea again, true ocean and as many leagues to Asia as to Spain? What if they cannot lead us to Quinsai, Cambaluc or Zaiton, or to the Ganges\u0027 mouth, or Aurea Chersonesus, because they never heard of them, and they have no ships to pass again an Ocean-Sea? What if it is all New, and all the maps have to be redrawn?\" He looked at me as I spoke, steadily and earnestly. What Juan Lepe said was not the first entry into his mind of something like that. But he was held by that great mass of him that was bound by the thinking of the Venerable. He was free far and far beyond most, but to certain things he clung like a limpet. \"The Earthly Paradise!\" he said, and he looked toward that Paria that we thought ran across our south. \"When our first parents left the Earthly Paradise, they and their sons and daughters and all the peoples to come wandered by foot into Chaldea and Arabia. So it could not be!\" His blue-gray eyes under that great brow and shock of white hair regarded the south. This faery island—the Garden he called it—and the Cariari who came to us from the main. One day they saw one of us take out pen and inkhorn and write down their answers to our many questions. Behind us lay the blue sea, before us the deep groves of the islet; between us and the rich shade stood gathered a score of these Indians. They looked at the one seated on the sand, industriously making black marks upon a white sheet. The Indian speaking stopped short and put up an arm in an attitude of defense; another minute and they had all backed from us into the wood. We saw only excited, huddled eyes. Then one started forth, advancing over the sand, and he had a small gourd filled with some powder which he threw before him. He scattered it ceremonially between us and himself and his fellows, a slow, measured rite with muttered words and now and then a sharp, rising note. Cried Juan Sanchez the pilot, \"What\u0027s he doing?\" Juan Lepe answered before he thought, \"He thinks the notary yonder is a magician and the pen his wand. Something is being done to them! Counter-magic.\" \"Then they are enchanters!\" cried Alonso de Zamorro. Our great cluster gave back. \"Fix an arrow and shoot him down!\" That was Diego de Porras. The Adelantado turned sharply. \"Do no such thing! There may be spells, but the worst spell here would be a battle!\" We let fly no arrow, but the belief persisted that here was seen veritably at work the necromancy that all along they had guessed. A party crossed to the main with the Adelantado and pushed a league into as tall and thick and shadowy a forest as ever we met in all our wanderings. Here we found no village, but came suddenly, right in the wood, upon a very great thatched hut, and in it, upon a stone, lay in state a dead cacique. He seemed long dead, but the body had not corrupted; it was saved by some knowledge such as had the Egyptians. A crown of feathers rested upon the head and gold was about the neck. Around the place stood posts and slabs of a dark wood and these were cut and painted with I do not know what of beast and bird and monstrous idol forms. We stared. The place was shadowy and very silent. At last with an oath said Francisco de Porras, \"Take the gold!\" But the Adelantado cried, \"No!\" and going out of the hut that was almost a house we left the dead cacique and his crown and mantle and golden breastplate. Two wooden figures at the door grinned upon us. We saw now what seemed a light brown powder strewed around and across the threshold. One of our men, stooping, took up a pinch then dropped it hastily. \"It is the same they threw against us!\" \"Wizardry! We\u0027ll find harm from them yet!\" That song crept in now at every turn. We sailed from the Garden south by east along the endless coast that no strait broke. At first fair weather ran with us. But the Margarita was so lame! And all our other ships wrenched and worm-pierced. And the Admiral was growing old before our eyes. Not his mind or his soul but his frame. He bettered, left his bed and walked the deck. And then we came to the coast we called the Golden Coast, and his hope spread great wings again, and if our mariners talked of magic it was for a time glistening white. Gold, gold! A deep bay, thronged at the mouth with islets so green and fair, they were marvel to us who were sated with islands great and small. We entered under overhanging trees, and out at once to us shot twenty canoes. The Indians within wore gold in amount and purity far beyond anything in ten years. Oh, our ships could scarce contain their triumph! The Admiral looked a dreamer who comes to the bliss center in his dream. Gold was ever to him symbol and mystery. He did not look upon it as a buyer of strife and envy, idleness and soft luxury; but as a buyer of crusades, ships and ships, discoveries and discoveries, and Christ to enter heathendom. Gold! Discs of great size, half-moons, crescent moons, pierced for a cotton string. Small golden beasts and birds, poorly carved but golden. They traded freely; we gathered gold. And there was more and more, they said, at Veragua, wherever that might be, and south and east it seemed to be. Veragua! We would go there. Again we hoisted sail and in our ships, now all unseaworthy, crept again in a bad wind along the coast of gold,—Costa Rico. At last we saw many smokes from the land. That would be a large Indian village. We beat toward it, found a river mouth and entered. But Veragua must have heard of us from a swift land traveler. When a boat from each ship would approach the land—it was in the afternoon, the sun westering fast—a sudden burst of a most melancholy and awful din came from the forest growing close to water side. One of our men cried \"Wizards!\" The Admiral spoke from the stern of the long boat. \"And what if they be wizards? We may answer, \u0027We are Christians!\u0027\" The furious din continued but now we were nearer. \"Besides,\" he said, \"those are great shells and drums.\" Our rowers held off. Out of the forest on to the narrow beach started several hundred shell-blowing, drum-beating barbarians, marvelously feathered and painted and with bows and arrows and wooden swords. An arrow stuck in the side of our boat, others fell short. The Admiral rose, tall, broad-shouldered, though lean as winter where there is winter, with hair as white as milk. He held in his hand a string of green beads and another of hawk bells which he made to ring, but he did not depend more upon them than upon what he held within him of powerful and pacific. He sent his voice, which he could make deep as a drum and reaching as one of those great shells. \"Friends—friends! Bringing Christ!\" An arrow sang past him. His son would have drawn him down, but, \"No—no!\" and \"Friends—friends! Bringing Christ!\" And whether they thought that \"Christ\" was the beads and the bell, or whether the bowman in him did send over good will and make it to enter their hearts, or whether it was somewhat of both, they did suddenly grow friendly. Whereupon we landed. Gold! We took much gold from this place. One of our men, touched by the sun, sat and babbled. \"Oh, the faithful golden coast! Oh, the gold that is to come! Great golden ships sailing across blue sea! A hundred—no, a thousand—what do I say? A million Indians with baskets long and wide on their backs and the baskets filled with gold! The baskets are so great and the gold so heavy that the Indians are bowed down till they go on all fours. Gold,—a mountain of pure gold and every Spaniard in Spain and a few Italians—golden kings—\" When we had all we could get, up sail and on! Sail on and on along the golden coast of Veragua! Come to a river and land, for all that again we heard drums and those great shells strongly blown. Make peace and trade. And here again was gold, gold, gold. We were now assured that the main was far richer than any island. Turbulent hope,—that was the chief lading now of the four ships. Gold! Gold! Golden moon disks and golden rude figures. We found a lump of gold wrought like a maize ear. What was beyond that, by itself under trees, we found an ancient, broken, true wall, stone and lime. The stones were great ones, set truly, with care. The wall was old; the remainder of house, if house or temple there had been, broken from it. Now the forest overran all. We did not know when or by whom it was built, and we found no more like it. But here was true masonry. All of us said that the world of the main was not the world of the islands. Ciguarre. These Indians declared it was Ciguarre we should seek. Now that we were in Veragua—seek Ciguarre. So we sailed beyond Veragua hunting the strait which we must pass through to Ganges and Ind of old history.","sourceLink":"http://novel.tingroom.com/jingdian/1516/45220.html","bookId":1303,"book":{"id":1303,"title":"1492","description":"简介： THE morning was gray and I sat by the sea near Palos in a gray mood. I was Jayme de Marchena, and that was a good, old Christian name. But my grandmother was Jewess, and in corners they said that she never truly recanted, and I had been much with her...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1516","creation":"Aug 1, 2019 12:24:49 AM","modification":"Aug 1, 2019 12:24:49 AM"}}
