{"id":80911,"no":2,"title":"Page 2","content":"His eyes glide up my body from my jean-clad legs to my bare arms. To where the tattoo, his tattoo, wrapped around my bicep like an anaconda, squeezing the life out of me. “And what if I won’t help you?” I said, rubbing at my parched throat. I was thirsty and the more I thought about what Javier might do if I ever refused him dried me out even more. “I don’t think you’ll refuse,” he said with total confidence. He leaned forward and tapped on the tinted glass that separated the driver from us. “Agua, dos,” he said and the bald-headed driver leaned down and brought out two water bottles. Javier handed one to me and the window went back up. I quickly unscrewed the cap and took a large swig. It was cool and strangely sweet and took a lot to quench my thirst. “And if I refuse?” I repeated, wiping my mouth. He slowly sipped his water, his eyes on me, far too intimate, far too observant. “I have ways of making you see the bigger picture. Now, drink up.” At that, I immediately brought the bottle away from my lips. “So suspicious, Ellie,” he crooned. I felt the bottle slipping out of my hands as I tried to grasp it. He plucked it from me and pressed down on my shoulder so I was back against the seat. His fingers were rougher than I remembered but hot, like they were fueled by a radiator. Everything was starting to go loose and numb. The interior of the car swirled. “Naturally,” he went on, leaning forward and peering into my eyes. “You have a right to be so. Eden White was far too trusting.” My head had lolled back onto the seat. I could see the lightning jags of gold and green meeting his pupils, the tiny lines that formed at the corner of his eyes, the one strand of salt-colored hair that dared to show its face at his widow’s peak. Javier had aged. There was nothing scarier. “Sleep well, my angel.” His voice came to me on a wave of vibration. There were swirls of light and then everything went black. CHAPTER TWO CAMDEN She’d lied. She fucking lied. I should have seen it coming, should have known this wasn’t going to end easily. I should have known it the minute Javier called that there was no way he’d let her go once he had her. He wasn’t weak like me, I’ll give him that. He wasn’t the one left in the rock garden, two assfuck thugs’ meaty hands wrapped around him, holding him in place as he watched her leave. No, that was me. Camden McQueen. I had to watch her leave again, but this wasn’t high school and this wasn’t a hallway. She left me in a cloud of dust, a swirl of crushed cherry blossoms that choked my heart. I must have been screaming in the aftermath, outside of my body with my old friend rage. I hated this part of being me – when I lost it, lost myself – the blackness that settled into my bones, that took over and booted my brain out of my skin. I was seeing everything from another angle and it looked just as fucked from up here. And there was crying. My beautiful son, Ben, just three years old, was crying in his mother’s arms and I knew I needed to get control back. Screaming, fighting, it wasn’t going to solve anything. I had to think about him, and my ex-wife Sophia. I had to think about getting us out of there or getting Javier’s men out of my tattoo parlor, Sins \u0026 Needles. I needed control. I shut my mouth, nearly clamping down on my tongue, as my heart ached and crumbled and slowed in my throat. The tunnel vision ended and suddenly the desert sky was as bright as it had ever been. The SUV – Ellie – was now long gone. “Get your fucking hands off me,” I snarled, jerking out of their grasp. Their stupid, thick fingers finally let go. I turned around and finally got a good look at them. They were both built like linebackers, large heads with nothing inside, programmed to do Javier’s bidding. Pussies to the core. “Are you going to leave or do you want me to call the cops on you?” I asked, knowing I wasn’t about to get my father involved, the sheriff of Palm Valley and someone who could easily out-asshole them while grinding me down in the process. The men exchanged a look but were silent. “That won’t be necessary,” Raul said from behind me, the stairs creaking as he came down. I’d forgotten he had been there, hovering behind Sophia and Ben during the whole transaction like a yellow jacket in a fancy suit. “That is, unless they’re already on their way because of the scene you just caused.” I swallowed down the volcano in my chest and exhaled sharply through my nose as his skinny, catcher’s mitt face came closer. “If you think that was me making a scene, you haven’t seen anything yet.” His smile was wry, it belonged to a prick with empty power. If I wasn’t certain that the thugs were carrying guns, I would have kicked his teeth in. “We’re leaving,” he said, folding his arms across his chest. My eyes focused on the scar at his jaw and for a painful second I saw the ones on Ellie’s leg, felt them under my tattoo gun, under my hands, under my tongue. “Are you?” he continued, snapping me out of it before I could further drown. I glared. “None of your fucking business.” He shrugged like Javier Jr. “If you were a smart man, you’d leave this place. Take your wife and your kid and your dirty money and get out of here.” Ex-wife, I wanted to say but the dirty money comment stung even more. “Or what?” I challenged stupidly. I should have shut my mouth again, just kept it all in and go but I felt like being an annoyance, if anything. He raised his brow. “Or nothing. We,” he nodded at the thugs and their blank, bloated faces, “are done with you.” He jerked his head to the street, where people were driving past like lives weren’t being threatened and ruined and changed before their eyes. The men nodded and the three of them walked past me, out of my trampled rock garden where plants would still continue to thrive even when I left the shop to cobwebs and dust. Because I had to leave, though on no account of Raul. I had to leave because I’d made my decision weeks ago. Raul stopped on the sidewalk, the heat rising off of it. He took a pair of shades out of his jacket pocket and handled them for a moment, his eyes two dark dots in the harsh sun. “But,” he said louder, voice thick, “just because we are done with you, doesn’t mean Javier is. Don’t go looking for her, whatever you do. Or it’s your funeral. And hers.” He slipped the sunglasses on his face and he and the thugs disappeared down the street toward whatever getaway they had planned. Although I believed him when he said he was done with us, it didn’t make me feel any safer. I slowly turned around and looked at Sophia and Ben. She was holding onto his hand, my boy leaning up against her leg. In her other hand was the briefcase full of money. She held onto that just as tightly. Our eyes met, perhaps really, truly, for the first time today. Man, even with her in the shade of the porch, I could see her eyes blazing, full of fire, and not the type I wanted to go up in. Fuck it, there was no avoiding it. I’d avoided this for way too long. After everything – everything – I’d gone through, it was ridiculous that I’d feel the slightest bit scared of my ex-wife. But I was. I could admit it. I’d admit to anything at this point. I was afraid of what she was going to make me feel, of what she couldn’t wait to make me feel. Meanwhile, Ellie was in a car with Javier. Was she afraid too? Was she afraid of what Javier could possibly make her feel? Or, was that fear exclusively mine? I brushed it out of my thoughts like a loose strand of hair and walked up the stairs to them, my fingers flicking past one another, trying to disperse the nervous energy that was building up. I stopped in front of Sophia, on the last step so I was at her level. She was petite, not so much in shape, only height. She was always a foot smaller than me though her hips and thighs had weight to them, something that lured me in all those years ago. “I’m sorry,” I said thickly, my eyes on hers, and meaning it. I never thought she’d let go of the briefcase. And when she did, it landed on the porch with a bang that echoed in the overhang and the next thing that happened was her open palm meeting my face. She hit me fast, a quick draw, one side of my cheekbone, then the other with the back of her hand, catching the corner of my lip. It stung like hell and I sucked in my breath. Because getting angry would do me no good – getting angry was the reason she was my ex-wife. “I deserved that,” I said quietly, avoiding her eyes. “Shut up!’ she cried out, spittle falling out of her mouth. Ben, bless his innocent heart, whimpered and hugged his mother tighter, refusing to cry. “You shut up. You asshole! You …” She trailed off and just when I thought all of this was too much for her, she hit me again. Then she burst into tears, her head hung down, briefcase at her feet. I couldn’t help but look at Ben, my son, who was looking up at me like I was not only a bad man, the bad man that made his mother cry, but a total stranger. I was a stranger to both of them and it didn’t matter how many letters I wrote. We were all lost to each other. “Hey,” I said softly and wrapped my arms around her. She stiffened but let me hold her. I stretched one hand down and placed it on Ben’s head and we stood there for a good few minutes, a family by blood not heart, while she continued to cry. “I don’t even know where to begin,” she said, her voice muffled into my tear-soaked chest. “I did a stupid thing,” I told her, figuring it was better to attempt it or not. “I know,” she said, the edge returning to her voice. She raised her head, her face inches from mine. I remembered how hard it used to be for me to not kiss her and how easy it was now. The bruises around her eye and cheek where someone – Javier? – had hit her were blooming. It made me feel sick all over again. “I’m sorry,” I whispered and she pulled out of my grasp. “I had the best intentions for Ben in mind throughout all of it. I wanted to escape this life, the life your … brothers … put me in.” She wiped hard at her tears like they burned. “You put yourself in that life. You—” “I hit you,” I said and even she looked a bit shocked at the way I admitted it after all this time. I placed my hands on her shoulders and held her firmly, lowering my head, eyeing her closely. “I hit you. There’s no excuse. I’m done excusing myself. I hit you and I hate myself for it and I hate that it ruined what we had. A family. I can never take it back and I have to live with it. I’m sorry, Sophia. Really, truly for what I did to you.” She sniffed, seeming to take it in. I didn’t expect her to forgive me and I didn’t even care if she did. As I said to Ellie once, I didn’t regret the consequences of my actions but I did regret the action. And I had been making excuses for it all this time, blaming Sophia for something that was entirely my fault. My temper, my anger, my old friend rage – I wanted to finally kick it to the curb. I wanted to own it, destroy it. Wasn’t that what second chances were about?","sourceLink":"https://allnovel.net/shooting-scars-the-artists-trilogy-2/page-2.html","bookId":2733,"book":{"id":2733,"title":"Shooting Scars (The Artists Trilogy #2)","description":"Storyline: Shooting Scars (The Artists Trilogy #2) A Dangerous Kind of Love . . . When Ellie Watt offered herself to her thuggish former lover Javier to save Camden\u0027s life, she never imagined the twisted game Javier had planned for her. Trapped by him and his entourage of killers, Ellie is forced to commit a dangerous, heinous crime-or Javier will kill Camden. Now ex-con artist Ellie must find a way to stay ahead of the game . . . before it destroys her and the only man she ever loved. Camden McQueen can\u0027t forget Ellie Watt. Seeking revenge and pursued by the authorities for a crime he didn\u0027t commit, the talented tattoo artist does things he never thought himself capable of to save Ellie. As Camden straddles the line between love and retribution, he vows to do everything in his power to get her back. But if Camden unleashes his dark side, will Ellie still love him?","cover":"https://allnovel.net/images/shooting-scars-the-artists-trilogy-2.jpg","author":"Karina Halle","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/shooting-scars-the-artists-trilogy-2.html","creation":"Oct 5, 2019 8:59:19 AM","modification":"Oct 5, 2019 4:30:22 PM"}}
