{"id":80918,"no":9,"title":"Page 9","content":"My heart was beginning to beat loudly in my head, throwing me off a bit. Was I panicking? Or just getting a major mind fuck?\n Run, my gut screamed at me.\n And so I did. I didn’t have time to get sucked into whatever trap he had planned. He seemed to think I’d be too caught up on old feelings and sentiment to go anywhere but that bitch was wrong. Javier’s betrayal was a learning experience. It taught me to never let my guard down. To never trust men like him.\n I ran across the sand, along the flax and to the path that led between his house and the next. The road was almost at my feet. I had no car but I had memory and I knew if I ran fast enough, long enough, I’d hit up a payphone by the fried chicken joint and then I’d be calling Gus for one big favor.\n Before I could hit the pavement, I hit someone else.\n I shrieked and leaped back. I’d run right into Raul, who was raising his hands like he didn’t mean me any harm though his eyes said otherwise. Pinched and vulture-like, he made my blood curdle.\n “Raul, you’re back,” Javier’s voice came from behind me. Fuck he was fast, my eyes darting to the side of Raul, where freedom lay. I could still run. Raul wouldn’t stop me if Javier wouldn’t.\n “I had to make sure Camden got away in good faith,” he answered, his scars stretching as he talked.\n And the mention of Camden’s name filled my limbs with gravity.\n My jaw clenched. “How is Camden?” I asked, taking the risk, the bait, the whatever.\n Raul looked over my head at Javier, trading a look I couldn’t read. “Oh, he’s fine.”\n I was about to get him to elaborate when Javier spoke. “Fine for now.” His words were laced with grease.\n I turned to face him. That smug son-of-a-bitch look was back on his face.\n “What do you mean, fine for now?”\n Raul walked over to Javier and stood beside him. There was a difference in him now, something that wasn’t there six years ago. Raul had become Javier and Javier had become Travis.\n Javier smiled diplomatically. “Well, you do know our score hasn’t been settled, Ellie. That’s why I gave you the chance to redeem yourself.”\n My head jerked back. “Score?”\n “You stole money of mine. I never saw that money again. In fact, I paid a lot to bring you here. You’ve put me about a hundred grand in the hole.”\n My skin was starting to prickle in hot flashes. “I don’t have a hundred grand. You know this.”\n “You have some money, I saw you in Vegas, pretending to gamble. Lucky for you, I don’t need your money. It’s the principle of the whole thing. You may not feel loyal to me anymore but you should at least feel like you owe me something. Don’t you have some kind of code, or are you just that immoral now?”\n “You’re a fucking pathetic human being,” I jeered, surprised I was even able to form words when my blood was pumping outrage. How dare he insinuate that I was the one with the skewed morals when he was a cold-blooded killer and womanizing, drugging, manhandling bastard.\n He tilted his head and eyed me with fake disappointment like I was a disobedient child. Or maybe it was real and if it was, that was much more fucked up. “Such an angry little angel. Your wings are certainly dirty. They’re black.”\n “Like your heart.”\n “The heart you once wanted. What does that say about you?”\n “It says get to the point. You’re obviously not letting me go. There’s a catch to all of this and it involves Camden and a score. So tell me what the hell it is so I can decide how screwed I am.”\n He raised his brows. “Well, I don’t know how screwed you are, I only know how you liked to be screwed.”\n My upper lip wrinkled. “Sick pig.”\n “This is true,” he said unapologetically. He clapped his hands together, his watch jangling. “Okay, Ellie. You know what I want. I’ve told you repeatedly. I need your help in getting to Travis. And you don’t have to help me, as you now know. But you should understand that I want this bad enough to call in that little score we must settle. You can help me out of good faith. Yet you won’t. Because a woman like you doesn’t have anything good or anything that resembles faith.” He drew out the word faith like it was foreign to him.\n “You done trying to be an asshole or do you want to throw psychopath in there?”\n His features grew hard and I instantly regretted opening my mouth. There was nothing more troubling than Javier when he got serious.\n “Since you won’t help me on your own good conscience,” he said in a clipped voice, “I’m giving you a choice. Just like the one you had before, only, more … detailed. You help me with Travis and in return I’ll settle your debt.”\n “I don’t owe you anything,” I said.\n “Right. Did I mention Camden McQueen is part of your debt now?”\n My heart came to a sudden stop, crashing into my chest, shards of glass in my veins.\n “What?”\n He smiled though it was cold as a gravestone in winter. “I gave Camden money for you. That’s more money I lost. Because of you. And based on that, I see that Camden’s well-being is part of your debt now. Not his ex-wife’s, not his son’s … I can’t be bothered with them. Camden, now, I could destroy him with the snap of my fingers. That is, if you don’t help me. So … what shall it be? Your pride and freedom? Or the chance to save not only a man you think you love, or at least took pity on, but the chance to kill the man who put those scars on your leg and in your heart.”\n You’re the one who left the scars on my heart, I thought to myself. I felt like I was swallowing down a cotton ball. I could barely look at him. “You promised me you wouldn’t hurt Camden, that you would let him go. And you don’t break your promises.”\n He exchanged a satisfied look with Raul before smiling at me. “This is true. I think that’s why I’ve become such a threat to Travis. Because I have my own code that never wavers. Integrity is missing from too many men these days.” He noted my face grow red with anger and went on quickly, “I gave Camden the money. I gave him his wonderful family back. That was what I promised and I did just that. This, Ellie, this is a whole new game with a whole new set of promises. Now, what I need to know is, are you ready to play?”\n I wasn’t ready to play anything, but if I could protect Camden, then I was going to do everything I could.\n CHAPTER SIX\n CAMDEN\n God bless apathetic teenagers. If it wasn’t for the bleached blonde girl who was busy doing her nails a sick shade of green as I paid for my gas and a mound of energy drinks, I wouldn’t have made it to Gus’s. I’d probably have been arrested, my ass thrown in jail for who the fuck knows what anymore.\n The dry and perpetually unamused girl barely glanced at me and certainly never picked up the Los Angeles Times that day. If she had, she would have noticed that yours truly was on the cover. Not a big picture – that was reserved for a report on the country’s economics around Christmas time – but I was there, in the corner, right under the headline ‘Los Angeles Brothers Shot Trying to Stop Domestic Dispute.’\n I so called it.\n After I left the scene of the ambush – Sophia’s set-up – I sped up the I-5 until I’d reached the town of Valencia. I finally checked into a motel under Connor Malloy and started planning my next steps.\n They all involved Gus.\n I brought out the number that Ellie had given me and let it ring a few times before hanging up in fear. What if Gus wanted nothing to do with me without Ellie? What if he wasn’t as trustworthy as Ellie had seemed to think? I barely knew a thing about the guy except that he was an ex-LAPD officer, the same police department that was probably combing Sophia’s apartment for clues. I was glad that I never brought anything into her house except a case of contacts and solution. Everything else had stayed in the car, including the briefcase.\n Gus would have to be worth the risk. I’d have to trust Ellie, even from afar. He was the only way I could find her, somehow I knew this.\n I dialed his number again and this time he picked up gruffly, with a slight accent that I couldn’t place. Maybe Texas or the deep South. It wasn’t obvious but lately I’d been paying more attention to these types of things.\n “Hello?” he’d asked.\n “Is this Gus? Ellie’s Gus?”\n There was a pause. Then, “Is this Connor Malloy?”\n I couldn’t help but smile. “Not quite. I’m getting there.”\n “I’m going to assume from the tone of your voice and the fact that Ellie’s not on the phone, that something’s happened.”\n My smile faded. I clutched the receiver hard and sat up straighter on the motel bed.\n “She’s gone.”\n “On her power?”\n “That … that I don’t know.” I explained, as briefly as I could, what had happened. I left out the part about Sophia and her brothers. That could wait, or so I thought. Besides, I was still too angry and exposed over it. To talk about it, dwell about it, would rub the wound raw.\n Gus seemed concerned but fairly calm about the whole thing. I liked that he didn’t lose his shit over it though at the same time I hoped Ellie was as important to him as I hoped she was.\n “Where are you?” he asked.\n “Ventura,” I lied, picking the closest town that could still have the same area code.\n He grunted then told me his address: 141 Rosewood Drive, Pismo Beach. It sounded too pretty.\n “Meet me tomorrow at noon,” he said, then hung up.\n It was only luck that got me there at noon. After I saw my face in the paper, the same paper I managed to swipe on my way out without the teenager noticing, I kept my face down and my driving calm as I worked my way up the coast. The ocean was glittering like blue scales, the cliff sides were lush with December rains. It was so gorgeously beautiful here in contrast to my life in the desert that my heart thumped for Gualala, for me and Ellie on the beach there, living in the freedom that only the surf can bring.\n I stopped at one empty lookout spot on my way up and got a better look at the newspaper. There were a few things that were wrong about it which might have saved my ass without me knowing it.\n In the statement, Sophia had told the cops about us getting back together in Palm Valley and wanting to start a new life before I turned on her and beat her up. I was in the process of stealing her money, “child support” she was saving, when she called for her brothers to help. One of the brothers was in serious condition in the hospital with a broken larynx (and nose, I was sure, since I busted that fucker up), while the other escaped unscathed. Sophia told the police that I was driving a green ford Mustang but she had no idea what the plate number was. In fact, I was driving an olive green Pontiac GTO with racing stripes. Not at all like a Mustang, not to most people anyway. I was more than grateful for her lack of interest in cars.\n The next thing that saved me thus far was the fact that the picture of me was one of hers. It was from a few years ago, taken at a friend’s picnic. My hair was surfer shaggy and dark brown, no glasses. At that I quickly took my contacts out, flicking them out the GTO’s window and slipped my glasses back on. This wasn’t a Clark Kent thing. The fact that the article stated I had black hair now and I was covered in tattoos was enough to bust me. Most people would be looking at that picture of me, smiling, dimples, younger, so maybe they wouldn’t notice. They’d be looking for him, not clean-cut nerd, not until they got really close and hopefully by then I’d be gone and it would be a case of them shaking their heads in my wake saying, “nah, it couldn’t be.” \n","sourceLink":"https://allnovel.net/shooting-scars-the-artists-trilogy-2/page-9.html","bookId":2733,"book":{"id":2733,"title":"Shooting Scars (The Artists Trilogy #2)","description":"Storyline: \n Shooting Scars (The Artists Trilogy #2) \n A Dangerous Kind of Love . . . \n When Ellie Watt offered herself to her thuggish former lover Javier to save Camden\u0027s life, she never imagined the twisted game Javier had planned for her. Trapped by him and his entourage of killers, Ellie is forced to commit a dangerous, heinous crime-or Javier will kill Camden. Now ex-con artist Ellie must find a way to stay ahead of the game . . . before it destroys her and the only man she ever loved. \n Camden McQueen can\u0027t forget Ellie Watt. Seeking revenge and pursued by the authorities for a crime he didn\u0027t commit, the talented tattoo artist does things he never thought himself capable of to save Ellie. As Camden straddles the line between love and retribution, he vows to do everything in his power to get her back. But if Camden unleashes his dark side, will Ellie still love him?\n \n","cover":"https://allnovel.net/images/shooting-scars-the-artists-trilogy-2.jpg","author":"Karina Halle","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/shooting-scars-the-artists-trilogy-2.html","creation":"Oct 5, 2019 8:59:19 AM","modification":"Oct 5, 2019 4:30:22 PM"}}
