{"id":79288,"no":38,"title":"Page 38","content":"Chapter Forty-two It was Wednesday, just a few days before the wedding. Tomorrow, Taylor and Anika were coming up to Cousins, and so were Josh, Redbird, and my brother. The boys were going to have their so-called bachelor night, and Taylor and Anika and I were just going to hang by the pool. Between Denise Coletti and Taylor, the wedding was pretty much ready to go. The food had been ordered— lobster rolls and shrimp cocktail. We had Christmas lights for the deck and yard. Conrad was going to play a song on the guitar when I walked out with my dad. I was going to wear the jewelry Susannah had left me; I was going to do my own hair and makeup. Everything was coming together, but I still couldn’t shake the feeling that there was something I’d forgotten. I was vacuuming the living room when Conrad pushed open the sliding door. He’d been surfing all morning. I turned off the vacuum cleaner. “What’s wrong?” I asked him. He looked pale, and his hair was dripping in his eyes. “Wipeout,” he said. “I got cut by my fin.” “Bad?” “Nah, not too bad.” I watched him limp over to the bathroom, and I ran over. He was sitting on the sill of the tub, and blood was soaking through his towel and running down his leg. I felt woozy for a split second. “It’s already stopped bleeding,” Conrad said, and his face was as white as the marble counter. He looked like he was going to pass out. “Looks worse than it is.” “Keep putting pressure on it,” I said. “I’m gonna get some stuff to clean it.” It must have really hurt, because he obeyed me. When I came back with hydrogen peroxide and gauze and Bactine, he was still sitting there in the same position, his leg in the tub. I sat down next to him and straddled the sill, facing him. “Let go,” I told him. “I’m fine,” he said. “I’ll do it.” “No, you’re not fine,” I said. Then he let go of the towel, and I pressed down on it. He winced. “Sorry,” I said. I held it for a few minutes, and then I peeled the bloody towel away from his leg. The cut was a 212 · jenny han few inches long and skinny. It wasn’t bleeding as heavily, so I went ahead and started to pour hydrogen peroxide on the wound. “Ow!” he yelped. “Don’t be such a baby, it’s barely a scratch,” I lied. I was wondering if he was going to need stitches. Conrad leaned in closer to me, his head just barely resting on my shoulder as I cleaned. I could feel him breathing in and out, could feel each sharp intake of breath every time I touched the cut. When the cut was clean, it looked a lot better. I dabbed Bactine on it and then wrapped his calf in gauze. Then I patted his knee. “See? All better.” He lifted his head up and said, “Thank you.” “Sure,” I said. There was this moment between us then, of us just looking at each other, holding each other’s gaze. My breath quickened. If I leaned forward just a little, we would be kissing. I knew I should move away, but I couldn’t. “Belly?” I could feel his breath on my neck. “Yeah?” “Will you help me stand up? I’m going to go upstairs and take a nap.” “You’ve lost a lot of blood,” I said, and my voice vibrated off the bathroom tiles. “I don’t think you’re supposed to sleep.” He smiled weakly. “That’s with concussions.” I scrambled up and then pulled him up next to me. “Can you walk?” I asked. “I’ll manage,” he said, limping away from me, his hand on the wall. My T-shirt was damp from his head on my shoulder. Mechanically, I started cleaning up the mess, and my heart was pounding out of my chest. What just happened? What did I almost do? This time wasn’t like with the peaches. This time it was all me. Conrad slept right through dinnertime, and I wondered if I should bring him some food but decided against it. Instead I heated up one of the frozen pizzas I’d bought, and then I spent the rest of the night cleaning the downstairs. I was relieved that everybody would be here tomorrow. It wouldn’t be just me and him anymore. Once Jeremiah was here, everything would go back to normal. Chapter Forty-three Everything did go back to normal. I was normal, Conrad was normal: it was like nothing happened. Because nothing did happen. If he didn’t have a bandage on his leg, I’d have thought I dreamed the whole thing. The boys were all down by the beach, except for Conrad, who couldn’t get water on his leg. He was in the kitchen, getting meat ready for the grill. Us girls were lying by the pool, passing a bag of kettle corn back and forth. Weatherwise, it was a perfect Cousins day. The sun was high and hot, and there were only a few clouds. No rain in the forecast for the next seven days. Our wedding was safe. “Redbird’s kind of cute, no?” Taylor said, adjusting her bikini top. “Gross,” Anika said. “Anybody with a nickname like Redbird—no thank you.” Taylor frowned at her. “Don’t be so judgmental. Belly, what do you think?” “Um … he’s a nice guy. Jeremiah says he’s very loyal.” “See?” Taylor crowed, poking Anika with her toe. Anika gave me a look, and I smiled a sneaky smile and said, “He’s very, very loyal. So what if he’s, like, a smidge Cro-Magnon?” Taylor threw a handful of popcorn at me and, giggling, I tried to catch some with my mouth. “Are we going out with the boys tonight?” Anika asked. “No, they’re doing their own thing. They’re going to some bar with half-off Irish car bombs or something.” “Eww,” Taylor said. Glancing back toward the kitchen, Anika said in a low voice, “You guys never told me how hot Conrad is.” “He’s not that hot,” Taylor said. “He just thinks he is.” “No he doesn’t,” I defended. To Anika, I said, “Tay’s just mad because he never went for her.” “Why would he go for her when he was your man?” “He was never my man,” I whispered. “He was always your man,” Taylor said, spritzing herself with more suntan oil. Firmly, I said, “Not anymore.” For dinner we had steaks and grilled vegetables. It was a grownup kind of meal. Drinking red wine, sitting around a table with all my friends, I felt adult. I was sitting next to Jeremiah, and he had his arm around my chair.And yet.","sourceLink":"https://allnovel.net/we-ll-always-have-summer-summer-3/page-38.html","bookId":2725,"book":{"id":2725,"title":"We\u0027ll Always Have Summer (Summer #3)","description":"Storyline: It\u0027s been two years since Conrad told Belly to go with Jeremiah. She and Jeremiah have been inseparable ever since, even attending the same college-- only, their relationship hasn\u0027t exactly been the happily ever after Belly had hoped it would be. And when Jeremiah makes the worst mistake a boy can make, Belly is forced to question what she thought was true love. Does she really have a future with Jeremiah? Has she ever gotten over Conrad? It\u0027s time for Belly to decide, once and for all, who has her heart forever.","cover":"https://allnovel.net/images/we-ll-always-have-summer-summer-3.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/we-ll-always-have-summer-summer-3.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 4:14:03 PM"}}
