{"id":79298,"no":48,"title":"Page 48","content":"“Come on, man. Please. I’m begging you.” “Why? Because you still love her, right?” He didn’t wait for me to answer. “What I want to know is, if you still had feelings for her, why did you give me the go-ahead, huh? I did the right thing. I didn’t go behind your back. I asked you, straight up. You told me you were over her.” “You weren’t exactly asking for my permission when I walked in on you kissing her in your car. Yeah, I still gave you the go-ahead, because I trusted you to take care of her and treat her right. Then you go ahead and cheat on her in Cabo during spring break. So maybe I should be the one asking if you love her or not.” As soon as I got the last word out, Jere’s fist was connecting with my face, hard. It was like getting hit with a ten-foot wave—all I could hear was the ringing in my ears. I staggered backward. “Good,” I gasped. “Can we get out of here now?” He punched me again. This time I fell to the ground. “Shut up!” he yelled. “Don’t talk to me about who loves Belly more. I’ve always loved her. Not you. You treated her like garbage. You left her so many times, man. You’re a coward. Even now, you can’t admit it to my face.” Breathing hard, I spat out a mouthful of blood and said, “Fine. I love her. I admit it. Sometimes—sometimes I think she’s the only girl I could ever be with. But Jere, she picked you. You’re the one she wants to marry. Not me.” I pulled the envelope out of my pocket, stumbled up, and pushed it at his chest. “Read this. It’s for you, from Mom. For your wedding day.” Swallowing, he tore the envelope open. I watched him as he read, hoping, knowing, my mom would have the right words. She always knew what to say to Jeremiah. Jere started to cry as he read, and I turned my head away. “I’m going back,” he finally said. “But not with you. You’re not my brother anymore. You’re dead to me. I don’t want you at my wedding. I don’t want you in my life. I want you gone.” “Jere—” “I hope you said everything you needed to say to her. Because after this, you’re never seeing her again. Or me. It’s over. You and I are done.” He handed me the letter. “This is yours, not mine.” Then he left. I sat on the bench and opened the paper up. It said, Dear Conrad. And then I started to cry too. Chapter Fifty-five Outside my window, far down the beach, I could see a group of little kids with plastic pails and shovels, digging for sand crabs. Jere and I used to do that. There was this one time, I think I was eight, which meant Jeremiah must have been nine. We’d searched for sand crabs all afternoon, and even when Conrad and Steven came looking for him, he didn’t leave. They said, “We’re going to ride our bikes into town and rent a video game, and if you don’t come with us, you can’t play tonight.” “You can go if you want,” I’d said, feeling wretched because I knew he’d choose to go. Who would choose sandy old sand crabs over a new video game? He hesitated, and then said, “I don’t care.” And then he stayed. I felt guilty but also triumphant, because Jeremiah had chosen me. I was worthy of being chosen over someone else. We played outside until it got dark. We collected our sand crabs in a plastic cup, and then we set them free. We watched them wriggle back into the sand. They all seemed to know exactly where they were going. Some clear destination in mind. Home. That night, Conrad and Steven played their new game. Jeremiah watched them. He didn’t ask if he could play, and I could see how much he wanted to. In my memory he would always be golden. Someone knocked on the door. “Taylor, I need a minute by myself,” I said, turning around. It wasn’t Taylor. It was Conrad. He looked worn down, exhausted. His white linen shirt was wrinkled. So were his shorts. When I looked closer, I saw that his eyes were bloodshot, and I could see a bruise forming on his cheek. I ran over to him. “What happened? Did you guys get into a fight?” He shook his head. “You shouldn’t be in here,” I said, backing away. “Jeremiah’s coming up any minute.” “I know, I just need to say something to you.” I moved back to the window, turning my back on him. “You’ve said plenty. Just go.” I heard him turn the doorknob, and then I heard him close the door again. I thought he’d gone, until I heard him say, “Do you remember infinity?” Slowly, I turned around. “What about it?” Tossing something toward me, he said, “Catch.” I reached out and caught it in the air. A silver necklace. I held it up and examined it. The infinity necklace. It didn’t shine the way it used to; it looked a bit coppery now. But I recognized it. Of course I recognized it. “What is this?” I asked. “You know what it is,” he said. I shrugged. “Nope, sorry.” I could see that he was both hurt and angry. “Okay, then. You don’t remember it. I’ll remind you. I bought you that necklace for your birthday.” My birthday. It had to have been for my sixteenth birthday. It was the only year he ever forgot to buy me a birthday present—the last summer we’d all been together at the beach house, when Susannah was still alive. The next year, when Conrad took off and Jeremiah and I went looking for him, I found it in his desk. And I took it, because I knew it was mine. He took it back later. I never knew when he had bought it or why, I just knew it was mine. Hearing him say it now, that it was my birthday present, touched me in the last place I wanted him to touch me. My heart. I took his hand and put the necklace in his palm. “I’m sorry.” Conrad held the necklace out to me. Softly, he said, “It belongs to you, always has. I was too afraid to give it to you then. Consider it an early birthday gift. Or a belated one. You can do whatever you want with it. I just—can’t keep it anymore.” I was nodding. I took the necklace from him. “I’m sorry for screwing everything up. I hurt you again, and for that I’m sorry. I’m so sorry. I don’t want to do that anymore. So … I’m not going to stay for the wedding. I’m just going to take off now. I won’t see you again, not for a long time. Probably for the best. Being near you like this, it hurts. And Jere”—Conrad cleared his throat and stepped backward, making space between us—“he’s the one who needs you.”","sourceLink":"https://allnovel.net/we-ll-always-have-summer-summer-3/page-48.html","bookId":2725,"book":{"id":2725,"title":"We\u0027ll Always Have Summer (Summer #3)","description":"Storyline: It\u0027s been two years since Conrad told Belly to go with Jeremiah. She and Jeremiah have been inseparable ever since, even attending the same college-- only, their relationship hasn\u0027t exactly been the happily ever after Belly had hoped it would be. And when Jeremiah makes the worst mistake a boy can make, Belly is forced to question what she thought was true love. Does she really have a future with Jeremiah? Has she ever gotten over Conrad? It\u0027s time for Belly to decide, once and for all, who has her heart forever.","cover":"https://allnovel.net/images/we-ll-always-have-summer-summer-3.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/we-ll-always-have-summer-summer-3.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 4:14:03 PM"}}
