{"id":26200,"no":9,"title":"BALAAM\u0027S ASS.","content":"BIBLE ROMANCES.—IX. By G. W. FOOTE. The ass has figured extensively in romance. His long ears and peculiar bray are explained by a story which goes back to the Flood. On that occasion, it is said, the male donkey was inadvertently left outside the ark, but being a good swimmer, he nevertheless managed to preserve his life. After many desperate efforts he at last succeeded in calling out the patriarch\u0027s name, as nearly as the vocal organs of a jackass would allow. \"No-ah, No-ah,\" cried the forlorn beast. Noah\u0027s attention was at last aroused, and on looking out of window to see who was calling, he perceived the poor jackass almost spent and faintly battling with the waves. Quickly opening the window, he caught Neddy by the two ears and hauled him in. This he did with such vigor that Neddy\u0027s aural appendages were considerably elongated; and ever since donkeys have had long ears, and brayed \"No-ah, No-ah\" at the approach of wet weather. For the sake of Christians who are not well acquainted with God\u0027s Word, we add that this story is not in the Bible. Classical scholars and students of modern literature know how the ass has been treated by poets and romancers. The stolid animal has generally been made the subject of comedy. Drunken and impotent Silenus, in the Pagan mythology, joins in the professions of Bacchus on a sober ass, and the patient animal staggers beneath the heavy burden of a fat-paunched tipsy god. Apulius and Lucian transform the hero of their common story into an ass, and in that shape he encounters the most surprising experiences. Voltaire makes an ass play a wonderful part in his \"Pucelle.\" And in all these cases it is worth noticing how the profane wits remember the ass\u0027s relation to Priapian mysteries, from his fabled interruption of the garden-god\u0027s attempt on the nymph Lotis downwards, and assign to him marvellous amatory adventures. Erasmus, in his \"Praise of Folly,\" does not forget the ass, with whom he compares the majority of men for stupidity, obstinacy, and lubricity; nor is the noble animal forgotten by Rabelais, who cracks many a joke and points many a witticism at his expense. Our own genial humorist, Charles Lamb, confesses however to a deep tenderness for Neddy, and dwells with delight on the protection which his thick hide affords against the cruel usuage of man. He has, says Lamb, \"a tegument impervious to ordinary stripes. The malice of a child or a weak hand can make feeble impressions on him. His back offers no mark to a puny foeman. To a common whip or switch his hide presents an absolute-insensibility. You might as well pretend to scourge a schoolboy with a tough pair of leather breeches on.\" Lamb also quotes the following passage from a tract printed in 1595, entitled \"The Noblenesse of the Asse; a Work Rare, Learned, and Excellent\": \"He refuseth no burden; he goes whither he is sent, without any contradiction. He lifts not his foote against any one; he bytes not; he is no fugitive, nor malicious affected. He doth all-things in good sort, and to his liking that hath cause to employ him. If strokes be given him, he cares not for them.\" True, the ass is not much given to kicking or biting, but he has an awkward knack of quietly lying down when he is indisposed to work, and of rolling over with equal quietude if a rider happens to be on his back. But the old author is so enchanted with the \"asse\" that he does not stay to notice this scurvy trick. He even goes on to express his liking for the ass\u0027s bray, calling Neddy \"a rare musitian,\" and saying that \"to heare the musicke of five or six voices changed to so many of asses is amongst them to heare a song of world without end.\" Sterne, in his \"Sentimental Journey,\" has a chapter entitled \"The Dead Ass,\" wherein the animal is lifted into the sphere of pathos. And lastly, Coleridge has some very pious musings on an ass, wherein the animal is lifted into the sphere of religion. Now, dear reader, you begin to see the drift of this long exordium, although my purpose was indeed twofold. First, I wished, after the example of my betters in literature, to give you a slight glimpse of the immense extent of my learning. Secondly, I wished to lead you through the various stages of literary treatment of the ass, from the comic to the pathetic, and finally to-the religious, in order that you might approach in a proper frame of mind the consideration of Balaam\u0027s ass, who is the most remarkable of all the four-legged asses mentioned in the Bible. There were others. Asses were being sought by Saul, the son of Kish, when he found a kingdom of subjects instead. Jesus rode into Jerusalem on an ass, and also apparently on a colt, having probably one leg over each. With the jawbone of an ass Samson slew a thousand Philistines; and if the rest of the animal accorded with that particular bone, he must have been a tough ass indeed. But all these are of little interest or importance beside the wonderful ass of the prophet Balaam, whose history is contained, with that of his master, in the twenty-second, twenty-third, and twenty-fourth chapters of the Book of Numbers. Soon after the Wandering Jews in the desert were plagued by \"fiery serpents\" for asking Moses to give them a slight change in their monotonous bill of fare, they warred against the Amorites and pretty nearly exterminated them. Whereupon Balak the son of Zippor, king of Moab, grew \"sore afraid.\" He called together the \"elders of Midian\" with those of Moab, and said that in his opinion the Jews would lick them all up as the ox licked up the grass of the field. Against such a ferocious gang as the Jews, with a bloody God of Battles to help them, human valor promised little success; so Balak resolved to solicit supernatural aid. Accordingly he sent messengers unto Balaam the son of Beor, a renowned and potent soothsayer, desiring him to come and curse the people of Israel. The King had implicit confidence in Balaam. \"Whom thou blessest,\" said he, \"is blessed, and whom thou cursest is cursed.\" This great prophet must have wrought prodigious wonders in his time to gain so magnificent a reputation; and if the king\u0027s panegyric on him was true, he must have been a dangerous person to those who annoyed him and made him swear. The \"elders of Moab and the elders of Midian,\" who were Balak\u0027s messengers, went to Pethor, where Balaam resided. As the reader might expect, they did not go empty-handed, but took with them \"the rewards of divination.\" What these were we are not told. No doubt they were very handsome. The prophetical business requires large profits to compensate for the absence of quick returns; and in any case it is not to be supposed that a man who can do what no one else can, will begin work without a heavy retaining fee. We conclude that Balaam, like nearly every prophet mentioned in history, had a good eye for the main chance, and did not trust very much in the bounty of the gods. He was never hard up for bread and cheese while other people were hard up for divine assistance, and as that was an ignorant and credulous age, we presume that his larder was well-stocked. He must, indeed, have had a fine time, for he was the biggest pot in his own line of business in all that district. Balaam knew his business well. It would never do for a prophet, a soothsayer, a wizard, or a diviner, to give prompt answers to his applicants, or even to make his answers plain when he does give them. That would render the profession cheap and rob it of mystery. So Balaam, therefore, said to the messengers, \"Lodge here this night, and I will bring you word again, as the Lord shall speak unto me.\" Now this reference to the Lord is very surprising. The Moabites worshipped Baal, and no doubt they had the utmost contempt for Jehovah. Yet Balaam, who was a prophet of their religion, tells them that he will consult the god of Israel on the subject of their visit! This is one of the self-contradictions with which the Bible abounds. The next incident of the story is no less remarkable. God, the infinite spirit of the universe, paid Balaam a visit; and although he knows everything, past, present, and to come, he asked the prophet \"What men are these with thee?\" Balaam gave a straightforward reply, for he doubtless knew that prevarication and subterfuge were useless with God. Said he, \"Balak the son of Zippor, King of Moab, has sent unto me, saying, Behold there is a people come out of Egypt, which covereth the face of the earth: come now, curse me them; peradventure I shall be able to overcome them and drive them out.\" The precision of Balaam\u0027s language is admirable, and so is its accuracy. He neither desired to keep the Lord in suspense, nor to leave him in ignorance of necessary details. God\u0027s answer was equally brief and perspicuous: \"Thou shalt not go with them; thou shalt not curse the people: for they are blessed.\" This interview between God and Balaam, like the following ones, occurred in the night. The Lord seems to have been always afraid of daylight, or else to have had a peculiar fondness for the dark. Perhaps he thought that during the night there was less chance of the conversation being interrupted, and it is well known that the Lord loves privacy and does not like conversing with more than one at a time. He agrees with us that \"two\u0027s company and three\u0027s none.\" In the morning Balaam got out of bed and told Balak\u0027s messengers to return and say that the Lord would not let him come; and they at once set out for the capital. Balak, however, was not to be so easily put off. He seems to have regarded the prophet\u0027s talk about the Lord\u0027s prohibition as \"all my eye.\" \"Perhaps,\" said he to himself, \"my messengers were small fry in the sight of Balaam, and he is therefore displeased. My presents also may have been too small I should have recollected that Balaam has a very exalted opinion of himself, and is renowned for his avarice. What a stupid I was, to-be sure. However, I\u0027ll try again. This time I\u0027ll send a deputation of big guns, and promise him great wealth and high position in the state. He can\u0027t refuse such a tempting offer.\" Straight-way he \"sent yet again princes, more and more honorable\" than those who went before, and commanded them to urge Balaam to let nothing hinder him from coming. Balaam slightly resented this treatment. He told the messengers-that if Balak would give him his house full of silver and gold, he could not go beyond the word of the Lord, to do more or less. Yet he apparently deemed it politic to make another trial. He was, of course, quite aware that God is unchangeable, but somehow he thought the Lord might alter his mind. So he bade the messengers to tarry there that night while he consulted God afresh. Balaam\u0027s expectation was realised. The Lord did change his mind. He \"came unto Balaam at night, and said unto him, If the men come to call thee, rise up and go with them; but yet the word which I shall say unto thee, that shalt thou do.\" So the prophet rose up in the morning, saddled and mounted his wonderful ass, and went off with the princes of Moab. Poor Balaam, however, did not reflect that as the Lord had changed his mind once he might change it twice, and the omission very nearly cost him his life. He was unfortunately ignorant of what happened to Moses on a similar occasion. After the Lord had dispatched the Jewish prophet to Egypt to rescue his people from bondage, he met him at an inn, where perhaps they both put up for the night, and sought to kill him. The same thing happened now. No sooner had Balaam set out on his journey than \"God\u0027s anger was kindled against him because he went.\" This Jehovah is a queer God and dreadfully hard to please. If you don\u0027t obey his orders you run the risk of being damned, and if you do you stand a good chance of being murdered. The only safe course is to get out of his way and have nothing to do with him. The \"angel of the Lord\" stood in Balaam\u0027s path, with a drawn sword in his hand, ready to kill the prophet whose only crime was having done exactly what he was told. But neither Balaam nor his two servants saw him. The ass, however, had better eyesight. Being only an ass, and not a man, he had a greater aptitude for seeing angels. Not liking the look of this formidable stranger, Neddy bolted from the pathway into a field. Balaam, who saw no reason for such behavior except sheer perverseness, began to whack his ass and tried to turn him * into the right road. Neddy succumbed to this forcible argument and jogged on again. The angel of the Lord had apparently, in the meantime, made himself invisible even to a jackass. His intention was ultimately to kill Balaam, but he delayed the fatal stroke in order to make the most of the comedy which he foresaw. Going a little in front, he \"stood in a path of the vineyards, a wall being on this side, and a wall on that\" Neddy caught sight of the angel again, and being unable this time to bolt into the field, he lurched against the wall, and gave Balaam\u0027s foot a good scrunching. Still the prophet suspected nothing out of the common, for that was an ordinary trick of refractory asses. Poor Neddy, therefore, got another thrashing. Then the angel of the Lord went on further, and \"stood in a narrow place, where there was no way to turn either to the right hand or to the left.\" Neddy estimated the certain penalty of refusing to proceed and the probable penalty of going forward. After comparing them he decided to stop where he was, and then quietly laid down. Balaam\u0027s anger was once more kindled by this stupid obstinacy, and he whacked the ass again with his staff. * Balaam\u0027s ass was a \"she,\" but the sex is immaterial, and as we commenced with the masculine gender we will continue with it. Then the Lord intervened, and brought about the most extraordinary incident of this wonderful story. He \"opened the mouth of the ass,\" and lo! instead of braying Neddy spoke. Without a note of preparation he began to upbraid his master in good Moabitish. \"What have I done,\" said he, \"that thou hast smitten me these three times.\" Singular to relate, Balaam was not in the least astonished at hearing an ass speak. He took it as quite an ordinary occurrence. One is almost inclined to think that the prophet and his donkey had held many a conversation before. In the Bible no one ever is astonished at anything, however wonderful. When the serpent accosted Eve in the garden of Eden, she was not at all surprised, but went on with the colloquy as though talking serpents were common things. If a dumb animal were nowadays to address a man with \"How d\u0027ye do?\" he would certainly be very much startled; but when the same thing occurred in the old Bible days, the man at once replied \"Very well, thank you, how are you?\" Balaam promptly answered the ass\u0027s question. \"Because,\" said he, \"thou hast mocked me: I would there were a sword in mine hand, for now would I kill thee.\" Then the ass rejoined, \"Am not I thine ass, upon which thou hast ridden ever since I was thine unto this day? Was I ever wont to do so unto thee?\" This was a poser. Balaam scratched his head and reflected, but at last he was obliged to say \"Nay.\" Neddy had so far the best of the argument. But Balaam had the practical argument of the stick left, and no doubt he was about to convince the donkey with it. All arguments, practical or otherwise, would however have left the dispute exactly where it stood. Neddy saw the angel, and that was enough for him. Balaam did not see the angel, but only Neddy\u0027s obstinate stupidity. In short, they reasoned from different premises, and could not therefore arrive at the same conclusion. They might have argued till doomsday had not the Lord again intervened. He \"opened Balaam\u0027s eyes,\" so that he also \"saw the angel of the Lord standing in the way, and his sword drawn in his hand.\" Then Balaam \"bowed his head, and fell flat on his face,\" and there he and Neddy laid side by side, two asses together. Now, dear reader, you will observe that the ass, being indeed an ass, saw the angel first, and that Balaam, who was a wise man, did not see the angel until his wits were disordered by the wonder of a talking donkey. Does this not bear out great Bacon\u0027s remark that \"in all superstition, wise men follow fools\"? And may we not say, that if asses did not see angels first, wise men would never see them after? The angel of the Lord said to Balaam, while he remained flat on his face, \"Wherefore hast thou smitten thine ass these three times? behold, I went out to withstand thee, because thy way is perverse before me: and the ass saw me, and turned from me these three times: unless she had turned from me, surely now also I had slain thee, and saved her alive.\" The moral of this is that asses stand the best chance of salvation, and that wise men run a frightful risk of damnation until they lose their wits. Balaam recognised the awful mess he was in, and being by this time as limp as a wet rag, he made the most abject apology. \"I have sinned,\" he said, \"for I knew not that thou stoodest in the way against me.\" This strange reasoning shows still more clearly how the poor prophet had taken leave of his senses. He had not sinned at all, for he was strictly obeying God\u0027s commands; nor was it his fault that the angel remained so long invisible. When the Lord \"opened his eyes,\" and made his vision like unto the vision of an ass, he saw the angel plainly enough; and how could he possibly have done so before? \"I\u0027ll go back,\" added Balaam, thinking that if he sinned so greatly in going forward, he had better return home. But the angel of the Lord, who had intended to kill him for advancing, now told him to \"go with the men.\" And Balaam went with them, keeping his weather eye open during the rest of the journey. Balak was heartily glad to see Balaam. The prophet had been a long time coming, but better late than never. The next day they went \"up into the high places of Baal,\" from which they could see the utmost part of the people of Israel. \"There they are,\" said Balak, \"confound them! leprous slaves out of Egypt, bent on stealing other people\u0027s lands, and sticking to all they can lay hands on; bloodthirsty vagabonds, who fight people with whom they have no quarrel, and kill men, women, and children when they are victorious. Now, Balaam, do your duty. Curse them, and lay it on thick.\" Seven altars were built, and seven oxen and seven rams sacrificed on them. But all this good meat was wasted, for when Balaam \"went to an high place,\" God met him, according to agreement, and told him what to say. And lo! when the prophet returned to the king, he blessed the Jews instead of cursing them. \"Hullo, Balaam, what\u0027s this?\" cried the king. \"I asked you to curse my enemies and you\u0027ve gone and blessed them. What d\u0027ye mean?\" \"True,\" answered Balaam, \"but I told you that I could only speak what the Lord put into my mouth.\" Balak appears to have been just as sceptical as Pharaoh about the God of the Jews. He attributed his disappointment to a freak of the prophet, and not being easily baffled he resolved to try again. So he took Balaam up another high place, and built seven fresh altars, and sacrificed on them seven more bullocks and rams; after which he repeated his invitation. Again Balaam went farther to consult the Lord, whom he found waiting for him, and received his instructions. And lo! when he returned to Balak he again blessed the Jews instead of cursing them. Balak resolved to try again. He took Balaam to another high place, built seven more altars, and sacrificed seven more bullocks and seven more rams. But again the prophet blessed Israel, and a third time the king was sold. Then he gave it up, and Balaam and his ass went home. What became of the ass is unknown. Perhaps he went into the prophetical business himself, and eventually retired on a very handsome fortune. Perhaps he went about as a preacher of the gospel as it was then understood; in which case, judging from the rule of success in later ages, we have no doubt that he attracted large audiences and delighted all who were fortunate enough to sit under him. And when he died all the two-legged asses in Moab probably wept and refused to be comforted. Balaam\u0027s end was tragic. The thirteenth chapter of Joshua informs us that he was eventually slain by the very people he had thrice blessed. After an account of one of the bloody wars of Jehovah\u0027s bandits we read that \"Balaam also the son of Beor, the sooth-sayer, did the children of Israel slay with the sword among them that were slain by them.\" The angel of the Lord spared him, but God\u0027s butchers cut his throat at last. On the whole he might as well have cursed the Jews up and down to Balak\u0027s satisfaction, and taken the handsome rewards which were offered him on such easy terms. Here endeth the story of Balaam\u0027s Ass. I hope my reader still believes it, for if not, he will be reprobate while he lives and damned when he dies. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3219/87802.html","bookId":707,"book":{"id":707,"title":"Bible Romances","description":"简介： The Book of Genesis is generally thought, as Professor Huxley says, to contain the beginning and the end of sound science. The mythology of the Jews is held to be a divine revelation of the early history of man, and of the cosmic changes preparatory...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3219","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
