{"id":7122,"no":9,"title":"Chapter 9","content":"9:1 [hgb] 示 巴 女 王 听 见 所 罗 门 的 名 声 ， 就 来 到 耶 路 撒 冷 ， 要 用 难 解 的 话 试 问 所 罗 门 。 跟 随 她 的 人 甚 多 ， 又 有 骆 驼 驮 着 香 料 ， 宝 石 ， 和 许 多 金 子 。 她 来 见 了 所 罗 门 ， 就 把 心 里 所 有 的 对 所 罗 门 都 说 出 来 。 \n [kjv] And when the queen of Sheba heard of the fame of Solomon, she came to prove Solomon with hard questions at Jerusalem, with a very great company, and camels that bare spices, and gold in abundance, and precious stones: and when she was come to Solomon, she communed with him of all that was in her heart. \n [bbe] Now the queen of Sheba, hearing great things of Solomon, came to Jerusalem to put his wisdom to the test with hard questions; and with her came a very great train, and camels weighted down with spices, and great stores of gold and jewels: and when she came to Solomon she had talk with him of everything in her mind. \n 9:2 [hgb] 所 罗 门 将 她 所 问 的 都 答 上 了 ， 没 有 一 句 不 明 白 ， 不 能 答 的 。 \n [kjv] And Solomon told her all her questions: and there was nothing hid from Solomon which he told her not. \n [bbe] And Solomon gave her answers to all her questions; there was no secret which he did not make clear to her. \n 9:3 [hgb] 示 巴 女 王 见 所 罗 门 的 智 慧 和 他 所 建 造 的 宫 室 ， \n [kjv] And when the queen of Sheba had seen the wisdom of Solomon, and the house that he had built, \n [bbe] And when the queen of Sheba had seen the wisdom of Solomon, and the house which he had made, \n 9:4 [hgb] 席 上 的 珍 馐 美 味 ， 群 臣 分 列 而 坐 ， 仆 人 两 旁 侍 立 ， 以 及 他 们 的 衣 服 装 饰 ， 酒 政 ， 和 酒 政 的 衣 服 装 饰 ， 又 见 他 上 耶 和 华 殿 的 台 阶 ， 就 诧 异 得 神 不 守 舍 ， \n [kjv] And the meat of his table, and the sitting of his servants, and the attendance of his ministers, and their apparel; his cupbearers also, and their apparel; and his ascent by which he went up into the house of the LORD; there was no more spirit in her. \n [bbe] And the food at his table, and all his servants seated there, and those who were waiting on him in their places, and their robes, and his wine-servants and their robes, and the burned offerings which he made in the house of the Lord, there was no more spirit in her. \n 9:5 [hgb] 对 王 说 ， 我 在 本 国 里 所 听 见 论 到 你 的 事 和 你 的 智 慧 实 在 是 真 的 。 \n [kjv] And she said to the king, It was a true report which I heard in mine own land of thine acts, and of thy wisdom: \n [bbe] And she said to the king, The account which was given to me in my country of your acts and your wisdom was true. \n 9:6 [hgb] 我 先 不 信 那 些 话 ， 及 至 我 来 亲 眼 见 了 ， 才 知 道 你 的 大 智 慧 。 人 所 告 诉 我 的 ， 还 不 到 一 半 。 你 的 实 迹 越 过 我 所 听 见 的 名 声 。 \n [kjv] Howbeit I believed not their words, until I came, and mine eyes had seen it: and, behold, the one half of the greatness of thy wisdom was not told me: for thou exceedest the fame that I heard. \n [bbe] But I had no faith in what was said about you, till I came and saw for myself; and truly, word was not given me of half your great wisdom; you are much greater than they said. \n 9:7 [hgb] 你 的 群 臣 ， 你 的 仆 人 常 侍 立 在 你 面 前 听 你 智 慧 的 话 是 有 福 的 。 \n [kjv] Happy are thy men, and happy are these thy servants, which stand continually before thee, and hear thy wisdom. \n [bbe] Happy are your wives and happy these your servants whose place is ever before you, hearing your words of wisdom. \n 9:8 [hgb] 耶 和 华 你 的 神 是 应 当 称 颂 的 。 他 喜 悦 你 ， 使 你 坐 他 的 国 位 ， 为 耶 和 华 你 的 神 作 王 。 因 为 你 的 神 爱 以 色 列 人 ， 要 永 远 坚 立 他 们 ， 所 以 立 你 作 他 们 的 王 ， 使 你 秉 公 行 义 。 \n [kjv] Blessed be the LORD thy God, which delighted in thee to set thee on his throne, to be king for the LORD thy God: because thy God loved Israel, to establish them for ever, therefore made he thee king over them, to do judgment and justice. \n [bbe] Praise be to the Lord your God whose pleasure it was to put you on the seat of his kingdom to be king for the Lord your God: because, in his love for Israel, it was the purpose of your God to make them strong for ever, he made you king over them, to be their judge in righteousness. \n 9:9 [hgb] 于 是 示 巴 女 王 将 一 百 二 十 他 连 得 金 子 和 宝 石 ， 与 极 多 的 香 料 送 给 所 罗 门 王 。 她 送 给 王 的 香 料 ， 以 后 再 没 有 这 样 的 。 \n [kjv] And she gave the king an hundred and twenty talents of gold, and of spices great abundance, and precious stones: neither was there any such spice as the queen of Sheba gave king Solomon. \n [bbe] And she gave the king a hundred and twenty talents of gold, and a great store of spices and jewels: never had such spices been seen as the queen of Sheba gave to Solomon. \n 9:10 [hgb] 希 兰 的 仆 人 和 所 罗 门 的 仆 人 从 俄 斐 运 了 金 子 来 ， 也 运 了 檀 香 木 （ 或 作 乌 木 。 下 同 ） 和 宝 石 来 。 \n [kjv] And the servants also of Huram, and the servants of Solomon, which brought gold from Ophir, brought algum trees and precious stones. \n [bbe] And the servants of Huram and the servants of Solomon, in addition to gold from Ophir, came back with sandal-wood and jewels. \n 9:11 [hgb] 王 用 檀 香 木 为 耶 和 华 殿 和 王 宫 作 台 ， 又 为 歌 唱 的 人 作 琴 瑟 。 犹 大 地 从 来 没 有 见 过 这 样 的 。 \n [kjv] And the king made of the algum trees terraces to the house of the LORD, and to the king\u0027s palace, and harps and psalteries for singers: and there were none such seen before in the land of Judah. \n [bbe] And with the sandal-wood the king made steps for the house of the Lord and for the king\u0027s house, and instruments of music for the makers of melody; never before had such been seen in the land of Judah. \n 9:12 [hgb] 所 罗 门 王 按 示 巴 女 王 所 带 来 的 ， 还 她 礼 物 ， 另 外 照 她 一 切 所 要 所 求 的 ， 都 送 给 她 。 于 是 女 王 和 她 臣 仆 转 回 本 国 去 了 。 \n [kjv] And king Solomon gave to the queen of Sheba all her desire, whatsoever she asked, beside that which she had brought unto the king. So she turned, and went away to her own land, she and her servants. \n [bbe] And King Solomon gave the queen of Sheba all her desire, whatever she made request for, in addition to what she had taken to the king. So she went back to her country with her servants. \n 9:13 [hgb] 所 罗 门 每 年 所 得 的 金 子 共 有 六 百 六 十 六 他 连 得 ， \n [kjv] Now the weight of gold that came to Solomon in one year was six hundred and threescore and six talents of gold; \n [bbe] Now the weight of gold which came to Solomon in one year was six hundred and sixty-six talents; \n 9:14 [hgb] 另 外 还 有 商 人 所 进 的 金 子 ， 并 且 亚 拉 伯 诸 王 与 属 国 的 省 长 都 带 金 银 给 所 罗 门 。 \n [kjv] Beside that which chapmen and merchants brought. And all the kings of Arabia and governors of the country brought gold and silver to Solomon. \n [bbe] And in addition to what he got from traders of different sorts, all the kings of Arabia and the rulers of the country gave gold and silver to Solomon. \n 9:15 [hgb] 所 罗 门 王 用 锤 出 来 的 金 子 打 成 挡 牌 二 百 面 ， 每 面 用 金 子 六 百 舍 客 勒 。 \n [kjv] And king Solomon made two hundred targets of beaten gold: six hundred shekels of beaten gold went to one target. \n [bbe] And King Solomon made two hundred body-covers of hammered gold, every one having six hundred shekels of gold in it. \n 9:16 [hgb] 又 用 锤 出 来 的 金 子 打 成 盾 牌 三 百 面 ， 每 面 用 金 子 三 百 舍 客 勒 ， 都 放 在 利 巴 嫩 林 宫 里 。 \n [kjv] And three hundred shields made he of beaten gold: three hundred shekels of gold went to one shield. And the king put them in the house of the forest of Lebanon. \n [bbe] And he made three hundred smaller body-covers of hammered gold, using three hundred shekels of gold for every cover, and the king put them in the house of the Woods of Lebanon. \n 9:17 [hgb] 王 用 象 牙 制 造 一 个 大 宝 座 ， 用 精 金 包 裹 。 \n [kjv] Moreover the king made a great throne of ivory, and overlaid it with pure gold. \n [bbe] Then the king made a great ivory seat, plated with the best gold. \n 9:18 [hgb] 宝 座 有 六 层 台 阶 ， 又 有 金 脚 凳 ， 与 宝 座 相 连 。 宝 座 两 旁 有 扶 手 ， 靠 近 扶 手 有 两 个 狮 子 站 立 。 \n [kjv] And there were six steps to the throne, with a footstool of gold, which were fastened to the throne, and stays on each side of the sitting place, and two lions standing by the stays: \n [bbe] There were six steps up to it, and a foot-rest of gold fixed to it, and arms on the two sides of the seat, with two lions at the side of the arms. \n 9:19 [hgb] 六 层 台 阶 上 有 十 二 个 狮 子 站 立 ， 每 层 有 两 个 ， 左 边 一 个 ， 右 边 一 个 。 在 列 国 中 没 有 这 样 作 的 。 \n [kjv] And twelve lions stood there on the one side and on the other upon the six steps. There was not the like made in any kingdom. \n [bbe] And twelve lions were placed on one side and on the other side on the six steps: there was nothing like it in any kingdom. \n 9:20 [hgb] 所 罗 门 王 一 切 的 饮 器 都 是 金 的 ， 利 巴 嫩 林 宫 里 的 一 切 器 皿 都 是 精 金 的 。 所 罗 门 年 间 ， 银 子 算 不 了 什 么 。 \n [kjv] And all the drinking vessels of king Solomon were of gold, and all the vessels of the house of the forest of Lebanon were of pure gold: none were of silver; it was not any thing accounted of in the days of Solomon. \n [bbe] All King Solomon\u0027s drinking-vessels were of gold, and all the vessels of the house of the Woods of Lebanon were of the best gold: no one gave a thought to silver in the days of Solomon. \n 9:21 [hgb] 因 为 王 的 船 只 与 希 兰 的 仆 人 一 同 往 他 施 去 。 他 施 船 只 三 年 一 次 装 载 金 ， 银 ， 象 牙 ， 猿 猴 ， 孔 雀 回 来 。 \n [kjv] For the king\u0027s ships went to Tarshish with the servants of Huram: every three years once came the ships of Tarshish bringing gold, and silver, ivory, and apes, and peacocks. \n [bbe] For the king had Tarshish-ships sailing with the servants of Huram: once every three years the Tarshish-ships came back with gold and silver, ivory and monkeys and peacocks. \n 9:22 [hgb] 所 罗 门 王 的 财 宝 与 智 慧 胜 过 天 下 的 列 王 。 \n [kjv] And king Solomon passed all the kings of the earth in riches and wisdom. \n [bbe] And King Solomon was greater than all the kings of the earth in wealth and in wisdom. \n 9:23 [hgb] 普 天 下 的 王 都 求 见 所 罗 门 ， 要 听 神 赐 给 他 智 慧 的 话 。 \n [kjv] And all the kings of the earth sought the presence of Solomon, to hear his wisdom, that God had put in his heart. \n [bbe] And all the kings of the earth came to see Solomon and to give ear to his wisdom, which God had put into his heart. \n 9:24 [hgb] 他 们 各 带 贡 物 ， 就 是 金 器 ， 银 器 ， 衣 服 ， 军 械 ， 香 料 ， 骡 马 ， 每 年 有 一 定 之 例 。 \n [kjv] And they brought every man his present, vessels of silver, and vessels of gold, and raiment, harness, and spices, horses, and mules, a rate year by year. \n [bbe] And everyone took with him an offering, vessels of silver and vessels of gold, and robes, and coats of metal, and spices, and horses and beasts for transport, regularly year by year. \n 9:25 [hgb] 所 罗 门 有 套 车 的 马 四 千 棚 ， 有 马 兵 一 万 二 千 ， 安 置 在 屯 车 的 城 邑 和 耶 路 撒 冷 ， 就 是 王 那 里 。 \n [kjv] And Solomon had four thousand stalls for horses and chariots, and twelve thousand horsemen; whom he bestowed in the chariot cities, and with the king at Jerusalem. \n [bbe] Solomon had four thousand buildings for his horses and his war-carriages, and twelve thousand horsemen whom he kept, some in the carriage-towns and some with the king in Jerusalem. \n 9:26 [hgb] 所 罗 门 统 管 诸 王 ， 从 大 河 到 非 利 士 地 ， 直 到 埃 及 的 边 界 。 \n [kjv] And he reigned over all the kings from the river even unto the land of the Philistines, and to the border of Egypt. \n [bbe] And he was ruler over all the kings from the River to the land of the Philistines, as far as the limit of Egypt. \n 9:27 [hgb] 王 在 耶 路 撒 冷 使 银 子 多 如 石 头 ， 香 柏 木 多 如 高 原 的 桑 树 。 \n [kjv] And the king made silver in Jerusalem as stones, and cedar trees made he as the sycomore trees that are in the low plains in abundance. \n [bbe] The king made silver as common as stones in Jerusalem and cedars like the sycamore-trees of the lowlands in number. \n 9:28 [hgb] 有 人 从 埃 及 和 各 国 为 所 罗 门 赶 马 群 来 。 \n [kjv] And they brought unto Solomon horses out of Egypt, and out of all lands. \n [bbe] They got horses for Solomon from Egypt and from every land. \n 9:29 [hgb] 所 罗 门 其 余 的 事 ， 自 始 至 终 ， 不 都 写 在 先 知 拿 单 的 书 上 和 示 罗 人 亚 希 雅 的 预 言 书 上 ， 并 先 见 易 多 论 尼 八 儿 子 耶 罗 波 安 的 默 示 书 上 吗 ？ \n [kjv] Now the rest of the acts of Solomon, first and last, are they not written in the book of Nathan the prophet, and in the prophecy of Ahijah the Shilonite, and in the visions of Iddo the seer against Jeroboam the son of Nebat? \n [bbe] Now the rest of the acts of Solomon, first and last, are they not recorded in the history of Nathan the prophet, and in the words of Ahijah the prophet of Shiloh, and in the visions of Iddo the seer about Jeroboam, the son of Nebat? \n 9:30 [hgb] 所 罗 门 在 耶 路 撒 冷 作 以 色 列 众 人 的 王 共 四 十 年 。 \n [kjv] And Solomon reigned in Jerusalem over all Israel forty years. \n [bbe] Solomon was king over Israel in Jerusalem for forty years. \n 9:31 [hgb] 所 罗 门 与 他 列 祖 同 睡 ， 葬 在 他 父 大 卫 城 里 。 他 儿 子 罗 波 安 接 续 他 作 王 。 \n [kjv] And Solomon slept with his fathers, and he was buried in the city of David his father: and Rehoboam his son reigned in his stead. \n [bbe] And Solomon went to rest with his fathers, and was put into the earth in the town of David his father; and Rehoboam his son became king in his place. \n \n","sourceLink":"http://novel.tingroom.com/shuangyu/88/1417.html","bookId":232,"book":{"id":232,"title":"Chronicles历代志下","description":"简介： 大 卫 的 儿 子 所 罗 门 国 位 坚 固 。 耶 和 华 他 的 神 与 他 同 在 ， 使 他 甚 为 尊 大 。 And Solomon the son of David was strengthened in his kingdom, and the LORD his God was with him, and magnified him exceedingly. 所 罗 门 吩 咐 以 色 列 众 人 ， 就 是 ...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/88","creation":"Aug 1, 2019 12:18:25 AM","modification":"Aug 1, 2019 12:23:45 AM"}}
