{"id":72828,"no":33,"title":"Page 33","content":"So that’s what they’re telling everyone.\\n\\n She smiles, wipes a tear from her cheek. “But you’re okay. It was a mistake. I should have known better than to listen to my mother; she has one foot in a fantasy novel at all times. What really happened? Did you have to go to the hospital to get looked at? Like when Carmilla Tilmaker swallowed a dead bramble fly in kinder year.”\\n\\n What really happened?\\n\\n Now it’s my turn to be somber. I am too exhausted to cry. Is that normal? To be orphaned and not grasp the magnitude of such a word, let alone expend any emotion over it? “I was ill, but I’m okay now. Lex and Alice are fine.”\\n\\n She plays with a lock of my hair, waiting for me to go on.\\n\\n “Pen?” I stare at her knees and mine. “What if there were a way off this city, and I told you I was going to take it? Would you file to have me declared irrational?”\\n\\n She doesn’t answer. There’s no way she could already know about the mechanical bird or the conspiracy or any of those things, but she knows me. She knows that something is coming.\\n\\n “I can’t stay here,” I say. “I wasn’t even supposed to come out, but I had to”—say good-bye—“see the stars again.” I can’t imagine they’ll be this pretty from the ground. On the ground, the history book says, the humans have infinite land to fill with buildings; and the scopes show us that they make their own lights, and the stars mean nothing to them. But up here, we see them, as clear as lightbugs that float in the air around our heads.\\n\\n Pen and I raise our heads and look at each other. “Come out from where?” she asks.\\n\\n I listen for some sign that Judas is still nearby, but though I know he’s watching me, he’s silent. It’s as though I can feel him willing me not to say another word about it.\\n\\n And he needn’t worry. I won’t tell. But it isn’t to protect the metal bird or the rebellion. It’s because of what she said that night on the train platform. She told me I needed to stop thinking about the ground. She said that she didn’t want to know what was beyond Internment.\\n\\n We aren’t the greatest things to exist. I can’t believe that. I won’t believe that.\\n\\n This is her home. I can’t take it away from her. Instead, all I can do is stare at her—this lovely, lovely girl who might have been nobility in another time with that hair and those eyes. If I never see her again after this moment, I’ll have enough memories of her to carry for every day of the rest of my life. But no matter how vivid those memories, they will all end here, now, her eyes glimmering in the starlight, and the feel of the blade pressed to my hip.\\n\\n I won’t even get to see her wedding, I realize. She’ll have so many years to float in the sky, and my days here are coming to an end.\\n\\n “I have to leave now,” I say.\\n\\n She says, “Where are you going?”\\n\\n “To murder the king,” I say. I know it isn’t possible, but I just want to know how it feels to say the words out loud. They feel perfect. My blood swirls and swirls with delicious warmth at the fantasy of it. “I’m going to creep into the clock tower,” I say, “and climb every last stair until I get up to the king’s apartment. I’m going to sneak into his bedroom while he’s sleeping and cut open his throat. I think that’s how I’ll do it. I’d like that.”\\n\\n Pen would laugh at the absurdity on a normal day, but she’s looking into my eyes.\\n\\n “Morgan—” She grips my arm, stands, and tugs me into the shadow of heavy leaves as though to protect me from what I’ve said. “You can’t be blurting out things like that right now. It’s treason. What if someone hears?”\\n\\n “Nobody is listening,” I say. “Nobody ever listens to us. We’re all milling around pretending that what we do is important, that we’re important, but the king will do away with anyone he’d like.”\\n\\n There’s a bright moon tonight, split to pieces by branches. It’s an organ with veins and arteries. A non-beating heart. If there’s a god at all, he’s dead in his sky.\\n\\n Pen holds my face in her hands. Her thumb brushes at my cheek over and over. “This isn’t like you at all,” she says. “What’s happened?”\\n\\n I’ve said ugly things, but she doesn’t flinch.\\n\\n “You asked what really happened,” I say. “My parents are dead.”\\n\\n I stare at her collarbone that’s framed with lace, the hollow of her throat, her shoulders that rise with the weight of her next breath. We’re fragile things. Our bones show through our skin. What would any god want with us?\\n\\n Some sound escapes her lips, but I can’t comprehend it. All I know for sure is that I have to leave. I can’t face her like this. “I’ve said too much,” I say, and take a step away. I’m just about to run, when she grabs my wrist. I struggle. For the first time in my life I struggle to get away from her, but she’s too strong for it. I pull with all I’ve got, and her shoes dig into the earth, her legs don’t even move. She’s rooted, hardly a grunt for her efforts.\\n\\n All the fight goes out of me. She lets go only when she’s sure I won’t run.\\n\\n “They’re dead,” I say, and sink into the dirt. She kneels beside me.\\n\\n When her mother became addicted to tonic, Pen was the victim of too many well wishes and sympathies. She has told me before that she’s had her fill of them for a lifetime no matter the tragedy, and that holds true. She says nothing.\\n\\n “I can’t tell you the rest,” I say. “I would if the whole story belonged to me, but it isn’t all mine to tell. That’s the only part that matters to me, anyway. They’re dead, and I can’t stay. This all sounds so incredible that I wouldn’t expect you to believe it.”\\n\\n “I believe you,” she says.\\n\\n Of course she does. She’s out of her mind, the only girl left in the academy who’d still want to have anything to do with me. We’re the same sort. We always have been.\\n\\n As I’m rising to a stand, there’s a stab of pain in the side of my neck, and I can’t move a muscle. The dart that’s just hit Pen’s shoulder is the only explanation. We’ve just been attacked. Something moves in the trees, and I’m falling back into someone’s waiting arms.\\n\\n 23\\n\\n My grandmother succumbed to the sun disease long before her dispatch date. Before she was to be given to the tributary, my sister and I were brought in to see her. I had seen death in my medical texts before, but never up close. Her body was silent and screaming at once, the same question over and over: Is this it?\\n\\n —“Intangible Gods,” Daphne Leander, Year Ten\\n\\n YOU’RE A LOUSY SHOT,” THE GIRL HUFFS. “You almost completely missed her neck. Papa would have never let you hear the end of that.”\\n\\n “I am doing our father a favor, might I remind you,” the boy says, grunting as he hoists Pen over his shoulder. “We’ve just done more work in five seconds than his incompetent staff has done since that girl’s murder. Honestly. Letting fugitives run about this city like it’s a giant floating tea party.”\\n\\n “I’ve always loved your analogies, Brother,” the girl says as she drags me from under the arms. I recognize her long hair, half of it braided around her head like a crown. The girls in my class have all tried to imitate that braid, with little success. It can be worn this perfectly by only one girl—the king’s only daughter, Princess Celeste.\\n\\n The boy holding Pen can only be Prince Azure, then. Not that I can move to look at him. With some effort I’m just able to blink.\\n\\n “He’d thank us if he knew,” the prince says.\\n\\n The princess smells like cinnamon and something else, something I’d find pleasant if it were wafting out of a teahouse or spilling from one of the many bottles on Alice’s dresser. Now it just nauseates me.\\n\\n Blackness is clouding my vision, and I fight it. I’ve already been poisoned once; I refuse to succumb so easily again.\\n\\n I cling to the words the prince and princess are saying. They provide no answers, but they’re keeping me conscious.\\n\\n “Mine is heavy,” he complains.\\n\\n “Weakling,” she says. “It’ll be a wonder to me when you inherit this city.”\\n\\n “I don’t see you carrying yours over your shoulder,” he says.\\n\\n “About that, you should be more careful,” the princess says. “Maybe she’s our prisoner, but that’s no reason to destroy such a lovely dress.”\\n\\n Despite the circumstances, all the girls of Internment would hate Pen if they knew that her dress had caught the attention of the princess. It was among the many presents from Pen’s mother. “Compensation for inebriation,” Pen calls them.\\n\\n “I don’t know why we need both of them, anyway,” the prince says. “The patrolman’s daughter is the one we need.”\\n\\n “Can’t leave witnesses,” the princess says. “So I’ll thank you to quit moaning about it.”\\n\\n Can’t leave witnesses. I hope they’ve overlooked Judas, but there’s no indication that he’s nearby. With horror I wonder if he returned to the flower shop to give Pen and me a chance to say our good-byes. He might have no idea what just happened.\\n\\n My heart should be pounding—I’m frightened enough—but my body won’t work. Perhaps the dart was meant to render me unconscious and I’m fighting it somehow. Or perhaps they want me to have my awareness when they torture me.\\n\\n I have plenty of time to worry and speculate. The prince and princess trudge through the woods for what feels like forever, arguing the whole way.\\n\\n “Would you be quiet now?” the princess says. There’s a heavy thud, and then the prince is flinging me into a wagon beside Pen. Just as he’s about to cover us with a large cloth, he stoops forward and brings his face close to mine. His breath is cinnamon, too. His eyes are clear, reflecting two perfect little skies full of stars.\\n\\n “I think your dart killed her,” he says. “Her eyes are open.”\\n\\n I will myself not to blink.\\n\\n The princess brings herself close, her white rabbit fur cuffs sweeping across my forehead as she clears the hair from my face. Only the king’s family wears white fur, because they spend most all their time indoors, and it’s supposed to symbolize their purity of spirit. The rest of us would never be able to keep it clean.\\n\\n The princess’s hand hovers over my mouth for a few seconds. “No, she’s definitely breathing.”\\n\\n “It’s creepy,” the prince says. “It’s like she’s staring at me.”\\n\\n I feel the fur cuff against my face again as the princess brushes my eyelids closed. “There. Happy?” \\n\\n","sourceLink":"https://allnovel.net/perfect-ruin-the-internment-chronicles-1/page-33.html","bookId":1764,"book":{"id":1764,"title":"Perfect Ruin (The Internment Chronicles #1)","description":"Storyline: Perfect Ruin (The Internment Chronicles #1) \\n On the floating city of Internment, you can be anything you dream, unless you approach the edge. Morgan Stockhour knows getting too close can lead to madness, like her older brother Len, a Jumper. She takes solace in her best friend Pen, and in Basil, the boy she’s engaged to marry. When she investigates the first murder in a generation, she meets Judas. The suspect was betrothed to the victim, but Morgan believes he is innocent. Nothing can prepare Morgan for the secrets she will find – or whom she will lose.\\n","cover":"https://allnovel.net/images/perfect-ruin-the-internment-chronicles-1.jpg","author":"Lauren DeStefano","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/perfect-ruin-the-internment-chronicles-1.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:24:58 AM"}}
