{"id":112139,"no":19,"title":"Page 19","content":"\u0027So what do we do now?\u0027 Proctor asked, his face suddenly ashen grey and emotionless. \u0027Do we just sit and wait?\u0027\\n\\n \u0027You might as well,\u0027 a voice suddenly said from behind him, \u0027but I\u0027m not ready to. Not yet, anyway.\u0027 The survivors turned around. For the first time that morning Barry Bushell emerged from his bedroom. He was dressed as a woman again, complete with blond wig, full make-up and high-heeled boots. He stormed into the main part of the suite with a bright confidence, completely at odds with the others who sat around dejectedly, each contemplating the decisions that they would soon have to make and the horrors they were about to face.\\n\\n \u0027So what are you planning?\u0027 Elizabeth asked, looking Bushell up and down and admiring his nerve if nothing else.\\n\\n \u0027I did a lot of thinking last night,\u0027 he explained.\\n\\n \u0027And...?\u0027 Jones pressed.\\n\\n \u0027I tried to see if I was wrong. I wanted to know whether I\u0027ve been looking at everything the wrong way.\u0027\\n\\n \u0027And?\u0027 he pressed again.\\n\\n \u0027And I think I\u0027m right,\u0027 he sighed. \u0027And the more I think about it, the more I realise that it\u0027s hopeless. We\u0027re really up against it and I can\u0027t see a way out. I\u0027m not just talking about the hotel here, I\u0027m talking about what\u0027s left of our lives in general.\u0027\\n\\n \u0027What do you mean?\u0027\\n\\n Bushell thought carefully for a moment.\\n\\n \u0027Whatever we do, wherever we go, we\u0027re fucked.\u0027\\n\\n \u0027Nice.\u0027\\n\\n \u0027Seriously, just stop and think about it. I\u0027m not being defeatist here, I\u0027m just being honest. Whatever we decide to do, it\u0027s going to be a struggle. We\u0027re going to have to fight for absolutely everything, and that\u0027s bloody stupid when you think there\u0027s probably only a few people left. The world\u0027s our oyster, but I don\u0027t think we can take any of it. What does that say to you?\u0027\\n\\n Blank, confused looks. Silence.\\n\\n \u0027Like you said,\u0027 Elizabeth mumbled, \u0027we\u0027re fucked.\u0027\\n\\n \u0027Exactly. The end\u0027s coming and there\u0027s nothing we can do about it. The only thing we have any control over is what we do with the time we have left.\u0027\\n\\n \u0027But we don\u0027t know how long that is,\u0027 Proctor protested.\\n\\n \u0027We never have done,\u0027 Bushell argued. \u0027Seems to me that we can spend out last days and weeks hiding in the shadows out there, starving to death, running from place to place and freaking out every time someone farts...\u0027\\n\\n \u0027Or...?\u0027\\n\\n \u0027Or we can just stop trying so hard to survive and just let things happen naturally. Go out with a little dignity.\u0027\\n\\n \u0027You\u0027re talking crap,\u0027 Wilcox protested. \u0027Am I? Am I really? Do you really think you\u0027re supposed to survive all of this? Don\u0027t you think there are some things that are bigger than us...?\u0027\\n\\n \u0027Please don\u0027t start talking about God and divine retribution and all that crap,\u0027 Proctor sighed. \u0027I\u0027ve given all of that up. It\u0027s taken me until now to finally see what a load of old shite all that really was.\u0027\\n\\n Bushell shook his head and smiled and brushed away a stray wisp of long, blond hair.\\n\\n \u0027That\u0027s not what I\u0027m talking about at all. What I\u0027m saying is that whatever happened here was the twenty-first century equivalent of the asteroid that wiped out the dinosaurs.\u0027\\n\\n \u0027What?\u0027 Jones exclaimed. \u0027Now you\u0027ve really lost me.\u0027\\n\\n \u0027This is our ice-age. This is our apocalypse. This is the end. We should just accept it and let nature take its course.\u0027 Bushell\u0027s comments were met with an ominous silence. Keen to press his point he spoke again. \u0027Our problem is,\u0027 he sighed thoughtfully, \u0027we\u0027ve all fallen foul of the programme. We think we\u0027re bloody superior. We think the planet can\u0027t go on without us. It\u0027s part and parcel of the human condition. Truth is the world\u0027s going to thrive without us here to screw it up.\u0027\\n\\n \u0027The human condition?\u0027 Wilcox sneered. \u0027What the hell are you talking about?\u0027\\n\\n Bushell shrugged his shoulders.\\n\\n \u0027I can\u0027t think of another name for it. I was looking out of the window last night watching birds flying from building to building...\u0027\\n\\n \u0027Fucking hell,\u0027 Jones interrupted, \u0027he\u0027s lost it. I\u0027ve long had my doubts about him but I think he\u0027s finally lost it...\u0027\\n\\n \u0027I was watching the birds,\u0027 Bushell continued, ignoring him, \u0027and I started thinking about the difference between us and the animals. Seems to me there\u0027s one huge difference that doesn\u0027t often get talked about.\u0027 He paused to give the others opportunity to make a cheap joke or to throw another insult in his direction. Unusually they were silent. \u0027The difference is,\u0027 he explained, \u0027that we know we\u0027re eventually going to die and they don\u0027t. Animals strut about the place thinking they\u0027re going to go on forever, we spend our lives worrying about how they\u0027re going to end. That\u0027s what I mean when I talk about the human condition. We\u0027re too preoccupied thinking about death to enjoy life.\u0027\\n\\n There followed an unusually long moment of contemplation and reflection which was only disturbed when Proctor remembered the bodies on the stairs.\\n\\n \u0027That\u0027s all well and good,\u0027 he said anxiously, \u0027but what are you going to do now? Are you going to wait for the bodies to get in here, or are you going to kill yourself and get it over with?\u0027\\n\\n \u0027Neither.\u0027\\n\\n \u0027What then?\u0027\\n\\n \u0027Get rid of a few bodies if I can and try and slow them down a little. Then sit here and drink myself stupid with what\u0027s left of the bottles Paul and Elizabeth kindly fetched for us last night.\u0027\\n\\n \u0027And how do you propose to slow them down?\u0027\\n\\n \u0027I\u0027ve been thinking about that too. We\u0027ve already established that they\u0027ll keep moving forward until they can\u0027t go any further, right?\u0027 \u0027Right?\u0027 Elizabeth agreed.\\n\\n \u0027So instead of letting them stop here on this floor where we are, let\u0027s help them go a little further.\u0027\\n\\n \u0027What are you suggesting?\u0027\\n\\n \u0027Lead them up onto the roof.\u0027\\n\\n \u0027And?\u0027\\n\\n \u0027And that\u0027s it. What they do up there is their business. If they stay true to form they\u0027ll follow each other up, one after another, until there\u0027s no room left.\u0027\\n\\n \u0027Then what?\u0027\\n\\n \u0027Then they\u0027ll either start forcing themselves back down, or they\u0027ll start forcing themselves over the edge!\u0027\\n\\n \u0027Brilliant,\u0027 Jones grinned. \u0027Absolutely fucking brilliant!\u0027\\n\\n He couldn\u0027t believe what he was hearing. Was the man in a dress really suggesting they spend their last few days sitting in a luxury hotel suite watching three week old bodies push each other off the roof?\\n\\n \u0027It\u0027s worth a go, isn\u0027t it?\u0027 Bushell smiled.\\n\\n \u0027Okay,\u0027 Jones said, surprising even himself, \u0027let\u0027s do it.\u0027\\n\\n The roof of the building was accessed from a narrow staircase which led off an unremarkable looking doorway at the top of the main stairs. With the bodies continuing to make unsteady progress towards them, Jones and Bushell crept up towards the hatch that would lead them outside.\\n\\n \u0027It\u0027s locked,\u0027 Bushell grunted as he tried to push the door open.\\n\\n \u0027Don\u0027t you have the key? You\u0027ve got keys to everywhere else.\u0027\\n\\n \u0027Sorry.\u0027\\n\\n \u0027Smash it open then.\u0027\\n\\n \u0027What about the noise?\u0027\\n\\n Jones looked down the staircase, back into the heart of the building. Even from this distance he could see indistinct, shuffling movement.\\n\\n \u0027Bit late to worry about that,\u0027 he mumbled.\\n\\n With limited space to manoeuvre his bulk, Bushell swung himself back and then crashed his shoulder against the door. It rattled in its frame but didn\u0027t open. Another couple of attempts were equally unsuccessful.\\n\\n \u0027Let me,\u0027 Jones said, pushing the other man to the side. He launched a barrage of well aimed kicks at the lock. The wood began to splinter and crack. Another few kicks and it flew open.\\n\\n The two men climbed out onto the roof. A phenomenal wind threatened to blow them off their feet. \u0027Jesus,\u0027 Jones said, having to shout to make himself heard, \u0027bit blustery, isn\u0027t it.\u0027\\n\\n Bushell didn\u0027t answer. He was already busying himself with trying to pull the door off its hinges. For the bodies to be able to keep moving forward the doorway would need to remain clear. The only way to make sure that happened was to remove the door completely. Jones picked up a discarded strip of metal from the roof and, using it as a jemmy, began to prise at the hinges. A couple of minutes of grunting and groaning and the wood splintered and gave way.\\n\\n \u0027That\u0027s it,\u0027 Bushell said, dragging the now redundant door away and dropping it on the asphalt. \u0027Let\u0027s get back.\u0027\\n\\n The two men clattered back down the staircase towards the Presidential Suite. Jones stopped at the top of the staircase and peered down at the bodies moving towards him. Was it his imagination, or had they begun to move slightly quicker than they had been? He tried to think logically as he watched the distance between the living and the dead rapidly evaporate. Previously the bodies had been driven by the pressure of others pushing them from behind. So what had changed now? The answer was simple. The corpses furthest up the stairs now knew that there were survivors above. Rather than wait to be pushed forward, those at the front of the queue were now moving under their own steam. The distance between them was disappearing rapidly. Jones stood on the landing and watched the nearest of the rotting figures awkwardly climbing towards the top floor of the hotel. Bushell stood next to him.\\n\\n \u0027They\u0027re getting faster,\u0027 Jones said quietly, not quite believing what he was seeing. \u0027I think we need to...\u0027 He stopped speaking when one of the bodies looked up at him. Was he imagining it? No, now Bushell had seen it too. The creatures were looking at them...\\n\\n \u0027Move,\u0027 Bushell said simply. The other man didn\u0027t argue.\\n\\n \u0027Done it?\u0027 Proctor asked hopefully as they burst back through the main doors.\\n\\n Bushell nodded.\\n\\n \u0027Done it.\u0027\\n\\n \u0027Now what?\u0027\\n\\n \u0027We might have a problem...\u0027 he began to say.\\n\\n \u0027What\u0027s the matter?\u0027 Doreen asked, concerned.\\n\\n Jones still stood by the open doors, looking back down the corridor and occasionally turning round and glancing over his shoulder at the others. He was about to try and tell them what they\u0027d seen when the first bodies appeared on the landing. Elizabeth covered her mouth in horror and stifled a terrified scream. Proctor scrambled away from the open door.\\n\\n \u0027Fucking hell...\u0027 gasped Wilcox.\\n\\n \u0027They saw us,\u0027 Jones mumbled pathetically. \u0027There was nothing we could do.\u0027 \\n\\n","sourceLink":"https://allnovel.net/autumn-the-human-condition-autumn-6/page-19.html","bookId":2559,"book":{"id":2559,"title":"Autumn: The Human Condition (Autumn #6)","description":"Storyline: Autumn: The Human Condition (Autumn #6) \\n David Moody presents the final book in the acclaimed AUTUMN series. \\n The human race is finished. Mankind is all but dead and only a handful of frightened individuals remain. These people have survived through chance, not skill, and they are a desperate bunch: cheating lovers, workshy civil servants, permanently drunk publicans, teenage rebels, obsessive accountants, failed husbands, first-time cross-dressers, disrobed priests and more... \\n Experience the end of the world as seen from almost fifty different perspectives. Part-companion, part-guidebook and part-sequel, AUTUMN: THE HUMAN CONDITION follows the individual stories of these desperate survivors through their final dark days. \\n \u0027The best survival horror since Richard Matheson\u0027s I am Legend\u0027 - Wayne Simmons, author of Flu and Plastic Jesus \\n \u0027Moody is as imaginative as Barker, as compulsory as King, and as addictive as Palahniuk\u0027 - Scream the horror magazine \\n \u0027Takes the genre in a fascinating new direction. If John Wyndham was alive and writing zombie novels, they\u0027d read like this\u0027 - Jonathan Maberry, best-selling author of Patient Zero and Rot \u0026 Ruin\\n","cover":"https://allnovel.net/images/autumn-the-human-condition-autumn-6.jpg","author":"David Moody","type":"Horror","source":"allnovel","link":"https://allnovel.net/autumn-the-human-condition-autumn-6.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 6, 2019 12:53:31 AM"}}
