{"id":109481,"no":25,"title":"Page 25","content":"I HAD MOCKED KEITH when we first came to Palm Springs, teasing him for freezing up around Moroi. But as I stood there now, face-to-face with the stuff of nightmares, I knew exactly how he felt. I had no right to judge anyone for losing all rational thought when confronted with their greatest fears. That being said, if Keith was here, I think he would\u0027ve understood why Moroi weren\u0027t as big a deal to me anymore. Because when compared to Strigoi?\\n\\n Well, suddenly the little differences between humans and Moroi became negligible. Only one difference mattered, the difference between the living and the dead. It was the line that divided us, the line that Adrian and I firmly stood together on one side of - facing those who stood on the other.\\n\\n I had seen Strigoi before. Back then, I hadn\u0027t been immediately threatened by them. Plus, I\u0027d had Rose and Dimitri on hand, ready to protect me. Now? There was no one here to save us. Just ourselves.\\n\\n There were only two of them, but it might as well have been two hundred. Strigoi operated at such a different level than the rest of us that it didn\u0027t take very many of them to tip the odds. They were both women, and they looked as though they\u0027d been in their twenties when they became Strigoi. How long ago that was, I couldn\u0027t guess. Lee had zealously gone on and on about how being Strigoi meant you were \"forever young.\" Yet in looking at these two monsters, I didn\u0027t really think of them that way. Sure, they had the superficial appearance of youth, but it was marred with evil and decay. Their skin might be wrinkle free, but it was a sickly white, far whiter than any Moroi. The red-ringed eyes that leered out at us didn\u0027t sparkle with life and energy, but rather an unholy sort of reanimation. These people weren\u0027t right. They weren\u0027t natural.\\n\\n \"Charming,\" said one, her blond hair in a pixie cut. Her facial structure made me think she\u0027d been a dhampir or human before being turned. She was eyeing us the same way I\u0027d often seen my family\u0027s cat watch birds. \"And exactly as described.\"\\n\\n \"They\u0027re soooo pretty,\" crooned the other, a lascivious smile on her face. Her height said she had once been Moroi. \"I don\u0027t know which one I want first.\"\\n\\n The blonde gave a warning look. \"We\u0027ll share.\"\\n\\n \"Like last time,\" agreed the other, tossing a mane of curly black hair over one shoulder.\\n\\n \"No,\" said the first. \"Last time you made both kills. That wasn\u0027t sharing.\"\\n\\n \"But I let you feed from both afterward.\"\\n\\n Before she could counter back, Lee suddenly recovered himself and staggered forward to the blond Strigoi. \"Wait, wait. Dawn. You promised me. You promised you\u0027d awaken me first before you do anything.\"\\n\\n The two Strigoi turned their attention to Lee. I was still frozen, still unable to move or really react while being so close to these creatures of hell. But somehow, through the thick and overwhelming terror surrounding me, I still managed to feel small and unexpected pity for Lee. There was a little hate there too, of course, considering the situation. But mostly I felt terribly sorry for someone who truly believed his life was meaningless unless he sacrificed his soul for hollow immortality. Not only that, I felt sorry for him for actually thinking he could trust these creatures to give him what he wanted. Because as I studied them, it was perfectly clear to me that they were deciding whether or not to make this a three-course meal. Lee, I suspected, was the only one who didn\u0027t realize this.\\n\\n \"Please,\" he said. \"You promised. Save me. Restore me to how I was.\"\\n\\n I also couldn\u0027t help but notice the small red patch on his face where I\u0027d hit him. I allowed myself to feel a bit of pride over that but wasn\u0027t cocky enough to think I possessed any noteworthy fighting skills to battle my way out of this situation. The Strigoi were too close, and our exits were too few.\\n\\n \"I know where more are,\" he added, beginning to look uneasy that his \"saviors\" weren\u0027t immediately jumping in to make his dreams come true. \"One\u0027s young - a dhampir.\"\\n\\n \"I haven\u0027t had a dhampir in a while,\" said the curly-haired Strigoi, almost wistfully.\\n\\n Dawn sighed. \"I don\u0027t really care, Jacqueline. If you want to awaken him, go for it. I just want these two. He doesn\u0027t matter to me.\"\\n\\n \"I get the dhampir all to myself, then,\" warned Jacqueline.\\n\\n \"Fine, fine,\" said Dawn. \"Just hurry up.\"\\n\\n Lee turned so radiant, so happy... it was sickening. \"Thank you,\" he said. \"Thank you so much! I\u0027ve been waiting so long for this that I can\u0027t believe it\u0027s - ahh!\"\\n\\n Jacqueline moved so quickly that I hardly saw it happen at all. One moment she was standing in the doorway, the next she had Lee pinned against the recliner. Lee gave out a semi-muffled scream as she bit into his neck, a scream that soon quieted. Dawn shut the door and nudged us forward. I flinched at her touch.\\n\\n \"Well,\" she said with amusement. \"Let\u0027s get a good view.\"\\n\\n Neither Adrian nor I responded. We simply moved into the living room. I dared a glance at him but could discern little. He was so good at hiding his true feelings in general that I supposed I shouldn\u0027t be surprised he could mask abject terror just as easily. He offered me no encouragement with either his expression or words, which I actually found kind of refreshing. Because really, I didn\u0027t see any good end to this situation.\\n\\n Up close, forced to watch Jacqueline\u0027s attack, I could now see the blissful expression that had settled over Lee\u0027s face. It was the most awful thing I\u0027d ever witnessed. I wanted to squeeze my eyes shut or turn away, but some force beyond me kept me staring at the grisly spectacle. I\u0027d never seen any vampire feed, Moroi or Strigoi, but I now understood why feeders like Dorothy could so willingly sign up for their lifestyles. Endorphins were being released into Lee\u0027s bloodstream, endorphins so strong that they blinded him to the fact that he was having his life drained away. He instead existed in a joyous state, lost in a chemical high. Or maybe he was just thinking about how happy he\u0027d be once he was a Strigoi again, if it was possible to have any sort of conscious thought under these circumstances.\\n\\n I lost track of how long it took to drain Lee. Each moment was agonizing for me, as though I was taking the pain Lee should have been feeling. The process seemed to last forever, and yet there was also a weird sense of speed to it. It felt wrong that someone\u0027s body could be drained in so short a time.\\n\\n Jacqueline drank steadily, pausing only once to remark, \"His blood\u0027s not as good as I expected.\"\\n\\n \"Then stop,\" suggested Dawn, who was starting to look bored. \"Just let him die and have these two with me.\"\\n\\n Jacqueline looked as though she was actually considering it, again reminding me what a fool Lee had been to put his trust in these two. After a few minutes, she shrugged. \"I\u0027m almost done. And I really want him to get me that dhampir.\"\\n\\n Jacqueline resumed drinking, but as she\u0027d said, it didn\u0027t take much longer. By this point, Lee was nearly as pale as the Strigoi, and there was a strange, stretched quality to his skin. He was perfectly still now. His face seemed frozen in a grin that was nearly as much shock as it was joy. Jacqueline lifted her face and wiped off her mouth, surveying her victim with pleasure. She then pushed up her shirtsleeve and rested her nails on his wrist. Before she could tear her own flesh, however, she caught sight of something.\\n\\n \"Ah, much neater.\" She stepped away and leaned down, retrieving Lee\u0027s knife. It had slid under the love seat in our altercation. Jacqueline took it and effortlessly slashed her wrist, causing deep red blood to well out. Part of my brain didn\u0027t think their blood should look so similar to mine. It should be black.\\n\\n Or acidic.\\n\\n She placed her bleeding wrist against Lee\u0027s mouth and tipped Lee\u0027s head back so that gravity could help the blood flow. Every horror I\u0027d witnessed tonight had been worse than the last. Death was terrible - but it was also part of nature. This? This was no part of nature\u0027s plan. I was about to witness the world\u0027s greatest sin, the corruption of the soul through black magic to reanimate the dead. It made me feel dirty all over, and I wished I could run away. I didn\u0027t want to see this. I didn\u0027t want to see the guy I\u0027d once regarded as something like a friend suddenly rise up as some perversion of nature.\\n\\n A touch to my hand made me jump. It was Adrian. His eyes were on Lee and Jacqueline, but his hand had caught hold of mine and squeezed it, even though he was still cuffed. I was surprised at the warmth of his skin. Even though I knew Moroi were as living and warm-blooded as me, my irrational fears always expected them to be cold. Equally surprising was the sudden comfort and connection in that touch. It wasn\u0027t the kind of touch that said, Hey, I\u0027ve got a plan, so hang in there because we\u0027re going to get out of this. It was more like the kind of touch that simply said, You aren\u0027t alone. It was really the only thing he could offer. And in that moment, it was enough.\\n\\n Then, something strange happened. Or rather, didn\u0027t happen.\\n\\n Jacqueline\u0027s blood was pouring steadily into Lee\u0027s mouth, and while we didn\u0027t have many documented cases of Strigoi conversions, I knew the basics. The victim\u0027s blood was drained, and then the killing Strigoi fed his or her blood back into the deceased. I didn\u0027t know exactly how long it took to work - it certainly didn\u0027t require all of the Strigoi\u0027s blood - but at some point, Lee should be stirring and getting up as one of the walking dead.\\n\\n Jacqueline\u0027s cool, smug expression began to change to curiosity and then became outright confusion. She glanced questioningly at Dawn.\\n\\n \"What\u0027s taking so long?\" Dawn asked.\\n\\n \"I don\u0027t know,\" Jacqueline said, turning back to Lee. With her free hand, she nudged Lee\u0027s shoulder as though that might serve as a wake-up call.\\n\\n Nothing happened.\\n\\n \"Haven\u0027t you done this before?\" asked Dawn.\\n\\n \"Of course,\" snapped Jacqueline. \"It didn\u0027t take nearly this long. He should be up and moving around. Something\u0027s wrong.\" I remembered Lee\u0027s words, describing how all his desperate attempts at taking innocent lives hadn\u0027t converted him back. I only knew a little about spirit - and even less about it restoring Strigoi - but something told me there was no force on earth that would ever turn Lee Strigoi again.\\n\\n Another long minute passed as we watched and waited. At last, disgusted, Jacqueline backed away from the recliner and rolled up her sleeve. She glared at Lee\u0027s motionless body. \"Something\u0027s wrong,\" she repeated. \"And I don\u0027t want to waste any more blood figuring out what it is. Besides, my cut\u0027s already healing.\"\\n\\n I wanted nothing more than for Dawn and Jacqueline to forget I existed, but the next words slipped out of my mouth before I could stop them. The scientist in me was too caught up in a revelation. \"He was restored - and it affected him permanently. The spirit magic left some kind of mark, and now he can\u0027t be turned again.\"\\n\\n Both Strigoi looked at me. I cringed under those red eyes.\\n\\n \"I never believed any of those spirit stories,\" said Dawn.\\n\\n Jacqueline, however, was still clearly puzzled by her failure. \"There was something wrong with him, though. I can\u0027t explain it... but the whole time, he didn\u0027t feel right. Didn\u0027t taste right.\"\\n\\n \"Forget him,\" said Dawn. \"He had his chance. He got what he wanted, and now I\u0027m moving on.\"\\n\\n I saw my death in her eyes and tried to reach for my cross. \"God protect me,\" I said, just as she lunged forward.\\n\\n Against all odds, Adrian was there to stop her - or, well, try to stop her. Mostly, he just got in her way. He didn\u0027t have the speed or reaction time to effectively block her and was especially clumsy with his cuffed hands. I think he\u0027d just seen what I had, that she was going to attack, and had preemptively moved in front of me in some noble but ill-fated attempt at protection.\\n\\n And ill-fated it was. With one smooth motion, she shoved him aside in a way that looked effortless but knocked him halfway across the room. My breath caught. He hit the floor, and I started to scream. Suddenly, I felt a sharp pain against my throat. Without a pause, Dawn had promptly grabbed me and nearly lifted me off my feet to get access to my neck. I mustered another frantic prayer as that pain spread, but within seconds, both prayer and pain disappeared from my brain. They were replaced by a sweet, sweet feeling of contentment and bliss and wonder. I had no thoughts, except that I was suddenly existing in the happiest, most exquisite state imaginable. I wanted more. More, more, more. I wanted to drown in it, to forget myself, to forget everything around me -\\n\\n \"Ugh,\" I cried out as I suddenly and unexpectedly hit the floor. Still in that blissful haze, I felt no pain - yet.\\n\\n Just as quickly as she\u0027d grabbed me, Dawn had dropped and pushed me away. Instinctively, I reached out an arm to break my fall but failed. I was too weak and disoriented and sprawled ungracefully on the carpet. Dawn\u0027s fingers were touching her lips, a look of outrage twisting her already-horrific features.\\n\\n \"What,\" she demanded, \"was that?\"\\n\\n My brain wasn\u0027t working properly yet. I\u0027d only had a brief taste of endorphin, but it was still enough to leave me addled. I had no answer for her. \"What\u0027s wrong?\" exclaimed Jacqueline, striding forward. She looked from me to Dawn in confusion.\\n\\n Dawn scowled and then spit onto the floor. It was red from my blood. Disgusting.\\n\\n \"Her blood... it was terrible. Inedible. Foul.\" She spit again.\\n\\n Jacqueline\u0027s eyes widened. \"Just like the other one. See? I told you.\"\\n\\n \"No.\" Dawn shook her head. \"There\u0027s no way it could be the same. You would never have been able to drink that much of her.\" She spit again. \"It didn\u0027t just taste weird or bad... it was like it\u0027s tainted.\" Seeing Jacqueline\u0027s skeptical look, Dawn punched her on the arm. \"Don\u0027t believe me? Try her yourself.\"\\n\\n Jacqueline took a step toward me, hesitant. Then Dawn spit again, and I think that somehow convinced the other Strigoi that she wanted no part of me.\\n\\n \"I don\u0027t want another mediocre meal. Damn it. This is becoming absurd.\" Jacqueline glanced at Adrian, who was standing perfectly still. \"At least we\u0027ve still got him.\"\\n\\n \"If he\u0027s not ruined too,\" Dawn muttered.\\n\\n My senses were coming back to me, and for half a second, I wondered if there was some insane way we might survive this. Maybe the Strigoi would write us off as bad meals. But no. Even as I allowed myself to hope that, I also knew that even if they didn\u0027t feed off of us, we weren\u0027t going to leave here alive. They had no reason to simply walk off. They\u0027d kill us for sport before they left.\\n\\n With that same remarkable speed, Jacqueline sprang toward Adrian. \"Time to find out.\"\\n\\n I screamed as Jacqueline pinned Adrian against the wall and bit his neck. She only did so for a few seconds, just to get a taste. Jacqueline lifted her head up, pausing and savoring the blood. A slow smile spread over her face, showing her bloody fangs.\\n\\n \"This one\u0027s good. Very good. Makes up for the other.\" She trailed her fingers down his cheek. \"Such a shame, though. He\u0027s so cute.\"\\n\\n Dawn stalked toward them. \"Let me try before you take it all!\"\\n\\n Jacqueline ignored her and was leaning back toward Adrian, who had gone all glassy-eyed. Meanwhile, I was free enough of the endorphins that I was thinking clearly again. No one was paying attention to me. I tried to stand and felt the world sway. Staying low, I managed to crawl toward my purse, lying forgotten near the living room\u0027s edge. Jacqueline had drunk from Adrian again, but only briefly before Dawn pulled her away and demanded a turn so that she could wash the taste of my blood out of her mouth.\\n\\n Startling myself with how fast I moved, I rustled through my cavernous purse, looking desperately for anything that might help. Some cold, logical part of me said there was no way we could get out of this, but there was also no way I could just sit there and watch them drain Adrian. I had to fight. I had to try to save him, just as he\u0027d tried for me. It didn\u0027t matter if the effort failed or if I died. Somehow, I had to try.\\n\\n Some Alchemists carried guns, but not me. My purse was huge, full of more stuff than I really needed, but nothing in the contents resembled a weapon.\\n\\n Even if it did, most weapons were futile against Strigoi. A gun would slow them down but not kill them. Only silver stakes, decapitation, and fire could kill a Strigoi.\\n\\n Fire...\\n\\n My hand closed around the amulet I\u0027d made for Ms. Terwilliger. I\u0027d shoved it in my purse when she gave it to me, unsure what I should do with it. I could only assume blood loss and scattered thoughts made me draw it out now and consider the possibility of using it. Even the idea was ridiculous. You couldn\u0027t use something that didn\u0027t work! It was a trinket, a worthless bag of rocks and leaves. There was no magic here, and I was a fool to even think along those lines.\\n\\n And yet, it was a bag of rocks.\\n\\n Not a heavy one, but surely enough to get someone\u0027s attention if it hit her in the head. It was the best I had. The only thing I had to slow Adrian\u0027s death. Drawing back my arm, I aimed at Dawn and threw, reciting the foolish incantation like a battle cry: \"Into flame, into flame!\"\\n\\n It was a good shot. Miss Carson would have been proud. But I had no chance to admire my athletic skills because I was too distracted by the fact that Dawn had caught on fire.\\n\\n My jaw dropped as I stared at the impossible. It wasn\u0027t a huge fire. It wasn\u0027t like her entire body was engulfed in flames. But where the amulet had struck her, a small blaze ignited, spreading rapidly through her hair. She screamed and began frantically patting her head. Strigoi feared fire, and for a moment, Jacqueline recoiled. Then, with grim determination, she released Adrian and grabbed a throw blanket. She wrapped it around Dawn\u0027s head, smothering the flames.\\n\\n \"What the hell?\" Dawn demanded when she emerged. She immediately began charging toward me in her anger. I knew then the only thing I\u0027d accomplished was to speed up my own death.\\n\\n Dawn grabbed ahold of me and slammed my head against the wall. My world reeled, and I felt nauseous. She reached for me again but froze when the door suddenly burst open. Eddie appeared in the doorway, a silver stake in his hand.\\n\\n What was truly amazing about what followed was the speed. There was no pausing, no long moments to assess the situation, and no snarky banter between combatants. Eddie simply charged in and went for Jacqueline. Jacqueline responded with equal quickness, rushing forward to meet her one worthy foe here.\\n\\n After she\u0027d released him, Adrian had slumped to the floor, still in the throes of the Strigoi endorphins. Keeping low to the ground, I scurried over to his side and helped drag him back to the \"safety\" of the far side of the living room while Eddie clashed with the Strigoi. I spared them only a moment\u0027s glance, just enough to take in the deadly dancelike nature of their maneuvering. Both Strigoi were trying to get a grip on Eddie, probably in the hopes of breaking his neck, but were careful to stay away from the bite of his silver stake.\\n\\n I looked down at Adrian, who was dangerously pale and whose pupils had reduced to the size of pinpoints. I had only a sketchy impression of how much Jacqueline had drunk from him and didn\u0027t know if Adrian\u0027s state was more from blood loss or endorphins.\\n\\n \"I\u0027m fine, Sage,\" he muttered, blinking as though the light hurt. \"Quite the high, though. Makes the stuff I\u0027ve used seem pretty soft-core.\" He blinked, as though fighting to wake up. His pupils dilated to a more normal size and then seemed to focus on me. \"Good God. Are you okay?\"\\n\\n \"I will be,\" I said, starting to stand. Yet even as I spoke, a wave of dizziness hit me, and I swayed. Adrian did his best to support me, though it was pretty awkward with his bound hands. We leaned against each other, and I almost laughed at how ridiculous the situation was, both of us trying to help the other when neither of us was in any condition to do it. Then something caught my eye that chased all other thoughts away.\\n\\n \"Jill,\" I whispered.\\n\\n Adrian immediately followed my gaze to where Jill had just appeared in the living room\u0027s entry. I wasn\u0027t surprised to see her. The only way Eddie could be here was if Jill had told him what was happening to Adrian through the spirit bond. Standing there, with her eyes flashing, she looked like some fierce, battle-ready goddess as she watched Eddie spar with the Strigoi. It was both inspiring and frightening. Adrian shared my thoughts.\\n\\n \"No, no, Jailbait,\" he murmured. \"Do not do anything stupid. Castile needs to handle this.\"\\n\\n \"She knows how to fight,\" I said.\\n\\n Adrian frowned. \"But she doesn\u0027t have a weapon. Without one, she\u0027s just a featherweight in this.\"\\n\\n He was right, of course. And while I certainly didn\u0027t want Jill endangering her life, I couldn\u0027t help but think if she were properly equipped, she might be able to do something. At the very least, a distraction might be a benefit. Eddie was holding his ground all right against the two Strigoi, but he wasn\u0027t making any progress against them either. He could use help. And we needed to make sure Jill didn\u0027t rush into this with only her wits to defend her.\\n\\n Inspiration hit me, and I managed to stay on my feet. The world was spinning even more than before, but - despite Adrian\u0027s protests - I managed to stagger to the kitchen. I just barely was able to get to the sink and flip the faucet on before my legs gave out underneath me. I caught hold of the counter\u0027s edge, using it to keep me upright.\\n\\n \"Jill!\" I yelled.\\n\\n She turned toward my shout, saw the running water, and instantly knew what to do. She lifted her hand. The stream coming from the faucet suddenly shifted, shooting out of the sink and across the living room. It went to Jill, who collected a large amount of it between her hands and magically forced the water into a long cylindrical shape. It held itself in the air like that, a rippling but seemingly solid club of water. Gripping it, she hurried toward the fight and swung her weapon of water into Jacqueline\u0027s back. Drops flew off of the \"club,\" but it held on to its rigidity enough for her to get a second hit in before completely exploding into a spray of water.\\n\\n Jacqueline spun around, her hand swinging out to strike Jill. Jill had expected as much and dropped to the floor, dodging in exactly the way I\u0027d seen Eddie teach her. She scurried backward, out of Jacqueline\u0027s way, and the Strigoi pursued - giving Eddie an exposed shot on her back. Eddie took the opportunity, evading Dawn, and plunged his stake into Jacqueline\u0027s back. I\u0027d never given it much thought before, but if shoved hard enough, a stake could pierce someone\u0027s heart just as easily from the back as the chest. Jacqueline went rigid, and Eddie jerked his stake out, just managing to avoid the full force of a strike from Dawn. She still caught him a little, and he stumbled briefly before quickly regaining his footing and setting his sights on her. Jill was forgotten and hurried over to us in the kitchen.\\n\\n \"Are you okay?\" she exclaimed, peering at both of us. That fierce look was gone. She was now just an ordinary girl concerned for her friends. \"Oh my God. I was so worried about you both. The emotions were so strong. I couldn\u0027t get a fix on what was happening, just that something was horribly wrong.\"\\n\\n I dragged my gaze to Eddie, who was dancing around with Dawn. \"We have to help him - \"\\n\\n I took two steps away from the counter and started to fall. Both Jill and Adrian reached out to catch me.\\n\\n \"Jesus, Sage,\" he exclaimed. \"You\u0027re in bad shape.\"\\n\\n \"Not as bad as you,\" I protested, still worried about helping Eddie. \"They drank more from you - \"\\n\\n \"Yeah, but I don\u0027t have a bleeding arm wound,\" he pointed out. \"Or a possible concussion.\"\\n\\n It was true. In all the excitement, I was so full of adrenaline that I\u0027d all but forgotten about where Lee had stabbed me. No wonder I was so dizzy. Or maybe that was from getting my head smacked into the wall. It was anyone\u0027s guess at this point.\\n\\n \"Here,\" said Adrian gently. He reached for my arms with his cuffed hands. \"I can take care of this.\"\\n\\n A slow, tingling warmth spread through my skin. At first, Adrian\u0027s touch was comforting, like an embrace. I felt my tension and pain begin to ease. All was right in the world. He was in control. He was taking care of me.\\n\\n He was using his magic on me.\\n\\n \"No!\" I shrieked, pulling away from him with a strength I didn\u0027t know I had. The horror and full realization of what was happening to me was too powerful. \"Don\u0027t touch me! Don\u0027t touch me with your magic!\"\\n\\n \"Sage, you\u0027ll feel better, believe me,\" he said, reaching toward me again.\\n\\n I backed away, clinging to the edge of the counter for support. The fleeting memory of that warmth and comfort was being dwarfed by the terror I\u0027d carried my entire life for vampire magic. \"No, no, no. No magic! Not on me! The tattoo will heal me! I\u0027m strong!\"\\n\\n \"Sage - \"\\n\\n \"Stop, Adrian,\" said Jill. She approached me tentatively. \"It\u0027s okay, Sydney. He won\u0027t heal you. I promise.\"\\n\\n \"No magic,\" I whispered.\\n\\n \"For God\u0027s sake,\" growled Adrian. \"This is superstitious bullshit.\"\\n\\n \"No magic,\" Jill said firmly. She took off the button-up shirt she\u0027d been wearing over a T-shirt. \"Come here, and I\u0027ll use this to wrap it so that you don\u0027t lose any more bl - \"\\n\\n An earsplitting shriek jerked us all back toward the living room. Eddie had made his kill, driving his stake right into the middle of Dawn\u0027s chest. In my brief scuffle with Adrian and Jill, Dawn must have gotten some shots in on Eddie because there was a large red mark on one side of his face, and his lip was bleeding. The expression in his eyes was hard and triumphant, however, as he pulled the stake out and watched Dawn fall.\\n\\n Through all the confusion and horror, basic Alchemist instincts took over. The danger was gone. There were procedures that needed to be followed.\\n\\n \"The bodies,\" I said. \"We have to destroy them. There\u0027s a vial in my purse.\"\\n\\n \"Whoa, whoa,\" said Adrian as both he and Jill restrained me. \"Stay where you\u0027re at. Castile can get it. The only place you\u0027re going is to a doctor.\"\\n\\n I didn\u0027t move but immediately argued with that last statement. \"No! No doctors. At least, you have to - you have to get an Alchemist one. My purse has the numbers - \"\\n\\n \"Go get her purse,\" Adrian told Jill, \"before she has a fit here. I\u0027ll bind the arm.\" I gave him a warning look. \"Without magic. Which, by the way, could make this ten times easier.\"\\n\\n \"I\u0027ll heal on my own,\" I said, watching as Jill retrieved my purse.\\n\\n \"You realize,\" added Adrian, \"you\u0027re going to have to get over your dieting fixation and consume some major calories to fight the blood loss. Sugar and fluids, just like Clarence. Good thing someone bagged up all this candy on the counter.\"\\n\\n Eddie walked over to Jill, and she paused as he asked if she was okay. She assured him she was, and although Eddie looked like he could kill about fifty more Strigoi, there was also a look in his eyes... something I couldn\u0027t believe I\u0027d never noticed before. Something I was going to have to think about. \"Damn it,\" said Adrian, fumbling with bandages. \"Eddie, go search Lee\u0027s body and see if there\u0027s a key for these goddamned handcuffs.\"\\n\\n Jill had been caught up in talking to Eddie but froze at the words \"Lee\u0027s body.\" Her face went so pale, she could have been one of the dead. In all the confusion, she hadn\u0027t noticed Lee\u0027s body in the chair. There\u0027d been too much movement with the Strigoi, too much distraction by the threat they presented. She took a few steps toward the living room, and that\u0027s when she saw him. Her mouth opened, but no sound came out right away. Then she sped forward and grabbed his hands, shrieking.\\n\\n \"No,\" she cried. \"No, no, no.\" She shook him, as though that would wake him. In a flash, Eddie was by her side, his arms around her as he murmured nonsensical things to soothe her. She didn\u0027t hear him. Her whole world was Lee.\\n\\n I felt tears spring to my eyes and hated that they were there. Lee had tried to kill me and then had summoned others to kill me. He\u0027d left a trail of innocents in his wake. I should be glad he was gone, but still, I felt sad. He had loved Jill, in his insane way, and from the pain on her face, it was clear she\u0027d loved him too. The spirit bond hadn\u0027t shown her his death or role in our capture. Right now, she simply thought he was a victim of Strigoi. Soon enough, she\u0027d learn the truth about his motives. I didn\u0027t know if that would ease her pain or not. I was guessing not.\\n\\n Weirdly, an image of Adrian\u0027s Love painting came back to me. I thought of the jagged red streak, slashing through the blackness, ripping it apart. Staring at Jill and her inconsolable pain, I suddenly understood his art a little bit better. \\n\\n","sourceLink":"https://allnovel.net/bloodlines-bloodlines-1/page-25.html","bookId":2041,"book":{"id":2041,"title":"Bloodlines (Bloodlines #1)","description":"Storyline: The first book in Richelle Mead\u0027s brand-new teen fiction series - set in the same world as Vampire Academy. When alchemist Sydney is ordered into hiding to protect the life of Moroi princess Jill Dragomir, the last place she expects to be sent is a human private school in Palm Springs, California. But at their new school, the drama is only just beginning. Populated with new faces as well as familiar ones, Bloodlines explores all the friendship, romance, battles and betrayals that made the #1 New York Times bestselling Vampire Academy series so addictive - this time in a part-vampire, part-human setting where the stakes are even higher and everyone\u0027s out for blood.\\n","cover":"https://allnovel.net/images/bloodlines-bloodlines-1.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/bloodlines-bloodlines-1.html","creation":"Oct 5, 2019 8:58:17 AM","modification":"Oct 5, 2019 11:37:01 PM"}}
