{"id":87735,"no":10,"title":"Page 10","content":"I notice her glance toward the window like she’s worried someone’s watching us. As much as I want to give in to the insatiable need I have to kiss her, I give her a quick peck on the cheek, instead. I release her and slowly walk back to my car. When her fingers release from mine, her arm drops to her side and she smiles a smile that quickly causes me to regret not kissing her better. As soon as I’m in my car, I conclude that there is absolutely no way I’ll be able to sleep tonight if I don’t rectify this.\\n\\n I roll down my window. “Lake, I’ve got a pretty long drive home. How about one for the road?”\\n\\n She laughs, then walks to my car and leans through the window. I slip my hand behind her head and pull her to me. The second our lips meet, I’m a goner. She parts her lips and at first, our kiss is slow and sweet. She reaches through the window and runs her hands through my hair, pulling me closer, and it completely drives me insane. My mouth becomes more urgent against hers and for a brief second, I contemplate canceling my trip this weekend. Now that I’ve finally tasted her, I know I won’t be able to go three days without it. Her lips are everything I’ve been imagining they would be. The door between us is pure torture. I want to pull her through the window and onto my lap.\\n\\n We continue kissing until we get to a point where we both realize that either she needs to climb inside the car with me, or we need to come to a halt. We simultaneously slow down and eventually stop, but neither of us pulls away.\\n\\n “Damn,” I whisper against her lips. “It gets better every time.”\\n\\n She smiles and nods in agreement. “I’ll see you in three days. You be careful driving home tonight.” She presses her lips against mine again, then pulls away.\\n\\n I regretfully back out of the driveway and into my own, wishing more than anything I wasn’t about to leave town for the next three days. When I exit my car she’s making her way back up her driveway. I watch as she gathers her hair and pulls it up in a knot, securing it with a band while she nears her front door. Her hair looks good like that. It looked great down, too. As I’m admiring the view, it dawns on me that I never even complimented her on how great she looked tonight.\\n\\n “Lake!” I yell. She turns around and I jog back across the street to her. “I forgot to tell you something.” I wrap my arms around her and whisper into her hair, “You look beautiful tonight.” I kiss her on top of the head, then release her and walk back to my house. When I reach my door, I turn around and she’s still standing in the same spot watching me. I smile at her and go inside, then immediately head straight for the window. When I pull back the curtain, I see her twirl back toward her house and practically skip inside.\\n\\n “What are you looking at?” Maya says.\\n\\n Her voice startles me and I snatch the curtain shut and turn around. “Nothing.” I take my jacket off and step on the heel of my shoe to ease my foot out of it. “Thanks, Maya. You want to watch him again next Thursday?”\\n\\n She stands up and heads to the front door. “Don’t I always?” she says. “But I’m not watching that weird one again.” She shuts the door behind her and I throw myself on the couch and sigh. This was by far the best date I’ve ever been on, and I have a feeling they’re only going to get better.\\n\\n 6.\\n\\n the honeymoon\\n\\n LAKE SMILES, THINKING back on how blissfully happy we both were after that date. “I had never had a night like that in my life,” she says. “Everything about it was perfect, from beginning to end. Even the grilled cheese.”\\n\\n “Everything except the fact that I failed to mention my occupation.”\\n\\n She frowns. “Well, yeah. That part sucked.”\\n\\n I laugh. “Sucked is an understatement for how I felt in that hallway,” I say. “But, we got through it. As tough as it was, look at us now.”\\n\\n “Wait,” she says, pressing her fingers to my lips. “Don’t jump ahead. Start from where you left off. I want to know what you were thinking when you saw me in the hallway that day. My god, you were so pissed at me,” she says.\\n\\n “Pissed at you? Lake, you thought I was mad at you?”\\n\\n She shrugs.\\n\\n “No, babe. I was anything but pissed at you.”\\n\\n oh, shit\\n\\n MY THREE-DAY WEEKEND. What can I say about my three-day weekend other than it was the longest, most treacherous three days of my entire life. I was distracted the entire time thinking about her. I could have kicked myself for not getting her phone number before I left; at least we could have texted. My grandfather apparently noticed the difference in my attention span during the course of the visit. Before we left their house last night, he pulled me aside and said, “So? Who is she?”\\n\\n Of course I played dumb and denied having met someone. What would he think if he knew I went on one date with this girl, and she already had me in a stupor? He laughed when I denied it and he squeezed my shoulder. “Can’t wait to meet her,” he said.\\n\\n I usually dread Monday mornings, but there’s a different air about today. Probably because I know I’ll get to see her after work today. I slide the note under the windshield wiper of her Jeep, then head back across the street to my car. As soon as I place my fingers on the door handle, I have second thoughts. I’m being way too forward. Who says, “I can’t wait to see you” in a note after one date? The last thing I want to do is scare her off. I walk back to her Jeep and lift the wiper blade to remove the note from her windshield.\\n\\n “Leave it.”\\n\\n I spin around and Julia is standing in their entryway, holding a cup of coffee between her hands. I look down at the note, then back at the Jeep, then back at Julia, not really knowing what to say.\\n\\n “You should leave it,” she says, pointing to the note in my hand. “She’ll like it.” She smiles and heads back into the house, leaving me completely and utterly embarrassed in her driveway. I place the note back under the windshield wiper and make my way back across the street, hoping Julia is right.\\n\\n “I TOLD YOU last week he was coming,” Mrs. Alex says in a defensive tone of voice.\\n\\n “No, you said he called about coming. You never told me it was today.”\\n\\n She turns to her computer and begins typing. “Well, I’m telling you now. He’ll be here at eleven o’clock to observe your fourth-period class.” She reaches to her printer and removes a freshly printed form. “And you’ll have a new student in your next class. I just registered her this morning. Here’s her information.” She hands me the form and smiles. I roll my eyes and shove the form into my satchel, suddenly dreading the remainder of the day.\\n\\n I walk in a hurry to third period considering I’m already five minutes late. I look down at my watch and groan. An eleven o’clock observation? That’s just an hour from now. All I have scheduled for my classes today are section tests. I wasn’t prepared to lecture at all, much less in front of my faculty advisor. I’ll just have to use this period to prepare something last-minute.\\n\\n God, could this day get any worse?\\n\\n When I round the corner to Hall D, the day somehow gets one hundred percent better as soon as I lay eyes on her.\\n\\n “Lake?”\\n\\n She’s got her hands in her hair, pulling it up into a knot again. She spins around and her eyes widen when she sees me. She pulls a sheet of paper from between her lips and smiles, then immediately wraps her arms around my neck.\\n\\n “Will! What are you doing here?”\\n\\n I return her hug, but the sheet of paper that just flashed in front of my face has left my entire body feeling like an immobile solid block of concrete.\\n\\n She’s holding a schedule.\\n\\n I suddenly can’t breathe.\\n\\n She’s holding a class schedule.\\n\\n This can’t be good.\\n\\n Mrs. Alex said something about enrolling a new student.\\n\\n Oh, shit.\\n\\n Holy shit.\\n\\n I immediately begin to internally panic. I wrap my fingers around her wrists and pull her arms away from my neck before someone sees us. Please let me be wrong. Please.\\n\\n “Lake,” I say, shaking my head—trying to make sense of this. “Where . . . what are you doing here?”\\n\\n She lets out a frustrated sigh and thrusts the schedule into my chest. “I’m trying to find this stupid elective but I’m lost,” she whines. “Help me!”\\n\\n Oh, shit. What the hell have I done?\\n\\n I take a step back against the wall, attempting to give myself space to think. Space to breathe.\\n\\n “Lake, no . . .” I say. I hand her back the schedule without even looking at it. There’s no need to look at it. I know exactly where her “stupid elective” is. I can’t seem to process a coherent thought while looking at her, so I turn around and clasp my hands behind my head.\\n\\n She’s a student?\\n\\n I’m her teacher?\\n\\n Oh, shit.\\n\\n I close my eyes and think back to the past week. Who have I told? Who saw us together? Gavin. Shit. There’s no telling who else may have been at Club N9NE. And Lake! She’s about to figure this out any second. What if she thinks I was trying to hide this from her? She could go straight to administration and end my career.\\n\\n As soon as the thought crosses my mind, she picks up her backpack and begins to storm off. I reach out and pull her to a stop. “Where are you going?” It’s obvious she’s pissed and I hope her intentions aren’t to report me.\\n\\n She rolls her eyes and sighs. “I get it, Will,” she says. “I get it. I’ll leave you alone before your girlfriend sees us.” She pulls her arm out of my grasp and turns away from me.\\n\\n “Girlfr—no. No, Lake. I don’t think you do get it.” I wait for her to process what’s happening. I would just come out and say it, but I can’t. I don’t think I could say it out loud if I wanted to.\\n\\n The sound of footsteps closing in on us diverts her attention away from me. Javier suddenly rounds the corner and comes to a quick stop when he sees me in the hallway.\\n\\n “Oh, man, I thought I was late,” he says.\\n\\n If Lake hasn’t figured it all out by now, she’s about to.\\n\\n “You are late, Javier,” I reply. I open the door to my classroom and wave him inside. “Javi, I’ll be there in a few minutes. Let the class know they have five minutes to review before the exam.” I slowly close the door behind me and look down at the floor. I can’t look at her. I don’t think my heart can take what she’s about to feel. There’s a brief moment of silence before she quietly gasps. I raise my eyes to hers and the disappointment on her face tears my heart in two. She gets it now.\\n\\n “Will,” she whispers painfully. “Please don’t tell me . . .”\\n\\n Her voice is weak and she tilts her head slightly to the side, slowly shaking her head back and forth. She isn’t angry. She’s hurt. I’d almost rather her be pissed right now than feel the way she’s feeling. I look up at the ceiling and rub my hands over my face in an attempt not to punch the damn wall. How could I be so stupid? Why wasn’t my profession the first thing I thought to share with her? Why did I not see this as a possibility? I continue to pace, hoping beyond all hope that I’m the one not getting it. When I reach the lockers in front of me, I tap my head against them, silently cursing myself. I’ve really screwed it up this time. For both of us. I drop my hands and reluctantly roll around to face her. \\n\\n","sourceLink":"https://allnovel.net/this-girl-slammed-3/page-10.html","bookId":2781,"book":{"id":2781,"title":"This Girl (Slammed #3)","description":"Storyline: This Girl (Slammed #3) \\n Layken and Will’s love has managed to withstand the toughest of circumstances and the young lovers, now married, are beginning to feel safe and secure in their union. As much as Layken relishes their new life together, she finds herself wanting to know everything there is to know about her husband, even though Will makes it clear he prefers to keep the painful memories of the past where they belong. Still, he can’t resist his wife’s pleas and so he begins to untangle his side of the story, revealing for the first time his most intimate feelings and thoughts, retelling both the good and bad moments, and sharing a few shocking confessions of his own from the time when they first met.\\n","cover":"https://allnovel.net/images/this-girl-slammed-3.jpg","author":"Colleen Hoover","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/this-girl-slammed-3.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:23:11 PM"}}
