{"id":87728,"no":3,"title":"Page 3","content":"“Get ’em!” I yell to her. They’re trying to fight to get away so I strengthen my grip. I look back up at her and we lock eyes.\\n\\n Wow. Those eyes. They’re the most incredible shade of green I’ve ever seen. I try to compare the color to something, but nothing comes to mind. It’s so unique, it’s like her eyes have just invented their own hue.\\n\\n Studying her features, I conclude she can’t be the boy’s mom. She looks my age. At the least, maybe nineteen or twenty. I need to find out her name. If I know her name I can look up her Facebook page and at least see if she’s single.\\n\\n Christ. This is the last thing I need in my life right now. A crush.\\n\\n I feel like she knows what I’m thinking, so I force myself to break our gaze. The boy takes my moment of distraction and uses it to his advantage. He breaks free and slices at me with an imaginary sword, so I look back up at the girl and mouth “help.”\\n\\n She yells “brains” again and lunges forward, pretending to bite Caulder on top of the head. She tickles them until they melt onto the concrete driveway, then she stands back up and laughs. Her cheeks flush when she meets my gaze again and she contorts her mouth into an uncomfortable grimace, like she’s suddenly embarrassed. Her unease disappears just as fast as it appeared and is replaced by a smile that suddenly makes me want to know every single minute detail about her.\\n\\n “Hey, I’m Will,” I say, extending my hand out to her. “We live across the street.” She places her hand in mine. It’s soft and cold, and the moment I wrap my fingers around hers, the physical contact sends a shockwave straight through me. I don’t remember the last time a girl has had this kind of immediate effect on me. It must be my lack of sleep last night.\\n\\n “I’m Layken,” she says, her uneasiness once again masking her smile. “I guess I live . . . here.” She glances at the house behind her, then back to me.\\n\\n She doesn’t look too pleased about the fact that she lives “here.” That same look she had while sitting in the U-Haul consumes her features again and her eyes suddenly grow sadder. Why does that look affect me so much?\\n\\n “Well, welcome to Ypsilanti,” I say, wanting desperately to make that look go away. She looks down and it occurs to me that I’m still awkwardly shaking her hand, so I quickly pull it away from hers and shove my hands in my jacket pockets. “Where are you guys moving here from?”\\n\\n “Texas?” she says.\\n\\n Why does she say it like a question? Did I just ask a stupid question? I did. I’m making stupid small talk.\\n\\n “Texas, huh?” I say. She nods her head, but doesn’t come back with a response. I suddenly feel like an intrusive neighbor. I don’t know what else to say without making it even more awkward, so I figure my best move at this point is to retreat. I bend over and grab Caulder by the feet, throwing him over my shoulder, then tell her I’ve got to get him to school. “There’s a cold front coming through tonight. You should try to get as much unloaded today as you can. It’s supposed to last a few days, so if you guys need help unloading this afternoon, let me know. We’ll be home around four.”\\n\\n She shrugs. “Sure, thanks.”\\n\\n Her words are laced with the slightest hint of a southern drawl. I didn’t know how much I liked southern accents until now. I continue across the street and help Caulder into the car. While he’s climbing inside, I glance back across the street. The little boy is stabbing her in the back and she lets out a fake cry and falls to her knees. Her playful interaction with him is just one more thing that intrigues me about her. After he jumps on her back, she glances up and catches me staring at her. I shut Caulder’s door and walk to my side. Before I get in, I muster a smile and wave, then climb into the car with an overwhelming urge to punch myself.\\n\\n AS SOON AS the bell for third period rings, I open the lid to my coffee and pour two extra packets of sugar in. I’m about to need it. There’s something about some of the students in third period that rub me the wrong way. Especially Javier. That kid is such a jackass.\\n\\n “Morning, Mr. Cooper,” Eddie says, taking her seat. She’s as bubbly as ever. I’ve never seen Eddie in a bad mood, come to think of it. I need to figure out her secret, since the coffee obviously isn’t doing it for me today.\\n\\n “Morning, Eddie.”\\n\\n She turns and kisses Gavin on the cheek, then settles into her desk. They’ve been dating since right after I graduated. They’re probably the only two people that don’t annoy the hell out of me in here. Well, them and maybe Nick. Nick seems okay.\\n\\n After the students are all seated, I instruct them to get out their books. The entire time I’m giving my lecture on the elements of poetry, my mind keeps wandering to the new neighbor.\\n\\n Layken.\\n\\n I like that name.\\n\\n AFTER SIX HOURS and only a few dozen thoughts of the new neighbor later, Caulder and I finally pull into the driveway. I shut my car door and open the back door to remove the box of papers. When I turn back around, Layken’s little brother has appeared out of nowhere and he’s standing right in front of me, staring silently. It seems as though he’s waiting on an introduction. Several seconds pass without him moving a muscle or blinking. Are we in a standoff? I shift the box to my left arm and reach out my hand.\\n\\n “I’m Will.”\\n\\n “Kel is name my,” he says.\\n\\n I stare at him blankly. Was that even English?\\n\\n “I can talk backwards,” he says, explaining the clutter of words that just came out of his mouth. “Like this. Backwards talk can I.”\\n\\n Interesting. Someone possibly weirder than Caulder? I didn’t think it was possible.\\n\\n “Kel . . . you meeting . . . nice . . . was . . . it well,” I say, a little slower than when he does it. He grins, then runs across the street with Caulder. I glance at their house and see that the U-Haul is now parked in the street with the latch shut. I’m disappointed they’ve already unloaded it; I was actually looking forward to helping.\\n\\n I spend the rest of the evening working overtime for free . . . another side effect of being a teacher. I decide after my shower to make a living room detour to glance across the street for about the tenth time, but I don’t see her.\\n\\n “Why do you keep looking out the window?” Caulder asks from behind me.\\n\\n His voice startles me and I snatch the living room curtain shut. I didn’t realize he was sitting on the couch. I walk over to him and pull on his hand, then shove him toward the hallway. “Go to bed,” I say.\\n\\n He spins around before he closes his bedroom door behind him. “You were looking out the window to see if you could see that girl, weren’t you? Do you like Kel’s sister?”\\n\\n “Goodnight, Caulder,” I say, ignoring his question.\\n\\n He grins and closes the door to his room. Before I head to my own bedroom, I walk to the window one more time. When I open the curtain, someone is standing in the window across the street with the curtains partially open. They suddenly snatch shut and I can’t help but smile, wondering if she’s just as curious about me as I am about her.\\n\\n “IT’S COLD, IT’S cold, it’s cold, it’s cold, it’s cold,” Caulder says, jogging in place while I unlock the car doors. I crank the engine and turn the heat up, then head back inside to get the rest of my things while Caulder waits in the car. When I open the door to head back outside, I stop in my tracks when I see Layken standing in her entryway. She bends down and gathers a handful of snow to inspect it, then quickly drops it. She stands up and steps outside, closing the door behind her. I shake my head, knowing exactly what’s about to happen. It’s snowing and she isn’t even wearing a jacket over her pajama bottoms and shirt. I don’t know what she’s doing, but she won’t last long out here. She’s not in Texas anymore. She begins to make her way to the driveway when my gaze falls on her feet.\\n\\n Is she wearing house shoes? Seriously? Before I can even yell a warning, she’s flat on her back.\\n\\n Southerners. They just don’t get it.\\n\\n She doesn’t move at first. She lies still in the driveway, staring up at the sky. A rush of panic overcomes me, thinking she may be hurt, but then she begins to pull herself up. As much as I don’t want to come off like a bumbling idiot again, I head across the street to make sure she doesn’t need my help.\\n\\n The look on her face when she pulls one of the gnomes out from beneath her makes me laugh. It’s almost like she’s blaming the poor guy for her fall. She pulls her arm back to throw him when I stop her.\\n\\n “That’s not a good idea!” I yell, making my way up her driveway. She tilts her head up and looks at me with a death grip on the gnome. “Are you okay?” I ask, still laughing. I can’t help but laugh, she looks so pissed!\\n\\n Her cheeks redden and she glances away. “I’ll feel a lot better after I bust this damn thing.”\\n\\n I take the gnome out of her hands when I reach her. “You don’t want to do that, gnomes are good luck.” I place the freshly injured gnome back in his spot before she destroys him completely.\\n\\n “Yeah,” she says, inspecting her shoulder. “Real good luck.”\\n\\n I immediately feel guilty when I see the blood on her shirt. “Oh, my god, I’m so sorry. I wouldn’t have laughed if I knew you were hurt.” I assist her up and get a better look at the amount of blood coming from her injury. “You need to get a bandage on that.”\\n\\n She looks back to her house and shakes her head. “I wouldn’t have any clue where to find one at this point.”\\n\\n I glance at our house, knowing I have a full supply of bandages in the first-aid kit. I’m hesitant to offer them, though, since I’m already running late for work as it is.\\n\\n I’m looking at my house, struggling with my indecision, when all five of my senses are suddenly flooded. The slightest smell of vanilla that permeates the air around me . . . the sound of her accent when she speaks . . . the way her close proximity wakes up something inside me that’s long been dormant. Holy hell. I’m in trouble.\\n\\n Work can wait.\\n\\n “You’ll have to walk with me. There are some in our kitchen.” I take my jacket off and wrap it around her shoulders, then help her across the street. I’m sure she can walk on her own, but for some reason I don’t want to let go of her arm. I like helping her. I like the way she feels leaning against me. It seems . . . right.\\n\\n Once we’re inside my house, she follows me through my living room as I head to the kitchen to find a bandage. I pull the first-aid kit out of the cabinet and remove a Band-Aid. When I glance back at her, she’s looking at the pictures on our wall. The pictures of my mom and dad.\\n\\n Please don’t ask me about them. Please.\\n\\n This is not a conversation I want to have right now. I quickly say something to deflect her attention away from the pictures. “It needs to be cleaned before you put the bandage on it.” I roll up my sleeves and turn on the faucet, then wet the napkin. I catch myself taking my time when I know I should be in a hurry. For whatever reason, I just want to drag this time out with her. I don’t know why I feel like my desire to know her better has suddenly turned into a need to know her better. I turn back around and she darts her eyes away from me when I look at her. I don’t really understand her sudden embarrassed look, but it’s cute as hell. \\n\\n","sourceLink":"https://allnovel.net/this-girl-slammed-3/page-3.html","bookId":2781,"book":{"id":2781,"title":"This Girl (Slammed #3)","description":"Storyline: This Girl (Slammed #3) \\n Layken and Will’s love has managed to withstand the toughest of circumstances and the young lovers, now married, are beginning to feel safe and secure in their union. As much as Layken relishes their new life together, she finds herself wanting to know everything there is to know about her husband, even though Will makes it clear he prefers to keep the painful memories of the past where they belong. Still, he can’t resist his wife’s pleas and so he begins to untangle his side of the story, revealing for the first time his most intimate feelings and thoughts, retelling both the good and bad moments, and sharing a few shocking confessions of his own from the time when they first met.\\n","cover":"https://allnovel.net/images/this-girl-slammed-3.jpg","author":"Colleen Hoover","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/this-girl-slammed-3.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:23:11 PM"}}
