{"id":88078,"no":29,"title":"Page 29","content":"\n He lifted her again, carried her back into the shower, then hiked her higher and pressed her back against the tile, cool against the heat. He lifted her higher and higher, gazing at her all the while, as the water streamed down on them in a steady cascade, like a honeyed oil, adding to the friction, the insanity, the desperation.\n When she was high enough, he lowered her, bringing her down on his erection, slowly at first, his eyes never leaving hers, until she cried out with a soft sound, tearing her own gaze away, burying her face low against his shoulder as he began to move. The searing, driving pulse of the spray seemed to echo the thunder in his veins, resound in the knotted wire of his every muscle. He was completely unaware of her weight, barely aware of her limbs wrapped around his waist. She sheathed him, rode the thrust and fire of his desperate arousal, the soft sounds escaping her lips driving him into a frenzy. Her fingers dug into him. Her lips found his in a deep and jagged kiss, tongue driving hard into the depths of his mouth. There was a moment when he lost recognition of anything other than the steam, the heat, the rising pulse and the need centered in that one portion of his body. Then he was wrenched from the spiral of his own satisfaction by the cry that tore from her lips. Her back arched against the tile, and he felt the eruption of his own climax, ripping through him like a tidal wave.\n She was draped around him now, lax and trembling slightly, almost as if she had passed out against him.\n Then she moved, eyes meeting his, fingers trailing through the wet length of his hair. She smiled and, to his amazement, whispered, \"Thanks.\"\n He eased her slowly down, turning the water off at last, his eyes never leaving hers. He inched back, feeling lost when his penis slipped from her body, loath to set her slowly on her own feet.\n \"Thanks?\" he asked, leaning against her again, gently finding her cheek with the pad of his thumb.\n \"I was beginning to think there was something wrong with me.\"\n She was trying to be light, he realized. Not denying anything, just leaving him plenty of room to take an emotional step back.\n He shook his head gravely. \"There\u0027s nothing wrong with you. Quite the contrary, there\u0027s far too much right with you.\"\n Her smile deepened, then faded as she looked into his eyes. \"Then… what took you so long?\"\n \"I came rushing in here the second you screamed.\"\n \"I didn\u0027t mean just now.\"\n \"Actually, we haven\u0027t known each other that long.\"\n \"I knew the second I saw you that I wanted you,\" she whispered, her voice serious and ever so slightly wistful.\n \"Because… ?\"\n \"Because you touched me,\" she said simply.\n He pulled her close against him. With the water off and the fever of the moment released, the air-conditioning was kicking in, and he was growing chill, standing damp and naked. Brent reached for a towel, wrapping it around her shoulders.\n He touched her chin, lifting her eyes to his.\n \"Because I touched you?\" he whispered. \"I didn\u0027t think you even liked me at first.\"\n \"I didn\u0027t.\"\n \"That\u0027s honest.\"\n \"I didn\u0027t want to like you,\" she said quietly, and walked out of the bathroom.\n Brent followed. She was standing in the growing darkness at the foot of the bed. It was fall but the balcony doors were closed, the drapes drawn, and the room was cast in soft shadow.\n She threaded her fingers through her drying hair, waiting. She had dropped the towel. In the soft light, she was ethereal, yet far too real, a piece of mystical art, Venus rising, something perfect caught by the imagination of an artist.\n He walked toward her, not touching her at first, then reaching for her chin. His lips met hers with a slow, infinite tenderness, and then he drew her to him. \"Confession… I did little but think about you the night after I came upon you in the street. I\u0027ve been so fascinated by you that I\u0027ve had to walk away at times. The way I feel… scares me.\"\n She smiled, head tilted close to his. \"I don\u0027t usually behave this way. I\u0027m usually reserved. I guess you couldn\u0027t tell tonight, huh? But there\u0027s such a thing as chemistry. And… I\u0027m… I don\u0027t know what I\u0027m saying.\"\n \"But I do,\" he told her, and he folded her into his arms again.\n There were some things in life that simply… were.\n And once they began…\n This time he wanted everything, and he meant to give everything in return. He felt as if they had a lifetime to catch up on, a lifetime to get to know each other, and at the same time, he wanted no words, no sense of before and no thought of after. This was a time for breathing, scent and feel, flesh and heartbeat, and all that came between. And so he was slow, deliberate, moving her hair, kissing her nape, his lips exploring the length of her spine, inhaling the sweet scent of her skin, learning the essence beneath, shape and form and feel. For long moments she was still, allowing his exploration, savoring. Then she turned in his arms, and when she met his lips, her own were hungry. The kiss was long and deep, wet, hot and intimate, promising all that was to follow.\n Their hands were all over one another then, and he wasn\u0027t even aware of when they fell upon the cool length of the bed. He was aware only of her fingertips sliding over him, the feel of her lips against his flesh, the erotic graze of her teeth against his shoulders, his ribs, down his chest, teasing, touching…\n Hands, lips.\n His.\n Hers…\n Brushing, searing. The most intimate of hot, wet caresses.\n Dusk became dark. They remained entwined, drifting…\n He felt her start, and his eyes flew open. His arms tensed around her.\n \"Nikki?\" he said gently.\n She was taut. \"I thought I… \"\n \"Andy?\"\n \"No… just something silly. I thought I heard someone turning the knob on the front door. I probably couldn\u0027t hear that from up here, could I?\" she asked very softly.\n He slid from bed, stooping down for the towel she had discarded. Wrapping it around his waist, he started silently from the bedroom.\n \"Wait,\" she entreated.\n \"Nikki, you should—\"\n \"Come with you,\" she said firmly.\n She slipped into the bathroom for a second towel, then followed him in the darkness through the house. A small light burned in the kitchen, enough to guide them quickly to the door.\n He didn\u0027t touch it at first. He waited, listening. There was no sound, and the knob didn\u0027t move. After a moment, he silently slid the bolt, then opened the door.\n Outside, the streetlights of New Orleans burned through the night, casting a glow over the brick wall, creating shadows by the tree, the porch and the swing. A breeze stirred, bringing a touch of relief from the day\u0027s heat. If anyone had been on the porch before, they were gone now.\n \"Silly, huh?\" she murmured.\n He stepped back in, locking and bolting the door. He cupped her chin. \"Nothing is silly. Anytime you think something\u0027s wrong, tell me.\"\n She smiled. \"I\u0027m feeling something right now.\"\n \"Wow. I\u0027m flattered.\"\n She laughed, and the sound was good.\n \"Hunger,\" she told him.\n \"Consider me an all-you-can-eat buffet,\" he teased.\n She laughed softly. \"I meant for dinner.\"\n \"It\u0027s almost 2:00 a.m.\"\n \"I know an all-night diner where they make fantastic po\u0027boys.\"\n He considered her suggestion. \"We can get something to eat, then go to my B \u0026 B for some of my own clothes.\"\n She smiled. \"I\u0027ll get dressed. You should, too.\"\n She headed for the stairs, but he hesitated, listening.\n There was nothing to hear. Whether Nikki had imagined the earlier sound or not, he didn\u0027t know, but it troubled him.\n Andrea Ciello had returned to her apartment at about 2:00 a.m.\n Soon after that, she had died.\n At just about the same time.\n And Brent was certain, just as Nikki was, that Andrea hadn\u0027t brought on her own death.\n Someone had entered her apartment without any sign of force. From what he had gleaned from Nikki, Andy didn\u0027t know herself who had come through her door. So either she had forgotten to lock it, or someone had access to her apartment.\n Nikki\u0027s door had been locked and bolted tonight. Had someone been trying to enter with a key?\n \"Brent?\" Nikki called curiously from upstairs.\n \"I\u0027m on my way,\" he called back.\n He checked the lock on the door once again. It was secure.\n He followed her up the stairs.\n Patricia awoke with a start, wondering why. Then she realized that she was lying alone in bed. She got up, found a robe, slipped into it. She could hear the old air conditioner thumping and whining as she made her way out to the kitchen.\n Nathan was there, pouring a glass of juice. He was barefoot and shirtless, but wearing jeans.\n \"Hey,\" she said. As she walked around the counter, she nearly tripped over a pair of shoes, edged them out of the way and made her way to him.\n \"Did I wake you? Sorry,\" he said. His dark hair was mussed. Very sexy, she thought.\n She smiled, coming up behind him, slipping her arms around his waist and laying her cheek against his back. \"You didn\u0027t actually wake me. I just woke up, and you weren\u0027t there, and I missed you. That\u0027s a little scary, huh?\"\n He eased around to face her. There was a soft sheen of sweat on his body, as if he\u0027d had a nightmare, or been engaged in some kind of physical activity.\n \"I\u0027ve had trouble sleeping lately,\" he told her.\n \"Is it me? Are you doubting that we should be together?\" she asked seriously, her heart thundering painfully.\n \"No, of course not.\"\n \"I\u0027m a big girl. You can tell me if it\u0027s true.\"\n He touched her cheek with tender affection. \"You\u0027re the best thing in the world. The best thing ever to happen to me,\" he said quietly.\n She took the juice from his grip, caught his hand and started to lead him back to the bedroom. \"I\u0027m going to make you sleep,\" she promised him.\n \"Oh, yeah?\" \n","sourceLink":"https://allnovel.net/ghost-walk-harrison-investigation-2/page-29.html","bookId":2268,"book":{"id":2268,"title":"Ghost Walk (Harrison Investigation #2)","description":"Storyline: \n Ghost Walk (Harrison Investigation #2) \n Nikki DuMonde\u0027s newest employee is standing at the end of her bed at four o\u0027clock in the morning begging for help. It\u0027s a joke, right? Besides, as manager of a successful New Orleans haunted-tour company, Nikki doesn\u0027t scare easily. But in the light of day, harsh reality sets in as a police officer informs her that Andy was brutally murdered--at the exact time Nikki swears the distraught woman was in her room. No one believes her except Brent Blackhawk, a paranormal investigator desperately trying to forget his tragic past. Half Irish, half Lakota--and able to communicate with the dead--Brent is used to living in two worlds. But when he realizes the ghost of a slain government agent is also trying to reach out to Nikki, he knows that she, too, must listen to the dead...if she wants to keep living.\n \n","cover":"https://allnovel.net/images/ghost-walk-harrison-investigation-2.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/ghost-walk-harrison-investigation-2.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:25:13 PM"}}
