{"id":75487,"no":25,"title":"Page 25","content":"Bronwyn turned away angrily and carried Kayla back into the house. She headed straight for the baby’s room and after tucking her in, stood beside the cot and watched the baby sleep, her heart absolutely overflowing with love for the innocent child.\n “You’re worth everything, my darling,” she whispered, leaning over to kiss her short, silky curls. When she straightened up and turned around, Bryce was standing in the doorway, still wearing nothing but his board shorts. She frowned resentfully, annoyed that a deaf man could move so silently, and moved to pass him. He barely shifted, crowding her abominably as she tried to squeeze through the doorway and into the hall. She flushed crimson when she inadvertently brushed against his muscular naked chest. She frowned up at him, making sure he was looking at her before she spoke.\n “Get out of my way,” she demanded, and he grinned lazily.\n “Glad to see you’re getting your fire back, babe . . .”\n “Don’t call me that,” she reprimanded, and he grinned.\n “You never complained before.” She went an even brighter red as she recalled the very rare instances during which he had used the endearment in the past—always in the most intimate of circumstances and very rarely outside of bed. He had used it now just to rattle her—she could see it in his eyes. She pursed her lips and pushed her way past him. He grabbed her wrist, just as she thought she’d managed to escape.\n “Pierre and Alice are coming around for dinner,” he informed her idly, ignoring the way she tugged furiously, trying to get loose. “Try not to embarrass me with any more lies or insincere shows of concern while they’re here.” She gasped at the sharp stab of pain at his casual cruelty.\n “Bryce, I’m really starting to hate you,” she stated conversationally, and he raised his brows lazily.\n “Are you?” He smiled. “That’s a shame. I did so enjoy being worshipped by you.”\n “I never worshipped you, you arrogant bastard!” she managed furiously. “I loved you. More than you could ever comprehend.” His grip slackened and she tugged herself free. “I now see that you never deserved that love!” He seemed unable to respond, merely keeping his level gaze on her emotional face. She made a despairing little sound in the back of her throat and turned to walk away.\n “Bronwyn,” he called after her, and she stopped, her back going rigid as she braced herself for another blow. “If you loved me you would never have left me.”\n “I didn’t leave you, you jackass,” she muttered beneath her breath, knowing that he could not see the denial while she stood with her back to him.\n “You would never have driven off without giving me the chance to apologize . . .” His voice was closer, and she knew that he had come up right behind her. “You would have stayed to hear me grovel and beg your forgiveness, because if you loved me, you would have known me well enough to appreciate that an apology would not be far off.” His hands came to rest on her narrow shoulders, and she flinched as she felt the warmth of his flesh through the thin cotton of her T-shirt. She turned around slowly and lifted her eyes to meet his.\n “I knew that,” she admitted. “I left to give you some space to clear your head and to give myself time to gather my own confused thoughts. I knew you’d come and that’s the reason I waited and waited and waited at that damned beach house! I knew you would come . . . only you never did.\n “When I eventually concluded that maybe you really wanted nothing to do with us, I called your office to talk about child support and was quite bluntly informed that—Mr. Palmer did not want to speak to me or hear from me ever again—You weren’t answering your cell phone, and nobody was answering at the house.” She watched as his eyes hardened and his hands fell away.\n “My God, can’t you ever stop lying?” he muttered in frustration. “I could buy into maybe being mistaken about seeing you at the scene of my accident. I can even try to believe that maybe you hadn’t seen a single newspaper article, television report, or heard any radio news, but none of my people would ever have said those words to you!”\n “Oh, believe what you want, Bryce,” she responded wearily and turned away. She was so sick of defending herself to him.\n “Oh no you don’t.” He caught her arm in a bruising grip to prevent her from walking away. “I spent two years looking for you, Bronwyn. Why would I have told my staff to stonewall you when I was trying so hard to find you? So you are not going to try to make me feel guilty about something that I never authorized, something that would never have happened, not in a million years!” She shook her head and stepped back, jerking her arm violently out of his tight grip before deciding to make use of some of the SASL that she had learned and using her hands rather eloquently to say something quite unmistakable. For a second he was taken aback, and he blinked a couple of times before bursting into laughter, the sound so natural and spontaneous that it took her completely by surprise.\n “You didn’t just tell me to . . .” He trailed off before saying the obscenity, and she jutted her jaw stubbornly, refusing to be charmed by his genuine amusement.\n “So what if I did?” she asked defiantly. His eyes were still brimming with laughter as he shrugged.\n “Nothing, I’m just impressed with your extensive knowledge of SASL.” He shrugged and she went bright red.\n “Not that extensive,” she told him self-consciously. “It was the first thing I learned because I knew that it would probably come in handy in most of my dealings with you.” \n","sourceLink":"https://allnovel.net/a-husband-s-regret-unwanted-2/page-25.html","bookId":1837,"book":{"id":1837,"title":"A Husband\u0027s Regret (Unwanted #2)","description":"Storyline: \n Tall and thin, twenty-eight-year-old Bronwyn Palmer has become positively gaunt, a ghost of her former self. That self was?and still is?the wife of a rich, handsome executive with an ocean-view house and his own security staff. \n It was in that house, two years ago, that Bryce Palmer learned Bronwyn was pregnant with their first child. But Bryce\u0027s rage over his impending fatherhood touched off a chain reaction of emotional and physical traumas that wounded them both. For Bronwyn, it meant fleeing the perfect marriage to start over with nothing but a precocious daughter named Kayla to care for. For Bryce, it meant a tortuous two years spent blaming his wife for deserting him, and living with the pain of not knowing his child. Now a chance encounter has brought Bronwyn back into Bryce\u0027s life, both bearing scars?and neither knowing the whole truth of that fateful night that drove them apart.\n \n","cover":"https://allnovel.net/images/a-husband-s-regret-unwanted-2.jpg","author":"Natasha Anders","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/a-husband-s-regret-unwanted-2.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:34:35 AM"}}
