{"id":75491,"no":29,"title":"Page 29","content":"“Bryce,” she tried to find a way to explain her decision to him and drew a complete blank. “After four months of constant and inexplicable rejection, I gave up on trying to reach you. By that point I didn’t think that you deserved to have the baby or me in your life. I wanted to move on and couldn’t do so with your money. I needed to do it on my own, without being beholden to the man who had made it clear that he didn’t want anything to do with us. I didn’t feel entitled to your money after making that decision.” “You didn’t feel entitled to it?” Bryce latched onto those words, obviously dismissing the rest of what she had said. “To the father of your child’s money? I don’t even know how to respond to that, Bronwyn. You may not have felt entitled to it, but Kayla certainly was, and is, entitled to it. You could have set aside your pettiness and considered her in all of this!” “Oh please just stop throwing Kayla in my face. I did everything I could for her. I gave her the best I could afford after you kicked us out. How was I supposed to know you’d have this turnaround where the baby was concerned? As far as I knew, you didn’t want her and didn’t think that she was entitled to anything you had. She didn’t want for anything. Her clothes may not have had designer tags and her toys may have been secondhand, but my baby was well loved and well taken care of. Don’t you dare imply anything else!” More interminably silent staring from him, but she refused to lower her eyes, refused to be intimidated or cowed by him. Instead she met his inscrutable gaze head-on, with chin tilted defiantly, eyes sparking, and fists clenched. She looked like a feral cat ready to defend herself and her baby against any and all threats. “What time are you meeting Alice?” The question threw her completely, and she blinked in astonishment, surprised and relieved that he had let it drop. She checked her watch. “In about half an hour,” she told him. “You will come back?” Not understanding the question, she merely stared at him confusedly for a few moments. “What?” “You won’t run off again?” he rephrased, and she reeled in shock at the depth of vulnerability and insecurity his question had revealed. “Uh . . . n-no. Mikayla . . .” was all she managed, and he nodded shortly, realizing that she would never leave without her daughter. “If not for Mikayla . . .” He seemed to ask the question before he could stop himself, and in doing so, clearly revealed a lot more than he had ever intended to reveal. “Would you come back?” She hesitated, her eyes lowered as she pondered the question, and seeing the uncertainty on her face, Bryce made a slight movement with his hand. “Forget it,” he snapped, before she could even think about formulating a response. “It was a stupid question, and it’s really not that important. As long as you don’t leave with my daughter, I don’t give a damn what you do.” Somehow the words sounded hollow and untrue, ringing with bravado and not much conviction. They avoided each other’s eyes—each afraid of the truth they might spy in the other’s gaze. “I have to go,” she muttered evasively, getting up from the chair. He jumped up too and caught her arm to halt her progress. “Wait.” She stood quietly in his grasp, her eyes searching his harsh features warily. He looked moody and uncertain, not at all sure of what he wanted to say or even why he’d halted her progress. “I don’t want you to go by yourself,” he said, almost reluctantly. “I want one of the security team to go with.” Bronwyn frowned at that. She had always hated the discreet security detail that had followed them just about everywhere after they had first gotten married and had complained about it so much that he had cut her personal detail down to one supposedly unobtrusive guard to keep her happy. Bronwyn had agreed to the compromise because the one guy had been better than a team, but she had never felt comfortable with what she had always felt was a blatant display of wealth. “Bryce, I don’t want to have some gorilla following me around all afternoon,” she snapped, and his lips tightened. “I’ll ask Cal to take care of the matter personally.” Cal was his head of security and Bronwyn had always liked the quiet man who read Shakespearean sonnets in his spare time. She hadn’t really seen him since her return. She was relieved to learn that he still worked for Bryce since she had feared that she might have gotten him into trouble after instructing him to take that fateful night off two years ago. She had wanted a private and romantic evening with her husband and had dismissed the entire staff. She knew that it was probably one of the only reasons she had been able to disappear so completely. Cal had left only a skeleton staff on duty that night. Her personal guard, not expecting her to leave the house that night, had also been given the night off. “I’m glad Cal still works for you,” she said, all the heat fleeing from her voice and expression. “He’s been acting as my personal guard,” Bryce said before making an odd sound in the back of his throat. “You still have my numbers right?” he continued hesitantly, and she nodded again. “If you need anything, or if you feel ill, call me.” “Bryce.” She smiled reassuringly up into his eyes. “I’m fine, but in the unlikely event of that status quo changing, I’ll be sure to give you a call.” His eyes frosted over. “Don’t mock me, Bronwyn,” he said coldly, and she shook her head, alarmed that he had misread her humor.","sourceLink":"https://allnovel.net/a-husband-s-regret-unwanted-2/page-29.html","bookId":1837,"book":{"id":1837,"title":"A Husband\u0027s Regret (Unwanted #2)","description":"Storyline: Tall and thin, twenty-eight-year-old Bronwyn Palmer has become positively gaunt, a ghost of her former self. That self was?and still is?the wife of a rich, handsome executive with an ocean-view house and his own security staff. It was in that house, two years ago, that Bryce Palmer learned Bronwyn was pregnant with their first child. But Bryce\u0027s rage over his impending fatherhood touched off a chain reaction of emotional and physical traumas that wounded them both. For Bronwyn, it meant fleeing the perfect marriage to start over with nothing but a precocious daughter named Kayla to care for. For Bryce, it meant a tortuous two years spent blaming his wife for deserting him, and living with the pain of not knowing his child. Now a chance encounter has brought Bronwyn back into Bryce\u0027s life, both bearing scars?and neither knowing the whole truth of that fateful night that drove them apart.","cover":"https://allnovel.net/images/a-husband-s-regret-unwanted-2.jpg","author":"Natasha Anders","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/a-husband-s-regret-unwanted-2.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:34:35 AM"}}
