{"id":7691,"no":26,"title":"Chapter 4 Mixed Messages.","content":"Rosa, a waitress, folds up the ad she\u0027s torn from a newspaper,clears off the table where her new computer willsit and leaves her apartment. \n \n At the electronics store, as Rosa hovers over the latestdesktop model from Megahype, a young salesman noticesthe ad in her hand and wanders over to her. He unbuttonshis jacket, spreads his hands out, palms up, and looks herin the eye. \"I see you found it already,\" he says with asmile. \"Hi, my name\u0027s Tony.\"For the next 10 minutes, a relaxed and sincere Tony talksto Rosa. He faces her with his hands exposed and leans forwardfrom time to time as they discuss the features of thecomputer. Rosa listens with interest, her head tilted to oneside and her hand on her cheek, as Tony offers to \"throwin\" $95 of extras and even agrees to \"eat the tax.\"Finally, stroking her chin as she forms a decision, Rosanods. \"Yes,\" she says, \"this is the model for me.\"\"Great,\" says Tony, eagerly rubbing his palms together. \n \n \"It will take about five minutes to take it down and findsome boxes.\"Rosa looks sideways at him and frowns. \"You don\u0027t havea new one in a box?\"\"That might be hard to find right now.\" Tony\u0027s handsbecome fists, and he pops them into his pockets. -*56\"They\u0027re such an unbelievable deal—they\u0027ve just been flyingout of the store.\" He buttons up his jacket, shrugs hisshoulders and laughs nervously. \n \n \"So this is a demonstration model?\" Rosa tilts her head,inquiring. \n \n \"Just came on the floor this morning,\" Tony shoots backwith an insincere smile. He folds his arms in front of hischest and turns himself sideways to her, pretending to bedistracted by something going on in the TV departmentnearby. His voice falters and weakens as he says, \"It has thesame warranty as a new one.\"Rosa rubs the side of her nose in doubt. \"Came on thefloor this morning? Fine. Can I have that in writing?\"Tony\u0027s back is turned to her as he leans over the monitor,fiddling with the cables—any excuse not to look at her. \n \n He catches a glimpse of himself in one of the wall mirrors. \n \n Oh boy, what an idiot I am, he thinks. He bites his lip andturns back to face Rosa. \n \n But Rosa is gone. \n \n As a good waitress, Rosa is used to reading body language. \n \n She saw that the salesman\u0027s gestures conflicted(lacked congruity) with his words, and she knew thatshe should believe the gestures. The change in Tony\u0027svoice tone from informing to pleading just served toconfirm her feelings of doubt. \n \n 57of communication; and 1% of what we respond toinvolves the actual words we use. \n \n The Professor called these the three \"V\u0027s\" of communication: \n \n the visual, the vocal and the verbal. And tobe believable, they must all give out the same message. \n \n This is at the very foundation of rapport by design. \n \n Over one-half of all communication is nonverbal! It isthe look of the communication, our body language, thatcounts the most: the way we act, dress, move, gesture,and so on. \n \n Need proof? Think of the last time you were withsomeone who stood with her arms crossed, tappingher foot and looking annoyed, and then huffed the words\"I\u0027m fine.\" Which clues did you believe—the words orthe body language and tone of voice? Physical messagesoften send a much louder message than spoken words. \n \n Since 55% of your communication occurs as body language,see how easy it is, whether consciously or not, tosignal either openness or defensiveness to another personby means of your body language. Gestures, ratherthan words, are the true indicators of your instinctivereactions. \n \n If you want others to believe that you can be trusted,you must be congruent. Your spoken language and yourbody language must say the same thing. If they don\u0027t,the other person\u0027s body will signal its discomfort toyour body. In response to this communication, your \n \n \n","sourceLink":"http://novel.tingroom.com/lizhi/934/28322.html","bookId":253,"book":{"id":253,"title":"90秒内赢得好感 How to Make People Like You in 90 Seconds or Less","description":"简介： The Seven Spiritual Laws of Success: A Practical Guide to the Fulfillment of Your Dreams 励志英语小说原版英语版，PDF格式...","cover":"http://novel.tingroom.com/file/upload/201311/28/13-23-45-53-1.jpg","type":"Inspirational","link":"http://novel.tingroom.com/lizhi/934","creation":"Aug 1, 2019 12:18:27 AM","modification":"Aug 1, 2019 12:18:27 AM"}}
