{"id":104883,"no":47,"title":"Page 47","content":"“What happened when you got back to St. Paul after the South Dakota heist?” I asked.\\n\\n “We split the cash in the car. Jelly took the gold and the bonds; we planned on gettin’ together in a couple of weeks to settle on the bonds, but we all knew the gold was going to take longer to fence. He dropped the Finnegan brothers at Diamond’s Bar up in the Badlands; me he dropped at the entrance to the alley that led to the back door of the Green Lantern with ten thousand in my pocket. It was the last time I saw the man. Damn, it was sad what happened to him.”\\n\\n “Did Nash mention what he was going to do with the gold? Where he was going to hide it?”\\n\\n “Not Jelly.”\\n\\n “Ever mention anything about a fence? Did he ever mention a name?”\\n\\n “Nah. He was pretty closed-mouth about that sort of thing.”\\n\\n “Did Nash ever mention Brent Messer?”\\n\\n “The architect?”\\n\\n “You knew him?”\\n\\n “Yeah, I knew him. He was one of those rich dandies liked to hang out with the trouble boys. Made himself think he was trouble, too, if you know what I mean.”\\n\\n “Did Jelly ever talk about him?”\\n\\n “Couple times in passing. Nothing specific comes to mind, though. Why?”\\n\\n “Do you think he could have fenced the gold?”\\n\\n “Messer? I don’t know. I suppose he had connections enough, but—nah, I just can’t see it. Like I keep sayin’, Jelly was a careful guy. I don’t think he’d trust Messer with the gold—or anything else, for that matter.”\\n\\n “Why not?”\\n\\n “It never pays to drink out of the same bottle with someone you’re doing business with, that’s all. Word gets out, people get excited, bad feelings abound—pretty soon you know business is gonna suffer. I just don’t see Jelly taking that chance.”\\n\\n “What do you mean?”\\n\\n “The architect had a wife, a real dish named Kathryn.”\\n\\n “What about her?”\\n\\n “Jelly was—what do the kids say today? Jelly was doin’ her.”\\n\\n Genevieve had been right about Mike. He was a force of nature, but only for a short time, and then he tired. She wheeled him back to his room and afterward walked me to the entrance. I offered her a ride back to Bethel University, but she declined. She said she thought she’d hang around the nursing home for a bit and try to make herself useful. She’d score a ride later.\\n\\n At the door I told her not to linger too much over Berglund. Without elaborating, I told her that he wasn’t worth her tears. I don’t think she believed me.\\n\\n “I guess I’ll feel better when the police find out who killed him,” she said. “Then at least I’ll know why.”\\n\\n You could have done it, my inner voice said. You could have killed him out of jealousy and rage after you discovered that he was using you just as he had used Heavenly and Ivy.\\n\\n I didn’t believe it for a second, of course. Genevieve was a sweet and lovely young woman—a true work of art—and it made me feel like a loathsome heel to put her in the jackpot. Heavenly was right to call me that name. I needed suspects, though, the more the merrier. So I shook her hand and gave her shoulder a gentlemanly hug, and as soon as her back was turned I activated my cell phone and called Bobby Dunston.\\n\\n 11\\n\\n There were several messages on my voice mail when I returned home. Half were from Kelly Bressandes encouraging me to defy the police department and come clean with my story about Berglund’s murder and its connection to Jelly’s gold. The other half were from Heavenly Petryk. Apparently she’d found a safe place to hide, but she was still fearful and begged me to call her.\\n\\n “McKenzie, I am so glad to hear your voice,” Heavenly said. “I’ve been so frightened. How is the investigation going? Have the police arrested Josh’s killer yet?”\\n\\n “Not yet. Tell me something, Heavenly, does the name Brent Messer mean anything to you?”\\n\\n Heavenly was a good liar, smooth and uncomplicated. Yet instead of hemming and hawing and taking a moment to turn the name over in her head—as someone telling the truth might have done—she quickly answered, “Never heard of him. Why do you ask?”\\n\\n “It seems Berglund was interested in him for some reason. I don’t know why.”\\n\\n “Hmm,” said Heavenly.\\n\\n “Hmm,” I replied. “Why don’t you come over? We’ll talk.”\\n\\n “Right now?”\\n\\n “Right now.”\\n\\n “Do you think it’s safe?”\\n\\n “Sure.”\\n\\n After Heavenly hung up, I fished Boston Whitlow’s card from my pocket and called him.\\n\\n “Mr. McKenzie,” he said. “A pleasant surprise. I had hoped to hear from you, but not so quickly.”\\n\\n “It’s been one of those days,” I said. “Are you busy?”\\n\\n “Not so occupied that I can’t listen to what you have to say.”\\n\\n “Why don’t you come over to my place. We’ll talk.” \\n\\n","sourceLink":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6/page-47.html","bookId":2220,"book":{"id":2220,"title":"Jelly\u0027s Gold (Mac McKenzie #6)","description":"Storyline: Rushmore McKenzie, a retired St. Paul policeman and unexpected millionaire, often works as an unlicensed P.I., doing favors as it suits him. When graduate students Ivy Flynn and Josh Berglund show up with a story about $8 million in missing stolen gold from the ‘30s, McKenzie is intrigued. \\n In the early 20th century, St. Paul, Minnesota was an open city —a place where gangsters could come and stay unmolested by the local authorities. Frank “Jelly” Nash was suspected of masterminding a daring robbery of gold bars in 1933, but, before he could unload it, he was killed in the Kansas City Massacre. His gold, they believe, is still somewhere in St. Paul. \\n But they aren’t the only ones looking. So are a couple of two-bit thugs, a woman named Heavenly, a local big-wig, and others. When Berglund is shot dead outside of Ivy’s apartment, the treasure hunt turns unexpectedly deadly. McKenzie is looking for more than a legendary stash from seventy-five years ago, he’s looking for a killer and the long hidden truth behind Jelly’s gold.\\n","cover":"https://allnovel.net/images/jelly-s-gold-mac-mckenzie-6.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:37:45 PM"}}
