{"id":104890,"no":54,"title":"Page 54","content":"I watched from the window as Heavenly walked to her car, climbed in, and drove away. Probably she was too drunk to drive and I should have done something about it, but there’s just so much temptation a guy can be expected to resist. After she was gone, I went to my phone and called Rickie’s. “You’re a lucky woman,” I told Nina when she picked up. “ So you’ve said many times. What’s going on?” I gave her a quick update. “I met Tim Dahlin,” Nina said. “At a chamber luncheon. He gave the address. He was very funny. I can’t imagine him killing people.” “It’s all about motivation,” I said. “With luck, I’ll find out what motivates him, tomorrow. In the meantime …” “Yes?” “Nina.” “Yes?” “What are you wearing?” 12 The woman standing behind the counter of the Vital Records Office in the St. Paul-Ramsey County Public Health Center in downtown St. Paul looked at me as if I had called her a dirty name. “You want the birth and death records of Brent Messer, Kathryn Messer Dahlin, and James Dahlin,” she said, “but you don’t know when they were born or when they died.” “That’s correct.” She sighed heavily. “To receive a certified death certificate you must have proof of tangible interest,” she said. “Do you?” “Define tangible interest,” I said. “Are you a child, grandchild, spouse, parent, grandparent—” “No, no, nothing like that. Anyway, I don’t need a certified record. I just want to know the dates when they were born, when they died, that sort of thing.” The woman sighed again and slowly slid a Ramsey County Death Record Application across the counter and told me to fill it out. “It might take a week or more to get the information you seek,” she said. “A week?” “You don’t have any dates for us to work with. That means giving you the information you request will require a physical search. We’ll have to go back eighty years or more and hunt through all of our ledgers page by page.” “Isn’t the information on computer?” “We have birth records from 1935,” she said, “but death records start in 1997 and marriage licenses start in July 1999.” “I’d be happy to look through the books myself, if you like,” I said. From her expression it seemed I had insulted her again. “If you don’t actually need a certified copy of the certificates, you could save us both some time and go to the Minnesota Historical Society,” she said. “The History Center is only a few blocks”—she waved more or less east—“that way. They have a Death Certificates Index that has records for the entire state dating back to 1904, and a Birth Certificates Index—” “Wait. Is it all on computer?” “Yes.” “Okay, I’ll try that.” The woman slapped her hand on the application as if she were afraid it would escape and quickly slid it off the counter. “I have a question, though,” I said. “If the Historical Society has everything on computer, why don’t you?” She replied with a snarl—the woman didn’t like me at all. It turned out that the Minnesota Death Certificates Index could be accessed from any PC by way of the Minnesota Historical Society Web site. I could have done the research in my jammies from the comfort of my own home and received the same results: DAHLIN, KATHRYN Date of Birth: 05/07/1905 Place of Birth: Minnesota Mother’s Maiden Name: Conlick Date of Death: 10/25/1974 County of Death: Ramsey DAHLIN, JAMES Date of Birth: 11/28/1903 Place of Birth: Minnesota Mother’s Maiden Name: Ussery Date of Death: 2/12/1975 County of Death: Ramsey MESSER, BRENT Date of Birth: 11/19/1882 Place of Birth: Out of State Mother’s Maiden Name: Strand Date of Death: 08/29/1936 County of Death: Ramsey After I examined the statistics, I scooted next door to the Ronald M. Hubbs Microfilm Room, where the Minnesota Historical Society stored images of nearly every edition of every newspaper printed in Minnesota, including some high school and club periodicals. From the Death Certificates Index, it appeared that Kathryn and James Dahlin had lived a long life together, Messer not so much. I found the microfilm for the St. Paul Dispatch from August 1 to August 31, 1936, and carefully threaded it into a projector. The newspaper had thought enough of Messer to print his wife’s vacation plans in its society columns. I figured it would have printed his obituary as well. I was shocked by what I found. ARCHITECT KILLED IN EXPLOSION BLAST SET OFF AS MESSER TRIES TO START CAR “Mystery Witness” in Corruption Probe Police and Explosive Experts Conduct Inquiry: Kinkead Pledges Protection for Grand Jury","sourceLink":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6/page-54.html","bookId":2220,"book":{"id":2220,"title":"Jelly\u0027s Gold (Mac McKenzie #6)","description":"Storyline: Rushmore McKenzie, a retired St. Paul policeman and unexpected millionaire, often works as an unlicensed P.I., doing favors as it suits him. When graduate students Ivy Flynn and Josh Berglund show up with a story about $8 million in missing stolen gold from the ‘30s, McKenzie is intrigued. In the early 20th century, St. Paul, Minnesota was an open city —a place where gangsters could come and stay unmolested by the local authorities. Frank “Jelly” Nash was suspected of masterminding a daring robbery of gold bars in 1933, but, before he could unload it, he was killed in the Kansas City Massacre. His gold, they believe, is still somewhere in St. Paul. But they aren’t the only ones looking. So are a couple of two-bit thugs, a woman named Heavenly, a local big-wig, and others. When Berglund is shot dead outside of Ivy’s apartment, the treasure hunt turns unexpectedly deadly. McKenzie is looking for more than a legendary stash from seventy-five years ago, he’s looking for a killer and the long hidden truth behind Jelly’s gold.","cover":"https://allnovel.net/images/jelly-s-gold-mac-mckenzie-6.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:37:45 PM"}}
