{"id":104901,"no":66,"title":"Page 66","content":"That didn’t make Ivy any less culpable, but I felt better about it. “Later, you panicked when they came home, and you killed Berglund,” I said. “Certainly not. You must believe me, Mr. McKenzie. I completed my task quickly. I had departed the apartment long before Ms. Flynn and Berglund returned.” “Did you tell the police that?” Whitlow’s reply came in a series of hems and haws and mumbles. “I’ll take that as a no,” I said. “I was terrified that I would implicate myself in Berglund’s murder,” he said. “A reasonable fear.” “What happens next? Are you going to—” “Do you still have the key to Ivy’s apartment?” He nodded. I didn’t tell him how utterly stupid that was. Instead, I told him to give it to me. He did. I put the key into my pocket. “What are you going to do?” Whitlow said. “Are you going to the police?” “I don’t know,” I said. I had nothing more to say to Whitlow, so I left him sitting on the sofa. Once outside the apartment, I reached up and screwed the bulb until the light above my head flicked on. It didn’t give me any ideas. Ribbons of light flared on both sides of my driveway, leading me to the garage that I opened by remote control. I parked, shut down the Audi, closed the garage door, and made my way to my house, entering through the back door. Once inside, I managed to punch my code into the security system before it activated. A couple of weeks after I had it installed, I accidentally “forgot” to set the code to see how long it would take the St. Anthony Police Department and a private security firm to respond to a home invasion. Four minutes, eleven seconds by my watch. I was very impressed. I was even more impressed by the bill they sent me for triggering a false alarm. I killed time waiting for Nina by watching SportsCenter followed by a rerun of Scrubs. Afterward, I laid out a spread of bread and cheese from Panera and opened a bottle of 2003 Clos Beauregard Merlot blended with grapes from the Pomerol region of France. The wine cost me forty-two bucks. Why it was better than a ten-dollar Merlot from, say, Sonoma Valley, I couldn’t tell you, but Nina liked it. A few minutes later, she rang my front door bell; Nina had a key and my security code—IMSPARTACUS—but she never used either. I opened the door to find her balancing a huge bubble-pack envelope against one shoulder while holding the outer screen door open with the other. The envelope was the kind you buy at the post office. “I found this jammed between your doors,” Nina said. “What, you don’t pick up your mail?” “I came in through the back,” I said. I held the door open for Nina, taking the envelope from her as she passed. “You didn’t buy another kitchen gadget from Europe, did you?” Nina said. My address had been printed by hand. I checked the return address. The envelope had come from Josh Berglund. The postmark said it was mailed Tuesday. “I don’t believe it,” I said and rushed to my dining room table. I pushed the plate of bread and cheese aside to make room. “What is it?” Nina said. “In his log, Berglund wrote that he passed the letters on to me. This must be what he meant.” “I don’t understand.” “He must have known he was being followed, followed by Whitlow. To keep them safe, he mailed the letters to me.” I tore open the envelope and slid out a carton about the size of a large shoe box. The carton was old and had a kind of spongy feeling even though it wasn’t wet. I pulled off the top. Inside were dozens of envelopes, most ivory, but many were light blue and pink, as well. I withdrew one at random and held it up to the light. It was addressed to Rose Pederson. The return address written on the back flap read KATHRYN MESSER, HOTEL CRYSTAL 691 RUE ST. BENOIT, PARIS, FRANCE. I reached out and grabbed Nina by the wrist with my other hand. “We got them,” I said. “Kathryn’s letters. We’ve got them.” 16","sourceLink":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6/page-66.html","bookId":2220,"book":{"id":2220,"title":"Jelly\u0027s Gold (Mac McKenzie #6)","description":"Storyline: Rushmore McKenzie, a retired St. Paul policeman and unexpected millionaire, often works as an unlicensed P.I., doing favors as it suits him. When graduate students Ivy Flynn and Josh Berglund show up with a story about $8 million in missing stolen gold from the ‘30s, McKenzie is intrigued. In the early 20th century, St. Paul, Minnesota was an open city —a place where gangsters could come and stay unmolested by the local authorities. Frank “Jelly” Nash was suspected of masterminding a daring robbery of gold bars in 1933, but, before he could unload it, he was killed in the Kansas City Massacre. His gold, they believe, is still somewhere in St. Paul. But they aren’t the only ones looking. So are a couple of two-bit thugs, a woman named Heavenly, a local big-wig, and others. When Berglund is shot dead outside of Ivy’s apartment, the treasure hunt turns unexpectedly deadly. McKenzie is looking for more than a legendary stash from seventy-five years ago, he’s looking for a killer and the long hidden truth behind Jelly’s gold.","cover":"https://allnovel.net/images/jelly-s-gold-mac-mckenzie-6.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:37:45 PM"}}
