{"id":104845,"no":8,"title":"Page 8","content":"Wally said, “Wanna see, asshole?” I answered by driving the point of my elbow against the point of his nose, hitting him just as hard as I could—hey, I haven’t spent thirty-seven years playing hockey without learning something. I felt the cartilage snap; blood began flowing freely. Wally forgot his gun and brought both of his hands to his face. I wasn’t surprised. I’ve been hit hard in the nose, and it hurts so much that sometimes you’ll even forget your name. I reached down and yanked the gun out of its holster. It was a snub-nosed .38. A wheel gun. You don’t see many of them anymore. Most people prefer automatics. I glanced down at Ted. His hands were flat on the table. He hadn’t moved, and when I was certain that he wasn’t going to move I broke open the gun and dumped the five cartridges on top of the table. “You want to show the gun, fine,” I said. “You look to pull it, that’s a different matter.” I snapped the cylinder back in place and dropped the gun on the table next to the bullets. “Now, where were we?” I was going for high drama, but Ted didn’t seem impressed by my act. His posture changed while he studied his friend—head back, shoulders back, back ramrod straight. He was thinking, and from the way his lips pushed forward to bare his teeth and his breathing became fast and shallow, I guessed he wasn’t thinking about baby unicorns. “I’d like to see you try to take my gun,” he said. His voice sounded a helluva lot scarier than mine did. I had overplayed my hand, and I had to do something to regain control of the situation. Ted moved his right hand slowly along the edge of the table until it was parallel to his right hip. “How old are you, Ted?” I said. “Twenty-two?” He stopped. “Are you still in school?” “Wha—?” “Your Trailblazer, is it paid for yet?” Suddenly he seemed confused. “Listen, Ted, before things get out of hand, why don’t you talk to your boss. You do have a boss, right? Someone who’s paying you to keep an eye on my friends. I mean, you wouldn’t be doing it for fun, am I right? There must be money on the table, right?” “Maybe,” he said. You should be on Jeopardy! my inner voice said. Better yet, Are You Smarter than a Fifth Grader? “Tell your boss that things have changed,” I said aloud. “You’re not trying to frighten college kids anymore. At the very least, you should get a raise. Right?” “Right,” he said. He drew out the word slowly, as if he weren’t sure. “What about my nose?” Wally wanted to know. He was speaking in a high, nasal twang behind his hands. “It makes you look rugged,” I said. “The chicks dig that.” “I’m going to fucking kill you.” “Oh, you are not.” “I am.” “No.” “Yes.” “Na’uh.” I turned my head and found Jenness. She was leaning against the stick and talking to a customer. I caught the customer’s eye and pointed at Jen. The customer said something, and Jenness turned toward me. I motioned for her. She approached slowly until she noticed the blood seeping between Wally’s fingers and then came at a gallop. “What happened?” she asked. “Correct me if I’m wrong,” I said, “but doesn’t Rickie’s ban guns from its premises?” I knew that it did; there was a sign posted just outside the door, and then there were Nina’s admonishments whenever I carried my own piece. It’s an interesting quirk of the Minnesota gun law that public and private establishments do not have to accept concealed weapons on their premises and can forbid them simply by posting a notice. Jenness looked at the gun and the loose rounds on the tabletop, then up at Ted. She was trying mightily to pretend that Wally wasn’t there. “Sir, I must ask you to leave immediately,” she said. “I’m not going anywhere,” Ted said. “Sir, if you do not leave, I will call the police and have you forcibly removed.” To punctuate the threat, Jenness pulled a cell phone from the pocket of her apron. Ted hesitated for a moment; Jenness started punching numbers. “All right, all right,” he said. He rose from his chair. His partner did the same. “I won’t forget this,” Ted told me. If I’d had a cigarette, I would have blown smoke into his face, but tobacco products were forbidden in Rickie’s as well. Wally jammed his .38 back into its holster with one hand while cradling his bloody nose with the other. He began to sweep the bullets into an easy-to-grab pile. “Leave ’em,” I said. He wanted to say something pithy in reply, but Ted motioned with his head, and the two of them left the club. Jenness pulled my arm until I was facing her. “Did you just punch a customer?” she asked. “Oh, like you never wanted to do that.” Jenness grabbed the top of her head with both hands as if she were afraid she was going to lose it. But then, she tended to be emotional.","sourceLink":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6/page-8.html","bookId":2220,"book":{"id":2220,"title":"Jelly\u0027s Gold (Mac McKenzie #6)","description":"Storyline: Rushmore McKenzie, a retired St. Paul policeman and unexpected millionaire, often works as an unlicensed P.I., doing favors as it suits him. When graduate students Ivy Flynn and Josh Berglund show up with a story about $8 million in missing stolen gold from the ‘30s, McKenzie is intrigued. In the early 20th century, St. Paul, Minnesota was an open city —a place where gangsters could come and stay unmolested by the local authorities. Frank “Jelly” Nash was suspected of masterminding a daring robbery of gold bars in 1933, but, before he could unload it, he was killed in the Kansas City Massacre. His gold, they believe, is still somewhere in St. Paul. But they aren’t the only ones looking. So are a couple of two-bit thugs, a woman named Heavenly, a local big-wig, and others. When Berglund is shot dead outside of Ivy’s apartment, the treasure hunt turns unexpectedly deadly. McKenzie is looking for more than a legendary stash from seventy-five years ago, he’s looking for a killer and the long hidden truth behind Jelly’s gold.","cover":"https://allnovel.net/images/jelly-s-gold-mac-mckenzie-6.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:37:45 PM"}}
