{"id":104932,"no":97,"title":"Page 97","content":"“Can’t wait,” I said. I was loud enough that Whitlow must have heard, but he pretended to ignore me. “Where’s Heavenly?” I said. “Don’t tell me you kids had another falling-out.” He ignored me some more. I saw the question in her eyes, so I leaned down and told Nina in whispers who Whitlow was. She glanced at him once, then pretended to ignore him, too. The parade was just beginning. A black limousine pulled up, a door opened, and Allen stepped out. He saw us instantly. His reaction was to bend down and speak earnestly to someone inside the car. A moment later, Timothy Dahlin emerged. He studied Nina, Whitlow, and me for a hard ten seconds, then decided to disregard our presence. While he approached the canopy, Heavenly arrived, smiling happily as if she knew her birthday wish was about to be granted, swinging her purse as she hustled up the avenue. She saw us, stopped, spun around, and showed us her back for half a minute before turning again and advancing toward the house. This time she looked as if she had failed to blow out all the candles. Eventually the six of us were huddled near the front door, behaving as if we were all strangers. “I’m guessing everyone here reads the St. Paul Pioneer Press,” I said. No one replied. There were several displays trumpeting the services of both the architectural firm and the interior designers who were responsible for renovating the Presswood House; brochures and business cards were available to whomever wanted one. Dahlin skimmed a brochure while he spoke, his voice flat, quiet, and without emotion. “The gold belongs to me,” he said. “It’s my inheritance.” “I thought you didn’t want the gold,” Heavenly said. “If you had to, could you walk into a courtroom tomorrow and prove your relationship to Jelly Nash?” I asked. Dahlin didn’t reply. “How ’bout Brent Messer? Robert Presswood?” “I’m the one who found out about the gold,” Heavenly said. “No, it was me,” said Whitlow. Allen stepped in front of them. “You did it while you were both employed by Mr. Dahlin, don’t forget,” he said. Both Heavenly and Whitlow ignored him. “It’s mine,” she said. “It’s mine,” he said. “Technically, it belongs to the United States Treasury Department,” I said. “Screw you,” Whitlow said. “You knew about Messer’s home office. You were holding out on us.” “Us,” Heavenly said. “When did it become ‘us’?” “What’s it going to take to make you people disappear?” Dahlin said. “Let’s not start that again,” I told him. “I’m not leaving,” Heavenly said. “Neither am I,” Whitlow said. “Oh, for goodness sake, what are you, children?” Nina said. “Didn’t you learn anything in kindergarten? Didn’t you learn to share?” That silenced us for a few beats. “I have a suggestion,” I said. Dahlin knew what I was going to propose before I proposed it. He threw up his hands and said, “Fine. I’ll go along.” “Go along with what?” Whitlow said. “An equal split—four shares,” I said. “An equal split,” Heavenly repeated, but she wasn’t giving in. “What alternative do we have?” I said. “We all know where the gold is—at least we think we do. No one is willing to leave it to the others.” Heavenly covered her face with her hands, inhaled between her fingers, and held her breath like a little girl desperate to get her way. When she exhaled she found Whitlow’s eyes. The two of them stared at each other, communicating without speaking, until Whitlow said, “What about it, Hep?” “Agreed,” she said, although it sounded like she was agreeing to a flu shot. Heavenly extended her hand, and Whitlow shook it. I shook Dahlin’s hand. Pretty soon everyone was shaking everybody’s hand. “Wow, man,” I said. “We got the band back together.” Finally a young woman dressed in all natural fibers led us forward. She was very pleasant and very knowledgeable and spoke with a nice, melodic voice, and she drove me nuts. Apparently she was under the impression that the group—we had swelled to over a dozen by the time she took us in hand—was actually interested in the building’s architecture and elegant furnishings. I blamed Nina and Heavenly because of the way they oohed and ahhed over every little thing. In the dining room there was a meticulously constructed cabinet built to store wineglasses that resembled a dollhouse. “Isn’t it darling?” Nina said. “Look, it has different rooms for different types of glasses,” said Heavenly. “Oh, how cute.” “For God’s sake, keep your eyes on the prize, wouldja?” I said.","sourceLink":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6/page-97.html","bookId":2220,"book":{"id":2220,"title":"Jelly\u0027s Gold (Mac McKenzie #6)","description":"Storyline: Rushmore McKenzie, a retired St. Paul policeman and unexpected millionaire, often works as an unlicensed P.I., doing favors as it suits him. When graduate students Ivy Flynn and Josh Berglund show up with a story about $8 million in missing stolen gold from the ‘30s, McKenzie is intrigued. In the early 20th century, St. Paul, Minnesota was an open city —a place where gangsters could come and stay unmolested by the local authorities. Frank “Jelly” Nash was suspected of masterminding a daring robbery of gold bars in 1933, but, before he could unload it, he was killed in the Kansas City Massacre. His gold, they believe, is still somewhere in St. Paul. But they aren’t the only ones looking. So are a couple of two-bit thugs, a woman named Heavenly, a local big-wig, and others. When Berglund is shot dead outside of Ivy’s apartment, the treasure hunt turns unexpectedly deadly. McKenzie is looking for more than a legendary stash from seventy-five years ago, he’s looking for a killer and the long hidden truth behind Jelly’s gold.","cover":"https://allnovel.net/images/jelly-s-gold-mac-mckenzie-6.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/jelly-s-gold-mac-mckenzie-6.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:37:45 PM"}}
