{"id":96335,"no":24,"title":"Page 24","content":"I wonder where those weapons are arriving from. Or whether they will ever be installed …\n At this point, I decide it is impractical to try to board the Didact’s ship without a proper understanding of Requiem’s situation. As well, my luck with the old Shield World might be stronger than with the vessel in which the Didact currently resides.\n In this I am, so far, correct. Requiem assents to my permission to cross over, and provides me with an innocuous escort of servile sentinels.\n I spend fully three hours moving through half-finished levels where Warrior-Servants might have once been quartered, but where now I see only ancilla-guided factories working at full speed to produce—what? Machines shaped like warriors? At last, I begin to see the faintest glimpse of his cruel scheme. Finally, in the antechamber to the Cryptum repository, I am met by a Warrior-Servant I have not seen in thousands of years—a Promethean! And giving me a bit of a shock. Someone I would never have expected, retired long ago, so I heard. A Promethean who under other circumstances might have led a quite different existence.\n Had I not intervened.\n Her name is Endurance-of-Will. She was adjutant to Bitterness-of-the-Vanquished during the human wars, as well as one of the ecumene’s top strategists, almost as brilliant as the Didact.\n Her own expression, seeing me and the sentinels, is quite thoroughly controlled, though I notice a slight tightening of her wise, discerning eyes.\n We stand a dozen meters apart. “Lifeshaper, we are honored and surprised by your presence,” she says.\n Smaller than most of her rate and rank, but with a distinctive, catlike grace, she wears a uniquely simple style of battle armor: no decorations, no spikes, supple curves conveying quiet strength.\n “Why is my husband not fully attended?” I ask.\n Such a direct question brings no surprise. But she must be asking herself why I am here. “He is attended, Lifeshaper. I am here. At his request.”\n “And he is also attented by these, evidently,” I say, pointing to the factories.\n Endurance acknowledges as much with a sideways nod, still watching me politely, but closely.\n It is then that I understand why those ships were empty and realize, with horror, what happened to his most loyal Prometheans. “Slaves implanted in machines! Did you support the Didact in these plans?”\n “The Didact is our commander,” she says, with just a hint of caution. She is sounding me out, trying to discover not only my reason for being here, but my goal. “I am subordinate. I do not make command decisions.”\n “When will you join your fellows … as a machine?” I ask.\n “Eventually,” she answers, and then, with an impatient output of breath, “Soon. Surely the Didact told you what he thought you should know.”\n “More than I wanted to know,” I say.\n “The Didact can answer better than I.”\n “Did you request human essences?” I ask.\n “They will serve well enough.”\n “They were gathered by a Composer from my sanctuary—without my permission. He has weaponized his former enemies and installed them in the heart of this construct. Is this the act of a sane Forerunner? Of a Warrior who respects the Mantle?”\n “All things bow to resolve,” Endurance says. “The Mantle included.” Only now do I begin to sense the depth of her doubt, and possibly even her misery. I remember her as a sensitive and honorable Warrior; she may still be convinced to help.\n But I have to have a compelling strategic argument. And I do.\n “When he returned from the Burn, he brought back with him new strategies to battle the Flood. This? The transformation of his own into … machines?”\n “The Didact did not anticipate your presence. He does not realize you’re here, does he?”\n With her own powerful views of battle planning, Endurance and the Didact have often clashed in the past. I am taking the chance that this time she disagrees with her commander sufficiently to at least listen to my entreaty. It is she who will be entombed with my husband, not me!\n Endurance begins to walk down a wide hall flanked by ornately patterned columns of hard light—the first I’ve seen in Requiem, which has, to this point, consisted of Forerunner base material, undecorated and rudimentary. “It would be best if I took you to the Didact now, Lifeshaper. I presume he will welcome such an interruption.”\n “What does he plan for his new warriors, Promethean?” I cry out, my voice echoing down the long hall. I wonder if he can hear me. And if he learns I am here, what will he do? He will assume the worst, probably. But is he desperate enough, mad enough, to rid this sanctuary of my irritating and possibly dangerous presence?\n “Victory, as always,” Endurance says, her back to me.\n “Against what?”\n “Do you have something to tell me, Lifeshaper? Something I should know—need to know?” Her armor flexes, ripples.\n “Perhaps not,” I say. “Perhaps you already understand.”\n “You are here to protect your husband. That much I would expect. Tell me how you would protect him, Lifeshaper.”\n “The Didact is tired.”\n “The Didact is highly energized and devoted.”\n “The Didact is on the point of collapse.”\n “I have not seen that.” Spoken with less firmness.\n “The Didact is not thinking clearly,” I say.\n “What evidence?” Endurance asks, slowly turning to face me again. Already she violates her honor, showing any willingness to hear my criticism of her commander. Her doubts must be deep. And they must be drawn up, exposed.\n “He was interrogated by a Gravemind,” I say.\n “I know that much.”\n “If you were Gravemind, such an amalgam of ancient memory, Forerunner memory and experience—how would you forge a weapon to strike at the center of Forerunner defenses?”\n She narrows her eyes severely. I have struck a strong chord—and a sour one. Her nostrils compress, as if she does not want to breathe the same air as me. But she folds her arms and continues to listen.\n “An honorable and courageous leader is delivered unexpectedly into your control,” I say, “a leader whose return might bring hope and renewed strength to the Forerunner ecumene.”\n “And?”\n “And yet his return has brought nothing but sorrow and horrific destruction, not only to his own rate, but now to the humans as well. He’s become a foolish pawn in a dark game of revenge that began long ago.”\n “The Primordial,” Endurance says.\n “The Primordial. An experience so traumatic he kept the facts hidden from me for ten thousand years. Such a creature, with such a dark brilliance, would play upon his oldest fears, twist emotions made fragile during a lifetime of war and hardship and politics. Twist, intensify—and distort them.”\n “Prometheans have for hundreds of thousands of years been proofed against that sort of pressure,” Endurance says. “Torture has never broken one of our rank.”\n “They have no training against this adversary. No armor or protection against the heirs of those who created us. The Didact has been subjected to the examination of something so very close to a god … one related to those we assumed had passed the Mantle to us, but most definitely have not.”\n “Enough, Lifeshaper! I will not listen to blasphemy, even from you.”\n “Has he brought you into his plans? Made them clear?”\n “Clear enough. I serve, I do not judge. He believes he will defeat the Flood with these new Prometheans, that the scattered remnants of Forerunners will survive, and that they will eventually reunite. He will summon them, then govern and reorganize. Requiem will become center for the Forerunner resurgence, the foundation upon which we will rightfully claim the Mantle.”\n “And?”\n “The Didact believes that humanity was a threat that should have been dealt with from the very beginning.” Now she appears most troubled, most reluctant to continue. “He will begin a program to eradicate all suspect species. Purge all dangerous planets. Wipe the galaxy clean of threats. Never again allow the galaxy to rise up against Forerunners.”\n The phrasing—as if the entire galaxy in itself is a threat—is hauntingly familiar. The clarity of expression; the perversion as well as the demonic purity.\n “That isn’t the Didact I remember—the most noble of warriors throughout all the ecumene,” I say. “Surely you recognize the dark nature of that approach. Do you support him in this—heart and soul?”\n “He is the Didact. He is commander.”\n “He is broken.”\n “The ecumene is broken, Lifeshaper. The ecumene discarded Warrior-Servants—”\n “And does that mean all life deserves to suffer, to be extinguished—leaving only Forerunners? Is the rule of the Mantle without meaning?”\n The last shell of her reserve is cracking. “There is meaning—and there is duty, Lifeshaper.”\n “Which duty foremost?”\n “The Mantle. Always.”\n “Then the best thing we can do for the Didact … is to stop him, force him to reason. The Cryptum.”\n “Another exile, Lifeshaper? And what about your duty to him?”\n “This is not my Didact, Endurance. This is no longer my husband. Is he the Didact you knew so well? The Warrior who would have been your husband—had he not chosen me?”\n This pierces her. The reserve shatters, and her anguish at this wound long since crusted over, but never healed, is heartrending. Warriors do not reveal their emotions thus, not lightly.\n Unfair. Unjust.\n Necessary.\n “You knew?” she asks.\n “I offered to set him free to return to his rate. He declined.”\n “Such was his love…” she says sadly.\n “Together, we can save him,” I say. “We are the only ones. And we must save him. In his present state, or anything like his present state, he must never be allowed to control Requiem or to unleash these Prometheans.”\n I have now played all my cards. My deck is empty. I have to rely on the honor and honesty and ultimately, the Warrior wisdom of a female of another rate whom I once bested, who does not like me, who deeply resents me—and has for thousands of years.\n I now go to Mantle’s Approach. The Didact is making final preparations there to transfer his command, and all of his ancillas, to Requiem. How much has my husband failed to foresee, to prepare? Is it possible he cannot conceive, even now, even in his madness, perhaps because of his madness, that I am capable of betraying him?\n I am escorted by a single monitor, which Endurance has placed at my complete disposal.\n “I need to evaluate the Didact’s health and prepare his security,” I tell it as we flow along down the ship’s central access corridor.\n “Understood, Lifeshaper.” It waves aside the ship’s inspection fields. We enter Mantle’s Approach. The hatch to Requiem seals behind us. I wonder if it will open again, if I will be allowed to return. I am still not completely convinced that Endurance supports me. All is deception in the Didact’s life. Perhaps that has touched her, as well.\n “He has insisted that I be armed and be made part of his protection detail.”\n “A weapon shall be procured, Lifeshaper,” the monitor says. “Shall I announce you to the Didact?”\n “He is aware of my presence.”\n “So be it, Lifeshaper.”\n How few of these details have been attended to! The Didact’s lack of finesse is shocking, but I begin to understand. This is my husband’s final sanctuary. To believe he is weak here in any way might be more than he could possibly bear. To believe that Endurance would turn against his plans, join with me … Inconceivable.\n On Requiem, nothing can or shall betray the Didact.\n A rifle is delivered, a compact, slender fasces of plasma and microwave guides—extremely powerful. A control panel fits to my armor’s glove, adjusting quickly to my smaller finger-span. I examine its workings, request guidance; the monitor instructs my ancilla. My armor learns quickly. I barely pay attention.\n “The Didact is making final preparations in his quarters,” it says. “In hours, he will secure Mantle’s Approach and shut down its functions.”\n “I presume he maintains a combat Cryptum on his ship.”\n “That he does, Lifeshaper.”\n “Prepare it for transfer to Requiem.”\n “It shall be done, Lifeshaper.” The monitor pauses. “Lifeshaper, the Didact tells us he was not in fact aware of your presence.”\n “A sign of his deteriorating health, perhaps.”\n The monitor is out of its depths in such matters. “He suggests a meeting immediately.”\n I project signs of gladness, hiding any concern. “Request of course granted.”\n A doorway opens before me into the darkness. I presume this monitor will now destroy me; I cannot expect success beyond what I’ve already achieved, which is remarkable.\n Instead, it leads me deeper into the ship’s command desk. Here I find coldness, emptiness. The Didact stands alone before a partial readout of Requiem’s security. His armor lies folded in a repository, awaiting his attention.\n He does not even turn as I enter.\n “Wife,” he says. “I did not expect your presence, after all that has happened.” All I feel from him, all I hear in his voice, is a softly simmering hatred.\n “Duty to my husband must be foremost,” I say.\n “Loyalty … our greatest bond. But clearly you are distressed by what I have done. Perhaps you are also here to oversee my plans for your humans.”\n “I am,” I say. “I seek explanation, so that I may be comforted.”\n “Pardon my boldness, but before now, you have always acceded to my strategic superiority.”\n “We have always discussed such matters,” I remind him. \n","sourceLink":"https://allnovel.net/halo-silentium-the-forerunner-saga-3/page-24.html","bookId":1630,"book":{"id":1630,"title":"Halo: Silentium (The Forerunner Saga #3)","description":"Storyline: \n Halo: Silentium (The Forerunner Saga #3 , Halo #11) \n In the last years of the Forerunner empire, chaos rules. The Flood—a horrifying shape-changing parasite—has arrived in force, aided by unexpected allies. Internal strife within the ecumene has desperately weakened Forerunner defenses. Only the Ur-Didact and the Librarian—a husband and wife pushed into desperate conflict—hold the keys to salvation. Facing the consequences of a mythic tragedy, one of them must now commit the greatest atrocity of all time—to prevent an unmatched evil from dominating the entire universe.\n \n","cover":"https://allnovel.net/images/halo-silentium-the-forerunner-saga-3.jpg","author":"Greg Bear","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-silentium-the-forerunner-saga-3.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:19:49 PM"}}
