{"id":96337,"no":26,"title":"Page 26","content":"When there is time to pay attention, I discover that Catalog has suffered some damage. It is recovering.\\n\\n The IsoDidact’s skin suddenly takes on a hopeful color. His ancilla connects with me, and we conduct a diagnosis, which is positive enough that the suit allows its occupant to rise to awareness.\\n\\n His eyes search the large command center and find first me, then the unmoving carapace of Catalog.\\n\\n “Where are we?” he asks.\\n\\n “Away,” I say. “Our next jump will begin shortly.”\\n\\n “Jump to where?”\\n\\n “A random location. Far from here. Somewhere safe.”\\n\\n He looks around the command center. “Are we on a carrier ship?”\\n\\n “We are. Gargantua-class.”\\n\\n “How did you arrange that?”\\n\\n “I am resourceful, as you have observed. But this was provided by your wife and the Lifeworkers.”\\n\\n “Remarkable. Change that destination,” he says. “I have another coordinate.”\\n\\n His armor feeds me the new coordinate. This must be the location of the lesser Ark, just as the Librarian had promised.\\n\\n “Did my wife escape?” he asks.\\n\\n “I believe so.”\\n\\n “To Requiem,” he says.\\n\\n “Yes.”\\n\\n “With my original.”\\n\\n “They traveled separately,” I say.\\n\\n His expression softens. “Old friend,” he says. “I owe you my life.”\\n\\n “Again,” I say. “Chakas could have murdered you in your sleep back on Erde-Tyrene, and he didn’t.”\\n\\n Somehow, he finds this amusing. But he quickly sobers. “How many humans in the compound survived?”\\n\\n “Only a handful.”\\n\\n “Not enough to rebuild what was lost?”\\n\\n “No, I do not believe so.”\\n\\n The IsoDidact’s face turns grim. His dismay and anger is heartening. Chakas believes that Forerunners should feel guilt, especially for such heinous actions.\\n\\n “I know where the Lifeshaper will go,” he says, “once she’s finished her duty to my original.”\\n\\n “She will return to my home world,” I posit. “Where a few humans might yet remain.”\\n\\n “Almost certainly. I wish I could follow her … but we must reach the lesser Ark, and soon.”\\n\\n He gives the order. The jump is not as rugged as some, but it’s no walk in the short grass. We arrive with few core reserves to spare at a small, permanent portal about a thousand light-years from where we began.\\n\\n Despite myself, I am impressed by the IsoDidact. He is better than his original and better than Bornstellar, who was a bit of a goof. I am more cheerful now, if a machine can feel cheer. I am also hopeful that the Bornstellar Didact will assign me to return to Erde-Tyrene, if it has not been captured by the Flood, and search for the Lifeshaper, protect her.\\n\\n Home. A place I would like to visit one more time.\\n\\n The portal station is deserted. The platform and cylindrical buffers are empty, the ancilla seems old and eccentric—but functional.\\n\\n It refuses my query for information. I am not authorized. “It asks for our identity,” I tell the IsoDidact. “Why is this portal out here, with so much capacity, yet unused?”\\n\\n “In case something goes wrong,” he says. “The Master Builder created it ten thousand years ago, in secret. He was very wealthy and thought I might win—the Didact might win—and he would need to leave quickly, to a place where he could not be tracked. He gave me the coordinates to this secret Ark, where there is a final array of Halos. Apparently he no longer wished to escape.\\n\\n “And now, it belongs to us, doesn’t it?”\\n\\n Through me, the IsoDidact supplies the Master Builder’s coordinates. The old portal ancilla expresses its relief and asks whether more Builders will arrive soon. “We do enjoy serving,” it says.\\n\\n I do not wish to disappoint. I reply with a mechanical ambiguity. I appreciate its patience and loyalty. Someday, I may experience similar disappointment.\\n\\n The portal journey is much longer and much smoother. The benefits of wealth and power. What the displays show when we arrive is at once astonishing and terrifying.\\n\\n Halos everywhere. Six of them!\\n\\n And another Ark, also outside the margins of the galaxy, smaller than the one just destroyed, but big enough. For many thousands of light-years around, there are no signs of converted fleets, star roads—or the Flood.\\n\\n We may have arrived in time!\\n\\n Our vessel is not recognized, but upon confirmation of the IsoDidact’s presence, our status is updated and we are allowed into the Ark’s protected perimeter.\\n\\n Here we have refuge, for now.\\n\\n All communications are refreshed. The IsoDidact has a message from the Lifeshaper—and a request. As we move from the vessel to the Ark’s Cartographer to review Halo preparations, he tells me, “She’s on Erde-Tyrene. But not just to save humans. She’s requested a ship! This one, actually—if you are willing to part with it.”\\n\\n “It has carried us well. But we will need to replenish the slipspace core before we send it to her.”\\n\\n “May I travel to Erde-Tyrene and assist the Lifeshaper?” I wonder what remains on Erde-Tyrene. Every human I knew is probably dead. It might be very painful to go there.\\n\\n “No,” the IsoDidact says. “She says she’s trying to draw off the Flood,” he says, crestfallen. “I believe her, but I think she has other motives. Besides, there would be no hope of your return. And I need you. We have to disperse the Halos as soon as possible. I need you there to ensure success. Will you do this for me, friend?”\\n\\n I say that I will. The IsoDidact and I part ways. But before the vessel is refreshed, and sent on an automated course to Erde-Tyrene— I contact a nearby Lifeworker.\\n\\n “Quickly,” I say. “There are specimens in the hold. They must be transferred to the Ark.”\\n\\n Riser, Vinnevra, as well as others I do not know.\\n\\n Possibly the last humans in the galaxy.\\n\\n Catalog goes with them, still disoriented. Again, my machine nature weighs on me—but I am certain I already feel lonely. Six hoops are spread out across the blue sky.\\n\\n This weapon array is different than the others; designed to purge everything. The true destructive potential that the Didact had always feared, finally unleashed. If the Forerunners fire their Halos, only machine intelligence will survive within the galaxy.\\n\\n Just beings like me, or nothing at all.\\n\\n Lonely indeed.\\n\\n STRING 36\\n\\n ISODIDACT\\n\\n THE PEACEFUL LULL could not last long.\\n\\n Portal sensors near the lesser Ark tell us that space-time near our position is changing. That was inevitable. Time will soon tangle horribly, and there will be no counting the hours we have left.\\n\\n I fear the worst for my wife.\\n\\n This Ark has the most extensive command facility of any I have seen. Builders have, I must admit (and perhaps with a little deep pride) outdone themselves with this installation, both in the record time they took to complete it and the changes and improvements they have made over the previous Ark. Nevertheless, the newer Ark is unproven. Controlling the smaller Halos, designed to be more swiftly and flexibly dispatched, will require tremendous coordination, and communications across those distances could soon be compromised.\\n\\n The newer Halos have been designed to fire simultaneously and in every direction; they are much more powerful than older Halos. Once distributed, their energies will cover the entire galaxy, overlapping and triggering each other until there is no space that has not been cleansed of the Flood.\\n\\n There is uncertainty whether star roads in transit through slipspace will be eliminated as well. Some say they will, others, not. And so, we are attempting to gauge, through very suspect data, when the maximum number of star roads and other Precursor constructs will emerge and occupy status space.\\n\\n The Halos must be dispersed as soon as possible. I cannot trust that my wife’s feint will have any effect on the Gravemind or on Mendicant Bias. She has told the Lifeworkers that they must give me all assistance, must follow my orders—orders that were approved by the Council, whatever remained of it, before she left the greater Ark. She has told them, explicitly, with all the authority of her rank, that triumph of the Flood would be a violation of the Rule of the Mantle. She has traveled a long, hard course to reach this decision, obviously, and I suspect it was the example of my original that finally tipped the scales.\\n\\n In a Lifeworker vessel, I meet for the last time with the Chakas, along with six other monitors commissioned as caretakers for the remaining Halos. The Lifeworker crèche has certified that they are all fit and ready for duty, preparing the seven activation indexes, one for each Halo. “I send you on your way, friend,” I tell Chakas. “Your new home will be Installation 04. I also give you a new designation. Henceforth, you will no longer be just a guide and assistant. You will be guardian and protector of an entire installation. You will be called 343 Guilty Spark.”\\n\\n Chakas floats before me, still receiving the programming he will need for its new assignment. The others have received similar nomenclature, with escalating numeric delineation. Their new names are an omen as well as an epitaph for our people—and for my wife. Were there another way, we would have taken it.\\n\\n “This is it,” he says. “The end?”\\n\\n “You’ve traveled a long ways with me, old friend,” I say. “We were young and foolish when we met. So much has happened for both of us. We are not at all what we were, are we?”\\n\\n “I will think on those good days,” he says. “I hope to find comfort in the memory.”\\n\\n Comfort? An odd statement for a machine! But I am speaking in an equally odd way to a machine. Clearly, in my thoughts—in truth—this monitor is much more than a machine.\\n\\n “Now, old friend, we have the most important job in history—perhaps in all time. You may very well outlast all of us here. You may see the new galaxy emerge.” I stop and turn away, looking out of the Ark’s citadel toward the now-cooling forge and the mining site beyond. “Tell me, Chakas, if this was your choice, after all we have seen and survived … would you fire the rings?”\\n\\n He does not respond. I don’t know that I expected a response. It is a question asked by way of farewell. And much of his memory will be erased upon arrival at his new station in the name of compartmentalization, if ever the logic plague were to re-emerge. For a moment, I wonder if he will remember any of this at all.\\n\\n The Halos have received their final preparation—six huge, deadly rings, as well as Installation 07, the former rogue Halo, which had already been placed years earlier.\\n\\n Only a handful of Lifeworkers assemble in the ship’s command center, along with the seven monitors. Though it is unknown, it appears as though the most of the other rates perished on the greater Ark. The few Lifeworkers here are likely the last of our kind.\\n\\n Except of course for my original and my wife.\\n\\n I can only hope that …\\n\\n But I will think no more of my wife or of anything beyond the task at hand. The budget for reconciliation is barely adequate, down from an hour before. The star roads are obviously having their effect even out here.\\n\\n Offensive Bias suddenly appears before me. I am surprised it has survived. Its presence on the lesser Ark, in full, is more essential than reassuring. Somehow, against all odds, it and a relatively small collection of ships has arrived to defend us. The Lifeworkers must have summoned it in the wake of the greater Ark’s destruction. “Portal opening,” the metarch announces. “Didact … I have received a coded signal from Mendicant Bias. It offers no quarter, expresses full confidence in its successful destruction of this Ark—and asks that I transfer to join it. Allowing me to survive and partner with it.”\\n\\n “Why tell me?” I ask.\\n\\n “Just in case you were still doubtful about my freedom from the logic plague. I am still here, still with you, Didact. I await your instructions.”\\n\\n The metarch’s projection fills my vision, complex truly beyond my comprehension.\\n\\n “Thank you. I have no doubts. Disperse the Halos,” I order.\\n\\n We see the great violet circle of the portal form out in the starless darkness. The Halos begin to move in stately rank one by one toward that circle.\\n\\n And vanish, one by one, with fabulous displays of residual radiation—to be placed throughout the galaxy.\\n\\n STRING 37\\n\\n LIFESHAPER • ERDE-TYRENE\\n\\n I STAND ON the rim of the rift valley where once my Lifeworkers watched over our re-evolving humans. Not far away, Chant’s keyship towers over the parched ground, awaiting my final instructions.\\n\\n Chant-to-Green stands beside me. Chant is among the last of my aides. Most were lost on the greater Ark or consumed by the Flood.\\n\\n When I began to realize what my husband intended, I asked her to return to Erde-Tyrene on a special and very dangerous mission, to determine the extent of Flood conquest in this system, and if possible, to scour and save whatever portion of humanity remained behind. She gladly took the assignment. And now her work is paying off. Erde-Tyrene has been left unchanged since my last visit and humans have been recovered.\\n\\n The air here is quiet; the entire continent lies torpid under a wave of summer heat. To the east, I can see for many kilometers. To the west, a great dust storm draws a line of brown across the horizon.\\n\\n “There’s very little time, Lifeshaper,” Chant says. She does not need to remind me. In her time here, she has located only a few hundred humans, in clumps of four or five, spread across tens of thousands of square kilometers—mostly very old or very young. With a few monitors, she has carefully gathered these few, and now they are in stasis on her research vessel, parked a few hundred meters from the keyship.\\n\\n A handful of other humans have likely made it to the lesser Ark. These then are all we have of natural, physical human specimens. The once-teeming populations of humans are now down to at most three or four species. Without that many healthy, natural templates it will be much more difficult, if not impossible, to use the genetic patterns I’ve stored. \\n\\n","sourceLink":"https://allnovel.net/halo-silentium-the-forerunner-saga-3/page-26.html","bookId":1630,"book":{"id":1630,"title":"Halo: Silentium (The Forerunner Saga #3)","description":"Storyline: Halo: Silentium (The Forerunner Saga #3 , Halo #11) \\n In the last years of the Forerunner empire, chaos rules. The Flood—a horrifying shape-changing parasite—has arrived in force, aided by unexpected allies. Internal strife within the ecumene has desperately weakened Forerunner defenses. Only the Ur-Didact and the Librarian—a husband and wife pushed into desperate conflict—hold the keys to salvation. Facing the consequences of a mythic tragedy, one of them must now commit the greatest atrocity of all time—to prevent an unmatched evil from dominating the entire universe.\\n","cover":"https://allnovel.net/images/halo-silentium-the-forerunner-saga-3.jpg","author":"Greg Bear","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-silentium-the-forerunner-saga-3.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:19:49 PM"}}
