{"id":89904,"no":12,"title":"Page 12","content":"\\n\\n “How well did you know Miss Rockford?” Jude asked.\\n\\n “Know her? I didn’t know her at all,” Avery said.\\n\\n “But she was working on your film,” Jude said.\\n\\n “Directors seldom hire the extras,” Whitney said quietly.\\n\\n “Oh, right, well, of course not,” Jude said.\\n\\n “Her death, however, devastates me,” Avery said.\\n\\n A waitress stopped by their table; Jude ordered coffee and Whitney did the same. Avery already had a cup before him.\\n\\n When she was gone, Avery became businesslike. “I’ve asked my office to make sure that your fellow officer—Detective Sayer—has a list of everyone associated with the film, and what their position is. Except for poor Miss Rockford, of course.”\\n\\n “Of course,” Whitney murmured.\\n\\n “Do you have an idea of anyone else who might have stayed behind last night?”\\n\\n “We have a guard who stays on until the last actor, costumer, production assistant—even caterer—has left the set for the day. Last night that would have been a fellow named Samuel Vintner. My offices have given Detective Sayer everything he could possibly need—phone numbers, addresses, even social security numbers. We desperately want to see this murder solved.”\\n\\n “Thank you for your help,” Jude told him.\\n\\n Angus Avery wagged a finger in the air again, directed at them both. “You mark my words. It’s evil land. I think that they were burying people in the walls and foundations. I think that you’ll find that Jack the Ripper—the real Ripper—is buried somewhere on that location. You have to find the corpse and burn it and say lots of prayers. Maybe that will stop this.”\\n\\n “We’re hoping to catch a flesh-and-blood killer before anyone else dies,” Jude said.\\n\\n “Mr. Avery, there might have been someone—someone working on your movie—who had a grudge against Virginia Rockford,” Jude said.\\n\\n “There might have been. I told you, I didn’t know the girl,” Avery said, sounding impatient at last. “You have the names and office address of the casting directors. Madison and May Casting—they’re actually on Madison. They can tell you all about the extras.” He stood. “If there’s nothing else, I have a date with a bottle of blended scotch whiskey and a friend. This is becoming a nightmare, what with my actors in a stew and the press all over everything in the world…forgive me. Order dinner on my tab, if you like. I need to go now.”\\n\\n “You noticed nothing unusual on the set at all?” Whitney asked.\\n\\n “I told you—the location is cursed. We had a fellow die of a heart attack when he was moving set pieces. That was unusual. Natural causes, though, that’s what they said. And we had a few injuries, too. It’s the location. Go dig up the Ripper, burn his bones and the world will be back to normal. Down to a few domestic, drug and gang murders a week!” Avery had grown really impatient. “I’m easy to find, Detective Crosby. But, please, I’m a busy man. Call me only if you believe I can really help you.”\\n\\n “Sir, police business does take precedence. Rest assured, I don’t like to waste my time. But if I feel that I need you, I will find you, no problem. Wherever you are,” Jude assured him.\\n\\n Avery’s lips tightened as he rose and walked out, a clipboard in his hands. Jude watched as he headed out to the street—and a waiting stretch limo.\\n\\n “Are we having dinner on him?” Whitney asked him.\\n\\n “Nope, and I’m not seeing his movie, either,” Jude said, rising. He looked at the three cups of coffee and laid a bill on the table, and then lifted a hand, hailing their waitress. When she arrived at the table, he said, “Miss, I need that cup, please.”\\n\\n “What?”\\n\\n “I’m a police officer. If you need to get the manager, do so. That cup is evidence in a case I’m working.”\\n\\n “You need a Baggie?” she asked. “The cup is all yours!”\\n\\n “Thanks. I carry my own,” he told her.\\n\\n In a few minutes, he’d secured the cup that Avery had been drinking from. “Let’s go.” He flipped his phone out and put through a call. “Ellis? Hey, yes, I’ve met with Angus Avery. I want the limos that worked that film site yesterday impounded. You’ll need warrants, but you won’t have a problem getting them now. I want Forensics going through them.”\\n\\n He listened for a minute. “I know everyone is working around the clock. Get the limos in anyway. They’ll get to them.” He listened again. “Yep, thanks, Ellis.” He hung up and looked at Whitney.\\n\\n “Where to now?” she asked.\\n\\n Jude hesitated, and then offered her a twisted grin. “I’m going to drop off the cup at the lab, and then I’m bringing you home to meet Dad, Whitney. Seems like the thing to do after this conversation.”\\n\\n Andrew Crosby lived in Hell’s Kitchen, also known as Clinton, which, for some reason, had become a more politically correct term for the area. His home was in a building that appeared to have been built in the late eighteen hundreds. Flowers grew in little patches of earth that might be called a yard, and when they entered the hallway and climbed the stairs to the two second-floor apartments, one of the doors was open.\\n\\n Jude actually lived in the same building; his was the apartment next door. Years ago, when the place had gone co-op, his father had purchased the apartments. His dad’s foresight was something for which he was eternally grateful. Living in New York was expensive.\\n\\n At first, too, after his mother’s death, he’d been glad that he was so close. And now, with the life he led, it was still good to be next door. Andrew had never been the type to intrude; he was there when needed.\\n\\n “Jude, been expecting you all day!” his father said in a booming voice, greeting them at the entry.\\n\\n “Whitney, meet my dad, Andrew Crosby. Dad, this is Whitney Tremont. She’s with the feds who have been sent down on this case.”\\n\\n “A fed! Nice,” Andrew said, greeting Whitney warmly. Naturally, Whitney still seemed lost, since he had told his dad that she was there, but hadn’t told her anything about his father other than that he was good at puzzles, knew the city like the back of his hand and would be expecting him. “I have pasta ready for the pot, and I’ve been brewing up a sauce all day. It’s meat sauce. I’m sorry, I wasn’t expecting you, Agent Tremont. I hope you’re not a vegetarian.”\\n\\n “I’m not, but I do have a team member who is, if you ever need to host us all for some reason,” Whitney told him. She was smiling. Well, his father was likable.\\n\\n As they chatted, Jude saw that Whitney learned that Andrew Crosby had worked his way up the ranks without benefit of higher education, and he had reached the rank of lieutenant. He’d worked the worst streets, the most unusual crimes and, been commended for bravery several times. He’d retired just a decade ago, when Jude’s mother had first been diagnosed with cancer. He’d spent every day at her side until she had slipped away.\\n\\n “Since you’re having me to dinner, I hope I’m able to return the favor,” Whitney told him.\\n\\n “Well, I must say, seems that I’d like that, if the rest of your team members are anything like you. But, of course, we’ve got a situation going,” Andrew said. “You two haven’t been watching television, I take it?”\\n\\n “What now?”\\n\\n “Here, I’ll show you,” Andrew said.\\n\\n He led them past the entrance. The apartment was just as it had been a decade ago. Jude had finally convinced his dad—when his mom had been gone two years—that she would have been angry with him if he hadn’t given her clothing and shoes to Goodwill. But the throw she had knitted remained on the couch; her doilies still covered the occasional tables. The only concession his father had made to modern living was the entertainment center; he had a good flat-screen television, a sound stereo system and even Rock Band and a Wii Playstation.\\n\\n As they followed him into the living room, Andrew picked up the remote control and hit a play button on the television.\\n\\n Jude frowned, not certain what he was watching at first. Then he realized that the two beautiful young people on the screen were giving a press conference.\\n\\n “Bobby Walden and Sherry Blanco,” Whitney said.\\n\\n “Yep,” Andrew said.\\n\\n “The leads in Angus Avery’s movie?” Jude murmured.\\n\\n “I knew her only briefly, only in passing,” Bobby said. “But Ginger Rockford was a beautiful person, and we’re all horrified at her death.”\\n\\n “This movie is dedicated to her memory!” Sherry Blanco put in, dabbing at a tear.\\n\\n “But aren’t you afraid? Aren’t you afraid to continue filming?” one of the reporters asked. Jude squinted. It appeared as if they’d done the press conference in front of the Plaza. They were standing on red-carpeted steps, and the press was kept at a distance by velvet ropes. It was almost like a premiere night.\\n\\n “We can’t be afraid,” Bobby said. “We owe it to Ginger to finish the film.”\\n\\n “And, of course—” a man in a suit—one of their agents?—stepped in front of the microphone “—of course, we’re increasing security on the set. We’re cutting all night hours and doubling up on our security personnel. And we’ve negotiated new locations for the rest of the shoot, though! Rest assured. We will remain in this great city!”\\n\\n Those words were greeted by a roar of applause.\\n\\n “There’s a murderer on the streets—a heinous killer—and what really matters is that America’s sweethearts are going to finish a movie,” Jude said thoughtfully.\\n\\n “Nothing you can do about pop culture, son. I just thought you should see this,” Andrew told him.\\n\\n “She didn’t do it,” Whitney said.\\n\\n “Too small. I don’t think she could have managed the kind of strength needed,” Andrew agreed.\\n\\n Jude looked at the two of them. They had taken up positions on the sofa, watching as Andrew ran the recorded version of the press conference. \\n\\n","sourceLink":"https://allnovel.net/sacred-evil-krewe-of-hunters-3/page-12.html","bookId":2277,"book":{"id":2277,"title":"Sacred Evil (Krewe of Hunters #3)","description":"Storyline: Sacred Evil (Krewe of Hunters #3) \\n A terror born of Jack the Ripper \\n The details of the crime scene are no coincidence. The body — a promising starlet — has been battered, bloodied and then discarded between two of Manhattan\u0027s oldest graveyards. \\n One look and Detective Jude Crosby recognizes the tableau: \\n A re-creation of Jack the Ripper\u0027s gruesome work. But he also sees something beyond the actions of a mere copycat. Something more dangerous…and unexplainable. \\n As the city seethes with suspicion, Jude calls on Whitney Tremont, a member of the country\u0027s preeminent paranormal investigating team, to put the speculation to rest. Yet when Whitney and Jude delve deeper, what they discover is more shocking than either could have predicted, and twice as sinister...\\n","cover":"https://allnovel.net/images/sacred-evil-krewe-of-hunters-3.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/sacred-evil-krewe-of-hunters-3.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:38:02 PM"}}
