{"id":89928,"no":36,"title":"Page 36","content":"Ellis actually laughed. “Yeah, I’ll get some sleep somewhere along the line. Keep me posted on anything you need.”\n Whitney was surprised when he smiled at her. “Agent Tremont,” he acknowledged and nodded goodbye.\n When Ellis had gone, Jude sat next to Whitney. He had to smile. There was a large smudge of dirt on her cheek. He reached out with his thumb, rubbing it off. She watched him with her huge golden eyes as he did so. He started to speak, and he wasn’t sure what he was going to say, but it didn’t matter, because his cell phone rang.\n It was Ellis Sayer on the line already as he was driving.\n “I’ve put a ‘Crosby needs it now!’ on the forensics for the limos,” Ellis said. “I have the drivers on alert that you’ll be talking to them. Right now, they’re making comparisons to tissue and blood samples from our Jane Does to the blood we’ve managed to extract from the foundations.”\n “The House of Spiritualism?”\n “We’ve got a twenty-four-hour watch on the property now. The bodies have all been…exhumed? Anyway, they’re at the morgue.”\n “Well, then, I’ll take a look while I’m here,” Jude told him.\n “I’m thinking that the coat probably came from the movie’s costume department. We’ve gone through every thing they had and haven’t found a thing,” Ellis said.\n “And they didn’t note that one was missing?” Jude asked.\n “All of theirs are present and accounted for—unless someone in costuming is lying,” Ellis told him.\n “Interesting. Thanks,” Jude said. He hesitated. “And no new victims yet?”\n “Not that we know about.”\n “Thanks, Ellis.” He was thoughtful a minute. “Let your men handle the Dumpsters. I need you to get to the veterans’ home where Captain Tyler was taken. I need to know exactly what he ate, if he was given any drugs, if anyone came to see him and exactly who reported to work and was in the building in the last twenty-four hours.”\n When they hung up, he knew that Whitney had heard the majority of the conversation.\n “What do you think?” he asked her.\n “About?”\n “The coat,” Jude said. “What’s the deal with costuming?”\n Whitney was thoughtful a minute. “They keep close tabs on costumes, they’re expensive. If one was missing and I were the wardrobe mistress…I have to admit, I’d think about lying. If a coat was missing and she hadn’t reported it, she—or he—could be in trouble. Trouble as in losing a job if it came up later that a costume had just disappeared and nothing was done.”\n “Could someone fix documentation?” he asked.\n She looked at him with a dry grin. “People can doctor just about anything.”\n Jude nodded thoughtfully. “This is crazy, though. I guess Ellis wasn’t supposed to have found the guy on the street that quickly.” He sighed. “With any luck, we can find out who drugged Tyler.”\n “With any luck,” Whitney agreed. They both knew that the personnel at the veterans’ hospital would be underpaid, understaffed and overwhelmed.\n Jude hoped that maybe a security camera of some kind had actually worked. As he mulled that over, Dr. Sullivan came out to speak with them.\n “You’ve something for me?” Jude asked.\n “Oh, yes, your Captain Tyler was drugged.”\n “With what, how and when?” Jude asked him.\n “GHB,” Dr. Sullivan said, “Gamma-hydroxybutyric acid. Essentially, it’s a date-rape drug.”\n “I know what it is,” Jude said softly. “Easy to mix up a batch…you don’t even have to be a chemistry major.”\n The doctor shrugged. “The government tries to control it, and it’s on the same lists as LSD and heroin. But, as you said, anyone can mix up a batch in his or her kitchen.”\n “How did he ingest it?” Whitney asked.\n “With a cup of coffee, probably. Or a glass of water, maybe even a glass of juice.” Sullivan shook his head. “Here’s the real problem with the drug, of course. It erases memory. Sometimes, in rape cases, the women remember snatches of events, or maybe something like a one-frame picture of where they were. In some cases, the victims remember nothing at all. People have died from overdoses, so we’re lucky Captain Tyler is alive.”\n “It was planned that Captain Tyler be alive,” Jude said thoughtfully. “Dr. Sullivan, would you see that he gets some lunch and some rest? And I have to make some kind of arrangements for him. I don’t want Captain Tyler back on the streets, and I don’t want him back at the home. I—”\n “Hey, don’t fret on that,” Dr. Sullivan said. “I’ll bring him home for the night.” He grimaced. “My mother is in town. She needs someone to hover over other than me.”\n “That’s above and beyond,” Jude said. “I can find another shelter. I can even bring him in to the hospital for observation. I have a neighbor—”\n “He’ll be fine with me,” Sullivan assured him. “Honestly. I like the old codger. Who knows, maybe Mom will like him, too. She’s driving me insane, that’s for sure. I’m not expecting him to have any recall, but in case he does, I’ll know how to talk him through whatever memory may come back up, and I’ll contact you the second that I do.”\n “That’s great, then, thank you. I want to drop the coat off at my office, but I want to check up on the skeletal remains as well.”\n “Ah, yes! I heard about the find,” Dr. Sullivan said. “We’ve got bags here.”\n The remains from the House of Spiritualism were in an autopsy room, lined up one after another. The remnants of clothing had been carefully bagged and tagged.\n The bones looked lonely on the tables, sad and white, the empty-socket eyes seeming to stare out into space, like props at a movie set or a Halloween scare event. But they were real.\n Fullbright was there when they arrived. “Wouldn’t give up the supervision on this!” he assured them. “We’ve found plenty of nicks on the bones, and I’d bet a year’s pay that they were all nearly beheaded. Jack the Ripper strangled his victims. I believe that these women were awake and aware when their throats were slit. But we’ve only begun the work. We’ll know more when we’ve had more time.”\n Jude looked at Whitney; she appeared ashen.\n “You okay?” he asked her softly.\n She nodded, but something in the room was still disturbing her.\n “Have you estimated the age of the bones?” Jude asked.\n “Well, the clothing patterns and remnants—even stained and such by fluids—definitely appear to be late Victorian,” Fullbright said. “We’ve estimated the age of most of the victims to be late teens to early twenties. Some have very bad teeth, which would suggest that they had been poor, immigrants perhaps. Sadly, yes! The refuse of life of that pitiable time.” He shook his head. “Killing them was easy. I don’t know if they were even missed with more than a passing thought. Come tomorrow, and I’ll be able to give you a closer age estimate and even race, maybe nationality, of most of them. Well—” he glanced over at the forensic anthropologists, busily working “—I and my comrades of this adventure will be able to tell you much more tomorrow.”\n “Hey, are you really all right?” he asked Whitney as they left the building. “I can get you back to Blair House. I become obsessed, but I don’t have the right to drag you along with me all day. In fact, I really don’t have the right to separate you from your team at all.”\n “Oh, no, I’m glad to be with you, and I’m perfectly fine,” she said. She looked ahead as they walked. “It was just…the skulls. The jaws on some were disarticulated from the skulls, and it looked as if they were staring at some horror.”\n “Yeah,” he said huskily. “I can take you back to Blair House.”\n “No. I want to work this,” she said firmly.\n She was such a proud little thing, and her stature, the way she carried her body, gave her a presence that wasn’t due to her size. He couldn’t help feeling as they walked that he wanted to shield her from the unpleasantness at hand. He reminded himself that she was an agent.\n That didn’t stop them from being people. It didn’t stop him from that growing feeling that they were meant to be together. So she had annoyed him at first, but that initial annoyance had turned into something else quickly. He wouldn’t have been human, he’d have had to have been a eunuch, not to feel a sizzle of instant awareness when she was near. Awareness quickly became realized as basic desire, and he was a fool to keep needing her around him.\n But he did. And he couldn’t even say that she wasn’t good with him, working the case, because she was.\n And, hell, he was a cop. He had strength of purpose, damn it. He could force himself to a steel-willed control.\n His dreams were his own, even his dreams of hot, carnal, naked passion. She didn’t need to know that he kept imagining her naked.\n Twenty minutes later, they had the coat delivered to and registered into the lab; Jude made sure it was in the hands of Judith Garner, who was still, along with her crew, wrangling the evidence gathered from both the Broadway and the Bowery sites.\n Jude was fairly certain by then that he had himself—and his wandering mind—in check.\n He told Whitney that he wanted to check in with Hannah, and they did so. “I don’t have anything new yet,” she told him. “But I started on background checks yesterday, and Jake Mallory and I divided the work—we have hundreds of names to go through. I’ve got the programs situated to spit out all kinds of concurrences, similarities, mental defects, sealed juvenile records, you name it. We’re working on anyone even remotely connected with the film, and with Blair House, and the House of Spiritualism.”\n “And,” Jude reminded her, “anyone who has worked in a slaughterhouse, in an autopsy room, with medicine and anatomy in any way. And anyone who knows something about law enforcement, evidence, what we can really find and what we can’t find.” \n","sourceLink":"https://allnovel.net/sacred-evil-krewe-of-hunters-3/page-36.html","bookId":2277,"book":{"id":2277,"title":"Sacred Evil (Krewe of Hunters #3)","description":"Storyline: \n Sacred Evil (Krewe of Hunters #3) \n A terror born of Jack the Ripper \n The details of the crime scene are no coincidence. The body — a promising starlet — has been battered, bloodied and then discarded between two of Manhattan\u0027s oldest graveyards. \n One look and Detective Jude Crosby recognizes the tableau: \n A re-creation of Jack the Ripper\u0027s gruesome work. But he also sees something beyond the actions of a mere copycat. Something more dangerous…and unexplainable. \n As the city seethes with suspicion, Jude calls on Whitney Tremont, a member of the country\u0027s preeminent paranormal investigating team, to put the speculation to rest. Yet when Whitney and Jude delve deeper, what they discover is more shocking than either could have predicted, and twice as sinister...\n \n","cover":"https://allnovel.net/images/sacred-evil-krewe-of-hunters-3.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/sacred-evil-krewe-of-hunters-3.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:38:02 PM"}}
