{"id":89932,"no":40,"title":"Page 40","content":"\n As he parked for the night, he prayed that his dad would have a bourbon waiting for him.\n A big one.\n And he wondered if even that would help.\n The dog came to Whitney again that night. She had lain down, her mind still reeling, and closed her eyes. For once, she hadn’t been thinking about the case. She was remembering that she had basically spent the night before sleeping on top of Detective Jude Crosby. His fingers, so long and strong, had held her own. She’d felt the rise and fall of his breath, and the heat and vitality of his muscles, the breadth of his chest…\n The memory was interrupted by the sound of a soft whine, and then again, a damp nose against her fingers.\n She opened her eyes. He was seated at the side of her bed.\n “What?” she asked softly. “We found your mistress. We’ll make sure that she’s buried in a cemetery. I’ll make sure that prayers are said. It will be all right.”\n She looked across her room. The bathroom light was on. In its glow, she saw the woman.\n “Annie. Annie Doherty?” she said softly.\n The image faded.\n The ghost dog remained.\n “I have to go to sleep, I really have to. You want something else from me, but if I don’t sleep, I’ll never know what it is,” she said softly.\n The dog whined and wagged his tail.\n Then she felt a sense of pressure as he jumped up onto the bed. In typical dog fashion, he circled three times and then lay down, facing her, his eyes sad.\n She suddenly wondered if he had come to watch over her.\n “Were you really allowed to sleep on the bed?” she asked.\n The dog wagged his tail; the long furry appendage seemed to thump on the bed.\n “All right, then. We’re going to sleep.”\n To her amazement, she lay down and quickly felt dreams overtake her.\n They weren’t nightmares. They were sweet dreams. She was lying with Jude Crosby, and it was the most natural thing in the world. And they weren’t cramped up on a couch; they were in a bed.\n Her sleep deepened, and it became restful.\n Until she heard her cell phone ringing in the morning, so constantly that she thought it would vibrate right off the bedside table.\n She fumbled, knocked it to the floor, found it, saw that the caller was Jude and answered quickly.\n “They’ve found trace evidence in the limo that was assigned to Angus Avery,” he said. “Blood drops—the blood was Virginia Rockford’s.”\n 13\n Jude sat across from Angus Avery in a situation very different from the last time they had met. There was no pleasant New York bustle going on around them now. The chairs were rigid, cold and uncomfortable, the lights harsh.\n He’d been read his rights, but he still appeared to be stunned. He hadn’t demanded to be left alone while he waited for his attorney to show up. Jude hoped that would take some time. It was rush hour, so it might. Angus Avery certainly had a high-powered attorney, who would get the man out on bail, unless an underpaid district attorney could convince the judge that he was a flight risk or too dangerous to be on the loose.\n “This is insane!” Avery told him, shaking his head. “I’m a filmmaker, not a killer! I cooperated with your questions. You have…you have blood in a car that carried me to a dinner. I wasn’t in that car again. This is…what do you call it? It’s not proof—its circumstantial evidence, that’s what it is. You have people searching my apartment now, right? You won’t find anything. And why won’t you find anything? Because I didn’t do it!”\n Jude knew that Sayer and the deputy chief were standing behind the mirror, monitoring the proceedings. Others were surely there as well.\n The limo driver, Eric Len, was cooling his heels in another interrogation room. In a few minutes, Sayer would go speak with him. They’d give him a few minutes to sweat, and then tell him that Angus Avery had implicated him. Outright lies often tripped up an accomplice.\n But Jude didn’t feel right. Avery was literally in tears, protesting his arrest.\n “I didn’t do it!” he insisted.\n “How did Virginia Rockford’s blood get in that limo?” Jude asked him. “Honestly, I’d like to help you out.” He actually meant the words. He’d suspected that the director might be involved, but now, something about the situation seemed far too easy. “There’s more, Mr. Avery, I’m afraid. There were hairs and epithelial cells that match your DNA found on the cloak that Captain Tyler was wearing when he was found after being kidnapped from a veterans’ home.”\n “I didn’t give permission for my DNA to be taken!” Avery protested. “That’s my right—you didn’t have just cause. You can’t bring my DNA into court!”\n “Mr. Avery, I took your DNA from a cup that you’d been drinking from at the diner where you met with me, and it was perfectly legal,” Jude told him. “If you want to come clean with me, I can help you. We can talk with the D.A., you know that. You know that people deal all the time.”\n “I didn’t do it! I’m being framed,” he said desperately.\n “It may be circumstantial evidence, but it’s just about overwhelming,” Jude told him. “And the city is in a panic over these murders. You’re in real trouble. You need us. You need our help.”\n There was a tap on the door. A small, slim, middle-aged man in a crisp black Versace suit walked in. “My client has nothing else to say. We need privacy.” He produced a card and handed it to Jude. “Alton Morrison III, Detective. I’ll be representing Mr. Avery.”\n Whitney was stunned. She had expected that if the police really caught the killer he’d confess. He’d be proud of his work, though sad he hadn’t accomplished the scenario it seemed he had planned. But, of course, human nature could be strange.\n It was all over by the time she and Jackson arrived at the station. Eric Len had demanded an attorney immediately, but not before he had sworn that he’d returned the car to the garage just as he had said—and as records showed—and that he had gone home, alone. His wife couldn’t verify that information for him because she was back in China, visiting family. But he knew nothing. Nothing. He had never lied.\n Angus Avery was taken to be arraigned that afternoon.\n His high-powered attorney couldn’t get him released on bail, but he did manage to negotiate a house arrest, since the police evidence was circumstantial. He could return to his apartment with an ankle monitor. For his own safety, and the possible safety of the people of New York, he would also be closely monitored by the police—in other words a beat cop would be assigned to watch his comings and goings.\n The police were appalled; the public was divided. Naturally, there was a press conference, and Avery denied passionately that he was guilty; he was being framed, and he suspected the NYPD who were desperate to say that they had solved a murder—they were arresting an innocent man, just as they had arrested and jailed an innocent man in the 1890s for the murder of the Ripper victim Carrie Brown. In court, he swore he would prove himself innocent.\n Whitney saw little of Jude that day; he was busy with the lab, with paperwork, with discussions with the prosecutors, making sure that all the evidence was in order. The team stayed at the station long enough to contribute what they could, and then returned to Blair House to discuss the arrest. Jackson didn’t seem convinced that Angus Avery had committed the killings, but he didn’t say that it was impossible. The police had a weak case against the limo driver at best; there was no more reason or evidence that he should have smuggled the car out of the garage after its return than anyone else. Jackson determined that they would remain in the city at least another week, helping to tie up loose ends, if need be, and also because the film they continued to see on the bank of screens from the foundation abyss at the property next door was a phenomenon they all wanted to explore. They were cleared through the bureau, the NYPD and the city.\n It seemed a restless day. Whitney sat with Angela at the bank of screens that afternoon, just watching the strange shadows. But they didn’t change, and they didn’t do anything. She went upstairs to lie down, surprised that she was so tired when she hadn’t really done anything.\n In time, Angus Avery would certainly break. He would explain how he had gotten the car out of the garage, and how he had kidnapped Captain Tyler.\n If he was indeed guilty.\n Jude had told her briefly that the task force would remain together, gathering evidence on the chauffeur, Eric Len. So far, they really had nothing on him except that the car had been assigned to him, and he had been Avery’s driver.\n She felt…dissatisfied. Somehow, she had thought that they’d have a more thorough completion of the case, that they’d understand what had happened, how and why.\n As she lay on her bed, she heard the dog again. She sat up. He appeared by her side again, whining softly.\n “I don’t even know your name!” she told him, stroking the soft ears. “Most people can’t see you. Not even my friends—though Jake can hear you—but I can. I even feel how soft your fur is, even though you’re a ghost dog.”\n The dog whined softly again. He wagged his tail.\n She started, hearing a rap at her door. Angela’s voice came to her quietly. “Whitney, Jude is here to see you.”\n The fluttering of her heart alarmed her, and she smoothed down her shirt and her hair as if to soothe it. He’d probably come about something to do with the case.\n She left her room and walked calmly down the stairs. Jude was there in the hallway, watching the screens with the others. “It has to be something in the air. Or a chemical that seeped into the floor that only shows on your high-resolution film,” Jude said.\n The others didn’t answer him. He didn’t notice. He had seen her coming down.\n “Is there anything new?” she asked him. He had looked perplexed at the station, as if he, too, had found the closure of the case to be anticlimactic.\n He shook his head. And then his lips curled as he gave her the grin that never failed to start that electric sensation in her veins. “I came to see if you wanted to go to dinner with me without having to discuss blood and murder—or Jack the Ripper.” \n","sourceLink":"https://allnovel.net/sacred-evil-krewe-of-hunters-3/page-40.html","bookId":2277,"book":{"id":2277,"title":"Sacred Evil (Krewe of Hunters #3)","description":"Storyline: \n Sacred Evil (Krewe of Hunters #3) \n A terror born of Jack the Ripper \n The details of the crime scene are no coincidence. The body — a promising starlet — has been battered, bloodied and then discarded between two of Manhattan\u0027s oldest graveyards. \n One look and Detective Jude Crosby recognizes the tableau: \n A re-creation of Jack the Ripper\u0027s gruesome work. But he also sees something beyond the actions of a mere copycat. Something more dangerous…and unexplainable. \n As the city seethes with suspicion, Jude calls on Whitney Tremont, a member of the country\u0027s preeminent paranormal investigating team, to put the speculation to rest. Yet when Whitney and Jude delve deeper, what they discover is more shocking than either could have predicted, and twice as sinister...\n \n","cover":"https://allnovel.net/images/sacred-evil-krewe-of-hunters-3.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/sacred-evil-krewe-of-hunters-3.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:38:02 PM"}}
