{"id":89935,"no":43,"title":"Page 43","content":"The double event. The killer had gone for the double event on the night that Angus Avery had been under house arrest. The body of this woman lay identical in pose and mutilation to that of Catherine Eddowes, fourth Ripper victim. When the autopsy was performed, he knew the findings would be nearly exact. She was warm. She hadn’t been dead long. He spoke into his radio mouthpiece. “Get Fullbright over here. Get him over here now. And get every man on the street moving. Subways, alleys—set up a roadblock along Broadway. I don’t care if we bring the entire city to a halt.” He stood, feeling as if his veins and muscles were made of ice, as if he had grown very old. Then he walked over to where the others were standing a distance from the body. “Ellis, stay with Fullbright, please. Keep every available person searching the streets. Somewhere nearby, we’re going to find the words The Juwes are not the men to be blamed for nothing written over a doorway—and there will be a bloody piece of our victim’s clothing beneath it.” He looked around the street. He stood and started walking. A bit in the distance, he could see the spire of Trinity church. He considered himself a decently spiritual man, if not a religious one. At that moment, he wished he could go into the church, fall on his knees and beg God to send them all a miracle. He started for the church, but then he paused. He knew where he would find the writing. Whitney must have read his mind. “Blair House,” she said from behind him. They were both right; the gate to the house was open. They didn’t need to speak to one another to remember to touch nothing. On the porch lay a bloody strip of fabric, ripped from the last victim’s skirt. And over the door of Blair House was written in chalk the words that Jude had just said. The Juwes are not the men to be blamed for nothing. “We’ll get Forensics,” he said wearily. “We’re going to need several teams out here on the streets tonight. No one sleeps.” If the city had been in a panic before, it was afire now. The papers and media carried nothing but information on the New York murders, and the hotels in Lower Manhattan were emptying. Angus Avery screamed for his freedom, demanding that he be set free from his electronic monitor. But because of the evidence against him, Deputy Chief Green could continue to hold him; it was more than possible that the murders had been committed by more than one person, and that Avery’s accomplice had purposely timed the double event when he was under monitor and guard, therefore trying to prove his innocence. Jude spent the day at the station reinterviewing every possible suspect and witness. He had in Captain Tyler and Major Radison, as well. He had in the best possible sketch artist, and he gave the sketch to both Hannah and Jake Mallory, and both returned the typical Victorian gaslight picture of the Ripper, excellent 3-D images. He questioned both men further about the killer’s face. Captain Tyler proved to be no help. He hadn’t seen the man’s face; he had only seen the figure at a distance. Nor had his memory returned about anyone having been in his room. He’d had some water before he went to sleep…he often did when he could. But he hadn’t seen anyone in his room. Major Radison gave the question of the man’s face deep thought. “It was very odd,” he said. “Odd how?” Jude asked him. “Like—blank. As if he was wearing some kind of Venetian carnival mask,” Major Radison said after a minute. “As if there was really nothing there, just a white face with no expression and nothing…live about it. Nothing real at all.” Jude sat back, drumming his fingers on the table. A mask. That brought him back to costumes and make-believe—the movies. But it was true that Angus Avery had not left his apartment during the night. His ankle monitor had not gone off. Any device could be hacked, Jude knew, but several cops had been watching the director’s place. It would have been damn hard for them all to be crooked. He allowed the old soldiers who had tried valiantly to help to return to the veterans’ home. They had become good friends, so it seemed, in the time they had been at the police station. Trying to help had seemed to strengthen them both, and Tyler was mortified that he couldn’t help more. Jenna, at the station with Jackson, Whitney and Jake, assured the captain that he had done a great deal for them, and it was not his fault that he could remember nothing—it had been the drug. He had Mrs. Allie Lipton, the wardrobe mistress from the movie set, brought in. At first, she stubbornly denied having made any mistake on her calculations; she knew that Angus Avery was strict. He had to stay on budget. He wouldn’t stay on budget by having to replace costumes stolen by two-bit extras. But then he asked her why one of the limo drivers had had to go to a fabric store. She was an older woman, plump, somewhere over fifty. He saw her hesitate, though she quickly gathered her wits and said, “Costumes are always tearing, and I’m always mending something. He went for patches, thread, that kind of thing.” “And, of course, a receipt was turned in. I’ll get a copy of that receipt,” Jude told her. “Even if you don’t have it, believe me, I’ll track down your purchase.” She sat very still, and then her lower lip began to tremble. “One of the cloaks disappeared—they’re actually caped coats, you know—regular coats with sleeves, and then a short cape over the shoulders. I didn’t dare tell the director. He would have said it was my fault. And I could swear that every extra on the set returned his or her costume. I could swear it! Avery would have fired me for not having control. I can’t get jobs as easily as I used to—you’ve got to believe me, Detective, the movies are run by the young.” Jude stared at her. He wanted to tell her that her lie might have cost lives, but it wouldn’t have been true—they had suspected that the killer’s period costume had come from the movie set. “When did the cloak disappear?” he asked her. “At the shoot at the construction site?” “Oh, no—two weeks before that,” she told him. “We’d been working on Staten Island. That’s when the cloak disappeared. I didn’t try to replace it until we had the same number of extras working again. That’s why…that’s why I didn’t believe that its disappearance could be related to the killing that night. And the papers said that there were Jack the Ripper victims, but they didn’t say that anyone had actually seen Jack the Ripper walking around. Please, please, you can’t tell Mr. Avery. Of course, Mr. Avery has a court date now, but…oh, he couldn’t have anything to do with this! Detective, I know that you have this information, but, please, please, please, don’t report me to the powers that be at the movie company. I used my own money to buy the fabric to replace the cloak. Please.” He couldn’t help but feel sorry for Allie Lipton. “I need the information for our investigation, Mrs. Lipton. I’m not the movie police.” He let her go; she could return to work. Apparently, the assistant director was filming action shots that day with the film’s stunt performers. Sherry Blanco came back in, her lawyer in tow this time. Jude was surprised, but he had nothing against the lawyer sitting in. “Miss Blanco, we’re not accusing you of anything, but I’m afraid that you were working with a murderer at some point during this film,” he said. She looked at her lawyer, and then at Jude. “I told you, and I don’t know why you don’t understand this. I don’t know the extras. Sometimes I don’t even see the extras.” She sat back, shaking her head, and then she leaned forward again. “Look, I’m not trying to pull any kind of…rank here, but I’m the star. Stars don’t have to know the extras, or even the bit players. I don’t eat with the others, I don’t get warm and chummy with the others. And, hey, I’m not a nasty person. I do make friends, but you have to realize, people want to use me, too. I have to keep my distance.” He smiled. She wasn’t going to give him anything. He was going to give her something to think about. “Well, I suppose that’s good. Because the killer could still be working on your set.” “You’ve arrested Angus Avery, remember?” “Two women were killed last night, remember?” Jude countered. “Then maybe you should let Angus go,” she said, smirking. “Maybe. And maybe he has been working with someone. Killers who work together have certainly caused a great deal of death and agony over the years. But you are the star. I guess you don’t have to worry, walking out of your trailer or getting into a limo.” She turned white. “Detective!” her lawyer snapped. “Yes? Can you point out what’s untrue about my words?” he asked. Her attorney wasn’t a fool. He stood, drawing her up by the elbow. “My client isn’t under arrest. She has answered all your questions, and we’re leaving.” Jude stood and smiled. “Thank you so much. Enjoy your day, Miss Blanco.” When they left, he discovered that Deputy Chief Green wanted to see him in the lab. He knew that Whitney and Jake had been at the computers all day with Hannah, searching for any trigger in the background of any possible suspect or major player in the case. But he and Jackson weren’t heading to the computers; they were off to see Judith Garner in the lab. As they walked to the lab, Jude again felt a sinking feeling. “A letter—we’ve received a letter,” he said, seeing Green. In London, back in the day of Jack the Ripper, the police had received hundreds of letters from those wanting to solve the case, and those convinced they were, or knew, Jack the Ripper. Green nodded grimly. “In the mail, postmarked Lower Manhattan,” Green told him. “And it’s an exact copy of the letter sent to George Lusk, head of the Whitechapel Vigilante Committee—the ‘From Hell’ letter. It’s one of the few letters they considered not to be fake, am I correct?”","sourceLink":"https://allnovel.net/sacred-evil-krewe-of-hunters-3/page-43.html","bookId":2277,"book":{"id":2277,"title":"Sacred Evil (Krewe of Hunters #3)","description":"Storyline: Sacred Evil (Krewe of Hunters #3) A terror born of Jack the Ripper The details of the crime scene are no coincidence. The body — a promising starlet — has been battered, bloodied and then discarded between two of Manhattan\u0027s oldest graveyards. One look and Detective Jude Crosby recognizes the tableau: A re-creation of Jack the Ripper\u0027s gruesome work. But he also sees something beyond the actions of a mere copycat. Something more dangerous…and unexplainable. As the city seethes with suspicion, Jude calls on Whitney Tremont, a member of the country\u0027s preeminent paranormal investigating team, to put the speculation to rest. Yet when Whitney and Jude delve deeper, what they discover is more shocking than either could have predicted, and twice as sinister...","cover":"https://allnovel.net/images/sacred-evil-krewe-of-hunters-3.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/sacred-evil-krewe-of-hunters-3.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:38:02 PM"}}
