{"id":89944,"no":52,"title":"Page 52","content":"\n “Alive?”\n “When I left. Hurry!”\n The dog was ahead of him, barking insanely, as he raced up the stairs. Jude followed two steps at a time and tried to burst into his apartment. The bolts were solid; he’d seen to it.\n Swearing, he rushed to his father’s door, burst in and dashed through the splintered door to his own apartment.\n The dog was ahead. He followed the dog.\n Bobby Walden pressed his full weight into Whitney; she was tearing and ripping at his fingers, struggling desperately against him.\n He would happily have shot the man, but the way that they were struggling… Whitney suddenly twisted and blocked his shot. He sheathed the gun and tackled the man who was on top of her, bringing them both off Whitney and rolling across his den floor.\n Bobby Walden knew how to fight, but he didn’t have Jude’s size or strength, nor did he spend his free hours with a punching bag, learning how to burn off frustration.\n Bobby only got in one good jab; Jude was furious, seeing red, and he pummeled the man. Until he felt Whitney’s fingers, weak, but tugging at his shirt.\n “Jude…no. He’s got to stand trial. He’s got to help us sort through it all.”\n He eased back; his hands were bloody. For a moment, Bobby Walden, wound in the cloak, the mask ripped away, lay on the floor. His face was swollen, his eyes were nearly closed. He was alive—Jude could see him breathing.\n He stood up, reaching to drag the man to his feet.\n “Bobby Walden, you’re under arrest for the murder—”\n To his amazement, the man suddenly screamed—a piercing, bone-chilling scream that sounded louder than anything Jude had ever heard.\n The ghost dog started barking insanely again.\n Jude twisted around, wondering what could cause such a shriek of pure terror.\n He thought that he heard the swish of fabric. It seemed that there were shadows and strange forms in the air; he thought he caught a whiff of perfume.\n “No! No! No!” Bobby suddenly screamed. He broke loose from Jude and ripped his clothing and his flesh, bolting through the window to the fire escape. “Ah, hell!” Jude raged, trying to fling himself after the man.\n But it seemed that he couldn’t get through the figures, as if the air had become water or rich honey, impossible to penetrate. But it wasn’t the air; it was the women moving after Bobby Walden.\n He made his way to the window, but Bobby’s back arched against the metal rungs of the fire escape.\n Before Jude could reach him, he fell…\n He didn’t hit the ground.\n He was caught on the metal rungs of the fire escape, and there were sickening moments in which the man sputtered and choked…until he strangled to death on the heavy rawhide loop he had around his neck. A talisman was attached to the rope.\n The relic that held the finger bone of Gilles de Rais.\n The barking stopped.\n The room seemed to be freshened by a sudden rush of clean air.\n Jackson Crow and Jake Mallory burst into the room, guns in position, followed by members of the NYPD.\n Jude came to where Whitney was slumped on the floor and fell down at her side. He took her into his arms.\n There was a great deal more to be done by law enforcement at that moment.\n But…\n No man was an island. Law enforcement wasn’t one man. There was a task force working this case.\n They could deal with the situation now….\n No way he was writing another report tonight.\n Epilogue\n Whitney had been dosed with a powerful combination of drugs, all available to any good-looking marquee name. Jude was horrified to realize that the man had been using Hannah for information on what was going on with the case. Jude knew he’d have to talk to her, and he sat for long periods of time wondering about people in general. Some of the victims Angus Avery and Bobby Walden had chosen had been hungry for fame and a better life.\n But Hannah had just been hungry for attention from a man who had really seemed to care about her.\n Whitney was kept in the hospital overnight.\n Jude stayed by her side.\n He had a feeling they would one day discover that Bobby Walden had employed knowledge he’d learned about date-rape drugs earlier. He’d been an up-and-coming star, and those women he had accosted before he had fallen in with Angus Avery—and his particular form of the devil—had probably never reported that he’d raped them, if they’d realized it. Who would have believed them?\n It was good that Ellis was just what he seemed. A good cop.\n And it was good that Wally Fullbright was what he seemed, too. An eccentric little man with a keen interest in mysteries and a talent at autopsy.\n He left Ellis to deal with Angus Avery as they used what they had learned from Bobby Walden to try to piece together exactly what had happened.\n Avery’s house arrest was revoked. He answered a few questions, and they learned that he was proud of all that he had accomplished. He’d known about Jonathan Black and been fascinated with theories about Jack the Ripper and Black since he’d been a child growing up by the seaport. He’d written the movie years before, and he’d known that he had to re-create the fear of the late 1890s.\n Jonathan Black had told him so.\n They didn’t learn much more about the details of who had done what because Angus Avery strangled himself to death in his cell at Rikers Island with the sheet from his bed. His death surprised everyone; he hadn’t been on suicide watch.\n Whitney and Jude knew, of course, that he’d been prompted to his action by a different power.\n Cops were supposed to believe in justice, not vengeance, Jude knew.\n But he’d seen the bodies of their victims on the autopsy tables.\n He couldn’t feel any sorrow.\n He was due to receive a commendation that he didn’t feel he deserved. What he did deserve, and what he was taking, was a long vacation.\n Ellis Sayer was one damn good detective, and the world of New York would be just as well served with Ellis holding down the high-profile realm.\n He didn’t know when Whitney’s team would be called to another investigation; he just wanted every day with her that he could have. The team wasn’t in a hurry to leave—they still felt there was unfinished business at Blair House.\n One night, when he’d spent the afternoon next to Monty at the hospital, he headed over to Blair House in the early evening. Angela was preparing a roast. Jake’s fiancée was joining them at the house while they finished up in New York, and the two were musicians. He’d been invited for a Krewe of Hunters evening, and he was grateful that they considered him part of their in-crowd.\n When he arrived, he could see through the open gate that Whitney was standing in the front, looking perplexed.\n “What’s going on?” he asked her.\n She looked at him and smiled sheepishly.\n “One more time,” she told him.\n His heart thudded. “One more time?” he demanded.\n She smiled and moved against him, lifting her head and coming on her toes to give him a kiss. “One more time with picks and shovels!” she told him.\n He arched a brow.\n “The dog, Jude. I have to find the dog. The excavation team dug up an old metal tag. A dog tag. It had the name Rufus on it. I think—I know you saw Rufus, Jude. I know that you did. I have to find him. We’ve decided that, between us, and with a fund from city donations, we can actually bury the victims from the past—and Jane Doe dry, until we find out who she is.”\n “If we find out who she is.”\n “We may never,” Whitney agreed. “When we bury Annie Doherty, I want to bury Rufus with her.”\n “But you said they found his tag next door, at the excavation site.”\n “Right. I think Rufus tried to protect his mistress. I believe someone got a hold of him, but he escaped. He came back, and the owners cared for him, never understanding why he sat in the yard, staring at the House of Spiritualism, barking now and then, and trying to get someone to understand. Please, Jude, I know this is hard, but…”\n “Let’s dig,” he said.\n One by one, the others came out. Jude was silently glad to see that Jake Mallory’s fiancée was a sweet and beautiful young woman. He couldn’t help but see that Ashley and Jake were so close, and he had to admit that he had felt a twinge of jealousy now and then.\n But Ashley dug in with the rest of them, not at all surprised that they were going to search for the remains of a ghost dog.\n As Whitney had thought—though they did tear up the yard and make a mess of it—they found the remains of a dog. They were tenderly gathered, and wrapped, and set in a show box to await burial.\n It was a beautiful night; it was the first night he had really relaxed, it seemed, since he’d been called in when the body of Sarah Larson had been pulled from the river.\n He didn’t leave until morning. Whitney, groggy, golden and beautiful, reached out her arms to him when he was ready to go. He paused, returned to her side and kissed her. But she couldn’t coax him back into bed.\n “I’ll be back,” he promised her.\n At the animal shelter, the attendant told him that they didn’t have any full-blooded German shepherds at the moment.\n Jude smiled. “I don’t want a full-blooded shepherd. I want a mix. Something big and furry and lovable that enjoys people and needs a good home.”\n “Well, there’s Ruff,” the attendant told him.\n “Who?” Jude asked.\n “Ruff—that’s what they called him when he was found on the street, I guess. Anyway, it’s what we’ve been calling him here,” the attendant told him.\n “I’ll take Ruff,” Jude said.\n “You haven’t even seen him yet!”\n “I know I’m going to like him.”\n And he did. Ruff was a mixture of shepherd and something big—maybe a wolfhound, or deerhound. He wagged his tail wildly when he met Jude, whined softly and slipped his wet nose against Jude’s hand.\n He filled out all the paperwork, paid the fee and left a donation, and left the shelter with Ruff, a shiny new collar and tags, and a long leash. \n","sourceLink":"https://allnovel.net/sacred-evil-krewe-of-hunters-3/page-52.html","bookId":2277,"book":{"id":2277,"title":"Sacred Evil (Krewe of Hunters #3)","description":"Storyline: \n Sacred Evil (Krewe of Hunters #3) \n A terror born of Jack the Ripper \n The details of the crime scene are no coincidence. The body — a promising starlet — has been battered, bloodied and then discarded between two of Manhattan\u0027s oldest graveyards. \n One look and Detective Jude Crosby recognizes the tableau: \n A re-creation of Jack the Ripper\u0027s gruesome work. But he also sees something beyond the actions of a mere copycat. Something more dangerous…and unexplainable. \n As the city seethes with suspicion, Jude calls on Whitney Tremont, a member of the country\u0027s preeminent paranormal investigating team, to put the speculation to rest. Yet when Whitney and Jude delve deeper, what they discover is more shocking than either could have predicted, and twice as sinister...\n \n","cover":"https://allnovel.net/images/sacred-evil-krewe-of-hunters-3.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/sacred-evil-krewe-of-hunters-3.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:38:02 PM"}}
