{"id":69041,"no":22,"title":"Page 22","content":"All\u0027s well that ends well was written about 1602. Though it ends happily and is therefore technically a comedy, it lacks a carefree fun and happiness of the previous comedies. It is, indeed, rather an unpleasant play, like Troilus and Cressida (see page I-71), which was written shortly before.\n ... my son.. .\n The play opens with a group of people dressed in mourning onstage. The first to speak is the Countess of Rousillon, who has recently lost her husband (hence the mourning). She has fresh cause for sorrow, too, and says:\n In delivering my son from me\n I bury a second husband.\n - Act I, scene i, lines 1-2\n What\u0027s happening is that her son, Bertram, the young Count of Rousillon, is going to Paris to be brought up at the court of the King of France and his mother hates to part with him.\n Rousillon is treated in this play as part of France, and indeed (as Rous-sillon-the French use two s\u0027s), so it is-today. It is located just north of the Pyrenees at their eastern edge adjacent to the Mediterranean Sea. Its chief city is Perpignan.\n Through much of its history, however, it was not part of France. While the Pyrenees are the general boundary between France and Spain, Rousillon was, from 1172 on, part of the kingdom of Aragon (see page I-526), located just south of the mountains.\n It was not till 1450 that France was sufficiently united and sufficiently free of the English menace (see page II-562) to turn its attention to the spread of Spanish power across the mountain range. King Louis XI of France (see page II-651) sent expeditions southward and Rousillon became French in 1465. In 1493, however, Louis\u0027 son, Charles VIII, more interested in invading Italy, handed Rousillon back to Aragon to win Aragonese good will for his venture.\n By that time Aragon had formed a union with Castile, and modern Spain had taken shape. Spain was at the height of its power then and held on to Rousillon till 1659, at which time it became permanently French.\n Thus, when All\u0027s Well That Ends Well was written, Rousillon was Spanish, not French. Shakespeare obtained his plot from one of the tales in the Decameron by Boccaccio, which dealt with Beltram of Rossiglione. But the Decameron was published in 1353 and at that time Rossiglione (which, presumably, is Rousillon) was Aragonese, not French, and yet Boccaccio portrayed Beltram as a Frenchman.\n Not that it\u0027s important, of course, for as far as the play is concerned, Rousillon might have been any other name-an imaginary one, for that matter.\n ... the King ...\n An elderly lord, Lafew, reassures the Countess, saying:\n You shall find of the\n King a husband, madam; you, sir, a father,\n - Act I, scene i, lines 7-8\n It is useless to try to find out who the King of France is. No actual King of France unmistakably fits the events in the play, and he is not named either in this play or in the Decameron source.\n It turns out that the King is suffering from a lingering, chronic disease and that cure is despaired of. One medieval French king who did suffer from a lingering, chronic disease was Charles VI (see page II-464), who reigned from 1380 to 1422 and was mentally ill most of the time. There is no other comparison, however, and we might as well accept the fact that the King, as well as everything else in the play, is fictional.\n ... Gerard de Narbon\n The Countess regrets the death of a physician so skilled that he might surely have cured the King. She tells Lafew:\n He was famous sir, in his profession,\n and it was his great right to be so: Gerard de Narbon.\n - Act I, scene i, lines 28-29\n He was, in other words, of the city of Narbonne, and this, at least, fits well geographically. Narbonne is located some thirty miles north of Per-pignan.\n ... but Bertram\u0027s\n Gerard de Narbon has left behind a beautiful and virtuous daughter, who is in the Countess\u0027 care. When all leave the stage, she remains and says:\n ... my imagination Carries no favor in\u0027t\n but Bertram\u0027s. I am undone; there is\n no living, none, If Bertram be away...\n - Act I, scene i, lines 88-91\n This is the major complication of the play. Helena, the doctor\u0027s daughter, loves Bertram, the young Count of Rousillon, and therefore loves \"above her station.\" The doctor, however skilled, is of menial position, while Bertram is, of course, a nobleman.\n ... a notorious liar\n Helena\u0027s soliloquy is interrupted by the entrance of Parolles, Bertram\u0027s favorite companion. Parolles professes to be a fierce warrior, dresses and talks the part, but does not fool Helena. She says, aside:\n I love him [Parolles] for his [Bertram\u0027s] sake,\n And yet I know him a notorious liar,\n Think him a great way fool, solely a coward;\n - Act I, scene i, lines 105-7\n As a matter of fact, everyone who meets Parolles sees through him at once and knows him to be all talk (his very name is related to the French word for \"words\"). Only Bertram is deceived and takes him for genuine, which seems to be clear evidence that Bertram is rather a fool.\n Under Mars ...\n Helena and Parolles engage in conversation and when Helena refers to the star under which he was born, he replies, swaggeringly:\n Under Mars, ay.\n - Act I, scene i, line 199\n He claims in this way to have an inborn martial personality (see page I-404). Helena says, dryly, however:\n When he [Mars] wax retrograde...\n - Act I, scene i, line 203\n Mars\u0027 path across the sky is generally from west to east against the background of the stars. Periodically, however, it changes direction and moves from east to west. It is then moving backward or \"retrograde.\" The ancient Greeks labored to account for such retrograde motion but it wasn\u0027t till Copernicus elaborated the heliocentric view with the sun at the center of the solar system that the situation was made clear. Periodically, the earth in its orbit overtakes Mars and it is then that the planet seems to move backward.\n Helena, by use of the term, indicates that if Parolles is born under Mars, he nevertheless moves backward and retreats hastily in battle.\n The Florentines and Senoys. ..\n The second scene opens in the King\u0027s palace in Paris. The King is involved in statecraft, saying:\n The Florentines and Senoys are by th\u0027ears,\n Have fought with equal fortune, and continue\n A braving war.\n - Act I, scene ii, lines 1-3\n Florence was the great city of the Italian Renaissance (see page I-448) and the \"Senoys\" are natives of Siena, a city about thirty miles south of Florence. For centuries Siena and Florence were rivals, and down nearly to Boccaccio\u0027s time, the fight remained fairly equal.\n Siena, however, was already declining when the Decameron was written and it came more and more under the Florentine shadow. In 1557 Florence finally gained political control of Siena and the latter\u0027s history as an independent city-state came to an end.\n ... our cousin Austria\n The King goes on to say:\n We here receive it\n A certainty, vouched from our cousin Austria,\n With caution, that the Florentine will move us\n For speedy aid; wherein our dearest friend\n Prejudicates the business, and would seem\n To have us make denial.\n - Act II, scene i, lines 4-9\n Again there is no use in searching history for any specific event that would mirror this.\n In the sixteenth century there was a great rivalry between Francis I of France and the Emperor Charles V (see page II-747), the core of whose dominions within the Empire was Austria. Francis and Charles fought over Italy all through their reigns, with Charles having the better of it most of the time.\n With this in mind, we can perhaps interpret the King\u0027s speech in terms of practical politics as follows. Austria has warned France that if she interferes in Italy and supports Florence, Austria will come to the aid of Siena in order to preserve the balance of power. France then adopts the prudent path of neutrality.\n The Tuscan service. ..\n Yet if France cannot openly intervene, there is another method open to her. She can send \"volunteers\" (a device known to and used by nations in our own times). The King says:\n Yet, for our gentlemen that mean to see\n The Tuscan service, freely have they leave\n To stand on either part.\n - Act II, scene i, lines 12-14\n The region in which Florence and Siena are located was known as Etruria in ancient tunes, and was inhabited by the Etruscans. The regional name was distorted to Tuscany (Toscana in Italian) in the Middle Ages.\n Through the Middle Ages Tuscany did not form a separate and united political entity but was broken up among several city-states, of which Florence, Pisa, and Siena were the most important. In 1557, however, with the absorption of Siena, Florence came to be in control of the entire region. Cosimo I, Duke of Florence, was awarded the higher title of Grand Duke of Tuscany in 1569 by Pope Pius V. In Shakespeare\u0027s time, then, Tuscany was on the map.\n ... King Pippen...\n And while the court is involved with the Tuscan wars, Helena arrives.\n She hopes to cure the King with some of her dead father\u0027s remedies and she also hopes to see Bertram. She carries with her the best wishes of the old Countess, who loves the girl and doesn\u0027t seem to be disturbed by the thought of a mesalliance.\n Lafew is at court to introduce Helena. He asks the King if he wants to be cured, but the King has so often been disappointed that he has given up and answers, crossly, in the negative. Lafew says:\n O, will you eat No grapes, my royal fox?\n - Act II, scene i, lines 71-72\n The reference is, of course, to Aesop\u0027s famous fable of the fox who could not reach the grapes and who consoled himself with the thought that he did not want them anyway, since they were probably sour.\n Lafew assures the King that he can indeed get the grapes and that there is indeed a cure. He describes the cure as something\n ... whose simple touch\n Is powerful to araise King Pippen, nay,\n To give great Charlemain a pen in\u0027s hand,\n And write to her a love-line.\n - Act II, scene i, lines 77-80\n It can raise, in Lafew\u0027s hyperbole, the long dead Charlemagne, and his father Pepin (Pippen) the Short (see page II-455).\n Lafew then brings in Helena and leaves her with the King, saying as he himself departs:\n 1 am Cressid\u0027s uncle,\n That dare leave two together.\n - Act II, scene i, lines 99-100\n Cressid\u0027s uncle was Pandarus, who served as go-between for her and Troilus (see page I-79) and was thus the original pander. Lafew\u0027s \"pandering\" is, of course, of quite another kind.\n Moist Hesperus...\n Helena promises the King a quick recovery. In fact, he will be well\n Ere twice in murk and occidental damp\n Moist Hesperus hath quenched her sleepy lamp,\n - Act II, scene i, lines 165-66\n Hesperus (see page I-187) is the evening star. It sets in the western ocean (hence \"occidental damp\" and \"moist\") and it sets up to three hours after the sun, so that her light is a \"sleepy lamp.\"\n ... Galen and Paracelsus\n The medicine works precisely as Helena had promised and the King is quickly made well. All, even Lafew, are astonished, since all the other physicians had been utterly helpless. Even the worthless Parolles agrees, saying:\n So 1 say-both of Galen and Paracelsus.\n - Act II, scene iii, line 11\n Galen was a Greek physician who settled in Rome in 164. He wrote many books on medicine, which were excellent for their time. They survived the fall of ancient civilization and were considered the last word on the subject throughout the Middle Ages.\n The first physician to argue strenuously against blind acceptance of Galen and in favor of a new regime of mineral medicines as opposed to the old use of herbs was Theophrastus von Hohenheim, better known by his self-adopted nickname of Paracelsus. He lived from 1493 to 1541 and from Shakespeare\u0027s point of view would have been a \"modern\" physician.\n What Parolles is saying, then, is that the King had been given up by all physicians of both the old school and the new.\n ... Saint Jaques\u0027 pilgrim ...\n The King is naturally grateful to Helena and offers her, as a reward, marriage with any of the noblemen at court. She chooses Bertram, who starts back in revulsion and horror at the thought of marrying a lowborn girl.\n The King insists, however, and Bertram is forced into marriage. As soon as that is done, however, the young man determines to make it a dead letter. He orders Helena back to Rousillon without taking her to bed or even kissing her.\n She goes submissively, and when she arrives, she has only a letter to show Bertram\u0027s mother, the Countess. He says he is off to the Tuscan wars and will never return as long as he is burdened with a wife he cannot accept. Nor will he ever accept her until she can produce his ring, which he will not give her, and show him a child begotten by him, for which he will give her no opportunity.\n The old Countess is horrified. She is all on Helena\u0027s side, as is everyone else in the play (and in the audience) except for Parolles and, of course, Bertram himself.\n But Helena begins to put into action a plan of her own. She departs from Rousillon in secret, leaving behind a letter that starts:\n I am Saint Jaques\u0027 pilgrim, thither gone.\n - Act III, scene iv, line 4\n St. Jaques is James the Apostle, the son of Zebedee. According to a tradition which has no biblical backing whatever, he visited Spain and preached the gospel there. As a result, he is accepted now as the patron saint of Spain. He must, however, have returned to Judea, for the Bible records his death there at the order of Herod Agrippa I (Acts 12:1-2).\n Tradition then takes over again and has his dead body miraculously whisked to Spain, where it finally came to rest in a shrine at Compostela, a city in the northwestern corner of Spain, about six hundred miles west of Perpignan. If Helena goes there she is traveling in the direction opposite to that Bertram has taken. She is going west into farthest Spain, he east to Tuscany.\n \"James\" is the English version of a Hebrew name of which \"Jacob\" is the Old Testament version. In Spanish it is Iago, and St. James is Santiago. The city in which the bones were thought to rest is Santiago de Compostela.\n ... his despiteful Juno ...\n Helena asks the Countess to write and tell Bertram she is gone so that he can come safely home from the wars. She scolds herself, saying:\n His taken [undertaken] labors bid him [Bertram] me forgive;\n I, his despiteful Juno, sent him forth\n From courtly friends with camping foes to live,\n - Act III, scene iv, lines 12-14\n Hercules, who was Jupiter\u0027s son by a mortal woman, naturally incurred the wrath of Juno (Hera), who was Jupiter\u0027s lawful wife. It was her enmity that visited him with periodic bouts of madness and condemned him to perform twelve labors for an unworthy cousin. Analogously, Helena considers the mere fact of her own existence to be condemning Bertram to warlike labors.\n ... the palmers ...\n As a matter of fact, though, Helena is not quite as unselfish as she is presenting herself to be. She does not go to the shrine at all but sneaks off to Florence in disguise as a pilgrim, hoping that she may yet win her reluctant husband. There she stops to ask:\n Where do the palmers lodge, I do beseech you?\n - Act III, scene v, line 35\n A pilgrim who had visited the Holy Land was privileged to wear palm leaves as a token he had done so (it is a plant native to Palestine) and was therefore called a \"palmer.\"\n Helena asks the question of an old Widow, who offers her lodgings. The Widow has a beautiful and virtuous daughter, Diana, and it quickly turns out that Bertram (who is doing very well in Florence and is now a cavalry officer) is busily engaged in trying to seduce the girl.\n Helena reveals her identity and persuades the two women to let her take Diana\u0027s place so that Bertram will sleep with her unknowingly, thinking she is Diana.\n Diana agrees and cajoles Bertram into giving her his ring (the one he wrote in his letter that Helena would have to display before he would accept her as wife) and offers him an assignation provided he promises to stay only an hour and to refrain from speaking to her during that time. She promises to give him another ring in exchange for his after he has slept with her. So eager is he to win her that he agrees.\n Helena then arranges to have herself reported as having reached Santiago de Compostela and to have died there.\n ... he parallels Nessus\n Parolles, meanwhile, has won the contempt of all the officers, and they scheme to maneuver him into betraying his real character. Parolles has been sent out on a dangerous mission for which, out of sheer stupid braggadocio, he has volunteered. He is captured by his own colleagues and is blindfolded.\n Pretending to be foreigners of strange speech, they question him through a mock interpreter. At the merest hint of torture, he tells everything he knows and reviles the very men who (unknown to him) are holding him prisoner. He even defames Bertram.\n Thus, of one officer, he says:\n ... for rapes and ravishments he parallels Nessus.\n - Act IV, scene iii, line 264\n Nessus was the centaur who tried to rape Hercules\u0027 wife, Deianeira (see page I-380).\n When he has completely unmasked himself for the coward he is, his blindfold is removed and he realizes that he is ruined. He decides to make the best of it, however, and later, in fact, he enters the service of the kindly Lafew and does well enough.\n ... at Marseilles. ..\n With Helena\u0027s reported death, Bertram can return to Rousillon, but first he wants to go through with the seduction of Diana. This takes place offstage, but we gather that Helena has safely substituted herself. Bertram has kept the bargain, stayed an hour, refrained from speaking, and accepted the ring (Helena\u0027s ring, which she, in turn, had received from the King of France). And Helena has the ring Bertram gave Diana.\n Helena is therefore also ready to return, taking the Widow and Diana with her. She intends to see the King and says to her companions:\n / duly am informed\n His Grace is at Marseilles, to which place\n We have convenient convoy.\n - Act IV, scene iv, lines 8-10\n Marseilles is the great French port on the Mediterranean, about 280 miles west of Florence and 140 miles northeast of Roussillon. If Helena goes to Marseilles, she is two thirds of the way home.\n She is counting on the King\u0027s continuing gratitude, for she says her services were such that\n ... gratitude\n Through flinty Tartar\u0027s bosom would peep forth,\n And answer thanks\n - Act IV, scene iv, lines 6-8\n In the thirteenth century Mongol tribes from central Asia swept westward and penetrated deep into Europe, reaching almost to the Adriatic in 1240. This gave Europe a scare from which it didn\u0027t recover for a long time.\n The Mongols called themselves Tatars, but to the Europeans this became Tartars (from Tartarus, see page I-40). The Tatars, considered as creatures from hell, were naturally considered the epitome of heartlessness, and Helena felt that even they would feel gratitude for services such as hers.\n All\u0027s well that ends well. ..\n Helena has gone through a great deal and there is more yet to go through, but she keeps up her spirits with a stouthearted:\n All\u0027s well that ends well; still the fine\u0027s the crown.\n - Act IV, scene iv, line 35\n The word \"fine,\" from the French fin, means \"end\" here. Helena is saying that the nature of the end crowns the work, making it success or failure. This so summarizes the play-which, from Helena\u0027s point of view, is nothing but misery all the way to very nearly the end-that it has become the title of the play.\n Yet is it possible the play once had a different title?\n An English clergyman, Francis Meres, wrote a book in 1598 in which he compared contemporary English authors with classical and Italian ones, and, in the process, he listed Shakespeare\u0027s plays. He included one named Love\u0027s Labor\u0027s Won. This is the only play ever attributed to Shakespeare that we have no record of under the title mentioned. Either it\u0027s a lost play or we have it under a different title.\n If the latter, it must be one that isn\u0027t mentioned by Meres under its own title and one that had already been written by 1598. One possibility is The Taming of the Shrew, in which Petruchio must labor hard indeed to establish love between himself and Katherina (see page I-462). There is, however, a reference in a 1603 account book to both The Taming of the Shrew and Love\u0027s Labor\u0027s Won.\n The most popular theory, therefore, is that it refers to All\u0027s Well That Ends Well and to Helena\u0027s hard labor to win Bertram. But, alas, that means that the play would have had to be written several years before it was.\n It\u0027s a problem that may never be solved completely, but I would like to suggest a possibility I have not seen advanced. Shakespeare may perhaps have written Love\u0027s Labor\u0027s Won in, say, 1597, and because it was a failure, rewrote it extensively and produced it as All\u0027s Well That Ends Well, with no record of the earlier version except for the casual mention of Meres, writing between the two.\n ... no great Nebuchadnezzar ...\n There is an interval before the resolution in the last act in which the Countess has the last of several confrontations with a Clown. None of these serves to advance the plot, but each is intended as comic relief. In this last, the Clown mentions \"grace\" and promptly expands it into wordplay by saying to Lafew:\n / am no great Nebuchadnezzar, sir;\n 1 have not much skill in grace.\n - Act IV, scene v, lines 21-22\n This equates \"grace\" and \"grass,\" and Nebuchadnezzar is brought in because according to the biblical account (Daniel 4:28-37) he was punished for his arrogance by being stricken with a madness that drove him out into the fields and caused him to eat grass for seven years.\n The Black Prince...\n The Clown also refers to the devil as having an English name, for he is\n The Black Prince, sir,\n alias the prince of darkness, alias the devil.\n - Act IV, scene v, lines 43-44\n It is quite appropriate to speak of the devil as the \"prince of darkness,\" for our modern conception of the devil comes, in part, from the Persian notion of a dualistic cosmic order in which the forces of light and good under Ahura Mazda fight a continuing giant battle against the forces of darkness and evil under Ahriman.\n And a prince of darkness would naturally be a Black Prince like the famous eldest son of Edward III (see page II-260).\n Plutus himself ...\n Bertram has now come back to Rousillon. When Helena reaches Marseilles, she finds that the King has gone to Rousillon and she follows. All are now converging on Rousillon for the climax.\n Bertram is generally blamed by all for his treatment of Helena, but since Helena is dead, the slate is washed clean and preparations are made for a second marriage, to none other than Lafew\u0027s daughter.\n A token must be given to the new bride and Bertram hands over the ring which he had (as he thought) obtained from Diana. It is really Helena\u0027s ring, however, which she obtained from the King; and the King recognizes it. Despite Bertram\u0027s denial, the King is firm in that recognition, saying:\n Plutus himself\n That knows the tinct and multiplying med\u0027cine,\n Hath not in nature\u0027s mystery more science [knowledge]\n Than I have in this ring. \u0027Twas mine, \u0027twas Helen\u0027s,\n - Act V, scene iii, lines 101-4\n Plutus was the god of wealth, and was equated with gold in particular. It was believed in medieval times that there was some substance which could be used to turn less valuable metals into gold and this was called \"the philosopher\u0027s stone.\" This same substance could also cure any disease and was \"the elixir of life.\" Though medieval alchemists never found this substance, they were sure it existed in the earth, else how was the gold in its bowels formed?\n Plutus, therefore, can be spoken of as knowing the medicine (a reference to the elixir of life) that produces gold, so that it was a \"multiplying med\u0027cine\" because it multiplies the earth\u0027s store of gold.\n ... ever, ever dearly\n The King begins to suspect that Bertram got the ring by foul play, that Helena was murdered. Bertram is arrested and suddenly Diana enters, claiming Bertram as her husband.\n Desperately, Bertram tries to blacken Diana as a camp follower of the army in Tuscany, and the growing confusion is only straightened out when Helena appears, alive after all.\n She shows Bertram\u0027s ring, and refers to the fact that she is now pregnant with Bertram\u0027s child. She has fulfilled Bertram\u0027s conditions and he must now accept her as his wife. Bertram cries out to the King:\n If she, my liege, can make me know this clearly,\n I\u0027ll love her dearly, ever, ever dearly.\n - Act V, scene Hi, lines 315-16\n Those are his last words in the play, and all\u0027s well that ends well. \n","sourceLink":"https://allnovel.net/asimov-s-guide-to-shakespeare/page-22.html","bookId":1731,"book":{"id":1731,"title":"Asimov\u0027s Guide to Shakespeare","description":"Storyline: \n Asimov\u0027s Guide to Shakespeare, by Isaac Asimov, vols I and II (1970), ISBN 0-517-26825-6; Maps by the artist Rafael Palacios. This work gives a short guide to every Shakespeare play, and also his two epic poems. Asimov organizes the plays as follows: Greek Roman Italian The English Plays The last two categories are treated broadly; \u0027Italian\u0027 applies to neighbouring countries, and both Hamlet and Macbeth are listed with \u0027The English Plays\u0027. Asimov gives a detailed justification for doing this. Within each category, the plays are arranged chronologically, making allowance for the several not based on actual events. Asimov notes how much is real history, and describes who the original people were, where applicable. He traces those characters who appear in more than one play, and provides maps to explain key geographical elements.\n \n","cover":"https://allnovel.net/images/asimov-s-guide-to-shakespeare.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/asimov-s-guide-to-shakespeare.html","creation":"Oct 5, 2019 8:57:54 AM","modification":"Oct 5, 2019 10:11:37 AM"}}
