{"id":33135,"no":1,"title":"FOREWARD","content":"I didn’t write a foreword to the original edition of A BriefHistory of Time. That was done by Carl Sagan. Instead, Iwrote a short piece titled “Acknowledgments” in which I wasadvised to thank everyone. Some of the foundations that hadgiven me support weren’t too pleased to have been mentioned,however, because it led to a great increase in applications. \n I don’t think anyone, my publishers, my agent, or myself,expected the book to do anything like as well as it did. It wasin the London Sunday Times best-seller list for 237 weeks,longer than any other book (apparently, the Bible andShakespeare aren’t counted). It has been translated intosomething like forty languages and has sold about one copy forevery 750 men, women, and children in the world. As NathanMyhrvold of Microsoft (a former post-doc of mine) remarked: Ihave sold more books on physics than Madonna has on sex. \n The success of A Brief History indicates that there iswidespread interest in the big questions like: Where did wecome from? And why is the universe the way it is? \n I have taken the opportunity to update the book and includenew theoretical and observational results obtained since thebook was first published (on April Fools’ Day, 1988). I haveincluded a new chapter on wormholes and time travel. \n Einstein’s General Theory of Relativity seems to offer thepossibility that we could create and maintain wormholes, littletubes that connect different regions of space-time. If so, wemight be able to use them for rapid travel around the galaxyor travel back in time. Of course, we have not seen anyonefrom the future (or have we?) but I discuss a possibleexplanation for this. \n I also describe the progress that has been made recently infinding “dualities” or correspondences between apparentlydifferent theories of physics. These correspondences are astrong indication that there is a complete unified theory ofphysics, but they also suggest that it may not be possible toexpress this theory in a single fundamental formulation. Instead,we may have to use different reflections of the underlyingtheory in different situations. It might be like our being unableto represent the surface of the earth on a single map andhaving to use different maps in different regions. This would bea revolution in our view of the unification of the laws ofscience but it would not change the most important point: thatthe universe is governed by a set of rational laws that we candiscover and understand. \n On the observational side, by far the most importantdevelopment has been the measurement of fluctuations in thecosmic microwave background radiation by COBE (the CosmicBackground Explorer satellite) and other collaborations. Thesefluctuations are the finger-prints of creation, tiny initialirregularities in the otherwise smooth and uniform earlyuniverse that later grew into galaxies, stars, and all thestructures we see around us. Their form agrees with thepredictions of the proposal that the universe has no boundariesor edges in the imaginary time direction; but furtherobservations will be necessary to distinguish this proposal fromother possible explanations for the fluctuations in thebackground. However, within a few years we should knowwhether we can believe that we live in a universe that iscompletely self-contained and without beginning or end. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1837/53207.html","bookId":1003,"book":{"id":1003,"title":"A Brief History of Time 时间简史","description":"简介： 在这部书中，霍金带领读者遨游外层空间奇异领域，对遥远星系、黑洞、夸克、带味粒子和自旋粒子、反物质、时间箭头等进行了深入浅出的介绍，并对宇宙是什么样的、空间和时间以及相对论等古老问题做了阐述，使读者初步了解狭义相对论以及时间、宇宙的起源等宇宙学的奥妙。...","cover":"http://novel.tingroom.com/file/upload/201707/18/10-47-28-19-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1837","creation":"Aug 1, 2019 12:24:08 AM","modification":"Aug 1, 2019 12:24:08 AM"}}
