{"id":81176,"no":10,"title":"Page 10","content":"WASN\u0027T A CURSE WORD STRONG ENOUGH to accurately express her dismay. Claire instantly dropped the useless weapon and ran, dodging to the right, not wanting to end up trapped in the corner, unable to believe that she hadn\u0027t thought to check the goddamn weapon. There were six or seven crates stacked against the wall near the cockpit door but no cover there, on ei-ther side; the thing would have her penned in.\\n\\n Go go go!\\n\\n As she scurried along the right wall, the lumbering creature slowly turning to follow, she grabbed the semi from under her belt and flicked the safety off by feel, afraid to look away from it. It stumped toward her on tree trunk legs, eerily focused on her every step. The cargo hold wasn\u0027t all that big, maybe thirty-five feet long and twelve wide. Too soon, she was at the rear of the plane, icy air suddenly pulling at her, working to suck her out into the clouds. Crouching, trying not to think about a misstep, Claire darted across the open space and reached the other wall, grabbing at a raised ridge of metal with trembling fingers. The creature was still almost twenty feet away. Claire held onto the wall, waiting for it to draw closer before running again. At least it was slow, there was that much, but she had to come up with something, she couldn\u0027t keep going around in circles. She was watching the creature, could see it clearly...... but what happened next was like some optical illusion. It dropped its silvery head slightly -\\n\\n - and was suddenly five feet away, the distance closed in a fraction of a second, and it was bringing its right arm down, parting the air with an audible whoosh, knives flashing... Claire didn\u0027t think, she moved, her stomach suddenly in her throat, her own action a blur to herself. For a split second she was only a body, ducking and sprinting...... and then she was on the other side of the plane, all the way up by the stacked crates, looking back as the crea - ture slowly, slowly turned. Aw, shit on this! The plane would survive a few holes. She opened fire, sent eight 9mm rounds in a tight group - ing right at the center of its chest - and all of them hit. She saw the black-rimmed holes open up near where its heart would be if it was human, no blood but moist, dark tissue was exposed, forming spongy lumps around the wounds. The creature stopped in its tracks - and started again in about two seconds, one slow step after another, its focus unchanged. A stab of panic hit her, gotta get out of here it\u0027s going to kill me, get Steve, another gun maybe...\\n\\n No, she couldn\u0027t, and it wouldn\u0027t help, it would only make things worse. Mr. X had been programmed for a single purpose, to obtain a virus sample; she suspected that this creature was after her specifically, and if she left the hold, the creature would just tear through the hatch, killing her and Steve. At least this way, he might have a chance. And 9mm was the heaviest firepower on board - if it could take eight rounds in the chest, another gun wasn\u0027t going to make a difference. Try for a head shot, like the one-armed monster. She could try, but she had the feeling that something that didn\u0027t bleed probably wouldn\u0027t go blind, either. Its eyes were strange, perhaps they weren\u0027t even used for sight... and there was also the fact that they were on a moving plane, one that shook and wavered; without a scope, how was she supposed to target, let alone hit? All that passed through her mind in about a second and then she was moving again, edging toward the back of the plane once more - afraid to run, afraid to stand still, wondering how long she had before it ran at her again and what she would do then...... and it lowered its head like it had done before, and again, Claire\u0027s body reacted, but an idea was forming, too. She pushed away from the wall and ran toward it, angling her path, if this doesn\u0027t work I\u0027m dead...... and she felt the chill of its strange flesh as it rock-eted past her, was so close that she could smell its rotten meat smell - and then they were on opposite ends of the open space and it was slowly, mechanically turning around. It had worked, but barely; if it had been an inch closer, if she\u0027d been a half step slower, it would already be over. Guns didn\u0027t work, she couldn\u0027t leave, so the creature had to go, but how? The air stream at the hold\u0027s open end was strong, but if she could duck past it, no way it would nab the weighty monstrosity... she had to knock it off-balance, maybe bait it to the opening and trip it up somehow, she wasn\u0027t strong enough to push it... Think, damnit! It was starting toward her again, one step, two. She looked away long enough to scan the floor near the opening, looking for something it might stumble over, maybe the hydraulic track...\\n\\n The hydraulic track.\\n\\n Used to push heavy crates to the rear of the plane, to be unloaded. In fact, two of the empty crates were sit - ting on the metal platform at the start of the track, just a few steps from the door to the cockpit. The controls were set into the outer wall, right in front of the door. Too slow, there\u0027s no way. Except it was slow because it carried a heavy load; if there was only an empty con - tainer or two on the platform, how fast would it go then? She had to get to the controls, had to see... There was a blur of movement, and then the spiked mace was coining around, ripping toward the side of her head. Claire jumped forward, instinctively sidestepped, but not quite fast enough. The spikes didn\u0027t get her but its powerful forearm did, bashing painfully into her ear, knocking her off her feet. Instantly, the creature crouched and brought its right arm down, but she was already in motion, rolling the sec - ond she hit the floor. The hand blades hit the deck and sparks flew, the creature howling in rage as Claire sprang to her feet, trying not to notice her throbbing ear or the tiny black dots that swarmed at the edges of her vision. She ran for the hydraulic controls instead, as the creature rose to its feet, its movements mechanical again, as emo - tionless as it had been furious only seconds before. A few running steps and she was looking down at a simple control panel, power switch, a dial for entering approximate weight, buttons for back and forth, a tiny readout screen, an emergency shutoff. Claire hit the power switch, twisting the weight dial to the maximum limit, just under three tons. She shot a look at the creature, still at a safe distance, and saw that it was only a step or two from being in the direct path of the platform. Her hand hovered over the blue switch that would move it forward, that should send it bulleting down the hold at an incredible speed. With only a few pounds of empty container where three tons was expected, it would mow the creature down like a blade of grass.\\n\\n Almost... almost... now!\\n\\n When the creature was standing almost directly on the track, Claire punched the button - and nothing hap-pened, nothing at all. Shit! She fumbled for the power switch again, maybe she hadn\u0027t turned it on - and she saw what was on the little readout screen, and groaned aloud. The simple in - structions read, \"Charging for load - wait for tone.\"\\n\\n Good God, how long will that be?\\n\\n The creature was still twenty feet away, walking al - most directly along the track. She might not get a better shot at it, because another blow could very well mean her death, but if she stayed where she was and the crea - ture got to her before the platform was charged, she\u0027d be trapped between the wall and the storage crates. It would bludgeon her into pulp against the cockpit door.\\n\\n Better to run for it Better to stay put.\\n\\n Claire hesitated a touch too long, and the creature was in motion again. It swept toward her like a natural disas - ter and it was too late, not even tune to turn around and flee into the cockpit...\\n\\n ... and it brought its spiked left hand down just as Claire slammed the switch, her eyes squeezed closed, sure that the world was about to disappear in a blizzard of pain...... as the creature shot away from her, roaring, the empty crates lifting it off its feet, powering it away. Be - fore she could begin to accept that the plan was work-ing, the creature used one of its incredible bursts of speed and got in front of the barreling container, just enough to get some leverage, to push against it -\\n\\n - but Claire didn\u0027t wait to see which force was greater. She opened fire again, two, three bullets hitting it in the head, bouncing harmlessly off its armored skull, but distracting it, too. The creature struggled an-other half second and then it and the two crates were gone, plunging into the dusky sky. Claire stared out at the passing stream of atmosphere for a time, knowing she should feel limp with relief, that she\u0027d killed the monster, that she\u0027d survived another Umbrella disaster, that they were finally, finally safe... but she was simply wrung out, any possibility for strong emotion having flown out the back along with Mr. X\u0027s big brother. \"Please, let it be over,\" she said softly, and then turned and opened the door back into the cockpit. As she hopped the two steps up to the pilot area, Steve glanced back her, frowning. \"What happened? Is everything okay?\"\\n\\n Claire nodded, flopping down in the seat next to him, absolutely beat. \"Yeah. Score one more for the good guys. Oh, the rear cargo hatch is gone.\"Are you kidding?\" Steve asked. \"Nope,\" Claire said, and yawned widely, suddenlyoverwhelmed with fatigue. \"Hey, I\u0027m going to rest my eyes for a minute. If I fall asleep, wake me up in five, okay?\"Sure,\" Steve said, still looking confused. \"The hatch is gone?\"\\n\\n Claire didn\u0027t answer him, the dark already rushing up to claim her, her body melting into the seat...... and then Steve was shaking her, repeating her name over and over again.\\n\\n \"Claire! Claire!\" \"Yeah,\" she mumbled, sure she hadn\u0027t slept as she cracked her eyes open, wondering why Steve would want to torture her like this - until she saw his expres-sion, and a bolt of alarm jolted her awake. \"What, what is it?\" she asked, sitting up straight. Steve looked really worried. \"Like a minute ago, we changed direction and then the controls suddenly locked down,\" he said. \"I don\u0027t know what it is, there\u0027s no radio but everything else is still working fine - except I can\u0027t steer, or alter altitude or speed. It\u0027s like it\u0027s stuck on autopilot.\"\\n\\n Before she could say a word, there was a crackling static sound from a small video monitor mounted close to the ceiling of the cockpit, one Claire hadn\u0027t noticed be - fore. Flickering distortion lines spread out across the screen, but the picture, when it came in, was clear enough.\\n\\n Alfred!\\n\\n He was also flying, it seemed, belted into the front seat of a two-man fighter jet, or something similar. He still had smears of makeup on his face, his eyes rimmed in black, and when he spoke, it was in Alexia\u0027s voice. \"My apologies,\" he purred, \"but I can\u0027t let you escape now. It seems you\u0027ve eluded another of my playthings -\\n\\n - naughty, naughty.\" \"Cross-dressing freak,\" Steve snapped, but Alfred ei-ther didn\u0027t hear him or didn\u0027t care. \"Enjoy the ride,\" Alfred said, giggling, and with a final buzz of static, the screen went blank. Claire stared at Steve, who stared back helplessly, and then they both looked out over the sea of clouds, watch - ing silently as the first shafts of sunlight broke through. Steve was dreaming about his father when he started awake suddenly, afraid for some reason, the dream slip - ping away even as he remembered where he was. Claire made a soft, sleepy sound in the back of her throat and nuzzled closer, her head against his left shoulder, her breath warm against his chest. Oh, Steve thought, afraid to move, not wanting to wake her up. They\u0027d fallen asleep side-by-side leaning against the cockpit wall, and had apparently moved closer together at some point. He had no idea what time it was, or how long they\u0027d slept, but they were still in the air, muted sunlight still coming in through the windows. They\u0027d talked for a while after Alfred had taken con - trol of the plane, but not about what they were going to do at the end of their hijacked ride. Claire had remarked that since they couldn\u0027t do anything about it, there was no point in worrying. Instead, they\u0027d eaten - Claire had nabbed a few packs of vending machine nuts, for which Steve would be eternally grateful - and done their best to wash up using a little of the bottled water, and then talked. Really talked. She\u0027d told him about going to Raccoon City to find Chris, and everything that had happened there and what she knew about Umbrella and Trent the spy-guy... and she\u0027d told him a lot of other stuff, too. She was in col - lege, and two years older than him, and she rode a mo - torcycle but was probably going to give it up because of how dangerous it was. She liked to dance so she liked dance music, but she also liked grange, and she thought politics were mostly boring, and cheeseburgers were her favorite food. She was totally, incredibly cool, the coolest girl he\u0027d ever met - and even better, she\u0027d actu - ally been interested in what he had to say. She\u0027d laughed at a lot of his jokes, and thought it was cool that he ran track, and when he\u0027d talked some about his parents, she\u0027d listened without getting all pushy.\\n\\n And she\u0027s so smart, and beautiful...\\n\\n He looked down at her, at her tousled hair and long lashes, his heart pounding even though he was trying to relax. She moved again, shifting in her sleep, her head tilting back a little and her slightly parted lips were suddenly close enough for him to kiss, all he had to do was tip his face down a few inches, and he wanted to so bad that he actually started to do it, lowering his mouth toward hers... \"Mmmm,\" she murmured, still totally asleep, and he stopped, pulling back, his heart beating even faster. He totally wanted to but not like that, not if she didn\u0027t want him to. He thought she did, but she\u0027d also told him a lit - tle about her friend Leon, too, and he wasn\u0027t so sure that they were just friends. Feeling tortured, having her so close but not his, he was relieved when she rolled away from him a few sec - onds later. He stood up, stretching stiff legs, and walked to the front of the plane, wondering if the reserve fuel tank had been tapped yet, the thought of dealing with that crazy Ashford asshole once again drying up the last of his positive feelings. He hoped that Claire would sleep awhile longer, she\u0027d been so tired...... until he saw what was outside, and read the head-ing, and realized that their altitude had dropped consid - erably. The plane was starting to pitch some, bucking, and no wonder. On the map reader next to the compass was an approximate latitude-longitude for their posi - tion.\\n\\n \"Claire, wake up! You gotta come see this!\"\\n\\n A few seconds later she was at his side, rubbing her eyes - which widened considerably when she looked out the window. There was a near blizzard of ice and\\n\\n snow pounding down, extending as far as they could see. \"We\u0027re over the Antarctic,\" Steve said. \"As in the South Pole?\" Claire asked, incredulous. She grabbed the back of the copilot seat as the plane roller-coastered. \"Penguins and killer whales, all that?\"I don\u0027t know about the wildlife, but we\u0027re at a lati-tude of 82.17 South,\" Steve said. \"Definitely the bottom of the world. And I\u0027m not positive, but I think we\u0027re coming in for a landing. We\u0027re slowing down, anyway.\"\\n\\n Maybe Alfred\u0027s plan was to drop them in the middle of nowhere and let them freeze to death. Not flashy, but it would certainly do the trick. Steve wished he could get his bare hands on the guy for just a minute, just one. He wasn\u0027t much of a fighter, but Alfred would melt like a cream puff. \"We must be headed for that,\" Claire said, pointing right, and Steve squinted, barely able to see through the storm... and then he saw the other planes, and the long, low buildings that she had spotted, only a few minutes away. \"You think it\u0027s one of Umbrella\u0027s?\" Steve asked, knowing before she nodded that it had to be. Where else? The plane\u0027s nose continued to dip down, carrying them to whatever Alfred had in mind, but Steve was ac - tually a little relieved. Meeting up with Umbrella again sucked, of course, but at least someone else would be in charge, and not every Umbrella employee was as shrink-wrapped as Alfred. He couldn\u0027t imagine that everyone would drop what they were doing to kiss Al - fred\u0027s ass, either. Maybe he and Claire could find some - one to bargain with, or bribe somehow... They were closing in for a first pass, the ride getting squirrelly, the wings probably heavy with ice - when Steve realized that they were way too low, too low and too fast. The landing gear had dropped at some point, but there was no way they could land at their speed and altitude. \"Pull up, pull up...\" Steve said, watching the build-ings get big too quickly, feeling prickles of sweat break - ing out all over. He slid into the pilot\u0027s chair, grabbing the yoke and pulling back - and nothing happened.\\n\\n Oh, man. \"Belt up, we\u0027re going to crash!\" Steve shouted, grab-bing for his own belt as Claire jumped into her seat, the buckles snapping shut just as they touched down and alarms started shrieking as the landing gear crumpled and tore away, the plane\u0027s belly slamming into the ground. The cabin bounced wildly, the seat belts the only thing keeping them from hitting the roof. Claire let out a yelp as a wave of snow crashed into the wind - shield, and there was a giant metal SCREECH behind them as the tail or a wing ripped away - -and enough of the churning snow pack fell away from the glass for them to see the building in front of them, the out of control plane sliding for it, smoke com-ing from somewhere, they were going to hit and... \\n\\n","sourceLink":"https://allnovel.net/code-veronica-resident-evil-6/page-10.html","bookId":2461,"book":{"id":2461,"title":"Code: Veronica (Resident Evil #6)","description":"Storyline: Code: Veronica (Resident Evil #6) \\n A desperate search for her missing brother once again pits Claire Redfield against the terrifying bioweapons of the Umbrella Corporation. Her quest leads her to a remote island where a mad genius has unleashed every grotesque creature at his disposal to stop her from interfering with his horrific agenda.Catapulted to the bottom of the world, Claire is at last reunited with the man she came to find. Chris Redfield has been fighting a one-man war of his own against Umbrella\u0027s most terrifying creations...and is now on a collision course with the man who betrayed the S.T.A.R.S. in Raccoon City. A man who should, by all rights, be dead: Captain Albert Wesker.\\n","cover":"https://allnovel.net/images/code-veronica-resident-evil-6.jpg","author":"S.D. Perry","type":"Horror","source":"allnovel","link":"https://allnovel.net/code-veronica-resident-evil-6.html","creation":"Oct 5, 2019 8:58:44 AM","modification":"Oct 5, 2019 4:33:41 PM"}}
