{"id":81186,"no":20,"title":"Page 20","content":"\"THE SELF-DESTRUCT SEQUENCE HAS BEEN activated,\" a recording intoned, reverberating through the room, crowding out the rest of its message. \"You have four minutes thirty seconds to reach minimum safe distance.\"\n Combined with the sirens and flashing emergency lights, Chris was on sensory overload before the fight even began. Alexia raised her hand to hit Claire, and Chris fired, the.357 bucking in his hand, the shot blasting over the self-destruct alarms, deafeningly explosive. Yes! A clean hit, right through the gut, and Claire was already at the elevator, pushing the button, stepping in - side...... but instead of bleeding, instead of faltering even a step, Alexia smiled at him. She lifted one of her slender gray hands and pushed it into her body, the flesh meld - ing seamlessly, flowing like water. A second later she held up the round he\u0027d nailed her with and gently tossed it in his direction. Bad, this is very, very bad, Chris thought numbly, and then she started to change. The lithe gray female crouched on the metal grid and her liquid flesh started to tremble, to form tiny peaks and dips all across her body, the tissue bubbling, ex - panding. The peaks became mountains, the dips, val - leys, all of it gray and swelling as her limbs started to fold in on themselves. Her arms curved over and joined the growing mass, the legs disappearing into it, the tex - ture turning rough and striated, veins like cables rising, and she kept swelling. Her head rolled down and be-came part of the giant, rounded body of her, gray be - coming muscle-tissue red, the purple and blue of blood vessels networking across like a tide.\n \"You have four minutes to reach minimum safe dis-tance,\" someone said, but Chris barely heard her, he was backing away, becoming more and more convinced that this was not going to end well. The elevator was blocked, and she just kept getting bigger. Thick tentacles pushed out from beneath the elephan - tine mass, undulating like waves, spreading out across the platform. Chris\u0027s back hit a wall, stopping him, and the thing, the massive, tumorous thing suddenly rose up as if unbending from some non-existent waist, spread - ing giant wings, a dragonfly\u0027s wings, raising a contorted and deformed half human face. The face opened its mouth and a gigantic roaring shriek spilled out, the wings trembling from the raw power of the sound - and then it spit at him, a thin stream of yellow green bile that splashed on the plat - form at his feet, and began to eat through the metal. \"Shit!\" Chris shouted, and barely jumped out of the way as one of the tentacles slashed forward. He had to watch the mouth and tentacles at the same time...... and from rounded, quivering pink spheres that had grown up around the base of the giant body, moving things began to crawl out. Chris ran to the farthest corner from the Alexia-thing and raised the.357, not sure where to shoot. The small subcreatures were landing on the platform, some like flat, rounded rocks with tentacles, some like beetles, some like nothing he\u0027d ever seen before, and they were all coming toward him, moving fast.\n The eyes, if you can\u0027t kill it maybe you can blind it...\n but the eyes were already blind, round gray holes with darkness underneath, and he\u0027d already seen how effec - tive bullets were against her flesh. That decided it for him. Chris took aim and fired...... and the pulsating, bloated creature was screaming again, this time in pain, one of her wings fluttering down to the platform. A few of the small organisms had reached him, one of the beetle creatures leaping onto his leg, trying to climb up. Disgusted, he brushed it off, but there was another to take its place, and a third. A tentacle flew at his face, shot from one of the rounded stone shapes. Chris blocked it, but barely.\n Move!\n \"You have three minutes thirty seconds to reach min-\n imum safe distance.\"\n Chris ran along the back wall, reached the other cor-ner in front of the creature and targeted again, trying for another wing. The shot went high, but the next one hit. It howled, the broken wing hanging from shredded connecting tissue, and then spit again, the stream of bile missing his face by inches. The thing now had only its two uppermost wings, and though he knew he\u0027d hurt it, it didn\u0027t seem to have suffered anything close to serious injury.\n And I have two rounds left.\n There had to be something he could do, some way to stop it, the self-destruct was going to blow all of them to hell and it would be his fault. He leaped away as another tentacle whipped out from the creature\u0027s base, trying to think, this was a goddamn emergency and he had to think...\n ... emergency release only.\n The bloated monster shrieked. More of the beetles were jumping at him but he ignored them, having only to turn his head to see the inset weapon next to the door, the one with the lockdown bar. A grenade or rocket launcher, whatever it was, it was beautiful, but the bar was still down, it hadn\u0027t released.\n \"You have two minutes to reach minimum safe dis-tance.\"\n Ka-chunk. The bar flipped up. Chris snatched it out, lifting and aiming it at the crea - ture\u0027s swollen guts. He didn\u0027t know what it would do but he hoped it was good, he hoped it would shut that bitch down. There was no safety, nothing to chamber. Chris pulled the trigger...... and a fury of white light and heat leaped from the barrel, blowing into the fat belly like an arrow into a bal - loon. The effect was huge, the explosion monstrous. A fountain of blood and gray jelly splatted out from the gaping, ragged hole, backsplattering onto his face, but he only had eyes for the screaming Alexia beast as its flesh and bone form gave out, deflating... The upper body of the creature was trying to pull free from the dying mass, the two wings flailing frantically at the air, but with only two, it couldn\u0027t free itself... and so it was dying, he knew because he could see its blood draining away, because the color of its horrid flesh was changing, turning ashy, the subcreatures shriv - eling, because of the absolute, complete hatred on its face... and the absolute surprise. As the Alexia monster fell silent and began to sag, her features dripping, Chris heard that he had one minute left.\n Claire.\n He dropped the incendiary launcher and ran. \n","sourceLink":"https://allnovel.net/code-veronica-resident-evil-6/page-20.html","bookId":2461,"book":{"id":2461,"title":"Code: Veronica (Resident Evil #6)","description":"Storyline: \n Code: Veronica (Resident Evil #6) \n A desperate search for her missing brother once again pits Claire Redfield against the terrifying bioweapons of the Umbrella Corporation. Her quest leads her to a remote island where a mad genius has unleashed every grotesque creature at his disposal to stop her from interfering with his horrific agenda.Catapulted to the bottom of the world, Claire is at last reunited with the man she came to find. Chris Redfield has been fighting a one-man war of his own against Umbrella\u0027s most terrifying creations...and is now on a collision course with the man who betrayed the S.T.A.R.S. in Raccoon City. A man who should, by all rights, be dead: Captain Albert Wesker.\n \n","cover":"https://allnovel.net/images/code-veronica-resident-evil-6.jpg","author":"S.D. Perry","type":"Horror","source":"allnovel","link":"https://allnovel.net/code-veronica-resident-evil-6.html","creation":"Oct 5, 2019 8:58:44 AM","modification":"Oct 5, 2019 4:33:41 PM"}}
