{"id":99619,"no":14,"title":"Page 14","content":"\\n\\n Vlad slapped her so hard the sound of the impact made me jump. “Silence! I will not have you defying me! She was to feed on her sister. She was to join us tonight!”\\n\\n “She is strong, Master. So very strong. She is yet mortal,” Cneajna said through bloodied, swollen lips. “Please, you gave her to me to care for. Please do not allow the madness to take her from me. You promised me another child.” She lowered her head in supplication, her hands held out to him.\\n\\n Vlad’s heavy brows knitted together over his green eyes. “Mortal! My blood runs in her.”\\n\\n I was wrenched to my feet and lifted out of the trunk. He gruffly took hold of my chin, forcing my head upwards. Searchingly, he stared into my eyes. With a snort, he dropped his hand.\\n\\n “She is a strong one,” he decided almost with amusement. “She is still mortal. Changing, yes, but still mortal.”\\n\\n “I told you, Master. When I saw her eyes, I knew she was not yet truly one of us. I saw her fear and realized our feeding could destroy her mind.” Cneajna climbed to her feet and moved to shield me from the view of Ariana and Elina feeding on May. “I was frightened, my Master. I know the importance of the new Bride, and I did not dare displease you by allowing her mind to be broken. Please, forgive me.”\\n\\n Vlad studied her expression, then glanced at me, his newest acquisition. “Yes, you were right, Cneajna.” Then, with swift violence, he backhanded her, knocking her to the floor. “But never defy me again!”\\n\\n Cneajna cowered at his feet. “Yes, Master.”\\n\\n “Ariana! Elina!”\\n\\n The two sisters rose to their feet. I dared not look upon the fallen form of my sister. Ariana, the curly haired one, wiped her bloodied lips with her hair, following Elina as though in a daze. Bowing their heads, they stood silently next to me.\\n\\n “What do you wish, my Master?” It was Elina who spoke, the one with the long, straight, raven hair. Her lips shimmered with blood as she spoke.\\n\\n “Prepare the girl. She must have the vampire baptism once more. Then she will join us. Take her to the bedchamber.” Vlad laid his hands on my shoulders, leaning toward me. I tried to avoid his lips, but they found mine in a crushing kiss. “Once more, my love.”\\n\\n Fresh tears slipped from my eyes, racing down my pale cheeks. I simply could not endure to suffer his dark passions again.\\n\\n Satisfied, Vlad whirled about and walked swiftly from the room.\\n\\n Cneajna pushed her hair back from her face, regaining her composure. The ugly bruises that Vlad had inflicted on her face were rapidly healing. It was then I realized my own wounds from the night before were fading and the pain was bearable. Extending one long hand, she lifted my chin.\\n\\n “Do not be afraid, dearest. I will care for you.”\\n\\n Fearfully, I looked up into the face of my new mistress. I gazed into the exquisite eyes of the vampire and saw unexpected compassion dwelling within them. It gave me hope. “Please, please, let me go. Please, I want to flee from here.”\\n\\n “Why does she beg to leave us? Is it the madness?” Ariana asked. She was the more delicate in appearance of the two dark Brides. I would later discover that when she had joined this dark world, she must not have been any more than sixteen years old. The dark gift had endowed her with the sensuality and cunning of one much older. She had fine sweet features and dark curly hair. With her small white hand, she gently swept my hair from my face to look into my terrified eyes. “Will she go mad like Erzsébet ?”\\n\\n “No, it is her mortality fighting the change.” Elina stared at me with open animosity. “She will transform. She is nearly of our blood now. Look at how her eyes are changing. Those are not the eyes of a mortal. Soon our dear husband will have his new wife.” Her voice was tinged with anger.\\n\\n Cneajna took hold of my arm, drawing me to her. “Come, my child, let us prepare you.”\\n\\n I avoided glancing at May lying on the floor, her neck nothing more than bloodied flesh. “I cannot take anymore. Please, let me go. Please!” My voice was harsh to my own ears, ragged and full of terror. I collapsed onto the cold stone floor, weeping. Burying my face in my hands, I cowered before the Brides.\\n\\n Cneajna leaned over me, her hair falling about me. “My dearest child, you are most honored to be a bride of Prince Vlad Dracula. He is the greatest of men. The pain will pass and you shall be one of us. The gift of immortal beauty and life shall be yours.”\\n\\n “He hurt me! I felt as though I’d been split apart. My body does not feel right. I am so cold. Please, I do not want to die here. I cannot die this way.”\\n\\n “But you won’t die. You will live forever as one of us. A vampire. A Bride.” Cneajna’s eyes were bright, her face pale and beautiful, and her teeth sharp and deadly.\\n\\n I could not imagine being what she was. I stared into the vampire’s face in terror. The thought of living here in this place trapped with those who had murdered my father and sister was unbearable.\\n\\n The dark Brides lifted me up with their cold hands as they encircled me, whispering promises of jewels, beauty, youth and immortality. They swayed around me, enfolding me in their embrace, their hands and hair brushing over me softly.\\n\\n Cneajna took my face in her hands and her blood red lips pulled back into a smile, her fangs exposed and glistening. “Soon, you shall be my child, my daughter, my sweetest Glynis. I will be your mother, your sister, and your protector. I will teach you our ways. To dance, to sing, to feed, to hunt, to serve our dear husband.”\\n\\n I closed my eyes tightly, swooning. I felt Ariana kiss my cheek as Elina slipped away to stand near the door. Cneajna lifted me up in her arms like a child and carried me from the room. My body grew colder as I was carried toward that horrible bedchamber. My head fell back from Cneajna’s shoulder and I noticed how frigid the air felt against my bare neck. Arms dangling, I had not the strength to lift them up. Peering through my eyelashes, I saw Ariana and Elina following close behind. Ariana was smiling, but Elina was staring at my exposed neck with obvious longing.\\n\\n Kill me, I thought. Kill me, Elina. Release me from this place.\\n\\n But Elina did not make her killing move.\\n\\n Cneajna turned into the darkened bedchamber and laid me down on the ancient bed. Flicking her hand, the candles next to the bed sprang to life. Ariana and Elina smoothed out my skirt and hair while Cneajna stood over them, smiling a satisfied smile.\\n\\n At last, they deemed that I looked like an appropriate feast for their husband. The two dark Brides stepped back, disappearing into the shadows. Cneajna lingered behind, one cold hand pressed against my cheek. Staring down into my face, she smiled.\\n\\n “Your time comes, my dearest child. Do not fear. Soon you will truly belong with us, and we shall spend eternity together. Sisters bound by blood. You will learn to love Vlad as we do, and then we shall be bound in our love for our husband.” She leaned over and kissed my lips lightly. “Sisters of darkness. Forever.”\\n\\n The shadows seemed to swell up around Cneajna as she faded away. Alone, I lay in the great bed, weeping and pondering the strange woman’s words. Never had fear pressed down upon me as strongly as it did now. I had feared for my family, but now I feared for my very soul. I could not live an eternity in this place. I would rather die.\\n\\n With all my strength, I pushed myself up. I crawled from the bed with great difficulty, then crept across the stone floor to the door. It was unlocked. My body was wracked with pain, but I forced myself to stumble on down the dimly lit corridor.\\n\\n I had to escape this place. I had to escape the fate decided for me. I would not live here in eternal darkness with these horrible women and that fiendish Vlad Dracula. I was determined to escape.\\n\\n Tears spilling down my face, I reached a crumbling stairwell that led upwards. Shivering from the cool air rushing down the stairs, I stared up into the darkness above me. Pressing my lips tightly together, I slowly climbed the stairs. My legs quivered from the strain, but as I turned a corner, I felt renewed strength.\\n\\n The night sky in all its exquisite beauty stretched out before me. I stood atop a battlement. The dark Carpathian Mountains surrounded the castle like menacing sentinels. A chilly wind whirled around me, tossing my hair into a merry dance.\\n\\n With grim determination, I moved toward the edge of the battlement and saw that this area of the castle was located near the sheer drop that fell to the river below. A small smile pressed itself onto my pale lips.\\n\\n “Yes, this is how I should die.”\\n\\n I stood barefoot at the edge staring below. I understood now what I must do. The moon glinted off the waves of the river. The darkness that dwelt there was soft and velvety to my gaze. With a soft sigh, I prepared myself to fall.\\n\\n “Do not do this!”\\n\\n I whirled about to see Vlad step onto the roof. I stared at his fierce face, then a serene smile graced my lips as I let myself fall backwards. My feet slipped free of the stones as I plummeted into the wind. I could feel my hair whipping about me as I fell. I watched as the sky fell away. The sensation of the wind rushing up past me filled me with peace. Soon the cold waters of the dark river would swallow my body, and I would be free.\\n\\n Death approached.\\n\\n But it was not the death I yearned for.\\n\\n Soft, strong arms encircled me and, to my horror, I heard Cneajna whisper my name.\\n\\n Ariana appeared out of the night sky to hover over me. Reaching out, she took one of my hands.\\n\\n My descent stopped.\\n\\n “No, no! Let me fall! Let me fall!”\\n\\n Elina floated into view, her dark eyes livid with anger. She seized hold of my other arm.\\n\\n “Please, no! Please! Let me fall!”\\n\\n Like three beautiful angels, the vampire Brides lifted me up. Their hair floating about them, their dresses billowing on the night air, they lifted me up to the waiting prince.\\n\\n “Did you think you could escape me so easily?” he shouted at me as I was set down before him. His rage furrowed his face, his eyes glowing with dark fires.\\n\\n “I only want death,” I sobbed.\\n\\n “And that is what you shall have!”\\n\\n Vlad grabbed hold of my hair, forcing my head back. The Brides encircled me and held me firmly as Vlad drove his fangs deep into my already ravaged throat. I screamed out in pain and fell back against the Brides, my hands trying to push him away. Viciously, he drank from me as the Brides pressed me against him. I struggled fiercely, but the vampires overwhelmed me.\\n\\n As I felt the warmth of my blood flowing over my breasts and thighs, I ceased to struggle. A mysterious calm filled me and the pain faded away like vapor. Faintly, I felt Cneajna’s cold hands leave my shoulders and shove at Vlad’s head.\\n\\n “Take no more. Her death approaches swiftly.”\\n\\n I felt as though I no longer existed within my body. A strange buoyancy filled me. Then a most wondrous sight appeared. A light brighter than the sun exploded into existence behind Vlad. Its radiating warmth reached out to me. I knew it was the doorway to the freedom and peace that I sought. Out of that glorious light, May emerged. Illuminated with splendid brightness, May reached for me.\\n\\n “May,” I whispered, transfixed by the vision of my sister.\\n\\n “Stop now!” Cneajna’s voice was desperate. “Her heart grows weaker.”\\n\\n Vlad reluctantly pulled back, his fangs stained with my dark blood.\\n\\n May was beckoning to me, her sweet face full of compassion. “Come, Glynis, come to me. It is time to join Father.”\\n\\n “I’m coming, May,” I whispered as I felt myself pulling free of my earthly body.\\n\\n “Now! Do it now!” Cneajna cried out.\\n\\n With his long nails, Vlad sliced his own throat and his thick vampire blood spewed forth.\\n\\n The brilliant light was so lovely, so compelling, and May was so close now, I could almost touch her. I did not care anymore about Vlad or the Brides. I was almost home.\\n\\n A fire erupted across my lips, flowing onto my tongue, down my throat, spreading like an icy current through my limbs. It was like being struck awake. I became sharply aware of my mouth being pressed against the gash in Vlad’s neck. I could feel his blood flowing into me and racing through my body. It was the ultimate penetration of my very being. \\n\\n","sourceLink":"https://allnovel.net/the-tale-of-the-vampire-bride-vampire-bride-1/page-14.html","bookId":2614,"book":{"id":2614,"title":"The Tale Of The Vampire Bride (Vampire Bride #1)","description":"Storyline: The Tale Of The Vampire Bride (Vampire Bride #1) \\n Set in the 1820s, The Tale of the Vampire Bride is sure to thrill fans of vampires of literary past with its lush, gothic atmosphere and terrifying spectacle. \\n All Lady Glynis Wright ever wanted was the freedom to live life as she pleased, despite her aristocratic parents\u0027 wishes for her to marry into wealth. But her fate is far more terrible than an arranged marriage when her family becomes prisoners to one of the most fearsome and powerful vampires of all time, Count Vlad Dracula. \\n Imprisoned in the decrepit castle in the Carpathian Mountains, Glynis’s new life as a Bride of Dracula is filled with bloody feasts, cruel beatings, and sexual depravity. There is no hope for escape. Vlad Dracula has elaborate plans to use her familial connections in England and she has become his favored pawn. Even more terrible is the bond of blood between them that keeps Glynis tethered to his side despite her deep hatred of him. \\n It’s only when Vlad Dracula takes Glynis to the picturesque city of Buda on the Danube River and she meets a mysterious vampire in the darkened city streets, does she dare hope to find love and freedom.\\n","cover":"https://allnovel.net/images/the-tale-of-the-vampire-bride-vampire-bride-1.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-tale-of-the-vampire-bride-vampire-bride-1.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:42:22 PM"}}
