{"id":99629,"no":24,"title":"Page 24","content":"\n “I will not!” I stomped my foot. “I refuse!”\n “Yes, you will, for if you do not go, he will starve us. Do you understand me? He will starve us! We will not feed. We will grow frail and ravenous and go mad!” Cneajna’s eyes were flashing with anger and desperation at the mere thought. “Either you go or we starve.”\n “But why does he want her?” Elina glared at me.\n I covered my face with my hands, completely overwhelmed. What horror was this? Not to feed! How quickly I had come to crave the blood that renewed my life. It was a desire like no other: dark and ravenous. Instinctively, I knew I could not bear not to feed.\n “Do you understand? We cannot feed without him. He gives us our life,” Cneajna said in a voice barely above a whisper.\n “You stupid little whore! It is an honor to be called to the Master!” Elina’s voice was like a slap. “How dare you defy him!”\n “Elina, please!” Cneajna motioned her back. “Do not complicate this!”\n I felt so desperately trapped. To be brutalized by that monster was the last thing I desired, but I could already feel the faint, yet sharp twinges of the coming hunger. I could not bear to not feel the sweetness of the blood giving me new life.\n I clenched my fists tightly. “I will go.”\n “That is wise, my dear child,” Cneajna said with relief and tenderly caressed my face with one hand. “You are learning our ways.”\n “I have no choice.” My voice was grim, and I felt close to tears.\n “Come along now. The Master is waiting.” Ilona motioned toward the door with her lantern.\n Taking a deep breath, I followed the old gypsy out of the chambers of the Brides. I was beginning to understand all too well that the passions of my new existence were dark and painful. The yearning to quench the burning vampire hunger and the desire to tear myself free of my Master’s power were forceful violent emotions raging in my being. Emotions burning with ferocity I had never experienced before. Now a new fearsome, paralyzing emotion wrapped cold chains about me.\n Fear.\n Stark, ugly, unrelenting fear.\n My limbs felt leaden as I followed Ilona to the Master’s chambers. A deeply piercing cold washed over me, my facial muscles constricting tightly. I was sure I was going to retch, but my new vampiric body had nothing to release. My already clasped hands tightened their grasp, my long nails digging into the flesh of my pale arms.\n Ilona’s lantern threw faded beams of yellowed light into the darkness. The light seemed so weak that the shadows barely cringed away. This new world was of infinite darkness.\n And fear.\n Such horrible fear.\n Ilona stopped before the battered countenance of an ancient door. “The Master awaits within.”\n I desperately searched for an exit from this madness, but there were only shadows, the forlorn wail of a distant wolf, and the thundering of my own thickly beating heart. A heart that slowly faded as the blood of my victim lost its potency.\n “There is no escape from the Master,” Ilona warned, her dark eyes piercing. “None.”\n “Open the damn door, wench, and be done with it!”\n She shrank back at my hiss and the sight of my sharp teeth.\n I would suffer my desecration, then flee back to my vampire sisters. It was vividly apparent that I would have to endure the humiliation and pain of Vlad ravaging my body once more.\n She turned the latch, and the door swung open.\n “Come,” Vlad’s voice commanded from within.\n As I passed by Ilona, I flicked my gaze toward her. She tried to hold her ground and stare me down. “I will not forget this,” I said, and was rewarded with the slight trembling of her bottom lip.\n I glided into the room, the firelight catching the fiery shimmer of my hair and the sparkling in the depths of the many jewels decorating my body. My eyes were hard and fierce, fear hiding behind my anger.\n “Ah, my new Bride. Now you appear as you should. Much better.” His tone was lightly clipped and his polite façade from an hour before was slipping away. His eyes were darkly menacing and his lips bore a cruel sneer. “Why have you kept me waiting?”\n “I did not want to come,” I answered truthfully.\n Ilona shut the door behind me, and I heard the distinct sound of the door locking.\n He laughed. “Yes, I assumed as much.” He sat by the fire that raged within the fireplace. His eyes were cold and malevolent. “You are a strong willed creature. I shall enjoy breaking you.”\n “I-“ I began to retort.\n In a blur, Vlad was across the room. His arms clamped about me painfully as his full lips crushed against mine. I tried to scream but my mouth was being ground against his. I could feel his fangs ripping across my lips and my own fangs descending. Trying to push him back, my long nails ripped the fine black silk of his clothing.\n Suddenly, I was alone, my hands flailing at cold empty air. Vlad’s laughter filled the chamber.\n “Such a spirited girl. Such a lovely conquest,” his voice taunted from the shadows.\n I whirled about, searching for my foe. The ancient bed, the burning fire, the dragon banner, the narrow windows, all spun by as I tried to spot my Master, spinning and spinning in desperation. The room appeared empty, I alone inhabiting this room of decaying grandeur. And yet, his low, angry laughter taunted me.\n He seized me from behind, his hands closing over my breasts, his sharp teeth ripping into my throat. I screamed in horror as his long nails sank into the soft flesh of my breasts and blood began to stain my dress. My hand closed on the long, thick coils of his auburn hair and frantically tried to pull him from me.\n His strong body pushed me forward toward the bed. Hissing, I tried to push back against him. It only fueled my anger when I realized he was much stronger than I. I could feel his heart beating against my chest, and I knew he had fresh blood pumping his heart. My heart was sluggish and cold. I was enraged by the thought of him feasting so he would be the stronger.\n His long tongue licked hungrily at the wound he had inflicted on my throat and it repulsed me.\n “Let go of me!”\n Again, I found myself suddenly alone. Half fallen on the bed, my hand closed over the wound on my neck. Beneath my trembling fingers, I felt the ragged edges of the torn flesh drawing close.\n “Let me be!” I was shaking violently from anger and fear. My voice wavered and that made me angrier.\n “Never,” his voice hissed.\n There was a flash of blue fire then I was on my back, pinned to the rotting bedclothes of the bed. Screaming in rage, I flailed against the vampire, but he paid me no heed. He was biting me savagely all over my body, drawing blood that pooled in the wounds. To me, his tongue seemed too long, like a snake’s, as it lapped away my blood, my life.\n “Damn you,” I screeched and ripped at his face with my nails.\n But our bodies were not longer human. Every wound seemed to almost immediately draw closed and the vampire flesh absorbed every drop of blood that was not licked away.\n Vlad’s long hands slid between my legs and tried to part them. With renewed strength, I slammed my fist into his face. His cheek split open, blood splashing over my body. I felt a rush of strength as my skin absorbed his blood, and my heart beat more fiercely in my chest with renewed vigor. Vlad hissed at me angrily and struck me so hard my world went black.\n My awareness came abruptly back when I felt him pierce me. Gasping in pain, I grabbed hold of his hair and pulled his head back sharply. Thrashing about beneath his body, I tried to free myself. He was thrusting into me with frustrating ease. I screamed in his face and bared my fangs. He laughed as nothing I tried seemed to be able to prevent his violation of my body.\n Screaming in rage, I began to beat on him with all my might. Ripping and shredding flesh with my long nails, biting and tearing at his face with my teeth, I fought with all that I had within me.\n Still he panted and heaved with dark pleasure above me.\n Then, all at once, my rage left me.\n My hands fell away from their assault and I lay there as though dead. Now every movement within me was painfully apparent. My rage had buffered me, but now I felt every minute detail of my desecration. His body bearing down on me, his long hair whipping my face, my body rocking with his every movement.\n “Leave me,” I whispered.\n There was no reply.\n My screams were no longer verbal. They were violent, enraged silent screams echoing through the emptiness within me. A blessed darkness filled my mind’s eyes, a barren place to hide within. A hollow void to fill with my pain and terror. My gaze grew distant as I fell away within myself, the only sound my rapidly beating heart. There was a serene silence in this void. I could hide here, away from the world of physical torment.\n “Do not defy me!”\n Reality came swimming back as my head impacted with the wall the second time. Vlad had me up against the wall beside the bed. His face was enraged.\n “Do not ever do that again!”\n I was confused for a moment, his nakedness, the pain cutting through my abdomen, the ache between my thighs, and his crazed expression not fitting coherently in my mind. Then I became aware that I was grasping the tattered remains of my dress in my hands and pressing the bundle protectively against my sex.\n “You raped me!”\n He growled at me, his wolfen teeth sharp and gleaming. “I took what was mine.”\n “I am not yours,” I said firmly.\n He slapped me violently. “You will do as I say. You will not ignore me again. I called your name four times and you did not answer.”\n “I did not want to hear your voice! I do not want you touch me! I hate you!” I was trembling with fear and anger. I felt violated: utterly and completely violated. And I was angry. Angry that I was weaker. Angry that I was afraid. Angry that my own body betrayed me. The sick pleasure I had derived from his violation of my body was too awful to bear. I could still feel the pleasing sting between my legs. I felt like a whore.\n Vlad’s face was twisted in anger, his eyes burning with red fire, his full lips pulled back from his long fangs. “Hate me if you like, but do not ignore me.”\n His body was too close to mine. I could not bear to feel or see his nakedness. It made me feel filthy. Shrinking back against the wall, I averted my face.\n He slapped me again. “Look at me.”\n I squeezed my eyes shut. Why could he not just let me be?\n Grabbing handfuls of my hair, he slammed my head against the wall again, pain ripping through my skull. “I shall do this until you open your eyes.”\n I forced myself to look up into his fierce countenance. He is the devil, I thought.\n Vlad pressed his dark face against mine, licking my trembling lips. “You disgust me, my dear Bride,” he whispered. “Such a tempting woman, such a terrible lover.”\n I was trembling, the pressure of his body against mine making me squirm. “I do not want you to touch me. I hate you.”\n A low malevolent laugh sent chills through me.\n “I never said I wanted you to love me.”\n Yanking me about by my hair, he swung me across the room. Slamming into the wall, I hung there, clutching the cold stones with my hands.\n “I made you my Bride. Act as such.”\n I slid off the wall and forced myself to look at him. “No, not a Bride. You made me into your whore!”\n Vlad began to laugh with amusement, his fangs glimmering in the firelight. “A whore? Really? Every female aristocrat is a whore on her wedding night! Sold by her family for prestige and wealth.”\n I stood shakily, determined to stand my ground. “You slaughtered my family.”\n “I liberated you from them. They would have sold you to any old bastard with money.”\n “Be silent!”\n Vlad stretched out his long vampire body, rippling with fine muscles. “I am a god to my people. A savior that surpasses all others. You,” he pointed at me, “are honored above all other women.” \n","sourceLink":"https://allnovel.net/the-tale-of-the-vampire-bride-vampire-bride-1/page-24.html","bookId":2614,"book":{"id":2614,"title":"The Tale Of The Vampire Bride (Vampire Bride #1)","description":"Storyline: \n The Tale Of The Vampire Bride (Vampire Bride #1) \n Set in the 1820s, The Tale of the Vampire Bride is sure to thrill fans of vampires of literary past with its lush, gothic atmosphere and terrifying spectacle. \n All Lady Glynis Wright ever wanted was the freedom to live life as she pleased, despite her aristocratic parents\u0027 wishes for her to marry into wealth. But her fate is far more terrible than an arranged marriage when her family becomes prisoners to one of the most fearsome and powerful vampires of all time, Count Vlad Dracula. \n Imprisoned in the decrepit castle in the Carpathian Mountains, Glynis’s new life as a Bride of Dracula is filled with bloody feasts, cruel beatings, and sexual depravity. There is no hope for escape. Vlad Dracula has elaborate plans to use her familial connections in England and she has become his favored pawn. Even more terrible is the bond of blood between them that keeps Glynis tethered to his side despite her deep hatred of him. \n It’s only when Vlad Dracula takes Glynis to the picturesque city of Buda on the Danube River and she meets a mysterious vampire in the darkened city streets, does she dare hope to find love and freedom.\n \n","cover":"https://allnovel.net/images/the-tale-of-the-vampire-bride-vampire-bride-1.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-tale-of-the-vampire-bride-vampire-bride-1.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:42:22 PM"}}
