{"id":99676,"no":72,"title":"Page 72","content":"\n “It is May first, wife. Walpurgis Night. When the devil walks the night,” Vlad said with a sardonic smile.\n I let out a bitter laugh. “Dracula returns home on Walpurgis Night. How appropriate.”\n “Perhaps,” he answered wryly. “Many would say I am the devil.”\n As the carriage rattled up the pass to the great, broken castle, the bonfires became clearly visible, their flames twisting and leaping high into the air. The gypsies were dancing wildly to music around the fires and I could smell, even from a distance, that most were quite drunk. As the great dark carriage with its black horses clattered into the courtyard, the ribald music ceased and the gypsies rushed out toward us. I was not sure of their intentions, but Astir’s guards moved to protect the carriage. Vlad emerged quickly and the gypsies fell to their knees before him in shock and relief. I followed and saw Ilona cross herself as I stood beside Vlad.\n The guards from the haven, imposing in their black uniforms, drew back their horses as Vlad moved through the crowd of gypsies, touching them one by one on the forehead. It was a strange, almost surreal moment, as the bonfires threw up fiery sparks into the night around us.\n “You have returned,” Ilona sobbed when he touched her cheek. She kissed his hand eagerly.\n Looking beyond the shadows and firelight that twisted and intertwined in an exotic dance, I saw the door to the castle was open. Slowly, I moved past the kneeling gypsies and drew my cloak firmly about me. Walking slowly, I moved toward the great black mouth that opened into my former home.\n I felt tears, hot and fierce, sting my eyes as I saw at last my three sisters. They were in the doorway, hiding away from the flames, their long fingers gripping the edges of the door frame. Skeletal, frail, gray, and old, they huddled together. Ariana lay against the door frame, her head tilted so that she could see the blood filled gypsies that were beyond her reach. The women were tattered, shriveled crones. The horror of their condition enveloped me.\n Ariana saw me and hissed, her hand trying to reach out toward me, but stopped by the ward of power Vlad had about the castle. Shrieking, she fell back, her body twisting in terrible spasms of pain.\n Cneajna, her hair now white and brittle, bared her long teeth at me. I saw that her flesh had cracked along her cheeks.\n I wept at the sight of my sisters and covered my face with my hands. I felt Vlad’s hand on my back and I turned to him. He kissed my brow, then whispered words I did not understand through my despair.\n The Brides cowered at the sound of his voice and began to weep. They clung to one another, a twisted heap of bones and dried flesh, their tattered dresses lying limply over their desiccated forms. I cried out to Vlad to help them and he slid past me toward the doorway. Lingering just beyond their reach, he said their names one by one and they cried out as if it pained them.\n “Bring him,” Vlad ordered a guard near him.\n Confused, I turned to see the guards move back to the carriage. They pulled off a large trunk and opened it. Gruffly, they yanked out a man in clothes that were mere rags. He reeked of fear and piss. Vlad must have had him asleep until this point for I had not even been aware of him. Dragging the man between them, the guards approached the castle.\n “I do not suffer fools who dare try to steal from me,” Vlad told the man.\n The man looked at him in terror then at the hag-like women in the doorway. He tried to scream through his gag.\n “He attempted to steal one of our bags off the carriage. The guards caught him,” Vlad explained to me.\n I knew what was to come and looked at Vlad with distaste. But then again, who was I to dictate any sort of decorum when I had killed so easily the night before?\n Vlad took hold of the man by his arm. “This is your justice,” he snarled, tossing the man into the arms of the women.\n Their savagery was beyond anything I could have imagined. They did not only take his blood, but his flesh. Huge gouts of blood sprang from their terrible bites and they feasted hungrily upon him. They did not eat his flesh, but made wounds large enough to plunge their faces into his body to drink. It was horrible, yet I could not look away. Blood splattered their grotesque bodies and the ground. I watched mesmerized as the blood sank into their flesh and slithered along the cobblestones to slide up their skin into their mouths. They feasted desperately and before my eyes I saw their skin began to flush with life and their hair turn from gray to rich dark brown, golden blond, and raven black. Their milky eyes grew cold and jewel-like, vibrant with color and fire. They consumed every last bit of his blood and licked it from their faces with long, red tongues.\n They were not fully restored yet, but I could see their beautiful features finally emerging from their once skeletal forms. They looked gaunt, but they had flesh upon their bones.\n “Vlad, Vlad,” Cneajna called out to him, and held out her hands to him in sad desperation.\n Taking hold of my hand, he moved toward the entrance way. There was not much left of the man who had attempted to rob us. He was a dry husk. I stepped over him as we entered the castle and the torches on the walls sprang to life. The Brides cooed and whispered softly to Vlad as they crawled to him, supplicating.\n Vlad stood over them, cold and imperious. They pawed at his legs and kissed his hand. Their eyes gazed up at him with desperate yearning. Only Cneajna held back, her head bowed low as she knelt before him.\n “Forgive us, forgive us,” the two dark haired Brides whispered.\n Vlad drew his hand away from them. “Go feed. I cannot stand the sight of you.”\n The two women moaned in despair at his words and sank away from him. Cneajna looked upon us, her gaze imploring.\n “Vlad, forgive us if we displeased you,” she whispered, tears in her eyes.\n “Go, feed! Now! I cannot stand the sight of you!” Vlad ordered in a harsh voice. He continued to hold onto my hand, keeping me firmly at his side.\n Cneajna rose to her feet, her once glorious gown now a ruin of rags. Her face was pinched and her full lips pale. She nodded slowly and took hold of the other two women. Drawing them with her, the three women glided out into the night. With one last look cast over her shoulder, Cneajna disappeared.\n Alone, hand in hand, Vlad and I stood in the foyer of the decrepit castle. My gaze swept over the great hall with despair and I felt my throat tighten. The last time I had entered this castle as a visitor, my family had been alive and I had been mortal.\n “We shall only be here for a short time,” Vlad assured me. “As soon as your brother has done as he promised, we shall depart for England.”\n I nodded slowly. “Very well.”\n Vlad released my hand. “I will have Ilona prepare a chamber for you. You will no longer be in the Brides chambers.”\n “They will know then,” I answered swiftly.\n Vlad nodded. “Yes, they will.”\n I tried to speak, but could not find words. He gazed at me long and hard, then walked on into the depths of the castle.\n I closed my eyes, feeling a terrible sense of dread fill me.\n Ilona prepared the chamber I had first slept in as a mortal. I found it a cruel irony, but did not dare complain. Vlad had been far too kind to me lately and I feared a return to his violent ways. Already he looked like the warrior of old, so I felt I must tread carefully.\n Ilona had some of the other women bring in the finest tapestries and bed clothes from other rooms. The best of the candlesticks and other decorations were brought in as well. Soon the room did not seem quite as bare and terrible. My trunks arrived and the women immediately began to unpack them. Ilona seemed especially careful around me, obviously afraid of my new position in the household.\n As they worked, I changed into a pale blue dress and fixed my hair. Tiny red tendrils fell around my brow and ears and I felt a little more relaxed in my modern attire.\n “So many fine things,” Ilona dared to say to me. “He must love you very much.”\n I waved my hand at her dismissively and sat at the mirrorless vanity. With a sigh, I arranged my perfumes and powders.\n Her presence pricked at me before I saw her in the doorway. Restored to her full beauty, Cneajna stood just outside my room. Her golden hair fell around her voluptuous form. A beautiful silky gossamer gown fell to her bare feet and her limbs were encircled by fine exotic jewelry.\n “What is this?” she asked in a low voice.\n I put a smile on my face as I rose to my feet. “Cneajna, it is so good to see you!” I went to her, my arms outstretched to embrace her.\n “What is this?” she said again in a low voice. Her sapphire-colored eyes looked sharply at me.\n I faltered as slowly my arms dropped to my sides. “Vlad gave me my own chamber,” I confessed in an embarrassed tone.\n Cneajna stepped into the room and brushed past me. She smelled delicious and warm, and I wanted to embrace her. Her power was cold and fierce as it pushed me away from her.\n “Why would he do this?” she asked. She turned to look at me, her gaze sharp.\n For some strange reason, her large gold-fringe earrings, that swung back and forth as she looked around the room, distracted me.\n “Why would he do this?” she shouted.\n I drew back, startled at her anger. “Cneajna, I do not know. Are you not happy that we have returned?”\n “He left us here to starve. Why? Tell me, Glynis? Why would he do that?”\n “I do not know.”\n She looked about the room, those gold earrings swinging about. “Why would he give you this room far from his other Brides?”\n “He has his own agendas. You know how he is,” I answered, trying to keep my voice very calm.\n She lashed out so quickly, so fiercely, I never saw her move. I felt the brutal sting of her slap across my face and I cringed in shock.\n “I took you into my heart! I helped him create you! I called you daughter!”\n “Cneajna, please,” I cried out. “I love you.”\n She hesitated in her angry torrent of words. Tears sparkled on her cheeks as she whispered, “And I love you.”\n I reached out to her and she took my hands. Her fingers felt warm in mine, but she was trembling.\n “Cneajna, please. I wanted him to come and make sure you all were all right. I begged him to do so. I do not know why he would not,” I said. It was a bit of a lie and a bit of truth. Vlad’s dismissal of his Brides was very confusing to me.\n She reached out and drew me to her, kissing my lips softly, as she had in my dream, and then my brow. I trembled with emotion as she did this and, she, being the taller woman, held me gently against her. Her lips were soft and warm against my brow as her long blond hair flowed over her arm to form a cloak over my body.\n “I love you, Glynis, but I am not a fool,” she said in a low voice. “You are now the first in our husband’s affections. And, worst yet, in his household.”\n I started to protest, but her nails raked my neck and face, slicing deep and drawing blood. It splattered across her face and mine. She drew back slowly, moving backwards toward the door. Slowly, she licked my blood from her full red lips.\n Tears streamed down my face as I recalled the story that she had told me long ago of the day she killed her husband’s mistress. I remembered vividly how she told me she had stabbed the woman to death then licked her enemy’s blood from her lips.\n “Cneajna,” I whispered.\n Her blue eyes cold and her gaze fastened firmly upon me, she glided out of my bedroom. She raised a hand and the door slammed between us.\n The gypsy women stood around my room, their eyes wide and not daring to breathe.\n “Leave me,” I ordered them.\n Immediately, they rushed the door and escaped.\n Weeping, I sat down at my vanity and covered my torn face with my hands. Slowly, I felt my flesh heal, but my heart was utterly broken.\n I did not tell Vlad what had happened between Cneajna and I when he came to me later in the night. I was overwhelmed with grief over the episode, but I could not bear to tell him what had happened. To relate what I had experienced was too much to endure. I felt desolate in my heartbreak. He took my moodiness as a sign of my discontentment at our return to the castle and reassured me that we would depart soon. \n","sourceLink":"https://allnovel.net/the-tale-of-the-vampire-bride-vampire-bride-1/page-72.html","bookId":2614,"book":{"id":2614,"title":"The Tale Of The Vampire Bride (Vampire Bride #1)","description":"Storyline: \n The Tale Of The Vampire Bride (Vampire Bride #1) \n Set in the 1820s, The Tale of the Vampire Bride is sure to thrill fans of vampires of literary past with its lush, gothic atmosphere and terrifying spectacle. \n All Lady Glynis Wright ever wanted was the freedom to live life as she pleased, despite her aristocratic parents\u0027 wishes for her to marry into wealth. But her fate is far more terrible than an arranged marriage when her family becomes prisoners to one of the most fearsome and powerful vampires of all time, Count Vlad Dracula. \n Imprisoned in the decrepit castle in the Carpathian Mountains, Glynis’s new life as a Bride of Dracula is filled with bloody feasts, cruel beatings, and sexual depravity. There is no hope for escape. Vlad Dracula has elaborate plans to use her familial connections in England and she has become his favored pawn. Even more terrible is the bond of blood between them that keeps Glynis tethered to his side despite her deep hatred of him. \n It’s only when Vlad Dracula takes Glynis to the picturesque city of Buda on the Danube River and she meets a mysterious vampire in the darkened city streets, does she dare hope to find love and freedom.\n \n","cover":"https://allnovel.net/images/the-tale-of-the-vampire-bride-vampire-bride-1.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-tale-of-the-vampire-bride-vampire-bride-1.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:42:22 PM"}}
