{"id":95606,"no":1,"title":"Page 1","content":"\"Oh, well ye got to be pullin\u0027 harder than that!\" Tred McKnuckles yelled to his team of two horses and three dwarves. \"I\u0027m hoping to be making Shallows afore the summer sun shines on me balding head!\"\n His voice echoed off the stone around them, a bellow befitting one of Tred\u0027s stature. He was stout, even as dwarves go, with a body that could take a beating and lumpy arms that could dish one out. He wore his yellow beard long, often tucked into the front of his huge belt, and kept a throwing hammer-commonly called \"a dwarven arrow\"-strapped on the back of each shoulder, ready for launch.\n \"It\u0027d be easier if ye didn\u0027t have th\u0027 other horse sitting in the back o\u0027 the wagon, ye blasted fool!\" one of the pulling dwarves yelled back.\n Tred responded by giving him a crack on the rump with the whip.\n The dwarf stopped, or tried to, but the fact that the wagon kept on rolling, and he was strapped into the yoke, convinced him that maybe it would be a good idea to continue moving his strong and stubby legs.\n \"Don\u0027t ye doubt that I\u0027ll be payin\u0027 ye back for that one!\" he growled at Tred, but the other dwarves pulling, and the three others still sitting up on the wagon beside the boss dwarf, all just laughed at him.\n They had been making fine progress since leaving Citadel Felbarr two tendays earlier, chancing the north run along the western face of the Rauvin Mountains. Breaking through to the flat ground, the group had done some minor trading and re-supplying at a large settlement of the Black Lion barbarian tribe. Named Beorunna\u0027s Well, it, along with Sundabar, Silverymoon, and Quaervarr, was a favored trading locale for the seven thousand dwarves of Citadel Felbarr. Typically, the dwarves\u0027 caravans would run to Beorunna\u0027s Well, swap their wares, then turn back to the south, to the mountains and their home, but this particular group had surprised the leaders of the barbarian settlement and had pressed on to the west-northwest.\n Tred was determined to open up Shallows and the other smaller towns along the River Surbrin, running the western edge of the Spine of the World, for trade. Rumors had it that Mithral Hall had for some unknown reason slowed its trade of late with the towns upriver, and Tred, ever the opportunist, wanted Felbarr to fill that void, Other rumors, after all, said that some pretty amazing gems and even a few ancient artifacts, thought to he dwarven, were being pulled from the shallow mines on the western edges of the Spine of the World.\n The late winter weather had been quite favorable for the fifty mile run, and the wagon had rolled along without incident past the northern tip of the Moonwood and right to the foothills of the Spine of the World. The dwarves had gone a bit too far to the north, however, and so had turned south, keeping the mountains on their right. Still, the temperatures had remained relatively warm, but not so warm that they would destroy the integrity of the snow sheets and thus rain avalanches all about the trails. That same morning, though, an abscess had reared its ugly head on the hoof of one of the horses, and while the handy dwarves had been able to extract the stone the horse had picked up and drain the abscess, the horse was not yet ready to pull the laden wagon. It wasn\u0027t even walking very comfortably, so Tred had the team put the horse up on the back of the large wagon, then he split the other six dwarves into two teams of three.\n They were quite good at it, and for a long time, the wagon had kept up its previous pace, but as the second team neared the end of its second shift, they were starting to drag.\n \"When\u0027re ye thinking we\u0027ll get that horse back in the harness?\" asked Duggan McKnuckles, Tred\u0027s younger brother, whose yellow beard barely reached the middle of his chest.\n \"Bah, she\u0027ll be trotting along tomorrow,\" Tred answered with confidence, and all the others nodded.\n None knew horses better than Tred, after all. In addition to being one of the finest blacksmiths in all of Citadel Felbarr, he was also the place\u0027s most prominent farrier. Whenever merchant caravans rolled into the dwarf stronghold, Tred would inevitably be called upon, usually by King Emerus Warcrown himself, to shoe all the horses.\n \"Might be that we should be putting up for the night then,\" said one of the dwarves pulling along in front. \"Set a camp, eat us a good stew, and lighten that load we got by a keg o\u0027 ale!\"\n \"Ho ho!\" several of the others roared in agreement, as dwarves usually did when the possibility of consuming ale was mentioned.\n \"Bah, ye\u0027ve all gone soft on me!\" Tred pouted.\n \"Ye\u0027re just wanting to beat Smig to Shallows!\" Duggan declared.\n Tred spat and waved his hands. It was too obvious a protest. Every-one there knew it was true enough. Smig was Tred\u0027s greatest rival, two friends who pretended to hate each other, but who, in truth, only lived to outdo each other. Both knew that the small town of Shallows, with its trademark tower and renowned wizard, had seen an influx of people right before the winter-frontiersmen who would need fine weapons, armor, and horseshoes - and both had heard King Warcrown\u0027s proclamation that he would be pleased to establish trading routes along the Spine of the World. Since the recapture of the dwarven citadel, which had been in orc hands for three centuries, the area west of Felbarr had calmed considerably, with the mountainous region to the east still buzzing with monstrous activity. There was an Underdark route to Mithral Hall, but none had been discovered thus far to open the lands north of Clan Battlehammer\u0027s stronghold. All of those accompanying Tred- his workers, including his brother Duggan, Nikwillig the cobbler, and the opportunistic brothers, Bokkum and Stokkum, who were carrying essential goods (mostly ale) for other Felbarr tradesmen-had eagerly signed on. The first caravan would be the most profitable one, taking their pick of the treasures garnered by the frontiersmen. Even more important than that, the first caravan would carry bragging rights and the favor of King Warcrown.\n Right before the departure, Tred had engaged Smiggly \"Smig\" Stumpin in a good-natured drinking game, but not before he had paid one of the Moradin priests well for a potion that defeated the effects of alcohol. Tred figured that he and his had been out of Citadel Felbarr for a day and more before poor Smig had even awakened, and another day before the dwarf could shrink his head enough to get out the citadel\u0027s front door.\n Tred would be damned if he\u0027d let a little thing like an abscessed horse hoof slow them down enough for Smig to have a chance of catching up.\n \"Ye put up a trot for three more miles and we\u0027ll call it a good day,\" Tred offered.\n Groans erupted all about him, even from Bokkum, who stood to lose the most profits by an early camp, and hence, more ale consumed and less to sell-though the betting was that he wouldn\u0027t end up selling it in Shallows anyway, and that he\u0027d take it back for the celebration on the return journey.\n \"Two miles, then!\" Tred barked. \"Are ye wanting to share a camp this night with Smig and his boys?\"\n \"Bah, Smig ain\u0027t even out yet,\" Stokkum said.\n \"And if he is, he and his got slowed plenty by the rock-fall we dropped in the path behind us,\" Nikwillig added.\n \"Two more miles!\" Tred roared.\n He cracked the whip again, and poor Nikwillig stood up very straight and managed to turn about enough to put a glower over the rugged driver.\n \"Ye hit me again and I\u0027ll be making ye a pair o\u0027 shoes ye won\u0027t soon be forgetting!\" Nikwillig blustered.\n His feet were digging little trenches as he got dragged along, and that only made Tred and the others laugh all the louder. Before Nikwillig could start his grumping again, Duggan kicked up a song about a mythical dwarven Utopia, a great town in a deep mine that would please Moradin himself.\n \"Climb that trail!\" Duggan crooned, and several looked at him, not sure if he was singing or ordering them around. \"Break down that door!\" Duggan went on, prompting Stokkum to yell out, \"What door?\"\n But Duggan only continued, \"Find that tunnel and run some more!\"\n \"Ah, Upsen Downs!\" Stokkum yelled, and the whole crew, even surly Nikwillig, couldn\u0027t resist, and broke into a rowdy, back-slapping song.\n \"Climb that trail\n Break down that door\n Find that tunnel\n and run some more\n \"Cross the bridge of fiery glow\n Running deeper down below\n Make some smiles from those frowns\n Ye\u0027ve found the town of Upsen Downs!\n \"Upsen Downs! Upsen Downs!\n Ye\u0027ve found the town of Upsen Downs!\n Upsen Downs! Upsen Downs!\n Make some smites from those frowns.\n \" Ye\u0027ve found the place o\u0027the finest ale\n With arm-sized pretzels that\u0027re never stale!\n With big Chef Muglump and his coney stew\n And Master Bumble with his forty brews!\n \"And in the holes ye can break the rock\n and haul it up with yer tackle and block\n Smelt it down and ye \u0027II get it sold\n Upsen Downs\u0027s got the finest gold!\n \" Upsen Downs! Upsen Downs!\n Ye\u0027ve found the town of Upsen Downs!\n Upsen Downs! Upsen Downs!\n Make some smiles from those frowns.\n It went on for many verses, and when the seven dwarves ran out of the formal lines of the old song, they just improvised, as they always did, with each piping in his own wants from such a remarkable place as Upsen Downs. That was the fun of the dwarven song, after all, and also a fairly subtle way for any perceptive dwarf to take a good measure of a potential friend or a potential foe.\n Also, the song was a fine distraction, mostly for the three tugging the wagon along, backs bent and straining. They made fine progress through those minutes, bouncing along the rocky ground, the mountains rising up to their right as they moved south along the trail.\n In the driver\u0027s seat, Tred called out names in order, bellowing for each to add the next verse. It went on smoothly, until he called out to his little brother Duggan.\n The other five kept humming, providing the background, but they went through almost an entire verse, and there was still no response from Duggan.\n \"Well?\" Tred asked, turning to regard his little brother and seeing a very confused look on Duggan\u0027s face. \"Ye got to sing in, boy!\"\n Duggan looked at him curiously, confusedly, for a long moment, then quietly said, \"I think I be hurt.\"\n Only then did Tred look past that puzzled expression, moving his head back and taking a wider view of Duggan. Only then did Tred notice the spear sticking out of Duggan\u0027s side!\n He gave a shriek, and the humming behind him stopped, with the two sitting in the back of the wagon turning to regard the slumping Duggan. Up front it quieted, too, but not completely, until a huge boulder whistled down, slamming the path right beside the three surprised dwarves and bouncing over them, clipping Nikwillig on the shoulder and knocking him silly.\n The terrified horses broke into a gallop, and both the injured horse and poor Stokkum broke free of the rig, with Stokkum tumbling out onto the stony ground. Tred grabbed the reins hard, trying to slow the beasts, for his poor kinsmen up front were being tugged and dragged along, especially Nikwillig, who seemed unconscious.\n Another boulder smashed down right behind the bouncing wagon, and a third hit the ground before the charging team. The horses veered wildly to the left, then tried to turn back to the trail on the right, putting the wagon up on two wheels.\n \"Move right!\" Tred ordered, but even as he spoke the command, the wagon\u0027s left wheels buckled and the cart crashed down and flipped.\n The horses broke free, then, taking the harness and the three strapped dwarves on a dead run down the rocky trail.\n The two dwarves behind Tred went flying away -and Duggan was hardly aware of it-and Tred would have, too, except that his leg got hooked under the wagon seat. He felt the crunch of bone as the wagon came down atop him, then he got smacked on the head, and hard. He thought he had erupted into a bloody mess for a moment as the wagon continued its sidelong roll, but he had the fleeting notion that it was ale washing over him.\n Luck alone extracted the dwarf from the crunching catastrophe, for he somehow wound up inside that decapitated keg. He went bounding and rolling away down the slope of the foothills. A rock stopped him abruptly, shattering the keg, and Tred went into a weird twisting somersault.\n Tough as the stone around him, the dwarf struggled to his feet. One of his legs gave out under him, so he fell forward against the stone, stubbornly propping himself up on his elbows.\n He saw them then, dozens and dozens of ores, waving spears, clubs, and swords, swarming over the destroyed wagon and fallen dwarves. A pair of giants followed them down from the higher ground -not hill giants, as Tred would have expected, but larger, blue-skinned frost giants. He knew\n then that this was no ordinary band of raiders.\n Slipping from consciousness, Tred kept enough of his wits about him to throw himself backward, falling into a roll down another slope, ending hard against another rock beneath a tangle of brambles. He tried to stand again but then tasted bloody dirt in his mouth.\n Tred knew no more.\n \"Well, are ye alive, or ain\u0027t ye?\" came a distant, gravelly voice.\n Tred opened one eye, caked with blood, and through a haze saw the battered form of Nikwillig, crouched before the brambles and staring in at him.\n \"Good, so ye are,\" said Nikwillig and he slipped his arm in, offering Tred a hand. \"Keep your arse low or the pickers\u0027ll be skinning it good.\"\n Tred took that hand and squeezed it tightly but did not start out of the tangle.\n \"Where\u0027re the others?\" he asked. \"Where\u0027s me brother?\"\n \"The ores killed \u0027em all to death in battle,\" came the grim response, \"and the pigs\u0027re not too far away. Damned horses dragged me a mile an\u0027 more.\"\n Tred didn\u0027t let go, but neither did he start forward.\n \"Come on, ye dolt,\" Nikwillig scolded. \"We got to get to Shallows and get the word spreadin\u0027 back to King Warcrown.\"\n \"Ye run on,\" Tred replied. \"Me leg\u0027s all broke. I\u0027ll slow ye down.\"\n \"Bah, ye\u0027re talking like the fool I always knowed ye was!\"\n Nikwillig gave a great tug, dragging Tred right out from under the brambles.\n \"Bah, yerself!\" Tred growled at him.\n \"And so ye\u0027d be leaving me if it was th\u0027 other way around?\"\n That question hit home. \"Get me a stick, ye stubborn old fool!\"\n Soon after, arm in arm, with Tred leaning on both Nikwillig and a stick, the two hardy dwarves ambled off toward Shallows, already plotting their revenge on the ambushing ore band.\n They didn\u0027t know that another hundred such bands were out of their mountain holes and roaming the countryside.\n When Thibbledorf Pwent and his small army of battleragers arrived in Icewind Dale with news that Gandalug Battlehammer, the First King and Ninth King of Mithral Hall, had died, I knew that Bruenor would have no choice but to return to his ancestral home and take again the mantle of leadership. His duties to the clan would demand no less, and for Bruenor, as with most dwarves, duties to king and clan usurp everything.\n I recognized the sadness on Bruenor\u0027s face as he heard the news, though, and knew that little of it was in grieving for the former king. Gandalug had lived a long and amazing life, more so than any dwarf could ever hope. So while he was sad at losing this ancestor he had barely known, that wasn\u0027t the source of Bruenor\u0027s long look. No, what most troubled Bruenor, I knew, was the duty calling him to return to a settled existence.\n I knew at once that I would accompany him, but I knew, too, that I would not remain for long in the safe confines of Mithral Hall. I am a creature of the road, of adventure. I came to know this after the battle against the drow, when Gandalug was returned to Clan Battlehammer. Finally, it seemed, peace had found our little troupe, but that, I knew so quickly, would prove a double-edged sword.\n And so I found myself sailing the Sword Coast with Captain Deudermont and his pirate-chasing crew aboard Sea Sprite, with Catti-brie at my side.\n It is strange, and somewhat unsettling, to come to the realization that no place will hold me for long, that no \"home\" will ever truly suffice. I wonder if I am running toward something or away from something. Am I driven, as were the misguided Entreri and Ellifain? These questions reverberate within my heart and soul. Why do I feel the need to keep moving? For what am I searching? Acceptance? Some wider reputation that will somehow grant me a renewed assurance that I had chosen well in leaving Menzoberranzan?\n These questions rise up about me, and sometimes bring distress, but it is not a lasting thing. For in looking at them rationally, I understand their ridiculousness.\n With Pwent s arrival in Icewind Dale, the prospect of settling in the security and comforts of Mithral Hall loomed before us all once more, and it is not a life I feel I can accept. My fear was for Catti-brie and the relationship we have forged. How would it change? Would Catti-brie desire to make a home and family of her own? Would she see the return to the dwarven stronghold as a signal that she had reached the end of her adventurous road?\n And if so, then what would that mean for me?\n Thus, we all took the news brought by Pwent with mixed feelings and more than a little trepidation.\n Bruenor\u0027s conflicted attitude didn\u0027t hold for long, though. A young and fiery dwarf named Dagnabbit, one who had been instrumental in freeing Mithral Hall from the duergar those years ago, and son of the famous General Dagna, the esteemed commander of Mithral Hall\u0027s military arm, had accompanied Pwent to Icewind Dale. After Bruenor held a private meeting with Dagnabbit, my friend had come out as full of excitement as I had ever seen him, practically hopping with eagerness to be on the road home. And to the surprise of everyone, Bruenor had immediately put forth a special advisement-not a direct order, but a heavy-handed suggestion-that all of Mithral Hall\u0027s dwarves who had settled beneath the shadows of Kelvin s Cairn in Icewind Dale return with him.\n When I asked Bruenor about this apparent change in attitude, he merely winked and assured me that I\u0027d soon know \"the greatest adventure of my life-no small promise!\n He still won t talk about the specifics, or even the general goal he has in mind, and Dagnabbit is as tight-lipped as my irascible friend.\n But in truth, the specifics are not so important to me. What is important is the assurance that my life will continue to hold adventure, purpose, and goals. That is the secret, I believe. To continually reach higher is to live; to always strive to be a better person or to make the world around you a better place or to enrich your life or the lives of those you love is the secret to that most elusive of goals: a sense of accomplishment.\n For some, that can be achieved by creating order and security or a sense of home. For some, including many dwarves, it can be achieved by the accumulation of wealth or the crafting of a magnificent item.\n For me, I\u0027ll use my scimitars.\n And so my feet were light when again we departed Icewind Dale, a hearty caravan of hundreds of dwarves, a grumbling (but far from miserable) halfling, an adventurous woman, a mighty barbarian warrior, along with his wife and child, and me, a pleasantly misguided dark elf who keeps a panther as a friend.\n Let the snows fall deep, the rain drive down, and the wind buffet my cloak. I care not, for I\u0027ve a road worth walking! \n","sourceLink":"https://allnovel.net/the-thousand-orcs-hunter-s-blades-1/page-1.html","bookId":2140,"book":{"id":2140,"title":"The Thousand Orcs (Hunter\u0027s Blades #1)","description":"Storyline: \n The Thousand Orcs (Hunter\u0027s Blades #1) \n This mass market reprint focuses primarily on his signature character, Drizzt Doourden, who has been the subject of most of Salvatore\u0027s best-selling titles for Wizards of the Coast, Inc. This title includes a sample chapter from the author\u0027s next hardcover, \"The Lone Drow.\" One Dark Elf. Two Enchanted Blades. One Unknown Enemy. And a Horde of Invaders. When a blood-thirsty band of orcs led by an as-yet-unseen enemy comes rampaging out of the Spine of the World, it lays waste to everything in its path. Dark elf ranger Drizzt Do\u0027 Urden and his most trusted friends find themselves in the path of destruction. As blades slash and feet trample, even the heroes may not survive a desperate stand.\n \n","cover":"https://allnovel.net/images/the-thousand-orcs-hunter-s-blades-1.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-thousand-orcs-hunter-s-blades-1.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:15:13 PM"}}
