{"id":73082,"no":16,"title":"Page 16","content":"\n “I’m not sure what you’ve been told of your duties,” she said, “but all I’ll require of you is your presence at every political and social function I attend, to accompany me when other-worlders visit to tell me of their problems and concerns, and to interpret any calls I receive.”\n That’s all, huh?\n “My last interpreter spoke only six languages, so aliens often left my presence frustrated with their inability to communicate with me. Your father mentioned you speak twenty-seven languages.” There was a ring of disbelief in her tone.\n “He didn’t exaggerate, I assure you.”\n Surprise flittered over her refined features, as if she’d expected me to deny it. “How did you manage to learn so many?”\n A female servant arrived with Luc’s water bowl. The girl was alien, a Brin Tio Chi, a race that was dark as mocha and moved with fluid grace, practically floating. She placed the bowl in front of Luc and drifted away like a dream, her white robe wisping at her ankles. The dog drank greedily.\n “A tutor of mine once told me Rakas have an affinity for languages. That all of our kind seem to learn them as easily as human children learn the alphabet.”\n “That’s wonderful.” Grinning, Claudia clasped her hands. “There’s a party we’ll be attending tonight, and I expect many different alien races to be there. Some of them haven’t yet mastered English, so you’ll have to translate for me.”\n The party. I could hardly wait. “That will be my pleasure.”\n She sighed. “Something you need to know about me is that I always mix business with pleasure. I expect many other-worlders to approach me tonight with problems they’ve been having. They know they can come to me anywhere, anytime.”\n My head tilted to the side. “What kind of problems?”\n “Discrimination, mostly. Humans often act superior to their alien counterparts—and jealous when someone they feel is un-deserving has money and power. That’s when I step in. I make sure alien needs are represented in the Senate.”\n A pretty speech. Rehearsed? Or truthful?\n “When Yson—he was my husband—was alive, we traveled the world and witnessed so many atrocities against aliens. We vowed to do what we could to help.” Her face gleamed with sadness. “Then the Zi Karas came over and brought that horrible plague that killed so many humans and animals. Yson was one of the first to die, leaving me to help on my own.”\n “I’d think that would have made you hate all aliens.” I stated the words as an observation, an afterthought. Casual. But I watched her expression intently.\n The fine lines around her eyes seemed to deepen. “For a while, yes, I did hate them. But Yson would not have wanted me to harbor such hatred. He would have wanted me to keep my vow. And so I have.” She waved a hand through the air. “Now enough sadness. Let’s talk about happy things.”\n What a puzzle she was—a puzzle I planned to solve. Whether the pieces would fit together in an innocent or betraying manner, I didn’t know. I only knew I’d have to stay on my guard with her. Michael seemed to trust her (somewhat), but I couldn’t. Not yet.\n We chatted for a few more minutes about the weather, about my food preferences and sleeping habits.\n “Why don’t you go upstairs,” she said. “You can unpack or rest or whatever you need to do before the party.”\n “Where’s the party located?” I asked, unable to keep anticipation from my tone. I already knew the answer.\n “At Jonathan Parker’s estate. He’s wealthy and powerful and a good man to have on your side.” She paused, grinned. “He insisted, absolutely insisted, we attend.”\n I returned her grin with one of my own. “I look forward to meeting him.” And I did. God, I did.\n Chapter 13\n Ispent the next hour searching my new bedroom for bugs and cameras.\n A single dead animal head hung from my “yellow that blends well with my skin” walls. A deer. The rest of the decor was tasteful, if purely Texan. Cowbell chandelier, horseshoes on the walls, wooden bedposts that supported a wheelbarrow-shaped bed. Snakeskin baskets rested on the side tables.\n I found two cameras, but no bugs. The ambassador of alien goodwill had replaced the deer’s eyes with round, black lenses pointed toward the bed. Whether Claudia Chow was simply a pervert who liked to watch, had nefarious reasons for wanting me under surveillance, or wanted the camera here to help “protect” me from gold lovers, I didn’t care. I renewed my determination to be cautious around her. She didn’t know my true purpose for being here, but she was going to get me inside Jonathan’s party. For that I’d endure her creepiness.\n I didn’t care if she knew I’d found the cameras. I openly removed and disabled them. Picture splicing had become common years ago, so the government had made cameras like these illegal without a permit. I doubted she had a permit.\n “Lord save me,” I muttered. I could handle the camera problem one of two ways. Hand the cameras to the ambassador personally with a warning not to place them in my room again, or not mention them at all.\n After a moment’s debate, I decided not to mention them. I’m willing to bet she knew the exact moment I found them. If I kept quiet, she’d wonder about my thoughts, my reaction, and perhaps tread more carefully around me.\n Assured now of my privacy, I began memorizing the layout of the room by sight, then with my eyes closed, learning the spacing between furniture and the length of the floor. Luc watched me curiously the entire time. She even paced beside me for a while before becoming bored and flouncing to the bed.\n A time might come when I needed to navigate this room in the dark, simply to survive. I charted the best escape route, as well as a second in case the first was blocked.\n Afterward, I allowed myself a lingering shower. The dry enzyme spray did not offer the same relaxing sensation as the warm, steamy water at Michael’s, but I enjoyed the feel of clean skin.\n Especially now, knowing I would soon see Lucius. Knowing I would soon meet Jonathan Parker face to face. Knowing a “slave” order would soon be placed for me, and I would be stolen away, perhaps locked underground. Dirty and cold.\n Soon…yes, soon.\n Lucius would be attending Jonathan Parker’s party tonight. I’d see him in person. Talk to him. And I would think only of our case, I vowed. Had he learned anything new about the solar flares? About EenLi? According to Michael, the bastard still had not been spotted. It was like he’d disappeared.\n Maybe he had.\n Maybe, like Romeo, he’d used a solar flare to return home.\n If that proved true, I’d find a way to chase him all the way to Mecca.\n The spray began to sputter, so I shut the unit off and stepped from the white tiled enclosure. Heated air billowed from vents above, beside, and below me to keep me warm until I dressed. I restrapped my weapons onto my body: a small pyre-gun on the inside of my thigh, one knife, and a tiny vial of Onadyn. I never knew which I’d need, so I liked access to all three.\n I decided, though, that I needed something else this time. Something more than my usual arsenal. Just in case. These were new surroundings with people I didn’t know and hadn’t followed. I locked an anklet around my ankle—an anklet that possessed hallucinogens in the shapes of diamonds.\n That done, I slipped the ice-blue sheath dress over my head. The sheer material kissed my breasts and hips, but flared freely around my calves with different lengths of scarves. I left most of my golden hair down, clipping only the sides back and out of the way with sapphire-studded combs—which also doubled as retractable blades.\n “Not bad,” I muttered, studying my reflection in the mirror. Iced gold.\n I’d come to loathe high heels, but I supposed I could tolerate them for tonight. Who knows? If needed, I could use the heels as a weapon. I anchored a strappy pair the exact shade of my dress onto my feet. A little mascara, a swipe of gloss. There. Done.\n Luc barked her approval.\n I checked my computer for a message from Colin. Nothing. I sighed. The wall clock ticked the hour. Five o’clock, two hours before the ambassador and I needed to leave. That gave me plenty of time to question her about Jonathan Parker.\n Claudia, as it turned out, was a certified gossip and more than happy to tell me everything she knew about everyone she’d ever met. Our conversation lasted the entire two hours before she rushed upstairs to change for the party.\n During our chat, I’d learned the following tidbits of information:\n 1. River Garwood preferred homemade beer to expensive champagne, although he did have an excellent wine cellar.\n 2. Norine Smith’s breast augmentation had left her with one breast larger than the other. The woman now wore a one-sided padded bra.\n 3. Jonathan Parker hated peas with a passion that could not be surpassed (perhaps this knowledge could be used if we ever decided to torture him?).\n 4. Gladys MacGregor, who lost all her money to bad investments and everyone knew it, had paid her dentist for her porcelain veneers with a little oral surgery of her own—performed on her knees.\n I brooded over the fact that those were two hours I’d never get back. Not one of my better plans.\n When Claudia rejoined me ten minutes later, she wore a shiny violet sequined dress that hugged her body. It glinted like rich oil in the light. Her hair was wrapped in a matching turban. She looked elegant. Refined.\n “Claudia,” I said as she descended the stairs, “do you mind asking one of your female employees to walk Luc sometime this evening?”\n “Of course.” She eyed her servant, the floating, velvety dark Martha, who nodded. “Martha will see to it. Are you ready?”\n “More than I can say.”\n We climbed inside the limo and made our way to Parker’s. Claudia picked up our conversation as if we’d never left off. Who knew a cozy limo with its black leather and mini-bar could be used as a torture device? I half listened, hoping there’d be information I could use.\n At long last, she mentioned the name Hunter Leonn.Lucius. I perked up and adopted an expression of feigned distress and dismay.Remember, he stalked me. Abused me. An intense rush of impatience and excitement gripped me.\n “Hunter Leonn, did you say?” I asked sharply, jolting forward in my seat.\n “Yes,” she said, blinking over at me. Her features lit with eagerness, and she leaned toward me. “Why? Do you know him?”\n I gave her the same story Lucius had given Jonathan. “He chased me relentlessly. Ruthlessly! Every time I turned, he hovered beside me. I tried to tell him I didn’t like him, that I didn’t want him in my life, but he wouldn’t listen. He refused to leave me alone.”\n “Oh, how awful.”\n “Yes, it was. Hunter is the real reason I moved away from Michael. I wanted so badly to escape him.” I gripped my knees in a show of agitation. “And now you tell me he’s here?”\n “Are you worried he’ll bother you again? Well, don’t be. My home is well guarded, Eden. He won’t be able to reach you.”\n “I thought that before. With Michael. But because I continually told Hunter no, he jerked me off the street one day and into his car. He took me to his house and locked me inside. He almost raped me, and would have, if I hadn’t escaped. What am I going to do?”\n “Oh, my God. I’m so sorry. I didn’t realize the seriousness of the situation.” Features tight with concern, she grabbed my hands. “You must have been so scared, and now you’re finding yourself in the same predicament. I wish we could have him arrested, but—” She sighed with dejection. “Humans simply aren’t punished for hurting aliens. Not yet, anyway.”\n “What if he tries to steal me again?” I asked. I bit my lower lip. Was I laying it on too thick? “I bet he learned I would be living here and decided to move here, too. He’s probably there right now, waiting for me.”\n “I’m sorry to say he will indeed be there, but I don’t think he’ll make a scene. Too many people will be there to act as witnesses.” She squeezed my hand. “Please don’t worry. I won’t let Hunter harm you in any way. That I promise. I’ll talk to Jonathan, and make sure Hunter is kept at a distance from you. All right?”\n Such adamancy from her surprised me. Her perfectly made-up features were bathed in concern and affront, and tension hummed from her body. Authentic distress? For me, an other-worlder? If this was indeed real, such concern for alien safety was probably why this vain, pampered, gossiping woman had been chosen as ambassador of alien goodwill.\n I hadn’t expected this from her. Rarely did someone prove to be more than I’d anticipated. First Lucius, now Claudia. Had I lost my edge?\n “Thank you for your concern,” I told her, letting myself visually calm.\n “I just wish I could do more. Aliens have feelings, just like humans. Why can’t more people see that?”\n “Have you met him? Hunter, I mean?”\n “Once.” She released my hand. Her gaze flicked to the window, and she stared out at the moonlit landscape. We passed Michael’s lush little glen, a dewy and sparkling emerald haven. A total contrast to the dry land everywhere else. “He’s an intimidating fellow, I must say. His eyes are…there’s something about them. They’re dark and cold and so unfeeling.”\n “Yes,” I agreed, shivering. “I remember that about him.” This had worked out so much better than I could have ever planned. “You speak so highly of Jonathan Parker. How can he be friends with such a man?”\n “I’m sure Hunter pretends to be civilized when he’s with other men. Men like him always do. But I can assure you I will tell Jonathan everything, and something will be done.” \n","sourceLink":"https://allnovel.net/enslave-me-sweetly-alien-huntress-2/page-16.html","bookId":1767,"book":{"id":1767,"title":"Enslave Me Sweetly (Alien Huntress #2)","description":"Storyline: \n Enslave Me Sweetly (Alien Huntress #2) \n Eden Black walks among humans, protecting them from the murderous evil of other-worlders who abduct and enslave. And though she appears to be human herself, Eden is an alien, a Raka, distinguished by her golden hair and skin, and gifted with the ominous ability to kill without remorse -- and with total accuracy. That is, until the fateful night she has one shot to eliminate her target, a human slaver -- and misses. \n \"Failure\" is not in Eden\u0027s vocabulary. Neither is \"partner\" -- but that\u0027s what she is forcibly assigned after recovering from her disastrous mission. A sexy, steely-nerved human agent, Lucius Adaire enjoys nothing more than sparking the fury -- and rousing the desire -- of the fiery female assassin too proud to admit defeat. Locked in an assignment they cannot afford to lose, Lucius and Eden find themselves bound in two high-stakes, heart-pounding games: the sensual web of kill or be killed, and the erotic dance of seduction.\n \n","cover":"https://allnovel.net/images/enslave-me-sweetly-alien-huntress-2.jpg","author":"Gena Showalter","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/enslave-me-sweetly-alien-huntress-2.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:26:28 AM"}}
