{"id":73087,"no":21,"title":"Page 21","content":"\\n\\n Finally we reached our destination, a dining room with an antique cherry wood table, benches instead of chairs, and pictures of sunflowers on the walls. No animal heads. The ambassador sat at the table, which was piled high with food. Her black hair was pulled back in another severe twist, and she wore a severe black pantsuit.\\n\\n “Sit, sit,” she said when she spotted me, waving to the chair across from her.\\n\\n I did as she requested. She looked me over and frowned. “Eden, dear, you look tired. Are you still upset about the party?”\\n\\n “A little,” I lied.\\n\\n “Well, stop that right now. I told you I spoke with Jonathan, and he assures me he will see to your safety, as well as to Hunter.”\\n\\n “Thank you. You’ve been wonderful about this whole thing.”\\n\\n “Speaking of wonderful,” she said. She sniffed the air. “What is that heavenly scent you’re wearing?”\\n\\n Feeling hot pink circles consume my cheeks, I shifted uncomfortably in my seat. “I’m, uh, not wearing perfume.”\\n\\n Her brow puckered in confusion. “You have to be. You smell. In a good way,” she rushed to assure me. “Like honey.”\\n\\n “No. No, perfume.”\\n\\n “Oh. Well. Maybe it’s the food.” She swept her hand over the buffet of choices. “Are you hungry?”\\n\\n “A little.” I filled my plate with toast and eggs. There was a bowl of sugar probably meant for the tea, but I sprinkled several heaping spoonfuls over my food. Everything tasted better with sugar.\\n\\n Everything except these eggs, I realized after the first bite. They possessed enough salt to fill an ocean, and even the sugar couldn’t mask it. I managed to choke down a few bites before pushing my plate away.\\n\\n Claudia nibbled on a piece of toast. “Did you get the flowers Jonathan sent you? I think he sent you the rosesand the orchids. He feels terrible about what happened.”\\n\\n Lucius had insisted I find a way to Jonathan’s residence today, so I said, “I’d like to thank him in person, if I may.”\\n\\n Claudia brightened and dropped her toast onto her plate. “That’s a wonderful idea. I’ll call him right now and see if he can fit us in.” She clapped her hand and called, “Martha. Please bring me the phone.”\\n\\n A few seconds latter, Martha floated into the room holding a silver tray. A black cell unit and receiver rested on top. Claudia anchored the earpiece in place and said, “Jonathan Parker.” Pause. She grinned. “Jonathan. This is Claudia Chow. Eden Black and I would like to meet with you—” Her lips pursed, and there was another pause. This one longer. “No. We want to meet with you, not you and Hunter.”\\n\\n “I’ll meet with both of them,” I rushed out.\\n\\n She blinked at me in puzzlement. “But…but…”\\n\\n “I’m eager to get this settled.” I needed to be careful about my eagerness.\\n\\n “Jonathan,” she said into the mouthpiece. “I’ve changed my mind. We’ll meet with both you and Hunter.” Pause. “Yes. Thank you. Until then.” She tossed the unit back onto the tray, and Martha floated out of the room as gracefully as she’d entered. “We’re meeting with them this afternoon, after we make my morning rounds.”\\n\\n “Excellent. Thank you.”\\n\\n Her “rounds,” as it turned out, consisted of door-to-door schmoozefests at other-worlders’ residences. I spent the next four hours interpreting conversations about health care, dietary needs, and Earth currency as Claudia Chow visited with her constituents. I admit, her concern for the aliens of New Dallas impressed me.\\n\\n Finally we were inside the limousine and headed for Jonathan’s house—the moment I had been waiting for. I enjoyed the lush green landscape, the hills on one side of the window and the flat plains on the other that whizzed past the window.\\n\\n “I feel like I haven’t thanked you enough, Claudia, for championing my cause. You really fight for other-worlders, and I commend you.”\\n\\n Her cheeks flushed with pleasure. “I do what I can.”\\n\\n “I’ll be honest,” I said, facing her. “You aren’t what I expected.”\\n\\n She furrowed her brow. “What did you expect?”\\n\\n “Someone who saw other-worlders as a prize, but didn’t actually care for them.”\\n\\n “Aliens are people, too.”\\n\\n “Yes. We are. But not everyone realizes that.”\\n\\n She leaned forward and whispered, “I’m considering dating a Taren, the one who spent a few weeks in an A.I.R. prison for allegedly stealing a dress. He’s asked me out on several occasions, but I’ve always told him no. Any”—she coughed—“advice for me?”\\n\\n I couldn’t picture Claudia with a feline, for that’s what Tarens were. They walked and talked like humans, but their skin was patched with fur and their tongues were abrasive. Some could walk through walls. I’d trailed several over the years, and had seen them do it.\\n\\n “Advice?” I was not the girl to come to for relationship advice. “Hmm. Well. Treat him like you would a human, I guess. And pet him often. Tarens like that.”\\n\\n She nodded, her expression rapt, as if she were soaking up my every word. “Pet him. Yes. Good idea.”\\n\\n “I don’t know what more to tell you,” I admitted. “I’ve never dated a Taren myself.” Tips on killing them, I could give her.\\n\\n Thankfully, our car eased past the tall iron gates of Jonathan’s estate, effectively ending our conversation. I saw the towering mansion, white brick and jagged peaks. The lawn was perfectly manicured, but the grass was sparse. My heartbeat picked up speed—not out of fear, but in anticipation. Even now Lucius waited inside, ready to push our prey further.\\n\\n Several black-clad guards manned the outer walls, I noticed, semiautomatic pyre-rifles strapped to their sides. Interesting. Jonathan had human guards today, rather than aliens.\\n\\n When the car parked in front of the entrance, we emerged in the afternoon heat, strolled over the bridge, and entered the coolness of the house. The French doors were already open, like arms beckoning us inside. We were expected, after all.\\n\\n My gaze collided with one of the guards positioned at the side of the door. Another human. His eyes widened with…awe? Greed? He took an unbidden step toward me, even reached out to touch me, but an older man dressed in a black suit led Claudia and me past him. His arm dropped to his side.\\n\\n We were taken straight to Jonathan’s office, the very office he and Claudia had occupied last night. Lucius was there and seated on a blood red chair, his feet resting on the faux-fur ottoman. He watched me through narrowed eyes, his lips firm and unyielding. I pretended to ignore him, though every cell in my body screamed in awareness.\\n\\n “Thank you for the flowers,” I told Jonathan. “And for agreeing to meet with us.”\\n\\n A muscle in Lucius’s temple ticked.\\n\\n “My pleasure.”Jonathan, seated behind the desk, beckoned Claudia and me to take the green couch across from Lucius. He had a cut lip, I noticed. “I’m so glad you could come,” Jonathan said, his cultured baritone very smooth. He watched me, but I didn’t feelhis gaze boring into me like I did Lucius’s, branding me, making me ache.\\n\\n “This is hard for me.” I cast a dark glare at Lucius. That was the only way I could allow myself to study him. The contacts he wore made his eyes as dark as a midnight, starless sky, but there was a spark inside them I had never seen before. There was a bruise on his left cheek. Had the two men fought? “I’m anxious to have this problem fixed.”\\n\\n “As are we.” Jonathan nodded to Lucius, a silent you-may-begin.\\n\\n “I would never hurt you,” Lucius said to me, speaking for the first time since I’d entered. His rough voice washed over me in sensuous waves.\\n\\n “Is that so? You jerked me off the street. Locked me in your home. Yesterday you jerked me onto the dance floor and wouldn’t let me go.”\\n\\n “I’m sorry for that.” He didn’t sound sorry. In fact, he leered at me. “I was…overcome, seeing you again. But I didn’t hurt you, you have to admit.”\\n\\n I pressed my lips together, admitting nothing.\\n\\n “We’re all civilized adults,” Jonathan said. “And I assure you, Hunter has learned his lesson.”\\n\\n “I want to believe you.” I forced my eyes to fill with tears. “I really do, but do you see the way he’s looking at me? He isn’t sorry. Not really.” I couldn’t accept Hunter’s apology or Jonathan’s assurances because the stage had to be set for my abduction. It had to appear Hunter couldn’t win my affections through conventional means. Later, when I left, he would be able to speak to Jonathan about “buying” me. Jonathan would then speak with EenLi. And EenLi would then come after me. Once I discovered what magnetic device EenLi used to transport his “cattle,” I’d have the pleasure of killing him.\\n\\n Ah, life suddenly seemed so good.\\n\\n “I think…I think I need a moment alone,” I said. I placed a shaky hand over my heart. I’m sure Lucius already searched the house, but I wanted to do my own search. He might have missed something. If there was any information about EenLi, the abducted, about the portals or solar flares, I wanted to know it. “Will you excuse me?”\\n\\n “If you want fresh air, there’s a veranda down the hall. Just off to your right,” Jonathan said.\\n\\n “I won’t be gone long.” I knew Lucius would distract them if I didn’t come back in a timely fashion.\\n\\n This was going to be fun.\\n\\n Chapter 17\\n\\n Of course, I didn’t go to the veranda.\\n\\n For privacy, the guards had been sent away and were no longer inside. Remaining alert, I strode to the first room I came to. Surprisingly, it wasn’t locked. I stepped inside. The scent of bleach and lemon permeated the small, dim space. A cleaning closet, I realized happily. They were often overlooked as inconsequential. I ran my fingertips over several bottles of cleaner as I looked for a trash receptacle.\\n\\n There, in the back. Grinning, I bent over it and riffled through the contents. Dirty napkins, an old pair of shoes. I sighed. People used computers and digital notepads, so paper—rare as it was—was hardly used anymore. Still…a girl could hope.\\n\\n Next, I found a bathroom. It, too, was open. Blue-and-white marble flooring, an antique porcelain tub. Fake plants in every corner. But nothing of importance.\\n\\n The only other room in this hallway was a laundry. Large and wide, the area overflowed with clothes and servants, poles for the material, and dry-spray hoses that ejected the cleaning enzymes. I stood in the doorway, watching the women work for a moment, hoping to catch sight of something of Jonathan’s. Maybe he’d left something in a pocket.\\n\\n Suddenly a thick, hairy male arm reached from behind me and clamped over my mouth. I was pulled into a hard body, and it wasn’t Lucius’s. The scent was different, not as clean. The feel was different, not as muscled and hot.\\n\\n The man kicked my knees, and I buckled to the floor. I winced, but I didn’t fight. Not yet. Not until I knew what was going on. Had Jonathan already contacted EenLi? Was this my abduction?\\n\\n “I’ve got her,” a deep male voice whispered.\\n\\n “Hurry,” another man said, his voice frantic. “Before someone sees us.”\\n\\n They dragged me outside, and I glanced up, squinting past the intense light. My abductors were human and dressed entirely in black, guns strapped to their sides. Jonathan’s guards, I realized. In fact, the one holding me was the man I’d seen positioned at the front door when I first arrived. Excitement at last sparked in my veins. This had to be it! I hadn’t expected him to act so quickly.\\n\\n “Be careful with her. Don’t damage her skin. Don’t pull her hair too hard.”\\n\\n “Will you shut up? I’m doing the best I can. We’ve got to hurry, or we’ll be seen.”\\n\\n The man who held me by the hair cast me an evil, greedy smile. “We’re gonna sell your skin and hair for a fortune, pretty girl.” He jolted into motion, hefting me up by the waist and carting me away from the house. The other man followed quickly behind us, tossing nervous glances over his shoulder.\\n\\n They weren’t here to abduct me. They were here to de-skin me!\\n\\n Cold, haunting fury replaced my excitement. The bastards wanted to flay the gold skin right off my body. Sell it. Hurt me unmercifully. My fury intensified with every step my tormentor made, but I didn’t utter a sound of protest. Alien voice was as incriminating as human DNA or fingerprints. That was why A.I.R. had strategically placed high-frequency recorders and satellites all across the globe. If an alien was ever implicated in a crime, his voice was logged into a database, then used to trace his whereabouts.\\n\\n I doubted my name was located in any of the databases—Michael would have seen to that—but I couldn’t risk it.\\n\\n I didn’t want to be linked to the slaughter about to happen.\\n\\n My captor squeezed me even tighter, almost cutting off my air. Once we reached a cluster of thick bushes that hid us from view of the house, I tangled my feet in his legs, tripping him. As we fell, I twisted toward him and slammed my palm into his nose. He hit the ground, collapsing on top of me and howling in pain.\\n\\n Gasping for breath, I rolled out from under him, already jumping into position to attack the second man. I crouched and lashed out with one leg, sweeping both of his feet off the ground. He flailed midair, then landed with such a loud thud, I wouldn’t have been surprised if he cracked his skull. As he lay there moaning, I sprang up, whipped the knife from his waist-band—the very knife he’d planned to use to peel away my skin—and slit his throat.\\n\\n He gurgled, became silent. \\n\\n","sourceLink":"https://allnovel.net/enslave-me-sweetly-alien-huntress-2/page-21.html","bookId":1767,"book":{"id":1767,"title":"Enslave Me Sweetly (Alien Huntress #2)","description":"Storyline: Enslave Me Sweetly (Alien Huntress #2) \\n Eden Black walks among humans, protecting them from the murderous evil of other-worlders who abduct and enslave. And though she appears to be human herself, Eden is an alien, a Raka, distinguished by her golden hair and skin, and gifted with the ominous ability to kill without remorse -- and with total accuracy. That is, until the fateful night she has one shot to eliminate her target, a human slaver -- and misses. \\n \"Failure\" is not in Eden\u0027s vocabulary. Neither is \"partner\" -- but that\u0027s what she is forcibly assigned after recovering from her disastrous mission. A sexy, steely-nerved human agent, Lucius Adaire enjoys nothing more than sparking the fury -- and rousing the desire -- of the fiery female assassin too proud to admit defeat. Locked in an assignment they cannot afford to lose, Lucius and Eden find themselves bound in two high-stakes, heart-pounding games: the sensual web of kill or be killed, and the erotic dance of seduction.\\n","cover":"https://allnovel.net/images/enslave-me-sweetly-alien-huntress-2.jpg","author":"Gena Showalter","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/enslave-me-sweetly-alien-huntress-2.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:26:28 AM"}}
