{"id":73097,"no":31,"title":"Page 31","content":"\\n\\n “Don’t be this way, Eden.”\\n\\n “One.”\\n\\n “Please. Just let it go.”\\n\\n “Two.”\\n\\n “Why are you doing this?”\\n\\n “Thre—”\\n\\n “Fine.” Michael’s lips thinned, but he nodded stiffly. “I’ll take you to New Dallas. I’ll send you straight into the heart of danger alone.” He knew I never made empty threats. “Just don’t cry foul when I send my guys after you. You’ve been warned.” Motions stiff, he punched a button on the side of his headset, switching his communication link to the pilot.\\n\\n When he returned the link to me, I said, “Give me the map to the house where I was held.”\\n\\n He did, and a little while later we landed in New Dallas. I hurriedly changed into the standard agent attire Michael had brought me—black pants, shirt, boots, and weapons, lots and lots of weapons—then stole a black duffel bag loaded with even more weapons and necessities from the hovercraft.\\n\\n I left the private airstrip on foot without another word to or from Michael. The moment I was out of hearing distance, I knew he commanded two of his men to dog my steps. Toprotect me, I thought, scowling.\\n\\n When it came to EenLi, they’d do more harm than good. Alert him, perhaps. Frighten him away.\\n\\n Feigning nonchalance, I drew the men into a darkened alley. Unfortunately, the pyre-gun in my bag only stunned and immobilized other-worlders. Fortunately, the bag also held a new prototype for a human pyre-gun. I’d practiced using the weapon only once before, and now prayed I didn’t accidentally fry up Michael’s men like a Fourth of July barbecue.\\n\\n When they sneaked their way into the alley, I aimed and fired. A thin red beam erupted, freezing the first man in place. The second drew his gun, but I’d already shifted my aim. I squeezed the trigger, emitting another thin red beam. It hit him dead center in the chest.\\n\\n “Sorry, boys,” I said, pushing their frozen bodies into the shadows. I turned on their cell units so Michael could track them when they didn’t check in.\\n\\n Alone now, I entered a busy street lined with cars. I picked the most expensive and heavily secured because I knew how to reprogram it. Luck was on my side. The black luxury sedan was covered in shadows. Kneeling down, I opened my duffel bag. After withdrawing the proper tools, I used a mini wire cutter to rearrange the ID pad, then inserted a new control chip. Standard issue. The driver’s-side door opened automatically. I then reprogrammed the command unit to my specifications, and the car roared to life.\\n\\n Quick.Easy.\\n\\n I followed the map Michael had given me and drove within a mile of the house, unwilling to risk hidden cameras and security by stopping too close. I parked the car in a thicket of trees and emerged. I didn’t bother with the duffel bag. Everything I needed was strapped to me.\\n\\n Weighed down as I was with weapons, I had to move slowly through the forest. Slivers of moonlight guided me. Too bad the air was warm and dry.\\n\\n Finally, the old house came into view. It appeared like an average home—well kept, gray stone. Not too big. A rush of emotions overtook me: fury, hope, dread. For an instant, I flashed back to the first mission that had brought me to EenLi. I’d gone in alone then, too. I’d also failed. But I wouldn’t fail now. Too much was at stake.\\n\\n Though the lights were out, making the isolated residence appear empty, I didn’t relax my guard. My gaze constantly soaked in the details of my surroundings. It wouldn’t do to trip a wire or motion detector and alert the inhabitants of my approach.\\n\\n Pyre-gun in one hand, blade in the other, I entered the house. No alarm sounded. I moved through the shadows, searching every room, every corner—even the dungeon. The sentinels were gone; the women were gone.\\n\\n Lucius was gone.\\n\\n “Damn it,” I snarled. I leaned against a corner wall in the living room—the very place my auction had been held—staring down at the blood dried on the carpet. Lucius’s blood. There was a large pool of it that blended with Jonathan’s, making the air reek with a metallic tang.\\n\\n Where was Lucius? Where had the women been taken?\\n\\n Think, Eden, think.Where would EenLi have gone from here? Most likely the same place he’d been hiding all these many weeks—a place we had been unable to discover.\\n\\n A board creaked.\\n\\n My hands clenched around my weapons. Instinctively I sank deeper into the shadows and slowly turned to find the source of the noise.\\n\\n “Eden,” a familiar male voice said. “I know you’re there. I can smell your woman’s scent.”\\n\\n My mouth pulled in a scowl. I didn’t relax my hold on the gun. “How did you get here so quickly, Targon? I had to take a hovercraft.”\\n\\n “I knew where to land.” He entered the living room completely. Moonlight flooded through the far window and bathed him in light. “You won’t find anyone here.”\\n\\n “I know.” I, too, abandoned the shadows as I reholstered the pyre-gun. “Do you know where EenLi is?”\\n\\n He grinned, a familiar expression of smugness. “Of course I know where he is. I am his best customer.”\\n\\n I stepped toward him. “You swore to help me, and I’m holding you to your word. Take me to him.”\\n\\n His grin widened, stretching across his entire face. So handsome. So in need of a beating. “You also promised me one night. We failed to work out a few details, though. Like who would get their reward first.”\\n\\n So, he wanted to rebargain. I pretended to soften, to sink into his body. His arms instantly wrapped around me. I let my blade slide past my wrist cuff until my fingers circled the handle, and then I inched the sharp edge toward his penis. “By all means, let’s rebargain.”\\n\\n “Ah, Eden, you are so predictable. If you’ll notice, I’m wearing a metal shield this time.”\\n\\n I scowled as I sheathed the knife. Intimidation wouldn’t work with this man, this sex fiend. “Will you help me for a kiss?”\\n\\n “Just one?”\\n\\n “With tongue,” I snapped.\\n\\n “Now?”\\n\\n “Now.” I stood on my tiptoes, but let him come to me.\\n\\n “Deal.” Slowly, so slowly, he lowered his head. Our lips met, soft and gentle. He didn’t give me his tongue. No, he made me give him mine. I cupped his cheeks and angled his head, then swept my tongue into his mouth.\\n\\n His arms locked around my waist, holding me captive in his embrace. He tasted hot and virile. He was strong; he was all man. But he wasn’t Lucius, and he didn’t make me burn for more.\\n\\n He pulled from me with regret and trailed his fingertip over the seam of my lips. “I must be losing my touch.”\\n\\n “EenLi,” I prompted.\\n\\n “He is at his warehouse, and if your human is alive he will be at the warehouse, too, soon to be sold as a slave.”\\n\\n Frowning, I shook my head. “They are not at the warehouse. We have control of it.”\\n\\n “Yes, I heard about that. Too bad you didn’t seize his other one.”\\n\\n Breath whooshed out of my lungs. I’d never thought, not once, that EenLi might have another warehouse. I felt stupid; I wanted to scream. And dance. This was it; I was at last on the right course. “Where is it?” My voice was raw, hoarse with emotion.\\n\\n Devyn sighed, and his warm breath fanned my cheek. “Why, next door to the first. Isn’t that the way of it? Hide under your enemies’ nose, and they’ll never find you? There’s a big sale tonight, a sale I originally planned to attend.”\\n\\n Yes, this was it. I practically hummed with the force of my fervor. “I need you to take me to that sale.”\\n\\n “And I need you to promise me another kiss.”\\n\\n I didn’t hesitate. “Done.”\\n\\n “I love bargaining with you, sweet.” He leaned down until his lips brushed my ear. “But you know what? I would have taken you to the sale,” he said, drawing out the words and giving them a proper Texas accent, “for free.”\\n\\n Chapter 27\\n\\n Devyn kept a car in this world, so I left the one I’d stolen and climbed into his—a sleek red Jaguar parked in back of the home. As we drove to EenLi’s second warehouse, my stomach tightened and my blood heated. Soft classical music poured from the speakers, which surprised me. I’d expected Devyn to like gyrating rock, fast and hard, the way he wanted his sex.\\n\\n Minutes dragged by as we sped down the highway.\\n\\n More minutes dragged by.\\n\\n Even more passed without a word.\\n\\n “What did you think of my kiss?” he asked me. I think he asked just to cut through the silence. Maybe to relieve my tension.\\n\\n “It was…good.”\\n\\n “Good? Good!” His amber eyes gleamed with affront. “I expect to hear words likemagnificent. Wondrous. Unequalled. Notgood. ”\\n\\n “It was missing something, okay? Don’t be a baby.”\\n\\n “It was missing nothing.”\\n\\n I pinched the bridge of my nose. “Mind if I give you a piece of advice, Devyn?”\\n\\n “Yes.” He still sounded offended. “I do mind.”\\n\\n “Don’t force your way into a woman’s life. The kiss would have been a whole lot better if I’d wanted to give it to you.”\\n\\n “There would not have been a kiss if I hadn’t pushed you for it.” He shifted in his seat. “You will not think I am missing something when we have our night together.”\\n\\n I gave no reply. I didn’t know what to say, really. I’d give him his night because I’d promised it to him. That didn’t mean I’d enjoy it or be an eager participant.\\n\\n At last we reached our destination. We slowed, then stopped altogether. There was a long, long line of cars ahead of us, awaiting the valet, I supposed. Facing the window, I cast my gaze to the dusty, spacious warehouse. A crowd of people, other-worlder and human combined, ambled inside, nearly busting the building at its seams.\\n\\n “We have the other warehouse under surveillance. Why aren’t agents all over this place?”\\n\\n “Your surveillance cameras are easily rigged. Isn’t that the reason they were outlawed without license?”\\n\\n My lips dipped in a frown, and I tangled a hand through my hair. “All right. This is what we’re going to do,” I told Devyn on a sigh. “When we get inside, I want you to pretend to be eager to take part in the auction. I also want you to pretend to be my master.”\\n\\n “Pretend?” He caressed his thick fingers over the program box and grinned at me.\\n\\n “Yes, damn it. Pretend,” I said, purposefully mistaking his meaning. “You can act, can’t you?” The car eased forward a bit.\\n\\n “Oh, I know I can. But can you? You will have to act the part of my slave.”\\n\\n His enjoyment irritated me. “I will.” I hated to rely on him so much, but it couldn’t be helped. I couldn’t do this without him, and we both knew it. Not successfully, at least. First Lucius, now Devyn. I’d always been a woman who prided myself on getting the job done right all on my own. Admitting I needed help left a bitter taste in my mouth. Right now I was too concerned with saving the man I loved to give a shit.\\n\\n Loved?\\n\\n I almost groaned. I did, I realized. I loved him. Somehow, during this mission, he’d become everything to me. He was smart, resourceful. Intense. Sarcastic. He was everything I’d needed in my life, but hadn’t known until just now.\\n\\n The car moved another inch. “Once Lucius and the others are safe, I’ll need you to get me close to EenLi. He will be here tonight, won’t he?”\\n\\n “He has attended every auction in the past, so I expect him to be at this one. Are you going to kill him?”\\n\\n “Yes,” I answered without hesitation, relish dripping from my tone.\\n\\n Devyn’s head tilted to the side as he considered my words. “I do not think I want him dead.”\\n\\n “Why the hell not? He’s evil.”\\n\\n “Yes, but he supplies my women.”\\n\\n I rolled my eyes. “Why do you enslave women like that? You’re a handsome man. Females of every race would willingly come to you if you only asked.”\\n\\n One of his brows arched. “You wouldn’t. Youdidn’t. ”\\n\\n Good point. “I’m an exception to the rule.”\\n\\n “Not for long,” he said cockily. As he spoke, he reached over and traced a fingertip over my thigh. His skin was callused and surprisingly cool, a sweet contrast to the heat outside.\\n\\n “Get your hand off me before you don’t have a hand to remove. Your night hasn’t started yet.”\\n\\n His mouth stretched wide in a grin, but he did as I’d asked and removed his hand. “Touchy, touchy. You should be rejoicing, little Raka. One day soon, if not this very night, you’re going to be lying in my arms. Where is your joy? Your words of thanks?”\\n\\n “Your other women got to scratch you and draw your blood. That’s the only thought giving me joy right now.”\\n\\n “Silly woman.” His grin slowly faded. His expression became deadly serious. Gone was the man of easy humor, and in his place was the king of Targon. I didn’t know what had brought about the change, but I could guess. He’d actually begun to enjoy the intrigue and danger of this mission, and he wanted to win.\\n\\n “When we get inside,” he said, his tone as cool as his touch had been, “you need to walk two steps behind me. You will sit at my feet when I take a chair.” His gaze flicked over my black pants and shirt. “You’ll need something sexier to wear. I would never bring my slave out in public like that. What happened to your pink clothing?”\\n\\n “I trashed it. And I have nothing else to wear.”\\n\\n “Then strip,” he said, as if it was a perfectly natural thing to demand of me.\\n\\n Scowling, I ripped off my shirt and threw the material in the back seat, leaving me in my bra. It was black, not particularly sexy, but it did showcase my golden skin in a nice way. Several blade handles poked above the waist of my pants. Without the shirt, my guns were also visible. I had to remove most of them. \\n\\n","sourceLink":"https://allnovel.net/enslave-me-sweetly-alien-huntress-2/page-31.html","bookId":1767,"book":{"id":1767,"title":"Enslave Me Sweetly (Alien Huntress #2)","description":"Storyline: Enslave Me Sweetly (Alien Huntress #2) \\n Eden Black walks among humans, protecting them from the murderous evil of other-worlders who abduct and enslave. And though she appears to be human herself, Eden is an alien, a Raka, distinguished by her golden hair and skin, and gifted with the ominous ability to kill without remorse -- and with total accuracy. That is, until the fateful night she has one shot to eliminate her target, a human slaver -- and misses. \\n \"Failure\" is not in Eden\u0027s vocabulary. Neither is \"partner\" -- but that\u0027s what she is forcibly assigned after recovering from her disastrous mission. A sexy, steely-nerved human agent, Lucius Adaire enjoys nothing more than sparking the fury -- and rousing the desire -- of the fiery female assassin too proud to admit defeat. Locked in an assignment they cannot afford to lose, Lucius and Eden find themselves bound in two high-stakes, heart-pounding games: the sensual web of kill or be killed, and the erotic dance of seduction.\\n","cover":"https://allnovel.net/images/enslave-me-sweetly-alien-huntress-2.jpg","author":"Gena Showalter","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/enslave-me-sweetly-alien-huntress-2.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:26:28 AM"}}
