{"id":67612,"no":2,"title":"Page 2","content":"On one wall is tacked a small wooden cross with the figure of a man suspended in its middle. I recognize the symbol—it’s a cross from one of the old religions, from the time before the cure, although I can’t remember which one now. I have a sudden flashback to junior-year American history and Mrs. Dernler glaring at us from behind her enormous glasses, jabbing the open textbook with her finger, saying, “You see? You see? These old religions, stained everywhere with love. They reeked of deliria; they bled it.” And of course at the time it seemed terrible, and true. Love, the deadliest of all deadly things. Love, it kills you. Alex. Both when you have it… Alex. And when you don’t. Alex. “You were half-dead when we found you,” the black-haired girl says matter-of-factly as she re-enters the room. She’s holding an earthenware bowl with both hands, carefully. “More than half. We didn’t think you were going to make it. I thought we should at least try.” She gives me a doubtful look, as though she’s not sure I’ve been worth the effort, and for a moment I think of my cousin Jenny, the way she used to stand with her hands on her hips, scrutinizing me, and I have to close my eyes quickly to keep all of it from rushing back—the flood of images, memories, from a life that is now dead. “Thank you,” I say. She shrugs, but says, “You’re welcome,” and seems to mean it. She draws the wooden chair to the side of the bed and sits. Her hair is long and knotted above her left ear. Behind it, she has the mark of the procedure—a three-pronged scar—just like Alex did. But she cannot be cured; she is here, on the other side of the fence: an Invalid. I try to sit up all the way but have to lean back after only a few seconds of struggle, exhausted. I feel like a puppet halfway come to life. There’s a searing pain behind my eyes, too, and when I look down I see my skin is still crisscrossed with a web of cuts and scrapes and scratches, insect bites and scabs. The bowl the girl is holding is full of mostly clear broth, tinged with just a bit of green. She starts to pass it to me, then hesitates. “Can you hold it?” “Of course I can hold it,” I say, more sharply than I’d meant to. The bowl is heavier than I thought it would be. I have trouble lifting it to my mouth, but I do, finally. My throat feels as raw as sandpaper and the broth is heaven against it, and even though it has a weird mossy aftertaste, I find myself gulping and slurping down the whole bowl. “Slowly,” the girl says, but I can’t stop. Suddenly hunger yawns open inside me, black and endless and all-consuming. As soon as the broth is gone I’m desperate for more, even though my stomach starts cramping right away. “You’ll make yourself sick,” the girl says, shaking her head, and takes the empty bowl from me. “Is there any more?” I croak. “In a little while,” she says. “Please.” The hunger is a snake; it is lashing at the pit of my stomach, eating me from the inside out. She sighs, stands, and disappears through the darkened doorway. I think I hear a crescendo in the hallway voices, a swelling of sound. Then, abruptly, silence. The black-haired girl returns with a second bowl of broth. I take it from her and she sits again, drawing her knees up to her chest, like a kid would. Her knees are bony and brown. “So,” she says, “where did you cross from?” When I hesitate, she says, “That’s okay. You don’t have to talk about it if you don’t want to.” “No, no. It’s fine.” I sip from this bowl of broth more slowly, savoring its strange, earthy quality: as though it has been stewed with stones. For all I know, it has been. Alex told me once that Invalids—the people who live in the Wilds—have learned to make do with only the barest provisions. “I came over from Portland.” Too soon the bowl is empty again, even though the snake in my stomach is still lashing. “Where are we now?” “A few miles east of Rochester,” she says. “Rochester, New Hampshire?” I ask. She smirks. “Yup. You must have been hoofing it. How long were you out on your own?” “I don’t know.” I rest my head against the wall. Rochester, New Hampshire. I must have looped around the northern border when I was lost in the Wilds: I’ve ended up sixty miles southwest of Portland. I’m exhausted again, even though I’ve been sleeping for days. “I lost track of time.” “Pretty ballsy of you,” she says. I’m not really sure what “ballsy” means, but I can guess. “How did you cross?” “It wasn’t—it wasn’t just me,” I say, and the snake lashes, seizes up. “I mean, it wasn’t supposed to be just me.” “You were with somebody else?” She’s staring at me penetratingly again, her eyes almost as dark as her hair. “A friend?” I don’t know how to correct her. My best friend. My boy-friend. My love. I’m still not totally comfortable with that word, and it seems almost sacrilegious, so instead I just nod. “What happened?” she asks, a little more softly. “He—he didn’t make it.” Her eyes flash with understanding when I say “he”: If we were coming from Portland together, from a place of segregation, we must have been more than just friends. Thankfully she doesn’t push it. “We made it all the way to the border fence. But then the regulators and the guards…” The pain in my stomach intensifies. “There were too many of them.” She stands abruptly and retrieves one of the water-spotted tin buckets from the corner, places it next to the bed, and sits again. “We heard rumors,” she says shortly. “Stories of a big escape in Portland, lots of police involvement, a big cover-up.” “So you know about it?” I try once again to sit up all the way, but the cramping doubles me back against the wall. “Are they saying what happened to … to my friend?” I ask the question even though I know. Of course I know. I saw him standing there, covered in blood, as they descended on him, swarmed him, like the black ants in my dream. The girl doesn’t answer, just folds her mouth into a tight line and shakes her head. She doesn’t have to say anything else—her meaning is clear. It’s written in the pity on her face. The snake uncoils fully and begins thrashing. I close my eyes. Alex, Alex, Alex: my reason for everything, my new life, the promise of something better—gone, blown away into ash. Nothing will ever be okay again. “I was hoping…” I let out a little gasp as that terrible, lashing thing in my stomach comes riding toward my throat on a surge of sickness. She sighs again and I hear her stand up, scrape the chair away from the bed. “I think—” I can barely force the words out; I’m trying to swallow back the nausea. “I think I’m going to—” And then I’m tipping over the bed, throwing up into the bucket she has placed beside me, my body gripped by waves of sickness. “I knew you would make yourself sick,” the girl says, shaking her head. Then she disappears into the dark hallway. A second later, she pops her head back into the room. “I’m Raven, by the way.” “Lena,” I say, and the word brings with it a new round of vomiting. “Lena,” she repeats. She raps on the wall once with her knuckles. “Welcome to the Wilds.” Then she disappears, and I am left with the bucket. Later in the afternoon, Raven reappears, and I again try the broth. This time I sip slowly and manage to keep it down. I’m still so weak I can barely lift the bowl to my lips, and Raven has to help me. I should be embarrassed, but I can’t feel anything: Once the nausea subsides it is replaced by a numbness so complete it is like sinking under ice water. “Good,” Raven says approvingly after I’ve made it through half the broth. She takes the bowl and disappears again. Now that I’m awake, and conscious, all I want is to sleep again. At least when I’m sleeping I can dream myself back to Alex, can dream myself into a different world. Here, in this world, I have nothing: no family, no home, no place to go. Alex is gone. By now even my identity will have been Invalidated. I can’t even cry. My insides have been turned to dust. I think over and over of that final moment, when I turned and saw him standing behind that wall of smoke. In my head I try and reach back, through the fence, past the smoke; I try and grab his hand and pull. Alex, come back. There is nothing to do but sink. The hours close around me, encase me completely. A bit later I hear scuffling footsteps, and then echoes of laughter and conversation. This, at least, gives me something to focus on. I try to differentiate the voices, take a guess at how many speakers there are, but the best I can do is separate out a few low tones (men, boys) and some high-pitched giggling, the occasional burst of laughter. Once I hear Raven cry out, “All right, all right,” but for the most part, the voices are waves of sound, tones only, like a distant song. Of course it makes sense that girls and boys would be sharing a house in the Wilds—that’s the whole point, after all: freedom to choose, freedom to be around one another, freedom to look and touch and love one another—but the idea is very different from the reality, and I can’t help but start to panic a little. Alex is the only boy I’ve ever known or really spoken to. I don’t like to think of all those male strangers, just on the other side of the stone wall, with their baritone voices and their snorts of laughter. Before I met Alex, I lived almost eighteen years believing fully in the system, believing 100 percent that love was a disease, that we must protect ourselves, that girls and boys must stay rigorously separate to prevent contagion. Looks, glances, touches, hugs—all of it carried the risk of contamination. And even though being with Alex changed me, you don’t shake loose the fear all at once. You can’t. I close my eyes, breathe deeply, again try and force myself down through layers of consciousness, to let myself be carried away by sleep. “All right, Blue. Out of here. Bedtime.” I snap my eyes open. A girl, probably six or seven, has been standing in the doorway, watching me. She’s thin and very tan, wearing dirty jean shorts and a cotton sweater about fourteen sizes too big for her—so big it is slipping off her shoulders, showing shoulder blades as peaked as bird wings. Her hair is dirty blond, falling almost all the way to her waist, and she isn’t wearing any shoes. Raven is trying to maneuver around her, carrying a plate. “I’m not tired,” the girl says, keeping her eyes locked on me. She hops around from foot to foot but won’t come any farther into the room. Her eyes are a startling shade of blue, a vivid sky color. “No arguing,” Raven says, bumping Blue playfully with her hip as she passes. “Out.” “But—” “What’s rule number one, Blue?” Raven’s voice turns sterner. Blue brings her thumb to her mouth, rips at her thumbnail. “Listen to Raven,” she mumbles.","sourceLink":"https://allnovel.net/pandemonium-delirium-2/page-2.html","bookId":1717,"book":{"id":1717,"title":"Pandemonium (Delirium #2)","description":"Storyline: Pandemonium (Delirium #2) I’m pushing aside the memory of my nightmare, pushing aside thoughts of Alex, pushing aside thoughts of Hana and my old school, push, push, push, like Raven taught me to do. The old life is dead. But the old Lena is dead too. I buried her. I left her beyond a fence, behind a wall of smoke and flame. Lauren Oliver delivers an electrifying follow-up to her acclaimed New York Times bestseller, Delirium. This riveting, brilliant novel crackles with the fire of fierce defiance, forbidden romance, and the sparks of a revolution about to ignite.","cover":"https://allnovel.net/images/pandemonium-delirium-2.jpg","author":"Lauren Oliver","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/pandemonium-delirium-2.html","creation":"Oct 5, 2019 8:57:53 AM","modification":"Oct 5, 2019 10:04:44 AM"}}
