{"id":67616,"no":6,"title":"Page 6","content":"I manage to nod. “This was a school.” She gestures to another enormous area of low growth, roughly the shape of a rectangle. The trees around its perimeter are marked from the fire: seared white, and practically leafless, they remind me of tall, spindly ghosts. “Some of the lockers were just sitting there, hanging open. Some of them had clothes in them and stuff.” She looks momentarily guilty, and then it hits me—the clothing in the storage room, the pants and shirt I am wearing—all of those clothes must have come from somewhere, must have been scavenged. “Stop for a second.” I’m feeling out of breath, and so we stand for a moment in front of the old school while I rest. We’re in a patch of sunshine, and I’m grateful for the warmth. Birds twitter and zip overhead, small, quick shadows against the sky. Distantly I can make out sounds of good-natured shouting and laughter, Invalids tromping through the woods. The air is full of whirling, floating golden-green leaves. A squirrel sits back on its haunches, working a nut quickly between its paws, on the top step of what must have been an entrance to the school. Now the stairs run aground, into soft earth and a covering of wildflowers. I think of all the feet that must have stepped right there, where the squirrel is. I think of all the small, warm hands spinning out locker combinations, all the voices, the rush and patter of movement. I think of what it must have been like during the blitz—the panic, the screaming, the running, the fire. In school we always learned that the blitz, the cleansing, was quick. We saw footage of pilots waving from their cockpits as bombs dropped on a distant carpet of green, trees so small they looked like toys, narrow plumes of smoke rising, featherlike, from the growth. No mess, no pain, no sounds of screaming. Just a whole population—the people who had resisted and stayed, who refused to move into the approved and bordered places, the nonbelievers and the contaminated—deleted all at once, quick as the stroke of a keyboard, turned into a dream. But of course it wouldn’t really have been like that. It couldn’t have been. The lockers were still full: of course. The children wouldn’t have had time to do anything but fight and claw for the exits. Some of them—very few—may have escaped and made their home in the Wilds, but most of them died. Our teachers told us the truth, at least, about that. I close my eyes, feel myself swaying on my feet. “Are you okay?” Sarah asks. She puts her hand on my back. “We can turn around.” “I’m okay.” I open my eyes. We’ve only gone a few hundred feet. Most of the old main street still stretches in front of us, and I’m determined to see all of it. We walk even slower now, as Sarah points out the empty spaces and broken foundations where buildings must once have existed: a restaurant (“a pizza restaurant—that’s where we got the stove”); a deli (“you can still see the sign—see? Kind of buried over there? ‘Sandwiches made to order’”); a grocery store. The grocery store seems to depress Sarah. Here the ground is churned up, the grass even newer than everywhere else; the site of years and years of digging. “For a long time we kept finding things to eat, buried all around here. Cans of food, you know, and even some packaged stuff that made it through the fires.” She sighs, looks wistful. “It’s all gone now, though.” We walk on. Another restaurant, marked by an enormous metal counter, and two metal-backed chairs sitting side by side in a solid square of sunlight; a hardware store (“saved our lives plenty of times”). Next to the hardware store is an old bank: here, too, there are stairs that disappear into the earth, a yawning mouth cut into the ground. The dark-haired boy—the glarer—is just emerging into the sunshine. He has a rifle slung casually over one shoulder. “Hey, Tack,” Sarah says shyly. He ruffles her hair as he passes. “Boys only,” he says. “You know that.” “I know, I know.” She rolls her eyes. “I’m just showing Lena around. That’s where the boys sleep,” Sarah explains to me. So even the Invalids have not entirely done away with segregation. This small piece of normalcy—of familiarity—is a relief. Tack’s eyes click to me, and he frowns. “Hi.” My voice comes out as a squeak. I try, unsuccessfully, to smile. He’s very tall and, like everyone else in the Wilds, thin; but his forearms are roped with muscle, and his jaw is square and strong. He, too, has a procedural mark, a three-pronged scar behind his left ear. I wonder if it is a fake, like Alex’s was; or whether, perhaps, the cure didn’t work on him. “Just stay out of the vaults.” The words are directed at Sarah, but he keeps his eyes locked on me. They are cold, appraising. “We will,” Sarah says. As he stalks away, she whispers to me, “He’s like that with everyone.” “I can see what Raven means about the attitude problem.” “Don’t feel bad, though. I mean, you can’t take it personally.” “I won’t,” I say, but the truth is that the brief encounter has shaken me. Everything is wrong here, upside down and inverted: the door frames that open into air, invisible structures—buildings, signposts, streets, still casting the shadow of the past over everything. I can feel them, can hear the rush of hundreds of feet, can hear old laughter running underneath the birdsong: a place built of memory and echo. I am suddenly exhausted. We have made it only halfway down the old street, but my earlier resolution to walk the whole area now seems absurd. The brightness of the sun, the air and space around me—all of it feels disorienting. I turn around—too quickly, clumsily—and trip over a slab of limestone spattered in bird shit; for one second I am in free fall and then I’m landing, hard, facedown in the dirt. “Lena!” Sarah is next to me in a second, helping to pull me to my feet. I’ve bitten down on my tongue and my mouth tastes like metal. “Are you okay?” “Just give me a second,” I say, gasping a little. I sit back on the limestone. Something occurs to me: I don’t even know what day it is, what month. “What’s today’s date?” I ask Sarah. “August twenty-seventh,” she answers, still looking at me with her face all creased up, worried. But she’s keeping her distance. August 27. I left Portland on August 21. I’ve lost almost a week in the Wilds, in this upside-down place. This is not my world. My world is unfolding miles away: a world of doors that lead to rooms, and clean white walls, and the quiet hum of refrigerators; a world of carefully plotted streets, and pavement that is not full of fissures. Another pang shoots through me. In less than a month, Hana will have her procedure. Alex was the one who understood things here. He could have built up this collapsed street for me, turned it into a place of sense and order. He was going to lead me through the wilderness. With him, I would have been okay. “Can I get you anything?” Sarah’s voice is uncertain. “I’ll be all right.” I can barely force the words out, past the pain. “It’s just the food. Not used to it.” I’m going to be sick again. I duck my head between my knees, coughing to force down the sob that shudders through me. Sarah must know, though, because she says, in the quietest voice, “You get used to it after a while.” I get the sense she’s talking about more than the breakfast. After that there is nothing to do but make our way back: down the bombed-out road, through the shards, metal glittering in the high grass like snakes lying in wait. Grief is like sinking, like being buried. I am in water the tawny color of kicked-up dirt. Every breath is full of choking. There is nothing to hold on to, no sides, no way to claw myself up. There is nothing to do but let go. Let go. Feel the weight all around you, feel the squeezing of your lungs, the slow, low pressure. Let yourself go deeper. There is nothing but bottom. There is nothing but the taste of metal, and the echoes of old things, and days that look like darkness. That is the girl I was then: stumbling, sinking, lost in brightness and space. My past had been wiped clean, bleached a stark and spotless white. But you can build a future out of anything. A scrap, a flicker. The desire to go forward, slowly, one foot at a time. You can build an airy city out of ruins. This is the girl I am right now: knees pressed together, hands on my thighs. Silk blouse pulling tight against my neck, skirt with a woolen waistband, standard issue, bearing the Quincy Edwards High School crest. It’s itchy; I wish I could scratch, but I won’t. She would take that as a sign of nerves, and I am not nervous, will never be nervous again in my life. She blinks. I don’t. She is Mrs. Tulle, the principal, with a face like a fish pressed to glass; eyes so large they appear distorted. “Is everything okay at home, Magdalena?” It’s strange to hear her use my full name. Everyone has always called me Lena. “Fine,” I say. She shuffles the papers on her desk. Everything in her office is ordered, all the edges lined up correctly. Even the water glass on her desk is centered perfectly on its coaster. The cureds have always liked order: straightening, aligning, making adjustments. Cleanliness Is Next to Godliness, and Order Is Ascension. It gives them something to do, I guess—tasks to fill those long, empty hours. “You live with your sister and her husband, is that correct?” I nod, repeat the story of my new life: “My mother and father were killed in one of the Incidents.” This, at least, is not so much of a lie. The old Lena, too, was an orphan; as good as one, anyway. I do not have to clarify the reference to the Incidents. Everyone has heard about them by now: last fall, the resistance coordinated its first major, violent, visible strikes. In a handful of cities, members of the resistance—helped by sympathizers, and in some cases, young uncureds—caused simultaneous explosions in important municipal buildings. In Portland, the resistance chose to explode a portion of the Crypts. In the ensuing chaos, two dozen civilians were killed. The police and regulators were able to restore order, but not before several hundred prisoners had escaped. It’s ironic. My mother spent ten years tunneling her way out of that place, when she might have just waited another few months and strolled free. Mrs. Tulle winces. “Yes, I saw that in your records.” Behind her, a humidifier whirs quietly. Still, the air is dry. Her office smells like paper and, faintly, of hairspray. A trickle of sweat rolls down my back. The skirt is hot. “We’re concerned that you seem to be having trouble adjusting,” she says, watching me with those fish eyes. “You’ve been eating lunch by yourself.” It’s an accusation. Even this new Lena feels slightly embarrassed; the only thing worse than having no friends is being pitied for having no friends. “To be honest, I’m having some trouble with the girls,” new Lena says. “I’m finding them a little bit … immature.” As I speak, I angle my head away slightly, so she can see the triangular scar just behind my left ear: the mark of the procedure, the mark of being cured.","sourceLink":"https://allnovel.net/pandemonium-delirium-2/page-6.html","bookId":1717,"book":{"id":1717,"title":"Pandemonium (Delirium #2)","description":"Storyline: Pandemonium (Delirium #2) I’m pushing aside the memory of my nightmare, pushing aside thoughts of Alex, pushing aside thoughts of Hana and my old school, push, push, push, like Raven taught me to do. The old life is dead. But the old Lena is dead too. I buried her. I left her beyond a fence, behind a wall of smoke and flame. Lauren Oliver delivers an electrifying follow-up to her acclaimed New York Times bestseller, Delirium. This riveting, brilliant novel crackles with the fire of fierce defiance, forbidden romance, and the sparks of a revolution about to ignite.","cover":"https://allnovel.net/images/pandemonium-delirium-2.jpg","author":"Lauren Oliver","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/pandemonium-delirium-2.html","creation":"Oct 5, 2019 8:57:53 AM","modification":"Oct 5, 2019 10:04:44 AM"}}
