{"id":72857,"no":16,"title":"Page 16","content":"The buzzing in Skye\u0027s head was getting stronger, more painful, as Gian\u0027s summons became more insistent. The barrier between them was weakening under his assault.\n She\u0027d been lucky so far-lucky that she hadn\u0027t lost much time finding a place to hide the Harley, lucky that Rico\u0027s truck had a winch so it was easy to pull the coffins into the truck bed, lucky that she knew an area where she could bury them without too much risk of being seen. But luck didn\u0027t hold indefinitely.\n She pushed herself to throw the last shovels full of sand over the hole and escape before Gian began tracking her.\n \"You are way lucky,\" Marina said. \"Your first night here and one of the vamps is interested in you.\" She leaned closer to Cia, as though someone could actually eavesdrop in a place as loud as Fangs. \"There\u0027s a girl I sometimes hung out with in LA, she\u0027s from Pacific Palisades, same as I am. She tried for months to get one of the vamps interested in her, not to be a companion-that\u0027s not much better than being a sex slave-but to make her a vampire. She finally gave up and found another way. But it cost her a lot of money. If I were you, I\u0027d go over and ask him to dance or something. Don\u0027t worry about those vamp-sluts hanging off him-he hasn\u0027t given them a second look.\"\n Detective Cia Caldwell shivered despite the heat being generated by all the bodies packed into this place. She\u0027d busted her ass to get this lead, spent every spare moment in cyberspace or on the phone to the cops who were going over Brittany Armstrong\u0027s computer, but right now, every instinct she had was screaming for her to get out of there, before it was too late and her life was changed forever.\n This whole scene was creeping her out. There wasn\u0027t enough money in Vegas to make her read a Stephen King book, much less step into one, yet here she was in the middle of a horror show.\n God, she wasn\u0027t cut out for undercover work, that was for sure. She\u0027d been so sure she had Marina figured out... Now it only pissed her off more to see these kids being sucked into this stuff. Her eyes landed on Rico, then Skye. She had to clench her hand to keep from making the sign of the cross. She had to let it go-along with the last of the crush she\u0027d had on him.\n Mind over matter. That\u0027s what her mother had always preached.\n What was more important to her career-a one-sided, nonexistent love affair with Rico, or having him as a partner?\n Having him as a partner. That won hands down.\n And she didn\u0027t have a chance against Skye Delano. Never had, never would, especially if Rico was willing to get in the captain\u0027s face with it.\n Cia\u0027s gaze wandered around the bar, finally settling at the doorway where the bouncer who\u0027d let them in had now taken a position leaning against the wall. Her eyes met his and a tendril of icy-heat washed through her. For no reason at all, he scared her.\n She shivered again and prayed that this night would hurry up and end.\n Rico knew the minute Skye walked into Fangs. Every cell in his body tightened with awareness.\n He shot a look to the private table where Gian was sitting with three other guys. From where Rico was standing, he could feel the tension building there, like an argument getting ready to erupt into a fight. As he watched, Gian stood and Rico knew that the other man was aware of Skye\u0027s presence, too.\n Rico swiveled to watch Skye, felt his heartbeat kick into overdrive as she walked toward him. She stopped only inches away from his body, close enough that her scent and heat surrounded him. \"You\u0027re working?\"\n \"Yeah.\"\n A small smile played across her lips and he wanted to cover it with his mouth. \"So I guess you can\u0027t dance,\" she said.\n His cock hardened at the thought of rubbing against her. But he didn\u0027t get a chance to answer before Gian was there, his hand wrapped around Skye\u0027s arm, menace radiating off him.\n Something primitive flashed through Rico. Arousal shifted to aggressiveness, protectiveness.\n Skye pressed a hand over his heart, distracting him, making him look at her face before he could follow through on the impulse to put himself between her and Gian.\n \"It\u0027s okay,\" she whispered, leaning into Rico and pressing a soft kiss against his lips.\n It took a minute for the adrenaline to fade. There wasn\u0027t any fear in her-at least not that he could see. But Rico couldn\u0027t keep himself from saying, \"I\u0027m here if you need me.\"\n Skye rubbed her lips over his. \"Later, I want us to spend some time together.\"\n Rico\u0027s cock got harder wondering if she meant the two of them-or the three of them.\n Skye allowed Gian to lead her to the private table where Brann and Kyle and Nahir waited. She wanted to touch Gian\u0027s mind, to see how much of his menace was directed at her and how much of it was purely for show. But she didn\u0027t dare lower the wall she\u0027d placed between them...not yet anyway.\n His grip tightened momentarily as he placed her in a chair, then moved behind her, his hands on her shoulders so that she was trapped in front of Brann.\n Once again the other vampire\u0027s hair made her think of a waterfall of blood. Skye opened her senses as she studied him. Ancient memories stirred but remained hidden. A small shiver of uneasiness wormed its way into her consciousness as the knowledge that they shared a blood link flowed into her. Gian\u0027s sire.\n Brann\u0027s nostrils flared then narrowed. \"She has found the fledglings. I smell the dark magic on her.\" He looked to Gian. \"Can you see what she has done with them?\"\n Skye didn\u0027t wait for Gian to try and force the answer out of her. She said, \"They wait for judgment, nothing more.\"\n Kyle\u0027s voice was low and angry as he asked, \"And who will judge them?\"\n Skye flashed on the face of the hunter she\u0027d seen at Big Daddy\u0027s house. \"The Angelini.\"\n \"This is not their business,\" Kyle said.\n From Gian\u0027s knowledge, Syke said, \"It is always their business when humans are killed.\"\n Kyle snorted. \"The servant they destroyed was already tainted by the evil he played in. You can\u0027t mean to seek justice for a man who would have raped you as you bled to death on the altar.\"\n \"No. I want to see justice for Brittany Armstrong.\"\n When Kyle would have said something else, Brann made a small motion with his hand and silenced him. \"Justice will be served by the death of the witch and her remaining servant. Where are the fledglings?\"\n \"They\u0027re safe.\" Skye allowed Gian to see the coffins as they\u0027d rested one on top of the other before she\u0027d covered them with dirt.\n Brann\u0027s hand snaked across the table and cupped her face, forcing her eyes to meet his. For an instant she felt the full force of his power and knew soul-deep fear, then Gian\u0027s hands loosened and she wrenched away.\n \"No,\" Gian said when Brann moved to take Skye\u0027s face again. \"She is my companion. She answers to me.\"\n Brann\u0027s eyes flashed. \"And you answer to me.\"\n The air thickened and swirled with violence. Gian\u0027s hands tightened on Skye\u0027s shoulders-a warning, a promise of protection. He gave a small nod. \"The fledglings are safe. Give me some time alone with my companion...Sire.\"\n Like a gust of wind across a desolate plain, the tension cleared. Brann\u0027s eyebrows rose and a small smiled hovered. \"Ah, finally the respect I deserve.\"\n Rico\u0027s cop instincts were on full alert. He didn\u0027t like the feel of what was going down at the private table with Skye and he didn\u0027t like the way Caldwell seemed to be getting too tight with girl they were tailing.\n Fuck! They were cops, not social workers.\n But even from this distance Caldwell\u0027s body language radiated concern and her expression earnestness. Goddamn, he could just picture her sitting there trying to convince the girl to pull the body piercings and wear white instead of black.\n The situation was making him edgy as hell, and his cock wasn\u0027t helping matters. What had Skye meant when she said she wanted them to spend some time together?\n He tensed when the girl reached in her pocket, then relaxed when she pulled out a cell phone. Shit, what was he thinking? That she was going for a gun?\n Marina got up and moved toward a less crowded spot. Rico eased away from the bar and tried to get close, but by the time he was in hearing range, she\u0027d already pocketed the phone.\n He waited, seeing which way she\u0027d go. She headed toward the bathroom but at the last minute bolted outside.\n Fuck!\n Caldwell was out of her seat and after Marina in a heartbeat. A new song kicked in and a group of kids surged out of their chairs, slowing Rico down. By the time he got through the door, he saw Marina climbing into a dark Yukon, Caldwell close by but not close enough, yelling something, then moving in front of the car like something you\u0027d see in a bad cop movie. A horror movie. The Yukon lurched forward with a squeal of rubber against asphalt, pulling Cia underneath it then backing over her, before roaring forward and screaming down the road.\n Fast-forward and slow motion blended. Suddenly Skye and the others were there, hovering over Cia\u0027s broken form. Rico\u0027s heart thundered in his ears as he checked for a pulse. Despite the blood leaking form her nose and mouth, she was still breathing, still alive. He reached for his cell phone only to have his wrist grabbed by one of the men who\u0027d been at the table with Skye. Fear took the form of rage. But before it could erupt into violence, Skye touched Rico\u0027s arm and said, \"There\u0027s no time for that.\" Every cell in Rico\u0027s body screamed in denial.\n The man with the long red hair actually smiled and Rico\u0027s body reacted, struggling to strike out, to free himself so he could call for help, but the other man never took his eyes off of Skye. \"True. Even if she lives, her spine is crushed in several places. She may never do more than breathe on her own. A trade, Skye? Her life thrown into the mix of justice?\"\n \"Healed-not enslaved, Brann,\" Skye said.\n Brann laughed. \"Gian has met his match in you. Done. She\u0027ll be healed, not enslaved.\"\n Gian leaned down and Rico tensed, wanting to scream that Cia not be moved, not be touched. Skye\u0027s hand tightened on his arm. Somehow Rico knew that whatever Gian was going to do, it was intimate, personal, and Skye didn\u0027t want to share Gian in that way, but she said, \"Trust him, Rico. I was in worse shape, closer to death than she is.\"\n The bouncer stopped Gian\u0027s movement by saying, \"I\u0027ll do it...Sire.\"\n The men around Skye froze, identical expressions of surprise surfacing briefly on their faces. Gian moved back. \"As you wish, Terach.\"\n Only the gentle way in which Terach lifted Caldwell kept Rico from struggling and fighting against the hands holding him in place. Skye said, \"She\u0027ll be okay, Rico. Trust me in this. She\u0027ll be okay...better than if you send her to the hospital.\"\n The nightmare reality played though Rico\u0027s mind in a never-ending loop and he exploded. \"What the fuck was she thinking about!\"\n Skye stood and he shot to his feet, all raw energy with nowhere to go. The others also rose, moving and intermingling with the kids that had gathered behind them, watching the drama unfold.\n Gian stepped close enough so that he touched both Rico and Skye. The jolt that whipped through Rico\u0027s body broke the cycle of his thoughts. His eyes met Gian\u0027s and he couldn\u0027t look away. Like dark seduction, Gian said, \"Let your mind be at ease. Your partner will be all right.\"\n Instinctively Rico fought the voice. Skye\u0027s arm slipped around his waist. Her voice soothed as it moved through his mind. Trust this. Trust us. She will be okay.\n He couldn\u0027t fight both of them. He couldn\u0027t fight against the sureness he sensed in them. He had a sudden picture of Skye\u0027s broken body and knew that he was seeing the truth. Somehow Gian had healed her so that only faint bruises had remained. Slowly he nodded, accepting the peace of mind they offered.\n Gian moved back then and some of the intensity faded. His head tilted slightly, toward the kids that still gathered. \"I will come to you after this is dealt with.\"\n For a second Rico\u0027s heartbeat rabbited in his chest. Then realization dawned. None of the kids would have a memory of what had happened to Cia.\n He couldn\u0027t fight the shudder of horror, though his mind argued that it had to be this way. It was better for everyone.\n \"They\u0027re Angelini, too?\" Rico asked as the men who\u0027d been at the table with Gian and Skye began winding their way through the thinning crowd of onlookers.\n Gian\u0027s teeth flashed white. \"Only in their nightmares.\" \n","sourceLink":"https://allnovel.net/skye-s-trail-the-angelini-1/page-16.html","bookId":1765,"book":{"id":1765,"title":"Skye\u0027s Trail (The Angelini #1)","description":"Storyline: \n Skye\u0027s Trail (The Angelini #1) \n For Skye Delano, the hunt and the kill are sometimes inexorably tied together. Her origins shrouded behind an impenetrable wall of mental pain, Skye has survived and evolved into a tracker, a hunter who metes out justice to those who prey on the helpless. Alone but not lonely, she\u0027s been content with her life. But now her body is changing and there\u0027s an underlying craving that\u0027s left her restless. She needs to take a mate - or rather, two mates... \n Detective Rico Santana wants and needs Skye - for himself, and to track a couple of kids who have gone missing. In all the centuries that Giovanni Banderali has been alive, he\u0027s never desired any woman enough to bind her to him as a companion. That changed the moment he saw Skye. She\u0027s a threat to the fledgling vampires he\u0027s searching for, but nothing will stop him from claiming her - not even the Angelini blood that flows through her veins. Adversaries, natural enemies - dangerous allies - the bond that links them is stronger than lust, more powerful than love. When an Angelini chooses a mate, no man can resist.\n \n","cover":"https://allnovel.net/images/skye-s-trail-the-angelini-1.jpg","author":"Jory Strong","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/skye-s-trail-the-angelini-1.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:25:39 AM"}}
