{"id":72846,"no":5,"title":"Page 5","content":"Skye came awake slowly, luxuriating in the warm male chest pressed against her back, in the arms that circled her waist and held her tight. Rico.\n She\u0027d never brought a lover to her apartment, never slept all night with one and woken this way. Some instinct had prevented her from doing it. Now she recognized it for what it was-an intimacy only to be shared with a mate, not with a recreational sex partner.\n The complications would begin soon enough.\n The questions.\n About the mating.\n About the way he\u0027d been locked deep inside her.\n How he\u0027d orgasmed-how they\u0027d both orgasmed each time the head of his penis had tried to escape.\n She\u0027d searched for answers herself, but there were none.\n Like so many things in her life, she could only accept that it was natural.\n Nothing had changed and yet everything had changed. They were bound together. She knew it on a gut level. Knew from experience that it was useless to fight whatever it was that made her other.\n But he would fight it. She knew that, too.\n She snuggled deeper into Rico and felt his cock begin to stiffen against the cleft of her ass. He nuzzled her neck and Skye\u0027s nipples tightened. An ache began to build between her thighs. They\u0027d have to face the day soon enough. Before that happened she needed him again.\n Skye rolled over slowly and smiled as she took in Rico\u0027s dark good looks. Gone was the fierce lover who\u0027d mounted her repeatedly in the living room then one last time as they\u0027d showered before crawling into bed. Now his face was relaxed, almost boyish. She used her body to roll him to his back. He frowned in his sleep but didn\u0027t wake up.\n Pleasure roared through her-a primal satisfaction unlike any she\u0027d ever known-at the sight of the bite marks she\u0027d left on his neck, over his heart, on his inner thigh. She moved over him and pressed her lips against his lips, then nibbled down the tanned column of his throat until she got to a small brown nipple. She laved it with her tongue then lightly bit it before moving to its twin. Rico woke and immediately laced his fingers through her hair. She continued along his ribs and across his tight abdomen.\n His body tensed when she stopped. She could feel the heat of his cock against her cheek. She looked up at him then. \"Have you fantasized about this, Rico?\"\n His fingers tightened in her hair. She ran her tongue along his cock. \"Carajo! You\u0027re going to kill me!\" he said as his hips pumped upward.\n Skye moved so that she could wrap her hands around his hungry cock. Rico\u0027s nostrils flared, his face flushed. His hips pumped again. Power and pleasure flooded through Skye. He was hers.\n She took the head of him into her mouth and began sucking as she stroked his shaft. His eyes closed, his ass flexed and he arched off the bed. She let him move in and out of her mouth, taking more of him each time and using her lips and tongue to love him.\n The fingers buried in her hair tightened as he groaned and panted. A sharp hunger built in Skye. She moved so that she could straddle his face.\n Rico\u0027s hands went to her hips. His mouth latched on to her clit. She gasped and pressed downward as he stroked her with his tongue then sucked her until fingers of pleasure shot through her body, demanding a release. She took his cock to the back of her throat and swallowed. He tightened his grip on her hips and continued his assault on her engorged clit. The heat and need built until they were both writhing and clutching and gasping, then crying out in ecstasy.\n Skye moved so that she could wrap her arms around him and rest with her face against his warm chest. Rico pulled the covers up over their sweat-slick bodies as they both shivered from the aftermath of pleasure.\n \"It\u0027s never been like this before,\" he said and Skye could hear a hint of fear in his voice. She could feel the struggle taking place inside him. Finally the cop won. \"I\u0027ve got to get to the station. You coming by to see Caldwell?\" There was worry in his voice this time.\n Skye smiled against his chest. \"If I have to. Or you can just tell her that you\u0027ll see to it personally.\"\n Rico stiffened against her. She let him retreat. What was done, was done. They were bound together. She accepted it as she\u0027d learned to accept so many things that couldn\u0027t be easily understood, but that didn\u0027t mean she could explain it to him.\n \"Shit,\" he muttered under his breath before rolling away and retrieving his clothing from where it\u0027d been thrown in his haste to take her last night. He didn\u0027t dare look toward the bed until he was dressed. He still wanted her.\n His heart did a triple beat in his chest. Fuck. What had he done? What had she done? The sex last night couldn\u0027t have been real. Had she hypnotized him? Let him play out the erotic fantasy of being locked deep in a woman\u0027s body? What was he supposed to do now?\n There\u0027d be hell to pay if Rivera and the rest of the department found out about this. But his cock was already telling him to forget about calling this a one-time event.\n Rico went over to the bed and sat down on the edge, careful to avoid the trap of her eyes. She sat up and pressed her lips to his. \"This is between us,\" she surprised him by saying.\n He couldn\u0027t stop himself from meeting her gaze, from studying her expression. There was no hint of the amusement he usually found there. If anything, her face looked almost...gentle. \"I\u0027ll call you later,\" he heard himself say, wishing he could say the compulsion was hers, but honest enough with himself to admit it was his.\n The familiar half-smile appeared and with it the urge to wipe it off her face. He couldn\u0027t stop himself from pushing her down to the mattress and kissing her. But as soon as his body was on top of hers, it demanded something else.\n His thighs spread hers. Then with one hand holding hers to the mattress, he used his other hand to unzip his pants and guide his cock into the wet heat of her. She whimpered into his mouth as he took her hard and fast.\n Skye lay in bed until the blinking light of the answering machine caught her attention. There were two messages. She deleted the first one as soon as Detective Caldwell\u0027s voice began speaking. The second message was from Senator Skip Weldon. It was unexpected, simple and to the point.\n He had caught a red-eye to Las Vegas and was staying at the Tropicana. Would she please contact him as soon as possible. It was extremely urgent. He\u0027d like to discuss his sister, Amy Weldon. Three weeks ago they had buried her. But now there were reports that she was alive. Skye returned the call and thirty minutes later she walked into the hotel restaurant and was led to a table where two men waited.\n Skip Weldon rose from his chair and shook her hand. The senator was handsome. Skye would give him that. But he had the easy polished charm of a politician. And underneath the expensive cologne, he smelled of cocaine and paid-for sex.\n The second man was the senator\u0027s aide, Martin. He was shorter than his boss, whipcord-thin with wire-rimmed glasses. But like Senator Weldon, the odor of cocaine permeated Martin\u0027s skin.\n \"Thank you for meeting me on such short notice,\" Senator Weldon said as the three of them sat down.\n Skye offered a charming smile of her own. \"I\u0027ve got to thank you, Senator. I\u0027m just getting started on a case and you\u0027re my best hope for a lead.\"\n \"Please, call me Skip.\" The senator gave her an assessing look, as though he was wondering whether or not he could mix business with pleasure. Skye decided to turn down the charm.\n \"Why don\u0027t you start first, Skip, and tell me about your sister, Amy.\"\n The waitress returned to take their orders. The men knew what they wanted. Without looking at a menu, Skye ordered a hamburger and French fries with a side order of salad.\n When the waitress left, Martin spoke, \"I\u0027ve been in touch with the local police department. You have quite a reputation.\"\n She didn\u0027t respond to the comment, choosing instead to let silence settle around the table. Skip and his aide exchanged glances, the senator asked, \"Do you follow politics?\"\n \"No. It\u0027s never been an interest of mine.\"\n \"Then you\u0027re probably not aware that the other Senator Weldon is my father. I contacted him after I got your message. He told me that you\u0027d also tried to reach him.\"\n \"Yes. I did. Which Senator are you? Florida or New York?\"\n \"Florida.\" The arrogance of power rang through the single word.\n Skye nodded, encouraging him to go on.\n \"My father has been approached by a large number of influential party members. They\u0027re convinced that he\u0027d have a good shot at the presidency should he run. Of course, it\u0027s too early now for serious public discussion, but I believe he could take the party\u0027s nomination and win in a national election.\"\n \"He\u0027s what the country needs,\" Martin interjected. \"Exactly what the country needs.\"\n Skye could sense where this was heading. She supplied the, \"But...\"\n Skip offered the charming smile again, pausing long enough for the waitress to set their food on the table and leave. \"But if my sister is alive then we need to find her and get her into rehab before some liberal newspaper latches onto her and totally destroys my father\u0027s hope for a nomination.\"\n \"It\u0027s absolutely essential.\" Martin\u0027s eyes burned with the conviction of a zealot.\n \"What kind of rehab does Amy need?\" Skye asked.\n \"Rehab probably isn\u0027t the correct word for it.\" Skip exchanged another glance with his aide and nodded.\n Martin opened the folder sitting on the table next to him and handed Skye an envelope. \"There\u0027s two thousand dollars in the envelope. The information Senator Weldon is about to disclose is extremely sensitive. By accepting the money, you would be expected to keep this information confidential. Initially the Senator wants a low-profile search done in order to determine if there is any reason to believe that Amy is alive. We\u0027ll negotiate additional fees if your preliminary search suggests she\u0027s not dead.\"\n Skye studied the senator and his aide, but even as she did so, she knew she\u0027d agree. The search for Amy was the search for Jen. And there was little doubt in her mind after seeing Haley and Kyle together last night that the next time she saw Haley, Jen\u0027s sister would have changed her mind about asking Skye to help.\n \"Do you have a photo of Amy?\" Skye asked as she folded the envelope and slipped it into her pocket.\n Skip smiled. Confident, almost pompous. \"Welcome to the team.\"\n Martin pulled a picture out of his folder and handed it to Skye. The photograph was professionally done. The girl in it was posed and made up to look all-American. She had short black hair and was slightly overweight. Pretty in a normal way. She wouldn\u0027t stand out in a crowd. Skye doubted that Amy looked like this at Fangs. \"Is this a current picture?\"\n \"It was taken a year ago,\" Skip answered. He grimaced in distaste. \"The last time I encountered my sister she was dressed in black and looked like a corpse.\"\n Martin said, \"Skye, what the senator is having a hard time telling you is that before his sister\u0027s supposed death, she became very interested in the occult. Through private investigators we were able to determine that she\u0027d attended several black magic ceremonies and over the last couple of years has become obsessed with the notion of becoming a vampire. Obviously the family\u0027s first concern is to get their daughter into a facility where she can be treated and hopefully cured-again, if she is in fact alive. In addition, getting help for Amy needs to be done with haste and complete secrecy. And I can\u0027t stress this need for secrecy strongly enough. The senator\u0027s father is a devout man and his followers are very conservative values-oriented people.\"\n \"Why do you think Amy might be alive?\"\n The senator answered, \"Several friends of mine have contacted me in the last month swearing that they saw a girl resembling Amy in Las Vegas. One of them said Amy responded when he called her name, but he couldn\u0027t find her when he followed her into a club.\"\n \"What club was it?\"\n \"A place called Bangers.\"\n \"I\u0027ve never heard of it.\"\n \"It\u0027s a strip club.\"\n Skye had been in her share of them. In one form or another, runaway kids usually ended up in the sex trade.\n \"Where else was she seen?\"\n \"The other times were both here on the main drag. Nowhere in particular.\"\n \"Now tell me why you think she\u0027s dead.\"\n Martin answered, \"Six weeks ago Amy flew to Las Vegas. She arrived on a Thursday night. The following Sunday she supposedly died in a car fire. There was one eyewitness, the driver of the truck she ran into. His description of the person driving her car matched Amy, but the fire burned so intensely that police weren\u0027t able to retrieve any identifiable body parts. Everyone assumed she had died in the fire.\"\n \"What happened to her money?\"\n Both the senator and his aide stiffened. Martin opened his mouth to say something, a slight movement of Skip\u0027s hand halted him.\n \"I assume you mean Amy\u0027s inheritance.\"\n Skye was watching them as closely as they were watching her. She weighed her options, decided to give them something. \"I contacted you because a friend of Amy\u0027s has been missing for about two months. While they were together in Vegas, Amy was paying for everything and making it known that she didn\u0027t care if she wiped out her checking account. If she\u0027s alive then she\u0027s probably going to need money soon.\"\n The senator\u0027s jaw twitched. \"A good point. Unfortunately, Amy turned nineteen the Wednesday before she came to Vegas. She appeared at the bank near closing time on Thursday and had them wire the funds to a casino here. The casino has cashed out the account.\"\n \"How much money?\"\n \"Five hundred thousand dollars.\"\n \"And there\u0027s no trace of it.\"\n \"None.\"\n \"How often did Amy come to Vegas?\"\n Skip shook his head. \"I don\u0027t have any idea. Her mother maintains a separate house in Los Angeles and only travels to Washington or New York when politics make it necessary. My stepmother and I aren\u0027t close. In my opinion, she has always been overprotective of Amy and bears some responsibility for Amy\u0027s interest in the occult.\n \"My father hired a private investigator to try and reconstruct Amy\u0027s movements from the time she took the money until the time of her death. Unfortunately the detective came up with absolutely nothing and did not get any cooperation from Amy\u0027s mother.\"\n \"Were Amy and her mother close?\"\n \"I assume so, but I can\u0027t answer that question definitively. I was sixteen when Amy was born and already away at school most of the time.\"\n \"I\u0027ll probably need to talk to her mother.\"\n Skip nodded to Martin. The ever-efficient aide pulled a piece of paper bearing a name, address and phone number out of the folder and handed it to Skye. \"Please remember that what\u0027s been said here is in confidence. The senator\u0027s stepmother is not entitled to know anything about the investigation, including the proposed step of placing Amy in a rehab should she be located.\"\n Both men were watching her closely again. Without inflection, Skye said, \"I\u0027ll remember that.\"\n Martin pulled one final item out of the folder before closing it, signaling that Skye was now in possession of all the information they were prepared to give her. \"Here\u0027s the senator\u0027s card. His private number is on the back. My private number is also listed there. Contact us immediately if you find her alive. Again, we can\u0027t stress how sensitive this matter is.\"\n Skye accepted the card without comment.\n The police station was swarming with cops and criminals. Skye\u0027s talk with Detective Caldwell was brief and to the point, done at her cubicle with chilly efficiency.\n \"Wait here while your statement\u0027s printing,\" Caldwell said as she rose from her chair and left. Rico wandered around the corner while she was gone.\n He\u0027d showered since he left Skye\u0027s apartment, just as she\u0027d showered, but she could still smell herself on him, could smell him on her. It filled her with primitive satisfaction.\n \"Cia didn\u0027t tell me you\u0027d called,\" he said as he stepped into the cubicle. His eyes went dark as they traveled over her body and lingered on her pebble-hard nipples.\n The bullpen around them suddenly seemed quieter. Skye said, \"I didn\u0027t call.\"\n \"Where\u0027s Cia?\" he asked.\n \"Waiting for my statement to be printed.\" Her voice was unintentionally husky. Inviting.\n Rico\u0027s face tightened. His pants stretched over his growing erection. Skye\u0027s clit responded, throbbing as it stood at attention. She couldn\u0027t stop herself from running her fingers along the front of her jeans.\n \"Fuck!\" Rico said. It came out a strangled plea.\n Caldwell returned. When she saw them together her lips disappeared in a disapproving frown. Rico stiffened and his cop-mask fell back into place though his face remained slightly flushed.\n \"Here\u0027s your statement,\" Caldwell said as she thrust a small handful of papers into Skye\u0027s hand.\n Skye read the statement and signed it then dropped it to Caldwell\u0027s desk.\n A uniformed officer stepped into view. Jon and Karen Armstrong trailed behind him. Callie clung to her mother with her head buried in the curve of Karen\u0027s neck.\n \"Detective Santana,\" the officer said. \"The Armstrongs wanted to speak with you before they left.\"\n Karen\u0027s eyes teared up when she spotted Skye. \"I never thanked you,\" she said and surprised Skye by wrapping her in a hug. Callie whimpered, but didn\u0027t respond otherwise.\n \"How\u0027s she doing?\" Skye asked when the embrace ended.\n Callie\u0027s mother shook her head wordlessly. Jon answered, \"We\u0027re leaving for home in a couple of hours. The psychiatrist we\u0027ve consulted thinks that once we get her back in familiar surroundings she\u0027ll come out of this withdrawal.\"\n Karen murmured softly, \"Callie, do you remember Skye? She found you in the woods.\" The small girl\u0027s only response was to tighten her grip on her mother.\n Jon rubbed a hand over his face in emotional exhaustion. \"We might as well go to the airport and wait for our flight.\" He smiled at Skye. \"Thank you. It seems so inadequate, but thank you.\"\n Skye studied the family. Sorrow moved through her at the child\u0027s withdrawal. This wasn\u0027t the same child she\u0027d found in the woods. \"Can I have a few minutes with her?\"\n Caldwell spoke instantly. \"That wouldn\u0027t be advisable.\"\n The Armstrongs\u0027 faces showed their confusion at the detective\u0027s quick objection. \"Can you help her?\" Karen\u0027s voice was tentative, painfully hopeful.\n \"Maybe,\" Skye said.\n \"You\u0027ve had to deal with a lot of traumatized children, haven\u0027t you?\" Jon asked.\n \"Yes.\"\n He took only a second to think it over before nodding decisively. \"Could you suggest a place? We\u0027ve already checked out of our hotel room.\"\n Rico spoke up, \"You can use a room here. Follow me.\"\n He led them to an interrogation room. At the door he took Skye\u0027s arm. Next to him Detective Caldwell stiffened. Rico said, \"I\u0027d like to be present for this.\" His eyes touched hers, then moved over to the one-way window at the end of the room. Skye hesitated briefly then said, \"Just you.\" Rico nodded and she followed the Armstrongs into the room.\n Skye pulled three chairs away from the table. She positioned hers so that her back was to the room she knew Rico would be watching from. The Armstrongs sat facing her.\n Karen tried to pry Callie away from her body and turn her to face Skye. The little girl whimpered and clutched harder. \"Leave her. She\u0027s fine,\" Skye said.\n Then she waited.\n She let the silence fill the room.\n She let the silence fill herself.\n She waited for some of the silence to fill the child, saw it in the slight loosening of Callie\u0027s arms. When she saw that subtle hint, Skye reached over and began stroking the girl\u0027s baby-fine hair.\n Her voice was whisper-soft, gentle like a night breeze. \"Do you remember who I am, Callie?\"\n The girl nodded \"yes\" against her mother\u0027s shoulder.\n \"Are you afraid of me?\"\n The girl shook her head \"no\".\n Skye laughed. It was soft and inviting, reassuring. \"Are you sure you\u0027re not afraid?\"\n Callie\u0027s head turned slightly so she could see Skye out of the corner of one eye. It was all Skye needed. Without hesitation she let the little girl fall into the endless blue of her eyes. \n","sourceLink":"https://allnovel.net/skye-s-trail-the-angelini-1/page-5.html","bookId":1765,"book":{"id":1765,"title":"Skye\u0027s Trail (The Angelini #1)","description":"Storyline: \n Skye\u0027s Trail (The Angelini #1) \n For Skye Delano, the hunt and the kill are sometimes inexorably tied together. Her origins shrouded behind an impenetrable wall of mental pain, Skye has survived and evolved into a tracker, a hunter who metes out justice to those who prey on the helpless. Alone but not lonely, she\u0027s been content with her life. But now her body is changing and there\u0027s an underlying craving that\u0027s left her restless. She needs to take a mate - or rather, two mates... \n Detective Rico Santana wants and needs Skye - for himself, and to track a couple of kids who have gone missing. In all the centuries that Giovanni Banderali has been alive, he\u0027s never desired any woman enough to bind her to him as a companion. That changed the moment he saw Skye. She\u0027s a threat to the fledgling vampires he\u0027s searching for, but nothing will stop him from claiming her - not even the Angelini blood that flows through her veins. Adversaries, natural enemies - dangerous allies - the bond that links them is stronger than lust, more powerful than love. When an Angelini chooses a mate, no man can resist.\n \n","cover":"https://allnovel.net/images/skye-s-trail-the-angelini-1.jpg","author":"Jory Strong","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/skye-s-trail-the-angelini-1.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:25:39 AM"}}
