{"id":42596,"no":13,"title":"CHAPTER XIII. A CASH BOY\u0027S TROUBLES.","content":"The next day Mr. Little asked: \"Did you take that suit to my tailor for alterations, Scott?\" \"Thank you, sir,\" said Scott, coloring, \"but I think I will get along for the present with the suit I am wearing.\" \"What does that mean?\" demanded Ezra Little, quickly. \"I don\u0027t care to wear Loammi\u0027s clothes.\" \"Oh, you are proud, are you?\" sneered Mr. Little. \"If it were necessary I would do so, but I think I am entitled to a new suit.\" \"On what do you base your claim?\" \"On the money which I handed you, Mr. Little,\" replied Scott. \"We will not discuss this question,\" said Ezra Little, coldly. \"I have already told you that this money will be needed to pay your expenses.\" [Pg 108] Scott did not reply. \"Well, what have you to say to that?\" \"Nothing, sir.\" \"You have no just cause of complaint. I have offered you a suit which, when altered, would be almost as good as new. If you change your mind about accepting it, you may let me know.\" \"Very well, sir.\" On Thursday evening Scott made a call at Seth Lawton\u0027s boarding house. \"I am glad to see you, Scott,\" said Mr. Lawton, cordially. \"But you look sober.\" \"I feel so, Cousin Seth.\" \"Why is that? Anything unpleasant happened?\" \"I applied to Mr. Little for a new suit. He declined to buy me one, but said I could have an old suit of Loammi\u0027s altered over for me.\" \"Didn\u0027t you mention the money you had placed in his hands?\" \"Yes, but he said I was not earning my board, and this would make up the deficit.\" Seth Lawton rose from his chair and paced the room. It was his habit to do so when he was disturbed. \"I didn\u0027t think Ezra Little would be so mean,[Pg 109] though I knew he was far from liberal. What did you say to his proposal?\" \"I declined it. Loammi is not as large as I am, and, besides, I don\u0027t feel like wearing his second-hand clothes when Mr. Little has money of mine in his possession.\" \"What do you think of his claim that your services do not pay for your board?\" \"Judging from what I have found out about the pay of other salesmen, I think that I earn more than my board.\" \"I think so, too. So you are to have no new suit?\" \"No, sir.\" \"Perhaps you will be luckier than you imagine. You must remember that I am your relative as well as Ezra Little. I will buy you a suit.\" \"But, Cousin Seth, I don\u0027t want to put you to that expense. You will need all your money yourself.\" Seth Lawton smiled. \"I will promise not to put myself to any inconvenience,\" he said. \"Will that satisfy you? Will you now refuse a favor at my hands, Scott, my boy?\" \"I would rather receive a favor from you than[Pg 110] from Mr. Little, if you really feel that you can afford it.\" \"You need not be apprehensive on that score. At what time do you go out to lunch?\" \"At twelve o\u0027clock.\" \"I will call at that time to-morrow, and we will manage to get time to stop at a tailor\u0027s and leave your measure.\" \"But, Cousin Seth, a ready-made suit will answer.\" \"As this is the first present I have given you, I will make it a good one. Probably we can find a tailor near your store.\" \"Yes; Mr. Little\u0027s tailor has a shop only three blocks away. Here is his card.\" \"The very thing.\" When the suit was finished Scott put it on at once, and left his old one to be cleaned and repaired. It was hardly to be supposed that it would escape the observation of Loammi and his father. As a matter of fact, it was handsomer than any his cousin wore. \"Where did you get that suit?\" asked Loammi, in amazement. \"It was a present,\" answered Scott. [Pg 111] \"From whom?\" \"Cousin Seth.\" Loammi was not slow in carrying the news to his father. \"Pa,\" he said, \"see the new suit Mr. Lawton has given Scott.\" Mr. Little put on his glasses and closely examined his young relative. \"Did you ask Mr. Lawton to buy you a suit?\" he asked, abruptly. \"No, sir. I did not wish him to go to such an expense.\" \"It must have cost at least twenty-five dollars.\" \"I think it cost twenty-eight.\" \"Seth is a fool. He is probably poor, and could not afford such an extravagant outlay.\" \"He told me he could afford it, and I had to take his word.\" \"It is better than my best suit, pa,\" complained Loammi. \"You shall have as good a one when you need it. It is only three weeks since I bought you a suit.\" \"Was it a ready-made suit?\" asked Loammi of Scott. [Pg 112] \"No; it was made to order by the tailor your father mentioned to me.\" \"You will soon get it shabby wearing it every day.\" \"I don\u0027t intend to do so. I left my old suit to be cleaned and repaired.\" \"Well, you are provided for, for the present, thanks to Seth Lawton\u0027s folly. I don\u0027t wonder he is poor if that is the way he manages. Do you know if he has got work yet?\" \"He told me part of his time was occupied.\" \"I suppose he has got a little job to do at bookkeeping. Possibly it will pay him twenty-five dollars. On the strength of that he has bought you a suit at twenty-eight dollars. Seth always was a fool. When he finds himself in need, it won\u0027t do him any good to apply to me.\" It was clear that Mr. Lawton had not raised himself in the estimation of his rich relatives by his kindness to Scott. Among the cash boys who worked in the store was a pleasant-faced boy, named William Mead. He was two years younger than Scott, but the latter had taken special notice of him, and without knowing much of him, had come to feel an interest in him. [Pg 113] Usually Willie, as he was called, was bright and cheerful, but one day he appeared with a sad countenance. \"What is the matter, Willie?\" asked Scott, when the two boys went out together at the noon hour. Scott bought his lunch at a neighboring restaurant, but the cash boy brought his with him from home. \"I don\u0027t like to annoy you with my troubles.\" \"But they won\u0027t annoy me. Please think of me as a friend.\" \"Then I will tell you. I have a brother three years older than I am, who earns six dollars a week. He has been sick for two weeks, and my mother misses his wages. You know I only get two dollars and a half a week.\" \"That is very small.\" \"Some of the stores pay more, but Mr. Little never pays more than that to a cash boy. Next week our rent comes due, and as we have a strict landlord, I am afraid he will put us out when he finds mother is not ready with the rent.\" \"I am sorry for you, Willie,\" said Scott, in a tone of sympathy. \"Have you no friend you can call upon for a loan?\" [Pg 114] \"Our friends are as poor as ourselves.\" \"When does your rent come due?\" \"Next Saturday.\" \"I will think whether I can do anything for you, I will see you again to-morrow.\" \"But you are poor yourself. Mr. Little\u0027s son was at the store one day, and I overheard him telling one of the salesmen that you were a poor relation.\" \"He is not likely to let me forget that. I am not sure that I can do anything for you, Willie, but if I can I will.\" \"You have already done me good by speaking kindly to me.\" \"Come in to lunch with me, Willie. A cup of coffee will do you good.\" That evening Scott had arranged to call on Mr. Lawton. He decided to tell him of the young cash boy\u0027s troubles. Seth Lawton\u0027s face showed his sympathy. \"It is really a hard case,\" he said. \"We must see if we can\u0027t do something for your friend.\" \"I hope you don\u0027t think I was hinting this to you, Cousin Seth.\" \"I don\u0027t, but still you won\u0027t object to my doing something for the boy.\" [Pg 115] \"Mr. Little says you are foolishly generous, and this is why you keep poor.\" \"He will never make himself poor by his generosity. If you have the boy\u0027s address we will call upon him.\"","sourceLink":"http://novel.tingroom.com/jingdian/2037/57975.html","bookId":614,"book":{"id":614,"title":"The Young Salesman","description":"简介： Halfway across the Atlantic the good ship Arcturus was making her way from Liverpool to New York. She was a sailing vessel, and her speed by no means equaled that of the mighty steamships, more than one of which passed her, leaving her far behind....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2037","creation":"Aug 1, 2019 12:19:02 AM","modification":"Aug 1, 2019 12:19:02 AM"}}
