{"id":42617,"no":34,"title":"CHAPTER XXXIV. MR. BABCOCK\u0027S INVENTION.","content":"From this time forth Ezra Little began to pay more attention to his poor relation. Scott\u0027s social and business success had surprised him. He was compelled, though reluctantly, to consider him a young man of promise. He had no idea, however, how successful Scott was, and would have been very much amazed to learn the extent of his income. One result, however, was to excite the jealousy of Loammi. He found that Scott dressed better than himself and had more command of money. Accordingly, he applied to his father for an increased allowance. \"What do you want more money for, Loammi?\" asked his father, in a tone far from encouraging. \"Don\u0027t you get a dollar a week?\" \"What can I do with a dollar a week, pa?\" \"It was more than I received at your age.\" \"You were a poor boy, while I am the son of a rich man.\" [Pg 288] \"Ahem! not exactly rich, Loammi,\" said Ezra Little, complacently. \"Everybody calls you rich, pa.\" \"I have some money,\" admitted Mr. Little, cautiously, \"but it is only by great care that I am moderately well off.\" \"Scott dresses better than I, and always has money in his pocket.\" \"He is very foolish to spend all his spare money on clothes. By the time he is twenty-one he won\u0027t have a cent laid up.\" \"At any rate, he has plenty of cash now. The fact is, pa, people are beginning to notice that he dresses better than I. Percy Shelton was walking with me the other day when we met Scott. \u0027I thought your cousin was poor,\u0027 he said. \u0027He only has his wages to depend upon,\u0027 I said. \u0027Then he must be pretty well paid,\u0027 he replied. \u0027I saw him at Patti\u0027s concert Tuesday night, occupying a three-dollar seat.\u0027 That made me feel awfully mean, for you wouldn\u0027t let me go to hear Patti.\" \"No; it would be throwing money away.\" \"All the fashionable people go. People that know you are rich think it strange not to see me there.\" This argument had some effect on Mr. Little,[Pg 289] who was anxious that his son should be admitted into fashionable society, but was too close to supply him with the necessary means. \"How much do you want, Loammi?\" he asked, cautiously. \"Percy Shelton gets five dollars a week.\" \"Well, you won\u0027t,\" said his father, sharply. \"You must think that I am made of money.\" \"I will try to make it do with four, pa.\" \"You won\u0027t get that either. I will give you two dollars a week, and that ought to be enough to satisfy you.\" Loammi was not satisfied, but did not think it prudent to say any more just then. There was one more concert by Patti, and he had hoped to attend. Indeed, he had told Percy that he expected to do so. He might, indeed, have bought a dollar ticket, but he was ashamed to be seen occupying a cheap seat. Loammi had not much taste for music, and cared chiefly to attend the concert because most of his fashionable friends would be there. In this dilemma he received unexpected assistance. He met Scott one evening near the Fifth Avenue Hotel. His poor cousin was handsomely dressed,[Pg 290] and looked to be on good terms with the world, as indeed he was. \"Good-evening, Loammi,\" he said. \"Good-evening, Scott. Are you still working for Tower, Douglas \u0026 Co.?\" \"Oh, yes.\" \"Do they pay you well?\" \"I am quite satisfied.\" \"How much do you get?\" \"I would rather not tell.\" \"Percy Shelton told me he saw you at Patti\u0027s concert Tuesday evening.\" \"Yes, I was there.\" \"The tickets are rather high, ain\u0027t they?\" \"I paid three dollars for mine.\" \"I want to go ever so much; but pa, though he is rolling in wealth, keeps me very close. How much do you think I get for my weekly allowance?\" \"I couldn\u0027t guess.\" \"Only two dollars.\" \"But you have nothing to pay for board or clothes.\" \"That is true; but of course I can\u0027t go to hear Patti.\" \"Do you really want to go?\" [Pg 291] \"Of course I do. All my friends have attended.\" \"Then I will invite you to accompany me to-morrow evening.\" \"On three-dollar tickets?\" \"Yes.\" \"You\u0027re a good fellow, Scott,\" said Loammi, overjoyed. \"I always said so.\" Scott smiled. He did not feel quite certain about that, but forbore to remind Loammi of certain recent experiences. \"When will you buy the tickets?\" \"We will go now if you have time.\" \"All right.\" Two days afterward Loammi fell in with Percy Shelton. \"I saw you at the concert last evening,\" said his friend. \"Yes.\" \"Was that your cousin with you?\" \"Yes; I thought he would like to go.\" \"That was very kind of you,\" said Percy, who naturally concluded that Scott went by Loammi\u0027s invitation. \"Scott must get a good salary,\" thought Loammi. \"I wonder how much he is paid.\" [Pg 292] But Scott preferred to keep this to himself. He knew that if Loammi were told, he would have frequent occasion to borrow, and he felt that it would be prudent in him to lay by a portion of his earnings. It will be remembered that his friend, Justin Wood, had bought for him an interest in the invention of Mr. Babcock, advancing the inventor a sum of money, which put him on his feet. Scott had not forgotten this, but forbore to look up Mr. Babcock, not having quite so much confidence in his success as the inventor himself. One evening, however, as he was preparing to go out to walk, he met Babcock coming upstairs. \"Good-evening, Mr. Babcock,\" he said; \"I am glad to see you.\" \"You were going out?\" asked the inventor. \"Only for a walk. I shall be better pleased to receive a visit from you.\" \"Then I will accept your invitation. I thought you would look me up.\" \"I was afraid I might interfere with you. I presume you are busy.\" \"Yes, very busy, I am glad to say. And how is your friend, Mr. Wood?\" \"At present he is out of the city.\" [Pg 293] \"I should like to see him to thank him for his timely aid.\" \"Then it has been of service to you?\" \"I should say so. I am succeeding beyond my anticipations.\" \"I am glad to hear that,\" said Scott, cordially. \"You have reason to be. Are you not my partner?\" \"I believe I do own an interest in your discovery,\" said Scott, smiling. \"I see you do not attach much importance to it. You have not considered what your profits will amount to.\" \"No, Mr. Babcock, I have not thought of that at all. I only hoped that it would give you a fair living.\" \"It will do more. In fact, I have come to see you on business to-night. The parties who are manufacturing my window fastener have made me an offer for it. As you hold a one-third interest, I cannot accept without consulting you.\" \"How much do they offer, Mr. Babcock?\" Scott thought the sum might be a thousand dollars, and was very much surprised when the inventor answered: \"Fifteen thousand dollars!\" \"Is it possible?\" he ejaculated. [Pg 294] \"I thought you would be surprised. But it is true. That would give you five thousand dollars.\" \"I don\u0027t see how so small an article can pay so well.\" \"It is the small inventions that pay best. What do you say?\" \"I want to consult your interest in the matter, Mr. Babcock. This would give you ten thousand dollars, to be sure, but it would throw you out of work.\" \"No. They engage me as superintendent of the manufactory at a salary of a hundred dollars per month.\" \"That is very good. In that case, if you think it wise to sell, I will agree.\" \"Then you can come to-morrow to see them, and conclude the bargain?\" \"I shall be occupied, but I am sure my employers will give me leave of absence when I tell them the cause. But I don\u0027t think I ought to receive so large a sum as five thousand dollars. It was you who made the discovery.\" \"True, but I never should have reaped any benefit from it if you had not introduced me to your friend, Mr. Wood.\" The next day the sale was made, and Scott found[Pg 295] himself enriched by five thousand dollars. It seemed to him almost like a dream, from which he was afraid that he might awake. \"What would Mr. Little say if he knew?\" thought Scott. \"He did me a great favor when he discharged me from his store under a cloud.\"","sourceLink":"http://novel.tingroom.com/jingdian/2037/57996.html","bookId":614,"book":{"id":614,"title":"The Young Salesman","description":"简介： Halfway across the Atlantic the good ship Arcturus was making her way from Liverpool to New York. She was a sailing vessel, and her speed by no means equaled that of the mighty steamships, more than one of which passed her, leaving her far behind....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2037","creation":"Aug 1, 2019 12:19:02 AM","modification":"Aug 1, 2019 12:19:02 AM"}}
