{"id":107674,"no":15,"title":"Page 15","content":"“Well, of course, Rhoda Masters burst into tears and in the end the manager agreed to take back the car, although it wasn\u0027t worth two hundred pounds by then, but he insisted that she should leave it with him then and there, petrol in the tank and all. Rhoda Masters could only accept and be grateful not to be sued, and she walked out of the garage and along the hot street and already she knew what she was going to find when she got to the radio shop. And she was right. It was the same story, only this time she had to pay ten pounds to persuade the man to take back the radiogram. She got a lift back to within walking distance of the bungalow and went and threw herself down on the bed and cried for the rest of the day. She had already been a beaten woman. Now Philip Masters had kicked her when she was down.”\\n\\n The Governor paused. “Pretty extraordinary, really. A man like Masters, kindly, sensitive, who wouldn\u0027t normally hurt a fly. And here he was performing one of the cruellest actions I can recall in all my experience. It was my law operating.” The Governor smiled thinly. “Whatever her sins, if she had given him that Quantum of Solace he could never have behaved to her as he did. As it was, she had awakened in him a bestial cruelty - a cruelty that perhaps lies deeply hidden in all of us and that only a threat to our existence can bring to the surface. Masters wanted to make the girl suffer, not as much as he had suffered because that was impossible, but as much as he could possibly contrive. And that false gesture with the motor car and the radiogramophone was a fiendishly brilliant bit of delayed action to remind her, even when he was gone, how much he hated her, how much he wanted still to hurt her.”\\n\\n Bond said: “It must have been a shattering experience. It\u0027s extraordinary how much people can hurt each other. I\u0027m beginning to feel rather sorry for the girl. What happened to her in the end - and to him, for the matter of that?”\\n\\n The Governor got to his feet and looked at his watch. “Good heavens, it\u0027s nearly midnight. And I\u0027ve been keeping the staff up all this time,” he smiled, “as well as you.” He walked across to the fireplace and rang a bell A Negro butler appeared. The Governor apologized for keeping him up and told him to lock up and turn the light out. Bond was on his feet. The Governor turned to him. “Come along and I\u0027ll tell you the rest. I\u0027ll walk through the garden with you and see that the sentry lets you out.”\\n\\n They walked slowly through the long rooms and down the broad steps to the garden. It was a beautiful night under a full moon that raced over their heads through the thin high clouds.\\n\\n The Governor said: “Masters went on in the Service but somehow he never lived up to his good start After the Bermuda business something seemed to go out of ham. Part of him had been killed by the experience. He was a maimed man. Mostly her fault, of course, but I guess that what he did to her lived on with him and perhaps haunted him. He was good at his work, but he had somehow lost the human touch and he gradually dried up. Of course he never married again and in the end he got shunted off into the ground nuts scheme, and when that was a failure he retired and went to live in Nigeria - back to the only people in the world who had shown him any kindness - back to where it had all started from. Bit tragic, really, when I remember what he was like when we were young.”\\n\\n “And the girl?”\\n\\n “Oh, she went through a pretty bad time. We handed round the hat for her and she pottered in and out of various jobs that were more or less charity. She tried to go back to being an air hostess, but the way she had broken her contract with Imperial Airways put her out of the running for that. There weren\u0027t so many airlines in those days and there was no shortage of applicants for the few hostess jobs that were going. The Burfords got transferred to Jamaica later in that same year and that removed her main prop. As I said. Lady Burford had always had a soft spot for her. Rhoda Masters was pretty nearly destitute. She still had her looks and various men had kept her for a while; but you can\u0027t make the rounds for very long in a small place like Bermuda, and she was very near to becoming a harlot and getting into trouble with the police when Providence again stepped in and decided she had been punished enough. A letter came from Lady Burford enclosing her fare to Jamaica and saying she had got her a job as receptionist at the Blue Hills Hotel, one of the best of the Kingston hotels. So she left, and I expect - I\u0027d been transferred to Rhodesia by then - that Bermuda was heartily relieved to see the last of her.”\\n\\n The Governor and Bond had come to the wide entrance gates to the grounds of Government House. Beyond them shone, white and black and pink under the moon, the huddle of narrow streets and pretty clapboard houses with gingerbread gables and balconies that is Nassau. With a terrific clatter the sentry came to attention and presented arms. The Governor raised a hand: “All right. Stand at ease.” Again the clockwork sentry rattled briefly into life and there was silence.\\n\\n The Governor said: “And that\u0027s the end of the story except for one final quirk of fate. One day a Canadian millionaire turned up at the Blue Hills Hotel and stayed for the winter. At the end of the time he took Rhoda Masters back to Canada and married her. She\u0027s lived in clover ever since.”\\n\\n “Good heavens. That was a stroke of luck. Hardly deserved it.”\\n\\n “I suppose not. One can\u0027t tell. Life\u0027s a devious business. Perhaps, for all the harm she\u0027d done to Masters, Fate decided that she had paid back enough. Perhaps Masters\u0027s father and mother were the true guilty people. They turned Masters into an accident-prone man. Inevitably he was involved in the emotional crash that was due to him and that they had conditioned him for. Fate had chosen Rhoda for its instrument. Now Fate reimbursed her for her services. Difficult to judge these things. Anyway, she made her Canadian very happy. I thought they both seemed happy tonight.”\\n\\n Bond laughed. Suddenly the violent dramatics of his own life seemed very hollow. The affair of the Castro rebels and the burned out yachts was the stuff of an adventure-strip in a cheap newspaper. He had sat next to a dull woman at a dull dinner party and a chance remark had opened for him the book of real violence - of the Com‚die Humaine where human passions are raw and real, where Fate plays a more authentic game than any Secret Service conspiracy devised by Governments.\\n\\n Bond faced the Governor and held out his hand. He said: “Thank you for the story. And I owe you an apology. I found Mrs Harvey Miller a bore. Thanks to you I shall never forget her. I must pay more attention to people. You\u0027ve taught me a lesson.”\\n\\n They shook hands. The Governor smiled. “I\u0027m glad the story interested you. I was afraid you might be bored. You lead a very exciting life. To tell you the truth, I was at my wit\u0027s end to know what we could talk about after dinner. Life in the Colonial Service is very humdrum.”\\n\\n They said goodnight. Bond walked off down the quiet street towards the harbour and the British Colonial Hotel. He reflected on the conference he would be having in the morning with the Coastguards and the FBI in Miami. The prospect, which had previously interested, even excited him, was now edged with boredom and futility.\\n\\n RISICO\\n\\n “In this pizniss is much risico.”\\n\\n The words came softly through the thick brown moustache. The hard black eyes moved slowly over Bond\u0027s face and down to Bond\u0027s hands which were carefully shredding a paper match on which was printed Albergo Colombo, d\u0027Oro.\\n\\n James Bond felt the inspection. The same surreptitious examination had been going on since he had met the man two hours before at the rendezvous in the Excelsior bar. Bond had been told to look for a man with a heavy moustache who would be sitting by himself drinking an Alexandra. Bond had been amused by this secret recognition signal. The creamy, feminine drink was so much cleverer than the folded newspaper, the flower in the buttonhole, the yellow gloves that were the hoary, slipshod call-signs between agents. It had also the great merit of being able to operate alone, without its owner. And Kristatos had started off with a little test. When Bond had come into the bar and looked round there had been perhaps twenty people in the room. None of them had a moustache. But on a corner table at the far side of the tall, discreet room, flanked by a saucer of olives and another of cashew nuts, stood the tall-stemmed glass of cream and vodka. Bond went straight over to the table, pulled out a chair and sat down.\\n\\n The waiter came. “Good evening, sir. Signor Kristatos is at the telephone.”\\n\\n Bond nodded. “A Negroni. With Gordon\u0027s, please.”\\n\\n The waiter walked back to the bar. “Negroni. Uno. Gordon\u0027s.”\\n\\n “I am so sorry.” The big hairy hand picked up the small chair as if it had been as light as a matchbox and swept it under the heavy hips. “I had to have a word with Alfredo.”\\n\\n There had been no handshake. These were old acquaintances. In the same line of business, probably. Something like import and export. The younger one looked American. No. Not with those clothes. English.\\n\\n Bond returned the fast serve. “How\u0027s his little boy?”\\n\\n The black eyes of Signor Kristatos narrowed. Yes, they had said this man was a professional. He spread his hands. “Much the same. What can you expect?”\\n\\n “Polio is a terrible thing.”\\n\\n The Negroni came. The two men sat back comfortably, each one satisfied that he had to do with a man in the same league. This was rare in \u0027The Game\u0027. So many times, before one had even started on a tandem assignment like this, one had lost confidence in the outcome. There was so often, at least in Bond\u0027s imagination, a faint smell of burning in the air at such a rendezvous. He knew it for the sign that the fringe of his cover had already started to smoulder. In due course the smouldering fabric would burst into flames and he would be br–l‚. Then the game would be up and he would have to decide whether to pull out or wait and get shot at by someone. But at this meeting there had been no fumbling.\\n\\n Later that evening, at the little restaurant off the Piazza di Spagna called the Colomba d\u0027Oro, Bond was amused to find that he was still on probation. Kristatos was still watching and weighing him, wondering if he could be trusted. This remark about the risky business was as near as Kristatos had so far got to admitting that there existed any business between the two of them. Bond was encouraged. He had not really believed in Kristatos. But surely all these precautions could only mean that M\u0027s intuition had paid off - that Kristatos knew something big.\\n\\n Bond dropped the last shred of match into the ashtray. He said mildly: “I was once taught that any business that pays more than ten per cent or is conducted after nine o\u0027clock at night is a dangerous business. The business which brings us together pays up to one thousand per cent and is conducted almost exclusively at night. On both counts it is obviously a risky business.” Bond lowered his voice. “Funds are available. Dollars, Swiss francs, Venezuelan bolivars - anything convenient.”\\n\\n “That makes me glad. I have already too much lire.” Signor Kristatos picked up the folio menu. “But let us feed on something. One should not decide important pizniss on a hollow stomach.”\\n\\n A week earlier M had sent for Bond. M was in a bad temper. “Got anything on, 007?”\\n\\n “Only paper work, sir.”\\n\\n “What do you mean, only paper work?” M jerked his pipe towards his loaded in-tray. “Who hasn\u0027t got paper work?” \\n\\n","sourceLink":"https://allnovel.net/for-your-eyes-only-james-bond-8/page-15.html","bookId":1551,"book":{"id":1551,"title":"For Your Eyes Only (James Bond #8)","description":"Storyline: For Your Eyes Only (James Bond (Original Series) #8) \\n \"Bond watched her as she reached the edge of the tables and came up the aisle. It was hopeless. She was coming to meet someone—her lover. She was the sort of woman who always belongs to somebody else. What damnable luck! \\n Before Bond could pull himself together, the girl had come up to his table and sat down. ‘I’m sorry I’m late. We’ve got to get moving at once. You’re wanted at the office.’ She added under her breath: ‘Crash dive.’\" \\n Sudden emergencies and beautiful girls who aren’t quite what they seem and are the stock-in-trade of James Bond. And when 007 is on the case there’s only one thing you can be sure of—the result will be thrilling. And whether he’s dealing with the assassination of a Cuban thug in America, the destruction of an international heroin ring, or sudden death in the Seychelles, Bond gets the job done. In his own suave and unmistakable style…\\n","cover":"https://allnovel.net/images/for-your-eyes-only-james-bond-8.jpg","author":"Ian Fleming","type":"Adventure","source":"allnovel","link":"https://allnovel.net/for-your-eyes-only-james-bond-8.html","creation":"Oct 5, 2019 8:57:42 AM","modification":"Oct 5, 2019 11:10:51 PM"}}
