{"id":17160,"no":14,"title":"The March of Caecina\u0027s Column","content":"67There was even more looting and bloodshed on Caecina\u0027s march. The Helvetii, a Gallic tribe138 once famous as fighting men and still distinguished by the memory of their past, having heard nothing of Galba\u0027s murder, refused to acknowledge the authority of Vitellius. This exasperated Caecina\u0027s headstrong nature. Hostilities broke out owing to the greed and impatience of the Twenty-first legion, who had seized a sum of money which was being sent to pay the garrison of a fort in which the Helvetii used to keep native troops at their own expense.139 The Helvetii, highly indignant at this, intercepted a dispatch from the German army to the Pannonian legions, and kept a centurion and some men in custody. Greedy for battle, Caecina hastened to take immediate vengeance without giving them time for second thoughts. Promptly breaking up his camp, he proceeded to harry the country, and sacked a charming and much-frequented watering-place,140 which had grown during the long peace into the size and importance of a town. Instructions were sent to the Raetian auxiliaries to attack the Helvetii in the rear, while their attention was occupied with the legion. 84 68Full of spirit beforehand, the Helvetii were terrified in the face of danger. At the first alarm they had chosen Claudius Severus general, but they knew nothing of fighting or discipline and were incapable of combined action. An engagement with the Roman veterans would be disastrous; and the walls, dilapidated by time, could not stand a siege. They found themselves between Caecina and his powerful army on the one side, and on the other the Raetian auxiliaries, both horse and foot, and the whole fighting force of Raetia as well, trained soldiers well used to fighting.141 Their country was given over to plunder and massacre. Flinging away their arms, they wandered miserably between two fires. Wounded and scattered, most of them took refuge on the B?tzberg.142 But some Thracian auxiliaries were promptly sent to dislodge them. The German army, aided by the Raetians, pursued them through the woods, and cut them to pieces in their hiding-places. Many thousands were killed and many sold as slaves. Having completed the work of destruction, the army advanced in hostile array against Aventicum,143 their capital town, and were met by envoys offering surrender. The offer was accepted. Caecina executed Julius Alpinus, one of their chief men, as the prime instigator of the revolt. The rest he left to experience the clemency or cruelty of Vitellius. 69 It is hard to say whether these envoys found Vitellius or the army the more implacable. The soldiers 85clamoured for the destruction of the town,144 and shook their fists and weapons in the envoys\u0027 faces: even Vitellius indulged in threatening language. Ultimately, however, Claudius Cossus, one of the envoys, a noted speaker who greatly enhanced the effect of his eloquence by concealing his skill under a well-timed affectation of nervousness, succeeded in softening the hearts of the soldiers. A mob is always liable to sudden changes of feeling, and the men were as sensible to pity as they had been extravagant in their brutality. Thus with streams of tears and importunate prayers for a better answer the envoys procured a free pardon for Aventicum.145 70Caecina halted for a few days in Helvetian territory until he could get news of Vitellius\u0027 decision. Meantime, while carrying on his preparations for crossing the Alps, he received from Italy the joyful news that \u0027Silius\u0027 Horse\u0027,146 stationed at Padua, had come over to Vitellius. The members of this troop had served under Vitellius when pro-consul in Africa. They had subsequently been detached under orders from Nero to precede him to Egypt, and had then been recalled, owing to the outbreak of the war with . They were now in Italy. Their officers, who knew nothing 86of Otho and were attached to Vitellius, extolled the strength of the approaching column and the fame of the German army. So the troop went over to Vitellius, bringing their new emperor a gift of the four strongest towns of the Transpadane district, Milan, Novara, Eporedia,147 and Vercelli. Of this they informed Caecina themselves. But one troop of horse could not garrison the whole of the widest part of Italy. Caecina accordingly hurried forward the Gallic, Lusitanian, and British auxiliaries, and some German detachments, together with \u0027Petra\u0027s Horse\u0027,148 while he himself hesitated whether he should not cross the Raetian Alps149 into Noricum and attack the governor, Petronius Urbicus, who, having raised a force of irregulars and broken down the bridges, was supposed to be a faithful adherent of Otho. However, he was afraid of losing the auxiliaries whom he had sent on ahead, and at the same time he considered that there was more glory in holding Italy, and that, wherever the theatre of the war might be, Noricum was sure to be among the spoils of victory. So he chose the Pennine route150 and led his legionaries and the heavy marching column across the Alps, although they were still deep in snow.","sourceLink":"http://novel.tingroom.com/duanpian/3268/89425.html","bookId":517,"book":{"id":517,"title":"Tacitus: The Histories","description":"简介： Tacitus held the consulship under Nerva in the year 97. At this point he closed his public career. He had reached the goal of a politician\u0027s ambition and had become known as one of the best speakers of his time, but he seems to have realized that und...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3268","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
