{"id":84843,"no":18,"title":"Page 18","content":"\\n\\n I can\u0027t make her say it all alone. The silent tears are streaming my face but I manage to speak, \"They put me in the hole. He kissed Em and made her cry. I remember you. You played alone and quiet in the corner. Always in corners. You acted like you didn’t hear the screaming or the crying, but I saw you. The panic and the denial. It was all over you. Emalyn wouldn’t stop screaming. You put the toys down and I saw you go inside. I heard the shot and the screams. I couldn’t get out of the hole and you were screaming. Laura was screaming. I finally got the board off and scrambled out of the hole. When I got inside, Randy was hitting you and Emalyn was dead on the bed.\"\\n\\n Her words are muffled by heaves, \"I missed. He was so big and fat and I missed. Somehow I hit her. She was so little compared to him.\"\\n\\n I can see her little face, so shocked and stunned by the fact she\u0027d missed and killed Em. I mutter, \"I grabbed the gun from the floor and fired the shot you had meant to. I turned and fired another shot. Laura dropped to the floor. I dropped the gun.\"\\n\\n She whispers blankly, \"You saved me. I tried so hard to save her and I couldn’t.\"\\n\\n I rush to her, dropping to my knees and taking her hands desperately, \"But don’t you see, you did. The thing he was going to do to her would have been worse. He would have killed her anyway. He killed all the others, Sarah. All of them. We lived. We made it out.\"\\n\\n She cries so loud it rings within the concrete walls, \"I\u0027m so sorry. I\u0027m sorry.\"\\n\\n I wrap around her, cradling her, \"We ran and hid. We stayed together in that barn for all those days, remember?\"\\n\\n She sniffles, \"I went to sleep and you were gone. Where did you go?\"\\n\\n \"I went for the police. I told them everything. I tried to come back for you. I tried to find you. But you were gone.\"\\n\\n I can almost hear her panic, \"Did you tell them about how I shot her?\"\\n\\n I nod, \"I told them what you were doing and what was happening. They saw it all. The other bodies. The hole. Everything.\"\\n\\n Her body tightens, \"I have to turn myself in.\"\\n\\n I almost chuckle at the ridiculousness of it, but I know that is her fear left over from being six and shooting someone. \"They know who you are, Sarah. You\u0027re the only one who doesn’t.\"\\n\\n In the dark, she takes that final step and whispers, \"Who am I?\"\\n\\n My heart is elated. Jane has a room dedicated to her. She always does. She only works one kid at a time. I get up and drag her but she pulls back, \"Eli. I am so sorry I stole her name. I didn’t want the police to know who I was.\"\\n\\n Her lips stick out, her eyes are puffy and devastated. I place a finger on her lip, \"You were a six-year old. You were barely alive when I met you.\" I kiss the top of her head and drag her down the hall.\\n\\n The office is a mess, as always. It\u0027s Jane\u0027s little secret; she\u0027s a hoarder when she\u0027s on a case. I sit and rifle through the stacks of shit. Finally, I find it. It takes me a second to pass it to her. It still breaks my heart.\\n\\n \"Two-year old Sarah Mastermen missing from Chicago Hospital.\"\\n\\n She frowns at the paper, \"Me? I always assumed I was a Spicer like them.\"\\n\\n I shake my head, \"No. You had some teeth removed and filled and they stole you from the hospital. It was a simple surgery. Your parents were in the waiting room.\"\\n\\n She looks at it and I see the clouds of emotions rolling across her face. Finally, she mutters, \"Do they know?\"\\n\\n I nod, \"Yes. They know the basics. You\u0027re alive and not ready to see them. We needed to crack the memories before we risked telling them anything else. In case they came looking for you, before we had the chance to do all of this.\"\\n\\n \"They wouldn’t want me like this. I\u0027m a murderer,\" she is still defeated.\\n\\n I ignore it and focus on the positive, \"You are so close, Sarah. So close to fixing it all. Stop going backwards.\"\\n\\n She frowns at the wall behind me, \"You were tracking the things wrong with me?\" I ask, walking to the wall.\\n\\n \"Doctor Bradley is the best in memory recovery and PTSD. She helped me. She deals with extreme cases of hostage situations or kidnappings. People like us who need to learn to see the world again. Who need to see that the things we\u0027ve done aren’t who we are. Sometimes you\u0027re made to do something you don’t want to. That doesn’t make you guilty of it.\"\\n\\n She glances at me, \"You knew where I was all along? You\u0027ve been watching me? You left me there all this time?\"\\n\\n I fold my arms around myself, \"No. I didn’t know where you were. You made it to Clovis before the police could find you. I had searched high and low for you.\"\\n\\n \"How? How did you find me then?\"\\n\\n \"Emalyn is a pretty rare name, but combined with the name of the people who ruined my life. It was a breeze once I saw it. When you wrote that article in eleventh grade about the wastewater management, it came across my desk. Someone in one of our companies thought it was an interesting article and take on things from the perspective of the youth. I almost died when I saw that name. The combination. I flew out immediately.\"\\n\\n She is astonished, I can see it. She looks around, \"My article? From school? What do you do?\"\\n\\n \"I\u0027m a business man, I work with my family. This isn’t our office. It\u0027s Dr. Bradley\u0027s.\"\\n\\n \"How are you so rich? None of this is making sense. Not that it ever has.\"\\n\\n I almost sigh and tell her that is a story for another day, but I just answer the question, \"I was born rich, Sarah. Emalyn and I were with our parents that day because they were telling us they were getting a divorce. It was our family\u0027s first outing together in months. We were so excited. We didn’t know they took us there to tell us the bad news.\" I take a breath and just finish the rest of the timeline, \"I spent a couple years watching you. Studying you. I know everything about you. I know what you hide and who you are. I brought your file to Doctor Bradley, but she was scared you were completely submerged in the Emalyn Spicer character you had made. The life of the little lost orphan you had created. We created this abduction and reality to help you.\"\\n\\n She pushes me, \"You tortured me and hurt me to help me?\"\\n\\n I try not to make it anything but science, even though I know it\u0027s not scientific at all. It\u0027s barbaric, and yet, somehow it works. \"Yes. It was the only way. We thought maybe the relationship with Sebastian would help trigger things, but when you ended it, we knew. There was no other way. Studies have shown that victims, who are at the brink of death and lose everything, find peace all over again. They gain a coping mechanism and a new outlook on life. A new life. The New Leaf you wanted so badly.\"\\n\\n She looks like she might get sick but the clarity in her eyes is overwhelming. She is finally there. I knew I could make her come back to life. I smile and offer her my own pain so she can see how much better she will get, \"I have things, quirks if you will, that are leftover from the things that happened to us all. My quirks prevented me from living a normal life. Even close to normal. Sometimes they still do. The nightmares were brutal for a long time. My uncle knew Doctor Bradley. He knew I needed help. No one believed me that you were real. No one. The Spicers were sick people who tortured and murdered little girls. They never left one alive. You were my imaginary friend to everyone else. The girl who shot Emalyn. Everyone thought I had made you up to deal with the fact, I had shot my own sister while trying to kill the Spicers.\" I hate that it is my story, but if it can make her see she can get past this, then it\u0027s worth it. As long as she never learns the real truth about me. The truth about how I never really got better.\\n\\n There is guilt and pain in her eyes when she processes what I\u0027ve told her. I ignore it, \"You ran so fast and so far that we couldn’t find you. Not even a trace of you. When you did get caught living on the streets, they never imagined you were tied with the Spicer file. It was so far away. No one clued in that you were a girl missing from Chicago, because you weren\u0027t close to where you had been abducted from and it had been five years. You looked so different. No one had a clue who you were, and no Emalyn Spicer was missing. You were missed in the system.\"\\n\\n The light comes on when she thinks about it, \"I climbed into the back of a truck. I thought you left me. I didn’t blame you. After what I\u0027d done, I understood. I\u0027m sorry Eli.\"\\n\\n And there it is, she thought I left her.\\n\\n I look down, hoping to hide my shame and grin bitterly, \"When I found you, they all had to apologize. All of them. I am crazy, but I never imagined you. And I have never forgotten you.\"\\n\\n \"Why did you do all this?\"\\n\\n If I could answer because I love you I would, but she doesn’t even know me, not the way I know her.\\n\\n I shrug, \"You wished to be normal more than anything in the whole world. You were so broken and no one knew how to help you. The orphanage didn’t know how to help you because they didn’t know what you had been through. But I do. I get it.\"\\n\\n \"How did you know what I wished for?\"\\n\\n Because I love you.\\n\\n I lose a little control and run my fingers down her smooth cheek, \"I watched you nonstop for two years. There isn’t a thought in your mind that I can\u0027t read on your face.\" Caught up in the moment and greatness of seeing her reborn, I lower my face and press my lips against hers. She kisses back and I get lost for a second in the world of possibilities that loom over us.\\n\\n She breaks the spell with a question I can\u0027t answer, \"What do we do now?\"\\n\\n I remember my place in all of this, \"You go back to school and start over. New year, New Leaf, new you.\"\\n\\n She shakes her head and moves closer to me, \"I don’t want to. Can I stay here?\"\\n\\n I laugh and try to refrain myself. I force back images of the room I have in my apartment with the ornate door and the wall filled with things designed to hurt people. I clear my throat and chuckle nervously, \"Sarah, you are a master of denial. No one is as good as you are. I don’t want you wasting this. You need to work on you for a while. And I have to go back to work.\" \\n\\n","sourceLink":"https://allnovel.net/lost-boy-the-lonely-2/page-18.html","bookId":1889,"book":{"id":1889,"title":"Lost Boy (The Lonely #2)","description":"Storyline: Lost Boy (The Lonely #2) \\n 19+ \\n Being the boy who accidentally shot his sister was hard. \\n Never being able to find the girl who actually pulled the trigger was worse. \\n Convinced, through years of relentless therapy, that she was a figment of his trauma and imagination, Eli Adams gave up on her existence. \\n Until one day a name, bearing remarkable resemblance to the people missing in his life, showed up out of nowhere. \\n Suddenly he was thrust into a journey that forced him to offer up his soul as payment for the truth. \\n What he discovered along the way, was that the girl who took his sister\u0027s life and his hand, all those years ago, had become the thing he needed to be whole. \\n Saving her was one thing. \\n Healing her was another. \\n Convincing her to love him will be the toughest part of it all.\\n","cover":"https://allnovel.net/images/lost-boy-the-lonely-2.jpg","author":"Tara Brown","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/lost-boy-the-lonely-2.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:01:40 PM"}}
