{"id":84855,"no":30,"title":"Page 30","content":"\n Helen starts to cry again. Richard hugs her, \"Don’t cry yet, let\u0027s wait until we are holding our baby again.\" He nods at me, \"I\u0027ll get them settled in.\"\n The hotel staff are aware of what is going on. I can see their faces and the tears they are battling with.\n It\u0027s going to be a horrid day.\n When Stuart pulls up to the red awning, I open the door instantly and put my hand inside. She takes it. Michelle is screaming at me and being a bitch, huge surprise.\n I ignore her and wrap myself around Sarah, whispering, \"Don’t be strong and brave for them. Be you. They expect nothing.\" I can feel her tensing and shaking, so I bring her to the bathroom with the lady on it. I push the door shut and sit her on the counter. I look into her bright-blue eyes and smile as softly as I can. This moment isn’t about her and me. It\u0027s about her and them. I speak gently, \"They don’t have any expectations. They never even had hope until I confirmed who you were. Be you. You\u0027re sweet. We both know that.\"\n She nods and sniffles, \"I\u0027m scared.\"\n I kiss her forehead and hate that I am giving her back, \"I am too. But you have me, even if you don’t want me. I\u0027m here. I\u0027ll always be here.\" I grab my handkerchief and lift it to her face.\n Old Sarah surfaces, \"Is that clean?\"\n It makes me laugh and I wipe her eyes with it, \"Yes. Fresh from the laundry. Just let me wipe your eyes. When this is over, you and I need to have a very serious conversation. I don’t want to take away from the specialness of what you\u0027re about to do, so we\u0027ll just put that on the back burner. Just focus on this moment now. It\u0027s hard. I know that. You\u0027re amazing and they are lovely people. Trust me.\"\n She gives me a solid look, \"I do.\" I believe her.\n I put my hand out, she takes it, and I lead us back to the lobby. She is calm again. Michelle is standing too close to Stuart. I glare at her but she ignores me and looks at Sarah, \"You okay, Sarah?\"\n She nods but moves closer to me. She is telling Michelle to back off, thank God. I catch a glimpse of her sanitizer in her hand. This is making her revert a little. I whisper again, \"You ready to do this?\"\n She gives me a firm nod, \"Yup.\"\n Michelle smiles at her, \"They\u0027re going to love you. Like we do.\"\n Sarah starts to shake again, \"You\u0027re already more than any orphan could ask for. Let\u0027s go.\"\n I pull her to the elevator. Michelle leans in and kisses her cheek and I fight the urge to smack her head into the wall. Stuart is giving me a deadly glare every time I look at Michelle.\n I squeeze Sarah, and when the elevator goes to the right floor, I pull her to the door before she can chicken out.\n When I knock, Richard opens the door. He looks like he is about to cry at any second. Helen comes and stands beside him. Having the three of them so close together, the likeness is uncanny.\n Helen breaks a little, sobbing into Richard. My heart hurts but I grip to Sarah. They drag her into an embrace and she drags me with her. She grips to me like she will die if she lets go.\n No one speaks until Helen finally says, \"You look just like my mother.\" It\u0027s a broken whisper.\n I see Sarah close her eyes and let it all become real. I nod at the room, \"Let\u0027s just step inside.\"\n We don’t walk into the room, we just stand and watch them. Lyle and Jake are bawling, Richard has lost all control. Sarah just stares at them with hope in her eyes.\n Lyle points at them all, \"Dad, Mom, Jake, Lyle.\"\n Finally we move into the room, Helen dragging Sarah and I. She leaps at me, \"Thank you, thank you, thank you. You dear boy. Thank you.\" I bite the inside of my lip and try desperately not to cry too.\n I can\u0027t look around the room. My brother\u0027s face will be the one that kills me. There is nothing a lost child wants more than this and neither of us ever got it.\n We are getting it now through her. I know he\u0027s crying, I can hear it, but I can\u0027t look.\n Richard pulls back from mauling her, stammering, \"Sorry, Sarah. I just…well…we….never imagined. We hoped.\"\n She finally lets go of me and moves into them. I let go of her and step back. They start their reunion.\n Helen asks softly, \"Sarah, do you remember us?\"\n She pauses and nods, \"I remember gingerbread cookies, skating on a pond, hot cocoa, and a black and white cat.\"\n They all cry harder, \"The pond is at my mother\u0027s farmhouse. Your grandma,\" Helen says through the tears.\n They look expectant but Sarah shakes her head, \"I don’t have anything else to give. I wish I did.\"\n The whole family hugs and attacks each other with love. One of her brothers reaches over and drags me into the embrace. I feel so conflicted. One side of me is completely awkward and the other is desperate to be part of them.\n Helen breaks up the hug and points at the chairs, \"Come and sit, Sarah. We have so much to talk about.\"\n Sarah grabs Michelle and introduces her, \"This is Michelle. She has been my family since I was eight.\"\n Helen hugs her tightly, \"Thank you, Michelle. Thank you.\"\n Michelle breaks and I like seeing it. I would have sworn she had no heart at all.\n Sarah points at Stuart, \"This is Stuart. He helped me remember everything that happened. And he keeps me safe.\" Helen drags him into the hug with Michelle. He sobs harder.\n Sarah takes my hand and pulls me to a chair, to sit next to her.\n Helen gets the baby book out and holds it. I clench my jaw. I\u0027ve seen it. Damned near killed me.\n Helen smiles, \"I\u0027m Helen, if you don’t want to call me Mom just yet. Your Dad\u0027s name is Roger.\" She grips the book, \"This is yours.\" She passes it to her.\n I try not to look down at the wisp of blonde hair inside of the book. The torture of it is too much.\n \"You had almost none, so chubby and bald, compared to your brothers. But we managed to get a bit for the baby book.\" Helen sounds lost. \"Happy birthday, baby. You were the baby. Lyle is twenty-three and Jake is twenty-five. They were five and seven when you were taken.\"\n She flips the worn pages as Helen continues talking, \"We searched…for so long. About five years ago we had that built.\"\n I glance down at the picture of the monument in the book. The image of it brings the white noise. I grip to her to stave it off.\n Helen shakes her head, \"We just thought, well, we gave up. For that, we are so sorry.\"\n Sarah shakes her head too, \"I gave up too.\"\n Helen covers her face for a moment, sobbing and losing herself in her shame for a minute. She sniffles and looks up, \"We would like for you to come home with us.\"\n I feel Sarah tensing so I grip back, reminding her I am there. She takes a breath and nods, \"I can come.\"\n Helen looks at us, \"You should bring your friends, of course. We have plenty of room.\"\n Sarah sounds so small, \"When?\"\n \"Easter? We would love it if you came for Easter.\"\n Sarah sounds a little excited about it, \"Can we visit again though?\" She doesn’t want to wait until Easter to see them again.\n I smile and pat her leg, \"I was thinking perhaps I could host breakfast tomorrow. We can have it catered here in one of the small meeting rooms. I have the staff on standby with the idea.\"\n Helen smiles, \"Yes.\" The men all agree when Helen looks back at them. They are all frozen and desperate not to continue crying. I can tell by looking at them and their silence.\n Sarah closes the book, \"Thank you for meeting with us. You are the best birthday present I have ever gotten.\"\n Richard comes and takes her hands, \"You are the greatest gift any of us could ever have.\" He lifts her from the seat and hugs her again.\n I am about to cry. I have seconds of control left. I stand next to her and speak softly, \"We should be going. It\u0027s no doubt overload for everyone.\"\n I step away from her and let them hug and kiss and savor the moments they finally have, after all this time. We walk to the elevator and all you can hear are whispers and sobs and sniffles. It\u0027s the craziest thing I have ever seen.\n Richard comes over to me and leans into me, \"You love her. I see that now. So that is why?\" My eyes fill with tears. I give him a single nod. He pats my back, \"We love you too, son. You kept her safe, even when you were a boy. You kept her safe when I could not. You have protected her all your life. You have my permission to love my daughter.\"\n A tear streams my cheek. He hugs me and nods. I don’t know what to say. I never fucking do.\n He goes to Sarah and hugs her. She gets a strange look on her face as he whispers to her. I wipe my face dry and smirk at her panicked look. She\u0027s as bad as I am. She sees me grinning and frowns. It makes me laugh.\n We get into the elevator after one more goodbye. The elevator is still filled with sobbing. Stuart gives me a look and whispers, \"I\u0027m gonna take her home.\" I nod. Sarah thinks Stuart’s talking to her. She doesn’t see he is my brother.\n I get off the elevator and hold my hand out for her. She takes it and we go to the SUV. I don’t say anything. I don’t know what to say and silence is better.\n Finally, and with a not very nice tone, she asks me the very thing I want to ask her, \"What did he say to you at the elevator?\"\n I answer plainly, \"He thanked me for being there for you, even as a boy, when he could not protect you himself. He told me that I had his permission to love you.\"\n I drive out of the city. I don’t even know where I\u0027m going, but when I see the sign for freeway, I smile. My body just knew I needed the beach. The wind makes me feel clean.\n She leans into the window and mutters, \"I feel so vulnerable having them again. Like I have something to lose.\"\n I look at her, \"What happens if you lost them all tomorrow? Would that take away from the joy and the love you got from them there at the suite?\"\n She shakes her head.\n \"Sarah, that feeling is forever. It doesn\u0027t shrink or grow. It\u0027s just there. It exists. It\u0027s yours and no one can take that.\" It\u0027s so easy to talk to her about her family and healing. I wish I could talk this easily about us. \n","sourceLink":"https://allnovel.net/lost-boy-the-lonely-2/page-30.html","bookId":1889,"book":{"id":1889,"title":"Lost Boy (The Lonely #2)","description":"Storyline: \n Lost Boy (The Lonely #2) \n 19+ \n Being the boy who accidentally shot his sister was hard. \n Never being able to find the girl who actually pulled the trigger was worse. \n Convinced, through years of relentless therapy, that she was a figment of his trauma and imagination, Eli Adams gave up on her existence. \n Until one day a name, bearing remarkable resemblance to the people missing in his life, showed up out of nowhere. \n Suddenly he was thrust into a journey that forced him to offer up his soul as payment for the truth. \n What he discovered along the way, was that the girl who took his sister\u0027s life and his hand, all those years ago, had become the thing he needed to be whole. \n Saving her was one thing. \n Healing her was another. \n Convincing her to love him will be the toughest part of it all.\n \n","cover":"https://allnovel.net/images/lost-boy-the-lonely-2.jpg","author":"Tara Brown","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/lost-boy-the-lonely-2.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:01:40 PM"}}
