{"id":84829,"no":4,"title":"Page 4","content":"The nun walks to her office. I notice the smell of the place again. Sterile and frightening. Kids can\u0027t find joy in this place, there’s no way. It’s like kid prison. When I sit down, I keep my arrogant flare riding high. She’s a bit of a ball buster, and I don’t dare let her think she can one up me, even if I have to admit she’s scary in the habit. I know there is a horror movie I watched once with nuns floating down a breezy hallway. The whole scene is somewhere in the back of my mind, haunting my dreams. “I understand you wish to tell me how to run my orphanage?” I watch her for a second before I nod, “Yes.” She looks affronted, “You think you know how to raise these children, better than I do?” I shake my head, “No.” Her eyes narrow, “Is this a game to you, Mr. Adams?” I shake my head again but this time more slowly. I am trembling on the edge of my anger, “I owe that girl the sun, the moon, and the stars. I owe her everything in the whole world. The only reason I haven’t checked her out, is that our therapist agrees she will meltdown and close up. It will destroy the tiny amount of sanity she clings to, if I take her from here. She isn’t ready for reality. She can\u0027t face the things that she’s done and have been done to her. The moment we are cleared from that, I will spend every second of my life recreating the world for her. Do you understand that level of devotion and care?” The nun swallows and clasps her hands, “We understand her sit…” I slap my hand on her mahogany desk, “NO!” I shudder with anger, “You don’t. You don’t know what it\u0027s like to accidentally kill a small child who is about to be raped by a fucking savage.” I push the spark down. I can’t feel my legs. I want to run or kick the door in and just take her. I take a breath, “Forgive me.” I just said fuck to a nun. If I wasn’t already going to hell, I\u0027d worry. She looks frightened but nods. I continue calmly, “You and I both, have no idea what it’s like being her. She believes she’s Emalyn. If we take that from her…well, Doctor Bradley believes she will cocoon herself in denial and possibly go catatonic.” The nun frowns, “You are certain this is the girl?” I nod, “That is the girl. I would know her from a mile even if I were blind. What we went through, it bonded us. I know her. Her name isn’t Emalyn, she took that from my sister. She must have been only five or six-years old when it happened. The Spicers called her kid, and a variety of other names I won\u0027t repeat. They never said her name. They did say Emalyn; I’m assuming she took the name because it was the only one she had heard in a while.” “Well, she seems to be very normal for what she has been through.” I tap my fingers against the chair like Jane does and stop myself. I hate that I’ve picked up annoying habits from her. “She doesn’t remember anything. She’s blocked everything out. The world isn’t real. How normal is that? She calls herself the name of a dead girl she shot.” The nun smiles as if she is trying to avoid the things I am making her feel, “What would you like us to change?” I hold up a finger, “New rules. You don’t ever touch her. No one lays a hand on her or hits her with anything. I will remove any appendage that comes in physical contact with her body. I understand this makes me sound crazy; I am comfortable with that and a prison sentence defending her.” She looks at me like I am insane, but nods slowly. I hold up a second finger, “My millions I am donating will benefit her. I want her to have slightly-nicer clothes, nothing obvious, but come on. Those clothes are disturbing. She looks like she’s Amish. She should look like a teenager, not a Sister Wife. I want driving lessons, healthy food, and vitamins. I want it for them all.” She nods, “That is generous of you.” I shake my head and hold up my third finger, “It’s not. It’s common decency. Thirdly, she continues to see a therapist weekly. This is kept quiet. I will have the appointments all set up; Dr. Bradley will continue to treat her.” I hold up a fourth finger, “She gets more freedom. This place is dank, cold, and boring as hell. The kids here look like they belong on the set of Flowers in the Attic. I almost want to ask to see what you’re putting in the cookies, but I won\u0027t because I highly doubt they get cookies. I can tell that from watching her through that window. She is being suffocated. More freedom to explore town and make friends. From now on the grade ten through twelve students will go to the public school. They will have normal clothes and go there.” She looks like she wants to talk, but I wave my first finger at her, “Completely comfortable with prison time.” She sighs, “You’re being a tyrant and treating us like we’re a sub par facility.” I nod, “You are, and if you don’t cooperate with me, I will have officials from the federal government investigating you. The things that fly in a rinky-dink, little, backwoods town in New Mexico don’t fly so easily when your facility is in the New York Times for the world to see.” I stand to leave, “My secretary will be in touch tomorrow. She will organize it all for you and wire the money. The contract you will sign will contain all of the elements we have just discussed. You honestly don’t need to change a single thing. I will have staff provided for the orphanage. They will work as cleaners and maintenance and help with the children. Each will be cleared through the FBI and they will report back to me. Good day.” I leave, not going up the stairs, kicking in the door, sweeping her up into my arms, and running like a wild man. I leave and I force myself to believe it all has a purpose. Chapter Three “You sure you want this? It’s kinda girlie.” I look up at the tattoo girl and frown, “Yes and maybe less talking from you.” She gives me a look, “Don’t be pissy before I put the tatt on, dude. Pissy before means I might slip.” I fight the sneer on my face and lose the battle, “I pay for the quality I see.” She shrugs and looks between my legs, blatantly obvious about it too, “Okay. You can be girlie if you want to, baby. I suspect you can afford some girlie.” She winks. I give Stuart a look. He chuckles, “Yeah, baby.” He winks like her, but she’s still staring at my groin. I roll my eyes, “It’s Shakespeare.” She shrugs as I lie on my stomach on the table. The needle is bliss. The small stabs and drags against my ribs are beautiful agony. “What does it mean?” I close my eyes and let the slight pain wash over me, “It’s a speech about tolerance from The Merchant of Venice, by Shakespeare. It means that even though you see me differently, I have the same reactions to things as you. I am human, just different than you but no less worthy of love, respect, and justice. I bleed, laugh, and die the same as you, regardless of the differences inside of me. Or outside.” She sighs, “Wow. You’re like one of those super-deep guys, aren’t you?” I chuckle, “Not so much. I just like the scene. I like that it blatantly points out that differences don\u0027t change the fact we are all human.” I glance at Stuart. He looks bored, “You shoulda got the one with the sword. I like that one better.” I shake my head, “No. This is for her.” Stuart shakes his head, “Shoulda got a heart or something, bro.” I glance at him, “No.” He knows not to push it. “Your girlfriend?” she asks. I shake my head, “Just my girl.” I don’t elaborate and she doesn’t ask. She finishes and holds up the mirror for me to see it. \u0027If you prick us, do we not bleed? If you tickle us, do we not laugh? If you poison us, do we not die? And if you wrong us, shall we not revenge?\u0027 I nod, “Perfect.” She beams as she puts the bandage over it, “You have nice skin. You want another one?” I shake my head, “Not today.” I slap down the cash and walk out, pulling my shirt on. “The heat here is crazy, for winter. Normally I hate Boston\u0027s winters, but this is weird. It feels wrong to not be cold.” Stuart complains as we walk to the truck, \"Maybe no snowbirds for us.\" I laugh, “Can you still see her on the feed?” He sighs, “Dude, she’s in class. You gotta chill out. The security guard at the school is sitting outside her classroom.” It happens too quickly. I can\u0027t shut it down. I grab his shirt in an act of violence, not okay with either of us, and seethe, “This isn’t going to get better until she is. It isn’t going to get easier. So if you need to walk, do it now. Otherwise, shut the hell up about it. I am not going to chill out, dude.” He chuckles but eyeballs my hands on him, “You can\u0027t even say dude normally.” He shoves me off and straightens his shirt, “I was just saying. That’s all.” I feel my lip curl up but he points at me, “There’s an underground fight ring in the city here, you need to go?” The idea of it perks up my spirits, but the thought of leaving her unobserved makes me sweaty in the palms. I shake my head, “No.” He nudges me, “What do you need me to do? This sitting in the middle of butt-fuck nowhere is gonna give me a stroke. My ADHD can’t handle shit like this. I need a job. You cool if I find something to do when you\u0027re on watch?” I restrain from choking him and slap his back, “Please, find something to do before I lose it. I don’t have anything, but I’m sure my father has something—or you know what, just go have fun. When are we ever going to be in New Mexico? Go see things and tourist about.” He grins and runs his hands through his short, dark hair, “Alright, I need to go run some fights. I’m gonna hustle some cash outta these bumpkins. We cool?” “Yes.”","sourceLink":"https://allnovel.net/lost-boy-the-lonely-2/page-4.html","bookId":1889,"book":{"id":1889,"title":"Lost Boy (The Lonely #2)","description":"Storyline: Lost Boy (The Lonely #2) 19+ Being the boy who accidentally shot his sister was hard. Never being able to find the girl who actually pulled the trigger was worse. Convinced, through years of relentless therapy, that she was a figment of his trauma and imagination, Eli Adams gave up on her existence. Until one day a name, bearing remarkable resemblance to the people missing in his life, showed up out of nowhere. Suddenly he was thrust into a journey that forced him to offer up his soul as payment for the truth. What he discovered along the way, was that the girl who took his sister\u0027s life and his hand, all those years ago, had become the thing he needed to be whole. Saving her was one thing. Healing her was another. Convincing her to love him will be the toughest part of it all.","cover":"https://allnovel.net/images/lost-boy-the-lonely-2.jpg","author":"Tara Brown","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/lost-boy-the-lonely-2.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:01:40 PM"}}
