{"id":13237,"no":39,"title":"XXXIX TIGHT PINCH","content":"From Camp Villeré, close below small Camp Callender, one more last regiment--Creoles--was to have gone that afternoon to the Jackson Railroad Station and take train to join their Creole Beauregard for the defence of their own New Orleans. More than a day\u0027s and a night\u0027s journey away was \"Corinth,\" the village around which he had gathered his forces, but every New Orleans man and boy among them knew, and every mother and sister here in New Orleans knew, that as much with those men and boys as with any one anywhere, lay the defence and deliverance of this dear Crescent City. With Grant swept back from the Tennessee, and the gunboats that threatened Island Ten and Memphis sunk, blown up; or driven back into the Ohio, New Orleans, they believed, could jeer at Farragut down at the Passes and at Butler out on horrid Ship Island. \"And so can Mobile,\" said the Callenders to the Valcours. \"The fortunes of our two cities are one!\" cried Constance, and the smiling Valcours were inwardly glad to assent, believing New Orleans doomed, and remembering their Mobile home burned for the defence of the two cities of one fortune. However, the Camp Villeré regiment had not got off, but would move at midnight. On the train with them Hilary was sending recruits to the battery, younger brothers of those who had gone the year before. He had expected to conduct, not send, them, but important work justified--as Anna told Flora--his lingering until his uncle should bid him come. Which bidding Irby might easily have incited, by telegraph, had Flora let him. But Flora\u0027s heart was too hopelessly entangled to release Hilary even for the gain of separating him from Anna; and because it was so entangled (and with her power to plot caught in the tangle), she was learning to hate with a distemper of passion that awed even herself. \"But I must clear out mighty soon,\" said Hilary that evening to Greenleaf, whose exchange he had procured at last and, rather rashly, was taking him to Callender House to say good-by. They talked of Anna. Greenleaf knew the paramount secret; had bravely given his friend a hand on it the day he was told. Now Hilary said he had been begging her again for practical steps, and the manly loser commended. \"But think of that from me, Fred! who one year ago--you know how I talked--about Steve, for instance. Shame!--how reckless war\u0027s made us. Here we are, by millions, in a perpetual crash of victory and calamity, and yet--take me for an example--in spite of me my one devouring anxiety--that wakes me up in the night and gives me dreams in the day--is how to get her before this next battle get\u0027s me. Yes, the instant I\u0027m ordered I go, and if I\u0027m not ordered soon I go anyhow. I wouldn\u0027t have my boys\"--etc. And still the prison-blanched Greenleaf approved. But the next revelation reddened his brow: Anna, Hilary said, had at last \"come round--knuckled down! Yes, sir-ee, cav-ed in!\" and this evening, after the Bazaar, to a few younger sisters of the battery whom she would ask to linger for a last waltz with their young heroes, she would announce her engagement and her purpose to be wed in a thrillingly short time. The two men found the Bazaar so amusingly collapsed that, as Hilary said, you could spell it with a small b. A stream of vehicles coming and going had about emptied the house and grounds. No sentries saluted, no music chimed. In the drawing-rooms the brass gun valiantly held its ground, but one or two domestics clearing litter from the floors seemed quite alone there, and some gay visitors who still tarried in the library across the hall were hardly enough to crowd it. \"Good,\" said Hilary beside the field-piece. \"You wait here and I\u0027ll bring the Callenders as they can come.\" But while he went for them whom should Greenleaf light upon around a corner of the panelled chimney-breast but that secret lover of the union and all its defenders, Mademoiselle Valcour. Her furtive cordiality was charming as she hurriedly gave and withdrew a hand in joy for his liberation. \"Taking breath out of the social rapids?\" he softly inquired. \"Ah, more! \u0027Tis from that deluge of--\" He understood her emotional gesture. It meant that deluge of disloyalty--rebellion--there across the hall, and all through this turbulent city and land. But it meant, too, that they must not be seen to parley alone, and he had turned away, when Miranda, to Flora\u0027s disgust, tripped in upon them with her nose in full wrinkle, archly surprised to see Flora here, and proposing to hale both into the general throng to applaud Anna\u0027s forthcoming \"proclamation!\" Greenleaf de trop? Ah, nay! not if he could keep the old Greenleaf poise! and without words her merry nose added that his presence would only give happier point to what every one regarded as a great Confederate victory. At a subtle sign from Flora the hostess and he went, expecting her to follow. But Flora was in a perilous strait. Surprised by Hilary\u0027s voice, with the panel open and the knife laid momentarily in the recess that both hands might bring the jewels from the case, she had just closed the opening with the dagger inside when Greenleaf confronted her. Now, in this last instant of opportunity at his and Miranda\u0027s back, should she only replace the weapon or still dare the theft? At any rate the panel must be reopened. But when she would have slid it her dainty fingers failed, failed, failed until a cold damp came to her brow and she trembled. Yet saunteringly she stepped to the show-case, glancing airily about. The servants had gone. She glided back, but turned to meet another footfall, possibly Kincaid\u0027s, and felt her anger rise against her will as she confronted only the inadequate Irby. A sudden purpose filled her, and before he could speak: \"Go!\" she said, \"telegraph your uncle! instantly!\" \"I\u0027ve done so.\" Her anger mutinied again: \"Without consult\u0027--! And since when?\" \"This morning.\" She winced yet smiled: \"And still--your cousin--he\u0027s receive\u0027 no order?\" Her fingers tingled to maim some one--this dolt--anybody! Her eyes sweetened. Irby spoke: \"The order has come, but--\" \"What! you have not given it?\" \"Flora, it includes me! Ah, for one more evening with you I am risking--\" Her look grew fond though she made a gesture of despair: \"Oh, short-sighted! Go, give it him! Go!\" Across the hall a prolonged carol of acclamation, confabulation, laughter, and cries of \"Ah-r, indeed!\" told that Anna\u0027s word was out. \"What difference,\" Irby lingered to ask, \"can an hour or two between trains--?\" But the throng was upon them. \"We don\u0027t know!\" cried Flora. \"Give it him! We don\u0027t know!\" and barely had time herself to force a light laugh when here were Charlie and Victorine, Hilary, Anna, Miranda, Madame, Constance, Mandeville, and twenty others. \"Fred!\" called Hilary. His roaming look found the gray detective: \"Where\u0027s Captain Greenleaf?\" \"Gone.\" \"With never a word of good-by? Oh, bless my soul, he did say good-by!\" There was a general laugh. \"But this won\u0027t do. It\u0027s not safe for him--\" The gray man gently explained that his younger associate was with Greenleaf as bodyguard. The music of harp and violins broke out and dancers swept round the brass gun and up and down the floors.","sourceLink":"http://novel.tingroom.com/jingdian/2232/62686.html","bookId":440,"book":{"id":440,"title":"Kincaid\u0027s Battery","description":"简介： For the scene of this narrative please take into mind a wide quarter-circle of country, such as any of the pretty women we are to know in it might have covered on the map with her half-opened fan....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2232","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
