{"id":13240,"no":42,"title":"XLII \"VICTORY! I HEARD IT AS PL\u0027--\"","content":"The last few days of March and first three or four of April, since the battery boys and the three captains had gone, were as full of frightened and angry questions as the air is of bees around a shaken hive. \n \n So Anna had foreboded, yet it was not so for the causes she had in mind; not one fierce hum asked another where the bazaar\u0027s money was. That earlier bazaar, in the St. Louis Hotel, had taken six weeks to report its results, and now, with everybody distracted by a swarm and buzz of far larger, livelier, hotter queries, the bazaar\u0027s sponsors might report or not, as they chose. Meanwhile, was the city really in dire and shameful jeopardy, or was it as safe as the giddiest boasted? Looking farther away, over across Georgia to Fort Pulaski, so tremendously walled and armed, was the \"invader\" merely wasting lives, trying to take it? On North Carolina\u0027s coast, where our priceless blockade-runners plied, had Newbern, as so stubbornly rumored, and had Beaufort, already fallen, or had they really not? Had the Virginia not sunk the Monitor and scattered the Northern fleets? Was it not by France, after all (asked the Creoles), but only by Paraguay that the Confederacy had been \"reco\u0027nize\u0027\"? Was there no truth in the joyous report that McClellan had vanished from Yorktown peninsula? Was the loss of Cumberland Gap a trivial matter, and did it in fact not cut in two our great strategic front? Up yonder at Corinth, our \"new and far better\" base, was Sidney Johnston an \"imbecile,\" a \"coward,\" a \"traitor\"? or was he not rather an unparagoned strategist who, having at last \"lured the presumptuous foe\" into his toils, was now, with Beauregard, notwithstanding Beauregard\u0027s protracted illness, about to make the \"one fell swoop\" of our complete deliverance? And after the swoop and its joy and its glory, when Johnnie should come marching home, whose Johnnies, and how many, would never return? As to your past-and-gone bazaar, law, honey--! \n \n So, as to that item, in all the wild-eyed city shaking with its ague of anxieties only Anna was troubled when day after day no detective came back with the old mud-caked dagger and now both were away on some quite alien matter, no one could say where. She alone was troubled, for she alone knew it was the bazaar\u0027s proceeds which had disappeared. Of what avail to tell even Miranda, Connie, or Flora if they must not tell others? It would only bind three more souls on the rack. \"Vanished with the dagger!\" That would be all they could gasp, first amazed, then scandalized, at a scheme of safe-keeping so fantastically reckless; reckless and fantastical as her so-called marriage. Yes, they would be as scandalized as they would have been charmed had the scheme prospered. And then they would blame not her but Hilary. Blame him in idle fear of a calamity that was not going to befall! \n \n She might have told that sternest, kindest, wisest of friends, Doctor Sevier. As the family\u0027s trustee he might yet have to be told. But on that night of fantastical recklessness he had been away, himself at Corinth to show them there how to have vastly better hospitals, and to prescribe for his old friend Beauregard. He had got back but yesterday. Or she might have told the gray detective, just to make him more careful, as Hilary, by letter, suggested. In part she had told him, through Flora; told him that to save that old curio she would risk her life. Surely, knowing that, he would safeguard it, in whatever hands, and return it the moment he could. Who ever heard of a detective not returning a thing the moment he could? Not Flora, not yet Madame, they said. To be sure, thought Anna, those professional masters of delay, the photographers, might be more jewel-wise than trustworthy, but what photographer could ever be so insane as to rob a detective? So, rather ashamed of one small solicitude in this day of great ones, she urged her committees for final reports--which never came--and felt very wisely in writing her hero for his consent to things, and to assure him that at the worst her own part of the family estate would make everything good, the only harrowing question being how to keep Miranda and Connie from sharing the loss. \n \n On the first Sunday evening in April Doctor Sevier took tea with the Callenders, self-invited, alone and firmly oblivious of his own tardy wedding-gift to Anna as it gleamed at him on the board. To any of a hundred hostesses he would have been a joy, to share with as many friends as he would consent to meet; for in the last week he had eaten \"hog and hominy,\" and sipped corn-meal coffee, in lofty colloquy with Sidney Johnston and his \"big generals\"; had talked confidentially with Polk, so lately his own bishop; had ridden through the miry streets of Corinth with all the New Orleans commanders of division or brigade--Gibson, Trudeau, Ruggles, Brodnax; out on the parapets, between the guns, had chatted with Hilary and his loved lieutenants; down among the tents and mess-fires had given his pale hand, with Spartan injunctions and all the home news, to George Gregory, Ned Ferry, Dick Smith, and others of Harper\u0027s cavalry, and--circled round by Charlie Valcour, Sam Gibbs, Maxime, and scores of their comrades in Kincaid\u0027s Battery--had seen once more their silken flag, so faded! and touched its sacred stains and tatters. Now at the tea table something led him to remark that here at home the stubborn illness of this battery sister for whom Anna was acting as treasurer had compelled him to send her away. \n \n Timely topic: How to go into the country, and whither. The Callenders were as eager for all the facts and counsel he could give on it as if they were the \"big generals\" and his facts and counsel were as to the creeks, swamps, ridges, tangled ravines, few small clearings, and many roads and by-roads in the vast, thinly settled, small-farmed, rain-drenched forests between Corinth and the clay bluffs of the Tennessee. For now the Callenders also were to leave the city, as soon as they could be ready. \n \n \"Don\u0027t wait till then,\" crisply said the Doctor. \n \n \"We must wait till Nan winds up the bazaar.\" \n \n He thought not. In what bank had she its money? \n \n When she said not in any he frowned. Whereupon she smilingly stammered that she was told the banks themselves were sending their treasure into the country, and that even ten days earlier, when some one wanted to turn a fund into its safest portable form, three banks had declined to give foreign exchange for it at any price. \n \n \"Hmm!\" he mused. \"Was that your, eh,--?\" \n \n \"My husband, yes,\" said Anna, so quietly that the sister and stepmother exulted in her. As quietly her eyes held the doctor\u0027s, and his hers, while the colour mounted to her brow. He spoke: \n \n \"Still he got it into some good shape for you, the fund, did he not?\" Then suddenly he clapped a hand to a breast pocket and stared: \"He gave me a letter for you. Did I--? Ah, yes, I have your written thanks. Anna, I thoroughly approve what you and he have done.\" \n \n Constance and Miranda were overjoyed. He turned to them: \"I told Hilary so up in camp. I told Steve. Yes, Anna, you were wise. You are wise. I\u0027ve no doubt you\u0027re doing wisely about that fund.\" \n \n It was hard for the wise one not to look guilty. \n \n \"Have you told anybody,\" he continued, \"in what form you have it, or where?\" \n \n \"No!\" put in the aggrieved Constance, \"not even her blood kin!\" \n \n \"Wise again. Best for all of you. Now just hang to the lucre. It comes too late to be of use here; this brave town will have to stand or fall without it. But it\u0027s still good for Mobile, and Mobile saved may be New Orleans recovered.\" \n \n On a hint from the other women, and urged by their visitor, Anna brought the letter and read him several closely written pages on the strategic meaning of things. The zest with which he discussed the lines made her newly proud of their source. \n \n \"They\u0027re so like his very word o\u0027 mouth,\" said he, \"they bring him right back here among us. Yes, and the whole theatre of action with him. They draw it about us so closely and relate it all to us so vitally that it--\" \n \n \"Seems,\" broke in the delighted Constance, \"as if we saw it all from the top of this house!\" \n \n The Doctor\u0027s jaw set. Who likes phrases stuffed into his mouth? Yet presently he allowed himself to resume. It confirmed, he said, Beauregard\u0027s word in his call for volunteers, that there, before Corinth, was the place to defend Louisiana. Soon he had regained his hueless ardor, and laid out the whole matter on the table for the inspiration of his three confiding auditors. Here at Chattanooga, so impregnably ours, issued Tennessee river and the Memphis and Charleston railroad from the mountain gateway between our eastern and western seats of war. Here they swept down into Alabama, passed from the state\u0027s north-east to its north-west corner and parted company. Here the railway continued westward, here it crossed the Mobile and Ohio railroad at Corinth, here the Mississippi Central at Grand Junction, and pressed on to Memphis, our back-gate key of the Mississippi. \n \n \"In war,\" said the Doctor, \"rivers and railro\u0027--\" \n \n \"Are the veins and arteries of--oh, pardon!\" The crime was Anna\u0027s this time. \n \n \"Are the lines fought for,\" resumed the speaker, \"and wherever two or three of them join or cross you may look for a battle.\" His long finger dropped again to the table. Back here in Alabama the Tennessee turned north to seek the Ohio, and here, just over the Mississippi state line, in Tennessee, some twenty miles north of Corinth, it became navigable for the Ohio\u0027s steamboats--gunboats--transports--at a place called in the letter \"Pittsburg Landing.\" \n \n Yes, now, between Hilary\u0027s pages and the Doctor\u0027s logic, with Hilary almost as actually present as the physician, the ladies saw why this great Memphis-Chattanooga fighting line was, not alone pictorially, but practically, right at hand! barely beyond sight and hearing or the feel of its tremor; a veritable back garden wall to them and their beloved city; as close as forts Jackson and St. Philip, her front gate. Yes, and--Anna ventured to point out and the Doctor grudgingly admitted--if the brave gray hosts along that back wall should ever--could ever--be borne back so far southward, westward, the last line would have to run from one to another of the Crescent City\u0027s back doorsteps and doors; from Vicksburg, that is, eastward through Jackson, Mississippi\u0027s capital, cross the state\u0027s two north-and-south railways, and swing down through Alabama to Mobile on the Gulf. This, she silently perceived, was why the letter and the Doctor quite agreed that Connie, Miranda, and she ought to find their haven somewhere within the dim region between New Orleans and those three small satellite cities; not near any two railways, yet close enough to a single one for them to get news, public or personal, in time to act on it. \n \n At leave-taking came the guest\u0027s general summing up of fears and faiths. All his hope for New Orleans, he said, was in the forts down at the Passes. Should they fall the city could not stand. But amid their illimitable sea marshes and their impenetrable swamp forests, chin-deep in the floods of broken levees, he truly believed, they would hold out. Let them do so only till the first hot breath of real Delta summer should bring typhoid, breakbone, yellow, and swamp fevers, the last by all odds the worst, and Butler\u0027s unacclimated troops would have to re?mbark for home pell-mell or die on Ship Island like poisoned fish. So much for the front gate. For the back gate, Corinth, which just now seemed--the speaker harkened. \n \n \"Seemed,\" he resumed, \"so much more like the front--listen!\" There came a far, childish call. \n \n \"An extra,\" laughed Constance. \"Steve says we issue one every time he brushes his uniform.\" \n \n \"But, Con,\" argued Anna, \"an extra on Sunday evening, brought away down here--\" The call piped nearer. \n \n \"Victory!\" echoed Constance. \"I heard it as pl\u0027--\" \n \n \"Beauregard! Tennessee!\" exclaimed both sisters. They flew to the veranda, the other two following. Down in the gate could be seen the old coachman, already waiting to buy the paper. Constance called to him their warm approval. \"I thought,\" murmured Miranda, \"that Beauregard was in Miss\u0027--\" \n \n Anna touched her, and the cry came again: \"Great victory--!\" Yes, yes, but by whom, and where? Johnston? Corinth? \"Great victory at--!\" Where? Where, did he say? The word came again, and now again, but still it was tauntingly vague. Anna\u0027s ear seemed best, yet even she could say only, \"I never heard of such a place--out of the bible. It sounds like--Shiloh.\" \n \n Shiloh it was. At a table lamp indoors the Doctor bent over the fresh print. \"It\u0027s true,\" he affirmed. \"It\u0027s Beauregard\u0027s own despatch. \u0027A complete victory,\u0027 he says. \u0027Driving the enemy\u0027--\" The reader ceased and stared at the page. \"Why, good God!\" Slowly he lifted his eyes upon those three sweet women until theirs ran full. And then he stared once more into the page: \"Oh, good God! Albert Sidney Johnston is dead.\" \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2232/62689.html","bookId":440,"book":{"id":440,"title":"Kincaid\u0027s Battery","description":"简介： For the scene of this narrative please take into mind a wide quarter-circle of country, such as any of the pretty women we are to know in it might have covered on the map with her half-opened fan....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2232","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
