{"id":96258,"no":9,"title":"Page 9","content":"I wanted Billy to have a positive experience for his first dance, and I wanted to make sure he\u0027d treat Stormy to the gentlemanly behavior that Alexander always showed me. I didn\u0027t want my brother to act like the Nerd Boy that he was, so I brought in reinforcements - my mother.\\n\\n She dragged us both to Jack\u0027s Department Store, and while she was outfitting Billy with a new suit, I browsed through the junior dresses. I had already decided on a dress at home, but I saw one on the clearance rack that caught my eye. It was a stunning strapless indigo-blue corset dress with hints of black feathers. Wow - I never found things like this in Dullsville, only during Halloween or at a thrift store.\\n\\n I took it off the rack and quickly read the size - which happened to be mine. I held it up to me and felt exhilarated. I checked out the price. It had been marked down several times. Who wouldn\u0027t want this? I thought. But then I saw a few girls examining the dresses that weren\u0027t marked down. And then I knew. It wasn\u0027t their style, and it wasn\u0027t full price. I took the dress back to the guys\u0027 department to show my mo ^aid sre was am.\\n\\n I didn\u0027t recognize my brother at first. There was a young man in a suit in front of the mirrors outside the changing room. My mom was fussing over him and trying to make sure the length of his pants was just right. I couldn\u0027t believe that the handsome young man was the boy who had bugged me all my life.\\n\\n I was surprised at how grown up my brother looked wearing dress pants and a sport coat. I gave him a thumbs-up, and he appeared pleased by my fashion affirmation.\\n\\n I showed my mom the dress I\u0027d picked out. \"It\u0027s on sale,\" I said. \"Can I get it?\"\\n\\n \"It\u0027s beautiful,\" she said. \"Where did you find it?\"\\n\\n \"In the juniors. It\u0027s my size, too.\" I showed her the price.\\n\\n \"We\u0027ll take both,\" my mom said cheerfully to the salesman.\\n\\n \"It\u0027s that time of year,\" he said. \"Fall dances.\"\\n\\n My mom was overjoyed as the salesman rang up our purchases. \"I never thought I\u0027d see this day,\" she said joyfully. \"Both of you going to a dance, and it being the same one.\"\\n\\n \"Neither did I,\" my brother and I said in unison.\\n\\n The three of us went to our local florist to pick out a small wrist corsage for Stormy. Dullsville\u0027s florist shop was a family-owned one-room store with a huge display of flowers, vases, and knickknacks. A friendly woman wearing a pink-and-green-striped apron was finishing up with another customer.\\n\\n \"I\u0027ll be right with you,\" she said.\\n\\n Billy looked lost in the jungle of flowers without his cell, computer, or video games, clearly bored.\\n\\n \"I don\u0027t even know what she is wearing,\" he said when I showed him a few flowers.\\n\\n Good point, I thought.\\n\\n \"May I help you?\" the florist asked, coming over to us.\\n\\n \"We\u0027ll need a small wrist corsage,\" my mom said. \"For a school dance.\"\\n\\n \"What color would you like?\" she asked.\\n\\n Billy shrugged his shoulders. \"Do you have something black?\" Billy asked.\\n\\n The florist looked at Billy like he was deranged.\\n\\n \"You are going cou panto a dance, not a funeral,\" my mom teased. \"How about pink?\" Billy shook his head. \"I\u0027m not sure she\u0027d like that.\" Billy looked to me for help.\\n\\n \"I know she likes purple,\" I told him.\\n\\n \"Yes, that\u0027s what I want,\" he said emphatically. \"Purple.\"\\n\\n The florist showed us several purple flowers. Billy was overwhelmed with which one to pick and turned to my mom and me for guidance. We narrowed them down, and Billy was still uncertain which one to choose. Floral arranging was out of my twelve-year-old brother\u0027s skill set.\\n\\n \"It\u0027s okay,\" I said. \"They are all beautiful.\"\\n\\n That gave Billy the confidence he needed, and he pointed to one to make the final decision.\\n\\n The florist placed some baby\u0027s breath around it and began to prepare it for a corsage.\\n\\n \"How much longer?\" Billy asked. I could tell he\u0027d rather have been home playing Warcraft.\\n\\n \"This will all be worth it,\" I said, \"when you see the look on her face.\"\\n\\n That night Billy descended the staircase in his suit. I was already waiting in my new corset dress, so excited to have something new to wear in front of Alexander.\\n\\n I hated to admit that my pesky brother did look handsome when he came down the stairs in his navy suit.\\n\\n \"Whose brother are you?\" I teased.\\n\\n \"Not yours,\" he quipped.\\n\\n \"You look terrific,\" my dad said proudly.\\n\\n \"You look gorgeous,\" my mom gushed. Billy tensed up as my mom straightened his collar.\\n\\n \"Get off,\" he snarled.\\n\\n \"I just need to adjust this,\" she said. Then she took his chin and squeezed it. \"You look so grown up.\"\\n\\n \"Mom - \" he said.\\n\\n \"We have to go,\" I said, helping him out of the parental trap.\\n\\n \"Wait - let me get a picture of you both,\" she said.\\n\\n \"No, Mom,\" he whined. \"We have to go.\"\\n\\n \"I need memories!\" she exclaimed. \"For my scrapbook.\"\\n\\n My mom grabbed her camera. \"Get together,\" she said, gesturing for us to stand next to each other. We both moved like slugs.\\n\\n \"C\u0027mon. It won\u0027t kill you to take one picture,\" my dad commanded.\\n\\n Reluctantly, we stood side by side. I hadn\u0027t noticed that Billy was nearly as tall as I was. In no time he\u0027d be towering over me.\\n\\n \"Smile,\" she said.\\n\\n Billy and I grimaced.\\n\\n \"Smile, already!\" she repeated.\\n\\n \"Okay,\" we both said through grinning, gritted teeth.\\n\\n \"Okay,\" we both said through grinning, gritted teeth.\\n\\n The flash burst, and we were both momentarily blinded.\\n\\n \"One more,\" she directed.\\n\\n \"You said only one.\" Billy was itching to go.\\n\\n \"But what if that doesn\u0027t turn out?\" she asked.\\n\\n \"Then you\u0027ll know that one of us is a vampire,\" I said.\\n\\n Billy headed for the door while I grabbed my sweater.\\n\\n \"Knock \u0027em dead tonight,\" my dad said.\\n\\n I couldn\u0027t tell him that our dates were, in fact, undead.\\n\\n \"I was hoping I\u0027d get to meet Stormy, too,\" my dad added.\\n\\n \"That\u0027s what happens when you have a son,\" I said, opening the front door.\\n\\n My dad let me borrow the car, and we headed over to the Mansion. I was hoping that Billy would chicken out upon arriving at the haunted-looking house, but he didn\u0027t. I think since he was with me he felt more at ease, or maybe he felt like he was becoming a man or something.\\n\\n I made him knock on the door.\\n\\n Jameson opened it slowly, like in a creepy silent movie. Billy was as nervous seeing Jameson as he was for his date. I couldn\u0027t help but feel anxious for him.\\n\\n I put my hand on Billy\u0027s shoulder. \"I know she\u0027ll be happy to see you,\" I said.\\n\\n He turned back to me like I\u0027d said the kindest words anyon ct wheie had ever said to him. At once, he stood up a little straighter and appeared at ease.\\n\\n \"Good evening, Mr. Billy,\" Jameson said.\\n\\n \"Good evening, Jameson,\" Billy said proudly.\\n\\n \"Please come in. I know Miss Athena is almost ready.\"\\n\\n \"Who is Athena?\" Billy whispered to me.\\n\\n \"That\u0027s Stormy\u0027s real name,\" I replied.\\n\\n \"Oh. That\u0027s really pretty.\"\\n\\n Just then Alexander came down the stairs. He was so hot in his dark jacket and silken dress pants, I could feel my knees quiver just catching sight of him. I couldn\u0027t believe that someone so handsome was indeed my boyfriend. His face brightened when he saw me.\\n\\n \"You look beautiful,\" he said.\\n\\n He came over and gave me a tender kiss on the cheek. I wanted to swoon into his arms and have him carry me away. I had to remind myself that this was Billy and Stormy\u0027s dance and not mine.\\n\\n Stormy descended the creaky old staircase in the dress I\u0027d given her. The black corset minidress had sheer lace sleeves that just covered her pale shoulders and ruffled black and purple lace that made up the skirt. She wore knee-high black tights and witchy boots with purple laceups that matched the ties and lacing on her corset. Her hair was up in a small bun with several curls cascading down her cheeks. She was radiant.\\n\\n Billy politely handed her the flower box.\\n\\n \"For me?\" she asked sweetly.\\n\\n \"Yes, we picked it out just for you,\" Billy answered, his voice quavering slightly.\\n\\n Stormy opened it, and her eyes lit up. \"It is beautiful!\" she said.\\n\\n Billy shifted in his stance, a huge smile on his face.\\n\\n I helped her get the corsage out of the box and slipped it on her wrist.\\n\\n \"And I have something for you, too,\" Alexander said to me. He grabbed a small box off of the hallway table. \"I hope you like it.\" I opened it to find a brilliant blue flower. \"It totally matches my dress!\" I said. I gave him a quick kiss. \"It\u0027s perfect. How did you know?\"\\n\\n \"I had a little help from a friend,\" he replied.\\n\\n My brother smiled proudly.\\n\\n I took it out of the box and tried my best to pin it on my dress.\\n\\n \"Here, let me help you,\" Alexander said.\\n\\n \"Don\u0027t prick your finger - \" I said. \"Or more importantly, mine.\"\\n\\n Stormy and Billy watched as Alexander did his best not to draw blood out of either one of us.\\n\\n Jameson opened the Mansion door for us and we piled into the car. As Alexander drove us to the dance, I hoped Billy didn\u0027t catch sight of his date missing in the rearview mirror.\\n\\n When we arrived at Dullsville Middle, Billy hopped out of the car and opened the door for Stormy. Alexander and I eagerly followed the pair into the building.\\n\\n Stormy wore my dress proudly; it fit her like a doll. She was beautiful and held her head high as she walked into the school next to Billy.\\n\\n The middle school appeared the same as when I went there and when I\u0027d visited it to meet Henry for the first time. Posters, signs, and handmade art peppered the hallways. Immediately we got stares from shocked attendees. We weren\u0027t following typical Dullsville student dress code - me in my corset dress, Stormy in hers, and Alexander in his tailored, million-dollar dark silk suit. Billy looked in place, but the students and faculty eyed his strange entourage.\\n\\n Stormy seemed to glow in the school hallway. She responded like Alexander had when I\u0027d brought him to Dullsville High for the first time. Since both Sterlings were homeschooled, they missed even the most mundane and minute things about school - a drinking fountain, a pep rally sign, a cafeteria. I\u0027d have given all those things away for a coffin bed and a life without the sun. But I watched as Stormy took in the sights and smells of her new surroundings.\\n\\n Billy did his best to overcome his shyness. He showed Stormy every inch of the school as if he were the school administrator. I was secretly proud of my brother. He treated Stormy as a gentleman would, opening doors for her and, once they were inside the gymnasium, offering her a drink.\\n\\n The gymnasium was slightly transformed from a basketball court into the middle school\u0027s fall dance. Leaves decorated the walls alongside GO, EAGLES banners.\\n\\n A long table held refreshments - bottled water, sodas, and juices - while another one had baskets filled with snacks. A dozen more cafeteria tables with plenty of seats lined the dance floor, and a DJ spun a slow love song.\\n\\n What I hadn\u0027t anticipated were girls who seemed threatened by Stormy\u0027s presence. Especially the girl I\u0027d once seen at a Math Club party. She stared at Alexander\u0027s sister with a jealous glare.\\n\\n No one was out on the dance floor. Instead, all the students were sitting at the tables or hanging out by the snack area. Most of the girls were talking to other girls, and the guys were clustered together with their friends.\\n\\n \"I haven\u0027t been to many school dances. Is this what it\u0027s really like?\" I asked Alexander.\\n\\n \"I don\u0027t know,\" he said. \"I don\u0027t even go to school.\"\\n\\n We both laughed.\\n\\n \"Why isn\u0027t anyone dancing?\" Stormy asked Billy.\\n\\n He shrugged his shoulders.\\n\\n \"Are we going to dance?\" Stormy asked.\\n\\n \"Uh ... sure.\" He pulled awkwardly at his tie. \"But maybe we should wait for a bit until some others start.\" Stormy tapped her witchy boot impatiently on the wooden floor. Then, all at once, she boldly grabbed Billy\u0027s hand and pulled him out to the middle of the gymnasium.\\n\\n My brother was horrified. He stood alone with his odd date in the center of a hundred peers\u0027 watching eyes. I actually felt bad for him. I was afraid he\u0027d freak out - run off the dance floor or even faint.\\n\\n Whispers echoed throughout the gym. And then students started to laugh.\\n\\n Billy watched as his classmates sneered at him and his date. His face flushed red. I guessed at any moment he\u0027d hightail it out of there and we\u0027d have to take a tearful Stormy home.\\n\\n But Billy didn\u0027t leave. Instead, he took Stormy\u0027s hand and placed his other hand around her waist. She smiled with delight, and he returned a flashy grin. Before I knew it, he was slow dancing with Alexander\u0027s little sister.\\n\\n A tear welled in my eye as I saw my brother dance bravely with a girl in front of the entire school. It was so weird watching my little pesky brother holding a beautiful girl in his arms. The two moved back and forth, not always in time with the music, but nevertheless together. Stormy leaned her head on his shoulder and the tear ran down my cheek. Then several more Dullsville Middle School students raced onto the dance floor as if they\u0027d been waiting for some courageous soul to start the night off. Within a few minutes a dozen couples had joined Billy and Stormy. The music changed to an upbeat dance tune and even more students joined in. Alexander turned to me. \"Getting misty on me?\" he said. \"I guess you can\u0027t hide your fondness for the little guy.\" Embarrassed, I wiped the tear from my face and patted my mascara and eyeliner in hopes that they weren\u0027t going to run.\\n\\n \"Want to dance?\" Alexander asked. \"I can\u0027t let my sister have all the fun.\"\\n\\n \"Of course!\" I exclaimed.\\n\\n Alexander took my hand and led me onto the dance floor. The younger students smiled at us as they, too, bobbed to the high-spirited music. Alexander spun me around, and I was so dizzy from spinning and being in his company that I forgot where we were. My handsome boyfriend gazed down at me with all the love I\u0027d ever seen from one person. He drew me close and kissed me with such passion that I thought I\u0027d gone to heaven.\\n\\n When we stopped kissing, we looked up to see all the students\u0027 and faculty\u0027s eyes on us. Several teachers and other chaperones cleared their throats and shot us dirty looks. Then the students cheered and applauded us. I beamed proudly while Alexander grinned awkwardly.\\n\\n Several of Billy\u0027s nerdmates came up to him and Stormy and talked and danced the night away. I sat back, watching my baby brother score the popularity I never had with my peers.\\n\\n When the dance was over, Alexander and I walked our siblings out to the car. I watched as Billy again held the door open for Stormy. It was as if he had come into the dance a boy and came out a young man. Billy was beaming, displaying more confidence than I\u0027d ever seen in him.\\n\\n \"That was so much fun!\" Stormy said as we drove home.\\n\\n \"Yeah, and the best part was when our chaperones almost got kicked out for making out on the dance floor!\" Billy exclaimed.\\n\\n Our siblings laughed while Alexander and I tried to cover our embarrassment.\\n\\n \"I want a picture of us together, Stormy,\" Billy said when we pulled up to the Mansion. \"Raven, you can take it with my cell phone.\" My heart broke a little then. It was Billy\u0027s first dance, and he wouldn\u0027t have a picture of his date. I wasn\u0027t sure what to say.\\n\\n We all climbed out of the car.\\n\\n \"I don\u0027t like pictures,\" Stormy said.\\n\\n \"But why?\" Billy asked. \"You\u0027re so pretty.\"\\n\\n She blushed ruby red.\\n\\n Billy stood next to Stormy and tossed me his phone. \"Take it,\" he commanded.\\n\\n Stormy was still glowing from Billy\u0027s compliment. I looked to Alexander for help. But the pair appeared so happy, neither one of us wanted to be the ones to break their spell.\\n\\n Alexander shrugged his shoulders and I quickly snapped one picture and tossed it back to Billy. He checked it and stared at it oddly.\\n\\n Stormy tapped him on the shoulder, distracting him from the camera.\\n\\n \"Good night, Billy. I had a great time,\" she said sincerely.\\n\\n \"I did, too,\" he said.\\n\\n Stormy gave him a quick kiss on his cheek as Jameson opened the door for her.\\n\\n My brother\u0027s face illuminated like a Star Wars lightsaber.\\n\\n Stormy waved to him as he headed to our car to wait for me. Alexander gave me a long good-night kiss and I, too, was buzzing from our magical evening.\\n\\n As I drove away, Billy stared back at the looming Mansion like I had many times, gazing at it until it disappeared as we turned the corner.\\n\\n \"So, did you have fun?\" I asked.\\n\\n \"The best night of my life.\" He stared out the window with a huge, boyish grin.\\n\\n For once, Billy and I agreed on something. There was no better time than that spent with the Sterlings. I was hoping Billy didn\u0027t get too attached to Stormy, though. If someone in the Madison household was going to be turned into a vampire, I had first dibs.\\n\\n I was really proud of my brother. I\u0027d always been the risk taker, the one who did things against the grain. Though he was more conservative, I realized now that when pushed, he, too, could be fearless. It must have been in our blood. \\n\\n","sourceLink":"https://allnovel.net/immortal-hearts-vampire-kisses-9/page-9.html","bookId":2147,"book":{"id":2147,"title":"Immortal Hearts (Vampire Kisses #9)","description":"Storyline: Immortal Hearts (Vampire Kisses #9) \\n Athena \"Stormy\" Sterling is coming to Dullsville, and Raven is both excited and panicked in anticipation of Alexander\u0027s little sister\u0027s visit. Alexander tells Raven that she and his sister have a lot in common, but can the mini-Raven be everything she hopes for? Alexander calls her Stormy for a reason. \\n Stormy\u0027s visit stirs up the perfect immortal whirlwind. Raven is forced to take a good look at what it would really mean to be a vampire in the Sterling family, aside from some of the things she already loves, like shunning the sun and sleeping in a coffin with Alexander. When Raven compares her life with Stormy\u0027s, she can see that it\u0027s not all starry skies and black roses. But Raven knows she\u0027s always wanted to be a vampire. \\n Alexander is as romantic and dreamy as ever, and though he keeps showing Raven how much he loves her, will she ultimately be able to convince him that it\u0027s the right thing to turn her? \\n This final chapter of Vampire Kisses\u0027 nocturnal romance will keep all mortal and immortal hearts racing.\\n","cover":"https://allnovel.net/images/immortal-hearts-vampire-kisses-9.jpg","author":"Ellen Schreiber","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/immortal-hearts-vampire-kisses-9.html","creation":"Oct 5, 2019 8:58:23 AM","modification":"Oct 5, 2019 6:19:52 PM"}}
