{"id":108086,"no":16,"title":"Page 16","content":"15. Tick Tock Tick Tock Tick Tock\n Hey Jake, thought you said you wanted me at dusk. How come you didn\u0027t have Leah wake me up before she crashed?\n \u0027Cause I didn\u0027t need you. I\u0027m still good.\n He was already picking up the north half of the circle. Anything?\n Nope. Nothing but nothing.\n You did some scouting?\n He\u0027dcaught the edge of one of my side trips. He headed up the new trail.\n Yeah - ran a few spokes. You know, just checking. If the Cullens are going to make a hunting trip...\n Good call.\n Seth looped back toward the main perimeter.\n It was easier to run with him than it was to do the same with Leah. Though she was trying - trying hard - there was always an edge to her thoughts. She didn\u0027t want to be here. She didn\u0027t want to feel the softening toward the vampires that was going on in my head. She didn\u0027t want to deal with Seth\u0027s cozy friendship with them, a friendship that was only getting stronger.\n Funny, though, I\u0027d\u0027ve thought her biggest issue would just be me. We\u0027d always gotten on each other\u0027s nerves when we were in Sam\u0027s pack. But there was no antagonism toward me now at all, just the Cullens andBella. I wondered why. Maybe it was simply gratitude that I wasn\u0027t forcing her to leave. Maybe it was because I understood her hostility better now. Whichever, running with Leah wasn\u0027t nearly as bad as I\u0027d expected.\n Of course, she hadn\u0027t eased up that much. The food and clothes Esme had sent for her were all taking a trip downriver right now. Even after I\u0027d eaten my share - not because it smelled nearly irresistible away from the vampire burn, but to set a good example of self-sacrificing tolerance for Leah - she\u0027d refused. The small elk she\u0027d taken down around noon had not totally satisfied her appetite. Did make her mood worse, though. Leah hated eating raw.\n Maybe we should runa sweep east? Seth suggested. Go deep, see if they\u0027re out there waiting.\n I was thinking about that,I agreed. But let\u0027s do it when we\u0027re all awake. I don\u0027t want to let down our guard. We should do it before the Cullens give it a try, though. Soon.\n Right.\n That got me thinking.\n If the Cullens were able to get out of the immediate area safely, they really ought to keep on going. They probably should have taken off the second we\u0027d come to warn them. They had to be able to afford other digs. And they had friends up north, right? Take Bella and run. It seemed like an obvious answer to their problems.\n I probably ought to suggest that, but I was afraid they would listen to me. And I didn\u0027t wantto haveBella disappear - to never know whether she\u0027d made it or not.\n No, that was stupid. I wouldtell them togo. It made no sense for them to stay, and it would be better - not less painful, but healthier - for me if Bella left.\n Easyto say now, when Bella wasn\u0027t right there, looking all thrilled to see me and also clinging to life by her fingernails at the same time...\n Oh, I already asked Edward about that,Seth thought.\n What?\n I asked him why they hadn\u0027t taken off yet. Gone up to Tanya\u0027s place or something. Somewhere too far for Sam to come after them.\n I had to remind myself that I\u0027d just decided to give the Cullens that exact advice. That it was best. So I shouldn\u0027t be mad at Seth for taking the chore out of my hands. Not mad at all.\n So what did he say? Are they waiting for a window?\n No. They\u0027re not leaving.\n And that shouldn\u0027t sound like good news.\n Why not? That\u0027s just stupid.\n Not really,Seth said, defensive now. It takes some time to build up the kind of medical access that Carlisle has here. He\u0027s got all the stuff he needs to take care of Bella, and the credentials to get more. That\u0027s one of the reasons they want to make a hunting run. Carlisle thinks they\u0027re going to need more blood for Bella soon. She\u0027s using up all the O negative they stored for her. He doesn\u0027t like depleting the stockpile. He\u0027s going to buy some more. Did you know you can buy blood? If you\u0027re a doctor.\n I wasn\u0027t ready to be logical yet. Still seems stupid. They could bring most of it with them, right? And steal what they need wherever they go. Who cares about legal crap when you\u0027re the undead?\n Edward doesn\u0027t want to take any risks moving her.\n She\u0027s better than she was.\n Seriously,Seth agreed. In his head, he was comparing my memories of Bella hooked up to the tubes with the\n last time he\u0027d seen her as he\u0027d left the house. She\u0027d smiled at him and waved. But she can\u0027t move around much, you know. That thing is kicking the hell out of her.\n I swallowed back the stomach acid in my throat. Yeah, I know.\n Broke another of her ribs,he told me somberly.\n My stride faltered, and I staggered a step before I regained my rhythm.\n Carlisle taped her up again. Just another crack, he said. Then Rosalie said something about how even normal human babies have been known to crack ribs. Edward looked like he was gonna rip her head off.\n Too bad he didn\u0027t\n Seth was in full report mode now - knowing it was all vitally interesting to me, though I\u0027d never\u0027ve asked to hear it. Bella\u0027s been running a fever off and on today. Just low grade - sweats and then chills. Carlisle\u0027s not sure what to make of it - shemightjust be sick. Her immune system can\u0027t be in peak form right now.\n Yeah, I\u0027m sure it\u0027s just a coincidence.\n She\u0027s in a good mood, though. She was chatting with Charlie, laughing and all -\n Charlie!What?! What do you mean, she was talking to Charlie?!\n Now Seth\u0027s pace stuttered; my fury surprised him. Guess he calls every day to talk to her. Sometimes her mom calls, too. Bella sounds so much better now, so she was reassuring him that she was on the mend-On the mend? What the hell are they thinking?! Get Charlie\u0027s hopes up just so that he can be destroyed even worse when she dies? I thought they were getting him ready for that! Trying to prepare him! Why would she set him up like this?\n She might not die,Seth thought quietly.\n I took deep breath, trying to calm myself. Seth. Even if she pulls through this, she\u0027s not doing it human. She knows that, and so do the rest of them. If she doesn\u0027t die, she\u0027s going to have to do a pretty convincing impersonation of a corpse, kid. Either that, or disappear. I thought they were trying to make this easier on Charlie. Why... ?\n Think it\u0027s Bella\u0027s idea. No one said anything, but Edward\u0027s face kinda went right along with what you\u0027re thinking now.\n On the same wavelength with the bloodsucker yet again.\n We ran in silence for a few minutes. I started off along a new line, probing south.\n Don\u0027t get too far.\n Why?\n Bella asked me to ask you to stop by.\n My teeth locked together.\n Alice wants you, too. She says she\u0027s tired of hanging out in the attic like the vampire bat in the belfry. Seth snorted a laugh. was switching off with Edward before. Trying to keep Bella\u0027s temperature stable. Cold to hot, as needed. I guess, if you don\u0027t want to do it, I could go back -\n No. I got it,I snapped.\n Okay.Seth didn\u0027t make any more comments. He concentrated very hard on the empty forest.\n I kept my southern course, searching for anything new. I turned around when I got close to the first signs of habitation. Not near the town yet, but I didn\u0027t want to get any wolf rumors going again. We\u0027d been nice and invisible for a long while now.\n I passed right through the perimeter on my way back, heading for the house. As much as I knew it was a stupid thing to do, I couldn\u0027t stop myself. I must be some kind of masochist.\n There\u0027s nothing wrong with you, Jake. This isn\u0027t the most normal situation.\n Shut up, please, Seth.\n Shutting.\n I didn\u0027t hesitate at the door this time; I just walked through like I owned the place. I figured that would piss Rosalie off, but it was a wasted effort. Neither Rosalie or Bella were anywhere in sight. I looked around wildly, hoping I\u0027d missed them somewhere, my heart squeezing against my ribs in a weird, uncomfortable way.\n \"She\u0027s all right,\" Edward whispered. \"Or, the same, I should say.\"\n Edward was on the couch with his face in his hands; he hadn\u0027t looked up to speak. Esme was next to him, her arm wrapped tight around his shoulders.\n \"Hello, Jacob,\" she said. \"I\u0027m so glad you came back.\"\n \"Me, too,\" Alice said with a deep sigh. She came prancing down the stairs, making a face. Like 1 was late for an appointment.\n \"Uh, hey,\" I said. It felt weird to try to be polite.\n \"Where\u0027s Bella?\"\n \"Bathroom,\" Alice told me. \"Mostly fluid diet, you know. Plus, the whole pregnancy thing does that to you, I hear.\"\n \"Ah.\"\n I stood there awkwardly, rocking back and forth on my heels.\n \"Oh, wonderful,\" Rosalie grumbled. I whipped my head around and saw her coming from a hall half-hidden behind the stairway. She had Bella cradled gently in her arms, a harsh sneer on her face for me. \"I knew I smelled something nasty.\"\n And, just like before, Bella\u0027s face lit up like a kid\u0027s on Christmas morning. Like I\u0027d brought her the greatest gift ever.\n It was so unfair.\n \"Jacob,\" she breathed. \"You came.\"\n \"Hi, Bells.\"\n Esme and Edward both got up. I watched how carefully Rosalie laid Bella out on the couch. I watched how, despite that, Bella turned white and held her breath - like she was set on not making any noise no matter how much it hurt.\n Edward brushed his hand across her forehead and then along her neck. He tried to make it look as if he was\n just sweeping her hair back, but it looked like a doctor\u0027s examination to me.\n \"Are you cold?\" he murmured.\n I\u0027m fine.\"\n \"Bella, you know what Carlisle told you,\" Rosalie said. \"Don\u0027t downplay anything. It doesn\u0027t help us take care of either of you.\"\n \"Okay, I\u0027m a little cold. Edward, can you hand me that blanket?\"\n I rolled my eyes. \"Isn\u0027t that sort of the point of me being here?\"\n \"You just walked in,\" Bella said. \"After running all day, I\u0027d bet. Put your feet up for a minute. I\u0027ll probably warm up again in no time.\"\n I ignored her, going to sit on the floor next the sofa while she was still telling me what to do. At that point, though, I wasn\u0027t sure how.... She looked pretty brittle, and I was afraid to move her, even to put my arms around her. So I just leaned carefully against her side, letting my arm rest along the length of hers, and held her hand. Then I put my other hand against her face. It was hard to tell if she felt colder than usual.\n \"Thanks, Jake,\" she said, and I felt her shiver once.\n \"Yeah,\" I said.\n Edward sat on the arm of the sofa by Bella\u0027s feet, his eyes always on her face.\n It was too much to hope, with all the super-hearing in the room, that no one would notice my stomach rumbling.\n \"Rosalie, why don\u0027t you get Jacob something from the kitchen?\" Alice said. She was invisible now, sitting quietly behind the back of the sofa.\n Rosalie stared at the place Alice\u0027s voice had come from in disbelief.\n \"Thanks, anyway, Alice, but I don\u0027t think I\u0027d want to eat something Blondie\u0027s spit in. I\u0027d bet my system wouldn\u0027t take too kindly to venom.\"\n \"Rosalie would never embarrass Esme by displaying such a lack of hospitality.\"\n \"Of course not,\" Blondie said in a sugar-sweet voice that I immediately distrusted. She got up and breezed out of the room.\n Edward sighed.\n \"You\u0027d tell me if she poisoned it, right?\" I asked.\n \"Yes,\" Edward promised.\n And for some reason I believed him.\n There was a lot of banging in the kitchen, and - weirdly - the sound of metal protesting as it was abused. Edward sighed again, but smiled just a little, too. Then Rosalie was back before I could think much more about it. With a pleased smirk, she set a silver bowl on the floor next to me.\n \"Enjoy, mongrel.\"\n It had once probably been a big mixing bowl, but she\u0027d bent the bowl back in on itself until it was shaped almost exactly like a dog dish. I had to be impressed with her quick craftsmanship. And her attention to detail. She\u0027d\n scratched the word Fido into the side. Excellent handwriting.\n Because the food looked pretty good - steak, no less, and a big baked potato with all the fixings - I told her, \"Thanks, Blondie.\"\n She snorted.\n \"Hey, do you know what you call a blonde with a brain?\" I asked, and then continued on the same breath, \"a golden retriever.\"\n \"I\u0027ve heard that one, too,\" she said, no longer smiling.\n \"I\u0027ll keep trying,\" I promised, and then I dug in.\n She made a disgusted face and rolled her eyes. Then she sat in one of the armchairs and started flicking through channels on the big TV so fast that there was no way she could really be surfing for something to watch.\n The food was good, even with the vampire stink in the air. I was getting really used to that. Huh. Not something I\u0027d been wanting to do, exactly...\n When I was finished - though I was considering licking the bowl, just to give Rosalie something to complain about - I felt Bella\u0027s cold fingers pulling softly through my hair. She patted it down against the back of my neck.\n \"Time for a haircut, huh?\"\n \"You\u0027re getting a little shaggy,\" she said. \"Maybe - \"\n \"Let me guess, someone around here used to cut hair in a salon in Paris?\"\n She chuckled. \"Probably.\"\n \"No thanks,\" I said before she could really offer. \"I\u0027m good for a few more weeks.\"\n Which made me wonder how long she was good for. I tried to think of a polite way to ask.\n \"So... urn... what\u0027s the, er, date? You know, the due date for the little monster.\"\n She smacked the back of my head with about as much force as a drifting feather, but didn\u0027t answer.\n \"I\u0027m serious,\" I told her. \"I want to know how long I\u0027m gonna have to be here.\" How long you\u0027re gonna be here, I added in my head. I turned to look at her then. Her eyes were thoughtful; the stress line was there between her brows again.\n \"I don\u0027t know,\" she murmured. \"Not exactly. Obviously, we\u0027re not going with the nine-month model here, and we can\u0027t get an ultrasound, so Carlisle is guesstimating from how big I am. Normal people are supposed to be about forty centimeters here\" - she ran her finger right down the middle of her bulging stomach - \"when the baby is fully grown. One centimeter for every week. I was thirty this morning, and I\u0027ve been gaining about two centimeters a day, sometimes more___\"\n Two weeks to a day, the days flying by. Her life speeding by in fast-forward. How many days did that give her, if she was counting to forty? Four? It took me a minute to figure out how to swallow.\n \"You okay?\" she asked.\n I nodded, not really sure how my voice would come out.\n Edward\u0027s face was turned away from us as he listened to my thoughts, but I could see his reflection in the glass\n wall. He was the burning man again.\n Funny how having a deadline made it harder to think about leaving, or having her leave. I was glad Seth\u0027d brought that up, so I knew they were staying here. It would be intolerable, wondering if they were about to go, to take away one or two or three of those four days. My four days.\n Also funny how, even knowing that it was almost over, the hold she had on me only got harder to break. Almost like it was related to her expanding belly - as if by getting bigger, she was gaining gravitational force.\n For a minute I tried to look at her from a distance, to separate myself from the pull. I knew it wasn\u0027t my imagination that my need for her was stronger than ever. Why was that? Because she was dying? Or knowing that even if she didn\u0027t, still - best case scenario - she\u0027d be changing into something else that I wouldn\u0027t know or understand?\n She ran her finger across my cheekbone, and my skin was wet where she touched it.\n \"It\u0027s going to be okay,\" she sort of crooned. It didn\u0027t matter that the words meant nothing. She said it the way people sang those senseless nursery rhymes to kids. Rock-a-bye, baby.\n \"Right,\" I muttered.\n She curled against my arm, resting her head on my shoulder. \"I didn\u0027t think you would come. Seth said you would, and so did Edward, but I didn\u0027t believe them.\"\n \"Why not?\" I asked gruffly.\n \"You\u0027re not happy here. But you came anyway.\"\n \"You wanted me here.\"\n \"I know. But you didn\u0027t have to come, because it\u0027s not fair for me to want you here. I would have understood.\"\n It was quiet for a minute. Edward\u0027d put his face back together. He looked at the TV as Rosalie went on flipping through the channels. She was into the six hundreds. I wondered how long it would take to get back to the beginning.\n \"Thank you for coming,\" Bella whispered.\n \"Can I ask you something?\" I asked.\n \"Of course.\"\n Edward didn\u0027t look like he was paying attention to us at all, but he knew what I was about to ask, so he didn\u0027t fool me.\n \"Why do you want me here? Seth could keep you warm, and he\u0027s probably easier to be around, happy little punk. But when walk in the door, you smile like I\u0027m your favorite person in the world.\"\n \"You\u0027re one of them.\"\n \"That sucks, you know.\"\n \"Yeah.\" She sighed. \"Sorry.\"\n \"Why, though? You didn\u0027t answer that.\"\n Edward was looking away again, like he was staring out the windows. His face was blank in the reflection.\n \"It feels... complete when you\u0027re here, Jacob. Like all my family is together. I mean, I guess that\u0027s what it\u0027s\n like - I\u0027ve never had a big family before now. It\u0027s nice.\" She smiled for half a second. \"But it\u0027s just not whole unless you\u0027re here.\"\n \"I\u0027ll never be part of your family, Bella.\"\n I could have been. I would have been good there. But that was just a distant future that died long before it had a chance to live.\n \"You\u0027ve always been a part of my family,\" she disagreed.\n My teeth made a grinding sound. \u0027That\u0027s a crap answer.\"\n \"What\u0027s a good one?\"\n \"How about, \u0027Jacob, I get a kick out of your pain.\u0027\"\n I felt her flinch.\n \"You\u0027d like that better?\" she whispered.\n \"It\u0027s easier, at least. I could wrap my head around it. I could deal with it.\"\n I looked back down at her face then, so close to mine. Her eyes were shut and she was frowning. \"We got off track, Jake. Out of balance. You\u0027re supposed to be part of my life - I can feel that, and so can you.\" She paused for a second without opening her eyes - like she was waiting for me to deny it. When I didn\u0027t say anything, she went on. \"But not like this. We did something wrong. No. I did. I did something wrong, and we got off track___\"\n Her voice trailed off, and the frown on her face relaxed until it was just a little pucker at the corner of her lips. I waited for her to pour some more lemon juice into my paper cuts, but then a soft snore came from the back of her throat.\n \"She\u0027s exhausted,\" Edward murmured. \"It\u0027s been a long day. A hard day. I think she would have gone to sleep earlier, but she was waiting for you.\"\n I didn\u0027t look at him.\n \"Seth said it broke another of her ribs.\"\n \"Yes. It\u0027s making it hard for her to breathe.\"\n \"Great.\"\n \"Let me know when she gets hot again.\"\n \"Yeah.\"\n She still had goose bumps on the arm that wasn\u0027t touching mine. I\u0027d barely raised my head to look for a blanket when Edward snagged one draped over the arm of the sofa and flung it out so that it settled over her.\n Occasionally, the mind-reading thing saved time. For example, maybe I wouldn\u0027t have to make a big production out of the accusation about what was going on with Charlie. That mess. Edward would just hear exactly how furious -\n \"Yes,\" he agreed. \"It\u0027s not a good idea.\"\n \"Then why?\" Why was Bella telling her father she was on the mend when it would only make him more miserable?\n \"She can\u0027t bear his anxiety.\"\n \"So it\u0027s better - \"\n \"No. It\u0027s not better. But I\u0027m not going to force her to do anything that makes her unhappy now. Whatever happens, this makes her feel better. I\u0027ll deal with the rest afterward.\"\n That didn\u0027t sound right. Bella wouldn\u0027t just shuffle Charlie\u0027s pain off to some later date, for someone else to face. Even dying. That wasn\u0027t her. If I knew Bella, she had to have some other plan.\n \"She\u0027s very sure she\u0027s going to live,\" Edward said.\n \"But not human,\" I protested.\n \"No, not human. But she hopes to see Charlie again, anyway.\"\n Oh, this just got better and better.\n \"See. Charlie.\" I finally looked at him, my eyes bugging. \"Afterwards. See Charlie when she\u0027s all sparkly white with the bright red eyes. I\u0027m not a bloodsucker, so maybe I\u0027m missing something, but Charlie seems like kind of a strange choice for her first meal.\"\n Edward sighed. \"She knows she won\u0027t be able to be near him for at least a year. She thinks she can stall. Tell Charlie she has to go to a special hospital on the other side of the world. Keep in contact through phone calls___\"\n \"That\u0027s insane.\"\n \"Yes.\"\n \"Charlie\u0027s not stupid. Even if she doesn\u0027t kill him, he\u0027s going to notice a difference.\"\n \"She\u0027s sort of banking on that.\"\n I continued to stare, waiting for him to explain.\n \"She wouldn\u0027t be aging, of course, so that would set a time limit, even if Charlie accepted whatever excuse she comes up with for the changes.\" He smiled faintly. \"Do you remember when you tried to tell her about your transformation? How you made her guess?\"\n My free hand flexed into a fist. \"She told you about that?\"\n \"Yes. She was explaining her... idea. You see, she\u0027s not allowed totell Charlie the truth - it would be very dangerous for him. But he\u0027s a smart, practical man. She thinks he\u0027ll come up with his own explanation. She assumes he\u0027ll get it wrong.\" Edward snorted. \"After all, we hardly adhere to vampire canon. He\u0027ll make some wrong assumption about us, like she did in the beginning, and we\u0027ll go along with\n it. She thinks she\u0027ll be able to see him... from time to time.\"\n \"Insane,\" I repeated.\n \"Yes,\" he agreed again.\n It was weak of him to let her get her way on this, just to keep her happy now. It wouldn\u0027t turn out well.\n Which made me think that he probably wasn\u0027t expecting her to live to try out her crazy plan. Placating her, so that she could be happy for a little while longer.\n Like four more days.\n \"I\u0027ll deal with whatever comes,\" he whispered, and he turned his face down and away so that I couldn\u0027t even read his reflection. \"I won\u0027t cause her pain now.\"\n \"Four days?\"I asked.\n He didn\u0027t look up. \"Approximately.\"\n \"Then what?\"\n \"What do you mean, exactly?\"\n I thought about what Bella had said. About the thing being wrapped up nice and tight in something strong, something like vampire skin. So how did that work? How did it get out?\n \"From what little research we\u0027ve been able to do, it would appear the creatures use their own teeth to escape the womb,\" he whispered.\n I had to pause to swallow back the bile.\n \"Research?\" I asked weakly.\n \"That\u0027s why you haven\u0027t seen Jasper and Emmett around. That\u0027s what Carlisle is doing now. Trying to decipher ancient stories and myths, as much as we can with what we have to work with here, looking for anything that might help us predict the creature\u0027s behavior.\"\n Stories? If there were myths, then...\n \"Then is this thing not the first of its kind?\" Edward asked, anticipating my question. \"Maybe. It\u0027s all very sketchy. The myths could easily be the products of fear and imagination. Though .. .\" - he hesitated - \"your myths are true, are they not? Perhaps these are, too. They do seem to be localized, linked___\"\n \"How did you find... ?\"\n \"There was a woman we encountered in South America. She\u0027d been raised in the traditions of her people. She\u0027d heard warnings about such creatures, old stories that had been passed down.\"\n \"What were the warnings?\" I whispered.\n \"That the creature must be killed immediately. Before it could gain too much strength.\"\n Just like Sam thought. Was he right?\n \"Of course, their legends say the same of us. That we must be destroyed. That we are soulless murderers.\"\n Two for two.\n Edward laughed one hard chuckle.\n \"What did their stories say about the... mothers?\"\n Agony ripped across his face, and, as I flinched away from his pain, I knew he wasn\u0027t going to give me an answer. I doubted he could talk.\n tt was Rosalie - who\u0027d been so still and quiet since Bella\u0027d fallen asleep that I\u0027d nearly forgotten her - who answered.\n She made a scornful noise in the back of her throat. \"Of course there were no survivors,\" she said. No survivors, blunt and uncaring. \"Giving birth in the middle of a disease-infested swamp with a medicine man smearing\n sloth spit across your face to drive out the evil spirits was never the safest method. Even the normal births went badly half the time. None of them had what this baby has - caregivers with an idea of what the baby needs, who try to meet those needs. A doctor with a totally unique knowledge of vampire nature. A plan in place to deliver the baby as safely as possible. Venom that will repair anything that goes wrong. The baby will be fine. And those other mothers would probably have survived if they\u0027d had that - if they even existed in the first place. Something I am not convinced of.\" She sniffed disdainfully.\n The baby, the baby. Like that was all that mattered. Bella\u0027s life was a minor detail to her - easy to blow off.\n Edward\u0027s face went white as snow. His hands curved into claws. Totally egotistical and indifferent, Rosalie twisted in her chair so that her back was to him. He leaned forward, shifting into a crouch.\n Allow me,I suggested.\n He paused, raising one eyebrow.\n Silently, I lifted my doggy bowl off the floor. Then, with a quick, powerful flip of my wrist, I threw it into the back of Blondie\u0027s head so hard that - with an earsplitting bang - it smashed flat before it ricocheted across the room and snapped the round top piece off the thick newel post at the foot of the stairs.\n Bella twitched but didn\u0027t wake up.\n \"Dumb blonde,\" I muttered.\n Rosalie turned her head slowly, and her eyes were blazing.\n \"You. Got. Food. In. My. Hair.\"\n That did it.\n I busted up.I pulled away fromBella so that I wouldn\u0027t shake her, and laughed so hard that tears ran down my face. From behind the couch, I heard Alice\u0027s tinkling laugh join in.\n I wondered why Rosalie didn\u0027t spring. I sort of expected it. But then I realized that my laughing had woken Bella up, though she\u0027d slept right through the real noise.\n \"What\u0027s so funny?\" she mumbled.\n \"I got food in her hair,\" I told her, chortling again.\n \"I\u0027m not going to forget this, dog,\" Rosalie hissed.\n \"S\u0027not so hard to erase a blonde\u0027s memory,\" I countered. \"Just blow in her ear.\"\n \"Get some new jokes,\" she snapped.\n \"C\u0027mon, Jake. Leave Rose alo - \" Bella broke off mid-sentence and sucked in a sharp breath. In the same second, Edward was leaning over the top of me, ripping the blanket out of the way. She seemed to convulse, her back arching off the sofa.\n \"He\u0027s just,\" she panted, \"stretching.\"\n Her lips were white, and she had her teeth locked together like she was trying to hold back a scream.\n Edward put both hands on either side of her face.\n \"Carlisle?\" he called in a tense, low voice.\n \"Right here,\" the doctor said. I hadn\u0027t heard him come in.\n \"Okay,\" Bella said, still breathing hard and shallow. \"Think it\u0027s over. Poor kid doesn\u0027t have enough room, that\u0027s all. He\u0027s getting so big.\"\n It was really hard to take, that adoring tone she used to describe the thing that was tearing her up. Especially after Rosalie\u0027s callousness. Made me wish I could throw something at Bella, too.\n She didn\u0027t pick up on my mood. \"You know, he reminds me of you, Jake,\" she said - affectionate tone - still gasping.\n \"Do not compare me to that thing,\" I spit out through my teeth.\n \"I just meant your growth spurt,\" she said, looking like I\u0027d hurt her feelings. Good. \"You shot right up. I could watch you getting taller by the minute. He\u0027s like that, too. Growing so fast.\"\n I bit my tongue to keep from saying what I wanted to say - hard enough that I tasted blood in my mouth. Of course, it would heal before I could swallow. That\u0027s what Bella needed. To be strong like me, to be able to heal....\n She took an easier breath and then relaxed back into the sofa, her body going limp.\n \"Hmm,\" Carlisle murmured. I looked up, and his eyes were on me.\n \"What?\" I demanded.\n Edward\u0027s head leaned to one side as he reflected on whatever was in Carlisle\u0027s head.\n \"You know that I was wondering about the fetus\u0027s genetic makeup, Jacob. About his chromosomes.\"\n \"What of it?\"\n \"Well, taking your similarities into consideration - \"\n \"Similarif/es?\" I growled, not appreciating the plural.\n \"The accelerated growth, and the fact that Alice cannot see either of you.\"\n I felt my face go blank. I\u0027d forgotten about that other one.\n \"Well, I wonder if that means that we have an answer. If the similarities are gene-deep.\"\n \"Twenty-four pairs,\" Edward muttered under his breath.\n \"You don\u0027t know that.\"\n \"No. But it\u0027s interesting to speculate,\" Carlisle said in a soothing voice.\n \"Yeah. Just fascinating\"\n Bella\u0027s light snore started up again, accenting my sarcasm nicely.\n They got into it then, quickly taking the genetics conversation to a point where the only words I could understand were the the\u0027s and the ands. And my own name, of course. Alice joined in, commenting now and then in her chirpy bird voice.\n Even though they were talking about me, I didn\u0027t try to figure out the conclusions they were drawing. I had other things on my mind, a few facts I was trying to reconcile.\n Fact one, Bella\u0027d said that the creature was protected by something as strong as vampire skin, something that was too impenetrable for ultrasounds, too tough for needles. Fact two, Rosalie\u0027d said they had a plan to deliver the\n creature safely. Fact three, Edward\u0027d said that - in myths - other monsters like this one would chew their way out of their own mothers.\n I shuddered.\n And that made a sick kind of sense, because, fact four, not many things could cut through something as strong as vampire skin. The half-creature\u0027s teeth - according to myth - were strong enough. My teeth\n were strong enough.\n And vampire teeth were strong enough.\n It was hard to miss the obvious, but I sure wished I could. Because I had a pretty good idea exactly how Rosalie planned to get that thing \"safely\" out. \n","sourceLink":"https://allnovel.net/the-twilight-saga-4-breaking-dawn-twilight-4/page-16.html","bookId":2026,"book":{"id":2026,"title":"The Twilight Saga 4: Breaking Dawn (Twilight #4)","description":"Storyline: \n Breaking Dawn is the fourth novel in the Twilight series by Stephenie Meyer. Divided into three parts, the first and third sections are written from Bella Swan\u0027s perspective and the second is written from the perspective of Jacob Black. Breaking Dawn was released on August 2, 2008 at midnight release parties in over 4,000 bookstores throughout the US. From its initial print run of 3.7 million copies, 1.3 million were sold in the first 24 hours of the book\u0027s release, setting a record in first-day sales performance for the Hachette Book Group USA.\n \n","cover":"https://allnovel.net/images/the-twilight-saga-4-breaking-dawn-twilight-4.jpg","author":"Stephenie Meyer","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-twilight-saga-4-breaking-dawn-twilight-4.html","creation":"Oct 5, 2019 8:58:16 AM","modification":"Oct 5, 2019 11:14:25 PM"}}
