{"id":96455,"no":15,"title":"Page 15","content":"Moonlight Dance flyers and signs were posted all around the school. The annual dance welcomed in the beginning of spring and was an event every student hoped to attend.\n I was eyeing a poster while I was waiting to meet Ivy and Abby after class and dreaming of what it would be like to be Brandon\u0027s date. He\u0027d wear a stunning sport coat, and I\u0027d wear a tea-length dress that shimmered like diamonds. Everyone would watch us dance together as the moonlight shined above.\n Then I realized - the moonlight. I pulled out my calendar and frantically flipped through the pages. And there it was - staring at me in the face - FULL MOON. Brandon would be a werewolf that night. My heart plummeted to my shoes.\n Suddenly someone tweaked my sides and I screamed.\n \"You are so easily spooked!\" Nash said.\n \"Uh . . . I was just . . .\"\n \"Thinking about the dance?\"\n \"Uh . . . I guess.\"\n \"I was, too. And I wanted to know if you\u0027d be my date.\"\n I was shocked. I certainly didn\u0027t think he\u0027d ask me, knowing I had feelings for Brandon. And I assumed he would be taking Heidi Rosen.\n \"I figured you wouldn\u0027t be going with you-know-who,\" he said, \"being that it will be a full moon and all. Do you already have a date?\"\n Nash had me trapped. Brandon hadn\u0027t even asked me yet. I didn\u0027t know what to say. \"Well . . . uh . . . no,\" I said truthfully. \"But - \"\n \"Great, then you\u0027ll go with me,\" he said triumphantly.\n Before I could stop him, Nash kissed me on the cheek and said, \"I\u0027ll get tickets,\" and took off down the hall.\n I was left standing there, dumbfounded, when Ivy and Abby arrived.\n \"Well, then everything will be back to normal,\" Ivy said when I told her what happened.\n Even though we were fine, she still longed for us to remain a sixsome - the original sixsome.\n \"I\u0027m not so sure. I really wanted to go with Brandon.\" I was relieved I no longer had to hide my affection for the Westsider from my friends and was happy to admit the truth to them, even if I\u0027d gotten myself in a jam.\n \"Did Brandon ask you?\" Abby wondered excitedly.\n \"No,\" I said. \"The signs were just posted. It\u0027s his first year here - so he wouldn\u0027t even know about the dance.\"\n \"Well, it seems to me that you\u0027re in quite a pickle!\" Abby said.\n Brandon caught up to me after fifth bell. He seemed really excited about something. \"I wanted to talk to you,\" he said brightly. \"Do you have a minute?\"\n \"Yes.\" I couldn\u0027t think of anything I\u0027d rather be doing than be with Brandon, and anything could be put off till later to make that happen.\n We stepped into an empty alcove next to the library.\n \"I saw the signs about a Moonlight Dance coming up,\" he said.\n \"Oh?\" I said.\n \"I wanted to check with you - before anyone else had a chance to ask you. You can say no - since I\u0027m a Westsider and all,\" he said with a cute smile, \"but would you want to go to the Moonlight Dance with me?\"\n \"I\u0027d love to!\" I blurted out.\n \"Great!\" he said.\n \"But there\u0027s one problem,\" we both said in unison.\n We both laughed.\n \"You first,\" he said. Brandon gazed down at me lovingly.\n \"No, you,\" I said.\n \"It will be a full moon - \" he began.\n \"I know.\"\n \"But . . . I\u0027m hoping my dad will have sent me the antidote by then. And we\u0027ll be good to go.\"\n \"Oh . . . okay.\"\n \"Now what is your problem?\" he asked me.\n \"Uh . . .\" I couldn\u0027t bring myself to tell him about the Nash situation.\n \"It\u0027s okay, you can tell me.\"\n \"I don\u0027t have anything to wear!\"\n After school, Ivy, Abby, and I went to the mall in search of dresses for the Moonlight Dance. My friends were thrilled to have any excuse to shop.\n \"So, Celeste, you can buy one dress to wear for Nash and one to wear for Brandon,\" Abby teased.\n \"Maybe you should pick Nash,\" Ivy said. \"Maybe it will rekindle your feelings for him again.\"\n Abby and Ivy found tons of dresses to try on while I still sifted through the racks trying to find one that I thought might look all right.\n \"At least pick something,\" Ivy said.\n I saw a teal blue dress with a thin black belt. It was gorgeous. Then I noticed the price. My heart almost burst through my chest.\n \"I can wear one of Juliette\u0027s,\" I said.\n \"Whatever!\" Ivy took the dress from my hand and somehow managed to drape it over her other ones and teetered her way to the dressing room.\n I reluctantly followed behind.\n Abby modeled a lavender strapless while Ivy posed in a blue dress. I could see my two friends looked amazing as I peered from my dressing-room door.\n \"Come on over here!\" Abby said.\n I tiptoed out in my bare feet.\n \"You look gorgeous!\" Abby shouted.\n \"You have to buy it!\" Ivy cheered.\n \"So, you\u0027ll wear this with Nash,\" Ivy said.\n \"I think it will match Brandon\u0027s eyes,\" Abby said.\n I imagined my old self, happy that Nash was paying me so much attention and generously making all efforts to be there for me. And I imagined my new self with Brandon, happier than I\u0027d ever been - but torn for the guy who had to hide from a full moon.\n The one thing I couldn\u0027t have imagined was the predicament I was in now. Movie or TV stars might have these problems, but not someone like me.\n It was a week before the dance and Nash appeared to be feeling great. His bandage and stitches were removed and he was able to play baseball. He showed off his scar, while Brandon continued to hide his under his fingerless gloves. I was relieved that my former boyfriend seemed not only back to normal but was more enthusiastic and happy than I\u0027d seen him in months. I tried to tell him about Brandon and the dance, but every time I broached the subject, he either dismissed it or changed the topic. I wasn\u0027t sure if maybe he already knew and was just trying to avoid the situation.\n Nash was my friend - and my first boyfriend - and I wasn\u0027t the type to feel good when hurting others. I wanted to proceed with caution in telling him. Nash was more focused on me than when we dated. He made a point to ignore Heidi Rosen and was attentive toward me. I had to wait for the right moment to convince him I would be attending the dance with Brandon.\n \"You have to come over,\" Brandon said one day after school.\n His tone was urgent and emphatic. I was nervous about what could be so important that Brandon would have me come over immediately.\n When I arrived at his guesthouse, Brandon didn\u0027t even kiss me, but instead, enthusiastically led me to his desk. An open shipping box was sitting on it, with brown mailing paper lying next to it. The postmark was from Geneva.\n \"Here it is,\" he said.\n \"What is it?\"\n \"The antidote.\" He led me over to the desk.\n \"You\u0027re kidding!\"\n \"No,\" he said, pleased.\n \"What do you do with it?\" I asked. I didn\u0027t touch the small, oil-filled vial but rather examined it from a safe distance.\n He took it out of the box. \"I drink it.\"\n \"It doesn\u0027t look like it would taste very good.\"\n \"I guess not,\" he said with a laugh.\n \"So, when do you take it?\"\n \"Just as the sun sets on the next full moon,\" he said, placing it back in the box.\n \"This is great news!\"\n \"Yes. Then we can go to the dance the following night.\"\n \"And we can date at school!\"\n We embraced. He picked me up and swung me around.\n \"So how did Nash react when you told him you were going with me?\"\n \"Uh . . .\" I said as I got my bearings.\n \"You haven\u0027t told him yet?\" he asked.\n \"I\u0027ve been trying to - \"\n \"You have to tell him,\" he said.\n \"I know,\" I said, ashamed of myself.\n \"Do you want me to tell him?\" he asked, towering over me.\n \"I\u0027m not sure that\u0027s the best idea.\"\n \"I figured not,\" he said with a clever grin.\n He took my hand and led me back to the vial.\n \"There is one issue, however. My dad says the antidote hasn\u0027t been tested on humans. Well . . . for obvious reasons. He doesn\u0027t know any other werewolves.\"\n \"I guess not.\"\n \"Since it hasn\u0027t been tested, he says there is a small chance . . . that it will have the opposite outcome.\"\n \"I\u0027m not sure what you mean.\"\n \"There is a small chance that it can make me a werewolf full-time.\"\n \"That\u0027s a huge risk!\" I said.\n \"I wanted you to know.\"\n \"So you could be a werewolf under any moon?\"\n \"Yes,\" he answered.\n \"What will you do?\" I asked.\n \"I don\u0027t know. What would you do?\"\n I wondered what I\u0027d do. Of course, I wouldn\u0027t want to be a werewolf even three times a month - so I surely wouldn\u0027t want to be one every night. But Brandon? I wasn\u0027t sure what to tell him I\u0027d do.\n \"I don\u0027t know. . . .\" I said. \"I really don\u0027t know.\"\n \"On the one hand, there\u0027s the chance I can be normal,\" he pondered. \"And we could be together. On the other, I could never be normal and we could . . .\"\n I gazed at him. Never have a future together? I thought. \"It is a decision you have to make, Brandon,\" I said, hugging him and trying to comprehend the magnitude of the situation. \"I\u0027ll support you either way.\"\n The following morning at school, I approached Nash. I knew he was going to be hurt and upset when I told him I wouldn\u0027t be able to go with him to the Moonlight Dance - and instead would be showing up with Brandon. But I had to tell him and this time let nothing get in my way.\n \"I need to talk to you,\" I said, finding him as he headed toward baseball practice.\n \"Me too,\" he said. He shot me a sexy stare and leaned on his bat. \"I heard you got your dress with Ivy and Abby.\"\n \"They told you?\" I asked. I assumed my friends wouldn\u0027t blab the information about their dresses to the guys - but mine? This was going to be even harder than I thought.\n \"Uh-huh. I know you are going to look gorgeous.\"\n \"Well . . . I have to tell you something about the dance.\"\n \"It\u0027s weird,\" he interrupted, \"but since I got that bite, I feel so different. I feel more alive. Things taste better, I can see better. I have more energy - and I had enough before. It\u0027s like I see the world differently. Fresh. New. Maybe it\u0027s one of those near-death experiences.\"\n \"Well, I\u0027m not sure how you are going to see this.\"\n \"What?\"\n \"I\u0027ve been trying to tell you about the dance. When you asked me . . . I didn\u0027t have the chance to tell you because you ran off so quickly.\"\n His jovial mood quickly changed. \"You\u0027re going with Brandon,\" he said suddenly.\n I was surprised he knew. \"Did Ivy and Abby tell you?\"\n \"They didn\u0027t have to. I can see it in your face.\"\n \"I\u0027ve been trying to tell you, Nash, honestly. But it seemed like you didn\u0027t want to listen to me.\"\n \"So you are ditching me for him?\"\n \"I never said \u0027yes.\u0027 You ran off, and it became a misunderstanding. I\u0027ve been trying to tell you ever since.\"\n Nash tapped the top of his bat, frustrated. \"He\u0027s going to be a werewolf this weekend. Not only are you going to show up with a Westsider - but a werewolf?\"\n \"Shh,\" I said. \"He\u0027s not going to be one. His father sent him a cure.\"\n \"A cure?\" he said. \"Are you crazy? He can\u0027t be cured. I saw him - he\u0027s a circus freak!\"\n \"He is not,\" I argued. \"He\u0027s a really kind person. He saved you, don\u0027t you remember?\"\n Nash turned red and got in my face. \"Be my guest, Celeste. You could go with me, your first boyfriend, who is one of the most popular guys in this school.\" Then he looked at me intently. \"A guy who is in love with you.\"\n I was surprised by Nash\u0027s confession and left speechless. His words were kind but ultimately too late. When I didn\u0027t respond, his mood suddenly changed. \"Or you could show up with a two-bit loner hick who\u0027s a werewolf.\"\n I was shocked by his sudden outburst. I figured Nash would be angry, but I wasn\u0027t prepared for him to spew such venom.\n \"In fact, I\u0027d rather not go with you,\" he said indignantly. \"If that\u0027s your taste in men? I wouldn\u0027t want you liking me.\"\n He placed his bat over his shoulder, turned, and walked away.\n I was stunned. I knew he\u0027d be mad, but I didn\u0027t know he\u0027d be cruel.\n As I watched my former boyfriend storm off to the field, I thought about what he\u0027d just said. In the mix of his hatred, he had told me that he loved me. After all this time of dating him, Nash Hamilton was finally in love with me. And now I was in love with a werewolf. \n","sourceLink":"https://allnovel.net/magic-of-the-moonlight-full-moon-2/page-15.html","bookId":2149,"book":{"id":2149,"title":"Magic of the Moonlight (Full Moon #2)","description":"Storyline: \n Magic of the Moonlight (Full Moon #2) \n Beware of a bite under a full moon… \n it will complicate your love life. \n Celeste has more to worry about than a secret romance with a hot guy from the wrong side of town. That guy, Brandon, is a werewolf. With gossip and hostility swirling at school, it’s time to find a cure for his nocturnal condition, and perhaps the one person who can help is his scientist father. But what if a “cure” makes things worse and Brandon becomes a werewolf full time? And with rumors circulating that there are werewolves in Legend’s Run, is it possible that there is another among their classmates? \n To keep Brandon’s secret safe, Celeste must hide her relationship with him from her best friends, but with the Moonlight Ball approaching, she must make a choice. Her dream is to go with her one true love—Brandon. But once the sun goes down, the clouds separate, and the full moon appears, could she really walk into the dance on the arm of a werewolf? \n In this installment of the sumptuously romantic Full Moon series, Celeste faces her fears and her friends and finds out whether she’s strong enough to stand up for herself and her one true love.\n \n","cover":"https://allnovel.net/images/magic-of-the-moonlight-full-moon-2.jpg","author":"Ellen Schreiber","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/magic-of-the-moonlight-full-moon-2.html","creation":"Oct 5, 2019 8:58:23 AM","modification":"Oct 5, 2019 6:21:05 PM"}}
