{"id":96457,"no":17,"title":"Page 17","content":"Beware of a bite under a full moon. It will complicate your love life. I recalled Dr. Meadows\u0027s prediction when Ivy and I had visited her shop. I thought perhaps she\u0027d been talking about me or Dr. Maddox, but it was in fact Nash whom the psychic was channeling. Dr. Meadows\u0027s prediction had been accurate again. And now that Nash had been bitten and become a werewolf, I feared for him, and it was sure to complicate matters for Brandon and me. At school the next morning, we girls met Dylan and Jake outside the front steps of school. \"The baseball storage shed was trashed last night!\" Jake said, having just come from the field. \"We don\u0027t know who got into it - or what,\" Dylan said. \"Well, maybe you won\u0027t be able to play, and then you can spend more time with us,\" Ivy said. \"I\u0027m not kidding. Thousands of dollars in damages,\" Dylan said. \"The coach was really upset.\" \"Perhaps you are being paid back for trashing Brandon\u0027s locker,\" Abby said. \"What?\" Ivy asked, dumbfounded. Abby went stone-cold silent. \"Jake didn\u0027t do that,\" Ivy shot back. \"Uh . . . maybe you should ask Jake,\" Abby said. \"You vandalized Brandon\u0027s stuff?\" Ivy asked like a disappointed parent. \"Just the once . . .\" he confessed. \"I mean twice . . . if you include the Jeep.\" \"How could you?\" Ivy asked. \"You aren\u0027t a juvie! What were you thinking?\" \"That maybe he could use a lesson to back off of you girls,\" Jake said. \"Well, that is just totally ignorant,\" Ivy scolded. \"And you knew?\" She glared at Abby. \"I saw some paint cans in Dylan\u0027s truck and he told me.\" \"Why didn\u0027t you tell me?\" Ivy asked. \"He swore me to secrecy.\" \"So you are the friend who kept a secret from me that Dr. Meadows warned me about,\" Ivy said. \"Wait, both of my best friends did that to me?\" \"Do you think Brandon did this?\" she asked gently. \"To get back at you guys?\" \"Maybe it was Dylan and Jake - \" Abby said. \"Hey - we wouldn\u0027t trash our own stuff,\" Dylan said. \"It looks like an animal did it,\" Jake offered. \"We\u0027re going to have to replace a lot of this equipment,\" Dylan added. \"Maybe someone was very angry he didn\u0027t make the team.\" \"I still think it was an animal,\" Jake said. Just then Nash came down the steps and joined us. \"Wow - you look ragged out, man,\" Dylan said. \"Late night?\" \"You guys went out?\" Abby asked. I remained silent. \"You have a scratch on your arm,\" Dylan said to me. \"What gives?\" \"Were you out with Nash?\" Abby whispered. \"No, I didn\u0027t go out with him,\" I finally said. \"Did you hear about the storage shed being trashed?\" Dylan asked Nash. \"Yes,\" Nash said. \"Animals, real animals.\" \"Well, the Moonlight Dance is tonight,\" Abby said. \"I can\u0027t wait,\" Ivy added. \"It\u0027s going to be a blast.\" \"Yes, I can\u0027t, either,\" Nash said. The gang was heading for their lockers when Nash stopped me at the top of the stairs. \"I need to talk to you, Celeste, in private.\" \"I\u0027ll catch up with you,\" I called to Ivy and Abby, who were still at odds because of Abby\u0027s secrecy. \"Something happened last night,\" Nash said. \"I have to tell someone - and I know you won\u0027t tell anyone, right?\" \"If you don\u0027t want me to.\" \"I dreamed all night,\" he said. \"It was horrible. But the worst of it was that when I woke up, I was in the woods behind the baseball field.\" He looked to me for my reaction. When I wasn\u0027t totally shocked, he was surprised. \"What?\" he asked. \"Oh . . . nothing. Go on.\" \"I don\u0027t know what\u0027s happened.\" I didn\u0027t have the heart to tell my first crush - my first boyfriend - that last night I\u0027d seen him turn into a werewolf. \"How did I get there - and why?\" he asked. \"And if I was there - I must have seen who trashed the storage shed - but I don\u0027t remember who I saw.\" \"It\u0027s okay - \" I said, even though I knew it wasn\u0027t. If Brandon had a cure, then maybe it could be used for Nash as well. I\u0027d just need time to find out. \"What happened to your arm?\" he asked. \"Did Brandon . . . ?\" No, it was you, I wanted to say. I wanted to tell him that he was the one who\u0027d attacked me. But with the bell ringing and other students hanging around, now wasn\u0027t the time to confess what I\u0027d witnessed and experienced the night before. \"Nash doesn\u0027t remember anything,\" I told Brandon as soon as I was able to catch him between classes. \"The baseball storage shed was trashed and he doesn\u0027t think he did it. But I do.\" \"Why do you think so?\" \"Because he said he woke up in the woods behind the school. He told me not to tell anyone - but I figured you\u0027d understand. I\u0027m really worried about him, Brandon. He doesn\u0027t know about last night. Or why he woke up in the woods. He doesn\u0027t even know that he chased me in Willow Park. I couldn\u0027t bear to tell him he did - or what he became. The dance is tonight,\" I said, my heart racing. \"He doesn\u0027t know he\u0027s going to turn.\" \"Who is he going with?\" Brandon asked. \"I don\u0027t know. Maybe Heidi Rosen? I know I\u0027m going with you.\" \"I don\u0027t think he\u0027ll be going with anyone,\" he said. \"He\u0027s going to turn, and then he\u0027s going to inhabit the woods all night.\" \"You think?\" \"I know,\" he said. \"But I\u0027m not. I\u0027m going to be just like every other guy there - taking his girlfriend to the dance.\" \"So we don\u0027t need to do anything about Nash?\" \"There\u0027s nothing to do,\" he said reassuringly. \"At least not tonight. Let\u0027s cure me first. Then we\u0027ll be able to cure Nash.\"","sourceLink":"https://allnovel.net/magic-of-the-moonlight-full-moon-2/page-17.html","bookId":2149,"book":{"id":2149,"title":"Magic of the Moonlight (Full Moon #2)","description":"Storyline: Magic of the Moonlight (Full Moon #2) Beware of a bite under a full moon… it will complicate your love life. Celeste has more to worry about than a secret romance with a hot guy from the wrong side of town. That guy, Brandon, is a werewolf. With gossip and hostility swirling at school, it’s time to find a cure for his nocturnal condition, and perhaps the one person who can help is his scientist father. But what if a “cure” makes things worse and Brandon becomes a werewolf full time? And with rumors circulating that there are werewolves in Legend’s Run, is it possible that there is another among their classmates? To keep Brandon’s secret safe, Celeste must hide her relationship with him from her best friends, but with the Moonlight Ball approaching, she must make a choice. Her dream is to go with her one true love—Brandon. But once the sun goes down, the clouds separate, and the full moon appears, could she really walk into the dance on the arm of a werewolf? In this installment of the sumptuously romantic Full Moon series, Celeste faces her fears and her friends and finds out whether she’s strong enough to stand up for herself and her one true love.","cover":"https://allnovel.net/images/magic-of-the-moonlight-full-moon-2.jpg","author":"Ellen Schreiber","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/magic-of-the-moonlight-full-moon-2.html","creation":"Oct 5, 2019 8:58:23 AM","modification":"Oct 5, 2019 6:21:05 PM"}}
