{"id":102147,"no":24,"title":"Page 24","content":"“She interviewed the three Washington State fruitcake recipe finalists.”\n “I know.” Oliver realized he probably sounded smug. “I was the one who flew her in for the interviews. Don’t you remember I told you about that?”\n “Yes, but you didn’t tell me who you were flying or what for.”\n “She usually writes obituaries, Mom.”\n “You haven’t read her articles, have you?”\n “I’ve been busy.”\n “Everyone in town is talking about them,” his mother informed him. “At my bridge club luncheon, we all said we were surprised someone that young could be so wise.”\n “How do you know her age?”\n “The paper ran her photo at the bottom of the last article. She’s an attractive woman.”\n Oliver agreed.\n “My son is dating Emma Collins.”\n “She’s making dinner for me tonight.” He didn’t think now was the time to mention that Emma had agreed to this only because she’d lost a bet.\n “I can’t believe you haven’t said anything!”\n “Sorry.”\n “You should be. That girl is gifted. Those articles were so good.”\n “Save them for me, would you?” He’d look through the papers in his recycling bin, but just in case…\n “I already used one of the recipes and I’m going to serve it on Christmas Day.”\n Oliver liked fruitcake, and there always seemed to be plenty of it around his parents’ house. “So I can bring Emma?”\n “Don’t you dare show up without her.”\n “Wouldn’t dream of it.”\n As soon as he arrived home, Oliver collected a week’s worth of papers and sat down with them, searching until he located the first article—about the Yakima interview. He studied a picture of Earleen Williams displaying her fruitcake. Emma wasn’t a bad photographer. He recalled that first flight and how nervous she’d been. Then he remembered her problem with the television in the motel room and her effort to hear the news that turned out to be nudes. At that he laughed outright.\n His mother was right; the article was insightful and well-written. Within a few paragraphs, Oliver felt he knew Earleen. He’d certainly met women like her who didn’t recognize their own worth or, as in Earleen’s case, recognized it later in life. Emma had characterized her with real sensitivity. Logically but subtly, she led the reader to her own conclusion—that this was a generous woman who’d spent her life loving men who didn’t deserve her devotion.\n He found the article about Sophie McKay next. Sophie was a woman who enjoyed life. Neither she nor her fruitcake recipe was in any way typical. She took the ingredients she liked best and combined them into a truly unique recipe, just as she’d done with her life. Both she and her beloved husband, Harry, had been willing to compromise on the fruitcake issue and, no doubt, on the more important conflicts within their marriage. After his death, she’d mourned him and continued to love him but also continued to live. Sophie McKay, like her fruitcake, was one of a kind.\n As Oliver rummaged through discarded papers for the third and final article, he understood what had intrigued his mother and her friends about Emma. She was special, and her understanding of these women’s lives was compassionate as well as incisive.\n When he found the third article, he smiled at the picture of Peggy Lucas surrounded by her children. He almost wished Emma had been in the photograph. The theme for that article was eat it now and the No-Bake Fruitcake recipe followed. With Peggy, too, Emma had found just the right tone.\n In all three articles, she’d managed to write about fruitcake—on the surface a rather limited subject—in ways that gave it a larger meaning. Fruitcake as a symbol for life. Hmm…\n Emma might not be much good at garnering advertising dollars for Walt, but she shouldn’t worry. What she lacked in sales ability she more than compensated for with her writing talent.\n Oliver saw that it was almost seven. Rubbing his hand down his cheek, he decided to shave. He was in a good mood and knew he should credit Emma with that. She’d impressed him with her work and she made him laugh. There was a lot to be said for a woman who possessed a sense of humor. After throwing on his leather jacket, which had survived its icy bath in Puget Sound, he reached for the wine bottle, called Oscar and together, man and dog headed out the door.\n Striking what he hoped was a sexy Cary Grant pose, Oliver rang the doorbell. He leaned his shoulder against the doorjamb and crossed his ankles, bottle tucked under one arm. It didn’t take Emma long to answer. Unlatching the lock, she opened the door and immediately made a fuss over Oscar. She hardly seemed to notice Oliver was even there. Apparently she was immune to his many charms—or wanted him to think she was. Definitely hard on the ego.\n “That’s all the greeting I get?” he chided.\n She wore a towel apron over jeans and looked lovely. He couldn’t resist. Slipping his hand behind her neck, Oliver bent forward and kissed her. She tasted wonderful—a little spicy, a little sweet.\n She blinked several times when he released her. “Hi,” she said in a husky voice, sounding flustered. When they’d first met, he’d enjoyed teasing her about how much she wanted him. Actually, the reverse was true. He wanted her. In an effort to derail the direction of his thoughts, he asked, “What’s for dinner?”\n “If I don’t get back to the stove in a hurry, it’ll be takeout.” She dashed across the room and returned to her kitchen.\n Oliver bent down and petted Boots. The two dogs resumed their ritual sniffing.\n “Ever heard of puttanesca?” Emma asked, emptying a large can of crushed tomatoes into a pan.\n “Putin what?” Oliver asked as he set the wine bottle down on the crowded countertop. “Is it some Russian dish?”\n “Puttanesca,” Emma repeated. “It’s an Italian pasta sauce. My mother used to make it. I have to warn you it’s kind of spicy.”\n The scents in the kitchen were delectable. He smelled garlic and tomatoes and something else he couldn’t identify. He saw an empty anchovy can and wondered if that was it. Oliver enjoyed the little fish on his pizza. So far, that was the only time he’d ever eaten anchovies.\n Emma stirred the simmering sauce, her back to him. “Mom told me that women of the night would put a pan of this sauce in the window in order to entice men.”\n “Are you trying to entice me, Emma Collins?” Oliver asked softly.\n As if she realized what she’d said, Emma whirled around, her eyes wide. “No…you misunderstood. This has nothing to do with you and me.”\n It was probably wrong of him to find amusement in her obvious discomfort, but he grinned and said, “Pity.”\n She held his gaze. “Could I?” she asked, her voice hesitant. “Entice you, I mean.”\n He shrugged carelessly. “You could always give it a try.” He grinned again. “In fact, why don’t you?”\n She smiled in response and the tip of her tongue moistened her lower lip before she turned back to the pasta sauce.\n Oliver was convinced she had no idea what an effective job she was doing of enticing him right then and there. He fought the impulse to kiss her again. “Is there anything you’d like me to do?”\n She nodded. “You can roll the lemon.”\n Oliver was sure he’d misheard. “You want me to what?”\n “Roll the lemon between your hands,” she explained. “I’d normally roll it against the countertop, but as you can see, I don’t have much space here.”\n He pressed the lemon between his hands, then crushed it with all his might. “This is for the pasta?”\n “No,” she said with a laugh. “The salad. I’m squeezing fresh lemon juice over the greens and then tossing them with a little extra-virgin olive oil.”\n Extra-virgin, was it? Oliver didn’t even want to know what that meant. Then again, maybe he did.\n “The bread’s warming in the oven.”\n “Of course.” The table was already set, and when he’d finished pulverizing the lemon, he opened the wine. After giving it a couple of minutes to breathe—he’d read about that once in an airline magazine—he poured them each a glass.\n Emma certainly seemed to know what she was doing. He asked her about it over dinner as he swallowed every noodle and scraped up every last drop of the delicious sauce.\n “My mom was the cook in the family. I miss her so much,” she said quietly. “This is the first time I’ve made puttanesca since she died and I was a little concerned it wouldn’t be the same.”\n “If it isn’t, don’t change anything. This was fabulous.”\n Emma smiled and picked up her glass of wine.\n She rarely mentioned her mother. Oliver knew the subject was a painful one, but he sensed that she wanted to talk about her now.\n “She taught you to cook, right?”\n Emma nodded. “Mom insisted I should know my way around a kitchen. Isn’t that something in these days of convenience food? I can’t remember Mom ever resorting to processed food. I didn’t taste macaroni and cheese from a box until I was almost an adult.” She grimaced comically. “That’s what comes of living on a student budget.”\n “Do you like cooking?” he asked.\n She nodded again. “I don’t do it often enough. If Mom were alive, I’m afraid I’d be a disappointment to her.”\n “I’m sure that’s not true.” He was sincere; her mother would be very proud of Emma and rightly so. “Speaking of mothers, I talked to mine this afternoon and she read your articles.”\n Emma’s eyes brightened. “Did she enjoy them?”\n “Mom was very impressed.” Oliver was a little disgruntled that Emma hadn’t let him know those fruitcake pieces had been published. He’d also been put out over her lack of appreciation for the Christmas tree. She had the tree up, but it didn’t have a single strand of lights or even one decoration. It leaned rather forlornly against the corner of her living room. She hadn’t bought a stand; she’d just stuck it in a large, dirt-filled flower pot.\n “That’s great.” Emma seemed pleased by his mother’s reaction.\n “What did Walt say?”\n Emma chuckled. “His only comment after he read the final drafts was that I gave him clean copy. Which is high praise from Walt.”\n Oliver helped himself to the last of the pasta sauce and sopped it up with his bread. “Getting back to my mother, she wants to meet you.”\n “She does?”\n Oliver played this part cool. “Yeah. I told her I could arrange it.”\n “I’d be delighted to meet her.”\n “How about Christmas Day?” he asked, again casually.\n Emma’s smile faded. “Christmas Day,” she said slowly.\n “Is that a problem?” Oliver felt like smacking his forehead. He should’ve realized she’d have plans. Everyone did on Christmas.\n “I’m sorry, it won’t work.” At least she had the good grace to look regretful. \n","sourceLink":"https://allnovel.net/glad-tidings/page-24.html","bookId":2631,"book":{"id":2631,"title":"Glad Tidings","description":"Storyline: \n Glad Tidings (Here Comes Trouble \u0026 There\u0027s Something About Christmas) \n CHRISTMAS NEWS! READ ALL ABOUT IT! \n This is a time for families, for togetherness, for memories. On Christmas Eve, Maryanne and Nolan Adams tell their kids the story they most want to hear --- how Mom and Dad met and fell in love. It all started when they were reporters on rival Seattle papers ... and next thing you know, Here Comes Trouble! \n Christmas is also a time for ... fruitcake. Rookie reporter Emma Collins hates fruitcake; for that matter, she hates Christmas, too. When three Washington State women are finalists in a national fruitcake contest, the story is assigned to her. That\u0027s bad enough. It gets worse when she has to fly in a small plane (scary!) with a smart-aleck pilot named Oliver Hamilton (sexy!) and his scruffy dog (cute!). In the end she meets three wise women, falls in love and learns There\u0027s Something About Christmas.\n \n","cover":"https://allnovel.net/images/glad-tidings.jpg","author":"Debbie Macomber","type":"Christian","source":"allnovel","link":"https://allnovel.net/glad-tidings.html","creation":"Oct 5, 2019 8:58:57 AM","modification":"Oct 5, 2019 10:12:08 PM"}}
