{"id":102168,"no":45,"title":"Page 45","content":"Her heart was beating so furiously her body seemed to rock with the sheer force of it. Every throb seemed to drive her directly into his arms, right where she longed to be. She placed her palms against his chest and sighed as his mouth met hers. The touch of his lips felt warm and soft. And right.\\n\\n His hand cradled her neck while his lips continued to move over hers in the gentlest explorations, as though he feared she was too delicate to kiss the way he wanted.\\n\\n Gradually his hands slipped to her shoulders. He drew a ragged breath, then put his head back as he stared up at the ceiling. He exhaled slowly, deliberately.\\n\\n It took all the restraint Maryanne possessed not to ask him why he was stopping. She wanted these incredible sensations to continue. She longed to explore the feelings his kiss produced and the complex responses she experienced deep within her body. Her pulse hammered erratically as she tried to control her breathing.\\n\\n “Okay, now we’ve got that settled, I’ll leave.” He backed away from her.\\n\\n “Got what settled?” she asked swiftly, then realized she was only making a bigger fool of herself. Naturally he was talking about the reason for this impromptu visit, which had been her health. Hadn’t it? “Oh, I see.”\\n\\n “I don’t think you do,” Nolan said enigmatically. He turned and walked away.\\n\\n Chapter Eight\\n\\n “Whose turn next?” Maryanne asked. She and her two friends were sitting in the middle of her living room floor, having a “pity party.”\\n\\n “I will,” Carol Riverside volunteered eagerly. She ceremonially plucked a tissue from the box that rested in the centre of their small circle, next to the lit candle. Their second large bottle of cheap wine was nearly empty, and the three of them were feeling no pain.\\n\\n “For years I’ve wanted to write a newspaper column of my own,” Carol said, squaring her shoulders and hauling in a huge breath. “But it’s not what I thought it’d be like. I ran out of ideas for things to write about after the first week.”\\n\\n “Ah,” Maryanne sighed sympathetically.\\n\\n “Ah,” Barbara echoed.\\n\\n “That’s not all,” Carol said sadly. “I never knew the world was so full of critics. No one seems to agree with me. I—I didn’t know Seattle had so many cantankerous readers. I try, but it’s impossible to make everyone happy. What happens is that some of the people like me some of the time and all the rest hate everything I write.” She glanced up. “Except the two of you, of course.”\\n\\n Maryanne nodded her head so hard she nearly toppled over. She spread her hands out at either side in an effort to maintain her balance. The wine made her yawn loudly.\\n\\n Apparently in real distress, Carol dabbed at her eyes. “Being a columnist is hard work and nothing like I’d always dreamed.” The edges of her mouth turned downward. “I don’t even like writing anymore,” she sobbed.\\n\\n “Isn’t that a pity!” Maryanne cried, ritually tossing her tissue into the centre of the circle. Barbara followed suit, and then they both patted Carol gently on the back.\\n\\n Carol brightened once she’d finished. “I don’t know what I’d do without the two of you. You and Betty are my very best friends in the whole world,” she announced.\\n\\n “Barbara,” Maryanne corrected. “Your very best friend’s name is Barbara.”\\n\\n The three of them looked at each other and burst into gales of laughter. Maryanne hushed them by waving her hands. “Stop! We can’t allow ourselves to become giddy. A pity party doesn’t work if all we do is laugh. We’ve got to remember this is sad and serious business.”\\n\\n “Sad and serious,” Barbara agreed, sobering. She grabbed a fresh tissue and clutched it in her hand, waiting for the others to share their sorrows and give her a reason to cry.\\n\\n “Whose idea was the wine?” Maryanne wanted to know, taking a quick sip.\\n\\n Carol blushed. “I thought it would be less fattening than the chocolate ice-cream bars you planned to serve.”\\n\\n “Hey,” Barbara said, narrowing her eyes at Maryanne. “You haven’t said anything about your problem.”\\n\\n Maryanne suddenly found it necessary to remove lint from her jeans. Sharing what disturbed her most was a little more complicated than being disappointed in her job or complaining about fingernails that cracked all too easily, as Barbara had done. She hadn’t sold a single article since she’d quit the paper, or even received a positive response to one of her queries. But worst of all she was falling in love with Nolan. He felt something for her, too—she knew that—but he was fighting her every step of the way. Fighting her and fighting himself.\\n\\n He was attracted to her, he couldn’t deny it, although he’d tried to, more than once. When they were alone together, the tension seemed to throb between them.\\n\\n He was battling the attraction so hard he’d gone as far as arranging a date for her with another man. Since the evening they’d met, Nolan had insulted her, harangued her and lectured her. He’d made it plain that he didn’t want her around. And yet there were times he sought out her company. He argued with her at every opportunity, took it upon himself to be her guardian, and yet…\\n\\n “Maryanne?” Carol said, studying her with concern. “What’s wrong?”\\n\\n “Nolan Adams,” she whispered. Lifting her wineglass, she took a small swallow, hoping that would give her the courage to continue.\\n\\n “I should have guessed,” Carol muttered, frowning. “From the moment you moved in here, next door to that madman, I just knew he’d cause you nothing but problems.”\\n\\n Her friend’s opinion of Nolan had never been high and Maryanne had to bite back the urge to defend him.\\n\\n “Tell us everything,” Barbara said, drawing up her knees and leaning against the sofa.\\n\\n “There isn’t much to tell.”\\n\\n “He’s the one who got you into this craziness in the first place, remember?” Carol pointed out righteously—as if Maryanne needed reminding. Carol then turned to Barbara and began to explain to the older woman how it had all started. “Nolan wrote a derogatory piece about Maryanne in his column a while back, implying she was a spoiled debutante, and she took it to heart and decided to prove him wrong.”\\n\\n “He didn’t mean it. In fact, he’s regretted every word of that article.” This time Maryanne did feel obliged to defend him. As far as she was concerned, all of that was old business, already resolved. It was the unfinished business, the things happening between them now, that bothered her the most.\\n\\n The denial. The refusal on both their parts to accept the feelings they shared. Only a few days earlier, Maryanne had tried to convince Nolan he wasn’t her type, that nothing about them was compatible. He’d been only too eager to agree.\\n\\n But they’d been drawn together, virtually against their wills, by an attraction so overwhelming, so inevitable, they were powerless against it. Their sensual and emotional awareness of each other seemed more intense every time they met. This feeling couldn’t be anything except love.\\n\\n “You’re among friends, so tell us everything,” Barbara pressed, handing Maryanne the entire box of tissues. “Remember, I’ve known Nolan for years, so nothing you say is going to shock me.”\\n\\n “For one thing, he’s impossible,” Maryanne whispered, finding it difficult to express her thoughts.\\n\\n “He deserves to be hanged from the closest tree,” Carol said scornfully.\\n\\n “And at the same time he’s wonderful,” Maryanne concluded, ignoring Carol’s comment.\\n\\n “You’re not…” Carol paused, her face tightening as if she was having trouble forming the words. “You don’t mean to suggest you’re falling in—” she swallowed “—love with him, are you?”\\n\\n “I don’t know.” Maryanne crumpled the soggy tissue. “But I think I might be.”\\n\\n “Oh, no,” Carol cried, covering her mouth with both hands, “you’ve got to do something quick. A man like Nolan Adams eats little girls like you for breakfast. He’s cynical and sarcastic and—”\\n\\n “Talented and generous,” Maryanne finished for her.\\n\\n “You’re not thinking clearly. It probably has something to do with that fever you had. You’ve got to remember the facts. Nolan insulted you in print, seriously insulted you, and then tried to make up for it. You’re mistaking that small attack of conscience for something more—which could be dangerous.” Awkwardly, Carol rose to her feet and started pacing.\\n\\n “He’s probably one of the most talented writers I’ve ever read,” Maryanne continued, undaunted by her friend’s concerns. “Every time I read his work, I can’t help being awed.”\\n\\n “All right,” Carol said, “I’ll concede he does possess a certain amount of creative talent, but that doesn’t change who or what he is. Nolan Adams is a bad-tempered egotistical self-centred…grouch.”\\n\\n “I hate to say this,” Barbara said softly, shaking her head, “but Carol’s right. Nolan’s been eating at Mom’s Place for as long as I’ve worked there, and that’s three years. I feel I know him better than you do, and he’s everything Carol says. But,” she said thoughtfully, “underneath it all, there’s more to him. Oh, he’d like everyone to believe he’s this macho guy. He plays that role to the hilt, but after you’ve been around him awhile, you can tell it’s all a game to him.”\\n\\n “I told you he’s wonderful!” Maryanne exclaimed.\\n\\n “The man’s a constant,” Carol insisted. “Constantly in a bad mood, constantly making trouble, constantly getting involved in matters that are none of his business. Maryanne here is the perfect example. He should never have written that column about her.” Carol plopped back down and jerked half a dozen tissues from the box in quick succession. She handed them to Maryanne. “You’ve got blinders on where he’s concerned. Take it from me, a woman can’t allow herself to become emotionally involved with a man she plans to change.”\\n\\n “I don’t want to change Nolan.”\\n\\n “You don’t?” Carol echoed, her voice low and disbelieving. “You mean to say you like him as he is?”\\n\\n “You just don’t know him the way I do,” Maryanne said. “Nolan’s truly generous. Did either of you know he’s become sort of a father figure to the teenagers in this neighborhood? He’s their friend in the very best sense. He keeps tabs on them and makes sure no one gets involved in drugs or is lured into gang activities. The kids around here idolize him.”\\n\\n “Nolan Adams does that?” Carol sounded skeptical. She arched her brows as though she couldn’t completely trust Maryanne’s observations.\\n\\n “When Barbara told him I was coming down with a virus, he came over to check on me and—”\\n\\n “As well he should!” Barbara declared. “He was the one who gave you that germ in the first place.”\\n\\n “I’m not entirely sure I caught it from him.” \\n\\n","sourceLink":"https://allnovel.net/glad-tidings/page-45.html","bookId":2631,"book":{"id":2631,"title":"Glad Tidings","description":"Storyline: Glad Tidings (Here Comes Trouble \u0026 There\u0027s Something About Christmas) \\n CHRISTMAS NEWS! READ ALL ABOUT IT! \\n This is a time for families, for togetherness, for memories. On Christmas Eve, Maryanne and Nolan Adams tell their kids the story they most want to hear --- how Mom and Dad met and fell in love. It all started when they were reporters on rival Seattle papers ... and next thing you know, Here Comes Trouble! \\n Christmas is also a time for ... fruitcake. Rookie reporter Emma Collins hates fruitcake; for that matter, she hates Christmas, too. When three Washington State women are finalists in a national fruitcake contest, the story is assigned to her. That\u0027s bad enough. It gets worse when she has to fly in a small plane (scary!) with a smart-aleck pilot named Oliver Hamilton (sexy!) and his scruffy dog (cute!). In the end she meets three wise women, falls in love and learns There\u0027s Something About Christmas.\\n","cover":"https://allnovel.net/images/glad-tidings.jpg","author":"Debbie Macomber","type":"Christian","source":"allnovel","link":"https://allnovel.net/glad-tidings.html","creation":"Oct 5, 2019 8:58:57 AM","modification":"Oct 5, 2019 10:12:08 PM"}}
