{"id":102170,"no":47,"title":"Page 47","content":"Gloria looked surprised by the offer. “You mean you don’t mind? I mean, Katie’s my responsibility and it wouldn’t be fair to palm her off on you. You’re not going to kidnap her or anything, are you? I mean, I know you’re not—you’re Mr. Adams’s friend. I wouldn’t let her go with just anyone, you know. But if anything happened to her, my mother would kill me.” “I promise to take the very best care of her.” Gloria grinned, looking sheepish for having suggested anything else. “You’re sure you don’t mind?” “I don’t mind in the least. I don’t think Katie does, either. Is that right, Katie?” “Why?” “Are you really sure? Okay, then…” Once she’d made a token protest Gloria raced off to join her friends. Katie was content to skip and hop at Maryanne’s side until they reached a huge pile of leaves under a chestnut tree, not far from the basketball court. Almost before Maryanne realized it, Katie raced toward the leaves, bunching as many as she could in her small arms and carrying them back to Maryanne as though presenting her with the rarest of jewels. “Look,” she cried happily. “Leafs.” “Leaves,” Maryanne corrected, bending over and grabbing an armful herself. She tossed them in the air and grinned as Katie leapt up to catch as many as she could and in the process dropped the armload she was holding. Laughing, Maryanne clasped the child by the waist and swung her around, while Katie shrieked with delight. Dizzy, Maryanne leaned against the tree in an effort to regain her equilibrium and her breath. It was then that she saw Nolan had stopped playing and was standing in the middle of the basketball court, staring at her. The game was going on all around him, boys scattering in one direction and then another, racing to one end of the court and back again. Nolan seemed oblivious to them and to the game—to everything but her. A tall boy bumped into him from behind and Nolan stumbled. Maryanne gasped, fearing he might fall, but he caught himself in time. Without a pause, he rejoined the game, racing down the court at breakneck speed. He stole the ball and made a slam dunk, coming down hard on the pavement. Gloria ran back toward Maryanne and Katie. “I thought you said you and Mr. Adams were just friends?” she teased. She was grinning in a way that suggested she wasn’t about to be fooled again. “He nearly got creamed because he couldn’t take his eyes off you.” With Katie on her lap, Maryanne sat beside the teenage girls watching the game. Together she and the three-year-old became Nolan’s personal cheering squad, but whether or not he appreciated their efforts she didn’t know. He didn’t give a single indication that he heard them. When the game was finished, Nolan walked breathlessly off the court. His grey sweatshirt was stained with perspiration, and his face was red and damp from the sheer physical exhaustion of keeping up with kids half his age. For an anxious moment, Maryanne assumed he was planning to ignore her and simply walk away. But after he’d stopped at the water fountain, he came over to the bench where she and Katie were sitting. He slumped down beside her, dishevelled and still breathing hard. “What are you doing here?” he grumbled. “I happened to be in the park,” she answered, feeling self-conscious now and unsure. “You don’t need to worry, Nolan. I didn’t follow you.” “I didn’t think you had.” “You look nice in blue,” he said hoarsely, then cleared his throat as if he hadn’t meant to say that, as if he wanted to withdraw the words. “Thanks.” The blue sweater was one of her favorites. She’d worn her long wool coat and was surprised he’d even noticed the periwinkle-blue sweater beneath. “Hello, Katie.” Katie beamed, stretching out both arms for Nolan to lift her up, which he did. The little girl hugged him quickly, then leapt off the bench and ran to her sister, who stood talking to her boyfriend. “You’re good with children,” Nolan said. His voice fell slightly, as though the fact surprised him. “I do have a knack with them. I always have.” She’d been much-sought as a baby-sitter by her parents’ friends and for a time had considered becoming a teacher. If she’d pursued that field of study she would have preferred to teach kindergarten. She found five-year-olds, with their eagerness to learn about the world, delightful. A couple of articles she’d written the week before were geared toward children’s magazines. If only she’d hear something soon. It seemed to take so long. “How many years of your life did you lose this time?” Maryanne asked teasingly. “Another two or three, at least.” He smiled at her and it was that rare special smile he granted her only in those brief moments when his guard was lowered. His resistance to the attraction he felt to her was at its weakest point, and they both knew it. Maryanne went still, almost afraid to move or speak for fear of ruining the moment. His eyes, so warm and gentle, continued to hold hers. When she tried to breathe, the air seemed to catch in her lungs. “Maryanne.” Her name was little more than a whisper. “Yes?” He raked his hand through his hair, then looked away. “Nothing. Never mind.” “What is it?” she pressed, unwilling to let the matter drop. The muscles along the side of his jaw clenched. “I said it was nothing,” he answered gruffly. Maryanne gazed down at her hands, feeling an overwhelming sense of frustration and despair. The tension between them was so thick she could practically touch it, but nothing she could say or do would make any difference. If anything, her efforts would only make it worse. “Hey, Nolan,” Eddie called out, loping toward them. “What’s with you, man?” He laughed, tossing his basketball from one hand to the other. “You nearly lost that game ’cause you couldn’t take your eyes off your woman.” Nolan scowled at him. “You looking for a rematch?” “Any time you want.” “Not today.” Shaking his head, Nolan slowly pushed the sleeves of his sweatshirt past his elbows. “Right,” Eddie said with a knowing laugh. “I didn’t think so, with your woman here and all.” “Maryanne isn’t my woman,” Nolan informed him curtly, his frown darkening. “Right,” Eddie responded. “Hey, dude, this is me, Eddie. Can’t fool me! You practically went comatose when you saw her. I don’t blame you, though. She ain’t bad. So when are you two getting married?” Chapter Nine “I’ve changed my mind,” Barbara announced at closing time Monday evening. Maryanne was busy refilling the salt and pepper shakers and reloading the napkin holders. “About what?” she asked absently, stuffing napkins into the small chrome canisters. “You and Nolan.” If Barbara hadn’t had Maryanne’s attention earlier, she did now. Nolan had left the restaurant about forty minutes earlier, after having his customary meal of chili and coffee. He’d barely said two words to Maryanne the whole time he was there. He’d buried his face in the evening edition of the Sun and done a brilliant job of pretending he didn’t know her. “What about us?” Maryanne’s expression might have remained aloof, but her heart was pounding furiously. “Since the night of our pity party, I’ve had a change of heart. You’re exactly the right kind of woman for Nolan. The two of you…balance each other. At first I agreed with Carol. My opinion of Nolan isn’t as negative as hers, but you have to remember that those two work for rival papers. At any rate, I was concerned. You are really sweet.” Maryanne winced at the “sweet.” It rather sounded as though friendship with her was like falling into a jar of honey. “And now?” “I don’t know exactly what changed my mind. Partly it was watching Nolan when he was here. I got quite a kick out of him.” “How do you mean?” Barbara’s grin was broad as she continued to wipe the counter. “I swear that man couldn’t keep his eyes off you.” Maryanne was puzzled. “What are you talking about? Nolan didn’t look my way even once.” “Oh, he’d scowl every time you were close, but behind that cross expression of his was an intensity I’ve never seen in him before. It was like he had to come in and get his daily fix of you.” Maryanne’s heart couldn’t decide whether to lift with happiness or sink with doubt. “You’re wrong. Other than ordering his meal, he didn’t speak to me at all. I might as well have been a robot.” “That’s what he’d like you to believe.” “He was reading the paper,” Maryanne said. “The same way he reads it every time he comes here.” “Correction,” Barbara said, and her face broke into a spontaneous smile. “He pretended to be reading the paper, but when you weren’t looking his eyes were following you like a hawk.” “Oh, Barbara, really?” It seemed almost more than she dared hope for. He’d hardly spoken to her in the past few days, and he seemed to be avoiding her. The kids in the park had taken to teasing them about being “in love” and asking pointed questions, and Nolan had practically fallen all over himself denying that they were anything other than friends. “It’s more than just the way he was watching you,” Barbara said, slipping on to a stool. “Have you read his columns the past couple of weeks?” Naturally Maryanne had, more impressed by his work every time she did. The range of his talent and the power of his writing were unmistakable. Within a few years, if not sooner, she expected his newspaper column to be picked up for syndication. “Lately, I’ve noticed something unusual about his writing,” Barbara said, still clutching the dishrag. “That cynical edge of his—it isn’t quite as sharp. His writing’s less sarcastic now. I heard one of my customers comment earlier today that Nolan’s going soft on us. I hadn’t thought about it much until then, but Ernie’s right. I don’t know what’s made the difference, but I figure it must be love. Oh, I doubt there’s much in this life that’s going to change Nolan Adams. He’ll always be stubborn as a mule, headstrong and temperamental. That’s just part of his nature. But mark my words, he’s in love.” “What you said earlier, about us being so different…” “You are, with you so nice and all, and Nolan such a grouch. At least he likes to pretend he’s one. You and I know better, but most folks don’t.” “And?” Maryanne probed. “And, well, it seems to me the two of you fit together perfectly. Like two pieces of a puzzle.” It seemed that way to Maryanne, too. “You heard, didn’t you?” Barbara muttered, abruptly changing the subject. Maryanne nodded. Mom’s Place was going to close in a month for remodelling.","sourceLink":"https://allnovel.net/glad-tidings/page-47.html","bookId":2631,"book":{"id":2631,"title":"Glad Tidings","description":"Storyline: Glad Tidings (Here Comes Trouble \u0026 There\u0027s Something About Christmas) CHRISTMAS NEWS! READ ALL ABOUT IT! This is a time for families, for togetherness, for memories. On Christmas Eve, Maryanne and Nolan Adams tell their kids the story they most want to hear --- how Mom and Dad met and fell in love. It all started when they were reporters on rival Seattle papers ... and next thing you know, Here Comes Trouble! Christmas is also a time for ... fruitcake. Rookie reporter Emma Collins hates fruitcake; for that matter, she hates Christmas, too. When three Washington State women are finalists in a national fruitcake contest, the story is assigned to her. That\u0027s bad enough. It gets worse when she has to fly in a small plane (scary!) with a smart-aleck pilot named Oliver Hamilton (sexy!) and his scruffy dog (cute!). In the end she meets three wise women, falls in love and learns There\u0027s Something About Christmas.","cover":"https://allnovel.net/images/glad-tidings.jpg","author":"Debbie Macomber","type":"Christian","source":"allnovel","link":"https://allnovel.net/glad-tidings.html","creation":"Oct 5, 2019 8:58:57 AM","modification":"Oct 5, 2019 10:12:08 PM"}}
