{"id":102172,"no":49,"title":"Page 49","content":"“I demand to know why you quit the paper!” Maryanne refused to be intimidated. “I already explained that. I had another job.” “Obviously you’re doing something you’re too ashamed to tell your parents.” “I’m not ashamed! It’s nothing illegal. Besides, I happen to like what I do, and I’ve managed to live entirely on what I make, which is no small feat. I’m happy, Dad, really happy.” She tried to force some cheerful enthusiasm into her voice, but unfortunately she didn’t entirely succeed. How she wished she could brag about selling her articles. Surely she’d receive word soon! “If you’re so pleased about this change in jobs, then why do you seem upset?” her mother asked reasonably, joining the conversation from an extension. “I—I’m fine, really I am.” “Somehow, sweetie, that just doesn’t ring true—” “I don’t like the sound of this,” her father interrupted impatiently. “I made a mistake in arranging this Seattle assignment for you. It seems to me it’d be best if you quit whatever you’re doing and moved back to—” “Dad, I refuse to quit now.” “I want you to move back home. As far as I can see, you’ve got one hell of a lot of explaining to do.” “It seems to me,” Maryanne said after a moment of strained silence, “that we should both take time to cool down and think this over before one of us says or does something we’re all going to regret.” “I’m calm.” The voice that roared over the long-distance wires threatened to impair Maryanne’s hearing. “Daddy, I love you and Mom dearly, but I think it would be best if we both slept on this. I’m going to hang up now, not to be rude, but because I don’t think this conversation is accomplishing anything. I’ll call you first thing in the morning.” “Maryanne…Maryanne, don’t you dare—” She didn’t allow him to finish, knowing it would do no good to argue with him when he was in this frame of mind. Her heart was heavy with regret as she replaced the receiver. Knowing her father would immediately call again, she unplugged the phone. Now that her family had discovered she wasn’t working at the Review, everything would change. And not for the better. Her father would hound her until she was forced to tell him she’d taken a job as a waitress. Once he discovered that, he’d hit the roof. Still thinking about what had happened, she put on her flannel pyjamas and pulled out her bed. With the demanding physical schedule she kept, sleeping had never been a problem. Tonight, she missed the clatter of Nolan’s typing. She’d grown accustomed to its comforting familiarity, in part because it was a sign of his presence. She often lay awake wondering how his mystery novel was developing. Some nights she even fantasized that he’d let her read the manuscript, which to her represented the ultimate gesture of trust. But Nolan wasn’t at his typewriter this evening. He was giving a speech. Closing her eyes, she imagined him standing before the large dinner crowd. How she would have enjoyed being in the audience! She knew beyond a doubt that his eyes would have sought her out…. Instead she was spending the night alone. She lay with her eyes wide open; every time she started to drift off, some small noise would jerk her into wakefulness. She finally had to admit that she was waiting to hear the sounds of Nolan’s return. Some time in the early morning hours, Maryanne did eventually fall asleep. She woke at six to the familiar sound of Nolan pounding on his typewriter. She threw on her robe, thrust her feet into the fuzzy slippers and began pacing, her mind whirling. When she could stand it no longer, she banged on the wall separating their two apartments. “Your typing woke me up!” Which, of course, wasn’t fair or even particularly true. But she’d spent a fretful night thinking about him, and that was excuse enough. Her family had found out she’d quit her job and all hell was about to break loose. Time was running out for her and Nolan. If she was going to do something—and it was clear she’d have to be the one—she’d need to do it soon. “Just go back to bed,” Nolan shouted. “Not on your life, Nolan Adams!” Without questioning how wise it was to confront him now, Maryanne stormed out of her apartment dressed as she was, and beat hard on his door. Nolan opened it almost immediately, still wearing the tuxedo from the night before, without the jacket and cummerbund. The sleeves of his shirt were rolled past his elbows and the top three buttons were open. His dishevelment and the shadows under his eyes suggested he hadn’t been to bed. “What now?” he demanded. “Is my breathing too loud?” “We need to talk,” she stated calmly as she marched into his apartment. Nolan remained standing at the door. “Why don’t you come in and make yourself at home?” he muttered sarcastically. “I already have.” She sat on the edge of his sofa and waited until he turned to face her. “So?” she asked with cheerful derision. “How’d your hot date go?” “Fine.” He smiled grimly. “Just fine.” “Where’d you go for dinner? The Four Seasons? Fullers?” She named two of the best restaurants in town. “By the way, do I know Prudence?” “No,” he answered with sharp impatience. “I didn’t think so.” “Maryanne—” “I don’t suppose you have coffee made?” “It’s made.” But he didn’t offer her any. The fact that he was still standing by the door suggested he wanted her out of his home. But when it came to dealing with Nolan, Maryanne had long since learned to ignore the obvious. “Thanks, I’ll get myself a cup.” She walked into the kitchen and found two clean mugs in the dishwasher. “You want one?” “I have some,” he said pointedly, stationing himself in the kitchen doorway. He heaved a long-suffering sigh. “Maryanne, I’m busy, so if you could get on with—” “My father knows,” she said calmly, watching him closely for some sort of reaction. If she’d been looking for evidence of concern or regret, he showed neither. The only emotion she was able to discern was a brief flicker of what she could only assume was relief. That wasn’t encouraging. He appeared all too willing to get her out of his life. “Well?” she probed. “Say something.” “What the hell have you been telling him?” “Nothing about you, so don’t worry. I did mention you to my mother, but you don’t need to worry about that, either. She thinks you and I…Never mind.” “What does your father know?” Nolan asked. She sipped from the edge of the mug and shrugged. “He found out I wasn’t on special assignment for the paper.” “Special assignment? What does that have to do with anything?” “That’s what I told my mother when I moved.” “Why the hell would you tell her something like that?” “She was expecting me to send her my columns, and call every other day. I couldn’t continue to do either of those things. I had to come up with some excuse.” He cocked an eyebrow. “You might have tried the truth.” Maryanne nodded her agreement. If she’d bungled any part of this arrangement, it had been with her parents. However, there wasn’t time for regrets now. “Dad learned I moved out of The Seattle. I didn’t tell him where I was living, but that won’t deter him. Knowing Dad, he’ll have all the facts by noon today. To put it mildly, he isn’t pleased. He wants me to return to the East Coast.” “Are you going?” Nolan’s question was casual, as though her response was of little concern to him. “No.” “Why not?” The impatient look was back. “For the love of heaven, Annie, will you kindly listen to reason? You don’t belong here. You’ve proved your point. If you’re waiting for me to admit I was wrong about you, then fine, I’ll admit it, and gladly. You’ve managed far better than I ever dreamed you would, but it’s time to get on with your life. It’s time to move back into the world where you belong.” “I can’t do that now.” “Why the hell not?” “Because…I’ve fallen—” “Look, Annie, it’s barely seven and I have to go to work,” he said brusquely, cutting her off. “Shouldn’t you be getting dressed? Walking around the hallway in your pyjamas isn’t wise—people might think something.” “Let them.” He rubbed his face wearily, shaking his head. “Nolan,” Maryanne said softly, her heart in her throat. “I know you didn’t go out with anyone named Prudence. You made the whole thing up. This game of yours isn’t going to work. It’s too late. I’m…already in love with you.” The whole world seemed to come to an abrupt halt. Maryanne hadn’t intended to blurt out her feelings this way, but she didn’t know how else to cut through the arguments and the denial. For one wild-eyed moment Nolan didn’t say anything. Then he raised his hand, as though fending off some kind of attack, and retreated from the kitchen. “You can’t be in love with me,” he insisted, slowly sinking to the sofa, like a man in the final stages of exhaustion. “I won’t allow it.” Chapter Ten “Unfortunately it’s too late,” Maryanne told him again, no less calmly. “I’m already in love with you.” “Now just a minute,” Nolan said, apparently regaining his composure. “You’re a nice kid, and to be honest I’ve been impressed—” “I am not a kid,” she corrected with quiet authority, “and you know it.” “Annie…Maryanne,” he said, “listen to me. What you feel for me isn’t love.” His face revealed a bitterness she hadn’t seen before. He walked toward her, gripped her shoulders and gazed down at her. “That won’t work, either,” she said in the same quiet voice. She wasn’t a poor little rich girl who’d only recently discovered who she was. Nor had she mistaken admiration for love. “I know what I feel.” She slipped her arms around his neck and stood on tiptoe, wanting to convince him of her sincerity with a kiss. But before her mouth could meet his, Nolan jerked his head back, preventing the contact. He dropped his arms and none too gently pushed her away. “Are you afraid to kiss me?” “You’re damn right I am,” he said, burying his hands in his pockets as he hastily moved even farther away. Maryanne smiled softly. “And with good reason. We both know what would happen if you did. You’ve done a good job of hiding your feelings, I’ll grant you that much. I was nearly fooled.” “Naturally I’m flattered.” His expression was darkening by the second. He stalked across the room, his shoulders hunched forward. He didn’t say anything else, and Maryanne strongly suspected he was at a loss for words. Nolan was never at a loss for words. Words were his stock-in-trade.","sourceLink":"https://allnovel.net/glad-tidings/page-49.html","bookId":2631,"book":{"id":2631,"title":"Glad Tidings","description":"Storyline: Glad Tidings (Here Comes Trouble \u0026 There\u0027s Something About Christmas) CHRISTMAS NEWS! READ ALL ABOUT IT! This is a time for families, for togetherness, for memories. On Christmas Eve, Maryanne and Nolan Adams tell their kids the story they most want to hear --- how Mom and Dad met and fell in love. It all started when they were reporters on rival Seattle papers ... and next thing you know, Here Comes Trouble! Christmas is also a time for ... fruitcake. Rookie reporter Emma Collins hates fruitcake; for that matter, she hates Christmas, too. When three Washington State women are finalists in a national fruitcake contest, the story is assigned to her. That\u0027s bad enough. It gets worse when she has to fly in a small plane (scary!) with a smart-aleck pilot named Oliver Hamilton (sexy!) and his scruffy dog (cute!). In the end she meets three wise women, falls in love and learns There\u0027s Something About Christmas.","cover":"https://allnovel.net/images/glad-tidings.jpg","author":"Debbie Macomber","type":"Christian","source":"allnovel","link":"https://allnovel.net/glad-tidings.html","creation":"Oct 5, 2019 8:58:57 AM","modification":"Oct 5, 2019 10:12:08 PM"}}
