{"id":17762,"no":20,"title":"Chapter 21","content":"When he stopped speaking, it was because a woman pressed her way through the crowd, and caught one of his hands. “Master, my baby!” she sobbed. “The little one that was hurt!” So Carpenter said to the crowd, “The sick child needs me. I must go in.” They started to press after him, and he added, “You must not come into the room. The child will need air.” He went inside, and knelt once more by the couch, and put his hand on the little one\u0027s forehead. The mother, a frail, dark Mexican woman, crouched at the foot, not daring to touch either the man or the child, but staring from one to the other, pressing her hands together in an agony of dread. The little one opened his eyes, and gazed up. Evidently he liked what he saw, for he kept on gazing, and a smile spread over his features, a wistful and tender and infinitely sad little smile, of a child who perhaps never had a good meal in his lifetime. “Nice man!” he whispered; and the woman, hearing his voice again, began sobbing wildly, and caught Carpenter\u0027s free hand and covered it with her tears. “It is all right,” said he; “all right, all right! He will get well—do not be afraid.” He smiled back at the child, saying: “It is better now; you will not have so much pain.” To me he remarked, “What is there so lovely as a child?” The people thronging the doorway spread word what was going on, and there were shouts of excitement, and presently the voice of a woman, clamoring for admission. The throng made way, and she brought a bundle in her arms, which being unfolded proved to contain a sick baby. I never knew what was the matter with it; I don\u0027t suppose the mother knew, nor did Carpenter seem to care. The woman knelt at his feet, praying to him; but he bade her stand up, and took the child from her, and looked into its face, and then closed his eyes in prayer. When he handed back the burden, a few minutes later, she gazed at it. Something had happened, or at least she thought it had happened, for she gave a cry of joy, and fell at Carpenter\u0027s feet again, and caught the hem of his garment with one hand and began to kiss it. The rumor spread outside, and there were more people clamoring. Before long, filtering into the room, came the lame, and the halt, and the blind. I had been reading not long ago of the miracles of Lourdes, so I knew in a general way what to expect. I know that modern science vindicates these things, demonstrating that any powerful stimulus given to the unconscious can awaken new vital impulses, and heal not merely the hysterical and neurotic, but sometimes actual physical ailments. Of course, to these ignorant Mexicans and Italians, there was no possible excitement so great as that caused by Carpenter\u0027s appearance and behavior. I understood the thing clearly; and yet, somehow, I could not watch it without being startled—thrilled in a strange, uncomfortable way. And later on I had company in these unaccustomed emotions; the crowd gave way, and who should come into the room but Mary Magna! She did not speak to either of us, but slipped to one side and stood in silence—while the crowd watched her furtively out of the corner of its eyes, thinking her some foreign princess, with her bold, dark beauty and her costly attire. I went over to her, whispering, “How did you get here?” She explained that, when we did not arrive at the studios, she had called up the Stebbins home and learned about the accident. “They warned me not to come here, because this man was a terrible Bolshevik; he made a blood-thirsty speech to the mob. What did he say?” I started to tell; but I was interrupted by a piercing shriek. A sick and emaciated young girl with paralyzed limbs had been carried into the room. They had laid her on the couch, from which the child had been taken away, and Carpenter had put his hands upon her. At once the girl had risen up—and here she stood, her hands flung into the air, literally screaming her triumphant joy. Of course the crowd took it up—these primitive people are always glad of a chance to make a big noise, so the whole room was in a clamor, and Carpenter had hard work to extract himself from the throng which wished to touch his hands and his clothing, and to worship him on their knees. He came over to us, and smiled. “Is not this better than acting, Mary? “Yes, surely—if one can do it.” Said he: “Everyone could do it, if they knew.” “Is that really true?” she asked, with passionate earnestness. “There is a god in every man, and in every woman.” “Why don\u0027t they know it, then?” “There is a god, and also a beast. The beast is old, and familiar, and powerful; the god is new, and strange, and afraid. Because of his fear, the beast kills him.” “What is the beast?” “His name is self; and he has many forms. In men he is greed; in women he is vanity, and goes attired in much raiment—the chains, and the bracelets, and the mufflers—” “Oh, don\u0027t!” cried Mary, wildly. “Very well, Mary; I won\u0027t.” And he didn\u0027t. But, looking at Mary, it seemed that she was just as unhappy as if he had. He turned to an old man who had hobbled into the room on crutches. “Poor old comrade! Poor old friend!” His voice seemed to break with pity. “They have worked you like an old mule, until your skin is cracked and your joints grown hard; but they have not been so kind to you as to an old mule—they have left you to suffer!” To a pale young woman who staggered towards him, coughing, he cried: “What can I do for you? They are starving you to death! You need food—and I have no food to give!” He raised his arms, in sudden wrath. “Bring forth the masters of this city, who starve the poor, while they themselves riot in wantonness!” But the members of the Chamber of Commerce and of the Bankers\u0027 Association of Western City were not within hearing, nor are their numbers as a rule to be found in the telephone book. Carpenter looked about the place, now lined pretty well with cripples and invalids. Only a couple of hours of spreading rumor had been needed to bring them forth, unholy and dreadful secrets, dragged from the dark corners and back alley-ways of these tenements. He gazed from one crooked and distorted face to another, and put his hand to his forehead with a gesture of despair. “No, no!” he said. “It is of no use!” He lifted his voice, calling once more to the masters of the city. “You make them faster than I can heal them! You make them by machinery—and he who would help them must break the machine!” He turned to me; and I was startled, for it was as if he had been inside my mind. “I know, it will not be easy! But remember, I broke the empire of Rome!” That was his last flare. “I can do no more,” he whispered. “My power is gone from me; I must rest.” And his voice gave way. “I beg you to go, unhappy poor of the world! I have done all that I can do for you tonight.” And silently, patiently, as creatures accustomed to the voice of doom, the sick and the crippled began to hobble and crawl from the room.","sourceLink":"http://novel.tingroom.com/duanpian/3227/88125.html","bookId":699,"book":{"id":699,"title":"They Call Me Carpenter","description":"简介： The beginning of this strange adventure was my going to see a motion picture which had been made in Germany. It was three years after the end of the war, and you\u0027d have thought that the people of Western City would have got over their war-phobias. Bu...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3227","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
