{"id":17800,"no":58,"title":"Chapter 57","content":"The grand-opera voice raised again its silver chant: “Give way, all mobs! Yield! Retire! Abdicate!—Bow down-n-n-n-n! Make way for the Mob of Mobs, the irresistible, imperial, superior super-mob! Hearken to the Lord High Chief Commanding Dragon of the Esoteric Cohorts, the Exalted Immortal Grand Imperial Kleagle of the Ku Klux Klan!” Then the Grand Imperial Kleagle turned and addressed the white-robed throng in a voice of sharp command: “Klansmen! Remember your oath! The hour of Judgment is here! The guilty wretch cowers! The grand insuperable sentence has been spoken! Coelum animum imperiabilis senescat! Similia similibus per quantum imperator. Inexorabilis ingenium parasimilibua esperantur! Saeva itnparatus ignotum indignatio! Salvo! Suppositio! Indurato! Klansmen, kneel!” As one man, the host fell upon its knees. “Klansmen, swear! Si fractus illibatur orbis, impavidum ferient ruinae! You have heard the sentence. What is the penalty? Is it death?” And a voice in the crowd cried “Death!” And the others took it up; there was a roar: “Death! Death!” Said the Grand Imperial Kleagle: “Arma virumque cano, tou poluphlesboiou thalasses!” Then, facing the staring ex-servicemen: “Tetlathi mater erne kai anaskeo ko-omeneper!” Finally the Grand Imperial Kleagle pointed her shrouded white arm at Carpenter, who stood, as pale as death, but unflinchingly. “Death to all traitors!” she cried. “Death to all agitators! Death to all enemies of the Ku Klux Klan! Condemnatus! Incomparabilis! Ingenientis exequatur! Let the Loyal High Inexorable Guardians and the Grand Holy Seneschals of the Klan advance!” Six shrouded figures stepped out from the crowd. Said the Grand Imperial Kleagle: “Possess yourselves of the body of this guilty wretch!” And to the ex-servicemen: “Yield up this varlet to the High Secret Court-martial of the Klan, which alone has power to punish such as he.” What the bewildered members of the Brigade made of all this hocus-pocus I had no idea. Afterwards, when the adventure was over, I asked Mary, “Where in the world did you get that stuff?” And she told me how she had once acted in a children\u0027s comedy, in which there was an old magician who spent his time putting spells on people. She had had to witness his incantations eight or ten times a week for nearly a year, so of course the phrases had got fixed in her memory, and they had served just as well to impress these grown-up children. Or perhaps the ex-servicemen thought this might be a further plan of those who had employed them. Whatever they thought, it was obvious that they were hopelessly outnumbered. There could be nothing for a mob to do but yield to a Super-mob; and they yielded. Those who were in front of Carpenter stepped back, and the Loyal High Inexorable Guardians and the Grand Holy Seneschals took Carpenter by the arms and led him away. Apparently they were going to overlook the rest of us; but Old Joe and Lynch and myself took Abell and Moneta by the shoulders and shoved them along, past the ex-service men and into the midst of the “Klansmen.” There was no need to consider dignity after that. We hustled Carpenter to the nearest of the busses, and put him in; the Grand Imperial Kleagle followed, and the rest of us clambered in after her. Sitting up beside the driver, watching the scene, was T-S, beaming with delight; he got me by the hand and wrung it. I could not speak, my teeth were literally chattering with excitement. Carpenter, sitting in the seat behind us, must have realized by now the meaning of this scandalous adventure; but he said not a word, and the white-gowned Klansmen piled in behind him, and the siren shrieked out into the night, and the bus backed to the corner, and turned and sped off; and all the way to Eternal City, T-S and I and Old Joe slapped one another on the back and roared with laughter, and the rest of the Klansmen roared with laughter—all save the Grand Imperial Kleagle, who sat by Carpenter\u0027s side, and was discovered to be weeping.","sourceLink":"http://novel.tingroom.com/duanpian/3227/88163.html","bookId":699,"book":{"id":699,"title":"They Call Me Carpenter","description":"简介： The beginning of this strange adventure was my going to see a motion picture which had been made in Germany. It was three years after the end of the war, and you\u0027d have thought that the people of Western City would have got over their war-phobias. Bu...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3227","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
