{"id":43218,"no":24,"title":"CHAPTER XXIV.","content":"The beautiful girl lying so ill under Miss Fernly\u0027s care grew steadily worse. Her constant cry for the little one was most pitiful to hear. \n \n \"How are we to let her know that it is slowly fading away?\" said the woman to the doctor. \n \n \"We will not let her know until the last moment; it would do her no good, and be only a setback for her,\" he responded. \n \n Miss Fernly pitied the young mother from the very depths of her heart. It made this spinster more than ever enraged at men. She had tried to gain the girl\u0027s confidence. But it had all been in vain. Ida would lie for hours, looking out of the window at the fleecy clouds, muttering piteously: \n \n \"It must have taken place by this time! Oh! I am too late, too late!\" \n \n At last Miss Fernly\u0027s curiosity got the better of her. \n \n \"Will you tell me what you mean by those words, my dear?\" she asked, one day. \"Perhaps I can help you in some way.\" \n \n [104] \n \n \"No,\" returned Ida May, wearily. \"It would be useless, useless.\" \n \n Miss Fernly took the little white hand in her own and pressed it gently. \n \n \"Do not say that, my dear, and in that tone; it is not right. Heaven is always kind enough to send a friend to those who are in need of help.\" \n \n \"You are right,\" said the girl, quickly. \"In my life I have been used to cruelty and unkindness. I—I—\" \n \n She stopped for a moment, and something like a flush crossed her pale cheeks; then she burst into tears. \n \n \"I will tell you my story, my good lady,\" she sobbed; \"for the weight of it is eating my soul away.\" \n \n With her throbbing little hands still held tightly in Miss Fernly\u0027s, she sobbed wretchedly: \n \n \"Surely it is the cruelest story that ever a young girl had to tell. I might have led a happy life if I had not been foolish enough to want to be a fine lady. I had often read of such things happening, and oh! I believed it. Cinderella was changed from a kitchen-maid to a fairy princess, and oh! how happy she was, if but for a brief hour. \n \n \"It seemed to me that an opportunity always came for those who watched for it. One came to me. A wealthy family took me with them to Newport for the summer, and there I met a young man fair of face, handsome as a dream. I had never before seen any one like him. You will not wonder that my heart went out to him. I had known him but a few short weeks ere he asked me to marry him, counseling a secret marriage, and I—I consented. It was not a regular minister who married us, but a—a—mayor, or somebody like that. \n \n \"My husband brought me to the city. We had barely reached here, after an all-night\u0027s journey, when I learned to my horror that he believed me to be the heiress of the wealthy people with whom I had been stopping. When I told him I was not, what a change there came over him! With a face as white as it would ever be in death, he drew back and looked at me. \n \n [105] \n \n \"\u0027Not an heiress?\u0027 he cried. \u0027Great heavens! what an eternal fool I have made of myself!\u0027 \n \n \"He left my presence quickly, telling me that it was all a mistake—that the man who had married us had not the power to do so; that it was just as well, perhaps, for he never could wed a poor girl. \n \n \"He advised me to go home and forget him, adding insult to injury by concluding with the cruel words; \u0027Such a little incident in the life of a working-girl will not amount to anything.\u0027\" \n \n \"The scoundrel of a man!\" cried Miss Fernly, in intense indignation. \"I wonder that a righteous God lets such men live!\" \n \n She found herself intensely interested in the story of this beautiful young girl, whose innocent face she could not help but trust from the first moment that she beheld it. \n \n At first it had occurred to Miss Fernly to ask the name of the rascal, her husband; then she told herself that in all probability it was a false one, and that he could not be traced by it. \n \n \"I will think the matter over,\" said Miss Fernly, \"and conclude what action you should take. For your child\u0027s sake, you can not allow this man to go free. You would be committing a crime against society at large.\" \n \n Just at that moment the doctor entered the room. He motioned Miss Fernly to one side. By some strange intuition, Ida May guessed the import of his visit. \n \n \"My—my little one!\" she cried, inquiringly—\"tell me of her! How is she?\" \n \n For a moment the doctor was silent. \n \n \"I may as well tell the truth now as tell it at some future time,\" he thought, pityingly. \n \n \"Tell me what news do you bring of my little child?\" cried Ida. \n \n He crossed over to where the hapless young girl sat, and bent over her pityingly. \n \n \"The little one is dead!\" he said in a low, hushed voice. \n \n It was dying when he left the foundling asylum. As[106] he gazed upon it, he said to himself that it would be but a question of a few short hours. He turned away from it, leaving it in the care of the good nurses, that he might go and gently break the sad news to the young mother. \n \n While Miss Fernly and the hapless young mother were discussing the flowers they would plant over baby\u0027s grave, the nurses, with bated breath, were standing around the little cot. Another physician sat by the cot, holding the waxen wrist. \n \n \"Quick! hand me the cordial!\" he cried. \"I may be able to save this little life!\" \n \n A small vial was hurriedly handed to him. He poured a few drops between the white lips, and sat down again, patiently awaiting the result. \n \n \"If the infant lives five minutes, it will be able to pull through,\" he observed, quietly. \n \n They watched the great clock on the opposite wall, whose pendulum swung noiselessly to and fro. One minute, two; there was no change. A third; the doctor bent his ear to listen for the feeble breathing, holding a mirror close to the child\u0027s lips. There was moisture upon it as he drew it away. Another moment, the crucial moment, was reached. \n \n \"See! it is dying!\" whispered one of the nurses, touching the doctor\u0027s arm. \n \n A half minute more, and then another half minute passed by. \n \n \"The baby will live!\" exclaimed the doctor, rising to his feet. \"Yes, the baby will live,\" repeated the doctor. \"It has had a hard time of it, I see, but it has conquered death. \n \n \"It is so strange,\" he mused, \"whom nobody wants or seems to care for clings to life most tenaciously, as though it were worth having. \n \n \"A few hours since I was at the home of one of the wealthiest families in the city. That young mother\u0027s babe died, though I did everything in human power to save it. The father caught me by the arm when I was first called there, and said: \n \n [107] \n \n \"\u0027Doctor, save that little child upstairs, and it will be the making of your fortune. You shall name your own price. Stay right here, by night and by day, until it is out of danger, and anything you may ask for shall be yours.\u0027 \n \n \"He led me through the marble hall and past gilded drawing-rooms and spacious parlors to the chamber above where mother and child lay. It was a plump little mite, with everything to live for. I thought my task would be an easy one; but you have heard the old saying: \u0027Man proposes, but God disposes.\u0027 \n \n \"Well it was so in this case. It had only the measles—a disease which every little one has at some time during infancy. No wonder I felt no alarm. \n \n \"Although I did my best, it began to fail. I summoned all the experts in the city, bringing together men who were older and wiser than myself, to discover what could possibly be the reason why my skill had failed me in this instance. \n \n \"There was nothing which science could suggest that we did not do. But it seemed that fate was against us. The child literally faded before our very eyes, and passed away. \n \n \"This one had no such chance of life as the other had, yet it has passed through an illness so dangerous that not one in a thousand ever live through. I predict that it will have an uncommon future,\" he added, thoughtfully. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1691/49796.html","bookId":1156,"book":{"id":1156,"title":"A Dangerous Flirtation","description":"简介： Three young girls, as fair as youth and beauty could make them, stood with arms twined about one another on the sands of Newport one hot August afternoon.Neither of the trio could have been over seventeen. All three were dressed in white, and looked...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1691","creation":"Aug 1, 2019 12:24:28 AM","modification":"Aug 1, 2019 12:24:28 AM"}}
