{"id":43229,"no":35,"title":"CHAPTER XXXV.","content":"Alone in her room, Vivian Deane stood before her mirror and critically viewed the face reflected in it. \"I am more beautiful than Eugene Mallard\u0027s wife,\" she cried, nodding approvingly to the dimpled, smiling face, \"and I will make that beauty tell. He does not look happy,\" she mused. \"I, who know him so well, can see it. He has married her, but he is dissatisfied. There is something amiss between them. Ere I have been in this house a week, I will discover what it is.\" She nodded to the reflection in the mirror. \"I had hoped that, seeing him married, I could steel my heart against him, but I find I can not.\" \"There is something connected with the manner in which Eugene Mallard first met his wife that I must find out,\" was Vivian\u0027s mental comment. It was not long before Vivian discovered that her beautiful young hostess knew almost nothing of music. \"I think I have discovered her secret,\" she said to herself. \"She must have been a poor girl, perhaps a working-girl.\" Instead of seeing the wisdom of God in such an alliance, whereby the wealthy might share with the poor the gifts God had showered upon them, she was angrier than ever. From the hour in which she had asked Ida the question concerning her meeting with Eugene Mallard, the young wife avoided being alone with her guest. Vivian could not help but notice it, and she smiled to herself. She seemed to have no wish to capture handsome Captain Drury or Arthur Hollis. She preferred to talk to her hostess on each and every occasion. \"Yon have not told me,\" she said one day, \"whether you lived in New York, San Francisco or Boston.\" \"Most of my life was spent in a little village outside of the great metropolis,\" said Ida, inwardly hoping the[151] inquisitive girl would not think of asking the name of the village. Vivian did think of it, but concluded that it would be wisest not to pursue her inquiries too ardently. \"All this ought to have been mine,\" muttered Vivian, clinching her hands tightly—\"all mine! I loved him first, and I loved him best. She had no right to take him from me!\" These thoughts often ran through Vivian\u0027s mind while Ida was talking to her, believing she was entertaining the best and truest friend she had in the great cruel world. If the young wife had known her as she really was, she would have turned in utter loathing from the beautiful pink-and-white face; she would have prayed Heaven to save her from this, her greatest foe. As it was, she saw only Vivian Deane\u0027s beauty and grace. She heard only kindness in her voice, and she thought to herself that she was very fortunate indeed in securing such a friend. She talked and laughed so happily that the poor young wife almost forgot her sorrow while listening to her. Vivian wondered if by any chance the young bride had found out how desperately she had been in love with her husband in other days. The young wife became more and more unhappy day by day. Once, in following the windings of a brook, Ida was startled at finding herself several miles from home. Glancing up with a start, she found that the sun had almost reached its height. She had been gone longer than she had intended. Perhaps there was some way by which she could take a shorter cut to the house. She saw a woman slowly advancing along the path, carrying a little baby in her arms. She stopped short as the woman approached. She recognized her as the wife of one of the village merchants. Ida had often seen her driving on the road with her husband, holding the little child in her lap, and she[152] had said to herself, as she turned away to hide the tears that would spring to her eyes: \"That woman has everything in the world to make her life happy. I would exchange places with her gladly if I could.\" The woman smiled as she saw Eugene Mallard\u0027s young wife, and appeared annoyed upon observing that she was about to stop and speak to her. She answered her question readily enough, and pointed out the way, a short cut over the meadows, that would bring her near her home. Still Ida lingered, looking wistfully at the young mother. \"I have often seen you, from my window, rambling by the brook-side. You must be very fond of out-door life,\" said Ida. \"I do love the sunshine,\" replied the young woman; \"but I do not come out for it only for myself, but for baby\u0027s sake also.\" A great, sudden thrill that made her soul grow faint and dizzy filled Ida\u0027s whole being as her gaze rested on the babe she carried. She thought of that other one, in a nameless grave, sleeping under the daisies. It would have been just about the age of this little one had it lived. \"How happy you must be!\" sighed Ida. \"We are not always what we seem,\" replied the woman, with a sigh. \"I love this little thing very dearly, but it is not my own child. I had a little one whom I loved better than my life,\" went on the woman, sadly. \"When it died, I refused to be comforted. I took on so that my husband grew frightened. \"\u0027Don\u0027t fret, Margaret,\u0027 he said; \u0027I will find a way to comfort you.\u0027 \"He sent to some foundling asylum in the great city, and this little one was brought to me to fill the aching void in my heart. I love it very dearly, but oh! it can never take the place of the one I lost.\" Eugene Mallard\u0027s wife was looking at it with her soul in her eyes. \"Poor little waif!\" she sighed; \"it was very fortunate in securing a home with you.\" [153] \"Thank you, Mrs. Mallard,\" said the woman. \"We are poor and plain people, but we will do what we can for the poor little thing.\" She was about to pass on, thinking she had taken up too much of the lady\u0027s time with her story. Suddenly Ida turned, her beautiful dark eyes heavy with tears. \"Would you mind letting me hold the baby for just one minute?\" she asked, wistfully. \"No, certainly not,\" replied the woman, with a pleasant smile. Again that thrill which she could hardly define shot through her as she received the babe from the woman\u0027s arms. She bent her face over the little rose-leaf one that lay upon her breast. Her lips moved, but no sound came from them. It seemed to rend her very heart-strings to relinquish her hold of the infant—to hand it back to the woman who waited to receive it. The moments seemed to fly by on golden wings. It seemed to Ida that she could stand there for long hours looking down into that lovely little face and those two great starry eyes that looked up wonderingly into her own. It cost her a great pang to hand the child back to the woman. But time was fleeting. She could not remain there longer, for the distant bells of the village were already ringing, proclaiming the noonday hour, and she must go home, or luncheon would be kept waiting. \"You come here often?\" she asked, turning again to the woman. \"Almost every day,\" was the reply. The hapless young wife made up her mind that she would see them often. Acting upon a sudden impulse, she took out her purse and handed the woman a golden coin. \"Take that for the little one,\" she said. \"What is its name?\" \"We haven\u0027t decided upon its name yet,\" returned the woman; \"we have only had the child a few weeks.\" [154] \"Would you think over it if I suggested a name?\" asked Ida, wistfully. \"Yes, indeed,\" replied the woman. \"You may be sure I would.\" \"Why not call her \u0027Ida May\u0027?\" murmured the young wife, with her whole heart and soul in her eyes. \"That is a beautiful name,\" cried the woman—\"Ida May Lester. That is what it shall be!\" Somehow the naming of the poor waif gave to the hapless young wife a great relief.","sourceLink":"http://novel.tingroom.com/jingdian/1691/49807.html","bookId":1156,"book":{"id":1156,"title":"A Dangerous Flirtation","description":"简介： Three young girls, as fair as youth and beauty could make them, stood with arms twined about one another on the sands of Newport one hot August afternoon.Neither of the trio could have been over seventeen. All three were dressed in white, and looked...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1691","creation":"Aug 1, 2019 12:24:28 AM","modification":"Aug 1, 2019 12:24:28 AM"}}
