{"id":43199,"no":5,"title":"CHAPTER V.","content":"\"I see a light glimmering in a window a short distance away. I will take you there, and walk back to the village to get some kind of a conveyance.\" In a few moments they found themselves knocking for admission at the little cottage from whence they had observed the light. His impatient knock brought a white, terrified face to a window which was opened above. [21] \"What do you want?\" asked a voice in unmistakable tones of fear. \"I must have shelter for this young lady for a little while,\" exclaimed Ainsley, impatiently; adding: \"I will pay you handsomely if you will allow her to remain here an hour or two, until I can go for a carriage for her.\" The window was closed quickly down again, and Royal heard some one say quite distinctly: \"I tell you it is only a ruse. It is an officer of the law.\" Again Royal knocked impatiently. \"It is commencing to rain,\" he called. \"For Heaven\u0027s sake, open the door quickly!\" Despite the sobs and protestations of the voice inside, a man opened the door and stepped out, confronting them. One hand held a lighted lamp and the other rested upon his hip pocket. To Royal Ainsley\u0027s intense astonishment, he found that he was at the summer cottage of Newport\u0027s haughty mayor. \"I beg your pardon,\" stammered the man, in dire confusion. \"It is rather late to awaken any one; but you have heard the words, \u0027any port in a storm\u0027? The truth is, I want to find shelter for this young lady until I can go for a conveyance to take her to a minister who is awaiting us to perform the marriage ceremony.\" \"Oh, that is it!\" exclaimed the mayor, with a look of relief coming over his face. \"An elopement, eh?\" \"All is fair in love, you know,\" laughed the young man, leading Ida into the parlor, his host preceding them. \"Who are you, and who is the young lady?\" inquired the man. [22] It was Royal\u0027s turn to hesitate now. If he found out that the young girl clinging to his arm was the heiress of the Mays, would he not refuse to perform the ceremony until they could be communicated with? \"I am Royal Ainsley,\" answered the young man, affecting not to hear the last part of the question; and Ida, thinking she was called upon to speak, responded, promptly: \"And I am Ida May, sir.\" The mayor wheeled about quickly. \"What! Did I hear you say the name May? Are you the young girl stopping at the Ocean House whom they call the niece of the Mays?\" The girl was trembling so she could not answer. \"We might as well put a bold front on the matter,\" whispered Royal, clasping quickly the ice-cold hands. \"She is, sir,\" he answered, with an air of assurance which he was far from feeling. The effect of his words upon his host was wonderful. An expression that was almost diabolical flashed over his face. \"Hold!\" he cried. \"You need look no further for a minister; I will perform the ceremony. It is a pity for the young lady to have to go out in the storm to have a little service like that rendered. Old May\u0027s niece!\" he muttered under his breath. \"Ah, what a glorious revenge it is for me to give her to this profligate! Of course, old May don\u0027t know anything about the escapade of this girl!\" He clinched his hands tightly together as he looked at her. There was no feature of old John May perceptible in this slender little creature; but for all that, he hated[23] her—ay, he hated her with a deadly hatred. He knew why. \"I will help you in this affair,\" he said, with a peculiar laugh that might mean much or might mean little. The ceremony was not a long one, and almost before Ida could realize what was taking place, Royal Ainsley was bending over her, and calling her his dear little wife. But there was something about the kiss that he laid on her lips that made a strange shiver creep over her. Royal Ainsley could hardly conceal his triumph. No matter if the Mays did find her now, they could not undo what had been done. He had wedded her and her millions! \"Is there a train that leaves for New York?\" he asked. \"Yes; one passes here in about twenty minutes from now. By cutting across over to that side road you could easily catch it.\" Half an hour later, they were steaming toward the city as fast as steam could carry them. The dark curly head nestled against his shoulder, while Royal looked out of the window, out into the blackness of the night, little dreaming that he was on the eve of a terrible tragedy. He had been lucky enough to secure the little compartment at the rear of the drawing-room car, which those who have money enough to pay for can secure exclusively for themselves. \"I ought to tell you something that is weighing very heavily upon my mind, Royal,\" she said, nestling closer to her fair, handsome, boyish husband. \"Not until to-morrow, love,\" he declared, drawing her toward him, and kissing her fondly.","sourceLink":"http://novel.tingroom.com/jingdian/1691/49777.html","bookId":1156,"book":{"id":1156,"title":"A Dangerous Flirtation","description":"简介： Three young girls, as fair as youth and beauty could make them, stood with arms twined about one another on the sands of Newport one hot August afternoon.Neither of the trio could have been over seventeen. All three were dressed in white, and looked...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1691","creation":"Aug 1, 2019 12:24:28 AM","modification":"Aug 1, 2019 12:24:28 AM"}}
