{"id":43251,"no":57,"title":"CHAPTER LVII.","content":"Royal Ainsley was not a man to be trusted when under the influence of drink. As the minutes went by, and Ida did not come, he was beside himself with rage. \\n\\n \\n\\n \"What does she mean by keeping me waiting in this manner?\" he roared. \"By the Lord Harry, I\u0027ll make her pay for this!\" \\n\\n \\n\\n Then, like Eugene Mallard, who was watching but a few feet from him, he saw the light go out in Ida\u0027s room. \\n\\n \\n\\n \"That must be her room. She is coming at last,\" he murmured. \\n\\n \\n\\n He braced himself against the trunk of a tree, for by this time his limbs were none too steady under him. \\n\\n \\n\\n When the door opened, and he saw Ida approach, an exclamation of satisfaction broke from his lips. \\n\\n \\n\\n He sat down upon the mossy rock and watched the slim figure as it moved slowly over the greensward. \\n\\n \\n\\n \"She is certainly in no hurry to see me,\" he muttered, with a grim smile. \"But I\u0027ll change all that.\" \\n\\n \\n\\n Meanwhile, Ida had stopped short, and was standing motionless in the path. \\n\\n \\n\\n Putting her hand into the pocket of her dress, the girl found, to her great amazement, that she had come[241] away without the roll of bills she had intended to bring with her. In her excitement she had left the money on the table. \\n\\n \\n\\n What should she do? There was no course to pursue but go back for it. \\n\\n \\n\\n Then a superstitious terror for which she could not account seemed to seize her. \\n\\n \\n\\n \"It will surely be a bad omen to return to the house.\" she told herself; \"and yet I dare not meet Royal Ainsley without the money. He will say that my story about forgetting the money is only an excuse.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1691/49829.html","bookId":1156,"book":{"id":1156,"title":"A Dangerous Flirtation","description":"简介： Three young girls, as fair as youth and beauty could make them, stood with arms twined about one another on the sands of Newport one hot August afternoon.Neither of the trio could have been over seventeen. All three were dressed in white, and looked...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1691","creation":"Aug 1, 2019 12:24:28 AM","modification":"Aug 1, 2019 12:24:28 AM"}}
