{"id":43203,"no":9,"title":"CHAPTER IX.","content":"Again the poor child picked up the cruel letter; but she could not read a line of it, though she sat looking at the written page. \"Not his wife!\" she moaned over and over again, clutching her little hands over her heart. With a sudden frenzy she tore the letter into a thousand shreds, and flung the pieces from her through the open window. Would her poor, sick mother\u0027s heart break when she told her all? When she went home, would they force her to marry the terrible being she abhorred? Home! Ah, God! what a mockery! She had only a shelter. If she refused to marry the horrible hunchback, her mother and herself would not even have that. [38] How could she face the future? The very thought of it made the blood chill in her veins. \"Oh, Royal! Royal! death from your hands would have been easier than that!\" she moaned. The next moment there was a heavy fall, and one of the house-maids, passing the parlor, saw the girl lying in a heap. They did all in their power to restore her to consciousness; but it was quite useless. When they had worked an hour over her, they became alarmed. Where was her husband? Why did he not return? The hotel physician did all in his power, but without avail. \"It looks like a case of brain fever,\" he said, \"or perhaps typhoid. Either is contagious, therefore dangerous. I should advise that she be sent to the hospital around the corner.\" \"That husband of hers has not settled his bill!\" exclaimed the proprietor, his face darkening angrily. \"It is my opinion,\" said the doctor, \"that it is best not to await the return of the young gentleman who accompanied her here. In short, it is my opinion that he has deserted her.\" In less time than it takes to tell it, poor, hapless Ida May, the victim of such a cruel misfortune, and a sadder fate yet to follow, was taken to the hospital. The waning summer days drifted slowly by, and autumn came with its dead, rustling leaves and sobbing winds, before Ida May opened her eyes to consciousness and turned them full upon the white-capped nurse bending over her. \"Where is Royal?\" she asked, faintly. \"You mean the young man who left you at the[39] hotel?\" queried the nurse, who had heard the young girl\u0027s sad story; adding: \"He never came back to inquire for you. He has deserted you. He did not care whether or not the shock would kill you. If there was ever a heartless scoundrel on the face of the earth, he is that one!\" The lovely white young face never changed its pallor, the dark eyes never left the grim countenance of the nurse. \"I want to leave this place at once,\" said the girl, attempting to rise from her cot. \"No, no; you must not do so!\" exclaimed the nurse. \"It would be dangerous in your case.\" \"But I want my mother,\" moaned Ida, piteously. When the nurse made her rounds an hour later, to her great consternation she found that Cot 27 was empty. The girl had flown! The most diligent search through the city failed to elicit the slightest trace of her whereabouts. An hour later a little dark figure, ensconced in a corner of the car, was whirling rapidly toward Dorchester. She sat staring from the window with eyes that did not see so intent was she with her own thoughts. \"I can not marry Mrs. Deering\u0027s nephew,\" she sobbed, under her breath. \"It would be easier for me to die. But what shall I do to raise the money for which they hold my poor mother a veritable slave!\" She clasped her hands in piteous entreaty; but the soft, radiant moon and the golden stars to which she raised her eyes so appealingly could find no answer for her. As the train slowed up at the station, she pulled her[40] veil down closely. She hurriedly alighted and sped like a storm-driven swallow up the village street and along the high-road, until, almost out of breath, she reached the Deerings\u0027 mansion. She stood transfixed for a moment at the gate. What was there about the place that caused such a shudder to creep over her? What did the awful presentiment, as of coming evil, mean that took possession of her body and soul?","sourceLink":"http://novel.tingroom.com/jingdian/1691/49781.html","bookId":1156,"book":{"id":1156,"title":"A Dangerous Flirtation","description":"简介： Three young girls, as fair as youth and beauty could make them, stood with arms twined about one another on the sands of Newport one hot August afternoon.Neither of the trio could have been over seventeen. All three were dressed in white, and looked...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1691","creation":"Aug 1, 2019 12:24:28 AM","modification":"Aug 1, 2019 12:24:28 AM"}}
