{"id":32748,"no":22,"title":"CHAPTER XVII.","content":"FOURTH GENERAL CONFERENCE—GOD DESIGNATES MISSOURI AS THE PLACE OF HOLDING THE NEXT CONFERENCE—TRANSGRESSION OF THE THOMPSON BRANCH— JOSEPH GOES TO THE PLACE OF THE NEW JERUSALEM. From all the dwelling-places of the Saints throughout the land came representatives to attend the fourth General Conference of the Church. It opened on the morning of the 6th of June, 1831, in Kirtland, Ohio, under the presidency of Joseph Smith, the Prophet of God. Fourteen months had elapsed since the organization of the Church, with six members. Now the congregation numbered two thousand souls. For the marvelous manifestation of His power which had brought these people to a knowledge of the truth and had enabled them to become the recipients of saving ordinances, the conference offered praise to Almighty God. There was a great outpouring of the Spirit upon the assemblage, and the Lord displayed His power in the firm establishment of His word in the hearts of His children. Joseph himself says, \"The Lord gave us power in proportion to the work to be done.\" Several were selected by revelation and ordained to the High Priesthood after the order of the Son of God, which is after the order of Melchisedec. This was the first occasion this Priesthood had been conferred upon the Elders in this dispensation. The cause was no longer the work of a single family. Its glory, its promise and its tribulation, as it must endure, were shared by a considerable community; but if the Saints had been all one family in the flesh, they could not have been more united and harmonious than they were on the occasion of this conference. Peace was in the household of faith, and through humility and prayer the blessings of Heaven were generally enjoyed. In the midst of the congregation the Lord made known, through Joseph, that their next conference should be held far away, in the State of Missouri, upon the spot consecrated by God unto the children of Jacob, the heirs of His covenant. In the same revelation the Lord directed the Prophet and Sidney Rigdon to prepare for their journey into the land of Zion; promising to them that through their faith they should know the land which was to be forever the inheritance of the Saints of the Most High. Special instructions were also given to others of the Elders, commanding them to go forth two by two in the proclamation of the word of God by the way, to every congregation where they could get a hearing. Though the western frontier of Missouri was their destination, they were commanded to take different routes and not build on each other\u0027s foundation or travel in each other\u0027s track. At this time the branch of the Church in Thompson, Ohio, fell into darkness, and messengers came to the Prophet asking him to inquire of the Lord for them. This branch was composed of Saints who had moved from Colesville, New York, and who had received instructions from the Lord, through the Prophet at the request of Bishop Partridge, as to the manner in which they should organize themselves to conduct their temporal affairs. In response to the supplication which Joseph addressed to the Lord upon this subject, humility and contrition were required from the Saints at Thompson for their transgression, and they were directed to take their journey into the regions westward, to near the line of the State of Missouri and the then Indian country. Word had been received from Oliver Cowdery and from Parley P. Pratt, announcing their ministrations in the West, and giving information concerning the Indians or Lamanites, who dwelt in the wilderness across the line from Missouri. While Joseph was preparing to depart on the western journey which he had been commanded to take, William W. Phelps, a man of considerable prominence in the Church afterwards, came with his family from afar and offered himself to do the will of the Lord. He had not yet been baptized, but he was promised the remission of his sins and the gift of the Holy Ghost by the laying on of hands, if he would submit to the ordinances with the proper feeling, and he was to be ordained to do the work of printing for the Church; and for this cause was required to take his journey with Joseph and Sidney Rigdon to the west. It was on the 19th day of June, 1831, that Joseph Smith departed from Kirtland, Ohio, to go up into Missouri, the place promised as an inheritance for the Saints and at which the New Jerusalem should sometime be established. The Prophet was accompanied by Sidney Rigdon, Martin Harris, Edward Partridge, W. W. Phelps, Joseph Coe and A. S. Gilbert and wife. As rapidly as possible they journeyed by wagon and stage and occasionally by canal boat to Cincinnati, Ohio. From the latter point they went to Louisville, Kentucky, by steamer, and were compelled to remain there three days waiting for an opportunity to get to St. Louis; they reached St. Louis by steamer, and there made a brief pause. From this city on the Mississippi, the Prophet of God walked across the entire State of Missouri to Independence, Jackson County, a distance of nearly three hundred miles as traveled. This journey through the blazing heat of June and July was sweet to Joseph. There was a charm about it which lightened toil. The pains and burdens were unworthy of notice in the delightful anticipation of seeing the land for which the Lord, as had been shown to him by vision and prophecy, had reserved so glorious a future. He was accompanied by Martin Harris, William W. Phelps, Edward Partridge and Joseph Coe; while Sidney Rigdon and A. S. Gilbert and wife went up the Missouri River a few days later by steamboat. It was about the middle of July when the Prophet and his party reached Independence. During the month of their journey Joseph had taught the gospel, in the cities, the villages and the country places, in vigor and simplicity. Joseph himself says that the meeting with his brethren, who had long awaited his arrival upon the confines of civilization, was a glorious one, moistened by many tears. It seemed good and pleasant for brethren to meet in unity and love after the privations which, for the sake of obeying the commands of God, they had endured since their separation. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3320/90930.html","bookId":395,"book":{"id":395,"title":"The Life of Joseph Smith the Prophet","description":"简介： Joseph and Hyrum are now dead; but like the first martyr they yet speak. Their united voice is one of testimony, admonition and warning to the world.They lived men of God. They died pure and holy, sealing their testimony with their blood.No men ever...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3320","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
