{"id":32757,"no":31,"title":"CHAPTER XXVI.","content":"THE JACKSON COUNTY PERSECUTIONS—APPEAL TO GOVERNOR DUNKLIN—HIS TIMID REPLY—HEARTLESS DRIVINGS—A BRUTAL MURDER—BOGGS ALLOWS THE MOB TO ORGANIZE AS A MILITIA—PITCHER PLACED IN COMMAND—CERTAIN MEN TAKEN IN CUSTODY BY THE MOB—SETTLEMENT IN CLAY COUNTY—COURT OF INQUIRY. \"Be still and know that I am God.\" These are the words with which the Almighty answered Joseph when he importuned Heaven concerning the woes of the Saints in Missouri. And so he was wont to solace himself and his brethren with the remembrance of the revealed word that \"After much tribulation cometh the blessing.\" How many years of the people or days of the Lord must elapse before the Saints would be planted in power in Zion, the Prophet could not learn; but this he did know that after her term of affliction and purification had passed she would be redeemed and beautified, and this is the promise that he uttered to his brethren in Kirtland and wrote to the Saints in Missouri. While Joseph had been traveling in the missionary field, momentous events took place in the far west. The truce which the mob had made, the mob had broken. Assaults upon the houses of the Saints were of constant occurrence. Satan was not satisfied that the people of the Lord should peacefully migrate with their few possessions into some other region, and the more turbulent spirits in the rabble began to threaten the lives of leading men at Independence and to declare that all of the people—men, women and children,—should be whipped out of the county. An attempt was made to establish a colony in Van Buren County, in the south. Some of the Saints settled there and began to labor diligently in the fields, but the spirit of mobocracy had spread, and a mob rose in arms, threatening to drive the Saints farther into exile. On the 28th day of September, 1883, a petition was addressed to His Excellency Daniel Dunklin, Governor of the State of Missouri, by the persecuted people in Jackson County; and it was carried to the executive office in Jefferson City by Elders Orson Hyde and William W. Phelps. In this eloquent document a recital was made of the woes to which the people had been subjected, of the patience with which they had borne these outrages, of the utter subversion of the principles of law and humanity, and of the participation in these outrages by leading men in the state, civil and military officers, politicians and preachers. The final appeal in this petition was as follows: Knowing, as we do, that the threats of this mob, in most cases, have been put into execution, and knowing also that every officer, civil and military, with a very few exceptions, has pledged his life and honor to force us from the county, dead or alive; and believing that civil process cannot be served without the aid of the Executive; and not wishing to have the blood of our defenseless women and children to stain the land which has once been stained by the blood of our fathers to purchase our liberty; we appeal to the Governor for aid, asking him, by express proclamation or otherwise, to raise a sufficient number of troops, who, with us, may be empowered to defend our rights, that we may sue for damages in the loss of property—for abuse—for defamation, as to ourselves; and if advisable, try for treason against the government, that the law of the land may not be defied, nor nullified, but peace be restored to our country:—And we will ever pray. Not one word in this petition had been set down in malice; it was temperate and respectful; and though its utterances were strong, they were borne out by incorruptible testimony, as well as, mainly, by the admissions of the mob themselves. After such an appeal, the Saints were entitled to prompt action and help. The Governor merely replied that the attorney-general of the state was absent, and upon his return a response would be prepared and sent by mail to Independence. The messengers from Zion journeyed back with empty hands, and awaited, amidst the tide of persecution, which was rising higher and higher around them, the signal of succor, from the executive office. About the 26th of October, 1833, a reply was received from Governor Dunklin, in which he says: No citizen, nor number of citizens, have a right to take the redress of their grievances, whether real or imaginary, into their own hands. Such conduct strikes at the very existence of society and subverts the foundation on which it is based. Not being willing to persuade myself that any portion of the citizens of the state of Missouri are so lost to a sense of these truths as to require the exercise of force, in order to ensure respect for them, after advising with the attorney-general, and exercising my best judgment, I would advise you to make a trial of the efficacy of the laws; the judge of your circuit is a conservator of the peace. If an affidavit is made before him by any of you, that your lives are threatened and you believe them in danger, it would be his duty to have the offenders apprehended, and bind them to keep the peace. Such was the redress offered by the man whose sworn duty it was to see that the laws were faithfully executed. The lamb was sent back by the lion to ask protection from the wolf! It has often happened since in the history of the Saints, as it was then, that the men who should have been their vigilant protectors against plunderers and murderers, have been among the thieves and assassins. But Governor Dunklin\u0027s letter contained a promise that, in the event of a failure to get proper execution of the law in Jackson County, he would, upon official notification, take further steps to enforce its faithful observance. Upon this slight hope, the Saints began to restore their houses to comfort and to labor in the fields for their maintenance. The Saints had engaged four lawyers to aid them in obtaining a redress of their grievances, and as soon as this fact became known, the event occurred which Governor Dunklin should have foreseen. With tenfold intensity the fire of hatred raged against the people. On the night of October 31st an armed mob attacked a settlement of the Saints west of Big Blue, tore the roofs from many of the dwelling houses, whipped the men and drove the women and children screaming into the wilderness. The profanity of the mob was appalling. None of the Saints were armed, and the resistance which they might have offered with sticks was forbidden by their captors under penalty of death. Satiated with brutality, the mob at length retired, leaving orders that the Saints—men, women and children—should leave the county. The next day was the first of bleak November; and when the cold morning dawned, the Saints crept out of their hiding places whither they had fled for safety, and came back to their despoiled homes to find their habitations and their gardens in ruins. The women wept for their scourged and bleeding husbands. Children sobbed with hunger, cold and fear. How were these plundered people to find means for journeying to a land of safety? And whither were they to go? Asylum had already been denied them in the adjoining county: adequate protection had been practically denied to them by the civil power of the state; and they had no hope that any section of Missouri would harbor them. Such scenes of horror were repeated night after night at Independence, and every dwelling place of the Saints in that county. At Independence, on the 1st of November, one of the mob was caught in the very act of robbing the store of Gilbert \u0026 Whitney, and was carried before Samuel Weston, a justice of the peace; but despite the boast of the Governor, Mr. Weston refused to issue a warrant or to entertain the case, and the robber was turned loose to join his fellows in a continuation of murderous work. Other efforts were made to secure the aid of judicial power to stop the horrible work of the rabble, but in vain. Such of the officers of the law as were not allied with the mob dared not assert their authority. And so the work of rapine went on until it ended in murder. The 3rd day of November, 1833, was Sunday, and the Saints hoped for a cessation of hostilities, but none came. Word went out among the mob that Monday would be a bloody time. On November the 4th, the day of Joseph\u0027s return to Kirtland from his Canada mission, a large party of the mob fired upon some of the Saints west of Big Blue. Several of the Saints were wounded, two desperately. These were young men named Barber and Dibble, who were thought to have been fatally injured; but Philo Dibble finally recovered, and at the time of this writing is still living, a respected citizen of Utah Territory. After lingering in great agony, Barber died the next day. Three times and more the Saints had permitted their enemies to smite them, and three times and more they had submitted patiently. They had appealed to civil and military power in vain, and now the sight of blood thus wantonly shed aroused in them a strong spirit of resistance. When the mob continued the massacre they were greeted by shots from such of the Saints as had guns, and two of the mob fell dead. One of them, Hugh L. Brazeale, had often boasted: \"I will wade to my knees in blood but that I will drive the Mormons from Jackson County.\" The men who had caught the mobber in the act of plundering Gilbert \u0026 Whitney\u0027s store were arrested upon a fictitious charge of assault upon that wretch. Apparently the mob had no difficulty in obtaining process of court and securing its service. An effort was made to kill these prisoners while they were in charge of the officers of the law, and shots were fired at them, and they had to be placed in jail to protect their lives. And now comes the most diabolical feature of all the persecution in Missouri up to that date. On the 5th day of November, 1833, Lieutenant-Governor Boggs permitted the mob to organize as a militia, and placed them under the command of Colonel Thomas Pitcher. While the Saints showed no intention of resisting, the rabble did not feel the need of such organization; but when it was found that, driven to the last extremity, the Saints would fight for their lives, Boggs clothed the mob with military power, that resistance to them might be charged against the Saints as insurrection against the legal authorities of the state of Missouri. Colonel Pitcher demanded that the Saints should give up their arms; that certain men who had been engaged in the fight west of Big Blue should be delivered into his hands to be tried for murder; and that the people should leave the county forthwith. It was clear that the alternative was death to the men and outrage to the women and children. And so the Saints yielded under solemn promise of protection. As soon as the demand was complied with, the mob rushed like demons in various directions, bursting violently into houses and threatening the women and children with massacre. One party of the mob was headed by Rev. Isaac McCoy, and other preachers joined in the rabble. Men, women and children fled to the prairie and to the river banks, seeking in the wilderness, amidst all its terrors, a peace denied them by civilized men. Husbands and wives and children were separated, and one knew not whether his beloved kin were dead or alive. Who can say that a restoration of the Gospel of Peace was not necessary in such an age? After a time most of the scattered Saints gathered in Clay County, where a court of inquiry was ordered by Governor Dunklin, but the murderers and robbers who slew the Saints and took their substance in Jackson County, Missouri, went unwhipped of justice. Clay County was the only section of the state which received the Saints with any degree of charity. From Van Buren and Lafayette and other counties they were forced to flee as they were from Jackson. In Clay County, where many of them had found a haven of rest among noble-hearted citizens, the Saints prepared and sent up to Governor Dunklin such piteous appeals as might have melted a heart of adamant. They had been stripped of all their worldly substance; winter was upon them; they even lacked food and raiment; and from hour to hour they were in expectation of further assaults. It was their supplication to the Governor that he would use the power of the state to restore them to their lands and possessions, and to give a sufficient guard to a court of inquiry, which might examine into the whole history of the outrages made against them. The court of inquiry was held, and Colonel Pitcher was arraigned and ordered for further trial by court-martial. But it soon became clear that the Saints could not be restored to their lands in Jackson County under existing conditions; because the mob swore that if they returned, there would be a wholesale massacre of Mormons, and the Governor, it was said, had not the constitutional right to establish a permanent guard for the persons and property of the defenseless Saints. Messengers had gone at various times from the scenes of the outrage in Missouri to the Prophet at Kirtland, and when he heard the dreadful news, he burst into tears and sobbed aloud: \"Oh, my brethren, my brethren! would that I had been with you to share your fate. Almighty God, what shall we do in such a trial as this?\"","sourceLink":"http://novel.tingroom.com/duanpian/3320/90939.html","bookId":395,"book":{"id":395,"title":"The Life of Joseph Smith the Prophet","description":"简介： Joseph and Hyrum are now dead; but like the first martyr they yet speak. Their united voice is one of testimony, admonition and warning to the world.They lived men of God. They died pure and holy, sealing their testimony with their blood.No men ever...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3320","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
