{"id":32769,"no":43,"title":"CHAPTER XXXVIII.","content":"BOMBARDMENT OF DE WITT—APPEAL OF THE SAINTS TO GOVERNOR BOGGS—HIS HEARTLESS REPLY—JOSEPH\u0027S PRESENCE ENCOURAGES THE BRETHREN—THE SAINTS LEAVE THEIR POSSESSIONS IN DE WITT—THEY GO TO FAR WEST—ADAM ONDI-AHMAN DEVASTATED—THE SAINTS ORGANIZE FOR DEFENSE—JOSEPH CONTROLS A MOB WHO DESIGN TO MURDER HIM—APOSTASY OF THOMAS B. MARSH—DEATH OF DAVID W. PATTEN—\"WHATEVER YOU DO ELSE, OH, DO NOT DENY THE FAITH.\" Greater love hath no man than this, that he lay down his life for his friend. On the 5th day of October, 1838, word came to the Prophet of the bombardment of the town of De Witt, in Carroll County, by a mob army with muskets and artillery. The ravenous wretches, many of whom had been in the militia companies of Atchison, Doniphan and Parks, foiled for the moment in Daviess and Caldwell Counties, had concentrated upon the more remote and defenseless places for the purpose of plundering the Saints and driving them forth. As soon as Joseph heard the news he hastened to the scene of conflict. The rage of the mob naturally fell against him more heavily than against anyone else; but it was his nature always to be where danger threatened his brethren. It was on the 2nd of October that the mob, under the leadership of Dr. Austin, Major Ashley, a member of the legislature, and Sashiel Woods, a Presbyterian clergyman, fired first upon the town of De Witt. They continued during that day and the next, when they were reinforced by two companies of militia under the command of Captains Bogart and Houston, who were soon followed by Brigadier-General Parks. It is not wrong to speak of these troops as a reinforcement of the mob. They were nothing else. Bogart was a Methodist preacher by profession, and only led the company of militia to De Witt for the purpose of wreaking the sectarian vengeance of a bigot upon the Saints. Parks himself confessed that Bogart\u0027s men would not be controlled and were with the mob in feeling; and this was the General\u0027s excuse for allowing the outrages of this time to go unchecked. On the 4th of October, after forty-eight hours of siege, the people of the town, in command of Colonel Hinkle, returned the fire. Parks made no effort to check the mob\u0027s plan of organized murder. On the 6th he coolly wrote in his report to Atchison, as follows: The Mormons are at this time too strong and no attack is expected before Wednesday or Thursday next, at which time Dr. Austin [who with Bogart was leader of the mob] hopes his forces will amount to five hundred men, when he will make a second attempt on the town of De Witt, with small arms and cannon. In this posture of affairs I can do nothing but negotiate between the parties until further aid is sent me. Evidently in this posture of affairs Parks wanted to do nothing. The \"Mormons\" were too strong. He would wait until Austin\u0027s rabble increased to five hundred, and by that time he hoped to have more companies of militia, which in turn would swell the ranks of the plundering besiegers. Parks\u0027 conduct indicates his utter lack of conscience; because in the same letter he says: \"As yet they, the Mormons, have acted only on the defensive as far as I can learn.\" General Lucas had been an observer of the gathering at De Witt and had been informed that a fight had taken place there, in which several persons were killed. Upon this he wrote to the Governor that if his information was true it would create excitement in the whole of Upper Missouri, \"and those base and degraded beings will be exterminated from the face of the earth.\" He added that if one of the citizens of Carroll should be killed, before five days there would be raised against the \"Mormons\" five thousand volunteers whom nothing but blood would satisfy. Without attempting to suggest a remedy to Boggs, this cruel and sanguinary Lucas significantly informs his Excellency that his troops of the fourth division were only dismissed subject to further order and could be called into the field at an hour\u0027s warning. He wanted to share in the work of extermination! These events had happened before the Prophet reached De Witt. It was a trying journey, in which he had been obliged to travel by unfrequented roads and had put his life in constant jeopardy because mobs guarded every ingress to the town. When Joseph entered the place he found the brethren only a handful in comparison to their assailants. Their provisions were exhausted, and there was no prospect of obtaining more. The Prophet concluded to send a message to the Governor and secured the services of several influential and honest gentlemen who lived in that vicinity and who had been witnesses of the wanton attack upon the Saints. These men were bold as well as honest for they made affidavit of the outrages which had been perpetrated within their sight, and they accompanied the supplication for redress to the executive office. The answer of the men who had been chosen by the suffrages of his fellow-citizens as the chief officer of the state, sworn to uphold its honor, protect its dignity and maintain the supremacy of its laws, was only this: The quarrel is between the Mormons and the mob, and they may fight it out. Joseph\u0027s presence was a solace and a sustaining power to the Saints. He animated them by the courage of his presence and taught them patience by his own tenacity of endurance. He was not there as a warrior; he did not bear arms; and yet he was a tower of strength to his brethren. Mobs were gathering in from Ray, Saline, Howard, Livingston, Clinton, Clay, Platte and other parts of the state to reinforce the besiegers. For the combined assailants a man named Jackson was chosen as the leader. The Saints were forbidden to leave the town under penalty of death. It was the purpose to starve them, since even this large crowd of mobbers, outnumbering the Saints ten to one, feared to risk a hand to hand contest. Fires were set to some of the houses; the cattle were stolen and roasted; the horses were driven off; while the mob made merry in feasting within sight of the starving people whom they had plundered. Joseph directed applications for protection to the judges of the circuit court and in other quarters but without avail; for where aid was given, it consisted of men willing to join and abet the mobs and to share in the spoils. In the town, men were perishing for want of food; women and children cried for bread. There was no hope of earthly succor. In this crisis, Henry Root and David Thomas, two men who had been the sole cause of the settlement at De Witt, solicited the Saints to leave the place, claiming that they had assurance from the besiegers that, in such case, no further attack would be made and all the losses would be paid. Yielding to a necessity the Saints agreed to this proposition. A committee of appraisement was appointed from men not connected with the Saints. They placed a meagre value on the bare land, and said nothing about the houses and other improvements which were still standing or had been destroyed by the mob, and nothing about the stock and the vehicles which had been run off. It was, however, an unnecessary economy of valuation; because the price, meagre as it was, has never been paid. On the 11th day of October, 1838, the Prophet and the Saints vacated De Witt and started for Caldwell with the small remnants of their possessions which they could gather and hope to convey. They were harassed continually on the journey by the mob which, in violation of its pledge, fired upon the retreating people. Among the exiles men died from fatigue and starvation—for the journey was greatly hurried because of the mobocratic threats; and one poor woman, who had given birth to a child on the very eve of the banishment, died on the journey and was buried in a grave without a coffin. The experience at De Witt and on the journey from that place to Far West taught the Prophet and the Saints anew that they had no hope of protection, no hope of redress, while they remained in Missouri; and no hope that if they attempted to leave they would not be set upon and massacred by the blood-thirsty mob. Nothing was left them but to organize in some fashion for self defense, as they came fleeing into Far West from all the surrounding country, leaving their worldly all and glad to escape with their lives. The tiger spirit of the mob had grown upon its food. As the brethren left De Witt, Sashiel Woods called many of the mobocrats together and invited them to hasten into Daviess County to continue their work there. He said that the land sales were coming on, and that if the \"Mormons\" could be first driven out the mob could get all the land entitled to preemption; besides, they could get back without pay the property already bought from them by the Saints. It was a welcome invitation, and, taking their artillery, this horde, with appetites whetted for their base and cruel work, departed for Adam-ondi-Ahman. Other mobs were raised in other parts to join in this general movement for rapine, among the rabble being a man named Cornelius Gilliam who called himself Delaware Chief, with a party of miscreants painted to represent Indians. When the Prophet arrived in Far West from De Witt, on the 12th day of October, General Doniphan informed him that a mob of eight hundred men was marching against the people in Daviess County. A small party of militia had been on the way and might have intercepted the rabble; but Doniphan ordered them back, knowing well that instead of hindering they would join the mob. He said: \"They are damned rotten-hearted.\" Pursuant to an order made by General Doniphan a company of militia was raised in the county of Caldwell to act under Colonel Hinkle and to proceed to Adam-ondi-Ahman for the protection of that place. Joseph went with the militia to give counsel to his friends, risking his own life again, and taking with him many who were willing to stand with him in martyrdom if need were. At Adam-ondi-Ahman the scenes of De Witt were repeated. Houses were burned, cattle were run off, women and children were driven out and exposed to a terrible storm which prevailed on the 17th and 18th of October. In many cases people in ill health were torn from their beds and were refused time to secure comfortable clothing in which to make their flight. Among the fugitives was Agnes Smith, the wife of the Prophet\u0027s brother, Don Carlos, who was absent on a mission to Tennessee. Her house had been burned by the mob, her property seized, and she had fled three miles, wading Grand River and carrying all the way two helpless babes in her arms—glad to escape death and outrage. Joseph\u0027s soul rose in arms at these crimes. The sacrifice had been sufficient. Every possible appeal had been made and denied. Henceforth the Saints must protect themselves, and God arm the right! It was this resolve alone which saved the remaining element of the Church that finally escaped from Missouri. At Adam-ondi-Ahman the mob intended to make a work of extermination; but after the arrival of the troops there, promises were demanded and secured from General Parks for the organization of a militia company to resist the attack and quell the mob. The force was immediately raised and placed under the command of Colonel Lyman Wight who held a commission in the fifty-ninth regiment under General Parks. These troops went out with a determination to drive the mob or die. They no longer fought in the state of Missouri for their rights as American citizens; that day had passed. They fought for life, for home, and for that which was dearer than all, the honor and safety of their wives and daughters who had been threatened with ravishment. A remembrance of the day at Gallatin, when twelve had put one hundred and fifty to flight, suddenly came upon the mob as they saw the advancing forces of the Saints; and they fled. But fleeing, they resorted to stratagem. They removed everything of value from some of their own old log cabins and then set fire to these structures, afterwards spreading abroad through all the country the declaration that the \"Mormons\" had plundered and burned the mansions of law-abiding citizens. An incident of this period shows the Prophet\u0027s calmness and self-command in the face of danger, as well as the influence of his presence even upon sworn enemies. He was sitting in his father\u0027s house near the edge of the prairie one day, writing letters, when a large party of armed mobocrats called at the place. Lucy Smith, the Prophet\u0027s mother, demanded their business, and they replied that they were on the way to kill \"Joseph, the Mormon Prophet.\" His mother remonstrated with them; and Joseph, having finished his writing and hearing the threats against himself, walked to the door and stood before them with folded arms, bared head and such a look of majesty in his eyes that they quailed before him. Though they were unacquainted with his identity, they knew they were in the presence of greatness; and when his mother introduced him as the man they sought, they started as if they had seen a spectre. The Prophet invited the leaders into the house, and without alluding to their purpose of murder, he talked to them earnestly with regard to the persecutions against the Saints. When he concluded, so deeply had they been impressed, that they insisted upon giving him an escort to protect him to his home. As they departed, one of the mob leaders said to another: Didn\u0027t you feel strange when Smith took you by the hand? And his companion replied: I could not move. I would not harm a hair of that man\u0027s head for the whole world. It was always so when men would listen to Joseph long enough to let the Spirit which animated him assert itself to their reason. The extent of the unhallowed league against the Saints is shown by the fact that not even the United States mails were safe during this period, for every post was plundered and all letters addressed to the Prophet were opened. Unable to bear the pressure and to face the terrors of the time, Thomas B. Marsh had apostatized and had joined with McLellin and other evil men to act the part of Judas against the Prophet. The faith of others also failed, and, thinking by apostasy to save themselves from the destruction which seemed impending, they came out against Joseph and the Church and went over to their enemies. On the 24th of October, eight armed mobbers plundered a house some little distance from Far West and took three of the brethren prisoners, namely, Nathan Pinkham, William Seely and Addison Green. With much exultation, these brigands declared their intention to murder their prisoners that night. Learning of this awful boast, the judge of the county instructed Colonel Hinkle to send out a company to rescue the men and disperse their captors. Seventy-five of the militia, under command of David W. Patten, were directed by Hinkle to fulfil this order. In departing, Captain Patten announced his hope to rescue his unoffending brethren without shedding any blood and to bring them back to Far West. Fifty men of this company marched to the ford on Crooked River, where they came upon an ambuscade of the mob, who fired upon them, mortally wounding a young man named O\u0027Banion. Captain Patten ordered a charge upon the enemy, at the same time shouting the watchword, \"Our God and liberty!\" The concealed mobocrats fired as the company rushed down upon them. A musket ball pierced the bowels of David W. Patten, fatally wounding him. At the same fire a shower of bullets struck Gideon Carter, who fell to the ground to die after a few moments of agony. So defaced was Carter by his many wounds, that later, when his brethren were gathering up their dead and wounded, they failed to recognize his body. Several others among the brethren were wounded. The others, even after the fall of their leader, dashed on in pursuit and put the mob to flight. The prisoners were rescued, but one of them was shot by the mob during the engagement. From them it was learned that Bogart had commanded the marauders and that his forces had been greater than those of the attacking party. When the affray was over, David W. Patten—still alive, but gasping in mortal extremity—was lifted up by his brethren, and they carried him tenderly to his home. A courier brought the news to Far West, and Joseph and Hyrum went out to meet the sorrowful cavalcade. Several were with Apostle Patten when he died that night, in the triumph of the faith. He had fulfilled his covenant to yield life rather than to yield the right. As he was departing, he spoke with holy exultation of the eternity opening to his view, and with sorrow of those traitorous Apostles and Elders who had forsaken the Saints to save their own lives and property. One of his last expressions to his wife was: WHATEVER YOU DO ELSE, OH, DO NOT DENY THE FAITH. Thus perished the first apostolic martyr to the cause of Christ in this dispensation. How much better his fate than that of the Judases who helped to bring him to his death! At the funeral, Joseph stood in the presence of the assemblage, and, pointing at the noble form marred by the assassin\u0027s bullet, testified: There lies a man who has fulfilled his word: he has laid down his life for his friends. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3320/90951.html","bookId":395,"book":{"id":395,"title":"The Life of Joseph Smith the Prophet","description":"简介： Joseph and Hyrum are now dead; but like the first martyr they yet speak. Their united voice is one of testimony, admonition and warning to the world.They lived men of God. They died pure and holy, sealing their testimony with their blood.No men ever...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3320","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
