{"id":32786,"no":60,"title":"CHAPTER LV.","content":"A BREATHING SPELL—JOSEPH\u0027S ANTICIPATION OF HIS SACRIFICE—MANY PROPHECIES AND AN IMPORTANT THEOLOGICAL EPOCH IN THE EARLY PART OF 1843—WRESTLING AND OTHER MANLY SPORTS—EXTRACTS FROM HIS SERMONS— ATTACK ON THE NAUVOO CHARTER—THE LULL WAS BRIEF. One of the very few seasons of peace in Joseph\u0027s life now dawned upon him. It was none the less appreciated because it was brief. The early part of 1843 is one of the marked epochs in the theological history of the Church. The Prophet, having his unrestrained liberty, was enabled to give to the Saints in writings, sermons and in personal conversations, many prophecies and principles for spiritual and temporal guidance. Joseph must have known that this was but the lull which precedes the fiercer outburst of the tempest, for in January, 1843, outlining some work which he designed that the Twelve should perform very soon thereafter, he promised his assistance and leadership to them, with this very significant condition, upon which he placed emphasis: \"If I live.\" A few days later, on Sunday, the 22nd day of January, he preached from the stand which had been erected inside the temple walls, a temporary floor having been put in that building for the purpose of holding meetings there. President Wilford Woodruff made a synopsis of the sermon, in which occurs the following: God Almighty is my shield; and what can man do if God is my friend? I shall not be sacrificed until my time comes; then I shall be offered freely. The Prophet recorded this same prophecy concerning his own fate in his journal, showing thereby that he recognized its weight and foresaw its fulfilment. Among the many prophecies of this period was one concerning Orrin P. Rockwell, who had been captured, imprisoned and maltreated in Missouri. There seemed no human possibility of Porter Rockwell\u0027s deliverance; his murder was decreed before his arrest; and no one of the brethren would be permitted to enter Missouri to assist him with advice or bail, under penalty of death. And yet on the 15th day of March the Prophet publicly declared: In the name of the Lord Jesus Christ I prophecy that Orrin P. Rockwell will get away honorably from the Missourians. In the same month of March, Joseph, in company with Elders Willard Richards and Wilford Woodruff, discovered in the early evening a stream of light in the southwest quarter of the heavens. Its rays were in the form of a broad sword with the hilt downward; the blade was raised, pointing from the west to the southwest, at an angle of forty-five degrees, and extended nearly to the zenith. As they beheld this marvel in the sky Joseph said: As sure as there is a God who sits enthroned in the heavens, and as sure as He ever spoke by me, so sure will there be a bloody war; and the flaming sword in the heavens is the certain sign thereof. Two or three weeks later, he prophesied in the presence of Elder Orson Hyde and others that a struggle in which much blood would flow would begin in South Carolina, and would probably arise through the slave question. This was a repetition of the revelation which he had received and announced more than ten years earlier. A delegation of young men from New York came to see Joseph at Nauvoo in February, 1843, and with great respect solicited his views concerning Millerism and the coming of Christ, and the day of judgment, which Miller had fixed for April 3, 1843. The Prophet warned them that Miller was in error; that before Christ should come the prophecies must all be fulfilled, the sun be darkened and the moon turned to blood. A Chicago paper of that time published a certificate of one Hyrum Reading, of Ogle County, Illinois, stating that he had seen the sign of the Son of Man; and the editor of the paper declares that Joseph Smith had met his match. The Prophet responded that Mr. Reading had not seen the sign of the Son of Man, as foretold by Jesus, neither had any man nor will any man, until after the fulfilment of the prophecies; and he declared: Hear this, oh earth! the Lord will not come to reign over the righteous in this world in 1848, nor until everything for the bridegroom is ready. Joseph was once praying very earnestly to know the time of the coming of the Savior, when he heard a voice saying: Joseph, my son, if thou livest until thou art eighty-five years old, thou shalt see the face of the Son of Man. Therefore let this suffice and trouble me no more. In recording this divine utterance, the Prophet says that he was left thus without being able to decide whether this coming referred to the millennium or to some previous appearing, or whether he should die and thus see the face of Christ. Joseph would have been eighty-five years old on the 23rd day of December, 1890; and he says: I believe the coming of the Son of Man will not be any sooner than that time. The question was proposed at a lyceum which Joseph attended whether the kingdom of God was set up before the day of Pentecost or not till then? The Prophet\u0027s answer was recorded at some length by Apostle Wilford Woodruff from whose synopsis the following paragraphs are taken: Some say the kingdom of God was not set up until the day of Pentecost, and that John did not preach the baptism of repentance for the remission of sins; but I say, in the name of the Lord, that the kingdom of God was set up on the earth from the days of Adam to the present time. Whenever there has been a righteous man on earth unto whom God revealed His word and gave power and authority to administer in His name, and where there is a priest of God—a minister who has power and authority from God to administer in the ordinances of the gospel and officiate in the Priesthood of God, there is the kingdom of God; and, in consequence of rejecting the gospel of Jesus Christ and the Prophets whom God has sent, the judgments of God have rested upon people, cities and nations, in various ages of the world, which was the case with the cities of Sodom and Gomorrah, which were destroyed for rejecting the prophets. Now I will give my testimony. I care not for man. I speak boldly and faithfully, and with authority. How is it with the kingdom of God? Where did the kingdom of God begin? Where there is no kingdom of God, there is no salvation. What constitutes the kingdom of God? Where there is a prophet, a priest or a righteous man unto whom God gives His oracles, there is the kingdom of God; and where the oracles of God are not, there the kingdom of God is not. In these remarks, I have no allusion to the kingdoms of the earth. We will keep the laws of the land; we do not speak against them; we never have spoken against them; though we can scarcely mention the state of Missouri and our persecutions there, but that the cry goes forth that we are guilty of treason, which is false. We speak of the kingdom of God on the earth; not the kingdoms of men. These emphatic statements show the loyal position which the Prophet maintained toward his country, and the view he had concerning governments in general. The Prophet gave his brethren three grand keys whereby to know whether any supernatural visitor was from God or from Satan. When a messenger comes, saying he has a message from God, offer him your hand, and request him to shake hands with you. If he be an angel, he will do so, and you will feel his hand. If he be the spirit of a just man made perfect, he will come in his glory; for that is the only way he can appear. Ask him to shake hands with you, but he will not move, because it is contrary to the order of heaven for a just man to deceive; but he will still deliver his message. If it be the devil as an angel of light, when you ask him to shake hands, he will offer you his hand, and you will not feel anything: you may therefore detect him. In the midst of these exalted labors, Joseph took great delight in mingling with the brethren in manly sports. On Saturday, the 28th day of January, 1843, he played a fine game of ball at Nauvoo with his brethren. During the same winter some of his friends saw him teaching his little son Frederick to slide upon the ice; and the Prophet enjoyed the exhilaration and was as merry as a boy. On Monday, the 13th day of March, 1843, Joseph met William Wall, the most expert wrestler of Ramus, Illinois, and had a friendly bout with him. He easily conquered Wall who up to that time had been a champion. About the same time he had a contest at pulling sticks with Justus A. Morse, reputed to be the strongest man in that region. The Prophet used but one hand and easily defeated Morse. One evening in March, twenty-seven children were brought to a meeting to be blessed. Joseph took great joy in laying his hands upon the heads of the innocent little ones, and he blessed nineteen of them himself with great fervency. He turned pale and lost his strength, and was compelled to retire, leaving the meeting and its duties to his brethren. Elder Jedediah M. Grant inquired of him the next day concerning the cause of the strange manifestation. The Prophet replied that as he blessed the little ones, it was made known to him that Lucifer would exert an influence to destroy them, and he strove with all his faith to seal upon them security of their lives and virtue upon earth. So much power emanated from him into the children that he became weak. Joseph referred to the case of the woman who touched the hem of the garment of Jesus, by which her issue of blood was staunched, and the Savior said: \"Somebody hath touched me; for I perceive that virtue has gone out of me.\" Joseph told Elder Grant that the virtue referred to by the Savior was the spirit of life; and men who exercised great faith in administering to the sick, blessing little children, and making confirmations were liable to become weakened. On Monday, the 6th day of February, 1843, the Prophet was elected mayor of Nauvoo by unanimous vote; at the same time Orson Spencer, Daniel H. Wells, George A. Smith and Stephen Markham were elected aldermen; and Hyrum Smith, John Taylor, Orson Hyde, Orson Pratt, Sylvester Emmons, Heber C. Kimball, Benjamin Warrington, Daniel Spencer and Brigham Young were elected councilors. Joseph put his accustomed vigor into his duties as chief officer of the municipality. At the first meeting of the council after the election Joseph urged the necessity of relieving the city of unnecessary expenses and burdens, and warned the members against demanding pay for every little service rendered. At the same meeting it was resolved to establish markets in the city; and the Prophet spoke earnestly about the regulation of prices, so that the poor should not be oppressed; that, while the farmer should have fair compensation for his products, the mechanic should also have justice in purchasing the necessaries of life. If the principles of official integrity and economy, and the principles of fair dealing and mutual protection between producers and dealers, which the Prophet taught at this time, could have general acceptance and obedience throughout the world, what a wonderful stride would be taken toward the social redemption of the human race! Politics would be purified—for only men of integrity and nobility of character could or would hold office. Pauperism, that fruitful source of crime, would be practically unknown. Public economy and private prosperity would go hand in hand. On the 2nd day of March, 1843, the House of Representatives of the Illinois Legislature took up a bill to repeal a part of the Nauvoo city charter. There was a determination on the part of the majority to push the bill to its passage; and all the protests of a few fair-minded and courageous men availed nothing. Representative Thomas B. Owen compared the charter of Nauvoo with those of other cities and showed that this bill proposed to repeal the same powers in the Nauvoo charter which existed in every other charter in the state. He declared positively of his own knowledge that good order and industry characterized the \"Mormons,\" and he made no doubt that they were much abused. He protested against such a malicious and contemptible course of cowardice as that which was proposed. Next day the bill was put upon its passage; and William Smith of Nauvoo, who was a representative in the Assembly, moved an amendment to the title of the measure so that it would read—\"A bill for an act to humbug the citizens of Nauvoo.\" The motion created great sensation, in the midst of which William declared that he considered the amendment perfectly described the contents of the bill, and he was anxious that things should be called by their right names. Naturally the chair decided that such an amendment, \"not being respectful,\" was not in order, and the bill with its original title was then passed. On the 4th of March the Senate considered this same measure and refused to pass it. Hyrum brought information to the mayor on the evening of the 25th of March, 1843, upon which Joseph issued a proclamation as follows: Whereas it is reported that there now exists a band of desperadoes, bound by oaths of secrecy, under severe penalties in case any member of the combination divulges their plans of stealing and conveying properties from station to station, up and down the Mississippi and other routes: And Whereas it is reported that the fear of the execution of the pains and penalties of their secret oath on their persons prevents some members of said secret association (who have, through falsehood and deceit, been drawn into their snares), from divulging the same to the legally-constituted authorities of the land: Know ye, therefore, that I, Joseph Smith, Mayor of the City of Nauvoo, will grant and insure protection against all personal mob violence to each and every citizen of this city who will come before me and truly make known the names of all such abominable characters as are engaged in said secret combination for stealing, or are accessory thereto, in any manner. And I respectfully solicit the co-operation of all ministers of justice in this and the neighboring states to ferret out a band of thievish outlaws from our midst. Joseph was determined to protect Nauvoo from plunderers without, and from thieves within, and this determination expressed in the document just quoted was so vigorously enforced that the bad elements, in self protection, combined against him. This league was one of the factors in the culminating persecutions of his life. In the beginning of April the Prophet went to Ramus accompanied by Apostle Orson Hyde and William Clayton, to preach to the Saints there. Among many important utterances contained in his sermons of that time are these: When the Savior shall appear, we shall see Him as He is. We shall see that He is a man like ourselves; and that same sociality which exists among us here will exist among us there, only it will be coupled with eternal glory, which glory we do not now enjoy. (John 14:2, 3.) The appearing of the Father and the Son, in that verse, is a personal appearance; and the idea that the Father and the Son dwell in a man\u0027s heart is an old sectarian notion, and is false. In answer to the question, \"Is not the reckoning of God\u0027s time, angel\u0027s time, prophet\u0027s time, and man\u0027s time according to the planet on which they reside?\" I answer, yes. But there are no angels who minister to this earth but those who do belong or have belonged to it. The angels do not reside on a planet like this earth; but they reside in the presence of God, on a globe like a sea of glass and fire, where all things for their glory are manifest—past, present and future, and are continually before the Lord. The place where God resides is a great Urim and Thummim. This earth, in its sanctified and immortal state, will be made like unto crystal and will be a Urim and Thummim to the inhabitants who dwell thereon, whereby all things pertaining to an inferior kingdom, or all kingdoms of a lower order, will be manifest to those who dwell on it; and this earth will be Christ\u0027s. Then the white stone mentioned in Revelation 2:17, will become a Urim and Thummim to each individual who receives one, whereby things pertaining to a higher order of kingdoms, even all kingdoms, will be made known; and a white stone is given to each of those who come into the celestial kingdom, whereon is a new name written, which no man knoweth save he that receiveth it. The new name is the key word * * * * * * * Whatever principle of intelligence we attain unto in this life, it will rise with us in the resurrection; and if a person gains more knowledge and intelligence in this life through his diligence and obedience than another, he will have so much the advantage in the world to come. There is a law, irrevocably decreed in heaven before the foundations of this world, upon which all blessings are predicated; and when we obtain any blessing from God, it is by obedience to that law upon which it is predicated. The Father has a body of flesh and bones as tangible as man\u0027s; the Son also: but the Holy Ghost has not a body of flesh and bones, but is a personage of spirit. Were it not so, the Holy Ghost could not dwell in us. A man may receive the Holy Ghost, and it may descend upon him and not tarry with him. In May, while returning through Carthage from his mission to Ramus, Joseph dined with Stephen A. Douglas, who was there holding court. After dinner, the Prophet, at the request of Douglas, gave a minute history of the persecutions of the Saints in Missouri. The judge listened attentively and pronounced unstinted condemnation upon the conduct of Boggs and the other mobocrats of Missouri, and declared that they ought to be punished. Joseph concluded by saying that this wholesale plunder and extermination was a foul and corroding blot upon the fair fame of the Republic, the very thought of which would have caused the patriotic framers of the Constitution to hide their faces in sorrow and shame. He prophesied to Douglas: Judge, you will aspire to the presidency of the United States, and if you ever turn your hand against the Latter-day Saints, you will feel the weight of the hand of the Almighty upon you; and you will live to see and know that I have testified the truth to you, for the conversation of this day will be with you through life. These words of the Prophet to Judge Douglas have been fulfilled to the very letter. Douglas did aspire to the presidency of the United States; he did use his influence against the Latter-day Saints thinking he could gain popularity by so doing; and he miserably failed. He was deserted by his own friends, and died a disappointed man. Commencing on the first day of the fourteenth year of the Church of Jesus Christ of Latter-day Saints, a special conference was held on the floor of the temple at Nauvoo. In presenting the authorities of the Church, the Prophet asked the people if they were satisfied with the First Presidency. \"If,\" said he, \"I have done anything to injure my standing or dishonor our religion in the sight of angels, or men, or women, I am sorry for it. I do not know that I have done anything of the kind; but if I have, come forward and tell me of it.\" Joseph wanted the Saints to feel that every officer of the Church, from the President down to the least in authority, was responsible to the body of the Saints, as well as to God, for his conduct; and thereby established a rule which was of great help at a later time. Brigham Young made the motion to sustain Joseph Smith as President of the whole Church, and one vast sea of hands was presented, carrying the motion unanimously. At this conference Apostle Orson Pratt remarked that a man\u0027s body changes every seven years; and Joseph replied: There is no fundamental principle belonging to a human system that ever goes into another in this world or in the world to come; I care not what the theories of men are. We have the testimony that God will raise us up, and He has the power to do it. If anyone supposes that any part of our bodies, that is, the fundamental parts thereof, ever goes into another body, he is mistaken. * * * * * A special conference of the Elders was convened on the 10th day of April, 1843, to ordain missionaries to go forth into the vineyards and build up churches; and one hundred and fifteen appointments were made by the united voice of the conference. On the 12th of April two large parties of Saints landed at Nauvoo under the charge of Elders Lorenzo Snow, Parley P. Pratt and Levi Richards. On the day following, the emigrants and a great multitude of others assembled at the temple to listen to an address from the Prophet to the new comers. He advised them concerning their temporal welfare, their means of life; and pronounced the blessings of heaven and earth upon them, inasmuch as they should keep the commandments of God. The lull in the active persecution against the Prophet was soon at an end. His enemies never for an instant contemplated the relinquishment of their purpose to carry him into Missouri to be assassinated. Threats came to him from time to time, the low mutterings which precede the crash of a thunderbolt. He applied to the governor of Iowa to recall the writs issued against him upon requisitions from Missouri, so that he might visit the Saints in Zarahemla, basing his request upon the action taken by Judge Pope at Springfield, which substantiated the illegality of Missouri\u0027s demand. But his request was in vain, and he was obliged to risk his liberty and his life whenever duty called him to the Iowa side of the river. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3320/90968.html","bookId":395,"book":{"id":395,"title":"The Life of Joseph Smith the Prophet","description":"简介： Joseph and Hyrum are now dead; but like the first martyr they yet speak. Their united voice is one of testimony, admonition and warning to the world.They lived men of God. They died pure and holy, sealing their testimony with their blood.No men ever...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3320","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
