{"id":32792,"no":66,"title":"CHAPTER LXI.","content":"THE FIRST AND ONLY ISSUE OF THE NAUVOO \u0027EXPOSITOR\u0027—ITS MURDEROUS PURPOSE—REMOVAL OF A NUISANCE AND ERADICATION OF ITS CAUSE—TRIAL OF THE MAYOR AND OTHERS, AND THEIR ACQUITTAL IN AN HONEST COURT— GATHERING OF THE MOBS—THREATS OF EXTERMINATION—NAUVOO UNDER MARTIAL LAW. The publishers deem it a sacred duty they owe to their country and their fellow-citizens to advocate, through the columns of the Expositor, the unconditional repeal of the Nauvoo city charter. This was one of the statements in the prospectus for a newspaper to be issued at Nauvoo by the Laws, Higbees and Fosters. These men had been excommunicated from the Church for their personal impurity and for plotting murder. With their wickedness exposed to the gaze of the world they had no longer any reputation at stake; they associated with gamblers, counterfeiters and thieves; and their great desire was, by every means in their power, fair or foul, to injure their former brethren. The charter of a city is inestimable to the citizens. Without it rapid advancement is difficult if not impossible. Nauvoo had grown into prominence, and gave promise of becoming an important commercial and industrial center. The apostates knew well the vital point at which to direct their blow. Not only would they paralyze every industry by securing the repeal of the charter, but they would turn the city over to the dictation of hostile county and state officials; so that financial ruin and personal distress would be inflicted upon many of the people. To this end, they leagued themselves with kindred spirits whose evil efforts they could rely upon. The class of allies which they secured is shown by the fact that one of their associates was known to them, and was afterwards proved, to be a fugitive murderer. Among the minor purposes avowed in this prospectus for the issuance of the newspaper, was the advocacy of the pure principles of morality. This was a high sounding pretense to create favor abroad. The Laws, the Higbees and the Fosters cared nothing for morality, except to abuse it. With them it was but a cloak. They had become accustomed to use it for a covering for vile purposes. This was not the first time nor this the last, when evil men—cast out by the Church for sexual sin—made great pretense in print of their morality and sought to charge offenses upon men faithful and pure. They announced that they would exercise \"the freedom of speech in Nauvoo, independent of the ordinances abridging the same;\" and that the end would justify the means. The only restriction upon speech in Nauvoo was the forbidding of slander and immorality, and unless these men had intended to work evil with their paper they need not have promised to transgress the law. But their purpose was not to convince the people of Nauvoo; it was to create sentiment abroad and to this end slander and falsehood were necessary. They were not the first men shrewd enough to see that the publication, within any city, of statements adverse to the community would be accepted abroad as current fact. Their plan was devised with satanic ingenuity: If the Expositor were allowed to print its defamations and falsehoods unchecked, the world would believe that all they said was true, and overwhelming sentiment would be created against Nauvoo and its people; if their press was stayed in its crime, they would cry that freedom of speech was assailed—and nothing appeals more quickly to the sympathy of Americans than this same cry, whether it is uttered sincerely or only by wretches who want license to traduce and defame innocence. There was no disposition to restrain these publishers from printing their paper in Nauvoo. Their announcement was made on the 10th of May, 1844; they brought press and materials into the city, and began their work with as much protection and safety as any other publisher there. On the 7th of June next, they were prepared to put forth the first number of the paper. All at once a fear came upon them. They knew the man whom they wished to make their chief victim—Joseph Smith; they knew his truth, dignity and strength; they knew that he would not supinely submit to the ruin of the city and the defamation of its good men and women by such wretches as these publishers were known to be; they knew that if they committed crime they would be called to answer for it if the Prophet lived. So on the very day that the paper was to come forth burdened with lies, Robert D. Foster went to the mansion and demanded a private interview with Joseph. He asked the Prophet to go away with him alone, pretending that he wished to return to the Church and wanted to confer upon that subject. Joseph refused to talk except in the presence of witnesses, for this man Foster had often before misrepresented the Prophet\u0027s words. Joseph said to him that there was but one condition upon which he might return and that was to repent and to make restitution as far as possible. While they stood talking Joseph put his hand upon Foster\u0027s vest and said: \"What have you concealed there?\" Foster stammered in reply: \"It\u0027s my pistol.\" He would have lied, but under that piercing glance his bravado deserted him, and he was compelled to acknowledge the fact. The reason of his visit was soon made plain, and it was made plainer at a later time by the testimony of unimpeachable witnesses, Saints and strangers alike. He had not come to seek forgiveness and restoration of fellowship; he had not come to make amends. He had come to lure Joseph away to his death. His party had sworn to slay the Prophet, and every attempt up to this time had failed. The situation was desperate for the plotters. They were about to commit a flagrant violation of the law, and the one man whom they most feared as the defender and executor of law was the mayor of the city. If they could have taken Joseph away where his assassination could have been accomplished without the instant capture of his murderer, they believed that safe refuge could be found in the bosom of the waiting mob at Carthage and other places. Joseph smiled upon the craven wretch, and told him to bring his witnesses if he desired and they would confer concerning his restoration to fellowship. This, Foster willingly promised and left the mansion, saying that he would return with his friends immediately. He never came back. His answer was to send forth the Expositor, edited by Sylvester Emmons, reeking with libel and fulfilling its promise to override the law in its determination to deal a death blow at the city of Nauvoo. Naturally the inhabitants were enraged. Citizens said: If these men do not like Nauvoo, why do they continue to reside here? The repeal of the charter means the financial and social ruin of the city. This would despoil us without benefiting these men, except by the gratification of vengeful hate. It would have been easy in that state of public feeling to incite an attack upon the paper or its publishers. But the leading men remained cool and counseled strict observance of law. Let this be remembered; for it shows that Joseph was never willing to meet evil with evil; that he would rather suffer wrong than to do wrong; and that his appeal was always made to law and justice instead of passion. And let it be remembered that not only then but afterward through all the difficulties which followed closely upon the publication of the Expositor, the lives of the Laws, the Higbees and the Fosters were as safe in Nauvoo as they would have been in Carthage, Springfield or Washington. Three days later, June 10, at a meeting of the city council the Expositor was declared a public nuisance and was ordered to be abated. Under the resolution to this effect the marshal was ordered to proceed as he would for the removal of any other nuisance—he was to eradicate it. If a vile odor assail the nostrils of decent people, the only effectual remedy is to abolish the cause; and such was the course pursued in this case. Marshal John P. Greene with his assistants proceeded to the office of the Expositor and destroyed the press and pied the type. This was summary action; but it was legal. It was the only remedy for any public or private wrong inflicted by the Expositor. Its publishers were impecunious. Suits for private redress or fines for public recompense would have been unavailing; while the imprisonment of the publishers would have been heralded as a still greater wrong against the freedom of the press than was the destruction of the offending materials. Immediate events showed that the league to ruin Nauvoo by newspaper lies was widely extended, for mobocratic excitement outside of Nauvoo arose on the instant, and wholesale and indiscriminate vengeance was threatened. And yet the destruction of an offending press was not new in Illinois. Thomas Ford was governor at this time, and in the awful crimes which closely followed he was the responsible participant. It is interesting, therefore, to note what he said of a similar destruction of an unpopular press and type, at another time and in another community. In the history of Illinois, published after his death to get bread for his destitute children, he details the proceedings of the Alton mob. In 1837, Reverend Elijah P. Lovejoy, of the Presbyterian church, published the Alton, Illinois, Observer as a religious paper, in which slavery was opposed. Abolitionism was not popular there and to quote Ford\u0027s words: \"The people assembled and quietly took the press and type and threw them into the Mississippi. It now became manifest to all rational men that the Alton Observer could no longer be published in Alton as an abolition paper. The more reasonable of the abolitionists themselves thought it would be useless to try it again. However, a few of them, who were most violent seemed to think that the salvation of the black race depended upon continuing the publication at Alton.\" Certain members of the Presbyterian church determined to continue this paper. One of the principal men engaged in the movement to re-establish the Observer was Reverend Mr. Beecher, president of Illinois college; and of him Ford says: \"Mr. Beecher was a man of great learning and decided talents; but he belonged to the class of reformers who disregard all considerations of policy and expediency. He believed slavery to be a sin and a great evil, and his indignant and impatient soul could not await God\u0027s own good time to overthrow it, by acts of His providence working continual change and revolution in the affairs of men.\" A new press was bought, and it was determined that Lovejoy, who was very objectionable to the rabble, should continue as editor. After the arrival of the press it was guarded in a warehouse; but the mob gathered and demanded its possession. Ford speaks of the protectors of the press as being converted into demons of obstinacy. A fight occurred, the mob being the first assailants. Lovejoy and one of the mobocrats were killed; other men were wounded. The press was seized and, like the other, it was thrown into the river—although not a single copy of the paper had yet been printed with these materials. No man was punished for this crime of abolishing a free press at the expense of murder. Thus it will be seen that the will of a community, in other parts of Illinois, was considered sufficient without legal process to secure the extinction of an obnoxious paper and the perpetual silence of its editor—the silence of death by assassination. In Nauvoo no such highhanded course was pursued: no man was injured in his person; and the destroying of the press was in pursuance of a municipal order. At Alton, the unpopular publishers advocated merely a national reform, in the highest interest of human liberty and morality; at Nauvoo the publishers attacked the most vital local well-being and assailed the character of the community for the purpose of advancing an immoral purpose and gratifying the revenge of lustful men. At Nauvoo, the publishers had practically avowed their intention to incite a mob to come upon the city; and the matter printed in the first and only issue of their paper was manifestly of a character to aid the sanguinary plot. There had not been the slightest excitement or unnecessary noise in the act of removing the nuisance, and this done the people of the city drew a breath of relief. The Expositor had been an invitation to the gathering mobs of Hancock County to descend upon Nauvoo and injure its people and property. It had been calculated to inflame the worst passions of lawless men and to produce murder. In its suppression the people felt that only ordinary prudence and official vigor had been shown. To allay any possible excitement the mayor issued a proclamation in which he detailed the destruction by municipal order of the Expositor press and type, and called upon every citizen to keep the peace by being cool, considerate, virtuous, unoffending, manly and patriotic. The villains who had published the paper threatened everything in the city with destruction. One of their sympathizers declared that he would wade to his knees in blood; others said that the city should be wiped out before \"ten suns had set.\" They sent runners out in all directions to bring the mob upon Nauvoo. A little after noon on the 12th day of June, Constable David Bettisworth came to Nauvoo from Carthage with a warrant for the arrest of Joseph Smith, Samuel Bennett, John Taylor, William W. Phelps, Hyrum Smith, John P. Greene, Stephen Perry, Dimick B. Huntington, Jonathan Dunham, Stephen Markham, William Edwards, Jonathan Harmon, Jesse P. Harmon, John Lytle, Joseph W. Coolidge, Harvey D. Redfield, Porter Rockwell and Levi Richards, upon a complaint sworn to by Francis M. Higbee charging the parties named with committing a riot. The writ was issued by Thomas Morrison, justice of the peace at Carthage, and commanded the officer to bring the parties named before Morrison or some other justice of the peace within the county. Bettisworth immediately upon arriving at Nauvoo served this warrant upon Joseph and afterwards upon the others named therein. Joseph called his attention to the clause in the writ, \"before me or some other justice of the peace of said county,\" and demanded to be taken before Esquire Johnson or some other justice of the peace in Nauvoo. Hyrum made the same demand. Many people were present, and Joseph and Hyrum called upon them to witness that they offered themselves in answer to the writ to go forth before the nearest justice of the peace. This was strictly in accordance with law; but it did not answer the purpose of the mobocrats either at Nauvoo or Carthage, and Bettisworth said: \"I will be damned but I will carry you before Justice Morrison at Carthage.\" As he still held them in custody and was determined to drag them away from Nauvoo, Joseph sued out a writ of habeas corpus in the municipal court, and upon the full showing there he was discharged. Later all the other brethren named in the writ took the same course, and secured their release. On the 14th of June the mayor addressed a letter of explanation to Governor Ford, in which the entire proceedings against the Expositor were fairly detailed. Joseph stated to the governor that if Ford was not satisfied that the whole transaction had been in accordance with the strictest principles of law and the requirements of good order, he would only have to write his wishes and the mayor and all persons participating in the suppression of the Expositor would go before Judge Pope or any legal tribunal at the capital and submit to judicial investigation. They would not even trouble his Excellency to send a writ or an officer, but would respond promptly to any letter advising them of his wish. Other men in Nauvoo, some of them prominent visitors there, wrote to Ford at the same time, declaring that no excitement had prevailed, that the proceedings had been calmly and legally taken, and that the action of the municipality in ridding itself of such a menace to peace and life was entirely commendable. On the 16th day of June, Judge Jesse B. Thomas came to Nauvoo and advised the mayor and the other men named in Morrison\u0027s warrant to go before some justice of the peace in the county and be examined upon the charge named therein. Judge Thomas said that if they would do this and should be acquitted or bound over, all excitement would be allayed, the mob would be left without a pretext, and he himself would be bound to compel the mobocrats to keep the peace. Joseph and his brethren expressed their readiness to submit to any fair investigation. The next day, upon the complaint of W. G. Ware, they were arrested by Constable Joel S. Miles, on a writ issued by Daniel H. Wells for a riot in destroying the Nauvoo Expositor press. They all submitted to this process, and went before Justice Wells, who, at this time, it must be remembered, was not a member of the Church. After a long and close examination, it appeared to the court that they had not proceeded illegally, and they were discharged. As mobs in various parts of the county continued to menace Nauvoo, the Prophet sent several letters and messengers to keep the governor informed. Samuel James went to Springfield on the 15th of June, and Edward Hunter with Philip B. Lewis and John Bills went on the 17th. To Elder Edward Hunter, Joseph said as he was leaving: \"I charge you solemnly to tell the governor everything you know concerning me, good or bad.\" The most outrageous falsehoods were being circulated to inflame the people against Nauvoo. Upon this point Governor Ford, in his history of Illinois, says: A system of excitement and agitation was artfully planned [by the mob leaders] and executed with tact. It consisted in spreading reports and rumors of the most fearful character. As examples:—On the morning before my arrival at Carthage, I was awakened at an early hour by the frightful report, which was asserted with confidence and apparent consternation, that the Mormons had already commenced the work of burning, destruction and murder; and that every man capable of bearing arms was instantly wanted at Carthage for the protection of the country. We lost no time in starting; but when we arrived at Carthage we could hear no more concerning this story. Again: During the few days that the militia were encamped at Carthage, frequent applications were made to me to send a force here and a force there, and a force all about the country, to prevent murders, robberies and larcenies, which, it was said, were threatened by the Mormons. No such forces were sent, nor were any such offenses committed at that time, except the stealing of some provisions, and there was never the least proof that this was done by a Mormon. Again: On my late visit to Hancock County, I was informed, by some of their violent enemies, that the larcenies of the Mormons had become unusually numerous and insufferable. They indeed admitted that but little had been done in this way in their immediate vicinity, but they insisted that sixteen horses had been stolen by the Mormons in one night, near Lima, in the county of Adams. At the close of the expedition, I called at this same town of Lima, and upon inquiry was told that no horses had been stolen in that neighborhood, but that sixteen horses had been stolen in one night in Hancock County. The last informant being told of the Hancock story, again changed the venue to another distant settlement in the northern edge of Adams. * * * * * Occasional threats came to my ears of destroying the city and murdering or expelling the inhabitants. * * * * * Frequent appeals had been made to me to make a clean and thorough work of the matter by exterminating the Mormons. The Warsaw Signal, edited by an infamous man by the name of Thomas Sharp, took a prominent and diabolical part in arousing the spirit of murder. It published the minutes of mob meetings and resolutions adopted there, in which the most fiendish threats were made. Some of them are as follows: We therefore declare that we will sustain our press and the editor at all hazards; that we will take full vengeance, terrible vengeance, should the lives of any of our citizens be lost in the effort; that we hold ourselves at all times in readiness to co-operate with our fellow-citizens in this state, Missouri and Iowa, to exterminate, utterly exterminate the wicked and abominable Mormon leaders, the authors of our troubles. Resolved, That a committee of five be appointed forthwith to notify all persons in our township suspected of being the tools of the Prophet to leave immediately on pain of instant vengeance. And we do recommend the inhabitants of the adjacent townships to do the same, hereby pledging ourselves to render all the assistance they may require. Resolved, That the time, in our opinion has arrived, when the adherents of Smith, as a body, should be driven from the surrounding settlements into Nauvoo. That the Prophet and his miscreant adherents should then be demanded at their hands; and, if not surrendered, a war of extermination should be waged, to the entire destruction, if necessary for our protection, of his adherents. And we do hereby recommend this resolution to the consideration of the several townships, to the mass convention to be held at Carthage, hereby pledging ourselves to aid to the utmost the complete consummation of the object in view, that we may thereby be utterly relieved of the alarm anxiety and trouble to which we are now subjected. Resolved, That every citizen arm himself to be prepared to sustain the resolutions herein contained. It was further resolved that a deputation be sent to Springfield to solicit executive help, but the intention was expressed not to allow the mob movements to be retarded by this action. The mobs at Warsaw and Carthage pretended to believe that the destruction of the Warsaw Signal office had been threatened by Hyrum Smith. The statement to this effect was of a piece with the lies told to the governor. No threat had been made against the Signal office or the editor, and the mob well knew that any attack from the citizens of Nauvoo upon anybody in Carthage or Warsaw was out of the question. The mail communications of the Saints were cut off with the connivance of officials. A company of the mob numbering three hundred, began training at Carthage on the 13th day of June. Arms were brought to Warsaw and Carthage from Quincy and other places. On the 17th of June, fifteen hundred Missourians were reported to have crossed the river and joined the rabble at Warsaw. Five pieces of artillery had already been brought to the latter place. From Warsaw the mob forces were to proceed to Carthage and join the Quincy Grays and other companies from Adams County. Scattering from here it was their purpose to seize the arms of all the Saints in Hancock County, outside of Nauvoo, and compel them to recant their faith or be exterminated. They declared that they would take Joseph and Hyrum and the city council from Nauvoo on Thursday, the 20th of June, and deliver them up to sacrifice. If any resistance were offered, the city would be shelled and all the inhabitants slaughtered or driven away. One of the mob leaders was Levi Williams, a colonel of militia and a Baptist preacher, and to such as he was due the attempt to make the Saints recant. No word came from the governor. Was the city to be left to massacre, pillage, ravishment, like Far West! Forbid it, Heaven! Under these circumstances, nothing remained but to prepare for resistance—not attack, only defense. The mayor, on the 18th of June, 1844, declared the city of Nauvoo under martial law, and called out the Legion to protect the city from rapine and its people from massacre by the mob. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3320/90974.html","bookId":395,"book":{"id":395,"title":"The Life of Joseph Smith the Prophet","description":"简介： Joseph and Hyrum are now dead; but like the first martyr they yet speak. Their united voice is one of testimony, admonition and warning to the world.They lived men of God. They died pure and holy, sealing their testimony with their blood.No men ever...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3320","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
