{"id":19451,"no":30,"title":"CHAPTER XXX THE SECRET PASSAGE","content":"THAT night was one of rest. I was physically tired out, and after I had posted a few letters to merchants in Aberdeen, giving orders for various goods to be sent at once to Whinnyfold, I went to bed and slept till the early morning. I got up at daylight, and after my morning swim rode off to Crom. Again I left my bicycle in the wood and took my way round to the back of the hill and up through the wood to the monument beyond the reservoir. It was still early morning, as it is counted in the cities, though the sun was well up. I went with extra caution, stealing from tree to tree; for I knew nothing of the locality of the watchers at this hour. I saw no sign of anyone; and coming at last to where the rudimentary pathway lay, examined carefully where I had placed the first thread. As I did so I straightened myself quickly and looked round with apprehension. The thread was broken across, though the two ends were tied where I had placed them! With a beating heart I examined all the others in turn, with the same result. It was quite evident that some one, or some thing had passed along the track. In spite of my concern I rejoiced, for something had been found. It was at least probable that there was a regular route somewhere at hand. Accordingly I prepared my traps afresh, this time placing them in various directions, and at irregular distances along the path and all round the[245] monument. I might thus be able to trace the exact route of anyone who might disturb them. This done, and it took some time, I went back to the wood, and thence rode to the castle. Marjory was eager for news, but it thrilled me to see that her eagerness was not all from this cause; hour by hour I found myself growing in her affection. When I told her of the broken threads, she clapped her hands with delight; the hunter spirit hereditary in her was pleased. She gave her opinion that on the next morning I should be able to locate the entrance to the passage, if one there was. In the midst of her speaking thus she stopped; a bright, keen light came into her eyes, and her brows knitted. “Why,” she said, “how stupid I am. I never once thought of doing the same at my end. Yesterday, after you left, I spent an hour in the old chapel and went over every inch of it; but it never occurred to me to do there what you had gone to do at the monument. If I had done so, I might this morning have been able to discover the secret of the disappearance of the kidnappers. I shall take good care to do it this evening.” While she was speaking a fear grew upon me lest being alone in the ruin she might give her enemies the very opportunity they wanted. She saw my distress, and with her quick woman’s wit guessed the cause of it. With a very tender movement she placed her hand on the back of mine, and without squeezing it held it there firmly as she said: “Don’t be frightened for me, dear. These are expert workmen that we are dealing with. They won’t move till their plans are all ready. They don’t wish to get hold of me for five minutes and let “Mac’s men”—as lacking due respect for President McKinley, they call the Secret Service agents of my country—catch them red-handed.[246] They are only laying their plans as yet. Perhaps we may have cause to be anxious when that is done; but as yet it’s all right. Anyhow, my dear, as I know it will make you easier in your mind, when you are not at hand to protect me, I shall lay the traps whilst you are with me. There now! Am I good to my husband, or am I not?” I made her aware in my own way—I could not help it—that she was good! and she let the incident pass unrebuked. Even lovers, though they have not the status of the husband, must be allowed a little latitude now and again. We talked over all the possibilities that we could either of us think of with regard to a secret passage between the castle and the monument. It was apparent that in old time such a hidden way might have been of the utmost importance; and it was more than possible that such a passage might exist. Already we had reason to believe that there was a way between the ruined chapel and the top of the reservoir hill, and we knew that there must be existing some secret hiding place gained from the interior of the chapel. What we had still to discover, and this was the most important of all, was whether there was a method of communication between the castle and the chapel. After tea we started out together; and as we had arranged between us before starting, managed in our strolling to go quite round the castle and through many of the grassy alleys between the woods. Then, lest there should be any listener, I said: “Let us go into the old chapel. I haven’t had a good look at it since I have been coming here!” So we went into the chapel and began to lay our traps. Of course we could not guard against any one spying upon us. There might be eyes of enemies bent on us through some secret chink or cranny or organised spy-hole. This we could not help, and had to take our chances of it; but if anyone were[247] within ear-shot and unable to see us, we guarded our movements by our misleading remarks concerning history and art. Deftly Marjory stretched sections of her gossamer thread from place to place, so that if any one went in the chapel their course must be marked by the broken threads. We finished near the door, and our artless, innocent, arch?ological conversation stopped there, too. We strolled back to the castle, feeling sure that if there were any secret hiding place within the ruin we should have located the entrance to it in the morning. That afternoon I went to the house at Whinnyfold. Most of the things which I had ordered had arrived, and when I had had the various boxes and bundles moved inside I felt able to start on my work. First I rigged up a proper windlass over the hole into the cave; and fixed it so that any one could manipulate it easily and safely from above. It could be also worked from below by aid of an endless chain round the axle. I hammered the edges of the hole somewhat smoother, so that no chance friction might cut the rope; and I fixed candles and lanterns in various places, so that all the light which might be necessary could be had easily. Then I furnished a room with rugs and pillows, and with clothes for Marjory for changing. She would be sure to require such, when our search after the treasure should come off. I had ready some tins of provisions, and I had arranged at the hotel that as I might sometimes stay and work in my own home—I was supposed to be an author—some fresh provisions were to be sent over each morning, and left ready for me with Mrs. Hay at Whinnyfold. By the time my work was through, it was late in the evening, and I went to the hotel to sleep. I had arranged with Marjory to be with her early in the morning. It was hardly daylight when I woke, but I got up at once and took my way towards Crom, for the experience of the[248] day before had shown me that whoever used the path near the monument used it in the grey of the dawn. As usual I hid my bicycle and took my way cautiously to the monument. By this time the sun was up and the day was bright; the dew lay heavy, and when I came on any of my threads I could easily distinguish them by the shimmering beads which made each thread look like a miniature rope of diamonds. Again the strings across the path were broken. My heart beat heavily as I began to follow back towards the monument the track of the broken thread. It led right up to it, on the side away from the castle, and then stopped. The other threads all round the monument were intact. Having learned so much, my first act was to prevent discovery of my own plan. Accordingly I carefully removed all the threads, broken and unbroken. Then I began to make minute investigation of the monument itself. As it was evident that whoever had broken the threads had come straight from it, there was a presumption that there was an opening somewhere. The rock below was unbroken and the stonework was seemingly fixed on the rock itself. By a process of exclusions I came to the belief that possibly the monument itself might be moveable. Accordingly I began to experiment. I pressed against it, this way and that. I tried to move it by exercising pressure top and bottom in turn; but always without avail. Then I began to try to move it sideways as though it might be on a pivot. At first there was no yielding, no answer of any kind to my effort; but suddenly I thought I perceived a slight movement. I tried again and again, using my strength in the same way; but with no result. Then I tried turning it in the suspected direction, holding both my hands low down on the corners of the boulder; then going gradually up higher I pursued the[249] same effort; again no response. Still I felt I was on the track and began to make efforts in eccentric ways. All at once, whilst I was pressing with my left hand low down whilst I pulled with my right high up on the other edge, the whole great stone began to move in a slow easy way, as though in perfect poise. I continued the movement and the stone turned lazily over on one side, revealing at my very feet a dark opening of oval form some three feet across its widest part. Somehow I was not altogether surprised; my head kept cool in what was to me a wonderful way. With an impulse which was based on safety, lest the opening of the hole should make discovery of my presence, I reversed the action; and the stone rolled slowly over to its old position. Several times I moved it from its place and then back again, so that I might become accustomed to its use. For a while I hesitated as to whether I should explore the opening immediately; but soon came to the conclusion that I had better begin at once. So I went back to my bicycle and took the lamp with me. I had matches in my case, and as I had the revolver which I always carried now, I felt equal to any emergency. I think I was finally influenced in my decision to attempt the passage at once by the remembrance of Marjory’s remark that the kidnappers would make no effort until their plans were quite complete. They, more than I, might fear discovery; and on this hope I was strong as I lowered myself down through the narrow opening. I was glad to see that there was no difficulty in moving the stone from the inside; there were two iron handles let into the stone for the purpose. I cannot say I was at ease in my mind, I was, however, determined to go on; and with a prayer to God for protection, and a loving thought of Marjory, I went on my way. The passage was doubtless of natural origin, for it was[250] evident that the seams in the rock were much like those on the coast where the strata of different geological formations joined. Art had, however improved the place wonderfully. Where the top had come too low it had been quarried away; the remnants still lay adjacent where the cave broadened out. The floor where the slope was steep was cut into rough steps. Altogether, there were signs of much labour in the making of the passage. As I went down, I kept an eye on the compass whenever I came to a turn, so that I might have a rough idea of the direction in which I was going. In the main the road, with counterbalancing curves and angles, led straight down. When I had got to what I considered must be half way, allowing for the astounding magnitude which seems to be the characterisation of even a short way under ground; the passage forked, and at a steep angle another passage, lower and less altered than that along which I had come, turned away to the left. Going a few feet up it I could hear the sound of running water. This was evidently the passage to the reservoir. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3230/88338.html","bookId":687,"book":{"id":687,"title":"The Mystery of the Sea","description":"简介： I HAD just arrived at Cruden Bay on my annual visit, and after a late breakfast was sitting on the low wall which was a continuation of the escarpment of the bridge over the Water of Cruden. Opposite to me, across the road and standing under the only...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3230","creation":"Aug 1, 2019 12:19:09 AM","modification":"Aug 1, 2019 12:19:09 AM"}}
