{"id":9582,"no":34,"title":"31. The Promise of America","content":"For four years George Webber lived and wrote in Brooklyn, and during all this time his life was about as solitary as any that a modern man can know. Loneliness, far from being a rare and curious circumstance, is and always has been the central and inevitable experience of every man. Not only has this been true of the greatest poets, as evidenced by the huge unhappiness of their published grief, but now it seemed to George to apply with equal force to all the nameless cyphers who swarmed about him in the streets. As he saw them in their strident encounters with each other, and overheard their never-varying exchanges of abuse, contempt, distrust, and hatred, it became increasingly clear to him that one of the contributing causes of their complaint was loneliness. \\n\\n \\n\\n To live alone as George was living, a man should have the confidence of God, the tranquil faith of a monastic saint, the stern impregnability of Gibraltar. Lacking these, he finds that there are times when anything, everything, all and nothing, the most trivial incidents, the most casual words, can in an instant strip him of his armour, palsy his hand, constrict his heart with frozen horror, and fill his bowels with the grey substance of shuddering impotence and desolation. Sometimes it would be a sly remark dropped by some all-knowing literary soothsayer in the columns of one of the more leftish reviews, such as: \\n\\n \\n\\n “Whatever has become of our autobiographical and volcanic friend, George Webber? Remember him? Remember the splash he made with that so-called ‘novel’ of his a few years back? Some of our esteemed colleagues thought they detected signs of promise there. We ourselves should have welcomed another book from him, just to prove that the first was not an accident. But tempus fugit, and where is Webber? Calling Mr. Webber! No answer? Well, a pity, perhaps; but then, who can count the number of one-book authors? They shoot their bolt, and after that they go into the silence and no more is heard from them. Some of us who were more than a little doubtful about that book of Webber’s, but whose voices were drowned out by the Oh’s and Ah’s of those who rused headlong to proclaim a new star rising in the literary firmament, could now come forward, if we weren’t too kindly disposed towards our more emotional brethren of the critical fraternity, and modestly say: ‘We told you so!’” \\n\\n \\n\\n Sometimes it would be nothing but a shadow passing on the sun, sometimes nothing but the gelid light of March falling on the limitless, naked, sprawling ugliness and squalid decencies of Brooklyn streets. Whatever it was, at such a time all joy and singing would go instantly out of day, Webber’s heart would drop out of him like a leaden plummet, hope, confidence, and conviction would seem lost for ever to him, and all the high and shining truth that he had ever found and lived and known would now turn false to mock him. Then he would feel like one who walked among the dead, and it would be as if the only things that were not false on earth were the creatures of the death-inlife who moved for ever in the changeless lights and weathers of red, waning, weary March and Sunday afternoon. \\n\\n \\n\\n These hideous doubts, despairs, and dark confusions of the soul would come and go, and George knew them as every lonely man must know them. For he was united to no image save that image which he himself created. He was bolstered by no knowledge save that which he gathered for himself out of his own life. He saw life with no other vision save the vision of his own eyes and brain and senses. He was sustained and cheered and aided by no party, was given comfort by no creed, and had no faith in him except his own. \\n\\n \\n\\n That faith, though it was made up of many articles, was at bottom a faith in himself, a faith that if he could only succeed in capturing a fragment of the truth about the life he knew, and make it known and felt by others, it would be a more glorious accomplishment than anything else he could imagine. And through it all, animating this faith and sustaining it with a promise of rewards to come, was a belief — be it now confessed — that if he could only do this, the world would thank him for it, and would crown him with the laurel of its fame. \\n\\n \\n\\n The desire for fame is tooted in the hearts of men. It is one of the most powerful of all human desires, and perhaps for that very reason, and because it is so deep and secret, it is the desire that men are most unwilling to admit, particularly those who feel most sharply its keen and piercing spur. \\n\\n \\n\\n The politician, for example, would never have us think that it is love of office, the desire for the notorious elevation of public place, that drives him on. No, the thing that governs him is his pure devotion to the common weal, his selfless and high-minded statesmanship, his love of his fellow-man, and his burning idealism to turn out the rascal who usurps the office and betrays the public trust which he himself, as he assures us, would so gloriously and devotedly maintain. \\n\\n \\n\\n So, too, the soldier. It is never love of glory that inspires him to his profession. It is never love of battle, love of war, love of all the resounding titles and the proud emoluments of the heroic conqueror. Oh, no. It is devotion to duty that makes him a soldier. There is no personal motive in it. He is inspired simply by the selfless ardour of his patriotic abnegation. He regrets that he has but one life to give for his country. \\n\\n \\n\\n So it goes through every walk of life. The lawyer assures us that he is the defender of the weak, the guardian of the oppressed, the champion of the rights of defrauded widows and beleaguered orphans, the upholder of justice, the unrelenting enemy, at no matter what cost to himself, of all forms of chicanery, fraud, theft, violence, and crime. Even the business man will not admit a selfish motive in his money-getting. On the contrary, he is the developer of the nation’s resources. He is the benevolent employer of thousands of working men who would be lost and on the dole without the organising genius of his great intelligence. He is the defender of the American ideal of rugged individualism, the shining exemplar to youth of what a poor country boy may achieve in this nation through a devotion to the national virtues of thrift, industry, obedience to duty, and business integrity. He is, he assures us, the backbone of the country, the man who makes the wheels go round, the leading citizen, Public Friend No. 1. \\n\\n \\n\\n All these people lie, of course. They know they lie, and everyone who hears them also knows they lie. The lie, however, has become a part of the convention of American life. People listen to it patiently, and if they smile at it, the smile is weary, touched with resignation and the indifferent dismissals of fatigue. \\n\\n \\n\\n Curiously enough, the lie has also invaded the world of creation — the one place where it has no right at all to exist. There was a time when the poet, the painter, the musician, the artist of whatever sort, was not ashamed to confess that the desire for fame was one of the driving forces of his life and labour. But what a transformation from that time to this! Nowadays one will travel far and come back fruitless if he hopes to find an artist who will admit that he is devoted to anything except the service of some ideal — political, social, economic, religious, or aesthetic — which is outside himself, and to which his own humble fame-forsaking person is reverently and selflessly consigned. \\n\\n \\n\\n Striplings of twenty assure us that the desire for fame is naively childish, the fruit of an outworn cult of “romantic individualism”. From all the falseness and self-deception of this cult these young gentlemen tell us they are free — without troubling to explain, however, by what process of miraculous purgation they achieved their freedom. It took Goethe, the strongest soul of modern times, some three and eighty years to free his mighty spirit of this last infirmity. Milton, old and blind, forsaken, and past fifty, is said to have won free of it by the end of Cromwell’s revolution, in whose employment he destroyed his sight. And yet, can we be sure that even he was ever wholly clear, for what is the tremendous edifice of Paradise Lost except a man’s final and triumphant suit against eternity? \\n\\n \\n\\n Poor, blind Milton! \\n\\n \\n\\n Fame is the spur that the clear spirit doth raise (That last infirmity of Noble mind) To scorn delights, and live laborious dayes; But the fair Guerdon when we hope to find, And think to burst out into sudden blaze, Comes the blind Fury with th’abhorred shears, And slits the thin-spun life. But not the praise, Phoebus repli’d, and touch’d my trembling ears; Fame is no plant that grows on mortal soil, Nor in the glistering foil Set off to th’world, nor in broad rumour lies, But lives and spreds aloft by those pure eyes, And perfet witnes of all judging Jove; As he pronounces lastly on each deed, Of so much fame in Heav’n expect thy meed. \\n\\n \\n\\n Deluded man! Poor vassal of corrupted time! How fair a thing for us to know that we are not such men as he and Goethe were! We live in more stirring times, and our very striplings are secure in their collective selflessness. We have freed ourselves of all degrading vanities, choked off the ravening desire for individual immortality, and now, having risen out of the ashes of our father’s earth into the untainted ethers of collective consecration, we are clear at last of all that vexed, corrupted earth — clear of the sweat and blood and sorrow, clear of the grief and joy, clear of the hope and fear and human agony of which our father’s flesh and that of every other man alive before us was ever wrought. \\n\\n \\n\\n And yet, having achieved this glorious emancipation; having laid all petty dreams aside; having learned to think of life, not in terms of ourselves, but in terms of the whole mass; having learned to think of life, not as it is today, but as it is going to be five hundred years from now, when all the revolutions have been made, and all the blood has been shed, and all the hundreds of millions of vain and selfish little lives, each concerned with its own individual and romantic breath, have been ruthlessly wiped out in order to usher in the collective glory that such will be-having become marvellously and, as it were, overnight such paragons of collective selflessness and such scorners of the vanity of personal fame, is it not strange that though we have new phrases, yet their meaning is still the same? Is it not strange that, feeling only an amused and pitying contempt for those who are still naive enough to long for glory, we should yet lacerate our souls, poison our minds and hearts, and crucify our spirits with bitter and rancorous hatred against those who are fortunate enough to achieve fame? \\n\\n \\n\\n Or do we err? Are we mistaken in assuming that these words we read so often are really words of hatred, malice, envy, ridicule, and jeering mockery? Are we mistaken in assuming that the whole vocabulary of abuse which is exhausted every week in the journals of our red and pink-complexioned comrades — the sneers against a man’s talent, the bitter denials that his work has any substance, sincerity, truth, or reality whatever — is really what it seems to be? No doubt we are mistaken. It would be more charitable to believe that these pure spirits of the present day are what they say they are — collective, selfless, consecrated — and that the words they use do not mean what they seem to mean, and do not betray the romantic and deluded passions that seem to animate them, but are really words used coldly, without passion, for the purposes of collective propaganda — in operations completely surgical, whereby the language of the present day, with all its overtones of superstition, prejudice, and false knowledge, is employed clinically, scientifically, simply to further the Idea of the Future State! \\n\\n \\n\\n No more, no more! Of what avail to crush these vermin beneath our heavy boot? The locusts have no king, and lice will multiply for ever. The poet must be born, and live, and sweat, and suffer, and change, and grow, yet somehow maintain the changeless selfhood of his soul’s integrity among all the crawling fashions of this world of lice. The poet lives, and dies, and is immortal; but the eternal trifler of all complexions never dies. The eternal trifler comes and goes, sucks blood of living men, is filled and emptied with the surfeit of each changing fashion. He gorges and disgorges, and is never fed. There is no nurture in him, and he draws no nurture from the food he feeds on. There is no heart, no soul, no blood, no living faith in him: the eternal trifler simply swallows and remains. \\n\\n \\n\\n And we? Made of our father’s earth, blood of his blood, bone of his bone, flesh of his flesh — born like our father here to live and strive, here to win through or be defeated — here, like all the other men who went before us, not too nice or dainty for the uses of this earth — here to live, to suffer, and to die-O brothers, like our fathers in their time, we are burning, burning, burning in the night. \\n\\n \\n\\n Go, seeker, if you will, throughout the land and you will find us burning in the night. \\n\\n \\n\\n There where the hackles of the Rocky Mountains blaze in the blank and naked radiance of the moon, go make your resting stool upon the highest peak. Can you not see us now? The continental wall juts sheer and flat, its huge black shadow on the plain, and the plain sweeps out against the East, two thousand miles away. The great snake that you see there is the Mississippi River. \\n\\n \\n\\n Behold the gem-strung towns and cities of the good, green East, flung like star-dust through the field of night. That spreading constellation to the north is called Chicago, and that giant wink that blazes in the moon is the pendant lake that it is built upon. Beyond, close-set and dense as a clenched fist, are all the jewelled cities of the eastern seaboard. There’s Boston, ringed with the bracelet of its shining little towns, and all the lights that sparkle on the rocky indentations of New England. Here, southward and a little to the west, and yet still coasted to the sea, is our intensest ray, the splintered firmament of the towered island of Manhattan. Round about her, sown thick as grain, is the glitter of a hundred towns and cities. The long chain of lights there is the necklace of Long Island and the Jersey shore. Southward and inland, by a foot or two, behold the duller glare of Philadelphia. Southward farther still, the twin constellations — Baltimore and Washington. Westward, but still within the borders of the good, green East, that night-time glow and smoulder of hell-fire is Pittsburgh. Here, St. Louis, hot and humid in the cornfield belly of the land, and bedded on the mid-length coil and fringes of the snake. There at the snake’s mouth, southward six hundred miles or so, you see the jewelled crescent of old New Orleans. Here, west and south again, you see the gemmy glitter of the cities on the Texas border. \\n\\n \\n\\n Turn now, seeker, on your resting stool atop the Rocky Mountains, and look another thousand miles or so across moon-blazing fiend-worlds of the Painted Desert and beyond Sierras’ ridge. That magic congeries of lights there to the west, ringed like a studded belt round the magic setting of its lovely harbour, is the fabled town of San Francisco. Below it, Los Angeles and all the cities of the California shore. A thousand miles to north and west, the sparkling towns of Oregon and Washington. \\n\\n \\n\\n Observe the whole of it, survey it as you might survey a field. Make it your garden, seeker, or your backyard patch. Be at ease in it. It’s your oyster — yours to open if you will. Don’t be frightened, it’s not so big now, when your footstool is the Rocky Mountains. Reach out and dip a hatful of cold water from Lake Michigan. Drink it — we’ve tried it — you’ll not find it bad. Take your shoes off and work your toes down in the river oozes of the Mississippi bottom — it’s very refreshing on a hot night in the summer-time. Help yourself to a bunch of Concord grapes up there in northern New York State — they’re getting good now. Or raid that water-melon patch down there in Georgia. Or, if you like, you can try the Rockyfords here at your elbow, in Colorado. Just make yourself at home, refresh yourself, get the feel of things, adjust your sights, and get the scale. It’s your pasture now, and it’s not so big — only three thousand miles from east to west, only two thousand miles from north to south — but all between, where ten thousand points of light prick out the cities, towns, and villages, there, seeker, you will find us burning in the night. \\n\\n \\n\\n Here, as you pass through the brutal sprawl, the twenty miles of rails and rickets, of the South Chicago slums — here, in an unpainted shack, is a Negro boy, and, seeker, he is burning in the night. Behind him is a memory of the cotton-fields, the flat and mournful pineland barrens of the lost and buried South, and at the fringes of the pine another nigger shack, with mammy and eleven little niggers. Farther still behind, the slave-driver’s whip, the slave ship, and, far off, the jungle dirge of Africa. And before him, what? A roped-in ring, a blaze of lights, across from him a white champion; the bell, the opening, and all round the vast sea-roaring of the crowd. Then the lightning feint and stroke, the black panther’s paw — the hot, rotating presses, and the rivers of sheeted print! 0 seeker, where is the slave ship now? \\n\\n \\n\\n Or there, in the clay-baked piedmont of the South, that lean and tan-faced boy who sprawls there in the creaking chair among admiring cronies before the open doorways of the fire department, and tells them how he pitched the team to shut-out victory today. What visions burn, what dreams possess him, seeker of the night? The packed stands of the stadium, the bleachers sweltering with their unshaded hordes, the faultless velvet of the diamond, unlike the clay-balked outfields down in Georgia. The mounting roar of eighty thousand voices and Gehrig coming up to bat, the boy himself upon the pitching mound, the lean face steady as a hound’s; then the nod, the signal, and the wind-up, the rawhide arm that snaps and crackles like a whip, the small white bullet of the blazing ball, its loud report in the oiled pocket of the catcher’s mitt, the umpire’s thumb jerked upwards, the clean strike. \\n\\n \\n\\n Or there again, in the East–Side Ghetto of Manhattan, two blocks away from the East River, a block away from the gas-house district and its thuggery, there in the swarming tenement, shut in its sweltering cell, breathing the sun-baked air through opened window at the fire-escape, celled there away into a little semblance of privacy and solitude from all the brawling and vociferous life and argument of his family and the seething hive round him, the Jew boy sits and pores upon his book. In shirt-sleeves, bent above his table to meet the hard glare of a naked bulb, he sits with gaunt, starved face converging to his huge beaked nose, the weak eyes squinting painfully through his thick-lens glasses, his greasy hair roached back in oily scrolls above the slanting cage of his painful and constricted brow. And for what? For what this agony of concentration? For what this hell of effort? For what this intense withdrawal from the poverty and squalor of dirty brick and rusty fire-escapes, from the raucous cries and violence and never-ending noise? For what? Because, brother, he is burning in the night. He sees the class, the lecture room, the shining apparatus of gigantic laboratories, the open field of scholarship and pure research, certain knowledge, and the world distinction of an Einstein name. \\n\\n \\n\\n So, then, to every man his chance — to every man, regardless of his birth, his shining, golden opportunity — to every man the right to live, to work to be himself, and to become whatever thing his manhood and his vision can combine to make him — this seeker, is the promise of America. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1480/44336.html","bookId":1356,"book":{"id":1356,"title":"You Can\u0027t Go Home Again","description":"简介： George Webber has written a successful novel about his family and hometown. When he returns to that town he is shaken by the force of the outrage and hatred that greets him. Family and friends feel naked and exposed by the truths they have seen in hi...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1480","creation":"Aug 1, 2019 12:24:54 AM","modification":"Aug 1, 2019 12:24:54 AM"}}
