{"id":9595,"no":47,"title":"42. The Family of Earth","content":"The woman smiled at them as they came in, and all three of their 1 fellow-passengers looked at them in a way that showed wakened curiosity and increased interest. It was evident that George and Adamowski had themselves been subjects of speculation during their absence. \n \n Adamowski now spoke to the others. His German was not very good but it was coherent, and his deficiencies did not bother him at all. He was so self-assured, so confirmed in his self-possession, that he could plunge boldly into conversation in a foreign language with no sense whatever of personal handicap. Thus encouraged, the three Germans now gave free expression to their curiosity, to the speculations which the meeting of George and Adamowski and their apparent recognition of each other had aroused. \n \n The woman asked Adamowski where he came from —“Was fur ein Landsmann sind sie?” \n \n He replied that he was an American. \n \n “Ach, so?” She looked surprised, then added quickly: “But not by birth? You were not born in America?” \n \n “No,” said Adamowski. “I am Polish by birth. But I live in America now. And my friend here”— they all turned to stare curiously at George ——“is an American by birth.” \n \n They nodded in satisfaction. And the woman, smiling with good-humoured and eager interest, said: \n \n “And your friend — he is an artist, isn’t he?” \n \n “Yes,” said Adamowski. \n \n “A painter?” The woman’s tone was almost gleeful as she pursued further confirmation of her own predictions. \n \n “He is not a painter. He is ein Dichter.” \n \n The word means “poet”, and George quickly amended it to “ein Schriftsteller”— a writer. \n \n All three of them thereupon looked at one another with nods of satisfaction, saying, ah, they thought so, it was evident. Old Fussand–Fidget even spoke up now, making the sage observation that it was apparent “from the head”. The others nodded again, and the woman then turned once more to Adamowski, saying: \n \n “But you — you are not an artist, are you? You do something else?” \n \n He replied that he was a business man —“ein Gesch?ftsmann”— that he lived in New York, and that his business was in Wall Street. The name apparently had imposing connotations for them, for they all nodded in an impressed manner and said “Ali!” again. \n \n George and Adamowski went on then and told them of the manner of their meeting, how they had never seen each other before that morning, but how each of them had known of the other through many mutual friends. This news delighted everyone. It was a complete confirmation of what they had themselves inferred. The little blonde lady nodded triumphantly and burst out in excited conversation with her companion and with Fuss-and-Fidget, saying: \n \n “What did I tell you? I said the same thing, didn’t I? It’s a small world after all, isn’t it?” \n \n Now they were all really wonderfully at ease with one another, all talking eagerly, excitedly, naturally, like old friends who had just met after a long separation. The little lady began to tell them all about herself. She and her husband, she said, were proprietors of a business near the Alexander-platz. No — smiling — the young man was not her husband. He, too, was a young artist, and was employed by her. In what sort of business? She laughed — one would never guess. She and her husband manufactured manikins for show-window displays. No, it was not a shop, exactly — there was a trace of modest pride here — it was more like a little factory. They made their own figures. Their business, she implied, was quite a large one. She said that they employed over fifty workers, and formerly had had almost a hundred. That was why she had to go to Paris as often as she could, for Paris set the fashion in manikins just as it did in clothes. \n \n Of course, they did not buy the Paris models. Mein Gott!— that was impossible with the money situation what it was. Nowadays it was hard enough for a German business person even to get out of his own country, much less to buy anything abroad. Nevertheless, hard as it was, she had to get to Paris somehow once or twice a year, just in order to keep up with “what was going on.” She always took an artist with her, and this young man was making his first trip in this capacity. He was a sculptor by profession, but he earned money for his art by doing commercial work in her business. He would make designs and draw models of the latest show-window manikins in Paris, and would duplicate them when he returned; then the factory would turn them out by the hundreds. \n \n Adamowski remarked that he did not see how it was possible, under present circumstances, for a German citizen to travel anywhere. It had become difficult enough for a foreigner to get in and out of Germany. The money complications were so confusing and so wearisome. \n \n George added to this an account of the complications that had attended his own brief journey to the Austrian Tyrol. Ruefully he displayed the pocketful of papers, permits, visas, and official stamps which he had accumulated during the summer. \n \n Upon this common grievance they were all vociferously agreed. The lady affirmed that it was stupid, exhausting, and, for a German with business outside the country, almost impossible. She added quickly, loyally, that of course it was also necessary. But then she went on to relate that her three-or four-day trips to Paris could only be managed through some complicated trade arrangement and business connection in France, and as she tried to explain the necessary details of the plan she became so involved in the bewildering complexities of cheques and balances that she finally ended by waving her hand charmingly in a gesture of exhausted dismissal, saying: \n \n “Ach, Gott! It is all too complicated, too confusing! I cannot tell you how it is — I do not understand it myself!” \n \n Old Fuss-and-Fidget put in here with confirmations of his own. He was, he said, an attorney in Berlin —“ein Rechtsanwalt”— and had formerly had extensive professional connections in France and in other portions of the Continent. He had visited America as well, and had been there as recently as 1930, when he had attended an international congress of lawyers in New York. He even spoke a little English, which he unveiled with evident pride. And he was going now, he said, to another international congress of lawyers which was to open in Paris the next day, and which would last a week. But even so brief a trip as this now had its serious difficulties. As for his former professional activities in other countries, they were now, alas, impossible. \n \n He asked George if any of his books had been translated and published in Germany, and George told him they had. The others were all eagerly and warmly curious, wanting to know the titles and George’s name. Accordingly, he wrote out for them the German titles of the books, the name of the German publisher, and his own name. They all looked interested and pleased. The little lady put the paper away in her pocket-book and announced enthusiastically that she would buy the books on her return to Germany. Fuss-and-Fidget, after carefully copying the paper, folded the memorandum and tucked it in his wallet, saying that he, too, would buy the books as soon as he came home again. \n \n The lady’s young companion, who had shyly and diffidently, but with growing confidence, joined in the conversation from time to time, now took from an envelope in his pocket several postcard photographs of sculptures he had made. They were pictures of muscular athletes, runners, wrestlers, miners stripped to the waist, and the voluptuous figures of young nude girls. These photographs were passed round, inspected by each of them, and praised and admired for various qualities. \n \n Adamowski now picked up his bulky paper package, explained that it was filled with good things from his brother’s estate in Poland, opened it, and invited everyone to partake. There were some splendid pears and peaches, some fine bunches of grapes, a plump broiled chicken, some fat squabs and partridges, and various other delicacies. The three Germans protested that they could not deprive him of his lunch. But Adamowski insisted vigorously, with the warmth of generous hospitality that was obviously characteristic of his nature. On the spur of the moment he reversed an earlier decision and informed them that he and George were going to the dining-car for luncheon anyway, and that if they did not eat the food in the package it would go to waste. On this condition they all helped themselves to fruit, which they pronounced delicious, and the lady promised that she would later investigate the chicken. \n \n At length, with friendly greetings all round, George and his \n \n Polish friend departed a second time and went forward to the Speisewagen. \n \n They had a long and sumptuous meal. It began with brandy, proceeded over a fine bottle of Bernkasteler, and wound up over coffee and more brandy. They were both determined to spend the remainder of their German money — Adamowski his ten or twelve marks, George his five or six — and this gave them a comfortable feeling in which astute economy was thriftily combined with good living. \n \n During the meal they discussed their companions again. They were delighted with them and immensely interested in the information they had gathered from them. The woman, they both agreed, was altogether charming. And the young man, although diffident and shy, was very nice. They even had a word of praise for old Fussand–Fidget now. After his crusty shell had been cracked, the old codger was not bad. He really was quite friendly underneath. \n \n “And it goes to show,” said Adamowski quietly, “how good people really are, how easy it is to get along with one another in this world, how people really like each other — if only ——” \n \n “— if only ——” George said, and nodded. \n \n “— if only it weren’t for these God-damned politicians,” Adamowski concluded. \n \n At the end they called for their bill. Adamowski dumped his marks upon the table and counted them. \n \n “You’ll have to help me out,” he said. “How many have you got?” \n \n George dumped his out. Together, they had enough to pay the bill and to give the waiter something extra. And there was also enough left over for another double jolt of brandy and a good cigar. \n \n So, grinning with satisfaction, in which their waiter joined amiably as he read their purpose, they paid the bill, ordered the brandy and cigars, and, full of food, drink, and the pleasant knowledge of a job well done, they puffed contentedly on their cigars and observed the landscape. \n \n They were now running through the great industrial region of western Germany. The pleasant landscape was gone, and everything in sight had been darkened by the grime and smoke of enormous works. The earth was dotted with the steely skeletons of great smelting and refining plants, and disfigured with mountainous dumps and heaps of slag. It was brutal, smoky, dense with life and labour and the grim warrens of industrial towns. But these places, too, had a certain fascination — the thrill of power in the raw. \n \n The two friends talked about the scene and about their trip. Adamowski said they had done well to spend their German money. Outside of the Reich its exchange value would be lower, and they were already almost at the border; since their own coach went directly through to Paris, they would have no additional need of German currency for porters’ fees. \n \n George confided to him, somewhat apprehensively, that he had some thirty dollars in American currency for which he had no German permit. Almost all of his last week in Berlin had been consumed, he said, in the red tape of departure — pounding wearily from one steamship office to another in an effort to secure passage home, cabling to Fox Edwards for more money, then getting permits for the money. At the last moment he had discovered that he still had thirty dollars left for which he had no official permit. When he had gone in desperation to an acquaintance who was an official in a travel agency, and had asked him what to do, this man had told him wearily to put the money in his pocket and say nothing; that if he tried now to get a permit for it and waited for the authorities to act on it, he would miss the boat; so to take the chance, which was, at most, he thought, a very slight one, and go ahead. \n \n Adamowski nodded in agreement, but suggested that George take the uncertified money, thrust it in the pocket of his vest, where he would not seem to hide it, and then, if he were discovered and questioned, he could say that he had put the money there and had forgotten to declare it. This he decided to do, and made the transfer then and there. \n \n This conversation brought them back to the thorny problem of the money regulations and the difficulties of their fellow-travellers who were Germans. They agreed that the situation was hard on their new-found friends, and that the law which permitted foreigners and citizens alike to take only ten marks from the country, unless otherwise allowed, was, for people in the business circumstances of the little blonde woman and old Fuss-and-Fidget, very unfair indeed. \n \n Then Adamowski had a brilliant inspiration, the fruit of his generous and spontaneous impulses. \n \n “But why ——” he said —“why can’t we help them?” \n \n “How do you mean? In what way can we help them?” \n \n “Why,” he said, “I have here a permit that allows me to take twenty-three marks out of the country. You have no permit, but everyone is allowed ——” \n \n “— to take ten marks,” George said. “So you mean, then,” he concluded, “that each of us has spent his German money ——” \n \n “— but can still take as much as is allowed out of the country. Yes,” he said. “So we could at least suggest it to them.” \n \n “You mean that they should give us some of their marks to keep in our possession until we get across the frontier?” \n \n Adamowski nodded. “Yes. I could take twenty-three. You could take ten. It is not much, of course, but it might help.” \n \n No sooner said than seized upon. They were almost jubilantly elated at this opportunity to do some slight service for these people to whom they had taken such, a liking. But even as they sat there smiling confirmation at each other, a man in uniform came through the car, paused at their table — which was the only one now occupied, all the other diners having departed — and authoritatively informed them that the Pass–Control had come aboard the train, and that they must return at once to their compartment to await examination. \n \n They got up immediately and hastened back through the swaying coaches. George led the way, and Adamowski whispered at his shoulder that they must now make haste and propose their offer to their companions quickly, or it would be too late. \n \n As soon as they entered the compartment they told their three German friends that the officials were already on the train and that the inspection would begin shortly. This announcement caused a flurry of excitement. They all began to get ready. The woman busied herself with her purse. She took out her passport, and then, with a worried look, began to count her money. \n \n Adamowski, after watching her quietly for a moment, took out his certificate and held it open in his hand, remarking that he was officially allowed twenty-three marks, that he had had that sum at the beginning, but that now he had spent it. George took this as his cue and said that he, too, had spent all of his German money, and that, although he had no permit, he was allowed ten marks. The woman looked quickly, eagerly, from one to the other and read the friendship of their purpose. \n \n “Then you mean ——” she began. “But it would be wonderful, of course, if you would!” \n \n “Have you as much as twenty-three marks above what you are allowed?” asked Adamowski. \n \n “Yes,” she nodded quickly, with a worried look. “I have more than that. But if you would take the twenty-three and keep them till we are past the frontier ——” \n \n He stretched out his hand. “Give them to me,” he said. \n \n She gave them to him instantly, and the money was in his pocket in the wink of an eye. \n \n Fuss-and-Fidget now counted out ten marks nervously, and without a word passed them across to George. George thrust the money in his pocket, and they all sat back, a little flushed, excited but triumphant, trying to look composed. \n \n A few minutes later an official opened the door of the compartment, saluted, and asked for their passports. He inspected Adamowski’s first, found everything in order, took his certificate, saw his twenty-three marks, stamped the passport, and returned it to him. \n \n Then he turned to George, who gave him his passport and the various papers certifying his possession of American currency. The official thumbed through the pages of the passport, which were now almost completely covered with the stamps and entries which had been made every time George cashed a cheque for register-marks. On one page the man paused and frowned, scrutinising carefully a stamp showing reentrance into Germany from Kufstein, on the Austrian border; then he consulted again the papers George had handed him. He shook his head. Where, he asked, was the certificate from Kufstein? \n \n George’s heart jumped and pounded hard. He had forgotten the Kufstein certificate! There had been so many papers and documents of one kind and another since then that he no longer thought the Kufstein certificate was needed. He began to paw and thumb through the mass of papers that remained in his pocket. The officer waited patiently, but with an air of perturbation in his manner. Everyone else looked at George apprehensively, except Adamowski, who said quietly: \n \n “Just take your time. It ought to be there somewhere.” \n \n At last George found it! And as he did, his own sharp intake of relief found echo among his companions. As for the official, he, too, seemed glad. He smiled quite kindly, took the paper and inspected it, and returned the passport. \n \n Meanwhile, during the anxious minutes that George had taken to paw through his papers, the official had already inspected the passports of the woman, her companion, and Fuss-and-Fidget. Everything was apparently in order with them, save that the lady had confessed to the possession of forty-two marks, and the official had regretfully informed her that he would have to take from her everything in excess of ten. The money would be held at the frontier and restored to her, of course, when she returned. She smiled ruefully, shrugged her shoulders, and gave the man thirty-two marks. All other matters were now evidently in order, for the man saluted and withdrew. \n \n So it was over, then! They all drew deep breaths of relief, and commiserated the charming lady upon her loss. But they were all quietly jubilant, too, to know that her loss had been no greater, and that Adamowski had been able in some degree to lessen it. \n \n George asked Fuss-and-Fidget if he wanted his money returned now or later. He replied that he thought it would be better to wait until they had crossed the frontier into Belgium. At the same time he made a casual remark, to which none of them paid any serious attention just then, to the effect that for some reason, which they did not follow, his ticket was good only to the frontier, and that he would utilise the fifteen minutes’ wait at Aachen, which was the frontier town, to buy a ticket for the remainder of the trip to Paris. \n \n They were now approaching Aachen. The train was beginning to slacken speed. They were going once more through a lovely countryside, smiling with green fields and gentle hills, unobtrusively, mildly, somehow unmistakably European. The seared and blasted district of the mines and factories was behind them. They were entering the outskirts of a pleasant town. \n \n This was Aachen. Within a few minutes more, the train was slowing to a halt before the station. They had reached the frontier. Here there would be a change of engines. All of them got out — Fuss-and-Fidget evidently to get a ticket, the others to stretch their legs and get a breath of air. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1480/44349.html","bookId":1356,"book":{"id":1356,"title":"You Can\u0027t Go Home Again","description":"简介： George Webber has written a successful novel about his family and hometown. When he returns to that town he is shaken by the force of the outrage and hatred that greets him. Family and friends feel naked and exposed by the truths they have seen in hi...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1480","creation":"Aug 1, 2019 12:24:54 AM","modification":"Aug 1, 2019 12:24:54 AM"}}
