{"id":9596,"no":48,"title":"43. The Capture","content":"Adamowski and George stepped out on the platform together and walked forward to inspect the locomotive. The German engine, which had here reached the end of its journey and would soon be supplanted by its Belgian successor, was a magnificent machine of tremendous power and weight, almost as big as one of the great American engines. It was beautifully streamlined for high velocity, and its tender was a wonderful affair, different from any other that George had ever seen. It seemed to be a honeycomb of pipes. One looked in through some slanting bars and saw a fountainlike display composed of thousands of tiny little jets of steaming water. Every line of this intricate and marvellous apparatus bore evidence of the organising skill and engineering genius that had created it. \n \n Knowing how important are the hairline moments of transition, how vivid, swift, and fugitive are the poignant first impressions when a traveller changes from one country to another, from one people to another, from one standard of conduct and activity to another, George waited with intense interest for the approach of the Belgian locomotive in order to see what it might indicate of the differences between the powerful, solid, and indomitable race they were leaving and the little people whose country they were now about to enter. \n \n While Adamowski and George were engaged in observations and speculations on this subject, their own coach and another, which was also destined for Paris, were detached from the German train and shifted to a string of coaches on the opposite side of the platform. They were about to hasten back when a guard informed them that they still had ample time, and that the train was not scheduled to depart for another five minutes. So they waited a little longer, and Adamowski remarked that it was a pitiful evidence of the state Europe was in that a crack train between the two greatest cities on the Continent should be carrying only two through coaches, and these not even filled. \n \n But the Belgian locomotive still did not come, and now, glancing up at the station clock, they saw that the moment for departure had arrived. Fearful of being left behind if they waited any longer, they started back along the platform. They found the little blonde-haired lady and, flanking her on each side, they hastened towards their coach and their own compartment. \n \n As they approached, it was evident that something had happened. There were no signs of departure. The conductor and the station guard stood together on the platform. No warning signal had been given. When they came alongside of their car, people were clustered in the corridor, and something in the way they stood indicated a subdued tension, a sense of crisis, that made George’s pulse beat quicker. \n \n George had observed this same phenomenon several times before in the course of his life and he knew the signs. A man has leaped or fallen, for example, from a high building to the pavement of a city street; or a man has been shot or struck by a motor-car, and now lies dying quietly before the eyes of other men — and always the manifestation of the crowd is just the same. Even before you see the faces of the people, something about their backs, their posture, the position of their heads and shoulders tells you what has happened. You do not know, of course, the precise circumstances, but you sense immediately the final stage of tragedy. You know that someone has just died or is dying. And in the terrible eloquence of backs and shoulders, the feeding silence of the watching men, you also sense another tragedy which ‘is even deeper. This is the tragedy of man’s cruelty and his lust for pain — the tragic weakness which corrupts him, which he loathes, but which he cannot cure. As a child, George had seen it on the faces of men standing before the window of a shabby little undertaker’s place, looking at the bloody, riddled carcass of a negro which the mob had caught and killed. Again, as a boy of fourteen, he had seen it on the faces of men and women at a dance, as they watched a fight in which one man beat another man to death. \n \n And now, here it was again. As George and his two companions hastened along beside the train and saw the people gathered in the corridor in that same feeding posture, waiting, watching, in that same deadly fascinated silence, he was sure that once again he was about to witness death. \n \n That was the first thought that came to him — and it came also, instantaneously, without a word of communication between them, to Adamowski and the little blonde woman — the thought that someone had died. But as they started to get on the train, what suddenly stunned them and stopped them short, appalled, was the realisation that the tragedy, whatever it was, had happened in their own compartment. The shades were tightly drawn, the door closed and locked, the whole place sealed impenetrably. They stared in silence, rooted to the platform. Then they saw the woman’s young companion standing at the window in the corridor. He motioned to them quickly, stealthily, a gesture warning them to remain where they were. And as he did so it flashed over all three of them that the victim of this tragic visitation must be the nervous little man who had been the companion of their voyage since morning. The stillness of the scene and the shuttered blankness of that closed compartment were horrible. They all felt sure that this little man who had begun by being so disagreeable, but who had gradually come out of his shell and become their friend, and to whom they had all been talking only fifteen minutes before, had died, and that authority and the law were now enclosed there with his body in the official ceremony that society demands. \n \n Even as they stared appalled and horror-stricken at that fatally curtained compartment, the lock clicked sharply, the door was opened and closed quickly, and an official came out. He was a burly fellow in a visored cap and a jacket of olive green — a man of forty-five or more with high, blunt cheek-bones, a florid face, and tawny moustaches combed out sprouting in the Kaiser Wilhelm way. His head was shaven, and there were thick creases at the base of his skull and across his fleshy neck. He came out, climbed down clumsily to the platform, signalled and called excitedly to another officer, and climbed back into the train again. \n \n He belonged to a familiar and well-known type, one which George had seen and smiled at often, but one which now became, under these ominous and unknown circumstances, sinisterly unpleasant. The man’s very weight and clumsiness, the awkward way he got down from the train and climbed up again, the thickness of his waist, the width and coarseness of his lumbering buttocks, the way his sprouting moustaches quivered with passion and authority, the sound of his guttural voice as he shouted to his fellow-officer, his puffing, panting air of official indignation — all these symptoms which ran true to type now became somehow loathsome and repellent. All of a sudden, without knowing why, George felt himself trembling with a murderous and incomprehensible anger. He wanted to smash that fat neck with the creases in it. He wanted to pound that inflamed and blunted face into a jelly. He wanted to kick square and hard, bury his foot dead centre in the obscene fleshiness of those lumbering buttocks. Like all Americans, he had never liked the police and the kind of personal authority that is sanctified in them. But his present feeling, with its murderous rage, was a good deal more than that. For he knew that he was helpless, that all of them were, and he felt impotent, shackled, unable to stir against the walls of an unreasonable but unshakable authority. \n \n The official with the sprouting moustaches, accompanied by the colleague he had summoned, opened the curtained door of the compartment again, and now George saw that two other officers were inside. And the nervous little man who had been their companion — no, he was not dead! — he sat all huddled up, facing them. His face was white and pasty. It looked greasy, as if it were covered with a salve of cold, fat sweat. Under his long nose his mouth was trembling in a horrible attempt at a smile. And in the very posture of the two men as they bent over him and questioned him there was something revolting and unclean. \n \n But the official with the thick, creased neck had now filled the door and blotted out the picture. He went in quickly, followed by his colleague. The door closed behind them, and again there was nothing but the drawn curtains and that ill-omened secrecy. \n \n All the people who had gathered round had got this momentary glimpse and had simply looked on with stupefied surprise. Now those who stood in the corridor of the train began to whisper to one another. The little blonde woman went over and carried on a whispered conversation with the young man and several other people who were standing at the open window. After conferring with them with subdued but growing excitement for a minute or two, she came back, took George and Adamowski by the arm, and whispered: \n \n “Come over here. There is something I want to tell you.” \n \n She led them across the platform, out of hearing. Then, as both of the men said in lowered voices: “What is it?”— she looked round cautiously and whispered: \n \n “That man — the one in our compartment — he was trying to get out of the country — and they’ve caught him!” \n \n “But why? What for? What has he done?” they asked, bewildered. \n \n Again she glanced back cautiously and, drawing them together till their three heads were almost touching, she said in a secretive whisper that was full of awe and fright: \n \n “They say he is a Jew! And they found money on him! They searched him — they searched his baggage — he was taking money out!” \n \n “How much?” asked Adamowski. \n \n “I don’t know,” she whispered. “A great deal, I think. A hundred thousand marks, some say. Anyhow, they found it!” \n \n “But how?” George began. “I thought everything was finished. I thought they were done with all of us when they went through the train.” \n \n “Yes,” she said. “But don’t you remember something about the ticket? He said something about not having a ticket the whole way. I suppose he thought it would be safer — wouldn’t arouse suspicion in Berlin if he bought a ticket only to Aachen. So he got off the train here to buy his ticket for Paris — and that’s when they caught him!” she whispered. “They must had have their eye on him! They must have suspected him! That’s why they didn’t question him when they came through the train!” George remembered now that “they” had not. “But they were watching for him, and they caught him here!” she went on. “They asked him where he was going, and he said to Paris. They asked him how much money he was taking out. He said ten marks. Then they asked him how long he was going to remain in Paris, and for what purpose, and he said he was going to be there a week, attending this congress of lawyers that he spoke about. They asked him, then, how he proposed to stay in Paris a week if all he had was ten marks. And I think,” she whispered, “that that’s where he got frightened! He began to lose his head! He said he had twenty marks besides, which he had put into another pocket and forgotten. And then, of course, they had him! They searched him! They searched his baggage! And they found more”— she whispered in an awed tone —“much, much more!” \n \n They all stared at one another, too stunned to say a word. Then the woman laughed in a low, frightened sort of way, a little, uncertain: “O-hoh-hoh-hoh-hoh,” ending on a note of incredulity. \n \n “This man”— she whispered again —“this little Jew ——”. \n \n “I didn’t know he was a Jew,” George said. “I should not have thought so.” \n \n “But he is!” she whispered, and looked stealthily round again to see if they were being overheard or watched. “And he was doing what so many of the others have done — he was trying to get out with his money!” Again she laughed, the uncertain little “Hohhoh-hoh” that mounted to incredulous amazement. Yet George saw that her eyes were troubled, too. \n \n All of a sudden George felt sick, empty, nauseated. Turning half away, he thrust his hands into his pockets — and drew them out as though his fingers had been burned. The man’s money — he still had it! Deliberately, now, he put his hand into his pocket again and felt the five two-mark pieces. The coins seemed greasy, as if they were covered with sweat. George took them out and closed them in his fist and started across the platform towards the train. The woman seized him by the arm. \n \n “Where are you going?” she gasped. “What are you going to do?” \n \n “I’m going to give the man his money. I won’t see him again. I can’t keep it.” \n \n Her face went white. “Are you mad?” she whispered. “Don’t you know that that will do no good? You’ll only get yourself arrested! And, as for him — he’s in trouble enough already. You’ll only make it so much worse for him. And besides,” she faltered, “God knows what he has done, what he has said already. If he has lost his head completely — if he has told that we have transferred money to one another — we’ll all be in for it!” \n \n They had not thought of this. And as they realised the possible consequences of their good intentions, they just stood there, all three, and stared helplessly at one another. They just stood there, feeling dazed and weak and hollow. They just stood there and prayed. \n \n And now the officers were coming out of the compartment. The curtained door opened again, and the fellow with the sprouting moustaches emerged, carrying the little man’s valise. He clambered down clumsily onto the platform and set the valise on the floor between his feet. He looked round. It seemed to George and the others that he glared at them. They just stood still and hardly dared to breathe. They thought they were in for it, and expected now to see all of their own baggage come out. \n \n But in a moment the other three officials came through the door of the compartment with the little man between them. They stepped down to the platform and marched him along, white as a sheet, grease standing out in beads all over his face, protesting volubly in a voice that had a kind of anguished lilt in it. He came right by the others as they stood there. The man’s money sweated in George’s hand, and he did not know what to do. He made a movement with his arm and started to speak to him. At the same time he was hoping desperately that the man would not speak. George tried to look away from him, but could not. The little man came towards them, protesting with every breath that the whole thing could be explained, that it was an absurd mistake. For just the flick of an instant as he passed the others he stopped talking, glanced at them, white-faced, still smiling his horrible little forced smile of terror; for just a moment his eyes rested on them, and then, without a sign of recognition, without betraying them, without giving any indication that he knew them, he went on by. \n \n George heard the woman at his side sigh faintly and felt her body slump against him. They all felt weak, drained of their last energies. Then they walked slowly across the platform and got into the train. \n \n The evil tension had been snapped now. People were talking feverishly, still in low tones but with obvious released excitement. The little blonde woman leaned from the window of the corridor and spoke to the fellow with the sprouting moustaches, who was still standing there. \n \n “You — you’re not going to let him go?” she asked hesitantly, almost in a whisper. “Are — are you going to keep him here?” \n \n He looked at her stolidly. Then a slow, intolerable smile broke across his brutal features. He nodded his head deliberately, with the finality of a gluttonous and full-fed satisfaction: \n \n “Ja,” he said. “Er bleibt.” And, shaking his head ever so slightly from side to side: “Geht nicht!” he said. \n \n They had him. Far down the platform the passengers heard the shrill, sudden fife of the Belgian engine whistle. The guard cried warning. All up and down the train the doors were slammed. Slowly the train began to move. At a creeping pace it rolled right past the little man. They had him, all right. The officers surrounded him. He stood among them, still protesting, talking with his hands now. And the men in uniform said nothing. They had no need to speak. They had him. They just stood and watched him, each with a faint suggestion of that intolerable slow smile upon his face. They raised their eyes and looked at the passengers as the train rolled past, and the line of travellers standing in the corridors looked back at them and caught the obscene and insolent communication in their glance and in that intolerable slow smile. \n \n And the little man — he, too, paused once from his feverish effort to explain. As the car in which he had been riding slid by, he lifted his pasty face and terror-stricken eyes, and for a moment his lips were stilled of their anxious pleading. He looked once, directly and steadfastly, at his former companions, and they at him. And in that gaze there was all the unmeasured weight of man’s mortal anguish. George and the others felt somehow naked and ashamed, and somehow guilty. They all felt that they were saying farewell, not to a man, but to humanity; not to some pathetic stranger, some chance acquaintance of the voyage, but to mankind; not to some nameless cipher out of life, but to the fading image of a brother’s face. \n \n The train swept out and gathered speed — and so they lost him: \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1480/44350.html","bookId":1356,"book":{"id":1356,"title":"You Can\u0027t Go Home Again","description":"简介： George Webber has written a successful novel about his family and hometown. When he returns to that town he is shaken by the force of the outrage and hatred that greets him. Family and friends feel naked and exposed by the truths they have seen in hi...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1480","creation":"Aug 1, 2019 12:24:54 AM","modification":"Aug 1, 2019 12:24:54 AM"}}
