{"id":34784,"no":22,"title":"BOOK XXI.","content":"ARGUMENT. \\n\\n \\n\\n THE BATTLE IN THE RIVER SCAMANDER.269 \\n\\n \\n\\n The Trojans fly before Achilles, some towards the town, others to the river Scamander: he falls upon the latter with great slaughter: takes twelve captives alive, to sacrifice to the shade of Patroclus; and kills Lycaon and Asteropeus. Scamander attacks him with all his waves: Neptune and Pallas assist the hero: Simois joins Scamander: at length Vulcan, by the instigation of Juno, almost dries up the river. This Combat ended, the other gods engage each other. Meanwhile Achilles continues the slaughter, drives the rest into Troy: Agenor only makes a stand, and is conveyed away in a cloud by Apollo; who (to delude Achilles) takes upon him Agenor\u0027s shape, and while he pursues him in that disguise, gives the Trojans an opportunity of retiring into their city. \\n\\n \\n\\n The same day continues. The scene is on the banks and in the stream of Scamander. \\n\\n And now to Xanthus\u0027 gliding stream they drove, \\n\\n Xanthus, immortal progeny of Jove. \\n\\n The river here divides the flying train, \\n\\n Part to the town fly diverse o\u0027er the plain, \\n\\n Where late their troops triumphant bore the fight, \\n\\n Now chased, and trembling in ignoble flight: \\n\\n (These with a gathered mist Saturnia shrouds, \\n\\n And rolls behind the rout a heap of clouds:) \\n\\n Part plunge into the stream: old Xanthus roars, \\n\\n The flashing billows beat the whiten\u0027d shores: \\n\\n With cries promiscuous all the banks resound, \\n\\n And here, and there, in eddies whirling round, \\n\\n [pg 375] \\n\\n The flouncing steeds and shrieking warriors drown\u0027d. \\n\\n As the scorch\u0027d locusts from their fields retire, \\n\\n While fast behind them runs the blaze of fire; \\n\\n Driven from the land before the smoky cloud, \\n\\n The clustering legions rush into the flood: \\n\\n So, plunged in Xanthus by Achilles\u0027 force, \\n\\n Roars the resounding surge with men and horse. \\n\\n His bloody lance the hero casts aside, \\n\\n (Which spreading tamarisks on the margin hide,) \\n\\n Then, like a god, the rapid billows braves, \\n\\n Arm\u0027d with his sword, high brandish\u0027d o\u0027er the waves: \\n\\n Now down he plunges, now he whirls it round, \\n\\n Deep groan\u0027d the waters with the dying sound; \\n\\n Repeated wounds the reddening river dyed, \\n\\n And the warm purple circled on the tide. \\n\\n Swift through the foamy flood the Trojans fly, \\n\\n And close in rocks or winding caverns lie: \\n\\n So the huge dolphin tempesting the main, \\n\\n In shoals before him fly the scaly train, \\n\\n Confusedly heap\u0027d they seek their inmost caves, \\n\\n Or pant and heave beneath the floating waves. \\n\\n Now, tired with slaughter, from the Trojan band \\n\\n Twelve chosen youths he drags alive to land; \\n\\n With their rich belts their captive arms restrains \\n\\n (Late their proud ornaments, but now their chains). \\n\\n These his attendants to the ships convey\u0027d, \\n\\n Sad victims destined to Patroclus\u0027 shade; \\n\\n Then, as once more he plunged amid the flood, \\n\\n The young Lycaon in his passage stood; \\n\\n The son of Priam; whom the hero\u0027s hand \\n\\n But late made captive in his father\u0027s land \\n\\n (As from a sycamore, his sounding steel \\n\\n Lopp\u0027d the green arms to spoke a chariot wheel) \\n\\n To Lemnos\u0027 isle he sold the royal slave, \\n\\n Where Jason\u0027s son the price demanded gave; \\n\\n But kind Eetion, touching on the shore, \\n\\n The ransom\u0027d prince to fair Arisbe bore. \\n\\n Ten days were past, since in his father\u0027s reign \\n\\n He felt the sweets of liberty again; \\n\\n The next, that god whom men in vain withstand \\n\\n Gives the same youth to the same conquering hand \\n\\n Now never to return! and doom\u0027d to go \\n\\n A sadder journey to the shades below. \\n\\n His well-known face when great Achilles eyed, \\n\\n (The helm and visor he had cast aside \\n\\n With wild affright, and dropp\u0027d upon the field \\n\\n His useless lance and unavailing shield,) \\n\\n As trembling, panting, from the stream he fled, \\n\\n And knock\u0027d his faltering knees, the hero said. \\n\\n \"Ye mighty gods! what wonders strike my view! \\n\\n [pg 376] \\n\\n Is it in vain our conquering arms subdue? \\n\\n Sure I shall see yon heaps of Trojans kill\u0027d \\n\\n Rise from the shades, and brave me on the field; \\n\\n As now the captive, whom so late I bound \\n\\n And sold to Lemnos, stalks on Trojan ground! \\n\\n Not him the sea\u0027s unmeasured deeps detain, \\n\\n That bar such numbers from their native plain; \\n\\n Lo! he returns. Try, then, my flying spear! \\n\\n Try, if the grave can hold the wanderer; \\n\\n If earth, at length this active prince can seize, \\n\\n Earth, whose strong grasp has held down Hercules.\" \\n\\n Thus while he spoke, the Trojan pale with fears \\n\\n Approach\u0027d, and sought his knees with suppliant tears \\n\\n Loth as he was to yield his youthful breath, \\n\\n And his soul shivering at the approach of death. \\n\\n Achilles raised the spear, prepared to wound; \\n\\n He kiss\u0027d his feet, extended on the ground: \\n\\n And while, above, the spear suspended stood, \\n\\n Longing to dip its thirsty point in blood, \\n\\n One hand embraced them close, one stopp\u0027d the dart, \\n\\n While thus these melting words attempt his heart: \\n\\n \"Thy well-known captive, great Achilles! see, \\n\\n Once more Lycaon trembles at thy knee. \\n\\n Some pity to a suppliant\u0027s name afford, \\n\\n Who shared the gifts of Ceres at thy board; \\n\\n Whom late thy conquering arm to Lemnos bore, \\n\\n Far from his father, friends, and native shore; \\n\\n A hundred oxen were his price that day, \\n\\n Now sums immense thy mercy shall repay. \\n\\n Scarce respited from woes I yet appear, \\n\\n And scarce twelve morning suns have seen me here; \\n\\n Lo! Jove again submits me to thy hands, \\n\\n Again, her victim cruel Fate demands! \\n\\n I sprang from Priam, and Laothoe fair, \\n\\n (Old Altes\u0027 daughter, and Lelegia\u0027s heir; \\n\\n Who held in Pedasus his famed abode, \\n\\n And ruled the fields where silver Satnio flow\u0027d,) \\n\\n Two sons (alas! unhappy sons) she bore; \\n\\n For ah! one spear shall drink each brother\u0027s gore, \\n\\n And I succeed to slaughter\u0027d Polydore. \\n\\n How from that arm of terror shall I fly? \\n\\n Some demon urges! \u0027tis my doom to die! \\n\\n If ever yet soft pity touch\u0027d thy mind, \\n\\n Ah! think not me too much of Hector\u0027s kind! \\n\\n Not the same mother gave thy suppliant breath, \\n\\n With his, who wrought thy loved Patroclus\u0027 death.\" \\n\\n These words, attended with a shower of tears, \\n\\n The youth address\u0027d to unrelenting ears: \\n\\n \"Talk not of life, or ransom (he replies): \\n\\n Patroclus dead, whoever meets me, dies: \\n\\n [pg 377] \\n\\n In vain a single Trojan sues for grace; \\n\\n But least, the sons of Priam\u0027s hateful race. \\n\\n Die then, my friend! what boots it to deplore? \\n\\n The great, the good Patroclus is no more! \\n\\n He, far thy better, was foredoom\u0027d to die, \\n\\n And thou, dost thou bewail mortality? \\n\\n Seest thou not me, whom nature\u0027s gifts adorn, \\n\\n Sprung from a hero, from a goddess born? \\n\\n The day shall come (which nothing can avert) \\n\\n When by the spear, the arrow, or the dart, \\n\\n By night, or day, by force, or by design, \\n\\n Impending death and certain fate are mine! \\n\\n Die then,\"—He said; and as the word he spoke, \\n\\n The fainting stripling sank before the stroke: \\n\\n His hand forgot its grasp, and left the spear, \\n\\n While all his trembling frame confess\u0027d his fear: \\n\\n Sudden, Achilles his broad sword display\u0027d, \\n\\n And buried in his neck the reeking blade. \\n\\n Prone fell the youth; and panting on the land, \\n\\n The gushing purple dyed the thirsty sand. \\n\\n The victor to the stream the carcase gave, \\n\\n And thus insults him, floating on the wave: \\n\\n \"Lie there, Lycaon! let the fish surround \\n\\n Thy bloated corpse, and suck thy gory wound: \\n\\n There no sad mother shall thy funerals weep, \\n\\n But swift Scamander roll thee to the deep, \\n\\n Whose every wave some watery monster brings, \\n\\n To feast unpunish\u0027d on the fat of kings. \\n\\n So perish Troy, and all the Trojan line! \\n\\n Such ruin theirs, and such compassion mine. \\n\\n What boots ye now Scamander\u0027s worshipp\u0027d stream, \\n\\n His earthly honours, and immortal name? \\n\\n In vain your immolated bulls are slain, \\n\\n Your living coursers glut his gulfs in vain! \\n\\n Thus he rewards you, with this bitter fate; \\n\\n Thus, till the Grecian vengeance is complete: \\n\\n Thus is atoned Patroclus\u0027 honour\u0027d shade, \\n\\n And the short absence of Achilles paid.\" \\n\\n These boastful words provoked the raging god; \\n\\n With fury swells the violated flood. \\n\\n What means divine may yet the power employ \\n\\n To check Achilles, and to rescue Troy? \\n\\n Meanwhile the hero springs in arms, to dare \\n\\n The great Asteropeus to mortal war; \\n\\n The son of Pelagon, whose lofty line \\n\\n Flows from the source of Axius, stream divine! \\n\\n (Fair Peribaea\u0027s love the god had crown\u0027d, \\n\\n With all his refluent waters circled round:) \\n\\n On him Achilles rush\u0027d; he fearless stood, \\n\\n And shook two spears, advancing from the flood; \\n\\n [pg 378] \\n\\n The flood impell\u0027d him, on Pelides\u0027 head \\n\\n To avenge his waters choked with heaps of dead. \\n\\n Near as they drew, Achilles thus began: \\n\\n \"What art thou, boldest of the race of man? \\n\\n Who, or from whence? Unhappy is the sire \\n\\n Whose son encounters our resistless ire.\" \\n\\n \"O son of Peleus! what avails to trace \\n\\n (Replied the warrior) our illustrious race? \\n\\n From rich Paeonia\u0027s valleys I command, \\n\\n Arm\u0027d with protended spears, my native band; \\n\\n Now shines the tenth bright morning since I came \\n\\n In aid of Ilion to the fields of fame: \\n\\n Axius, who swells with all the neighbouring rills, \\n\\n And wide around the floated region fills, \\n\\n Begot my sire, whose spear much glory won: \\n\\n Now lift thy arm, and try that hero\u0027s son!\" \\n\\n Threatening he said: the hostile chiefs advance; \\n\\n At once Asteropeus discharged each lance, \\n\\n (For both his dexterous hands the lance could wield,) \\n\\n One struck, but pierced not, the Vulcanian shield; \\n\\n One razed Achilles\u0027 hand; the spouting blood \\n\\n Spun forth; in earth the fasten\u0027d weapon stood. \\n\\n Like lightning next the Pelean javelin flies: \\n\\n Its erring fury hiss\u0027d along the skies; \\n\\n Deep in the swelling bank was driven the spear, \\n\\n Even to the middle earth; and quiver\u0027d there. \\n\\n Then from his side the sword Pelides drew, \\n\\n And on his foe with double fury flew. \\n\\n The foe thrice tugg\u0027d, and shook the rooted wood; \\n\\n Repulsive of his might the weapon stood: \\n\\n The fourth, he tries to break the spear in vain; \\n\\n Bent as he stands, he tumbles to the plain; \\n\\n His belly open\u0027d with a ghastly wound, \\n\\n The reeking entrails pour upon the ground. \\n\\n Beneath the hero\u0027s feet he panting lies, \\n\\n And his eye darkens, and his spirit flies; \\n\\n While the proud victor thus triumphing said, \\n\\n His radiant armour tearing from the dead: \\n\\n \"So ends thy glory! Such the fate they prove, \\n\\n Who strive presumptuous with the sons of Jove! \\n\\n Sprung from a river, didst thou boast thy line? \\n\\n But great Saturnius is the source of mine. \\n\\n How durst thou vaunt thy watery progeny? \\n\\n Of Peleus, ?acus, and Jove, am I. \\n\\n The race of these superior far to those, \\n\\n As he that thunders to the stream that flows. \\n\\n What rivers can, Scamander might have shown; \\n\\n But Jove he dreads, nor wars against his son. \\n\\n Even Achelous might contend in vain, \\n\\n And all the roaring billows of the main. \\n\\n [pg 379] \\n\\n The eternal ocean, from whose fountains flow \\n\\n The seas, the rivers, and the springs below, \\n\\n The thundering voice of Jove abhors to hear, \\n\\n And in his deep abysses shakes with fear.\" \\n\\n He said: then from the bank his javelin tore, \\n\\n And left the breathless warrior in his gore. \\n\\n The floating tides the bloody carcase lave, \\n\\n And beat against it, wave succeeding wave; \\n\\n Till, roll\u0027d between the banks, it lies the food \\n\\n Of curling eels, and fishes of the flood. \\n\\n All scatter\u0027d round the stream (their mightiest slain) \\n\\n The amazed Paeonians scour along the plain; \\n\\n He vents his fury on the flying crew, \\n\\n Thrasius, Astyplus, and Mnesus slew; \\n\\n Mydon, Thersilochus, with ?nius, fell; \\n\\n And numbers more his lance had plunged to hell, \\n\\n But from the bottom of his gulfs profound \\n\\n Scamander spoke; the shores return\u0027d the sound. \\n\\n \"O first of mortals! (for the gods are thine) \\n\\n In valour matchless, and in force divine! \\n\\n If Jove have given thee every Trojan head, \\n\\n \u0027Tis not on me thy rage should heap the dead. \\n\\n See! my choked streams no more their course can keep, \\n\\n Nor roll their wonted tribute to the deep. \\n\\n Turn then, impetuous! from our injured flood; \\n\\n Content, thy slaughters could amaze a god.\" \\n\\n In human form, confess\u0027d before his eyes, \\n\\n The river thus; and thus the chief replies: \\n\\n \"O sacred stream! thy word we shall obey; \\n\\n But not till Troy the destined vengeance pay, \\n\\n Not till within her towers the perjured train \\n\\n Shall pant, and tremble at our arms again; \\n\\n Not till proud Hector, guardian of her wall, \\n\\n Or stain this lance, or see Achilles fall.\" \\n\\n He said; and drove with fury on the foe. \\n\\n Then to the godhead of the silver bow \\n\\n The yellow flood began: \"O son of Jove! \\n\\n Was not the mandate of the sire above \\n\\n Full and express, that Phoebus should employ \\n\\n His sacred arrows in defence of Troy, \\n\\n And make her conquer, till Hyperion\u0027s fall \\n\\n In awful darkness hide the face of all?\" \\n\\n He spoke in vain—The chief without dismay \\n\\n Ploughs through the boiling surge his desperate way. \\n\\n Then rising in his rage above the shores, \\n\\n From all his deep the bellowing river roars, \\n\\n Huge heaps of slain disgorges on the coast, \\n\\n And round the banks the ghastly dead are toss\u0027d. \\n\\n While all before, the billows ranged on high, \\n\\n (A watery bulwark,) screen the bands who fly. \\n\\n Now bursting on his head with thundering sound, \\n\\n [pg 380] \\n\\n The falling deluge whelms the hero round: \\n\\n His loaded shield bends to the rushing tide; \\n\\n His feet, upborne, scarce the strong flood divide, \\n\\n Sliddering, and staggering. On the border stood \\n\\n A spreading elm, that overhung the flood; \\n\\n He seized a bending bough, his steps to stay; \\n\\n The plant uprooted to his weight gave way.270 \\n\\n Heaving the bank, and undermining all; \\n\\n Loud flash the waters to the rushing fall \\n\\n Of the thick foliage. The large trunk display\u0027d \\n\\n Bridged the rough flood across: the hero stay\u0027d \\n\\n On this his weight, and raised upon his hand, \\n\\n Leap\u0027d from the channel, and regain\u0027d the land. \\n\\n Then blacken\u0027d the wild waves: the murmur rose: \\n\\n The god pursues, a huger billow throws, \\n\\n And bursts the bank, ambitious to destroy \\n\\n The man whose fury is the fate of Troy. \\n\\n He like the warlike eagle speeds his pace \\n\\n (Swiftest and strongest of the aerial race); \\n\\n Far as a spear can fly, Achilles springs; \\n\\n At every bound his clanging armour rings: \\n\\n Now here, now there, he turns on every side, \\n\\n And winds his course before the following tide; \\n\\n The waves flow after, wheresoe\u0027er he wheels, \\n\\n And gather fast, and murmur at his heels. \\n\\n So when a peasant to his garden brings \\n\\n Soft rills of water from the bubbling springs, \\n\\n And calls the floods from high, to bless his bowers, \\n\\n And feed with pregnant streams the plants and flowers: \\n\\n Soon as he clears whate\u0027er their passage stay\u0027d, \\n\\n And marks the future current with his spade, \\n\\n Swift o\u0027er the rolling pebbles, down the hills, \\n\\n Louder and louder purl the falling rills; \\n\\n Before him scattering, they prevent his pains, \\n\\n And shine in mazy wanderings o\u0027er the plains. \\n\\n Still flies Achilles, but before his eyes \\n\\n Still swift Scamander rolls where\u0027er he flies: \\n\\n Not all his speed escapes the rapid floods; \\n\\n The first of men, but not a match for gods. \\n\\n Oft as he turn\u0027d the torrent to oppose, \\n\\n And bravely try if all the powers were foes; \\n\\n So oft the surge, in watery mountains spread, \\n\\n Beats on his back, or bursts upon his head. \\n\\n Yet dauntless still the adverse flood he braves, \\n\\n And still indignant bounds above the waves. \\n\\n Tired by the tides, his knees relax with toil; \\n\\n [pg 381] \\n\\n Wash\u0027d from beneath him slides the slimy soil; \\n\\n When thus (his eyes on heaven\u0027s expansion thrown) \\n\\n Forth bursts the hero with an angry groan: \\n\\n \"Is there no god Achilles to befriend, \\n\\n No power to avert his miserable end? \\n\\n Prevent, O Jove! this ignominious date,271 \\n\\n And make my future life the sport of fate. \\n\\n Of all heaven\u0027s oracles believed in vain, \\n\\n But most of Thetis must her son complain; \\n\\n By Phoebus\u0027 darts she prophesied my fall, \\n\\n In glorious arms before the Trojan wall. \\n\\n Oh! had I died in fields of battle warm, \\n\\n Stretch\u0027d like a hero, by a hero\u0027s arm! \\n\\n Might Hector\u0027s spear this dauntless bosom rend, \\n\\n And my swift soul o\u0027ertake my slaughter\u0027d friend. \\n\\n Ah no! Achilles meets a shameful fate, \\n\\n Oh how unworthy of the brave and great! \\n\\n Like some vile swain, whom on a rainy day, \\n\\n Crossing a ford, the torrent sweeps away, \\n\\n An unregarded carcase to the sea.\" \\n\\n Neptune and Pallas haste to his relief, \\n\\n And thus in human form address\u0027d the chief: \\n\\n The power of ocean first: \"Forbear thy fear, \\n\\n O son of Peleus! Lo, thy gods appear! \\n\\n Behold! from Jove descending to thy aid, \\n\\n Propitious Neptune, and the blue-eyed maid. \\n\\n Stay, and the furious flood shall cease to rave \\n\\n \u0027Tis not thy fate to glut his angry wave. \\n\\n But thou, the counsel heaven suggests, attend! \\n\\n Nor breathe from combat, nor thy sword suspend, \\n\\n Till Troy receive her flying sons, till all \\n\\n Her routed squadrons pant behind their wall: \\n\\n Hector alone shall stand his fatal chance, \\n\\n And Hector\u0027s blood shall smoke upon thy lance. \\n\\n Thine is the glory doom\u0027d.\" Thus spake the gods: \\n\\n Then swift ascended to the bright abodes. \\n\\n Stung with new ardour, thus by heaven impell\u0027d, \\n\\n He springs impetuous, and invades the field: \\n\\n O\u0027er all the expanded plain the waters spread; \\n\\n Heaved on the bounding billows danced the dead, \\n\\n Floating \u0027midst scatter\u0027d arms; while casques of gold \\n\\n And turn\u0027d-up bucklers glitter\u0027d as they roll\u0027d. \\n\\n High o\u0027er the surging tide, by leaps and bounds, \\n\\n He wades, and mounts; the parted wave resounds. \\n\\n Not a whole river stops the hero\u0027s course, \\n\\n While Pallas fills him with immortal force. \\n\\n With equal rage, indignant Xanthus roars, \\n\\n And lifts his billows, and o\u0027erwhelms his shores. \\n\\n [pg 382] \\n\\n Then thus to Simois! \"Haste, my brother flood; \\n\\n And check this mortal that controls a god; \\n\\n Our bravest heroes else shall quit the fight, \\n\\n And Ilion tumble from her towery height. \\n\\n Call then thy subject streams, and bid them roar, \\n\\n From all thy fountains swell thy watery store, \\n\\n With broken rocks, and with a load of dead, \\n\\n Charge the black surge, and pour it on his head. \\n\\n Mark how resistless through the floods he goes, \\n\\n And boldly bids the warring gods be foes! \\n\\n But nor that force, nor form divine to sight, \\n\\n Shall aught avail him, if our rage unite: \\n\\n Whelm\u0027d under our dark gulfs those arms shall lie, \\n\\n That blaze so dreadful in each Trojan eye; \\n\\n And deep beneath a sandy mountain hurl\u0027d, \\n\\n Immersed remain this terror of the world. \\n\\n Such ponderous ruin shall confound the place, \\n\\n No Greeks shall e\u0027er his perish\u0027d relics grace, \\n\\n No hand his bones shall gather, or inhume; \\n\\n These his cold rites, and this his watery tomb.\" \\n\\n \\n\\n Illustration: ACHILLES CONTENDING WITH THE RIVERS. \\n\\n ACHILLES CONTENDING WITH THE RIVERS. \\n\\n He said; and on the chief descends amain, \\n\\n Increased with gore, and swelling with the slain. \\n\\n Then, murmuring from his beds, he boils, he raves, \\n\\n And a foam whitens on the purple waves: \\n\\n At every step, before Achilles stood \\n\\n The crimson surge, and deluged him with blood. \\n\\n Fear touch\u0027d the queen of heaven: she saw dismay\u0027d, \\n\\n She call\u0027d aloud, and summon\u0027d Vulcan\u0027s aid. \\n\\n [pg 383] \\n\\n \"Rise to the war! the insulting flood requires \\n\\n Thy wasteful arm! assemble all thy fires! \\n\\n While to their aid, by our command enjoin\u0027d, \\n\\n Rush the swift eastern and the western wind: \\n\\n These from old ocean at my word shall blow, \\n\\n Pour the red torrent on the watery foe, \\n\\n Corses and arms to one bright ruin turn, \\n\\n And hissing rivers to their bottoms burn. \\n\\n Go, mighty in thy rage! display thy power, \\n\\n Drink the whole flood, the crackling trees devour. \\n\\n Scorch all the banks! and (till our voice reclaim) \\n\\n Exert the unwearied furies of the flame!\" \\n\\n The power ignipotent her word obeys: \\n\\n Wide o\u0027er the plain he pours the boundless blaze; \\n\\n At once consumes the dead, and dries the soil \\n\\n And the shrunk waters in their channel boil. \\n\\n As when autumnal Boreas sweeps the sky, \\n\\n And instant blows the water\u0027d gardens dry: \\n\\n So look\u0027d the field, so whiten\u0027d was the ground, \\n\\n While Vulcan breathed the fiery blast around. \\n\\n Swift on the sedgy reeds the ruin preys; \\n\\n Along the margin winds the running blaze: \\n\\n The trees in flaming rows to ashes turn, \\n\\n The flowering lotos and the tamarisk burn, \\n\\n Broad elm, and cypress rising in a spire; \\n\\n The watery willows hiss before the fire. \\n\\n Now glow the waves, the fishes pant for breath, \\n\\n The eels lie twisting in the pangs of death: \\n\\n Now flounce aloft, now dive the scaly fry, \\n\\n Or, gasping, turn their bellies to the sky. \\n\\n At length the river rear\u0027d his languid head, \\n\\n And thus, short-panting, to the god he said: \\n\\n \"Oh Vulcan! oh! what power resists thy might? \\n\\n I faint, I sink, unequal to the fight— \\n\\n I yield—Let Ilion fall; if fate decree— \\n\\n Ah—bend no more thy fiery arms on me!\" \\n\\n He ceased; wide conflagration blazing round; \\n\\n The bubbling waters yield a hissing sound. \\n\\n As when the flames beneath a cauldron rise,272 \\n\\n To melt the fat of some rich sacrifice, \\n\\n Amid the fierce embrace of circling fires \\n\\n The waters foam, the heavy smoke aspires: \\n\\n So boils the imprison\u0027d flood, forbid to flow, \\n\\n And choked with vapours feels his bottom glow. \\n\\n To Juno then, imperial queen of air, \\n\\n [pg 384] \\n\\n The burning river sends his earnest prayer: \\n\\n \"Ah why, Saturnia; must thy son engage \\n\\n Me, only me, with all his wasteful rage? \\n\\n On other gods his dreadful arm employ, \\n\\n For mightier gods assert the cause of Troy. \\n\\n Submissive I desist, if thou command; \\n\\n But ah! withdraw this all-destroying hand. \\n\\n Hear then my solemn oath, to yield to fate \\n\\n Unaided Ilion, and her destined state, \\n\\n Till Greece shall gird her with destructive flame, \\n\\n And in one ruin sink the Trojan name.\" \\n\\n His warm entreaty touch\u0027d Saturnia\u0027s ear: \\n\\n She bade the ignipotent his rage forbear, \\n\\n Recall the flame, nor in a mortal cause \\n\\n Infest a god: the obedient flame withdraws: \\n\\n Again the branching streams begin to spread, \\n\\n And soft remurmur in their wonted bed. \\n\\n While these by Juno\u0027s will the strife resign, \\n\\n The warring gods in fierce contention join: \\n\\n Rekindling rage each heavenly breast alarms: \\n\\n With horrid clangour shock the ethereal arms: \\n\\n Heaven in loud thunder bids the trumpet sound; \\n\\n And wide beneath them groans the rending ground. \\n\\n Jove, as his sport, the dreadful scene descries, \\n\\n And views contending gods with careless eyes. \\n\\n The power of battles lifts his brazen spear, \\n\\n And first assaults the radiant queen of war: \\n\\n \"What moved thy madness, thus to disunite \\n\\n Ethereal minds, and mix all heaven in fight? \\n\\n What wonder this, when in thy frantic mood \\n\\n Thou drovest a mortal to insult a god? \\n\\n Thy impious hand Tydides\u0027 javelin bore, \\n\\n And madly bathed it in celestial gore.\" \\n\\n He spoke, and smote the long-resounding shield, \\n\\n Which bears Jove\u0027s thunder on its dreadful field: \\n\\n The adamantine aegis of her sire, \\n\\n That turns the glancing bolt and forked fire. \\n\\n Then heaved the goddess in her mighty hand \\n\\n A stone, the limit of the neighbouring land, \\n\\n There fix\u0027d from eldest times; black, craggy, vast; \\n\\n This at the heavenly homicide she cast. \\n\\n Thundering he falls, a mass of monstrous size: \\n\\n And seven broad acres covers as he lies. \\n\\n The stunning stroke his stubborn nerves unbound: \\n\\n Loud o\u0027er the fields his ringing arms resound: \\n\\n The scornful dame her conquest views with smiles, \\n\\n And, glorying, thus the prostrate god reviles: \\n\\n \"Hast thou not yet, insatiate fury! known \\n\\n How far Minerva\u0027s force transcends thy own? \\n\\n Juno, whom thou rebellious darest withstand, \\n\\n [pg 385] \\n\\n Corrects thy folly thus by Pallas\u0027 hand; \\n\\n Thus meets thy broken faith with just disgrace, \\n\\n And partial aid to Troy\u0027s perfidious race.\" \\n\\n The goddess spoke, and turn\u0027d her eyes away, \\n\\n That, beaming round, diffused celestial day. \\n\\n Jove\u0027s Cyprian daughter, stooping on the land, \\n\\n Lent to the wounded god her tender hand: \\n\\n Slowly he rises, scarcely breathes with pain, \\n\\n And, propp\u0027d on her fair arm, forsakes the plain. \\n\\n This the bright empress of the heavens survey\u0027d, \\n\\n And, scoffing, thus to war\u0027s victorious maid: \\n\\n \"Lo! what an aid on Mars\u0027s side is seen! \\n\\n The smiles\u0027 and loves\u0027 unconquerable queen! \\n\\n Mark with what insolence, in open view, \\n\\n She moves: let Pallas, if she dares, pursue.\" \\n\\n Minerva smiling heard, the pair o\u0027ertook, \\n\\n And slightly on her breast the wanton strook: \\n\\n She, unresisting, fell (her spirits fled); \\n\\n On earth together lay the lovers spread. \\n\\n \"And like these heroes be the fate of all \\n\\n (Minerva cries) who guard the Trojan wall! \\n\\n To Grecian gods such let the Phrygian be, \\n\\n So dread, so fierce, as Venus is to me; \\n\\n Then from the lowest stone shall Troy be moved.\" \\n\\n Thus she, and Juno with a smile approved. \\n\\n Meantime, to mix in more than mortal fight, \\n\\n The god of ocean dares the god of light. \\n\\n \"What sloth has seized us, when the fields around \\n\\n Ring with conflicting powers, and heaven returns the sound: \\n\\n Shall, ignominious, we with shame retire, \\n\\n No deed perform\u0027d, to our Olympian sire? \\n\\n Come, prove thy arm! for first the war to wage, \\n\\n Suits not my greatness, or superior age: \\n\\n Rash as thou art to prop the Trojan throne, \\n\\n (Forgetful of my wrongs, and of thy own,) \\n\\n And guard the race of proud Laomedon! \\n\\n Hast thou forgot, how, at the monarch\u0027s prayer, \\n\\n We shared the lengthen\u0027d labours of a year? \\n\\n Troy walls I raised (for such were Jove\u0027s commands), \\n\\n And yon proud bulwarks grew beneath my hands: \\n\\n Thy task it was to feed the bellowing droves \\n\\n Along fair Ida\u0027s vales and pendant groves. \\n\\n But when the circling seasons in their train \\n\\n Brought back the grateful day that crown\u0027d our pain, \\n\\n With menace stern the fraudful king defied \\n\\n Our latent godhead, and the prize denied: \\n\\n Mad as he was, he threaten\u0027d servile bands, \\n\\n And doom\u0027d us exiles far in barbarous lands.273 \\n\\n [pg 386] \\n\\n Incensed, we heavenward fled with swiftest wing, \\n\\n And destined vengeance on the perjured king. \\n\\n Dost thou, for this, afford proud Ilion grace, \\n\\n And not, like us, infest the faithless race; \\n\\n Like us, their present, future sons destroy, \\n\\n And from its deep foundations heave their Troy?\" \\n\\n Apollo thus: \"To combat for mankind \\n\\n Ill suits the wisdom of celestial mind; \\n\\n For what is man? Calamitous by birth, \\n\\n They owe their life and nourishment to earth; \\n\\n Like yearly leaves, that now, with beauty crown\u0027d, \\n\\n Smile on the sun; now, wither on the ground. \\n\\n To their own hands commit the frantic scene, \\n\\n Nor mix immortals in a cause so mean.\" \\n\\n Then turns his face, far-beaming heavenly fires, \\n\\n And from the senior power submiss retires: \\n\\n Him thus retreating, Artemis upbraids, \\n\\n The quiver\u0027d huntress of the sylvan shades: \\n\\n \"And is it thus the youthful Phoebus flies, \\n\\n And yields to ocean\u0027s hoary sire the prize? \\n\\n How vain that martial pomp, and dreadful show \\n\\n Of pointed arrows and the silver bow! \\n\\n Now boast no more in yon celestial bower, \\n\\n Thy force can match the great earth-shaking power.\" \\n\\n Silent he heard the queen of woods upbraid: \\n\\n Not so Saturnia bore the vaunting maid: \\n\\n But furious thus: \"What insolence has driven \\n\\n Thy pride to face the majesty of heaven? \\n\\n What though by Jove the female plague design\u0027d, \\n\\n Fierce to the feeble race of womankind, \\n\\n The wretched matron feels thy piercing dart; \\n\\n Thy sex\u0027s tyrant, with a tiger\u0027s heart? \\n\\n What though tremendous in the woodland chase \\n\\n Thy certain arrows pierce the savage race? \\n\\n How dares thy rashness on the powers divine \\n\\n Employ those arms, or match thy force with mine? \\n\\n Learn hence, no more unequal war to wage—\" \\n\\n She said, and seized her wrists with eager rage; \\n\\n These in her left hand lock\u0027d, her right untied \\n\\n The bow, the quiver, and its plumy pride. \\n\\n About her temples flies the busy bow; \\n\\n Now here, now there, she winds her from the blow; \\n\\n The scattering arrows, rattling from the case, \\n\\n drop round, and idly mark the dusty place. \\n\\n Swift from the field the baffled huntress flies, \\n\\n And scarce restrains the torrent in her eyes: \\n\\n So, when the falcon wings her way above, \\n\\n To the cleft cavern speeds the gentle dove; \\n\\n (Not fated yet to die;) there safe retreats, \\n\\n Yet still her heart against the marble beats. \\n\\n To her Latona hastes with tender care; \\n\\n [pg 387] \\n\\n Whom Hermes viewing, thus declines the war: \\n\\n \"How shall I face the dame, who gives delight \\n\\n To him whose thunders blacken heaven with night? \\n\\n Go, matchless goddess! triumph in the skies, \\n\\n And boast my conquest, while I yield the prize.\" \\n\\n He spoke; and pass\u0027d: Latona, stooping low, \\n\\n Collects the scatter\u0027d shafts and fallen bow, \\n\\n That, glittering on the dust, lay here and there \\n\\n Dishonour\u0027d relics of Diana\u0027s war: \\n\\n Then swift pursued her to her blest abode, \\n\\n Where, all confused, she sought the sovereign god; \\n\\n Weeping, she grasp\u0027d his knees: the ambrosial vest \\n\\n Shook with her sighs, and panted on her breast. \\n\\n The sire superior smiled, and bade her show \\n\\n What heavenly hand had caused his daughter\u0027s woe? \\n\\n Abash\u0027d, she names his own imperial spouse; \\n\\n And the pale crescent fades upon her brows. \\n\\n Thus they above: while, swiftly gliding down, \\n\\n Apollo enters Ilion\u0027s sacred town; \\n\\n The guardian-god now trembled for her wall, \\n\\n And fear\u0027d the Greeks, though fate forbade her fall. \\n\\n Back to Olympus, from the war\u0027s alarms, \\n\\n Return the shining bands of gods in arms; \\n\\n Some proud in triumph, some with rage on fire; \\n\\n And take their thrones around the ethereal sire. \\n\\n Through blood, through death, Achilles still proceeds, \\n\\n O\u0027er slaughter\u0027d heroes, and o\u0027er rolling steeds. \\n\\n As when avenging flames with fury driven \\n\\n On guilty towns exert the wrath of heaven; \\n\\n The pale inhabitants, some fall, some fly; \\n\\n And the red vapours purple all the sky: \\n\\n So raged Achilles: death and dire dismay, \\n\\n And toils, and terrors, fill\u0027d the dreadful day. \\n\\n High on a turret hoary Priam stands, \\n\\n And marks the waste of his destructive hands; \\n\\n Views, from his arm, the Trojans\u0027 scatter\u0027d flight, \\n\\n And the near hero rising on his sight! \\n\\n No stop, no check, no aid! With feeble pace, \\n\\n And settled sorrow on his aged face, \\n\\n Fast as he could, he sighing quits the walls; \\n\\n And thus descending, on the guards he calls: \\n\\n \"You to whose care our city-gates belong, \\n\\n Set wide your portals to the flying throng: \\n\\n For lo! he comes, with unresisted sway; \\n\\n He comes, and desolation marks his way! \\n\\n But when within the walls our troops take breath, \\n\\n Lock fast the brazen bars, and shut out death.\" \\n\\n Thus charged the reverend monarch: wide were flung \\n\\n The opening folds; the sounding hinges rung. \\n\\n Phoebus rush\u0027d forth, the flying bands to meet; \\n\\n [pg 388] \\n\\n Struck slaughter back, and cover\u0027d the retreat, \\n\\n On heaps the Trojans crowd to gain the gate, \\n\\n And gladsome see their last escape from fate. \\n\\n Thither, all parch\u0027d with thirst, a heartless train, \\n\\n Hoary with dust, they beat the hollow plain: \\n\\n And gasping, panting, fainting, labour on \\n\\n With heavier strides, that lengthen toward the town. \\n\\n Enraged Achilles follows with his spear; \\n\\n Wild with revenge, insatiable of war. \\n\\n Then had the Greeks eternal praise acquired, \\n\\n And Troy inglorious to her walls retired; \\n\\n But he, the god who darts ethereal flame, \\n\\n Shot down to save her, and redeem her fame: \\n\\n To young Agenor force divine he gave; \\n\\n (Antenor\u0027s offspring, haughty, bold, and brave;) \\n\\n In aid of him, beside the beech he sate, \\n\\n And wrapt in clouds, restrain\u0027d the hand of fate. \\n\\n When now the generous youth Achilles spies. \\n\\n Thick beats his heart, the troubled motions rise. \\n\\n (So, ere a storm, the waters heave and roll.) \\n\\n He stops, and questions thus his mighty soul; \\n\\n \"What, shall I fly this terror of the plain! \\n\\n Like others fly, and be like others slain? \\n\\n Vain hope! to shun him by the self-same road \\n\\n Yon line of slaughter\u0027d Trojans lately trod. \\n\\n No: with the common heap I scorn to fall— \\n\\n What if they pass\u0027d me to the Trojan wall, \\n\\n While I decline to yonder path, that leads \\n\\n To Ida\u0027s forests and surrounding shades? \\n\\n So may I reach, conceal\u0027d, the cooling flood, \\n\\n From my tired body wash the dirt and blood, \\n\\n As soon as night her dusky veil extends, \\n\\n Return in safety to my Trojan friends. \\n\\n What if?—But wherefore all this vain debate? \\n\\n Stand I to doubt, within the reach of fate? \\n\\n Even now perhaps, ere yet I turn the wall, \\n\\n The fierce Achilles sees me, and I fall: \\n\\n Such is his swiftness, \u0027tis in vain to fly, \\n\\n And such his valour, that who stands must die. \\n\\n Howe\u0027er \u0027tis better, fighting for the state, \\n\\n Here, and in public view, to meet my fate. \\n\\n Yet sure he too is mortal; he may feel \\n\\n (Like all the sons of earth) the force of steel. \\n\\n One only soul informs that dreadful frame: \\n\\n And Jove\u0027s sole favour gives him all his fame.\" \\n\\n He said, and stood, collected, in his might; \\n\\n And all his beating bosom claim\u0027d the fight. \\n\\n So from some deep-grown wood a panther starts, \\n\\n Roused from his thicket by a storm of darts: \\n\\n Untaught to fear or fly, he hears the sounds \\n\\n [pg 389] \\n\\n Of shouting hunters, and of clamorous hounds; \\n\\n Though struck, though wounded, scarce perceives the pain; \\n\\n And the barb\u0027d javelin stings his breast in vain: \\n\\n On their whole war, untamed, the savage flies; \\n\\n And tears his hunter, or beneath him dies. \\n\\n Not less resolved, Antenor\u0027s valiant heir \\n\\n Confronts Achilles, and awaits the war, \\n\\n Disdainful of retreat: high held before, \\n\\n His shield (a broad circumference) he bore; \\n\\n Then graceful as he stood, in act to throw \\n\\n The lifted javelin, thus bespoke the foe: \\n\\n \"How proud Achilles glories in his fame! \\n\\n And hopes this day to sink the Trojan name \\n\\n Beneath her ruins! Know, that hope is vain; \\n\\n A thousand woes, a thousand toils remain. \\n\\n Parents and children our just arms employ, \\n\\n And strong and many are the sons of Troy. \\n\\n Great as thou art, even thou may\u0027st stain with gore \\n\\n These Phrygian fields, and press a foreign shore.\" \\n\\n He said: with matchless force the javelin flung \\n\\n Smote on his knee; the hollow cuishes rung \\n\\n Beneath the pointed steel; but safe from harms \\n\\n He stands impassive in the ethereal arms. \\n\\n Then fiercely rushing on the daring foe, \\n\\n His lifted arm prepares the fatal blow: \\n\\n But, jealous of his fame, Apollo shrouds \\n\\n The god-like Trojan in a veil of clouds. \\n\\n Safe from pursuit, and shut from mortal view, \\n\\n Dismiss\u0027d with fame, the favoured youth withdrew. \\n\\n Meanwhile the god, to cover their escape, \\n\\n Assumes Agenor\u0027s habit, voice and shape, \\n\\n Flies from the furious chief in this disguise; \\n\\n The furious chief still follows where he flies. \\n\\n Now o\u0027er the fields they stretch with lengthen\u0027d strides, \\n\\n Now urge the course where swift Scamander glides: \\n\\n The god, now distant scarce a stride before, \\n\\n Tempts his pursuit, and wheels about the shore; \\n\\n While all the flying troops their speed employ, \\n\\n And pour on heaps into the walls of Troy: \\n\\n No stop, no stay; no thought to ask, or tell, \\n\\n Who \u0027scaped by flight, or who by battle fell. \\n\\n \u0027Twas tumult all, and violence of flight; \\n\\n And sudden joy confused, and mix\u0027d affright. \\n\\n Pale Troy against Achilles shuts her gate: \\n\\n And nations breathe, deliver\u0027d from their fate. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1549/46007.html","bookId":1297,"book":{"id":1297,"title":"The Iliad of Homer 伊利亚特","description":"简介： 《伊利亚特》，或力量之诗 西蒙娜薇依Simone Weil著 吴雅凌译 《伊利亚特》的真正主角、真正主题和中心是力量。人类所操纵的力量，人类被制服的力量，在力量面前人的肉身一再缩退。在诗中，人的灵魂由于与力量的关系而不停产生变化，灵魂自以为拥有力量，却被力量所牵制...","cover":"http://novel.tingroom.com/file/upload/201605/03/10-49-56-55-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1549","creation":"Aug 1, 2019 12:24:49 AM","modification":"Aug 1, 2019 12:24:49 AM"}}
