{"id":10933,"no":60,"title":"Chapter 16. Tom Orange.","content":"Little Miss Amy had a slight cold, and the next tea-party was put off for a day. On the evening following Harry’s visit at Stanlake Farm, Marjory Trevellian being at that time absent in the village to make some frugal purchases, who should suddenly appear before the little boy’s eyes, as he lifted them from his fleet upon the pond, but his friend, Tom Orange, as usual in high and delightful spirits. \n \n Need I say how welcome Tom was? He asked in a minute or two for Marjory, and took her temporary absence with great good-humour. Tom affected chilliness, and indeed the evening was a little sharp, and proposed that they should retire to the cottage, and sit down there. \n \n “How soon do you suppose, youngster, the-old hen will come home?” \n \n “Who?” \n \n “Marjory Daw, down the chimney.” \n \n “Oh, Granny!” \n \n This nickname was the only pleasantry of Mr. Orange which did not quite please the boy. \n \n Tom Orange here interpolated his performance of the jackdaw, with his eyelids turned inside out and the pupils quivering, which, although it may possibly have resembled the jackdaw of heraldry, was not an exact portraiture of the bird familiar to us in natural history; and when this was over he asked again—“How soon will she be home?” \n \n “She walked down to the town, and I think she can’t be more than about half-way back again.” \n \n “That’s a mile, and three miles au hour is the best of her paces if she was runnin’ for a pound o’ sausages and a new cap. \n \n Heigh ho! and alas and alack—a—day. No one at home but the maid, and the maid’s gone to church! I wrote her a letter the day before yesterday, and I must read it again before she comes back. Where does she keep her letters? ” \n \n “In her work-box on the shelf.” \n \n “This will be it, the wery identical fiddle!” said Tom Orange, playfully, setting it down upon the little deal table, and, opening it, he took out the little sheaf of letters from the end, and took them one by one to the window, where he took the liberty of reading them. \n \n I think he was disappointed, for he pitched them back again into their nook in the little trunk-shaped box contemptuously. \n \n The boy regarded Tom Orange as a friend of the family so confidential, and as a man in all respects so admirable and virtuous, that nothing appeared more desirable and natural than that excellent person’s giving his attention to the domestic correspondence. \n \n He popped the box back again in its berth. \n \n Then he treated the young gentleman to Lingo’s song with the rag-tag-merry-derry perrywig and hatband, \u0026c., and at the conclusion of the performance admitted that he was “dry,” and with a pleasant wink, and the tip of his finger pushing the end of his nose a good deal to the left, he asked him whether he could tell him where Mrs. Trevellian, who would be deeply grieved if she thought that Tom was detained for a drink till her return, kept her liquor. \n \n “Yes, I can show you,” said the boy. \n \n “Wait a minute, my guide, my comforter, and friend,” said Tom Orange; and he ascertained from the door-stone that no one was inconveniently near. \n \n The boy was getting a tea-cup off the shelf. \n \n “Never mind sugar, my hero, I’ll sweeten it with a thought of Marjory Daw.” \n \n The boy explained, and led him into the dark nook by the hall door. Tom Orange, well pleased, moved almost on tip-toe, and looked curiously and spoke under his breath, as he groped in this twilight. \n \n “Here it is,” said the boy, frankly. \n \n “Where?” \n \n “Here.” \n \n “This!” said Tom, for his friend had uncovered a crock of water. \n \n Tom Orange glared at him and at the water with grotesque surprise, and the bona fides of the boy and the simplicity of the situation struck Tom comically, and, exploding good-humouredly, he sat down in Marjory’s chair and laughed hilariously. \n \n Having satisfied himself by a confidential dialogue that Marjory Daw had no private bottle of comfort anywhere, this agreeable fellow so far forgot his thirst, that he did not mind drawing water from the crock, and talked on a variety of subjects to the young gentleman. In the course of this conversation he asked him two topographical questions. One was— \n \n “Did you ever hear of a place called Car well Grange?” \n \n And the other resembled it. \n \n “Did you ever hear of a place called Wyvern?” \n \n “No.” \n \n “Think, lad. Did you never hear Mrs. Trevellian speak of Wyvern? Or of Carwell Grange?” \n \n “No.” \n \n “Because there is the tallest mushroom you ever saw in your life growing there, and it is grown to that degree that it blocks the door so that the Squire can’t get into his own house, and the mushroom is counted one of the wonders of the world, upon my little word of honour as a gentleman! And \n \n ‘Since there’s neither drink nor victuals, \n \n Suppose, my lord, we play at skittles?’ \n \n And if she’s not back by the end of the game, tell her I had to go on to the bridge to see lame Bill Withershins, and I’ll be back again this evening, I think, or in the morning at latest.” \n \n The game was played, but Marjory did not appear, and Tom Orange, entertaining his young friend with a ludicrous imitation of Bill Withershins’ knock-knees, took his departure, leaving his delighted companion in the state which Moore describes as being usual \n \n “When the lamp that lighted \n \n The traveller at first goes out.” \n \n So, having watched Tom till he was quite out of sight, he returned to his neglected navy on the pond, and delivered his admirable Crichton’s message to Marjory Daw on her return. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1434/43217.html","bookId":1373,"book":{"id":1373,"title":"The Wyvern Mystery 蜿龙庄园","description":"简介： In the small breakfast parlour of Oulton, a pretty girl, Miss Alice Maybell, with her furs and wrappers about her, and a journey of forty miles before hernot by railto Wyvern, had stood up to hug and kiss her old aunt, and bid her good-bye....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1434","creation":"Aug 1, 2019 12:24:56 AM","modification":"Aug 1, 2019 12:24:56 AM"}}
