{"id":73876,"no":12,"title":"Page 12","content":"He doesn’t knock, either.\\n\\n I’m slipping on my shoes when he walks in without a single word, without even an effort to make his presence known. His eyes are falling all over my frame. My jaw tightens on its own.\\n\\n “You hurt him,” I find myself saying.\\n\\n “You shouldn’t care,” he says with a tilt of his head, gesturing to my dress. “But it’s obvious you do.”\\n\\n I zip my lips and pray my hands aren’t shaking too much. I don’t know where Adam is. I don’t know how badly he’s hurt. I don’t know what Warner will do, how far he’ll go in the pursuit of what he wants but the prospect of Adam in pain is like a cold hand clutching my esophagus. I can’t catch my breath. I feel like I’m struggling to swallow a toothpick. If Adam is trying to help me it could cost him his life.\\n\\n I touch the piece of paper tucked into my pocket.\\n\\n Breathe.\\n\\n Warner’s eyes are on my window.\\n\\n Breathe.\\n\\n “It’s time to go,” he says.\\n\\n Breathe.\\n\\n “Where are we going?”\\n\\n He doesn’t answer.\\n\\n We step out the door. I look around. The hallway is abandoned; empty. “Where is Adam everyone . . . ?”\\n\\n “I really like that dress,” Warner says as he slips an arm around my waist. I jerk away but he pulls me along, guiding me toward the elevator. “The fit is spectacular. It helps distract me from all your questions.”\\n\\n “Your poor mother.”\\n\\n Warner almost trips over his own feet. His eyes are wide; alarmed. He stops a few feet short of our goal. Spins around. “What do you mean?”\\n\\n My stomach falls over.\\n\\n The look on his face: the unguarded strain, the flinching terror, the sudden apprehension in his features.\\n\\n I was trying to make a joke, is what I don’t say to him. I feel sorry for your poor mother, is what I was going to say to him, that she has to deal with such a miserable, pathetic son. But I don’t say any of it.\\n\\n He grabs my hands, focuses my eyes. Urgency is pulsing at his temples. “What do you mean?” he insists.\\n\\n “N-nothing,” I stammer. My voice breaks in half. “I didn’t—it was just a joke—”\\n\\n Warner drops my hands like they’ve burned him. He looks away. Charges toward the elevator and doesn’t wait for me to catch up.\\n\\n I wonder what he’s not telling me.\\n\\n Only once we’ve gone down several floors and are making our way down an unfamiliar hall toward an unfamiliar exit does he finally look at me. He offers me 4 words.\\n\\n “Welcome to your future.”\\n\\n Chapter Seventeen\\n\\n I’m swimming in sunlight.\\n\\n Warner is holding open a door that leads directly outside and I’m so unprepared for the experience I can hardly see straight. He grips my elbow to steady my path and I glance back at him.\\n\\n “We’re going outside.” I say it because I have to say it out loud. Because the outside world is a treat I’m so seldom offered. Because I don’t know if Warner is trying to be nice again. I look from him to what looks like a concrete courtyard and back to him again. “What are we doing outside?”\\n\\n “We have some business to take care of.” He tugs me toward the center of this new universe and I’m breaking away from him, reaching out to touch the sky like I’m hoping it will remember me. The clouds are gray like they’ve always been, but they’re sparse and unassuming. The sun is high high high, lounging against a backdrop propping up its rays and redirecting its warmth in our general direction. I stand on tiptoe and try to touch it. The wind folds itself into my arms and smiles against my skin. Cool, silky-smooth air braids a soft breeze through my hair. This square courtyard could be my ballroom.\\n\\n I want to dance with the elements.\\n\\n Warner grabs my hand. I turn around.\\n\\n He’s smiling.\\n\\n “This,” he says, gesturing to the cold gray world under our feet, “this makes you happy?”\\n\\n I look around. I realize the courtyard is not quite a roof, but somewhere between two buildings. I edge toward the ledge and can see dead land and naked trees and scattered compounds stretching on for miles. “Cold air smells so clean,” I tell him. “Fresh. Brand-new. It’s the most wonderful smell in the world.”\\n\\n His eyes look amused, troubled, interested, and confused all at once. He shakes his head. Pats down his jacket and reaches for an inside pocket. He pulls out a gun with a gold hilt that glints in the sunlight.\\n\\n I pull in a sharp breath.\\n\\n He inspects the gun in a way I wouldn’t understand, presumably to check whether or not it’s ready to fire. He slips it into his hand, his finger poised directly over the trigger. He turns and finally reads the expression on my face.\\n\\n He almost laughs. “Don’t worry. It’s not for you.”\\n\\n “Why do you have a gun?” I swallow, hard, gripping my arms tight across my chest. “What are we doing up here?”\\n\\n Warner slips the gun back into his pocket and walks to the opposite end of the ledge. He motions for me to follow him. I creep closer. Follow his eyes. Peer over the barrier.\\n\\n Every soldier in the building is standing not 15 feet below.\\n\\n I distinguish almost 50 lines, each perfectly straight, perfectly spaced, so many soldiers standing single file I lose count. I wonder if Adam is in the crowd. I wonder if he can see me.\\n\\n I wonder what he thinks of me now.\\n\\n The soldiers are standing in a square space almost identical to the one Warner and I occupy, but they’re one organized mass of black: black pants, black shirts, shin-high black boots; not a single gun in sight. Each is standing with his left fist pressed to his heart. Frozen in place.\\n\\n Black and gray\\n\\n black and gray\\n\\n black and gray\\n\\n bleak.\\n\\n Suddenly I’m acutely aware of my impractical outfit. Suddenly the wind is too callous, too cold, too painful as it slices its way through the crowd. I shiver and it has nothing to do with the temperature. I look for Warner but he has already taken his place at the edge of the courtyard; it’s obvious he’s done this many times before. He pulls a small square of perforated metal out of his pocket and presses it to his lips; when he speaks, his voice carries over the crowd like it’s been amplified.\\n\\n “Sector 45.”\\n\\n One word. One number.\\n\\n The entire group shifts: left fists released, dropped to their sides; right fists planted in place on their chests. They are an oiled machine, working in perfect collaboration with one another. If I weren’t so apprehensive I think I’d be impressed.\\n\\n “We have two matters to deal with this morning.” Warner’s voice penetrates the atmosphere: crisp, clear, unbearably confident. “The first is standing by my side.”\\n\\n Thousands of eyes snap up in my direction. I feel myself flinch.\\n\\n “Juliette, come here, please.” 2 fingers bend in 2 places to beckon me forward.\\n\\n I inch into view.\\n\\n Warner slips his arm around me. I cringe. The crowd starts. My heart careens out of control. I’m too scared to back away from him. His gun is too close to my body.\\n\\n The soldiers seem stunned that Warner is willing to touch me.\\n\\n “Jenkins, would you step forward, please?”\\n\\n My fingers are running a marathon down my thigh. I can’t stand still. I can’t calm the palpitations crashing my nervous system. Jenkins steps out of line; I spot him immediately.\\n\\n He’s okay.\\n\\n Dear God.\\n\\n He’s okay.\\n\\n “Jenkins had the pleasure of meeting Juliette just last night,” he continues. The tension among the men is very nearly tangible. No one, it seems, knows where this speech is headed. And no one, it seems, hasn’t already heard Jenkins’ story. My story. “I hope you’ll all greet her with the same sort of kindness,” Warner adds, his lips laughing without a sound. “She will be with us for some time, and will be a very valuable asset to our efforts. The Reestablishment welcomes her. I welcome her. You should welcome her.”\\n\\n The soldiers drop their fists all at once, all at exactly the same time.\\n\\n They shift as one, 5 steps backward, 5 steps forward, 5 steps standing in place. They raise their left arms high and curl their fingers into a fist.\\n\\n And fall on one knee.\\n\\n I run to the edge, desperate to get a closer look at such a strangely choreographed routine. I’ve never seen anything like it.\\n\\n Warner makes them stay like that, bent like that, fists raised in the air like that. He doesn’t speak for at least 30 seconds. And then he does.\\n\\n “Good.”\\n\\n The soldiers rise and rest their right fists on their chests again.\\n\\n “The second matter at hand is even more pleasant than the first,” Warner continues, though he seems to take no pleasure in saying it. His eyes are sharpening over the soldiers below, shards of emerald flickering like green flames over their bodies. “Delalieu has a report for us.”\\n\\n He spends an eternity simply staring at the soldiers, letting his few words marinate in their minds. Letting their own imaginations drive them insane. Letting the guilty among them tremble in anguish.\\n\\n Warner says nothing for so long.\\n\\n No one moves for so long.\\n\\n I begin to fear for my life despite his earlier reassurances. I begin to wonder if perhaps I am the guilty one. If perhaps the gun in his pocket is destined for me. I finally dare to turn in his direction. He glances at me for the first time and I have no idea how to read him.\\n\\n His face is 10,000 possibilities staring straight through me.\\n\\n “Delalieu,” he says, still looking at me. “You may step forward.”\\n\\n A thin, balding sort of man in a slightly more decorated outfit steps out from the very front of the fifth line. He doesn’t look entirely stable. He ducks his head an inch. His voice warbles when he speaks. “Sir.”\\n\\n Warner finally unshackles my eyes and nods, almost imperceptibly, in the balding man’s direction.\\n\\n Delalieu recites: “We have a charge against Private 45B-76423. Fletcher, Seamus.”\\n\\n The soldiers are all frozen in line, frozen in relief, frozen in fear, frozen in anxiety. Nothing moves. Nothing breathes. Even the wind is afraid to make a sound.\\n\\n “Fletcher.” One word from Warner and several hundred necks snap in the same direction.\\n\\n Fletcher steps out of line.\\n\\n He looks like a gingerbread man. Ginger hair. Ginger freckles. Lips almost artificially red. His face is blank of every possible emotion.\\n\\n I’ve never been more afraid for a stranger in my life.\\n\\n Delalieu speaks again. “Private Fletcher was found on unregulated grounds, fraternizing with civilians believed to be rebel party members. He had stolen food and supplies from storage units dedicated to Sector 45 citizens. It is not known whether he betrayed sensitive information.”\\n\\n Warner levels his gaze at the gingerbread man. “Do you deny these accusations, soldier?”\\n\\n Fletcher’s nostrils flare. His jaw tenses. His voice cracks when he speaks. “No, sir.”\\n\\n Warner nods. Takes a short breath. Licks his lips.\\n\\n And shoots him in the forehead.\\n\\n Chapter Eighteen\\n\\n No one moves.\\n\\n Fletcher’s face is etched in permanent horror as he crumbles to the ground. I’m so struck by the impossibility of it all that I can’t decide whether or not I’m dreaming, I can’t determine whether or not I’m dying, I can’t figure out whether or not fainting is a good idea. \\n\\n","sourceLink":"https://allnovel.net/shatter-me-shatter-me-1/page-12.html","bookId":1771,"book":{"id":1771,"title":"Shatter Me (Shatter Me #1)","description":"Storyline: Shatter Me (Shatter Me #1) \\n I have a curse \\n I have a gift \\n I am a monster \\n I\u0027m more than human \\n My touch is lethal \\n My touch is power \\n I am their weapon \\n I will fight back \\n Juliette hasn’t touched anyone in exactly 264 days. \\n The last time she did, it was an accident, but The Reestablishment locked her up for murder. No one knows why Juliette’s touch is fatal. As long as she doesn’t hurt anyone else, no one really cares. The world is too busy crumbling to pieces to pay attention to a 17-year-old girl. Diseases are destroying the population, food is hard to find, birds don’t fly anymore, and the clouds are the wrong color. \\n The Reestablishment said their way was the only way to fix things, so they threw Juliette in a cell. Now so many people are dead that the survivors are whispering war – and The Reestablishment has changed its mind. Maybe Juliette is more than a tortured soul stuffed into a poisonous body. Maybe she’s exactly what they need right now. \\n Juliette has to make a choice: Be a weapon. Or be a warrior.\\n","cover":"https://allnovel.net/images/shatter-me-shatter-me-1.jpg","author":"Tahereh Mafi","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/shatter-me-shatter-me-1.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:28:48 AM"}}
