{"id":73898,"no":34,"title":"Page 34","content":"“You gave a ten-year-old a sleeping pill?” I’m afraid I’m going to break his neck.\n “Would you rather he were awake for all of this?”\n “Adam is going to kill you.”\n Kenji glances at Adam’s drooping lids. “Yeah, well, I guess I’m lucky he won’t be able to kill me tonight.” He hesitates. Ducks into the car to run his fingers through James’s hair. Smiles a little. “The kid is a saint. He’ll be perfect in the morning.”\n “I can’t believe you—”\n “Hey, hey—” He holds up his hands. “Trust me. He’s going to be just fine. I just didn’t want him to be any more traumatized than he had to be.” He shrugs. “Hell, maybe Adam will agree with me.”\n “I’m going to murder you.” Adam’s voice is a soft mumble.\n Kenji laughs. “Keep it together, bro, or I’ll think you don’t really mean it.”\n Kenji disappears.\n I watch Adam, encourage him to stay awake. Tell him he’s almost safe. Touch my lips to his forehead. Study every shadow, every outline, every cut and bruise of his face. His muscles relax, his features lose their tension. He exhales a little more easily. I kiss his top lip. Kiss his bottom lip. Kiss his cheeks. His nose. His chin.\n Everything happens so quickly after that.\n 4 people run out toward the car. 2 older than me, 2 older than them. A pair of men. A pair of women. “Where is he?” the older woman asks. They’re all looking around, anxious. I wonder if they can see me staring at them.\n Kenji opens Adam’s door. Kenji is no longer smiling. In fact, he looks . . . different. Stronger. Faster. Taller, even. He’s in control. A figure of authority. These people know him.\n Adam is lifted onto the stretcher and assessed immediately. Everyone is talking at once. Something about broken ribs. Something about losing blood. Something about airways and lung capacity and what happened to his wrists? Something about checking his pulse and how long has he been bleeding? The young male and female glance in my direction. They’re all wearing strange outfits.\n Strange suits. All white with gray stripes down the side. I wonder if it’s a medical uniform.\n They’re carrying Adam away.\n “Wait—” I trip out of the car. “Wait! I want to go with him—”\n “Not now.” Kenji stops me. Softens. “You can’t be with him for what they need to do. Not now.”\n “What do you mean? What are they going to do to him?” The world is fading in and out of focus, shades of gray flickering as stilted frames, broken movements. Suddenly nothing makes sense. Suddenly everything is confusing me. Suddenly my head is a piece of pavement and I’m being trampled to death. I don’t know where we are. I don’t know who Kenji is. Kenji was Adam’s friend. Adam knows him. Adam. My Adam. Adam who is being taken away from me and I can’t go with him and I want to go with him but they won’t let me go with him and I don’t know why—\n “They’re going to help him—Juliette—I need you to focus. You can’t fall apart right now. I know it’s been a crazy day—but I need you to stay calm.” His voice. So steady. So suddenly articulate.\n “Who are you . . . ?” I’m beginning to panic. I want to grab James and run but I can’t. He’s done something to James and even if I knew how to wake him up, I can’t touch him. I want to rip my nails out. “Who are you—”\n Kenji sighs. “You’re starving. You’re exhausted. You’re processing shock and a million other emotions right now. Be logical. I’m not going to hurt you. You’re safe now. Adam is safe. James is safe.”\n “I want to be with him—I want to see what they’re going to do to him—”\n “I can’t let you do that.”\n “What are you going to do to me? Why did you bring me here . . . ?” My eyes are wide, darting in every direction. I’m spinning, stranded in the middle of the ocean of my own imagination and I don’t know how to swim. “What do you want from me?”\n Kenji looks down. Rubs his forehead. Reaches into his pocket. “I really didn’t want to have to do this.”\n I think I’m screaming.\n Chapter Forty-Three\n I’m an old creaky staircase when I wake up.\n Someone has scrubbed me clean. My skin is like satin. My eyelashes are soft, my hair is smooth, brushed out of its knots; it gleams in the artificial light, a chocolate river lapping the pale shore of my skin, soft waves cascading around my collarbone. My joints ache; my eyes burn from an insatiable exhaustion. My body is naked under a heavy sheet. I’ve never felt so pristine.\n I’m too tired to be bothered by it.\n My sleepy eyes take inventory of the space I’m in, but there’s not much to consider. I’m lying in bed. There are 4 walls. 1 door. A small table beside me. A glass of water on the table. Fluorescent lights humming above me. Everything is white.\n Everything I’ve ever known is changing.\n I reach for the glass of water and the door opens. I pull the sheet up as high as it will go.\n “How are you feeling?”\n A tall man is wearing plastic glasses. Black frames. A simple sweater. Pressed pants. His sandy-blond hair falls into his eyes.\n He’s holding a clipboard.\n “Who are you?”\n He grabs a chair I hadn’t noticed was sitting in the corner. Pushes it forward. Sits down beside my bed. “Do you feel dizzy? Disoriented?”\n “Where’s Adam?”\n He’s holding his pen to a sheet of paper. Writing something down. “Do you spell your last name with two rs? Or just one?”\n “What did you do with James? Where’s Kenji?”\n He stops. Looks up. He can’t be more than 30. He has a crooked nose. A day of scruff. “Can I at least make sure you’re doing all right? Then I’ll answer your questions. I promise. Just let me get through the basic protocol here.”\n I blink.\n How do I feel. I don’t know.\n Did I have any dreams. I don’t think so.\n Do I know where I am. No.\n Do I think I’m safe. I don’t know.\n Do I remember what happened. Yes.\n How old am I. 17.\n What color are my eyes. I don’t know.\n “You don’t know?” He puts down his pen. Takes off his glasses. “You can remember exactly what happened yesterday, but you don’t know the color of your own eyes?”\n “I think they’re green. Or blue. I’m not sure. Why does it matter?”\n “I want to be sure you can recognize yourself. That you haven’t lost sight of your person.”\n “I’ve never really known my eye color, though. I’ve only looked in the mirror once in the last three years.”\n The stranger stares at me, his eyes crinkled in concern. I finally have to look away.\n “How did you touch me?” I ask.\n “I’m sorry?”\n “My body. My skin. I’m so . . . clean.”\n “Oh.” He bites his thumb. Marks something on his papers. “Right. Well, you were covered in blood and filth when you came in, and you had some minor cuts and bruises. We didn’t want to risk infection. Sorry for the personal intrusion—but we can’t allow anyone to bring that kind of bacteria in here. We had to do a superficial detox.”\n “That’s fine—I understand,” I hurry on. “But how?”\n “Excuse me?”\n “How did you touch me?” Surely he must know. How could he not know? God I hope he knows.\n “Oh—” He nods, distracted by the words he’s scribbling on his clipboard. Squints at the page. “Latex.”\n “What?”\n “Latex.” He glances up for a second. Sees my confusion. “Gloves?”\n “Right.” Of course. Gloves. Even Warner used gloves until he figured it out.\n Until he figured it out. Until he figured it out. Until he figured it out.\n I replay the moment over and over and over in my mind. The split second I took too long to jump from the window. The moment of hesitation that changed everything. The instant I lost all control. All power. Any point of dominance. He’s never going to stop until he finds me and it’s my own fault.\n I need to know if he’s dead.\n I have to force myself to be still. I have to force myself not to shake, shudder, or vomit. I need to change the subject. “Where are my clothes?” I toy with the perfect white sheet hiding my bones.\n “They’ve been destroyed for the same reasons you needed to be sanitized.” He picks up his glasses. Slips them on. “We have a special suit for you. I think it’ll make your life a lot easier.”\n “A special suit?” I look up. Part my lips in surprise.\n “Yes. We’ll get to that part a bit later.” He pauses. Smiles. There’s a dimple in his chin. “You’re not going to attack me like you did Kenji, are you?”\n “I attacked Kenji?” I cringe.\n “Just a little bit.” He shrugs. “At least now we know he’s not immune to your touch.”\n “I touched him?” I sit up straight and nearly forget to pull my sheet up with me. I’m burning from head to toe, blushing through my mind, clutching at the sheet like a lifeline. “I’m so sorry—”\n “I’m sure he’ll appreciate the apology.” Blondie is studying his notes religiously, suddenly fascinated by his own handwriting. “But it’s all right. We’ve been expecting some destructive tendencies. You’ve been having one hell of a week.”\n “Are you a psychologist?”\n “Sort of.” He brushes the hair away from his forehead.\n “Sort of?”\n He laughs. Pauses. Rolls the pen between his fingers. “Yes. For all intents and purposes, I am a psychologist. Sometimes.”\n “What is that supposed to mean . . . ?”\n He parts his lips. Presses them shut. Seems to consider answering me but examines me instead. He stares for so long I feel my face go hot. He starts scribbling furiously.\n “What am I doing here?” I ask him.\n “Recovering.”\n “How long have I been here?”\n “You’ve been asleep for almost fourteen hours. We gave you a pretty powerful sedative.” Looks at his watch. “You seem to be doing well.” Hesitates. “You look very well, actually. Stunning, really.”\n I have a handful of scrambled words in my mouth. A blush flushing up my face. “Where’s Adam?”\n He takes a deep breath. Underlines something on his papers. His lips twitch into a smile.\n “Where is he?”\n “Recovering.” He finally looks up.\n “He’s okay?”\n Nods. “He’s okay.”\n I stare at him. “What does that mean?”\n 2 knocks at the door.\n The bespectacled stranger doesn’t move. He rereads his notes. “Come in,” he calls.\n Kenji walks inside, a little hesitant at first. He peeks at me, his eyes cautious. I never thought I’d be so happy to see him. But while it’s a relief to see a face I recognize, my stomach immediately twists into a knot of guilt, knocking me over from the inside. I wonder how badly I must’ve hurt him. He steps forward. \n","sourceLink":"https://allnovel.net/shatter-me-shatter-me-1/page-34.html","bookId":1771,"book":{"id":1771,"title":"Shatter Me (Shatter Me #1)","description":"Storyline: \n Shatter Me (Shatter Me #1) \n I have a curse \n I have a gift \n I am a monster \n I\u0027m more than human \n My touch is lethal \n My touch is power \n I am their weapon \n I will fight back \n Juliette hasn’t touched anyone in exactly 264 days. \n The last time she did, it was an accident, but The Reestablishment locked her up for murder. No one knows why Juliette’s touch is fatal. As long as she doesn’t hurt anyone else, no one really cares. The world is too busy crumbling to pieces to pay attention to a 17-year-old girl. Diseases are destroying the population, food is hard to find, birds don’t fly anymore, and the clouds are the wrong color. \n The Reestablishment said their way was the only way to fix things, so they threw Juliette in a cell. Now so many people are dead that the survivors are whispering war – and The Reestablishment has changed its mind. Maybe Juliette is more than a tortured soul stuffed into a poisonous body. Maybe she’s exactly what they need right now. \n Juliette has to make a choice: Be a weapon. Or be a warrior.\n \n","cover":"https://allnovel.net/images/shatter-me-shatter-me-1.jpg","author":"Tahereh Mafi","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/shatter-me-shatter-me-1.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:28:48 AM"}}
