{"id":73902,"no":38,"title":"Page 38","content":"I think Adam is looking to break Kenji’s neck at this point.\n “Yeah, we’re safe,” Adam tells him, running a hand through his messy blond hair. “Everything is okay.”\n James runs back to the playroom with the other kids. Sonya and Sara invent an excuse to leave so we have some privacy. I’m liking them more and more.\n “Has anyone told you about this place yet?” Adam asks me. He manages to sit up. His sheet slides down. His chest is exposed. His skin is perfectly healed—I can hardly reconcile the image I have in my memory with the one in front of me. I forget to answer his question.\n “You have no scars.” I touch his skin like I need to feel it for myself.\n He tries to smile. “They’re not very traditional in their medical practices around here.”\n I look up, startled. “You . . . know?”\n “Did you meet Castle yet?”\n I nod, bewildered.\n He shifts. Sighs. “I’ve heard rumors about this place for a long time. I got really good at listening to whispers, mostly because I was looking out for myself. But in the army we hear things. Any and all kinds of enemy threats. Possible ambushes. There was talk of an unusual underground movement from the moment I enlisted. Most people said it was crap. That it was some kind of garbage concocted to scare people—that there was no way it could be real. But I always hoped it had some basis in truth, especially after I found out about you—I hoped we’d be able to find others with similar abilities. But I didn’t know who to ask. I had no connections—no way of knowing how to find them.” He shakes his head. “And all this time, Kenji was working undercover.”\n “He said he was looking for me.”\n Adam nods. Laughs. “Just like I was looking for you. Just like Warner was looking for you.”\n “I don’t understand,” I mumble. “Especially now that I know there are others like me—stronger, even—why did Warner want me?”\n “He discovered you before Castle did,” Adam says. “He felt like he claimed you a long time ago.” Adam leans back. “Warner’s a lot of things, but he’s not stupid. I’m sure he knew there was some truth to those rumors—and he was fascinated. Because as much as Castle wanted to use his abilities for good, Warner wanted to manipulate those abilities for his own cause. He wanted to become some kind of superpower.” A pause. “He invested a lot of time and energy just studying you. I don’t think he wanted to let that effort go to waste.”\n “Adam,” I whisper.\n He takes my hand. “Yeah?”\n “I don’t think he’s dead.”\n Chapter Forty-Nine\n “He’s not.”\n Adam turns. Frowns at the voice. “What are you doing here?”\n “Wow. What a greeting, Kent. Be careful not to pull a muscle thanking me for saving your ass.”\n “You lied to all of us.”\n “You’re welcome.”\n “You sedated my ten-year-old brother!”\n “You’re still welcome.”\n “Hey, Kenji.” I acknowledge him.\n “My clothes look good on you.” He steps a bit closer, smiles.\n I roll my eyes. Adam examines my outfit for the first time.\n “I didn’t have anything else to wear,” I explain.\n Adam nods a little slowly. Looks at Kenji. “Did you have a message to deliver?”\n “Yeah. I’m supposed to show you where you’ll be staying.”\n “What do you mean?”\n Kenji grins. “You and James are going to be my new roommates.”\n Adam swears under his breath.\n “Sorry, bro, but we don’t have enough rooms for you and Hot Hands over here to have your own private space.” He winks at me. “No offense.”\n “I have to leave right now?”\n “Yeah, man. I want to go to sleep soon. I don’t have all day to wait around for your lazy ass.”\n “Lazy—?”\n I hurry to interrupt before Adam has a chance to fight back. “What do you mean, you want to go to sleep? What time is it?”\n “It’s almost ten at night,” Kenji tells me. “It’s hard to tell underground, but we all try to be aware of the clocks. We have monitors in the hallways, and most of us try to wear watches. Losing track of night and day can screw us up pretty quickly. And now is not the time to be getting too comfortable.”\n “How do you know Warner isn’t dead?” I ask, nervous.\n “We just saw him on camera,” Kenji says. “He and his men are patrolling this area pretty heavily. I managed to hear some of their conversation. Turns out Warner got shot.”\n I suck in my breath, try to silence my heartbeats.\n “That’s why we got lucky last night—apparently the soldiers got called back to base because they thought Warner was dead. There was a shift in power for a minute. No one knew what to do. What orders to follow. But then it turned out he wasn’t dead. Just wounded pretty bad. His arm was all patched up and in a sling,” Kenji adds.\n Adam finds his voice before I do. “How safe is this place from attack?”\n Kenji laughs. “Safe as hell. I don’t even know how they managed to get as close as they did. But they’ll never be able to find our exact location. And even if they do, they’ll never be able to break in. Our security is just about impenetrable. Plus we have cameras everywhere. We can see what they’re doing before they even plan it.\n “It doesn’t really matter, though,” he goes on. “Because they’re looking for a fight, and so are we. We’re not afraid of an attack. Besides, they have no idea what we’re capable of. And we’ve been training for this shit forever.”\n “Do you—” I pause. Flush. “Can you—I mean, do you have a . . . gift, too?”\n Kenji smiles. And disappears.\n He’s really gone.\n I stand up. Try to touch the space he was just standing in.\n He reappears just in time to jump out of reach. “HEY—whoa, careful—just because I’m invisible doesn’t mean I can’t feel anything—”\n “Oh!” I pull back. Cringe. “I’m sorry—”\n “You can make yourself invisible?” Adam looks more irritated than interested.\n “Just blew your mind, didn’t I?”\n “How long have you been spying on me?” Adam narrows his eyes.\n “As long as I needed to.” But his grin is laced with mischief.\n “So you’re . . . corporeal?” I ask.\n “Look at you, using big fancy words.” Kenji crosses his arms. Leans against the wall.\n “I mean—you can’t, like, walk through walls or anything, can you?”\n He snorts. “Nah, I’m not a ghost. I can just . . . blend, I guess is the best word. I can blend into the background of any space. Shift myself to match my surrounds. It’s taken me a long time to figure it out.”\n “Wow.”\n “I used to follow Adam home. That’s how I knew where he lived. And that’s how I was able to run away—because they couldn’t really see me. They tried to shoot at me anyway,” he adds, bitter, “but I managed not to die, at least.”\n “Wait, but why were you following Adam home? I thought you were looking for me?” I ask him.\n “Yeah—well, I enlisted shortly after we got wind of Warner’s big project.” He nods in my direction. “We’d been trying to find you, but Warner had more security clearance and access to more information than we did—we were having a hard time tracking you down. Castle thought it would be easier to have someone on the inside paying attention to all the crazy shit Warner was planning. So when I heard that Adam was the main guy involved in this particular project and that he had this history with you, I sent the information to Castle. He told me to watch out for Adam, too—you know, in case Adam turned out to be just as psycho as Warner. We wanted to make sure he wasn’t a threat to you or our plans. But I had no idea you’d try to run away together. Messed me the hell up.”\n We’re all silent for a moment.\n “So how much did you spy on me?” Adam asks him.\n “Well, well, well.” Kenji cocks his head. “Is Mr. Adam Kent suddenly feeling a little intimidated?”\n “Don’t be a jackass.”\n “You hiding something?”\n “Yeah. My gun—”\n “Hey!” Kenji claps his hands together. “So! Are we ready to get out of here, or what?”\n “I need a pair of pants.”\n Kenji looks abruptly annoyed. “Seriously, Kent? I don’t want to hear that shit.”\n “Well, unless you want to see me naked, I suggest you do something about it.”\n Kenji shoots Adam a dirty look and stalks off, grumbling something about lending people all of his clothes. The door swings shut behind him.\n “I’m not really naked,” Adam tells me.\n “Oh,” I gasp. Look up. My eyes betray me.\n He can’t bite back his grin in time. His fingers graze my cheek. “I just wanted him to leave us alone for a second.”\n I’m blushing through my bones. Fumbling for something to say. “I’m so happy you’re okay.”\n He says something I don’t hear.\n Takes my hand. Pulls me up beside him.\n He’s leaning in and I’m leaning in until I’m practically on top of him and he’s slipping me into his arms and kissing me with a new kind of desperation, a new kind of passion, a burning need. His hands are threaded in my hair, his lips so soft, so urgent against mine, like fire and honey exploding in my mouth. My whole body is steaming.\n Adam pulls back just a tiny bit. Kisses my bottom lip. Bites it for just a second. His skin is 100 degrees hotter than it was a moment ago. His lips are pressed against my neck and my hands are on a journey down his upper body and I’m wondering why there are so many freight trains in my heart, why his chest is a broken harmonica. I’m tracing the bird caught forever in flight on his skin and I realize for the first time that he’s given me wings of my own. He’s helped me fly away and now I’m stuck in centripetal motion, soaring right into the center of everything. I bring his lips back up to mine.\n “Juliette,” he says. 1 breath. 1 kiss. 10 fingers teasing my skin. “I need to see you tonight.”\n Yes.\n Please.\n 2 hard knocks send us flying apart.\n Kenji slams open the door. “You do realize this wall is made of glass, don’t you?” He looks like he’s bitten the head off a worm. “No one wants to see that.”\n He throws a pair of pants at Adam.\n Nods to me. “Come on, I’ll take you to Sonya and Sara. They’ll set you up for tonight.” Turns to Adam. “And don’t ever give those pants back to me.”\n “What if I don’t want to sleep?” Adam asks, unabashed. “I’m not allowed to leave my room?”\n Kenji presses his lips together. Narrows his eyes. “I will not use this word often, Kent, but please don’t try any fancy secret-sneaking-away shit. We have to regulate things around here for a reason. It’s the only way to survive. So do everyone a favor and keep your pants on. You’ll see her in the morning.” \n","sourceLink":"https://allnovel.net/shatter-me-shatter-me-1/page-38.html","bookId":1771,"book":{"id":1771,"title":"Shatter Me (Shatter Me #1)","description":"Storyline: \n Shatter Me (Shatter Me #1) \n I have a curse \n I have a gift \n I am a monster \n I\u0027m more than human \n My touch is lethal \n My touch is power \n I am their weapon \n I will fight back \n Juliette hasn’t touched anyone in exactly 264 days. \n The last time she did, it was an accident, but The Reestablishment locked her up for murder. No one knows why Juliette’s touch is fatal. As long as she doesn’t hurt anyone else, no one really cares. The world is too busy crumbling to pieces to pay attention to a 17-year-old girl. Diseases are destroying the population, food is hard to find, birds don’t fly anymore, and the clouds are the wrong color. \n The Reestablishment said their way was the only way to fix things, so they threw Juliette in a cell. Now so many people are dead that the survivors are whispering war – and The Reestablishment has changed its mind. Maybe Juliette is more than a tortured soul stuffed into a poisonous body. Maybe she’s exactly what they need right now. \n Juliette has to make a choice: Be a weapon. Or be a warrior.\n \n","cover":"https://allnovel.net/images/shatter-me-shatter-me-1.jpg","author":"Tahereh Mafi","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/shatter-me-shatter-me-1.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:28:48 AM"}}
