{"id":32111,"no":26,"title":"CHAPTER XXV. ROSE IS RESTORED TO HER BROTHER.","content":"When Mr. Martin re-entered his boarding-house late in the afternoon, Mrs. Waters looked as if she expected her bill to be paid. \"I couldn\u0027t change my fifty dollars,\" said Martin; \"but it\u0027s all right, Mrs. Waters. You shall have the money to-morrow.\" Notwithstanding the confidence with which he spoke, Mrs. Waters felt rather troubled in mind. She doubted very much whether it was all right, and would have felt very much relieved if she could have seen the bank-note which Martin talked about changing. However, there was no good excuse for questioning his statement, and she could only wait as patiently as she might. But she resolved that if the money were not forthcoming the next day, she would advise Mr. Martin to seek another boarding-place, and that without delay. When breakfast was over the next morning, Martin said to Rose, \"Put on your bonnet. I want you to go out with me.\" Rose looked at him in surprise. \"I\u0027m goin\u0027 to get her some new clothes, ma\u0027am,\" he said to Mrs. Waters. \"She needs \u0027em, and it will give me a good chance to change my bill.\" This might be so. Mrs. Waters hoped it was. Rose, however, listened with amazement. Her stepfather had not bought her any clothes for years,—indeed, she could not remember when,—and it was not long since he had taken away and sold those which her brother bought her. The idea struck her with alarm that perhaps he had the same intention now. \"Come, don\u0027t be all day,\" said Martin, roughly. \"Maybe I\u0027ll change my mind, and not buy you any if you\u0027re so long gettin\u0027 ready.\" It took little time for Rose to make necessary preparations. After leaving the house, Mr. Martin led the way to Third Avenue, where they got on board the horse-cars. It struck Mr. Martin that a good place for Rose to commence her new profession would be in front of Fulton Ferry, where crowds of people were passing and repassing continually. Rose did not venture to ask any questions till they reached their destination. Then seeing the ferry, which she remembered, she asked hopefully, \"Are we going to New York?\" \"No, we aint. Don\u0027t you think of such a thing,\" said Martin, roughly. \"Are you going to buy me some clothes here? I don\u0027t see any stores.\" \"You\u0027ve got clothes enough. You\u0027ve got better clothes than I have.\" \"I thought,\" said Rose, \"you told Mrs. Waters you were going to buy me some.\" \"Maybe I\u0027ll buy you some, if you do just as I tell you. I\u0027ve got something for you to do.\" They had now left the cars, and were crossing the street to the ferry. \"Now,\" said Martin, \"I\u0027ll tell you what you must do. You must stand just there where people come out, and hold out your hand, and say, \u0027Give me a few pennies for my poor sick mother.\u0027\" \"But,\" said Rose, in dismay, \"that will be begging.\" \"S\u0027pose it is,\" retorted her stepfather, doggedly. \"Are you too proud to beg? Do you expect me to support you without you doin\u0027 anything?\" \"I\u0027m willing to work,\" said Rose, \"but I don\u0027t want to beg.\" \"None of your impudence!\" said Martin, angrily. \"You must do just as I told you. Say, \u0027Give me a few pennies for my poor sick mother.\u0027\" These last words he brought out in a doleful whine, such as he thought might excite compassion. \"There, see if you can say it as I did.\" \"I haven\u0027t got any sick mother,\" pleaded Rose. \"What\u0027s the odds? Half of them aint. Only you must say so, or they won\u0027t give you anything. Come, are you ready?\" \"I don\u0027t want to beg,\" said Rose, desperately. \"I tell you what, little gal,\" said Martin, fiercely; \"if you don\u0027t do as I tell you, I\u0027ll give you the wust lickin\u0027 you ever had. Say what I told you.\" \"Give me a few pennies for my poor sick mother,\" repeated Rose, unwillingly. \"You don\u0027t say it feelin\u0027 enough,\" said Martin, critically. \"Anybody would think you didn\u0027t care nothin\u0027 for your poor sick mother. Say it so;\" and he repeated the whine. Rose said it after him, and though her performance was not quite satisfactory to her stepfather, he decided that it would do. \"There, stand there,\" he said, \"and begin. I\u0027m goin\u0027 just across the street, and if you don\u0027t do it right, look out for a lickin\u0027.\" Rose took her position, feeling very much ashamed, and almost ready to cry. She wished she could escape the necessity; but looking across the street she saw Martin furtively shaking his fist at her, and turned desperately to follow his directions. The boat was just in, and a throng of passengers was passing through the gate. \"Give me a few pennies for my poor sick mother,\" said Rose, to a good-natured-looking man who passed her. He looked at her anxious face, and something in it excited his pity. He took out ten cents, and gave it to her. Rose took it, feeling very much ashamed, and turned to the next passer. \"Give me a few pennies for my poor sick mother,\" she said. \"Out of the way there, you young beggar!\" said he, roughly. \"Such nuisances as you are ought to be sent to the Island.\" Rose drew back alarmed at this rough language, and for a moment kept silent, hardly daring to renew her appeal. But a look at James Martin\u0027s threatening face compelled her to continue, and again she made the appeal. This time it was a lady she addressed,—mild and pleasant,—who paused a moment, and spoke gently. \"Is your mother quite sick, my dear?\" she asked, in a voice of compassion. \"Yes, ma\u0027am,\" answered Rose, faintly, ashamed of the falsehood she was uttering. \"Have you any brothers and sisters?\" \"One brother,\" answered Rose, glad that here at least she could tell the truth. \"Here\u0027s something for you,\" said the lady, placing twenty-five cents in the child\u0027s outstretched palm. All the passengers had now passed through the portal, and she had some respite. James Martin crossed the street, and, coming up to her, asked, \"How much did you get?\" Rose opened her hand. \"Thirty-five cents in five minutes,\" he said, elated. \"Come, little gal, you\u0027re gettin\u0027 on finely. I shouldn\u0027t wonder if you\u0027d take three or four dollars by two o\u0027clock. We\u0027ll go home then.\" \"But I don\u0027t like to beg,\" said Rose. \"Don\u0027t let me hear none of that,\" said Martin, angrily. \"You\u0027re lazy, that\u0027s what\u0027s the matter. You\u0027ve got to earn your livin\u0027, there\u0027s no two ways about that, and this is the easiest way to do it. There aint no work about beggin\u0027.\" Since Martin was mean enough to live on the money begged by a little girl, it isn\u0027t likely that he would understand the delicate scrupulousness which made Rose ashamed of soliciting charity. \"I\u0027ll take the money,\" said her stepfather, \"and you can get some more when the next boat comes in. I\u0027m goin\u0027 away a few minutes,\" he proceeded; \"but you must stay here just where you are, and keep on just as if I was here. I won\u0027t be gone long. If I find you haven\u0027t done nothing when I come back, look out for yourself.\" James Martin had reflected that the thirty-five cents would be sufficient to get him a drink and a couple of cigars, and it was to obtain these that he went away. He found it rather dull work, standing on the sidewalk and watching Rose, and he thought that by inspiring her with a little wholesome fear, she would go on just as well in his absence. Still it might be as well to encourage her a little. \"If you\u0027re a good gal,\" he proceeded, in a changed tone, \"and get a lot of money, I\u0027ll buy you some candy when we go home.\" This, however, did not cheer Rose much. She would much prefer to go without the candy, if she might be relieved from her present disagreeable employment. If Mr. Martin had been aware that among the passengers on the next boat were Rough and Ready and Ben Gibson, he would scarcely have felt so safe in leaving Rose behind. Such, however, was the case. While Rose was plunged in sorrowful thought, filled with shame at the thought of her employment, deliverance was near at hand. The boat came in, and she felt compelled to resume her appeal. \"Give me a few pennies for my poor sick mother,\" she said, holding out her hand. \"Where is your poor sick mother?\" asked the person addressed. \"She\u0027s dead,\" said Rose, forgetting herself. \"That\u0027s what I thought,\" he answered, laughing, and passed on, of course without giving anything. Rather mortified at the mistake she had made, Rose turned to address the next passenger, when she uttered a joyful cry. \"O Rufie!\" she exclaimed, throwing her arms around him. \"Rose, is it you?\" he exclaimed, surprised and delighted. \"How came you here? I came over to Brooklyn on purpose to find you; but I had no idea you were so near.\" \"Mr. Martin sent me here to beg.\" \"To beg!\" repeated Rufus, indignantly. \"And where is he now?\" \"He\u0027s gone away,\" said Rose, \"but he\u0027s coming right back.\" \"Then he won\u0027t find you, that\u0027s all. Come, Ben, we\u0027ll go right back by the next boat, and carry Rose with us. I didn\u0027t expect to be so lucky.\" \"Won\u0027t Martin be mad?\" said Ben. \"I\u0027d like to see him when he finds your sister gone.\" \"He shan\u0027t see her again very soon,\" said Rufus, \"not if I can help it. Come along, Rose.\" He paid their fare by the boat, and hurried Rose on board. It started in the course of two or three minutes on its return trip. On the way he made Rose tell him how she had been treated, and was very angry when told of the persecutions to which she had been subjected. \"But it\u0027s all over now, Rosy,\" he said, putting his arm caressingly round his little sister\u0027s neck, \"you\u0027re safe now, and nobody shall trouble you. Miss Manning will be rejoiced to see you again.\" \"I shall be so glad to get home again, Rufie,\" said Rose, earnestly; \"Miss Manning\u0027s so much nicer than Mrs. Waters.\" \"And am I as nice as Mr. Martin?\" asked Rufus, laughing. \"Ten thousand million times,\" said Rose, emphatically. \"He isn\u0027t nice at all.\" Meanwhile we return to Mr. Martin. When he got back, he looked in vain for Rose. \"Where\u0027s she gone?\" he asked himself, angrily. He looked about him on all sides, but no Rose was to be seen. It occurred to him that perhaps she might have taken some of the money obtained by begging, and gone over to New York in the boat, in the hope of finding her brother. If so, he would follow her. To make sure, he asked the fare-taker. \"Did you see a little girl begging just outside the gate a few minutes ago?\" \"Yes.\" \"She\u0027s gone away. Did you see where she went?\" \"She went over to New York in the boat, about twenty minutes ago.\" \"Did she go alone?\" \"No; there were two boys went with her.\" Martin asked for a description of the boys, and realized to his intense disappointment that his plans were foiled, and that Rough and Ready had recovered his sister. He was provoked with himself for leaving her, and his vexation was the greater that he had not only lost Rose and the money she might have made for him, but also the sum which the newsboy stood ready to pay for the return of his sister. \"Confound the luck!\" he muttered. \"It\u0027s always against me.\" \n \n","sourceLink":"http://novel.tingroom.com/ertong/2999/82759.html","bookId":302,"book":{"id":302,"title":"Rough and Ready","description":"简介： On the sidewalk in front of the Times office, facing Printing-House Square, stood a boy of fifteen, with a pile of morning papers under his arm.\u0027Herald,\u0027 \u0027Times,\u0027 \u0027Tribune,\u0027 \u0027World\u0027! he vociferated, with a quick glance at each passer-by....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2999","creation":"Aug 1, 2019 12:18:31 AM","modification":"Aug 1, 2019 12:18:31 AM"}}
