{"id":96067,"no":16,"title":"Page 16","content":"“Besides,” she was saying, “my horoscope says I’m going through a very sexy time.”\\n\\n “Your horoscope.”\\n\\n “Uh-huh.”\\n\\n “What do you do, read it every morning?”\\n\\n “You mean in the newspaper? Well, I’m not saying I never look, but I wouldn’t rely on a newspaper horoscope for advice and counsel any more than I’d need Ann Landers to tell me if I have to pet to be popular.”\\n\\n “On that subject,” he said, “I’d say you don’t absolutely have to, but what could it hurt?”\\n\\n “And who knows,” she said, reaching out for him. “I might even enjoy it.”\\n\\n A while later she said, “Newspaper astrology columns are fun, like Peanuts and Doonesbury, but they’re not very accurate. But I got my chart done, and I go in once a year for a tune-up. So I have an idea what to expect over the coming twelve months.”\\n\\n “You believe in all that?”\\n\\n “Astrology? Well, it’s like gravity, isn’t it?”\\n\\n “It keeps things from flying off in space?”\\n\\n “It works whether I believe in it or not,” she said. “So I might as well. Besides, I believe in everything.”\\n\\n “Like Santa Claus?”\\n\\n “And the Tooth Fairy. No, all the occult stuff, like tarot and numerology and palmistry and phrenology and-“\\n\\n “What’s that?”\\n\\n “Head bumps,” she said, and capped his skull with her hand. “You’ve got some.”\\n\\n “I’ve got head bumps?”\\n\\n “Uh-huh, but don’t ask me what they mean. I’ve never even been to a phrenologist.”\\n\\n “Would you?”\\n\\n “Go to one? Sure, if somebody steered me to a good one. In all of these areas, some practitioners are better than others. There are the storefront gypsies who are really just running a scam, but after that you’ve still got different levels of proficiency. Some people have a knack and some just hack away at it. But that’s true in every line of work, isn’t it?”\\n\\n It was certainly true in his.\\n\\n “What I don’t get,” he said, “is how any of it works. What difference does it make where the stars are when you’re born? What has that got to do with anything?”\\n\\n “I don’t know how anything works,” she said, “or why it should. Why does the light go on when I throw the switch? Why do I get wet when you touch me? It’s all a mystery.”\\n\\n “But head bumps, for Christ’s sake. Tarot cards.”\\n\\n “Sometimes it’s just a way for a person to access her intuition,” she said. “I used to know a woman who could read shoes.”\\n\\n “The labels? I don’t follow you.”\\n\\n “She’d look at a pair of shoes that you’d owned for a while, and she could tell you things about yourself.”\\n\\n “ ‘You need half-soles.’ “\\n\\n “No, like you eat too much starchy food, and you need to express the feminine side of your personality, and the relationship you’re in is stifling your creativity. Things like that.”\\n\\n “All by looking at your shoes. And that makes sense to you?”\\n\\n “Does sense make sense? Look, do you know what holism is?”\\n\\n “Like eating brown rice?”\\n\\n “No, that’s whole foods. Holism is like with holograms, the principle’s that any cell in the body represents the entire life in microcosm. That’s why I can rub your feet and make your headache go away.”\\n\\n “You can?”\\n\\n “Well, not me personally, but a foot reflexologist could. That’s why a palmist can look at your hand and see evidence of physical conditions that have nothing to do with your hands. They show up there, and in the irises of your eyes, and the bumps on your head.”\\n\\n “And the heels of your shoes,” Keller said. “I had my palm read once.”\\n\\n “Oh?”\\n\\n “A year or two ago. I was at this party, and they had a palmist for entertainment.”\\n\\n “Probably not a very good one, if she was hiring out for parties. How good a reading did she give you?”\\n\\n “She didn’t.”\\n\\n “I thought you said you had your palm read.”\\n\\n “I was willing. She wasn’t. I sat down at the table with her and gave her my hand, and she took a good look and gave it back to me.”\\n\\n “That’s awful. You must have been terrified.”\\n\\n “Of what?”\\n\\n “That she saw imminent death in your hand.”\\n\\n “It crossed my mind,” he admitted. “But I figured she was just a performer, and this was part of the performance. I was a little edgy the next time I got on a plane-“\\n\\n “I’ll bet.”\\n\\n “-but it was a routine flight, and time passed and nothing happened, and I forgot about it. I couldn’t tell you the last time I even thought about it.”\\n\\n She reached out a hand. “Gimme.”\\n\\n “Huh?”\\n\\n “Give me your hand. Let’s see what got the bitch in a tizzy.”\\n\\n “You can read palms?”\\n\\n “Not quite, but I can claim a smattering of ignorance on the subject. Let’s see now, I don’t want to know too much, because it might jeopardize the superficiality of our relationship. There’s your head line, there’s your heart line, there’s your life line. And no marriage lines. Well, you said you’ve never been married, and your hand says you were telling the truth. I can’t say I can see anything here that would make me tell you not to sign any long-term leases.”\\n\\n “That’s a relief.”\\n\\n “So I bet I know what spooked her. You’ve got a murderer’s thumb.”\\n\\n Keller, working on his stamp collection, kept interrupting himself to look at his thumb. There it was, teaming up with his forefinger to grip a pair of tongs, to pick up a glassine envelope, to hold a magnifying glass. There it was, his own personal mark of Cain. His murderer’s thumb.\\n\\n “It’s the particular way your thumb is configured,” Maggie had told him. “See how it goes here? And look at my thumb, or your left thumb, as far as that goes. See the difference?”\\n\\n She was able to recognize the murderer’s thumb, he learned, because a childhood friend of hers, a perfectly gentle and nonviolent person, had one just like it. A palmist had told her friend it was a murderer’s thumb, and the two of them had looked it up in a book on the subject. And there it was, pictured life size and in color, the Murderer’s Thumb, and it was just like her friend Jacqui’s thumb, and, now, just like Keller’s.\\n\\n “But she never should have given you your hand back the way she did,” Maggie had assured him. “I don’t know if anybody’s keeping statistics, but I’m sure most of the murderers walking around have two perfectly normal thumbs, while most people who do happen to have a murderer’s thumb have never killed anybody in their life, and never will.”\\n\\n “That’s a comfort.”\\n\\n “How many people have you killed, Keller?”\\n\\n “What kind of a question is that?”\\n\\n “And do you sense a burst of homicidal rage in your future?”\\n\\n “Not really.”\\n\\n “Then I’d say you can relax. You may have a murderer’s thumb, but I don’t think you have to worry about it.”\\n\\n He wasn’t worried, not exactly. But he would have to say he was puzzled. How could a man have a murderer’s thumb all his life and be unaware of it? And, when all was said and done, what did it mean?\\n\\n He had certainly never paid any particular attention to his thumb. He had been aware that his two thumbs were not identical, that there was something slightly atypical about his right thumb, but it was not eye-catchingly idiosyncratic, not the sort of thing other kids would notice, much less taunt you about. He’d given it about as much thought over the years as he gave to the nail on the big toe of his left foot, which was marked with ridges.\\n\\n Hit man’s toe, he thought.\\n\\n He was poring over a price list, France amp; Colonies, wrestling with some of the little decisions a stamp collector was called upon to make, when the phone rang. He picked it up, and it was Dot.\\n\\n He made the usual round-trip by train, Grand Central to White Plains and back again. He packed a bag before he went to bed that night, and in the morning he caught a cab to JFK and a plane to Tampa. He rented a Ford Escort and drove to Indian Rocks Beach, which sounded more like a headline in Variety than a place to live. But that’s what it was, and, though he didn’t see any Indians or rocks, it would have been hard to miss the beach. It was a beauty, and he could see why they had all these condos on it, and vacation time-shares.\\n\\n The man Keller was looking for, an Ohioan named Stillman, had just moved in for a week’s stay in a beachfront apartment on the fourth floor of Gulf Water Towers. There was an attendant in the lobby, Keller noticed, but he didn’t figure to be as hard to get past as the Maginot Line.\\n\\n But would he even need to find out? Stillman had just arrived from sunless Cincinnati, and how much time was he going to spend inside? No more than he had to, Keller figured. He’d want to get out there and soak up some rays, maybe splash in the Gulf a little, then zone out some more in the sun.\\n\\n Keller’s packing had included swim trunks, and he found a men’s room and put them on. He didn’t have a towel to lie on-he hadn’t taken a room yet-but he could always lie on the sand.\\n\\n It turned out he didn’t have to. As he was walking along the public beach, he saw a woman approach a man, her hands cupped. She was holding water, and she threw it on the man, who sprang to his feet. They laughed joyously as he chased her into the surf. There they frolicked, perfect examples of young hormone-driven energy, and Keller figured they’d be frolicking for a while. They’d left two towels on the sand, anonymous unidentifiable white beach towels, and Keller decided one was all they needed. It would easily accommodate the two of them when they tired of splashing and ducking one another.\\n\\n He picked up the other towel and walked off with it. He spread it out on the sand at the private beach for Gulf Water Towers residents. A glance left and right revealed no one who in any way resembled George Stillman, so Keller stretched out on his back and closed his eyes. The sun, a real stranger to New York of late, was evidently wholly at home in Florida, and felt wonderful on his skin. If it took a while to find Stillman, that was okay with him.\\n\\n But it didn’t.\\n\\n Keller opened his eyes after half an hour or so. He sat up and looked around, feeling a little like Punxsutawney Phil on Groundhog Day. When he failed to see either Stillman or his own shadow, he lay down and closed his eyes again.\\n\\n The next time he opened them was when he heard a man cursing. He sat up, and not twenty yards away was a barrel-chested man, balding and jowly, calling his right hand every name in the book.\\n\\n How could the fellow be that mad at his own hand? Of course he might have a murderer’s thumb, but what if he did? Keller had one himself, and had never felt the need to talk to it in those terms.\\n\\n Oh, hell, of course. The man was on a cell phone. And, by God, he was Stillman. The face had barely registered on Keller at first, his attention held by the angry voice and the keg-shaped torso thickly pelted with black hair. None of that had been visible in the head-and-shoulders shot Dot had shown him, and it was what you noticed, but it was the same face, and here he was, and wasn’t that handy? \\n\\n","sourceLink":"https://allnovel.net/hit-list-keller-2/page-16.html","bookId":2313,"book":{"id":2313,"title":"Hit List (Keller #2)","description":"Storyline: Hit List (Keller #2) \\n Keller is a regular guy. He goes to the movies, works on his stamp collection. Call him for jury duty and he serves without complaint. Then every so often he gets a phone call from White Plains that sends him flying off somewhere to kill a perfect stranger. Keller is a pro and very good at what he does. But the jobs have started to go wrong. The realization is slow coming yet, when it arrives, it is irrefutable: Someone out there is trying to hit the hit man. Keller, God help him, has found his way onto somebody else\u0027s hit list.\\n","cover":"https://allnovel.net/images/hit-list-keller-2.jpg","author":"Lawrence Block","type":"Thriller","source":"allnovel","link":"https://allnovel.net/hit-list-keller-2.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:17:26 PM"}}
