{"id":96083,"no":32,"title":"Page 32","content":"“Even if it was a stamp you needed for your collection?” “There are thousands of stamps I need for my collection,” he said. “Enough so that I can keep busy without having to go to any particular auction.” “But if there was one particular stamp you absolutely had to have? But I guess it doesn’t work that way.” “For some collectors, maybe, but not for me. Anyway, I haven’t been spending that much time with my stamps lately.” “Oh?” “I wouldn’t say I’ve lost interest,” he said, “but it sort of ebbs and flows. I subscribe to a couple of magazines and a weekly newspaper, and sometimes I’ll read everything cover to cover, but lately I haven’t even glanced at them. A couple of dealers send me selections on approval, and I keep up with those, but that’s about all I’ve been doing lately. Other dealers send me price lists and auction catalogs and lately I’ve been tossing them out without looking at them.” “That’s a shame.” “No,” he said, “it’s more like taking a break from it. I was worried myself, that it was turning out to be a passing fancy, but the astrologer said not to worry.” “You’ve been to the astrologer again?” “I call her sometimes, if there’s something that bothers me. She takes a quick look at my chart and tells me if it’s a dangerous time for me, or whatever it was made me call her in the first place.” “This time it was stamps.” “And she said my interest would be like the weather.” “Partly cloudy, with a threat of rain.” “Hot one day and cold the next,” he said. “Variable, but nothing to worry about. And the nice thing about stamp collecting is you can put it aside for as long as you want and pick it up right where you left off. It’s not like a garden, where you have to keep up with the weeds.” “I know, they’re worse than the Joneses.” “Or a virtual aquarium, where the fish die.” “A virtuous aquarium? As opposed to what, Keller? A sinful one?” “Virtual,” he said. “A virtual aquarium.” “What the hell is that?” “It’s something you can buy for your computer,” he said. “You install it and the screen looks like a fish tank, with plants and guppies and everything. And you can add other species of fish-“ “How?” “By pressing the right keys, I guess. The thing is, it’s just like a real aquarium, because if you forget to feed the fish, they’ll die.” “They die?” “That’s right.” “How can they die, Keller? They’re not real fish in the first place, are they?” “They’re virtual fish.” “Meaning what? They’re images on a screen, right? Like a television program.” “Sort of.” “So they swim around on your screen. And if you don’t feed ’em, then what? They turn belly up?” “Evidently.” “Have you got one of these, Keller?” “Of course not,” he said. “I don’t have a computer.” “I didn’t think you did.” “I don’t want a computer,” he said, “and if I had one I wouldn’t want a virtual aquarium.” “How come you know so much about them?” “I hardly know anything about them,” he said. “I read an article, that’s all.” “Not in one of your stamp magazines.” “No, of course not.” “If it’s not stamps, what could it be? A woman? Keller, are you seeing that girl again?” “What girl?” “I guess that’s a no, isn’t it? The black girl, the one who wouldn’t eat dinner. I could come up with her name if I put my mind to it.” “Maggie.” “Now I don’t have to put my mind to it.” “She’s not black. She wears black.” “Close enough.” “Anyway, I’m not seeing her. Or anybody else.” “Probably just as well,” Dot said. “You know what? I give up. I was trying to guess why you can’t leave New York, and I got stuck in a conversation about stamp collecting, and it turned into a conversation about fish, and I don’t want to find out what that’s going to turn into. So let me ask you what I probably should have asked you over the phone. Why can’t you leave New York?” He told her. Her eyes widened. “Jury duty? You, Keller? You have to be on a jury?” “I have to report,” he said. “Whether I actually get on a jury is something else again.” “Many are called but few are chosen. But how on earth did you get called in the first place?” “I don’t know.” “I mean, the jury system isn’t supposed to make use of people like you, is it?” “People like me?” “People who do what you do.” “Not if they get caught,” he said. “I don’t think you can serve on a jury if you’ve been convicted of a felony. But I’ve never even been charged with a felony, or with anything else. I’ve never been arrested, Dot.” “And a good thing.” “A very good thing,” he said. “As far as anybody knows, as far as any official records would indicate, I’m a law-abiding citizen.” “Citizen Keller.” “And I am,” he said. “I don’t shoplift, I don’t use or sell drugs, I don’t hold up liquor stores, I don’t mug people. I don’t stiff cabdrivers or vault subway turnstiles.” “How about jaywalking?” “That’s not even a misdemeanor. It’s a violation, and anyway I’ve never been cited for it. I have a profession that, well, we know what it is. But nobody else knows about it, so it’s not going to keep me off a jury.” “You don’t vote, do you, Citizen Keller? Because I thought they drew jurors from the voter registration lists.” “That used to be all they used,” he said, “and that’s probably why I never got called before now. But now they use other lists, too, from Motor Vehicles and the phone company and I don’t know what else.” “You don’t own a car. And your phone’s unlisted.” “But I’ve got a driver’s license. And they’d use the phone company’s billing records, not the phone book. Look, what’s the difference how they found me? I got a notice, and I have to report first thing Monday morning.” “Today’s Friday.” “Right.” “Can’t you get a postponement?” “I could have,” he said, “if I’d asked for one when I got the notice. But I figured I might as well get it out of the way, and things have been slow lately, and I missed my chance.” “Won’t they let you off?” “On what grounds? They used to let people off all the time. If you were a lawyer, or if you were in business for yourself. Now you just about have to tell them you’re pregnant, and I’m not even sure if that works.” “They’d never believe you, Keller.” “Nobody gets out of it these days,” he said. “The mayor was on a jury a couple of months ago. Remember?” “I read something about it.” “He probably could have gotten excused. He’s the mayor, for God’s sake, he can do anything he wants to. But I guess he decided it was good for his image. Imagine if you’re on trial and you look over in the jury box and there’s the mayor.” “I’d plead guilty on the spot.” “Might as well,” he said. “I wish I could take this job. I could use the work. You know what’s funny? I figured, well, I’ll show up for jury duty because it’ll give me something to do. And now I’ve got something to do, and I can’t do it.” “It’s a good one, Keller.” “Tell me about it.” It was in Baltimore, so you could fly there in less than an hour or get there by train in under three. The train was more comfortable, and, when you factored in the cab rides to and from the airports, it was about as fast. And you didn’t have to show ID when you got on a train, and you could pay cash without drawing a raised eyebrow, let alone a crowd of security types. All things considered, Keller figured trains had a definite edge. There was a section of Baltimore called Fells Point, a sort of funky ethnic neighborhood that was starting to draw tourists and people with something to sell them. And- “You’re nodding,” Dot said. “You know the neighborhood? When did you ever go to Baltimore?” “Once or twice years ago,” he said, “but just in and out. But I know about Fells Point from TV. There’s this cop show set in Baltimore.” “Didn’t it get canceled?” “It’s in reruns,” he said. “Five nights a week on Court TV.” “You watch a lot of Court TV, Keller? As a sort of preparation for jury duty? Never mind.” There were, she explained, the usual conflicts that develop in a neighborhood in transition, with one faction desperate to pin landmark status on every gas station and hot dog stand, and the other every bit as eager to tear down everything and build condos and theme restaurants. There was a woman named Irene Macnamara who was a particularly vocal force for or against development, and someone on the other side had reached the conclusion that shutting her up constituted an all-important first step. While there had been a lot of loud outbursts at planning commission hearings, a lot of harsh words at press conferences, so far the controversy had not turned violent. So there was no reason for Macnamara to be on her guard. Keller thought about it. He said, “You’re sure they haven’t called anybody else?” “We’re their first choice.” “What did you tell them?” “That Macnamara better not buy any long-playing records, because we were on the case.” “You phrased it that way?” “Of course not, Keller. I just put that in to brighten your day.” “Today’s Friday.” “Well, I’ll try to come up with something for Saturday as well. There’s that page in Reader’s Digest, ‘Toward More Picturesque Speech.’ Maybe it’ll give me ideas.” “What I mean, today’s Friday. I could go down there tonight and I’d have tomorrow and Sunday.” “Catch a train home Sunday night and you’re ready to do your civic duty bright and early Monday morning.” “That’s what I was thinking.” “No LP’s for Macnamara, and no green bananas either. I don’t know, Keller. I like it but I don’t like it, if you follow me.” “I’m not sure I do.” “So I’ll say two words. St. Louis.”","sourceLink":"https://allnovel.net/hit-list-keller-2/page-32.html","bookId":2313,"book":{"id":2313,"title":"Hit List (Keller #2)","description":"Storyline: Hit List (Keller #2) Keller is a regular guy. He goes to the movies, works on his stamp collection. Call him for jury duty and he serves without complaint. Then every so often he gets a phone call from White Plains that sends him flying off somewhere to kill a perfect stranger. Keller is a pro and very good at what he does. But the jobs have started to go wrong. The realization is slow coming yet, when it arrives, it is irrefutable: Someone out there is trying to hit the hit man. Keller, God help him, has found his way onto somebody else\u0027s hit list.","cover":"https://allnovel.net/images/hit-list-keller-2.jpg","author":"Lawrence Block","type":"Thriller","source":"allnovel","link":"https://allnovel.net/hit-list-keller-2.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:17:26 PM"}}
