{"id":96097,"no":46,"title":"Page 46","content":"“The one who approached Maggie and asked for directions.” “And then he went across the street and into that building,” she said, “and now he’s two doors away, eating not just any sandwich but a hot dog. Same guy?” “I don’t know.” “Well, that’s helpful.” “That was the night before last,” he said, “and he was all bundled up.” “Hat, coat, and muffler.” “The best view I got of him was the top of his head. The top of his hat, actually. And the rest of the time all I could see of him was what showed between his hat and his muffler.” “I think it’s the same man, Keller.” “The man I saw,” he went on, “was clean-shaven. In fact that was just about the only thing I could tell you about him. He was white, and he didn’t have a mustache. This one’s got a mustache.” “Give me the glasses, Keller.” “You didn’t see the mustache?” “I saw the mustache. I just want a closer look at it, that’s all. These aren’t the greatest binoculars in the world, are they?” “They’re not the worst, either.” “No. It’s a hot dog, all right, and it’s probably not the best hot dog in the world, either, judging by how long it’s taking him to eat it. That mustache could be a fake.” “So could the hot dog.” “Huh? Oh, you were making a joke. Aren’t you clever. I think it’s a fake mustache, Keller.” “Why would he have a fake mustache?” “I don’t know.” “Maybe he grew it,” he said, “in the time we’ve been cooped up here.” “Maybe he’s a master of disguise. He’s done with the hot dog, believe it or not. I wonder if he’s going to light a cigarette.” “Why would he do that?” “That’s what smokers do. Don’t ask me why. Most of the people who stand around outside, they’re smokers who aren’t allowed to smoke in their offices. He’s not lighting a cigarette.” “Or a pipe,” Keller said. “He’s going into that building. The one he went into the other night.” “Back before he grew a mustache.” “Or pasted it on.” “The man the other night had somebody buzz him in. This fellow used a key.” “So?” “So what is it exactly that they’ve got in common? The lack of an umbrella?” “They’ve got the same walk,” she said. “They do?” “It looks the same to me.” “Left, right, left, right…” “Watch the window, Keller. Four flights up, second from the left.” “I’m watching it.” “See if a light goes on in the next five minutes.” He sat, waiting. The window stayed dark. “Amazing,” he said. “Can you believe it? The light didn’t go on. The dark window stayed dark. You called that one, all right.” “He’s sitting there in the dark.” “Maybe daylight’s enough for him.” “If he put the light on,” she said, “we could see him.” “See him doing what?” “Sitting in the window. At this angle, with no light behind him, we can’t see him.” “Dot,” he said, “what makes you think he’s there?” “He’s there.” “Why that window?” “Because that’s where he was last night and the night before.” “With the light on?” “No, sitting in the dark.” “Then how could you-“ “Smoking,” she said. He thought about it. “A cigarette glowing,” he said. “Right.” “I noticed it once or twice. The night before last, I remember noticing it then. And maybe last night, too.” “I saw it on and off, both nights.” “You didn’t mention it.” “You were sleeping, Keller.” “And I guess you were sleeping when I noticed it. It’s not much to notice. If I’d had someone to talk to, I probably wouldn’t have noticed it at all. There! Somebody just lit a cigarette.” “Him.” “It’s always that window?” “Uh-huh.” “So he’s a guy who lives there,” he said, “and he has trouble sleeping, and he sits by the window a lot.” “And smokes.” “It’s his apartment. Or loft, or office, or whatever it is. He wants to smoke, it’s his business.” “And it’s his face,” she said, “so he can paste a mustache on it anytime he wants to.” “If it’s the same man,” he said, “and he just happens to live there, I guess he’d either have a mustache or he wouldn’t.” “My point exactly, Keller.” “He could have one and shave it off. But he couldn’t not have one, and then two days later there it is.” He frowned. “If it’s the same man.” “Let’s assume he is.” “Okay.” “He’s got to be one of them.” “Our guy or Roger.” “Right.” “It would help,” he said, “if we knew which.” “We just wait, and-“ “And see what happens,” he said. “That’s what we’ve been doing. And nothing happens.” “Well, if you’ve got a better idea… Isn’t that your girlfriend?” “Maggie? Where?” “Right there.” “It’s her. How’d she get over there?” She was on the other side of the street, walking away. He waited for someone to leap out of an alleyway and strangle her, but nobody did. “She must have left the building,” Dot said, “while we were watching the glowing cigarette across the street. What’s she got, a backpack? Maybe she’s going away for the weekend.” “That’s all we need.” “She’s at the corner. She’s hailing a cab. Where do you suppose she’s going?” “Read her lips, see what she tells the driver.” “Is Mr. Mustache still at the window? I don’t see the telltale glow of his cigarette. No, I take it back. There it is. He’s there, so he probably saw her leave.” “So did we,” he said. “So what?” “So he’s not going to follow her. What about the other one?” The man in the cap and windbreaker had been back intermittently, and Keller had spotted him that morning in the coffee shop on the corner. He’d stopped by to pick up breakfast for the two of them, and there was the guy, perched on a stool at the counter, tucking into a plate of salami and eggs. “Salami and eggs,” Keller said. “I haven’t seen him since breakfast.” “Maybe he decided to catch a movie.” “Or maybe he’s sitting in some other window, without a glowing cigarette to give him away. You don’t think she really left for the weekend, do you?” “Who knows?” “The guy with the mustache has to be part of the game,” he said. “How else do you explain the mustache? I mean, now you see it, now you don’t.” “Either he’s neurotic in a new and interesting way,” Dot said, “or he’s a player. Besides, didn’t he stop your girlfriend on the street to ask directions? And she pointed him to the building?” “If he was legit, he’d know where he lives.” “He wanted a close look at her,” she said. “Wanted a chance to size her up.” “Why?” “To lock in on the target, I guess. Don’t you do that? Confirm the subject’s identity before you close the sale?” “I’d just as soon do it from a distance,” he said. “You get up close, talk to them, it complicates things.” “You start thinking you know them.” “And you don’t know them,” he said, “not really. The only reason they’re in your life is because there’s a contract in your pocket with their name on it. It’s the job that brought the two of you together, and in the end you have to bite the bullet and do the job.” “But it’s easier if you keep your distance.” “I’d say so,” he said, “but maybe this guy’s wired differently. Maybe he likes the idea of talking to her, knowing all along he’s going to take her out.” “Sick,” Dot said. “Well, mental health’s not necessarily part of the job description.” “No.” “And who says he’s the one who’s going to take her out? Maybe he’s Roger, and the other guy’s going to hit her.” “The windbreaker.” “That makes him sound like he’s got gas,” he said. “One of them’s Roger and one’s our hitter. I wish we knew which was which.” “If only,” Dot said. “Simplify things, wouldn’t it? Instead of waiting around, I could just go ahead and take him out. With Roger down and out, we could call off the other guy, and everybody could go home.” “We couldn’t call off our guy, Keller. He’s still got a job to do, because your girlfriend’s still a loose end.” He was silent for a moment. Then he said, “Maybe you could stop calling her my girlfriend.” “Sorry.” “Just to keep it simple, you know?” “It won’t happen again.” “And it’d still be good if we knew which was which, because I could deal with Roger and we could clear out. And the other guy could do what he came here to do, and we wouldn’t have to sit around and watch him get ready to do it.” “Uh-huh. Have you got a hunch?” “As to which is which? I’ve got two hunches, and I’m pretty sure one of them is right.” “Narrows it down.” “On the one hand,” he said, “the guy with the mustache is Roger, and that’s why he’s at the window all the time, puffing away on a Marlboro Light. Because why else would he need an observation post? If he’s just there to fulfill a contract, all he needs to do is a little reconnaissance. But if he’s Roger, waiting to hit the hitter, he’s got to spot the other guy and know when the hit goes down.” “Makes sense.” “On the other hand,” he said, “what’s with the mustache? Why does he need to change his appearance?” “To keep from being recognized.” “Who’s going to recognize him, Dot? Maggie? She saw him once, when he stopped her on the street, but she never has to see him again. The other hitter? The other hitter doesn’t know anything about Roger. He’s here to do a job and he’s got no reason to think it’s going to be complicated.”","sourceLink":"https://allnovel.net/hit-list-keller-2/page-46.html","bookId":2313,"book":{"id":2313,"title":"Hit List (Keller #2)","description":"Storyline: Hit List (Keller #2) Keller is a regular guy. He goes to the movies, works on his stamp collection. Call him for jury duty and he serves without complaint. Then every so often he gets a phone call from White Plains that sends him flying off somewhere to kill a perfect stranger. Keller is a pro and very good at what he does. But the jobs have started to go wrong. The realization is slow coming yet, when it arrives, it is irrefutable: Someone out there is trying to hit the hit man. Keller, God help him, has found his way onto somebody else\u0027s hit list.","cover":"https://allnovel.net/images/hit-list-keller-2.jpg","author":"Lawrence Block","type":"Thriller","source":"allnovel","link":"https://allnovel.net/hit-list-keller-2.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:17:26 PM"}}
