{"id":96057,"no":6,"title":"Page 6","content":"“Suppose you get a carload of Satan’s Slaves down below?”\n “Unless they can figure out a way to dance on the ceiling,” he said, “I think I’ll be all right. Anyway, I’ve got ear plugs. You can buy them at the 7-Eleven.”\n “What a country.”\n “You said it.”\n “Keller? Did it go all right?”\n “Yeah, it was fine,” he said. “Anyway, it’s done, and I’ll be on the first flight out tomorrow morning. It’s not a bad town-“\n “Keller, that’s what you always say. You said it about Roseburg, Oregon.”\n “-but I’ll be damn glad to see the last of it,” he finished, “and that’s something you never heard me say about Roseburg. I can’t wait to get out of here.”\n He had the Olds tucked away in his usual slot at the rear of the Super 8 before he remembered his new room was at the front. He left it there, reasoning that it might as well stay where it couldn’t be seen from the street, even if no one was looking for it. He didn’t have to decide what to do with the gun. That, like Walter Hirschhorn, was something he no longer had to worry about.\n He soaked in the tub, then watched a little TV, including a half hour of local news. A black woman and a white man shared the anchor desk, and it was hard to tell them apart. Color and gender somehow disappeared, and all you were aware of were their happy voices and big bright teeth.\n It was consequently hard to pay attention to what they were saying, but Hirschhorn wasn’t in any of the stories they reported. Keller hadn’t figured he would be.\n He got into bed. The traffic noise from outside wasn’t too bad, and Keller was a New Yorker, rarely bothered by horns or sirens or screeching brakes, rarely even subliminally aware of them. But he tried the ear plugs anyway, just to see how they felt, and fell asleep before he could get around to taking them out.\n He woke up around ten-thirty, coming awake abruptly, sitting up in bed with his heart pounding. He couldn’t hear a thing, of course, and it took him a minute to figure out why. Then he glanced at the phone, expecting to see the red light flashing, but it wasn’t. He checked his watch and was amazed he’d slept so long. Plug up your ears and you slept like the dead.\n He unplugged his ears and put the plugs, no longer sterile, in with the unsullied pair. Was that okay? Did you have to throw away ear plugs after you’d used them once? Or could you reuse them? They weren’t sterile anymore, he understood that much, but did they have to be? It wasn’t as though somebody else was going to be exposed to your ear wax. If they’d never been anywhere but your own ears, and if that was their sole future destination, how unsanitary was it to use them again? Was it like reusing a Q-Tip, or more like getting a second shave out of a disposable razor?\n He packed his bag and carried it to the car, and as he rounded the building he saw the rear parking lot filled with police cars and emergency vehicles, some with lights flashing on their tops. Yellow crime scene tape was stretched here and there, and, while he stood watching, two men in teal jumpsuits emerged from one room carrying a stretcher between them. There was an olive-drab body bag on the stretcher, and it was zipped up tight.\n Keller, suitcase in hand, went to the office to check out. “What a horrible thing!” the girl at the desk said, clearly loving every minute of it. “The maid, the Mexican girl? No doughnut on the door, so she knocked, and-“\n “No doughnut?”\n “Like the sign? Do Not Disturb, only my boyfriend calls it Doughnut Disturb, on account of there’s a hole where you slip it over the doorknob? Anyway, where was I?”\n “No doughnut.”\n “Right, so she knocked, and when nobody answered she used her key. And she saw they were in bed, and when this happens you’re supposed to just leave and close the door without saying anything? So you won’t disturb them more than you already did?”\n Why did she make an ordinary statement of fact come out sounding like a question? She paused, too, as if waiting for an answer. Keller nodded, which seemed to be what was required to get her going again.\n “But she must have noticed something. Maybe the smell? Anyway, she went in, and when she got a good look she started screaming. Both of them shot dead in their bed, and blood on the bed linen, and…”\n He let her go on for a while. Then he said, “Say, my car’s back there. Are the cops letting people drive their cars out?”\n “Oh, sure. It’s been like hours since Rosalita found the bodies. Hasn’t she got a pretty name?”\n “Very pretty.”\n “It means Little Rose, which is kind of sweet, but imagine naming someone Little Rose in English. It would sound like she was an Indian. Or like her mother’s name was Rose, too. Big Rose and Little Rose?”\n Jesus, Keller thought.\n “Anyway, the police have been here for hours, and they’ve been letting people come and go. Just so you don’t need to go in the room where it happened.”\n But he’d already been there. Why would he want to go back?\n Four\n “Room One forty-seven,” he told Dot. “My original room. I moved out in the morning, and that night a man and woman checked in.”\n “They checked in but they never checked out,” she said. “Where were you staying, Keller? The Roach Motel?”\n They were in the kitchen of the big house on Taunton Place. There was a pitcher of iced tea on the table between them, and Dot helped herself to a second glass. Keller’s was still more than half full.\n He said, “I got the hell out of there. I was driving to the airport, and don’t ask me why, but I turned around and got on I-71 and drove straight to Cincinnati.” He frowned. “Well, Cincinnati Airport. It’s actually across the river in Kentucky.”\n “I’ll be glad you told me that,” she said, “one of these nights when it comes up on Jeopardy! You didn’t want to fly out of Louisville?”\n “I figured it would probably be all right, but what if it wasn’t? I didn’t really know what to think. All I knew was I took care of Hirschhorn and a couple of hours later somebody took care of the people in my old room.”\n “Took good care of them, it sounds like. And if they realized their mistake, maybe they’re waiting at the airport.”\n “That was my thinking. Plus the drive to Cincinnati would give me time to think things out, and maybe listen to the news.”\n “And make sure that wasn’t you in the body bag after all. Just a little surrealism, Keller. Don’t look so confused.”\n “I’ve been confused a lot,” he said.\n “Ever since you got off the plane in Louisville, I seem to recall your saying.”\n “Ever since then. Here’s how it evidently went down, Dot. I did Hirschhorn around nine and went straight to the motel, and-“\n “First you called me.”\n “Called you en route, and then went back to my room-“\n “Your new room.”\n “My new room, and I was in bed by midnight, and around the time I was putting in ear plugs, somebody was killing the lovely couple in One forty-seven. What’s the first thought comes to mind?”\n “The client.”\n “Right, the client.”\n “Tying off loose ends. You did it, and now we make sure you don’t talk.”\n “Right.”\n “Except we know you won’t talk. That’s why we hire somebody like you. You won’t get caught, and if you do you won’t say anything, because what the hell would you say? You don’t know who the client is.”\n “Or what he had against Hirschhorn, or anything about him.”\n “They could have decided that killing you was cheaper than paying the balance due,” she said, “but that’s ridiculous. They paid half in front, remember? If they were that eager to save money, they could have saved the whole fee and done Hirschhorn themselves.”\n “Dot,” he said, “how would they even know the job was done?”\n “Because the man was dead. Oh, you mean the time element.”\n “The body could have been discovered anytime after I did the job. I watched the late news on the chance that I might hear something, but there was nothing to hear.”\n “Just because it didn’t make the news-“\n “Doesn’t mean it didn’t happen. Exactly what I thought. But that’s not what happened. I found out later the body wasn’t discovered until morning. I don’t know how worried Mrs. Hirschhorn may have been when her husband didn’t come home, and I don’t know if she called anybody, but what I do know is nobody went out to the garage until it was time to drive the kids to school.”\n She drank some iced tea. “So the people in One forty-seven died hours before anybody knew Hirschhorn was dead.”\n “Well, I knew, and you knew because I told you. But you’re the only person I told, and I have a feeling you didn’t spread it around.”\n “I figured it was our little secret.”\n “Besides not knowing I’d done what I was brought in to do,” he said, “how would they know where to find me?”\n “Unless they followed you there from Windy Hill.”\n “Winding Acres.”\n “Whatever.”\n “Nobody followed me,” he said. “And if they had they’d have followed me to the new room, not the old one. I didn’t go anywhere near One forty-seven.”\n “The people in One forty-seven. A man and a woman?”\n “A man and a woman. The room had two beds, they all do, but they were only using one of them.”\n “Let me take a wild guess. Married, but not to each other?”\n He nodded. “Guy at the Louisville paper told me the cops are talking to the dead woman’s husband. Who denies all knowledge, but right now they like him for it.”\n “All you have to do is call up and they tell you all that?”\n “If you’re polite and well-spoken,” he said, “and if they somehow get the impression you’re a researcher at Inside Edition.”\n “Oh.”\n “I told him it sounded pretty open and shut, and he said that’s how it looked up close. He’s going to update me if there’s a big break in the case.”\n “How’s he going to do that? You didn’t leave him a number.”\n “Sure I did.”\n “Not yours, I hope.”\n “Inside Edition’s. ‘Hang on,’ I said. ‘I can never remember the number here.’ And I looked it up and read it off. I could have just made something up. He’s never going to call. The husband did it, and what does Inside Edition care?”\n “If he strikes out there,” she said, “he can always try Hard Copy. The husband did it, huh? That’s your best guess?”\n “Or his wife, or somebody one of them hired. Or he was two-timing somebody else, or she was. There were empty bottles and full ashtrays all over the room, they’d been drinking and smoking since they checked in…” \n","sourceLink":"https://allnovel.net/hit-list-keller-2/page-6.html","bookId":2313,"book":{"id":2313,"title":"Hit List (Keller #2)","description":"Storyline: \n Hit List (Keller #2) \n Keller is a regular guy. He goes to the movies, works on his stamp collection. Call him for jury duty and he serves without complaint. Then every so often he gets a phone call from White Plains that sends him flying off somewhere to kill a perfect stranger. Keller is a pro and very good at what he does. But the jobs have started to go wrong. The realization is slow coming yet, when it arrives, it is irrefutable: Someone out there is trying to hit the hit man. Keller, God help him, has found his way onto somebody else\u0027s hit list.\n \n","cover":"https://allnovel.net/images/hit-list-keller-2.jpg","author":"Lawrence Block","type":"Thriller","source":"allnovel","link":"https://allnovel.net/hit-list-keller-2.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:17:26 PM"}}
