{"id":105324,"no":11,"title":"Page 11","content":"\\n\\n \"Come on, Onyx,\" I hit my thigh with my hand and he pressed a little closer to Gramps then finally came.\\n\\n Gramps laughed. \"Looks like I\u0027ve got myself a friend!\"\\n\\n Kinda a bad dog, I thought, liking Gramps better, the traitor. His tail went between his legs and I felt bad. \"It\u0027s okay boy, you\u0027re a good dog.\"\\n\\n His tail started to wag again. I had to be careful not to think bad thoughts around Onyx. After all, we were connected.\\n\\n Death Connection.\\n\\n Gramps looked at the assembled group. \"I know I didn\u0027t have a definite resolution for you kids tonight. But everyone\u0027s coming tomorrow for Caleb\u0027s shindig, right?\"\\n\\n Everyone nodded.\\n\\n \"I\u0027ll think of something by then. And, we\u0027ll do a little look-see underneath the hood,\" Gramps said, touching a finger to the Camaro. \"There were more pressing matters tonight.\" He walked over to Sophie and gave her shoulder an awkward pat.\\n\\n Gramps wasn\u0027t much for affection.\\n\\n But, he did care.\\n\\n It was in his eyes, the tight way he watched us pile into the cars, his large hands mangling the greasy towel with Archer\u0027s blood all over it.\\n\\n I watched him watch us until Bry\u0027s car turned the bend and we were out of sight.\\n\\n If Gramps couldn\u0027t figure it out we were up a creek.\\n\\n A shit creek, he would\u0027ve said.\\n\\n Without a paddle.\\n\\n We were quiet as we drove back to Kent. On the way home there was this long, ten-minute stretch where there were no street lights and woods flanked the road, making it feel narrow.\\n\\n I had my hand buried in Onyx\u0027s fur, giving him a pet while Jade and I were squished together in the back. My eyes flicked to Bry\u0027s rear view mirror, noticing it had a spiderweb crack in it. I could still make out Mia\u0027s toaster back there, Sophie, Tiff, Lewis and Mia packed inside. Just as my eyes shifted away I caught a second set of headlights, they flicked back. Later I was never sure why those headlights mattered but unease awoke inside me and Jade turned to look at me.\\n\\n \"What?\" she asked. I could just make out her eyes in the gloom, twilight had edged into night and there was the barest hint of the day left.\\n\\n \"I don\u0027t know exactly.\"\\n\\n \"Hey,\" she squeezed my arm, \"I\u0027m the Empath, remember?\"\\n\\n I nodded, trying to shake if off.\\n\\n John turned around, shoehorned into the front between Bry and Alex.\\n\\n \"What did you say?\"\\n\\n \"Oh shit!\" Bry exclaimed and I felt the jerk to our left when he over corrected to the right.\\n\\n The car glanced onto the shoulder, gravel kicking up and spraying noisily underneath the wheel wells. The steering column jerked out of his hands, the car sliding, lifting on two wheels then righting itself as it came to a skidding stop in the middle of the street.\\n\\n A car stood, blocking our way. My unease flared, burning brightly now. I watched as the engine ran and the warm vapor from the exhaust pipe made lazy steam in the cooling night air. Guys in suits exited the vehicle.\\n\\n Graysheets.\\n\\n I knew this right off because Parker was with them. Ya know, that guy that\u0027s a five-point AFTD and pops up to either kidnap me or save me. I never knew which.\\n\\n Great.\\n\\n I whipped my head around, my neck sore from the fun of the car episode and saw that Mia had stopped the tin can and they\u0027d already gotten out. Another government vehicle behind them.\\n\\n We were boxed in.\\n\\n That\u0027s what the plan had been all along.\\n\\n Onyx growled, picking up on my anxiety. Jade just stared at the group outside our car. No need for words, her hand clenched in mine.\\n\\n Jonesy said, \"Caleb, someday you\u0027re gonna just have to kill him. Really.\"\\n\\n I sighed.\\n\\n Maybe.\\n\\n We got out of the car. Jonesy, Alex, Bry, Jade, John and me. Jonesy and Bry looked at the girls behind us and they walked over to where we stood, Tiff in the lead.\\n\\n Parker and his losers spread out in a loose circle around our group.\\n\\n \"John.\"\\n\\n He looked at me. \"Yes?\"\\n\\n \"This may get exciting, I\u0027m gonna need you.\" He nodded and I turned to Tiff. She came to my side.\\n\\n I looked at Parker and he stared back.\\n\\n \"It\u0027s not what you\u0027re thinking, Caleb,\" he began. His suits stood behind him, the buttons on their black blazers undone so they could shoot a bunch of teenagers if the need arose.\\n\\n Yeah, so nonthreatening.\\n\\n \"You wouldn\u0027t know what I was thinking if it bit you on the ass,\" I replied levelly, ready.\\n\\n He smiled. \"We know that a certain individual has been infiltrating the AP girls\u0027 realm state and wanted you to know that we were aware.\"\\n\\n \"Well great, that gives me a whole ass-load of relief guys!\" Jonesy said, doing a mock forehead wipe.\\n\\n The guy behind Parker moved up beside him and the headlights from Bry\u0027s car revealed him to us.\\n\\n Skinny-Smoker. I\u0027d know that guy anywhere. Wonder how his head was doing after the Indian Chief took care of him last year? He was like a bad penny, cropping up time after time. He should have been Carson\u0027s ring leader, they of the Slow Learner Battalion. Yeah.\\n\\n \"Stay out of it, smart ass,\" Skinny said.\\n\\n Jonesy smiled, he was so genuinely not freaked out about them. It would\u0027ve been funny if it wasn\u0027t so serious.\\n\\n \"Make me, nicotine slut.\" His teeth were a white crescent that flashed in the murk and were gone.\\n\\n Skinny-Smoker\u0027s hands balled into fists. \"Let me teach this snot nose some goddamn manners, Parker.\"\\n\\n Parker nodded and they moved forward together.\\n\\n Crap.\\n\\n I took stock of where the girls were. Tiff was on board, defiant as always. Jade was behind me with Sophie and Mia standing behind Alex and Bry.\\n\\n Parker talked conversationally as he came nearer. \"We hate to take care of things like this but it seems its the only way you get the message.\"\\n\\n \"Beating up teenagers doesn\u0027t give me any message except that you guys are losers and I don\u0027t trust you. I got that message loud and clear.\"\\n\\n Skinny-Smoker was almost on top of Jonesy when Alex took him by the back of the collar and flung him toward the forest border, just ten feet or so outside of where the gravel shoulder had been.\\n\\n We watched his body arc and land with a thud on the slope beneath the trees.\\n\\n They charged us and Onyx sprang forward, going after Skinny-Smoker\u0027s partner.\\n\\n Stocky.\\n\\n They came from behind us as Parker and Stocky advanced.\\n\\n John screamed, \"Caleb!\" as I yelled, \"Tune-up Terran!\"\\n\\n Tiff grabbed me, Jade latching on to the back of my shirt, Onyx\u0027 teeth buried in Stocky\u0027s thigh. His high keening was bad. The ass-end of the gun readying to brain my dog was worse.\\n\\n I held my hands up and called what was close, the swirling death energy surged through my fingertips as my arms lifted above my head. I let it all go with a great mental shove, that feeling of emptiness filling me in its absence.\\n\\n I didn\u0027t know what I was calling until the night was filled with a thousand bugs, evacuating the forest like a gray shroud of death.\\n\\n That\u0027s what they would be for the Graysheets, death in the air, on wings.\\n\\n A great cloud descended toward me and I whispered the command in my mind: throat, ears, nose, mouth...\\n\\n I could feel them, their will as a unit, swarming to follow my command. They hovered above Stocky, his arm swinging down to strike Onyx\u0027s head. They infiltrated his nose, choking off his airway. The gun fell away, clattering on the pebbled asphalt. They swarmed over Onyx, making a halo around his head but not entering any of his airways or other orifices. Unfortunately, they did the same with Parker. I could see him smiling through the shadowed net of the insects. But they slowed his progress and that was all I needed to keep him at bay.\\n\\n I turned and John was concentrating for all he was worth. He was facing off against a Graysheet, the bugs were swirling around his head but couldn\u0027t pierce the invisible shield that he\u0027d erected.\\n\\n The agent was a Null. I watched as John began sweating, rivulets of moisture running from his hairline to jaw. The other guy was having a tough time too. But knowing the government, they\u0027d recruited a five-point.\\n\\n I watched as the other Graysheets fell to their knees, choking on bugs, flailing and spinning their arms around, guns forgotten as they struggled to breathe.\\n\\n To survive.\\n\\n Archer inched towards their cars, his hand gliding along the pulse locks of their car. I heard the locks snap in compliance. I smiled. Another fun thing for them to figure out.\\n\\n \"Caleb!\" Jade shrieked.\\n\\n I turned as the first zombie enforcer reached out and grabbed me by the hair, jerking me off my feet.\\n\\n Having a zombie\u0027s incredible strength used against me was awesome (in a bad way).\\n\\n And it hurt like a bitch.\\n\\n I could feel Parker\u0027s connection to the zombie and I used mine to control the one that was squeezing me against him.\\n\\n \"Don\u0027t bother, Caleb. They won\u0027t answer you. Besides, you can\u0027t control your swarm of insects and handle my soldiers. You\u0027re going to sit still and listen to what I have to say.\"\\n\\n I struggled, frantically looking for Jade.\\n\\n What I saw stopped my breath in my throat. Zombie enforcer two had corralled Mia, Jade and Sophie up against Bry\u0027s car.\\n\\n \"No he\u0027s not you asswipe,\" Tiff said, latching on to my arm, the only piece of flesh revealed. Her fierce bravery drove her to stand perilously close to Parker\u0027s zombie.\\n\\n It snarled, lifting its lips off its teeth and I used what Tiff gave me like a pump at the gas station, recharging my Death Battery. A surge of energy filled me and I flung it into the zombie.\\n\\n \"Release me!\" I screamed into its brain like a jackhammer.\\n\\n It staggered backward, dropping its bone crushing hold and I fell forward into Tiff.\\n\\n \"No!\" Parker screamed, zombie two\u0027s dead gaze breaking from the girls and meeting mine.\\n\\n \"Get him!\" Parker roared.\\n\\n Jonesy barked out, \"Make the bugs go up their asses, Hart! Up. Their. Asses!\"\\n\\n Really? Terrific idea.\\n\\n The zombie was almost on me and my juice was sorta low when Alex stepped in, grabbing the zombie and halting his progress. Without breaking stride or grip, Alex said, his glasses long gone, \"You owe me Hart.\"\\n\\n Right.\\n\\n It was like that old Terminator movie where the two terminators square off. The zombie wanted to get to me and that was as far as his thought process went. He latched onto Alex\u0027s forearms, the same height as Alex. Alex mirrored his actions and they struggled against each other. Finally, Alex bent down and swung the zombie over his shoulder in a fireman\u0027s carry, sprinting in the direction of the woods. He got sufficient momentum and heaved the zombie into a tree. There was a dull crunch and snap, the zombie slithered down the tree trunk like a puppet whose strings were severed, disconnected.\\n\\n \"That oughta do him!\" Alex said pridefully.\\n\\n He just didn\u0027t understand zombie determination.\\n\\n The zombie soldier sat up, back broken. Using its arms, he came forward in a halting crawl that was so fast it took our breath away.\\n\\n \"What the fuck?\" Jonesy screamed, running to Sophie. \"It\u0027s like a zombie spider. Terran, do something!\"\\n\\n John was busy trying to let us do our stuff while the Graysheet Null was powering all over the top of him. As a point of fact, John was as pale as a ghost.\\n\\n Not funny.\\n\\n I turned too late and Parker had grabbed me from behind. I took my left hand, wrapping it in the fist of my right and drove my elbow into his torso. I was rewarded with a release and a grunt.\\n\\n But zombie two had reached my feet and jerked me off them. I landed on my back, the wind knocked out of me as the asphalt bit into me painfully, my teeth snapping together on a rattle. He used his arms to heave himself on top of me, pinning me with his weight. His breath was like old coffin in my face.\\n\\n Bry had his hands buried in the zombie\u0027s back and was pulling for all he was worth but the directive from the AFTD, one as powerful as Parker, was going to be a challenge to break.\\n\\n My breath was coming too fast, I was trying to look around the zombie to see what was happening with the girls.\\n\\n Jade.\\n\\n It was then that I felt a familiar connection.\\n\\n \"Mr. Weller, please, allow me,\" Clyde said as his fingers sunk into the clothing of the zombie. He wrenched him off of me and flung him behind his body in a high arc, the zombie landing with a deafening crunch on top of the Graysheets\u0027 hood. The engine shrieking steam on impact.\\n\\n I looked up at Clyde, his hands planted on his hips, every hair in place, looking like he\u0027d just stepped off his day job.\\n\\n \"That was very well done, Clyde,\" feeling relieved and nonplussed in a confusing slush.\\n\\n He inclined his head but then his face changed, became empty.\\n\\n I jerked up into a sitting position and turned around, looking at Parker. \"I can get to him, Caleb. He\u0027s not all yours. Don\u0027t make me,\" he said through the wall of bugs that swirled just above the surface of his face.\\n\\n Tiff looked at me in horror, could he take Clyde? \\n\\n","sourceLink":"https://allnovel.net/death-screams-death-4/page-11.html","bookId":2492,"book":{"id":2492,"title":"Death Screams (Death #4)","description":"Storyline: Death Screams (Death #4) \\n Caleb\u0027s second year of high school starts off without a hitch until Jade touches the wrong clairvoyance sample that foretells a murder in her future. Will she remain safe even while assisting police officers Garcia and Gale in a race to prevent a cataclysmic death? \\n Sophie and Jonesy aren\u0027t seeing things eye to eye, but when her safety is threatened by an attacker targeting Astral-Projection girls, they put their differences aside. The FDA approved depressant has begun to be administered to the teens for suppression of paranormal abilities during sleep for safety reasons. Or so they\u0027ve been told. \\n Carson and Brett have escalated the violence that they perpetrate and leave Caleb no choice but to reciprocate. After saving the newest member of their group from certain abuse, Caleb knows the bull\u0027s-eye is dead center on him. Again. \\n Does Caleb use the undead as a weapon of defense while his group hangs in the balance of imminent peril?\\n","cover":"https://allnovel.net/images/death-screams-death-4.jpg","author":"Tamara Rose Blodgett","type":"Horror","source":"allnovel","link":"https://allnovel.net/death-screams-death-4.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:44:24 PM"}}
