{"id":105337,"no":25,"title":"Page 25","content":"\n \"Tell him, Roberta Gale,\" Clyde said, his words vibrating with intensity.\n She stared at him, then looked at Garcia. \"I think, last year... when I met Clyde... \"\n \"The corpse?\" Garcia asked rhetorically, catching flies while his mouth hung open, his expression incredulous.\n She flinched, but was brave and continued. \"Yes,\" she said defiantly. \"He\u0027s dead, I get that, Raul.\"\n \"Then what in the blue hell are you circling here, Bobbi?\" he asked, completely oblivious to the teens as witnesses.\n Tiff stepped forward, spitting her wad of gum out, where it landed on top of the brainless zombie on the ground with a wet slap. \"I know.\"\n We all looked at her.\n Tiff looked at Gale and she returned her stare. \"He\u0027s not dead to you,\" she said with sureness.\n Gale nodded. \"I think he stopped being dead when I met him.\"\n Clyde looked at her with a tenderness that belied his actions. His toughness, strength and integrity underscored by his soft regard of her, stripping him of nothing.\n Garcia was speechless, his wheels turning, none of the scenarios he thought of were good. I could tell by his expression.\n I touched on an idea and turned to Clyde, his face already turned to me.\n \"Clyde?\"\n \"Yes... Caleb,\" he said with difficulty, honoring my request to use my name even as his default tried to kick in.\n \"Did you answer my call?\"\n He nodded slowly. \"I did.\"\n I could hear an unspoken something in there, I moved Jade away from me and walked over to him, all about this moment, this possibility that was forming in my mind.\n He knew what I was really asking and answered my unspoken question.\n He put his fist to his heart, so tightly clenched the skin looked like a rubber band. \"I felt her duress. I had to come, I had to answer.\"\n No, my mind denied. \"Did you respond to my call?\"\n \"Yes. I did. I felt hers as an echo, a distress call.\" His eyes never left mine. \"One of my kind was abusing her, I could not abide that.\" His eyes searched mine.\n \"Did I misstep, Master?\" His gaze begged me for understanding.\n I shook my head. I didn\u0027t know all the consequences of this but we were in trouble here. It was a whole new can of worms, as Gramps would say.\n Big trouble.\n Huge.\n CHAPTER 18\n Sophie\n The agent had her. Just a few more seconds and he would be inside. He swarmed her mind, fingers of his ability pressing carefully everywhere until he found the spot where he could encroach.\n There! He was in, he saw her immediately, her mocha skin in sharp contrast to her light aqua eyes. She was dressed as all AP girls, as they saw themselves. Sophia Morris had a long dress of white. Gauzy, it floated as she moved, looking around herself furtively.\n She knew someone had breached her defenses.\n He had to get to her before she saw him. He was allowed no witnesses.\n He surged forward and in a moment of inspired intuition her mind located him. She turned as his hand passed through the cloud of her hair, missing definitive purchase.\n Sophie ran, screaming in her mind to Proctor, uselessly. She had just entered realm, he would not be concerned yet.\n A lot could happen in less than a minute. She tried to hide but he was everywhere and nowhere. She evaded, his hot breath on her neck.\n \"Mr. Proctor?\" Randi asked.\n Thomas Proctor looked up from his stopwatch impatiently. Sophie had been in realm only twenty seconds. He really wanted to stay on top of her time. Sophie had reached a plateau of progression to PofA. She could no longer traverse realm. She was stuck there, never advancing. God knew she had the talent. This scare with the other AP girl had put the kibosh on pressing her onward, challenging herself. He found himself mildly insulted that she didn\u0027t think he could protect her. After all, he was a Level Five.\n His eyes met Randi\u0027s. Just a Level Three but tough as nails. She\u0027d been in and out of realm but didn\u0027t have the skill or ability level to get to PofAs like Sophie. She\u0027d be a domestic. Traveling locally and not globally. Oh well, not everyone could travel everywhere.\n \"Yes?\" Proctor asked, impatience slipping into his tone.\n \"The bell rang... we want to be dismissed,\" Randi said logically, her eyes, dark and exotic, difficult to read. He frowned, Proctor had been so caught up in seeing Sophie through realm he\u0027d cut the timing of the drill too close to the end of class. He sighed, exasperated, seeing that boyfriend of hers, Buddy, already hovering at the door waiting for her. He\u0027d have to bring her out of realm.\n Damn.\n His thoughts were abruptly shattered when Randi screamed, \"Mr. Proctor!\"\n He jerked his head to where she was pointing as the Hughes boy rushed forward.\n A large bruise began to bloom on the side of Sophia\u0027s face like an ugly flower.\n It was the size of a fist, Proctor thought frantically as he glanced down at his stop watch and belatedly realized she\u0027d been in realm too long.\n Two and a half minutes.\n She had not moved on to her PofA. She was being held in realm.\n Against her will.\n Proctor laid on the floor, slipping the tether of consciousness, his last wakeful sight of Sophie, blood beginning to trickle out of her nose, her breathing coming in gasping fits.\n Sophie felt him before he laid hands on her and cracked his fist on the side of her face. She free fell slowly, spiraling downward and he followed, his hands tearing at her dress.\n Sophie tried to fight him off, but his hands were everywhere and she could feel her panic set in.\n She\u0027d never been hit before, the pain was an enormous throbbing mass against her face. She looked at him as they fell together, committing his face to memory. If she got outta this she was gonna nail this creep.\n Seeing her stare at him the agent backhanded her. What he really wanted to do was knock her teeth down her throat. That\u0027d subdue her. Realm was difficult to work within, it was a balance of a non-real environment and he was chosen specifically for his ability to maneuver within its constraints.\n He did, gripping her wrists and launching them above her head, her shoulders shrieking in protest.\n Sophie screamed. She screamed for Proctor, she screamed for Buddy.\n She screamed for Jonesy.\n The agent smiled, he knew no one would assist her, smiling as the blood from his blow leaked out her nose, a nice bruise swelling her lovely face.\n He would enjoy this.\n A sound alerted him and he turned, seeing the damned teacher come at him.\n \"Get off her!\" Proctor shouted, the sound of his voice swallowed in the pillow-like environment of realm.\n The agent threw Sophie away from him and began his attack on the teacher.\n It was a twofer. He\u0027d kill them both. Happy day.\n Sophie got up on her knees, her dress a shredded mess and watched the attacker come after her teacher.\n Proctor was defenseless against the assault. It was obvious to Sophie that he\u0027d received hand to hand combat training. Proctor may have scared him off the first time with Amanda but he wasn\u0027t going anywhere now.\n He was expert.\n And he was killing Mr. Proctor.\n Sophie watched as he rained blows along his torso, driving Proctor to his knees. As Proctor fell like a downed tree, his eyes met Sophie\u0027s.\n Regret lay in their depths.\n Sophie closed her eyes, resigned.\n Despair washed over her like spoiled milk.\n \"Listen to me, don\u0027t be a hero,\" Randi said as Buddy looked at Sophie.\n It was just the two of them, there was no one to ask for help, last block of the day and Randi had been late leaving. Proctor had laid down when he saw damage on Sophie, realizing too late that the attacker was with her in realm.\n Or someone was.\n Their gazes locked, Buddy deliberating. When he looked at Proctor and saw bruises appear, he turned toward Randi. \"Get help!\"\n Buddy laid down next to his teacher just as blood began to pour out of his mouth.\n Internal bleeding.\n Organ damage.\n Buddy went under.\n Sophie opened her eyes and Buddy was there. The relief was so overwhelming she couldn\u0027t breathe.\n The attacker turned and Sophie whimpered, the teacher at his feet, clearly dead.\n His attention was fixed on her, his eyes shifting to Buddy\u0027s at the last moment, his smile faltering.\n Buddy didn\u0027t wait, he rushed the attacker, hoping he\u0027d been worn down by attacking a defenseless girl and beating their teacher to death.\n The agent met the new arrival and immediately knew him for what he was.\n They circled each other warily, each sizing the other up.\n Buddy began. Fresh, young and aggressive. He peppered deliberate jabs along the agent\u0027s rib cage, feeling the attacker\u0027s foot catch him on his knee. He began to buckle and countered with a foot strike of his own, sweeping the leg.\n As he fell, Buddy launched himself on top of him, hitting his esophagus in what he thought was a killing move.\n Unfortunately, the attacker had cat-like reflexes and anticipated the delivery, evading it smoothly as he hit Buddy directly in the chest. The breath wheezed out of him but Buddy had already struck again and this time he got the attacker in the chest.\n An impasse.\n Buddy tried to breathe but felt his vision grow dim, the sensation of being torn from realm, uncomfortably-painful. It felt like a turn on a roller-coaster, chaotic and jerky, he was thrown out of realm and into his physical body with a sickening lurch.\n His rage at not delivering the death blow to the attacker, was unparallelled to any he\u0027d ever known.\n He\u0027d almost had him.\n Buddy rolled over and evacuated his stomach on the floor of the Astral Projection classroom.\n He was in good company, Sophie was vomiting beside him.\n But she was in good hands, that prick Mark Jones was holding her hair away from her face as she did.\n Perfect, Buddy thought. What a classic SNAFU.\n Situation normal, all-fucked-up.\n Caleb\n I ran to the AP class, filled with students, adults trying to corral them outside.\n I swept into the classroom and was greeted by Jonesy holding Sophie as she puked her guts out, Jade beside me.\n When Sophie looked up, Jade gasped. Her face had been beaten, one side of swelling in an ugly red lump, squeezing one eye shut.\n Beside her lay the body of Mr. Proctor.\n I knew he was dead.\n I could feel him.\n My eyes met John\u0027s. Alex was hovering around the new girl, Randi. She was talking to the school nurse and the cops assigned to the scene.\n Gale and Garcia.\n I was beginning to think there wasn\u0027t anybody else on the force. It wasn\u0027t long before all the kids were gone and it was just the cops, Jonesy, Alex and Randi.\n Jade and I stood there as the dead techs came in. I heard gloves snapping on and the smell of powder residue filled the air. The fragrance bringing a memory trigger of last year, the graves, the killings.\n Smith.\n I felt a presence at my back and my eyes met Tiff\u0027s. She knew what the deal was. A lone tear escaped her eye. The only time I ever saw Tiff cry.\n I didn\u0027t know it then, but I\u0027d never see her cry again.\n I guessed I should leave. It wasn\u0027t really my investigation, besides they had this. I started to exit the classroom and Garcia said, \"Hart, don\u0027t leave. Jade can.\"\n I shook my head. \"No way. I don\u0027t want her away from me until I know what\u0027s goin\u0027 on here.\"\n Gale raked her fingertips through her hair. \"What\u0027s going on is the AP teacher has been killed and the school nurse was brought in to use the first batch of depressant in an emergent situation.\"\n She\u0027d kinda lost me and Garcia clarified. \"The kids needed to be saved. The attacker returned and this student,\" he glared at Buddy, \"went into realm without adult supervision, playing hero.\"\n \"I wasn\u0027t playing. If I hadn\u0027t gone in after her, she wouldn\u0027t have survived that guy.\"\n Really.\n Buddy looked at me and I raised my eyebrows.\n \"He was about to hand me my ass, Hart.\"\n \"Language,\" Gale intoned.\n I ignored her, focusing on Buddy.\"What... was he like a pro or something?\"\n He nodded. \"Or something,\" he said, licking a cut beside his mouth and wincing. As I looked at him I didn\u0027t see many places that hadn\u0027t been abused pretty good, his face a mass of welts, cuts and dark marks that would be bruises tomorrow.\n He moved closer to Sophie and Jade came forward scrunching down next to her. Jonesy stood, allowing Jade access and the girls talked quietly together.\n Jade reached out to touch the welt on Sophie\u0027s face and gasped.\n My head whipped around. \"What?\"\n Garcia forced his notepad back in his pocket crooked, the tip sticking out awkwardly. He left Randi\u0027s side, questions forgotten.\n His eyes met Jade\u0027s. \"What is it?\"\n Her throat hollowed out and I knew she was frightened. \"I know who did this to her.\" \n","sourceLink":"https://allnovel.net/death-screams-death-4/page-25.html","bookId":2492,"book":{"id":2492,"title":"Death Screams (Death #4)","description":"Storyline: \n Death Screams (Death #4) \n Caleb\u0027s second year of high school starts off without a hitch until Jade touches the wrong clairvoyance sample that foretells a murder in her future. Will she remain safe even while assisting police officers Garcia and Gale in a race to prevent a cataclysmic death? \n Sophie and Jonesy aren\u0027t seeing things eye to eye, but when her safety is threatened by an attacker targeting Astral-Projection girls, they put their differences aside. The FDA approved depressant has begun to be administered to the teens for suppression of paranormal abilities during sleep for safety reasons. Or so they\u0027ve been told. \n Carson and Brett have escalated the violence that they perpetrate and leave Caleb no choice but to reciprocate. After saving the newest member of their group from certain abuse, Caleb knows the bull\u0027s-eye is dead center on him. Again. \n Does Caleb use the undead as a weapon of defense while his group hangs in the balance of imminent peril?\n \n","cover":"https://allnovel.net/images/death-screams-death-4.jpg","author":"Tamara Rose Blodgett","type":"Horror","source":"allnovel","link":"https://allnovel.net/death-screams-death-4.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:44:24 PM"}}
