{"id":88762,"no":44,"title":"Page 44","content":"“Why don’t you go up and check? He might still be awake.” “You think?” “He’s not the type to leave anything unsaid,” Thor told him. “At least go up and take a look. He won’t mind.” “All right. Thanks.” Jed headed for the stairs. Christina tossed and turned. It was happening again. She was in agony from the things that had been done to her, and she swallowed, choking down her tears. The monster would come again, she knew, but that wasn’t as bad as knowing that her time was ticking away. She read the papers. She knew. Once they were taken, the victims had only a few days left. And then… She tried to scream. It was a silent sound behind the gag. And then it wasn’t. Jed never made it to Adam’s room. He heard Christina scream, and he turned, tearing down the hallway, throwing open her door. She was sitting up in the bed, but she didn’t seem to be seeing anything. He rushed to her side. Shook her. Sat beside her and drew her against him. “Christina? It’s me. Jed. Christina!” By then Thor, Genevieve and Adam had rushed into her room and were standing around the bed, looking concerned. “Christina?” Jed said again. She shuddered, cried out, then buried her face against his chest. “What is it?” Jed asked. “He…he has someone right now,” she whispered. “I’m sure of it. When I dream, I’m…her. I know it sounds crazy, but it’s true. He has a woman, and she’s terrified. She knows she’s going to die.” Adam walked closer, taking her hands. “What does she see?” he asked gently. “Nothing. It’s dark. She’s blindfolded. And she can’t cry out, because she’s gagged.” Jed inhaled and held his breath. What she was claiming was…impossible. And yet, it sounded so convincing. Christina wasn’t lying. He would stake his life on that. Whether what she had seen was a dream or something more didn’t really matter. To her, it had been real. “And they were all here tonight…” Adam murmured. “What?” Jed demanded. “Adam thinks Beau appeared because someone in the house is the killer,” Thor explained. “That’s ridiculous!” Christina exclaimed. “You’re talking about Ana, and Mike and Dan. Or my next-door neighbor and his girlfriend. It’s impossible. There has to be another explanation.” “There could be, of course,” Adam said. O’Reilly’s. The name filled Jed’s mind like a giant neon sign. “Dan,” he murmured consideringly. He hated to think it, but Dan was an actor, used to pretending to be someone he wasn’t, and he’d known one of the recent victims, as well as the woman who’d supposedly fallen in the fog. “What?” Christina demanded indignantly. She was furious, and he knew it. He should have seen it coming, in fact. Christina was fiercely and understandably loyal to her only living relatives. She leapt out of bed. “That’s the most ridiculous thing I’ve ever heard. We’re going to go see him right now and he can tell you so himself.” A few minutes later, all five of them went downstairs and headed for Jed’s sedan. Killer followed, barking and running around their feet. “I’ll lock him in the house,” Christina said. She picked up her dog, hugged him and talked to him on the way back to the house, but she was firm. He was locked inside. When she rejoined the group she turned to Jed and said challengingly, “Are you sure you don’t want to knock on my next-door neighbor’s door and accuse him of being a murderer, too, huh?” “All right, why not?” Jed said equably, and together they walked over to Tony’s door. He could almost feel the waves of anger emanating from her. He had attacked her family. That was a sin for which there might be no such thing as forgiveness. She knocked at the door of Tony’s sprawling ranch. All the windows were dark, but in a few seconds they heard a sleepy voice asking what was going on, and Tony opened the door. He was wearing a robe, which he had apparently thrown on quickly, since it was inside out, and his hair was tousled. “Sorry, Tony, you were sleeping, I take it?” Christina said. “Um…yeah.” He was only half awake, but he still tried to offer a smile. Ilona appeared behind him, asking, “What is it, Tony?” She, too, was wearing a robe, and she was yawning. Jed thought he could hear a television from somewhere deep in the house. They must have fallen asleep in front of the bedroom TV. “I don’t know,” Tony told her, then turned to Jed and Christina. “What’s up?” “We’re just checking to make sure you guys got home safely,” Christina lied. “Um, Christina,” Tony said as if he were talking to someone who wasn’t quite there mentally, “I live next door.” “I know.” “Did you guys make sure Ana got into her house okay?” Jed asked. “Dan walked her home,” Tony said. Christina could be as angry as she wanted, Jed thought, but he wasn’t taking any chances. He turned, leaving her to say good-night, and he was running by the time he reached Ana’s property. He banged the door hard. He heard what sounded like a scream inside and got ready to break down the door, but in the end he didn’t need to. There was a flurry of footsteps and the door was flung open, revealing Ana, in pajamas and a robe. She stared at him as Christina came loping up behind him. “What are you two doing here?” Ana asked. “You’re okay?” Jed asked anxiously. “Of course I’m okay,” Ana said, puzzled. “Dan walked you home, right?” Christina said. “Yes. So why are you…?” She paused, staring at them. “What is it?” Christina asked. “Haven’t you heard?” Ana said. “There’s an alert out. Another woman is missing.” Christina let out a moaning sound. “And…we know her,” Ana went on. “Who is it?” Jed demanded. “Angela McDuff,” Ana said. “Mike’s ex-wife.” 17 T he cop who interviewed Mike was named Jerry Dwyer, who, it turned out, knew Jed well. As soon as Mike heard about Angie he had expected to be called in and questioned. After all, wasn’t the ex always the first one to be suspected? He’d expected to be stuck in a bare-bones interrogation room and questioned harshly. You were married to her, but she twisted you around her little finger and used you to get ahead. Then she left you and tried to take you for everything you had. A real redheaded bitch, huh? Then they would start trying to tie him to the earlier murders. Of course, he would point out that he’d been a kid back then, only eighteen, to which they would respond that lots of sickos started killing by eighteen. But apparently he’d been watching too much TV. Dwyer hadn’t been anything like what he’d expected. The man had asked him questions, of course, but sitting in Mike’s own living room and perfectly pleasantly. “When did you last see your wife?” Dwyer asked. “Ex-wife.” “Ex-wife.” “I was at work. She stopped by my office almost a week ago.” “Did she want more money or anything like that?” Jerry smiled to show it was nothing personal. “Sorry, I have to ask.” “No. She didn’t want more money. She keeps thinking I can do more to advance her career,” Mike said. “Can you?” “Yes and no. I suggest names. But the producers and sometimes the directors have the last say on any casting decisions.” He’d dragged on a pair of jeans when he’d heard the pounding on his door, but for some reason Mike felt as if he were wearing a tie and it was getting too tight. He inhaled, exhaled. “Look, if I’d been going to kill Angie, it would have been a long time ago, back when she took me for a ride until I couldn’t help her anymore, then dumped me. I’m not that patient.” The cop almost smiled. “She like to get her hair done?” “You name it, she likes to get it done. She likes being perfect.” “Sounds like you still know her pretty well.” Mike smiled. “Hey…if you knew Angie once, you know her forever. She’s not what you’d call deep.” Jerry watched him, nodding gravely. They were sitting on the sofas in the living room, two modern light-toned leather pieces perpendicular to the gas fireplace. Mike couldn’t help thinking that the cop was going to get up at any minute and start going through the place room by room, taking it—and him—apart. Instead Dwyer simply stood and said, “Thanks.” “Thanks?” “That’s it, at least for now.” Mike stood, as well, and stared at Dwyer. Swallowed hard. “You’ll call me if…you find her?” Dwyer stared back at him. “Of course. And keep thinking. You never know…you might be able to tell us something that can help us.” “Of course.” Mike walked Dwyer to the door. He could feel his heart hammering, and all he could think of was the old Edgar A. Poe story—“The Telltale Heart.” He was sweating bullets. He couldn’t breathe. And his heart was beating so loudly they ought to be able to hear it on Mars. “Good night, and thank you again, Mr. McDuff.” “Absolutely, Detective Dwyer.” As he closed the door behind the policeman, Mike thought he might have to dial 911; he was practically gasping for breath. “Hey, don’t break it down!” Dan called out irritably. A second later, he opened the door. His red hair was tousled, he was clad in gray sweats, and his feet were bare. He stared in confusion at the group on his doorstep—a group that now included Ana, who’d declared herself too spooked to stay home alone.","sourceLink":"https://allnovel.net/the-seance-harrison-investigation-5/page-44.html","bookId":2271,"book":{"id":2271,"title":"The Seance (Harrison Investigation #5)","description":"Storyline: The Seance (Harrison Investigation #5) A chill falls over Christina Hardy\u0027s housewarming party when talk turns to a recent murder that has all the hallmarks of the so-called \u0027Interstate Killer\u0027 murders from fifteen years before. To lighten the mood, the guests drag out an old Ouija board for a little spooky fun -- and that\u0027s when things become truly terrifying. Summoned by the Ouija board, the restless spirit of Beau Kidd, the lead detective -- and chief suspect -- on the original case, seeks Christina\u0027s help: the latest killing isn\u0027t a copycat crime, and he wants his name cleared. Back in the real world, cop-turned-writer Jed Braden is skeptical of Christina\u0027s ghostly encounters, but his police sources confirm all the intimate details of the case -- her otherworldly source is reliable, and the body count is growing. The spirits are right. The Interstate Killer is still out there, and Christina\u0027s life is hanging in the balance between this world and the next.","cover":"https://allnovel.net/images/the-seance-harrison-investigation-5.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-seance-harrison-investigation-5.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:29:34 PM"}}
