{"id":88768,"no":50,"title":"Page 50","content":"\n “Me,” Katherine Kidd announced softly.\n That led to more staring and more laughter, not to mention a lot of teasing, interrupted only by the arrival of their food.\n Genevieve, Thor and Adam had left the next day. Christina had been sorry to see her friends go, but she was comforted by the knowledge that they’d made a date to go diving together the weekend after Halloween.\n She doubted, however, that she would ever see Adam Harrison again, and she told him she was sorry about that when she slipped into his room to help him pack.\n “You never know, Christina. You never know. Perhaps one day I’ll call on you to help someone else.”\n “Gladly,” she said as he smiled, and folded his last shirt. “At least your time here wasn’t wasted. I really did have a ghost.”\n “You’ve always had ghosts around you, Christie. You see them when you need to, and they find their way to you when they need you.”\n “But I haven’t seen Beau since…”\n “Since you were in Tony’s basement.”\n “Right.”\n “Did you see the papers, though? He was vindicated. That was what he needed. I don’t think he’ll be back.”\n “Do you think that Katherine saw him, that she was able to say goodbye?”\n “I do,” he assured her.\n After that she and Jed had been alone in the big old house, and now there he was, standing beside her bed, watching her.\n “You went to Beau Kidd’s grave?” she asked.\n He smiled and sat down next to her. “I think he kept you alive until I got there, and I had to thank him.”\n She smiled and touched his face. “Did you see him?” she asked.\n “I prayed for him,” he said, and she didn’t push it.\n “Coffee’s on,” he told her, apparently eager to move away from a topic he still had trouble with.\n “Thanks.”\n He left the room, and she showered, dressed and went downstairs to the kitchen, where she poured herself some coffee.\n Suddenly she knew he was there, and she turned around. He was in his full dress uniform, looking very handsome. He felt so real when he took her into his arms, and so did the gentle kiss he planted on her forehead.\n “Thank you,” he told her.\n “Thank you. You saved my life.”\n “You’re welcome. But now it’s time for you and Jed to make your own lives.”\n “I know. Does he?”\n “I’m willing to bet he does. You should go to him now.”\n “I won’t see you again, will I?”\n “I don’t think so. I think it’s time for me to rest in peace, as they say.”\n She nodded and felt tears sting her eyes at the last touch of his hand. She fought them back and headed out to the porch, where she found Jed, his bare chest gleaming as he typed on his laptop beneath the rising sun. A large package lay on a glass-topped wrought-iron table next to him.\n Definitely not an engagement ring, she thought, and smiled, arching her eyebrows in curiosity.\n “It’s for you,” he said. “Open it.”\n She did, discovering a blue checkered dress and something furry. “What…?”\n He shrugged awkwardly. “Okay, I copped out on the lion, I admit, but Dan said he’d do it. You have to be Dorothy, though, because the only way Killer will stay in his basket is if you’re the one carrying it.”\n “What?”\n “We need to get together with friends, have fun…do normal things. Really live our lives. I thought we could start with Halloween.”\n “Oh,” she breathed.\n “How am I doing?” he asked her.\n “Magnificently,” she told him.\n “Good. Then there’s one more thing.”\n He pulled a small box out of his pocket.\n Opened it.\n Held it out to her.\n It was a diamond ring. Beautiful. Marquis cut, in an antique setting.\n She stared at him, unable to speak.\n “May I?” he asked, his tone husky, a little unsure.\n She nodded, offering him her left hand.\n “I wish you’d say something,” he murmured, dark eyes meeting hers.\n She smiled, pushed the computer aside and sat on his lap, then found his lips.\n At last, she broke away, breathless. “How am I doing?” she asked.\n “Magnificently,” he told her. \n","sourceLink":"https://allnovel.net/the-seance-harrison-investigation-5/page-50.html","bookId":2271,"book":{"id":2271,"title":"The Seance (Harrison Investigation #5)","description":"Storyline: \n The Seance (Harrison Investigation #5) \n A chill falls over Christina Hardy\u0027s housewarming party when talk turns to a recent murder that has all the hallmarks of the so-called \u0027Interstate Killer\u0027 murders from fifteen years before. To lighten the mood, the guests drag out an old Ouija board for a little spooky fun -- and that\u0027s when things become truly terrifying. \n Summoned by the Ouija board, the restless spirit of Beau Kidd, the lead detective -- and chief suspect -- on the original case, seeks Christina\u0027s help: the latest killing isn\u0027t a copycat crime, and he wants his name cleared. Back in the real world, cop-turned-writer Jed Braden is skeptical of Christina\u0027s ghostly encounters, but his police sources confirm all the intimate details of the case -- her otherworldly source is reliable, and the body count is growing. \n The spirits are right. The Interstate Killer is still out there, and Christina\u0027s life is hanging in the balance between this world and the next.\n \n","cover":"https://allnovel.net/images/the-seance-harrison-investigation-5.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-seance-harrison-investigation-5.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:29:34 PM"}}
