{"id":88725,"no":7,"title":"Page 7","content":"\\n\\n “Just keep your doors locked, okay?” Dan said.\\n\\n “I told you, I’m always careful. I carry pepper spray, I don’t talk to strangers and I don’t open the door without checking through the peephole,” Christina assured him.\\n\\n The doorbell rang.\\n\\n Christina jumped, then flushed in embarrassment.\\n\\n Mike said, “I’ll get it,” and headed down the hall.\\n\\n “Remember how much fun we had with this thing?” Ana said, returning to the original subject. Christina wasn’t sure why, but she was sorry she’d kept the damn thing around. Ana seemed way too enamored of it.\\n\\n “It’s Tony from next door,” Mike said when he returned a minute later, two more people in his wake. “And his fiancée,” he added, stressing the word.\\n\\n Tony went over to Christina, took her shoulders and gave her a peck on the cheek. He’d been a gaunt, geeky boy, but he’d grown into a tall, well-built man. His eyes were gray, his hair sandy-colored, and his nose and ears were no longer too big for his face.\\n\\n “Hey, Tony, thanks for coming,” Christina said.\\n\\n “Nasty fog out there,” he said. “I couldn’t even see your house from mine.”\\n\\n “Spooky,” Ilona agreed.\\n\\n “Christina, you remember Ilona, don’t you?” Ana asked.\\n\\n “We met at the funeral,” Ilona said, stepping forward to take Christina’s hand. She had a warm grip and sympathetic green eyes. She was slim, with long, straight blond hair and a pleasant way about her.\\n\\n “Yes, of course we met,” Christina said warmly. “Congratulations. I didn’t know the two of you were engaged. When’s the big day?”\\n\\n “Oh, we haven’t planned that far ahead yet,” Ilona said.\\n\\n “I say we ask the Ouija board,” Ana suggested.\\n\\n “I say we have a beer and some barbecue,” Mike protested from the doorway.\\n\\n “Oh, all right, but then we do the Ouija board,” Ana insisted.\\n\\n “What about Jed? Should we wait for him before we eat?” Christina asked.\\n\\n “My dear cousin will get here in his own good time,” Ana said. “He can eat when he gets here.”\\n\\n “Sounds like a plan,” Christina agreed.\\n\\n “Let’s eat, then,” Dan said.\\n\\n “Worked up a real appetite being a fluffy, huh?” Ana teased.\\n\\n Dan gave her a fake scowl as they all moved into the kitchen and started eating.\\n\\n The conversation was general and pleasant as it moved from topic to topic. It turned out that Ilona had originally come from Ohio, which led to a discussion about the Rock and Roll Hall of Fame. Nice, easy stuff.\\n\\n So why, Christina kept wondering, was she feeling so on edge?\\n\\n Ilona asked Christina about her work, and she explained that writing advertising jingles was more difficult than most people thought, as well as a crucial element in selling the product. “If you can get people to remember a jingle, then they’ll remember the product,” she explained. As she spoke, she could hear Dan, Mike and Tony talking about the murdered woman who had been found beside the highway.\\n\\n When everyone seemed to have finished eating, Ana reached over for Christina’s plate. “Done with this?”\\n\\n “Cleanup time?” Dan said, noticing. “Let me help.” He came over with a large garbage bag and they all tossed their paper plates into it. “Gran wasn’t the type to let any of us get away without picking up after ourselves, right, Christie?”\\n\\n “Right. But,” she added, smiling to take any sting out of the words, “it’s easier when all you have to do is grab a garbage bag.”\\n\\n “Gran made us scour her copper collection every Sunday,” Mike put in, a nostalgic smile curving his lips.\\n\\n “Yeah, and it was a pain in the butt,” Dan said, and grinned at Christina. “You gonna keep all that copper glowing forever?” he asked. His eyes indicated the array of copper pans and molds lining the special racks their grandfather had constructed to hold the collection.\\n\\n “Of course,” she said.\\n\\n “Better you than me,” Dan told her, laughing.\\n\\n “Christina was always the keeper of the keys,” Tony said, lifting his beer to her.\\n\\n “The keys?” Ilona said, puzzled.\\n\\n “Christie was always the one who loved all the old family stuff,” Tony explained. He sounded slightly impatient.\\n\\n “Oh,” Ilona said in a cool tone.\\n\\n “I’m sorry,” Tony murmured, pulling her close.\\n\\n “Get a room,” Dan teased.\\n\\n Ilona laughed softly, blushing, and drew away from Tony.\\n\\n “Why would they get a room when they have a perfectly good house?” Mike asked.\\n\\n “Forget it, it’s Ouija board time,” Ana announced.\\n\\n “The parlor is a mess,” Christina said.\\n\\n “We can just sit on the floor,” Ana said, waving away her objection. “We’ll start with Tony and Ilona. Maybe the Ouija board can give us a wedding date.”\\n\\n “Sure,” Tony said with a shrug.\\n\\n Ilona giggled. “Shouldn’t we dim the lights or something?”\\n\\n “Why not?” Mike asked with a shrug, moving to the switch that controlled the lights.\\n\\n Dan made a sound as if a soft and wicked wind were moving through the room.\\n\\n Christina, arms folded against her chest as she leaned against the arched doorway, groaned.\\n\\n Ilona and Tony set their fingers on the planchette, which began to move, finally settling over the J.\\n\\n “January,” Ana breathed.\\n\\n “It’s gotta be at least July,” Tony said. “We’re just not ready yet.”\\n\\n “Look at that,” Mike said as the planchette started moving around erratically. “She wants January, he won’t be ready until July, and poor Mr. Ouija doesn’t know what to do.”\\n\\n “You’re pushing it,” Tony accused Ilona.\\n\\n “No—you’re pushing it,” Ilona protested.\\n\\n “Don’t take it so seriously. It’s just a game,” Mike said lightly, as if aware that a real argument was in the offing.\\n\\n And that was all that it was: a game, Christina reminded herself.\\n\\n “Fingers barely touching the planchette,” Ana advised. “Christina, come over here and help me show them how to do it.”\\n\\n “Oh, all right. But we’re not doing this all night,” Christina protested. She flashed a smile at Ilona. “I want to learn more about how you and Tony got together. Who cares when the wedding is? We’ll all have a good time whenever you choose to have it—if we’re invited, of course.”\\n\\n “Of course you’re invited,” Ilona said.\\n\\n “All right, all right,” Ana said. “Just get down here.”\\n\\n “Is it dark enough? Want it spookier?” Dan teased.\\n\\n “That fog is spooky enough,” Ilona said, and shivered.\\n\\n “It’s just fog,” Christina said, barely managing not to shout. Damn. It wasn’t like her to be so edgy, but it was unnerving to realize how closely she fit the description of the victim of a serial killer.\\n\\n Either a copycat…\\n\\n Or a maniac who had somehow escaped detection for twelve years.\\n\\n “And don’t forget the moon,” Ilona added.\\n\\n “Are you thinking werewolves?” Tony teased her.\\n\\n “There are enough real monsters out there,” Christina said. “There’s no need to make up more.”\\n\\n There was a sudden uncomfortable silence in the room. She realized she had snapped out the words rather than simply speaking them.\\n\\n “I’m sorry,” she said quickly. What was wrong with her? It was just…\\n\\n It was just that stupid Ouija board and the idea of talking to spirits. She suddenly found the past welling up in her mind, a vision that was far too real. She could see Gran, after her grandfather had died. Sitting in her chair, looking at her so somberly. She’d dreamed that she’d talked to her grandfather. A psychology professor had once told her that such dreams were defense mechanisms, a way to reconcile oneself to losing someone. But Gran had said, “It’s dangerous. You have opened a door….”\\n\\n That was just Gran and the Irish speaking. She had never had such dreams again. Not even when she had lost her parents.\\n\\n All of that was far behind her now. She was a perfectly rational, sane person, and it was just the Irish sense of fun that made them all pretend to believe in banshees and leprechauns and even dreams.\\n\\n “Okay, Ana, let’s show everybody how it’s done,” she said, then lowered her voice teasingly. “It was a dark and stormy night…no, it was a dark and foggy night, with a strange, full moon rising above the mist.”\\n\\n Her light banter didn’t seem to be helping her mood any, she thought, and apparently it was obvious.\\n\\n “You okay, Christie?” Mike asked.\\n\\n “I’m fine,” she snapped.\\n\\n “My fault,” Mike said. “I’m sorry, I shouldn’t have—”\\n\\n “Mike, I’m sorry. I didn’t mean to snap at anyone. I guess I’m just tired.”\\n\\n “You’re really okay?” Dan said softly.\\n\\n “Yes, of course. Come on, Ana. Let’s do this Ouija thing and be done with it, okay?”\\n\\n “Hello, Ouija board,” Ana said, as if she were greeting an old friend.\\n\\n Christina forced a grin, then set her fingertips very lightly on the planchette, which took off, slowly spelling out “Hello, good evening.”\\n\\n “Is there a spirit in you tonight, Ouija board?” Ana asked.\\n\\n “Is she for real?” Christina heard Tony whisper to Dan.\\n\\n “Who knows?” Dan replied.\\n\\n “Real? Real is what we make it,” Mike put in.\\n\\n Christina knew that she wasn’t moving the planchette, so Ana had to be the one causing it to spell out the answer.\\n\\n “Y-E-S,” Ilona read softly.\\n\\n “Who are you?” Ana asked.\\n\\n They all stared as the planchette began to move again and Dan read aloud, “B-E-A-U-K-I-D-D…Bookid?” \\n\\n","sourceLink":"https://allnovel.net/the-seance-harrison-investigation-5/page-7.html","bookId":2271,"book":{"id":2271,"title":"The Seance (Harrison Investigation #5)","description":"Storyline: The Seance (Harrison Investigation #5) \\n A chill falls over Christina Hardy\u0027s housewarming party when talk turns to a recent murder that has all the hallmarks of the so-called \u0027Interstate Killer\u0027 murders from fifteen years before. To lighten the mood, the guests drag out an old Ouija board for a little spooky fun -- and that\u0027s when things become truly terrifying. \\n Summoned by the Ouija board, the restless spirit of Beau Kidd, the lead detective -- and chief suspect -- on the original case, seeks Christina\u0027s help: the latest killing isn\u0027t a copycat crime, and he wants his name cleared. Back in the real world, cop-turned-writer Jed Braden is skeptical of Christina\u0027s ghostly encounters, but his police sources confirm all the intimate details of the case -- her otherworldly source is reliable, and the body count is growing. \\n The spirits are right. The Interstate Killer is still out there, and Christina\u0027s life is hanging in the balance between this world and the next.\\n","cover":"https://allnovel.net/images/the-seance-harrison-investigation-5.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-seance-harrison-investigation-5.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:29:34 PM"}}
