{"id":31496,"no":22,"title":"CHAPTER XXII BREAD AND SALT","content":"Were you thinking how we, sitting side by side, Might be dreaming miles and miles apart? Two out of the Crowd. Lettice had had no tea, but she did not stay for it; she uprooted herself, setting back her chair without a sound, and flitted inconspicuously out of the exhibition. On her slow way home, in Tube and omnibus, she did some concentrated thinking. She was not surprised when Beatrice rushed up from the basement to inform her that a lady was waiting in her room, a dazzling lady who had arrived in a taxi-cab; she needed not Beatrice\u0027s ecstatic description to tell her who that lady was. She had caught Dorothea\u0027s eye across the hall. Well, what must be, must; screwing herself up to face a scene, she climbed the stairs. Her visitor had not sat down; a slight sumptuous figure, she stood posed against the mantelpiece, looking down into the fire. She started at the opening door, and raised her beautiful gazelle-brown eyes filled with tears. \"Oh, Lettice!\" Lettice made no reply. A wave of obstinacy rose to meet that appeal; she came to the table and stood slowly taking off and smoothing out her gloves. Lettice was sometimes possessed of a dumb devil. Dorothea\u0027s eyes opened piteously; her lip quivered, the tears tumbled down her cheeks, but in a flash she was across the room, had seized Lettice and turned her round by force. \"I don\u0027t care, you can be as angry with me as you like, but you shall listen, you shall answer, if I stay here all night. That woman—what was she doing with Denis?\" Lettice was dumb. \"Oh, don\u0027t you begin about being justly angry[Pg 189] and taking righteous vengeance—see what that sort of rubbish has done for me!\" Dorothea cried with passion. \"I must know about Denis. What has she done to him?\" \"I should think you could see that for yourself,\" said Lettice, opening her lips with extreme and ungracious reluctance. \"Yes; but is she—has she—\" \"Ask some of your friends; they\u0027ll know all the London gossip.\" \"I did ask Maurice, but he either couldn\u0027t or wouldn\u0027t tell; he said he\u0027d been out of town. Lettice, oh, Lettice, you can\u0027t surely think—he hasn\u0027t really—\" \"If you mean, do I think he\u0027s living with her, I don\u0027t know; I should think it very likely. But what does it matter to you? You\u0027ve done all you wanted—you\u0027ve had your revenge, and sent Mr. Gardiner to prison.\" She freed her hands resolutely and turned away. Dorothea flung herself into the nearest chair. Beautiful graceful figure, with the long lines of velvet sweeping to her feet, the plumed hat, the rich hair, the ivory whiteness of cheek and throat above her dark luxurious furs! Lettice hardened her heart. Let her go back to her Maurices and her other friends—she would soon get over it. She turned away, turned her back on her visitor, and began to prepare her solitary meal as though Dorothea did not exist. There was ill will in the very curve of her shoulders. Dorothea looked up. \"But I do love him so, Lettice!\" \"You love him?\" exclaimed Lettice, pausing with her egg on its way to the saucepan. \"Why, of course—how could any one help it? \"You seem to have consoled yourself pretty easily,\" said Lettice, with a doubtful glance at the violet velvet. Dorothea\u0027s eyes followed hers. \"Consoled myself? Do you mean this? This?\" She crushed up the velvet in her hand with scorn. \"Oh, you are stupid. I didn\u0027t expect you to be stupid, Lettice, I thought you would understand. What would you have had[Pg 190] me do, after that—that frightful day at Westby? One can\u0027t die to order. One has to kill time somehow. I loved Denis—oh, I did, I did love him—right from the very first. You may say I led him on, but I didn\u0027t, I didn\u0027t, I never thought of such a thing, I never so much as dreamed of its being possible, till one day I woke up and just found it had happened, to us both. So then what could I do but tear it out, and deny it, and make myself be loyal to my husband? I—knew—yes, I suppose I did know that Guy wasn\u0027t—I\u0027d seen things—but never anything really bad; and he was always good to me, truth he was, always. Because of my money, I suppose. But I didn\u0027t know that then. I had to believe in him, because he was all I had in the world. Oh! I can\u0027t talk of it; it sears me to think of those months. Lettice, Lettice, you haven\u0027t been married, you don\u0027t know how close that brings you. To find you have been mingled, made one with a nature like that—thinking, too, those hideous thoughts my husband had about me—Yes, look at that idea, take it home to you, if you can; and then tell yourself that, however you may try, you have not been married, and you don\u0027t and can\u0027t know what that awful intimacy means. Oh! I\u0027ve been thankful, since, that my baby died. I was glad to know the truth; but it tore me in two, Lettice, indeed, indeed it did. Console myself? Why, I\u0027ve been at Hendon, learning to fly. That man you saw me with, I met him there. I believe he fancies I\u0027m going to marry him. I don\u0027t care. I don\u0027t know what I\u0027ve said to him. It\u0027s all a blank. I never woke till I saw Denis. Why, that alone might have told you; should I have gone to him as I did, as though I were sure of my welcome, there in the face of everybody, if I\u0027d known what I was doing? I didn\u0027t know. I didn\u0027t know anything, except that to see him again was like coming home; and I went to him without another thought.\" Lettice, who all this while had been standing stock-still, with her egg in her spoon, began slowly to get under way. She slid the egg into the water, noted the time, straightened her shoulders, and then said, in a definitely milder tone: \"Well, I don\u0027t see what you expect me to do.\" [Pg 191] \"Can\u0027t we save him?\" She shook her head. \"Denis goes his own way. It\u0027s no use interfering.\" \"If you were to say something—\" Another slow shake. \"He wouldn\u0027t listen. I\u0027ve seen him like this once before, with a man he\u0027d been good to, who cheated him. He was like a stone.\" She paused, and added, slowly, slowly, drop by drop distilling for Dorothea\u0027s comfort the essence of her meditations in the train: \"I don\u0027t suppose it will go far. Denis isn\u0027t made that way. He will soon get tired of it.\" \"If he wanted to go wrong, he wouldn\u0027t know the way!\" She seemed to hear Gardiner\u0027s very accents. The acuteness of the pain took her by surprise—took away her breath and stopped her words. Dorothea gave a miserable little sob. \"\u0027Soon get tired of it!\u0027 Oh, Lettice, Lettice, but when you think of what he was!\" To that Lettice made no reply; her face was grim. After a moment she exerted herself to finish her former speech, still half unwilling, for it took her heart long to forgive, though her head now acquitted Dorothea of the worst of her guilt, of a deliberate betrayal: \"As a matter of fact, I don\u0027t believe there is anything wrong yet. I believe so far he is only playing with the idea. It may go no further. He has thirty years of habit to fight against.\" She did not say, \"To-day will probably settle it, one way or the other,\" but the thought was in her mind. Dorothea had sunk down on the rug in a miserable little heap, and was propping herself against the mantelpiece. \"Oh, I have been bad, I have been bad,\" she said on a long quivering breath, twisting her hands together, while the tears came tumbling down her cheeks and into her lap. \"Oh, it doesn\u0027t seem fair that a miserable little nobody like me should be allowed to do so much harm. Oh, if there is a God, why didn\u0027t he kill me when my baby died, and have done with it? To let me, me hurt a man like Denis—oh, I ought to have been squashed like a blackbeetle! And Mr. Gardiner too. Wherever I go I seem to bring nothing but[Pg 192] trouble! Do lend me a hanky, Lettice, mine\u0027s all soppy.\" \"It\u0027s hardly worth while to think of Mr. Gardiner, is it?\" suggested Lettice with faint irony. Dorothea raised her wet eyes. \"Why, of course I think of him, only I think of Denis more. It\u0027s everything with Denis, it was just because he wasn\u0027t like other men you couldn\u0027t help loving him. And now—now, even if he gets over it, as you say, it will never, never be the same.\" She stopped to swallow a sob. \"But Mr. Gardiner—I know prison is horrid, and I\u0027m sorry, oh! dreadfully sorry and ashamed whenever I think of him, but he\u0027ll come out at the end none the worse. Why, it isn\u0027t even as if it were a disgrace! You feel the same, Lettice, you know you do.\" Lettice said nothing; her face might have betrayed her, had Dorothea been on the alert; but she was already back with Denis. She did not like Gardiner, and she would never understand him. But Lettice—by that na?ve assumption of her prime concern for her cousin Dorothea had shown her, rather more plainly than she liked, where she stood. Her center of interest had shifted. She was scarcely sorry for Denis; she was almost angry with him. \"He shouldn\u0027t have done it,\" she said with a touch of sternness. \"I am disappointed in him.\" Lettice expected a good deal from her friends. Her feelings had changed, adjusting themselves unconsciously to the change in Denis. The protective instinct was dead. \"When I was a child, I spake as a child....\" Denis had put away childish things, and as a man she judged him. Gardiner had disappointed her too, yet with him she was not angry. His failure had been involuntary; and he had redeemed it, coming back of his own free will to put his manhood to the test. He was under the question now, this minute, every minute of the day. For the first time she let herself think of Denis\u0027s postscript: tacitly acknowledging that if she had not done so before, it was because she dared not. She could reason about Denis, she could not reason about this, though it lay in her heart like a stone all the time.[Pg 193] For Denis the issue was decided; whether he went to Mrs. Byrne or not, his eyes had been opened, he had tasted the fruit of the tree, he could never regain that child-like quality of which Dorothea had robbed him. If he took the one step further—well—yes, it did matter, it mattered horribly, the constriction at her heart was only less than she felt in thinking of the other sufferer. Still, it was less, for Denis would retrieve himself; Gardiner would not. If he failed now, he would be a broken man; he would go under. \"Insubordination, assaulting a warder\"—the words seemed ominous as thunder on a sultry night. And meanwhile here was the fount and origin of all this trouble, sitting on the rug, leaning her small head, stuffed with tears, against the wall, a dolorous little heap: poor child, she had punished herself worse than her victims. What to do with her? Lettice had never responded with enthusiasm to Dorothea\u0027s advances. Dorothea was intense; Lettice preferred the humdrum. Nor, as has been said, could she easily forgive. Still, if Dorothea really needed her, she supposed she would have to produce some sort of response. She moved about, laying the table, cutting the bread; presently she came to the fire to make toast. Dorothea roused herself. \"Let me do that,\" she said, her voice still thick and languid with tears. \"You go and sit down.\" \"You\u0027ll spoil your frock,\" said Lettice, with a last faintly disparaging glance at the violet velvet. Dorothea\u0027s eyes glinted; she set her teeth, stooped down, seized the hem of her skirt between her strong little hands, and tore it, r-r-rip, half-way up to the waist. \"That for my frock!\" What a baby it was, after all! \"Now I shall have to mend that before you can go home,\" Lettice admonished her, in a tone which, for Dorothea, she had never used before. \"Don\u0027t care,\" retorted Dorothea, defiant chin in air. And then, with a swift little snuggling movement, she nestled against Lettice. \"Oh, Lettice, Lettice, I\u0027ve been bad, and hateful, and I don\u0027t deserve to have any one like me, but—may I come and see you sometimes? I do seem to get into[Pg 194] such muddles when I\u0027m all by myself—and I haven\u0027t any one in all the world to go to now but you!\" Lettice did not answer, because she was engaged in rescuing the toasting fork from her guest\u0027s heedless hand, and blowing out the flaming bread. She scraped off the cinders, and with a firmness that admitted no question put that piece on her own plate, and the other, which she had made herself, on Dorothea\u0027s. \"Now come and have your tea,\" was her sole reply. Bread and salt—they ate it together. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3250/89060.html","bookId":604,"book":{"id":604,"title":"Convict B14","description":"简介： When men shall say, Peace, and all things are safe, then shall sudden destruction come upon them, as sorrow cometh upon a woman travailing with child, and they shall not escape....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3250","creation":"Aug 1, 2019 12:19:01 AM","modification":"Aug 1, 2019 12:19:01 AM"}}
