{"id":81232,"no":25,"title":"Page 25","content":"I no longer even feel free. I’m taken and yet the man who’s emotionally taken me won’t have me. If I weren’t so angry and frustrated, I’d throw the biggest damn pity party of my life after the one I threw in the Olympic trial fallout. “You were awesome, Rem!” Pete tells him in the car, sighing with pure delight. “Man, what a great night.” “Great fight, son,” Coach says, sounding the happiest I’ve ever heard the somber man speak. “Never broke form. Never dropped guard. Even Brooke felt the love tonight, huh, Brooke?” Silence follows, and I hold still in my seat and keep my gaze on the lights flickering out the window as though I’m not even hearing their conversation. I absolutely refuse to gush about my roses or compliment him. Yes, his fans showered me with roses and he fought like a true freaking wonderful champion … my pussy clenches as I remember the powerful plows of his fists, and now I refuse to think more about that either. “You totally killed it,” Riley says. I notice Remington doesn’t answer their compliments. His gaze now feels like a scorching brand on my profile and his energy is becoming as tumultuous as mine. He must have wanted a different reaction to his gesture. He must have wanted me to be all gushy and tell him, “Oh my stars, you’re so amazing!” But I won’t. Because I hate what he does to me. I hate that I want him like this, I hate that I feel so volatile, I want to tear his eyes out and then go cry about it. I want to fling all these roses in his lap and tell him to fuck them now because I don’t even want him to fuck me anymore! So when the roses are set with water in one of the ice buckets in my room and my anger has festered into gargantuan proportions, I storm down the hall and find Pete in the living room outside the master bedroom. “Remington?” I demand. “Showering.” He points to his door, and I charge forward, slam the door shut, lock it behind me, and spot him across the room, standing in the threshold of the bathroom. He’s fully naked, dripping wet, fresh out of the shower with a towel in his hand, and instantly he jumps erect. His stunned gaze fixes on me, and the towel falls at his feet. I’ve never had this view of him in the nude, and to see his physical perfection and the most beautiful cock I’ve ever seen, perfectly working, only enrages me further. The blood rushes like burning lava in my veins as I charge forward and slam my fists repeatedly into his chest, as hard as I can without breaking my own bones. “Why haven’t you touched me? Why don’t you fucking take me? Am I too fat? Too plain? Do you just delight in fucking torturing me senseless or are you just plain damn mean? For your information, I’ve wanted to have sex with you since the day I went into your stupid hotel room and got hired instead!” He grabs my wrists and angrily yanks me forward, pinning my arms down. “Why’d you want to have sex with me? To have a fucking adventure? What was I supposed to be? Your one-night-fucking stand? I’m every woman’s adventure, damn you, and I don’t want to be yours. I want to be your fucking REAL. You get that? If I fuck you, I want you to belong to me. To be mine. I want you to give yourself to me—not Riptide!” “I won’t ever be yours if you don’t take me. Take me! You son of a bitch, can’t you see how much I want you?” “You don’t know me,” he strains out through gritted teeth, his face anxious as he clenches my wrists at my sides. “You don’t know the first thing about me.” “Then tell me! You think I’ll leave if you tell me whatever it is you don’t want me to know?” “I don’t think it, I know it.” He grabs my face in one open hand and squeezes both my cheeks, his eyes violently blue and almost frantic. “You’ll leave me the second it gets too steep, and you’ll leave me with nothing—when I want you like I’ve never wanted anything in my life. You’re all I think about, dream about. I get high and low and it’s all about you now, it’s not even about me anymore. I can’t sleep, can’t think, can’t concentrate worth shit anymore and it’s all because I want to be the fucking ‘one’ for you and as soon as you realize what I am, all I’ll be is a fucking mistake!” “How can you be a mistake? Have you seen you? Have you seen what you do to me? You had me at hello, you fucking asshole! You make me want you until it hurts and then you won’t do shit!” “Because I’m fucking bipolar! Manic. Violent. Depressive. I’m a fucking ticking time bomb, and if one of my staff messes up when I get another episode, the next person I hurt can be you. I was trying to break this to you as slowly as possible so I could at least stand a chance with you. This shit has taken everything from me. Everything. My career. My family. My fucking friends. If it takes this chance with you, I don’t fucking even know what I’m going to do, but the depression will hit me so deep, I’ll probably end up killing myself!” My eyes sting as the words float like awful whiplashes in my head. Every shocking word stuns me to my bones. He curses and releases me, and I take a step back and watch him angrily step into a pair of drawstring pants. Helplessly, I watch him grab a t-shirt from the closet, and my heart has completely stopped beating in my chest. The word “bipolar” is not really a word I’m familiar with, except by listening to it from afar. I’ve never met anyone who’s had it, but suddenly I go back through these weeks, and I get a little hint of it. I do. I get it. Remy both loves and hates himself. He loves and hates his life. One second it’s all good, the next it’s all bad. He’s hot, then he’s cold. Maybe he’s never been accepted, not even by himself, and maybe everyone drops him cold the second it gets … steep. A thousand emotions roil in my chest, and I can barely contain them all in my body. His chest heaves as he watches me across the room now, his eyes brilliantly blue as he clenches his hands at his sides and waits for me to speak, the t-shirt still in his grip, dangling at his side. Suddenly all I know is that this man has god-like proportions in my mind, but now I realize he’s also human and imperfect, and with every aching, quaking inch of my body, I want him all the more. So much I want to drown if he denies me tonight. Dragging in a fortifying breath, my hands tremble as I slowly open the buttons of my top, sifting them one by one through my fingers. The rustle makes his eyes drop to my chest and his eyes flash in pain. His stare devours me so fiercely, I feel the bite of his eyes in my heart. “I’m take as-is. I’m not medicating. It makes me feel dead and I intend to live my life alive,” he warns in a rough, angry whisper. I nod in understanding. I refused to take anti-depressants when I supposedly, clinically, needed them after my fall. I believe it is your choice how you live with your sickness, and sometimes the remedy is worse than the disease. He’s a man who eats so right, and any chemical can unbalance him. I see that. I’m no one to tell him what to do. But does he even realize how important he is? Where he’s gotten to, all on his own? Does he see what a great team he’s built? I can see how Coach, Diane, Pete and Riley love him even when they quarrel. I wanted to belong to this team, but now I just want to belong to this man. And I want him to belong to me. “Take your clothes off, Remy.” Flicking my last button, I part my shirt through the middle, and the t-shirt he’s still holding in his balled grip falls to the floor as his fingers spasmodically open. His eyes rake me, his voice an angry pained rasp. “You have no idea what you’re asking for.” “I’m asking for you.” “I won’t let you fucking leave me.” My throat closes up with emotion, making the words hard to pronounce. “Maybe I won’t want to.” Pained desperation flashes in his eyes. “Give me a goddamned guarantee. I won’t let you fucking leave me, and you’re going to want to try. I’m going to be difficult and I’m going to be an ass, and sooner or later, you’re going to have fucking enough of me.” Shaking my head, I toss my blouse to the floor, then push my skirt down my hips and step out of it. Trembling down to my soul, I stand in only my plain cotton bra and panties, my breasts rising and falling. “I’ll never have enough of you, never.” At first, my words seem to have no effect on him. And I think I’m slowly dying. Then a low, hungry sound rips up his throat. My breath stalls in my throat. He stands watching me, motionless in those drawstring pants, his legs braced in a fighting stance, his eyes bursting with need. His broad shoulders jerk with his breaths, and he curls his fingers into fists at his sides. The deep roughness of his voice scrapes my flesh. “Come here then.” The command comes so unexpectedly, my legs begin to quake. All my systems rush to work together, but at the same time, I can’t move. I feel like a bunch of organs struggling to come into one. Rapid heart. Sweating skin. Tremors in my nerve endings. Complete uselessness of my lungs. All of my body wants the same thing but it seems too wound up to unite. When I at last come together with a ragged breath, I feel so alive and yet so unraveled, even my toes tingle when we—me and my heart and my bones and my skin—finally manage to take the first step. A fierce nervousness eats me raw, all the way to my destination. Remington’s breathing escalates. His powerful chest rises even faster as I approach. Step by nerve-wracking step, my pulse throbs in my temples as the heat of his stare creeps into me. Between my legs, I burn for him. My nipples throb. The hard tips push painfully against the cotton of my bra. Every pore in my body wants to beg him to suck them. To touch me. To love me. Stopping a foot away, I can barely breathe as the smell of his soap envelops my lungs, drugging all my senses. His arms come out, and he tangles ten angry fingers in my hair as he yanks my head back in his fists and buries his nose in my neck, growling softly. His deep inhale reaches me, and a shudder runs through my body as I do the same, absorbing every color and flavor of his strong male scent into my body through my nostrils. His tongue flashes out to lick a wet path up my neck as an arm coils around my waist, and he crushes me to his body, whispering, “Mine.” Lust and love burst through me. “Yes, yes, yes, Remington, yes.” Tangling my fingers up in his hair, I eagerly push my breasts to his chest and anxiously rub my pained nipples against his diaphragm, my arms violently locking his head to me as he continues scenting me with deep, somehow desperate inhales. My body jolts with pleasure. He grabs my face within his callused hands and drags his tongue from my neck, along my jaw, breathing roughly as he heads for my mouth. He licks the seam of my lips. Dampening me. Priming me. His tongue probes at the seam, then he adds his lips and uses them to open me. He nibbles my lower lip to tease it apart from the top. A soft whimper feathers out of me and he muffles the sound when he dives in to taste me, wet and hot and hungry. My response is fast and wild, and our tongues collide in a heated frenzy of wetness and moans.","sourceLink":"https://allnovel.net/real-real-1/page-25.html","bookId":2736,"book":{"id":2736,"title":"Real (Real #1)","description":"Storyline: Real (Real #1) A fallen boxer. A woman with a broken dream. A competition… He even makes me forget my name. One night was all it took, and I forgot everything and anything except the sexy fighter in the ring who sets my mind ablaze and my body on fire with wanting… Remington Tate is the strongest, most confusing man I’ve ever met in my life. He’s the star of the dangerous underground fighting circuit, and I’m drawn to him as I’ve never been drawn to anything in my life. I forget who I am, what I want, with just one look from him. When he’s near, I need to remind myself that I am strong–but he is stronger. And now it’s my job to keep his body working like a perfect machine, his taut muscles primed and ready to break the bones of his next opponents . . . But the one he’s most threatening to, now, is me. I want him. I want him without fear. Without reservations. If only I knew for sure what it is that he wants from me?","cover":"https://allnovel.net/images/real-real-1.jpg","author":"Katy Evans","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/real-real-1.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:33:58 PM"}}
