{"id":81211,"no":4,"title":"Page 4","content":"During the night, he goes through several fighters in just this way. Every time he’s declared victor, he stares at me with that smug smile, as though he wants me to know he’s the dominating man here. My entire body shakes as I watch his body move, and I’m unable to stop fantasizing. I imagine his hips rolling over me, his body inside mine, those big hands touching me, flesh to flesh. During the last few rounds, he wears an intent look on his face, and his chest heaves with exertion and glistens with sweat. Suddenly, I’ve never wanted anything so much in my life. I want to go crazy. Bungee. Sprint again, even if only in a literal sense. All those dates I never had, because I was training for something that never happened. Rides I didn’t take for fear of breaking a bone which eventually broke anyway. Never drinking. Keeping my grades up so I could do track. Remington Tate is everything I’ve never, ever done, and I have a condom tucked in my bag and suddenly I know exactly why I put it there. This guy is a fighter. I want to touch this beautiful chest and I want to kiss those lips. I want to have those hands on me. When I feel those hands on me, I’m probably going to come the second he thrusts inside me. This is the most intense foreplay I’ve ever felt, and suddenly I want it to be more than play. I want it to happen tonight. When he wins for the tenth and final time, I feel his eyes on me again, and I can only stare back at him, willing him to know I want him. He smiles at me, all sweaty and cocky with blue eyes glinting and dimples showing. Grabbing the cord at the top of the ring, he easily swings his body over it and lands gracefully in the aisle before me. Melanie freezes at my side as his beautifully sculpted and gleaming tan body approaches. There is no doubt about his destination. Holding my breath until I feel like my lungs are going to burst, I stand on wobbly legs because I really don’t know what else to do. The crowd roars and women behind me shout. “Kiss his heart out, woman!” “You don’t deserve him, you bitch!” “You go, girl!” He flashes his dimples at me, and I keep waiting for his hands as he leans over. I can almost feel the way those hands felt on me last time, big, strange, and a little bit wonderful as they practically engulfed my face. I’m already dying. Dying with want. With recklessness. With anticipation. Instead, he bends his dark head to whisper against my temple, and the only thing of his body touching mine is his breath, bathing my skin with heat as his gruff voice rumbles in my ear, “Sit tight. I’ll send someone over for you.” He smiles and backs off as the crowd keeps screaming, and he climbs up into the ring, leaving me blinking after him. It takes the woman next to me about a full minute of shaking and hyperventilating to get out, “Omigod, omigod, omigodgodgodgod, his elbow brushed me, his elbow brushed me!” “RIPTIDE, PEOPLE!” the announcer screams. My knees go soft, and I drop to my seat, weightless as whipped cream, clasping my hands together to keep them from shaking. My brain is so melted I can’t even think past the point where he swung down from the ring and whispered close to my ear, in his terribly sexy voice, that he was sending someone for me. Just remembering it makes my toes curl. Melanie is speechlessly gaping, and Pandora and Kyle stare at me like I’m some holy being who just brought a wild animal to his knees. “What the hell did he say?” Kyle mouths. “Jesus, Mary, and Joseph,” Melanie says, squealing and hugging me. “Brooke, that guy is hot for you.” The woman beside me touches my shoulder with a trembling hand. “Do you know him?” I shake my head, not even knowing how to answer. All I know is that from yesterday to now, there hasn’t been a second when I haven’t thought about him. All I know is that I hate and love the way he makes me feel, and the way he looks at me fills me with wanting. “Miss Dumas,” a voice says, and I snap my head up to the two men in black standing between me and the ring. Both are tall and slim; one is blond and the other has curly brown hair. “I’m Pete, Mr. Tate’s PA,” Brown Curls says. “And that’s Riley. He’s the coach’s second. If you’ll follow us, please, Mr. Tate wants a word with you in his hotel room.” At first, I can’t even register who Mr. Tate is. Then understanding dawns, and a red-hot bolt of lightning streaks through me. He wants you in his hotel room. Do you want him? Do you want to do this? A part of me is already doing him ten ways until Sunday in my mind while another part of me won’t move from this stupid chair. “Your friends can come with us,” the blond man adds in an easy voice, and he signals to the stunned trio. I’m relieved. I think. Sheesh, I don’t even know what I feel. “Brooke, come on, it’s Remington Tate!” Melanie hauls me up by force and urges me to follow the men, and my mind starts racing at full speed, because I don’t know what I’m going to do when I see him. My heart is pumping adrenaline like crazy as we’re led out of the Underground, to the hotel across the street, then up the elevator to the “P.” A spike of nervousness ripples through me as the elevator pings at the top floor, and I feel exactly the way I used to when I competed. It’s been a rollercoaster ride just imagining this man’s body inside mine, and I’m suddenly close to the peak where it could be a reality. My stomach clenches from the thought of how exhilarating the downhill could be. One-night stand, here I come… “Please tell me you’re not going to do this guy,” Kyle tells me, his face scrunched in worry as the doors roll open. “This is not you, Brooke. You’re far more responsible than this.” Am I? Am I really? Because tonight I feel crazy. Crazy with lust and adrenaline and two sexy dimples. “I’m just going to talk to him,” I tell my friend, but even I’m not sure of what I’m doing. We follow the two men into the first part of the enormous suite. “Your friends can wait here,” Riley says, motioning to the gigantic black granite bar. “Please help yourselves to a drink.” As my friends flock to the shiny new bottles of alcohol, an unmistakable squeal escapes Melanie, and Pete motions me to follow him. We cross the suite and go into the master bedroom, and I spot him sitting at the bench at the foot of the bed. His hair is wet, and he holds a gel pack to his jaw. The visual of such a primal male nursing a wound after he repeatedly broke man after man with his fists is somehow fabulously sexy to me. Two Asian women kneel on the bed behind him, each of them rubbing a shoulder. A white towel is draped around his hips, and rivulets of water still cling to his skin. Three empty bottles of Gatorade have been tossed on the floor, and he has another in his hand. He slaps the gel pack on the table and downs the last of the Gatorade. Blue as his eyes, the liquid drains in one swig, then he tosses it aside. I’m mesmerized as his ripped muscles clench and relax under the women’s fingers. I know massage is normal after intense exercise, but what I don’t know, and can’t understand, is the way watching him get one affects me. I know the human form. I revere it. It was my church for six years, when I decided a new career for me was in order, when I realized I wouldn’t be sprinting again. And now, my fingers itch at my sides with wanting to probe his body, push and release, get deep into every muscle. “Did you enjoy the fight?” He watches me with a little cocky smile, his eyes glimmering, like he knows I loved it. It’s a love and hate thing for me, to watch him box. But I just can’t compliment him after hearing five hundred people scream how good he is, so I just shrug. “You make it interesting.” “Is that all?” “Yes.” He seems irritated as he abruptly jerks his shoulders to halt the massage therapists. He stands and rolls those square shoulders, then cracks his neck to one side, then the other. “Leave me.” The two women offer me a smile and head out, and the instant I’m alone with him, my breath goes. The enormity of being here, in his hotel room, isn’t lost on me, and suddenly I’m anxious. His tanned, long-fingered hands rest idle by his sides, and a rush of wanting runs through me as I imagine them running over my skin. My body pulses, and with an effort I tear my eyes up to his face and notice he’s staring at me in silence. He cracks his knuckles with one hand over them, then does the same with the other. He looks agitated, as though he hasn’t expended enough energy pounding half a dozen men to the ground. Like he could easily go a couple more rounds. “The man you’re with,” he says, flexing his fingers open at his sides as though to get some blood flow, his eyes watching me. “Is he your boyfriend?” Honestly I don’t know what I expected coming here, but it may have gone something along the lines of being led straight to his bed. I’m so confused and more than a little anxious. What does he want from me? What do I want from him? “No, he’s just a friend,” I reply. His eyes flick to my ring finger and back up. “No husband?” A strange little buzz courses in my veins, straight to my head, and I think I’m lightheaded from the scent of the massage oil they rubbed on him. “No husband, not at all.” He studies me for a long moment, but he doesn’t look overcome with lust like I’m personally, shamefully, feeling. He’s merely assessing me with a half-smile in place, and he appears genuinely intent in what I’m saying. “You interned at a private school rehabbing their young athletes?” “You looked me up?” “Actually, we did,” the two familiar voices of the men who brought me over say, and as they reenter the room, Pete carries a manila folder and passes it to Riley. “Miss Dumas.” Once again, Pete, with the curly hair and soft brown eyes, speaks to me. “I’m sure you’re wondering why you’re here, so we’ll just cut to it. We’re leaving town in two days, and I’m afraid there’s no time to do things differently. Mr. Tate wants to hire you.” I stare for a moment, dumbfounded, and frankly, confused as hell. “What is it, exactly, that you think I do?” A frown settles on my face. “I’m not an escort.” Both Pete and Riley burst out laughing, but Remington is alarmingly silent, slowly settling back down on the bench seat. “You’re onto us, Miss Dumas. Yes, I admit when we’re traveling, we find it convenient to keep one or several special friends of Mr. Tate’s to, shall we say, accommodate his needs either before or after a fight,” Pete laughingly explains. My left eyebrow shoots up. Really, I’m perfectly aware of how these things work with athletes. I used to compete and know that, either after sports or before them, sex is a natural and even healthy way of relieving stress and aiding performance. I lost my virginity at the same Olympic tryouts where my knee was shot to hell, and I lost it to a male sprinter who was almost as nervous about competing as I was. But the way these guys speak about Mr. Tate’s “needs,” so casually, feels suddenly so personal, my cheeks burn from the embarrassment.","sourceLink":"https://allnovel.net/real-real-1/page-4.html","bookId":2736,"book":{"id":2736,"title":"Real (Real #1)","description":"Storyline: Real (Real #1) A fallen boxer. A woman with a broken dream. A competition… He even makes me forget my name. One night was all it took, and I forgot everything and anything except the sexy fighter in the ring who sets my mind ablaze and my body on fire with wanting… Remington Tate is the strongest, most confusing man I’ve ever met in my life. He’s the star of the dangerous underground fighting circuit, and I’m drawn to him as I’ve never been drawn to anything in my life. I forget who I am, what I want, with just one look from him. When he’s near, I need to remind myself that I am strong–but he is stronger. And now it’s my job to keep his body working like a perfect machine, his taut muscles primed and ready to break the bones of his next opponents . . . But the one he’s most threatening to, now, is me. I want him. I want him without fear. Without reservations. If only I knew for sure what it is that he wants from me?","cover":"https://allnovel.net/images/real-real-1.jpg","author":"Katy Evans","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/real-real-1.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:33:58 PM"}}
