{"id":81250,"no":43,"title":"Page 43","content":"I’m left with Riley, whose gaze shifts from Melanie to me like a Ping-Pong ball, and I’m also left with Remy. My Remy. The Remy I abandoned in the hospital. The one I adore. The one I am mad over. The one that got his guts torn apart and humiliated for the sake of my sister. For me.\\n\\n A ball of pain gathers at my throat and I can barely stand it.\\n\\n He’s so handsome, so familiar, I feel like a prisoner in my own body, screaming to touch what I had, for weeks, viewed as mine.\\n\\n His big hands are still deeply buried in his jeans, and I wonder if he may be struggling with the same issues too? But there’s a somberness in his expression that is rarely there when his eyes are blue. And they are so blue, I’m drowning in them.\\n\\n I wrap my arms around me and drop my head as the shame continues building inside me. “Why didn’t you tell me? That you threw the fight for … her?”\\n\\n I can’t even say “me”—I feel awful.\\n\\n But Remington says softly, “You mean you.”\\n\\n Riley interrupts, “I didn’t know either, Brooke. Or Coach. Only Pete knew. He’s the one who found him that night, and he helped secure your sister while Remington delivered the win.”\\n\\n My eyes shift to the face of my dreams, and my voice drops as the pain of what he did for me seeps through my pores.\\n\\n “How are you? Are you all right?” I look at him, and his eyes are blue and on fire with emotion as he nods. He’s angry at me. I think. I don’t know. I feel punched in the gut when I look at him, but at the same time, it’s all I want to do.\\n\\n “What does this loss mean for you now?” I ask him. Oh, god, I missed my Remington so much that when I look at him, all perfect blue eyes, beautiful face, I feel water in my eyes.\\n\\n I think he’s having trouble talking too, because there’s a silence.\\n\\n A violent and unexpected despair surges wildly through me as I stare at this surprising, unpredictable man, the ever-changing mystery of Remington Tate, and suddenly, nothing in the world has hurt me more than having had him and lost him.\\n\\n “The loss? Other than we’re poor?” Riley finally answers when it seems neither Remington nor I are going to speak. He chuckles a bit too loudly and rakes his hair back. “He has a couple million to get him through the year. We’re making a comeback when the new season starts. Remy’s fans demand retribution.”\\n\\n “You do have loyal fans, don’t you?” I quietly ask, directing my question to Remington as I remember all the flowers he made them bring me, and I feel queasy and excited again.\\n\\n This second it feels like my entire life I’ve been waiting to talk to him again. My running partner and friend, my lover. My love.\\n\\n “Well, time to go.” Riley slaps Remington’s back, and my insides feel pain. “Actually, Brooke, we’re also here because we’re looking for a sports rehab specialist for the upcoming new season. Good to get a head start on training,” Riley says, producing something from his back pocket. “In case you’re interested, Mr. Tate’s number, if you consider, is on the back. There’s the hotel where we’re staying too. We leave in three days.”\\n\\n I watch Riley climb into the car, and then Pete strides out of my apartment and says goodbye.\\n\\n I look at Remington, and he looks directly back at me, and through all the emotions I see in his eyes, I can’t decide which one reels me in the most. My skin breaks in goose bumps in a silent plea of his touch—tingling in remembrance of his calluses, the way he drags his tongue over me. My dark-haired lion. Licking and claiming me.\\n\\n My heart hurts me as we both stare, but neither of us is talking, even when there are a thousand things weighing on us both.\\n\\n “You’re looking good, Remy,” Melanie says with a sunny smile.\\n\\n He graces her with a sight of those dimples that kill me, and then his eyes flick back to me and the dimples are gone. “You know where to find me.” He climbs in the car and leaves, leaving a trail of goose bumps in his wake, all along my skin.\\n\\n Melanie goes inside first, but I stay outside under the sun, just … processing.\\n\\n Then, I stride into my place and my heart swells at the sound of Nora’s excited voice, reminding me she’s here. Suddenly my apartment sounds like a college dorm with laughing friends, and all because of Remy.\\n\\n “I really think he likes me!”\\n\\n “Nora!” I come into the eclectic living room—courtesy of Melanie’s free decoration skills—and squeeze my sister in a big bear hug again, where I get to be the bear. “Let me look at you. You okay?”\\n\\n I inspect her head to toe, and admit she looks good. Rosy cheeks, brilliant grin. She’s cut that golden mane into a cute bob to her elfin ears, and there’s color in her sweet, curled lips. She looks slender and wholesome, and the animation in her eyes enchants me. This is the Nora I remember. My baby sister.\\n\\n She squeezes my hands and nods emphatically, lacing her cool fingers happily through mine.\\n\\n “Nora was telling me how Remington fought Scorpion for her.” Melanie widens her eyes at me and nods meaningfully. “She thinks Remington is way hot because of the way he fought Scorpion for her.”\\n\\n A sneaky hint of jealousy curls around my tummy. “Oh. Of course.”\\n\\n Nora has seen him for the past four weeks, maybe, and the thought of any woman enjoying his smiles and his voice, while I’ve been denying myself of it, makes me a little sick.\\n\\n “Brooke, you should have seen him,” Nora bursts out, oblivious to my inner torture chamber called a “heart.”\\n\\n “He just barged into our rental rooms and knocked out two of the men, and then he went straight to pound Benny’s face, nonstop. He rammed a pencil into his tattoo so deep he completely deformed it.”\\n\\n “Wait! Who the hell is Benny?” Melanie asks.\\n\\n “Scorpion!” Nora explains, her smile eager with delight. Seriously, I’m still staring at her in awe because she looks like another person compared to the drugged, fiery-haired girl with a scorpion tattoo at the Japanese restaurant. The wonders a month of rehab can do. And my dark-haired fighter…\\n\\n “Oh! Benny is Scorpion, got it!” Mel says, rolling her eyes.\\n\\n “Remington was like a devil unleashed from hell, nonstop hitting. Benny couldn’t stop him as he kept shouting about staying away from his girl, that he wasn’t leaving without what his girl wanted, and tons of bad words, and then Benny scrambled to stop him and offered me. He said if he stopped that he would set me free in exchange for the championship as well. Then, Remy looked at me and asked me if I was your sister. And I nodded. And so he agreed. He didn’t even hesitate. He wanted me out of there that same night, but Benny said I was to be on lockdown until Remington delivered the championship, so Remy called Pete to get me. Pete took me to a rehab place in Connecticut and Remy paid for my entire stay, and then, he sent Pete back for me.”\\n\\n I fall into a chair and just can’t hold myself upright, my eyes a mess. After all the tears I’ve cried, I feel like I could still cry another great lake. For Remington Tate. And for myself. And for underestimating someone who I believed would do something wrong, and instead, did the best and most incredible thing for me. Remy, when he goes black, has done a lot of bad things, or so they say. But boy, oh boy, did he make it right with Nora. For me. I know, despite Nora’s romantic side, it is for me he fought. For me he threw the fight. For me, and for who I love, that he promised to protect as his the night he tossed the entire hotel restaurant over.\\n\\n I remember how proud he was during the fight, taking every blow. How it must have hurt him not to fight back! That’s all Remy knows to do. He’s a fighter at heart. Even in his eyes I could see his fierceness. He can barely control himself when provoked, and to think of him holding back when he was being hurt this way, only for me. For my sister.\\n\\n Something clicks in my mind, and my heart swells until I think I’m going to pop with pain and emotion. I’m bombarded with thoughts of the first night I ever saw this man. All glinting blue eyes, golden tan, spiky black hair, playful face, and hard male body.\\n\\n “Your name,” he growls, panting, his eyes wild on mine.\\n\\n “Uh, Brooke.”\\n\\n “Brooke what?” he snaps out, his nostrils flaring.\\n\\n With trembling efforts, I pry my hand free and glance frightfully at Mel, who comes behind him, wide-eyed. “It’s Brooke Dumas,” she says and then happily shoots out my cell phone number to my chagrin. His lips curl, and he meets my gaze once more.\\n\\n “Brooke Dumas.” He just fucked my name right in front of me, and right in front of Mel. He steps forward, and his damp hand slides into the nape of my neck. “Brooke,” he growls softly, meaningfully, against my lips, as he draws back with a smile. “I’m Remington.”\\n\\n Oh, god, I knew my life would change. I just never knew how much.\\n\\n I. Love. This. Man.\\n\\n Yes, he is a man who will be difficult, and bipolar to boot.\\n\\n He’s strong, and he’s proud, and I don’t expect him to beg me.\\n\\n But even though he probably won’t beg me to come back, he’s at least not asking me to beg forgiveness for being a chicken shit and dumping him while tubed in a hospital, either.\\n\\n Feeling the first real sense of joy I’ve felt in weeks unfurl in my tummy, I glance down at the hotel address written on the card, and my insides move in anticipation.\\n\\n He wants to be my real, not my adventure. Even when he will be the realest thing in my life, I know it’s still going to be an adventure. Because that’s him. An exhilarating bungee jump … a free fall … Olympics all year round for me … that’s what being in love with him is going to be like for me. What wondering when he gets black … and all the pushing and pulling and reasoning with him … will be like.\\n\\n And suddenly, this is all I can think of.\\n\\n Suddenly, my bad knee is all that’s stopping me from running after him.\\n\\n I want the job he can offer.\\n\\n I want to be with my big, crazy, sexy beast of a man, and I won’t apologize to anyone for it. He’s bipolar, and I’m crazy about him.\\n\\n He never said he loved me. But he came back for me. He gave me my sister. He lost his wealth, his fight, and lay unconscious in a hospital bed. Because of me.\\n\\n “Nora, I’m going to call Mom and Dad so you can spend some time with them, would you like that?”\\n\\n “Yes, Brooke, I thought about what you said, and I do want to finish college.”\\n\\n Mel chimes in. “Oh, yay! Nora, college is the place for hot guys, girl! It’s something you definitely don’t want to miss,” she adds in total excitement, still all sweaty and red-faced from our run.\\n\\n Plopping down next to Nora, I tell her, “The thing is, I may not be around for a while. My new job will require I travel.”\\n\\n “New job?” Melanie perks, then her tawny sleek eyebrows lower over her eyes. “Dish out, Brookey!” she threatens.\\n\\n “Mel. I’m going to get the job I want with the man I need,” I confess.\\n\\n “You mean you’re getting back the man you need with the job you want,” she corrects.\\n\\n “Same difference!” I laugh, flinging the card at her. “I’m getting my job back.” \\n\\n","sourceLink":"https://allnovel.net/real-real-1/page-43.html","bookId":2736,"book":{"id":2736,"title":"Real (Real #1)","description":"Storyline: Real (Real #1) \\n A fallen boxer. \\n A woman with a broken dream. \\n A competition… \\n He even makes me forget my name. One night was all it took, and I forgot everything and anything except the sexy fighter in the ring who sets my mind ablaze and my body on fire with wanting… \\n Remington Tate is the strongest, most confusing man I’ve ever met in my life. \\n He’s the star of the dangerous underground fighting circuit, and I’m drawn to him as I’ve never been drawn to anything in my life. I forget who I am, what I want, with just one look from him. When he’s near, I need to remind myself that I am strong–but he is stronger. And now it’s my job to keep his body working like a perfect machine, his taut muscles primed and ready to break the bones of his next opponents . . . \\n But the one he’s most threatening to, now, is me. \\n I want him. I want him without fear. Without reservations. \\n If only I knew for sure what it is that he wants from me?\\n","cover":"https://allnovel.net/images/real-real-1.jpg","author":"Katy Evans","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/real-real-1.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:33:58 PM"}}
