{"id":95346,"no":31,"title":"Page 31","content":"Death straightened up slowly. IS THIS HOW HE REPAYS MY KINDNESS? TO STEAL MY DAUGHTER, INSULT MY SERVANTS, AND RISK THE FABRIC OF REALITY ON A PERSONAL WHIM? OH, FOOLISH, FOOLISH, I HAVE BEEN FOOLISH TOO LONG! \u0027Master, if you would just be so good as to let go of my robe —\u0027 began Albert, and the wizard noticed a pleading edge to his voice that hadn\u0027t been there before. Death ignored him. He snapped his fingers like a castanet and the apron around his waist exploded into brief flames. The kitten, however, he put down very carefully and gently pushed away with his foot. DID I NOT GIVE HIM THE GREATEST OPPORTUNITY? \u0027Exactly, master, and now if you could see your way clear —\u0027 SKILLS? A CAREER STRUCTURE? PROSPECTS? A JOB OR LIFE? \u0027Indeed, and if you would but let go —\u0027 The change in Albert\u0027s voice was complete. The trumpets of command had become the piccolos of supplication. He sounded terrified, in fact, but he Managed to catch Rincewind\u0027s eye and hiss: \u0027My staff! Throw me my staff! While he is in the circle he is not invincible! Let me have my staff and I can break free!\u0027 Rincewind said: \u0027Pardon?\u0027 OH, MINE IS THE FAULT FOR GIVING IN TO THESE WEAKNESSES OF WHAT FOR WANT OF A BETTER WORD I SHALL CALL THE FLESH! \u0027My staff, you idiot, my staff!\u0027 gibbered Albert. \u0027Sorry?\u0027 WELL DONE, MY SERVANT, FOR CALLING ME TO MY SENSES. said Death. LET us LOSE NO TIME. \u0027My sta-!\u0027 There was an implosion and an inrush of air. The candle flames stretched out like lines of fire for a moment, and then went out. Some time passed. Then the bursar\u0027s voice from somewhere near the floor said, \u0027That was very unkind, Rincewind, losing his staff like that. Remind me to discipline you severely one of these days. Anyone got a light?\u0027 \u0027I don\u0027t know what happened to it! I just leaned it against the pillar here and now it\u0027s —\u0027 \u0027Oook.\u0027 \u0027Oh,\u0027 said Rincewind. \u0027Extra banana ration, that ape,\u0027 said the bursar levelly. A match flared and someone managed to get a candle alight. Wizards started to pick themselves off the floor. \u0027Well, that was a lesson to all of us,\u0027 the bursar continued, brushing dust and candlewax off his robe. He looked up, expecting to see the statue of Alberto Malich back on its pedestal. \u0027Clearly even statues have feelings,\u0027 he said. \u0027I myself recall, when I was but a first-year student, writing my name on his well, never mind. The point is, I propose here and now we replace the statue.\u0027 Dead silence greeted this suggestion. \u0027With, say, an exact likeness cast in gold. Suitably embellished with jewels, as befits our great founder,\u0027 he went on brightly. \u0027And to make sure no students deface it in any way I suggest we then erect it in the deepest cellar,\u0027 he continued. \u0027And then lock the door,\u0027 he added. Several wizards began to cheer up. \u0027And throw away the key?\u0027 said Rincewind. \u0027And weld the door,\u0027 the bursar said. He had just remembered about The Mended Drum. He thought for a while and remembered about the physical fitness regime as well. \u0027And then brick up the doorway,\u0027 he said. There was a round of applause. \u0027And throw away the bricklayer!\u0027 chortled Rincewind, who felt he was getting the hang of this. The bursar scowled at him. \u0027No need to get carried away,\u0027 he said. In the silence a larger than usual sand dune humped up awkwardly and then fell away to reveal Binky, blowing the sand out of his nostrils and shaking his mane. Mort opened his eyes. There should be a word for that brief period just after waking when the mind is full of warm pink nothing. You lie there entirely empty of thought, except for a growing suspicion that heading towards you, like a sockful of damp sand in a nocturnal alleyway, are all the recollections you\u0027d really rather do without, and which amount to the fact that the only mitigating factor in your horrible future is the certainty that it will be quite short. Mort sat up and put his hands on top of his head to stop it unscrewing. The sand beside him heaved and Ysabell pushed herself into a sitting position. Her hair was full of sand and her face was grimy with pyramid dust. Some of her hair had frizzled at the tips. She stared listlessly at him. \u0027Did you hit me?\u0027 he said, gently testing his jaw. \u0027Yes.\u0027 \u0027Oh.\u0027 He looked at the sky, as though it could remind him about things. He had to be somewhere, soon, he recalled. Then he remembered something else. Thank you,\u0027 he said. \u0027Any time, I assure you.\u0027 Ysabell made it to her feet and tried to brush the dirt and cobwebs off her dress. \u0027Are we going to rescue this princess of yours?\u0027 she said diffidently. Mort\u0027s own personal, internal reality caught up with him. He shot to his feet with a strangled cry, watched blue fireworks explode in front of his eyes, and collapsed again. Ysabell caught him under the shoulders and hauled him back on his feet. \u0027Let\u0027s go down to the river,\u0027 she said. \u0027I think we could all do with a drink.\u0027 \u0027What happened to me?\u0027 She shrugged as best she could while supporting his weight. \u0027Someone used the Rite of AshkEnte. Father hates it, he says they always summon him at inconvenient moments. The part of you that was Death went and you stayed behind. I think. At least you\u0027ve got your own voice back.\u0027 \u0027What time is it?\u0027 \u0027What time did you say the priests close up the pyramid?\u0027 Mort squinted through streaming eyes back towards the tomb of the king. Sure enough, torchlit fingers were working on the door. Soon, according to the legend, the guardians would come to life and begin their endless patrol. He knew they would. He remembered the knowledge. He remembered his mind feeling as cold as ice and limitless as the night sky. He remembered being summoned into reluctant existence at the moment the first creature lived, in the certain knowledge that he would outlive life until the last being in the universe passed to its reward, when it would then be his job, figuratively speaking, to put the chairs on the tables and turn aU the lights off. He remembered the loneliness. \u0027Don\u0027t leave me,\u0027 he said urgently. \u0027I\u0027m here,\u0027 she said. \u0027For as long as you need me.\u0027 \u0027It\u0027s midnight,\u0027 he said dully, sinking down by the Tsort and lowering his aching head to the water. Beside him there was a noise like a bath emptying as Binky also took a drink. \u0027Does that mean we\u0027re too late?\u0027 \u0027Yes.\u0027 \u0027I\u0027m sorry. I wish there was something I could do.\u0027 There isn\u0027t.\u0027 \u0027At least you kept your promise to Albert.\u0027 \u0027Yes,\u0027 said Mort, bitterly. \u0027At least I did that.\u0027 Nearly all the way from one side of the Disc to the other. . . . There should be a word for the microscopic spark of hope that you dare not entertain in case the mere act of acknowledging it will cause it to vanish, like trying to look at a photon. You can only sidle up to it, looking past it, walking past it, waiting for it to get big enough to face the world. He raised his dripping head and looked towards the sunset horizon, trying to remember the big model of the Disc in Death\u0027s study without actually letting the universe know what he was entertaining. At times like this it can seem that eventuality is so finely balanced that merely thinking too loud can spoil everything. He orientated himself by the thin streamers of Hublight dancing against the stars, and made an inspired guess that Sto Lat was . . . over there. . . . \u0027Midnight,\u0027 he said aloud. \u0027Gone midnight now,\u0027 said Ysabell. Mort stood up, trying not to let the delight radiate out from him like a beacon, and grabbed Binky\u0027s harness. \u0027Come on,\u0027 he said. \u0027We haven\u0027t got much time.\u0027 \u0027What are you talking about?\u0027 Mort reached down to swing her up behind him. It was a nice idea, but merely meant that he nearly pulled himself out of the saddle. She pushed him back gently and climbed up by herself. Binky skittered sideways, sensing Mort\u0027s feverish excitement, and snorted and pawed at the sand. \u0027I said, what are you talking about?\u0027 Mort turned the horse to face the distant glow of the sunset. \u0027The speed of night,\u0027 he said. Gutwell poked his head over the palace battlements and groaned. The interface was only a street away, clearly visible in the octarine, and he didn\u0027t have to imagine the sizzling. He could hear it – a nasty, saw-toothed buzz as random particles of possibility hit the interface and gave up their energy as noise. As it ground its way up the street the pearly wall swallowed the bunting, the torches and the waiting crowds, leaving only dark streets. Somewhere out there, Cutwell thought, I\u0027m fast asleep in my bed and none of this has happened. Lucky me. He ducked down, skidded down the ladder to the cobbles and legged it back to the main hall with the skirts of his robe flapping around his ankles. He slipped in through the small postern in the great door and ordered the guards to lock it, then grabbed his skirts again and pounded along a side passage so that the guests wouldn\u0027t notice him. The hall was lit with thousands of candles and crowded with Sto Plain dignitaries, nearly all of them slightly unsure why they were there. And, of course, there was the elephant. It was the elephant that had convinced Cutwell that he had gone off the rails of sanity, but it seemed like a good idea a few hours ago, when his exasperation at the High Priest\u0027s poor eyesight had run into the recollection that a lumber mill on the edge of town possessed said beast for the purposes of heavy haulage. It was elderly, arthritic and had an uncertain temper, but it had one important advantage as a sacrificial victim. The High Priest should be able to see it. Half a dozen guards were gingerly trying to restrain the creature, in whose slow brain the realisation had dawned that it should be in its familiar stable, with plenty of hay and water and time to dream of the hot days on the great khaki plains of Klatch. It was getting restless. It will shortly become apparent that another reason for its growing friskiness is the fact that, in the pre-ceremony confusion, its trunk found the ceremonial chalice containing a gallon of strong wine and drained the lot. Strange hot ideas are beginning to bubble in front of its crusted eyes, of uprooted baobabs, mating fights with other bulls, glorious stampedes through native villages and other half-remembered pleasures. Soon it will start to see pink people. Fortunately this was unknown to Cutwell, who caught the eye of the High Priest\u0027s assistant – a forward-looking young man who had the foresight to provide himself with a long rubber apron and waders – and signalled that the ceremony should begin. He darted back into the priest\u0027s robing room and struggled into the special ceremonial robe the palace seamstress had made up for him, digging deep into her workbasket for scraps of lace, equins and gold thread to produce a garment of uch dazzling tastelessness that even the ArchChancellor of Unseen University wouldn\u0027t have been ashamed to wear it. Cutwell allowed himself five seconds to admire himself in the mirror before ramming the pointy hat on his head and running back to the door, stopping just in time to emerge at a sedate pace as befitted a person of substance. He reached the High Priest as Keli started her advance up the central aisle, flanked by maidservants who fussed around her like tugs around a liner. Despite the drawbacks of the hereditary dress, Cutwell thought she looked beautiful. There was something about her that made him — He gritted his teeth and tried to concentrate on the security arrangements. He had put guards at various vantage points in the hall in case the Duke of Sto Helit tried any last-minute rearrangement of the royal succession, and reminded himself to keep a special eye on the duke himself, who was sitting in the front row of seats with a strange quiet smile on his face. The duke caught Cutwell\u0027s eye, and the wizard hastily looked away.","sourceLink":"https://allnovel.net/mort-discworld-4/page-31.html","bookId":1623,"book":{"id":1623,"title":"Mort (Discworld #4)","description":"Storyline: Mort (Discworld #4) Terry Pratchett\u0027s profoundly irreverent novels are consistent number one bestseller in England, where they have catapulted him into the highest echelons of parody next to Mark Twain, Kurt Vonnegut, Douglas Adams, and Carl Hiaasen. In this Discworld installment, Death comes to Mort with an offer he can\u0027t refuse -- especially since being, well, dead isn\u0027t compulsory.As Death\u0027s apprentice, he\u0027ll have free board and lodging, use of the company horse, and he won\u0027t need time off for family funerals. The position is everything Mort thought he\u0027d ever wanted, until he discovers that this perfect job can be a killer on his love life.","cover":"https://allnovel.net/images/mort-discworld-4.jpg","author":"Terry Pratchett","type":"Humorous","source":"allnovel","link":"https://allnovel.net/mort-discworld-4.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:13:16 PM"}}
