{"id":11833,"no":11,"title":"LECTURE IX.","content":"WHIST AS AN INVESTMENT. \\n\\n —— \\n\\n “None alive can truly tell \\n\\n What fortune they must see.”—Sedley. \\n\\n \\n\\n In “the Art of practical Whist” you will see capital invested in Whist compared to consols; don’t run away with the idea that there is any such resemblance; those numerous foreign securities or limited companies nearer home where you receive no interest and lose your principal—or those public conveyances suggested by the elder Mr. Weller—would be much closer analogues. \\n\\n \\n\\n Whist is not a certainty; neither is it true that you will every year find your account exactly square on the thirty-first of December—it is a popular fallacy devised by those who win, to keep the losers in good spirits. \\n\\n “Maxima vis est phantasi?.” \\n\\n \\n\\n An old friend of mine—veracious as men go, and always considered of fairly sound mind and free from delusions, though a very inferior whist-player—has often assured me that he won over three thousand points for three years running (close on[75] ten thousand in the aggregate); if this statement is correct, and I have no reason to doubt it—I often played with him, and he almost invariably won—it is manifest that, after paying for the cards, some of us when we called at the bank for our dividends, must have had to go empty away. \\n\\n \\n\\n I have played whist—club, domestic, or bumblepuppy—pretty regularly for a quarter of a century, and the only conclusion I have arrived at so far, is the very vague one that I shall either win or lose—I don’t know at all which—for five years in succession, or multiples of five. \\n\\n \\n\\n For the first ten years I won considerably, for the next five I lost considerably, then for another five I won slightly, and the last five (I am thankful to say I am now getting well into the fifth) I have lost again.[44] \\n\\n \\n\\n I have no doubt things equalise themselves in the long run, the difficulty is that I am unable to give you any idea, even approximately, what the duration of a long run is.[45] \\n\\n \\n\\n [76] \\n\\n \\n\\n During a part of that first period, extending over a year and a quarter, I played long whist—five points to the bumper—more than fifty times, and never but once won less than twelve points. If we may believe Herodotus, in his day the end was not always visible from the beginning, and so it is now. I have won rubbers against all the cards, and with all the cards I have lost them. \\n\\n \\n\\n Sometimes I cannot lose a rubber, sometimes I cannot win one; at one time cards will beat their makers, at another the makers will beat the cards, and these results occur without rhyme or reason, in defiance of any system of play. Don’t imagine for a moment that I suggest play is of no consequence, I merely say that you will frequently see the cards or the players run wild, and that the actual result—winning or losing—is beyond your own control. \\n\\n “In the reproof of chance lies the true proof of man.”—Shakespeare. \\n\\n \\n\\n I have known twenty-four successive rubbers lost, and I have won seventeen more than once. I have[77] lost nine hundred and thirty points in two months, and a hundred and fifty-four in two days. I have lost a bumper in two deals, holding one trump each hand and with the same partner, the same seats, and the same cards won the next rubber but one in two deals, again holding one trump in each hand. \\n\\n \\n\\n I have seen a player with no trump and no winning card lose a treble, and the very next hand, again with no trump and no winning card—assisted to some extent by his partner—score nine, and on one melancholy occasion my partner and myself were unable to raise a trump between us; as a set-off to this, I ought to admit that we once held them all. \\n\\n \\n\\n Though I have never seen it myself, that the dealer should give each member of the parti an entire suit is becoming as common an object of the sea-shore as our old friend the sea-serpent. Fortunately, overpowering cards do not always win. A hand of thirteen trumps has been known to make only one trick; it occurred in this wise. \\n\\n \\n\\n A, B, Y, and Z were playing in a train, and A dealt himself the whole suit of hearts: Y led the king of spades; B played the ace; Z followed suit, and A ruffed. \\n\\n \\n\\n B, “an arbitrary gent,” ejaculated “Trump my ace!” at once took up the trick and, with his own twelve cards, threw the lot out of the window. \\n\\n \\n\\n “The rest is silence.” \\n\\n \\n\\n I have held three Yarboroughs in two hours (a Yarborough is a hand containing no card above a[78] nine), and a hand with no card above a seven at least twice. There was a hand recently at Surbiton with no card above a six. With ace, knave, to five trumps, two kings, and trumps led up to me, I have lost by five cards, and with queen, knave, 10, 8, 3, 2, diamonds (trumps), spade king, ace and king of hearts, ace, king, queen and another club, and the original lead, I lost the odd trick; and, most incredible of all, I know a very good player who, on three consecutive Saturdays, lost an aggregate of over three hundred points. \\n\\n \\n\\n I have played a set match, and, although I never bet, as I fancied we had a shade the best of the play, and the other side made the liberal offer of six to four, it tempted me, I took it and won five rubbers running. I once cut about the best player I know six times consecutively. My partner laid six to five to commence with, and as we won the first game—a single—he gave five to two, and that was the only game we won in those six rubbers. \\n\\n \\n\\n One of the two finest players I ever met lost twenty-eight consecutive rubbers; feeling aggrieved at this ill-treatment he swore off for a fortnight, and then lost twelve more. \\n\\n \\n\\n Busses—not Funds—is much nearer the mark. Irrespective of the time of day, you can either go to bed when you have won two rubbers, or when you have lost them; you can persevere to the bitter end either when you are winning or when you are losing; you[79] can take any of the measures mentioned in the last lecture, or adopt any other system you please; but there is one rule with no exception: though no earthly power can prevent your winning or losing, the actual amount of that gain or loss always depends upon yourself and your partner; if you should ever lose eighty or a hundred points at one sitting, that deplorable result will never take place without your active connivance; a trick lost here and a trick lost there, an exposed card or something of that kind—the consequence is always intensified when you are losing—will just make the difference every now and then between winning and losing a rubber. \\n\\n \\n\\n During the bad forty-eight hours I had when I lost a hundred and fifty-four points, I was attending carefully to the play, the cards were abominable, and, making no allowances for what might have happened if my partner and I had only been omniscient, simple little mistakes of the kind just mentioned accounted for thirty-two of those points. \\n\\n \\n\\n If there is such a thing as luck—and I believe there is—don’t lie down and let it kick you. \\n\\n \\n\\n Always play with reasonable care and attention:—if a thing is worth doing at all, it is worth doing well—and when you hold cards which you do not consider quite equal to your deserts, instead of playing worse on that account—as most people do—take a little extra care. \\n\\n \\n\\n [80] \\n\\n \\n\\n If your pocket money gives out, or you feel that your cards are too bad for endurance, give up playing altogether; but if you continue to play don’t exacerbate your misfortunes by your own shortcomings; it is bad enough to retire to your crib with empty pockets, without a guilty conscience in addition. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/1730/50772.html","bookId":651,"book":{"id":651,"title":"Whist or Bumblepuppy","description":"简介： It would be very easy to write at greater length than we have done in praise of Pembridges little book. But we have said enough to indicate its nature and scope; and we feel sure that any of our readers who may meet with it will endorse our verdict t...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/1730","creation":"Aug 1, 2019 12:19:06 AM","modification":"Aug 1, 2019 12:19:06 AM"}}
