{"id":16243,"no":3,"title":"CHAPTER II. The Physical Features of the Congo.","content":"Roughly we may describe the Basin of the Congo as extending from the 5th degree of North, to the 12th degree of South, latitude, and from the hills skirting the coast of the Atlantic Ocean to 31st or 32nd degree of East longitude. Along what is known as the South-West Coast of Africa, from the Gulf of Biafra southwards, stretches a ridge of hill country. It commences about fifty to seventy miles inland, and is about 300 miles in width. In some parts it attains an elevation of 5,000 or more feet, but the general altitude near the Congo is from 2,000 to 2,500 above the level of the sea. It is really a belt or elevated plateau; rich soil is to be found on the summits of the ‘hills,’ but the whole has been torn and worn by the rains; little streams have in time cut out deep gorges, the sides of which are being further eroded, until what was once a rolling table-land appears as a chaos of hills; only from a21 few heights can one gain a fair idea of the nature of the country. This plateau belt forms the western watershed of the Congo River, and on its seaward slopes gives rise to many unimportant streams, of which the Cameroons, Gaboon, Ogowai, Kwilu, Chiloango, Mbidiji, (Ambrize), Loje, and Kwanza are the principal. The Ogowai is the most important, and has been explored by M. de Brazza for the French Government, which has now annexed its entire basin. It is navigable for some 150 miles for vessels of light draught; but beyond its course is much impeded by cataracts. This water-torn plateau country, with its little useless rivers, has presented a formidable obstacle to exploration, and has served to throw all interior water into the Congo. To the north of the Great Basin stretches the high lands of the unknown countries which form also the watershed of the Shari and the Nile. Eastward stretches the hill country on the west of the Victoria and Albert Nyanza, and on the east of Tanganika, while to the south is the watershed of the Zambesi. This great circle of hills probably enclosed at one time an immense fresh-water lake, of an area of a million and a half square miles, which at length, overflowing at its weakest point, formed22 the outlet which we to-day call the Congo River. The immense flood thus released tore out the deep gorge, which is now 1,000 and 1,500 feet below the main level. There are signs in some parts of changes in its course, one notably in the Bundi valley, thirty-five miles from Vivi, which was at one time undoubtedly a channel of the Congo; there are other valleys also presenting that appearance, the levels, entrances, and exits of which would lead one to conclude that such had been the case. If a transverse section were taken about the middle of the cataract region, there would be first an ascent from the river, almost perpendicular, of from 300 to 500 feet in about one-third of a mile, then a much steadier rise of some 500 to 700 feet in two miles, and then a rise of another 500 to 700 feet in eight miles, with a further steady rise for five miles, so that the actual valley in the cataract region might be estimated roughly at from twenty to thirty miles in breadth. The river itself varies from 300 yards to one-and-a-half or two miles wide at mid-flood; while the difference between the highest water of the rainy season and the lowest in the dry season, varies from forty feet in the worst parts to about three feet on the lower river. To the geologist the country between the coast23 and Stanley Pool is best studied along the river. The first low hills approach near to the mouth of the river, which is about seven miles wide, and devoid of a delta; the next step in the plateau occurs at five miles west of Mboma, fifty miles from the coast, where the tops of the ‘hills’ are from 500 to 700 feet in height. There we find a red clay yielding copal above granitic rocks. The banks grow steeper and the river narrows, until at Vivi the first serious obstacle is met, the plateau level being about 1,700 feet, and the river about 600 yards wide. Just above this is the fierce Yelala Cataract; indeed, nowhere can you properly speak of falls; a drop of fifty feet, which would be a fine scene on an ordinary river, is almost disregarded by the Congo. The bed of a cataract must be of very hard rock, and down this inclined plane, the river, nipped tightly by the hills, rushes with fearful velocity, leaping in mad waves, foaming and raging at its rocky obstacles. In some of the milder cataracts it rushes down a swirling mound of water, which projected into the quieter low level at the foot of the cataract, races on as a heap of waters for nearly half a mile, before it consents to swirl about at the lower level. Fierce up currents run along the shore at such points, which would draw boats or canoes into the24 swirling current, while along the edges of these counter-currents are great whirlpools, giving way to each other, disappearing, and breaking up into ‘caldrons,’ the whole surface heaving and seething. In a creek three miles below the Ntombo Cataract we have watched this heaving. The water would flow outwards from the creek, then meeting the impulse of a fresh heave, would flow back until it would remain stationary for some twenty seconds, often two feet higher than what it was a minute ago. This flows backwards and forwards in the creek, recurring every two minutes or minute and a half. A LOAD. At Vivi the country is much eroded, granitic rocks, schist, mica, gneiss, and quartz are exposed. The hill-sides are rock strewn, and the country is wild and desolate, covered with weak grass and stunted gnarled trees. In the more level spots rich soil has collected, and the natives cultivate there their cassava, ground-nuts, etc. This is the nature of the country for the next fifty miles. Near the river a chaos of hills, further away rolling plateau, covered with strong grass and stunted trees. The tops of these nzanza, by Mr. Stanley’s careful survey, vary but fifty feet over stretches of forty miles. Above Isangila limestone crops up with slaty rocks, the main level25 near the river is lower, and traversed by straight ridges of hills running parallel with the coast, and from five to ten miles apart. Clear of the limestone, the country is once more a torn plateau, slate and shale abound, until at 200 miles from26 the coast occurs a very marked step of 700 feet. Here the country is from 2,300 to 2,500 feet above the sea, and continues so, the rock being a red or purple sandstone. Several higher ridges cross the country as you near Stanley Pool, cut abruptly by the gorge of the river, and continued on beyond. Stanley Pool is a widening out of the river in a weak point among the hills, which marks the head of the cataract region, the water level being about 1,000 feet above the sea. The plateau country continues for a further 150 miles, when hills disappear, and the main level appears to be about 1,100 feet above the sea. From Irebu, 250 miles above the Pool, to Stanley Falls, the banks are forest-clad. The country then divides itself into three regions between the coast and Stanley Falls. The lower river 100 miles, cataract region 200 miles (nearly 300 miles in winding course), the upper river 1,060 miles. Or coast level fifty miles, plateau level 400 miles, central level 900 miles, of which 800 miles are forest-clad banks. The cataract region is the obstacle that has kept so long secret this great highway; but that passed, on the upper river there are 1,100 miles of unimpeded navigation, while the affluents are estimated at 2,000 miles; beyond the Stanley Falls stretch another 2,000 miles of riverway. Two of27 the affluents have been explored, and on each was found a lake, while the natives at the mouths of other affluents speak of lakes. It is highly probable that further explorations will reveal other lake regions, all available to the steamers and boats on the upper river. Communications interiorwards are certain; but between the coast and Stanley Pool everything must be transported on men’s heads, until there shall be a railway. The roads are mere footpaths over the hills from town to town; while the tall thick grass is so strong that it must be hoed up and the bushes cleared before any wheeled carriage could be used. Then again the country is so torn, and streams in their deep gorges so abundant, that travelling is very largely a series of ascents and descents. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3072/84877.html","bookId":982,"book":{"id":982,"title":"Life on the Congo","description":"简介： Although only four years have elapsed since my colleague penned the accompanying chapters, yet events have followed each other so fast that another short chapter seems to be needed to bring them up to date. During this brief interval, our knowledge o...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3072","creation":"Aug 1, 2019 12:24:05 AM","modification":"Aug 1, 2019 12:24:05 AM"}}
