{"id":110623,"no":17,"title":"Page 17","content":"Sixteen\n LISSA FOUND ME LATER IN the day. I\u0027d fallen asleep after Mason left, too dejected to leave the bed. Her slamming of the door jolted me awake.\n I was happy to see her. I needed to spill about the fumbled thing with Mason, but before I could, I read her feelings. They were as troubled as mine. So, as always, I put her first.\n \"What happened?\"\n She sat on her bed, sinking into the feather duvet, her feelings both furious and sad. \"Christian.\"\n \"Really?\" I\u0027d never known them to fight. They teased each other a lot, but it was hardly the kind of thing that could nearly bring her to tears.\n \"He found out... I was with Adrian this morning.\"\n \"Oh, wow,\" I said. \"Yeah. That might be a problem.\" Standing up, I walked over to the dresser and found my brush. Wincing, I stood in front of the gilt-framed mirror and began brushing out the snarls acquired during my nap.\n She groaned. \"But nothing happened! Christian\u0027s freaking out over nothing. I can\u0027t believe he doesn\u0027t trust me.\"\n \"He trusts you. The whole thing\u0027s just weird, that\u0027s all.\" I thought about Dimitri and Tasha. \"Jealousy makes people do and say stupid things.\"\n \"But nothing happened,\" she repeated. \"I mean, you were there and- hey, I never found out. What were you doing there?\"\n \"Adrian sent me a bunch of perfume.\"\n \"He- you mean that giant box you were carrying?\"\n I nodded.\n \"Whoa.\"\n \"Yeah. I came to return it,\" I said. \"The question is, what were you doing there?\"\n \"Just talking,\" she said. She started to light up, on the verge of telling me something, but then she paused. I felt the thought almost reach the front of her mind and then get shoved back. \"I\u0027ve got a lot to tell you, but first tell me what\u0027s up with you.\"\n \"Nothing\u0027s up with me.\"\n \"Whatever, Rose. I\u0027m not psychic like you, but I know when you\u0027re pissed off about something. You\u0027ve been kind of down since Christmas. What\u0027s up?\"\n Now wasn\u0027t the time to get into what had happened on Christmas when my mom told me about Tasha and Dimitri. But I did tell Lissa the story about Mason- editing out why I had stopped- and simply driving home how I had.\n \"Well...\" she said when I finished. \"That was your right.\"\n \"I know. But I kind of led him on. I can see why he\u0027d be upset.\"\n \"You guys can probably fix it, though. Go talk to him. He\u0027s crazy about you.\"\n It was more than miscommunication. Things with Mason and me couldn\u0027t be patched up so easily. \"I don\u0027t know,\" I told her. \"Not everyone\u0027s like you and Christian.\"\n Her face darkened. \"Christian. I still can\u0027t believe he\u0027s being so stupid about this.\"\n I didn\u0027t mean to, but I laughed. \"Liss, you guys\u0027ll kiss and make up in like a day. More than kiss, probably.\"\n It slipped out before I could stop it. Her eyes widened. \"You know.\" She shook her head in exasperation. \"Of course you know.\"\n \"Sorry,\" I said. I hadn\u0027t meant to let her know I knew about the sex thing, not until she told me herself.\n She eyed me. \"How much do you know?\"\n \"Um, not much,\" I lied. I\u0027d finished brushing my hair but began playing with the brush\u0027s handle in order to avoid her eyes.\n \"I have got to learn to keep you out of my mind,\" she muttered.\n \"Only way I can \u0027talk\u0027 to you lately.\" Another slipup.\n \"What\u0027s that supposed to mean?\" she demanded.\n \"Nothing ... I...\" She was giving me a sharp look. \"I... I don\u0027t know. I just feel like we don\u0027t talk as much anymore.\"\n \"Takes two to fix that,\" she said, voice kind again.\n \"You\u0027re right,\" I said, not pointing out that two could fix that only if one wasn\u0027t always with her boyfriend. True, I was guilty in my own way of locking things up- but I had wanted to talk to her a number of times lately. The timing just never seemed to be right- not even now. \"You know, I never thought you\u0027d be first. Or I guess I never thought I\u0027d be a senior and still be a virgin.\"\n \"Yeah,\" she said dryly. \"Me either.\"\n \"Hey! What\u0027s that supposed to mean?\"\n She grinned, then caught sight of her watch. Her smile fell. \"Ugh. I\u0027ve got to go to Priscilla\u0027s banquet. Christian was supposed to go with me, but he\u0027s off being an idiot....\" Her eyes focused hopefully on me.\n \"What? No. Please, Liss. You know how I hate those formal royal things.\"\n \"Oh, come on,\" she begged. \"Christian flaked out. You can\u0027t throw me to the wolves. And didn\u0027t you just say we needed to talk more?\" I groaned. \"Besides, when you\u0027re my guardian, you\u0027ll have to do these things all the time.\"\n \"I know,\" I said darkly. \"I thought I could maybe enjoy my last six months of freedom.\"\n But in the end, she conned me into going with her, as we\u0027d both known she would.\n We didn\u0027t have much time, and I had to do a rush shower, blow-dry, and makeup job. I\u0027d brought Tasha\u0027s dress on a whim, and while I still wanted her to suffer horribly for being attracted to Dimitri, I was grateful for her present now. I pulled on the silken material, happy to see the shade of red was just as killer on me as I\u0027d imagined. It was a long, Asian-style dress with flowers embroidered into the silk. The high neck and long hem covered a lot of skin, but the material clung to me and looked sexy in a different kind of way than showing a lot of skin did. My black eye was practically nonexistent by now.\n Lissa, as always, looked amazing. She wore a deep purple dress by Johnna Raski, a well-known Moroi designer. It was sleeveless and made of satin. The tiny amethyst-like crystals set into the straps sparkled against her pale skin. She wore her hair up in a loose, artfully styled bun.\n When we reached the banquet room, we drew a few eyes. I don\u0027t think the royals had expected the Dragomir princess to bring her dhampir friend to this highly anticipated, invitation-only dinner. But hey, Lissa\u0027s invite had said \"and guest.\" She and I took our places at one of the tables with some royals whose names I promptly forgot. They were happy to ignore me, and I was happy to be ignored.\n Besides, it wasn\u0027t like there weren\u0027t plenty of other distractions. This room was done all in silver and blue. Midnight blue silk cloths covered the tables, so shiny and smooth that I was terrified to eat on them. Sconces of beeswax candles hung all over the walls, and a fireplace decorated with stained glass crackled away in one corner. The effect was a spectacular panorama of color and light, dizzying to the eye. In the corner, a slim Moroi woman played soft cello music, her face dreamy as she focused on the song. The clinking of crystal wineglasses complemented the strings\u0027 low, sweet notes.\n Dinner was equally amazing. The food was elaborate, but I recognized everything on my plate (china, of course) and liked all of it. No foie gras here. Salmon in a sauce of shiitake mushrooms. A salad with pears and goat cheese. Delicate almond-stuffed pastries for dessert. My only complaint was that the portions were small. The food seemed more like it was there to simply decorate the plates, and I swear, I finished it in ten bites. Moroi might still need food along with their blood, but they didn\u0027t need as much as a human- or, say, a growing dhampir girl- needed.\n Still, the food alone could have justified me coming along on this venture, I decided. Except, when the meal ended, Lissa told me we couldn\u0027t leave.\n \"We have to mingle,\" she whispered.\n Mingle?\n Lissa laughed at my discomfort. \"You\u0027re the social one.\"\n It was true. In most circumstances, I was the one who put myself out there and wasn\u0027t afraid to talk to people. Lissa tended to be shyer. Only, with this group, the tables were turned. This was her element, not mine, and it amazed me to see just how well she could interact with royal high society now. She was perfect, polished and polite. Everyone was eager to talk to her, and she always seemed to know the right thing to say. She wasn\u0027t using compulsion, exactly, but she definitely put out an air that drew others to her. I think it might have been an unconscious effect of spirit. Even with the meds, her magical and natural charisma came through. Whereas intense social interactions had once been forced and stressful for her, she now conducted them with ease. I was proud of her. Most of the conversation stayed pretty light: fashion, royal love lives, etc. No one seemed to want to spoil the atmosphere with ugly Strigoi talk.\n So I clung to her side for the rest of the night. I tried to tell myself it was just practice for the future, when I\u0027d follow her around like a quiet shadow anyway. The truth was, I just felt too uncomfortable with this group and knew my usual snarky defense mechanisms really weren\u0027t useful here. Plus, I was painfully aware that I was the only dhampir dinner guest. There were other dhampirs, yes, but they were in formal guardian mode, hovering on the periphery of the room.\n As Lissa worked the crowd, we drifted over to a small group of Moroi whose voices were growing louder. One of them I recognized. He was the guy from the fight that I\u0027d helped break up, only this time he wore a striking black tuxedo instead of a swimsuit. He glanced up at our approach, blatantly checked us out, but apparently didn\u0027t remember me. Ignoring us, he continued on with his argument. Not surprisingly, Moroi protection was the topic. He was the one who\u0027d been in favor of Moroi going on the offensive against the Strigoi.\n \"What part of \u0027suicide\u0027 don\u0027t you understand?\" asked one of the men standing nearby. He had silvery hair and a bushy mustache. He wore a tux too, but the younger guy looked better in one. \"Moroi training as soldiers will be the end of our race.\"\n \"It\u0027s not suicide,\" exclaimed the young guy. \"It\u0027s the right thing to do. We have to start looking out for ourselves. Learning to fight and use our magic is our greatest asset, other than the guardians.\"\n \"Yes, but with the guardians, we don\u0027t need other assets,\" said Silver Hair. \"You\u0027ve been listening to non-royals. They don\u0027t have any guardians of their own, so of course they\u0027re scared. But that\u0027s no reason to drag us down and put our lives at risk.\"\n \"Then don\u0027t,\" said Lissa suddenly. Her voice was soft, but everyone in the little group stopped and looked at her. \"When you talk about Moroi learning how to fight, you make it sound like an all-or-nothing matter. It\u0027s not. If you don\u0027t want to fight, then you shouldn\u0027t have to. I completely understand.\" The man looked slightly mollified. \"But, that\u0027s because you can rely on your guardians. A lot of Moroi can\u0027t. And if they want to learn self-defense, there\u0027s no reason why they shouldn\u0027t do it on their own.\"\n The younger guy grinned triumphantly at his adversary. \"There, you see?\"\n \"It\u0027s not that easy,\" countered Silver Hair. \"If it was just a matter of you crazy people wanting to get yourselves killed, then fine. Go do it. But where are you going to learn all these so-called fighting skills?\"\n \"We\u0027ll figure the magic out on our own. Guardians will teach us actual physical fighting.\"\n \"Yes, see? I knew that was where this was going. Even if the rest of us don\u0027t take part in your suicide mission, you still want to strip us of our guardians to train up your pretend army.\"\n The young guy scowled at the word pretend, and I wondered if more fists would fly. \"You owe it to us.\"\n \"No, they don\u0027t,\" said Lissa.\n Intrigued gazes turned her way again. This time, it was Silver Hair who regarded her triumphantly. The younger guy\u0027s features flushed with anger.\n \"Guardians are the best battle resources we have.\"\n \"They are,\" she agreed, \"but that doesn\u0027t give you the right to take them away from their duty.\" Silver Hair practically glowed.\n \"Then how are we supposed to learn?\" demanded the other guy.\n \"The same way guardians do,\" Lissa informed him. \"If you want to learn to fight, go to the academies. Form classes and start at the beginning, the same way the novices do. That way, you won\u0027t be taking guardians away from active protection. It\u0027s a safe environment, and the guardians there specialize in teaching students anyway.\" She paused thoughtfully. \"You could even start making defense part of the standard curriculum for Moroi students already there.\"\n Astonished stares fell on her, mine included. It was such an elegant solution, and everyone else around us realized it. It gave no party 100 percent of its demands, but it met most in a way that didn\u0027t really harm the other side. Pure genius. The other Moroi studied her with wonder and fascination.\n Suddenly, everyone started talking at once, excited about the idea. They drew Lissa in, and soon there was a passionate conversation going on about her plan. I got shuffled to the edges and decided that was just fine. Then I retreated altogether and sought out a corner near a door.\n Along the way, I passed a server with a tray of hors d\u0027oeuvres. Still hungry, I eyed them suspiciously but saw nothing that looked like the foie gras from the other day. I gestured to one that looked like some sort of braised, rare meat.\n \"Is that goose liver?\" I asked.\n She shook her head. \"Sweetbread.\"\n That didn\u0027t sound bad. I reached for it.\n \"It\u0027s pancreas,\" said a voice behind me. I jerked back.\n \"What?\" I squeaked. The waitress took my shock for rejection and moved on.\n Adrian Ivashkov moved into my line of sight, looking immensely pleased with himself.\n \"Are you messing with me?\" I asked. \"\u0027Sweetbread\u0027 is pancreas?\" I don\u0027t know why that shocked me so much. Moroi consumed blood. Why not internal organs? Still, I repressed a shudder.\n Adrian shrugged. \"It\u0027s really good.\"\n I shook my head in disgust. \"Oh, man. Rich people suck.\"\n His amusement continued. \"What are you doing here, little dhampir? Are you following me around?\"\n \"Of course not,\" I scoffed. He was dressed to perfection, as always. \"Especially not after all the trouble you\u0027ve gotten us into.\"\n He flashed one of his tantalizing smiles, and despite how much he annoyed me, I again felt that overwhelming urge to be near him. What was up with that?\n \"I don\u0027t know,\" he teased. He looked perfectly sane now, exhibiting no trace of the weird behavior I\u0027d witnessed in his room. And yeah, he looked a lot better in a tuxedo than any guy I\u0027d seen in there so far. \"As many times as we keep seeing each other? This is, what, the fifth time? It\u0027s starting to look suspicious. Don\u0027t worry, though. I won\u0027t tell your boyfriend. Either of them.\"\n I opened my mouth to protest, then remembered he\u0027d seen me with Dimitri earlier. I refused to blush. \"I only have one boyfriend. Sort of. Maybe not anymore. And anyway, there\u0027s nothing to tell. I don\u0027t even like you.\"\n \"No?\" asked Adrian, still smiling. He leaned toward me, like he had a secret to share. \"Then why are you wearing my perfume?\"\n This time, I did blush. I took a step back. \"I\u0027m not.\"\n He laughed. \"Of course you are. I counted the boxes after you left. Besides, I can smell it on you. It\u0027s nice. Sharp...but still sweet- just like I\u0027m sure you are deep down inside. And you got it right, you know. Just enough to add an edge...but not enough to drown your own scent.\" The way he said \"scent\" made it sound like a dirty word.\n Royal Moroi might make me uncomfortable, but smartass guys hitting on me didn\u0027t. I dealt with them on a regular basis. I shook off my shyness and remembered who I was.\n \"Hey,\" I said, tossing my hair back. \"I had every right to take one. You offered them. Your mistake is in assuming me taking one means anything. It doesn\u0027t. Except that maybe you should be more careful with where you dump all that money of yours.\"\n \"Ooh, Rose Hathaway is here to play, folks.\" He paused and took a glass of what looked like champagne from a passing waiter. \"You want one?\"\n \"I don\u0027t drink.\"\n \"Right.\" Adrian handed me a glass anyway, then shooed the waiter away and took a drink of the champagne. I had a feeling it wasn\u0027t his first of the night. \"So. Sounds like our Vasilisa put my dad in his place.\"\n \"Your ...\" I glanced back at the group I\u0027d just left. Silver Hair still stood there, gesticulating wildly. \"That guy\u0027s your dad?\"\n \"That\u0027s what my mom says.\"\n \"You agree with him? About how Moroi fighting would be suicide?\"\n Adrian shrugged and took another sip. \"I don\u0027t really have an opinion on that.\"\n \"That\u0027s not possible. How can you not feel one way or another?\"\n \"Dunno. Just not something I think about. I\u0027ve got better things to do.\"\n \"Like stalk me,\" I suggested. \"And Lissa.\" I still wanted to know why she\u0027d been in his room.\n He smiled again. \"I told you, you\u0027re the one following me.\"\n \"Yeah, yeah, I know. Five times- \" I stopped. \"Five times?\"\n He nodded.\n \"No, it\u0027s only been four.\" With my free hand, I ticked them off. \"There was that first night, the night at the spa, then when I came to your room, and now tonight.\"\n The smile turned secretive. \"If you say so.\"\n \"I do say so...\" Again, my words trailed off. I had talked to Adrian one other time. Sort of. \"You can\u0027t mean ...\"\n \"Mean what?\" A curious, eager expression lit his eyes. It was more hopeful than presumptuous.\n I swallowed, recalling the dream. \"Nothing.\" Without thinking about it, I took a drink of champagne. Across the room, Lissa\u0027s feelings burned back to me, calm and content. Good.\n \"Why are you smiling?\" Adrian asked.\n \"Because Lissa\u0027s still over there, working that crowd.\"\n \"No surprise there. She\u0027s one of those people who can charm anyone she wants if she tries hard enough. Even people who hate her.\"\n I gave him a wry look. \"I feel that way when I talk to you.\"\n \"But you don\u0027t hate me,\" he said, finishing the last of his champagne. \"Not really.\"\n \"I don\u0027t like you either.\"\n \"So you keep saying.\" He took a step toward me, not threatening, just making the space between us more intimate. \"But I can live with that.\"\n \"Rose!\"\n The sharpness of my mother\u0027s voice cut through the air. A few people within earshot glanced over at us. My mother- all five angry feet of her- stormed up to us. \n","sourceLink":"https://allnovel.net/frostbite-vampire-academy-2/page-17.html","bookId":2061,"book":{"id":2061,"title":"Frostbite (Vampire Academy #2)","description":"Storyline: \n Vampire Academy Series 2: Frostbite \n Rose loves Dimitri, Dimitri might love Tasha, and Mason would die to be with Rose... \n It\u0027s winter break at St. Vladimir\u0027s, but Rose is feeling anything but festive. A massive Strigoi attack has put the school on high alert, and now the Academy\u0027s crawling with Guardians--including Rose\u0027s hard-hitting mother, Janine Hathaway. And if handto- hand combat with her mom wasn\u0027t bad enough, Rose\u0027s tutor Dimitri has his eye on someone else, her friend Mason\u0027s got a huge crush on her, and Rose keeps getting stuck in Lissa\u0027s head while she\u0027s making out with her boyfriend, Christian! The Strigoi are closing in, and the Academy\u0027s not taking any risks....This year, St. Vlad\u0027s annual holiday ski trip is mandatory. \n But the glittering winter landscape and the posh Idaho resort only create the illusion of safety. When three friends run away in an offensive move against the deadly Strigoi, Rose must join forces with Christian to rescue them. But heroism rarely comes without a price...\n \n","cover":"https://allnovel.net/images/frostbite-vampire-academy-2.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/frostbite-vampire-academy-2.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 6, 2019 12:02:02 AM"}}
