{"id":92280,"no":18,"title":"Page 18","content":"Chapter Fifty-Two Ric would have been worried that I was off and running without waiting for him, but there were lots of things I didn\u0027t want to explain at the moment. Like my mirror-split personality. Quicksilver was still out on big doggie business, so no one witnessed my exit from Nightwine central. I\u0027d used Godfrey\u0027s codes to disable the security cameras when I came home. I didn\u0027t want anybody in the main house to tumble to my intentions and try to talk me out of them, or any record of my criminal intent. When I departed again, I was, in fact, as good as a ghost of myself. I wore a black leotard and Spandex leggings. My black ballet slippers and best vintage black satin opera gloves had rosin on the soles and fingertips to give them more traction. I was entering a reptile-arachnid world and I needed to slither with the best of them, even if only by artificial means. I\u0027d removed the thin sterling hip chain I wore for Ric -it was fragile and might snap during exertion, but I worried about the glaring reflectivity of the silver familiar. It could really cook my cat burglar act if it migrated somewhere obvious at a key moment! But, not to worry. The prescient thing had instantly morphed into a duplicate of the sterling chain and settled on my hips. One might think Snow had intentions of usurping Ric. At least I knew this chain wouldn\u0027t snap... although it might bite. This time I parked Dolly two long Las Vegas Strip blocks away from the Gehenna, where nobody bothered with security cameras, and retraced my escapee steps. Into the laundry Dumpster and up the chute I went, crawling like an insect. I passed the churning central mechanical systems and finally arrived at the theater\u0027s backstage area. The first show wouldn\u0027t open for more than three hours. It was late afternoon. Everything and everybody unloosened their corsets and breathed at a major hotel and casino during the hours that change over from day to night. I prowled the deserted backstage area, feeling an unhappy twinge of homesickness. My reflection had adapted quite well once I was gone. I sensed that. Madrigal had been thoroughly pleased at this outcome, also his pets. They had liked the Stepford Wife me. tamed, predicable, not upsetting the status quo. Too bad. Stepford Divorcee was here now and this was Splitsville. First, I had to confront the blue-toned front-surface mirror in which I\u0027d split in two. The mirror surface was inert, as it had always been. When I touched my black-gloved fingers to their reflection, my whole hand plunged right through. Whole. Uncorrupted by debased mirror images. I stepped through again. Presto-change-o, I was in Cicereau\u0027s office, the slim flash drive case flat against my hip inside the leotard, concealed. The drive was memory overkill-I was only after one image-but a CD was more difficult to conceal in Spandex and I could hardly email that damned and damning file to myself from his machine. The trouble with breaking physical barriers is that you can\u0027t scout ahead. Even as my body emerged crouched on the wet bar, I saw that the joint was jumping. Not only was Cicereau present, and his butch bodyguard Sansouci, but my most non-favorite wanta-meet, Detective Hardboiled, Half-balled Haskell. At the moment I was a scintillating reflection in a dozen silver surfaces. Maybe if I kept the dazzle going, I\u0027d be overlooked. \"You\u0027ve been useful before because you were human, Detective Haskell,\" Cicereau was saying. \"Now you are neither flesh nor foul, but a freakish half-breed. You don\u0027t even know which super bit you, half-werewolf or debased vampire or something worse.\" There was something worse? \"I\u0027m a half-were now.\" Haskell spat the words through distended fangs. He looked a mess. Everything human about him had degraded and mixed with the worst of beastliness. \"I can do even more special work for you.\" \"Such as?\" \"I know where to find that meddling Maggie you\u0027re missing.\" \"Madrigal has been here having a fit when you arrived because she\u0027d disappeared, and I admit I\u0027ll drop a bundle in advertising, but I don\u0027t want her, Haskell. She\u0027s more trouble than she\u0027s worth. Just get out of here.\" Sansouci made it happen in one muscle-bound moment. One down, two to go. \"Scum,\" Sansouci said, wiping his hands on his black denim thighs. \"Now half-breed scum.\" \"Agreed.\" Cicereau smiled. \"Still, scum is always useful, always has been. No trace of my Margie?\" \"Your little Margie has left the building. Gone.\" Sansouci sat in the swivel chair before the desk, then swiveled my way. I thought, Sparkle, sparkle, little reflective star. Hide me. \"Think that Madrigal had anything to do with it, despite his indignant act?\" Cicereau asked. \"No. He had the perfect new trick worked up. I saw it in rehearsal. It rocked.\" \"Yeah, it did, didn\u0027t it? What hooked you, like, as just an audience member?\" So I had to listen to Sansouci rave about me being swathed in silk and then naked in serpent coils and elevated into thin air and having a rhinestone apple sucked out of my throat. These mob guys made a fanged Howard Hughes look enlightened, but what the hell else did they have to do? \"We\u0027re still probably better off without Margie,\" Cicereau concluded. \"Dames will always turn on you and then you have no choice but to off them, which makes you feel bad.\" I shuddered to imagine Cicereau\u0027s farewell speech to his own daughter sixty-some years ago, if he\u0027d even bothered to be in on the kill. \"I\u0027m gonna check on the high-roller baccarat tables.\" Cicereau rose from his desk and from behind his restored computer. \"I\u0027ll hold the fort, boss,\" the black-and-silver haired Sansouci said, standing. He would make a damn impressive werewolf, and I didn\u0027t even want to tangle again with him in human form. I hoped \"the fort\" meant more than this office. Apparently it did, for Sansouci eyed everything, then slipped out the door. I heard the security system beep into action after he left. It hurt to stretch myself back into unmirrored form, but I hopped from the wet bar onto the floor and made for the computer on Cicereau\u0027s desk. The flat-screen monitor showed the same wallpaper as before, a Disney forest scene teeming with rabbits, squirrels, and deer, all great prey for wolves. I moved right to Photo Album, found the deeply buried family pic from 1949 and copied it onto my flash drive. The drive whirred as happily as Jiminy Cricket for a second or two. I was ready to chirp myself when I tucked the earring-sized portable drive into my Spandex tights. Everything was going perfectly until all the power in the room went out, which meant all the lights too. Trouble was, I needed light to see a reflection to walk into. While I froze, being a thinking being, and realized someone must have rigged the power outage from outside the office, a huge heavy web fell atop me. Boobytrap! Also triggered from outside. A net seemed hokey for the Cicereau operation, so who would have motive or opportunity, and the nerve to use Cicereau\u0027s office for his or her own purposes? It sure wasn\u0027t Sylphia\u0027s web, not these scratchy rope fibers. I fought the cumbersome netting, and was still fighting it when the lights and power came back on. The office door opened and in walked... Detective Haskell in all his half-were glory. Chapter Fifty-Three Talk about a list of people you\u0027d most like not to meet in heaven, or hell; Haskell was now numero uno in my book. The lights showed that I was tangled in a huge, heavy-duty fishing net. The more I thrashed, the more tangled I became. This must have been rigged after my first break-in. Still, I didn\u0027t see Sansouci or Cicereau racing back to gloat. Believe it or not, that tightened the sulfuric acid knot in my stomach behind the hidden drive even more. Haskell grinned, showing yellowed teeth between a pair of rusty red fangs. You could have nicknamed him Canadian Sunset. Then he spoke. \"Our friends here at the Gehenna underestimate you, and they sure underestimate me, Miss Delilah Street.\" I jerked in distaste to hear my name on his peeling, blackened lips. \"You know from how I cracked Nightwine\u0027s fence security that I have my little ways of coming and going in the most unexpected places in town.\" I glanced up, examining the ceiling as I hadn\u0027t before. A dark pattern of rugged wood beams suggested overarching forest branches. The net would have been invisible up there. And Haskell probably had something on a lot of local security firm personnel who would do him favors. Even now, he was exulting in what he had on me. \"The minute I saw those new Gehenna billboards, babe, I knew it was you.\" He circled me and the desk, checking to see that I was tightly wrapped. Thank God I\u0027d quit Photo Album, although Haskell might have been too stupid to figure out what I\u0027d been doing. \"I suppose,\" Haskell went on, as the seldom-listened-to invariably do, \"you read about my near-fatal mugging in the Sinkhole and thought you were done with Irving Haskell.\" Irving! I\u0027d forgotten it from the newspaper article. And who wouldn\u0027t? Irma asked. Not an A-list first name. No wonder he had issues. His fingers prodded and poked me through the webbing, which made me feel even more like a snared fish. \"Thing is, girlie, does it pay me better to let the management know I got you, or are they tired of you and I can take you home and keep you all to myself?\" I didn\u0027t answer. I didn\u0027t breathe. I knew which alternative I preferred. So I screamed. I thrashed, even though it was useless. I threw my full weight on Haskell and managed to kick his feet out from under him so we were rolling on the floor together. He actually seemed to enjoy this version of dry mud wrestling, but it was worth the nausea if I could get the big boys back in here to play. Against them I had a chance. Slim, but a chance. I heard the office door slam against the wall. In an instant, Sansouci hauled us both upright and slammed us against the nearest wall. He hit a button on the desk, then sat against the edge, arms crossed, biceps bulging impressively, eyeing us both. I knew what he was thinking: Which of these two would I like to skin alive the most? From the quick glance he gave my Spandex cat burglar outfit I could tell that he liked me best, and in my skin. Everybody hates a loser, and Haskell was a loser born, whether human or unhuman. On the other hand, I\u0027d made Sansouci look bad to Cicereau, and no guy likes a woman who shows him up to his boss. I shrugged and did a little Mae West CinSim. \"Get this slug off me and I\u0027ll run away with you to the Clark County jail.\" \"Don\u0027t listen to her!\" Haskell screamed. \"She\u0027s the Devil in a black Spandex catsuit.\" Actually, that description didn\u0027t hurt me with Sansouci one damn bit. He sighed, got up, wrenched the netting off us both, kicked Haskell in the stomach, and spun me against himself one-armed while he pulled the handcuffs from Haskell\u0027s belt. In a thrice I was cuffed behind my back. Sansouci pushed me up against the wall solo while he rolled Haskell into a fishnet rug on the floor. \"Mr. Cicereau,\" Sansouci said, \"will decide what to do with both of you.\" He glanced at me. \"Sorry that\u0027s not up to me, Snow White. The Clark County jail sounds like a nice peaceful getaway for us both about now.\" As if cued, Cicereau bustled in, the busy, pudgy executive on a heartburn roll. \"So what\u0027s this now?\" Sansouci stood to attention. \"Haskell caught her and I caught them both. We throw \u0027em both over Hoover Dam, or what?\" Sansouci had not been kidding when he\u0027d told me he was sorry! I must be losing my Maggie charisma. \"Hmmm.\" Cicereau strolled over to me. \"She is quite a draw.\" \"I caught her, boss,\" Haskell panted from the floor. \"But you got caught.\" Cicereau prodded him with his Gucci-shod foot, and then lashed me with a glance that Was half-murderous, half-paternal. I guessed he\u0027d made a very similar decision decades before. \"You did okay,\" he told Haskell grudgingly. \"You\u0027re still on the payroll. Now make like a wart hog and vanish. We\u0027ll call you.\" Sansouci unrolled Haskell from the webbing with one long gesture. Haskell spun so fast he must have gotten rope burns as well as dizzy. Haskell rose and wobbled out. As soon as the door shut behind him, Cicereau turned to Sansouci. \"Take her to Starlight Lodge. The moon\u0027s about to go full. I\u0027ll decide about her then and there.\" I breathed a sigh of relief to be rid of Haskell until I saw Sansouci\u0027s impassive face flinch slightly. The expression was gone before he pulled me away from the wall by one arm and hustled me out. I\u0027d been working my black satin wrist-length gloves off behind my back since I\u0027d been cuffed and now was glad I had them to leave a trail. What good that might do was another matter. Quicksilver could follow the scent maybe, if anyone knew where to start looking for me. Ric might. Going through the office door en route to the mysterious Starlight Lodge, I felt a sharp, quick pinch on the butt. Sansouci? He was looking way too grim to indulge in anything as playful as butt pinching. But somebody wasn\u0027t. Like it says in the old song, \"Somebody Loves Me.\" The next line is even more apropos to this situation. \"I wonder who?\" Chapter Fifty-Four My chauffeurs to the Starlight Lodge were my not-so-old friends, Chartreuse and Flamingo. They drove a van marked \"Hazardous Material.\" That worried me a little. Okay, a lot. What also worried me was I\u0027d been unable to feel my friendly neighborhood familiar. My body heat had warmed the hip chain and it was too delicate to sense. The boys were pretty tight-lipped. It was full dark by the time we\u0027d wound our way up into the Spring Mountains. I didn\u0027t see any signs for Los Lobos, but I did see billboards advertising the Paiute Golf Club and its famed fifteenth hole of the Wolf Course. \"Hey,\" I said, \"you guys know a dance club called Los Lobos?\" \"Not on this part of the mountain,\" Chartreuse said. \"Sorry.\" The funny thing is, he really sounded sorry. Very sorry. \"Say,\" I said, \"you think you could get me out of these handcuffs? They kind of hurt my shoulders and wrists.\" \"That\u0027s for the bossman to okay,\" Flamingo said. \"Sorry.\" He too sounded very, very sorry. Okay. What was the Starlight Lodge? The pink-and-green watermelon boys had joked about Quicksilver being sent there the first time they\u0027d kidnapped me. Apparently it was a perennial send-to place. Maybe it was like the Post Office. If you got sent to the wrong address, you never got returned. But when the van drove up to a lighted porte cochere, the place looked like a five-star retreat, rustic but posh. The boys let me out of the van. One produced a key and handcuffed my hands in front, at least. \"Hope you enjoy your stay, miss,\" Chartreuse said, exchanging a glance with Flamingo. Then they both teared up like the doorman to the Emerald City in The Wizard of Oz. I got it. It was \"Surrender Dorothy\" time and I didn\u0027t even have a straw man, a tin man, a cowardly lion, or a valiant little Lhasa apso on my side. I walked into the place alone, head high. I entered the ultimate National Park lodge, all soaring wood and gigantic balconies, fireplaces and leopard skin rugs. (I didn\u0027t approve of walking on dead pelts, but no one had asked me). And heads were mounted on every wall. Lions and tigers and bears. Deer. Buffalo. Even otter, beaver, and fully mounted squirrels, the cowards! Their bright-eyed animal profiles all looked way handsomer and nobler than Homo sapiens. But this was where the wolves lived, not man. Quicksilver\u0027s ancestors had run down deer and boar and I suppose even humans on occasion. A Latina servant girl showed me to a room. Yeah, a servant girl. You or I might have called her a waitress or a Mexican maid or even a concierge, if we wanted to get fancy. She thought nothing of my handcuffs and even less of my requests. A phone. A computer. TV remote? None of these transmitted in the mountain air, she said. Sorry. I was really getting tired of people who had jobs that made them \"sorry\" all the time. Had they never heard of the union movement? Apparently not. Time flew, as it always does when you\u0027re not having fun. I\u0027d watched the day darken into night from the window of my room, which wasn\u0027t merely locked, but sealed. There had been only a medicine cabinet mirror in the bathroom, although lots of polished marble. The cabinet was empty and so was the mirror. It reflected only me, looking worried. I tried my silver medium touch to turn it into an escape route, but it resisted me like Snow did: cold, hard, giving nothing back. Maybe my mirror powers had been enhanced by Madrigal\u0027s magic or presence, or the mirror itself, and didn\u0027t translate to other mirrors, other places. Darn! Otherwise, the suite was palatial, but not my style. The long-haired white goatskin rugs on the exotic wood floors, the black mink throw on the California king-size bed and pillow shams were all too furry for me, though they reminded me that I was in the hands, or soon-to-be paws, of predatory carnivores, not just your run-of-the-mill ruthless mobsters. In the ranks of villainy, these guys offered a fabulous two-fer. I stood, still handcuffed, on the balcony of another huge room, but more intimate than the vast main hall. Below me gathered a company of men. drinking and smoking and talking. I recognized Cicereau and Sansouci, but none of the others. Two half-were \"escorts\" had hauled me before them like a delinquent daughter. Maybe I was playing the role of Jeanie with the light brown hair from my enchanted mirror and from less enchanted Sunset Park, at least for Cicereau. Or Norma Jeane. Or even St. Jeanne d\u0027Arc. Think of every female martyr on the roll call of saints and sinners, and I was probably a stand-in. No thanks. While on trial, I noticed some things I hadn\u0027t before. If the Starlight Lodge was a luxe hideaway for high rollers, it was indeed huge and luxurious. But it was the heads on these particular walls that bothered me. Sure, hunting was a long-time necessity and then a sport in the West, but... people\u0027s heads decked these walls, going back to what was labeled as First Kill. I recognized him from my online info search into the kingpins of early Las Vegas development: Bugsy Siegel. So he\u0027d been hit by the werewolf mob, not the Chicago \"Outfit.\" That had caused a lot of bloody retaliations on the wrong parties. Thinking of wrong parties, I sure was one here and now. And it wasn\u0027t much of a party. While I tried to avoid eye contact with my eye-level predecessors-this little balcony was apparently a prime viewing station of the mountees-a lively debate was going on below. About me. My captors were clearly torn about my fate. All agreed I was too hard to control to have a future as a major Strip hotel attraction, no matter how hot the Maggie mania. Some of Cicereau\u0027s party wanted to keep me prisoner as a lucrative source of black market Maggie tapes. This would require impressing me into the blue-movie industry, and require a lot of nude lying around on dead animal skins on my part. Among other things I didn\u0027t want to think about. Some wanted me dead but killed in a way to fill the ravening coffers of the snuff film industry. Slowly and gruesomely. Some of the werewolves actually objected to that solution on moral grounds. Others just plain wanted me dead the way all of those sent to Starlight Lodge become dead: because the moon was full and they craved chasing down fresh human meat on the hoof. This place was, after all, a retreat-cum-holding pen for mob enemies or turncoats. After living in pampered luxury until the next full moon, the \"guests\" would be turned loose in the surrounding mountains for the werewolves to hunt down. Call it the ultimate in extreme sports for harried executives needing to unwind. Unlucky me, the moon was already full, so I won\u0027t get much luxurious living time before being hunted down. What could I do? I\u0027m stuck in future tense, very tense, no matter what. Ric hadn\u0027t answered his cell phone and must still be in D.C. (and incommunicado) on the Juarez business. Nightwine and Godfrey sure didn\u0027t know I\u0027m not snoozing at home in my cozy little cottage. My desire for discretion and hatred of being monitored now looked foolish. Quicksilver was out on the town on big dog business, the last I knew. These mob chieftains have me trapped and bound here, security cameras rolling, debating whether I\u0027d work best as an enslaved slasher/porn-movie star or as... just plain dead and forgotten. Or maybe resurrected somehow later for whatever they might have in mind. Just plain dead and forgotten looks kinda good from here. The majority concludes that too. My two hairy guards march me back to the huge curving redwood staircase to the main hall and then out onto a main-floor balcony six feet above the ground, facing the great American Western night. Huge torches flutter with the sound of eagles\u0027 wings on either side of the lodge doors. By their light I see that Sansouci isn\u0027t here. Neither are Flamingo and Chartreuse. Maybe they\u0027ve \"changed\" already. Or maybe only strangers will be in for the kill. Maybe even werewolves observe the niceties. The mountains around us loom dark, rocky, empty of everything but a hoot owl\u0027s cry. Before I know it, a pack of half-weres have gathered below me, including Haskell, whose now-elongated jaws are slavering silvery strings of spit like a born lycanthrope. Cicereau must have decided he deserved a piece of the action, after all. My mind flipped back to Los Lobos. They\u0027d be dancing the Change there now, the awed tourists watching the werewolves two-stepping themselves into their four-legged selves, howling for freedom. But those werewolves were a different breed, and probably didn\u0027t hunt humans. That\u0027s not a problem for my circle of furry admirers. A mob of full werewolves gathers, also slavering, beneath my balcony. I feel like Evita. Don\u0027t weep for me, Argentina, send reinforcements! Haskell\u0027s police department issue handcuffs still bind me. Just when I\u0027m hoping for a silver accomplice, an innocuous wrist bangle suddenly wreathes my wrist. Before my eyes it changes back to a charm bracelet of keys! I struggle to manipulate one into the cuff lock without attracting too much attention. Snap! One cuff loosens into the palm of the other hand, but by now the werewolves are snuffling and whining with canine excitement and hear nothing. If only Quicksilver were here! Maybe he\u0027d somehow sensed something wrong and had secretly tailed me to the Gehenna. Maybe he\u0027d run alongside the van, unseen, the whole way here... Maybe pigs like Haskell could fly as well as slobber. On a higher balcony, as if enjoying box seats at a theater of blood, Cicereau and a few still-human guests are sipping red wine (I hope) while I wait to be signaled to run for my life. I unsnap the second cuff and hold it one-handed so I can swing the other cuff as a weapon. The best defense is a good offense, Irma whispers. Right. I bound over the balcony into the midst of the werewolf pack, slinging handcuff. I\u0027m on my back in a pile of scrabbling curved claws. Glad I wore long sleeves and pants. The deep, burning scratches even penetrate my nylon Spandex. Whoever thought trendy workout togs would get a workout like this? I grab wolfish ears and struggle to my feet, avoiding the huge snapping muzzles. Amidst my enemies, my handcuff sling looks as threatening as a linked pair of sleazy big-hoop earrings. And then I feel the silver charm bracelet icing down one wrist, streaking over my shoulders and capturing the other wrist. In the wavering torchlight I see silver cuffs three inches wide on each of my wrists, linked together by a piece of Quicksilver\u0027s heavy pet store chain. Shackles! I\u0027ve now got metal-cuffed wrists with a two-foot-long swag of thick chain between them, which make even better bonds than police-issue handcuffs. Now I\u0027m handicapped big time. Damn Snow! His freaky invasive \"gift\" is gonna bind me for the kill. Which is even now heading this way. As the rising werewolves scrabble for purchase so they can press in to devour me, their combined meaty doggie breaths are enough to knock over a bank. I dodge, turn, elbow their jaws and rib cages, kick their knees and knee their furry little balls... Wait! A half-were charges me, fanged jaws wide. I raise my shackled hands without thinking to defend my neck from a fatal wound. He bites down, hard, on industrial-strength chain and howls with pain. I lift my hands over his shaggy, fanged head, cross my wrists to circle his furred throat with chain, and presto! He falls, throttled. I\u0027ve got a built-in garrote. Someone... something... grabs me from the rear. I feel a swift, cool, dry tremor down my legs... suddenly I have silver spurs to kick out and back with. Screams from my attackers are followed by a warm thick bloodbath on my ankles. I\u0027m so grossed out at the idea of wading through blood that I literally climb over the oncoming half-were and werewolf forms, momentarily standing on free ground again. I turn. Three of the half-weres are down and howling, but most of the werewolves throng me again. The shackles are gone but I feel something cold flooding over my chest-not a touchie-feelie diamond necklace in the night, but enough snaky metal tendrils to form a Victorian rainfall necklace over my entire chest. Very vintage. Snow and his heavy metal games! This is no time to go vintage and cop a feel! Oh. Wait. This damn metal necklace is prickling, not tickling. It\u0027s icy cold, like someone\u0027s reputed prick. I glance down. Silver martial arts hurling stars dangle from every multitudinous chain of my sudden new necklace. So. Live, learn, and kick butt. I pluck those saw-edged stars off that new hanging arsenal one by one, and send them slicing into oncoming furred throats, chests, and femoral arteries. That\u0027s enough to halt the werewolves. I run into the darkness, my thin-soled ballet slippers finding every sharp rock. Heavy panting, wet slobbery breaths, and frenzied whining barrel right behind me. Where do I think I\u0027m going, and why? Muscle stitches scream in my side and scratches burn everywhere. I\u0027m finding that the terrain is rarely flat and always ends in rocky walls not even rosined soles can climb. And then the bullets start flying. Oh, my lucky throwing stars! I spot a human on two legs, standing on a rocky rise holding a big black semiautomatic-something with a lot of rounds, treating the packing werewolves like ducks in a carnival shooting gallery. It\u0027s Ric! His white shirtfront is like a feral grin in the moonlight. How on earth did he get here? Never mind. I can use the distraction, and hopefully his shooting-gallery aim. Hey, my ballet slippers have sprouted silver pitons. Wings would be better. With the harsh stutter of the semiautomatic gun, and silver bullets striking werewolves and even the ground near me, the scene is all gunfire, screams, and confusion. I hurl silver stars at the fallen wolves as Ric pauses to pump in more ammo. The werewolf pack retreats behind rocks. Ric empties his weapon again, then throws it into a knot of standing werewolves. Ric races down the incline to me as the survivors reassemble and we escape onto the dark, cool night. Together again. But the full moon pins us in a relentless spotlight and night creatures see well in the dark. Howls and whines echo from the rocks all around, concealing their direction. The howlers are closing in, packs of maddened, frustrated, rabid wolves and half-weres. They\u0027re beyond the control of the mob bosses who run the lodge, who\u0027ve sent delinquent gamblers, failed hit men, and their rival mobs\u0027 soldiers here to die for decades. This is a killing ground where the unhumans take out the humans. Every time. Ric pulls a nine-millimeter pistol from his belt. \"Too bad you had to ditch the big gun,\" I say. \"Silver bullets aren\u0027t exactly sold at Wal-Mart, and I didn\u0027t have much notice, but I\u0027ve got a bunch of rounds left for the hand-gun. So you run. I shoot.\" \"No!\" I don\u0027t want to leave him. But the wolves keep coming, centering on me. I\u0027m suddenly standing on silver platform boots, ready to race into the raw desert for my life. \"Ric?\" He\u0027s not looking at me. The semiautomatic pistol clasped in both his fists looks pathetically small. He\u0027s a dead shot. When he shoots, a werewolf drops, but two will spring up in its place. How many shots does a dead-shot have before he\u0027s dead? \"Run, Delilah!\" I do, sobbing with frustration, grinding harsh sand beneath my impervious silver soles, my all too-pervious soul yearning to be behind myself, with Ric. Shots echo. And stop. I pause. Why go on? I\u0027m penned in another natural arena of rock. No place to climb, to turn and retreat. I turn anyway. There\u0027s a star high in the sky. I recognize the brightest star in the heavens, Sirius in the constellation of Canis Major. Sirius, that forms the Big Dog\u0027s eye, known as the Dog Star, just off an invisible line drawn to the belt of Orion, the heavenly hunter. Sirius is seriously out of season, being a fall-winter constellation. Seeing it now seems a sign of hope. I think of Achilles, my first guard dog, small but fierce. Some women have always loved cowboys, but I\u0027ve always loved canines. Dogs. Not wolves. Dogs. Time seems collapsed. I trip. I stumble. Sage stalks break to scent the night. I stop, exhausted. And then I see the wolves. Real wolves as they once were. Not were. Strong, wild. Their eyes blaze with the crimson light of the Dog Star. Their fur rises on their hackles in a corona of lightning. They\u0027ve come to stand against the degraded of their own kind. And the werewolves rush us, dead and alive, old and new. Maybe true wolves can\u0027t out-dog their own supernatural kind, but I believe in them, whether I survive or not. We all brace to fight the dark and hope for the coming of the day. I look for Quicksilver, but these are full-blooded wolves, not tame at all. They stand with me only because I\u0027m bait. I\u0027m the target of all the oncoming werewolves.","sourceLink":"https://allnovel.net/dancing-with-werewolves-delilah-street-1/page-18.html","bookId":2113,"book":{"id":2113,"title":"Dancing with Werewolves (Delilah Street #1)","description":"Storyline: Dancing With Werewolves (Delilah Street #1) Delilah Street has spotty recollection of her past, but knows she was named after the street where she was found. Unfortunately, there are no streets by that name in Wichita, KS. Described as a loner in the orphanage, her adult life is much the same--save for a Lhasa Apso anklebiter named Achilles. She\u0027s an investigative reporter working the paranormal beat at WTCH TV in Wichita, KS. So, she spends a lot of time watching TV. She\u0027s stunned when \"CSI Vegas V\" comes on showing a cadaver being dissected that could be her twin--right down to the topaz nose ring she wears.","cover":"https://allnovel.net/images/dancing-with-werewolves-delilah-street-1.jpg","author":"Carole Nelson Douglas","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/dancing-with-werewolves-delilah-street-1.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 5:54:15 PM"}}
