{"id":16563,"no":11,"title":"CHAPTER X VIRGINIA AGAIN THE BATTLE-GROUND","content":"The day came at last when our regiments were to march. They were to rendezvous at the head of Sycamore Street, and march down to the lower depot. Every old man and boy, matron, maiden, and child, every family servant, assembled to bid them God-speed. The reigning belles and beauties of Petersburg were all there,—Alice Gregory, Tabb Bolling, Molly and Augusta Banister, Patty Hardee, Mary and Marion Meade, pretty Helen, and my own friend Agnes. \"We are not to cry, you know,\" said Agnes, laying down the law by right of seniority. \"Of course not!\" said Helen, winking away her tears and smiling. Just then the inspiring notes of \"Dixie,\" with drum and clash of cymbal, rent the air—the first time I had heard that battle-song. \"Forward! March!\" And they were moving in solid ranks, all of us keeping step on the sidewalk, down to the depot. APPOMATTOX. When the men were on board, and the wheels began to move, Ben leaned out of his window and whispered to Helen, just below him:— 135 \"Can\u0027t I have the promise now, Helen?\" \"Yes, yes, Ben—dear Ben, I promise!\" and as the cars rolled away she turned and calmly announced, \"Girls, I\u0027m engaged to Ben Shepard.\" \"I\u0027m engaged to half a dozen of them,\" said one. \"That\u0027s nothing,\" said another, \"I\u0027m engaged to the whole regiment.\" Poor little Helen—but I must not anticipate. After the soldiers left, silence and anxiety fell upon the town like a pall. What should we do next? This was the question we asked each other; and it was answered by one of our dear women. \"We will hold a prayer meeting in each other\u0027s houses, at four o\u0027clock every afternoon. We can pray, if we cannot fight.\" This meeting was held daily throughout the years of the war—and comfort through its influence came to many a sorrowful heart. But the lull was of short duration. The South was sending troops to help old Virginia. I think Beauregard\u0027s veterans can never forget their reception in Petersburg. We were forewarned of their coming. We sent our servants laden with trays of refreshments, we went ourselves to the depot with flowers. Beauregard, our idol, the gallant, dashing Beauregard, hurriedly shook hands with us and filled his arms with our flowers; then,—\"All aboard,\"—and off again, to be heard from very soon at Bull Run. Other regiments passed through town, and none left without being refreshed. The railroad whistles instructed us as to numbers. 136 It was a happy day for me when a telegram came from my Colonel at Norfolk: \"Suppose you pay me a visit!\" There could be but one answer. When the day of my departure arrived I was at the depot of the train which was to take me to City Point, long before the time of starting; and when I reached the terminus of the short railroad, I was in terror lest the Richmond boat might have gone on its way without stopping for us. Would it never come? Surely something had happened! \"Oh, Captain,\" I cried for the third time, as that functionary paced to and fro in front of his little engine, \"do you think the boat—\" \"In a moment, lady,\" said the Captain, \"the boat is just coming round the Point;\" and sure enough, there she was, slowing up to pick up the happiest woman in the world. I can imagine few journeys more delightful than a sail down the James River on a lovely summer day. The river itself is not a clear stream of silver like the Potomac. Every stream that enters it is yellow with the peculiar clay of the country through which it passes. But the James is, par excellence, the romantic river of our country, though not like the beautiful Hudson, misty with the dreams of Washington Irving. The historic James needs no imaginings to enhance its charm. Seated on the forward deck, one glides softly over enchanted waters. Could the veil which hides the future have been lifted from my vision on this glorious noonday, what would have been my sensations. Here at City Point, in the venerable ivy-clad home of the Eppes family, General Grant would in three short years make his headquarters, 137 and would entertain President Lincoln, General Sherman, and Admiral Porter. Across the river the elegant colonial house of Shirley was basking in the summer sun. Here the Carters had lived since 1720. Here Light Horse Harry Lee had found his sweet wife, Anne Hill Carter. Here, too, was the fine portrait of Washington by Peale, and other Revolutionary treasures. Next to Shirley, a little higher up the river, was Turkey Island, where the English explorers had rejoiced to find, in great numbers, the Christmas bird, known in the mother country as early as 1527. Here had lived the wealthy king\u0027s councilman, William Randolph, who had come to Virginia in the good times after King Charlie had returned to \"enjoy his own again\"; and here he had built a goodly house, with a portico on three sides, surmounted by a dome visible a great way off to navigators of the James River, the whole surmounted by an a?rial structure called the \"bird cage because many birds do hover and sing about it.\" Seven years were required to complete this mansion—and all these seven years, doubtless, its master was serving like Jacob, hoping to cage one fair bird for himself. Just across the river, at Bermuda Hundred, lived Henry Isham, Gent: and his wife Dame Katherine; and thither came William Randolph to smoke with the master \"a pipe of tobacco kept in a lily pot, cut on a maple block, lighted with a coal taken with silver tongs from a brasier of juniper\"—for these were the incantations wherewith the early Virginian 138 wooed the subtle influences of the new gift of the gods. And as they smoked, pretty Mary Isham played on her \"cittern\" to the soothing accompaniment of the lapping waves of the river. She was a fit mate for the young aristocrat. He could trace his lineage \"from the great Earls Murray, nay, from royalty itself\"; but gentle Mary could boast on her family tree nobler fruit than these: the Dukes of Normandy—Longue-Epée and Sanspeur—Hugh Capet of France; the Saxon kings of England; the Magna Charta barons; and that noble house of De Vere, which bore on its standard the lone star, because one of their blood, hard pressed in a battle of the Crusades, had seen in a vision a star fall from heaven and alight upon his shield. And so it came that William and Mary Randolph were parents of seven noble sons, and from them descended the great men of colonial and Revolutionary Virginia—Thomas Jefferson, Richard Bland, Chief Justice Marshall, Robert E. Lee. In all these times,—prominent in council, in the college, in the halls of the Executive at Philadelphia, wearing the ermine, in the presidential chair, at the bar, in the pulpit of the Established Church, in the march, in the battle-field,—in every place where character, wisdom, and gallant bearing were needed, we find the descendants of William and Mary Randolph. These were the things of which I proudly thought (for these were my Colonel\u0027s own people) as I was slowly borne along to other localities,—many of them where the Randolphs had lived,—all of them linked together in one chain of historic interest. 139 The old Randolph mansion still existed in part, although its fine dome and pillared porticoes had fallen into decay. As I turned my reverent eyes to this Mecca, how would I have been cut to the heart had the future—the near future—been revealed to me. In one short year McClellan would, before proceeding to Harrison\u0027s Landing, rest after the disasters of the Seven Days\u0027 Battles under the roof-tree at Turkey Island, and his gunboats would shell the old mansion and level it to the ground when it no longer sheltered their commander. A bend of the river now revealed Jordan\u0027s Point, where lived in colonial and Revolutionary days Richard Bland, the antiquary, statesman, and patriot, over whose grave the \"martial ranks of corn\" were now waving, through the stupidity of a recreant descendant. There was no house on Jordan\u0027s Point wherein the restless ghost of pretty Cicely Jordan might hold tryst with her many lovers, or where the wraith of the wise old antiquary might be discerned, bending over the books \"which he studieth much.\" Pretty, rich, fascinating Cicely had in 1623 created so much disturbance in the colony by her utter inability to refuse a suitor, that she was the occasion of the famous law enacting punishment for women who promised marriage to more than one man at a time. Here at \"Jordan\u0027s\" had lived another Mary—Mary Bland—and thence Henry Lee had borne her to Westmoreland; and Henry and Mary Lee were the grandparents of Light Horse Harry, the father of our beloved Robert E. Lee. Here, too, 140 at Jordan\u0027s, Nathaniel Bacon had encamped his followers, before leading them to avenge the outrages of the Indians. But as I mused of these things we were passing Berkley, where lived Giles Bland, who was executed for following Nathaniel Bacon; afterward the home of the Harrison who signed the Declaration of Independence, the father of \"old Tippecanoe,\" President William Henry Harrison. If the veil of the future had been lifted, I should have seen General McClellan resting on the veranda here after his retreat from Malvern Hills, the fields for miles around covered with his tents, the waters alive with war vessels and transports. Now, as I passed, the tired cattle, gathered under the shade of a great oak near the river, were chewing in contentment the midday cud; and at an outhouse within sight, a woman was setting out her newly washed milk pails to be sweetened by the sun after her noonday dinner. Next in interest came Westover—the fine house built by Colonel William Byrd, to whose father my children\u0027s ancestor had sold it. \"The wise and prudent Theodorick Bland\" was sleeping there, I knew, behind the tombstone which recorded his wisdom and prudence, and on which his own and his wife\u0027s arms were quartered, she having been the daughter of the Colonial Governor Richard Bennett. Near him in the graveyard lay the mortal remains of Evelyn Byrd—whose restless spirit slept not ever, but might be seen on moonlight nights gliding among the roses. 141 Then \"Pace\u0027s Pains,\" where lived the Christian Indian Chanco, who revealed the plan for the wholesale massacre of the English in 1622, and who saved Jamestown by a message at dawn to the authorities of the town; and Argall\u0027s Point, where the settlers were slain in the Indian massacre of 1619; and Jamestown, where the good Mr. Hunt stretched a sail between two trees for an altar, consecrating the first church, floored by the leaves and flowers of the forest and roofed by the blue sky of heaven. And Argall\u0027s—once called Paspahegh—where Nathaniel Bacon had halted his \"tyred forlorne Body of men\" to rest them before marching on to Jamestown. And so on and on—past Weyanoke and Brandon with its art treasures—and Martin\u0027s Hundred, where the colonists were massacred in 1622. How peacefully the old river glided between its banks. Now and then voices reached us from the shores, or we paused at a busy landing to leave a mail-bag, or to deliver packages and barrels for the dwellers inland; or the gang-plank would be lowered for some planter going home to his family, and soon pulled up, the great paddle-wheels churning the thick muddy water into a creamy froth, as we were off again. As late evening drew on the river became dark, but less silent. We passed numbers of little skiffs with a single wing and a red eye astern, in which the fisherman was hurrying home, sometimes singing as he sailed. Overhead the homing birds flapped their heavy wings. 142 A sense of peace and calm stole over me. War? Oh, surely, surely not! Something would prevent it. Surely, blood would not be shed because of those insulting words in the Senate and House. God was our Father—the Father of all. Were we not children of His covenant—His blessing promised to the third and fourth generation? Was not the blood of the saints in our veins? If the veil could have been lifted, if one had said, \"Behold, I shew you a vision—you may yet avert its fulfilment,\" how merciful would that have been! Could this have been vouchsafed me, I might have had unrolled before me, that fourteenth day of June,—just three years away,—when the man who was now drilling a small company of volunteers in Galena would be in these waters, crossing the James at the head of 115,000 men, sweeping for two days and nights over three lines of pontoons, marching horse, foot, artillery, and train, straight to the spot whence I had come in the morning of this day, going on their victorious way to lay siege to Richmond and Petersburg, and destined to overwhelm us in the end. And now it was quite dark on the river. Phantom ships flashed now and then out of the darkness, and were swallowed up again. Was that the Goodspeed, or the Susan Constant, or perhaps the Discovery? Hark! was that a war-whoop? WESTOVER. Only the warning whistle of our own boat, as I discovered upon awaking. Before me stood the dignified old colored woman who held the proud position of stewardess of our boat, and beside her a 143 young assistant who gently removed and began to fold the shawl I had tucked around my knees. \"Honey,\" said the old dame, \"ain\u0027t you \u0027fraid you\u0027ll ketch cole out here so late?—it\u0027s time for you to go to bed. The cap\u0027n sent me for you. Yo\u0027 state-room is nice an\u0027 cool now. The potehole been open ever since sundown.\" I was awake and dressed by sunrise next day, our boat having arrived after midnight at the wharf in Norfolk—and in due time the clanking of spurs announced my Colonel! Very fine did he look in his uniform, with my eagles bristling on each shoulder. There was to be a dress-parade that day, in the afternoon, and he desired me to join the ladies of the hotel in the drawing-room after breakfast and present with his compliments an invitation to the parade. \"Do you know when and where I can see the ladies of this hotel?\" I asked my smiling colored chambermaid. \"Lor\u0027, lady, dey ain\u0027t fur off,\" she said. \"Dey mostly sets all day in de shady side of de po\u0027ch pickin\u0027 lint. Dey certainly makes a heap o\u0027 muss. Nobody can\u0027t say nuthin\u0027 to \u0027em; cause deyse guests of de hotel. An\u0027 \u0027tain\u0027t one bit o\u0027 use. Nobody gwine to git hurt, an\u0027 if dey does, what\u0027s de use of all dat sticky cotton?\" I found a number of ladies engaged in the veranda, but not as she had suggested. They were very glad to meet me, and accepted my invitation. They were making square bags out of bunting for cartridges. A gentle, blue-eyed woman joined us 144 and asked for work. But when it was explained to her, she colored, her lips quivered. \"Oh, I can\u0027t! I can\u0027t!\" she begged. \"Let me roll bandages for wounds! I can\u0027t help with the cartridges! You see, all my people live in Pennsylvania. My husband is going to fight them, I know; but don\u0027t ask me to make the cartridges.\" My Colonel came himself with his staff in the afternoon to escort us to his headquarters at the Marine Hospital. On our way we passed an abandoned house, on the walls of which grew the most glorious specimen of fuchsia I ever beheld. I had always heard that this was a marine plant, and I now saw to what perfection it could be brought in the sea air. It reached to the second story and was covered with a shower of great scarlet and blue bells. \"Dixie colors,\" said one of the ladies. We gathered gorgeous bunches and fastened them in our white dresses. The parade ground was a lovely stretch of green, and beyond, the blue waters of the sea sparkled in the afternoon sun, each little wave gemmed with a diamond and set in sapphire. A siege gun had just been mounted, and there was to be practice-firing at a buoy for a mark. I was standing with my group of friends when a handsome officer approached with a military salute and invited me to honor his company by firing their first gun. I went forward with him, and he put the lanyard in my hands. \"Wait for the word of command, Madam,\" he said. LOWER BRANDON. 145 \"And then what?\" I inquired. \"Oh, then pull steadily,\" and with that he stepped back. \"Make ready! Fire!\" I pulled the lanyard—but I was unprepared for the result. The great gun backed, leaped in the air and sent a mighty roar across the waters,—the first cannon fired by the Third Virginia Volunteers. I received the congratulations and thanks of the Captain, and returned to my place—to be told that my eyes were congested by the concussion, and that I must return home and bathe and bandage them at once. Evidently I was not fit for artillery service.","sourceLink":"http://novel.tingroom.com/duanpian/2763/76248.html","bookId":1339,"book":{"id":1339,"title":"Reminiscences of Peace and War","description":"简介： It will be obvious to the reader that this book affects neither the dignity of history nor the authority of political instruction. The causes which precipitated the conflict between the sections and the momentous events which attended the struggle ha...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2763","creation":"Aug 1, 2019 12:24:53 AM","modification":"Aug 1, 2019 12:24:53 AM"}}
