{"id":16572,"no":20,"title":"CHAPTER XIX BEHIND LEE\u0027S LINES","content":"The month of August in the besieged city passed like a dream of terror. The weather was intensely hot and dry, varied by storms of thunder and lightning—when the very heavens seemed in league with the thunderbolts of the enemy. Our region was not shelled continuously. One shot from \"our own gun,\" as we learned to call it, would be fired as if to let us know our places; this challenge would be answered from one of our batteries, and the two would thunder away for five or six hours. We always sought shelter in Mr. Campbell\u0027s bomb-proof cellar at such times, and the negroes would run to their own \"bum-proofs,\" as they termed the cells hollowed under the hill. Agnes wrote from Richmond, August 26, 1864:— \"You dear, obstinate little woman! What did I tell you? I implored you to get away while you could, and now you are waiting placidly for General Grant to blow you up. That awful crater! Do the officers around you consider it honorable warfare to dig and mine under a man and blow him up while he is asleep—before he has time to get his musket? I always thought an open field and a fair fight, with the enemy in front at equal chances, 293 was the American idea of honest, manly warfare. To my mind this is the most awful thing that could be imagined. There is a strong feeling among the people I meet that the hour has come when we should consider the lives of the few men left to us. Why let the enemy wipe us off the face of the earth? Should this feeling grow, nothing but a great victory can stop it. Don\u0027t you remember what Mr. Hunter said to us in Washington? \u0027You may sooner check with your bare hand the torrent of Niagara than stop this tidal wave of secession.\u0027 I am for a tidal wave of peace—and I am not alone. Meanwhile we are slowly starving to death. Here, in Richmond, if we can afford to give $11 for a pound of bacon, $10 for a small dish of green corn, and $10 for a watermelon, we can have a dinner of three courses for four persons. Hampton\u0027s cavalry passed through town last week, amid great excitement. Every man as he trotted by was cutting and eating a watermelon, and throwing the rinds on the heads of the little negro boys who followed in crowds on either side of the street. You wouldn\u0027t have dreamed of war—such shouting and laughing from everybody. The contrasts we constantly see look like insanity in our people. The President likes to call attention to the fact that we have no beggars on our streets, as evidence that things are not yet desperate with us. He forgets our bread riot which occurred such a little while ago. That pale, thin woman with the wan smile haunts me. Ah! these are the people who suffer the consequence of all that talk about slavery in the territories you and I used to hear in the House and Senate Chamber. Somebody, somewhere, is mightily to blame for all this business, but it isn\u0027t you nor I, nor yet the women who did not really deserve to have Governor Letcher send the mayor to read the Riot Act to them. They were only hungry, and so a thousand of them loaded some carts with bread for their children. You are not to 294 suppose I am heartless because I run on in this irrelevant fashion. The truth is, I am so shocked and disturbed I am hysterical. It is all so awful. \"Your scared-to-death \"Agnes.\" My husband sent me a note by his courier, one hot August day, to tell me that his old aide, Captain Whitner, having been wounded, was now discharged from the hospital, but was much too weak for service in the trenches, so he had obtained for the captain leave of absence for two weeks, and had sent him to me to be built up. On the moment the sick man appeared in an ambulance. I was glad to see him, but a gaunt spectre arose before my imagination and sternly suggested: \"Built up, forsooth! And pray, what are you to build him up with? You can no more make a man without food than the Israelites could make bricks without straw.\" However, the captain had brought a ration of bacon and meal, with promise of more to come. I bethought me of the flourishing garden of my neighbor, whose onions and beets were daily gathered for her own family. I wrote a very pathetic appeal for my wounded Confederate soldier, now threatened with scurvy for want of fresh food, and I fully expected she would be moved by my eloquence and her own patriotism to grant me a daily portion from her garden. She answered that she would agree to send me a dish of vegetables fourteen days for fourteen dollars. Gold was then selling at the rate of twenty-five dollars in our paper currency for one dollar in gold, so the dish was not a very costly one. 295 But when it appeared it was a very small dish indeed,—two beets or four onions. Hom?opathic as were the remedial agents, they helped to cure the captain. One morning, late in August, Eliza came early to my bedside. I started up in alarm. \"Shelling again?\" I asked her. \"Worse,\" said Eliza. \"Tell me, tell me quick—is the General—\" \"No, no, honey,\" said my kind nurse, laying a detaining hand upon me. \"You cert\u0027nly sleep sound! Didn\u0027t you hear a stir downstairs in the night? Well, about midnight somebody hallooed to the kitchen, and John ran out. There stood a man on horseback and a dead soldier lying before him on the saddle. He said to John, \u0027Boy, I know General Pryor would not refuse to take in my dead brother.\u0027 \"John ran up to my room and asked me what he must do. \u0027Take him in,\u0027 I told him. \u0027Marse Roger will never forgive you if you turn him away.\u0027\" \"You were perfectly right,\" I said, beginning to dress myself. \"Where is he?\" \"In the parlor,\" said Eliza. \"He had a manservant with him. John brought in his own cot, and he is lying on it. His brother is in there, and his man, both of them.\" The children were hushed by their nurse\u0027s story, and gathered under the shade in the yard. When breakfast was served, I sent John to invite my guest in. He returned with answer that \"the captain don\u0027 feel like eatin\u0027 nothin\u0027.\" \"Captain?\" I asked. 296 \"No\u0027m, he ain\u0027t a captain, but his dead brother was. He was Captain Spann of South Carolina or Georgia, I forget which. His man came into the kitchen for hot water to shave his dead master, but I didn\u0027t ask many questions \u0027cause I saw he was troubled.\" I went out to my ever blooming rose and found it full of cool, dewy blossoms. I cut an armful, and knocked at the parlor door myself. It was opened by a haggard, weary-looking soldier, who burst into tears at seeing me. I took his hand and essayed to lead him forth, but he brokenly begged I would place the roses upon his brother\u0027s breast. \"Will you, for the sake of his poor wife and mother?\" Very calm was the face of the dead officer. His servant and his brother had shaven and cared for him. His dark hair was brushed from a noble brow, and I could see that his features were regular and refined. I persuaded the lonely watcher to go with John to an upper room, to bathe and rest a few minutes; but he soon descended and joined us at our frugal breakfast, and then Mr. Gibson, my good rector, came in to help and advise, and in the evening my husband returned, much gratified that we had received and comforted the poor fellow. As August drew to a close, I began to perceive that I could no longer endure the recurrence of such scenes; and I learned with great relief that my brother-in-law had moved his family to North Carolina and had placed Cottage Farm, three miles 297 distant from the besieged city, at my disposal. Accordingly, I wrote to General Bushrod Johnson, requesting an army wagon to be sent me early the next morning, and all night was spent in packing and preparing to leave. I had collected needful furniture when I moved into town eight months before. The wagon did not come at the specified hour. All day we waited, all the next night (without our beds), and the next day. As I looked out of the window in the twilight, hoping and watching, the cannonading commenced with vigor, and a line of shells rose in the air, describing luminous curves and breaking into showers of fragments. Our gun will be next, I thought, and for the first time my strength forsook me, and I wept over the hopeless doom which seemed to await us. Just then I heard the wheels below my window, and there was my wagon with four horses. We were all bestowed, bag and baggage, in a few minutes, and were soon safely beyond shell fire. I did not know until then how great had been the strain of keeping up under fire for three months. I literally \"went all to pieces,\" trembling as though I had a chill. When we arrived at Cottage Farm, my driver allowed John, Eliza, and my little boys to unload in the road before the lawn, and then calmly turned his horses\u0027 heads and drove away. It was nine o\u0027clock, we had no lights, we had no strength to lift our packages into the house. John advised that he should remain on guard during the night, and that some blankets should be spread for 298 us in the cottage, and we proceeded to carry out this plan. In a few minutes, however, half a dozen soldiers came up, and one of their officers pleasantly greeted us as \"welcome neighbors,\" for their company was encamped near us. They had seen our plight and had come to \"set things to rights,\" also to assure us of protection. About twelve o\u0027clock we found ourselves comfortable. Our beds were put up, our boxes were all under cover. John\u0027s commissariat yielded some biscuits, there was a well of pure water near the door. We were safe. We could sleep. No shell could reach us! The cool freshness of a lovely September morning filled our hearts with life and hope. A large circle of flowers, chrysanthemums, dahlias, and late-blooming roses surrounded the carriage drive to the door, a green lawn stretched to the limits of a large yard in the rear, and beyond this a garden with a few potatoes to dig, and an apple tree in fruit which the soldiers had respected. John and the little boys were in fine spirits. They laid plans for a cow, chickens, ducks, and pigeons. The cow was purchased at once from a neighboring farmer, was named Rose, and was installed in a shelter attached to the kitchen, where John could protect her from marauders. \"\u0027Cause,\" said John, \"I knows soldiers! They get up before day and milk your cow under your very eyebrows. Ain\u0027t you hear about Gen\u0027al Lee in Pennsylvania? The old Dutch farmers gave him Hail Columbia because his soldiers milked their 299 cows. Gen\u0027al Lee could keep \u0027em from stealin\u0027 horses, but the queen o\u0027 England herself couldn\u0027t stop a soldier when he hankers after milk. An\u0027 he don\u0027t need no pail, neither; he can milk in his canteen an\u0027 never spill a drop.\" My brother had left two old family servants, \"Uncle Frank\" and his wife \"Aunt Jinny,\" as caretakers of the premises; and to their dignified bearing, supplemented by the presence of a company of honorable soldiers, we were indebted for the unrifled apple tree and the tiny potatoes, like marbles, left after the autumn digging. \"Aunt Jinny\" also had a few fowls. An egg for my baby was now possible. Her faithful Christian character had won for her a high place in the esteem of the family. Uncle Frank\u0027s manners were perfect,—polished, suave, and conciliatory; but when judge and jury sat upon the case of a culprit arraigned by him, his testimony was apt to be challenged by his prisoner. \"You knows, Marse Robert, you can\u0027t b\u0027lieve ole Uncle Frank!\" \"Frank always knows what he is talking about! He is only more polite than the rest of you.\" \"Well, Marse Robert, Gawd knows I hates to fling dut at Uncle Frank, but he\u0027s a liar. He sholy is! An\u0027 jist \u0027cause he\u0027s a sweet liar he gets we all in trouble.\" My father, the chaplain, soon joined us, his corps having camped within riding distance. There was an office in the yard, and there my father took up his abode. His life was an active one among the 300 soldiers, and he was often absent for days at a time; but I felt the protection of his occasional presence. My husband was now employed, day and night, often in peril, gleaning from every possible source information for General Lee. One day Theo and Roger ran in with stirring news. They had seen General Lee dismount at Mr. Turnbull\u0027s, a short distance on the road beyond us, and had learned from Mr. Turnbull himself that his house had been given to General Lee for his headquarters, also that the General did not require Mr. and Mrs. Turnbull to leave, and that they were delighted to have the General. The whole face of the earth seemed to change immediately. Army wagons crawled unceasingly along the highroad, just in front of our gate. All was stir and life in the rear, where there was another country road, and a short road connecting the two passed immediately by the well near our house. This, too, was constantly travelled; the whir of the well-wheel never seemed to pause, day or night. We soon had pleasant visitors, General A. P. Hill, Colonel William Pegram, General Walker, General Wilcox, and others. General Wilcox, an old friend and comrade, craved permission to make his headquarters on the green lawn in the rear of the house, and my husband rejoiced at his presence and protection for our little family. In less than twenty-four hours I found myself in the centre of a camp. The white tents of General Wilcox\u0027s staff officers were stretched close to the door. 301 When we left Washington, our library and pictures had been sent to Petersburg, and had remained there in a warehouse ever since. My father eagerly advised us to set up the library and hang the pictures in our new home at Cottage Farm. \"But suppose General Lee moves away,\" I suggested. \"My dear, he will not move away! He is here to protect Petersburg and Richmond. He will never surrender either place—and, as I have tried to impress upon you, the safest place for you on this continent is in the rear of Lee\u0027s army.\" So timber was brought for shelving the dining room, and three thousand or more books were arranged on the shelves. The parlor and the two bedrooms (we had no more in the little cottage) were hung with the pictures bought by my husband when he was Minister to Greece. My favorite—the Raffaello Morghen proof impression of the \"Madonna della Seggiola\"—hung over the mantel in the parlor, and to it I lifted weary eyes many a time during the remaining days of the war. Sundry delicate carvings were also in the boxes, with my music. My sister had not taken her piano with her to North Carolina. There were a baby-house and toys in another box, and in a French trunk with many compartments some evening dresses, at which I did not even glance, well knowing I should not need them. The trunk containing them was stored in the cellar. We were happier than we had been for a long time. Things seemed to promise a little respite. To be 302 sure, Grant\u0027s army was in front of us; but if we could only avoid a collision for a month or two, the troops on both sides would go into winter quarters, and everybody would have the rest so much needed to fit them for the spring campaign. \"We are here for eight years,—not a day less,\" said my father, and he fully believed it. That being the case, it behooved me to look after the little boys\u0027 education. School books were found for them. I knew \"small Latin and less Greek,\" but I gravely heard them recite lessons in the former; and they never discovered the midnight darkness of my mind as to mathematics. I knew nothing of the strong line of fortifications which General Grant was building at the back of the farm, fortifications strengthened by forts at short intervals. Our own line—visible from the garden—had fewer forts, two of which, Fort Gregg and Battery 45, protected our immediate neighborhood. These forts occasionally answered a challenge, but there was no attempt at a sally on either side. The most painful circumstance connected with our position was the picket firing at night, incessant, like the dropping of hail, and harrowing from the apprehension that many a man fell from the fire of a picket. But, perhaps to reassure me, Captain Lindsay and Captain Glover of General Wilcox\u0027s staff declared that \"pickets have a good time. They fire, yes, for that is their business; but while they load for the next volley, one will call out, \u0027Hello, Reb,\u0027 be answered, \u0027Hello, Yank,\u0027 and little parcels of coffee are thrown across in exchange 303 for a plug of tobacco.\" After accepting this fiction I could sleep better. Nothing could better illustrate the fact that this war was not a war of the men at the guns, than one of General John B. Gordon\u0027s anecdotes.[19] A short distance from Blandford was the strong work on the Federal line called Fort Steadman. It was determined to take this by assault. There were obstructions in front of our lines which had to be removed. The lines were so close this could only be done under cover of darkness. Then there were obstructions to be removed from the front of Fort Steadman, and an immediate rush to be made before the gunners could fire. This delicate and hazardous duty was successfully performed by General Gordon, near the close of the war, and was the last time the stars and bars were carried to aggressive assault. About four o\u0027clock in the morning our axemen were quietly at work on our obstacle when the unavoidable noise attracted the notice of a Federal picket. In the black darkness he called out:— \"Hello there, Johnny Reb! What are you making all that fuss about over there?\" Our men were leaning forward for the start, and General Gordon was for a moment disconcerted; but a rifleman answered in a cheerful voice:— \"Oh, never mind us, Yank! Lie down and go to sleep! We are just gathering a little corn; you know rations are mighty short over here!\" There was a patch of corn between the lines, some 304 still hanging on the stalks. After a few moments there came back the kindly reply of the Yankee picket:— \"All right, Johnny, go ahead and get your corn. I won\u0027t shoot at you.\" General Gordon was about to give the command to go forward, when the rifleman showed some compunctions of conscience for having used deception which might result in the picket\u0027s death, by calling out loudly:— \"Look out for yourself now, Yank! We\u0027re going to shell the woods.\" Such exhibitions of true kindness and comradeship were not uncommon during the war. On a hill a short distance off was the farmhouse of \"old Billy Green,\" as he was known to his neighbors. He had a good wife, kind to me and to everybody, and a fine-looking, amiable daughter, Nannie Green. These were my only female acquaintances. Nannie soon became an out-and-out belle—the only young lady in the neighborhood. Tender songs were paraphrased in her honor; Ben Bolt\u0027s Sweet Alice became \"Sweet Nannie,\" and \"Sweet Annie of the Vale\" easily became \"Sweet Nannie of the Hill.\" I was very stern with the young officers around me, about Nannie Green. She was a modest, dignified girl, and I did not intend to have her spoiled, nor her father ridiculed. I found some cut-glass champagne glasses in one of my boxes. Every night a request would come from Captain Lindsay, or Captain Glover, or some 305 other of my staff tenants, for a champagne glass. At last I asked:— \"Why do you limit yourselves to one glass?\" \"Oh, we don\u0027t drink from it. We have no wine, you know.\" It appeared upon investigation that they cut profile pictures of Nannie Green out of paper, laid this cut paper on another, weighting it down with bullets, and turned the glass over it. As they sat around the table smoking, each one would lift a little edge of the glass and blow the smoke under it, shutting down quickly. When the smoking was over, and glass and paper were lifted, there was a pure white silhouette of Nannie\u0027s face on an amber-colored background, cameo-like in effect. The face would be delicately shaded, soulful eyes added, and—voilà! \"Why was I not to know this?\" I asked sternly. \"Because we feared you would lend us no more glasses.\" \"So it appears you all have a young lady\u0027s picture without her consent?\" \"Why not?\" they pleaded. \"Isn\u0027t she perfectly welcome to ours?\" \"Do you expect her to exchange, for something she doesn\u0027t want, something which you do want?\" \"Well, we think she might,\" said one, ruefully. \"If her shadow can comfort a poor fellow\u0027s cold and lonely evening, she might spare it. She can\u0027t possibly miss it.\" I never refused to lend them the glasses. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2763/76257.html","bookId":1339,"book":{"id":1339,"title":"Reminiscences of Peace and War","description":"简介： It will be obvious to the reader that this book affects neither the dignity of history nor the authority of political instruction. The causes which precipitated the conflict between the sections and the momentous events which attended the struggle ha...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2763","creation":"Aug 1, 2019 12:24:53 AM","modification":"Aug 1, 2019 12:24:53 AM"}}
