{"id":16580,"no":28,"title":"CHAPTER XXV WOE TO THE VANQUISHED!","content":"Immediately after General Lee\u0027s surrender, the United States Circuit Court held a session at Norfolk, Virginia, and made haste to indict for treason Robert E. Lee, John C. Breckenridge, Roger A. Pryor, and others. These men thereafter were not to feel any sense of personal security. A cloud of doubt and possible disaster still hung over them. Under this cloud they were to commence their lives anew. Every one who has suffered an overwhelming misfortune must be conscious of a strange deadening of feeling—more intolerable even than pain. It may be a merciful provision of nature. Insensibility at a crucial moment may be nature\u0027s an?sthesia. Dr. Livingstone, the African explorer, relates that he was conscious of this insensibility when in the paws of a lion. He had a theory that the instinct of all animals to shake their victim, as the cat does a mouse, may be given in mercy to the vanquished. I was so completely stunned by the thought that all the suffering, all the spilt blood, all the poverty, all the desolation of the South was for naught; that her very fidelity, heroism, and fortitude, qualities so noble in themselves, had 373 wrought her undoing, that I seemed to become dead to everything around me. My husband was compelled to leave me, to seek employment in Richmond. My neighbors, like myself, were stunned into silence. \"Here I and sorrow sit\" might have been said truly of any one of us. When the passing troops left us with only General Hartsuff\u0027s guard, the small earnings of my little boys ceased. John and his fellow-servants came into town, and reported to me. \"I can no longer maintain you or give you wages,\" I said to Eliza Page and her sisters. \"We will serve you for the good you have already done us,\" they said, but of course I could not allow this to any extent. Eliza returned to her husband and their little home. With John I had more trouble. It was hard to make him understand that I could not afford his services on any terms. \"I will never leave you,\" was his reply to everything I urged. \"You must, John! You must go home to your father in Norfolk. He will advise you.\" \"The old man is in the oyster business,\" said John. \"What do I care about oysters? All I care for is Marse Roger and these boys.\" I knew that my poor John had an infirmity. Once when I had sent him with Alick from Cottage Farm on an errand he had returned very late. I could see the pair walking down the road alone, followed at some distance by the horse and wagon. They seemed to be trying to compass both sides of 374 the road at once. Alick was the first to report to me, with these words:— \"I—I-ain\u0027 drunk,—but Jawn! Jawn, he ve\u0027y drunk!\" This painful scene had been re?nacted often enough to make me anxious. \"You really must go to your father, John,\" I insisted. \"How much money have you?\" He had five dollars. I also had five, which I gave him. \"Now don\u0027t let me see you again,\" I said. \"Write to me from Norfolk.\" He left, protesting, but next morning he was gone. I heard from him soon and from his father. The old gentleman expressed gratitude and also some anxiety about John\u0027s \"army habits.\" And so no more of the only slave I ever owned! Agnes wrote from Richmond early in May:— \"My Dearest: What could I do without you? Now don\u0027t flatter yourself that I need now, or ever did need, those beautiful moral reflections in well-chosen language by means of which you have striven to educate me. But you are an unmitigated blessing when my \u0027feelings are too many for me\u0027—when, in short, I boil over. \"Now when a kettle boils over it puts out the fire, and then we go tea-less to bed. How nice it would be for the kettle if some convenient utensil were at hand to receive its excited bubbles. \"I am aggrieved and indignant at the sermons people are preaching to us. And I have caught a young brother in a flagrant theft. All Richmond is in a state of beautiful admiration at a sermon it listened to last week on the uses of our great misfortune. War was declared to be a blessing. 375 \u0027The high passion of patriotism prevents the access of baser passions. Men\u0027s hearts beat together, and woman is roused from the frivolousness and feebleness into which her nature is apt to sink. Death, insult, carnage, violated homes, and broken hearts are all awful. But it is worse than a thousand deaths when a people has adopted the creed that the wealth of nations consists—not in generous hearts, in primitive simplicity, in preference of duty to life; not in MEN, but in silk, cotton, and something that they call \"capital.\" If the price to be paid for peace is this—that wealth accumulates and men decay, better far that every street in every town of our once noble country should run blood.\u0027 \"Now all this is very fine, but very one-sided. And my brother didn\u0027t believe a word of it. He has been away in England and has seen none of the horrors of war; but he has seen something else—a very charming lecture printed in London some time before the war.[25] \"Strange are the ways of Providence. Precisely that I might convict him did this address fall into my hands in Washington. It struck me forcibly at the time. Little did I think I should hear it in Richmond after a terrible civil war of our own. \"I feel impatient at this attempt to extort good for ourselves out of the overwhelming disaster which brought such ruin to others; to congratulate ourselves for what is purchased with their blood. Surely, if for no other reason, for the sake of the blood that has been spilt, we should not hasten to acquiesce in the present state of things. If I catch my Colonel piously affirming too much resignation, too prompt a forgetfulness of the past, I\u0027ll—well, he knows what I am capable of saying! \"But, now that I have safely boiled over, I will tell you my news. We cannot remain here. We are literally stripped to the \u0027primitive\u0027 state my reverend brother thinks 376 so good for us. We are wofully in need of \u0027silk, cotton, and something they call capital,\u0027 and we\u0027ll never get it here. And so my Colonel and I are going to New York. He has secured a place in some publishing house or other. I only wish it were a dry-goods store! \"Of course our social life is all over. I have taken my resolution. There are fine ladies in New York whom I used to entertain in Washington. Just so far as they approach me, will I approach them! A card for a card, a visit for a visit. But I imagine I shall not be recognized. I am content. There will be plenty to read in that publishing house. I shall not repine. All the setting, the entourage, of a lady is taken from me, but the lady herself has herself pretty well in hand, and is quite content if she may always be \"Your devoted \"Agnes.\" The time now came when I must draw rations for my family. I could not do this by proxy. I was required to present my request in person. As I walked through the streets in early morning, I thought I had never known a lovelier day. How could Nature spread her canopy of blossoming magnolia and locust as if nothing had happened? How could the vine over the doorway of my old home load itself with snowy roses, how could the birds sing, how could the sun shine as if such things as these could ever again gladden our broken hearts? My dear little sons understood they were to escort me everywhere, so we presented ourselves together at the desk of the government official and announced our errand. 377 \"Have you taken the oath of allegiance, Madam?\" inquired that gentleman. \"No, Sir.\" I was quite prepared to take the oath. The young officer looked at me seriously for a moment, and said, as he wrote out the order:— \"Neither will I require it of you, Madam!\" I was in better spirits after this pleasant incident, and, calling to Alick, I bade him arm himself with the largest basket he could find and take my order to the commissary. \"We are going to have all sorts of good things,\" I told him, \"fresh meat, fruit, vegetables, and everything.\" When the boy returned he presented a drooping figure and a woebegone face. My first unworthy suspicion suggested his possible confiscation of my stores for drink, but he soon explained. \"I buried that ole stinkin\u0027 fish! I wouldn\u0027t bring it in your presence. An\u0027 here\u0027s the meal they give me.\" Hairy caterpillars were jumping through the meal! I turned to my table and wrote:— \"Is the commanding general aware of the nature of the ration issued this day to the destitute women of Petersburg?\" (signing myself) \"Mrs. Roger A. Pryor.\" This I gave to Alick, with instructions to present it, with the meal, to General Hartsuff. 378 Alick returned with no answer; but in a few minutes a tall orderly stood before me, touched his cap, and handed me a note. \"Major-General Hartsuff is sorry he cannot make right all that seems so wrong. He sends the enclosed. Some day General Pryor will repay \"George L. Hartsuff, \"Major-General Commanding.\" The note contained an official slip of paper:— \"The Quartermaster and Commissary of the Army of the Potomac are hereby ordered to furnish Mrs. Roger A. Pryor with all she may demand or require, charging the same to the private account of \"George L. Hartsuff, \"Major-General Commanding.\" Without the briefest deliberation I wrote and returned the following reply:— \"Mrs. Roger A. Pryor is not insensible to the generous offer of Major-General Hartsuff, but he ought to have known that the ration allowed the destitute women of Petersburg must be enough for \"Mrs. Roger A. Pryor.\" As I sat alone, revolving various schemes for our sustenance,—the selling of the precious testimonial service (given by the Democracy of Virginia after my husband\u0027s noble fight against \"Know-nothingism\"), the possibility of finding occupation for 379 myself,—the jingling of chain harness at the door arrested my attention. There stood a handsome equipage, from which a very fine lady indeed was alighting. She bustled in with her lace-edged handkerchief to her eyes, and announced herself as Mrs. Hartsuff. She was superbly gowned in violet silk and lace, with a tiny fanchon bonnet tied beneath an enormous cushion of hair behind, the first of the fashionable chignons I had seen—an arrangement called a \"waterfall,\" an exaggeration of the plethoric, distended \"bun\" of the Englishwoman of a few years ago. \"Oh, my dear lady,\" she began, \"we are in such distress at headquarters! George is in despair! You won\u0027t let him help you! Whatever is he to do?\" \"I really am grateful to the General,\" I assured her; \"but you see there is no reason he should do more for me than for others.\" \"Oh, but there is reason. You have suffered more than the rest. You have been driven from your home! Your house has been sacked. George knows all about you. I have brought a basket for you—tea, coffee, sugar, crackers.\" \"I cannot accept it, I am so sorry.\" \"But what are you going to do? Are you going to starve?\" \"Very likely,\" I said, \"but somehow I shall not very much mind!\" \"Oh, this is too utterly, utterly dreadful!\" said the lady as she left the room. The next day the ration was changed. Fresh 380 beef, canned vegetables, bread, and coffee were issued to all the women of Petersburg. Mrs. Hartsuff came daily to see me. \"Not that George has gotten over it!\" she declared. \"His feelings are constantly hurt here. And as to myself, that old black Irene I found in the kitchen at Centre Hill just walks over me!\" \"Why don\u0027t you dismiss her?\" \"Dismiss Irene? I should like to see anybody dismiss Irene! Besides, she cooks divinely. But I can\u0027t enter her kitchen! \u0027Dear me,\u0027 I said one day, \u0027what a dirty kitchen!\u0027 \u0027Ladies don\u0027t nuvver come in kitchens,\u0027 she told me. Evidently I am not a lady! And I once asked her please to be careful of the gold studs the General was apt to leave in his cuffs \u0027Gold studs!\u0027 she repeated with a sniff, \u0027my master wore diamond studs, an\u0027 I never see cuffs loose from shirts before in all my born days. \u0027Cose the wind\u0027ll blow \u0027em away! I can\u0027t be \u0027sponsible for no shirt that\u0027s in three or four pieces.\u0027\" All the good citizens of Petersburg who had been driven away by the shelling now began to return, and among them came the owners of the house I was occupying. I was told that I could, on no account, be safe at Cottage Farm without a guard. For this, too, I must make personal request. So my little body-guard and I wended our way to interview General Hartsuff. We found him in the noble mansion of the Bollings. At the entrance two fine greyhounds in marble had for many years guarded the incoming and outgoing of the Bolling family. In the rear 381 there was a long veranda with lofty pillars, and beyond, extensive grounds set with well-grown evergreens, and with that princely tree, the magnolia grandiflora, now in bloom. White marble statues and marble seats were scattered through the grounds. A rustic staircase led down to a conservatory, built low for the better care of the plants. The mansion stood on an eminence sloping sharply in front, and a legend-haunted subterranean passage led from the dwelling to the street, the entrance to which was covered by shrubs and vines. As I stood in the veranda waiting for audience, a young officer called my attention to the beauty of the grounds and the magnificence of the flowering plants in tubs on the veranda. \"I should like,\" he said, \"to fight it out on this line all summer.\" I thought of the family driven from their own, and was wicked enough to tell him:— \"That would be most unfortunate for you. This place is very sickly in summer—deadly, in fact. Typhoid fever is fatal in this section.\" But I was summoned to the presence of the great man. As I entered, he continued writing at a table, without greeting me or looking up from his paper. \"General,\" I commenced, \"I have come to ask if I may have a guard. I am about to return to my home—Cottage Farm.\" No answer, except the rapid scratching of his pen as it travelled over his sheet. \"General Hartsuff, are you still angry with me because I did not feel I could accept your kind offer? 382 I couldn\u0027t take it! I couldn\u0027t trust myself with it! I should have given a ball and ruined you.\" He laughed outright at this and threw down his pen. \"It is impossible for you to go to Cottage Farm,\" he said; \"there are fifty or more negroes on the place. You cannot live there.\" \"I must! it is my only shelter.\" \"Well, then, I\u0027ll allow you a guard, and Mrs. Hartsuff had better take you out herself, that is, if you can condescend to accept as much.\" I was not aware that Mrs. Hartsuff had entered and stood behind me. \"And I think, George,\" she said, \"you ought to give Mrs. Pryor a horse and cart in place of her own that were stolen.\" \"All right, all right,\" he said hastily. \"Madam, you will find the guard at your door when you arrive. You go this evening? All right—good morning.\" Mrs. Hartsuff duly appeared in the late afternoon with an ambulance and four horses, and we departed in fine style. She was very cheery and agreeable, and made me promise to let her come often to see me. As we were galloping along in state, we passed a line of weary-looking, dusty Confederate soldiers, limping along, on their way to their homes. They stood aside to let us pass. I was cut to the heart at the spectacle. Here was I, accepting the handsome equipage of the invading commander—I, who had done nothing, going on to my comfortable home; while they, poor fellows, who had borne long years of battle and starvation, 383 were mournfully returning on foot, to find, perhaps, no home to shelter them. \"Never again,\" I said to myself, \"shall this happen! If I cannot help, I can at least suffer with them.\" But when I reached Cottage Farm I found a home that no soldier, however forlorn, could have envied me. A scene of desolation met my eyes. The earth was ploughed and trampled, the grass and flowers were gone, the carcasses of six dead cows lay in the yard, and filth unspeakable had gathered in the corners of the house. The evening air was heavy with the sickening odor of decaying flesh. As the front door opened, millions of flies swarmed forth. \"If this were I,\" said Mrs. Hartsuff, as she gathered her skirts as closely around her as her hoops would permit, \"I should fall across this threshold and die.\" \"I shall not fall,\" I said proudly; \"I shall stand in my lot.\" Within was dirt and desolation. Pieces of fat pork lay on the floors, molasses trickled from the library shelves, where bottles lay uncorked. Filthy, malodorous tin cans were scattered on the floors. Nothing, not even a tin dipper to drink out of the well, was left in the house, except one chair out of which the bottom had been cut, and one bedstead fastened together with bayonets. Picture frames were piled against the wall. I eagerly examined them. Every one was empty. One family portrait of an old lady was hanging on the wall with a sabre-cut across her face. 384 \"Now, what in the world are you going to do?\" asked Mrs. Hartsuff. \"The best I can,\" I said. But old Aunt Jinny had espied me, and, with a courtesy to Mrs. Hartsuff, had seized my little girl. \"This is a hard home-coming for you, my po\u0027 lamb! But never mind! Jinny has got plenty of clean bedclothes and things. Yes, marm\" (to Mrs. Hartsuff), \"I can take care of \u0027em! The colored people? Oh, the colored people will give no trouble. They are very peaceable.\" She gathered us into her kitchen while she swept a room for us and spread quilts upon the floor. Later in the evening an ambulance from Mrs. Hartsuff drove up. She had sent me a tin box of bread-and-butter sandwiches, some tea, an army cot, and army bedding. The guard, a great, tall fellow, came to me for orders. I felt nervous at his presence and wished I had not brought him. I directed him to watch all night at the road side of the house, while I would sit up and keep watch in the opposite direction. The children soon slept upon the floor. As the night wore on, I grew extremely anxious about the strange negroes. Aunt Jinny thought there were not more than fifty. They had filled every outhouse except the kitchen. Suppose they should overpower the guard and murder us all. Everything was quiet. I had not the least disposition to sleep—thinking, thinking, of all the old woman had told me of the sacking of the house, of the digging of the cellar in search of treasure, of 385 the torch that had twice been applied to the house, and twice withdrawn because some officer wanted the shaded dwelling for a temporary lodging. Presently I was startled by a shrill scream from the kitchen, a door opened suddenly and shut, and a voice cried, \"Thank Gawd! Thank Gawd A\u0027mighty.\" Then all was still. Was this a signal? I held my breath and listened, then softly rose, closed the shutters and fastened them, crept to the door, and bolted it inside. I might defend my children till the guard could come. Evidently he had not heard! He was probably sleeping the sleep of an untroubled conscience on the bench in the front porch. And with untroubled consciences my children were sleeping. It was so dark in the room I could not see their faces, but I could touch them, and push the wet locks from their brows, as they lay in the close and heated atmosphere. I resumed my watch at the window, pressing my face close to the slats of the shutters. A pale half-moon hung low in the sky, turning its averted face from a suffering world. At a little distance I could see the freshly made soldier\u0027s grave which Alick had discovered and reported. A heavy rain had fallen in the first hours of the night, and a stiff arm and hand now protruded from the shallow grave. To-morrow I would reverently cover the appealing arm, be it clad in blue or in gray, and would mark the spot. Now, as I sat with my fascinated gaze upon it, I thought of the tens of thousands, of the hundreds 386 of thousands, of upturned faces beneath the green sod of old Virginia. Strong in early manhood, brave, high-spirited men of genius, men whom their country had educated for her own defence in time of peril,—they had died because that country could devise in her wisdom no better means of settling a family quarrel than the wholesale slaughter of her sons by the sword. And now? \"Not till the heavens be no more shall they awake nor be raised out of their sleep.\" And then, as I sorrowed for their early death in loneliness and anguish, I remembered the white-robed souls beneath the altar of God,—the souls that had \"come out of great tribulation,\"—and because they had thus suffered \"they shall hunger no more, neither thirst any more; ... and God shall wipe away all tears from their eyes.\" And then, as the pale, distressful moon sank behind the trees, and the red dawn streamed up from the east, the angel of Hope, who had \"spread her white wings and sped her away\" for a little season, returned. And Hope held by the hand an angel stronger than she, who bore to me a message: \"In the world ye have tribulation: but be of good cheer; I have overcome the world.\" The sun was rising when I saw my good old friend emerge from her kitchen, and I opened the shutters to greet her. She had brought me a cup of delicious coffee, and was much distressed because I had not slept. Had I heard anything? \"Course I know you was bleeged to hear,\" said Aunt Jinny, as she bustled over the children. \"That 387 was Sis\u0027 Winny! She got happy in the middle of the night, an\u0027 Gawd knows what she would have done, if Frank hadn\u0027t ketched hold of her and pulled her back in the kitchen! Frank an\u0027 me is pretty nigh outdone an\u0027 discouraged \u0027bout Sis\u0027 Winny. She prays constant all day; but Gawd A\u0027mighty don\u0027t count on bein\u0027 bothered all night. Ain\u0027 He \u0027ranged for us all to sleep, an\u0027 let Him have a little peace? Sis\u0027 Winny must keep her happiness to herself, when folks is trying to git some res\u0027.\" The guard now came to my window to say he \"guessed\" he\u0027d \"have to put on some more harness. Them blamed niggers refused to leave. They might change their minds when they saw the pistols.\" \"Oh, you wouldn\u0027t shoot, would you?\" I said, in great distress. \"Call them all to the back door and let me speak with them.\" I found myself in the presence of some seventy-five negroes, men, women, and children, all with upturned faces, keenly interested in what I should say to them. I talked to them kindly, and told them I was sorry to see so many of them without homes. One of them, an intelligent-looking man, interrupted me. \"We are not without homes,\" he said. \"I planted and worked on this place for years before the war. It is right I should have some choice in the land the government promises us, and I have come here because I shall ask for the land I have worked.\" \"You are mistaken, I am sure,\" I said. \"This farm belongs to my brother, not to me. I am here through his kindness, and I am perfectly willing 388 you should remain through mine until you find other shelter, provided you consider my husband master here, give no trouble, and help me clean up this place. All who are not willing to do this must leave. You must distinctly understand this is private property which will be protected by the government.\" \"That\u0027s so!\" said the guard, emphatically. Thereupon an old, gray-haired man stepped forth and said:— \"My name\u0027s Abram! I\u0027se toted Marse Roger on my back to school many a time. Me an\u0027 my family will stay an\u0027 clean up, an\u0027 thank you, Mistis! Come now! You all hear what the Yankee gentleman say! Git to work now on them dead cows—hurry up!\" I sent Abram to the quartermaster, and borrowed a team to haul away the filth and the dead animals. My faithful old friend in the kitchen lent me chairs and a table, and before night we were comparatively clean, having had a score or more scrubbers, and as many out-of-door laborers at work. My husband returned to us, and we commenced our new life of hopeless destitution. Not before October could I get my consent to eat a morsel in the house. I took my meals under the trees, unless driven by the rains to the shelter of the porch. The old woman who had been so unreasonably happy—\"Sis\u0027 Winny\"—proved to be a mere atom of a creature, withered, and bent almost double with age and infirmities, whom Aunt Jinny had taken in out of sheer compassion. If she could 389 find something for which to thank God, surely none need despair. To my great joy, my dear General had not remained in Richmond. There was no hope there for immediate occupation. His profession of law, for which he had been educated, promised nothing, for the very good reason that he had forgotten all he ever knew in his later profession of editor and politician. The latter field was closed to him forever. There was nothing for a rebel to earn in editing a newspaper. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2763/76265.html","bookId":1339,"book":{"id":1339,"title":"Reminiscences of Peace and War","description":"简介： It will be obvious to the reader that this book affects neither the dignity of history nor the authority of political instruction. The causes which precipitated the conflict between the sections and the momentous events which attended the struggle ha...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2763","creation":"Aug 1, 2019 12:24:53 AM","modification":"Aug 1, 2019 12:24:53 AM"}}
