{"id":70516,"no":35,"title":"Page 35","content":"76\\n\\n \u0027Perfect,\u0027 said Tessa Wendel. \u0027Perfect, perfect, perfect.\u0027 She made a gesture as though she were nailing something to the wall, firmly and hard. \u0027Perfect.\u0027\\n\\n Crile Fisher knew what she was talking about. Twice, in two different directions, they had passed through hyperspace. Twice Crile had watched the pattern of stars change somewhat. Twice he had searched out the Sun, finding it a bit dimmer the first time, a bit brighter the second. He was beginning to feel like an old hyperspatial knockabout.\\n\\n He said, \u0027The Sun isn\u0027t bothering us, I take it.\u0027\\n\\n \u0027Oh, it is, but in a perfectly calculable way, so that the physical interference is a psychological pleasure - if you know what I mean.\u0027\\n\\n Fisher said, playing the devil\u0027s advocate, \u0027The Sun\u0027s pretty far away, you know. The gravitational effect must be pretty close to zero.\u0027\\n\\n \u0027Certainly,\u0027 said Wendel, \u0027but pretty close to zero isn\u0027t zero. The effect is measurable. Twice we passed through hyperspace, with the virtual path first approaching the Sun obliquely and then receding at another angle. Wu did the calculations beforehand, and the path we took fit those calculations to all the decimal points we could reasonably ask. The man\u0027s a genius. He weaves shortcuts into the computer program in a fashion you wouldn\u0027t believe.\u0027\\n\\n \u0027I\u0027m sure,\u0027 murmured Fisher.\\n\\n \u0027So there\u0027s no question now, Crile. We can be at the Neighbor Star by tomorrow. By today - if we\u0027re really in a hurry. Not very close, of course. We may have to coast inward toward the star for a reasonable period of time, as a precautionary measure. Besides, we don\u0027t know the mass of the Neighbor Star with sufficient precision to take too many chances on a really close approach. We don\u0027t want to be hurled off unexpectedly and have to work our way back.\u0027 She shook her head admiringly, \u0027That Wu. I\u0027m so pleased with him, I can\u0027t begin to describe it.\u0027\\n\\n Fisher said cautiously, \u0027Are you sure you don\u0027t feel a little annoyed?\u0027\\n\\n \u0027Annoyed? Why?\u0027 She stared at Fisher in surprise, then said, \u0027Do you think I ought to be jealous?\u0027\\n\\n \u0027Well, I don\u0027t know. Is there a chance that Chao-Li Wu will get the credit for working out superluminal flight - I mean, the true details of it - and that you\u0027ll be forgotten, or remembered only as a forerunner?\u0027\\n\\n \u0027No, not at all, Crile. It\u0027s nice of you to worry on my behalf, but matters are secure. My work is recorded in full detail. The basic mathematics of superluminal flight are mine. The engineering details I have also contributed to, although others will get the major credit for designing the ship, and should. What Wu has done has been to add a correction factor to the basic equations. Highly important, of course, and we can now see that superluminal flight wouldn\u0027t be practical without it, but it\u0027s just the icing on the cake. The cake is still mine.\u0027\\n\\n \u0027Fine. If you\u0027re sure of that, I\u0027m happy.\u0027\\n\\n \u0027As a matter of fact, Crile, I\u0027m hoping Wu will now take the lead in developing superluminal flight. The fact is, I\u0027m past my best years - scientifically, that is. Only scientifically, Crile.\u0027\\n\\n Fisher grinned. \u0027I know that.\u0027\\n\\n \u0027But scientifically, I am over the hill. The work I\u0027ve done has been the mining of the concepts I had when I was a graduate student. It\u0027s been a matter of about twenty-five years of drawing conclusions, and I\u0027ve gone about as far as I can go. What\u0027s needed are brand-new concepts, entirely new thoughts, a branching off into uncharted territory. I can\u0027t do that any more.\u0027\\n\\n \u0027Come, Tessa, don\u0027t underrate yourself.\u0027\\n\\n \u0027That\u0027s never been one of my faults, Crile. New thoughts are what we need youth for. It\u0027s not just young brains that young people have, it\u0027s new brains. Wu has a genome that has never appeared in humanity before. He\u0027s had experiences that are crucially his - no-one else\u0027s. He can have new thoughts. Of course, he bases them on what I have done before him, and he owes a great deal to my teaching. He\u0027s a student of mine, Crile, a child of my intellect. All that he does well reflects well on me. Jealous of him? I glory in him. What\u0027s the matter, Crile? You don\u0027t look happy.\u0027\\n\\n \u0027I\u0027m happy if you are, Tessa, no matter how I look. The trouble is that I have the feeling you\u0027re feeding me the theory of scientific advance. Weren\u0027t there cases in the history of science, as in everything else, where jealousy existed, and where teachers detested their students for surpassing them?\u0027\\n\\n \u0027Certainly. I could quote you half a dozen notorious cases right off the top of my head, but those are rare exceptions and the fact is that I don\u0027t feel that way right now. I don\u0027t say that it isn\u0027t conceivable that I may at some time lose patience with Wu and the Universe, but it isn\u0027t happening at the moment, and I intend to savor this moment while it- Oh, now what?\u0027\\n\\n She pushed the \u0027Receive\u0027 contact and Merry Blankowitz\u0027s young face appeared trimensionally in the transmitter.\\n\\n \u0027Captain,\u0027 she said hesitantly. \u0027We\u0027re having a discussion out here and I wonder if we can consult you.\u0027\\n\\n \u0027Is something wrong with the flight?\u0027\\n\\n \u0027No, Captain. It\u0027s just a discussion over strategy.\u0027\\n\\n \u0027I see. Well, you needn\u0027t file in here. I\u0027ll come out to the engine room.\u0027\\n\\n Wendel blanked out the face.\\n\\n Fisher muttered, \u0027Blankowitz doesn\u0027t usually sound that serious. What\u0027s bugging them, do you suppose?\u0027\\n\\n \u0027I\u0027m not going to speculate. I\u0027ll go out there and find out.\u0027 And she motioned Fisher to follow.\\n\\n 77\\n\\n There were the three of them, sitting in the engine room, all of them with seats carefully on the floor, despite the fact that they were under zero-gravity at the moment. They might just as well have been sitting each on a different wall, but that would have detracted from the seriousness of the situation, and it would have shown disrespect for the office of Captain, besides. There was a complex system of etiquette that had long been developed for zero-gravity.\\n\\n Wendel did not like zero-gravity and if she had wanted to push her Captain\u0027s privileges, she could have insisted on the ship being in rotation at all times to produce a centrifugal effect that would have produced some feeling of gravity. She knew perfectly well that computing a flight path was easier when the ship was at rest, both translationally and rotationally, with respect to the Universe as a whole, but calculating it under constant rotational velocity didn\u0027t raise the difficulty to too high a level.\\n\\n Nevertheless, to insist on such motion would have been disrespectful to the person at the computer. Etiquette again.\\n\\n Tessa Wendel took her seat, and Crile Fisher could not help but notice (with a secret, ingrown smile) that she lurched slightly. For all her Settlement background, she had clearly never gotten her space legs. He himself (and there was another secret smile - of satisfaction, this time), for all that he was an Earthrnan, could move about in zero-gravity as though he were born to it.\\n\\n Chao-Li Wu took a deep breath. He had a broad face - the type that looked like it belonged with a short body, but he was taller than average, when he stood up. His hair was dark and perfectly straight and his eyes were markedly narrow.\\n\\n He said softly, \u0027Captain.\u0027\\n\\n Wendel said, \u0027What is it, Chao-Li? If you tell me some problem has developed in the programming, I may be tempted to choke you.\u0027\\n\\n \u0027No problem, Captain. No problem at all. In fact, there is such an absence of problems that it strikes me that we\u0027re through and should go back to Earth. I would like to suggest that.\u0027\\n\\n \u0027Back to Earth?\u0027 Wendel had paused before she said that, had taken the time to look a little stupefied. \u0027Why? We haven\u0027t accomplished our task yet.\u0027\\n\\n \u0027I think we have, Captain,\u0027 said Wu, his face growing expressionless. \u0027We just didn\u0027t know what our task was, to begin with. We have worked out a practical system of superluminal flight, and we didn\u0027t have that when we left Earth.\u0027\\n\\n \u0027I know that, but what of it?\u0027\\n\\n \u0027And we don\u0027t have any means of communication with Earth. If we go on now to the Neighbor Star and if something happens to us, if something goes wrong, Earth will not have practical superluminal flight and there is no telling when they will. This could have a serious affect on Earth\u0027s evacuation as the Neighbor Star approaches. I feel that it is important that we go back and explain what we\u0027ve learned.\u0027\\n\\n Wendel had listened gravely. \u0027I see. And you, Jarlow, what are your views on this?\u0027\\n\\n Henry Jarlow was tall and blond and dour. There was a settled melancholy on his face that gave a totally wrong impression of his character, and his long fingers (which had nothing apparently delicate about them) were magic when they worked with the interior of computers or with almost any instrument on board.\\n\\n He said, \u0027I think Wu makes sense, frankly. If we had superluminal communication, we\u0027d get the information back to Earth that way and go on. What would happen to us after that would be of no importance except to us. As it is, we can\u0027t sit on the gravitational correction.\u0027\\n\\n \u0027And you, Blankowitz?\u0027 asked Wendel quietly.\\n\\n Merry Blankowitz stirred uneasily. She was a small young woman and her long dark hair was cut straight across, just over her eyebrows. Between that and the delicacy of her bone structure and her quick, nervous movements, she looked like a miniature Cleopatra.\\n\\n She said, \u0027I don\u0027t really know. I don\u0027t have very definite feelings about this, but the men seem to have talked me into it. Don\u0027t you think it\u0027s important to get the information to Earth? We\u0027ve worked out crucial effects on this trip and we need more and better ships, with computers designed to take the gravitational correction into account. We\u0027ll be able to make a single transition between the Solar System and the Neighbor Star and do it under stronger gravitational intensities so that we can start closer to the Sun and end closer to the Neighbor Star and not have to spend weeks of coasting at both ends. It seems to me that Earth has to know about this.\u0027\\n\\n Wendel said, \u0027I see. The whole point seems to me to be whether it wouldn\u0027t be wise to get the information of the gravitational correction back to Earth right now. Wu, is that really as essential as you make it appear? You didn\u0027t get the idea for the correction here on the ship. It seems to me that you discussed it with me months ago.\u0027 She thought a moment. \u0027Almost a year ago.\u0027\\n\\n \u0027We didn\u0027t really discuss it, Captain. You were impatient with me, as I recall, and wouldn\u0027t really listen.\u0027\\n\\n \u0027Yes, I\u0027ve admitted I was mistaken. But you did write it down. I told you to make up a formal report and that I would go over it when I had time.\u0027 She held up a hand. \u0027I know I never had time to go over it, and I don\u0027t even recall if I received it, but I imagine, Wu, that you - being you - would have prepared the report in some detail, and with all the reasoning and mathematics anyone could want. Didn\u0027t you do that, Wu, and isn\u0027t that report in the records?\u0027\\n\\n Wu\u0027s lips seemed to tighten, but his tone of voice did not alter in any way. \u0027Yes, I prepared the report, but it was just speculation, and I don\u0027t suppose anyone else will pay any attention to it - any more than you did, Captain.\u0027\\n\\n \u0027Why not? Not everyone is as stupid as I am, Wu.\u0027\\n\\n \u0027Even if they paid attention, it would still be nothing more than speculation. When we go back, we will be able to present proof.\u0027\\n\\n \u0027Once the speculation exists, someone will get the proof. You know how science works.\u0027\\n\\n Wu said in a slow and significant tone, \u0027Someone.\u0027\\n\\n \u0027Now we have the nature of your concern, Wu. You\u0027re not worried that Earth won\u0027t obtain a practical method of superluminal flight. You are worried that they will, but that the credit will not be yours. Isn\u0027t that right?\u0027\\n\\n \u0027Captain, there\u0027s nothing wrong with that. A scientist has every right to be concerned over matters of priority.\u0027\\n\\n Wendel positively smoldered. \u0027Have you forgotten that I am the Captain of this ship and make the decisions?\u0027\\n\\n \u0027I haven\u0027t forgotten that,\u0027 said Wu, \u0027but this is not a sailing vessel of the eighteenth century. We are all scientists, primarily, and we must make decisions in some sort of democratic fashion. If the majority wishes to return-\u0027\\n\\n \u0027Wait,\u0027 said Fisher sharply, \u0027before this continues, do you mind if I say something? I\u0027m the only one who hasn\u0027t spoken and if we\u0027re going to be democratic, I would like to take my turn on the floor. May I, Captain?\u0027\\n\\n \u0027Go ahead,\u0027 said Wendel, her right hand clenching and unclenching as though it just longed to grab someone by the throat.\\n\\n Fisher said, \u0027Just about seven and a half centuries ago, Christopher Columbus sailed westward from Spain and, eventually, discovered America, though he himself never knew that that was what he had done. En route, he made the discovery that the deviation of the magnetic compass from the true north, the so-called \"magnetic declination\", changed with longitude. This was an important finding and was, in fact, the first purely scientific discovery made in the course of a sea voyage.\\n\\n \u0027Now, how many know that Columbus discovered the variation of magnetic declination? Virtually no-one. How many know that Columbus discovered America? Virtually everyone. So suppose that Columbus, on discovering the variation, decided, midway, to go home and make the glad announcement to King Ferdinand and Queen Isabella, preserving his priority as the discoverer of the phenomenon? That discovery might conceivably have been greeted with interest and the monarchs might eventually have sent out another expedition headed, let us say, by Amerigo Vespucci, who would then have reached America. In that case, who would remember that Columbus had made some sort of discovery about the compass? Virtually no-one. Who would remember that Vespucci had discovered America? Virtually everyone.\\n\\n \u0027So do you really want to go back? The discovery of the gravitational correction will, I assure you, be remembered by a few as a small side effect of superluminal travel. But the crew of the next expedition that will actually reach the Neighbor Star, will be hailed as the first to reach a star by superluminal flight. You three, even you, Wu, will scarcely be worth a footnote.\\n\\n \u0027You might think that, as a reward for this great discovery that Wu has made, it will be you that will be sent out on a second expedition, but I\u0027m afraid not. You see, Igor Koropatsky, who is the Director of the Terrestrial Board of Inquiry and who is waiting for us back on Earth, is particularly interested in information on the Neighbor Star and its planetary system. He will explode like Krakatoa when he finds out that we were within reach of it and turned back. And of course, Captain Wendel will be forced to explain that you three had mutinied, which is an extremely serious offense, even if we are not an eighteenth-century sailing vessel. Far from going out on the next expedition, you will never see the inside of a laboratory again. Count on it. What you may see, despite your scientific eminence, is the inside of a jail. Don\u0027t underestimate Koropatsky\u0027s fury.\\n\\n \u0027So think about it, you three. On to the Neighbor Star? Or back home?\u0027\\n\\n There was a silence. For a while, no-one said anything.\\n\\n \u0027Well,\u0027 said Wendel harshly, \u0027I think that Fisher has explained the situation very clearly. Doesn\u0027t any one have anything to say?\u0027\\n\\n Blankowitz said in a low voice, \u0027Actually, I never thought it through. I think we ought to go on.\u0027\\n\\n Jarlow grunted. \u0027I think so, too.\u0027\\n\\n Wendel said, \u0027What about you, Chao-Li Wu?\u0027\\n\\n Wu shrugged. \u0027I wouldn\u0027t stand against the rest.\u0027\\n\\n \u0027I\u0027m glad to hear that. This incident is forgotten as far as the Earth authorities will be concerned, but there had better be no repetition, no further action of any kind that could be considered mutinous.\u0027\\n\\n 78\\n\\n Back in their own quarters, Fisher said, \u0027You don\u0027t mind, I hope, that I interfered. I was afraid you would explode to no effect.\u0027\\n\\n \u0027No, it was good. I wouldn\u0027t have thought of the Columbus analogy, which was perfect. Thank you, Crile.\u0027 She took his hand and squeezed it.\\n\\n He smiled briefly. \u0027I had to justify my presence on board ship somehow.\u0027\\n\\n \u0027You more than justified it. And you have no idea how disgusted I was, to have Wu act as he did when I had just finished telling you how happy I was over his findings, and over the credit he would get. I was feeling noble over my willingness to share credit, over the ethics of scientific research that gives to each his fair due, and then he puts his private pride ahead of the project.\u0027\\n\\n \u0027We\u0027re all human, Tessa.\u0027\\n\\n \u0027I know. And seeing that the man\u0027s interior has its ethical dark spots doesn\u0027t alter the fact that he has a scientific mind that is fearfully sharp.\u0027\\n\\n \u0027I\u0027m afraid I\u0027d have to admit that my own arguments were based on private desires rather than the public good, so to speak. I want to go to the Neighbor Star for reasons that have nothing to do with the project.\u0027\\n\\n \u0027I understand that. I am still grateful.\u0027 It embarrassed Fisher that there were tears in her eyes and that she had to blink them away.\\n\\n He kissed her.\\n\\n 79\\n\\n It was just a star, too faint yet to stand out in any way. In fact, Crile Fisher would have lost it were it not for the fact that he had punched in the network that zeroed in on it in concentric circles and radii.\\n\\n \u0027It looks disappointingly like a star, doesn\u0027t it?\u0027 said Fisher, his face taking on the moroseness it seemed to have when he let it fall into its natural lines.\\n\\n Merry Blankowitz, who was the only one with him at the observation panel, said, \u0027That\u0027s all it is, Crile. A star.\u0027\\n\\n \u0027I mean it looks like a faint star - and we\u0027re so close.\u0027\\n\\n \u0027Close in a manner of speaking. We\u0027re still a tenth of a light-year away, which is not really close. It\u0027s just that the Captain\u0027s cautious. I\u0027d have dragged the Superluminal in a lot closer. I wish we were a lot closer right now. I can hardly wait.\u0027\\n\\n \u0027Before this last transition, you were set to go home, Merry.\u0027\\n\\n \u0027Not really. They just talked me into it. Once you made your little speech, I felt like a complete jackass. I took it for granted that if we returned, we\u0027d all go back a second time, but, of course, you really clarified the situation. Oh, but I want to use the ND so badly.\u0027\\n\\n Fisher knew what the ND was. It was the neuronic detector. He felt the stirring himself. To detect intelligence would be to know they had come upon something that was infinitely more important than all metals, rocks, ices and vapors they could otherwise discover.\\n\\n He said hesitantly, \u0027Can you tell at this distance?\u0027\\n\\n She shook her head. \u0027No. We\u0027d have to be a lot closer. And we can\u0027t just coast in from this distance. It would take us about a year. Once the Captain is satisfied with what we can find out about the Neighbor Star from here, we\u0027ll make another transition. What I expect is that in two days at the most, we\u0027ll be within a couple of astronomic units of the Neighbor Star, and then I can start making observations and be useful. It\u0027s a drag feeling like a deadweight.\u0027\\n\\n \u0027Yes,\u0027 said Fisher dryly, \u0027I know.\u0027\\n\\n A look of concern crossed Blankowitz\u0027s face. \u0027I\u0027m sorry, Crile. I wasn\u0027t referring to you.\u0027\\n\\n \u0027You might as well have been. I might not be of any use no matter how close we come to the Neighbor Star.\u0027\\n\\n \u0027You will be useful if we detect intelligence. You\u0027ll be able to talk to them. You\u0027re a Rotorian, and we\u0027ll need that.\u0027\\n\\n Fisher smiled grimly. \u0027A Rotorian for just a few years.\u0027\\n\\n \u0027That\u0027s enough, isn\u0027t it?\u0027\\n\\n \u0027We\u0027ll see.\u0027 He changed the subject deliberately. \u0027Are you sure the neuronic detector will work?\u0027\\n\\n \u0027Absolutely sure. We could follow any Settlement in orbit just by its radiation of plexons.\u0027\\n\\n \u0027What are plexons, Merry?\u0027\\n\\n \u0027Just a name I made up, for the photon-complex characteristic of mammalian brains. We could detect horses, you know, if we\u0027re not too far away, but we can detect human brains in masses at astronomic distances.\u0027\\n\\n \u0027Why plexons?\u0027\\n\\n \u0027From \"complexity\". Someday - you\u0027ll see - someday they\u0027re going to be working on plexons not just to detect life but to study the intimate functioning of the brain. I\u0027ve made up a name for that, too - \"plexophysiology\". Or maybe \"plexoneuronics\".\u0027\\n\\n Fisher said, \u0027Do you consider names important?\u0027\\n\\n \u0027Yes, indeed. It gives you a way of speaking concisely. You don\u0027t have to say, \"that field of science that involves the relationship of this and that.\" You just say \"plexoneuronics\" - yes, that sounds better. It\u0027s a shortcut. It saves your thinking time for more important subjects. Besides-\u0027 She hesitated.\\n\\n \u0027Besides? Yes?\u0027\\n\\n The words came in a rush. \u0027If I make up a name and it sticks, that alone would get me a footnote in the history of science. You know, \"The word \u0027plexon\u0027 was first introduced by Merrilee Augina Blankowitz in 2237 on the occasion of the pioneer faster-than-light flight of the Superluminal.\" I\u0027m not likely to be mentioned anywhere else, or for any other reason, and I\u0027ll settle for that.\u0027\\n\\n Fisher said, \u0027What if you detect your plexons, Merry, and there are no human beings present?\u0027\\n\\n \u0027You mean alien life? That would be even more exciting than detecting people. But there\u0027s not much chance, really. We\u0027ve been disappointed over and over again. We thought there might be at least primitive forms of life on the Moon, on Mars, on Callisto, on Titan. It never came to anything. People have speculated on all kinds of weird life - living galaxies, living dust clouds, life on the surface of a neutron star, all sorts of things. There\u0027s no evidence for any of it. No, if I detect anything, it will be human life. I\u0027m convinced of that.\u0027\\n\\n \u0027Wouldn\u0027t you be detecting the plexons emitted by the five people on the ship? Wouldn\u0027t we drown out anything we can spot at millions of kilometers of distance?\u0027\\n\\n \u0027That is a complication, Crile. We have to balance the ND so that we five are canceled out and it has to be delicately done. Even a little leakage would wipe out anything we could detect elsewhere. Someday, Crile, automated NDs will be sent through hyperspace to all sorts of places to detect plexons. There\u0027ll be no human beings in their vicinity and that alone would make them at least a couple of orders of magnitude more sensitive than anything we can do now, with ourselves hanging around and having to be allowed for. We\u0027ll find out where intelligence exists long before we approach anyplace ourselves.\u0027\\n\\n Chao-Li Wu made his appearance. He looked at Fisher with a touch of distaste and said indifferently, \u0027How\u0027s the Neighbor Star?\u0027\\n\\n Blankowitz said, \u0027Nothing much at this distance.\u0027\\n\\n \u0027Well, we\u0027ll probably be making another transition tomorrow or the next day, and then we\u0027ll see.\u0027\\n\\n Blankowitz said, \u0027It will be exciting, won\u0027t it?\u0027\\n\\n Wu said, \u0027It will be - if we find the Rotorians.\u0027 He glanced at Fisher. \u0027But will we?\u0027\\n\\n If that were a question directed to Fisher, he did not respond to it. He merely stared at Wu expressionlessly.\\n\\n Will we? Fisher thought.\\n\\n The long wait would be over soon. \\n\\n","sourceLink":"https://allnovel.net/nemesis/page-35.html","bookId":1743,"book":{"id":1743,"title":"Nemesis","description":"Storyline: In the twenty-third century pioneers have escaped the crowded earth for life in self-sustaining orbital colonies. One of the colonies, Rotor, has broken away from the solar system to create its own renegade utopia around an unknown red star two light-years from Earth: a star named Nemesis. Now a fifteen-year-old Rotorian girl has learned of the dire threat that nemesis poses to Earth\u0027s people--but she is prevented from warning them. Soon she will realize that Nemesis endangers Rotor as well. And so it will be up to her alone to save both Earth and Rotor as--drawn inexorably by Nemesis, the death star--they hurtle toward certain disaster.\\n","cover":"https://allnovel.net/images/nemesis.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/nemesis.html","creation":"Oct 5, 2019 8:57:55 AM","modification":"Oct 5, 2019 10:16:29 AM"}}
