{"id":110939,"no":24,"title":"Page 24","content":"CONSIDERING THEIR EARLIER antagonism, I was a bit surprised to see Sonya and Robert combine their powers to create an illusion for the Dashkov brothers. It obscured their appearances, and with the addition of some fake names, the Mastrano family just assumed the guys were part of our increasingly bizarre entourage. Considering the distress and upheaval already going on in the house, a couple more people seemed the least of the Mastranos\u0027 worries.\n In playing good Moroi hosts, it wasn\u0027t enough to just cook up dinner. Emily also managed to get a feeder to come by--a sort of \"blood delivery service.\u0027 Normally, Moroi who lived outside sheltered areas and intermingled among humans had access to secret feeders living nearby. Usually, these feeders had a keeper of sorts, a Moroi who made money off the service. It was common for Moroi to simply show up at the home of the feeder\u0027s \"owner,\u0027 but in this case, Emily had made arrangements for the feeder to be brought to her house.\n She was doing it as a courtesy, the kind she\u0027d do for any Moroi guests--even ones who were delivering news she\u0027d dreaded receiving for most of her life. Little did she know just how desperately welcome blood was to the Moroi we\u0027d brought along. I didn\u0027t mind the brothers suffering a little weakness, but Sonya definitely needed blood if she was going to continue her recovery.\n Indeed, when the feeder and her keeper showed, Sonya was the first to drink. Dimitri and I had to stay out of sight upstairs. Sonya and Robert could only manage so much spirit-illusion, and hiding Robert and Victor\u0027s identities from the feeder\u0027s Moroi was imperative. Obscuring both me and Dimitri would have been too much, and considering our most-wanted status, it was essential we not take any risks.\n Leaving the brothers unsupervised made Dimitri and me nervous, but the two of them seemed too desperate for blood to attempt anything. Dimitri and I wanted to clean up anyways, since we hadn\u0027t had time for showers this morning. We flipped a coin, and I got to go first. Only, when I finished and was rummaging through my clothes, I discovered I\u0027d gone through my clean \"casual wear\u0027 supply and was down to the dress Sydney had included in the backpack. I grimaced but figured it wouldn\u0027t hurt to put the dress on for one night. We wouldn\u0027t be doing much more than waiting around for tomorrow\u0027s departure, and maybe Emily would let me do laundry before we left. After decent hair styling with a blow dryer, I finally felt civilized again.\n Sydney and I had been given a guestroom to share, and the brothers occupied another. Sonya was going to stay in Jill\u0027s room, and Dimitri had been offered the couch. I didn\u0027t doubt for a second he\u0027d be stalking the halls as the household slept and that I\u0027d be trading shifts with him. For now, he was still showering, and I crept out into the hall and peered down over a railing to check out the first floor. The Mastranos, Sonya, and the brothers were all gathered with the feeder and her keeper. Nothing seemed amiss. Relieved, I returned to my room and used the downtime to check on Lissa.\n After the initial excitement of passing her test, I\u0027d felt her calm down and had assumed she was getting much-needed sleep. But, no. She hadn\u0027t gone to bed. She\u0027d taken Eddie and Christian over to Adrian\u0027s, and I realized she was the one who\u0027d woken him up from the dream I\u0027d shared with him in the car. A skimming of her recent memories gave me a replay of what had happened since the time he left me and staggered to his door.\n \"What\u0027s going on?\u0027 he asked, looking from face to face. \"I was having a good dream.\u0027\n \"I need you,\u0027 said Lissa.\n \"I hear that from women a lot,\u0027 said Adrian. Christian made a gagging sound, but the faintest glimmer of a smile crossed Eddie\u0027s lips, despite his otherwise tough guardian- stance.\n \"I\u0027m serious,\u0027 she told him. \"I just got a message from Ambrose. He\u0027s got something important to tell us, and ... I don\u0027t know. I\u0027m still not certain of his role in everything. I want another set of eyes on him. I want your opinion.\u0027\n \"That,\u0027 Adrian said, \"is not something I hear a lot.\u0027\n \"Just hurry up and get dressed, okay?\u0027 ordered Christian.\n Honestly, it was a wonder anyone slept anymore, considering how often we were all pulled out of sleep. Adrian nonetheless did dress quickly, and despite his flippant comments, I knew he was interested in anything related to clearing my name. What I was uncertain of was whether he\u0027d tell anyone about the mess I\u0027d gotten myself into, now that I\u0027d slipped and revealed some of my true activities.\n My friends hurried over to the building they\u0027d visited before, the one where Ambrose lived and worked. The Court had woken up, and people were out and about, many undoubtedly wanting to find out about the second monarch test. In fact, a few people catching sight of Lissa called out happy greetings.\n \"I had another trial tonight,\u0027 Lissa told Adrian. Someone had just congratulated her. \"An unexpected one.\u0027\n Adrian hesitated, and I waited for him to say he\u0027d already heard that from me. I also waited for him to deliver the shocking news about my current company and whereabouts. \"How\u0027d it go?\u0027 he asked instead.\n \"I passed,\u0027 she replied. \"That\u0027s all that matters.\u0027\n She couldn\u0027t bring herself to tell him about the cheering people, those who didn\u0027t just simply support her because of the law but because they actually believed in her. Tasha, Mia, and some surprise friends from school had been among the onlookers, grinning at her. Even Daniella, there to wait for Rufus\u0027s turn, had grudgingly congratulated Lissa, seeming surprised Lissa had made it through. The whole experience had been surreal, and Lissa had simply wanted to get out of there.\n Eddie had gotten pulled away to assist other guardians, despite his protests that he was Lissa\u0027s escort. So, Christian and Tasha had ended up having to take Lissa home alone. Well, almost alone. A guardian named Ethan Moore joined them, the one Abe had teased Tasha about. Abe exaggerated some things, but he\u0027d been right this time. Ethan looked as tough as any guardian, but his kickass attitude occasionally faltered whenever he looked at Tasha. He adored her. She clearly liked him too and flirted along the way--much to Christian\u0027s discomfort. I thought it was cute. Some guys probably wouldn\u0027t go near Tasha because of her scars. It was nice to see someone who appreciated her for her character, no matter how disgusted Christian was by the thought of anyonedating his aunt. And I actually kind of liked seeing Christian so obviously tormented. It was good for him.\n Ethan and Tasha left once Lissa was securely back in her room. Within minutes, Eddie showed back up, grumbling about how they\u0027d delayed him with some \"crap task\u0027 when they knew he had better things to do. He\u0027d apparently made such a fuss that they\u0027d finally released him, so he could hurry back to Lissa\u0027s side. He made it just ten minutes before Ambrose\u0027s note arrived, which was lucky timing. Eddie would have freaked out if he\u0027d come to her room and found her gone. He would have thought Strigoi had kidnapped his charge in his absence.\n That was the series of events leading up to what was happening now: Lissa and the three guys going off to Ambrose\u0027s secret meeting.\n \"You\u0027re early,\u0027 he said, letting them in before Lissa could even knock a second time. They stood inside Ambrose\u0027s own room now, not a fancy parlor for clients. It resembled a dorm room--a very nice one. Much nicer than anything I\u0027d endured. Lissa\u0027s attention was all on Ambrose, so she didn\u0027t notice, out of the corner of her eye, Eddie quickly scanning the room. I was glad he was on his game and guessed he didn\u0027t trust Ambrose--or anyone not in our immediate circle.\n \"What\u0027s going on?\u0027 asked Lissa, as soon as Ambrose shut the door. \"Why the urgent visit?\u0027\n \"Because I have to show you something,\u0027 he said. On his bed was a pile of papers, and he took the top one. \"Remember when I said they were locking off Tatiana\u0027s belongings? Well now they\u0027re inventorying and removing them.\u0027 Adrian shifted uncomfortably--again, only something I noticed. \"She had a safe where she kept important documents--secret ones, obviously. And ...\u0027\n \"And?\u0027 prompted Lissa.\n \"And, I didn\u0027t want anyone to find them,\u0027 Ambrose continued. \"I didn\u0027t know what most of them were, but if she wanted them secret ... I just felt they should stay that way. I knew the combination, and so ... I stole them.\u0027 Guilt shone on his face, but it wasn\u0027t murderous guilt. It was guilt for the theft.\n Lissa eyed the stack eagerly. \"And?\u0027\n \"None of them have anything to do with what you\u0027re looking for ... except maybe this one.\u0027 He handed her the piece of paper. Adrian and Christian crowded around her.\n Darling Tatiana,\n I\u0027m a bit surprised to see how these latest developments have unfolded. I thought we had an understanding that the safety of our people required more than just bringing in a younger crop of guardians. We have let too many of them go to waste, particularly the women. If you took actions to force them back--and you know what I\u0027m talking about-- the guardian ranks would swell. This current law is completely inadequate, particularly after seeing how your \"training\u0027 experiment failed.\n I\u0027m equally shocked to hear that you are considering releasing Dimitri Belikov from his guards. I don\u0027t understand exactly what happened, but you cannot trust mere appearances. You may be unleashing a monster--or at the very least, a spy--in our midst, and he needs to be under much stricter guard than he currently is. In fact, your continued support of the study of spirit is troubling altogether and no doubt led to this unnatural situation. I believe there is a reason this element was lost to us for so long: our ancestors realized its danger and stamped it out. Avery Lazar stands as proof of that, and your prodigy, Vasilisa Dragomir, is certain to follow. In encouraging Vasilisa, you encourage the degradation of the Dragomir line, a line that should be allowed to fade into history with honor and not the disgrace of insanity. Your support of her may also put your own great-nephew at risk, something neither of us would like to see happen.\n I\u0027m sorry to burden you with so much condemnation. I hold you in the highest regard and have nothing but respect for the way you have so skillfully governed our people these long years. I\u0027m certain you will soon come to the appropriate decisions--though I worry others may not share my confidence in you. Said people might attempt to take matters into their own hands, and I fear for what may follow.\n The letter was typed, with no signature. For a moment, Lissa couldn\u0027t process it as a whole. She was completely consumed by the part about the Dragomir line fading into disgrace. It hit too close to the vision she\u0027d seen in the test.\n It was Christian who pulled her back. \"Well. It would seem Tatiana had enemies. But I guess that\u0027s kind of obvious at this point in the game.\u0027\n \"Who\u0027s this from?\u0027 demanded Adrian. His face was dark, furious at this thinly veiled threat to his aunt.\n \"I don\u0027t know,\u0027 said Ambrose. \"This is exactly the way I found it. Maybe she didn\u0027t even know who the sender was.\u0027\n Lissa nodded her agreement. \"There\u0027s certainly an anonymous feel to it ... and yet, at the same time, I feel like it\u0027s someone Tatiana must have known well.\u0027\n Adrian gave Ambrose a suspicious look. \"How do we know you didn\u0027t just type this yourself to throw us off?\u0027\n \"Adrian,\u0027 chastised Lissa. She didn\u0027t say it but was hoping to urge Adrian to feel out Ambrose\u0027s aura for anything she might not be able to detect.\n \"This is crazy,\u0027 said Christian, tapping the piece of paper. \"The part about rounding up dhampirs and forcing them to be guardians. What do you think that means--the \"actions\u0027 that Tatiana knows about?\u0027\n I knew because I\u0027d been tipped off about a lot of this earlier. Compulsion, Tatiana\u0027s note had said.\n \"I\u0027m not sure,\u0027 said Lissa. She reread the letter to herself. \"What about the \"experiments\u0027 part? Do you think that\u0027s the training sessions Grant did with Moroi?\u0027\n \"That was what I thought,\u0027 said Ambrose. \"But I\u0027m not sure.\u0027\n \"Can we see the rest?\u0027 asked Adrian, gesturing to the stack of papers. I couldn\u0027t tell if his suspicion was legitimate distrust of Ambrose or just the result of how upset his aunt\u0027s murder made him.\n Ambrose handed over the papers, but after going through the pages, Lissa agreed: there was nothing of use in them. The documents mostly consisted of legalese and personal correspondence. It occurred to Lissa--as it had to me--that Ambrose might not be showing everything he\u0027d found. There was no way to prove that for now. Stifling a yawn, she thanked him and left with the others.\n She was hoping for sleep, but her mind couldn\u0027t help but analyze the letter\u0027s possibilities. If it was legitimate.\n \"That letter\u0027s evidence that someone had a lot more reason to be pissed off at Tatiana than Rose did,\u0027 observed Christian as they wound their way back upstairs toward the building\u0027s exit. \"Aunt Tasha once said that anger based on calculated reason is more dangerous than anger based on blind hate.\u0027\n \"Your aunt\u0027s a regular philosopher,\u0027 said Adrian wearily. \"But everything we\u0027ve got is still circumstantial.\u0027\n Ambrose had let Lissa keep the letter, and she\u0027d folded it and put it in her jeans pocket. \"I\u0027m curious what Tasha will have to say about this. And Abe too.\u0027 She sighed. \"I wish Grant was still alive. He was a good man--and might have some insight into this.\u0027\n They reached a side exit on the main floor, and Eddie pushed the door open for them. Christian glanced over at Lissa as they stepped outside. \"How close were Grant and Serena--\u0027\n Eddie moved a fraction of a second before Lissa saw the problem, but of course, Eddie would have already been watching for problems. A man--a Moroi, actually--had been waiting among trees in the courtyard that separated Ambrose\u0027s building from the neighboring one. It wasn\u0027t exactly a secluded spot, but it was far enough off of the main paths that it often stayed deserted.\n The man moved forward and looked startled when he saw Eddie racing toward him. I was able to analyze the fight in a way Lissa couldn\u0027t. Judging by the man\u0027s angle and movement, he\u0027d been heading for Lissa--with a knife in his hand. Lissa froze in fear, an expected reaction for someone not trained to react in this situation. But when Christian jerked her back, she came to life and quickly retreated with him and Adrian.\n The attacker and Eddie were deadlocked for a moment, each trying to take the other down. I heard Lissa yell for help, but my attention was all on the fighters. The guy was strong for a Moroi and his maneuvers suggested he\u0027d been trained to fight. I doubted, however, that he\u0027d been trained since elementary school, nor did he have the muscle a dhampir did.\n Sure enough, Eddie broke through and forced the guy to the ground. Eddie reached out to pin the man\u0027s right hand and get the knife out of the equation. Moroi or not, the man was actually quite skilled with the blade, particularly when I (and probably Eddie too) noticed scarring and what looked like a bent finger on his left hand. The guy had probably gone to great extents to hone his knife-hand\u0027s reflexes. Even restrained, he was still able to snake up with the blade, aiming unhesitatingly for Eddie\u0027s neck. Eddie was too fast to let that happen and blocked the blow with his arm, which took the blade\u0027s cut. Eddie\u0027s block gave the Moroi a bit more room to move, and he bucked up, throwing Eddie off. Without missing a beat--really, this guy was impressive--the Moroi swung for Eddie again. There could be no doubt about the man\u0027s intentions. He wasn\u0027t holding back. He was there to kill. That blade was out for blood. Guardians knew how to subdue and take prisoners, but we\u0027d also been trained that when things were moving too fast, when it was an us-or-them situation--well, we made sure it was them. Eddie was faster than his opponent and was being driven by instincts pounded into us for years: stop what was trying to kill you. Eddie had no gun or knife, not at Court. When the man came at him a second time, knife again pointed straight at Eddie\u0027s neck, Eddie used the only weapon left that he could be sure would save his life.\n Eddie staked the Moroi.\n Dimitri had once jokingly commented that you didn\u0027t have to be Strigoi to be hurt by a stake through your heart. And, let\u0027s face it, a stake through the heart didn\u0027t actually hurt. It killed. Tatiana was proof. The man\u0027s knife actually made contact with Eddie\u0027s neck-- and then fell before piercing skin. The man\u0027s eyes went wide in shock and pain and then saw nothing at all. He was dead. Eddie leaned back on his heels, staring at his victim with the adrenaline-charged battle lust that followed any situation. Shouting suddenly caught his attention, and he leapt to his feet, ready for the next threat.\n What he found was a group of guardians, ones who had responded to Lissa\u0027s earlier cries for help. They took one look at the scene and immediately acted on and the conclusions their training drove them to. There was a dead Moroi and someone holding a bloody weapon. The guardians went for Eddie, throwing him against the wall and prying his stake away. Lissa shouted to them that they had it all wrong, that Eddie had saved her life and--\n \"Rose!\u0027\n Dimitri\u0027s frantic voice shocked me back to the Mastrano house. I was sitting on the bed, and he knelt before me, face full of fear as he gripped my shoulders. \"Rose, what\u0027s wrong? Are you okay?\u0027\n \"No!\u0027\n I pushed him aside and moved toward the door. \"I have to--I have to go back to Court. Now. Lissa\u0027s in danger. She needs me.\u0027\n \"Rose. Roza. Slow down.\u0027 He\u0027d caught hold of my arm, and there was no escaping from that grip. He turned me so I faced him. His hair was still damp from the shower, and the clean scent of soap and wet skin surrounded us. \"Tell me what happened.\u0027\n I quickly repeated what I\u0027d seen. \"Someone tried to kill her, Dimitri! And I wasn\u0027t there!\u0027\n \"But Eddie was,\u0027 said Dimitri quietly. \"She\u0027s okay. She\u0027s alive.\u0027 He released me, and I leaned wearily against the wall. My heart was racing, and even though my friends were safe, I couldn\u0027t shake my panic.\n \"And now he\u0027s in trouble. Those guardians were pissed--\u0027\n \"Only because they don\u0027t know the whole story. They see a dead body and a weapon, that\u0027s it. Once they get facts and testimonies, everything will be okay. Eddie saved a Moroi. It\u0027s his job.\u0027\n \"But he killed another Moroi to do it,\u0027 I pointed out. \"We\u0027re not supposed to do that.\u0027 It sounded like an obvious--and even stupid--statement, but I knew Dimitri understood what I meant. The guardians\u0027 purpose was to protect Moroi. They come first. Killing one was unimaginable. But then, so was them trying to kill each other.\n \"This wasn\u0027t a normal situation,\u0027 Dimitri affirmed.\n I tipped my head back. \"I know, I know. I just can\u0027t stand leaving her undefended. I want so badly to go back and keep her safe. Right now.\u0027 Tomorrow seemed years away. \"What if it happens again?\u0027\n \"Other people are there to protect her.\u0027 Dimitri walked over to me, and I was surprised to see a smile on his lips, in light of the grim events. \"Believe me, I want to protect her too, but we\u0027d risk our lives for nothing if we take off right now. Wait a little longer and at least risk your life for something important.\u0027\n A little of the panic faded. \"And Jill is important, isn\u0027t she?\u0027\n \"Very.\u0027\n I straightened up. Part of my brain kept trying to calm me about Lissa\u0027s attack while the other fully processed what we\u0027d accomplished here. \"We did it,\u0027 I said, feeling a smile slowly spread to my own lips. \"Against all reason ... somehow, we found Lissa\u0027s lost sister. Do you realize what this means? Lissa can have everything she\u0027s entitled to now. They can\u0027t deny her anything. Hell, she could be queen if she wanted. And Jill ...\u0027 I hesitated. \"Well, she\u0027s part of an ancient royal family. That\u0027s got to be a good thing, right?\u0027\n \"I think it depends on Jill,\u0027 said Dimitri. \"And what the after-effects of all this are.\u0027\n Guilt over potentially ruining Jill\u0027s life returned, and I stared down at my feet. \"Hey, it\u0027s okay,\u0027 he said, tilting my chin back up. His brown eyes were warm and affectionate. \"You did the right thing. No one else would have tried something this impossible. Only Rose Hathaway. You took a gamble to find Jill. You risked your life by breaking Abe\u0027s rules--and it paid off. It was worth it.\u0027\n \"I hope Adrian thinks so,\u0027 I mused. \"He thinks me leaving our \"safe house\u0027 was the stupidest thing ever.\u0027\n Dimitri\u0027s hand dropped. \"You told him about all this?\u0027\n \"Not about Jill. But I accidentally told him we weren\u0027t in West Virginia anymore. He\u0027s kept it secret, though,\u0027 I added hastily. \"No one else knows.\u0027\n \"I can believe that,\u0027 said Dimitri, though he\u0027d lost some of his earlier warmth. It was such a fleeting thing. \"He ... he seems pretty loyal to you.\u0027\n \"He is. I trust him completely.\u0027\n \"And he makes you happy?\u0027 Dimitri\u0027s tone wasn\u0027t harsh, but there was an intensity to it that put the exchange on par with a police interrogation.\n I thought about my time with Adrian: the bantering, the parties, the games, and of course, the kissing. \"Yeah. He does. I have fun with him. I mean he\u0027s infuriating sometimes--okay, a lot of the time--but don\u0027t be fooled by all the vices. He\u0027s not a bad person.\u0027\n \"I know he isn\u0027t,\u0027 said Dimitri. \"He\u0027s a good man. It\u0027s not easy for everyone to see, but I can. He\u0027s still getting himself together, but he\u0027s on his way. I saw it in the escape. And after ...\u0027 The words caught on Dimitri\u0027s tongue. \"After Siberia, he was there for you? He helped you?\u0027\n I nodded, puzzled by all these questions. Turns out they were only the warm-up for the big one.\n \"Do you love him?\u0027\n There were only a few people in the world who could ask me such insanely personal questions without getting punched. Dimitri was one of them. With us, there were no walls, but our complicated relationship made this topic surreal. How could I describe loving someone else to a man I\u0027d once loved? A man you still love, a voice whispered inside my head. Maybe. Probably. Again, I reminded myself that it was natural to carry lingering feelings for Dimitri. They would fade. They had to fade, just like his had. He was the past. Adrian was my future. \"Yeah,\u0027 I said, taking longer than I probably should have. \"I ... I do love him.\u0027\n \"Good. I\u0027m glad.\u0027 The thing was, Dimitri\u0027s face didn\u0027t look all that glad as he stared blankly out the window. My confusion grew. Why was he upset? His actions and words no longer seemed to match lately.\n I approached him. \"What\u0027s wrong?\n \"Nothing. I just want to make sure that you\u0027re okay. That you\u0027re happy.\u0027 He turned back to me, putting on a forced smile. He\u0027d spoken the truth--but not the whole truth. \"Things have been changing, that\u0027s all. It\u0027s making me reconsider so much. Ever since Donovan ... and then Sonya ... it\u0027s strange. I thought it all changed the night Lissa saved me. But it didn\u0027t. There\u0027s been so much more, more to the healing than I realized.\u0027 He started to slip into pensive mode but caught himself. \"Every day I figure out something new. Some new emotion I\u0027d forgotten to feel. Some revelation I totally missed. Some beauty I didn\u0027t see.\u0027\n \"Hey, my hair in the alley does not go on that list, okay?\u0027 I teased. \"You were in shock.\u0027\n The forced smile grew natural. \"No, Roza. It was beautiful. It\u0027s beautiful now.\u0027\n \"The dress is just throwing you off,\u0027 I said, attempting a joke. In reality, I felt dizzy under his gaze.\n Those dark, dark eyes looked at me--really looked at me, I think, for the first time since he\u0027d entered the room. A mixed expression came over him that made no sense to me. I could pick out the emotions it contained but not what caused them. Awe. Wonder. Sadness. Regret.\n \"What?\u0027 I asked uneasily. \"Why are you looking at me like that?\u0027\n He shook his head, the smile rueful now. \"Because sometimes, a person can get so caught up in the details that they miss the whole. It\u0027s not just the dress or the hair. It\u0027s you. You\u0027re beautiful. So beautiful, it hurts me.\u0027\n I felt a strange fluttering sensation in my chest. Butterflies, cardiac arrest ... it was hard to say what exactly. Yet, in that moment, I was no longer standing in the Mastrano guestroom. He\u0027d said those words before, or something very close. So beautiful, it hurts me. It was back in the cabin at St. Vladimir\u0027s, the one and only time we\u0027d had sex. He\u0027d looked at me in a very similar way, too, only there\u0027d been less sadness. Nonetheless, as I heard those words again, a door I\u0027d kept locked in my heart suddenly burst open, and with it came all the feelings and experiences and sense of oneness we\u0027d always shared. Looking at him, just for the space of a heartbeat, I had a surreal sensation wash over me, liked I\u0027d known him forever. Like we were bound ... but not in the way Lissa and I were, by a bond forced on us.\n \"Hey, guys, have you--oh.\u0027 Sydney came to a halt in the half-open doorway and promptly took two steps back. \"Sorry. I--that is--\u0027\n Dimitri and I immediately pulled back from each other. I felt warm and shaky and only then noticed how close we had been. I didn\u0027t even remember moving, but only a breath had separated us. What had happened? It was like a trance. A dream.\n I swallowed and tried to slow my pulse. \"No problem. What\u0027s going on?\u0027\n Sydney glanced between us, still looking uncomfortable. Her dating life might be non- existent, but even she knew what she\u0027d walked in on. I was glad one of us did. \"I ... that is ... I just wanted to come hang out. I can\u0027t handle that going on downstairs.\u0027 I attempted a smile, still utterly confused by my feelings. Why did Dimitri look at me like that? Why did he say that? He can\u0027t still want me. He said he didn\u0027t. He told me to leave him alone.\n \"Sure. We were just ... talking,\u0027 I said. She obviously didn\u0027t believe me. I tried harder to convince her ... and myself. \"We were talking about Jill. Do you have any ideas on how to get her to Court--seeing as we\u0027re all outlaws?\u0027\n Sydney might not be an expert in personal relationships, but puzzles were familiar territory. She relaxed, her attention focusing inward as she tried to figure our problem out.\n \"Well, you could always have her mother--\u0027\n A loud crashing from downstairs abruptly cut her off. As one, Dimitri and I sprang for the door, ready to combat whatever mess Victor and Robert had caused. We both came screeching to a halt at the top of the stairs when we heard lots of shouts for everyone to get down.\n \"Guardians,\u0027 Dimitri said. \"There are guardians raiding the house.\u0027 \n","sourceLink":"https://allnovel.net/last-sacrifice-vampire-academy-6/page-24.html","bookId":2065,"book":{"id":2065,"title":"Last Sacrifice (Vampire Academy #6)","description":"Storyline: \n Vampire Academy Series 6: Last Sacrifice \n Rose is in prison after being framed for Queen Tatiana\u0027s murder. She is then broken out of prison with the help of her dad Abe along with Lissa, Christian, and Adrian\u0027s help. She is given to Dimitri to keep her safe while they find out who did kill the queen. After Dimitri and her catch up with Sydney and go to West Virginia where they are supposed to stay and wait until Rose\u0027s friends at court find the real killer. Rose, however, wants to help and after a few escape plans finally convinces Dimitri and Sydney to help her look for Lissa\u0027s illegitimate sibling. All three of them go on adventures and are helped at the end by Robert and Victor whom Rose despises but finds useful. Rose also converts Sonya back into a moroi and she helps them find Lissa\u0027s sibling, who turns out to be Jill. Meanwhile, Lissa runs for queen to stall the elections and create chaos to give herself and her friends more time to find the true killer of Tatiana. Rose also realizes that even though she is happy with Adrian she still deeply loves Dimitri and Dimitri realizes that he has to let go of his past and enjoy life and love...\n \n","cover":"https://allnovel.net/images/last-sacrifice-vampire-academy-6.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/last-sacrifice-vampire-academy-6.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 6, 2019 12:11:54 AM"}}
