{"id":110944,"no":30,"title":"Page 30","content":"I DIDN\u0027T RUN INTO HIS arms like I usually did. How could I? After what I\u0027d done? No. I couldn\u0027t playact anymore. I still wasn\u0027t entirely sure what the future held for Dimitri and me, not until he answered my ultimatum. I did, however, know I had to cut Adrian loose. My feelings for him were still strong, and I wondered if it was even remotely possible for us to be friends. Regardless, I couldn\u0027t lead him on after sleeping with Dimitri. It hadn\u0027t been murder, no, but it had certainly been dishonorable.\n Yet ... I couldn\u0027t say any of that to Adrian now, I realized. I couldn\u0027t break up with him in a dream. That was almost as bad as a text breakup. Besides, I had a feeling that ... well, I\u0027d probably need his help. So much for honor. Soon, I swore. Soon I\u0027ll tell him.\n He didn\u0027t seem to notice my lack of embrace. But he did notice something else.\n \"Wow.\u0027\n We stood in St. Vladimir\u0027s library of all places, and I gave him a puzzled look across the study tables stretching before us. \"Wow what?\u0027 \"Your ... your aura. It\u0027s ... amazing. It\u0027s shining. I mean, it always shines, but today ... well, I\u0027ve never seen anything like it. I didn\u0027t expect that after everything that happened.\u0027\n I shifted uncomfortably. If I lit up around Dimitri normally, what on earth happened to my aura post-sex? \"After what happened?\u0027 I asked, deflecting the comment.\n He chuckled and approached me. His hand reached unconsciously for his cigarettes, paused, and then dropped to his side. \"Oh, come on. Everyone\u0027s talking about it. How you and Belikov kidnapped Jailbait--what\u0027s up with that anyway?--and coerced that Alchemist. It\u0027s the hottest news around here. Well, aside from the elections. The last test is coming up.\u0027\n \"That\u0027s right ...\u0027 I murmured. It had almost been twenty-four hours since Lissa had received the riddle. There was only a little time left, and last I knew, she had no answer.\n \"Why are you sleeping in the middle of the day anyway?\u0027 he asked. \"I didn\u0027t really expect to catch you. Figured you\u0027d be on a human schedule.\u0027\n \"It ... it was kind of a rough night, what with escaping a legion of guardians and all.\u0027\n Adrian caught hold of my hand, frowning slightly when I didn\u0027t squeeze his in return. The frown lightened quickly into his easy smile. \"Well, I\u0027d worry more about your old man than them. He is pissed that you didn\u0027t stay put. And that he can\u0027t get in to see the Alchemists. Believe me, he\u0027s been trying.\u0027\n That almost made me laugh, except it wasn\u0027t the outcome I\u0027d wanted either. \"So he\u0027s not all-powerful after all.\u0027 I sighed. \"That\u0027s what we need. Sydney. Or, well, that guy who\u0027s with her. The one who allegedly knows something.\u0027 I flashed back, again seeing the recognition on Ian\u0027s face. He knows the man who attacked Lissa and bribed Joe. \"We need him.\u0027\n \"From what I picked up,\u0027 said Adrian, \"the guardians are just kind of lingering around the hotel, mostly concerned with the Alchemists leaving. But they\u0027re controlling who\u0027s getting in. They won\u0027t let any of us--or other Alchemists--get through. There are lots of other human guests, and I guess Abe tried to disguise himself--and failed.\u0027\n Poor Zmey. \"He should have had more faith in the guardians. They aren\u0027t going to let anyone but themselves get in and out.\u0027 My own words brought me to a halt. \"That\u0027s it ...\u0027\n Adrian eyed me suspiciously. \"Oh no. I know that look. Something crazy is about to happen.\u0027\n I caught hold of his hand, now out of excitement, rather than love. \"Get to Mikhail. Have him meet us ...\u0027 I blanked. I\u0027d seen the town the Alchemists were staying in. As the closest to Court, we often drove through it. I racked my brain, trying to think of some detail. \"At that restaurant with the red sign. It\u0027s on the far side. Always advertising buffets.\u0027\n \"Easier said than done, little dhampir. They\u0027re using every guardian at Court to keep the elections under control. If Lissa hadn\u0027t been attacked, they wouldn\u0027t let your mom stay with her. I don\u0027t think Mikhail can get out.\u0027\n \"He\u0027ll find a way,\u0027 I said confidently. \"Tell him this is it--it\u0027s the key to the murder. The answer. He\u0027s resourceful.\u0027\n Adrian looked skeptical, but it was hard for him to refuse me anything. \"When?\u0027 When indeed? It was almost noon, and I hadn\u0027t paid much attention to where we\u0027d stopped. How long would it take us to reach Court? From what I knew about the elections, those who passed this last test would give speeches when the Moroi day started. In theory, they\u0027d then go straight to voting--except, if our plan worked, Lissa\u0027s involvement would slow that down for days. Provided she passed.\n \"Midnight,\u0027 I said. If I was guessing correctly, the Court would be completely wrapped up in the election drama, making it easier for Mikhail to get out. I hoped. \"Will you tell him?\u0027\n \"Anything for you.\u0027 Adrian swept me a gallant bow. \"Although, I still think it\u0027s dangerous for you to be involved directly with this.\u0027\n \"I have to do this myself,\u0027 I said. \"I can\u0027t hide.\u0027\n He nodded, as though he understood. I wasn\u0027t sure he did.\n \"Thank you,\u0027 I told him. \"Thank you so much for everything. Now go.\u0027\n Adrian gave me a crooked grin. \"Boy, you don\u0027t waste any time kicking a guy out of bed, huh?\u0027\n I flinched, the joke hitting a little too close to home. \"I want Mikhail to be prepared. And I also need to watch Lissa\u0027s last test.\u0027\n This sobered Adrian. \"Does she have a chance? Will she pass?\u0027\n \"I don\u0027t know,\u0027 I admitted. \"This is a tough one.\u0027\n \"Okay. We\u0027ll see what we can do.\u0027 He gave me a small kiss. My lips responded automatically, but my heart wasn\u0027t into it. \"And Rose? I mean it. Be careful. You\u0027re going to be awfully close to Court. Not to mention a bunch of guardians who have you on their most wanted list and will probably try to kill you.\u0027\n \"I know,\u0027 I said, choosing not to mention that there was no \"probably\u0027 about it.\n With that, he vanished, and I woke. Strangely, what I found in my own world seemed almost more dreamlike than what I\u0027d experienced with Adrian. Dimitri and I were still in bed, snuggled under the covers, our bodies and limbs still wrapped around each other. He slept with that rare peaceful look of his and almostseemed to smile. For half a second, I considered waking him and telling him we had to hit the road. A look at the clock happily squashed that thought. We still had time, plus it was getting close to the test. I had to go to Lissa and trusted Sonya would come by if we overslept.\n Sure enough, I\u0027d gauged the testing correctly. Lissa was cutting across the Court\u0027s lawns, marching like someone going to a funeral. The sun, flowers, and birds were lost on her. Even her company did little to cheer her up: Christian, my mom, and Tasha.\n \"I can\u0027t do this,\u0027 she said, staring ahead at the building that held her fate. \"I can\u0027t do this test.\u0027 The tattoo kept her from giving out any more information.\n \"You\u0027re smart. Brilliant.\u0027 Christian\u0027s arm was around her waist, and in that moment, I loved him for his confidence in her. \"You can do it.\u0027\n \"You don\u0027t understand,\u0027 she said, with a sigh. She\u0027d come up with no answers to the riddle, meaning the plan was at stake--and her desire to prove herself.\n \"For once he does,\u0027 said Tasha, a slight teasing tone in her voice. \"You can do it. You have to do it. We have so much riding on it.\u0027\n Her confidence didn\u0027t make Lissa feel better. If anything, it added to the pressure. She would fail, just like in the Council dream the chalice had shown her. She\u0027d had no answer there either. \"Lissa!\u0027\n A voice brought them to a halt, and Lissa turned to see Serena running toward them, her long athletic legs quickly covering the distance between them. \"Hi Serena,\u0027 said Lissa. \"We can\u0027t stop. The test--\u0027\n \"I know, I know.\u0027 Serena was flushed, not with exertion, but with anxiety. She proffered a piece of paper. \"I made your list. As many as I could remember.\u0027\n \"What list?\u0027 asked Tasha.\n \"Moroi that the queen was having trained, to see how well they could learn fighting.\u0027\n Tasha\u0027s eyebrows rose in surprise. She hadn\u0027t been around when they\u0027d discussed it last time. \"Tatiana was training fighters? I never heard about anything like that.\u0027 I had a feeling she would have liked to be one of the ones helping with instruction.\n \"Most didn\u0027t,\u0027 agreed Lissa, straightening the piece of paper. \"It was a big secret.\u0027\n The group crowded around to read the names, listed in Serena\u0027s neat handwriting. Christian let out a low whistle. \"Tatiana might have been open to the idea of defense but only for certain people.\u0027\n \"Yes,\u0027 agreed Tasha. \"This is definitely an A-list.\u0027\n All the names were royal. Tatiana hadn\u0027t brought in \"commoners\u0027 for her experiment. This was the elite of the elite, though as Ambrose had noted, Tatiana had gone out of her way to get a variety of ages and genders.\n \"Camille Conta?\u0027 asked Lissa in surprise. \"Never saw that coming. She was always really bad in P.E.\u0027\n \"And there\u0027s another of our cousins,\u0027 added Christian, pointing to Lia Ozera. He glanced at Tasha, who was still in disbelief. \"Did you know that?\u0027\n \"No. I wouldn\u0027t have guessed her either.\u0027\n \"Half the nominees too,\u0027 mused Lissa. Rufus Tarus, Ava Drozdov, and Ellis Badica. \"Too bad they--oh my God. Adrian\u0027s mother?\u0027 Sure enough: Daniella Ivashkov.\n \"Whoa,\u0027 said Christian. That summed up my reaction too. \"Pretty sure Adrian didn\u0027t know about that.\u0027\n \"Does she support Moroi fighting?\u0027 asked my mom, surprised as well.\n Lissa shook her head. \"No. From what I know about her, she is definitely in favor of leaving defense to dhampirs.\u0027 Neither of us could imagine beautiful and proper Daniella Ivashkov in a fight.\n \"She already hated Tatiana,\u0027 noted Tasha. \"I\u0027m sure this did lovely things for their relationship. Those two bickered all the time behind closed doors.\u0027\n An uncomfortable silence fell.\n Lissa looked at Serena. \"Did these people see the queen a lot? Would they have had access to her?\u0027\n \"Yes,\u0027 said Serena uneasily. \"According to Grant, Tatiana watched every training sessions. After he died ... she started debriefing with the students individually, to see how well they\u0027d learned.\u0027 She paused. \"I think ... I think she might have met with some the night she died.\u0027\n \"Had they progressed enough to learn to use a stake?\u0027 asked Lissa.\n Serena grimaced. \"Yes. Some better than others.\u0027\n Lissa looked back at the list, feeling ill. So much opportunity. So much motivation. Was the answer here on this piece of paper? Was the murderer right before her? Serena had said earlier that Tatiana had purposely picked people resistant to training, probably to see if the obstinate could still learn. Had she gone too far with someone? One name in particular kept scrolling across Lissa\u0027s mind.\n \"I hate to interrupt,\u0027 said my mother. Her tone and stance indicated sleuth time was over; it was back to business. \"We\u0027ve got to move, or you\u0027ll be late.\u0027\n Lissa realized my mom was right and shoved the piece of paper in her pocket. Being late to the test meant failure. Lissa thanked Serena, reassuring her that this had been the right thing to do. Then, my friends moved away quickly, feeling the press of time as they hurried toward the testing building.\n \"Damn,\u0027 muttered Lissa, in a rare show of swearing. \"I don\u0027t think that old lady\u0027ll tolerate any lateness.\u0027\n \"Old lady?\u0027 My mother laughed, surprising us all. She could move faster than everyone and was obviously restraining her pace for them. \"The one running most of the tests? You don\u0027t know who she is?\u0027\n \"How would I?\u0027 asked Lissa. \"I figured she was just someone they recruited.\u0027\n \"Not just someone. That\u0027s Ekaterina Zeklos.\u0027\n \"What?\u0027 Lissa nearly stopped but still had their time crunch in mind. \"She was ... she was the queen before Tatiana, right?\u0027\n \"I thought she retired to some island,\u0027 said Christian, just as surprised.\n \"Not sure if it was an island,\u0027 said Tasha, \"but she did step down when she thought she was too old and went off to live in luxury--and away from politics--once Tatiana was on the throne.\u0027\n Too old? That had been twenty years ago. No wonder she seemed ancient. \"If she was happy to get out of politics, then why is she back?\u0027 asked Lissa.\n My mother opened the door for all of them when they reached the building, after first peering inside for any threats. It was so instinctual for her that she continued the conversation without missing a beat. \"Because it\u0027s custom for the last monarch to test the new one--if possible. In this case, it obviously wasn\u0027t, so Ekaterina came out of retirement to do her duty.\u0027\n Lissa could barely believe that she\u0027d been chatting casually with the Moroi\u0027s last queen, a very powerful and beloved queen. As soon as her group entered the hallway, Lissa was escorted by guardians and hurried toward the testing room. Their faces showed they hadn\u0027t thought she\u0027d make it. Several spectators, also apparently worried, cheered at her appearance giving the usual shouts about Alexandra and the dragons. Lissa had no chance to respond or even say goodbye to her friends before she was practically pushed into the room. The guardians looked relieved.\n The door shut, and Lissa found herself staring once more at Ekaterina Zeklos. Seeing the old woman had been intimidating before, but now ... Lissa\u0027s anxiety doubled. Ekaterina gave her a crooked smile.\n \"I was afraid you wouldn\u0027t make it,\u0027 she said. \"Should have known better. You aren\u0027t the type to back down.\u0027\n Lissa was still starstruck and almost felt the need to ramble out an excuse, explaining about Serena\u0027s list. But, no. Ekaterina didn\u0027t care about that right now, and one didn\u0027t make excuses to someone like her anyway, Lissa decided. If you screwed up, you apologized. \"I\u0027m sorry,\u0027 said Lissa.\n \"No need to be,\u0027 said Ekaterina. \"You made it. Do you know the answer? What must a queen possess in order to truly rule her people?\u0027\n Lissa\u0027s tongue felt thick in her mouth. She didn\u0027t know the answer. It really was just like the Council dream. Investigating Tatiana\u0027s murder had taken so much time. For a strange moment, Lissa\u0027s heart burned with sympathy for that prickly queen. She\u0027d done what she thought best for the Moroi and had died for it. Lissa even felt bad now, staring at Ekaterina. This former queen had probably never expected to be taken away from her--island?--retirement and forced back into Court life. Yet, she had come when needed.\n And just like that, Lissa suddenly knew the answer.\n \"Nothing,\u0027 she said softly. \"A queen must possess nothing to rule because she has to give everything she has to her people. Even her life.\u0027\n The widening of Ekaterina\u0027s gap-toothed grin told Lissa she\u0027d answered correctly. \"Congratulations, my dear. You\u0027ve made it through to tomorrow\u0027s vote. I hope you\u0027ve got a speech ready to win over the Council. You\u0027ll have to give it in the morning.\u0027\n Lissa swayed slightly, not sure what to say now, let alone in a formal speech. Ekaterina seemed to sense how in shock Lissa was, and the smile that always seemed so mischievous turned gentle.\n \"You\u0027ll be fine. You made it this far. The speech is the easy part. Your father would be proud. All the Dragomirs before you would be.\u0027\n That nearly brought tears to Lissa\u0027s eyes, and she shook her head. \"I don\u0027t know about that. We all know I\u0027m not a real candidate. This was just ... well, kind of an act.\u0027 Somehow, she didn\u0027t feel bad admitting that in front of Ekaterina. \"Ariana\u0027s the one who deserves the crown.\u0027\n Ekaterina\u0027s ancient eyes bored into Lissa, and that smiled faded. \"You haven\u0027t heard then. No, of course you wouldn\u0027t have with how quickly this is all happening.\u0027\n \"Heard what?\u0027\n Sympathy washed over Ekaterina\u0027s face, and later, I\u0027d wonder if that compassion was because of the message she delivered or because of Lissa\u0027s reaction.\n \"Ariana Szelsky didn\u0027t pass this test ... she couldn\u0027t solve the riddle ...\u0027\n \"Rose, Rose.\u0027\n Dimitri was shaking me, and it took several seconds for me to shift from being a shocked Lissa to a startled Rose.\n \"We have to--\u0027 he began.\n \"Oh my God,\u0027 I interrupted. \"You will not believe what I just saw.\u0027\n He went rigid. \"Is Lissa okay?\u0027\n \"Yeah, fine, but--\u0027\n \"Then we\u0027ll worry about that later. Right now, we have to leave.\u0027\n I noticed then that he was fully dressed while I was still naked. \"What\u0027s going on?\u0027\n \"Sonya came by--don\u0027t worry.\u0027 The shock that my face must have shown made him smile. \"I got dressed and didn\u0027t let her come in. But she said the front desk called. They\u0027re starting to realize we had an unusual check-in. We need to get out of here.\u0027\n Midnight. We had to meet Mikhail at midnight and get the last piece of the mystery that consumed us. \"No problem,\u0027 I said, tossing the covers off me. As I did, I saw Dimitri\u0027s eyes on me, and I was kind of surprised at the admiration and hunger I saw there. Somehow, even after sex, I\u0027d kind of expected him to be detached and wear his guardian face--particularly considering our sudden urgency to leave.\n \"You see something you like?\u0027 I asked, echoing something I\u0027d said to him long ago, when he\u0027d caught me in a compromising position at school.\n \"Lots,\u0027 he said.\n The emotion burning in those eyes was too much for me. I looked away, my heart pounding in my chest as I pulled my clothes on. \"Don\u0027t forget,\u0027 I said softly. \"Don\u0027t forget ...\u0027 I couldn\u0027t finish, but there was no need.\n \"I know, Roza. I haven\u0027t forgotten.\u0027\n I slipped on my shoes, wishing I was weaker and would let my ultimatum slide. I couldn\u0027t, though. No matter what had passed between us verbally and physically, no matter how close we were to our fairy-tale ending ... there was no future until he could forgive himself.\n Sonya and Jill were ready and waiting when we emerged from our room, and something told me Sonya knew what had happened between Dimitri and me. Damned auras. Or maybe you didn\u0027t need magical powers to see that kind of thing. Maybe the afterglow just naturally showed on someone\u0027s face.\n \"I need you to make a charm,\u0027 I told Sonya, once we were on the road. \"And we have to stop in Greenston.\u0027\n \"Greenston?\u0027 asked Dimitri. \"What for?\u0027\n \"It\u0027s where the Alchemists are being held.\u0027 I had already started slinging the pieces together. Who hated Tatiana--both because of her personality and for having Ambrose? Who resented her wanting Moroi to fight Strigoi? Who feared her endorsing spirit and its dangerous effects on people, say, like Adrian? Who wanted to see a different family on the throne to support new beliefs? And who would be happy to have me locked away and out of the picture? I took a deep breath, scarcely believing what I was about to say.\n \"And it\u0027s where we\u0027re going to find proof that Daniella Ivashkov murdered Tatiana.\u0027 \n","sourceLink":"https://allnovel.net/last-sacrifice-vampire-academy-6/page-30.html","bookId":2065,"book":{"id":2065,"title":"Last Sacrifice (Vampire Academy #6)","description":"Storyline: \n Vampire Academy Series 6: Last Sacrifice \n Rose is in prison after being framed for Queen Tatiana\u0027s murder. She is then broken out of prison with the help of her dad Abe along with Lissa, Christian, and Adrian\u0027s help. She is given to Dimitri to keep her safe while they find out who did kill the queen. After Dimitri and her catch up with Sydney and go to West Virginia where they are supposed to stay and wait until Rose\u0027s friends at court find the real killer. Rose, however, wants to help and after a few escape plans finally convinces Dimitri and Sydney to help her look for Lissa\u0027s illegitimate sibling. All three of them go on adventures and are helped at the end by Robert and Victor whom Rose despises but finds useful. Rose also converts Sonya back into a moroi and she helps them find Lissa\u0027s sibling, who turns out to be Jill. Meanwhile, Lissa runs for queen to stall the elections and create chaos to give herself and her friends more time to find the true killer of Tatiana. Rose also realizes that even though she is happy with Adrian she still deeply loves Dimitri and Dimitri realizes that he has to let go of his past and enjoy life and love...\n \n","cover":"https://allnovel.net/images/last-sacrifice-vampire-academy-6.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/last-sacrifice-vampire-academy-6.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 6, 2019 12:11:54 AM"}}
