{"id":110947,"no":34,"title":"Page 34","content":"I DIDN\u0027T WAKE UP IN the world of the dead.\\n\\n I didn\u0027t even wake up in a hospital or some other type of medical center--which, believe me, I\u0027d done plenty of times. No, I woke up in luxury, in a huge bedroom with gilded furniture. Heaven? Probably not with my behaviors. My canopied bed had a red- and-gold velvet comforter, thick enough to be a mattress itself. Candles flickered on a small table against the far wall and filled the room with the scent of jasmine. I had no clue where I was or how I\u0027d gotten here, but as my last memories of pain and darkness played out in my mind, I decided the fact that I was actually breathing was good enough.\\n\\n \"Sleeping Beauty awakens.\u0027\\n\\n That voice ... that wonderful, honey-like voice with its soft accent. It enveloped me, and with it came the impossible truth and its full impact: I was alive. I was alive. And Dimitri was here.\\n\\n I couldn\u0027t see him but felt a smile come to my lips. \"Are you my nurse?\u0027\\n\\n I heard him get up from a chair and walk over. Seeing him stand over me like that reminded me of just how tall he truly was. He looked down at me with a smile of his own--one of those full and rare smiles. He had cleaned up since last I\u0027d seen him, his brown hair tied neatly back behind his neck, though he hadn\u0027t shaved for a couple days. I tried to sit up, but he tsked me back.\\n\\n \"No, no, you need to lie down.\u0027 Soreness in my chest told me he was right. My mind might be awake, but the rest of me was exhausted. I had no idea how much time had passed, but something told me my body had been fighting a battle--not with a Strigoi or anything like one, but with itself. A battle to stay alive.\\n\\n \"Then come closer,\u0027 I told him. \"I want to see you.\u0027 He considered this a moment and then kicked off his shoes. Turning on my side-- which made me wince--I managed to wiggle over a little to make room near the bed\u0027s edge. He curled up beside me. Our faces rested on the same pillow, only a couple of inches apart as we gazed at each other.\\n\\n \"Is this better?\u0027 he asked.\\n\\n \"Much.\u0027\\n\\n With his long, graceful fingers, he reached out and brushed hair from my face before tracing the edge of my cheekbone. \"How are you?\u0027\\n\\n \"Hungry.\u0027\\n\\n He laughed softly and cautiously slid his hand down to rest on my lower back, in a sort of half-embrace. \"Of course you are. I think they\u0027ve only managed to get broth into you so far. Well, that and IV fluids early on. You\u0027re probably in sugar withdrawal.\u0027\\n\\n I cringed. I didn\u0027t like needles or tubes and was glad I hadn\u0027t been awake to see them. (Tattoo needles were a different matter.) \"How long have I been out?\u0027\\n\\n \"A few days.\u0027\\n\\n \"A few days ...\u0027 I shivered, and he tugged the covers higher on me, thinking I was cold. \"I shouldn\u0027t be alive,\u0027 I whispered. Gunshots like that ... they were too fast, too close to my heart. Or in my heart? I put my hand to my chest. I didn\u0027t know precisely where I\u0027d been hit. It all ached. \"Oh Lord. Lissa healed me, didn\u0027t she?\u0027 It would have taken so much spirit. She shouldn\u0027t have done that. She couldn\u0027t afford to. Except ... why would I still feel pain? If she\u0027d healed me, she would have gone all the way.\\n\\n \"No, she didn\u0027t heal you.\u0027\\n\\n \"No?\u0027 I frowned, unable to process that. How else would I have survived? A surprising answer came to mind. \"Then ... Adrian? He\u0027d never ... after how I treated him ... no. He couldn\u0027t have ...\u0027\\n\\n \"What, you think he\u0027d let you die?\u0027\\n\\n I didn\u0027t answer. The bullets might be long gone, but thinking of Adrian still made my heart--figuratively--ache.\\n\\n \"No matter how he feels ...\u0027 Dimitri hesitated. This was a delicate topic, after all. \"Well, he wouldn\u0027t have let you die. He wanted to heal you. But he didn\u0027t either.\u0027\\n\\n I felt bad for thinking so little of Adrian. Dimitri was right. Adrian never would have abandoned me out of spite, but I was rapidly running out of options here. \"Then who? Sonya?\u0027\\n\\n \"No one,\u0027 he said simply. \"Well, you, I suppose.\u0027\\n\\n \"I ... what?\u0027\\n\\n \"People can heal without magic now and then, Rose.\u0027 There was amusement in his voice, though his face stayed sober. \"And your wounds ... they were bad. No one thought you\u0027d survive. You went into surgery, and then we all just waited.\u0027\\n\\n \"But why ...\u0027 I felt very arrogant, asking the next question. \"Why didn\u0027t Adrian or Lissa heal me?\u0027\\n\\n \"Oh, they wanted to, believe me. But in the aftermath, in the chaos ... the Court went under lockdown. They were both taken away and put under heavy protection before they could act. No one would let them near you, not when they still thought you might be a murderer. They had to be certain about Tasha first, even though her own actions were pretty damning.\u0027 It took me a moment to get past the idea that modern medicine and my body\u0027s own stamina had healed me. I\u0027d grown too used to spirit. This didn\u0027t seem possible. As I tried to wrap my mind around the concept, the rest of Dimitri\u0027s meaning hit me. \"Is Tasha ... still alive?\u0027\\n\\n His face fell even more. \"Yes. They caught her right after she shot you--before anyone else got hurt. She\u0027s detained, and more evidence has been coming in.\u0027\\n\\n \"Calling her out was one of the hardest things I\u0027ve ever done,\u0027 I said. \"Fighting Strigoi was easier than that.\u0027\\n\\n \"I know. It was hard for me to see, hard for me to believe.\u0027 There was a far-off look in his eyes, reminding me that Dimitri had known her longer than he\u0027d known me. \"But she made her choices, and all the charges against you have been dropped. You\u0027re a free woman now. More than that. A hero. Abe\u0027s bragging that it\u0027s all his doing.\u0027\\n\\n That brought my smile back. \"Of course he is. I\u0027ll probably get a bill from him soon.\u0027 I felt dizzy with both joy and astonishment. A free woman. I\u0027d been burdened with accusations and a death sentence for what felt like years, and now ... now it had all disappeared.\\n\\n Dimitri laughed, and I wanted to stay like this forever, just the two of us, sweet and unguarded. Well--maybe not exactly this. I could\u0027ve done without the pain and thick bandages I felt on my chest. He and I had had so few times alone, moments when we could really relax and openly acknowledge being in love. Things had only begun to mend between us at the end there ... and it had almost been too late. It might still be.\\n\\n \"So what now?\u0027 I asked.\\n\\n \"I\u0027m not sure.\u0027 He rested his cheek against my forehead. \"I\u0027m just so glad ... so glad you\u0027re alive. I\u0027ve been so close to losing you so many times. When I saw you on the floor, and there was so much commotion and confusion ... I felt so helpless. I realized you were right. We waste our lives with guilt and self-loathing. When you looked at me there at the end ... I saw it. You did love me.\u0027\\n\\n \"You doubted?\u0027 I meant the words jokingly, but they came out sounding offended. Maybe I was, a little. I\u0027d told him I loved him plenty of times.\\n\\n \"No. I mean, I knew then that you didn\u0027t just love me. I realized you really had forgiven me.\u0027\\n\\n \"There was nothing to forgive, not really.\u0027 I\u0027d told him that before too.\\n\\n \"I\u0027ve always believed there was.\u0027 He pulled back and looked at me again. \"And that\u0027s what was holding me back. No matter what you said, I just couldn\u0027t believe it ... couldn\u0027t believe you would forgive all the things I did to you in Siberia and after Lissa healed me. I thought you were deluding yourself.\u0027\\n\\n \"Well. It wouldn\u0027t be the first time I\u0027ve done that. But no, this time I wasn\u0027t.\u0027\\n\\n \"I know, and with that revelation ... in that split second that I knew you forgave me and that I really had your love, I was finally able to forgive myself too. All those burdens, those ties to the past ... they went away. It was like ...\u0027\\n\\n \"Being free? Flying?\u0027\\n\\n \"Yes. Except ... it came too late. This sounds crazy, but while I was looking down at you, having all these thoughts coming together in my head, it was like ... like I could see death\u0027s hand reaching for you. And there was nothing I could do. I was powerless. I couldn\u0027t help.\u0027 \"You did,\u0027 I told him. \"The last things I saw before blacking out were you and Lissa.\u0027 Well, besides the skeletal faces, but mentioning that would have killed this romantic moment. \"I don\u0027t know how I survived getting shot, how I beat the odds ... but I\u0027m pretty sure your love--both of you--gave me the strength to fight through. I had to get back to you guys. God only knows what trouble you\u0027d get into without me.\u0027\\n\\n Dimitri had no words for that and answered instead by bringing his mouth to mine. We kissed, lightly at first, and the sweetness of the moment overpowered any pain I felt. The intensity had just barely picked up when he pulled away.\\n\\n \"Hey, what gives?\u0027 I asked.\\n\\n \"You\u0027re still recovering,\u0027 he chastised. \"You might think you\u0027re back to normal, but you aren\u0027t.\u0027\\n\\n \"This is normal for me. And you know, I thought with all this freedom and self- discovery and expression of our love stuff that we could finally stop with the whole Zen master wisdom and practical advice crap.\u0027\\n\\n This got me an outright grin. \"Roza, that\u0027s not going to happen. Take it or leave it.\u0027\\n\\n I pressed a kiss to his lips. \"If it means getting you, I\u0027ll take it.\u0027 I wanted to kiss him again and prove who really did have greater self-control, but that damned thing called reality set in. \"Dimitri ... for real, what happens to us?\u0027\\n\\n \"Life,\u0027 he said easily. \"It goes on. We go on. We\u0027re guardians. We protect and maybe change our world.\u0027\\n\\n \"No pressure,\u0027 I remarked. \"But what\u0027s the \"we\u0027 and \"guardians\u0027 part? I was pretty sure we were out of that career path.\u0027\\n\\n \"Mmm.\u0027 He cupped my face, and I thought he might try another kiss. I hoped he would. \"Along with our pardons, we received our guardian status again.\u0027\\n\\n \"Even you? They believe you\u0027re not a Strigoi?\u0027 I exclaimed.\\n\\n He nodded.\\n\\n \"Huh. Even if I got my name cleared, my ideal future was that we\u0027d get filing jobs near each other.\u0027\\n\\n Dimitri moved closer to me, his eyes sparkling with a secret. \"It gets better: you\u0027re Lissa\u0027s guardian.\u0027\\n\\n \"What?\u0027 I almost pulled away. \"That\u0027s impossible. They\u0027d never ...\u0027\\n\\n \"They did. She\u0027ll have others, so they probably figured it was okay to let you hang around if someone else could keep you in line,\u0027 he teased.\\n\\n \"You\u0027re not ...\u0027 A lump formed in my stomach, a reminder of a problem that had plagued us so long ago. \"You\u0027re not one of her guardians too, are you?\u0027 It had constantly been a concern, that conflict of interest. I wanted him near me. Always. But how could we watch Lissa and put her safety first if we were worried about each other? The past was returning to torment us.\\n\\n \"No, I have a different assignment.\u0027\\n\\n \"Oh.\u0027 For some reason, that made me a little sad too, even though I knew it was the smarter choice.\\n\\n \"I\u0027m Christian\u0027s guardian.\u0027\\n\\n This time I did sit up, doctor\u0027s orders or no. Stitches tugged in my chest, but I ignored the sharp discomfort. \"But that\u0027s ... that\u0027s practically the same thing!\u0027 Dimitri sat up too and seemed to be enjoying my shock, which was really kind of cruel, seeing as I\u0027d almost died and everything. \"A little. But they won\u0027t be together every moment, especially with her going to Lehigh. He\u0027s not going ... but they\u0027ll keep coming back to each other. And when they do, so will we. It\u0027s a good mix. Besides ...\u0027 He grew serious again. \"I think you\u0027ve proved to everyone that you\u0027re willing to put her life first.\u0027\\n\\n I shook my head. \"Yeah, but no one was shooting at you. Only her.\u0027 I said it lightly, but it did make me wonder: what would I do if they were both in trouble?Trust him, a voice in my head said. Trust him to take care of himself. He\u0027ll do the same for you. I eyed Dimitri, recalling a shadow in my periphery back in the ballroom. \"You followed when I jumped in front of Lissa, didn\u0027t you? Who were you going for? Me or her?\u0027\\n\\n He studied me for several long seconds. He could have lied. He could have given the easy answer by saying he\u0027d intended to push both of us out of the way--if that was even possible, which I didn\u0027t recall. But Dimitri didn\u0027t lie. \"I don\u0027t know, Roza. I don\u0027t know.\u0027\\n\\n I sighed. \"This isn\u0027t going to be easy.\u0027\\n\\n \"It never is,\u0027 he said, pulling me into his arms. I leaned against his chest and closed my eyes. No, it wouldn\u0027t be easy, but it would be worth it. As long as we were together, it would be worth it.\\n\\n We sat like that for a long time, until a discrete knock at the half-open door broke us apart. Lissa stood in the doorway.\\n\\n \"Sorry,\u0027 she said, her face shining with joy when she saw me. \"Should have put a sock on the door. Didn\u0027t realize things were getting hot and heavy.\u0027\\n\\n \"No avoiding it,\u0027 I said lightly, clasping Dimitri\u0027s hand. \"Things are always hot with him around.\u0027\\n\\n Dimitri looked scandalized. He\u0027d never held back when we were in bed together, but his private nature wouldn\u0027t let him even hint about such matters to others. It was mean, but I laughed and kissed his cheek.\\n\\n \"Oh, this is going to be fun,\u0027 I said. \"Now that everything\u0027s out in the open.\u0027\\n\\n \"Yeah,\u0027 he said. \"I got a pretty \"fun\u0027 look from your father the other day.\u0027 He gave Lissa a quick, knowing glance and then stood up. Leaning down, he kissed the top of my head. \"I should go and let you two talk.\u0027\\n\\n \"Will you be back?\u0027 I asked as he moved to the door.\\n\\n He paused and smiled at me, and those dark eyes answered my questions and so much more. \"Of course.\u0027\\n\\n Lissa took his spot, sitting on the bed\u0027s edge. She hugged me gingerly, no doubt worried about my injuries. She then scolded me for sitting up, but I didn\u0027t care. Happiness surged through me. I was so glad she was okay, so relieved, and--\\n\\n And I had no idea how she felt.\\n\\n The bond was gone. And not like during the jail escape, when she\u0027d put the wall up. There was simply nothing there between us. I was with myself, completely and utterly alone, just as I had been years ago. My eyes widened, and she laughed.\\n\\n \"I wondered when you\u0027d notice,\u0027 she said.\\n\\n \"How ... how is this possible?\u0027 I was frozen and numb. The bond. The bond was gone. I felt like my arm had been amputated. \"And how do you know?\u0027 She frowned. \"Part of it\u0027s instinct ... but Adrian saw it. That our auras aren\u0027t connected anymore.\u0027\\n\\n \"But how? How could that happen?\u0027 I sounded crazy and desperate. The bond couldn\u0027t be gone. It couldn\u0027t.\\n\\n \"I\u0027m not entirely sure,\u0027 she admitted, her frown deepening. \"I talked about it a lot with Sonya and, uh, Adrian. We think when I brought you back the first time, it was spirit alone that held you back from the land of the dead and that kept you tied to me. This time ... you nearly died again. Or maybe you did for a moment. Only, you and your body fought your way back. It was you who got out, with no help from spirit. And once that happened ...\u0027 She shrugged. \"Like I said, we\u0027re only guessing. But Sonya thinks once your own strength broke you away, you didn\u0027t need any help being pulled back from death. You did it on your own. And when you freed yourself of spirit, you freed yourself from me. You didn\u0027t need a bond to keep you with the living.\u0027\\n\\n It was crazy. Impossible. \"But if ... if you\u0027re saying I escaped the land of the dead, I\u0027m not, like, immortal or anything, am I?\u0027\\n\\n Lissa laughed again. \"No, we\u0027re certain of that. Sonya explained it, saying anything alive can die, and as long as you\u0027ve got an aura, you\u0027re alive. Strigoi are immortal but not alive, so they don\u0027t have auras and--\u0027\\n\\n The world spun. \"I\u0027ll take your word for it. I think maybe I do need to lie down.\u0027\\n\\n \"That\u0027s probably a good idea.\u0027\\n\\n I gently eased myself onto my back. Desperately needing distraction from what I\u0027d just learned--because it was still too surreal, still impossible to process--I eyed my surroundings. The lush room was bigger than I\u0027d previously realized. It kept going and going, branching into other rooms. It was a suite. Maybe an apartment. I could just make out a living room with leather furniture and a flat screen TV. \"Where are we are?\u0027\\n\\n \"In palace housing,\u0027 she replied.\\n\\n \"Palace housing? How\u0027d we end up here?\u0027\\n\\n \"How do you think?\u0027 she asked dryly.\\n\\n \"I ...\u0027 I couldn\u0027t work my mouth for a moment. I needed no bond to realize what had happened. Another impossibility had occurred while I\u0027d been out of it. \"Crap. They had the election, didn\u0027t they? They elected you queen, once Jill was there to stand in for your family.\u0027\\n\\n She shook her head and almost laughed. \"My reaction was a little stronger than \"crap,\u0027 Rose. Do you have any idea what you\u0027ve done?\u0027\\n\\n She looked anxious, stressed, and totally overwhelmed. I wanted to be serious and comforting for her sake ... but I could feel a goofy grin spreading over my face. She groaned.\\n\\n \"You\u0027re happy.\u0027\\n\\n \"Liss, you were meant for this! You\u0027re better than any of the other candidates.\u0027\\n\\n \"Rose!\u0027 she cried. \"Running for queen was supposed to be a diversion. I\u0027m only eighteen.\u0027\\n\\n \"So was Alexandra.\u0027\\n\\n Lissa shook her head in exasperation. \"I\u0027m so sick of hearing about her! She lived centuries ago, you know. I think people died when they were thirty back then. So she was practically middle-aged.\u0027 I caught hold of her hand. \"You\u0027re going to be great. It doesn\u0027t matter how old you are. And it\u0027s not like you have to call meetings and analyze law books all on your own, you know. I mean, I\u0027m sure not going to do any of that, but there are other smart people. Ariana Szelsky didn\u0027t make the last test, but you know she\u0027ll help if you ask her to. She\u0027s still on the Council, and there are others you can rely on. We just have to find them. I believe in you.\u0027\\n\\n Lissa sighed and looked down, her hair hanging forward in a curtain. \"I know. And part of me is excited, like this will restore my family\u0027s honor. I think that\u0027s what\u0027s saved me from a total breakdown. I didn\u0027t want to be queen, but if I have to ... then I\u0027m going to do it right. I feel like ... like I have the world at my fingertips, like I can do so much good. But I\u0027m so afraid of messing up too.\u0027 She looked up sharply. \"And I\u0027m not giving up on the rest of my life either. I guess I\u0027m going to be the first queen in college.\u0027\\n\\n \"Cool,\u0027 I said. \"You can IM with the Council from campus. Maybe you can command people to do your homework.\u0027\\n\\n She apparently didn\u0027t think the joke was as funny as I did. \"Going back to my family. Rose ... how long did you know about Jill?\u0027\\n\\n Damn. I\u0027d known this part of the conversation would eventually be coming. I averted my eyes. \"Not really that long. We didn\u0027t want to stress you until we knew it was real,\u0027 I added hastily.\\n\\n \"I can\u0027t believe ...\u0027 She shook her head. \"I just can\u0027t believe it.\u0027\\n\\n I had to go on her tone, not the bond. It was so strange, like losing one of my key senses. Sight. Hearing. \"Are you upset?\u0027\\n\\n \"Of course I am! How can you be surprised?\u0027\\n\\n \"I figured you\u0027d be happy ...\u0027\\n\\n \"Happy to find out my dad cheated on my mom? Happy to have a sister I hardly know? I\u0027ve tried to talk to her, but ...\u0027 Lissa sighed again. \"It\u0027s so weird. Almost weirder than suddenly being queen. I don\u0027t know what to do. I don\u0027t know what to think of my father. And I sure as hell don\u0027t know what to do with her.\u0027\\n\\n \"Love them both,\u0027 I said softly. \"They\u0027re your family. Jill\u0027s great, you know. Get to know her. Be excited.\u0027\\n\\n \"I don\u0027t know if I can. I think you\u0027re more of a sister to me than she\u0027ll ever be.\u0027 Lissa stared off at nothing. \"And of all people ... I was convinced for so long that there was something going on between her and Christian.\u0027\\n\\n \"Well, out of all the worries in your world, that\u0027s one you can let go because it\u0027s not true.\u0027 But within her comment was something dark and sad. \"How isChristian?\u0027\\n\\n She turned back to me, her eyes full of pain. \"He\u0027s having a hard time. I am too. He visits her. Tasha. He hates what she did, but ... well, she\u0027s still his family. It hurts him, but he tries to hide it. You know how he is.\u0027\\n\\n \"Yeah.\u0027 Christian had spent a good portion of his life masking dark feelings with snark and sarcasm. He was a pro at fooling others about how he truly felt.\\n\\n \"I know he\u0027ll be better in time ... I just hope I can be there for him enough. So much is happening. College, being queen ... and always, always, there\u0027s spirit there, pressing down on me. Smothering me.\u0027 Alarm shot through me. And panic. Panic over something far worse than not knowing what Lissa was feeling or where she was. Spirit. I was afraid of spirit--and the fact that I couldn\u0027t fight it for her. \"The darkness ... I can\u0027t absorb it anymore. What will we do?\u0027\\n\\n A twisted smile crossed her lips. \"You mean, what will I do. It\u0027s my problem now, Rose. Like it always should have been.\u0027\\n\\n \"But, no ... you can\u0027t. St. Vladimir--\u0027\\n\\n \"Isn\u0027t me. And you can protect me from some things but not all.\u0027\\n\\n I shook my head. \"No, no. I can\u0027t let you face spirit alone.\u0027\\n\\n \"I\u0027m not exactly alone. I talked to Sonya. She\u0027s really good at healing charms and thinks there\u0027s a way to keep myself in balance.\u0027\\n\\n \"Oksana said the same thing,\u0027 I recalled, feeling hardly reassured.\\n\\n \"And ... there\u0027s always the antidepressants. I don\u0027t like them, but I\u0027m queen now. I have responsibilities. I\u0027ll do what I have to. A queen gives up everything, right?\u0027\\n\\n \"I guess.\u0027 I couldn\u0027t help feeling frightened. Useless. \"I\u0027m just so worried about you, and I don\u0027t know how to help you anymore.\u0027\\n\\n \"I told you: you don\u0027t have to. I\u0027ll protect my mind. Your job\u0027s to protect my body, right? And Dimitri will be around too. It\u0027ll all be okay.\u0027\\n\\n The conversation with Dimitri came back to me. Who were you going for? Me or her?\\n\\n I gave her the best smile I could. \"Yeah. It\u0027ll all be okay.\u0027\\n\\n Her hand squeezed mine. \"I\u0027m so glad you\u0027re back, Rose. You\u0027ll always be part of me, no matter what. And honestly ... I\u0027m kind of glad you can\u0027t see my sex life anymore.\u0027\\n\\n \"That makes two of us.\u0027 I laughed. No bond. No magical attachment. It was going to be so strange, but really ... did I need it? In real life, people formed bonds of another nature. Bonds of love and loyalty. We would get through this. \"I\u0027ll always be there for you, you know. Anything you need.\u0027\\n\\n \"I know,\u0027 she said. \"And actually ... I need you for something now ...\u0027\\n\\n \"Name it,\u0027 I said.\\n\\n She did. \\n\\n","sourceLink":"https://allnovel.net/last-sacrifice-vampire-academy-6/page-34.html","bookId":2065,"book":{"id":2065,"title":"Last Sacrifice (Vampire Academy #6)","description":"Storyline: Vampire Academy Series 6: Last Sacrifice \\n Rose is in prison after being framed for Queen Tatiana\u0027s murder. She is then broken out of prison with the help of her dad Abe along with Lissa, Christian, and Adrian\u0027s help. She is given to Dimitri to keep her safe while they find out who did kill the queen. After Dimitri and her catch up with Sydney and go to West Virginia where they are supposed to stay and wait until Rose\u0027s friends at court find the real killer. Rose, however, wants to help and after a few escape plans finally convinces Dimitri and Sydney to help her look for Lissa\u0027s illegitimate sibling. All three of them go on adventures and are helped at the end by Robert and Victor whom Rose despises but finds useful. Rose also converts Sonya back into a moroi and she helps them find Lissa\u0027s sibling, who turns out to be Jill. Meanwhile, Lissa runs for queen to stall the elections and create chaos to give herself and her friends more time to find the true killer of Tatiana. Rose also realizes that even though she is happy with Adrian she still deeply loves Dimitri and Dimitri realizes that he has to let go of his past and enjoy life and love...\\n","cover":"https://allnovel.net/images/last-sacrifice-vampire-academy-6.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/last-sacrifice-vampire-academy-6.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 6, 2019 12:11:54 AM"}}
