{"id":32711,"no":15,"title":"Chapter 14: Scouting On Lake Champlain.","content":"One morning, Colonel Monro sent for James. \"Captain Walsham,\" he said, \"there are rumours that the French are gathering at Crown Point in considerable force. Captain Rogers is still disabled by his wound, and his band have suffered so heavily, in their last affair with the enemy, that for the time they are out of action. It is important that I should learn the truth of these rumours, for, if they be true, I must communicate at once to the general, in order that he may get together a sufficient force to relieve us, if Montcalm comes down and lays siege to the fort. Will you undertake the business?\" \"I will do my best, sir,\" James replied. \"Do you propose that I should take all my company, or only a picked party?\" \"That I will leave to you, Captain Walsham. I want trustworthy news, and how you obtain it for me matters little.\" \"Then I will take only a small party,\" James said. \"Fifty men would be useless, for purposes of fighting, if the enemy are numerous, while with such a number it would be hopeless to attempt to escape detection by the Indians. The fewer the better for such an enterprise.\" On leaving the commandant, James at once summoned the two hunters to his hut, and told them the mission he had received. \"I am ready, captain, that is if you, and I, and Jonathan makes up the party. As to going trapezing about round Crown Point with fifty soldiers, the thing ain\u0027t to be thought of. We should be there no more than half an hour before the Indians would know of it, and we should have no show either for fighting or running away. No, captain, the lads are good enough for scouting about round camp here; but, as for an expedition of that sort, we might as well start with a drove of swine.\" \"That is just what I thought, Nat. One canoe may escape even the eyes of the Indians, but a dozen would have no chance of doing so.\" \"We might get up the lakes,\" the scout said; \"but the mischief would be in the woods. No, it never would do, captain. If we goes, it must be the three of us and no more. When do you think of starting?\" \"The sooner the better, Nat.\" \"Very well, captain, I will go and get some grub ready, and, as soon as it gets dusk, we will get the canoe into the water.\" \"I suppose you can\u0027t take me with you?\" Lieutenant Edwards said, when James told him of the duty he had been requested to perform. \"It is dismal here.\" \"Not exactly,\" James laughed. \"What would become of the company, if it were to lose its two officers and its two scouts at a blow! No, Edwards, you will command during my absence, and I think you will soon have more lively times here, for, if it be true that Montcalm will himself command the troops coming against us, it will be a different business altogether from the last. And now, leave me alone for an hour. I have some letters to write before I start. They will be for you to send off, in case we don\u0027t come back again. \"Don\u0027t look serious, I have no intention of falling into the hands of Montcalm\u0027s savages. Still, there is no doubt the expedition is a risky one, and it is just as well to be prepared.\" Just as the sun was setting, Nat came into the officer\u0027s hut. \"Everything is ready, captain,\" he said. \"I hope you have made a good dinner, for it\u0027s the last hot meal you will eat, till you get back. I have cooked enough meat for the next four days, and that\u0027s about as long as it will keep good; after that, dried deer\u0027s flesh will have to do for us. \"I expect, I tell you, we shall have to be pretty spry this time. If they are coming down in force, they are sure to send a lot of their Indians through the woods on each side of the lake, and the water will be swarming with their canoes. Jonathan and I have been talking it over, and trying to settle which would be the safest, to foot it all the way, or to go by water. We concluded, as there ain\u0027t much difference, and the canoe will be the quickest and easiest, so we had best keep to that plan.\" \"I would certainly rather go that way, Nat, if you think that the danger is no greater.\" \"No, I don\u0027t think there\u0027s much difference, captain. At any rate, we may as well go that way. Like enough, we shall have to tramp back by the woods.\" Half an hour later, the canoe put out. Although they had little fear that any of the Indian canoes would be so far up Lake George, there was scarce a word spoken in the boat for some hours after starting. Jonathan was always silent, and Nat, although talkative enough when in camp, was a man of few words when once embarked upon a serious expedition. As for James, he had little inclination for conversation. The enterprise was, he knew, one of extreme danger. Had it been only a French force he was about to reconnoitre, or even one composed of French and Canadians together, he would have thought little of it; but he knew that the redskins would be roaming thickly in the forest, ahead of the army, and, much as he relied upon the skill and experience of the two scouts, he knew it would be difficult, indeed, to elude their watchful eyes. He thought of the letters he had been writing, and wondered whether he should return to tear them up, or whether they would be read at home. All the time he was thinking, he worked his paddle vigorously, and at a high rate of speed. The light canoe bounded noiselessly over the water, impelled by three vigorous pairs of arms. When they approached the narrows connecting Lake George with Lake Champlain, the boat\u0027s head was directed towards the shore, for they could not get past Ticonderoga before daylight broke; and it was likely that a good watch would be kept, in the narrows, by the enemy; and it would be dangerous to try to effect a landing there. The canoe was carried ashore, and hidden in some bushes, and all lay down to sleep. When day broke, Nat rose and went down to the water to see that, in landing, they had left no mark upon the shore, which might betray them to the eye of a passing redskin. Going down on his hands and knees, he obliterated every sign of their footprints, raised the herbage upon which they had trodden, cut short to the ground such stalks as they had bruised or broken in their passage, and then, when confident that all was safe, he returned to his camp. When it again became dark, the canoe was carried down and replaced in the water, and they continued their passage. James had, at Nat\u0027s request, laid by his paddle. \"You paddle wonderfully well, captain. I don\u0027t say you don\u0027t; but for a delicate piece of work like this, one can\u0027t be too careful. It ain\u0027t often I can hear your paddle dip in the water, not once in a hundred times, but then, you see, that once might cost us our scalps. We have got to go along as silent as a duck swimming. Speed ain\u0027t no object, for we shall be miles down Lake Champlain before daylight; but, if the French know their business, they will have half a dozen canoes in these narrows, to prevent us scouting on Lake Champlain; and, you see, they have got all the advantage of us, \u0027cause they\u0027ve got just to lie quiet and listen, and we have got to row on. As far as seeing goes, I can make them out as soon as they can make us out; but they can hear us, while they won\u0027t give our ears a chance. \"I tell you, captain, I don\u0027t expect to get through this narrows without a chase for it. If it come to running, of course you will take your paddle again, and we three can show our heels to any canoe on the lakes, perviding of course as it\u0027s only a starn chase. If there are three or four of them, then I don\u0027t say as it won\u0027t be a close thing.\" James accordingly lay quietly back in the boat, while his companions took the paddles. It was not necessary for him either to look out, or to listen, for he knew that his companions\u0027 eyes and ears were quicker than his own. It had been agreed, before starting, that they should go along close to the trees, on the left-hand side of the passage, because the keenest lookout would be kept on the right-hand side, as that would naturally be chosen by any boat going up, as being farthest from the French fort. \"There is no fear, whatever, of our being seen from the land,\" Nat had said. \"The redskins would know that so well that they wouldn\u0027t trouble to look out. It\u0027s only canoes we have got to be afraid of, and, as to them, it\u0027s just a chance. They might see us out in the light waters, in the middle; but, under the trees, they can\u0027t make us out thirty yards off. They will be lying there, quiet, if they are there at all, and we shall either get past them safe, or we shall pretty nigh run into them. It\u0027s just chance, and there\u0027s nothing to do for it but to paddle as noiselessly as fish, and trust to our luck.\" Having crossed the lake to the left shore, they entered the narrows. The paddles were dipped so quietly into the water, that even James could scarcely hear their sound. Every few strokes the scouts stopped paddling altogether, and sat listening intently. They were keeping close to the trees, so close that, at times, it seemed to James that, by stretching out his hands, he could touch the bushes. After an hour\u0027s paddling they stopped longer than usual. \"What is it?\" James whispered in Jonathan\u0027s ear, for Nat had taken the bow paddle. \"There are men ahead,\" the scout whispered back. \"We heard them speak just now.\" Presently the boat began to move again, but so quietly, that it was only by looking at the dark masses of the boughs, that stretched out overhead, that James knew the boat was in motion. Jonathan now crouched in the bottom of the boat, and placed his hand on Nat\u0027s shoulder as a sign for him to do the same. The time seemed endless to James, as he lay there. It was too dark, under the trees, for him even to see the outline of Nat\u0027s figure. The boat was, he was sure, moving; for occasionally, as he lay on his back, it grew lighter overhead, as they passed under openings in the trees. Suddenly his heart gave a bound, and he nearly started, for a guttural voice spoke, seemingly within a few feet of the canoe. He placed his hand on his rifle, in readiness to sit up and fire, but all was still again. It was a passing remark, made by one redskin to another; in a canoe, for the sound was to his right. Another long period passed, and then Jonathan sat up and took to his paddle again, and James judged that the danger was over. Raising his head, he could see nothing except the vague light of the sheet of water on his right. The boat was still keeping close under the trees, on the left shore of the lake, and he lay back again, and dozed off to sleep. He was awoke by Jonathan touching his foot. \"You can take your paddle now, captain.\" He sat up at once, and looked round. They were far out now, on a broad sheet of water. There were some faint lights, as of fires burning low, high up to the left behind them; and he knew that they had already passed Ticonderoga, and were making their way along Lake Champlain. They paddled for some hours, and then landed on the right-hand side of the lake. \"We are not likely to be disturbed here,\" Nat said, as they lifted the canoe from the water. \"The Indians, coming down from Crown Point, would keep on the other side of the lake. They will all make for Ticonderoga, and will not think of keeping a lookout for anyone, as far down the lakes as this.\" \"That was a close shave with that canoe, Nat. It startled me, when I heard the voice close to us. They must have been within ten yards of us.\" \"About that,\" Nat said. \"It was lucky they spoke when we were coming along. I expect they had been watching for some nights, and hadn\u0027t much idea anyone would come, or else they wouldn\u0027t have spoken. As it was, it was easy enough to pass them, on such a dark night. Of course, they were looking outside, and I just kept along as close as I could to the bushes, only just giving a light stroke, now and then, to take her along. Being inside them, I got a sight of \u0027em some distance away, but I knew they couldn\u0027t see us, sharp as their eyes are. The only chance was their hearing, and, as there was no noise for them to hear, I felt safe enough after I had once caught sight of \u0027em, and saw they were lying out at the edge of the shadow. \"If they had been close under the bushes, as they ought to have been, we should have been in for a fight; for we mightn\u0027t have seen each other till the boats touched. Let that be a lesson to you, captain. When you are on the lookout for a canoe, at night, lie in among the bushes. It must pass between you and the light, then, and as they can\u0027t see you, you can either grapple or shoot, just as you like. \"If they had a seen us, we should have had a hot time, for I could hear by their calls, right along the other side, that they were looking out for us in earnest, and, if a rifle had been fired, we should have had half a dozen canoes down upon us in no time; and, like enough, should have had to leave the boat, and take to the woods.\" \"How far is Crown Point away?\" \"Not more than ten miles,\" Nat said. \"It is thirty miles from Ticonderoga. It lies out on a point, just where Champlain widens out. I reckon our safest way, tonight, will be to scout along this side, till we are well past the point; then to paddle out well across the lake, and come up again, and land to the left of Crown Point. We shall then be in the track of boats coming up from the lower end of the lake, and can paddle boldly on. No one would be keeping any lookout that way. Our danger won\u0027t begin until we get ashore; in course, then we must act according to sarcumstances.\" This manoeuvre was carried out. They started as soon as it became dark, and, after paddling along the eastern shore for nearly three hours, struck out into the wide lake till they approached the opposite shore, and then, heading south again, paddled boldly down towards the spot where, at the end of a sweep of land, which seemed to close in the lake, stood the French fort of Crown Point. Before starting, the two scouts had stripped to the waist, had laid aside their caps, and, fastening a strip of leather round their heads, had stuck some feathers into it. They then painted their faces and bodies. \"You needn\u0027t be particular about the flourishes, Jonathan. It\u0027s only the redskin outline as one wants to get. If we run against any other canoes coming up the lake, or they get sight of us as we near the shore; so as we look something like redskins, that\u0027s near enough. Of course, we can both speak Mohawk well enough to pass muster, and the captain will lay himself down in the bottom. \"Captain, you will do well enough for a Canadian when we have once landed. There ain\u0027t much difference between a hunter one side of the frontier and the other, but it\u0027s as well that you shouldn\u0027t be seen till we land. The less questions asked, the better. Our Mohawk\u0027s good enough with any of the other tribes, but it wouldn\u0027t pass with a Mohawk, if we got into a long talk with him.\" Fortunately, however, these precautions proved unnecessary. No other canoes were seen on the lake, and they landed, unnoticed, at a spot a mile and a half to the west of Crown Point. Before starting from Fort William Henry, James had laid aside his uniform, and had dressed himself in hunting shirt and leggings, similar to those worn by the scouts. He had adopted various little details, in which the Canadian hunters differed from those on the English side of the frontier. The latter wore their hunting shirts loose in Indian fashion, while the Canadians generally wore a leathern belt outside theirs, at the waist. His cap was made of squirrels\u0027 skins, which would pass equally well on both sides of the frontier. The fire bag, in which tobacco, tinder, and other small matters were carried, was of Indian workmanship, as was the cord of his powder horn and bullet pouch. Altogether, his get-up was somewhat brighter and more picturesque than that of English scouts, who, as a rule, despised anything approaching to ornament. He knew that by disguising himself he would be liable, if captured, to be shot at once as a spy; but this could not be considered, under the circumstances, to add to the risk he ran, for, in any case, he was certain to be killed if detected, and it would have been out of the question to attempt to approach the French camp in the uniform of a British officer. Could he have spoken Canadian French, the mission would have been comparatively easy, but he knew only a few words of the language, and would be detected the instant he opened his lips. The canoe was hauled up and carefully concealed on land, and then they lay down until daylight; for no information, as to the strength of the enemy, could be gained in the dark. In the morning, the two scouts very carefully made their toilet. They had brought all necessaries with them; and soon, in their Indian hunting shirts and fringed leggings, and with carefully-painted faces, they were in a position to defy the keenest scrutiny. When, after a careful survey of each other, they felt that their disguise was complete, they moved boldly forward, accompanied by James. After half an hour\u0027s walking they emerged from the forest, and the strong fort of Crown Point lay before them. It was constructed of stone, and was capable of withstanding a long siege, by any force which could be brought against it. Round it was the camp of the French troops, and James judged, from the number of tents, that there must be some 1500 French soldiers there. A short distance away were a large number of roughly-constructed huts, roofed with boughs of trees. \"Them\u0027s the Canadians,\" Jonathan said. \"The redskins never build shelters while on the war path. There are a heap of redskins about.\" These, indeed, even at the distance of several hundred yards, could be easily distinguished from their white allies, by their plumed headdresses, and by the blankets or long robes of skins which hung from their shoulders. \"I should put them down at three thousand.\" \"It is a big army,\" Nat said. \"I should think there must be quite as many Canadians as French. How many redskins there are, there ain\u0027t no knowing, but we may be sure that they will have got together as many as they could. Put \u0027em down at 4000, and that makes 7000 altogether, enough to eat up Fort William Henry, and to march to Albany--or to New York, if they are well led and take fancy to it--that is, if the colonists don\u0027t bestir themselves smartly. \"Well, so far you have found out what you came to seek, captain. What\u0027s the next thing?\" \"We must discover, if we can, whether they mean to go up the lakes in boats, or to march through the woods,\" James replied. \"They will have a tremendous job getting any guns through the woods, but, if they are going by water, of course they can bring them.\" \"Very well,\" Nat replied. \"In that case, captain, my advice is, you stop in the woods, and Jonathan and I will go down past the fort to the shore, and see what provision they are making in that way. You see, the place swarms with Canadians, and you would be sure to be spoken to. Redskins don\u0027t talk much to each other, unless there is some need for words, and we can go right through the French camp without fear. The only danger is of some loping Mohawk coming up to us, and I don\u0027t reckon there are many of \u0027em in the camp, perhaps nary a one.\" Although James did not like his followers to go into danger, without his sharing it, he saw that his presence would enormously add to their risks, and therefore agreed to their plan. Withdrawing some distance into the wood, and choosing a thick growth of underwood, he entered, and lay down in the bushes, while the two scouts walked quietly away towards the camp. Two hours passed. Several times he heard footsteps in the wood near him, and, peering through the leaves, caught sight of parties of Indians going towards the camp, either late arrivals from Montreal, or bands that had been out scouting or hunting. At the end of the two hours, to his great relief, he saw two figures coming from the other way through the woods, and at once recognized the scouts. He crawled out and joined them, as they came up. \"Thank God you are back again! I have been in a fever, all the time you have been away.\" \"I wish I had known the precise place where you were hiding. I should have made a sign to you to keep quiet; but it ain\u0027t of no use, now.\" \"What\u0027s the matter then, Nat?\" \"I ain\u0027t quite sure as anything is the matter,\" the scout replied; \"but I am feared of it. As bad luck would have it, just as we were coming back through the camp, we came upon a Mohawk chief. He looked hard at us, and then came up and said: \"\u0027The Owl thought that he knew all his brothers; but here are two whose faces are strange to him.\u0027 \"Of course, I told him that we had been living and hunting, for years, in the English colony, but that, hearing that the Mohawks had joined the French, we had come to fight beside our brothers. He asked a few questions, and then passed on. But I could see the varmin was not satisfied, though, in course, he pretended to be glad to welcome us back to the tribe. So we hung about the camp for another half hour, and then made a sweep before we came out here. I didn\u0027t look round, but Jonathan stooped, as if the lace of his moccasin had come undone, and managed to look back, but, in course, he didn\u0027t see anything.\" \"Then you have no reason to believe you are followed, Nat?\" \"Don\u0027t I tell you I have every reason?\" Nat said. \"If that redskin, the Owl, has got any suspicion--and suspicion you may be sure he\u0027s got--he won\u0027t rest till he\u0027s cleared the matter up. He is after us, sure enough.\" \"Then had we not better make for the canoe at full speed?\" \"No,\" Nat said. \"If they are behind us, they will be watching our trail; and if they see we change our pace, they will be after us like a pack of wolves; while, as long as we walk slowly and carelessly, they will let us go. If it were dark, we might make a run for it, but there ain\u0027t no chance at present. If we took to the lake, we should have a hundred canoes after us, while the woods are full of Indians, and a whoop of the Owl would bring a hundred of them down onto our track.\" \"Why shouldn\u0027t the Owl have denounced you at once, if he suspected you?\" James asked. \"Because it ain\u0027t redskin nature to do anything, till you are sure,\" the scout replied. \"There is nothing a redskin hates so much as to be wrong, and he would rather wait, for weeks, to make sure of a thing, than run the risk of making a mistake. I don\u0027t suppose he takes us for whites. He expects we belong to some other tribe, come in as spies.\" \"Then what are you thinking of doing?\" James asked. \"We will go on a bit further,\" Nat said, \"in hopes of coming across some stream, where we may hide our trail. If we can\u0027t find that, we will sit down, before long, and eat as if we was careless and in no hurry.\" For a time, they walked on in silence. \"Do you think they are close to us?\" James asked, presently. \"Not far away,\" the scout said carelessly. \"So long as they see we ain\u0027t hurrying, they will go easy. They will know, by this time, that we have a white man with us, and, like enough, the Owl will have sent back for one or two more of his warriors. Likely enough, he only took one with him, at first, seeing we were but two, and that he reckoned on taking us by surprise; but, when he saw you joined us, he would send back for perhaps a couple more.\" \"Then what I would suggest,\" James said, \"is, that we should at once stroll down to our canoe, put it in the water, and paddle out a few hundred yards, and there let down the lines we have got on board, and begin to fish. As long as we are quiet there, the redskins may not interfere with us, and, when it gets dark, we can make off. At the worst, we have a chance for it, and it seems to me anything would be better than this sort of wandering about, when we know that, at any time, we may have them down upon us.\" \"Perhaps that is the best plan,\" Nat said. \"What do you think, Jonathan?\" Jonathan gave an assenting grunt, and they turned their faces towards the lake, still walking at the same leisurely pace. Not once did any of the three look back. As they neared the water, James found the temptation very strong to do so, but he restrained it, and sauntered along as carelessly as ever. The canoe was lifted from its hiding place and put in the water. As they were about to step in, the bushes parted, and the Owl stood beside them. \"Where are my brothers going?\" he asked quietly. \"We are going fishing,\" Nat answered. \"The noise in the woods will have frightened game away.\" \"There is food in the camp,\" the Owl said. \"The French give food to their brothers, the redskins.\" \"My white brother wants fish,\" Nat said quietly, \"and we have told him we will catch him some. Will the Owl go with us?\" The Indian shook his head, and in a moment the canoe put off from the shore, the Indian standing, watching them, at the edge of the water. \"That\u0027s a badly puzzled redskin,\" Nat said, with a low laugh. \"His braves have not come up yet, or he would not have let us start. \"There, that is far enough. We are out of the range of Indian guns. Now, lay in your paddles, and begin to fish. There are several canoes fishing further out, and the redskin will feel safe. He can cut us off, providing we don\u0027t go beyond them.\" The Indian was, as Nat had said, puzzled. That something was wrong he was sure; but, as he was alone, he was unable to oppose their departure. He watched them closely, as they paddled out, in readiness to give a war whoop, which would have brought down the fishing canoes outside, and given warning to every Indian within sound of his voice; but, when he saw them stop and begin to fish, he hesitated. If he gave the alarm, he might prove to be mistaken, and he shrank from facing the ridicule which a false alarm would bring upon him. Should they really prove, as he believed, to be spies, he would, if he gave the alarm, lose the honour and glory of their capture, and their scalps would fall to other hands--a risk not to be thought of. He therefore waited, until six of his braves came up. He had already retired among the trees, before he joined them; but the canoe was still visible through the branches. \"The men we tracked have taken to the water. They are fishing. The Owl is sure that they are not of our tribe; but he must wait, till he sees what they will do. Let three of my brothers go and get a canoe, and paddle out beyond them, and there fish. I will remain with the others here. If they come back again, we will seize them. If they go out further, my brothers will call to the redskins in the other canoes, and will cut them off. The Owl and his friends will soon be with them.\" \"There is another canoe coming out, Nat,\" James said. \"Hadn\u0027t we better make a run for it, at once?\" \"Not a bit of it, captain. Dear me, how difficult it is to teach men to have patience! I have looked upon you as a promising pupil; but there you are, just as hasty and impatient as if you had never spent a day in the woods. Where should we run to? We must go up the lake, for we could not pass the point, for fifty canoes would be put out before we got there. We couldn\u0027t land this side, because the woods are full of redskins; and if we led them for ten miles down the lake, and landed t\u0027other side, scores of them would land between here and there, and would cut us off. \"No, lad; we have got to wait here till it\u0027s getting late. I don\u0027t say till it\u0027s dark, but till within an hour or so of nightfall. As long as we show no signs of going, the chances is as they won\u0027t interfere with us. It\u0027s a part of redskin natur to be patient, and, as long as they see as we don\u0027t try to make off, they will leave us alone. That\u0027s how I reads it. \"You agrees with me, Jonathan? \"In course, you do,\" he went on, as his companion grunted an assent. \"I don\u0027t say as they mayn\u0027t ask a question or so; but I don\u0027t believe as they will interfere with us. \"There is a fish on your line, captain. You don\u0027t seem, to me, to be attending to your business.\" James, indeed, found it difficult to fix his attention on his line, when he knew that they were watched by hostile eyes, and that, at any moment, a conflict might begin. The canoe that had come out last had shaped its course so as to pass close to those fishing outside them, and a few words had been exchanged with the occupants of each--a warning, no doubt, as to the suspicious character of the fishing party near them. Beyond this, nothing had happened. The Indians in the canoe had let down their lines, and seemed as intent as the others upon their fishing. The hours passed slowly. Under other circumstances, James would have enjoyed the sport, for the fish bit freely, and a considerable number were soon lying in the canoe. Nat and Jonathan appeared as interested in their work as if no other boat, but their own, were afloat on the lake. Never once did James see them glance towards the canoes. They did not talk much, but when they spoke, it was always in the Indian tongue. The time seemed endless, before the sun began to sink beyond the low hills on their left. It was an intense relief, to James, when Nat said at last: \"The time is just at hand now, cap. The redskins are tired of waiting. At least, they think that they had better not put it off any longer. They know, as well as we do, that it won\u0027t do to wait till it gets dark. \"Do you see that canoe, that came out last, is paddling down towards us? It looks as if it were drifting, but I have seen them dip a paddle in, several times. The others are pulling up their lines, so as to be in readiness to join in. Get your piece ready to pick up, and aim the moment I give the word. They think they are going to surprise us, but we must be first with them. Go on with your fishing, and just drop your line overboard, when you pick up your gun.\" The canoe approached slowly, until it was within thirty yards. James and his companions went on with their fishing, as if they did not notice the approach of the other canoe, until one of the Indians spoke. \"Have my Indian brothers caught many fish?\" \"A goodish few,\" Nat replied. \"One or two of them are large ones. \"See here,\" and he stooped as if to select a large fish. \"Now,\" he said suddenly. In an instant, the three rifles were levelled to the shoulder, and pointed at the Indians. The latter, taken completely by surprise, and finding themselves with three barrels levelled at them, as by one accord dived overboard. \"Now your paddles,\" Nat exclaimed. Three strokes sent the canoe dancing up to that which the Indians had just left. It struck it on the broadside, and rolled it instantly over. \"Those redskin guns are out of the way, anyhow,\" Nat said. \"Now we have got to row for it.\" He gave a sharp turn to the canoe as he spoke, and it bounded away towards the right, thereby throwing those outside it on their quarter. Simultaneously with the upset of the canoe, half a dozen rifles rang out from the shore, an Indian war whoop rose at the edge of the woods, and, a minute later, half a dozen canoes shot out from shore. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3103/85485.html","bookId":941,"book":{"id":941,"title":"With Wolfe in Canada","description":"简介： In the present volume I have endeavoured to give the details of the principal events in a struggle whose importance can hardly be overrated. At its commencement the English occupied a mere patch of land on the eastern seaboard of America, hemmed in o...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3103","creation":"Aug 1, 2019 12:23:56 AM","modification":"Aug 1, 2019 12:23:56 AM"}}
