{"id":3953,"no":14,"title":"Chapter 14","content":"Pinocchio, not having listened to the good adviceof the Talking Cricket, falls into the hands of the Assassins \"Dear, oh, dear! When I come to think of it,\" said theMarionette to himself, as he once more set out on hisjourney, \"we boys are really very unlucky. Everybodyscolds us, everybody gives us advice, everybody warns us.\n 　　If we were to allow it, everyone would try to be fatherand mother to us; everyone, even the Talking Cricket.\n 　　Take me, for example. Just because I would not listen tothat bothersome Cricket, who knows how many misfortunesmay be awaiting me! Assassins indeed! At leastI have never believed in them, nor ever will. To speaksensibly, I think assassins have been invented by fathersand mothers to frighten children who want to run awayat night. And then, even if I were to meet them onthe road, what matter? I\u0027ll just run up to them, and say,`Well, signori, what do you want? Remember that youcan\u0027t fool with me! Run along and mind your business.\u0027\n 　　At such a speech, I can almost see those poor fellowsrunning like the wind. But in case they don\u0027t run away,I can always run myself. . .\"Pinocchio was not given time to argue any longer, for he thoughthe heard a slight rustle among the leaves behind him.\n 　　He turned to look and behold, there in the darknessstood two big black shadows, wrapped from head to footin black sacks. The two figures leaped toward him assoftly as if they were ghosts.\n 　　\"Here they come!\" Pinocchio said to himself, and,not knowing where to hide the gold pieces, he stuck allfour of them under his tongue.\n 　　He tried to run away, but hardly had he taken a step,when he felt his arms grasped and heard two horrible,deep voices say to him: \"Your money or your life!\"On account of the gold pieces in his mouth, Pinocchiocould not say a word, so he tried with head and handsand body to show, as best he could, that he was only apoor Marionette without a penny in his pocket.\n 　　\"Come, come, less nonsense, and out with your money!\"cried the two thieves in threatening voices.\n 　　Once more, Pinocchio\u0027s head and hands said, \"I haven\u0027ta penny.\"\"Out with that money or you\u0027re a dead man,\" said thetaller of the two Assassins.\n 　　\"Dead man,\" repeated the other.\n 　　\"And after having killed you, we will kill your father also.\"\"Your father also!\"\"No, no, no, not my Father!\" cried Pinocchio, wild with terror;but as he screamed, the gold pieces tinkled together in his mouth.\n 　　\"Ah, you rascal! So that\u0027s the game! You have themoney hidden under your tongue. Out with it!\"But Pinocchio was as stubborn as ever.\n 　　\"Are you deaf? Wait, young man, we\u0027ll get it fromyou in a twinkling!\"One of them grabbed the Marionette by the nose andthe other by the chin, and they pulled him unmercifullyfrom side to side in order to make him open his mouth.\n 　　All was of no use. The Marionette\u0027s lips might havebeen nailed together. They would not open.\n 　　In desperation the smaller of the two Assassins pulledout a long knife from his pocket, and tried to pry Pinocchio\u0027smouth open with it.\n 　　Quick as a flash, the Marionette sank his teeth deepinto the Assassin\u0027s hand, bit it off and spat it out. Fancyhis surprise when he saw that it was not a hand, but acat\u0027s paw.\n 　　Encouraged by this first victory, he freed himself fromthe claws of his assailers and, leaping over the bushesalong the road, ran swiftly across the fields. His pursuerswere after him at once, like two dogs chasing a hare.\n 　　After running seven miles or so, Pinocchio was well-nigh exhausted. Seeing himself lost, he climbed up agiant pine tree and sat there to see what he could see.\n 　　The Assassins tried to climb also, but they slipped and fell.\n 　　Far from giving up the chase, this only spurred them on.\n 　　They gathered a bundle of wood, piled it up at thefoot of the pine, and set fire to it. In a twinkling thetree began to sputter and burn like a candle blown bythe wind. Pinocchio saw the flames climb higher andhigher. Not wishing to end his days as a roasted Marionette, he jumped quickly to the ground and off he went,the Assassins close to him, as before.\n 　　Dawn was breaking when, without any warning whatsoever,Pinocchio found his path barred by a deep pool fullof water the color of muddy coffee.\n 　　What was there to do? With a \"One, two, three!\"he jumped clear across it. The Assassins jumped also,but not having measured their distance well--splash!!!--they fell right into the middle of the pool. Pinocchiowho heard the splash and felt it, too, cried out, laughing,but never stopping in his race:\n 　　\"A pleasant bath to you, signori!\"He thought they must surely be drowned and turnedhis head to see. But there were the two somber figuresstill following him, though their black sacks were drenchedand dripping with water.\n \n \n","sourceLink":"http://novel.tingroom.com/shuangyu/327/3153.html","bookId":135,"book":{"id":135,"title":"木偶奇遇记 The Adventures of Pinocchio","description":"简介： The Adventures of Pinocchio is a novel for children by Italian author Carlo Collodi, written in Florence. The first half was originally a serial between 1881 and 1883, and then later completed as a book for children in February 1883. It is...","cover":"http://novel.tingroom.com/uploads/110622/1-110622135910M1.jpg","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/327","creation":"Aug 1, 2019 12:18:19 AM","modification":"Aug 1, 2019 12:23:10 AM"}}
