{"id":3960,"no":21,"title":"Chapter 21","content":"Pinocchio is caught by a Farmer,who uses him as a watchdog for his chicken coopPinocchio, as you may well imagine, began to screamand weep and beg; but all was of no use, for no houseswere to be seen and not a soul passed by on the road.\n 　　Night came on.\n 　　A little because of the sharp pain in his legs, a littlebecause of fright at finding himself alone in the darknessof the field, the Marionette was about to faint, when hesaw a tiny Glowworm flickering by. He called to her and said:\n 　　\"Dear little Glowworm, will you set me free?\"\"Poor little fellow!\" replied the Glowworm, stoppingto look at him with pity. \"How came you to be caughtin this trap?\"\"I stepped into this lonely field to take a few grapes and--\"\"Are the grapes yours?\"\"No.\"\"Who has taught you to take things that do not belong to you?\"\"I was hungry.\"\"Hunger, my boy, is no reason for taking somethingwhich belongs to another.\"\"It\u0027s true, it\u0027s true!\" cried Pinocchio in tears. \"I won\u0027tdo it again.\"Just then, the conversation was interrupted byapproaching footsteps. It was the owner of the field,who was coming on tiptoes to see if, by chance, he had caughtthe Weasels which had been eating his chickens.\n 　　Great was his surprise when, on holding up his lantern,he saw that, instead of a Weasel, he had caught a boy!\n 　　\"Ah, you little thief!\" said the Farmer in an angryvoice. \"So you are the one who steals my chickens!\"\"Not I! No, no!\" cried Pinocchio, sobbing bitterly.\n 　　\"I came here only to take a very few grapes.\"\"He who steals grapes may very easily steal chickens also.\n 　　Take my word for it, I\u0027ll give you a lesson that you\u0027ll rememberfor a long while.\"He opened the trap, grabbed the Marionette by thecollar, and carried him to the house as if he were a puppy.\n 　　When he reached the yard in front of the house, heflung him to the ground, put a foot on his neck, and saidto him roughly: \"It is late now and it\u0027s time for bed.\n 　　Tomorrow we\u0027ll settle matters. In the meantime, since mywatchdog died today, you may take his place and guardmy henhouse.\"No sooner said than done. He slipped a dog collararound Pinocchio\u0027s neck and tightened it so that it wouldnot come off. A long iron chain was tied to the collar.\n 　　The other end of the chain was nailed to the wall.\n 　　\"If tonight it should happen to rain,\" said the Farmer,\"you can sleep in that little doghouse near-by, where youwill find plenty of straw for a soft bed. It has beenMelampo\u0027s bed for three years, and it will be good enoughfor you. And if, by any chance, any thieves should come,be sure to bark!\"After this last warning, the Farmer went into the houseand closed the door and barred it.\n 　　Poor Pinocchio huddled close to the doghouse more dead than alive from cold, hunger, and fright. Now andagain he pulled and tugged at the collar which nearlychoked him and cried out in a weak voice:\n 　　\"I deserve it! Yes, I deserve it! I have been nothingbut a truant and a vagabond. I have never obeyed anyoneand I have always done as I pleased. If I were only likeso many others and had studied and worked and stayedwith my poor old father, I should not find myself here now,in this field and in the darkness, taking the place of afarmer\u0027s watchdog. Oh, if I could start all over again!\n 　　But what is done can\u0027t be undone, and I must be patient!\"After this little sermon to himself, which came from the verydepths of his heart, Pinocchio went into the doghouse and fell asleep.\n \n \n","sourceLink":"http://novel.tingroom.com/shuangyu/327/3160.html","bookId":135,"book":{"id":135,"title":"木偶奇遇记 The Adventures of Pinocchio","description":"简介： The Adventures of Pinocchio is a novel for children by Italian author Carlo Collodi, written in Florence. The first half was originally a serial between 1881 and 1883, and then later completed as a book for children in February 1883. It is...","cover":"http://novel.tingroom.com/uploads/110622/1-110622135910M1.jpg","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/327","creation":"Aug 1, 2019 12:18:19 AM","modification":"Aug 1, 2019 12:23:10 AM"}}
