{"id":30914,"no":2,"title":"DOCTOR RABBIT DISCOVERS A SECRET","content":"When Tom Wildcat reached the ground he was pretty mad. Doctor Rabbit opened his window again and called down to him. “That salve is pretty hot, I’m afraid, but I’m quite sure it’ll cure your foot. Yes, sir, it’s pretty hot, but it’s just the right kind of salve for a wildcat!” \\n\\n \\n\\n “Well, maybe it is,” growled Tom Wildcat between his teeth. Then, thinking perhaps the salve would cure his foot and that by and by he might deceive Doctor Rabbit, he added, in a very pleasant tone, “I’m very much obliged to you, Doctor Rabbit. Good night!” \\n\\n \\n\\n “Good night to you, Tom,” Doctor Rabbit said, still chuckling to himself as he closed his window and locked it. \\n\\n \\n\\n [Pg 8]Doctor Rabbit was wide awake now and did not care to go back to bed. So he put on his light coat and soft slippers and sat down in his big rocking chair. Then he had a good laugh when he thought of the way Tom Wildcat yelped as he went down the tree. \\n\\n \\n\\n But pretty soon Doctor Rabbit stopped rocking and sat up very straight and listened. Yes, sir! There was some one mumbling in the little thicket near his back door. Doctor Rabbit got up and quietly slipped down his stairway. He crept close to his kitchen door and listened. It was just as he thought. Tom Wildcat was out there, talking and laughing to himself. \\n\\n \\n\\n He was saying, “My foot surely does burn but I know it’s going to be better.” After a minute he went on, “I believe I’ll rest here a little. I might just as[Pg 9] well. Ha, ha, ha! That fat old Doctor Rabbit is in bed sleeping his head off. He thinks he’s pretty cunning, but he’s not half as cunning as I am. Ha! ha! ha! I should say not. Yes, I’ll just rest here for a bit and think about the really, truly dinner I’m going to have. Jack Rabbit surely will make a fine one. Indeed he will!” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2289/64173.html","bookId":592,"book":{"id":592,"title":"Doctor Rabbit and Tom Wildcat","description":"简介： Rap! rap! rap! It was past midnight and some one was knocking on Doctor Rabbits door. Doctor Rabbit growled a little, for he did not like to be wakened that time of night even if he was a doctor. But he got up anyway and opened the upstairs window in...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2289","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
