{"id":82404,"no":15,"title":"Page 15","content":"Erin’s arms tightened. “Of course you did.”\n Chapter 10\n “Do you go to the tutoring sessions? I’ve only been a couple of times, but I don’t remember seeing you there.” Benji’s voice snapped my attention from Lucas.\n “Huh?”\n He chuckled as I shoved my econ text into the backpack at my feet, embarrassed at having been caught sneaking a glance at Lucas. Again.\n “Tutoring sessions? I wish I could, but I have another class at the same time. We’ve emailed, though—I needed help catching up, after my two-week hiatus from sanity.”\n Suddenly I realized—if Benji had attended the tutoring sessions, that meant he had seen Landon. I’d also deduced, from a few deliberately transparent comments, that Benji was gay. So he might not be opposed to answering questions such as Exactly how hot is the econ tutor?\n “So you’ve been to a couple of sessions, huh?”\n He nodded, and I decided to start with something way more fundamental.\n “Is there any chance the tutor is, you know, gay?” I held my breath, waiting for his answer.\n “What, like I hand out a survey?” He laughed when I blinked, worried I’d just offended him. “I’m just messing with ya. I’m pretty sure he doesn’t play for my team. Though if he did, he’d be a little out of my league.” He sucked in and patted his stomach, which was made somewhat flat by his efforts. “Nothing a couple of weeks at the gym and giving up bread for the weekend wouldn’t take care of.”\n I rolled my eyes. “Shut up.”\n He sighed. “I love being a guy. Need to lose five pounds? Go without ketchup for a couple of weeks. Problem. Solved.”\n We shouldered our backpacks and trudged up the stairs. “I really hate you right now.”\n He laughed, more so when my eyes scanned the space between Lucas’s seat and the door. He was gone. “So, you’re trading emails and intense do-me stares in class. I’m guessing you aren’t the only girl—or guy—in Heller’s class who thinks the tutor’s hot like a spicy tamale—but you may be the only one where the feeling is mutual.”\n I heard his teasing words, but nothing registered after I made the connection that had been right in from of me. “Lucas… is the tutor?”\n Benji halted with me, both of us buffeted by people parting around us. “I didn’t know his name, but yeah—holy shit.” He dragged me from the heavy flow of foot traffic. “You didn’t know he was the tutor?” He smiled. “I guess you’ll be going to the sessions now, huh? I mean, technically, you’re off-limits, but you aren’t the only one in that staring game or I wouldn’t tease you.” He leaned his face down and looked into my eyes. “Jacqueline? What the hell?”\n I considered the emails he wrote to me as Landon, and Lucas’s stares, his texts… and most notably, the sketching and makeout session five days ago. After which he hadn’t texted. Or emailed. Or told me he was Landon!\n “I didn’t know.” Like I needed one more damned thing to make me feel like an utter idiot.\n “Hello, Ms. Obvious, I sorta deduced that from your dazed and confused expression. Maybe he thought you knew?”\n I shook my head. “He knew I didn’t know.” I frowned. “And what do you mean, that I’m off-limits?”\n He lifted one shoulder. “My roommate tutored freshman chemistry. Tutors have to attend the class they’re doing sessions for, but they aren’t allowed to, you know, fraternize with those students. Conflict of interest. Not as big of a deal as GTAs or professors—who are advised against hooking up with any student at all. Still, it’s not like it doesn’t happen. We’re all human.”\n I stared at the floor. “Am I just completely freaking clueless? How did I not know?”\n Benji tucked a finger under my chin. “Um. I’m getting the distinct feeling there’s been some fraternizing going on.” He sighed at the look on my face. “Look, if you never attended a tutoring session, and neither of his alter egos told you he was the same guy, how were you supposed to know, exactly?”\n The tension in my shoulders deflated. “I guess you’re right.”\n “Of course I’m right. Now what?”\n My jaw locked. “No idea. But one thing’s for sure—I’m not telling him I know.”\n Benji shook his head, one arm around my shoulders as we merged back into the stream of students. “When I registered for econ, I had no idea that I’d be in for this level of reality-show drama. It’s like a big fat bonus.”\n Erin: I signed us up for a self-defense class\n Me: What??\n Erin: Put on by the campus po-po. Saturdays 9-noon, starts this week, skips the weekend after Thanksgiving, then 2 more.\n Me: Okay.\n Erin: We get to beat the shit outta guys in those big puffy suits!!! I’ve always wanted to really kick the crap outta some guy’s nuts. Now I can do it guilt-free!\n Me: You’re a sick girl.\n Erin: Guilty as charged. :)\n On Friday, I didn’t look in Landon/Lucas’s direction once. Not one single time. It had been a week since our university-prohibited makeout. Was that the pull for him? That I was forbidden fruit? I’d show him forbidden.\n When we were packing up, Benji looked over my shoulder, his eyebrows rising into the dark curls falling over his forehead.\n “Hey, Jackie.”\n Kennedy hadn’t spoken to me in over a month, the last words between us involving a trite cliché and the very textbook I was currently holding. I pulled a steadying breath through my nose and turned. “Kennedy.” I waited, sure he had some reason to approach me, though I had no idea what it was.\n “Are you heading home for Thanksgiving? If so, we should carpool. You know, make that four-hour drive a little less monotonous.”\n “You want us to drive home… together?”\n He shrugged and flicked his head to the side with a faintly dimpled smile. Kennedy tossing his hair out of his eyes was an arresting sight, and he damn well knew it. At the moment, though, it kind of pissed me off.\n Benji cleared his throat and touched my elbow. “See ya Monday, Jacqueline.”\n I smiled at him. “Have a good weekend, Benjamin.”\n He winked at me and bumped by Kennedy without apology.\n “What’s his deal?” my ex scowled.\n “What do you really want, Kennedy?” I shifted my backpack and stared up at him, conflicted by my contradictory desires in that moment. I wanted to punch him in the face. I wanted to fall into his arms and wake up from the nightmare of him casting me aside.\n “I’d like for us to be friends at the end of this. You mean a lot to me.” The gentleness in his eyes was almost a physical caress. I’d known him so well, and for so long.\n This speech was unanticipated—too much, too soon. My eyes teared up. “I don’t know if I can ever do that, Kennedy. And I don’t want to drive home with you next week. Excuse me.” I edged around him and started up the aisle to the door.\n “Jackie—”\n “It’s Jacqueline,” I said without turning, leaving him behind.\n Landon,\n I’m sending this a little early, though of course I don’t imagine you’re sitting around on a Friday night waiting for economics projects to pour in. But I’m going to be busy tomorrow morning, so I thought I’d go ahead and send it.\n Thank you again for looking it over before I turn it in.\n JW\n Jacqueline,\n As a matter of fact, you’ve distracted/saved me (temporarily, at least) from an infuriating search for a bug somewhere within hundreds of lines of code that doesn’t quite work. I’d much rather look over your econ project. I’ll have it back to you by Sunday evening, if not sooner.\n LM\n I stared at the L of his signature, picturing him as the guy I knew he was—Lucas. As Landon, his flirting had been subtle; as Lucas, it was overt. What game was he playing? I had no way of knowing if this situation was a first for him, or if he frequently stepped outside of those tutor-student boundaries. The night we met, that horrible night, he’d known who I was. He’d called me Jackie, the name he must have heard Kennedy call me. When I first emailed him for economics help, he must have known, too, but he gave me no hint.\n According to the university’s website, restrictions on socializing were to protect—or prevent—students from trading sexual favors for grades, or the appearance of such a thing. But Landon was helping me learn the material, and I was doing the work. When it came to my grade in Dr. Heller’s class, there was nothing improper going on. He knew it. I knew it.\n But even consensual fraternization, as Benji called it, was theoretically against the rules.\n I could get Landon Maxfield in serious trouble. When he came to my room, I thought he was just another student in the class, and he’d continued that deception.\n He’d kissed me, touched me, and I’d let him. I’d wanted him to.\n I shut my laptop and stared at my phone. We’d made out a week ago. Here, in my room. And hadn’t texted me once since then. I wanted to know why.\n Me: Did I do something wrong?\n I waited several minutes, looking at photos on my phone—many of which included Kennedy. I wondered if it was weakness that made it tough to delete them, or if I just wanted to keep the evidence that we’d seemed in love—that we’d looked in love, even while it was all ending.\n Lucas: No. Been busy. What’s up?\n Me: I guess you haven’t had time to redo the sketches.\n Lucas: Actually, I did one of them. I’d like you to see it.\n Me: I’d like to see it. Is it tacked to your wall?\n Lucas: Yes.\n Lucas: Listen, I’m out right now, ttyl?\n Me: Sure\n According to his email, he was working on what sounded like a huge CSE project, and according to his text, he was out partying. I had no idea which was true. I’d believe he was blowing me off… except for this: I’d like you to see it. I reread the text, opened my laptop and reread his email, but felt no closer to figuring him out.\n Erin came storming into our room at 1:00 am, on her cell. “You know what? I think you don’t respect my opinion about a lot of things.”\n Luckily, I was awake, watching online video clips of self-defense classes. Despite Erin’s eagerness for nut-kicking and my own need to learn this stuff, the last thing I wanted to do in the morning was get up and go punch and kick some guy in a puffy suit. I couldn’t see how that would correlate into getting away from someone like Buck. If I’d have been able to break his grip on me either night, let alone kick him, I would have.\n The door shut behind my clearly furious roommate as she flung her bag onto her bed, kicking off her heeled pumps. “Well, I can’t be with someone who’s decided to stand behind a fucking rapist.”\n Oh, God. I closed out of YouTube and pushed my laptop off my lap.\n “Yes, Chaz, that’s what I really think.” She unbuttoned her white blouse so forcefully, I was sure she would rip off a button or two. “Fine. Think whatever you want. I’m done.” Punching her phone, she growled at it and tossed it on her bed before turning to me, yanking her shirt off. “Well. I guess that’s over.” \n","sourceLink":"https://allnovel.net/easy-contours-of-the-heart-1/page-15.html","bookId":2743,"book":{"id":2743,"title":"Easy (Contours of the Heart #1)","description":"Storyline: \n Easy (Contours of the Heart #1) \n Rescued by a stranger. \n Haunted by a secret \n Sometimes, love isn\u0027t easy... \n He watched her, but never knew her. Until thanks to a chance encounter, he became her savior... \n The attraction between them was undeniable. Yet the past he\u0027d worked so hard to overcome, and the future she\u0027d put so much faith in, threatened to tear them apart. \n Only together could they fight the pain and guilt, face the truth - and find the unexpected power of love. \n A groundbreaking novel in the New Adult genre, Easy faces one girl\u0027s struggle to regain the trust she\u0027s lost, find the inner strength to fight back against an attacker, and accept the peace she finds in the arms of a secretive boy.\n \n","cover":"https://allnovel.net/images/easy-contours-of-the-heart-1.jpg","author":"Tammara Webber","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/easy-contours-of-the-heart-1.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:43:33 PM"}}
