{"id":82409,"no":20,"title":"Page 20","content":"“You haven’t told him you know yet, have you?” Benji asked, speaking from the side of his mouth.\n I shook my head.\n “Don’t make him suffer too much. He looks sorta vulnerable.”\n I chuckled. “Right. A tough, muscular guy like that—who’s trained to beat people up, and lies about who he is to girls—is so vulnerable.”\n He squeezed my arm just above the elbow and smiled. “He’s either an asshat to rival all asshats before him, or there’s a reason for those lies.”\n I sighed. “I wish I was a mind reader.”\n “You might not, once you know what’s in there.”\n “If I ever do.”\n Benji shrugged in agreement and veered off toward the long hallway leading to the south exit, turning to call, “Have a good break, Jacqueline.”\n “You, too.”\n I reached Lucas and he turned to follow me, leaning close to push the door open. “Can I see you tonight?” he murmured.\n I wondered if I was turning into a booty call. Or if that’s all it had ever been to him—if that was his reason for not telling me he was Landon Maxfield. “I have a test tomorrow in astronomy. We have study group in our room tonight.”\n I glanced up at him, walking beside me with his hands stuffed into the front pockets of his jeans. His gaze continuously scanned over the crowd of people, as though he was on guard.\n “Tomorrow night?” He stared down at me as we neared the building, and I noted that he seemed to know exactly where I was going.\n “I have an ensemble rehearsal tomorrow. I usually spend Sunday mornings in the music hall, but I missed yesterday.” I hadn’t told Lucas I played the bass. I’d told Landon.\n “You slept in?”\n I nodded.\n “Me, too.”\n We reached the entry and stopped to the side of the door. “I have to get my bass packed up, too, since I’m taking it home with me.” Waiting to see if he’d react, I watched his eyes, which matched the gray-blue of the overcast sky as his gaze drifted over the faces around us. “I’ll have plenty of time to rehearse during break.”\n “When are you leaving town?” He flicked his hair from his eyes, avoiding the subject of my instrument completely.\n “Wednesday morning. You?”\n “Same.” He shifted, on edge, his lower lip caught between his teeth, and then all of a sudden, he settled and stilled. His eyes met mine, unwavering. “Text me if you’re done early. Or your plans change. Otherwise, I’ll catch you after break.” He hitched the shoulder over which his backpack was slung and added, “Later, Jacqueline,” before turning and blending into the flow of students, his dark head rising above most of them.\n “Hold up. So tutor-guy Landon and hottie OBBP Lucas are the same guy?” Maggie’s eyes were so rounded with shock that I could see white all the way around her light brown irises.\n “What I don’t understand is why you didn’t call him on that shit immediately.” Erin had her talk-show-participant face on. Any moment, she would call me girrrrl and start recounting the ass-kicking she’d be doing if she was in my shoes. Ever since she’d broken up with Chaz, she was much less tolerant of guys stepping out of line. Or appearing to.\n I huffed a sigh and wished I’d never told them. “What happened to gag-him-and-bag him and rebound and operation bad boy phase?” The three of us sat on a comforter in the floor of the dorm room, drinking coffee and eating Oreos, astronomy texts and notes spread all around us, untouched for the last half hour as we discussed Landon/Lucas instead of gas giants and celestial navigation.\n “He’s supposed to be your booty call. Not the other way around.” Erin’s voice resonated with authority.\n “Yeah.” Maggie chimed in. “Why don’t you text him that you want to meet up later?”\n I rolled my eyes. “Because I have an exam at 9:30 in the morning—which we’re supposed to be studying for right now. And also, I think I need a little distance…”\n Erin peered at me. “Oh hell no—you’re getting emotionally involved, aren’t you?”\n I lay back with my hands covering my face. “Ughhhh!”\n “By the way—speaking of booty calls, what’s this I hear about you and Buck? He’s definitely bad boy material,” Maggie mused. “Did you add him to the OBBP stable without telling us?”\n I gave Erin a pleading look between my fingers.\n “Buck’s full of shit. You know that, Maggie,” she scoffed.\n Maggie nodded. “True… Plus, I messed around with him freshman year. He wasn’t very good, from what I recall. Too slobbery.” She shuddered. “What is it with slobbery kissers? Are they trying to drown us in spit? I mean, Jesus, swallow every now and then.”\n Her hand squeezing my shoulder, Erin laughed, and while I could hear the contrived ring to it, Maggie didn’t. I knew where Erin’s mind was going. I hadn’t given her many details, and she’d not asked for any. It was difficult enough to speak about that night in generalities. The point was what had happened, and what had almost happened, not the particulars of it.\n “So you aren’t hooking up with him?” Maggie pressed. She was only curious, but it rankled to have my name joined with Buck’s in any way.\n “Like Erin said—he’s full of shit.” I was curious myself. Morbidly so, perhaps. “Why? Is he saying something about me?”\n She shrugged. “Trisha said her little sister’s boyfriend said Buck was hassling Kennedy about it. Those two are like those big goats that butt heads over the girl goats. I think Buck’s still pissed that he was legacy and Kennedy still beat him out for pledge class president.”\n That was the complication I couldn’t remember before—the all-important initial conflict between them. The start of their weird brotherly rivalry. I frowned. “But Kennedy was legacy, too.”\n Maggie licked Oreo crumbs from her fingers. “Yeah, but Buck was legacy and his daddy was pledge class prez. He thought he had it wrapped up.”\n I sat up, becoming furious as Buck’s motivations became clearer. His reasons for hurting me were nothing more than goading my ex. “And that translates into the need for Buck to spread lies that I’m screwing him?” Not to mention the fact that he’d actually assaulted me.\n “I didn’t say it made any sense.”\n Erin pulled her notes onto her lap. “Okay ladies, which constellations do we think we’ll have to plot on the star chart portion of this test?”\n Giving my best friend a grateful look for the change of subject, I shoved thoughts of Buck as far away from my consciousness as I could manage to do.\n Chapter 14\n After three months away, the house smelled funny. Like dog… combined with the Chanel cologne Mom always wore, plus some other undefinable scent that my mind classified as home. Even still, it was foreign. I didn’t quite belong here anymore, and my body knew it.\n I lugged my bass inside, still nestled safely within its wheeled traveling case. With no parents and no Coco, there was little reason to move it any further than the living room. I parked it against the wall, where it stood like another piece of furniture. The lights in the house were timer-set, since Mom and Dad were gone. I decided to let them go on and off at will, with the exception of the kitchen lighting and the lamps in my bedroom, which probably wouldn’t come on at all otherwise.\n There was food in the pantry and freezer, but barely anything in the fridge. My parents had cleared out all of the perishable stuff before their trip, not knowing I was coming home tonight, since I never told them. Mom texted me earlier that they were boarding their plane, adding: Have fun with Erin. We’ll see you next month. Having never double-checked my plans, she’d somehow come to the conclusion that I was going home with my roommate.\n I heated a box of organic vegetarian lasagna for dinner, and transferred a ground turkey patty from the freezer to the fridge for my Thanksgiving lunch. There was half a package of tater tots in the freezer, too, and I found an unopened bottle of cranberry cocktail in the pantry. I moved it to the fridge. Tah-dah! Thanksgiving for one.\n After watching a couple of sitcom reruns, I switched the television off, scooted the walnut coffee table from its perfectly-centered spot on the hand-knotted Tibetan rug, and unpacked my bass. Improvising with a plant stand when I couldn’t find my music stand, I ran through the beginnings of a prélude piece I’d begun composing for my year-end solo.\n The last thing I expected to hear while scribbling notes onto staff paper was the doorbell. I’d never been afraid to be at home alone, but then I’d never been so completely alone here before. I debated pretending no one was home, but of course whoever was there had heard me playing, and heard me quit. I lay the bass on its side and crept to the solid door, standing on my toes to look through the peephole. Kennedy stood, smiling straight at me, illuminated by the glow of the dual lights of the veranda. He couldn’t see me, of course, but he’d answered this door many times and knew the view from the inside almost as well as I did.\n I unlocked and opened the door, but didn’t move from the doorway. “Kennedy? What are you doing here?”\n He glanced behind me and heard the utter quiet of the house. “Are your parents out?”\n I sighed. “They aren’t here.”\n He frowned. “Aren’t here tonight, or aren’t here over break?”\n I’d forgotten how readily Kennedy could zero in on what wasn’t said. That characteristic probably accounted for most of his debate wins. “They aren’t here at all—but why are you here?”\n He leaned a shoulder into the door frame. “I texted first but you didn’t answer.” I probably hadn’t heard the text alert. Little could be heard over the sound of my bass, once I began playing. “During dinner, Mom reminded me to make sure I had you over by 1:00 tomorrow—and yes, that means I never told them we broke up. I started to tonight, and then I thought this might be a welcome escape from Evelyn and Trent. Where are they, anyway?”\n I ignored his question. I couldn’t help but notice that he said we broke up as though our breakup was a mutual decision. As though I hadn’t been the blindsided idiot of the equation.\n “You want me to come to Thanksgiving lunch and pretend we’re all fine, just so you don’t have to tell your parents we broke up?”\n He smiled just enough to make the dimple appear. “I’m not that big of a coward. I can tell them if you want, and say I’ve invited you to come as a friend. But we don’t have to disclose anything to them, if you don’t want to. Trust me, they’re too oblivious to pick up on anything. My little bro’s had a weed habit for over a year—parties so hard he’d put most of the brotherhood to shame, and they have no idea.”\n “Aren’t you worried about him?”\n He shrugged. “His grades are still decent. He’s just bored. Besides, he’s not my kid.”\n “But he’s your little brother.” I only understood sibling relationships in theory, since I’d never had one, but I assumed logic would dictate some sense of responsibility. Kennedy seemed to feel none. \n","sourceLink":"https://allnovel.net/easy-contours-of-the-heart-1/page-20.html","bookId":2743,"book":{"id":2743,"title":"Easy (Contours of the Heart #1)","description":"Storyline: \n Easy (Contours of the Heart #1) \n Rescued by a stranger. \n Haunted by a secret \n Sometimes, love isn\u0027t easy... \n He watched her, but never knew her. Until thanks to a chance encounter, he became her savior... \n The attraction between them was undeniable. Yet the past he\u0027d worked so hard to overcome, and the future she\u0027d put so much faith in, threatened to tear them apart. \n Only together could they fight the pain and guilt, face the truth - and find the unexpected power of love. \n A groundbreaking novel in the New Adult genre, Easy faces one girl\u0027s struggle to regain the trust she\u0027s lost, find the inner strength to fight back against an attacker, and accept the peace she finds in the arms of a secretive boy.\n \n","cover":"https://allnovel.net/images/easy-contours-of-the-heart-1.jpg","author":"Tammara Webber","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/easy-contours-of-the-heart-1.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:43:33 PM"}}
