{"id":82416,"no":27,"title":"Page 27","content":"I nodded. “He will.”\n Erin took a shaky breath and looked down at Mindi. “We need to call the police or go to the hospital or something, right? I have no idea what to do first.”\n “The hospital?” Mindi was afraid, and I couldn’t blame her.\n “They’ll probably need to do… an exam, or something.” Erin gentled her voice, but at the word exam, Mindi’s eyes widened and filled with tears again.\n Her knuckles blanched, gripping the blanket. “I don’t want an exam! I don’t want to go to the hospital!”\n How could I blame her, when reporting would bring more pain and humiliation?\n “We’ll go with you. You can do this.” Erin turned to me. “What should we do first?”\n I shook my head, thinking of the campus police. Some, like Don, would probably do well with this situation. Some might not. We could go straight to the hospital, but I wasn’t sure what the steps were. I picked up my phone and dialed.\n “Hello?” Lucas’s voice was wary, and I realized I’d never called him before.\n “I need you.” It had been over a week since we’d communicated outside of the worksheets he’d sent, and the self-defense class yesterday morning.\n “Where are you?”\n “In my room.” I expected him to ask what I wanted. He didn’t.\n “Be there in ten minutes.”\n I closed my eyes. “Thank you.”\n He hung up, and I put the phone down, and we waited.\n Lucas squatted on his heels just below Mindi’s eye level. “If you don’t report it, he’s going to do it again. To someone else.” His voice hummed through me, barely audible from across the room. “Your friends will stay with you.”\n Erin sat on the bed, holding her hand. I barely knew this girl, but thanks to Buck, we were now allies, associated in a way no one ever wants to be linked.\n “Will you be there?” Her voice was a whisper.\n “If you want,” he answered.\n She nodded, and I tamped down a trace of jealousy. There was nothing to envy in this situation.\n The television in the ER waiting room was set at an earsplitting volume that was no help to my aching head. I wanted to turn it off, or down, but an elderly man was planted in a chair ten feet from it, arms crossed over his chest, staring up at the sitcom repeat. If that noise was distracting him from his reason for being here, who was I to take that diversion away?\n Lucas sat next to me, his bent knee angled toward me, brushing my thigh. His hand was so close to mine I could have reached my pinky finger out to stroke his. I didn’t.\n “Got something against that show?”\n His silly question broke my scowl. “No, but I think I could hear it from across the street.” He was wearing that ghost smile, and I wanted to melt into it.\n “Hmm,” he said, staring at the boot on his knee. “Are you a little hung-over, too?” When Erin and Mindi filled him in on the details of last night, he’d quickly figured out that I’d gone with Erin to the Greek event.\n “Maybe, a little.” I wondered if he would think I’d senselessly put myself in danger by attending a party where Buck would obviously be present. His reprimand the night we met—real responsible—still stung, mostly because it was true.\n “So did he talk to you? Last night?” He was still staring at his boot.\n “Yeah. He asked me to dance.”\n A muscle worked in his jaw, and his eyes were cold when he raised them to mine.\n “I said no.” I heard the defensiveness in my tone.\n He took a deep breath and turned more fully toward me, his voice low and menacing. “Jacqueline, it’s taking everything I’ve got right now to sit here and wait for law-abiding justice to take care of this, instead of hunting him down myself and beating the fucking shit out of him. I’m not blaming you—or her. Neither of you asked for what he did—there’s no such thing as asking for it. That’s a fucking lie argued by psychopaths and dumbasses. Okay?”\n I nodded, breathless at his declaration.\n His eyes narrowed. “Did he accept your no?” What I heard at the end of his sentence: this time?\n I nodded again. “Kennedy was with me. He noticed how weird I acted with Buck, so I told him what happened. I didn’t say anything about you, or the fight. I just told him I got away.”\n A small crease appeared between his brows. “How’d he take it?”\n I remembered Kennedy’s uncharacteristic cursing outburst. “He was angrier than I’ve ever seen him. He took Buck outside and talked to him, told him to stay away from me… which probably made Buck feel weak, and that’s why…” That’s why he raped Mindi.\n “What did I just say? This is not your fault.”\n I nodded, staring into my lap, tears stinging my eyes. I wanted to believe it wasn’t my fault, but Mindi was hurt after Kennedy had chewed him out. For me. It felt like my fault. I knew better, but I couldn’t help connecting the dots.\n Lucas’s fingers brushed under my chin and turned my face to his. “Not. Your. Fault.”\n I nodded again, holding onto his words like they were redemption.\n I parked in front of a neighbor’s house, snapping the truck door shut as quietly as possible and tiptoeing down the sparsely lit driveway toward the detached garage. It was late—hopefully late enough that no one would be peering out a window at a girl sneaking up to a guy’s apartment.\n Lucas’s motorcycle was parked under the open steps. I stood at the bottom with my hand on the rail, heart hammering, and looked back at Dr. Heller’s house. I couldn’t see any movement within, though there were lights on inside. Taking a deep breath, I climbed the steps and knocked lightly.\n There was a peephole in the door, so I was sure he’d seen me standing under the porch light by the puzzled expression on his face when he yanked the door open. An hour ago, he’d left me at the dorm with Erin and Mindi, and after he’d gone, I realized I hadn’t said what I wanted to say. And most of what I wanted to say included a need to see him while I said it.\n “Jacqueline? Why—?” He cut himself off at the look on my face, pulling me inside and shutting the door behind me. “What’s wrong?” His hands gripped my elbows as I stared up at him. He was wearing drawstring pajama bottoms and a dark t-shirt, the sexy lines of his tattoos spilling from his sleeves to his wrists. He also wore thin, black-framed glasses that accentuated the blue in his eyes and his dark lashes.\n I took a breath and blurted everything out before I was too chickenshit to say any of it. “I wanted to tell you that I just—I miss you. And maybe that sounds ridiculous—like we barely know each other, but between the emails and texts and… everything else, I felt like we did. Like we do. And I miss—I don’t know how else to say it—I miss both of you.”\n He swallowed, closing his eyes and inhaling slowly. I knew he would be all rational and do-the-right-thing and he would push me away again, and I was determined not to give him that chance. But then his eyes flashed open and he said, “Fuck it,” pushing me against the door, slamming his forearms on either side of my head and kissing me more forcefully than I’d ever been kissed, so firmly that I could feel the ring at the edge of his mouth scoring into the surface of my lip.\n He pressed his hard body against mine and I pressed back, grabbing handfuls of his t-shirt and fitting myself to him while his tongue stroked the interior of my mouth. When he drew back a fraction, I protested with an embarrassingly inarticulate sound and he chuckled softly, but he was just removing my coat and towing me to the sofa. Sitting, he dragged me astride his lap, cradling my head in one palm and crushing me closer with the other.\n We parted, breathless, and he tossed his glasses on the side table and tore his t-shirt over his head, and then removed mine more gently. His warm hands spanned my sides and held me tighter as our lips moved together, his tongue making languid, sweeping passes across mine. I wound my arms around his neck, opening my mouth and taking him in. When he kissed the corner of my mouth and dipped his lips to the hollow at the base of my throat, my head fell back. I couldn’t stop the soft keening moan his light sucking kisses triggered.\n “You have a freckle here,” he whispered, sweeping his tongue over a spot just under my jaw. “It drives me crazy every time you’re above me. I just want to do this…” The gentle draw of his mouth pushed me over the edge, and my knees tightened around his hips as I rocked against him.\n Light eyes smoldering, he removed my bra, outlining concentric rings with his fingertips, touching me so softly that I grew dizzy wanting more. His hands cupped my breasts, thumbs brushing the undersides, and I leaned my face down to his and sucked his tongue into my mouth, sliding my hand down his taut abdomen and lower over the front of the soft flannel pants. I tugged on one of the strings.\n “God, Jacqueline,” he gasped, straining against my hand while his arms snaked around me, fingers stealing into my hair at the nape as our mouths devoured each other. Breaking the kiss, he pressed his forehead to my shoulder and groaned, his teeth clenched. “Tell me to stop.”\n Confused, I shook my head, though I had no idea if the action was fervent or imperceptible. His breath fanned over my breasts and I bent to his ear, my voice a murmur. “I don’t want you to stop.”\n Wordlessly rolling us down and onto our sides, he unzipped my jeans and slipped his hand between the insubstantial fabric of my underwear and my skin, his fingers searching for and finding the place he sought as he kissed me. I gasped his name into his mouth, my fingers digging into his bicep, and his voice was a low growl in my ear. “Jacqueline. Say stop.”\n I shook my head once, my palm sliding down to press against the evidence of what his body wanted from me. “Don’t stop,” I breathed, telling him that I wanted what he wanted, unconditionally. I kissed him back, sure in the knowledge that my actions and words were all the confirmation he needed to continue.\n I was wrong. “Say stop, please. Please.” The last whispered word was a plea I couldn’t deny, even if I didn’t understand the reason for it.\n “Stop,” I whispered, not meaning it, not wanting it, and he shuddered and removed his hand from me. Curling my hands between our chests, I didn’t move away, didn’t speak. I just lay in his arms for long minutes, until his breathing slowed, finally becoming deep and even.\n Landon Lucas Maxfield was asleep on his sofa. With me.\n I woke to the muffled sound of Francis yowling to be let inside. Disentangling myself from Lucas cautiously, I slid from the sofa and went to let him in, grabbing my bra and long-sleeved t-shirt and pulling them back on. A gust of chilly air entered with Lucas’s cat, and I shut the door as soon as he fully cleared the doorway. After wrapping his tail around my leg for the span of two seconds, he stalked off to the bedroom, and I supposed that was as thankful as he ever got.\n I returned to the sofa, but I sank to the floor and examined Lucas instead of waking him or snuggling back into his embrace. With the planes of his face partially obscured by his dark hair, his full lips slightly parted and thick lashes combined in sleep, I could see the boy inside the man more clearly than I had before. I didn’t understand what happened earlier, why he made me stop him or why he held himself apart from everyone, from me, but I wanted to understand. \n","sourceLink":"https://allnovel.net/easy-contours-of-the-heart-1/page-27.html","bookId":2743,"book":{"id":2743,"title":"Easy (Contours of the Heart #1)","description":"Storyline: \n Easy (Contours of the Heart #1) \n Rescued by a stranger. \n Haunted by a secret \n Sometimes, love isn\u0027t easy... \n He watched her, but never knew her. Until thanks to a chance encounter, he became her savior... \n The attraction between them was undeniable. Yet the past he\u0027d worked so hard to overcome, and the future she\u0027d put so much faith in, threatened to tear them apart. \n Only together could they fight the pain and guilt, face the truth - and find the unexpected power of love. \n A groundbreaking novel in the New Adult genre, Easy faces one girl\u0027s struggle to regain the trust she\u0027s lost, find the inner strength to fight back against an attacker, and accept the peace she finds in the arms of a secretive boy.\n \n","cover":"https://allnovel.net/images/easy-contours-of-the-heart-1.jpg","author":"Tammara Webber","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/easy-contours-of-the-heart-1.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:43:33 PM"}}
