{"id":82420,"no":31,"title":"Page 31","content":"I gave the detective your information, and she said they would call you when they want you to come in. I’m not sure what happens next.\n JW (aka Jacqueline, aka J, aka Ms. Wallace, aka Jackie - but will apply self-defense training as needed if called such)\n Ms. Jacqueline (not-Jackie) Wallace,\n I never for one moment thought you were clueless. I got caught up in my own deception, and I felt increasingly rotten about it. I’m glad you found out, and I’m sorry I didn’t tell you myself. If anyone was clueless, it was me.\n I feel like such a jackass for ever saying anything to make you think that any part of that night was your fault. I was so amped, and pissed—at him. If you hadn’t made that sound in the truck, I think I might have killed him.\n Did you both file a restraining order?\n Lucas\n Me: Can we switch to text?\n Lucas: Sure np\n Me: We got the paperwork to file a temporary RO tomorrow afternoon.\n Lucas: Good. If you feel threatened, I want you to call me. Ok?\n Me: Ok.\n Lucas: Tomorrow is my last class day in econ. Dr. H will be doing a review on Friday.\n Me: Obviously, you don’t need that. I thought you were a bad slacker student. Sitting on the back row, drawing, not paying any attention to the lecture.\n Lucas: I guess I did look that way. This is my third semester to tutor, and my fourth to sit through the class. I know the material pretty well.\n Me: So, after Wednesday, we don’t have class together? And after the final next Wednesday, then what?\n Several minutes passed, and I knew I’d asked a question he either didn’t know the answer to or didn’t want to answer.\n Lucas: Winter break. There are things you don’t know about me. I told myself I won’t lie to you again, but I’m not ready to put everything out there. I don’t know if I can. I’m sorry.\n Winter break began a week from Friday—the last day of fall finals. I was required to leave the dorm over break, and the spring semester wouldn’t begin for seven weeks. A lot could change in that space of time.\n I fell out of a tree in sixth grade and broke my arm. I couldn’t play my bass or braid my own hair for seven weeks. When I was fifteen, my best friend Dahlia went to summer camp for seven weeks. When she returned, she was best friends with Jillian. I remained friends with them both, but things were never the same between Dahlia and me. Seven weeks after fall semester started, Kennedy broke up with me, and seven weeks later, I realized I was getting over him.\n Seven weeks could change everything.\n Erin came in from work before I could formulate a reply to Lucas, if there even was one. Uncharacteristically quiet and wearing a distracted expression, she peeled off her work clothes carefully, dropping them into the laundry basket without her usual garment-flinging tendency.\n “Erin? Is everything all right?”\n She flopped onto her bed and stared at the ceiling. “Chaz was standing next to my car when I came out tonight. Holding flowers.”\n I didn’t see any flowers, so I could only imagine what had happened to them. Probably nothing good. “What did he want?” I knew exactly what he wanted. I knew what he’d wanted last Saturday. What he’d probably wanted ever since he’d been dumb enough to choose his dick of a best friend over his girlfriend.\n “He apologized. He groveled. He said he’d apologize and grovel to you if I wanted him to. He swore he’d never thought Buck would resort to—that—to get a girl, because girls are always throwing themselves at him. I told him three weeks ago that it isn’t about sex. It’s about dominance.” She raised up on her elbows to look at me. “He didn’t listen to me then. And now, when Buck is about to be arrested and charged with rape—now he’s listening.”\n I shrugged. “I guess that guys who’d never do something like that have a hard time believing some other guy would,” I said, but I could see her point. Awareness and apologies were fine and good, but they could come too late.\n Chapter 21\n Kennedy was waiting outside the classroom Wednesday morning. Avoiding eye contact, I intended to walk by him into class, but he reached out as I passed. “Jacqueline—come talk to me.”\n Allowing him to pull me a few feet to the left of the door, I faced the classroom so I could see when Lucas arrived.\n He kept his voice low and leaned one shoulder on the smooth tile wall. “Chaz says you and Mindi filed police reports yesterday.”\n I expected anger or exasperation, but saw neither. “We did.”\n He rubbed a couple of fingers over his flawlessly stubbled chin—a habit that used to make me want to do the same. “You should know, Buck is claiming that the thing with Mindi was consensual, and the thing with you didn’t happen at all the night you said it did.”\n My mouth fell open and snapped closed. “The ‘thing’ with Mindi? The ‘thing’ with me?”\n Ignoring my indignation, he added, “He apparently forgot that he’d told Chaz and at least a dozen other guys that you and he had hooked up in your truck, right after the party, before he got jumped.”\n I knew Buck had spread rumors, but I hadn’t heard the details. “Kennedy, you know I wouldn’t do that.”\n He shrugged. “I didn’t think so, but I wasn’t sure how you were reacting to our breakup. I did a few, um, ill-advised things after… I figured you were entitled to the same.”\n I thought of OBBP—Erin and Maggie’s solution to my after-breakup nosedive—and conceded—to myself—that he wasn’t completely off the mark. Still, I wondered if he’d ever known me at all. “So you thought I might be so upset over losing you that I’d start screwing random guys in parking lots?”\n He pinched the bridge of his nose. “Of course not. I mean, I mostly assumed that he was exaggerating. I had no idea that he’d…” his jaw clenched and his green eyes blazed. “It never occurred to me that he’d do that.”\n I was getting sick and tired of that sentiment.\n I saw Lucas approaching at the same time he spotted me. Without pausing, he walked straight over and stood next to me. “You okay?”\n I’d grown addicted to that sentence from him, and the way he said it, his voice like steel under velvet. I nodded. “I’m fine.”\n He nodded once at me and gave Kennedy a quick glance that promised lethal injury if he saw fit to inflict it.\n Kennedy blinked and looked over his shoulder to watch Lucas enter the classroom. “That guy’s in our class? And what the hell was that look for?” He turned back to examine my face more closely as I watched Lucas disappear through the door. “Chaz said some guy was in the parking lot that night. That he’s the one who beat the shit outta Buck, not a couple of homeless guys like Buck said.” He gestured with a thumb. “Is that who he was talking about?”\n I nodded.\n “Why did you tell me you just got away?”\n “I don’t want to talk about that night, Kennedy.” With you, I added silently. I’d have to talk about it soon enough, when I had to give a deposition to the defense, and again when it went to trial.\n “Fair enough. But you weren’t exactly honest with me the other night.”\n “I was honest; I just wasn’t completely forthcoming. I don’t know why I even told you, especially after you asked me to drop the charges so the frat could save face—”\n “That was a mistake. One that’s been rectified—”\n “Yes, by a bunch of sorority girls much braver than you. Mindi was about to cave to your pressure, and if she’d dropped her case, I wouldn’t have had one at all. You of all people know that. So thanks, Kennedy, for your support.” I sighed. “Look, I appreciate your talk with Buck, and for what it’s worth, I know you genuinely didn’t want him to hurt me. But he needs to go to jail, not just be dressed down by a peer and tossed out of his fraternity.” I spun to enter the classroom and stopped when he called my name.\n “Jacqueline—I’m sorry.”\n Erin was right. Apologies could come too late. I nodded, accepting his for the sake of everything we used to be, but nothing more.\n Dr. Heller had begun the lecture, so I slipped into my seat, accepted Benji’s smile of hello, and gave myself credit for becoming a survivor. I had survived Kennedy’s decision to end our relationship. I had survived what Buck tried to do to me. Twice. And I would survive if Lucas wouldn’t—or couldn’t—trust me with his personal demons.\n The trees had transitioned from leafy to bare without me noticing. The shift was always a quick thing here—never a lengthy, multihued transformation like it was further north. Even still, I’d been too preoccupied to observe the alteration as it occurred. It seemed like one day the trees were thick and green, and the next, the leaves had vanished altogether, except in small, dead piles trapped in terraced corners and caught under border hedges.\n The occasional warm days were gone as well. Lucas and I hunched into our coats, and my scarf was wound around my neck twice and encroaching on my face. I exhaled into it and savored the warmth that lasted about two seconds.\n Lucas pulled his beanie lower. “Do you want me to come with you this afternoon? I can get someone to cover my shift at Starbucks.”\n I turned my head to look at him, but my scarf didn’t turn with me. “No. Mindi’s parents are here. They’re going to make sure everything’s taken care of for both of us. They even offered to get me a hotel room—they’re keeping Mindi there with them for the next week, and then taking her directly back home after finals. Her dad’s moving her stuff out of her dorm tonight. Erin says they may withdraw her permanently.”\n He frowned. “I guess it wouldn’t do any good to point out that this could have happened anywhere.”\n I shook my head. “Maybe once they get over the shock of it. But Mindi might not want to come back here, even if that’s true.”\n “Understandable,” he mumbled, staring straight ahead as we walked.\n We were silent until we got to the small building where my Spanish class was located. “I wish I could skip again today, but we have oral presentations that count as part of the final.”\n He smiled, reaching out to loosen a stubborn strand of hair that clung to my lip. I couldn’t get it with my gloved fingers. His index finger was faintly gray, and I guessed that he’d been sketching in class today. “I’d like to see you, before you go home. Outside of Saturday’s class, I mean.” His finger trailed my jaw, dipping into the pool of scarf and tucking beneath my chin.\n I felt my stomach drop to my feet. I’d become familiar with non-verbal farewells recently, and goodbye was in his eyes. I wasn’t ready to see it. “I have a solo performance for a final grade tonight, a mandatory recital to attend on Friday, and my ensemble is performing Saturday. But I can come over tomorrow night, if you want.”\n He nodded, staring into my eyes, looking like he might kiss me. “I want.” Students still hustled to their classes all around us. I wasn’t late to class yet, this time. He pulled my scarf back into place over my chin and smiled. “You look like a partial mummy. Like someone was interrupted while winding you into your shroud.” \n","sourceLink":"https://allnovel.net/easy-contours-of-the-heart-1/page-31.html","bookId":2743,"book":{"id":2743,"title":"Easy (Contours of the Heart #1)","description":"Storyline: \n Easy (Contours of the Heart #1) \n Rescued by a stranger. \n Haunted by a secret \n Sometimes, love isn\u0027t easy... \n He watched her, but never knew her. Until thanks to a chance encounter, he became her savior... \n The attraction between them was undeniable. Yet the past he\u0027d worked so hard to overcome, and the future she\u0027d put so much faith in, threatened to tear them apart. \n Only together could they fight the pain and guilt, face the truth - and find the unexpected power of love. \n A groundbreaking novel in the New Adult genre, Easy faces one girl\u0027s struggle to regain the trust she\u0027s lost, find the inner strength to fight back against an attacker, and accept the peace she finds in the arms of a secretive boy.\n \n","cover":"https://allnovel.net/images/easy-contours-of-the-heart-1.jpg","author":"Tammara Webber","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/easy-contours-of-the-heart-1.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:43:33 PM"}}
