{"id":32237,"no":12,"title":"CHAPTER XII UNEXPECTED OPPORTUNITIES","content":"THE days following Tory Drew’s suggestion to the Girl Scouts brought forth an unusual chain of circumstances. Otherwise their good resolutions might not have had the surprising developments. \n \n A day or two later Tory received a letter which filled her with surprise, pleasure and consternation. The letter was the second from her new artist friend in New York City, but of a wholly different character from the original one. \n \n Mr. Winslow explained that he had not been well in some time. Recently his physician had insisted that he spend the winter in the country. He knew of few places outside New York City, but recalled Tory’s description of Westhaven. Would it be possible to find him a little house in or near Westhaven where he might spend the winter? He must be a large part of the time out of doors. Tory would please understand that he could afford to pay but little and would ask only the simplest living arrangements. \n \n 127 The letter Tory showed first to her uncle and then to Memory Frean. \n \n Neither had any suggestion to make that Tory believed would to acceptable to the gifted but disappointed artist, who was her father’s friend, and who, perhaps, some day would be her teacher as well as friend. \n \n Mr. Fenton could only propose vaguely that the artist might spend the winter with them, if his sister, Miss Victoria, were willing. \n \n Tory appreciated that her aunt might be glad to entertain an unknown guest for a week or ten days. She could hardly be expected to desire one for an indefinite stay. \n \n Moreover, Mr. Winslow would never consider the proposal. He had no wish to be a burden. \n \n Memory Frean, for the first time in their acquaintance, had no suggestion to offer. \n \n Fortunately, Dorothy McClain was almost equally as interested as Tory in their recent acquaintance. In accordance with her advice, they concluded to consult with their Troop Captain, Sheila Mason. \n \n Miss Mason was not well enough to be outdoors, but, contrary to Teresa’s Good Samaritan intentions, was a great deal better, and able to see visitors in her own room. \n \n 128 The two girls found her in a lovely morning dress of gold and blue seated in a large chair before a fire. \n \n As Teresa had insisted upon adopting the Scout Captain as her invalid, notwithstanding her recovery, at the moment of Tory’s and Dorothy’s arrival they discovered Teresa curled up on the blue sofa with the yellow cushions, according to her expressed desire. \n \n Sheila Mason was an only daughter. Her family was considered a wealthy one, according to the standards of Westhaven. She was only a few years older than her own Troop of Girl Scouts, being in the early twenties. \n \n This afternoon Tory dropped down on a stool at her feet, while Dorothy seated herself upon the divan beside Teresa. \n \n “There seems to be no little house for rent in Westhaven that is inexpensive,” Dorothy remarked, when Tory had concluded her story. “We have made any number of inquiries. And I feel sure Mr. Winslow is poorer than he would be willing to confess. He says he must sublet his studio to be able to leave New York at all. At the same time I consider it would be best for him and a wonderful thing for Westhaven to have him spend the winter here. He is sure to make friends. Tory and129 I are convinced he is very gifted and that it is only because of some disappointment, a love affair perhaps, that he so far has failed to meet the success he deserves.” \n \n Sheila Mason laughed. How unlike Dorothy to be so romantic! She would have expected such a speech from Tory. \n \n Then Sheila set herself seriously to considering their problem, wrinkling her brows and biting her lips. The three girls continued to gaze at her admiringly. \n \n Her fair, pale-gold hair was piled loosely on top of her small head. Her eyes were dark blue with thin level brows. Except for the gravity of her expression she might have been almost too pretty. \n \n Suddenly she made a movement. \n \n “Girls, I have thought of something! Suppose we ask this Mr. Winslow if he would like to occupy our evergreen cottage in the woods this winter. I am sure the little place can be made comfortable for him, and from what you tell me Mr. Winslow is not a conventional person. He can rest out there and paint our beechwoods in the winter time whenever he likes or is well enough. Of course we must ask the permission of our other Girl Scouts. \n \n “After Mr. Hammond had the floor of our130 cabin removed to search for a clew to Katherine Moore’s history, he had a better floor relaid to take the place of the old one, and the holes in the walls stopped with plaster. \n \n “I for one shall envy this artist person if he occupies our cabin during the winter. I too have missed our good times out there and since Christmas have worried over our failure to live up to our Scout ideals.” \n \n Flushing, the young Scout Captain clasped her hands over her knees and began slowly rocking back and forth in an unconscious and girlish fashion. \n \n “I had about reached the conclusion, girls, that our mistake lately has been that we have thought too much of our own happiness and self-development. It is part of the Scout ideal, but certainly not the whole. Our slogan is sufficient proof, the daily good turn is for others.” \n \n The Scout Captain turned to Tory. \n \n “Teresa has just told me of your suggestion; each one of us is to find an ill person and care for him or her during the winter. If your artist comes to the evergreen house, Tory, you may look after him. Perhaps we may be envious of you. As soon as I am well I too shall seek out some one to aid. This is a hard winter for many people. The Girl Scouts131 ought to make themselves an influence for good in Westhaven as never before.” \n \n A little later, on their way home, Tory and Dorothy McClain could think and talk of nothing but the possibility of their artist’s spending the winter months in their evergreen house in the beechwoods. \n \n They had adopted Mr. Winslow to the extent of speaking of him as “their artist” to each other. \n \n Small doubt in either girl’s mind that the other Scouts in their Troop would agree to the Troop Captain’s suggestion! \n \n If Mr. Winslow accepted their invitation, Dorothy and Tory decided to do everything in their power to make his stay in Westhaven a success. They would omit no detail. He should not be bored by their attentions, but never allowed to feel neglected. \n \n “Suppose he should meet some one in Westhaven who would console him for what he must have suffered in the past?” Dorothy suggested. \n \n In amazement Tory stared at her and smiled. \n \n She was as surprised as their Troop Captain by Dorothy’s unexpected romantic attitude. Of all her friends Dorothy was less given to vicarious romanticism. Most of the girls132 indulged in dreams for themselves and their friends. Dorothy was as matter-of-fact as many boys. Her own family and friends and the daily routine of life so far satisfied her. \n \n But Mr. Winslow had touched her imagination as well as Tory’s. The truth was that Lance’s absence from home left a vacant place in Dorothy’s life which she had not known he had so completely filled. \n \n She and Donald confessed to each other that always they had had Lance upon their minds without appreciating the fact. He was so often in trouble with some one, or not well, or proposing some impossible suggestion out of which he had to be argued or bullied. \n \n Realizing Dorothy’s need, Tory decided to be generous. She would have preferred Mr. Winslow to be principally known as her friend upon his arrival. In reality, she had the chief claim upon him. Still, after all it might be pleasanter if she and Dorothy shared the pleasure. \n \n Neither girl apparently doubted the artist’s acceptance of their suggestion. They were right in their surmise. Before another week he might be expected. The evergreen cottage appeared to be the one place in the world most suited to his needs. \n \n 133 The arrangements to make it habitable for the winter Dorothy and Tory gladly undertook. Mr. Winslow insisted upon paying a small rental. Miss Virginia Fenton agreed to allow Tory to use any old furniture she might find stored away in the attic of their house. \n \n An entire afternoon she and Dorothy spent in fascinated search. They discovered a battered but beautiful mahogany table, two chairs slightly uncertain in their legs, but otherwise whole. However, the cabin was well supplied with tables and chairs. The treasure that pleased them most was a worn pair of dark blue and gold damask curtains. Drawn across the windows they would make the cabin room safe from the cold and full of beautiful color. They were, of course, too long and too large for the cabin windows, so that odd pieces were cut off for table covers and scarfs. \n \n A piece of oriental embroidery, brought home by one of her early seafaring Fenton ancestors, Tory hung on the cabin wall to break the monotony of the exterior. She hoped Mr. Winslow would bring a certain number of pictures with him, not only to beautify the cabin but to give the people in Westhaven a knowledge of his ability. \n \n 134 If not, Dorothy suggested he would soon have new pictures of the woods and scenes about Westhaven. \n \n Indeed, the two girls became so interested in their work and in their anticipations they saw nothing of the other Girl Scouts in their Patrol for the entire week. \n \n What they were doing to carry out Tory’s suggestion at the last Scout meeting they neither knew nor for the time felt any special interest. The next Scout meeting was to be delayed until the Troop Captain was well enough to be present. \n \n Suddenly Tory Drew found herself having to face the entire responsibility of Mr. Winslow’s arrival and installation at the evergreen cottage alone. \n \n It was nearly bedtime and she was beginning to make ready to undress when she heard Donald McClain’s familiar whistle beneath her window. \n \n Tory fled down to the front door, calling to Mr. Fenton, who was in his library, to explain why she had reappeared after saying good-night. \n \n Don would only come in for a few moments. He brought a message from Dorothy saying that her father had received a telegram asking him to come to New York City at once. \n \n 135 The telegram was signed Owen Moore. Lance at last had agreed they might learn the name of the man who had befriended them. He had told them nothing of his history, insisting that he himself was in complete ignorance. Mr. Moore did not seem to care to talk of his own past. \n \n Naturally, Dr. McClain believed that Lance had been taken seriously ill. He did not wish to face the situation alone and was taking Dorothy with him. \n \n Tory received permission to spend a quarter of an hour with Dorothy and the doctor in order to say good-by and to send a dozen messages through them to Kara. \n \n Her own anxiety over the mysterious summons and its possible reference to Lance, she did her best to conceal. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1686/49662.html","bookId":1169,"book":{"id":1169,"title":"The Girl Scouts of the Round Table","description":"简介： THE snow had fallen several days before. This afternoon the ground was hard and white, with a thin crust of ice.Spinning in the air were small silver crystals that danced in the winter wind as if with no thought of ever settling down upon the earth....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1686","creation":"Aug 1, 2019 12:24:33 AM","modification":"Aug 1, 2019 12:24:33 AM"}}
