{"id":26855,"no":39,"title":"CHAPTER XXXVII KONDRATENKO\u0027S DEATH AND SOME RESULTS","content":"On December 11 regular winter set in, accompanied by a searching wind. The garrison began to suffer greatly, owing to the bad food and the want of protection from the weather. Scurvy increased very much, in spite of the efforts of the doctors, who were helpless in the absence of a proper food allowance. All that St?ssel would vouch-safe to their representations on this subject was: \u0027As to the surrender of the Fortress, I shall know when that should take place, and I will not permit a street massacre.\u0027 For the next two or three days there was much anxiety in Arthur about Fort Chi-kuan-shan. The enemy had even got into the counter-scarp gallery, whence they had driven our men back with poisonous gas, and so obtained possession of a portion of it. Many were the earnest consultations between Smirnoff and Kondratenko. The night of the 15th was unusually wild. The snow was driven across the gaunt hills in clouds by the vicious gusts of an icy wind, which moaned as it swept up the gorges—suitable accompaniment to the more deadly sounds in the air, for the Japanese were not resting. Pitch dark though it was, there was sufficient light to distinguish the mass of Chi-kuan-shan Fort as it lay under patches of snow, with the bare rock showing on the lee of[Pg 275] the slopes and scarps. The fort seemed deserted, for, save the few sentries on the parapets, not a soul was about—all were under cover, snatching what rest they could. Of the enemy also, busy as they were, nothing could be seen—they had all burrowed. From some casemate below two young officers came up to the main parapet, behind which they stood listening to the enemy delving in their saps. Presently there was a movement in a Japanese trench, and a shower of sparks came fizzing over: a warning shout among our men, and then the detonation of a grenade. The two officers having amused themselves thus for a short time, went down to the counter-mine galleries to listen for the enemy, who were now very close. Meanwhile down below in the bowels of the great fort a different and more pleasant scene was being enacted. General Kondratenko, who had come out to see things for himself this evening, so critical were they, was decorating a non-commissioned officer for gallantry. Warmly congratulating the soldier, he kissed him and pinned the Cross of St. George on his breast. The concrete casemate in which this little scene took place was a haven of rest after the turmoil above, for here few sounds could be heard, and there was comparative warmth. After the ceremony Kondratenko sat with his head on his hands, silent and apparently depressed; the others discussed matters. Behind a wooden partition a party of sailors were busy filling hand-grenades by a lantern, and cases of pyroxyline were lying strewn about. \u0027Listen, gentlemen! It is coming!\u0027 and all were suddenly silent, for even down here the whistling roar of an 11-inch shell could be heard. It arrived and fell into the ditch behind, destroying the bridge, and the groans and shouts for stretchers could be heard. When supper was served, Kondratenko would eat nothing. A consultation was started, much being said[Pg 276] about Smirnoff\u0027s orders for work and St?ssel\u0027s counter-orders as to not using up the men. In the corners of the casemate some were sleeping, others were quietly talking. Of all the officers present, Colonel Raschevsky was particularly cheerful and talkative. \u0027Well, gentlemen,\u0027 said he, \u0027this casemate is about the only place in this fort where one can feel fairly safe. The underground shelters are none too satisfactory when 11-inch shells are flying about, though they are good enough against splinters.\u0027 It was now near nine o\u0027clock, and again the noise of a rapidly approaching shell was heard—the fifth since Kondratenko\u0027s arrival. A—a—a—ah!!! All was confusion, dust, smoke, noise of falling concrete, stones, and splinters of steel, cracking of bursting grenades, cries, the stench of blood, the suffocating gas of high explosives.... In the corner where Kondratenko, Raschevsky, Senkevitch, Zedgenidsey, and Naumenko had just been sitting at the table poring over the map, a bluish flame flickered for a moment over a heap of bodies half buried in débris. All was still, save for the groans of Lieutenant Kraiko (one of whose legs was torn off) and of Potapoff—buried under the ruins. Under this heap of rubbish the others lay dead, killed while in the execution of their duty. Kondratenko had perished, but wherever Russian is spoken his name will ever be synonymous with duty, unselfishness, bravery, and honour. pic MAJOR-GENERAL KONDRATENKO. It was about 10 p.m. when Smirnoff received the news on the telephone from Khvostoff. He felt it bitterly. In one moment his best and most reliable assistant had been swept away. Not only was it on account of his skill as a soldier that Kondratenko could not be replaced: there were other ways in which he had been invaluable. His[Pg 277] death meant more difficulties and a fresh struggle with St?ssel. Roman Isidorovitch had always contrived to smooth over things, thus annulling, to a certain extent, the conflict of orders. But now the inevitable had come to pass: he was no longer there to help. About eleven o\u0027clock Khvostoff himself arrived, and briefly confirmed his telephone message: \u0027Sir, an 11-inch shell burst in the officers\u0027 compartment in the casemate of Chi-kuan-shan Fort. Generals Kondratenko, Raschevsky, Zedgenidsey,[36] and Senkevitch were killed on the spot. Colonel Naumenko was alive when brought out, but he has died since without regaining consciousness.\u0027 Looking at the practical side of things, Smirnoff\u0027s first words were: \u0027We must go to St?ssel at once. —— is next in seniority to Kondratenko, and St?ssel will certainly try to give him the vacant appointment. This must at all costs be prevented. I will myself take over the command of the land defences in addition to my duties as Commandant, difficult though it will be. The state of affairs on the north-east front is so serious that I cannot under any circumstances allow —— to have charge. He can be sent to the western front, where the enemy are still a long way off, and he can\u0027t do much harm, and where, much as he may want to, he won\u0027t be able to surrender anything to them. It is different on the other front, where the Japs are almost sitting on the parapets. There he would undoubtedly surrender one position after another, carrying out his theory of the doctor and the gangrenous patient.\u0027 Arriving at St?ssel\u0027s house, they found the place locked up; even the orderly supposed to be on duty was asleep. Only after much knocking was he aroused sufficiently to open the door. [Pg 278] \u0027Tell General St?ssel that the Commandant has come to see him on urgent business.\u0027 \u0027The General is asleep, sir, and has given the strictest orders that he is not to be disturbed on any pretext whatever. I cannot go to him, sir—I dare not.\u0027 This, if you please, was the man in command of a besieged fortress! \u0027Let us go to Fock. I will talk to him and tell him what I intend to do,\u0027 said Smirnoff. Stumbling along in the dark, they at last reached Fock\u0027s quarters. An orderly appeared, but here again the Commandant was to meet with failure, as after a few moments the man returned to say: \u0027The General has ordered me to say that he is very ill and in bed with a temperature of 102. He is in a high fever and cannot possibly see you.\u0027 \u0027Let us try Reuss, then,\u0027 said Smirnoff quietly. On the way they met Dmitrevsky (Chief Staff Officer of the 4th Division). \u0027Colonel, General Fock is on the sick list; meanwhile I propose to appoint Nadein to the western front, and you are to go there as his Chief Staff Officer.\u0027 They arrived at the District Staff Offices, and found Reuss just sitting down to supper. He was surprised and alarmed at such a late visit from the Commandant, who at once said: \u0027I have just been to St?ssel and Fock, but was unable to see either of them. I want you to tell St?ssel in the morning that I consider the state of affairs on the north-east front so bad that I am going to command there myself. I have decided to appoint Fock to the western front, but till he is off the sick list (he is very ill at present, with a temperature of 102) I will send General Nadein there, with Dmitrevsky as his Chief Staff Officer. Please tell St?ssel of this to-morrow, early, so that there may be no misunderstanding about orders.\u0027 [Pg 279] \u0027Very good, sir. I will report it first thing in the morning.\u0027 Next morning a Mass was held for the souls of the departed, at which a great number of officers were present to pay their last tribute to the men they had so respected and loved. The Commandant was there, of course, but St?ssel, Fock and Nickitin were conspicuous by their absence. Thinking that the first named would surely come, the priests waited some time before commencing the service, but in vain. While waiting Colonels Semenoff and Kilenin went up to General Smirnoff and said: \u0027We wish to inform you, sir, that, on behalf of the officers of the garrison, we are sending a deputation to General St?ssel to ask that the command of the land defences be left entirely in your hands. We are convinced that only in this event can a successful issue be counted on. If the command should by any chance go to General ——\u0027 \u0027Yes, yes, gentlemen—yes! But you need not worry. I have already taken the necessary steps. Everything will continue as before. Report direct to the Fortress Staff, as you have been doing....\u0027 The service began. As soon as the service was over Smirnoff and his Chief of the Staff went to see General St?ssel, but again found him out. From his house they went straight to ——, whom, to their amazement, they found in the best of health, with no apparent trace of the high fever he had said he was suffering from the previous night. In fact, they had never before seen him in such high spirits. \u0027Good morning, sir—good morning! What can I do for you? Won\u0027t you sit down?\u0027 (He had just returned from being with St?ssel and Nickitin, and knew full well that he had been put in orders to succeed Kondratenko.) [Pg 280] \u0027I have just been at General St?ssel\u0027s, but found him out; he had apparently gone to Nickitin\u0027s. I must see him to talk over your appointment. The fact of the matter is that Kondratenko has left an unenviable legacy behind him in the state of affairs on the north-east front. I have decided to make use of your military knowledge by sending you to the western front, and I will take command of the eastern myself, as I did during Kondratenko\u0027s life.\u0027 \u0027Very good, sir; only you had better inform General St?ssel. I hear he thinks of putting me in to command all the land defences, and you will have to hurry or he may have issued the order, and it will then be difficult to get him to change it. The front most certainly ought to be divided up.\u0027 St?ssel had already gone to the District Staff Offices and had issued two orders. The first (No. 920) announced the death of Kondratenko and his comrades; the second (No. 921) appointed Fock to command the land defences, vice Kondratenko, and Nadein to officiate in command of the 4th East Siberian Rifle Division, vice Fock. [Colonel Raschevsky was succeeded by Captain A.V. von Schwartz, of the Engineers, an excellent officer who had been in charge of the fortifications of Kinchou.] His deep sleep and Fock\u0027s illness together frustrated Smirnoff\u0027s good intentions as to the appointment. However, Smirnoff, knowing nothing of this and never dreaming that he was being fooled, left at once and went again with Khvostoff to St?ssel\u0027s house. This time they drew him. He received them very coldly and without sitting down. \u0027What can I do for you, General? You have already been here once to see me.\u0027 \u0027I have decided, sir,\u0027 said Smirnoff, \u0027now that Kondratenko has been killed, to take over the command of the[Pg 281] eastern front myself. General Fock is the next senior to Kondratenko, but the state of affairs there is so critical that he would not be able to deal with the many questions there in addition to those arising all along the eighteen miles of front. The western side does not give such cause for anxiety, so I propose to put Fock in command of it, and myself to run the eastern in addition to my duties as Commandant. This is, I think, a sound arrangement, as Fock knows the western and has never been on the eastern front, while all my energies, as you know, have always been directed towards the latter.\u0027 \u0027The defence scheme of the Fortress lays down that one officer shall command the land front. Kondratenko was able to manage it!\u0027 \u0027I always kept him on the western, and myself ran the eastern. This was the case, you will remember, in the assaults during August, September, October, and November ...\u0027 \u0027I have already appointed General Fock in place of Kondratenko,\u0027 replied St?ssel, raising his voice. \u0027The order is published. You should know by now, General, that I never alter my orders. I never\u0027—shouting—\u0027alter my orders!\u0027 \u0027But, sir, his appointment——\u0027 But St?ssel only roared again, \u0027I never alter my orders!\u0027 What could Smirnoff do? The reader must remember that, by an order issued in March, Smirnoff was made subordinate to St?ssel; that the latter had been appointed Aide-de-Camp to the Tsar, which in the eyes of the troops vested him with great authority, as he could speak in the Emperor\u0027s name. What, I ask, could he have done? How should he have acted? It is easy to say now what he should have done, but, taking his position at the time and everything else into consideration, I personally do[Pg 282] not see what would have been best to do. Even now, disgusted as he was, the Commandant knew nothing of the official deceit of which St?ssel was guilty. [The first that Smirnoff heard of the concealment of the orders was from Kuropatkin himself, when he returned from being a prisoner of war.] After this interview the two men went totally different ways. They only met once again—on the day on which the last council was held. More than once when I accompanied Smirnoff on his inspection he said to me: \u0027I am hindered and opposed at every—literally every—turn in the defence, and if Arthur falls all the shame and all the responsibility will be thrown on me. But, no; I\u0027ll defeat them. If Arthur falls, I and all the other Generals will die with it.\u0027 But he did not; the eventual capitulation was for him—the Commandant—as complete a surprise as it was for the rest of the garrison. Extract of December 17 from Colonel Raschevsky\u0027s Diary.[37] \u0027From 2 p.m. the Japanese have bombarded Chi-kuan-shan Fort and Little Eagle\u0027s Nest. An 11-inch shell struck the casemate of the former, wounding three more officers.... \u0027It is rumoured that Fock has issued an order decreasing the garrison of the forts by half, withdrawing half to make up a reserve. This is exactly contrary to General Smirnoff\u0027s principle, but Fock seems to think that the inaction and monotony of fort life breeds disease....\u0027 General Fock\u0027s first act after taking up his new ap[Pg 283]pointment was, indeed, to decrease the strength of the garrisons of the forts and intermediate works. By degrees he reduced them very considerably. \u0027It doesn\u0027t do to have the men too thick, or one shell will have too many victims, and we shall have no one left to defend Arthur!\u0027 He had always said this, and now his words took shape in deeds. His predecessor, on the other hand, thoroughly agreeing with Smirnoff\u0027s principles and wishes, had endeavoured to keep the garrisons at full strength, particularly in places where the forces were at hand-grips. In such places it was absolutely essential to have enough men on the spot to hurl back the enemy at once, should they breach the parapet and storm the works. The moments between the explosion of a mine and the crowning of the crater were so precious that immediate action was necessary with such men as were at hand; there was no time to await reinforcements. The side that crowned a crater first obtained an immense advantage. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3326/91087.html","bookId":386,"book":{"id":386,"title":"The Truth About Port Arthur","description":"简介： The siege of Port Arthur was the event of the late war in the Far East which most attracted the attention and interest of the rest of the world. There were other military operations, it is true, of equal if not of greater importance to the ultimate i...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3326","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
