{"id":26859,"no":43,"title":"CHAPTER XLI","content":"THE FALL OF FORTIFICATION NO. 3—THE FAILURE OF THE DEFENCE AND MEDICAL ORGANIZATIONS The garrison no longer showed the same steadiness that it had shown in the many desperate fights in the beginning of December. This was certainly owing to the example of Fort Chi-kuan-shan. The men\u0027s spirits seemed to have gone, and it was too late for the officers to stop the h?morrhage from the moral wounds caused by Fock. A passionate desire for life was everywhere noticeable, and any attempt to persuade the men that it was their duty to die was now useless. Early in the morning of the 31st Gorbatovsky was summoned by Fock to confer with him. The latter was, as usual, dilating on the splendid qualities of the men, and the pity it was to make them suffer needlessly, when a great pillar of smoke suddenly shot up from Fortification No. 3, followed by a tremendous explosion. \u0027I must go back, sir, and I will return at once and let you know what has happened.\u0027 \u0027Yes, come back as soon as you can.\u0027 Gorbatovsky then went off. Without waiting for a report from him, Fock there and then, in the presence of Captain Rodionoff, of the Engineers, wrote out his orders for the abandonment of Fortification No. 3, and sent them off by (I think) a sailor. There was no reference, no word[Pg 311] to the Commandant, or even to St?ssel. Comment is unnecessary; such action speaks for itself. What had happened is best seen by reference to the diary: \u0027December 31.—About 6 a.m. General Gorbatovsky was summoned by General Fock to the third line of defences to confer. At 9 a.m. three successive explosions took place in Fortification No. 3. After a few minutes a telephone message came in from the work to say that the enemy had exploded two charges in the corners of one of the faces. At the moment when the garrison, led by its commanding officer, Captain Spredovy, dashed out of the quarters in the gorge casemate, in order to get out into the interior of the place before the Japanese could seize the parapet, a third charge was fired, which had been laid in the gorge itself. This charge destroyed the gorge casemates, and buried the commanding officer and 140 men under the débris. The fall of this mass of stuff caused the hand-grenades heaped up in the casemates to detonate and set off four mines, laid under the foundations. The wounded and remnants of the garrison were thus shut up in the casemate, with only one small exit into the gorge ditch, through which they had to crawl. Not being able to get into the interior of the work, the garrison could do nothing to hold the position. The enemy perceived this at once, quickly got into the interior of the work, and seized the gorge, where they brought machine-guns. About 10 o\u0027clock we saw a white flag on the fortification. It is not known who raised it. General St?ssel and the Fortress Commandant were informed, and within a quarter of an hour the following order was received from General St?ssel: \u0027\"In view of the difficulty of getting out of the Fortification, the remainder of the garrison may surrender; those who can escape may try to.\" [Pg 312] \u0027This order was transmitted by telephone to the work, whence a list of those alive and wounded was telephoned back. The telephone was then cut to prevent the enemy hearing what we said. It was thought that, having seized the fortification, they would try and storm Tumulus Battery. General Gorbatovsky, therefore, ordered the garrison of this battery to be reinforced by one company of infantry, and a company of sailors to be sent into the trenches of the second line from Laperoff\u0027s battery along Vladimir and Mitrofanieff Batteries. About eleven o\u0027clock the enemy\u0027s fire ceased. Gorbatovsky decided to hold the second line, having Tumulus Battery on the left flank and Eagle\u0027s Nest on the right. He told the Commandant of this, and asked leave to carry it out at night....\u0027 From St?ssel\u0027s order and subsequent dispositions on that day it is clear that he had no idea of the relationship between the second and third lines. Among other things he ordered the left flank of the second line to be held, while part of the third line was held (Stonebroken Ridge and Big Hill). From this it was plain that St?ssel had never seen the second line of positions, and had never been on the hills near. After the fall of Erh-lung-shan Fort the besiegers opened a heavy fire on the north-east front from Tumulus Battery to Eagle\u0027s Nest. At 1 p.m. on January 1 they delivered an attack from the fort on Rocky Ridge. Our troops having lost heart, and being badly demoralized, gave way; but our gun-fire checked the enemy\u0027s assault, and the position remained in our possession. However, despite the very strict and definite orders given by the Commandant that the Chinese Wall from Rocky Ridge was to be held at all costs (it was quite possible), as soon as dusk came on, the abandonment of this wall and Rocky Ridge began under Fock\u0027s orders. The retirement was executed without any interference from the enemy, and[Pg 313] we were able to take with us all except the heavier guns. At five o\u0027clock on January 1 our troops were distributed along the second line—Tumulus Battery, Vladimir Battery, Mitrofanieff Hills, Eagle\u0027s Nest, the portion of the Chinese Wall behind Chi-kuan-shan Fort, and Kuropatkin Lunette. The enemy having now arrived at such a position, it seems a fitting moment to mention in what directions the organization of Port Arthur as a fortress had most failed. By this time most of the many grave defects in the original conception and subsequent execution of the material defences of this stronghold had become only too painfully clear, though it had not needed the test of bitter experience to make the more glaring errors obvious. There were terrible faults in the original tactical arrangement of the defences and in the details of the works themselves. The main line of permanent forts, the girdle, was much too close to the objects to be protected—i.e., the dockyard and town. The positions fortified by us were so close that, before capturing these positions, the enemy were able to bombard the place, damage our fleet, and demoralize the population. Some points of vital importance were entirely unprovided with permanent works—i.e., 203 Metre Hill, Angle and Long Hills—and were left for an improvised fortification, which was carried out in a scrambling way after the place had been completely invested. So little had these three positions been considered important that until after May 18 no paths to them had ever been made. Accepting the main line originally chosen, such as it was, there were further defects in the forts themselves. They were in many cases badly sited. On the eastern front the enemy had commanding positions within two miles (Ta-ku-shan, Sia-gu-shan), from which the interior of our defence could be[Pg 314] seen and fired into, and our communications shelled. This seriously hampered the movement of troops and the transport of munitions. They were also badly designed for their sites, having no good field of fire and much dead ground in front of them. It is not enough to say they were ill-concealed—they were ingenuously conspicuous. As regards armament, our long-range heavy guns, designed to fight the enemy\u0027s siege artillery, were placed right in the front, by which all the advantages to be obtained by their ranging power was thrown away. They naturally drew a concentration of the enemy\u0027s fire, and were soon rendered useless. They were a positive curse to the works in which they were placed, for they attracted a fire on to these works, to which they could not efficiently reply. In design many of the forts failed. They were not defiladed; they had no covered communications and no proper shelters. The parapets were feebly revetted with stones and sand-bags, and not having sufficient traverses, could be swept by enfilade fire. The concrete was not covered with earth, but was fully exposed. Lastly, such as they were, our forts were not finished and ready by the time they were wanted. The faults in the choice of position and ground were largely due to the fact that the scheme was originally a paper scheme, worked out on the map instead of on the ground. When the local engineers saw things on the ground, it was too late for any alteration—the scheme had been approved and confirmed. The paucity of works, their half-finished condition, and the absolute lack of many essentials, however, were all due to a cheese-paring, misplaced economy. Money was scarce for the vital defences of Arthur, while millions were being poured out on the palaces and wharves of Dalny, on a well-equipped harbour, which was eventually to help the Japanese. Let us now turn to the medical organization of the[Pg 315] Fortress. Did that correspond to the needs of the besieged Fortress? What influence had that on its fate? At the beginning of the war, in spite of the growth of the garrison, there were the following hospitals: (1) A mixed hospital of 400 beds; (2) the Reserve Hospital No. 1, 200 beds; (3) the Port Hospital, 40 beds; (4) two small civil hospitals. Of course, this quantity of hammocks could not possibly suffice to meet the needs of a garrison 50,000 strong. If to the garrison be added the fleet, the civilian and native population, the number of beds appears yet more absurd. According to the field service regulations, the proportion of beds to strength of troops should be 1 to 8; the proportion existing at the commencement of the war was 1 to 100! In March was opened the Naval Hospital, 200 beds, increased in July to 500; in April Reserve Hospital No. 6, 210 beds; in May three reserve hospitals, 630 beds; in June three reserve hospitals and a mobile hospital, 630 beds. After the fortnight\u0027s assaults in August, when all the hospitals were filled with wounded and were threatened with dysentery, Reserve Hospital No. 11 was opened, with 1,200 beds, in the naval barracks. Although, when once the war had started, it was daily to be expected that the enemy might land and Port Arthur be thus completely cut off, from the moment the first shot was fired the equipping of the hospitals with medical and other appliances was carried out at snail\u0027s pace. During the three months when the Fortress was in direct communication with the capital, no single additional bed was added—that is, omitting the Naval Hospital and the Mongolia, opened within two months of the beginning of the war for a special purpose. The former was arranged for during peace-time and the building had already been finished. It was only with the arrival of the new Commandant and the Sanitary Inspector of the Fortress, Civil[Pg 316] Councillor Subotin, that the organization of the medical service was gradually placed on some sort of footing. Their efforts were not particularly fruitful, because, instead of immediately giving effect to the urgent representations and applications of the Commandant, the authorities in the north spilt seas of ink, and continued thus to spend their time till we were cut off. At the beginning of the strict investment (after the fights on the advanced positions) there were only 2,500 beds in the hospitals under the Military and Naval Departments, and in the three hospital buildings taken over by the Red Cross there were only 500 beds, or a total of 3,000—one-third of the proper number. During the period of the strict blockade the number of beds increased. According to official statistics, another 1,500 were added; but this addition can only be taken as nominal, as there were practically no reserves in the medical store dep?ts at the beginning of the war, and it was impossible to procure any locally. But still, accepting these official figures, during the worst period in Arthur 4,500 sick and wounded could be tended. The minimum figure of sick at the end of the siege, which cannot be disputed, was 15,000; the actual number was more like 18,000. To show how these \u0027extra\u0027 10,000 to 12,000 suffering soldiers found shelter or relief means the unveiling of the most revolting picture of the siege. About half of these \u0027extra\u0027 cases were distributed somewhere in the hospitals above mentioned, and the remainder were put in hastily-run-up sheds—little cemeteries of living beings. In these during the last month of the siege there were sometimes as many as a thousand sick men crowded together, under the charge of one medical man, often a surgeon, who could only be a helpless spectator of their sufferings. Just glance at one of these \u0027infernos\u0027 in the month of December. Outside it is freezing; inside, in spite of the[Pg 317] musty and sickening stench, the cold is intense. On all sides is filth, nothing but filth, and on it and amongst it crawl millions of greasy grey lice. The silence is only broken by the sighs and groans of the sick and the hungry—for all in here are both sick and hungry. Death, the Liberator, is also here. He is in every corner, at the doors, at the windows, crawling along the floors and on to the bed-boards; he envelops everything—and waits. At the front a man dies suddenly, and all is over. In the hospitals Death is fought. But here, here, everything is in his power—he only has to wait. Second after second, minute after minute, hour after hour, men pass into eternity, into oblivion. There are hundreds of cases of scurvy. They lie side by side on the floor, on the bed-boards, underneath them, just as they were placed when they came in—some in great-coats, some in tunics, some in miserable boots, some barefooted. The faces are shapeless, swollen, and distorted, and upon the yellow skin are large dark blue bruises. The swollen gums, covered with hideous sores, project out of many grinning mouths, and show the lack of teeth, which are continuously falling out.... Here, far away from their friends and relations, forgotten by all, in horrible, complete consciousness, they are silently waiting the end. And to think that much of this suffering might have been spared these men had the Medical Service been properly organized, had the highest authorities done their duty, instead of busying themselves with writing orders. Things would not have been so bad even if St?ssel had confirmed the resolution of the Council of War about the killing of horses on December 8. Feeding the garrison on horses\u0027 flesh and white bread would at once have checked the growth of disease; and there were more than 3,000 horses and 3,000,000 pounds of flour in the Fortress. [Pg 318] The hospitals which existed in peace-time and the hospitals which expanded before the strict blockade answered their purpose fairly well. Those which were opened after the commencement of the strict blockade were far from doing so. They had no linen, nor beds, nor medical supplies, to say nothing of a sufficient quantity of trained nurses or doctors. The most disgraceful in this respect were Reserve Field Hospital No. 2, of 1,200 beds, opened for infectious cases and Mobile Field Hospital No. 5 (4th Division, General Fock), situated on Tiger\u0027s Peninsula. What could be expected from hospitals opened after the August assaults, when there was nothing left in the place with which to equip them? For the 1,200 beds of No. 2 only four doctors were told off. This hospital was renowned throughout the Fortress for its horrors: there is no need to describe them. A commission was appointed, which found the internal organization and arrangements of the hospital so revolting that the Hospital Inspector was immediately removed, and in his place was appointed M. Menshoff, who had recently been Chief of the Police in Dalny. Of 3,500 patients received into it, 1,500 died. Mobile Hospital No. 5 was little better. The system of opening a hospital extension on the day of a big attack was hopeless. It led to the sudden concentration of the sick and wounded in the hospitals nearest to where the attack was taking place, and where there was most congestion and appalling confusion. The wounded sometimes received no medical assistance for days together, as the personnel, working as it did for twenty-four hours in the twenty-four, could not cope with such a big influx, and they were carried from one hospital to another, often dying on the road. Meanwhile, the other hospitals, situated some way off from the locality attacked, did not take their share, owing to this inefficient organization. [Pg 319] Many of the doctors made desperate efforts, but when dealing with masses like this individual efforts were drops in the ocean. Subotin was the Fortress Sanitary Inspector, immediately subordinate to the Commandant, and he did his best; but there was no independent central organization in the Medical Service of the Fortress, which could have looked ahead and taken steps to distribute the sick properly in the hospitals during attacks. The Medical Service was dependent on the combatant authorities, whose hands were much taken up with fighting. What was required was a central administration, which could have foreseen what might happen and have controlled the arrangements. The officer in charge should have been invested with high rank and great authority, and should have had a properly trained personnel. Scurvy first made its appearance in the Fortress at a very early date: as early as April it appeared among the crew of the Pallada, but, thanks to timely and energetic measures, it was then stamped out. Unfortunately, no material preventive measures were taken against its recurrence, with the exception of vague suggestions as to better food and to add green food to the rations, though where better food could be got or vegetables could be bought was difficult to say. The scurvy cases increased from hundreds in October and thousands in November to 10,000 in December. The hospitals were so full of it that men were afraid of going into them, and at the end of the siege preferred to remain on duty, even when sick. Of 18,000 sick and wounded reported on the day the garrison marched out, 6,000 only were wounded; the balance were cases of scurvy. There were really more, as many men only slightly ill were doing duty. Dr. Kefel, of the Naval Hospital, on making an inspection of the men on one section of the right flank on December 11, found[Pg 320] that 21 per cent. of these on duty had scurvy. Exactly a fortnight afterwards, on his inspecting the same section, he found 40? per cent. suffering from it. These were the same men, for they had not been relieved. It was pointed out in his report on this that: \u0027If the spreading of scurvy increases in the above arithmetical progression, then in every fortnight we shall have 200 more on the sick list out of every thousand in the fighting line, and in one and a half months there will be no men left fit for duty.... \u0027If extreme measures are immediately taken, and we make use of all the meat, white bread, and antiscorbutic diet available, we may hope that those who are now well may not catch it, that the slight cases will not become worse, and that the worse cases will do tolerably well. Therefore there are before us two alternatives: to keep our food-supply and have, after a month and a half, not a single serviceable soldier, or to have eaten up our supplies of provisions at the end of six weeks, but during all that time to have kept the garrison in fighting strength. The strategist, not the arithmetician, can decide which is the more advantageous choice to make for the Fortress.\u0027 When this report was laid before General St?ssel, with a proposal to increase the ration, he replied: \u0027There cannot be so many men as this ill in that section. It is nonsense; there are not half that number there.\u0027 And so the question remained undecided. It was only at the very end that an order was given for a slight increase. To the question, \u0027Was it possible to have avoided this epidemic of scurvy, and could we have checked it with what we had in Port Arthur?\u0027 the answer is undoubtedly \u0027Yes!\u0027 How exactly this could have been done is a harder question to answer. From the moment we were cut off from the north the rations of the garrison were gradually[Pg 321] cut short, and by November, when the men were physically and morally weakened, the rations were reduced to the minimum. Instead of bread, biscuits were issued, which could not really be counted as rations for scurvy cases, as to these they were as useful as stones. The progress of the disease might have been checked if (1) a probable period of resistance had been thought out and fixed; (2) if rational use had been made of all sources of supply—horses, mules, cats, dogs, and flour. In the beginning of December more than 2,000,000 pounds of excellent flour was received. Had 3 pounds of white flour been issued per man, it would have lasted for three months. Half a pound of horse-flesh per man would have lasted for six weeks, though the number of horses for transport purposes would, of course, have been limited. The first was not done, thanks to the chaos resulting from the harmful interference of St?ssel and Fock. The second was decided on at the council of December 8 (at which, by some incomprehensible oversight, the Sanitary Inspector of the Fortress was not asked to attend), but was not confirmed by St?ssel. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3326/91091.html","bookId":386,"book":{"id":386,"title":"The Truth About Port Arthur","description":"简介： The siege of Port Arthur was the event of the late war in the Far East which most attracted the attention and interest of the rest of the world. There were other military operations, it is true, of equal if not of greater importance to the ultimate i...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3326","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
