{"id":97088,"no":13,"title":"Page 13","content":"\"No, thank you. Wait a minute. Yes, I think I will have something. Why shouldn\u0027t I?\" \"No reason that I know of.\" She looked past me at the waitress and ordered a whiskey sour on the rocks. Her eyes met mine, glanced away, came back again. \"I can\u0027t say I\u0027m happy to be here,\" she said. \"Neither am I.\" \"It was your idea. And you had me over a barrel, didn\u0027t you? You must get a kick out of making people do what you want them to do.\" \"I used to pull wings off flies.\" \"I wouldn\u0027t be surprised.\" She tried to glare, and then she lost the handle of it and grinned in spite of herself. \"Oh, shit,\" she said. \"You\u0027re not going to be dragged into anything, Mrs. Thal.\" \"I hope not.\" \"You won\u0027t be. I\u0027m interested in learning something about Wendy Hanniford\u0027s life. I\u0027m not interested in turning your life upside down.\" Our drinks arrived. She picked hers up and studied it as if she had never seen anything quite like it before. It seemed an ordinary enough whiskey sour. She took a sip, set it down, fished out the maraschino cherry and ate it. I swallowed a little bourbon and waited for her. \"You can order something to eat if you want. I\u0027m not hungry.\" \"Neither am I.\" \"I don\u0027t know where to start. I really don\u0027t.\" I wasn\u0027t sure myself. I said, \"Wendy doesn\u0027t seem to have had a job. Was she working when you first moved in with her?\" \"No. But I didn\u0027t know that.\" \"She told you she had a job?\" She nodded. \"But she was always very vague about it. I didn\u0027t pay too much attention, to tell you the truth. I was mainly interested in Wendy to the extent that she had an apartment I could share for a hundred dollars a month.\" \"That\u0027s all she charged you?\" \"Yes. At the time she told me the apartment was two hundred a month and we were splitting it down the middle. I never saw the lease or anything, and I sort of assumed that I was paying a little more than half. That was all right with me. It was her furniture and everything, and it was such a bargain for me. Before that I was at the Evangeline House. Do you know what that is?\" \"On West Thirteenth?\" \"That\u0027s right. Somebody recommended it to me, it\u0027s a residence for proper young ladies on their own in the big city.\" She made a face. \"They had curfews and things like that. It was really pretty ridiculous, and I was sharing a small room with a girl, she was some kind of a Southern Baptist and she was praying all the time, and you couldn\u0027t have male visitors, and it was all pretty lame. And it cost me almost as much as it cost to share the apartment with Wendy. So if she was making a little money on me, that was fine. It wasn\u0027t until quite a bit later that I found out the apartment was renting for a lot more than two hundred a month.\" \"And she wasn\u0027t working.\" \"No.\" \"Did you wonder where her money came from?\" \"Not for a while. I gradually managed to realize that she never seemed to have to go to the office, and when I said something, she admitted she was between jobs at the moment. She said she had enough money so that she didn\u0027t care if she didn\u0027t find anything for a month or two. What I didn\u0027t realize was that she wasn\u0027t even looking for work. I would come home from my own job, and she would say something about employment agencies and job interviews, and I would have no way of knowing that she hadn\u0027t even been looking.\" \"Was she a prositute at the time?\" \"I don\u0027t know if you would call it that.\" \"How do you mean?\" \"She was taking money from men. I guess she had been doing that for as long as she was in the apartment. But I don\u0027t know if she was exactly a prostitute.\" \"How did you first figure out what was going on?\" She picked up her drink and took another sip of it. She put the glass down and worried her forehead with her fingertips. \"It was gradual,\" she said. I waited. \"She was dating a lot. Older men, but that didn\u0027t surprise me. And usually, uh, well, she and her date would go to bed.\" She lowered her eyes. \"I wasn\u0027t snooping, but it was impossible not to notice this. The apartment, she had the bedroom and I had the living room, there was a convertible sofa in the living room-\" \"I\u0027ve seen the apartment.\" \"Then you know the layout. You have to go through the living room to get into the bedroom, so if I was home, she would bring her date through my room and into the bedroom, and they would be in there for half an hour or an hour, and then either Wendy would walk him to the door or he would go out by himself.\" \"Did this bother you?\" \"That she was having sex with them? No, it didn\u0027t bother me. Why would it bother me?\" \"I don\u0027t know.\" \"One of the reasons I moved out of Evangeline House was to live like an adult. I wasn\u0027t a virgin myself. And the fact that Wendy brought men to the apartment meant I could feel free to bring men home myself if I wanted to.\" \"Did you?\" She colored. \"I wasn\u0027t seeing anyone special at the time.\" \"So you knew Wendy was promiscuous, but you didn\u0027t know she was taking money.\" \"Not at the time, no.\" \"She was seeing a great many different men?\" \"I don\u0027t know. I saw the same men over again on several occasions, especially at first. A lot of the time I didn\u0027t meet the men she was with. I spent a lot of the time away from the apartment. Or I would come home when she was already in the bedroom with someone, and I might go out for a drink or something and come back after he had left.\" I studied her, and she averted her eyes. I said, \"You suspected something almost from the beginning, didn\u0027t you?\" \"I don\u0027t know what you mean.\" \"There was something about the men.\" \"I suppose so.\" \"What was it? What were the men like?\" \"Older, of course, but that didn\u0027t surprise me. Also, they were all well dressed. They looked like, oh, I don\u0027t know. Businessmen, lawyers, professional men. And I just had the feeling that most of them were married. I couldn\u0027t tell you why I thought so, but I did. It\u0027s hard to explain.\" I ordered another round of drinks, and she started to loosen up. The picture began to fill in and take form. There were telephone calls which she answered when Wendy was out of the apartment, cryptic messages she had to relay. There was the drunk who showed up one night when Wendy wasn\u0027t home who told Marcia that she would do just fine and made a clumsy pass at her. She had managed to get rid of him, but still didn\u0027t realize that Wendy\u0027s male friends constituted a source of income to her. \"I thought she was a tramp,\" she said. \"I\u0027m not a moralist, Mr. Scudder. During that time I was probably going overboard in the opposite direction. Not in terms of how I behaved, but how I felt about things. All those uptight virgins at Evangeline House, and the result was that I had sort of mixed feelings about Wendy.\" \"How?\" \"I thought what she was doing was probably a bad idea. That it would be bad for her emotionally. You know, ego damage, that kind of thing. Because down underneath she was always so innocent.\" \"Innocent?\" She gnawed a fingernail. \"I don\u0027t know how to explain this. There was this little girl quality to her. I had the feeling that whatever kind of sex life she led she would still be a little girl underneath it all.\" She thought for a moment, then shrugged. \"Anyway, I thought her behavior was basically self-destructive. I thought she was going to get hurt.\" \"You don\u0027t mean physically injured.\" \"No, I mean emotionally. And at the same time I have to say I envied her.\" \"Because she was free?\" \"Yes. She didn\u0027t seem to have any hang-ups. She was completely free of guilt as far as I could see. She did whatever she wanted to do. I envied that because I believed in that kind of freedom, or thought I did, and yet my own life didn\u0027t reflect it.\" She grinned suddenly. \"I also envied her life because it was so much more exciting than mine. I had some dates but nothing very interesting, and the boys I went out with were around my own age and didn\u0027t have much money. Wendy was going out for dinners at places like Barbetta\u0027s and the Forum, and I was seeing the inside of a lot of Orange Julius\u0027s. So I couldn\u0027t help envying her a little.\" She excused herself and went to the ladies room. While she was gone I asked the waitress if there was any fresh coffee. She said there was, and I asked her to bring a couple of cups. I sat there waiting for Marcia Thal and wondering why Wendy had wanted a roommate in the first place, especially one who was ignorant of how she earned her keep. The hundred dollars a month seemed insufficient motive, and the inconvenience of functioning as a prostitute under the conditions Marcia had described would have greatly outweighed the small source of income Marcia represented. She returned to the table just as the waitress was bringing the coffee. \"Thanks,\" she said. \"I was just starting to feel those drinks. I can use this.\" \"So can I. I\u0027ve got a long drive back.\" She took a cigarette. I picked up a pack of matches and lit it for her. I asked how she had found out that Wendy was taking money for her favors. \"She told me.\" \"Why?\" \"Hell,\" she said. She blew out smoke in a long, thin column. \"She just told me, okay? Let\u0027s leave it at that.\" \"It\u0027s a lot easier if you just tell me everything, Marcia.\" \"What makes you think there\u0027s anything more to tell?\" \"What did she do, pass on one of her dates to you?\" Her eyes flared. She closed them briefly, drew on her cigarette. \"It was almost like that,\" she said. \"Not quite, but that\u0027s pretty close. She told me a friend of hers had a business associate in from out of town and asked if I\u0027d like to date the guy, to double with her and her friend. I said I didn\u0027t think so, and she talked about how we would see a good show and have a good dinner and everything. And then she said, \u0027Be sensible, Marcia. You\u0027ll have a good time, and you\u0027ll make a few dollars out of it.\u0027 \" \"How did you react?\" \"Well, I wasn\u0027t shocked. So I must have suspected all along that she was getting money. I asked her what she meant, which was a pretty stupid question at that point, and she said that the men she dated all had plenty of money, and they realized it was tough for a young woman to earn a decent living, and at the end of the evening they would generally give you something. I said something about wasn\u0027t that prostitution, and she said she never asked men for money, nothing like that, but they always gave her something. I wanted to ask how much but I didn\u0027t and then she told me anyway. She said they always gave at least twenty dollars and sometimes a man would give her as much as a hundred. The man she was going to be seeing always gave her fifty dollars, she said, so if I went along it would mean that his friend would be almost certain to give me fifty dollars, and she asked if I didn\u0027t think that was a good return on an evening that involved nothing but eating a great dinner and seeing a good show and then spending a half hour or so in bed with a nice, dignified gentleman. That was her phrase. \u0027A nice, dignified gentleman.\u0027 \"","sourceLink":"https://allnovel.net/the-sins-of-the-fathers-matthew-scudder-1/page-13.html","bookId":2319,"book":{"id":2319,"title":"The Sins of the Fathers (Matthew Scudder #1)","description":"Storyline: The Sins of the Fathers (Matthew Scudder #1) The hooker was young, pretty...and dead, butchered in a Greenwich village apartment. The prime suspect, a minister\u0027s son, was also dead, the victim of a jailhouse suicide. The case is closed, as far as the NYPD is concerned. Now the murdered prostitute\u0027s father wants it opened again-and that\u0027s where Matthew Scudder comes in. But this assignment carries the unmistakable stench of sleaze and perversion, luring ex-cop-turned-investigator Scudder into a sordid world of phony religion and murderous lust where children must die for their parents most secret, unspeakable sins.","cover":"https://allnovel.net/images/the-sins-of-the-fathers-matthew-scudder-1.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-sins-of-the-fathers-matthew-scudder-1.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:24:27 PM"}}
