{"id":97090,"no":15,"title":"Page 15","content":"Wendy Hanniford. She had a thing for older men, and if you wanted to you could run a trace on it all the way back to unresolved feelings for the father she never saw. At college she realized her own power and had affairs with professors. Then one of them fell too hard for her and a wheel came off, and by the time it was over she was out of school and on her own in New York. There were plenty of older men in New York. One of them took her to Miami Beach. The same one, or another, provided her with a job reference when she rented her apartment. And all along the line there must have been plenty of older men to take her to dinner, to slip her twenty dollars for taxi fare, to leave twenty or thirty or fifty dollars on the bureau. She had never needed a roommate. She had subsidized Marcia Maisel, asking considerably less than half the rent. It was likely she had subsidized Richie Vanderpoel as well, and it was just as likely she had taken him as a roommate for the same reason she\u0027d taken Marcia in, the same reason she had wanted Marcia to stick around. Because it was a lonely world, and she had always lived alone in it with only her father\u0027s ghost for company. The men she got, the men she was drawn to, were men who belonged to other women and who went home to them when they were through with her. She wanted someone in that Bethune Street apartment who didn\u0027t want to take her to bed. Someone who would just be good company. First Marcia-and hadn\u0027t Wendy perhaps been a little disappointed when Marcia agreed to go along on dates with her? I guessed that she had, because at the same time that she gained a companion on dates she lost a companion who had been not of that brittle world but of a piece with the innocence Marcia had sensed in Wendy herself. Then Richie, who had probably made an even better companion. Richie, a timid and reticent homosexual, who had improved the decor and cooked the gourmet meals and made a home for her while he kept his clothes in the living room and spent his nights on the convertible couch. And she in turn had provided Richie with a home. She\u0027d given him a woman\u0027s companionship without posing the sexual challenge another woman might have constituted. He moved in with her and out of the gay bars. I paid the check and left, heading down Broadway and back to the hotel. A panhandler, red-eyed and ragged, blocked my path. He wanted to know if I had any spare change. I shook my head and kept walking at him, and he scuttled out of the way. He looked as though he wanted to tell me to fuck myself if only he had the nerve. How much deeper did I want to go with it? I could fly to Indiana and make a nuisance of myself on the campus where Wendy had learned to define her role in life. I could easily enough learn the name of the professor whose affair with her had had such dramatic results. I could find that professor, whether he was still at that school or not. He would talk to me. I could make him talk to me. I could track down other professors who had slept with her, other students who had known her. But what could they tell me that I didn\u0027t know? I was not writing her biography. I was trying to capture enough of the essence of her so that I could go to Cale Hanniford and tell him who she was and how she got that way. I probably had enough to do a fair job of that already. I wouldn\u0027t find out much more in Indiana. There was only one problem. In a very real sense, my arrangement with Hanniford was more than a dodge around the detective licensing laws and the income tax. The money he gave me was a gift, just as the money I\u0027d given Koehler and Pankow and the postal clerk had been. And in return I was doing him a favor, just as they had done me favors. I was not working for him. So I couldn\u0027t call it quits just because I had the answers to Cale Hanniford\u0027s questions. I had a question or two of my own, and I didn\u0027t have all the answers nailed down yet. I had most of it, or thought I did, but there were still a few blank spaces and I wanted to fill them in. VINCENT was at the desk when I walked in. He had given me a hard time awhile back, and he still wasn\u0027t sure how I felt about him. I\u0027d just given him a ten for Christmas, which should have clued him in that I harbored no ill feelings, but he still had a tendency to cringe when I approached. He cringed a little now, then handed me my room key and a slip of paper that informed me Kenny had called. There was a number where I could reach him. I called it from my room. \"Ah, Matthew,\" he said. \"How nice of you to call.\" \"What\u0027s the problem?\" \"There is no problem. I\u0027m just busy enjoying a day off. It was that or go to jail, and I\u0027m none too fond of jails. I\u0027m sure they would bring back unpleasant memories.\" \"I don\u0027t follow you.\" \"Am I being terribly oblique? I talked to the good Lieutenant Koehler, just as you suggested. Sinthia\u0027s is scheduled to be raided sometime this evening. Forewarned is forearmed, to coin a phrase, so I took the precaution of engaging one of my bartenders to mind the store this afternoon and evening.\" \"Does he know what\u0027s coming?\" \"I\u0027m not diabolical, Matthew. He knows he\u0027ll be locked up. He also knows that he\u0027ll be bailed out in nothing flat and charges will be dropped in short order. And he knows he\u0027ll be fifty dollars richer for the experience. Personally, I wouldn\u0027t suffer the indignity of an arrest for ten times that sum, but different strokes for different folks, to coin another phrase. Your Lieutenant Koehler was most cooperative, I might add, except he wanted a hundred dollars instead of the fifty you suggested. I don\u0027t suppose I ought to have tried bargaining with him?\" \"Probably not.\" \"That\u0027s what I thought. Well, if it works out, the price is a pittance. I hope you don\u0027t mind that I mentioned your name?\" \"Not at all.\" \"It seemed to afford me a certain degree of entrйe. But it leaves me owing you a favor, and I\u0027m delighted to be able to discharge my obligation forthwith.\" \"You got a line on Richie Vanderpoel?\" \"I did indeed. I devoted quite a few hours to asking pertinent questions at an after-hours place. The one on Houston Street?\" \"I don\u0027t know it.\" \"Quite my favorite blind pig. I\u0027ll take you there some night if you\u0027d like.\" \"We\u0027ll see. What did you find out?\" \"Ah, let me see. What did I find out? I talked to three gentlemen who were willing to remember taking our bright-eyed boy home for milk and cookies. I also talked to a few others who I would happily swear did the same, but their memories were clouded, sad to say. It seems I was quite right in thinking that he hadn\u0027t been hustling a buck. He never asked anyone for money, and one chap said he\u0027d tried to press a few bob on Richie for cabfare home and the lad wouldn\u0027t take it. Sterling character, wouldn\u0027t you say?\" \"I would.\" \"And all too rare in this day and age. That\u0027s it in the hard-fact department. The rest is impressions, but I gather that\u0027s what you\u0027re most interested in.\" \"Yes.\" \"Well, it seems Richard wasn\u0027t terribly sexy.\" \"Huh?\" He sighed. \"The dear boy didn\u0027t like it much and wasn\u0027t terribly good at it. I gather it wasn\u0027t just a matter of nerves, although he does seem to have been a nervous and apprehensive sort. It was more a matter of being uncomfortable with the whole thing and getting blessed little pleasure out of sex itself. And he retreated from intimacy. He\u0027d perform the dirty deed willingly enough, but he didn\u0027t want to have his hand held or his shoulder stroked. That\u0027s not unheard of, you know. There\u0027s a species of faggot that craves the sex but can\u0027t stand the closeness. All their friends are doomed to stay strangers. But he didn\u0027t seem to enjoy the sex all that much, either.\" \"Interesting.\" \"I thought you\u0027d say so. Also, once it was over, Richie was ever so anxious to be on his way. Not the sort to stay the night. Didn\u0027t even care to linger for coffee and brandy. Just wham-bam-thank-you-sir. And no interest in a repeat performance at a later date. One chap really wanted to see the boy again, not because the sex was good, as it wasn\u0027t, but because he was intrigued. Thought he might pierce that grim exterior given another opportunity. Richie would have none of it. Didn\u0027t even want to speak to anyone once he\u0027d shared a pillow with him.\" \"These three men-\" \"No names, Matthew. I has me code of ethics, I does.\" \"I\u0027m not interested in their names. I just wondered if they ran to type.\" \"In what way?\" \"Age. Are they all about the same age?\" \"More or less.\" \"All fifty or more?\" \"How did you know?\" \"Just a guess.\" \"Well, it\u0027s a good one. I\u0027d place them all between fifty or sixty. And they look their years, poor devils, unlike those of us who have bathed in the fountain of youth.\" \"It all fits.\" \"How?\" \"Too complicated to explain.\" \"Meaning bugger off? I don\u0027t mind. The mere satisfaction of knowing I\u0027ve been helpful, Matthew, is reward enough for me. It\u0027s not as though I\u0027d want a story to tell my grandchildren in my old age.\" Chapter 12 Eddie Koehler was away from his desk. I left a message for him to call me back, then went downstairs and picked up a paper at the newsstand in the lobby. I had worked my way through to Dear Abby when the phone rang. He thanked me for sending Kenny to him, his voice wary as he did so. I wasn\u0027t on the force, and he shouldn\u0027t have to kick any of it back to me. I set his mind at rest. \"You could do me a little favor in return. You can find someone to make a few phone calls or look in the right books. I could probably do it myself, but it would take me three times as long.\" I spelled it out for him. It was an easy way for him to balance the books with me, and he was glad to grab it. He said he\u0027d get back to me, and I told him I\u0027d hang around and wait for his call. It came almost exactly an hour later. J.J. Cottrell, Inc., had had offices in the Kleinhans Building at William and Pine. The firm had published a Wall Street tip sheet for about a dozen years, going out of business at the time of the proprietor\u0027s death. The proprietor had been one Arnold P. Leverett, and he\u0027d died two and a half years ago. There had been no one named Cottrell connected with the firm. I thanked him and rang off. That rounded things out neatly enough. I hadn\u0027t been able to find a Cottrell because there had never been one in the first place. It was reasonable to assume that Leverett had played some sort of role in Wendy Hanniford\u0027s life, but whether it had been a large or a small role was now no longer material. The man couldn\u0027t be reached for comment without the services of a medium. For the hell of it I put through a call to the Eden Roc and got the manager again. He remembered me. I asked him if he could check the same register for Leverett, and it didn\u0027t take him as long this time because he knew right away where to find the records. Not too surprisingly, his records indicated that Mr. and Mrs. Arnold P. Leverett had been guests of the Eden Roc from the fourteenth to the twentieth of September. So I had the name of one of the men in her life. If Leverett had left a widow, I could go and annoy her, but it would be hard to think up a less purposeful act. What I\u0027d really accomplished was more negative than positive. I could now forget about tracing the man who had taken her to Florida, and I could quit wondering who in hell J.J. Cottrell was. He wasn\u0027t a person, he was a corporation, and he was out of business. I went around the corner to Armstrong\u0027s and sat at the bar. It had already been a long day, and the drive to Mamaroneck and back had tired me more than I realized. I figured on spending the rest of the night on that barstool, balancing coffee and bourbon until it was late enough to go back to my room and go to sleep.","sourceLink":"https://allnovel.net/the-sins-of-the-fathers-matthew-scudder-1/page-15.html","bookId":2319,"book":{"id":2319,"title":"The Sins of the Fathers (Matthew Scudder #1)","description":"Storyline: The Sins of the Fathers (Matthew Scudder #1) The hooker was young, pretty...and dead, butchered in a Greenwich village apartment. The prime suspect, a minister\u0027s son, was also dead, the victim of a jailhouse suicide. The case is closed, as far as the NYPD is concerned. Now the murdered prostitute\u0027s father wants it opened again-and that\u0027s where Matthew Scudder comes in. But this assignment carries the unmistakable stench of sleaze and perversion, luring ex-cop-turned-investigator Scudder into a sordid world of phony religion and murderous lust where children must die for their parents most secret, unspeakable sins.","cover":"https://allnovel.net/images/the-sins-of-the-fathers-matthew-scudder-1.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-sins-of-the-fathers-matthew-scudder-1.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:24:27 PM"}}
