{"id":97079,"no":4,"title":"Page 4","content":"She said, \"Listen, I\u0027m in the middle of something. I\u0027m an artist, I got work to do.\"\\n\\n \"It\u0027ll take you less time to answer my questions than it will to get rid of me.\"\\n\\n She thought this over, then turned abruptly and walked into the building. \"It\u0027s freezing out there,\" she said. \"C\u0027mon downstairs, we\u0027ll talk, but don\u0027t figure on taking up too much of my time, huh?\"\\n\\n I followed her down a flight of stairs to the basement. She had a single large room with kitchen appliances in one corner and an army cot on the west wall. There were exposed pipes and electrical cables overhead. Her art was sculpture, and there were several examples of her work in evidence. I never saw the piece she was currently working on. A wet cloth was draped over it. The other pieces were abstract, and there was a massive quality to them, a ponderousness suggestive of sea monsters.\\n\\n \"I\u0027m not going to be able to tell you much,\" she said. \"I\u0027m the super because I get a deal on the rent that way. I\u0027m handy, I can fix most things that go wrong, and I\u0027m mean enough to yell at people when they\u0027re late with the rent. Most of the time I keep to myself. I don\u0027t pay much attention to what goes on in the building.\"\\n\\n \"You knew Vanderpoel and Miss Hanniford?\"\\n\\n \"By sight.\"\\n\\n \"When did they move in?\"\\n\\n \"She was here before I moved in, and I\u0027ve been here two years in April. He moved in with her I guess a little over a year ago. I think just before Christmas if I remember right.\"\\n\\n \"They didn\u0027t move in together?\"\\n\\n \"No. She was living with someone else before that.\"\\n\\n \"A man?\"\\n\\n \"A woman.\"\\n\\n She didn\u0027t have any records, didn\u0027t know the name of Wendy\u0027s former roommate. She gave me the landlord\u0027s name and address. I asked her what she remembered about Wendy.\\n\\n \"Not a hell of a lot. I only notice people if they make trouble. She never had loud parties or played the stereo too loud. I was in the apartment a few times. The valve was shot on the bedroom radiator, and they were getting too much heat, they couldn\u0027t regulate it. I put a new valve in. That was just a couple of months ago.\"\\n\\n \"They kept the apartment neat?\"\\n\\n \"Very neat. Very attractive. They had the trim painted, and the place was furnished nice.\" She thought for a moment. \"I think maybe that was his doing. I was in the place before he moved in, and I think I remember it wasn\u0027t as nice then. He was sort of artsy.\"\\n\\n \"Did you know she was a prostitute?\"\\n\\n \"I still don\u0027t know it. I read lots of lies in the papers.\"\\n\\n \"You don\u0027t think she was?\"\\n\\n \"I don\u0027t have an opinion either way. I never had any complaints about her. Then again, she could have had ten men a day up there, and I wouldn\u0027t have known about it.\"\\n\\n \"Did she have visitors?\"\\n\\n \"I just told you. I wouldn\u0027t know about it. People don\u0027t have to get past me to get upstairs.\"\\n\\n I asked her who else lived in the building. There were five floor-through apartments, and she gave me the names of the tenants in each. I could talk to them if they were willing to talk to me, she said. But not the couple on the top floor-they were in Florida and wouldn\u0027t be back until the middle of March.\\n\\n \"You got enough?\" she said. \"I want to get back to what I was doing.\" She flexed her fingers, indicating an impatience to return them to the clay.\\n\\n I told her she had been very helpful.\\n\\n \"I don\u0027t see that I told you anything much.\"\\n\\n \"There\u0027s something more you could tell me.\"\\n\\n \"What?\"\\n\\n \"You didn\u0027t know them, either of them, and I realize you don\u0027t take much interest in the people in the building. But everybody invariably forms an impression of people they see frequently over an extended period of time. You must have had some sort of image of the two of them, some feeling that extended beyond your hard factual knowledge of them. That\u0027s probably been shifted out of position by what\u0027s happened in the past week, what you\u0027ve learned about them, but I\u0027d like to know what your impression of them was.\"\\n\\n \"What good would that do you?\"\\n\\n \"It would tell me what they looked like to human eyes. And you\u0027re an artist, you\u0027ve got sensibilities.\"\\n\\n She gnawed at a fingernail. \"Yeah, I see what you mean,\" she said after a moment. \"I just can\u0027t find where to pick up on it.\"\\n\\n \"You were surprised when he killed her.\"\\n\\n \"Anybody\u0027d be surprised.\"\\n\\n \"Because it changed how you saw them. How did you see them?\"\\n\\n \"Just as tenants, just ordinary-wait a minute. All right, you jarred something loose. I never even put words to the tune before, but you know how I thought of them? As brother and sister.\"\\n\\n \"Brother and sister?\"\\n\\n \"Right.\"\\n\\n \"Why?\"\\n\\n She closed her eyes, frowned. \"I can\u0027t say exactly,\" she said. \"Maybe the way they acted when they were together. Not anything they did. Just the vibrations they gave off, the sense you got of them when they were walking along. The sense of how they related to each other.\"\\n\\n I waited.\\n\\n \"Another thing. I didn\u0027t dwell on this, I mean I didn\u0027t give it any thought to speak of, but I sort of took it for granted that he was gay.\"\\n\\n \"Why?\"\\n\\n She had been sitting. She got up now and walked to one of her creations, a gunmetal-colored mound of convex planes taller and wider than herself. She faced away from me, tracing a curved surface with her stubby fingers.\\n\\n \"Physical type, I suppose. Mannerisms. He was tall and slender, he had a way of speaking. You\u0027d think I would know better than to think in those terms. With my figure and short hair, and working with my hands, and being good with electrical and mechanical things. People generally assume I\u0027m a lesbian.\" She turned around, and her eyes challenged me. \"I\u0027m not,\" she said.\\n\\n \"Was Wendy Hanniford?\"\\n\\n \"How would I know?\"\\n\\n \"You guessed Vanderpoel might be gay. Did you make the same guess about her?\"\\n\\n \"Oh. I thought- No, I\u0027m sure she wasn\u0027t. I generally know if a woman is gay by the way she relates to me. No, I assumed she was straight.\"\\n\\n \"And you assumed he wasn\u0027t.\"\\n\\n \"Right.\" She looked up at me. \"You want to know something? I still think he was a faggot.\"\\n\\n Chapter 4\\n\\n I had some dinner in an Italian place on Greenwich Avenue, then hit a couple of bars before I took a cab over to Johnny Joyce\u0027s. I told the bartender I was looking for Lewis Pankow, and he pointed me toward a booth in the back.\\n\\n I could have found him without help. He was tall and rangy and towheaded, with an open face and a recent shave. He stood up when I approached him. He was in civilian clothes, a gray glen-plaid suit that couldn\u0027t have cost him much, a pale blue shirt, a striped tie. I said I was Scudder, and he said he was Pankow, and he put out his hand, so I shook it. I sat down opposite him and ordered a double bourbon when the waiter came around. Pankow still had half a beer left in front of him.\\n\\n He said, \"The lieutenant said you wanted to see me. I guess it\u0027s about the Hanniford murder?\"\\n\\n I nodded. \"Hell of a good collar for you.\"\\n\\n \"I was lucky. The right place at the right time.\"\\n\\n \"It\u0027ll look good on your record.\"\\n\\n He flushed.\\n\\n \"Probably get a commendation out of it, too.\"\\n\\n The flush deepened. I wondered how old he was. Say twenty-two at the outside. I thought about his report and decided he\u0027d make detective third in a year or so.\\n\\n I said, \"I read your report. There was a lot of detail, but there were some things that you didn\u0027t have room for. When you got to the scene, Vanderpoel was standing about two doors from the building where the murder took place. Now what was he doing exactly? Dancing around? Running?\"\\n\\n \"More or less standing in one place. But moving around wildly. Like he had a lot of energy he had to work off. Like when you drink too much coffee and your hands get shaky, but his whole body was like that.\"\\n\\n \"You said his clothing was disarrayed. How?\"\\n\\n \"His shirttail was out of his pants. His belt was fastened, but his pants were unbuttoned and unzipped and his thing was hanging out.\"\\n\\n \"His penis?\"\\n\\n \"Right, his penis.\"\\n\\n \"Was he exposing himself deliberately?\"\\n\\n \"Well, it was hanging right out. He must of known about it.\"\\n\\n \"But he wasn\u0027t handling himself or thrusting out with his hips or anything like that?\"\\n\\n \"No.\"\\n\\n \"Did he have an erection?\"\\n\\n \"I didn\u0027t notice.\"\\n\\n \"You saw his cock and didn\u0027t notice if he had a hard-on or not?\"\\n\\n He flushed again. \"He didn\u0027t have one.\"\\n\\n The waiter brought my drink. I picked it up and looked into the glass. I said, \"You put down that he was uttering obscenities.\"\\n\\n \"Shouting them. I heard him shouting before I even turned the corner.\"\\n\\n \"What was he saying?\"\\n\\n \"You know.\"\\n\\n He embarrassed easy, this one. I kept myself from snapping at him. \"The words he used,\" I said.\\n\\n \"I don\u0027t like to use them.\"\\n\\n \"Force yourself.\"\\n\\n He asked if it was important, and I said it might be. He leaned forward and pitched his voice low. \"Motherfucker,\" he said.\\n\\n \"He just kept yelling motherfucker?\"\\n\\n \"Not exactly.\"\\n\\n \"I want the words he used.\"\\n\\n \"Yeah, okay. What he said was, he kept yelling, \u0027I\u0027m a motherfucker, I\u0027m a motherfucker, I fucked my mother.\u0027 He kept shouting this over and over.\"\\n\\n \"He said he was a motherfucker and he fucked his mother.\"\\n\\n \"Right, that\u0027s what he said.\"\\n\\n \"What did you think?\"\\n\\n \"I thought he was crazy.\"\\n\\n \"Did you think he killed someone?\"\\n\\n \"Oh. No, the first thing I thought was he was hurt. He had blood all over him.\"\\n\\n \"His hands?\"\\n\\n \"Everywhere. His hands, his shirt, his pants, his face, he was all covered with blood. I thought he was cut, but then I saw he was all right and the blood must of come from somebody else.\"\\n\\n \"How could you tell?\"\\n\\n \"I just knew. He was all right, it wasn\u0027t his blood, so it was somebody else\u0027s.\" He hoisted his glass and drained it. I motioned for the waiter and ordered another beer for Pankow and a cup of coffee for myself. We sat there looking at the table until the waiter brought the order. Pankow was remembering things he\u0027d spent the past few days trying to forget, and he wasn\u0027t enjoying it much.\\n\\n I said, \"So you expected to find a body in the apartment.\"\\n\\n \"I knew I would, yeah.\"\\n\\n \"Who did you think it would be?\"\\n\\n \"Hell, I thought it would be his mother. From what he was saying, motherfucker, I fucked my mother, I thought he went nuts or something and killed his mother. I even thought that\u0027s who it was when I went in there, you know, on account of you couldn\u0027t tell age or anything at first, just this naked woman with blood everywhere, the sheets soaked, the blanket, all this very dark blood-\"\\n\\n His face was white tinged with green. I said, \"Easy, Lew.\"\\n\\n \"I\u0027m all right.\"\\n\\n \"I know you are. Put your head down between your knees. C\u0027mon, swing out from behind the table and put your head down. You\u0027re all right.\"\\n\\n \"I know.\" \\n\\n","sourceLink":"https://allnovel.net/the-sins-of-the-fathers-matthew-scudder-1/page-4.html","bookId":2319,"book":{"id":2319,"title":"The Sins of the Fathers (Matthew Scudder #1)","description":"Storyline: The Sins of the Fathers (Matthew Scudder #1) \\n The hooker was young, pretty...and dead, butchered in a Greenwich village apartment. The prime suspect, a minister\u0027s son, was also dead, the victim of a jailhouse suicide. The case is closed, as far as the NYPD is concerned. Now the murdered prostitute\u0027s father wants it opened again-and that\u0027s where Matthew Scudder comes in. But this assignment carries the unmistakable stench of sleaze and perversion, luring ex-cop-turned-investigator Scudder into a sordid world of phony religion and murderous lust where children must die for their parents most secret, unspeakable sins.\\n","cover":"https://allnovel.net/images/the-sins-of-the-fathers-matthew-scudder-1.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-sins-of-the-fathers-matthew-scudder-1.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:24:27 PM"}}
