{"id":97084,"no":9,"title":"Page 9","content":"\"Richard\u0027s mother-\"\\n\\n He closed his eyes. \"I lost my wife almost fifteen years ago,\" he said.\\n\\n \"I didn\u0027t know that.\"\\n\\n \"It was hard for both of us. For Richard and for myself. In retrospect I think that I should have married again. I never… never entertained the idea. I was able to have a housekeeper, and my own duties facilitated my spending more time with him than the average father might have been able to manage. I thought that was sufficient.\"\\n\\n \"And now you don\u0027t think so?\"\\n\\n \"I don\u0027t know. I occasionally think there is very little we can do to change our destiny. Our lives play themselves out according to a master plan.\" He smiled briefly. \"That is either a very comforting thing to believe or quite the opposite, Mr. Scudder.\"\\n\\n \"I can see how it could be.\"\\n\\n \"Other times I think there ought to have been something I could have done. Richard was drawn very much into himself. He was shy, reticent, very much a private person.\"\\n\\n \"Did he have much of a social life? I mean during high school, while he was living here.\"\\n\\n \"He had friends.\"\\n\\n \"Did he date?\"\\n\\n \"He wasn\u0027t interested in girls at that time. He was never interested in girls until he came into that woman\u0027s clutches.\"\\n\\n \"Did it bother you that he wasn\u0027t interested in girls?\"\\n\\n That was as close as I cared to come to intimating that Richie was interested in boys instead. If it registered at all, Vanderpoel didn\u0027t show it. \"I was not concerned,\" he said. \"I took it for granted that Richard would ultimately develop a fine and healthy loving relationship with the girl who would eventually become his wife and bear his children. That he was not involved in social dating in the meantime did not upset me. If you were in a position to see what I see, Mr. Scudder, you would realize that a great deal of trouble stems from too much involvement of one sex with the other sex. I have seen girls pregnant in their early teens. I have seen young men forced into marriage at a very tender age. I have seen young people afflicted with unmentionable diseases. No, I was if anything delighted that Richard was a late bloomer in this area.\"\\n\\n He shook his head. \"And yet,\" he said, \"perhaps if he had been more experienced, perhaps if he had been less innocent, he would not have been so easy a victim for Miss Hanniford.\"\\n\\n We sat for a few moments in silence. I asked him a few more things without getting anything significant in reply. He asked again if I wanted a cup of coffee. I declined and said it was time I was getting on my way. He didn\u0027t try to persuade me to stay.\\n\\n I got my coat from the vestibule closet where the housekeeper had stashed it. As I was putting it on I said, \"I understand you saw your son once after the killing.\"\\n\\n \"Yes.\"\\n\\n \"In his cell.\"\\n\\n \"That is correct.\" He winced almost imperceptibly at the recollection. \"We didn\u0027t speak at length. I tried only to do what little I could to put his mind at rest. Evidently I failed. He… he elected to mete out his own punishment for what he had done.\"\\n\\n \"I talked to the lawyer his case was assigned to. A Mr. Topakian.\"\\n\\n \"I didn\u0027t meet the man myself. After Richard… took his own life… well, I saw no point in seeing the lawyer. And I couldn\u0027t bring myself to do it.\"\\n\\n \"I understand.\" I finished buttoning my coat. \"Topakian said Richard had no memory of the actual murder.\"\\n\\n \"Oh?\"\\n\\n \"Did your son say anything to you about it?\"\\n\\n He hesitated for a moment, and I didn\u0027t think he was going to answer. Then he gave his head an impatient shake. \"There\u0027s no harm in saying it now, is there? Perhaps he was speaking truthfully to the lawyer, perhaps his memory was clouded at the time.\" He sighed again. \"Richard told me he had killed her. He said he did not know what had come over him.\"\\n\\n \"Did he give any explanation?\"\\n\\n \"Explanation? I don\u0027t know if you would call it an explanation, Mr. Scudder. It explained certain things to me, however.\"\\n\\n \"What did he say?\"\\n\\n He looked off over my shoulder, searching his mind for the right words. Finally he said, \"He told me that there was a sudden moment of awful clarity when he saw her face. He said it was as if he had been given a glimpse of the Devil and knew only that he must destroy, destroy.\"\\n\\n \"I see.\"\\n\\n \"Without absolving my son, Mr. Scudder, I nevertheless hold Miss Hanniford responsible for the loss of her own life. She snared him, she blinded him to her real self, and then for a moment the veil slipped aside, the blindfold was loosed from around his eyes, and he saw her plain. And saw, I feel certain, what she had done to him, to his life.\"\\n\\n \"You almost sound as though you feel it was right for him to kill her.\"\\n\\n He stared at me, eyes briefly wide in shock. \"Oh, no,\" he said. \"Never that. One does not play God. It is God\u0027s province to punish and reward, to give and to take away. It is not Man\u0027s.\"\\n\\n I reached for the doorknob, hesitated. \"What did you say to Richard?\"\\n\\n \"I scarcely remember. There was little to be said, and I\u0027m afraid I was in too deep a state of personal shock to be very communicative. My son asked my forgiveness. I gave him my blessing. I told him he should look to the Lord for forgiveness.\" At close range his blue eyes were magnified by the thick lenses. There were tears in their corners. \"I only hope he did,\" he said. \"I only hope he did.\"\\n\\n Chapter 8\\n\\n I got out of bed while the sky was still dark. I still had the same headache I\u0027d gone to bed with. I went into the bathroom, swallowed a couple of aspirins, then forced myself to put in some time under a hot shower. By the time I was dry and dressed, the headache was mostly gone and the sky was starting to brighten up.\\n\\n My head was full of fragments of conversation from the night before. I\u0027d returned from Brooklyn with a headache and a thirst, and I\u0027d treated the second more thoroughly than the first. I remember a sketchy conversation with Anita on Long Island-the boys were fine, they were sleeping now, they\u0027d like to come in to New York and see me, maybe stay overnight if it was convenient. I\u0027d said that would be great, but I was working on a case right now. \"The cobbler\u0027s children always go barefoot,\" I told her. I don\u0027t think she knew what I was talking about.\\n\\n I got to Armstrong\u0027s just as Trina was going off duty. I bought her a couple of stingers and told her a little about the case I was working on. \"His mother died when he was six or seven years old,\" I said. \"I hadn\u0027t known that.\"\\n\\n \"Does it make a difference, Matt?\"\\n\\n \"I don\u0027t know.\"\\n\\n After she left I sat by myself and had a few more drinks. I was going to have a hamburger toward the end, but they had already closed the kitchen. I don\u0027t know what time I got back to my room. I didn\u0027t notice, or didn\u0027t remember.\\n\\n I had breakfast and a lot of coffee next door at the Red Flame. I thought about calling Hanniford at his office. I decided it could wait.\\n\\n The clerk in the branch post office on Christopher Street informed me that forwarding addresses were only kept active for a year. I suggested that he could check the back files, and he said it wasn\u0027t his job and it could be very time-consuming and he was overworked as it was. That would have made him the first overworked postal employee since Benjamin Franklin. I took a hint and palmed him a ten-dollar bill. He seemed surprised, either at the amount or at being given anything at all besides an argument. He went off into a back room and returned a few minutes later with an address for Marcia Maisel on East Eighty-fourth near York Avenue.\\n\\n The building was a high-rise with underground parking and a lobby that would have served a small airport. There was a little waterfall with pebbles and plastic plants. I couldn\u0027t find a Maisel in the directory of tenants. The doorman had never heard of her. I managed to find the super, and he recognized the name. He said she\u0027d gotten married a few months ago and moved out. Her married name was Mrs. Gerald Thal. He had an address for her in Mamaroneck.\\n\\n I got her number from Westchester Information and dialed it. It was busy the first three times. The fourth time around it rang twice and a woman answered.\\n\\n I said, \"Mrs. Thal?\"\\n\\n \"Yes?\"\\n\\n \"My name is Matthew Scudder. I\u0027d like to talk to you about Wendy Hanniford.\"\\n\\n There was a long silence, and I wondered if I had the right person after all. I\u0027d found a stack of old magazines in a closet of Wendy\u0027s apartment with Marcia Maisel\u0027s name and the Bethune Street address on them. It was possible that there had been a false connection somewhere along the way-the postal clerk could have pulled the wrong Maisel, the superintendent could have picked the wrong card out of his file.\\n\\n Then she said, \"What do you want from me?\"\\n\\n \"I want to ask you a few questions.\"\\n\\n \"Why me?\"\\n\\n \"You lived in the Bethune Street apartment with her.\"\\n\\n \"That was a long time ago.\" Long ago, and in another country. And besides, the wench is dead. \"I haven\u0027t seen Wendy in years. I don\u0027t even know if I would recognize her. Would have recognized her.\"\\n\\n \"But you did know her at one time.\"\\n\\n \"So what? Would you hold on? I have to get a cigarette.\" I held on. She returned after a moment and said, \"I read about it in the newspapers, of course. The boy who did it killed himself, didn\u0027t he?\"\\n\\n \"Yes.\"\\n\\n \"Then why drag me into it?\"\\n\\n The fact that she didn\u0027t want to be dragged into it was almost reason enough in itself. But I explained the nature of my particular mission, Cale Hanniford\u0027s need to know about the recent past of his daughter now that she had no future. When I had finished she told me that she guessed she could answer some questions.\\n\\n \"You moved from Bethune Street to East Eighty-fourth Street a year ago last June.\"\\n\\n \"How do you know so much about me? Never mind, go on.\"\\n\\n \"I wondered why you moved.\"\\n\\n \"I wanted a place of my own.\"\\n\\n \"I see.\"\\n\\n \"Plus it was nearer my work. I had a job on the East Side, and it was a hassle getting there from the Village.\"\\n\\n \"How did you happen to room with Wendy in the first place?\"\\n\\n \"She had an apartment that was too big for her, and I needed a place to stay. It seemed like a good idea at the time.\"\\n\\n \"But it didn\u0027t turn out to be a good idea?\"\\n\\n \"Well, the location, and also I like my privacy.\"\\n\\n She was going to give me whatever answers would get rid of me most efficiently. I wished I were talking to her face-to-face instead of over the telephone. At the same time I hoped I wouldn\u0027t have to kill a day driving out to Mamaroneck.\\n\\n \"How did you happen to share the apartment?\"\\n\\n \"I just told you, she had a place-\"\\n\\n \"Did you answer an ad?\"\\n\\n \"Oh, I see what you mean. No, I ran into her on the street, as a matter of fact.\"\\n\\n \"You had known her previously?\"\\n\\n \"Oh, I thought you realized. I knew her at college. I didn\u0027t know her well, we were never close, see, but it was a small college and everybody more or less knew everybody, and I ran into her on the street and we got to talking.\"\\n\\n \"You knew her at college.\"\\n\\n \"Yeah, I thought you realized. You seem to know so many facts about me, I\u0027m surprised you didn\u0027t know that.\" \\n\\n","sourceLink":"https://allnovel.net/the-sins-of-the-fathers-matthew-scudder-1/page-9.html","bookId":2319,"book":{"id":2319,"title":"The Sins of the Fathers (Matthew Scudder #1)","description":"Storyline: The Sins of the Fathers (Matthew Scudder #1) \\n The hooker was young, pretty...and dead, butchered in a Greenwich village apartment. The prime suspect, a minister\u0027s son, was also dead, the victim of a jailhouse suicide. The case is closed, as far as the NYPD is concerned. Now the murdered prostitute\u0027s father wants it opened again-and that\u0027s where Matthew Scudder comes in. But this assignment carries the unmistakable stench of sleaze and perversion, luring ex-cop-turned-investigator Scudder into a sordid world of phony religion and murderous lust where children must die for their parents most secret, unspeakable sins.\\n","cover":"https://allnovel.net/images/the-sins-of-the-fathers-matthew-scudder-1.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-sins-of-the-fathers-matthew-scudder-1.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:24:27 PM"}}
