{"id":53631,"no":1306,"title":"Chapter 1302: Critical Juncture....","content":"Chapter 1302: Critical Juncture....\\n\\n It was a heavy price to pay, and despite how strong Meng Hao was, he still ended up being seriously injured. His consciousness was fading, and blood oozed out everywhere. Just when he was about to move to consume Lord White’s Mountain and Sea Incantation, his mind reeled, and he turned to look at Lord White.\\n\\n In that moment, Lord White was collapsing, hovering on the verge of death. However, an aura that was not of the Mountain and Sea Realm suddenly emanated out from him. It only lasted for a moment, but it managed to propel Lord White toward the rift that connected the Seventh Mountain and Sea with the Eighth. In the blink of an eye, he was on the verge of entering the rift.\\n\\n Things had been going hazy for Meng Hao, but now he forced his head to clear. Without the slightest hesitation, he then took a step toward Lord White; he absolutely could not allow him to escape!\\n\\n This had been a bitter battle, and Meng Hao was well aware that the victory he had eked out had come by chance, and definitely had not been a certainty from the outset. If the two of them fought again, he was not convinced he would be able to win again.\\n\\n As Lord White neared the rift, killing intent boiled in Meng Hao’s eyes. He then stretched his right hand out toward Lord White and made a grasping motion.\\n\\n It was none other than the Star Plucking Magic!\\n\\n He was using the absolute last scrap of energy that he had left to unleash this magic. Rumbling could be heard as Lord White suddenly began to tremble. He was already half-covered with fissures as Meng Hao latched onto him and began to drag him back.\\n\\n It was in that moment that the shattered and bleeding Lord White suddenly opened his eyes, within which could not be seen even a trace of madness or despair. In fact, they were icy cold to the point where... they shone with merciless clarity.\\n\\n Apparently, everything he had just done had been an act. His true intent had been to wait for Meng Hao to get so close that he couldn’t evade the next attack.\\n\\n “In the end... you’re still just a bit too immature,” Lord White said quietly. As of this moment, the feeling he gave off, both in terms of his energy and his words, were completely different from moments ago. He was not possessed. No... this was the true him!\\n\\n The Lord of the Seventh Mountain and Sea!\\n\\n His eyes were icy cold as he extended his right hand and performed an incantation gesture. Then he grabbed out in Meng Hao’s direction, causing the starry sky to tremble as an indescribable, shocking power erupted out.\\n\\n Despite his complete calm, blood sprayed out of his mouth, and his face went ashen. Perhaps he had been keeping the true nature of his personality hidden beneath the guise of insanity, but as for his injuries... they were very real. He had been seriously injured almost to the breaking point, and this attack was powered by the last bit of power he had.\\n\\n He only had enough energy to make this one final attack. However, the way he had lured Meng Hao in, and his intense desire to kill him, showed how profoundly sinister Lord White was, and how adept he was at scheming!\\n\\n He might be on the verge of lapsing into unconsciousness, and he might have run almost completely out of energy, but he could still eke out a victory in the end!\\n\\n Meng Hao’s face fell, and bitterness welled up in his heart as his Star Plucking Magic was destroyed by Lord White’s grasping attack. Blood oozed out of the corners of Meng Hao\u0027s mouth, and his vision swam. He had no power to fight back, and as the attack closed in and became clearer, an unyielding gleam appeared within Meng Hao’s eyes.\\n\\n However, all of a sudden, a loud squawk echoed out from within Meng Hao’s bag of holding. At this critical juncture, a multi-colored beam of light suddenly flew out, which was none other than... Lord Fifth!\\n\\n Lord Fifth looked extremely pleased, and even let out a domineering squawk.\\n\\n “Every time there’s a critical moment, Lord Fifth takes the field to turn the tables!” the parrot howled, flapping its wings. “Hahaha! Lord Fifth has a fever, and there’s only one cure! I’ve been waiting for this day for a very, very long time.” All of a sudden, the Demonic cultivators from the Ninth Sea popped out.\\n\\n It was a grand scene as they settled into formation... and prepared to sing.\\n\\n “Come, come, sing together with Lord Fifth!”\\n\\n The parrot’s shrill voice echoed out in all directions, as did the completely shocking seafood song.\\n\\n “I\u0027m a seafood dish, I\u0027m a seafood dish....”\\n\\n As the seafood song echoed out, indescribable ripples appeared, which shot in the direction of Lord White’s attack. When they slammed into each other, Lord White’s attack shattered, transforming into infinite motes of light which slowly dissipated. It was at this point that the seafood song began to reach a climax.\\n\\n “... I was a bad kid when I was young, I’m a little seafood dish! Lalalalala! Seafood dish. Dobedobedoooo. Little seafood dish! Hey you, in the white robe, come, come, sing along with Lord Fifth!” Suddenly, the parrot flapped its wings, looking almost infatuated. Within the rift, Lord White’s eyes went wide, and he stared in complete and utter shock, his mind becoming a complete blank.\\n\\n As the Lord of the Seventh Mountain and Sea, he held a position of supreme respect. He had assumed there was nothing he hadn’t seen in his life... but he had never seen a parrot like this, who left him feeling completely overwhelmed. Then he heard singing that was so horrible it was impossible to even describe.\\n\\n Even more astonishing was that after the parrot spoke, and as the singing echoed out, Lord White almost couldn\u0027t stop himself from joining in to sing along. It was a sensation that left him feeling as though his head would explode.\\n\\n Before he could do anything, the ripples caused by the singing rumbled into the rift, inundating Lord White. He suddenly shivered, and then opened his mouth and began to sing.\\n\\n “I\u0027m your little, dear little seafood dish.... AAAAGGHHHHHH!!” Lord White only sang half a verse before he began to scream miserably. His eyes were wide with fear as he realized that his wounds were too serious, and he was beginning to lose consciousness. At this point, he knew that he would not be able to kill Meng Hao, so he gritted his teeth, causing that same aura from before to erupt out, the power that was not of the Mountain and Sea Realm. It wrapped him up and then dragged him into the rift.\\n\\n Even as he vanished, he shouted out one more time in rage, “I’ll be back!!”\\n\\n “Hey!” the parrot said, glaring. “Why are you leaving? Fudge, can’t you give Lord Fifth some face?” The parrot’s heart was actually thumping in complete fear, and now that Lord White was fleeing, it secretly breathed a sigh of relief.\\n\\n Letting out another angry squawk, it put the seafood dishes away and then puffed out its chest and looked back at Meng Hao.\\n\\n Meng Hao’s aura was already recovering, but he was still incredibly weak. Looking at the parrot, he chuckled, then glanced back at the rift, eyes flickering murderously.\\n\\n It had been a difficult battle, even more difficult than Meng Hao could have anticipated. Although it seemed like he and the Lord of the Seventh Mountain and Sea were evenly matched, Meng Hao knew that he was weaker by just a bit.\\n\\n “I couldn\u0027t quite kill him....” he thought, sighing. He had gone all out with every bit of power that he could, and right now, his face sank with that realization. However, his eyes continued to flicker with cold killing intent.\\n\\n He knew that Lord White was also seriously injured, and that it would take him some time to recover. When he did, he would return to the Eighth Mountain and Sea, whereupon their battle would continue.\\n\\n Unfortunately, Meng Hao was not convinced that he would be able to come out on top next time.\\n\\n A sense of crisis began to well up inside him, and he suddenly looked off into the distance, eyes glittering.\\n\\n “When I used the Demon Sealing Hexing magic, Lord White blurted something about the Dao of Lord Li....\\n\\n “I need to get my hands on the legacy of Lord Li as soon as possible. Only then will I be able to get a bit stronger before Lord White returns. Only then... will I be able to cut him down!”\\n\\n A while back when he had been igniting his Soul Lamps, his divine sense had spread out explosively, filling the Eighth Mountain and Sea. At that time, he had caught sight... of Patriarch Reliance!\\n\\n He took a step, and was off in the distance. Although his mind was a bit foggy, he forced himself to hang on, and let none of that state show on the outside. Inwardly, his defeated Eternal stratum was slowly awakening again.\\n\\n “A month,” he murmured. “I need a month before I’ll recover fully.” He frowned as he realized that although he needed a month, Lord White would surely recover more quickly than that.\\n\\n **\\n\\n The Eighth Mountain and Sea had already begun to rejoice. Although people weren’t able to actually see the battlefield, they could sense that the pressure from the Seventh Mountain and Sea had vanished from the starry sky.\\n\\n As that happened, the Seventh Mountain and Sea’s cultivators’ faces went ashen, and their expressions were that of horror. Although they didn’t want to believe it, there was only one explanation for the reason why the aura of their Mountain and Sea Lord had vanished.\\n\\n Their Mountain and Sea Lord... had been defeated in battle!\\n\\n It didn’t take long for that realization to sweep across the cultivators of the Seventh Mountain and Sea. Their morale instantly dropped, and their fighting spirit plummeted.\\n\\n Contrariwise, the Eighth Mountain and Sea cultivators were bursting with power and excitement. Roaring, they went on the offensive, and instantly, fierce fighting broke out. This time, the ones to be beaten back over and over were not the cultivators of the Eighth Mountain and Sea, but rather, the Seventh!\\n\\n Booms echoed out as the fighting once again resumed!\\n\\n On the Eighth Mountain, Meng Hao’s grandfather, the Lord of the Eighth Mountain and Sea, was no longer trembling, but was calm. Apparently, his eyes were on the very verge of opening....\\n\\n Meng Hao sped away. The red-haired old man and the other nearby hundreds of thousands of cultivators had long since backed up to an even further vantage point. The shocking battle they had witnessed left them trembling, and they simply watched as Meng Hao left.\\n\\n They could sense that he was weak, but none of them dared to try to test him out....\\n\\n Not even the red-haired old man had the courage to do so. He wouldn’t attack Meng Hao unless his injuries were even worse than they were, or perhaps he was unconscious.\\n\\n As Meng Hao left, he breathed a sigh of relief.\\n\\n After reaching a point some distance away, where no one could see him, he stopped, blood oozing out of the corners of his mouth. He quickly consumed some medicinal pills, then closed his eyes and rotated his cultivation base.\\n\\n In the same moment that Meng Hao closed his eyes, an intense sensation of deadly crisis suddenly welled up in him. He turned his head to see a young man stepping out of thin air.\\n\\n As soon as he recognized who the young man was, Meng Hao’s eyes gleamed with an intense light.\\n\\n The young man looked excited, but kept his distance. When he realized he had been spotted, he clasped hands and bowed.\\n\\n “Brother Meng, at long last we meet again. Thank you for giving me this chance. I\u0027ve been waiting a very, very long time for this. I never imagined that in such a short period of time, you would... become so strong!!”\\n\\n This newcomer was none other than... Ji Dongyang!\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens/issth-book-8-chapter-1302","bookId":1507,"book":{"id":1507,"title":"I Shall Seal the Heavens","description":"I Shall Seal the Heavens is the story of the young scholar Meng Hao, who gets forcibly recruited into a sect of immortal cultivators. In the cultivation world, the strong prey on the weak, and the law of the jungle prevails. Meng Hao must adapt to survive. Filled with both comedy and drama, I Shall Seal the Heavens remains one of the most beloved xianxia stories ever translated. What does it mean to “Seal the Heavens?” This is a secret that you will have to uncover along with Meng Hao!\\n","cover":"http://cunovel.com/img/ISSTH.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/i-shall-seal-the-heavens","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:17 AM"}}
