{"id":101300,"no":3,"title":"Page 3","content":"I knew Amelia had returned and was standing by the wing-back chair where her father sat, and I knew she was frozen in place. I knew I didn\u0027t breathe for a second.\n \"I never met him,\" I said. I felt as if I\u0027d been walking in a jungle and fallen into a concealed pit. I was sure glad I was the only telepath in the house. I hadn\u0027t told anyone, anyone at all, about what I\u0027d found in Hadley\u0027s lockbox when I\u0027d cleaned it out that day at a bank in New Orleans. \"They\u0027d been divorced for a while before Hadley died.\"\n \"You should take the time to meet him someday. He\u0027s an interesting man,\" Cope said, as if he wasn\u0027t aware he was dropping a bombshell on me. Of course he was waiting for my reaction. He\u0027d hoped I hadn\u0027t known about the marriage at all, that I\u0027d be taken completely by surprise. \"He\u0027s a skilled carpenter. I\u0027d love to track him down and hire him again.\"\n The chair he was sitting on had been upholstered in a cream-colored material with lots of tiny blue flowers on green arching stems embroidered on it. It was still pretty, if faded. I concentrated on the pattern of the chair so I wouldn\u0027t show Copley Carmichael how very angry I was.\n \"He doesn\u0027t mean anything to me, no matter how interesting he is,\" I said in a voice so level you could\u0027ve played pool on it. \"Their marriage was over and done. As I\u0027m sure you know, Hadley had another partner at the time she died.\" Was murdered. But the government hadn\u0027t gotten around to taking much notice of vampire deaths unless those deaths were caused by humans. Vampires did most of their own self-policing.\n \"I\u0027d think you\u0027d want to see the baby, though,\" Copley said.\n Thank God I picked this out of Copley\u0027s head a second or two before he actually spoke the words. Even knowing what he was going to say, I felt his oh-so-casual remark hit me like a blow to the stomach. But I didn\u0027t want to give him the satisfaction of letting him see that. \"My cousin Hadley was wild. She used drugs and people. She wasn\u0027t the most stable person in the world. She was really pretty, and she had a way about her, so she always had admirers.\" There, I\u0027d said everything pro and con about my cousin Hadley. And I hadn\u0027t said the word \"baby.\" What baby?\n \"How\u0027d your family feel when she became a vampire?\" Cope said.\n Hadley\u0027s change was a matter of public record. \"Turned\" vampires were supposed to register when they entered their altered state of being. They had to name their maker. It was a kind of governmental vampire birth control. You can bet the Bureau of Vampire Affairs would come down like a ton of bricks on a vampire who made too many other little vampires. Hadley had been turned by Sophie-Anne Leclerq herself.\n Amelia had put her father\u0027s wineglass down within his reach and resumed her seat on the sofa beside me. \"Dad, Hadley lived upstairs from me for two years,\" she said. \"Of course we knew she was a vampire. For goodness sake, I thought you\u0027d want to tell me all the hometown news.\"\n God bless Amelia. I was having a hard time holding myself together, and only years of doing that very thing when I telepathically overheard something awful was keeping me glued.\n \"I need to check on the food. Excuse me,\" I murmured, and rose and left the room. I hoped I didn\u0027t scurry. I tried to walk normally. But once in the kitchen, I kept on going out the back door and across the back porch, out the screen door and into the yard.\n If I thought I\u0027d hear Hadley\u0027s ghostly voice telling me what to do, I was disappointed. Vampires don\u0027t leave ghosts, at least as far as I know. Some vampires believe they don\u0027t possess souls. I don\u0027t know. That\u0027s up to God. And here I was babbling to myself, because I didn\u0027t want to think about Hadley\u0027s baby, about the fact that I hadn\u0027t known about the child.\n Maybe it was just Copley\u0027s way. Maybe he always wanted to demonstrate the extent of his knowledge, as a way of showing his power to the people he dealt with.\n I had to go back in there for Amelia\u0027s sake. I braced myself, put my smile back on - though I knew it was a creepy, nervous smile - and back I went. I perched by Amelia and beamed at both of them. They looked at me expectantly, and I realized a conversational lull had fallen.\n \"Oh,\" said Cope suddenly. \"Amelia, I forgot to tell you. Someone called the house for you last week, someone I didn\u0027t know.\"\n \"Her name?\"\n \"Oh, let me think. Mrs. Beech wrote it down. Ophelia? Octavia? Octavia Fant. That was it. Unusual.\"\n I thought Amelia was going to faint. She turned a funny color and she braced her hand against the arm of the couch. \"You\u0027re sure?\" she asked.\n \"Yes, I\u0027m sure. I gave her your cell phone number, and I told her you were living in Bon Temps.\"\n \"Thanks, Dad,\" Amelia croaked. \"Ah, I\u0027ll bet supper\u0027s done; let me go check.\"\n \"Didn\u0027t Sookie just look at the food?\" He wore the broad tolerant smile a man wears when he thinks women are being silly.\n \"Oh, sure, but it\u0027s in the end stage,\" I said while Amelia shot out of the room as swiftly as I\u0027d just done. \"It would be awful if it burned. Amelia worked so hard.\"\n \"Do you know this Ms. Fant?\" Cope asked.\n \"No, I can\u0027t say as I do.\"\n \"Amelia looked almost scared. No one\u0027s trying to hurt my girl, right?\"\n He was a different man when he said that, and one I could almost like. No matter what else he was, Cope didn\u0027t want anyone hurting his daughter. Anyone except him, that is.\n \"I don\u0027t think so.\" I knew who Octavia Fant was because Amelia\u0027s brain had just told me, but she herself hadn\u0027t spoken it out loud, so it wasn\u0027t a thing I could share. Sometimes the things I hear out loud and the things I hear in my head become really tangled and confused - one of the reasons why I have a reputation for being borderline crazy. \"You\u0027re a contractor, Mr. Carmichael?\"\n \"Cope, please. Yes, among other things.\"\n \"I guess your business must be booming right now,\" I said.\n \"If my company was twice as big, we couldn\u0027t keep up with the jobs there are to do,\" he said. \"But I hated to see New Orleans all torn up.\"\n Oddly enough, I believed him.\n Supper went smoothly enough. If Amelia\u0027s father was disconcerted at eating in the kitchen, he didn\u0027t give a sign of it. Since he was a builder, he noticed that the kitchen portion of the house was new and I had to tell him about the fire, but that could have happened to anyone, right? I left out the part about the arsonist.\n Cope seemed to enjoy his food and complimented Amelia, who was mighty pleased. He had another glass of wine with his meal, but no more than that, and he ate moderately, too. He and Amelia talked about friends of the family and some relatives, and I was left alone to think. Believe me, I had a lot of thinking to do.\n Hadley\u0027s marriage license and divorce decree had been in her lockbox at her bank when I\u0027d opened it after her death. The box had contained some family things - a few pictures, her mother\u0027s obituary, several pieces of jewelry. There\u0027d also been a lock of fine hair, dark and wispy, with a bit of Scotch tape to keep it together. It had been placed in a little envelope. I\u0027d wondered when I\u0027d noticed how fine the hair was. But there hadn\u0027t been a birth certificate or any other scrap of evidence that Hadley had had a baby.\n Up until now, I\u0027d had no clearly defined reason to contact Hadley\u0027s former husband. I hadn\u0027t even known he existed until I\u0027d opened her lockbox. He wasn\u0027t mentioned in her will. I\u0027d never met him. He hadn\u0027t shown up while I was in New Orleans.\n Why hadn\u0027t she mentioned the child in her will? Surely any parent would do that. And though she\u0027d named Mr. Cataliades and me as the joint executors, she hadn\u0027t told either of us - well, she hadn\u0027t told me - that she had relinquished her rights to her child, either.\n \"Sookie, would you pass the butter?\" Amelia asked, and I could tell from her tone it wasn\u0027t the first time she\u0027d spoken to me.\n \"Of course,\" I said. \"Can I get either of you any more water or another glass of wine?\"\n They both declined.\n After supper, I volunteered to do the dishes. Amelia accepted my offer after a brief pause. She and her father had to have some time alone, even if Amelia didn\u0027t relish the prospect.\n I washed and dried and put away the dishes in relative peace. I wiped down the counters and whipped the tablecloth off the table and popped it into the washer on the enclosed back porch. I went into my room and read for a while, though I didn\u0027t take in much of what was happening on the page. Finally, I laid the book aside and got a box out of my underwear drawer. This box contained everything I\u0027d retrieved from Hadley\u0027s lockbox. I checked the name on the marriage certificate. On impulse, I called information.\n \"I need a listing for a Remy Savoy,\" I said.\n \"What city?\"\n \"New Orleans.\"\n \"That number\u0027s been disconnected.\"\n \"Try Metairie.\"\n \"No, ma\u0027am.\"\n \"Okay, thanks.\"\n Of course, a lot of people had moved since Katrina, and a lot of those moves were permanent. People who had fled the hurricane had no reason to come back, in many cases. There was nowhere to live and no job to go to, in all too many cases.\n I wondered how to search for Hadley\u0027s ex-husband.\n A very unwelcome solution crept into my head. Bill Compton was a computer whiz. Maybe he could track down this Remy Savoy, find out where he was now, discover if the child was with him.\n I rolled the idea around in my head like a mouthful of doubtful wine. Given our exchange of the night before at the wedding, I could not imagine myself approaching Bill to ask for a favor, though he\u0027d be the right man for the job.\n A wave of longing for Quinn almost took me to my knees. Quinn was a smart and well-traveled man, and he would surely have a good piece of advice for me. If I ever saw him again.\n I shook myself. I could just hear a car pulling into the parking area by the sidewalk at the front of the house. Tyrese Marley was returning for Cope. I straightened my back and left my room, my smile fixed firmly on my face.\n The front door was open, and Tyrese was standing in it, pretty much filling it up from side to side. He was a big man. Cope was leaning over to give his daughter a peck on the cheek, which she accepted without a hint of a smile. Bob the cat came through the door and sat down beside her. The cat was looking up at Amelia\u0027s father with his wide-eyed stare.\n \"You have a cat, Amelia? I thought you hated cats.\"\n Bob switched his gaze to Amelia. Nothing can stare like a cat.\n \"Dad! That was years ago! This is Bob. He\u0027s great.\" Amelia picked up the black-and-white cat and held him to her chest. Bob looked smug and began purring.\n \"Hmmm. Well, I\u0027ll be calling you. Please take care. I hate to think about you being up here at the other end of the state.\"\n \"It\u0027s just a few hours\u0027 ride away,\" Amelia said, sounding all of seventeen.\n \"True,\" he said, trying for rueful but charming. He missed by a foot or two. \"Sookie, thanks for the evening,\" he called over his daughter\u0027s shoulder.\n Marley had gone to Merlotte\u0027s to see if he could scope out any information on me, I heard clearly from his brain. He\u0027d picked up quite a few odds and ends. He\u0027d talked to Arlene, which was bad, and to our current cook and our busboy, which was good. Plus assorted bar patrons. He\u0027d have a mixed report to convey.\n The moment the car pulled away, Amelia collapsed onto the sofa with relief. \"Thank God he\u0027s gone,\" she said. \"Now do you see what I mean?\"\n \"Yeah,\" I said. I sat beside her. \"He\u0027s a mover and a shaker, isn\u0027t he?\"\n \"Always has been,\" she said. \"He\u0027s trying to maintain a relationship, but our ideas don\u0027t match.\"\n \"Your dad loves you.\"\n \"He does. But he loves power and control, too.\"\n That was putting it conservatively.\n \"And he doesn\u0027t know you have your own form of power.\"\n \"No, he doesn\u0027t believe in it at all,\" Amelia said. \"He\u0027ll tell you he\u0027s a devout Catholic, but that\u0027s not the truth.\"\n \"In a way, that\u0027s good,\" I said. \"If he believed in your witch power, he\u0027d try to make you do all kinds of things for him. You wouldn\u0027t want to do some of them, I bet.\" I could have bitten my tongue, but Amelia didn\u0027t take offense.\n \"You\u0027re right,\" she said. \"I wouldn\u0027t want to help him advance his agenda. He\u0027s capable of doing that without my assistance. If he\u0027d just leave me alone, I\u0027d be content. He\u0027s always trying to improve my life, on his terms. I\u0027m really doing okay.\"\n \"Who was that who had called you in New Orleans?\" Though I knew, I had to pretend. \"Fant, her name was?\"\n Amelia shuddered. \"Octavia Fant is my mentor,\" she said. \"She\u0027s the reason I left New Orleans. I figured my coven would do something awful to me when they found out about Bob. She\u0027s the head of my coven. Or what\u0027s left of it. If anything\u0027s left of it.\"\n \"Ooops.\"\n \"Yeah, no shit. I\u0027m going to have to pay the price now.\"\n \"You think she\u0027ll come up here?\"\n \"I\u0027m only surprised she\u0027s not here already.\"\n Despite her expressed fear, Amelia had been worried sick about the welfare of her mentor after Katrina. She had made a huge effort to track the woman, though she didn\u0027t want Octavia to find her.\n Amelia feared being discovered, especially with Bob still in his cat form. She\u0027d told me that her dabbling in transformational magic would be considered all the more reprehensible because she was still an intern, or something along those lines... a step above novice, anyway. Amelia didn\u0027t discuss the witch infrastructure.\n \"You didn\u0027t think of telling your father not to reveal your location?\"\n \"Asking him to do that would have made him so curious he\u0027d have torn up my entire life to find out why I\u0027d asked. I never thought Octavia would call him, since she knows how I feel about him.\"\n Which was, to say the least, conflicted.\n \"I have something to tell you that I forgot,\" Amelia said abruptly. \"Speaking of phone calls, Eric called you.\"\n \"When?\"\n \"Ah, last night. Before you got home. You were so full of news when you got here, I just forgot to tell you. Plus, you\u0027d said you were going to call him anyway. And I was really upset about my dad coming. I\u0027m sorry, Sookie. I promise I\u0027ll write a note next time.\"\n This was not the first time Amelia had neglected to tell me about a caller. I wasn\u0027t pleased, but it was water under the bridge, and our day had been stressful enough. I hoped Eric had found out about the money the queen owed me for my services in Rhodes. I hadn\u0027t gotten a check yet, and I hated to bug her since she\u0027d been hurt so badly. I went to the phone in my room to call Fangtasia, which should be in full blast. The club was open every night except Monday.\n \"Fangtasia, the bar with a bite,\" Clancy said.\n Oh, great. My least favorite vampire. I phrased my request carefully. \"Clancy, it\u0027s Sookie. Eric asked me to return his call.\"\n There was a moment of silence. I was willing to bet that Clancy was trying to figure out if he could block my access to Eric. He decided he couldn\u0027t. \"One moment,\" he said. A brief pause while I listened to \"Strangers in the Night.\" Then Eric picked up the phone.\n \"Hello?\" he said.\n \"I\u0027m sorry I didn\u0027t call you back before now. I just got your message. Did you call about my money?\"\n A moment of silence. \"No, about something else entirely. Will you go out with me tomorrow night?\"\n I stared at the telephone. I couldn\u0027t manage a coherent thought. Finally I said, \"Eric, I\u0027m dating Quinn.\"\n \"And how long has it been since you\u0027ve seen him?\"\n \"Since Rhodes.\"\n \"How long has it been since you heard from him?\"\n \"Since Rhodes.\" My voice was wooden. I was unwilling to talk to Eric about this, but we had shared blood often enough to have a much stronger tie than I liked. In fact, I loathed our bond, one we\u0027d been compelled to forge. But when I heard his voice, I felt content. When I was with him, I felt beautiful and happy. And there was nothing I could do about it.\n \"I think you can give me one evening,\" Eric said. \"It doesn\u0027t sound as though Quinn has you booked.\"\n \"That was mean.\"\n \"It\u0027s Quinn who\u0027s cruel, promising you he\u0027d be here and then not keeping his word.\" There was a dark element in Eric\u0027s voice, an undertone of anger.\n \"Do you know what\u0027s happened to him?\" I asked. \"Do you know where he is?\"\n There was a significant silence. \"No,\" Eric said very gently. \"I don\u0027t know. But there is someone in town who wants to meet you. I promised I would arrange it. I\u0027d like to take you to Shreveport myself.\"\n So this wasn\u0027t a date date.\n \"You mean that guy Jonathan? He came to the wedding and introduced himself. I\u0027ve got to say, I didn\u0027t much care for the guy. No offense, if he\u0027s a friend of yours.\"\n \"Jonathan? What Jonathan?\"\n \"I\u0027m talking about the Asian guy; he\u0027s maybe Thai? He was at the Bellefleur wedding last night. He said he wanted to see me because he was staying in Shreveport and he\u0027d heard a lot about me. He said he\u0027d checked in with you, like a good little visiting vampire.\"\n \"I don\u0027t know him,\" Eric said. His voice was much sharper. \"I\u0027ll ask here at Fangtasia to see if anyone has seen him. And I\u0027ll prompt the queen about your money, though she is... not herself. Now, will you please do what I\u0027m asking you to do?\"\n I made a face at the telephone. \"I guess,\" I said. \"Who\u0027m I meeting? And where?\"\n \"I\u0027ll have to let the \u0027who\u0027 remain a mystery,\" Eric said. \"As to where, we\u0027ll go to dinner at a nice restaurant. The kind you\u0027d call casual dressy.\"\n \"You don\u0027t eat. What will you do?\"\n \"I\u0027ll introduce you and stay as long as you need me to.\"\n A crowded restaurant should be all right. \"Okay,\" I said, not very graciously. \"I\u0027ll get off work about six or six thirty.\"\n \"I\u0027ll be there to pick you up at seven.\"\n \"Give me till seven thirty. I need to change.\" I knew I sounded grumpy, and that was exactly how I felt. I hated the big mystery around this meeting.\n \"You\u0027ll feel better when you see me,\" he said. Dammit, he was absolutely right. \n","sourceLink":"https://allnovel.net/from-dead-to-worse-sookie-stackhouse-8/page-3.html","bookId":2198,"book":{"id":2198,"title":"From Dead to Worse (Sookie Stackhouse #8)","description":"Storyline: \n From Dead to Worse (Sookie Stackhouse #8) \n After the natural disaster of Hurricane Katrina and the manmade explosion at the vampire summit, everyone human and otherwise is stressed, including Louisiana cocktail waitress Sookie Stackhouse, who is trying to cope with the fact that her boyfriend Quinn has gone missing. \n It\u0027s clear that things are changing whether the weres and vamps of her corner of Louisiana like it or not. And Sookie, Friend to the Pack and blood-bonded to Eric Northman, leader of the local vampire community is caught up in the changes. \n In the ensuing battles, Sookie faces danger, death, and once more, betrayal by someone she loves. And when the fur has finished flying and the cold blood finished flowing, her world will be forever altered.\n \n","cover":"https://allnovel.net/images/from-dead-to-worse-sookie-stackhouse-8.jpg","author":"Charlaine Harris","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/from-dead-to-worse-sookie-stackhouse-8.html","creation":"Oct 5, 2019 8:58:27 AM","modification":"Oct 5, 2019 10:01:21 PM"}}
