{"id":45058,"no":23,"title":"CHAPTER XXII. A NIGHT OF SONG","content":"HOME-SICKNESS AND ITS OUTPOURING IN MUSIC. \n \n IT WAS Sunday again, and the 200th Ind. still lingered near Nashville. For some inscrutible reason known only to the commanding officers the brigade had been for nearly a week in camp on the banks of the swift running Cumberland. They had been bright, sunshiny days, the last two of them. Much rain in the hill country had swollen the swift waters of the Cumberland and they fiercely clamored their devious way to the broad Ohio. The gentle roar as the rippling wavelets dashed against the rock bound shores sounded almost surf-life, but to Si, who had never heard the salt waves play hide-and-go-seek on the pebbly beach, the Cumberland\u0027s angry flood sang only songs of home on the Wabash. He had seen the Wabash raging in flood time and had helped to yank many a head of stock from its engulfing fury. He had seen the Ohio, too, when she ran bank full with her arched center carrying the Spring floods and hundreds of acres of good soil down to the continent-dividing Mississippi, and on out to sea. His strong arms and stout muscles had piloted many a boat-load of boys and girls through the Wabash eddies and rapids during the Spring rise, and as he stood now, looking over the vast width of this dreary waste of waters, a great wave of home-sickness swept over him. \n \n After all, Si was only a kid of a boy, like thousands of his comrades.\u0027 True, he was past his majority a few months, but his environment from youth to his enlistment had so sheltered him that he was a boy at heart. \n \n \"The like precurse of fierce events and prologue to the omen coming on\" had as yet made small impression upon him. Grim visaged war had not frightened him much up to that time. He was to get his regenerating baptism of blood at Murfreesboro a few weeks later. Just now Si Klegg was simply a boy grown big, a little over fat, fond of mother\u0027s cooking, mother\u0027s nice clean feather beds, mother\u0027s mothering, if the truth must be told. He had never in his life before been three nights from under the roof of the comfortable old house in which he was born. He had now been wearing the blue uniform of the union a little more than three months, and had not felt mother\u0027s work-hardened hands smoothing his rebellious hair or seen her face or heard a prayer like she could make in all that three months. \n \n \"Shucks!\" he said fretfully to himself as he looked back at the droning, half asleep brigade camp, and then off to the north, across the boiling yellow flood of waters that tumbled past the rocks far below him. \n \n \"A feller sure does git tired of doin\u0027 nothin\u0027.\" \n \n Lusty, young, and bred to an active life, Si, while he did not really crave hustle and bustle, was yet wedded to \"keeping things moving.\" He had already forgotten the fierce suffering of his early marching—it seemed three years to him instead of three months back; he had forgotten the graybacks, the wet nights, the foraging expeditions, the extra guard duty and all that. There had been two days of soft Autumn sunshine in a camp that was almost ideal. Everything was cleaned up, mended up, and the men had washed and barbered themselves into almost dude-like neatness. Their heaviest duties had been lazy camp guard duty, which Shorty, growing indolent, had declared to be \"dumned foolishness,\" and the only excitement offered came from returning foraging parties. There was no lurking enemy to fear, for the country had been cleared of guerrillas, and in very truth the ease and quietness of the days of inactivity was almost demoralizing the men. \n \n There had been no Sunday services. The 200th Ind. was sprawled out on the ground in its several hundred attitudes of ease, and those with whom they were brigaded were just as carelessly disposed. \n \n As Si sauntered aimlessly back to look for Shorty, the early twilight began to close in as the sun slid down behind the distant hills. Campfires began to glow as belated foragers prepared their suppers, and the gentle hum of voices came pleasantly to the ear, punctuated by laughter, often boisterous, but quite as often just the babbling, cheery laugh of carefree boys. \n \n Si felt—well, Si was just plain homesick for mother and the girls, and one particular girl, whose front name was Annabel, and he almost felt as though he didn\u0027t care who knew it. \n \n The air was redolent with the odor of frying meat. Mingled with this were vagrant whiffs of cooking potatoes, onions, chickens, and the fragrance of coffee steaming to blackest strength, all telling tales of skillful and successful foraging, and it all reminded Si of home and the odors in his mother\u0027s kitchen. \n \n Si couldn\u0027t find Shorty, so he hunched down, silent and alone, beside his tent, a prey to the blue devils. It would soon be Christmas at home. He could see the great apple bins in the cellar; the pumpkins in the hay in the barn; the turkeys roosting above the woodshed; the yards of encased sausages in the attic; he could even smell the mince meat seasoning in the great stone jar; the honey in the bee cellar; the huge fruit cake in the milk pan in the pantry; since he could remember he seen and smelled all these, with 57 varieties of preserves, \"jells,\" marmalades, and fruit-butters thrown in for good measure at Christmas time. He had even contemplated with equanimity all these 21 Christmases, the dose of \"blue pills\" that inevitably followed over-feeding at Mother Klegg\u0027s, and now on his 22d Christmas he might be providing a target for a rebel bullet. \n \n Suddenly Si noticed that the dark had come; the fragrance of tobacco from hundreds of pipes was filling the air, and from away off in the distance the almost Indian Summer zephyrs were bringing soft rythmic sounds like—surely—yes, he caught it now, it was that mighty soother of tired hearts— \n \n \"Jesus, lover of my soul, \n Let me to Thy bosom fly. \n While the billows near me roll. \n While the tempest still is high.\" \n \n Si shut his eyes lest the tear drops welling suddenly up fall on his uniform, not stopping to think that in the gloom they could not be seen. \n \n Miles away the singers seemed to be when Si caught the first sounds, but as the long, swinging notes reached out in the darkness, squad after squad, company after company, regiment after regiment took up the grand old hymn until Si himself lifted up his not untuneful voice and with the thousands of others was pleading— \n \n \"Hide me, oh, my Savior hide, \n \u0027Till the storm of life is past; \n Safe into the haven guide. \n Oh, receive my soul at last.\" \n \n and the song rose and swelled out and up toward heaven, and stole away off to the horizon till the whole vast universe seemed filled with the sacred melody. As the last words and their music faded out in space. Shorty lunged down beside Si. \n \n \"Say, Pard,\" he began banteringly, \"you\u0027ve missed yer callin\u0027. Op\u0027ry oughter have been yer trade.\" \n \n \"Oh, chop off yer chin music for a minute. Shorty,\" broke in Si. \"In the dark here it seemed most as though I was at home in the little old church with Maria and Annabel and Pap and Mother, and us all singing together, and you\u0027ve busted it—ah! listen!\" \n \n From not far away a bugler had tuned up and through the fragrant night came piercingly sweet— \n \n \"I will sing you a song of that beautiful land—\" \n \n Then near at hand a strong, clear, musical tenor voice took up the second line, \n \n \"The far away home of the soul,\" \n \n and almost instantly a deep, resonant bass voice boomed in— \n \n \"Where no storms ever beat on that glittering strand \n While the years of eternity roll,\" \n \n and soon a hundred voices were making melody of the spheres as they sang Philip Phillips\u0027s beautiful song. \n \n \"That was Wilse Hornbeck singin\u0027 tenor,\" said Si, as the song ended. \n \n \"And it was Hen Withers doin\u0027 the bass stunt,\" returned Shorty. \n \n \"You just oughter hear him do the ornamental on a mule whacker. Why, Si, he\u0027s an artist at cussing. Hen Withers is. Sodom and Gomorrah would git jealous of him if he planted himself near \u0027em, he\u0027s that wicked.\" \n \n \"Well, he can sing all right,\" grunted Si. \n \n Just then Hen Withers, in the squad some 50 feet away broke into song again— \n \n \"Oh, say, can you see by the dawn\u0027s early light\" \n \n It welled up from his throat like the pipe from a church organ, and as mellow as the strains from a French horn. When the refrain rolled out fully 3,000 men were singing, yelling and shouting in frenzied fervor— \n \n \"And the Star Spangled banner. \n In triumph shall wave, \n O\u0027er the land of the free, \n And the home of the brave.\" \n \n While Hen Withers rested on his well-earned laurels, a strong, clear voice, whose owner was probably thinking of home and the shady gloom of the walk through the grove to singing school with his sweetheart, trilled an apostrophe to the queen of light. \n \n \"Roll on, silvery moon, \n Guide the traveler on his way,\" \n \n but he had it pretty much to himself, for not many knew the words, and he trailed off into \n \n \"I loved a little beauty, Bell Brandon,\" \n \n then his music died out in the night. \n \n It was now the \"tenore robusto\" who chimed in bells, on a new battle song that held a mile square of camp spellbound: \n \n \"Oh, wrap the flag around me, boys, \n \n To die were far more sweet \n With freedom\u0027s starry emblem, boys. \n \n To be my winding sheet. \n In life I loved to see it wave \n \n And follow where it led, \n And now my eyes grow dim, my hands \n \n Would clasp its last bright shred. \n Oh, I had thought to meet you, boys, \n \n On many a well-worn field \n When to our starry emblem, boys, \n \n The trait\u0027rous foe should yield. \n But now, alas, I am denied \n \n My dearest earthly prayer, \n You\u0027ll follow and you\u0027ll meet the foe, \n \n But I shall not be there.\" \n \n Wilse Hornback knew by the hush of the camp as the sound of his wonderful voice died on the far horizon that he had his laurels, too, and so he sang on while the mile square of camp went music-mad again as it sang with him— \n \n \"We are springing to the call of our brothers gone before, \n Shouting the battle cry of freedom. \n And we\u0027ll fill the vacant ranks with a million freemen more. \n Shouting the battle cry of freedom.\" \n \n Chorus: \n \n \"The union forever! Hurrah, boys. Hurrah; \n Down with the traitor and up with the Star, \n While we rally \u0027round the Flag, boys, \n We\u0027ll rally once again, \n Shouting the battle cry of freedom. \n \n We will welcome to our numbers the loyal, true and brave. \n Shouting the battle cry of freedom, \n And although they may be poor, not a man shall \n be a slave. \n Shouting the battle cry of freedom. \n \n So we\u0027re springing to the call from the East and from the West, \n Shouting the battle cry of freedom, \n And we\u0027ll hurl the rebel crew from the land we love the best, \n Shouting the battle cry of freedom.\" \n \n In the almighty hush that followed the billows of sound, some sweet-voiced fellow started Annie Laurie, and then sang— \n \n \"In the prison cell I sit\" \n \n with grand chorus accompaniment. Then Wilse Hornback started and Hen Withers joined in singing the Battle Hymn— \n \n \"Mine eyes have seen the glory of the coming of the Lord,\" \n \n and oh, God of Battles! how that army of voices took up the refrain— \n \n \"Glory, glory, hallelujah,\" \n \n and tossed and flung it back and forth from hill to hill and shore to shore till it seemed as though Lee and his cohorts must have heard and quailed before the fearful prophecy and arraignment. \n \n Then the \"tenore robusto\" and the \"basso profundo\" opened a regular concert program, more or less sprinkled with magnificent chorus: singing, as it was easy or difficult for the men to recall the words. You must rummage in the closets of memory for most of them! The Old Oaken Bucket; Nellie Gray; Anna Lisle; No, Ne\u0027er Can Thy Home be Mine; Tramp, Tramp, Tramp; We are Coming, Father Abraham; Just as I Am; By Cold Siloam\u0027s Shady Rill—how those home-loving Sunday school young boys did sing that! It seemed incongruous, but every now and then they dropped into these old hymn tunes, which many a mother had sung her baby to sleep with in those elder and better days. \n \n The war songs are all frazzled and torn fragments of memory now, covered with dust and oblivion, but they were great songs in and for their day. No other country ever had so many. \n \n Laughter and badinage had long since ceased. Flat on their backs, gazing up at the stars through the pine and hemlock boughs, the boys lay quietly smoking while the \"tenore robusto\" assisted by the \"basso profundo\" and hundreds of others sang \"Willie, We Have Missed You,\" \"Just Before the Battle, Mother,\" \"Brave Boys Are They,\" and the \"Vacant Chair.\" \n \n In a little break in the singing. Hen Withers sang a wonderful song, now almost forgotten. It was new to the boys then, but the bugler had heard it, and as Hen\u0027s magnificent voice rolled forth its fervid words the bugle caught up the high note theme, and never did the stars sing together more entrancingly than did the \"wicked mule whacker\" and that bugle— \n \n \"Lift up your eyes, desponding freemen. \n Fling to the winds your needless fears. \n He who unfurled our beauteous banner \n Says it shall wave a thousand years.\" \n \n On the glorious chorus a thousand voices took up the refrain in droning fashion that made one think of \"The Sound of the Great Amen.\" \n \n \"A thousand years, my own Columbia! \n Tis the glad day so long foretold! \n \u0027Tis the glad mom whose early twilight \n Washington saw in times of old.\" \n \n By the time Hen had sung all of the seven verses the whole brigade knew the refrain and roared it forth as a defiance to the Southern Confederacy, which took on physical vigor in the days that came after, when the 200th Ind. went into battle to come off victorious on many a fiercely contested field. \n \n Then the tenor sang that doleful, woe begone, hope effacing, heart-string-cracking \"Lorena.\" Some writer has said that it sung the heart right out of the Southern Confederacy. \n \n \"The sun\u0027s low down the sky, Lorena, \n The snow is on the grass again.\" \n \n As Wilse Hornbeck let his splendid voice out on the mournful cadences, Si felt his very heart strings snap, and even Shorty drew his breath hard, while some of the men simply rolled over, and burying their faces in their arms, sobbed audibly. \n \n Wilse had not counted on losing his own nerve, but found his voice breaking on the melancholy last lines, and bounding to his feet with a petulant, \n \n \"Oh, hang it!\" \n \n \"Say, darkies, hab you seen de Massa\" \n \n came dancing up from the jubilating chords of that wonderful human music box, and soon the camp was reeling giddily with the jolly, rollicking, \n \n \"Or Massa ran, ha! ha!! \n The darkies stay, ho! ho!!\" \n \n Then, far in the distance a bugle sounded \"lights out,\" and the songfest was at an end; as bugler after bugler took it up, one by one the campfires bAlinked out, and squad after squad sank into quiet. \n \n \"I feel a heap better somehow,\" remarked Si, as he crawled under his blanket. \n \n \"Dogged if I hain\u0027t had a sort of uplift, too,\" muttered Shorty, as he wrapped his blanket round his head. In the distance a tenor voice was singing as he kicked out his fire and got ready for bed— \n \n \"Glory, glory, hallelujah.\" \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2247/63210.html","bookId":439,"book":{"id":439,"title":"Si Klegg, Complete, Books 1-6","description":"简介： AFTER Si Klegg had finally yielded to his cumulative patriotic impulses and enlisted in the 200th Ind. for three years or until the rebellion was put down, with greater earnestness and solemnity to equip himself for his new career....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2247","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
