{"id":45107,"no":72,"title":"CHAPTER VI. DISTRESSING ENEMIES","content":"OTHER THAN THE REBELS AND RAIN, MUD, AND SWOLLEN STREAMS. \n \n SI WOKE up early the next morning with a savage exclamation. \n \n \"I declare, I\u0027m all on fire,\" he said. \"Some thing\u0027s just eating me up. I believe I\u0027ve got a million graybacks on me.\" \n \n I\u0027m All on Fire 77 \n \n \"Same here, Si,\" said Shorty. \"Never knowed \u0027em to be so bad. Seem to \u0027ve just got in from a march, and are chawin\u0027 three days\u0027 rations out o\u0027 me every minute. I\u0027d \u0027a\u0027 thought they\u0027d all \u0027ve bin drowned from the duckin\u0027 they\u0027ve bin havin\u0027 for the past five days, but it only seems to \u0027ve sharpened their teeth and whetted their appetites. They\u0027ve all come to dinner, and invited their friends.\" \n \n \"Where in the world could they have all come from?\" meditated Si. \"We wuz certainly clean of \u0027em when we started out six days ago.\" \n \n \"O, the rebels skipped out in sich a hurry,\" ex plained Shorty, \"that they even dropped their house hold pets, which we inherited as we follered \u0027em up. I wish this infernal rain\u0027d let up long enough for us to do some skirmishin\u0027 and bile our clothes. Or if the sun\u0027d only come out an hour or two, we could find an ant-hill, an\u0027 lay our clothes on it. I don\u0027t know any little thing that I enjoy more on a pleasant day when we\u0027ve bin a long march and got mighty \u0027crumby, than to pull off my shirt and lay it on a lively ant-hill, and light my pipe and set there and watch the busy ants collar its inhabitants and carry \u0027em off to fill up their smoke-houses with Winter meat.\" \n \n He put his hand meditatively into his bosom as he spoke. As he withdrew it he looked down and exclaimed: \n \n \"Jehosephat, it\u0027s fleas, too. Just look there. I\u0027m alive with fleas.\" \n \n \"Same here,\" ejaculated Si, who had made a similar discovery. \"Just look at \u0027em, hoppin\u0027 out every where. The rebels have not only set their grayback infantry on to us, but are jumping us with their flea cavalry.\" \n \n \"If you call the graybacks infantry and the fleas cavalry, what in the world do you call these, Si?\" said Shorty, who had made still another discovery, and was pointing to his wrists and ankles, where rows of gorged ticks, looking like drops of fresh blood, encircled his limbs. \n \n \"Them\u0027s heavy artillery,\" answered Si; \"and, Great Scott, I\u0027ve got more of \u0027em on me than you have. And there\u0027s some just back of your ears, Shorty. Be careful, Shorty. Don\u0027t touch \u0027em. Le\u0027 me work \u0027em off. Be awful careful. If you break their heads off they\u0027ll stay in and make a sore that\u0027ll almost never get well.\" \n \n They looked down the lines of men who, like themselves, had been rudely awakened from their slumber on wet beds by \"the pestilence that walketh by night.\" There were howls, yells, oaths and imprecations from everybody. Officers forgot their carefully-maintained dignity, and were as vociferous and profane as the men. \n \n Many were stripped, and trying to singe their wet clothes over the smoldering fires. Many were even trying to subdue the pests by thrashing their garments in the cold water of the creek. \n \n \"\u0027Bout as much use as a General Order from Army Headquarters would be agin the varmints,\" said Shorty, as he watched their futile labors. \"Say, you fellers,\" he called out to them; \"why don\u0027t you repeat the Ten Commandments to \u0027em? Or sing the doxology? It\u0027ll do just as much good as sloshing your duds around in the water. The water only makes \u0027em savager\u0027n ever. You ought to know that from experience.\" \n \n By the happy thought of gently touching the gorged wood-ticks with the point of a pin Si and Shorty had gotten rid of those plagues, heads and all, so as to leave no apprehension as to future sores. They communicated this method to their afflicted comrades, and then turned their attention to the other parasites. \n \n \"I guess I\u0027ll just go down to the Surgeon\u0027s tent and git a pound of angwintum,\" said Shorty, \"and rub myself from head to foot with it. That\u0027s the only thing I know of that\u0027ll do the least good.\" \n \n \"Mustn\u0027t do that,\" objected Si. \"Put angwintum on you and get wet, and you\u0027ll be salivated. You ought to know that.\" \n \n \"I don\u0027t care,\" said Shorty desperately. \"I\u0027d rather be salivated till my teeth drop out and my hair falls off than be carried off in large chunks by fleas and graybacks. Come along.\" \n \n \"Mebbe the Surgeon has something else that\u0027ll pizen these little cusses,\" said Si, falling in with his comrade. \n \n They found a clamorous group around the Surgeon\u0027s tent, asking for \"angwintum (mercurial ointment) or anything else that would alleviate their torments. The worried Surgeon was scratching himself as he explained to the Colonel: \n \n \"It seems to me, \u0027Colonel, that the rising water has concentrated all these parasites on the higher ground over which we have come. This is the only way in which I can account for their severe visitation upon us. The parasites seem to have the same instinct to gather on elevated spots when the water is rising that other animals have, and we have consequently gathered up four or five times as many, to say the least, as we should otherwise have gotten. But you don\u0027t know the worst of it yet. You see those men? They have sore feet. But it isn\u0027t ordinary sore feet. They\u0027ve got chiggers in their feet.\" \n \n \"Chiggers. What are they?\" asked the Colonel. \n \n \"Chiggers, jiggers, chigoes pulex penetrans,\" answered the Surgeon. \"They are a great pest in the tropics, where the people go barefooted and do not take any care of their feet. This is the first time that I have ever heard of them being so far north. But there is no doubt about their being chiggers. They burrow in under the skin, and cause a great deal of suffering. Some of the men\u0027s hands and fingers are also affected by them. They are terrible things to deal with when they once get the start. If this thing goes on, not a man in the regiment will be able to walk a step.\" \n \n \"What can be done?\" gasped the Colonel, gripping for a flea in his bosom. \n \n \"Nothing,\" answered the Surgeon, smashing an insect on the back of his hand, \"except to issue a stringent order that the men must take special care of their feet and hands.\" \n \n \"Humph,\" said the Colonel, scornfully, as he caught a bug on his wrist; \"much sense in an order of that kind, when the men have to wade through mud and water 18 hours out of 24, and then sleep in it the other six. Is that the best you can suggest? Is that all your conscience has to offer? Remember that you are responsible for the efficiency of the men on this great campaign, upon which the safety of the country depends. It will be a severe reflection upon you if you allow them to be broken down by a few insects.\" \n \n \"Great Pharaoh and Moses,\" responded the Surgeon irritably, as he grabbed for \"a bite\" on his throat. \"Here we are, confronted with a condition of things like the curses which God Almighty sent against the Egyptians, and you expect me to manage it with quinine and epsom salts. It can\u0027t be done, Colonel.\" \n \n \"Isn\u0027t there anything that you can suggest or recommend that will mitigate this trouble?\" said the Colonel in a more conciliatory manner, for he had just succeeded in crushing a tormentor. \"Certainly, there must be something in your pharmacopeia which will at least retard these infernal vermin from eating my men alive. Can\u0027t you at least check them a little until we can get through the campaign? Then the men can be trusted to take care of themselves.\" And the Colonel made a swoop for a particularly vicious flea which was banqueting on the lobe of his ear. \n \n \"I never set up as a sharp on parasites,\" said the Surgeon, running down a \"small deer\" inside his collar; \"but I remember to have read that an application of tobacco-juice is about as effective a preventive of insect bites as can be found.\" \n \n \"That\u0027ll do; that\u0027ll do,\" said Shorty triumphantly, as he and Si started back to their places to act at once on the Surgeon\u0027s suggestion. \"Just the thing. Tobacker\u0027ll kill \u0027em deader than small-beer. Why didn\u0027t I think about it before?\" \n \n Shorty had some strong black plug tobacco. He cut this up into small pieces, while Si found an old tin can, into which they were put, and then the can filled up with boiling water. \n \n \"Let\u0027s make her good and strong, Si,\" said Shorty, putting in some more tobacco; \"for the fellers are sock-dolagers, and it will take a horse dose to kill \u0027em. They\u0027ll just enjoy a little taste o\u0027 terbacker. Make it strong enough to bear up an aig. Now, let\u0027s git our clothes off while it\u0027s coolin\u0027 down. You drench me, and I\u0027ll drench you, and we\u0027ll salivate these gallinippers in a way that\u0027ll surprise \u0027em.\" \n \n The surprise seemed to be mostly on the other side. Shorty\u0027s skin was raw from head to foot from the depredations of the various tribes of \"epizoa,\" as the physicians generalize them. He gave a yell that could be heard through the whole regiment as the acrid, biting tobacco-juice struck a thousand little punctures in his skin inside of a second. Everybody rushed up to see what was the matter, and stood around, laughing and commenting, while scratching and slapping at their own colonies of tormentors. Then Shorty began the most vehement stream of profanity, and showered maledictions on everything in the State of Tennessee, which was only a breeding place for fleas, woodticks, jiggers, graybacks, niggers, rebels, traitors, bushwhackers, guerrillas, thieves, robbers and murderers, and other spawn of Jeff Davisism. Presently he grew violently sick at the stomach, turned deathly white, and fainted. Frightened, Si rushed for the Surgeon. \n \n \"Only tobacco poisoning,\" said the latter, after he had looked Shorty over carefully. \"You made that solution too strong, and the lot of little punctures took it directly into his circulation. You might have killed him if you had made it stronger, or got more of it on him. I never saw such rapscallions as you boys are. You are always trying to kill yourselves or one another, in spite of all that I can do or tell you. A man that\u0027s Surgeon of this regiment has to earn his money, I tell you. He will come out all right pretty soon, only he will be very weak. I\u0027ll send you down some whisky to give him.\" \n \n \"Real old rye, Doctor?\" said Shorty, very faintly, and opening his eyes feebly. \"None of your Commissary stuff. This is a powerful bad case, and I need the best.\" \n \n \"You shall have it,\" laughed the Surgeon. \"I know you. You are all right when you are all right. But you won\u0027t be able to march with the column to-day. I\u0027ll give you an excuse from duty. And you (to Si) had better stay with him. I\u0027ll speak to your Captain.\" \n \n The bugles were sounding the \"assembly\" every where, and the men, slapping and scratching as if they would tear their flesh and their clothes off, were hastily swallowing their last mouthfuls of hot coffee and bread and pork, snatching up their guns and blankets and falling in. \n \n \"Shelbyville is only six miles away,\" said the Orderly-Sergeant as he lined up Co. Q, and clawed around his clothes at his persecutors. \"There\u0027ll be a circus to-day, and no postponement on account o\u0027 the weather. It\u0027ll either be the gol-darnedest fight that the 200th Injianny Volunteers ever got into or the cussedest foot-race that ever wuz run. Here, Biles, consarn you, leave that fire and your munching, and fall in. You\u0027re like a cow\u0027s tail always behind.\" \n \n Shorty made a violent effort to rise up and join the company, but he was manifestly too weak. Si was in sore distress. He didn\u0027t want to leave him, but he was anxious to be with his company. \n \n \"Corporal Klegg,\" said the Captain, coming down the line, and giving a frequent furtive scratch at himself, \"Shorty can\u0027t possibly go with us to-day. I\u0027m awfully sorry, but there is no use talking about it. You must stay behind and take care of him, and take care of these sore-footed men who will be unable to keep up. The Colonel orders you to command the whole outfit. You keep them together, keep up as well as you can, and if you see any place that you can be useful, go in. I know and the Colonel knows that you can be trusted to do that.\" \n \n This made Si more reconciled to being left behind, and he mentally resolved that, though he might not be with his beloved regiment, he would manage to do his full share in the impending battle for Shelbyville. \n \n The \"Second Lieutenant and Aid-de-Camp\" came up. It was noticed in the distance that he was suffering from the same causes as the others, but as soon as he came into the immediate presence of the men his official dignity asserted itself, he refrained from nervous pursuit of his verminiferous assailants, and walking stiffly up to the Colonel, saluted, and said: \n \n \"Colonel, I came to report the conduct of a couple of your men who came under my command night before last, and who, while doing very well in some respects, were so grossly disrespectful to me that they should be given a sharp lesson. Unless this is done, it will tend to impair discipline and diminish the respect which men should show officers.\" \n \n The Colonel looked straight at the young officer, and noticed an unusually large insect emerge from his collar and walk deliberately up his neck onto his cheek. It must have been intensely annoying, but dignity triumphed, and the Lieutenant stood stiffly as a ramrod. \n \n \"I\u0027m very sorry to hear that any of my men should seem wanting in respect to their officers,\" said the Colonel quietly, as he \"attended to\" a wicked flea which was breakfasting off his wrist. \"I can hardly believe it. I have the most obedient and respectful men in the whole army. I\u0027m afraid you did something that provoked, if it did not justify, disrespectful conduct.\" \n \n The Lieutenant would have been different from the rest of the army if he had not been very short of temper that morning. The pangs that he was compelled to endure without the relief of scratch ing made him still more irritable, and he forgot him self sufficiently to answer: \n \n \"I beg your pardon, sir, but you are in error when you represent your men to be respectful and subordinate. On the contrary, they are the most lacking in that of any men in the army. I am constantly yelled at by them as I pass, and they say very insulting things to me. I\u0027m determined to put a stop to it, and I want you to begin with those two men. If you don\u0027t I shall make a strong report on the subject to the General, which may lead to your being placed under arrest.\" \n \n \"Young man,\" said the Colonel severely, as he calmly exterminated another one of his tormentors, \"you are so infested with vermin that I can see them crawling out from your clothes. It is an insult to me to have you appear before me in such a condition. Get out of here at once, and never approach me again in such a condition, or I shall be compelled to deal with you as you deserve.\" \n \n The Lieutenant marched away, holding himself more stiffly than ever, and the Colonel walked to ward the other flank of the regiment, looking so cross that no one dared give the laugh he was bursting with until he had mounted his horse and shout ed the command, \"Forward!\" \n \n The rain actually ceased, and the sun came out for the first time in 10 long days; from miles to the right and left came sounds of infantry and artillery firing, gradually swelling in volume. Under these exciting influences, aided, perhaps, by a really fine article of whisky, which the Surgeon had left, Shorty rapidly recovered, picked up his gun, threw his blanket-roll over his shoulders, and announced his eagerness to move forward. The sore-footed men began to feel that their feet were not really as sore as they had thought, and they also hobbled forward. The road by which they had camped led straight to Shelbyville, and they felt that by following it they would have the best chance of getting into the fight. The road was filled with cavalry, and Si and his squad worked their way through the woods to the right to get up nearer the front and find an infantry line. \n \n \"What in the world are they doin\u0027 with all these cavalry here?\" said Shorty fretfully. \"They can\u0027t do nothin\u0027 agin the mud forts and big guns and miles o\u0027 breastworks and abatis and felled timber that the rebels \u0027ve bin puttin\u0027 out in front of Shelbyville for the last six months. Horses are only in the way for sich work. They must \u0027v\u0027e put the cavalry back here to be safe, while the infantry does the work. We\u0027ll git in ahead o\u0027 the \u0027critter-companies\u0027 somewhere and find the dough-boys.\" \n \n At last they came out on a hill which commanded a view of the country, and halted, with an exclamation of delight at the magnificant sight spread out before hem. The sun was now half-way up in the sky, and shining with a brightness which seemed divine after the long period of drenching showers. Its light was reflected in brilliance from thousands of sabers and accouterments and the waving of flags of the cavalry divisions which filled the country as far as the eye could reach. Ascending the slope at the farther side of the valley was a skirmish-line, two miles long, of dismounted cavalry men, from which rose wreathes of smoke as it pressed steadily forward up the hill against the rebels ensconced there. In the green fields on either side of the road, and in the road itself, were regiments and brigades of horsemen, massed up solidly, impatiently waiting for the progress of the skirmishers to bring about the moment when they could be hurled against the enemy in a mighty avalanche of war. Bugles were sounding, flags flying, and all was intense, high-wrought, exciting animation. \n \n The boys gave a cheer of exultation at the sight. Suddenly two little regiments separated themselves from the rest, drew sabers, and, with bugles sounding the charge and the men yelling, rode straight at the infantry and the batteries defending the crest of the hill. The rebels broke before the cavalry could reach them, and began a wild flight, with infantry, cavalry and artillery mixed in wild confusion, and our horsemen swooping down on them, capturing horses, men and cannon. \n \n On everybody swept until the crest was gained which commanded a view of Shelbyville and its famous intrenchments. From these cannon thundered out, and long lines of infantry could be seen hurrying into the works to repel the audacious horsemen. Si and Shorty held their breaths, for it seemed that nothing but destruction awaited the cavalry in those awfully-planned defenses. But the cavalry thundered on with a headlong speed. Artillery galloped up on our side, to answer that in the works, and the boys lost speech in amazement at seeing the horsemen tear through the wide abatis and jump the high breastworks, while the defenders streamed back in rout into Shelbyville, pursued every step with yell and blow by the furious cavalry. Then came the noise of terrible fighting in the streets of Shelbyville. Jo Wheeler was massing every cannon that could be brought up to him in a desperate effort to hold the town, at least, until Forrest could come to his help, or he could make an orderly retreat across Duck River. But, bitterly as he fought, the union troopers fought still more savagely. They simply would not allow the thought of successful resistance, and wave after wave of fierce charges followed so rapidly that Wheeler\u0027s men broke and fled for safety into and across the river. \n \n The boys yelled themselves hoarse as they saw the stream of rebel fugitives pour across the river and seek safety in the country beyond. \n \n \"Well, Shelbyville is ours at last, after all this waiting and marching and manuvering,\" said Si, in a tone of intense exultation. \"And the cavalry took it. Wish it had been the 200th Injianny Volunteers. I\u0027ve always looked down on the cavalry, but I won\u0027t do so any more. I wish the 200th Injianny was mounted. My gracious, wasn\u0027t it grand the way those fellers just galloped over everything in sight breastworks, forts, batteries, felled timber, and lines of infantry.\" \n \n \"Yes,\" assented Shorty. \"I wouldn\u0027t \u0027ve missed the sight for the best farm in the Wabash bottoms. It was worth marching 10 days in the mud and rain to see.\" \n \n \"Here, Corporal,\" said a Cavalry Lieutenant, riding up, \"I want you to take charge of these prisoners with your squad, so we can go back and get some more. The woods are full of them. I\u0027ll make out a receipt for you to sign. I think there\u0027s just 100 of them. Count them over for yourself.\" \n \n \"Sure,\" said Si, springing forward. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2247/63259.html","bookId":439,"book":{"id":439,"title":"Si Klegg, Complete, Books 1-6","description":"简介： AFTER Si Klegg had finally yielded to his cumulative patriotic impulses and enlisted in the 200th Ind. for three years or until the rebellion was put down, with greater earnestness and solemnity to equip himself for his new career....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2247","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
