{"id":45118,"no":83,"title":"CHAPTER XVII. IN THE HOSPITAL","content":"REMOVED FROM THE BATTLEFIELD TO THE HOSPITAL AT CHATTANOOGA. FOR a short time a silence that seemed oppressive followed the fierce turmoil of the last charge of the rebels upon Snodgrass Hill and its repulse. Both sides had exhausted themselves in the awful grapple, and had to regain breath and thought. Then the night was pierced by the agonizing groans of the innumerable wounded, the stern commands of officers to their men to re-form, the calls of scattered men seeking their regiments and companies. The sadly-shrunken remnant of the unconquer able 200th Ind. gathered around its regimental colors, on the front of the crest of Snodgrass Hill, and grimly, silently prepared for the next event, whatever it might be. The wounds of those still able to fight were bound up, and they resumed their places in line. The worst hurt were helped or carried back to the busy Surgeon under the shelter of the hill. The newly-dead were brought up and added to the row of those who had already fought their last battle. Cartridge-boxes of both dead and wounded were carefully searched for remaining cartridges. Si and Shorty were laid at the end of the long row. The chill air of the evening began to revive Si and Shorty. Si\u0027s brain responded long before any of his muscles. At first it seemed the vaguest and most shadowy of dreams. There was a dim consciousness of lying somewhere. Where it was, how he came there, what was going on around he had not the slightest idea nor desire to know. There was just the feeling of being there, without any sensation of comfort or discomfort, wish or longing. One by one, and very slowly, other nerves awoke. He became conscious that there was a sharp stone or knot under his head, which hurt, and he tried to move it, but queerly his head would not move, and then he found that neither would his hands. This was faintly puzzling, as things are in dreams. Then his throat became on fire with thirst, and somehow there came a dream of the deliciously cool well on the farm at home, the bucket covered with green moss swinging over it, the splash of cool water when it was lowered, the trough by the side, where they used to pour water for the fowls to drink, the muddy spot around, where water plants grew on the splashings and drippings. Then were visions of the eternal, parching thirst of the damned, which he had often heard preachers describe, and he was conscious of a faint curiosity as to whether he had died and waked up in the home of the lost. Still not a muscle waked up to obey his will, and he seemed indifferent whether it did or not. Then he forgot everything again, until presently his burning throat recalled his consciousness. He felt the cold, bracing air in his nostrils, and slowly, very slowly at first, he began to hear and understand the sounds around him. The shriek of a wounded comrade carried past, whose leg had been shattered, first sounded like the hum of bees, and finally translated itself into something like its true meaning, but he had no comprehension or sympathy for its misery. He tried to make some sound himself, but his tongue was as hypnotized as his other muscles, and refused to obey his will. Yet at the moment he did not seem to care much. His wishes were as numb as his tendons and sinews. He became shadowly conscious of his comrades gathering around him, picking him up, carrying him back up the hill, and laying him down again. This relieved the sharp pain from the stone under his head; but when they laid him down again his head fell too low. He heard the murmur of their voices, and felt their hands searching his pockets for cartridges. Consciousness began returning more swiftly, though the muscles were yet paralyzed. He could feel to the tips of his fingers, yet he could not move them. He began to understand the words spoken about him, and comprehend their meaning. The first sentence that filtered its way to his brain was Lieut. Bowersox\u0027s order to the regiment: \"The orders are to fall back quietly. We\u0027ll follow the 1st Oshkosh, on our right. As soon as it is well down the hill we\u0027ll move by the right flank, and fall in behind it. Our wagon is right at the bottom of the hill. Those that are not able to march will start now, and get in it. It will move right after the regiment. Don\u0027t anybody say a word of this above his breath. The rebels are listening sharply for our movements. We dare not even cheer, for fear they\u0027ll find out how few are left of us. All of you keep a lookout, and follow right after me when I start, for I won\u0027t give any order.\" Then all his consciousness seemed to wake up at once into an agony of fear of being left behind to fall into the hands of the rebels. He made a desperate effort to call out, but his tongue seemed dry and useless as a cornhusk in his parched mouth, and his throat too burning hot to perform its office. Nor could he lift a finger nor move a toe. He found room for anger at Shorty that he did not look him up, and satisfy himself as to his condition, and Lieut. Bowersox and the rest seemed selfishly thoughtful of their own safety and neglectful of his. He listened in agony to the regiment on the right marching off, to the cautions and admonitions given those who were carrying off the badly-wounded, and then to Lieut. Bowersox starting off with the right of the 200th Ind. Then he heard little Abel Waite say: \"I know that Si Klegg has some things on him that his folks\u0027 d like to have. I know where they live. I\u0027m goin\u0027 to git \u0027em, and send \u0027em to \u0027em.\" \"Make haste, then, young feller,\" he heard Wat Burnham growl. \"Don\u0027t let the rebels ketch yer. We\u0027re movin\u0027 now.\" He heard Abel Waite\u0027s steps running toward him, and felt his hands thrust into his blouse pocket over his breast. Then the boy said with a start of surprise: \"Why, he\u0027s alive yet. Come here, Wat.\" Wat and the Irishmen hastened to him. He felt Wat\u0027s hand laid on his breast, and then held over his mouth. \"\u0027E\u0027s certainly warm yet. Hand \u0027e breathes.\" Shorty made a violent effort, and summoned enough strength to reach over and touch the Englishman\u0027s foot. \"The tall feller\u0027s alive, too,\" said Wat. \"We must take \u0027em along with us,\" said Abel Waite excitedly. \"Yes, but \u0027ow?\" growled the Englishman. \"Don\u0027t speak so loud, you young brat. Do you want to hopen hup that \u0027ell\u0027s kitchen hagin?\" \"The Liftinant\u0027s far down the hill wid the regiment,\" said Barney McGrath. \"There\u0027s no toime to sind for him. Here, lit\u0027s pick thim up an\u0027 carry thim down to the wagon.\" He put his hand under Si\u0027s shoulder. The others did the same, Wat lifting Shorty\u0027s feet. \"Halt, there, you Yanks, and surrender,\" said a stern voice just behind Wat. Wat looked back over his shoulder and saw a single adventurous rebel who, divining what was going on, had slipped forward in the darkness, with his gun leveled on the squad bearing Si. Wat realized instantly that the rebel must be suppressed with out alarm to others that might be behind him. He dropped Shorty\u0027s foot, and with a backward sweep of his mighty right took the rebel in the stomach with such force as to double him up. The next instant Wat had his throat in his terrific grip, and tried to tear the windpipe from him. Then he flung the rebel forward down the hill, gathered up Shorty\u0027s feet again, and gave the command: \"Hall right. Go a\u0027ead, boys, quick has you can.\" With great difficulty they made their way over the wreckage of battle down the hill toward where they expected to find the regimental wagon. But it had received all that it could hold of its ghastly freight and moved off. They were is despair for a few minutes, until Abel Waite discovered an abandoned wagon near by, with one mule still hitched to it. Next they found a wounded artillery horse which had been turned loose from his battery. He was hitched in, and Si and Shorty were laid on the layer of ammunition-boxes which still covered the bottom of the bed. \"Who\u0027ll drive the bloody team?\" growled Wat. \"Hi never druv a \u0027oss hin my life. \u0027Ere, Barney, you get hin the saddle.\" \"Not Oi,\" answered Barney. \"Oi niver could droive ayven a pig, on the brightest day that shone. Oi\u0027ll not fool wid a couple av strange horses, a wagon-load av foire an\u0027 brimstone, an\u0027 a brace av dead men, in the midst av Aygytian darkness. Not Oi.\" \"Here, I kin drive two horses, anyway,\" said Abel Waite, climbing into the saddle. \"I\u0027ve done that much on the farm.\" They pushed off into the road marked by the dark line of troops moving silently toward McFarland\u0027s Gap, and after some contest with other drivers secured a place behind one of the regiments of their brigade. A couple of miles ahead Forrest\u0027s cavalry was making a noisy dispute of the army\u0027s retreat, the woods were on fire, and the fences on either side of the road were blazing. The long line was halted in anxious expectation for a little while, as the storm of battle rose, and the men looked into each other\u0027s faces with sickening apprehension, for it seemed much like defeat and capture. Then loud cheers, taken up clear down the line\u0027, rose as Turchin\u0027s Brigade, by a swift bayonet charge, swept away all opposition, scattered the rebels to the shelter of the woods, and reopened the way. But the rebels still continued to fire long distance shots at the road as outlined by the burn ing fences. The Dead Being Collected After the Battle. 220 Though one of his team was wounded, Abel Waite had little difficulty in keeping his place in column until the burning lane was reached. The regiment ahead had gone through on the double-quick, and teams as fast as they could be lashed. \"What\u0027ll we do now?\" he called out to the others in his boyish treble. \"I can\u0027t git these plugs out of a walk. If we go ahead the fire\u0027ll bust the ammunition, and send us all sky-huntin\u0027. If we stop here them rebels \u0027ll git us, sure.\" \"Go a\u0027ead, Habe,\" growled Wat, after a moment\u0027s thought. \"We can\u0027t \u0027elp you, but we\u0027ll stay wi\u0027 you. Hif she busts, she busts, hand that\u0027s hall there\u0027ll be hof hit hor hof us. We\u0027ll stick by the wagon, though, till she busts, hand then nobuddy but the crows \u0027ll hever find hany hof hus. Go a\u0027ead, you bloody brat.\" \"Cut me one o\u0027 them young hickories for a gad,\" said Abel, pointing to the brush by the side of the road, \"and I\u0027ll git as good time out o\u0027 these poor brutes as they kin make, if I skin \u0027em alive.\" Abel lashed his animals with all the strength of his young arm, and succeeded in keeping them in something like a trot. The men ran alongside, and fought the fire as well as they were able. Several times the wagon-cover caught fire from the intense heat, but it was at once beaten out by hats and blouses, and blouses were laid over the holes to protect them against the sparks. They succeeded at last in getting through the fire-bordered road without an explosion, but they were all so exhausted that they could not move another step until they rested. The poor horse lay down and refused to get up. Wat and Abel looked in to see how Si and Shorty had fared. The jolting of the wagon and the cold night air had at first revived them so that they could speak. Then they swooned again from the effects of the heat and the stifling smoke, and were speech less and motionless when Wat and Abel looked in. \"We\u0027ve \u0027ad hall hour trouble for nothink,\" said Wat disconsolately, as he felt them over. \"The \u0027eat and smoke\u0027s killed \u0027em.\" \"Not by a durned sight,\" slowly gasped Shorty. \"Seen sicker dogs\u0027n this git well. Nearly dead for a drink o\u0027 water, though. Then I\u0027ll be all right.\" Abel snatched a canteen, ran to a branch a little way off, filled it, and returning, put it to Shorty\u0027s lips. \"Jehosephat, how good that tastes,\" said Shorty, speaking still faintly, but far more freely than at first, after he had drained the canteen. \"Sonny, run and git some more; and mind you fill the canteen full this time. I feel as if I could drink up the Mississippi River. Say, boys, what\u0027s happened? Appearintly, I got a sock-dologer on my head from some feller who thought I was too fresh. I\u0027m afraid I\u0027ll have a spell o\u0027 headache. But we got the flag, didn\u0027t we?\" \"Yo\u0027re bloody right we did,\" said Wat; \"hand we wolloped them bloomin\u0027 rebels till they \u0027unted their \u0027oles hin the woods.\" \"That\u0027s good enough,\" said Shorty, sinking back. \"The column\u0027s movin\u0027 agin,\" said Abel Waite, turn ing his attention to his team. Shortly after daybreak the team limped painfully up the slope of Mission Ridge, through Rossville Gap, on either side of which stood Thomas\u0027s indomitable army in battle array, sternly defying the rebel hosts of Bragg and Longstreet, which swarmed over the hills and valleys in front, but without much apparent appetite for a renewal of the dreadful fray. \"Where do you men belong? What have you got in that wagon? Where are you going?\" demanded the Provost officer in the road. \"We belong to the 200th Hinjianny. We\u0027ve got two badly-wounded men and ha lot o\u0027 hammynition in the wagon. We want to find our regiment,\" an swered Wat Burnham. \"Stop your wagon right there. We need all the ammunition we can get. Lift your wounded men into that ambulance, and then go up to that side of the gap. Your division is up there somewhere.\" It was late in the afternoon before the overworked Surgeon in the field hospital at Chattanooga, in which Si and Shorty were finally deposited, found time to examine them. \"You got a pretty stiff whack on your head, my man,\" he said to Shorty, as he finished looking him over; \"but so far as I can tell now it has not fractured your skull. You Hoosiers have mighty hard heads.\" \"Reglar clay-knob whiteoak,\" whispered Shorty; \"couldn\u0027t split it with a maul and wedge. Don\u0027t mind that a mite, since we got that flag. But how\u0027s my pardner over there?\" \"I think you\u0027ll pull through all right,\" continued the Surgeon, \"if you don\u0027t have concussion of the brain. You\u0027ll have to be—\" \"No danger o\u0027 discussion of the brains,\" whispered Shorty. \"Don\u0027t carry \u0027em up there, where they\u0027re liable to get slubbed. Keep \u0027em in a safer place, where there\u0027s more around \u0027em. But how\u0027s my pardner?\" \"You\u0027ll come through all right,\" said the Surgeon smiling. \"You\u0027re the right kind to live. You\u0027ve got grit. I\u0027ll look at your partner now.\" He went to Si and examined him. Shorty turned on his side and watched him with eager eyes. His heart sickened as he saw the Surgeon\u0027s face grow graver as he proceeded. The Surgeon probed the bullet\u0027s track with his fingers, and drew out a piece of folded letter paper stained with blood. Instinctively he unfolded it, and read through the ensanguined smears, written in a cramped school-girl hand: \"Dear Si: Though I did not have the heart to say it, Ime yours till death, and Ime sure you feel the same way. Annabel.\" \"I\u0027m much afraid the end has come too soon to a brave as well as loving heart,\" said the Surgeon sadly. \"Doctor, he can\u0027t die. He mustn\u0027t die,\" said Shorty in agony. \"The regiment can\u0027t spare him. He\u0027s the best soldier in it, and he\u0027s my pardner.\" \"He may live, but it\u0027s a very slender chance,\" said the Surgeon. \"Men live in this war against all science and experience, and it is possible that he may.\" \"Major,\" said Lieut. Bowersox, coming in, \"I understand that two of my men were brought in here wounded. The report which was sent North this morning gave them as killed. If you have them here I want to correct it and save their people sorrow.\" \"One of them,\" answered the Surgeon, \"has no thought of dying, and will, I\u0027m sure, pull through. I am sorry I cannot say the same for the other. It he lives it will be a wonder.\" \"Neither of us is a-going to die till we\u0027ve put down this damned rebellion, and got home and married our girls,\" gasped Shorty with grim effort. \"You can jist telegraph that home, and to ole Abe Lincoln, and to all whom it may concern.\" And he fell back exhausted on his blanket.","sourceLink":"http://novel.tingroom.com/jingdian/2247/63270.html","bookId":439,"book":{"id":439,"title":"Si Klegg, Complete, Books 1-6","description":"简介： AFTER Si Klegg had finally yielded to his cumulative patriotic impulses and enlisted in the 200th Ind. for three years or until the rebellion was put down, with greater earnestness and solemnity to equip himself for his new career....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2247","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
