{"id":67241,"no":26,"title":"Page 26","content":"“Any idea who they’re coming from?” Peggy asked.\\n\\n Corrie didn’t answer right away. She swallowed the lump that formed in her throat. “I do have an idea,” she managed to whisper. It was all she’d thought about since discussing their unknown child with Roy. He was adamant; they’d vowed not to speak of it again and he was holding her to that.\\n\\n Peggy, who was a sensitive woman, gave her a concerned look. “If you’d rather not say anything…”\\n\\n “I…can’t. I talked to Roy about it, but he won’t listen. What I’m thinking of happened a long time ago, and he feels it’s best to leave it in the past.” Corrie realized she’d already said more than was advisable. “He’s probably right.”\\n\\n “Let’s drop the subject then.”\\n\\n Needing a diversion, Corrie reached for her tea. “Perhaps that would be best.”\\n\\n “Can you answer one question?” Peggy sounded mildly embarrassed. “I shouldn’t ask, but curiosity is getting the better of me. Was there a message on the Christmas card?”\\n\\n An involuntary smile came to Corrie. “Nothing cryptic, if that’s what you mean. All it said was Merry Christmas.”\\n\\n “None of these messages have been threatening, have they?” She held up her hand. “Don’t answer that. We’re changing the subject.”\\n\\n The waitress brought their lunch, a hot crab and cheese mixture spilling over both halves of the toasted English muffins. This was one of Corrie’s favorite meals, a specialty at D.D.’s. She wondered why she hadn’t been here in so long. Mostly, she decided, because of her daughter’s work schedule. They enjoyed meeting for lunch, but Linnette’s shift changed every week and—\\n\\n Corrie’s thoughts came to a grinding halt as she saw Linnette’s neighbor in a booth across the restaurant. Gloria was sitting there with Chad Timmons.\\n\\n “Oh, no,” she whispered, setting her fork down.\\n\\n “What?” Peggy asked, looking around for whatever had alarmed Corrie.\\n\\n “Over there,” she whispered, bending toward her friend. “See that couple on the other side of the room?”\\n\\n Peggy’s eyes narrowed. “Isn’t that Dr. Timmons? Bob and I met him the day the clinic opened.”\\n\\n “The one and only,” Corrie muttered. “The woman with him is my daughter’s neighbor. Gloria something. I can’t recall her last name.” Corrie’s heart raced with anxiety. “Linnette really likes her, and I’m pleased about that. A friend is exactly what she needed to feel comfortable in Cedar Cove.”\\n\\n “I agree.”\\n\\n “The thing is, Linnette has a crush on this doctor. She’s turned a blind eye to anyone else.”\\n\\n “By anyone else, you mean Cal Washburn.”\\n\\n “Exactly,” Corrie said more loudly than she’d intended. Heads turned. Unfortunately, some of the attention came from the other side of the room. Flustered, she immediately focussed on her meal, lowering her head and not looking up.\\n\\n “She saw you,” Peggy said.\\n\\n “Oh, great.”\\n\\n “What do you want to do?”\\n\\n “Nothing,” Corrie muttered. “It isn’t like she’s trying to hide the fact that she’s having lunch with Dr. Timmons. Besides, Linnette has no hold on this man. In my opinion, she’s being utterly foolish.” What Corrie hated most was the possibility that Linnette’s friendship with Gloria might be threatened by this. Corrie certainly wasn’t planning to mention it to her daughter.\\n\\n “So what happened with Linnette and the horse trainer?” Peggy inquired.\\n\\n Pinching her lips together in irritation, Corrie shook her head. “She told him she was interested in someone else.”\\n\\n “That’s too bad.” Even Peggy was disappointed.\\n\\n “It’s her decision, of course. I just wish it had worked out. I like Cal.”\\n\\n “I do, too.”\\n\\n They were so involved in their conversation that Corrie didn’t notice Gloria walking across the room. Not until her daughter’s neighbor reached her table and spoke did Corrie glance up.\\n\\n “Hello, Mrs. McAfee.”\\n\\n “Hello, uh, Gloria,” she said, startled. She smiled brightly to compensate for her awkwardness. “Have you met Peggy Beldon?”\\n\\n “No, I don’t think so.”\\n\\n The three exchanged small talk for a few minutes. Corrie noticed that Dr. Timmons had already left.\\n\\n “I didn’t want to give you the wrong impression,” Gloria said, after a brief silence. “Dr. Timmons and I aren’t seeing each other.”\\n\\n “Why would it matter?” Corrie said blithely. This really wasn’t any of her business.\\n\\n “He had a question for me, about a police matter, and wanted to take me to lunch. I wouldn’t have gone, but he insisted. I know how Linnette feels about him.”\\n\\n Half the town probably knew of Linnette’s feelings toward the doctor, since she hadn’t made the slightest effort to hide her attraction. But Corrie figured that if Chad Timmons was interested in her daughter, he would’ve asked her out by now. He’d obviously set his sights on Gloria, not Linnette.\\n\\n “Linnette is a good friend,” Gloria went on to explain, “and I don’t want to do anything to put our friendship at risk.”\\n\\n “That’s very considerate, but I don’t think you should worry about it.”\\n\\n “Perhaps not, but my friends are important to me, and I’ve come to treasure Linnette.”\\n\\n Corrie just hoped her daughter appreciated what a good friend she had in her neighbor.\\n\\n After a few words of farewell, Gloria departed.\\n\\n “She really is very nice, isn’t she?” Peggy said when Gloria was gone.\\n\\n “She is.” Corrie nodded.\\n\\n “Did you see how they were looking at each other?” Peggy asked. “I could feel the electricity all the way over here.”\\n\\n Corrie frowned at her remark. This was even worse than she’d thought. All she could do was hope that Linnette came to her senses and realized she was on a path that led to heartache.\\n\\n Twenty-Seven\\n\\n Grace Sherman had seriously considered Olivia’s advice and decided to take a stand with Cliff. It was time to end this erratic relationship. She never seemed to know whether they were on or off, casual friends or practically engaged. It varied from one encounter to the next.\\n\\n In her heart, she believed Cliff loved her. But he wasn’t sure he could trust her, despite everything she’d said and done since her Internet dalliance with Will Jefferson. Still, Grace was secure in her own feelings for Cliff. And she wanted to be with him, as his wife. She’d seen the difference in Olivia since she’d married Jack; she’d seen the changes in Jack, too. Grace decided that if Cliff loved her, he’d agree they should be married. If he didn’t feel he could move forward in their relationship, then she needed to know that now. Yes, proposing might be outrageous, maybe risky, but Grace wanted to discover his feelings—and his intentions—once and for all.\\n\\n Never having asked a man to marry her before, she wasn’t sure how to go about it. Her first inclination was to invite him to a fancy restaurant, the way she’d seen it done in the movies. That would create the requisite romantic setting, with champagne and classical music, but it wouldn’t allow them much privacy. And if they went to The Lighthouse, elegant though it was, she’d be sharing one of the most intimate moments of her life with far too many of her friends and neighbors.\\n\\n So, no restaurant, which left one other option. Fortunately Grace loved to cook. She enjoyed every aspect of it—choosing the recipes, the trip to the grocery store, the preparation itself. She didn’t even mind washing the dishes. She felt comfortable in her kitchen. So—in an effort to start the new year right—she invited Cliff to dinner on Sunday.\\n\\n “Any particular reason?” Cliff asked when she phoned him at the ranch. He seemed to guess that this wasn’t an ordinary invitation.\\n\\n “It’s New Year’s Day.” Grace couldn’t very well admit she planned to propose to him. That would come over thick slices of homemade apple pie served with French vanilla ice cream, his favorite. Or maybe she’d do it during a romantic champagne toast…\\n\\n “You’ve got yourself a deal.”\\n\\n Grace just hoped he’d be as easily persuaded when she asked that all-important question.\\n\\n Not wanting to speak without forethought or reflection, she carefully wrote out what she intended to say. She wanted to review their relationship, starting with the early days when they’d first begun seeing each other. They’d met due to a credit card mix-up three years ago—had it really been that long? After thirty-five years as Dan’s wife, she’d been nervous and uncertain about entering into a new relationship, and in some ways she still was.\\n\\n She remembered how gentle Cliff had been with her. Following Dan’s memorial service, she’d collapsed from grief and fatigue, and Cliff was the one who’d stayed with her, who’d comforted her, who’d encouraged her to grieve for her husband. She’d buried Dan that day, and so much more—all the memories, good and bad. Through it all, Cliff had been at her side, a constant support.\\n\\n They’d been separated for a while and during those long, lonely months Grace had understood how foolish she’d been and how much she loved Cliff. She’d made an error in judgment. She was sorry about it. Either Cliff accepted that or he didn’t; it was time to find out.\\n\\n For dinner Grace went all out. The most elaborate meal she could think of was individual Beef Wellingtons, along with a baked potato casserole and fresh young asparagus shoots. The salad was a special recipe from the Food Channel, with greens, blue cheese and roasted spiced pecans. She blew a good third of her monthly food budget on this meal alone, but it would be worth it.\\n\\n Cliff was to arrive at six. The table was set with her mother’s china, used only on the most momentous occasions. The wine—a French Merlot that came highly recommended—was open and breathing. She hadn’t spared any expense on that, either. The candles were ready to light.\\n\\n “What do you think, Buttercup?” she asked the golden retriever, who lay on her dog bed in the kitchen. Buttercup wagged her tail enthusiastically—approving, Grace was sure, of her plans. Sliding her hand inside her apron pocket, she fingered the half-dozen index cards she’d placed there. These cards were her security and her talisman. On them she’d written her feelings—her love for Cliff, her hopes for them both.\\n\\n At ten minutes after six, Grace stood in the living room looking out the window, waiting for Cliff’s truck. Sherlock, her cat, lounged on the back of the couch, undisturbed by Grace’s nervousness.\\n\\n Every thirty seconds, she glanced at her watch, wondering what had held him up. When Cliff was twenty-five minutes late, she was convinced he’d had an accident on his way into town. Black ice often covered the roads in the winter months; he could’ve hit a patch and driven into a ditch.\\n\\n At six-thirty, she couldn’t stand it any longer and phoned the ranch. Cal picked up on the second ring. \\n\\n","sourceLink":"https://allnovel.net/50-harbor-street-cedar-cove-5/page-26.html","bookId":1945,"book":{"id":1945,"title":"50 Harbor Street (Cedar Cove #5)","description":"Storyline: 50 Harbor Street (Cedar Cove #5) \\n Welcome to Cedar Cove – a small town with a big heart! There’s a mystery to be solved in Cedar Cove. Local private detective Roy McAfee and his wife Corrie have been receiving anonymous postcards with messages asking if they “regret the past. ” What does it mean? On a more positive note, Roy and Corrie’s daughter Linette is now working at the new medical clinic and is very taken with the new doctor. But where does this leave doting Cal Washburn, who works for Cliff at the horse farm? Speaking of Cliff, it looks like the romance between him and Grace Sherman is back on. Could a wedding be on the cards? There’s so much to discover in Cedar Cove. Make time for friends. Make time for Debbie Macomber.\\n","cover":"https://allnovel.net/images/50-harbor-street-cedar-cove-5.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/50-harbor-street-cedar-cove-5.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:03:50 AM"}}
