{"id":16549,"no":6,"title":"CHAPTER VI THE CAPTURE","content":"Lodrix had no fear as he chased the deer into the thick forest. He forgot that his father had told him not to stray far from the men. On and on he ran, thinking of nothing but the deer. At last he saw the beautiful deer not far away. Softly he knelt down. He raised his bow and took steady aim. He did not hear stealthy footsteps coming nearer and nearer behind him. Suddenly he was held in strong arms, and looking up, he saw many strange faces about him. He was too frightened to call for help, for he knew that these were the Bear people. As they carried him away, he struggled, but the arms that held him were very strong and he could not free himself. They walked on and on, through the thick forest, farther and farther away, and Lodrix wondered where he was going and what would happen. He thought of his father and mother and the men who, he knew, were looking for him. Tears came to his eyes, but he did not cry, because he was too brave a boy. These people did not talk to him, nor did they talk to one another. Lodrix could hear nothing but the cry of the wolves in the distance. Everything seemed strange, and the boy did not know where he was. He had never been so far from home before. On and on they went. Lodrix could hardly walk, he was so tired. Just as the sun went down, they came to the village of the Bear people. The men led Lodrix to one of the huts and gave him food. When he had eaten some meat, he threw himself on a skin and fell asleep. While he slept, the Bear people were talking about him and the chief was deciding what should be done. Lodrix slept long, and when he wakened the sun was shining through the doorway. The boy looked about him in wonder and for a moment did not know where he was. Then he saw Tevico, who was standing near him. Tevico had been left to guard the prisoner, but the Bear people did not know that Lodrix’s father had once saved Tevico’s life. This young watcher felt very friendly toward the Lake-Dweller people, and he was ready to help the captive boy. When Lodrix saw Tevico, he said, “Where am I? Why am I here?” “You have been taken prisoner by the Bear people because they hate your father and your people. “I have been left here to guard you, and I will be your friend if you will let me. I have not forgotten that your father once saved me from the wolves. “You must be very careful not to show my people that we are friends or they will not let me stay with you. “When I get a chance I will let your father know where you are and how he can get you. “Last night, my people held a council and decided to kill you, but I told them that your father had much bronze which he would give my tribe for your safe return.” Lodrix stood up and grasped Tevico’s hand, for he was glad to find a friend here, among his enemies. “My father will give anything your people ask for my freedom,” said the boy. “Send to him and tell him where I am.” “I can not go till my chief sends me,” Tevico said. “Do not fear. You will soon be at home again. “Here is some deer meat for you. Eat it, for you must be hungry.” Lodrix tried to eat, but could not, for he was so homesick that he could scarcely keep from crying. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2767/76337.html","bookId":1335,"book":{"id":1335,"title":"Lodrix the Little Lake Dweller","description":"简介： Many years ago, there lived in the high regions of Switzerland and France a people called the Lake-Dwellers....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2767","creation":"Aug 1, 2019 12:24:53 AM","modification":"Aug 1, 2019 12:24:53 AM"}}
