{"id":5317,"no":18,"title":"Book ii Young Faustus xvii","content":"Often during these years of fury, hunger, and unrest, when he was trying to read all the books and know all the people, he would live for days, and even for weeks, in a world of such mad and savage concentration, such terrific energy, that time would pass by him incredibly, while he tried to eat and drink the earth, stare his way through walls of solid masonry into the secret lives of men, until he had made the substance of all life his own. \n \n And during all this time, although he was living a life of the most savage conflict, the most blazing energy, wrestling day by day with the herculean forces of the million-footed city, listening to a million words and peering into a hundred thousand faces, he would nevertheless spend a life of such utter loneliness that he would go for days at a time without seeing a face or hearing a voice that he knew, and until the sound of his own voice seemed strange and phantasmal to him. \n \n Then suddenly he would seem to awake out of this terrific vision, which had been so savage, mad, and literal that its very reality had a fabulous and dreamlike quality, and time, strange million-visaged time, had been telescoped incredibly, so that weeks had passed by like a single day. He would awake out of this living dream and see the minutes, hours, and days, and all the acts and faces of the earth pass by him in their usual way. And instantly, when this happened, he would feel a bitter and intolerable loneliness — a loneliness so acrid, grey, and bitter that he could taste its sharp thin crust around the edges of his mouth like the taste and odour of weary burnt-out steel, like a depleted storage battery or a light that had gone dim, and he could feel it greyly and intolerably in his entrails, the conduits of his blood, and in all the substance of his body. \n \n When this happened, he would feel an almost unbearable need to hear the voice and see the face again of someone he had known and at such a time as this he would go to see his Uncle Bascom, that strange and extraordinary man who, born like the others in the wilderness, the hills of home, had left these hills for ever. \n \n Bascom now lived alone with his wife (for his four children were grown up and would have none of him) in a dingy section of one of the innumerable suburbs that form part of the terrific ganglia of Boston, and it was here that the boy would often go on Sundays. \n \n After a long confusing journey that was made by subway, elevated, and street car, he would leave the chill and dismal street car at the foot of a hill on a long, wide, and frozen street lined with tall rows of wintry elms, with smoky wintry houses that had a look of solid, closed and mellow warmth, and with a savage frozen waste of tidal waters on the right — those New England waters that are so sparkling, fresh and glorious, like a tide of sapphires, in the springtime, and so grim and savage in their frozen desolation in the winter. \n \n Then the street car would bang its draughty sliding doors together, grind harshly off with its cargo of people with pinched lips, thin red pointed noses, and cod-fish faces, and vanish, leaving him with the kind of loneliness and absence which a street car always leaves when it has gone, and he would turn away from the tracks along a dismal road or street that led into the district where his uncle had his house. And stolidly he would plunge forward against the grey and frozen desolation of that place to meet him. \n \n And at length he would pause before his uncle’s little house, and as he struck the knocker, he was always glad to hear the approaching patter of his Aunt Louise’s feet, and cheered by the brightening glance of her small birdy features, as she opened the door for him, inwardly exultant to hear her confirm in her bright ladylike tones his own prediction of what she would say: “Oh, THEAH you ah! I was wondering what was keeping you.” \n \n A moment later he would be greeted from the cellar or the kitchen by his uncle Bascom’s high, husky and yet strangely remote yell, the voice of a prophet calling from a mountain: \n \n “Hello, Eugene, my boy. Is that YOU?” And a moment later the old man would appear, coming up to meet him from some lower cellar-depth, swearing, muttering, and banging doors; and he would come toward him howling greetings, buttoned to his chin in the frayed and faded sweater, gnarled, stooped and frosty-looking, clutching his great hands together at his waist; then hold one gaunt hand out to him and howl: \n \n “Hello, hello, hello, sit down, sit down, sit down,” after which, for no apparent reason, he would contort his gaunt face in a horrible grimace, convolve his amazing rubbery lips, and close his eyes and his mouth tightly and laugh through his nose in forced snarls: “Phuh! Phuh Phuh! Phuh! Phuh!” \n \n Bascom Pentland had been the scholar of his amazing family: he was a man of powerful intelligence and disordered emotions. Even in his youth, his eccentricities of dress, speech, walk, manner had made him an object of ridicule to his Southern kinsmen, but their ridicule was streaked with pride, since they accepted the impact of his personality as another proof that theirs was an extraordinary family. “He’s one of ’em, all right,” they said exultantly, “queerer than any of us!” \n \n Bascom’s youth, following the war between the States, had been seared by a bitter poverty, at once enriched and warped by a life that clung to the earth with a rootlike tenacity that was manual, painful, spare and stricken, and that rebuilt itself — fiercely, cruelly, and richly — from the earth. And because there burned and blazed in him from the first a hatred of human indignity, a passionate avowal of man’s highness and repose, he felt more bitterly than the others the delinquencies of his father, and the multiplication of his father’s offspring, who came regularly into a world of empty cupboards. \n \n “As each of them made its unhappy entrance into the world,” he would say later, his voice tremulous with passion, “I went out into the woods striking my head against the trees, and blaspheming God in my anger. Yes, sir,” he continued, pursing his long lip rapidly against his few loose upper teeth, and speaking with an exaggerated pedantry of enunciation, “I am not ashamed to confess that I did. For we were living in conditions unWORTHY— UNWORTHY”— his voice rising to an evangelical yell, “I had almost said — of the condition of animals. And — SAY— what do you think?”— he said, with a sudden shift in manner and tone, becoming, after his episcopal declaration, matter of fact and whisperingly confidential. “Why, do you know, my boy, at one time I had to take my OWN father aside and point out to him we were living in no way becoming decent people.”— Here his voice sank to a whisper, and he tapped Eugene on the knee with his big, stiff finger, grimacing horribly and pursing his lip against his dry upper teeth. \n \n Poverty had been the mistress of his youth and Bascom Pentland had not forgotten: poverty had burned its way into his heart. He took what education he could find in a backwoods school, read everything he could, taught, for two or three years, in a country school and, at the age of twenty-one, borrowing enough money for railway fare, went to Boston to enrol himself at Harvard. And, somehow, because of the fire that burned in him, the fierce determination of his soul, he had been admitted, secured employment waiting on tables, tutoring, and pressing everyone’s trousers but his own, and lived in a room with two other starved wretches on $3.50 a week, cooking, eating, sleeping, washing, and studying in the one place. \n \n At the end of seven years he had gone through the college and the school of theology, performing brilliantly in Greek, Hebrew, and metaphysics. \n \n Poverty, fanatical study, the sexual meagreness of his surroundings, had made of him a gaunt zealot: at thirty he was a lean fanatic, a true Yankee madman, high-boned, with grey thirsty eyes and a thick flaring sheaf of oaken hair — six feet three inches of gangling and ludicrous height, gesticulating madly and obliviously before a grinning world. But he had a grand lean head: he looked somewhat like the great Ralph Waldo Emerson — with the brakes off. \n \n About this time he married a young Southern woman of a good family: she was from Tennessee, her parents were both dead, and in the ‘seventies she had come North and had lived for several years with an uncle in Providence, who had been constituted guardian of her estate, amounting probably to about $75,000, although her romantic memory later multiplied the sum to $200,000. The man squandered part of her money and stole the rest: she came, therefore, to Bascom without much dowry, but she was pretty, bright, intelligent, and had a good figure. Bascom smote the walls of his room with bloody knuckles, and fell down before God. \n \n When Bascom met her she was a music student in Boston: she had a deep full-toned contralto voice which was wrung from her somewhat tremulously when she sang. She was a small woman, birdlike and earnest, delicately fleshed and boned, quick and active in her movements and with a crisp tart speech which still bore, curiously, traces of a Southern accent. She was a brisk, serious, ladylike little person, without much humour, and she was very much in love with her gaunt suitor. They saw each other for two years: they went to concerts, lectures, sermons; they talked of music, poetry, philosophy and of God, but they never spoke of love. But one night Bascom met her in the parlour of her boarding-house on Huntington Avenue, and with a voice vibrant and portentous with the importance of the words he had to utter, began as follows: “Miss Louise!” he said carefully, gazing thoughtfully over the apex of his hands, “there comes a time when a man, having reached an age of discretion and mature judgment, must begin to consider one of the GRAVEST— yes! by all means one of the most important events in human life. The event I refer to is — matrimony.” He paused, a clock was beating out its punctual measured tock upon the mantel, and a horse went by with ringing hoofs upon the street. As for Louise, she sat quietly erect, with dignified and ladylike composure, but it seemed to her that the clock was beating in her own breast, and that it might cease to beat at any moment. \n \n “For a minister of the Gospel,” Bascom continued, “the decision is particularly grave, because, for him — once made, it is IRREVOCABLE, once determined upon, it must be followed INEXORABLY, RELENTLESSLY— aye! to the edge of the grave, to the UTTERMOST gates of death, so that the possibility of an error in judgment is FRAUGHT”— his voice sinking to a boding whisper —“is FRAUGHT with the most terrible consequences. Accordingly,” Uncle Bascom said in a deliberate tone, “having decided to take this step, realizing to the FULL— to the FULL, mind you — its gravity, I have searched my soul, I have questioned my heart. I have gone up into the mountings and out into the desert and communed with my MAKER until”— his voice rose like a demon’s howl —“there no longer remains an ATOM of doubt, a PARTICLE of uncertainty, a VESTIGE of DISBELIEF! Miss Louise, I have decided that the young lady best fitted in every way to be my helpmate, the partner of my joys and griefs, the confidante of my dearest hopes, the inSPIR-ation of my noblest endeavours, the companion of my declining years, and the SPIRIT that shall accompany me along each step of life’s vexed and troubled way, sharing with me whatever God in His INSCRUTABLE Providence shall will, whether of wealth or poverty, grief or happiness — I have decided, Miss Louise, that that lady must be-yourself! — and, therefore, I request,” he said slowly and impressively, “the honour of your hand in mar-ri-age.” \n \n She loved him, she had hoped, prayed, and agonized for just such a moment, but now that it had come she rose immediately with ladylike dignity, and said: “Mistah Pentland: I am honuhed by this mahk of yoah esteem and affection, and I pwomise to give it my most UNnest considahwation without delay. I wealize fully, Mistah Pentland, the gwavity of the wuhds you have just uttuhed. Foh my paht, I must tell you, Mistah Pentland, that if I accept yoah pwoposal, I shall come to you without the fawchun which was WIGHTfully mine, but of which I have been depwived and defwauded by the WASCALITY— yes! the WASCALITY of my gahdian. I shall come to you, theahfoh, without the dow’y I had hoped to be able to contwibute to my husband’s fawchuns.” \n \n “Oh, my DEAR Miss Louise! My DEAR young lady!” Uncle Bascom cried, waving his great hand through the air with a dismissing gesture. “Do not suppose — do not for one instant suppose, I beg of you! — that consideration of a monetary nature could influence my decision. Oh, not in the slightest!” he cried. “Not at all, not at all!” \n \n “Fawchnatly,” Louise continued, “my inhewitance was not WHOLLY dissipated by this scoundwel. A pohtion, a vewy small pohtion, remains.” \n \n “My dear girl! My dear young lady!” Uncle Bascom cried. “It is not of the SLIGHTEST consequence. . . . How much did he leave?” he added. \n \n Thus they were married. \n \n Bascom immediately got a church in the Middle West: good pay and a house. But during the course of the next twenty years he was shifted from church to church, from sect to sect — to Brooklyn, then back to the Middle West, to the Dakotas, to Jersey City, to Western Massachusetts, and finally back to the small towns surrounding Boston. \n \n When Bascom talked, you may be sure God listened: he preached magnificently, his gaunt face glowing from the pulpit, his rather high, enormously vibrant voice husky with emotion. His prayers were fierce solicitations of God, so mad with fervour that his audiences uncomfortably felt they came close to blasphemy. But, unhappily, on occasions his own mad eloquence grew too much for him: his voice, always too near the heart of passion, would burst in splinters, and he would fall violently forward across his lectern, his face covered by his great gaunt fingers, sobbing horribly. \n \n This, in the Middle West, where his first church had been, does not go down so well — yet it may be successful if one weeps mellowly, joyfully — smiling bravely through the tears — at a lovely aisle processional of repentant sinners; but Bascom, who chose uncomfortable titles for his sermons, would be overcome by his powerful feelings on those occasions when his topic was “Potiphar’s Wife,” “Ruth, the Girl in the Corn,” “The Whore of Babylon,” “The Woman on the Roof,” and so on. \n \n His head was too deeply engaged with his conscience — he was in turn Episcopal, Presbyterian, Unitarian, searching through the whole roaring confusion of Protestantism for a body of doctrine with which he could agree. And he was for ever finding it, and later for ever renouncing what he had found. At forty, the most liberal of Unitarians, the strains of agnosticism were piping madly through his sermons: he began to hint at his new faith in prose which he modelled on the mighty utterance of Carlyle, and in poetry, in what he deemed the manner of Matthew Arnold. His professional connection with the Unitarians, and indeed with the Baptists, Methodists, Holy Rollers, and Seventh Day Adventists, came to an abrupt ending after he read from his pulpit one morning a composition in verse entitled “The Agnostic,” which made up in concision what it lacked in melody, and which ended each stanza sadly, but very plainly, on this recurrence: \n \n “I do not know: \n \n It may be so.” \n \n Thus, when he was almost fifty, Bascom Pentland stopped preaching in public. There was no question where he was going. He had his family’s raging lust for property. He became a “conveyancer”; he acquired enough of the law of property to convey titles; but he began to buy pieces of land in the suburbs of Boston and to build small cheap houses, using his own somewhat extraordinary designs to save the architect’s fees and, wherever possible, doing such odd jobs as laying the foundations, installing the plumbing, and painting the structure. \n \n The small houses that he — no, he did not build them! — he went through the agonies of monstrous childbirth to produce them, he licked, nursed, and fondled them into stunted growth, and he sold them on long but profitable terms to small Irish, Jewish, Negro, Belgian, Italian and Greek labourers and tradesmen. And at the conclusion of a sale, or after receiving from one of these men the current payment, Uncle Bascom went homeward in a delirium of joy, shouting in a loud voice, to all who might be compelled to listen, the merits of the Jews, Belgians, Irish, Swiss or Greeks. \n \n “Finest people in the world! No question about it!”— this last being his favourite exclamation in all moments of payment or conviction. \n \n For when they paid he loved them. Often on Sundays they would come to pay him, tramping over the frozen ground or the packed snow through street after street of smutty grey-looking houses in the flat weary-looking suburb where he lived. To this dismal heath, therefore, they came, the swarthy children of a dozen races, clad in the hard and decent blacks in which the poor pay debts and go to funerals. They would advance across the barren lands, the harsh sere earth scarred with its wastes of rust and rubbish, going stolidly by below the blank board fences of a brick yard, crunching doggedly through the lanes of dirty rutted ice, passing before the grey besmutted fronts of wooden houses which in their stark, desolate, and unspeakable ugliness seemed to give a complete and final utterance to an architecture of weariness, sterility and horror, so overwhelming in its absolute desolation that it seemed as if the painful and indignant soul of man must sicken and die at length before it, stricken, stupefied, and strangled without a tongue to articulate the curse that once had blazed in him. \n \n And at length they would pause before the old man’s little house — one of a street of little houses which he had built there on the barren flatlands of the suburb, and to which he had given magnificently his own name — Pentland Heights — although the only eminence in all that flat and weary waste was an almost imperceptible rise a half-mile off. And here along this street which he had built, these little houses, warped yet strong and hardy, seemed to burrow down solidly like moles for warmth into the ugly stony earth on which they were built and to cower and huddle doggedly below the immense and terrible desolation of the northern sky, with its rimy sun-hazed lights, its fierce and cruel rags and stripes of wintry red, its raw and savage harshness. And then, gripping their greasy little wads of money, as if in the knowledge that all reward below these fierce and cruel skies must be wrenched painfully and minutely from a stony earth, they went in to pay him. He would come up to meet them from some lower cellar-depth, swearing, muttering, and banging doors; and he would come toward them howling greetings, buttoned to his chin in the frayed and faded sweater, gnarled, stooped and frosty-looking, clutching his great hands together at his waist. Then they would wait, stiffly, clumsily, fingering their hats, while with countless squints and grimaces and pursings of the lip, he scrawled out painfully their receipts — their fractional release from debt and labour, one more hard-won step toward the freedom of possession. \n \n At length, having pocketed their money and finished the transaction, he would not permit them to depart at once; he would howl urgently at them an invitation to stay, he would offer long weedy-looking cigars to them, and they would sit uncomfortably, crouching on their buttock bones like stalled oxen, at the edges of chairs, shyly and dumbly staring at him, while he howled question, comment, and enthusiastic tribute at them. \n \n “Why, my dear sir!” he would yell at Makropolos, the Greek. “You have a glorious past, a history of which any nation might well be proud!” \n \n “Sure, sure!” said Makropolos, nodding vigorously. “Beeg Heestory!” \n \n “The isles of Greece, the isles of Greece!” the old man howled, “where burning Sappho loved and sung —” (Phuh! phuh! phuh! phuh! phuh!) \n \n “Sure, sure!” said Makropolos again, nodding good-naturedly but wrinkling his lowering finger’s-breadth of brow in a somewhat puzzled fashion. “Tha’s right! You got it!” \n \n “Why, my dear sir!” Uncle Bascom cried. “It has been the ambition of my lifetime to visit those hallowed scenes, to stand at sunrise on the Acropolis, to explore the glory that was Greece, to see the magnificent ruins of the noblest of ancient civ-i-LIZ-ations!” \n \n For the first time a dark flush, a flush of outraged patriotism, began to burn upon the swarthy yellow of Mr. Makropolos’s cheek: his manner became heavy and animated, and in a moment he said with passionate conviction: \n \n “No, no, no! No ruin! Wat you t’ink, eh! Athens fine town! We got a million pipples dere!” He struggled for a word, then cupped his hairy paws indefinitely: “YOU know? BEEG! O, ni-ez!” he added greasily, with a smile. “Everyt’ing good! We got everyt’ing good dere as you got here! YOU know?” he said with a confiding and painful effort. “Everyt’ing ni-ez! Not old! No, no, no!” he cried with a rising and indignant vigour. “New! de same as here. Ni-ez! You get good and cheap — everyt’ing! Beeg place, new house, dumbwaiter, elevator — wat chew like! — oh, ni-ez!” he said earnestly. “Wat chew t’ink it cost, eh? Feefateen dollar a month! Sure, sure!” he nodded with a swarthy earnestness. “I wouldn’t keed you!” \n \n “Finest people on earth!” Uncle Bascom cried with an air of great conviction and satisfaction. “No question about it!”— and he would usher his visitor to the door, howling farewells into the terrible desolation of those savage skies. \n \n Meanwhile, Aunt Louise, although she had not heard a word of what was said, although she had listened to nothing except the periods of Uncle Bascom’s heavily accented and particular speech, kept up a constant snuffling laughter punctuated momently by faint whoops as she bent over her pots and pans in the kitchen, pausing from time to time as if to listen, and then snuffling to herself as she shook her head in pitying mirth which rose again up to the crisis of a faint crazy cackle as she scoured the pan; because, of course, during the forty-five years of her life with him she had gone thoroughly, imperceptibly, and completely mad, and no longer knew or cared to know whether these words had just been spoken or were the echoes of lost voices long ago. \n \n And again, she would pause to listen, with her small birdlike features uplifted gleefully in a kind of mad attentiveness as the door slammed and he stumped muttering back into the house, intent upon the secret designs of his own life, as remote and isolate from her as if they had each dwelt on separate planets, although the house they lived in was a small one. \n \n Such had been the history of the old man. His life had come up from the wilderness, the buried past, the lost America. The potent mystery of old events and moments had passed around him, and the magic light of dark time fell across him. \n \n Like all men in this land, he had been a wanderer, an exile on the immortal earth. Like all of us, he had no home. Wherever great wheels carried him was home. \n \n As the old man and his nephew talked together, Louise would prepare the meal in the kitchen, which gave on the living-room where they ate, by a swing door that she kept open, in order that she might hear what went on. And, while they waited, Uncle Bascom would talk to the boy on a vast range of subjects, dealing with that literature in which he had once been deep — the poetry of the Old Testament, the philosophy of Hegel, Carlyle, and Matthew Arnold, whom he worshipped, or some question in the daily papers. \n \n Uncle Bascom, seated, his fine gaunt face grave, magnificently composed now above his arched gnarled hands, spoke with eloquent deliberation. He became triumphant reasoning mind: he talked with superb balanced judgment. All the tumult and insanity of his life had been forgotten: no question of money or of self was involved. Meanwhile, from the kitchen Aunt Louise kept up a constant snuffling laughter, punctuated momently by faint whoops. She was convinced, of course, that her husband was mad and all his opinions nonsensical. Yet she had not listened to a word of what he was saying, but only to the sound of his heavily accented, precise, and particular speech. From time to time, snuffling to herself, she would look in on Eugene, trembling with laughter, and shake her head at him in pitying mirth. \n \n “BEYOND a doubt! Beyond a DOUBT!” Uncle Bascom would say. “The quality of the best writing in the books of the Old Testament may take rank with the best writing that has ever been done, but you are right in believing, too, the amount of great writing is less than it is commonly supposed to be. There are passages, nay! BOOKS”— his voice rising strangely to a husky howl —“of the vilest rubbish — Noah, Shem, Ham and Japheth — O vile! vile!” he cried. . . . “And Azariah begat Amariah and Amariah begat Ahitub (Phuh! Phuh! Phuh!). AHITUB!” he sneered. “And Azariah begat Seraiah, and Seraiah begat Jehozadak (Phuh! Phuh! Phuh!) JEHOZADAK”— he sneered with his precise articulation, finally letting out the last syllable with a kind of snarling contempt. “Can you IMAGINE, can you even DREAM,” he howled, “of calling anyone a name like that! ‘And Jehozadak went into captivity’— as, indeed, he ought! (phuh! phuh! phuh!)— his VERY name would constitute a PENAL offence! (Phuh! Phuh! Phuh!) JeHOZadak!” Uncle Bascom sneered. “But,” he proceeded deliberately in a moment, as he stared calmly over his great arched hands, “— but — the quality of some of the language is God-intoxicated: the noblest poetry ever chanted in the service of eternity.” \n \n “The Book of Wevelations,” cried Aunt Louise, suddenly rushing out of the kitchen with a carving-knife in her hand, having returned to earth for a moment to hear him. “The Book of Wevelations!” she said in a hoarse whisper, her mouth puckered with disgust. “EUGENE! A WICKED, bloo-o-edy, kwu-u-el monument to supahstition. Twibute to an avenging and MUH-DUH-WOUS GAWD!” The last word uttered in a hoarse almost inaudible whisper would find his aunt bent double, clutching a knife in one hand, with her small bright eyes glaring madly at us. \n \n “Oh no, my dear, oh no,” said Uncle Bascom, with astonishing, unaccustomed sadness, with almost exquisite gentleness. And, his vibrant passionate voice thrilling suddenly with emotion, he added: \n \n “The triumphant music of one of the mightiest of earth’s poets: the sublime utterance of a man for whom God had opened the mysteries of heaven and hell.” \n \n He paused a moment, then quietly in a remote voice — in that remote and magnificent voice which could thrill men so deeply when it uttered poetry, he continued: “‘I am Alpha and Omega, the first and the last, the beginning and the end’— the mightiest line, my dear boy, the most magnificent poetry, that was ever written.” And suddenly Uncle Bascom threw his gaunt hands before his face, and wept in strong hoarse sobs: “Oh, my God, my God! — the beauty, the pity of it all! . . . You must pardon me,” he whispered after a moment, drawing his faded sweater sleeve across his eyes. “You must pardon me. It brought back — memories.” \n \n Aunt Louise, who had been stricken with a kind of fear and horror when he began to weep, now looked at Eugene with an expression of strong physical disgust, almost of nausea, shaking her head slightly in an affronted and ladylike manner as might one who, having achieved healthy and courageous discipline over all the excesses of emotion, feels only contempt for him who gives way to them. \n \n She retired now with exaggerated dignity to the kitchen, served the meal, and addressed Eugene for some time thereafter with absurd quietness and restraint of manner, and a kind of stiff primness about her backbone. She was an excellent cook; there was magic in her treatment of food, and on the occasions when Eugene was coming out, she insisted that Bascom get her a decent piece of meat to work with. \n \n There would be a juicy fragrant piece of lamb, or a boiled leg of mutton with currant jelly, or perhaps a small crisply browned roast of beef, with small flaky biscuits, smoking hot, two or three vegetables, and rich coffee. Uncle Bascom, quite unperturbed by his outbreak, would stamp into the kitchen, where he could be heard swearing and muttering to himself, as he searched for various things. Later he would appear at the table bearing a platter filled with some revolting mess of his own concoction — a mixture of raw vegetables, chopped up — onions, carrots, beans, and raw potatoes — for he had the full strength of his family’s mania concerning food, violent prejudices about its preparation, and deep-seated distrust of everybody’s cleanliness but his own. \n \n “Have some, my boy. Have some!” he would yell huskily, seating himself and lunging toward Eugene with the awful mess, in a gesture of violent invitation. \n \n “Thank you, no.” Eugene would try to keep his eyes averted from the mess and focus on the good food heaping his plate. \n \n “You may eat that slop if you want to,” Uncle Bascom would exclaim with a scornful and sneering laugh. “It would give ME my death of dyspepsia.” And the silence of their eating would be broken by the recurrent snuffling whoops of Aunt Louise, accompanied by many pitying looks and head-shakes as she trembled with laughter and hid her mouth. \n \n Or, suddenly, in the full rich progress of the meal, Eugene would be shocked out of his pleasure in the food by the mad bright eyes of Aunt Louise bearing fiercely down upon him: \n \n “Eugene! — don’t bwood, boy! Don’t bwood! You’ve got it in you — it’s in the blood! You’re one of them. You’re one of THEM! — a PENTLAND,” she croaked fatally. \n \n “Ah-h — you DON’T know what you’re talking about”— thus suddenly in fierce distemper Uncle Bascom. “SCOTCH! SCOTCH-Irish! Finest people on earth! No question about it whatever.” \n \n “Fugitive ideation! Fugitive ideation!” she chattered like a monkey over a nut. “Mind goes off in all diwections. Can’t stick to anything five minutes at a time. The same thing that’s wong with the moduhn decadents. Wead Nordau’s book, Eugene. It will open yoah eyes,” and she whispered hoarsely again: “You’re OVAH-SEXED— ALL of you!” \n \n “Bosh! Bosh!” growled Uncle Bascom. “Some more of your psychology — the BASTARD of superstition and quackery: the black magic of little minds — the effort of a blind man (phuh! phuh! phuh!) crawling about in a dark room (phuh! phuh!) looking for a BLACK CAT (phuh! phuh!) that ISN’T THERE,” he yelled triumphantly, and closed his eyes and snarled and snuffled down his nose with laughter. \n \n He knew nothing about it: occasionally he still read Kant, and he could be as deep in absolute categories, moments of negation, and definitions of a concept as she with all of her complicated and extensive paraphernalia of phobias, complexes, fixations, and repressions. \n \n “Well, Eugene,” thus Aunt Louise with light raillery and yet with eager curiosity, “have you found you a nice wosy-cheeked New England gul yet? You had bettah watch OUT, boy! I tell you, you had bettah watch OUT!” she declared, kittenishly, wagging her finger at him, before he had time to answer. \n \n “If he has,” said Uncle Bascom grimly, “he will find her sadly lacking in the qualities of delicacy, breeding, and womanly decorum that the Southern girl has. Oh, yes! No question about that whatever!” for Uncle Bascom still had the passionate loyalty and sentimental affection for the South that many Southerners have who could not be induced, under any circumstances, to return. \n \n “Take a Nawthun gul, Eugene.” Aunt Louise became at once combative. “They’re bettah for you! They are BETTAH. They are BETTAH!” she declared, shaking her head in an obdurate manner, as if further argument was useless. “Moah independence! Bettah minds! They won’t choke yoah life out by hanging awound yoah neck,” she concluded crisply. \n \n “I will tell you a story,” Uncle Bascom continued deliberately as if she had not spoken, “that will illustrate admirably what I mean.” Here he cleared his throat, as if he were preparing to deliver a set speech, and began in a deliberate and formal tone: “Some years ago I had occasion to go to Portland, Maine, on business. When I arrived at the North Station I found a crowd waiting before the window: it was necessary for me to wait in line. I was carrying a small valise which I placed on the floor between my legs in order to get out the money for my ticket. At this moment the woman who stood behind me, apparently not given to noticing very well where she was going,” he snarled bitterly, “started to move forward and stubbed her toe against the valise. Before I had time to turn round and apologize”— he stopped abruptly, then, leaning forward with a horrible grimace, he tapped Eugene stiffly with his great bony fingers and continued in a lowered voice: “Say! Have you any idea what she did, my boy?” \n \n “No,” Eugene said. \n \n “Why, I give you my word, my boy,” he whispered solemnly, “without so much as ‘By your leave,’ she lifted her leg and KICKED me, KICKED me”— he howled —“in the STERN! And SHE, my boy, was a New England woman.” \n \n “Whoo-o-op!” Aunt Louise was off again, rocking back and forth, holding her napkin over her mouth. \n \n “Can you IMAGINE, can you DREAM,” said Bascom, his voice an intense whisper of disgust, “of a Southern lady, the flower of modesty and the old aristocracy, doing such a thing as that?” \n \n “Yes-s,” hissed Aunt Louise, her cackle subsiding, leaning intensely across the table and glaring at him, “and it SUHVED you wight! It SUHVED you wight! It SUHVED you wight! These things would nevah happen if you thought of any one’s convenience but yoah own. What WIGHT did you have to put yoah baggage there? What WIGHT?” \n \n “Ah,” he replied, with a kind of precise snarl, profoundly contemptuous of her opinion, “you-don’t-know-what-you’retalking-about! What RIGHT? she says — Why all the right in the world,” he yelled. “Have you ever read the conditions enumerated upon the back of railway tickets concerning the transportation of baggage?” \n \n “Suttinly not!” she retorted crisply. “One does not need to wead the backs of wailway tickets to learn how to behave like a civilized pusson!” \n \n “Well, I will tell them to you,” said Uncle Bascom, licking his lips, and with a look of joy upon his face. And, at great length, with infinite gusto, lip-pursing, and legal pedantry of elocution, he would enumerate them all. \n \n “And say, by the way, Eugene,” he would continue without a halt, “there is a very charming young lady who occasionally comes to my office (with her mother, of course) who is very anxious to meet you. She is a musician: she appears quite often in public. They live in Melrose, but they came, originally, I believe, from New Hampshire. Finest people in the world: no question about it,” his uncle said. \n \n And suddenly alert, scenting adventure and seduction, the young man got the address from him immediately. \n \n “Yes, my boy”— here Uncle Bascom fumbled through a mass of envelopes —“you may call her, without indiscretion, over the telephone at any time. I have spoken to her frequently about you: no doubt you’ll find much in common. Or, SAY!”— here a flash of inspiration aroused him to volcanic action —“I could call her now and let you talk to her.” And he plunged violently toward the telephone. \n \n “No, no, no, no, no!” Eugene sprang after him and checked him. For he wanted to make his own appointment luxuriously in private, sealed darkly in a telephone booth, craftily to feel his way, speculating on the curve of the unseen hip by the sound of the voice; probing, with the most delicate innuendo, the depth and richness of the promise. He loathed all family intercession and interference: they placed, he felt, at the outset, a crushing restraint upon the adventure from which it could never recover. \n \n “I had rather call her myself,” he added, “when I have more time. I don’t know when I could see her now: it might be awkward calling at just this time.” \n \n Later, while Uncle Bascom was poking furiously at the meagre coals of the tiny furnace in the cellar, setting up a clangorous and smoky din all through the house, Aunt Louise would bear down madly upon the boy, whispering: \n \n “Did you hear him! Did you hear him! Still mad about the women at his age! Can’t keep his hands off them! The lechewous old fool!” and she cackled bitterly. Then, with a fierce change: “He’s MAD about them, Eugene. He’s had one after anothah for the last twenty yeahs! He has spent FAW-CHUNS on them! Have you seen that gul in his office yet? The stenographer?” \n \n He had, and believed he had rarely seen a more solidly dull unattractive female than this pallid course-featured girl. But he only said: “Yes.” \n \n “He has spent thousands on her, Gene! THOUSANDS! The old fool! And all they do is laugh at him behind his back. Why, even at home heah,” her eyes darting madly about the place, “he can hardly keep his hands off me at times! I have to lock myself in my woom to secure pwotection,” and her bright old eyes muttered crazily about in her head. \n \n He thought these outbursts the result of frantic and extravagant jealousy: fruit of some passionate and submerged affection that his aunt still bore for her husband. This, perhaps, was true, but later he was to find there was a surprising modicum of fact in what she had said. \n \n During the wintry afternoon, he would sit and smoke one of his uncle’s corn-cob pipes, filling it with the coarse cheap powerful tobacco that lay, loosely spread, upon a bread-board in the kitchen. \n \n Meanwhile, his aunt, on these usual Sundays when she must remain at home, played entire operas from Wagner on her small victrola. \n \n Most of the records had been given her by her two daughters, and during the week the voices of the music afforded her the only companionship she had. The boy listened attentively to all she said about music, because he knew little about it, and had got from poetry the kind of joy that music seemed to give to others. Shifting the records quickly, his aunt would point out the melodramatic effervescence of the Italians, the metallic precision, the orderly profusion, the thrill, the vibration, the emptiness of French composition. She liked the Germans and the Russians. She liked what she called the “barbaric splendour” of Rimsky, but was too late, of course, either to have heard or to care much for the modern composers. \n \n She would play Wagner over and over again, lost in the enchanted forests of the music, her spirit wandering drunkenly down vast murky aisles of sound, through which the great hoarse throats of horns were baying faintly. And occasionally, on Sundays, on one of her infrequent excursions into the world, when her daughters bought her tickets for concerts at Symphony Hall — that great grey room lined on its sides with pallid plaster shells of Greece — she would sit perched high, a sparrow held by the hypnotic serpent’s eye of music — following each motif, hearing minutely each subtle entry of the mellow flutes, the horns, the spinal ecstasy of violins — until her lonely and desolate life was spun out of her into aerial fabrics of bright sound. \n \n During this time, Uncle Bascom, who also knew nothing about music, and cared so little for it that he treated his wife’s passion for it with contempt, would bury himself in the Sunday papers, or thumb deliberately through the pages of an ancient edition of the Encyclop?dia Britannica in search of arbitrament for some contested point. \n \n “Ah! Here we are, just as I thought,” he would declare suddenly, with triumphant satisfaction. “‘Upon the fifth, however, in spite of the heavy rains which had made of the roads quaking bogs, Jackson appeared suddenly from the South, at the head of an army of 33,000 men.’” \n \n Then they would wrangle furiously over the hour, the moment, the place of dead event: each rushing from the room fiercely to produce the document which would support his own contention. \n \n “Your aunt, my boy, is not the woman she once was,” Bascom would say regretfully during her absence. “No question about that! At one time she was a very remarkable woman! Yes, sir, a woman of very considerable intelligence — considerable, that is, for a woman,” he said, with a slight sneer. \n \n And she, whispering, when he had gone: “You have noticed, of course, Gene?” \n \n “What?” \n \n “His mind’s going,” she muttered. “What a head he had fifteen years ago! But NOW! — Senile decay — G. Stanley Hall — forgets everything —” she whispered hoarsely, as she heard his returning footfalls. \n \n Or, as the winter light darkened greyly, slashed on the western sky by fierce cold red, his uncle passed sheaf after sheaf of his verse to him, sniggering nosily, and prodding the boy with his great fingers, while his aunt cleared the table or listened to the music. The great majority of these verses, laboured and pedantic as they were, were variations of the motif of agnosticism, the horn on which his ministry in the Church had fatally gored itself — and still a brand that smouldered in his brain — not now so much from an all-mastering conviction, as from some desire to justify himself. These verses, which he asserted were modelled on those of his great hero, Matthew Arnold, were all remarkably like this one: \n MY CREED \n \n “Is there a land beyond the stars \n \n Where we may find eternal day, \n \n Life after death, peace after wars? \n \n Is there? I cannot say. \n \n Shall we find there a happier life, \n \n All joy that here we never know, \n \n Love in all things, an end of strife? \n \n Perhaps: it may be so.” \n \n And so on. \n \n And sniggering down his nose, Bascom would prod the young man stiffly with his great fingers, saying, as he slyly thrust another verse into his hand: \n \n “Something in a lighter vein, my boy. Just a little foolishness, you know. (Phuh! Phuh! Phuh! Phuh! Phuh)” Which was: \n \n “Mary had a little calf, \n \n It followed up her leg, \n \n And everywhere that Mary went, \n \n The boys were sure to beg.” \n \n And so on. \n \n Uncle Bascom had hundreds of them: Poems — Chiefly Religious, he sent occasionally to the morning papers. They were sometimes printed in the Editor’s Correspondence or The Open Forum. But Poems — Chiefly Profane he kept apparently for his own regalement. \n \n Then, as it darkened, toward five o’clock, the boy would depart, leaving them at times bitterly involved in a political wrangle, with the strewn Sunday numbers of The Boston Herald and The Boston Post around them, she parroting intensely the newspaper jargon, assaulting Borah and “the Senate iwweconcilables,” he angrily defending Senator Lodge as a scholar and a gentleman, with whom he had not always been in agreement, but from whom he had once received a most courteous letter — a fact which seemed to distinguish him in Bascom’s mind as the paragon of statesmanship. \n \n And as Eugene left, he would note, with a swift inchoate pang, the sudden mad loneliness in Aunt Louise’s eyes, doomed for another week to her grim imprisonment. But he did not know that her distended and exhausted heart hissed audibly each time she ascended from futile labour on the cold furnace, stoked with cheap slag and coke, and that her thin blood was fed by gristly butcher’s leavings, in answer to the doctor’s call for meat. \n \n And his aunt would go with Eugene to the frost-glazed door, open it, and stand huddled meagrely and hugging herself together beneath the savage desolation of the Northern cold; talking to him for a moment and calling brightly after him as he went down the icy path: “Come again, boy! Always glad to see you!” \n \n And in the dull cold Sunday light he strode away, his spirit braced by the biting air, the Northern cold, the ragged bloody sky, which was somehow prophetic to him of glorious fulfilment, and at the same time depressed by the grey enormous weight of Sunday tedium and dreariness all around him. \n \n And yet, he never lost heart that out of this dullness he would draw some rich adventure. He strode away with quickening pulse, hoping to see it issue from every warmly lighted house, to find it in the street cars, the subway or at a restaurant. Then he would go back into the city and dine at one of the restaurants where the pretty waitresses served him. Later he would go out on the sparsely peopled Sunday streets, turning finally, as a last resort, into Washington Street, where the moving-picture places and cheap vaudeville houses were filled with their Sunday Irish custom. \n \n Sometimes he went in, but as one weary act succeeded the other, and the empty brutal laughter of the people echoed in his ears, seeming to him forced and dishonest, as if people laughed at the ghosts of mirth, the rotten husks of stale wit, the sordidness, hopelessness, and sterility of their lives oppressed him hideously. On the stage he would see the comedian again display his red neck-tie with a leer, and hear the people laugh about it; he would hear again that someone was a big piece of cheese, and listen to them roar; he would observe again the pert and cheap young comedian with nothing to offer waste time portentously, talk in a low voice with the orchestra leader; and the only thing he liked would be the strength and balance of the acrobats. \n \n Finally, drowned in a sea-depth of grey horror, and with the weary brutal laughter of the audience ringing in his ears, he would rush out on the street again, filled with its hideous Sunday dullness and the sterile wink of the chop-suey signs, and take the train to Cambridge. \n \n And there, as the night grew late, his spirit would surge up in him; sunken in books at midnight, with the soft numb prescience of brooding snow upon the air, the feeling of exultancy, joy, and invincible strength would come back; and he was sure that the door would open for him, the magic word be spoken, and that he would make all of the glory, power, and beauty of the earth his own. \n \n \n","sourceLink":"http://novel.tingroom.com/kehuan/1137/33841.html","bookId":175,"book":{"id":175,"title":"Of Time and the River","description":"简介： 本书包括《晶体领域》、《投机》、《肺鱼》等多篇中短篇作品，其中《肺鱼》已翻译为中文，于《科幻世界》杂志2008年3月号刊载。The River of Time brings together eleven shortstories, including quot;The Crystal Spheresquot; (WINNER: HugoAward Best SF Short Sto...","cover":"http://novel.tingroom.com/file/upload/201410/14/14-00-13-96-1.gif","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1137","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
