{"id":5344,"no":45,"title":"Book iii Telemachus xliv","content":"When they got out into the street again, night had almost come. It was about six o’clock, the lights in the streets had gone on, and in the figures of the people that went by, and the motor cars that flashed past sparsely, there was something hurried, mournful, and departing, like the breath of autumn and old leaves stirred by wind and driven on. Neither spoke for some time, nor dared look at the other: the boy walked with lowered head, his hat pulled down across his eyes. His lips were puffed and swollen, and his left eye was now entirely closed, a blind poached swelling of bruised blue. They passed below a street lamp, paused for a minute in the hard white glare, turned as if impelled by sombre instinct, and regarded each other with the stern defenceless eye of shame and sorrow. Luke looked earnestly at his brother for a second and then said gently: “How’s your eye, Eugene?” The boy said nothing: sullenly, steadily, with his one good eye he returned his brother’s look. Luke stared for a minute at the nauseous, fatted purple where the bad eye was, suddenly cursed bitterly, turned, and walked ahead. “The d-d-dirty bastards!” he said. “I’ve always fought they were a f-f-fairly decent lot till now, but the nice, damned, d-d-d-dirty South Car’lina —” he ground his teeth together, paused again, and turned towards his younger brother: “What d-d-did they do to you while you were in there? I w-w-w-want to know what happened.” “I guess I got what was coming to me,” the boy muttered. “We were all drunk, and we were driving pretty fast. So I want you to know that I’m not making any excuses for that.” “Well,” Luke said quietly, “that’s all over now, and there’s no use to w-w-worry about it. I guess you’re not the f-f-f-first one that it’s happened to. So let’s f-f-forget about that.” He was silent for a moment, and then he went on sternly: “But if those b-b-bastards beat you up while you were in there I w-w-w-want to know about it.” “I’m not kicking about it,” the boy muttered again, because he was ashamed to tell him of the struggle he had had with the two policemen. “I guess I had it coming — but there was one thing!” he said with a surge of bitter feeling as he remembered it. “They did one thing I don’t believe they had any right to do. If it had happened in the North it would have been all right, but, by God, I don’t believe they have any right in this State to put a white man in the same cell with a nigger!” “Did they d-d-d-do that to you?” Luke cried in an excited voice, stopping short and half turning as he spoke. “Yes, they did, they tried to,” and then he told him what had happened. Luke turned completely, and started back towards the station, cursing bitterly. “C-c-come on!” he said. “Where are you going?” “I’m g-g-g-going down there and tell those b-b-b-bastards what I fink of them!” “No, you’re not! Listen!” Eugene seized his brother by the arm. “We’ll only get locked up again! They’ve got us and we’ve got to take it! We’re not going! Let’s get out of this damned town quick as we can! I never want to see the place again!” Luke paused and stood, distractedly thrusting his fingers through his hair. “All right,” he said at last. “We’ll go. . . . But by G-g-god,” his voice rose suddenly and he shook his fist in the direction of the station, “I’ll be back. I’ve done business in this town for years, I’ve got f-f-f-friends here who are going goddam well to know the reason why a kid is beaten up and locked up with a n-n-nigger by the Blackstone cops. I’ll see this f’ing through now if it t-t-t-takes a lifetime!” Then, turning to his brother, he said shortly: “All right, Gene. C-c-come on. We’re g-g-getting out of town.” Without further speech, they walked on down the street until they came to the place where Luke’s car was parked. “W-w-w-what do you want to d-d-d-do, Gene?” he said quietly. “Do you want to go over to D-d-Daisy’s tonight?” The boy shook his head: “No,” he said thickly. “Home. Home. Let’s get out of here. Got to go home now.” Luke said nothing for a moment, thrusting his fingers through his hair. “W-w-w-well,” he muttered at length, “perhaps you’re right.”","sourceLink":"http://novel.tingroom.com/kehuan/1137/33883.html","bookId":175,"book":{"id":175,"title":"Of Time and the River","description":"简介： 本书包括《晶体领域》、《投机》、《肺鱼》等多篇中短篇作品，其中《肺鱼》已翻译为中文，于《科幻世界》杂志2008年3月号刊载。The River of Time brings together eleven shortstories, including quot;The Crystal Spheresquot; (WINNER: HugoAward Best SF Short Sto...","cover":"http://novel.tingroom.com/file/upload/201410/14/14-00-13-96-1.gif","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1137","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
