{"id":5377,"no":78,"title":"Book v Jason’s Voyage lxxvii","content":"That was a fine life that he had that year. He lived in a little hotel in the Rue des Beaux–Arts. He had a good room there which cost him twelve francs a day. It was a good hotel, and was the place where Oscar Wilde had died. When anyone wanted to see the celebrated death-room, he would ask to see “la chambre de Monsieur Veeld,” and Monsieur Gely, the proprietor, or one of his buxom daughters, would willingly show it. At nine o’clock in the morning the maid would come in with chocolate or coffee, bread and jam and butter, which was included in the price of the room. She put it down on a little cabinet beside his bed, which had a door and a chamber pot inside. After she went out he would get up and move it to the table, and drink the chocolate and eat some bread and jam. Then he would go back to bed and sleep until noon and sometimes later: at one o’clock, Starwick and the two women would come to take him to lunch. If they did not come, they would send him a pneumatique telling him where to meet them. They went to a great many different places, but the lunch was always good. Sometimes they would send a pneumatique telling him to meet them at the Dome or the Rotonde. When he got there they would be sitting at a table on the terrace, and already very gay. Starwick would have a stack of saucers racked up before him on the table. On each saucer would be a numeral which said 3.50, or 5.00, or 6.00, or 7.50 francs, depending on what he had been drinking. Usually it was cognac, but sometimes Starwick would greet him with a burble of laughter, saying in his sensuous and voluptuous voice: “Did you ever drink Amer Picon?” “No,” he would say. “Well,” said Starwick. “You ought to try it. You really ought, you know.” And the soft burble would come welling up out of his throat again, and Elinor, looking at him tenderly, smiling, would say: “Francis! You idiot! Leave the child alone!” Then they would go to lunch. Sometimes they went to a place near by called Henriettes which Elinor had known about when she was an ambulance driver in the war. Again they would cross the river and eat at Prunier’s, Weber’s, the Café Régence, Fouquet’s, or at a place halfway up the hill in Montmartre, which was in a square called the Place des Martyrs, and which was called L’Ecrevisse, probably because of a little shell-fish which they sold there, and which was a specialty. That was a fine place: they always ate out on the terrace, where they could see everything that was going on in the little square, and Elinor, who had known the place for years, said how lovely it would be in spring. Often they would eat at little places, which were not very expensive and which Elinor also knew about. She knew about everything: there was nothing about Paris she did not know. Elinor did the talking, rattling off her French like a native — or, anyway, like a native of Boston who speaks French well — trippingly off the tongue, getting the same intonations and gestures the French got, when she argued with them, saying: “Mais non — mais non mais non mais non mais non mais non!” so rapidly that we could hardly follow her, and she could say: “Oui. C’est ?a! — Mais parfaitement! — Entendu! . . . Formidable!” etc., in the same way as a Frenchman could. Yet there was a trace of gaiety and humour in everything she said and did. She had “the light touch” about everything, and understood just how it was with the French. Her attitude toward them was very much the manner of a mature and sophisticated person with a race of clamouring children. She never grew tired of observing and pointing out their quaint and curious ways: if the jolly proprietor of a restaurant came to the table and proudly tried to speak to them his garbled English, she would shake her head sharply, with a little smile, biting her lower lip as she did so, and saying with a light and tender humour: “Oh, NICE! . . . He wants to speak his English! . . . ISN’T he a dear? . . . No, no,” she would say quickly if anyone attempted to answer him in French. “Please let him go ahead — poor dear! He’s so proud of it!” And again she would shake her head, biting her lower lip, with a tender, wondering little smile, as she said so, and “Yes!” Francis would say enthusiastically and with a look of direct, serious, and almost sorrowful earnestness. “And how GRAND the man is about it — how SIMPLE and GRAND in the way he does it! . . . Did you notice the way he used his hand? — I mean like someone in a painting by Cimabue — it really is, you know,” he said earnestly. “The centuries of living and tradition that have gone into a single gesture — and he’s quite unconscious of it. It’s grand — I mean like someone in a painting by Cimabue — it really is, you know,” he said with the sad, serious look of utter earnestness. “It’s really QUITE incredible.” “Quite,” said Elinor, who with a whimsical little smile had been looking at a waiter with sprouting moustaches, as he bent with prayerful reverence, stirring the ingredients in a salad bowl —“Oh, Francis, darling, look —” she whispered, nodding toward the man. “Don’t you LOVE it? . . . Don’t you simply ADORE the way they do it? . . . I MEAN, you know! Now where? Where?” she cried, with a gesture of complete surrender —“WHERE could you find anything like that in America? . . . I mean, you simply couldn’t find it — that’s all.” “QUITE!” said Francis concisely. And turning to Eugene, he would say with that impressive air of absolute sad earnestness, “And it’s really MOST important. It really is, you know. It’s astonishing to see what they can put into a single gesture. I mean — the Whole Thing’s there. It really is.” “Francis!” Elinor would say, looking at him with her gay and tender little smile, and biting her lip as she did so —“You KID, you! I MEAN! —” Suddenly she put her hand strongly before her eyes, bent her head, and was rigid in a moment of powerful and secret emotion. In a moment, however, she would look up, wet-eyed, suddenly thrust her arm across the table at Eugene, and putting her hand on his arm with a slight gallant movement, say quietly: “O, I’m sorry — you poor child! . . . After all, there’s no reason why you should have to go through all this. . . . I mean, darling,” she explained gently, “I have an adorable kid at home just four years old — sometimes something happens to make me think of him — you understand, don’t you?” “Yes,” he said. “Good,” she said briskly and decisively, with a swift and gallant smile, as she patted his arm again. “I knew you would!” She had left her husband and child in Boston, she had come here to join Francis, fatality was in the air, but she was always brave and gallant about it. As Francis would say to Eugene as they sat drinking alone in a café: “It’s MAD— Boston! . . . Perfectly MAD— Boston! . . . I mean, the kind of thing they do when they ride a horse up the steps of the State House. . . . I mean, perfectly GRAND, you know,” he cried with high enthusiasm. “They stop at nothing. It’s simply SWELL— it really is, you know.” Everyone was being very brave and gallant and stopping at nothing, and the French were charming, charming, and Paris gave them just the background that they needed. It was a fine life. Elinor took charge of everything. She took charge of the money, the making of plans, the driving of bargains with avaricious and shrewd-witted Frenchmen, and the ordering of food in restaurants. “It’s really astonishing, you know,” said Starwick —“the way she walks in everywhere and has the whole place at her feet in four minutes. . . . Really, Gene, you should have been with us this afternoon when she made arrangements with the man at the motor agency in the Champs–Elysées for renting the car. . . . Really, I felt quite sorry for him before the thing was over. . . . He kept casting those knowing and rather BITTER glances of reproach at me,” said Starwick, with his burble of soft laughter, “as if he thought I had betrayed him by not coming to his assistance. . . . There was something VERY cruel about it . . . like a great cat playing with a mouse . . . there really was, you know,” said Starwick earnestly. “She can be completely without pity when she gets that way,” he added. “She really can, you know . . . which makes it all the more astonishing — I mean, when you consider what she really is — the way she let me go to sleep on her shoulder the night we were coming back from Rheims, and I was so horribly drunk and got so disgustingly sick,” he said with a simple, touching earnestness. “I mean, the COMPASSION of it — it was QUITE like that Chinese goddess of the Infinite Compassion they have in Boston — it REALLY was, you know. It’s quite astonishing,” he said earnestly, “when you consider her background, the kind of people that she came from — it really IS, you know . . . she’s a grand person, simply terrific . . . it’s utterly MAD— Boston . . . it really is.” Certainly it was very pleasant to be in the hands of such a captain. Elinor got things done with a beautiful, serene assurance that made everything seem easy. There was no difficulty of custom or language, no weird mystery and complication of traffic, trade, and commerce, so maddening and incomprehensible to most Americans, that Elinor did not understand perfectly. Sometimes she would just shake her head and bite her lip, smiling. Sometimes she would laugh with rich astonishment, and say: “PERFECTLY insane, of course — but then, that’s the way the poor dears are, and you can’t change them. . . . I KNOW! I KNOW! . . . It’s quite incredible, but they’ll ALWAYS be that way, and we’ve simply got to make the best of it.” She was a heavily built woman about thirty years old who seemed older than she was. She dressed very plainly and wore a rather old hat with a cockade, which gave her a look of eighteenth-century gallantry. And the impression of maturity was increased by her heavy and unyouthful figure, and the strong authority of her face which, in spite of her good-humoured, gay, and whimsical smile, her light Bostonian air of raillery, indicated the controlled tension and restraint of nerves of a person of stubborn and resolute will who is resolved always to act with aristocratic grace and courage. In spite of her heavy figure, her rough and rather unhealthy-looking skin, she was a distinguished-looking woman, and in her smile, her tone, her play of wit, and even in the swift spitefulness and violence which could flash out and strike and be gone before its victim had a chance to retort or defend himself, she was thoroughly feminine. And yet the woman made no appeal at all to sensual desire: although she had left her husband and child to follow Starwick to France, and was thought by her own family to have become his mistress, it was impossible to imagine her in such a r?le. And for this reason, perhaps, there was something ugly, dark, and sinister in their relation, which Eugene felt strongly but could not define. He felt that Elinor was lacking in the attraction or desire of the sensual woman as Starwick seemed to be lacking in the lust of the sensual man, and there was therefore something in their relation that came from the dark, the murky swamp-fires of emotion, something poisonous, perverse and evil, and full of death. Just the same, it was fine to be with Elinor when she was gay and deft and charming, and enormously assured, and taking charge of things. At these times everything in life seemed simple, smooth, and easy; there were no dreary complications, the whole world became an enormous oyster ready to be opened, Paris an enormous treasure-hoard of unceasing pleasure and delight. It was good to be with her in a restaurant and to let her do the ordering. “Now, children,” she would say in her crisp, gay, and yet authoritative tone, staring at the menu with a little frowning smile of studious yet whimsical concentration —“The rest of you can order what you like, but Mother’s going to start with fish and a bottle of Vouvray — I seem to remember that it’s very good here — Le Vouvray est bon ici, n’est-ce pas?” she said turning to the waiter. “Mais oui, madame!” he said with just the right kind of earnest enthusiasm, “c’est une spécialité.” “Bon,” she said crisply. “Alors, une bouteille du Vouvray pour commencer — does that go for the rest of you, mes enfants?” she said, looking around her. They nodded their agreement. “Bon — bon, madame,” the waiter said, nodding his vigorous approval, as he put the order down. “Vous serez bien content avec le Vouvray — et puis?”— He looked at her with suave respectful inquiry. “Pour manger?” “Pour moi,” said Elinor, “le poisson — le filet de sole — n’est-ce pas — Marguery?” “Bon, bon,” he said with enthusiastic approval, writing it down. “Un filet de sole — Marguery — pour madame — et pour monsieur?” he said turning suavely to Eugene. “La même chose,” said that linguist recklessly and even as the waiter was nodding enthusiastically, and saying: “Bon. Bon — parfaitement! La même chose pour monsieur,” and writing it down, the others had begun to laugh at him. Starwick with his bubbling laugh, Elinor with her gay little smile of raillery and even Ann, the dark and sullen beauty of her face suddenly luminous with a short and almost angry laugh as she said: “He hasn’t said his other word yet — why don’t you tell him that you want some ‘mawndiawnts’\"— ironically she imitated his pronunciation of the word. “What’s wrong with ‘mendiants’?” he said, scowling at her. “What’s the joke?” “Nothing,” said Starwick, bubbling with laughter. “They’re very good. They really are, you know,” he said earnestly. “Only we’ve been wondering if you wouldn’t learn another word some day and order something else.” “I know lots of other words,” he said angrily. “Only, how am I ever going to get a chance to use them when the rest of you make fun of me every time I open my mouth? — I don’t see what the great joke is,” he said resentfully. “These French people understand what I want to say,” he said. “Ecoute, gar?on,” he said appealingly to the attentive and smiling waiter. —“Vous pouvez comprendre —” “Cawmprawndre,” said Ann mockingly. “Vous pouvez comprendre — ce-que-je-veux-dire,” he blundered on painfully. “Mais oui, monsieur!” the waiter cried with a beautiful reassuring smile. “Parfaitement. Vous parlez très bien. Vous êtes ici à Paris depuis longtemps?” “Depuis six semaines,” he said proudly. The waiter lifted arms and eyebrows eloquent with astounded disbelief. “Mais c’est merveilleux!” the waiter cried, and as the others jeered Eugene said with bitter sarcasm: “Everyone can’t be a fine old French scholar the way you are; after all, I’m not travelled like the rest of you — I’ve never had your opportunities. And even after six weeks here there are still a few words in the French language that I don’t know. . . . But I’m going to speak the ones I do know,” he said defiantly, “and no one’s going to stop me.” “Of course you are, darling!” Elinor said quickly and smoothly, putting her hand out on his arm with a swift movement. “Don’t let them tease you! . . . I think it’s mean of you,” she said reproachfully. “Let the poor dear speak his French if he wants to — I think it’s sweet.” He looked at her with a flushed and angry face while Starwick bubbled with laughter, tried to think of something to say in reply, but, as always, she was too quick for him, and before he could think of something apt and telling, she had flashed off as light and quick as a rapier blade: “— Now, children,” she was studying the card again —“what shall it be after the fish — who wants meat —?”— “No fish for me,” said Ann, looking sullenly at the menu. “I’ll take —” suddenly her dark, sullen, and nobly beautiful face was transfigured by her short and almost angry laugh again —“I’ll take an ‘awmlet,’” she said sarcastically, looking at Eugene. “Well, take your ‘awmlet,’” he muttered. “Only I don’t say it that way.” “Pas de poisson,” she said quietly to the waiter. “I want an omelette.” “Bon, bon,” he nodded vigorously and wrote. “Une omelette pour madame. Et puis après —?” he said inquiringly. “Rien,” she said. He looked slightly surprised and hurt, but in a moment, turning to Eugene, said: “Et pour monsieur? — Après le poisson?” “Donnez-moi un Chateaubriand garni,” he said. And again Ann, whose head had been turned sullenly down towards the card, looked up suddenly and laughed, with that short and almost angry laugh that seemed to illuminate with accumulating but instant radiance all of the dark and noble beauty of her face. “God!” she said. “I knew it! — If it’s not mendiants, it’s Chateaubriand garni.” “Don’t forget the Nuits St. Georges,” said Starwick with his bubbling laugh, “that’s still to come.” “When he gets through,” she said, “there won’t be a steak or raisin left in France.” And she looked at Eugene for a moment, her face of noble and tender beauty transfigured by its radiant smile. But almost immediately, she dropped her head again in its customary expression that was heavy and almost sullen, and that suggested something dumb, furious, and silent locked up in her, for which she could find no release. He looked at her for a moment with scowling, half-resentful eyes, and all of a sudden, flesh, blood, and brain, and heart, and spirit, his life went numb with love for her. “And now, my children,” Elinor was saying gaily, as she looked at the menu —“what kind of salad is it going —“she looked up swiftly and caught Starwick’s eye, and instantly their gaze turned upon their two companions. The young woman was still staring down with her sullen, dark, and dumbly silent look, and the boy was devouring her with a look from which the world was lost, and which had no place in it for time or memory. Dark Helen in my heart for ever burning. “L’écrevisse,” Eugene said, staring at the menu. “What does that mean, Elinor?” “Well, darling, I’ll tell you,” she said with a grave light gaiety of tone. “An écrevisse is a kind of crayfish they have over here — a delicious little crab — but MUCH, MUCH better than anything we have.” “Then the name of the place really means The Crab?” he asked. “STOP him!” she shrieked faintly. “You barbarian, you!” she went on with mild reproach. “It’s not at ALL the same.” “It’s really not, you know,” said Starwick, turning to him seriously. “The whole quality of the thing is different. It really is. . . . Isn’t it astonishing,” he went on with an air of quiet frankness, “the genius they have for names? I mean, even in the simplest words they manage to get the whole spirit of the race. I mean, this square here, even,” he gestured briefly, “La Place des Martyrs. The whole thing’s there. It’s really quite incredible, when you think of it,” he said somewhat mysteriously. “It really is.” “Quite!” said Elinor. “And, oh, my children, if it were only spring and I could take you down the Seine to an adorable place called La Pêche Miraculeuse.” “What does that mean, Elinor?” Eugene asked again. “Well, darling,” she said with an air of patient resignation, “if you MUST have a translation I suppose you’d call it The Miraculous Catch — a fishing catch, you know. Only it DOESN’T mean that. It would be sacrilege to call it that. It means La Pêche Miraculeuse and nothing else — it’s QUITE untranslatable — it really is.” “YES,” cried Starwick enthusiastically, “and even their simplest names — their names of streets and towns and places: L’Etoile, for example — how grand and simple that is!” he said quietly, “and how perfect — the whole design and spatial grandeur of the thing is in it,” he concluded earnestly. “It really is, you know.” “Oh, absolutely!” Elinor agreed. “You couldn’t call it The Star, you know. That means nothing. But L’Etoile is perfect — it simply COULDN’T be anything else.” “QUITE!” Starwick said concisely, and then, turning to Eugene with his air of sad instructive earnestness, he continued: “— And that woman at Le Jockey Club last night — the one who sang the songs — you know?” he said with grave malicious inquiry, his voice trembling a little and his face flushing as he spoke —“the one you kept wanting to find out about — what she was saying? —” Quiet ruddy laughter shook him. “PERFECTLY vile, of course!” cried Elinor with gay horror. “And all the time, poor dear, he kept wanting to know what it meant. . . . I was going to throw something at you if you kept on — if I’d had to translate THAT I think I should simply have passed out on the spot —” “I know,” said Starwick, burbling with laughter —“I caught the look in your eye — it was really QUITE murderous! And TERRIBLY amusing!” he added. Turning to his friend, he went on seriously: “But really, Gene, it IS rather stupid to keep asking for the meaning of everything. It IS, you know. And it’s so extraordinary,” he said protestingly, “that a person of your quality — your KIND of understanding — should be so dull about it! It really is.” “Why?” the other said bluntly, and rather sullenly. “What’s wrong with wanting to find out what’s being said when you don’t understand the language? If I don’t ask, how am I going to find out?” “But not at ALL!” Starwick protested impatiently. “That’s not the point at all: you can find out nothing that way. Really you can’t,” he said reproachfully. “The whole point about that song last night was not the words — the meaning of the thing. If you tried to translate it into English, you’d lose the spirit of the whole thing. Don’t you see,” he went on earnestly, “— it’s not the MEANING of the thing — you can’t translate a thing like that, you really can’t — if you tried to translate it, you’d have nothing but a filthy and disgusting jingle —” “But so long as it’s French it’s beautiful?” the other said sarcastically. “But QUITE!” said Starwick impatiently. “And it’s very stupid of you not to understand that, Gene. It really is. The whole spirit and quality of the thing are SO French — so UTTERLY French!” he said in a high and rather womanish tone —“that the moment you translate it you lose everything. . . . There’s nothing disgusting about the song in French — the words mean nothing, you pay no attention to the words; the extraordinary thing is that you forget the words. . . . It’s the whole design of the thing, the TONE, the QUALITY. . . . In a way,” he added deeply, “the thing has an ENORMOUS innocence — it really has, you know. . . . And it’s so disappointing that you fail to see this. . . . Really, Gene, these questions you keep asking about names and meanings are becoming tiresome. They really are. . . . And all these books you keep buying and trying to translate with the help of a dictionary . . . as if you’re ever going to understand anything — I mean, REALLY understand,” he said profoundly, “in that way.” “You may get to understand the language that way,” the other said. “But not at ALL!” cried Starwick. “That’s just the point — you really find out nothing: you miss the whole spirit of the thing — just as you missed the spirit of that song, and just as you missed the point when you asked Elinor to translate La Pêche Miraculeuse for you. . . . It’s extraordinary that you fail to see this. . . . The next thing you know,” he concluded sarcastically, a burble of malicious laughter appearing as he spoke, “you will have enrolled for a course of lessons —” he choked suddenly, his ruddy face flushing deeply with his merriment —“for a course of lectures at the Berlitz language school.” “Oh, but he’s entirely capable of it!” cried Elinor, with gay conviction. “I wouldn’t put it past him for a moment. . . . My DEAR,” she said drolly, turning toward him, “I have never known such a glutton for knowledge. It’s simply amazing. . . . Why, the child wants to know the meaning of everything!” she said with an astonished look about her —“the confidence he has in my knowledge is rather touching — it really is — and I’m so unworthy of it, darling,” she said, a trifle maliciously. “I don’t deserve it at all!” “I’m sorry if I’ve bored you with a lot of questions, Elinor,” he said. “But you HAVEN’T!” she protested. “Darling, you HAVEN’T for a moment! I LOVE to answer them! It’s only that I feel SO— so INCOMPETENT. . . . But listen, Gene,” she went on coaxingly, “couldn’t you try to forget it for a while — just sort of forget all about these words and meanings and enter into the spirit of the thing? . . . Couldn’t you, dear?” she said gently, and even as he looked at her with a flushed face, unable to find a ready answer to her deft irony, she put her hand out swiftly, patted him on the arm, and nodding her head with an air of swift satisfied finality, said: “Good! I knew you would! . . . He’s really a darling when he wants to be, isn’t he?” Starwick burbled with malicious laughter at sight of Eugene’s glowering and resentful face; then went on seriously: “— But their genius for names is quite astonishing! — I mean, even in the names of their towns you get the whole thing. . . . What could be more like Paris,” he said quietly, “than the name of Paris? . . . The whole quality of the place is in the name. Or Dijon, for example. Or Rheims. Or Carcassonne. The whole spirit of Provence is in the word: what name could more perfectly express Aries than the name it has — it gives you the whole place, its life, its people, its peculiar fragrance. . . . And how different we are from them in that respect. . . . I mean,” his voice rose on a note of passionate conviction, “you could almost say that the whole difference between us — the thing we lack, the thing they have — the whole thing that is wrong with us, is evident in our names. . . . It really is, you know,” he said earnestly, turning toward his friend again. “The whole thing’s most important. . . . How harsh and meaningless most names in America are, Eugene,” he went on quietly. “Like addresses printed on a thousand envelopes at once by a stamping machine — labels by which a place may be identified but without meaning. . . . Tell me,” he said quietly, after a brief pause, “what was the name of that little village your father came from? You told me one time — I remember, because the whole thing I’m talking about — the thing that’s wrong with us — was in that name. What was it?” “Brant’s Mill,” the other young man answered. “Quite!” said Starwick with weary concision. “A man named Brant had a mill, and so they called the place Brant’s Mill.” “What’s wrong with that?” “Oh, nothing, I suppose,” said Starwick quietly. “The whole thing’s quite perfect. . . . BRANT’S Mill,” there was a note of bitterness in his voice and he made the name almost deliberately rasping as he pronounced it. “It’s a name — something to call a place by — if you write it on a letter it will get there. . . . I suppose that’s what a name is for. . . . Gettysburg — I suppose a man named Gettys had a house or a farm, and so they named the town after him. . . . And your mother? What was the name of the place she came from?” “It was a place called Yancey County.” “Quite,” said Starwick as before —“and the name of the town?” “There wasn’t any town, Frank. It was a kind of cross-roads settlement called The Forks of Ivy.” “No!” Elinor’s light Bostonian accent of astounded merriment rang gaily forth. “Not REALLY! You KNOW it wasn’t!” “But not at ALL!” said Starwick in a tone of mild and serious disagreement. “The Forks of Ivy is not bad. It’s really surprisingly good, when you consider most of the other names. It even has,” he paused, and considered carefully, “a kind of quality. . . . But Yancey,” he paused again, the burble of sudden laughter came welling up, and for a moment his pleasant ruddy face was flushed with laughter —“YA-A-ANCEY County”— with deliberate malice he brought the word out in a rasping countrified tone —“God!” he said frankly, turning to the other boy, “isn’t it awful! . . . How harsh! How stupid! How banal! . . . And what are some of the names, where you come from, Gene?” he went on quietly after a brief pause. “I’m sure you haven’t yet done your worst,” he said. “There must be others just as sweet as Ya-a-ancey.” “Well, yes,” the boy said grinning, “we’ve got some good ones: there’s Sandy Mush, and Hooper’s Bald, and Little Hominy. And we have names like Beaverdam and Balsam, and Chimney Rock and Craggy and Pisgah and The Rat. We have names like Old Fort, Hickory, and Bryson City; we have Clingman’s Dome and Little Switzerland; we have Paint Rock and Saluda Mountain and the Frying Pan Gap —” “Stop!” shrieked Elinor, covering her ears with her shocked fingers —“The Frying Pan Gap! Oh, but that’s HORRIBLE!” “But how perfect!” Starwick quietly replied. “The whole thing’s there. And in the great and noble region where I come from —” the note of weary bitterness in his tone grew deeper —“out where the tall caw-r-n grows we have Keokuk and Cairo and Peoria.” He paused, his grave eyes fixed in a serious and reflective stare: for a moment his pleasant ruddy face was contorted by the old bestial grimace of anguish and confusion. When he spoke again, his voice was weary with a quiet bitterness of scorn. “I was born,” he said, “in the great and noble town of Bloomington, but —” the note of savage irony deepened —“at a very tender age I was taken to Moline. And now, thank God, I am in Paris”; he was silent a moment longer, and then continued in a quiet and almost lifeless tone: “Paris, Dijon, Provence, Aries . . . Yancey, Brant’s Mill, Bloomington.” He turned his quiet eyes upon the other boy. “You see what I mean, don’t you? The whole thing’s there.” “Yes,” the boy replied, “I guess you’re right.”","sourceLink":"http://novel.tingroom.com/kehuan/1137/33929.html","bookId":175,"book":{"id":175,"title":"Of Time and the River","description":"简介： 本书包括《晶体领域》、《投机》、《肺鱼》等多篇中短篇作品，其中《肺鱼》已翻译为中文，于《科幻世界》杂志2008年3月号刊载。The River of Time brings together eleven shortstories, including quot;The Crystal Spheresquot; (WINNER: HugoAward Best SF Short Sto...","cover":"http://novel.tingroom.com/file/upload/201410/14/14-00-13-96-1.gif","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1137","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
