{"id":5391,"no":92,"title":"xci","content":"Full dark had come — the wintry darkness of a grey wet day in early March — before he got to Orléans. The train was of the variety known in France as omnibus, one of those dingy little locals that are made up of third-class compartments and that stop at every country station. As the train neared Orléans there was a noticeable increase in the travelling public: at every station there was a noisy traffic of arriving and departing passengers. For the most part the people had the look of the country: they came stamping in and out with muddy shoes, with a great banging of compartment doors, with a great tumult of voices, with the vigorous excitement of robust and talkative people. \\n\\n \\n\\n They were a good-natured crowd, and seemed to know one another, if not actually by name, with the even completer familiarity of race and kind and region. At the sudden pauses at dim-lit country stations one could hear them shouting greetings and farewells, and see them streaming away along a muddy road towards the dim light and shine of a little town with all the utter, common, and dreary familiarity of March. And the train, in those abrupt and sudden halts and pauses, seemed to be almost as casual a means of transportation as a street-car: it would rattle up to a station halt, the people would stamp in and out with a banging of doors and with many shouts, cries, greetings, and farewells, then the shrill little whistle would make its fifing note and the train would rattle out into the wet and wintry countryside again. \\n\\n \\n\\n In the compartments the lights were very low and dim, and cast flickering shadows on the faces of the passengers. Somewhere in the train, in another compartment, there was a noisy and jolly crowd of soldiers and robust country people. One man in particular dominated the whole train with his jolly energy, his vulgar and high-spirited good nature. The man’s rich voice was charged indescribably with the high, sanguinary vitality of the Frenchman. The voice, to a foreigner, was at once inimitably strange in accent, quality and intonation, and yet familiar as all life, all living. It was packed with the juice of life, and had the full rich qualities of a good wine. \\n\\n \\n\\n For the youth, that voice heard there in the flickering shadows of the little train, heard with all its robust and full-blooded penetration at the casual and abrupt halts and pauses at little stations, was to be a strangely haunting one. A thousand times thereafter the tone of that rich voice would return to him and reverberate in his memory with the haunting, strange and wonderful recurrence with which the “little” things of life — a face seen one time at a window, a voice that passed in darkness and was gone, the twisting of a leaf upon a bough — come back to us out of all the violence and savage chaos of the days — the “little” things that persist so strangely, vividly, and inexplicably when the more sensational and “important” events of life have been forgotten or obscured. \\n\\n \\n\\n So, now, the jolly voice of this unseen Frenchman, as it shouted out good-natured but derisive comments on the customs, the appearance, and the inhabitants of every little town at which they stopped, as it was answered in like fashion by the people on the station platforms, brought back to him instantly the memory of a little country town in the South at which, on his way to and from college, he had stopped a dozen times at just this hour. The name of the town was Creasman, there was a small sectarian school there which was known as Creasman College, and it had become traditional with the university students, who crowded the train on their journeys home or back to college, to thrust their heads out of the windows and howl with the derisive arrogance of youth: “Whoopee, girls! Creasman College!” \\n\\n \\n\\n And this sally was usually answered by similar jibes and jeers from the group of students, townsfolk and country people who crowded the platform of the station “to see the train come through.” \\n\\n \\n\\n In this Frenchman’s taunts and jeers, and in the way the people at the stations answered him, as well as in all the traffic of noisy, muddy, talking and gesticulating people who streamed in and out of the train at every halt, there was, in spite of all the local differences, the same essential quality that had characterized the halts at the little town set there upon the vast, raw Piedmont of the South. \\n\\n \\n\\n Moreover, there was in the tone and texture of the Frenchman’s voice — at once so actual, living, and familiar in its high, sanguinary energy, and so foreign, alien, and troubling to a stranger’s ear — the whole warmth and vitality of centuries of living, a quality which brought the ancient past of Europe, and of France, to life, as the pages of history could never do. \\n\\n \\n\\n In the same way the boy had long ago discovered that a single tone or shading in his mother’s or his father’s voice could touch the lost past of America — the past of the Civil War, the strange mysteries of Garfield, Arthur, Harrison, and Hayes, which is, for most Americans, more far and strange in time than the Crusades — and bring it instantly into life. \\n\\n \\n\\n Thus he had never gained a living image of the Civil War until he heard his mother speak of it one day. Until that time all his efforts to recapture that lost time out of the pages of books had been futile; the men, the battles, the generals, and the lives of all the people existed in a world of legendary unreality, and seemed, in fact, as different from the world he knew as if they had existed on a separate planet. And then one day he heard his mother — who had been only five years old when the war ended — describe the return of the troops along a country road near home. She told how the dust rose from the ragged feet of weary marching men and of how she sat upon her father’s shoulder as the troops went by, and of all her friends and kinsmen who were standing near her, and of the return of a cousin — a boy of sixteen years — starved, ragged, wearing a stove-pipe hat, and without shoes, of how the women wept and of the boy’s words of jesting and good-natured greeting, as he came to meet them. \\n\\n \\n\\n Now, with the full rich accents of this unseen Frenchman, at once so strange and so familiar, all of the ancient life of France — her wars and histories, the great chronicles of her battles, and the brilliant and indestructible fabric of her life and energy through so many hundred years of victory and defeat, triumph and catastrophe — began to pulse with such a living and familiar warmth that it seemed to him as if the whole thing from the beginning had been compacted and resumed into the rich and sanguinary energies of this one Frenchman’s voice. \\n\\n \\n\\n The man’s speech, a kind of furious and high-spirited repartee, carried on against all comers with an instant’s readiness, an animal vigour, that was almost like a national intoxication, was penetrated constantly by the exclamation “Parbleu!” \\n\\n \\n\\n And more than anything else, it seemed to the youth, it was the tone and quality of that ancient exclamation, delivered with such a buoyant and animal vitality, that united the Frenchman to the distant past of his nation’s history, to millions of buried and forgotten lives, and through him, made that distant past blaze instantly with all the warmth and radiance of life again. \\n\\n \\n\\n The Frenchman’s speech was lewd and ribald with the open and robust vulgarity of healthy country people; his broad jests were published without affectation in a tone loud enough for all the world to hear, and it was evident from the roars of hearty, sensual laughter with which his remarks were received by the soldiers, provincials, and strapping peasant women who were with him, that his audience was not a squeamish one. \\n\\n \\n\\n The chief target for this robust fellow’s humour, to which he loudly returned with unwearied pertinacity, was that unfortunate man, the station-master, whose calling, for some reason, is provocative of unlimited mirth in France. Now, at every station, the Frenchman would publish to the world, amid roars of laughter, his narration of the station-master’s unhappy lot. In particular, he sang snatches of a ribald song entitled “Il est cocu le chef de gare”— which described movingly the trials of a station-master’s life, the cuckoldries to which the nature of the work exposes him, the conduct of his wife when he is away from home dispatching trains. And the Frenchman would garnish this ditty with certain pointed speculations of his own, directed at the station-master of each town, concerning the probable whereabouts, at that moment, of the station-master’s wife. \\n\\n \\n\\n Sometimes the answer to this ribald banter would be curses, oaths and maddened imprecations from the station-master; sometimes the answer would be a good-natured one, as rough and ready in its coarse spontaneity as the Frenchman’s own, but whatever the result, the Frenchman was always ready with a reply. \\n\\n \\n\\n “Are you speaking from your own experience?” one of the station-masters yelled ironically. “Is that the way your old woman behaves when you leave home?” \\n\\n \\n\\n “Parbleu! Oui!” the Frenchman roared back cheerfully. “Why not? The meat is all the sweeter for a little extra seasoning.” \\n\\n \\n\\n This sally was rewarded by a scream of delighted laughter from the peasant women, and the jester, thus encouraged, continued: \\n\\n \\n\\n “Parbleu! Do you think I’d play the miser with the old girl, when I’ve had so much myself? But, no, my friend! What the devil! My old girl’s no rare canary who’ll fade away the first time that you look at her. The devil, no! There’s good stuff there, sound and solid as an ox, old boy, and lots more where the last batch came from!” \\n\\n \\n\\n At this delicate sally there were roars and screams of delighted laughter from the peasant women in the train, and when the commotion had somewhat subsided, one could hear the voice of the station-master from the platform, yelling back ironically: \\n\\n \\n\\n “Good! Since there’s enough for everyone, I’ll come round to get my share!” \\n\\n \\n\\n “Parbleu! Why not?” the high, sanguinary voice responded instantly. “Turn about’s fair play, as the saying goes — I’ve played the cock to many a station-master’s hen —” \\n\\n \\n\\n Roars of laughter. \\n\\n \\n\\n “And I’d be the last fellow in the world to begrudge him now —” he would conclude triumphantly, and the train would move off to the accompaniment of roars of laughter, ribaldry, and lusty and derisive banter, above which the high, rich energy of the Frenchman’s voice, crying out — “Parbleu! Oui! Why not?” was always dominant. \\n\\n \\n\\n He left the train at one of the little stations near Orléans, departing amid a rough but good-natured chorus of jeers, jibes, and derisive yells which followed him as he walked away along the platform, and to all of which he instantly responded with his ribald vitality of coarse humour, that in its lusty ebullience was somehow like the intoxication of a sound, rich wine. \\n\\n \\n\\n The boy saw him for an instant as he passed by the window of the compartment. He was a strong, stocky figure of a man, wearing leggings, with blue eyes, a brown moustache, and a solid face full of dark, rich colour. But even after he had disappeared from sight, the boy could hear him shouting to the other people, the sanguinary vitality of his instant, ribald —“Parbleu! Why not?”— a tone, a voice, a word that had evoked the past of France, in all the living textures of her earth and blood, and that, in future years, would bring this scene to life again — all of the faces, voices, lives of these people — as no other single thing could do. \\n\\n \\n\\n At one of the little stations near Orléans a girl opened the door and climbed up into the compartment, which was already crowded. The country people, however, made room for her, crowding a little closer together on the wooden bench, and telling her to wedge herself in, with the rough but good-natured familiarity that characterized their conduct towards one another. \\n\\n \\n\\n The girl sat down opposite the boy, beside the window, and put the market basket which she was carrying on her knees. She was cleanly but plainly dressed, a very lovely and seductive girl with a slender figure which seemed, however, already to have attained a languorous and sensual maturity. She was wearing a broad-brimmed hat of blue that shaded her face, from which her eyes looked out with a luminous, troubling, and enigmatic clarity. She said nothing, but sat silently listening to the rude jovialities of the peasant people around her and to the ribald shouts and yells and roars of laughter that came from the nearby compartment. \\n\\n \\n\\n All the time, the girl gazed directly at the young man, her lovely face traced faintly with a tender, enigmatic smile. It seemed certain to him that if he spoke to her she would not rebuff him. The sensation of an impossible good fortune, of some vague and unutterable happiness that was impending for him in this strange and unknown town, returned. Desire, slow, sultry, began to beat, throbbing in his pulses and through the conduits of his blood. He felt certain that the girl would not rebuff him if he spoke to her. And yet he did not speak. \\n\\n \\n\\n And presently the little train came puffing in to Orléans, all of the people got out and streamed away towards the station along the platform. He took the girl’s basket and helped her down out of the train, and with the old bewildered indecision in his heart stood there looking after her as she walked away from him with a graceful, slow, and sensual stride in which every movement that she made seemed to imply reluctance to depart, an invitation to follow. And he looked after her numbly, with hot desire pounding slow and thick in pulse and blood. And he told himself, as he had told himself so many times before, that he would certainly find her again, knowing in his heart he never would. \\n\\n \\n\\n Already the girl had been lost among the crowds of people streaming through the station, engulfed again in the everlasting web and weaving of this great earth, to leave him with a memory of another of those brief and final meetings, so poignant with their wordless ache of loss and of regret, in which, perhaps more than in the grander, longer meetings of our life, man’s bitter destiny of days, his fatal brevity, are apparent. \\n\\n \\n\\n And again the boy found himself walking along the platform towards the station after the departing people, whom he had met so briefly and now lost for ever. Again he had sought the mysterious promises of a new land, new earth, and a shining city. Again he had come to a strange place, not knowing why he had come. \\n\\n \\n\\n Why here? \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/kehuan/1137/33999.html","bookId":175,"book":{"id":175,"title":"Of Time and the River","description":"简介： 本书包括《晶体领域》、《投机》、《肺鱼》等多篇中短篇作品，其中《肺鱼》已翻译为中文，于《科幻世界》杂志2008年3月号刊载。The River of Time brings together eleven shortstories, including quot;The Crystal Spheresquot; (WINNER: HugoAward Best SF Short Sto...","cover":"http://novel.tingroom.com/file/upload/201410/14/14-00-13-96-1.gif","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1137","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
