{"id":5395,"no":96,"title":"xcv","content":"The village of Mornaye was a small and ancient settlement, similar to thousands of others, situated near the gate of the chateau from which it got its name. A man was waiting for them at the station with a motor car: they got in and were driven swiftly through the town — a dense cluster of old grey-lemon buildings with tiled roofs, a thatched one here and there, the shops of the village grocer, cobbler, baker, visible through small dormer windows, some farm buildings, a fleeting glimpse of the old cobbled court yard of a barn, some wagons and farm implements — a little universe of life, compact, unbroken, built up to the edge of the road — and then, almost immediately, the gates of the chateau. \\n\\n \\n\\n They drove through the gates and down a long and stately avenue of noble trees, and presently came to a halt before the great entrance of the chateau. As they approached, a footman came swiftly down the steps, opened the door of the car, and bowed, and in another moment, led by the man, they had entered the hall and were being escorted into the great salon where their hostess was awaiting them. \\n\\n \\n\\n La Marquise de Mornaye was a woman of about sixty, but from the energy and vigour of her appearance she seemed to be in the very prime of life. She was an extraordinary figure of a woman, as tall and strong-looking as a man, with a personal quality that was almost mountainously impressive in its command. The image of the boy’s recent discontent had so shaped the French as a dark and swarthy people of mean stature that it was now startling to be confronted by a woman of this grand proportion. \\n\\n \\n\\n She had a wide, round face, smooth, brown and unwrinkled, such as one often finds in peasant people; her eyes were round, bright, and shrewd, webbed minutely by fine wrinkles at the corners. She had strong, coarse hair of grey, brushed vigorously back from a wide, low forehead. She was big in foot and limb and body, everything about the woman was strong, large and vigorous except her hands. And her hands were plump, white, tiny, as useless-looking as a baby’s, shockingly disproportionate to the power and vigour of the rest of her big frame. \\n\\n \\n\\n The woman had on a long, brown dress that completely covered her from neck to toe: it was a strangely old-fashioned garment — or, rather, it did not seem to have any fashion or style whatsoever — but it was, nevertheless, a magnificent garment, in its plain and homely strength perfectly appropriate to the extraordinary woman who wore it. \\n\\n \\n\\n In every respect — in word, tone, gesture, look, and act — the woman showed a plain, forceful, and immensely able character. Her strong, brown face was friendly, yet shrewd and knowing; she greeted the Countess cordially, but it was evident from the humour in her round, bright eyes that she was no fool in the ways of the world and perfectly able to hold her own in any worldly encounter. \\n\\n \\n\\n She was waiting for them, erect and smiling, as they entered the great salon, a magnificent room at least forty feet in length, warmly, luxuriously, yet plainly furnished, and with nothing cold or repellent in its grand proportions. She greeted the Countess immediately and cordially, extending her plump little white hand in a friendly greeting, and bending and kissing the little wren-like woman on her withered cheek. La Marquise, in deference to her young American guest, spoke English from the beginning. And her English, like everything else about her, was plain, forceful, and direct, completely fluent, although marked with a heavy accent. \\n\\n \\n\\n “‘Ow are you, my dear?” La Marquise said, as she kissed the other woman on the cheek. “It is good to see you again after these so many years. ‘Ow long ‘as it been since you were last at Mornaye?” \\n\\n \\n\\n “Almost seven years, Marquise,” the Countess answered eagerly. “The last time — do you remember? — was in the spring of 1918.” \\n\\n \\n\\n “Ah, yes,” the other answered benevolently. “Now I can remember. You were here when many of our so brave Américains were quartered here at Mornaye — Monsieur,” she said, using this reference as an introduction, and turning to the boy with her plump little hand extended in a movement of kindly greeting, “I am delighted. I meck apologies for my son. I know he will so much regret not seeing you.” \\n\\n \\n\\n He flushed, and stammered out his thanks: she seemed to take no notice of his embarrassment and, having completed her friendly welcome, she turned smilingly to the Countess again, and said: \\n\\n \\n\\n “And ‘ow ‘ave you been, my dear? You are looking very well,” she said approvingly, “and no older dan you were de lest time you were here. I s’ink,” she said smilingly, including the young man now in her friendly humour —“I s’ink la Comtesse must ‘ave discover — wat you call it, eh?” she shrugged —“ze se-CRET of ze fountain of yout’, eh?” \\n\\n \\n\\n “Ah, Marquise,” the Countess fawned greedily upon the grand woman, obviously elated by these signs of intimacy —“ah — hah — hah! it is so kind of you to say so — but I fear I have grown much older since I saw you last. I have known great trouble,” she said sadly, “and, as you know, Marquise, my health has not been good.” \\n\\n \\n\\n “Non?” the other said with an air of solicitous inquiry. “I am so sor-REE,” she continued in a tone of unimpeachable regret, which nevertheless showed that the Countess’s health or lack of it was really of no moment to her whatever. “Perhaps, my dear, it is ze wretchet cleemat here. I s’ink perhaps you should go Sout’ in vintaire — ah, monsieur,” she continued regretfully, turning to the youth, “you see Mornaye at a bat season of ze year — I fear you may be disappointed by our coun-TREE. I ‘ope you vill come beck some time in sprink. Zen, I s’ink you vill agree la France is beautiful.” \\n\\n \\n\\n “I should like to,” he replied. \\n\\n \\n\\n “But oh, zis vintaire! Zis VINTAIRE!” La Marquise cried with passionate distaste, folding her arms and drawing herself together in a movement of chilled ardour as she looked through a tall French door across one of those magnificent and opulent vistas that one finds in France, an architecture of proud, comely space into whose proportionate dimensions even nature herself has been compelled. It was a tremendous sweep of velvet sward, that faded into misty distances and that was cut cleanly on each side by the smoky denseness of her forest parks. Her shrewd eyes ranged across this noble prospect for a moment in an expression of chilled distaste. Then, with a slight contracted shudder of her folded arms, she turned, and said wearily: \\n\\n \\n\\n “Ah, zis vintaire! Zis VINTAIRE! Sometimes I s’ink it vill nevaire end. Every day,” she went on indignantly, “it rain, rain, rain! All vintaire lonk I see noz-ZING but rain! I get up in ze mornink and look out — and it rain! I turn my beck and zen look out again — it rain! I take a nep, I get up, I go to bet — always it rain!” She shrugged her shoulders comically and turning to the boy with a glint of shrewdly cynical humour, she said, “I s’ink if it keep on ve ‘ave again — vat you call it? — Noah’s Floot, eh?” \\n\\n \\n\\n The Countess clucked sympathetically at this watery chronicle of woe, and said: \\n\\n \\n\\n “But have you been here by yourself all winter? I should think you would get awfully lonely, my dear,” she went on in a tone of ingratiating commiseration. “I know how you must miss your son.” \\n\\n \\n\\n “No. I vas in Paris for two veeks in Decembaire,” said La Marquise. “But it rain zere too,” she said, with another shrug of comic despair, and then added vigorously, “No! I do not get lonely if it do not rain. But ven it rains — zen it is tereeble. . . . Come,” she said brusquely, almost curtly, turning away from the grey prospect through the window, “let us seet here vere eet ees varm.” Still clasping her arms across her breast, she led them towards a coal fire which was crackling cheerfully in a hearth at one end of the great room; they seated themselves comfortably around the fire, La Marquise rang a bell, and spoke a few words to a butler, and presently he returned, bringing glasses and a decanter of old sherry on a tray. \\n\\n \\n\\n They sat talking amiably then of many things. La Marquise questioned the boy about America, his stay in France, the places he had seen, referred regretfully again to the absence of her son and of the great friendship he cherished for America and Americans as a result of his travels there with Marshal Foch. And from time to time, the Countess, with a cunning that was comically na?ve in its barefaced self-exposure, would prod him with a skinny finger, and whisper hoarsely: \\n\\n \\n\\n “Ask her some questions, my dear. You should ask her more questions and write more in your little book. It will make a good impression.” \\n\\n \\n\\n And although he saw from the glint of shrewd humour in the sharp eyes of La Marquise that none of this clumsy by-play had been lost on her, and that the other woman’s design was perfectly apparent to her, he responded dutifully, if awkwardly, asking respectful questions about the age and history of the chateau, the extent of its estate, and so on. At length, emboldened by the modest success of these beginnings and feeling that a clever young journalist should display an intelligent curiosity about the current affairs of the nation to which he is a visitor, he asked a question about the government of the period, of which Herriot was the leader and which was dominantly socialist. \\n\\n \\n\\n It was, he saw, an unfortunate move; the Countess poked him sharply with a warning finger, but it was too late. He saw instantly that his question had produced a bad impression on La Marquise: for the first time, her manner of amiable and cordial friendliness vanished, her face hardened, there was an angry glint in her shrewd eyes, and in a moment she said harshly, and in a tone of arrogant impatience: \\n\\n \\n\\n “I know nozzing about zose pipple! I pay no attention to anys’ing zey say! Zey are fools! fools!” she cried violently. “You must not believe anys’ing zey say! Zose men are traitors! . . . Charlatans! . . . Zey are ze pipple who have ruined and betrayed France!” In her agitation she got up and walked across the room. “Here!” she cried, picking up a newspaper on a table and returning with it. “Here is what you should reat if you want ze trut!” She thrust a copy of L’Action Fran?aise into his hands. “Zat paper — and zat alone — will tell you ze trut about ze way s’ings are in France today. Ah, monsieur!” she cried earnestly, “you do not know — ze world does not know — no one outside of France can know ze trut, because zese wretched men control ze press — and make it print vatever lies zey tell it to. But you reat ZIS, monsieur — you reat ZIS,” she struck the paper with the back of her hand as she spoke, “and you will get ze trut! Ah, zat man!” she said with a grim chuckle of admiration. “Ze rédacteur — ze — vat you say? — ze EDITOR of zat paper, Léon Daudet — ah, zat man is RIGHT!” she said with a chuckle of satisfaction. “Zat man is sometimes coarse — he call zem bat names — he is not always très gentil — but,” again she chuckled grimly, “he iss RIGHT! He tells ze trut — he calls zem vat zey are — ze traitors and creemiNALS who ‘ave ruined France.” She was silent for a moment, and then in a voice harsh with passion, she said violently: “La France, monsieur, is a royaume — a — vat you call it? — a monarchy — a kinkdom. Ze French people must have a kink — zey are lost vitout a kink — zey cannot govern zemselves vitout a kink! . . . Zere can be no France, monsieur, vitout a kink!” she almost shouted. “Zere has been no France since ze monarchy vas destroyed by zese scélérats who ‘ave betrayed La France — zere vill never be a France until ze kink is restored to his rightful office and zese creeminals and traitors ‘ave been sent to ze guillotine vere zey belonk. . . . So do not ask me anys’ink about zese men, monsieur,” she said with arrogant passion. “I know nozzing about zem. I pay no attention to zem! Zey are fools . . . traitors . . . creeminals,” she shouted. “You reat zat paper, you vill get ze trut.” \\n\\n \\n\\n She was breathing hoarsely and her eyes glinted with hard fires of passion. At this moment, fortunately, the butler entered, bowed, and, speaking in a quiet voice, informed his mistress that luncheon was served. The words recalled the angry woman to her duties as a hostess: with an almost comical suddenness she assumed her former manner of gracious cordiality, smiled amiably at her guests, and saying with benevolent good-nature, “After our lonk journey and our so much talk, ve are ‘ongry — yes?” led the way into the dining-room. \\n\\n \\n\\n As they went in, the little old Countess nudged her young companion again with a stealthy warning, and whispered with nervous reproach: \\n\\n \\n\\n “You should not have asked her that, my dear. Please do not say anything more to her about the government.” \\n\\n \\n\\n The dining-room of the chateau was another magnificent chamber, like everything else about the chateau, nobly harmonious with those elements of strength and grace, splendour and simplicity, warmth and delicacy, united with princely dignity, which are the triumphs of this period of French architecture. In spite of the chill air of the room — for it was poorly heated — one felt its living and noble warmth immediately. \\n\\n \\n\\n The boy, who had looked forward to this meeting with considerable awe and apprehension, now felt himself completely at home, stirred by a profound, tranquil and lovely joy at the noble beauty and simplicity of the chateau. Even in the sense of retrenchment, the worn uniforms of the servants, the knowledge that they served their mistress in various offices, there was something pleasant, homely, and familiar; he discovered, to his surprise, that he now felt none of the constraint and uneasiness which he experienced when Joel Pierce had taken him to his great estate upon the Hudson River and he had for the first time seen the lives of the great American millionaires. \\n\\n \\n\\n With La Marquise de Mornaye he was not conscious of that exactly mannered style — most mannered in its very affectation of simplicity — that vulgar arrogance which he had felt among the rich Americans of Joel Pierce’s class. La Marquise was plain as an old shoe, vigorous and lusty as a peasant, and completely an aristocrat — magnificently herself, without an ounce of affectation — a woman Joel Pierce’s people would have fawned upon and to whom they would have given a king’s ransom if by so doing they could have bought for son or daughter an alliance with her family. \\n\\n \\n\\n La Marquise seated him beside her, the Countess opposite her, and at once they began to eat. The food was magnificent, there was a different wine of royal vintage (brought up from the famous cellar of the chateau) with every course. La Marquise left no doubt at all about the robust nature of her appetite, and by everything she did and was — the plain shrewdness, warmth, and sensible humanity of her nature — she made it plain that she expected her guests to eat heartily also, and not to be too nice and dainty about it either. \\n\\n \\n\\n “Ven vun is younk as you are,” she said, turning with a smile to her young guest, “he is ‘ongry often — non?” she inquired. She put her soup-spoon to her mouth, swallowed some soup, and smacking her lips with an air of relish, turned to the youth again, and said plainly and positively: \\n\\n \\n\\n “Eet ees good! Oui! I s’ink you will like it, too.” Turning to the Countess, who had tasted nothing, she said severely: \\n\\n \\n\\n “Vy do you vait, my dear? Are you not ‘ongry? You must eat.” \\n\\n \\n\\n “Ah — hah — hah!” the Countess said with a little undecided laugh, her eyes greedily fixed upon the smoking soup. “— You know, my dear, I am on a diet by the doctor’s orders — sang de cheval, you know,” she chattered in a distracted tone as her greedy eyes went ravenously along the table —“I eat almost nothing — really, my dear, I don’t think I should.” She snatched up a piece of bread in one greedy little claw, broke it with an appetizing crackle, and began to cram it into her mouth like a starved animal —“Ah — hah — hah!” The poor starved old woman laughed with almost hysterical delight, and tried to speak with a mouth full of bread —“I know I shouldn’t — but you always have such delicious food, my dear.” She lifted the soup-spoon, and drew in with a long slobbering suction. “Ah, mon Dieu! mon Dieu!” she gurgled rapturously —“quel potage!” \\n\\n \\n\\n And so the meal progressed. With such a lusty trencher-woman as La Marquise beside one, it was not hard to follow suit; they polished off the soup, which was a delicious, savoury, peasant-like brew, in record time, and, as if their hunger mounted from the delicious food it fed on, they turned then to the chicken. The chicken, which was almost all fat and juicy breast, was so young, crisp, tender, plump and succulent that it seemed almost to melt in the mouth, the boy took two or three rhapsodic swallows and the chicken was gone, at which La Marquise, lifting her voice over his feeble and half-hearted protests, said to the butler: “Encore du poulet pour Monsieur.” \\n\\n \\n\\n A second chicken, even plumper, crisper and more tender than the first, was instantly provided, after which the roast and vegetables were served. He had never tasted better food in his life — everything, haricots, peas, beef, seemed to melt like an ambrosial ether the moment that he put it in his mouth; there was a new wine with every course, each wine rarer, older, richer and more delicious than the last, the butler kept filling up their glasses, and he kept drinking the grand wine until heart, mind, and soul, and every conduit of his life seemed infused by its glorious warmth and fragrance. They talked little as they ate: for some time there were no sounds except the crisp crackle of the bread, the ring of heavy silver, the sound of wine gulped down, the delicate chime of glasses, and the low, quiet orders of the butler speaking to his helper, as swiftly, expertly, and noiselessly they moved round the table, seeming to be there at one’s elbow and to read the gastronomic hopes and wishes of each guest before he had time to open his mouth and utter them. \\n\\n \\n\\n La Marquise ate with robust concentration, putting down her knife from time to time to pick up her wine-glass and take a generous swallow, after which she would put the glass down and wipe a napkin deliberately across her mouth and pause, for a moment, breathing a little heavily, with an air of hearty satisfaction. \\n\\n \\n\\n As for the Countess, she ate like a famished wolf: where the movements of La Marquise were hearty and deliberate, those of the Countess were almost frantically swift and eager. Her sharp and greedy little eyes glittered with an almost delirious joy, she would seize a glass of wine and drain it in one greedy gulp; at times she was so excited by the variety and abundance of the dishes that she seemed unable to decide what to reach for next. She reached out greedily in all directions, her eyes darting avaricious glances to and fro; chicken, meat, vegetables, salad, wine disappeared as if by magic, and were replenished, and all the time the poor old woman chuckled craftily to herself and muttered to herself in broken monologue: \\n\\n \\n\\n “Ah — hah — hah!”— crunch, crunch, crunch! And away went the chicken. “Mon Dieu! — but it’s good! — Ah — hah — hah!” gulp, gulp, gulp! down would go the wine. “Mon Dieu! mon Dieu! Such food! Such wine! — Mais oui! Mais oui! . . . Un peu encore, s’il vous pla?t! Quel boeuf! Quel boeuf!” \\n\\n \\n\\n At which La Marquise would put down her glass, wipe her mouth, look across the table at the Countess, and say: \\n\\n \\n\\n “‘Ow you like, eh? Good? Mais oui! Il faut manger,” she said coarsely, and applied herself again to knife and fork. \\n\\n \\n\\n By the time they got down to the cheese — which was a ripe, delicious Brie — La Marquise de Mornaye was at last fortified for conversation. Putting down her empty wine-glass with a deliberate movement, she straightened in her chair, wiped her mouth, sat upright for a moment in an attitude of solid satisfaction, and then, turning to her American guest, said: \\n\\n \\n\\n “Do you know PatterSON T. Jones — eh? ‘E is an officer — a vat you call it? — a major in ze Américain army.” She pronounced these words with an air of na?ve confidence, as if Patterson T. Jones must be a name instantly familiar to every American. When the boy told her, however, that he did not know Major Patterson T. Jones and confessed, further, that he had never heard of him, La Marquise looked slightly astonished and disappointed; and in a moment, her shrewd eyes narrowing slightly as she spoke, she said rather grimly: \\n\\n \\n\\n “I should like verree verree motch to see zat gentleman again. I should like verree verree motch to know vere he now iss. . . . Attendez!” she said sharply, as inspiration struck her. “Perhaps if I show you this — vat you say? — his photographie — you will know ze man. . . . Guillaume!” she raised her voice a little in command. “Apportez-moi les photographies des officiers américains.” \\n\\n \\n\\n “Oui, madame,” the butler answered, and went swiftly and silently out of the room. \\n\\n \\n\\n “Yes,” La Marquise continued with an air of grim meditation, “I should verree verree motch like to know vere Major PatterSON T. Jones iss to be found.” \\n\\n \\n\\n The butler returned with several large square photographs, bowed, and gave them to his mistress. \\n\\n \\n\\n “‘Ere, you see,” she said, taking one of them and pointing with her finger, “zis vas taken here — in zis verree room at a great banQUET vitch I have made for ze Américains in 1918. Zis,” she said proudly, and pointing with a plump white finger —“zis is me — c’est moi, La Marquise!” she cried in a jolly tone, and laughed with satisfaction as she pointed to her own beaming likeness at the head of a long table, sumptuously adorned with fine silver, china, linen, and a forest thicket of dark, crusty-looking bottles of old wine — obviously the relics of a memorable feast. “And zis,” La Marquise said more grimly, pointing again with her plump white finger, “zis is Major PatterSON T. Jones — You know him, eh?” she said. \\n\\n \\n\\n The boy looked at the picture for a moment and then handed it back to La Marquise, telling her that he did not recognize the face of Patterson T. Jones. \\n\\n \\n\\n “PatterSON T. Jones,” La Marquise answered, slowly, and with an air of grim deliberation, “is a gentleman I vant verree verree motch to see. Zat is ze man,” she said, “who took my picture — who told me he vould get for me, oh! soch huge soms of mon-nee if he could teck my picture to America,” she laughed ironically —“and so I let him teck ze picture, and I have heard nozzing from him since.” \\n\\n \\n\\n “Was — was it your own picture, Marquise? A portrait of yourself?” \\n\\n \\n\\n “Mais non, mon ami,” she said impatiently. “Dat’s vat I tell you — eet vas a picture, a photographie of Le Maréchal. Zere was only seex sotch pictures of Le Maréchal in existence — I say to Madame Foch vun time ven I am at Paris — I see ze picture in her house — I say —‘Oh, my dear, zat so lovely picture of Le Maréchal — I must have vun for myself,’ I say. ‘Ah,’ she say, ‘I do not know, Mathilde — he do not like to give away zese pictures — I have only t’ree,’ she say, ‘but vait. I see vat I can do —’ Zen, vun night I go to dinnaire at zere house. ‘Mathilde,’ he say, ‘for vat you vant my picture? I give it to you,’ he say, ‘and zen all ze ozzer girls vill vant vun, too. I meck my vife jalouse, and zen zere is no peace. I have enough of var,’ he say. ‘I am too old to start anozzer vit my vife!” ‘You give to me zat picture,’ I say. ‘I am no young leddy in ze chorus,’ I say, ‘to meck your vife jalouse. She vant you to give it to me, too.’ ‘Bon,’ he say. ‘Here it is, zen.’ . . . And he give to me ze so beautiful photographie vit his name below written out to me: ‘To Mathilde, old comrade, fet’ful friend’— I bring ze picture beck ven I come beck to Mornaye,” La Marquise continued, “and Major ParterSON T. Jones he see it ven he iss here. ‘How motch you vant for zat picture of Le Maréchal?’ he say. ‘Oh,’ I say, ‘I cannot say. Already I have an offer of ten s’ousand francs,’ I say, ‘but I vould not sell it because ze Maréchal himself, he give to me.’ ‘Vell,’ say Major PatterSON T. Jones, ‘you lett me teck zat picture vit me ven I go beck to America, and I sell it for you.’ ‘How motch you get for me, eh?” I ask him. ‘Oh,’ he say, ‘I get twent’ s’ousand francs for you — mebbe more.’ ‘You sure?’ I say. ‘Mais oui!’ say Major PatterSON T. Jones. ‘Absolument’—‘All right,’ I say. ‘I give to you. If you get twenty s’ousand francs I give you five,’ I say. And so he teck my picture and he go avay, and since den,” La Marquise bitterly concluded, “I nevaire hear from him.” \\n\\n \\n\\n “Ah!” the Countess cried indignantly. “Le scélérat!” \\n\\n \\n\\n “Mais oui!” the other woman now said passionately. “It is infame! Zis man have my picture, I have nozzing — Ze lest time Madame Foch is here, she look around, she say, ‘But vere, my dear — vere iss ze picture zat Le Maréchal give you? I do not see it,’ she say. What can I do?” La Marquise went on in a despairing tone. “I cannot say to her, ‘I lose it!’ I cannot say to her, ‘I give it avay to an Américain who sell it for me.’ I don’t know vat to say. All I can say is, ‘I leave it, my dear, in Paris vit my son Paul ven I vas zere. He have it, but ze next time zat he come to Mornaye he vill bring it.’ But ven she come again, vat story can I tell her zen?” La Marquise demanded. “Ah! Zat scélérat! Zat PatterSON T. Jones! If ever I get my fingers on zat gentleman I s’ink he vill remember me!” she said, with a glint in her eye and a grim note in her voice that left no doubt of her intention —“But is it not infame, monsieur,” she said with a virtuous indignation that was now ludicrous after her na?ve exposure of her own avarice and greed — “is it not infame zat somevun teck avay a picture zat a friend give to you — and promise you motch monnee for it — and zen to hear from him no more? Scélérat! T’ief!” she muttered. “I like to get my hands on him! — But now, monsieur,” she said, turning to him abruptly, with a smile of winning ingratiation, “I meck a leetle speech to you. You are — la Comtesse tells me — a younk journalist — eh?” \\n\\n \\n\\n “Well, Marquise,” he flushed, and began to blunder out an explanation —“I can’t exactly say —” \\n\\n \\n\\n “Mais oui!” the Countess swiftly interposed. “He has written many clever articles — pour les grands journaux américains, n’est-ce pas — la tête, vous voyez?” she whispered craftily, bending over the table and nodding towards him as she spoke —“C’est très intelligent, n’est-ce pas?” \\n\\n \\n\\n “Et pour Le Times?” La Marquise demanded. “Il écrit tout ?a pour Le New York Times?” \\n\\n \\n\\n “Mais oui,” the Countess said glibly, before he could object. “Il est déjà bien connu. Moi, j’ai lu beaucoup de choses de sa main —” \\n\\n \\n\\n “Now, look here,” he began, glaring angrily across the table at the lying old woman. “You have no right —” \\n\\n \\n\\n “Ah, oui!” La Marquise broke in, with a vigorous nod of satisfaction, after a brief inspection of him. “C’est très évident! Il est intelligent! Bon!” she said decisively, and turned to him with the air of a person whose mind is made up and whose course of action determined —“Now, monsieur,” she said, “I tell you vat I have in mind. I have beeg ‘ospital — non?” she said, smiling a little at his puzzled look. “I am-vat you call it? — le présiDENT— le directeur, n’est-ce pas? — of beeg ‘ospital in de Nort’— ve have zere ze soldats, n’est-ce pas — ze oh so many blessés — les pauvres!” she said in a tone of pity —“les mutilés de la guerre. . . . Ve have old building — eet ees no good, eet ees not beeg enough — not MODERNE— and so,” she added simply, “ve build anozzer — beeg, moderne — and”— the conclusion of the matter —“ve need monnee.” She was silent for a moment, beaming hopefully at him. “Monsieur,” she said presently, in an ingratiating tone, and with an air of na?ve confidence that was astounding —“I s’ink ven I tell you vat ve need —‘ow much monnee,” her voice sank craftily, “you vill get for us — eh?” \\n\\n \\n\\n He stared at her for a moment with a bewildered face, unable to reply. \\n\\n \\n\\n “But how,” he stammered at length —“how do you think — what do you think I can do?” he said bluntly. \\n\\n \\n\\n “Ah!” La Marquise cried triumphantly. “C’est facile!” Again her voice became low, confiding, crafty. “You are a journalist — eh? You write for ze grand journal américain — ze New York Times — yes? . . . Vell, I tell you vat to say,” she went on placidly. “You write ze article for ze Times — you spick of zis beeg ‘ospiTAL— you tell of ze grand vork of restauration — you tell of ze poor soldats — les blessés — les mutilés — you say La France have nozzing — zey have no monnee — ze poor pipples ‘ave lose everys’ink — you say, ve ‘ave so motch — ze rich Américains — ve must not let zis great vork die — ve must help ze poor soldats — ve must give ze monnee for ze ‘ospital. . . . You see — I show you,” she cried with a confident chuckle —“if you like I write eet out myself — and zen all you have to do is meck — vat do you say? — la traduction.” \\n\\n \\n\\n “How — how much do you want?” \\n\\n \\n\\n “Un million de francs,” she said, dismissing this bagatelle airily. “— For ze Américains vat ees dat? Pouf! Nozzing! Mais pour les Fran?ais — ah!” she said sadly, “for ze French eet ees too motch. Un millionaire américain — he see your story — he say, ‘Ve cannot let zis grand vork die’— he write vun cheque out for ze whole amount — and zen,” her smile of satisfaction deepened, “he send to me, eh? — He meck out cheque to Marquise — he never miss eet — and he send to me.” For a moment she was silent, smiling triumphantly at him. When she spoke again, she bent towards him, her voice became low, confiding, craftily conspiratorial —“And I tell you vat I do. . . . You write ze piece and get for me ze monnee . . . and I give you a fourt’— twanty-five per cent — non?” \\n\\n \\n\\n In a moment, as he continued to stare at her with an expression of gape-mouthed astonishment, she straightened, with an air of satisfied finality, nodded her head, and then said with businesslike decision: \\n\\n \\n\\n “Bon. Eet ees settled zen.” She rose decisively from the table, and her guests followed her —“You come vit me,” she said, as she led the way out of the dining-room, “and I give you — vat you say? — ze fects.” \\n\\n \\n\\n She was already gone, before he could blurt out a few words of bewildered protest; the Countess was at his side, prodding him sharply with a skinny finger and muttering in a tone of reproachful entreaty: \\n\\n \\n\\n “Go on, my dear! Go on! And you should ask more questions! Don’t sit there saying nothing. It will make a good impression. And use your little book more often,” the Countess whispered cunningly. “You should write more in it when she speaks to you.” \\n\\n \\n\\n “Now you see here,” he burst out furiously, “I’m not going to write down anything. I’m tired of this foolishness — I’m not going to be a party any longer to your damned schemes or for this woman’s either. I’m going to tell her once and for all that I’ll write no article — not for The Times nor any place else!” \\n\\n \\n\\n “Oh, my boy,” the old woman whispered imploringly. “You wouldn’t do that! Please don’t say a thing like that, I beg of you! . . . Think what it means to me,” she whispered —“I am so poor, so miserable — for years I have waited for an opportunity to see this woman — it means so much to me, so little to you. Please be polite, my dear — it’s only for a little time. You’ll be going soon. What can it matter to you? She has her schemes like everybody else . . . keep silent if you feel you must, but be polite to her, for God’s sake; pretend to listen — don’t ruin everything for me now.” \\n\\n \\n\\n “All right,” he muttered grimly. “I’ll listen, but I’m damned if I’ll write anything down in the little book.” \\n\\n \\n\\n When they returned to the salon La Marquise had provided herself with various letters, folders, and descriptive circulars about the institution for which she was now soliciting aid. They seated themselves around the fire again, with coffee and liqueurs; by the time La Marquise had finished the description of her hospital project, the grey light of the brief wintry afternoon was fading rapidly, and the time for their departure had approached. \\n\\n \\n\\n Before they left she took them on a brief tour of inspection of the chateau, showing them the portraits of her ancestors, the great room with the huge, gold-canopied bed where King Henri IV had slept, on one of his visits to the chateau — unoccupied since, now closed save for museum visits such as this. \\n\\n \\n\\n Their last visit, before departure, was to the library: it was a pleasant, warm-looking room adjacent to the grand salon, and had the appearance of being seldom used. La Marquise smiled at the eager curiosity with which the young man looked over the storeyed rows of books, the costly elegance and rich colour of their bindings. \\n\\n \\n\\n “You like to reat, eh?” \\n\\n \\n\\n He told her that he did. She smiled, and said indifferently: \\n\\n \\n\\n “I do not like so motch. It bore me ven I reat so long.” \\n\\n \\n\\n He asked her a few questions about some of the modern French writers — Proust, Gide, Romains, and Cocteau, among others, for a moment her face was hardened by the arrogant look it had worn when he had asked her about the government, and she said rather impatiently: \\n\\n \\n\\n “I know nozzing about zose pipple. Yes, I have heard of some of zem. But I never reat zem. Zere is no good writing in France any more. Ze latest s’ing I have here,”— she nodded towards the shelves of books —“is Paul Bourget. But I never reat him, eizer.” \\n\\n \\n\\n In a few moments they had said farewell and were being driven away from the chateau. Rain had begun to fall again, the dull, grey light was almost gone and, since there was no convenient train, La Marquise had instructed her driver to take them back to Blois in the car. \\n\\n \\n\\n During the ride back to town he spoke seldom to the Countess. And she, as if recognizing the impatience, weariness and dislike he had come to feel towards her, the approaching end of their brief and curious relationship, was silent, too. When they got back to the hotel he told her rather curtly he was tired and was going to his room to wash and take a brief rest before dinner. \\n\\n \\n\\n “But yes, my dear,” she said instantly. “Of course you should. I can see that you are tired. Perhaps,” she added quietly, “I shall see you again when you come down.” \\n\\n \\n\\n “Of course you will,” he said shortly, almost angrily, in a tone that showed the irritable exasperation which too long association with the woman had now caused him to feel. \\n\\n \\n\\n “Good-bye my dear. Get some rest now. You need it.” \\n\\n \\n\\n When he got to his room he took off his coat and shoes, lay down on his bed, and instantly fell asleep. When he awoke he discovered he had slept almost three hours, that it was eight o’clock. Already late for dinner, washing and dressing hastily, he went downstairs to find no one but the proprietor’s wife in the bureau. Even before he could ask her where the Countess was, the woman had smilingly informed him that the old woman had gone, had already taken a train back to Orléans. \\n\\n \\n\\n “Mais elle vous a remis de très affectueux adieux,” the woman said with a smile. “Elle vous a fait des grands compliments.” \\n\\n \\n\\n And for a moment, when he realized that she was gone, he was conscious of a strange, mixed feeling of pity, loss and regret. He remembered suddenly the curt exasperation of his parting and something lonely, sad, and silent in the eyes of the old woman as she had said good-bye. The old loneliness had closed in around him again, he felt the sense of loss and sorrow that one feels when someone he has known a long time has gone. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/kehuan/1137/34003.html","bookId":175,"book":{"id":175,"title":"Of Time and the River","description":"简介： 本书包括《晶体领域》、《投机》、《肺鱼》等多篇中短篇作品，其中《肺鱼》已翻译为中文，于《科幻世界》杂志2008年3月号刊载。The River of Time brings together eleven shortstories, including quot;The Crystal Spheresquot; (WINNER: HugoAward Best SF Short Sto...","cover":"http://novel.tingroom.com/file/upload/201410/14/14-00-13-96-1.gif","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1137","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
