{"id":5398,"no":99,"title":"xcviii","content":"How long he had remained at Tours he scarcely knew: suspended in this spell of time and memory, he seemed to have detached himself not only from the infinite connections that bound him to the past, but from every project and direction that he had considered for the future. Day after day he stayed in his little room above the cobbled court of the hotel; he ate his meals there, going out at nightfall to eat and drink in a café, to walk about the streets, once or twice to go home with a woman of the town, and finally to come back to his room, to write furiously for hours, and then, stretched out in bed, nailed to the rock of a furiously wakeful sleep, to live again through the immense and spaceless images of night, in an alert but comatose hypnosis of the will. \\n\\n \\n\\n One morning he awoke with a shock of apprehension, the foreboding of calamitous mischance. It was the first time in weeks that he had taken thought of the state of his resources or felt any care or worry for the future. He counted his money with feverish haste, and discovered that less than 250 francs remained. For a moment he sat on the edge of the bed, holding the little wad of franc notes in his hand, stunned and bewildered by this sudden realization that his funds were exhausted, and for the moment not knowing what to do. His hotel bill for the week was due; he went at once to the bureau and asked for it; a hasty calculation assured him that when he had paid it, less than twenty francs would be left. \\n\\n \\n\\n He knew no one in Tours to whom he could appeal for aid; one glance at the impeccable, cold courtesy of the female face, hard, dark and Gallic, in the bureau of the hotel — the basalt of the eyes, the line of hair across the brows — told him that he could as soon wring milk and honey from the cobble-stones as extract an ounce of charitable relief from the granite coffers of her soul. The brows drew in, the black eyes hardened with a cold narrowing of mistrust: even before he spoke he saw she had read the story of his profligate extravagance, and that from that moment the hard propriety of her suspicious soul had been turned against him with that virtuous dislike which such people feel for unmoneyed men. When he spoke, therefore, it was to tell her he was leaving that day: she inclined her dark, hard face impassively, saying: “Oui, monsieur,” and asked if he would have his room vacated by twelve o’clock. \\n\\n \\n\\n He went to the railway station and looked up rates and distances. During the whole period of his stay in Tours — in fact, during the whole course of his wanderings since leaving Paris — he had been vaguely assured that he was moving in the general direction of Provence, Marseilles, and the South. He now discovered, on consulting a map, that he was off this course by some hundreds of kilometres, and on the southwest road to Bordeaux, the Pyrenees, and Spain. For a moment, he was decided to take the train for Bordeaux — a post card from Ann had been mailed from Carcassonne, and she had informed him that they were on their way to Biarritz. A brief inquiry, however, convinced him that his funds were by no means sufficient to get him even as far as Bordeaux and, over there, he felt, his case was more desperate than ever. He knew no one there and had no hope of meeting anyone he knew. He discovered also that the lowest fare back to Paris — the third-class fare — was about thirty-four francs, almost twice as much as he possessed. \\n\\n \\n\\n Finally, with a feeling of malevolent joy — for, curiously, a growing realization of his plight, and the dark, hard eyes of the Frenchmen fixed on him in an expression of avaricious mistrust, had now wakened in him a jubilant indifference, a desire to roar with laughter — he thought of Orléans and the Countess. \\n\\n \\n\\n He found that his funds were sufficient for third-class fare to Orléans, which was about seventeen francs, and that a train was leaving in an hour. Returning to the hotel, he packed his valise with frenzied haste, throwing his clothes in and stamping it down with his feet, rode to the station in the hotel’s horse-drawn bus, and an hour later was on his way back to Orléans. \\n\\n \\n\\n Late March had come: the day was overcast with thin, grey clouds, an uncertain milky radiance of light; the fields and earth and forests, still bare, had a moist, thawed fertility that spoke of spring. On the way up, snow began to fall, a brief flurry of large, wet flakes that melted as they fell: it was soon over, and the sun broke through in thin, wavering gusts of light. \\n\\n \\n\\n There were no other passengers in his compartment; he sat looking out of the window across the wet fields, and from time to time, as he visualized the look of startled, crafty apprehension on the Countess’s face when she saw him, he burst into wild, sudden whoops and yells of laughter that echoed loudly above the steady pounding of the wheels. \\n\\n \\n\\n It was noon when he reached Orléans: he took his heavy bag and went limping out across the station square, pausing once to rest his aching arms and change his grip. On entering the hotel he found Yvonne in the bureau. She looked up from her ledger as he entered, her dark face hardening with a mistrust of cold surprise as she saw him. \\n\\n \\n\\n “Monsieur has returned to stay?” she inquired, and looking towards his valise. “You wish a room?” \\n\\n \\n\\n “I do not know yet,” he said easily. “I shall let you know in a few minutes. At present, I should like to speak to the Countess. Is she here?” \\n\\n \\n\\n She did not answer for a moment, her black brows gathered in a line, and her eyes grew perceptibly harder, colder, more mistrustful as she looked at him. \\n\\n \\n\\n “Yes. I s’ink she is in her room,” she said at length. “I vill see. . . . Jean!” she called sharply, and struck a bell. \\n\\n \\n\\n The porter appeared, started with surprise when he saw the youth, and then smiled cordially and greeted him in friendly fashion. Then he turned inquiringly to Yvonne. She spoke curtly: \\n\\n \\n\\n “Dites à Madame la Comtesse que Monsieur le jeune Américain est revenu. Il attend.” \\n\\n \\n\\n “Mais oui, monsieur,” the porter said briskly, turning towards him. “Et votre bagage?” he looked inquiringly at the valise. “Vous restez ici?” \\n\\n \\n\\n “Je ne sais pas. Je vous dirai plus tard. Merci,” he said, as the porter took the valise and put it away behind the office desk. \\n\\n \\n\\n The porter departed with his message. Yvonne returned to her books, and he waited, pacing the hall in a state of nervous elation, until he heard the old woman’s voice, sharp, startled, excited, speaking to the porter on the floor above. Then he heard her coming down the stairs, turned and faced her sharply-inquiring, apprehensive face as she came down, and was vigorously pumping her uncertain and unwilling little claw, before she had time to stammer out a greeting: \\n\\n \\n\\n “But what — why — what brings you here?” she said. “I thought you had returned to Paris by now. Where have you been?” she asked sharply. \\n\\n \\n\\n “In Tours,” he answered. \\n\\n \\n\\n “Tours! But what were you doing there all this time? . . . What happened to you?” she asked suspiciously. \\n\\n \\n\\n “Ah, Countess,” he said solemnly, “it is a long story.” Then, with a deliberate burlesque of portentous gravity, he lowered his voice and whispered hoarsely, “I fell among thieves.” \\n\\n \\n\\n “What —?” she said in a faltering tone. “What are you saying? . . . You mean you have come back here . . . that you have no . . . how much money have you left?” she demanded sharply. \\n\\n \\n\\n He thrust his hand into his trousers pocket, fished around and pulled out a few small coins: four two-franc pieces, a franc, two twenty-five-centime coins, a ten — and a five-centime piece — \\n\\n \\n\\n “That’s all,” he said, counting them over. “Nine francs sixty-five.” \\n\\n \\n\\n “W-w-w-w-what?” she stammered. “Nine francs sixty-five — do you mean that’s all you have left?” \\n\\n \\n\\n “That’s all,” he said cheerfully, “but now that I’m here at last it doesn’t matter.” \\n\\n \\n\\n “Here!” she gasped. “Do you mean you are going — what do you intend to do?” she said sharply. \\n\\n \\n\\n “Oh,” he said easily, “I shall wait here until I get money from America.” \\n\\n \\n\\n “And — and how long do you think that will take?” the old woman was twisting her skinny fingers with feverish apprehension. \\n\\n \\n\\n “Oh, not long,” he said airily. “I wrote my mother yesterday, and it ought not to take over four weeks to get an answer.” \\n\\n \\n\\n “Four or five weeks!” the old woman said hoarsely. “What are you saying? Four or five weeks, and you have nine francs sixty-five in your pockets! My God! the man is mad!” \\n\\n \\n\\n “Oh, that part of it will be all right, I guess,” he said with an easy laugh. “I told my mother all about you and Monsieur and Madame Vatel, and all my other friends here, and how good you had been to me, and how you were always befriending Americans, and how they call you Little Mother. I told her you couldn’t have been kinder to me if you’d been my own mother, and that she didn’t need to worry about me at all. So I guess that part of it’s all right,” he concluded comfortably. “I told her that I’d just put up here at the hotel, and that you and the Vatels would take good care of me until the money comes from home.” \\n\\n \\n\\n “Put up here! . . . For four or five weeks! . . . Hush, my boy! Hush!” she whispered, clutching him feverishly with her bony little claw and casting an apprehensive glance towards Yvonne, whose dark head was lowered studiously above her ledger, but who suggested, by a certain strained attentiveness of posture, that she was missing none of the conversation. \\n\\n \\n\\n “Come,” the Countess whispered feverishly again, pulling him towards the stairway as she spoke. “You come with me, my boy. I want to talk to you alone.” \\n\\n \\n\\n They went upstairs to a parlour on the first floor, deserted, closed, a little stale with its sumptuous bordello furnishings of gilt and crimson plush. There the Countess turned to him and said directly: \\n\\n \\n\\n “See here, my boy. What you want to do is out of the question. It will be impossible for you to stay here for four or five weeks! Impossible!” she cried, twisting her bony little hands with growing agitation. “It cannot be done!” \\n\\n \\n\\n He looked surprised, a little pained. \\n\\n \\n\\n “Why?” he said. \\n\\n \\n\\n “Because,” she said, and now at last her tone was simple and direct in its quiet assertion, “the Vatels will not keep you here — they will not give you credit for so long a time —” \\n\\n \\n\\n “And you?” he said quietly. \\n\\n \\n\\n “My friend,” the old woman answered simply, “I have not got it.” She raised her bony little shoulders in a shrug. “At the present moment I have nothing — not a sou! I get a little money from America on the first and fifteenth of each month — if I had it, I would give it to you, but I have nothing now. And what I get would not be nearly enough to pay your expenses here for five weeks. It cannot be done.” \\n\\n \\n\\n For the first time since his return he felt respect and sympathy for her; in face of the plain and honest directness of her confession all of his former humour of cynical mockery had vanished. He said: \\n\\n \\n\\n “In that case it cannot be done. You are right. I must try to get help elsewhere.” \\n\\n \\n\\n “You have friends in Paris, haven’t you? You know people there — Americans?” \\n\\n \\n\\n “Yes — I think I could get help from someone if I were in Paris.” \\n\\n \\n\\n “Then I shall try to help you to get there,” she said quickly. “How much will you need?” \\n\\n \\n\\n “I think the third-class fare from here is about seventeen francs,” he said. \\n\\n \\n\\n “And you have — how much? Nine sixty-five?” She calculated swiftly, was silent a moment, and then, with an air of decision, marked by a faint flush of painful embarrassment on her withered cheek as she thought of the unpleasant task before her, she said: “If you will wait here, I will go below and see what I can do with these people. . . . I do not know,” she said shortly, the faint flush deepening as she spoke, “but I will try.” \\n\\n \\n\\n She left him and presently he heard voices below, mixed in rapid and excited argument. In ten minutes the old woman returned. In her hand she held a ten-franc note. \\n\\n \\n\\n “Here,” she said, giving it to him. “With what you have, it will be enough to get you to Paris. I have inquired. There is a train in twenty minutes. Now, my boy,” she said quickly, taking him by the arm, “you must go. You will just have time to buy your ticket and get on the train. You have no time to lose.” \\n\\n \\n\\n He had been surprised and disappointed at the meagre exactness of her loan: he had eaten nothing all day long and suddenly, with no funds to spare and the prospect of a continued and indefinite fast before him, he felt ravenously hungry. And now it was his turn to redden with embarrassment; he found it difficult to speak, and in a moment said hesitantly: \\n\\n \\n\\n “I wonder if these people here would let me have a sandwich. . . . I’ve had nothing to eat.” \\n\\n \\n\\n She did not answer; he saw the faint flush deepen on her sallow cheeks again and, already sorry for the additional distress his request had caused her, he said quickly: \\n\\n \\n\\n “No, it doesn’t matter. I’ll get something when I get to Paris. Besides, there’s not time now, anyway. I’ll have to get that train.” \\n\\n \\n\\n “Yes,” she said quickly, with relief. “I think you should. That is best. . . . And now, my boy, make haste. You have no more time to lose.” \\n\\n \\n\\n “Good-bye, Countess,” he said, taking her by the hand, and suddenly feeling for the old, lonely, and penniless woman the deepest affection and respect he had ever felt for her. “You have really been my friend. I’m sorry that I’ve had to cause you this trouble. I’ll send you the money when I get to Paris. Good-bye, now, and good luck to you.” \\n\\n \\n\\n When she answered, her voice was quiet and her old eyes were sad and tranquilly resigned: \\n\\n \\n\\n “Ah,” she said, “I was afraid that this would happen to you. I have known so many Americans — they are so reckless, so extravagant, they do not watch their money. . . . Good-bye, my boy,” she now said quietly, clasping his hand. “Take care of yourself and do not get into any more trouble. . . . Let me know if all goes well with you. . . . Good-bye, good-bye. . . . Ah, you are so young, aren’t you? Some day you will learn. . . . Good-bye, God bless you — you must hurry now — good-bye. Good-bye.” \\n\\n \\n\\n She followed him as he went quickly down the stairs, and stood on the stairs watching him as he departed. His valise had been put out before the bureau, where he could get it easily: Yvonne and Madame Vatel were waiting silently in the office. Yvonne did not speak at all; when he spoke to Madame Vatel, she cocked her head a little and said coldly: “Monsieur?” \\n\\n \\n\\n He seized the valise and started for the door with it at a rapid limping stride. At the door he paused, turned, and saw the Countess, still standing on the stairs and looking at him with old, sad eyes. \\n\\n \\n\\n “Good-bye,” he cried in jubilant farewell. “Good-bye, Countess.” \\n\\n \\n\\n “Good-bye, my boy,” her voice was so weary, old, and sad he could scarcely hear her. \\n\\n \\n\\n Then he limped rapidly away from the hotel, across the square, and towards the station and the train. \\n\\n \\n\\n All through the afternoon the train roared up across the fat and fertile countryside towards Paris. A late sun broke through ragged clouds of torn gold: the light was wild and radiant with a prophecy of spring. In the compartment his only companion was a young soldier: a boy of eighteen, tall, gawky, big of hand and foot and limb, looking even clumsier than he really was in his thick-soled army shoes, his blue-olive uniform — his long shanks coarsely wound with bands of olive cloth. \\n\\n \\n\\n The boy had a friendly, olive-coloured face, a little marred by pimples and fuzzy unshaved hair; he talked constantly, amiably indifferent to his companion’s foreign speech and manner, garrulously friendly in a hoarse boy’s voice. \\n\\n \\n\\n In the middle of the afternoon he began to unpack various bundles from the staggering impedimenta of military equipment with which he was surrounded. From a pocket of his overcoat he solemnly fished out an enormous tin of sardines. From another package he took out a gigantic bottle of red wine, and with the same gravity began to unfold from its wrapping in a newspaper a three-foot loaf of crusty bread. \\n\\n \\n\\n Then, with the same deliberate concentration, he opened the sardine tin, uncorked the wine-bottle and took a hearty preliminary swig, pulled out a clasp-knife with an evil-looking six-inch blade and, holding the loaf gripped firmly between his knees, began with a backward motion to carve a crisp and liberal slab out of the crusty loaf. This done, he put the bread aside, solemnly impaled a huge sardine upon the point of his gleaming knife, smacked it down upon the slab of bread and, furnishing himself with another hearty swig of the red wine, began to poke the sandwich happily away towards its intended destination, carrying on a choked but completely unperturbed conversation with his companion as he did so. \\n\\n \\n\\n And his fellow traveller, gazing on that coarse but appetizing fare, felt the pangs of hunger awake in him again with such maddening insistence that the whole legend of his starved desire must have been written on his yearning face and in his greedy eyes. At any rate, the young soldier, his mouth still crammed with food, uttered some inarticulate but friendly sounds, in which the word “Mangez” alone was intelligible, suddenly thrust loaf, bottle, knife, and sardine tin towards his starved companion, and with a gesture of rude encouragement, hoarsely spattered forth again: \\n\\n \\n\\n “Mangez!” \\n\\n \\n\\n The fellow-traveller required no second bidding. He fell to ravenously on sardines, wine, and crusty loaf; they sat there cramming themselves enthusiastically, uttering choked and muffled sounds from time to time and grinning at each other amiably. \\n\\n \\n\\n Nothing he had ever eaten tasted as good as that coarse fare; the strong, plain wine was pulsing warmly in his veins, the food made a warm glow in his grateful belly; outside, the sun had broken through in stripes of ragged gold and bronze, above the wheels he could hear great roars of hearty country laughter from another compartment, the high, rich, sanguinary voice of a Frenchman as he cried “Parbleu!” \\n\\n \\n\\n And he was going back to Paris again, without a penny, a prospect, or a plan, and he felt no care nor pain nor trouble any longer — nothing but wild joy and jubilant happiness such as he had never felt before. He did not know why. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/kehuan/1137/34006.html","bookId":175,"book":{"id":175,"title":"Of Time and the River","description":"简介： 本书包括《晶体领域》、《投机》、《肺鱼》等多篇中短篇作品，其中《肺鱼》已翻译为中文，于《科幻世界》杂志2008年3月号刊载。The River of Time brings together eleven shortstories, including quot;The Crystal Spheresquot; (WINNER: HugoAward Best SF Short Sto...","cover":"http://novel.tingroom.com/file/upload/201410/14/14-00-13-96-1.gif","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1137","creation":"Aug 1, 2019 12:18:21 AM","modification":"Aug 1, 2019 12:18:21 AM"}}
