{"id":40480,"no":4,"title":"Chapter 4 In the Passes.","content":"About the 23rd of July a reflection, raised above the sea, announced the presence of the first icebergs, which, emerging from Davis’ Straits, advanced into the ocean. From this moment a vigilant watch was ordered to the look-out men, for it was important not to come into collision with these enormous masses. \n \n The crew was divided into two watches. The first was composed of Fidèle Misonne, Gradlin, and Gervique; and the second of Andre Vasling, Aupic, and Penellan. These watches were to last only two hours, for in those cold regions a man’s strength is diminished one-half. Though the “Jeune–Hardie” was not yet beyond the 63rd degree of latitude, the thermometer already stood at nine degrees centigrade below zero. \n \n Rain and snow often fell abundantly. On fair days, when the wind was not too violent, Marie remained on deck, and her eyes became accustomed to the uncouth scenes of the Polar Seas. \n \n On the 1st of August she was promenading aft, and talking with her uncle, Penellan, and André Vasling. The ship was then entering a channel three miles wide, across which broken masses of ice were rapidly descending southwards. \n \n “When shall we see land?” asked the young girl. \n \n “In three or four days at the latest,” replied Jean Cornbutte. \n \n “But shall we find there fresh traces of my poor Louis?” \n \n “Perhaps so, my daughter; but I fear that we are still far from the end of our voyage. It is to be feared that the ‘Fro?ern’ was driven farther northward.” \n \n “That may be,” added André Vasling, “for the squall which separated us from the Norwegian boat lasted three days, and in three days a ship makes good headway when it is no longer able to resist the wind.” \n \n “Permit me to tell you, Monsieur Vasling.” replied Penellan, “that that was in April, that the thaw had not then begun, and that therefore the ‘Fro?ern’ must have been soon arrested by the ice.” \n \n “And no doubt dashed into a thousand pieces,” said the mate, “as her crew could not manage her.” \n \n “But these ice-fields,” returned Penellan, “gave her an easy means of reaching land, from which she could not have been far distant.” \n \n “Let us hope so,” said Jean Cornbutte, interrupting the discussion, which was daily renewed between the mate and the helmsman. “I think we shall see land before long.” \n \n “There it is!” cried Marie. “See those mountains!” \n \n “No, my child,” replied her uncle. “Those are mountains of ice, the first we have met with. They would shatter us like glass if we got entangled between them. Penellan and Vasling, overlook the men.” \n \n These floating masses, more than fifty of which now appeared at the horizon, came nearer and nearer to the brig. Penellan took the helm, and Jean Cornbutte, mounted on the gallant, indicated the route to take. \n \n Towards evening the brig was entirely surrounded by these moving rocks, the crushing force of which is irresistible. It was necessary, then, to cross this fleet of mountains, for prudence prompted them to keep straight ahead. Another difficulty was added to these perils. The direction of the ship could not be accurately determined, as all the surrounding points constantly changed position, and thus failed to afford a fixed perspective. The darkness soon increased with the fog. Marie descended to her cabin, and the whole crew, by the captain’s orders, remained on deck. They were armed with long boat-poles, with iron spikes, to preserve the ship from collision with the ice. \n \n The ship soon entered a strait so narrow that often the ends of her yards were grazed by the drifting mountains, and her booms seemed about to be driven in. They were even forced to trim the mainyard so as to touch the shrouds. Happily these precautions did not deprive, the vessel of any of its speed, for the wind could only reach the upper sails, and these sufficed to carry her forward rapidly. Thanks to her slender hull, she passed through these valleys, which were filled with whirlpools of rain, whilst the icebergs crushed against each other with sharp cracking and splitting. \n \n Jean Cornbutte returned to the deck. His eyes could not penetrate the surrounding darkness. It became necessary to furl the upper sails, for the ship threatened to ground, and if she did so she was lost. \n \n “Cursed voyage!” growled André Vasling among the sailors, who, forward, were avoiding the most menacing ice-blocks with their boat-hooks. \n \n “Truly, if we escape we shall owe a fine candle to Our Lady of the Ice!” replied Aupic. \n \n “Who knows how many floating mountains we have got to pass through yet?” added the mate. \n \n “And who can guess what we shall find beyond them?” replied the sailor. \n \n “Don’t talk so much, prattler,” said Gervique, “and look out on your side. When we have got by them, it’ll be time to grumble. Look out for your boat-hook!” \n \n At this moment an enormous block of ice, in the narrow strait through which the brig was passing, came rapidly down upon her, and it seemed impossible to avoid it, for it barred the whole width of the channel, and the brig could not heave-to. \n \n “Do you feel the tiller?” asked Cornbutte of Penellan. \n \n “No, captain. The ship does not answer the helm any longer.” \n \n “Ohé, boys!” cried the captain to the crew; “don’t be afraid, and buttress your hooks against the gunwale.” \n \n The block was nearly sixty feet high, and if it threw itself upon the brig she would be crushed. There was an undefinable moment of suspense, and the crew retreated backward, abandoning their posts despite the captain’s orders. \n \n But at the instant when the block was not more than half a cable’s length from the “Jeune–Hardie,” a dull sound was heard, and a veritable waterspout fell upon the bow of the vessel, which then rose on the back of an enormous billow. \n \n The sailors uttered a cry of terror; but when they looked before them the block had disappeared, the passage was free, and beyond an immense plain of water, illumined by the rays of the declining sun, assured them of an easy navigation. \n \n “All’s well!” cried Penellan. “Let’s trim our topsails and mizzen!” \n \n An incident very common in those parts had just occurred. When these masses are detached from one another in the thawing season, they float in a perfect equilibrium; but on reaching the ocean, where the water is relatively warmer, they are speedily undermined at the base, which melts little by little, and which is also shaken by the shock of other ice-masses. A moment comes when the centre of gravity of these masses is displaced, and then they are completely overturned. Only, if this block had turned over two minutes later, it would have fallen on the brig and carried her down in its fall. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1475/44226.html","bookId":1357,"book":{"id":1357,"title":"A Winter Amid the Ice","description":"简介： The cur of the ancient church of Dunkirk rose at five oclock on the 12th of May, 18to perform, according to his custom, low mass for the benefit of a few pious sinners....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1475","creation":"Aug 1, 2019 12:24:54 AM","modification":"Aug 1, 2019 12:24:54 AM"}}
