{"id":82159,"no":21,"title":"Page 21","content":"CHAPTER 39\n It came upon her without warning. Schuyler cursed her pride. It was all her fault. Oliver had offered to put her in a cab, but since she already owed him so much money, she had declined. Conduit or not, she didn\u0027t want to keep taking advantage of his generosity. He and Bliss lived a few blocks away from the Carlyle and she told them she was fine with taking the crosstown bus. The M72 dropped her off at 72nd and Broadway, and she decided to walk the rest of the way home. It was more than twenty blocks, but she looked forward to the exercise.\n At the corner of Ninety-fifth Street, she turned from the well-lit avenue to a dark street, hoping to walk up Riverside, and that\u0027s when she felt it.\n Within seconds, it had her in her grasp. She felt the sharp fangs puncture her skin and begin to slowly draw her life\u0027s blood from her. She swooned, gasping. She was going to die.\n She was fifteen years old and had hardly even lived, and already she was going to die. She struggled against its iron grip. Worse, knowing what her grandmother had told her, she would live. She would live in this foul beast\u0027s memory, a trapped prisoner to its insane consciousness forever.\n Beauty. Where was Beauty? The bloodhound would be too late to save her now.\n The pain was deep; she was feeling dizzy from the blood loss. But just before she succumbed, there was a shout.\n A struggle.\n Someone was fighting the beast. The Silver Blood was releasing her. She turned, holding her neck to stop the blood flow, to see who had saved her.\n Jack Force was trapped in a power struggle with the fell creature, locked in a tremendous fight. It was hulking and large, with shining silver hair and a man\u0027s form. But Jack was fighting it.\n He matched the Silver Blood blow for blow, but at last, the Silver Blood threw him off, slamming Jack\u0027s body against the concrete.\n \"Jack!\" Schuyler screamed. She looked up, and as the monster lunged for her throat, Schuyler remembered her grandmother\u0027s words. The laws of heaven meant that any creature was a slave to the Sacred Language.\n She held it back with a powerful command: \"Aperio Oris!\" Reveal yourself!\n The Silver Blood cackled in laughter, and hissed in a terrible voice that rasped with the agony of a thousand screaming souls, \"You cannot command me, earthspawn!\"\n The creature continued its menacing march toward her.\n \"Aperio Oris!\" Schuyler shouted again, more forcefully this time.\n Jack staggered backward, for in the moment that Schuyler had summoned the incantation, the sacred words that she had learned, the monster had shown them his real face.\n It was a face that Jack would never forget.\n The beast howled in dismay, screeching a wretched, terrible scream, then disappeared into the night.\n \"Are you all right?\" Schuyler asked, rushing to his side. \"You\u0027re bleeding.\"\n \"It\u0027s just a cut,\" he said, wiping the blood, which had run red, but was blue in the light. \"I\u0027m okay. Are you?\"\n She felt the side of her neck. The bleeding had stopped. \"How did you know?\" she asked.\n \"That it would attack you? Because it had once before, so I knew it would do it again. Killers tend to go back and finish what they started.\"\n \"But why - \"\n \"I didn\u0027t want to see you get hurt because of me,\" Jack explained brusquely.\n Is that all? Schuyler wondered.\n \"Thank you,\" she said softly.\n \"Did you see it?\" Jack asked. \"Did you?\"\n \"Yes.\" She nodded. \"I did.\"\n \"It can\u0027t be right,\" Jack said. \"It\u0027s a trick.\" He shook his head. \"I don\u0027t believe it.\"\n \"It\u0027s not. It has to follow the laws.\" Schuyler said gently.\n \"I know about the Sacred Language,\" Jack snapped. \"But it has to be a mistake.\"\n \"No mistake. Those are the rules of creation.\"\n Jack glowered. \"No.\"\n The monster had shown itself for one brief moment, when it had no choice but to obey Schuyler\u0027s words. The monster had shown its true form. And it was the face of the authority behind New York, the face of the man who single-handedly changed the city to bend to his will.\n The face of Charles Force.\n His own father.\n CHAPTER 40\n Schuyler told Jack everything she\u0027d put together, hoping that it wasn\u0027t true. \"It\u0027s him. He was there on the night Aggie died. I saw him at the basement of The Bank. He was coming out of the Repository. I remember now. It puts him in the scene of the crime. It was him, Jack.\"\n Jack shook his head.\n \"You can\u0027t deny what you saw. It was your father\u0027s face.\"\n \"You\u0027re wrong. It\u0027s a trick of the light, something else.\" He kept shaking his head and staring down at the blood on the sidewalk.\n \"Listen to me. Jack, we have to find him. My grandmother said Silver Bloods don\u0027t even know what they are. Your father might not even realize he\u0027s been possessed.\"\n Jack didn\u0027t argue this time.\n She put a hand on his arm. \"Where is he?\"\n \"Where he always is. The hospital.\"\n \"What do you mean? What hospital?\"\n \"Columbia Pres, but I don\u0027t know what room. I don\u0027t know what he does up there. Only that he visits someone there a lot.\" Jack said. \"Why?\"\n \"I think I might know where we can find him,\" Schuyler said.\n Schuyler felt dire trepidation as they shared a taxicab up to hospital, but she tried to suppress it. When they arrived at the complex, the guards joked about her ?boyfriend? as they gave Jack a visitor\u0027s tag.\n \"Who\u0027s here? Where are we going?\" he asked, as he followed her swiftly down the hallway.\n \"My mother,\" Schuyler said. \"You\u0027ll see.\"\n \"Your mother? I thought your mother was dead.\"\n \"She might as well be,\" Schuyler said grimly.\n She led him down the empty hallways to the corner room. She looked through the glass window and motioned for Jack to do the same.\n There was a man there, kneeling at the foot of the bed. The same mysterious visitor who came every Sunday, whom Schuyler had seen more than once in her mother\u0027s room. So that was why Charles Force had looked so familiar to her at Aggie\u0027s funeral. Now she recognized the set of the shoulders. He was the man in the basement of The Bank, and the beast who had just attacked her. The dark stranger wasn\u0027t her father after all, but a Silver Blood. A monster. She felt a furious rage - what if Charles Force had had something to do with her mother\u0027s condition? What had he done to her?\n \"Father,\" Jack said as he entered the room. He stopped and stared when he saw the face of the woman in the bed. The woman in his dreams. Allegra Van Alen.\n Charles looked up and saw Schuyler and Jack standing in front of him. \"I thought we had put an end to this,\" he said, frowning at the two of them together.\n \"Where were you half an hour ago?\" Schuyler demanded. \"Here.\"\n \"Liar,\" Schuyler accused. \"CROATAN!\"\n Charles raised his eyebrows. \"Should I be insulted? Please lower your voice. Show some respect for your surroundings. We\u0027re in a hospital, not at a wrestling match.\"\n \"It\u0027s you, Father. We saw you.\" Jack said. He still couldn\u0027t believe Allegra was still alive. But what was she doing in a hospital?\n \"What exactly are you both accusing me of?\"\n \"Where did you get those scratches?\" Jack demanded, noticing the cuts on his father\u0027s face.\n \"Your mother\u0027s confounded Persian,\" Charles growled.\n \"I don\u0027t think so,\" Schuyler scoffed.\n \"What is this all about?\" Charles demanded. \"Why are the two of you here?\"\n \"You attacked Schuyler. I held you off. It was you, I saw you... Schuyler said the words, and my foe revealed its face. And it was yours.\"\n \"Is this what you believe?\"\n \"Yes.\"\n \"Your grandmother is right, Schuyler,\" Charles said in a bemused tone. \"Times have certainly changed if my own son thinks I am Abomination. That is what you\u0027re calling me, isn\u0027t it, Jack?\" he asked, as he pulled down his shirt cuff and showed them a mark on the underhand of his right wrist. It was of a sword, a golden sword piercing a cloud.\n \"What is it? Why are you showing us this?\" Schuyler asked.\n \"The mark of the Archangel,\" Jack explained, his voice reverent. He forgot about his confusion concerning Allegra Van Alen for a moment, and dropped to his knees, prostrating himself in front of his father\u0027s feet.\n \"Precisely,\" Charles said with a thin smile.\n \"What does it mean?\" Schuyler asked.\n \"It means, my father is no more a Silver Blood than you or I,\" Jack explained, his voice rising. \"The mark of the Archangel. It can\u0027t be duplicated and it can\u0027t be falsified. My father is Michael, Pure of Heart, who voluntarily accompanied the banished onto the earth to guide us in our immortal journey.\" He bowed to his father. \"Forgive me. I have been lost, but now I am found.\"\n \"Rise, my son. There is nothing to forgive.\"\n Schuyler looked from father to son with questioning eyes. \"But I used the Sacred Language. The incantation to reveal its true nature.\"\n \"Silver Bloods are agile shape-shifters,\" Charles explained. \"It would follow your command - but only after showing you something it knew would throw you off, to shock you. Only afterward would it show its true identity. But only for the briefest moment.\"\n \"So if your father isn\u0027t the Silver Blood, then who is?\" Schuyler asked suspiciously. \"And where\u0027s Dylan?\"\n \"He\u0027s safe. For now. Hidden. He won\u0027t harm anyone else anymore,\" Charles said. \"Tomorrow he will be far away.\"\n \"What do you mean, harm anyone?\" Schuyler asked.\n \"He had the bites on his neck. He was being used. Turned.\"\n \"Into what? What are you talking about?\"\n \"Dylan\u0027s a Blue Blood,\" Charles said shortly. \"At least, he was. I thought you knew that.\"\n Schuyler shook her head. Dylan was a vampire? But then that meant - that meant he could have killed Aggie - that meant that everything they thought, everything they assumed could no longer be true. Dylan wasn\u0027t human. Which meant there was a chance he wasn\u0027t innocent.\n \"But he was never at any meetings,\" Schuyler said weakly.\n Charles smiled. \"They are not mandatory. You can learn about your history or choose to ignore it. Dylan chose to ignore it. To his detriment. The Silver Bloods only attack the weak-minded. They are drawn to those that are broken, damaged somehow. They sensed Dylan\u0027s weakness and preyed on it. Dylan, in turn, preyed on others.\"\n \"So then it was him. He killed Aggie?\"\n \"It is unfortunate what happened with Aggie, yes. We have discovered that Dylan had been drained of almost all his blood in the original attack, but the Silver Blood decided not to consume him totally and turned him into one of them instead. To survive, he had to take a victim of his own,\" Charles explained. \"I am sorry.\"\n Schuyler was speechless for a moment. All along, all along they had thought he was their friend. Dylan, a vampire... worse, a Silver Blood\u0027s pawn. It was horrifying. \"So, Silver Bloods do exist. You admit that they have returned.\"\n \"I admit nothing,\" Charles declared haughtily. \"There could be other explanations for his actions. Dylan could still be acting on his own. It does happen once in a while. Dementia. The Sunset Years are volatile ones for our kind. He could have faked the marks on his neck. We must investigate through the proper channels. If he has been corrupted, there is still a chance to save his soul. For now we have placed him and his parents in a safe location.\"\n \"But you can\u0027t do this. Cover it up. You must warn everybody. You must.\"\n \"Just like your grandmother, you are,\" Charles said. \"A pity. Your mother was not a hysterical woman.\" He looked tenderly down at Allegra and lowered his voice. \"The Conclave will take care of it. We will act in time.\"\n \"Yet in Plymouth, you did nothing,\" Schuyler accused. \"Roanoke - they were all taken, yet you did nothing.\"\n \"And the deaths stopped,\" Charles said coldly. \"If we had frightened everyone, if we had continued to run, as your grandparents advised, we would never be where we are now. We would be hiding forever, afraid of a shadow that may not exist.\"\n \"But Aggie - and the girl from Connecticut and the Choate boy,\" Schuyler argued. \"What about them?\"\n Charles sighed. \"Unfortunate losses, all of them, yes.\"\n Schuyler couldn\u0027t believe what she was hearing. Talking about people as if their lives were expendable.\n \"We will clear this all up in time, I assure you,\" Charles said. \"We won the battle in Rome. The Silver Bloods are all but destroyed.\"\n \"My grandmother said that one of them lived, that one of them was able to hide among us... that the most powerful Silver Blood may still be alive,\" Schuyler said, walking around her mother\u0027s bed to face Charles head-on.\n \"Cordelia has always said that. She persists in saying that. She is mistaken. I was there. I was there at the battle at the temple. Listen to me closely, both of you, because I do not want to repeat this again - I sent Lucifer himself to the fires of hell,\" Charles declared.\n Schuyler was subdued and silent.\n \"Now, let us leave your mother in peace,\" Charles ordered. He knelt down again and kissed Allegra\u0027s cold hand.\n \"But there is one thing,\" Schuyler suddenly remembered. \"Dylan.\"\n \"Yes?\" Charles asked.\n \"Where is he?\"\n \"At the Carlyle Hotel. I told you, he is safe.\"\n \"No, he\u0027s not. He\u0027s not at the Carlyle anymore. I was just there. He\u0027s gone.\" Schuyler told them what they had found - the television blaring, the half-eaten dinner. \"I think he was the one who attacked me.\"\n For a long moment, nothing was said. Charles looked at Schuyler wrathfully. \"If what you are saying is true, we must find him. Immediately.\"\n \n","sourceLink":"https://allnovel.net/blue-bloods-blue-bloods-1/page-21.html","bookId":1864,"book":{"id":1864,"title":"Blue Bloods (Blue Bloods #1)","description":"Storyline: \n I picked up this book suspecting to be an unconventional, interesting vampire tale. I am a fan of vampire lore, or good ones, at least, so I had to pick this up at my friendly local library. Was I surprised - or perhaps not, coming from the author of \u0027Au Pairs\u0027- that this book had very little to do with vampires. The first 100 or so pages had absolutely no vampire mentions, and hardly any insinuations that vampires would come up later. Even after that the whole \u0027Guess what, I\u0027m a vampire, and nearly everyone around you is too...oh yeah, and blood is indeed a necessity\u0027 thing is merely a side plot. Mainly, this book concerns Schuyler, an outcast of sorts, dealing with the Queen Bee, Mimi Force, and her gorgeous twin brother, and other high school dramas such as that. It takes a look at the high end of society, where teens learn to drip money without showing it off...\n \n","cover":"https://allnovel.net/images/blue-bloods-blue-bloods-1.jpg","author":"Melissa de la Cruz","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/blue-bloods-blue-bloods-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:40:38 PM"}}
