{"id":11217,"no":10,"title":"CHAPTER IX","content":"Mr. William Ordway Partridge, in \"Art for America,\" says to us: \"Let us learn to look upon every child face that comes before us as a possible Shakespeare or Michael Angelo or Beethoven. The artistic world is rejoicing over the discovery in Greece of some beautiful fragments of sculpture hidden far beneath the débris of centuries; shall we not rejoice more richly when we are able to dig down beneath the surface of the commonest child that comes to us from our great cities, and discover and develop that faculty in him which is to make him fit to live in usefulness with his fellow men? Seeking for these qualities in the child we shall best conserve, as is done in physical nature, the highest type, until we have raised all human life to a higher level.\" \n \n I hope that some day Mr. Partridge will write a plea for elementary art classes in our prisons. For in every prison there are gifted men and boys whose special talents might be so trained and [Pg 158]developed as to change the channel of their lives. What chances our prisons have with these wards of the state, to discover and develop the individual powers that might make their owners self-respecting and self-supporting men! \n \n We are doing this in our institutions for the feeble-minded and with interesting results, but in our prisons the genius of a Michael Angelo might be stifled—the musical gift of a Chopin doomed to eternal silence. \n \n Mr. Partridge\u0027s belief in the latent possibilities in our common children went to my heart, because I had known Anton Zabrinski; and yet I can never think of Anton Zabrinski as a common child. \n \n The story of his life is brief; but his few years enclosed the circle of childhood, youth, aspiration, hope, horror, tragedy, pain, and death; and all the beautiful possibilities of his outward life were blighted. \n \n Anton\u0027s home was in the west side of Chicago, in that region where successive unpronounceable names above doors and across windows assure one that Poland is not lost but scattered. \n \n In back rooms in the third story of the house lived the Zabrinski family, the father and mother[Pg 159] with Anton and his sister two years younger. The mother was terribly crippled from an accident in childhood, and was practically a prisoner in her home. Anton, her only son, was the idol of her heart. \n \n When scarcely more than a child Anton began work tailoring. He learned rapidly, and when sixteen years old was so skilful a worker that he earned twelve dollars a week. This energy and skill, accuracy of perception and sureness of touch, gave evidence of a fine organization. His was an elastic, joyous nature, but his growth was stunted, his whole physique frail; sensitive and shy, he shrank with nervous timidity from contact with the stronger, rougher, coarser-fibred boys of the neighborhood. Naturally this served only to make Anton a more tempting target for their jokes. \n \n Two of these boys in particular played upon his fears until they became an actual terror in his existence; though the boys doubtless never imagined the torture they were inflicting, nor dreamed that he really believed they intended to injure him. It happened one evening that Anton was going home alone from an entertainment, when these two boys suddenly jumped out from some[Pg 160] hiding-place and seized him, probably intending only to frighten him. Frighten him they did, out of all bounds and reason. In his frantic efforts to get away from them Anton opened his pocket-knife and struck out blindly. But in this act of self-defence he mortally wounded one of the boys. \n \n Anton Zabrinski did not go back to his mother that night; this gentle, industrious boy, doing the work and earning the wages of a man, had become, in the eye of the law, a murderer. I have written \"in the eye of the law\"; a more accurate statement would be \"in the eye of the court,\" for under fair construction of the law this could only have been a case of manslaughter; but—— \n \n I once asked one of Chicago\u0027s most eminent judges why in clear cases of manslaughter so many times men were charged with murder and tried for murder. The judge replied: \"Because it is customary in bringing an indictment to make the largest possible net in which to catch the criminal.\" \n \n Anton Zabrinski had struck out with his knife in the mere animal instinct of self-defence. The real moving force of evil in the tragedy was the love of cruel sport actuating the larger boys—a passion leading to innumerable crimes. Were the[Pg 161] moral origin of many of our crimes laid bare we should clearly see that the final act of violence was but a result—the rebound of an evil force set in motion from an opposite direction. It sometimes happens that it is the slayer who is the victim of the slain. But to the dead, who have passed beyond the need of our mercy, we are always merciful. \n \n Had an able lawyer defended Anton he never would have been convicted on the charge of murder; but the family was poor, and, having had no experience with the courts, ignorantly expected fairness and justice. Anton was advised to plead guilty to the charge of murder, and was given to understand that if he did so the sentence would be light. Throwing himself upon \"the mercy of the court,\" the boy pleaded \"guilty.\" He was informed that \"the mercy of the court\" would inflict the sentence of imprisonment for life. It chanced that in the court-room another judge was present whose sense of justice, as well as of mercy, was outraged by this severity. Moved with compassion for the undefended victim he protested against the impending sentence and induced the presiding judge to reduce it to thirty years. Thirty years! A lifetime indeed to the[Pg 162] imagination of a boy of seventeen. The crippled mother, with her heart torn asunder, was left in the little back room where she lived, while Anton was taken to Joliet penitentiary. \n \n It did not seem so dreadful when first it came in sight—that great gray-stone building, with its broad, hospitable entrance through the warden house; but when the grated doors closed behind him with relentless metallic clang, in that sound Anton realized the death-knell of freedom and happiness. And later when, for the first night, the boy found himself alone in a silent, \"solitary\"[8] cell, then came the agonizing homesickness of a loving young heart torn from every natural tie. Actually but two hours distant was home, the little back room transfigured to a heaven through love and the yearning cry of his heart; but the actual two hours had become thirty years of prison in the future. The prison life itself was but a dumb, unshapen dread in his imagination. And the unmeaning mystery and cruelty and horror of his fate! Why, his whole life covered but seventeen years, of which memory could recall not[Pg 163] more than twelve; he knew they were years of innocence, and then years of faithful work and honest aims until that one night of horror, when frightened out of his senses he struck wildly for dear life. And then he had become that awful thing, a murderer, and yet without one thought of murder in his heart. If God knew or cared, how could he have let it all happen? And now he must repent or he never could be forgiven. And yet how could he repent, when he had meant to do no wrong; when his own quivering agony was surging through heart and mind and soul; when he was overwhelmed with the black irrevocableness of it all, and the sense of the dark, untrodden future? One night like that, it holds the sufferings of an ordinary lifetime. \n \n We who have reached our meridian know that life means trial and disappointment, but to youth the bubble glows with prismatic color; and to Anton it had all been blotted into blackness through one moment of deadly fear. \n \n When young convicts are received at Joliet penitentiary it is customary for the warden to give them some chance for life and for development physically and mentally. They are usually given light work, either as runners for the shops[Pg 164] or helpers in the kitchens or dining-rooms, where they have exercise, fresh air, and some variety in employment. Anton came to the prison when there was a temporary change of wardens, and it happened when he was taken from the \"solitary\" cell where he passed the first night that he was put to work in the marble-shop, a hard place for a full-grown man. He was given also a companion in his cell when working-hours were over. \n \n As he became fully adjusted to prison life he learned a curious thing: on the outside crime had been the exception, a criminal was looked upon as one apart from the community; but in this strange, unnatural prison world it was crime which formed the common basis of equality, the tie of brotherhood. \n \n And again, the tragedy of his own fate, which had seemed to him to fill the universe, lost its horrible immensity in his imagination as he came to realize that every man wearing that convict suit bore in his heart the wound or the scar of tragedy or of wrong inflicted or experienced. He had believed that nothing could be so terrible as to be separated from home and loved ones; but learned to wonder if it were not more terrible never to have known loved ones or home. \n \n [Pg 165] \n \n When his cell-mate estimated the \"good time\" allowance on a sentence of thirty years, Anton found that by good behavior he could reduce this sentence to seventeen years. That really meant something to live for. He thought he should be almost an old man if he lived to be thirty-three—something like poor old Peter Zowar who had been in prison twenty-five years; but no prisoner had ever lived there thirty years; and this reduction to seventeen years meant to Anton the difference between life and death. Even the seventeen years\u0027 distance from home began to be bridged when his sister Nina came to see him, bringing him the oranges and bananas indelibly associated with the streets of Chicago, or cakes made by his own mother\u0027s hands and baked in the oven at home. \n \n Life in prison became more endurable, too, when he learned that individual skill in every department of work was recognized, and that sincerity and faithfulness counted for something even in a community of criminals. Praise was rare, communication in words was limited to the necessities of work; but in some indefinable way character was recognized and a friendly attitude made itself felt and warmed the heart; and the nature so sensitive to harshness was quick to perceive and to respond to kindness. \n \n [Pg 166] \n \n It is hard to be in prison when a boy, but the older convicts regard these boys with compassion, touched by something in them akin to their own lost youth, or perhaps to children of their own. Little Anton looked no older and was no larger than the average boy of fourteen; and to the older men he seemed a child. \n \n Human nature is human nature, and youth is youth in spite of bolts and bars. The springtime of life was repressed in Anton, but it was working silently within him, and silently there was unfolding a power not given to all of us. His work in the marble-shop was readily learned, for the apprenticeship at tailoring had trained his eye and hand, and steadfast application had become habitual. As his ability was recognized ornamental work on marble was assigned him. At first he followed the patterns as did the ordinary workmen; these designs suggested to him others; then he obtained permission to work out the beautiful lines that seemed always waiting to form themselves under his hand, and the patterns were finally set aside altogether. The art impulse within him was astir and finding expression, and as time passed he was frankly recognized as the best workman in the shop. \n \n [Pg 167] \n \n He was homesick still, always homesick, but fresh interest had come into his existence, for unawares the spirit of beauty had come to be the companion of his working-hours. He did not recognize her. He had never heard of art impulses. But he found solid human pleasure and took simple boyish pride in the individuality and excellence of his work. \n \n The first year and the second year of his imprisonment passed: the days dawning, darkening, and melting away, as like to one another as beads upon a string, each one counted into the past at night as meaning one day less of imprisonment. But toward the end of the second year the hours began to drag interminably, and Anton\u0027s interest in his work flagged. He became restless, the marble dust irritated his lungs, and a cough, at first unnoticed, increased until it constantly annoyed him. Then his rest at night was broken by pain in his side, and at last the doctor ordered him to be removed from the marble-shop. It was a frail body at best, and the confinement, the unremitting work, the total lack of air and exercise had done their worst; and all resisting physical power was undermined. \n \n No longer able to work, Anton was relegated to[Pg 168] the \"idle room.\" Under the wise rule of recent wardens the idle room has happily become a thing of the past, but for years it was a feature of the institution, owing partly to limited hospital accommodations. By the prisoners generally this idle room, called by them the \"dreary room,\" was looked upon as the half-way station between the shops and the grave. Most cheerless and melancholy was this place where men too far gone in disease to work, men worn out in body and broken in spirit, waited together day after day until their maladies developed sufficiently for them to be considered fit subjects for hospital care. Usually no reading-matter was allowed, and free social intercourse was of course forbidden, although the inmates occasionally indulged in the luxury of comparing diseases. Under the strain of that deadening monotony courage failed, and to many a man indifferent to his own fate the sight of the hopelessness of others was heart-breaking. The influence of the idle room was not quite so depressing when Anton came within its circle, for a light industry had just been introduced there, and some of the inmates were employed. \n \n And at this time Anton was beginning to live in[Pg 169] a day-dream. His cell-mate, a young man serving a twenty years\u0027 sentence, was confidently expecting a pardon; pardons became the constant theme of talk between the two when the day was over, and Anton\u0027s faith in his own possible release kindled and glowed with the brightening prospects of his friend. Hope, that strange characteristic of tuberculosis, flamed the higher as disease progressed; with the hectic flush there came into his eyes a more brilliant light, and a stronger power to look beyond the prison to dear liberty and home. Even the shadow of the idle room could not dim the light of his imagination. No longer able to carve his fancies on stone, he wove them into beautiful patterns for life in freedom. The hope of a pardon is in the air in every prison. Anton wrote to his family and talked with his sister about it, and though he made no definite beginning every day his faith grew stronger. \n \n It was at this time that I met Anton. I was visiting at the penitentiary, and during a conversation with a young English convict, a semi-protégé of Mary Anderson, the actress, this young man said to me: \"I wish you knew my cell-mate.\" I replied that I already knew too many men in that prison. \"But if you would only see little[Pg 170] Anton I know you would be mashed in a minute,\" the Englishman confidently asserted. As to that probability I was sceptical, but I was impressed by the earnestness of the young man as he sketched the outline of Anton\u0027s story and urged me to see him. I remember that he made a point of this: \"The boy is so happy thinking that he will get a pardon sometime, but he will die here if somebody doesn\u0027t help him soon.\" To gratify the Englishman I consented to see the happy boy who was in danger of dying. \n \n An attractive or interesting face is rare among the inmates of our prisons. The striped convict suit, which our so-called Christian civilization so long inflicted upon fellow men, in itself gave an air of degradation,[9] and the repression of all animation tends to produce an expression of almost uniform dulness. Notwithstanding his cell-mate\u0027s enthusiasm I was thrilled with surprise, and something deeper than surprise, when I saw Anton Zabrinski. The beauty of that young Polish prisoner shone like a star above the degrading convict suit. It was the face of a Raphael, with the broad brow and the large, luminous, far-apart eyes of darkest blue, suggesting in their[Pg 171] depths all the beautiful repressed possibilities—eyes radiant with hope and with childlike innocence and trust. My heart was instantly vibrant with sympathy, and we were friends with the first hand-clasp. The artistic temperament was as evident in the slender, highly developed hands as in his face. \n \n At a glance I saw that his fate was sealed; but his spirit of hope was irresistible and carried me on in its own current for the hour. Anton was like a happy child, frankly and joyfully opening his heart to a friend whom he seemed always to have known. That bright hour was unclouded by any dark forebodings in regard to illness or an obdurate governor. We talked of pardon and freedom and home and happiness. I did not speak to him of repentance or preparation for death. I felt that when the summons came to that guileless spirit it could only be a summons to a fuller life. \n \n During our interview the son of the new warden came in, and I called his attention to Anton. It was charming to see the cordial, friendly fashion in which this young man[10] talked to the prisoner,[Pg 172] asking where he could be found and promising to do what he could for him, while Anton felt that at last he was touching the hand of Providence. The new authorities had not been there long enough to know many of the convicts individually, but at dinner that day the warden\u0027s son interested his father in Anton by recounting their conversation that morning. The warden\u0027s always ready sympathy was touched. \"Take the boy out of that idle room,\" he said, \"take him around the yard with you to see the dogs and horses.\" This may not have been discipline, but it was delightfully human—and humanizing. \n \n When I left the prison I was assured that I could depend upon the warden\u0027s influence in furthering my purpose of realizing Anton\u0027s dream, his faith and hope of pardon. The following Sunday in Chicago I found the Zabrinski family, father, mother, and the young sister, in their third-story back rooms. On the wall hung a framed photograph of Anton as a little child. The mother did not speak very clear English, but she managed to repeat, over and over again: \"Anton was so good; always he was such a good boy.\" The young sister, a tailoress, very trim in her dark-blue Sunday gown, discussed [Pg 173]intelligently ways and means of obtaining her brother\u0027s release. \n \n Our plans worked smoothly, and a few weeks later, when all Chicago was given over to the World\u0027s Fair, the desire of Anton\u0027s heart came true and he was restored to home and freedom. Or, as the newspapers would have put it: \"Our anarchist governor let loose another murderer to prey upon society.\" Poor little murderer! In all that great city there was no child more helpless or harmless than he. \n \n The image of little Anton Zabrinski, as of the prison itself, grew faint in my heart for the time, under the spell of the long enchanting summer days and magical evenings at the White City. \n \n The interest and the beauty of that fusion of all times and all countries was so absorbing and irresistible that I had stayed on and on until one day in July when I braced myself for the wrench of departure next morning. But the evening mail brought me letters from home and among them one forwarded from Anton, entreating me to come and see him. I had not counted on being remembered by Anton except as a milestone on his path toward freedom—I might have counted on it, however, after my many [Pg 174]experiences of the gratitude of prisoners—but his longing to see me was unmistakable; and as I had broken my word so many times about going home that my reputation for unreliability in that direction could not be lowered, I sent a final telegram of delay.—Oh, luxury of having no character to lose! \n \n The next morning I took an early start for the home of the Zabrinskis. In a little back yard—a mere patch of bare ground without the possibility of a blade of grass, with no chance of even looking at the sky unless one lay on one\u0027s back, with uniform surroundings of back doors and back stairs—what a contrast to that dream of beauty at Jackson Park!—here it was that I found Anton, listlessly sitting on a bench with a little dog as companion. All hope and animation seemed to have died out within him; even the lights in his deep-blue eyes had given way to shadows; strength and courage had ebbed away, and he had yielded at last to weariness and depression. He had left the prison, indeed, but only to face death; he had come back to his home, only to be carried away from it forever. Even his mother\u0027s loving care could not stop that racking cough nor free him from pain. And how limited the[Pg 175] longed-for freedom proved! It had reached out from his home only to the hospital dispensary. Weakness and poverty formed impassable barriers beyond which he could not go. \n \n As I realized all this I resolved to give him the most lovely vision in the world to think of and to dream of. \"Anton,\" I said, \"how would you like to take a steamer and go on the lake with me to see the World\u0027s Fair from the water?\"—for him to attempt going on the grounds was not to be thought of. \n \n For a moment he shrank from the effort of getting to the steamer, but after considering it for a while in silence he announced: \"When I make up my mind that I will do a thing, I do it; I will go with you.\" Then we unfolded our plan for adventure to the mother. Rather wild she thought it, but our persuasive eloquence won the day and she consented, insisting only that we should partake of refreshments before starting on our expedition. With the connivance of a neighbor on the next floor Mrs. Zabrinski obtained a delicious green-apple pie from a bakery near by and served it for our delectation. \n \n I find that already the noble lines, with their beautiful lights and shadows, in the Court of[Pg 176] Honor of the White City are blending into an indistinct memory; but the picture of Anton Zabrinski as he leaned back in his chair on the steamer, breathing the delicious pure, fresh air, sweeping his glance across the boundless plain of undulating blue, will be with me forever. Here at last was freedom! And how eagerly the boy\u0027s perishing being drank it in! \n \n There was everything going on around us to divert and amuse: crowds of people, of course, and a noisy band of musicians; but it all made no impression upon Anton. We two were practically alone with the infinite sky and the far-stretching water. It was easy then for Anton to tell me of his deeper thoughts, and to speak of the change that he knew was coming soon. Life had been so hard, only fruitless effort and a losing battle, and now he longed only for rest. He had felt the desire to give expression to beautiful form, he had felt the stirring of undeveloped creative power. We spoke of the future not as death but as the coming of new life and as the opportunity for the fair unfolding of all the higher possibilities of his nature—as freedom from all fetters. His faith, simple but serious, rested upon his consciousness of having, in his inmost soul, loved[Pg 177] and sought the good. His outward life was hopelessly wrecked; but he was going away from that, and it was his soul, his true inner life, that would appear before God. It was all a mystery and he was helpless, but he was not afraid. He had forgiven life. \n \n As we talked together the steamer neared the pier at Jackson Park. \"And now, Anton, you must go to the other side of the boat and see the beautiful White City,\" I said. It was like alabaster in its clear loveliness that radiant morning, and all alive with the lilting colors of innumerable flags. It was Swedish day, and a most gorgeous procession in national costume thronged the dock as our steamer approached, for we had on board some important delegation. A dozen bands were playing and the grand crash of sound and the brilliant massing of color thrilled me to my fingertips. But Anton only looked at it for a moment with unseeing eyes: it was too limited; it was the stir and sound and crowd of the city. He turned again eagerly to the great sweep of sky and water; \"You don\u0027t know what this lake and this fresh air are to me,\" he said quietly, and he looked no more toward the land until we had returned to Van Buren Street. \n \n [Pg 178] \n \n After we left the steamer Anton threw off the spell of the water. He insisted on my taking a glass of soda with him from one of the fountains on the dock; it was his turn to be entertainer now. I drank the soda and live to tell the tale. By that time we had caught the bohemian spirit of the World\u0027s Fair, Anton was revived and excited by the hour on the water, and as we crossed over to Michigan Avenue the brilliant life of the street attracted and charmed him, and I proposed walking slowly down to the Auditorium Hotel. Every step of the way was a delight to Anton, and when we reached the great hotel I waited in the ladies\u0027 reception-room while Anton strolled through the entrances and office, looking at the richly blended tones of the marbles and the decoration in white and gold. I knew that it would be one more fresh and lovely memory for him to carry back to the little rooms where the brief remnant of his life was to be spent. \n \n At an adjoining flower-stand we found sweet peas for his mother. I saw him safely on board the car that would take him to his home; then, with a parting wave of his hand and a bright, happy smile of farewell, little Anton Zabrinski passed out of my sight. \n \n [Pg 179] \n \n Through the kindness of a friend I had the very great happiness of sending Anton a pass, \"For bearer and one,\" that gave him, with an escort, the freedom of the World\u0027s Fair steamers for the summer—the greatest possible boon to the boy, for even when too weak to go to the steamer he could still cherish the expectation of that delight. \n \n Anton\u0027s strength failed rapidly. He wrote me one letter saying: \"I can die happy now that I am with my mother. I thank you a thousand times over and over for your kind feeling towards me and the kind words in your letters, and the charming rose you sent. I cannot write a long letter on account of my pains through my whole chest. I can\u0027t turn during the night from one side to another. Dear Friend, I don\u0027t like to tell my misery and sorrows to persons, but I can\u0027t help telling you.\" \n \n Another letter soon followed, but not from Anton. It was the sister who wrote: \n \n \"Dear Friend: \n \n \"With deep sorrow I inform you of my dear brother\u0027s death. He died at four o\u0027clock in the morning. He had a great desire to see you [Pg 180]before he died. We should be glad to see you at the funeral if convenient Wednesday morning. \n \n \"Pardon this poor letter \n \"from your loving friend \n \"Miss Nina Zabrinski.\" \n \n FOOTNOTES: \n \n [8] These \"solitary\" cells in which a prisoner passed his first night were in a detached building in which the punishment cells were located. The solitude was absolute and terrible. \n \n [9] The striped convict suit was practically abolished at Joliet the following year. \n \n [10] This young man, Edmund M. Allen, is now warden of this same prison, and has so developed the humanizing methods of his father as to bring Joliet penitentiary into the front rank of progressive prison reform. \n \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1931/55434.html","bookId":878,"book":{"id":878,"title":"The Man Behind the Bars","description":"简介： Lest any one may charge me with extravagant optimism in regard to convicts, or may think that to me every goose is a swan, I wish to say that I have written only of the menamong hundreds of convictswho have most interested me; men whom I have known t...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1931","creation":"Aug 1, 2019 12:23:47 AM","modification":"Aug 1, 2019 12:23:47 AM"}}
