{"id":63420,"no":30,"title":"Page 30","content":"“There’re three,” I whisper to Sarah. She’s standing next to me, her back against the wall. “They must be the vat-grown ones Malcolm was talking about. Pale and ugly, as usual.” “What’re they doing here?” “Don’t know,” I reply. “But they’re easy targets.” “I didn’t bring a gun on our date,” she whispers back. “I should’ve known better.” “It’s okay,” I tell her. “They haven’t spotted us.” Sarah looks down at my hands. “We can’t just let them do whatever they’re doing, can we?” “Hell no,” I reply, realizing that my fists have clenched. For once, I’ve got the drop on Mogadorians. I want to know what they’re up to. No more running scared. “If things go bad, you run for help.” “Things won’t go bad,” Sarah says firmly, and confidence flows through me. “Light those assholes up.” I step into the alley and walk right towards the Mogs. Their hollow eyes focus on me in unison. For a moment, that old familiar chill runs through me, that fugitive feeling. I shove it down; this time, I’m choosing fight over flight. “You guys lost?” I ask casually, striding closer. “Get outta here, kid,” one of them hisses, flashing a row of tiny teeth. The Mog next to him opens up his coat, showing me the handle of a blaster tucked into his pants. They’re trying to scare me off like I’m just some human taking a really ill-advised shortcut home. They don’t recognize me for what I am. That means whatever they’re doing here, it isn’t hunting me. “Getting kinda chilly,” I say, stopping about ten yards away from them. “You warm enough?” Without waiting for a response, I trigger my Lumen. A fireball swirls into existence over my palm and I lob it at the closest Mog. He doesn’t even have a chance to react before it envelops his face, lighting him up like a matchstick for a moment before he disintegrates to ash. The second Mog at least manages to reach for his blaster but that’s as far as he gets. I hit him with a fireball right in the chest. He lets loose a short scream and then joins the first Mog as dust on the dirty alley ground. I don’t hit the final Mog with my Lumen. He’s the one holding that envelope and I don’t want to risk torching it. I want to see what the Mogs are after, what secret mission has these Mogadorians skulking around Chicago. He stares at me, almost as if he’s waiting for me to dispatch him as easily as I did the others, the envelope clutched to his chest. When he realizes that I’m hesitating, he takes off, sprinting down the alley. A Mogadorian running from me. Now there’s a welcome change of pace. I grab the Dumpster with my telekinesis and launch it at the Mog before he can get too far. The Dumpster’s metal sides screech as they grind against the alley wall. It hits the Mog and pins him up against the wall, his bones crunching. “Tell me what you’re doing here and I’ll make this quick,” I say, walking over to him. To demonstrate, I put a little telekinetic pressure on the Dumpster, grinding it farther into his mangled body. A bubble of dark blood dribbles down the Mog’s chin. His scream of frustration and pain makes me hesitate. I’ve never done anything like this before. The Mogs I’ve killed have all been quick and in self-defense. I hope I’m not going too far. “You—you’re all going to die,” spits the Mog. I’m wasting my time. I’m not likely to learn anything important from some lowly scout. I shove the Dumpster one last time with my telekinesis, finishing him off. Then I pull the Dumpster away from the wall and pluck the envelope from the pile of Mogadorian ash. I turn it over in my hands—it’s stuffed with papers. “What is it?” Sarah asks, approaching cautiously from the mouth of the alley. I light up one of my hands so I can see the papers in the darkness. I’m holding three pages covered in rigid script that looks like a cross between hieroglyphics and Chinese. Written in Mogadorian, of course. I guess it’d be too lucky to catch the Mogs sending secret orders in English. I hold up the papers so that Sarah can see. “Know any good Mogadorian translators?” I ask. Back at the penthouse, I gather everyone in the dining room to describe my encounter with the Mogs. Nine pats me on the back when I get to the part about killing the three Mogadorians. “You should’ve brought that last one back here,” he says. “We could’ve tortured something out of him like they did to us.” I shake my head. I glance over at Sam, who has begun surreptitiously rubbing his scarred wrists. “That’s not what we do,” I say. “We’re better than that.” “It’s a war, Johnny,” Nine replies. “What does this mean?” Marina asks. “Do they know where we are?” “I doubt it,” I say. “If they were here for us, they’d have sent more than three. They didn’t even recognize me when I approached.” “Yeah, and you’re a famous Mogadorian killer,” says Eight. “Weird.” “They’d have come by now if they were coming,” Six adds. “They aren’t exactly known for their subtlety. We need to figure out what these papers say. It could be some kind of invasion plan.” “Just like my dream,” whispers Ella. The papers in question are being passed around the table, everyone taking a look at the meaningless symbols on the pages. Malcolm takes the papers, frowning. “I spent time in captivity, but I never learned their language.” “Pretty sure there’s some translating software on Sandor’s computer,” offers Nine. “Doubt it has Mogadorian, though.” Malcolm runs a hand over his beard, still looking over the papers. “There are patterns here, like with all languages. This can be cracked. If you show me that software, I may be able to use it.” Everyone around the table looks nervous. It’s the first whiff of the Mogadorians we’ve had since battling them in Arkansas. “This doesn’t change anything,” I say. “Whatever is in those documents, I’m sure it’s something the Mogadorians don’t want us to know. It’s something we can use to our advantage. But, until we know for sure, we press on with the plan we’ve already made. Get some rest, everyone; we leave for Florida in the morning.” CHAPTER TWENTY-NINE I STAND OVER MY FATHER’S SHOULDER AS HE scans the Mogadorian documents into Sandor’s computer system. Once the documents are scanned, my dad loads up some translating software along with some kind of hacker program that’s supposed to be able to crack through firewalls and crap like that. “Do you think you’ll be able to translate it?” I ask. “The first step was figuring out which program to use.” “And did you?” I notice that my dad’s opened and minimized a copy of iTunes. I tap the screen. “Were you going to listen to some music?” “I—they didn’t have iTunes when I was taken. I thought it might . . .” My dad shrugs self-deprecatingly. “I’ll admit to some trial and error, okay?” “So now what?” “I’m approaching it from every angle. All languages—even alien ones—share some commonalities. It’s just a matter of isolating one and using it to decode the rest of the writing.” He looks over his shoulder at me. “This is pretty boring stuff, Sam. You don’t need to keep me company.” “No, it’s cool,” I say. “I want to.” “Really?” he asks, looking me over. “It looks to me like you had other plans.” Observant as always. I’m dressed in what passes as my best outfit considering I’ve only got like three options. It’s just a boring gray sweater and my least grungy pair of jeans. I’d been psyching myself up to do like John said, to try to have a conversation with Six about my feelings, carpe diem and all that. This latest crisis, even if it just involves paperwork, is a pretty good excuse to put that off. “They can wait,” I say lamely, making a show of studying the computer screen as various language samples scroll by. “Hmm.” My dad smiles gently, looking back to the screen himself. “You know, they’re off to Florida tomorrow. After that, there will surely be another mission. And who knows what intel we might glean from these documents. A lot happening.” “What’s your point?” “It might be awhile before we have another quiet night like this one,” he says. “Don’t put it off, Sam.” I find Six on the penthouse roof, which is apparently the hot spot for Garde who want to be alone. It’s night and the wind is stronger up here than normal, probably on account of Six messing with the weather. Both her hands are raised and as she moves them back and forth the sky responds; it reminds me of art class, the way paint would swirl together when we mixed watercolors. Six is doing that to the clouds. If there are any weathermen watching the skies tonight, they’re probably pretty freaked out. I don’t say anything at first, not wanting to interrupt. I stand next to Six and watch her, the wind whipping her black hair across her face, bathed in the blinking red lights that line the roof. There’s a small smile creeping up on the corners of her mouth. If I didn’t know her better, I’d say Six was actually feeling content. Slowly, almost like she regrets stopping, Six lowers her hands and looks at me. The wind dies down immediately, the clouds resuming their normal lazy course across the night sky. I feel like I’m interrupting something. “Hey. You didn’t have to stop.” “It’s cool. What’s up?” she says. “Did your dad figure out those documents already?” “Um, no, nothing’s up. I just wanted to talk to you.” “Oh,” Six replies, looking back up at the sky. “Sure.” “It’s no big deal,” I say hurriedly, feeling stupid. “You can go back to practicing or whatever. I’ll leave you alone.” “No, stay,” she says suddenly. “Being cooped up in that penthouse all the time is hard for me. Ever since I developed this Legacy, I’ve felt connected to the weather. I like to keep in touch with it, if that makes sense.” “Yeah, totally,” I reply, as if I understand the first thing about being connected to the weather. “You did really great in training today. I’m sorry I screwed up.” “Come on, Sam,” she says, rolling her eyes. “Enough apologizing already. Is that really what you came up here to talk about?” “No,” I reply, sighing. Screw it. I decide to just take John’s advice and go for it. “I was wondering if you’d like to—uh, I don’t know—hang out sometime?” So, maybe not my smoothest attempt at asking someone out. Six playfully arches an eyebrow. “Hang out? We practically live on top of each other in there. We hang out all the time.”","sourceLink":"https://allnovel.net/the-fall-of-five-lorien-legacies-4/page-30.html","bookId":1678,"book":{"id":1678,"title":"The Fall of Five (Lorien Legacies #4)","description":"Storyline: The Fall of Five (Lorien Legacies #4) The Garde are finally reunited, but do they have what it takes to win the war against the Mogadorians? John Smith—Number Four—thought that things would change once the Garde found each other. They would stop running. They would fight the Mogadorians. And they would win. But he was wrong. After facing off with the Mogadorian ruler and almost being annihilated, the Garde know they are drastically unprepared and hopelessly outgunned. Now they’re hiding out in Nine’s Chicago penthouse, trying to figure out their next move. The six of them are powerful, but they’re not strong enough yet to take on an entire army—even with the return of an old ally. To defeat their enemy, the Garde must master their Legacies and learn to work together as a team. More importantly, they’ll have to discover the truth about the Elders and their plan for the Loric survivors. And when the Garde receive a sign from Number Five—a crop circle in the shape of a Loric symbol—they know they are so close to being reunited. But could it be a trap? Time is running out, and the only thing they know for certain is that they have to get to Five before it’s too late. The Garde may have lost battles, but they will not lose this war. Lorien will rise again.","cover":"https://allnovel.net/images/the-fall-of-five-lorien-legacies-4.jpg","author":"Pittacus Lore","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-fall-of-five-lorien-legacies-4.html","creation":"Oct 5, 2019 8:57:51 AM","modification":"Oct 5, 2019 9:50:26 AM"}}
