{"id":50721,"no":1024,"title":"Book 30, Chapter 2 - Danger Lurking Everywhere","content":"The Eastroad Territory. The Eastroad Everworld. A black flying vessel was soaring through the air above the Eastroad Everworld. “The territories controlled by the Dao Alliance will generally have spacetime transfer arrays within the everworlds.” Pillsaint stood at the prow of the ship, staring at the vast everworld before him. He sighed, “But the Eastroad Everworld doesn’t have a single one. We had to fly for years to get to this place.” Ji Ning chuckled. It was true that all ordinary everworlds had spacetime transfer arrays. The Badlands Everworld, the Vastheaven Everworld… they all had one. But the Eastroad Everworld did not! It had taken them three years of hard flying after entering the Eastroad Territory before they reached this everworld. “Let’s go to Eastroad City first,” Ning said. Swoosh! The flying vessel tore through space, blinking through it as it advanced rapidly. A short while later, the most bustling city within the entire Eastroad Everworld, ‘Eastroad City’, appeared within their field of vision. This was an extremely large city with many cultivators in it. “Restrain your auras, the three of you,” Ning instructed. “Especially you, Naia. You are a Daolord of the Fourth Step; your aura is going to scare these ordinary cultivators silly.” “Yes, Master,” Daolord Naia said respectfully. As a Daolord of the Fourth Step, her aura was as vast and boundless as the heavens themselves. With each step Daolords took, they trod the line between life and death. With each breakthrough, their auras would undergo fundamental transformations! Daolords of the First Step and Second Step were fairly weak, and so even if their auras emanated outwards they would at most caused World-level cultivators to feel a sense of pressure. But a Daolord of the Fourth Step would cause them to absolutely quiver in fear! Whoosh. The flying vessel soared downwards. A short while later Ning put it away, leading Naia, Pillsaint, and Su Youji towards the gates of the city. There were twelve World-level cultivators at the gates who were standing in two groups to each side, watching the cultivators enter Eastroad City. “They seem very cautious.” Ning was a bit surprised. “It might be because this is a borderlands territory, which is why their cities are so strictly guarded,” Su Youji sent mentally. Ning and the others chatted casually as they entered the city gates. When the twelve World-level cultivators noticed Ning’s group of four, their leader’s face tightened. The leader gestured to a subordinate and said, “Report immediately that four suspicious Daolords have appeared in Eastroad City.” “Understood.” This subordinate had a clone and so was able to immediately report this to the main sect. …… Ning began to frown as he walked through Eastroad City. “Something is wrong.” Ning could sense that the mood in this city was off. Many of the cultivators were clearly speaking privately to each other through mental messages. Although Ning couldn’t tell what they were saying, he was able to tell that they were doing this. Ning swept the area with his gaze, only to see several distant Elder Gods and Ancestral Immortals who seemed to be sending stealthy mental messages to each other. Ning immediately sent out his godsense, covering them with it. Although he was now a Daolord with powerful godsense, if he tried to use it to scan World-level cultivators they would probably notice something was off. Once they did, they would definitely stop talking. “The Eastroad Sect is finished.” “Right. The mighty Eastroad Sect is about to be annihilated, just like that. What a shame.” “I heard from Master that the founding Patriarch of the Eastroad Sect, ‘Daolord Eastroad’, is already dead. He was someone who stunned and awed the surrounding territories and ruled over the Eastroad Territory for countless years… but he died, just like that.” “Logically speaking, the Eastroad Sect should’ve hidden the news that Daolord Eastrod had died. How could word have spread so quickly?” “Who knows? There has to be some sort of plot behind it. However, the news of him being dead is probably true. Otherwise, the Eastroad Sect wouldn’t act in such a craven fashion.” This was what the Elder Gods and Ancestral Immortals were quietly whispering to each other. When Ning heard this, his face tightened. What? The information had already leaked out? Factoring in the time they had taken to travel to this place, Daolord Eastroad had died roughly two thousand years ago. To cultivators, two thousand years was an extremely short period of time. Logically speaking, there was no way the Eastroad Sect would’ve so foolishly spread word of this. They would’ve done their best to hide it for as long as they could… but now, even Elder Gods and Ancestral Immortals knew of it. It seemed as though word had spread long ago. “The two of you.” Ning suddenly intercepted two nearby World-level cultivators. With but a thought, he completely sealed off the surrounding area while covering them with a flicker of his murderous sword-intent. However, none of the nearby cultivators were able to even see this happening. “S-senior.” The two World-level cultivators were so frightened, their legs went soft. One could imagine how terrifying Ning’s sword-intent was. Their hearts quivered just having that sword-light flicker around them. “Master?” Su Youji, Pillsaint, and Naia were all rather puzzled. “You’ll know shortly,” Ning said, then cast his gaze towards the two World-level cultivators before him. “Tell me, what has happened recently in the Eastroad Territory?” “Senior, did you just arrive here?” The shorter cultivator said hurriedly, “Something major truly has happened. Roughly one or two thousand years ago, it was suddenly reported that Daolord Eastroad, who ruled over the Eastroad Territory for countless years, has already perished.” “Who made the report?” Ning asked. One or two thousand years ago? So roughly eight hundred years after his death, the word had been leaked already? “I don’t know the answer to that,” the short cultivator said. “You don’t know?” Ning frowned, sending a strand of his baleful intent towards the two. The nearby tall and skinny cultivator hurriedly said, “Maybe the Ninedust Sect!” “Right!” The shorter cultivator hurriedly agreed, “It is very likely that this information was leaked by the Ninedust Sect. The Ninedust Sect has been applying a great deal of pressure in recent years. It seems as though they intend to take over the Eastroad Territory.” “The Ninedust Sect?” Ning was startled. Daolord Eastroad had established the Eastroad Sect and then unified this territory, but the surrounding area was still quite chaotic. There were a number of powerful organizations here, with the most dominating one being the Ninedust Sect. The Ninedust Sect already had nine Daolords when it was first established! By now, its sectlord and three of its vice sectlords were all Daolords of the Fourth Step. However, Daolord Eastroad himself was so overwhelming powerful that the Ninedust Sect was unwilling to offend him, even though they didn’t fear him. “The Ninedust Sect has been causing a great deal of trouble during the past thousand years, and the Eastroad Sect actually lost one of its Daolords during this period of time. It now only has a single Daolord left,” the short cultivator said. “Another Daolord of the Eastroad Sect died?” Ning’s face tightened. “Which one?” The Eastroad Sect originally had three Daolords; Daolord Eastroad, Daolord Overgold, and Daolord Thunderheat. Daolord Overgold and Daolord Thunderheat were Daolords of the Third Step, with Overgold being a bit stronger. “It was Daolord Overgold who died,” the shorter cultivator said. “I heard that he died while adventuring, but for him to die just a few centuries after word spread of Daolord Eastroad’s death… how could there be such a coincidence? It is very likely that the Ninedust Sect sent out major powers to kill him outside.” “So that means the Eastroad Sect only has one Daolord left?” Pillsaint was rather flabbergasted, while Ning, Su Youji, and Naia were all rather surprised as well. This had originally been a fairly simple mission, because Daolord Overgold was quite strong; with the formation around their headquarters helping them and some treasures Ning’s group was bringing, he should’ve been able to keep himself alive. Now it seemed the situation was much worse than they had imagined. “The two of you can leave now,” Ning said. He didn’t really care if these two World-level cultivators told others of this conversation.” “A-a-alright,” they stuttered. Ning, Su Youji, Pillsaint, and Naia were all rather irritated and frustrated now. “This is going to be a bit more tricky than we expected.” Ning frowned. “Word of Daolord Eastroad’s death spread less than eight centuries after he died. There’s no way the Eastroad Sect itself would’ve been so foolish as to leak this information. An enemy must have done it, after they acquired this information through Numerancy divination or other intelligence-gathering methods. A short while later, Overgold died while adventuring as well. It might’ve been an actual coincidence, but it’s also possible that he was murdered. If he was murdered… then the real goal was to further weaken the Eastroad Sect.” “Right.” Pillsaint, Su Youji, and Naia all felt irritated as well. “Let’s gather some more information first.” Ning continued to advance through Eastroad City, and the more he investigated the more he learned. The Ninedust Sect really was about to take over the Eastroad Territory, and the Eastroad Sect really did only have Daolord Thunderheat protecting it. …… Half a day later. “For now, go into my estate-world. Otherwise… if multiple Daolords pay a visit, with one being a Daolord of the Fourth Step, the Eastroad Sect will probably be frightened. They are no doubt quite nervous right now,” Ning said to Su Youji and the others. “Yes, Master.” Su Youji and the other two acknowledged the order. After they entered the estate-world, Ning flew by himself through the air towards the Eastroad Sect. Just a short while later, the skies around him turned dark as multiple layers of formations around the Eastroad Sect were activated in a dazzling, awesome display of multicolored light. Ning soon flew to the main gates of the Eastroad Sect, where he was forced to come to a halt. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-30-chapter-2","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
