{"id":50783,"no":1086,"title":"Book 32, Chapter 4 - Flight","content":"“Absolutely terrifying. How could he be as strong as this?” As Daolord Feiting fled, his mind was filled with horror and shock. In truth, he was also quite strong. He was a second-tier Daolord who had reached an extremely high level in the Dao of Wind, and in battle his movements were inscrutable and ghostly. His sword was similarly fast and unpredictable. And yet, just now when he had battled against Ji Ning, he had found himself at a complete disadvantage. During their first clash, Ning had used the [Dreamstar] art against him, not even giving him a chance to use his agility techniques. Right after that, Ning had hit him with a sword-blow. During the second clash, Ning hadn’t used the [Dreamstar] art. They had competed in close combat alone… and it had only taken Ning two strikes! After twelve clashes of sword-light, Daolord Feiting had been completely defeated! It was clear that the disparity in their close combat skills was simply enormous, and Ning’s sword-stab against his lower jaw had completely dazed him. Yes. He had been completely dazed. For a brief instant, he had essentially lost consciousness. Normally, in a battle between two experts who were on the same level, one wouldn’t be knocked unconscious by just a few strikes! “The power of that stab of his was simply incredible. There should be few to no second-tier Daolords capable of enduring such a hit.” “Brother Feiting, what happened?” Daolord Incense Dragon had been attacking with magic treasures from afar. He said anxiously, “Why did you run? Our original plan was for you to fight him in close combat and me to assault him from afar with my treasures.” “Screw the plan. I’m no match for him at all. Even when he doesn’t use heartforce, there are few to no second-tier Daolords who are a match for him.” Daolord Feiting was both nervous and infuriated by what had happened. He sent mentally, “I was actually knocked unconscious by him just now.” When the force of a blow exceeded one’s ability to endure it, one would be instantly dazed and rendered unconscious for a brief moment. In truth, although Ning’s sword-arts were quite powerful and his close combat skills were formidable, he really wasn’t powerful enough to produce this effect by himself. It was primarily because the Northbow swords were perfectly suited to the Blood Drop stance that the power of this particular attack was so great! If Ning had a Universe treasure, he would instantly become at least ten times more powerful than before! Ning’s Northbow swords, after having absorbed a veritable sea of golden sand, had reached an apex in certain areas and had could be said to have reached the foundational level for a Universe treasure. As a result, his Blood Drop stance was more than five times more powerful than it had been in the past. “Hurry up and run! I can’t stop him either,” Daolord Incense Dragon said. Boom! Boom! Boom! Ning sped towards them at high speeds, bursting through and scattering the thousand golden pearls and the formation-diagram they had formed. Next, Ning charged straight towards Daolord Incense Dragon and Daolord Feiting. “Fiendqueen!” “Fiendqueen!” Both of the Daolords began to run while sending mental pleas to Fiendqueen Dustrain. “Darknorth is too powerful. The two of us cannot stop him!” “Fiendqueen, we can’t hold him any longer.” …… If the battle between Ning and the two Daolords could be described as a lopsided affair, the battle between the Fiendqueen and the Ninedust Sectlord could only be described as a fierce one! Although the Fiendqueen was a woman, her attacks were clearly more overbearing and dominating, with her close combat skills more perfected. Her hands fluctuated through many different attacks, including finger-arts, palm-arts, and fist-arts. As for the Ninedust Sectlord, he was also quite fierce and valiant. Whenever he was in a tight spot, he would immediately use his forbidden divine ability. As an Ancient cultivator, his divine body was simply far more powerful than that of any ordinary cultivators. When he also used that special divine ability? Although a common saying is that the higher a level you are at, the more important the Dao would be, his raw divine power was simply too brutal and explosive, generating an enormous amount of strength for him. In addition, this was the first time for him to fight against an expert on the level of the Fiendqueen. Thus, he was particularly excited and really went all-out, learning quite a bit from the fight as it progressed. “Fiendqueen, Darknorth is too powerful. We can’t hold him!” Daolord Incense Dragon and Daolord Feiting sent mental messages to her as they fled. “What!?” The Fiendqueen’s face turned pale. Even when the two worked together, they still weren’t a match for Darknorth? “Damn. Damn!” The Fiendqueen glared at the Ninedust Sectlord. She knew that there was nothing she could do against this Ancient cultivator. Although she was one of the truly top-tier Daolords and thus didn’t worry about most Ancient cultivators, Ninedust wasn’t just an ordinary Ancient cultivator, he was one whose Dao was incredibly powerful, making him a tough foe. “Let’s go.” The Fiendqueen turned and charged straight towards Ning’s direction. “She’s running?” The Ninedust Sectlord was startled by this. Unable to make it to Ning in time, he immediately sent mentally, “Careful, Darknorth! Fiendqueen Dustrain is headed straight for you.” Ning had already exerted his heartworld projection and thus had a clear picture of the world around him. He didn’t panic in the slightest as the Fiendqueen charged towards him; instead, he felt slightly excited. “Come.” Ning turned and waited calmly for the Fiendqueen’s arrival, his Northbow swords at the ready. “You overestimate yourself. Die!” The Fiendqueen chopped out with her two crystalline palms, which descended towards Ning while blocking out the skies above him. Swish! Swish! Two streaks of sword-light, emanating a terrifying sword-intent of complete annihilation, instantly struck head-on against those two giant crystalline hands. BOOM! Ning was sent flying backwards. When he landed on the ground, he still stumbled three steps backwards before he stabilized himself. He narrowed his eyes, his body still shaking from that blow. “He took it head on?” The Fiendqueen had sensed a terrifyingly sharp force seeking to pierce through her palms and into her body, but she was able to endure it with ease. She stared at the distant white-robed youth and his two golden swords, a look of surprise in her eyes. “I launched those two palm attacks with nearly full power, but he actually took it head-on.” “Don’t run!” The Ninedust Sectlord was in hot pursuit from behind. “Hmph.” The Fiendqueen let out a cold snort, then quickly fled off into the distance as the fiery red globe in the skies flew towards her as well. …… The two of them didn’t elect to pursue her. After the Fiendqueen, Daolord Incense Dragon, and Daolord Feiting fled a suitably far distance, they began to slow down. The Fiendqueen glanced at the red globe in her hands, then said in a cold voice, “Most of its power has been used up. Roughly thirty million cubes of chaos jewels was used up.” This precious fiery globe was something which she had traded away an incredibly valuable bottle of spirit-pills for, all for the sake of acquiring the Voidsea Jadeseals! That bottle had only held a total of three pills within it, and she had acquired it thanks to a stroke of good fortune when roving the Terror Starsea. The fiery globe could only be activated directly by Hegemon-level Immortal energy. The only other option was to slowly charge it using chaos jewels, and it took a total of fifty million cubes to charge it up. However, it truly was tremendously powerful! “The two of you were working together. How did you end up being defeated that quickly?” The Fiendqueen glanced at the two Daolords. “Darknorth was simply too powerful. The two of us combined were still no match for him at all.” Daolord Feiting shook his head. “Even if five Daolords on our level joined together, we still wouldn’t necessarily be able to capture him. Just two of us? Forget it.” Daolord Incense Dragon shook his head as well. Darknorth was powerful in close combat and also a Heartforce Cultivator! He really was a tough foe to face and would be virtually invincible amongst his peers. “With those two around, it’ll be virtually impossible for us to capture Solesky.” The Fiendqueen let out a sigh. …… Ning and Ninedust simply stood there, staring at the three distant Daolords as they gradually disappeared. “What a delightful battle.” The Ninedust Sectlord was very excited. “I’ve never fought against someone on that level before. Delightful, simply delightful! But my staff-arts still need more work. If I can perfect them a bit further, I should be able to crush that Fiendqueen Dustrain. Haha, I’m already able to fight her to a standstill as is! I guess that means I should be ranked within the top seven in the Endless Territories.” “But… where did she find that fiery globe?” Ninedust was puzzled. “Our intelligence reports didn’t indicate that she was in possession of such a powerful treasure. It was so mighty, it was able to resist both of our secret arts and your heartworld projection.” “Right.” Ning nodded. “It’s probably something she prepared specifically for this mission to acquire the Voidsea Jadeseals.” As they spoke, they turned to move towards the distant forest. With the black mist gone, they were able to clearly see Daolord Solesky and Daolord Badlands within the forest grove. Daolord Solesky’s face was still deathly pale, and his aura was much weaker than before. “Big brother!” Ning called out loudly. Although Daolord Solesky looked exhausted, he was still in a wonderful mood. He laughed, “I saw everything! Badlands and I saw everything. Darknorth, Ninedust, the two of you truly are powerful. Fiendqueen Dustrain is famous throughout the Endless Territories, and she even had Incense Dragon and Feiting with her… and yet, in the end they were defeated by the two of you. When word of this spreads, quite a few people will be scared silly.” “Impressive.” Daolord Badlands looked at Ninedust. “Fellow Daoist Ninedust is an Ancient cultivator, correct? He was actually able to fight the Fiendqueen to a standstill. Incredible!” Ninedust nodded calmly. He was courteous to Ning, partially because he acknowledged Ning’s strength and partially because they had undergone many life-and-death experiences together. Ninedust was by nature an arrogant man; if you weren’t his friend, he wouldn’t pay any attention to you no matter how strong you were. Daolord Badlands was quite famous as well, but Ninedust really didn’t care that much about him. “Darknorth.” Daolord Badlands turned his gaze towards Ning, then sighed. “When we first met, you were an Elder God, right?” “Yes.” Ning nodded. Indeed, back then he had just left the Three Realms and had visited the Badlands Court alongside his big brother Solesky. He really was just an Elder God at that time! “No wonder I found it so difficult to use Numerancy to divine your destiny.” Daolord Badlands shook his head and smiled. “Badlands, big brother Solesky… how long will it take for you two to leave this formation?” Ning asked. Within the forest grove, Solesky and Badlands exchanged a glance. Good question. How were they supposed to leave? Entering the formation was fairly easy, but breaking it apart was much more difficult. They had chosen to hide themselves within this hard-to-break formation to avoid Fiendqueen Dustrain, and it had taken her many years with the aid of Daolord Incense Dragon, a formation master, in order to destroy the two outer layers. In the art of formations, Badlands and Solesky were inferior to Daolord Incense Dragon. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-32-chapter-4","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
