{"id":50809,"no":1112,"title":"Book 33, Chapter 2 - The Fruits","content":"Less than half a day after Winesage, Palace Lord Dawnstar, and Ji Ning joined forces to travel together, Ning received a message from his servant.\n “Master, I just received an order from the Hegemon.” The green-robed alien located within Ning’s personal estate called out respectfully to Ning. He was responsible for maintaining contact between Ning and the Brightshore Kingdom.\n “The Hegemon?” Ning asked.\n “Yes. The Hegemon ordered me to deliver a message to you,” the green-robed alien said respectfully.\n “Speak,” Ning said solemnly. In all these years, the Hegemon had only spoken to Ning twice. The first time was when the Hegemon had asked himself, Solewind, Greatjoy, and Firesurge to help protect Skyfire Brightshore on his journey to the alternate universe. The second time was when the Hegemon had given Ning that spacetime disc. Other than that, the Hegemon had never reached out to him.\n “The Hegemon said that aside from the Voidsea Jadeseals, the Crimsonwave Temple also contains many precious fruits. The Hegemon hopes for you, Master, to harvest as many of those fruits as you can. The more the better! After you do so, the Hegemon would be willing to buy them from you using either chaos jewels, chaos nectar, rare ingredients, precious Dao-seals, rare treasures… anything is up for trade.”\n Ning narrowed his eyes.\n “The Hegemon also said that any treasure within the Brightshore Kingdom is up for trade. In fact, he’ll also help you negotiate for treasures held by the other organizations, including Universe treasures! So long as you have enough fruit, the Hegemon will help you trade for them,” the green-robed alien said.\n “What?” No matter how calm Ning normally was, he was truly stunned now. Apparently the Brightshore Hegemon was absolutely willing to pay any price for the sake of the fruits within the Crimsonwave Temple.\n Of course, despite the enticing offer there was still no way for anyone to forcibly bind a Universe treasure. The Universe treasure had to approve of its next master! The Brightshore Kingdom’s Sword Palace already had a Universe treasure, the shattered sword in its storeroom. However, to date no one had been able to bind it or be acknowledged by it. Thus, in truth that Universe treasure was of very limited value.\n “The Hegemon emphasized for you to do your best to harvest as many of the fruits within the Crimsonwave Temple as you can,” the green-robed alien repeated.\n Ning pondered silently for a moment, then nodded slightly.\n ……\n Time went on, one day after another. Ning and the others continued to advance before finally, Ninedust completely recovered from the poisoning. In truth, he had already stopped screaming in agony by the ninth day of his torment. Clearly, his Dao-heart was slowly growing stronger in response to the agony, allowing him to repress the pain and prevent him from screaming by the ninth day.\n “Come, come, come! Brother Ninedust’s Dao-heart has been rendered truly incredible by this misfortune. In the future, your chances at the Daomerge shall be significantly better than they were before this. Cheers!” Palace Lord Dawnstar offered a toast.\n Aboard the flying vessel where Ning, Dawnstar, Winesage, Badlands, and Ninedust. They were seated in a circle and drinking together.\n In truth, this journey was quite an exhausting one for Dawnstar and Winesage. The closer they moved to Crimsonwave Temple, the more dangerous the path became, after all. Thankfully, Ning, Dawnstar, and Winesage all joined together. This alliance of the top three Daolords allowed them to advance much faster than they otherwise would have.\n “Haha.” Ninedust roared with laughter. “This was indeed a blessing in disguise for me. My Dao-heart was strengthened by quite a bit. However, to tell you the truth… when I think back to the torment I suffered, I would rather have gone without this ‘blessing’. Ugh. What torture that was! Right, Darknorth. Where’s Solesky? Where the hell is he? I have one hell of a bone to pick with that guy!” A cold light flashed through Ninedust’s eyes.\n “He’s succeeded in his Daomerge and gained eternity,” Winesage said with a sigh.\n “He gained eternity?” Ninedust stared.\n “Envious, right?” Palace Lord Dawnstar said. Clearly, he felt quite jealous as well.\n “Darknorth, how did he end up gaining eternity? Did he use up the Voidsea Jadeseal when we were fighting for our lives?” Ninedust immediately asked.\n “This is what happened…” Ning began to narrate the details of what had happened to Ninedust.\n Ninedust ground his teeth as he listened. “That son of a bitch. He entered a prajna-state, then went into a secluded meditation and attempted his Daomerge. There’s nothing wrong with that in principle, but he completely screwed me over.” Although he was still quite furious, the rage he felt towards Solesky didn’t blaze quite as hot as it had in the past.\n “He’ll definitely repay you for what he owes you,” Ning said.\n “Right, what happened after that? Your aura seems to be far more powerful than it was in the past! And how did you end up alongside Winesage and Palace Lord Dawnstar? What the hell happened?” Ninedust asked.\n “After you were hit by the poison, Darknorth immediately charged out to face those four supreme Daolords by himself… and he broke through to become a supreme Daolord as well, sweeping all four of them away! He beat Daolord Shaka and Daolord Snowjoy into a retreat, with the Kingfreak and Sectlord Timedream perishing to him,” Palace Lord Dawnstar said with a smile.\n “Whaaaat?” Ninedust was shocked. He couldn’t help but turn and smack Ning on the chest, then say with a laugh, “Not bad! You actually killed Kingfreak and Timedream? Nice, nice, nice! At least you took revenge on my behalf. Heeeey… doesn’t that mean you are now stronger than me?” Ninedust stared at him.\n “The current Daolord rankings have brother Winesage ranked as number one, Darknorth as number two, and me having fallen to number three,” Palace Lord Dawnstar said with a laugh.\n “The three of you are the top three Daolords of all the Endless Territories. I’m now the weakest one?” Ninedust rubbed his jaw, then glanced sideways at the nearby Badlands. “Oh wait. There’s one guy weaker than me here.”\n “My skills lie in the Dao of Numerancy, not in battle,” Daolord Badlands said calmly. “If I chose to go into hiding, you wouldn’t even be able to find me, Ninedust.”\n ……\n This group of Daolords continued their advance. More than a year went by, with them moving closer and closer to Crimsonwave Temple.\n The Endless Territories. Vastheaven Territory. Vastheaven Palace.\n “Darknorth.” A sonorous voice boomed out within Vastheaven Palace.\n “Eh?” The golden-robed avatar of Ning, along with the avatars of Emperor Solesky and Daolord Battlemaster, all flew into the air and into the skies. They saw a gold-furred alien slowly walk towards them, causing space to tremble and ripple around him like streams of water. He seemed to walk slowly, but his movements were terrifyingly fast, far faster than the movements of Daolord Shaka or the Radiant King. He reached Vastheaven Palace in the blink of an eye.\n “Milord Emperor…?” Ning spoke out.\n “Mind if we sit down to have a chat?” the gold-furred alien said.\n “Of course! Please come in and sit down, fellow Daoist.” Emperor Solesky’s avatar immediately felt a sense of pressure; clearly, this gold-furred alien was far more powerful than them. Soon, Ning’s avatar and Solesky’s avatar led the gold-furred alien into the palace.\n “My name is Goldisle,” the gold-furred alien said. “Solesky, now that you have become an Emperor, I’m certain that you’ll soon be paying a visit to the Palace of Immortals. Darknorth, as a supreme Daolord, once this matter in the Waveshift Realm is over you should also come pay the Palace of Immortals a visit. By then, you’ll both know who I am.”\n Ning and Solesky exchanged a glance. They knew that this person was most likely a high-ranking member of the Palace of the Immortals.\n “The foundation of the Palace of Immortals is far mightier than that of the other five powers.” The gold-furred alien looked at Ning. “Darknorth, based on my estimations, you should have already been contacted by Hegemon Brightshore of the Brightshore Kingdom. He probably wants those fruits in the Crimsonwave Temple very badly! I’ll tell you this – the Palace of Immortal wants those fruits just as much.”\n “Why can’t you go harvest it for yourself?” Ning asked.\n “Only Daolords are able to enter Crimsonwave Temple,” the gold-furred alien explained, then continued, “In truth, Crimsonwave Temple was sent here by Emperor Waveshift. It should technically belong to our Dao Alliance, but since Emperor Waveshift established a rule that only Daolords may enter, we shall follow the rules he set. The Dao Alliance has the most Daolords, and I am confident that we are able to pay the best price.”\n “Any treasure! We’ll make available any of the treasures within the Palace of Immortal’s treasury for you to choose from. So long as you have enough of the fruit, you can trade for whatever you wish.” The golden-furred alien continued, “Even if the treasure you seek is outside of the Endless Territories and is in the hands of other organizations in otherverses, we’ll work to help you find whatever it is you tell us you need, no matter how rare it is. But of course, you have to procure enough fruit for us.” The golden-furred alien looked at Ning.\n Ning felt stunned. This was one hell of a struggle!\n “I can promise to you that the Dao Alliance will give you a higher price than any of the other five organizations can offer.” The golden-furred alien smiled. “Based on what I know, Darknorth, you are quite talented in the [Heartsword] art as well, yes? Here’s a copy of the complete [Heartsword] sutra; consider it a show of sincerity from the Dao Alliance.”\n Ning was secretly amazed. Not at being given a free copy of the [Heartsword] sword-arts; although it was valuable, giving him a copy for free cost the Dao Alliance absolutely nothing at all. For them to know that he was skilled in the [Heartsword] sword-arts, however… this was impressive. It must be remembered that he had relied on the [Heartsword] sword-arts to attain the rank of Swordlord within the Sword Palace! Very few people even in the Brightshore Kingdom knew of this. The Dao Alliance’s intelligence network truly was incredible.\n “The Dao Alliance won’t force you to do anything. Let it all be of your own free will,” the gold-furred alien said with a smile.\n \n \n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-33-chapter-2","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.\n","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
