{"id":50819,"no":1122,"title":"Book 33, Chapter 12 - The Third World","content":"Winesage narrowed his eyes, then let out a smile. “Darknorth, I truly admire you. Without a Universe treasure and with just brother Ninedust assisting you, you were able to defeat all of these warriors… and then you gave the Voidsea Jadeseal to Ninedust!”\n The way in which Winesage viewed Ning had changed. During the last competition, the jade seal had ended up in Daolord Solesky’s hands. This time, Ning had been the main contributory to their victory against the black-armored general, but he had ended up giving the Voidsea Jadeseal to Ninedust! Winesage knew that if Darknorth was able to act in such a way despite the allure of the Voidsea Jadeseal, he would definitely be a friend worth making.\n “You were literally just a few seconds too late. Otherwise, Ninedust and I would’ve been in serious trouble,” Ning said.\n “Palace Lord Dawnstar and the others haven’t taken away their Voidsea Jadeseal yet. Why don’t we join forces to take it from them? Neither of us have any chance if we go by ourselves, but our chances are significant if we join forces. The fastest one shall be the one to win the Voidsea Jadeseal,” Winesage said.\n Dawnstar and the other four alone were enough to tie down Winesage! Once you added the three crimson-armored warriors and the black-armored general into the mix, it would be no easy feat at all. Even if he and Ning joined forces, they only stood a chance and were not assured of victory. The main reason why Winesage wanted to try working together with Ning was because he had decided that Ning was a friend worth making.\n “No need.” Ning shook his head.\n “You aren’t going to take part?” Winesage was surprised.\n “Not taking part,” Ning said.\n “Once someone ends up with the Voidsea Jadeseal, it’ll be a hundred times more difficult to pry it out of their hands,” Winesage said. Of all the Daolords present, the only one he cared about was Ji Ning.\n “No need to try and persuade me. I’ve already made up my mind,” Ning said.\n “Then I won’t force things.” Winesage transformed into a streak of light and flew towards Dawnstar’s direction at high speed. He was a supreme Daolord; a single Voidsea Jadeseal would only allow him to partially simulate the Daomerge. He naturally felt that the more seals he had, the better!\n In the eyes of Daolords, although the local fruit was valuable it was of no use to the Daomerge. None of those things truly mattered. The Daomerge was what supreme Daolords like Winesage cared about the most, and so they paid much less attention to the third world.\n “Let’s go.” Ning looked at Ninedust.\n “Are we really not going to take part? Darknorth, if we go we’ll at least have a chance,” Ninedust said. Now that he had acquired a Voidsea Jadeseal for himself, he naturally wanted to help Ning fight for one as well.\n “More and more supreme Daolords are arriving. What they can’t have, they won’t let others have either,” Ning said. “The fight over the last Voidsea Jadeseal will be a furious one; our chances are less than one in ten.”\n Ninedust argued, “But even if our chances are slim, we should still give it a shot.”\n “We can do that later. Push comes to shove, we can take it from the person who wins it.” Ning walked straight towards the throne. Ninedust nodded then followed him as well.\n Boom! A surge of power spread out from the throne and encompassed both Ning and Ninedust. Swoosh! The two of them vanished without a trace.\n ……\n There were a number of reasons as to why Ning had opted not to take part.\n First of all, there were simply too many supreme Daolords present. Even if they weren’t able to beat Ning, they’d be able to obstruct him.\n Second, Ning belonged to the Brightshore Kingdom. Brightshore Kingdom members had all sworn oaths not to fight against other members of the kingdom! Ninestone, Palace Lord Cloudwalker, Palace Lord Dawnstar… Ning wasn’t even able to battle against them! In a wild group melee like this, it would be like him fighting with a handicap. This further lowered his chances of winning a Voidsea Jadeseal.\n Third, the Voidsea Jadeseals were of very limited use to Ning. Once he became a Daolord of the Fourth Step, the power of his Omega Sword Dao would reach an incredibly terrifying level; most likely, the Voidsea Jadeseal would only be able to simulate a tiny, tiny portion of the Daomerge for his Omega Sword Dao. Other supreme Daolords would be able to simulate half of the Daomerge, which would be of invaluable assistance, but for Ning the benefit would be fairly minimal.\n Fourth, Ning cared more about reviving his wife Yu Wei. If he could reunite his family again, he’d be satisfied with merely living 108,000 chaos cycles! The Daomerge wasn’t something others could help him with, but saving Yu Wei was. He needed to acquire enough treasure so that he could ask some truly mighty figures to assist him! Given that even the Hegemons and the Dao Alliance had gone crazy over the fruits of Crimsonwave Temple, he naturally had to harvest as much as he could.\n Whoosh! Ning felt a cold breeze stir past him. He hurriedly inspected his surroundings.\n He stood atop a cold, ancient-looking stone island, and in front of him was an unfathomably deep abyss. A long, icy set of seven-colored chains stretched off into the distance, where it connected to another distant and levitating stone island. That second stone island had a gold-black octahedral command talisman levitating above it, with some strange runes right above it. Ning immediately recognized the runes as symbolizing the word ‘three’.\n Behind that stone island was yet another deep abyss. A tri-colored set of chains stretched out from the stone island and across the abyss to a sacrificial altar that had another command talisman at the bottom. This one had runes symbolizing the word ‘five’ hovering right above it. The altar had a series of steps leading up to it, and at the very top of the altar there lay a command talisman that had strange runes symbolizing the word ‘eight’ above it.\n “Three, five, and eight?” Ning was intrigued.\n “Darknorth, the Grovekeeper said that there are nine command talismans in total. The ninth one is the most valuable, with the second most valuable being the sixth, seventh, and eighth talismans. Next in value come the third, fourth, and fifth talismans, while the first and second ones are the least valuable,” Ninedust said. Ning nodded.\n Whoosh! Rainbow light coalesced next to them, resolving into the form of a white-robed man. It was Realmsoul Polo, and he smiled at Ning and Ninedust. “The two of you moved quite quickly. You came straight to the third world! The battle in the second world is still proceeding quite fiercely; given your power, the two of you might stand a chance.”\n “We’ve decided to try and acquire as much fruit as we can instead,” Ning said.\n “Alright.” Realmsoul Polo explained, “The rules in the third world are a bit different. Each Daolord can only choose a single corridor to proceed through.” As he spoke, he waved his hand and caused the mist at the horizons to vanish, revealing two other places. Once again they saw floating islands, abysses, and altars.\n “The third world has three passageways,” Realmsoul Polo said. “Once you enter one of the passageways, you cannot enter any of the other ones. This is a mechanism to prevent any single Daolord from acquiring too many of the command talismans.”\n Ning and Ninedust nodded slightly.\n “But can we take them from others by force?” Ning suddenly asked.\n “Haha. If you are strong enough to seize command talismans from other Daolords, go for it. I won’t mind even if you manage to acquire all of them,” Realmsoul Polo said. “The command talismans for these three passageways are of varying values, but on the whole the difference between the three passageways isn’t that great. Go ahead and choose one of the passageways. Oh! As the first to reach the third world, I’ll give you one piece of advice; the ninth command talisman is extremely, extremely valuable.” After speaking, the realmsoul let out a chuckle and vanished.\n “Darknorth?” Ninedust looked at Ning.\n “Let’s go take a look at the other passageways to take a look,” Ning said.\n “Let’s go.” Ninedust and Ning immediately transformed into streaks of light that flew towards one of the other passageways. Soon, they had passed through the other two regions and reached their destination.\n Ning and Ninedust possessed astounding ocularity clarity and were thus able to see the three command seals within this passageway right away. They were the first, the fourth, and the ninth.\n “The ninth talisman is here.” Ning said solemnly, “Then that means the final passageway holds the second, the sixth, and the seventh talismans.”\n The three passageways were separated thusly:\n The first passageway held the first, fourth, and ninth command talismans.\n The second passageway held the second, sixth, and seventh command talismans.\n The third passageway held the third, fifth, and eighth command talismans.\n “The total value in each of three passageways is roughly the same, but since the fruits harvested by the ninth command talisman ripen once every 100,000 chaos cycles, they are more valuable than all other fruits. The rarer a fruit is, the more irreplaceable it is,” Ning said. “I choose this passageway. I have to get the ninth command talisman.”\n After studying the [Seven Leafpill Chapters], Ning knew a great deal regarding the Dao of Alchemy. Some alchemical materials were interchangeable with others, with just the price being changed slightly. The rarer an item was, however, the more important it generally was as a principal ingredient.\n The ninth command talisman allowed the harvesting of the only fruits which ripened every 100,000 chaos cycles. Most likely, it was of the most interest to Eternal Emperors! They might be able to pay several times more than the ‘market’ rate for it. Ning’s hopes of reviving Yu Wei rested on this fruit.\n “Then I’ll choose the other tunnel, the one with the second, sixth, and seventh command talismans,” Ninedust said.\n “If we move separately, then…” Ning was a bit hesitant.\n “Don’t worry.” Ninedust smiled. “I have my invulnerable aquaform; no one can kill me! And every single Daolord can only choose a single passageway; if you choose this one, that means the two of us can at most acquire three of those talismans. If we move separately, we can perhaps acquire a total of six! Haha. So long as I acquire any of them, they’ll all belong to you, Darknorth! You helped me acquire the Voidsea Jadeseal; now, it is my time to help you acquire the command talismans. Although these things aren’t nearly as valuable as Voidsea Jadeseals to us Daolords, I really don’t have anything better to offer you. There’s no way I’m handing out the seal I acquired to anyone, you included.”\n \n \n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-33-chapter-12","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.\n","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
