{"id":50836,"no":1139,"title":"Book 34, Chapter 6 - Arrangements","content":"A full two years went by as the six major powers of the Endless Territories gathered the various treasures which Ji Ning needed, at which point in time Ning gave them the agreed-upon fruits. This was actually quite fast, given how vast the Endless Territories were. There were quite a few treasures which the three Hegemons and the various Eternal Emperors didn’t actually have on hand, with the collection process naturally taking some time. After acquiring all of the materials needed, Ning and Ninedust accompanied Hegemon Welkin on the journey. Whoosh. Ning, Ninedust, and Hegemon Welkin were seated within a dazzling deep-blue vessel that was flying through the darkness of space at high speeds. “Senior Welkin.” Ning glanced outside. They were now quite close to the Badlands Territory. “Can we halt for now?” “Hm?” Hegemon Welkin immediately brought the vessel to a halt. “I have a few things to take care of,” Ning said. “After going to this Stone Hellephant Wall and acquiring enough of the deepfire blackstone, Ninedust and I will continue our adventures. I need to make some arrangements for my retainers and take care of some things.” Ninedust had only recently become a Daolord of the Fourth Step. Although he had used a Voidsea Jadeseal, he still wasn’t confident in his Daomerge chances and thus had to continue his adventures. As for Ning himself, he wanted to acquire a treasure that was comparable to Crimsonwave Temple in value, so that he would be able to request an Autarch to revive Yu Wei. It must be remembered that Crimsonwave Temple was worth more than the total networth of an average Hegemon. If he wanted to acquire something like that… where else but through adventure would this be possible? “Alright.” Hegemon Welkin nodded. Ning took a single step out of the flying vessel and appeared in the empty space outside. He waved his hand. Whoosh. Four figures immediately appeared next to him. These were Su Youji, Pillsaint, Daolord Naia, and Daolord Bruteflame. The four retainers looked at Ning, then called out respectfully, “Master.” Ning looked at them, a rather complex look on his face. He said with a sigh, “You have all accompanied me for many years now. Youji, you started following me when I was an Elder God. Pillsaint, we met when we were World Gods in the Brightshore Kingdom…” “Master.” Su Youji couldn’t help but interject, “Why are you saying…” “Mm. I can sense that the places I am going to go visit are far too dangerous for you,” Ning said. “That last trip to the Terror Starsea was a good example, as was our visit to the Waveshift Realm. Both places were incredibly dangerous. If I survived them, you would be fine, but if I didn’t then you probably would’ve all died there.” Su Youji and Pillsaint seemed to want to say something. Daolord Naia and Daolord Bruteflame exchanged glances. “Pillsaint, for example, has chosen the path of the Dao of Alchemy. There’s absolutely no need for him to go out adventuring,” Ning said with a smile. “He should find a good place to peacefully train in alchemy. And you, Youji… by following me like this you yourself aren’t adventuring at all.” “As a result…” Ning looked at the four of them. “The four of you should all go out adventuring. If you wish to speak to me, go to Vastheaven Palace. My avatar will be there permanently.” “Oh, right. Take these treasures. You can consider them lifesavers.” Ning waved his hand, causing four gourds to fly out towards Su Youji and the others. Ning had won quite a bit from this trip to the Waveshift Realm. He had killed the Kingfreak, Sectlord Timedream, and quite a few second-tier Daolords… and had also gained many treasures from Winesage. As a result, he had a prodigious number of treasures on hand! Ning gave Su Youji the best treasures and Pillsaint the second-best treasures, with Daolord Bruteflame and Daolord Naia gaining the least. There was a difference in how much he cared about them, after all. “Master.” Su Youji and Pillsaint were rather unwilling to part from him, while Daolord Naia and Daolord Bruteflame were rather calm. The latter two had been alive for extremely long and had experienced many things. “Go,” Ning instructed. Su Youji, Pillsaint, Naia, and Bruteflame traded glances. In the end, they had no choice but to leave. They too understood that this was the best choice for them. “Pillsaint, where shall you go?” Su Youji asked. “I’m going to Vastheaven Palace,” Pillsaint said. “All I need is a place to concoct pills. Since our master’s avatar will be in Vastheaven Palace, that’s the best place for me.” “Mm. I’ll go there as well.” Su Youji nodded. Avatars shared the same thoughts and memories as true bodies, after all. Su Youji wanted to stay a bit closer to Ning if possible. …… Ning watched as Su Youji, Pillsaint, and the others left. With them gone, he relaxed slightly. Bidding them farewell was the most responsible thing he could do for them. Whoosh. Ning waved his finger, causing a blurry, rainbow spacetime tunnel to instantly appear in front of him. Ning took a single step into the tunnel, immediately vanishing. “Eh?” Ninedust, still seated within the vessel, glanced outside in surprise. Just a few moments ago, he had seen Ning bidding his four retainers farewell. Now, Ning had suddenly entered a spacetime tunnel and vanished. “Where’d he go?” Ninedust said with some surprise. “Off to take care of some random tasks, no doubt.” Hegemon Welkin was quite calm. “My guess is that Darknorth’s home is within the Badlands Territory, as we’re fairly close to it. Given his ability to transcend spacetime, he should be able to reach that territory in just a few seconds.” “Right.” Ninedust nodded. A few moments later, a rather mixed look appeared on his face as he murmured softly, “At least Darknorth has random tasks he needs to take care of and a beloved Dao-companion he has to revive. I… don’t seem to have any family, nor do I have a Dao-companion.” Ancient cultivators did not have parents, as they were born from the primordial chaos itself. A short while later… whoosh. A spacetime tunnel appeared, with a white-robed youth bearing a golden sheath on his back stepping out of it. “There you are.” Ninedust cast away his pensive thoughts and called out towards Ning. “Mm.” Ning nodded. Just now, he had paid a quick visit to his Primaltwin in the Badlands Territory. He had handed many of the treasures he had acquired within the Waveshift Realm over to his Primaltwin, as many of them were now of no use to Ning but of tremendous use to the Three Realms. There were many valuable pills, including the ‘Soleheart World Pill’ that could allow someone to forcibly break through to the World level. There were even Pseudo Samsara Pills that could allow someone to break through to become to Samsara Daolords! To truly powerful Daolords like him, these pills truly were nothing. Given Ning’s current status, for him to forcibly uplift a number of World-level cultivators was quite an easy task. However, he wouldn’t do so without cause. Only those who broke through on their own with hard work would be able to walk farther along their chosen paths. Those who made their breakthroughs via relying on Pseudo Samsara Pills to become Samsara Daolords were virtually guaranteed to remain Daolords of the First Step. “Sorry to have troubled you.” Ning looked at Hegemon Welkin. “I’ve finished everything I need to do. I can now go out with some peace of mind.” “I really envy youngsters like you.” Hegemon Welkin sighed. “Long, long ago, when I was still very weak, I had some friends who accompanied me as well. However… all of them died. None of them were able to succeed in their Daomerge. They died far, far too long ago… and I’m the only one left. That’s why I’ve gone out wandering through various realmverse and otherverses. Only by seeing many new places do I feel that life has any meaning.” Ning and Ninedust exchanged a glance. Indeed… in life, one needed to have goals. Otherwise, eternal loneliness would be a form of torment. Hegemon Brightshore, for example, was completely focused on his imperial clan and his descendants. Although it was tiring work, it gave him something to do. As for Samsara Daolords… they focused on adventuring and the Daomerge. To Eternal Emperors, their endless lifespans were a source of frustration. This was why many of them, such as Emperor Mirrorsnow and Emperor Heartsword, had ended up leaving and going off wandering. Their curiosity towards what else lay within the Chaosverse was what sustained them and gave them energy. “Actually… we Daolords envy you as well,” Ning said. “Right. Even in my dreams I fantasize about succeeding in my Daomerge and becoming a Hegemon,” Ninedust said. “Hahaha…” Hegemon Welkin laughed loudly. “Every single stage of cultivation has its own sights to enjoy. Life as a Samsara Daolord is one of the most glorious, exciting stages of them all. Work hard, youngsters. If you can break through to become Hegemons, we might meet again in the future.” “Might meet again in the future?” Ning was puzzled. “After I send you off to the Stone Hellephant Wall, I’ll leave and continue my wanderings,” Hegemon Welkin said. “Wandering through the Chaosverse and seeing everything there is to see… to me, that’s the most interesting thing there is. It’ll be a long, long time before I come back to the Flamedragon Realmverse. If you don’t become Hegemons, it’s unlikely that we’ll meet again.” “Right.” Ning and Ninedust both nodded. To someone who was as infinitely long-lived as Hegemon Welkin, 108,000 chaos cycles really was a short period of time. …… Hegemon Welkin once more took control over the flying vessel, sending it tearing through spacetime. As for Ning, he secluded himself within his own estate-world and began to train once more. It would take nine years to reach the Stone Hellephant Wall, after all. This would be more than enough time for him to grow significantly more powerful yet again! Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-34-chapter-6","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
