{"id":49812,"no":115,"title":"Book 6, Chapter 15 - Spare No One","content":"“Junior apprentice-brother Muse!” Dong Ziqi and the others, upon seeing Muse’s head go flying, all turned cold. Prior to this, two of their group of eight Zifu Disciples had been killed despite being in formation by Ji Ning. And now, their six-man formation…Ning had shattered their layered protections, and for him to kill them now was indeed quite easy. “Kill.” “Go all out against him.” The hawk-nosed man, the gray-robed elder, the black-robed female cultivator…they all seemed to have gone mad. It wasn’t that they didn’t want to flee; trapped within the grand formation of the Ji clan, where could they flee to? Only by staying here did they have a chance to live. “If you struggle, you’ll just die tired.” Ning walked forward, and the formerly savage, wildly coiling thick vines seemed to rapidly transform into nothingness. Swish! Swish! Swish! Swish! Swish! Swish! The rain dropped down like lines of silk. Within the rain, there were strands of [Lesser Thousand Swords Formation] sword light that had transformed into incomparably sharp ‘rain’. “Ahhh!” Although her body had been protected by that golden light, the black-robed woman’s eyes suddenly widened as a sword light chopped straight through her neck, sending her beautiful head flying. Yet another one had died! “Go die.” The Dao-seal in the hands of the gray-robed elder suddenly transformed into an enormous fiery phoenix which once more spread its wings and flew towards Ning. But a curtain of water formed from the rainwater around Ning blocked the advance of the fiery phoenix. Bang!!! An violent explosion blasted apart the watery curtain, and even Ning’s Waterflame Lotus trembled. Ning himself, however, continued to walk forward. “Die.” Ning stared at the gray-robed elder, whose face changed. He swung the banner in his hands backwards, because yet another strand of rain was striking towards him. Slash! A different strand of rain whipped past the gray-robed elder’s forehead, piercing straight through his head. His eyes were filled with a look of terror, shock, and rage…and then, he collapsed. “I simultaneously attacked you with two strands of sword light. Did you think you wouldn’t die?” With a thought, Ning then controlled the strands of sword light to strike towards the others. “Junior apprentice-sister Lu, senior apprentice-brother An, junior apprentice-brother Muse.” “Junior apprentice-sister Lu!” The remaining three, the hawk-nosed disciple, Dong Ziqi, and the skinny man, all had ashen looks on their faces. The six of them had lost three of their number in a flash! The power of those rain lines formed from sword light was simply too great, especially with the support of the formation and the Sword Domain. These were attacks of the Wanxiang Adept level. For them to face these attacks by themselves was impossible. “Ji Ning! You will definitely die!” Dong Ziqi had gone berserk. He stared at Ji Ning. “You killed the disciples of Snowdragon Mountain. Snowdragon Mountain will not let things end here!” “You will definitely die.” “Snowdragon Mountain has many more disciples. We will definitely eradicate your Ji clan.” The three of them had all gone berserk. Slash! Slash! The hawk-nosed man and Dong Ziqi were simultaneously sliced at by three lines of rain formed from sword light. If they had only been struck by a single flash of sword light, they would have been able to resist, but three lines of rain formed from sword light swirled about them. How could they resist? Their foreheads were pierced through, and their eyes became filled with terror, anger, and disbelief. “I, Dong Ziqi, am the number one expert of Swallow Mountain. I, I actually died in the hands of Ji Ning. I’m unwilling to accept this. I’m unwilling to accept this!!!” “Detestable, detestable! If I had known, I wouldn’t have come here.” The two of them had both been heroic figures of their eras. Actually, if it hadn’t been for the support of the Netherwyrm Heavenlock Formation, given that Ning only had early-stage Zifu-level energy, either of the two would have been able to battle with Ning for quite a long period of time. But with the support of the great formation, they died in a single exchange. “Snick.” The remaining person, the skinny man, had his neck severed as well, but then flesh grew out of his neck as it instantly healed. “A Fiendgod Body Refiner?” Ning lifted an eyebrow. “Ji Ning, can you spare my life?” The skinny man took a step back and looked at Ning. Although he was a middle-stage Fiendgod Body Refiner, he no longer felt any confidence. The difference in power between them was too great…with the support of the formation and the Rainwater Sword Domain, Ning absolutely had the power of a Wanxiang Adept. He could crush him!” Ning laughed softly. “Given how far this has gone, you tell me. Will I spare you?” Bang! The black wings on Ning’s back trembled, and he suddenly shot towards the skinny man. “Ji Ning!” The skinny man howled with rage as he gripped a long black staff in his hands. “Ji Ning, our Snowdragon Mountain will definitely annihilate your Ji clan and kill you!” Slash! Slash! Three flashes of sword light slashed across his body. Although the skinny man’s body was durable, he was still quadsected by the sword flashes of the [Lesser Thousand Swords Formation]. As for Ning, who charged towards him…the Waterflame Lotus swiveled around him, grinding down that skinny man, making it so that the man’s corpse was instantly ground into mincemeat. Although the mincemeat struggled to solidify into a whole, they were only able to resist the Waterflame Lotus for a few breaths before completely dissipating. The surrounding area was now completely silent. The rain still fell in a drizzle, and the Waterflame Lotus continued to slowly swivel back and forth. Ning, standing in the middle of the lotus, swept the surrounding area with his gaze. Dong Ziqi and the others lay fallen on the ground, none of them breathing, all of them dead. “Dead.” Ning said softly. “This group of Zifu Disciples has been completely exterminated. Only the other group of Zifu Disciples remain.” Two badges of Zifu Disciples from Snowdragon Mountain had entered the formation. The first batch of twelve Zifu Disciples had been completely annihilated! It wasn’t that they were weak; it was that Ning was too powerful! Although, for the Ji clan, even though they had the help of the Netherwyrm Heavenlock Formation, for them to kill these twelve was still quite hard. Prior to this, when Ji Truekeep and the old servant Ah Xing had tested their attacks, they found that aside from being able to kill those four people in the first ambush, they were no longer able to achieve much success after Dong Ziqi’s group of eight had set down their formation. As for Ji Ning, he was able to use the Netherwyrm Heavenlock Formation to make up for his own weakness in elemental energy. He also had the [Lesser Thousand Swords Formation] and his Rainwater Sword Domain, which allowed his power to reach the Wanxiang Adept level. And this was what had allowed him to crush them and slaughter them all… Halfway up the mountain. Ji Ninefire, in control of the Netherwyrm Heavenlock Formation, revealed a look of shock an amazement on his face. He was so excited, his entire body was trembling. “Patriarch?” The nearby Ji Yichuan looked at Ninefire. “Victory. Ji Ning won.” Ninefire was incomparably agitated. “Dong Ziqi’s group has been completely killed by Ji Ning. The first group of twelve Zifu Disciples of Snowdragon Mountain has been completely annihilated. None are left.” Yichuan, hearing this, felt his heart tremble as well. “The first group is completely dead?” “Right.” Ninefire nodded repeatedly. They were both excited as well as in a state of disbelief…they were merely the Ji clan, after all, just a clan of the Swallow Mountain region! What they faced was an enormous organization Snowdragon Mountain. The enemy’s group of Zifu Disciples who had hastened over here would have utterly terrified any ordinary clan. Even Ninefire had only wanted to delay until an Celestial Envoy of the Grand Xia Dynasty arrived. They hadn’t thought that they would actually be able to kill twelve Zifu Disciples in a row, without a single member of the Ji clan dying! “Now, only one remains.” Ninefire said. “Jadechild and Nong Zidao’s group of Zifu Disciples.” “Once we kill them, our victory is assured.” Yichuan said hurriedly. “Nong Zidao in particular. If we kill Nong Zidao…I refuse to believe that Snowdragon Mountain would be able to find a second expert in formations in a short period of time.” “The second group holds Jadechild, Nong Zidao, and others. As long as Nong Zidao dies, our Ji clan will have won for certain.” Ninefire nodded as well. Snowdragon Mountain might have other Zifu Disciples who would hasten over… But experts in formations were rare. Nong Zidao had only come to give face to Jadechild. In the region nearby Swallow Mountain, aside from Nong Zidao, Snowdragon Mountain had no other experts who were particularly skilled in formations. …….. Within the Netherwyrm Heavenlock Formation. An abyssal aura wafted about. Nong Zidao was frowning as he was analyzing the Netherwyrm Heavenlock Formation. He seemed to have completely absorbed himself in calculating the positions of the Netherwyrm Heavenlock Formation. The other Zifu Disciples all stared around them, on high alert. Jadechild stood by Nong Zidao’s side, with the aura of a general who would block anything and everything which came. Suddenly… “Ji Ning!” “It is Ji Ning!” “Junior apprentice-brother Muse, stop him!” A series of shouts rang out from afar. “Go all out against him!” “Juniog apprentice-sister Lu, senior apprentice-brother An, junior apprentice-brother Muse!” Fierce, grief-stricken shouts rang out from afar. “Ji Ning, you will definitely die!” “Ji Ning, our Snowdragon Mountain will definitely annihilate your Ji clan and kill you!” A berserk, desolate curse rang out. And then, utter silence. There was no longer any sound that could be heard. Nong Zidao had already opened his eyes, and a look of utter solemnity was in Jadechild’s gaze. The other nearby Zifu Disciples all had extremely ugly looks on their faces. “Junior apprentice-brother Dong.” Jadechild called out in a loud voice which echoed within the formation. No voice replied. Not a single voice! “Dead.” Nong Zidao said hoarsely. “All dead.” “We, we…senior apprentice-brother Zidao. Senior apprentice-brother Jadechild…” The red-haired cultivator stuttered. The other cultivators all looked towards Jadechild and Nong Zidao. Prior to this, there had been twelve Zifu Disciples in that group, but all of them had been killed. How could they not worry? How could they not feel uneasy?” Jadechild growled, “Obey my orders. Junior apprentice-brother Zidao, continue analyzing the formation. Fairy Crane, Landwyrm, continue to protect junior apprentice-brother Zidao. Myself and the rest of the six, we will set up the formation and protect junior apprentice-brother Zidao.” “Yes.” Instantly, the formation lit up. “All you need to worry about is defense.” Jadechild’s eyes were glowing with a golden light as he swept the surrounding area with his gaze. “If that Ji Ning truly does come, let me handle him.” “We’ll entrust everything to you, senior apprentice-brother Jadechild.” Nong Zidao said. At the same time, he set up eight formation flags within an area of ten meters. A black tower of light instantly sprang up, layering protections around him. The only people within the black tower of light was Nong Zidao, the Landwyrm, and the Fairy Crane. “Don’t worry.” Jadechild’s eyes were calm, but his baleful aura surged to the heavens. As someone who had become a peak Zifu-level Fiendgod Body Refiner long ago, and one who trained in a divine ability and thus was able to fight at the Wanxiang Adept level, how could he fear Ji Ning? …… The Golden Crow hung high in the sky. Within the governor’s mansion, inside an enormous city. One of the two elders of the Dong clan, Dong Fanyu, was seated there. Next to him there was a youth, who laughed and said, “Senior Dong, please wait momentarily. The Patriarch will arrive shortly.” “No rush, no rush.” Dong Fanyu laughed as well. Four members of Snowdragon Mountain’s Swallow Mountain branch had gone out to invite people; the two elders of the Dong clan, Muse, and Ju Nianxiong. Of the four, Muse had gone to invite Jadechild and Nong Zidao, which he felt was enough, and so he had returned earlier. Based on their original plans, each of them needed to invite roughly ten or so Zifu Disciples. The two elders of the Dong clan and Ju Nianxiong had invited many, but some of the Zifu Disciples they wished to invite had already gone to Snowdragon Mountain. Thus, they continued to go out and invite more; only after each of them had successfully invited ten over would it be enough. They had no idea as to what was happening in Swallow Mountain. “Senior apprentice-brother Fanyu.” A deep voice rang out. A silver-robed, middle-aged man walked out. “Last time I saw you, senior apprentice-brother, you were back at Swallow Mountain. In the blink of an eye, more than a hundred years have gone by. Earlier, senior apprentice-brother, you told my subordinates that there is something important you wish to discuss with me. What is it?” “A wonderful affair!” Dong Fanyu’s face was all smiles. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-6-chapter-15","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
