{"id":50923,"no":1226,"title":"Book 37, Chapter 11 - Heading Off Soon","content":"Vastheaven Territory. Vastheaven Palace. Emperor Goldisle had come to visit this place once more, and both Ji Ning’s avatar and Emperor Solesky had come out to welcome him in person. “Darknorth,” Emperor Goldisle immediately began, “I’m embarrassed to have to tell you about this.” “Brother Goldisle, come inside and sit. We can discuss things slowly.” Ning was rather surprised; why was Emperor Goldisle professing to be ‘embarrassed’ as soon as they met? Emperor Goldisle nodded, holding back for now. Ning and Solesky led the way for him as the three entered a secluded side-hall within Vastheaven Palace. The three then sat down, some fine wine placed in front of each of their tables. The aroma of the wine wafted through the entire hall, but Emperor Goldisle was in no mood to relax. He shook his head and sighed, “I’m embarrassed to be telling you this, but… just today, Emperor Bloodcloud went and sought me out.” “Bloodcloud?” Ning frowned. Emperor Bloodcloud was definitely the main pillar of the evil forces left behind by Archon Silksnow! “What, does he want to beg for mercy?” Ning asked. “That’s where you are wrong, Darknorth.” Emperor Goldisle shook his head. “He didn’t ask for mercy. Instead, he sought to send word through the Dao Alliance to the other realmverses about something he had discovered… and by now, it’s probably made its way to all the Sixteen Realmverses Alliance.” “Sixteen Realmverses Alliance? What’s that?” Ning was puzzled. “A great alliance that was originally established and led by Realmslord Windgrace. It consists of the Dao Alliances of the sixteen nearest realmverses which have joined together to ensure stability, peace, and allies in the event of outside invaders. We can notify each other of various dangers or important information we discover. In times of crisis, the sixteen realmverses will be in absolute lockstep and will not fear any outside forces. Realmslord Windgrace was chosen as the paramount leader by all sixteen realmverses, and is acclaimed as the most powerful expert of the Sixteen Realmverses Alliance.” “Realmslord Windgrace?” Ning sighed in amazement. “The strongest in sixteen realmverses?” The nearby Emperor Solesky sighed in amazement as well. That meant he had to be far stronger than even Hegemon Brightshore. “He’s in control of an alternate universe and is incredibly strong. During the Dawn War, he rendered incredible merits in battle and ended up in control of the terrifying Sithe war machine known was the Blacksun…” Emperor Goldisle continued, “But that’s enough about him. I’m here because of what Emperor Bloodcloud instructed our Dao Alliance to send to everyone else. This is something that will be of deep concern to you, Darknorth.” Ning and Solesky exchanged a glance. “What did he say?” Ning had a bad feeling already. “Emperor Blackcloud said that it was you who hunted down Archon Silksnow, forcing him to commit suicide in the end… and that his realmship is now in your hands.” Emperor Goldisle continued, “Emperor Bloodcloud asked me to send this information outwards. As you know, the Dao Alliance is a very loose structure and has just a few basic rules. There were no grounds for me to reject this proposal… and even if he didn’t go through me, he would’ve been able to go through the numerous other Emperors who are connected to the other realmverses.” “No need to say anything more, brother Goldisle. I understand.” Ning’s face was tight. “Give me a moment to think.” “Yes, you do need to think this over,” Emperor Goldisle agreed, a heavy look on his face. “Now that word has been sent to all sixteen realmverses as well as the otherverse which is under Realmslord Windgrace… I’m worried that quite a few Hegemons and powerful Emperors will hasten to our Flamedragon Realmverse and try to take that realmship from you.” Ning was lost in thought. Nasty. A truly nasty shot. Archon Silksnow was just as hard-hearted towards himself as he was towards his foes. He had never dared to reveal the secrets of the realmship prior to his passing, so why was it that Emperor Bloodcloud had found out immediately after he had died? Why was it that Emperor Bloodcloud also knew that Archon Silksnow had been hunted down by Ning and forced to commit suicide? Who would know all these little details? Aside from Ning himself, only the deceased Archon Silksnow knew. “Nasty move, Silksnow… so this is the final card up your sleeve to kill me?” Ning slowly shook his head. “You risked your life to delve into the Jadefire Realm, all for the purpose of trying to draw me inside and kill me… and you even came up with a final backup plan to use the realmship to kill me if you yourself could not.” Emperor Solesky and Emperor Goldisle both looked at Ning, waiting for him to make a decision. “Darknorth, why don’t you give the realmship up?” Emperor Solesky couldn’t help but suggest. “Give it up?” Ning shook his head. “If I trade the realmship to others, I’ll still be in possession of a vast amount of treasure. That treasure will continue to attract greedy eyes from some other major powers…” “Then don’t ask for any treasures at all. Just hand it over as a gift,” Emperor Solesky said. “And why do I have to give away my treasures?” Ning shook his head, a cold smile on his lips and a chilling gleam in his eyes. He then looked at Emperor Goldisle. “Brother Goldisle, there’s something I’ll have to trouble you with.” “Just go ahead and say the word.” Emperor Goldisle felt a bit embarrassed himself, but there had been nothing he could do; the Dao Alliance’s rules were binding! In addition, quite a few Emperors were connected to the outside world. Many of them spent their days wandering and adventuring but kept their avatars back home! Thus, it was extremely simple to ask these Emperors to help spread the word. There was no way to stop it at all, and so Emperor Goldisle wasn’t willing to disobey the laws of the Dao Alliance. “As you know, I’ve always wished to reverse spacetime to revive my Dao-companion.” Ning smiled. “Now that I have this realmship, I wish to use it to ask an Autarch to do just that.” “Ask an Autarch?” Emperor Goldisle and Emperor Solesky were both stunned. They had both heard of Autarchs, but not even the majority of Hegemons were ever able to actually meet one. “Fine.” Emperor Goldisle nodded repeatedly. “That’s a good solution. If your treasures ends up in the hands of an Autarch, nobody would be able to do anything about it! But Darknorth, I have to warn you… the Dao Alliance can only help you send the word to the Autarch as soon as possible. As for how long the Autarch will take, we can’t be sure. To Autarchs, realmships might be nice little toys, but they still won’t care enough to drop everything for one. They’d only accept your offer to ensure that the most basic laws of fairness in the universe are maintained.” “I understand.” Ning nodded. Autarchs were at the apex of power amongst cultivators, capable of creating even otherverses with ease. When the Sithe had been defeated, the Autarchs must’ve acquired countless spoils of war. Even if that wasn’t the case, at their level these treasures really held almost no meaning for them at all. They weren’t truly completely uncaring towards the weaker cultivators… but they couldn’t just help everyone who asked willy-nilly either! That wouldn’t be appropriate. Thus, Autarchs operated off a simple principle… if you wanted one of them to help you out, you had to pay a corresponding price, even though they themselves didn’t care about treasure per se. “Right. I’ll go send the word now,” Emperor Goldisle said. “I’ll get you a response as soon as I can.” “Good.” Ning felt excitement swell in his breast. He was asking a favor of an Autarch! A favor for a realmship… when would the Autarch come? …… Word quickly spread to Realmslord Windgrace’s territory. He possessed a pre-eminent status; he was the only one in all the Sixteen Realmverses Alliance who was capable of contacting an Autarch. “He wishes to use a realmship to ask an Autarch to revive his Dao-companion? This Daolord Darknorth is quite the romantic.” Realmslord Windgrace laughed when he heard this, then immediately helped send the word. …… A distant region of great darkness. Within the emptiness of the void, there was an enormous triangular region with a series of dazzlingly beautiful palaces in the very center, each of which emanated specks of golden light. At the very center was a particularly towering palace, the greatest of them all. “Master.” An azure-robed youth who emanated the aura of eternity moved to stand respectfully outside a private room within the palace. Inside the private room was a bald, black-robed old man who had a pair of fleshy antennae growing from the top of his head. His golden eyes were focused intently on the skull-sized round gray globe in front of him, and the countless runes and patterns the globe was covered with. The fleshy antennae waved about above the bald old man’s head, but his eyes were filled with excitement. He gently reached out to tap the gray globe once, causing the countless patterns to instantly change and an aura of power to build. “Still not right.” The bald old man shook his head, then reached out with his ashen white right hand to give it another tap, bringing it back into quiescence. “Master.” A second call rang out from outside. “Xian’er. Why are you bothering me?” Only now did the old man notice the distraction and respond. “Realmslord Windgrace sent word that someone named Daolord Darknorth in the Flamedragon Realmverse wishes to use a realmship to ask you to help him reverse spacetime to revive his Dao-companion,” the azure-robed youth outside said respectfully. “Another lovesick man.” The bald old man nodded. “Alright, fine. Got it. Stop bothering me, I’ll head over there soon!” “Soon?” The youth outside the door murmured softly, “Master, the last time you said you would go ‘soon’, you delayed by over 600,000 chaos cycles…” The bald old man’s antennae instantly begin to twist in embarrassment and irritation. “How dare you mock me, you brat! This time, it really will be soon! I’ve pretty much finished repairing this treasure. It needs just a tiny bit more work. Once I’ve finished repairing it, I’ll head over! Alright, don’t bother me again before I finish this project.’ “Alright.” The azure-robed youth had no choice but to leave, then send this response back to his good friend ‘Realmslord Windgrace’. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-37-chapter-11","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
