{"id":49822,"no":125,"title":"Book 6, Chapter 25 - 72 Flying Swords","content":"Adept Xu stretched out his hand, and the giant seal suddenly expanded, sweeping towards Ji Ning like a gigantic rampart.\n Swoosh! Swoosh!\n Ning, bathed in fiery light, fluttered the wings on his back, sending himself arcing out in a line, dodging the grand seal and continuing to charge towards Adept Xu.\n “Go.” Adept Xu controlled the giant seal, sending the giant seal, glowing with that earthen yellow light, to curve and turn towards Ning once more! The grand seal struck at Ning repeatedly; it was, after all, an Earth-ranked magic treasure, and so it moved in a straight line at tremendous speeds. Only, in terms of agility, it was significantly inferior to Ning.\n Crackle!\n Ning’s swords flashed, transforming into lines of rainwater that ‘scraped’ by the edges of the grand seal. The grand seal spun out of control to one side, while Ning once more swept out in an arc, charging straight towards Adept Xu.\n “He’s too fast. His speed is too fast, and he’s too nimble.” Adept Xu was completely stunned. Just now, in that short period of time, his Earth-ranked magic treasure had clashed against Ning several times, but even his Earth-ranked magic treasure had been thrown off by Ning’s movement techniques.\n “Go.”\n Adept Xu let out a loud shout, and a black rope appeared in his hands. The black rope was covered with a layer of black energy, and as Adept Xu waved his hands, the black rope quickly expanded until it was the size of a giant python that was more than three hundred meters long, then swept entanglingly towards Ning.\n Earth-ranked magic treasure, ‘Earth Garrison Seal’.\n Earth-ranked magic treasure, ‘Black Serpent Cord’.\n These were the two mighty Earth-ranked magic treasures which Adept Xu relied on as he roamed the world. One was hard, while the other was soft; the two paired together perfectly. Generally speaking, upon encountering those weaker than him, he would use the ‘Earth Garrison Seal’ to viciously smash them to death! Unexpectedly, he hadn’t been able to smash Ning at all, and was forced to bring out the second of his two killing techniques.\n “A cord?” Ning stared at the giant black cord, over three hundred meters in length, and his face changed slightly.\n “This is troublesome. This giant seal moves in straight lines and isn’t able to do anything to me, but that cord is perfectly suited for locking opponents.” Many thoughts flashed through Ning’s mind. “I definitely cannot permit myself to be constricted by that cord. Once it captures me, I will lose for sure.”\n In this battle, Ning had immediately used the Windwing Evasion at full power from the very start. He wanted to rely on his far superior speed and agility to kill his foe!\n However…\n Adept Xu stood there, unmoving; all he had done was unleash two powerful Earth-ranked magic treasures, and Ning already felt shaken.\n “Water Rampart!”\n “Waterflame Lotus!” Ning, with a thought, instantly summoned one swirling curtain of water after another in the area around him. These curtains of water, as thin as the wing of a cicada, were all incomparably sharp. They directly chopped apart the moonlight barrier, forming multiple layers of watery curtains.\n At the same time, in the air around him, one Waterflame Lotus after another appeared and stabilized. A total of nine lotuses appeared, locked into various locations in the rainwater that perfectly entangled and blocked the rope.\n “Hmph, with simple techniques like this, you wish to block my magic treasure?” Adept Xu let out a cold laugh.\n The Black Serpent Cord began to wildly wave about and dance. Bangbangbang! One curtain of water was forcibly shattered after the other. Whapwhapwhap! The Waterflame Lotuses were also crushed to bits. How could these water curtains and Waterflame Lotuses possibly block the power of an Earth-ranked magic treasure, when unleashed by a Wanxiang Adept?\n But Ning didn’t need to actually block them; what he needed to do was to slow down the speed of the cord, just a bit. Given his ‘Windwing Evasion’ divine ability, his speed would then naturally result in him moving beyond the cord.\n “Swish!” “Swish!”\n Rainwater filled the skies. Curtains of water swirled around him. Lotus petals of fire and water.\n The Black Serpent Cord and the Earth Garrison Seal all strove to slay Ning…but Ning arced out in jagged lines, flashing about like a crooked bolt of lightning, charging straight towards Adept Xu.\n “I want to see how many Earth-ranked magic treasures you have.” Ning swiped out with the Darknorth swords in his hands, chopping straight towards Adept Xu.\n ………….\n Nong Zidao and the others, watching from the side, were completely stupefied. They didn’t even dare to breathe. They had no idea at all that this monstrous genius of the Ji clan would actually be able to fight head on against Adept Xu! Adept Xu had already activated two Earth-ranked magic treasures, but still hadn’t been able to do anything to Ji Ning.\n “Clearly…he clearly was just at Jadechild’s level.” Nong Zidao couldn’t believe what he was seeing. “How could Ji Ning’s speed have suddenly risen by so much? Even two mighty Earth-ranked magic treasures, under the influence of his Rainwater Sword Domain and his Waterflame Lotuses, are unable to touch him.”\n His speed was simply too fast!\n “If he had moved this fast in his earlier battle against Jadechild, Jadechild probably would have lost in their first exchange of blows.” Nong Zidao’s eyes were filled with disbelief. “Can it be that he just made some sort of a breakthrough?”\n Monster.\n What a monster!\n “Adept Xu will definitely win.”\n “Definitely win.”\n Lu Huang and the other Zifu Adepts all prayed quietly. Once Adept Xu lost, Adept Xu could leave through his Lesser Teleportation Dao-seal, but they wouldn’t be able to escape.\n ………….\n “Ji Ning will definitely win.” On the other side, Ji Ninefire and the others were praying as well.\n “Ji Ning and Adept Xu are fighting to a standstill.” Ninefire, as the controller of the Netherwyrm Heavenlock Formation, was able to watch this battle. As he did, he spoke with the nearby Yichuan. “Adept Xu is using two Earth-ranked magic treasures; his power is indeed exceedingly great. However, Ji Ning’s speed is astonishing; he’s simply inconceivably fast.”\n As Ninefire spoke, Yichuan, by his side, was holding his breath.\n He was nervous.\n This was the critical battle!\n ………\n Seeing that even two Earth-ranked magic treasures hadn’t been enough to stop Ning, Adept Xu suddenly let out an explosive shout: “Formation!”\n Whoosh! Whoosh! Whoosh! Whoosh! Whoosh! Whoosh!\n In the air around him, seventy two flying swords suddenly appeared out of nowhere. Every single flying sword glowed with black light, and the seventy two flying swords formed into a circle around Adept Xu, providing him with layers of protections.\n “What?!” Ning, just about to display his swordplay and kill Adept Xu, stared in astonishment at the flying swords which had suddenly appeared in front of him. These flying swords all transformed into rays of flowing black light, stabbing straight towards him.\n “Clang!” “Clang!” “Clang!” Ning wielded a Darknorth sword in each hand, and in the blink of an eye, he used them to block nine attacks from flying swords. He was knocked flying backwards by the force of the collision, and from behind, the Black Serpent Cord and the Earth Garrison Seal came flying towards him once more.\n The wings on Ning’s back trembled violently, and he immediately arced away, dodging the attacks.\n The layers of Waterflame Lotuses and curtains of rainwater around him continued to hinder everything.\n “How could it be like this!” Ning’s face changed. He stared at the distant Adept Xu, securely protected by those seventy two flying swords.\n “Seventy two flying swords, each of which strikes with power no weaker than a full-force attack from one of my Darknorth swords.” Just now, Ning had attacked with full force. Although his swordplay was intricate, Adept Xu’s flying swords were still filled with middle-stage Wanxiang-level power, and in terms of technique, they were only slightly inferior.\n Every single flying sword was indeed no less than a full-force blow from Ning’s Darknorth swords.\n “Hahaha…”\n The distant Adept Xu began to laugh. “Ji Ning, I’ve already discovered your weakness. For me to use these two Earth-ranked treasures against you is using my weakness against your strength!”\n “Although your speed is astonishing, you are still a Zifu Disciple. There’s no need for me to use Earth-ranked magic treasures; these Mortal-ranked flying swords are already enough to deal with you.” Adept Xu laughed. “In addition, to deal with your fast speed, I should use large amounts of magic treasures to attack you in unison.”\n “With many magic treasures at hand, I will just so happen to perfectly counter your speed.” Adept Xu laughed.\n When fighting against different foes, naturally one had to use different measures. Adept Xu normally battled against other Wanxiang Adepts...and against them, the power of these flyings words would be considered too low. They would generally only be able to achieve victory through the use of Earth-ranked magic treasures. But against Ji Ning, these Mortal-ranked flying swords were enough to deal with him.\n “Return.” Adept Xu laughed softly, and the giant seal and black cord that had been chasing after Ning returned to him, swirling about him.\n “Go.” Adept Xu pointed towards the distance.\n Swoosh!\n Instantly, thirty-six flying swords pierced through the skies, attacking Ji Ning.\n Although those blossoms of Waterflame Lotuses and layers of watery curtains strove to block the flying swords, the Mortal-ranked flying swords of Adept Xu were no weaker than the full-force blows of Jadechild. Naturally, these flying swords were able to peirce straight through, and although they slowed down a bit, they were simply too numerous. They surrounded Ning from every direction.\n It was as though thirty-six people were simultaneously attacking Ning.\n “Against you, the path to victory is through sheer numbers.” Adept Xu was extremely confident.\n ………..\n Ning, seeing the thirty-six flying swords attack, had a dramatically changed look on his face. He hurriedly used his Windwing Evasion, urgently attempting to pull away from them. At the same time, six hundred-plus flying swords appeared out of nowhere in the area around Ning.\n “Go!” Ning had a savage look on his face, pouring almost all of his concentration into his sword-formation. For the moment, the surrounding layers of watery curtains and blossoms of Waterflame Lotuses all vanished. He had completely focused his concentrating on executing the eighth level of the [Lesser Thousand Swords Formation], and there was nothing left for him to spare on controlling the Waterflame Lotuses and the watery curtains.\n Swish!\n A ray of sword light suddenly transformed into a drop of rain, instantly howling and charging towards Adept Xu.\n “Clang.” The distant Adept Xu, with but a thought, controlled the thirty-six flying swords in pursuit of Ning to block that line of rainwater…\n BOOM!\n Three of the flying swords managed to intercept the line of rainwater, and the three flying swords were all blasted away, with that line of rainwater continuing to charge towards Adept Xu.\n “Oh?” The distant Adept Xu revealed a smile. “It seems the power is quite formidable.”\n “Go.” Nine of the thirty-six flying swords protecting him instantly flew out. Clangclangclang! Repeated collision sounds…and the line of rainwater finally vanished.\n Adept Xu stared at the distant Ning and laughed softly. “The power of this sword-formation technique of yours is indeed quite significant. However…it still isn’t at the power of my Earth-ranked magic treasures. Even if I just control these Mortal-ranked flying swords to block, I only need six flying swords in order to completely block the sword light generated by your sword-formation.”\n “You are dead.” Adept Xu let out a confident laugh. “Die.”\n The thirty-six flying swords that had been by his side all flew out as well, joining together with the thirty-six flying swords that were attacking Ning already.\n “Eight-By-Nine Sword Formation! Kill!” A hint of a fierce light flashed through Adept Xu’s eyes.\n BANG!\n The seventy two flying swords transformed into an enormous circular arc. Like an orderly army in a formation, all of the tips of the swords pointed towards Ji Ning.\n \n \n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-6-chapter-25","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.\n","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
