{"id":49823,"no":126,"title":"Book 6, Chapter 26 - A Disastrous Defeat","content":"The curtains of water continued to rise up, and the Waterflame Lotuses continued to bloom.\n The seventy two flying swords, in the shape of a giant circular arc, pierced through the multiple curtains of water, pierced through the Waterflame Lotuses, and stabbed towards Ning.\n “Clang!” “Clang!” “Clang!” “Clang!” “Clang!” “Clang!”\n One sound rang out after another. Ji Ning, the Darknorth swords in his hands, hurriedly executed his swordplay, a curtain of water formed from sword light. Ning allowed those flying swords to attack as they pleased, focusing on defense and relying on his two swords to block those seventy two flying swords.\n Whoosh!\n A flying sword slashed past Ning’s thigh, sending blood flying.\n Chop!\n A flying sword pierced past Ning’s flank.\n “Ning, quick, return, return.” The controller of the Netherwyrm Heavenlock Formation, Patriarch Ji Ninefire, sent frantically.\n “No.” Ning was unwilling.\n “Quick. Your life is more important than ours. Stop fighting. Quick, return.” Ninefire’s voice was filled with urgency and pain.\n Ning gritted his teeth, ignoring the Patriarch. He had to go all out and do his best, because…he truly didn’t want to fail.\n He didn’t want to fail.\n He didn’t want to see them die!\n He didn’t want to!\n ……….\n Adept Xu watched from afar, the look on his face having changed. “He lives up to his reputation as someone who has gained insight into a Dao Domain. His swordplay truly is formidable. When defending, his defense can be described as airtight. Even though I’m occasionally able to wound him, it’s under his control.”\n After all, the pressure of being attacked by seventy two flying swords was simply too great. Even Ning had to occasionally use his body parts or the magic wings on his back to block those flying swords…\n “Kill!” Ning was struggling to block those seventy two flying swords, but suddenly, a fierce light flashed through his eyes.\n Of the six hundred-plus flying swords hovering behind him, five hundred-plus suddenly lit up. A sword light began to form in front of Ning, emanating a fierce, sharp aura.\n “Swish!” The sword light suddenly pierced through the skies.\n This was the seventh level of the [Lesser Thousand Swords Formation]. Despite maintaining the Waterflame Lotuses, the curtains of water, and executing his swordplay…Ning was simultaneously able to divide his mind enough to control the [Lesser Thousand Swords Formation], but only the seventh level of it.\n “Kill, kill, kill!” Ning was in a berserk state. One sword flash after another appeared emerged, transforming into lines of rain and striking out.\n “Kill him!” Ning’s eyes were filled with both hope and terror. Terror from the deepest recesses of his heart; terror of being defeated! When the seventy two flying swords had attacked him, causing him to be unable to move closer to Adept Xu, Ning understood…that he would probably lose this time. His greatest advantage in battling Adept Xu was in his movements and agility!\n But now, he couldn’t even draw near his opponent. How could he win?\n Was he about to lose?\n If even he were defeated, then the Ji clan would be unable to stop the enemies. They would have to spend their lives to battle and stop them.\n By then, his father, Ji Yichuan, along with Patriarch Ninefire, Granny Shadow…they would all give up their lives.\n “Die, die, die!” Ning’s eyes were filled with a killing urge.\n He had to go all out!\n Go all out, one last time!\n One flash of sword light after another transformed into lines of rain, striking towards Adept Xu.\n Adept Xu just stood there, laughing coldly. “He really is relentless.” In the area around him, that black cord quickly looped around him multiple times. With the thick cord wrapped about him…the majority of the space was blocked off, and when the lines of rain struck at him, the black cord simply trembled slightly, then shattered the lines of rain.\n Boom! Boom! Boom! The cords simply trembled and moved very slightly as they dispersed each attacking line of rain.\n The power of this Earth-ranked magic treasure, ‘Black Serpent Cord’, was simply too great. It was able to easily disperse the blows of the [Lesser Thousand Swords Formation].\n “Go.”\n The remaining, final drop of rain struck out in a solitary arc, actually striking towards Nong Zidao, protected by multiple people.\n “If I kill Nong Zidao, I still win!” Ning’s eyes were filled with savagery.\n “Roaaaaar!”\n That snowy white Flood Dragon gently descended over the bodies of Adept Xu, Nong Zidao, Lu Huang, and the rest of the nine Immortal practitioners. In but an instant…Adept Xu, Nong Zidao, and the others all entered the ‘body’ of the snowy white Flood Dragon.\n It was much like how Ning and the others were within the body of the Netherwyrm; Adept Xu and the others were also able to enter the body of their Flood Dragon.\n “Bang!” The line of rainwater wildly pierced towards the snowy white Flood Dragon.\n The draconic scales of the snowy white Flood Dragon trembled, but the line of rainwater was completely shattered.\n Defeat.\n “Hahaha.” Nong Zidao, within the body of the snowy white Flood Dragon, began to laugh. “This Flood Dragon Formation was jointly set up by master-uncle, myself, and seven others. Even if you had master-uncle’s level of power, it would still be hard for you to break through it. And your strength is far inferior to master-uncle’s.”\n The Flood Dragon simply coiled there.\n All of them were within the body of the Flood Dragon, with Adept Xu standing at the Flood Dragon’s head, staring at the distant Ning.\n “Our Snowdragon Mountain’s famous ‘Soaring Snowdragon Formation’ is legendary in countless lands.” Adept Xu’s eyes were filled with arrogance. “Although this Flood Dragon Formation is merely a simplified version of the ‘Soaring Snowdragon Formation’, once it has been established with the nine of us within it…even I, using all my power, wouldn’t be able to do anything to this formation, much less you.”\n ……..\n The distant Nong Zidao and Adept Xu spoke smugly. Although Ning was listening, in his heart, he was musing to himself.\n “Can it be…can it be that I truly have been forced to take the last step?”\n Swish!\n Suddenly, a ripple of power surged close to him. Ning was in control of his Rainwater Sword Domain, and so although he couldn’t see anything visibly, he could sense a strange, needle-shaped item pierce towards him.\n “Not good.” Ning immediately came to his senses. The magic wings behind his back trembled, and he immediately sought to use the Windwing Evasion to pull away from it. Although the Darknorth swords remained in his hands…they were currently being used to block the seventy two attacking flying swords. If he were to relax against them, the seventy two flying swords would chop his body into mincemeat.\n Slash!\n As Ning was frantically dodging, the sharp needle, as though consciously controlled, pierced straight through Ning’s flank.\n “Bang!”\n The elemental ki exploded!\n Ning’s incomparably tough Fiendgod body still had a giant hole blasted through it, even larger than the size of his head. The left part of his waist was completely shattered, leaving behind only a few scraps of muscle and flesh.\n “Grow.” While using the Windwing Evasion to hurriedly pull away, Ning also controlled his divine power to instantly cause new flesh and blood to grow out at high speed. The giant hole in his side was rapidly healing.\n “Quick, come back.” Ninefire howled furiously. “Ji Ning, if you don’t come back, all of us will die with our eyes open and filled with resentment!!!”\n He was frantic. Patriarch Ninefire was now truly frantic. He had asked Ning to come back earlier, but Ning insisted on struggling. If this continued…Ning would very likely perish.\n Ning gritted his teeth in agony.\n He would leave!\n “Swoosh.” His wings fluttered, and he instantly charged into the nearby nether fog. The nether fog was filled with darkness, and Adept Xu and the others only watched him enter, not daring to follow in.\n “Ji Ning! You’ve already been struck by my Divine Blackblood Needle!” Adept Xu called out in a high voice. “I can already sense your location. Once you draw near me, forget about leaving with your life!”\n …………..\n Halfway up Oxhorn Mountain.\n One figure after another was making haste towards this location, moving like streaks of light. Ji Truekeep, Granny Shadow, and the others were all gathering here.\n Swoosh\n Ning arrived as well.\n “Ji Ning.” Ninefire looked at the youth. It was this youth who had risked his life, time and time again. He let out a long sigh. “Ji Ning, our Ji clan has let you down.”\n “Patriarch.” Ning’s eyes were red.\n “You’ve done enough things. Done well enough.” Ninefire gently patted Ning on the shoulders. “In a slightly larger clan, a slightly more powerful clan…how could a supreme genius like yourself be forced to risk your life repeatedly like this? It is our Ji clan which has let you down. You killed Jadechild and that group of Zifu Disciples; you have done enough.”\n “If we truly are not able to endure this, then it will simply be the will of the heavens, that our Ji clan is not to survive this tribulation.” Ninefire said softly. “There is no need to feel anger. No need to feel grief. All clans will have a time to flourish, and a time to fall. What we can do is to fight with all our power. That is enough. For the heavens to allow a genius like you to arrive within our Ji clan is already an incomparable kindness.”\n Ninefire looked at Ning. “I know that with you alive, our Ji clan will definitely flourish. It definitely will!”\n Ning gritted his teeth. His heart was shaking!\n “Given how the situation has progressed…” Ninefire swept his gaze towards the nearby Granny Shadow, Ah Xing, Truekeep, and Yichuan, along with the Landwyrm and the Fairy Crane. “Everyone, you should all know that the situation is very grim. There is also a giant sealing formation outside; there is nowhere for us to run.”\n “This time, our only choice is to fight to the death!” Ninefire was very calm, but his gaze was blazing.\n “Fight to the death!”\n Yichuan, Truekeep, and the others all had the same resolve in their eyes.\n None of them would cower!\n None of them were afraid!\n If they were afraid, they wouldn’t have come here, to Oxhorn Mountain.\n “Obey my commands.” NInefire said. “All of us must fight with full force, making it so that Nong Zidao is unable to completely concentrate on breaking the formation. We need to delay as much as we can. Thus, Landwyrm, you will be the first to go and delay them. Once you die, the Fairy Crane will go!”\n The Landwyrm and the Fairy Crane, the two Zifu-level spirit-beasts, were in the form of the azure-armored man and the white-robed maiden. They glanced at each other, their eyes filled with bitterness.\n “The two of you can only blame your poor luck. Fight at full power.” Ninefire said. “If you die in battle for the sake of our Ji clan, you can still enter the cycle of reincarnation. If you resist, then I will shatter your souls!”\n “We will obey.”\n The azure-armored warrior and the white-robed maiden both lowered their heads.\n Once the soul-bond was set, they absolutely had to obey the orders of their owner. Otherwise, their owner could easily destroy their souls.\n “After the Fairy Crane dies, Yichuan, you will go next.” Ninefire looked at Yichuan.\n “Right.” Yichuan nodded.\n He was only able to fight at the Zifu Disciple level for an hour. He was of the least use to the Netherwyrm Heavenlock Formation; naturally, he would be the first member of the Ji clan to charge forward.\n “Once Yichuan dies, Liu Xing, you go.” Ninefire looked towards the old servant, Ah Xing.\n Ah Xing nodded.\n “Once Liu Xing dies, Ji Shadow, you go.” Ninefire looked at his little sister.\n Granny Shadow nodded.\n “After Granny Shadow dies, Truekeep, you go.” NInefire looked towards Truekeep. “I will immediately follow!”\n Not a single voice was raised in dissent.\n Ning, watching this, felt great pain in his heart. He hurriedly said, “Patriarch, I am the strongest, and I’m able to delay them as well. If I ambush them repeatedly…I can make it so that Nong Zidao is distracted and unable to focus on breaking the formation.”\n “Didn’t you hear what Adept Xu just said?” Ninefire barked. “You were hit by his Divine Blackblood Needle. He can sense your location. Once you draw near him, he will definitely prepare a heavy counter-attack for you. It doesn’t matter if we die, but if you die, you would have let down the entire Ji clan, not just yourself, understood?”\n Ning gritted his teeth.\n “Ji Ning.” Granny Shadow said hoarsely. “If you dare to come again, I will immediately commit suicide in front of you.”\n “Granny Shadow…” Ning’s heart trembled.\n “Ji Ning.” Yichuan looked at his son, then gave him his instructions. “Don’t make our deaths meaningless.”\n \n \n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-6-chapter-26","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.\n","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
