{"id":51091,"no":1394,"title":"Book 43, Chapter 15 - The Engine of Destruction","content":"Within Autarch Titanos’ residence. Nine strange parts were hovering in the air within his private study, and Autarch Titanos was frowning thoughtfully as he analyzed them. Even the two fleshy antennae on top of his head were drooping in a pensive manner.\n Autarch Titanos had spent more time studying and understanding Sithe treasures than anyone else in this entire Chaosverse! He knew more than any other cultivator, and he had created quite a few weapons based off of those treasures, some of which were suitable for cultivators to use. Autarch Titanos was eagerly anticipating the creation of even more. “Harrumph! We are no longer the cultivators of old. We have many unique weapons of our own now, and even our ordinary Emperors are far more difficult to deal with than the ones of the past.”\n Each Autarch followed a different, separate path. Autarch Titanos was the master of the Karma Daobirth Essence, which was arguably the most difficult Dao aside from the Omega Daos. As a result, he was the best-suited for ruminating on difficult, complex mechanisms. He spent his time creating many unusual weapons, allowing their Hegemons and Emperors to unleash tremendous power in battle This would make it much more difficult for the Sithe to slay the Emperors of this Chaosverse.\n If he could raise the overall power of their forces, they would have a greater chance at gaining victory in the upcoming war… and the countless aeons he had spent in research had resulted in many splendid achievements indeed!\n “Eh?” The two fleshy antennae on top of Autarch Titanos’ head suddenly shot up straight, and a sharp look flickered through his eyes. “This is…” Autarch Titanos could vaguely sense that the entire Quintessence was somehow in grave danger. An invisible, destructive force had suddenly cast a shadow over the entire Chaosverse.\n “Destruction… the destruction of the entire Chaosverse?” Autarch Titanos turned slightly pale. “The source of this destruction is coming from that direction!”\n Long ago, the Quintessence had sent a similar warning to all of the Autarchs, ensuring that they knew how dangerous the ‘Sithe’ were. Now, for the second time, they had received this warning!\n “Could we be facing a new threat, something aside from the Sithe?” Autarch Titanos was slightly panicked. There was no way the Quintessence’s warning could possibly be in error, and so he abandoned all of his experiments and immediately exited his laboratory, then tore a tunnel through spacetime towards the source of the danger.\n ……\n The handsome but sorrowful-looking white-haired Autarch Bolin was standing in a wild, untamed land. He stared at the earthen dwelling before him and the mortals inside of it. There were a total of three children within.\n “Now these kids are rather interesting. Are you ready? Ready to transcend life and death and become a brand new, powerful type of creature?” Autarch Bolin looked at the oldest child, the nine-year-old, with a hint of anticipation in his eyes. He had just prepared a new… experiment.\n Autarch Bolin had spent many aeons treading the line between life and death, scrying the mysteries of this great cycle. He hadn’t come close to mastering the Samsara Daobirth Essence, but he had other plans he was focused on.\n He wanted to create a truly perfect lifeform! The Aeonians had been one of his many experiments, but they weren’t truly perfect. He wanted to create perfect beings which were on par with Sourcewalkers and Chaos Primordials in might. If the cultivators could produce a large number of ‘perfect’ beings and allowed them to propagate, they would have gained a powerful new army which made battling against the Sithe easier.\n Suddenly, Autarch Bolin’s face turned pale. “Danger?” He immediately abandoned his new experiment. He could sense on a subconscious level that the entire Quintessence was shivering in terror, as though a terrifying destructive force had just appeared in front of it which could tear it apart.\n The prime essences of the Chaosverse were awesome and powerful, but they were also quite weak. This was because they weren’t truly sentient, nor were they able to defend themselves. Thus, they had to rely upon the Autarchs and the cultivators to protect them against the Sithe. Once the cultivators were defeated, the Quintessence would be like meat on the chopping block for the Sithe to butcher as they pleased.\n Whoosh. Autarch Bolin immediately tore through spacetime and departed.\n ……\n Within the Three Realms. Brightheart Island. Ning was seated facing Autumn Leaf. The two were playing chess, while Brightmoon was watching from nearby.\n “Hm.” Autumn Leaf pondered her next move.\n Ning held a small black gourd in his hand. Every so often, he would take a swig from it. After Autumn Leaf finally made her move, he casually made his own move as well. After mastering the Numerancy Sword Dao, Ning was arguably the number one master of Numerancy and divinations in the entire Chaosverse. Perhaps Autarch Titanos, who was the master of the Karma Daobirth Essence, might be on par with him, but no one else! Chess? Of course Ning couldn’t play too seriously. If he did, it’d ruin the whole game.\n “Aunt Autumn Leaf, that’s not right! If you do that, you are going to be in serious trouble.” Brightmoon shook her head, reaching out to prevent Autumn Leaf from making the move she wanted to make.\n “Then what should I do next?” Autumn Leaf immediately pulled her chess piece back.\n “Ahem! For a bystander to remain silent is the way of gentlemen.” Ning glanced sideways at Brightmoon, then looked at Autumn Leaf. “And since when did we allow take-backs in chess?”\n “I didn’t put my piece down yet. It doesn’t count as a take-back,” Autumn Leaf said immediately.\n “And I’m not a gentleman, I’m a woman!” Brightmoon rebutted.\n Speechless, Ning chose to continue drinking his wine instead of arguing. The two of them would wrack their brains over every move while he just played casually, but he’d still win nine out of ten games. This was on purpose, of course. If you won every time, who would be willing to play with you?\n “Brightmoon, when are you planning to begin your Daomerge?” Ning asked.\n “Not anytime soon,” Brightmoon said. “It’ll definitely be after Patriarch Subhuti.”\n “After we finish this game of chess, I need to talk to you about something,” Ning said. He was planning to transmit the ‘Truesoul Everlasting’ technique to her. Right now, they were extremely cautious and careful in transmitting this technique, generally only teaching it to the most incredibly talented Daolords of the Fourth Step. In each case, they would require the Daolord to swear a lifeblood oath which would cover many things.\n For example, the Daolord could only attempt the Daomerge in a place where his or her aura would be completely hidden. That way, in the event that the Daolord failed the Daomerge and had to use the ‘Truesoul Everlasting’ technique to repair his truesoul, no one would be the wiser. In fact, no one would even know that he had attempted the Daomerge! This was the best way to keep things secret.\n In short, they did everything they could to keep this hidden from the Sithe. They’d hide it for as long as they could! They knew that once the Sithe spies found out that the cultivators possessed the ‘Truesoul Everlasting’ technique, they would immediately be able to guess that Ning was still alive.\n There was really nothing they could do about this. They couldn’t keep the ‘Truesoul Everlasting’ technique hidden from all cultivators just to ensure that Ning’s continued survival remained a secret, right? This was a technique which would strengthen civilization as a whole.\n “Eh?” Ning suddenly frowned midway through his next move. Given the power of his godsense and his connection to the prime essences of the Chaosverse, he was naturally able to sense a terrifying danger suddenly manifest… a danger which could very well destroy the entire Quintessence itself.\n “What’s going on? Has another civilization aside from the Sithe invaded us as well?” Ning turned pale.\n Whoosh! The golden-robed Ning which had been roving the outside realm almost instantly tore through spacetime and hurried towards the source of the danger. The golden-robed avatar now had only 80% of the true Ning’s power, but it must be remembered that when compared, Ning was now at least 60% stronger than he was back when his truesoul was crumbling! This was because he had first gained Emperor-class energy, then transformed it into mana! After another six million chaos cycles of cultivation, he had infused many new Daos into his Sword Dao. As a result, the avatar-Ning was now much more powerful than ‘Daolord Ning’ had been.\n In terms of raw power, Ning was ranked at the top of the list amongst the Autarchs. Even Autarch Titanos was slightly inferior to him, as Titanos wasn’t as well-rounded as Ning was! Ning’s avatar was terrifyingly strong.\n ……\n The weaker cultivators felt nothing at all; the only people in the Chaosverse who sensed the danger were Ning and the six Autarchs, and all of them arrived. Autarch Mogg sent his avatar as he needed to stand guard over the Sithelands. The other five Autarchs all left their avatars in the Sithelands and came in person. Ning was extremely confident in his own power, and so he sent his avatar as well.\n In truth, Autarchs would generally send their avatars to deal with any dangerous situations. This was because if the avatar died, they could easily remake a new one! If their true bodies died, the Autarchs would be dead for good.\n Riiiiip. Ning tore through spacetime and arrived in a place within the Great Dark. He immediately saw Autarch Ekong.\n “Darknorth.” The muscular Autarch Ekong was dressed in his usual loose robes. He had been the first to arrive, as he had been the closest to this location. Ning was the second to arrive.\n “What’s going on?” Ning strode through the void towards him.\n “There’s no one here save us.” Autarch Ekong pointed off into the distance. “The danger is coming from over there.”\n Ning could sense it as well. Far off in the distance, there was an enormous silver vortex that was slowly swiveling in place. This silver vortex was so gigantic that it was vastly greater than an ordinary realmverse in size. Ning was able to see through to the very center of the silver vortex, where he saw a giant, ancient sphere-shaped object that was the size of a realmverse. It was riddled with countless holes, but Ning was unable to see through them to the insides of this sphere. All he could sense was that it was filled with boundless danger.\n The giant sphere simply sat there in the darkness, furiously devouring the primordial chaos around it. The silver vortex around it represented all of the energy which it was draining from the surrounding area. Even the endless darkness itself was being swallowed up by it.\n Just looking at the thing caused Ning and Autarch Ekong to feel a sense of dread.\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-43-chapter-15","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.\n","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
