{"id":49722,"no":25,"title":"Book 2, Chapter 7 - One Against Seven?","content":"Ji Jadewich sat in his usual spot, nursing a beastskull goblet. “Perhaps Ji Yichuan wants to let his son have an early try. After all, even if he fails, four years later, Ji Ning can try again.”\n “They have two chances, but I can’t fail even once.” Ji Lee revealed a hint of a smile on his face. “Fortunately, back then, I took in my adoptive son, Grizzly.”\n Immediately, Lee said to a nearby servant, “Have Grizzly come and see me!”\n “Yes, master.” The barefoot female servant bowed, then quickly left.\n Soon afterwards, a tall young man wearing golden furs came striding in. This youngster had a very fierce aura. His face was covered with golden fur, and his eyes also had a faint gold look to them, unlike ordinary people. At all times, he carried a pitch black straight saber on his back.\n He strode in, and as he did…he seemed like a skinny, golden grizzly bear. Although he was only thirteen, he was even slightly taller than Lee.\n “Father.” Grizzly called out respectfully.\n “Grizzly.” Lee looked at his adopted son, nodding in satisfaction. “The Ceremony of the Golden Sword is held once every four years. I will arrange for you to be registered in this year’s Ceremony of the Golden Sword. I only have one request: Seize the golden sword!”\n “Yes.” Grizzly’s voice was deep and thick.\n “Right.” Lee nodded with satisfaction. Of the many adoptive sons he had taken in, only a very few had made him satisfied, and amongst them, Grizzly was the one he was the most satisfied with. Lee had total confidence in Grizzly’s abilities to prevent Ning from seizing the golden sword in this year’s ceremony.\n Lee spoke again. “This time, the one you need to be careful of is the only son of Ji Yichuan – Ji Ning! Although he hasn’t experienced any real life-and-death battles yet, he has still trained in the highest class techniques of our Ji clan. Although the techniques I taught you are also top-class, compared to his, they are still slightly inferior.”\n Grizzly nodded.\n He understood. He was, after all, just an adopted son. But Ji Ning? He was the only son of the Raindrop Sword, Ji Yichuan, and also the heir presumptive of the position of Prefecture Lord. The difference in status between the two was simply too great. Ning could easily obtain the ultimate techniques of the Ji clan, but he, an adopted child, couldn’t possibly be permitted to learn the most powerful techniques of a clan.\n “In addition, Ning just reached the level of ‘one with the sword’ this year.” Lee looked at his adoptive son. “Don’t be over-confident.”\n “I, your son, will definitely be victorious.” Grizzly growled.\n ---------------------------\n The Ceremony of the Golden Sword began!\n Large numbers of tribal youths were at the bottom, fighting against each other wildly. One youth after another was cast out, with the stronger ones left behind. After a full month of battles, finally, the most powerful eight youths were selected. Or, to be more precise…seven youths were selected. There was another person who was automatically registered as one of the final eight, without having to undergo any competitions. Ji Ning!\n Ji Ning, the only son of the Raindrop Sword, Ji Yichuan! The most talented youngster of the Ji clan of the West Prefecture.\n According to what the Ji clan of the West Prefecture said to the outsiders, Ji Ning was so powerful that he didn’t need to enter the competition at all. He could directly be included in the top eight.\n Anger?\n Injust?\n “Hrmph. On the last day, when he encounters the other seven experts, this Ji Ning will definitely be utterly thrashed.”\n “He really will stoop to nothing!”\n “He brings shame to the Ji clan!”\n Some of the tribal youths muttered secretly amongst themselves. Only a very, very few of the tribal youths had heard the news that Ji Ning had already reached the level of ‘one with the sword’.\n -------------------------\n “Huahuahua….” The battle flag flapped loudly.\n The desolate, cold wind extinguished the furious flames in the hearts of many, because today would be the final day of the Ceremony of the Golden Sword!\n At the center of the wide training fields, there was an enormous dueling platform, with eight tribal youths standing below it. One of them was the beast fur clad Ning. Outside was a large number of black armored riders who surrounded the dueling platform protectively, preventing any of the tens of thousands of tribal youths and citizens of the West Prefecture City who had come to watch the battles from drawing any closer to the dueling area.\n “They are here.”\n “The Xiantian lifeforms have come.”\n The tens of thousands of spectators gathered here all became very excited. The Ceremony of the Golden Sword had proceeded for so long now, and usually, there weren’t so many spectators. But today was special! Because today was the final day of the Ceremony of the Golden Sword, and the final eight competitors would, in the final contest, determine who was the most powerful and who would seize the golden sword.\n On the last day of the Ceremony of the Golden Sword, many legendary Xiantian lifeforms would also come and watch!\n “That person riding the long-necked monstrous beast, that’s the Heavenly Firehammer.”\n “The one riding that white tiger is the number one archer of our Ji clan of the West Prefecture!”\n “That…that’s the Fire God, Ji Lee!”\n “Look, Raindrop sword! Over there, the one with a big, snow-white dog next to him is the Raindrop Sword, Ji Yichuan! The big snow-white dog next to him is a Xiantian lifeform, the ‘Whitewater Hound’!”\n “Prefecture Lord!”\n “The Prefecture Lord, Ji Young, has appeared as well!”\n “Why are there so many Xiantian lifeforms present? There’s too many of them!”\n “So many Xiantian lifeforms!”\n …..\n Utter insanity. Utter pandemonium.\n The Ceremony of the Golden Sword was only held once every four years, after all. Generally speaking, only a few Xiantian lifeforms would come watch, but today, many legendary figures had come, such as the mysterious, rarely seen number one expert of the Ji clan of the West Prefecture, the Raindrop Sword, Ji Yichuan. Or the man as wild and as arrogant as a Fire God, Ji Lee!\n The ten overseers had all come, not a single one of them missing.\n This was because this wasn’t just a Ceremony of the Golden Sword. More importantly…this was a test and skirmish which would determine who the next Prefecture Lord would be! As long as Ning was able to seize the golden sword, then he would be the next Prefecture Lord. Since this event involved something as important as who the next Prefecture Lord would be, almost all of the Xiantian lifeforms in the Ji clan of the West Prefecture naturally came to witness it.\n “Today is the final day of the Ceremony of the Golden Sword.” A cold voice rang out from a woman with long hair that gleamed with blue light who stood on the dueling platform. “Now, let the eight youths ascend the platform.”\n Shua! Shua! Shua! Shua! Shua! Shua! Shua! Shua!\n Eight shadows leapt onto the dueling platform in succession.\n Ning glanced at them and found that virtually all the seven other opponents were staring at him. Clearly, all seven of them felt disdain for him being allowed to directly be placed amongst the final eight without having to advance through the many tiers of battle like they had.\n “Do you think I wanted it to be like this?” Ning pursed his lips. It had totally been the decision of Prefecture Lord Young for him to be designated as one of the eight. “However, these seven fellows really are tall. Even the shortest of them, a woman, is at least 1.7 meters, slightly taller than me…ugh, and this big, stupid fellow is probably 2.3 meters tall.”\n Although they were ‘youths’, all of them were very accomplished in their training, and most were almost sixteen. Only Ning was just ten years old. Naturally, he was the shortest of them.\n “The eight of you will fight each other, one at a time. The loser will leave, and the winner will remain, until four remain. And then, you will duel until only two remain, then finally, the strongest will be chosen.” The long haired woman said.\n Ning and the other seven youths were listening.\n Suddenly…\n “Halt!” A cold voice rang out.\n The spectating tribal youths and citizens of Ji clan of the West Prefecture all turned towards the sound of the voice. Even the long haired woman turned and frowned. She was a Xiantian level expert of the Ji clan of the West Prefecture, and she had only come to officiate today because it was the final day. Who was causing such a ruckus at a time like this? She turned her head and saw…that the speaker was a callous-looking man dressed in white fur.\n The long haired woman trembled.\n “The Raindrop Sword, Ji Yichuan.”\n “Raindrop Sword.”\n “The Raindrop Sword looks like a giant iceberg, just standing there. I feel my heart growing cold just looking at him.” The tens of thousands of spectators had excited looks in their eyes. All of the Xiantian experts present were like Fiendgods to them, but Ji Yichuan was the most dazzling expert in these lands, a legendary figure.\n Yichuan sat there and said coldly, “The final day of the Ceremony of the Golden Sword is for selecting the most powerful of the eight finalists to be the one to seize the golden sword. As I see it…let Ji Ning fight the other seven!”\n “One against seven?” The long haired woman was stunned. “But…but…”\n “What?!”\n “One against seven? The other seven are all highly talented youngsters.”\n “But!”\n A scene of utter shock.\n Even the Prefecture Lord, Ji Young, seated next to Yichuan, was amazed. As for the old man with the viper, Ji Lee, who sat on the other side of Ji Young, he immediately laughed loudly. “Wonderful. One against seven. Ji Ning is the most talented youngster in our Ji clan of the West Prefecture. Even if he loses, this would be a form of training for him. But Yichuan…if your son loses his battle against the seven of them, then what?”\n “If he loses, then he admits defeat, and has nothing to do with the golden sword!” Yichuan said calmly.\n “Good.” Lee nodded.\n Ji Young looked at Yichuan curiously, then spoke out. “Let it be as Yichuan has said.”\n “Yes, Prefecture Lord.” The long haired woman, seeing the situation, nodded. The two most powerful factions in the Ji clan of the West Prefecture had both agreed. Naturally, she had nothing to say about it. All she could do was inwardly sigh that the Raindrop Sword, Ji Yichuan, was perhaps too arrogant.\n “The eight of you.”\n The long haired woman looked at the eight youths. “Come here and select your weapons. After choosing your weapons…wait for my order. Once I give the order, it will be Ji Ning fighting against the seventh of you. If Ji Ning loses, or if the seven of you lose…then this combat will come to an end.”\n “Hua.” With a wave of her hand, the long haired woman made a large number of weapons appear out of nowhere onto the dueling platform. There were all types of weapons. Only, none of them were sharpened!\n “Choose.” The long haired woman said.\n Ning and the other seven youths all strode forward, quickly choosing their weapons. Ning chose a sturdy black longsword that weighed roughly fifty pounds.\n The tens of thousands of spectators below were all engaged in conversation. Many of them were only now seeing the ‘Raindrop Sword’, Ji Yichuan, for the first time. They felt as though Yichuan was like a piece of ancient, glacial ice, so cold that their hearts trembled. “Ji Yichuan is perhaps too arrogant and exacting, and he even treats his son the same way. One against seven? Even if Ji Ning’s true power is beyond that of the other seven, how can he possibly beat all seven of them at once?”\n “He’s truly insane.”\n “I hear that Ji Ning is only ten years old, but his father has already ordered him to come here and attend the Ceremony of the Golden Sword, and even wants him to fight one on seven. Poor fellow.”\n Many of the spectators now began to feel sympathy for Ning. After all, Ning was the smallest and shortest of the eight youths on the dueling platform, and the youngest one as well. In addition, Ning was so handsome…this slender, handsome youngster had a father who was so legendarily cold and severe. One could imagine how strictly this youngster’s father usually governed him.\n “Are you done choosing?” The long haired woman looked at the eight youths.\n Seven of the youths were standing on one side of the dueling platform. They had their weapons ready, be it a sickle, a spear, a straight saber, or a sword. All of them stared at Ning.\n On the opposite side of the platform stood Ning, all by himself.\n Ning wielded a sword in his hands, staring calmly at them.\n “Since you’ve made your choices…” The long haired woman waved her hand, reclaiming the heap of blunt weapons that were on the side while saying, “Then you can begin.”\n Just as her words came out…\n Swoosh! Swoosh! Swoosh! The seven figures on the other side of the platform moved over at high speed, simultaneously charging at Ning, who stood on the other side.\n \n \n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-2-chapter-7","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.\n","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
