{"id":49980,"no":283,"title":"Book 11, Chapter 2 - The Eight Loose Immortals of the Black-White College","content":"In the skies above Stillwater City. There were nine Flood Dragons, pulling an Immortal carriage behind them, which had come to a halt above the Heavenly Treasures Mountain.\\n\\n “Patriarch, wait here. I will go investigate Ji Ning in detail,” the Godplume Duke said respectfully.\\n\\n “Also, Ji Ning’s mother is named Yuchi Snow; purchase an intelligence report on her as well.” Patriarch Arcanum remained seated aboard the Immortal carriage as he calmly gave the orders.\\n\\n “Yes.”\\n\\n The Godplume Duke immediately flew down into the Heavenly Treasures Mountain. Just a short while later, the Godplume Duke walked out from within it. With a blurring movement, he flew back into the sky, next to Patriarch Arcanum, respectfully handing him a book with two characters on it – JI NING.\\n\\n “Just Ji Ning’s?” Patriarch Arcanum frowned.\\n\\n “Ji Ning’s mother, Yuchi Snow, was a minor Xiantian lifeform who hadn’t accomplished any major deeds; the only record of her is that she had a son named Ji Ning. The Heavenly Treasures Mountain informed me that there is virtually no intelligence regarding Yuchi Snow, and all of what they have is in this tome,” the Godplume Duke explained.\\n\\n Patriarch Arcanum nodded softly.\\n\\n Although the Heavenly Treasures Mountain’s intelligence unit was spread throughout the world, they weren’t as all-knowing as the heavens themselves. They, too, needed to engage in deep, careful investigations in order to find things out. Yuchi Snow and her family’s flight was a very secretive thing to begin with; even the Youngflame clan hadn’t been able to catch these final few fish who had fled their net. It wasn’t strange for the Heavenly Treasures Mountain to be unaware of it as well.\\n\\n “Ji Ning? He’s actually this young?” Patriarch Arcanum, upon seeing the report, was shocked.\\n\\n His beloved Youngflame Nong had trained for more than a century. Amongst Wanxiang Adepts, that was actually quite young, because Wanxiang Adepts could live for up to eight hundred years. Unexpectedly, this kid who had killed the Fiendgod Xiangliu Fang as well as Youngflame Nong, this kid who had already reached the Grand Dao Domain level in the Dao of the Sword, was actually this young!\\n\\n “The more impressive his potential, the more he needs to die!” A cold light flashed through Patriarch Arcanum’s eyes. He quickly flipped through the report, finishing it.\\n\\n “Swallow Mountain? Serpentwing Lake?” Patriarch Arcanum hummed to himself, then instructed, “Come, let’s go to the Black-White College.”\\n\\n ……\\n\\n The Black-White College had made thorough preparations long ago. Mu Northson, Yu Wei, and Adept Vastriver had used the closest teleportation array to first go straight to the Crimson Dragon Mountains, and then from those mountains to Stillwater City; they had moved fairly quickly, and as soon as they had returned to the Black-White College, they had immediately reported this event to the higher-ups.\\n\\n The Headmaster’s Palace of the Black-White College. This was also the place where they welcomed important guests.\\n\\n Within the palace were multiple seated figures. On one side of the palace sat the black-robed, black-haired Immortal Diancai, along with Immortal Fivecraze and the rest of the Immortals. There were a total of eight of them. Behind them stood Headmaster Jadesea and three of the third-generation disciples; Rainbowflame Fairy Yu Wei, Adept Vastriver, and Mu Northson.\\n\\n In front of them sat Patriarch Arcanum and the Godplume Duke.\\n\\n “I imagine you all know why I have come here today.” Patriarch Arcanum sat there and spoke calmly as he swept his gaze across the group of Immortals before him.\\n\\n Eight Loose Immortals and Earth Immortals.\\n\\n Virtually all of the Loose Immortals of the Black-White College who were normally in closed-door meditation, in seclusion, or adventuring had returned. Aside from a single Loose Immortal who had already left this major world and wouldn’t be able to make it back in time, the other eight had all returned. The Immortal cultivators of the Black-White College were all absolute elites; they all had mastered a complete Dao-Path, which was a prerequisite for them even reaching the Primal Daoist level. Only after mastering two Dao-Paths, however, were they permitted to break through to the Earth Immortal level!\\n\\n This is why the Primal Daoists of the Black-White College were comparable to Loose Immortals in combat power. As for the Loose Immortals of the Black-White College… each of them were capable of fending off ten ‘normal’ Loose Immortals. Each of them had the combat power of a supreme Loose Immortal.\\n\\n “Of course we know.” The short old man, Immortal Fivecraze, chuckled as he spoke. “Youngflame Nong of your Youngflame clan was killed by our disciple, Ji Ning, correct?”\\n\\n “Correct,” Patriarch Arcanum replied calmly.\\n\\n “If he died, he died. When young people are out adventuring, it’s normal for them fight and kill each other. If you are weaker than someone else, you die. That’s normal,” the short elder said. “If you have to blame someone, you can only blame yourself for being too weak. Generally speaking, the clans and sects won’t intervene.”\\n\\n For example, the wild marshes of the Gaol Mountains; Ning’s group had often fought internally and quite a few had died, but no sect had ever come for reprisal against another.\\n\\n Patriarch Arcanum’s gaze instantly changed. It became sharp.\\n\\n “However, if you, senior Arcanum, doted on this Youngflame Nong to the point where you would lower yourself to personally attack Ji Ning, there’s nothing our Black-White College can do about it.” The short elder sighed, “So… I really don’t understand why, senior Arcanum, you have come to our Black-White College?”\\n\\n “Hand over Ji Ning,” Patriarch Arcanum said coldly, “And this matter will have nothing to do with your Black-White College. Otherwise… hmph!”\\n\\n Instantly, the faces of the Immortals of the Black-White College changed.\\n\\n Hand over Ji Ning?\\n\\n “Forget it!” The black-robed, black-haired Immortal Diancai snapped coldly, “Ji Ning is a disciple of our Black-White College. If he were to die while adventuring in the outside world, we wouldn’t blame others… but you want us to hand him over? Are you dreaming? And, let me tell you something – so long as Ji Ning returns to the Black-White College, your Youngflame clan can forget about harming a single hair on his head.”\\n\\n “Senior Arcanum, we respect you as a Celestial Immortal, but our Black-White College, which has existed for so many generations, isn’t so easily abused either,” the short, elderly Immortal Fivecraze warned coldly as well.\\n\\n “Our Black-White College has our own rules; if our disciples die while adventuring, we won’t blame others, but once they return, then they will absolutely be protected by us.” The tall, muscular man wrapped up in chain links spoke out in a loud, rumbling voice, his eyes seemed to be filled with thunder.\\n\\n Patriarch Arcanum’s face sank. “Oh, so your Black-White College wishes to become enemies with my Youngflame clan.” Patriarch Arcanum swept these Immortals with his gaze.\\n\\n The Youngflame clan was, indeed, powerful. It was much more powerful than even the Northmont clan of Stillwater. It had more than a thousand Loose Immortals and Earth Immortals; from this, one could imagine how mighty they were! However, just because they were powerful didn’t mean they could freely abuse other powers; for example, the Black-White College was located within Stillwater City. Who would dare launch a massive attack within Stillwater City? There would only be one result – becoming wanted criminals of the Grand Xia Dynasty!\\n\\n As for fighting in the outside world?\\n\\n Every single Loose Immortal of the Black-White College was top-tier; each of them were capable of fighting against ten Loose Immortals! If they completely focused on fleeing, it would be very hard to deal with them.\\n\\n “It isn’t that we wish to become enemies with you; rather, your Youngflame clan is forcing us to become enemies. If our Black-White College can’t even protect our own disciples, what the hell type of College would we be?” Immortal Diancai replied coldly.\\n\\n “If that’s the case!” Patriarch Arcanum coldly rose to his feet. “Then don’t blame the Youngflame clan for our future actions. Let’s go!”\\n\\n “Yes, Patriarch.” The Godplume Duke followed by his side.\\n\\n But just as Patriarch Arcanum was about to lead the Godplume Duke to leave, a voice suddenly rang out. “Brother Arcanum.”\\n\\n A hunchbacked old man suddenly walked in. His hair was completely white, and his eyebrows drooped downwards. He was leaning against a wooden cane as he walked in.\\n\\n Patriarch Arcanum was momentarily startled. Then, he let out a cold laugh. “Hunchmont? You are still alive?”\\n\\n “You haven’t died yet; how could I?” The hunchbacked old man laughed.\\n\\n “Senior Hunchmont.”\\n\\n The eight Loose Immortals of the Black-White College all rose to their feet and saluted respectfully. Celestial Immortal Hunchmont… he was one of the most famous Celestial Immortal Patriarchs in the history of the Northmont clan. However, because he had lived for so very long, many outside schools and sects thought him to be dead; after all, Celestial Immortals would occasionally engage in battles against each other for the sake of their tribe or for certain treasures. After many battles, some would eventually fall.\\n\\n “The Black-White College belongs to our Stillwater Commandery.” The hunchbacked elder leaned against his cane. “Arcanum, if you want to deal with their disciples, there is nothing they can do to stop you; why must you force the Black-White College to hand Ji Ning over? If you have the ability to do so, go ahead and deal with him yourself; our Northmont clan absolutely won’t interfere. But if you were to deal against the Black-White College, you would be stepping beyond your bounds! Stillwater Commandery belongs to the Northmont clan!”\\n\\n Patriarch Arcanum’s face sank. Although the Youngflame clan was even more powerful than the Northmont clan, there was a limit to their strength; the Northmont clan held a marquisdom, and it had existed since the Fiendgod Era as well. After the passage of so many years… who knew how many trump cards the Northmont clan of Stillwater might be holding in secret?\\n\\n “Fine. Since you, Hunchmont, have spoken out…” Patriarch Arcanum nodded. “Then I won’t quibble with the Black-White College. However, this Ji Ning… he absolutely must die! If anyone tries to stop me, I’ll kill them as well! Fujun, let’s go.”\\n\\n Patriarch Arcanum led the Godplume Duke out of the Headmaster’s Palace. They boarded the Immortal carriage, then quickly flew into the skies and disappeared.\\n\\n “Senior Huchmont.” Immortal Fivecraze walked over, watching as Patriarch Arcanum flew away aboard the Immortal carriage. “This Patriarch Arcanum seems to be a bit too arrogant.”\\n\\n “That’s just the way he is. He’s like a madman.” The hunchbacked elder laughed. “Don’t worry about him. But that Ji Ning of yours… you had best not interfere. Given how murderous Patriarch Arcanum seems to be feeling right now, you won’t be able to stop him. Alright, it is time for me to go. Such a pity. Ji Ning was a fine young sapling. What a pity.”\\n\\n And then, the hunchbacked elder left.\\n\\n ……\\n\\n Within another world. The underwater estate.\\n\\n Ning had just appeared within the main hall. He immediately saw the giant yellow bear and the old black bull.\\n\\n “Seniors,” Ning was about to speak out.\\n\\n “You caused a huge mess in the outside world, eh?” The giant yellow bear said, “You were in such a frantic hurry to order all of the people off of Brightheart Island.”\\n\\n “I did cause a huge mess, yes,” Ning said hurriedly. “I have…”\\n\\n The giant yellow bear interrupted Ning. “Let me ask you this; have you completed your arrangements in the outside world?”\\n\\n “I have.” Ning nodded.\\n\\n “Mm.” The giant yellow bear nodded. “I can sense the turbulence in your heart. Your mind is currently in a state of chaos. First, go to the Stellar Hall and read some of the star maps within it. After reading a few books and calming yourself down, come and speak to me regarding your matters.”\\n\\n Ning was startled. “Read in the Stellar Hall?”\\n\\n “Go,” the giant yellow bear instructed.\\n\\n “Yes, senior.” Ning didn’t disobey. He went straight to the Stellar Hall.\\n\\n Within the Stellar Hall. Outside the thatched cottage.\\n\\n Ning carried a book to the stone desk, then sat down, opened it up, and began to force himself to calm down and read. He had first killed Youngflame Nong, then separated with Ninelotus, and then arrange for the monsters of the Immortal estate to protect his clan. Whenever Ning thought about the impending arrival of the Youngflame clan, Ning’s mind would become filled with a myriad of random thoughts, causing him to feel extremely restless.\\n\\n “Today, Chang came to pay his respects to me…” Ning’s voice reverberated within this small pocket world. Every single word was extremely simple, but when joined together, they became filled with boundless magical power. In a very natural way, Ning began to calm down; in fact, he even began to slowly enter a state of attunement and meditation on the Dao.\\n\\n Calm.\\n\\n Relaxation.\\n\\n The restlessness in Ning’s heart faded away, and Ning raised his head to stare at the stars in the sky.\\n\\n Suddenly… rain began to fall down from the skies, as fine as silk, sprinkling everywhere, including upon Ning himself.\\n\\n \\n\\n \\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-11-chapter-2","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.\\n","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
