{"id":49727,"no":30,"title":"Book 2, Chapter 12 - A Slaughter Begins","content":"The Aquatic Rhino King, seated on his stone chair, glanced at the bald armored guard. Reaching out with his enormous hand, he grabbed a nearby bound youth, placing the youth down on his thigh. The youth, on the thigh of the Aquatic Rhino King, was like a tiny doll, without any ability to resist at all. The youth screamed in pain, “He told you to go capture people, so do so. All you need to do is capture a thousand people. Oh mighty Aquatic Rhino King, the two we just captured, plus the nineteen you ate earlier, means that I have already ordered my subordinates to capture five hundred and eighty three humans for you already.”\\n\\n “Don’t worry.” The voice of the Aquatic Rhino King was still very low and very thick. “I, the Aquatic Rhino King, will do what I promise. After you catch a thousand people, I will definitely spare you.”\\n\\n “Baldy!” The Aquatic Rhino King stared with his massive eyes at the bald armored guard. “Don’t try to use the Ironwood clan’s name to try and scare me. Here in the Eastmount Marsh, every year, how many disciples of the Ironwood clan and the Ji clan die? You came to adventure in Eastmount Marsh. If you die, you die! Even if this soft-skinned, tender-fleshed ‘young master’ of your Ironwood clan really has an extremely high status, if I were to kill you all, most likely it would be a long time before the Ironwood clan found out that you were all dead, and wouldn’t be able to find out who the killer was!”\\n\\n The Blue Guards could only grit their teeth.\\n\\n The Aquatic Rhino King laughed, and with a wave of his hand, tossed the bound ‘young master’ of the Ironwood clan to the ground again.\\n\\n “All of you, go out and capture more people. Go capture more, quickly. Go capture more of these lowly peasants.” Lying on the ground, the Ironwood clan’s ‘young master’ was roaring angrily.\\n\\n “But young master.” The bald armored guard said frantically, “We’ve already captured virtually all of the hunters and fishers here in Eastmount Marsh. Even if there were any more here…there would only be a very few. It’s going to be very hard to reach four hundred.”\\n\\n The young master of the Ironwood clan, lying on the ground, howled fiercely, “Then find a tribe. Any who resist, slaughter them all. Bring the rest back here. You should be able to find a few hundred people in a tribe, right?”\\n\\n “Massacre a tribe?” The bald armored guard was stunned.\\n\\n “What are you afraid of?” The Ironwood clan’s ‘young master’ roared, “If you are afraid, then go to the territory of the Ji clan! Go massacre a clan in the Ji clan’s territory. Kill any who resist and bring the others back.”\\n\\n The bald armored guard clenched his teeth. “Yes!”\\n\\n If it was a case of the two major sides engaging in battle, or an order from their master in ordinary circumstances, they wouldn’t hesitate at all to kill. But they were now serving a Diremonster to kill and torture other humans…this caused the valiant armored guards to feel incomparable shame.\\n\\n “Haha…” The Aquatic Rhino King laughed loudly, his voice like thunder. “Good, good, good. After you round up a thousand humans, I’ll definitely spare you.”\\n\\n “Boom!”\\n\\n The Aquatic Rhino King rubbed his rumbling stomach, licking his lips. “Just ate a man. Now I’m hungry again! Who should I eat?” The Aquatic Rhino King cast his gaze towards the others, and instantly, the people who were tied up all had changed looks on their face. Many people’s eyes were filled with fear.\\n\\n They had personally witnessed this Diremonster eat someone alive earlier. They weren’t afraid of death, but to be eaten one bite at a time was a sort of hell!\\n\\n “Um?” The Aquatic Rhino King’s gaze landed on the distant Ning, and his eyes lit up. “Um, that human youth’s skin is so delicate and so clean. He seems very young. His flesh definitely will be delicious. Quick, someone, go bring him to me.” As he spoke, he began to drool.\\n\\n “Young master.” Uncle Dala looked frantically towards Ning. There were ten Blue Guards next to them.\\n\\n “Move it.” A Blue Guard grabbed at Ning’s beast fur clothes.\\n\\n Ning turned his head and glanced at the Blue Guard. With a movement of his right hand, he sent his right palm chopping towards the chest of the Blue Guard. Bang…a low sound rang out, and the Blue Guard was sent flying far away into the air. His eyes were bulging and round, and his mouth was hanging wide open. His face was red. Bang! Fresh blood spewed out from his shattered organs. He fell into the watery marsh over a hundred meters away, and as he did, he kicked up a splash of water, then sank down, not moving at all. Clearly, he was dead.\\n\\n “To willingly serve as the fangs and claws for a Diremonster and harm those of your own race…you deserve death!” A cold voice rang out.\\n\\n Utter silence.\\n\\n The five hundred plus people who were tied up on the hill, as well as the hundred plus Blue Guards, and even that seated Diremonster, the Aquatic Rhino King, all turned to look at the seemingly fragile youngster.\\n\\n A single palm sent someone flying over a hundred meters?\\n\\n “Wonderful!” The Aquatic Rhino King was the first to react, and he actually became excited. He naturally was very happy to witness humans killing each other, and he immediately shouted, “Aren’t you going to fight him? He just killed one of your people! Quick, fight!”\\n\\n “Kill!” The other Blue Guards instantly saw red, and all of them transformed into cruel blurs as they pounced towards him. The youngster in front of them had just killed one of their comrades. When their comrade had died to that palm just now, the only thing that could be said was that they were unable to react in time. In addition, this youngster probably trained in some sort of Fiendgod Body Refining technique. He just had a bit of strength, that was all.\\n\\n In a life and death battle, what mattered was the sword and saber techniques which one had refined and trained in. Even if one was much physically weaker, one’s sword would still be able to pierce through an opponent’s skull!\\n\\n Hu! Hu! Hu! Twenty Blue Guards attacked in unison.\\n\\n With a wave of his hand, Ning pushed the nearby Uncle Dala, who went flying. Dala somersaulted in a midair, then landed on the ground, completely uninjured. Uncle Dala looked frantically at the twenty Blue Guards charging towards Ning. “Young master, be careful.”\\n\\n “Be careful.”\\n\\n “Quick, run.”\\n\\n “Young man, quick, run!”\\n\\n The bound prisoners all grew frantic as well, and they began to call out, staring at the youngster with worry. They knew how powerful these Blue Guards were…these Blue Guards were highly experienced Ninefang Warriors who were extremely skilled at group attacks. These were elite soldiers of the Ironwood clan. Only a Xiantian level lifeform would be able to survive the attack of twenty of these Blue Guards.\\n\\n Faced with the attacking Blue Guards, Ning suddenly transformed into a gust of wind, the carefree wind which went where it pleased. When the Blue Guards chopped and stabbed at them with their sabers, spears, and sharp swords, Ning leisurely stepped past, easily making his way past their combined attacks.\\n\\n Hu!\\n\\n Pa! Pa! Pa! Pa! Pa! Pa!\\n\\n A series of palm slapping sounds in a row. Even as Ning made his way past the attacks of the twenty Blue Guards, he slapped out with his palms, each strike coming from his wrist and striking onto the faces of the Blue Guards. Each palm strike of Ning’s carried ten thousand pounds of force, and sent these Blue Guards flying. No one was able to block Ning’s palm.\\n\\n Hu!\\n\\n Ning’s body came to a halt. All twenty of the Blue Guards had been knocked flying to the side, all of their heads and necks crooked and twisted, blood flowing from their mouths, noses, and ears.\\n\\n All of them dead!\\n\\n “What?!”\\n\\n “Good heavens!”\\n\\n “But…but…”\\n\\n The hundreds of bound people and the Blue Guards of the Ironwood clan…even the Diremonster was shocked.\\n\\n “You…you…” The young master of the Ironwood clan who was lying there bound on the floor was both furious and frantic.\\n\\n “We are the Blue Guards of the Ironwood clan.” The other Blue Guards had very ugly looks on their faces. They were furious, but didn’t dare to make a move.\\n\\n Ning said with cold calm, “To willingly serve as the claws and fangs of a Diremonster is a crime that deserves death.” The Ironwood clan and the Ji clan were enemies to begin with, and these dead enemies had even been willing to serve as the claws of a Diremonster!\\n\\n Hua!\\n\\n A sharp sword appeared out of nowhere into Ning’s hands. His feet moved, and then sword light began to flash…in the blink of an eye, nine of the Blue Guards held their throats, gurgling a few times, before collapsing, blood flowing from the wound in their necks. In terms of footwork or swordplay, this youngster was extremely fast, causing the other Blue Guards to be terrified.\\n\\n Earlier, Ning had already been terrifying without even using his sword. But now, he began to wield his sword.\\n\\n “Quick, run.”\\n\\n “Aquatic Rhino King, save us!” The Blue Guards were completely frantic. This youngster who had appeared out of nowhere was clearly about to massacre them.\\n\\n The Aquatic Rhino King just sat there, laughing loudly. “All I said was that if you seized a thousand humans, I’d spare you. I never said I’d save you from others. Kill, kill, kill.” The Aquatic Rhino King wasn’t worried at all. To him, a Diremonster, these humans in front of him were nothing more than humans. This was nothing more than internal warfare amongst humans.\\n\\n Chi! Chi! Chi!\\n\\n Blood was flying everywhere, and one Blue Guard after another fell down lifelessly. The Blue Guards all fled in every which way in terror. They were truly frightened now. Their swordplay and saberplay, against this youngster, clearly weren’t enough to even withstand a single blow.\\n\\n “Quick, run.”\\n\\n “Quick.”\\n\\n Hu….moving at extreme speed with the sound of the wind, multiple blurry forms of Ning appeared out of nowhere. Every single Blue Guard fell where they stood. Some had been stabbed through the heart, others had their throats cut. Blood stained the ground. The Blue Guards lay collapsed on the ground, scattered throughout the area.\\n\\n Every single Blue Guard had died!\\n\\n “Hrm?” The Aquatic Rhino King, previously just enjoying the show, suddenly stood up, his face changed. The last, full-strength attack which Ning had employed had pushed his speed to the utmost limit, generating dozens of blurry images. This had truly stunned the Aquatic Rhino King. Before this, he hadn’t considered this youngster as a potential opponent. But now, he began to feel a bit wary.\\n\\n “Too powerful.”\\n\\n “So strong.”\\n\\n “They deserved to die.” The bound people all felt extremely excited. They hadn’t expected this youth to be as powerful as this. Could it be that this powerful youth was so powerful…that he was going to kill this terrifying Diremonster?\\n\\n Swish! Swish! Swish! Sword light flashing, the ten or so people around Ning instantly found their binds had been cut through.\\n\\n “Human youth.” The Aquatic Rhino King transformed into a black blur, charging towards Ning and smashing down at him with a massive fist that was covered with a thick layer of ice. “They are my food.”\\n\\n “Clang.”\\n\\n Ning struck out with his Darknorth sword, stabbing straight towards that massive fist.\\n\\n BANG!!!!\\n\\n It was as though a mountain had collapsed. Ning flew back a hundred meters, and the layer of ice on the fist of the Aquatic Rhino King also exploded, and even half the arm of the monster had exploded. The watching tribesmen all revealed looks of joy and expectation on their faces. Had the Diremonster’s arm been destroyed?\\n\\n “Excellent.” The Aquatic Rhino King growled. “You are worthy of me using my real form.”\\n\\n The Aquatic Rhino King suddenly transformed into a huge, watery fog, and then the enormous fog of water suddenly coalesced at high speed, transforming into a hill-sized, thirty meters tall massive monster. This was an enormous Aquatic Rhinoceros. It was covered with an extremely thick blue hide, and was seventy meters long. It truly was like a small mountain. The energy emitting from its nostrils caused the ground to be covered with a layer of thick ice, and the nearby tribesmen were instantly frozen into ice statues. At this time, Uncle Dala was still rapidly rescuing the other members of his clan.\\n\\n “Quick, leave.” The distant Ning transformed into a stream of light, travelling atop the water. In but an instant, he scurried over, and as his sword flashed, the ropes binding the dozens of men were instantly cut apart.\\n\\n “Why aren’t you leaving?” Ning roared angrily, and then turned to stare at the giant monster.\\n\\n These people quickly grabbed the weapons lying on the ground, cut open the ropes on the people next to them, and then in the blink of an eye, the four hundred lucky survivors quickly fled.\\n\\n “Fleeing? I’m going to freeze you and slowly enjoy eating you.” The Aquatic Rhino King stared around him. Instantly, a cold aura began to radiate forth, and the temperature rapidly began to lower. A layer of ice and frost began to spread out, and instantly, some people were turned into ice statues. Only the fastest runners and the likes of Uncle Dala, who had fled long ago, managed to survive.\\n\\n “I am the Ironwood clan’s…” The young master of the Ironwood clan was still shouting fiercely, but halfway through his words, he turned into an ice statue.\\n\\n In the blink of an eye, the area within thirty meters of the Aquatic Rhino King had turned into a graveyard.\\n\\n Only Ning and the Aquatic Rhino King remained, staring at each other.\\n\\n From off in the distance, Uncle Dala and the dozens of lucky survivors still felt the aftertaste of terror. A young man near Uncle Dala said with concern, “Uncle Dala, will that young fellow survive?”\\n\\n “He will, he will.” Uncle Dala said with his mouth, but in his heart, he didn’t feel too confident either. Would that youngster with astonishing strength and swordplay be able to defeat the vicious, ferocious Diremonster?\\n\\n “Why haven’t you left yet!”\\n\\n The distant Ning roared in anger.\\n\\n Once the battle began, this distance of a three hundred meters, to the likes of Ning or the Aquatic Rhino King, would be nothing at all. He wouldn’t be able to help save them.\\n\\n “Let’s go.” Uncle Dala gritted his teeth, then led his tribesmen to flee. As for those of other tribes, they had fled long ago. They had been utterly frightened.\\n\\n \\n\\n \\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-2-chapter-12","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.\\n","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
