{"id":50039,"no":342,"title":"Book 12, Chapter 25 - Secret Art ‘Wavefolding’","content":"Boom! Boom! Boom! Boom! Boom! Boom!\\n\\n The Sloppy Daoist’s six arms were currently striking out like six venomous serpents, moving with unstoppable ferocity and extreme viciousness! His savage attacks seemed as torrential as a storm of rain, and each strike was potentially lethal. Clearly, he wanted to seize this chance to break down Adept Ninedeaths; after all, she had lost an arm and now had only five remaining.\\n\\n “Hahaha...hahaha…” Adept Ninedeaths actually let out a delighted laugh. Each of her palm blows seemed to contain the power of life and death within them, causing everyone who looked at her to feel a stifled feeling. She madly blocked all of the Sloppy Daoist’s attacks, and she even used her own body to block some strikes to win a little bit of time.\\n\\n The Sloppy Daoist was ferociously attacking, while Adept Ninedeaths was striving to hold on until her severed arm had regrown.\\n\\n “Not good!”\\n\\n Ji Ning, Yu Wei, and Yuchi Xiyue all felt nervous as they saw this. Even though Adept Ninedeaths only had five arms, the Sloppy Daoist remained unable to shatter through her defenses. She was currently planning to hold on until her sixth arm grew back…at which point, it would be even harder for the Sloppy Daoist to defeat her.\\n\\n “Is this all he has…this disciple which Grand Emperor Xuanwu took such a fancy to?”\\n\\n He can’t even defeat an unaffiliated cultivator like Adept Ninedeaths?” The True Immortals at the front of the Skylight Palace were all quite puzzled. As they saw it, given Grand Emperor Xuanwu’s status, his disciple should naturally be extraordinary. Otherwise, that would be an utter loss of face for Grand Emperor Xuanwu.\\n\\n Lu Dongbin, by contrast, was staring far into the distance. Smiling, he said, “This battle is interesting. This Adept Ninedeaths has an extremely deep level of insight into the Grand Dao of Mortality; in fact, I even suspect that she has memories from several previous lives…she is definitely extremely strong. Can it be that the Sloppy Daoist is actually going to lose to her?”\\n\\n “It wouldn’t be strange if he did,” Truelord Chiji agreed.\\n\\n “Just because someone is going to become a Celestial Immortal in the future doesn’t mean they cannot lose a battle in the present.” Sovereign Hao shook his head.\\n\\n All of the Pure Yang True Immortals felt that the outcome of this battle was now in doubt.\\n\\n Based on their judgement, both the Sloppy Daoist and Adept Ninedeaths had used all of the powers available to them. The Sloppy Daoist had am impregnable defense, and his attacks were absolutely savage as well…and yet, he remained unable to do anything to his opponent. This was indeed quite dangerous for him.\\n\\n ……\\n\\n The Sloppy Daoist suddenly took a break from his frantic attacks, beginning to launch a different tempo of strikes.\\n\\n “This is…?!” Adept Ninedeaths face suddenly changed. The Sloppy Daoist was currently very calm; his six arms moved in unfathomable ways, and at almost all times four of them were defending while two of them were attacking! They felt like the waves of the sea. Each successive wave was increasingly powerful, and the same was true for the Sloppy Daoist’s attacks. When defending, he was accumulating power…and when attacking, he would let it erupt forth!\\n\\n Accumulating power, then unleashing it!\\n\\n This sort of strange tempo caused the Sloppy Daoist’s attacks to slowly become increasingly ferocious. One wave after another continued to merge into each other, causing Adept Ninedeaths to feel increasingly stifled.\\n\\n “What what what…what is this?!” Adept Ninedeaths couldn’t understand it at all. The waves were growing increasingly savage in power!\\n\\n BOOM!\\n\\n The Sloppy Daoist suddenly struck out with all six arms. They all struck out as fists with a power that felt faintly similar to an enormous black tortoise slamming against the pillars of heaven. Boom….Adept Ninedeath blocked the blows, but was knocked flying backwards. Her body had split open at many places from the force of the collision, and blood was flowing from the wounds nonstop.\\n\\n Whoosh. The Sloppy Daoist took a single step, appearing before Adept Ninedeaths. His six fists once more moved to strike out.\\n\\n “I admit defeat.” Adept Ninedeaths discontented voice rang out. She was now using all her efforts to dodge. Only now did the Sloppy Daoist come to a halt. The turtle-shell runes covering his body disappeared as well as he returned to normal.\\n\\n The dirty face of Adept Ninedeaths was filled with resentment and an unwillingness to accept this. She looked towards the Sloppy Daoist: “Sloppy Daoist; your level of comprehension of the Dao is limited, and whether I am attacking or defending, I can handle you. So why is it that this last technique of yours became increasingly hard for me to withstand…until in the end, I had to admit defeat?”\\n\\n The Sloppy Daoist just laughed. This was a battle technique he had developed after gaining insight into the Grand Black Tortoise divine ability. When he had been transmitted this Grand Black Tortoise divine ability, he had sworn an oath to the Dao of the Heavens that without permission, he absolutely wouldn’t teach anyone any part of it at all. This technique involved some of the profound mysteries of the Grand Black Tortoise divine ability; naturally, he couldn’t teach it to anyone else.\\n\\n “What is the name of this sort of battle technique?” Adept Ninedeaths quickly asked.\\n\\n “Wavefolding!” The Sloppy Daoist responded to her.\\n\\n “Wavefolding…one wave after another, folding onto each other…I was trapped within the waves, and death was the only way out…I clearly wasn’t weaker than you, but I was still defeated...wavefolding…wavefolding…” Adept Ninedeaths walked away, murmuring the word ‘wavefolding’ to herself. She even had a sudden feeling…that if she could comprehend the mysteries of this ‘wavefolding’, then she would have a chance to overcome the Celestial Tribulation and become a Celestial Immortal!\\n\\n This was a stroke of luck for her! But if she was unable to comprehend it, then in this life, her ninth life, she would probably once more fail the tribulation!\\n\\n ……\\n\\n Within the Skylight Palace’s main hall. The nearly thousand-strong Celestial Immortal Patriarchs were all frowning. Although they were very experienced, even they couldn’t understand what had just happened. Clearly, these two were both on par with each other in terms of divine abilities, comprehension of the Dao, and Fiendgod Body Refining techniques. In fact, Adept Ninedeaths was even at a slight advantage. So why, in the end, had she been defeated like this?\\n\\n It had seemed as though Adept Ninedeaths had walked into an endless tide; no matter how much she struggled, it was useless. In the end, the tide had completely drowned her.\\n\\n “What was that?”\\n\\n “How could that have happened?”\\n\\n “I don’t understand.”\\n\\n The Celestial Immortals all felt that there were strange mysteries to what had just happened. It should have been some sort of battle art they just saw, but none of them could comprehend it.\\n\\n “He truly lives up to being the disciple of Grand Emperor Xuanwu.” This was the only thing they could come up with.\\n\\n ……\\n\\n “Wavefolding!” The Xia Emperor and the rest of the nine Pure Yang True Immortals all revealed a look of surprise and amazement.\\n\\n “I sigh in amazement. I sigh in amazement!” The Immortal Elder of the Northlands shook his head and sighed with emotion, “This Sloppy Daoist truly has astonishing comprehension abilities. He was even able to comprehend some of the true exquisiteness of this secret art of Grand Emperor Xuanwu’s…when I watched that battle just now, I was even reminded of that scene from back when I was listening to Grand Emperor Xuanwu expound on the Dao.”\\n\\n “Truly incredible!” Lu Dongbin sighed in disbelief as well.\\n\\n “Formidable.” The Xia Emperor seemed to show a hinit of envy.\\n\\n “Grand Emperor Xuanwu…he truly is a major power!” Truelord Chiji’s eyes were filled with admiration.\\n\\n At their level, they actually all understood the profound principles behind the Sloppy Daoist’s ‘wavefolding’ technique. This was a technique that constantly circulated and accumulated waves of power; the longer the power was stored up for, the more terrifying the final explosion of power would be! But even if one was taught this technique and completely understood its principles, that didn’t mean one would necessarily be able to use it. This was a matter of heart, a matter of comprehension.\\n\\n They all understood some of the profound underlying principles, but as the saying goes, some things are ‘easy to understand, but hard to do’! Understanding was one part; actually executing the technique was something else entirely.\\n\\n “We can comprehend the mysteries of this Sloppy Daoist’s ‘wavefolding’ technique, but when the Grand Emperor personally executes it, the profound mysteries are countless times more complicated,” Lu Dongbin sighed. “Grand Emperor Xuanwu’s ‘Grand Black Tortoise’ divine ability…its true exquisiteness lies in a single word; the so-called ‘folding’.”\\n\\n ……\\n\\n Ning was frowning as he watched. He could vaguely sense that the final battle technique the Sloppy Daoist had used had seemed to contain an utterly heaven-shaking profound mystery. He could even sense that the Grand Dao of Taiji was mixed into it. But Ning himself did not walk upon the Grand Dao of Taiji; he couldn’t understand what he had seen at all.\\n\\n “Yu Wei, what do you think?” Ning looked towards the nearby Yu Wei; she herself was walked upon the Grand Dao of Taiji.\\n\\n “I don’t understand it. It is very profound, unfathomably so. I can vaguely sense the exquisite essence of the Grand Dao of Taiji, but that’s just one part of this secret art. I imagine that eldest apprentice-brother has only mastered the tiniest portion of this secret art.” Yu Wei completely couldn’t understand the technique either; she couldn’t get the slightest bit of insight into it.\\n\\n ……\\n\\n The Celestial Immortals were puzzled, while Ning and the others were completely baffled. Just like that…this battle ended.\\n\\n One of the top six had been determined…the Sloppy Daoist!\\n\\n Rumble…\\n\\n Suddenly, a ripple of the Dao descended within the main hall of the Skylight Palace.\\n\\n “Eh?”\\n\\n Everyone’s gazes turned in unison to stare at the point where the Dao-ripple had descended. They saw Cangwu Jiu, seated in the lotus position behind a Celestial Immortal Patriarch of the Cangwu clan. In the area around him, a hint of a black wind could vaguely be seen.\\n\\n “He comprehended a Dao?”\\n\\n “He comprehended yet another complete Dao-Path?”\\n\\n “He actually comprehended a complete Dao-Path by watching that battle?”\\n\\n Everyone present was completely astonished. Generally speaking, it was fairly common for someone to suddenly make a breakthrough during the course of a battle, but Cangwu Jiu had just been watching the battle. In that tense atmosphere, he had actually gained sudden mastery over a complete Dao-Path?\\n\\n Ning, Xiamang Zishan, Youngflame Zhan, Adept Blackstone, Adept Woodpass, Adept Whitedragon, Adept Goldcrow, and the rest of the twelve Wanxiang Adepts all sensed a new threat.\\n\\n Cangwu Jiu had been very powerful to begin with. And now, he had mastered yet another complete Dao-Path….and in doing so had immediately become a truly formidable foe!\\n\\n ……\\n\\n “But, but…” The Grand Xia Emperor, seated atop his throne above the others, shook his head and laughed bitterly. He looked towards the other eight Pure Yang True Immortals. “Everyone, how do you think I should arrange these next battles? With this breakthrough, he has now mastered five complete Dao-Paths. In addition, this breakthrough was in one of the Daos of the Wind, one of the Five Elements. He was already exceptionally fast; he now will be even more formidable.”\\n\\n He had already come up with a plan for matching up duelists. But Cangwu Jiu’s sudden mastery of a new Dao-Path, combined with the fact that he was already very formidable…this made him an even more shocking competitor.\\n\\n “I view Cangwu Jiu quite positively,” Lu Dongbin said with a laugh. “He was actually able to make a breakthrough just by watching a battle…I imagine that his level of luck must be quite high as well. He was already quite formidable, and had never exploded forth with his full power; now that he has made another breakthrough, I imagine that his power is most likely not inferior to even the likes of Adept Ninedeaths.”\\n\\n “This is going to be trouble.” The Grand Xia Emperor was pondering. He immediately made some slight mental adjustments to the pairings he had come up with earlier. He had originally ranked Cangwu Jiu as number eight or nine amongst the twelve, but now he ranked him somewhere around the third or fourth.\\n\\n ……\\n\\n A sudden breakthrough in the main hall of the Skylight Palace…this naturally attracted quite a bit of attention. The Celestial Immortal Patriarch of the Cangwu Clan had extremely long eyebrows, and he was currently extremely excited. He stared at Cangwu Jiu, this disciple of his clan. Upon seeing him open his eyes, the Celestial Immortal immediately said, “Good, good, good. Jiu, child, this is an excellent breakthrough. For you to make a sudden breakthrough here in the Skylight Palace must be the arrangement of the heavens; this time, you’ll definitely make the top three.”\\n\\n The Celestial Immortal Patriarch was almost able to visualize how glorious the Cangwu clan would be in the future.\\n\\n Why did the Cangwu clan necessarily have to submit to the Xiamang clan? With Daofather Crimsonbright supporting them, in the future the Cangwu clan would be able to grow and develop to the point where they would be able to sit down with the Xiamang clan as equals.\\n\\n “The second duel in the fourth round shall see Adept Whitedragon of the Divine Dragon Mountain against Cangwu Jiu of the Cangwu clan.” The Xia Emperor’s voice suddenly echoed in the main hall of the Skylight Palac as well as the vast imperial citadel plaza below.\\n\\n \\n\\n \\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-12-chapter-25","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.\\n","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
