{"id":50045,"no":348,"title":"Book 12, Chapter 31 - Closed Door","content":"The Xia Emperor laughed, saying nothing else. Ji Ning and the others were of the Grand Xia Emperor’s world to begin with; thus, as the saying goes, ‘fertilizing water must not be allowed to flow into the fields of another’. He naturally had to keep these individuals who had a chance of becoming experts of the Three Realms on his side. How could he release them?\\n\\n “You old scallywag.” Lu Dongbin pursed his lips. “Look at how smug your smile is. Haven’t you noticed that Ji Ning’s power is currently increasing, and that his opponent Xiamang Zishan is at an increasing disadvantage? This is someone of your Xiamang clan.”\\n\\n “Indeed, in this battle, Zishan is going to lose.” The Xia Emperor was extremely calm. “I have nothing to say if he is beaten by Ji Ning. In addition, given Zishan’s temperament…he’s too brash and wild, making him excessively hard and brittle. Given Master’s temperament, I imagine that he would choose Ji Ning even if both he and Ji Ning were in the running.”\\n\\n “This guy Xiamang…”\\n\\n The other Pure Yang True Immortals all shook their heads. Still…given that the Xia Emperor had spoken out, all of them had no choice but to give up any thoughts of acquiring Ji Ning. In truth, given how turbulent the undercurrents were in the Three Realms right now, and how the Grand Xia Dynasty’s major world was one that was exceptionally blessed by karmic luck, this world did indeed have a very good chance of giving birth to a future expert of the Three Realms.\\n\\n However…not even they fully understood how enormous the impending tribulation would be.\\n\\n The greater a tribulation, the more powerful major figures would born from it. In fact, even multiple Daofathers might be born! However, they would be spread out throughout the three thousand major worlds and the trillion minor worlds. It was very hard to say exactly how many experts the Grand Xia Dynasty’s major world would give birth to.\\n\\n “The Sloppy Daoist, as a disciple of Grand Emperor Xuanwu, must be blessed with luck.”\\n\\n “Of the top three…one of them will become a disciple of Daofather Crimsonbright. He too will be blessed by luck. For this single Conclave of Immortal Destiny to give birth to two future experts would be quite remarkable.”\\n\\n And precisely because of this, their desire to acquire Ji Ning wasn’t too burning; after all, Ning was still just a Wanxiang Adept. No one could tell how far he would be able to actually make it…\\n\\n …….\\n\\n Within the grand sealing formation.\\n\\n Xiamang Zishan was growing increasingly surprised and worried. The Ji Ning before him wielded those six Immortal swords as though they were parts of a moving melody. They danced with tremendous beauty, and just watching them felt like a form of enjoyment! But this sort of ‘enjoyment’ wasn’t something which Xiamang Zishan could withstand. He only felt increasingly stifled, and no matter how he fought back, he remained at a disadvantage!\\n\\n Ji Ning’s swords were simply too inconceivable. They were savage, gentle, fast, slow…Xiamang Zishan was unable to keep up, and wounds began to appear repeatedly on his body. Blood sprayed everywhere as his divine body had to heal repeatedly as well.\\n\\n “No.”\\n\\n “I don’t accept this. I’m going to win. I have to win.” Xiamang Zishan’s eyes were crackling with thunder as he grew increasingly berserk.\\n\\n If before this, he could be described as ‘dominating’ in a heroic manner that subjugated his foes, then his current berserk status was like a sort of utter madness, a madness born from despair.\\n\\n He was struggling to hang on! And it was lucky for Ning that he did. His struggle to hang on allowed Ning to continue to stay immersed in this wondrous state for even longer. This sort of level of no-thought didn’t actually mean that one had lost all consciousness; rather, it allowed one to unleash one’s full potential and be guided by the invisible hands of the heavens…simply put, it was as though gods were helping him reach a perfect state that he normally would find it hard to enter.\\n\\n For example, some poets might suddenly feel divinely inspired and write a line of poetry that would be passed down for ages…but for the rest of their lives, they would never again be able to write something to match it.\\n\\n This was the wondrous state which Ning was currently immersed into.\\n\\n “I admit defeat!” Suddenly, an unhappy, dissatisfied voice rang out.\\n\\n Only now did Ning come back to his senses. Whoosh. Ning came to a halt. The area around him was completely splattered with blood, and half of Xiaman Zishan’s body was lying off in the distance. His two halves quickly flew to each other and began to fuse together, but his bloodshot eyes remained filled with discontent.\\n\\n “A pity that it ended so soon.” Ning understood how rare it was for him to have entered such a state just now. If Xiamang Zishan had been able to hold on for a bit longer, it would’ve been even better for him. However, more than half of Ning’s divine power had been used up as well; it was enough for him to have battled for so long.\\n\\n And then…a look of wild joy appeared in Ning’s eyes. “I won!”\\n\\n “I won.”\\n\\n “Won.”\\n\\n “The top three. The Xia Emperor will send a recording of my battle to Daofather Crimsonbright. He might choose me as a disciple.” Ning was filled with eager expectation. “But ideally, I shall become number one in this Conclave of Immortal Destiny. That way, I’ll have a better chance of being chosen.”\\n\\n “I won.”\\n\\n The imperial citadel plaza was filled with delegates from the 3600 commanderies. Amongst them, many of the delegates from Stillwater Commandery began to call out in celebration. Although they each belonged to different powers within Stillwater, they were all from the same commandery! They had all felt regret when the Sloppy Daoist had been defeated, but now that Ji Ning had successfully entered the top three, they all felt incomparably proud.\\n\\n “Senior apprentice-brother, senior apprentice-brother, I knew you’d do it! Haha, and to think the Heavenly Treasures Mountain ranked Xiamang Zishan at number one. He still got taken care of by my senior apprentice-brother!” Mu Northson was incomparably delighted. He called out loudly, “Number one! Number one! Take number one in this Conclave!”\\n\\n “Take number one!” Little Qing spoke out in the human tongue as well as she called out in excitement.\\n\\n The Whitewater Hound grinned as well.\\n\\n A series of joyful shouts swept the plaza.\\n\\n ……\\n\\n Yu Wei watched from afar as Ning walked out from within the grand sealing formation. In this moment, all of the Celestial Immortal Patriarchs within the main hall of the Skylight Palace were watching Ning. Ning was the most dazzling figure of them all at present.\\n\\n Yu Wei felt a surge of excitement as well. Excitement for Ning. “Right. He’s entered the top three. Perhaps Ji Ning shall become the Daofather’s disciple.”\\n\\n ……\\n\\n Ninelotus was watching from afar as well. A hint of a faint smile appeared on her face. In this instant…her heart and soul suddenly became tranquil. With regards to Ning and Yu Wei being together, she still felt jealousy, but with regards to Ning himself…she was filled with nothing but hopes for the best for him.\\n\\n ……\\n\\n With the most important top three victors of this Conclave being now chosen, all three of them advanced to stand shoulder-to-shoulder in front of the main hall of the Skylight Palace, awaiting the Grand Xia Emperor’s orders.\\n\\n Even the Celestial Immortal Patriarchs had a hint of envy in their eyes.\\n\\n “One of the three will definitely become the Daofather’s disciple.”\\n\\n “Such luck…and yet, we can’t touch that luck.”\\n\\n “Perhaps in the future, one of them shall become a figure which we must revere with tremendous respect.” The Celestial Immortal Patriarchs all sighed with emotion.\\n\\n Still…only one of the three would become a Daofather’s disciple. The other two by comparison wouldn’t be nearly as well-off. If they were lucky, they might become a disciple of a Pure Yang True Immortal, but there was an enormous difference between becoming the disciple of a Pure Yang True Immortal and a Daofather’s disciple.\\n\\n Upon becoming a Daofather’s disciple, it was virtually assured that one would become a Celestial Immortal.\\n\\n However, far too many disciples of a Pure Yang True Immortal would fail in their Celestial Tribulation. It could only be said that compared to ordinary cultivators, they had a much higher chance. Perhaps not even one out of a hundred thousand Void-level Earth Immortals would successfully pass the tribulation. If a Pure Yang True Immortal patiently taught his disciple, then perhaps one out of ten might become a Celestial Immortal.\\n\\n And individual variables mattered as well. Some were very skilled at training disciples, while others were not.\\n\\n For example, in terms of training disciples, Lu Dongbin was clearly far superior to the Xia Emperor. Lu Dongbin’s disciples even included another Pure Yang True Immortal. This was often spoken of and praised in the Three Realms.\\n\\n ……\\n\\n The Xia Emperor looked down upon the three youths, revealing a smile. “I have to congratulate you. You are all extremely fortunate…and in the future, many years from now, you will understand how special this Conclave of Immortal Destiny was for you! This is a critical turning point in your lives. It is clear that all three of you shall soar into the heavens. Only, it’s hard to say exactly how high you shall each soar.”\\n\\n Ning, Adept Woodpass, and Adept Blackstone all listened obediently.\\n\\n “One of you three shall definitely become the Daofather’s disciple,” the Xia Emperor said. “As for the other two…I can promise you that you shall both become disciples of a Pure Yang True Immortal.”\\n\\n Whoooosh. The nearly thousand Celestial Immortals were all stunned. What?! For a Daofather to take a disciple was one thing, but the other two would also become the disciples of a Pure Yang True Immortal? Pure Yang True Immortals didn’t casually take on disciples either. Why would two suddenly be taken on today?\\n\\n “It seems this Conclave truly is special. First a Daofather chooses a disciple, but then even Pure Yang True Immortals will take on disciples.” These Celestial Immortals now all realized how unique this was.\\n\\n In truth, because they didn’t have a high enough status, they only came to realize this now. As for the experts and major powers of the Three Realms, they had long ago understood that a storm was coming…and that this storm would most likely be a major one. Naturally, these major powers would have to plan early in advance!\\n\\n “A Daofather’s disciple.” Ji Ning, Adept Woodpass, and Adept Blackstone all wished to become a Daofather’s disciple.\\n\\n As for a Pure Yang True Immortal? There was a thousandfold difference between a Daofather and a Pure Yang True Immortal! For Ji Ning, in particular…since he had already received the legacy of Daoist Threelives, and the Stellar Hall provided guidance in multiple Dao-Paths and Grand Daos…what was a Pure Yang True Immortal? They weren’t that attractive for Ning. He still felt more desire for becoming a Daofather’s disciple.\\n\\n “But of course, all of you will desire to become the Daofather’s disciple, and so these final battles are still very important,” the Xia Emperor said. “Two hours from now, the three of you shall engage in the final duels, divided into three sets.”\\n\\n Ji Ning battling Adept Blackstone.\\n\\n Adept Blackstone fighting Adept Woodpass.\\n\\n Adept Woodpass battling Ji Ning.\\n\\n Three duels…each person would compete twice against the others.\\n\\n “I shall use a water scrying technique to record all three duels and give it to Master. Master shall watch all three of your duels, then choose who his disciple will be,” the Xia Emperor said. “In these three competitions, you need to display out all of your abilities; after all, the number one victor in this Conclave isn’t necessarily going to be the person the Daofather shall choose. The choice is his. But of course…if you become number one, the chances the Daofather shall choose you might be a bit higher.”\\n\\n Ning and the other three all waited quietly.\\n\\n “Now, all three of you shall enter the world of the Brightmoon Diagram of the Mountains and Rivers. Two hours in the outside world shall be equivalent to a month of quiet training in the Diagram,” the Xia Emperor said. “In this month, you need to reflect on the experiences you have gained in this Conclave and prepare for the final competition.”\\n\\n “Yes,” Ning and the other three all said.\\n\\n The Xia Emperor waved his arm, and the Diagram floated up into the skies. Ning, Adept Woodpass, and Adept Blackstone were all sucked into it.\\n\\n ……\\n\\n Within the Diagram. The moonlight continued to shine everywhere. Atop a mountain peak, Ning seated himself in the lotus position. In two other corners of the peak were Adepts Blackstone and Woodpass, also seated in the lotus position.\\n\\n These three were the most powerful competitors in this Conclave. Of the three of them…only one could become a Daofather’s disciple.\\n\\n “Mm…?” Ning sat there in the lotus position, beginning to reflect on what he had learned and gained during his battle against Xiamang Zishan. Many insights began to fill his mind…\\n\\n \\n\\n \\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-12-chapter-31","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.\\n","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
