{"id":50139,"no":442,"title":"Book 15, Chapter 19 - The Sword Pointed at Easthill Commandery","content":"Of course Yuchi Xiyue wanted revenge; for the sake of revenge, she would be able to sacrifice everything, even her life! This was because her father, Yuchi Mount, had always dreamed of revenge. She was going to fulfill her father’s dream. For the sake of the Yuchi clan…she would ensure that their blood debt would be repaid!\\n\\n But she also knew exactly how powerful the Youngflame clan was. Ji Ning had, after all, trained for less than a century; how could he be a match for the Youngflame clan?\\n\\n “Little brother, don’t go too crazy,” Xiyue said worriedly.\\n\\n “Cousin, don’t worry; I already have a plan,” Ning said confidently. “Although I’m not confident in being able to kill the Celestial Immortals of the Youngflame clan…I’ll teach them a lesson they’ll never forget.”\\n\\n Yuchi Xiyue was still very worried. “Are you truly confident?”\\n\\n “Of course.” Ning nodded.\\n\\n He already had the power of a supreme Celestial Immortal; he no longer held Patriarch Goldclock and Patriarch Deadwood in any regard. Only Patriarch Infatuation still posed a bit of a threat to him, but despite that, he was now capable of simply standing there and letting Patriarch Infatuation attack as he pleased; his body, now protected by the Fifth Cycle of the [Eight-Nine Arcane Art], wouldn’t care about the blows at all.\\n\\n In addition, this time, he wouldn’t be ambushed; instead, he was going to challenge them, after having made a plethora of preparations!\\n\\n “Little brother…don’t be in too much of a rush. We really don’t need to rush it,” Xiyue said hurriedly. “We can wait for a while longer; let’s wait until you grow more powerful. I’ve already waited for so many years; there’s no rush. Little brother, I have no other family members left; I truly do not wish to lose you as well.”\\n\\n “Cousin, am I the rash, impetuous sort?” Ning asked.\\n\\n Xiyue was startled.\\n\\n She thought back through her memories…\\n\\n Although Ning could be quite berserk at times, he handled every matter in quite a competent manner. For example, when he elected to participate in the Conclave of Immortal Destiny, many had believed that given he had only trained for thirty years, he should not attend. But in the end? He became the champion of the Conclave!\\n\\n Last time, he had been ambushed by four mighty Celestial Immortals. He had been completely caught off-guard, which was why he had ended up in such a sorry state! And yet…he still didn’t let the Youngflame clan get what they wanted!\\n\\n Given that Ning was now making such meticulous plans and preparations, and given that his power had just increased dramatically…he naturally had a fairly high degree of confidence in his plans!\\n\\n However, there was no such thing as an absolute. Ning wouldn’t dare say that he was 100% confident in his plans. An ancient clan like the Youngflame clan might, for example, suddenly reveal a True Immortal or Empyrean God; at that point, Ning would just stare blankly. Still, based on what Ning knew…the Youngflame clan shouldn’t have any Pure Yang True Immortals or Empyrean Gods.\\n\\n “You’ve truly decided?” Xiyue looked at Ning.\\n\\n “Yes.” Ning nodded. “I’ve just come to let you know, cousin, before I actually carry it all out.”\\n\\n “Little brother, I truly can no longer see through you. Ever since you returned to the world of the Grand Xia…I’ve been unable to see through you. However…Grandfather spoke truly; you are now very powerful.” Xiyue looked at Ning. Gritting her teeth, a hint of fierceness flashed through her eyes as she said, “When you go deal with the Youngflame clan, I shall go with you!”\\n\\n “You’ll come with me?” Ning was surprised. She was merely a Primal Daoist!\\n\\n “Little brother, you can go kill the more powerful Immortal cultivators. As for the weaker ones and the mortals…leave all of them to me. In the past, every member of my Yuchi clan, men and women, children and elders, cultivators and mortals…they were all slaughtered. Not a single one of them escaped the butchery.” Xiyue ground her teeth with hatred. “What they did to my Yuchi clan in the past…I’ll repay it unto them!”\\n\\n “Killing mortals?” Ning shook his head. “No. You are an Immortal cultivator; killing mortals will incur enormous amounts of sin. In addition, the Youngflame clan has simply far too many clansmen. To kill that many mortals…karmic sinflames would instantly descend from the heavens. Given your level of power, the karmic sinflames would instantly roast you to death.”\\n\\n Those with a low level of sin would be surrounded by a corrosive sin-aura. Those with a high level of sin would be surrounded by the bloody light of sin. For example, eleven of the Twelve Monster-Kings of the Eastern Flows were all surrounded by the bloody light of sin. If one had an even higher level of sin…karmic sinflames would descend! Ordinary Loose Immortals and Earth Immortals would be immediately roasted to death by the descent of karmic sinflames.\\n\\n Only truly terrifying demons were capable of surviving within karmic sinflames. His cousin was definitely not strong enough to resist karmic sinflames!\\n\\n “I have many subordinates. I’ll lead them; in fact, I’ll even command a large group of soldiers to come with me.” His cousin gritted her teeth and said, “You kill the strong ones, they can kill the mortals. This was what the Youngflame clan did!”\\n\\n “Even so…as the commander, a degree of sin will gather around you as well. The Youngflame clan has millions of Immortal cultivators. As for mortals…they number in the hundreds of millions, at least. It’s hard to say exactly how many of them there are. Countless tiny strands of sin will accumulate upon you…and you’ll at least have the bloody light of sin covering your body,” Ning said.\\n\\n His cousin’s eyes were completely red. “I’m not afraid. I’ve waited far, far too long for this day.”\\n\\n “There’s no way I can agree.” Ning rose to his feet. “Wait for news from me.”\\n\\n Swoosh!\\n\\n Ning soared straight into the air, quickly vanishing from the skies above the imperial capital of the Grand Xia.\\n\\n Xiyue was momentarily startled. She then let out a fierce, frustrated scream. She wanted to go kill!\\n\\n Swallow Mountain.\\n\\n Ning led Uncle White back to Swallow Mountain. He also summoned Little Qing to him, and together they went to Mu Northson’s room.\\n\\n “Senior apprentice-brother.” Northson looked towards Ning, his body shaking, his eyes bloodshot. “Are we going to the Youngflame clan now?”\\n\\n “Of course. Master has waited for this day for a long, long time,” Little Qing said excitedly. “Master…I wish to go as well.”\\n\\n Ning frowned. “I thought I told you that you are to stay at Swallow Mountain and guard it.”\\n\\n “Master, look.”\\n\\n Little Qing’s body flickered. Instantly, a second white-robed Little Qing appeared next to her. Both of them emanated the aura of a Void-level Earth Immortal.\\n\\n “I know that you have a Primaltwin…eh? Your Primaltwin has become a Void-level Earth Immortal as well?” Ning said with some surprise. He had many treasures; naturally, he wouldn’t be stingy with them with Little Qing and Uncle White. Uncle White hadn’t created a Primaltwin, because the creation of a Primaltwin required the splitting of one’s soul, causing the power of both souls to start off much lower.\\n\\n Uncle White knew that Ning was going to deal with the Youngflame clan, and so he wasn’t willing to lower his power. Little Qing, however, was adept at survival to begin with; naturally, she had prepared a Primaltwin long ago. By now, her Primaltwin had also become a Void-level Earth Immortal.\\n\\n “My Primaltwin can stay here at Swallow Mountain; it’s enough to control the grand formations,” Little Qing said hurriedly. “Master, I’m your spirit-beast. You are going out to do battle; how can I not accompany you? In addition, you don’t need to worry about my safety at all; I’m far faster than you when I use a Greater Spatial Teleportation. You have to use Dao-seals, whereas I can use the technique directly.”\\n\\n Ning nodded. “Fine! However, you must obey my orders.”\\n\\n “Of course. You are my master,” Little Qing said with a chortle.\\n\\n “Mm.” Ning nodded, then looked towards Northson. “Junior apprentice-brother, I need to rest a bit. Tomorrow morning, we’ll head to one of the three commanderies the Youngflame clan controls; Easthill Commandery.”\\n\\n The Youngflame clan was even more powerful than the Northmont clan; it had three full commanderies. Thus, their headquarters were divided into three parts as well; or at least, that was what the intelligence reports were able to discover. Every single one of the headquarters took up an enormous amount of land, and the number of clansmen numbered in the hundreds of millions! There were more than a million Immortal cultivators in total; this was definitely equivalent to some of the largest clans. Each of the headquarters was comparable in power to the Northmont clan’s headquarters in Stillwater Commandery.\\n\\n Three great headquarters; Ning was only able to choose one.\\n\\n “Alright.” A savage light flashed through Northson’s eyes. “Tomorrow. Fine. Tomorrow, then.”\\n\\n He looked with a bit of worry towards Ning.\\n\\n “Senior apprentice-brother, if you aren’t confident in carrying it out, don’t go. Don’t go too crazy just because I want to take revenge.” Northson was worried that Ning was being rash.\\n\\n “My differences with the Youngflame clan are as irreconcilable as water and fire. I was willing to bide my time and endure it, but the Youngflame clan refused to give me time,” Ning said. “In the eyes of the Youngflame clan, I’m a potential threat; they won’t permit me to continue to grow.” The longer Ning lived, the more the Youngflame clan would worry. After all, Ning’s rate of improvement was simply too fast.\\n\\n “Right.” Northson nodded lightly.\\n\\n “Take a rest.” Ning laughed, then gently patted Northson on the shoulder. “Get some rest tonight and recover some of your energy. Tomorrow, we’ll truly begin our war against the Youngflame clan. We’ll be facing an ancient clan that has existed for countless years, and all the tricks they have to muster. The number of Immortal cultivators alone is at least more than a million!”\\n\\n Northson, upon imagining a million cultivators, couldn’t help but feel his heart tremble. Although most likely the vast majority of these cultivators were merely Zifu Disciples…quantity was a quality of its own as well. In addition, this was the headquarters of an entire tribe; it would be surrounded by layers of formations, and even Celestial Immortals who barged in would probably perish. Only Ning, by relying on the Fifth Cycle of the [Eight-Nine Arcane Art], would dare to charge straight in!\\n\\n “Senior apprentice-brother, you have to be careful.” Northson looked at Ning, filled with worry. Although he was going to fight as well…he had already prepared himself mentally for death! In addition, there was an enormous difference in power between himself and those four Celestial Immortals; thus, the high-level fights would primarily depend on Ning’s power.\\n\\n “Hahaha…” Ning laughed. “Don’t underestimate me, your senior apprentice-brother.”\\n\\n ……\\n\\n Night. It was as cool as water.\\n\\n Ning was seated by himself atop the roof, staring dowards the bright moon in the sky.\\n\\n “Tomorrow, I shall battle against the Youngflame clan.”\\n\\n “Father. Mother. Just watch and see. One of the ten most powerful clans of the Grand Xia Dynasty, the Youngflame clan…I’ll rock them from top to bottom,” Ning said softly. He then took a big gulp out of the gourd of wine he was holding in his hands, letting the wine spill out and dribble across his chest. Alas…his father and his mother wouldn’t be able to see any of it.\\n\\n In the past, his father and his mother hadn’t even wanted for him to go deal with Snowdragon Mountain! Snowdragon Mountain had been destroyed years ago. Nowadays, in Ning’s eyes…it was nothing more than a small local sect. Annihilation of such a sect was simplicity itself.\\n\\n The Youngflame clan…now that was a truly tough nut to crack!\\n\\n However, it was nothing more than a tough nut.\\n\\n Four Celestial Immortals of the Youngflame clan had acted against him, but hadn’t been able to successfully do anything to him back then…to say nothing of now!\\n\\n ……\\n\\n The next day. Dawn.\\n\\n Ji Ning, Mu Northson, Uncle White, and Little Qing all soared into the skies of Swallow Mountain together.\\n\\n Two youths, a large snowy-white hound, an azure serpent…this was a gathering that looked quite odd, and it was a gathering that was going to venture forth to deal with the ancient Youngflame clan! They were going to charge straight into the headquarters of the Youngflame clan!\\n\\n “Let’s go.” Ning unleashed his elemental ki, covering everyone with it before performing a void blink.\\n\\n ……\\n\\n Easthill Commandery. This was an extremely distant commandery that had many mountains and rivers within it. In terms of raw size, it was significantly larger than Stillwater Commandery.\\n\\n The Oldjade mountain range was the most important mountain range in Easthill Commandery, because this massive mountain range that stretched nearly a million kilometers was one of the three headquarters of the Youngflame clan. There were an unfathomable number of Youngflame clansmen who lived here, with the number of Immortal cultivators numbering over a million. As for the number of formations and restrictions laid down here over the course of countless eons, that was even more unfathomable.\\n\\n Whoosh.\\n\\n Four figures suddenly appeared in midair. Two youths, a large snowy-white hound, and an azure serpent.\\n\\n \\n\\n \\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-15-chapter-19","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.\\n","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
