{"id":50167,"no":470,"title":"Book 16, Chapter 15 - Yu Wei’s Tribulation","content":"Red-hair, Snow Scorpion, and the others all looked towards the giant yellow bear. Only the big bear was able to clearly sense the outside world and what was going happening there.\n “Don’t be impatient.” The big bear shook his head. “A powerful army has been dispatched from the Snaphorn world, but the strange thing is…this powerful army hasn’t acted against Ji Ning yet. In fact…even the violet-caped warrior that had been previously fighting against Ning has stopped fighting as fiercely as he had before. Ji Ning definitely doesn’t have much divine power left; if they fight for just a bit longer, his divine power will have been completely used up, but they actually halted. How odd.”\n “Halted?”\n The seven mighty warriors left behind by Daoist Threelives were all puzzled.\n “In addition…there’s something else odd. Ji Ning’s power had clearly reached a limit…but just now, when he used the [Starseizing Hand], his power actually increased yet again. He was able to knock aside the foe’s weapon…and I don’t understand why, no matter how hard I try,” the giant yellow bear said.\n “How can one’s power increase in the Nihilum Zone?” The seven began to ponder.\n They were different from the giant yellow bear; the bear was, after all, just the spirit of a magic treasure. Only after the destruction of Pangu’s Primordial World had the giant yellow bear slowly trained to the level of becoming a true living creature. By comparison, he wasn’t that experienced…but the other seven had been quite famous long ago in Pangu’s World. This fame came through their performances in many battles; they had much greater experience and knew far more things.\n “Can it be…” The seven suddenly all thought of the same possibility.\n ……\n Ning stared at the distant, awe-inspiring army of millions of horned warriors. He had a feeling…that even the most ordinary of warriors in that army was far more powerful than the red-eyed warriors he had previously battled. Most likely, all of them were comparable to Loose Immortals who had lived for a million years. They could be compared to the weakest of Celestial Immortals; Ning would be able to kill each of them with ease.\n But no matter how ordinary they were in terms of strength…a million of them was an utterly terrifying prospect!\n “So many warriors…if they have some sort of combination-formation technique, even Empyrean Gods or True Immortals would probably feel despair and choose to flee,” Ning mused to himself. “And this is just part of the total strength of the Snaphorn world of the Primordial Ruinworld. The Primordial Ruinworld…it truly is the most terrifying place of all.”\n Ning was actually quite calm now.\n The enemy held all the cards in their hands. They were simply too powerful…and more than eight hundred violet-caped warriors had suddenly appeared just now! If they were all comparable in strength to the first violet-caped warrior, that meant they were equivalent to a force of eight hundred supreme Celestial Immortals. And there was that gold-caped bastard…a person which caused Ning to feel completely powerless and unable to fight back when he looked at him.\n “However…although I have no way of fighting back, I can still kill myself,” Ning mused to himself. “I definitely won’t let them do anything to me.”\n “Alien.”\n The general smiled as he moved forward, but even when his black, scale-covered face was smiling, it still looked absolutely savage. “This space belongs to our Snaphorn world. Why have you come to our place?”\n “I was wandering through the infinite Void and entered this place by accident,” Ning said. At the same time, he seized this chance to absorb more power from the Solar Star and the Lunar Star, converting it into divine power. He had used up far too much divine power earlier. “I truly do not wish to be enemies with you. I would like to ask you to please let me leave; I will be endlessly grateful if you do.”\n “Let you leave? That’s not impossible,” the general suddenly said.\n “Oh?” Ning looked at his foes. He knew, however, that the cost of activating such an enormous space formation that was tens of millions of kilometers in size was definitely an enormous one. And now, they had sent over so many Snaphorn warriors as well? There was no way they’d let him leave so easily.\n “I have a request. If you accept, then I promise to let you leave,” the general said.\n “Might I ask what this request is?” Ning asked.\n “As long as you allow us to inspect your soul,” the general said, “And let us know your true intentions…if you are not a foe to our Snaphorn world, we shall immediately let you leave.”\n “Inspect my soul? Soulscouring?” Ning’s face changed.\n He immediately understood what they were plotting.\n He was a Fiendgod Body Refiner; his divine soul and his divine body were completely merged together, making his soul extremely stable, far more stable than the souls of many Celestial Immortals! In addition, his heartforce had reached the ‘ruler’ level…\n It must be understood that it was difficult for Pure Yang True Immortals to forcibly soulscour even an ordinary Celestial Immortal. Someone like Ning, who had such powerful heartforce, was rare even amongst True Immortals and Empyrean Gods. To forcibly soulscour him was incredibly difficult. Even if a Daofather was to attempt it, Ning would still probably be able to instantly react and commit suicide by shattering his own soul!\n So they wanted him to allow them to soulscour him without resisting?\n “Not a chance.” Ning shook his head in refusal.\n “Don’t be in such a hurry to refuse.” The golden-caped general continued to smile.\n Ning, however, knew the truth. Given that his foes had sent out so many warriors and activated such an enormous space formation, they definitely were looking for something important. If he didn’t fight back, they could use some sort of technique to dominate and control his soul, resulting in him becoming a slave. That would truly be a life worse than death. After all, the promises these people were making…weren’t worth a single copper. This place was outside the Three Realms; there were no such things as oaths to the Dao of the Heavens.\n “No need to say anything further.” Ning laughed coldly. “If push comes to shove, I’ll die. Soulscour me? In your dreams!”\n “Alas.” The gold-caped general let out a sigh.\n Whoosh…\n Silently and soundless, hundreds of mind-strands simultaneously flew out from the gold-caped general and the hundreds of violet-caped warriors, all assaulting Ning!\n Rumble…\n Instantly, a sensation of utter exhaustion began to overwhelm Ning.\n Tired.\n So tired.\n He felt like he was a mortal on Earth again, sick and tired and exhausted. He felt a desire to immediately shut his eyes…a sensation that he had never felt in this life after he had embarked onto the path of Immortal cultivation.\n “I…am the only ruler of myself.”\n The power of heartforce filled his entire body.\n Under the command of his heartforce, his soul began to resist fiercely; although he felt extremely tired, he still maintained his clarity of mind.\n ……\n “Alas…”\n “We failed.”\n “This human’s heartforce is quite strong. Although the mind-strands we attached to the Firstborn represent just part of our full power…even when we joined forces, were were still unable to hypnotize him.”\n “It is simply too hard to hypnotize someone with such powerful heartforce.”\n The three Queen Mothers were mentally conferring with each other.\n They didn’t care about whether Ji Ning died or not; what they cared the most about was his heartforce technique. Even the set of archery-based heartforce taught by [Houyi’s Archery] was of use to them; although they didn’t use bows, this would at least still let them touch upon the nature of heartforce and let them more thoroughly understand it.\n As for Ji Ning? If they could soulscour him, they could just kill him afterwards! There was no way they would let Ji Ning go back; if he did manage to return to the Three Realms and informed the most supreme figures of the Three Realms learn that the Snaphorn world had acquired a heartforce technique, those figures would probably personally come pay a visit.\n They had been lucky enough to survive that ancient, calamitous war; they knew exactly how powerful the Three Realms were. It must be understood that the entire Primordial Ruinworld had been defeated! A single Snaphorn world would probably be effortlessly annihilated by the supreme powers of the Three Realms. Thus, if they could obtain the heartforce, there was no way they would let Ji Ning live and return to the Three Realms.\n “No other options.”\n “All we can do is have our Firstborn fight with this human. When they fight, we’ll use our mind-strands to watch closely. His current control over his heartforce is quite weak; we can fully and clearly sense his heartforce ripples. When we personally fight with him time and time again, watching his heartforce be applied hundreds or thousands of times over…I trust that eventually, we’ll discover some of the secrets of heartforce and be able to develop a heartforce technique of our own.”\n “This clumsy method is the only one left to us.”\n The three Queen Mothers made their decision.\n Truly powerful experts generally always had this sort of clumsy method available to them; to first watch, then to hypothesize and draw insights from what they saw. For example, after other major powers personally saw the mighty divine ability [Wings of the Garuda] many times, they were able to develop a similar flying divine ability. Perhaps it was a bit weaker than the [Wings of the Garuda], but it was still able to emulate part of its power.\n This was what the three Queen Mothers had settled upon!\n ……\n “No need to capture the alien. Let him feel that there is a chance of surviving. The Firstborn among you…you can go and fight against him one-on-one. When his energy is almost depleted, let him rest. After he finishes resting, continue the attacks. Maintain this battle for as long as possible; if it takes many years, all the better.” The Queen Mother’s order came to them.\n This caused the general and the many violet-caped Firstborn to feel puzzled and confused.\n They were clearly capable of capturing him. Why didn’t they?\n And they were supposed to fight him one-on-one?\n However, they didn’t dare violate the orders of the Queen Mother. In fact, there was no way they could; their loyalty to the Queen Mothers sprang from their very blood. If the Queen Mother ordered it, they wouldn’t even hesitate to commit suicide.\n “Tonto, you go,” the general instructed.\n “Alright.” Instantly, a violet-caped warrior flew out to attack Ning.\n Ning’s divine power had only recovered to 10% of maximum. He had been maintaining a careful watch this entire time on that distant, awe-inspiring army. Upon seeing a violet-caped warrior charge towards him, he naturally went forth to fight.\n ……\n Ning was being trapped and assaulted by the Snaphorn world’s army in the Nihilum Zone. As their commanders went forth to fight him one-on-one, beginning a long, drawn-out battle within the infinite void of space…in the distant Three Realms, his Dao-companion, Yu Wei, had reached the most dangerous moment of her cultivation.\n This was a beautiful world of flowers, but the skies above it had become filled with a vortex of lightning and clouds.\n “Screeeech!”\n Yu Wei stood there, head raised, staring towards the skies. Around her swirled a series of white phoenixes and fiery red phoenixes. A total of ninety-nine phoenixes were surrounding her, wildly resisting the crashing bolts of thunder coming from up above. With this collision, almost all of the phoenixes were blasted apart, leaving behind a single white phoenix by her side.\n The thunder in the skies finally came to a complete halt.\n The supreme Sword Immortal, Patriarch Lu, nodded as he watched from his position atop the nearby mountain peak. “Seven nine-sets of thunder tribulation; essentially what I thought it would be. My disciple is a Ki Refiner…even for a reincarnated Immortal, to encounter seven nine-sets of thunder tribulation is a bit much. It seems my disciple has indeed been hiding a few things.”\n “The demonheart tribulation is beginning.”\n “I’m afraid that for my disciple, the most dangerous tribulation is this demonheart tribulation,” Patriarch Lu mused to himself.\n Yu Wei, in her past life, had been a true asura demon; she had been extremely powerful, and in her past life she had been comparable to Immortal Northwalker. In this life, under the guidance of Patriarch Lu, she had reached an even higher level of insight into the Dao; after executing a forbidden technique, she had been able to overcome the seven nine-sets of thunder tribulation.\n But the demonheart tribulation was strange and unfathomable.\n “In her past life, due to her tragedies, she transformed into an asura demon,” Patriarch Lu mused to himself. “And in her heart, she is hiding a major secret that she won’t tell anyone, not even me. The deeper one hides secrets within the heart…the more terrifying the demonheart tribulation shall be. In her past life, she failed her Celestial Tribulation; I wonder how she will do in this one.”\n Time passed, one day after the other.\n Six days. Seven days. Eight days…\n Fifteen days. Sixteen days…\n Yu Wei still just sat there. Her demonheart tribulation persisted for an extraordinarily long period of time…\n \n \n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-16-chapter-15","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.\n","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
