{"id":50365,"no":668,"title":"Book 21, Chapter 13 - A Month From Now","content":"The black-robed Godking stood there at the island, staring into the skies. Ji Ning had already departed from this place.\n “Hmph.” The black-robed Godking laughed coldly. “He cares deeply about love, and yet is able to sever it. Quite an impressive figure. During ordinary times, I might need to be concerned about you…but now? The war is in full swing. Soon, even the major powers shall begin to die in large swathes. A single Empyrean God…nothing more than a minor character.”\n Whoosh. The black-robed Godking left behind as well. The only thing left behind was that beautiful island, where countless flowers continued to bloom.\n ……\n The Deerchaser world.\n Atop the walls of the Seamless Citadel. Daomother Devilhand and the black-robed Godking continued to stare at their army, spread throughout the vast wilderness. Their army was calling out for battle, but the Nuwa Alliance refused to come out and fight.\n “That little kid.” The black-robed Godking suddenly let out a low, cold chuckle.\n “Eh?” Daomother Devilhand looked towards him.\n “Ji Ning.” The black-robed Godking laughed, “Just now, I sent one of my incarnations to go meet with him. I toyed with him for a bit.”\n Daomother Devilhand said calmly, “Given how far the war for karmic luck has advanced, a single Empyrean God like him is no longer a threat to us.”\n “I know. That’s why there’s no way I would possibly give Yu Wei’s soul back to him. Even if it’s useless to me, Ji Ning can forget about getting it,” the black-robed Godking said with a calm laugh. “Don’t worry, aunt-master. I won’t spend too much of my time on that kid. The big picture is what really matters, and the issue before us is the war for karmic luck. As for that Ji Ning? If an opportunity arises, I’ll use it to dispose of him. If no opportunity comes, then I won’t bother with him. Spending time and effort on him is a waste of my energy.”\n “Mm. It’s good that you know what matters.” Daomother Devilhand nodded calmly.\n Boom. Boom. Boom.\n Their army flew through the air in an awe-inspiring horde that covered the skies as they returned to the Seamless Citadel.\n “Eh?” The black-robed Godking raised his head. He saw a distant black bolt of lightning flash in the skies, followed by a streak of light flying into the distant, hovering citadel of the Nuwa Alliance. The Godking cracked his lips into a grin. “It’s Ji Ning.”\n ……\n The Deerchaser world. The hanging citadel of the Nuwa Alliance.\n Ji Ning’s residence.\n Whoosh. The white-robed Ning waved his hand, and the black-robed Ning in front of him was drawn into the portable estate-world.\n The world inside the treasure was an entire world of its own, with mountain peaks soaring into the skies. There were a total of 319 mountain peaks, which served as the ‘foundational pillars’ of this world, ensuring its stability.\n A number of white-robed youths were all seated on their respective mountain peaks, training in the [Icefire Jindan Smelting] technique.\n Whoosh.\n Seventeen black-robed Ning’s appeared as well. As with his true bodies, Ning had only brought seventeen of his Primaltwin clones here. He had left one behind to accompany his daughter, Brightmoon.\n Whoooooooosh. Ninefire Lava and Iceheart Pith began to fly out.\n The seventeen black-robed Ning’s separated from each other, each occupying a mountain peak of their own. They then began to train in the [Icefire Jindan Smelting] technique as well.\n The ‘original’ white-robed Ning remained standing within that distant courtyard. He waved his hand, and instantly a large horde of people appeared within it.\n “Brother Darknorth.”\n “Where is this place?”\n “Brother Darknorth, we’ve been waiting for centuries. You’ve finally let us out.”\n “Eh? Where are we?”\n The throng of Empyrean Gods that had just appeared were Empyrean Gods Sin and Sealthroat, the Seven Dragon Gods, Empyrean God Feiyou, Empyrean God Cloudscar, and the rest of the two hundred-plus Empyrean Gods of Undermoon Lake. Each of them was extraordinarily powerful.\n “Is this…the Deerchaser major world?” Empyrean God Roughpeak suddenly said, stunned.\n “Deerchaser?”\n “The Three Realms.”\n “We’ve returned.”\n The Empyrean Gods quickly grew excited by this revelation. They each began to spread out their coresense, causing the already-present Empyrean Gods and True Immortals of the Nuwa Alliance to notice them…and realize to their astonishment that these coresenses seemed to be of old friends and brothers that they had not seen for a long, long time.\n Soon, quite a few Empyrean Gods hastened to Ning’s place.\n “Ah!? Oddwitch, it really is you! I thought my senses were fooling me.”\n “S-senior apprentice-brother! Y-you…are still alive!?”\n Ning’s residence quickly became quite a lively place…and in the commotion, no one noticed that Ning had quietly departed.\n Traveling alone, Ning headed towards the palace where Yellow Emperor Xuan Yuan resided.\n There were guards outside the palace.\n “Empyrean God Darknorth, there are many major powers who are convening inside right now. They must not be disturbed,” a golden-armored guard said.\n “Help me relay a message. Tell them that I have extremely important information for my master,” Ning said.\n The golden-armored guard was slightly startled. If Ning had insisted on seeing Xuan Yuan, he would’ve stopped him, but since Ning just wanted to meet with his own master…it wasn’t really appropriate for him to stand in the way. He immediately nodded. “Empyrean God Darknorth, just wait a moment. I’ll send the word right now.”\n Ning nodded. He stood there quietly, waiting.\n His master, Xuan Yuan, Suiren, and other major powers were all gathered here. If Ning wished to meet them, he naturally would have to act in a proper manner and pay his respects accordingly. He couldn’t just sweep out his heartforce or send a mental message to them from afar; that would be far too brash!\n A short while later, the golden-armored guard returned. He gave Ning a curious look. “His Imperial Majesty said to let you in.”\n When he had made the report, Xuan Yuan, Daoist Three Purities, and the others all said the same thing: ‘Let Ji Ning come in.’ This caused this guard, who was merely a Celestial Immortal, to be extremely puzzled.\n Ning nodded, then stepped forward onto the stairs.\n He walked through the corridor, passing into an extremely wide plaza as he walked towards a great hall. Even before entering, Ning was able to make out the seated figures within the great hall. All of them were major powers of the Three Realms. There weren’t that many of them here. This was mainly because all of the major powers had hastened here after the appearance of the Envoy of All Things. After their day of initial discussions, some of the major powers had left.\n “Come in.” Xuan Yuan’s voice rang out, and Ning entered the palace.\n There really weren’t that many True Gods/Daofathers inside, just eighteen in total. However, the most puissant powers were all present. Daoist Three Purities, Lord Tathagata the Buddha, Shennong, Fuxi, and Suiren were all present. Subhuti was seated there as well, and he nodded towards Ning. He was responsible for keeping watch over the Seamless Gate’s actions, and so he already knew of Ning’s meeting with the Godking and knew what had happened.\n He couldn’t help but sigh. He knew that his disciple’s path was a hard one, but one which only his disciple himself could walk.\n “Ji Ning.” Xuan Yuan smiled. “We learned just a moment ago that you brought more than two hundred Empyrean Gods back from Undermoon Lake. And…I can sense that all of them have extremely powerful auras. All of them are top-tier Empyrean Gods, and some of them are quite shockingly powerful. To gain the allegiance of such a group of Empyrean Gods during the war for karmic luck is helpful for our side.”\n “You came out after six centuries. You were much faster than Jueming,” Lord Tathagata said with a smile.\n “Disciple.” Subhuti spoke out. “Why have you sought me?”\n All the major powers were watching Ning. Even the weakest of these eighteen were elite Daofathers! Before Ning had arrived, they were pondering the question of how to deal with the Envoy of All Things.\n Ning had just brought them two hundred more Empyrean Gods, which was quite a pleasing bit of news to them, as many of these Empyrean Gods were their disciples. But this was just an emotional bit of pleasure. They knew very well that the addition of these Empyrean Gods would have very little impact on the big picture. In the last battle alone, they had lost nearly six hundred!\n As for the Envoy, using Empyrean Gods and True Immortals against it was useless. Empyrean Gods and True Immortals had to rely on formations in order to unleash sufficient amounts of power. True Immortal Jimin, commanding a Pangu Genesis Formation, had already reached what they believed to be the theoretical maximum level of power that could be unleashed by an Empyrean God or True Immortal when wielding a formation. They couldn’t come up with any better ideas at all.\n “The Envoy of All Things,” Ning said.\n “The Envoy?” Subhuti was startled. All the major powers were startled. The only reason why they had been willing to meet with Ning was to thank him for having rescued so many Empyrean Gods…but now, all of them instantly turned quite serious.\n “Can the Seamless Gate eavesdrop or spy on this location…?” Ning asked.\n “Don’t worry. The many major powers of the Three Realms are all gathered here, and we have each employed our own methods to block out spying. Even the Heavenly Daos themselves have been blocked off,” Subhuti said.\n Ning was startled. A moment later, he realized that this was true. He couldn’t even sense the Heavenly Daos in this place. This was testament to how agitated he was, that he hadn’t even noticed this.\n “Speak.” Subhuti looked at his disciple.\n “The Envoy of All Things is quite formidable. However, your disciple’s clones have departed Undermoon Lake after six hundred years, and all memories have been joined together once more. Your disciple has a way to deal with the Envoy of All Things,” Ning said solemnly.\n “You have a way?” Exalted Celestial Thundregod, seated nearby, frowned. Although he didn’t like Ji Ning, this was something that had to do with the survival of their alliance. He wholeheartedly wanted to come up with a solution for dealing with the Envoy, but none of the major powers present had come up with any ideas. For Ji Ning to suddenly claim that he had a solution caused Thundergod to frown. “Are you aware that the Envoy of All Things is comparable to a elite Daofather in power? You, an Empyrean God, have a method of dealing with it?”\n “When the Envoy of All Things appeared, I was by Master’s side on the city walls,” Ning said respectfully. The meaning of this was clear; he knew exactly how powerful the Envoy was.\n “You really have an idea?” Yu the Great, the founder of the Primordial Imperial Clan, was seated close by. He couldn’t help but ask this question.\n Ning nodded, his eyes filled with unprecedented self-confidence and determination. “Elders, please give me just a month. A month from now, I, Ji Ning…shall go and deal with the Envoy of All Things.”\n “War is not a joking matter. This will have implications for the lives of countless Immortals and Fiendgods.” The commander of their army, Xuan Yuan, spoke out in a solemn voice.\n “This junior wouldn’t dare to make such a joke.” Ning spoke out in an equally solemn manner.\n “Fine.” Xuan Yuan nodded. “I trust that you know that in war, one cannot make idle promises. Since you’ve promised it, a month from now I will order our army to once more battle the Seamless Gate.”\n \n \n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-21-chapter-13","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.\n","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
