{"id":50377,"no":680,"title":"Book 21, Chapter 25 - The Summoning Call","content":"Yellow Emperor Xuan Yuan was utterly besides himself with rage. This was his imperial palace. The Seamless Gate dared to launch a frontal attack against it? As soon as he found out that he was unable to immediately break through the barrier of violet light, he manifested a divine sword that glowed with dazzling golden light. This was the legendary Xuanyuan sword! As the sword struck out, the entire imperial palace began to glow with countless formations. The natural energy of Heaven and Earth began to furiously gather here, causing the skies to turn dark.\n “Everwood…f*ck off!” Yellow Emperor Xuan Yuan exploded forth with an utterly astonishing aura. Seemingly limitless amounts of power were being concentrated within the Xuanyuan sword in his hands, and he delivered a downwards chop!\n Rumble…\n The violet light parted before the blow like the waves of the sea…but then it came together to trap and crush the sword-light, repeatedly grinding away at it. If you strike at water with a blade, the water will continue to flow. Although the sword-light was able to temporarily split the violet light apart, more of the violet light would come forth and merge together anew.\n “Xuan Yuan, although you are formidable in commanding armies, in a true one-on-one fight, you are still far from being a match for me,” Keeper Everwood said calmly. His gaze was actually focused on the distant form of Subhuti…because he would sense that Daofather Subhuti was transforming.\n “You’ve hidden yourself away for countless years. Subhuti…I’m quite curious to see how strong you are.” Keeper Everwood’s voice rang out next by Subhuti’s ears.\n Subhuti was incredibly mysterious. Even during the war that ended the Primordial Era, he had only intervened a few times to save people. He hadn’t truly taken part in the war. He possessed the most formidable fleeing abilities within the Nuwa Alliance, and he was absolutely, unswervingly loyal to them. Why was it that such a steadfast major power had refused to take part in the war? The Seamless Gate’s guess…was that Subhuti was most likely meant to be the escape path for the Nuwa Alliance!\n If the Pangu Chaosworld had lost the war and was in true danger of annihilation, Subhuti probably would’ve intervened to lead them all away.\n The Lord of All Fiends was the escape path for the Seamless Gate.\n Subhuti was quite likely to be the escape path for the Nuwa Alliance.\n Thus, the major powers of the Seamless Gate had never dared to underestimate Subhuti. No one knew exactly how strong he was.\n “Ji Ning…is my disciple.” Subhuti’s beard fluttered in the wind, his entire body emanating a heart-stopping aura of might. His ancient hands suddenly increased explosively in size, becoming like two massive stormclouds as he clawed forward with them.\n Whap! Whap! Whap! Whap!\n Even before his heaven-covering palms actually struck the dense violet light, the violet light began to split apart. The palms wildly smashed downwards towards Keeper Everwood, and the closer they moved towards him, the more powerfully the violet light resisted. However, Subhuti’s hands were completely covered with dark black light, and they were incomparably sharp. They tore through all obstacles as they grabbed towards the midair Keeper Everwood.\n “I knew that you’d be able to break through this protective light of mine.” Keeper Everwood’s unearthly aura of violet light was nothing more than a divine protective light that surrounded him. Xuan Yuan had used his full power, but had still been unable to break through the barrier of light. In terms of defense, Keeper Everwood was the undisputed number one expert of the Seamless Gate, after all. Most likely, on the side of the Nuwa Alliance, only Lord Tathagata the Buddha could compare with him in terms of defensive strength.\n Lord Buddha focused on a few exquisite skills. Keeper Everwood, by contrast, dabbled a bit in everything. He was skilled in almost everything! In formations, he was probably close to being a match for even Fuxi. In close combat, he was top-notch. In golem-making and pill-forging, he was quite the expert as well. Although he wasn’t the best in the Three Realms, he was definitely in the top three! This made Keeper Everwood extremely difficult to deal with.\n “Careful, Subhuti.” Keeper Everwood stretched out the wooden ruler in his hand and pointed.\n Whoosh. The wooden ruler instantly expanded to become thirty thousand meters long, and it smashed downwards towards the pair of massive, heaven-covering hands.\n Rumble….Heaven and Earth both began to tremble.\n “You live up to the stories. Show me all of your power, Subhuti.” Keeper Everwood looked towards Subhuti.\n “The Seamless Gate has truly used its full power to try and kill my disciple.” Subhuti was frantic. He had immediately used one of his killer attacks, but was still unable to do anything to his foes.\n “Suiren!”\n “Tathagata!”\n “Three Purities!”\n “Hurry up and come here!” Subhuti’s will covered the entire Three Realms as he urged them to make haste.\n ……\n Within the distant Mount Innerheart of the Crescent major world.\n Snooooore. Snooooore. Snoooore. A skinny old man was snoring contentedly as he slept, a fan placed against his chest.\n “Crazy Ji, hurry up and come to the Deerchaser world to save your junior apprentice-brother!”\n A voice suddenly echoed within the old man’s mind.\n The skinny elder was stunned. “The Deerchaser world is the base of Yellow Emperor Xuan Yuan. Master is there as well…but he’s actually been forced to call for reinforcements?” Crazy Ji no longer looked as relaxed as he normally did. His face was now solemn, and a spatial whirlpool appeared in front of him. Crazy Ji took a single step forward, entering the spatial whirlpool.\n ……\n On other side of Mount Innerheart.\n “Whew! Down you go.”\n A woodcutter, dressed in cloth robes and straw shoes, was striking with his hatchet against a large tree, slowly hacking away at it.\n “Woodcutter, your junior apprentice-brother is in danger at the Deerchaser major world. The Seamless Gate has attacked, and even I cannot stop them. You can decide for yourself whether or not you wish to come.” Subhuti’s voice rang out in the woodcutter’s mind.\n Whoooosh. A large spatial whirlpool appeared before the woodcutter as well.\n The woodcutter no longer seemed as laid back as he normally was. Instead, he hefted his hatchet over his shoulders, staring calmly at the spatial whirlpool tunnel before him. He was the most low-key figure of all of Mount Innerheart. In fact, he remained at the base of the mountain, never going to meet with Subhuti. However, he was indisputably the most powerful disciple of Mount Innerheart.\n No one knew what his story was. In fact, no one even knew his real name. The only thing Ning and the others knew…was that their senior brother was known as the ‘woodcutter’.\n “Should I go or not? Ji Ning, that little kid who learned archery from me all those years ago?” The woodcutter hefted his hatchet, a hint of amusement playing at the corners of his lips. “They want to kill my junior apprentice-brother…but they haven’t asked me if that’s acceptable.”\n Whoosh. Hatchet over his shoulders, the woodcutter stepped into the spatial whirlpool tunnel.\n ……\n The major world of Flower-Fruit Mountain.\n Flower-Fruit Mountain was an awe-inspiringly famous place back during the Primordial Era. Surprisingly, in the Three Realms era it had become quite a low-key locale. However, the leader of the monsters of Flower-Fruit Mountain was a legendary figure.\n He was born from a divine stone which Mother Nuwa had used to repair the heavens, and he emerged from it filled with endless battle-lust!\n He battled against Heaven and battled against Earth. He was born to do battle!\n Subhuti had taught him, while the Buddhists had tempered him. This truly changed him. Once, a single displeasing word could cause this absolutely savage king to lift up his staff and deliver a ferocious beatdown, but now he had become very low-key. Every day, he spent his time on Flower-Fruit Mountain with his minions, happily eating Immortal peaches and drinking fine wine. When he wanted to sleep, he would use the natural world as his bed and fall asleep on the spot.\n He was like a piece of jade that had originally been filled with imperfections but had now been perfectly carved and polished, revealing all of its glorious luster.\n “Wukong, your junior apprentice-brother has encountered grave danger in the Deerchaser world. The Seamless Gate seeks to kill him, and I, your master, am unable to withstand them,” Subhuti sent to him.\n “Master.”\n The hairy monkey had previously been slouched casually upon a rock, watching as a pair of ants battled. When Subhuti’s voice rang out in his mind, he was momentarily startled.\n “They want to kill my junior apprentice-brother?” The hairy monkey rose to his feet, his entire body instantly becoming covered with a dazzling, sparkling golden armor. A long staff appeared in his hands as well.\n “Kiddos, your king is going to make a short trip.” His voice echoed in the air above Flower-Fruit Mountain. As for the monkey king himself, he had already pierced through the Void to move towards the Deerchaser world.\n Subhuti had instantly summoned the various major powers of the Nuwa Alliance. The Daofathers of Mount Innerheart rarely joined forces, but this time Subhuti summoned all of them.\n ……\n The imperial palace of the Deerchaser world.\n As Subhuti and Xuan Yuan battled against Keeper Everwood, Ji Ning’s Primaltwin suddenly appeared.\n “Eh?” Swordfather Darklight landed on the ground. As he did, he suddenly saw that a black lightning serpent suddenly flew from the slain true body of Ji Ning into a large seal.\n “An estate-world treasure?” Swordfather Darklight instantly recognized what that large seal was. Right at this moment, a figure suddenly emerged from the large seal. It was the ape-shaped Envoy of All Things, its entire body blazing with dark red flames. The Envoy’s face, however, had changed. It now had Ji Ning’s face, and Ji Ning’s eyes were filled with murder as he stared at the skinny old man.\n “I was overconfident.”\n “I was overconfident, and I trusted too much in Master and the others. I forgot that my situation is no longer the same as it was before. In the past, when I was by Master’s side, he could completely shield me from all dangers, blocking out the wind and the rain. There was no need for me to worry about anything. However, I now have the power of a elite Daofather, and when I control the Envoy I’m actually even more powerful. I’m probably very close to even Master in power. At a time like this, anyone capable of posing a threat to me is someone that not even Master would necessarily be able to save me from.” Ning had become completely clear-minded now.\n “You’ve actually managed to bind the Envoy already? Quite fast. Hmph.” Swordfather Darklight laughed coldly, “A pity that it’s useless.”\n Swordfather Darkklight stood there in the distance, staring towards Ning.\n Bang!\n Suddenly, that mysterious, unfathomable streak of black light once more appeared. If last time, the black light was in the shape of a fan and possessed incomparably dominating power that completely tore Ning’s divine body apart, this time the black light was like an unending flow of water. It was extremely gentle as it swept towards Ning, seeking to swirl around him and bind him. So long as it could bind him, then it would be able to capture him, much like how Ning himself had bound and captured the Envoy of All Things.\n “Presumptuous.” Ning’s Envoy wielded a pair of divine swords in its hands, and its right hand suddenly moved.\n Whoosh!\n Sword-light lit up.\n Ning was using his Daofather-level energy to control the strength of the Envoy of All Things. He used its terrifying, tremendous power to unleash his fastest sword-strike. Sword-light lit up, and it was as though a bolt of lightning had appeared in the black skies! His sword struck even faster than thunder, and the powerful, penetrative force of this blow pierced straight into the flowing, watery-like stream of black sword-light.\n Clangclangclangclangclang…\n An extremely fast series of consecutive clanging sounds could be heard with over a thousand sounds ringing out in an instant.\n Countless thin sword-shaped streams of light had appeared in the skies.\n Swordfather Darklight’s sword-light was formed from countless finger-sized swords, each of which was covered with a flowing layer of black light. The countless slender swords, in the face of Ning’s single dazzling sword-strike, were actually blasted apart by the force of the collision.\n This sword-stance was the Blood Drop stance of the [Brightmoon] sword-art!\n “How can this be?!” Swordfather Darklight was shocked. Even amongst elite Daofathers, he was ranked quite highly. He probably wasn’t much weaker than Patriarch Subhuti. As he saw it, an Empyrean God in command of the Envoy could perhaps just barely be a match for an ordinary elite Daofather. Ji Ning should be no match for him at all.\n But in reality…he was actually at a disadvantage in this fight!\n “He’s actually suppressed me.” Swordfather Darklight was shocked. However, he knew how important this mission was and so he didn’t waste any time marveling at what had just happened. He immediately sent a mental shout, “Shadowless, hurry up and attack! Are you just going to watch as Ji Ning escapes?”\n \n \n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-21-chapter-25","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.\n","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
