{"id":49766,"no":69,"title":"Book 4, Chapter 15 - Wraith","content":"From the dark abyss below came a sharp yet calm voice. “Little Seven, you are the most clever. You can go handle this matter. Get rid of this intruder.” “Yes, revered Master.” The handsome youth didn’t hesitate at all as he replied with respect. “Go, then.” Just as the words ended… Kakaka….. The metal board immediately rose up from the floor, once more tightly sealing away that corridor. Only now did those six men and women let out sighs of relief. Although they were their master’s closest disciples, whenever they faced their master, they still felt terrified. This was because those disciples who had dared to offend their master had all been tortured to death, and would never even have the chance to be reborn. “Who knows what sort of magic treasure Master is currently refining.” A violet-clothed young man said softly. “All together, from start to finish, including the people we tortured to death in other places, we’ve killed hundreds of Xiantian lifeforms, and an uncountable number of ordinary people. Master even said that once he finishes with this magic treasure, even if he encounters a Wanxiang Adept, he won’t be afraid. Who knows what sort of magic treasure this is?” “It definitely is a terrifyingly powerful one.” “Right now, Master’s magic treasure is only half completed, but he already pays no attention to those Zifu Disciples located in the tribes of Swallow Mountain. When he truly completes is…” The six men and women chatted softly. They were very curious about this mysterious magic treasure which their master was busy creating, but unfortunately, their master had remained deep within his study this entire time and had forbidden anyone from entering. As for that tunnel, as soon as it shut, not a single sound would come from outside. “Whoosh!” A blurry, savage ghost suddenly came out from the body of one of the Xiantian lifeforms bound to the pillar. It let out a soundless scream, and then that blurry ghost sank down into the stones, being gathered to the depths of the mountain, towards that hidden room. This scene caused those six men and women to feel nervous. Only a true dread wraith would be visible to the naked eye. “Yet another wraith!” The six men and women thought back to their second apprentice-brother, who had offended their master. He had been tortured to death, and then he had been transformed into a dread wraith, then been absorbed in. Even wraiths were being drawn down…clearly, whoever died there would never have the chance for rebirth. “Little Seven, go deal with the enemy in the formation.” His fellow apprentices exhorted. “Stop rushing me.” The handsome youth immediately walked outside. ------------------------ The dark fog was everywhere. The handsome youth quietly moved forwards, and everywhere he went, that black fog automatically opened a pathway for him. A Dao-seal appeared out of nowhere in the handsome youth’s left hand. On the surface of the Dao-seal, there was a blood vessel like pattern of strange characters. On his right hand, a horsetail whisk appeared. “Let’s go.” With a flip of the horsetail whisk, hundreds of white strands of light immediately transformed to a size of dozens of meters, swirling around towards the lotus-position seated Ji Ning. Ji Ning was seated in the lotus position. Suddenly, he sensed something, and he raised his head to look. The entire area around him was filled with those white strands. “Break.” Ning barked softly, and the Waterflame Lotus that had been swiveling around him instantly increased greatly in size. The two enormous layers of lotus petals swiveled, and those invading white strands that had sought to entangle him were all snapped, completely unable to draw near Ning. “Controlling fire and water?” The pupils of the distant, handsome youth immediately contracted. “It seems he is a Fiendgod Body Refiner at the Xiantian level. This will be troublesome. I had wanted to rely on my horsetail whisk to directly seize him, but it seems that won’t be possible.” The hundreds of white strands quickly returned, then disappeared. In his right hand, a long whip appeared. “You’ve invaded our formation. Immediately report your name!” The handsome youth shouted. Ning was already on his feet, and he glanced at the handsome youth. “This is the border between the Ironwood clan and the Ji clan, but you seem to neither be of the Ji clan nor of the Ironwood clan. Who are you, exactly?” “If I told you, you’d be frightened to death.” The handsome youth sneered. “Why don’t you give it a try and see if I’ll be frightened to death.” Ning wielded a sword in each hand. “The only thing you need to see is my whip.” The handsome youth didn’t continue the conversation. Clearly, he didn’t want to explain where he was from. He immediately struck out with his whip, and the black whip slashed through the air, elongating at high speed. By the time it reached Ning, the whip had already transformed into a black serpent head which bit straight at Ning. Ning just looked at it. As soon as the long black whip broke through the first layer of the fire lotus, it was blocked by the second later of the water lotus. “What sort of technique is that lotus of fire and water?” The handsome youth wasn’t like that spirit-beast from earlier; he could immediately tell that Ning was a Fiendgod Body Refiner who could control fire and water, but he didn’t understand how Ning’s technique worked. Swoosh! Ning, who had previously been just calmly looking at the whip, suddenly without any warning began to use the Windwing Evasion technique. He instantly leapt over towards that handsome youth at an astonishing speed. At the same instant he leapt forward like a gust of smoke, the Darknorth swords in his hands executed Raindrop Pierces Rocks, stabbing straight towards the head of the handsome youth. “Hard to deal with. Flee!” This entire time, the handsome youth had been clutching that Dao-seal in his left hand. He suddenly activated it and it transformed into a blurry shadow and entered his body…and then the handsome youth suddenly disappeared into thin air. Swoosh. Ning appeared in front of where that handsome youth had been. He began to frown. “An escape technique? He should have relied on that Dao-seal to use this technique. A Xiantian Ki Refiner actually has an escape-type Dao-seal. The Zifu Disciple behind him definitely dotes on him.” Dao-seals were divided by class as well. The Divine Speed Seal, Light Body Seal, Diamond Seal, Giant Strength Seal, and other Dao-seals were all the lowest class seals, which escape seals were clearly on a higher level. For example, the ‘Traceless Talisman’ was a type of Dao-seal that was so precious you couldn’t even buy it with money. Only, unfortunately, he wasn’t carrying the ‘Traceless Talisman’ on him. Even if he was, because Ning was trapped within this formation, he was unable to tell which direction he was in, there was no way that Ning could use it to go directly into the insides of the mountain. Of course, he could still rely on the Traceless Talisman to immediately flee, but unfortunately, he didn’t have it on him. “Although I have Escape Seals on me, this trapping formation has activated the five elements. I’m completely unable to ‘escape’.” Ning was certain about this. He had pondered for a long time, and he could be considered to have a good level of attainment in formations. He had some understanding regarding the formation he was trapped in as well. When the five elements were activated, there was no way to ‘escape’, unless the master of the formation voluntarily helped out. Unfortunately, the master of this formation only wanted his death. How could he help out? ---------------------- The handsome youth quickly charged back to the midway point of the mountain. “Little Seven’s back.” “Younger apprentice brother, have you executed the enemy?” “With our younger apprentice brother having personally intervened, he definitely captured the trespasser with ease.” Those fellow apprentices, seeing the look on the handsome youth’s face, immediately knew that he had definitely failed, so they immediately began to ridicule him. The handsome youth barked back, “Fellow apprentices, you have no idea as to how powerful this enemy is. If I had just been a bit slower in fleeing, I probably would have lost my life to him.” “He’s that formidable?” “Does he have some sort of powerful magic treasure?” The other five men and women were all astonished. They knew how powerful this younger apprentice-brother of theirs was. The handsome youth said hurriedly, “He is just like our senior apprentice-brother. He trains in both ki and Body! He is a Xiantian level practitioner as a Fiendgod Refiner as well, and he was able to reach me in an instant. Fortunately, I had been holding the Escape Seal from the very beginning, and so I was lucky enough to escape. His speed alone indicates that he is probably a peak Xiantian-level Fiendgod Body Refiner.” “Ah?” “A peak Xiantian Fiendgod Body Refiner?” “Where did such a powerful figure suddenly come from?” The other five fellow apprentices were all shocked. The handsome youth sighed, “It seems we’ll have to wait for our senior apprentice-brother. Senior apprentice-brother has already reached the peak Xiantian level in both ki and Body, and he also has all sorts of magic treasures and poisons…the large majority of the hundred Xiantian lifeforms we have caught in the Swallow Mountain area were all captured by senior apprentice-brother.” “Who is speaking about me?” A low voice rang out. The six men and women hurriedly turned to look. At the halfway point of the mountain, near that enormous cave entrance, a man dressed in a black cloak with unbound hair walked in. That icy, sinister aura was just the same as their revered master’s. The man was currently carrying a large sack. As he walked into the mountain estate, he tossed the bag to the floor. At the opening of the bag, some feet could be seen. “Senior apprentice-brother.” The six men and women immediately called out respectfully. They all knew exactly how formidable their senior apprentice-brother was. They had all fled secretly with their master, and on the way, their senior apprentice-brother had even battled once against a Zifu Disciple and lived to tell the tale. “I went to the Kou clan’s territory and seized these three Xiantian lifeforms. I’ve already destroyed their dantian’s. Go tie them up.” The black cloaked man instructed. Immediately, servants charged forward and dragged out the three people in the sack. One woman, two men. The woman was incomparably charming, but in a dazed state. “So even the bewitching beauty, ‘Kou Hua’, was captured.” “Three more.” “All of the Kou clan.” The captured Ji clan, Ironwood clan, and Riverbank clan Xiantian level members of the Swallow Mountain region all glanced over. Immediately, the black-cloaked man’s face turned savage, and his eyes emanated a green light. “I ordered you to torment them, torment them until they go insane, torment them until they died. But look at them; they actually have the presence of mind to look at these three. If you aren’t able to torment to death, if a single one of them doesn’t become a dread wraith, then I will make sure all of you become dread wraiths!” “Yesyesyes.” Those servants were absolutely terrified, and then all of them threw themselves forward, using all methods at their disposal to torment these Xiantian lifeforms with destroyed dantians. Seeing their senior apprentice-brother angry, the other six men and women were all frightened as well. The black-robed man turned his head to look at his fellow apprentices. “Just now, you were speaking of me?” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-4-chapter-15","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
