{"id":50418,"no":721,"title":"Book 22, Chapter 29 - Devastation","content":"“Unfortunately, Nuwa left.” “Demonheart merged into the Heavenly Daos.” Fuxi shook his head. “I was born an Elder God with power over the Heavenly Dao of Destruction. I sent myself into reincarnation, never to regain my former memories or powers until I master the Heavenly Dao of Life.” Fuxi sighed, then said self-deprecatingly, “I’ve now mastered two additional Heavenly Daos, the Heavenly Daos of Yin and Yang, but I’ve been unable to master the Heavenly Dao of Life. That’s why I remain merely a True God.” “In all the Three Realms, the only known Elder God still around is the Seamless Gate’s ‘Lord of All Fiends’.” “Now, Darknorth, you have acquired a protective divine ability that is on par with Tathagata’s.” Fuxi looked at Ji Ning. “Your sword-arts are so formidable that you were able to fight that alien Outsider to a standstill. Given your power, I imagine that there is no longer anyone in all the Three Realms who you would need to fear. For us to gain a new, powerful ally like you at such a critical moment in history is truly a blessing for our side.” Tathagata smiled as well as he looked at Ji Ning. Although he had lost two of his dharma-bodies, he still felt joy upon seeing how powerful Ji Ning was. The group was in no hurry to continue the campaign. They just continued to wait without moving. After enough time passed for a kettle of tea to be boiled, Houyi and Suiren’s group of True Gods and Daofathers arrived as well. There weren’t too many major powers left to protect the Nuwa Alliance in the Three Realms, and so a short while later Lord Buddha and Suiren departed, taking those True Gods and Daofathers back with them. Sword Immortal Darknorth, Human Sovereign Fuxi, and Houyi commanded a total of twenty-nine True Gods and Daofathers as they continued their campaign through the Primordial Ruinworld! Every remaining part of the Primordial Ruinworld was located in extremely dangerous regions. After their latest experience, Ning and the others advanced with even greater caution and moved even slower than before. This time, they were divided into just three squads. The three squads were led by Ji Ning, Fuxi, and Houyi! Their three squads maintained a distance of three million kilometers from each other. They advanced in lockstep and they kept in continuous contact with each other. The reason why they hadn’t been willing to join together into a single group was precisely because they were worried about everyone ending up trapped within a single formation. Last time, if Fuxi and Ji Ning had both been trapped inside the formation with Tathagata, it would’ve been much harder for Fuxi to break apart the formation. Ji Ning wouldn’t have been able to assist him by tearing at the formation from outside! Thus, although separating into three squads created new risk, at least it would ensure that they wouldn’t all be caught in one trap. Three million kilometers was a fairly short distance. Given Ning’s speed with the [Ninehorn Lightning Serpent], he’d be able to travel that distance in a single breath. All the squads would be able to quickly reinforce each other. Time passed, one day at a time. The three squads continued to destroy every single world and region they travelled through! Godfiend Witherspike and the Seamless Gate continued to set down traps and formations to deal with them, but the extremely cautious experts of the Nuwa Alliance would never encounter such a terrifyingly dangerous situation again. They slowly and laboriously dealt with every single danger as they destroyed one world after another. Destroying the Primordial Ruinworld represented destroying the territory and homeland of the alien Outsiders. “The Endwar is about to sweep through the Three Realms. If these Outsiders are permitted to survive, they would most likely come and invade the Three Realms.” None of them showed any mercy. For the sake of the survival of their races, no mercy could be shown. Godfiend Witherspike did have some estate-treasures which allowed him to hold some living creatures, but how many could it possibly hold? It could hold less than 0.01% of the creatures who lived in the Primordial Ruinworld. All the others would die! As Ning, Houyi, and Fuxi continued to work together and support each other, they grew much closer to each other as well. Thirty-nine years had passed since the launching of the campaign against the Primordial Ruinworld. Nineteen years had passed since Tathagata had fallen into danger. Outside the Primordial Ruinworld. A hatchet-carrying woodcutter, a sword-wielding white-robed youth, and a tall man dressed in Daoist robes stood together in the Void, a large group of major powers behind them. Everyone was staring at the Primordial Ruinworld. Rumble… They could see a massive realm teetering at the brink of collapse. The breaking process slowly hastened…and then, all of a sudden, the badly damaged Primordial Ruinworld began to completely break apart. With a thunderous boom, countless shattered spatial shards appeared in that area. The entire Primordial Ruinworld was completely imploding, and as it did the increasingly powerful spatial shards began to destroy everything. Elsewhere in the Void. A dark-golden castle was hanging here in midair, the space around it rippling with formation runes. However, there was no way to locate this ship with the naked eye, and even coresense was completely blocked off. Inside the castle. “Quite a view.” Godfiend Witherspike’s gaze passed through the walls of the castle, seeing through the endless void of space as he stared at the distant Primordial Ruinworld. The Primordial Ruinworld looked like an enormous fireworks display as countless spatial shards were sent flying in every direction. “The Three Realms.” The alien True Gods standing before him gnashed their teeth in rage. This was their home that had just been destroyed! They had been the followers of the Lord of All Things, but he was defeated in battle. Mother Nuwa hadn’t wiped them out; instead, she had driven them into the Primordial Ruinworld, a place where survival itself was incredibly difficult. It was hard for them to truly flourish in the Primordial Ruinworld, and they had always dreamed of one day counter-attacking and taking over the Three Realms. They would then live in luxury and ease in that beautiful, safe world. They would no longer suffer from random spatial distortions, temporal storms, and more. They rather hated how deadly and inhospitable the Primordial Ruinworld was…but it was still their home! Now, even their final refuge had been torn asunder. The alien True Gods all had estate-treasures with them, and they were able to bring some of their kinsmen with them inside. However, the total amount of kinsmen they could carry was just a tiny fraction of the total population of the Primordial Ruinworld. Those who were left behind all perished. “The Three Realms. Fuxi. Houyi. Tathagata.” The alien True Gods firmly engraved these hated names into their memories. Ning and the others neither knew nor cared about their hatred. In fact, if they had the chance they would probably move to completely wipe out all of the alien True Gods. These alien Outsiders were invaders who had always been the enemies of the Three Realms. The more of them the Nuwa Alliance was able to kill, the better! “Master.” The red-bearded elder suddenly said, “What should we do next?” “Next?” Godfiend Witherspike said softly, “We’ve sacrificed enough already, and even our territory has been completely destroyed. Fuxi, Darknorth, and Houyi are simply too powerful when they join forces. There’s nothing I can do. The Seamless Gate cannot blame me. It’ll be up to them now.” “Get some rest, everyone. We will keep waiting. Soon…the Endwar will come soon…” Godfiend Witherspike let out a chuckle. “That’s our true battlefield. Ahaha...it’s been a long time since I’ve truly engaged in such an exciting battle. The last time was back when we were in that mountain gorge. These natives…they don’t have any formidable formations or treasures at all. The only thing they can do in war is to stake their lives. When the Endwar comes, they shall all become delicacies for me to eat…” He licked the corner of his lips with his long tongue. “The Endwar…” The one-armed man nodded slowly as well. They had roamed the primordial chaos together, and they had staked their own lives multiple times when doing so. Godfiend Witherspike was going to acquire the Worldheart of the Three Realms, no matter what the risk or the cost. After Saber finished repaying his debt to the man, he would depart and continue forward on his own path of cultivation. The other five retainers were true slaves. He had only become a retainer in order to repay a debt. He could be considered a servant, but he was no slave. …… The Primordial Ruinworld was simply far too vast. Its collapse and annihilation took three full months to complete. Houyi, Ji Ning, Fuxi, and the True Gods and Daofathers who followed them simply watched for three full months. After everything came to a halt Fuxi gave the remnants a final look, then nodded. “All of the worlds of the Primordial Ruinworld have been destroyed. The only thing left in the Primordial Ruinworld are those unique danger zones such as ‘Earthmoan Mountain’ or the ‘Endless Sea’. Those places are too stable; even the destruction of the Primordial Ruinworld wouldn’t damage them.” Ning saw roughly ten or so places as well when he scanned the ruins. All of them were extremely stable and dangerous locations! “The Primordial Ruinworld is finished. Those alien Outsiders are now like a well that has run dry,” Houyi said calmly. “They will be unable to propagate and flourish. If they appear during the Endwar, we’ll deal with them then.” “Right.” Fuxi nodded. The Nuwa Alliance had actually been quite worried about the Primordial Ruinworld. If the Seamless Gate was defeated but its survivors chose to hide within the inhospitable environment of the Primordial Ruinworld, they would always be hungrily eyeing the Three Realms from there. If that happened…the Three Realms would never know a day of peace! Now they had destroyed the Primordial Ruinworld. The Lord of All Fiends was formidable and he might be able to flee with the survivors of the Seamless Gate, but if they didn’t have a place to live then as a race they would never be able to grow powerful again. They would slowly wither away while the Nuwa Alliance would continue to flourish in the Three Realms, producing more and more experts. “Ji Ning.” Fuxi suddenly sent a mental message to Ning. Ning was startled. Everyone around them was on their side; why did Fuxi elect to send a private mental message? “What is it?” Ning asked. “You now stand at the highest level of power in the Three Realms. In fact, you can be considered one of the most powerful individuals on either side. The Nuwa Alliance has many secrets which you do not know about…but now, it is time to tell you. Perhaps you’ll be able to grow a bit more powerful.” Fuxi looked towards Ning. “The secrets of the Nuwa Alliance?” Ning felt his heartrate quicken. “Let us return to the Allclans Palace first. Just follow me later,” Fuxi said. Fuxi had originally been an Elder God. He was extremely close to Nuwa, and he naturally knew all of the secrets of the Nuwa Alliance. “Alright,” Ning replied. Fuxi smiled. “Everyone. Our campaign against the Primordial Ruinworld has lasted for thirty-nine years, but we have finally finished destroying the enemy’s lair! Now, we can set our minds at ease as we turn towards our true foes. We’ve never feared fighting any in a straight-up battle! Come. Let us return to the Allclans Palace!” “Return to the Allclans Palace.” The major powers immediately tore a hole through the Void and traversed it back to the Allclans Palace of the Three Realms. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-22-chapter-29","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
