{"id":50527,"no":830,"title":"Book 25, Chapter 25 - The Nine Secret Arts Secret Art of Thunder","content":"“You’ve passed the trial. You deserve a treasure.” The elderly formation-spirit looked at Ji Ning. “I have many treasures. Which treasure do you desire the most? If I have it, I’ll give it to you.”\n Ning had been still musing about this ‘Dao Alliance’. Upon hearing the formation-spirit’s question, he turned his attention to the treasury. Hesitating slightly, he asked, “Do you have any scrolls of the Mirrorsnow Painting?”\n “I do not.” The elderly formation-spirit shook his head. Daolord Allgod had left behind many treasures, but the Mirrorsnow Painting was not one of them.\n “Oh…” Ning continued to ponder.\n What treasure? What treasure did he need? The opportunity to choose a treasure was a priceless one. Many thoughts flitted through Ning’s mind. After having experienced a treasure auction, Ning now knew of many more treasures than he had in the past.\n “I guess I was wrong to make that suggestion. You don’t even know what treasures I have. How about this…what are you skilled in?” The formation-spirit chuckled. “Aside from the Dao of the Sword.”\n “I’m most skilled in the Dao of the Sword. Aside from that, I’m also skilled in lightning and in water,” Ning said.\n “Master’s title was ‘Allgod’,” the elderly formation-spirit explained, “Precisely because he was skilled in almost everything! Alchemy, formations…he was a master of many Daos. Unfortunately, he truly wasn’t that skilled in the Dao of the Sword. He was, however, extremely skilled in the Dao of Lightning! However, you’ll be fighting against enemies well above your level. Lightning-attribute techniques won’t be that useful to you.”\n His old face wrinkled as he frowned. Clearly, he was pondering this question.\n “I have it!” The formation-spirit looked at Ning, then reached out with his hand and generated a spatial ripple from his palm. Moments later, a jade slip appeared.\n “This jade slip now belongs to you.” The formation-spirit passed it over to Ning, sending it floating through the air.\n “Also, the treasure that was originally assigned to this treasury…” The elderly formation-spirit tossed out a second item, a fiery idol. “This is yours as well. My master once slew a vile Daolord who trained in the Dao of Fire and took this idol from him. If you were to sell it, you’d be able to sell it for one or two thousand cubes of chaos nectar. As for the jade slip, it contains a secret art which Master personally developed. Its value is incalculable. Not even the combined value of four or five Eternal weapons would be a match for it.”\n Ning was shocked.\n For the idol to be worth one or two thousand cubes made sense. The jade slip, however, was truly amazing.\n Ning accepted the idol, then turned to look at the jade slip. The jade slip was a inky jade color, and one could see faint characters carved into the inky jade. Ning sent his coresense into it, quickly discovering that it contained a lifeblood oath.\n “I swear on my very life itself that prior to becoming a Samsara Daolord, I am not to share this [Novessence Thunder] secret art with anyone else.” The lifeblood oath was quite simply worded.\n Almost all techniques required lifeblood oaths to be sworn, be it treasures acquired from a treasure auction or from one’s sect.\n Rumble…\n As soon as Ning swore the oath, an enormous amount of information poured into his mind. Daolord Allgod had left behind an utterly amazing lightning-attribute secret art in this jade slip, and all of it was put on display for Ning.\n This secret art was known as the [Novessence Thunder].\n Daolord Allgod was an ancient power who was extremely skilled in alchemy, formations, artificing, and many other arts. At his level, only divine abilities and secret arts that he personally developed would be a good fit for him. Thus, he poured some of his insights into alchemy and artificing into developing secret arts that were meant to give himself greater power.\n The more power, the better!\n Daolord Allgod had created a total of nine mighty secret arts. These secret arts could be used at long range, allowing him to effortlessly dominate other experts on his level. In fact, he could even use them to tangle with Eternal Emperors!\n As for the [Novessence Thunder], it was one of those nine mighty secret arts!\n “A secret art like this can actually exist?!” Ning was boggled as he read through the information. “A secret art like this can exist?!”\n This technique completely destroyed Ning’s preconceptions regarding secret arts.\n Most techniques or secret arts required the wielder to have certain insights into the Dao, allowing him to use certain special technical tricks. The forbidden arts used by God Emperor Blacklotus fell into this category.\n Ning’s [Nameless] sword-art was a good example. It had multiple levels, and only when one gained a high level of insight into the Dao of the Sword could one use the increasingly profound levels of the [Nameless] sword-art.\n However, the [Novessence Thunder] was completely different.\n It was like alchemy. When forging pills, one would gather all sorts of rare and precious ingredients, mix them together, use fire and energy to smelt them, then form them into a marvelous pill.\n The [Novessence Thunder] required the wielder to harvest nine types of divine lightning, mix them together in a complicated way that was akin to alchemy, then transform them into a perfect thunder-attribute secret art.\n As for the mixing process, Ning was rendered completely speechless upon reading it.\n It was simply perfect. It was like a work of absolute art.\n “In his hands, thunder and lightning were playthings that he could mold as he pleased. He was able to effortless mix various types of lightning together, joining them into an incredibly powerful secret art of thunder.” Ning was truly stunned. He had once bound a Ninehorn Lightning Serpent, and so he knew very well that lightning was intrinsically a type of force that was extremely wild and savage. Just binding and refining lightning was extremely difficult, to say nothing of using quasi-alchemical methods to mix multiple types of lightning together to form a secret art. This was truly unimaginable.\n ……\n There were two sections to the [Novessence Thunder].\n The first section required the user to harvest nine specific types of chaos lightning. These nine types of chaos lightning, by themselves, weren’t even capable of killing an ordinary World God. However, once you perfectly mixed these nine types of ordinary chaos lightning together in a certain manner through this secret art, you would be able to slay master-class World Gods and suppress even supreme World Gods!\n The power of this secret art completely surpassed any Eternal weapon.\n The second section involved harvesting nine specific types of Dao lightning. These types of Dao lightning had to be naturally harvested and not artificially manufactured, and they were incredibly rare. When Daolord Allgod created this technique, he had been at the Verge. He had many types of divine Dao lightning to choose from, but in the end he was only able to find these nine types which were suitable. After binding and smelting them together, he instantly rose to stand at the very peak of power amongst Daolords!\n However…\n It was extremely difficult for a person to succeed in mastering this technique!\n “This truly is an inconceivable secret art.” Ning couldn’t help but praise the technique. “I’ve never seen anything like it. So lightning can be manipulated in a way such as this?”\n “For the sake of killing Emperor Melobo, Master poured all of his energy into coming up with those nine mighty secret arts. Every single one of them was so powerful as to allow any wielder to gaze down upon the other heroes of the realm. Generally speaking, even Samsara Daolords at the Verge would find it difficult to withstand these techniques. When the nine secret arts are used together, they are capable of killing almost any Samsara Daolord.” The formation-spirit was quite proud. “Although the nine secret arts weren’t able to slay Emperor Melobo, all nine of them were able to form domain-type effects that were able to completely suppress him. As a result, Emperor Melobo’s power in battle was weakened to roughly a half of his maximum power.”\n Ning nodded.\n Having fully reviewed this technique, he knew quite well that once one completely mastered the first section of the [Novessence Thunder], one would be able to unleash an awe-inspiring domain of endless lightning bolts that stretched out more than a million kilometers. This was a lightning domain! It could suppress even supreme World-level experts. Even if Ning ended up encountering an extremely powerful figure which the lightning domain couldn’t kill, it would still dramatically weaken them and ensure they would only be able to unleash half of their full power.\n “Nine secret arts…” Ning couldn’t help but sigh in amazement.\n “Unfortunately, Emperor Melobo still managed to escape in the end. He was simply too skilled in fleeing techniques.” The formation-spirit sighed. “Before Master died, he left all nine of his secret arts with the Dao Alliance. If you render great services unto the Dao Alliance or are able to sell them enough treasures, you’ll be able to learn all nine techniques from them. However, these secrets are far more valuable than even the ‘Pseudo Samsara pills’ which so many World-level experts lust over! Even most Samsara Daolords would love to have a chance to learn any one of these nine secret arts.”\n Ning nodded.\n Secret arts were incredibly powerful, but Ning also understood that mastering them could be incredibly difficult!\n In this case, harvesting the nine types of lightning was just one of many difficult tasks. What really mattered was the process of perfectly alchemizing them together into a perfect blend. Actually succeeding in this required the user to be very, very skilled in multiple areas. Daolord Allgod was an ancient power who was skilled in alchemy, formations, and more, which was why he was able to accomplish it. However, when Ning viewed the technique he had two responses. First, he felt that the technique was so beautiful it was like a perfect work of art. Then, he felt a cold chill run down his spine. Training in this technique would be incredibly hard.\n “Thank goodness I have a powerful divine body. My divine power is far more robust than others at my level, as is my soul. I should still be able to succeed in this secret art,” Ning mused to himself.\n “I’ve given you the secret art. I hope that, in the future, you’ll at least be able to reach Daolord Badlands’ level,” the formation-spirit said. “Alright. Now that you’ve taken the treasure from this treasury, hurry up and leave this place alongside your companions. This treasure region is about to fall apart.”\n Whoosh. After speaking, the formation-spirit’s body dispersed into particles of light, then vanished. The light globe above the stone coffin also vanished, as did the region of light around the coffin.\n World God Dragonbinder and Flamefairy Su Youji stared towards Ning from their original positions.\n “Master.”\n “Brother Ji Ning.”\n The two called out to him at the same time.\n Rumble…\n The treasure region began to shake as one of the walls split apart, revealing a new passageway.\n “This treasure region is about to crumble. We need to hurry up and leave.” Ning didn’t have a chance to explain what had just happened.\n “Let’s go.” World God Dragonbinder and Su Youji both understood that time was of the essence. The three immediately moved at high speed towards that distant passageway.\n Rumble…\n The enormous treasury region began to completely fall apart. Boulders slammed down from the ceiling, completely burying the passageway behind them as the treasury sank down into the ground.\n \n \n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-25-chapter-25","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.\n","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
