{"id":50541,"no":844,"title":"Book 25, Chapter 39 - Arroyo","content":"The faces of Arroyo and Fukai both tightened as they turned to glance at each other.\\n\\n True enough.\\n\\n Three of the five matches had concluded, with just two more to go. Although this freakishly strong Elder God was worthy of their attention, what really mattered was still the divine blood of the Eternal. In the end, the two figures who had the greatest chances of acquiring the Eternal blood were Arroyo and Fukai. They no longer paid any attention to Ji Ning, who simply chuckled as he and Su Youji walked back to World God Dragonbinder’s side.\\n\\n “Brother Ji Ning, you hid your true power quite deeply,” World God Dragonbinder sent mentally to Ning.\\n\\n “Please pardon me, brother Dragonbinder,” Ning said.\\n\\n “Haha, I understand.” Dragonbinder chuckled. His comment was just a casual throwaway comment with no real blame attached. He understand Ning’s predicament. As the saying went, a large tree attracted the most wind! It was even more important for freakishly powerful Elder Gods like Ning to keep a low profile. Unless absolutely necessary, they wouldn’t let others know of their true strength! The only reason why Ning had revealed it today was because he had no choice.\\n\\n World God Dragonbinder now viewed Ning in a completely different light. In the past, he had treated Ning as he would an equal due to his ties to Daolord Solesky. However, now that he knew exactly how freakishly strong Ning was, Dragonbinder truly wanted to befriend him. Ning was still merely an Elder God, but he was already Dragonbinder’s equal in power. How much more powerful would he become in the future?\\n\\n “Your true abilities have been revealed. You have to be careful after you leave the Allgod Estate. I can sense that Arroyo and Fukai are incredibly dangerous. They somehow managed to convince even supreme World Gods to be their servants! This is truly unbelievable. They have to have a shockingly powerful backer,” Dragonbinder sent mentally. “They might take an unsavory interest in you.”\\n\\n Ning nodded slowly.\\n\\n It was true.\\n\\n Arroyo and Fukai had stated earlier that the three members who had taken part in the matches thus far were the weakest members of their two groups. The remaining four were all supreme World Gods! Fukai and Arroyo were both supreme World Gods and they each had a supreme World God retainer. It was truly unfathomable for a person to be willing to subordinate himself to be a servant of someone who was merely his equal.\\n\\n “My sword-arts are just a hair away from breaking through. I need to try my best to become a World God here in the Allgod Estate,” Ning mused to himself.\\n\\n Once this affair was included, it was highly possible that Arroyo or Fukai would try to capture Ning and force him to become a slave!\\n\\n He was still a bit too weak right now. After he broke through to become a World God, he would truly have nothing to fear.\\n\\n “It is now time for the fourth match.” The bald three-eyed man’s voice was filled with a hint of mocking as he turned his gaze towards Arroyo and Fukai.\\n\\n “You!” The three-eyed man pointed straight at the blood-robed Arroyo.\\n\\n Arroyo’s face tightened slightly. It was finally his turn… but who would his opponent be? Arroyo turned to glance at the gold-robed Fukai as well as the swarthy, withered-looking man standing behind him.\\n\\n “And… you!” The three-eyed man pointed towards that swarthy, withered-looking man.\\n\\n “Buxin.” Fukai sent a mental message to his servant.\\n\\n “Master.” The withered man respectfully acknowledged him.\\n\\n “You should know quite well how incredibly important the Eternal blood is to me. If I cannot acquire it, I will definitely die… and you will die with me. In fact, even your entire school will be doomed. I think you know how angry my father will be if I die,” Fukai sent mentally.\\n\\n World God Buxin’s pupils contracted slightly.\\n\\n Fukai’s father was a true devil amongst devils, an utterly terrifying figure. It would be easy for him to annihilate Buxin’s school.\\n\\n “But if I successfully acquire the Eternal blood, my status and power shall skyrocket! However, my greatest obstacle right now is Arroyo. If you can kill him, I’ll be the one to acquire the Eternal blood. I can promise you right now that I will bestow a Pseudo Samsara Pill upon you, and your sect will also receive my eternal protection!” Fukai sent mentally.\\n\\n “Don’t worry, Master. Buxin will do his absolute best,” World God Buxin sent mentally.\\n\\n “I don’t want you to your best. I want you to kill Arroyo! If I fail and die, you’ll die as well since you are my servant. I know that you will work hard, but you also need to be smart about this. Find a way to kill him!” Fukai gritted his teeth, then took out a jade green globe. “I’m willing to temporarily loan this treasure of mine to you.”\\n\\n When the nearby Arroyo saw Fukai take out that jade green globe, his face tightened.\\n\\n “Let me warn you…” The three-eyed man suddenly said, “All treasures, golems, bugbeasts, seals, and even Elder God servants can only be used a single time on the Samsara Grinders! You are forbidden from using them twice! If you give your servant a treasure, you are not permitted to use it for yourself!”\\n\\n “What?! Why?” The gold-robed Fukai was shocked. “You never mentioned this before.”\\n\\n “Because no one tried to lend someone else a treasure.” The three-eyed man said calmly, “I’ve already said what I need to say. Decide whether or not you wish to loan him that treasure.”\\n\\n “Ahahaha…” The blood-robed Arroyo let out a loud laugh. “Fukai, go ahead and loan it to your servant… if you have the balls to, that is!”\\n\\n The gold-robed Fukai hesitated for a moment, then turned to look at his servant. “It’ll all be up to you.”\\n\\n “Understand, Master.” World God Buxin nodded.\\n\\n His master, Fukai, would take part in the fifth match. If that precious Eternal treasure could only be used in a single match on the Samsara Grinders, there was no way Fukai would loan it to him!\\n\\n Whoosh. Whoosh.\\n\\n Two figures flew straight towards the Samsara Grinders. The blood-robed Arroyo and the withered-looking World God Buxin stared at each other from afar as the light around them began to coalesce into those golden armored warriors. These two supreme World Gods didn’t even blink, paying no attention whatsoever to the golden warriors.\\n\\n “You think yourself worthy of facing me?” Arroyo had a look of ridicule in his eyes.\\n\\n “Arroyo, on this day, either you or I will perish here atop this Samsara Grinders. I have no choice but to offend you.” World God Buxin’s voice was very calm and flat. Arroyo had an exalted background and his status was slightly higher than even Fukai’s, but they were more or less on the same level. Buxin and Arroyo were both supreme World Gods, but their statuses were completely different.\\n\\n Neither side could afford to fail in this quest for the Eternal blood. World God Buxin was going to have to fight with his full power.\\n\\n “Begin!” The three-eyed man ordered.\\n\\n “Kill!”\\n\\n “Kill!”\\n\\n Thousands of golden warriors let out furious roars as they charged straight towards Arroyo and World God Buxin.\\n\\n “Heh heh heh…” Arroyo laughed coldly as waves of blood suddenly manifested around him. The waves of blood spread out in every direction, smashing into those golden warriors. Some of the warriors were actually shattered by the waves while the rest were pushed far away.\\n\\n Arroyo waved his hand, and nine mighty golems appeared in the area around him. Each of the nine golems had auras of incredible power, and they were clearly even stronger than the golems which Ning had purchased.\\n\\n “You are doomed.” An enormous pair of scimitars suddenly appeared within Arroyo’s hands. The scimitars were simply huge, larger than even Arroyo himself. Both emanated auras of utterly shocking power and were clearly Eternal weapons.\\n\\n Arroyo strode forward confidently. The waves of blood continued to push outwards, preventing the golden warriors from even moving close to him, while his nine golems surrounded him like an honor guard escorting an emperor.\\n\\n “What incredible power.” Ning was shocked by what he saw. The blood waves alone were so powerful that they were perhaps superior to most master-class World Gods in might. Those two weapons Arroyo were wielding were most likely Eternal weapons as well. Once he attacked, he would definitely be able to unleash the power of a supreme World God.\\n\\n And most likely, he would be an incredibly strong one, superior to other supreme World Gods such as God Emperor Blacklotus.\\n\\n “Even World God Northrest only had access to one Eternal weapon, but both of Arroyo’s scimitars appear to be Eternal weapons. And those nine golems surrounding him… I imagine every single one of them has to be worth over a thousand cubes of chaos nectar. Given that they are able to join together into a formation, the entire set has to be worth tens of thousands of cubes.”\\n\\n Ning was shocked by Arroyo’s wealth. He now felt a sense of pressure. Just as Dragonbinder had warned him, it was very likely that either Fukai or Arroyo would try to capture him after these trials were concluded. They would want to force Ning to become a servant or a slave.\\n\\n The terrifying power which Arroyo had just put on display would be turned against Ning. Would Ning be able to handle it?\\n\\n And then there was Fukai, someone who was just as terrifying as Arroyo himself…\\n\\n Boom! Boom! Boom! World God Buxin calmly walked forward, having manifested a total of eighteen arms. These eighteen arms were unleashing a series of palm-arts and fist-arts, and each time they struck a golden warrior the golden warrior would be smashed into tiny pieces. He just calmly walked forward through the sea of golden armored foes towards Arroyo.\\n\\n Both sides completely ignored the golden warriors. They only had eyes for each other.\\n\\n Only one of the two would survive!\\n\\n \\n\\n \\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-25-chapter-39","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.\\n","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
