{"id":50567,"no":870,"title":"Book 26, Chapter 25 - The Most Powerful Kingdom","content":"Ji Ning stared at his surroundings. Many of the cultivators who had arrived alongside him tested out the borders of the mountain peak, only to find that it was indeed surrounded by invisible restrictive spells. As for flying upwards, they were only able to fly roughly three hundred meters into the air before being unable to move another inch.\n “What sort of restrictive spell is this?” Ning gave the invisible barrier in front of him a push. Even when Ning applied his azureflower mist energy, he was completely unable to budge the barrier in the slightest.\n “That mysterious behemoth felt absolutely terrifying. Not even big brother Solesky or Daolord Badlands gave me a sensation of such absolute terror.” Ning was still amazed by this. Both Daolord Solesky and Daolord Badlands were extremely powerful Daolords of the Endless Territories. “Perhaps it was because the two of them were very kind towards me, which was why I didn’t sense much danger from them.”\n “Master! Master!” Su Youji appeared by Ning’s side.\n “Mm?” Ning looked at her.\n Su Youji said urgently, “Master, I heard some of the cultivators say that they are from the Springman Territory and appeared here after being swallowed by that behemoth. Other cultivators said that they were from the Vastheaven Territory before being swallowed…”\n Ning was startled.\n The Springman Territory? Never heard of it.\n The Vastheaven Territory? That was where he was headed towards.\n They had all been swallowed by that behemoth? For a single behemoth of such terrifying power to exist in the Endless Territories was already quite impressive. Ning refuse to believe that multiple such beasts existed.\n “After the behemoth swallowed us, it formed a spatial corridor within its mouth.” Ning reflected on this. “It would appear as though this mysterious behemoth is extremely, extremely skilled in the Dao of Spacetime. This might be the reason why it was able to appear within so many places in the Endless Territories in such a brief period of time.”\n “Perhaps it isn’t actually that much more powerful than my big brother Solesky. It is probably just incredibly talented in spacetime.” This was what Ning told himself to console himself, but he also understood just how terrifying this creature had to be in order for it to appear in so many places at once.\n It must be understood that Daolord Solesky had to physically, laboriously travel all the way from the Vastheaven Territory to the Badlands Territory, making usage of many spacetime transfer arrays on the way! The ability to effortlessly appear throughout the Endless Territories was an utterly inconceivable ability.\n Ning consoled himself, telling himself that it was possible that the mysterious behemoth wasn’t really that powerful. If this was the case, his chances of escaping would be a bit better. And yet, deep in his heart he knew the truth…\n That the more likely possibility was that this mysterious behemoth was extremely, extremely powerful! Far more powerful than Daolord Solesky! It must be understood that Daolord Allgod was an example of someone who vastly outstripped Daolord Solesky. In fact, he had even been capable of chasing down and assaulting Eternal Emperors!\n “What should I do? How should I leave this place?” Ning began to grow restless and nervous.\n Was he supposed to just give up on his true body? Should he allow his clone in the Badlands Territory to once more work on rebuilding his main true body? It would be easy for him to rebuild his true body, but all of the treasures it was carrying… the six Eternal swords, the three Mirrorsnow Paintings, the Elementum Waterflame Gourd… there was no way to get them back.\n “Where there is a will, there is a way.” Ning decided to just wait patiently. “Since the behemoth went to the trouble of pulling us to this place, it won’t just kill us for no reason.”\n Time flowed on, day by day.\n One day, two days, three days… more and more cultivators appeared on the mountain peak, as did many other types of living creatures.\n Twelve days passed in the blink of an eye.\n More than thirty thousand cultivators were now present at the mountain peak, as well as many other living creatures that were usually quite rare. There were plant-based lifeforms, flame-based lifeforms, stone-based lifeforms, and more. All of them were incredibly powerful, and there were thousands of them gathered here. These were some of the rarest types of lifeforms in the Endless Territories!\n “Master, it seems as though no one else is coming.” Su Youji whispered softly to Ning from her position by his side.\n “Yes. Half a day has gone by without any additional newcomers. I imagine we shall soon discover why we have been brought to this place.” Ning continued to wait and watch patiently.\n More time passed, enough to brew a kettle of tea.\n Whoosh. Whoosh.\n Two streaks of light suddenly appeared in the skies, moving towards the mountain peak with terrifying speed.\n “What terrifying speed.” The many cultivators and other creatures on the mountain peak were all stunned. Those two streaks of light were simply too fast. Ning had previously witnessed other fast creatures such as the golden Oddbat, but there was simply no comparison!\n Boom! Boom!\n The two streaks of light landed onto the mountain peak, causing the entire mountain to tremble. Only now could everyone see them clearly.\n It was a pair of powerful experts garbed in silver armor, one male and one female. The silver-armored man’s armor was covered with the imprint of a thunderbolt, whereas the silver-armored woman’s armor was covered with the imprint of a sword. Both emanated auras of tremendous power and majesty, causing the thirty thousand cultivators and other lifeforms to feel as though they could hardly breathe.\n “Such power.” Ning could sense incredible danger radiating from the two. Although the two didn’t radiate as much danger as that mysterious behemoth, he was still certain that they could easily wipe out everyone present.\n Behind each of the silver-armored duo was a pair of black-armored retainers.\n The four black-armored retainers also had auras of tremendous power… and their aura was that of Samsara Daolords! Still, the auras weren’t that powerful; Ning felt as though they didn’t seem significantly stronger than the aura the golden Oddbat had.\n “You have been selected by the almighty Hegemon from throughout the Endless Territories and delivered to this place. Quite a few of you possess tremendous potential.” The silver-armored man’s voice was deep, and it shook the entire mountain when he spoke. “Do not panic. For you to have been brought here, to the most powerful kingdom of the entire Endless Territories, is something of a tribulation, but it is an even greater blessing.”\n When Ning and the others heard this, they all felt stunned.\n Selected by the almighty Hegemon?\n Was that mysterious behemoth this so-called almighty Hegemon? Ning suspected that this silver-armored man was an incredibly strong Daolord. For him to refer to someone else as an ‘almighty Hegemon’ was rather incredible. Still, when Ning thought about how that mysterious behemoth had been able to bring so many living beings from throughout the Endless Territories to this place, Ning felt that it made sense.\n “The most powerful kingdom of the Endless Territories?” Ning muttered softly, “Can it be even stronger than the Aeonian Kingdom of the Aeonians?”\n “Tremendous potential? Was our flying vessel captured because of me?” Ning mused to himself. He wasn’t being narcissistic; he was indeed an incredibly talented figure amongst his World-level peers. Even the amount of power he had revealed thus far was already quite shocking.\n “Although you have been brought to this place, you are not yet citizens of the Brightshore Kingdom, the most powerful kingdom there is.” The silver-armored man said, “If you cannot become one of our citizens, you shall perish! If you wish to survive, you must become one of our citizens.”\n “I am willing,” a cultivator immediately cried out. ‘I’m willing to become a citizen of the Brightshore Kingdom!”\n Some of the cultivators who had been abducted to this place were incredibly talented monsters like Ji Ning and Gorho, but even more were ordinary cultivators. For example, most of the cultivators who had been on Ning’s vessel had wanted to take on Daolord Nihilate as master. They could tell that this mysterious Brightshore Kingdom was incredibly powerful. Most likely, joining it would be every bit as beneficial as becoming apprenticed on Daolord Nihilate.\n “Not just anyone is qualified to become a citizen of the Brightshore Kingdom.” The silver-armored man glanced sideways at the cultivators as he spoke in a calm voice.\n “There are five ways in which you can become a citizen of the Brightshore Kingdom. The first method and best method is to break through to become a Samsara Daolord. If you do so, you can become one of our citizens.”\n Ning and the others were rendered speechless upon hearing this.\n Become a Samsara Daolord?\n Of the thirty thousand-plus cultivators who had been abducted to this place, not a single one was a Samsara Daolord. Breaking through to this level would be incredibly difficult.\n “The second method is to be protected by one of our Samsara Daolords! Each Samsara Daolord is permitted to protect three of his or her friends, as well as take on a maximum of ten slaves,” the silver-armored man said. “If you are the friend or family member of a Samsara Daolord, you can naturally become a citizen of the Brightshore Kingdom as well. But of course, if you are willing to become a slave you are also permitted to continue living. Slaves are the lowest-tier members of the Brightshore Kingdom and will be assigned many labors, but at least they will be permitted to remain alive.”\n Ning and the others frowned. Become slaves? Lowest-tier members of the kingdom? No one would wish for such a thing.\n As for Samsara Daolords being able to protect three friends, this rule was most likely put into place because the Brightshore Kingdom understood that Samsara Daolords had people they cared about. However, Ning and the others had just arrived; how could they know any Samsara Daolords?\n “The third method is the safest method. Go to the Hydragon Mountain in the Endless Territories and work there as a miner. If you can mine enough ore, you’ll be given your freedom and become one of our citizens. However, I have to warn you in advance that generally speaking, World-level cultivators will need to spend a thousand chaos cycles mining ore before they have enough.”\n “Hydragon Mountain?” Gorho, unnoticed by the other cultivators, frowned slightly. “I heard Father speak of it before. Hydragon Mountain is a legendary place which is the birthplace of the extremely valuable hydragon gems. Supposedly, it has been occupied and monopolized by a mysterious organization. So that mysterious organization is actually this Brightshore Kingdom!”\n The silver-armored man swept the cultivators with his gaze, a smile on his lips.\n Mine for a thousand chaos cycles?\n “I know that none of you are willing to laboriously mine ore for a thousand chaos cycles. However… in the future, many of you will cry and beg for the chance to go mine there.” The silver-armored man said calmly, “The fourth option is simple. Survive for a thousand years in the third bugnest. If you are still alive after a thousand years, you can also become one of our citizens.”\n \n \n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-26-chapter-25","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.\n","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
