{"id":50613,"no":916,"title":"Book 27, Chapter 13 - The Seventh Stance of [Nameless]","content":"The Forest of Sword Pagodas was filled with tens of thousands of towering Sword Pagodas which stood silently erect. Numerous cultivators were scattered throughout the Forest of Sword Pagodas, quietly training with no one disturbing them.\n There was a thatched cottage in the forest as well, and within the thatched cottage was a white-robed youth. Streams of sword-ki surged in the area around him, occasionally flicking out as sword-stances.\n Suddenly, the youth opened his eyes. A look of delight could be seen in his gaze.\n “I’ve finished mastering the seventh stance of the [Heartseal] sword-art, the ‘Reincarnation’ stance.” Ning was in a superb mood. “My master, Emperor Mirrorsnow, used the Reincarnation stance to break through to become a Samsara Daolord, and now I myself have learned this stance as well.\n Whooooosh.\n Sword-light began to flood the area around Ning. Some of the sword-light was filled with an aura of murder, some of it was fluctuating and unpredictable, while the rest was dominating and savage. The different types of sword-arts cycled through in a perfect manner, and no flaws could be seen at all from any of the attacks. It truly was like the perfect cycle of reincarnation itself, and when any enemies made even the slightest of mistakes the Reincarnation stance would ensure that they would be trapped and buried.\n “Emperor Mirrorsnow was a dissolute, adventurous man, but his sword-arts were extremely cautious and tight.” Ning sighed in amazement.\n “Mm. Given my current level of insight into sword-arts, I should be able to train in the seventh stance of the [Nameless] sword-art.” Ning immediately began to ponder the [Nameless] sword-art.\n Thanks to the Eternal Emperor’s legacy, Ning was able to learn the [Heartseal] sword-art incredibly fast! By comparison, training in the [Nameless] sword-art was considerably more taxing… and Ning had the feeling that the seventh stance of the [Nameless] sword-art was actually more difficult than the seventh stance of the [Heartseal] sword-art.\n The spacetime acceleration cottage maintained a rate of a hundred times the normal flow of time. Ning’s mastery of his sword-arts had already skyrocketed, making the seventh stance of the [Nameless] sword-art much easier to understand as he continuously meditated upon it.\n The seventh stance of the [Nameless] sword-art was named ‘Cosmic Heart’. It was far more complicated than the Unicorn’s Domain, and it was even more profound than the Reincarnation stance.\n More than thirty years went by.\n “Eh?” Ning opened his eyes. A distant look was in his gaze, as though everyone around him including the thatched cottage no longer existed. It was as though he was surrounded by an absolutely pristine, illusory world… and a single tear had appeared within it.\n This single tear seemed to be a tear of love… but it also appeared to be the very heart of this world.\n Slash!\n Ning flicked out with his fingernail as if he was stabbing forward with a sword, piercing that tear with it.\n In this moment, Ning’s heartforce burst out and completely meshed together with his finger.\n Whoosh!\n A shocking aura of sword-intent billowed out of the thatched cottage and into the surrounding area.\n Ning was completely stunned and absorbed by the perfect beauty of this strike. He couldn’t help but close his eyes and savor the marvelousness of that sword-art. He had naturally, unconsciously infused his sword-arts with his heartforce, but he didn’t force it as other cultivators did. Rather, it had all happened in a very natural manner. He hadn’t even intentionally tried to add heartforce into the mix. He had purely wished to execute this sword-art to its full potential. His subconscious mind merged his heartforce into it, causing him to unleash an utterly mystical and utterly terrifying strike.\n Rumble…\n Suddenly, a loud sound rang out from outside. The entire Forest of Sword Pagodas began to tremble.\n “Eh?” Puzzled, Ning opened his eyes to stare outside. The ground outside was trembling as that enormous sound boomed from far away.\n “What’s going on? The Forest of Sword Pagodas is the most sacred place of the Sword Palace. Who would dare cause trouble here?” Puzzled, Ning walked out of his thatched cottage and stared off into the distance.\n “What was that?”\n “Was that…?”\n “Look!”\n Dozens of cultivators within the Forest of Sword Pagodas rose to their feet. Some were at the World level, some were Daolords. In this moment, all of them stared at the area from where the disturbance was coming. At a distant part of the Forest of Sword Pagodas, the ground was booming loudly as it began to split apart. The tip of a pagoda was slowly emerging from underground and climbing higher and higher.\n “A Sword Pagoda.”\n “A new Sword Pagoda.”\n “A new pagoda? We just gained yet another pagoda? Who was just acknowledged by the Sword Pagodas?” Everyone was excited.\n They all understood what was going on. Only once you were acknowledged by the Sword Pagodas would the Forest of Sword Pagodas give birth to a brand new pagoda of your own. Countless eons had gone by, but only around eighty thousand cultivators had ever been acknowledged by the Sword Pagodas, and in this day and age only six World-level cultivators had been been acknowledged. They were, of course, the six exalted Swordlords.\n Ning stared in astonishment as well. Although he had seen quite a few Sword Pagodas in the past, this was his first time seeing a new one rising.\n That distant, newborn sword pagoda continued to rise upwards as the booming sounds rang out unabated. The entire Forest of Sword Pagodas was shuddering! Finally, the new Sword Pagoda came to a halt when it reached the same height as the other Sword Pagodas.\n Whoosh.\n Suddenly, countless sword-shadows began to fly out from throughout the Forest of Sword Pagodas. There had to be trillions of the things, and they all began to bow down in a certain direction.\n “Uh?!” Ning was rather flabbergasted.\n The countless sword-shadows from throughout the Forest were all bowing down towards Ning!\n All of this had caused a great commotion, attracting the attention of quite a few Daolords and World-level cultivators of the Sword Palace, all of whom came flying over. As a result, many of the cultivators of the Sword Palace were able to personally bear witness as all of this happened.\n “It is him?”\n “Isn’t that junior apprentice-brother Darknorth?”\n “His name is Darknorth?”\n “Right, he’s a newcomer. He joined us less than a thousand years ago.”\n “He’s still just at the World level, but he’s already received the acknowledgment of the Sword Pagodas?”\n This stunning sight caused many of the cultivators present to begin to quietly chat amongst themselves. For a Daolord to be acknowledged by the Sword Pagodas was one thing, but for a World-level cultivator? This was extremely, extremely rare. The entire Sword Palace only had six Swordlords. Now, Ji Ning had become the seventh.\n “Junior apprentice-brother Darknorth, congratulations.”\n “Congratulations, senior apprentice-brother Darknorth.”\n “Senior apprentice-brother Darknorth, congratulations.”\n “Junior apprentice-brother Darknorth.”\n Many cultivators came over to offer their congratulations. In the Sword Palace, there was a huge dividing line between those who were acknowledged by the Sword Pagodas and those who were not! If you weren’t acknowledged by the Sword Pagodas, you would always be viewed as slightly inferior, even if you were a Daolord. As for those who were acknowledged? All of them were venerated.\n Ning finally realized what was happening. His sword-stance just now had been acknowledged by the Forest of Sword Pagodas!\n “Darknorth.” A deep voice rumbled out in Ning’s mind. “That new Sword Pagoda belongs to you. Only you are permitted to leave behind your sword-arts within it.”\n “You are…?” Ning asked.\n “I am the spirit of the Sword Palace,” the deep voice said.\n Ning understood. Even the Starseizing Manor had given birth to a manor-spirit such as the giant yellow bear. It made sense that the Sword Palace had given birth to a sentient spirit as well.\n ……\n The Brightshore Kingdom’s imperial palace. The thirteen royal thrones.\n A trace of emotion suddenly flickered through the face of the snowy-robed Hegemon. He smiled slightly, then looked at the nearby Lord Woodflower. “Woodflower, congratulations are in order for your Sword Palace. You just gained a new Swordlord.”\n “Haha, it seems as though I was right about him.” Lord Woodflower laughed merrily.\n “What’s this?”\n “A new Swordlord? Did yet another World-level cultivator of the Sword Palace receive the acknowledgment of the pagodas? Who is it?”\n The other eleven golden-armored powers were all quite surprised.\n Lord Woodflower said in a very smug manner, “It is Darknorth!”\n “Darknorth? That kid who sparred against Bertulu?”\n “When he battled against Bertulu, he specialized in defensive techniques and was quite good in that regard. However, he was quite a ways off from being at the level he would need to be to receive the acknowledgement of the Sword Pagodas.”\n “This rate of improvement is crazy. Even if he was accelerating time to train a thousand times faster than normal… it has been less than a million years!” There had been many major powers who had witnessed Ning’s battle against Bertulu. Even the Hegemon had gone to watch! Although they had all been focusing on Bertulu, they naturally had also paid some attention to Bertulu’s opponent, Ji Ning.\n The stronger one was, the more difficult it would be to accelerate the rate of time for one’s self. A thousand times the normal rate of time was already a ridiculously fast pace… but Ning had entered the Sword Palace less than a thousand years ago. That meant that even at a thousand times the normal rate of time, he would’ve been training for less than a million years.\n In reality, Ning had only maintained a pace of a hundred times the normal rate of time.\n “I said long ago that I had a good feeling about him. He truly is quite talented in sword-arts.” Lord Woodflower said in a very smug manner, “My Sword Palace has gained yet another Swordlord, which means we’ve gained yet another chance to be the ones to go to the alternate universe.”\n “Yes, another candidate has appeared.” The almighty Hegemon nodded as well.\n Everyone acknowledged by the ancient pagodas were qualified to take part in the trials.\n “Let’s see what sort of sword-arts he came up with to be acknowledged by those ancient pagodas.” The almighty Hegemon waved his finger. There had been sixty-six images in the air, and now a sixty-seventh image joined them. This image displayed the scene of a white-robed Ji Ning standing in front of a Sword Pagoda, staring at it curiosity.\n “Rewind.” The almighty Hegemon smiled as he watched, and the other twelve golden-armored figures watched closely as well. All of them were curious as to what type of sword-art this World-level cultivator had used to receive the acknowledgement of the Sword Pagodas.\n Time began to reverse at high speed until the image returned to the time when Ning had just executed his sword-stance.\n The image showed Ning seated in the lotus position within his thatched cottage. Ning gently flicked out a single finger in a seemingly simple manner, but the strike was indescribably profound. Slash! The strike shot out into the distant skies above him.\n \n \n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-27-chapter-13","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.\n","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
