{"id":50648,"no":951,"title":"Book 28, Chapter 19 - Universe Treasure","content":"Ji Ning and the other three began to grow nervous. The entire point of this journey was for them to accompany Skyfire Brightshore in an adventure within the Archaeus region. The journey wasn’t going to come to a crashing halt because this Brightshore Imperial wasn’t even able to enter the Genesis Lands, right? That would be an absolute joke. “Hm.” Ning turned to glance at the other three retainers. Chaos Immortal Swallowback, World Goddess Skywolf, and Flamefairy Su Youji all had fairly relaxed looks on their faces. It seemed as though Swallowback was the most relaxed; he even grinned at Ning and the others. Skywolf and Su Youji, the two women, had fairly unpleasant l ooks on their faces, and their bodies were shaking slightly. Still, it seemed as though they would be able to endure it. A long period of time passed. That exalted web of power continued to fill every inch of this world, but it no longer launched any attacks against them. “Whew.” Skyfire Brightshore let out a sigh of relief, and World Goddess Skywolf and Su Youji all looked slightly more relaxed as well. “That was embarrassing. I was damn near flattened.” Skyfire Brightshore shook his head and laughed. He was born at the World God level of power, and he had been a solitary figure for much of his early life. In fact, shortly after he was born he had been abducted by the almighty Hegemon. As a result, his soul and his willpower were both very weak compared to that of the other five. The only reason he had been able to survive this trial was because of his innate gifts. Every single member of his race was blessed with extraordinary powers from birth. His soul was already as strong as that of a Daolord’s, and so although he possessed much weaker willpower than Ning and the others, he was still able to endure the trial and overcome in. “All eight of us will be granted entry. This is something to celebrate.” Prince Greatjoy smiled. “Not bad.” Ning glanced at Su Youji and offered her a few words of praise. “Master, I feel fortunate that I’ve spent these past few years meditating on the techniques of my master, Feixian the Exalted, within your estate-world. I’ve improved quite a bit with regards to my willpower and my mental strength. Otherwise, I wouldn’t have been able to survive that,” Su Youji sent mentally. Ning nodded. Su Youji’s path was a path of charm and control. This was naturally a path that required an extremely powerful mind. …… The flying vessel flew deeper into the world of the Genesis Lands. This was a world of truly incredible proportions. It was trillions of kilometers in size, and it seemed almost endless. “How vast.” Su Youji sighed in amazement as she stared at the world. “This is the place which gave birth to this entire universe.” Ning stared at their surroundings as well. He could sense that certain locations within this world were filled with auras of incredible power that only strengthened as they flew closer. “Quick, look over there!” Prince Greatjoy pointed off into the distance. “Eh?!” Ning and the others looked towards the direction in which he was pointing, only to see a powerful expert seated in the lotus position atop a golden carpet. This expert had a single horn on his head and was covered with dark-red scales, while the golden carpet was covered with many delicacies and wine. The man was drinking wine and devouring his food while casually glancing at his surroundings. “Hey there, kiddos!” The horned expert suddenly noticed Ning’s group, and he immediately called out to them while flying towards them. Ning’s group didn’t try to avoid him, as they knew that all combat was forbidden within the Genesis Lands. Many of the disciples of the mightiest major powers of this alternate universe had all gathered here within this place! It might be rare for them to encounter their peers in the other parts of the Archaeus region, but that was because they were all gathered here within the Genesis Lands. There were quite a few Daolords in seclusion here as well! As a result, the Genesis Lands held many Daolords as well as quite a few World-level cultivators. If it wasn’t for the law against combat, the World-level cultivators would’ve been wiped out long ago. “New arrivals?” The horned expert grinned merrily as he landed aboard their flying vessel. “Greetings, senior.” Ning and the others bowed respectfully. “Able to enter the Genesis Lands despite merely being at the World level. Not bad at all!” The horned expert grinned as he praised them. “I was only able to come to this place after I became a Daolord. Come, come! Bring me your finest wine and your best food and let me have a taste. In exchange, I, Owlbath, shall impart unto you some of the rules and secrets regarding the Genesis Lands.” “Please be welcome, senior.” “Please have a taste, senior.” Ning and the others all hurriedly took out all sorts of fine food and wine. “Not bad at all. Glug, glug. Hey, this wine is pretty good too. Can I have some more?” The horned expert didn’t just eat and drink, he even stashed some of the food away for later without seeming to feel the slightest bit embarrassed. The horned expert burped, then chortled merrily with half-lidded eyes. “Don’t worry, I’m not going to eat all of your food for nothing. The Genesis Lands is an enormous place. If you just run around randomly, you may very well end up dying here.” Ning and the others listened silently, the very picture of innocent obedience. “The Genesis Lands can be roughly divided into two parts; the ‘outer reaches’ and the ‘inner reaches’. The true name of the ‘inner region’ is actually the Prime Reaches, and it holds the innermost core and prime essences of this entire universe. There are many deceased ancient powers located within the Prime Reaches, and it is the most important location in our entire universe.” The horned expert said casually, “Every single cultivator would dream of being able to enter the Prime Reaches of the Genseis Lands. The Prime Reaches are located at the very center, and you’ll be able to recognize it as soon as you see it.” Glug, glug, glug. He raised his head and drank several more mouthfuls of wine. Ning and the others all nodded. Actually, they knew all of this already! Moksha the golem had told Ning long ago about this. “Every single World-level cultivator capable of entering the Genesis Lands is a genius,” the horned expert said. “But perhaps just one in a hundred of them are capable of entering the inner reaches!” Ning and the others were stunned. Just one in a hundred? This was their first time hearing this number. Generally speaking, the World-level cultivators who were able to enter this place were all capable of becoming Daolords whenever they chose! Who would’ve thought that entering the inner reaches would be this difficult? “But the outer reaches aren’t a bad place to be either. The outer reaches were formed when the universe itself was born, and it contains many mysterious places and many hidden fortunes,” the horned expert said. “I myself stay out here in the outer reaches. Alas… while one in a hundred World-level cultivators are able to enter the inner reaches, things are much worse for us Daolords. Perhaps just one in ten thousand Daolords are able to enter the inner reaches!” “The outer reaches are filled with treasures, but the inner reaches are absolutely incredible. Almost all of the Eternal Emperors will venture into the inner reaches in search of treasures.” A mysterious look suddenly flashed through the horned expert’s eyes. “Have you heard? Shortly after the master of the Church of Annihilation became an Eternal Emperor, he entered the inner reaches… and then, for some reason, he became terrifyingly strong, strong enough to unify our entire universe and force all the major powers in it to submit to him.” “Oh?” Ning and the others were growing increasingly curious. Almost all the Eternal Emperors would enter the place? It was the Prime Reaches which gave the master of the Church of Annihilation his incredible power, allowing him to unify this universe? “Everyone says that the Prime Reaches are filled with endless possibilities. Just three chaos cycles ago, a Daolord managed to acquire a Universe treasure within the Prime Reaches,” the horned expert said in a mysterious manner. “A Universe treasure?” Solewind and Skyfire were both shocked. As for Greatjoy and Ning, they revealed puzzled looks. What exactly was a Universe treasure? Upon seeing this, the horned expert grinned. “It seems as though some of you, my young friends, haven’t heard this phrase before. Actually, even I only heard of these treasures after entering the Genesis Lands. Eternal treasures are powerful, but above them… there is a legendary rank of supremely powerful treasures which are known as Universe treasures. They are often also referred to as Supreme treasures. These are truly incredible treasures which even Eternal Emperors would go wild over. They are incredibly powerful, and they are incredibly mysterious.” “Alas.” The horned expert shook his head. “Universe treasures are truly supreme treasures; there’s no way you can bind them by force! You can only bind a Universe treasure if the treasure itself acknowledges you.” Ning, Greatjoy, and the others were all rather stunned. At this moment, Heartlord Solewind sent mentally to them, “Darknorth, Greatjoy, Firesurge… Universe treasures are legendary things that are filled with inconceivable amounts of power. They truly are the most supreme eof treasures, and they are both incredibly rare and incredibly valuable. Even Eternal Emperors would drool over the chance to acquire such treasures! Treasures like them can only be hoped for, not actively sought out. Right… Darknorth, your Sword Palace actually holds a Universe treasure known as the ‘Shardsword’.” “Shardsword?” Ning was stunned. He remembered now; the first time he entered the Sword Palace, when he entered the Armaments Gorge he had encountered a ‘broken’ shard of a sword that had no price tag and which he couldn’t even move towards. Ning still remembered how he had asked the overseers of the Armaments Groge, Swordfive and Swordsix, about that strange sword. Their response had been to tell them that it was clear the sword and Ning were not fated to be together, and that even the two previous Palace Lords of the Sword Palace had not been able to receive the acknowledgment of that sword. Ever since the Shardsword’s original owner had died, the Shardsword had been silent and accepted no others. “So that ‘broken’ sword was actually a Universe treasure. No wonder not even the two Palace Lords of the Sword Palace were able to receive its acknowledgment,” Ning mused to himself. “Senior, are there Universe treasures within the Prime Reaches?” Solewind couldn’t help but ask. “There are.” But the horned expert then shook his head. “According to the history books, over the course of countless years there has been a total of eight Universe treasures who acknowledged the major powers who found them and were willing to follow them out of the Genesis Lands! Supposedly, even more Universe treasures are hidden within the Prime Reaches. To be honest, though… Universe treasures don’t really matter that much. The thing which really drives all the cultivators crazy is the mystery behind the process by which the master of the Church of Annihilation gained such incredible power… but of course, those are the affairs of the most supreme cultivators of our universe. You World-level cultivators don’t need to worry too much about those matters. You aren’t strong enough to get involved just yet.” “Still. The Prime Reaches truly are a mysterious place. I’ve never been there before myself, and I imagine none of the eight of you will be able to enter either,” the horned expert said. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-28-chapter-19","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
