{"id":50680,"no":983,"title":"Book 29, Chapter 3 - The Journey","content":"The territories occupied by cultivators in the Endless Territories roughly made up around sixty to seventy percent the size of the alternate universe. However, there were many ‘danger zones’. For example, the region marked down as the ‘Terror Starsea’ was considered the most dangerous location in all the Endless Territories. It had yet to be fully mapped out, but its known area alone already surpassed the entirety of the rest of the Endless Territories. It was incredibly dangerous, and less than one in ten thousand Daolords would survive a trip into it! Generally speaking, only incredibly powerful Daolords would be lucky enough to survive, and even the majority of Eternal Emperors who entered that place would perish. The Terror Starsea, in and of itself, was nearly comparable to the entire alternate universe in size. It was without a doubt the most dangerous place in the Endless Territories. The Endless Territories also had some other similar danger zones which were quite terrifying. Chances of entering and surviving were very slim. “If we factor in those danger zones, the Endless Territories is far larger than the alternate universe.” Ji Ning was rather stunned as he carefully read through the information the star map contained regarding the Endless Territories. “Is that…” Ning’s eyes narrowed as he saw an explanation of the six major forces within the Endless Territories. The Dao Alliance was comprised of virtually all cultivators. It was an enormous behemoth that was also far-flung and dispersed. It had the most Daolords and Eternal Emperors, but it also had so many internecine disputes and took up so much territory that it had always operated under the principle of non-governance. The Brightshore Kingdom was created by the almighty Hegemon Brightshore, one of the three mighty Hegemons of the Endless Territories! The Aeonians consumed cultivators, using them as food. They were extremely unified and were incredibly powerful after being Awakened. The ‘Aberrants’. They were the hundreds and thousands of strange, unique creatures who had been birthed by the primordial chaos. After Hegemon Windrain rose to power and established the Windrain Kingdom, it became a holy land for all Aberrants and countless Aberrants congregated there. The Ancient cultivators comprised the most mysterious, secretive organization in all the Endless Territories. They were extremely few in number, but each and every one of them possessed incredible power. Their divine abilities and secret arts were powerful beyond measure, and they were led by Hegemon Netherlily. The Dark Kingdom was comprised of cultivators who had migrated from outside the Endless Territories, and they ruled over the border territories. “Much more complex than the alternate universe,” Ning mused to himself. “Junior apprentice-brother.” Lord Woodflower smiled as he looked at Ning. “Surprised?” “I never realized our many danger zones our Endless Territories possess, or that we actually have six major forces here,” Ning said. “There’s no need for most World-level cultivators to know such things. The Endless Territories are simply too vast and filled with so many dangers that they would never make it far enough to find out,” Lord Woodflower said. “You, however, are different. This is all information you’ll need to know after you become a Daolord.” Ning nodded. “As for the danger zones… some are almost infinitely large, especially the Terror Starsea. Not even the almighty Hegemon has been able to fully explore them,” Lord Woodflower said. “Honestly, the main things you need to keep in mind are those six major powers. The Brightshore Kingdom is rather aloof, and we are on fairly good terms with the Dao Alliance, the Aeonians, and the Aberrants. We can be considered enemies of the Dark Kingdom, as they are foreigners, after all. But remember… we are mortal foes of the Ancient cultivators!” “Mortal foes?” Ning was startled. “Right.” Lord Woodflower nodded somberly. “Thus, you need to be wary of them! But of course, you need to keep an eye out for the other organizations as well. The Dao Alliance, for example. It is so large and filled with so much internal struggles that it wouldn’t surprise me if some of their major powers suddenly assaulted you. Same with the Aeonians; you are a cultivator, after all! Aeonians love eating Samsara Daolord cultivators.” “Alright. You know everything you need to know.” Lord Woodflower looked at Ning. “In short… have a safe trip.” “Alright.” Ning nodded heavily. …… After accepting the servant, Ning led Su Youji in leaving the Sword Palace. The Brightshore Kingdom was quite similar to the Trileaf Realm, in that it also had three spacetime tunnels. “These three spacetime tunnels lead to three different parts of the Endless Territories, allowing our cultivators to waste as little time as possible when travelling.” A black-lord Daolord guard who stood outside the tunnel smiled as he explained to Ning. “Mm.” Ning led Su Youji straight into the spacetime tunnel. In his heart, he couldn’t help but muse that the Paragon of Pills and Hegemon Brightshore apparently were quite similar in their mastery over spacetime. …… The Badlands Territory and Vastheaven Palace had originally seemed quite distant from one another, but if you looked at the star map of the Endless Territories you would realize that they actually belonged to the same general neighborhood! Given Ning’s strength, a few hundred years would suffice for his clone to go from the Badlands Territory to Vastheaven Palace. “We should be able to make it in around three or so centuries.” Ning’s true body would be able to move even faster; the spacetime tunnel would save him quite some time. Swoosh. A flying shuttle was hurtling through the void, with Ning, Su Youji, and World God Pillsaint within it. “Master, what sort of a place is Vastheaven Palace?” Pillsaint asked curiously. “A place I have to go. In fact, I’m technically a member of Vastheaven Palace as well,” Ning said with a smile. Indeed. He had to reach that place before he could fulfill his lifeblood oath and return to the Three Realms. His Primaltwin had been protecting the Three Realms for quite some time now, but it had to remain physically outside within the primordial chaos just beyond it, unable to actually re-enter. “Youji, Pillsaint, both of you have made tremendous gains. I imagine both of you can become Daolords now,” Ning said. “Yes.” Su Youji nodded. “After I received the legacy of Feixian the Exalted but prior to visiting the Genesis Lands, I was already comparable to a supreme Chaos Immortal. Thanks to the opportunities the Genesis Lands gave me… even if I don’t use any treasures at all, I am a transcendent Chaos Immortal.” Ning nodded. To reach that level only through the usage of Eternal weapons wasn’t that impressive. If you were able to reach a transcendent level of power without needing to rely on magic treasures, you would probably be able to break through to the Daolord level whenever you wished. “Thank you, Master, for that Archaeus medallion. Otherwise, I have no idea how long it would take for me to break through.” Su Youji felt rather excited. She had never imagined that she would become a Daolord as well. “I have to thank you as well, Master. If it wasn’t for you, I can’t even imagine how long it would take before my Dao of Alchemy would have reached its current level.” Pillsaint was quite excited. “Flamefairy, I can become a Daolord whenever I wish as well.” Ning laughed. His two most worthy retainers were both able to become Daolords. This was truly pleasing to him. “Right. Have Solewind, Greatjoy, and the others made their breakthroughs yet?” Ning asked. “Ah! I was so happy to see you back that I forgot to tell you,” Su Youji said. “Prince Greatjoy broke through to become a Daolord roughly three thousand years after our return! Just two years after that, Waterlord Firesurge became a Daolord as well! Another twelve thousand years after that, Solewind also become a Daolord.” Ning was startled. All of them became Daolords? “Makes sense. They had reached their bottlenecks long ago; the only reason they held back was because they had made some gains in the Genesis Lands. Any further improvements would be incredibly difficult. I’m not surprised they broke through to become Daolords,” Ning said. “Master, when will you become a Daolord?” Su Youji asked curiously. “Right!” Pillsaint was curious as well. “It won’t take too long,” Ning said. No matter what, he had to reunite with his clone first. In addition… he could also dimly sense that there was still a slight flaw with his Sword Dao. He had the feeling that he was close to breaking through, but just needed one final stimulus. “Since the two of you are both ready to become Daolords… how about this. Let’s find a quiet, secluded place and have you two break through there,” Ning said. “Or would you prefer to train for a bit longer and further solidify your foundations?” “I solidified my foundation long ago. I was just waiting for you to come back, Master. I can break through whenever I wish; there’s no need to wait any further.” The Flamefairy smiled. “I solidified my foundation back in the Trileaf Realm. I’ve been waiting to make my breakthrough,” Pillsaint said. After acquiring the first six chapters of the [Seven Leafpill Chapters], he had spent roughly a million years in accelerated time training. That was how long it had taken for Ning to acquire thise six lifeblood weapons. “If that’s the case… hm. Let’s just go over there.” Ning willed it, and the flying ship quickly shifted into a different dimensional continuum, then landed on a quiet, desolate chaos planet. This chaos planet had no life on it at all, and its surface was a rocky one. Ning waved his hand, causing an Immortal estate to descend upon the surface of this planet. With another thought, Ning activated the various layers of restrictive seals and spells on the estate, causing an aura of enormous yet subdued power to cover the entire planet. Anyone off in the distance would never be able to detect any hint of an aura from this chaos planet. Breaking through to become a Daolord would cause an enormous disturbance. They had to do their best to dampen their auras and prevent themselves from being discovered, which would cause unnecessary trouble. “Make your breakthroughs here. I’ll stand guard for you,” Ning said. “Yes, Master.” Both Pillsaint and Su Youji were rather excited and nervous. Although they were confident in their chances, breaking through to become a Daolord was an incredibly important event in the life of any cultivator. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/desolate-era/de-book-29-chapter-3","bookId":1501,"book":{"id":1501,"title":"Desolate Era","description":"Fate had never been kind to Ji Ning. Wracked by illnesses and infirm his entire life on Earth, Ning knew early on that he would die as a teenager. What he didn’t know was that there really was such a thing as life after death, and that the universe was a far larger place than he thought. A lucky twist of fate (one of the few in Ning’s life) meant that Ning was reborn into a world of Immortals and monsters, of Ki Refiners and powerful Fiendgods, a world where Dynasties lasted for millions of years. A world which is both greater…and yet also smaller…than he ever could imagine. He would have the opportunity to join them, and in this life, Ning swore to himself, he would never let himself be weak again! The Era he was born into was a Desolate one, but Ning would make it his era.","cover":"http://cunovel.com/img/DE.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/desolate-era","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:13 AM"}}
