{"id":111342,"no":2,"title":"Page 2","content":"It was October. The trees of the cemetery had turned a decayed brown, and a cold breeze had whistled in, replacing the stifling heat of the Virginia summer. Not that I much felt it. As a vampire, my body registered only the temperature of my next victim, warmed by the anticipation of her hot blood coiling through my veins. My next victim was only a few feet away: a chestnut-haired girl who was currently climbing over the fence of the Hartnett estate, which ran adjacent to the cemetery. \"Clementine Haverford, whatever are you doing out of bed so late?\" My playful demeanor was at odds with the hot, heavy thirst coursing through me. Clementine was not supposed to be here, but Matt Hartnett had always been sweet on her. And even though Clementine was engaged to Randall Haverford, her Charleston-based cousin, it was clear the feeling was mutual. She was already playing a dangerous game. Little did she know it was about to turn deadly. Clementine squinted into the darkness. I could tell from her heavy-lidded expression and wine-stained teeth that shed had a long night. \"Stefan Salvatore?\" she gasped. \"But youre dead.\" I took a step closer to her. \"Am I, now?\" \"Yes, I attended your funeral.\" She cocked her head to the side. She didnt seem too concerned, though. She was practically sleepwalking, heady from sips of wine and stolen kisses. \"Are you a dream?\" \"No, not a dream,\" I said huskily. I grasped her by the shoulders and pulled her close to me. She fell against my chest, and the loud drum of her heartbeat filled my ears. She smelled of jasmine, just as she had last summer when my hand had grazed the bodice of her dress while we played one of Damons kissing games under the Wickery Bridge. I ran one finger along her cheek. Clementine had been my first crush, and Id often wondered what it would feel like to hold her like this. I put my lips to her ear. \"Im more like a nightmare.\" Before she could make a sound, I sank my teeth straight into her jugular vein, sighing when the first stream hit my mouth. Unlike what her name might suggest, Clementines blood wasnt nearly as sweet as Id imagined. Instead it tasted smoky and bitter, like coffee burned over a hot stove. Still, I drank deeply, gulping her down, until she stopped groaning and her pulse slowed to a whisper. She went limp in my arms, and the fire that burned in my veins and my belly was quenched. All week Id been hunting at my leisure, having discovered that my body required two feedings a day. Mostly I just listened to the vital fluid coursing through the bodies of the residents of Mystic Falls, fascinated by how easily I could take it from them. When I did attack, Id done so carefully, feeding on guests at the boardinghouse or taking one of the soldiers up by Leestown. Clementine would be my first victim whod once been a friend--the first victim the people of Mystic Falls would miss. Disengaging my teeth from her neck, I licked my lips, allowing my tongue to savor the spot of wet blood at the corner of my mouth. Then I dragged her out of the cemetery and back to the quarry where my brother, Damon, and I had been staying since wed been turned. The sun was just creeping over the horizon, and Damon was sitting listlessly at the edge of the water, glancing into its depths as if they held the secret to the universe. Hed been like that every day since wed woken up as vampires seven days earlier, mourning the loss of Katherine, the vampire whod made us into what we are now. Though she had turned me into a powerful creature, I celebrated her death, unlike my brother. She had played me for a fool, and the memory of her reminded me of how vulnerable Id once been. As I watched Damon, Clementine moaned in my arms, one eye fluttering open. Were it not for the blood seeping onto the blue lace neckline of her wrinkled, blue tulle dress, it would seem as if she were merely in slumber. \"Shhh,\" I murmured, tucking a few loose strands of hair behind her ear. A voice somewhere in my mind told me that I should feel regret over taking her life, but I felt nothing at all. Instead, I readjusted her in my arms, tossing her over my shoulder, as if she were simply a sack of oats, and walked to the edge of the water. \"Brother.\" I unceremoniously dumped Clementines nearly lifeless body at his feet. Damon shook his head and said, \"No.\" His lips had a chalky white texture. Blood vessels twisted darkly on his face; they looked like cracks in marble. In the weak morning light, he looked like one of the broken statues in the cemetery. \"You must drink!\" I said roughly, pushing him down, surprised at my own strength. His nostrils flared. But just as it was to mine, the smell of her blood was intoxicating to his weary body, and soon his lips met her skin in spite of his protestations. He began to drink, slowly at first, then lapped up the liquid as though he were a horse desperate for water. \"Why do you keep making me do this?\" he asked plaintively, wiping his mouth with the back of his hand and wincing. \"You need to regain your strength.\" I prodded Clementine with the tip of my dirt-caked boot. She groaned softly, somehow still alive. For now, at least. But her life was in my hands. The realization trilled through me, as though my entire being were on fire. This--the hunt, the conquests, the reward of the pleasurable sleepiness that always followed a feeding--made eternity stand before us as an endless adventure. Why couldnt Damon understand? \"This isnt strength. Its weakness,\" Damon hissed, rising to his feet. \"Its hell on Earth, and nothing could be worse.\" \"Nothing? Would you rather be dead, like Father?\" I shook my head incredulously. \"You have a second chance.\" \"I never asked for it,\" Damon said sharply. \"I never asked for any of this. All I wanted wasKatherine. Shes gone, so kill me now and be done with it.\" Damon handed me a jagged oak branch. \"Here,\" he said, standing with his arms open wide, his chest exposed. Just one stroke to his heart and hed have his wish. Memories flashed through my mind: of Katherine, her soft, dark curls, her fangs bright in the moonlight, her head arched back before she bit into my neck, her ever-present lapis lazuli pendant that sat in the hollow of her neck. I now understood why shed killed my fianc\u0026#65533;e, Rosalyn, why shed compelled me and Damon, why she used her beauty and innocent visage to make people want to trust and protect her. It was her nature. And now it was ours. But instead of accepting it as a gift, as I had, Damon seemed to think it was a curse. I cracked the branch over my knee and threw the shards into the river. \"No,\" I said. Though Id never admit it aloud, the thought of living forever without a friend in the world frightened me. I wanted Damon and I to learn to be vampires together. \"No?\" Damon repeated, his eyes snapping open. \"Youre man enough to murder an old flame, but not your brother?\" He shoved me to the ground. He loomed above me, his own fangs bared, then spit on my neck. \"Dont embarrass yourself,\" I said, scrambling to my feet. He was strong, but I was far stronger, thanks to my regular feedings. \"And dont fool yourself into thinking Katherine loved you,\" I growled. \"She loved her Power, and she loved what she could make us do for her. But she never loved us.\" Damons eyes blazed. He rushed toward me with the speed of a galloping horse. His shoulder, hard as stone, plowed into me, throwing me back into a tree. The trunk split with a loud crack. \"She lovedme.\" \"Then why did she turn me, too?\" I challenged, rolling to my feet as I rebuffed his next blow. The words had their desired effect. Damons shoulders sagged, and he staggered backward. \"Fine. Ill just do it myself,\" he murmured, grabbing another stick and running the sharp end along his chest. I slapped the stake out of his hand and twisted his arms behind his back. \"You are my brother--my flesh and blood. So long as I stay alive, so shall you. Now, come.\" I pushed him toward the woods. \"Come where?\" Damon asked listlessly, allowing me to drag him along. \"To the cemetery,\" I answered. \"We have a funeral to attend.\" Damons eyes registered a dull spark of interest. \"Whose?\" \"Fathers. Dont you want to say good-bye to the man who killed us?\"","sourceLink":"https://allnovel.net/stefan-s-diaries-bloodlust-the-vampire-diaries-2/page-2.html","bookId":2069,"book":{"id":2069,"title":"Stefan\u0027s Diaries: Bloodlust (The Vampire Diaries #2)","description":"Storyline: Bloodlust (The Vampire Diaries: Stefan\u0027s Diaries #2) A new beginning... When Stefan Salvatore\u0027s first love turned him into a vampire, his world—and his soul—were destroyed. Now he and his brother, Damon, must flee their hometown, where they risk being discovered . . . and killed. The brothers head to New Orleans, looking for safe haven. But the city is more dangerous than they ever imagined, full of other vampires—and vampire hunters. Will Stefan\u0027s eternal life be forever damned? Based on the popular CW TV show inspired by the bestselling novels, Stefan\u0027s Diaries reveals the truth about what really happened between Stefan, Damon, and Katherine—and how the Vampire Diaries love triangle began.","cover":"https://allnovel.net/images/stefan-s-diaries-bloodlust-the-vampire-diaries-2.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/stefan-s-diaries-bloodlust-the-vampire-diaries-2.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 6, 2019 12:20:55 AM"}}
