{"id":111364,"no":24,"title":"Page 24","content":"Damon and I ran at vampire speed through the streets of New Orleans. Unlike when we first arrived and Damon lagged reluctantly behind me, we ran side by side, the adobe and brick houses blurring past us like melting wax.\n Something had shifted between us in that arena, I felt it in my very being. Something had changed in Damons eyes as hed regarded me and refused to attack, even as the crowd jeered on. I wondered how the match would have ended had the tent not gone up in flames--would we have taken the humans one by one, or would one Salvatore brother have ended up dead and bloodied on the dusty floor?\n The image of the Mystic Falls church blazing like an oversize torch sprang to my mind. The town had burned down the church and the vampires trapped within it the night our father killed us--and the vampire Damon had loved.\n But Damon and I were still here, like phoenixes rising from the ashes of the vampires who came before us. Perhaps out of the fire of this circus in our new home city, a new kinship between us would spring to life--like the new life that arose in prairies after the previous years crops had been burned to the level of the soil. Damon and I continued to run, our feet slapping against the cobblestones in perfect unison, down the back alleys and streets Id learned so well in my few weeks of living here. But as we rounded the corner onto Dauphine, the same street where Lexi had taken me shopping, I stopped short. Affixed to the window of the tailors shop was a crude drawing of me and Damon, our fangs bared, both of us crouched low.The fight of the century, the posters read. I wondered if Callie had drawn them. Probably.\n Damon leaned in close, examining the poster. \"That drawing makes you look a bit stocky, brother. Might be time to lay off the barmaids.\"\n \"Ha, ha,\" I said dryly, looking around. Shouts sounded behind us, in the direction of the circus. We had a good head start, but if Callie had distributed these posters as widely as we had the posters for Damon, then we wouldnt be safe until we were inside.\n The spindly spire of a church rose in the distance--the church that was kitty-corner to Lexis place.\n \"Come on!\" I pushed Damon in the direction of the church, and we didnt talk until we reached the rickety white house.\n \"This is where you live?\" Damons lip curled as his eyes flicked up from the sagging, whitewashed porch to the dark windows.\n \"Well, I understand that it may not measure up to your standards, but we all must make sacrifices every now and again,\" I said sarcastically as I led him to the back door.\n The door swung open, allowing a triangular slice of light to pour out over the dark backyard.\n I put my hands up as Lexi appeared in the doorway. \"I know you said no visitors, but--\"\n \"Come in. Quickly!\" she said, locking the door the second we crossed the threshold. In the main room, candles were burning, and Buxton, Hugo, and Percy were all perched on the chairs and couches, as if they were in the middle of a meeting.\n \"You must be Damon.\" Lexi nodded to him slightly. \"Welcome to our home.\" I was aware of Damon watching her, and wondered what he saw.\n \"Yes, maam,\" Damon said with an easy grin. \"And Im afraid that during our time in captivity, my brother somehow failed to mention you and your\"--his eyes flicked over Percy and Buxton--\"family.\"\n Percy bristled and half-rose from his seat, but Lexi put up a hand to stop him. \"Im Lexi. And as Stefan is your brother, my home is your home.\"\n \"We escaped,\" I started to explain.\n Lexi nodded. \"I know. Buxton was there.\"\n \"You were?\" I whirled around in surprise. \"Were you betting for me or against me?\" Damon let out a little snort.\n Lexi laid a hand on my forearm. \"Be nice. He was there to help you.\"\n My eyes widened. \"You were going to help me?\"\n Buxton leaned back in his chair. \"I was. But then someone had the bright idea to burn down the whole place, so I left.\" He crossed his arms over his chest, looking pleased at himself for being part of the action.\n \"It was Callie. She lit the fire,\" I said.\n Lexis eyes registered surprise. \"I was wrong,\" she said simply. \"Its been known to happen.\"\n \"You must forgive my poor manners in interrupting, but do you have anything to eat?\" Damon asked, not turning away from the portrait of an old woman that he was examining. \"Ive had a rather difficult few weeks.\"\n For the first time since we had escaped, I really looked at my brother. His voice was hoarse, as if he was unused to using it. Bloody gashes covered his arms and legs; his clothes were in tattered rags; and his shock of black hair was filthy and lank against his pale neck. Red rimmed his eyes, and his hands trembled slightly.\n \"Of course. You boys must be starving.\" Lexi tsked. \"Buxton, take him to the butcher shop. Let him eat his fill. I doubt there are enough humans in New Orleans to quench his thirst. And tonight, at least, he deserves to eat like a king.\"\n \"Yes, maam,\" Buxton said, bowing slightly as he raised his bulk from the chair.\n \"Ill join him,\" I said, heading toward the door.\n \"No.\" Lexi shook her head and grabbed my arm--hard. \"I have tea for you.\"\n \"But \" I protested, confused and annoyed. I could practically taste the pigs blood on my tongue.\n \"No buts,\" Lexi said sharply, sounding remarkably like my mother.\n Buxton opened the door for Damon, who wiggled his brow at me as if to say, \"Poor boy!\"\n If Lexi saw, she pretended not to notice, instead busying herself with the tea kettle while I slumped on one of the rickety chairs set up around the table, my head resting on my hands.\n \"When you become a vampire, its not just your teeth and diet that change,\" Lexi said as she stoked the fire in the stove, her back toward me.\n \"What does that mean?\" I asked defensively.\n \"It means that you and your brother arent who you used to be. Youve both changed, and you may not know Damon as well as you think,\" Lexi said, carrying two steaming mugs in her hands. \"Goats blood.\"\n \"I dontlikegoats blood,\" I said, pushing the mug away angrily. I sounded like a petulant toddler, and I didnt care. \"And no one knows Damon better than I do.\"\n \"Oh, Stefan,\" Lexi said, looking at me kindly. \"I know. But promise me youll be careful. These are dangerous times--for everyone.\"\n At the worddangerous, something clicked in my mind. \"Callie! I have to find her!\"\n \"No!\" Lexi pushed me back down on my chair. \"Her father will not harm her, but hell kill you, given half the chance, and youre in no shape for a fight.\"\n I opened my mouth to protest, but Lexi cut me off.\n \"Callie is fine. You can see her tomorrow. But for now, drink the blood. Fall asleep. When you awaken, you will be healed, and you, Damon, and Callie will figure out everything then.\"\n Lexi left the kitchen with a swish of her aprons and extinguished the lamp.\n Suddenly exhaustion fell over me like a heavy blanket, and the desire to fight Lexis advice drained from my body. With a sigh, I lifted the mug and took a small sip. The liquid was warm and velvety, and I couldnt help but admit that it was good.\n Lexi was right--I would see Callie tomorrow to say good-bye. But I needed rest. My entire body hurt, even my heart.\n At least you know you have one, I imagined Lexi saying, and I smiled in the darkness. \n","sourceLink":"https://allnovel.net/stefan-s-diaries-bloodlust-the-vampire-diaries-2/page-24.html","bookId":2069,"book":{"id":2069,"title":"Stefan\u0027s Diaries: Bloodlust (The Vampire Diaries #2)","description":"Storyline: \n Bloodlust (The Vampire Diaries: Stefan\u0027s Diaries #2) \n A new beginning... When Stefan Salvatore\u0027s first love turned him into a vampire, his world—and his soul—were destroyed. Now he and his brother, Damon, must flee their hometown, where they risk being discovered . . . and killed. The brothers head to New Orleans, looking for safe haven. But the city is more dangerous than they ever imagined, full of other vampires—and vampire hunters. Will Stefan\u0027s eternal life be forever damned? Based on the popular CW TV show inspired by the bestselling novels, Stefan\u0027s Diaries reveals the truth about what really happened between Stefan, Damon, and Katherine—and how the Vampire Diaries love triangle began.\n \n","cover":"https://allnovel.net/images/stefan-s-diaries-bloodlust-the-vampire-diaries-2.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/stefan-s-diaries-bloodlust-the-vampire-diaries-2.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 6, 2019 12:20:55 AM"}}
