{"id":10078,"no":6,"title":"IN A WHERRY.","content":"We have a phrase in Oldport, \"What New-Yorkers call poverty: to be reduced to a pony phaeton.\" In consequence of a November gale, I am reduced To a similar state of destitution, from a sail-boat to a wherry; and, like others of the deserving poor, I have found many compensations in my humbler condition. Which is the more enjoyable, rowing or sailing? If you sail before the wind, there is the glorious vigor of the breeze that fills your sails; you get all of it you have room for, and a ship of the line could do no more; indeed, your very nearness to the water increases the excitement, since the water swirls and boils up, as it unites in your wake, and seems to clutch at the low stern of your sail-boat, and to menace the hand that guides the helm. Or if you beat to windward, it is as if your boat climbed a liquid hill, but did it with bounding and dancing, like a child; there is the plash of the lighter ripples against the bow, and the thud of the heavier waves, while the same blue water is now transformed to a cool jet of white foam over your face, and now to a dark whirlpool in your lee. Sailing gives a sense of prompt command, since by a single movement of the tiller you effect so great a change of direction or transform motion into rest; there is, therefore, a certain magic in it: but, on the other hand, there is in rowing a more direct appeal to your physical powers; you do not evade or cajole the elements by a cunning device of keel and canvas, you meet them man-fashion and subdue them. The motion of the oars is like the strong motion of a bird\u0027s wings; to sail a boat is to ride upon an eagle, but to row is to be an eagle. I prefer rowing,—at least till I can afford another sail-boat. What is a good day for rowing? Almost any day that is good for living. Living is not quite agreeable in the midst of a tornado or an equinoctial storm, neither is rowing. There are days when rowing is as toilsome and exhausting a process as is Bunyan\u0027s idea of virtue; while there are other days, like the present, when it seems a mere Oriental passiveness and the forsaking of works,—just an excuse to Nature for being out among her busy things. For even at this stillest of hours there is far less repose in Nature than we imagine. What created thing can seem more patient than yonder kingfisher on the sea-wall? Yet, as we glide near him, we shall see that no creature can be more full of concentrated life; all his nervous system seems on edge, every instant he is rising or lowering on his feet, the tail vibrates, the neck protrudes or shrinks again, the feathers ruffle, the crest dilates; he talks to himself with an impatient chirr, then presently hovers and dives for a fish, then flies back disappointed. We say \"free as birds,\" but their lives are given over to arduous labors. And so, when our condition seems most dreamy, our observing faculties are sometimes desperately on the alert, and we find afterwards, to our surprise, that we have missed nothing. The best observer in the end is not he who works at the microscope or telescope most unceasingly, but he whose whole nature becomes sensitive and receptive, drinking in everything, like a sponge that saturates itself with all floating vapors and odors, though it seems inert and unsuspicious until you press it and it tells the tale. Most men do their work out of doors and their dreaming at home; and those whose work is done at home need something like a wherry in which to dream out of doors. On a squally day, with the wind northwest, it is a dream of action, and to round yonder point against an ebbing tide makes you feel as if you were Grant before Richmond; when you put about, you gallop like Sheridan, and the winds and waves become a cavalry escort. On other days all elements are hushed into a dream of peace, and you look out upon those once stormy distances as Landseer\u0027s sheep look into the mouth of the empty cannon on a dismantled fort. These are the days for revery, and your thoughts fly forth, gliding without friction over this smooth expanse; or, rather, they are like yonder pair of white butterflies that will flutter for an hour just above the glassy surface, traversing miles of distance before they alight again. By a happy trait of our midsummer, these various phases of wind and water may often be included in a single day. On three mornings out of four the wind blows northwest down our bay, then dies to a calm before noon. After an hour or two of perfect stillness, you see the line of blue ripple coming up from the ocean till it conquers all the paler water, and the southwest breeze sets in. This middle zone of calm is like the noonday of the Romans, when they feared to speak, lest the great god Pan should be awakened. While it lasts, a thin, aerial veil drops over the distant hills of Conanicut, then draws nearer and nearer till it seems to touch your boat, the very nearest section of space being filled with a faint disembodied blueness, like that which fills on winter days, in colder regions, the hollows of the snow. Sky and sea show but gradations of the same color, and afford but modifications of the same element. In this quietness, yonder schooner seems not so much to lie at anchor in the water as to anchor the water, so that both cease to move; and though faint ripples may come and go elsewhere on the surface, the vessel rests in this liquid island of absolute calm. For there certainly is elsewhere a sort of motionless movement, as Keats speaks of \"a little noiseless noise among the leaves,\" or as the summer clouds form and disappear without apparent wind and without prejudice to the stillness. A man may lie in the profoundest trance and still be breathing, and the very pulsations of the life of nature, in these calm hours, are to be read in these changing tints and shadows and ripples, and in the mirage-bewildered outlines of the islands in the bay. It is this incessant shifting of relations, this perpetual substitution of fantastic for real values, this inability to trust your own eye or ear unless the mind makes its own corrections,—that gives such an inexhaustible attraction to life beside the ocean. The sea-change comes to you without your waiting to be drowned. You must recognize the working of your own imagination and allow for it. When, for instance, the sea-fog settles down around us at nightfall, it sometimes grows denser and denser till it apparently becomes more solid than the pavements of the town, or than the great globe itself; and when the fog-whistles go wailing on through all the darkened hours, they seem to be signalling not so much for a lost ship as for a lost island. How unlike are those weird and gloomy nights to this sunny noon, when I rest my oars in this sheltered bay, where a small lagoon makes in behind Coaster\u0027s Harbor Island, and the very last breath and murmur of the ocean are left outside! The coming tide steals to the shore in waves so light they are a mere shade upon the surface till they break, and then die speechless for one that has a voice. And even those rare voices are the very most confidential and silvery whispers in which Nature ever spoke to man; the faintest summer insect seems resolute and assured beside them; and yet it needs but an indefinite multiplication of these sounds to make up the thunder of the surf. It is so still that I can let the wherry drift idly along the shore, and can watch the life beneath the water. The small fry cluster and evade between me and the brink; the half-translucent shrimp glides gracefully undisturbed, or glances away like a flash if you but touch the surface; the crabs waddle or burrow, the smaller species mimicking unconsciously the hue of the soft green sea-weed, and the larger looking like motionless stones, covered with barnacles and decked with fringing weeds. I am acquainted with no better Darwinian than the crab; and however clumsy he may be when taken from his own element, he has a free and floating motion which is almost graceful in his own yielding and buoyant home. It is so with all wild creatures, but especially with those of water and air. A gull is not reckoned an especially graceful bird, but yonder I see one, snowy white, that has come to fish in this safe lagoon, and it dips and rises on its errands as lightly as a butterfly or a swallow. Beneath that neighboring causeway the water-rats run over the stones, lithe and eager and alert, the body carried low, the head raised now and then like a hound\u0027s, the tail curving gracefully and aiding the poise; now they are running to the water as if to drink, now racing for dear life along the edge, now fairly swimming, then devoting an interval to reflection, like squirrels, then again searching over a pile of sea-weed and selecting some especial tuft, which is carried, with long, sinuous leaps, to the unseen nest. Indeed, man himself is graceful in his unconscious and direct employments: the poise of a fisherman, for instance, the play of his arm, the cast of his line or net,—these take the eye as do the stealthy movements of the hunter, the fine attitudes of the wood-chopper, the grasp of the sailor on the helm. A haystack and a boat are always picturesque objects, and so are the men who are at work to build or use them. So is yonder stake-net, glistening in the noonday light,—the innumerable meshes drooping in soft arches from the high stakes, and the line of floats stretching shoreward, like tiny stepping-stones; two or three row-boats are gathered round it, with fishermen in red or blue shirts, while one white sail-boat hovers near. And I have looked down on our beach in spring, at sunset, and watched them drawing nets for the young herring, when the rough men looked as graceful as the nets they drew, and the horseman who directed might have been Redgauntlet on the Solway Sands. I suppose it is from this look of natural fitness that a windmill is always such an appropriate object by the sea-shore. It is simply a four-masted schooner, stranded on a hill-top, and adapting itself to a new sphere of duty. It can have needed but a slight stretch of invention in some seaman to combine these lofty vans, and throw over them a few remodelled sails. The principle of their motion is that by which a vessel beats to windward; the miller spreads or reefs his sails, like a sailor,—reducing them in a high wind to a mere \"pigeon-wing\" as it is called, two or three feet in length, or in some cases even scudding under bare poles. The whole structure vibrates and creaks under rapid motion, like a mast; and the angry vans, disappointed of progress, are ready to grind to powder all that comes within their grasp, as they revolve hopelessly in this sea of air. When the sun grows hot, I like to take refuge in a sheltered nook beside Goat Island Lighthouse, where the wharf shades me, and the resonant plash of waters multiplies itself among the dark piles, increasing the delicious sense of coolness. While the noonday bells ring twelve, I take my rest. Round the corner of the pier the fishing-boats come gliding in, generally with a boy asleep forward, and a weary man at the helm; one can almost fancy that the boat itself looks weary, having been out since the early summer sunrise. In contrast to this expression of labor ended, the white pleasure-boats seem but to be taking a careless stroll by water; while a skiff full of girls drifts idly along the shore, amid laughter and screaming and much aimless splash. More resolute and business-like, the boys row their boat far up the bay; then I see a sudden gleam of white bodies, and then the boat is empty, and the surrounding water is sprinkled with black and bobbing heads. The steamboats look busier yet, as they go puffing by at short intervals, and send long waves up to my retreat; and then some schooner sails in, full of life, with a white ripple round her bows, till she suddenly rounds to drops anchor, and is still. Opposite me, on the landward side of the bay, the green banks slope to the water; on yonder cool piazza there is a young mother who swings her baby in the hammock, or a white-robed figure pacing beneath the trailing vines. Peace and lotus-eating on shore; on the water, even in the stillest noon, there are life and sparkle and continual change. One of those fishermen whose boats have just glided to their moorings is to me a far more interesting person than any of his mates, though he is perhaps the only one among them with whom I have never yet exchanged a word. There is good reason for it; he has been deaf and dumb since boyhood. He is reported to be the boldest sailor among all these daring men; he is the last to retreat before the coming storm; the first after the storm to venture through the white and whirling channels, between dangerous ledges, to which others give a wider berth. I do not wonder at this, for think how much of the awe and terror of the tempest must vanish if the ears be closed! The ominous undertone of the waves on the beach and the muttering thunder pass harmless by him. How infinitely strange it must be to have the sight of danger, but not the sound! Fancy such a deprivation in war, for instance, where it is the sounds, after all, that haunt the memory the longest; the rifle\u0027s crack, the irregular shots of skirmishers, the long roll of alarm, the roar of great guns. This man would have missed them all. Were a broadside from an enemy\u0027s gunboat to be discharged above his head, he would not hear it; he would only recognize, by some jarring of his other senses, the fierce concussion of the air. How much deeper seems his solitude than that of any other \"lone fisher on the lonely sea\"! Yet all such things are comparative; and while the others contrast that wave-tossed isolation with the cheeriness of home, his home is silent too. He has a wife and children; they all speak, but he hears not their prattle or their complaints. He summons them with his fingers, as he summons the fishes, and they are equally dumb to him. Has he a special sympathy with those submerged and voiceless things? Dunfish, in the old newspapers, were often called \"dumb\u0027d fish\"; and they perchance come to him as to one of their kindred. They may have learned, like other innocent things, to accept this defect of utterance, and even imitate it. I knew a deaf-and-dumb woman whose children spoke and heard; but while yet too young for words, they had learned that their mother was not to be reached in that way; they never cried or complained before her, and when most excited would only whisper. Her baby ten months old, if disturbed in the night, would creep to her and touch her lips, to awaken her, but would make no noise. One might fancy that all men who have an agonizing sorrow or a fearful secret would be drawn by irresistible attraction into the society of the deaf and dumb. What awful passions might not be whispered, what terror safely spoken, in the charmed circle round yonder silent boat,—a circle whose centre is a human life which has not all the susceptibilities of life, a confessional where even the priest cannot hear! Would it not relieve sorrow to express itself, even if unheeded? What more could one ask than a dumb confidant? and if deaf also, so much the safer. To be sure, he would give you neither absolution nor guidance; he could render nothing in return, save a look or a clasp of the hand; nor can the most gifted or eloquent friendship do much more. Ah! but suddenly the thought occurs, suppose that the defect of hearing, as of tongue, were liable to be loosed by an overmastering emotion, and that by startling him with your hoarded confidence you were to break the spell! The hint is too perilous; let us row away. A few strokes take us to the half-submerged wreck of a lime-schooner that was cut to the water\u0027s edge, by a collision in a gale, twelve months ago. The water kindled the lime, the cable was cut, the vessel drifted ashore and sunk, still blazing, at this little beach. When I saw her, at sunset, the masts had been cut away, and the flames held possession on board. Fire was working away in the cabin, like a live thing, and sometimes glared out of the hatchway; anon it clambered along the gunwale, like a school-boy playing, and the waves chased it as in play; just a flicker of flame, then a wave would reach up to overtake it; then the flames would be, or seem to be, where the water had been; and finally, as the vessel lay careened, the waves took undisturbed possession of the lower gunwale, and the flames of the upper. So it burned that day and night; part red with fire, part black with soaking; and now twelve months have made all its visible parts look dry and white, till it is hard to believe that either fire or water has ever touched it. It lies over on its bare knees, and a single knee, torn from the others, rests imploringly on the shore, as if that had worked its way to land, and perished in act of thanksgiving. At low tide, one half the frame is lifted high in air, like a dead tree in the forest. Perhaps all other elements are tenderer in their dealings with what is intrusted to them than is the air. Fire, at least, destroys what it has ruined; earth is warm and loving, and it moreover conceals; water is at least caressing,—it laps the greater part of this wreck with protecting waves, covers with sea-weeds all that it can reach, and protects with incrusting shells. Even beyond its grasp it tosses soft pendants of moss that twine like vine-tendrils, or sway in the wind. It mellows harsh colors into beauty, and Ruskin grows eloquent over the wave-washed tint of some tarry, weather-beaten boat. But air is pitiless: it dries and stiffens all outline, and bleaches all color away, so that you can hardly tell whether these ribs belonged to a ship or an elephant; and yet there is a certain cold purity in the shapes it leaves, and the birds it sends to perch upon these timbers are a more graceful company than lobsters or fishes. After all, there is something sublime in that sepulture of the Parsees, who erect near every village a dokhma, or Tower of Silence, upon whose summit they may bury their dead in air. Thus widely may one\u0027s thoughts wander from a summer boat. But the season for rowing is a long one, and far outlasts in Oldport the stay of our annual guests. Sometimes in autumnal mornings I glide forth over water so still, it seems as if saturated by the Indian-summer with its own indefinable calm. The distant islands lift themselves on white pedestals of mirage; the cloud-shadows rest softly on Conanicut; and what seems a similar shadow on the nearer slopes of Fort Adams is in truth but a mounted battery, drilling, which soon moves and slides across the hazy hill like a cloud. I hear across nearly a mile of water the faint, Sharp orders and the sonorous blare of the trumpet That follows each command; the horsemen gallop and wheel; suddenly the band within the fort strikes up for guard-mounting, and I have but to shut my eyes to be carried back to warlike days that passed by,—was it centuries ago? Meantime, I float gradually towards Brenton\u0027s Cove; the lawns that reach to the water\u0027s edge were never so gorgeously green in any summer, and the departure of the transient guests gives to these lovely places an air of cool seclusion; when fashion quits them, the imagination is ready to move in. An agreeable sense of universal ownership comes over the winter-staying mind in Oldport. I like to keep up this little semblance of habitation on the part of our human birds of passage; it is very pleasant to me, and perhaps even pleasanter to them, that they should call these emerald slopes their own for a month or two; but when they lock the doors in autumn, the ideal key reverts into my hands, and it is evident that they have only been \"tenants by the courtesy,\" in the fine legal phrase. Provided they stay here long enough to attend to their lawns and pay their taxes, I am better satisfied than if these estates were left to me the whole year round. The tide takes the boat nearer to the fort; the horsemen ride more conspicuously, with swords and trappings that glisten in the sunlight, while the white fetlocks of the horses twinkle in unison as they move. One troop-horse without a rider wheels and gallops with the rest, and seems to revel in the free motion. Here also the tide reaches or seems to reach the very edge of the turf; and when the light battery gallops this way, it is as if it were charging on my floating fortress. Upon the other side is a scene of peace; and a fisherman sings in his boat as he examines the floats of his stake-net, hand over hand. A white gull hovers close above him, and a dark one above the horsemen, fit emblems of peace and war. The slightest sounds, the rattle of an oar, the striking of a hoof against a stone, are borne over the water to an amazing distance, as if the calm bay amid its seeming quiet, were watchful of the slightest noise. But look! in a moment the surface is rippled, the sky is clouded, a swift change comes over the fitful mood of the season; the water looks colder and deeper, the greensward assumes a chilly darkness, the troopers gallop away to their stables, and the fisherman rows home. That indefinable expression which separates autumn from summer creeps almost in an instant over all. Soon, even upon this Isle of Peace, it will be winter. Each season, as winter returns, I try in vain to comprehend this wonderful shifting of expression that touches even a thing so essentially unchanging as the sea. How delicious to all the senses is the summer foam above yonder rock; in winter the foam is the same, the sparkle as radiant, the hue of the water scarcely altered; and yet the effect is, by comparison, cold, heavy, and leaden. It is like that mysterious variation which chiefly makes the difference between one human face and another; we call it by vague names, and cannot tell in what it lies; we only know that when expression changes, all is gone. No warmth of color, no perfection of outline can supersede those subtile influences which make one face so winning that all human affection gravitates to its spell, and another so cold or repellent that it dwells forever in loneliness, and no passionate heart draws near. I can fancy the ocean beating in vague despair against its shores in winter, and moaning, \"I am as beautiful, as restless, as untamable as ever: why are my cliffs left desolate? why am I not loved as I was loved in summer?\"","sourceLink":"http://novel.tingroom.com/duanpian/3182/87156.html","bookId":852,"book":{"id":852,"title":"Oldport Days","description":"简介： Our August life rushes by, in Oldport, as if we were all shot from the mouth of a cannon, and were endeavoring to exchange visiting-cards on the way. But in September, when the great hotels are closed, and the bronze dogs that guarded the portals of...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3182","creation":"Aug 1, 2019 12:23:35 AM","modification":"Aug 1, 2019 12:23:35 AM"}}
