{"id":14899,"no":20,"title":"TRIVIA","content":"The secret thoughts of a man run over all things, holy, profane, clean, obscene, grave, and light, without shame or blame. —HOBBES, Leviathan, Chap. VIII. The bachelor is almost extinct in America. Our hopelessly utilitarian civilization demands that a man of forty should be rearing a family, should go to an office five times a week, and pretend an interest in the World\u0027s Series. It is unthinkable to us that there should be men of mature years who do not know the relative batting averages of the Red Sox and the Pirates. The intellectual and strolling male of from thirty-five to fifty-five years (which is what one means by bachelor) must either marry and settle down in the Oranges, or he must flee to Europe or the MacDowell Colony. There is no alternative. Vachel Lindsay please notice. The fate of Henry James is a case in point. Undoubtedly he fled the shores of his native land to escape the barrage of the bonbonniverous sub-deb, who would else have mown him down without ruth. But in England they still linger, these quaint, phosphorescent middle-aged creatures, lurking behind a screenage of muffins and crumpets and hip baths. And thither fled one of the most delightful born bachelors this hemisphere has ever unearthed, Mr. Logan Pearsall Smith. Mr. Smith was a Philadelphian, born about fifty years ago. But that most amiable of cities does not encourage detached and meditative bachelorhood, and after sampling what is quaintly known as \"a guarded education in morals and manners\" at Haverford College, our hero passed to Harvard, and thence by a swifter decline to Oxford. Literature and liberalism became his pursuits; on the one hand, he found himself engrossed in the task of proving to the British electorate that England need not always remain the same; on the other, he wrote a Life of Sir Henry Wotton, a volume of very graceful and beautiful short stories about Oxford (\"The Youth of Parnassus\") and a valuable little book on the history and habits of the English language. But in spite of his best endeavours to quench and subdue his mental humours, Mr. Smith found his serious moments invaded by incomprehensible twinges of esprit. Travelling about England, leading the life of the typical English bachelor, equipped with gladstone bag, shaving kit, evening clothes and tweeds; passing from country house to London club, from Oxford common room to Sussex gardens, the solemn pageantry of the cultivated classes now and then burst upon him in its truly comic aspect. The tinder and steel of his wit, too uncontrollably frictioned, ignited a shower of roman candles, and we conceive him prostrated with irreverent laughter in some lonely railway carriage. Mr. Smith did his best to take life seriously, and I believe he succeeded passably well until after forty years of age. But then the spectacle of the English vicar toppled him over, and once the gravity of the Church of England is invaded, all lesser Alps and sanctuaries lie open to the scourge. Menaced by serious intellectual disorders unless he were to give vent to these disturbing levities, Mr. Smith began to set them down under the title of \"Trivia,\" and now at length we are enriched by the spectacle of this iridescent and puckish little book, which presents as it were a series of lantern slides of an ironical, whimsical, and merciless sense of humour. It is a motion picture of a middle-aged, phosphorescent mind that has long tried to preserve a decent melancholy but at last capitulates in the most delicately intellectual brainslide of our generation. This is no Ring Lardner, no Irvin Cobb, no Casey at the bat. Mr. Smith is an infinitely close and acute observer of sophisticated social life, tinged with a faint and agreeable refined sadness, by an aura of shyness which amounts to a spiritual virginity. He comes to us trailing clouds of glory from the heaven of pure and unfettered speculation which is our home. He is an elf of utter simplicity and infinite candour. He is a flicker of absolute Mind. His little book is as precious and as disturbing as devilled crabs. Blessed, blessed little book, how you will run like quicksilver from mind to mind, leaping—a shy and shining spark—from brain to brain! I know of nothing since Lord Bacon quite like these ineffably dainty little paragraphs of gilded whim, these rainbow nuggets of wistful inquiry, these butterfly wings of fancy, these pointed sparklers of wit. A purge, by Zeus, a purge for the wicked! Irony so demure, so quaint, so far away; pathos so void of regret, merriment so delicate that one dare not laugh for fear of dispelling the charm—all this is \"Trivia.\" Where are Marcus Aurelius or Epictetus or all the other Harold Bell Wrights of old time? Baron Verulam himself treads a heavy gait beside this airy elfin scamper. It is Atalanta\u0027s heels. It is a heaven-given scenario of that shyest, dearest, remotest of essences—the mind of a strolling bachelor. Bless his heart, in a momentary panic of modesty at the thought of all hi sacred plots laid bare, the heavenly man tries to scare us away. \"These pieces of moral prose have been written, dear Reader, by a Carnivorous Mammal, belonging to that suborder of the Animal Kingdom which includes also the Baboon, with his bright blue and scarlet bottom, and the gentle Chimpanzee.\" But this whimsical brother to the chimpanzee, despite this last despairing attempt at modest evasion, denudes himself before us. And his heart, we find is strangely like our own. His reveries, his sadnesses, his exhilarations, are all ours, too. Like us he cries, \"I wish I were unflinching and emphatic, and had big bushy eyebrows and a Message for the Age. I wish I were a deep Thinker, or a great Ventriloquist.\" Like us he has only a ghost, a thin, unreal phantom in a world of bank cashiers and duchesses and prosperous merchants and other Real Persons. Like us he fights a losing battle against the platitudes and moral generalizations that hem us round. \"I can hardly post a letter,\" he laments, \"without marvelling at the excellence and accuracy of the Postal System.\" And he consoles himself, good man, with the thought of the meaningless creation crashing blindly through frozen space. His other great consolation is his dear vice of reading—\"This joy not dulled by Age, this polite and unpunished vice, this selfish, serene, life-long intoxication.\" It is impossible by a few random snippets to give any just figment of the delicious mental intoxication of this piercing, cathartic little volume. It is a bright tissue of thought robing a radiant, dancing spirit. Through the shimmering veil of words we catch, now and then, a flashing glimpse of the Immortal Whimsy within, shy, sudden, and defiant. Across blue bird-haunted English lawns we follow that gracious figure, down dusky London streets where he is peering in at windows and laughing incommunicable jests. But alas, Mr. Pearsall Smith is lost to America. The warming pans and the twopenny tube have lured him away from us. Never again will he tread on peanut shells in the smoking car or read the runes about Phoebe Snow. Chiclets and Spearmint and Walt Mason and the Toonerville Trolley and the Prince Albert ads—these mean nothing to him. He will never compile an anthology of New York theatrical notices: \"The play that makes the dimples to catch the tears.\" Careful and adroit propaganda, begun twenty years ago by the Department of State, might have won him back, but now it is impossible to repatriate him. The exquisite humours of our American life are faded from his mind. He has gone across the great divide that separates a subway from an underground and an elevator from a lift. I wonder does he ever mourn the scrapple and buckwheat cakes that were his birthright? Major George Haven Putnam in his \"Memories of a Publisher\" describes a famous tennis match played at Oxford years ago, when he and Pearsall Smith defeated A.L. Smith and Herbert Fisher, the two gentlemen who are now Master of Balliol and British Minister of Education. The Balliol don attributed the British defeat in this international tourney to the fact that his tennis shoes (shall we say his \"sneakers?\") came to grief and he had to play the crucial games in stocking feet. But though Major Putnam and his young ally won the set of patters (let us use the Wykehamist word), the Major allowed the other side to gain a far more serious victory. They carried off the young Philadelphian and kept him in England until he was spoiled for all good American uses. That was badly done, Major! Because we needed Pearsall Smith over here, and now we shall never recapture him. He will go on calling an elevator a lift, and he will never write an American \"Trivia.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3203/87519.html","bookId":760,"book":{"id":760,"title":"Shandygaff","description":"简介： Kenneth Stockton was a man of letters, and correspondingly poor. He was the literary editor of a leading metropolitan daily; but this job only netted him fifty dollars a week, and he was lucky to get that much. The owner of the paper was powerfully i...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3203","creation":"Aug 1, 2019 12:19:16 AM","modification":"Aug 1, 2019 12:19:16 AM"}}
