{"id":14906,"no":27,"title":"THE LITERARY PAWNSHOP","content":"Excellent Parson Adams, in \"Joseph Andrews,\" is not the only literary man who has lamented the difficulty of ransoming a manuscript for immediate cash. It will be remembered that Mr. Adams had in his saddlebag nine volumes of sermons in manuscript, \"as well worth a hundred pounds as a shilling was worth twelve pence.\" Offering one of these as a pledge, Parson Adams besought Mr. Tow-Wouse, the innkeeper, to lend him three guineas but the latter had so little stomach for a transaction of this sort that \"he cried out, \u0027Coming, sir,\u0027 though nobody called; and ran downstairs without any fear of breaking his neck.\" As a whimsical essayist (with whom I have talked over these matters) puts it, the business of literature is imperfectly coordinated with life. Almost any other kind of property is hockable for ready cash. A watch, a ring, an outworn suit of clothes, a chair, a set of books, all these will find willing purchasers. But a manuscript which happens not to meet the fancy of the editors must perforce lie idle in your drawer though it sparkle with the brilliants of wit, and five or ten years hence collectors may list it in their catalogues. No mount of piety along Sixth Avenue will accept it in pawn, no Hartford Lunch will exchange it for corned beef hash and dropped egg. This is a dismal thing. This means that there is an amusing and a competent living to be gained by a literary agent of a new kind. Think how many of the most famous writers have trod the streets ragged and hungry in their early days. There were times when they would have sold their epics, their novels, their essays, for the price of a square meal. Think of the booty that would accumulate in the shop of a literary pawnbroker. The early work of famous men would fill his safe to bursting. Later on he might sell it for a thousand times what he gave. There is nothing that grows to such fictitious value as manuscript. Think of Francis Thompson, when he was a bootmaker\u0027s assistant in Leicester Square. He was even too poor to buy writing materials. His early poems were scribbled on scraps of old account books and wrapping paper. How readily he would have sold them for a few shillings. Or Edgar Poe in the despairing days of his wife\u0027s illness. Or R.L.S. in the fits of depression caused by his helpless dependence upon his father for funds. What a splendid opportunity these crises in writers\u0027 lives would offer to the enterprising buyer of manuscripts! Be it understood, of course, that the pawnbroker must be himself an appreciator of good things. No reason why he should buy poor stuff, even though the author of it be starving. Richard Le Gallienne has spoken somewhere of the bookstores which sell \"books that should never have been written to the customers who should never have been born.\" Our pawnbroker must guard himself against buying this kind of stuff. He will be besieged with it. Very likely Mr. Le Gallienne himself will be the first to offer him some. But his task will be to discover new and true talent beneath its rags, and stake it to a ham sandwich when that homely bite will mean more than a dinner at the Ritz ten years later. The idea of the literary pawnbroker comes to me from the (unpublished) letters of John Mistletoe, author of the \"Dictionary of Deplorable Facts,\" that wayward and perverse genius who wandered the Third Avenue saloons when he might have been fêted by the Authors\u0027 League had he lived a few years longer. Some day, I hope, the full story of that tragic life may be told, and the manuscripts still cherished by his executor made public. In the meantime, this letter, which he wrote in 1908, gives a sad and vivid little picture of the straits of unadmitted genius: \"I write from Connor\u0027s saloon. Paunchy Connor has been my best—indeed my only—friend in this city, when every editor, publisher, and critic has given me the frozen mitt. Of course I know why ... the author of \u0027Vermin\u0027 deserves not, nor wants, their hypocritical help. The book was too true to life to please the bourgeois and yet not ribald enough to tickle the prurient. I had a vile pornographic publisher after me the other day; he said if I would rub up some of the earlier chapters and inject a little more spice he thought he could do something with it—as a paper-covered erotic for shop-girls, I suppose he meant. I kicked him downstairs. The stinking bounder! \"Until to-day I had been without grub for sixty hours. That is literally true. I was ashamed of sponging on Paunchy, and could not bring myself to come back to the saloon where he would willingly have fed me. I did get a job for two days as a deckhand on an Erie ferryboat, but they found out I did not belong to the union. I had two dollars in my pocket—a fortune—but while I was dozing on a doorstep on Hudson Street, waiting for the cafés to open (I was too done to walk half a dozen blocks to an all-night restaurant), some snapper picked my pocket. That night I slept in a big drain pipe where they were putting up a building. \"Why isn\u0027t there a pawnshop where one could hang up MSS. for cash? In my hallroom over Connor\u0027s saloon I have got stuff that will be bid for at auctions some day (that isn\u0027t conceit, I know it), but at this moment, July 17, 1908, I couldn\u0027t raise 50 cents on it. If there were a literary mount of piety—a sort of Parnassus of piety as it were—the uncle in charge might bless the day he met me. Well, it won\u0027t be for long. This cancer is getting me surely. \"This morning I\u0027m cheerful. I\u0027ve scrubbed and swept Paunchy\u0027s bar for him, and the dirty, patchouli-smelling hop-joint he keeps upstairs, bless his pimping old heart. And I\u0027ve had a real breakfast: boiled red cabbage, stewed beef (condemned by the inspector), rye bread, raw onions, a glass of Tom and Jerry, and two big schooners of the amber. I\u0027m working on my Third Avenue novel called \u0027The L.\u0027 \"I shan\u0027t give you my right address, or you\u0027d send someone down here to give me money, you damned philanthropist.... Connor ain\u0027t the real name, so there. When I die (soon) they\u0027ll find Third Avenue written on my heart, if I still have one....\" It is interesting to recall that the MS. of his poems \"Pavements, and Other Verses\" was bought by a private collector for $250 last winter. Will not some literary agent think over this idea? \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3203/87526.html","bookId":760,"book":{"id":760,"title":"Shandygaff","description":"简介： Kenneth Stockton was a man of letters, and correspondingly poor. He was the literary editor of a leading metropolitan daily; but this job only netted him fifty dollars a week, and he was lucky to get that much. The owner of the paper was powerfully i...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3203","creation":"Aug 1, 2019 12:19:16 AM","modification":"Aug 1, 2019 12:19:16 AM"}}
