{"id":32450,"no":7,"title":"CHAPTER VII.","content":"“Now, Mr. Balderson, take Harper and Winthorpe, and make your way through the jungle as noiselessly as possible. It is probable that the path runs within fifty yards of this point, possibly it is only half a dozen. When you have found it, send Winthorpe back to me with the news. Take that long coil of thin rope that is in the bow, and pay it out as you go along. You might get lost even within two yards of the stream, and it would be dangerous to call or whistle. It will enable me to join you. Leave your muskets behind, lads; they would only be in the way in the jungle, and you have your pistols and cutlasses. You take the lantern, Winthorpe, and Harper, do you take the rope. Fasten one end to the thwart before you start, or, without knowing it, you might drag it after you.” Dick led the way, the others following close behind, but as soon as they were among the trees, he was obliged to take the lantern, for the darkness was so intense that he could not see an inch before him and would have been torn to pieces by the thorny creepers had he tried to penetrate without a light. As it was, he received several nasty scratches, and could hear muttered exclamations from the men behind him. Creeping under some of the rattans, making detours to avoid others, and cutting some of the smaller ones in two with his cutlass, he made his way forward, and was delighted indeed when, after proceeding some twenty yards, he came upon the edge of what looked like a ditch, but which was, he knew, the native path. “Here we are, lads,” he exclaimed in a low tone; “thank goodness we have not had to go farther.” “So say I, sir,” one of the men grumbled; “if it had not been for your lantern I should have been torn to pieces. As it is, I aint sure whether my eyes aint gone, and my nose and cheeks are scratched as if I had been fighting with a mad cat.” “Here, Winthorpe, take the lantern and make your way back; darken it as soon as you get through to the edge of the creek. You cannot go wrong with the cord to guide you.” Two or three minutes later Dick saw the light approaching again, and the lieutenant, the coxswain, and two bluejackets joined him, Winthorpe and another having been left as boat keepers. “Now, Harris, do you and one of the others go on ahead; we will follow fifty yards behind you. If you hear anyone coming, give a low whistle; we will then turn off the light. You can walk on confidently, for there is no chance of any of these prickly creepers running across the path. When you see the trees are getting thinner, or that there is an opening before you, stop and send back word to us, so that we can shut up the lantern before joining you.” The lieutenant headed the party now, followed by Dick. He held the lantern close to the ground; the bottom was, like all jungle paths, worn perfectly smooth by the passage of the barefooted natives. “Nothing could be better,” he said in a low voice to Dick. “We ought to be able to haul the guns along here at a trot; and the opening is wide enough on each side for a gun carriage to be carried along without any difficulty.” In ten minutes one of the men ahead came back. “We have got to the end of the path, sir; it ends on the bank of that pool we saw ahead.” The lantern was now extinguished, and the party hurried forward. On reaching the bank they found that the path ended, as they had expected, just opposite the village. The prahus lay somewhat to the right. “It could not be better,” the lieutenant whispered. “Now let us see whether we can find a suitable place for the guns.” This was much easier than they had expected, for the trees were cleared, probably to furnish firewood, for a distance of some fifteen yards from the bank; between this cleared place and the water was a fringe of thick bushes. “This will do capitally, lads. Now we will be off at once; we have found out all that we wanted, and nothing could be more satisfactory.” They retraced their steps rapidly till they came to the coil of cord looped on a low bough. The coxswain took it down, and they were soon all on board the boat again. “Now, lads, row as noiselessly as you can to the mouth of the pool again, then turn, and lay on your oars, except bow and two, who are to paddle very slowly. Hand Mr. Balderson that twenty foot bamboo; I want to sound the river as we come back.” As soon as the boat was again turned, Dick took the pole, and, standing up, thrust it down into the water. “Only about seven feet, sir,” he whispered. “That is bad. It is evident that the ship cannot get up here; still we may as well go on sounding.” “The water is gradually deepening,” Dick said, thrusting the pole down again; “there are nearly ten feet.” It was not long before he announced fifteen, and at that continued until they reached the entrance to the creek, where it was only fourteen feet. “It would be a touch and go there,” the lieutenant said, “but I dare say she could be pushed through. It is very unfortunate that there is that shallow bar this side of the pool. And now, lads, you can lay out for ten minutes, and then we can fasten up to a bough and see what is in the hamper. We have done our work earlier than I had expected, and can take it easy.” The steward had provided them with an ample store of food, and the men ate their hunks of cold meat and bread, and passed round the pannikins of grog, with great contentment, while the officers divided a cold chicken and a bottle of claret. “Now, men,” the lieutenant said, when they had finished, “you can have a quarter of an hour\u0027s smoke. You must open the lantern in the bottom of the boat, and hold a jacket over it to prevent the light falling on any of you.” When the men had lit their pipes the lantern was passed aft, and while the coxswain put his jacket over it, the lieutenant lit a cigar. “You smoke, don\u0027t you, Balderson?” “Yes, sir, I began when we came up the river; the doctor said it is a good thing to keep off miasma.” “Very well, then light up; I think that it is a good thing myself. We have done a very satisfactory night\u0027s work, and I think we see our way now to getting rid of most of those piratical craft, which will not only be a benefit to traders on the coast of the river, but will greatly please all the other chiefs, and will enable them to hold their own against Sehi.” Five minutes were added to the promised quarter, and then the pipes were laid down, and the boat proceeded at a steady stroke until they reached the spot where they had fished. “Somewhere about here, lad?” “Yes, sir, I think that this is just the place. I noticed that tall tree rising above the general line just opposite where we were anchored.” “Then lower the grapnel; in oars.” Another bottle was produced from the hamper; the lieutenant filled a wine glass full and drank it off, and then passed the glass over to Dick. “What is it, sir?” “It is some grog, with a large dose of quinine. The doctor begged me to give it an hour or two before daylight. Now, lads, you are each to take a glass of this; it will protect you against the effect of the mist on the river. You can show the lantern now; it is just as well that they should see it if they are on the lookout.” Every man took his glass of the mixture. “Now wrap yourselves in your blankets, lads, and lie down for a couple of hours\u0027 sleep.” After a minute or two\u0027s scuffling while each found a plank to suit him, all was quiet in the boat. Dick, who felt far too excited over the events of the night to be sleepy, had volunteered to keep watch, and, lighting another pipe at the lantern, smoked till it was broad daylight. Then he roused the crew, and in less than two hours afterwards they rowed alongside the Serpent. The captain was greatly pleased with Mr. Ferguson\u0027s report. “It is unlucky about that bar in the creek, otherwise we might have taken the ship right into the pool, and fought it out with them there. Still, it may be that this will be the best in the end, for we could hardly have counted upon sinking the whole of them, and once past us they would have been off like the wind; and though we might have followed some of them, the others would have made off, some one way and some another, whereas, by laying the vessel across the mouth of the creek, we have a good chance of catching them all as they come down. There is no doubt a lot more fellows have arrived to help the rajah; we can see that there are a great many more about on the shore than there have been before. I think things will come to a crisis before many hours have passed. We have made out that men keep coming and going behind that row of six huts facing the river, and I should not be surprised if they are not hard at work establishing a battery there.” Presently two Malays, whom they recognized as belonging to the rajah\u0027s council, advanced to the edge of the shore, which was but some fifty yards away. One of them held a pole to which a white cloth was attached. “I have a message from the rajah,” he shouted out. The captain sent for the interpreter, and went to the side of the quarterdeck. “The rajah says that he does not want to have any more to say to you. You want to take his country; he will not let you have it, and if you do not go away in an hour, he will sink your ship.” “Tell him,” the captain said, “that it will be the worse for him if he tries it. I came up here at his invitation, and shall stay just as long as I please.” The two Malays retired, walking in a quiet and dignified way. The news soon ran through the ship of the defiance that had been given, and excited the liveliest satisfaction. The men were shaking hands, cutting capers, and indulging in much joking and laughter. Half an hour later there was a sudden uproar in the town, drums were beaten, horns sounded, and the Malays by the river bank speedily retired behind the huts. “You had better get the magazine opened, Mr. Ferguson, and everything in readiness, but we won\u0027t beat to quarters till they begin.” The tumult on shore increased, and soon a few shots were fired from behind houses and walls, the balls whistling overhead. “There won\u0027t be much of that,” the captain said, as he walked up and down the quarterdeck with the first lieutenant; “we have seen very few guns among them. I should doubt if there are a hundred in the town. What there are were, no doubt, captured from trading vessels the scoundrels have plundered and burned.” A few minutes later the bamboos forming the wall of the six houses where a bustle had been observed fell outward, the lashings having been cut by a swarm of Malays, who, as soon as the last fell, ran back, showing eight brass cannon. “Beat to quarters, Mr. Ferguson,” the Captain said quietly, and at the first tap of the drum the sailors, who had been expecting the order, ran to their stations. As they gained them the little battery on shore opened fire. Although the distance was but a hundred yards, only three of the balls hit the hull, the others passing through the masts. “Load with grape,” the captain ordered. “Captain Hugeson,” he said to the Marine officer, “will you place your men on the poop, and tell them to open fire as soon as the guns send the Malays flying from their battery? I can see that there are large numbers gathered round it. Mr. Ferguson, will you see that the guns are all laid on that battery? When they are ready, fire a broadside that will clear the place out at once.” Two minutes later there was a crash as the whole of the guns on the starboard side were discharged at the same moment. The effect was tremendous, and the storm of grape swept away the whole of the buildings beneath which the guns were standing. Three of these were dismounted, and not one of the men who had been crowded round them remained on his feet. Numbers were seen running away in all directions, and a volley from the marines brought several of these down. “There is an end to the attack,” the captain said quietly. “Order the men to load with shell, and to direct their aim in the first place at the rajah\u0027s palace; there is no occasion for rapid firing.” Gun after gun sent its messenger into the palace, and in three or four minutes flames were seen rising from it. The order was then given to fire with grape at all the houses facing the water. In the meantime the men were called from their guns on the port side, and the boats lowered. The marines and all the sailors, save those serving the starboard guns, took their places in them, the first lieutenant taking the command, and on the word being given they dashed with a cheer towards the shore, and, leaping out, formed up, and led by their officers ran forward, not a shot being fired by the Malays as they did so. The fire of the ship\u0027s guns was now directed towards the portion of the town facing the forest, as it was here that the Malays would probably be gathered. Port fires had been distributed among the landing party. As these were lost to sight as they entered the town, those on board ship watched eagerly for the sound of combat. Nothing, however, was heard for a minute or two; then came a single shot, and then a rattle of musketry. “They are making a stand now,” the captain said. “Mr. Hopkins, will you please go round and tell the gunners to be very careful in their aim? Let them watch the smoke rising among the houses, and aim a short distance beyond it. Impress upon them that it is better to fire too far than to risk hurting our own men.” The order was obeyed; soon flames were seen to rise beyond the spot where the fighting was going on, the resistance to the advance speedily ceased, and a dropping fire took the place of the sustained roll of musketry which, five minutes later, broke out again at the edge of the town facing the wood, and the fire of the guns was now directed against the edge of the forest, to which the Malays had evidently fled. In a few minutes smoke began to rise all round the place, showing that the men with port fires were at work, and in a quarter of an hour the bluejackets and marines were seen issuing from the houses and coming down to the shore. The place was by this time a sheet of fire, the lightly built huts, dried in the heat of the sun, catching like tinder, and blazing up in a fierce flame, that in a few minutes left no vestige behind it. The ship\u0027s fire had by this time ceased, and the sailors, as they looked out of the portholes, cheered as the boats came up. Their appearance was far less orderly than it had been when they put off from the ship, every man having carted off some sort of loot—sarongs, spears, krises, and other articles, some obtained from the huts, others thrown away by the Malays in their flight. There were, too, some articles of European manufacture, which had been carried off from the palace before the flames had obtained entire possession. These were in themselves strong proofs that the rajah\u0027s prahus had been engaged in piratical attacks upon European craft, for they consisted of bales of silk, chronometers, watches, double barreled guns, mirrors, and other articles which had evidently formed a portion of a ship\u0027s fittings. “Any casualties, Mr. Ferguson?” the captain asked, as the lieutenant stepped on board. “Half a dozen spear wounds, sir, but only one of a serious nature; our fire was too hot for them to face.” “What do you suppose their loss has been?” “As far as I can judge, sir, some eighty or ninety were killed by our fire, and at least as many must have fallen in the battery; the place was choked up with dead. I have brought the eight guns off; they are only four pounders.” “They may be useful for the boats. I see the men have brought off a good deal of rubbish. You had better give orders that whatever there is is to be fairly divided among all hands. Any articles more valuable than the rest had better be put up to auction, and whatever they fetch also divided among the men. Were the Malays in force?” “The place swarmed with them, sir, but they were evidently demoralized by the fire of the guns, and their attacks were really feeble. The only trouble we had was that some would shut themselves up in houses. It looked at first as if they really meant to fight, but directly the shells began to fall behind them, and fire broke out, they lost heart altogether, and made a bolt for the forest.” “Well, the work has been thoroughly done, Mr. Ferguson, and Sehi has had a lesson that he won\u0027t forget. Now we have to tackle his fleet.” “Everything is ready, sir. We have got the sledges made for the two guns, and a store of long bamboos for the carriages and anything else we may want to take with us.” “This will be a more serious business by a long way,” the captain said. “The men had better take a hundred rounds of ammunition with them, and it would be as well to take a few boxes of spare cartridges; and the men not occupied in dragging the cannon and carrying the carriages, must take up as many rounds of shell as possible, and eight or ten rounds of grape for each gun. You have got the sacks ready for forming the battery; that will be absolutely necessary for the protection of the men firing. Each of the prahus has probably got at least half a dozen small guns, and it would be hardly possible to work our pieces unless the men were protected from their concentrated fire. Tell the chief engineer that steam must be got up by six o\u0027clock. In the meantime, let a slow fire be kept up towards the edge of the forest, just a shot every five minutes, which will be enough to show them we are still here, and have not done with them yet. When the place cools down a bit, we will send a party on shore to keep up a dropping fire against the forest, and so induce them to believe that we mean to attack them there.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3116/85767.html","bookId":928,"book":{"id":928,"title":"Among Malay Pirates","description":"简介： I wish most heartily that something would happen, Harry Parkhurst, a midshipman of some sixteen years of age, said to his chum, Dick Balderson, as they leaned on the rail of her majesty\u0027s gunboat Serpent, and looked gloomily at the turbid stream that...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3116","creation":"Aug 1, 2019 12:23:52 AM","modification":"Aug 1, 2019 12:23:52 AM"}}
