{"id":68857,"no":10,"title":"Page 10","content":"SERO PHROST LOOKED down into the grey darkness of the sea below as his aircar swooped back toward Purgatory. No explanation, no apology, just the flat order to turn back-an order his pilot robot was obeying, despite his best efforts to convince it otherwise. The turn-back order came from a traffic safety center, and the First Law saw to it that that was all a robot needed to know in order to force obedience.\\n\\n But why the turn-around? An arrest order? What did they think they knew? And arrested for what? He would have to be careful, very careful. More than one person had been pulled in on a minor charge and made the mistake of assuming it was about some larger matter.\\n\\n Or was it his own arrest that he was flying back toward? Phrost looked out the porthole and saw the running lights of several other aircars heading back to Purgatory. A dragnet? Perhaps, if he permitted himself to grasp at straws, it had nothing to do with him at all. It could be they were acting on a rustbacking tip-off, and pulling back all flights that had left at a certain time. No way to know. Perhaps it had nothing at all to do with him.\\n\\n The guilty flee when no one pursues. Admit nothing, reveal nothing. There was still every chance for him to win out.\\n\\n The dark sky rushed past him.\\n\\n Alvar Kresh glanced at the wall clock in the operations room. Just before 0700 hours. A bare five hours since he had found the body, though it seemed that enough had happened since then to fill up a month\u0027s worth of days. Tierlaw Verick was filed away for future reference, held under close guard in the same room in which he had been questioned, while the Crime Scene robots went over the room in which he had slept. Kresh doubted that Verick had anything to do with the assassination, but hunches were no way to run an investigation. Who knew what they might find, until they looked?\\n\\n Someone had set up a conference table in the ops room, and Kresh, Fredda Leving, and Justen Devray sat at three of its sides, while Donald 111 stood at the fourth. All of them-even Donald, somehow-seemed exhausted, drawn out, the press of events leaving them all far behind the pace. And yet it seemed they were no further ahead than they had been when they had started.\\n\\n The clock was moving, and moving fast. Kresh dared not delay much longer in contacting the key members of the government, or in announcing Grieg\u0027s death to all Inferno.\\n\\n But the moment he did that, Kresh knew, all hell would break loose. He could not foresee what form the chaos would take, but he knew, beyond doubt, that there would be chaos. He desperately needed to have much of this investigation under control before the news broke wide. And the damage could only be made worse if the first announcement came from someplace beside Alvar Kresh\u0027s own mouth-a probability that was increasing with every second that passed.\\n\\n A deputy might say something over an unscrambled channel that would be overheard, or call a friend or family member with the news, or give or sell the story of the century to a friend in the news business. Or the killers might decide it suited their purposes to make the announcement. Or someone who called Grieg might do what Kresh had done, and realize the Grieg on the other end was a simulation. The sim was still running on the phone system, half to help keep the lid on and half to leave it intact for the analysis teams.\\n\\n They would have to make the announcement soon, very soon, if they were to keep any sort of control over events. But before Kresh told anyone anything, he needed a chance to think, to compare notes, to plan. A council of war-because it might quite literally be that Grieg\u0027s death was the opening shot in an actual war. There was no way to know.\\n\\n He was sure Justen Devray understood all that, and it at least seemed as if Fredda Leving did. Kresh found that he was impressed-very impressed-by the way she had handled herself in the midst of all this chaos. There was a lot to admire about the young, smart, and beautiful Fredda Leving. But Kresh did not feel he could rely too much on her instincts when it came to criminal investigation. She had shown in Verick\u0027s interrogation that she thought in too straight a line for police work. Maybe the direct approach worked in science, where the facts did not mind being discovered. Police work, on the other hand, was a form of research where the facts were often determined to elude capture. Head straight for them and they\u0027d be bound to escape.\\n\\n \"All right, Donald,\" Alvar said. \"Let\u0027s get started. What do we have, and what do we need?\"\\n\\n \"We have ascertained, through Tierlaw Verick\u0027s statement, that Caliban and Prospero were almost certainly the last to see Governor Grieg alive,\" Donald said. \"I have placed an all-points bulletin for their capture, but it seems unlikely we will apprehend them quickly-especially if we do not have the full cooperation of the SSS. Neither the Rangers nor our own department have arrest powers here, or facilities for performing inquiries.\\n\\n \"Neither Prospero nor Caliban are presently available or traceable via hyperwave, and both have duties that require them to be out in the field a great deal. It is possible they are following their normal routines, but are simply out of touch. It is also possible that they have gone into hiding. We will do all we can to trace them, given the limitations of our circumstances. \"\\n\\n Interesting that Donald would start with the robots, Kresh thought. He was focused, perhaps overfocused, on them. It would be best to keep in mind that in this investigation at least, Donald was not likely to be even remotely as objective as he normally was. Clearly, he wanted Prospero and Caliban to be guilty. A biased robot. As if there weren\u0027t enough problems on this case.\\n\\n \"How reliable is Tierlaw\u0027s statement?\" Kresh asked.\\n\\n \"As best I could ascertain, all of his bodily reactions were consistent with a man under great stress giving a truthful statement. I believe that he spoke the truth, \" Donald said.\\n\\n And that was the least-qualified pronouncement Donald had ever made concerning his lie-detector function. Enough so that Kresh felt unsure. Usually Donald made a speech three times longer than that about the uncertainty of such measurement. No doubt about it-he wanted the robots to be guilty.\\n\\n \"We should be able to check his story out against Grieg\u0027s appointment diary,\" Devray said. \"That\u0027s something. But at least we have a lead, and suspects.\"\\n\\n \"Even leaving aside the First Law question, I can\u0027t see what possible motive Caliban and Prospero could have for attacking Grieg, or why they would have been so clumsy about it,\" Fredda protested. \"Yes, Caliban has no First Law. In theory, there is nothing to prevent him attacking anyone he likes. But there\u0027s nothing preventing me, or you, either. And yes, Prospero\u0027s First Law does not enjoin him to prevent harm-but I can\u0027t imagine Prospero splitting hair so fine as to interpret that as participating in a murder but not actually firing the weapon-which is what you\u0027d have to have here.\"\\n\\n \"But you do grant,\" Devray said, \"that there is nothing in Caliban\u0027s absence of Laws that would prevent him from killing Grieg? And that there is nothing in the New Laws that would absolutely force Prospero to prevent the attack?\"\\n\\n \"Yes, but-\"\\n\\n \"So one of them could kill and the other could stand idly by,\" Devray said, his tone a bit badgering.\\n\\n \"In theory, yes,\" Fredda admitted, with massive reluctance. \"But it makes no sense. Grieg was the best friend the New Law robots ever had. What would make them want to kill him?\"\\n\\n \"Plenty,\" Devray said. \"I have an appointment-had an appointment-with the Governor for later this morning. We were going to talk about a proposal I had submitted last week.\"\\n\\n \"What sort of proposal?\" Kresh asked.\\n\\n \"One for the destruction of all New Law robots,\" Devray said.\\n\\n \"What? Have you taken leave of your senses?\" Fredda demanded.\\n\\n \"No, ma\u0027am,\" Devray replied, his voice bland and professional. \"But I\u0027m damned sick and tired of chasing rustbackers. The N. L. s are at the focus of a whole new series of crimes-rustback smuggling, restrictor removal, and the founding of illegal settlements.\"\\n\\n \"Settlements?\" Kresh asked.\\n\\n \"Well, one settlement, anyway,\" Devray said. \"They call it Valhalla. It\u0027s supposed to be somewhere on the far side of the planet from here, somewhere in the Utopia region of Terra Grande. I don\u0027t even know if it exists-but it\u0027s where half the rustbacks we catch seem to be heading. And I\u0027m tired of wasting time and effort chasing rumors. I told the Governor the rustbacks and the New Law robots were more trouble than they were worth, and it was time to admit it and move on.\"\\n\\n \"But they work!\" Fredda protested. \"New Law robots represent half the work force on Purgatory.\"\\n\\n \"And they were supposed to be all of it-except they\u0027re only about a third as productive as Three-Law robots. Every department has been forced to pull in human workers, because the Settlers don\u0027t allow Three-Law robots to have the run of the island. If the New Law robots were worth all the trouble they cause, that\u0027d be one thing,\" Devray said. \"But if anything, they\u0027re slowing down the reterraforming project.\"\\n\\n Kresh was surprised to see Devray that interested in terraforming-and then realized he shouldn\u0027t have been surprised at all. The Rangers only did law enforcement on the side. Terraforming was much more their side of the street.\\n\\n \"Was-was the Governor considering the idea?\" Fredda asked.\\n\\n \"I don\u0027t know,\" Devray said. \"He didn\u0027t reject it out of hand. I know he was also toying with the idea of removing all the range restrictors and letting the New Law robots go.\"\\n\\n \"Why the devil would he do that?\" Kresh asked. \"There wouldn\u0027t be a New Law left on this island if not for the restrictors.\"\\n\\n \"Don\u0027t be too sure of that,\" Fredda said. \"A lot of the New Law robots do cause trouble-but the ones that do work, work plenty hard. A lot of the rustbacks work very hard indeed-once they\u0027re paid a decent wage. And not all of them head for Valhalla, Justen. And just by the way, Valhalla is no rumor. It\u0027s a real place-and there are lots of good reasons for the New Laws to head for it. I\u0027ve seen that with my own eyes.\"\\n\\n \"You seem to know a lot about rustbacks,\" Devray said. \"And have you reported these escaped robots in Valhalla you\u0027ve seen with your own eyes? Or reported Valhalla\u0027s location?\"\\n\\n \"No, I have not reported that information,\" she snapped. \"I don\u0027t know where Valhalla is, and I don\u0027t want to know. But if you want to arrest me for seeing a rustback, go right ahead. I felt responsible for them. Rustbacks are escaped New Law robots, and I invented New Law robots. Of course I\u0027d research them.\"\\n\\n \"Hold it, both of you,\" Kresh said. \"This is not the time. We can go into all this later. Right now the only important thing is that Devray\u0027s recommendation to the Governor could have given Caliban and Prospero a very strong motive if they knew about it. They might have decided to kill him before he killed them.\"\\n\\n \"Caliban isn\u0027t a New Law robot-\"\\n\\n \"Burning hells, I know that better than anyone!\" Kresh snapped. \"But maybe he decided not to take chances on being caught up in a roundup. Or maybe he just acted in sympathy to the plight of his New Law brethren. It\u0027s a possible motive, and the two of them are definite suspects.\"\\n\\n \"But you can\u0027t just decide they did it. Any number of humans might have-\"\\n\\n \"I said they were suspects, not the suspects,\" Kresh said. \"Even if I were convinced they did it-and I\u0027m not-I wouldn\u0027t dare stop investigating other possibilities. Not until the other shoe drops. Suppose it wasn\u0027t the robots? Suppose humans did this job? What was their motive? Have they achieved it with Grieg\u0027s death, or is there more to follow? Is it a coup, or a simple assassination?\"\\n\\n \"A coup? Stars above, I hadn\u0027t even thought of that,\" Fredda said.\\n\\n \"I haven\u0027t thought of much else,\" Kresh said. \"But I\u0027ll tell you this-with every minute that passes, it becomes less likely that it was-is-a coup. If you\u0027re attempting to overthrow a government, you don\u0027t give it time to recover from the first blow before you strike again. Unless something has gone wrong with their plans. Or unless-hellfire, that\u0027s a tough one.\"\\n\\n \"What\u0027s a tough one?\" Fredda demanded.\\n\\n \"Suppose the public announcement of Grieg\u0027s death is the signal for their next move?\"\\n\\n \"Well, there\u0027s some chance of that,\" Devray agreed. \"I doubt the killers expected the body would be discovered so soon-or that you would discover it. They set up the image box to do the comm simulation, after all. \"\\n\\n \"Yes,\" Fredda said. \"Probably the killers weren\u0027t expecting discovery until this morning. \" She looked up at Kresh and shrugged. \"Maybe it was Tierlaw who was supposed to find the body. Unless Tierlaw did it and was planning to pretend to discover the body this morning. Except Donald said his monitors showed that Tierlaw was telling the truth.\"\\n\\n \"Don\u0027t trust Donald\u0027s sensors that far,\" Kresh said. \"A trained man could beat his sensors-or any lie-detector system, short of a Psychic Probe. But Tierlaw could have been set up, a useful idiot. \"\\n\\n \"How the devil can an idiot be useful?\" Fredda asked.\\n\\n \"By being worse than useless to your opposition. Maybe we\u0027re supposed to pay so much attention to Tierlaw that we let the real perpetrators get away. But that\u0027s giving them an awful lot of credit, and assumes an incredibly complex and fragile plot. My guess is that the assassins are completely unaware of Tierlaw\u0027s existence, and he is telling the precise truth: He had nothing to do with it, and he slept through the whole thing. But don\u0027t worry, we\u0027re going to hold him and check him out all the same.\"\\n\\n \"If you\u0027re right,\" Devray said, \"then how was the body supposed to be discovered? The plotters had to have thought about it. What were they expecting?\"\\n\\n \"Well,\" Fredda said, \"all the regular household robots had been ordered to clear off to an outbuilding for the night of the party. There are two deputies interviewing them now, but I doubt they\u0027ll get anything. They would have returned this morning-right about now, I suppose-to resume their normal duties.\"\\n\\n \"So a robot was supposed to discover Grieg was dead,\" Kresh said. \"What would have happened then?\" he asked.\\n\\n Fredda thought for a moment. \"It depends very much on the robot\u0027s preexisting and contingency orders, of course, but most likely, all hell would break loose. It would call for help, attempt resuscitation, call for reinforcements, request a security alert, and who knows what else. \"\\n\\n \"All the proper things to do in terms of the Three Laws, but that would have set off absolute chaos,\" Kresh said. \"If that had happened, every kind of cop within two hundred kilometers would have been over the Residence, banging into each other and the news media and whatever political leaders managed to get involved. The devil only knows what sort of hell that would have stirred up. And all an attempt to revive Grieg would have accomplished would be the muddling of the evidence. Just the sort of chaos and confusion a coup plotter would want. \"\\n\\n \"Maybe,\" Devray said. \"Maybe. There\u0027s a lot of guessing in there, but it might be right.\"\\n\\n \"Sir,\" Donald said, \"if I may interject, there are other vital issues that must be considered before we establish any sort of motive for other hypothetical suspects.\"\\n\\n \"What other issues?\" Kresh asked.\\n\\n \"There is the question of the weapon. \"\\n\\n \"Hell\u0027s bells, the weapon. I am getting old. \"\\n\\n \"What about the weapon?\" Fredda asked.\\n\\n \"There are energy scanners at every entrance to this building,\" said Kresh, \"and perimeter scanners as well. No one should have been able to get an energy weapon into this building without half a dozen alarms going crazy. How did the weapon get in here? How did it get out?\"\\n\\n \"Or did it get out?\" Devray asked. \"Why risk taking it both ways through the scanners? You might set off an alarm on the way out. If I were doing this job, I wouldn\u0027t take chances on smuggling the gun in. The building was unoccupied for damn-all long enough to plant a hundred blasters. r d hide a nice standard blaster with a shielded power pack, do the job, and then abandon the blaster on the premises. \"\\n\\n \"Hmmph. It\u0027s a possibility,\" Kresh said.\\n\\n \"I beg your pardon, Commander Devray, but there is one point that argues against such a possibility,\" Donald said. \"The energy-discharge curve.\"\\n\\n \"What\u0027s that?\" Fredda asked.\\n\\n \"By examining the Governor\u0027s wounds and the blaster damage to the robots, and by establishing range, it was possible to note the relative power of each shot, and thus the weapon\u0027s charge level for each shot. For any given blaster, each shot is less and less intense as the blaster\u0027s charge is expended. For the weapon in question, the intensity of the blaster shots declined precipitously with each firing, clearly indicating an unusually small power cell. The discharge pattern was quite unlike any of the common makes and models of blaster. \"\\n\\n \"And an undersized power cell suggests a weapon intended for concealment, \" Kresh said. \"A custom job. And custom-made weapons can be traced. You\u0027re right, Donald, that needs looking into.\"\\n\\n \"Yes, sir. I think we must also ask ourselves about the assault on Tonya Welton, and the subsequent arrival of the false SSS agents. Was it indeed some sort of diversion linked to the attack? And if so, who was it supposed to divert, and what was it supposed to divert that person from?\"\\n\\n \"Especially as we established almost immediately that it was bogus,\" Kresh said. \"Why stage a diversion that would make us more suspicious?\"\\n\\n \"Maybe because at that point it didn\u0027t matter anymore,\" Devray said. \"Maybe the thing it was supposed to divert attention from wasn\u0027t the Governor\u0027s death at all. And maybe it wasn\u0027t you it was meant to distract.\"\\n\\n \"Huthwitz,\" Kresh said. \"The murder of Emoch Huthwitz. You\u0027re suggesting that it was sheer chance that it happened the same night as Grieg\u0027s murder.\"\\n\\n \"It\u0027s possible. Maybe the Welton attack was meant to divert the Rangers away from the attack on one of their own. \"\\n\\n \"That won\u0027t work,\" Fredda objected. \"From what you\u0027ve told me, this Huthwitz was found hours after he was killed. No one noticed he was missing. And it doesn\u0027t sound like much of anyone in the Rangers responded to the attack on Welton.\"\\n\\n \"All good points,\" Kresh agreed. \"But Huthwitz\u0027s death doesn\u0027t make sense as a coincidence, either.\"\\n\\n \"Coincidences never make sense,\" Fredda said. \"They happen by chance, not logic.\"\\n\\n \"But there\u0027s a point beyond which chance is an awfully weak explanation. In fact, it\u0027s always a weak explanation.\"\\n\\n \"Well, suppose Huthwitz was the diversion?\" asked Fredda. \"While you were out looking at his body, the Governor was being killed. \"\\n\\n \"That doesn\u0027t work, either,\" Kresh said. \"Huthwitz was killed hours before the Governor. Our best estimate was he was killed before the attack on Tonya Welton. As for the discovery of his body as a diversion, he could have been discovered hours later or hours before he was. And the Governor had been dead for about an hour before we found Huthwitz. And besides, we just got through agreeing that the plotters intended Grieg to be discovered some time in the morning, hours from now. \"\\n\\n \"But it was Huthwitz\u0027s death that led you to check on the Governor,\" Leving said.\\n\\n \"But no one could have predicted it would cause me to check, and my discovery of the body didn\u0027t do anyone any good,\" Kresh said. \"Beyond all that, if Huthwitz was killed as a diversion, it didn\u0027t much matter who they killed. But Commander Devray has as much as told me he thinks someone might have had very good reasons to kill Huthwitz, and Huthwitz alone.\"\\n\\n \"So what are you saying?\" Fredda asked.\\n\\n \"I\u0027m saying that the two murders are related-but I haven\u0027t the faintest idea how. Right now Donald is the only one with a theory of the crime. \"\\n\\n \"Sir, I would submit that I have much more than a theory. I have means, motive, and opportunity. I have two suspects.\"\\n\\n \"Donald, you want them to be guilty,\" Fredda said. \"If they killed Grieg, it would confirm all your strongest fears about New Law robots. But I\u0027m no investigator, and I can see all the holes in the case against them. I agree with Sheriff Kresh that it seems extremely unlikely that Grieg\u0027s murder was unrelated to everything else that happened last night. How could Caliban and Prospero have killed Huthwitz-and why would they do it? How and why did they arrange the attack on Tonya and the phony SSS agents that took away her assailants?\"\\n\\n \"I cannot, as yet, answer those questions, Dr. Leving. And despite your objections, they are the only suspects we have.\"\\n\\n \"I agree,\" Kresh said. \"We need to bring them in. But we also need to work on finding ourselves some other suspects as well. We\u0027re going to have to go over the access recorder records. And we need to get hold of all the video imagery shot by all the news outlets. We need to go over it frame by frame, and if we can spot anything or anyone who shouldn\u0027t be there.\"\\n\\n \"I can attend to that, Sheriff,\" Donald said.\\n\\n \"Good. \" Kresh glanced up at the wall clock again. Time was moving. Moving too damned fast. \"I need to draft some sort of statement,\" he said. \"We\u0027ve waited long enough. We\u0027re not going to get things under any more control than they are right now. I have to notify the government, and then the public.\"\\n\\n He stood up, rubbed his face with a tired hand, and ran his thick, stubby fingers through his white hair. \"It\u0027s time to tell the world that Chanto Grieg is dead. \" \\n\\n","sourceLink":"https://allnovel.net/inferno-isaac-asimov-s-caliban-2/page-10.html","bookId":1729,"book":{"id":1729,"title":"Inferno (Isaac Asimov\u0027s Caliban #2)","description":"Storyline: Inferno (Isaac Asimov\u0027s Caliban #2) \\n When a key politician is murdered, suspicion falls on Caliban...the only robot without guilt or conscience, with no need to obey or respect humanity... a robot without the Three Laws.But the stakes go deeper than one man\u0027s life. Caliban is challenging long-held ideas of a robot\u0027s place in society. Will he lead his New Law robots in a rebellion that threatens all of humanity?\\n","cover":"https://allnovel.net/images/inferno-isaac-asimov-s-caliban-2.jpg","author":"Roger MacBride Allen","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/inferno-isaac-asimov-s-caliban-2.html","creation":"Oct 5, 2019 8:57:54 AM","modification":"Oct 5, 2019 10:10:56 AM"}}
