{"id":71896,"no":10,"title":"Page 10","content":"These were Ali’s things, all of them. Didn’t Courtney have any possessions of her own?\n Courtney flopped down on the bed. “What’s on your mind?”\n Spencer sank into the paisley, stuffed chair across the room and straightened the protective arm covers so the patterns matched up. This wasn’t something she could drop on a person without warning—especially someone who’d spent her life battling a mysterious illness. Maybe this was a bad idea. Maybe she should just up and leave. Maybe…\n “Let me guess.” Courtney picked at a loose thread on the duvet. “You want to talk about the affair.” Courtney shrugged. “Your dad. My mom.”\n Spencer gasped. “You know?”\n “I’ve always known.”\n “But…how?” Spencer cried.\n Courtney’s head was down, and Spencer could see her jagged part and perfectly honey-blond roots. “Ali found out. And then she told me on one of her visits.”\n “Ali knew? Billy wasn’t just making that up?” Billy-as-Ian had IM’ed Spencer about the affair right before he’d killed Jenna.\n “And she never told you, right?” Courtney clucked her tongue.\n A sparrow landed on the ledge of Courtney’s window. The room smelled suddenly of new carpet and fresh paint. Spencer blinked hard. “Do Jason and your dad know?”\n “I’m not sure. No one’s ever said anything. But if my sister knew, my brother probably does, too. And my parents pretty much hate each other—which means my dad is probably clued in.” She rolled her eyes. “I swear they only stayed together because Ali went missing. I’ll bet you that a year from now they divorce.”\n Spencer felt a tangerine-size lump in her throat. “I don’t even know where my dad is right now. And my mom just found out about this. She’s really messed up.”\n “I’m sorry.” Courtney looked straight at Spencer.\n Spencer shifted her weight, and the chair squeaked angrily. “Everyone was keeping things from me,” she said quietly. “I have an older sister, Melissa. You may have seen her at the press conference. She was talking to your brother.” She was also the one who glared at you, she wanted to add.\n “Melissa told me she’s known that Ali had a twin since high school,” Spencer continued. “She never bothered to mention it to me. I’m sure she loved knowing something I didn’t. Some sister, huh?” She let out a loud, clumsy sniff.\n Courtney rose, plucked a Kleenex box off the bedside table, and plopped down at Spencer’s feet. “She sounds really competitive and insecure,” she said. “That’s how Ali was with me, too. She always wanted the limelight. She hated if I was better at anything. I know she was pretty competitive with you, too.”\n That was an understatement. Spencer and Ali used to compete over everything—who could bike to Wawa the fastest, who could kiss the most older guys, or who could make JV field hockey in seventh grade. There were lots of times Spencer didn’t want to race, but Ali always insisted. Was it because Ali knew they were also sisters? Was she trying to prove something?\n Salty tears spilled down Spencer’s cheeks, and sobs rose in her chest. She wasn’t even sure what she was crying about. All the lies, maybe. All the hurt. All the deaths.\n Courtney pulled her in and hugged her tight. She smelled like cinnamon gum and Mane ‘n Tail shampoo. “Who cares what our sisters knew?” she murmured. “The past is the past. We have each other now—right?”\n “Uh-huh,” Spencer murmured, still choking on sobs.\n Courtney pulled away, her face brightening. “Hey! Want to go dancing tomorrow?”\n “Dancing?” Spencer wiped her puffy eyes. Tomorrow was a school night. She had an AP history test at the end of the week. She hadn’t seen Andrew in days, and she still needed to get a dress for the Valentine’s Day dance. “I don’t know….”\n Courtney grabbed her hands. “C’mon. It’ll be our chance to break free of our evil sisters! It’s like that ‘Survivor’ song!” And then she leaned back and launched into the old Destiny’s Child song. “‘I’m a sur-vi-vor!’” she sang as she waved her hands over her head, stuck out her butt, and wheeled around crazily. “Come on, Spencer! Say you’ll go dancing with me!”\n Despite all her grief and confusion, Spencer burst out laughing. Maybe Courtney was right—maybe the best thing to do amidst all this craziness was kick back, let go, and have a good time. This was what she’d wanted, after all—a sister she could confide in, rely on, and have fun with. Courtney seemed to want the same exact thing.\n “Okay,” Spencer said. And at that, she let out a big breath of air, stood up, and sang along with her sister.\n 10\n A TICKET TO POPULARITY\n A few hours later, Hanna maneuvered her Prius up the winding driveway, turned off the engine, and grabbed two shopping bags from Otter from the passenger seat. She’d made an emergency, I-feel-sorry-for-myself trip to the King James Mall after school today, though it wasn’t much fun shopping without a BFF or Mike. She didn’t trust her judgment anymore, either, and she wasn’t sure if the ultra-skinny Gucci leather pants she’d purchased were disco-fabulous or just plain slutty. Sasha, Hanna’s favorite salesgirl, had said Hanna looked great in them…but then again, she got commission on the sale.\n It was pitch-black outside, and a thin crust of frost had formed over the front yard. She heard a giggle. Her heart started to hammer. Hanna paused in the driveway. “Hello?” she called. The word seemed to freeze right in front of her face before shattering into thousands of shards on the driveway. Hanna looked right and left, but it was too dark to see anything.\n There was another giggle, and then a full-throated laugh. Hanna exhaled with relief. It was coming from inside the house. Hanna crept up the front walk and slipped quietly into the foyer. Three pairs of boots sat by the front door. The emerald Loeffler Randalls were Riley’s—she had a thing for green. Hanna had been with Naomi when she bought the spike-heeled booties lying next to them. Hanna didn’t recognize the third pair at all, but when she heard another peal of giggles from upstairs, one girl’s laugh stood out from the rest. Hanna had heard an identical version of that laugh many times, sometimes at her expense. It was Courtney. And she was in Hanna’s house.\n Hanna tiptoed up the stairs. The hallway smelled of rum and coconut. An old Madonna remix blared from Kate’s closed bedroom door. Hanna approached and pressed her ear to the wall. She heard whispering.\n “I think I saw her car pull into the driveway!” Naomi hissed.\n “We should hide!” Riley cried.\n “She’d better not try and hang out with us,” Kate scoffed. “Right, Courtney?”\n “Um,” Courtney said, not really sounding certain at all.\n Hanna padded to her bedroom and resisted the urge to slam the door behind her. Dot, her miniature Doberman, rose from her doggie bed and danced around her feet, but she was so angry that she barely noticed her. She should’ve seen this coming. Courtney had become Naomi, Kate, and Riley’s pet project, probably because she was the new media darling. All day, they’d prowled the Rosewood Day hallways in an intimidating four-girl line, flirting with the cutest boys and rolling their eyes at Hanna whenever she crossed their path. By eighth period, students were no longer looking at Courtney with uneasiness but respect and admiration. Four guys had asked her to the Valentine’s Day dance. Scarlet Rivers, a finalist in the fashion design department’s Project Runway contest, wanted to design a dress with Courtney as her muse. Not that Hanna was stalking Courtney or anything. It had all been on Courtney’s brand-new Facebook page, which had already amassed 10,200 new friends from around the world.\n There was a chime, and Hanna’s iPhone lit up inside her bag. She pulled it out. One new e-mail, said the screen. The note was from her mom. Hanna rarely heard from her—Ms. Marin ran the Singapore division of McManus \u0026 Tate, an ad agency, and she was more in love with her career than her only daughter. Hey, Han, it began. I’ve been offered six tickets to the Diane von Furstenberg fashion show in NYC Thursday, but I obviously can’t use them. Would you like to go instead? I’ve attached them via PDF.\n Hanna read the message a few times over, her fingers twitching. Six tickets!\n She stood up, checked her reflection in the mirror, and whipped out into the hall. When Hanna pounded on Kate’s door, the giggles instantly ceased. After some heated whispers, Kate flung open the door. Naomi, Riley, and Courtney were sitting on the floor by Kate’s bed, dressed in jeans and oversize cashmere sweaters. Bottles of foundation and trays of eye shadow were strewn across the carpet, and there was the usual array of Vogues, old Rosewood Day yearbooks, and smartphones jumbled at their feet. Four small tumblers and a bottle of Gosling’s rum sat between them. Mr. Marin had brought the rum back from a recent business trip to Bermuda. Even if Hanna ratted Kate out for swiping it, her dad would probably somehow figure out a way to blame Hanna instead.\n Riley’s forehead wrinkled. “What do you want, Psycho?”\n “Would you mind keeping it down?” Hanna cooed sweetly. “I need to make a phone call about some fashion week tickets I got from my mom, and I can hear your voices all the way down the hall.”\n It took a few seconds for the news to sink in. “What?” Kate squeaked, curling her lip.\n Naomi tossed her head. “Fashion week? Right.”\n “Just turn the music down for a few,” Hanna said. “I don’t want Diane von Furstenberg’s people to think I’m a silly high school girl.” She waggled her fingers and ducked out the door. “Thanks much!”\n “Wait.” Kate grabbed Hanna’s arm. “The Diane von Furstenberg?”\n “You have to be someone to have tickets to that,” Riley snapped, her nostrils flaring. She had the tiniest beginning of a booger up her nose. “They don’t let psychos in.”\n “My mom got six tickets,” Hanna said nonchalantly, swiveling on her heel. “She gets stuff like that through her job all the time. But since she’s in Singapore, she gave them to me.”\n She whipped out her iPhone, opened the PDF, and shoved it in Kate’s face. Everyone else sprang up and squinted at the screen. Naomi licked her lips hungrily. Riley shot Hanna her version of a genuine smile, which looked more like a grimace. Courtney lingered in the background, her hands in the back pockets of her jeans. The other girls turned to her in deference, as if she were Anna Wintour and they were Assistants One through Three.\n “Sweet,” Courtney declared in a voice identical to Ali’s.\n Naomi clapped her palms together. “You’re obviously bringing your besties, right?”\n “Of course she’s taking us,” Riley said, linking her arm with Hanna’s.\n “Yeah, Hanna, you know that Psycho stuff was a joke, right?” Kate simpered. “And you should totally hang out with us tonight. We were going to ask you, but we didn’t know where you were.” \n","sourceLink":"https://allnovel.net/wanted-pretty-little-liars-8/page-10.html","bookId":2385,"book":{"id":2385,"title":"Wanted (Pretty Little Liars #8)","description":"Storyline: \n Wanted (Pretty Little Liars #8) \n In Rosewood, majestic estates sprawl for acres, and Tiffany toggle bracelets dangle from every girl\u0027s wrist. But not all that glitters is gold, and the town harbors secrets darker than anyone could imagine—like the truth about what really happened the night Alison DiLaurentis went missing. . . . \n Back in middle school, Ali plucked Emily, Hanna, Aria, and Spencer from obscurity and turned them into the beautiful, popular girls everyone wanted to be. Ali was the best friend they ever had. But she also made them do terrible things and taunted them with their worst secrets. Now, three years later, all their questions about Ali have finally been answered and they can put this awful chapter of their lives behind them. Or so they think. \n Not every story has a happy ending, especially when four pretty little liars have done so many wicked things. In the dramatic conclusion of Sara Shepard\u0027s bestselling Pretty Little Liars series, Emily, Hanna, Aria, and Spencer could get everything they\u0027ve ever wanted—unless A has one more horrifying twist in store.\n \n","cover":"https://allnovel.net/images/wanted-pretty-little-liars-8.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/wanted-pretty-little-liars-8.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:21:41 AM"}}
