{"id":71902,"no":16,"title":"Page 16","content":"But never at night. Aria’s heart started to pound as she remembered Melissa lurking outside Courtney’s house yesterday. An eerie feeling crept into her bones. Aria pulled on a sweatshirt, rammed her feet into her Uggs, and went outside.\\n\\n The night was frigid and still. A fat, bloated moon hung in the sky. The houses loomed huge and imposing, and most people’s porch lights were already off for the night. The air still had a faint odor of charred earth to it from the fire, and Aria could make out jagged tree stumps in the woods. She spied the reflective tape on Melissa’s sneakers at the end of the street and started to run, following her at a safe distance.\\n\\n Melissa passed the big Dutch Colonial whose owners rotated colorful porch flags with the seasons, the massive stone farmhouse with the man-made pond in the backyard, and then the big Victorian with the memorial at the curb. We’ll miss you, Ian, someone had spelled out with marigolds. Now that everyone presumed that Ian was innocent—and dead—the town had set up a series of wreaths, lacrosse sticks, and old Rosewood Day soccer jerseys on the Thomases’ muddy lawn in his memory.\\n\\n Melissa circled the cul-de-sac and disappeared down a path toward the woods. Aria stealthily followed, growing nervous. Technically, people weren’t allowed back here—the cops were still hunting for Ian’s body.\\n\\n Taking a deep breath, Aria pushed through the brambles to follow her. Twigs snapped and crackled. The air was thick with putrid smoke. Melissa’s bobbing sneakers disappeared up a steep rise. Aria’s lungs filled and emptied, rushing to keep up. She was so far into the woods now that she could barely see the lights from the houses. The only thing she could make out was Spencer’s family’s dilapidated barn, way off through the trees.\\n\\n A pair of eyes blinked at her from a high tree branch. Something scuttled on the forest floor. Aria gasped but kept going. She staggered up the hill on all fours, panting hard. But when she reached the top, she didn’t see Melissa anywhere. It was as if she had evaporated into thin air.\\n\\n “Aria?”\\n\\n Aria screamed and whirled around. A face swam into view. First Aria saw her heart-shaped jaw, then her glistening blue eyes, and then her bloodred Cheshire cat smile.\\n\\n “C-Courtney?” she stammered.\\n\\n “I didn’t realize anyone else knew about this place,” Courtney said, tucking a stray lock of blond hair under her maroon wool hat.\\n\\n Aria ran her hands over her bumpy ponytail. Her heart thrummed in her ears. “D-did you see Spencer’s sister? Melissa? I followed her here.”\\n\\n Courtney shook her head, looking confused. “It’s just me and the moon.”\\n\\n Aria shivered, her lungs burning from the cold. She wanted out of here, now, but her limbs wouldn’t move. “W-what are you doing here?”\\n\\n “Just checking out an old haunt,” Courtney said. She leaned against a crumbling structure Aria had never seen before. It looked like a round brick base, overgrown with moss. Half of an A-shaped post still existed, the wood brittle and rotted. A rusty metal bucket lay in the grass nearby.\\n\\n Aria put her hand to her mouth, slowly filling in the missing pieces. It was a wishing well. Just like the one Ali had drawn on her Time Capsule flag. Her limbs began to shake.\\n\\n “I used to come here to think.” Courtney perched on the edge of the stone, letting her feet dangle into the well. “It was the only place that was just mine. It’s why I drew it on my Time Capsule flag.”\\n\\n Aria’s mouth dropped open. Her Time Capsule flag? “Excuse me?”\\n\\n An owl hooted. A cloud shaped like a hand floated over the moon. Courtney threw a clump of frozen moss down the well. Aria didn’t hear it hit the bottom. “I know Jason gave you the flag.” She turned to look at Aria. “I’m glad you had it.”\\n\\n Aria blinked fast. “W-what the hell is going on?”\\n\\n Courtney raised her hands in surrender. “Don’t freak out.” Her voice made a little puff of smoke in the air. “But I’m not Courtney. I’m Ali.”\\n\\n Aria’s knees buckled. She scrambled backward, slipping on some wet leaves.\\n\\n “Please don’t run away,” Courtney pleaded. The moon illuminated the whites of her eyes and her ultra-bleached teeth, like a human jack-o’-lantern. “Just let me explain.”\\n\\n Aria didn’t move as Courtney—or whoever she was—quickly summarized the truth about her sister, the murder, and the switch. “Hanna, Spencer, and Emily all know already,” she concluded. “I knew you’d be the hardest to tell. All that stuff with your dad…” She jumped off the well and approached Aria. She tentatively put a cashmere-gloved hand on Aria’s shoulder. “I was awful to you. But I’ve changed. I want us to be friends again, just like we used to be when we first got together in sixth grade. Remember how awesome it was?”\\n\\n Aria’s lips felt paralyzed. Was this Ali standing in front of her? It could be possible. Something had been so strange about Courtney from the beginning—she’d known more about Aria and Rosewood than she should have.\\n\\n Ali stood there, her eyes wide, pleading. “Just think about it, okay? Try to see things from my perspective.”\\n\\n Aria felt a longing twinge, wanting things to be the way they once were back when they’d first become friends. Things had been awesome for a while: They’d taken tons of trips to the Poconos, spent hours at one another’s houses, made silly movies with Aria’s video camera. For once, Aria hadn’t been a kooky loner but part of a group.\\n\\n And then Ali pivoted and walked away. Her footsteps crunched loudly for a few moments before fading into the distance.\\n\\n Aria started back down the hill toward her house. I want us to be friends again. Just think about it, okay? Part of her wanted to tell Ali that bygones were bygones. She wanted a best friend again. But something was holding her back. Could Aria really believe that Ali was sorry for everything she’d done and had changed her ways? She’d been back for only a few days, and she already was telling lies again, pretending she’d never been to Rosewood Day or seen Noel Kahn’s house before. She’d put on a pretty convincing act, blubbering about how devastated she was about her father’s affair. Was it really just to get Aria to open up about her own family dysfunction all over again?\\n\\n Aria breathed out, the smell of rust and something vaguely pondlike filling her nostrils. Then she noticed something white at her feet and stopped. Something was buried deep in the dirt in the side of the hill.\\n\\n After a moment’s hesitation, Aria crouched down and pulled at it. Chunks of soil and dead leaves cascaded to the ground as she wrenched it free. It was a tattered envelope. Had the backhoes dredged it up when removing some of the old tree stumps?\\n\\n She tore the envelope open and plunged her hand inside. Her fingers touched something with hard, square edges. Taking a deep breath, she pulled out two blurry Polaroids. Aria furrowed her brow, her hands mottled purple from the cold. The first was a photo of four girls sitting in a circle on a round rug, their heads down. Candles flickered around them. A fifth girl with long blond hair and a heart-shaped face stood, her arms in the air, her eyes closed.\\n\\n Aria’s heart started to pound. This looked like one of the Polaroids Billy had taken of their end-of-seventh-grade sleepover.\\n\\n She examined the second Polaroid. The flash had made a hot yellow circle at the top of the frame. Aria felt wobbly on her feet, and her teeth chattered. Somehow, maybe because of the angle of the camera or the refractive light from the flash, this picture showed not what was happening inside…but outside. There was a ghostly reflection in the window showing a pair of hands and a shadowy, ghoulish face. Whoever it was had blond hair like Billy’s, but the features were softer, more feminine. The image was blurry, but the person’s nose was small and straight, and the eyes were round and rimmed with dark lashes.\\n\\n Aria could barely breathe. She stared at the reflection until her eyes burned. As much as she wanted to believe that the person in the window looked like Billy, she knew it wasn’t true.\\n\\n Which meant that someone else had been watching them that night.\\n\\n 16\\n\\n IF NOT NOW, EM, WHEN?\\n\\n The following morning, Emily and her sister Carolyn walked into the Rosewood Diner. Their grueling swimming practice had ended a little early, which meant they actually had time to eat a real meal before school.\\n\\n The diner’s owners left their Christmas lights up all year long, which made the room feel cozy and festive. The kitchen smelled of pancakes, syrup, sausages, and coffee. A couple of discarded newspapers lay on the counter. Photo in Window Isn’t of Ford read one of the headlines. Beneath it was a scan of the blurry Polaroid Aria had told Emily about. She’d called late last night, explaining that she’d found two photos in the woods. She’d dropped off the photos anonymously, not wanting to draw any more attention to herself.\\n\\n Emily stared hard at the fuzzy image. The face was overexposed from the flash, making it look like an apparition. The person had blond hair like Billy’s, but the shapes of the person’s jaw, eyes, and nose were completely different. The space behind Emily’s eyes started to throb. Why did Billy have those Polaroids if he wasn’t the one who’d taken the pictures? Did he have an accomplice that night? Or had someone planted them in his car?\\n\\n Emily followed Carolyn into the big red booth. Her cell phone beeped from inside her swim bag. One new text. It was from Courtney DiLaurentis. Ali.\\n\\n Can’t wait to see you in gym 2day. XX\\n\\n Emily’s heart flipped. Can’t wait to see you too, she texted back, watching the little envelope spin until the text was sent.\\n\\n She could still taste Ali’s minty breath and feel her soft, full lips on hers. She could still see Ali dancing seductively at that club on Wednesday night, the spotlight shining on the crown of her golden head.\\n\\n Carolyn leaned over and glanced at Emily’s cell phone screen. Her eyes widened. “Are you and Courtney friends?”\\n\\n “She seems nice,” Emily said, trying not to give anything away.\\n\\n Carolyn folded the menu and slid it to the edge of the table. “It’s so weird that Ali had a twin. Did you ever suspect?”\\n\\n Emily shrugged. In hindsight, it all fit together. She should’ve guessed something weird was going on the day before the seventh-grade sleepover. When Ali had met the girls on the porch, she’d had no memory of talking to them in her room just moments before. Then later that same afternoon, Emily had excused herself to use the DiLaurentises’ bathroom. Inside, she’d heard Jason whispering angrily to someone on the stairs. “You’d better stop it,” he warned. “You know how that pisses them off.”\\n\\n “I’m not hurting anyone,” another voice had protested. It sounded a lot like Ali, but it had clearly been Courtney. Jason was probably scolding her for impersonating her sister—again.\\n\\n She tried to drown me, Ali had said. She wanted to kill me to be me. Emily shuddered.\\n\\n But what about the other time Courtney had been home, when she’d switched from the Radley to the Preserve? Ali had said it was early in sixth grade. Could it have been the same Saturday that Emily, Spencer, and the others had sneaked into Ali’s yard, hoping to steal her Time Capsule flag? Emily remembered hearing an argument from inside the DiLaurentises’ house—Ali had screamed “Stop it!” and then someone had yelled “Stop it!” back in the same high-pitched voice. She’d figured it was Jason, but it also could have been Courtney. \\n\\n","sourceLink":"https://allnovel.net/wanted-pretty-little-liars-8/page-16.html","bookId":2385,"book":{"id":2385,"title":"Wanted (Pretty Little Liars #8)","description":"Storyline: Wanted (Pretty Little Liars #8) \\n In Rosewood, majestic estates sprawl for acres, and Tiffany toggle bracelets dangle from every girl\u0027s wrist. But not all that glitters is gold, and the town harbors secrets darker than anyone could imagine—like the truth about what really happened the night Alison DiLaurentis went missing. . . . \\n Back in middle school, Ali plucked Emily, Hanna, Aria, and Spencer from obscurity and turned them into the beautiful, popular girls everyone wanted to be. Ali was the best friend they ever had. But she also made them do terrible things and taunted them with their worst secrets. Now, three years later, all their questions about Ali have finally been answered and they can put this awful chapter of their lives behind them. Or so they think. \\n Not every story has a happy ending, especially when four pretty little liars have done so many wicked things. In the dramatic conclusion of Sara Shepard\u0027s bestselling Pretty Little Liars series, Emily, Hanna, Aria, and Spencer could get everything they\u0027ve ever wanted—unless A has one more horrifying twist in store.\\n","cover":"https://allnovel.net/images/wanted-pretty-little-liars-8.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/wanted-pretty-little-liars-8.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:21:41 AM"}}
