{"id":71905,"no":19,"title":"Page 19","content":"Five more seconds passed, and the traffic light was still red. Sighing, she got out of the car, strode up the walk, and rang the bell. There were footsteps, and then the door swung open. Jason DiLaurentis stood on the other side, his blond hair combed flat against his head and his face unshaven, wearing ratty jeans and a Penn T-shirt. When he saw it was Emily, his eyebrows knitted together. The last time Emily had seen Jason, he’d chewed her out for allegedly denting his car. The heated look on his face made her think he hadn’t forgotten.\\n\\n “Hey,” Emily said, trembling slightly. “I’m here to see…Courtney.” She caught herself just before she said Ali.\\n\\n “Uh, sure.” Jason yelled Courtney’s name up the stairs, then turned back and gave Emily a long, unapologetic look. Emily’s cheeks burned. She fiddled anxiously with a wooden dog statue that was sitting on the console table just for something to do with her hands.\\n\\n “So you and Courtney are friends now?” Jason asked finally. “Just like that?”\\n\\n “Yeah.” So? she wanted to add.\\n\\n “Hey!” Ali bounded down the stairs. Her blond hair was in a ponytail, and she was wearing a sky blue T-shirt, a color she’d always worn back in seventh grade because it drew out her eyes. “What a nice surprise!”\\n\\n Emily turned back to Jason, but he’d disappeared. “Hi,” she answered, feeling dizzy.\\n\\n “Let’s go to the den,” Ali suggested, whirling around and disappearing into a room off the hall. The room was big, square, and dark, and smelled like a woodstove. A flat-screen TV was shoved against the corner, heavy velvet curtains were pulled across the windows, and a striped candy dish full of pink M\u0026M’s sat in the middle of the coffee table. A bunch of photos lay on the floor, propped up against the chairs and bookcases.\\n\\n Emily leaned down to look at the photo on top of the pile. It was a picture of the DiLaurentis parents and children—only two children, not three. Ali was in seventh grade, her face slightly rounder, her hair a little lighter. Jason stood next to her, his mouth smiling but his eyes serious. The DiLaurentis parents rested their hands on their kids’ shoulders, grinning proudly as if they had nothing to hide.\\n\\n She stared again at Jason’s image, still shaky from their interaction in the hall. “Are you sure your brother doesn’t know who you really are?” she whispered.\\n\\n Ali slumped down on the couch and shook her head vehemently. “No.” She shot Emily a warning look. “And please don’t tell him. My family has to believe I’m Courtney. It’s the only way they’ll think I’m better.”\\n\\n Emily leaned back, the leather making a squeaky noise under her legs. “I promise.”\\n\\n Then she reached out and touched Ali’s hand. It was cold and a little clammy. “I missed you today. There was something I wanted to ask you.”\\n\\n Ali stared at Emily’s hand on hers. Her lips parted slightly. “What?”\\n\\n Emily’s heart thumped. “Well, there’s a school Valentine’s Day dance tomorrow.”\\n\\n Ali moved her jaw. Her bottom teeth stuck out slightly.\\n\\n “Anyway, I was wondering if you’d…” Emily paused, the words catching in her throat. “If you’d want to go with me. Like as a date. We could double with my sister and her boyfriend. It’ll be really fun.”\\n\\n Ali pulled her hand away. “Em…” she started. The corners of her lips shook, as if she was suppressing a laugh.\\n\\n Emily’s stomach plummeted. All at once, she was transported to Ali’s tree house, moments after she’d leaned over and kissed Ali’s lips. Ali kissed back for a delicious few moments before she’d pulled away. “Now I know why you get so quiet when we change during gym class,” she’d teased.\\n\\n Emily jumped up, bumping into the corner of an enormous marble chessboard on the coffee table. The white queen wobbled, then tipped over. “I have to go.”\\n\\n Ali’s face fell. “What? Why?”\\n\\n Emily fumbled for her jacket over the back of the chair. “I just remembered. I have homework.”\\n\\n Ali’s eyes were round and troubled. “I don’t want you to leave.”\\n\\n Emily’s chin wobbled. Don’t cry, she told herself.\\n\\n “I meant what I said the other day about how I feel about you.” Ali grabbed Emily’s hand. Outside, the neighbor’s porch light flickered on. “But I have to get my life together first, okay?”\\n\\n Emily searched for the car keys in her coat pocket. It was probably an excuse. Ali would be making fun of her for it by tomorrow. Emily shouldn’t have trusted her so quickly. She clearly hadn’t changed that much.\\n\\n “I’m not going to ditch you,” Ali promised, like she could tell what was galloping through Emily’s mind. “The most important thing is that we’re friends again. We can still hang out at the dance. And I want all of us to get ready together.”\\n\\n “All of us?” Emily blinked.\\n\\n “You, me, Spencer, Hanna…” Ali looked hopeful. “Maybe even Aria? I was thinking that we could go to my family’s Poconos house afterward.” She squeezed Emily’s hands. “I want us all to be back together again, like things used to be.”\\n\\n Emily sniffed, but she put her keys away.\\n\\n Ali patted the cushion beside her. “Please stay. We need to talk about the dance, now that I know you’re going. I bet you haven’t even picked out a dress yet.”\\n\\n “Well, no. I was thinking of wearing something of my sister’s.”\\n\\n Ali punched her playfully. “Just like old times.”\\n\\n Emily sat back down. It felt like her emotions had been on a high-spin cycle, but as Ali opened a copy of Teen Vogue and pointed out a series of party dresses that would complement Emily’s peaches-and-cream complexion, her mood began to thaw. Perhaps she was losing sight of things. Ali had returned—everything else would come in time.\\n\\n Ali was reaching for Seventeen when Emily heard footsteps in the hall. Jason stood at the foot of the stairs, glaring into the den. His forehead was wrinkled, the corners of his mouth turned sharply down, and he was gripping the banister so tightly that his knuckles were white.\\n\\n Emily’s mouth dropped open. But just as she was about to nudge Ali, Jason stormed out of the house, slamming the door behind him.\\n\\n 20\\n\\n IT’S ALL ABOUT LETTING GO\\n\\n Early Saturday afternoon, Aria climbed out of the Subaru, locked up, and started across the mall parking lot. Mike walked alongside her, the hood on his jacket pulled tight around his head. Aria had volunteered to escort Mike to the optician in the King James Mall to pick up a spare pair of contacts—he was constantly ripping them, but wouldn’t dare wear his glasses. Lately, Meredith had been maniacally humming songs from Cinderella while decorating the baby’s room—in neutral yellows, as Meredith and Byron didn’t want to know the sex until the baby was born—and Aria was desperate for an excuse to get out of the house.\\n\\n Aria’s phone started to bleat. She pulled it out of her pocket and looked at the screen. Wilden. A dart of fear streaked through her stomach. Why was he calling her? Could he know she’d been the one who’d sent the police that extra photo she’d found in the woods? She hit silent and dropped the phone into her pocket again, her heart thudding hard.\\n\\n She knew she’d done the right thing by giving the photos to the Rosewood PD anonymously. It was an act of self-preservation—Aria didn’t want to be at the center of this case anymore. She’d considered telling the cops about seeing Melissa running into the woods, but what if it all was a big coincidence? And she definitely didn’t want to tell the police about seeing Courtney—Ali—at the wishing well…or what they talked about.\\n\\n “So are you going to the dance tonight?” Aria asked Mike as they trudged to the Saks entrance of the mall.\\n\\n Mike glanced at her out of the corner of his eye. “What do you think?”\\n\\n Aria skirted around a huge SUV whose back end was sticking way out of its parking space. “Uh…yes?” Mike had attended every single Rosewood Day event since they’d returned to Rosewood.\\n\\n Mike stopped and placed his hands on his hips. A puff of air streamed out of his nostrils. “You mean you haven’t heard?” he asked incredulously.\\n\\n Aria blinked.\\n\\n Mike sighed. “Skidmarks?” He slapped his palms to his sides. “Skidz?”\\n\\n Aria ran her tongue over her teeth. Come to think of it, she had heard that Mike had a new nickname. But she’d figured it was a weird lacrosse ritual.\\n\\n “Someone planted skidmarked underwear in my locker,” Mike moaned, shoving his hands in his jacket pockets and slouching toward the mall’s double doors. “They took a photo and texted it to everyone. It’s so lame. I don’t even wear D and G boxer-briefs.”\\n\\n “Do you know who did it?” Aria asked.\\n\\n “Someone who hates me, I guess.”\\n\\n The hair on Aria’s neck rose. It sounded like something A would do. She looked around the parking lot, but it was mostly filled with bedraggled mothers and baby carriages. No one was watching.\\n\\n “And now everyone’s dissing me. They even tried to make me turn in my lacrosse bracelet,” Mike went on.\\n\\n “Did you?” Aria asked, stepping up on the curb.\\n\\n “No.” Mike sounded sheepish. “Noel rallied for me.”\\n\\n Aria felt a little rush of pleasure. “That’s nice.”\\n\\n “But I might as well go back to Iceland and join an elf-spotting commune,” Mike whined.\\n\\n Aria snorted and held the door for him. A whoosh of hot air blew her hair back. “It’s just a stupid nickname. It will blow over.”\\n\\n Mike sniffed. “Doubt it.”\\n\\n As they walked through the big double doors into Saks, Aria noticed a table off to the left with two small shrines on it: one for Ali, one for Jenna. Memorials like this had popped up in all kinds of places in Rosewood—the local Wawa, a gourmet cheese store on Lancaster Avenue, and the Mighty Quill, a tiny bookshop near Hollis College that Aria and Ali used to visit and covertly read the books about sex. Aria paused, a photo of Jenna catching her eye. It was the same photo A had sent Emily of Jenna, Ali, and a hidden blond girl they now knew was Courtney. Aria snatched the silver frame and turned it over. How long had this been here? Was this how Billy—or whoever A was—had gotten the photo?\\n\\n “Shit,” Mike whispered sharply, tugging Aria’s arm. “Let’s go this way.” He pivoted to the right and led her toward housewares.\\n\\n “W-why?” Aria asked.\\n\\n Mike shot her another nasty look. “Duh. I want to avoid Hanna. We broke up.”\\n\\n “Hanna’s here?” Aria squeaked, turning her head. And just then, as she peered over her shoulder, she saw Hanna, Spencer, Emily, and Ali standing at the Dior makeup counter. Emily made kissy-faces at the mirror, her cheeks shiny and bright. Spencer leaned over the counter and pointed out a foundation to the salesgirl. Hanna and Ali seemed deep in discussion about shades of eye shadow. They stood in that way that only best friends would. If Aria squinted, Spencer, Hanna, Emily, and Ali could be in seventh grade again. There was just one thing missing: Aria herself. \\n\\n","sourceLink":"https://allnovel.net/wanted-pretty-little-liars-8/page-19.html","bookId":2385,"book":{"id":2385,"title":"Wanted (Pretty Little Liars #8)","description":"Storyline: Wanted (Pretty Little Liars #8) \\n In Rosewood, majestic estates sprawl for acres, and Tiffany toggle bracelets dangle from every girl\u0027s wrist. But not all that glitters is gold, and the town harbors secrets darker than anyone could imagine—like the truth about what really happened the night Alison DiLaurentis went missing. . . . \\n Back in middle school, Ali plucked Emily, Hanna, Aria, and Spencer from obscurity and turned them into the beautiful, popular girls everyone wanted to be. Ali was the best friend they ever had. But she also made them do terrible things and taunted them with their worst secrets. Now, three years later, all their questions about Ali have finally been answered and they can put this awful chapter of their lives behind them. Or so they think. \\n Not every story has a happy ending, especially when four pretty little liars have done so many wicked things. In the dramatic conclusion of Sara Shepard\u0027s bestselling Pretty Little Liars series, Emily, Hanna, Aria, and Spencer could get everything they\u0027ve ever wanted—unless A has one more horrifying twist in store.\\n","cover":"https://allnovel.net/images/wanted-pretty-little-liars-8.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/wanted-pretty-little-liars-8.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:21:41 AM"}}
