{"id":16819,"no":2,"title":"CHAPTER II. OUT OF WORK.","content":"On Saturday Rupert received his last week\u0027s wages at the store. \"I am awfully sorry you are going, Rupert,\" said Harry Bacon. \"It is a shame you are discharged.\" \"No, it is not a shame. It is only because business is dull that I have to go. I can\u0027t blame the firm.\" Rupert ascended the stairway at his humble home in Elizabeth Street with a slow step. He felt that he could no longer conceal his discharge from his mother, and he knew what a blow it would be to her. So as he handed the money to Mrs. Rollins he said: \"I have bad news for you, mother. I am discharged.\" \"Discharged!\" repeated his mother, in dismay. \"Why? What have you done?\" [Pg 12] \"There is no dissatisfaction with me. I am discharged because times are dull, and business has fallen off.\" \"I am glad at least that no fault is found with you, but what shall we do? Your salary was all we had to depend upon except the little I make by sewing.\" \"Don\u0027t be discouraged, mother. I shall start to find a place Monday morning. I am allowed to refer to the old firm.\" \"But—do you think there is any chance to get in elsewhere? Won\u0027t other firms be affected by the dull times?\" This was precisely what troubled Rupert, but he answered his mother cheerfully. \"To-morrow is Sunday,\" he said. \"Don\u0027t let us think of the future till Monday morning. I am sure something will turn up. At the worst, I can earn something by selling papers.\" When Monday morning came Rupert started out on his quest. He had been sent on errands to several houses in the same line, and he resolved to go from one to another in the hope of finding a vacancy. [Pg 13] At the first he was pleasantly received. He was recognized as coming from Tenney \u0026 Rhodes, and it was supposed he came on an errand from them. When he asked for a place the superintendent looked distrustful. \"Why do you leave Tenney \u0026 Rhodes?\" he was asked. \"Because the times are dull, and they are parting with some of their clerks.\" \"Will they recommend you?\" \"Yes. Here is a recommendation,\" and Rupert took a folded paper from the envelope in which he had placed it. \"That is satisfactory,\" said the superintendent, his face clearing, \"but the same dullness which has reduced their business affects ours. So far from taking on new clerks, we may have to discharge some of those at present in our employ.\" Of course there was no more to be said. Rupert visited five other firms, but in each case the answer was the same. They had no vacancy, and did not expect to have any. It was one o\u0027clock, time for lunch, but Rupert did not feel hungry. His anxiety had[Pg 14] taken away his appetite. He rested for an hour on one of the benches in City Hall Park, and then started out again. He resolved now to apply for a position of any kind, since there seemed to be no opening in the business to which he had been trained. But he met with no better success. Everywhere there were complaints of hard times. \"You are doing better than I am, my boy,\" said one business man bluntly. Rupert looked about the large store in which he was standing, and said: \"I don\u0027t see how that can be, sir, I am making nothing.\" \"And I am making less than nothing. Last month I fell behind five hundred dollars.\" \"I am sorry to hear it, sir,\" said Rupert, in a tone of sympathy. The merchant looked at him approvingly. \"You appear to be a good boy,\" he said. \"I wish I had a place for you. I can send you on an errand, if that will be any object to you.\" \"Anything, sir, will be welcome.\" [Pg 15] \"Then you may take a note from me to a firm in Astor Place. Wait five minutes and it will be ready.\" Rupert took a seat, and in five minutes the merchant reappeared with a sealed note. \"This is the note,\" he said, \"and here is a quarter for taking it.\" \"Thank you, sir.\" The sum was not large, but Rupert was pleased to think that he would earn something. \"Well,\" said his mother, when at five o\u0027clock he entered the room. \"Have you found a place?\" \"No, mother, places seem to be scarce. Still, I have earned something.\" She looked at him inquiringly. \"It isn\u0027t much—only twenty-five cents. I received it for going on an errand.\" \"It is better than nothing.\" \"Yes, it will buy our supper.\" Two days more passed. They were equally barren of results. It was nearing the end of the week, and except the silver quarter Rupert had earned nothing. [Pg 16] Things began to look serious. But little was left of his last week\u0027s wages, and the time was coming when they would be entirely destitute. Rupert, as he passed through the business district, reflected sadly that while thousands were at work there seemed to be no place and no work for him. He was going down Chambers Street toward the Elevated station when he saw in front of him a young man, perhaps thirty years of age, whose unsteady movements seemed to indicate that he was under the influence of liquor. He came near falling as Rupert neared him. \"Can\u0027t I assist you?\" asked Rupert, stepping to his side. The young man glanced at the boy who addressed him with a look of inquiry. \"Yes,\" he said. \"Take my arm.\" Rupert did so. \"Where do you wish to go?\" he asked. \"I live in Harlem—at One-hundred-and-Seventeenth Street,\" replied the young man. \"Have you a couple of hours to spare?\" \"Yes, sir.\" [Pg 17] \"Then see me home. I will make it worth your while.\" \"I shall be glad to do so,\" said Rupert, cheerfully. \"I suppose you understand what is the matter with me?\" \"I should think you had been drinking too much.\" \"You are right. I have. Shameful, isn\u0027t it?\" \"Well, it isn\u0027t altogether creditable,\" said Rupert, not wishing to hurt the other\u0027s feelings. \"I should say not. However, it isn\u0027t quite so bad as it seems. I haven\u0027t been drinking hard, only I am so constituted that I can drink but little without its affecting me.\" They had now reached the stairway leading up to the Elevated road. \"Help me upstairs, boy. What is your name?\" \"Rupert.\" \"Very well, Rupert.\" When they reached the landing the young man took his purse from his pocket. [Pg 18] \"Pay out of that,\" he said. Rupert selected a dime and bought two tickets. Then they passed the box where the tickets were to be deposited, and entered a train which had just arrived. They took seats in one corner, and the young man sat down with an air of relief. \"I feel sleepy,\" he said. \"If I should fall asleep, wake me up at One-hundred-and-Sixteenth Street Station.\" \"Yes, sir.\" Rupert was able now to examine his companion a little more closely. He did not have a dissipated look, and Rupert judged that he was not in the habit of allowing himself to be overcome by liquor. Indeed, he had rather a refined look. It seemed to the boy a pity that he could not resist the temptation to drink. As they were approaching One-hundred-and-Sixteenth Street Rupert aroused his companion, who opened his eyes in a bewildered way. \"Eh? What?\" he asked. \"This is where we are to get out, sir.\" [Pg 19] \"Oh, yes, I remember. Let me take your arm.\" With this help he got down stairs, and they turned to the left. \"It is perhaps ten minutes\u0027 walk,\" said the young man. \"You will see me all the way home?\" \"Yes, sir. Do you feel any better?\" \"I can walk a little more steadily. You are sure I am not putting you out?\" \"Oh, yes, sir. I have plenty of time on my hands, for I am out of work.\" \"Indeed! And are you poor?\" \"Yes, sir.\" \"Don\u0027t you live with your father?\" \"My father is dead. I am helping to support my mother and sister.\" \"Why, that is too bad!\" said the young man, in a tone of sympathy. \"I am out of work, too, but then I am rich.\" \"I am not troubled in that way,\" said Rupert, smiling. \"I live with my mother. I am glad she is out of the city, so that she won\u0027t see me in my present condition.\" [Pg 20] \"Don\u0027t you think of working, sir? I shouldn\u0027t think you would know how to pass the time.\" \"I only lately returned from Europe. I may go into business after awhile. To be sure I don\u0027t need to earn anything, but if I have some steady employment I shall be less likely to disgrace myself.\" \"May I ask your name, sir?\" \"Certainly. My name is Frank Sylvester, I hope you are not a newspaper reporter.\" \"Oh, no, sir,\" said Rupert, smiling again. \"I should not like to have this little adventure of mine get into the papers. Do you see that house yonder?\" \"Yes.\" \"It is the one where I live. If you have a little more time to spare won\u0027t you come in and stay a short time?\" \"Yes, sir, if you desire it.\" They reached the house and Sylvester rang the bell. The door was opened by a maid servant about forty years of age. She looked at Sylvester\u0027s companion curiously. [Pg 21] \"A young friend of mine, Rachel,\" said the young man. \"Get ready a little supper for us, will you? Some tea, cold meat and toast.\" \"All right, Mr. Frank.\" They went into a pleasant sitting-room, where Rupert was invited to sit down. \"That was an old family servant,\" exclaimed Sylvester. \"If you hadn\u0027t been with me she would have taken me to task, for she saw I had been drinking.\" \n \n","sourceLink":"http://novel.tingroom.com/ertong/3001/82789.html","bookId":300,"book":{"id":300,"title":"Rupert\u0027s Ambition","description":"简介： Rupert Rollins, a tall boy of sixteen, was engaged in folding some pieces of cloth which had been shown during the day to customers. It was the principal salesroom of TenneyRhodes, who conducted a large wholesale dry goods house in the lower part of...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3001","creation":"Aug 1, 2019 12:18:31 AM","modification":"Aug 1, 2019 12:18:31 AM"}}
