{"id":28020,"no":12,"title":"THE HARDY TIN SOLDIER","content":"THERE were once five and twenty tin soldiers; they were all brothers, for they had all been born of one old tin spoon. They shouldered their muskets, and looked straight before them: their uniform was red and blue, and very splendid. The first thing they had heard in the world, when the lid was taken off their box, had been the words“Tin soldiers”! These words were uttered by a little boy, clapping his hands: the soldiers had been given to him, for it was his birthday; and now he put them upon the table. Each soldier was exactly like the rest only one of them was a little different, he had but one leg, for he had been cast last of all, and there had not been enough tin to finish him; but he stood as firmly upon his one leg as the others on their two; and it was just this soldier who became remarkable.\\n\\n On the table on which they had been placed stood many other playthings, but the toy that attracted most attention was a neat castle of cardboard. Through the little windows one could see straight into the hall. Before the castle some little trees were placed round a little lookingglass, which was to represent a clear lake. Waxen swans swam on this lake, and were mirrored in it. This was all very pretty; but the prettiest of all was a little lady, who stood at the open door of the castle: she was also cut out in paper, but she had a dress of the clearest gauze, and a little narrow blue ribbon over her shoulders, that looked like a scarf; and in the middle of this ribbon was a shining tinsel rose as big as her whole face. The little lady stretched out both her arms, for she was a dancer; and then she lifted one leg so high that the tin soldier could not see it at all, and thought that, like himself, she had but one leg.\\n\\n “That would be the wife for me,”thought he;“but she is very grand. She lives in a castle, and I have only a box, and there are five and twenty of us in that. It is no place for her. But I must try to make acquaintance with her.”\\n\\n And then he lay down at full length behind a snuffbox which was on the table; there he could easily watch the little dainty lady, who continued to stand on one leg without losing her balance.\\n\\n When the evening came, all the other tin soldiers were put into their box, and the people in the house went to bed. Now the toys began to play at“visiting,”and at “war,”and“giving balls.”The tin soldiers rattled in their box, for they wanted to join, but could not lift the lid. The nutcracker threw somersaults, and the pencil amused itself on the table: there was so much noise that the canary woke up, and began to speak too, and even in verse. The only two who did not stir from their places were the tin soldier and the dancing lady: she stood straight up on the point of one of her toes, and stretched out both her arms; and he was just as enduring on his one leg; and he never turned his eyes away from her.\\n\\n Now the clock struck twelve----and, bounce!----the lid flew off the snuff-box; but there was not snuff in it,but a little black goblin: you see it was a trick.\\n\\n “Tin soldier!”said the goblin,“will you keep your eyes to yourself?”\\n\\n But the tin soldier pretended not to hear him.\\n\\n “Just you wait till tomorrow!”said the goblin.\\n\\n But when the morning came, and the children got up, the tin soldier was placed in the window; and whether it was the goblin or the draught that did it, all at once the window flew open, and the soldier fell head over heels out of the third story. That was a terrible passage!He put his leg straight up, and stuck with his helmet downwards and his bayonet between the paving-stones.\\n\\n The servant-maid and the little boy came down directly to look for him, but though they almost trod upon him they could not see him. If the soldier had cried out “Here I am!”they would have found him; but he did not think it fitting to call out loudly, because he was in uniform.\\n\\n Now it began to rain; the drops soon fell thicker,and at last it came down in a complete stream. When the rain was past, two street boys came by.\\n\\n “Just look!”said one of them,“there lies a tin soldier. He shall go out sailing.”\\n\\n And they made a boat out of a newspaper, and put the tin soldier in the middle of it; and so he sailed down the gutter, and the two boys ran beside him and clapped their hands. Goodness preserve us! How the waves rose in that gutter, and how fast the stream ran! But then it had been a heavy rain. The paper boat rocked up and down,and sometimes turned round so rapidly that the tin soldier trembled; but he remained firm, and never changed countenance, but looked straight before him, and shouldered his musket.\\n\\n All at once the boat went into a long drain, and it became as dark as if he had been in his box.\\n\\n “Where am I going now?”he thought.“Yes, yes,that\u0027s the goblin\u0027s fault. Ah! If the little lady only sat here with me in the boat, it might be twice as dark for what I should care.”\\n\\n Suddenly there came a great water-rat, which lived under the drain.“Have you a passport?”said the rat.“Give me your passport.”\\n\\n But the tin soldier kept silence, and held his musket tighter than ever.\\n\\n The boat went on, but the rat came after it. Ugh!How he gnashed his teeth, and called out to the bits of straw and wood,\\n\\n “Hold him! Hold him! He hasn\u0027t paid toll----he hasn\u0027t shown his passport!”\\n\\n But the stream became stronger and stronger. The tin soldier could see the bright daylight where the arch ended; but he heard a roaring noise, which might well frighten a bolder man. Only think----just where the tunnel ended, the drain ran into a great canal; and for him that would have been as dangerous as for us to be carried down a great waterfall.\\n\\n Now he was already so near it that he could not stop. The boat was carried out, the poor tin soldier stiffening himself as much as he could, and no one could say that he moved an eyelid. The boat whirled round three or four times, and was full of water to the very edge----it must sink. The tin soldier stood up to his neck in water,and the boat sank deeper and deeper, and the paper was loosened more and more; and now the water closed over the soldier\u0027s head. Then he thought of the pretty little dancer, and how he should never see her again; and it sounded in the soldier\u0027s ears:\\n\\n Farewell, farewell, thou warrior brave,\\n\\n For this day thou must die!\\n\\n And now the paper parted, and the tin soldier fell out; but at that moment he was snapped up by a great fish.\\n\\n Oh, how dark it was in that fish\u0027s body! It was darker yet than in the drain tunnel; and then it was very narrow too. But the tin soldier remained unmoved, and lay at full length shouldering his musket.\\n\\n The fish swam to and fro; he made the most wonderful movements, and then became quite still. At last something flashed through him like lightning. The daylight shone quite clear, and a voice said aloud,“The tin soldier!”The fish had been caught, carried to market,bought, and taken into the kitchen, where the cook cut him open with a large knife. She seized the soldier round the body with both her hands, and carried him into the room, where all were anxious to see the remarkable man who had travelled about in the inside of a fish; but the tin soldier was not at all proud. They placed him on the table, and there----no! What curious things may happen in the world! The tin soldier was in the very room in which he had been before! he saw the same children, and the same toys stood on the table; and there was the pretty castle with the graceful little dancer. She was still balancing herself on one leg, and held the other extended in the air. She was hardy too. That moved the tin soldier: he was very nearly weeping tin tears, but that would not have been proper. He looked at her and she at him, but they said nothing to each other.\\n\\n Then one of the little boys took the tin soldier and flung him into the stove. He gave no reason for doing this.It must have been the fault of the goblin in the snuff-box.\\n\\n The tin soldier stood there quite illuminated, and felt a heat that was terrible; but whether this heat proceeded from the real fire or from love he did not know. The colours had quite gone off from him; but whether that had happened on the journey, or had been caused by grief, no one could say. He looked at the little lady, she looked at him,and he felt that he was melting; but he still stood firm,shouldering his musket. Then suddenly the door flew open,and the draught of air caught the dancer, and she flew like a sylph just into the stove to the tin soldier, and flashed up in a flame, and she was gone. Then the tin soldier melted down into a lump, and when the servant-maid took the ashes out next day, she found him in the shape of a little tin heart. But of the dancer nothing, remained but the tinsel rose, and that was burned as black as a coal.\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/881/976.html","bookId":674,"book":{"id":674,"title":"安徒生童话全集","description":"简介： 汉斯克里斯蒂安安徒生（Hans Christian Andersen，1805年4月2日－1875年8月4日）丹麦作家，诗人，因为他的童话故事而世界闻名。他最著名的童话故事有《小锡兵》、《冰雪女王》、《拇指姑...","cover":"http://novel.tingroom.com/file/upload/201402/25/14-30-17-86-1.jpg","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/881","creation":"Aug 1, 2019 12:19:08 AM","modification":"Aug 1, 2019 12:19:08 AM"}}
