{"id":78548,"no":17,"title":"Page 17","content":"She couldn\u0027t wait for morning light. She was going to find a hundred ways to make Nathan realize his good fortune. She already knew she was the perfect mate for him. He didn\u0027t know it yet, but eventually, with patience and understanding, he\u0027d realize how much he loved her. She was certain.\\n\\n She was his wife, his love. Their marriage was true in every sense. There was a bond between them. Marriage was a sacred institution, and Sara was determined to protect and cherish her vows.\\n\\n She fell asleep holding him tight. The next day was going to be the official start of her new life as Nathan\u0027s wife. It was going to be a day in heaven.\\n\\n Chapter Six\\n\\n It was a day in hell.\\n\\n Nathan had already left the cabin by the time she awakened. He\u0027d opened the chimney lid for her, and the room was flooded with fresh air and sunshine. It was much warmer than the day before. After she bathed, she dressed in a lightweight royal-blue gown with white linen borders and then went to find her husband. She wanted to ask him where the fresh sheets were kept so that she could change the bedding. She also wanted him to kiss her again.\\n\\n Sara had just reached the top step on the way to the main deck when she heard a man\u0027s shout. She hurried forward to see what all the commotion was about and almost tripped over the fallen man sprawled on the deck. The older seaman had obviously taken quite a fall, for he was sleeping soundly.\\n\\n The parasol she hadn\u0027t been able to find the day before was twisted between his feet. Jimbo was bent on one knee over the prostrate man. He slapped the side of the man\u0027s face twice in an attempt to waken him.\\n\\n In a matter of seconds a crowd gathered around their friend. Each immediately offered a suggestion or two as to how Jimbo could bring the man around.\\n\\n \"What the hell happened?\"\\n\\n Nathan\u0027s booming voice sounded directly behind Sara. She didn\u0027t turn around when she answered his question. \"I believe he tripped on something.\"\\n\\n \"It weren\u0027t something, m\u0027lady,\" one of the crew announced. He pointed to the deck. \"It were your parasol that caught up in his legs.\"\\n\\n Sara was forced to accept full responsibility. \"Yes, it was my parasol,\" she said. \"His injury is my fault. Will he be all right, Jimbo? I really didn\u0027t mean to cause this mishap. I—\"\\n\\n Jimbo took pity on her. \"No need to carry on so, Lady Sara. The men know it was just an accident.\"\\n\\n Sara glanced up to look at the crowd. Most were nodding and smiling at her. \"No need to get yourself in a dither, m\u0027lady. Ivan will get his wits back in a minute or so.\"\\n\\n A man with a full orange beard nodded. \"Don\u0027t be fretting,\" he interjected. \"It weren\u0027t that bad. The back of his head broke his fall.\"\\n\\n \"Murray?\" Jimbo called out. \"Bring me a bucket of water. That ought to bring him around.\"\\n\\n \"Will Ivan be able to cook up our meal tonight?\" The man Sara remembered was named Chester asked that question. He was frowning at Sara.\\n\\n She frowned back. It was apparent he blamed her for the unfortunate circumstance. \"Is your stomach more important to you than your friend\u0027s health?\" she asked. She didn\u0027t give him time to answer her but knelt down beside the sleeping man and gently patted his shoulder. The elderly man didn\u0027t respond. His mouth was gaping.\\n\\n \"My God, Jimbo, have I killed him?\" she whispered.\\n\\n \"No, you didn\u0027t kill him,\" Jimbo returned. \"You can see he\u0027s breathing still, Sara. He\u0027ll just have a fair head split when he wakes up, that\u0027s all.\"\\n\\n Nathan lifted Sara to her feet and pulled her back away from the crowd. She didn\u0027t want to leave. I\u0027m responsible for this accident,\" she said. Her gaze was fully directed upon Ivan, but she could still see the nods from the men surrounding her. She felt herself blush in reaction to their easy agreement. \"It was an accident,\" she cried out.\\n\\n No one contradicted her. That made her feel a little better. \"I should take care of Ivan,\" she announced then. \"When he opens his eyes I must tell him how sorry I am for forgetting my parasol.\"\\n\\n \"He won\u0027t be in the mood to listen,\" Nathan predicted.\\n\\n \"Aye,\" Lester agreed. \"Ivan the Terrible isn\u0027t one to forgive a slight for a good long while. He loves a good grudge, doesn\u0027t he, Walt?\"\\n\\n A slightly built man with dark brown eyes nodded agreement. \"This is more than a slight, Lester,\" he muttered. \"Ivan\u0027s going to be in a rage.\"\\n\\n \"Is Ivan the only cook?\" Sara asked.\\n\\n \"He is,\" Nathan told her.\\n\\n She finally turned around to look at her husband. Her blush was high, and she really didn\u0027t know if the heat in her cheeks was due to the fact that this was their first encounter since their night of intimacy or because she\u0027d caused such commotion.\\n\\n \"Why do they call him Ivan the Terrible?\" she asked. \"Is it because he has a mean temper?\"\\n\\n He barely spared her a glance when he answered. \"They don\u0027t like his cooking,\" he said. He motioned for one of the men to toss the contents of the bucket in Ivan\u0027s face. The cook immediately started sputtering and groaning.\\n\\n Nathan nodded, then turned and walked away from the group.\\n\\n Sara couldn\u0027t believe he\u0027d leave without a word to her first. She felt humiliated. She turned back to Ivan and stood wringing her hands while she waited for her chance to apologize. She silently vowed she would find Nathan and give him another lesson in proper etiquette.\\n\\n As soon as Ivan sat up Sara knelt down beside him. \"Pray forgive me, sir, for causing you this injury. It was my parasol that caused you to trip, though if you\u0027d only been looking where you were going, I\u0027m certain you would have noticed it. Still, I beg your forgiveness.\"\\n\\n Ivan was rubbing the back of his head while he glared at the pretty woman trying to give him a bit of the blame for his near brush with death. The worry in her expression kept his surly retort inside. That, and the fact that she was the captain\u0027s woman.\\n\\n \"It wasn\u0027t much of a hit I took,\" he muttered instead. \"You didn\u0027t do it on purpose, now did you?\"\\n\\n There was a faint Scottish brogue in his voice. Sara thought he sounded quite musical. \"No, of course I didn\u0027t do it on purpose, sir. Are you strong enough to stand? I\u0027ll help you to your feet.\"\\n\\n She could tell from his wary expression that he didn\u0027t want her assistance. Jimbo pulled the cook up, but as soon as he let go Ivan began to sway. Sara was still kneeling at his side. She reached out to grab her parasol from between his feet just as another crewman reached out to steady his friend. Poor Ivan was suddenly caught in a tug-of-war of sorts, for the captain\u0027s wife was pushing against his legs. He ended up sprawled on his backside.\\n\\n \"Get away from me, all of you,\" he roared. His voice didn\u0027t sound at all musical. \"You won\u0027t be getting my soup tonight, men. My head\u0027s aching, and now my arse is stinging, too. Damned if I\u0027m not taking to my bed.\"\\n\\n \"Watch your tongue, Ivan,\" Jimbo ordered.\\n\\n \"Yes,\" another man called out. \"We got us a lady present.\"\\n\\n Jimbo lifted Sara\u0027s parasol and handed it to her. He turned to leave, but her next words so startled him that he turned around again.\\n\\n \"I\u0027m going to prepare the soup for the men.\"\\n\\n \"No, you aren\u0027t,\" Jimbo told her. His hard tone of voice didn\u0027t leave room for argument. \"You\u0027re the captain\u0027s woman, and you won\u0027t be doing such common work.\"\\n\\n Because she didn\u0027t want to get into a disagreement with Jimbo in front of the rest of the men she waited until he\u0027d left. Then she smiled at the men watching her. \"I\u0027m going to make a lovely soup for everyone. Ivan? Will it make you feel better to have the rest of the day off and rest? It\u0027s the very least I can do to repay you for this accident.\"\\n\\n Ivan cheered up considerably. \"You ever make soup before?\" he asked her with a half grin, half scowl.\\n\\n Since everyone was staring at her, she decided to lie. How difficult could it be to make soup? \"Oh, my, yes, many times,\" she boasted. \"I helped our cook make many wonderful dinners.\"\\n\\n \"Why would a fine lady like yourself be doing such common work?\" Chester asked.\\n\\n \"It was very… boring in the country,\" she countered. \"It gave me something to do.\"\\n\\n They looked as if they believed that lie. \"If you\u0027re strong enough to direct me to your kitchen, Ivan, I\u0027ll get started right away. A good soup needs to simmer long hours,\" she added, hoping she was right.\\n\\n Ivan allowed her to take hold of his arm. He continued to rub the back of his head with his other hand as he directed her toward the work area. \"It\u0027s called a galley, m\u0027lady, not the kitchen,\" he explained. \"Slow down, lass,\" he added in a grumble when she rushed ahead of him. \"I\u0027m still seeing two of everything.\"\\n\\n They walked down one dark corridor after another until she was completely disoriented. Ivan knew his way, of course, and led her right to his sanctuary.\\n\\n He struck two candles, secured them in glass globes, and then sat down on a stool against the wall.\\n\\n There was a giant oven in the center of the room. It was surely the largest she\u0027d ever seen. When she made that comment to Ivan he shook his head. \"It isn\u0027t an oven, it\u0027s the galley stove. There\u0027s an open pit on the other side. You\u0027ve got to walk around the corner to get a look at it.\\n\\n That\u0027s where I cook my meat on a sturdy spit. On this side you can see the giant coppers sunk down low in the top. There are four in all, and every one of them needed to make my beef soup. There\u0027s the meat—some went bad. I\u0027ve already separated the tainted half from the good beef. Most is simmering in the water I added before I went up on deck to have a word with Chester. It gets a might stifling down here, and I needed a breath of fresh sea air.\"\\n\\n Ivan waved a hand toward the pile of bad meat he\u0027d left on the sidebar, thinking to tell her that as soon as he was feeling a little better he\u0027d toss the garbage overboard, but he forgot all about explaining when his head started in pounding again.\\n\\n \"There isn\u0027t much else to do,\" he muttered as he regained his feet. \"Just chop up those vegetables and add the spices. Of course, you know all that. Do you want me to stay until you learn your way around my galley?\"\\n\\n \"No,\" Sara answered. \"I\u0027ll do just fine, Ivan. You go and have Matthew take a look at that bump. Perhaps he has some special medicine he can give you to ease your ache.\"\\n\\n \"That he does, lass,\" Ivan replied. \"He\u0027ll be giving me a pint full of grog to ease my aches and pains, or I\u0027ll be knowing the reason why.\"\\n\\n As soon as the cook took his leave Sara went to work. She was going to make the finest soup the men had ever eaten. She added the rest of the meat she found on the sidebar, a little of each to each copper. She then sprinkled a fair amount of the spices she found in the cubbyhole below the coppers into each vat. One bottle was filled with crushed brown leaves. The aroma was quite pungent, so she only added a little dash of that.\\n\\n Sara spent the rest of the morning and part of the afternoon in the galley. She thought it a little odd that no one had come looking for her. That thought led to Nathan, of course.\\n\\n \"The man didn\u0027t even give me a proper greeting,\" she muttered to herself. She mopped at her brow with the towel she\u0027d tied around her waist and pushed the damp strands of hair back over her shoulders.\\n\\n \"Who didn\u0027t give you a proper greeting?\"\\n\\n The deep voice came from the doorway. Sara recognized Nathan\u0027s low growl.\\n\\n She turned around and frowned at him. \"You didn\u0027t give me a proper greeting,\" she announced.\\n\\n \"What are you doing here?\"\\n\\n \"Making soup. What are you doing here?\"\\n\\n \"Looking for you.\"\\n\\n It was warm in the galley, and she was sure that was the reason she was suddenly feeling so lightheaded. It couldn\u0027t be a reaction to the way he was looking at her.\\n\\n \"Have you ever made soup before?\"\\n\\n She walked over to stand in front of him before giving her answer. Nathan leaned against the doorway, looking as relaxed as a panther about to spring.\\n\\n \"No,\" she said. \"I didn\u0027t know how to make soup. I do now. It wasn\u0027t difficult.\"\\n\\n \"Sara…\"\\n\\n \"The men were all blaming me for Ivan\u0027s mishap. I had to do something to win their loyalty. Besides, I want my staff to like me.\"\\n\\n \"Your staff?\"\\n\\n She nodded. \"Since you don\u0027t have a house and you don\u0027t have servants, well, you do own this ship, and so your crew must also be my staff. When they taste my soup they\u0027ll like me again.\"\\n\\n \"Why do you care if they like you or not?\" he asked.\\n\\n He straightened away from the wall and moved closer to her. Hell, he thought, he was drawn to her like a drunk drawn to drink. It was all her fault for looking so damned sweet and pretty.\\n\\n Her face was flushed from the heat in the galley. Strands of her curly hair were wet. He reached out and gently brushed a curl away from the side of her face. He seemed to be more surprised by the spontaneous touch than she was.\\n\\n \"Nathan, everyone wants to be liked.\"\\n\\n \"I don\u0027t.\"\\n\\n She gave him a disgruntled look for disagreeing with her. He took another step toward her. His thighs touched hers. \"Sara?\"\\n\\n \"Yes?\"\\n\\n \"Do you still hurt because of last night?\"\\n\\n Her blush was instantaneous. She couldn\u0027t look him in the eye when she answered him but stared intently at his collarbone. \"It did hurt last night,\" she whispered.\\n\\n He tilted her face up with his thumb. \"That isn\u0027t what I asked you,\" he said in a soft whisper.\\n\\n \"It isn\u0027t?\"\\n\\n \"No,\" he replied.\\n\\n \"Then what is it you wanted to know?\"\\n\\n She sounded out of breath to him. She needed some fresh air, he decided. Hell, he didn\u0027t want her fainting on him again. \"I want to know if you hurt now, Sara,\" he said.\\n\\n \"No,\" she answered. \"I don\u0027t hurt now.\"\\n\\n They stared at each other a long, silent minute. Sara thought he might want to kiss her, but she couldn\u0027t be sure. \"Nathan? You still haven\u0027t given me a proper greeting.\"\\n\\n She put her hands on the front of his shirt, closed her eyes, and waited.\\n\\n \"What the hell is a proper greeting?\" he asked. He knew exactly what she wanted from him, but he wanted to see what she would do next.\\n\\n She opened her eyes and frowned at him. \"You\u0027re supposed to kiss me.\"\\n\\n \"Why?\" he asked, baiting her again.\\n\\n Her exasperation was obvious. \"Just do it,\" she commanded.\\n\\n Before he could ask another aggravating question she clasped the sides of his face with her hands and pulled his head down toward her. \"Oh, never mind,\" she whispered \"I\u0027ll do it myself.\" \\n\\n","sourceLink":"https://allnovel.net/the-gift-crown-s-spies-3/page-17.html","bookId":1790,"book":{"id":1790,"title":"The Gift (Crown\u0027s Spies #3)","description":"Storyline: A child bride, Sara Winchester had grown into a winsome beauty, joyfully anticipating the day when her husband Nathan, Marquess of St. James, would return to claim her heart at last. Charmingly innocent, she dismissed the ancient feud that divided Nathan\u0027s family from her own...and she was totally unaware of his past exploits as the notorious pirate, Pagan. The man who now stood before her was perplexing, arrogant and powerfully handsome...a warrior-gentleman whose gentle touch aroused her to the wildest, deepest pleasures of love. \\n Nathan had never bared his soul to any woman, but he was soon utterly beguiled and exasperated by Sara\u0027s sweet, defiant ways. Aboard his ship, The Seahawk, she was brave, imperious and determined to win his heart completely -- yet upon their return to England, her love would be sorely tested as a vile conspiracy tried to tear them apart. With their future at stake, they would discover the true destiny of their passion...for all time!\\n","cover":"https://allnovel.net/images/the-gift-crown-s-spies-3.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-gift-crown-s-spies-3.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 4:08:35 PM"}}
