{"id":73116,"no":16,"title":"Page 16","content":"“They’re going to look like the biggest idiots!”\n Emma tried to laugh along, too, but Lili’s words clanged in her mind. You’re so good at this. Keep up the good work. She was almost positive Lili’s voice had a sinister edge, an unspoken subtext: Keep up the good work . . . of being Sutton.\n Emma looked around at the laughing, smiling faces of Sutton’s friends. No matter how safe she final y felt with them, there was an entire world outside—a world where someone watched her every move and waited for her to slip up.\n I couldn’t agree more. Trust no one, sister.\n Chapter 15\n An Opening . . . and a Closing\n CAN YOU SNEAK OUT?\n Emma rol ed onto her back to read the text Ethan had just sent. Pul ing one of Sutton’s soft blue throw blankets over her bare legs, she texted back: MERCERS ARE OUT TO\n DINNER. I’D HAVE TO BE BACK BEFORE TEN.\n I’LL PICK YOU UP IN FIFTEEN, Ethan responded. WEAR A DRESS.\n A dress? Emma frowned. UM . . . OKAY, she wrote. CAN I ASK\n WHAT WE’RE DOING?\n NOPE. IT’S A SURPRISE.\n Emma sprang from Sutton’s bed and padded to her closet. She pushed aside a row of soft cotton tops and skinny jeans and examined Sutton’s dress selection, which was plentiful and expensive. She touched a long black dress with gold straps. Too fancy, it seemed, for a Tuesday. Her fingers traced the feathered col ar of a short silver cocktail dress. Maybe it was too short. She ran her hands along the hem of a fire engine-red minidress. Too sex goddess.\n I couldn’t help but groan. Was there even such a thing as being too much of a sex goddess? As far as I was concerned, Emma needed to get down with her sexy self. This had to be the night they were final y going to kiss, right?\n Then Emma’s palms rested on a light gray oneshouldered dress. The gauzy silk felt soft beneath her fingertips. She slid it over her head and glanced at herself in the gold-framed ful -length mirror on the back of the door. It was perfect.\n After mascara, lip gloss, black patent heels, and chandelier earrings that matched Sutton’s silver locket, she was ready. The phone beeped once more, and Emma ran to the bed, thinking it was Ethan. But it was from her friend Alex instead. YOU SHOULD DEFINITELY CHECK THIS PLACE OUT!\n Attached was a website for a vintage store near the University of Arizona. I KNOW HOW YOU LOVE YOUR THRIFT\n SHOPS, Alex added, with an emoticon smiley. Emma wrote back a quick thank-you fol owed by a series of Xs and Os. Then she glanced at herself in the mirror, dol ed up in Sutton’s designer dress, jewelry, and expensive shoes. Would Alex even know her right now?\n She sat on the bottom step of the Mercers’ staircase, the house quiet around her. Laurel was out with a friend at Les Misérables—since Emma was grounded, she couldn’t use the ticket Laurel had given her for her birthday. Only Drake watched her from his sprawled-out post on the living room floor, and he was too lazy to get up.\n Bright headlights shone in the driveway. Emma rose, careful y opened the front door, and looked both ways as she stepped off the porch. Some of the windows in the houses next door were lit; she hoped no nosy neighbors would mention this to the Mercers. Your daughter looked lovely all dressed up! And who was that dashing young man escorting her?\n Ethan had gotten out of the car to open the passenger door for her. He wore a dark suit jacket, khaki pants, and shiny black shoes, a huge change from his usual disheveled shorts and tees.\n “Wow.” Emma paused for a moment before getting into the car. “You look so . . . handsome.”\n “Handsome, huh?” Ethan grinned.\n Emma blushed. “Yeah, handsome like a Ken dol .”\n Ethan’s eyes traveled along her body. “And you look real y pretty,” he said, his words spil ing out awkwardly. “But not like a Barbie.”\n Emma pressed her lips together in a bashful smile. After a moment, she swung into the passenger seat. Ethan jogged to the driver’s door and revved the engine. Emma rested her hand on the console between them, wondering for just a moment whether Ethan would try to link his fingers through hers. Instead, he took out a plaid handkerchief from the inside of his coat and turned to face her.\n “You’re going to have to wear this,” he said, a mischievous grin crawling across his face. “Our destination is a secret.”\n She burst out laughing. “You can’t be serious.”\n “Serious as a heart attack.” He motioned for her to twist and tied the scarf around her head. In moments, Emma was enveloped in darkness. She felt the car lurch into reverse and then pivot to the right, onto the street. With anyone else, she probably would’ve been freaked out by such a gesture—Madeline and the Twitter Twins had kidnapped her at Sabino Canyon in a similar fashion, after al . But with Ethan, she felt safe. Excited.\n “It won’t be too long,” he assured her. Emma heard the soft tick-tick-tick of the turn signal. “No peeking!”\n A new song by the Strokes played softly on the stereo. Emma sat back and shut her eyes, wondering where they were going. Yesterday in school, she’d told him about Madeline’s, Charlotte’s, and Laurel’s alibis, and Ethan had nodded, businesslike—he’d been cordial but distant since the almost-kiss. The bel had rung before she could tel him about her new suspects, the Twitter Twins. There had been no mention of anything personal. There had been no mention of what had happened at the pool. Maybe Ethan just wanted to forget it had happened. But then again, this seemed a lot like a date.\n She felt a slight jerk as the car stopped for a light. Close by, a car stereo thudded.\n I tried to look at where they were going, but ran up against one of the weird side effects about my dead life with Emma—whenever her eyes were closed or covered, mine were, too. It made me wonder who or what was behind al this—not my murder, but me, here, trailing Emma from beyond the grave. Believe me, I hadn’t been a whatdoes-it-al -mean kind of girl when I was alive, reading philosophy and praying to Buddha or whatever. But this opportunity with Emma, as scary as it was, made me feel kind of . . . blessed. Undeserving, too. I’d clearly been a bitch in life; why was I given this special gift? Or was this what happened to everyone after they died, or at least those with unfinished business?\n Final y, Emma sensed the car easing to a stop and heard Ethan shift it into PARK. “Okay,” he said softly. “You can look now.”\n Emma lowered the scarf and blinked. They were downtown, near the col ege. A large, sand-colored building stretched across the horizon. Sweet-smel ing lemon trees lined a stone walkway. Golden lights il uminated the grand front steps. Across the front of the building was a black banner that read TUCSON PHOTOGRAPHY INSTITUTE.\n “Oh!” Emma cried, feeling more confused than ever.\n “There’s an exhibit for three London-based\n photographers starting tonight,” Ethan explained. “I know you like photography, so . . .”\n “This is great!” Emma breathed. Then she looked down at her dress. “But why are we dressed up?”\n “Because tonight’s the opening party.”\n “And we’re . . . invited?”\n Ethan shot her a devious smile. “Nope. We’re going to crash.”\n Emma’s hands went slack in her lap. “Ethan—I can’t get in trouble again. The Mercers wil kil me if they know I’m out. I’m supposed to be in Sutton’s bedroom right now, repenting my life as a criminal.”\n Ethan gestured to two party guests climbing the grand stairs. A tuxedoed man at the top smiled at them and politely opened the doors without checking for credentials.\n “Live a little. I promise you we won’t get caught.”\n “But what does this have to do with Sutton?”\n Ethan sat back against his seat, looking a little surprised by the question. “Wel , nothing. I just thought it would be fun.”\n Emma gazed from the photo institute’s elegant columns back to Ethan’s face. A fancy party with Ethan? That would be fun. Maybe she deserved some time to relax and just be herself.\n “Okay.” She pushed open the door, casting a grin over her shoulder. “But at the first sign of trouble, we’re leaving.”\n Good girl, I thought. For a second, I had been sure Emma was going to demand that Ethan take her home. The problem with Emma being grounded was that I’d been cooped up for days, watching her pace in my bedroom. Crashing a party is just what the boredom doctor ordered. They ascended the stone staircase. The punishing heat of the day had broken, and a cool breeze tickled their cheeks. The scent of lemon trees and a musky mix of women’s and men’s colognes hung in the air. The tuxedoed man eyed them as they approached, and Emma sucked in her stomach. Was he ticking off his mental list of invitees?\n Could he tel they were high school students?\n “Act natural y,” Ethan murmured to Emma, apparently noticing how stiff she’d become. “The opposite of how you acted when you stole that handbag.”\n “Very funny.” When Emma reached Mr. Tuxedo, she shot him the most carefree smile she could muster. “Good evening,” the man said, opening the door for them.\n “See?” she whispered when they were safely in the lobby. “I total y played it cool. I’m not as big a loser as you think I am.”\n Ethan looked at her sideways. “I most definitely don’t think you’re a loser.” Then he touched the back of Emma’s arm to guide her inside the exhibit. For a moment, al sounds and sights dul ed, and Emma felt like she and Ethan were the only ones in the universe. When he let go at the end of the lobby, she adjusted the strap of Sutton’s silky dress and tried to breathe normal y.\n The museum was dark and smel ed like fresh flowers. Guests mingled around the wide, terra-cotta-tiled space, some gazing at the black-and-white photos on the wal s, some chatting with one another, others scoping out the crowd. Everyone wore sleek gowns, chic party dresses, and dapper suits. There were clusters of people surrounding three awestruck guys who looked like they were in their twenties, probably the artists. A jazz band played an El a Fitzgerald song, and waitresses in simple black sheaths swirled around with trays of canapés and drinks. A couple of guests glanced at Emma and Ethan curiously, but Emma tried to stand as straight and confidently as she could.\n “Stuffed shrimp?” a waitress asked as she floated past. Emma and Ethan each took a treat.\n A second waitress materialized, offering them flutes of champagne. “Of course,” Ethan said, taking two glasses and handing one to Emma. The crystal sparkled, and the bubbles rose to the top of the glass.\n Champagne. How I wished I could have one tiny, beyond-the-grave sip.\n “Cheers,” Ethan said, offering his glass in a toast. Emma clinked her champagne flute to his. “How did you know about this?”\n A slight flush crawled up Ethan’s neck. “Oh, I just came across it online.”\n Warmth spread through Emma’s chest as she imagined Ethan sitting at his computer, scrol ing through events they could attend together.\n They walked toward the artwork. Around each\n photograph was a large black square frame. Smal beams of light from the ceiling il uminated each image. The first photo was of a long, straight road as seen from the inside of a car. It was printed in black archival pigment ink on cotton paper, and there was something haunting about the dark trees and eerily lit sky. Emma glanced at the smal placard off to the side. Besides listing the artist’s name, it also showed the price. Three thousand dol ars. Whoa. \n","sourceLink":"https://allnovel.net/never-have-i-ever-the-lying-game-2/page-16.html","bookId":2394,"book":{"id":2394,"title":"Never Have I Ever (The Lying Game #2)","description":"Storyline: \n Never Have I Ever (The Lying Game #2) \n My perfect life was a lie. \n Now I\u0027d do anything to uncover the truth. \n Not long ago, I had everything a girl could wish for: amazing friends, an adorable boyfriend, a loving family. But none of them know that I\u0027m gone--that I\u0027m dead. To solve my murder, my long-lost twin sister, Emma, has taken my place. She sleeps in my room, wears my clothes, and calls my parents Mom and Dad. \n And my killer is watching her every move. \n I remember little from my life, just flashes and flickers, so all I can do is follow along as Emma tries to solve the mystery of my disappearance. But the deeper she digs, the more suspects she uncovers. It turns out my friends and I played a lot of games--games that ruined people\u0027s lives. Anyone could want revenge . . . anyone could want me--and now Emma--dead. \n From Sara Shepard, the #1 New York Times bestselling author of the Pretty Little Liars books, comes a riveting series about secrets, lies, and killer consequences.\n \n","cover":"https://allnovel.net/images/never-have-i-ever-the-lying-game-2.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/never-have-i-ever-the-lying-game-2.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:26:33 AM"}}
