{"id":73127,"no":27,"title":"Page 27","content":"“Sutton . . . hey,” Ethan said, dropping the girl’s hand. Emma took in her steel gray eyes, thin lips, and high cheekbones. She was familiar, too . . . really familiar. The last time Emma had seen this girl, she was smiling smugly as the cops pushed Emma into the cruiser in front of Clique. “Hi, Sutton,” Samantha chirped. She gestured to Ethan. “Like our costumes? I make a pretty Maid Marian to Ethan’s Robin Hood, don’t you think?” Samantha was Ethan’s mystery date. Chapter 25 Almost, But Not Quite Emma spun and tore through the crowd, desperate to get out of the gym as soon as humanly possible. A red haze swam before her eyes. Screw keeping tabs on the Twitter Twins. She needed some air. She barely felt her hands pressing on the double doors or the cool night air on her skin. Al around her was a cruel y beautiful pink Arizona sky. Ripped ticket stubs littered the sidewalk. Someone’s abandoned cat mask lay propped up against a tree. Heavy bass pulsated from inside the school, and every once in a while, there was a deafening crackle of fake thunder. Slumping down on the bench nearest the courtyard, Emma placed her head in her hands. She’d been the one, after al , who’d put the brakes on things. But . . . Samantha? The girl who’d had her arrested? It was like a slap in the face. The doors creaked open, and music from the dance wafted outside. When Emma turned and saw Ethan, she pretended to search for something in her bag. “Where’s your date?” she couldn’t help but snap. “She’s . . . inside.” Ethan stood over her for a moment, waiting. Emma had plopped down in the middle of the bench, but she wasn’t about to shove over to make room for him. “Are you al right?” Emma nodded stiffly. “Yep. Fine.” “I was looking for you, but I didn’t see you with Madeline and the others,” Ethan said, removing his Robin Hood hat from his head. It was kind of ugly, Emma noted with satisfaction. It made him look like an elf. “Wel , have a nice night.” Emma knew how bitchy she sounded, but she couldn’t find it in her heart to be kind right now. Ethan’s shoulders slumped. “Look. I think I know what’s bothering you.” Emma looked away. “It doesn’t matter.” She absolutely wasn’t going to talk about this. “Sam’s real y nice, once you get to know her.” Emma wanted to throw her Sherlock Holmes pipe at his head. So she was Sam now? “And I spoke to her about you,” Ethan added. “She’s wil ing to drop al the shoplifting charges. No juvie, no community service, no permanent record.” Emma snorted. “Was that the trade-off? You take her to the dance, she lets me walk? How nice of you. How martyrlike.” Ethan shook his head. “Is this what you’re like when you’re jealous?” A look crossed his face that Emma couldn’t quite decipher. “You’re more like Sutton than you think,” he said. “What’s that supposed to mean?” Ethan crossed his arms over his chest. “You told me you just wanted to be friends. Is that what you want?” Inside the gym, the DJ put on a song by the Black Eyed Peas. The music sounded hol ow, empty. Emma reached under her blazer and cupped her hand around Sutton’s locket. “I don’t know,” she muttered. Ethan lowered himself to the pavement until his face was level with hers. His eyes were soft and round. The setting sun cast sharp shadows on his cheekbones. Emma could smel his signature Ethan-ish scent, a mix of deodorant, freshly laundered clothes, and spearmint. She tried hard to keep her face impassive. She didn’t want him to know what she was feeling. “I thought that was what I wanted,” Emma final y said, taking a deep breath. “It just seemed . . . easier. Safer. But now I’m not sure about anything.” Ethan stared at the back of his hands. Say something, anything, Emma silently pleaded, closing her eyes. “There you are.” Emma’s eyes flew open. The double doors had swung wide, and a girl in a long, dark wig stood on the sidewalk. Ethan shot away from Emma like a bul et fired from a gun. “Sam,” he said. “I was looking for you.” Samantha’s gray eyes were cold. Her boobs looked weirdly squished in her corset. When she saw Emma, her scowl turned her pretty features into an ugly mask. “We were just talking,” Ethan blurted, moving to Samantha and taking her arm. “I was about to come in and look for you.” Samantha pivoted toward the door. “C’mon. Let’s dance.” She gave Emma an icy wave and pul ed Ethan back into the gym. Ethan looked over his shoulder and met Emma’s gaze. A smal squeak escaped Emma’s mouth, but when she tried to say more, nothing came out. When they were gone, she pul ed the detective hat off her head and mashed it between her hands. Bing. Sutton’s phone chimed inside Emma’s bag. If it was a text from Ethan, Emma was going to throw the phone into the fountain in the middle of the courtyard. But instead, the text was from Madeline. WHERE ARE YOU, BITCH? WE MISS YOU! YOU DIDN’T MAKE A SECRET GETAWAY WITHOUT US, DID YOU? Another clap of thunder sounded from the gym. Emma stood up, resolute. Ethan’s non-answer wasn’t going to ruin her night. She hit REPLY. ON MY WAY BACK INSIDE. After adding a tongue-wagging smiley, she hit SEND. Forget Ethan. Forget love. She had two twins to watch. Chapter 26 One Down, One to Go The next forty-five minutes passed quickly, fil ed with a tour of the haunted house, snarky costume-rating from one of the corner banquettes, and keeping tabs on Gabby and Lili, who made the rounds in their court sashes and spent most of the time on the dance floor as though nothing were amiss. Countless students approached Emma and the others to compliment them on a dance wel done, though a notable few steered clear: Garrett, whom Emma hadn’t seen since the closet incident, and Ethan, whom she unfortunately couldn’t help but see chatting with Samantha —Sam—at one of the coffin tables. Every time Ethan glanced her way, Emma pretended she was having a fantastic time. Final y, Emma, Charlotte, and Madeline tumbled out into the night, linking arms and laughing at the best and worst costumes of the night—dorky Amanda Donovan, who’d dressed as Mr. Peanut; John Pierce, a fabulous gay boy who always had everyone laughing, who’d come as Lady Gaga; and, of course, Davin-as-Freddy-Krueger, who’d tortured Madeline by extending and retracting his freaky knife-nails in her face al night. “I should’ve gone stag like you, Sutton,” Madeline moaned. Laurel appeared next, loosely holding hands with Caleb. They gazed at each other and giggled softly. When Caleb bent down to kiss Laurel lightly on the lips, Madeline whooped. “Yeah!” “Sex goddess!” Charlotte seconded. Laurel broke away from Caleb and shot the girls a mock glare. Emma grinned at her as she skipped toward the group, glad that she had found someone she real y liked. Madeline had parked her car in the school’s lot earlier in the day in preparation for the camping expedition. As the girls headed toward the car, Gabby burst through the door, riding piggyback on Kevin Torres. Her goddess wings drooped, her floral crown was squished and tilted, but her Homecoming Court sash was stil proudly in place. Kevin put her down gently on the bench, and they made disgusting cooing noises to each other. Lili fol owed, also stil wearing her sash. As soon as she saw Gabby and Kevin, her face stiffened, her lips puckered, and she curled her fists hard, accidental y lighting up her Lady Liberty torch. She swung a wide arc around them. Madeline unlocked her SUV with two short bleeps. Emma climbed into the front seat next to her, while Charlotte and Laurel squeezed into the middle row. Sleeping bags, pil ows, backpacks, flashlights, and an il icit bottle of vodka had been packed in the cargo space earlier that day. Very quickly, the cabin fil ed with the mingling odors of perfume, costume makeup, and cinnamon Altoids, which Laurel had passed around as soon as Madeline started the engine. Just as Madeline adjusted the driving mirrors, there was a knock on the window. “Hey!” Gabby waved. “Shit,” Emma whispered. “Let’s get out of here before they ask to come along again.” Madeline looked at her. “Sutton, we already invited them.” Emma’s jaw dropped. “You did? When?” Madeline shrugged. “It seemed only fair after the court prank.” “Inviting them to get ready with us was only fair,” Emma said, the pitch of her voice rising higher and higher. “I don’t want them camping with us!” “Calm down.” Charlotte sounded bored. “It’s just one night.” Laurel looked back and forth between everyone, her cheeks stil flushed from her night with Caleb. “We can’t exactly uninvite them,” she said. “Besides, they know where the springs are. None of us have ever been before, and apparently they’re hard to find.” “The springs are hard to find?” Emma echoed weakly. Suddenly, the seat belt across her torso felt like a vise. She had to get out of here. She racked her brain for an excuse, but before she could come up with anything, Gabby wrenched open the door. “Hey, girls!” She climbed past Charlotte and Laurel to the very back seat. Lili begrudgingly fol owed. When it was clear that the only available seat left was next to her sister, Lili let out a groan and plopped down, too, putting as much distance between them as she could. She gripped her Liberty torch as though it were a weapon. Emma’s skin felt hot and prickly at the nearness of the Twins. Her brain spun. Would Lili and Gabby do anything to her with the other girls around? Maybe if she played it cool —and stuck with Laurel al night—nothing would happen. No no no, I thought desperately, wil ing Emma to get out of the car. “Okay, bitches.” Madeline revved the engine. “Let’s get this show on the road.” Everyone whooped. “Hot springs, here we come.” Charlotte draped her arms across the back of the seats. Laurel swiveled around and looked at Lili and Gabby. “You remember how to get there, right?” “Yeah. We just went camping there with our dad.” Gabby’s voice was languid and happy, as though she’d just spent hours at the spa. “He didn’t want us to swim in them, but we did when he went to sleep.” “That’s not true,” Lili said sharply. “Dad didn’t care if we swam in it.” “Yeah, he did,” Gabby said. “He thought we’d drown.” “You’ve got it al wrong.” Lili sounded real y worked up. “You always get everything wrong.” Everyone fel silent at the razor-sharp tone of Lili’s voice. “Rrow,” Madeline whispered. The car rol ed over a speed bump and out the school exit. Someone had draped spiderwebs over the gates and affixed devil horns to the large, many-armed cacti lining the path. Madeline turned up the winding roads that led toward the mountain. A sports car with round, xenon-bright headlights passed them going the other direction. The girls began to chatter about the dance—Madeline and the disastrous Freddy Krueger, Laurel’s burgeoning crush on Caleb. “And how about you?” Madeline nudged Emma. “You disappeared for a while. Did you find someone fun?”","sourceLink":"https://allnovel.net/never-have-i-ever-the-lying-game-2/page-27.html","bookId":2394,"book":{"id":2394,"title":"Never Have I Ever (The Lying Game #2)","description":"Storyline: Never Have I Ever (The Lying Game #2) My perfect life was a lie. Now I\u0027d do anything to uncover the truth. Not long ago, I had everything a girl could wish for: amazing friends, an adorable boyfriend, a loving family. But none of them know that I\u0027m gone--that I\u0027m dead. To solve my murder, my long-lost twin sister, Emma, has taken my place. She sleeps in my room, wears my clothes, and calls my parents Mom and Dad. And my killer is watching her every move. I remember little from my life, just flashes and flickers, so all I can do is follow along as Emma tries to solve the mystery of my disappearance. But the deeper she digs, the more suspects she uncovers. It turns out my friends and I played a lot of games--games that ruined people\u0027s lives. Anyone could want revenge . . . anyone could want me--and now Emma--dead. From Sara Shepard, the #1 New York Times bestselling author of the Pretty Little Liars books, comes a riveting series about secrets, lies, and killer consequences.","cover":"https://allnovel.net/images/never-have-i-ever-the-lying-game-2.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/never-have-i-ever-the-lying-game-2.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:26:33 AM"}}
