{"id":22916,"no":41,"title":"Chapter 41. The State Prison.","content":"The regent’s re-entrance into the citadel of Stirling, being on the evening preceding the day he had promised should see the English lords depart for their country, De Warenne, as a mark of respect to a man whom he could not but regard with admiration, went to the barbican-gate to bid him welcome. \\n\\n \\n\\n Wallace appeared; and as the cavalcade of noble Southrons who had lately commanded beyond the Tay, followed him, Murray glanced his eye around, and said with a smile to De Warenne, “You see, sir earl, how we Scots keep our word!” and then he added, “you leave Stirling to-morrow, but these remain till Lord Douglas opens their prison-doors.” \\n\\n \\n\\n “I cannot but acquiesce in the justice of your commander’s determination,” returned De Warenne, “and to comfort these gentlemen under their captivity, I can only tell them that if anything can reconcile them to the loss of liberty, it is being the prisoners of Sir William Wallace.” \\n\\n \\n\\n After having transferred his captives to the charge of Lord Mar, Wallace went alone to the chamber of Montgomery, to see whether the state of his wounds would allow him to march on the morrow. While he was yet there, an invitation arrived from the Countess of Mar, requesting his presence at an entertainment which, by her husband’s consent, she meant to give that night at Snawdoun, to the Southron lords before their departure for England. \\n\\n \\n\\n “I fear you dare not expend your strength on this party?” inquired Wallace, turning to Montgomery. \\n\\n \\n\\n “Certainly not,” returned he; “but I shall see you amidst your noble friends, at some future period. When the peace your arms must win, is established between the two nations, I shall then revisit Scotland; and openly declare my friendship for Sir William Wallace.” \\n\\n \\n\\n “As these are your sentiments,” replied Wallace, “I shall hope that you will unite your influence with that of the brave Earl of Gloucester, to persuade your king to stop this bloodshed; for it is no vain boast to declare, that he may bury Scotland beneath her slaughtered sons, but they never will again consent to acknowledge any right in an usurper.” \\n\\n \\n\\n “Sanguinary have been the instruments of my sovereign’s rule in Scotland,” replied Montgomery; “but such cruelty is foreign to his gallant heart; and without offending that high-souled patriotism, which would make me revere its possessor, were he the lowliest man in your legions, allow me, noblest of Scots, to plead one word in vindication of him to whom my allegiance is pledged. Had he come hither, conducted by war alone, what would Edward have been worse than any other conqueror? But on the reverse, was not his right to the supremacy of Scotland acknowledged by the princes who contended for the crown? And besides, did not all the great lords swear fealty to England, on the day he nominated their king?” \\n\\n \\n\\n “Had you not been under these impressions, brave Montgomery, I believe I never should have seen you in arms against Scotland; but I will remove them by a simple answer. All the princes whom you speak of, excepting Bruce of Annandale, did assent to the newly offered claim of Edward on Scotland; but who, amongst them, had any probable chance for the throne, but Bruce or Baliol? Such ready acquiescence was meant to create them one. Bruce, conscious of his inherent rights, rejected the iniquitous demand of Edward; Baliol accorded with it, and was made king. All our chiefs who were base enough to worship the rising sun, and, I may say, condemn the God of truth, swore to the falsehood. Others remained gloomily silent; and the bravest of them retired to the Highlands, where they dwell amongst their mountains, till the cries of Scotland called them again to fight her battles. \\n\\n \\n\\n “Thus did Edward establish himself as the liege lord of this kingdom; and whether the oppresion which followed were his or his agents’ immediate acts, it matters not, for he made them his own by his after-conduct. When remonstrances were sent to London, he neither punished nor reprimanded the delinquents, but marched an armed force into our country, to compel us to be trampled on. It was not an Alexander nor a Charlemagne, coming in his strength to subdue ancient enemies, or to aggrandize his name, by vanquishing nations far remote, with whom he could have no affinity! Terrible as such ambition was, it is innocence to what Edward has done. He came, in the first instance, to Scotland as a friend; the nation committed its dearest interests to his virtue; they put their hands into his and he bound them in shackles. Was this honor? Was this the right of conquest? The cheek of Alexander would have blushed deep as his Tyrian robe; and the face of Charlemagne turned pale as the lilies, at the bare suspicion of being capable of such a deed. \\n\\n \\n\\n “No, Lord Montgomery, it is not our conqueror we are opposing; it is a traitor, who, under the mask of friendship, has attempted to usurp our rights, destroy our liberties, and make a desert of our once happy country. This is the true statement of the case, and though I wish not to make a subject outrage his sovereign, yet truth demands of you to say to Edward, that to withdraw his pretensions from this exhausted country, is the restitution we may justly claim-is all that we wish. Let him leave us in peace, and we shall no longer make war upon him. But if he persist (which the ambassadors from the Prince of Wales announce), even as Samson drew the temple upon himself, to destroy his enemies, Scotland will discharge itself upon the valleys of England; and there compel them to share the fate in which we may be doomed to perish.” \\n\\n \\n\\n “I will think of this discourse,” returned Montgomery, “when I am far distant; and rely on it, noble Wallace that I will assert the privilege of my birth, and counsel my king as becomes an honest man.” \\n\\n \\n\\n “Highly would he estimate such counsel,” cried Wallace, “had he virtue to feel that he who will be just to his sovereign’s enemies must be of an honor that will bind him with double fidelity to his king. Such proof give your sovereign; and, if he have one spark of that greatness of mind which you say he possesses, though he may not adopt your advice, he must respect the adviser.” \\n\\n \\n\\n As Wallace pressed the hand of his new friend, to leave him to repose, a messenger entered from Lord Mar, to request the regent’s presence in his closet. He found him with Lord de Warenne. The latter presented him with another dispatch from the Prince of Wales. It was to say, that news had reached him of Wallace’s design to attack the castles garrisoned by England, on the eastern coast. Should this information prove true, he (the prince) declared that, as a punishment for such increasing audacity, he would put Lord Douglas into closer confinement; and while the Southron fleets would inevitably baffle Wallace’s attempts, the moment the exchange of prisoners was completed on the borders, an army from England should enter Scotland, and ravage it with fire and sword. \\n\\n \\n\\n When Wallace had heard this dispatch, he smile and said, “The deed is done, my Lord de Warenne. Both the castles and the fleets are taken; and what punishment must we now expect from this terrible threatener?” \\n\\n \\n\\n “Little from him, or his headlong counselors,” replied De Warenne; “but Thomas Earl of Lancaster, the king’s nephew, is come from abroad with a numerous army. He is to conduct the Scottish prisoners to the borders, and then to fall upon Scotland with all his strength, unless you previously surrender, not only Berwick, but Stirling, and the whole of the district between the Forth and the Tweed, into his hands.” \\n\\n \\n\\n “My Lord de Warenne,” replied Wallace, “you can expect but one return to these absurd demands. I shall accompany you myself to the Scottish borders, and there made my reply.” \\n\\n \\n\\n De Warenne, who did indeed look for this answer, replied, “I anticipated that such would be your determination, and I have to regret that the wild counsels which surround my prince, precipitate him into conduct which must draw much blood on both sides, before his royal father’s presence can regain what he has lost.” \\n\\n \\n\\n “Ah, my lord,” replied Wallace, “is it to be nothing but war? Have you now a stronghold of any force in all the Highlands? Is not the greater part of the Lowlands free? And before this day month, not a rood of land in Scotland is likely to hold a Southron soldier. We conquer, but it is for our own. Why then this unreceding determination to invade us? Not a blade of grass would I disturb on the other side of the Cheviot, if we might have peace. Let Edward yield to that, and though he has pierced us with many wounds, we will yet forgive him.” \\n\\n \\n\\n De Warenne shook his head; “I know my king too well to expect pacific measures. He may die with the sword in his hand; but he will never grant an hour’s repose to this country till it submits to his scepter.” \\n\\n \\n\\n “Then,” replied Wallace, “the sword must be the portion of him and his! Ruthless tyrant! If the blood of Abel called for vengeance on his murderer, what must be the vials of wrath which are reserved for thee?” \\n\\n \\n\\n A flush overspread the face of De Warenne at this apostrophe; and forcing a smile, “The strict notion of right,” said he, “is very well in declamation, but how would it crop the wings of conquerors, and shorten the warrior’s arm, did they measure by this rule!” \\n\\n \\n\\n “How would it, indeed!” replied Wallace; “and that they should is most devoutly to be wished. All warfare that is not defensive is criminal; and he who draws his sword to oppress, or merely to aggrandize, is a murderer and a robber. This is the plain truth, Lord de Warenne.” \\n\\n \\n\\n “I have never considered it in that light,” returned the earl, “nor shall I turn philosopher now. I revere your principle, Sir William Wallace; but it is too sublime to be mine. Nay, nor would it be politic for one who holds his possessions in England by the right of conquest to question the virtue of the deed. By the sword my ancestors gained their estates; and with the sword I have no objection to extend my territories.” \\n\\n \\n\\n Wallace now saw that De Warenne, though a man of honor, was not one of virtue. Though his amiable nature made him gracious in the midst of hostility, and his good dispositions would not allow him to act disgracefull in any concern, yet duty to God seemed a poet’s flight to him. Educated in the forms of religion, without knowing its spirit, he despised them; and believing the Deity too wise to be affected by mere virtuous shows of any kind, his ignorance of the sublime benevolence, which disdains not to provide food even for the “sparrow ere it falls,” made him think the Creator of all too great to care about the actions of men; hence, being without the true principles of good-virtue, as virtue, was nonsense to Earl de Warenne. \\n\\n \\n\\n Wallace did not answer his remark, and the conference soon closed. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1328/39927.html","bookId":1473,"book":{"id":1473,"title":"The Scottish Chiefs","description":"简介： Do the traitors think, cried Wallace, that by robbing Scotland of her annals, and of that stone, that they really deprive her of her palladium? Fools fools Scotland\u0027s history is in the memories of her sons; her palladium is in their hearts; and Edwar...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1328","creation":"Aug 1, 2019 12:25:11 AM","modification":"Aug 1, 2019 12:25:11 AM"}}
