{"id":22924,"no":49,"title":"Chapter 49. Stanmore.","content":"The gathering word was dispatched from chief to chief, to call the clans of the Highlands to meet their regent by a certain day in Clydesdale. Wallace himself set forward to summon the strength of the Lowlands; but at Kinclavin Castle, on the coast of Fife, he was surprised with another embassy from Edward-a herald, accompanied by that Sir Hugh le de Spencer who had conducted himself so insolently on his first embrassage. On his entering the chamber where the regent sat with the chiefs who had accompanied him from Perthsire, the two English men walked forward; but before the herald could pay the customary respects, Le de Spencer advanced to Wallace; and to the price of a little mind, elated at being empowered to insult with impunity, he broke forth: “Sir William Wallace, the contumely with which the embassadors of Prince Edward were treated, is so resented by the King of England, that he invests his own majesty in my person to tell you, that your treasons have filled up their measure! that now, in the plenitude of his continental victories, he descends upon Scotland, to annihilate this rebellious nation; and-” “Stop, Sir Hugh le de Spencer,” cried the herald, touching him with his scepter; “whatever may be the denunciations with which our sovereign has intrusted you, you must allow me to perform my duty before you declare them. And thus I utter the gracious message with which his Majesty has honored my mouth.” He then addressed Wallace; and in the king’s name, accusing him of rebellion, and of unfair and cruel devastations made in Scotland and in England, promised him pardon for all if he would immediately disband his followers and acknowledge his offense. Wallace motioned with his hand for his friends to keep silence (for he perceived that two or three of the most violent were ready to break forth in fierce defiance of King Edward), and being obeyed, he calmly replied to the herald: “When we were desolate, your king came to us as a comforter, and he put us in chains! While he was absent, I invaded his country as an open enemy. I rifled your barns, but it was to feed a people whom his robberies had left to perish! I marched through your lands, I made your soldiers fly before me; but what spot in all your shores have I made black with the smoke of ruin? I leave the people of Northumberland to judge between me and your monarch. And that he never shall be mine or Scotland’s, with God’s blessing on the right, our deeds shall further prove!” “Vain and ruinous determination!” exclaimed Le de Spencer; “King Edward comes against you, with an army that will reach from sea to sea. Wherever the hoofs of his war-horse strike, there grass never grows again. The sword and the fire shall make a desert of this devoted land; and your arrogant head, proud Scot, shall bleed upon the scaffold!” “He shall first see my fires, and meet my sword in his own fields,” returned Wallace; “and if God continues my life, I will keep my Easter in England, in despite of King Edward, and of all who bear armor in his country!” As he spoke he rose from his chair, and bowing his head to the herald, the Scottish marshals conducted the embassadors from his presence. Le de Spencer twice attempted to speak, but the marshals would not allow him. They said that the business of the embassy was now over; and should he presume further to insult their regent, the privilege of his official character should not protect him from the wrath of the Scots. Intimidated by the frowning brows and nervous arms of all around, he held his peace, and the doors were shut on him. Wallace foresaw the heavy tempest to Scotland threatened by these repeated embassies. He perceived that Edward, by sending overtures which he knew could not be accepted-by making a show of pacific intentions, meant to throw the blame of the continuation of hostilities upon the Scots, and so overcome the reluctance of his more equitable nobility, to further persecute a people whom he had made suffer so unjustly. The same insidious policy was likewise meant to change the aspect of the Scottish cause in the eyes of Philip of France, who had lately sent congratulations to the regent, on the victory of Cambus–Kenneth; and by that means deprive him of a powerful ally and zealous negotiator for an honorable peace. To prevent this last injury, Wallace dispatched a quick-sailing vessel with Sir Alexander Ramsay, to inform King Philip of the particulars of Edward’s proposals, and of the consequent continued warfare. On the twenty-eighth of February, Sir William Wallace joined Lord Andrew Murray, on Bothwell Moor, where he had the happiness of seeing his brave friend again lord of the domains he had so lately lost in the Scottish cause. Wallace did not visit the castle. At such a crisis, he forbore to unnerve his mind, by awakening the griefs which lay slumbering at the bottom of his heart. Halbert came from his convent once more to look upon the face of his beloved master. The meeting cost Wallace many agonizing pangs, but he smiled on his faithful servant. He pressed the venerable form in his manly arms, and promised him news of his life and safety. “May I die,” cried the old man, “ere I hear it is otherwise! But youth is no warrant for life; the vigor of those arms cannot always assure themselves of victory; and should you fall, where would be our country?” “With a better than I,” returned the chief, “in the arms of God. He will fight for Scotland when Wallace is laid low.” Halbert wept. But the trumpet sounded for the field. He blessed his lord, and they parted forever. A strong force from the Highlands joined the troops from Stirling; and Wallace had the satisfaction of seeing before him thirty thousand well-appointed men eager for the fight. With all Scotland pressing on his heart, his eye lingered for a moment on the distant towers of Bothwell; but not delaying a moment, he placed himself at the head of his legions, and set forth through a country now budding with all the charms of the cultivation he had spread over it. In the midst of a fine glen of renovated corn fields, he was met by a courier from Sir Roger Kirkpatrick, with information that the Northumbrians, being apprised of King Edward’s approach, were assembling in immense bodies; and having crossed the debatable land in the night, had driven Sir Eustace Maxwell, with great loss, into Carlaveroch; and though harassed by Kirkpatrick himself, were ravaging the country as far as Dumfries. The letter of the brave knight added, “These Southron thieves blow the name of Edward before them, and with its sound have spell-bound the courage of every soul I meet. Come then, valiant Wallace, and conjure it down again, else I shall not be surprised if the men of Annandale bind me hand and foot, and deliver me up to Algernon Percy (the leader of this inroad), to purchase mercy to their cowardice.” Wallace made no reply to this message, and proclaiming to his men that the enemy were in Dumfriesshire, every foot was put to the speed; and in a short time they arrived on the ridgy summits of the eastern mountains of Clydesdale. His troops halted for rest near the village of Biggar; and it being night, he ascended to the top of the highest craig, and lighted a fire, whose far-streaming light he hoped would send the news of his approach to Annandale. The air being calm and clear, the signal rose in such a long pyramid of flame, that distant shouts of rejoicing were heard breaking the deep silence of the hour. A moment after a hundred answering beacons burned along the horizon. Torthorald saw the propitious blaze; he showed it to his terrified followers. “Behold that hill of fire!” cried he, “and cease to despair.” “Wallace comes!” was their response; “and we will do or die!”39 39 The mountain from which this beacon sent its rays has from that hour been called Tinto or Tintoc (which signifies the Hill of Fire), and is yet regarded by the country people with a devotion almost idolatrous. Its height is about 2,260 feet from the sea. Day broke upon Wallace as he crossed the heights of Drumlaurig, and pouring his thousands over the almost deserted valleys of Annandale, like a torrent he swept the invaders back upon their steps. He took young Percy prisoner, and leaving him shut up in Lochmaben, drove his flying vassals far beyond the borders. Annandale again free, he went into its various quarters, and summoning the people (who now crept from their caves and woods, to shelter under his shield), he reproved them for their cowardice; and showed them, that unless every man possesses a courage equal to his general, he must expect to fall under the yoke of the enemy. “Faith in a leader is good,” said he; “but not such a faith as leaves him to act, without yourselves rendering that assistance to your own preservation, which Heaven itself commands. When absent from you in person, I left my spirit with you in the brave Knights of Carlaveroch and Torthorald, and yet you fled. Had I been here, and you done the same, the like must have been the consequence. What think you is in my arm, that I should alone stem your enemies? The expectation is extravagant and false. I am but the head of the battle, you are the aims; if you shrink, I fall, and the cause is ruined. You follow my call to the field, you fight valiantly, and I win the day! Respect then yourselves; and believe that you are the sinews, the nerves, the strength of Sir William Wallace!” Some looked manfully up at this exhortation; but most hung their heads in remembered shame, while he continued: “Dishonor not your fathers and your trust in God by relying on any one human arm, or doubting that from heaven. Be confident that while the standard of true liberty is before you, you fight under God’s banner. See how I in that faith drove these conquering Northumbrians before me like frighted roes. You might, and must do the same, or the sword of Wallace is drawn in vain. Partake my spirit, brethren of Annandale; fight as stoutly over my grave as by my side, or before the year expires you will again be the slaves of Edward.” Such language, while it covered the fugitives with confusion of face, awoke emulation in all to efface with honorable deeds the memory of their disgrace. With augmented forces he therefore marched into Cumberland; and having drawn up his array between a river and a high ground, which he covered with archers, he stood prepared to meet the approach of King Edward. But Edward did not appear till late in the next day; and then the Scots descried his legions advancing from the horizon to pitch their vanguard on the plain of Stanmore. Wallace knew that for the first time he was now going to pit his soldiership against that of the greatest general in Christendom. But he did not shrink from measuring him arm to arm and mind to mind, for the assurance of his cause was in both. His present aim was to draw the English toward the Scottish lines, where, at certain distances, he had dug deep pits; and having covered them lightly with twigs and loose grass, left them as traps for the Southron cavalry; for in cavalry, he was told by his spies, would consist the chief strength of Edward’s army. The waste in which Wallace had laid the adjoining counties, rendered the provisioning of so large a host difficult; and besides, as it was composed of a mixed multitude from every land on which the King of England had set his invading foot, harmony could not be expected to continue amongst its leaders. Delay was therefore an advantage to the Scottish regent; and observing that his enemy held back, as if he wished to draw him from his position, he determined not to stir, although he might seem to be struck with awe of so great an adversary. To this end he offered him peace, hoping either to obtain what he asked (which he did not deem probable), or, by filling Edward with an idea of his fear, urge him to precipitate himself forward, to avoid the danger of a prolonged sojourn in so barren a country, and to take Wallace, as he might think, in his panic. Instructing his heralds what to say, he sent them on to Roycross, near which the tent of the King of England was pitched. Supposing that his enemy was now at his feet, and ready to beg the terms he had before objected, Edward admitted the embassadors, and bade them deliver their message. Without further parley the herald spoke. “Thus saith Sir William Wallace. Were it not that the kings and nobles of the realm of Scotland have ever asked redress of injuries before they sought revenge, you King of England, and invader of our country, should not now behold orators in your camp, persuading concord, but an army in battle array, advancing to the onset. Our lord regent being of the ancient opinion of his renowned predecessors, that the greatest victories are never of such advantage to a conqueror as an honorable and bloodless peace, sends to offer this peace to you at the price of restitution. The lives you have rifled from us you cannot restore, but the noble Lord Douglas, whom you now unjustly detain a prisoner, we demand; and that you retract those claims on our monarchy, which never had existence till ambition begot them on the basest treachery. Grant these just requisitions, and we lay down our arms; but continue to deny them, and our nations is ready to rise to a man, and with heart and hand avenge the injuries we have sustained. You have wasted our lands, burned our towns, and imprisoned our nobility. Without consideration of age or condition, women, children, and feeble old men have unresisting fallen by your sword. And why was all this? Did our confidence in your honor offend you, that you put our chieftains in durance, and deprived our yeomanry of their lives? Did the benedictions with which our prelates hailed you as the arbitrator between our princes, raise your ire, that you burned their churches, and slew them on the altars? These, O king, were thy deeds, and for these William Wallace is in arms. But yield us the peace we ask-withdraw from our quarters-relinquish your unjust pretensions, and we shall once more consider Edward of England as the kinsman of Alexander the Third, and his subjects the friends and allies of our realm.” Not in the least moved by this address, Edward contemptuously answered, “Intoxicated by a transitory success, your leader is vain enough to suppose that he can discomfort the King of England, as he has done his unworthy officers, by fierce and insolent words; but we are not so weak as to be overthrown by a breath, nor so base as to bear argument from a rebel. I come to claim my own, to assert my supremacy over Scotland; and it shall acknowledge its liege lord, or be left a desert, without a living creature to say, ‘This was a kingdom.’ Depart, this is my answer to you; your leader shall receive his at the point of my lance.” Wallace, who did not expect a more favorable reply, ere his embassadors returned had marshaled his lines for the onset. Lord Bothwell, with Murray, his valiant son, took the lead on the left wing; Sir Eustace Maxwell and Kirkpatrick commanded on the right. Graham (in whose quick observation and promptitude to bring it to effect, Wallace placed the first confidence) held the reserve behind the woods; and the regent himself, with Edwin and his brave standard-bearer, occupied the center. Having heard the report of his messengers, he repeated to his troops the lines, he exhorted them to remember that on that day the eyes of all Scotland would be upon them. They were the first of their country who had gone forth to meet the tyrant in a pitched battle; and in proportion to the danger they confronted, would be their meed of glory. “But it is not for renown merely that you are called upon to fight this day,” said he; “your rights, your homes are at stake. You have no hope of security for your lives but in an unswerving determination to keep the field, and let the world see how much more might lies in the arms of a few contending for their country and herediatry liberties, than in hosts which seek for blood and spoil. Slavery and freedom lie before you! Shrink but one backward step, and yourselves are in bondage, your wives become the prey of violence. Be firm-trust Him who blesses the righteous cause, and victory will crown your arms!” Though affecting to despise his young opponent, Edward was too good a general really to condemn an enemy who had so often proved himself worthy of respect; and therefore, by declaring his determination to put all the Scottish chieftains to death, and to transfer their estates to his conquering officers, he stimulated their avarice, as well as love of fame, and with every passion in arms, they pushed to the combat. Wallace stood unmoved. Not a bow was drawn till the impetuous squadrons, in full charge toward the flanks of the Scots, fell into the pits; then it was that the Highland archers on the hill launched their arrows; the plunging horses were instantly overwhelmed by others who could not be checked in their career. New showers of darts rained upon them, and, sticking into their flesh, made them rear and roll upon their riders; while others, who were wounded, but had escaped the pits, flew back in rage of pain upon the advancing infantry. A confusion ensued, so perilous, that the king thought it necessary to precipitate himself forward, and in person attack the main body of his adversary, which yet stood inactive. Giving the spur to his charger, he ordered his troops to press on over the struggling heaps before them; and being obeyed, with much difficulty and great loss, he passed the first range of pits; but a second and wider awaited him; and there, seeing his men sink into them by squadrons, he beheld the whole army of Wallace close in upon them. Terrific was now the havoc. The very numbers of the Southrons, and the mixed discipline of their army, proved its bane. In the tumult they hardly understood the orders which were given; and some mistaking them, acted so contrary to the intended movements, that Edward, galloping from one end of the field to the other, appeared like a frantic man, regardless of every personal danger, so that he could but fix others to front the same tempest of death with himself. His officers trembled at every step he took, for fear that some of the secret pits should ingulf him. However, the unshrinking courage of their monarch rallied a part of the distracted army, which, with all the force of desperation, he drove against the center of the Scots. But at this juncture, the reserve under Graham, having turned the royal position, charged him in the rear; and the archers redoubling their discharge of artillery, the Flanderkins, who were in the van of Edward, suddenly giving way with cries of terror, the amazed king found himself obliged to retreat, or run the risk of being taken. He gave a signal-the first of the kind he had ever sounded in his life-and drawing his English troops around him, after much hard fighting, fell back in tolerable order beyond the confines of his camp. The Scots were eager to pursue him, but Wallace checked the motion. “Let us not hunt the lion till he stand at bay!” cried he. “He will retire far enough from the Scottish borders, without our leaving this vantage ground to drive him.” What Wallace said came to pass. Soon no vestige of a Southron soldier, but the dead which strewed the road, was to be seen from side to side of the wide horizon. The royal camp was immediately seized by the triumphant Scots; and the tent of King Edward, with its costly furniture, was sent to Stirling as a trophy of the victory.","sourceLink":"http://novel.tingroom.com/jingdian/1328/39938.html","bookId":1473,"book":{"id":1473,"title":"The Scottish Chiefs","description":"简介： Do the traitors think, cried Wallace, that by robbing Scotland of her annals, and of that stone, that they really deprive her of her palladium? Fools fools Scotland\u0027s history is in the memories of her sons; her palladium is in their hearts; and Edwar...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1328","creation":"Aug 1, 2019 12:25:11 AM","modification":"Aug 1, 2019 12:25:11 AM"}}
