{"id":72913,"no":22,"title":"Page 22","content":"Emily dropped her phone in her purse. Forget saving her mom’s baby Jesus. She was going to the dark side.\\n\\n Chapter 11\\n\\n The True Meaning of Christmas\\n\\n “Hey, Santa!” Cassie’s voice rang out just as Emily was changing out of her Santa suit the next day. She poked her head inside the gingerbread house. “Want to grab some food with me?”\\n\\n “Uh, sure,” Emily answered, kicking the ugly Santa boots off her feet. They had a slight chemical smell from the anti-bedbug treatments absolutely everything in the mall had been sprayed with. All kinds of signs hung around the mall, saying things like BEDBUG FREE! and TREATED WITH ENVIRONMENTALLY FRIENDLY CHEMICALS! Still, even though the mall had been cleansed of bedbugs—not that there had ever been any to begin with—the lines at Santa Land had been thin today. There had been only a smattering of people wandering the promenade as well, quite a few of them suspiciously scratching their heads and necks.\\n\\n Emily emerged from the gingerbread house just as Mrs. Meriwether was locking up the big Frosty and Rudolph statues so no one would steal them. Cassie was waiting by the gate; she had changed into a pair of black jeans, a faded black AC/DC T-shirt, and red, thick-soled John Fluevogs. It all made her newly blond hair look even whiter.\\n\\n “Where are the others?” Emily asked, looking around.\\n\\n Cassie shrugged. “Is Bellissima okay?”\\n\\n “That’s fine,” Emily answered, feeling pleasantly surprised that Cassie wanted to hang out with her alone.\\n\\n As Emily let herself out of the gate, she glanced over her shoulder. Luckily Mrs. Meriwether was still occupied with Rudolph and didn’t notice that Emily was hanging out with Cassie. Emily couldn’t tell her and her mother that she was giving up spying. Hopefully, in a week or so, she’d just say she hadn’t been invited along on any of their pranks. It would look like she’d tried and failed instead of deliberately giving up.\\n\\n As for the baby Jesus paying for Christmas gifts, well, Emily had some thoughts about that, too. She’d received her first Santa Land paycheck yesterday and was astonished to see that Santa paid fifteen dollars an hour—way more than she would have made in another random holiday job. If her family was really hurting for cash this Christmas, she would hand over her earnings to her mom for gifts.\\n\\n Bellissima, a little Italian bistro, was at the far end of the corridor. Crooning, romantic music—a nice change from Christmas carols—played over the speakers, and the inside of the restaurant featured lots of terra-cotta tile, roughly plastered, goldenrod-colored walls, and little tables covered with black-and-white checked cloths. Unlike the rest of the mall, Bellissima was filled with diners and patrons at the bar. Maybe people didn’t think bedbugs could infiltrate restaurants.\\n\\n A petite waitress with a high ponytail led the girls to a table in the corner and poured them glasses of sparkling water. “I’m probably just going to get a salad,” Cassie said, opening the big laminated menu.\\n\\n “Oh, me, too,” Emily said, even though she wasn’t the type of girl who ordered salads at restaurants.\\n\\n They sat for a moment, studying the menu, and then Cassie tapped her lip. “Although the cannolis look really good, too.”\\n\\n “Ooh, let’s get them instead,” Emily squealed.\\n\\n “Whew.” Cassie pressed a hand on her chest. “I was afraid you were one of those obsessive dieter types.”\\n\\n “Me?” Emily held back a laugh. “Um, definitely not.”\\n\\n The girls gave their orders, and the waitress swished away. Emily gazed around the restaurant, recognizing a few people she knew from school. Mason Byers and Lanie Iler sat in a corner booth, sipping Italian sodas. Kirsten Cullen and her family were eating bowls of pasta.\\n\\n “So did you have fun last night?” Cassie swirled the ice around the water glass with her straw.\\n\\n “Definitely,” Emily admitted. “Those pictures of Stripper Santa were priceless.”\\n\\n “Totally.” Cassie grinned.\\n\\n “So how long have you known the other girls, anyway?” Emily asked. “Have you guys been friends for a long time?”\\n\\n Cassie cast her eyes to the right, thinking. “We met last year—we were elves at the Santa Land at the White Birch Mall, which Sophie’s dad used to manage, and decided to do it again this year. It’s kind of a big joke between us. But we didn’t go to the same high schools or anything. I went to Rosewood Day.”\\n\\n “I go there, too,” Emily blurted.\\n\\n A small smile appeared on Cassie’s face. “I know you do. You were friends with Alison DiLaurentis, weren’t you?”\\n\\n Emily pressed her lips together. Just hearing Ali’s name made her heart beat faster.\\n\\n “I made the connection at my party,” Cassie explained. “I remember you. I used to play field hockey with Ali on the JV team at Rosewood Day. She was really good.”\\n\\n “I remember you, too.” Emily fiddled with the cloth napkin on her lap. “Ali thought you were awesome. She used to talk about you all the time.”\\n\\n Cassie pressed her tongue between her teeth, seeming a little embarrassed by this. “We had fun together. Ali was definitely mature beyond her years—all of us said so. We couldn’t believe she was in seventh grade.” She twisted a thick leather bracelet around her wrist. “I couldn’t believe it when I found out about what Ian had done to her. He was a grade ahead of me. I only knew him by sight, but he always seemed so nice to everyone. Not the kind of guy who would . . . you know. But what kind of freak dates a seventh grader as a senior? That’s just . . . wrong.”\\n\\n “I know.” Emily’s eyes inadvertently filled with tears. She wanted to claim it was the strong odor of Italian spices wafting in the air, tickling her nostrils, but she knew it wasn’t true.\\n\\n “She used to talk about you, you know,” Cassie said.\\n\\n Emily lifted her head. “Really?”\\n\\n “Uh-huh. She said you were her favorite of all her friends. You guys had a special bond.”\\n\\n “We did,” Emily said, her cheeks warming. “I miss her so much.”\\n\\n “I do, too.” Cassie placed her hand over Emily’s. “I’ve changed so much since Ali went missing.”\\n\\n A buzzer sounded from the kitchen. A group of women at a nearby table broke into a peal of laughter. Emily blotted her eyes with a napkin and peeked at Cassie’s blond hair, heavily lined eyes, and the multiple piercings in her ears. Was it possible Ali’s disappearance had made Cassie drop her perfect, preppy image and turn into a bad girl? It certainly had made Emily rethink a lot of things.\\n\\n “I’ve never had another friend like Ali,” Emily admitted. “Even though she could be mean, I would have done anything for her.”\\n\\n The waitress appeared with two cannolis, and Emily and Cassie dove into them at once. Cream oozed onto the plate as Emily cut into the pastry with her fork. “This is frickin’ delicious,” Cassie murmured.\\n\\n “Much better than a salad,” Emily said.\\n\\n Then Cassie laid down her fork, leaned forward on her elbows, and gave Emily a serious look. “So listen. We’ve had a lot of fun with you, Santa. At first we weren’t sure about you—it was so weird that Mrs. Meriwether brought in a girl to be Santa, and she kept whispering around you, and we were sure there was something weird going on. But you’ve proved us wrong. So we want to invite you somewhere very special tonight.”\\n\\n Emily almost choked on her bite of cannoli. Her heart began to hammer. A tiny voice inside of her pleaded, Don’t let it be a pranking mission. Anything but that.\\n\\n Cassie licked a bit of cream off her spoon. “Have you heard the stories about someone in Rosewood messing with people’s Christmas decorations?”\\n\\n Emily’s heart sank. “I guess so.”\\n\\n “Well, that’s us.” Cassie thumbed her chest proudly. “Me, Lola, Sophie, and Heather. We call ourselves the Merry Elves. And tonight, we’re going to pull our biggest prank yet.” She scootched forward into her chair, her voice dropping to a whisper. “We’re going to steal all the presents under the big tree at the Rosewood Country Club. All of the decorations, too. It’s perfect timing, because tomorrow morning is the annual brunch where everyone opens their gifts. It’s going to be just like How the Grinch Stole Christmas! Let’s see if the snotty rich people gather around the tree when it’s bare.” She rolled her eyes. “Anyway, we’d like for you to help.”\\n\\n Emily kept her gaze trained on her half-eaten cannoli. “I don’t know how I feel about stealing.”\\n\\n “Oh, we’re not stealing the stuff.” Cassie waved her fork in the air. “We’re just moving it to the tennis courts. They can move it back the next day. It’s just to mess with them. Screw with their perspective. It’s like how, a couple of weeks ago, we stole this baby Jesus from the Nativity scene in front of a church. We wanted people to see the empty cradle in the manger and really think about things—what the holidays mean, what the symbols mean.” She paused. “It was also really funny. Heather had to ride in the car with the Jesus on her lap. She kept screaming about how it was bad karma and that God was going to strike her down.”\\n\\n It took all of Emily’s willpower not to tell Cassie that it was her mother’s baby Jesus she was talking about. On the bright side, it didn’t sound like Cassie and the others had smashed the baby Jesus to pieces. “So the pranks aren’t about ruining people’s holidays?” she asked timidly.\\n\\n Cassie popped the last bite of cannoli into her mouth. “Not necessarily. It’s more to draw attention to the commercialism of it. All good pranksters have a point to their actions. I mean, we’re not complete thugs.” She touched Emily’s hand. “We’ll have so much fun, I promise. Think of it as a Christmas crusade.”\\n\\n The bites of cannoli churned in Emily’s stomach, and she stared out at the mall’s promenade, with its massive Christmas tree and millions of shops. Maybe Cassie had a point. She thought about the line of kids at Santa Land, all of them asking for way too many things, and their parents nodding encouragingly. And there were all those stories on the news of shoppers tackling one another to get the last hot toy at Target or Walmart. All those commercials that made you feel terrible if you didn’t buy your beloved a diamond ring or a Lexus or an It bag for Christmas. Even her mother’s desperation to get the baby Jesus back: She was going to sell it in order to buy Christmas presents so she could turn this Christmas into, yet again, the best Christmas ever. Did it really matter when they had the most important thing: a healthy, happy family that was spending the holiday together?\\n\\n Her fork dropped to her plate with a loud, clear clang. “Okay,” she decided. “I’m in. Let’s do it.”\\n\\n Chapter 12\\n\\n All the Whos Down in Whoville\\n\\n “Should we have our usual turkey for Christmas dinner or try something else, like steak?” Mrs. Fields asked as she spooned squares of lasagna onto her children’s plates that night for dinner. “Or how about if we went out for dinner this Christmas Eve? That would be special, wouldn’t it?” \\n\\n","sourceLink":"https://allnovel.net/pretty-little-secrets-pretty-little-liars-4-5/page-22.html","bookId":2392,"book":{"id":2392,"title":"Pretty Little Secrets (Pretty Little Liars #4.5)","description":"Storyline: Pretty Little Secrets (Pretty Little Liars #4.5) \\n Rewind to junior year in Rosewood, Pennsylvania, to a winter break no one has ever heard about. . . . \\n Fat snowflakes fall onto manicured lawns, quilted stockings hang over marble fireplaces, and everyone is at peace, especially Hanna, Emily, Aria, and Spencer. Now that Alison’s murderer is in jail and A is dead, they can finally relax. Little do they know there’s a new A in town. . . . \\n Rule number one of being an effective stalker: Get to know your prey. So I watch these liars day and night, keeping an eye on the trouble they get into, the messes they make, and the secrets they keep. Hanna’s desperate for a very personal session with her gym trainer. Emily is number one on Santa’s naughty list. Aria’s old flame from Iceland is about to land her in hot water. And Spencer’s resorting to some backhanded tactics to get what she wants. \\n What happens on holiday break stays on holiday break—right? But guess what. I saw. And now I’m telling. \\n Taking place between \"Unbelievable\" and \"Wicked,\" \"Pretty Little Secrets\" is a very special \"Pretty Little Liars\" tale revealing the liars’ never-before-seen misadventures over their junior-year winter break.\\n","cover":"https://allnovel.net/images/pretty-little-secrets-pretty-little-liars-4-5.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/pretty-little-secrets-pretty-little-liars-4-5.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:25:25 AM"}}
