{"id":5437,"no":5,"title":"Chapter 5","content":"5:1 [hgb] 我 要 为 我 所 亲 爱 的 唱 歌 ， 是 我 所 爱 者 的 歌 ， 论 他 葡 萄 园 的 事 。 我 所 亲 爱 的 有 葡 萄 园 ， 在 肥 美 的 山 冈 上 。 \\n\\n [kjv] Now will I sing to my wellbeloved a song of my beloved touching his vineyard. My wellbeloved hath a vineyard in a very fruitful hill: \\n\\n [bbe] Let me make a song about my loved one, a song of love for his vine-garden. My loved one had a vine-garden on a fertile hill: \\n\\n 5:2 [hgb] 他 刨 挖 园 子 ， 捡 去 石 头 ， 栽 种 上 等 的 葡 萄 树 ， 在 园 中 盖 了 一 座 楼 ， 又 凿 出 压 酒 池 。 指 望 结 好 葡 萄 ， 反 倒 结 了 野 葡 萄 。 \\n\\n [kjv] And he fenced it, and gathered out the stones thereof, and planted it with the choicest vine, and built a tower in the midst of it, and also made a winepress therein: and he looked that it should bring forth grapes, and it brought forth wild grapes. \\n\\n [bbe] And after working the earth of it with a spade, he took away its stones, and put in it a very special vine; and he put up a watchtower in the middle of it, hollowing out in the rock a place for the grape-crushing; and he was hoping that it would give the best grapes, but it gave common grapes. \\n\\n 5:3 [hgb] 耶 路 撒 冷 的 居 民 ， 和 犹 大 人 哪 ， 请 你 们 现 今 在 我 与 我 的 葡 萄 园 中 断 定 是 非 。 \\n\\n [kjv] And now, O inhabitants of Jerusalem, and men of Judah, judge, I pray you, betwixt me and my vineyard. \\n\\n [bbe] And now, you people of Jerusalem and you men of Judah, be the judges between me and my vine-garden. \\n\\n 5:4 [hgb] 我 为 我 葡 萄 园 所 作 之 外 ， 还 有 什 么 可 作 的 呢 ？ 我 指 望 结 好 葡 萄 ， 怎 么 倒 结 了 野 葡 萄 呢 ？ \\n\\n [kjv] What could have been done more to my vineyard, that I have not done in it? wherefore, when I looked that it should bring forth grapes, brought it forth wild grapes? \\n\\n [bbe] Is there anything which might have been done for my vine-garden which I have not done? why then, when I was hoping for the best grapes did it give me common grapes? \\n\\n 5:5 [hgb] 现 在 我 告 诉 你 们 ， 我 要 向 我 葡 萄 园 怎 样 行 。 我 必 撤 去 篱 笆 ， 使 它 被 吞 灭 ， 拆 毁 墙 垣 ， 使 它 被 践 踏 。 \\n\\n [kjv] And now go to; I will tell you what I will do to my vineyard: I will take away the hedge thereof, and it shall be eaten up; and break down the wall thereof, and it shall be trodden down: \\n\\n [bbe] And now, this is what I will do to my vine-garden: I will take away the circle of thorns round it, and it will be burned up; its wall will be broken down and the beasts of the field will go through it; \\n\\n 5:6 [hgb] 我 必 使 它 荒 废 ， 不 再 修 理 ， 不 再 锄 刨 。 荆 棘 蒺 藜 倒 要 生 长 。 我 也 必 命 云 不 降 雨 在 其 上 。 \\n\\n [kjv] And I will lay it waste: it shall not be pruned, nor digged; but there shall come up briers and thorns: I will also command the clouds that they rain no rain upon it. \\n\\n [bbe] And I will make it waste; its branches will not be touched with the knife, or the earth worked with the spade; but blackberries and thorns will come up in it: and I will give orders to the clouds not to send rain on it. \\n\\n 5:7 [hgb] 万 军 之 耶 和 华 的 葡 萄 园 ， 就 是 以 色 列 家 ， 他 所 喜 爱 的 树 ， 就 是 犹 大 人 。 他 指 望 的 是 公 平 ， 谁 知 倒 有 暴 虐 （ 或 作 倒 流 人 血 ） 。 指 望 的 是 公 义 ， 谁 知 倒 有 冤 声 。 \\n\\n [kjv] For the vineyard of the LORD of hosts is the house of Israel, and the men of Judah his pleasant plant: and he looked for judgment, but behold oppression; for righteousness, but behold a cry. \\n\\n [bbe] For the vine-garden of the Lord of armies is the people of Israel, and the men of Judah are the plant of his delight: and he was looking for upright judging, and there was blood; for righteousness, and there was a cry for help. \\n\\n 5:8 [hgb] 祸 哉 ， 那 些 以 房 接 房 ， 以 地 连 地 ， 以 致 不 留 余 地 的 ， 只 顾 自 己 独 居 境 内 。 \\n\\n [kjv] Woe unto them that join house to house, that lay field to field, till there be no place, that they may be placed alone in the midst of the earth! \\n\\n [bbe] Cursed are those who are joining house to house, and putting field to field, till there is no more living-space for any but themselves in all the land! \\n\\n 5:9 [hgb] 我 耳 闻 万 军 之 耶 和 华 说 ， 必 有 许 多 又 大 又 美 的 房 屋 ， 成 为 荒 凉 ， 无 人 居 住 。 \\n\\n [kjv] In mine ears said the LORD of hosts, Of a truth many houses shall be desolate, even great and fair, without inhabitant. \\n\\n [bbe] The Lord of armies has said to me secretly, Truly, numbers of great and fair houses will be waste, with no one living in them. \\n\\n 5:10 [hgb] 三 十 亩 葡 萄 园 只 出 一 吧 特 酒 ， 一 贺 梅 珥 谷 种 只 结 一 伊 法 粮 食 。 \\n\\n [kjv] Yea, ten acres of vineyard shall yield one bath, and the seed of an homer shall yield an ephah. \\n\\n [bbe] For ten fields of vines will only give one measure of wine, and a great amount of seed will only give a small measure of grain. \\n\\n 5:11 [hgb] 祸 哉 ， 那 些 清 早 起 来 ， 追 求 浓 酒 ， 留 连 到 夜 深 ， 甚 至 因 酒 发 烧 的 人 。 \\n\\n [kjv] Woe unto them that rise up early in the morning, that they may follow strong drink; that continue until night, till wine inflame them! \\n\\n [bbe] Cursed are those who get up early in the morning to give themselves up to strong drink; who keep on drinking far into the night till they are heated with wine! \\n\\n 5:12 [hgb] 他 们 在 筵 席 上 弹 琴 ， 鼓 瑟 ， 击 鼓 ， 吹 笛 ， 饮 酒 ， 却 不 顾 念 耶 和 华 的 作 为 ， 也 不 留 心 他 手 所 作 的 。 \\n\\n [kjv] And the harp, and the viol, the tabret, and pipe, and wine, are in their feasts: but they regard not the work of the LORD, neither consider the operation of his hands. \\n\\n [bbe] And corded instruments and wind-instruments and wine are in their feasts: but they give no thought to the work of the Lord, and they are not interested in what his hands are doing. \\n\\n 5:13 [hgb] 所 以 我 的 百 姓 ， 因 无 知 就 被 掳 去 。 他 们 的 尊 贵 人 甚 是 饥 饿 ， 群 众 极 其 干 渴 。 \\n\\n [kjv] Therefore my people are gone into captivity, because they have no knowledge: and their honourable men are famished, and their multitude dried up with thirst. \\n\\n [bbe] For this cause my people are taken away as prisoners into strange countries for need of knowledge: and their rulers are wasted for need of food, and their loud-voiced feasters are dry for need of water. \\n\\n 5:14 [hgb] 故 此 ， 阴 间 扩 张 其 欲 ， 开 了 无 限 量 的 口 。 他 们 的 荣 耀 ， 群 众 ， 繁 华 ， 并 快 乐 的 人 ， 都 落 在 其 中 。 \\n\\n [kjv] Therefore hell hath enlarged herself, and opened her mouth without measure: and their glory, and their multitude, and their pomp, and he that rejoiceth, shall descend into it. \\n\\n [bbe] For this cause the underworld has made wide its throat, opening its mouth without limit: and her glory, and the noise of her masses, and her loud-voiced feasters, will go down into it. \\n\\n 5:15 [hgb] 卑 贱 人 被 压 服 ， 尊 贵 人 降 为 卑 ， 眼 目 高 傲 的 人 也 降 为 卑 。 \\n\\n [kjv] And the mean man shall be brought down, and the mighty man shall be humbled, and the eyes of the lofty shall be humbled: \\n\\n [bbe] And the poor man\u0027s head is bent, and the great man goes down on his face, and the eyes of pride are put to shame: \\n\\n 5:16 [hgb] 惟 有 万 军 之 耶 和 华 ， 因 公 平 而 崇 高 ， 圣 者 神 ， 因 公 义 显 为 圣 。 \\n\\n [kjv] But the LORD of hosts shall be exalted in judgment, and God that is holy shall be sanctified in righteousness. \\n\\n [bbe] But the Lord of armies is lifted up as judge, and the Holy God is seen to be holy in righteousness. \\n\\n 5:17 [hgb] 那 时 羊 羔 必 来 吃 草 ， 如 同 在 自 己 的 草 场 ， 丰 肥 人 的 荒 场 被 游 行 的 人 吃 尽 。 \\n\\n [kjv] Then shall the lambs feed after their manner, and the waste places of the fat ones shall strangers eat. \\n\\n [bbe] Then the lambs will get food as in their grass-lands, and the fat cattle will be feasting in the waste places. \\n\\n 5:18 [hgb] 祸 哉 ， 那 些 以 虚 假 之 细 绳 牵 罪 孽 的 人 ， 他 们 又 像 以 套 绳 拉 罪 恶 。 \\n\\n [kjv] Woe unto them that draw iniquity with cords of vanity, and sin as it were with a cart rope: \\n\\n [bbe] Cursed are those who make use of ox-cords for pulling the evil thing, and the bands of a young ox for their sin! \\n\\n 5:19 [hgb] 说 ， 任 他 急 速 行 ， 赶 快 成 就 他 的 作 为 ， 使 我 们 看 看 。 任 以 色 列 圣 者 所 谋 划 的 临 近 成 就 ， 使 我 们 知 道 。 \\n\\n [kjv] That say, Let him make speed, and hasten his work, that we may see it: and let the counsel of the Holy One of Israel draw nigh and come, that we may know it! \\n\\n [bbe] Who say, Let him do his work quickly, let him make it sudden, so that we may see it: let the design of the Holy One of Israel come near, so that it may be clear to us. \\n\\n 5:20 [hgb] 祸 哉 ， 那 些 称 恶 为 善 ， 称 善 为 恶 ， 以 暗 为 光 ， 以 光 为 暗 ， 以 苦 为 甜 ， 以 甜 为 苦 的 人 。 \\n\\n [kjv] Woe unto them that call evil good, and good evil; that put darkness for light, and light for darkness; that put bitter for sweet, and sweet for bitter! \\n\\n [bbe] Cursed are those who give the name of good to evil, and of evil to what is good: who make light dark, and dark light: who make bitter sweet, and sweet bitter! \\n\\n 5:21 [hgb] 祸 哉 ， 那 些 自 以 为 有 智 慧 ， 自 看 为 通 达 的 人 。 \\n\\n [kjv] Woe unto them that are wise in their own eyes, and prudent in their own sight! \\n\\n [bbe] Cursed are those who seem wise to themselves, and who take pride in their knowledge! \\n\\n 5:22 [hgb] 祸 哉 ， 那 些 勇 于 饮 酒 ， 以 能 力 调 浓 酒 的 人 。 \\n\\n [kjv] Woe unto them that are mighty to drink wine, and men of strength to mingle strong drink: \\n\\n [bbe] Cursed are those who are strong to take wine, and great in making mixed drinks! \\n\\n 5:23 [hgb] 他 们 因 受 贿 赂 ， 就 称 恶 人 为 义 ， 将 义 人 的 义 夺 去 。 \\n\\n [kjv] Which justify the wicked for reward, and take away the righteousness of the righteous from him! \\n\\n [bbe] Who for a reward give support to the cause of the sinner, and who take away the righteousness of the upright from him. \\n\\n 5:24 [hgb] 火 苗 怎 样 吞 灭 碎 秸 ， 干 草 怎 样 落 在 火 焰 之 中 ， 照 样 ， 他 们 的 根 必 像 朽 物 ， 他 们 的 花 ， 必 像 灰 尘 飞 腾 。 因 为 他 们 厌 弃 万 军 之 耶 和 华 的 训 诲 ， 藐 视 以 色 列 圣 者 的 言 语 。 \\n\\n [kjv] Therefore as the fire devoureth the stubble, and the flame consumeth the chaff, so their root shall be as rottenness, and their blossom shall go up as dust: because they have cast away the law of the LORD of hosts, and despised the word of the Holy One of Israel. \\n\\n [bbe] For this cause, as the waste of the grain is burned up by tongues of fire, and as the dry grass goes down before the flame, so their root will be like the dry stems of grain, and their flower will go up in dust: because they have gone against the law of the Lord of armies, and have given no honour to the word of the Holy One of Israel. \\n\\n 5:25 [hgb] 所 以 耶 和 华 的 怒 气 向 他 的 百 姓 发 作 ， 他 的 手 伸 出 攻 击 他 们 ， 山 岭 就 震 动 ， 他 们 的 尸 首 在 街 市 上 好 像 粪 土 。 虽 然 如 此 ， 他 的 怒 气 还 未 转 消 ， 他 的 手 仍 伸 不 缩 。 \\n\\n [kjv] Therefore is the anger of the LORD kindled against his people, and he hath stretched forth his hand against them, and hath smitten them: and the hills did tremble, and their carcases were torn in the midst of the streets. For all this his anger is not turned away, but his hand is stretched out still. \\n\\n [bbe] For this reason the wrath of the Lord has been burning against his people, and his hand has been stretched out against them in punishment, and the hills were shaking, and their dead bodies were like waste in the open places of the town. \\n\\n 5:26 [hgb] 他 必 竖 立 大 旗 ， 招 远 方 的 国 民 ， 发 丝 声 叫 他 们 从 地 极 而 来 。 看 哪 ， 他 们 必 急 速 奔 来 。 \\n\\n [kjv] And he will lift up an ensign to the nations from far, and will hiss unto them from the end of the earth: and, behold, they shall come with speed swiftly: \\n\\n [bbe] And he will let a flag be lifted up as a sign to a far-off nation, whistling to them from the ends of the earth: and they will come quickly and suddenly. \\n\\n 5:27 [hgb] 其 中 没 有 疲 倦 的 ， 绊 跌 的 ， 没 有 打 盹 的 ， 睡 觉 的 。 腰 带 并 不 放 松 ， 鞋 带 也 不 折 断 。 \\n\\n [kjv] None shall be weary nor stumble among them; none shall slumber nor sleep; neither shall the girdle of their loins be loosed, nor the latchet of their shoes be broken: \\n\\n [bbe] There is no weariness among them, and no man is feeble-footed: they come without resting or sleeping, and the cord of their shoes is not broken. \\n\\n 5:28 [hgb] 他 们 的 箭 快 利 ， 弓 也 上 了 弦 。 马 蹄 算 如 坚 石 ， 车 轮 好 像 旋 风 。 \\n\\n [kjv] Whose arrows are sharp, and all their bows bent, their horses\u0027 hoofs shall be counted like flint, and their wheels like a whirlwind: \\n\\n [bbe] Their arrows are sharp, and every bow is bent: the feet of their horses are like rock, and their wheels are like a rushing storm. \\n\\n 5:29 [hgb] 他 们 要 吼 叫 像 母 狮 子 ， 咆 哮 像 少 壮 狮 子 。 他 们 要 咆 哮 抓 食 ， 坦 然 叼 去 ， 无 人 救 回 。 \\n\\n [kjv] Their roaring shall be like a lion, they shall roar like young lions: yea, they shall roar, and lay hold of the prey, and shall carry it away safe, and none shall deliver it. \\n\\n [bbe] The sound of their armies will be like the voice of a lion, and their war-cry like the noise of young lions: with loud cries they will come down on their food and will take it away safely, and there will be no one to take it out of their hands. \\n\\n 5:30 [hgb] 那 日 他 们 要 向 以 色 列 人 吼 叫 ， 像 海 浪 ？ ？ 訇 。 人 若 望 地 ， 只 见 黑 暗 艰 难 。 光 明 在 云 中 变 为 昏 暗 。 \\n\\n [kjv] And in that day they shall roar against them like the roaring of the sea: and if one look unto the land, behold darkness and sorrow, and the light is darkened in the heavens thereof. \\n\\n [bbe] And his voice will be loud over him in that day like the sounding of the sea: and if a man\u0027s eyes are turned to the earth, it is all dark and full of trouble; and the light is made dark by thick clouds. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/shuangyu/127/1850.html","bookId":178,"book":{"id":178,"title":"以赛亚书 Isaiah","description":"简介： 1:1 [hgb] 当 乌 西 雅 ， 约 坦 ， 亚 哈 斯 ， 希 西 家 ， 作 犹 大 王 的 时 候 ， 亚 摩 斯 的 儿 子 以 赛 亚 得 默 示 ， 论 到 犹 大 和 耶 路 撒 冷 。 [kjv] The vision of Isaiah the son of Amoz, which he saw concerning Judah and Je...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/127","creation":"Aug 1, 2019 12:18:22 AM","modification":"Aug 1, 2019 12:23:40 AM"}}
