{"id":94453,"no":27,"title":"Page 27","content":"\n He turned and caught her watching him, her smile faint and her eyes distant.\n “What?” Benny asked.\n She blinked, and he thought he saw shutters close behind her eyes. “Nothing.”\n Back in town Benny would have let that go, but in a lot of ways he felt like he had left behind the version of himself who was afraid to ask these kinds of questions. So he said, “No … there was something. The way you were looking at me. What is it?”\n Birds sang in trees for almost five seconds before she answered. “Back in town … on your roof … I asked you if you loved me. Did you mean it?”\n Benny’s mouth went dry. “Yes.”\n “You haven’t said it since.”\n A defensive reply leaped to his lips, but instead he said, “Neither have you.”\n “No,” she admitted, her voice small. She squinted into the morning sunlight. “Maybe … maybe if leaving town had been easier …”\n He waited.\n “… it would be easier to say,” Nix finished. “But out here …”\n “I know,” he said. “I feel it too.”\n “Do you understand it?” she pleaded. “I’ve been trying to, but I can’t put it into the right words.”\n Go for it, whispered the inner voice. Tell her the truth.\n Benny nodded. “I think so. At least … I understand why I haven’t said it. Since we left town, we’ve been in trouble. Our ‘road trip’ hasn’t exactly been a load of fun. Saying ‘I love you’ out here … don’t laugh, but it would feel like taking off my carpet coat and walking out into a crowd of zoms. Saying it out loud just makes me feel vulnerable. Is that stupid?”\n She shook her head. “No, it’s not stupid.”\n “My turn to ask a question,” Benny said, and even though Nix stiffened, he plowed ahead. “Do you wish I hadn’t said it? At all, I mean?”\n Strange lights flickered in the green depths of her eyes. “When you think the time is right,” she said, “try it again and see what happens.”\n Benny’s insecurities wanted to read her comment in all the wrong ways, but his inner voice whispered a different suggestion to him. He said, “Count on it.”\n She held out her hand. “So … want to go for a walk?”\n “Well … it’s that or clean my room, but since my room is a tree …”\n He took her hand, and they walked under the canopy of cool green leaves. Birds sang in the trees, and the grass beneath their feet glistened with morning dew. The first of the day’s bees buzzed softly among the flowers, going about their ancient and important work, collecting nectar and taking pollen from one flower to another. Cyclones of gnats spiraled up from the grass and swirled through the slanting sunlight. The loveliness of the forest was magical and fresh, but it was also immense. Neither of them spoke, unable to phrase their reactions to the rampant beauty and unwilling to trouble the air with the horrors that haunted their hearts.\n Despite the warm reality of each other’s hands, they felt incredibly alone. Desolate. Even though they knew that Tom and Lilah and Chong were somewhere in this same forest, it was as if everyone else was on a different planet. Mountainside—home—was a million miles away. The jumbo jet could well have been on the far side of the world, or something from an old dream.\n The rocky path wound down among trees and shrubs, and most of the way there was no evidence of what had happened last night except the smell of ash on the breeze. Then they rounded a bend, and all that changed.\n “God …,” Nix said in a hollow whisper.\n The field was a massive ruin. Trees had burned to stumps, bushes had been reduced to ash. The way station was nothing more than a blackened shell.\n However, that was not the worst of it. Not by a long shot. Everywhere—on the field, collapsed over the glacial boulders, twisted into bony knots on the concrete slab by the station—were corpses. Last night they had been the living dead; now they were merely dead, the life force burned out of them by the conflagration Benny had set loose with a tiny match.\n It was all so still. A blasted expanse of ash and cracked bones. Nix turned away.\n Benny lowered his head. “I’m sorry,” he said.\n Nix touched his arm. “This isn’t your fault. You didn’t mean—”\n “Yes I did, Nix.” He turned to her and brushed a strand of curly red hair away from her face. “I started the fire because I didn’t know what else to do. I killed all those …”\n “Zoms, Benny. They’re zoms. You can’t kill them.”\n “I know … but …”\n She looked puzzled. “What?”\n “They were people once.”\n “I know.”\n “What if …” He stopped and took a breath, thinking of the terrible heat and of the flames spreading so rapidly on dry skin and old clothes. “What if they could feel it?”\n “They can’t, Benny,” said Nix softly. “They’re dead.”\n “We don’t know what they are. The dead are dead, they don’t move, they rot and turn to dust. The zoms … they move around. Sure, they attack people, but that’s the point. Dead people can’t do that … so what are they really? Why do they moan? Are they trying to communicate somehow? Are they trying to say something? Or … does being a zom hurt?”\n “Hurt?”\n “From what’s happened to them, and what’s still happening. The wounds that killed them, the decay … can they feel it?”\n “They’re rotting, Benny. Their bodies move around, but there’s no intelligence.”\n He shook his head. “We don’t really know that, Nix, and don’t pretend we do. Tom’s seen them turn door handles and climb steps. He says that some of them pick up stuff to use as weapons. Sticks and stones. The one last night beat on the door. That says something. That says there’s something going on inside.”\n “Benny, a squirrel will pick stuff up. A cat will swat at stuff. It doesn’t mean—”\n “That’s just it!” he cried. “Even if they’re only like a squirrel or a cat, or even if they’re only as smart as a bug, Nix … even bugs feel pain.”\n She shook her head and looked at the twisted wreckage of zombie corpses lying in the ash. “No,” she said. “You’re going to drive yourself crazy thinking like that. Tom’s quieted thousands of zoms. He never said anything about them feeling pain.”\n “How would he know?”\n “Tom would know,” she said firmly. Benny listened to her words, but he also heard something in her voice. A tremor of doubt.\n Let it be, whispered his inner voice. Now’s not the time.\n He nodded and Nix looked relieved, thinking that he was agreeing with her. Benny stepped onto the ash and walked slowly over to the way station. The building was a total loss. Only the front wall still stood; the rest lay in heaps. Benny touched a finger to the outside wall. It was almost cool and covered with a thin film of soot. He nodded again, considering things very carefully, and then used his finger to write a message.\n T / L / C\n WE’RE FINE. HOPE YOU ARE TOO.\n HEADING ON. YOU KNOW WHERE TO\n LOOK FOR US.\n W.S.\n B / N\n “W.S.?” Nix murmured. “Warrior smart?”\n “Yeah. I want him to know we’re using what he taught us.”\n “So … we’re heading east?”\n “I guess,” he said. “To Yosemite. It’s that or go back to town. I sure don’t want to wait around here. I don’t know what drove all those zoms down here last night, and I don’t want to find out.”\n He hadn’t yet told her about the man he’d seen standing among the zoms. The man he was pretty sure was Charlie Pink-eye. How could he tell Nix that her mother’s murderer was still out here, still roaming the world free?\n Benny knew he would have to tell her soon. But not here and not now.\n Nix touched the wall below the first line. T for Tom. L for Lilah. C for Chong. “It’s funny, but Mom used those letters to mean ‘tender loving care.’” She turned away. “That was a different world.”\n “Yes, it was,” he agreed.\n “We don’t belong there anymore.”\n “No.”\n She narrowed her eyes and surveyed the way ahead. Past the blackened ruins, toward the green expanse of the forest and the mountains in the east. “It’s funny,” she said. “I actually thought this part—getting started, I mean—would be the easy part. I expected it to get harder later, but I thought that this would be … I don’t know … kind of ordinary. We’ve been out to Brother David’s a million times … but we’re not even twenty miles from home.”\n “I don’t know if anything’s going to be easy, Nix.”\n She glanced at him, her lip caught between her even white teeth. She said, “Benny … if you say, ‘Let’s go back,’ I will. Right now. So help me, God … I’ll go back.”\n He looked into her eyes and then turned and stared across the charred field of bones to the path that led up into the northwestern slopes. Then he drew a breath and let it out before he turned back. “You already said it, Nix,” he said. “We don’t belong there anymore.”\n Doubt darkened her face. “Do we belong here?”\n “I don’t know.” He knelt and used a handful of withered grass to wipe the soot from his finger. “Maybe we don’t belong anywhere. But I got to tell you, Nix, it cost us too much to get this far to go back now. We have to keep going.”\n “We don’t have to prove anything, Benny.”\n “Yeah,” he said, “I kind of think we do.” Then he smiled. The first real smile he’d worn since they left the tree. “Don’t ask me what it is, though.”\n Then he kissed her. First, very lightly on the line of stitches that crossed her brow, and then more firmly on the lips.\n She kissed him back, and it wasn’t merely reflex. She kissed him like she meant it. Then she stepped back and looked him with green eyes that were filled with a thousand mysteries. For once Benny felt like he understood some of them.\n He smiled and held out his hand, and Nix took it. Together they turned away from the charred graveyard of the dead and headed east. The road before them was tangled in weeds, but the sun glimmered like a promise on every blade of grass.\n As they walked away they did not see the figure that stepped from behind a stand of fire-blackened pines. It was a tall man. Thin as a scarecrow in a black coat, with white hair that fluttered in the hot wind. He watched the two teenagers as they walked along the road.\n The man moved as silently as a shadow as he crossed the field to the way station. He stopped and those cold eyes read the message written in the soot. His lips moved as he read the words, and then he chuckled softly to himself.\n He stood for a long time with his lips pursed, considering the words. Then he used the hard, flat palm of his hand to wipe them out. All that remained was a smear of soot. The figure turned and looked at the road. Nix and Benny were tiny dots now, and as he watched they vanished into the far woods.\n The man smiled and, quiet as death, followed.\n FROM NIX’S JOURNAL\n Tom on Quieting Zoms\n Tom Imura: “Put a bullet through the brain stem and you switch off your zombie. The same holds for a sword or ax cut, or sufficient blunt force trauma. However, if you inflict minor damage to the brain stem, you may remove some of the zombie’s functions … he might be unable to bite or unable to maintain balance. The bottom line here is that the real off buttons for a zombie are the brain stem and the motor cortex.”\n 47\n LILAH CROUCHED BENEATH THE SHELTERING ARMS OF A MASSIVE OAK TREE. Cool green darkness wrapped around her. Her white hair was tangled with moss and bits of leaves. There were long rips in her shirt. She had no memory of what had torn the fabric. Sharp branches or broken fingernails. Her pistol was gone. Her knife was gone. She’d left her spear buried in the chest of a zom back at the edge of the burned field. It was hours before she realized that she was no longer carrying it.\n She had no memory of most of the night. Her head felt broken. As broken as her heart. When she touched her face she was surprised to find fresh tears, but an hour later the surprise turned to panic when she realized that she was still crying. That she could not stop crying. There were no sobs. Just tears. Cold against the fevered heat of her skin.\n From where she crouched she could see Benny and Nix enter the field. She saw what Benny wrote on the wall, and she watched them walk away to the east. She saw the tall man with the snow-white hair follow them. Three times she almost rose to her feet, almost waved. Almost called out their names.\n Each time she did not. Each time she felt that her whole body was one lump of useless muscle. Nothing seemed to work, none of the muscle and bone seemed to be connected to her brain. Her body squatted there under the tree, and her mind merely looked out through the prison windows of her eyes.\n Tears broke and rolled and fell in a terrible silence.\n Lilah had barely known her mother. She had been a toddler on First Night. She remembered screams and pain. She remembered being carried. Sometimes by a woman—probably her mother—and sometimes by other people. She remembered her mother dying as she gave birth to Annie, Lilah’s sister. Those memories were a million years ago. Lifetimes ago.\n It had not been her mother who raised Lilah and Annie. It had been George Goldman. He wasn’t her father. Lilah never knew who her father was. George was another survivor of the zombie plague, the last of the adults to survive out of a group that had fled from Los Angeles. George hadn’t known Lilah’s mother except for a few desperate hours. They hadn’t swapped life stories. Lilah’s mother had died, and then she’d come back. As everyone came back. George and the other survivors had done what was necessary. \n","sourceLink":"https://allnovel.net/dust-and-decay-benny-imura-2/page-27.html","bookId":2582,"book":{"id":2582,"title":"Dust and Decay (Benny Imura #2)","description":"Storyline: \n Dust and Decay (Benny Imura #2) \n Six months have passed since the terrifying battle with Charlie Pink-eye and the Motor City Hammer in the zombie-infested mountains of the Rot \u0026 Ruin. It’s also been six months since Benny Imura and Nix Riley saw something in the air that changed their lives. Now, after months of rigorous training with Benny’s zombie-hunter brother Tom, Benny and Nix are ready to leave their home forever and search for a better future. Lilah the Lost Girl and Benny’s best friend Lou Chong are going with them. \n But before they even leave there is a shocking zombie attack in town, and as soon as they step into the Rot \u0026 Ruin they are pursued by the living dead, wild animals, insane murderers, and the horrors of Gameland—where teenagers are forced to fight for their lives in the zombie pits. Worst of all…could the evil Charlie Pink-eye still be alive? \n In the great Rot \u0026 Ruin, everything wants to kill you. And not everyone in Benny’s small band of travelers will survive….\n \n","cover":"https://allnovel.net/images/dust-and-decay-benny-imura-2.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/dust-and-decay-benny-imura-2.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:07:40 PM"}}
