{"id":65909,"no":13,"title":"Page 13","content":"THE MORNING CAME, but it was the wrong morning. He knew it as soon as he reached the cafeteria. He had been awake and waiting thirty minutes before Harper showed up. She unlocked his door and breezed in, looking elegant and refreshed, wearing the same suit as the first day. Clearly she had three suits and wore them in strict rotation. Three suits was about right, he figured, given her likely salary. It was three suits more than he had, because it was a whole salary more than he had.\n They rode down in the elevator together and walked between buildings. The whole campus was very quiet. It had a weekend feel. He realized it was Sunday. The weather was better. No warmer, but the sun was out and it wasn\u0027t raining. He hoped for a moment it was a sign that this was his day. But it wasn\u0027t. He knew that as soon as he walked into the cafeteria.\n Blake was at the table by the window, alone. There was a jug of coffee, three upturned mugs, a basket of cream and sugar, a basket of Danish and doughnuts. The bad news was the pile of Sunday newspapers, opened and read and scattered, with the Washington Post and USA Today and worst of all the New York Times just sitting right there in plain view. Which meant there was no news from New York. Which meant it hadn\u0027t worked yet, which meant he was going to have to keep on waiting until it did.\n With three people at the table instead of five, there was more elbow room. Harper sat down opposite Blake and Reacher sat opposite nobody. Blake looked old and tired and very strained. He looked ill. The guy was a heart attack waiting to happen. But Reacher felt no sympathy for him. Blake had broken the rules.\n \"Today you work the files,\" Blake said.\n \"Whatever,\" Reacher said.\n \"They\u0027re updated with the Lorraine Stanley material. So you need to spend today reviewing them and you can give us your conclusions at the breakfast meeting tomorrow. Clear?\"\n Reacher nodded. \" Crystal.\"\n \"Any preliminaries I should know about?\"\n \"Preliminary what?\"\n \"Conclusions. You got any thoughts yet?\"\n Reacher glanced at Harper. This was the point where a loyal agent would inform her boss about his objections. But she said nothing. Just looked down and concentrated on stirring her coffee.\n \"Let me read the files,\" he said. \"Too early to say anything right now.\"\n Blake nodded. \"We\u0027ve got sixteen days. We need to start making some real progress real soon.\"\n Reacher nodded back. \"I get the message. Maybe tomorrow we\u0027ll get some good news.\"\n Blake and Harper looked at him like it was an odd thing to say. Then they took coffee and Danish and doughnuts and sections of the papers and lingered like they had time to kill. It was Sunday. And the investigation was stalled. That was clear. Reacher recognized the signs. However urgent a thing is, there comes a point where there are no more places to go. The urgency burns out, and you sit there like you\u0027ve got all the time in the world, while the world rages on around you.\n AFTER BREAKFAST HARPER took him to a room pretty much the same as he\u0027d imagined while bucketing along in the Cessna. It was aboveground, quiet, filled with light oak tables and comfortable padded chairs faced with leather. There was a wall of windows, and the sun was shining outside. The only negative was one of the tables held a stack of files about a foot high. They were in dark blue folders, with FBI printed on them in yellow letters.\n The stack was split into three bundles, each one secured with a thick rubber band. He laid them out on the table, side by side. Amy Callan, Caroline Cooke, Lorraine Stanley. Three victims, three bundles. He checked his watch. Ten twenty-five. A late start. The sun was warming the room. He felt lazy.\n \"You didn\u0027t try Jodie,\" Harper said.\n He shook his head and said nothing.\n \"Why not?\"\n \"No point. She\u0027s obviously not there.\"\n \"Maybe she went to your place. Where her father used to live.\"\n \"Maybe,\" he said. \"But I doubt it. She doesn\u0027t like it there. Too isolated.\"\n \"Did you try it?\"\n He shook his head. \"No.\"\n \"Worried?\"\n \"I can\u0027t worry about something I can\u0027t change.\"\n She said nothing. There was silence. He pulled a file toward him.\n \"You read these?\" he asked her.\n She nodded. \"Every night. I read the files and the summaries.\"\n \"Anything in them?\"\n She looked at the bundles, each one of them four inches thick. \"Plenty in them.\"\n \"Anything significant?\"\n \"That\u0027s your call,\" she said.\n He nodded reluctantly and stretched the rubber band off the Callan file. Opened up the folder. Harper took her jacket off and sat down opposite. Rolled up her shirtsleeves. The sun was directly behind her and it made her shirt transparent. He could see the outside curve of her breast. It swelled gently past the strap of her shoulder holster and fell away to the flatness of her waist. It moved slightly as she breathed.\n \"Get to work, Reacher,\" she said.\n THIS IS THE tense time. You drive by, not fast, not slow, you look carefully, you keep on going up the road a little, and then you stop and you turn around and you drive back. You park at the curb, leaving the car facing the right direction. You switch the engine off. You take the keys out and put them in your pocket. You put your gloves on. It\u0027s cold outside, so the gloves will look OK.\n You get out of the car. You stand still for a second, listening hard, and then you turn a complete circle, slowly, looking again. This is the tense time. This is the time when you must decide to abort or proceed. Think, think, think. You keep it dispassionate. It\u0027s just an operational judgment, after all. Your training helps.\n You decide to proceed. You close the car door, quietly. You walk into the driveway. You walk to the door. You knock. You stand there. The door opens. She lets you in. She\u0027s glad to see you. Surprised, a little confused at first, then delighted. You talk for a moment. You keep on talking, until the time is right. You\u0027ll know the moment, when it comes. You keep on talking.\n The moment comes. You stand still for a second, testing it. You make your move. You explain she has to do exactly what you tell her. She agrees, of course, because she has no choice. You tell her you\u0027d like her to look like she\u0027s having fun while she\u0027s doing it. You explain that\u0027ll make the whole thing more agreeable for you. She nods happily, willing to please. She smiles. The smile is forced and artificial, which spoils it somewhat, but it can\u0027t be helped. Something is better than nothing.\n You make her show you the master bathroom. She stands there like a real estate agent, showing it off. The tub is fine. It\u0027s like a lot of tubs you\u0027ve seen. You tell her to bring the paint inside. You supervise her all the way. It takes her five trips, in and out of the house, up and down the stairs. There\u0027s a lot to carry. She\u0027s huffing and puffing. She\u0027s starting to sweat, even though the fall weather is cold. You remind her about the smile. She puts it back in place. It looks more like a grimace.\n You tell her to find something to lever the lids off with. She nods happily and tells you about a screwdriver in the kitchen drawer. You walk with her. She opens the drawer and finds the screwdriver. You walk with her, back to the bathroom. You tell her to take the lids off, one by one. She\u0027s calm. She kneels next to the first can. She works the tip of the screwdriver in under the metal flange of the lid and eases it upward. She works around it in a circle. The lid sucks off. The chemical smell of the paint fills the air.\n She moves on to the next can. Then the next. She\u0027s working hard. Working quickly. You tell her to be careful. Any mess, she\u0027ll be punished. You tell her to smile. She smiles. She works. The last lid comes off.\n You pull the folded refuse sack from your pocket. You tell her to place her clothes in it. She\u0027s confused. Which clothes? The clothes you\u0027re wearing, you tell her. She nods and smiles. Kicks off her shoes. Their weight pulls the folded bag into shape. She\u0027s wearing socks. She tugs them off. Drops them in the bag. She unbuttons her jeans. Hops from foot to foot, taking them off. They go in the bag. She unbuttons her shirt. Shrugs it off. Drops it in the bag. She reaches back and fiddles with the catch on a her bra. Pulls it off. Her breasts are swinging free. She slips her underpants down and balls them with the bra and drops them in the bag. She\u0027s naked. You tell her to smile.\n You make her carry the bag down to the front door. You walk behind her. She props the bag against the door. You take her back to the bathroom. You make her empty the cans into the tub, slowly, carefully, one by one. She concentrates hard, tongue between her teeth. The cans are heavy and awkward. The paint is thick. It smells. It runs slowly into the tub. The level creeps up, green and oily.\n You tell her she\u0027s done well. You tell her you\u0027re pleased. The paint is in the tub, and there are no drips anywhere. She smiles, delighted at the praise. Then you tell her the next part is harder. She has to take the empty cans back where she got them. But now she\u0027s naked. So she has to make sure nobody can see. And she has to run. She nods. You tell her now the cans are empty they weigh less, so she can carry more each trip. She nods again. She understands. She threads them onto her fingers, five empty cans in each hand. She carries them downstairs. You make her wait. You ease the door open and check. Look and listen. You send her out. She runs all the way there. She replaces the cans. She runs all the way back, breasts bouncing. It\u0027s cold outside.\n You tell her to stand still and get her breath. You remind her about the smile. She bobs her head apologetically and comes back with the grimace. You take her up to the bathroom again. The screwdriver is still on the floor. You ask her to pick it up. You tell her to make marks on her face with it. She\u0027s confused. You explain. Deep scratches will do, you tell her. Three or four of them. Deep enough to draw blood. She smiles and nods. Raises the screwdriver. Scrapes it down the left side of her face, with the blade turned so the point is digging in. A livid red line appears, five inches long. Make the next one harder, you say. She nods. The next line bleeds. Good, you say. Do another. She scratches another. And another. Good, you say. Now make the last one really hard. She nods and smiles. Drags the blade down. The skin tears. Blood flows. Good girl, you say.\n She\u0027s still holding the screwdriver. You tell her to get into the bath, slowly and carefully. She puts her right foot in. Then her left. She\u0027s standing in the paint, up to her calves. You tell her to sit down, slowly. She sits. The paint is up over her waist. Touching the underside of her breasts. You tell her to lie back, slowly and carefully. She slides down into the paint. The level rises, two inches below the lip of the tub. Now you smile. Just right.\n You tell her what to do. She doesn\u0027t understand at first, because it\u0027s a very odd thing to be asked. You explain carefully. She nods. Her hair is thick with paint. She slides down. Now only her face is showing. She tilts her head back. Her hair floats. She uses her fingers to help her. They\u0027re slick and dripping with paint. She does exactly what she\u0027s been told. She gets it right first time. Her eyes jam open with panic, and then she dies.\n You wait five minutes. Just leaning over the tub, not touching anything. Then you do the only thing she can\u0027t do for herself. It gets paint on your right glove. Then you press down on her forehead with a fingertip and she slips under the surface. You peel your right glove off inside out. Check the left one. It\u0027s OK. You put your right hand in your pocket for safety and you keep it there. This is the only time your prints are exposed.\n Your carry the soiled glove in your left hand and walk downstairs in the silence. Slip the glove into the refuse sack with her clothes. Open the door. Listen and watch. Carry the sack outside. Turn around and close the door behind you. Walk down the driveway to the road. Pause behind the car and slip the clean glove in the sack, too. Pop the trunk lid and place the sack inside. Open the door and slide in behind the wheel. Take the keys from your pocket and start the engine. Buckle your belt and check the mirror. Drive away, not fast, not slow.\n THE CALLAN FILE started with a summary of her military career. The career was four years long and the summary ran to forty-eight lines of type. His own name was mentioned once, in connection with the debacle at the end. He found he remembered her pretty well. She had been a small, round woman, cheerful and happy. He guessed she had joined the Army with no very clear idea of why. There\u0027s a definite type of person who takes the same route. Maybe from a large family, comfortable with sharing, good at team sports in school, academically proficient without being a scholar, they just drift toward it. They see it as an extension of what they\u0027ve already known. Probably they don\u0027t see themselves as fighters, but they know for every person who holds a gun the Army offers a hundred other niches where there are trades to be learned and qualifications to be earned.\n Callan had passed out of basic training and gone straight to the ordnance storerooms. She was a sergeant within twenty months. She shuffled paper and sent consignments around the world pretty much like her contemporaries back home, except her consignments were guns and shells instead of tomatoes or shoes or automobiles. She worked at Fort Withe near Chicago in a warehouse full of the stink of gun oil and the noise of clattering forklifts. She had been content at first. Then the rough banter had gotten too much, and her captain and her major had started stepping over the line and talking dirty and acting physical. She was no shrinking violet, but the pawing and the leering eventually brought her to Reacher\u0027s office.\n Then after she quit she went to Florida, to a beach town on the Atlantic forty miles north of where it stopped being too expensive. She got married there, got separated there, lived there a year, then died there. The file was full of notes and photographs about where and nothing much about how. Her house was a modern one-story crouching under an overhanging roof made of orange tile. The crime scene photographs showed no damage to any doors or windows, no disruption inside, a white-tiled bathroom with a tub full of green paint and a slick indeterminate shape floating in it.\n The autopsy showed nothing at all. The paint was designed to be tough and weatherproof and it had a molecular structure designed to cling and penetrate anything it was slapped onto. It covered a hundred percent of the body\u0027s external area and it had seeped into the eyes and the nose and the mouth and the throat. Removing it removed the skin. There was no evidence of bruising or trauma. The toxicology was clear. No phenol injection to the heart. No air embolisms. There are many clever ways to kill a person, and the Florida pathologists knew all of them, and they couldn\u0027t find any evidence of any of them.\n \"Well?\" Harper said.\n Reacher shrugged. \"She had freckles. I remember that. A year in the Florida sun, she must have looked pretty good.\"\n \"You liked her.\"\n He nodded. \"She was OK.\"\n The final third of the file was some of the most exhaustive crime scene forensics he had ever heard of. The analysis was microscopic, literally. Every particle of dust or fiber in her house had been vacuumed up and analyzed. But there was no evidence of any intruder. Not the slightest sign.\n \"A very clever guy,\" Reacher said.\n Harper said nothing in reply. He pushed Callan\u0027s folder to one side and opened Cooke\u0027s. It followed the same format in its condensed narrative structure. She was different from Callan in that she had obviously aimed for the Army right from the start. Her grandfather and her father had been Army men, which creates a kind of military aristocracy, the way certain families see it. She had recognized the clash between her gender and her career intention pretty early, and there were notes about her demands to join her high school ROTC. She had begun her battles early.\n She had been an officer candidate, and had started out a second lieutenant. She had gone straight to War Plans, which is where the brainy people waste their time assuming that when push comes to shove your friends stay your friends and your enemies stay your enemies. She had been promoted first lieutenant and posted to NATO in Brussels and started a relationship with her colonel. When she didn\u0027t get promoted captain early enough, she complained about him.\n Reacher remembered it well. There was no harassment involved, certainly not in the sense that Callan had endured. No strangers had pinched her or squeezed her or made lewd gestures at her with oily gun barrels. But the rules had changed, so that sleeping with somebody you commanded was no longer allowed, so Cooke\u0027s colonel went down, and then ate his pistol. She quit and flew home from Belgium to a lakeside cottage in New Hampshire, where she was eventually found dead in a tub full of setting paint.\n The New Hampshire pathologists and forensic scientists told the same story their Florida counterparts had, which was absolutely no story at all. The notes and the photographs were the same but different. A gray cedar house crowded by trees, an undamaged door, an undisturbed interior, folksy bathroom decor dominated by the dense green contents of the tub. Reacher skimmed through and closed the folder.\n \"What do you think?\" Harper asked.\n \"I think the paint is weird,\" Reacher said.\n \"Why?\"\n He shrugged. \"It\u0027s so circular, isn\u0027t it? It eliminates evidence on the bodies, which reduces risk, but getting it and transporting it creates risk.\"\n \"And it\u0027s like a deliberate clue,\" Harper said. \"It underlines the motive. It\u0027s definite confirmation it\u0027s an Army guy. It\u0027s like a taunt.\"\n \"Lamarr says it has psychological significance. She says he\u0027s reclaiming them for the military.\"\n Harper nodded. \"By taking their clothes, too.\"\n \"But if he hates them enough to kill them, why would he want to reclaim them?\"\n \"I don\u0027t know. A guy like this, who knows how he thinks?\"\n \"Lamarr thinks she knows how he thinks,\" Reacher said.\n Lorraine Stanley\u0027s file was the last of the three. Her history was similar to Callan\u0027s, but more recent. She was younger. She had been a sergeant, bottom of the totem pole in a giant quartermaster facility in Utah, the only woman in the place. She had been pestered since day one. Her competence had been questioned. One night her barrack was broken into and all her uniform trousers were stolen. She reported for duty the next morning wearing her regulation skirt. The next night, all her underwear was stolen. The next morning she was wearing the skirt and nothing underneath. Her lieutenant called her into his office. Made her stand easy in the middle of the room, one foot either side of a large mirror laid on the floor, while he yelled at her for a paperwork snafu. The whole of the personnel roster filed in and out of the office throughout, getting a good look at the reflection in the mirror. The lieutenant ended up in prison and Stanley ended up serving out another year and then living alone and dying alone in San Diego, in the little bungalow shown in the crime scene photographs, in which the California pathologists and forensics people had found absolutely nothing at all.\n \"How old are you?\" Reacher asked.\n \"Me?\" Harper said. \"Twenty-nine. I told you that. It\u0027s an FAQ.\"\n \"From Colorado, right?\"\n \"Aspen.\"\n \"Family?\"\n \"Two sisters, one brother.\"\n \"Older or younger?\"\n \"All older. I\u0027m the baby.\"\n \"Parents?\"\n \"Dad\u0027s a pharmacist, Mom helps him out.\"\n \"You take vacations when you were kids?\"\n She nodded. \"Sure. Grand Canyon, Painted Desert, all over. One year we camped in Yellowstone.\"\n \"You drove there, right?\"\n She nodded again. \"Sure. Big station wagon full of kids, happy family sort of thing. What\u0027s this about?\"\n \"What do you remember about the drives?\"\n She made a face. \"They were endless.\"\n \"Exactly.\"\n \"Exactly what?\"\n \"This is a real big country.\"\n \"So?\"\n \"Caroline Cooke was killed in New Hampshire and Lorraine Stanley was killed three weeks later in San Diego. That\u0027s about as far apart as you can get, right? Maybe thirty-five hundred miles by road. Maybe more.\"\n \"Is he traveling by road?\"\n Reacher nodded. \"He\u0027s got hundreds of gallons of paint to haul around.\"\n \"Maybe he\u0027s got a stockpile stashed away someplace. \"\n \"That just makes it worse. Unless his stash just happened to be on a direct line between where he\u0027s based now and New Hampshire and southern California, he\u0027d have to detour to get it. It would add distance, maybe a lot of distance.\"\n \"So?\"\n \"So he\u0027s got a three-, four-thousand-mile road trip, plus surveillance time on Lorraine Stanley. Could he do that in a week?\"\n Harper made a face. \"Call it seventy hours at fifty-five miles an hour.\"\n \"Which he couldn\u0027t average. He\u0027d pass through towns and road construction. And he wouldn\u0027t break the speed limit. A guy this meticulous isn\u0027t going to risk some trooper sniffing around his vehicle. Hundreds of gallons of camouflage basecoat is going to arouse some suspicions these days, right?\"\n \"So call it a hundred hours on the road.\"\n \"At least. Plus a day or two surveillance when he gets there. That\u0027s more than a week, in practical terms. It\u0027s ten or eleven days. Maybe twelve.\"\n \"So?\"\n \"You tell me.\"\n \"This is not some guy working two weeks on, one week off.\"\n Reacher nodded. \"No, it\u0027s not.\"\n THEY WALKED OUTSIDE and around toward the block with the cafeteria in it. The weather had settled to what fall should be. The air was ten degrees warmer, but still crisp. The lawns were green and the sky was a shattering blue. The dampness had blown away and the leaves on the surrounding trees looked dry and two shades lighter.\n \"I feel like staying outside,\" Reacher said.\n \"You need to work,\" Harper said.\n \"I read the damn files. Reading them over again isn\u0027t going to help me any. I need to do some thinking.\"\n \"You think better outside?\"\n \"Generally.\"\n \"OK, come to the range. I need to qualify on handguns. \"\n \"You\u0027re not qualified already?\"\n She smiled. \"Of course I am. We have to requalify every month. Regulations.\"\n They took sandwiches from the cafeteria and ate as they walked. The outdoor pistol range was Sunday-quiet, a large space the size of a hockey rink, bermed on three sides with high earth walls. There were six separate firing lanes made out of shoulder-high concrete walls running all the way down to six separate targets. The targets were heavy paper, clipped into steel frames. Each paper was printed with a picture of a crouching felon, with target rings radiating out from his heart. Harper signed in with the rangemaster and handed him her gun. He reloaded it with six shells and handed it back, together with two sets of ear defenders.\n \"Take lane three,\" he said.\n Lane three was in the center. There was a black line painted on the concrete floor.\n \"Seventy-five feet,\" Harper said.\n She stood square-on and slipped the ear defenders into position. Raised the gun two-handed. Her legs were apart and her knees slightly bent. Her hips were forward and her shoulders back. She loosed off the six shots in a stream, half a second between them. Reacher watched the tendons in her hand. They were tight, rocking the muzzle up and down a fraction each time she pulled.\n \"Clear,\" she said.\n He looked at her.\n \"That means you go get the target,\" she said.\n He expected to see the hits arranged on a vertical line maybe a foot long, and when he got down to the other end of the lane, that is exactly what he found. There were two holes in the heart, two in the next ring, and two in the ring connecting the throat with the stomach. He unclipped the paper and carried it back.\n \"Two fives, two fours, two threes,\" she said. \"Twenty-four points. I pass, just.\"\n \"You should use your left arm more,\" he said.\n \"How?\"\n \"Take all the weight with your left, and just use your right for pulling the trigger.\"\n She paused.\n \"Show me,\" she said.\n He stepped close behind her and stretched around with his left arm. She raised the gun in her right and he cupped her hand in his.\n \"Relax the arm,\" he said. \"Let me take the weight.\"\n His arms were long, but hers were too. She shuffled backward and pressed hard against him. He leaned forward. Rested his chin on the side of her head. Her hair smelled good.\n \"OK, let it float,\" he said.\n She clicked the trigger on the empty chamber a couple of times. The muzzle was rock steady.\n \"Feels good,\" she said.\n \"Go get some more shells.\"\n She peeled away from in front of him and walked back to the rangemaster\u0027s cubicle and got another clip, part loaded with six. He moved into the next lane, where there was a new target. She met him there and nestled back against him and raised her gun hand. He reached around her and cupped it and took the weight. She leaned back against him. Fired twice. He saw the holes appear in the target, maybe an inch apart in the center ring.\n \"See?\" he said. \"Let the left do the work.\"\n \"Sounds like a political statement.\"\n She stayed where she was, leaning back against him. He could feel the rise and fall of her breathing. He stepped away from behind her and she tried again, by herself. Two shots, fast. The shell cases rang on the concrete. Two more holes appeared in the heart ring. There was a tight cluster of four, in a diamond shape a business card would have covered.\n She nodded. \"You want the last two?\"\n She stepped close and handed him the pistol, butt-first. It was a SIG-Sauer, identical to the one Lamarr had held next to his head throughout the car ride into Manhattan. He stood with his back to the target and weighed the gun in his hand. Then he spun abruptly and fired the two bullets, one into each of the target\u0027s eyes.\n \"That\u0027s how I\u0027d do it,\" he said. \"If I was real mad with somebody, that\u0027s what I\u0027d do. I wouldn\u0027t mess around with a damn tub and twenty gallons of paint.\"\n THEY MET BLAKE on the way back to the library room. He looked aimless and agitated all at the same time. There was worry in his face. He had a new problem.\n \"Lamarr\u0027s father died,\" he said.\n \"Stepfather,\" Reacher said.\n \"Whatever. He died, early this morning. The hospital in Spokane called for her. Now I\u0027ve got to call her at home.\"\n \"Give her our condolences,\" Harper said.\n Blake nodded vaguely and walked away.\n \"He should take her off the case,\" Reacher said.\n Harper nodded. \"Maybe he should, but he won\u0027t. And she wouldn\u0027t agree, anyway. Her job is all she\u0027s got.\"\n Reacher said nothing. Harper pulled the door and ushered him back into the room with the oak tables and the leather chairs and the files. Reacher sat down and checked his watch. Three twenty. Maybe two more hours of daydreaming and then he could eat and escape to the solitude of his room.\n IT WAS THREE hours, in the end. And it wasn\u0027t daydreaming. He sat and stared into space and thought hard. Harper watched him, anxious. He took the file folders and arranged them on the table, Callan\u0027s at the bottom right, Stanley\u0027s at the bottom left, Cooke\u0027s at the top right, and stared at them, musing about the geography again. He leaned back and closed his eyes.\n \"Making any progress?\" Harper asked.\n \"I need a list of the ninety-one women,\" he said.\n \"OK,\" she said.\n He waited with his eyes closed and heard her leave the room. Enjoyed the warmth and the silence for a long moment, and then she was back. He opened his eyes and saw her leaning over near him and handing him another thick blue file.\n \"Pencil,\" he said.\n She backed away to a drawer and found a pencil. Rolled it across the table to him. He opened the new file and started reading. First item was a Defense Department printout, four pages stapled together, ninety-one names in alphabetical order. He recognized some of them. Rita Scimeca was there, the woman he\u0027d mentioned to Blake. She was next to Lorraine Stanley. Then there was a matching list with addresses, most of them obtained through the VA\u0027s medical insurance operation or mail-forwarding instructions. Scimeca lived in Oregon. Then there was a thick sheaf of background information, Army postdischarge intelligence reports, extensive for some of the women, sketchy for others, but altogether enough for a basic conclusion. Reacher flipped back and forth between pages and went to work with the pencil and twenty minutes later counted up the marks he\u0027d made.\n \"It was eleven women,\" he said. \"Not ninety-one.\"\n \"It was?\" Harper said.\n He nodded.\n \"Eleven,\" he said again. \"Eight left, not eighty-eight. \"\n \"Why?\"\n \"Lots of reasons. Ninety-one was always absurd. Who would seriously target ninety-one women? Five and a quarter years? It\u0027s not credible. A guy this smart would break it down into something manageable, like eleven.\"\n \"But how?\"\n \"By limiting himself to what\u0027s feasible. A subcategory. What else did Callan and Cooke and Stanley have in common?\"\n \"What?\"\n \"They were alone. Positively and unequivocally alone. Unmarried or separated, single-family houses in the suburbs or the countryside.\"\n \"And that\u0027s crucial?\"\n \"Of course it is. Think about the MO. He needs somewhere quiet and lonely and isolated. No interruptions. And no witnesses nearby. He has to get all that paint into the house. So look at this list. There are married women, women with new babies, women living with family, parents, women in apartment houses and condos, farms, communes even, women gone back to college. But he wants women who live alone, in houses.\"\n Harper shook her head. \"There are more than eleven of those. We did the research. I think it\u0027s more than thirty. About a third.\"\n \"But you had to check. I\u0027m talking about women who are obviously living alone and isolated. At first glance. Because we have to assume the guy hasn\u0027t got anybody doing research for him. He\u0027s working alone, in secret. All he\u0027s got is this list to study.\"\n \"But that\u0027s our list.\"\n \"Not exclusively. It\u0027s his, too. All this information came straight from the military, right? He had this list before you did.\"\n FORTY-THREE MILES AWAY, slightly east of north, the exact same list was lying open on a polished desk in a small windowless office in the darkness of the Pentagon\u0027s interior. It was two Xerox generations newer than Reacher\u0027s version, but it was otherwise identical. All the same pages were there. And they had eleven marks on them, against eleven names. Not hasty check marks in pencil, like Reacher had scrawled, but neat under-linings done with a fountain pen and a beveled ruler held away from the paper so the ink wouldn\u0027t smudge.\n Three of the eleven names had second lines struck through them.\n The list was framed on the desk by the uniformed forearms of the office\u0027s occupant. They were flat on the wood, and the wrists were cocked upward to keep the hands clear of the surface. The left hand held a ruler. The right hand held a pen. The left hand moved and placed the ruler exactly horizontal along the inked line under a fourth name. Then it slid upward a fraction and rested across the name itself. The right hand moved and the pen scored a thick line straight through it. Then the pen lifted off the page.\n \"SO WHAT DO we do about it?\" Harper asked.\n Reacher leaned back and closed his eyes again.\n \"I think you should gamble,\" he said. \"I think you should stake out the surviving eight around the clock and I think the guy will walk into your arms within sixteen days.\"\n She sounded uncertain.\n \"Hell of a gamble,\" she said. \"It\u0027s very tenuous. You\u0027re guessing about what he\u0027s guessing about when he looks at the list.\"\n \"I\u0027m supposed to be representative of the guy. So what I guess should be what he guesses, right?\"\n \"Suppose you\u0027re wrong?\"\n \"As opposed to what? The progress you\u0027re making?\"\n She still sounded uncertain. \"OK. I guess it\u0027s a valid theory. Worth pursuing. But maybe they thought of it already.\"\n \"Nothing ventured, nothing gained, right?\"\n She was quiet for a second. \"OK, talk to Lamarr, first thing tomorrow.\"\n He opened his eyes. \"You think she\u0027ll be here?\"\n Harper nodded. \"She\u0027ll be here.\"\n \"Won\u0027t there be a funeral for her father?\"\n Harper nodded again. \"There\u0027ll have to be a funeral, obviously. But she won\u0027t go. She\u0027d miss her own funeral, a case like this.\"\n \"OK, but you do the talking, and talk to Blake instead. Keep it away from Lamarr.\"\n \"Why?\"\n \"Because her sister clearly lives alone, remember? So her odds just went all the way down to eight to one. Blake will have to pull her off now.\"\n \"If he agrees with you.\"\n \"He should.\"\n \"Maybe he will. But he won\u0027t pull her off.\"\n \"He should.\"\n \"Maybe, but he won\u0027t.\"\n Reacher shrugged. \"Then don\u0027t bother telling him anything. I\u0027m just wasting my time here. The guy\u0027s an idiot.\"\n \"Don\u0027t say that. You need to cooperate. Think about Jodie.\"\n He closed his eyes again and thought about Jodie. She seemed a long way away. He thought about her for a long time.\n \"Let\u0027s go eat,\" Harper said. \"Then I\u0027ll go talk to Blake.\"\n FORTY-THREE MILES AWAY, slightly east of north, the uniformed man stared at the paper, motionless. There was a look on his face appropriate to a man making slow progress through a complicated undertaking. Then there was a knock at his door.\n \"Wait,\" he called.\n He clicked the ruler down onto the wood and capped his pen and clipped it into his pocket. Folded the list and opened a drawer in his desk and slipped the list inside and weighted it down with a book. The book was a Bible, King James Version, black calfskin binding. He placed the ruler flat on top of the Bible and slid the drawer closed. Took keys from his pocket and locked the drawer. Put the keys back in his pocket and moved in his chair and straightened his jacket.\n \"Come,\" he called.\n The door opened and a corporal stepped inside and saluted.\n \"Your car is here, Colonel,\" he said.\n \"OK, Corporal,\" the colonel said.\n THE SKIES ABOVE Quantico were still clear, but the crispness in the air was plummeting toward a real night chill. Darkness was creeping in from the east, behind the buildings. Reacher and Harper walked quickly and the lights along the path came on in sequence, following their pace, as if their passing was switching the power. They ate alone, at a table for two in a different part of the cafeteria. They walked back to the main building through full darkness. They rode the elevator and she unlocked his door with her key.\n \"Thanks for your input,\" she said.\n He said nothing.\n \"And thanks for the handgun tutorial,\" she said.\n He nodded. \"My pleasure.\"\n \"It\u0027s a good technique.\"\n \"An old master sergeant taught it to me.\"\n She smiled. \"No, not the shooting technique. The tutorial technique.\"\n He nodded again, remembering her back pressed close against his chest, her hips jammed against his, her hair in his face, her feel, her smell.\n \"Showing is always better than telling. I guess,\" he said.\n \"Can\u0027t beat it,\" she replied.\n She closed the door on him and he heard her walk away. \n","sourceLink":"https://allnovel.net/running-blind-jack-reacher-4/page-13.html","bookId":2342,"book":{"id":2342,"title":"Running Blind (Jack Reacher #4)","description":"Storyline: \n Running Blind (Jack Reacher #4) \n Women are being murdered nationwide by a killer who leaves no trace of evidence, no fatal wounds, no signs of struggle, and no clues to an apparent motive. All the victims have one thing in common: they each knew Jack Reacher.\n \n","cover":"https://allnovel.net/images/running-blind-jack-reacher-4.jpg","author":"Lee Child","type":"Mystery","source":"allnovel","link":"https://allnovel.net/running-blind-jack-reacher-4.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 9:59:01 AM"}}
