{"id":65918,"no":22,"title":"Page 22","content":"THIS TIME THERE will be guards. You know that for sure. So this time will be difficult. You smile to yourself and correct your phraseology. Actually, this time will be very difficult. Very, very difficult. But not impossible. Not for you. It will be a challenge, is all. Putting guards into the equation will elevate the whole thing up a little nearer to interesting. A little nearer the point where your talent can really flex and stretch like it needs to. It will be a challenge to relish. A challenge to beat.\n But you don\u0027t beat anything without thinking. You don\u0027t beat anything without careful observation and planning. The guards are a new factor, so they need analysis. But that\u0027s your strength, isn\u0027t it? Accurate, dispassionate analysis. Nobody does it better than you. You\u0027ve proved that, over and over again, haven\u0027t you? Four whole times.\n So what do the guards mean to you? Initial question, who are the guards? Out here in the sticks a million miles from nowhere, first impression is you\u0027re dealing with dumb-ass local cops. No immediate problem. No immediate threat. But the downside is, out here in the sticks a million miles from nowhere, there aren\u0027t enough dumb-ass local cops to go around. Some tiny Oregon township outside of the Portland city limits won\u0027t have enough cops to keep up a twenty-four-hour watch. So they\u0027ll be looking for help, and you know that help will come from the FBI. You know that for sure. The way you predict it, the locals will take the day, and the Bureau will take the night.\n Given the choice, obviously you aren\u0027t going to tangle with the Bureau. So you\u0027re going to avoid the night. You\u0027re going to take the day, when all that stands between you and her is some local fat boy in a Crown Vic full of cheeseburger wrappers and cold coffee. And you\u0027re going to take the day because the day is a more elegant solution. Broad daylight. You love the phrase. They use it all the time, don\u0027t they?\n \"The crime was committed in broad daylight,\" you whisper to yourself.\n Getting past the locals in broad daylight won\u0027t be too hard. But even so, it\u0027s not something you\u0027re going to undertake lightly. You\u0027re not going to rush in. You\u0027re going to watch carefully, from a distance, until you see how it goes. You\u0027re going to invest some time in careful, patient observation. Fortunately, you\u0027ve got a little time. And it won\u0027t be hard to do. The place is mountainous. Mountainous places have two characteristics. Two advantages. First of all, they\u0027re already full of idiots hanging out in sweaters with field glasses around their necks. And second of all, mountainous terrain makes it easy to see point A from point B. You just get yourself concealed high up on some peak or knoll or whatever the hell they call them. Then you settle in, and you gaze downward, and you watch. And you wait.\n REACHER WAITED A long time in the stillness of Jodie\u0027s living room. His posture on the sofa changed from sitting to sprawling. After an hour he swiveled around and lay down. Closed his eyes. Opened them again and struggled to stay awake. Closed them again. Kept them closed. Figured he\u0027d catch ten minutes. Figured he\u0027d hear the elevator. Or the door. But when it came to it, he heard neither. He woke up and found her bending over him, kissing his cheek.\n \"Hey, Reacher,\" she said softly.\n He pulled her to him and held her in a tight silent embrace. She hugged back, one-handed because she was still carrying her briefcase, but hard.\n \"How was your day?\" he asked.\n \"Later,\" she whispered.\n She dropped the briefcase and he pulled her down on top of him. She struggled out of her coat and let it fall. The silk lining whispered and sighed. She was in a wool dress with a zipper all the way down the back to the base of her spine. He unzipped it slowly and felt the warmth of her body underneath. She pushed up with her elbows sharp points in his stomach. Her hands scrabbled at his shirt. He pushed the dress off her shoulders. She pulled his shirt out of his waistband. Tore at his belt.\n She stood up and her dress fell to the floor. She held out her hand and he took it and she led him to the bedroom. They stumbled out of their clothes as they walked. Made it to the bed. It was white and cool. Neon glow from the city outside lit it in random patterns.\n She pushed him down, with her hands on his shoulders. She was strong, like a gymnast. Urgent and energetic and lithe on top of him. He was lost. They finished filmed in sweat in a tangle of sheets. She was pressed against him. He could feel her heart hammering on his chest. Her hair was in his mouth. He was breathing hard. She was smiling. Her face was tucked into his shoulder and he could feel the smile against his skin. The shape of her mouth, the cool of her teeth. The impatient curve in the muscles of her cheek.\n She was beautiful in a way he couldn\u0027t describe. She was tall and lean and graceful, and blond and faintly tanned and she had spectacular hair and eyes. But she was more than that. She was shot through with energy and will and passion. Crackling with restless intelligence, like electricity. He traced his hand down the smooth curve of her back. She stretched her foot all the way down his leg and tried to lace her toes into his. The secret smile was still there, against his neck.\n \"Now you can ask me about my day,\" she said.\n Her words were muffled by his shoulder.\n \"How was your day?\" he asked.\n She put her hand flat on his chest and pushed herself up onto her elbow. Made a shape with her mouth and blew her hair off her face. Then the smile came back.\n \"It was great,\" she said.\n He smiled in turn.\n \"Great how?\" he asked.\n \"Secretary gossip,\" she said. \"Mine talked to one from upstairs over lunch.\"\n \"And?\"\n \"There\u0027s a partners\u0027 meeting in a few days.\"\n \"And?\"\n \"The upstairs secretary had just typed the agenda. They\u0027re going to make a partnership offer.\"\n He smiled. \"Who to?\"\n She smiled back. \"To one of the associates.\"\n \"Which one?\"\n \"Guess.\"\n He pretended to think about it. \"They\u0027d go for somebody special, right? The best they got? The smartest, hardest-working, most charming and all that?\"\n \"That\u0027s usually what they do.\"\n He nodded. \"Congratulations, babe. You deserve it. You really do.\"\n She smiled happily and threaded her arms around his neck. Pressed herself down in a full-body hug, head to toe.\n \"Partner,\" she said. \"What I always wanted.\"\n \"You deserve it,\" he said again. \"You really do.\"\n \"A partner at thirty,\" she said. \"Can you believe it?\"\n He stared up at the ceiling and smiled. \"Yes, I can believe it. If you\u0027d gone into politics, you\u0027d be president by now.\"\n \"I can\u0027t believe it,\" she said. \"I never can, when I get what I want.\"\n Then she was quiet for a second.\n \"But it hasn\u0027t happened yet,\" she said. \"Maybe I should wait until it has.\"\n \"It\u0027ll happen,\" he said.\n \"It\u0027s only an agenda. Maybe they\u0027ll all vote no.\"\n \"They won\u0027t,\" he said.\n \"There\u0027ll be a party,\" she said. \"Will you come?\"\n \"If you want me to. If I won\u0027t ruin your image.\"\n \"You could buy a suit. Wear your medals. You\u0027d blow them away.\"\n He was quiet for a spell, thinking about buying a suit. If he did, it would be the first suit he\u0027d ever worn.\n \"Have you got what you want?\" she asked.\n He wrapped his arms around her. \"Right now?\"\n \"Overall?\"\n \"I want to sell the house,\" he said.\n She lay still for a moment.\n \"OK,\" she said. \"Not that you need my permission.\"\n \"It burdens me down,\" he said. \"I can\u0027t handle it.\"\n \"You don\u0027t need to explain to me.\"\n \"I could live the rest of my life on the money I get for it.\"\n \"You\u0027d have to pay taxes.\"\n He nodded. \"Whatever. What\u0027s left would buy me plenty of motel rooms.\"\n \"You should think carefully. It\u0027s the only asset you\u0027ve got.\"\n \"Not to me. Money for motels is an asset. The house is a burden.\"\n She was silent.\n \"I\u0027m going to sell my car, too,\" he said.\n \"I thought you liked it,\" she said.\n He nodded. \"It\u0027s OK. For a car. I just don\u0027t like owning things.\"\n \"Owning a car isn\u0027t exactly the end of the world.\"\n \"It is to me. Too much hassle. It needs insurance, all that kind of stuff.\"\n \"You don\u0027t have insurance?\"\n \"I thought about it,\" he said. \"They need all kinds of paperwork first.\"\n She paused.\n \"How will you get around?\"\n \"Same as I always did, hitch rides, take the bus.\"\n She paused again.\n \"OK, sell the car if you want to,\" she said. \"But maybe keep the house. It\u0027s useful.\"\n He shook his head, next to hers. \"It drives me crazy.\"\n He felt her smile.\n \"You\u0027re the only person I know who wants to be homeless,\" she said. \"Most people try real hard to avoid it.\"\n \"There\u0027s nothing I want more,\" he said. \"Like you want to make partner, I want to be free.\"\n \"Free of me too?\" she asked, quietly.\n \"Free of the house,\" he said. \"It\u0027s a burden. Like an anchor. You\u0027re not.\"\n She unwrapped her arms from his neck and propped herself on an elbow.\n \"I don\u0027t believe you,\" she said. \"The house anchors you and you don\u0027t like it, but I anchor you too, don\u0027t I?\"\n \"The house makes me feel bad,\" he said. \"You make me feel good. I only know how I feel.\"\n \"So you\u0027d sell the house but you\u0027d stick around New York?\"\n He was quiet for a beat.\n \"I\u0027d maybe move around a little,\" he said. \"You travel. You\u0027re busy a lot of the time. We could make it work.\"\n \"We\u0027d drift apart.\"\n \"I don\u0027t think so.\"\n \"You\u0027d stay away longer and longer.\"\n He shook his head. \"It\u0027ll be the same as it\u0027s been all year. Except I won\u0027t have the house to worry about.\"\n \"You\u0027ve made up your mind, right?\"\n He nodded. \"It\u0027s driving me crazy. I don\u0027t even know the zip code. Presumably because I don\u0027t want to know, deep down.\"\n \"You don\u0027t need my permission,\" she said again.\n Then she was silent.\n \"You upset?\" he asked, uselessly.\n \"Worried,\" she said.\n \"It won\u0027t change anything,\" he said.\n \"So why do it?\"\n \"Because I have to.\"\n She didn\u0027t reply.\n THEY FELL ASLEEP like that, in each other\u0027s arms, with a strand of melancholy laced through the afterglow. Morning came and there was no time for more talk. Jodie showered and left with no breakfast and without asking him what he was doing or when he\u0027d be back. He showered and dressed and locked up the apartment and rode down to the street and found Lisa Harper waiting for him. She was dressed in her third suit and she was leaning on the fender of the Bureau car. The day was bright with cold sun and the light was on her hair. The car was stopped at the curb with angry traffic swarming around it. The Bureau driver was motionless behind the wheel, staring straight ahead. The air was full of noise.\n \"You OK?\" she asked.\n He shrugged. \"I guess.\"\n \"So let\u0027s go.\"\n The driver fought traffic twenty blocks uptown and went underground into the same crowded garage Lamarr had brought him to. They used the same elevator in the corner. Rode up to the twenty-first floor. Stepped out into the same quiet gray corridor. The driver preceded them like a host and pointed to his left.\n \"Third door,\" he said.\n James Cozo was behind his desk and looked as though he might have been there for an hour. He was in shirtsleeves. His jacket was on a hanger on a bentwood hat stand. He was watching television, political cable, an earnest reporter in front of the Capitol, rapid cutaways to the Hoover Building. The budget hearings.\n \"The return of the vigilante,\" he said.\n He nodded to Harper and closed a file. Muted the television sound and pushed back from his desk and rubbed his hands over his narrow face, like he was washing without water.\n \"So what do you want?\" he asked.\n \"Addresses,\" Reacher said. \"For Petrosian\u0027s boys.\"\n \"The two you put in the hospital? They won\u0027t be pleased to see you.\"\n \"They\u0027ll be pleased to see me leave.\"\n \"You going to hurt them again?\"\n \"Probably.\"\n Cozo nodded. \"Suits me, pal.\"\n He pulled a file from a stack and rooted through it. Copied an address onto a slip of paper.\n \"They live together,\" he said. \"They\u0027re brothers.\"\n Then he thought again and tore the paper into shreds. Reversed the open file on the desk and took a new sheet of paper. Tossed a pencil on top of it.\n \"You copy it,\" he said. \"Don\u0027t want my handwriting anywhere near this, literally or metaphorically.\"\n The address was near Fifth, on Sixty-sixth Street.\n \"Nice neighborhood,\" Reacher said. \"Expensive.\"\n Cozo nodded again. \"Lucrative operation.\"\n Then he smiled.\n \"Well, it was,\" he said. \"Until you got busy down in Chinatown.\"\n Reacher said nothing.\n \"Take a taxi,\" Cozo said to Harper. \"And you stay out of the way. No overt Bureau involvement here, OK?\"\n She nodded, reluctantly.\n \"Have fun,\" Cozo said.\n THEY WALKED OVER to Madison with Harper craning like a tourist. Caught a cab uptown and got out on the corner of Sixtieth Street.\n \"We\u0027ll walk the rest of the way,\" Reacher said.\n \"We?\" Harper said. \"Good. I want to stay involved.\"\n \"You have to stay involved,\" Reacher said. \"Because I won\u0027t get in without you.\"\n The address led them six blocks north to a plain, medium-height apartment building faced with gray brick. Metal window frames, no balconies. Air conditioners built through the walls under the windows. No awning over the sidewalk, no doorman. But it was clean and well kept.\n \"Expensive place?\" Harper asked.\n Reacher shrugged. \"I don\u0027t know. Not the most expensive, I guess. But they won\u0027t be giving them away.\"\n The street door was open. The lobby was narrow, with hard stucco walls carefully streaked with paint so they looked a little like marble. There was a single elevator at the back of the lobby, with a narrow brown door.\n The apartment they wanted was on the eighth floor. Reacher touched the elevator button and the door rolled back. The car was lined with bronze mirror on all four sides. Harper stepped in and Reacher crowded after her. Pressed 8. An infinite number of reflections rode up with them.\n \"You knock on their door,\" Reacher said. \"Get them to open up. They won\u0027t if they see me in the spyhole.\"\n She nodded and the elevator stopped on 8. The door rolled back. They stepped out on a dull landing the same shape as the lobby. The apartment they were looking for was in the back of the building on the right.\n Reacher stood flat against the wall and Harper stood in front of the door. She bent forward and then back to flip her hair off her face. Took a breath and raised her hand and knocked on the door. Nothing happened for a moment. Then Harper stiffened like she was under scrutiny. There was a rattle of chain from the inside and the door opened a crack.\n \"Building management,\" Harper said. \"I need to check the air conditioners.\"\n Wrong season, Reacher thought. But Harper was more than six feet tall and had blond hair more than a yard long and her hands in her pockets so the front of her shirt was pulled tight. The door pushed shut for a second and the chain rattled again and the door swung back. Harper stepped inside like she was accepting a gracious invitation.\n Reacher peeled off the wall and followed her in before the door closed again. It was a small dark apartment with a view of the light well. Everything was brown, rugs, furniture, drapes. There was a small foyer opening to a small living room. The living room held a sofa and two armchairs, and Harper. And both of the guys Reacher had last seen leaving the alley behind Mostro\u0027s.\n \"Hey, guys,\" he said.\n \"We\u0027re brothers,\" the first guy said, irrelevantly.\n They both had broad strips of hospital gauze taped to their foreheads, stark white, a little longer and broader than the labels Reacher had stuck there. One of them had bandages on his hands. They were dressed identically in sweaters and golf pants. Without their bulky overcoats, they looked smaller. One guy was wearing boat shoes. The other was wearing moccasin slippers that looked like he\u0027d made them himself from a mail-order kit. Reacher stared at them and felt his aggression drain away.\n \"Shit,\" he said.\n They stared back at him.\n \"Sit down,\" he said.\n They sat, side by side on the sofa. They watched him, with fearful eyes hooded under the ludicrous gauze.\n \"Are these the right guys?\" Harper asked.\n Reacher nodded.\n \"Things change, I guess,\" he said.\n \"Petrosian\u0027s dead,\" the first guy said.\n \"We know that already,\" Reacher said back.\n \"We don\u0027t know nothing else,\" the second guy said.\n Reacher shook his head. \"Don\u0027t say that. You know plenty of things.\"\n \"Like what?\"\n \"Like where Bellevue is.\"\n The first guy looked nervous. \"Bellevue?\"\n Reacher nodded. \"The hospital they took you to.\"\n Both brothers looked at the wall.\n \"You liked it there?\" Reacher asked.\n Neither one of them replied.\n \"You want to go back there?\"\n No reply.\n \"Big emergency room there, right?\" Reacher said. \"Good for fixing all kinds of things. Broken arms, broken legs, all kinds of injuries.\"\n The brother with the bandaged hands was older. The spokesman.\n \"What do you want?\" he said.\n \"A trade.\"\n \"What for what?\"\n \"Information,\" Reacher said. \"In exchange for not sending you back to Bellevue.\"\n \"OK,\" the guy said.\n Harper smiled. \"That was easy.\"\n \"Easier than I thought it would be,\" Reacher said.\n \"Things change,\" the guy said. \"Petrosian\u0027s dead.\"\n \"Those guns you had,\" Reacher said. \"Where did you get them?\"\n The guy was wary.\n \"The guns?\" he said.\n \"The guns,\" Reacher repeated. \"Where did you get them?\"\n \"Petrosian gave them to us,\" the guy said.\n \"Where did he get them from?\"\n \"We don\u0027t know.\"\n Reacher smiled and shook his head. \"You can\u0027t say that. You can\u0027t just say we don\u0027t know. It\u0027s not convincing. You could say I don\u0027t know, but you can\u0027t answer for your brother. You can\u0027t know for sure what he knows, can you?\"\n \"We don\u0027t know,\" the guy said again.\n \"They came from the Army,\" Reacher said.\n \"Petrosian bought them,\" the guy said.\n \"He paid for them,\" Reacher said.\n \"He bought them.\"\n \"He arranged their purchase, I accept that.\"\n \"He gave them to us,\" the younger brother said.\n \"Did they come in the mail?\"\n The older brother nodded. \"Yes, in the mail.\"\n Reacher shook his head. \"No, they didn\u0027t. He sent you to pick them up someplace. Probably a whole consignment. \"\n \"He picked them up himself.\"\n \"No, he didn\u0027t. He sent you. Petrosian wouldn\u0027t go himself. He sent you, in that Mercedes you were using. \"\n The brothers stared at the wall, thinking, like there was a decision to be made.\n \"Who are you?\" the older one asked.\n \"I\u0027m nobody,\" Reacher said.\n \"Nobody?\"\n \"Not a cop, not FBI, not ATF, not anybody.\"\n No reply.\n \"So there\u0027s an upside and a downside here,\" Reacher said. \"You tell me stuff, it stays with me. Doesn\u0027t have to go any farther. I\u0027m interested in the Army, not you. The downside is, you don\u0027t tell me, I\u0027m not concerned with sending you off to court with all kinds of civil rights. I\u0027m concerned with sending you back to Bellevue with all kinds of broken arms and legs.\"\n \"You INS?\" the guy asked.\n Reacher smiled. \"Mislaid your green cards?\"\n The brothers said nothing.\n \"I\u0027m not INS,\" Reacher said. \"I told you, I\u0027m not anything. I\u0027m nobody. Just a guy who wants an answer. You tell me the answer, you can stay here as long as you want, enjoy the benefits of American civilization. But I\u0027m getting impatient. Those shoes aren\u0027t going to do it forever.\"\n \"Shoes?\"\n \"I don\u0027t want to hit a guy wearing slippers like that.\"\n There was silence.\n \"New Jersey,\" the older brother said. \"Through the Lincoln Tunnel, there\u0027s a roadhouse set back where Route 3 meets the turnpike.\"\n \"What\u0027s it called?\"\n \"I don\u0027t know,\" the guy said. \"Somebody\u0027s Bar, is all I know. Mac something, like Irish.\"\n \"Who did you see in there?\"\n \"Guy called Bob.\"\n \"Bob what?\"\n \"Bob, I don\u0027t know. We didn\u0027t exchange business cards or anything. Petrosian just told us Bob.\"\n \"A soldier?\"\n \"I guess. I mean, he wasn\u0027t in uniform or nothing. But he had real short hair.\"\n \"How does it go down?\"\n \"You go in the bar, you find him, you give him the cash, he takes you in the parking lot and gives you the stuff out of the trunk of his car.\"\n \"A Cadillac,\" the other guy said. \"An old DeVille, some dark color.\"\n \"How many times?\"\n \"Three.\"\n \"What stuff?\"\n \"Berettas. Twelve each trip.\"\n \"What time of day?\"\n \"Evening time, around eight o\u0027clock.\"\n \"You have to call him ahead?\"\n The younger brother shook his head.\n \"He\u0027s always in there by eight o\u0027clock,\" he said. \"That\u0027s what Petrosian told us.\"\n Reacher nodded.\n \"So what does Bob look like?\" he asked.\n \"Like you,\" the older brother said. \"Big and mean.\" \n","sourceLink":"https://allnovel.net/running-blind-jack-reacher-4/page-22.html","bookId":2342,"book":{"id":2342,"title":"Running Blind (Jack Reacher #4)","description":"Storyline: \n Running Blind (Jack Reacher #4) \n Women are being murdered nationwide by a killer who leaves no trace of evidence, no fatal wounds, no signs of struggle, and no clues to an apparent motive. All the victims have one thing in common: they each knew Jack Reacher.\n \n","cover":"https://allnovel.net/images/running-blind-jack-reacher-4.jpg","author":"Lee Child","type":"Mystery","source":"allnovel","link":"https://allnovel.net/running-blind-jack-reacher-4.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 9:59:01 AM"}}
