{"id":65901,"no":5,"title":"Page 5","content":"HE WAS OUT of there just after three in the morning. Jodie was agitated, torn between staying with him and getting back to the office to finish her all-nighter. He convinced her to calm down and go do her work. One of the local guys drove her down to Wall Street. They gave him back his possessions, except for the wad of stolen cash. Then the other local guy drove him back to Garrison, hustling hard, fifty-eight miles in forty-seven minutes. He had a red beacon on the dash connected to the cigar lighter with a cord, and he kept it flashing the whole way. The beam swept through the fog. It was the middle of the night, dark and cold, and the roads were damp and slick. The guy said nothing. Just drove and then jammed to a stop at the end of Reacher\u0027s driveway in Garrison and took off again as soon as the passenger door slammed shut. Reacher watched the flashing light disappear into the river mist and turned to walk down to his house. He had inherited the house from Leon Garber, who was Jodie\u0027s father and his old commanding officer. It had been a week of big surprises, both good and bad, back at the start of the summer. Meeting Jodie again, finding out she\u0027d been married and divorced, finding out old Leon was dead, finding out the house was his. He had been in love with Jodie for fifteen years, since he first met her, on a base in the Philippines. She had been fifteen herself then, right on the cusp of spectacular womanhood, and she was his CO\u0027s daughter, and he had crushed his feelings down like a guilty secret and never let them see the light of day. He felt they would have been a betrayal of her, and of Leon, and betraying Leon was the last thing he would have ever done, because Leon was a rough-and-ready prince among men, and he loved him like a father. Which made him feel Jodie was his sister, and you don\u0027t feel that way about your sister. Then chance had brought him to Leon \u0027s funeral, and he had met Jodie again, and they had sparred uneasily for a couple of days before she admitted she felt the exact same things and was concealing her feelings for the exact same reasons. It was a thunderclap, a glorious sunburst of happiness in a summer week of big surprises. So meeting Jodie again was the good surprise and Leon dying was the bad one, no doubt about it. But inheriting the house was both good and bad. It was a half-million-dollar slice of prime real estate standing proudly on the Hudson opposite West Point, and it was a comfortable building, but it represented a big problem. It anchored him in a way which made him profoundly uncomfortable. Being static disconcerted him. He had moved around so often in his life it confused him to spend time in any one particular place. And he had never lived in a house before. Bunkhouses and service bungalows and motels were his habitat. It was ingrained. And the idea of property worried him. His whole life, he had never owned more than would fit into his pockets. As a boy he had owned a baseball and not much else. As an adult he had once gone seven whole years without owning anything at all except a pair of shoes he preferred to the Defense Department issue. Then a woman bought him a wallet with a clear plastic window with her photograph in it. He lost touch with the woman and junked the photograph, but kept the wallet. Then he went the remaining six years of his service life with just the shoes and the wallet. After mustering out he added a toothbrush. It was a plastic thing that folded in half and clipped into his pocket like a pen. He had a wristwatch. It was Army issue, so it started out theirs and became his when they didn\u0027t ask for it back. And that was it. Shoes on his feet, clothes on his back, small bills in his pants, big bills in his wallet, a toothbrush in his pocket, and a watch on his wrist. Now he had a house. And a house is a complicated thing. A big, complicated, physical thing. It started with the basement. The basement was a huge dark space with a concrete floor and concrete walls and floor joists exposed overhead like bones. There were pipes and wires and machines down there. A furnace. Buried outside somewhere was an oil tank. There was a well for the water. Big round pipes ran through the wall to the septic system. It was a complex interdependent machine, and he didn\u0027t know how it worked. Upstairs looked more normal. There was a warren of rooms, all of them amiably shabby and unkempt. But they all had secrets. Some of the light switches didn\u0027t work. One of the windows was jammed shut. The range in the kitchen was too complicated to use. The whole place creaked and cracked at night, reminding him it was real and there and needed thinking about. And a house has an existence beyond the physical. It\u0027s also a bureaucratic thing. Something had come in the mail about title. There was insurance to consider. Taxes. Town tax, school tax, inspection, assessment. There was a bill to pay for garbage collection. And something about a scheduled propane delivery. He kept all that kind of mail in a drawer in the kitchen. The only thing he had bought for the house was a gold-colored filter cone for Leon \u0027s old coffee machine. He figured it was easier than always running to the store to buy the paper kind. Ten past four that morning, he filled it with coffee from a can and added water and set the machine going. Rinsed out a mug at the sink and set it on the counter, ready. Sat on a stool and leaned on his elbows and watched the dark liquid sputtering into the flask. It was an old machine, inefficient, maybe a little furred up inside. It generally took five minutes to finish. Somewhere during the fourth of those five minutes, he heard a car slowing on the road outside. The hiss of damp pavement. The crunch of tires on his asphalt drive. Jodie couldn\u0027t stand to stay at work, he thought. That hope endured about a second and a half, until the car came around the curve and the flashing red beam started sweeping over his kitchen window. It washed left to right, left to right, cutting through the river mist, and then it died into darkness and the motor noise died into silence. Doors opened and feet touched the ground. Two people. Doors slammed shut. He stood up and killed the kitchen light. Looked out of the window and saw the vague shapes of two people peering into the fog, looking for the path that led up to his front door. He ducked back to the stool and listened to their steps on the gravel. They paused. The doorbell rang. There were two light switches in the hallway. One of them operated a porch light. He wasn\u0027t sure which one. He gambled and got it right and saw a glow through the fanlight. He opened the door. The bulb out there was a spotlight made of thick glass tinted yellow. It threw a narrow beam downward from high on the right. The beam caught Nelson Blake first, and then the parts of Julia Lamarr that weren\u0027t in his shadow. Blake\u0027s face was showing nothing except strain. Lamarr\u0027s face was still full of hostility and contempt. \"You\u0027re still up,\" Blake said. A statement, not a question. Reacher nodded. \"Come on in, I guess,\" he said. Lamarr shook her head. The yellow light caught her hair. \"We\u0027d rather not,\" she said. Blake moved his feet. \"There someplace we can go? Get some breakfast?\" \"Four thirty in the morning?\" Reacher said. \"Not around here.\" \"Can we talk in the car?\" Lamarr asked. \"No,\" Reacher said. Impasse. Lamarr looked away and Blake shuffled his feet. \"Come on in,\" Reacher said again. \"I just made coffee. \" He walked away, back to the kitchen. Pulled a cupboard door and found two more mugs. Rinsed the dust out of them at the sink and listened to the creak of the hallway floor as Blake stepped inside. Then he heard Lamarr\u0027s lighter tread, and the sound of the door closing behind her. \"Black is all I got,\" he called. \"No milk or sugar in the house, I\u0027m afraid.\" \"Black is fine,\" Blake said. He was in the kitchen doorway, moving sideways, staying close to the hallway, unwilling to trespass. Lamarr was moving alongside him, looking around the kitchen with undisguised curiosity. \"Nothing for me,\" she said. \"Drink some coffee, Julia,\" Blake said. \"It\u0027s been a long night.\" The way he said it was halfway between an order and paternalistic concern. Reacher glanced at him, surprised, and filled three mugs. He took his own and leaned back on the counter, waiting. \"We need to talk,\" Blake said. \"Who was the third woman?\" Reacher asked. \" Lorraine Stanley. She was a quartermaster sergeant. \" \"Where?\" \"She served in Utah someplace. They found her dead in California, this morning.\" \"Same MO?\" Blake nodded. \"Identical in every respect.\" \"Same history?\" Blake nodded again. \"Harassment complainant, won her case, but quit anyway.\" \"When?\" \"The harassment thing was two years ago, she quit a year ago. So that\u0027s three out of three. So the Army thing is not a coincidence, believe me.\" Reacher sipped his coffee. It tasted weak and stale. The machine was obviously all furred up with mineral deposits. There was probably a procedure for cleaning it out. \"I never heard of her,\" he said. \"I never served in Utah.\" Blake nodded. \"Somewhere we can talk?\" \"We\u0027re talking here, right?\" \"Somewhere we can sit?\" Reacher nodded and pushed off the counter and led the way into the living room. He set his mug on the side table and pulled up the blinds to reveal pitch dark outside. The windows faced west over the river. It would be hours until the sun got high enough to lighten the sky out there. There were three sofas in a rectangle around a cold fireplace full of last winter\u0027s ash. The last cheery blazes Jodie\u0027s father had ever enjoyed. Blake sat facing the window and Reacher sat opposite and watched Lamarr as she fought her short skirt and sat down facing the hearth. Her skin was the same color as the ash. \"We stand by our profile,\" she said. \"Well, good for you.\" \"It was somebody exactly like you.\" \"You think that\u0027s plausible?\" Blake asked. \"Is what plausible?\" Reacher asked back. \"That this could be a soldier?\" \"You\u0027re asking me if a soldier could be a killer?\" Blake nodded. \"You got an opinion on that?\" \"My opinion is it\u0027s a really stupid question. Like asking me if I thought a jockey could ride a horse.\" There was silence. Just a muffled whump from the basement as the furnace caught, and then rapid creaking as the steam pipes heated through and expanded and rubbed against the floor joists under their feet. \"So you were a plausible suspect,\" Blake said. \"As far as the first two went.\" Reacher said nothing. \"Hence the surveillance,\" Blake said. \"Is that an apology?\" Reacher asked. Blake nodded. \"I guess so.\" \"So why did you haul me in? When you already proved it wasn\u0027t me?\" Blake looked embarrassed. \"We wanted to show some progress, I guess.\" \"You show progress by hauling the wrong guy in? I don\u0027t buy that.\" \"I already apologized,\" Blake said. More silence. \"You got anybody who knew all three?\" Reacher asked. \"Not yet,\" Lamarr said. \"We\u0027re thinking maybe previous personal contact isn\u0027t too significant,\" Blake said. \"You were thinking it was, couple of hours ago. You were telling me how I was this big friend of theirs, I knock on the door, they let me right in.\" \"Not you,\" Blake said. \"Somebody like you, is all. And now we\u0027re thinking maybe we were wrong. This guy is killing by category, right? Female harassment complainants who quit afterward? So maybe he\u0027s not personally known to them, maybe he\u0027s just in a category known to them. Like the military police.\" Reacher smiled. \"So now you think it was me again?\" Blake shook his head. \"No, you weren\u0027t in California. \" \"Wrong answer, Blake. It wasn\u0027t me because I\u0027m not a killer.\" \"You never killed anybody?\" Lamarr said, like she knew the answer. \"Only those who needed it.\" She smiled in turn. \"Like I said, we stand by our profile. Some self-righteous son of a bitch just like you.\" Reacher saw Blake glance at her, half supportive, half disapproving. The light from the kitchen was coming through the hallway behind her, turning her thin hair to a wispy halo, making her look like a death\u0027s-head. Blake sat forward, trying to force Reacher\u0027s attention his way. \"What we\u0027re saying is, it\u0027s possible this guy is or was a military policeman.\" Reacher looked away from Lamarr and shrugged. \"Anything\u0027s possible,\" he said. Blake nodded. \"And, you know, we kind of understand that maybe your loyalty to the service makes that hard to accept.\" \"Actually, common sense makes that hard to accept. \" \"In what way?\" \"Because you seem to think trust and friendship is important to the MO in some way. And nobody in the service trusts an MP. Or likes them much, in my experience. \" \"You told us Rita Scimeca would remember you as a friend.\" \"I was different. I put the effort in. Not many of the guys did.\" Silence again. The fog outside was dulling sound, like a blanket over the house. The water forcing through the radiators was loud. \"There\u0027s an agenda here,\" Blake said. \"Like Julia says, we stand behind our techniques, and the way we read it, there\u0027s an Army involvement. The victim category is way too narrow for this to be random.\" \"So?\" \"As a rule, the Bureau and the military don\u0027t get along too well.\" \"Well, there\u0027s a big surprise. Who the hell do you guys get along with?\" Blake nodded. He was in an expensive suit. It made him look uncomfortable, like a college football coach on alumni day. \"Nobody gets on with anybody,\" he said. \"You know how it is, with all the rivalries. When you were serving, did you ever cooperate with civilian agencies? \" Reacher said nothing. \"So you know how it is,\" Blake said again. \"Military hates the Bureau, the Bureau hates CIA, everybody hates everybody else.\" There was silence. \"So we need a go-between,\" Blake said. \"A what?\" \"An adviser. Somebody to help us.\" Reacher shrugged. \"I don\u0027t know anybody like that. I\u0027ve been out too long.\" Silence. Reacher drained his coffee and set the empty mug back on the table. \"You could do it,\" Blake said. \"Me?\" \"Yes, you. You still know your way around, right?\" \"No way.\" \"Why not?\" Reacher shook his head. \"Because I don\u0027t want to.\" \"But you could do it.\" \"I could, but I won\u0027t.\" \"We got your record. You were a hell of an investigator, in the service.\" \"That\u0027s history.\" \"Maybe you still got friends there, people who remember you. Maybe people who still owe you favors.\" \"Maybe, maybe not.\" \"You could help us.\" \"Maybe I could, but I won\u0027t.\" He leaned back into his sofa and spread his arms wide across the tops of the cushions and straightened his legs. \"Don\u0027t you feel anything?\" Blake asked. \"For these women getting killed? Shouldn\u0027t be happening, right?\" \"There\u0027s a million people in the service,\" Reacher said. \"I was in thirteen years. Turnover during that period was what? Maybe twice over? So there\u0027s two million people out there who used to be in with me. Stands to reason a few of them will be getting killed, just like a few of them will be winning the lottery. I can\u0027t worry about all of them.\" \"You knew Callan and Cooke. You liked them.\" \"I liked Callan.\" \"So help us catch her killer.\" \"No.\" \"Without somebody like you, we\u0027re just running blind.\" \"No.\" \"I\u0027m asking for your help here.\" \"No.\" \"You son of a bitch,\" Lamarr said. Reacher looked at Blake. \"You seriously think I would want to work with her? And can\u0027t she think of anything else to call me except son of a bitch?\" \"Julia, go fix some more coffee,\" Blake said. She colored red and her mouth set tight, but she struggled up out of the sofa and walked through to the kitchen. Blake sat forward and talked low. \"She\u0027s real uptight,\" he said. \"You need to cut her a little slack.\" \"I do?\" Reacher said. \"Why the hell should I? She\u0027s sitting here drinking my coffee, calling me names.\" \"Victim category is pretty specific here, right? And maybe smaller than you think. Female harassment complainants who subsequently quit the service? You said hundreds, maybe thousands, but Defense Department says there\u0027s only ninety-one women who fit those parameters.\" \"So?\" \"We figure the guy might want to work his way through all of them. So we have to assume he\u0027s going to, until he\u0027s caught. If he\u0027s caught. And he\u0027s done three already.\" \"So?\" \"Julia\u0027s sister is one of the other eighty-eight.\" Silence again, apart from domestic noises in the kitchen. \"So she\u0027s worried,\" Blake said. \"Not really panicked, I guess, because one in eighty-eight isn\u0027t bad odds, but it\u0027s bad enough for her to be taking it real personal.\" Reacher nodded, slowly. \"Then she shouldn\u0027t be working the case,\" he said. \"She\u0027s too involved.\" Blake shrugged. \"She insisted. It was my judgment call. I\u0027m happy with it. Pressure can produce results.\" \"Not for her. She\u0027s a loose cannon.\" \"She\u0027s my lead profiler. She\u0027s effectively driving this case. So I need her, involved or not. And she needs you as a go-between, and I need results, so you need to cut her a little slack.\" He sat back and stared at Reacher. A fat old man, uncomfortable in his suit, sweating in the nighttime chill, with something uncompromising in his face. I need results. Reacher had no problem with people who needed results. But he said nothing. There was a long silence. Then Lamarr came back into the room, carrying the pot from the machine. Her face was pale again. She had recovered her composure. \"I\u0027m standing by my profile,\" she said. \"The guy\u0027s somebody exactly like you. Maybe somebody you used to know. Maybe somebody you worked with.\" Reacher looked up at her. \"I\u0027m sorry about your personal situation.\" \"I don\u0027t need your sympathy. I need to catch the guy.\" \"Well, good luck.\" She bent and poured coffee into Blake\u0027s mug, and then walked over to Reacher\u0027s. \"Thank you,\" he said. \"You going to help us?\" she asked. He shook his head. \"No.\" \"What about an advisory role?\" Blake asked. \"Purely consultative? Deep background?\" Reacher shook his head again. \"No, not interested.\" \"What about something entirely passive?\" Blake asked. \"Just brainstorming? We feel you could be close to the guy. At least maybe close to the type of guy.\" \"Not my bag,\" Reacher said. There was silence. \"Would you agree to be hypnotized?\" Blake asked. \"Hypnotized? Why?\" \"Maybe you could recall something buried. You know, some guy making some threats, some adverse comments. Something you didn\u0027t pay too much attention to at the time. Might come back to you. Might help us piece something together.\" \"You still do hypnotism?\" \"Sometimes,\" Blake said. \"It can help. Julia\u0027s an expert. She\u0027d do it.\" \"In that case, no thanks. She might make me walk down Fifth Avenue naked.\" Silence again. Blake looked away, then he turned back. \"Last time, Reacher,\" he said. \"The Bureau is asking for your help. We employ advisers all the time. You\u0027d get paid and everything. Yes or no?\" \"This is what hauling me in was all about, right?\" Blake nodded. \"Sometimes it works.\" \"How?\" Blake paused, and then he decided to answer. Reacher saw a guy prepared to be frank, in the interests of being persuasive. \"It shakes people up,\" Blake said. \"You know, make them feel they\u0027re the prime suspect, then tell them they\u0027re not, the emotional flip-flop can make them feel a sort of gratitude toward us. Makes them want to help us out.\" \"That\u0027s your experience?\" Blake nodded again. \"It works, more often than not.\" Reacher shrugged. \"I never studied much psychology. \" \"Psychology is our trade, manner of speaking,\" Blake said. \"Kind of cruel, don\u0027t you think?\" \"The Bureau does what it has to do.\" \"Evidently.\" \"So, yes or no?\" \"No.\" Silence in the room. \"Why not?\" \"Because your emotional flip-flop didn\u0027t work on me, I guess.\" \"Can we have a formal reason, for the record?\" \"Ms. Lamarr is the formal reason. She pisses me off.\" Blake spread his hands, helplessly. \"But she\u0027s only pissing you off to make the flip-flop work. It\u0027s a technique. \" Reacher made a face. \"Well, she\u0027s a little too convincing,\" he said. \"Take her off the case and I might consider it.\" Lamarr glowered and Blake shook his head. \"I won\u0027t do that,\" he said. \"That\u0027s my call and I won\u0027t be dictated to.\" \"Then my answer is no.\" Silence. Blake turned the corners of his mouth down. \"We talked with Deerfield before we came up here,\" he said. \"You can understand we\u0027d do that, right? As a courtesy? He authorized us to tell you Cozo will drop the racketeering charge if you play ball.\" \"I\u0027m not worried about the racketeering charge.\" \"You should be. Protection rackets stink, you know that? They ruin businesses, they ruin lives. If Cozo scripts it right, some local jury of Tribeca traders is going to hate your guts.\" \"I\u0027m not worried about it,\" Reacher said again. \"I\u0027ll beat it in a second. I stopped it, remember? I didn\u0027t start it. Jury of Tribeca merchants, I\u0027ll look like Robin Hood.\" Blake nodded and ducked his head and wiped his lips with his fingers. \"Problem is it could be more than a racketeering charge. One of those guys is critical. We just heard from Bellevue. Broken skull. He dies, it\u0027s a homicide charge.\" Reacher laughed. \"Good try, Blake. But nobody got a broken skull tonight. Believe me, I want to break somebody\u0027s skull, I know how to do it. It wouldn\u0027t happen by accident. So let\u0027s hear the rest of them.\" \"The rest of what?\" \"The big threats. Bureau does what it has to do, right? You\u0027re willing to move right on into the gray areas. So let\u0027s hear what other big threats you\u0027ve got lined up for me.\" \"We just want you to play ball here.\" \"I know that. And I want to hear how far you\u0027re prepared to go.\" \"We\u0027ll go as far as we have to. We\u0027re the Bureau, Reacher. We\u0027re under pressure here. We\u0027re not going to waste time. We got none to waste.\" Reacher sipped his coffee. It tasted better than when he made it. Maybe she used more grounds. Or less. \"So give me the bad news.\" \"IRS audit.\" \"You think I\u0027m worried about an IRS audit? I\u0027ve got nothing to hide. They find some income I\u0027ve forgotten about, I\u0027ll be extremely grateful, is all. I could use the cash.\" \"Your girlfriend, too.\" Reacher laughed again. \"Jodie\u0027s a Wall Street lawyer, for God\u0027s sake. Big firm, nearly a partner. She\u0027ll tie the IRS in a knot without even thinking about it.\" \"We\u0027re serious, Reacher.\" \"Not so far, you\u0027re not.\" Blake looked at the floor. \"Cozo\u0027s got guys on the street, working undercover. Petrosian\u0027s going to be asking who did his boys last night. Cozo\u0027s guys could let your name slip.\" \"So?\" \"They could tell him where you live.\" \"And that\u0027s supposed to scare me? Look at me, Blake. Get real. There\u0027s maybe ten people on the planet I need to be scared of. Extremely unlikely this guy Petrosian happens to be one of them. So he wants to come up here for me, I\u0027ll float him back to town in a box, all the way down the river.\" \"He\u0027s a hard guy, is what I hear.\" \"I\u0027m sure he\u0027s real hard. But is he hard enough?\" \"Cozo says he\u0027s a sexual deviant. His executions always involve some sexual element. And the corpses are always explicitly displayed, naked, mutilated, really bizarre. Men or women, he doesn\u0027t care. Deerfield told us all about that. We talked to him about it.\" \"I\u0027ll take my chances.\" Blake nodded. \"We thought you\u0027d say that. We\u0027re good judges of character. That\u0027s our trade, in a manner of speaking. So we asked ourselves how you\u0027d react to something else. Suppose it\u0027s not your name and address Cozo leaks to Petrosian? What if it\u0027s your girlfriend\u0027s name and address?\"","sourceLink":"https://allnovel.net/running-blind-jack-reacher-4/page-5.html","bookId":2342,"book":{"id":2342,"title":"Running Blind (Jack Reacher #4)","description":"Storyline: Running Blind (Jack Reacher #4) Women are being murdered nationwide by a killer who leaves no trace of evidence, no fatal wounds, no signs of struggle, and no clues to an apparent motive. All the victims have one thing in common: they each knew Jack Reacher.","cover":"https://allnovel.net/images/running-blind-jack-reacher-4.jpg","author":"Lee Child","type":"Mystery","source":"allnovel","link":"https://allnovel.net/running-blind-jack-reacher-4.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 9:59:01 AM"}}
