{"id":100376,"no":51,"title":"Page 51","content":"“Because you made a promise not to hurt me or my cat?” I guessed aloud. “Because the blossom of your outlandish hope that somehow, some way, good would rule the day—I could not take it from you, no matter how often it had been stolen from me.” She stood, and she seemed taller than she had been before. I wondered if it was a trick of the light. “I fear this is what it is like to be the nochnaya. Not an all-powerful creature, but one limited by emotions. Trapped by things like mercy and hope.” “I’m glad you did what you did, Anna.” She nodded to herself. “I think, so far, that I am glad too.” We were saved from any further thinking by a knock at my door. Sike tried the handle, found it open, and came in. “Are you ready to go? Get your things.” Sike brought an empty bag with her and gave it to Anna. At her appearance, Grandfather made mumblings from the bedroom. “You should get that appliance of yours checked out,” Sike said, handing me a sealed envelope. “You knew she was here?” “All along. But it would have been presumptuous to force her to come with us.” I opened the envelope, and inside found an itemized bill. “You’re kidding me.” “Our services do not come free—” “Or cheap,” I said, looking at the final amount. “We offer easy installment plans for indigents, such as yourself.” I folded the paper up and tore it in two. “It seems to me that you lost my case. That negates any contract we once had.” “There’s the small issue of a retainer—” Sike said. I pushed the two pieces of paper back toward her, thumping them against her neck, where her injury had been. “I should bill you all for services rendered. Bite me.” She took the papers from me. “We just might.” Anna returned with her bag. I peered a little bit, to make sure she wasn’t smuggling out my cat. “There will be no bill, and no biting. She is mine.” Sike looked from Anna to me, one cool eyebrow raised. “Then it will be as you say.” Sike opened the door and gestured, but Anna hesitated and looked to me. “Who are those people?” It took me a second to realize she was asking about my family photos on the wall. “My mother and brother, mostly.” “Are they alive?” I nodded. “Have they ever tried to kill you?” “Not precisely.” “Be good to them, then.” She gave me an awkward hug—and it wasn’t till I saw the blood on her cuff that I realized she was wearing one of Yuri’s old shirts. CHAPTER SIXTY-ONE For a week I earned no-questions-asked disability and, through Jake’s use of my car and five bucks at a time, made an extensive survey of pint-sized ice cream flavors available at my local grocery store. I pretended not to notice that he never gave me change. And then the time came that I had to go back. I couldn’t say that I was looking forward to it. But I hauled Gina’s extra coat and wore my own on the train in. I nodded at the night security guards at the front desk and they nodded back—I doubted they recognized me and I didn’t have a badge to prove I belonged there, but I was dressed in green and looked like I knew where I was going. Me and my sack lunch tromped down corridors and stairways till I found myself outside of the elevator down to Y4, without any badge to open it up. I pressed the buttons beside the door, but they’d never worked without a badge before. I stared at the closed orange doors. “Open sesame,” I commanded. They stayed closed. “Winner winner chicken dinner?” I tried, without much enthusiasm. I leaned forward and beat my hand on them once. “Oh, come on!” The metal gave a satisfying thunk, and somewhere inside, gears came to life. The doors opened, the smell of were piss wafted out, and I stepped inside. I pressed the button for Y4, and started counting seconds. Nine, ten, eleven—the elevator came to a stop. “Hello, nurse,” said echoing voices I was disheartened to recognize. My badge dropped from above to land at the floor near my feet. I looked up in spite of myself. There was a webbing of Shadows across the top of the elevator, flowing around its deep-set lights. They were stretching out into the corners, like roots seeking fresh soil. “Are you going to pick that up?” they asked solicitously, while creeping down the wall to block the elevator’s door. I looked down at my badge. The lights began to dim. “Do I have to?” I tapped at my badge with a toe. God only knew where it’d been since I’d seen it last—assuming I believed in Him—and anything that fell on the floor anywhere in the hospital was always suspect. Somedays there wasn’t enough hand sanitizer in the world to chase after a dropped pen. “That is what we’re here to discuss,” the Shadows said, obliterating the elevator’s entire orange door. “Because you do not have to pick up that particular badge again.” It took a second for me to process what they’d said. “Really?” “We have been pleased with your service, human.” The Shadows’ multivoice took on a singsong tone. “We offer you the chance to forget.” “Why?” I asked, stunned. “Why not? When we are finished, you would never know that you had ever worked on Y4. You would never know that vampires and weres do indeed exist. You could forget your doomed relationship with a zombie. Let us help you, as you have helped us.” They sounded frighteningly eager to assist me. I backed away from the encroaching blackness on the floor. “Then what?” “We would take you to the fourth floor. The people there will be happy to see you, and you will be happy to see them. There, you would step off, and it would be like none of this had ever happened.” The elevator doors opened, and I could see the fourth floor out there—nurses milling, patients smiling. The easy congeniality that came with knowing that none of your patients wanted to murder you. The doors closed again. If I were honest with myself, I’d have to admit that it looked tempting. “And my brother?” “He would stay clean as the day is long. All that would change is you, and your place in the world. You could be a new you. A better you. A happier you.” I waited, measuring things. Nurses on the fourth floor could probably make payments on a new car, or have a two-bedroom apartment. Those things—they would make life easier, yes. But happier? And there was no way they didn’t have a reason for offering me my freedom. What would happen if I ran into Dren on the outside and the Shadows had helped me to “forget”? Besides, nurses on the fourth floor didn’t get chances to be heroes often. The Shadows could have at least offered to place me in an intensive care wing. I reached for the door buttons with my left hand, and saw my old scars from Anna’s first bite. I hit the “door close” button with my thumb. “I already have a job that I like. That I’m good at.” I pointed at the ceiling. “I remember the way you made me feel that day—you guys were wrong about me.” The Shadows were unfazed by my posturing. “We do not often offer mortals a second chance. Your feelings of heroism will fade.” “I’ll keep my job now, thanks.” I had the sense of the elevator dropping again, and the darkness began to recede. “Hey—Shadows!” I rapped on the wall. “I want a raise!” Their laughter erupted from all around me. “Gee, thanks.” I crossed my arms and looked up at the ceiling. “Why me for all this?” “Why not you? Anyone could have done what you did,” said their echoing voice. I frowned for a moment, and then realized they were just trying to feed off me again. The elevator doors opened onto the familiar tile of Y4. Kinder coworkers/siblings or non-lethal patients would come in time—or they wouldn’t. But at least I knew who I was, and that I’d done a good job, for now. “But it was me,” I said. I flipped off the ceiling, and stepped out onto my floor.","sourceLink":"https://allnovel.net/nightshifted-edie-spence-1/page-51.html","bookId":2618,"book":{"id":2618,"title":"Nightshifted (Edie Spence #1)","description":"Storyline: Nightshifted (Edie Spence #1) Nursing school prepared Edie Spence for a lot of things. Burn victims? No problem. Severed limbs? Piece of cake. Vampires? No way in hell. But as the newest nurse on Y4, the secret ward hidden in the bowels of County Hospital, Edie has her hands full with every paranormal patient you can imagine—from vamps and were-things to zombies and beyond... Edie’s just trying to learn the ropes so she can get through her latest shift unscathed. But when a vampire servant turns to dust under her watch, all hell breaks loose. Now she’s haunted by the man’s dying words—Save Anna—and before she knows it, she’s on a mission to rescue some poor girl from the undead. Which involves crashing a vampire den, falling for a zombie, and fighting for her soul. Grey’s Anatomy was never like this ...","cover":"https://allnovel.net/images/nightshifted-edie-spence-1.jpg","author":"Cassie Alexander","type":"Horror","source":"allnovel","link":"https://allnovel.net/nightshifted-edie-spence-1.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:51:36 PM"}}
