{"id":99158,"no":47,"title":"Page 47","content":"\n He faked a surprised look. “You just said you didn’t want to hear it.”\n “Not Rhudda’s version. The real story. I did okay in the contest, but what happened at the end?” I pulled the arrow I’d won from my belt and examined it. It was long and straight and fletched with bloodred feathers. And it had missed its target by a mile. “This is Rhudda’s magic arrow, right?”\n “It is.”\n “The one that never misses its target?”\n “That’s right.” Dad suppressed a smile as he nodded.\n “Okay, so how did the arrow-that-never-misses score a bull’s-eye on the wrong target?”\n “I know you can figure out that one, Vic.”\n It was the voice he’d used when I was in high school, quizzing me to help me prepare for a test. The voice that said he wasn’t going to tell me the answer until I’d at least tried.\n I thought. “It wasn’t the wrong target.”\n “That’s my girl!” Dad’s smile burst into a full-blown grin. “Remember what I said about exploiting his hubris? Worked like a charm. My plan was two-pronged. First, get Rhudda so drunk that he’d still be seeing double in the morning.”\n “You were pretty deep in your cups yourself.”\n “You thought so?” He looked pleased. “I wasn’t sure how convincing I was. But after Rhudda got drunk enough, that didn’t matter so much.” He shook his head. “I wasn’t drunk, Vic. I had an arrangement with Clarimonde.”\n “Who?”\n “The woman who served the ale.” Ah, the proper wench. “She watered mine way down—there was hardly any ale in it at all.” Probably tasted like the lite beer I drank at Creature Comforts. I smacked my lips; I was still thirsty. “Poor Clarimonde,” Dad said. “When Rhudda was falling-down drunk, she helped him to his chamber, then went inside with him and closed the door. She had a flagon of wine with her, so I hope he passed out before he could assault her.” I shuddered and hoped so, too. I hoped the proper wench had given him a proper kick where he’d feel it. “Clarimonde did that so I could slip out to the archery range and accomplish the second part of the plan.”\n “You switched the targets.”\n “Rhudda cheats with those, too. Although they look the same from a hundred yards away, the high-scoring rings on his target are slightly wider than the standard, the rings on his opponent’s slightly narrower. So equally good shots give Rhudda a higher score.”\n Oh. Maybe my shots hadn’t been as good as I thought. Well, so what? It wasn’t like I hoped to make the Olympic archery team. “Go on.”\n “After I switched the targets, I went back to my room. About two minutes later, some of Rhudda’s men burst in. They dragged me off to that damn wagon and locked me in. That’s where I spent the night.” He grunted. “Damned uncomfortable it was, too. I think Rhudda suspected I might try something, but his men were too late.”\n I could see now how Dad’s plan had played out at the contest. For the first two arrows, the nonmagical ones, Rhudda’s aim had been off, thanks to a giant-sized hangover and the target’s narrowed rings. In the third round, the magic arrow, aimed by will and not by sight, flew exactly where he intended it to go—striking the precise center of his target. Only “his” target was mine.\n “It was a brilliant plan, Dad.”\n My father looked pleased. “Even if Rhudda realized what happened,” he said, “in front of all those people, what could he do? Admit he’d cheated? He was either a loser or a cheater—a choice his ego couldn’t stand.” He spread his hands. “Hubris, Vic. It gets ’em every time.”\n “What do you think will happen to him?”\n “Rhudda? Those whispering voices will drive him mad. He can’t take the cloak off, you know. It’s charmed. He had it permanently fastened around his neck centuries ago. He bragged about it to me while he was drunk. Eventually, his madness will cause the magic to mark him for reincarnation. He’s lived here for a long time, but magic doesn’t like the taste of insanity. So he’ll go into the cauldron of rebirth—him and his cloak and probably all those whose beards he took, all together. They’ll be washed clean and sent back into the Ordinary.” I liked the idea that Rhudda’s vanquished foes would finally get a new chance. “As for his castle,” Dad continued, “once Rhudda’s gone, all that will dissolve. The magic will abandon it, and the place will sink back into the land.”\n “And the people?”\n “They were held by Rhudda’s will. That’s been shattered, so they’re free to move on to their destinies. Most will go to Tywyll—some to reincarnate, some to regenerate—and a few will find their way to the Black and into the Beyond. It all depends on what the magic chooses for them. But all of them will be better off than they were in that place.”\n “Dad.” I stopped and took his arm, making him stop, too. I fingered the black cloth of his sleeve. Black, the color that marked the wearer for reincarnation or regeneration—but wouldn’t say which. It was too much of a chance to take. “Turn around and go back to your hideout. I can get to Tywyll from here. Let me go on alone.”\n “No, Vic.” He slowly shook his head. “I won’t do that.”\n “You said you didn’t want to be reincarnated! If you enter the city, the cauldron will pull you in, won’t it?” He didn’t answer. I shook his arm. “Won’t it?”\n “Maybe. But maybe that’s okay.” He covered my hand with his. “Yesterday, when that Eidolon was trying to make you feel guilty about my death, I told you my time in that world was up. Maybe my time is up here, too. I hope it’s not—not yet. I don’t know if I can resist the pull of rebirth. But just like I died the best death I could that night ten years ago, I’m going to squeeze everything I can out of the time I’ve got left here.” His face widened in a grin. “There’s no way you’re leaving me behind.”\n FOR AN HOUR (OR WHAT FELT LIKE AN HOUR), WE HAD THE road almost to ourselves. The terrain was hilly, thickly forested on both sides. Here and there, a break in the trees revealed a stone cottage with chickens scratching in a small yard. The Darklands felt like a place where not much had changed in the past dozen or so centuries, and I remarked on that to my father.\n “You said time passes differently here. Is that why the Darklands never left the Middle Ages?”\n “Partly. But mostly it’s due to Lord Arawn. When Arthur and his men raided this realm and stole the cauldron, Arawn closed the border. That was fifteen hundred years ago. Since then, the Darklands and the Ordinary have developed separately.”\n “So no cars, no computers, no guns?” It would have been nice to have a rifle in my contest with Rhudda. I was good at sharpshooting.\n “Shades who arrive here nowadays know about such things, of course. Some even try to create them here. But the magic won’t cooperate. It won’t shape itself into a television or a car.” At the word car, his eyes lit up. “How’s the Jag? You taking good care of her?”\n He didn’t even have to ask whether I still owned the car he’d left me in his will. “My prize possession.” I hoped the biohazard team hadn’t ripped out the upholstery searching for plague virus.\n Dad smiled a sad, distant smile. “I miss that car.”\n More people were joining us now. Shades poured onto the road as the woods gave way to clusters of houses. We were getting near what passed for the suburbs of Tywyll.\n A middle-aged woman in a beige dress nodded to us and said, “Good return.” I smiled and said “Good return” in reply. She gave me a hard stare, scowling, then ducked her head and moved to the other side of the road.\n “What did I do?”\n “You wished her a good return. Here, you only say that to people who are wearing black.”\n Oh. Suddenly I understood the meaning of the phrase. “Good return” was a way to say bye-bye, so long, bon voyage to those about to be reincarnated. Maybe the woman was being polite, but I didn’t like her saying that to my dad.\n Everyone on the road was going in the same direction we were, toward Tywyll. Shades talked and laughed, a few sang or whistled as they walked. The mood was festive, like we were all on our way to a big party.\n Two men, both dressed in dusty gray, walked close to my left elbow.\n “…thought I was leaving early enough to get a good seat,” one of them was saying. “From the look of things, we’ll be lucky to get into the square at all.”\n “Excuse me,” I said, touching his arm. “What’s going on?”\n His head snapped around. His eyes focused on me, taking in my white clothes, and then went a little glassy. “I packed a picnic,” he said, lifting a small sack. “Would you like a sand-wich?”\n “No, thanks.” I ignored my stomach’s rumble of protest. “Why are so many people going to Tywyll?”\n His eyes refocused, and he smiled, probably relieved I hadn’t taken his lunch. “I suppose you haven’t heard, seeing as you’re a clay-born visitor and all. Well, today is a sort of holiday here in the Darklands. The cauldron of transformation has been returned to us, and we’re on our way to witness its purification ceremony. Lord Arawn himself will preside.”\n It was what I’d been afraid of. Pryce would make his move at the ceremony—I was sure of it. The ever-growing crowd surged around me. All these people. If Pryce’s demons escaped, the scene in Tywyll could be as bad as my vision of demon-ravaged Boston.\n We were running out of time.\n The man’s friend leaned forward and spoke around him. “May I offer you a piece of fruit? I’ve got apples and pears.”\n “Nope. Not hungry.” My stomach called me a liar.\n The men nodded and looked at Dad. “Good return,” they said in unison. “I hope you’ll stay with us long enough to witness the ceremony,” said the man with the sandwiches. “I hear it’ll be quite the spectacle.” They moved ahead into the crowd. \n","sourceLink":"https://allnovel.net/darklands-deadtown-4/page-47.html","bookId":2612,"book":{"id":2612,"title":"Darklands (Deadtown #4)","description":"Storyline: \n Darklands (Deadtown #4) \n They call it Deadtown: the city’s quarantined section for its inhuman and undead residents. Most humans stay far from its border—but Victory Vaughn, Boston’s only professional demon slayer, isn’t exactly human… \n Boston’s demons have been disappearing, and Vicky’s clients are canceling left and right. While fewer demons might seem like a good thing, Vicky suspects foul play. A missing Celtic cauldron from Harvard’s Peabody museum leads her to an unwelcome conclusion: Pryce, her demi-demon cousin and bitter enemy, is trying to regain his full powers. \n But Pryce isn’t alone. He’s conjured another, darker villain from Vicky’s past. To stop them from destroying everything she loves, she’ll have to face her own worst fear—in the realm of the dead itself.\n \n","cover":"https://allnovel.net/images/darklands-deadtown-4.jpg","author":"Nancy Holzner","type":"Horror","source":"allnovel","link":"https://allnovel.net/darklands-deadtown-4.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:38:29 PM"}}
