{"id":99169,"no":58,"title":"Page 58","content":"\\n\\n Edern’s sword was drawn, ready. “There are some among the clay-born,” he said in a low, tight voice, “who are half-demon.”\\n\\n “Not her.” Kane held his battle ax. “You touch her and I’ll kill you.”\\n\\n Edern’s eyes went back and forth between us.\\n\\n “You think I’m a demi-demon?” Moving slowly, I held out my left arm, the one not marked by the Hellion. “Your blade is bronze, right?”\\n\\n I pulled up my sleeve, baring my forearm. “Nick my arm. See if bronze affects my flesh.”\\n\\n Edern came forward. Kane growled a warning. “It’s okay, Kane,” I said.\\n\\n Edern flicked the blade against my arm, so quickly I didn’t feel its sting. He watched as the blood welled up. No sulfurous steam emerged. The flesh didn’t bubble or melt. He stepped back, satisfied. Both he and Kane put their weapons away.\\n\\n I pulled down my sleeve. The shallow cut had already stopped bleeding.\\n\\n “I didn’t think you were an enemy,” Edern said. “Darkblaze didn’t flame when you drew it. But the sword could have been counterfeit, and I had to be sure.” He extended his hand. “You could have killed me then. I could have let you drown in the ramp’s magic. Let us acknowledge that we may trust each other.”\\n\\n “Go on, Vicky,” Kane said at my ear. “We could use an ally.”\\n\\n I shook. A grin widened Edern’s face. He gestured at the ramp. “Try riding the flow for a little way. When you let go of the railing, keep your hand near it. Go up a few feet, then grab the railing again and lift your feet to stop yourself. See how it feels.”\\n\\n I grasped the railing and stepped onto the ramp’s base. It was like stepping into water with an undertow. I couldn’t see the magic, but I could feel the current that lapped at my feet, then moved upward, swirling around my ankles, sucking gently, urging me forward. The pull didn’t feel too strong. I looked up. I couldn’t see the peak from here. “This will take us all the way to the top?”\\n\\n “Don’t underestimate the flow. It’s more powerful than you imagine. Careful, now.”\\n\\n I let go. At once the current yanked my feet forward. My body tilted backward, and I nearly landed on my ass. I lunged forward to compensate, and my feet almost went out from under me. Trying to steady myself, I grabbed the railing. Immediately the pull lessened, flowing softly around my ankles. I looked back. In a couple of seconds, jerking around like a mannequin, I’d traveled twenty feet along the ramp.\\n\\n I looked over the railing. I was about eight feet above the cave’s floor. As Edern had done, I vaulted the railing and jumped down.\\n\\n Kane and I took turns riding the flow a little way, then grabbing the railing and jumping off. Edern shouted instructions: “Bend your knees!” “Use your arms!” “Keep your eyes up!” After a few tries, we could each stay reasonably steady as we glided up the ramp.\\n\\n Edern nodded his satisfaction. “I think you’re ready. I’ll cloak the entrance, and we can go up.” He gestured, and the entrance disappeared. “It’s still there,” he said. “But anyone looking would have to feel along the wall to find it.” He gestured toward the ramp. “Ladies first?”\\n\\n Oh, please. Okay, so Edern had last walked the human plane during the age of chivalry. But that didn’t mean I had to go first, toward whatever waited at the top of the mountain. We’d agreed to trust each other, yes, but what was that old saying? Trust, but verify. In this case, it was going to be, Trust, but don’t show ’em your back. I didn’t like the idea of an armed man behind me. And anything could be waiting at the top of the ramp. For all I knew, it could dump us out a side door into Uffern, like Pryce pushing me out that window in my client’s dreamscape.\\n\\n “You go ahead,” I said. “We’ll follow.”\\n\\n “As you prefer.” He didn’t look bothered to be first in line. Maybe I was being too cautious.\\n\\n Edern stepped onto the ramp and looked back at me. “Remember,” he said, “balance and lightness of touch.” He let go and moved upward.\\n\\n Kane went next. He wobbled a bit at the start—and nearly fell over when he looked back to see if I was on my way—but within a few yards was gliding nearly as smoothly as Edern.\\n\\n My turn. Clutching the railing, I stepped onto the ramp. Warm, tingly magic wrapped itself around my ankles and licked at my calves. When I felt a lift, like I was a leaf floating on a stream, I let go.\\n\\n Holding my arms out for balance and keeping my left hand near the railing, I let the current carry me forward. The stiffer I stood, the harder it was to stay upright, so I kept my knees soft and my back slightly rounded. Half-crouched, I felt like a sumo wrestler ready to take on an opponent.\\n\\n The current shifted and rippled under my feet, and once—just once—I made the mistake of looking down to see what carried me. The moment I tilted my head, my legs shot out from under me. I fell forward and sideways, banging my head on the wall before I managed to grab the railing. I gripped it with both hands and lifted my feet until they were out of the flow. Bent over the railing, I could see down, way down, to the bottom of the mountain. Another mistake. I closed my eyes until the vertigo passed. Okay. So now I knew why Edern kept shouting about keeping our eyes up.\\n\\n Holding on to the railing, I got my feet back under me and bent my knees. Eyes up. I let go. For the rest of the journey I kept my chin lifted, watching the rock wall ahead as I spiraled up the inside of the mountain, moving toward whatever awaited me at the top.\\n\\n 30\\n\\n LEAVING THE CURRENT WAS AS SIMPLE AS STEPPING OFF AN escalator. As I neared the top, Kane held out his arms to me. I reached out and grasped both his hands. One step and I left the current behind. We stood on a platform of rock inside the mountain, the peak doming over our heads, surrounded by granite walls—and higher up than I wanted to think about.\\n\\n Edern stood at Kane’s shoulder. As soon as I left the current, he went to the top of the ramp. He said some words in a language I didn’t recognize, making a counterclockwise spiral motion with his hand. “I’ve reversed the flow,” he said. “Now it will take us down when we’ve finished here.”\\n\\n Assuming we survived.\\n\\n “This way,” Edern said, and walked straight through the wall. My heart lurched, certain he’d tricked us, leaving us trapped on the platform.\\n\\n Then Kane followed him, disappearing into the solid rock. Immediately he stuck his head back through. It looked odd, like a trophy hanging on a wall.\\n\\n “The doorway’s here,” he said. “It’s still cloaked, that’s all.” A hand appeared below the head. I took it, closed my eyes, and stepped through. It felt like walking through a cool mist.\\n\\n When I opened my eyes, I stood in a large, flat arena, oval in shape and ringed by a waist-high stone wall. At my back was a cliff that jutted up another twenty feet, coming to a peak that capped the hollow part of the mountain. Otherwise, we stood at the top. The arena was empty except for the three of us.\\n\\n “As I told you below, this place is a lookout station for the Border Keepers,” Edern said. “To the south, the Darklands. To the north”—he gestured to our right—“Uffern.”\\n\\n I walked to the side overlooking the Darklands. Arawn’s realm stretched before me for miles, the swamp of Hellsmoor giving way to forests and rolling hills beyond. From up here, it looked quiet, peaceful, a place for shades to rest after they’d worked long and hard in their clay-born lives. There was no sign yet of Difethwr’s approach, but I knew the Hellion was on its way. I could feel each footstep in the pulsing of my demon mark.\\n\\n As soon as I focused on the mark, pain shot through my arm, and the scene before me changed. Flames burned everywhere, consuming the landscape. The swamp boiled, the rocks melted, creatures shrieked with pain and terror as their flesh charred. It felt right. Another demonic laugh bubbled up in me, and I had to fight it down. No. This was Difethwr’s vision, not mine. But calling the Hellion to me made it harder and harder to find the line where I ended and the Destroyer began.\\n\\n I closed my eyes and pulled back until I could feel that the mark I bore wasn’t me. It was the Destroyer in me, yes. But I was stronger. I had to be.\\n\\n Something brushed my arm, lightly, and I opened my eyes to see Kane’s concerned face.\\n\\n “Just making sure you’re still with us,” he said.\\n\\n I smiled. “Yeah, I’m still here.” Barely hanging on, but here. He put his arm around me, and I rested my head against his shoulder. It helped. The burning inside me calmed a little.\\n\\n Edern came up beside us. He carried a spyglass, like the one I’d used on Rhudda’s archery field, but bigger. “I have done the service I promised you, bringing you to the mountains. Now, tell me more about why you’re here. You said a Hellion approaches. What is its name? From which direction does it come?” He jerked his thumb over his shoulder, toward the demon plane. “Not from Uffern, I suspect. Occasionally a demon attempts to scale the mountains and enter our realm, but today a dozen demons or more approached the border from our side. That’s never happened before. Tell me, Lady Victory, what is happening?”\\n\\n “The Hellion is Difethwr, the Destroyer. Right now, it’s rampaging through your land.” Edern’s expression turned grim. It got grimmer as I brought him up to speed on how Pryce had used the cauldron of transformation to change hundreds of personal demons into a far bigger, far nastier demon. “The cauldron spat out the Destroyer. Pryce is bound to it, but the Destroyer is in control. I’m trying to draw them here.”\\n\\n “How do you call the Hellion?” His eyes strayed to my right arm, where the demon mark glowed through my sleeve. “Are you a sorcerer?”\\n\\n “No, I’m not. Pryce isn’t the only one with a bond to the Destroyer. Ten years ago, it marked me. I’m using that mark to draw the Destroyer this way. I can’t command the Hellion, but I can call it. When it gets here, I’ll kill it.”\\n\\n “With Darkblaze.” \\n\\n","sourceLink":"https://allnovel.net/darklands-deadtown-4/page-58.html","bookId":2612,"book":{"id":2612,"title":"Darklands (Deadtown #4)","description":"Storyline: Darklands (Deadtown #4) \\n They call it Deadtown: the city’s quarantined section for its inhuman and undead residents. Most humans stay far from its border—but Victory Vaughn, Boston’s only professional demon slayer, isn’t exactly human… \\n Boston’s demons have been disappearing, and Vicky’s clients are canceling left and right. While fewer demons might seem like a good thing, Vicky suspects foul play. A missing Celtic cauldron from Harvard’s Peabody museum leads her to an unwelcome conclusion: Pryce, her demi-demon cousin and bitter enemy, is trying to regain his full powers. \\n But Pryce isn’t alone. He’s conjured another, darker villain from Vicky’s past. To stop them from destroying everything she loves, she’ll have to face her own worst fear—in the realm of the dead itself.\\n","cover":"https://allnovel.net/images/darklands-deadtown-4.jpg","author":"Nancy Holzner","type":"Horror","source":"allnovel","link":"https://allnovel.net/darklands-deadtown-4.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:38:29 PM"}}
