{"id":21079,"no":105,"title":"Chapter 105","content":"Rife sees it all and understands it clearly enough. He would love to see how it all comes out, but he\u0027s a very busy man; he would like to get out of here before the rest of the Mafia and Ng and Mr. Lee and all those other assholes come after him with their heat-seeking missiles. And there\u0027s no time to wait for the gimpy Raven to hop all the way back. He gives a thumbs up to the pilot and begins climbing the steps into his private jet.\\n\\n It\u0027s daytime. A wall of billowing orange flame grows up silently from the tank farm a mile away, like a time-lapse chrysanthemum. It is so vast and complicated in its blooming, uncontrolled growth that Rife stops halfway up the stairs to watch.\\n\\n A powerful disturbance is moving through the flame, leaving a linear trail in the light, like a cosmic ray fired through a cloud chamber. By the force of its passage, it leaves behind a shock wave that is clearly visible in the flame, a bright spreading cone that is a hundred times larger than the dark source at its apex: a black bulletlike thing supported on four legs that are churning too fast to be visible. It is so small and so fast that L. Bob Rife would not be able to see it, if it were not headed directly for him.\\n\\n It is picking its way over a broad tangle of open-air plumbing, the pipes that carry the fuel to the jets, jumping over some obstacles, digging its metallic claws into others, tearing them open with the explosive thrust of its legs, igniting their contents with the sparks that fly whenever its feet touch the pavement It gathers its four legs under it, leaps a hundred feet to the top of a buried tank, uses that as a launch pad for another long arcing leap over the chain link fence that separates the fuel installation from the airport proper, and then it settles into a long, steady, powerful lope, accelerating across the perfect geometric plane of the runway, chased by a long tongue of flame that extends lazily from the middle of the conflagration, whorling inward upon itself as it traces the currents in the Rat Thing\u0027s aftershock.\\n\\n Something tells L. Bob Rife to get away from the jet, which is loaded with fuel. He turns and half jumps, half falls off the stairs, moving clumsily because he\u0027s looking at the Rat Thing, not at the ground.\\n\\n The Rat Thing, just a tiny dark thing close to the ground, visible only by virtue of its shadow against the flames, and by the chain of white sparks where its claws dig into the pavement, makes a tiny correction in its course.\\n\\n It\u0027s not headed for the jet; it\u0027s headed for him. Rife changes his mind and runs up the stairway, taking the steps three at a time. The stairway flexes and recoils under his weight, reminding him of the jet\u0027s fragility.\\n\\n The pilot has seen it coming, doesn\u0027t wait to retract the stairway before he releases the brakes and sends the jet taxiing down the runway, swinging the nose away from the Rat Thing. He punches the throttles, nearly throwing the jet onto one wing as it whips around in a tight curve, and redlines the engines as soon as he sees the center line of the runway. Now they can only see forward and sideways. They can\u0027t see what is chasing them.\\n\\n Y.T. is the only person who can see it happen. Having easily penetrated airport security with her Kourier pass, she is coasting onto the apron near the cargo terminal. From here, she has an excellent view across half a mile of open runway, and she sees it all happen: the plane roars down the runway, hauling its door closed as it goes, shooting pale blue flames out its engine nozzles, trying to build up speed for takeoff, and Fido chases it down like a dog going after a fat mailman, makes one final tremendous leap into the air and, turning himself into a Sidewinder missile, flies nose-first into the tailpipe of its left engine.\\n\\n The jet explodes about ten feet off the ground, catching Fido and L. Bob Rife and his virus all together in its fine, sterilizing flame.\\n\\n How sweet!\\n\\n She stays for a while and watches the aftermath: Mafia choppers coming in, doctors jumping out with doc boxes and blood bags and stretchers. Mafia soldiers scurrying between the private jets, apparently looking for someone. A pizza delivery car takes off from one of the parking areas, tires squealing, and a Mafia car peels out after it in hot pursuit.\\n\\n But after a while it gets boring, and so she skates back to the main terminal, under her own power mostly, though she manages to poon a fuel tanker for a while.\\n\\n Mom\u0027s waiting for her in her stupid little jellybean car, by the United baggage claim, just like they arranged on the phone. Y.T. opens the door, throws her plank into the back seat, and climbs\\n\\n \"Home?\" Mom says.\\n\\n \"Yeah, home seems about right.\"\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/kehuan/341/770.html","bookId":314,"book":{"id":314,"title":"雪崩 Snow Crash","description":"简介： Snow Crash is Neal Stephenson\u0027s third novel, published in 1992. Like many of Stephenson\u0027s other novels it covers history, linguistics, anthropology, archaeology, religion, computer science, politics, cryptography, memetics, and philosophy....","cover":"http://novel.tingroom.com/uploads/110714/1-110G41625252I.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/341","creation":"Aug 1, 2019 12:18:31 AM","modification":"Aug 1, 2019 12:18:31 AM"}}
