{"id":20992,"no":18,"title":"Chapter 18","content":"The Nipponese businessman lies cut in segments on The Black Sun\u0027s floor. Surprisingly (he looks so real when he\u0027s in one piece), no flesh, blood, or organs are visible through the new cross-sections that Hiro\u0027s sword made through his body. He is nothing more than a thin shell of epidermis, an incredibly complex inflatable doll. But the air does not rush out of him, he fails to collapse, and you can look into the aperture of a sword cut and see, instead of bones and meat, the back of the skin on the other side.\\n\\n It breaks the metaphor. The avatar is not acting like a real body. It reminds all The Black Sun\u0027s patrons that they are living in a fantasy world. People hate to be reminded of this.\\n\\n When Hiro wrote The Black Sun\u0027s sword-fighting algorithms -- code that was later picked up and adopted by the entire Metaverse -- he discovered that there was no good way to handle the aftermath. Avatars are not supposed to die. Not supposed to fall apart. The creators of the Metaverse had not been morbid enough to foresee a demand for this kind of thing. But the whole point of a sword fight is to cut someone up and kill them. So Hiro had to kludge something together, in order that the Metaverse would not, over time, become littered with inert, dismembered avatars that never decayed.\\n\\n So the first thing that happens, when someone loses a sword fight, is that his computer gets disconnected from the global network that is the Metaverse. He gets chucked right out of the system. It is the closest simulation of death that the Metaverse can offer, but all it really does is cause the user a lot of annoyance.\\n\\n Furthermore, the user finds that he can\u0027t get back into the Metaverse for a few minutes. He can\u0027t log back on. This is because his avatar, dismembered, is still in the Metaverse, and it\u0027s a rule that your avatar can\u0027t exist in two places at once. So the user can\u0027t get back in until his avatar has been disposed of.\\n\\n Disposal of hacked-up avatars is taken care of by Graveyard Daemons, a new Metaverse feature that Hiro had to invent. They are small lithe persons swathed in black, like ninjas, not even their eyes showing. They are quiet and efficient. Even as Hiro is stepping back from the hacked-up body of his former opponent, they are emerging from invisible trapdoors in The Black Sun\u0027s floor, climbing up out of the netherworld, converging on the fallen businessman. Within seconds, they have stashed the body parts into black bags. Then they climb back down through their secret trapdoors and vanish into hidden tunnels beneath The Black Sun\u0027s floor. A couple of curious patrons try to follow them, try to pry open the trapdoors, but their avatars\u0027 fingers find nothing but smooth matte black. The tunnel system is accessible only to the Graveyard Daemons.\\n\\n And, incidentally, to Hiro. But he rarely uses it.\\n\\n The Graveyard Daemons will take the avatar to the Pyre, an eternal, underground bonfire beneath the center of The Black Sun, and burn it. As soon as the flames consume the avatar, it will vanish from the Metaverse, and then its owner will be able to sign on as usual, creating a new avatar to run around in. But, hopefully, he will be more cautious and polite the next time around.\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/kehuan/341/683.html","bookId":314,"book":{"id":314,"title":"雪崩 Snow Crash","description":"简介： Snow Crash is Neal Stephenson\u0027s third novel, published in 1992. Like many of Stephenson\u0027s other novels it covers history, linguistics, anthropology, archaeology, religion, computer science, politics, cryptography, memetics, and philosophy....","cover":"http://novel.tingroom.com/uploads/110714/1-110G41625252I.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/341","creation":"Aug 1, 2019 12:18:31 AM","modification":"Aug 1, 2019 12:18:31 AM"}}
