{"id":106510,"no":2,"title":"Page 2","content":"Rising out of the East China Sea beyond the mouth of the Yang-Tse River, the sun was brass over a world of bronze. Though it was midwinter, the port of Yang-Chau was bristling with all manner of ships, and the cold wind off the distant mountains served to drive the larger craft into groups, as if they were seeking warmth. Clustered around them were masses of small boats offering every conceivable service to the crews of the seagoing vessels; the noise of shouts, calls, and the groaning of battened sails shuddered on the air. Along the wharves men scurried and struggled, some off-loading cargo, others preparing to take to sea, and all with the underlying urgency that came with the shortened days, as if everyone was determined to make the most of the sunlight. \"How soon until rain comes?\" Ro-shei asked his master in the language of Imperial Rome. \"Another day or so,\" said Zangi-Ragozh, the broad sleeve of his thick black-silk sen-hsien almost touching his sheet of paper on which he had just entered a column of figures drawn in Arabic numerals. \"The Black Pheasant and the Morning Star are due back in port shortly. I hope the weather holds long enough for them to return.\" He sounded doubtful as he spoke, but not worried, either. \"The Morning Star hasn\u0027t been away very long,\" said Ro-shei as he removed the paper from danger, taking care to move it very gently until the ink was dry. \"You weren\u0027t here when she left, were you? Her task is a specific one. She has gone over to the northernmost port on the east coast of Korea to pick up furs from the peoples of the forests.\" \"But the Koreans charge high tariffs for their export,\" said Ro-shei. \"And they charge the men from the forests who bring the furs to store and market them,\" said Zangi-Ragozh. \"All in all, a fine business for Korea.\" He smoothed the next sheet of paper and sketched his eclipse sigil on the upper right-hand corner with his brush, indicating this was a personal document, not an official record. \"So furs will be here in good time, and eventually dyes and spices. How many other ships are still unaccounted for?\" Ro-shei inspected the pigeonholes over Zangi-Ragozh\u0027s writing table. \"I make it seven.\" \"Yes.\" Zangi-Ragozh tapped the paper in front of him. \"I thought you had determined to purchase a tenth.\" \"That was before you left on the voyage to Saylan. I had hopes that there could be an arrangement made that would-\"He stopped. \"And doubtless worth the two years I had to be away,\" said Ro-shei. \"Still, it is good to be back in Yang-Chau.\" \"Yes; and I am relieved that you have returned. I thank you, old friend, for all you accomplished,\" said Zangi-Ragozh with quiet conviction. \"It was prudent to make such arrangements, and it was more sensible for me to do it than for you,\" said Ro-shei, dismissing the praise. \"I hadn\u0027t realized you had decided against adding a tenth ship to your fleet.\" \"Hu-my clerk; you know him-warned me that my taxes would have doubled on all the rest if I purchased a tenth; you know that foreigners in Yang-Chau aren\u0027t encouraged to have large merchant fleets,\" said Zangi-Ragozh. \"Hu was right: doubling taxes would delay actual profits for decades.\" He pressed his lips together a moment, then added, \"I doubt we will be here a decade from now.\" Ro-shei did not question this decision, but wanted to know, \"Have you decided where we will go next? Saylan may be a good choice now you have a business established there.\" This time Zangi-Ragozh hesitated a bit longer before he spoke. \"No, I do not know, not yet. I will make up my mind shortly.\" \"So you still think we should leave,\" said Ro-shei. \"I think it would be wise. I\u0027ve been here almost eight years, and I\u0027ve been trading in the region for nearly thirty years. It\u0027s time to depart, or I may overstay my welcome.\" He began to make more notes to himself, summing up his plans for the year to come, as he had done every year since his arrival in Yang-Chau. \"The Golden Moon should be back in port here by April-the Fortnight of the Flower Rains, perhaps-and the Bounteous Fortune has only been gone six months. According to the reports, the Bird of the Waves and the Dragon\u0027s Breath are only halfway through their voyages, so we will not see them for another ten months at least, and the Black Pheasant is laid up for repairs in the Indian islands; they are almost finished, according to the message brought to me last week, and the ship will come directly here. The Phoenix is somewhere in the Bay of Bengal, the Joyous Winds should be in the Southern Islands by now, and the Shining Pearl is on her way to Vijaya. The Dragon\u0027s Breath is due for a refitting when she returns. And every ship will need a full inspection.\" \"Small wonder, when you consider all they go through,\" said Ro-shei. \"Besides, it doesn\u0027t pay to skimp on maintenance.\" Zangi-Ragozh frowned as he stared at his schedule. \"Do you know if Chiu Tso-Feng will be available to repair sails for us? If the storms have been as bad as we\u0027ve heard, there will be much to mend and replace.\" \"I\u0027ll send word around to his warehouse, to find out,\" Ro-shei offered. \"And I\u0027ll put a deposit on his labor for this company. He will have a great deal of work to do.\" \"And I would prefer not to be at the end of his list. I\u0027ll give you money for the deposit-it may need to be substantial.\" He looked down at his notes to himself; he had written them in Chinese characters so that no official suspicions would be raised about him. \"I\u0027ll prepare a work order for him, as well, so that we needn\u0027t spend days squabbling.\" \"A good notion,\" said Ro-shei. \"I\u0027d prefer to spend my time at the house rather than this office.\" \"Yes. This place is too exposed,\" said Zangi-Ragozh. He shook his head. \"Here, at least, the clerks know they can order every aspect of the business dealings. At the house, the servants fear there may be something too foreign about me, and that frightens them.\" He chose another sheet of paper and began to write out his instructions to the sailmaker, pausing thoughtfully over the amount of money he was prepared to advance to Chiu. \"But you\u0027ve entertained almost all the important officials here in Yang-Chau. You have guests coming tonight, and they must not fear you if they accept your invitation, no matter how much trepidation they may harbor toward other foreigners.\" \"Personally of me, perhaps,\" Zangi-Ragozh allowed, \"but the policy toward foreigners remains the same, and a pleasant social association will not change it. As much as Councillor Ko and Professor Tsa may like my company, it is not the kind of contact that will stand much testing, particularly with the current dynastic conflicts, for knowing strangers can appear sinister to those whose hold on the throne is shaky. As far as is prudent, the local officials have come to like me as well as tolerate me, but the liking is superficial: no friendship will supersede patriotic duty, not when the friendship is with a foreigner with whom there is no larger obligation than good manners.\" His face took on an ancient exhaustion that vanished almost as quickly as it appeared. \"I\u0027ve spoken to Meng about dinner,\" Ro-shei said, aware that it would be unwise to pursue their discussion. \"He assures me the kitchen will have everything ready on time. Nine courses, and rice wine throughout. By anyone\u0027s measure, a handsome offering.\" \"Thanks to Meng.\" Zangi-Ragozh smiled, and the reserve that had claimed him eased a little. \"Splendid. That man is a treasure-a prince among cooks. I wish I still ate when I smell the dishes he has concocted.\" \"Even his treatment of raw meat is wonderful. On my return, he prepared a marinated loin of beef that was astonishing,\" said Ro-shei. \"So you said at the time.\" Zangi-Ragozh finished making notes to himself and remarked as he held up the paper to help the ink dry, \"You know, I like this better than parchment and vellum. Or papyrus.\" \"It doesn\u0027t endure as well,\" Ro-shei said, reaching up to pinch out the oil-lamps that hung over the writing table. Now that the sun was a bit higher in the sky, the office had sufficient illumination to make the oil lamps unnecessary. \"No, perhaps not. But with reasonable care, it could hold up for some years, I would think.\" He laughed. \"A few centuries, at least, provided it is kept dry. The surface does not crack. And the ink stays with it, soaked in.\" \"It does the same on silk and cotton,\" said Ro-shei, not to argue, but to point out the comparisons. \"Yes. I still prefer this,\" said Zangi-Ragozh. He reached out for the red inkpad and his chop to fix it on the sheets of paper he had used. \"This will keep Magistrate Lin satisfied when he makes his semiannual review of my businesses.\" \"Do you think he will be inclined to adjust your taxes yet? You met the residency requirements three years ago. He has the option of adjusting the percentages you pay, doesn\u0027t he?\" Ro-shei glanced at the stack of receipts that lay under a paperweight in the figure of a naked dancing dwarf. The little statue was Roman, and Zangi-Ragozh had had it for almost five hundred years, a gift from Titus Petronius Niger after he had fallen from Imperial favor. \"Ah, but since that would mean lowering what I pay, I doubt he will exercise that alternative scale of taxation.\" He printed his chop on the three sheets of paper that would be part of his official record of transactions, then added a dollop of sealing wax and stamped his sigil into it as well. \"There.\" Zangi-Ragozh handed a small string of cash to Ro-shei; the coins clinked softly as Ro-shei slipped the string onto his wrist. \"For Sailmaker Chiu. And here is my work order.\" \"Very good. I take it you\u0027re going back to the house now?\" Ro-shei was already busy tidying the office, imposing a strict order on the room. \"Yes. With guests coming at midafternoon there are a few preparations I still need to attend to.\" Zangi-Ragozh started toward the door. \"You\u0027ll make sure the dancing girls and musicians are prompt.\" \"Of course. I\u0027ve arranged for Yei-Lan to remain for the night; with Dei-Na leaving, you need not deny yourself,\" Ro-shei said. \"You\u0027ll like her. She\u0027s a very capable young woman-not jealous or too greedy.\" He rolled the work order and secured it with a narrow silk ribbon, then tucked it into his capacious sleeve. \"Will you change clothes for the dinner?\" \"I may,\" said Zangi-Ragozh. \"It depends on how much I have yet to do.\" \"Are you still planning to present your guests with gems?\" Ro-shei asked. \"I know you do not approve. Can you tell me why?\" \"Well, such generosity can create more envy than you think it will,\" Ro-shei said cautiously. \"You know how venal some of your guests are.\" \"This isn\u0027t Rome, and these men aren\u0027t Senators, and the Emperor is not a young, capricious degenerate, as was the case when we were last there. The Wen Emperor in the west may be new to the throne, and as much Turkish as Chinese, as are many men of rank in the north, but he has capable men around him, which counts for something,\" said Zangi-Ragozh with a touch of impatience. \"In the two years you were gone, I have done much to improve my dealings with my fellow-merchants and the authorities, and I hope that will hold me in good stead now.\" He smiled briefly. \"I will not rely on them, but I will not despair, either.\" Ro-shei did not quite smile. \"You said yourself that they are not staunch in their support.\" \"No, but they are not malicious, either. That would take too much time, and they have better uses of it.\" Zangi-Ragozh opened the door and stepped into his outer office where two junior clerks were busy calculating on abacuses. \"What news?\" he asked the nearest clerk. \"Four bales of rough silk arrived in the warehouse,\" came the answer. \"Hu is there now, inventorying them.\" \"Has it been paid for yet?\" Zangi-Ragozh took a step toward the long writing table. \"Yes; three months ago. Shipment was delayed because of hard rains,\" said the clerk. \"It is scheduled to be shipped out for the Southern Islands.\" \"That won\u0027t be for several months,\" said Zangi-Ragozh. \"No, it won\u0027t,\" said the clerk as if expecting a rebuke. \"Then make sure it is properly stored in the warehouse. I would rather not lose the cloth to rats or rot or moths.\" He nodded toward the little oil-powered stove. \"Have you enough tea?\" \"Yes, thank you,\" said both clerks almost in unison. \"Very good.\" Zangi-Ragozh made a sign of approval as he crossed the rest of the outer office to the door that led down a flight of stairs to the street. He squinted at the sun\u0027s glare as he stepped into the light and was glad once again of his native earth lining the soles of his leather boots. Still, he kept to the shadows as much as possible as he made his way to where he could hire a sedan-chair to carry him to his house. The bearers accepted the coins he offered and went off at a jog as soon as he had climbed into the covered chair. They made their way through the traffic of the waterfront and the markets to the broad roads that led to the city gates, over the great bridge spanning the river, turning along the north bank of the Yang-Tse toward the part of the city where prosperous merchants had their extensive homes. Zangi-Ragozh\u0027s house was in an extensive park, set back from the road and surrounded by a high wall. At the gate he got out and tipped the bearers before entering the grounds of his compound, then paused to ask the gatekeeper if anyone had called. \"Yes. The foreign merchant Lampong-Chelai is waiting for you. He arrived a short while ago.\" \"Thank you, Sung,\" said Zangi-Ragozh. \"I\u0027ll just go talk to him now.\" \"Do you expect anyone else?\" Sung called after him. \"I had not expected Lampong-Chelai,\" said Zangi-Ragozh. \"But no, I expect no one else until my guests arrive for dinner. Oh, Ro-shei will be back shortly, with musicians and dancers.\" \"I will see they are admitted,\" said Sung. Zangi-Ragozh nodded and walked up the long, curving path that led to his house; around him, the gardens were murmuring in the cold wind, many of the trees with bare branches, and only a few, hardy shrubs showing much color. As he reached the front of his house, Zangi-Ragozh paused to survey the building, then trod up the broad, shallow steps to the door, where his steward, Jho Chieh-Jen, admitted him promptly. \"You have a visitor,\" he announced. \"So Sung informed me,\" said Zangi-Ragozh. \"I suppose you have seen to his comfort?\" \"He is in the main salon; I have sent in oil cakes and bitter mountain tea.\" Jho ducked his head respectfully. \"If you would care to see him now?\" \"I\u0027ll go,\" said Zangi-Ragozh, waving away Jho\u0027s offer of escort. He noticed that the Roman painted-plaster panel was askew on the wall again and reminded himself to reweight the frame so it would hang evenly. As he opened the door to his salon, he straightened the red-edged cuffs of his black-silk sen-hsien. \"Good day to you, Foreigner Lampong-Chelai. I trust fortune smiles upon you.\" \"Good day to you, Foreigner Zangi-Ragozh,\" said his guest, rising from a rosewood chair near the window. He was a middle-aged man, round-faced and plump, also in a sen-hsien, as law required, but one of persimmon-colored silk decorated with embroidery in the style of Vijaya, his home: Lampong-Chelai was the Chinese version of his name, just as Zangi-Ragozh was of his. \"I am delighted to see you,\" Zangi-Ragozh went on, following the dictates of good manners, \"and I wonder what I am to have the honor of doing for you?\" \"I was hoping I might ask a favor of you,\" Lampong-Chelai admitted, getting down to business without the usual social persiflage expected of morning visitors. \"As you must know, there have been reports of rough seas and other dangers in the vicinity of Krakatau, the large volcano in the middle of the Sunda Passage.\" \"I know the mountain you mean, and I have been one who has had reports concerning the troubles there,\" said Zangi-Ragozh, aware that his visitor was truly worried. \"Ah. That makes my visit a little easier.\" He sighed. \"It seems that some traders are avoiding ports in the region, and that is causing many problems for the merchants in the area.\" \"I can well imagine,\" said Zangi-Ragozh. Lampong-Chelai paced the length of the salon, then came back toward Zangi-Ragozh. \"And no doubt you have seen how it can damage trade far beyond fears justified.\" \"I have; but I have also seen situations when the dangers exceeded fears, as well.\" He kept his tone completely neutral, not wanting to offend this fellow-foreigner. \"I believe this may be one such instance where the postulation of danger is far beyond any actual risk,\" said Lampong-Chelai. \"You know how the stories of such things are exaggerated. You must have seen volcanoes from time to time and know what one can expect from them-not like the merchants who have only traveled the rivers and never venture more than two days upstream. Volcanoes can be unpleasant; mostly they smoke and bellow, but nothing much happens.\" \"True enough,\" said Zangi-Ragozh. \"But occasionally, they do erupt.\" \"Yes, yes, they do. And for a while it is inconvenient,\" Lampong-Chelai declared. \"Then it is over, and the world goes on.\" He came up to Zangi-Ragozh. \"The same thing will happen now. In a year at most, the mountain will be still again.\" \"I hope that may be so,\" said Zangi-Ragozh. \"And those merchants who are not frightened out of our waters will be the ones to profit the most, taking advantage of the timorousness of others, who have not the foresight to seek out regions where trading has declined, and taking up the slack that exists,\" said Lampong-Chelai, finally reaching the point of his discourse. \"You can be among those who make this temporary misfortune into a shining opportunity, for your perspicacity will be long-remembered by the merchants whom you aid now.\" He was becoming enthusiastic, using his hands for emphasis. \"I can\u0027t approach any Chinese merchant about this without going against the foreigners\u0027 laws, but you may hear me out and benefit from the fortuity.\" Zangi-Ragozh heard him out, standing still while Lampong-Chelai made his way around the salon again. \"Of course, this would also benefit you and your business,\" he remarked while his visitor marshaled his next round of arguments. \"Yes, and it would spare a great many tradesmen a year of lean earnings. There may be some hazard at present, but those who do not let fear stop them will rejoice later, when times are better. We remember such gestures in Vijaya, as the merchants will in Sunda Kalapa, and we express our gratitude in real terms. All those ports are languishing now, because superstitious Captains avoid us in favor of more tranquil seas. If you would guarantee to keep your ships coming to the ports on the South China Sea, the Java Sea, and the Sulu Sea, we Champa may hope to prosper again when the danger is over.\" He came to a stop near the windows that looked out on a small formal garden. \"I have ships in those seas even now,\" said Zangi-Ragozh. \"The Captains have the authority to decide which ports to visit, but they have an itinerary, and I expect them to keep to it except in an emergency.\" \"A prudent provision,\" said Lampong-Chelai. \"But your Captains may panic and turn back northward if they hear too many ill reports.\" \"Some of my ships have gone to trade with India and Burma,\" said Zangi-Ragozh. \"They will have to come through the South China Sea to reach this port, and they are not likely to turn away from ports where they have done good business before, not unless there is a concern that overrides their desire for profits. Their shares are decreased when they fail to-\" \"I know, I know. It is the same with all traders,\" said Lampong-Chelai impatiently. He made fists of his hands and glowered at a place just over Zangi-Ragozh\u0027s left shoulder. \"If your Captains panic, you may lose a great deal of money.\" \"So I might,\" said Zangi-Ragozh. \"But I would rather lose money and save ships and the lives of sailors than risk too much in the name of gain.\" \"But you won\u0027t,\" Lampong-Chelai insisted energetically. \"That\u0027s what I\u0027m trying to tell you. You need not risk anything. There is profit to be made, especially now, when so many of the southern ports are seeking merchants to trade with, for they need to find markets and will show favor to those who help them in these trying times. The merchants who will not go to the ports of Sumatra and Java and others in the region are being superstitious fools. They are shying away from nothing-nothing! This volcano, Krakatau, is often spewing rocks and emitting odors and causing the sea to froth. Every year something happens that puts the timorous to flight. And every time it happens, sailors are frightened by it and stay away from many ports, even some distant ones, for fear of what might-and that might is a remote one-happen.\" For a long moment, Zangi-Ragozh said nothing. Finally he gave a little nod. \"Very well. I\u0027ll consider what you have told me, and if it is in accord with the opinions of my Captains, I will do what I can to encourage them to keep to their itineraries. Better than that I cannot promise, what with the time it takes to get messages to my ships.\" Lampong-Chelai took a long breath. \"I am most grateful to you, worthy foreigner. You have given me cause to hope for my business and my people. If you are willing to tell your friends among the Chinese merchants that tales will not deter you from attending to your voyages, they may follow your example. If enough of them continue to trade in our region-\" Zangi-Ragozh held up his hand. \"No. I may choose to order my Captains to continue-at their discretion-but I will not attempt to influence the Chinese. First and foremost, they would not listen to me. Second, if any mishap occurred, I would be held responsible. That could lead to ruin and prison if their ships came to harm on what they deemed to be my account. As you are well-aware,\" he added with a stern look. \"They wouldn\u0027t hold you responsible,\" said Lampong-Chelai. \"Wouldn\u0027t they.\" Zangi-Ragozh shook his head, recalling an incident from his past when precisely that had occurred. \"I am not prepared to gamble on that.\" \"Well, at least you can keep such cautions to yourself,\" Lampong-Chelai said, doing his utmost to recover himself; he had seen something in Zangi-Ragozh that had shocked him, an implacability he had not realized the foreigner possessed. \"I would be a fool to do that,\" said Zangi-Ragozh calmly; his eyes were intent. \"But you can help us-all merchants must be willing to stand with other merchants, or we will all be the tools of the tax collectors and the customs agents. You are one of the most successful of us foreigners, and we must act-\" Taken aback at his lapse in conduct, he went to the table where the teapot stood, and he poured the last of the tea into his cup while struggling to restore his composure. \"I thank you for hearing me out. You have been most gracious. I fully comprehend your reservations.\" \"I have not promised to continue to order my ships to visit the ports in question,\" Zangi-Ragozh pointed out, his dark eyes still unfathomably grim. \"I have said only that I will recommend that my Captains do so unless in immediate peril. I will defer to their judgment in matters of safety. They are the ones braving the oceans, not I, and they will have to face the dangers when they arise.\" He looked away, his discomfort at the thought of so much water making him queasy. \"Yes. I understand. I still thank you. Not many will even do me the courtesy of listening to me.\" Lampong-Chelai drank the tea and smiled. Zangi-Ragozh inclined his head. \"Very well. So long as we understand each other.\" \"We do,\" said Lampong-Chelai, setting the cup down with care, and attempting to conceal the nervousness that had taken hold of him. \"You have many beautiful things, foreigner. I have rarely seen so many.\" \"I have gathered them for many, many years,\" Zangi-Ragozh said, not mentioning that the many years were counted in centuries. \"Obviously you have the favor of the God of Fortune. May he continue to guide you.\" Lampong-Chelai fitted his hands together. \"I won\u0027t trespass on your good nature any longer.\" With that, he started toward the door. \"Your steward may see me out.\" \"He could. Nevertheless, I will have the pleasure of saying farewell to you at the front door,\" said Zangi-Ragozh, preparing to follow his visitor out into the hallway, and all the while wondering how dire things were in Sumatra and Java that a Champa merchant from Vijaya should come to plead for them. Text of a writ of manumission from Zangi-Ragozh, presented to Dei-Na, and recorded in the office of the Magistrate\u0027s Archives of Yang-Chau: Be it known throughout the city of Yang-Chau and all the Middle Kingdom, that the twenty five-year-old concubine Dei-Na is herewith granted her freedom by the foreign merchant Zangi-Ragozh, who purchased her from her father; the wheelwright Ma Fan-Long, on the ninth day of the fortnight of the Frost Kings in Dei-Na\u0027s eighteenth year, for the sum of four gold bars and two unpolished emeralds, is now and perpetually a free woman, with no bonds or other considerations mitigating her freedom. This Dei-Na has been a most devoted concubine, and her devotion deserves every emolument to which she may be entitled under the rule of the Magistrate and the will of the Emperor. Any attempt to lessen what I provide or to diminish her provision in times to come impugns the honor of the Middle Kingdom as well as my own, and for that reason I am moved to provide a fund to vindicate her liberty and to permit her to enjoy her possessions and privileges in peace, without arbitrary impositions of the demands of court, of Magistrate, or of relatives. She is to be entitled to the support of such counsel as she requires in order to preserve what she has been granted. There are no limits or conditions attached to this release, which is total and without qualification or hindrance. Her status is that of any freeborn woman without obligation to her family or to anyone seeking to make a claim upon her. She is not being returned to her father or any member of her family, and they have no cause for pursuing any hold on her for they accepted full payment for her from me seven years ago, and a document to that effect is recorded at the Tribunal. I, Zangi-Ragozh, who paid for her, guarantee her freedom and independence, and ensure that no one may vacate the unconditional terms of this writ, save the Emperor himself, in accordance with the law of the land. In order that she may maintain herself, I, Zangi-Ragozh, give to her a house in Yang-Chau located on Waning Moon Street, which has been completely paid for and staffed with three servants, whose salaries are to be paid by my shipping company, and further provide her with the income from my merchant ship Golden Moon so that she may continue to enjoy the freedom she has been granted and live in a manner appropriate to virtuous women. The sum of ten gold bars and fourteen jewels of various sorts, along with six fine pearls, have been given to Dei-Na so that she may not have to marry or sell herself in order to survive. If she wishes to marry, there are five gold bars on deposit with the Magistrate of Yang-Chau to pay her bride-price so she will not have to ask anything of her father. The furnishings of her house are hers, as are two horses and a carriage for her use. No one may make a claim against any of these gifts, and any such attempts are to be paid through my business, the Eclipse Trading Company. In verification of this, I fix my name, my chop, and my sigil on this day, the tenth day after the Winter Solstice in the Magisterial Records Offices of Yang-Chau. Zangi-Ragozh (his sigil, the eclipse) (his chop) The Seal of the Magistrate\u0027s Secretary (his chop)","sourceLink":"https://allnovel.net/dark-of-the-sun-saint-germain-17/page-2.html","bookId":2501,"book":{"id":2501,"title":"Dark of the Sun (Saint-Germain #17)","description":"Storyline: Dark of the Sun (Saint-Germain #17) It is the 6th century of the common era. The vampire Saint-Germain, known in this time as Zangi-Ragozh, is peacefully doing business in Asia when the island of Krakatoa explodes in a massive volcanic eruption. Tidal waves swamp harbors hundreds of miles away, destroying trade ships and their cargoes; tons of ash and dirt are flung into the air. In the months to come, the world grows colder and darker as the massive volcanic cloud spreads across the globe, blocking sunlight. Sea trade is ravaged. Crops fail. Livestock, and then people, begin to starve. Disease spreads. Panic rises. As always in times of trouble, foreigners-and the vampire is always a foreigner-become targets. Fleeing toward the West, where he hopes to find safety and sanity, the vampire travels with a nomadic tribe led by Dukkai, a female shaman who soon becomes Zangi-Ragozh\u0027s lover. But Zangi-Ragozh\u0027s problems are far from over. His vampire nature is discovered by an enemy; he begins to starve; he is betrayed by one he cared deeply for; he loses everything, even his last sack of his native soil. With the True Death looming, Zangi-Ragozh tries to reach sanctuary in his ancient homeland. Transylvania.","cover":"https://allnovel.net/images/dark-of-the-sun-saint-germain-17.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/dark-of-the-sun-saint-germain-17.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 10:58:32 PM"}}
