{"id":106536,"no":31,"title":"Page 31","content":"As the junction port of the Sea of Azov and the Don River, Sarkel was far from prepossessing, being a partially walled settlement with a hodgepodge of wharves and warehouses on the southeastern bank where the Don emptied into the sea, and a cluster of brick-sided, wood-topped buildings collected behind them, with three market-squares, just now every one of them empty but for a few local hunters and farmers displaying their offerings to wary townspeople. Under a gray sky, the promise of spring seemed to have vanished, leaving behind a dejected air over the whole region. At the Fair Winds, the most appealing of the travelers\u0027 inns available, Ragoczy Franciscus and Rojeh were ending their three-day stay, preparing to take the ferry over the Don. It was a long crossing, and the river was running high and fast, making the innkeeper, a Donman using a Greek name for the sake of Byzantine business, caution the two foreigners, \"Make sure you lash everything down, and put two leads on your animals.\" \"We will,\" muttered Ragoczy Franciscus, handing over two gold coins, a most generous settlement of their account. \"Well, you are the sort of travelers I want to see back again,\" said Leandros, winkling the coins out of sight. \"Assuming anyone travels again.\" \"We must hope that they will,\" said Rojeh. \"They say there has been fighting far to the west. The Byzantine Emperor is striving to increase his empire,\" said the innkeeper. \"We have no argument with the Byzantine Emperor,\" said Ragoczy Franciscus, who had overheard Leandros\u0027 remark. \"I hope it will not adversely affect your business.\" \"What business? If men like you are not carrying merchandise from the East, what is left for me? Just monks and other religious,\" scoffed Leandros. \"They expect to be housed for nothing, as a recognition of their holy work.\" \"That is unfortunate for you,\" Rojeh sympathized, and looked over at Ragoczy Franciscus, who nodded once and glanced out into the courtyard. \"The mules are loaded and the horses saddled. We have only to take them and depart. I have copper coins for the grooms.\" \"Good,\" Ragoczy Franciscus said; his voice was husky but improving from what it had been. He made a point of using it with Rojeh. \"And feed?\" \"They\u0027ve sold us a sack of grain, and they say that in Donrog, they have more grain for sale-or they have had. A sack on this side and another on the far side of the crossing, and we should reach the Dnieper without running out of grain.\" Rojeh pointed to the sack on Ragoczy Franciscus\u0027 mule\u0027s saddle. \"They\u0027ve shifted your chest of earth to my mule, and the clothes case to yours, as well. It makes a more equitable distribution of loads.\" \"So long as the weight is even,\" said Ragoczy Franciscus, and went to mount his blue roan. \"The ferry is at the foot of the Red Wharf,\" said Rojeh as he took his stallion to the mounting block and swung into the saddle. \"They said they only have three other passengers-local fur traders.\" \"I imagine they have delivered their hides and are returning to their hunting grounds,\" said Ragoczy Franciscus. They rode out of the courtyard and along the end of the market-square, their horses walking briskly, and the mules, for once, willingly keeping pace with them. Turning toward the Red Wharf, Rojeh reminded Ragoczy Franciscus, \"We\u0027ve paid our passage already. If they ask for more, I will remind them.\" \"Yes. Good.\" He was already hoarse and so welcomed the chance to remain silent until asked to identify himself at the loading end of the slip. The ferrymen were thick-bodied, their shoulders made massive by their work, and their hands hard as planking from constant exposure to salt spray; they were dressed in wide-cut paragaudions belted in broad bands of leather, with fur leggings and northern-fashion boots; they all had short thwarts to sit upon to ply their oars, and poles to use in shallow water. They got the two men and four animals aboard their ferry with minimal fuss and helped to tie the double leads so that the horses and mules would not be moving about the deck of the wide-beamed boat. \"Is there somewhere we can sit during the passage?\" Rojeh asked, seeing Ragoczy Franciscus turn pale. \"Donrog is a distance away.\" \"Of course,\" said one of the men. \"At the edge of the hold. There\u0027s a wide lip on the hatch.\" \"Very good,\" said Rojeh. \"Is there much cargo in the hold?\" \"Enough for ballast,\" said the man, and laughed. \"What about their cargo is amusing?\" Ragoczy Franciscus asked as he sat down, taking hold of the rim of the hold with both hands. \"Probably nothing,\" said Rojeh. \"You know how men of this stripe are.\" Ragoczy Franciscus rubbed his newly trimmed, very short beard and remarked, \"The fur traders are not aboard yet.\" \"No. But they will be shortly. I heard one of the ferrymen mention it,\" said Rojeh, who could sense Ragoczy Franciscus\u0027 discomfort more than he could see it. \"Unless something has changed from last night, we should then be off for the northern shore.\" \"Doubtless the fur traders have business to attend to, and that delays them,\" said Ragoczy Franciscus a bit distantly; he stared out across the swirling water to the far shore, and he calculated how long their crossing would be. \"This may be difficult.\" \"So I thought, said Rojeh. \"I have your seat-cushion for you. It is filled with your native earth.\" \"That will help,\" said Ragoczy Franciscus, and waited where he was while Rojeh went to take it from their clothes case. \"Thank you, old friend. I apologize for being surly, but-\" \"You are hungry. I know. You need not explain.\" Rojeh sat down beside Ragoczy Franciscus and handed him the cushion. \"Anyone fasting as long as you have may be expected to be querulous from time to time.\" \"Yes. Lamentably, I am that. It is wearing upon me, these months of no nourishment.\" He took a deep breath and went on, \"In a few days, when you get your meal, let me try the blood before you kill it, if you would.\" \"Do you think you\u0027re ready?\" Rojeh asked. \"I will know soon enough,\" said Ragoczy Franciscus a bit grimly. \"All right. Tell me when you want-\" He stopped as the ferry lurched; three fur-clad men were coming aboard. All three carried a considerable array of weapons associated with fur traders-knives, bludgeons, scrapers, hatchets, awls, and pikes-and all three looked eager for a fight, for they swaggered up to the tillerman and confronted him with crossed arms, their stances promising bellicosity. \"I\u0027ll fight you for passage,\" a fur trader grumbled, his head lowered as if to charge the tillerman. \"No, you will not,\" said the tillerman, unaffected by this demonstration of pugnacity. \"You will pay as all must pay.\" \"Are you afraid to fight me?\" the fur trader challenged. \"No. I am afraid to damage my hands,\" said the tillerman. \"That should make you careful about fighting me, since you want to reach Donrog.\" \"We can hold it on course,\" said the fur trader pugnaciously. \"You, Tszandi. You\u0027re strong enough.\" \"I may be,\" said the third fur trader. \"But I know nothing of these waters.\" \"You see, fur traders, if you know the course, you can steer it, just as he observed,\" said the tillerman in a very rational tone: clearly he had had such encounters in the past. \"But the Don is treacherous, and the tide is turning.\" Grumpily satisfied, Bahkei stepped back and slung his arms around his two companions\u0027 shoulders, saying, \"If he is so worried about his precious fingers, then let\u0027s leave him to it.\" The men strutted away as if they had bested the tillerman in a contest; they took up positions in the bow of the ferry, braced on the rise of the hull at the loading plank, elbows resting on the wale, facing the water they were bent on crossing. \"Powerful men, those three,\" said Rojeh. \"And ready to be away,\" said Ragoczy Franciscus, adjusting his cushion against the vertiginous pull of the river. In a very tittle time, the ferry shoved away from the Red Wharf and started across the expanse of the Don\u0027s mouth, the ferrymen poling the boat out as far as they could before sitting down to row the rest of the way. Beneath the boat, the water churned and contended, tide against current, making eddies of froth along the way. The ferrymen knew their jobs well, and the boat made good progress toward the northwestern shore, passing groups of fishing boats and small open craft in which one or two men pulled up nets of fish and crabs. They were somewhat more than halfway across when the wind kicked up, bringing spitting rain and blustery gusts that rocked the ferry and made the crew strain to keep at their work. As the ferry continued to bounce toward the far bank, the horses and mules grew restive and struggled against their cross-ties. Rojeh and Ragoczy Franciscus went to tend to the animals, making every effort to calm them with reassuring words and gentle pats, but in spite of such attention, the horses sweated and pawed in dismay and the mules kept their heads up and eyes rolling. \"Knock them on the head,\" one of the fur traders recommended while Bahkei and Tszandi leaned over the prow as far as they could next to the hoisted landing plank, to mark their progress through the water. \"It would only make matters worse,\" said Ragoczy Franciscus as calmly as he could. \"They have a long way to go yet today.\" \"A hide that color, it could be worth a lot,\" the fur trader said. \"She is worth more as a living horse,\" said Ragoczy Franciscus. The fur trader laughed and went back to his place in the bow; he spoke with his companions and elicited laughter from them as well. The men made loud, derogatory remarks about foreigners, but gave it up when neither Ragoczy Franciscus nor Rojeh bothered to respond. Gradually the far shore grew nearer, and as if to make the passage more memorable, the ferry was increasingly the plaything of the wind, skidding and wallowing on the capricious waves. The horses neighed in distress and strove not to fall; the mules became more refractory, striking out with their hooves and teeth when the boat pitched too vigorously. Rojeh came up to Ragoczy Franciscus and raised his voice to be heard. \"This is very hard. They\u0027re overexcited and that makes for problems.\" \"We will have to rest the animals on the other side,\" said Ragoczy Franciscus as loudly as he could. \"Is there anything you can give them?\" Rojeh asked. \"I have no more syrup of poppies, or pansy infusion.\" He cocked his head toward the fur traders. \"If there were beer aboard, they would have consumed all of it by now, I should think.\" \"They would like beer,\" Rojeh agreed. \"Keep with your horse and your mule. Between us, we should be able to quiet them.\" There was more hope than certainty in this remark, and as Ragoczy Franciscus spoke, an especially treacherous wave sent a cold spray over everyone on the ferry; the horses tried to bolt and the mules brayed their outrage. He, himself, was feeling the stress of the water, and as he moved about the deck, he had to hold on to lines and braces to keep from succumbing to the queasiness that had possessed him since the ferry had struck the confluence of tide and current. The tillerman bellowed instructions to the men at the oars, and the ferry began to turn into the waves, riding up and down in a more regular rhythm, but making steadier progress. They kept on this angular course until the northern shore was looming ahead, and then they turned to starboard and made for the slip that was their port; three large docks flanked it, and four ships were tied up at them, sailors busy dropping fenders over the sides to keep these ships from being damaged by the rising storm. Maneuvering among these trading vessels, the ferry slid into the slip, the ferrymen pulling their oars just in time to avoid splintering them on the pilings that marked their berth. A half dozen men on the dock had come running and were now shouting for lines to secure the boat in its slip, making way for the landing plank to be lowered. Amid a chorus of shouts, the plank came down, the guardrails were secured, and the tillerman swung the tiller up and lashed it in place. \"You may disembark,\" he shouted, and directed his attention pointedly to the three fur traders. Rojeh had taken a short, Roman crop from the chest of horse supplies, and he held it securely as he went to unfasten the leads of the mule, expecting resistance; he was not disappointed-the mule planted his feet and prepared to withstand any attempt to move him. Rojeh flicked the crop lightly on his rump and tugged lightly on the lead, then repeated the process: a tap followed by a pull. He did not yell or beat the animal, but kept up the steady routine, all the while aware of how Ragoczy Franciscus was getting his horse and mule off the ferry. Ragoczy Franciscus had untied all four leads, then mounted his horse and brought the mare next to the mule, using the nearness of the larger horse to force the mule to walk forward or risk being driven up against the hull of the boat. Once the mule started forward, the blue roan, used to being in the lead, walked up the landing plank, all but dancing on her forelegs in her relief to be returning to solid ground. The mule kept pace with her, and both strained as Ragoczy Franciscus stopped them at the end of the dock, where he waited for Rojeh to get the mule going. \"We can pull him for you,\" said Bahkei as he and his two companions sauntered toward the landing plank. \"He\u0027ll move soon enough,\" said Rojeh, administering another tap-and-pull combination. \"Ignorant foreigner!\" the third fur trader shouted, and laughed angrily. \"Doesn\u0027t want our help.\" Suddenly the mule, tired of the constant repetition, took a step forward and seemed willing to continue. Rojeh loosened the leads holding his stallion and scrambled into the saddle, reaching for the mule\u0027s leads and bringing him up behind the spotted horse as they made their way off the ferry and into the streets of Donrog. The town was smaller than Sarkel, more of a way station than a village, with only one market-square and a clutch of thatched-roof inns that were little better than the stables behind them. Most of the buildings were within the double stockade that provided a degree of protection to the inhabitants of Donrog; the few beyond the walls appeared to be part of a small compound constructed around a domed church with an Orthodox cross atop it. Even now, at midday, no official met the new arrivals, but a swarm of youngsters came running to surround the newcomers, blocking Rojeh\u0027s and Ragoczy Franciscus\u0027 progress as they begged for money and food. Ragoczy Franciscus opened his wallet and took out a handful of copper coins, which he tossed some distance away, opening a path for him and Rojeh to approach the market-square. \"We need more grain.\" \"Yes, a sackful at least, if we can find a peasant selling any.\" Rojeh did a quick scrutiny of the market-square and pointed to the far end. \"There. That stall.\" \"I see it,\" said Ragoczy Franciscus. \"The price is likely to be-\" \"-high,\" Ragoczy Franciscus finished for him. \"I assumed that would be the case. And we are in no position to refuse to pay.\" \"Need I remind you that we are getting low on funds?\" Rojeh asked. \"I\u0027m aware of that, too; at least we still have a handful of jewels. If we can find a merchant who knows their value, we should have sufficient to cover our expenses between here and the Carpathians,\" said Ragoczy Franciscus as he rode up to the stall in question. A short-bearded peasant sat in one corner of the cloth-walled stall, a small knife in one hand working away on a length of wood in which he was carving leaves, flowers, and the faces of animals. He looked up as Ragoczy Franciscus halted and dismounted, then gestured a greeting, adding in dreadful Byzantine Greek, \"Sacks of feed. Two sizes. Good for horses and other draft animals.\" He reached over and patted the remaining sacks as if approving of a pet dog. \"How much?\" Ragoczy Franciscus asked. \"For the larger.\" \"Six silver coins-Angels, if you have them.\" His eyes were sunk in deep wrinkles that gave the impression of goodwill and amusement; only strict business was in his voice. \"That is almost as much as an ox,\" said Rojeh, who had stopped behind Ragoczy Franciscus. \"I have grain. You have animals. You need feed, and I have a family.\" He went back to carving. \"Twenty coppers. Persian coppers\" was Ragoczy Franciscus\u0027 counteroffer. \"Perhaps, for a smaller sack,\" said the peasant. \"For the larger sack,\" Ragoczy Franciscus insisted. \"And the sack\u0027s contents emptied from those hempen ones into a linen sack, to be sure it contains only grain, and to keep the grain from leaking away.\" \"What do you take me for, a foist?\" the peasant grumbled. \"Grain is scarce and money is also.\" Ragoczy Franciscus leaned forward in the saddle. \"Twenty Persian coppers for a large sack.\" Something about his manner made an impression on the peasant, for he sat back, startled by his sudden willingness to consider the offer. \"Let me see the coppers,\" he said, looking away from the foreigner in the black paragaudion edged in dark-red silken cord. He stared down at the gloved hand that contained eight large coins. \"Are they all the same?\" \"Every one of the twenty is the same,\" said Ragoczy Franciscus. After a short silence, he said, \"If you do not wish to sell, then we will look elsewhere.\" The peasant stumbled to his feet. \"No. No. I will take twenty Persian coppers for a large sack, and I will show you it has only grain in it.\" He was surprised to see Ragoczy Franciscus dismount and go to his mule to take a sack from the wad of cloth behind the pack saddle. \"You may use this sack,\" said Ragoczy Franciscus, handing it to the peasant. Knowing better than to protest to a man of such bearing, the peasant took the sack and went to open the largest sack of grain; he used a scoop to bring out the contents, transferring them into the linen sack, saying as he did, \"Three years ago, you could have got two large sacks of grain for three Persian coppers, for grain was plentiful and the travelers came through Donrog in droves. Now grain is costly, and there is little to buy. Not even the rats are thriving.\" \"It is thus all through the world,\" said Ragoczy Franciscus, watching the scoop carefully. \"I will not cheat you,\" said the peasant in disgust. \"If the market were busy and the crops bountiful, I might slip a stone or two into the sack. But not now, when people sicken and starve, and sheep and goats wander untended in search of grass.\" \"Sheep and goats are not the only ones wandering,\" said Ragoczy Franciscus, thinking of the Desert Cats and many of the other clans that roamed the steppes. \"That does men like me no good-the eastern men come with their flocks and their herds, and before my neighbors and I can drive them off, half our crop is gone, and not one coin or a pair of goats to show for it.\" He spat again and got the last scoop of grain out of the hempen bag. \"There. Is it satisfactory?\" \"Yes,\" said Ragoczy Franciscus, and handed over the twenty coppers, counting each one aloud as he placed it in the peasant\u0027s cupped palms. \"If you are returning this way, remember me,\" said the peasant as Ragoczy Franciscus lifted the sack and went to secure it to his mule\u0027s pack saddle. \"Be careful on the road. There are desperate men about.\" He stepped back from the foreigner on the handsome mare. \"You and your companion should have guards.\" \"If they are safe,\" said Ragoczy Franciscus. \"If not, the guards are more dangerous than outlaws.\" The peasant laughed raucously, rubbing his knuckles into his eyes. \"True. True. True,\" he repeated as Ragoczy Franciscus and Rojeh rode away, their mules following up behind them. Beyond the market-square a dozen children thronged around them, most of them begging belligerently; Ragoczy Franciscus took out a few small brass coins and cast them some distance away. The children rushed after the money, shrieking as they strove to gather up the coins. Once again Ragoczy Franciscus and Rojeh slipped away, bound toward the southwestern gate and the road that led toward the Black Sea. A pair of unkempt men served as guards at the gate; they demanded payment of Rojeh and Ragoczy Franciscus, accepted four copper coins, and shouted after them that the first inn on the road could not be reached by sundown. Ragoczy Franciscus glanced toward the expanse of water visible through the trees. \"At least the dizziness has stopped.\" His voice was raw. \"There are still the Dnieper and the Bug to cross,\" Rojeh reminded him. \"And the Dniester and perhaps even the Danube,\" he said as they entered the shelter of a copse of willow, taking care to keep on the poorly maintained track. Rojeh nodded. \"Will we reach your homeland by autumn, do you think?\" \"I hope we may,\" said Ragoczy Franciscus. \"I would prefer not to spend another winter on the road.\" They continued on through the willows and out across a field of cold-dry grasses, then into another stand of trees; the road led almost due west and they marked their progress by the angle of the sun ahead of them. Occasionally they caught a flash of ever-more-distant water through the trunks and branches, but by midafternoon, this was lost to sight as they angled away from the Sea of Azov. \"What town do we reach next?\" Rojeh asked as they noticed a distant barn at the far side of an empty field. \"Poranache, as I recall,\" said Ragoczy Franciscus. \"If it is still there.\" \"I take your point.\" Rojeh said nothing more for almost a league, then spoke up again. \"Do you think that we should ride until we reach that inn?\" \"The one the guards shouted about? Who knows if they are to be believed,\" said Ragoczy Franciscus. He noticed a few head of cattle standing in the shade of the trees. They were skinny and messy enough to have been on their own for some time, and so he approached them with caution, only to have them bolt away, lowing in distress. \"They are wise to run, I suspect.\" \"You mean that they would tempt more than animals?\" said Rojeh. \"Either as stock or as meat,\" said Ragoczy Franciscus. \"At least there is a little grass coming up now, and so they can forage for their food.\" He continued on away from the cattle. \"Whoever had claim on them no longer does.\" \"But think of them, out there, where anything might befall them,\" said Rojeh. \"They are no worse off than we are,\" Ragoczy Franciscus reminded him. \"We have weapons and-\" He got no further, for a sudden burst of whooping and shouting made the woods ring as a small band of heavily armed men on ponies rushed down upon them, swords and lances drawn, and murder in their impassive faces. \"Back against the largest trees!\" Ragoczy Franciscus ordered, moving his blue roan with pressure from the side of his leg. \"Use your shimtare.\" Rojeh struggled to comply, holding the stallion and pulling on the mule\u0027s lead; he managed to get his shimtare out, but could not bring it into play without risking cutting the mule. He swung the curved blade around his head, hoping to deflect anything the attackers might hurl at him. \"I can\u0027t get the mule around.\" Ragoczy Franciscus did as much as he could to make more room for Rojeh\u0027s mule and nearly exposed himself to a number of furious blows. He drew his mace from its sheath and swung it, striking the nearest attacker on the clavicle so forcefully that the sound of the bone breaking and the man\u0027s immediate shriek of pain rose above the general clamor of the fight; the injured outlaw reeled in the saddle and almost fell. \"Kill him! Kill him!\" one of the other attackers shouted, rushing directly at Ragoczy Franciscus, his wedge-shaped sword positioned to strike. This time Ragoczy Franciscus changed hands and brought the head of the mace crashing in under the man\u0027s raised arm, pummeling his side and knocking him off his horse. Rojeh had struck one of the assailants on his forearm, opening a long cut that bled freely; he lashed out at another man who rode as close as he could, a long-handled ax in his fist. The shimtare parried the chop, but the raider was able to get hold of the mule\u0027s lead and, in an abrupt jerk, broke Rojeh\u0027s hold, riding off with the mule before Rojeh could attempt to recapture the animal. In his efforts to catch the mule, he hacked an attacker in the thigh, and another on the hand. Although he had struck the most heavily armed man in the group, Ragoczy Franciscus could not stop the assaults completely; he maintained his position and used his mace to keep most of the raiders at a distance; his mule had backed up against the trees and stayed there, letting the blue roan provide protection from the battle. The man who had fallen clambered to his feet and was picked up by one of his comrades; riding double, they hurried away from the encounter; their departure acted as a signal to the rest, for they hurried after the two, the man with Rojeh\u0027s mule\u0027s lead in his hand shouting his victory at the capture of the mule. \"Are you all right?\" Ragoczy Franciscus asked Rojeh as the raiders disappeared on faint trails among the trees. \"I am,\" said Rojeh, chagrined. \"I should not have let the mule go.\" \"Had you tried to hold him, you might have been badly hurt,\" Ragoczy Franciscus said, wiping the stellated head of his mace before returning it to its sheath. \"Still, I shouldn\u0027t have let him go,\" said Rojeh. \"You could have done no differently and been safe,\" said Ragoczy Franciscus as he started away from his defensive position by the trees; his mule came with him reluctantly, the lead taut. \"But we\u0027ve lost your chest of native earth,\" Rojeh exclaimed. \"And you have need of it.\" Ragoczy Franciscus nodded once with maddening composure. \"But I can manage better without my native earth than I could manage without you.\" He made no indication that he saw Rojeh\u0027s astonished expression, adding only, \"We will contrive something, and for now, old friend, we will travel by night.\" Rojeh could think of nothing to say as he and Ragoczy Franciscus presumed their journey toward the Black Sea and the town of Olbshe at the mouth of the Dnieper River. Text of a letter from Brother Theofeo in Antioch to the Holy See in Roma, through the office of the Papal Secretary Archbishop Julianus Fabinius of Ravenna, carried by merchant ship and delivered in July 537. To the most reverend, devoted, and well-reputed Papal Secretary, his Grace the Archbishop Julianus Fabinius, the heartfelt salutations of Brother Theofeo at the Church of the Apostle Luke in Antioch, on this the beginning of the Paschal Season as the priests and monks here reckon the time, and not being wholly in accord with the True Church in such matters, nor endorsing the calculations of the Eastern Rite, but following what they believe is set forth in the teachings of Saint Peter, in the 537th Year of Salvation. Amen. It is with a heavy heart that I take pen in hand to tell you of recent events in this place: Lice Fever has struck here in Antioch, and many of the faithful Christians have succumbed to the disease, so many that Father Augustulus has not been able to keep pace with the dying and has had to have bodies interred before all the liturgy they need has been offered for the salvation of their souls. I, myself, have assisted him as much as I am able and have joined with other monks in helping to care for the dying and the dead. So far, this congregation has lost twenty-nine members, all of whom were sincere in their faith to the end, and whose deaths have left great holes in the fabric of our community. Amen. One cannot walk abroad without finding dead animals, many of them from starvation, but others from all manner of ills that beset their kind, from heated bowels to colic, to the Madness, to bloat from bad water. As there are many who cannot bury the Christian dead, so there are few to tend to the animals, and so there are many vultures, and rats, and even jackals, all coming to feast on what cannot be interred before the sun has hatched the maggots in the dead flesh, for although the sun remains weak, it is strong enough to engender maggots. Both the Bishop here and the preachers of the Eastern Rite have let it be known that those persisting in eating the flesh of dead animals risk not only sickness but excommunication if they are obdurate. Thus far, only one man has suffered that fate, and he is a butcher who claims not to be able to make a living for his family if he does not take flesh from dead animals. Now, he cannot sell anything to Christians and his family has lost the right to their home for his apostasy; we must ask what profit was so great as to make such losses worthwhile. Amen. Because of this and similar developments, it may be a blessing that trade remains poor, for the Lice Fever is everywhere and it could easily expand its miasma as more strangers enter Antioch. Some of the officials in the city had declared that the city must be closed for holy days, so that all may pray for the alleviation of this terrible fever, and for the general protection of all Christian souls, here and throughout the world. The churches here-Eastern Rite and Roman-have endorsed this plan and have appealed to the city\u0027s officials to do their utmost in preparing the populace for the observance of all fast days and holy days, during which time no one is to enter or leave the city, and even the port is to be closed; any ships arriving on such days will be required to anchor in the harbor and keep all the sailors, passengers, and others on board until the fast day or holy day is past. I and many other monks have been asked to aid in enforcing these civic regulations, and so we shall do. Amen. There are constant rumors here in Antioch that the Emperor Justinian is determined to summon. all churchmen to Constantinople for the purpose of establishing leadership and suzerainty in the Church once and for all, ending the schism that currently exists between East and West. This has already been established by Christ Himself, Who declared that Saint Peter was His Rock upon whom His Church was to be built, so the successors to Saint Peter must be leaders and sovereigns of the Christian Church, no matter where the Empire is seated. Roma is where Saint Peter made his Church, and it is in Roma that the center of the Church must remain or lose its right to minister to the peoples of the earth in the Name of Christ, to ensure the salvation of all, and to proclaim the Kingdom of God when the Last Judgment is at hand. If the Emperor persists in promulgating this council, he must be aware that he flies in the face of Christ Himself, and that questioning the authority of the Pope is concomitant to denying the Will of God. If the Pope accepts the summons to Constantinople, it must be assumed that the Emperor has abandoned his faith for the exercise of worldly power, surely as much a sin as any ever committed in the long history of sinful Man. Amen. Most highly esteemed Archbishop, I ask you to inform the Pope that we in Antioch have need of the support of more clergy. Daily we see the increase among those of the Eastern Rite, and we know that without more of our own, the Roman Rite will fail, and all these souls be lost to the True Church, and the Glory of God. Once the danger of the Lice Fever is over, we will need every priest and monk who can be spared for the task to come to aid us in this difficult time. For the sake of the Church and the fulfillment of God\u0027s promise, I ask you to plead with the Pope on our behalf, and for which merciful act I send my blessing and the pledge of my prayers at Mass for as long as I am in this city. Amen. Brother Theofeo","sourceLink":"https://allnovel.net/dark-of-the-sun-saint-germain-17/page-31.html","bookId":2501,"book":{"id":2501,"title":"Dark of the Sun (Saint-Germain #17)","description":"Storyline: Dark of the Sun (Saint-Germain #17) It is the 6th century of the common era. The vampire Saint-Germain, known in this time as Zangi-Ragozh, is peacefully doing business in Asia when the island of Krakatoa explodes in a massive volcanic eruption. Tidal waves swamp harbors hundreds of miles away, destroying trade ships and their cargoes; tons of ash and dirt are flung into the air. In the months to come, the world grows colder and darker as the massive volcanic cloud spreads across the globe, blocking sunlight. Sea trade is ravaged. Crops fail. Livestock, and then people, begin to starve. Disease spreads. Panic rises. As always in times of trouble, foreigners-and the vampire is always a foreigner-become targets. Fleeing toward the West, where he hopes to find safety and sanity, the vampire travels with a nomadic tribe led by Dukkai, a female shaman who soon becomes Zangi-Ragozh\u0027s lover. But Zangi-Ragozh\u0027s problems are far from over. His vampire nature is discovered by an enemy; he begins to starve; he is betrayed by one he cared deeply for; he loses everything, even his last sack of his native soil. With the True Death looming, Zangi-Ragozh tries to reach sanctuary in his ancient homeland. Transylvania.","cover":"https://allnovel.net/images/dark-of-the-sun-saint-germain-17.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/dark-of-the-sun-saint-germain-17.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 10:58:32 PM"}}
