{"id":16791,"no":13,"title":"CHAPTER XIII. MARK STARTS ON A JOURNEY.","content":"\"Shall you want me to-morrow, Mr. Swan?\" asked Mark, as the clock struck six, and the jeweler prepared to close up. \"Yes; I shall probably want you for a week.\" \"Very well, sir; I will so report at the office.\" The next morning about eight o\u0027clock Mark reported for duty and waited for orders. The jeweler looked up from a letter he had been reading. \"How would you like to make a journey?\" he asked. \"Very much, sir.\" \"I shall probably send you to Cleveland.\" \"Is Cleveland in Ohio?\" asked Mark, his eyes sparkling. \"Yes. Do you think you can find your way there?\" \"I\u0027ll try.\" \"You generally succeed in what you undertake to do. Well, I will explain. I have a customer living in Euclid Avenue in Cleveland, who used to be a New York society lady. She bought a good deal of jewelry, and always purchased of me. This is what she writes.\" The material part of the letter was this: \"I want a diamond pin worth about one thousand dollars. My husband has agreed to give it to me for a birthday present, and left the selection to me. I can\u0027t find anything here that I want, and have been led to think of my old jeweler in New York. You know my taste. select what you think I will like and send me by private messenger. I might of course employ an express, but there have been some express robberies recently, and I am ready to pay the extra expense required by a special messenger. Send at once. \"Arabella Loring.\" \"You see,\" said the jeweler, \"that this is an important matter. The messenger will bear great responsibility on account of the value of what he has in charge.\" \"Do you think I am old enough for the commission, Mr. Swan?\" said Mark modestly. \"It is not so much a matter of age as of shrewdness and reliability. I have been led to think that you possess these qualifications. Of course there would be danger of your being robbed if it were known that you carried such a valuable parcel.\" \"I am not afraid, sir.\" \"Of course, again, you must take care not to let it be known what you have in charge. Make what statements you like as to your business. I can safely leave that to your own shrewdness.\" \"When do you want me to start, Mr. Swan?\" \"There is a train this afternoon for Buffalo on the New York Central road. Can you get ready to take that?\" \"Yes, sir. May I go home and let my mother know? I am not quite sure whether I have a supply of clean clothes.\" \"You can buy anything that you need on the way. Have you a gripsack?\" \"Yes, sir. My mother has one.\" \"Will it do?\" \"I think so.\" \"So far so good then. Now about money. I can\u0027t tell just how much you will need, but I will give you a certain amount, and if there is any over when you return you can account for it to me.\" Mrs. Mason was greatly surprised when Mark came home and inquired for her traveling bag. \"What do you want of it, Mark?\" she asked. \"I am going to start for Cleveland this afternoon.\" \"You\u0027re only funning, Mark,\" said Edith. \"No, I am not. I have agreed to go to Cleveland on business.\" \"What kind of business, Mark?\" asked his mother. \"The gentleman who sends me, Mr. Swan, the jeweler, has asked me to keep my business secret.\" \"How long will you be gone?\" \"I can\u0027t tell, but I will write you. Mr. Swan has told me I may stop over at Niagara Falls, but I shall not be very apt to do so till I am on my return.\" \"This seems very sudden. I don\u0027t know how I shall ever get along without you.\" \"You have money enough to last you, mother?\" \"Yes.\" \"Then I think there won\u0027t be any trouble. If I stay away longer than I anticipate I will send you some more.\" \"It seems strange that Mr. Swan should send a boy on an important errand.\" \"The fact of the matter is, mother, that he has confidence in me.\" \"I am sure he is justified in this, but boys are not usually selected for important missions.\" \"That is the reason why I feel ambitious to succeed.\" \"By the way, Mark, Mrs. Mack\u0027s nephew called yesterday and tried to get some more money out of his aunt.\" \"Did you give him any?\" \"No. She was very much frightened, but I threatened to call a policeman, and the fellow went off grumbling.\" \"She won\u0027t be safe till he gets into prison again.\" On his way back to the jeweler\u0027s Mark met his friend Tom Trotter. \"Where are you goin\u0027?\" \"Out West.\" Tom\u0027s eyes expanded like saucers. \"You ain\u0027t jokin\u0027?\" \"No.\" \"When you\u0027re goin\u0027?\" \"This afternoon.\" \"Goin\u0027 to be gone long?\" \"I expect to be back in a week.\" \"I wish you\u0027d take me with you.\" \"I\u0027d like to, Tom, but I can\u0027t. Traveling costs money.\" Tom showed considerable curiosity as to the nature of Mark\u0027s business, but on this point the telegraph boy was not communicative. He liked Tom as a friend, but did not dare to trust him with so important a secret. Mr. Swan had already been to a ticket agent and procured a through ticket for Mark. \"Your train starts at four-thirty,\" said the jeweler. \"You can engage a sleeping berth at the Grand Central depot. You will travel all night.\" \"I am sorry for that,\" said Mark. \"I shall miss some of the scenery.\" \"You can arrange to travel over this part by day on your return.\" It was four o\u0027clock when Mark entered the depot. He thought it best to be on time. When the doors were opened he entered the station proper and sought the car containing his berth. There was an upper and a lower berth, his being the lower. The two were numbered 7 and 8. He had scarcely taken his seat when a gentleman came in and sat down beside him. Neither he nor Mark had noticed each other particularly till the train had left the depot. Then the gentleman exclaimed in surprise, \"Mark Mason?\" \"Uncle Solon?\" exclaimed the messenger in equal surprise. \"What brings you here?\" \"A ticket,\" answered Mark briefly. \"You are in the wrong car. Didn\u0027t you know that this is the Limited Western Express?\" \"Yes. I know it.\" \"Where are you going then?\" \"I shall stop at Buffalo,\" answered Mark, not caring to mention his further destination. Solon Talbot looked amazed. \"What on earth carries you out there?\" he asked. \"This train,\" answered Mark demurely. Solon Talbot frowned. \"You know what I mean. Why are you going to Buffalo?\" \"A little matter of business.\" \"What business can a boy like you possibly have, I\u0027d like to know?\" \"It isn\u0027t my own business, Uncle Solon, and so I don\u0027t feel at liberty to tell.\" \"It is very strange. Have you a sleeping berth?\" \"Yes.\" \"What number?\" \"No. 7.\" \"That is the lower berth—just the one I wanted,\" exclaimed Talbot in vexation. \"Mine is the upper. Let me see your sleeping check.\" Mark showed it. Solon Talbot regarded it enviously \"I will give you twenty-five cents to exchange,\" he said. \"I will exchange without the twenty-five cents if you prefer the lower berth.\" \"I do, but—I would rather pay.\" \"I can\u0027t accept it. Here is the check. Give me yours in return.\" Solon did so muttering his thanks rather ungraciously. He hated to be under any obligation to his nephew. \"Where is Edgar?\" asked Mark. \"I left him in New York. I am going back to Syracuse to attend to a little business, and shall then return to New York.\" Mr. Talbot took out an evening paper and began to read. Mark prepared to look around him. Presently Mr. Talbot arose. \"I am going into the smoking-car to smoke a cigar,\" he said. \"Have an eye on my grip while I am gone.\" \"All right, uncle.\" Hours passed. The two travelers retired to their respective berths. About two o\u0027clock Mark was startled by a severe shock that nearly threw him out of his berth. There was a confused shouting, and Mark heard some one crying, \"What\u0027s happened?\" Leaning out of the berth he saw Solon Talbot standing in the aisle, his face pale as a sheet. There was a swaying movement of the car, and a sudden lurch. The car had gone over an embankment. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2989/82431.html","bookId":323,"book":{"id":323,"title":"Mark Mason\u0027s Victory","description":"简介： The speaker was a man of middle age, with a thin face and a nose like a Hawk. He was well dressed, and across his vest was visible a showy gold chain with a cameo charm attached to it....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2989","creation":"Aug 1, 2019 12:18:33 AM","modification":"Aug 1, 2019 12:18:33 AM"}}
