{"id":16796,"no":18,"title":"CHAPTER XVIII. A MIDNIGHT VISIT.","content":"Mark was confirmed in his belief that Mr. Buffington had left the hotel, because on looking over the book he found no such name. It did not occur to him that Lawrence Perkins was his railroad friend under another alias. Mr. Buffington was rich in names, and had masqueraded under at least a dozen. He, however, had seen Mark\u0027s name in the register, and noted carefully the number of his room. The information seemed to him important, especially after he had looked over Mark\u0027s shoulder and found that he represented a prominent jeweler in New York. Mark did not fail to keep his appointment at the theater. He arrived first, but five minutes later Mrs. Loring, Florence and a young man, cousin to the latter, made their appearance. Florence smiled pleasantly, and arranged the party so that Mark should sit beside her. \"Now, George,\" she said to her cousin, \"make yourself agreeable to mama, and I will try to entertain Mr. Mason.\" \"No flirting, Florence,\" cautioned her cousin. \"Did you ever know me to flirt?\" asked Florence in mock indignation. \"Well, occasionally.\" \"Very well, if I have the reputation I may as well deserve it,\" and she proceeded to chat with Mark. In the gallery, among the cheap seats, sat Mr. Buffington, who wanted to while away the evening in a pleasant but economical manner. He did not immediately discover Mark below, but after a time recognized him. \"It is just as well I came here,\" he reflected, \"as the kid won\u0027t get to bed till late. Wonder who his friends are. That young lady looks stylish.\" Buffington took good care when the play was over to keep out of the way of the throng issuing from the main entrance. He made his way to the hotel by a devious course, and on arriving went up to his room. Mark came in not long after him, and went up to bed at once. He felt quite tired, but was well pleased with his experiences thus far. He had got rid of his responsibility, having delivered the diamond ring, received pay therefor and forwarded the check to his principal in New York. \"Now I can have a comfortable night\u0027s rest,\" he reflected. He had nearly fifty dollars with him, but this seemed a trifle compared with the diamond pin. Still he considered in what way he could secure this from chance of theft. There seemed, however, to be very little danger. He had locked the door inside, leaving the key in the lock. There was no door communicating with any other room. After some consideration he decided to hide the wallet containing his money, not under his pillow, but under the sheet at the lower part of the bed where he could feel it with his feet. \"I guess I\u0027ll find it safe in the morning,\" he said to himself. Now that he was relieved from all anxiety he composed himself to sleep, and in less than ten minutes he was unconscious of all around him. About an hour later Mr. Buffington in bare feet stood in front of Mark\u0027s door. Through the open transom he could hear the boy\u0027s peaceful breathing. \"He is fast asleep,\" he said to himself with satisfaction. \"I know how boys sleep, especially when they are tired. I don\u0027t think there will be much risk in carrying out my scheme.\" He had a skeleton key which would readily have opened the door had the key not been in the lock on the inside. This fact he soon ascertained. \"It will make it harder for me,\" he reflected, \"but there is the transom. I shall have to make use of that.\" Mr. Buffington, to use the name by which we first knew him, had some experience as a gymnast. He drew himself up to a level with the transom, and then with considerable difficulty managed to get through. The room was partially illuminated with moonlight. First of all, on descending on the other side, he turned the key in the lock so as to afford himself a way of easy escape in case of need. Though he made some noise in landing Mark was too sound asleep to be aware of it. \"Now where does the boy keep his valuables?\" Buffington asked himself. He searched all Mark\u0027s pockets, even to the vest, but without finding anything. Next he turned his attention to the gripsack, but that proved to contain only wearing apparel. But Mr. Buffington was sharp enough to understand the ways of wary travelers. He went to the bed, and gently slid his hand under the pillow. That is the most common hiding-place for watches and other valuables. But he made no discovery. Buffington paused to reflect on the situation. \"The kid has certainly got a pocketbook,\" he soliloquized. \"He can\u0027t travel without money. Now where is it? That is the question.\" He had searched everywhere else. He decided that it must be concealed somewhere about the bed. Finally he made a correct guess. He approached the bed at the lower end, and raising the covering began to feel about in the neighborhood of Mark\u0027s feet. Now, as probably all my young readers know from personal experience, the feet are very sensitive, and there are few who are not \"ticklish.\" Mark who had been unconscious of the intruder\u0027s presence till now speedily became aware that some one was fumbling about his feet. On the impulse of the moment he drew one foot back and extended it suddenly in the act of kicking. Mr. Buffington withdrew his hand swiftly, and looked anxiously at the sleeper. Mark\u0027s eyes did not open, and the burglar resolved after a suitable pause to continue his investigations. But Mark\u0027s slumbers, since the interruption, were not as sound as before. When the visitor continued his manipulations he woke suddenly, and opening his eyes took in the situation. He recognized Mr. Buffington\u0027s features and at once was wide awake. But for the fact that the burglar was dangerously near the money he would have allowed him to keep on. As it was he thought it time to interfere. He gave a vigorous kick, and called out, \"Who\u0027s there?\" Buffington understood that his scheme was defeated. To rob Mark when he was awake was to run too much risk. He sprang for the door which he had unlocked, as already noted, and opening it dashed out into the corridor. Mark did not propose to facilitate his flight. He sprang from the bed and called out in a loud tone, \"Help! Thieves!\" Now it so happened that the watchman attached to the hotel was just making his rounds and was not far off. He ran to the spot, caught sight of the flying figure of the departing burglar, and caught him by the shoulder. Buffington was a strong man, and could have got away from a man of ordinary muscles. But the watchman was a man of more than average strength, having served as porter before he had been transferred to the post of watchman and detective. He gripped Buffington in a vise-like grasp. \"No, my man,\" he said, \"you don\u0027t get away so easy. Stand still, and give an account of yourself.\" \"I am a guest of the hotel,\" said Buffington sullenly. \"Then why are you not in bed?\" \"Because I had a severe headache and thought I would take a little walk in the corridor.\" \"What made you come into my room?\" demanded Mark, who now appeared on the scene. \"I didn\u0027t know whose room it was. I thought it was my own.\" \"How did you get in? The door was locked.\" \"No, it wasn\u0027t,\" answered Buffington boldly. \"You thought you locked it, but you didn\u0027t. Trying the knob it opened at once, and I supposed it was my own which I had left unlocked.\" \"Is that true?\" asked the watchman, looking doubtfully at Mark. \"No, it isn\u0027t. I took special pains to lock the door, for I knew that there was a possibility of my room being entered.\" \"Then he must have got through the transom. We have had such cases before.\" \"If you have finished asking foolish questions I will go back to bed,\" said Buffington with remarkable assurance. \"Wait a minute. Did you see this man in your room?\" The question was addressed to Mark. \"Yes. I woke up while he was there.\" \"What was he doing?\" \"Searching for my purse. He was fumbling about the bedclothes at the foot of the bed.\" \"Was your money there?\" \"Yes.\" Buffington\u0027s face contracted with disappointment. He had been on the brink of success, when Mark, unfortunately for him, awoke. \"And you spoke to him?\" \"Yes.\" \"What then?\" \"He sprang for the door, and would have escaped if you had not caught him.\" \"Did you ever see the man before?\" \"I saw him on the train coming here for the first time.\" \"Did anything happen on the train?\" \"Yes. He stole a young lady\u0027s pocketbook. I made him give it up.\" Buffington looked at Mark menacingly. He would have liked to wreak his vengeance upon him. \"Do you know his name?\" \"He calls himself Rev. Mr. Buffington.\" The watchman laughed grimly. \"Sorry to disturb you, reverend sir,\" he said, \"but I shall be obliged to lock you in your room till morning.\" Buffington shrugged his shoulders. \"All right!\" he said. \"I shall at any rate secure a good night\u0027s sleep.\" The watchman did as he suggested. He shut the burglar in his room, and locked the door from the outside. \"Now,\" he said to Mark, \"you can sleep undisturbed for the balance of the night.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2989/82436.html","bookId":323,"book":{"id":323,"title":"Mark Mason\u0027s Victory","description":"简介： The speaker was a man of middle age, with a thin face and a nose like a Hawk. He was well dressed, and across his vest was visible a showy gold chain with a cameo charm attached to it....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2989","creation":"Aug 1, 2019 12:18:33 AM","modification":"Aug 1, 2019 12:18:33 AM"}}
