{"id":16801,"no":23,"title":"CHAPTER XXIII. MARK\u0027S GOOD LUCK.","content":"Mark presented himself at Mr. Rockwell\u0027s office at eleven o\u0027clock. The letter which he had received was a simple invitation to call, signed by the banker himself. \"Is Mr. Rockwell in?\" he asked. \"Yes,\" said the clerk smiling pleasantly, for Mark was a favorite in the office. Mark went over to the open door, and stood on the threshold with his hat in his hand. The banker looked up. \"Oh, it is my young friend the messenger boy!\" he said cordially, holding out his hand. \"I hope you are quite recovered, sir,\" said Mark respectfully. \"Yes, I believe so. The visit of our dynamite friend was quite a shock to me, and at my age it takes longer to recover from the effects of such an incident than at yours. You must not think that I have forgotten what a service you rendered me.\" \"I am very glad to have done you a service, sir, but I am afraid I must confess that I was thinking partly of myself.\" \"I don\u0027t think any the less of you for your frankness. Still I am sensible that your promptness and presence of mind saved me from a terrible death—I feel that I ought to do something to show my gratitude.\" \"You have already repaid me, sir, by your kind words.\" \"Kind words are well enough, but they are not practical. I should like to take you into my employ but I have no vacancy, and I do not like to discharge any of my old and trusted employees.\" \"I should not be willing to displace any of them, sir.\" \"But there may be another way. Are your parents living?\" \"My mother is living, and I have a little sister.\" \"And I suppose they are dependent upon you partly for support.\" \"Yes, sir.\" \"Probably you are poor?\" \"Yes, sir; our means are very limited.\" \"So I suppose. What is your name?\" \"Mark Mason.\" Mr. Rockwell turned to his desk, and opening his check book, deliberately filled up a check. He tore it off and handed it to Mark. Mark read it in amazement. It was a check for one thousand dollars, payable to the order of Mark Mason. \"A thousand dollars!\" he ejaculated. \"Yes, does it seem to you a large amount? I assure you that I value my life a great deal higher than this sum, so I shall remain your debtor.\" \"It seems a fortune to me, Mr. Rockwell. How can I thank you for your generous gift?\" \"My boy, generosity is a variable quality—I am blessed by fortune, and for me it is a small sum to bestow in return for the heroic act. Would you like to have Mr. Nichols go with you to identify you at the bank?\" \"I don\u0027t think I should like to draw it all, sir. I should be afraid to have so much money in my possession.\" \"Then you can leave it with me as a deposit subject to your call. How much of it would you like to draw now?\" \"About fifty dollars, sir. I would like to buy a dress for my mother and sister and a new suit for myself.\" \"Well thought of. Will you call Mr. Nichols?\" The clerk made his appearance. \"My young friend wishes to make a deposit with our house. Let him indorse the check. Then credit him with the entire amount, and he will draw what sum he wishes.\" \"You are in luck, Mark,\" said the clerk when Mark accompanied him into the main office. \"You are in luck, and I am heartily glad of it.\" \"Thank you, Mr. Nichols. I feel rich.\" \"It is a good beginning at any rate. I am ten years older than you probably, but I haven\u0027t as much money as you. But I don\u0027t envy you, and I won\u0027t even ask for a loan.\" When Mark left the office and reappeared on Broadway his face was flushed with pleasure, and he walked with the elastic step of one whose spirits are light. Just as he stepped into the street, he met his cousin Edgar. \"Hello!\" said Edgar in a condescending tone. \"So it\u0027s you, is it?\" \"To the best of my knowledge it is, my good cousin.\" \"Don\u0027t call me cousin,\" said Edgar, hastily. \"I won\u0027t,\" answered Mark promptly. \"I am just as much ashamed of the relationship as you are.\" \"I suppose that is a joke!\" responded Edgar haughtily. \"If it is, it is a poor one.\" \"No joke at all!\" \"Where have you been?\" \"To the office of Mr. Rockwell, my banker.\" \"Your banker!\" sneered Edgar. \"How long has he been your banker, I should like to know.\" \"Only since this morning. I have just deposited some money with him.\" \"Indeed! How much?\" \"A thousand dollars.\" \"You are too funny altogether. If you are ever worth a thousand cents you will be lucky.\" \"Do you think so?\" returned Mark, smiling. \"I shouldn\u0027t be satisfied with so small a fortune as that.\" \"My father tells me you and your mother have made him a very poor return for a kind offer he made you yesterday.\" \"That\u0027s a matter of business, Edgar. We didn\u0027t look upon it in the same way. But I am afraid I must tear myself away from your company. I shall be expected at the office.\" \"Go by all means. It wouldn\u0027t do for you to be bounced. You might starve if you lost your place.\" \"I am not very much afraid of that.\" \"At any rate I ought not to be talking with you. Father does not care to have me associate with you.\" \"I hope he won\u0027t disinherit you. That would be serious for you. If he does, come round to our house, and we will take care of you.\" \"You are too awfully funny. I think it would be better for you if you were not quite so fresh.\" Mark laughed and went on his way. \"Wouldn\u0027t Edgar be surprised,\" he thought, \"if he knew how large a sum I had on deposit with Mr. Rockwell? He thought I was joking when I was only telling the truth.\" When Mark went home to his supper he said: \"Mother, I want you to buy a new dress for yourself and one for Edith.\" \"There are a good many things we would like, Mark, but you must remember that we are not rich.\" \"Perhaps not, but I think you can afford new dresses. How much would they cost?\" \"The material will cost from ten to twenty dollars. I could make them up myself.\" \"All right, mother. Here are twenty dollars.\" \"But, Mark, can you spare that amount? Our rent comes due next week.\" \"It is the last rent we shall pay here. We will move to better quarters.\" \"Really, Mark, I am afraid you are forgetting your prudence.\" \"That is because you don\u0027t know how rich I am, mother. I have a thousand dollars on deposit with my banker, or rather nine hundred and fifty, for I drew fifty dollars this morning.\" Mrs. Mason surveyed her son with alarm. A terrible suspicion entered her mind. Was he becoming mentally unbalanced? Mark understood her thoughts and was amused. \"Don\u0027t think I am crazy, mother,\" he said. \"The fact is, Mr. Rockwell made me a present of a thousand dollars this morning.\" \"Is this really true? You are not joking?\" \"I was never more serious in my life. He told me that I had saved his life, and he didn\u0027t think he was overpaying me in giving me a thousand dollars.\" \"He was right, but I was afraid few men would have been so generous. So I really have a rich son.\" \"And I shall have a rich mother when she gets her share of her father\u0027s estate.\" \"Oh, by the way, there is a letter for you. Edith, get Mark\u0027s letter.\" \"I guess it\u0027s from a girl, Mark,\" said his sister, as she handed the messenger boy a dainty epistle in a square envelope. Mark opened it and read it aloud. Miss Maud Gilbert asks the favor of Mr. Mark Mason\u0027s company at her residence on the evening of Thursday, Sept. 23d. \"An invitation to a party,\" said Mark flashing with pleasure. \"Where, Mark?\" \"At the house of Miss Maud Gilbert.\" \"Shall you go?\" \"Yes, I can go now, for I shall have a nice suit.\" \"You are getting to be fashionable, Mark. Who knows but you will be counted among the Four Hundred some time?\"","sourceLink":"http://novel.tingroom.com/ertong/2989/82441.html","bookId":323,"book":{"id":323,"title":"Mark Mason\u0027s Victory","description":"简介： The speaker was a man of middle age, with a thin face and a nose like a Hawk. He was well dressed, and across his vest was visible a showy gold chain with a cameo charm attached to it....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2989","creation":"Aug 1, 2019 12:18:33 AM","modification":"Aug 1, 2019 12:18:33 AM"}}
