{"id":93631,"no":38,"title":"Page 38","content":"\\n\\n Link fired two shots in quick succession and the zombie sank to the floor without a sound.\\n\\n Vicki stared in horror as the other five surged to their feet and lumbered toward them.\\n\\n \"This one\u0027s mine!\" Torch hollered. He fired twice and the second zombie hit the floor with a thud. \"Like shooting fish in a barrel!\" he crowed.\\n\\n Vicki turned away, her hands pressed over her ears as Twist and his gang took out the other zombies. Her gaze settled on Antonio. Was he still alive? A distant part of her mind chuckled at her choice of words. Vampires weren\u0027t alive. They were Undead. She wondered if Falco had destroyed him, if he was now truly dead.\\n\\n The vampire twitched as the coppery scent of blood filled the air.\\n\\n She hurried to his side when all the zombies had been taken care of. \"Antonio? Antonio, can you hear me?\"\\n\\n He didn\u0027t move, didn\u0027t speak.\\n\\n \"We have to get him out of here,\" she said. \"Hurry!\"\\n\\n \"Who is this guy?\" Twist asked.\\n\\n \"There\u0027s no time for that now.\" Bile rose in her throat when she saw the burns on Antonio\u0027s body. She frowned as she realized the chains were bolted to the floor.\\n\\n Twist jerked his head toward the door and Link ran outside.\\n\\n \"I think we\u0027re too late,\" the Hammer remarked. \"He looks dead.\"\\n\\n Link reappeared a couple of minutes later and after a good deal of swearing, he managed to cut the manacles at Antonio\u0027s hands and feet and neck.\\n\\n \"Let\u0027s go,\" Vicki said. \"Hurry!\"\\n\\n The Hammer hoisted Antonio onto one shoulder and headed for the door.\\n\\n \"Wait a minute!\" Vicki cried.\\n\\n \"Something wrong?\" Twist asked.\\n\\n \"Yes. Just stay here a minute. I\u0027ll be right back.\"\\n\\n Hurrying out to the Lexus, she opened the trunk and pulled out the plastic sheeting. She ran back to the shed, aware that the sun was already setting. They had to get out of here before Falco returned.\\n\\n Inside once more, she wrapped the black plastic around Antonio from head to foot.\\n\\n When she was finished, he looked like a mummy.\\n\\n \"What the hell?\" Link asked. \"Why\u0027d you do that?\"\\n\\n \"I don\u0027t have time to explain. A very bad man will be here soon, and believe me, you don\u0027t want to be anywhere around when he gets here.\"\\n\\n \"Worse than these guys?\" the Torch asked, looking at the zombies that littered the floor.\\n\\n \"Much worse,\" she said. \"He made them.\"\\n\\n She had a feeling there wasn\u0027t much that scared Twist and his gang, but that did it.\\n\\n The Hammer again hoisted Antonio onto his shoulder and headed for the door.\\n\\n Following him, Vicki murmured a silent prayer of thanks for Twist and his gang. She had been so worried about Antonio, so anxious to find him, she hadn\u0027t stopped to wonder how she would get him out of the shed. On her own, she would never have been able to lift him, let alone carry him out of there.\\n\\n \"Where do you want him?\" the Hammer asked.\\n\\n \"Here, in the trunk.\"\\n\\n Twist and his gang exchanged looks that clearly wondered how they\u0027d gotten mixed up with a woman who was insane.\\n\\n \"You want us to follow you?\" Twist asked.\\n\\n \"No, that won\u0027t be necessary.\" She covered Antonio with the blankets and closed the trunk. \"I don\u0027t know how I can ever thank you.\"\\n\\n Twist shrugged. \"We didn\u0027t have anything better to do today. So long, lady.\"\\n\\n \"Good-bye.\"\\n\\n Aware that the sun was setting way too fast, she got into the Lexus, locked the door, and drove as though all the devils in hell were at her heels. The sun had set by the time she reached the road to the castle.\\n\\n Once inside the garage, with the door closed, she switched off the ignition, then leaned forward and rested her forehead on the steering wheel.\\n\\n She had him safely home. But had he survived the trip? After taking several deep breaths, she got out of the car, took several more deep breaths, and opened the trunk.\\n\\n Chapter 32\\n\\n \"Antonio?\" She tossed the blankets out of the trunk and removed the plastic sheeting that covered him. \"Antonio!\"\\n\\n He lay as still as death. And he looked pale, so pale. The burns on his neck, wrists, and ankles were a dull ugly red. His cheeks looked hollow, the skin drawn tight across his cheekbones. His whole body was covered with burns that looked like tiny cuts. What had Falco done to him?\\n\\n Biting down on her lower lip, she leaned forward and touched his shoulder. \"Antonio?\"\\n\\n With a savage growl, his hand closed around her wrist, his fingers squeezing until she thought the bones might break.\\n\\n His eyes opened, glowing red in the overhead light of the garage. He stared at her and there was no recognition in his gaze, only a burning hunger.\\n\\n Fear seized her. Fighting down the urge to pull away, she said, quietly. \"Antonio, it\u0027s me.\\n\\n Victoria. I\u0027ve brought you home.\"\\n\\n She looked down at his hand. His thumb stroked the inside of her wrist, back and forth, back and forth. He licked his lips and she caught a glimpse of his fangs, a telltale sign that he was hurting and weak from the blood he had lost.\\n\\n She fought down a rising sense of panic. Did he know who she was? In his current state, would it make any difference?\\n\\n \"Antonio, listen to me. You\u0027re safe now. You\u0027re home. Falco can\u0027t hurt you anymore.\"\\n\\n His hand tightened on her wrist at the mention of Falco\u0027s name, his nails digging into her flesh. \"Antonio, you\u0027re hurting me.\"\\n\\n His eyes narrowed as his gaze focused on her face. \" Victoria?\" His voice was low and edged with pain.\\n\\n \"Yes. Yes, it\u0027s me.\"\\n\\n He let go of her arm and his hand fell to his side. \"Sorry… if I hurt you.\"\\n\\n \"We need to get inside, quickly.\"\\n\\n He nodded and she helped him out of the trunk, her stomach churning with revulsion when she got a good look at him. The words death warmed over flitted through the back of her mind.\\n\\n He moved as if every step caused him pain. She recalled that he had told her once that vampires felt things more intensely.\\n\\n Combating a sense of urgency, she helped him up the stairs, constantly glancing over her shoulder for fear she would see Falco or more of his zombies advancing toward them. It was obvious that Dimitri Falco had no conscience, no sense of pity or compassion for those he so callously enslaved.\\n\\n She breathed a sigh of relief when they were safely inside, the heavy front door closed and locked behind them.\\n\\n She guided Antonio to the front parlor and then to the sofa. He sat down heavily.\\n\\n Resting his head against the back of the sofa, he closed his eyes.\\n\\n She stood looking down at him, wondering what she should do, wondering how he could survive when he looked so ghastly pale. She moved toward him, needing to touch him.\\n\\n \"Go away from me, Victoria.\"\\n\\n \"No. You need help. What can I do?\"\\n\\n \"Go away.\" He spoke between gritted teeth. \"You cannot give me what I need.\"\\n\\n \"Why not? I\u0027ve done it before?\"\\n\\n \"I need more than a mere taste.\"\\n\\n She swallowed hard.\\n\\n \"Go, my sweet, you are far too tempting and too near and I am too weak to long resist.\"\\n\\n \"You can\u0027t mean to go out,\" she said. \"Not tonight.\"\\n\\n \"I must.\" A muscle worked in his jaw; she saw his hands clench into tight fists.\\n\\n He was hurting beyond anything she could imagine. She backed slowly toward the staircase, wondering how safe she would be in her room if he changed his mind. It was his house, after all. There was no protection for her here, no threshold to keep him out.\\n\\n Her heel hit the bottom step and she stopped. She couldn\u0027t let him go hunting tonight.\\n\\n Falco could be out there, waiting, knowing that Antonio would need blood to ease the pain, to heal his wounds. She didn\u0027t know how Falco had managed to catch Antonio off guard before, but she knew he would be an easy mark now.\\n\\n She took a deep breath. She would be dead now if not for Antonio. He had warned her against Battista, rescued her from a fate worse than death. She could not abandon him now, when he needed her more than ever.\\n\\n Squaring her shoulders, she went back into the living room and sat down on the sofa beside him.\\n\\n His nostrils flared. He opened his eyes. Eyes that glowed with the lust for blood. \"Go.\"\\n\\n The word sounded as if it had been torn from his throat. \"Go. Now.\"\\n\\n \"Take what you need, Antonio. But please don\u0027t hurt me.\"\\n\\n He shook his head. \"I cannot promise that. Not now. Please, Victoria, sweeting, go while you can.\"\\n\\n \"I\u0027m not leaving you.\"\\n\\n His hands clenched at his sides. \"This is madness. You do not know what you are saying.\"\\n\\n She thought so, too, but she couldn\u0027t leave him, couldn\u0027t bear to see him suffering.\\n\\n Battista closed his eyes again. He didn\u0027t trust himself to drink from her, not now, when his thirst was nearly out of control, when he was weak with pain. The burns from the silver throbbed relentlessly. They would not heal overnight. Without blood, they would not heal at all. Though it had been years since he had killed anyone, he knew that, should he hunt tonight, the poor unsuspecting mortal who crossed his path would not live to see the dawn of another day. When he drank tonight, he would take it all.\\n\\n He opened his eyes, noting for the first time the silver crucifix on a chain around Victoria\\n\\n \u0027s throat. Perhaps there was a way to take what he needed without taking a life.\\n\\n \" Victoria, you cannot give me all I need.\"\\n\\n \"Why not?\"\\n\\n \"Because I would have to take it all.\"\\n\\n She stared at him, her eyes widening as his meaning sank in.\\n\\n \"But I want to take a little, enough to dull the pain.\"\\n\\n \"But you said that wouldn\u0027t be enough.\"\\n\\n \"If I can take some from you, I can take the rest from someone else.\" He would probably need to drink from at least two, perhaps three, but if he was in control, no one would die. \"Do you understand?\"\\n\\n She nodded, her eyes shining with trust. He only hoped he could live up to it, that he would not spend the rest of his existence regretting his weakness. \\n\\n","sourceLink":"https://allnovel.net/desire-after-dark-vampire-trilogy-3/page-38.html","bookId":2298,"book":{"id":2298,"title":"Desire After Dark (Vampire Trilogy #3)","description":"Storyline: Desire After Dark (Vampire Trilogy #3) \\n Vicki Cavendish knows she should be careful. After all, there\u0027s a killer loose in town—one who drains women of blood, women with red hair and green eyes just like her. She knows she should tell police about the dark, gorgeous man who comes into the diner every night, the one who makes her feel a longing she\u0027s never felt before. The last thing she should do is invite the beautiful stranger into her house. \\n Cursed to an eternity of darkness, Antonio Battista has wandered the earth, satisfying his hunger with countless women, letting none find a place in his heart. But Victoria Cavendish is different. Finally, he has found a woman to love, a woman who accepts him for what he is—a woman who wants him as much as he wants her...which is why he should leave. But Antonio is a vampire, not a saint. What is his, he\u0027ll fight to keep and protect. And Victoria Cavendish needs protecting...from the remorseless enemy who would make her his prey...and from Antonio\u0027s own uncontrollable hunger.\\n","cover":"https://allnovel.net/images/desire-after-dark-vampire-trilogy-3.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/desire-after-dark-vampire-trilogy-3.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 6:02:07 PM"}}
