{"id":111863,"no":3,"title":"Page 3","content":"\"Doctor Heinze?\" Dawn Pickering said as he approached her stalking spot. That was what she called this stretch of hallway in the McCready building where she\u0027d set up watch on Kenneth Heinze, MD. She\u0027d totally memorized his office hours and had made a point of being in the building whenever he was. Sooner or later Mr. Osala or Gilda or Georges would appear with the baby, bringing him in for a checkup. Or so she hoped. He\u0027d been present at the delivery. Didn\u0027t it stand to reason that whoever had the baby would follow up with Dr. Heinze? At the time she\u0027d been impressed at how Mr. Osala had totally thought of everything, even going so far as to have a pediatrician on hand to check out her newborn. She\u0027d had no idea what they had in mind. She\u0027d been whisked in and out of a surgicenter she could not identify. She\u0027d tried contacting Dr. Landsman, the obstetrician, but he said he\u0027d never heard of her and had left instructions with his office building\u0027s security that she was not to be allowed in. During her pregnancy he\u0027d examined her in his office during off-hours and done his own ultrasounds. She\u0027d thought she was getting VIP treatment but now she realized no one on his staff would remember her. And Mr. Osala and his entire household had vanished. Her only link was Dr. Heinze. She remembered thinking of \"fifty-seven varieties\" when she\u0027d first heard his name. But when she looked she found only one pediatrician named Heinze in the five boroughs. She\u0027d thought she was on the wrong track when she learned he was a pediatric surgeon. Why had they thought they needed a surgeon? But one look at this tall, fair-haired man with the round, apple-cheeked face totally dispelled all doubts. He was the one. But still ... why had they wanted a surgeon who specialized in children on hand? Maybe they\u0027d expected problems. After the quick glimpse she got of her child she wasn\u0027t surprised. The black body hair, almost like fur, the clawlike hands - nobody had prepared her for that. But the most horrifying of all was the tentacle springing from each of his armpits, writhing in the air like little snakes. And then they\u0027d said he\u0027d stopped breathing and they whisked him away. The next day they told her he hadn\u0027t survived. She\u0027d been so not ready for that. And since she\u0027d already signed him away for adoption, they never let her see him. But she didn\u0027t believe he was dead. Neither did Jack. And so she was totally determined to find him. She\u0027d let her baby down before - tried to abort him, signed him away to be raised by strangers - but things had changed. She was so not going to let him down again. Dr. Heinze walked past. He either hadn\u0027t heard her or was ignoring her. She had a chance to back off. And maybe she should. Confronting him was dumb. She needed to hang back and keep lurking. She\u0027d made a point of dressing in business casual and staying on the move so she looked like she belonged here. The research wing of the McCready Foundation\u0027s headquarters had restricted access, but the outpatient areas were open to the public. Patience, she told herself. Sooner or later the baby would show. But her patience had thinned, and now it tore. Totally. \"Doctor Heinze?\" she repeated. He stopped and gave her a pleasant smile. \"Yes?\" \"Remember me?\" He stared at her with no hint of recognition. \"Should I? Were you once a patient?\" \"My name\u0027s Dawn Pickering and you stole my baby.\" His eyes widened and the apple in his cheeks faded. Now he recognized her. \"I-I did no such thing.\" \"Then you helped. Where\u0027s my baby, Doctor Heinze? Where\u0027s my baby?\" He pushed open his office door. \"I have no idea what you\u0027re talking about. Please leave.\" She followed him inside. \"Where\u0027s my baby, Doctor Heinze?\" She felt herself losing it. No turning back now. \"Where\u0027s-my-baby-where\u0027s-my-baby?\" Startled looks from parents and little patients in the waiting area as her voice rose in pitch and volume. \"Where\u0027s-my-baby-where\u0027s-my-baby?\" The receptionist grabbing the phone and calling someone, had to be security, but Dawn was screaming now and it felt so good to scream. \"WHERE\u0027S-MY-BABY-WHERE\u0027S-MY-BABY-WHERE\u0027S-MY-BABEEEEE?\"","sourceLink":"https://allnovel.net/the-dark-at-the-end/page-3.html","bookId":2554,"book":{"id":2554,"title":"The Dark at the End","description":"Storyline: The Dark at the End (Repairman Jack #15) Bound by his promise to Glaeken, Jack has refrained from making any direct moves against Rasalom. But things have changed so there\u0027s nothing holding Jack in check any longer. Other changes are occurring as well. Jack is healing at an accelerated rate--much like Glaeken did when he was immortal. This can only mean that Glaeken\u0027s time is almost up and when he dies, Jack takes his place. Rasalom continues to plot against the Lady. Twice she has died and returned; a third time and she will be gone, leaving a clear path for the Otherness to infiltrate this reality. But Ernst Drexler, formerly Rasalom\u0027s go-to guy for logistical support, fears he will be left out in the cold when the Change comes. He forms an uneasy alliance with Jack, who is preparing to face their old enemy. Meanwhile, Dawn Pickering is searching for her supposedly dead baby. The trail leads her to a mansion in a remote Long Island coastal town, where she discovers a truth she could have never imagined. Now the stage is set for Jack\u0027s massive assault on Rasalom. Jack knows he\u0027s got just one shot. But it\u0027s not just a matter of taking out Rasalom: he also must safely retrieve Dawn\u0027s child and minimize collateral damage. So, he comes up with a foolproof plan. But fools are always with us….","cover":"https://allnovel.net/images/the-dark-at-the-end.jpg","author":"F. Paul Wilson","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-dark-at-the-end.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:37:53 AM"}}
