{"id":111890,"no":32,"title":"Page 32","content":"\"Hey, I\u0027ve got an idea,\" Jack said with all the gosharooty enthusiasm he could muster as he, Weezy, and the Lady cruised south on Route 206. \"Let\u0027s sing \u0027Ninety-nine Bottles of Beer\u0027!\" He\u0027d awakened early feeling pretty decent, considering what he\u0027d gone through the night before. Maybe too decent. His bruises were already fading. He\u0027d tried to fall back to sleep but began imagining what he would have gone through if Drexler hadn\u0027t gotten cold feet about the Change. The possibilities had made sleep impossible. Later he\u0027d rented a Jeep Cherokee for the Jersey trip and now had the wheel. Not the cushiest ride, but this one had a high suspension that would come in handy once they hit the Pine Barrens. He thought about their destination, the pyramid. He still couldn\u0027t imagine how that fifteen-foot construct of standing triangles with open spaces between them - he remembered Eddie describing it as half a dozen Godzilla pizza slices standing on end - could hide anyone from anything. But real life had been leaving his imagination in the dust lately, so why not? \"\u0027Ninety-nine Bottles of Beer\u0027!\" Weezy said with equal faux glee from the passenger seat. \"My favorite! You take the first ten verses by yourself, and then the Lady and I will sing harmony on the rest.\" \"I do not sing,\" the Lady said from behind him. Jack wasn\u0027t sure why, but he was glad for that. \"Neither does Weezy,\" he said. Weezy looked offended. \"You don\u0027t know that.\" \"You used to howl in the shower when you were staying with me.\" \"I didn\u0027t howl.\" \"Caterwaul, then. Whatever it was, you can\u0027t call it singing. And \u0027Hungry Like the Wolf,\u0027 of all things. What happened to Bauhaus?\" She reddened. \"I had a closet crush on Simon le Bon.\" Jack checked his phone. No missed calls. \"You keep doing that,\" Weezy said. \"I\u0027m waiting to hear back from a couple, three charter boats I contacted.\" Earlier he\u0027d made a few calls to fishing boats in the Coney Island area. No one had answered, so he\u0027d left messages about chartering the boat for a day trip. Weezy nodded. \"Oh, right. Disposing of the katana. No responses?\" \"March isn\u0027t exactly charter fishing season. Gotta be colder than hell out there.\" \"Obviously you left your number. We\u0027ll be back by early afternoon.\" Back from Johnson ... he hadn\u0027t been back to Johnson since his father\u0027s funeral, and that had been - what? - a year and a half or so ago. Dad and Mom were buried side by side. Weezy turned in her seat. \"I\u0027ve got something serious to discuss.\" Jack said, \"Uh-oh.\" \"It\u0027s about Eddie. He wants to join the fight.\" \"Against what?\" She shrugged. \"The Order, the Otherness, whatever we\u0027re fighting.\" \"Since when does he know about any of that?\" \"Since yesterday when I spent half the day educating him.\" \"And he\u0027s convinced?\" She nodded. \"Pretty much. It\u0027s a lot to swallow, but the Compendium is an excellent persuader.\" Jack hesitated. He didn\u0027t want to offend her. \"Don\u0027t take this wrong, but ... what\u0027s he bringing to the table?\" \"A new way of looking at things, maybe?\" \"Good enough.\" He couldn\u0027t see a downside. He turned to the Lady. \"Any objection?\" She shook her head. \"Not at all.\" Jack had to smile. \"To tell the truth, I can\u0027t wait to see his face when we seat him at a table with Mrs. Clevenger.\" Weezy laughed. \"That makes two of us.\" They passed through Tabernacle and now farms lined the highway. \"Nothing changes much around here,\" Weezy said. \"I haven\u0027t been back in forever and it\u0027s like I never left.\" \"Big change up ahead,\" Jack said. \"What?\" \"You remember the blinker at 206 and Quakerton Road?\" \"Of course. Johnson didn\u0027t rate a full stoplight.\" \"It does now.\" And it was red when they reached it. As they waited to hang a left, Weezy pointed out the window. \"Look. The Krauszer\u0027s is still here, and Burdett\u0027s is now an Exxon.\" \"Well, it is the twenty-first century.\" Joe Burdett had kept up his Esso sign for decades after the company changed its name. What had once been Sumter\u0027s used-car lot was now a discount furniture store. Quakerton Road split the north and south halves of Johnson and sported a couple of new stores. USED, where Jack had worked as a kid, was a mom-and-pop drugstore now. Mr. Rosen, his old boss, had died back in the 1990s. The bridge over Quaker Lake was wider but otherwise Old Town looked pretty much the same as it had when they were kids. The two-story stucco box of the Lodge remained unchanged. \"There\u0027s your old place,\" he said, swinging by the rickety Victorian house where the Lady had lived as Mrs. Clevenger during their childhoods. \"It needs painting,\" she said. Weezy stared at it as they passed. \"We all thought you were a witch.\" \"By most standards, I was.\" \"Wonder who lives there now.\" \"The Meads,\" the Lady said. \"Tom and Alice, and their daughters Selena and Emily.\" \"Can you tell where anybody is at any given time?\" Jack said. \"I mean, do you keep track of all of us?\" She shook her head. \"The noosphere is a unified consciousness. No identities there. However, when I am near enough to individuals here, I know identities. After all, they help keep me here.\" Jack noticed with a start that the lightning tree was still standing - how had it lasted so long? - and then they entered the Pine Barrens, the million-plus acres of mostly uninhabited woodland sitting in the belly of New Jersey. Jack steered onto one of the firebreak trails that crisscrossed the area. He experienced the same creepy sensation he\u0027d get when riding his bike into the trees as a kid. The forty-foot scrub pines got thicker and thicker, their crooked, scraggly branches leaning over the path as they crowded its edges. He remembered imagining them shuffling off the path ahead of him and then moving back in to close it off behind. Dumb question, but he asked Weezy anyway: \"You remember the route?\" \"I think so.\" He hadn\u0027t expected that. \"Think so?\" She smiled. \"Just kidding. I remember it exactly.\" She tapped her forehead. \"The map\u0027s right here.\" He followed her directions on which way to turn as the firebreak trails forked left and right. The NO FISHING / NO HUNTING / NO TRAPPING / NO TRESPASSING signs posted along the way confirmed that they were on land owned by \"Old Man Foster,\" known to them now as Glaeken. But that was about all he knew for sure. He was thoroughly lost by the time she told him to stop. He scanned the surrounding trees, which looked pretty much like all the myriad others they\u0027d passed. \"You sure this is the place?\" \"You remember it as burned out. That was decades ago.\" The Lady had already stepped out of the car and was starting into the trees. Jack and Weezy hurried after her. \"You know where you\u0027re going?\" Weezy said. \"Of course.\" Yeah, well, of course. Somewhere in all the revived undergrowth - winter bare now - lay the remnants of a burial mound he and Weezy had explored as kids. What they\u0027d found had set a whole deadly chain of events in motion. Sometimes secrets were better left secret. The Lady, wearing only a housedress, forged ahead, moving easily through the brush, with nothing snagging her clothing that wasn\u0027t clothing. Clouds had moved in and the temperature had dropped, but as usual she didn\u0027t appear to notice. Then they broke into the pyramid\u0027s clearing and Jack had to stop and take it in, just as he had the first time he\u0027d seen it at age fourteen. Six huge, elongated triangular megaliths stood in a circle, their bases buried in the sandy soil with their pointed ends jutting skyward and leaning toward each other. Godzilla pizza slices ... One had broken off halfway up, but the points of the other five met at the pyramid\u0027s apex, fifteen feet above the ground. The Lady\u0027s new home.","sourceLink":"https://allnovel.net/the-dark-at-the-end/page-32.html","bookId":2554,"book":{"id":2554,"title":"The Dark at the End","description":"Storyline: The Dark at the End (Repairman Jack #15) Bound by his promise to Glaeken, Jack has refrained from making any direct moves against Rasalom. But things have changed so there\u0027s nothing holding Jack in check any longer. Other changes are occurring as well. Jack is healing at an accelerated rate--much like Glaeken did when he was immortal. This can only mean that Glaeken\u0027s time is almost up and when he dies, Jack takes his place. Rasalom continues to plot against the Lady. Twice she has died and returned; a third time and she will be gone, leaving a clear path for the Otherness to infiltrate this reality. But Ernst Drexler, formerly Rasalom\u0027s go-to guy for logistical support, fears he will be left out in the cold when the Change comes. He forms an uneasy alliance with Jack, who is preparing to face their old enemy. Meanwhile, Dawn Pickering is searching for her supposedly dead baby. The trail leads her to a mansion in a remote Long Island coastal town, where she discovers a truth she could have never imagined. Now the stage is set for Jack\u0027s massive assault on Rasalom. Jack knows he\u0027s got just one shot. But it\u0027s not just a matter of taking out Rasalom: he also must safely retrieve Dawn\u0027s child and minimize collateral damage. So, he comes up with a foolproof plan. But fools are always with us….","cover":"https://allnovel.net/images/the-dark-at-the-end.jpg","author":"F. Paul Wilson","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-dark-at-the-end.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:37:53 AM"}}
