{"id":111892,"no":35,"title":"Page 35","content":"Jack helped the Lady step over the three-foot-high wall of rectangular slabs - they still reminded Jack of headstones - ringing the pyramid. The three of them stopped and stared at the structure.\\n\\n Odd glyphs had been carved in the outer surface of each megalith, and remained faintly visible. He could make out three from this angle:\\n\\n Eddie had also called it a giant stone teepee, and that wasn\u0027t too far off. But it looked ancient, felt ancient ... and alien.\\n\\n Everything was exactly as he remembered it. No sign of vandalism or evidence that anyone else had discovered it. The absence of litter confirmed that.\\n\\n Weezy must have been thinking along the same lines. \"Nice to know that some secrets remain secret,\" she said.\\n\\n The Lady approached the pyramid. She stopped at the opening between a pair of the megaliths and stuck her head through.\\n\\n \"I believe Srem was right,\" she said as Jack and Weezy came up behind her. \"This does have a power of occultation.\"\\n\\n \"Great,\" Jack said. \"Then we won\u0027t have to worry about anyone sneaking up on you.\"\\n\\n She pulled her head back and turned to face them.\\n\\n \"It might have had the power to hide me completely when it was whole.\" She pointed to the broken megalith. \"But it is not.\"\\n\\n Weezy frowned. \"But then - ?\"\\n\\n \"It will, however, reduce awareness of me, and diffuse what seeps through. If you have a sensitivity to me, you will know that I exist, but you will not be able to pinpoint my location.\"\\n\\n Jack grinned. \"Perfect.\"\\n\\n The Lady thrust her arm through the slit. \"Let us waste no time then.\"\\n\\n She turned sideways and squeezed through the opening, easing herself down to the sunken sandy floor within. She strode to the stone column, maybe a foot in diameter and four feet high, that stood in the exact center of the space, then turned to face them.\\n\\n \"I will stay here.\"\\n\\n Jack didn\u0027t know what to say. He glanced at Weezy, close beside him, and she seemed at a loss for words too.\\n\\n \"Go,\" the Lady said, making a shooing motion. \"You both have more important things to do than stand here and stare at me.\"\\n\\n \"Just ... leave?\" Weezy said.\\n\\n \"Yes. Go.\"\\n\\n \"You\u0027ll be all right?\"\\n\\n \"Perfectly fine.\"\\n\\n \"Won\u0027t you be lonely?\"\\n\\n \"How can I be lonely when I have all of you - when I am all of you?\"\\n\\n Good point.\\n\\n \"Do you need - ?\"\\n\\n \"I need you to go about your business.\"\\n\\n Jack took Weezy\u0027s arm and gently pulled her away.\\n\\n \"You heard her, Weez.\"\\n\\n \"Yeah, but...\" She came with him, but kept looking back over her shoulder. \"Walking away and just leaving her there - with a storm coming, no less - seems so ... wrong.\"\\n\\n Jack looked back and saw the old woman standing alone in the cold within the confines of the megaliths. He knew how Weezy felt.\\n\\n \"Yeah, it does, because we keep thinking of her as an old woman. But that\u0027s simply the avatar she\u0027s stuck with. She\u0027s not an old woman. And she doesn\u0027t feel cold or hot, rain and snow don\u0027t bother her, she doesn\u0027t eat, she doesn\u0027t sleep, and she doesn\u0027t feel lonely. Ever.\"\\n\\n They made their way back to the Jeep and headed back to Johnson, driving in silence until they reached Old Town.\\n\\n \"Do we have time to swing by our old places?\"\\n\\n Jack nodded. \"Tons of time.\"\\n\\n Back over the bridge and then onto North Franklin up to Adams Street where Weezy used to live. He slowed as they passed and let her stare at her place.\\n\\n \"Want me to stop?\"\\n\\n She shook her head. \"No. Seen enough.\" She leaned back. \"I don\u0027t know why people have such nostalgia for their childhoods.\"\\n\\n \"Was yours so bad?\"\\n\\n \"I remember the grammar school years as being pretty good - at least I don\u0027t remember anything bad. But high school...\" She shook her head again. \"As soon as I stopped being the Stepford child and started thinking for myself, it all went to hell.\"\\n\\n \"You went goth.\"\\n\\n \"I didn\u0027t go anything.\"\\n\\n He smiled. \"Oh, right. Black shirts, black jeans, lots of eyeliner, Bauhaus, Siouxie ... you were a disco queen.\"\\n\\n \"Okay, okay, I fit a type. But I didn\u0027t go around thinking, \u0027Look at me, I\u0027m a goth.\u0027 It was what I liked. And what my folks hated, unfortunately.\"\\n\\n \"Yeah, your dad...\"\\n\\n \"I still remember that disapproving look on his face every time he\u0027d see me. Every time. I was on an emotional seesaw as it was, with my moods all over the place, and he made it ten times worse.\"\\n\\n Jack remembered her ups and downs, wild swings sometimes.\\n\\n She sighed. \"Even after the doctors came up with a drug cocktail to even me out - well, I never evened out, but the amplitude of the swings lessened. Even so, high school was hell.\"\\n\\n Not for Jack. He remembered having a pretty good time. But he wasn\u0027t about to say that.\\n\\n She reached over and rubbed his shoulder. \"Except for you, Jack. You were my rock. You never rejected me, even at my nuttiest.\"\\n\\n Jack was wondering what he could say that wouldn\u0027t sound lame. The ringing of his cell phone saved him.\\n\\n \"I\u0027m calling from the Easy Peasy,\" said a male voice. \"You left a message about a charter?\"\\n\\n \"Yeah. Thanks for calling back. First thing: you have a depth finder?\"\\n\\n A snort. \"Course I do.\"\\n\\n \"Can you take me out to the Hudson Canyon where it\u0027s a mile deep?\"\\n\\n \"Yeah.\" He stretched the word. \"We are talking fishing here, right?\"\\n\\n \"No. Scientific experiment.\"\\n\\n Weezy gave him a look and he shrugged. Couldn\u0027t very well tell the guy he was dumping a sword overboard.\\n\\n \"How many people?\"\\n\\n \"Two. Just me and my assistant.\"\\n\\n Another Weezy look.\\n\\n He pressed the mute button. \"Eddie?\"\\n\\n She nodded.\\n\\n \"Easy Peasy\u0027s built to hold up to twenty. Kind of expensive for just two people.\"\\n\\n \"Money\u0027s no object. I\u0027ve got oceanography grants.\"\\n\\n Weezy rolled her eyes and put a hand over her mouth to stifle a laugh.\\n\\n \"Whatever. When do you want to go?\"\\n\\n \"This afternoon.\"\\n\\n \"No way.\"\\n\\n \"Why not?\"\\n\\n \"Don\u0027t you listen to the news? Heavy weather coming. Big nor\u0027easter heading up the coast. Ten-foot swells out there already.\"\\n\\n Jack hadn\u0027t been paying much attention to the weather. He\u0027d heard some mention of snow.\\n\\n \"Tomorrow, then?\"\\n\\n The master of the Easy Peasy couldn\u0027t hide his exasperation with this landlubber. \"It hits tomorrow. I\u0027ll call you next week.\"\\n\\n Jack didn\u0027t want to wait that long.\\n\\n \"I\u0027ll pay extra.\"\\n\\n \"Look, you can\u0027t pay me enough to take my boat out into what\u0027s coming. Talk to you next week.\"\\n\\n He hung up.\\n\\n \"Crap,\" Jack said. He told Weezy about the nor\u0027easter.\\n\\n \"It\u0027s been all over the news,\" she said. \"Where\u0027ve you been?\"\\n\\n Abducted ... taped to a chair ... threatened with torture ... shooting people ...\\n\\n \"Preoccupied, I guess. Maybe one of the other boats - \"\\n\\n \"Maybe the Andrea Gail will take you. Look, that katana\u0027s been in your closet for months. It can stay there a few more days. No sense in risking your life just to - \"\\n\\n Now Weezy\u0027s phone rang. She dug it out of her pocket.\\n\\n \"Hello?\" she said. \"Oh, hi. Yeah, he\u0027s right here. What - ?\" She frowned and handed Jack the phone. \"It\u0027s Dawn. She sounds a little worked up. Says she\u0027s got to talk to you.\" \\n\\n","sourceLink":"https://allnovel.net/the-dark-at-the-end/page-35.html","bookId":2554,"book":{"id":2554,"title":"The Dark at the End","description":"Storyline: The Dark at the End (Repairman Jack #15) \\n Bound by his promise to Glaeken, Jack has refrained from making any direct moves against Rasalom. But things have changed so there\u0027s nothing holding Jack in check any longer. Other changes are occurring as well. Jack is healing at an accelerated rate--much like Glaeken did when he was immortal. This can only mean that Glaeken\u0027s time is almost up and when he dies, Jack takes his place. \\n Rasalom continues to plot against the Lady. Twice she has died and returned; a third time and she will be gone, leaving a clear path for the Otherness to infiltrate this reality. But Ernst Drexler, formerly Rasalom\u0027s go-to guy for logistical support, fears he will be left out in the cold when the Change comes. He forms an uneasy alliance with Jack, who is preparing to face their old enemy. \\n Meanwhile, Dawn Pickering is searching for her supposedly dead baby. The trail leads her to a mansion in a remote Long Island coastal town, where she discovers a truth she could have never imagined. \\n Now the stage is set for Jack\u0027s massive assault on Rasalom. Jack knows he\u0027s got just one shot. But it\u0027s not just a matter of taking out Rasalom: he also must safely retrieve Dawn\u0027s child and minimize collateral damage. So, he comes up with a foolproof plan. \\n But fools are always with us….\\n","cover":"https://allnovel.net/images/the-dark-at-the-end.jpg","author":"F. Paul Wilson","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-dark-at-the-end.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:37:53 AM"}}
