{"id":111867,"no":7,"title":"Page 7","content":"Jack stopped at Tram\u0027s laundry off Canal Street and showed him the bomber jacket. Tram squinted against the smoke from his unfiltered Pall Mall as he inspected the ruined lining of the sleeve. He was on the far side of sixty and as a younger man had lost the lower half of his right leg to a Viet Cong finger charge. He\u0027d hired Jack a while back to help him with a mob problem he\u0027d been pushed into.\\n\\n \"Much blood.\"\\n\\n \"Tell me about it.\"\\n\\n He poked a finger through the bullet hole and eyed Jack. \"Yours?\"\\n\\n Jack nodded. He\u0027d gone home, found an insulated Windbreaker, then trained down here.\\n\\n \"Can\u0027t clean,\" Tram said, shaking his head. \"But can fix hole and sew new sleeve liner.\"\\n\\n \"Okay on the liner, but leave the holes.\"\\n\\n His eyebrows lifted. \"Eh?\"\\n\\n \"A reminder.\"\\n\\n Tram\u0027s smile revealed a mouth crowded with canary-yellow teeth. \"Yes. Reminder is good.\" He pointed down to where his right leg was steel and plastic. \"Makes one more careful.\"\\n\\n From Tram\u0027s he walked up to Canal Street and caught a cab over to Doc Hargus\u0027s place. He\u0027d called from home and the doc was in. Doc\u0027s office was his apartment, a third-floor walk-up. He\u0027d had a little substance abuse problem back in the day. Okay, a big problem and he\u0027d lost his license before he\u0027d cleaned up. His only vice now was beer, and that in moderation.\\n\\n He still practiced on the QT, treating injuries and overdoses and things people didn\u0027t want part of the public record. Too bad, because his portly physique, deep voice, and Wilford Brimley mustache inspired trust and confidence.\\n\\n \"What\u0027re you running on me?\" he said after Jack had stripped to the waist and he\u0027d removed Bill\u0027s dressing.\\n\\n Odd question.\\n\\n \"Not running anything. What\u0027re you talking about?\"\\n\\n Doc pulled on a pair of latex gloves and removed one of the butterflies, peeling both ends at once toward the middle.\\n\\n \"Didn\u0027t I tell you over the phone I couldn\u0027t stitch up any wound over twenty-four hours old?\"\\n\\n \"Yeah.\"\\n\\n \"And you told me this happened just this morning, right?\"\\n\\n \"Right.\"\\n\\n \"Bullshit.\"\\n\\n Jack tensed, feeling a niggle of annoyance. \"What do you mean?\"\\n\\n Doc pointed to the wound. \"I can\u0027t suture this. It\u0027s already started to knit.\"\\n\\n Jack craned his neck and looked. The wound still looked bloody and angry to him.\\n\\n \"That\u0027s just the butterflies holding it together.\"\\n\\n Doc looked at him over his glasses. \"I think I\u0027ve seen a few more of these than you, Jack.\"\\n\\n \"Okay, no argument there, but Doc, I swear: I got grazed at around ten o\u0027clock this morning. Why would I lie?\"\\n\\n Doc looked at him, then adjusted his glasses and leaned closer to the wound. He studied it for a few seconds, then straightened, shaking his head.\\n\\n \"Yeah. Good question. Why would you? But Jack ... that\u0027s at least two days old - \" His hand flashed up as Jack opened his mouth to protest. \"I\u0027ll rephrase: It\u0027s got at least two days\u0027 worth of healing there. If, as you say, this happened this morning, well, you tell me what vitamins and herbs you\u0027re taking because you\u0027ve suddenly developed some super healing powers.\"\\n\\n Jack went cold as he heard Glaeken\u0027s voice echo in his head.\\n\\n Wounds heal much more quickly than you\u0027d imagine ... a scratch like that would heal almost immediately.\\n\\n Jack\u0027s wound hadn\u0027t healed \"almost immediately,\" but Doc said it was already days into the process, though only hours had passed.\\n\\n \"You okay?\" Doc said. \"You don\u0027t look so hot. Never known you to mind the sight of blood - even your own.\"\\n\\n \"I\u0027m okay.\"\\n\\n Big lie.\\n\\n Glaeken seemed to be failing, and here Jack was developing the healing powers the old guy had once possessed. Pretty obvious that Jack, as the Heir to the Defender post, was being prepared to step into Glaeken\u0027s shoes. How long had this healing thing been going on? If Jack hadn\u0027t been hurt, he still wouldn\u0027t know about it. It could only mean Glaeken\u0027s demise was imminent. How long did the old guy have?\\n\\n \"I\u0027ll replace the butterflies,\" Doc was saying, \"even though it hardly needs them at this point. Pretty good job of closing that wound. Who did it?\"\\n\\n \"Some guy.\"\\n\\n I don\u0027t want this, Jack thought. I do not want this.\\n\\n But no one had asked. No one had given him a choice. \\n\\n","sourceLink":"https://allnovel.net/the-dark-at-the-end/page-7.html","bookId":2554,"book":{"id":2554,"title":"The Dark at the End","description":"Storyline: The Dark at the End (Repairman Jack #15) \\n Bound by his promise to Glaeken, Jack has refrained from making any direct moves against Rasalom. But things have changed so there\u0027s nothing holding Jack in check any longer. Other changes are occurring as well. Jack is healing at an accelerated rate--much like Glaeken did when he was immortal. This can only mean that Glaeken\u0027s time is almost up and when he dies, Jack takes his place. \\n Rasalom continues to plot against the Lady. Twice she has died and returned; a third time and she will be gone, leaving a clear path for the Otherness to infiltrate this reality. But Ernst Drexler, formerly Rasalom\u0027s go-to guy for logistical support, fears he will be left out in the cold when the Change comes. He forms an uneasy alliance with Jack, who is preparing to face their old enemy. \\n Meanwhile, Dawn Pickering is searching for her supposedly dead baby. The trail leads her to a mansion in a remote Long Island coastal town, where she discovers a truth she could have never imagined. \\n Now the stage is set for Jack\u0027s massive assault on Rasalom. Jack knows he\u0027s got just one shot. But it\u0027s not just a matter of taking out Rasalom: he also must safely retrieve Dawn\u0027s child and minimize collateral damage. So, he comes up with a foolproof plan. \\n But fools are always with us….\\n","cover":"https://allnovel.net/images/the-dark-at-the-end.jpg","author":"F. Paul Wilson","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-dark-at-the-end.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:37:53 AM"}}
