{"id":23879,"no":29,"title":"Chapter 29","content":"The train pursued its course, that evening, without interruption, passing Fort Saunders, crossing Cheyene Pass, and reaching Evans Pass. The road here attained the highest elevation of the journey, eight thousand and ninety-one feet above the level of the sea. The travellers had now only to descend to the Atlantic by limitless plains, levelled by nature. A branch of the `grand trunk\u0027 led off southward to Denver, the capital of Colorado. The country round about is rich in gold and silver, and more than fifty thousand inhabitants are already settled there. \n Thirteen hundred and eighty-two miles had been passed over from San Francisco, in three days and three nights; four days and nights more would probably bring them to New York. Phileas Fogg was not as yet behindhand. \n During the night Camp Walbach was passed on the left; Lodge Pole Creek ran parallel with the road, marking the boundary between the territories of Wyoming and Colorado. They entered Nebraska at eleven, passed near Sedgwick, and touched at Julesburg, on the southern branch of the Platte River. \n It was here that the Union Pacific Railroad was inaugurated on the 23rd of October, 1867, by the chief engineer, General Dodge. Two powerful locomotives, carrying nine cars of invited guests, amongst whom was Thomas C. Durant, vice-president of the road, stopped at this point; cheers were given, the Sioux and Pawnees performed an imitation Indian battle, fireworks were let off, and the first number of the Railway Pioneer was printed by a press brought on the train. Thus was celebrated the inauguration of this great railroad, a mighty instrument of progress and civilization, thrown across the desert, and destined to link together cities and towns which do not yet exist. The whistle of the locomotive, more powerful than Amphion\u0027s lyre, was about to bid them rise from American soil. \n Fort McPherson was left behind at eight in the morning, and three hundred and fifty-seven miles had yet to be traversed before reaching Omaha. The road followed the capricious windings of the southern branch of the Platte Fiver, on its left bank. At nine the train stopped at the important town of North Platte, built between the two arms of the river, which rejoin each other around it and form a single artery, - a large tributary whose waters empty into the Missouri a little above Omaha. \n The one hundred and first meridian was passed. \n Mr Fogg and his partners had resumed their game; no one - not even the dummy - complained of the length of the trip. Fix had begun by winning several guineas, which he seemed likely to lose; but he showed himself a not less eager whist-player than Mr Fogg. During the morning, chance distinctly favoured that gentleman. Trumps and honours were showered upon his hands. \n Once, having resolved on a bold stroke, he was on the point of playing a spade, when a voice behind him said, `I should play a diamond.\u0027 \n Mr Fogg, Aouda and Fix raised their heads, and beheld Colonel Proctor. \n Stamp Proctor and Phileas Fogg recognized each other at once. \n `Ah! it\u0027s you, is it, Englishman?\u0027 cried the colonel. `It\u0027s you who are going to play a spade!\u0027 \n `And who plays it,\u0027 replied Phileas Fogg coolly, throwing down the ten of spades. \n `Well, it pleases me to have it diamonds,\u0027 replied Colonel Proctor, in an insolent tone. \n He made a movement as if to seize the card which had just been played, adding, `You don\u0027t understand anything about whist.\u0027 \n `Perhaps I do, as well as another,\u0027 said Phileas Fogg, rising. \n `You have only to try, son of John Bull,\u0027 replied the colonel. \n Aouda turned pale, and her blood ran cold. She seized Mr Fogg\u0027s arm and gently pulled him back. Passepartout was ready to pounce upon the American, who was staring insolently at his opponent. But Fix got up, and going to Colonel Proctor said, `You forget that it is I with whom you have to deal, sir; for it was I whom you not only insulted, but struck!\u0027 \n `Mr Fix,\u0027 said Mr Fogg, `pardon me, but this affair is mine, and mine only. The colonel has again insulted me, by insisting that I should not play a spade, and he shall give me satisfaction for it.\u0027 \n `When and where you will,\u0027 replied the American, `and with whatever weapon you choose.\u0027 \n Aouda in vain attempted to retain Mr Fogg; ash vainly did the detective endeavour to make the quarrel his. Passepartout wished to throw the colonel out of the window, but a sign from his master checked him. Phileas Fogg left the car, and the American followed him upon the platform. \n `Sir,\u0027 said Mr Fogg to his adversary, `I am in a great hurry to get back to Europe, and any delay whatever will be greatly to my disadvantage.\u0027 \n `Well, what\u0027s that to me?\u0027 replied Colonel Proctor. \n `Sir,\u0027 said Mr Fogg, very politely; `after our meeting at San Francisco, I determined to return to America and find you as soon as I had completed the business which called me to England.\u0027 \n `Really!\u0027 \n `Will you appoint a meeting for six months hence?\u0027 \n `Why not ten years hence?\u0027 \n `I say six months,\u0027 returned Phileas Fogg; `and I shall be at the place of meeting promptly.\u0027 \n `All this is an evasion,\u0027 cried Stamp Proctor. `Now or never!\u0027 \n `Very good. You are going to New York?\u0027 \n `No.\u0027 \n `To Chicago?\u0027 \n `No.\u0027 \n `To Omaha?\u0027 \n `What difference is it to you? Do you know Plum Creek?\u0027 \n `No,\u0027 replied Mr Fogg. \n `It\u0027s the next station. The train will be there in an hour, and will stop there ten minutes. In ten minutes several revolver-shots could be exchanged.\u0027 \n `Very well,\u0027 said Mr Fogg. `I will stop at Plum Creek.\u0027 \n `And I guess you\u0027ll stay there too,\u0027 added the American insolently. \n `Who knows?\u0027 replied Mr Fogg, returning to the car as coolly as usual. He began to reassure Aouda, telling her that blusterers were never to be feared, and begged Fix to be his second at the approaching duel, a request which the detective could not refuse. Mr Fogg resumed the interrupted game with perfect calmness. \n At eleven o\u0027clock the locomotive\u0027s whistle announced that they were approaching Plum Creek station. Mr Fogg rose, and, followed by Fix, went out upon the platform. Passepartout accompanied him, carrying a pair of revolvers. Aouda remained in the car, as pale as death. \n The door of the next car opened, and Colonel Proctor appeared on the platform, attended by a Yankee of his own stamp as his second. But just as the combatants were about to step from the train, the conductor hurried up, and shouted, `You can\u0027t get off, gentlemen!\u0027 \n `Why not?\u0027 asked the colonel. \n `We are twenty minutes late, and we shall not stop.\u0027 \n `But I am going to fight a duel with this gentleman.\u0027 \n `I am sorry,\u0027 said the conductor; `but we shall be off at once. There\u0027s the bell ringing now.\u0027 \n The train started. \n `I\u0027m really very sorry, gentlemen,\u0027 said the conductor. `Under any other circumstances I should have been happy to oblige you. But, after all, as you have not had time to fight here, why not fight as we go along?\u0027 \n `That wouldn\u0027t be convenient, perhaps, for this gentleman,\u0027 said the colonel, in a jeering tone. \n `It would be perfectly so,\u0027 replied Phileas Fogg. \n `Well, we are really in America,\u0027 thought Passepartout, `and the conductor is a gentleman of the first order!\u0027 \n So muttering, he followed his master. \n The two combatants, their seconds, and the conductor passed through the cars to the rear of the train. The last car was only occupied by a dozen passengers, whom the conductor politely asked if they would not be so kind as to leave it vacant for a few moments, as two gentlemen had an affair of honour to settle. The passengers granted the request with alacrity, and straightaway disappeared on the platform. \n The car, which was some fifty feet long, was very convenient for their purpose. The adversaries might march on each other in the aisle, and fire at their ease. Never was duel more easily arranged. Mr Fogg and Colonel Proctor, each provided with two six-barrelled revolvers, entered the car. The seconds, remaining outside, shut them in. They were to begin firing at the first whistle of the locomotive. After an interval of two minutes, what remained of the two gentlemen would be taken from the car. \n Nothing could be more simple. Indeed, it was all so simple that Fix and Passepartout felt their hearts beating as if they would crack. They were listening for the whistle agreed upon, when suddenly savage cries resounded in the air, accompanied by reports which certainly did not issue from the car where the duellists were. The reports continued in front and ~the whole length of the train. Cries of terror proceeded from the interior of the cars. \n Colonel Proctor and Mr Fogg, revolvers in hand, hastily quitted their prison, and rushed forward where the noise was most clamorous. They then perceived that the train was attacked by a band of Sioux. \n This was not the first attempt of these daring Indians, for more than once they had waylaid trains on the road. A hundred of them had, according to their habit, jumped upon the steps without stopping the train, with the ease of a clown mounting a horse at full gallop. \n The Sioux were armed with guns, from which came the reports, to which the passengers who were almost all armed, responded by revolver-shots. \n The Indians had first mounted the engine, and half stunned the engineer and stoker with blows from their muskets. A Sioux chief, wishing to stop the train, but not knowing how to work the regulator, had opened wide instead of closing the steam-valve, and the locomotive was plunging forward with terrific velocity. \n The Sioux had at the same time invaded the cars, skipping like enraged monkeys over the roofs, thrusting open the doors, and fighting hand to hand with the passengers. Penetrating the baggage-car, they pillaged it, throwing the trunks out of the train. The cries and shots were constant. \n The travellers defended themselves bravely; some of the cars were barricaded, and sustained a siege, like moving forts, carried along at a speed of a hundred miles an hour. \n Aouda behaved courageously from the first. She defended herself like a true heroine with a revolver, which she shot through the broken windows whenever a savage made his appearance. Twenty Sioux had fallen mortally wounded to the ground, and the wheels crushed those who fell upon the rails as if they had been worms. Several passengers, shot or stunned, lay on the seats. \n It was necessary to put an end to the struggle, which had lasted for ten minutes, and which would result in the triumph of the Sioux if the train was not stopped. Fort Kearney station, where there was a garrison, was only two miles distant; but, that once passed, the Sioux would be masters of the train between Fort Kearney and the station beyond. \n The conductor was fighting beside Mr Fogg, when he was shot and fell. At the same moment he cried, `Unless the train is stopped in five minutes, we are lost!\u0027 \n `It shall be stopped,\u0027 said Phileas Fogg, preparing to rush from the car. \n `Stay, monsieur,\u0027 cried Passepartout; `I will go.\u0027 \n Mr Fogg had not time to stop the brave fellow, who, opening a door unperceived by the Indians, succeeded in slipping under the car; and while the struggle continued, and the balls whizzed across each other over his head, he made use of his old acrobatic experience, and with amazing agility worked his way under the cars, holding on to the chains, aiding himself by the brakes and edges of the sashes, creeping from one car to another with marvellous skill, and thus gaining the forward end of the train. \n There, suspended by one hand between the baggage-car and the tender, with the other he loosened the safety chains; but, owing to the traction, he would never have succeeded in unscrewing the yoking-bar, had not a violent concussion jolted this bar out. The train, now detached from the engine, remained a little behind, whilst the locomotive rushed forward with increased speed. \n Carried on by the force already acquired, the train still moved for several minutes; but the brakes were worked, and at last they stopped, less than a hundred feet from Kearney station. \n The soldiers of the fort, attracted by the shots, hurried up; the Sioux had not expected them, and decamped in a body before the train entirely stopped. \n But when the passengers counted each other on the station platform several were found missing; among others the courageous Frenchman, whose devotion had just saved them. \n 从旧金山出发到现在，三夭三夜已经走完了一千三百八十二英里（再有四天四夜不论如何也能到达纽约了，斐利亚·福克显然是在按部就班地完成着自己的日程。这一夜，火车从瓦尔巴营右方驰过。洛基布尔河和铁道平行，顺着怀俄明和科罗拉多两州笔直的交界线向前奔流。十一时，火车进入内布拉斯加州，经过塞奇威克就到了位于普拉特河南支流的居尔斯甫。\n 1867年10月23日，联合太平洋铁路公司在此地举行了通车典礼。总工程师是J·M·道奇将军，当时就是在这里由两个大机车拖着九节客车，送来了以副总统M·汤姆斯·C·杜郎为首的许多观礼人士。就在这儿，当时曾经有群众欢呼；同时西乌人和包尼斯人表演了一场印第安人战斗演习，在这儿，曾经点放庆祝通车的焰火，最后，人们在这儿用手提印刷机出版了《铁路先锋报》的创刊号。这就是这条大铁路举行庆祝通车典礼的情况。这条铁路是一条进步和文明的道路。它穿过荒凉的原野，把很多当时还不存在的城市联结起来。火车头的汽笛比神话中昂斐勇的七弦琴还要强，它使许多城市很快地在美洲大陆上冒出来了。\n 早晨八点钟，火车越过麦克费尔逊堡，此地离奥马哈角仅三百五十七英里。火车沿着普拉特河左岸，顺着普拉特河南部支流千变万化的弯曲河岸前进。九点钟火车到达了位于南、北普拉特河支流中间的一座大城市——北普拉特。两条大河在这座城的附近形成一条巨流，然后和奥马哈北面不远的密苏里河汇合。\n 现在已经越过了经线一百零一度了。\n 福克先生和他的牌友重新开始玩起了“惠司脱”。包括那张空位子在内，这两对牌友谁也没有埋怨这漫长的旅途。起初费克斯本来赢了一点钱，现在却正往外输，但是他的赌兴可并不比福克差。福克先生今天早上运气特别好，王牌和大分都一个劲儿不停地往他手上跑。现在他把牌计算了一下准备来一回大胆的绝牌，他决定打黑桃，就在这时候他听见自己椅子后边有个人说话：“要是我，我就打红方块……”\n 福克先生、艾娥达夫人和费克斯三个人抬头一看，站在他们旁边的不是别人，正是普洛克托上校。\n 斯汤姆·普洛克托和斐利亚·福克两个人一见面马上就认出来了。\n “哦！原来是你，英国先生，”上校喊着说，“就是你要打黑桃！”\n “是我打牌，还是你打牌。”斐利亚·福克出了一张黑桃十，冷冰冰地回答说。\n “那好啊，我可是愿意打红方块。”普洛克托上校带着气说。\n 他同时伸手就要拿那张黑桃十，一面说：\n “你根本就不懂得怎么打。”\n “也许我能打的比另一个人更好，”斐利亚·福克说着，站了起来。\n “那你就来打打看吧，你这个小约翰牛！”蛮横的上校说。\n 艾娥达夫人脸都吓白了，她全身的血液好象都要沸腾起来了。她拉住斐利亚·福克的手臂，福克轻轻地把她推开了，路路通准备马上向这个美国人扑过去，美国人用非常鄙视的眼光看着福克。这时，费克斯站起来了，他走近普洛克托上校，对他说，\n “你忘了，先生，你该找我，你不仅骂了我，甚至还打了我！”\n “费克斯先生！”福克先生说，“我请您原谅，但是这件事只和我一个人有关。这位上校借口说我打黑桃打错了，又一次来挑衅，我得跟他算算这笔账。”\n “算就算吧，时间地点由你挑，”美国人说，“用什么家伙也听你的便！”\n 艾娥达夫人一心想拉住福克，但是一点效果也没有。费克斯企图把事情揽到自己身上也是白费力气。路路通本想把这个上校从窗口丢出去，但是他的主人扬了扬手，制止了他。这时，斐利亚·福克走出了车厢，美国人跟他一齐上了车桥。\n “先生，”福克先生跟对方说，“我急于要回欧洲，任何一点耽搁都会对我造成很大损失。”\n “你说这些与我有什么关系。”\n “先生，”福克先生非常客气地接着说，“自从我们在旧金山碰面之后，我已经计划好了，现在我有事要回欧洲，等事情一办完我马上就要到美洲来找你。”\n “真的吗？”\n “你肯跟我约定六个月以后见面吗？”\n “为什么你不说六年以后？”\n “我说六个月，”福克先生说，“到时候我一定来。”\n “你这话全是装蒜，找借口下台！”斯汤姆·普洛克托嚷着说，“要么你就说不敢，要么就马上干！”\n “那好！马上干！”福克先生回答说，“你到纽约去吗？”\n “我不去。”\n “到芝加哥？”\n “也不去。”\n “到奥马哈？”\n “你管我到哪儿去呢！你知道普鲁木河吗？”\n “我不知道。”福克先生回答说。\n “就在下一站。过一个钟头就到，火车在那儿要停十分钟。有十分钟的时间，咱们满可以交换几颗子弹。”\n “算数，”福克先生说，“我在普鲁木河下车。”\n “我甚至相信你，准会永远留在那儿。”美国人穷凶极恶地说。\n “那就要看了，先生。”福克先生回答说，他说完这话就走进了车厢，依然和平时一样冷静。\n 他回到车厢，先安慰了艾娥达夫人几句，说这种纸老虎没什么可怕。然后他就约费克斯停一会决斗的时候作他的公证人，费克斯当然不能拒绝，于是斐利亚·福克若无其事地又拿起刚才的牌，继续安安静静地打他的黑桃。\n 十一点钟，机车的汽笛宣布普鲁木河车站到了。福克先生站起来，走向车桥，后面跟着费克斯。路路通背着两支手枪，陪着福克先生走了出去。这时，艾娥达夫人吓得面无人色，独自留在车厢里。\n 同时另一节车厢的门也开了。普洛克托上校也走上了车桥，后面跟着一个神气跟他相仿的“洋乞”，那是他的公证人。但是，当两个对手刚走下火车，列车员就喊着跑过来了：\n “别下车，先生们。”\n “为什么？”上校问。\n “我们的车误点二十分钟，车子在这儿不停了。”\n “可是我要在此地跟这位先生决斗。”\n “这个，我很抱歉，”列车员说，“可是火车立刻就要开了。喏，打点了。”\n 真的钟响了，火车又开了。\n “我真觉得很对不起，先生们，”列车员说，“如果换个别的时候，我准定帮忙。不过话又说回来了，虽然你们没有来得及在站上决斗，可是你们可以在车上干，谁也管不着。”\n “在车上也许这位先生会觉得不太合适吧！”上校嘻皮笑脸地说。\n “我觉得完全合适。”斐利亚·福克回答说。\n “瞧这个痛快劲儿，就准会相信我们是在美国！”路路通心里说，“这个列车员可真是个了不起的好人！”\n 他心里一边这样想着一边就跟着自己的主人走了。\n 列车员领着两位决斗的对手和他们的公证人，从一节车厢走到另一节车厢，一直到最后一节车。这节车厢里只有十几个旅客。列车员就问旅客们是否可以暂时把车厢让给这两位先生用一下，他们要在这儿决斗。旅客们听了这话吓了一跳，但是他们很乐意帮这两位先生的忙，于是都走出车厢，站到车桥上去了。\n 这个车厢长约五十英尺，作一个决斗场倒挺合适。在这里决斗真是大方便了，两个对手在中间的过道上，可以向对方逼近，高兴怎么打就怎么打。福克先生和普洛克托上校每人各带两把六轮手枪，走进了车厢。他们的两个证人替他们关上了门，守在外面。只等机车上的汽笛一响，他们就开始射击……然后只要再过短短的两分钟，就可以进去把活着的一位先生接出来。\n 按说，没有比这再简单的事了。它是那么简单，以至使费克斯和路路通觉得自己的心跳动得简直要爆炸了。\n 人们在等待着第一声汽笛，正在这个时候，突然听见一阵凶猛的喊叫，还夹杂着噼噼啪啪的枪声，但是这枪声并不是从进行决斗的车厢里传出来的。相反地，继续响着的枪声是从整个列车，甚至是从最前头的车厢里传来的。列车上到处是惊慌的喊叫。普洛克托上校和福克先生，拿着手枪，立即走出了决斗场，赶到前面发出更加激烈的枪声和喊声的车厢去了。他们已经知道：这是一帮西乌人在袭击火车。\n 这些亡命的印第安人拦劫火车已经不是头一回了，在这以前，他们也干过好几次。他们总是用这样的办法：不等火车停下来，上百的人一齐纵身跳上车门口的踏板，然后就象在奔跑中翻身上马的马戏团小丑似的爬上了车厢。\n 这些西乌人都带着步枪，刚才的枪声就是他们和旅客相互射击的声音，车上旅客差不多都随身带有武器。\n 这些印第安人一上车就先往机车上跑。火车司机和司炉早被他们用大头棒打昏过去了。一个西乌人首领上去想把火车停下来，但是他不知道怎么关汽门。本来想把汽门关上的，他却把它完全拉开了，于是机车就象脱缰的野马，飞跑起来。\n 在同一个时间里，其他的西乌人攻进了车厢。他们在车厢顶上飞跑，一个个都象野猴子似的，他们从车窗上跳进来和旅客进行肉搏战。他们抢了行李车，很多箱子、行李都从里边给扔出来了，枪声和叫喊声一直没停。\n 这时旅客们都在拼命地抵抗，有些被围攻的车厢已经变成了防御工事，简直就象一个个活动的堡垒；而这些堡垒却正被机车拖着，以每小时一百英里的速度向前飞驰。\n 艾娥达夫人从一开始就表现得非常勇敢，当西乌人向她冲过来时，她就拿着手枪毫不畏惧地从破玻璃门口向敌人射击。有二十多个西乌人被打得半死从车上滚下去了，有的从车桥掉到铁轨上，象虫子一样被火车轮子压得粉碎。很多旅客中了枪弹或者挨了大头棒，伤势很重，躺在椅子上。\n 现在必须使这场战斗结束，它已经继续了十分钟了。倘若火车不停，那结果就一定会便宜了西乌人。因为离此地不到两英里就是克尔尼堡，那里有个美国兵营，如果再过去，从克尔尼堡一直到下一站，这些西乌人就可以在车上为所欲为。\n 列车员本来正在和福克并肩作战，但是飞过来一颗子弹把他打倒了，这个人就在自己倒下去的时候叫着说：\n “五分钟之内火车要是不停，我们就全要完蛋了！”\n “一定会停下来的！”斐利亚·福克说着就准备冲出车厢。\n “您留在这儿，先生，”路路通喊着说，“这事交给我好了。”\n 斐利亚·福克还没来得及阻止，这个大胆的小伙子已经打开一个车窗溜到车厢下面去了，他没有被西乌人看见。这时战斗还在激烈地进行，子弹从他头上飕飕地飞过，他运用自己马戏团演员那一套轻巧灵活的故技，在车厢下面隐蔽前进。他攀着联结列车的铁链，踩着煞车舵盘，沿着外面车架的边沿，巧妙地从一节车爬到另一节车，一直爬到最前面的一节车上。他居然没有被人发觉，这简直是不可思议的事。\n 现在，他一只手攀着车，整个身体悬空在行李车和煤车之间，另外一只手去松开挂钩链条，但是，由于机车的牵引力很大，如果单靠他的力量，挂钩中间的铁栓一辈子也拔不开，就在这时候，只见机车一阵摇晃，铁栓被震动得跳出来了。列车脱离了车头慢慢地落后了，而机车却更增加了飞驰的速度。列车由于惯性的推动力继续前进了几分钟，但是车厢里的旅客扭紧了煞车舵盘，列车终于在离开克尔尼堡车站不到一百步的地方停下来了。\n 兵营里的士兵听到了枪声，立即赶了过来。西乌人还没有等到他们来，趁着列车还没有完全停下来以前，他们早就四散逃窜了。\n 但是，当旅客们在站台上检查人数时，发现少了一些人，其中包括那个仗义拯救了这些旅客性命的勇敢的法国人。\n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/64/3739.html","bookId":582,"book":{"id":582,"title":"Around the World In 80 Days八十天环游地球","description":"简介： Around the World in Eighty Days (French: Le tour du monde en quatre-vingts jours) is a classic adventure novel by the French writer Jules Verne, first published in 1873. In the story, Phileas Fogg of London and his newly empl...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1285727176bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/64","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
