{"id":23853,"no":3,"title":"Chapter 3","content":"Phileas Fogg, having shut the door of his house at half-past eleven, and having put his right foot before his left five hundred and seventy-five times, and his left foot before his right five hundred and seventy-six times, reached the Reform Club, an imposing edifice in Pall Mall, which could not have cost less than three millions. He repaired at once to the dining-room, the nine windows of which open upon a tasteful garden, where the trees were already gilded with an autumn colouring; and took his place at the habitual table, the cover of which had already been laid for him. His breakfast consisted of a side-dish, a broiled fish with Reading sauce, a scarlet slice of roast beef garnished with mushrooms, a rhubarb and gooseberry tart, and a morsel of Cheshire cheese, the whole being washed down with several cups of tea, for which the Reform is famous. He rose at thirteen minutes to one, and directed his steps towards the large hall, a sumptuous apartment adorned with lavishly-framed paintings. A flunkey handed him an uncut Times, which he proceeded to cut with a skill which betrayed familiarity with this delicate operation. The perusal of this paper absorbed Phileas Fogg until a quarter before four, whilst the Standard, his next task, occupied him till the dinner hour. Dinner passed as breakfast had done, and Mr Fogg reappeared in the reading-room and sat down to the Pall Mall at twenty minutes before six. Half-an-hour later several members of the Reform came in and drew up to the fireplace, where a coal fire was steadily burning. They were Mr Fogg\u0027s usual partners at whist: Andrew Stuart, an engineer; John Sullivan and Samuel Fallentin, bankers; Thomas Flanagan, a brewer; and Gauthier Ralph, one of the Directors of the Bank of England; - all rich and highly respectable personages, even in a club which comprises the princes of English trade and finance. \\n\\n `Well, Ralph,\u0027 said Thomas Flanagan, `what about that robbery?\u0027 \\n\\n `Oh,\u0027 replied Stuart; `the bank will lose the money.\u0027 \\n\\n `On the contrary,\u0027 broke in Ralph, `I hope we may put our hands on the robber. Skilful detectives have been sent to all the principal ports of America and the Continent, and he\u0027ll be a clever fellow if he slips through their fingers.\u0027 \\n\\n `But have you got the robber\u0027s description?\u0027 asked Stuart. \\n\\n `In the first place he is no robber at all,\u0027 returned Ralph, positively. \\n\\n `What! a fellow who makes off with fifty - five thousand pounds, no robber?\u0027 \\n\\n `No.\u0027 \\n\\n `Perhaps he\u0027s a manufacturer, then.\u0027 \\n\\n `The Daily Telegraph says that he is a gentleman.\u0027 \\n\\n It was Phileas Fogg, whose head now emerged from behind his newspapers, who made this remark. He bowed to his friends, and entered into the conversation. The affair which formed its subject, and which was town talk, had occurred three days before at the Bank of England. A package of bank-notes, to the value of fifty-five thousand pounds, had been taken from the principal cashier\u0027s table, that functionary being at the moment engaged in registering the receipt of three shillings and sixpence. Of course he could not have his eyes everywhere. Let it be observed that the Bank of England reposes a touching confidence in the honesty of the public. There are neither guards nor gratings to protect its treasures; gold, silver, bank-notes are freely exposed, at the merry of the first comer. A keen observer of English customs relates that, being in one of the rooms of the Bank one day, he had the curiosity to examine a gold ingot weighing some seven or eight pounds. He took it up, scrutinized it, passed it to his neighbour, he to the next man, and so on until the ingot, going from hand to hand, was transferred to the end of a dark entry; nor did it return to its place for half-an-hour. Meanwhile, the cashier had not so much as raised his head. But in the present instance things had not gone so smoothly. The package of notes not being found when five o\u0027clock sounded from the ponderous clock in the `drawing office,\u0027 the amount was passed to the account of profit and loss. As soon as the robbery was discovered, picked detectives hastened off to Liverpool, Glasgow, Havre, Suez, Brindisi, New York, and other ports, inspired by the proffered reward of two thousand pounds, and five per cent on the sum that might be recovered. Detectives were also charged with narrowly watching those who arrived at or left London by rail, and a judicial examination was at once entered upon. \\n\\n There were real grounds for supposing, as the Daily Telegraph said, that the thief did not belong to a professional band. On the day of the robbery a well-dressed gentleman of polished manners, and with a well-to-do air, had been observed going to and fro in the paying-room, where the crime was committed. A description of him was easily procured and sent to the detectives; and some hopeful spirits, of whom Ralph was one, did not despair of his apprehension. The papers and clubs were full of the affair, and everywhere people were discussing the probabilities of a successful pursuit; and the Reform Club was especially agitated, several of its members being Bank officials. \\n\\n Ralph would not concede that the work of the detectives was likely to be in vain, for he thought that the prize offered would greatly stimulate their zeal and activity. But Stuart was far from sharing this confidence; and as they placed themselves at the whist-table, they continued to argue the matter. Stuart and Flanagan played together, while Phileas Fogg had Fallentin for his partner. As the game proceeded the conversation ceased, excepting between the rubbers, when it revived again. \\n\\n `I maintain,\u0027 said Stuart, `that the chances are favour of the thief, who must be a shrewd fellow.\u0027 \\n\\n Well, but where can he fly to?\u0027 asked Ralph. `No country is safe for him.\u0027 \\n\\n `Pshaw!\u0027 \\n\\n `Where could he go, then?\u0027 \\n\\n `Oh, I don\u0027t know that. The world is big enough.\u0027 \\n\\n `It was once,\u0027 said Phileas Fogg, in a low tone. `Cut, sir,\u0027 he added, handing the cards to Thomas Flanagan. \\n\\n The discussion fell during the rubber, after which Stuart took up its thread. \\n\\n `What do you mean by \"once\"? Has the world grown smaller?\u0027 \\n\\n `Certainly,\u0027 returned Ralph. `I agree with Mr Fogg. The world has grown smaller, since a man can now go round it ten times more quickly than a hundred years ago. And that is why the search for this thief will be more likely to succeed.\u0027 \\n\\n `And also why the thief can get away more easily.\u0027 \\n\\n `Be so good as to play, Mr Stuart,\u0027 said Phileas Fogg. \\n\\n But the incredulous Stuart was not convinced, and when the hand was finished, Said eagerly: `You have a strange way, Ralph, of proving that the world has grown smaller. So, because you can go round it in three months--\u0027 \\n\\n `In eighty days,\u0027 interrupted Phileas Fogg. \\n\\n `That is true, gentlemen,\u0027 added John Sullivan. \\n\\n `Only eighty days, now that the section between Rothal and Allahabad, on the Great Indian Peninsula Railway, has been opened. Here is the estimate made by the Daily Telegraph:-- \\n\\n From Bombay to Calcutta, by rail 3 \" \\n\\n From Calcutta to Hong Kong, by steamer - - - - - 13 \" \\n\\n From Hong Kong to Yokohama (Japan), by steamer - - - - 6 \" \\n\\n From Yokohama to San Francisco, by steamer---------------------------- 22 \" \\n\\n From San Francisco to New York, by rail---------------------------- - 7 \" \\n\\n From New York to London, by steamer and rail-------------- 9 \" \\n\\n Total------------- 80 days.\\n\\n `But suppose the Hindoos or Indians pull up the rails,\u0027 replied Stuart; `suppose they stop the trains, pillage the luggage-vans, and scalp the passengers!\u0027 \\n\\n `All included,\u0027 calmly retorted Fogg; adding, as he threw down the cards, `Two trumps.\u0027 \\n\\n Stuart, whose turn it was to deal, gathered them up, and went on: `You are right, theoretically, Mr Fogg, but practically--\u0027 \\n\\n `Practically also, Mr Stuart.\u0027 \\n\\n `I\u0027d like to see you do it in eighty days.\u0027 \\n\\n `It depends on you. Shall we go?\u0027 \\n\\n `Heaven preserve me! But I would wager four thousand pounds that such a journey, made under these conditions, is impossible.\u0027 \\n\\n `Quite possible, on the contrary,\u0027 returned Mr Fogg. \\n\\n `Well, make it, then!\u0027 \\n\\n `The journey round the world in eighty days?\u0027 \\n\\n `Yes.\u0027 \\n\\n `I should like nothing better.\u0027 \\n\\n `When?\u0027 \\n\\n `At once. Only I warn you that I shall do it at your expense.\u0027 \\n\\n `It\u0027s absurd!\u0027 cried Stuart, who was beginning to be annoyed at the persistency of his friend. `Come, let\u0027s go on with the game.\u0027 \\n\\n `Deal over again, then,\u0027 said Phileas Fogg. `There\u0027s a false deal.\u0027 \\n\\n Stuart took up the pack with a feverish hand; then suddenly put them down again. \\n\\n `Well, Mr Fogg,\u0027 said he, `it shall be so: I will wager the four thousand on it.\u0027 \\n\\n `Calm yourself, my dear Stuart,\u0027 said Fallentin. `It\u0027s only a joke.\u0027 \\n\\n `When I say I\u0027ll wager,\u0027 returned Stuart, `I mean it.\u0027 \\n\\n `All right,\u0027 said Mr Fogg; and turning to the others he continued: `I have a deposit of twenty thousand at Baring\u0027s which I will willingly risk upon it.\u0027 \\n\\n `Twenty thousand pounds!\u0027 cried Sullivan. `Twenty thousand pounds, which you would lose by a single accidental delay!\u0027 \\n\\n `The unforeseen does not exist,\u0027 quietly replied Phileas Fogg. \\n\\n `But, Mr Fogg, eighty days are only the estimate of the least possible time in which the journey can be made.\u0027 \\n\\n `A well - used minimum suffices for everything.\u0027 \\n\\n `But, in order not to exceed it, you must jump mathematically from the trains upon the steamers, and from the steamers upon the trains again.\u0027 \\n\\n `I will jump-mathematically.\u0027 \\n\\n `You are joking.\u0027 \\n\\n `A true Englishman doesn\u0027t joke when he is talking about so serious a thing as a wager,\u0027 replied Phileas Fogg, solemnly. `I will bet twenty thousand pounds against anyone who wishes, that I will make the tour of the world in eighty days or less; in nineteen hundred and twenty hours, or a hundred and fifteen thousand two hundred minutes. Do you accept?\u0027 \\n\\n `We accept,\u0027 replied Messrs Stuart, Fallentin, Sullivan, Flanagan, and Ralph, after consulting each other. \\n\\n `Good,\u0027 said Mr Fogg. `The train leaves for Dover at a quarter before nine. I will take it.\u0027 \\n\\n `This very evening?\u0027 asked Stuart. \\n\\n `This very evening,\u0027 returned Phileas Fogg. He took out and consulted a pocket almanac, and added, `As to-day is Wednesday, the second of October, I shall be due in London, in this very room of the Reform Club, on Saturday, the twenty-first of December, at a quarter before nine p.m.; or else the twenty thousand pounds, now deposited in my name at Baring\u0027s, will belong to you, in fact and in right, gentlemen. Here is a cheque for the amount.\u0027 \\n\\n A memorandum of the wager was at once drawn up and signed by the six parties, during which Phileas Fogg preserved a stoical composure. He certainly did not bet to win, and had only staked the twenty thousand pounds, half of his fortune, because he foresaw that he might have to expend the other half to carry out this difficult, not to say unattainable, project. As for his antagonists, they seemed much agitated; not so much by the value of their stake, as because they had some scruples about betting under conditions so difficult to their friend. \\n\\n The clock struck seven, and the party offered to suspend the game so that Mr Fogg might make his preparations for departure. \\n\\n `I am quite ready now,\u0027 was his tranquil response. \\n\\n `Diamonds are trumps: be so good as to play, gentlemen.\u0027 \\n\\n 福克先生直接走进餐厅，里面朝着花园的九个窗子都打开了。花园里的树木已被秋天抹上了一层金黄的色彩。在餐厅里，他坐在一向坐惯的老地方，桌上刀叉食具，都已摆好。这顿午餐包括有：一盘小吃，一盘加上等辣酱油的烹鱼块，一盘深红色的烤牛肉配着香大黄和青醋栗果，另外还有一块干酪。吃完之后，再喝上几杯俱乐部特备的好茶。把这些美食，一冲了事。\\n\\n 十二点四十七分，这位绅士从餐室起身走向大厅。那是一间富丽堂皇的屋子，装饰着许多绘画，每张画上都镶有装璜讲究的画框。在大客厅里，侍者递给福克一份还没有裁开的《泰晤士报》。于是他就用熟练的双手，按版裁开，这原是一件挺麻烦的事，但从他的动作可以说明他已经是驾轻就熟习以为常了。他看这份报纸，一直要看到三点四十五分，接着再看刚到的《标准报》，一直看到吃晚饭。用晚餐的情况和午餐一样，只是多加了一道上等英国蜜饯果品而已。\\n\\n 五点四十分，他又回到大厅，专心精读《每日晨报》。\\n\\n 半小时后，有些改良俱乐部的会员也都进到大客厅里，挨近生着炭火的壁炉。这几位是和福克一起玩纸牌的老伙伴，跟福克一样，全是“惠司脱”迷。其中安得露·斯图阿特是工程师，约翰·苏里万和撒木耳·法郎丹是银行家，多玛斯·弗拉纳刚是啤酒商，高杰·弱夫是英国国家银行董事会董事。这些人既有金饯，又有声望，在俱乐部的会员中，也都称得起是金融工商界拔尖儿的人物。\\n\\n “喂，弱夫先生，”多玛斯·弗拉纳刚问道，“这件盗窃案到底怎么样了？”\\n\\n “得啦，”安得露·斯图阿特插嘴说，“还不是归银行赔几个钱算了！”\\n\\n “我的看法跟您相反，”高杰·弱夫说，“我想我们会逮住这个贼的。警察厅已经在美洲欧洲所有重要的进出港口布置了许多十分机警能干的侦探。依我看，这位梁上君子要想逃脱侦探的手掌，那是很困难的。”\\n\\n “那末，是不是已经有了线索？”安得露·斯图阿特接着问。\\n\\n “我首先要说明，那人并不是个贼，”高杰·弱夫郑重其事地说。\\n\\n “怎么！？偷了五万五千镑钞票还不是个贼？”\\n\\n “不是贼，”高杰·弱夫说。\\n\\n “难道还是个企业家？”约翰·苏里万问道。\\n\\n “《每日晨报》肯定地说他是一位绅士。”\\n\\n 说这句话的人不是别人，正是福克。他从报纸里探出头来，向大家致意，大伙也都还礼。\\n\\n 他们谈到的事情正是联合王国各种报纸争辩得热火朝天的问题。这事发生在三天以前，那天是9月29日，一大叠钞票价值五万五千镑的巨款，竟从英国国家银行总出纳员的小柜台上被人偷走了。\\n\\n 银行副总裁高杰·弱夫先生向那些认为这件盗窃案发生得太容易因而感到惊奇的人们作了一番解释，他说：“那时，出纳员正在忙着记一笔三先令六便士的收款账，他的眼睛当然不可能处处都看到。”\\n\\n 现在，最好先在这儿把这银行的情况介绍一下，那就更容易把事情搞清楚了。这座刮刮叫的英国国家银行似乎非常信任顾客公众的人格。银行里既没有警卫员，又没有守门人，甚至连出纳柜上也没装铁丝网。金钱钞票随意放着，那就是说，任凭哪位顾客爱怎么动，就怎么动。谁也不会怀疑哪一位顾客是否诚实可靠。有位对英国习惯十分熟悉的观察家，甚至这样说：有一天，在英国国家银行的一个大厅里，他好奇地挨近前去，想把一块七八斤重的金块看个究竟。当时，这块金子就放在出纳员的小柜台上，他拿起这块金子，看了以后就传给了别人。这样一个传一个，一直传到走廊黑暗的尽头。过了半小时，这块金子才回到原来的地方。在这半个钟头里，出纳员连头也没抬一抬。\\n\\n 但是，9月29号这一天，情况就完全两样了。一捆钞票竟然一去不返。当挂在汇兑处上面的挂钟敲响五点的时候，下班的时间到了，英国国家银行只好把这五万五千英镑记在损益账上。\\n\\n 当然完全可以肯定这是一件盗窃案了。一批最干练的警员和密探派到了各个主要的港口如：利物浦、格拉斯哥、哈佛、苏伊士、布林迪西、纽约等地。谁能破案谁就将获得两千英镑（合五万金法郎）的奖金，而且还外加追回赃款的百分之五作为报酬。这些侦探一面等待已经开始的调查工作所提供的材料，一面在各港口仔细地侦察所有来来往往的旅客。\\n\\n 可是，人们有理由这样设想——《每日晨报》恰好也是这么说：“作此案者，绝非英国现有任何盗贼帮会的成员。9月29日，曾有一位衣冠楚楚、气派文雅的绅士，出现于付款大厅即盗窃案发生之现场，徘徊良久。根据调查结果，已相当准确地掌握此人之外貌特征，并已及时通知英国及欧洲大陆所有警探。”——这样一来，一些有见识的人（高杰·弱夫是其中之一），就认为完全有理由相信这个贼谁是溜不掉了。\\n\\n 正如人们所料，这件事已经变成了伦敦和整个英国当前主要的话题。人们到处争辩着这件盗窃案，有的慷慨激昂地认定首都警察厅能破案，有的热情洋溢地断言不能破案。所以人们听到改良俱乐部的会员们，其中甚至还有一位国家银行副总裁也在谈论这个问题，当然不会感到奇怪。\\n\\n 高贵的高杰·弱夫先生确信能够侦察出结果来，他估计这笔奖金会大大鼓舞侦探人员的热情和启发他们的智慧。但他的会友安得露·斯图阿特却没有这种信心，于是，这些绅士们就继续争辩下去。他们围坐在牌桌的四周，斯图阿特坐在弗拉纳刚的对面；法郎丹坐在斐利亚·福克的对面。在打着牌的时候，他们不说话，但等到一局结束算分的时候，中断了的争论又重新热烈地展开了。\\n\\n “我认为这个贼能够逃掉。他准是个挺机灵的人！”安得露·斯图阿特说。\\n\\n “算了吧！”弱夫回答说，“他能逃到哪儿，什么地方都逃不了！”\\n\\n “哪儿的话！”\\n\\n “你说他往哪儿逃？”\\n\\n “这我不知道，”安得露·斯图阿特回答说，“可是，无论如何，世界上能去的地方多着哪！”\\n\\n “那是过去的情况了……”福克小声地说，接着他拿起洗好的牌，向多玛斯·弗拉纳刚说，“该您倒牌，先生。”\\n\\n 打牌的时候，争论暂时中止。可是不久，安得露·斯图阿特又扯起来了，他说：\\n\\n “什么，那是过去的情况！？难道现在地球缩小了？”\\n\\n “的确如此，”高杰·弱夫说，“我的看法跟福克先生一样，地球是缩小了。如今环游地球一周，比起一百年前，速度要加快十倍！这就使我们所谈的这件案子破案的速度加快了。”\\n\\n “那个贼逃跑起来，岂不照样也更方便了吗！”\\n\\n “斯图阿特先生，该您出牌！”福克说。\\n\\n 可是固执的斯图阿特仍旧不服输。一局牌打完，他又扯起来了：\\n\\n “弱夫先生，您应该承认，地球缩小了，这是一种开玩笑的说法！您所以这样说，是因为如今花三个月的时间就能绕地球一周……”\\n\\n “只要八十天，”福克接着说。\\n\\n “事实上也是这样，先生们，”约翰·苏里万插嘴说。“自从大印度半岛铁路的柔佐到阿拉哈巴德段通车以来，八十天足够了。您瞧，《每日晨报》上还登了一张时间表：\\n\\n 自伦敦至苏伊士途经悉尼山与布林迪西（火车、船）……7天\\n\\n 自苏伊士至孟买（船）………………………………………13天\\n\\n 自孟买至加尔各答（火车）…………………………………3天\\n\\n 自加尔各答至中国香港（船）………………………………13天\\n\\n 自香港至日本横滨（船）……………………………………6天\\n\\n 自横滨至旧金山（船）………………………………………22天\\n\\n 自旧金山至纽约（火车）……………………………………7天\\n\\n 自纽约至伦敦（船、火车）…………………………………9天\\n\\n 总计……………………………………………………………80天\\n\\n “不错，是八十天！”安得露·斯图阿特喊着说。他一不留神出错了一张王牌。接着他又继续说道：“不过，坏天气、顶头风、海船出事、火车出轨等等事故都不计算在内。”\\n\\n “这些全都算进去了，”福克先生一边说着，一边继续打着牌，这回争论，就顾不得遵守打“惠司脱”必须保持安静的规矩了。\\n\\n “可是印度的土人，或者美洲的印第安人会把铁路钢轨撬掉呢，”安得露·斯图阿特嚷着说。“他们会截住火车，抢劫行李，还要剥下旅客的头皮！这您也算上了？”\\n\\n “不管发生什么事故，反正八十天都算上了，”福克一面回答，一面把牌放到桌上，接着说：“两张王牌。”\\n\\n 现在轮到安得露·斯图阿特洗牌，他一面收牌，一面说：“福克先生，您在理论上是对的，可是实际做起来……”\\n\\n “实际做起来也是八十天，斯图阿特先生。、\\n\\n “我倒想看看您怎么做。”\\n\\n “那全凭您的决定，咱们俩可以一道去。”\\n\\n “上帝保佑，我才不去呢，那绝不可能！”斯图阿特大声说。“我敢拿四千英镑打赌，八十天内环绕地球一周，是绝对不可能的。”\\n\\n “正相反，完全可能。”福克回答说。\\n\\n “好吧！那您就试试吧！”\\n\\n “要我八十天绕地球一周？”\\n\\n “是啊。”\\n\\n “好，我同意。”\\n\\n “您什么时候动身？”\\n\\n “马上动身。不过——我得先跟您说清楚，这笔旅费将来得您拿出来。”\\n\\n “这简直是发神经了！”安得露·斯图阿特嚷着说，因为福克先生一再坚持争论，他开始沉不住气了。他接着说：“算了，别谈这些了，咱们还是打牌吧。”\\n\\n “您重新洗牌吧，牌发错了，”福克回答说。\\n\\n 安得露·斯图阿特用他那激动得有些发热的手把牌收起，突然他又把牌往桌上一摊，说：\\n\\n “好吧！咱们算说定了，福克先生，我跟您赌四千英镑！……”\\n\\n “亲爱的斯图阿特，冷静点吧！”法郎丹劝解说，“大家不过是说着玩的。”\\n\\n “我说赌就赌，”安得露·斯图阿特回答说，“决不是说着玩的。”\\n\\n “好！”福克说着转过身来，对其他几位牌友说，“我有两万英镑在巴林氏兄弟那里，我情愿拿来打赌！……”\\n\\n “两万镑！”约翰·苏里万叫起来，说，“要是一步没预料到，回来迟了，两万镑就没有了！”\\n\\n “根本没有预料不到的事，”福克简单地回答说。\\n\\n “可是，福克先生，八十天的时间是顶起码的呀！”\\n\\n “顶少的时间，只要好好利用，就能够解决问题。”\\n\\n “要想不超过八十天，必须极准确地一下火车马上就上船，一下船马上又上火车才行啊！”\\n\\n “我会准确地掌握。”\\n\\n “这简直是开玩笑！”\\n\\n “一个体面的英国人，打赌也象干正经事一样，是绝不开玩笑的，”福克回答说。“我准在八十天内，甚至不用八十天就绕地球一周，也就是说，花一千九百二十小时或者说花十一万五千二百分钟绕地球一周，谁愿意来打赌，我就跟他赌两万英镑。你们来吗？”\\n\\n 斯图阿特、法郎丹、苏里万、弗拉纳刚和弱夫这几位先生商量了一会儿之后，说道：\\n\\n “我们跟你赌。”\\n\\n “好！”福克先生说，“到杜伏勒去的火车是八点四十五分开车，我就乘这趟车走。”\\n\\n “今天晚上就走吗？”斯图阿特问。\\n\\n “今天晚上就走，”福克先生一边回答，一边看了看袖珍日历，接着说：“今天是10月2号星期三，那么，我应该在12月21号星期六晚上八点四十五分回到伦敦，仍然回到俱乐部这个大厅里。要是我不如期回来，那么我存在巴林氏那里的两万英镑，不论在法律上，或是在事实上都归你们了。先生们，这儿是一张两万英镑的支票。”\\n\\n 一张打赌的字据当场写好，六位当事人立即在上面签了字。福克的态度很冷静，他打赌当然不是为了赢钱，他所以拿出这一笔等于他一半财产的两万英镑打赌，那是因为他已经预料到：一定能拿对方的钱来完成这个计划。而这个计划本身即便不说是不可能，也应该说是很困难。至于他的那些对手，看起来现在是有些紧张，这并不是因为赌注太大，而是因为这种紧张的气氛使他们产生一种踌躇不安的感觉。\\n\\n 这时，钟已敲了七点。他们向福克先生建议停止打牌，好让他在动身前准备准备。\\n\\n “我已经准备好了，”这位心平气和的绅士一面发牌，一面回答：“我翻的是一张红方块，该您出牌了，斯图阿特先生。”\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/64/3718.html","bookId":582,"book":{"id":582,"title":"Around the World In 80 Days八十天环游地球","description":"简介： Around the World in Eighty Days (French: Le tour du monde en quatre-vingts jours) is a classic adventure novel by the French writer Jules Verne, first published in 1873. In the story, Phileas Fogg of London and his newly empl...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1285727176bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/64","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
