{"id":23883,"no":33,"title":"Chapter 33","content":"An hour after, the `Henrietta\u0027 passed the lighthouse which marks the entrance of the Hudson, turned the point of Sandy Hook, and put to sea. During the day she skirted Long Island, passed Fire Island, and directed her course rapidly eastward. \\n\\n At noon the next day, a man mounted the bridge to ascertain the vessel\u0027s position. It might be thought that this was Captain Speedy. Not the least in the world. It was Phileas Fogg, Esquire. As for Captain Speedy, he was shut up in his cabin under lock and key, and was uttering loud cries, which signified an anger at once pardonable and excessive. \\n\\n What had happened was very simple. Phileas Fogg wished to go to Liverpool, but the captain would not carry him there. Then Phileas Fogg had taken passage for Bordeaux, and, during the thirty hours he had been on board, had so shrewdly managed with his bank-notes that the sailors and stokers, who were only an occasional crew, and were not on the best terms with the captain, went over to him in a body. This was why Phileas Fogg was in command instead of Captain Speedy; why the captain was a prisoner in his cabin; and why, in shortain. In winter, they were at the mercy of the bad season. Passepartout said nothing; but he cherished hope in secret, and comforted himself with the reflection that, if the wind failed them, they might still count on the steam. \\n\\n On this day the engineer came on deck, went up to Mr Fogg, and began to speak earnestly with him. \\n\\n Without knowing why - it was presentiment, perhaps - Passepartout became vaguely uneasy. He would have given one of his ears to hear with the other what the engineer was saying. He finally managed to catch a few words, and was sure he heard his master say, `You are certain of what you tell me?\u0027 \\n\\n `Certain, sir,\u0027 replied the engineer. `You must remember that, since we started, we have kept up hot fires in all our furnaces, and though we had coal enough to go on short steam from New York to Bordeaux, we haven\u0027t enough to go with all steam from New York to Liverpool.\u0027 \\n\\n `I will consider,\u0027 repli?t?Tànt along smoothly enough. The sea was not very unpropitious, the wind seemed stationary in the north-east, the sails were hoisted, and the `Henrietta\u0027 ploughed across the waves like a real transatlantic steamer. \\n\\n Passepartout was delighted. His master\u0027s last exploit, the consequences of which he ignored, enchanted him. Never had the crew seen so jolly and dexterous a fellow. He formed warm friendships with the sailors, and amazed them with his acrobatic feats. He thought they managed the vessel like gentlemen, and that the stokers fired up like heroes. His loquacious good-humour infected every one. He had forgotten the past, its vexations and delays. He only thought of the end, so nearly accomplished; and sometimes he boiled over with impatience, as if heated by the furnaces of the `Henrietta\u0027. Often, also, the worthy fellow revolved around Fix, looking at him with a keen, distrustful eye; but he did not speak to him, for their old intimacy no longer existed. \\n\\n Fix, it must be confessed, understood nothing of what was going on. The conquest of the `Henrietta\u0027, the bribery of the crew, Fogg managing the boat like a skilled seaman, amazed and confused him. He did not know what to think. For, after all, a man who began by stealing fifty-five thousand pounds might end by stealing a vessel; and Fix was not unnaturally inclined to conclude that the `Henrietta\u0027, under Fogg\u0027s command, was not going to Liverpool at all, but to some part of the world where the robber, turned into a pirate, would quietly put himself in safety. The conjecture was at least a plausible one, and the detective began to seriously regret that he had embarked in the affair. \\n\\n As for Captain Speedy, he continued to howl and growl in his cabin; and Passepartout, whose duty it was to carry him his meals, courageous as he was, took the greatest precautions. Mr Fogg did not seem even to know that there was a captain on board. \\n\\n On the 13th they passed the edge of the Banks of Newfoundland, a dangerous locality; during the winter, especially, there are frequent fogs and heavy gales of wind. Ever since the evening before the barometer, suddenly falling, had indicated an approaching change in the atmosphere; and during the night the temperature varied, the cold became sharper, and the wind veered to the south-east. \\n\\n This was a misfortune. Mr Fogg, in order not to deviate from his course, furled his sails and increased the force of the steam; but the vessel\u0027s speed slackened, owing to the state of the sea, the long waves of which broke against the stern. She pitched violently, and this retarded her progress. The breeze little by little swelled into a tempest, and it was to be feared that the `Henrietta\u0027 might not be able to maintain herself upright on the waves. \\n\\n Passepartout\u0027s visage darkened with the skies, and for two days the poor fellow experienced constant fright. But Phileas Fogg was a bold mariner, and knew how to maintain headway against the sea; and he kept on his course, without even decreasing his steam. The `Henrietta\u0027, when she could not rise upon the waves, crossed them, swamping her deck, but passing safely. Sometimes the screw rose out of the water, beating its protruding end, when a mountain of water raised the stern above the waves; but the craft always kept straight ahead. \\n\\n The wind, however, did not grow as boisterous as might have been feared; it was not one of those tempests which burst, and rush on with a speed of ninety miles an hour. It continued fresh, but, unhappily, it remained obstinately in the south-east, rendering the sails useless. \\n\\n The 16th of December was the seventy-fifth day since Phileas Fogg\u0027s departure from London, and the `Henrietta\u0027 had not yet been seriously delayed. Half of the voyage was almost accomplished, and the worst localities had been passed. In summer, success would have been well-nigh certain. In winter, they were at the mercy of the bad season. Passepartout said nothing; but he cherished hope in secret, and comforted himself with the reflection that, if the wind failed them, they might still count on the steam. \\n\\n On this day the engineer came on deck, went up to Mr Fogg, and began to speak earnestly with him. \\n\\n Without knowing why - it was presentiment, perhaps - Passepartout became vaguely uneasy. He would have given one of his ears to hear with the other what the engineer was saying. He finally managed to catch a few words, and was sure he heard his master say, `You are certain of what you tell me?\u0027 \\n\\n `Certain, sir,\u0027 replied the engineer. `You must remember that, since we started, we have kept up hot fires in all our furnaces, and though we had coal enough to go on short steam from New York to Bordeaux, we haven\u0027t enough to go with all steam from New York to Liverpool.\u0027 \\n\\n `I will consider,\u0027 replied Mr Fogg. \\n\\n Passepartout understood it all; he was seized with mortal anxiety. The coal was giving out! `Ah, if my master can get over that,\u0027 muttered he, `he\u0027ll be a famous man!\u0027 He could not help imparting to Fix what he had overheard. \\n\\n Then you believe that we really are going to Liverpool?\u0027 \\n\\n `Of course.\u0027 \\n\\n `Ass!\u0027 replied the detective, shrugging his shoulders and turning on his heel. \\n\\n Passepartout was on the point of vigorously resenting the epithet, the reason of which he could not for the life of him comprehend; but he reflected that the unfortunate Fix was probably very much disappointed and humiliated in his self-esteem, after having so awkwardly followed a false scent around the world, and refrained. \\n\\n And now what course would Phileas Fogg adopt? It was difficult to imagine. Nevertheless he seemed to have decided upon one, for that evening he sent for the engineer, and said to him, `Feed all the fires until the coal is exhausted.\u0027 \\n\\n A few moments after, the funnel of the `Henrietta\u0027 vomited forth torrents of smoke. The vessel continued to proceed with all steam on; but on the 18th, the engineer, as he had predicted, announced that the coal would give out in the course of the day. \\n\\n `Do not let the fires go down,\u0027 replied Mr Fogg. `Keep them up to the last. Let the valves be filled.\u0027 \\n\\n Towards noon Phileas Fogg, having ascertained their position, called Passepartout, and ordered him to go for Captain Speedy. It was as if the honest fellow had been commanded to unchain a tiger. He went to the poop, saying to himself, `He will be like a madman!\u0027 \\n\\n In a few moments, with cries and oaths, a bomb appeared on the poop-deck. The bomb was Captain Speedy. It was clear that he was on the point of bursting. `Where are we?\u0027 were the first words his anger permitted him to utter. Had the poor man been apoplectic, he could never have recovered from his paroxysm of wrath. \\n\\n `Where are we?\u0027 he repeated, with purple face. `Seven hundred and seven miles from Liverpool,\u0027 replied Mr Fogg, with imperturbable calmness. \\n\\n `Pirate!\u0027 cried Captain Speedy. `I have sent for you, sir--\u0027 \\n\\n `Pickaroon!\u0027 \\n\\n ` - Sir,\u0027 continued Mr Fogg, `to ask you to sell me your vessel.\u0027 \\n\\n `No! By all the devils, no!\u0027 \\n\\n `But I shall be obliged to burn her.\u0027 \\n\\n `Burn the \"Henrietta\"!\u0027 \\n\\n `Yes; at least the upper part of her. The coal has given out.\u0027 \\n\\n `Burn my vessel!\u0027 cried Captain Speedy, who could scarcely pronounce the words. `A vessel worth fifty thousand dollars!\u0027 \\n\\n `Here are sixty thousand,\u0027 replied Phileas Fogg, handing the captain a roll of bank bills. This had a prodigious effect on Andrew Speedy. An American can scarcely remain unmoved at the sight of sixty thousand dollars. The captain forgot in an instant his anger, his imprisonment, and all his grudges against his passenger. The `Henrietta\u0027 was twenty years old; it was a great bargain. The bomb would not go off after all. Mr Fogg had taken away the match. \\n\\n `And I shall still have the iron hull,\u0027 said the captain in a softer tone. \\n\\n `The iron hull and the engine. Is it agreed?\u0027 \\n\\n `Agreed.\u0027 \\n\\n And Andrew Speedy, seizing the bank-notes, counted them and consigned them to his pocket. \\n\\n During this colloquy, Passepartout was as white as a sheet, and Fix seemed on the point of having an apoplectic fit. Nearly twenty thousand pounds had been expended, and Fogg left the hull and engine to the captain, that is, near the whole value of the craft! It was true, however, that fifty-five thousand pounds had been stolen from the bank. \\n\\n When Andrew Speedy had pocketed the money, Mr Fogg said to him, `Don\u0027t let this astonish you, sir. You must know that I shall lose twenty thousand pounds, unless I arrive in London by a quarter before nine on the evening of the 21st of December. I missed the steamer at New York, and as you refused to take me to Liverpool--\u0027 \\n\\n `And I did well!\u0027 cried Andrew Speedy; `for I have gained at least forty thousand dollars by it!\u0027 He added, more sedately, `Do you know one thing, Captain--\u0027 \\n\\n `Fogg.\u0027 \\n\\n `Captain Fogg, you\u0027ve got something of the Yankee about you.\u0027 \\n\\n And, having paid his passenger what he considered a high compliment, he was going away, when Mr Fogg said, `The vessel now belongs to me?\u0027 \\n\\n `Certainly, from the keel to the truck of the masts, all the wood, that is.\u0027 \\n\\n `Very well. Have the interior seats, bunks, and frames pulled down, and burn them.\u0027 \\n\\n It was necessary to have dry wood to keep the steam up to the adequate pressure, and on that day the poop, cabins, bunks, and the spare deck were sacrificed. On the next day, the 19th of December, the masts, rafts and spars were burned; the crew worked lustily, keeping up the fires. Passepartout hewed, cut and sawed away with all his might. There was a perfect rage for demolition. \\n\\n The railings, fittings, the greater part of the deck, and top sides disappeared on the 20th, and the `Henrietta\u0027 was now only a flat hulk. But on this day they sighted the Irish coast and Fastnet Light. By ten in the evening they were passing Queenstown. Phileas Fogg had only twenty-four hours more in which to get to London; that length of time was necessary to reach Liverpool, with all steam on. And the steam was about to give out altogether! \\n\\n `Sir,\u0027 said Captain Speedy, who was now deeply interested in Mr Fogg\u0027s project, `I really commiserate you. Everything is against you. We are only opposite Queenstown.\u0027 \\n\\n `Ah,\u0027 said Mr Fogg, `is that place where we see the lights Queenstown?\u0027 \\n\\n `Yes.\u0027 \\n\\n `Can we enter the harbour?\u0027 \\n\\n `Not under three hours. Only at high tide.\u0027 \\n\\n `Stay,\u0027 replied Mr Fogg calmly, without betraying in his features that by a supreme inspiration he was about to attempt once more to conquer ill-fortune. \\n\\n Queenstown is the Irish port at which the transatlantic steamers stop to put off the mails. These mails are carried to Dublin by express trains always held in readiness to start; from Dublin they are sent on to Liverpool by the most rapid boats, and thus gain twelve hours on the Atlantic steamers. \\n\\n Phileas Fogg counted on gaining twelve hours in the same way. Instead of arriving at Liverpool the next evening by the `Henrietta\u0027, he would be there by noon, and would therefore have time to reach London before a quarter before nine in the evening. \\n\\n The `Henrietta\u0027 entered Queenstown Harbour at one o\u0027clock in the morning, it then being high tide; and Phileas Fogg, after being grasped heartily by the hand by Captain Speedy, left that gentleman on the levelled hulk of his craft, which was still worth half what he had sold it for. \\n\\n The party went on shore at once. Fix was greatly tempted to arrest Mr Fogg on the spot; but he did not. Why? What struggle was going on within him? Had he changed his mind about `his man\u0027? Did he understand that he had made a grave mistake? He did not, however, abandon Mr Fogg. They all got upon the train, which was just ready to start, at half-past one; at dawn of day they were in Dublin; and they lost no time in embarking on a steamer which, disdaining to rise upon the waves, invariably cut through them. \\n\\n Phileas Fogg at last disembarked on the Liverpool quay, at twenty minutes before twelve, December 21st. He was only six hours distant from London. \\n\\n But at this moment Fix came up, put his hand upon Mr Fogg\u0027s shoulder, and, showing his warrant, said, `You are really Phileas Fogg?\u0027 \\n\\n `I am.\u0027 \\n\\n `I arrest you in the Queen\u0027s name!\u0027 \\n\\n 第二天是12月13号，中午，只见一个人走上舰桥测定方位。人们猜想那准是船长斯皮蒂。可是一点也没有猜对。那是斐利亚·福克。\\n\\n 至于船长斯皮蒂呢，他已经被十分稳妥地关在船长室里了，门外还上了锁。他在里头大喊大叫，几乎都气得发疯了。\\n\\n 事情的经过很简单。斐利亚·福克要到利物浦，船长就是不肯去，于是斐利亚·福克就答应去波尔多。上船之后，福克在这三十个小时当中，很成功地发动了他的英镑攻势。船上的船员从水手到司炉，都难免有点营私舞弊，何况他们本来跟船长就不大对劲，现在自然都站到福克一边了。这就说明了为什么斐利亚·福克会站在船长斯皮蒂的位子上发号施令，为什么斯皮蒂会被关在船长室里，以及为什么亨利埃塔号会开往利物浦。不过从福克先生在船上的操作来看，显然可以看出他过去一定当过海员。\\n\\n 这事的结局如何，留待后面再说。这时，艾娥达夫人虽然一句话没说，但心里少不了要替福克先生担忧；费克斯呢，他早就给搞得莫名其妙了，至于路路通，他倒觉得这件事办得太漂亮了。\\n\\n 船长斯皮蒂说过，亨利埃塔号的时速是十一至十二海里，实际上也确实保持了这样的平均速度。\\n\\n 如果——天晓得！现在还有这么多的“如果”！——如果气候不太坏，如果不起东风，如果船不出毛病，机器不发生障碍，亨利埃塔号从12月12号到21号这九天以内准能走完从纽约到利物浦的这三千海里的路程。不过，说老实话，一旦到了英国，要是把福克强夺亨利埃塔号这案件和英国银行失窃的案件加到一块儿，那准会叫这位绅士狼狈不堪。\\n\\n 最初几天，亨利埃塔号航行得非常顺利。海上风浪不大，一直是刮着西南风，亨利埃塔号张起群帆，有了前后樯两张大帆推动，它走得简直跟一艘横渡大西洋的客船一模一样。 路路通高兴死了。他主人的这条妙计简直使他太高兴了。至于后果如何，他根本连想都没想。船员们从来也没见过一个象路路通这样兴高采烈、活蹦乱跳的小伙子。他对水手们无限殷勤，他那翻跟斗的绝技更使他们吃惊。他一个劲儿跟他们说好话，请他们喝好酒。为了不辜负路路通的好意，水手们干起活来都象绅士一样非常认真。司炉们烧起火来象英雄一样不顾疲劳。路路通的这种乐观情绪使大家都受到感染。他这时已经把过去那些烦恼和危险都忘了。他一心只想到那个就要到达的目的地。有时他也会急不可耐，仿佛亨利埃塔号的锅炉就在他心里燃烧似的。这个好小伙子有时候也常在费克斯身旁走动，他看着费克斯，好象他有一肚子话想跟对方谈！但是他没有开腔，因为在这两个老朋友之间现在已经毫无交情可言了。\\n\\n 而费克斯呢，说真的他现在简直是给弄得莫名其妙了！亨利埃塔号被强夺了，船上的船员被收买了，这个福克在船上干起活来完全象是个老水手。这一连串的怪事弄得他如堕五里雾中。他真不知道该怎么想才好！但是，不论如何，这位绅士既然过去能盗窃五万五千英镑，今天他当然也能抢夺一条船。因此费克斯很自然地会认为福克掌握了这条亨利埃塔号也绝不会去利物浦，而只会去一个什么地方，到了那里，这个贼摇身一变就成了海盗，永远逍遥法外！应当承认，他这样猜测确实是很合情理的，侦探现在感到万分悔恨，悔不该上了福克的贼船。至于船长斯皮蒂，他还在他的船长室里发他的脾气；路路通负责照料船长的饮食，尽管这小伙子性格倔强，但是他对于这件差事还是做得小心翼翼的。再看看福克先生吧，他好象想也没想过在这条船上还有一个船长。\\n\\n 12月13号，轮船从新地岛附近经过，这一段很难航行。特别是冬季，这里经常是浓雾弥漫，风势凶猛。从昨天夜里开始，晴雨表上的水银柱就迅速下降，预示着气候即将发生变化。到了13号夜晚，天气果然变得更冷了，西北风也转为东南风了。\\n\\n 这真是“急行船偏遇打头风”。福克先生为了使船不离开原来的航线，只好卷起船帆，加大马力前进。由于海上气候的变化，无论如何，航行的速度总是减低了。滚滚的巨浪不停地冲击着船头，船身随着风浪前后颠簸，大大影响了前进的速度。海风越刮越凶，就要变成一阵飓风，眼看亨利埃塔号就会被海浪打得站不住了。可是，如果必须开船逃避飓风，那一切可能发生的不幸都会无法预测。\\n\\n 路路通的脸色随着天气的阴暗也变得非常忧郁了。两天以来，这个诚实的小伙子一直是在提心吊胆。但是，斐利亚·福克真不愧是一位勇敢的海员，他善于跟大海搏斗，他一直指挥着船前进，甚至连速度也不肯降低。每当大浪卷来，亨利埃塔号无力冲上浪峰时，就从巨浪下穿行，整个甲板都受到了海水的冲洗，但是船却照样过去了。有时，巨浪象大山一样将船尾高高抬起，这时，螺旋推进器就露出了水面，立刻发生剧烈的空转，但是船却照样一直不停地前进。\\n\\n 其实，大风并没有象人们预料的那样凶猛。这次刮的并不是那种时速高达九十英里的飓风。它只是一种强风。但是很糟糕的是风向不变，一直是从东南往西北刮，船帆一点也使不上。从眼前和今后的情况看来，都说明船上的机器极需要船帆的帮助！\\n\\n 12月16号，这是福克先生离开伦敦的第七十五天。总的说来亨利埃塔号还没有发生令人忧虑的耽搁。一半的航程已经差不多走完了，那些最难航行的地方也已经过去了。现在如果是夏天，那就可以说成功在望了，但现在是冬天，那还得听凭这个坏季节摆布。路路通一句话不说，但他心里却觉得很有希望。他认为即使没有顺风，还可以依靠机器。可是，就在这一天，船上的机务员到甲板上来找福克先生，他很激动地跟福克先生谈了半天。路路通不知道为什么，很可能是由于一种预感，使他觉得有点莫名其妙的担心。他真恨不得把两只耳朵的听力都集中到一个耳朵上，好听听他们谈些什么。他到底还是听见了几句，其中有这么一句，那是他主人说的：\\n\\n “你刚才说的这些，你都拿得准吗？”\\n\\n “当然拿得准了，先生，”机务员回答说，“您别忘了，我们从开船到现在所有的锅炉都是烧满火。如果说我们的煤烧小火足够从纽约开到波尔多，那么我们就没有足够的煤烧大火从纽约开到利物浦！”\\n\\n “好吧，我考虑一下。”福克先生回答说。\\n\\n 现在路路通明白了，他感到万分忧虑，因为煤要烧光了！\\n\\n “嘿！要是我的主人能解决了这个问题，”他心里说，“那他可就真是个了不起的人！”\\n\\n 路路通碰见了费克斯，他忍不住把这情况告诉他了。\\n\\n “那末，”费克斯咬着牙回答说，“您真以为我们要上利物浦去吗？”\\n\\n “当然了！”\\n\\n “傻瓜！”侦探说罢，耸耸肩膀，走开了。\\n\\n 路路通当时就要认真地质问费克斯“傻瓜”是什么意思，他确实不知道费克斯这句话是指什么说的，但是，他心里想，这个倒霉蛋费克斯现在一定是很懊丧，他愚笨地盯着一个自己假想的小愉在地球上兜了一圈，临了还得自己认错，这一定使他的自尊心受到了很大的打击。\\n\\n 现在斐利亚·福克打算怎么办呢？这真是很难猜测的。不过，看样子这位冷静的绅士是想出一个办法了，因为，就在这天晚上，他把司机找来，对他说：\\n\\n “烧大火，开足马力前进，等煤烧完了再说。”\\n\\n 过了一会，亨利埃塔号的烟筒又冒出了滚滚的黑烟。\\n\\n 轮船又继续以最高的速度前进了。但是，正如机务员说过的那样，两天之后，12月18号，他通知福克先生说，煤已经不够今天烧的了。\\n\\n “别压小炉火，”福克先生回答说，“相反地，现在要继续烧大火，煤烧光以前不能让机器停下来。”\\n\\n 这一天，快到中午的时候，斐利亚·福克测量了水深和计算了船的方位之后，就把路路通叫来，叫他去把船长斯皮蒂请来。这个小伙子现在就好象是奉命去打开一个老虎笼子似的。他走进了后舱，心里说：\\n\\n “不用说，这家伙准会大发雷霆！”\\n\\n 果然不错，过了几分钟，只见一个人，连叫带骂，活象一颗炸弹似的跳到后舱甲板上来了。这颗炸弹就是船长斯皮蒂。显然它是马上就要爆炸了。\\n\\n “我们到了哪儿了？”他气急败坏地嚷着说。这是他的第一句话。说真话，这个老实人要是万一现在带着这股气劲中风晕过去了，那他准不会再活过来了。\\n\\n “我们到了哪儿了？”他重复着问，脸都气紫了。\\n\\n “距离利物浦七百七十海里（合三百法里）。”福克先生非常沉着地回答说。\\n\\n “海盗！”安鸠·斯皮蒂喊着说。\\n\\n “先生，我把您请来……”\\n\\n “你是海盗！”\\n\\n “我把您请来，”斐利亚·福克说，“是要请您答应把船卖给我。”\\n\\n “不卖，见你的鬼去吧，我不卖！”\\n\\n “因为我要烧掉它。”\\n\\n “什么？要烧我的船！？”\\n\\n “是的，至少把船面上的装备烧掉，因为现在没有煤了。”\\n\\n “啊！烧掉我的船？”船长斯皮蒂叫着说，他简直气得话也说不上来了。“我这条船足足要值五万美元（合二十五万法郎）！”\\n\\n “喏，这是六万美元（合三十万法郎）！”斐利亚·福克回答说，同时递给船长一叠钞票。 福克先生这一手在安鸩·斯皮蒂身上产生了一种奇妙无比的效果。没有一个美国人看见这六万美元会毫不动心。转眼之间，船长已经忘掉了他的愤怒，忘掉了那好几天的禁闭，也忘掉了对福克先生的怨恨。他的船已经用了二十年了，这样的买卖简直太好了！……这个炸弹是再也不会爆炸了，因为福克先生把雷管给拔了。\\n\\n “那您可把铁船壳给我留下来啊。”船长用非常温和的语气说。\\n\\n “铁船壳和机器都留给您，先生。咱们算讲好了？”\\n\\n “讲好了。”\\n\\n 安鸠·斯皮蒂抓起那一叠钞票数了一下，装进了口袋。\\n\\n 路路通看了这个场面脸都给吓白了。费克斯只差一点没晕过去。福克到现在差不多已花了两万英镑。可是这个福克他还把铁船壳和机器白送给船长，那就是说差不多白送了他一条船的全部价钱！说实话，他是不在乎的，因为他从银行偷来的钱总数达五万五千英镑！ 等安鸠·斯皮蒂把钞票装进衣袋之后，福克先生说：\\n\\n “先生，您别为这事感到奇怪，您要知道我如果在12月21号晚上八点四十五分不能回到伦敦，那我就会损失两万英镑。因为我在纽约没赶上船，而您又不肯送我到利物浦……” “我这笔生意也作得挺满意，”安鸠·斯皮蒂大声说，“这五万块美钞，我至少能赚四万。”\\n\\n 接着他又加重语气地说：\\n\\n “告诉您啊，我现在觉得……哦，我忘了，您贵姓，船长？”\\n\\n “福克。”\\n\\n “对了，福克船长，我觉得您真有点‘洋乞’的作风。”\\n\\n 斯皮蒂就这样对福克说了几句自以为是恭维的话之后，就走开了。但是斐利亚·福克这时又问他一句：\\n\\n “现在这条船就算归我了？”\\n\\n “当然了，当然了，一言为定，从上到下，所有‘木柴’，都归您！”\\n\\n “好吧，请您叫人先把船舱里所有的家具门窗劈碎，烧锅炉。”\\n\\n 于是船员们就根据机器马力的需要烧起这些干柴来了。就在当天，尾楼、工作室、客舱、船员宿舍、下甲板统统给烧光了。\\n\\n 第二天是12月19号，又烧完了桅杆、桅架和所有备用的木料。帆架也都放倒了，被斧头劈碎。船员们干起活来一个个都积极得无以复加。路路通用刀劈，使斧砍，拿锯拉，一个人干了十个人的活儿。这简直是一场疯狂的破坏。\\n\\n 第三天，12月20号，舷木、档板，以及其他在吃水部位以上木头装备和一大部分甲板，统统烧光了。亨利埃塔号现在成了光秃秃的趸船了。就在这一天，爱尔兰海岸和法斯乃特的灯塔已经遥遥在望了。但是一直到晚上十点钟，亨利埃塔号才经过昆斯敦。现在距离斐利亚·福克预定到达伦敦的时间，只有二十四小时了。目前正是需要亨利埃塔号以最快的速度赶到利物浦的时候。但是，锅炉里蒸气不足，无法满足这位大胆绅士的愿望。\\n\\n “先生，”船长斯皮蒂终于也为福克操起心来了，这时他对福克先生说：“我真替您着急啊，一切情况都对您不利！我们现在才到昆斯敦外海。”\\n\\n “哦！”福克先生说，“前面的灯光就是昆斯敦吗？”\\n\\n “是啊。”\\n\\n “我们能进港吗？”\\n\\n “至少得等三个钟头，只有满潮的时候才能开进去。”\\n\\n “那就等吧！”斐利亚·福克安静地回答说。这时有一种非常的灵感促使他去再一次战胜当前的困难！但是他脸上没有露出任何不平常的表情。\\n\\n 昆斯敦是爱尔兰海岸的一个港口。从美国越过大西洋到欧洲来的船，经过此地时就卸下邮件，这些邮件从此地随时都可以搭快车运往都柏林，再从都柏林装快船运到利物浦，这样就比海运公司最快的船还要快十二小时。从美洲来的邮件就是这样节省了十二小时。斐利亚·福克今天也想照样干一下。本来坐亨利埃塔号要明天晚上才能到利物浦，现在他明天中午就能赶到，因此就来得及在明天晚上八点四十五分以前到达伦敦。\\n\\n 半夜一点钟亨利埃塔号乘着满潮开进了昆斯敦的港口。船长斯皮蒂热情地跟斐利亚·福克握手告别。福克先生让船长留在他那条光秃秃的铁船壳上。实际上这条秃船依旧足值三万美元。\\n\\n 四位旅客立即离船登陆了。这时费克斯真很想逮捕福克，可是他没有动手！为什么呢？他脑子里在进行着什么样的思想斗争呢？难道他现在跟福克先生站在一边了吗？他现在知道是自己弄错了吗？不管怎样，费克斯反正是不放弃福克先生。他跟着他，跟着艾娥达夫人，跟着忙得连喘气的功夫也没有的那个路路通。费克斯跟着他们在一点半钟上了昆斯敦的火车。天刚亮的时候就到了都柏林，马上又搭上了轮渡汽船。这里的渡船往来象钢梭一样快，这些船上面满是机械设备，它们若无其事地在浪头上飞驰，以轻盈平稳的姿态跨过爱尔兰海峡。\\n\\n 12月21号，十一点四十分，斐利亚·福克终于到达了利物浦的码头。此去只需要六个小时就能到达伦敦。\\n\\n 但是，正在这个时候，费克斯走过来了，他一手抓住福克的肩膀，一手拿出了拘票： “您确实是斐利亚·福克先生吗？”他问斐利亚·福克。\\n\\n “是的，先生。”\\n\\n “我以女皇政府的名义通知您：您被捕了！”\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/64/3743.html","bookId":582,"book":{"id":582,"title":"Around the World In 80 Days八十天环游地球","description":"简介： Around the World in Eighty Days (French: Le tour du monde en quatre-vingts jours) is a classic adventure novel by the French writer Jules Verne, first published in 1873. In the story, Phileas Fogg of London and his newly empl...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1285727176bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/64","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
