{"id":23858,"no":8,"title":"Chapter 8","content":"Fix soon rejoined Passepartout, who was lounging and looking about on the quay, as if he did not feel that he, at least, was obliged not to see anything., \\n\\n `Well, my friend,\u0027 said the detective, coming up with him, `is your passport visaed?\u0027 \\n\\n `Ah, it\u0027s you, is it, monsieur?\u0027 responded Passepartout. `Thanks, yes, the passport is all right.\u0027 \\n\\n `And you are looking about you?\u0027 \\n\\n `Yes; but we travel so fast that I seem to be journeying in a dream. So this is Suez?\u0027 \\n\\n `Yes.\u0027 \\n\\n `In Egypt?\u0027 \\n\\n `Certainly, in Egypt.\u0027 \\n\\n `And in Africa?\u0027 \\n\\n `In Africa.\u0027 \\n\\n `In Africa!\u0027 repeated Passepartout. `Just think, monsieur, I had no idea that we should go farther than Paris; and all that I saw of Paris was between twenty minutes past seven and twenty minutes before nine in the morning, between the Northern and the Lyons stations, through the windows of a car, and in a driving rain! How I regret not having seen once more Père la Chaise and the circus in the Champs Elysées!\u0027 \\n\\n `You are in a great hurry, then?\u0027 \\n\\n `I am not, but my master is. By the way, I must buy some shoes and shirts. We came away without trunks, only with a carpet-bag.\u0027 \\n\\n `I will show you an excellent shop for getting what you want.\u0027 \\n\\n `Really, monsieur, you are very kind.\u0027 \\n\\n And they walked off together, Passepartout chatting volubly as they went along. \\n\\n `Above all,\u0027 said he; `don\u0027t let me lose the steamer.\u0027 \\n\\n `You have plenty of time; it\u0027s only twelve o\u0027clock.\u0027 \\n\\n Passepartout pulled out his big watch. `Twelve!\u0027 he exclaimed; `why it\u0027s only eight minutes before ten.\u0027 \\n\\n `Your watch is slow.\u0027 \\n\\n `My watch? A family watch, monsieur, which has come down from my great-grandfather! It doesn\u0027t vary five minutes in the year, it\u0027s a perfect chronometer, look you.\u0027 \\n\\n `I see how it is,\u0027 said Fix. `You have kept London time, which is two hours behind that of Suez. You ought to regulate your watch at noon in each country.\u0027 \\n\\n `I regulate my watch? Never!\u0027 \\n\\n `Well, then, it will not agree with the sun.\u0027 \\n\\n `So much the worse for the sun, monsieur. The sun will be wrong, then!\u0027 \\n\\n And the worthy fellow returned the watch to its fob with a defiant gesture. After a few minutes\u0027 silence, Fix resumed: `You left London hastily, then?\u0027 \\n\\n `I rather think so! Last Friday at eight o\u0027clock in the evening, Monsieur Fogg came home from his club, and three-quarters of an hour afterwards we were off.\u0027 \\n\\n `But where is your master going?\u0027 \\n\\n `Always straight ahead. He is going round the world.\u0027 \\n\\n `Round the world?\u0027 cried Fix. \\n\\n `Yes, and in eighty days! He says it is on a wager; but, between us, I don\u0027t believe a word of it. That wouldn\u0027t be common sense. There\u0027s something else in the wind.\u0027 \\n\\n `Ah! Mr Fogg is a character, is he?\u0027 \\n\\n `I should say he was.\u0027 \\n\\n `Is he rich?\u0027 \\n\\n `No doubt, for he is carrying an enormous sum in brand-new bank-notes with him. And he doesn\u0027t spare the money on the way, either: he has offered a large reward to the engineer of the `Mongolia\u0027 if he gets us to Bombay well in advance of time.\u0027 \\n\\n `And you have known your master a long time?\u0027 \\n\\n `Why, no; I entered his service the very day we left London.\u0027 \\n\\n The effect of these replies upon the already suspicious and excited detective may be imagined. The hasty departure from London Soon after the robbery; the large sum carried by Mr Fogg; his eagerness to reach distant countries; the pretext of an eccentric and foolhardy bet, - all confirmed Fix in his theory. He continued to pump poor Passepartout, and learned that he really knew little or nothing of his master, who lived a solitary existence in London, was said to be rich, though no one knew whence came his riches, and was mysterious and impenetrable in his affairs and habits. Fix felt sure that Phileas Fogg would not land at Suez, but was really going on to Bombay. \\n\\n `Is Bombay far from here?\u0027 asked Passepartout. \\n\\n `Pretty far. It is a ten days\u0027 voyage by sea.\u0027 \\n\\n `And in what country is Bombay?\u0027 \\n\\n `India.\u0027 \\n\\n `In Asia?\u0027 \\n\\n `Certainly.\u0027 \\n\\n `The deuce! I was going to tell you - there\u0027s one thing that worries me - my burner!\u0027 \\n\\n `What burner?\u0027 \\n\\n `My gas-burner, which I forgot to turn off, and which is at this moment burning - at my expense. I have calculated, monsieur, that I lose two shillings every four and twenty hours, exactly sixpence more than I earn; and you will understand that the longer our journey--\u0027 \\n\\n Did Fix pay any attention to Passepartout\u0027s trouble about the gas? It is not probable. He was not listening, but was cogitating a project. Passepartout and he had now reached the shop, where Fix left his companion to make his purchases, after recommending him not to miss the steamer, and hurried back to the consulate. Now that he was fully convinced, Fix had quite recovered his equanimity. \\n\\n `Consul,\u0027 said he, `I have no longer any doubt. I have spotted my man. He passes himself off as an odd stick, who is going round the world in eighty days. \\n\\n `Then he\u0027s a sharp fellow,\u0027 returned the consul, and counts on returning to London after putting the police of the two continents off his track.\u0027 \\n\\n `We\u0027ll see about that,\u0027 replied Fix. \\n\\n `But are you not mistaken?\u0027 \\n\\n `I am not mistaken.\u0027 \\n\\n `Why was this robber so anxious to prove, by the visa, that he had passed through Suez?\u0027 \\n\\n `Why? I have no idea; but listen to me.\u0027 \\n\\n He reported in a few words the most important parts of his conversation with Passepartout. \\n\\n `In short,\u0027 said the consul, `appearances are wholly against this man. And what are you going to do?\u0027 \\n\\n `Send a despatch to London for a warrant of arrest to be despatched instantly to Bombay, take passage on board the \"Mongolia\", follow my rogue to India, and there, on English ground, arrest him politely, with my warrant in my hand, and my hand on his shoulder.\u0027 \\n\\n Having uttered these words with a cool, careless air, the detective took leave of the consul, and repaired to the telegraph office, whence he sent the despatch which we have seen to the London police office. A quarter of an hour later found Fix, with a small bag in his hand, proceeding on board the `Mongolia\u0027; and ere many moments longer, the noble steamer rode out at full steam upon the waters of the Red Sea. \\n\\n “喂，朋友！”费克斯走近路路通问道，“您的护照办好了签证吗？”\\n\\n “哦，原来是您，先生。多谢您关心，我们全按规矩办妥了。”这个法国人回答说。\\n\\n “您在欣赏这里的风光吗？”\\n\\n “是啊，可就是走得太快了，简直是在梦里旅行，我们真的到了苏伊士了？”\\n\\n “是到苏伊士了。”\\n\\n “不就是到了埃及了吗？”\\n\\n “一点不错！到了埃及了。”\\n\\n “也就是到了非洲了？”\\n\\n “是到了非洲了。”\\n\\n “啊！到了非洲了！”路路通说，“我真不敢相信！您看，我还以为最远也过不了巴黎呢！巴黎，那么有名的大京城，我只是早上七点二十分到八点四十分，由北站到里昂站的那么一段时间里从马车的窗子里瞧了那么一会儿，而且外头还下着哗哗的大雨。真叫人遗憾！”\\n\\n “这么说，您是有急事？”侦探问。\\n\\n “我吗，一点也不急。有急事的是我的主人。哦，想起来了，我还得去买袜子和衬衫呢！我们出门没带行李，只带了个旅行袋！”\\n\\n “我带您到市场去买吧，那儿什么都有。”\\n\\n “先生，”路路通向费克斯说，“您这个人真热心！……”\\n\\n 于是他们就一齐去了。路路通话匣子一打开就没个完。\\n\\n “顶要紧的是，”路路通说，“我得留神，不能误了上船。，\\n\\n “时间有的是，”费克斯回答说，“现在才十二点。”\\n\\n 路路通掏出了他的大银表说道：\\n\\n “十二点！别开玩笑了！现在是九点五十二分。”\\n\\n “您的表慢了。”费克斯说。\\n\\n “我的表会慢！这是我的曾祖父留下来的传家之宝。它一年也差不了四五分钟，这是个标准表。”\\n\\n “哦，我明白了，”费克斯回答说，“您的表是伦敦时间，伦敦时间比苏伊士时间差不多慢两小时。每到一个地方，您应该在当地正午时间把您的表拨到十二点。”\\n\\n “要我拨表！”路路通大声说，“我的表从来也不拨。”\\n\\n “那么，您的表就跟太阳的运行不符合了。”\\n\\n “管它太阳不太阳！先生，太阳也会错的。” \\n\\n “您是不是老早就认识您这位主人了？”\\n\\n “我呀，”路路通回答说，“就是在动身的那一天，我才到他家工作。”\\n\\n 这番回答，在这个已经非常激动的侦探的心里所引起的反应是不难想象的。盗窃案发生以后不久，仓促离开伦敦，带了这么一大笔钱，急急忙忙往远地跑，用这样奇怪的打赌作借口，这一切都证明费克斯的猜测是不错的。他又逗引着这个法国小伙子谈了一些情况，他已经确切地知道这小伙子对他的主人一点也不了解，知道福克先生在伦敦的生活很孤僻；知道人家都说他有钱，但却摸不清他的钱是打哪儿来的；知道他是个令人捉摸不透的人。同时，费克斯也确实知道了斐利亚·福克不会在苏伊士上岸。他是真的要到孟买去。\\n\\n “孟买离这儿远吗？”路路通问。\\n\\n “相当远，”侦探回答说，“上那儿去您还得坐上十几天的船。”\\n\\n “孟买到底在哪儿呀？”\\n\\n “在印度。”\\n\\n “这一回我可抓瞎了！真见鬼，我告诉你……有一桩事，真把我愁死了……我的煤气……”\\n\\n “什么霉气？”\\n\\n “出门时我忘记关煤气炉子了。如今它还在那儿烧着呢。将来这笔煤气费全得由我出钱。算了一下，每二十四小时两个先令。这正好比我每天的工资多六便士。您会明白，这趟旅行多延长一天我就多一天损失。”\\n\\n 费克斯是否真的了解了他谈的“煤气”问题呢？这很难说，因为这老半天他根本就没听路路通的，他在考虑自己该怎么办。他俩一路来到了百货市场。费克斯让路路通自己去买东西，并且提醒他别误了开船时间，然后就急急忙忙跑回领事馆。现在，费克斯是信心十足，显得非常沉着。\\n\\n “领事先生，”他说道，“我现在可以肯定说，这家伙是逃不出我的手了。他想装成一个要花八十天去环游地球的怪绅士来骗人。”\\n\\n “那么说，他真是个大滑头啊，”领事接着说，“他是打算把欧美两洲所有警察局都蒙混过了，然后再回到伦敦去。”\\n\\n “是啊！咱们倒真要看看他的本事！”费克斯回答说。\\n\\n “您可真的没弄错吧？”领事又问了一遍。\\n\\n “我是不会弄错的。”\\n\\n “那么，为什么这个贼一定要拿护照来办签证，证明他路过苏伊士呢？”\\n\\n “为什么……领事先生，这我也不知道，”侦探回答说，“不过，您听我告诉您。”\\n\\n 于是他就把方才跟福克的仆人谈话中那几件最值得怀疑的事实说了一遍。\\n\\n “不错，从这些事实能作出的一切推断都说明了这个人靠不住。不过，您打算怎样办呢？”\\n\\n “我马上给伦敦打电报，要求立即发给我一张拘票，寄到孟买。然后搭上蒙古号，一直盯着这个贼到印度。到了那块英国的属地，我就客客气气地走到他跟前，一手拿出拘票，一手抓住他的肩膀。”\\n\\n 一刻钟之后，费克斯提着自己简单的行李，带着一笔钱，就上了蒙古号。过不一会儿，这条快船已经飞也似的在红海上奔驰开了。\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/64/3728.html","bookId":582,"book":{"id":582,"title":"Around the World In 80 Days八十天环游地球","description":"简介： Around the World in Eighty Days (French: Le tour du monde en quatre-vingts jours) is a classic adventure novel by the French writer Jules Verne, first published in 1873. In the story, Phileas Fogg of London and his newly empl...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1285727176bf31c.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/64","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
