{"id":82598,"no":125,"title":"Page 125","content":"Often she lay awake in Emily\u0027s guest room, telling herself sternly that if other women could endure the sexual act, she could too. Besides, she repeatedly reminded herself, the act itself, and the awful pain that accompanied it, didn\u0027t last all that long. And she adored Clayton, so if he wished to do that to her, then she would bear the pain to make him happy, and hope that it happened with minimal frequency. Yet she hated knowing not only the day, but practically the hour, when he was going to do it to her again.\n In one of her more philosophical moments, she decided that the reason virginity was so prized for a bride was because early man must have realized that a bride who knew what was in store for her on her wedding night, would not be smiling quite so radiantly when she walked down that aisle!\n Unfortunately, by the time the wedding was a week away her philosophical attitude had deserted her entirely, and her dread was steadily mounting. To make matters worse, as their wedding day approached, Clayton\u0027s attentions became decidedly more ardent-and therefore, more frightening.\n Even her ivory wedding gown, which was hanging in her dressing room, sent a trill of fear up her spine when she looked at it, because it reminded her of the ivory satin gown that Clayton had torn from her body. Not that she was idiotic enough to think that the gentle, understanding man she worshiped was going to tear her clothes from her on their wedding night-but neither did she think Clayton was likely to allow her to keep them on for very long either.\n Surreptitiously, she began watching Emily when Michael asked her if she were ready to retire. Emily didn\u0027t seem to dread going to their bedroom. Neither, Whitney recalled, had Aunt Anne tried to evade retiring with Uncle Edward. Why then, was Whitney the only woman who winced at the thought of the pain which came with the marital act? The more Whitney considered it, the more horrifyingly convinced she became that there was a physical defect within her which made the act hurt her, and only her, so dreadfully.\n To add to her misery, as her wedding day bore down 01 her, her agitated mind began tormenting her with constant visions of that terrible night when Clayton had cruelly and deliberately shamed her with his hands and mouth and body. The humiliation of that night came back to haunt her, magnifying her remembered physical pain until she was a mass of fear and trepidation.\n Five days before the wedding, she was simply too worn down to attend the ball being given by one of Clayton\u0027s friends. The next day she sent Clayton a note, asking him to excuse her from an afternoon party at the Rutherfords\u0027.\n Clayton, who had removed to his townhouse in Upper Brook Street to be near Whitney during the weeks preceding the wedding, read her brief note declining the Rutherfords\u0027 party with a faint frown of bewilderment. After a moment\u0027s thought, he ordered his carriage brought round and went directly to the Archibald townhouse where he was informed that Miss Stone was in the Blue -Salon, and that Lord and Lady Archibald were out for the day.\n Whitney picked up a fresh piece of stationery, dipped her quill into the ink pot, and continued with the exhausting task of writing notes of appreciation for the awesome number of wedding gifts which had been arriving in droves for weeks. In the doorway of the salon, Clayton stopped and gazed at her. She was seated at a desk, her dark chestnut hair twisted into thick curls bound with narrow green ribbons. Her head was bent slightly as she wrote, her flawless profile turned to him. With the sun streaming in the window beside her, Clayton thought she looked so fragile and lovely that she seemed ethereal. \"Problems?\" he said after a long moment, closing the doors behind him. He crossed to her, took her by the hand and pulled her gently, but firmly, out of her chair and over toward the sofa. \"Young lady, is it your intention to treat me as a bystander in all of this, and only remember my existence when you walk down the aisle?\"\n Whitney sank down beside him. \"I\u0027m sorry about the Rutherfords\u0027 affair,\" she said with a tired smile that made Clayton instantly regret his mild reprimand. \"It\u0027s just that I\u0027m so busy with everything, that even I feel like a bystander at times.\" Turning her face into the comforting curve of his shoulder and neck, she said, \"I missed you terribly last night-did you have a pleasant time at the ball?\"\n Clayton tilted her chin up. \"Not without you,\" he murmured as his mouth covered hers. \"Now, show me how much you missed me . . .\"\n Within moments, Whitney\u0027s tension and exhaustion had melted away in the heat of Clayton\u0027s passionate kiss*. In a kind of sensual haze, she was dimly aware that he was inexorably drawing her down to lie beside him on the silk sofa, but with his lips moving persuasively against hers, and his tongue teasing and exploring, the shift in her position scarcely seemed to matter.\n Her senses swam dizzily, assaulted by his deep kisses and the gentle, arousing things he whispered against her parted lips as he kissed her. \"I can\u0027t get enough of you,\" he murmured, leaning over her. \"I\u0027ll never get enough of you.\" His hand roamed possessively over the sensitive skin above her bodice, his fingers nimbly unfastening the row of tiny buttons at the front of her lime-wool dress. Before Whitney could react, her chemise was down and his mouth was moving leisurely toward her naked, exposed breasts. \"The servants!\" she gasped.\n \"They\u0027re scared to death of me,\" Clayton said. \"They wouldn\u0027t come in here to warn us of a fire.\"\n His tongue touched a rosy nipple, and Whitney struggled in genuine, frantic earnest. \"Don\u0027t! Please!\" she said hoarsely, lurching into a sitting position and clutching her open bodice, clumsily refastening it.\n Clayton started to reach for her, but she leapt off the sofa. Amazed, he sat up and stared at her. She looked slightly flushed, very beautiful-and frightened half to death! \"Whitney?\" he said cautiously.\n She jumped, took three steps backward, then sank onto the sofa across from him, her expression tortured and embarrassed. As Clayton watched, she started to speak, changed her mind, then ran her hand over her forehead. Finally, she raised pleading green eyes to his and drew a long, unsteady breath. \"There\u0027s something I\u0027ve wanted to ask you-a favor. But it\u0027s dreadful and embarrassing. It\u0027s about our wedding. Night.\"\n Frowning with worry over the tension and anxiety he saw on her face, Clayton leaned forward and rested his forearms on his knees. \"What favor do you want to ask of me?\" he said quietly.\n \"Promise me you won\u0027t be angry when you hear it?\"\n \"You have my word,\" Clayton assured her calmly.\n \"Well, you see,\" she began hesitantly, \"I-I would like to be able to really look forward to our wedding. But I can\u0027t, because I keep thinking about what is going to happen-you know-later that night. Other brides don\u0027t understand, not exactly, but I do now and I-\" She was as pink as roses when she trailed off into pathetic silence. \n","sourceLink":"https://allnovel.net/whitney-my-love-westmoreland-saga-2/page-125.html","bookId":1804,"book":{"id":1804,"title":"Whitney, My Love (Westmoreland Saga #2)","description":"Storyline: \n Fresh from her triumphs in Paris society, Whitney Stone returns to England determined to win the heart of her childhood love. However, in order to save himself from ruin, her father has come to an arrangement with the arrogant Duke of Claymore, and Whitney is the price.\n \n","cover":"https://allnovel.net/images/whitney-my-love-westmoreland-saga-2.jpg","author":"Judith McNaught","type":"Historical","source":"allnovel","link":"https://allnovel.net/whitney-my-love-westmoreland-saga-2.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:39:39 PM"}}
