{"id":82489,"no":13,"title":"Page 13","content":"His revolted gaze slid from the top of his grotesque head with its fierce jaws open wide, ready to snap, down to his claw-like reptilian feet, then along the thick tail dragging the floor behind him. Precisely at the center of what should have been the crocodile\u0027s sleek green body, Edward\u0027s stomach swelled majestically. Turning his back to the mirror, he looked over his shoulder and experimentally rotated his hips, watching in morbid fascination as his tail undulated behind him. \"Obscene!\" he snorted in disgust. Lady Anne and Whitney came into the room at that moment, and Edward turned on his wife. \"God\u0027s armpits!\" he exploded, jerking off his headpiece and waving it angrily at her as he waddled across the room, his tail dragging behind him. \"How am I ever going to have a cigar wearing this, may I ask?\" Lady Anne smiled unperturbably as she surveyed him in the costume she had chosen without consulting him. \"I couldn\u0027t get your favorite Henry the Eighth costume, and I was perfectly sure you wouldn\u0027t care for the elephant costume-\" \"Elephant!\" Edward repeated bitterly, glowering at her. \"I\u0027m surprised you didn\u0027t purchase that getup for me. You could have had me crawling about on all fours, waving my trunk and stabbing people in the rump with my tusks! Madam, I have a reputation to maintain, a dignity-\" \"Hush, dear,\" she remonstrated affectionately. \"What will Whitney think-\" \"I\u0027ll tell you what she\u0027ll think-she\u0027ll think I look like an ass. Everyone will think I look like an ass!\" He turned his head toward Whitney. \"Go ahead, my dear, tell your aunt I look like an ass!\" Whitney regarded him with laughing fondness. \"Your costume is very clever and original, Uncle Edward,\" she said diplomatically, then she sidetracked him completely by mentioning the name of a lifelong rival. \"I did hear, though, that Herbert Granville is coming as a horse.\" \"No, really?\" Lord Gilbert said, instantly amused. \"Which end?\" Her eyes twinkled at him. \"I forgot to ask.\" He chuckled, then said, \"Let me guess who you are supposed to be.\" Whitney twirled around for his inspection. Her Grecian gown of filmy white silk was fastened at the left shoulder with an amethyst broach, leaving the other creamy shoulder tantalizingly bare. Its gossamer folds clung provocatively to her full breasts and narrow waist, then fell gracefully to the floor. The thick clusters of her shining hair were bound with vibrant buttercups and violets. \"Venus,\" he decided. Whitney shook her head. \"Here-this clue will help.\" She swirled a purple satin mantle over her shoulders and waited expectantly. \"Venus,\" he declared again, more emphatically. \"No,\" she said, kissing him on the cheek. \"Actually, the dressmaker tried to improve on mythology. I\u0027m supposed to be Prosperina, but she is always depicted in a simpler, girlish gown.\" \"Who?\" Edward echoed. \"Prosperina, the goddess of spring,\" Whitney said. \"Re-member, Uncle Edward? She is always shown with violets and buttercups in her hair, and wearing a purple mantle like this one?\" When her uncle still looked confused, Whitney added, \"Pluto carried her off to live in the underworld as his wife.\" \"Rotten thing for him to have done,\" Edward replied absently, \"but I like your costume, my dear. Everyone will be so busy trying to figure out who you\u0027re supposed to be, they won\u0027t have time to wonder who the obese crocodile is.\" With that he offered his arm to Whitney, and the other to Anne, who was gowned as a medieval queen, complete with tall conical headdress and veil. Waves of laughter surged across the Armands\u0027 overcrowded ballroom, drowning out the efforts of the musicians, then receding, leaving behind the persistent undertow of conversation. On the congested dance floor, extravagantly costumed guests struggled for space to dance to musk they could scarcely hear. Standing on the sidelines, surrounded by her personal entourage of admirers, Whitney smiled serenely. She watched Nicki arrive, nod briefly to his mother, then begin making his way unerringly toward her, recognizing her despite her white demi-mask. He was coming from another party and was not wearing a costume. Whitney studied him with an inward smile; she admired everything about him, from the easy way he wore his elegant clothes to his sophisticated charm. For a fleeting moment, the memory of the way his mouth had felt as it moved over hers tingled through her. When he was near, he flicked a level, impassive glance over the men standing around her, and they parted to make a place for him as if he had ordered them aside. Grinning wolfishly, he surveyed her Grecian gown, purple mantle, and the violets and buttercups twined in her glossy hair. He lifted her fingers to his lips and raised his voice in order to be heard over the din of conversation. \"You are ravishing tonight, Venus.\" \"Amen!\" agreed an enormous banana who was struggling to fight his way past Whitney\u0027s group. \"Ravissante!\" declared a knight in armor, raising his visor and fixing Whitney with an appreciative leer. Nicki passed a cold look over the two, and Whitney demurely raised her fan. But behind the silken slats, she was smiling widely. This was her world now, and she warmed with a feeling of security. In France, when she said something unusual, there were no snorts of disapproval or gasps of outrage. Instead, people said she was \"witty\" and \"lively\" and even quoted her. Surely when she went home to England it would be the same. She had made dreadful mistakes there as a girl. She knew better now, and she would not disgrace herself again. Beside her, she felt Nicki\u0027s admiring gaze moving over her silk dress, but she did not bother to tell him that she wasn\u0027t costumed as Venus. No one at the entire ball seemed to have heard of any female from Greek mythology other than Venus, and the clue of her purple mantle and the violets and buttercups in her hair meant nothing to them. Long ago, she\u0027d given up explaining. She was in the process of deciding on whom to bestow the honor of fetching her more punch when Andre Rousseau, one of her most enduring admirers, noticed that her glass was empty. \"But this cannot be permitted, Mademoiselle,\" he said dramatically. \"I did not realize that your glass required attention. May I?\" he said, extending his hand toward the offending glass. Whitney surrendered it to him, and he bowed. \"An honor, Mademoiselle.\" With a triumphant look at the other gentlemen, he departed in the direction of the gigantic crystal fountain which gurgled forth a ceaseless supply of punch. Would Paul think it was an honor to fetch punch for her now? Whitney wondered dreamily. The idea of Paul Sevarin flushing with gratitude over being allowed to do an errand for her was so ludicrous that Whitney smiled. If only he could see her here, surrounded by suitors, courted and sought after.","sourceLink":"https://allnovel.net/whitney-my-love-westmoreland-saga-2/page-13.html","bookId":1804,"book":{"id":1804,"title":"Whitney, My Love (Westmoreland Saga #2)","description":"Storyline: Fresh from her triumphs in Paris society, Whitney Stone returns to England determined to win the heart of her childhood love. However, in order to save himself from ruin, her father has come to an arrangement with the arrogant Duke of Claymore, and Whitney is the price.","cover":"https://allnovel.net/images/whitney-my-love-westmoreland-saga-2.jpg","author":"Judith McNaught","type":"Historical","source":"allnovel","link":"https://allnovel.net/whitney-my-love-westmoreland-saga-2.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:39:39 PM"}}
