{"id":82608,"no":135,"title":"Page 135","content":"Clayton got up, pressed a light kiss on her forehead, affectionately rumpled her heavy hair, and strode briskly up the curving marble staircase.\\n\\n He went into her room and grinned to himself as he looked about him. A faint scent of Whitney\u0027s perfume lingered there. Her combs and brushes were on her dressing table. Her presence filled the airy room and made it seem pretty and fresh and vibrant. Like she was.\\n\\n Wondering again if she knew she was with child, and wondering why in the world, if she did know, she wasn\u0027t telling him, he pulled open the drawer of her rosewood writing desk. Clayton took some stationery off the top of the thick stack for Whitney to use, then rummaged through the drawer, looking for her aunt\u0027s letter. Unable to find it, he pushed aside what he thought was a white handkerchief and flipped through the stack of unused stationery. Near the very bottom he finally discovered a folded letter. Uncertain if it was the one Whitney wanted, he unfolded it and scanned the words Whitney had written many months ago at Emily\u0027s house, in a foolish-and discarded-attempt to force Clayton to come back to hen\\n\\n \"To my very great mortification, I find I am with child. Please can at once here to discuss what can be done. Whitney.\"\\n\\n To her very great mortification? Clayton repeated to himself with a bewildered frown. What an odd way for her to feel about the living culmination of the exquisite joy they had found in one another. And what a peculiar way for her to choose to give him the news. \"Please call at once.\"\\n\\n In the space of the next three seconds, three realizations stunned him: The note was dated two months before they were married-in fact, it was written on the day before he had brought Vanessa here and found Whitney waiting for him ... there was no name on it to indicate who the note had been intended for . . . and the note was in Whitney\u0027s elegant, scholarly hand and signed by her. God help him . . . She had written it to some man she believed had made her pregnant.\\n\\n Clayton\u0027s mind registered disbelief, it started to shout denials. . . even while something inside of him slowly cracked and began to crumble. He felt as if he were shattering and all of his pieces flying apart. Whitney had been playacting the night she came here to him. After all those months of treasuring the memory of the way she had surrendered her pride and crossed the study to come to him, it had been a lie, a contemptible, filthy lie! That tender scene in which she had whispered, \"I love you\" had been an act! She had played it because she believed she was pregnant, and whoever this note was intended for either refused his responsibility or couldn\u0027t accept it. Perhaps the son of a bitch was already married.\\n\\n Whitney had come to Claymore that night to get herself a father for someone else\u0027s brat-Christ! They had probably concocted the scheme of her coming here together. Except in the end, she hadn\u0027t really needed a father for her bastard. She must have miscarried, Clayton thought with feverishly clear hindsight. No wonder she had looked so tired and wan in the weeks preceding the wedding.\\n\\n And what a goddamned act on their wedding night! By then she had to have known she wasn\u0027t pregnant, but she must have been so horrified by her near calamity that she was willing to go ahead and marry him anyway. Perhaps it made it more convenient for her lover and her if Whitney were married. No one would think a thing about her becoming pregnant now. And then Clayton recalled all the times in the last months when she had gone to London on \"shopping trips\" and to \"visit friends.\" Bile surged up in his throat. This child she was carrying now was as likely someone else\u0027s as his.\\n\\n That bitch! That tying, deceitful little ... No, he couldn\u0027t call her that again, even in his twisted torment. He had loved her too much, until a minute ago, to curse her. But he had loved a sham, a consummate actress, a hollow shell of a woman. A body. Nothing more. And the body wasn\u0027t even his alone.\\n\\n What an instinct for survival she had, you had to give her that! She had faced him in that study with Vanessa in the same house, borne his fury and pressed her body against his, kissing him as if her whole heart were in it. Because she was pregnant! Clayton wanted to believe the baby might have been his. He even tried to convince himself of mat for a moment. But he knew better-the night he had ravaged her, there had been no more than a moment\u0027s penetration. The act had never been consummated. The chance of the child\u0027s having been his was too minuscule even to consider.\\n\\n Their lives were a charade. Each word she spoke, every look on her face, the way she was in bed-all of it was a performance she put on every day. It was all an obscene,\\n\\n His hand tightened on the piece of blue stationery, slowly crumpling it into a tight, hard ball. The pain inside of him began to dull as a cold, black rage swept over bun. He dropped the crumpled note blindly into the desk drawer and slammed it shut, but it wouldn\u0027t close. A tiny white garment with a small \"W\" embroidered in blue threads on the collar had jammed between the drawer and the desk, half in and half out of it.\\n\\n Clayton stared at it, then gave it a vicious jerk. This was what he had been meant to find, he realized with fury. How very touching of her to tell him this way! What a flair for tender drama she had! Distastefully, he dropped the tiny garment on the floor and deliberately ground it beneath his heel as he turned to walk away.\\n\\n \"I see you found it,\" Whitney whispered from the doorway, her gaze frozen in misery on the little gown crushed beneath his foot.\\n\\n \"When?\" he said icily.\\n\\n \"In-in about seven months, I think.\"\\n\\n Clayton stared at her, violence emanating from every pore. With deliberate cruelty he carefully enunciated each vicious word. \"I don\u0027t want it.\"\\n\\n Clarissa and Mary, who had been hovering on the balcony to have a look at their employer\u0027s beaming countenance when be heard the news, recoiled in amazement as he passed them on the way down the stairs, moving with an unleashed savagery that threatened to strike down anything in his path. The front door crashed into its frame behind him, and Clarissa slowly turned and walked into Whitney\u0027s room, then froze in horror at the sight that greeted hen\\n\\n Whitney was kneeling on the floor near her desk, her shoulders jerking spasmodically with her silent weeping. Her head was thrown back and tears were streaming from her tightly closed eyes.\\n\\n And in her hands was a tiny white gown with a little \"W\" she had lovingly embroidered in blue.\\n\\n \"Here, don\u0027t cry so, darlin\u0027,\" Clarissa said in a suffocated whisper as she bent down to help her up. \"You\u0027ll harm the babe.\"\\n\\n Whitney thought she would never be able to stop. She cried until her sobs were dry and choked. She cried until there were no more tears left to weep and she felt dry and barren. \"I don\u0027t want it!\" The four words coiled around her heart, squeezing and twisting until she couldn\u0027t breathe.\\n\\n","sourceLink":"https://allnovel.net/whitney-my-love-westmoreland-saga-2/page-135.html","bookId":1804,"book":{"id":1804,"title":"Whitney, My Love (Westmoreland Saga #2)","description":"Storyline: Fresh from her triumphs in Paris society, Whitney Stone returns to England determined to win the heart of her childhood love. However, in order to save himself from ruin, her father has come to an arrangement with the arrogant Duke of Claymore, and Whitney is the price.\\n","cover":"https://allnovel.net/images/whitney-my-love-westmoreland-saga-2.jpg","author":"Judith McNaught","type":"Historical","source":"allnovel","link":"https://allnovel.net/whitney-my-love-westmoreland-saga-2.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:39:39 PM"}}
