{"id":82490,"no":14,"title":"Page 14","content":"Abruptly, Whitney jerked her thoughts from Paul back to reality as she realized that she had been inadvertently staring at a man across the room who was costumed entirely in black. Below his black half mask, the man\u0027s mouth lifted in a slow, amused smile, and he inclined his head to her in the merest mockery of a bow.\n Hot with embarrassment over being caught staring, Whitney turned away so quickly that she nearly knocked the glass from Andres outstretched hand. \"Your punch, Mademoiselle,\" he said, offering the glass to her as if he were presenting her with a handful of diamonds. As Whitney thanked him and took the glass, he glanced ruefully at his plum-colored satin waistcoat which was now stained with wet spots.\n In answer to Whitney\u0027s sympathetic inquiry as to how he had gotten wet, Andre gravely recounted the dangers he\u0027d faced in the quest for her punch. \"It is most treacherous to make one\u0027s way through the crowd, Mademoiselle. In the short time I was away from your side, I was trod upon by an inebriated lion, shoved by the same banana who addressed you earlier, and tripped by the tail of a crocodile who cursed at me when I stumbled.\"\n \"I-I\u0027m so sorry, Andre,\" Whitney commiserated, choking on a horrified giggle at the mention of the crocodile. \"It must have been dreadful for you.\"\n \"It was nothing!\" Andre contradicted dramatically, making it sound as if it had been something very great indeed. \"For you, I would do anything. For you, no task could be too difficult. For you, I would cross the Channel on a raft, tear the heart from my chest. . .\"\n \"Perhaps even attempt another trip to the punch fountain?\" Whitney teased.\n Solemnly, Andre declared that he would even do that.\n Nicki regarded the younger man with a mixture of pity, amusement, and disgust. \"Cherie,\" he said to Whitney, tucking her hand in the crook of his arm and leading her toward the French doors that opened out onto the patio. \"Either marry Andre, or else cut the poor devil\u0027s line. If you do not, he is bound to try something truly dangerous for you, like crossing the street.\"\n \"I suppose I ought to marry him,\" Whitney said with an audacious sidewise smile. \"After all, you said yourself that he would make me a fine husband, that very first night when you came to the debutante ball and danced with me.\"\n Nicki was silent until they were standing outside on the patio. \"It would be a mistake for you to marry him, for Andre Rousseau\u0027s family and mine are old friends, and it would sorely strain that friendship if I were to kill their only son, merely to make you a widow.\"\n Startled by the threatening words, Whitney snapped her head up, only to find that Nicki was grinning at her. \"That really is too bad of you, Nicki. I like Andre, and I like you. We are all friends.\"\n \"Friends?\" he repeated. \"You and I are better than that, I would say.\"\n \"Well, good friends then,\" Whitney relented uncomfortably.\n They remained outdoors, speaking to acquaintances who strolled past them on the patio, while Whitney tried to think of some way to restore her relationship with Nicki to the casually impersonal one they\u0027d enjoyed until a few months ago. Suddenly he spoke and Whitney lurched with surprise at the topic. \"At what age is an Englishwoman expected to marry?\"\n \"No later than five-and-thirty,\" Whitney lied promptly.\n \"Stop, I am serious.\"\n \"Very well,\" Whitney smiled, desperately trying to keep things light. \"No later than five-and-twenty, then.\"\n \"It is time you think of marriage.\"\n \"I would much rather think of dancing.\"\n Nicki looked on the verge of argument, then he reconsidered and offered her his arm. \"We\u0027ll dance then,\" he said curtly.\n But even in that, he was to be thwarted. A deep voice that seemed to leap out of the shadows behind them said, \"Unfortunately, Monsieur, Miss Stone has promised this waltz to me.\"\n Whitney turned in astonishment as a black-cloaked form materialized from the darkness. Even without the almost Satanic costume, Whitney would have recognized that mocking smile-it was identical to the one this man had given her across the ballroom, when he\u0027d caught her inadvertently staring at him. \"You promised me this dance,\" Satan said when she hesitated.\n Whitney had no idea who this unidentified acquaintance could be, but she was very anxious to avoid further conversation about marriage with Nicki. \"I don\u0027t remember promising anyone a dance tonight,\" she said hesitantly.\n \"You promised me months ago,\" Satan informed her, potting his hand beneath her elbow and exerting just enough pressure to begin drawing her with him toward the ballroom.\n Smothering a smile at the man\u0027s outrageous audacity, Whitney looked over her shoulder and politely excused herself to Nicki, but she could feel his cool gaze on her back with every step she took.\n Nicki was forgotten, however, as she stepped into Satan\u0027s arms and found herself being whirled around in time to the sweeping music by a man who danced with the easy grace of someone who has waltzed a thousand times and more. Around and around they floated until Whitney couldn\u0027t stand the suspense any longer. \"Did I really promise you a dance tonight?\" she asked.\n \"No,\" be said.\n His blunt answer made her laugh. \"Who are you?\" she asked conspiratorially.\n A lazy grin swept across his tanned face. \"A friend?\" he offered in a voice rich and deep.\n Whitney didn\u0027t recognize his voice at all. \"No. You are an acquaintance, but not a friend.\"\n \"I will have to remedy that,\" he replied with absolute confidence that he could.\n Whitney felt a perverse desire to shatter a little of his arrogant self-assurance. \"I\u0027m afraid that\u0027s impossible. I already have more friends than I know what to do with now, and they all vow their loyalty to me until death.\"\n \"In that case,\" he said, a smile lighting his gray eyes, \"perhaps one of them will meet with an accident-with a little assistance from me.\"\n Whitney was unable to stop her answering smile. His last words held no menace, she knew; he was merely playing verbal chess with her, and it was exhilarating to try to counter his moves. \"It would be most unkind of you to hasten any of my friends to their demise. My friends are a disreputable lot, and their final destination may not have a pleasant climate.\"\n \"A warm one?\" he teased.\n With a sigh of mock regret, Whitney solemnly nodded. \"I\u0027m afraid so.\"\n He laughed at her, a throaty, contagious laugh, and his eyes suddenly seemed to regard her with a bold, speculative gleam that Whitney found unsettling. She looked away, trying to decide who he was. Outside on the patio, he\u0027d spoken in flawless French, yet here on the dance floor, his English was equally flawless and without a trace of an accent. His face, that part of it which wasn\u0027t covered by his black mask, had a healthy golden tan which he certainly couldn\u0027t have acquired in Paris this early in the spring. And not in England, either. \n","sourceLink":"https://allnovel.net/whitney-my-love-westmoreland-saga-2/page-14.html","bookId":1804,"book":{"id":1804,"title":"Whitney, My Love (Westmoreland Saga #2)","description":"Storyline: \n Fresh from her triumphs in Paris society, Whitney Stone returns to England determined to win the heart of her childhood love. However, in order to save himself from ruin, her father has come to an arrangement with the arrogant Duke of Claymore, and Whitney is the price.\n \n","cover":"https://allnovel.net/images/whitney-my-love-westmoreland-saga-2.jpg","author":"Judith McNaught","type":"Historical","source":"allnovel","link":"https://allnovel.net/whitney-my-love-westmoreland-saga-2.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:39:39 PM"}}
