{"id":82614,"no":142,"title":"Page 142","content":"He didn\u0027t know how long he could stand this living arrangement. His heart and his mind understood the harsh reality mat there could never be anything between Whitney and him again, but his body tormented him with the same insatiable desire for her he\u0027d always felt. If they weren\u0027t living under the same roof, perhaps he could find some relief from his agony. He could remove to the townhouse in Upper Brook Street and resume a semblance of his former life, or he could go to France or Spain for a few months. That would be ideal, but Whitney was, after all, carrying his child and, in the event of some complication with her pregnancy, he shouldn\u0027t be so faraway. No, the townhouse would be better. His need for diversion and his physical needs could both be satisfied in London. All I he had to do was take Whitney to a few social affairs during r the next month or two, then, once her pregnancy was apparent, she would not be able to go out into society anyway, so no one would find it odd that she was no longer seen on his arm. When they saw him with other women, the old biddies would chick their tongues and whisper to oat another that \"the little nobody\" he had married hadn\u0027t been able to hold him very long, and that they had known all along, that this was how h was going to end. The thought gave Clayton a certain perverse pleasure. He hoped to God that Whitney was carrying a boy, for this was going to be his only opportunity to get an heir. Otherwise he would have to leave it up to Stephen to sire the heir. Thank God he could count on Stephen for that; the lands and title had always been held by a Westmoreland, and his father had been the only boy of five children. The following morning, Whitney composed a carefully worded note to Clayton to the effect that Lord Archibald\u0027s parents were celebrating their anniversary and mat Whitney had promised Emily and Michael to attend the gala affair this evening, and that she would appreciate it very much if Clayton would escort her. She sent the note into the east wing with Clarissa, then paced back and forth, waiting for Clay-ton\u0027s response. With trembling fingers she unfolded her note across the bottom of which was a curt reply in Clayton\u0027s bold handwriting. \"Advise my valet whether the dress is formal or informal.\" She could have laughed with joy. That night she spent more time than ever in her life on her appearance. Clarissa swept her hair up into intricate coils entwined with a finely wrought gold chain which had belonged to Whitney\u0027s grandmother. Nestled in the hollow between her breasts was a simple topaz pendant surrounded by a ring of diamonds, which had belonged to Whitney\u0027s great-grandmother. She was not wearing any of the Westmoreland jewelry. She was not, in fact, wearing her splendid betrothal ring. Far a few minutes Whitney actually considered removing her wide gold wedding band, but that she could not do-not even to make her point. Clayton was standing at the far end of the white and gold salon, staring moodily out the windows with a glass of whiskey in his hand, looking utterly magnificent in his black evening clothes. With a gleam of mischief dancing in her eyes, Whitney floated into the salon in a swirl of glittering gold-spangled chiffon. She did not remove the golden stole that was lying softly across her breasts, draped in a gentle half circle down her back, nor did she intend to do so until they arrived at Michael\u0027s parents\u0027 home. The hour and a half ride was made in frosty silence, but Whitney contented herself by relishing what Clayton\u0027s reaction was going to be when he saw the tantalizing display of swelling breasts exposed by the gown\u0027s provocatively plunging bodice. If Clayton hadn\u0027t liked the emerald gown in his current mood, he was definitely not going to approve of this one. \"We don\u0027t clash,\" Whitney remarked when they arrived at their destination and Clayton was helping her down from the closed carriage. \"Meaning what?\" he said coldly. \"Meaning the colors we are wearing,\" she innocently explained. In a deceptively casual gesture, Whitney pulled off the gold stole and let it flutter from her fingers as she stepped forward beside him toward the house. \"I cant imagine what damned difference-\" Clayton came to a complete hah, his eyes like shards of ice as they froze on the swelling expanse of glowing skin exposed above the glittering bodice. In a low, incensed voice he said, \"Are you trying to see exactly how far I can be provoked?\" \"No, my lord,\" Whitney replied demurely, aware of the carious looks from other arriving guests. \"How could I possibly provoke you more than I already have simply by offering you a child.\" \"If you will take some advice,\" he snapped, making a visible effort to control his fury, \"you will remember your condition and behave accordingly tonight.\" Whitney gave him a vivacious smile, aware that his blazing eyes were riveted on her swelling breasts. \"Of coarse,\" she said lightly, \"I meant to do exactly that, but my knitting wouldn\u0027t fit inside my reticule.\" In humorous proof, she held op her little beaded bag, then gasped aloud in surprised pain as Clayton\u0027s hand locked onto her forearm, his fingers biting cruelty into her flesh. \"Do not fail to enjoy the party this evening to its fullest, because it is the last you will be attending. You will remain at Claymore until the child is born, and I am moving into the townhouse.\" All the optimistic hope and determination went out of her, leaving Whitney numb and desolate. She tried to pull her arm free, but his painful grip was relentless. \"Then please don\u0027t shame us both tonight by leaving the marks of your contempt on my arm.\" His grip loosened so abruptly that it seemed as if he had been unaware of even touching her. \"Pain,\" he snapped at her as they passed by the butler, \"like love, is a thing to be shared.\" From the first minute she entered the drawing room, Whitney was vaguely aware that something was amiss, but she could not quite put her finger on what it was. It was just that everyone seemed so ... normal. No, too painstakingly normal-as if they were making a concerted effort to seem normal. Nearly an hour later, Whitney glanced up and saw Lord Esterbrook; she smiled at him and he nodded and bowed, but when he would have started toward her, Whitney made a great show of being deeply involved in her conversation with the group surrounding her. She had never believed that Lord Esterbrook had said \"unkind\" things about her to Vanessa at the Rutherfords\u0027 party, but he had an extremely perverse sense of humor and could deliver a cut with a razor\u0027s edge-, so she always made a practice of keeping him at a distance. Emily, who arrived shortly thereafter, immediately provided the answer to the strange atmosphere pervading the evening. \"Oh good Lord in heaven,\" she said, hauling Whitney off to one side and whispering while she cast furtive looks around her. \"My father-in-law is the veriest loose screw about some things. I could not believe my ears when he told me five minutes ago what great pains he\u0027d taken to lure her here as a surprise for my mother-in-law.\"","sourceLink":"https://allnovel.net/whitney-my-love-westmoreland-saga-2/page-142.html","bookId":1804,"book":{"id":1804,"title":"Whitney, My Love (Westmoreland Saga #2)","description":"Storyline: Fresh from her triumphs in Paris society, Whitney Stone returns to England determined to win the heart of her childhood love. However, in order to save himself from ruin, her father has come to an arrangement with the arrogant Duke of Claymore, and Whitney is the price.","cover":"https://allnovel.net/images/whitney-my-love-westmoreland-saga-2.jpg","author":"Judith McNaught","type":"Historical","source":"allnovel","link":"https://allnovel.net/whitney-my-love-westmoreland-saga-2.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:39:39 PM"}}
