{"id":82501,"no":25,"title":"Page 25","content":"Her tart reprimand only seemed to push him nearer the brink of outright laughter. \"Really, why is that, Ma\u0027am?\"\n \"Because you are trespassing,\" Whitney said. When he still showed no inclination to leave or apologize, Whitney knew she would have to be the one to go. Gritting her teeth, she glanced disgustedly toward her stockings and boots.\n He straightened from his lounging position and stepped over to her, extending his hand. \"May I help you?\" he offered.\n \"You certainly may help me,\" Whitney replied, her smile deliberately cold and ungracious. \"Get on your horse and go away.\"\n Something flickered in his gray eyes, but his smile remained, and his hand was still outstretched. \"Here is my hand, take it.\" Whitney ignored it and rose to her feet unassisted. It was impossible to put on her stockings without exposing her legs to the man who was leaning against the tree watching her, so she pulled on her boots and stuffed the stockings in her jacket pocket.\n Walking quickly over to Khan, she picked up her crop and, stepping onto a fallen stump, hoisted herself into the saddle. His horse, a beautifully muscled sorrel, was tied beside her. She turned Khan in a tight circle, urging nun into a lunging gallop around the woods.\n \"A pleasure meeting you again, Miss Stone,\" Clayton chuckled aloud. \"You little hellcat,\" he added appreciatively.\n Once out of sight, Whitney slowed Khan to a loping canter. She could hardly believe Mr. Westland was the neighbor her father held in such high esteem. She grimaced, recalling that he was invited to her party tonight. Why, the man was insufferably rude, outrageously bold, and infuriatingly arrogant! How could her father like him?\n She was still wondering about that when she wandered into the sewing room and sat down beside her aunt. \"You will never guess who I have just met,\" she was telling her aunt when Sewell, the old family butter, circumspectly cleared his throat and announced, \"Lady Amelia Eubank asks to see you.\"\n Whitney blanched. \"Me? Dear God, why?\"\n \"Show Lady Eubank into the rose salon, Sewell,\" Lady Anne said, curiously studying Whitney, who was looking wildly around the room for a place to hide. \"What on earth has you looking so alarmed, darling?\"\n \"You just don\u0027t know her, Aunt Anne. When I was little she used to shout at me not to chomp my nails.\"\n \"Well, at least she cared enough about you to want to correct you, which is more than I can say of anyone else here.\"\n \"But we were in church,\" Whitney cried desperately.\n Anne\u0027s smile was sympathetic but firm. \"I\u0027ll admit she\u0027s a trifle deaf and very outspoken. But four years ago, when all your neighbors came to see me, Lady Eubank was the only person who had a kind word to say about you. She said you had spunk. And she has a great deal of influence with everyone else hereabouts.\"\n \"That\u0027s because they\u0027re all frightened to death of her.\" Whitney sighed.\n When Lady Anne and Whitney walked into the salon, the dowager Lady Eubank was examining the workmanship of a porcelain pheasant. Grimacing to show her distaste, she replaced the object atop the mantle and said to Whitney, \"That atrocity must be to your father\u0027s liking. Your mother wouldn\u0027t have had it in her house.\"\n Whitney opened her mouth to speak, but couldn\u0027t think of a reply. Lady Eubank groped for the monocle dangling from a black ribbon over her ample bosom, raised it to her eye and scrutinized Whitney from the top of her head to the tip of her toes. \"Well, miss, what have you to say for yourself?\" she demanded.\n Fighting down the childish urge to wring her hands, Whitney said formally, \"I am delighted to see you again after so many years, my lady.\"\n \"Rubbish!\" said the dowager. \"Do you still chomp your nails?\"\n Whitney almost, but not quite, rolled her eyes. \"No, actually, I don\u0027t.\"\n \"Good. You have a fine figure, nice face. Now, to get down to the reason for my visit. Do you still mean to get Sevarin?\"\n \"Do I-I what?\"\n \"Young woman, I am the one who\u0027s supposed to be deaf. Now do you, or do you not, mean to get Sevarin?\"\n Whitney frantically considered and cast aside half a dozen responses. She glanced beseechingly at her aunt, who gave her a helpless, laughing look. Finally, she clasped her hands behind her back and regarded her tormentor directly. \"Yes. If\n I can.\"\n \"Ha! Thought so!\" said the dowager happily, then her eyes narrowed. \"You aren\u0027t given to blushing and simpering, are you? Because if you are, you may as well go back to France. Miss Elizabeth has tried that for years, and she\u0027s yet to snare Sevarin. You take my advice, and give that young man some competition! Competition is what he needs-he\u0027s too sure of himself with the ladies and always has been.\" She turned to Lady Anne. \"For fifteen years, I have listened to my tiresome neighbors foretelling a dire future for your niece, Madam, but I always believed there was hope for her. Now,\" she said with a complacent smirk, \"I intend to sit back and laugh myself into fits watching her snap Sevarin up right in front of their eyes.\" Raising her monacle to her eye, she gave Whitney a final inspection, then nodded abruptly. \"Do Not Fail Me, Miss.\"\n In amazed disbelief Whitney stared at the empty doorway through which the dowager had just passed. \"I think she\u0027s a little mad.\"\n \"I think she\u0027s as wily as a fox,\" Lady Anne replied with a fault smile. \"And I think you\u0027d be wise to take her advice to heart.\"\n Trancelike, Whitney sat before her dressing table mirror, watching Clarissa deftly twist her heavy hair into elaborate curls entwined with a rope of diamonds--her last, and most extravagant purchase made with the money her father sent her to spend in Paris. As Clarissa teased soft tendrils over her ears, the night breeze wafted the curtains, raising bumps on Whitney\u0027s arms. Tonight was going to be unseasonably cool, which suited Whitney perfectly, for the gown she wanted to wear was of velvet.\n As the gown was being fastened up the back, Whitney heard the sound of carriages making their way along the drive, the echo of muted laughter, distant but distinct, drifting through the open windows. Were they laughing as they recounted her old antics? Was that Margaret Merryton or one of the other girls, sniggering about the shameful way she used to behave?\n Whitney didn\u0027t notice when Clarissa finished and quietly left the room. She felt cold all over, frightened, and more painfully unsure of herself than ever before in her life. Tonight was the night she had been practicing for and dreaming of all these years in France.\n She wandered over to the windows, wondering distractedly what Elizabeth would wear tonight. Something pastel, no doubt. And demurely fetching. Parting the ivory and gold curtains, she stared down, watching the carriage lamps twinkling as they approached along the sweeping drive. One after another, in amazing numbers, they rolled to a stop at the steps. Her father must have invited half the countryside, she thought nervously. And of course, they had all accepted his invitation. They would all be eager to look her over, to search for some flaw, some sign of the unruly girl she\u0027d been before. \n","sourceLink":"https://allnovel.net/whitney-my-love-westmoreland-saga-2/page-25.html","bookId":1804,"book":{"id":1804,"title":"Whitney, My Love (Westmoreland Saga #2)","description":"Storyline: \n Fresh from her triumphs in Paris society, Whitney Stone returns to England determined to win the heart of her childhood love. However, in order to save himself from ruin, her father has come to an arrangement with the arrogant Duke of Claymore, and Whitney is the price.\n \n","cover":"https://allnovel.net/images/whitney-my-love-westmoreland-saga-2.jpg","author":"Judith McNaught","type":"Historical","source":"allnovel","link":"https://allnovel.net/whitney-my-love-westmoreland-saga-2.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:39:39 PM"}}
