{"id":82518,"no":42,"title":"Page 42","content":"At one and the same time, she managed to be an alluringly beautiful woman and a bewitchingly innocent girl. She was a study of intriguing and beguiling contrasts. In the course of one evening, she had treated him with cool disdain, tempestuous rebellion, blazing anger and now, with a jaunty impertinence and breezy impudence that he found utterly exhilarating. And to top it all off, she played one hell of chess game.\\n\\n In the spirit of bald needling and relaxed affability which they\u0027d been enjoying, Whitney raised her eyes to his and inquired with a radiant smile, \"Are you contemplating your next move-or regretting your last, my lord?\"\\n\\n Clayton chuckled. \"Aren\u0027t you the same young woman who informed me only hours ago that you\u0027d call no man \u0027my lord\u0027?\"\\n\\n \"I only called you that,\" she informed him lightly, \"to distract you so that you\u0027d forget your strategy. However, you didn\u0027t answer my question.\"\\n\\n \"If you must know,\" he said, reaching for his king and attacking from an unexpected position on the board, \"I was wondering what possessed me to play chess with a woman, when everyone knows chess is a game which requires a man\u0027s superior logic.\"\\n\\n \"You conceited beast!\" Whitney laughed, cleverly sidestepping his attack on her bishop. \"I can\u0027t imagine why I\u0027m wasting my skill on such a weak opponent.\"\\n\\n An hour later, Whitney\u0027s dark head was bent over the chessboard as she contemplated the success of her strategy. Three more moves, four possibly, and the game would be hers. \"How perverse of you to maneuver me into such an impossible position,\" she complained, smiling to herself as he made the very move she\u0027d anticipated he would.\\n\\n \"You think you have me trapped, I presume?\" he observed with alacrity.\\n\\n While Whitney carefully considered her next move, Clay-ton leaned around and nodded over his shoulder to a manservant who\u0027d been standing at stiff attention near the door from the moment her aunt and father had left.\\n\\n In response to the duke\u0027s silent command, the servant went to a table on which stood several crystal decanters and poured an amber liquid from one of them into a glass. He paused and looked inquiringly toward the duke for instruction as to the young lady\u0027s beverage. Clayton lifted two fingers, indicating that two brandies were to be served. The servant arranged the two glasses on a small silver tray and brought it over to the table beside the chessboard. He put it down, and at Clayton\u0027s brief nod of dismissal, bowed, and quietly withdrew from the room, closing the door behind him.\\n\\n Whitney was oblivious to all this, but she looked up as Clayton politely handed a glass to her. The color was obviously not that of wine, and she glanced suspiciously from the amber liquid in her glass to Clayton\u0027s face.\\n\\n Watching her with tranquil amusement, he explained, \"At dinner tonight, you argued so eloquently against the restrictions placed upon females by society, that I presumed you would prefer to have whatever I drink.\"\\n\\n He really was the most provoking man alive, taunting her this way, Whitney thought with a smile. Determined to brazen it out for as long as possible, she sniffed the pungent odor emanating from her glass. Uncle Edward\u0027s favorite drink. \"Brandy,\" she said, favoring Clayton with a bland smile. \"Perfect with a good cigar, is it not?\"\\n\\n \"Most assuredly,\" he agreed straight-faced. Reaching out, he lifted an enameled metal box from the table beside them and snapped the lid open with his thumb. Holding the box toward her, he offered Whitney her choice of the cigars within it.\\n\\n He was so supremely blase about it that Whitney\u0027s composure slipped another notch closer to laughter. Catching her lower lip between her teeth to still its treacherous trembling, Whitney studied the cigars as if trying to decide which she preferred. What would he do if she actually selected one from the box? Light it, no doubt! she thought with a silent giggle.\\n\\n \"May I suggest the longer one to your left?\" he murmured courteously.\\n\\n Whitney crumpled back into her chair, convulsed with silent mirth.\\n\\n \"A pinch of snuff perhaps?\" he urged solicitously, sending Whitney into gales of musical laughter. \"I keep it on hand for particularly discriminating guests such as yourself.\"\\n\\n \"You are impossible!\" she laughed. When she finally caught her breath, she lifted her glass and, under his amused gaze, gingerly sampled her brandy. It burned a path straight down to her stomach. The second and third sips were not quite so awful, and after a few more, she categorized brandy as one of those things for which one must acquire a taste. Very soon after, she became aware of an unaccustomed, delicious warmth seeping through her, and she firmly put the glass aside, wondering just how potent a few sips of brandy could be.\\n\\n \"Who taught you to play?\" Clayton asked.\\n\\n \"My uncle,\" Whitney replied. Leaning forward, she picked up her king and held it to the light to admire the splendid craftsmanship. \"If one didn\u0027t know better, one would think these pieces were actually cast in gold and silver.\"\\n\\n \"If one didn\u0027t know better,\" Clayton said blandly, removing the solid gold king from her graceful fingers to prevent her from inspecting it any closer, \"one would think you were trying to extricate yourself from my clever trap by contriving to place him in a safer position on the board.\"\\n\\n Whitney was instantly alert. \"Extricate myself? A safer position? Whatever are you talking about? My king isn\u0027t in jeopardy!\"\\n\\n A stow, roguish grin dawned across his features. Reaching out, he moved his bishop into position. \"Check,\" he said.\\n\\n \"Check?\" Whitney repeated in disbelief, staring at the board, trying to reassess her vulnerability. She was in check! And no matter which of the available moves she made, one of his men was poised to attack.\\n\\n Slowly she raised her eyes to his, and Clayton basked in the unconcealed admiration lighting her beautiful face. When she spoke her voice was soft and filled with awe. \"You blackhearted, treacherous, conniving scoundrel.\"\\n\\n Clayton threw back his head and laughed at the contrast between her tone and her words. \"Your flattery warms my heart,\" he chuckled.\\n\\n \"You have no heart,\" Whitney quipped, smiling dazzlingly at him. \"If you did, you\u0027d never abuse a helpless female by luring her into a game at which you are obviously a master.\"\\n\\n \"You lured me,\" he reminded her, grinning. \"Now, shall we finish the game, or do you plan to deny me my triumph by claiming the game was incomplete?\"\\n\\n \"No,\" Whitney said good-naturedly. \"I surrender completely.\"\\n\\n Her words seemed to hang portentously in the silence that followed. \"I was hoping you would,\" he said quietly. \\n\\n","sourceLink":"https://allnovel.net/whitney-my-love-westmoreland-saga-2/page-42.html","bookId":1804,"book":{"id":1804,"title":"Whitney, My Love (Westmoreland Saga #2)","description":"Storyline: Fresh from her triumphs in Paris society, Whitney Stone returns to England determined to win the heart of her childhood love. However, in order to save himself from ruin, her father has come to an arrangement with the arrogant Duke of Claymore, and Whitney is the price.\\n","cover":"https://allnovel.net/images/whitney-my-love-westmoreland-saga-2.jpg","author":"Judith McNaught","type":"Historical","source":"allnovel","link":"https://allnovel.net/whitney-my-love-westmoreland-saga-2.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:39:39 PM"}}
