{"id":82520,"no":44,"title":"Page 44","content":"\"I assume that when the adults saw you laughing, they blamed you for hiding the prize in the tree?\"\\n\\n \"Oh, no, the adults were much too busy trying to remove Elizabeth from their lunch to notice that I was laughing myself into fits. Peter Redfern did notice, though, and he assumed I was guilty, particularly since he knew I could climb a tree faster than even he could. He threatened to box my ears then and there, but Margaret Merryton told him I deserved a whipping from my father instead.\"\\n\\n \"Which was your fate?\" Clayton asked.\\n\\n \"Neither one,\" Whitney said, and her laughter reminded Clayton of wind chimes. \"You see, Peter was too angry to listen to Margaret, and I was so positive that he wouldn\u0027t dare to hit me, that I didn\u0027t think to duck until the very last moment. He hit Margaret instead,\" Whitney finished merrily. \"Oh lord! I shall never forget the look on poor Peter\u0027s face when Margaret rolled over in the grass and sat up. She had the most heavenly purple eye you could imagine.\"\\n\\n Across the chess table, their laughing gazes held, the happy silence punctuated by the cheery crackling of the logs burning on the grate. Clayton put his glass down, and Whitney\u0027s smile began to fade as he purposefully came to his feet. Darting a glance toward the door where the servant had been standing earlier, Whitney realized that he was no longer there. \"It\u0027s dreadfully late,\" she said, hastily standing up as Clayton came toward her. \"I should be leaving at once.\"\\n\\n He stopped an inch from her and said in a deep, velvety voice, \"Thank you for the most delightful evening of my life.\" She saw the look in his eyes, and her heart began to hammer uncontrollably while a warning screamed along her nerves. \"Please don\u0027t stand so close,\" she whispered desperately. \"It makes me feel like a rabbit about to be pounced upon by a-a ferret!\"\\n\\n His eyes smiled, but his voice was quiet, seductive. \"I can hardly kiss you if I\u0027m standing across the room, little one.\" \"Don\u0027t call me that, and don\u0027t kiss me! I\u0027ve just barely forgiven you for the last time at the stream.\"\\n\\n \"Then I\u0027m afraid you\u0027re going to have to forgive me again.\"\\n\\n \"I warn you, I won\u0027t,\" Whitney whispered, as he drew her into his arms. \"This time I\u0027ll never forgive you.\"_\\n\\n \"A terrifying possibility, but I\u0027ll risk it,\" he murmured huskily, and his mouth opened hungrily over hers. The shock of the contact was electrifying. His hands moved down her shoulders and back, molding her tighter and tighter to the hard length of his body. He kissed her thoroughly, insistently, endlessly, and when her quivering lips parted for his probing tongue, he crushed her into himself. His tongue plunged into her mouth, then slowly retreated to plunge again and again, in some unknown, wildly exciting rhythm that produced a knot of pure sensation in the pit of Whitney\u0027s stomach.\\n\\n The provocative caresses of his hands, the feel of his mouth sensuously joined with hers, the hard strength of his legs pressing intimately against her, brought Whitney\u0027s body to vibrant life in his arms. She surrendered helplessly to the inflaming demands of his hands and mouth, and as she did, her mind went numb. Dead. The longer the kisses continued, the more splintered apart she became. It was as if she were two people, one warm and yielding, the other paralyzed with alarm.\\n\\n When he finally drew back, Whitney let her forehead fall against his chest, her hands flattened against the crisp, starched whiteness of his shirt. She stood there in a kind of disoriented, bewildered rebellion, furious with herself and with him.\\n\\n \"Shall I implore your forgiveness now, little one?\" he teased lightly, tipping her chin up. \"Or should I wait?\" Whitney lifted her mutinous green eyes to his. \"I think I\u0027d better wait,\" he said with a rueful chuckle. Pressing a brief kiss on her forehead, he turned and strode from the room, returning a moment later with her satin cape. He put it around her shoulders, and she shivered when his hand touched her skin. \"Are you cold?\" he murmured, folding his arms around her from behind and drawing her back against his chest.\\n\\n Whitney could not drag a sound through her constricted throat. She was a roiling mass of shame, bewilderment, anger, and self-loathing.\\n\\n \"Surely I cannot have rendered you speechless,\" he whispered teasingly, his breath touching her hair.\\n\\n She spoke, but her voice was a strangled whisper. \"Please let go of me.\"\\n\\n He did not attempt to talk to her again until they drew up beneath the arched carriage entrance at the side of her house. \"Whitney,\" he said impatiently, grasping her arm when she opened the door and started to go inside. \"I want to talk to you. There are some things that should be understood between us.\"\\n\\n \"Not now,\" Whitney said tonelessly. \"Another time perhaps, but not tonight.\"\\n\\n Whitney lay awake until dawn, trying to understand the turbulent, consuming emotions Clayton was able to arouse in her; how he managed to take her in his arms and sweep away her plans and dreams of Paul, her sense of decency and honor.\\n\\n She rolled over, burying her face in her pillow. From this night forward, she would scrupulously avoid being alone with him again. Any future contact with him would have to be brief, impersonal, and public. Her mistake-and she would never, never make it again-was that she\u0027d enjoyed his company so much tonight, been so disarmed by his relaxed charm, that she had started thinking of him as her friend.\\n\\n Friend! she thought bitterly, rolling over onto her back and staring up at the canopy. A boa constrictor would make a more trustworthy friend than that man! Why, that lecherous libertine would try to seduce a saint in church. He would go to any lengths to make another conquest. The harder he had to try, the more difficult his prey made it for him, the better he seemed to enjoy it. And Whitney knew now, beyond a doubt, that she was his prey. He intended to seduce her, to dishonor her, and nothing was going to deter him from trying.\\n\\n For her sake, and for Paul\u0027s, the sooner their betrothal was announced, the better, because even Clayton Westland wouldn\u0027t dare to pursue a woman who was promised to another man. A man who happened to be an outstanding shot!\\n\\n Chapter Fourteen\\n\\n WHTTNEY SMOOTHED HER HAIR, CAST A LAST CRITICAL APPRAISAL over her soft green wool dress with white ruffles at the throat and wrists, then straightened the velvet bow which held her dark hair demurely caught at the nape of her neck. Her sleepless night had left shadows beneath her eyes, but otherwise she looked pretty and young and girlish. Not at all the sort, Whitney thought wryly as she turned away from the mirror, to plan to entrap a man with a falsehood designed to force him into declaring himself. Now--today. \\n\\n","sourceLink":"https://allnovel.net/whitney-my-love-westmoreland-saga-2/page-44.html","bookId":1804,"book":{"id":1804,"title":"Whitney, My Love (Westmoreland Saga #2)","description":"Storyline: Fresh from her triumphs in Paris society, Whitney Stone returns to England determined to win the heart of her childhood love. However, in order to save himself from ruin, her father has come to an arrangement with the arrogant Duke of Claymore, and Whitney is the price.\\n","cover":"https://allnovel.net/images/whitney-my-love-westmoreland-saga-2.jpg","author":"Judith McNaught","type":"Historical","source":"allnovel","link":"https://allnovel.net/whitney-my-love-westmoreland-saga-2.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:39:39 PM"}}
