{"id":82531,"no":56,"title":"Page 56","content":"\"He can give you everything . . . everything,\" her father rasped behind her. \"He\u0027s a duke, Whitney. You\u0027ll have everything you-\" \"A duke!\" Whitney scoffed contemptuously, glaring at Clayton. \"How did you manage to convince him of that, you lying, conniving . . .\" Her voice broke, and Clayton tipped her chin up, forcing her rebellious gaze to meet his. \"I am a duke, little one. I told you that months ago, in France.\" \"Why you . . . You Human Pestilence! I wouldn\u0027t marry you if you were the King of England.\" Jerking her head away, she hissed furiously. \"And I never had the misfortune to lay eyes on you in France.\" \"I told you I was a duke at a masquerade in Paris,\" he persisted quietly. \"The Armands\u0027 masquerade.\" \"You liar! I didn\u0027t meet you there. I had never met you until I came home!\" \"Darling,\" Aunt Anne said with gentle caution. \"Think back to the night of the masquerade. Just as we were leaving, you asked me if I could identify one of the guests-a very tall man with gray eyes, wearing a long black cloak and . . .\" \"Aunt Anne, please!\" Whitney expelled her breath in an uncomprehending rush of frustrated impatience. \"I didn\u0027t meet this man that night or any ...\" A strangled gasp emitted from Whitney as a kaleidoscope of images chased themselves across her mind. A pair of now familiar gray eyes glinted down at her in the Armands\u0027 garden. A deep voice tinged with laughter said, \"Suppose I told you that I am a duke. ..\" In the space of ten seconds, all these memories collided head on with the reality of the present, bringing her whirling around on Clayton in a tempestuous fury. \"That was you! That was you, skulking behind that mask!\" \"Without a quizzing glass,\" Clayton confirmed with a grim smile. \"Of all the treacherous, despicable, underhanded. . .\" Whitney ran out of words to express her turbulent animosity at approximately the same time another blinding realization dawned, bringing with it a fresh rush of scalding tears. \"My Lord Westmoreland\"-she spat his correct surname with all the contempt she could summon-\"I should like to inform you that I found the endless conversation about you this evening-about your estates, your horses, your wealth, your women-not just boring, but utterly nauseating!\" \"So did I,\" Clayton agreed sardonically. The amusement Whitney thought she heard in his voice was like acid on a burn. Clutching a fold of her dressing robe, she twisted it until her knuckles turned white, while she tried to drag enough air through the thick knots of emotion in her chest to speak. All she could manage was a painful constricted whisper. \"I\u0027ll hate you for this until the day I the!\" Ignoring her threat, Clayton said gently, \"I want you to go to bed now and try to get some sleep.\" He slid his hand under her elbow, tightening his hold when she tried to pull free. \"I\u0027ll come back in the afternoon. There are a great many explanations to be made, and I\u0027ll make them, when you\u0027re in a better frame of mind to listen.\" Not for one second was Whitney deceived by his pretense of tender concern. The moment Clayton finished speaking, she snatched her arm away and stalked to the door. As she reached for the brass handle, he added in a fiat, authoritative voice, \"Whitney, I expect you to be here when I arrive.\" Whitney\u0027s hand froze on the handle; her heart shrieked her resentment of his commands, his directives, his existence! Without so much as a backward glance to indicate she\u0027d heard, she wrenched the door open, barely restraining the wild urge to jerk the oak panel shut behind her with a crash. So long as they could hear her footsteps in the hall, Whitney walked slowly, refusing to give them the satisfaction of hearing her flee like a terrified hare. At the end of the hall she turned, her pace quickening with every step until she was rushing headlong, tripping on a stair, then running down the hall toward the safety, the sanity, of her room. Once inside it, she leaned against the door in a cold, trembling paralysis . . . staring at the cheerful, cozy room she\u0027d left so excitedly but a half hour ago, her mind unable to cope with the disaster that had just occurred. Downstairs in the study, the awful, ominous silence lengthened until even the air seemed to crackle with tension. Clayton stood with his hands braced against the fireplace mantel, staring into the fire with murderous rage emanating from every inch of his taut, powerful frame. Martin dropped his hands from his face so abruptly that his fists thudded against the desktop, making Anne jump. \"It was the liquor, I swear it,\" Martin whispered, his face ashen. \"I\u0027ve never raised a hand to her before. What can I do to . . .\" Clayton\u0027s head jerked around. \"What can you do?\" he snapped savagely. \"You\u0027ve done enough! She\u0027ll marry me, but she\u0027ll make you pay for what happened tonight and, in doing so, she\u0027ll make me pay as well.\" His tone changed, his words coming slowly, like uncoiling whips. \"From this night forward, no matter what she says, you are going to keep your mouth shut! Is that clear to you, Martin?\" Martin swallowed hard and nodded. \"Yes. Clear.\" \"If she tells you she\u0027s just put poison in your tea, you are going to drink it, and you\u0027ll . . . keep . . . your . . . goddamned . . . mouth . . shut!\" \"Yes. Shut.\" Clayton started to say more, then stopped, as if he could no longer trust himself to speak. With a curt bow to Anne, he strode swiftly to the door and jerked it open. He paused, his icy gaze swinging back to Martin. \"When next you\u0027re counting your blessings, give thanks to Almighty God that you have twenty years on me, for I swear that if you didn\u0027t-\" With a superhuman effort, Clayton bit off the rest of his threat and stalked from the room, his rapid footsteps echoing sharply down the hall. In front of the house, the coach lamps on the duke\u0027s carriage flickered and wavered in the breeze, conjuring eerie shapes that crept forward, then pirouetted away beneath the rustling, swaying branches of the elms that lined the drive. James McRae, Clayton\u0027s coachman, shifted patiently on his perch. All the guests had left, with only the duke remaining behind, but McRae didn\u0027t mind waiting. In fact, he could not have been more pleased that his master was prone to linger in Miss Stone\u0027s company, for he had wagered a rather large sum of money with Armstrong, the duke\u0027s valet, that Miss Stone was destined to be the next Duchess of Claymore. The front door of the house opened and the Duke of Claymore bounded down the front steps. From the corner of his eye, McRae observed the duke\u0027s long, ground-devouring strides, which were eloquent of either rage or exhilaration. McRae wasn\u0027t certain which, nor did he think it much mattered; so long as Miss Stone continued to provoke such unprecedented emotional reactions in the duke, the odds continued to grow in McRae\u0027s favor.","sourceLink":"https://allnovel.net/whitney-my-love-westmoreland-saga-2/page-56.html","bookId":1804,"book":{"id":1804,"title":"Whitney, My Love (Westmoreland Saga #2)","description":"Storyline: Fresh from her triumphs in Paris society, Whitney Stone returns to England determined to win the heart of her childhood love. However, in order to save himself from ruin, her father has come to an arrangement with the arrogant Duke of Claymore, and Whitney is the price.","cover":"https://allnovel.net/images/whitney-my-love-westmoreland-saga-2.jpg","author":"Judith McNaught","type":"Historical","source":"allnovel","link":"https://allnovel.net/whitney-my-love-westmoreland-saga-2.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:39:39 PM"}}
