{"id":82543,"no":69,"title":"Page 69","content":"\"I knew her. She did not know me.\"\\n\\n \"And you automatically assumed that once she learned of your wealth and title, she would naturally consent,\" Dr. Whitticomb speculated, his eyes dancing with amusement. The duke\u0027s quelling frown temporarily silenced him. \"Who,\" he asked as a sudden, unsettling recollection struck him, \"is Paul Sevarin?\"\\n\\n Clayton scowled. \"Why do you ask?\"\\n\\n \"Because I stopped in the village this afternoon after seeing Miss Stone, and spoke with the apothecary. He\u0027s a chatty fellow-the sort who tells you everything you didn\u0027t ask before he answers a simple question, and follows that with half a dozen questions of his own. Eventually he discovered the name of my patient, and he said some things which at the time I dismissed as nonsense.\"\\n\\n \"Such as?\"\\n\\n \"Such as the fact that this Sevarin has been dangling after Miss Stone in earnest, and the village seems to be hanging on tenterhooks in expectation of a betrothal announcement. They seem to think the betrothal has already been arranged, and is entirety pleasing to Sevarin and your future wife.\"\\n\\n \"Frankly,\" Clayton drawled, \"I don\u0027t give a blessed damn.\"\\n\\n \"About the gossip?\" Hugh Whitticomb persisted carefully. \"Or about Sevarin? Or about the girl?\" When Clayton didn\u0027t answer, Hugh leaned forward and asked bluntly. \"Are you, or are you not, in love with that young woman?\"\\n\\n \"I am going to marry her,\" Clayton said stonily. \"What else is there to say?\" With that, he bid his guest good night and in four long strides, quit the room, leaving Hugh Whitticomb gazing at the fire in amazed alarm. After a moment, however, the physician\u0027s expression cleared. He began to chuckle and then he laughed aloud. \"God help him.\" He chortled. \"He doesn\u0027t realize he loves her. And even if he did, he wouldn\u0027t admit it.\"\\n\\n In his small bedroom, Clayton jerked off his jacket, flinging it onto a chair. His waistcoat followed. Loosening the top buttons of his shirt, he stalked over to the window and jammed his hands into his pockets.\\n\\n He was furious that the villagers believed a betrothal had already been arranged. True, he had wanted Whitney to have the satisfaction of showing them that she could make Sevarin pursue her, but he had never dreamed things would go this far. Whitney had never been betrothed to any man but him, and he would not allow anyone to think otherwise. She didn\u0027t love Sevarin, regardless of what she thought. She simply had some idiotic notion, some girlish dream, of winning him away from the Ashton girl.\\n\\n She didn\u0027t love him either, but Clayton wasn\u0027t concerned about that. \"Love\" and all the obsessive behavior associated with it, was an absurd emotion. He was amazed that Hugh\\n\\n Whitticomb had mentioned the word to him tonight. No one in his set ever professed to feeling anything stronger than a \"tendre\" or a lasting attachment even for their spouses. Love was a silly, romantic notion that had no place in his life.\\n\\n Much of his anger evaporated as he considered the last few hours with Whitney. He could sense that she was slowly yielding to him. She had sought the comfort of his embrace of her own accord, and she had even admitted to a fondness for him. All that really stood between them now was her fading absorption with Paul Sevarin, and her understandable resentment over the way her stupid father had told her of her betrothal to Clayton. Just thinking of that night infuriated Clayton. Because of Stone\u0027s callous insensitivity, Clayton had been deprived of the pleasure of courting and winning Whitney. Despite its turbulent ups and downs, he had been enjoying his bizarre courtship, including Whitney\u0027s haughty rejections. She made him work to gain an inch, but each gain was a heady victory, more meaningful because it was so hard-won.\\n\\n Yet there were times lately when his patience almost lost out in the battle against his desire. When she sniped at him and sparred with him, it took his last ounce of restraint not to snatch her into his arms and subdue her rebellion with his hands and mouth. He was neglecting his estates and his business interests, yet just when he decided that she would have to accustom herself to their betrothal after they were married, she\u0027d look at him with those unbelievably green eyes of hers, and he could not quite bring himself to exert the power he held over her by forcing her to marry him.\\n\\n Sighing, Clayton turned away from the window. Not for a moment did he ever doubt that Whitney would marry him. She would marry him either willingly, or unwillingly. In the latter case, the balance of their courtship and combat would have to take place in his bed.\\n\\n Chapter Twenty\\n\\n FRESH, COOL BREEZES SCENTED WITH THE INVIGORATING AROMA of burning leaves floated into Whitney\u0027s room, and she sniffed appreciatively as she stepped from her bath. Wrapped in a dressing robe, she went over to the open window and perched her hip upon the sill. Autumn, that most glorious of all the seasons, greeted her with a golden morning. She gazed out across the topaz and ruby landscape splashed with yellow and amber, and she tingled with the exuberant optimism she always felt at this time of year.\\n\\n Reluctantly, she left the window and deliberated over the matter of clothing, finally choosing a high-waisted gown of dusky pink wool with a square neckline, long narrow sleeves, and a wide flounce at the hem. Clarissa pulled her hair straight back and up, then wound it into curls entwined with velvet ribbons of the same muted pink as her dress.\\n\\n Thoughts of Paul and her unwanted betrothal to Clayton hovered uneasily at the back of her mind, but Whitney refused to dwell on them. Tonight she could agonize over her confused status, but for now, she was eager to be out in the sunshine. Nothing was going to spoil the perfection of such a gorgeous day.\\n\\n At five minutes past eleven, a servant tapped at the door and announced that Mr. Westland was waiting downstairs. Snatching up the printed shawl which matched her dress,\\n\\n Whitney hurried downstairs. \"Good morning,\" she said gaily. \"Isn\u0027t it a beautiful day?\"\\n\\n Clayton took her hands in his and gazed down at her glowing features. Quietly and without emphasis, he said, \"You have a smile that could light up a room.\"\\n\\n It was the first time he had ever remarked on her appearance, and although his compliment was much milder than the lavish ones the Frenchmen had heaped on her, it made Whitney feel unaccountably shy. \"You are late,\" she admonished him with laughing severity, unable to think of anything else to say, \"and I have been pacing the length of my bedchamber these past five minutes, waiting for you.\"\\n\\n He said nothing, and for a moment Whitney fell under the spell of those boldly seductive gray eyes. His hands tightened on hers, drawing her closer. She held her breath, excited and alarmed at the realization that he was going to kiss her. \\n\\n","sourceLink":"https://allnovel.net/whitney-my-love-westmoreland-saga-2/page-69.html","bookId":1804,"book":{"id":1804,"title":"Whitney, My Love (Westmoreland Saga #2)","description":"Storyline: Fresh from her triumphs in Paris society, Whitney Stone returns to England determined to win the heart of her childhood love. However, in order to save himself from ruin, her father has come to an arrangement with the arrogant Duke of Claymore, and Whitney is the price.\\n","cover":"https://allnovel.net/images/whitney-my-love-westmoreland-saga-2.jpg","author":"Judith McNaught","type":"Historical","source":"allnovel","link":"https://allnovel.net/whitney-my-love-westmoreland-saga-2.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:39:39 PM"}}
