{"id":97904,"no":53,"title":"Page 53","content":"I hoped things would get better once the tour started. Once he had work to focus on. They haven’t. They’ve got worse. He keeps disappearing off on his own, sometimes even without Dave. When I question him as to where he’s been, he says he’s just been having time out to clear his head. Basically, he’s out scoring drugs. Jake’s distanced himself from me. From everyone. He only talks to bark out orders to staff on the tour. And the only time I see him resembling something near to the Jake I know, is when he’s on stage performing at the shows. But the minute he’s off stage, he’s back to the same. He’s pushing everyone around him away, and I haven’t got a clue what to do. How to help him. I feel completely out of my depth. And so very helpless. Helpless to the fact that the man I love is slowly slipping away before my eyes. I’ve considered calling his sponsor, even his drug counsellor, but I feel like I’d be crossing some arbitrary line if I do. I just feel at a loss. You have no idea how hard it is to try to hold onto someone when they don’t want you to. I’ve tried talking to him. He won’t talk to me. He brushes me off, telling me there is nothing wrong. There clearly is. The story coming out about what he suffered at the hands of his dad that night was the final nail in the coffin for him. He could just about cope with Paul dying and the old memories and feelings that resurfaced for him, but this story coming out was too much. I know he feels like he’s been exposed to the world as the weak man he truly believes himself to be. It’s crippled him, and the only way he knows how to deal with that emotion is to conceal it with drugs so he no longer has to feel. The flip side of that, which he doesn’t see, is that he stops loving too. He’s stopped loving me on some fundamental level. It’s still there, buried somewhere deep within him. But for now, this Jake I’ve got here with me, doesn’t love me. Not really. And it’s not because he doesn’t want to, but because he can’t. So now it’s up to me to try to find a way to bring him back. I think he started using again around the time the tour began here in the US. On some level I think I knew, I just didn’t want to believe it. But now it’s become too hard to ignore. He went to take a shower this morning and when he came out of the bathroom, I looked up at him and there was blood running from his nose. That’s when I knew what he’d been doing in there. He downplayed the nosebleed. Said it was just because he was tired and stressed. After I’d cleaned his bleed up, I went in the bathroom looking for evidence of drugs but I couldn’t find any. He’s adept at hiding his addiction. Now I just need to figure a way to out it. “What do I do?” I ask Stuart, dropping my spoon onto the table. “Confront him.” “Will he deny it?” “Absolutely.” “Then what?” “Keep trying. But, Tru, he won’t recognise the problem until he’s ready to – you need to know that, and be ready for the backlash that will undoubtedly come with it when you do confront him.” I put my head in my hands. “I just can’t believe he’s back there again.” I lift my head. “This must be terrible for you, seeing him doing this to himself again … he told me what happened in LA … when you found him,” I allude to the rest with my expression. “I’m glad he told you. It shows how much he trusts you.” “Will you leave him now?” Stuart looks at me surprised. “No. Why do say that?” I knot my fingers together around the coffee cup. “Because Jake said you told him at that time if he carried on using you would leave, and I just thought as he is again … then maybe you would leave.” I don’t think Jake would cope without Stuart. Honestly, I don’t think I could cope without him. I’ve come to rely on his friendship so much in these last few weeks. He shakes his head, smiling. “I’d never leave him. I like the perks too much.” He rolls his eyes, ironic. “Jake’s like my family, just like you are now, chica.” He reaches over and squeezes my hand. My eyes fill with tears. “It was just an empty threat.” “That worked,” I say blotting my eyes with a napkin. “Yeah, but he was also ready by that point. He knew it, as much as I did.” “Is that what I should do? Threaten to leave him.” He shrugs. Leaning back in his chair, he pushes hair off his forehead. “Anything is worth a shot, but Jake will only get clean if he truly wants to … he loves you like no one before. I see the bond you guys have, so maybe the threat of you leaving might shock him into it. I know getting you back in his life meant everything to him. Maybe the thought of losing you again might just push him in the right direction.” “But what if …” I pause, swallowing against my own words, eyes down, I tap my fingernails on the table. “What if I threaten to leave him, and he still won’t stop using?” Stuart leans forward, closer to me. “Well, honey, before you do anything you have to decide if that’s the chance you want to take. The possibility of losing him. I don’t think you would ever lose Jake permanently, but temporarily? Maybe, yes, it could happen, if he’s not ready to face his problem yet.” I don’t want to lose Jake. Not at all. Not even for a moment. But I don’t want this version of him either. “I already lost my Jake the moment he took his first hit,” I sigh, lifting my eyes to meet Stuart’s. “And if I have any hope of trying to get him back, then I’m going to have to confront this version of him, and simply go from there, no matter what happens.” The second I get back to our suite at the Ritz, I instantly know something is wrong. I can practically feel Jake’s tension radiating through the air as I push open the door. “Where the fuck have you been?!” He’s on me the instant I’m through the door. “Don’t you answer your goddamn cell anymore?!” I sigh inwardly. Here we go again. “Hello to you too,” I bite. “I’m not fuckin’ kidding, Tru.” “Neither am I.” I give him a hard stare as I walk past him. Getting my phone from my bag I see I have ten missed calls and five voicemails. “I was out having coffee with Stuart,” I say putting my phone back in my bag and dropping it onto the table. “I called him too and he didn’t answer – why not?” “I don’t know, I’m not a mind reader. Maybe because he was out with me? Maybe because it’s his day off? Why don’t you ask him?” I turn around to see Jake pacing the floor, anger clear on his face. I don’t know what’s wrong with him right now, but it seems we are going to have to get past whatever this is before I can have the drugs talk with him. “Baby, what’s wrong?” I ask, walking toward him, hands out. I’m trying the soft, tactical approach; it’s the only way with him at the moment. Jake can be irrational at times. Drug taking Jake – always irrational. “This is what’s wrong.” He marches away from me, leaving me dead in my tracks, and goes over to the desk, grabs an envelope off it and marches back, shoving it in my hand. “What’s this?” I look down at it confused. “Open it the fuck up, and then you can answer me the very same question.” I stare across at him puzzled, then back down at the envelope. Okay, so whatever it is has got him majorly pissed off. Apprehensively, I peel the seal back on the envelope, reach in and put my fingers around what feels to be photos. Yep, it’s photos. Photos of me and Will from Callo’s that last day I saw him. One is of Will and me sitting across the table from one another, the next – Will holding my hand across the table, and the last, a photo of Will and me hugging outside of Callo’s. I look up at Jake. “Where did you get these?” “Are you fucking him?” I feel like he’s just slapped me. “No.” “I don’t believe you.” “Believe what you want, it’s the truth.” I drop the photos onto the coffee table, along with the envelope. “Did you have me followed?” “No. Do I need to?” I glare at him. “The press sent them,” he fires at me. “They’re running a story that you’re having an affair with him.” I snort at the ridiculousness of it. “You find something funny about this?” He stares at me with glassy eyes. He’s high right now. And he’s also not amused. Well guess what Jake, neither am I. “I’d say so, yeah.” I drag my hands through my hair. “The press are about to accuse me of having an affair with Will – the man who was the one wronged because I had an affair with you. It’s beyond ludicrous! We can’t let this happen. We have to tell the press the truth – and I need to call Will and warn him about this.” I get my phone out of my bag ready to make the call, but Jake lunges forward and grabs it from my hand. “You’re screwing around with him, and you’re going to call him here in front of me!” he yells. “Jake, I’m not cheating on you with Will. Barring the fact that I would never do that to you, when exactly would I do so? I’m with you all the time. And I’m also here in the US, and Will is in the UK. Seriously, please just see sense here, and give me my phone back.” I hold my hand out to him. “You’re not calling him, Tru.” “Give. Me. My. Phone. Back.” “No!” he yells, and throws my phone clear across the room and all I can do is watch as it smashes to pieces against the wall. “Have you lost your mind?!” I cry, hand clutching my head. “Jesus Christ, Jake! Who is this version of you?! I feel like I don’t even know you anymore!” I go over to where my broken phone lays, crouching down, I pick the pieces up and hold them together like I can somehow repair it. Staying there for a few moments, I take some deep breaths before speaking again. “Whatever issue you have with Will,” I state calmly standing, putting down the remnants of my shattered phone onto the table – poor Adele. “He’s done nothing wrong and it’s only fair to warn him if he’s about to get screwed over in the press. He’s got a career to think about. Surely you can understand that.” Jake stares at me for a long moment, his chest rising and falling heavily. “I’ll get my lawyers to bury the story.” “You can do that?” I feel a huge sense of relief. I don’t want Will getting any more hurt than he has been, and if Jake can stop it then all the better. “I can do anything I want.” I hate it when he’s arrogant like this.","sourceLink":"https://allnovel.net/the-mighty-storm-the-storm-1/page-53.html","bookId":1998,"book":{"id":1998,"title":"The Mighty Storm (The Storm #1)","description":"Storyline: The Mighty Storm (The Storm #1) It\u0027s been twelve years since Tru Bennett last saw Jake Wethers, her former best friend and boy she once loved. Jake Wethers, sexy, tattooed and deliciously bad lead singer, and brains behind The Mighty Storm, one of the biggest bands in the world, left Tru with a broken heart when he moved from England to America with his family when they were both fourteen. Sent to interview Jake for her music column by the magazine she works for, they are both unprepared for the sparks that fly the instant they reconnect. Only, there’s a complication to their instant feelings for one another—Will, Tru’s boyfriend of two years. Then Jake makes Tru a job offer she can\u0027t refuse—travelling the world with him and his band. But taking the job means leaving Will behind, and being on the road with the band means spending an inordinate amount of time with Jake. Is Tru strong enough to resist the delectable bad boy who once held her heart so completely, or will she willingly risk it all for one night with the world\u0027s most notorious womanizer?","cover":"https://allnovel.net/images/the-mighty-storm-the-storm-1.jpg","author":"Samantha Towle","type":"Romance","source":"allnovel","link":"https://allnovel.net/the-mighty-storm-the-storm-1.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 6:29:01 PM"}}
