{"id":82302,"no":6,"title":"Page 6","content":"\"Thought I\u0027d warn you. The boss is on the warpath.\"\\n\\n Yanked from her thoughts by that familiar Brit voice, Taryn glanced up to find Roman Lyons poking his head into her office. She lowered her pen to her desk.\\n\\n \"Guthrie?\"\\n\\n \"No. The younger Mr. Hunter. Grapevine says he\u0027s headed this way.\"\\n\\n Sending a fortifying wink, Rowan bowed off for the relative safety of his own office while, holding her swooping stomach, Taryn siphoned down a breath.\\n\\n Remarkably, after the wine incident last night, she and Cole had parted on amicable terms. Back here to collect her car, once again she\u0027d offered to pay his laundry bill. Cole had declined then had said in a low sure voice that they\u0027d talk more tomorrow. Well, tomorrow was here and, unlike her normal self, Taryn was positively shaky.\\n\\n Discussing recipes on the drive back from the restaurant, she\u0027d given the impression that she\u0027d regained her customary cool, but remaining composed whenever Cole Hunter was around was more difficult than killing a blaze with a thimble of water. She\u0027d barely slept for planning how best to handle this, their next meeting. Tossing and turning, she\u0027d imagined a score of different scenarios, and each dreamed-up conversation had included her witty but also upbeat remarks. She\u0027d decided. She wasn\u0027t throwing in the towel just yet.\\n\\n Now every one of those let\u0027s-try-to-get-along phrases flew like buckshot from her mind as Cole\u0027s larger-than-life self strode into the room. This morning he looked broader, darker and, dammit, hotter than any man had a right...like an almighty tropical storm rolling in from the sea. Pressing back into her chair, Taryn quivered and spoke before she thought.\\n\\n \"You\u0027re always doing that.\"\\n\\n \"Doing what?\"\\n\\n \"Thundering around.\"\\n\\n The black slashes of his brows hiked up. \"Well, good morning to you, too.\"\\n\\n Taryn bit her lip to stop from telling him not to look at her that way - as if she was hard work when, in fact, she only wanted to get along and move forward. But, no matter how he pressed her buttons - and he seemed to press every one - her survival here at Hunters depended on making a monumental effort. Which meant reclaiming her biggest asset - her poise - and being hospitable as well as professional. In other words, she needed to present herself the way she would in any person\u0027s company other than the Commander\u0027s.\\n\\n Willing her locked muscles to relax, Taryn resumed her calm and asked, \"Have you had breakfast?\" She reached for a food container, which waited strategically on her desk, and pried back the plastic lid. \"Scones,\" she told him. \"Homemade fresh this morning.\"\\n\\n Curious, he craned to see. \"Is there pumpkin involved?\"\\n\\n \"But no pine nuts.\" She found her feet. \"I was about to pour a coffee. Want one? I brought in my own percolator. I\u0027m more your slow, full, satisfying type than an instant kind of girl.\"\\n\\n \"Slow and satisfying. Who\u0027d have guessed?\"\\n\\n On her way to the percolator, she stopped and caught his look. But her comment wasn\u0027t meant to be provocative. She\u0027d been talking about hot drinks, for God\u0027s sake, not sex. Before she could qualify or downplay her remark, Cole went on.\\n\\n \"So you\u0027ve made yourself at home,\" he said, looking around.\\n\\n She burned to say, And why not? This was her office until Guthrie said otherwise. Which reminded her.\\n\\n She lifted the pot. \"Have you spoken to your father yet?\"\\n\\n \"I haven\u0027t been able to track him down this morning.\"\\n\\n \"He\u0027s off the station?\"\\n\\n \"I have no idea where he is.\"\\n\\n China cup full, she glanced over and was taken aback. Cole\u0027s assured expression had been replaced by a mask of worry. She hadn\u0027t thought he had any vulnerabilities, or none that he\u0027d be prepared to show. Maybe it was inappropriate, but she wanted to ask him what was wrong.\\n\\n But then that expression evaporated and, drawing himself up tall, he told her, \"No coffee, thanks. And no scones.\"\\n\\n Before he could say anything more - like, for instance, \"I\u0027m only here to tell you to pack your stuff and shove off\" - Taryn revved her \"perfect employee\" enthusiasm back up to high.\\n\\n \"I\u0027ve been going through my notes again, making phone calls. I\u0027d like to do a full survey of Hot Spots\u0027 first destination.\"\\n\\n \"Why would I approve a survey when I haven\u0027t approved the show?\"\\n\\n \"Because you have nothing to lose. I\u0027ll pay for airfares. Accommodation is sorted, no cost.\"\\n\\n \"And who do you propose to take along with you on this survey - if I approve?\"\\n\\n \"I don\u0027t need anyone else. I know what to look for in locations and angles.\"\\n\\n \"Wouldn\u0027t it be prudent to take a cameraman so I could look over footage later? If - \"\\n\\n \"If you approve,\" she finished before he could. She didn\u0027t need reminding again. \"If it\u0027s a deal-breaker, I\u0027ll pay for a coworker\u0027s fare, as well.\"\\n\\n \"Of course, it could save time and trouble if I simply came along and checked out the location for myself.\"\\n\\n Taryn\u0027s heart jumped to her throat and then she remembered to breathe. But of course, with that menacing smile playing around the corners of his lips, Cole was only testing. Wanting her to rear up and give him a reason to be even more negative. He could toss on all the heat he could muster. She would neither wither into a quivering mess nor self-combust with indignation. She refused to let him get under her skin like he had last night.\\n\\n Rather, she called his bluff.\\n\\n \"Sure.\" She wound her arms over her high-waisted black skirt and pegged out a leg. \"If you want to come along, why not?\"\\n\\n His gaze sharpened. \"You want me to go?\"\\n\\n \"It was your suggestion.\"\\n\\n Cole felt his grin grow. One thing he could say for Taryn Quinn - she wasn\u0027t a quitter. She had her teeth in here and she\u0027d do anything not to let go. Of course, there would be no survey because, after her rushed effort last night, as soon as he got it straight with his father, Taryn\u0027s contract would be terminated and she\u0027d be out the door. Business was business. His objective was to keep Hunter Broadcasting healthy - afloat and viable - even if he didn\u0027t always feel like a hero doing it.\\n\\n His phone sounded with a message. Guthrie was in and wanted to see him straightaway. Cole wanted to see Guthrie, too, about Taryn but also for a catch-up regarding the most recent murder attempt. He\u0027d been worried when Guthrie hadn\u0027t been home last night. More worried still when he hadn\u0027t been in the office this morning. He\u0027d left messages but had gotten no reply.\\n\\n He slotted his phone away and headed out. \"We\u0027ll talk more about this later.\"\\n\\n She sang back, \"I\u0027ll be here.\"\\n\\n Leaving Taryn, he headed for his father\u0027s office. Midway down that long connecting corridor, Cole noticed two assistant producers deep in conversation. He heard Taryn\u0027s name mentioned before they saw him. Talk ceased and they ducked off down an adjoining hall.\\n\\n Everyone here knew belts were drawn tight. Most would also know about his lack of interest in certain types of shows and that the new kid on the block was touting just that kind of proposal. She might have gotten past Guthrie, but Cole wouldn\u0027t be surprised if bets were on, speculating on how soon her ax would fall. He hoped Taryn\u0027s ears weren\u0027t burning.\\n\\n When he entered his father\u0027s office, Guthrie was sitting behind his desk, studying a spreadsheet. At the far end of the room, a tall, suited man Cole had never met before took in the harbor views. As the man turned to face him, Guthrie moved from behind his desk to the more casual area of his office. At a circle of tub chairs, Guthrie took a seat and introduced Cole to Jeremy Judge, his personal bodyguard.\\n\\n Eyes on the stony-faced man, who was a private investigator as well, Cole folded down into the chair alongside his father\u0027s.\\n\\n \"Please take a seat, Mr. Judge.\"\\n\\n Judge sent Cole a thin-lipped smile. \"I spend too much time sitting around. In cars. Park benches. Surveillance work, you know. I prefer to stretch my back when I can.\"\\n\\n No mistaking - Jeremy Judge had a vigilant air. Cole wasn\u0027t sure he\u0027d blinked once.\\n\\n Looking relieved but weary, Guthrie crossed his legs. \"I\u0027m happy to say Jeremy has successfully tracked down the man responsible for the attempts on my life.\"\\n\\n Cole sat straighter. Well, that was fast. \"I hope he\u0027s under arrest.\"\\n\\n \"Last time I saw,\" Judge said, \"he was under a car. While I was escorting your father home around seven, we were fired upon.\"\\n\\n \"I\u0027d dropped in to see your uncle,\" Guthrie explained.\\n\\n \"Uncle Talbot?\" His father\u0027s older brother? \"I can\u0027t remember the last time you \u0027dropped in\u0027 on him.\"\\n\\n The brothers hadn\u0027t spoken in years. Cole wasn\u0027t even sure what the problem was about anymore.\\n\\n \"We\u0027re different as chalk and cheese, but when we were younger, Talbot and I were close,\" Guthrie said. \"I felt the need to catch up.\"\\n\\n Cole absorbed his father\u0027s words. When someone\u0027s life was in danger, guess they\u0027d feel compelled to sort out past differences with people who should matter...just in case.\\n\\n \"As Mr. Hunter moved to enter the car, two shots rang out,\" Judge said. \"I pursued the gunman on foot. He panicked and ran in front of traffic.\"\\n\\n Cole sized up Judge, and the situation. \"A rather clumsy assassin, wouldn\u0027t you say?\"\\n\\n \"Clearly,\" Judge said, \"he didn\u0027t anticipate the chase.\"\\n\\n \"Which hospital was he taken to?\" Cole asked.\\n\\n \"Head injuries were extensive,\" Judge said. \"He died before paramedics got to the scene.\"\\n\\n Cole cleared the sudden blockage in his throat. Had he heard right? Just like that, the guy had been creamed and this god-awful drama was over?\\n\\n But of course this episode was far from finished. A stack of questions needed answers. The most obvious - why? Again Cole spoke to Judge.\\n\\n \"I suppose now your work truly begins.\"\\n\\n \"To dig into his background, the motives, whether he worked alone.\" Jeremy Judge nodded his long chin. \"My first priority\u0027s to obtain the police report.\"\\n\\n \"We\u0027ll need a lawyer.\"\\n\\n \"It\u0027s cut-and-dried, son,\" Guthrie said.\\n\\n Cole rapped his knuckles on the chair arm. He wanted to believe this problem was over. But this all seemed too quick. Too neat. And yet Judge looked so assured and his father so relieved. Hell, maybe he was too close to this situation to see this ending as the blessing it truly was. Still, he\u0027d feel a whole lot better when this would-be killer\u0027s motives were revealed. No reason he shouldn\u0027t bring in the reserves.\\n\\n Brandon was contacting him today regarding the Eloise tail, which he wouldn\u0027t call off just yet. And no reason Brandon shouldn\u0027t help Judge mop up.\\n\\n \"A good friend owns a security firm,\" Cole told Judge, reaching to find his wallet and a card. \"I\u0027ll give him a call, you two can team up and - \"\\n\\n Guthrie cut in. \"No need. Jeremy has this under control.\"\\n\\n Judge\u0027s lips peeled back in a got-this-covered smile before he headed for the door. \"I\u0027ll be in touch, sir. Good meeting you, Cole.\"\\n\\n When Judge had left the room, Guthrie exhaled. \"I can\u0027t describe the weight lifted. When you get to my age, you don\u0027t need those kinds of troubles.\"\\n\\n Having someone hunting you down would not be pleasant. Thank God, he didn\u0027t know about his wife\u0027s antics. That\u0027d kill him for sure.\\n\\n Guthrie dabbed his forehead with a handkerchief. \"Now on to more pleasant matters.\" He slotted the cloth away. \"How are you and our new producer getting along? Moving forward?\"\\n\\n Cole hesitated. He wanted to give it to his father straight. He still wasn\u0027t good with Guthrie hiring Taryn Quinn without passing it by him first. Investment in any show was a huge commitment. Only surefire hits got the green light to go into production. Given the overseas hiccups - the strain on Hunter\u0027s reputation thanks to Dex\u0027s escapades and Wynn missing some plum opportunities - big brother had to watch the bottom line more closely than ever before.\\n\\n But Cole swallowed the words. He imagined Taryn\u0027s big hopeful eyes then drank in his father\u0027s relaxed face again and his stomach muscles kicked.\\n\\n \"Taryn and I have been...talking,\" Cole finally said.\\n\\n Leaning across, Guthrie clasped his son\u0027s forearm. \"I should have consulted with you first. You know I value your opinion above all others. But I like this lady\u0027s style and I wanted to nab her before anyone else could. I have a good feeling about this.\" Guthrie pushed to his feet, looking taller - and stronger - than he had in weeks. \"Keep me in the loop.\"\\n\\n Cole left his father\u0027s office battling a mix of emotions. He was glad that murderous SOB who\u0027d been trailing Guthrie was out of commission - if, indeed, that was the end of it. As far as Guthrie\u0027s opinion of Taryn Quinn and her show were concerned... Cole loved to see his father happy, but could he go against instinct and give Taryn\u0027s show a bit more rope? In the long run, cutting her free now would be kinder. He couldn\u0027t afford to spend good time and money on a project he didn\u0027t believe in, even if the producer herself intrigued him. It simply didn\u0027t make good business sense.\\n\\n Down the corridor those assistant producers were back, clustered at the watercooler. Four others had joined them. They were so deep in conversation, no one saw him coming. Drawing closer, he overheard snippets:\\n\\n \"...haven\u0027t bothered to introduce myself.\"\\n\\n \"Bet she\u0027ll cry when he terminates...\"\\n\\n \"...heard she\u0027s coming on to him now. Sucking up big-time.\"\\n\\n There were few secrets in this building. Cole Hunter had his hatchet out. Taryn Quinn\u0027s days were numbered. Logic said why waste time getting to know a newbie when she\u0027d be history next week anyway?\\n\\n That half dozen at the cooler spotted Taryn moving from her office down the corridor. She sent them a friendly smile. When all but two looked away, pretending not to see, Cole\u0027s chest squeezed and the back of his neck went hot. Then the mob saw the boss strolling toward them. Women\u0027s eyes rounded, men cleared their throats, and one or two muttered a hasty hello.\\n\\n Cole strode right past and up to Taryn. Loud enough for all to hear, he asked, \"When are you booking this location survey?\"\\n\\n Taryn looked sideways, as if he might be drunk or fevered. Then she shook herself and replied.\\n\\n \"I was thinking weekend after this.\"\\n\\n Feeling six pairs of eyes and ears upon them, Cole nodded. \"Sort out expenses with accounts.\"\\n\\n Taryn took a few seconds to respond with a shaky smile. \"Sure. I\u0027ll do it straightaway.\"\\n\\n \"That\u0027s expenses for two.\"\\n\\n \"A cameraman?\"\\n\\n \"You and me.\"\\n\\n Some of the color drained from her cheeks. \"You really want to go?\"\\n\\n His reply was a curt nod. Then he headed off toward his office, but at a reduced pace. He wanted to hear the introductions as Taryn met with that watercooler crowd. There was even a smattering of laughter.\\n\\n He wouldn\u0027t think about the potential mess he\u0027d gotten himself into or the hope he\u0027d given Taryn Quinn. He couldn\u0027t remember the last time he\u0027d acted impulsively like that. If he didn\u0027t feel so good about it, if he couldn\u0027t imagine Taryn\u0027s smile right now, he\u0027d be disappointed in himself. \\n\\n","sourceLink":"https://allnovel.net/losing-control-the-hunter-pact-1/page-6.html","bookId":1866,"book":{"id":1866,"title":"Losing Control (The Hunter Pact #1)","description":"Storyline: Losing Control \\n The Hunter Pact #1) \\n \"You\u0027ll be working for me.\"Taking charge comes naturally to workaholic media mogul Cole Hunter. That includes dealing with headstrong TV producer Taryn Quinn. Cole may not like her idea for a travel show, but Taryn intrigues him. Enough for Cole to join her on a location-scouting trip to an isolated Pacific island, despite the family drama at home. Soon the tantalizing Taryn makes Cole forget about everything...except making love to her in the moonlight. But once reality intrudes, will he risk losing all he\u0027s worked for to keep this woman in his life?\\n","cover":"https://allnovel.net/images/losing-control-the-hunter-pact-1.jpg","author":"Robyn Grady","type":"Romance","source":"allnovel","link":"https://allnovel.net/losing-control-the-hunter-pact-1.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:42:36 PM"}}
