{"id":34983,"no":9,"title":"A WAR OF EXTERMINATION.","content":"Some of the barbarous features of the Revolutionary War in Georgia have been briefly noted. History has turned her eyes away from the more horrible details; but by reading between the lines, and taking advantage of the hints and suggestions, it is not hard to get a tolerably fair idea of the methods that were pursued on both sides. Even Colonel Charles C. Jones, jun., whose \"History of Georgia\" is thus far the most complete that has been written, touches lightly on the cruelties practiced in the efforts of the British and Tories to wrest Upper Georgia from the control of the Americans. There are matters that History cannot deal with and maintain her dignity. There can be no doubt that the British and the Tories began their cruelties without considering the results to which their acts would lead. It is an easy matter at this late day to see how naturally the war, in the region tributary to Augusta, degenerated into a series of crimes and barbarities foul enough to cause History to hold her hands before her eyes. When Colonel Campbell, assisted by Colonel Brown, advanced to attack Augusta, it was the only American post that had not surrendered to the King\u0027s men, and its capture would complete the subjugation of Georgia from a military point of view. The city fell without a struggle, and the American forces retreated across the river. It was natural that the British, and the Tories who were acting with them, should take advantage of this victory to bring the whole region above and around Augusta to terms. The sooner this was done, the sooner would all Georgia be restored to her relations with his Majesty George III. No time was to be lost. Therefore Colonel Campbell, the British commander, tarried in Augusta but a few days. He left Colonel Brown in charge, and marched in the direction of Wilkes County. Those of the inhabitants who had Tory sympathies were to be encouraged; but those who were disaffected were to be dealt with summarily, so as to put an end, at once and forever, to the disloyalty that had been active in that region. This plan was carried out promptly and violently. The severest punishment was the portion of those who refused to take the oath of allegiance. Plunder and the torch were the portions of those who chanced to be away from home, fighting for their country. Their helpless wives and children were left homeless, and destitute of provisions. Fortunately a great many stanch Liberty Boys had carried their families, their household effects, and their cattle, into South Carolina as soon as they heard of the fall of Augusta; but many had remained at home, and the sufferings of these were severe. Another explanation of the extreme cruelty with which the war in Upper Georgia was waged after the fall of Augusta, was the fact that Colonel Brown, who had been left in command by Colonel Campbell, had some old scores to settle. At the very beginning of the struggle he had been arrested in Augusta by some of the Liberty Boys, tarred and feathered, and paraded through the public streets, on account of his outspoken loyalty to the King. Still another reason was the fact that Daniel McGirth, who had been maltreated by an American officer, was among the officers who had accompanied Colonel Brown. McGirth held every American responsible for the treatment he had received, and he spared few that fell into his hands. Thus, between the anxiety of the British to conquer Georgia completely, and the desires of Brown and McGirth to revenge themselves, the Americans in Upper Georgia were made the victims of the most inhuman barbarities. The Americans under Elijah Clarke lost no time in retaliating, and thus was begun a contest that may be aptly described as a war of extermination. Clarke was enabled to defeat the British and the Tories wherever they opposed him on anything like equal terms, and this fact added to the rigor with which they treated the Americans who were so unfortunate as to fall into their hands. Shortly after the affair at Musgrove\u0027s Mill, in which Clarke defeated the British and the Tories, Lord Cornwallis addressed a circular letter to the officers commanding the advanced posts. He declared, \"The inhabitants of the Provinces who have subscribed to and taken part in this revolt shall be punished with the utmost rigor; and also those who will not turn out shall be imprisoned, and their whole property taken from them or destroyed. I have ordered,\" he goes on to say, \"in the most positive manner, that every militiaman who has borne arms with us, and afterwards joined the enemy, shall be immediately hanged. I desire you will take the most vigorous measures to punish the rebels in the district in which you command, and that you obey in the strictest manner the directions I have given in this letter relative to the inhabitants in this country.\" Here was authority broad enough to cover every crime that the British and the Tories might see fit to commit, and they stretched it to the utmost limit. They burned houses and destroyed property. They insulted and inhumanly treated women and children. They hanged the innocent. They went about the country practicing every barbarity that their savage and bloodthirsty natures could suggest. It was no wonder that the Americans retaliated whenever they had the opportunity. It was no wonder that Elijah Clarke, naturally independent and irritable, should fail to see the justice or necessity of treating the Tories he captured as prisoners of war. The situation of the Americans became so serious that Clarke determined to strike a heavy blow. He returned from Carolina to Wilkes County in September, 1780, and in two days succeeded in placing in the field three hundred and fifty men. With this force, strengthened by eighty men recruited in Carolina, he boldly marched on Augusta. The movement was so unexpected, that, but for the fact that the advance guard fell in with an Indian camp which it was compelled to attack, Colonel Brown would have been taken completely by surprise. But the retreating Indians gave him notice, and he took refuge with his command in a strong building known as the White House. The siege began on the 14th. By daylight on the 16th Clarke had succeeded in cutting the garrison off from its water supply. The sufferings of the men, especially the wounded, became most intense. The Americans could hear their cries for water and for medical aid. Brown appears to have been as brave as he was cruel. Though he was shot through both thighs, he remained at the head of his men; and his great courage sustained the spirits of his followers. Clarke summoned him to surrender on the 17th. He not only refused, but warned the American commander that the demonstration he was making against the King\u0027s men would bring destruction to the western part of Georgia. Meanwhile some of Clarke\u0027s men had gone to visit their families, and others were more interested in securing plunder than in forwarding the cause of independence. Colonel Brown, as soon as he heard of the approach of the Americans, had sent several messengers by different routes to inform Colonel Cruger of the state of affairs. Cruger, who was in Carolina at Ninety-six, promptly set his men in motion, and on the morning of the 18th appeared on the bank of the Savannah, opposite Augusta. Under the circumstances, Clarke was compelled to retreat. He had suffered a loss of sixty, killed and wounded. In retreating, he was compelled to leave twenty-nine of his wounded men behind. Among these was Captain Ashby, one of the bravest and most humane of the officers of the American army. This unfortunate officer and the men with him fell into the hands of the enemy. Colonel Brown was so severely wounded that he was unable to move about; so he ordered Captain Ashby and twelve of the wounded prisoners to be hanged on the staircase of the White House, where he might see their sufferings and gloat over their agonies. These men were cruelly strangled before Brown\u0027s eyes. But their fate was a happy one compared with that of their wounded companions. Those men were turned over to the red savages, who were the allies of the British. The Indians received the prisoners with howls of delight, and began at once to torture them in every conceivable way. They formed a circle, and marched around the Americans, cutting and slashing them with their knives. The end of the unfortunates was most horrible. They were ripped with knives, scalped, and then burned. No doubt, Colonel Brown enjoyed this scene more thoroughly than he did the tame and commonplace spectacle of strangling Captain Ashby and his companions. Before raising the siege, Elijah Clarke paroled the officers and men whom he had captured,—fifty-six men, all told. This fact is mentioned to show that the Georgia militia had not then begun those acts of retaliation which have attracted the notice of historians. They had had, as we know, abundant provocation; but after the horrible crimes perpetrated by Brown reached their ears, they threw off all restraint. Self-preservation is the first law of nature, and the men who acted with Elijah Clarke thought that the best way to preserve the lives of themselves and their families was to destroy the Tories as fast as they caught them. The fact is chronicled by Colonel Jones, and it is worth noting, that the officers and men paroled by Clarke, in utter disregard of their obligations, took up their arms as soon as the Americans had departed. The probability is that they were driven to this by the commands of Brown. It is well known, that, as soon as Clarke and his men had retreated, Colonel Brown sent detachments of troops in all directions, with orders to arrest all persons who had taken part in the siege, or who had sympathized with the efforts of the Americans to recapture Augusta. Under this sweeping order, men of all ages and conditions were dragged from their homes and thrown into prison. Those who were suspected of taking part in the siege, or of belonging to Clarke\u0027s command, were seized and hanged out of hand. Old men, no longer able to bear arms, were imprisoned for welcoming the return of members of their families who had fought on the American side. One instance out of many that might be cited was the arrest of the father of Captains Samuel and James Alexander. In the seventy-eighth year of his age, this old man was arrested at his home, tied to the tail of a cart, and dragged forty miles in two days. When caught leaning against the cart to rest his feeble limbs, he was whipped by the driver. It was at this time that in the region round about Augusta the hopes of the patriots grew very faint. The women and children assembled, and begged Elijah Clarke to take them out of the country; and in response to the appeals of these defenseless ones, he undertook the movement that culminated in the glorious victory of Kings Mountain. Old Man Whipped at the Tail of a Cart 111 The winter of 1780 was the darkest hour of the Revolution in Upper Georgia. There was no trade. Farming was at a low ebb. The schoolhouses were closed. Many of the patriots had carried off their families. Many had gone with Elijah Clarke to Kentucky. The patriots had betaken themselves to South Carolina, though the services they rendered there have been slurred over by the historians of that State. When General Greene began his Southern campaign, and gradually rid South Carolina of the British and the Tory element, the patriots of Upper Georgia ventured to return to their homes. Captain McCall, who was among them, says, in his history, that they returned in parties of ten and twelve, so as to attract as little attention as possible. They appointed Dennis\u0027s Mill, on Little River, as a place of meeting. \"When these small parties entered the settlements where they had formerly lived,\" says Captain McCall, \"general devastation was presented to view; their aged fathers and their youthful brothers had been murdered; their decrepit grandfathers were incarcerated in prisons where most of them had been suffered to perish in filth, famine, or disease; and their mothers, wives, sisters, and young children had been robbed, insulted, and abused, and were found by them in temporary huts more resembling a savage camp than a civilized habitation.\" Though Captain McCall was an eyewitness of some of the scenes he describes, the picture he draws might seem to be too highly colored were it not supplemented by a great mass of evidence. One more instance out of many may be given. In a skirmish with the Americans under Colonel Harden, Brown captured several prisoners. Among them was a youth only seventeen years old named Rannal McKay, the son of a widow who was a refugee from Darien. Being told that her son was a prisoner in the hands of Brown, Widow McKay, providing herself with some refreshments that she thought might suit the taste of the British commander, went to Brown\u0027s headquarters, and begged that her son might be set free. The cruel wretch accepted the present she had brought him, but refused even to let her see her son, and caused the sentinels to put her out of the camp by force. Next day young McKay and four other prisoners were taken out of the rail pen in which they had been confined. By Brown\u0027s order they were hanged upon a gallows until they were nearly strangled. They were then cut down and turned over to the tender mercies of the Indians, by whom they were mutilated, scalped, and finally murdered in the most savage manner. The cruelty of Colonel Brown and the Tories acting under him was so unbearable that the patriots of that region felt that their existence depended on the capture of Augusta. They decided on an aggressive movement when they met again at Dennis\u0027s Mill, on Little River. Colonel Clarke, who was suffering from the results of smallpox, was too feeble to lead them. His place was taken for the time by Lieutenant Colonel Micajah Williamson; and on the 16th of April, 1781, the Americans moved to the vicinity of Augusta. They were there re雗forced by a detachment from southern Georgia under Colonel Baker, and by a number of recruits from Burke County. A few days afterwards they were joined by some Carolina militiamen under Colonel Hammond and Major Jackson. With this force, Colonel Williamson took up a position twelve hundred yards from the British works, and fortified his camp. The Americans were compelled to wait nearly a month for the aid they expected from General Greene. The militia, worn out with waiting for the re雗forcements, were about to withdraw from the camp in despair, when Jackson, that truly great Georgian, made them an address full of the most passionate and patriotic eloquence, and this appeal changed their purpose. Jackson\u0027s voice was afterwards heard in the halls of Congress; but we may be sure that he was never more in earnest or more truly eloquent than when he pleaded with the faint-hearted Americans to stand to their cause and their arms. Jackson\u0027s address revived their courage; and when, on the 15th of May, Elijah Clarke rode into camp, restored to health and accompanied by one hundred fresh recruits, the confidence of the militiamen was fully renewed. It was at this time that General Pickens and \"Light Horse Harry\" Lee (the father of General Robert E. Lee) were ordered by General Greene to march on Augusta and capture that post When Lee reached the neighborhood of Augusta, he learned, from a party of light horse which he had sent on ahead to collect prisoners and gain information, that the annual royal present intended for the Indians had arrived at Fort Galphin, some distance below Augusta. The present comprised blankets, liquor, salt, small arms, powder, and ball. There was a great lack of these articles in the American camp, and Lee resolved to capture them. The supplies were so valuable, that Brown, the British commander, had sent two companies from Augusta to garrison Fort Galphin. This was the situation when \"Light Horse Harry\" arrived on the ground. The British in Augusta had not yet discovered his approach, and promptness was necessary. Leaving Eaton\u0027s battalion, the artillery, and the footsore men of the legion, to follow more slowly, Lee mounted a detachment of infantry behind his dragoons, and made a forced march to Fort Galphin. This point he reached on the 21st of May, 1781. The weather was extremely hot, and for miles the troopers and their horses had been unable to find a drop of water: consequently neither the men nor the animals were in a condition to make the attack when the command was brought to a halt under the pines that skirted the field surrounding the fort. The British within the fort were resting quietly, and were not aware that an enemy was at hand. A prompt and decisive movement was necessary; and when his men and horses had rested a little while, Lee dismounted the militiamen he had brought with him, and ordered them to make a demonstration against the fort on the side opposite the position he had taken. This famous commander reasoned, that, as soon as the militiamen appeared before the fort, the garrison would sally from the stockade. The militia would retreat, the garrison pursuing, and he would seize upon that moment to assault and capture the post left defenseless. To carry out this plan, Captain Rudolph (who was supposed to be some great general in disguise), with a detachment of picked infantry, was held in readiness to rush upon the fort; while the rest of the troops, supported by the dragoons, were placed where they could shield the militia from the pursuit of the British. The affair took place just as Lee had foreseen. The garrison sallied out to the attack. The militia, before making a show of resistance, began a retreat. The garrison gave pursuit. Captain Rudolph dashed across the field, and captured the fort without any trouble, The end came, when the militia rallied, and the foot soldiers and dragoons closed around the soldiers of the garrison. During the engagement the Americans lost one man from sunstroke. The enemy lost only three or four men. The rest, together with the valuable stores in the stockade, fell into the hands of the patriots. Following this successful affair, which was of more importance than it seems now to be, Lee formed a junction with General Pickens; and these two then joined their forces with those of Clarke, who commanded the Georgia militia, and the siege of Augusta began. The first movement was the capture of Fort Grierson, so called in honor of the man who commanded its garrison. Grierson, hard pressed, threw open the gates of the fort, and endeavored to escape. Thirty of his men were killed, and forty-five wounded and captured. Grierson was made a prisoner, but was killed by a Georgia rifleman. He was as cruel and vindictive as Brown himself. He was a monster who had made himself odious to the followers of Clarke. In his history, Captain McCall strongly hints that Grierson was shot by one of the sons of the aged Mr. Alexander, who had been made prisoner and dragged to Augusta tied to the tail of a cart. A reward was offered for information that would lead to the arrest of the man who shot Grierson, but the reward was never claimed. The whole army probably knew who had fired the fatal shot, and no doubt the commanders knew, but their knowledge was not official. No further notice was taken of the matter. The capture of Fort Grierson cheered the hearts of the besiegers, and gave them renewed courage. Fort Cornwallis was next invested. This stronghold was commanded by Colonel Brown himself, who was as bold as he was cruel. He was mean enough to expose to the American fire the aged Mr. Alexander and other unfortunate patriots who had long been held as prisoners. Captain Samuel Alexander commanded one of the companies close to the fort, and could see and recognize his venerable father, who had been placed in an exposed position by Brown. It is not necessary to describe all the events of the siege. Brown held out as long as he could, but was finally compelled to surrender. On the 5th of June, 1781, Brown, with three hundred men, marched out of Fort Cornwallis, and that stronghold was immediately taken possession of by Captain Rudolph. A strong guard was detailed by the American commanders, to protect Brown from the just anger of the Georgia soldiers, under Clarke, Williamson, and Jackson. To insure his safety, he was carried to the quarters of \"Light Horse Harry\" Lee. The next day he and a few of his officers were paroled and sent down the river in charge of a party of infantry instructed to guard him. Ramsay, in his \"History of the Revolution of South Carolina,\" says that Brown was recognized at Silver Bluff by Mrs. McKay, who thus addressed him: \"Colonel Brown, in the late day of your prosperity I visited your camp, and on my knees supplicated for the life of my son; but you were deaf to my entreaties. You hanged him, though a beardless youth, before my face. These eyes have seen him scalped by the savages under your immediate command, and for no better reason than that his name was McKay. As you are now prisoner to the leaders of my country, for the present I lay aside all thoughts of revenge; but when you resume your sword, I will go five hundred miles to demand satisfaction at the point of it, for the murder of my son.\" The probability is that Mrs. McKay used no such stately language. No doubt she walked up to Brown, shook her finger in his face, and exclaimed, \"You miserable villain! I can\u0027t get at you now; but if the day ever comes, I\u0027ll flay you alive for the murder of my poor boy.\" The fall of Augusta was received with rejoicings by the patriots everywhere, and the British and the Tories were correspondingly depressed. Men who had been overawed by the cruelty of the Tories, now came out boldly for the cause of independence, and the forces of the Americans were rapidly strengthened. Preparations were made for an aggressive campaign in Georgia by the Liberty Boys; and in this purpose they had the active aid and sympathy of General Greene, whose skill and ability as a commander were not greater than the wisdom he displayed in dealing with the people. In January, 1782, General Greene ordered General Anthony Wayne to take charge of the campaign in Georgia. At the same time he wrote a letter to Governor Martin that displays better than any document now extant the sagacity and conservatism that were the basis of General Greene\u0027s character and the source of his great success as a commander. \"I cannot help recommending to your Excellency,\" he wrote to the governor of Georgia, \"to open a door for the disaffected in your State to come in, with particular exceptions. It is better to save than to destroy, especially when we are obliged to expose good men to destroy bad. It is always dangerous to push people to a state of desperation; and the satisfaction of revenge has but a momentary existence, and is commonly succeeded by pity and remorse. The practice of plundering, which, I am told, has been too much indulged with you, is very destructive to the morals and manners of the people. Habits and dispositions founded on this practice soon grow obstinate, and are difficult to restrain; indeed, it is the most direct way of undermining all government, and, never fails to bring the laws into contempt, for people will not stop at the barriers which were first intended to bound them after having tasted the sweets of possessing property by the easy mode of plunder. The preservation of morals and an encouragement to honest industry should be the first objects of government. Plundering is the destruction of both. I wish the cause of liberty may never be tarnished with inhumanity, nor the morals of people bartered in exchange for wealth.\" This letter was intended to put an end to the war of extermination that the Tories of Upper Georgia had begun, and to prevent the patriots from carrying out their plans of revenge. The letter did great good. It was turned over to the Legislature by the governor, and thus made public; and its sentiments were taken to heart by hundreds who had suffered the most cruel wrongs at the hands of the Tories. General Greene\u0027s letter was also made the basis of two proclamations, both issued by the governor after conference with General Wayne. One opened the door to disaffected Georgians who might desire to return to the ranks of the republicans, and the other was addressed to the Hessian troops who had already begun to sympathize with the Salzburghers at Ebenezer. Stevens, in his \"History of Georgia,\" says that many citizens who had been compelled from various reasons to seek protection under the British Government, and who had even joined the armies of the enemy, took advantage of the proclamation which referred to them, returned to their State allegiance, and joined the forces of General Wayne, where they proved their sincerity by making the most zealous efforts to merit the pardon and protection that had been promised them by the governor. After a brilliant campaign, lasting from January to July, 1782, General Wayne, assisted by Elijah Clarke, James Jackson, and other bold spirits who had never suffered the fires of liberty to go out in Georgia, cleared the State of the British. Savannah was occupied on the 11th of July, the keys having been surrendered to James Jackson. This was the end of British rule in Georgia. \n \n","sourceLink":"http://novel.tingroom.com/ertong/2810/77674.html","bookId":503,"book":{"id":503,"title":"Stories Of Georgia 1896","description":"简介： In preparing the pages that follow, the writer has had in view the desirability of familiarizing the youth of Georgia with the salient facts of the State\u0027s history in a way that shall make the further study of that history a delight instead of a task...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2810","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
