{"id":97124,"no":26,"title":"Page 26","content":"Grace fired the fuel rod gun, hit the broken phalanx formation, and blew them literally to bits. She dropped the weapon. \"Rad counter at max dosage,\" she called out. \"This thing\u0027s too hot to use anymore.\"\\n\\n \"Back away!\" the Chief ordered. \"Those things have a fail-safe!\"\\n\\n Grace sprang back, just in time. The fallen fuel rod gun sparked, sputtered, and then blew with the force of a frag grenade. Black- ened, twisted tile rained down on them.\\n\\n Locklear jogged up and fired at the Grants fleeing the excava- tion. They weren\u0027t armed. Locklear mowed them down without remorse.\\n\\n From a pile of shattered stone, a pair of battered Elites struggled to rise. Blood and bone exploded outward from their chests, and they spun around toward the source of this force—boulders pushed away from the blocked passage. Three Spartans emerged from their cover, assault rifles smoking from their recent discharge.\\n\\n John knew instantly the three were Kelly, Fred, and Will.\\n\\n He ran forward to meet them.\\n\\n Fred lowered his weapon. \"Anton ... Grace ... John?\" he said disbelievingly.\\n\\n The Master Chief opened a COM channel to his Spartans.\\n\\n \"It\u0027s me. I wish I had time to explain everything. I will—later.\\n\\n Let\u0027s get the hell out of here first.\"\\n\\n Kelly quickly reached out and swiped her two fingers across John\u0027s faceplate.\\n\\n He wanted to return the smile, but at that moment Admiral Whitcomb, running full force, skidded to a stop next to the Spar- tans. He was followed in short order by Haverson, Locklear, and Johnson, who kept looking over his shoulder to scan the huge empty room around them.\\n\\n \"Is this everyone?\" Admiral Whitcomb asked.\\n\\n \"No, sir,\" Fred replied. \"There\u0027s one more.\" He turned and extended his hand back into the partially collapsed tunnel. \"Ma\u0027am?\\n\\n It\u0027s safe to come out.\"\\n\\n For a heartbeat the Master Chief forgot that he was in the heart of an enemy\u0027s camp; he forgot about the war, that Reach had fallen, and everything else he had gone through in the last few days. He had never thought he would see her again.\\n\\n Dr. Halsey emerged from the partially caved-in tunnel. She brushed dust from the hem of her skirt and lab coat with one slender hand.\\n\\n \"Admiral Whitcomb,\" she said, \"a pleasure to see you again.\\n\\n My thanks for the rescue. It was far timelier than you could imagine.\" She turned to the Master Chief. \"Or is it you I have to thank for this daring operation, John?\"\\n\\n The Master Chief found he had no words to answer. He also bristled at her casual use of his given name... but he could for- give her that. She had always used his name—never his rank or serial number.\\n\\n He noticed the fist-sized crystal clutched in her hand. It had a thousand facets and emitted a brilliant blue light the color of sapphires and sunlight on water.\\n\\n \"Thank anyone you want, Catherine,\" Admiral Whitcomb said.\\n\\n \"Throw us all a party if that\u0027ll make you happy... once we\u0027re out of here.\" He clicked open his COM. \"Polaski, get down—\"\\n\\n Sergeant Johnson set his hand on the Admiral\u0027s arm and nod- ded toward the far wall.\\n\\n \"What is it, Sergeant?\" The Admiral\u0027s voice died in his throat.\\n\\n The Master Chief\u0027s motion tracker flickered on his heads-up display, but there was no solid contact... nor did he see any- thing across the entire three-kilometer-wide cavern. Had it picked up a camouflaged Elite? No, the dust in the air would have certainly given it away.\\n\\n \"No one move,\" the Admiral whispered.\\n\\n John saw them, then. He saw them all.\\n\\n He had missed them before because he had thought it was the haze in the air rippling, the dust, maybe the distance causing a miragelike image. He hadn\u0027t thought it possible for so many Covenant to be so still.\\n\\n On each level of the twelve tiered galleries that circumscribed the gigantic room stood Covenant soldiers. They crowded the balconies with Grunts, Jackals whose energy shields popped on, snarling Elites, and several pairs of Hunters with fuel rod can- nons glowing green.\\n\\n The whine of thousands of plasma weapons charging filled the air like a swarm of locusts.\\n\\n No one moved. No one breathed except Locklear, who ex- haled a long and heartfelt expletive.\\n\\n John tried to count them all. There had to be thousands—on every level. A battalion at least, maybe more. They wouldn\u0027t even have to aim. All they had to do was shoot and fill the space with needle shards and boiling energy.\\n\\n They\u0027d be vaporized before they could get halfway to the tun- nel at their backs.\\n\\n A Hunter pair roared with rage; they leveled their fuel rod cannons at John and his team and, with steady aim, discharged their weapons.\\n\\n A split second later the rest of the alien horde opened fire.\\n\\n CHAPTER TWENTY-ONE\\n\\n TIME:DATE RECORD ANOMALYX Estimated 0640 Hours, September 23,2552 (Military Calendar)\\Aboard captured Covenant flagship Ascendant Justice, periphery of Epsilon Eridani system.\\n\\n Ascendant Justice emerged from the non-Euclidian, non-Einsteinian realms that humans had erroneously called \"Slip-space.\" There was neither \"space\" nor anything to \"slip\"\\n\\n across in the alternate dimensions.\\n\\n The ship displaced a cloud of ice crystals that had for millennia been melted and refrozen into delicate weblike geometries.\\n\\n Ascendant Justice\u0027s running lights diffused through these particles and made a glimmering halo of hard-edged reflections. It reminded Cortana of the snowglobe that Dr. Halsey had kept on her desk: the Matterhorn and a little Swiss climber scaling its three-centimeter height—all swirling in the center of a micro- scopic blizzard.\\n\\n The frozen Oort cloud around her was significantly larger, but it was still a charming effect and a welcome sight from the abyss ofSlipspace.\\n\\n Cortana had fled the Epsilon Eridani system, but only to its edge—a short jump of a few billion kilometers from Reach and the Master Chief.\\n\\n The odds that the Covenant would find her were long— astronomical, in fact, even if they had ships on patrol. The Oort cloud\u0027s volume was too large to search in a hundred years. Still, she powered down virtually every system on the ship except the fiision generators—and her own power systems, of course.\\n\\n The ship drifted in the icy dark.\\n\\n She redlined the reactors, however, to recharge the Slipspace capacitors and regenerate the plasma she had expended in her brief fight with the Covenant cruisers.\\n\\n If she was part of a larger fleet, her desperate tactics might be valuable—flashing all her plasma away and the near-gravity Slipspace jump—but as one ship against a dozen, her effective combat lifetime using those tactics could be measured in microseconds.\\n\\n And now the Covenant knew that Ascendant Justice was not one of theirs. She hoped the Master Chief would elude them— find his Spartans and somehow meet her at the rendezvous coordinates—all without getting blown up by enemy ground forces and the Covenant fleet.\\n\\n She paused and reset her emotion subroutines—the AI equiva- lent of a deep sigh. Cortana had to remain focused and think of something useful to do while she waited.\\n\\n The problem was that she\u0027d been thinking at peak capacity for the last five days. And now she was thinking with a large por- tion of her mind occupied by the data absorbed from the Halo construct.\\n\\n She again toyed with the idea of dumping that data into Ascen- dant Justice\u0027s onboard memory. Now that the other AI had been erased, it should be safe. Yet one piece of technological data had already been leaked to the enemy ... and that could have ex- treme repercussions in the war effort. If the Halo data got into Covenant hands—the war would be over.\\n\\n She decided she would make do with her available memory-processing bandwidth.\\n\\n Cortana listened and looked to the center of the Epsilon Eridani system with Ascendant Justice\u0027s passive sensors. Faint Covenant communiques whispered past her—eight hours old, because that\u0027s how long it took the signal to travel from Reach to here.\\n\\n Interesting. The present insystem chatter was undoubtedly fo- cused on the intruders. Eight hours ago, however, it had been business as usual... whatever business that was.\\n\\n She eavesdropped on the data streams, translating, and tried to make sense of it all.\\n\\n Among the more coherent samples of their excited religious babble were: uncovering the fragment of divinity, and illuminating shard of the gods to exist the perfect moment that vanishes in the blink of an eye but lasts forever, and collecting the stars left by the giants.\\n\\n A literal translation was not a problem. It was the meaning be- hind the words that eluded her. Without the proper cultural refer- ences, this was all gibberish.\\n\\n It had to mean something to someone, however. Perhaps she could use part of the dissected Covenant AI to help. It had spo- ken to her, so it was partially fluent with human idioms. She might be able to reverse-engineer its translation software.\\n\\n Cortana isolated the AI code and began the retrieval-and-unpacking process. This would take time; she\u0027d compressed the code, and the reconstitution process would require a good deal of her reduced processing power.\\n\\n While she waited, she examined the Covenant reactors. They used a pinched magnetic field to heat the tritium plasma. It was surprisingly primitive. Without better hardware, though, there was little she could do to improve their effectiveness.\\n\\n Power. She needed more if she was going to head back insystem to rendezvous with the Master Chief. The Covenant weren\u0027t go- ing to sit by and wait for them to hook up, bid a fond adieu, and then escape.\\n\\n Logically, there was only one way to do this: She was going to have to fight and kill them all.\\n\\n She could conserve her ship\u0027s power and fire the plasma weapons as they were designed. That, however, would only de- lay the inevitable. A dozen ships against one—even Captain Keyes wouldn\u0027t have survived such a lopsided tactical situation.\\n\\n She deliberated how to solve this problem, spun off a multi- tasking routine that listed her resources, and filtered them in a creativity-probability matrix, hoping to find an inspired match.\\n\\n The unpacking of the alien AI\u0027s routines finished. The code appeared to her as a vast cross section of geological strata: gray granite variables and blood red sandstone visual processors and oily dark function films. But there were dozens of code layers she didn\u0027t even recognize.\\n\\n The translation algorithms, however, were in the top layers of this structure, glistening like a vein of gold-laced quartz. She tapped into the software; it had infinite loops and dead-end code lines—things that had to be errors.\\n\\n Yet there were also slender crystalline translation vectors that she would never have thought of on her own. She copied those and slaved them to her dynamic lexicon.\\n\\n The distant Covenant transmissions poured though her mind, now somewhat more coherent: Inner temple layers penetrated; Infidels present, and Cleansing operation ongoing; Victory is assured, and The Great One\u0027s purity will burn the infidels; The holy light cannot be tainted.\\n\\n She picked up on the urgent undertone to these transmissions, as if the notorious Covenant confidence were not entirely genuine.\\n\\n Since these messages made reference to an infestation to be cleansed, and since these transmissions occurred many hours before the Ascendant Justice had entered the Epsilon Eridani system, the Master Chief had been correct in his conclusions: There were human survivors on Reach. Likely Spartans.\\n\\n His correct analysis of the situation based on the six-note sig- nal irritated Cortana. It annoyed her more that she had not con- cluded this as well. It made her realize how dangerously close to the edge of her intellectual capacity she operated.\\n\\n One of her alert routines triggered. An access hatch on the route from the bridge to the reactor room—one that she had specifically directed Sergeant Johnson not to weld shut—just opened.\\n\\n \"The trap is loaded,\" she whispered.\\n\\n Cortana scanned the region with the ship\u0027s internal sensors.\\n\\n There was nothing ... unless that \"nothing\" was actually a group of camouflaged Elites—perhaps the \"Guardian of the Luminous Key\" mentioned in the Covenant\u0027s greeting communique.\\n\\n She tripped the emergency hull breach shut on four bulkhead doors—two on each side of this opened hatch.\\n\\n \"Trap is sprung,\" she remarked.\\n\\n Cortana vented the atmosphere in this sealed section.\\n\\n She hoped that they had left the vent system open behind them—dooming any others left behind to a similar asphyxiation.\\n\\n Her sensors picked up a plasma grenade detonation on the in- ner port set of doors she had sealed and locked. The discharge scrambled those circuits and disabled the locks. She noted that the doors were being slowly opened... but not enough to reach the second set of sealed doors ahead.\\n\\n The opening of those doors halted.\\n\\n \"Gotcha,\" she whispered.\\n\\n She\u0027d keep that section of Ascendant Justice sealed until Sergeant Johnson could confirm the kills. She wouldn\u0027t let her guard down, either. There had to be additional alien saboteurs aboard her ship. And if she found them, she\u0027d deal with them in the same efficient fashion.\\n\\n This minor distraction resolved, Cortana returned her atten- tion to the Covenant AI\u0027s code. Small portions of the alien soft- ware looked like her. The odds of such a parallel evolution in computer science seemed improbable. It was almost as if it were her code ... only copied many times, each time with subtle errors introduced by the replication process.\\n\\n Could the Covenant have captured a human-made AI, copied it, and then used the result in their ships? If so—why had there been the need to replicate the code so many times? And with so many errors?\\n\\n This theory didn\u0027t track, however. Smart AIs like her had an operational life span of approximately seven years. After that the processing memory became too interconnected and developed fatal endless feedback loops. In essence, smart AIs became too smart and suffered an exponential attenuation of function; they literally thought themselves to death.\\n\\n So if the Covenant were using human-created AIs, all the copies would be dead within seven years—there was no reason to recopy the copies. It wouldn\u0027t extend their life span, because all the memory-processor interconnections had to be copied as well.\\n\\n Cortana paused to consider how much of her life span had been compromised by absorbing and analyzing the data from Halo. Her experiences within the Forerunner computer system had certainly pushed her intellect far past its designed limits. \\n\\n","sourceLink":"https://allnovel.net/halo-first-strike-halo-3/page-26.html","bookId":1635,"book":{"id":1635,"title":"Halo: First Strike (Halo #3)","description":"Storyline: Halo: First Strike (Halo #3) \\n The Human-Covenant war rages on as the alien juggernaut sweeps inexorably toward its final goal: destruction of all human life! \\n Halo has been destroyed, and the threat it posed to sentient life, neutralized. But victory has come at a terrible cost for the UNSC. Thousands of valiant soldiers fell in the battle to prevent the alien construct from falling into the enemy’s clutches. \\n Now, everything depends on the Spartan known as the “Master Chief.” Yet even with the aid of the artificial intelligence Cortana, the Master Chief will be hard-pressed to rescue survivors and evade the Covenant ships patrolling the remains of Halo in debris-strewn space. \\n Ahead lies a dangerous voyage home, through a gauntlet of Covenant forces. For the sake of all, the Master Chief and his war-torn squad must not only survive, but take the fight to the enemy with a decisive first strike.\\n","cover":"https://allnovel.net/images/halo-first-strike-halo-3.jpg","author":"Eric S. Nylund","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-first-strike-halo-3.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:24:01 PM"}}
