{"id":97126,"no":28,"title":"Page 28","content":"\"What the hell—\" Polaski, caught unawares, grasped the yoke and pulled back. Their dropship hummed with power and shot up through the tunnel. \"Gravity,\" Dr. Halsey whispered and stared into the opened facets of the crystal. \"This thing warped space when we first approached. It apparently has an effect on artificial gravity fields as well. I can\u0027t wait to get this into a lab.\" The dropship emerged from the hole, and sunlight flooded the interior. Once out of the grav beam, the slender stone folded back upon itself, closing petal-like fragments, melding back into a single smooth shard. Dr. Halsey plucked up the stone and slipped it back into her lab coat pocket; she returned her attention to Kelly\u0027s biosigns. The air over Menachite Mountain was thick with circling flocks of Banshee fliers and Seraph fighters. The three-hundred-meter-long light cruiser had company, too. Six more Covenant cruisers faced their tiny dropship, plasma turrets tracking them. A series of icons flashed on Polaski\u0027s console. \"They\u0027ve got weapons lock,\" she said, the calm in her voice cracking slightly around the edges. \"They won\u0027t fire,\" Admiral Whitcomb declared. There was steel resolution in his words—as if this weren\u0027t a guess on his part, but rather an order that the Covenant had better follow. He set his hands on his hips and watched the ships, seeming to stare the cruisers down. \"They want whatever the doctor and her team discovered ... and they want it bad enough to let us shoot at them and not so much as spit in our direction.\" \"Sir,\" the Master Chief said. \"We\u0027re to rendezvous with Cor-tana and the captured flagship at oh-seven-fifteen hours. That gives us only twenty minutes, sir.\" Admiral Whitcomb consulted his watch and then glanced at the Covenant ships gathering around them and edging closer. \"Polaski, get us out of here. Plot a course to your rendezvous point—and make this crate fly as fast as you can!\" \"Aye aye, sir.\" Polaski angled the ship into the upper atmosphere of Reach; the sky darkened from turquoise to slate gray to midnight blue and then inky black, filled with stars. As their dropship left the cruisers behind, it moved painfully slow compared to the agile Seraph fighters. They formed up around her, four to the port and four on the starboard of their craft. A pair of the teardrop-shaped singleships pulled ahead of her, slowed... and blocked their path. \"They\u0027re boxing us in,\" Polaski said and decelerated their ship. \"Warrant Officer,\" the Admiral said and set a hand gently on her shoulder. \"Ram them. Full speed.\" Polaski swallowed. \"Aye, sir.\" One of her hands cinched her crash harness tight. The other hand passed over the velocity stripe on the control panel, and shoved it to full power. The dropship jumped—straight toward the Seraph fighters in their path. The two fighters tumbled aside with a scant three me- ters to spare, and the dropship raced past them. Locklear peered out of the port display and whistled. \"Does anyone else,\" he whispered, \"think it\u0027s a little crowded up here?\" The Master Chief looked over Locklear\u0027s shoulder. There had been a dozen small warships when they had descended only a few hours ago... now there were three times that number in orbit around Reach. There were light cruisers that looked like luminous manta rays; there were four carriers with their bulbous sections, and the space near them was aglow with swarms of Seraph singlecraft; there were a handful of destroyers, sleek and fast, bristling with plasma turrets. There was also wreckage: Pieces of Covenant ships tumbled in orbit, raw ragged chunks of the alloy plating, tangles of plasma conduits still aglow from the heat they carried, and clouds of metal that had been vaporized and had cooled into mists of glit- tering dust. \"Cortana\u0027s been busy in our absence,\" Lieutenant Haverson remarked. He nodded approvingly at the carnage. The Master Chief detected flickers of light and dark from the launch bays of a Covenant carrier. He activated his visor\u0027s mag- nification and saw a legion of Elites in thruster packs, and a score of the tentacled engineering drones leaving the bay. \"Singleships, drones, and Elite boarding parties on intercept vectors,\" Polaski announced. \"Inbound—\" She paused and double-checked her scans. \"Jesus. They\u0027re inbound from all directions.\" \"Get us to the rendezvous coordinates,\" Admiral Whitcomb ordered. \"And don\u0027t spare the horses.\" \"Sir,\" Polaski replied, her voice icy cold, \"these are the rendezvous coordinates.\" The Master Chief searched for their captured ship on any display—and saw only the enemy. Cortana and Ascendant Justice reappeared in space; it was a tight fit. This particular jump required precision to the centimeter and, although she loathed admitting it, a large measure of luck. She had often wondered what would happen if a ship transi-tioned to normal space too close to a planet or other mass—in this case, another ship. Ascendant Justice winked into existence within the debris field in high orbit around Reach. There was, however, no ultravi-olent explosion as the atoms of the flagship overlapped with the matter of the scrapped ships the Covenant had herded together in space. Either Slipspace jumps prevented such occurrences from happening, shunting the incoming ship to the side like water that flows around a river rock ... or she had borrowed some of the Master Chief\u0027s probability-bending good fortune. Hundreds of wrecked ships, human and Covenant alike, tum- bled lifelessly about her, their net trajectories suggesting that Ascendant Justice had just nudged them aside. If she\u0027d had more time, she would\u0027ve designed a set of experiments with drone ships to test out her displacement-luck hypothesis. But time was something neither she nor the Master Chief had in abundance. Minutes remained until their rendezvous—and Cortana would need every millisecond to accomplish what she had to do if any of them were going to leave the Epsilon Eridani system alive. Cortana searched the field of derelicts for a likely candidate. There were only a handful of Covenant ships; if the UNSC had managed to take out one of the alien ships in the battle for Reach, they apparently had been forced to obliterate it. No suit- able candidates remained for her plan. She turned her attention to the vast number of wrecked UNSC ships. The Covenant didn\u0027t have to completely destroy a human ship to remove its tactical presence from the battle—a single en- ergy projection beam could tear through enough decks and kill enough crew to disable the craft. She wondered how many fallen humans drifted in the local space alongside her, thousands of brave men and women who had died fighting. Her sensors flicked over the silhouettes of the UNSC light ships. There were corvettes with bisected hulls leaking radio- active coolant from their nuclear start-up reactors. Although they were more suitable for her purpose, the damage to them was too great. She didn\u0027t find one with a single intact fusion reactor. She tagged the location of the carriers and heavy cruisers and excluded them from her search. They were simply too large. She was willing to sacrifice maneuverability and speed... but not so much that it would take her an hour to make the burn out of orbit. That left destroyers and frigates. She found and tagged four- teen in the debris field. Destroyers were essentially frigates that carried a meter and a half of Titanium-A armor instead of the sixty centimeters of their lighter counterparts. There were two candidates: Both the destroyer Tharsis and the frigate Gettysburg had intact fusion reactors. While the Gettysburg had been killed by an energy projector beam that had gutted it stem to stern—obliterating the bridge and life support— its power plant and even the Magnetic Accelerator Cannon on its undercarriage were apparently functional. Even better: The ship\u0027s topside hardpoints were intact. Cortana let a flicker of power pulse through Ascendant Jus- tice\u0027s engines, and she slowly drifted toward the Gettysburg. She paused to listen to the Covenant traffic insystem. There was eight times the chatter there had been before, with many ref- erences to the \"Infidels\" on the planet and the \"holy light\" that was now in jeopardy. Good. That meant the Master Chief was doing what he did best: causing mayhem among the enemy. And more importantly, the presence of Ascendant Justice floating among the hundreds of dead ships had not been detected. When she was within a kilometer of the Gettysburg, she cut her engines. With delicate puffs from the thrusters she edged closer and rolled Ascendant Justice until its top side was parallel with the top side of the Gettysburg. She pinged the Gettysburg\u0027s telemetry system and received a faint handshake reply. Cortana gave the override code—quickly accepted—and entered the Gettysburg\u0027s NAV computer. There was no other computer intelligence on board. The cap- tain of the Gettysburg had flatlined the NAV system and the AI as per the Cole Protocol. Cortana extended her presence through the empty systems. The Gettysburg was a wreck; all thrusters offline. It wouldn\u0027t be moving on its own power ever again, but its heart still beat. The ship\u0027s fusion reactor operated at 67 per- cent capacity. Perfect. Ascendant Justice gently touched down on the Gettysburg— probably the first time in the history of the universe that human and Covenant ships had made contact with nonlethal intentions. All modern UNSC ships had been designed with hardpoints on their dorsal and ventral sides in the event that they were too crippled to move under their own power. In theory, another UNSC ship could dock, lock systems, and carry the wounded ship away. The Covenant flagship had a similar series of hardpoints on its top side where ships too large to fit in its launch bay could dock. The two systems, however, were incompatible. Cortana fixed that. She activated the seven service drones on the Gettysburg, and instructed the Covenant Engineers within the outer hull of Ascendant Justice to secure the docking points mating the two ships and adapt their power uplinks. The reason for this salvage operation, her pinpoint jump into the debris field, and the hybrid docking. . . it was all for power. Ascendant Justice\u0027s cover had been blown; the Covenant knew that their flagship was human-controlled. That made their original plan of rendezvousing in orbit around Reach impossible. She could have jumped to that location and picked up the Chief, but then they would be stranded there while the Slipspace capacitors slowly recharged—and in the meantime they would be boxed in and obliterated by the Covenant armada. So she had to change tactics; she\u0027d jump into the thick of a hostile and wary Covenant force, grab the Chief, and just as quickly jump out of the system. For that she\u0027d need power to in- stantly recharge the Slipspace capacitors—the kind of power only two ships could produce. The power uplinks connected. Gigawatts flowed from the Gettysburg\u0027s reactor into Ascendant Justice\u0027s energy grid. \"Perfect,\" she purred. It was 0712 hours. She had less than three minutes to prepare for the next phase of her plan. Cortana checked and rechecked the calculations for what had to be the shortest Slipspace jump ever: from the floating junk- yard to the rendezvous coordinates, a mere three thousand kilo- meters. She scanned that region of space—and discovered it was no longer a blind spot in the Covenant defenses. There were three times as many ships insystem as when she\u0027d left. Cortana spotted the Chief\u0027s hijacked dropship ascending from the lower atmosphere of Reach, with a pack of Seraph fighters surrounding the craft. She intercepted a series of repeated orders from the Cove- nant\u0027s fleet commander: Do not fire or you will be targeted and destroyed. The Infidels have captured the holy light. This was both good and bad. Good because the Master Chief and his team with this \"holy light\" avoided being blasted into vapor. Bad because every Covenant ship in the system was closing in on their dropship—ultimately they\u0027d box it in, grapple with the tiny craft, and take it with overwhelming force. This also made Cortana\u0027s jump target increasingly crowded. She made certain her plasma turrets were fully charged; she rechecked her shaping magnetic coils; she ran a systems check on Ascendant Justice\u0027s thrusters in case something happened with her exit jump and she had to maneuver. The time was 0714.10 Military Standard. Cortana then did the one thing she was not good at: wait. Fifty seconds for a mind that could perform a trillion calculations per second was an eternity. At T minus thirty seconds Cortana dumped power into the Slipspace capacitors. Pinpricks of light dotted the black space around her. At T minus twenty she updated her calculations, taking into account the slight gravitational variances that so many Covenant warships created in local space. The vacuum around her pulled apart, and she picked a path through the \"here\" of normal space into the \"not-here\" of Slipspace. At T minus ten she wrote a quick program to target the distant ships near her exit coordinates—and keep them targeted when she reappeared. Ascendant Justice moved slightly forward into the rip in space; light enveloped the craft. She vanished from the field of floating debris and— —reappeared in an eyeblink. The full face of Reach filling her lateral starboard displays. The port displays were crowded with inbound Covenant ships. The odd piggybacked Covenant—human craft appearing in the middle of their trap must have confused the enemy ... no one fired. The dropship was three kilometers off Cortana\u0027s starboard beam, its trajectory more or less aligned with Ascendant Jus- tice\u0027s launch bay. She opened the UNSC E-band and said, \"Chief, your ride is here.\" \"Acknowledged,\" the Master Chief replied. There was no quaver in his rock-solid voice. He had been headed into certain death a moment ago, but he sounded like this was what he expected to occur. Like this was normal operational procedure. The dropship veered toward the open bay, and Cortana dropped shields for a split second—just long enough for the tiny craft to enter—then reestablished the protective field. Cortana routed power from the Gettysburg into Ascendant Justice\u0027s Slipspace capacitors, and they began soaking up the charge.","sourceLink":"https://allnovel.net/halo-first-strike-halo-3/page-28.html","bookId":1635,"book":{"id":1635,"title":"Halo: First Strike (Halo #3)","description":"Storyline: Halo: First Strike (Halo #3) The Human-Covenant war rages on as the alien juggernaut sweeps inexorably toward its final goal: destruction of all human life! Halo has been destroyed, and the threat it posed to sentient life, neutralized. But victory has come at a terrible cost for the UNSC. Thousands of valiant soldiers fell in the battle to prevent the alien construct from falling into the enemy’s clutches. Now, everything depends on the Spartan known as the “Master Chief.” Yet even with the aid of the artificial intelligence Cortana, the Master Chief will be hard-pressed to rescue survivors and evade the Covenant ships patrolling the remains of Halo in debris-strewn space. Ahead lies a dangerous voyage home, through a gauntlet of Covenant forces. For the sake of all, the Master Chief and his war-torn squad must not only survive, but take the fight to the enemy with a decisive first strike.","cover":"https://allnovel.net/images/halo-first-strike-halo-3.jpg","author":"Eric S. Nylund","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-first-strike-halo-3.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:24:01 PM"}}
