{"id":97107,"no":9,"title":"Page 9","content":"Their comrades on either side of the door howled and at- tacked. The whine of plasma rifle fire echoed through the bay as blue-white energy bolts crashed into the Chief\u0027s own shields.\n His shield dropped away, and the insistent drone of a warning indicator pulsed in his helmet. His vision clouded from the flare of energy weapon discharges, and he struggled to draw a bead on the Elite in front of Polaski. It was no good—he had no clear shot.\n The Elite drew a plasma pistol. Polaski drew her own sidearm.\n She was faster—or luckier. Her pistol cleared its holster; she snapped it up and fired. The pistol boomed as a shot took the Elite right in the center of its elongated helmet.\n The Elite\u0027s own shot went wide and seared into the deck be- hind Polaski.\n Polaski emptied her clip into the alien\u0027s face. A pair of rounds rocked the alien back. Its shields faded, and the remaining rounds tore through armor and bone.\n It fell on its back, twitched twice, and died.\n Johnson and Locklear unleashed a hellish crossfire into the corridor and made short work of the remaining Elites as Polaski hugged the deckplates.\n \"Now that\u0027s what I\u0027m talkin\u0027 about,\" Johnson crowed. \"An honest-to-God turkey shoot.\"\n Ten meters down the passage a dozen more Elites rounded a corner.\n \"Uh-oh,\" Locklear muttered.\n \"Sergeant,\" the Chief barked. \"Door control!\" John moved to Polaski\u0027s position in two quick strides, grabbed her by her collar, and dragged her out of the line of fire. Plasma bolts singed the air where she\u0027d been.\n He dropped her, primed a grenade, and tossed it toward the rushing Elites.\n The Sergeant fired his assault rife at the door controls; they exploded in a shower of sparks, and the doors slammed shut.\n A dull thump echoed behind the thick metal, then an eerie silence descended on the bay. Polaski struggled to her feet and fed a fresh clip into her pistol. Her hands shook.\n \"Cortana,\" the Chief said. \"We need an alternate route to the bridge.\"\n A blue arrow flashed on his heads-up display. The Chief turned and spotted a hatch to his right. He pointed to the hatch and signaled his team to move, then ran to the hatch and touched the control panel.\n The small door slid open to reveal a narrow corridor beyond, snaking into the darkness.\n He didn\u0027t like it. The corridor was too dark and too narrow—a perfect place for an ambush. He briefly considered heading back to the primary bay door, but abandoned that idea. Smoke and sparks poured from the door seams as the Covenant forces on the other side tried to burn their way through.\n The Chief clicked on his low-light vision filters, and the dark- ness washed away into a grainy flood of fluorescent green. No contacts.\n He paused to let his shields recharge, then dropped into a low crouch. He brought his rifle to bear and crept into die corridor.\n The interior of the passage narrowed, and its smooth purple surface darkened. The Chief had to turn sideways to pass through.\n \"This looks like a service corridor for their Engineers,\" Cortana said. \"Their Elite warriors will have a tough time following us.\"\n The Chief grunted an acknowledgment as he eased his way through. There was a scraping sound and a flash of sparks as his energy shield brushed the wall. It was too tight a fit. He powered down the shields, which left him just enough room to squeeze through.\n Locklear followed behind him, then Polaski, the Sergeant, and finally Haverson.\n The Chief pointed at Haverson, then at the door. The Lieu- tenant frowned, then nodded. Haverson closed the hatch and ripped out the circuitry for the control mechanism.\n There had been dozens of Engineers in the launch bay— and there were enough on the ship to merit their own access tunnel.\n The Chief hadn\u0027t seen anything like this on the Truth and Reconciliation.\n In fact, he hadn\u0027t seen a single Engineer on that ship. What made this ship different? It was armed like a ship of war... yet had the support staff of a refit vessel.\n \"Stop here,\" Cortana said.\n The Chief halted and killed his external speakers so he could speak freely. \"Problem?\"\n \"No. A lucky break, maybe. Look to your left and down twenty centimeters.\"\n The Chief squinted and noticed that a portion of the wall ex- truded into a circular opening no larger than the tip of his thumb.\n \"That\u0027s a data port. . . or what passes for one with the Covenant Engineers. I\u0027m picking up handshake signals in shortwave and infrared from it. Remove me and slot me in.\"\n \"Are you sure?\"\n \"I can\u0027t do much good in there with you. Once I\u0027m directly in contact with the ship\u0027s battlenet, however, I can infiltrate and take over their systems. You\u0027ll still need to get to the bridge and manually give me access to their engineering systems. In the meantime, I may be able to control secondary systems and buy you some time.\"\n \"If you\u0027re sure.\"\n \"When have I not been sure?\" she snapped.\n The Chief could sense her impatience through the neural interface.\n He removed Cortana\u0027s data chip from the socket in his helmet.\n The Chief felt her leave his mind, felt the heat rush back into his head, pulsing with the rhythm of his heart... and once again, he was alone in the armor.\n He slotted Cortana\u0027s chip into the Covenant data port.\n Locklear\u0027s face rippled with disgust, and he whispered, \"You couldn\u0027t pay me to stick any part of myself in that thing.\"\n The Chief made a slashing gesture across his throat, and the Marine fell silent.\n \"I\u0027m in,\" Cortana said.\n \"How is it?\" the Chief said.\n There was a half-second pause. \"It\u0027s ... different,\" Cortana replied. \"Proceed thirty meters down this passage and turn left.\"\n The Chief motioned the team forward.\n \"It\u0027s very different,\" Cortana murmured.\n Cortana was built for software intrusion. She had been pro- grammed with every dirty trick and code-breaking algorithm the Office of Naval Intelligence, Section Three had ever created, and a few more tricks she\u0027d developed on her own. She was the ultimate thief and electronic spy. She slipped into the Covenant system.\n It was easy the first time she had entered their network as the Longsword had approached the flagship. She had set their weap- ons systems into a diagnostic mode. The Covenant had deter- mined the problem and quickly reset the system, but it had given Polaski the precious seconds her sluggish human reflexes had needed to get inside the launch bay.\n \"How is it?\" the Chief asked.\n Now the element of surprise was gone, and the system\u0027s counterintrusion systems were running on high alert. Something else prowled the systems now. Delicate pings bounced off the edges of Cortana\u0027s presence; they probed, and withdrew.\n It felt as if there were someone else running through their sys- tem. A Covenant AI? There had never been any reports of alien AIs. The possibility intrigued her.\n \"It\u0027s.. . different,\" she finally answered.\n She scanned the ship\u0027s schematics, deck by deck, then flashed through the vessel\u0027s three thousand surveillance systems. She picked out the quickest route to the bridge from their current position and stored it in a stolen tertiary system buffer. She multitasked a portion of herself and continued to analyze the ship\u0027s structure and subsystems.\n \"Proceed thirty meters down this passage and turn left.\"\n Cortana hijacked the external ship cameras and detected the six Covenant cruisers. They had stalled their pursuit of the Longsword and now hovered a hundred kilometers off the flag- ship\u0027s starboard side. The strange U-shaped Covenant dropships launched from the cruisers and swarmed toward the flagship.\n That was trouble.\n Within the flagship she spotted a dozen hunt-and-kill Elite teams sweeping the corridors. She scrambled the ship\u0027s tracking systems, generated electronic ghosts of the Chief and his team along a path directed toward the nose of the ship, where UNSC command-and-control centers were typically located. Maybe she could fool the Elites into a wild goose chase.\n She uploaded the coordinates of those enemies into the Chief\u0027s HUD.\n A tickle of feedback teased through the data stream.\n Cortana locked onto the source of that feedback, listened, dis- cerned a nonrandom pattern to the signal, then cut off contact.\n She had no time to play hide and seek with whatever else was in this system.\n Cortana had to finally admit to herself that she didn\u0027t have the power to contend with a possible enemy artificial construct. She had absorbed a tremendous volume of data from Halo\u0027s systems: eons\u0027 worth of records on Halo\u0027s engineering and maintenance, the xenobiology of the Flood, and every scrap of information on the mysterious \"Forerunners\" the Covenant revered so much.\n The information would take her a week of nonstop processing to examine, collate, codify. . . let alone understand.\n Even compressed, all the data filled her and cut into optical subsystems that she usually reserved for her processing. She had a nagging suspicion that the file compression had been too hasty—and that the Halo data might be corrupted.\n In effect, the vast amount of information she had copied bloated her, made her slower and less effective.\n She hadn\u0027t mentioned this to the Chief. She could barely ad- mit it to herself. Cortana was extremely proud of her intellect.\n But to operate as if nothing were different would be even more foolish.\n She sent a blocking countersignal along the connection where this \"other\" was trying to contact her.\n The portion of her consciousness examining the ship\u0027s struc- ture discovered that the bridge had another access point. Stupid.\n She should have seen it immediately, but this other entrance had been filed under the schematics as an emergency system. It was a tiny corridor that connected to a set of escape pods. That route shared a vent with an engineering passage.\n \"Chief, there\u0027s another way to the bridge.\"\n \"Affirmative. Wait one.\" There was a burst of gunfire on the COM, then silence. \"Go ahead, Cortana.\"\n \"Uploading the route now,\" she said. \"I do not believe you can fit through this new passage in your armor. I suggest you split your team and proceed along both routes to maximize your chances of egress onto the bridge.\"\n \"Understood,\" the Chief said. \"Polaski and Haverson with me.\n Johnson and Locklear, you take the escape pod route.\"\n She continued to track both teams and the relative positions of the Covenant parties. She replicated additional ghost signals to confuse the enemy.\n Cortana picked up increasing communications bandwidth be- tween the flagship and the cruisers. Reports of the invaders—a call for help—a warning to be relayed to the home world. There were references to the \"holy one,\" and those messages had what she considered amusing attempts at encryption to keep them secret. Curious, she had to investigate what the Covenant thought important enough to hide.\n As she decrypted those messages and others cross-referenced and filed in their COM archives, she detected an energy spike on the flagship\u0027s lateral sensors. One cruiser off to starboard moved farther away; it turned, its engines glowed, the black around it rippled electric blue. The Covenant ship sped forward, tore the night, and vanished into Slipspace.\n Cortana noted their departure vector for future reference. . . a possible clue at the location of their home world.\n It was puzzling that the Covenant would call for help. Their warriors were intensely proud; they almost never ran from a fight. They didn\u0027t ask for help... not for themselves. Then again, this ship, although armed for war, didn\u0027t appear to be staffed for combat. It carried only a few hundred Elites and an army of Engineers.\n As Cortana pondered this, she continued to generate a counter-signal to match to the probe sent by the other presence in the system. She hoped to cloak her activity as long as possible. The other\u0027s signal morphed into a series of Bessel functions, and she compensated to match.\n She automated this process, commandeering a portion of the Covenant\u0027s own NAV computer to do so, and then she herded the electronic ghosts of the Chief and the others to confuse the pursuing Elite forces.\n At the same time, she continued her study of the Covenant ship and its systems—it was a unique opportunity. The informa- tion on their advanced Slipspace drive, their weapons—it could leapfrog human technology decades forward.\n \"Cortana?\" The Chief\u0027s voice broke her concentration. There were sounds of plasma bolts and automatic weapons fire. \"We\u0027ve got Elites in active camouflage in the passage. We need a way around this intersection.\"\n She had not considered the Elites\u0027 light-bending technology.\n She was doing too much, spreading herself too thin. She halted her ongoing study of the Covenant technology and found the Chief a way around the intersection.\n She rebooted her human communications and protocol rou- tines and said, \"Access panel to your right, Chief. Down three meters, straight ahead five meters, turn to your left and then up again.\"\n She heard an explosion. \"Got it,\" the Chief said.\n Cortana had to focus on protecting the Chief. She halted her other searches and scrutinized the ship\u0027s schematics. There had to be something she could use. A weapon. A way to stop then-enemies—there: the backup terminus for their atmospheric preprocessors. Unlike the other systems, this one was classified as low priority and had minimal security layers.\n She generated several hundred thousand Covenant codes in a microsecond and cracked the system. She diverted the air vents along the corridors the Chief and his team occupied to the pri- mary air systems. She then tasked the processor pumps to ser- vice the rest of the ship and activated them—in reverse.\n Warnings flashed throughout the Covenant system as the pressure suddenly dropped in 87 percent of the ship\u0027s passages.\n She squelched them.\n The other presence in the system tried to shut the pumps off.\n She blocked that signal and assigned a new code to the security systems: \"WE REGRET TO INFORM YOU.\"\n She heard the other AI scream, an echo of an echo that rever- berated through her processors. She knew trie sound—familiar like a human voice, but terribly distorted.\n She scanned through the ship\u0027s cameras and saw Grunts squeal and fall over, methane leaking from their breathers as the pres- sure dropped. Engineers turned blue, slowed, and died, floating in place with tentacles twitching, still searching for something to fix. The Elite hunt-and-destroy parties halted in the corridors and clutched their throats, mandibles snapping at air that was no longer there; they toppled and suffocated. \n","sourceLink":"https://allnovel.net/halo-first-strike-halo-3/page-9.html","bookId":1635,"book":{"id":1635,"title":"Halo: First Strike (Halo #3)","description":"Storyline: \n Halo: First Strike (Halo #3) \n The Human-Covenant war rages on as the alien juggernaut sweeps inexorably toward its final goal: destruction of all human life! \n Halo has been destroyed, and the threat it posed to sentient life, neutralized. But victory has come at a terrible cost for the UNSC. Thousands of valiant soldiers fell in the battle to prevent the alien construct from falling into the enemy’s clutches. \n Now, everything depends on the Spartan known as the “Master Chief.” Yet even with the aid of the artificial intelligence Cortana, the Master Chief will be hard-pressed to rescue survivors and evade the Covenant ships patrolling the remains of Halo in debris-strewn space. \n Ahead lies a dangerous voyage home, through a gauntlet of Covenant forces. For the sake of all, the Master Chief and his war-torn squad must not only survive, but take the fight to the enemy with a decisive first strike.\n \n","cover":"https://allnovel.net/images/halo-first-strike-halo-3.jpg","author":"Eric S. Nylund","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/halo-first-strike-halo-3.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:24:01 PM"}}
