{"id":98507,"no":28,"title":"Page 28","content":"They watched him climb the stony cliff with some amusement, but also with a fair amount of pride, for Elbryan moved with a grace and agility beyond that of most humans, especially one his size. For the Touel\u0027alfar, those movements, so natural and animallike, served as a testa-ment to their training and their way of life. To their thinking, Nightbird\u0027s achievements were their achievements; but by their estimation, he still could not match the agility of even the most clumsy elf. Far down below, across the rocky remnants of an old riverbed and under the canopy of a large cluster of pines, Bradwarden, Roger, and the monks busied themselves setting up camp. The two elves had watched them start unseen and unnoticed, as they had been for almost all this journey, and then they had followed Nightbird so inconspicuously that even the elven- trained ranger had taken no note of them The ranger inched his hand above him, fingers walking up the stone, seeking a crack. He closed his eyes, focusing on his sense of touch, letting his fingertips \"see\" for him. He found, so high above him that he had to rise on tiptoe, a crack barely deep enough to admit his fingertips and only wide enough for one hand. The ranger fell into a state of absolute calm, allowing the muscles in his hand to go rigid. He inched up, up, barely noting the move, deep in thought, all his willpower focused squarely on that hand. His shoulder at last rose higher than his elbow. He inched his other hand up, walking it up the stone, hunting the next hold. This time he found a deeper crack, and he managed to wedge his fingers in, then swing one foot out and placed his toes in the crack. The next move was easy: the muscles of his arm and leg worked to bring him closer, then angle him upward. The next hold was in a wider gap, and from there, the ranger found a grip for both hands above him, a narrow ledge, a place to rest. Elbryan pulled himself up - and he nearly toppled in surprise, for there,waiting for him, sat Ni\u0027estiel, a pipe in his mouth, blowing smoke ringsinto the air. \"Too slow,\" the elf criticized. The ranger pulled himself over into a sitting position and took a welcome deep breath. \"I would have come up faster if I, too, wore a pair of wings,\" he replied dryly. \"Faster still if you were not trapped in so large and unwieldy a body,\" Ni\u0027estiel said. \"And why have you decided to make so arduous a climb with the sun already low in the western sky? The season\u0027s cold will be unfor-giving so high up after the sun is gone. How well will your fat human fin-gers grasp a ledge of icy-cold stone? \" \"I wanted a look ahead,\" the ranger explained. \"Roger found some goblin sign, a small lean-to.\" \"You could have simply asked,\" answered Tiel\u0027marawee, fluttering up to land beside her kin. \"Asked? I did not know if the Touel\u0027alfar had come along for the journey,\" the ranger admitted. \"Nor did you seem eager to help me, what-ever course lay before me.\" The elves glanced at each other, Ni\u0027estiel shook his head, and then they turned back to face the ranger, neither of them looking particularly pleased. \"What have I done?\" Elbryan asked bluntly. \"Surely your attitude toward me has not been that of friend to friend, and yet I cannot under-stand what has so changed our friendship.\" \"Friendship?\" Tiel\u0027marawee echoed skeptically. \"I spoke to you not at all during your years in Andur\u0027Blough Inninness, Nightbird. Why would you assume that we two are, or ever were, friends?\" The words stung the ranger, and he had to admit their truth. \"But I am elf-friend,\" he reasoned. \"Is not a friend of Lady Dasslerond a friend to all the Touel\u0027alfar?\" \"It is a friendship that you have strained,\" Ni\u0027estiel said plainly. \"What have I done?\" the ranger replied, his voice rising. \"When Bel-li\u0027mar Juraviel left - \" \"You taught her,\" Ni\u0027estiel said. \"Taught?\" Elbryan echoed, caught by surprise, but as soon as he paused to consider the word, he understood. \"Bi\u0027nelle dasadawas our gift to you,\" Tiel\u0027marawee explained. \"It was not yours to offer another.\" \"Juraviel and I already had this conversation,\" the ranger tried to explain. \"Belli\u0027mar Juraviel\u0027s word on this is far from final,\" Ni\u0027estiel retorted. \"Lady Dasslerond will decide if you are to be punished for your foolish action. But understand this, Nightbird: even if the lady chooses to ignore your error, we of the Touel\u0027alfar know what you did and are not pleased.\" \"Not at all,\" Tiel\u0027marawee added. \"Pony is of my own heart and soul,\" Elbryan answered. \"Even Belli\u0027mar was amazed when he saw the harmony of our dance. And am In\u0027Touel\u0027alfar or of the people? Which is it, I ask, because surely, for all the words of friendship and kinship - \" \"And how many years has Jilseponie spent in Andur\u0027Blough Inninness?\" Ni\u0027estiel interrupted sarcastically. \"How many hours speaking wisdom with one of the Touel\u0027alfar, learning the emotional strength to go with the formi-dable weapon ofbi\u0027nelle dasada?\" \"Our dance - \" the ranger began. \"Is a matter of the physical,\" Ni\u0027estiel cut him short. \"But the truth ofbi\u0027nelle dasada transcends the physical and goes to the spiritual. Any person might learn the physical movements, but what a dangerous and terrible thingbi\u0027nelle dasada would become if it were merely that.\" \"The warrior is a blend of heart and body,\" Tiel\u0027marawee added. \"It is the injection of the soul into the movements of the body that brings heart and compassion, that tells when the blade should be used in addition to how to use it.\" \"And this is what you have violated, Nightbird,\" Ni\u0027estiel went on. \"So you have taught the woman, and who will she choose to teach? And they, in turn, will pass it along to others; and what is left, then, of our gift?\" Elbryan was shaking his head, for he knew Pony better than that, knew she would keep the secret between them; he knew her heart, and knew, beyond the comprehension of his elven detractors, that there was no one else with whom she, or he, could possibly share so intimate an experience. But the ranger didn\u0027t voice those thoughts, and understood the fears of his elven friends. Despite the differences in size and strength - in fact, partly because of those differences - the average elf could easily defeat even skilled human soldiers in combat.Bi\u0027nelle dasada was their edge, a fighting style that the slashing styles of heavier humans could not match. Despite his empathy, the ranger felt he had not violated the elven trust, that Pony was an extension of his very soul and that she was every bit as worthy as he to know the dance. \"Lady Dasslerond will go to her,\" he reasoned. \"Lady Dasslerond, and Belli\u0027mar Juraviel and many others, are already in Palmaris,\" Ni\u0027estiel admitted. For a moment, the ranger feared that Dasslerond and the others might harm Pony to protect their secret, but that dark thought passed. The elves could be dangerous; their way of looking at the world and concepts of good and evil were very different from the ways of humans. But they would not harm Pony. \"I apologize to you for my transgression,\" Elbryan said. \"No, I apologize for the discomfort my choice has brought to you. But I assure you that once Lady Dasslerond has had the opportunity to meet and know Pony, and once she has witnessed the beauty of Pony\u0027s sword dance - a beauty of the spirit as well as the body - she will understand and will be at peace.\" By their expressions, the ranger could see that his words satisfied the two elves - as much as they could be satisfied now. \"Lady Dasslerond did not go to Palmaris to measure your lover\u0027s ability in the sword dance,\" Ni\u0027estiel said, and he looked at his elven companion as if seeking approval, something the ranger did not miss. He stared at Ni\u0027estiel hard, prompting the elf to continue. \"She went to see Jilseponie, the lover of Nightbird, soon to be the mother of Nightbird\u0027s child,\" Ni\u0027estiel remarked. \"Pony and I have decided that we will not bear any chil - \" the ranger started to reply. The slightest breeze could have blown Elbryan from the ledge at that awful and wonderful moment, the most confusing and dizzying array of feelings washing over him. \"How do you know this?\" Elbryan asked breathlessly. \"Belli\u0027mar Juraviel knew. He told us on the road in the southland, when he came upon our band as we shadowed Roger Lockless and the five monks,\" Tiel\u0027marawee admitted. \"Thus did Lady Dasslerond decide to go south, with the majority of our kin, while we two alone continued north.\" Elbryan could hardly breathe. It all made perfect sense to him, seemed to explain so many things, such as the absence of warning and aid from the elves during the goblin attack, and yet it made no sense at all. How could Juraviel have known that Pony was pregnant? The elf had been with Elbryan since Pony had gone to Palmaris. And then the awful truth hit Elbryan. Pony had known. And she had left him. She had run to Palmaris out of fear that continuing north might cause injury to the unborn baby. And she had not told him! \"You judge her, ranger,\" Ni\u0027estiel observed. Elbryan turned a blank stare over him. \"And yet you do not know the truth,\" Ni\u0027estiel went on. \"How did Juraviel know?\" the ranger asked. \"Did Pony tell him? And if she did, then why did she not tell me?\" \"You know only what your fears tell you,\" Tiel\u0027marawee added. \"You are thinking the worst, and yet should you not be full of joy?\" Elbryan held up his hands helplessly, for he did not know what to think or to feel. \"I have to go to her,\" he said. \"Spoken like a human,\" Ni\u0027estiel remarked dryly. \"Perhaps, if your assumptions are correct, you have just answered the question,\" Tiel\u0027marawee added. \"Abandon all and rush to her side, but you will do no practical good there.\" \"You doubt that I should be with Pony at this time?\" \"If the situation allowed for it, then of course you should,\" Ni\u0027estiel replied sternly. \"But that is a matter of the joy you deserve, and not of any practical purpose. Pragmatism demands that you finish your task here, and then go to your lover.\" \"Now go back down and take your sleep,\" Tiel\u0027marawee said to him. \"We shall scout the road ahead and speak with you in the morning.\" The ranger nodded, and gradually, as he dismissed the negative assump-tions and began basking in the reality of the situation, a smile widened across his handsome face. Surely he wanted Pony to have his child - a hundred children! Surely this was a blessed thing, the result of a true union of love. \"The bottom of the sun finds the horizon,\" Ni\u0027estiel warned. Elbryan\u0027s smile faded when he looked down at the formidable descent. \"A long climb,\" he said with a groan, stretching his tired muscles. \"Did you not just insist that you were notn\u0027Touel\u0027alfar?\" Tiel\u0027marawee said to him in a lighter, teasing tone. \"Flap your wings, then, elf.\" With a groan, the ranger began to climb down. Ni\u0027estiel and Tiel\u0027marawee, true to their word, set out immediately to the north. They found the lean-to Roger had discovered and more goblin signs beyond that, including a camp only recently abandoned. They weren\u0027t par-ticularly surprised, or alarmed, by the discoveries, since they were far into the Wilderlands and definitely in goblin-infested territory. To find no goblin sign would have been more surprising, and more alarmed would they have been had any of their findings indicated that powries, a far more cunning foe, were in the area. That wasn\u0027t the case, the two elves were fairly certain, for powries built different and stronger structures, even for tempo-rary camps, than goblins. \"Only goblins,\" Ni\u0027estiel said to Tiel\u0027marawee as Sheila began her ascent over the eastern horizon, lighting the encampment enough for Ni\u0027estiel to point out one particularly rickety structure. Now all they had to do was find the somewhat dim-witted creatures, and instruct Nightbird and his friends on how they might simply avoid them. Another set of eyes also viewed that structure. The eyes of a cat, scanning the dark forest as clearly as a man might see it in the light of day. Keen eyes saw the elves, keen ears heard their words, and a keen nose smelled the blood within their tiny and tender bodies. The tiger De\u0027Unnero crept closer. He was not knowledgeable of the Touel\u0027alfar, but he knew these two for what they were, and by what he had overheard he knew they were friends of Nightbird. And De\u0027Unnero did know the legends of the elves, mostly that they were powerful and decep-tive enemies. Better to deal with them efficiently, he decided; better to take the ring of defense away from his primary prey. The tiger came a stride closer on quiet, padded feet. Ni\u0027estiel froze, as did Tiel\u0027marawee; the elves, attuned to their environ-ment, sensed his presence, the sudden hush that preceded the charge of the predator. Out came slender swords, and on came De\u0027Unnero, a great pounce that sent him flying to land on Ni\u0027estiel. The elvish blade stabbed repeatedly, sinking into muscle and flesh, but so, too, raked the great claws, tearing deep lines, severing the tendons con-trolling that arm. Tiel\u0027marawee was there in an instant, her sword flashing, and De\u0027Unnero had to leap away. But now they lined up one against one, for Ni\u0027estiel could do little more than roll about in agony and cry out for Tiel\u0027marawee to flee. \"Yes, do try,\" the tiger said, and both elves stopped short, eyes widening in shock. Then the tiger began to transform, first its head and then its torso, though the limbs, except for one arm, remained feline. \"What manner of demon is this?\" Tiel\u0027marawee said, and on she came, thinking to catch the creature in mid-change and score a deadly strike. Too quick for the obvious move, De\u0027Unnero sent his still-feline arm swinging across to intercept the sword, accepting the pain of the solid hit. Then out snapped his human arm, just missing a solid and devastating con-nection on Tiel\u0027marawee\u0027s face as the elf spun away. \"Very impressive,\" the monk\u0027s now-human face said. \"All that I would expect from the legends of the Touel\u0027alfar.\" \"Who are you?\" Tiel\u0027marawee asked, her tone indicating that she was in control now. \"What dactyl demon has arisen this time to bring grief to the world?\" \"Demon?\" the Bishop echoed with a chuckle. \"Why, my dear, tender little elf, you could not be further from the truth. Do you not recognize Marcalo De\u0027Unnero, the Bishop of Palmaris?\" Tiel\u0027marawee blanched. It seemed impossible, ridiculous, and yet she found that she did not disbelieve him. \"And thus your Church names the Touel\u0027alfar as enemies?\" she asked bluntly, trying to remain calm, though her composure frayed as she glanced over at Ni\u0027estiel, who was now lying still, obviously near death. \"I name anyone who befriends the outlaw Nightbird as an enemy of the Church!\" De\u0027Unnero growled at her. That set Tiel\u0027marawee back on her heels once more. \"And so you convict and execute without trial,\" she replied. \"That is my prerogative,\" the Bishop answered, and his powerful tiger legs sent him soaring forward. She was ready for him and leaped straight up, flapping her wings to bring her above the Bishop. Then she dropped, like a bird of prey, sword stab-bing like a talon. De\u0027Unnero hit the ground and rolled, swinging his arm frantically to intercept her blade. These elves did live up to their legend! He batted the sword and tried to grab it, but Tiel\u0027marawee was already moving to the side, landing a dozen feet away and coming around in perfect balance to meet any forthcoming attacks. \"Well done,\" the Bishop congratulated, standing straight as a man once again, his legs reverting to human form. He dismissed the gem magic alto-gether then, and showed Tiel\u0027marawee that he was completely human now. \"You err, Bishop of Palmaris,\" Tiel\u0027marawee said. \"Do you mean to start a war with the Touel\u0027alfar? We are enemies beyond your comprehension, do not doubt.\" \"I tremble, good elf,\" De\u0027Unnero replied. \"And in truth, I might heed your words and see if a bargain could now be struck, except ...\" He paused and laughed aloud. \"Except that I am intrigued by your mastery of the sword, and your movements so lithe and balanced,\" he finished. \"And now I must learn the extent of that skill.\" With that, he fell into a fighting crouch, legs apart and balanced, arms swaying and crossing defensively in front of him. He carried many wounds already - blood shone in the moonlight against his bare skin - but though her enemy was merely human, Tiel\u0027marawee understood that she had to be cautious. This one was quick and balanced, and too strong. She would wait him out, let him tire, let his blood continue to flow from those wounds she and Ni\u0027estiel had given him. A gasp for breath from Ni\u0027estiel reminded her that she did not have the time, though, and so she came on in sudden fury, sword stabbing straight ahead. Tiel\u0027marawee miscalculated. The elvish fighting style featured straight-ahead thrusts, sudden bursts that moved the tip of a slender elvish sword many feet forward in the blink of an eye. But De\u0027Unnero\u0027s style, the open-handed maneuvers of the Brothers of the Abellican Order, was also a straight-line form, and so he crossed his forearms before him and brought them up in a gentle, but per-fectly timed manner, lifting Tiel\u0027marawee\u0027s sword high with only minimal damage to himself. That left her open to a counter; she knew it and tried another lightning-fast defensive dodge. De\u0027Unnero\u0027s open palm crashed against the side of her cheek, stunning her, stealing her strength so completely for that instant that her sword fell from her grasp. \"Flee!\" Ni\u0027estiel cried in a voice filled with blood. The word caught in Tiel\u0027marawee\u0027s mind and stuck there, her legs and wings pumping hard to get her away. She hated the thought of leaving her companion, but understood, as elves always understood, her duty to the greater cause of the Touel\u0027alfar, a demand now that she survive to bear wit-ness, to tell Lady Dasslerond of the Bishop and his Church. Her speed amazed De\u0027Unnero. Moving away and up into the air, she would have gotten away cleanly except that the Bishop called upon his gemstone again and leaped at her with the power of a tiger\u0027s legs, grabbing her with an arm that once again bore the paw and claws of the great cat. He caught her on the side, just below a wing - and only good fortune kept those claws from tearing the wing in half and dropping Tiel\u0027marawee back to the ground. Tiel\u0027marawee cried out in agony, but kept flying upward, knowing that to be dragged down was to be killed. A great patch of her skin from hip to knee tore away, but then she was free to fly, higher and higher, going to a tree branch, but then pushing on without hesitation, forcing herself to focus on the one mission before her: to get back alive to Nightbird. Deeper into the stone went De\u0027Unnero, thinking that as the tiger he would pace her and catch her and devour her. She fluttered through the trees; he raced along the ground, leaping up whenever she swooped lower to dodge a branch or to find a foothold. Tiel\u0027marawee tried a different tack, landing on a high branch and pulling her bow around, then launching a stream of small arrows at the tiger. She scored hit after hit, even as the tiger scrambled away, but though more than half her quiver was empty, she realized that she had done little real damage to the creature, that its wounds seemed to be healing almost as fast as she was inflicting them! This was not a mystery to Tiel\u0027marawee, who knew of the gemstones and understood that this man had used one to transform himself into the cat and was using another one to heal. The one thing her volley had done was buy her some space. She put another arrow into the bushes where the tiger had disappeared, then rushed away, hoping that the cat would stay hidden long enough for her to get far, far from the spot. And Tiel\u0027marawee needed that, she realized, for her torn leg had gone numb, and the blood flowed freely. She felt cold at the edges of her small body, and her peripheral vision showed only darkness as death crept closer and closer. She stumbled and toppled, tried to catch herself by willing her wings to beat furiously. But then she was down on the ground in a heap, trying to orient herself enough to get back up in the tree. But it was over, she real-ized, when she saw the tiger steadily approaching. Even if she managed to right herself and leap high, the cat would spring and catch her in mid-flight. Now she was to die, and a great sadness washed over her for the centuries she would not see, and even more for her failure to warn her lady, for the coming tragedy might well overwhelm the fragile world of the Touel\u0027alfar. The cat charged. Tiel\u0027marawee closed her golden eyes. She heard a last growl, then felt a rush from the side - powerful, thunderous. She opened her eyes to see the tiger spinning away. Powerful legs, equine legs, tore the earth next to her; Symphony neighed loudly, urging her up. When she could not find the strength to mount, the horse came down low. The tiger leaped ahead, and so did Symphony, taking a vicious swipe on the flank. The chase was on. Tiel\u0027marawee held on for all her life as Sym-phony thundered through the trees, cutting close corners. De\u0027Unnero gave good chase, but only for a short distance, for the cat could not match the pace of the great stallion. So the Bishop tried a dif-ferent tack. He came out of his tiger form and sent his thoughts to the stal-lion through the hematite - and found an easy connection through the turquoise that was set in Symphony\u0027s breast. He thought he had them both - and what a sweet meal they would make! - but Symphony was no ordinary horse, was possessed of an intelli-gence beyond his equine form. All De\u0027Unnero received as a response to his call was a wall of anger. Frustrated, the Bishop turned and ran for Ni\u0027estiel, hoping that the fleeing elf might be foolish enough to turn the stallion around and try to rescue him. Tiel\u0027marawee knew her duty and, besides, she wasn\u0027t even in control of the horse; Symphony moved of his own will. The sight of Ni\u0027estiel, still alive but delirious from pain and weakness, brought a wicked smile to the Bishop. He shifted back into his tiger form, smelled the blood, and fell over the semiconscious elf in a tearing and biting frenzy. Bradwarden found the stallion, sweating and exhausted, but still moving purposefully toward the encampment some time later. Tiel\u0027marawee lay unconscious across Symphony\u0027s back, the horse working hard to keep her there. \"By the god Dinoniel,\" the centaur muttered, seeing the garish wound. He immediately pulled the magical red band from his arm, the elven healing band that had kept him alive for weeks when he was trapped beneath the rubble of Mount Aida, and tied it tightly about Tiel\u0027marawee\u0027s arm, though he had no idea if the magic would work on wounds inflicted before the armband was placed on the victim. He was relieved to see the blood flow slow a bit, but he seriously doubted that any healing had come in time to save the poor creature. He lifted her from Symphony\u0027s back, cradling her in his strong arms, and headed for the camp, the stallion at his side. Elbryan\u0027s feelings upon seeing her came as a mix of agony and amaze-ment.What creature could have done this to a Touel\u0027alfar? And even more disturbing, where was Ni\u0027estiel? \"She\u0027s said not a word since I came upon her and yer horse,\" Brad-warden explained. \"Me thinkin\u0027s that Symphony pulled her from whatever enemy found her.\" The ranger looked to his horse, found that connection through the magi-cal turquoise set in Symphony\u0027s breast, and nodded his head. And then his fears grew as Symphony imparted the image of a great and powerful cat, one that matched perfectly the description Roger had given him of the cat that had murdered Baron Bildeborough. \"Oh, if only I had stolen a soul stone from the abbey!\" Brother Viscenti lamented as he and the others came upon the scene. Elbryan, too - and not for the first time - regretted that he had not ac-cepted that one stone from Pony when she had turned her road to the south. \"Will she live?\" Roger asked, as Brother Braumin, skilled in healing arts even without gemstone aid, moved over the elf, trying to make her more comfortable. Not understanding the nature of the armband, he started to untie it, but Bradwarden and Elbryan quickly corrected him. \"She\u0027s looking a bit better,\" Bradwarden offered hopefully. \"But her wounds are from the claws of a cat,\" the ranger explained. \"Dirty wounds.\" \"A cat?\" Roger asked, eyes widening. Elbryan looked at him hard and nodded. \"A great orange cat, striped in black,\" the ranger explained. Roger\u0027s knees weakened and he nearly top-pled, except that Brother Castinagis was at his side, supporting him. \"Like the one that killed Baron Bildeborough,\" the ranger confirmed. \"Bishop,\" came a weak voice from below, as Tiel\u0027marawee tried to ex-plain. \"Bishop . . . tiger.\" Elbryan bent low. \"Bishop?\" he asked, but Tiel\u0027marawee\u0027s eyes had closed once more and she lay very still. \"De\u0027Unnero,\" Brother Braumin explained. \"The Bishop of Palmaris. He is known for the use of the tiger\u0027s paw, a potent gem that can transform an arm into the powerful paw of the great cat.\" \"More than the arm,\" Roger insisted. \"He is here?\" the ranger said incredulously, looking up to scan the forest as if he expected the tiger to leap out at them at that very moment. \"And we canno\u0027 be doubtin\u0027 his reason for comin\u0027,\" Bradwarden remarked. \"He\u0027s searching for us,\" Brother Braumin reasoned. \"We have brought danger to you by asking for your help.\" The ranger shook his head. \"I suspect that I am more his target than you and your friends,\" he stated. \"Any Pony more than yerself,\" Bradwarden added, a particularly unset-tling thought for Elbryan. If De\u0027Unnero had come out here looking for him, did that mean that the man had found Pony in Palmaris, had perhaps tortured her into revealing his whereabouts? \"I must find him,\" Elbryan said suddenly, still staring into the forest, his fears for Pony and his unborn child growing. \"I\u0027m thinkin\u0027 that he\u0027s to find yerself soon enough,\" Bradwarden said dryly. \"What do we do?\" asked Brother Braumin. \"We keep goin\u0027 the way we\u0027re goin\u0027,\" Bradwarden answered before the ranger could interject his thoughts. The centaur was wise enough to under-stand that Elbryan was thinking of his lover then, and was likely thinking of turning back for Palmaris. And that, to Bradwarden\u0027s thinking, would be a tremendous mistake. \"Ye told me yerself just this night that the elves\u0027re with her in Palmaris,\" he said to calm the ranger. \"Suren they\u0027re to protect her as well as ye could.\" The ranger wasn\u0027t so sure of that, wasn\u0027t sure that the elves, given their obvious negative feelings about Pony\u0027s learningbi\u0027nelle dasada, would even want to protect her. He shook that thought away, though, and reminded himself that the Touel\u0027alfar, however different their viewpoint might be, were not enemies but allies. \"Or have ye gotten so full o\u0027 yerself that ye think yerself better than the likes o\u0027 Lady Dasslerond and Belli\u0027mar Juraviel, and all th\u0027 others put together?\" Bradwarden pressed, a ridiculous notion but one that made Elbryan remember the truth of the power of the Touel\u0027alfar. \"We go on,\" the ranger agreed, \"but we keep a tighter scouting pattern.\" \"And what of the little one?\" Bradwarden asked, looking down at poor Tiel\u0027marawee. \"I\u0027m not thinkin\u0027 she\u0027s ready for travel right now.\" \"I am not even certain that she will live out the day,\" Brother Braumin admitted. \"We will wait for her,\" the loyal ranger said without hesitation. \"One way or another,\" Brother Castinagis quietly remarked. \"And I will go out with Symphony to find Ni\u0027estiel,\" the ranger added, ignoring the harsh comment, though he knew that it hadn\u0027t been said with any malice. \"Not alone, ye won\u0027t,\" the centaur replied. \"I can move faster alone on the horse.\" \"And I can pace ye,\" the centaur insisted. Elbryan looked around at his friends. He didn\u0027t like the idea of taking Bradwarden with him, thus leaving the others, though there were six of them, unprotected. \"Take the centaur,\" Brother Castinagis insisted. \"To go out alone against De\u0027Unnero would be foolhardy.\" \"The Bishop is a formidable enemy,\" Brother Mullahy added. The ranger didn\u0027t need their confirmation; anyone who could bring down two of the Touel\u0027alfar was obviously formidable. \"I am more con-cerned with those I leave behind,\" he said plainly. \"There are six of us,\" Roger answered. \"And we five of St.-Mere-Abelle are trained in the fighting arts,\" Brother Castinagis insisted in a confident tone. The ranger motioned to Bradwarden, then moved to saddle Symphony. One look at the horse, though, lathered in sweat and with a fairly serious cut on his flank, told him that he would do better walking the animal for a bit, so he plopped blanket and saddle over Bradwarden instead, bridled Symphony, and led the stallion into the forest, the centaur at his side. They found the tattered remains of Ni\u0027estiel two hours later, the tiger nowhere in sight. \"Ye\u0027ll pay that one back for doin\u0027 this,\" the centaur said. Elbryan stared at the torn form, then looked at the forest and nodded. Tiel\u0027marawee was not ready for travel the next morning, though she looked somewhat stronger and even managed to open her eyes and tell more of the story, confirming that the creature that had attacked the elves had been sometimes human, sometimes tiger, and sometimes something in between. She also managed to confirm that the Bishop was hunting for Nightbird and was more than happy to kill anyone who called herself a friend of the ranger. And then Tiel\u0027marawee closed her delicate golden eyes once more and settled quietly in her place, seeming so fragile, so on the very doorstep of death. Stubbornly, the ranger went out forbi\u0027nelle dasada, stripping off his clothes and finding a clearing on the edge of a small lake. He fell into the sword dance with furor, using it to confirm his dedication to the elves and his determination to avenge this outrage, and also as a challenge to De\u0027Unnero, hoping the Bishop would find him and come at him, in either form, that he might end this there and then. And indeed, from a place not too far away, De\u0027Unnero watched the ranger\u0027s powerful yet graceful movements, and he came closer, trying to decide whether to go at the man as tiger or human. He settled on human, for he wanted to prove that he was the better fighter without the use of magic, wanted to confirm his own place in the world. But then De\u0027Unnero discovered that the powerful centaur also watched the ranger, and as confident as he was, he did not desire to battle the two of them. He would bide his time, he decided, slipping back into the dark cover of the forest, though remaining close enough to watch the entire spectacle of the dance. Shamus Kilronney was on his way, with soldiers who would neutralize the ranger\u0027s friends. Then De\u0027Unnero could prove himself.","sourceLink":"https://allnovel.net/the-demon-apostle-the-demonwars-saga-3/page-28.html","bookId":2169,"book":{"id":2169,"title":"The Demon Apostle (The DemonWars Saga #3)","description":"Storyline: The Demon Apostle (The DemonWars Saga #3) With the demon dactyl and its foul minions defeated, the war-weary citizens of the kingdom of Honce-the-Bear wish only to begin rebuilding their broken lives. Yet the specter of civil war haunts the ravaged land -- and a specter more fearsome still. For the demon, though defeated, was not destroyed. And now its vengeful spirit has found an unholy sanctuary.The elf-trained ranger Elbryan Wynden presses north to reclaim the savage Timberlands from retreating goblin hordes. His companion, Pony, mistress of gemstone magic, turns south to the civilized -- but no less perilous -- streets of Palmaris. Suddenly they find themselves caught up in a ruthless power struggle to decide the fate of all Corona -- a struggle that will push their courage and love to the breaking point...and beyond.","cover":"https://allnovel.net/images/the-demon-apostle-the-demonwars-saga-3.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-demon-apostle-the-demonwars-saga-3.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:33:43 PM"}}
