{"id":98509,"no":30,"title":"Page 30","content":"\"Are ye to go out again, then, ye stubborn boy? \" Bradwarden asked before the dawn of the second day of their forced halt. Elbryan had awakened a short time before and, after a check on Tiel\u0027-marawee - who was resting more comfortably but did not yet seem ready to be moved - the young man began stripping off his clothing. \"Every day,\" the ranger replied. \"The sword dance is where I find my center of balance, where I clear my thoughts in preparation for the trials of the day.\" \"More likely that ye\u0027ll find a trial at the damned dance, if the Bishop\u0027s anywhere about,\" said the centaur. Elbryan\u0027s answer came in the form of a grin and an eager stride as he moved out of the camp. \"You keep a watch over our friends,\" he called back from forest\u0027s edge; and then he was gone, leaving Bradwarden alone with the seven sleeping forms. He went to the same clearing beside the small lake, stripped off the re-mainder of his clothing, and came out to the center with a deep and steady-ing breath, clearing his thoughts, dismissing his fears for Tiel\u0027marawee, for his other companions, for himself, and for Pony - who was more and more in his thoughts. With all the tumult moved aside, he became Nightbird, the elven-trained ranger, attuned to his surroundings. He felt the ice-crusted grass beneath his feet, saw the shimmer of the morning sun on the thinly glazed surface of the pond. Despite his concentration, Nightbird couldn\u0027t help considering the strangeness of the scene. In a normal year at this season, he might have found several feet of snow beneath his feet, and the pond would have been white with drifting snow and thick with gray ice instead of this meager coating. Now only part of the lake was iced over; the rest, near where the stream exited on the far bank, remained open water. It was indeed a strange winter, but that, Nightbird pointedly reminded himself, was something to ponder at another time, in another place. He had to get moving, had to get the blood flowing, for the icy grass was beginning to numb his feet. And so he fell intobi\u0027nelle dasada, the movements perfect in harmony and perfect in balance. He flowed with grace and precision, muscles inter-acting through balanced turns and balanced cuts of mighty Tempest. He did not think of the coming movement - did not have to, forbi\u0027nelle dasada was so familiar to his body, so embedded in his muscles and nerves, that every following movement came naturally and easily, twist and thrust fol-lowing rolling parry, leaps ending in sudden rushes, his legs and feet in the exact position to launch him forward as his feet gently touched the ground. The dance was not the same each day, far from it, for at Nightbird\u0027s level of mastery, he constantly improvised. Truly he was a beautiful sight, and to Bishop De\u0027Unnero, watching from the bushes and knowing this time that Nightbird had no allies in the imme-diate area, the ranger\u0027s dance only heightened his intrigue. This one would be a challenge, the monk knew, perhaps the greatest challenge he could possibly find. \"Without any armor, I see,\" De\u0027Unnero remarked, striding out into the open field. The Bishop wore only the simple brown robes of his Order, a white rope belt interwoven with strands of gold, and plain soft boots. A ring adorned one finger, but he showed no other jewelry, no gemstones. \"As are you,\" the ranger said calmly, not surprised at all, for the forest had told him of the man\u0027s presence; in truth, he had come here specifically hoping that De\u0027Unnero would show up. \"Yet I never fight in armor,\" De\u0027Unnero remarked, circling to the right. And the ranger, too, slowly took up a circular walk. \"Not even the leather jerkin worn by Nightbird, nor the heavy boots. It hardly seems fair.\" \"Fully clothed, I wear nothing that would stop the thrust of even a goblin\u0027s crude spear,\" Nightbird replied. \"So you do not admit disadvantage?\" De\u0027Unnero asked, for he wanted there to be no excuses later on. For the challenge to be proper, and the vic-tory to be savored, the fight had to be on even terms. \"Fair enough,\" the ranger replied with a wry smile, \"though you seem to have forgotten your weapon.\" De\u0027Unnero laughed, and as he did, he lifted his arm, his hand emerging from his voluminous sleeve and transforming into the tiger\u0027s paw. \"I carry my weapons closer to the skin, that is all,\" the Bishop explained. He gave a chuckle, not at the expression Nightbird then wore, but because of the ease with which he had enacted the transformation - the gemstone in his pouch and not even in his hand! Father Abbot Markwart had shown him some-thing wonderful, a newer and greater level of power. \"Continue,\" Nightbird bade him, \"all the way, into the form you used when you murdered the elf, when you murdered Baron Bildeborough and his entourage.\" Now De\u0027Unnero laughed louder. He considered the offer for just a moment, but shook his head. He wanted to beat Nightbird on even terms; by his estimation, his tiger arm was the equivalent of the beautiful sword the man carried. \"You know why I have come?\" he asked. \"I know that your Church can invent whatever excuse is convenient,\" the ranger replied. De\u0027Unnero was shaking his head. \"Not the Church, Nightbird,\" he ex-plained. \"I come to you as Marcalo De\u0027Unnero, not as Bishop De\u0027Unnero. Were you to offer your surrender now, Marcalo De\u0027Unnero would not want it, though Bishop De\u0027Unnero would have no choice but to accept it.\" The ranger cocked his head, not really understanding. \"I have come for you, De\u0027Unnero against Nightbird,\" the monk went on, \"as it has to be.\" Now the ranger laughed, catching onto the absurdity of it all. \"This is about pride, then, and not your twisted vision of justice,\" he reasoned. \"This is about who is the finer warrior.\" \"The finest warrior,\" De\u0027Unnero corrected. \"I have come to settle the issue.\" \"And then?\" \"And then, when I have torn out your heart and eaten it, I will settle with your friends,\" the Bishop promised, for he guessed correctly that the ranger would never allow him his pleasure for the sake of a mere challenge. \"I will kill the centaur first, and then the small, sneaky man. And then I will see to the monks. Perhaps I will offer them the chance to surrender, to return and face the charge of heresy, in their foolish hopes of finding mercy before Father Abbot Markwart. Or perhaps I will slaughter them, every one, and tear off their heads. Those trophies alone would satisfy my master.\" Nightbird stopped his circling; De\u0027Unnero did likewise. \"Do you have a God that you must pray to?\" De\u0027Unnero asked. \"My dance was my prayer,\" the ranger replied. \"A prayer that God will have mercy on the souls of those I am forced to kill.\" With a howl, the Bishop came on in a fury, knowing that his advantage lay in getting inside the long, deadly reach of the ranger\u0027s sword. Nightbird knew it, too, and though he was surprised by the agility and speed of the other man, he spun away, leaving Tempest\u0027s tip in line, forcing the Bishop to twist aside or impale himself. But, as soon as he passed beside that tip, De\u0027Unnero quickly slid low, then leaped high above the stabbing blade, kicking with one foot, con-necting glancingly on the ranger\u0027s shoulder. Again they faced off, but without words this time, just the intense stares of the purest and most hated rivals. The ranger silently debated whether he should give the deceptively quick man the offensive, or try to back him off with sudden and powerful straightforward attacks. The point became moot in the blink of an eye, for De\u0027Unnero leaped straight ahead, then landed with his legs in perfect order to propel him suddenly to the right. He spun in a circle, coming out of it with that deadly tiger\u0027s paw swiping for the ranger\u0027s head. Tempest missed on the thrust, but the ranger swung the blade about in time to partially deflect the sweeping arm, inflicting a nasty gash on the side of the tiger wrist, but taking a deep cut across his own left shoulder. The Bishop ignored the pain and continued forward, demanding a desperate and off-balance retreat from the ranger. Nightbird went ahead, dropping Tempest to the ground and leading with a heavy punch that caught the surprised De\u0027Unnero on the chin and buckled his knees. More for support than to attack, the Bishop wrapped his tiger\u0027s paw arm around the ranger and dug his claws in, trying to bring his other arm up to block the sudden flurry of left and right blows. Nightbird felt the burning pain just to the side of his spine. He knew that if he gave De\u0027Unnero any room, the man would tear half his back off. So he bore in harder, launching a short, heavy right punch to the man\u0027s ribs, then a sudden left hook to the chin that snapped De\u0027Unnero\u0027s head to the side. He felt the pull on his back as the stubborn Bishop started to turn away, so he hooked his right arm over the tiger limb, holding the man fast, more than willing to trade bare-fisted blows. Or so he thought. Marcalo De\u0027Unnero was the finest fighter ever to walk through the doors of St.-Mere-Abelle, the man who trained brothers jus-tice, none of whom had ever been more than a shadow of his martial arts brilliance. Nightbird had surprised him, had landed some stunningly pow-erful blows, but now De\u0027Unnero went to work, sending a series of short, sharp jabs to the ranger\u0027s chin - and to the chin only because Nightbird was smart enough to understand that the man was trying for his throat and that if De\u0027Unnero ever connected solidly there, the fight would be over. Even with the successful dodge, the ranger tasted blood. He traded another series of hits, then changed tactics, clamping his large hand over the Bishop\u0027s face and squeezing with all his strength. Immediately, the Bishop groaned and stopped punching, grasping desperately instead for the too-powerful arm. Nightbird thought the fight at its end, saw welcome victory before him. He continued the bear hug, keeping that deadly tiger paw in place as the muscles on his right arm flexed tighter, iron cords taut, driving his fingers into the man\u0027s flesh with such power that both of them thought the Bishop\u0027s head would explode under the pressure. De\u0027Unnero grabbed and pulled, but he was no match in strength for the powerful ranger. Nightbird growled in victory. But then he felt a sudden sharp pain in the center of his wrist, just under his palm, as De\u0027Unnero worked the tip of his thumb perfectly into the pressure point. To the ranger\u0027s amazement, his index and little fingers weak-ened; to his horror, De\u0027Unnero wrenched his head away from the ranger\u0027s grasp and yanked the ranger\u0027s arm away. Instinct sent Nightbird\u0027s head forward, as De\u0027Unnero snapped his head forward; only luck brought the ranger\u0027s forehead lower than the Bishop\u0027s, the two heads connecting with devastating force. Both men staggered, but De\u0027Unnero had taken the brunt of the blow. Clearly dazed, the Bishop lifted his knee quickly, aiming for the ranger\u0027s groin, but Nightbird turned his leg, accepting the hit on the thigh. The movement cost the ranger some measure of balance, and he had no choice but to go along when De\u0027Unnero suddenly launched himself backward and to the ground, the pair landing and rolling down the short slope right into the cold lake. They rested for just an instant on the ice, but then broke through into the icy water. Water churned and reddened about them, and both were too stunned by the sudden icy grip and lack of air to continue their fight. Nightbird came up gasping and splashing, expecting De\u0027Unnero to sur-face right beside him. What he got instead was a view of Bradwarden and Roger, the two moving across the clearing. When they spotted their friend, they came ahead fast. \"When did yer dance take to the water?\" Bradwarden asked, galloping over to help his hurt and dazed friend from the dangerously frigid water. Elbryan came up shivering and bleeding, and one look at the lines across his back, a wound so similar in appearance to that of Tiel\u0027marawee, told the other two what had transpired. Out came the great bow, Bradwarden stringing it and then setting an arrow in one fluid motion. \"H-he is in the w-water,\" Elbryan said through chattering teeth. Roger pulled the cloak from his back and wrapped it about his friend, his expression incredulous. \"Bishop De\u0027Unnero did this to you?\" he asked. \"Where is the fool?\" the centaur asked. \"Did ye kill him? Or hurt him enough to drown the rat?\" Elbryan shrugged and turned to scan the lake, not certain. Then they had their answer, as De\u0027Unnero\u0027s head bobbed out of the water near the center of the lake, moving away from them for just an in-stant, then disappearing under the surface. Bradwarden let fly anyway, his arrow skimming harmlessly across the surface. \"Well, he\u0027s havin\u0027 to come out,\" the centaur said, setting another missile. \"And then I\u0027ll be gettin\u0027 me chance!\" Even as he finished, the Bishop emerged as a great cat, coming out of the lake and into the forest in such a rush that Bradwarden didn\u0027t even have the chance to let the arrow fly. \"At least he is running,\" said Roger. Elbryan shook his head, not believing that for a moment. This man would not run; this man, dangerous enough to win out against them all, was far from finished. \"We can catch him then,\" Roger offered. \"But the elf\u0027s up for no run,\" Bradwarden reminded, \"barely a walk, by me thinkin\u0027.\" \"Whatever course we choose, we are better by far if we are all together,\" the ranger reminded, moving to his clothes and dressing quickly. The three set off for the camp then, and found Symphony on their way, the ranger having telepathically instructed the stallion to keep close. Tiel\u0027marawee was in better shape this day, but still far from being able to travel on her own. They felt that they could move her, though at a very slow pace. With De\u0027Unnero near, Elbryan did not want to stay in one place. The man would likely find a way to strike hard at them. So they went on slowly and covered no more than three miles all through the day. Symphony and his rider ran a perimeter all the way, the ranger searching, hoping that he would find De\u0027Unnero again. Whenever he got far enough from watchful Bradwarden, he shouted out challenges to the dark forest, hoping to lure the man, or tiger, out. But he saw no sign of the Bishop that day nor the next, nor the next after that. And then they had to rest again, for Tiel\u0027marawee could not continue. She begged them to leave her, asking only for supplies to see her through the week and assuring them that she would be able to survive on her own by that time. Of course, not a one of them, not the ranger or centaur, not Roger Lockless or any of the five monks, paid the babbling elf any heed whatsoever. They set camp and they waited, as the next day slipped past and the next after that, and then, on the morning of the third day, Bradwarden galloped into the camp. \"We got soldiers coming fast from the south,\" he explained. \"And I\u0027m bettin\u0027 that our friend the Bishop\u0027s ridin\u0027 with them.\" Elbryan was up on Symphony in seconds, turning the stallion to follow Bradwarden\u0027s lead. \"Secure the camp!\" he called to Roger and Braumin. \"Hold a tight group, with every back covered. The soldiers might have come against us, but even if that is not the case, the Bishop may well use this time to strike.\" He gave the horse a telepathic call, and Symphony leaped away, easily pacing the centaur. By the time they reached the high bluff, the vantage point from which Bradwarden had spied the approaching troop, the sol-diers were close enough to identify. \"Shamus Kilronney,\" the ranger muttered. \"And De\u0027Unnero ridin\u0027 beside him,\" the centaur remarked. \"And we\u0027re not for runnin\u0027, unless ye\u0027re thinkin\u0027 o\u0027 lettin\u0027 Tiel\u0027marawee fend for herself.\" \"No running,\" Elbryan said firmly. \"More than a score o\u0027 them,\" the centaur pointed out. \"Runnin\u0027s seemin\u0027 a good idea to me.\" \"We are not running,\" the ranger declared. \"I was talkin\u0027 about them,\" Bradwarden said dryly. The ranger gave him an appreciative, sidelong glance. \"Should we be tellin\u0027 the others?\" Bradwarden asked. Elbryan considered that for a long while. \"The monks have no offensive magic,\" he explained. \"No magic at all, in fact. I do not know how they will fare against the likes of an armored horseman.\" \"Bah, ye\u0027re just lookin\u0027 to keep all the fun to yerself,\" the centaur replied. \"We\u0027ll send our companions into hiding,\" the ranger reasoned, \"and then go to face Shamus and his men. If it comes to blows ...\" \"Ye\u0027re thinkin\u0027 it won\u0027t?\" Bradwarden asked incredulously. \"De\u0027Unnero\u0027s with them, and I\u0027m not believin\u0027 for a blinkin\u0027 eye that he came all the way out here for talkin\u0027!\" \"Then we hit them from afar, and scatter into the forest,\" the ranger explained. \"Two ain\u0027t scatterin\u0027,\" Bradwarden explained. \"Two\u0027s just runnin\u0027.\" \"Same thing,\" Elbryan replied. \"We show them a mighty chase, firing back at them all the while, thinning their numbers until we think we can rush in and defeat those remaining.\" \"We could be doin\u0027 that now,\" the centaur insisted. \"Lead on, then,\" the ranger answered, calling his bluff. Of course, they did it Elbryan\u0027s way, going back to the others and charging Roger and Brother Castinagis with hiding and securing the group. Back on the main trail soon after, the pair had no trouble locating Shamus and the soldiers, the group coming straight up the one clear trail. The riders pulled up short some thirty yards from the ranger and the cen-taur, Shamus in the middle of the front line of three and De\u0027Unnero, astride a horse - an uncommon seat for the monk - flanking him on the right. \"Pleased I am to see Shamus Kilronney again,\" the ranger called out, \"or would be, if you had come to me in better company.\" De\u0027Unnero whispered something to the captain, and Shamus called out, \"We have come to take you, Nightbird, and to take the centaur and your monk friends. You keep company with outlaws of the Abellican Church. Gather them; you will be treated fairly, I promise.\" \"Go kiss a - \" Bradwarden started, but Elbryan cut him short. \"Iwill be treated fairly?\" the ranger asked, emphasizing the personal pronoun. \"Would such treatment include the pleasure of watching my friends be hanged? Or burned at the stake, perhaps - I am told that is a favorite game for Abellican monks.\" \"We do not wish to fight you,\" Shamus explained. \"Ye\u0027re smarter than ye look, then,\" Bradwarden replied. The captain glanced nervously at De\u0027Unnero again. Shamus held a healthy respect for Nightbird, but he had no doubt that he and his soldiers could easily overpower the man and his few companions. That wasn\u0027t the problem, however. A long, tense moment passed. \"Take them,\" De\u0027Unnero said to Shamus. Then, when the captain made no move, he repeated the order to the soldiers. Several of the men started forward, but Shamus held up his arm, and they obediently stopped. It was, perhaps, the most terrible moment in the life of Shamus Kil-ronney. Nightbird and he had sealed a friendship in short weeks, because they had found the trust necessary to battle as close allies. He knew this man, knew his heart, and did not believe for a moment that Nightbird had committed any real crimes against the Church, and certainly not against the state. And yet Shamus could not ignore the presence of the centaur, taken from the dungeons of St.-Mere-Abelle by Nightbird\u0027s own admission, nor the rogue monks, who would be tried and likely convicted of heresy and treason. He looked down the path to Nightbird, locked the man\u0027s green eyes with his own stern gaze. \"Take them!\" De\u0027Unnero ordered. \"And I shall lead!\" With that, the Bishop lifted his arm, his great and deadly tiger\u0027s paw, and swept it forward in a powerful motion, leaping his horse ahead. \"Stop!\" Shamus cried before soldiers began to follow. De\u0027Unnero under-stood completely that he would be no match for the combined power of Elbryan and the mighty centaur. De\u0027Unnero tugged his horse around and sat staring at the captain in disbelief. And Shamus was staring back - or more pointedly, he was staring at that tiger arm and remembering the fate of Baron Bildeborough. \"Now, Captain,\" De\u0027Unnero growled at him, \"I am the Bishop of Pal-maris and I order you to arrest that man and that filthy creature beside him!\" Elbryan and Bradwarden exchanged knowing looks and smiles; Shamus Kilronney\u0027s expression spoke volumes. Predictably, the captain shook his head. \"I\u0027ll not go against Nightbird,\" he explained. \"Nor will my men.\" \"Outlaws, then!\" De\u0027Unnero screamed. \"All of you!\" He waved his paw to encompass them all. \"Any who do not follow me mark themselves as out-laws of the Abellican Church; and that, I promise you, is no enviable posi-tion!\" He turned as if to charge at the ranger and the centaur then, and there came some uneasy movements from the soldiers behind him, but none would follow - none would ride past Shamus Kilronney, their trusted leader. \"Come on then yerself,\" Bradwarden bade the Bishop. \"Ain\u0027t never ate a human, but for yerself, I might be makin\u0027 an exception.\" \"This is not settled,\" De\u0027Unnero said to Nightbird. \"You will not escape me this time.\" \"I am not even trying to run,\" the ranger said grimly. De\u0027Unnero stared at him hard, and at his mighty companion, then turned to study Shamus Kilronney and his foolish soldiers. Elbryan understood what would happen then, and so he propelled his great horse ahead at a charge. De\u0027Unnero reacted quickly, turning his own horse and driving his heels into the creature\u0027s flanks, rushing past Shamus and the soldiers, down the southern road. Bradwarden moved next, lifting his great bow and shooting a huge arrow, but the Bishop, anticipating such an attack, veered his horse left and then right, and the arrow whizzed past him harmlessly. Up came Hawkwing, but before the ranger could let fly, Symphony gaining on the lesser horse with every tremendous stride, the Bishop sur-prised him by leaping from his mount, transforming immediately, robes and all, into the sleek form of the great tiger, and then darting to the side of the trail into the brush. In charged Symphony, Nightbird slinging Hawkwing over his back, for he knew that he\u0027d find no shot in here, then bending low and drawing out Tempest. He urged Symphony on, and the great horse thundered ahead at all possible speed. But the horse was no match for the sleek, swift tiger in the thick brush, and when Nightbird broke out of the tangle in a clearing, he saw De\u0027Un-nero already bounding into the brush at the other side, in full flight to the south. The ranger pulled Symphony up to a trot, realizing that he would not catch the man. He turned the horse, coming back to the others, to see the soldiers still shaking their heads and chattering in disbelief, for they had never seen such a thing as a man transforming into a great cat! \"And so we are outlaws,\" the ranger said to Shamus as he walked his mount back to the group, \"declared so by the murderer of Baron Rochefort Bildeborough.\"","sourceLink":"https://allnovel.net/the-demon-apostle-the-demonwars-saga-3/page-30.html","bookId":2169,"book":{"id":2169,"title":"The Demon Apostle (The DemonWars Saga #3)","description":"Storyline: The Demon Apostle (The DemonWars Saga #3) With the demon dactyl and its foul minions defeated, the war-weary citizens of the kingdom of Honce-the-Bear wish only to begin rebuilding their broken lives. Yet the specter of civil war haunts the ravaged land -- and a specter more fearsome still. For the demon, though defeated, was not destroyed. And now its vengeful spirit has found an unholy sanctuary.The elf-trained ranger Elbryan Wynden presses north to reclaim the savage Timberlands from retreating goblin hordes. His companion, Pony, mistress of gemstone magic, turns south to the civilized -- but no less perilous -- streets of Palmaris. Suddenly they find themselves caught up in a ruthless power struggle to decide the fate of all Corona -- a struggle that will push their courage and love to the breaking point...and beyond.","cover":"https://allnovel.net/images/the-demon-apostle-the-demonwars-saga-3.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-demon-apostle-the-demonwars-saga-3.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:33:43 PM"}}
