{"id":98514,"no":36,"title":"Page 36","content":"\"They are not so far behind,\" Pony remarked doubtfully, for she and Colleen had spotted the northward-bound forces of Markwart and King Danube two days before, many miles back at that time, but closer, it seemed, each day. The two women didn\u0027t know the disposition of the force, of course, but the mere fact that so large a contin-gent was outpacing them told them both that these were not ordinary folk, or even common Kingsmen.\n \"No choice for us,\" Colleen replied. \"Ye\u0027ve got that fine horse o\u0027 Connor\u0027s under ye, but me own poor nag\u0027s not for runnin\u0027 much longer. Besides, it might well be that yer Nightbird\u0027s in Caer Tinella.\"\n Pony shook her head. Elbryan was long gone from the place, she knew, in Dundalis, at least, and probably even farther north. The blond woman glanced back over her shoulder, down the southern road. They were a few hours ahead of the moving force, no more, and the thought of stopping for Colleen to get a fresh horse, and of conversing with villagers, who would likely be interrogated afterward, bothered her. But seeing her companion\u0027s mount, the mare lathered in sweat and walking awkwardly, for she had thrown a shoe, Pony found that she could hardly disagree. They would get a new horse here, or Colleen would be walking very soon.\n \"Perhaps we can find someone on the outskirts,\" Pony suggested, \"a farmer out readying fields or gathering firewood, who can help us.\"\n Colleen nodded and Pony led on, circling the village of Landsdown, and then Caer Tinella, to the east. They did spot a couple of men out cutting wood, and spent some time watching the pair from the shadows of the forest\u0027s edge. But then they heard the rumble of a wagon and the neighing of a horse.\n Moving through the trees, the women soon came to a hillock overlooking a trail heading east, and there, rumbling down the road, two horses drawing his wagon and another pair tied behind, came an enormous man with black, bushy hair, singing and laughing.\n And wealing the robes of an Abellican monk.\n \"Don\u0027t ye even think o\u0027 killin\u0027 the man,\" Colleen whispered.\n Pony turned an astonished glare at her. \"Kill him?\" she echoed. \"I do not even know him!\"\n \"Ye know his robes,\" Colleen said quietly.\n Pony winced and lowered her gaze, sighing. She was no murderer; never would she strike one who did not deserve it. She wondered then if that was a distinction that she could morally make. Who was she, after all, to decide who deserved to live and who did not? Though her hatred for Markwart had not abated, though she believed that if he was in front of her, vulnerable, she would try to strike him down again, Pony worried that she was a lost soul.\n She shook the troubling thoughts away. Now she had to get one of those horses, preferably without letting the monk know about it. But how? Pony considered her gemstones. She could use diamond, perhaps to bring a spot of darkness into the monk\u0027s eyes, blinding him, and then malachite to lift him high into the air. He might be oblivious of the theft until Pony let him back down and removed the blackness - perhaps even longer if he didn\u0027t immediately notice that a different horse had been tethered behind his wagon.\n He would know that magic had been used against him, though, gemstone magic. He might even be able to identify the stones used, and wouldn\u0027t that be an easy trail for the minions of Markwart to follow?\n No, she needed to be subtle. \"Go down to the road a hundred yards ahead of him,\" she instructed Colleen. \"Dismount and unsaddle your horse. When he passes, and becomes distracted, be quick and quiet in changing horses with one of those tethered to the back of his wagon.\"\n \"I\u0027d rather have one from the front,\" the warrior woman replied, but when Pony turned to glare at her, she saw that Colleen was smiling.\n \"Just go,\" she said dryly.\n Despite her mood, Pony did manage a slight smile as Colleen walked her mount away. The woman had become a true friend, a pleasure to be around, one who could read Pony\u0027s moods and say just the right things to bring her from darkness or to keep her focused on the present. Pony reached into her pouch and took out her soul stone, then reached into her mind and conjured an image, a reflection of herself standing by a lake afterbi\u0027nelle dasada. She burned that image into her mind, changing it so that she wouldn\u0027t be recognizable, and covering parts of her naked form with diaphanous veils.\n Pony clutched the hematite tightly, wondering if she could really pull this off. She would have to be perfect, she realized. One slip would show the monk the truth of the contact, and then all would be lost.\n She fell into the stone, again summoning that image and sending it into the mind of the monk.\n Friar Pembleton whistled and sang, enjoying the fine weather, thinking that spring should begin any day.\n \"Any day!\" he cried aloud. \"Ha-ha!\" He gave a click and shook the reins, urging his team faster. He wanted to make Caer Tinella before mid- morning; Janine o\u0027 the Lake had promised him a fine meal if he arrived before she had cleaned her table. He wanted . . .\n It came to him suddenly, out of nowhere, it seemed, an image alluring and amazing. The friar let up on urging the horses. The wagon slowed, nearly to a stop, but the befuddled man hardly noticed. He sat very still and closed his eyes, trying to make sense of this overwhelming image of a beau-tiful, tempting woman that had so unexpectedly flooded his thoughts.\n He tried to wash it away, even mumbled the beginnings of a prayer.\n But it was no use. There she was, so beautiful, and he couldn\u0027t dismiss her, and surely couldn\u0027t ignore her!\n The wagon was hardly moving.\n Colleen Kilronney came out of the brush behind it, leading her horse. She made the change, amazed and confused, wondering what Pony had done to the man!\n When she rejoined Pony with her fresh horse a few minutes later, she found the woman still deep in concentration, still holding the soul stone in her hand. Colleen looked down the road and saw the wagon crawling along, the friar swaying.\n \"What did ye do to him, then?\" the red-haired woman asked, drawing Pony from the stone magic.\n \"I gave him something better to watch,\" Pony replied cryptically.\n Colleen looked at her, confused for just a moment, but then a wry smile spread over her face. \"Ah, but ye\u0027re a wicked one!\" she said with a laugh.\n The two set off at once, moving down to the trail, then following it east, away from the still very distracted monk.\n Friar Pembleton continued slowly on his way, trying to recapture the image all the way to Janine o\u0027 the Lake\u0027s farm. He never even noticed that one of the horses tied to the back of his wagon - one of the two he was planning to sell in the village - had changed until he moved to untie the beasts outside Janine\u0027s door.\n They came through Caer Tinella and Landsdown with little fanfare, but surely the two hundred people who had resettled in the region were amazed by the splendor of the procession, by the fabulous Allheart Brigade, riding their famous To-gai-ru pintos.\n The force put in at Caer Tinella that the soldiers could rest their horses, checking shoes and saddles, and could oil armor and weapons. Markwart and Danube agreed that they would not remain stationary for more than an hour, though they would only find another two hours on the road after that before sunset forced them to camp.\n \"Brother Simple!\" Janine o\u0027 the Lake remarked, seeing De\u0027Unnero among those leaders gathered in the common house of Caer Tinella. \"Ye back in the south so soon? I\u0027d thought ye going to Dundalis, to bring yer God to the Timberlands.\"\n De\u0027Unnero merely turned away, having no desire to speak with the peasant woman.\n \"Seems that many\u0027re heading north this season,\" Janine remarked, heading for the door.\n Markwart caught the words, and promptly intercepted her. \"What do you mean?\" he asked. \"Of whom do you speak?\"\n The woman shrugged. \"A friend says he saw a pair riding north just this morning, not six hours before ye came into Caer Tinella, is all,\" she replied. \"That and yer Brother Simple there, who came through a pair o\u0027 weeks ago.\"\n \"Two riders?\" Markwart asked. \"And was one of them, or both, per-haps, a woman?\"\n Again the shrug. \"He just says he saw a pair. A long way off, so he\u0027s not for knowing. Been a curious day, is all. Friar Pembleton o\u0027 yer own came in this morning with horses to sell, and now he\u0027s spouting craziness that one of them he brought to sell wasn\u0027t his own, that the beast changed form during the trip, and was nearly lame, and missing a shoe - one he insists was on the beast that morning!\"\n \"There is an Abellican friar in town?\" Markwart asked. His inner voice prodded him that there might be something significant here.\n \"Just said there was,\" Janine replied. \"He\u0027s all flustered, to be sure, at yer arrival. He\u0027s cleaning up and will be along presently, I\u0027d be guessing.\"\n Even as she spoke, Friar Pembleton bounded in, glancing about ner-vously and wringing his hands. He spotted the Father Abbot standing with Janine, De\u0027Unnero not far away, and shuffled over, bowing with every step.\n \"I did not know ye were coming, Father Abbot,\" he sputtered. \"Had I known ...\"\n Markwart raised a hand to calm the man. \"You had problems with a horse, I am told,\" he said.\n Friar Pembleton\u0027s eyes widened and he looked over at Janine, seeming horrified that the Father Abbot knew the tale. Would the great man think him crazy? \"I - I was confused - am confused, I am sure,\" he stammered. \"Surely it does not look like my horse, but I get so many - I traded many with the caravan you sent north from St.-Mere-Abelle just last year, Father Abbot.\"\n Again Markwart patted his hand in the air to calm the man. \"The horse has gone lame?\"\n Pembleton shrugged. \"I know not how to even answer,\" he said. \"I have no recollection. ...\"\n \"Are you trying to cheat these people, good friar?\" Markwart asked. De\u0027Unnero walked over and stood by the man, and though Pembleton outweighed him by fifty pounds, the friar was unnerved by his powerful presence.\n \"No, Father Abbot, never that!\" he cried. \"I have been dealing with Caer Tinella for many years, and would never cheat - \"\n \"A good man with honest prices for honest goods,\" Janine interjected.\n \"What is it, Pembleton? \" Markwart asked calmly. \"Is the horse the same one you left your chapel with?\"\n The friar seemed at a loss, and glanced around repeatedly. \"Has to be,\" he mumbled. \"Has to be. One cannot change a horse on the back of a wagon without the driver knowing it, after all! I just do not recognize ...\"\n \"Is it the same horse?\" Markwart pressed.\n Pembleton glanced nervously around.\n \"Look at me!\" Markwart demanded, locking the man\u0027s gaze with his own, \"and answer honestly.\"\n \"It\u0027s not my horse,\" Pembleton replied.\n Janine snorted and rolled her eyes.\n \"Truthfully, Father Abbot,\" the friar said frantically, \"I have had every horse in my stable for months - since the caravan from St.-Mere- Abelle came through - and I know every one, and this is not one of them. I have shoed every horse in my care, yet this one wears shoes that I do not know.\"\n Markwart looked at De\u0027Unnero. \"Take some of the St. Precious monks and go to this horse,\" he instructed. \"See if they recognize the shoes.\" Then he turned back to Pembleton and took great care to calm the man, asking him to detail every part of the journey from his chapel to the town. Pem-bleton did just that, but stuttered at one point; again, Markwart\u0027s inner voice told him that might be significant.\n He led the friar aside, and the man confessed his sin of the mind.\n It was much more than that, Father Abbot Markwart realized, and that was confirmed when De\u0027Unnero returned with news that one of the monks had recognized the shoes as the work of the former baron\u0027s own black-smith, who marked all the shoes he made with a special brand, a combina-tion of his initials.\n The horse, who had so mysteriously replaced the one Friar Pembleton had hitched to the back of his wagon - a wagon he had not left, he insisted, all the way to Caer Tinella - had come from Palmaris, and, by De\u0027Unnero\u0027s estimate, had been ridden hard recently.\n Intrigued, Markwart said no more about it. Later, after the group camped two hours north of Caer Tinella, the Father Abbot returned to his tent and eagerly took up his soul stone. He went quickly north, scouring the region - and he found his quarry, camped beneath the drooping boughs of an ancient pine, their horses tethered nearby. Markwart recognized one of those horses - had seen it on the field outside Palmaris - and so he was notsurprised when his spirit slipped through the pine boughs and found his archenemy resting with her back against the tree, with another woman, larger, and wearing the uniform of a Palmaris city guard, lying nearby.\n Markwart considered moving right in. But she might be more prepared for him this time, he realized, and he did not have her unborn child this time to use against her undeniably strong will. And he could not be sure if Dasslerond was in the area.\n His spirit rushed back to his waiting form. He went out of his tent, calling for Marcalo De\u0027Unnero.\n The tiger set off soon after, running straight for the drooping pine.\n Or so De\u0027Unnero thought. He encountered many obstacles that Mark-wart\u0027s spirit had bypassed, and by the time he reached the place, dawn had broken and the women were gone. De\u0027Unnero\u0027s frustration lasted only as long as it took him to realize he was not alone, that the spirit of the Father Abbot was with him.\n \"Hear me through the soul stone ring you wear,\" the Father Abbot instructed. \"Attune your thoughts to my spirit and I will guide you.\"\n Away rushed Markwart, faster than the north wind.\n He sensed the women\u0027s position, then called back to De\u0027Unnero; the chase, though Pony and Colleen didn\u0027t know it, was on.\n By mid-morning, the tireless De\u0027Unnero had them in sight, while Mark-wart, his physical form still being comfortably borne on a litter by running monks, hovered nearby. Markwart understood Pony\u0027s power, and feared that De\u0027Unnero might be overmatched if she was ready for him, if she had her gemstones in hand.\n So he went first, telepathically, screaming into her horse\u0027s mind.\n Greystone reared and bucked, and Pony barely kept her seat. The horse spun, kicking at the air. Colleen yelled out, trying to make some sense of it all.\n Pony flew out of the saddle, the breath blasted from her as she landed on her back. She had the presence of mind to roll out of the way of Grey-stone\u0027s pounding hooves.\n \"What\u0027d ye do to the thing?\" Colleen called, and her words ended abruptly as something large crashed into her, driving her from her saddle. It took her a long while to recover, gathering her wits and wiping the blood and mud from her eyes. Then she saw a monstrous form standing over Pony. She tried to scream but could not, for she could hardly believe the sight before her. From the waist up the creature was a strong man, its face half human, a strange blend of man and cat. It stood in a crouch over Pony, on the legs of a cat, a striped tail swishing, staring down at the woman. Pony tried to get her arms in line to block, but De\u0027Unnero\u0027s hand punched into the center of her chest, stealing her breath. Pony jerked up, swung her arms about to try to fend him off, but she was dazed, all strength stolen from her.\n Colleen forced herself to her feet and started to draw her sword.\n The creature leaped away from Pony, turning to face her.\n \"I\u0027ll be payin\u0027 ye back for that one!\" Colleen screamed, rushing ahead, her sword slashing viciously.\n Up went De\u0027Unnero, springing straight into the air above her slashing sword, and then down hard, putting his full weight behind a tremendous punch that smashed into Colleen\u0027s breastbone, driving her down, stag-gering backward.\n She gave a weak swipe with the sword and stared helplessly as her oppo-nent\u0027s hand evaded the blade, moving much too fast for her to adjust her swing. The hand grabbed her blade and shoved it farther away. Then De\u0027-Unnero spun, rolling toward Colleen, his hand slapping her face, knocking her back several more steps.\n And still he was right in front of her, twisting her sword arm up, then bending her wrist, easily disarming her.\n He leaped, rolling over her as he went, never letting go, coming down and twisting Colleen, then using his leverage to throw her under the legs of her nervous horse.\n \"Run!\" she heard Pony call, and she saw the tiger turn to regard her friend, then saw him stagger back, blasted by a lightning bolt.\n But the powerful creature growled and rushed right back at Pony, falling upon her before she could loose another bit of magic.\n Colleen scrambled to her feet, coming up on the other side of her horse. She had the beast in a run before she was fully in the saddle, for the tiger came on in fast pursuit.\n Her horse crashed through the forest, branches banging into poor Colleen, nearly knocking her senseless. She heard the creature behind, and realized then the truth about the death of her beloved Baron.\n Her horse took a sharp turn, and she could not hold on, falling down through some evergreen bushes, then sliding through snow and mud down the steep side of a ravine. Bouncing and tumbling, she lost consciousness long before she slammed into a tree stump far below.\n She did hear the dying screams of her horse as the tiger fell upon it.\n Only the angry specter of Father Abbot Markwart brought De\u0027Unnero from his feast of horseflesh. He came fully out of his tiger state then - to call it coming from his gemstone any longer made no sense, for he wasn\u0027t even certain of where the magical tiger\u0027s paw might be. He didn\u0027t have it in hand nor in his pouch, but he didn\u0027t need it any longer, as if somehow he and the gemstone had merged.\n But he let go of his feline side completely now, understanding Markwart\u0027s ire and fearing it more than he lusted for the sensation of the kill. Nearly drunk on the life energies of the horse, he came back to Pony, reaching down to check that she was still alive, hoping he had not hit her too hard after she had struck him with the lightning bolt. Markwart\u0027s instructions had been very clear: De\u0027Unnero was to bring Pony back alive, along with the stolen gemstones. Markwart didn\u0027t care at all about the other woman.\n Pony came back to consciousness a long time later, to find herself standing, her back against a tree, her hands tied painfully around the trunk.\n And there stood Marcalo De\u0027Unnero, eyes narrowed and boring into hers.\n \"Do you not understand the power of your enemies?\" he asked, moving up to her, his face barely an inch from hers.\n Pony turned away, unable to look him in the eye. He caught her by the chin and roughly turned her back to face him. For a moment, she thought he would choke the life from her or smash her face to a pulp, but then a wry smile widened across his hard face.\n Pony nearly swooned; she was helpless against him. He could do any-thing to her, could take her then and there.\n \"So beautiful,\" De\u0027Unnero remarked, suddenly stroking her cheek, his demeanor changing completely. Pony would rather that he kill her!\n She turned away again, but his hand had her by the chin immediately, jerking her head back.\n \"Beautiful and powerful,\" De\u0027Unnero said, \"skilled with the stones and with the blade, so I am told, and so strong of will.\"\n Pony set her jaw and narrowed her blue eyes.\n \"You fear that I will take you?\" De\u0027Unnero remarked, smiling wide. He grabbed the front of her shirt. \"You fear that I will tear off your clothes and leave you naked before me.\"\n Pony eyed him stubbornly, and did not reply.\n \"You do not even begin to understand me,\" De\u0027Unnero said, his face so close to her own. But then he backed away and let go of her shirt. \"I would fight you on an open field, and willingly kill you if you opposed me - as I shall kill your lover, the one called Nightbird,\" he explained. \"But I take no carnal pleasures with an unwilling woman. I am a man of God.\"\n Pony snorted and looked away. She expected De\u0027Unnero to grab her chin again and jerk her head back.\n \"Foolish child,\" she heard De\u0027Unnero say, the man walking away. \"You do not begin to understand those you have named your enemies.\"\n Pony had no answers.\n She heard horses then, an approaching cavalry, and soon they were all about her, Markwart and the monks, the soldiers in their shining mail, and the King of Honce-the-Bear! \n","sourceLink":"https://allnovel.net/the-demon-apostle-the-demonwars-saga-3/page-36.html","bookId":2169,"book":{"id":2169,"title":"The Demon Apostle (The DemonWars Saga #3)","description":"Storyline: \n The Demon Apostle (The DemonWars Saga #3) \n With the demon dactyl and its foul minions defeated, the war-weary citizens of the kingdom of Honce-the-Bear wish only to begin rebuilding their broken lives. Yet the specter of civil war haunts the ravaged land -- and a specter more fearsome still. For the demon, though defeated, was not destroyed. And now its vengeful spirit has found an unholy sanctuary.The elf-trained ranger Elbryan Wynden presses north to reclaim the savage Timberlands from retreating goblin hordes. His companion, Pony, mistress of gemstone magic, turns south to the civilized -- but no less perilous -- streets of Palmaris. Suddenly they find themselves caught up in a ruthless power struggle to decide the fate of all Corona -- a struggle that will push their courage and love to the breaking point...and beyond.\n \n","cover":"https://allnovel.net/images/the-demon-apostle-the-demonwars-saga-3.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-demon-apostle-the-demonwars-saga-3.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:33:43 PM"}}
