{"id":107536,"no":36,"title":"Page 36","content":"VIII At half-past six that evening, Howard and Shirley Mollison entered Pagford Church Hall. Shirley was carrying an armful of papers and Howard was wearing the chain of office decorated with the blue and white Pagford crest. The floorboards creaked beneath Howard\u0027s massive weight as he moved to the head of the scratched tables that had already been set end to end. Howard was almost as fond of this hall as he was of his own shop. The Brownies used it on Tuesdays, and the Women\u0027s Institute on Wednesdays. It had hosted jumble sales and Jubilee celebrations, wedding receptions and wakes, and it smelt of all of these things: of stale clothes and coffee urns, and the ghosts of home-baked cakes and meat salads; of dust and human bodies; but primarily of aged wood and stone. Beaten-brass lights hung from the rafters on thick black flexes, and the kitchen was reached through ornate mahogany doors. Shirley bustled from place to place, setting out papers. She adored council meetings. Quite apart from the pride and enjoyment she derived from listening to Howard chair them, Maureen was necessarily absent; with no official role, she had to be content with the pickings Shirley deigned to share. Howard\u0027s fellow councillors arrived singly and in pairs. He boomed out greetings, his voice echoing from the rafters. The full complement of sixteen councillors rarely attended; he was expecting twelve of them today. The table was half full when Aubrey Fawley arrived, walking, as he always did, as if into a high wind, with an air of reluctant forcefulness, slightly stooped, his head bowed. \u0027Aubrey!\u0027 called Howard joyfully, and for the first time he moved forward to greet the newcomer. \u0027How are you? How\u0027s Julia? Did you get my invitation?\u0027 \u0027Sorry, I don\u0027t - \u0027 \u0027To my sixty-fifth? Here - Saturday - day after the election.\u0027 \u0027Oh, yes, yes. Howard, there\u0027s a young woman outside - she says she\u0027s from the Yarvil and District Gazette. Alison something?\u0027 \u0027Oh,\u0027 said Howard. \u0027Strange. I\u0027ve just sent her my article, you know, the one answering Fairbrother\u0027s ... Maybe it\u0027s something to do ... I\u0027ll go and see.\u0027 He waddled away, full of vague misgivings. Parminder Jawanda entered as he approached the door; scowling as usual, she walked straight past without greeting him, and for once Howard did not ask \u0027how\u0027s Parminder?\u0027. Out on the pavement he found a young blonde woman, stocky and square, with an aura of impermeable cheerfulness that Howard recognized immediately as determination of his own brand. She was holding a notebook and looking up at the Sweetlove initials carved over the double doors. \u0027Hello, hello,\u0027 said Howard, his breathing a little laboured. \u0027Alison, is it? Howard Mollison. Have you come all this way to tell me I can\u0027t write for toffee?\u0027 She beamed, and shook the hand he proffered. \u0027Oh, no, we like the article,\u0027 she assured him. \u0027I thought, as things are getting so interesting, I\u0027d come and sit in on the meeting. You don\u0027t mind? Press are allowed, I think. I\u0027ve looked up all the regulations.\u0027 She was moving towards the door as she spoke. \u0027Yes, yes, press are allowed,\u0027 said Howard, following her and pausing courteously at the entrance to let her through first. \u0027Unless we have to deal with anything in camera, that is.\u0027 She glanced back at him, and he could make out her teeth, even in the fading light. \u0027Like all those anonymous accusations on your message board? From the Ghost of Barry Fairbrother?\u0027 \u0027Oh dear,\u0027 wheezed Howard, smiling back at her. \u0027They\u0027re not news, surely? A couple of silly comments on the internet?\u0027 \u0027Has it only been a couple? Somebody told me the bulk of them had been taken off the site.\u0027 \u0027No, no, somebody\u0027s got that wrong,\u0027 said Howard. \u0027There have only been two or three, to my knowledge. Nasty nonsense. Personally,\u0027 he said, improvising on the spot, \u0027I think it\u0027s some kid.\u0027 \u0027A kid?\u0027 \u0027You know. Teenager having fun.\u0027 \u0027Would teenagers target Parish councillors?\u0027 she asked, still smiling. \u0027I heard, actually, that one of the victims has lost his job. Possibly as a result of the allegations made against him on your site.\u0027 \u0027News to me,\u0027 said Howard untruthfully. Shirley had seen Ruth at the hospital the previous day and reported back to him. \u0027I see on the agenda,\u0027 said Alison, as the pair of them entered the brightly lit hall, \u0027that you\u0027ll be discussing Bellchapel. You and Mr Fairbrother made good points on both sides of the argument in your articles ... we had quite a few letters to the paper after we printed Mr Fairbrother\u0027s piece. My editor liked that. Anything that makes people write letters ...\u0027 \u0027Yes, I saw those,\u0027 said Howard. \u0027Nobody seemed to have much good to say about the clinic, did they?\u0027 The councillors at the table were watching the pair of them. Alison Jenkins returned their gaze, still smiling imperturbably. \u0027Let me get you a chair,\u0027 said Howard, puffing slightly as he lifted one down from a nearby stack and settling Alison some twelve feet from the table. \u0027Thank you.\u0027 She pulled it six feet forward. \u0027Ladies and gentlemen,\u0027 called Howard, \u0027we\u0027ve got a press gallery here tonight. Miss Alison Jenkins of the Yarvil and District Gazette.\u0027 A few of them seemed interested and gratified by Alison\u0027s appearance, but most looked suspicious. Howard stumped back to the head of the table, where Aubrey and Shirley were questioning him with their eyes. \u0027Barry Fairbrother\u0027s Ghost,\u0027 he told them in an undertone, as he lowered himself gingerly into the plastic chair (one of them had collapsed under him two meetings ago). \u0027And Bellchapel. And there\u0027s Tony!\u0027 he shouted, making Aubrey jump. \u0027Come on in, Tony ... we\u0027ll give Henry and Sheila another couple of minutes, shall we?\u0027 The murmur of talk around the table was slightly more subdued than usual. Alison Jenkins was already writing in her notebook. Howard thought angrily, This is all bloody Fairbrother\u0027s fault. He was the one who had invited the press in. For a split second, Howard thought of Barry and the Ghost as one and the same, a troublemaker alive and dead. Like Shirley, Parminder had brought a stack of papers with her to the meeting, and these were piled up underneath the agenda she was pretending to read so that she did not have to speak to anybody. In reality, she was thinking about the woman sitting almost directly behind her. The Yarvil and District Gazette had written about Catherine Weedon\u0027s collapse, and the family\u0027s complaints against their GP. Parminder had not been named, but doubtless the journalist knew who she was. Perhaps Alison had got wind of the anonymous post about Parminder on the Parish Council website too. Calm down. You\u0027re getting like Colin. Howard was already taking apologies and asking for revisions to the last set of minutes, but Parminder could barely hear over the sound of her own blood thudding in her ears. \u0027Now, unless anybody\u0027s got any objections,\u0027 said Howard, \u0027we\u0027re going to deal with items eight and nine first, because District Councillor Fawley\u0027s got news on both, and he can\u0027t stay long - \u0027 \u0027Got until eight thirty,\u0027 said Aubrey, checking his watch. \u0027 - yes, so unless there are objections - no? - floor\u0027s yours, Aubrey.\u0027 Aubrey stated the position simply and without emotion. There was a new boundary review coming and, for the first time, there was an appetite beyond Pagford to reassign the Fields to Yarvil. Absorbing Pagford\u0027s relatively small costs seemed worthwhile to those who hoped to add anti-government votes to Yarvil\u0027s tally, where they might make a difference, as opposed to being wasted in Pagford, which had been a safe Conservative seat since the 1950s. The whole thing could be done under the guise of simplifying and streamlining: Yarvil provided almost all services for the place as it was. Aubrey concluded by saying that it would be helpful, should Pagford wish to cut the estate away, for the town to express its wishes for the benefit of the District Council. \u0027... a good, clear message from you,\u0027 he said, \u0027and I really think that this time - \u0027 \u0027It\u0027s never worked before,\u0027 said a farmer, to muttered agreement. \u0027Well, now, John, we\u0027ve never been invited to state our position before,\u0027 said Howard. \u0027Shouldn\u0027t we decide what our position is, before we declare it publicly?\u0027 asked Parminder, in an icy voice. \u0027All right,\u0027 said Howard blandly. \u0027Would you like to kick off, Dr Jawanda?\u0027 \u0027I don\u0027t know how many people saw Barry\u0027s article in the Gazette,\u0027 said Parminder. Every face was turned towards her, and she tried not to think about the anonymous post or the journalist sitting behind her. \u0027I thought it made the arguments for keeping the Fields part of Pagford very well.\u0027 Parminder saw Shirley, who was writing busily, give her pen a tiny smile. \u0027By telling us the likes of Krystal Weedon benefit?\u0027 said an elderly woman called Betty, from the end of the table. Parminder had always detested her. \u0027By reminding us that people living in the Fields are part of our community too,\u0027 she answered. \u0027They think of themselves as from Yarvil,\u0027 said the farmer. \u0027Always have.\u0027 \u0027I remember,\u0027 said Betty, \u0027when Krystal Weedon pushed another child into the river on a nature walk.\u0027 \u0027No, she didn\u0027t,\u0027 said Parminder angrily, \u0027my daughter was there - that was two boys who were fighting - anyway - \u0027 \u0027I heard it was Krystal Weedon,\u0027 said Betty. \u0027You heard wrong,\u0027 said Parminder, except that she did not say it, she shouted it. They were shocked. She had shocked herself. The echo hummed off the old walls. Parminder could barely swallow; she kept her head down, staring at the agenda, and heard John\u0027s voice from a long way off. \u0027Barry would\u0027ve done better to talk about himself, not that girl. He got a lot out of St Thomas\u0027s.\u0027 \u0027Trouble is, for every Barry,\u0027 said another woman, \u0027you get a load of yobs.\u0027 \u0027They\u0027re Yarvil people, bottom line,\u0027 said a man, \u0027they belong to Yarvil.\u0027 \u0027That\u0027s not true,\u0027 said Parminder, keeping her voice deliberately low, but they all fell silent to listen to her, waiting for her to shout again. \u0027It\u0027s simply not true. Look at the Weedons. That was the whole point of Barry\u0027s article. They were a Pagford family going back years, but - \u0027 \u0027They moved to Yarvil!\u0027 said Betty. \u0027There was no housing here,\u0027 said Parminder, fighting her own temper, \u0027none of you wanted a new development on the outskirts of town.\u0027 \u0027You weren\u0027t here, I\u0027m sorry,\u0027 said Betty, pink in the face, looking ostentatiously away from Parminder. \u0027You don\u0027t know the history.\u0027 Talk had become general: the meeting had broken into several little knots of conversation, and Parminder could not make out any of it. Her throat was tight and she did not dare meet anyone\u0027s eyes. \u0027Shall we have a show of hands?\u0027 Howard shouted down the table, and silence fell again. \u0027Those in favour of telling the District Council that Pagford will be happy for the parish boundary to be redrawn, to take the Fields out of our jurisdiction?\u0027 Parminder\u0027s fists were clenched in her lap and the nails of both her hands were embedded in their palms. There was a rustle of sleeves all around her. \u0027Excellent!\u0027 said Howard, and the jubilation in his voice rang triumphantly from the rafters. \u0027Well, I\u0027ll draft something with Tony and Helen and we\u0027ll send it round for everyone to see, and we\u0027ll get it off. Excellent!\u0027 A couple of councillors clapped. Parminder\u0027s vision blurred and she blinked hard. The agenda swam in and out of focus. The silence went on so long that finally she looked up: Howard, in his excitement, had had recourse to his inhaler, and most of the councillors were watching solicitously. \u0027All right, then,\u0027 wheezed Howard, putting the inhaler away again, red in the face and beaming, \u0027unless anyone\u0027s got anything else to add -\u0027 an infinitesimal pause \u0027- item nine. Bellchapel. And Aubrey\u0027s got something to tell us here too.\u0027 Barry wouldn\u0027t have let it happen. He\u0027d have argued. He\u0027d have made John laugh and vote with us. He ought to have written about himself, not Krystal ... I\u0027ve let him down. \u0027Thank you, Howard,\u0027 said Aubrey, as the blood pounded in Parminder\u0027s ears, and she dug her nails still more deeply into her palms. \u0027As you know, we\u0027re having to make some pretty drastic cuts at District level ...\u0027 She was in love with me, which she could barely hide whenever she laid eyes on me ... \u0027... and one of the projects we\u0027ve got to look at is Bellchapel,\u0027 said Aubrey. \u0027I thought I\u0027d have a word, because, as you all know, it\u0027s the Parish that owns the building - \u0027 \u0027 - and the lease is almost up,\u0027 said Howard. \u0027That\u0027s right.\u0027 \u0027But nobody else is interested in that old place, are they?\u0027 asked a retired accountant from the end of the table. \u0027It\u0027s in a bad state, from what I\u0027ve heard.\u0027 \u0027Oh, I\u0027m sure we could find a new tenant,\u0027 said Howard comfortably, \u0027but that\u0027s not really the issue. The point is whether we think the clinic is doing a good - \u0027 \u0027That\u0027s not the point at all,\u0027 said Parminder, cutting across him. \u0027It isn\u0027t the Parish Council\u0027s job to decide whether or not the clinic\u0027s doing a good job. We don\u0027t fund their work. They\u0027re not our responsibility.\u0027 \u0027But we own the building,\u0027 said Howard, still smiling, still polite, \u0027so I think it\u0027s natural for us to want to consider - \u0027 \u0027If we\u0027re going to look at information on the clinic\u0027s work, I think it\u0027s very important that we get a balanced picture,\u0027 said Parminder. \u0027I\u0027m terribly sorry,\u0027 said Shirley, blinking down the table at Parminder, \u0027but could you try not to interrupt the Chair, Dr Jawanda? It\u0027s awfully difficult to take notes if people talk over other people. And now I\u0027ve interrupted,\u0027 she added with a smile. \u0027Sorry!\u0027 \u0027I presume the Parish wants to keep getting revenue from the building,\u0027 said Parminder, ignoring Shirley. \u0027And we have no other potential tenant lined up, as far as I know. So I\u0027m wondering why we are even considering terminating the clinic\u0027s lease.\u0027 \u0027They don\u0027t cure them,\u0027 said Betty. \u0027They just give them more drugs. I\u0027d be very happy to see them out.\u0027 \u0027We\u0027re having to make some very difficult decisions at District Council level,\u0027 said Aubrey Fawley. \u0027The government\u0027s looking for more than a billion in savings from local government. We cannot continue to provide services the way we have done. That\u0027s the reality.\u0027 Parminder hated the way that her fellow councillors acted around Aubrey, drinking in his deep modulated voice, nodding gently as he talked. She was well aware that some of them called her \u0027Bends-Your-Ear\u0027. \u0027Research indicates that illegal drug use increases during recessions,\u0027 said Parminder. \u0027It\u0027s their choice,\u0027 said Betty. \u0027Nobody makes them take drugs.\u0027 She looked around the table for support. Shirley smiled at her. \u0027We\u0027re having to make some tough choices,\u0027 said Aubrey. \u0027So you\u0027ve got together with Howard,\u0027 Parminder talked over him, \u0027and decided that you can give the clinic a little push by forcing them out of the building.\u0027 \u0027I can think of better ways to spend money than on a bunch of criminals,\u0027 said the accountant. \u0027I\u0027d cut off all their benefits, personally,\u0027 said Betty. \u0027I was invited to this meeting to put you all in the picture about what\u0027s happening at District level,\u0027 said Aubrey calmly. \u0027Nothing more than that, Dr Jawanda.\u0027 \u0027Helen,\u0027 said Howard loudly, pointing to another councillor, whose hand was raised, and who had been trying to make her views heard for a minute. Parminder heard nothing of what the woman said. She had quite forgotten about the stack of papers lying underneath her agenda, on which Kay Bawden had spent so much time: the statistics, the profiles of successful cases, the explanation of the benefits of methadone as against heroin; studies showing the cost, financial and social, of heroin addiction. Everything around her had become slightly liquid, unreal; she knew that she was going to erupt as she had never erupted in her life, and there was no room to regret it, or to prevent it, or do anything except watch it happen; it was too late, far too late ... \u0027... culture of entitlement,\u0027 said Aubrey Fawley. \u0027People who have literally not worked a day in their lives.\u0027 \u0027And, let\u0027s face it,\u0027 said Howard, \u0027this is a problem with a simple solution. Stop taking the drugs.\u0027 He turned, smiling and conciliating, to Parminder. \u0027They call it \"cold turkey\", isn\u0027t that right, Dr Jawanda?\u0027 \u0027Oh, you think that they should take responsibility for their addiction and change their behaviour?\u0027 said Parminder. \u0027In a nutshell, yes.\u0027 \u0027Before they cost the state any more money.\u0027 \u0027Exact - \u0027 \u0027And you,\u0027 said Parminder loudly, as the silent eruption engulfed her, \u0027do you know how many tens of thousands of pounds you, Howard Mollison, have cost the health service, because of your total inability to stop gorging yourself?\u0027 A rich, red claret stain was spreading up Howard\u0027s neck into his cheeks. \u0027Do you know how much your bypass cost, and your drugs, and your long stay in hospital? And the doctor\u0027s appointments you take up with your asthma and your blood pressure and the nasty skin rash, which are all caused by your refusal to lose weight?\u0027 As Parminder\u0027s voice became a scream, other councillors began to protest on Howard\u0027s behalf; Shirley was on her feet; Parminder was still shouting, clawing together the papers that had somehow been scattered as she gesticulated. \u0027What about patient confidentiality?\u0027 shouted Shirley. \u0027Outrageous! Absolutely outrageous!\u0027 Parminder was at the door of the hall and striding through it, and she heard, over her own furious sobs, Betty calling for her immediate expulsion from the council; she was half running away from the hall, and she knew that she had done something cataclysmic, and she wanted nothing more than to be swallowed up by the darkness and to disappear for ever.","sourceLink":"https://allnovel.net/the-casual-vacancy/page-36.html","bookId":2230,"book":{"id":2230,"title":"The Casual Vacancy","description":"Storyline: When Barry Fairbrother dies unexpectedly in his early forties, the little town of Pagford is left in shock. Pagford is, seemingly, an English idyll, with a cobbled market square and an ancient abbey, but what lies behind the pretty fade is a town at war. Rich at war with poor, teenagers at war with their parents, wives at war with their husbands, teachers at war with their pupils. Pagford is not what it first seems. And the empty seat left by Barry on the town\u0027s council soon becomes the catalyst for the biggest war the town has yet seen. Who will triumph in an election fraught with passion, duplicity and unexpected revelations? Blackly comic, thought-provoking and constantly surprising, The Casual Vacancy is J.K. Rowling\u0027s first novel for adults.","cover":"https://allnovel.net/images/the-casual-vacancy.jpg","author":"J.K. Rowling","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-casual-vacancy.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 11:07:43 PM"}}
