{"id":107553,"no":54,"title":"Page 54","content":"Weaknesses of Voluntary Bodies\n 22.23 ... The main weaknesses of such bodies are that they are hard to launch, liable to disintegrate ...\n Charles Arnold-Baker\n Local Council Administration,\n Seventh Edition\n I\n Many, many times had Colin Wall imagined the police coming to his door. They arrived, at last, at dusk on Sunday evening: a woman and a man, not to arrest Colin, but to look for his son.\n A fatal accident and \u0027Stuart, is it?\u0027 was a witness. \u0027Is he at home?\u0027\n \u0027No,\u0027 said Tessa, \u0027oh, dear God ... Robbie Weedon ... but he lives in the Fields ... why was he here?\u0027\n The policewoman explained, kindly, what they believed to have happened. \u0027The teenagers took their eye off him\u0027 was the phrase she used.\n Tessa thought she might faint.\n \u0027You don\u0027t know where Stuart is?\u0027 asked the policeman.\n \u0027No,\u0027 said Colin, gaunt and shadow-eyed. \u0027Where was he last seen?\u0027\n \u0027When our colleague pulled up, Stuart seems to have, ah, run away.\u0027\n \u0027Oh, dear God,\u0027 said Tessa again.\n \u0027He\u0027s not answering,\u0027 said Colin calmly; he had already dialled Fats on his mobile. \u0027We\u0027ll need to go and look for him.\u0027\n Colin had rehearsed for calamity all his life. He was ready. He took down his coat.\n \u0027I\u0027ll try Arf,\u0027 said Tessa, running to the telephone.\n Isolated above the little town, no news of the calamities had yet reached Hilltop House. Andrew\u0027s mobile rang in the kitchen.\n \u0027\u0027Lo,\u0027 he said, his mouth full of toast.\n \u0027Andy, it\u0027s Tessa Wall. Is Stu with you?\u0027\n \u0027No,\u0027 he said. \u0027Sorry.\u0027\n But he was not at all sorry that Fats was not with him.\n \u0027Something\u0027s happened, Andy. Stu was down at the river with Krystal Weedon, and she had her little brother with her, and the boy\u0027s drowned. Stu\u0027s run - run off somewhere. Can you think where he might be?\u0027\n \u0027No,\u0027 said Andrew automatically, because that was his and Fats\u0027 code. Never tell the parents.\n But the horror of what she had just told him crept through the phone like a clammy fog. Everything was suddenly less clear, less certain. She was about to hang up.\n \u0027Wait, Mrs Wall,\u0027 he said. \u0027I might know ... there\u0027s a place down by the river ...\u0027\n \u0027I don\u0027t think he\u0027d go near the river now,\u0027 said Tessa.\n Seconds flicked by, and Andrew was more and more convinced that Fats was in the Cubby Hole.\n \u0027It\u0027s the only place I can think of,\u0027 he said.\n \u0027Tell me where - \u0027\n \u0027I\u0027d have to show you.\u0027\n \u0027I\u0027ll be there in ten minutes,\u0027 she shouted.\n Colin was already patrolling the streets of Pagford on foot. Tessa drove the Nissan up the winding hill road, and found Andrew waiting for her on the corner, where he usually caught the bus. He directed her down through the town. The street lights were feeble by twilight.\n They parked by the trees where Andrew usually threw down Simon\u0027s racing bike. Tessa got out of the car and followed Andrew to the edge of the water, puzzled and frightened.\n \u0027He\u0027s not here,\u0027 she said.\n \u0027It\u0027s along there,\u0027 said Andrew, pointing at the sheer dark face of Pargetter Hill, running straight down to the river with barely a lip of bank before the rushing water.\n \u0027What do you mean?\u0027 asked Tessa, horrified.\n Andrew had known from the first that she would not be able to come with him, short and dumpy as she was.\n \u0027I\u0027ll go and see,\u0027 he said. \u0027If you wait here.\u0027\n \u0027But it\u0027s too dangerous!\u0027 she cried over the roar of the powerful river.\n Ignoring her, he reached for the familiar hand and footholds. As he inched away along the tiny ledge, the same thought came to both of them; that Fats might have fallen, or jumped, into the river thundering so close to Andrew\u0027s feet.\n Tessa remained at the water\u0027s edge until she could not make Andrew out any longer, then turned away, trying not to cry in case Stuart was there, and she needed to talk to him calmly. For the first time, she wondered where Krystal was. The police had not said, and her terror for Fats had obliterated every other concern ...\n Please God, let me find Stuart, she prayed. Let me find Stuart, please, God.\n Then she pulled her mobile from her cardigan pocket and called Kay Bawden.\n \u0027I don\u0027t know whether you\u0027ve heard,\u0027 she shouted, over the rushing water, and she told Kay the story.\n \u0027But I\u0027m not her social worker any more,\u0027 said Kay.\n Twenty feet away, Andrew had reached the Cubby Hole. It was pitch black; he had never been here this late. He swung himself inside.\n \u0027Fats?\u0027\n He heard something move at the back of the hole.\n \u0027Fats? You there?\u0027\n \u0027Got a light, Arf?\u0027 said an unrecognizable voice. \u0027I dropped my bloody matches.\u0027\n Andrew thought of shouting out to Tessa, but she did not know how long it took to reach the Cubby Hole. She could wait a few more moments.\n He passed over his lighter. By its flickering flame, Andrew saw that his friend\u0027s appearance was almost as changed as his voice. Fats\u0027 eyes were swollen; his whole face looked puffy.\n The flame went out. Fats\u0027 cigarette tip glowed bright in the darkness.\n \u0027Is he dead? Her brother?\u0027\n Andrew had not realized that Fats did not know.\n \u0027Yeah,\u0027 he said, and then he added, \u0027I think so. That\u0027s what I - what I heard.\u0027\n There was a silence, and then a soft, piglet-like squeal reached him through the darkness.\n \u0027Mrs Wall,\u0027 yelled Andrew, sticking his head out of the hole as far as it would go, so that he could not hear Fats\u0027 sobs over the sound of the river. \u0027Mrs Wall, he\u0027s here!\u0027\n \n","sourceLink":"https://allnovel.net/the-casual-vacancy/page-54.html","bookId":2230,"book":{"id":2230,"title":"The Casual Vacancy","description":"Storyline: \n When Barry Fairbrother dies unexpectedly in his early forties, the little town of Pagford is left in shock. Pagford is, seemingly, an English idyll, with a cobbled market square and an ancient abbey, but what lies behind the pretty fade is a town at war. Rich at war with poor, teenagers at war with their parents, wives at war with their husbands, teachers at war with their pupils. Pagford is not what it first seems. And the empty seat left by Barry on the town\u0027s council soon becomes the catalyst for the biggest war the town has yet seen. Who will triumph in an election fraught with passion, duplicity and unexpected revelations? Blackly comic, thought-provoking and constantly surprising, The Casual Vacancy is J.K. Rowling\u0027s first novel for adults.\n \n","cover":"https://allnovel.net/images/the-casual-vacancy.jpg","author":"J.K. Rowling","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-casual-vacancy.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 11:07:43 PM"}}
