{"id":107508,"no":7,"title":"Page 7","content":"I Every parking space in Church Row was taken by nine o\u0027clock in the morning. Darkly clothed mourners moved, singly, in pairs and in groups, up and down the street, converging, like a stream of iron filings drawn to a magnet, on St Michael and All Saints. The path leading to the church doors became crowded, then overflowed; those who were displaced fanned out among the graves, seeking safe spots to stand between the headstones, fearful of trampling on the dead, yet unwilling to move too far from the church entrance. It was clear to everyone that there would not be enough pews for all the people who had come to say goodbye to Barry Fairbrother. His co-workers from the bank, who were grouped around the most extravagant of the Sweetlove tombs, wished that the august representative from head office would move on and take his inane small-talk and his clumsy jokes with him. Lauren, Holly and Jennifer from the rowing team had separated from their parents to huddle together in the shade of a mossy-fingered yew. Parish councillors, a motley bunch, talked solemnly in the middle of the path: a clutch of balding heads and thick-lensed glasses; a smattering of black straw hats and cultured pearls. Men from the squash and golf clubs hailed each other in subdued fashion; old friends from university recognized each other from afar and edged together; and in between milled what seemed to be most of Pagford, in their smartest and most sombre-hued clothes. The air droned with quiet conversations; faces flickered, watching and waiting. Tessa Wall\u0027s best coat, which was of grey wool, was cut so tightly around the armholes that she could not raise her arms above chest height. Standing beside her son on one side of the church path, she was exchanging sad little smiles and waves with acquaintances, while continuing to argue with Fats through lips she was trying not to move too obviously. \u0027For God\u0027s sake, Stu. He was your father\u0027s best friend. Just this once, show some consideration.\u0027 \u0027No one told me it was going to go on this bloody long. You told me it\u0027d be over by half-past eleven.\u0027 \u0027Don\u0027t swear. I said we\u0027d leave St Michael\u0027s at about half-past eleven - \u0027 \u0027 - so I thought it\u0027d be over, didn\u0027t I? So I arranged to meet Arf.\u0027 \u0027But you\u0027ve got to come to the burial, your father\u0027s a pall-bearer! Ring Arf and tell him it\u0027ll have to be tomorrow instead.\u0027 \u0027He can\u0027t do tomorrow. Anyway, I haven\u0027t got my mobile on me. Cubby told me not to bring it to church.\u0027 \u0027Don\u0027t call your father Cubby! You can ring Arf on mine,\u0027 said Tessa, burrowing in her pocket. \u0027I don\u0027t know his number by heart,\u0027 lied Fats coldly. She and Colin had eaten dinner without Fats the previous evening, because he had cycled up to Andrew\u0027s place, where they were working on their English project together. That, at any rate, was the story Fats had given his mother, and Tessa had pretended to believe it. It suited her too well to have Fats out of the way, incapable of upsetting Colin. At least he was wearing the new suit that Tessa had bought for him in Yarvil. She had lost her temper at him in the third shop, because he had looked like a scarecrow in everything he had tried on, gawky and graceless, and she had thought angrily that he was doing it on purpose; that he could have inflated the suit with a sense of fitness if he chose. \u0027Shh!\u0027 said Tessa pre-emptively. Fats was not speaking, but Colin was approaching them, leading the Jawandas; he seemed, in his overwrought state, to be confusing the role of pall-bearer with that of usher; hovering by the gates, welcoming people. Parminder looked grim and gaunt in her sari, with her children trailing behind her; Vikram, in his dark suit, looked like a film star. A few yards from the church doors, Samantha Mollison was waiting beside her husband, looking up at the bright off-white sky and musing on all the wasted sunshine beating down on top of the high ceiling of cloud. She was refusing to be dislodged from the hard-surfaced path, no matter how many old ladies had to cool their ankles in the grass; her patent-leather high heels might sink into the soft earth, and become dirty and clogged. When acquaintances hailed them, Miles and Samantha responded pleasantly, but they were not speaking to each other. They had had a row the previous evening. A few people had asked after Lexie and Libby, who usually came home at weekends, but both girls were staying over at friends\u0027 houses. Samantha knew that Miles regretted their absence; he loved playing paterfamilias in public. Perhaps, she thought, with a most pleasurable leap of fury, he would ask her and the girls to pose with him for a picture on his election leaflets. She would enjoy telling him what she thought of that idea. She could tell that he was surprised by the turnout. No doubt he was regretting that he did not have a starring role in the forthcoming service; it would have been an ideal opportunity to begin a surreptitious campaign for Barry\u0027s seat on the council with this big audience of captive voters. Samantha made a mental note to drop a sarcastic allusion to the missed opportunity when a suitable occasion arose. \u0027Gavin!\u0027 called Miles, at the sight of a familiar, fair and narrow head. \u0027Oh, hi, Miles. Hi, Sam.\u0027 Gavin\u0027s new black tie shone against his white shirt. There were violet bags under his light eyes. Samantha leaned in on tiptoes, so that he could not decently avoid kissing her on the cheek and inhaling her musky perfume. \u0027Big turnout, isn\u0027t it?\u0027 Gavin said, gazing around. \u0027Gavin\u0027s a pall-bearer,\u0027 Miles told his wife, in precisely the way that he would have announced that a small and unpromising child had been awarded a book token for effort. In truth, he had been a little surprised when Gavin had told him he had been accorded this honour. Miles had vaguely imagined that he and Samantha would be privileged guests, surrounded by a certain aura of mystery and importance, having been at the deathbed. It might have been a nice gesture if Mary, or somebody close to Mary, had asked him, Miles, to read a lesson, or say a few words to acknowledge the important part he had played in Barry\u0027s final moments. Samantha was deliberately unsurprised that Gavin had been singled out. \u0027You and Barry were quite close, weren\u0027t you, Gav?\u0027 Gavin nodded. He felt jittery and a little sick. He had had a very bad night\u0027s sleep, waking in the early hours from horrible dreams in which, first, he had dropped the coffin, so that Barry\u0027s body spilt out onto the church floor; and, secondly, he had overslept, missed the funeral, and arrived at St Michael and All Saints to find Mary alone in the graveyard, white-faced and furious, screaming at him that he had ruined the whole thing. \u0027I\u0027m not sure where I ought to be,\u0027 he said, looking around. \u0027I\u0027ve never done this before.\u0027 \u0027Nothing to it, mate,\u0027 said Miles. \u0027There\u0027s only one requirement, really. Don\u0027t drop anything, hehehe.\u0027 Miles\u0027 girlish laugh contrasted oddly with his deep speaking voice. Neither Gavin nor Samantha smiled. Colin Wall loomed out of the mass of bodies. Big and awkward-looking, with his high, knobbly forehead, he always made Samantha think of Frankenstein\u0027s monster. \u0027Gavin,\u0027 he said. \u0027There you are. I think we should probably stand out on the pavement, they\u0027ll be here in a few minutes.\u0027 \u0027Right-ho,\u0027 said Gavin, relieved to be ordered around. \u0027Colin,\u0027 said Miles, with a nod. \u0027Yes, hello,\u0027 said Colin, flustered, before turning away and forcing his way back through the mass of mourners. Then came another small flurry of movement, and Samantha heard Howard\u0027s loud voice: \u0027Excuse me ... so sorry ... trying to join our family ...\u0027 The crowd parted to avoid his belly, and Howard was revealed, immense in a velvet-faced overcoat. Shirley and Maureen bobbed in his wake, Shirley neat and composed in navy blue, Maureen scrawny as a carrion bird, in a hat with a small black veil. \u0027Hello, hello,\u0027 said Howard, kissing Samantha firmly on both cheeks. \u0027And how\u0027s Sammy?\u0027 Her answer was swallowed up in a widespread, awkward shuffling, as everybody began retreating backwards off the path: there was a certain discreet jockeying for position; nobody wanted to relinquish their claim to a place near the church entrance. With this cleaving in two of the crowd, familiar individuals were revealed like separate pips along the break. Samantha spotted the Jawandas: coffee-brown faces among all the whey; Vikram, absurdly handsome in his dark suit; Parminder dressed in a sari (why did she do it? Didn\u0027t she know she was playing right into the likes of Howard and Shirley\u0027s hands?) and beside her, dumpy little Tessa Wall in a grey coat, which was straining at the buttons. Mary Fairbrother and the children were walking slowly up the path to the church. Mary was terribly pale, and appeared pounds thinner. Could she have lost so much weight in six days? She was holding one of the twins\u0027 hands, with her other arm around the shoulders of her younger son, and the eldest, Fergus, marching behind. She walked with her eyes fixed straight ahead, her soft mouth pursed tight. Other family members followed Mary and the children; the procession moved over the threshold and was swallowed up in the dingy interior of the church. Everyone else moved towards the doors at once, which resulted in an undignified jam. The Mollisons found themselves shunted together with the Jawandas. \u0027After you, Mr Jawanda, sir, after you ...\u0027 boomed Howard, holding out an arm to let the surgeon walk in first. But Howard made sure to use his bulk to prevent anybody else taking precedence over him, and followed Vikram immediately through the entrance, leaving their families to follow on. A royal-blue carpet ran the length of the aisle of St Michael and All Saints. Golden stars glimmered on the vaulted ceiling; brass plaques reflected the glow of the hanging lamps. The stained-glass windows were elaborate and gorgeously hued. Halfway down the nave, on the epistle side, St Michael himself stared down from the largest window, clad in silver armour. Sky-blue wings curved out of his shoulders; in one hand he held aloft a sword, in the other, a pair of golden scales. A sandalled foot rested on the back of a writhing bat-winged Satan, who was dark grey in colour and attempting to raise himself. The saint\u0027s expression was serene. Howard stopped level with St Michael and indicated that his party should file into the pew on the left; Vikram turned right into the opposite one. While the remaining Mollisons, and Maureen, filed past him into the pew, Howard remained planted on the royal-blue carpet, and addressed Parminder as she passed him. \u0027Dreadful, this. Barry. Awful shock.\u0027 \u0027Yes,\u0027 she said, loathing him. \u0027I always think those frocks look comfy; are they?\u0027 he added, nodding at her sari. She did not answer, but took her place beside Jaswant. Howard sat down too, making of himself a prodigious plug at the end of the pew that would seal it off to newcomers. Shirley\u0027s eyes were fixed respectfully on her knees, and her hands were clasped, apparently in prayer, but she was really mulling over Howard and Parminder\u0027s little exchange about the sari. Shirley belonged to a section of Pagford that quietly lamented the fact that the Old Vicarage, which had been built long ago to house a High Church vicar with mutton-chop whiskers and a starched-aproned staff, was now home to a family of Hindus (Shirley had never quite grasped what religion the Jawandas were). She thought that if she and Howard went to the temple, or the mosque, or wherever it was the Jawandas worshipped, they would doubtless be required to cover their heads and remove their shoes and who knew what else, otherwise there would be outcry. Yet it was acceptable for Parminder to flaunt her sari in church. It was not as though Parminder did not have normal clothes, for she wore them to work every day. The double standard of it all was what rankled; not a thought for the disrespect it showed to their religion, and, by extension, to Barry Fairbrother himself, of whom she was supposed to have been so fond. Shirley unclasped her hands, raised her head, and gave her attention over to the outfits of people who were passing, and of the size and number of Barry\u0027s floral tributes. Some of these had been heaped up against the communion rail. Shirley spotted the offering from the council, for which she and Howard had organized the collection. It was a large, round traditional wreath of white and blue flowers, which were the colours of Pagford\u0027s arms. Their flowers and all the other wreaths were overshadowed by the life-sized oar, made of bronze chrysanthemums, which the girls\u0027 rowing team had given. Sukhvinder turned in her pew to look for Lauren, whose florist mother had made the oar; she wanted to mime that she had seen it and liked it, but the crowd was dense and she could not spot Lauren anywhere. Sukhvinder was mournfully proud that they had done it, especially when she saw that people were pointing it out to each other as they settled themselves in their seats. Five of the eight girls on the team had stumped up money for the oar. Lauren had told Sukhvinder how she had tracked down Krystal Weedon at lunchtime, and exposed herself to the piss-taking of Krystal\u0027s friends, who were sitting smoking on a low wall by the newsagent\u0027s. Lauren had asked Krystal if she wanted to chip in. \u0027Yeah, I will, all righ\u0027,\u0027 Krystal had said; but she had not, so her name was not on the card. Nor, as far as Sukhvinder could see, had Krystal come to the funeral. Sukhvinder\u0027s insides were like lead, but the ache of her left forearm coupled with the sharp twinges of pain when she moved it was a counter-irritant, and at least Fats Wall, glowering in his black suit, was nowhere near her. He had not made eye contact with her when their two families had met, briefly, in the churchyard; he was restrained by the presence of their parents, as he was sometimes restrained by the presence of Andrew Price. Late the previous evening, her anonymous cyber-torturer had sent her a black and white picture of a naked Victorian child, covered in soft dark hair. She had seen it and deleted it while dressing for the funeral. When had she last been happy? She knew that in a different life, long before anyone had grunted at her, she had sat in this church, and been quite content for years; she had sung hymns with gusto at Christmas, Easter and Harvest Festival. She had always liked St Michael, with his pretty, feminine, Pre-Raphaelite face, his curly golden hair ... but this morning, for the first time, she saw him differently, with his foot resting almost casually on that writhing dark devil; she found his untroubled expression sinister and arrogant. The pews were packed. Muffled clunks, echoing footsteps and quiet rustlings animated the dusty air as the unlucky ones continued to file in at the back of the church and took up standing room along the left-hand wall. Some hopeful souls tiptoed down the aisle in case of an overlooked place in the crammed pews. Howard remained immovable and firm, until Shirley tapped his shoulder and whispered, \u0027Aubrey and Julia!\u0027 At which Howard turned massively, and waved the service sheet to attract the Fawleys\u0027 attention. They came briskly down the carpeted aisle: Aubrey, tall, thin and balding in his dark suit, Julia with her light-red hair pulled back into a chignon. They smiled their thanks as Howard moved along, shunting the others up, making sure that the Fawleys had plenty of room. Samantha was jammed so tightly between Miles and Maureen that she could feel Maureen\u0027s sharp hip joint pressing into her flesh on one side and the keys in Miles\u0027 pocket on the other. Furious, she attempted to secure herself a centimetre or so more room, but neither Miles nor Maureen had anywhere else to go, so she stared straight ahead, and turned her thoughts vengefully to Vikram, who had lost none of his appeal in the month or so since she had last seen him. He was so conspicuously, irrefutably good-looking, it was silly; it made you want to laugh. With his long legs and his broad shoulders, and the flatness of his belly where his shirt tucked into his trousers, and those dark eyes with the thick black lashes, he looked like a god compared to other Pagford men, who were so slack and pallid and porky. As Miles leaned forward to exchange whispered pleasantries with Julia Fawley, his keys ground painfully into Samantha\u0027s upper thigh, and she imagined Vikram ripping open the navy wrap dress she was wearing, and in her fantasy she had omitted to put on the matching camisole that concealed her deep canyon of cleavage ... The organ stops creaked and silence fell, except for a soft persistent rustle. Heads turned: the coffin was coming up the aisle. The pall-bearers were almost comically mismatched: Barry\u0027s brothers were both five foot six, and Colin Wall, at the rear, six foot two, so that the back end of the coffin was considerably higher than the front. The coffin itself was not made of polished mahogany, but of wickerwork. It\u0027s a bloody picnic basket! thought Howard, outraged. Looks of surprise flitted across many faces as the willow box passed them, but some had known all about the coffin in advance. Mary had told Tessa (who had told Parminder) how the choice of material had been made by Fergus, Barry\u0027s eldest son, who wanted willow because it was a sustainable, quick-growing material and therefore environmentally friendly. Fergus was a passionate enthusiast for all things green and ecologically sound. Parminder liked the willow coffin better, much better, than the stout wooden box in which most English disposed of their dead. Her grandmother had always had a superstitious fear of the soul being trapped inside something heavy and solid, deploring the way that British undertakers nailed down the lids. The pall-bearers lowered the coffin onto the brocade-draped bier and retreated: Barry\u0027s son, brothers and brother-in-law edged into the front pews, and Colin walked jerkily back to join his family. For two quaking seconds Gavin hesitated. Parminder could tell that he was unsure of where to go, his only option to walk back down the aisle under the eyes of three hundred people. But Mary must have made a sign to him, because he ducked, blushing furiously, into the front pew beside Barry\u0027s mother. Parminder had only ever spoken to Gavin when she had tested and treated him for chlamydia. He had never met her gaze again. \u0027I am the resurrection and the life, saith the Lord; he that believeth in me, though he were dead, yet shall he live: and whosoever liveth and believeth in me shall never die ...\u0027 The vicar did not sound as if he were thinking about the sense of the words issuing from his mouth, but only about his own delivery, which was sing-song and rhythmic. Parminder was familiar with his style; she had attended carol services for years with all the other St Thomas\u0027s parents. Long acquaintance had not reconciled her to the white-faced warrior saint staring down at her, nor all the dark wood, the hard pews, the alien altar with its jewelled golden cross, nor the dirgey hymns, which she found chilly and unsettling. So she withdrew her attention from the self-conscious drone of the vicar and thought again of her father. She had seen him out of the kitchen window, flat on his face, while her radio continued to blare from on top of the rabbit hutch. He had been lying there for two hours while she, her mother and her sisters had been browsing in Topshop. She could still feel her father\u0027s shoulder beneath his hot shirt as she had shaken it. \u0027Dadiii. Dadiiiii.\u0027 They had scattered Darshan\u0027s ashes in the sad little River Rea in Birmingham. Parminder could remember the dull clay look of its surface, on an overcast day in June, and the stream of tiny white and grey flakes floating away from her. The organ clunked and wheezed into life, and she got to her feet with everybody else. She caught a glimpse of the backs of Niamh and Siobhan\u0027s red-gold heads; they were exactly the age she had been when Darshan had been taken from them. Parminder experienced a rush of tenderness, and an awful ache, and a confused desire to hold them and to tell them that she knew, she knew, she understood ... Morning has broken, like the first morning ... Gavin could hear a shrill treble from along the row: Barry\u0027s younger son\u0027s voice had not yet broken. He knew that Declan had chosen the hymn. That was another of the ghastly details of the service that Mary had chosen to share with him. He was finding the funeral an even worse ordeal than he had expected. He thought it might have been better with a wooden coffin; he had had an awful, visceral awareness of Barry\u0027s body inside that light wickerwork case; the physical weight of him was shocking. All those complacently staring people, as he walked up the aisle; did they not understand what he was actually carrying? Then had come the ghastly moment when he had realized that nobody had saved him a place, and that he would have to walk all the way back again while everybody stared, and hide among the standees at the back ... but instead he had been forced to sit in the first pew, horribly exposed. It was like being in the front seat of a rollercoaster, bearing the brunt of every awful twist and lurch. Sitting there, mere feet from Siobhan\u0027s sunflower, its head as big as a saucepan lid, in the middle of a big burst of yellow freesias and daylilies, he actually wished that Kay had come with him; he could not believe it, but there it was. He would have been consoled by the presence of somebody who was on his side; somebody simply to keep him a seat. He had not considered what a sad bastard he might look, turning up alone. The hymn ended. Barry\u0027s older brother walked to the front to speak. Gavin did not know how he could bear to do it, with Barry\u0027s corpse lying right in front of him beneath the sunflower (grown from seed, over months); nor how Mary could sit so quietly, with her head bowed, apparently looking at the hands clasped in her lap. Gavin tried, actively, to provide his own interior interference, so as to dilute the impact of the eulogy. He\u0027s going to tell the story about Barry meeting Mary, once he\u0027s got past this kid stuff ... happy childhood, high jinks, yeah, yeah ... Come on, move it along ... They would have to put Barry back in the car, and drive all the way to Yarvil to bury him in the cemetery there, because the tiny graveyard of St Michael and All Saints had been declared full twenty years previously. Gavin imagined lowering the wickerwork coffin into the grave under the eyes of this crowd. Carrying it in and out of the church would be nothing compared to that ... One of the twins was crying. Out of the corner of his eye, Gavin saw Mary reach out a hand to hold her daughter\u0027s. Let\u0027s get on with it, for fuck\u0027s sake. Please. \u0027I think it\u0027s fair to say that Barry always knew his own mind,\u0027 Barry\u0027s brother was saying hoarsely. He had got a few laughs with tales of Barry\u0027s scrapes in childhood. The strain in his voice was palpable. \u0027He was twenty-four when we went off on my stag weekend to Liverpool. First night there, we leave the campsite and go off to the pub, and there behind the bar is the landlord\u0027s student daughter, a beautiful blonde, helping out on a Saturday night. Barry spent the whole night propping up the bar, chatting her up, getting her into trouble with her dad and pretending he didn\u0027t know who the rowdy lot in the corner were.\u0027 A weak laugh. Mary\u0027s head was drooping; both hands were clutching those of the child on either side. \u0027He told me that night, back in the tent, that he was going to marry her. I thought, Hang on, I\u0027m the one who\u0027s supposed to be drunk.\u0027 Another little titter. \u0027Baz made us go back to the same pub the next night. When we got home, the first thing he did was buy her a postcard and send it to her, telling her he\u0027d be back next weekend. They were married a year to the day after they met, and I think everyone who knew them would agree that Barry knew a good thing when he saw it. They went on to have four beautiful children, Fergus, Niamh, Siobhan and Declan ...\u0027 Gavin breathed carefully in and out, in and out, trying not to listen, and wondering what on earth his own brother would find to say about him under the same circumstances. He had not had Barry\u0027s luck; his romantic life did not make a pretty story. He had never walked into a pub and found the perfect wife standing there, blonde, smiling and ready to serve him a pint. No, he had had Lisa, who had never seemed to think him up to scratch; seven years of escalating warfare had culminated in a dose of the clap; and then, with barely a break, there had been Kay, clinging to him like an aggressive and threatening barnacle ... But, all the same, he would ring her later, because he didn\u0027t think he would be able to stand going back to his empty cottage after this. He would be honest, and tell her how horrible and stressful the funeral had been, and that he wished she had come with him. That would surely deflect any lingering umbrage about their row. He did not want to be alone tonight. Two pews back, Colin Wall was sobbing, with small but audible gasps, into a large, wet handkerchief. Tessa\u0027s hand rested on his thigh, exerting gentle pressure. She was thinking about Barry; about how she had relied upon him to help her with Colin; of the consolation of shared laughter; of Barry\u0027s boundless generosity of spirit. She could see him clearly, short and ruddy, jiving with Parminder at their last party; imitating Howard Mollison\u0027s strictures on the Fields; advising Colin tactfully, as only he could have done, to accept Fats\u0027 behaviour as adolescent, rather than sociopathic. Tessa was scared of what the loss of Barry Fairbrother would mean to the man beside her; scared of how they would manage to accommodate this huge ragged absence; scared that Colin had made a vow to the dead that he could not keep, and that he did not realize how little Mary, to whom he kept wanting to talk, liked him. And through all Tessa\u0027s anxiety and sorrow was threaded the usual worry, like an itchy little worm: Fats, and how she was going to avert an explosion, how she would make him come with them to the burial, or how she might hide from Colin that he had not come - which might, after all, be easier. \u0027We are going to finish today\u0027s service with a song chosen by Barry\u0027s daughters, Niamh and Siobhan, which meant a lot to them and their father,\u0027 said the vicar. He managed, by his tone, to disassociate himself personally from what was about to happen. The beat of the drum rang so loudly through hidden speakers that the congregation jumped. A loud American voice was saying \u0027uh huh, uh huh\u0027 and Jay-Z rapped: Good girl gone bad - Take three - Action. No clouds in my storms ... Let it rain, I hydroplane into fame Comin\u0027 down with the Dow Jones ... Some people thought that it was a mistake: Howard and Shirley threw outraged glances at each other, but nobody pressed stop, or ran up the aisle apologizing. Then a powerful, sexy female voice started to sing: You had my heart And we\u0027ll never be worlds apart Maybe in magazines But you\u0027ll still be my star ... The pall-bearers were carrying the wicker coffin back down the aisle, and Mary and the children were following. ... Now that it\u0027s raining more than ever Know that we\u0027ll still have each other You can stand under my umbuh-rella You can stand under my umbuh-rella The congregation filed slowly out of the church, trying not to walk in time to the beat of the song. II Andrew Price took the handlebars of his father\u0027s racing bicycle and walked it carefully out of the garage, making sure that he did not scrape the car. Down the stone steps and through the metal gate he carried it; then, in the lane, he put his foot on one pedal, scooted a few yards and swung his other leg over the saddle. He soared left onto the vertiginously sloping hillside road and sped, without touching his brakes, down towards Pagford. The hedgerows and sky blurred; he imagined himself in a velodrome as the wind whipped his clean hair and his stinging face, which he had just scrubbed clean. Level with the Fairbrothers\u0027 wedge-shaped garden he applied the brakes, because some months previously he had taken this sharp turn too fast and fallen off, and had had to return home immediately with his jeans ripped open and grazes all down one side of his face ... He freewheeled, with only one hand on the bars, into Church Row, and enjoyed a second, though lesser, downhill burst of speed, slightly checked when he saw that they were loading a coffin onto a hearse outside the church, and that a dark-clothed crowd was spilling out between the heavy wooden doors. Andrew pedalled furiously around the corner and out of sight. He did not want to see Fats emerging from church with a distraught Cubby, wearing the cheap suit and tie that he had described with comical disgust during yesterday\u0027s English lesson. It would have been like interrupting his friend having a crap. As Andrew cycled slowly around the Square, he slicked his hair back off his face with one hand, wondering what the cold air had done to his purple-red acne and whether the anti-bacterial face wash had done anything to soothe the angry look of it. And he told himself the cover story: he had come from Fats\u0027 house (which he might have done, there was no reason why not), which meant that Hope Street was as obvious a route down to the river as cutting through the first side street. Therefore there was no need for Gaia Bawden (if she happened to be looking out of the window of her house, and happened to see him, and happened to recognize him) to think that he had come this way because of her. Andrew did not anticipate having to explain to her his reason for cycling up her street, but he still held the fake story in his mind, because he believed it gave him an air of cool detachment. He simply wanted to know which was her house. Twice already, at weekends, he had cycled along the short terraced street, every nerve in his body tingling, but he had been unable, as yet, to discover which house harboured the Grail. All he knew, from his furtive glimpses through the dirty school-bus windows, was that she lived on the right hand even-numbered side. As he turned the corner, he tried to compose his features, acting the part of a man cycling slowly towards the river by the most direct route, lost in his own serious thoughts, but ready to acknowledge a classmate, should they show themselves ... She was there. On the pavement. Andrew\u0027s legs continued to pump, though he could not feel the pedals, and he was suddenly aware how thin the tyres were on which he balanced. She was rummaging in her leather handbag, her copper-brown hair hanging around her face. Number ten on the door ajar behind her, and a black T-shirt falling short of her waist; a band of bare skin, and a heavy belt and tight jeans ... when he was almost past her, she closed the door and turned; her hair fell back from her beautiful face, and she said, quite clearly, in her London voice, \u0027Oh, hi.\u0027 \u0027Hi,\u0027 he said. His legs kept pedalling. Six feet away, twelve feet away; why hadn\u0027t he stopped? Shock kept him moving, he dared not look back; he was at the end of her street already; for fuck\u0027s sake don\u0027t fall off; he turned the corner, too stunned to gauge whether he was more relieved or disappointed that he had left her behind. Holy shit. He cycled on towards the wooded area at the base of Pargetter Hill, where the river glinted intermittently through the trees, but he could see nothing except Gaia burned onto his retina like neon. The narrow road turned into an earthy footpath, and the gentle breeze off the water caressed his face, which he did not think had turned red, because it had all happened so quickly. \u0027Fucking hell!\u0027 he said aloud to the fresh air and the deserted path. He raked excitedly through this magnificent, unexpected treasure trove: her perfect body, revealed in tight denim and stretchy cotton; number ten behind her, on a chipped, shabby blue door; \u0027oh, hi\u0027, easily and naturally - so his features were definitely logged somewhere in the mind that lived behind the astonishing face. The bike jolted on the newly pebbly and rough ground. Elated, Andrew dismounted only when he began to overbalance. He wheeled the bicycle on through the trees, emerging onto the narrow riverbank, where he slung the bicycle down on the ground among the wood anemones that had opened like tiny white stars since his last visit. His father had said, when he first started to borrow the bike: \u0027You chain it up if you\u0027re going in a shop. I\u0027m warning you, if that gets nicked ...\u0027 But the chain was not long enough to go around any of the trees and, in any case, the further he rode from his father the less Andrew feared him. Still thinking about the inches of flat, bare midriff and Gaia\u0027s exquisite face, Andrew strode to the place where the bank met the eroded side of the hill, which hung like an earthy, rocky cliff in a sheer face above the fast-flowing green water. The narrowest lip of slippery, crumbling bank ran along the bottom of the hillside. The only way of navigating it, if your feet had grown to be twice the length they had been when they had first made the trip, was to edge along sideways, pressed to the sheer face, holding tight to roots and bits of protruding rock. The mulchy green smell of the river and of wet soil was deeply familiar to Andrew, as was the sensation of this narrow ledge of earth and grass under his feet, and the cracks and rocks he sought with his hands on the hillside. He and Fats had found the secret place when they were eleven years old. They had known that what they were doing was forbidden and dangerous; they had been warned about the river. Terrified, but determined not to tell each other so, they had sidled along this tricky ledge, grabbing at anything that protruded from the rocky wall and, at the very narrowest point, clutching fistfuls of each other\u0027s T-shirts. Years of practice enabled Andrew, though his mind was barely on the job, to move crab-wise along the solid wall of earth and rock with the water gushing three feet beneath his trainers; then with a deft duck and swing, he was inside the fissure in the hillside that they had found so long ago. Back then, it had seemed like a divine reward for their daring. He could no longer stand up in it; but, slightly larger than a two-man tent, it was big enough for two teenage boys to lie, side by side, with the river rushing past and the trees dappling their view of the sky, framed by the triangular entrance. The first time they had been here, they had poked and dug at the back wall with sticks, but they had not found a secret passageway leading to the abbey above; so they gloried instead in the fact that they alone had discovered the hiding place, and swore that it would be their secret in perpetuity. Andrew had a vague memory of a solemn oath, spit and swearwords. They had called it the Cave when they had first discovered it, but it was now, and had been for some time past, the Cubby Hole. The little recess smelt earthy, though the sloping ceiling was made of rock. A dark green tidemark showed that it had flooded in the past, not quite to the roof. The floor was covered in their cigarette butts and cardboard roaches. Andrew sat down, with his legs dangling over the sludge-green water, and pulled his cigarettes and lighter out of his jacket, bought with the last of his birthday money, now that his allowance had been stopped. He lit up, inhaled deeply, and relived the glorious encounter with Gaia Bawden in as much detail as he could ring out of it: narrow waist and curving hips; creamy skin between leather and T-shirt; full, wide mouth; \u0027oh, hi\u0027. It was the first time he had seen her out of school uniform. Where was she going, alone with her leather handbag? What was there in Pagford for her to do on a Saturday morning? Was she perhaps catching the bus into Yarvil? What did she get up to when she was out of his sight; what feminine mysteries absorbed her? And he asked himself for the umpteenth time whether it was conceivable that flesh and bone wrought like that could contain a banal personality. It was only Gaia who had ever made him wonder this: the idea of body and soul as separate entities had never once occurred to him until he had clapped eyes on her. Even while trying to imagine what her breasts would look and feel like, judged by the visual evidence he had managed to gather through a slightly translucent school shirt, and what he knew was a white bra, he could not believe that the allure she held for him was exclusively physical. She had a way of moving that moved him as much as music, which was what moved him most of all. Surely the spirit animating that peerless body must be unusual too? Why would nature make a vessel like that, if not to contain something still more valuable? Andrew knew what naked women looked like, because there were no parental controls on the computer in Fats\u0027 conversion bedroom. Together they had explored as much online porn as they could access for free: shaven vulvas; pink labia pulled wide to show darkly gaping slits; spread buttocks revealing the puckered buttons of anuses; thickly lipsticked mouths, dripping semen. Andrew\u0027s excitement was underpinned, always, by the panicky awareness that you could only hear Mrs Wall approaching the room when she reached the creaking halfway stair. Sometimes they found weirdness that made them roar with laughter, even when Andrew was unsure whether he was more excited or repulsed (whips and saddles, harnesses, ropes, hoses; and once, at which even Fats had not managed to laugh, close-ups of metal-bolted contraptions, and needles protruding from soft flesh, and women\u0027s faces frozen, screaming). Together he and Fats had become connoisseurs of silicone-enhanced breasts, enormous, taut and round. \u0027Plastic,\u0027 one of them would point out, matter of factly, as they sat in front of the monitor with the door wedged shut against Fats\u0027 parents. The on-screen blonde\u0027s arms were raised as she sat astride some hairy man, her big brown-nippled breasts hanging off her narrow rib cage like bowling balls, thin, shiny purple lines under each of them showing where the silicone had been inserted. You could almost tell how they would feel, looking at them: firm, as if there were a football underneath the skin. Andrew could imagine nothing more erotic than a natural breast; soft and spongy and perhaps a little springy, and the nipples (he hoped) contrastingly hard. And all of these images blurred in his mind, late at night, with the possibilities offered by real girls, human girls, and the little you managed to feel through clothes if you managed to move in close enough. Niamh was the less pretty of the Fairbrother twins, but she had been the more willing, in the stuffy drama hall, during the Christmas disco. Half hidden by the musty stage curtain in a dark corner, they had pressed against each other, and Andrew had put his tongue into her mouth. His hands had inched as far as her bra strap and no further, because she kept pulling away. He had been driven, chiefly, by the knowledge that somewhere outside in the darkness, Fats was going further. And now his brain teemed and throbbed with Gaia. She was both the sexiest girl he had ever seen and the source of another, entirely inexplicable yearning. Certain chord changes, certain beats, made the very core of him shiver, and so did something about Gaia Bawden. He lit a new cigarette from the end of the first and threw the butt into the water below. Then he heard a familiar scuffling, and leaned forward to see Fats, still wearing his funeral suit, spread-eagled on the hill wall, moving from hand-hold to hand-hold as he edged along the narrow lip of bank, towards the opening where Andrew sat. \u0027Fats.\u0027 \u0027Arf.\u0027 Andrew pulled in his legs to give Fats room to climb into the Cubby Hole. \u0027Fucking hell,\u0027 said Fats, when he had clambered inside. He was spider-like in his awkwardness, with his long limbs, his skinniness emphasized by the black suit. Andrew handed him a cigarette. Fats always lit up as though he were in a high wind, one hand cupped around the flame to shield it, scowling slightly. He inhaled, blew a smoke ring out of the Cubby Hole and loosened the dark grey tie around his neck. He appeared older and not, after all, so very foolish in the suit, which bore traces of earth on the knees and cuffs from the journey to the cave. \u0027You\u0027d think they were bum chums,\u0027 Fats said, after he had taken another powerful drag on his cigarette. \u0027Cubby upset, was he?\u0027 \u0027Upset? He\u0027s having fucking hysterics. He\u0027s given himself hiccups. He\u0027s worse than the fucking widow.\u0027 Andrew laughed. Fats blew another smoke ring and pulled at one of his overlarge ears. \u0027I bowed out early. They haven\u0027t even buried him yet.\u0027 They smoked in silence for a minute, both looking out at the sludgy river. As he smoked, Andrew contemplated the words \u0027bowed out early\u0027, and the amount of autonomy Fats seemed to have, compared to himself. Simon and his fury stood between Andrew and too much freedom: in Hilltop House, you sometimes copped for punishment simply because you were present. Andrew\u0027s imagination had once been caught by a strange little module in their philosophy and religion class, in which primitive gods had been discussed in all their arbitrary wrath and violence, and the attempts of early civilizations to placate them. He had thought then of the nature of justice as he had come to know it: of his father as a pagan god, and of his mother as the high priestess of the cult, who attempted to interpret and intercede, usually failing, yet still insisting, in the face of all the evidence, that there was an underlying magnanimity and reasonableness to her deity. Fats rested his head against the stone side of the Cubby Hole and blew smoke rings at the ceiling. He was thinking about what he wanted to tell Andrew. He had been mentally rehearsing the way he would start, all through the funeral service, while his father gulped and sobbed into his handkerchief. Fats was so excited by the prospect of telling, that he was having difficulty containing himself; but he was determined not to blurt it out. The telling of it was, to Fats, of almost equal importance to the doing of it. He did not want Andrew to think that he had hurried here to say it. \u0027You know how Fairbrother was on the Parish Council?\u0027 said Andrew. \u0027Yeah,\u0027 said Fats, glad that Andrew had initiated a space-filler conversation. \u0027Si-Pie\u0027s saying he\u0027s going to stand for his seat.\u0027 \u0027Si-Pie is?\u0027 Fats frowned at Andrew. \u0027What the fuck\u0027s got into him?\u0027 \u0027He reckons Fairbrother was getting backhanders from some contractor.\u0027 Andrew had heard Simon discussing it with Ruth in the kitchen that morning. It had explained everything. \u0027He wants a bit of the action.\u0027 \u0027That wasn\u0027t Barry Fairbrother,\u0027 said Fats, laughing as he flicked ash onto the cave floor. \u0027And that wasn\u0027t the Parish Council. That was What\u0027s-his-name Frierly, up in Yarvil. He was on the school board at Winterdown. Cubby had a fucking fit. Local press calling him for a comment and all that. Frierly got done for it. Doesn\u0027t Si-Pie read the Yarvil and District Gazette?\u0027 Andrew stared at Fats. \u0027Fucking typical.\u0027 He ground out his cigarette on the earthy floor, embarrassed by his father\u0027s idiocy. Simon had got the wrong end of the stick yet again. He spurned the local community, sneered at their concerns, was proud of his isolation in his poxy little house on the hill; then he got a bit of misinformation and decided to expose his family to humiliation on the basis of it. \u0027Crooked as fuck, Si-Pie, isn\u0027t he?\u0027 said Fats. They called him Si-Pie because that was Ruth\u0027s nickname for her husband. Fats had heard her use it once, when he had been over for his tea, and had never called Simon anything else since. \u0027Yeah, he is,\u0027 said Andrew, wondering whether he would be able to dissuade his father from standing by telling him he had the wrong man and the wrong council. \u0027Bit of a coincidence,\u0027 said Fats, \u0027because Cubby\u0027s standing as well.\u0027 Fats exhaled through his nostrils, staring at the crevice wall over Andrew\u0027s head. \u0027So will voters go for the cunt,\u0027 he said, \u0027or the twat?\u0027 Andrew laughed. There was little he enjoyed more than hearing his father called a cunt by Fats. \u0027Now have a shifty at this,\u0027 said Fats, jamming his cigarette between his lips and patting his hips, even though he knew that the envelope was in the inside breast pocket. \u0027Here you go,\u0027 he said, pulling it out and opening it to show Andrew the contents: brown peppercorn-sized pods in a powdery mix of shrivelled stalks and leaves. \u0027Sensimilla, that is.\u0027 \u0027What is it?\u0027 \u0027Tips and shoots of your basic unfertilized marijuana plant,\u0027 said Fats, \u0027specially prepared for your smoking pleasure.\u0027 \u0027What\u0027s the difference between that and the normal stuff?\u0027 asked Andrew, with whom Fats had split several lumps of waxy black cannabis resin in the Cubby Hole. \u0027Just a different smoke, isn\u0027t it?\u0027 said Fats, stubbing out his own cigarette. He took a packet of Rizlas from his pocket, drew out three of the fragile papers and gummed them together. \u0027Did you get it off Kirby?\u0027 asked Andrew, poking at and sniffing the contents of the envelope. Everyone knew Skye Kirby was the go-to man for drugs. He was a year above them, in the lower sixth. His grandfather was an old hippy, who had been up in court several times for growing his own. \u0027Yeah. Mind, there\u0027s a bloke called Obbo,\u0027 said Fats, slitting cigarettes and emptying the tobacco onto the papers, \u0027in the Fields, who\u0027ll get you anything. Fucking smack, if you want it.\u0027 \u0027You don\u0027t want smack, though,\u0027 said Andrew, watching Fats\u0027 face. \u0027Nah,\u0027 said Fats, taking the envelope back, and sprinkling the sensimilla onto the tobacco. He rolled the joint together, licking the end of the papers to seal it, poking the roach in more neatly, twisting the end into a point. \u0027Nice,\u0027 he said happily. He had planned to tell Andrew his news after introducing the sensimilla as a kind of warm-up act. He held out his hand for Andrew\u0027s lighter, inserted the cardboarded end between his own lips and lit up, taking a deep, contemplative drag, blowing out the smoke in a long blue jet, then repeating the process. \u0027Mmm,\u0027 he said, holding the smoke in his lungs, and imitating Cubby, whom Tessa had given a wine course one Christmas. \u0027Herby. A strong aftertaste. Overtones of ... fuck ...\u0027 He experienced a massive headrush, even though he was sitting, and exhaled, laughing. \u0027... try that.\u0027 Andrew leaned across and took the joint, giggling in anticipation, and at the beatific smile on Fats\u0027 face, which was quite at odds with his usual constipated scowl. Andrew inhaled and felt the power of the drug radiate out from his lungs, unwinding and loosening him. Another drag, and he thought that it was like having your mind shaken out like a duvet, so that it resettled without creases, so that everything became smooth and simple and easy and good. \u0027Nice,\u0027 he echoed Fats, smiling at the sound of his own voice. He passed the joint back into Fat\u0027s waiting fingers and savoured this sense of well-being. \u0027So, you wanna hear something interesting?\u0027 said Fats, grinning uncontrollably. \u0027Go on.\u0027 \u0027I fucked her last night.\u0027 Andrew nearly said \u0027who?\u0027, before his befuddled brain remembered: Krystal Weedon, of course; Krystal Weedon, who else? \u0027Where?\u0027 he asked, stupidly. It was not what he wanted to know. Fats stretched out on his back in his funeral suit, his feet towards the river. Wordlessly, Andrew stretched out beside him, in the opposite direction. They had slept like this, \u0027top and tail\u0027, when they had stayed overnight at each other\u0027s houses as children. Andrew gazed up at the rocky ceiling, where the blue smoke hung, slowly furling, and waited to hear everything. \u0027I told Cubby and Tess I was at yours, so you know,\u0027 said Fats. He passed the joint into Andrew\u0027s reaching fingers, then linked his long hands on his chest, and listened to himself telling. \u0027Then I got the bus to the Fields. Met her outside Oddbins.\u0027 \u0027By Tesco\u0027s?\u0027 asked Andrew. He did not know why he kept asking dumb questions. \u0027Yeah,\u0027 said Fats. \u0027We went to the rec. There\u0027s trees in the corner behind the public bogs. Nice and private. It was getting dark.\u0027 Fats shifted position and Andrew handed back the joint. \u0027Getting in\u0027s harder than I thought it would be,\u0027 said Fats, and Andrew was mesmerized, half inclined to laugh, afraid of missing every unvarnished detail Fats could give him. \u0027She was wetter when I was fingering her.\u0027 A giggle rose like trapped gas in Andrew\u0027s chest, but was stifled there. \u0027Lot of pushing to get in properly. It\u0027s tighter than I thought.\u0027 Andrew saw a jet of smoke rise from the place where Fats\u0027 head must be. \u0027I came in about ten seconds. It feels fucking great once you\u0027re in.\u0027 Andrew fought back laughter, in case there was more. \u0027I wore a johnny. It\u0027d be better without.\u0027 He pushed the joint back into Andrew\u0027s hand. Andrew pulled on it, thinking. Harder to get in than you thought; over in ten seconds. It didn\u0027t sound much; yet what wouldn\u0027t he give? He imagined Gaia Bawden flat on her back for him and, without meaning to, let out a small groan, which Fats did not seem to hear. Lost in a fug of erotic images, pulling on the joint, Andrew lay with his erection on the patch of earth his body was warming and listened to the soft rush of the water a few feet from his head. \u0027What matters, Arf?\u0027 asked Fats, after a long, dreamy pause. His head swimming pleasantly, Andrew answered, \u0027Sex.\u0027 \u0027Yeah,\u0027 said Fats, delighted. \u0027Fucking. That\u0027s what matters. Propogun ... propogating the species. Throw away the johnnies. Multiply.\u0027 \u0027Yeah,\u0027 said Andrew, laughing. \u0027And death,\u0027 said Fats. He had been taken aback by the reality of that coffin, and how little material lay between all the watching vultures and an actual corpse. He was not sorry that he had left before it disappeared into the ground. \u0027Gotta be, hasn\u0027t it? Death.\u0027 \u0027Yeah,\u0027 said Andrew, thinking of war and car crashes, and dying in blazes of speed and glory. \u0027Yeah,\u0027 said Fats. \u0027Fucking and dying. That\u0027s it, innit? Fucking and dying. That\u0027s life.\u0027 \u0027Trying to get a fuck and trying not to die.\u0027 \u0027Or trying to die,\u0027 said Fats. \u0027Some people. Risking it.\u0027 \u0027Yeah. Risking it.\u0027 There was more silence, and their hiding place was cool and hazy. \u0027And music,\u0027 said Andrew quietly, watching the blue smoke hanging beneath the dark rock. \u0027Yeah,\u0027 said Fats, in the distance. \u0027And music.\u0027 The river rushed on past the Cubby Hole.","sourceLink":"https://allnovel.net/the-casual-vacancy/page-7.html","bookId":2230,"book":{"id":2230,"title":"The Casual Vacancy","description":"Storyline: When Barry Fairbrother dies unexpectedly in his early forties, the little town of Pagford is left in shock. Pagford is, seemingly, an English idyll, with a cobbled market square and an ancient abbey, but what lies behind the pretty fade is a town at war. Rich at war with poor, teenagers at war with their parents, wives at war with their husbands, teachers at war with their pupils. Pagford is not what it first seems. And the empty seat left by Barry on the town\u0027s council soon becomes the catalyst for the biggest war the town has yet seen. Who will triumph in an election fraught with passion, duplicity and unexpected revelations? Blackly comic, thought-provoking and constantly surprising, The Casual Vacancy is J.K. Rowling\u0027s first novel for adults.","cover":"https://allnovel.net/images/the-casual-vacancy.jpg","author":"J.K. Rowling","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-casual-vacancy.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 11:07:43 PM"}}
