{"id":23983,"no":13,"title":"THE BROWNIES\u0027 DANCING-SCHOOL.","content":"WHEN flitting bats commenced to wheel Around the eaves to find their meal, And owls to hoot in forests wide, To call their owlets to their side, The Brownie Band, in full array, Through silent streets pursued their way. But as they neared a building high, Surprise was shown in every eye. They heard the strains of music sweet, And tripping of the dancers\u0027 feet; While o\u0027er the tap of heel and toe, The twang of harp and scrape of bow, Arose the clear and ringing call Of those who had control of all. The Brownies slackened their swift pace, Then gathered closely round the place, To study out some way to win A peep or two at those within. Said one: \"In matters of this kind Opinions differ, you will find. And some might say, with sober thought, That children should not thus be taught To hop around on toe and heel So actively to fiddle\u0027s squeal, For fear \u0027twould turn their minds away From graver duties of the day.\" Another said: \"The dancing art Doth ease to every move impart. It gives alike to city-bred And country-born a graceful tread, And helps them bear themselves along Without offense in greatest throng. The nimble step, the springing knee, And balanced body all agree. The feet, my friends, may glide with grace As well as trudge from place to place. And in the parlor or without They best can stand or walk about Who found in early life a chance To mingle in the sprightly dance.\" The Brownies need no ladders long, No hoists, nor elevators strong, To lift them to an upper flight, A window-sill, or transom light. The weather-vane upon the spire, That overlooks the town entire, Is not too high above the base If fancy leads them to the place. \u0027Tis said the very fleecy clouds They can bestride in eager crowds, Around the world their way to find, And leave the lagging winds behind. Said one: \"We\u0027ve scaled the dizzy heights Of mountain-peaks on other nights, And crossed the stream from shore to shore Where but the string-piece stretched before; And cunning Brownies, never fear, WHEN once the Brownies\u0027 plans were laid, No formal, tiresome speech was made. In mystic ways, to Brownies known, They clambered up the walls of stone. They clung to this and that, like briers, They climbed the smooth electric wires; Some members lending ready aid To those who weaker nerves displayed. And in five minutes at the most, By vine, by bracket, and by post, By every scroll, and carving bold, That toes could touch or fingers hold They made their way, and gained a chance To view, unnoticed, every dance. Said one: \"How pleasant is the sight To see those children young and bright While skipping blithely to and fro, Now joined in pairs, now in a row, Or formed in circles, hand in hand, And lightly moving at command— Like butterflies through balmy air When summer spreads attractions fair, And blends with every whispering breeze The drowsy hum of working bees.\" Another said: \"When this is o\u0027er The Brownie Band will take the floor. We\u0027ll bide our time and not be slow To take possession when they go. Then up and down the spacious hall We\u0027ll imitate the steps of all. We\u0027ll show that not in Frenchmen\u0027s bones Lies all the grace that nature owns; That others at the waltz can shine As well as Germans from the Rhine; That we some capers can enjoy As well as natives of Savoy.\" While thus they talked, the moments flew, And soon the master\u0027s task was through. When children\u0027s cloaks were wrapped around, And heavier shoes their feet had found They hastened home; but while they slept The Brownies in that building crept To take their turn at lively reel, At graceful glide, or dizzy wheel, Till all the dances people know, From Cuba\u0027s palms to Russia\u0027s snow Were tried, and soon in every case Were mastered with surprising grace. Imagine how they skipped about, And how they danced, with laugh and shout! NO sooner had the Brownies run Into the hall than \u0027twas begun. Some round the harp, with cunning stroke, The music in the strings awoke. The violins to others fell, Who scraped, and sawed, and fingered well, Until the sweet and stirring air Would rouse the feet of dullest there. Like people in the spring of life, Of joys and countless blessings rife, Who yield themselves to Pleasure\u0027s hand— So danced that night the Brownie Band. First one would take his place to show The special step for heel or toe, Just how to edge about with care, And help around the partner fair, Nor plant his feet upon a dress— To cause confusion and distress. Then more would play the master\u0027s part, And give some lessons in the art: Would show the rest some figures new From Turkey, China, or Peru. Now smoothly glide, as if on wings, Then bob around, as if on springs, Until the sprightly steps would call Loud acclamations from them all. They danced in twos with skip and bound, They danced in circles, round and round; They danced in lines that coiled about As runs the serpent in and out, Some moving slow, some standing still— More cutting capers with a will. At length, by joining hand in hand, The set included all the band. A happier crowd was never seen On ball-room floor or village green. By turns they danced, by turns would go And try their skill at string and bow— They almost sawed the fiddle through, So fast the bow across it flew. And louder still the harp would ring, As nimbler fingers plucked the string. Alike they seemed a skillful band Upon the floor or music-stand. The night wore on, from hour to hour, And still they danced with vim and power; For supple-kneed and light of toe The Brownies are, as well you know, And such a thing as tiring out Gives them but small concern, no doubt. As long as darkness hung her pall In heavy folds around the hall, The Brownies stayed to dance and play, TO dance the figures o\u0027er and o\u0027er, They lingered on the polished floor; No sooner was one party done Than others the position won. They chose their partners for the set, And bowed, and scraped, and smiling, met. As night advanced, and morning gray Nigh and still nigher cast its ray, The lively Brownies faster flew, Across and back, around and through; Now down the center, up the side, Then back to place with graceful glide— Until it seemed that even day Would hardly drive the band away. At length some, more upon their guard Against surprises, labored hard To urge their comrades from the place Before the sun would show his face. They pulled and hauled with all their might At those half crazy with delight, Who still would struggle for a chance To have, at least, another dance— Some figure that was quite forgot, Although \"the finest of the lot.\" Another wished to linger still— In spite of warning words—until Each member present on the floor Had been his partner twice or more. Meantime, outside, the tell-tale dyes Of morn began to paint the skies, And, one by one, the stars of night Grew pale before the morning\u0027s light. Alone, bright Venus, in the west, Upheld her torch and warned the rest; While from the hedge the piping note Of waking birds began to float; And crows upon the wooded hills Commenced to stir and whet their bills, When Brownies scampered from the place, And undertook the homeward race. Nor made a halt in street or square, Or verdant park, however fair; But farther from the sight of man And light of day, they quickly ran. They traveled at their highest speed, And swiftly must they go, indeed; For, like the spokes of some great wheel, The rays of light began to steal Still higher up the eastern sky, And showed the sun was rolling nigh. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2778/76905.html","bookId":1314,"book":{"id":1314,"title":"Another Brownie Book","description":"简介： When snowdrifts blocked the country roads,And trees were bending with their loads,The wind grew mild which had been raw...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2778","creation":"Aug 1, 2019 12:24:50 AM","modification":"Aug 1, 2019 12:24:50 AM"}}
