{"id":23976,"no":6,"title":"THE BROWNIES FISHING.","content":"WHEN glassy lakes and streams about Gave up their bass and speckled trout, The Brownies stood by water clear As shades of evening gathered near. Said one: \"Now country lads begin To trim the rod and bend the pin To catch the frogs and minnows spry That in the brooks and ditches lie. While city chaps with reels come down, And line enough to gird the town, And flies of stranger shape and hue Than ever Mother Nature knew— With horns like crickets, tails like mice, And plumes like birds of Paradise. Thus well prepared for sunny sky Or cloudy weather, wet or dry, They take the fish from stream and pool By native art and printed rule.\" Another said: \"With peeping eyes I\u0027ve watched an angler fighting flies, And thought, when thus he stood to bear The torture from those pests of air, There must indeed be pleasure fine Behind the baited hook and line. Now, off like arrows from the bow In search of tackle some must go; While others stay to dig supplies Of bait that anglers highly prize,— Such kind as best will bring the pout The dace, the chub, and \u0027shiner\u0027 out; While locusts gathered from the grass Will answer well for thorny bass.\" Then some with speed for tackle start, And some to sandy banks depart, And some uplift a stone or rail In search of cricket, grub, or snail; While more in dewy meadows draw The drowsy locust from the straw. Nor is it long before the band Stands ready for the sport in hand. It seemed the time of all the year When fish the starving stage were near: They rose to straws and bits of bark, To bubbles bright and shadows dark, And jumped at hooks, concealed or bare, While yet they dangled in the air. Some Brownies many trials met Almost before their lines were wet; For stones below would hold them fast, And limbs above would stop the cast, And hands be forced to take a rest, At times when fish were biting best. Some stumbled in above their boots, And others spoiled their finest suits; But fun went on; for many there Had hooks that seemed a charm to bear, And fish of various scale and fin On every side were gathered in. The catfish left his bed below, With croaks and protests from the go; And nerve as well as time it took From such a maw to win the hook. With horns that pointed every way, And life that seemed to stick and stay, Like antlered stag that stands at bay, He lay and eyed the Brownie band, And threatened every reaching hand. The gamy bass, when playing fine, Oft tried the strength of hook and line, And strove an hour before his mind To changing quarters was resigned. Some eels proved more than even match For those who made the wondrous catch, And, like a fortune won with ease, They slipped through fingers by degrees, And bade good-bye to margin sands, In spite of half a dozen hands. The hungry, wakeful birds of air Soon gathered \u0027round to claim their share, And did for days themselves regale On fish of every stripe and scale. Thus sport went on with laugh and shout, As hooks went in and fish came out, While more escaped with wounded gill, And yards of line they\u0027re trailing still; But day at length began to break, And forced the Brownies from the lake. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2778/76898.html","bookId":1314,"book":{"id":1314,"title":"Another Brownie Book","description":"简介： When snowdrifts blocked the country roads,And trees were bending with their loads,The wind grew mild which had been raw...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2778","creation":"Aug 1, 2019 12:24:50 AM","modification":"Aug 1, 2019 12:24:50 AM"}}
