{"id":109534,"no":8,"title":"Page 8","content":"GOING OUT AGAIN didn\u0027t really happen until the weekend. Brayden and I were both overachieving enough to manage weeknight outings and still finish homework - but neither of us liked to do it if we could avoid it. Besides, my weeknights usually had some other conflict with the gang, be it a feeding or the experiments. Eddie had given his blood this week, and I\u0027d made a point to not be around when it happened, lest Sonya try to pitch to me again. Brayden had wanted to go out Saturday, but that was the day I\u0027d promised to drive Adrian to San Diego. Brayden compromised on breakfast, catching me before I hit the road, and we went out to a restaurant adjacent to one of Palm Springs\u0027 many lush golf resorts. Although I had long since offered to pull my share, Brayden continued picking up the bills and doing all the driving. As he pulled up in front of my dorm to drop me off afterward, I saw a surprising and not entirely welcome sight awaiting me: Adrian sitting outside on a bench, looking bored. \"Oh geez,\" I said. \"What?\" asked Brayden. \"That\u0027s my brother.\" I knew there was no avoiding this. The inevitable had happened. Adrian would probably cling to Brayden\u0027s bumper until he got an introduction. \"Come on, you can meet him.\" Brayden left the car idling and stepped out, casting an anxious glance at the NO PARKING sign. Adrian jumped up from his seat, a look of supreme satisfaction on his face. \"Wasn\u0027t I supposed to pick you up?\" I asked. \"Sonya had some errands to run and offered to drop me here while she was out,\" he explained. \"Figured we\u0027d save you some trouble.\" Adrian had known what I was doing this morning, so I wasn\u0027t entirely sure his motives had been all that selfless. \"This is Brayden,\" I told him. \"Brayden, Adrian.\" Adrian shook his hand. \"I\u0027ve heard so much about you.\" I didn\u0027t doubt that but wondered who exactly he\u0027d heard it from. Brayden gave a friendly smile back. \"I\u0027ve actually never heard of you. I didn\u0027t even know Sydney had another brother.\" \"You never mentioned me?\" Adrian shot me a look of mock hurt. \"It never came up,\" I said. \"You\u0027re still in high school, right?\" asked Adrian. He nodded toward the Mustang. \"You must have a side job to make those car payments, though. Unless you\u0027re one of those slackers who just tries to get money off of their parents.\" Brayden looked indignant. \"Of course not. I work almost every day at a coffee shop.\" \"A coffee shop,\" repeated Adrian, managing to convey a million shades of disapproval in his tone. \"I see.\" He glanced over at me. \"I suppose it could be worse.\" \"Adrian - \" \"Well, it\u0027s not like I\u0027m going to work there forever,\" protested Brayden. \"I\u0027ve already been accepted to USC, Stanford, and Dartmouth.\" Adrian nodded thoughtfully. \"I guess that\u0027s respectable. Although, I\u0027ve always thought of Dartmouth as the kind of school people go to when they can\u0027t get into Yale or Harv - \" \"We really need to go,\" I interrupted, grabbing hold of Adrian\u0027s arm. I attempted to tug him toward the student parking lot and failed. \"We don\u0027t want to get caught in traffic.\" Brayden glanced at his cell phone. \"Traffic patterns should be relatively light going west this time of the day, but being a weekend, you never know how tourists might alter things, especially with the various attractions in San Diego. If you look at traffic models applying the Chaos Theory - \" \"Exactly,\" I said. \"Better safe than sorry. I\u0027ll text you when I get back, okay? We\u0027ll figure out the rest of this week.\" For once, I didn\u0027t have to stress about handshaking or kissing or anything like that. I was too fixated on dragging Adrian away before he could open his mouth and say something inflammatory. Brayden, while passionate about academic topics and me disagreeing with him, tended to otherwise be pretty mild-mannered. He hadn\u0027t exactly been upset just now, but that was certainly the most agitated I\u0027d ever seen him. Leave it to Adrian to work up even the most easygoing people. \"Really?\" I asked, once we were safely inside Latte. \"You couldn\u0027t have just said \u0027nice to meet you,\u0027 and let it go?\" Adrian pushed back the passenger seat, managing the most lounging position possible while still wearing a seatbelt. \"Just looking out for you, sis. Don\u0027t want you ending up with some deadbeat. Believe me, I\u0027m an expert on that kind of thing.\" \"Well, I appreciate your insider knowledge, but I\u0027ll manage this on my own, thanks just the same.\" \"Come on, a barista? Why not some business intern?\" \"I like that he\u0027s a barista. He always smells like coffee.\" Adrian rolled down a window, letting the breeze ruffle his hair. \"I\u0027m surprised you let him drive you around, especially considering the way you freak out if anyone touches the controls in your car.\" \"Like the window?\" I asked pointedly. \"When the air conditioning\u0027s on?\" Adrian took the hint and raised the window back up. \"He wants to drive. So I let him. Besides, I like that car.\" \"That is a nice car,\" Adrian admitted. \"Though I never took you for the type to go for status symbols.\" \"I don\u0027t. I like it because it\u0027s an interesting car with a long history.\" \"Translation: status symbol.\" \"Adrian.\" I sighed. \"This is going to be a long ride.\" In actuality, we made pretty good time. Despite Brayden\u0027s speculations, traffic moved easily, enough that I felt I deserved a coffee break halfway through. Adrian got a mocha - \"Can you spot me this one time, Sage?\" - and maintained his usual breezy conversation style throughout most of the trip. I couldn\u0027t help but notice, when we were about thirty minutes out, he grew more withdrawn and thoughtful. His banter dropped off, and he spent a lot of time gazing out the window. I could only assume the reality of his seeing his dad was setting in. It was certainly something I could relate to. I\u0027d be just as anxious if I was about to see mine. I didn\u0027t really think Adrian would appreciate a shared psychotherapy session, though, so I groped for a safer topic to draw him out of his blue mood. \"Have you guys learned anything from Eddie and Dimitri\u0027s blood?\" I asked. Adrian glanced at me in surprise. \"Didn\u0027t expect you to bring that up.\" \"Hey, I\u0027m curious about the science of it. I just didn\u0027t want to participate.\" He accepted this. \"Not much to tell so soon. They sent the samples off to a lab - one of your labs, I think - to see if there\u0027s anything physically different between the two. Sonya and I did pick up a... oh, I don\u0027t know how to describe it. Like, a \u0027hum\u0027 of spirit in Belikov\u0027s blood. Not that him having magic blood should surprise anyone. Most people seem to think everything he does is magic.\" \"Oh, come on,\" I said. \"That\u0027s unfair.\" \"Is it? You\u0027ve seen the way Castile worships him. He wants to be just like Belikov when he grows up. And even though Sonya\u0027s usually the spokesperson for our research, she won\u0027t breathe without checking with him beforehand. \u0027What do you think, Dimitri?\u0027 \u0027Is this a good idea, Dimitri?\u0027 \u0027Please give us your blessing so that we can fall down and worship you, Dimitri.\u0027\" I shook my head in exasperation. \"Again - unfair. They\u0027re research partners. Of course she\u0027s going to consult him.\" \"She consults him more than me.\" Probably because Adrian always looked bored during their research, but I figured it wouldn\u0027t help to bring that up. \"They\u0027ve both been Strigoi. They\u0027ve kind of got a unique insight to this.\" He didn\u0027t respond for several moments. \"Okay. I\u0027ll give you points for that. But you can\u0027t argue that there was any competition between me and him when it came to Rose. You saw them together. I never had a chance. I can\u0027t compare.\" \"Well, why do you have to?\" Part of me also wanted to ask what Rose had to do with this, but Jill had told me numerous times that for Adrian, everything came back to Rose. \"Because I wanted her,\" Adrian said. \"Do you still want her?\" No answer. Rose was a dangerous topic; one I wished we hadn\u0027t weirdly stumbled into. \"Look,\" I said. \"You and Dimitri are two different people. You shouldn\u0027t compare yourself to him. You shouldn\u0027t try to be like him. I mean, I\u0027m not going to sit here and rip him apart or anything. I like Dimitri. He\u0027s smart and dedicated, insanely brave and ferocious. Good in a fight. And he\u0027s just a nice guy.\" Adrian scoffed. \"You left out dreamy and ruggedly handsome.\" \"Hey, you\u0027re pretty easy on the eyes too,\" I teased, quoting something he\u0027d told me a while ago. He didn\u0027t smile. \"And don\u0027t underestimate yourself. You\u0027re smart too, and you can talk yourself out of - and into - anything. You don\u0027t even need magical charisma.\" \"So far I\u0027m not seeing a lot of difference between me and a carnival con-man.\" \"Oh, stop,\" I said. He could make me laugh even with the most serious of topics. \"You know what I mean. And you\u0027re also one of the most fiercely loyal people I know - and caring, no matter how much you pretend otherwise. I see the way you look after Jill. Not many people would\u0027ve traveled across the country to help her. And almost no one would have done what you did to save her life.\" Again, Adrian took a while to respond. \"But what are loyal and caring really worth?\" \"To me? Everything.\" There was no hesitation in my answer. I\u0027d seen too much backstabbing and calculation in my life. My own father judged people not by who they were but by what they could do for him. Adrian did care passionately about others underneath all of his bravado and flippancy. I\u0027d seen him risk his life to prove it. Considering I\u0027d had someone\u0027s eye cut out to avenge my sister... well. Devotion was definitely something I could appreciate. Adrian didn\u0027t say anything else for the rest of the drive, but at least I didn\u0027t get the impression he was brooding anymore. Mostly he seemed thoughtful, and that wasn\u0027t so concerning. What did make me a little uneasy was that I often caught sight of him studying me in my periphery. I replayed what I\u0027d said over and over in my mind, trying to figure out if there\u0027d been anything to warrant such attention. Adrian\u0027s father was staying at a sprawling San Diego hotel with a vibe similar to the resort Brayden and I had eaten breakfast at. Businessmen in suits mingled with pleasure seekers in tropical prints and flip-flops. I\u0027d almost worn jeans to breakfast and was glad now for my choice of a gray skirt and short-sleeved blouse with a muted blue and gray print. It had a tiny ruffled trim, and the skirt had a very, very faint herringbone pattern. Normally, I wouldn\u0027t have worn such contrasting textures together, but I\u0027d liked the boldness of the look. I\u0027d pointed it out to Jill before I left the dorm for breakfast. It\u0027d taken her a while to even find the contrasting textures, and when she did, she\u0027d rolled her eyes. \"Yeah, Sydney. You\u0027re a real rebel.\" Meanwhile, Adrian was in one of his typical summer outfits, jeans and a button-up shirt - though of course the shirt was untucked, with the sleeves rolled up and a few top buttons undone. He wore that look all the time, and despite its casual fa\u0026ccedil;ade, he often made it appear dressy and fashionable. Not today, however. These were the most worn-out jeans I\u0027d ever seen him wear - the knees were on the verge of having holes. The dark green shirt, while nice quality and a perfect match for his eyes, was wrinkled to inexplicable levels. Sleeping in it or tossing it on the floor wouldn\u0027t achieve that state. I was pretty sure someone would have to actually crumple it into a ball and sit on it for it to look that bad. If I\u0027d noticed it back at Amberwood (and hadn\u0027t been so distracted getting him away from Brayden), I would\u0027ve insisted on ironing the shirt before we left. He still looked good, of course. He always looked good, no matter the condition of his clothing and hair. It was one of the more annoying things about him. This rumpled look made him come across as some pensive European model. Studying him as we took the elevator to the second floor lobby, I decided it couldn\u0027t be a coincidence that the most disheveled outfit I\u0027d ever seen Adrian in had fallen on the day he had a father-son visit. The question was: why? He\u0027d complained that his dad always found fault with him. Dressing this way seemed like Adrian was just providing one more reason. The elevator opened, and I gasped as we stepped out. The back wall of the lobby was almost entirely covered with windows that offered a dramatic view of the Pacific. Adrian chuckled at my reaction and took out his cell phone. \"Take a closer look while I call the old man.\" He didn\u0027t have to tell me twice. I walked over to one of the glass walls, admiring the vast, blue-gray expanse. I imagined that on cloudy days, it would be hard to tell where sky ended and ocean began. The weather was gorgeous out today, full of sun and a perfectly clear azure-blue sky. On the lobby\u0027s right side, a set of doors opened up onto a Mediterranean style balcony where diners were enjoying lunch out in the sun. Looking down to ground level, I caught sight of a sparkling pool as blue as the sky, surrounded in palm trees and sunbathers. I didn\u0027t have the same longing for water that a magic user like Jill possessed, but I had been living in the desert for almost two months. This was amazing. I was so transfixed with the beauty outside that I didn\u0027t notice Adrian\u0027s return. In fact, I didn\u0027t even notice he was standing right beside me until a mother calling for her daughter - also named Sydney - made me glance aside. There, I saw Adrian only inches away, watching me with amusement. I flinched and stepped back a little. \"How about some warning next time?\" He smiled. \"I didn\u0027t want to interrupt. You looked happy for a change.\" \"For a change? I\u0027m happy lots of times.\" I knew Adrian well enough to recognize the sign of an incoming snarky comment. At the last second, he changed course, his expression turning serious. \"Does that guy - that Brendan guy - \" \"Brayden.\" \"Does that Brayden guy make you happy?\" I looked at Adrian in surprise. These kinds of questions were almost always a setup from him, but his neutral face made it hard to guess his motives this time. \"I guess,\" I said at last. \"Yeah. I mean, he doesn\u0027t make me unhappy.\" That brought Adrian\u0027s smile back. \"Red-hot answer if ever there was one. What do you like about him? Aside from the car? And that he smells like coffee?\" \"I like that he\u0027s smart,\" I said. \"I like that I don\u0027t have to dumb myself down around him.\" Now Adrian frowned. \"You do that a lot for people?\" I was surprised at the bitterness in my own laugh. \"\u0027A lot?\u0027 Try all the time. Probably the most important thing I\u0027ve learned at Amberwood is that people don\u0027t like to know how much you know. With Brayden, there\u0027s no censoring for either of us. I mean, just look at this morning. One minute we were talking Halloween costumes, the next we were discussing the ancient Athenian origins of democracy.\" \"I\u0027m not going to claim to be a genius, but how the hell did you make that leap?\" \"Oh,\" I said. \"Our Halloween costumes. We\u0027re dressing Greek. From the Athenian era.\" \"Of course,\" he said. And this time, I could tell the snark was about to return. \"No sexy cat costumes for you. Only the most dignified, feminist attire will do.\" I shook my head. \"Feminist? Oh, no. Not Athenian women. They\u0027re about as far from feminist as you can - well, forget it. It\u0027s not really important.\" Adrian did a double take. \"That\u0027s it, isn\u0027t it?\" He leaned toward me, and I nearly moved back... but something held me where I was, something about the intensity in his eyes. \"What?\" I asked. He pointed at me. \"You stopped yourself just now. You just dumbed it down for me.\" I hesitated only a moment. \"Yeah, I kind of did.\" \"Why?\" \"Because you really don\u0027t want to hear about ancient Athens, any more than you wanted to hear Brayden talk about Chaos Theory.\" \"That\u0027s different,\" said Adrian. He hadn\u0027t moved away and was still standing so, so close to me. It seemed like that should\u0027ve bothered me, but it didn\u0027t. \"He\u0027s boring. You make learning fun. Like a children\u0027s book or after school special. Tell me about your... um, Athenian women.\" I tried not to smile. I admired his intentions here but knew he really wasn\u0027t up for a history lesson. Again, I wondered what game was going on. Why was he pretending to be interested? I tried to compose an answer that would take less than sixty seconds. \"Most Athenian women weren\u0027t educated. They mostly stayed inside and were just expected to have kids and take care of the house. The most progressive women were the hetaerae. They were like entertainers and high-class prostitutes. They were educated and a little flashier. Powerful men kept their wives at home to raise children and then hung out with hetaerae for fun.\" I paused, unsure if he\u0027d followed any of that. \"Like I said, it\u0027s not really important.\" \"I don\u0027t know,\" said Adrian thoughtfully. \"I find prostitutes vastly important.\" \"Well. How refreshing to see that things haven\u0027t changed,\" a new voice cut in. We both flinched and looked up at the scowling man who had just joined us. Adrian\u0027s father had arrived.","sourceLink":"https://allnovel.net/the-golden-lily-bloodlines-2/page-8.html","bookId":2042,"book":{"id":2042,"title":"The Golden Lily (Bloodlines #2)","description":"Storyline: The book follows Sydney Sage, a young Alchemist that is forced to hide inside a ritzy boarding school in Palm Springs, California so that she can protect Jill Dragomir, a Moroi princess. The Alchemists one of a group of humans who dabble in magic and serve to bridge the worlds of humans and vampires. They protect vampire secrets - and human lives. There are those who want Jill dead by an assassin\u0027s hand in order to provoke a civil war within the Moroi court. The assignment provides Sydney a way to redeem herself from previous disgrace but her close proximity with Jill, Eddie, and Adrian cause her to question everything she thought she knew about herself, Alchemists, and the world in general. During all of this Sydney finds herself also questioning her relationship with Brayden, someone who is seemingly perfect for her in every way. Even as she cares for him, Sydney finds her attentions also being drawn to someone that she can never be allowed to be with. As secrets come to light and loyalties are given a trial by fire, Sydney has to find a way to make it through all of this with herself and all that she cares for intact.","cover":"https://allnovel.net/images/the-golden-lily-bloodlines-2.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-golden-lily-bloodlines-2.html","creation":"Oct 5, 2019 8:58:17 AM","modification":"Oct 5, 2019 11:38:08 PM"}}
