{"id":63916,"no":19,"title":"Page 19","content":"PART III \"THE ENEMY\"\\n\\n 19.\\n\\n \"Ladies and gentlemen, let the Seventy-fifth Hunger Games begin!\" The voice of Claudius Templesmith, the Hunger Games announcer, hammers my ears. I have less than a minute to get my bearings. Then the gong will sound and the tributes will be free to move off their metal plates. But move where?\\n\\n I can\u0027t think straight. The image of Cinna, beaten and bloody, consumes me. Where is he now? What are they doing to him? Torturing him? Killing him? Turning him into an Avox? Obviously his assault was staged to unhinge me, the same way Darius\u0027s presence in my quarters was. And it has unhinged me. All I want to do is collapse on my metal plate. But I can hardly do that after what I just witnessed. I must be strong. I owe it to Cinna, who risked everything by undermining President Snow and turning my bridal silk into mockingjay plumage. And I owe it to the rebels who, emboldened by Cinna\u0027s example, might be fighting to bring down the Capitol at this moment. My refusal to play the Games on the Capitol\u0027s terms is to be my last act of rebellion. So I grit my teeth and will myself to be a player.\\n\\n Where are you? I can still make no sense of my surroundings. Where are you?! I demand an answer from myself and slowly the world comes into focus. Blue water. Pink sky. White-hot sun beating down. All right, there\u0027s the Cornucopia, the shining gold metal horn, about forty yards away. At first, it appears to be sitting on a circular island. But on closer examination, I see the thin strips of land radiating from the circle like the spokes on a wheel. I think there are ten to twelve, and they seem equidistant from one another. Between the spokes, all is water. Water and a pair of tributes.\\n\\n That\u0027s it, then. There are twelve spokes, each with two tributes balanced on metal plates between them. The other tribute in my watery wedge is old Woof from District 8. He\u0027s about as far to my right as the land strip on my left. Beyond the water, wherever you look, a narrow beach and then dense greenery. I scan the circle of tributes, looking for Peeta, but he must be blocked from my view by the Cornucopia.\\n\\n I catch a handful of water as it washes in and smell it. Then I touch the tip of my wet finger to my tongue. As I suspected, it\u0027s saltwater. Just like the waves Peeta and I encountered on our brief tour of the beach in District 4. But at least it seems clean.\\n\\n There are no boats, no ropes, not even a bit of driftwood to cling to. No, there\u0027s only one way to get to the Cornucopia. When the gong sounds, I don\u0027t even hesitate before I dive to my left. It\u0027s a longer distance than I\u0027m used to, and navigating the waves takes a little more skill than swimming across my quiet lake at home, but my body seems oddly light and I cut through the water effortlessly. Maybe it\u0027s the salt. I pull myself, dripping, onto the land strip and sprint down the sandy stretch for the Cornucopia. I can see no one else converging from my side, although the gold horn blocks a good portion of my view. I don\u0027t let the thought of adversaries slow me down, though. I\u0027m thinking like a Career now, and the first thing I want is to get my hands on a weapon.\\n\\n Last year, the supplies were spread out quite a distance around the Cornucopia, with the most valuable closest to the horn. But this year, the booty seems to be piled at the twenty-foot-high mouth. My eyes instantly home in on a golden bow just in arm\u0027s reach and I yank it free.\\n\\n There\u0027s someone behind me. I\u0027m alerted by, I don\u0027t know, a soft shift of sand or maybe just a change in the air currents. I pull an arrow from the sheath that\u0027s still wedged in the pile and arm my bow as I turn.\\n\\n Finnick, glistening and gorgeous, stands a few yards away, with a trident poised to attack. A net dangles from his other hand. He\u0027s smiling a little, but the muscles in his upper body are rigid in anticipation. \"You can swim, too,\" he says. \"Where did you learn that in District Twelve?\"\\n\\n \"We have a big bathtub,\" I answer.\\n\\n \"You must,\" he says. \"You like the arena?\"\\n\\n \"Not particularly. But you should. They must have built it especially for you,\" I say with an edge of bitterness. It seems like it, anyway, with all the water, when I bet only a handful of the victors can swim. And there was no pool in the Training Center, no chance to learn. Either you came in here a swimmer or you\u0027d better be a really fast learner. Even participation in the initial bloodbath depends on being able to cover twenty yards of water. That gives District 4 an enormous advantage.\\n\\n For a moment we\u0027re frozen, sizing each other up, our weapons, our skill. Then Finnick suddenly grins. \"Lucky thing we\u0027re allies. Right?\"\\n\\n Sensing a trap, I\u0027m about to let my arrow fly, hoping it finds his heart before the trident impales me, when he shifts his hand and something on his wrist catches the sunlight. A solid-gold bangle patterned with flames. The same one I remember on Haymitch\u0027s wrist the morning I began training. I briefly consider that Finnick could have stolen it to trick me, but somehow I know this isn\u0027t the case. Haymitch gave it to him. As a signal to me. An order, really. To trust Finnick.\\n\\n I can hear other footsteps approaching. I must decide at once. \"Right!\" I snap, because even though Haymitch is my mentor and trying to keep me alive, this angers me. Why didn\u0027t he tell me he\u0027d made this arrangement before? Probably because Peeta and I had ruled out allies. Now Haymitch has chosen one on his own.\\n\\n \"Duck!\" Finnick commands in such a powerful voice, so different from his usual seductive purr, that I do. His trident goes whizzing over my head and there\u0027s a sickening sound of impact as it finds its target. The man from District 5, the drunk who threw up on the sword-fighting floor, sinks to his knees as Finnick frees the trident from his chest. \"Don\u0027t trust One and Two,\" Finnick says.\\n\\n There\u0027s no time to question this. I work the sheath of arrows free. \"Each take one side?\" I say. He nods, and I dart around the pile. About four spokes apart, Enobaria and Gloss are just reaching land. Either they\u0027re slow swimmers or they thought the water might be laced with other dangers, which it might well be. Sometimes it\u0027s not good to consider too many scenarios. But now that they\u0027re on the sand, they\u0027ll be here in a matter of seconds.\\n\\n \"Anything useful?\" I hear Finnick shout.\\n\\n I quickly scan the pile on my side and find maces, swords, bows and arrows, tridents, knives, spears, axes, metallic objects I have no name for ... and nothing else.\\n\\n \"Weapons!\" I call back. \"Nothing but weapons!\"\\n\\n \"Same here,\" he confirms. \"Grab what you want and let\u0027s go!\"\\n\\n I shoot an arrow at Enobaria, who\u0027s gotten in too close for comfort, but she\u0027s expecting it and dives back into the water before it can find its mark. Gloss isn\u0027t quite as swift, and I sink an arrow into his calf as he plunges into the waves. I sling an extra bow and a second sheath of arrows over my body, slide two long knives and an awl into my belt, and meet up with Finnick at the front of the pile.\\n\\n \"Do something about that, would you?\" he says. I see Brutus barreling toward us. His belt is undone and he has it stretched between his hands as a kind of shield. I shoot at him and he manages to block the arrow with his belt before it can skewer his liver. Where it punctures the belt, a purple liquid spews forth, coating his face. As I reload, Brutus flattens on the ground, rolls the few feet to the water, and submerges. There\u0027s a clang of metal falling behind me. \"Let\u0027s clear out,\" I say to Finnick.\\n\\n This last altercation has given Enobaria and Gloss time to reach the Cornucopia. Brutus is within shooting distance and somewhere, certainly, Cashmere is nearby, too. These four classic Careers will no doubt have a prior alliance. If I had only my own safety to consider, I might be willing to take them on with Finnick by my side. But it\u0027s Peeta I\u0027m thinking about. I spot him now, still stranded on his metal plate. I take off and Finnick follows without question, as if knowing this will be my next move. When I\u0027m as close as I can get, I start removing knives from my belt, preparing to swim out to reach him and somehow bring him in.\\n\\n Finnick drops a hand on my shoulder. \"I\u0027ll get him.\"\\n\\n Suspicion flickers up inside me. Could this all just be a ruse? For Finnick to win my trust and then swim out and drown Peeta? \"I can,\" I insist.\\n\\n But Finnick has dropped all his weapons to the ground. \"Better not exert yourself. Not in your condition,\" he says, and reaches down and pats my abdomen.\\n\\n Oh, right. I\u0027m supposed to be pregnant, I think. While I\u0027m trying to think what that means and how I should act - maybe throw up or something - Finnick has positioned himself at the edge of the water.\\n\\n \"Cover me,\" he says. He disappears with a flawless dive.\\n\\n I raise my bow, warding off any attackers from the Cornucopia, but no one seems interested in pursuing us.\\n\\n Sure enough, Gloss, Cashmere, Enobaria, and Brutus have gathered, their pack formed already, picking over the weapons. A quick survey of the rest of the arena shows that most of the tributes are still trapped on their plates. Wait, no, there\u0027s someone standing on the spoke to my left, the one opposite Peeta. It\u0027s Mags. But she neither heads for the Cornucopia nor tries to flee. Instead she splashes into the water and starts paddling toward me, her gray head bobbing above the waves. Well, she\u0027s old, but I guess after eighty years of living in District 4 she can keep afloat.\\n\\n Finnick has reached Peeta now and is towing him back, one arm across his chest while the other propels them through the water with easy strokes. Peeta rides along without resisting. I don\u0027t know what Finnick said or did that convinced him to put his life in his hands - showed him the bangle, maybe. Or just the sight of me waiting might have been enough. When they reach the sand, I help haul Peeta up onto dry land.\\n\\n \"Hello, again,\" he says, and gives me a kiss. \"We\u0027ve got allies.\"\\n\\n \"Yes. Just as Haymitch intended,\" I answer. \"Remind me, did we make deals with anyone else?\" Peeta asks.\\n\\n \"Only Mags, I think,\" I say. I nod toward the old woman doggedly making her way toward us.\\n\\n \"Well, I can\u0027t leave Mags behind,\" says Finnick. \"She\u0027s one of the few people who actually likes me.\"\\n\\n \"I\u0027ve got no problem with Mags,\" I say. \"Especially now that I see the arena. Het fishhooks are probably our best chance of getting a meal.\"\\n\\n \"Katniss wanted her on the first day,\" says Peeta.\\n\\n \"Katniss has remarkably good judgment,\" says Finnick. With one hand he reaches into the water and scoops out Mags like she weighs no more than a puppy. She makes some remark that I think includes the word \"bob,\" then pats her belt.\\n\\n \"Look, she\u0027s right. Someone figured it out.\" Finnick points to Beetee. He\u0027s flailing around in the waves but managing to keep his head above water.\\n\\n \"What?\" I say.\\n\\n \"The belts. They\u0027re flotation devices,\" says Finnick. \"I mean, you have to propel yourself, but they\u0027ll keep you from drowning.\"\\n\\n I almost ask Finnick to wait, to get Beetee and Wiress and take them with us, but Beetee\u0027s three spokes over and I can\u0027t even see Wiress. For all I know, Finnick would kill them as quickly as he did the tribute from 5, so instead I suggest we move on. I hand Peeta a bow, a sheath of arrows, and a knife, keeping the rest for myself. But Mags tugs on my sleeve and babbles on until I\u0027ve given the awl to her. Pleased, she clamps the handle between her gums and reaches her arms up to Finnick. He tosses his net over his shoulder, hoists Mags on top of it, grips his tridents in his free hand, and we run away from the Cornucopia.\\n\\n Where the sand ends, woods begin to rise sharply. No, not really woods. At least not the kind I know. Jungle. The foreign, almost obsolete word comes to mind. Something I heard from another Hunger Games or learned from my father. Most of the trees are unfamiliar, with smooth trunks and few branches. The earth is very black and spongy underfoot, often obscured by tangles of vines with colorful blossoms. While the sun\u0027s hot and bright, the air\u0027s warm and heavy with moisture, and I get the feeling I will never really be dry here. The thin blue fabric of my jumpsuit lets the seawater evaporate easily, but it\u0027s already begun to cling to me with sweat.\\n\\n Peeta takes the lead, cutting through the patches of dense vegetation with his long knife. I make Finnick go second because even though he\u0027s the most powerful, he\u0027s got his hands full with Mags. Besides, while he\u0027s a whiz with that trident, it\u0027s a weapon less suited to the jungle than my arrows. It doesn\u0027t take long, between the steep incline and the heat, to become short of breath. Peeta and I have been training intensely, though, and Finnick\u0027s such an amazing physical specimen that even with Mags over his shoulder, we climb rapidly for about a mile before he requests a rest. And then I think it\u0027s more for Mags\u0027s sake than his own.\\n\\n The foliage has hidden the wheel from sight, so I scale a tree with rubbery limbs to get a better view. And then wish that I hadn\u0027t.\\n\\n Around the Cornucopia, the ground appears to be bleeding; the water has purple stains. Bodies lie on the ground and float in the sea, but at this distance, with everyone dressed exactly the same, I can\u0027t tell who lives or dies. All I can tell is that some of the tiny blue figures still battle. Well, what did I think? That the victors\u0027 chain of locked hands last night would result in some sort of universal truce in the arena? No, I never believed that. But I guess I had hoped people might show some ... what? Restraint? Reluctance, at least. Before they jumped right into massacre mode. And you all knew each other, I think. You acted like friends.\\n\\n I have only one real friend in here. And he isn\u0027t from District 4.\\n\\n I let the slight, soupy breeze cool my cheeks while I come to a decision. Despite the bangle, I should just get it over with and shoot Finnick. There\u0027s really no future in this alliance. And he\u0027s too dangerous to let go. Now, when we have this tentative trust, may be my only chance to kill him. I could easily shoot him in the back as we walk. It\u0027s despicable, of course, but will it be any more despicable if I wait? Know him better? Owe him more? No, this is the time. I take one last look at the battling figures, the bloody ground, to harden my resolve, and then slide to the ground.\\n\\n But when I land, I find Finnick\u0027s kept pace with my thoughts. As if he knows what I have seen and how it will have affected me. He has one of his tridents raised in a casually defensive position.\\n\\n \"What\u0027s going on down there, Katniss? Have they all joined hands? Taken a vow of nonviolence? Tossed the weapons in the sea in defiance of the Capitol?\" Finnick asks.\\n\\n \"No,\" I say.\\n\\n \"No,\" Finnick repeats. \"Because whatever happened in the past is in the past. And no one in this arena was a victor by chance.\" He eyes Peeta for a moment. \"Except maybe Peeta.\"\\n\\n Finnick knows then what Haymitch and I know. About Peeta. Being truly, deep-down better than the rest of us. Finnick took out that tribute from 5 without blinking an eye. And how long did I take to turn deadly? I shot to kill when I targeted Enobaria and Gloss and Brutus. Peeta would at least have attempted negotiations first. Seen if some wider alliance was possible. But to what end? Finnick\u0027s right. I\u0027m right. The people in this arena weren\u0027t crowned for their compassion.\\n\\n I hold his gaze, weighing his speed against my own. The time it will take to send an arrow through his brain versus the time his trident will reach my body. I can see him, waiting for me to make the first move. Calculating if he should block first or go directly for an attack. I can feel we\u0027ve both about worked it out when Peeta steps deliberately between us.\\n\\n \"So how many are dead?\" he asks.\\n\\n Move, you idiot, I think. But he remains planted firmly between us.\\n\\n \"Hard to say,\" I answer. \"At least six, I think. And they\u0027re still fighting.\"\\n\\n \"Let\u0027s keep moving. We need water,\" he says.\\n\\n So far there\u0027s been no sign of a freshwater stream or pond, and the saltwater\u0027s undrinkable. Again, I think of the last Games, where I nearly died of dehydration.\\n\\n \"Better find some soon,\" says Finnick. \"We need to be undercover when the others come hunting us tonight.\"\\n\\n We. Us. Hunting. All right, maybe killing Finnick would be a little premature. He\u0027s been helpful so far. He does have Haymitch\u0027s stamp of approval. And who knows what the night will hold? If worse comes to worst, I can always kill him in his sleep. So I let the moment pass. And so does Finnick.\\n\\n The absence of water intensifies my thirst. I keep a sharp eye out as we continue our trek upward, but with no luck. After about another mile, I can see an end to the tree line and assume we\u0027re reaching the crest of the hill. \"Maybe we\u0027ll have better luck on the other side. Find a spring or something.\"\\n\\n But there is no other side. I know this before anyone else, even though I am farthest from the top. My eyes catch on a funny, rippling square hanging like a warped pane of glass in the air. At first I think it\u0027s the glare from the sun or the heat shimmering up off the ground. But it\u0027s fixed in space, not shifting when I move. And that\u0027s when I connect the square with Wiress and Beetee in the Training Center and realize what lies before us. My warning cry is just reaching my lips when Peeta\u0027s knife swings out to slash away some vines.\\n\\n There\u0027s a sharp zapping sound. For an instant, the trees are gone and I see open space over a short stretch of bare earth. Then Peeta\u0027s flung back from the force field, bringing Finnick and Mags to the ground.\\n\\n I rush over to where he lies, motionless in a web of vines. \"Peeta?\" There\u0027s a faint smell of singed hair. I call his name again, giving him a little shake, but he\u0027s unresponsive. My fingers fumble across his lips, where there\u0027s no warm breath although moments ago he was panting. I press my ear against his chest, to the spot where I always rest my head, where I know I will hear the strong and steady beat of his heart.\\n\\n Instead, I find silence. \\n\\n","sourceLink":"https://allnovel.net/catching-fire-the-hunger-games-2/page-19.html","bookId":1686,"book":{"id":1686,"title":"Catching Fire (The Hunger Games #2)","description":"Storyline: Catching Fire (The Hunger Games #2) \\n Sparks are igniting. \\n Flames are spreading. \\n And the Capitol wants revenge. \\n Against all odds, Katniss has won the Hunger Games. She and fellow District 12 tribute Peeta Mellark are miraculously still alive. Katniss should be relieved, happy even. After all, she has returned to her family and her longtime friend, Gale. Yet nothing is the way Katniss wishes it to be. Gale holds her at an icy distance. Peeta has turned his back on her completely. And there are whispers of a rebellion against the Capitol - a rebellion that Katniss and Peeta may have helped create. \\n Much to her shock, Katniss has fueled an unrest she\u0027s afraid she cannot stop. And what scares her even more is that she\u0027s not entirely convinced she should try. As time draws near for Katniss and Peeta to visit the districts on the Capitol\u0027s cruel Victory Tour, the stakes are higher than ever. If they can\u0027t prove, without a shadow of a doubt, that they are lost in their love for each other, the consequences will be horrifying. \\n In Catching Fire, the second novel in the Hunger Games trilogy, Suzanne Collins continues the story of Katniss Everdeen, testing her more than ever before...and surprising readers at every turn.\\n","cover":"https://allnovel.net/images/catching-fire-the-hunger-games-2.jpg","author":"Suzanne Collins","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/catching-fire-the-hunger-games-2.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:52:26 AM"}}
