{"id":105349,"no":1,"title":"Page 1","content":"Chapter 1\n It wasn’t a cell exactly. Not in the usual sense of the word. When one speaks of a prison cell, one implies rather a sort of room in a sort of building, with perhaps a barred door and window. A stone or cement floor. A cot, a dangling light bulb, a pot of some sort in which various bodily functions may be performed.\n I had been in such a cell once, in Istanbul. I hadn’t liked it much, but at least it was a genuine and proper prison cell.\n Not like my current home. Not like this idiot contrivance in which I was presently trapped, a rude box eight feet square and four feet high, constructed entirely of bamboo, and suspended from the limb of a tall tree, with its bottom about five feet from the ground.\n You couldn’t call it a cell, then. What you could call it, if you were inclined to call it anything, was a large birdcage. And it was the only sort of birdcage to be found for miles around. Birds are not caged in dense teak forests far in the north of Thailand. There are plenty of birds to be found, bright of plumage and swift of flight and shrill of voice, screeching hellishly in the tops of tall trees. Such birds are not overly fond of captivity.\n But, then, neither was I.\n I had been in the cage ever since the guerrilla patrol captured me four days previously. It was almost impossible to believe that only four days had passed, but one must rely on the evidence of one’s senses; the sun had risen and set four times, and that had to have some significance.\n But I had never lived through longer days. The endless quality of those hours was in part a function of the particular design of my bamboo cage, which seemed to have been devised as a special form of Oriental torture. One could not stand up. One could crouch, and there was barely enough headroom to sort of crawl around, but crawling didn’t really work. A single rope fastened to the center of the cage’s top was all that connected my cage to a tree limb far overhead. Thus, if one moved from the very middle of the cage, the thing tilted – at which point one was unceremoniously pitched forward to the juncture of floor and wall.\n Even if this had not been so, there was little enough reason to move from one part of the cage to the next, since one section of it was very much like another. True, I could just manage to peer through the bamboo sides at the guerrilla encampment surrounding me. I did this, at one time or another, from every side of the cage. I saw, at one time or another, any number of huts, cooking fires, rifles, machetes, sharpened stakes, and Siamese guerrillas. I saw various articles of my clothing – I was quite naked in my cage, like a bird plucked free of feathers – being worn by various guerrillas. I saw nothing, however, that was sufficiently deserving of a second glance to tempt me to risk leaving the point of balance in the center of the cage.\n There was a small hole in the center of the floor, a small square hole cleverly cut into the bamboo flooring, through which a bowl of wormy rice was passed to me twice a day if they remembered and less frequently if they did not. Now and then someone would also pass me a cup of greasy water, and now and then I would void whatever had to be voided through the same aperture. One would have thought that with so little food and water coming into the cage, a correspondingly small quantity of matter would have to leave it. But there must have been something corrupt in either the rice or the water or both, some sociable amoebas bent on causing amoebic dysentery. Around the middle of the third day I began to worry that, eating so little and voiding so much, I was in danger of disappearing entirely or of turning myself inside out. But by the fourth day the dysentery went away; I guess I had starved it to death.\n I couldn’t stand up, I couldn’t walk around, I couldn’t rest, I couldn’t eat properly. I stayed in one spot, now squatting on my haunches, now stretched out on my back, now with my legs knotted into the Yoga lotus posture. I grew increasingly hot, hungry, bored, and uncomfortable with the passage of time. At the beginning I had been afraid they would kill me. Now I was beginning to fear that they wouldn’t.\n It might not have been so bad if I could have slept. But when I was eighteen years old, a piece of North Korean shrapnel had been rudely deposited in my brain, and in the course of this, something called my sleep center had been destroyed. Medical science is not entirely certain what the sleep center is or what it does. Mine isn’t, and whatever it once did, it no longer does; consequently I have not slept in seventeen years.\n All in all, I’ve found this more an advantage than not. In addition to bringing me a $112 government disability check every month, my insomnia leaves me with that many more hours per day to get things done, obviates the necessity for hotel rooms while traveling, and otherwise enhances life.\n But sleep, in addition to being sore labor’s bath, healer of life’s wounds, the death of each day’s life, and all the other things Macbeth called it, is also a handy time-waster to ease one through stretches of excruciating boredom. My trek through the jungle had been sufficiently exhausting to tire me considerably, and but for that shred of shrapnel, I would probably have spent half my caged hours in blissful unconsciousness.\n Instead I stayed awake.\n I have never had so little to do. During the first day I tried to attract attention by making noise. I called out now and then in Siamese, which I speak moderately well, and in Khmer, which I don’t. No one ever went so far as to answer me, but I found that whenever I made any noise, someone came over and raised one side of the cage, thus sending me sprawling over to the other side. After each utterance of mine, regardless of pitch or language or content, had been similarly rewarded, I learned my lesson. I stopped talking.\n And no one talked to me. My silence was met by silence, with no interrogation whatsoever. I had decided at first to try convincing them that I was not an American agent named Evan Michael Tanner and then I decided to convince them that I was. Both of these decisions were quite irrelevant. No one asked me anything, not name or rank or serial number, nothing at all. I stayed where I was and waited for something to happen, but it didn’t.\n I don’t know what I was waiting for anyway. Divine intercession perhaps. A bolt of lightning could strike the tree, thus causing my cage to drop to the ground and shatter itself apart. The encampment could be raided by troops loyal to His Majesty’s Government. Or by the Marines. Or the U.S. Horse Cavalry. Most of the time, though, I tried to avoid thinking about what it was that I awaited. Since there was nothing to do in the cage and no way to get out of the cage and no escape route if I did get out, waiting was almost an end in itself; I didn’t have to wait for anything.\n Until late one afternoon someone finally spoke to me. A hand poked a rice bowl through the central hole in the bottom of the cage. I snatched the bowl rather greedily – they had, by accident or on purpose, missed my morning feeding. I wolfed down the rice, worms and all. This sounds even worse than it was; after you’ve done it once or twice, worms cease to turn your stomach, and protein, after all, is protein. I sent the bowl back empty, received a cup of tepid water in return, drank the water, returned the cup, and a soft, sad voice said, “Tomorrow.”\n Or perhaps the voice said, “Morning.” Siamese, like so many other languages, makes no distinction between the two concepts. Whether my new friend meant tomorrow generally or tomorrow morning in particular was indeterminable from the single word spoken.\n So I said, “Tomorrow?” Or “Morning?” In any case I repeated the word he had said.\n “Upon the rising of the sun.” Well, that cleared things up.\n “What will happen then?”\n “Upon the rising of the sun,” he said mournfully, “they will kill you.”\n His words filled me with hope.\n Not, let me add, because I thought he was right and hoped for death as a respite from life in a cage. Uncomfortable as my bamboo home might be, the alternative he proposed seemed even less desirable. The cause for hope stemmed not from the information I had received but from the way the message had been couched. It was not what he said but how he said it.\n Consider: not We will kill you but They will kill you. Thus implicitly disassociating himself from any personal involvement in the act, either active or passive. And his tone of voice accentuated this – they were going to kill me, and he was sad about it. It even seemed likely that he had violated orders by giving me this bit of news.\n “They will kill you at sunrise,” he said again.\n I had been sitting in the lotus posture, legs folded up so that each foot rested on top of the opposite knee. I unknotted my legs, stretched out, rolled over onto my stomach, and put my mouth to the aperture in the cage bottom. The cage tilted slightly, but I remained fairly well balanced, physically if not emotionally. And I was able to see my informant clearly in the twilight. He was in his late teens, short and slender, with neatly cropped glossy black hair, and the clean, doll-like features prevalent throughout that part of the world.\n “There was talk of getting you a woman,” he went on mournfully. “Usually when a man is condemned to die, he is first given a woman. It is the custom. Formerly it was done only for men who had fathered no children of their own, so that they might have a final opportunity to perpetuate their seed. But then it was said that no man can ever be certain that he has sired children, and so it was decided that every condemned man should spend the night before his execution with a woman.”\n Imminent death is supposed to have an aphrodisiacal effect. It certainly didn’t this time. I didn’t want a woman. I didn’t even want a good meal or a glass of whiskey. All I really wanted was to get the hell out of the cage.\n “But,” he continued, “there will not be a woman for you. It was decided that you are a capitalist imperialist dog and a white devil, and that your seed must not be mingled with the love juices of our women. It is what they decided.”\n They again. I started to say how good it was of him to tell me, but he was not interested in such pap. He had more important things on his mind, and I was in every sense a captive audience.\n “I have never had a woman,” he said.\n “Never?”\n “Never in all my days. I have, however, spent many hours thinking about such a thing.”\n “I can imagine.”\n “I look at the women,” he said dreamily. “I watch them walking, you know, the shapes of their bodies, the legs, the tilt of their heads, the tinkling sounds of their voices. Like little brass bells. I think about them a great deal.” He fell momentarily silent, perhaps to think about them some more. His brown eyes were very large, and beads of sweat formed on his smooth forehead. “There are times,” he said suddenly, “when I can honestly think of nothing else.”\n “And you have never had one.”\n “Never.”\n I felt like the Playboy Advisor. “Well, why don’t you, uh, go and get one?”\n “How?”\n “Well-”\n “Women do not like me,” he said. “And when I am near one of them, I become nervous, my hands sweat, and my mouth goes dry, a dryness in the back of my mouth and in my throat, and words die in my mouth like fish flapping themselves to death upon the shore, and my knees turn to water, and my head spins…” \n","sourceLink":"https://allnovel.net/two-for-tanner-evan-tanner-4/page-1.html","bookId":1533,"book":{"id":1533,"title":"Two For Tanner (Evan Tanner #4)","description":"Storyline: \n Two For Tanner (Evan Tanner #4) \n Evan Tanner can\u0027t sleep. Ever. Which gives him plenty of free time to get involved in lots of interesting endeavors in all sorts of exotic locales. \n Now Tanner\u0027s in Thailand with a partially baked plan and a butterfly net, hoping to snare a beautiful missing chanteuse who\u0027s metamorphosed into an international jewel thief. Tanner hopes everyone will buy his disguise as a rare butterfly researcher. And everyone does . . . \n Except the guerilla band holding him captive. They intend to remove his head when the sun rises, so Tanner must put his fate in the hands of a randy Thai youth who will do anything for a woman, even set a suspected spy free. Soon they\u0027re running through the jungle together, chased by bandits, soldiers, and yellow fever, and racing headlong into the heart of darkness—and into the flames of war.\n \n","cover":"https://allnovel.net/images/two-for-tanner-evan-tanner-4.jpg","author":"Lawrence Block","type":"Adventure","source":"allnovel","link":"https://allnovel.net/two-for-tanner-evan-tanner-4.html","creation":"Oct 5, 2019 8:57:41 AM","modification":"Oct 5, 2019 10:45:31 PM"}}
