{"id":42000,"no":35,"title":"Chapter 6","content":"But the fates had decided to honour Tom’s mother above his sweetheart in that it was she alone who bore the full grief of his wounding. On her way to the shop, Ivy met Thyrza engaged in something as near a run as her plump person was capable of, and waving in her hand a letter. It was a pencil-scrawl written in hospital [130] at Boulogne, telling Thyrza not to vrother, because he was doing valiant. He had got a Blighty one and hoped to be sent home soon. It was nothing serious, only a bit of shrap in his foot. “Didn’t I tell mother as it was no more’n a piece off his big toe?” cried Ivy triumphantly. \n \n The letter had been Thyrza’s first news of Tom’s wound, and all the anxiety and yearning she felt were swallowed up in the joy of his coming home. A few days later she had a telegram from him, telling of his arrival in hospital at Eastbourne, and by this time Mrs. Beatup had recovered sufficiently to resent the fact that it had been sent to Thyrza and not to her. \n \n Everyone was glad that Tom was at Eastbourne, as it could be reached from Sunday Street in a few hours by carrier’s cart and train. The very next morning Mrs. Beatup and Mrs. Honey set out together, the latter with a basket of eggs and flowers, and her pockets bulging with Player’s cigarettes, the former nursing a weighty dough-cake, beloved of Tom in ancient times, and so baked that she fondly hoped he would never notice the nearly total absence of sugar and plums. Thyrza looked very unlike herself in a close-fitting blue jersey and knitted cap; Mrs. Beatup wore what she called her Sunday cape, which is to say the cape she would have worn on Sundays if she had ever had the leisure to go out, likewise her Sunday bonnet (similarly conditioned), made of black straw and bearing a good crop of wheat. \n \n The two women went by carrier’s cart to Hailsham, where they took the train, arriving at Eastbourne soon after one. They went first to a creamery, where they rather hesitatingly ordered poached eggs and a pot of tea. The eggs were stale and the tea had not that “body” which their custom required. Mrs. Beatup began to wonder what Tom was getting to eat—if this [131] was what you got when you paid for it, what did you get when you didn’t pay for it? she’d like to know. \n \n She was a little relieved at the sight of Tom, looking much fatter and browner and better in hospital than she had ever seen him outside it. He looked happy, too, with his broad face all grins to see them, his mother and sweetheart. And since he looked so brown and well and happy, she wondered why it was that she wanted so much to cry. \n \n Thyrza did not want to cry. She held Tom’s hand, and laughed, and was quite talkative, for her. She made him tell her over and over again how he had been wounded, and how they had taken him to the base hospital and then to Boulogne, and then in a hospital ship all signed with the cross to Blighty. Mrs. Beatup made up her mind that next time she would come alone. \n \n And so she did—much to the surprise of her family, who had hitherto found her full of qualms and fears even at the thought of a visit to Senlac. \n \n “I mun have my boy to myself whiles I’ve got the chance,” she said. \n \n “Well,” remarked Ivy tactlessly, “I reckon he’d sooner have you separate—he’ll be wanting Thyrza aloan a bit.” \n \n “Will he, miss? That aun’t why I’m going different days. We aun’t all lik you wud your kissings and loverings. I wish to goodness you’d git married and have done.” \n \n “And taake some poor boy away from his mother,” mocked Ivy. “I wouldn’t be so cruel.” \n \n Her mother made a swoop at her with her open hand, but Ivy dodged, and ran off, laughing good-naturedly. \n \n None of the other Beatups ever went to see Tom at Eastbourne. The journey was too expensive, and they were sure to have him home on leave before long. Mrs. Beatup went about twice a week, with various messages [132] from the rest of the family muddled up in her head. She would sit beside him, holding his hand, strangely delicate with sickness, between her own hard, cracked, work-weary ones, wishing that they could find more to say to each other, and at the same time cherishing those numbered moments when she could have him to herself. Thyrza went oftener, shutting up shop with a recklessness that would have ruined a less personal business. Tom’s only other visitor was the Reverend Mr. Sumption. \n \n He came one afternoon to inquire about Jerry, but Tom could not tell him much. Jerry kept away from him, and the little that Beatup knew of his doings he was anxious to conceal from his father. \n \n “Maybe now he’s out there he’ll get on better,” he suggested. \n \n “Better? He’s always done well,” said Mr. Sumption loftily. “He’ll have to do unaccountable well if he does better. Don’t think, Tom, that I came to you because I doubted my son, but he was never much of a letter-writer, and now, being busy and all....” \n \n That night Tom lay awake an hour or so, thinking of parents. It was queer how they stuck to their children. His mother, now, coming all this way to see him, though she was nervous of the journey and had very little money to spend on it.... Mr. Sumption, too, standing up for that lousy tyke of a Jerry.... Would he ever feel like this for one of his own flesh—not only when that one lay helpless and dependent on him, but had gone out from him and chosen his own path? “Even as a father pitieth his children ...” so the Bible said, and seemingly there was no bound or end to that pity. Perhaps one day he would feel it in his own heart (the curve of Thyrza’s arms made him think of a cradle). He remembered what Mr. Sumption had said to him long ago, the night before [133] he joined up—“You’ll understand a bit of what I feel ... some day when you’re the father of a son.” \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1952/55923.html","bookId":752,"book":{"id":752,"title":"The Four Roads","description":"简介： FOUR roads in Sussex mark out a patch of country that from the wooded, sea-viewing hills behind Dallington slips down over fields and ponds and spinneys to the marshes of Hailsham and Horse Eye. The North Road, slatting the heights with its pale, har...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1952","creation":"Aug 1, 2019 12:19:15 AM","modification":"Aug 1, 2019 12:19:15 AM"}}
