{"id":42025,"no":60,"title":"Chapter 5","content":"Nell had to stop away from school till the end of the term, for Mrs. Beatup could not possibly nurse her husband without help; indeed, Nell’s help was often not enough. A broken leg in itself was serious damage for a man of Mus’ Beatup’s age and habits, and into the bargain his alcoholic deprivations brought on an attack of delirium tremens about the fifth day of his illness. For this both Nell and her mother were inadequate—Nell was sickened and terrified by this horrible travesty of a human being that shook the springs in her father’s bed, and Mrs. Beatup made him worse by trying to argue with him and taking as a personal affront his assertions as to the maggoty condition of the pillows. Harry had to spend two days away from the fields in the combined office of nurse and policeman, and on one occasion when even his strength was not enough to keep Mus’ Beatup in bed, Kadwell of Stilliands Tower prolonged an evening’s call of enquiry till the next morning. \\n\\n \\n\\n Young Kadwell often called to enquire, and made himself useful in various ways. He was on a fortnight’s sick-leave, after an outbreak of his old wound. He had been sniped during some patrol work at Loos in 1915, [224] and though once more fit for service had been kept in England ever since. At present he was quartered at Eastbourne, but expected soon to be sent back to France. \\n\\n \\n\\n At first Nell was too harassed and miserable to realise that his visits were largely on her account. Moreover, she was sexually very humble—she had loved so long without return that she had never learned to look for advances. But Kadwell had no reason to hide his feelings, nor any skill if he had had reason, so in time Nell was bound to become aware of them. The discovery did not give her any great pleasure—the faint pride she occasionally felt at his notice was always dangerously on the edge of disgust. She was sensitive throughout her being to his coarseness—which at the same time had curious, intermittent powers of attraction—and there was something in his bold, appraising look which struck her with shame; with his tastes, thoughts and appetites she had nothing in common. She avoided him as much as she could, feeling guilty because of the faint thrills which occasionally mixed with her dislike. \\n\\n \\n\\n It was a sad year’s ending. Her confinement in the house dragged down even further her health and spirits, her father’s sick-bed filled her with wretchedness and shame. It seemed to preach to her the lesson of what she really was, in spite of all her dreams. How had she ever dared to plot for the greatness of the curate’s love? Who was she to mate with a priest, a scholar, a gentleman? The sordid grind of her day, shut up in the muddle of Worge, her hours in that sag-roofed, stuffy bedroom, nursing her father through the trivialities and degradations of an illness brought on and intensified by drink—and then the crowning irony of an occasional “parish visit” from her loved one, his polite enquiries, his parsonic sympathy—all seemed to shout at [225] her that she was nothing but a common girl, not only of humble but of shameful heritage, an obscure, half-educated nobody, who was now bearing the punishment of her presumptuous hopes. \\n\\n \\n\\n She gave up her Sunday-school class, making her father’s illness an excuse; she also gave up going to church. This was partly due to lack of time, partly to a dread of the empty shell. She told herself bitterly that her religion had never been real—it had only been part of the mirage—she might as well give up the pretence of it. Besides, she could not bear to look any more on the background of her vanished dreams, the soft colours and lights against which they had glowed, to hear the sighing tones which had set them to music in her heart. \\n\\n \\n\\n One Sunday evening, when she had gone out to stretch her cramped legs, she heard the sound of singing come from the Bethel. She had never been inside except for Tom’s marriage, but now in a sudden softening of her heart she thought she would go in. She opened the door, and slid into an empty pew—of which there was a big choice. Mr. Sumption stood swaying and heating time in the pulpit, while before him his mean congregation of Bourners and Hubbles sang— \\n\\n \\n\\n “Let Christian faith and hope dispel \\n\\n The signs of guilt and woe” ... \\n\\n \\n\\n The air was heavy with the smell of lamp oil and Sunday clothes and the rot of the plaster walls. Nell sat, a little timid, in the corner of her pew. The scene was strange and grotesque to her, yet rather kindly. She thought Mr. Sumption looked ill and worn. She was shocked at his haggard smile, at the unhealthy smouldering of his eyes.... All Sunday Street knew that he was in trouble again about Jerry, who had not written for two months; but the village had come to [226] look upon it as Mr. Sumption’s natural state to be in trouble about his son, and Nell felt there must be something worse than usual to account for his altered looks. Her own sadness made her soft and gentle towards him, and she watched him with pitying eyes. \\n\\n \\n\\n The service ended, and Mr. Sumption came down to the chapel door, where he waited to shake hands with his departing congregation. Nell, with her ignorance of chapel ritual, had not expected this, and was a little flustered by it. Now he must inevitably know of her presence, which she had not meant. But there was no help for it, so she held out her hand in her gentle, well-bred manner as she passed him in the doorway. He gave a start of surprise. \\n\\n \\n\\n “I never expected to see you here,” he said. \\n\\n \\n\\n “I was passing ... and I thought the music sounded pretty ... so I came in,” faltered Nell. \\n\\n \\n\\n “Yes—the music’s pretty,” he said absently, and she thought his voice sounded hoarse as if from a recent cold. Then her eyes met his, and each seemed to read the other’s pain. Drawn together by a mystic community of suffering, they stood for a moment in silence, still holding hands. She felt his grip tighten on hers, and her throat suddenly swelled with tears. They blinded her as she went out into the dusk. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1952/55948.html","bookId":752,"book":{"id":752,"title":"The Four Roads","description":"简介： FOUR roads in Sussex mark out a patch of country that from the wooded, sea-viewing hills behind Dallington slips down over fields and ponds and spinneys to the marshes of Hailsham and Horse Eye. The North Road, slatting the heights with its pale, har...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1952","creation":"Aug 1, 2019 12:19:15 AM","modification":"Aug 1, 2019 12:19:15 AM"}}
