{"id":42031,"no":66,"title":"Chapter 3","content":"“I must go and see Mus’ Sumption,” said Tom to Thyrza. He said it several times before he went, for the days swam in a golden fog over his home, shutting him into enchanted ground. It was hard to break out of it even to go to Worge, and he found himself shelving the thought of leaving for two hours of worse company the little garden where the daffodils followed the crocuses, [247] the shop all stuffy with the smell of tea and candles, the bluish-whiteness of the little sag-roofed rooms, and his wife and child, who were not so much figures in the frame of it all as an essence, a sunshine soaking through it.... However, Thyrza kept him to his word. “I’m tedious sorry fur Mus’ Sumption—he looks that worn and wild. Maybe you cud give him news of Jerry.” “No good news.” “Well, go up and have a chat wud the pore soul. Reckon he’ll be mighty glad to see you, and you’re sure to think of summat comforting to say.” So Tom went, one evening after tea. He found the minister in his faded threadbare room at the Horselunges, writing the letter which every week he dropped into the post-box at Brownbread Street, and generally heard no more of. The evening sun poured angrily on his stooped grey head, and made the room warm and stuffy without the expense of a fire. The old, old cat sat sulkily before the empty grate, and the white mice tapped with little pink hands on the glass front of their cage. The thrush had been dead some months. “Hello, Tom. This is kind of you, lad,” and Mr. Sumption sprang up in hearty welcome, shaking Tom by the hand, and actually tipping the cat out of the armchair so that his visitor might be comfortably seated. Tom sat down and pulled out his pipe, and for some minutes they edged and skated about on general topics. Then the minister asked suddenly— “And how did you leave Jerry?” “Valiant”—certainly Jeremiah Meridian Sumption was a hardy, healthy little beggar. But Mr. Sumption was not deceived. [248] “Valiant in body, maybe. But, Tom, I fear for his immortal soul.” Tom did not know wat to say. He had never before seen the minister without his glorious pretence of faith in his son. “It’s strange,” continued Mr. Sumption, “but from his birth that boy was seemingly marked out by Satan. Maybe it was the bad blood of the Rossarmescroes or Hearns; his mother was the sweetest, loveliest soul that ever slept under a bush; but there’s no denying that the Hearns’ blood is bad blood—roving, thieving, lusting, Satanic blood—and he’s got it in him, has my boy, more than he’s got the decent blood of my fathers.” “Has he written to you lately?” “Oh, he writes now and again. He’s fond of me. But he doesn’t sound happy. Then Bill Putland, when he came home to get married, he told me——” There was silence, and Tom fidgeted. “He told me as Jerry had got hold of a French girl in one of the towns—a bad lot, seemingly.” “He’ll get over it,” said Tom. “Reckon he can’t have much love fur such a critter.” “You knew of it too, then?” “Oh, we’ve all heard. He got First Field Punishment on her account, fur——” “Go on.” “Thur’s naun to say. I guess she’s bad all through. Some of these girls, they’re bits of stuff as you might say, but they’d never kip a man off his duty or git him into trouble on their account. Howsumdever, the wuss she is the sooner he’s lik to git shut of her.” Mr. Sumption groaned. “If only he could have married your sister Ivy!” [249] “Ivy aun’t to blame.” “No—she’s not. I mustn’t be unjust. She treated him fair and square all through; he says it himself. But, Tom, it’s terrible to think that one human creature’s got the power to give another to Satan, and no blame attached to either.” “Maybe Jerry wur Satan’s before he wur Ivy’s,” said Tom sharply; then felt ashamed as he met the minister’s eyes with their tortured glow. “Maybe you’re right. This is Satan’s hour. He’s got us all for a season, and this War is his last kick before the Angel of the Lord chains him down in the lake which burneth with fire and brimstone. These are the days of which the Scripture saith, that unless the Lord should shorten them for the Elect’s sake, no man could be saved.” “I guess we’ve nearly done the Lord’s job. The perishers are even more fed up than us, which is putting it strong. Let ’em start this Big Push of theirn as thur’s bin such a talk about. Doan’t you vrother about Jerry, Mus’ Sumption—he’ll be shut of this girl before long, and you’ll git him back here and wed him to a good soul as ull do better fur him than Ivy.” Mr. Sumption shook his head. “This is the war which shall end the world.” “Reckon I aun’t going out there, away from my wife and child and home, all among the whizz-bangs and the coal-boxes, and git all over mud and lice, jest to help on the end of the world. This world’s good enough fur me, and I hope it’ll go on a bit longer after peace is signed, so as I’ll git a chance of enjoying it.” “And they shall reign with Him a thousand years.” Tom was a little weary of Mr. Sumption in this mood; however, he felt sorry for him, and let him run on. “You must be blind indeed,” continued the minister, [250] “if you don’t see how the Scriptures have been fulfilled—nation against nation and kingdom against kingdom, and the Holy City given back to the Jews, and the sun turned to darkness with the clouds of poisoned gas, and the moon to blood ... the blood of the poor souls that are killed in moonlight air-raids....” Tom knocked out his pipe. “Then at last”—and the minister’s eye kindled and his whole sunburnt face glowed with the mixed fires of hope and fanaticism—“the sign of the Son of Man shall appear in the heavens, and He shall come again in power and great glory. Even so, come, Lord Jesus—but come before our hearts are all broken. What’s the use of chaining up the Dragon in the Lake if he’s already devoured the world? Shorten these days, for the Elect’s sake—save us from the burning, fiery furnace which is making frizzle of our bones and cinders of our hearts.” He suddenly dropped his head between his hands. Tom felt a bit upset. He had again and again heard all this in chapel, but it was embarrassing and rather alarming to have it coming from the next chair. “Reckon you mind this War more’n I do,” he remarked lamely. “Because to you it is just war—while to me it’s Judgment. This is the day of which the Prophet spoke, the day that shall burn as an oven, and our sons and daughters shall burn as tow.... Bless you, young chap! there have been other wars—the country’s full of their dead names ... there were two lakes of blood up at Senlac.... But this war, it’s the End, it’s Doomsday. Now it shall be proved indeed that Christ died for the Elect, for all save the Elect shall perish. Tom, I have a terrible fear that I shall have to stand by and see my boy perish.” “Oh, he’ll pull through right enough—give him his head and he’ll come to his senses afore long.” “I’m afraid not.” Mr. Sumption rose and began walking up and down the room, his hands clasped behind [251] him. The dipping sun poured over his burly figure, showing up in its beautiful merciless beam the seediness of his coat and the worn hollows and graven lines of his face. “I’m afraid not, Tom Beatup. I’m afraid I’ll have to stand by and see my boy damned. I’ll stand among the sheep and see him among the goats. There’s no good trying to job myself into thinking he’s one of the Elect—he knows he isn’t, and I know it. Whereas I have Assurance—I’ve had it a dunnamany years. Between us two there is a great gulf fixed. I’ll have to dwell for ever in Mount Sion, in the general assembly and church of the firstborn, and see him for ever across the gulf, in hell.” “Then reckon you’ll be in hell yourself.” “It seems like it. But the ways of the Lord are past finding out.... And I would willingly give my soul for Jerry’s—the soul the Lord has damned from the womb....” Tom stood up. He felt he could not stand any more of this. “Seemingly your religion aun’t much of a comfort to you.... Well, I must be going now.” “You’ll come again?” “Reckon I will, if you’re lonesome.” “And look here, Tom; you won’t say a word to other folk of what I’ve spoken—about Jerry, I mean. It ud never do if the parish came to think that he was getting into bad ways.” “I’ll say naun—trust me. Reckon Jerry’s middling lucky to have you stick by him as you do.” “Jerry once said he sometimes felt as if there was only me between him and hell. Seemingly I’m the only friend he’s got.” Tom felt very sorry for Mr. Sumption. He told Thyrza that he thought he must be getting queer with [252] his troubles, and Thyrza immediately planned to take the baby to see him; and a day or two later they asked him down to the shop for the afternoon, and had the pleasure of seeing him momentarily forget his troubles in a good tea. “Reckon the poor soul thinks a lot of his inside,” said Thyrza, “and doan’t always git enough to fill it with.”","sourceLink":"http://novel.tingroom.com/jingdian/1952/55954.html","bookId":752,"book":{"id":752,"title":"The Four Roads","description":"简介： FOUR roads in Sussex mark out a patch of country that from the wooded, sea-viewing hills behind Dallington slips down over fields and ponds and spinneys to the marshes of Hailsham and Horse Eye. The North Road, slatting the heights with its pale, har...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1952","creation":"Aug 1, 2019 12:19:15 AM","modification":"Aug 1, 2019 12:19:15 AM"}}
