{"id":42041,"no":76,"title":"Chapter 6","content":"It was nearly half an hour later that Mr. Sumption picked up Archie Lamb’s letter. It caught his eye at last as he stared at the floor, and he picked it up and unfolded it. Perhaps it would give him a grain of comfort. \n \n The lieutenant afterwards described it as the most sickening job he had ever had in his life. The usual letter of condolence and explanation, such as he had over and over again written to parents and wives, became an easy task compared with this. Here he had to deal not only with sorrow, but with disgrace. He could not write, as he had so often written, “We are proud of him.” He could not refer back with congratulations to a good record—Jerry had died as he had lived, a bad soldier, a disgrace to the uniform he wore, and there seemed very little that could be decently said about him. \n \n However, the innate kind-heartedness and good feeling of the young officer pulled him successfully through an ordeal that would have staggered many better wits. He [284] began by explaining his reluctance, and that he was writing only because Jerry wished it—though, perhaps, it was better, after all, that his father should know the truth. “As a matter of fact, it is not so dreadful as it sounds. Your son is not to die so much as a punishment as a warning. The shooting of deserters is chiefly a deterrent—and your son is dying so that other men may be warned by his fate to stick to the ranks and do their duty as soldiers; therefore you may say that, indirectly, he is dying for his country. Moreover, his disappearance was not due to cowardice, but to other reasons which you probably know of. I don’t know if this mitigates it to you, it certainly does to me. Sumption is not a coward. I have seen him in action, and I repeat that he is as plucky as any one. \n \n “I am sitting with him now, and I want to make your mind easy about the end. When I have finished writing this he will be given his supper, food and a hot drink. Then he will go to sleep. He will be roused just ten minutes before the time, and hurried off, still half-asleep—he will never be quite awake. There will be no awful apprehension and agony, such as I expect you imagine—please don’t worry about that. \n \n “I have not been able to get him a padre of his own church, but a very good Congregational man has been with him, and has, of course, respected your convictions in every way. \n \n “Now before I end up, I want to say again that it isn’t really as bad as it looks—the disgrace, I mean. Think of your son as having died so that other men should take warning by him and not desert the ranks, and therefore, in that sense he has died for his country.” \n \n Then Archie Lamb asked Mr. Sumption to write to him if there was anything more he wanted to know, and said that he would forward Jerry’s purse and ring at the [285] first opportunity. After the signature was added: “It is all over now, and happened as I told you. He was still half asleep, and suffered practically nothing.” \n \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1952/55964.html","bookId":752,"book":{"id":752,"title":"The Four Roads","description":"简介： FOUR roads in Sussex mark out a patch of country that from the wooded, sea-viewing hills behind Dallington slips down over fields and ponds and spinneys to the marshes of Hailsham and Horse Eye. The North Road, slatting the heights with its pale, har...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1952","creation":"Aug 1, 2019 12:19:15 AM","modification":"Aug 1, 2019 12:19:15 AM"}}
