{"id":15994,"no":18,"title":"Volume ii. Chapter 1 “Shall I tell you the Secret?”","content":"For the rest of the way Violet walked with Mrs. Scobel, and at the garden-gate of the Vicarage Roderick Vawdrey wished them both good-night, and tramped off, with his basket on his back and his rod on his shoulder, for the long walk to Briarwood. \n \n Here the children separated, and ran off to their scattered homes, dropping grateful bob-curtsies to the last —“louting,” as they called it in their Forest dialect. \n \n “You must come in and have some tea, Violet,” said Mrs. Scobel. “You must be very tired.” \n \n “I am rather tired; but I think it’s too late for tea. I had better get home at once.” \n \n “Ignatius shall see you home, my dear,” cried Mrs. Scobel. At which the indefatigable Vicar, who had shouted himself hoarse in leading his choir, protested himself delighted to escort Miss Tempest. \n \n The church clock struck ten as they went along the narrow forest-path between Beechdale and the Abbey House. \n \n “Oh,” cried Vixen, “I do hope mamma’s people will have gone home.” \n \n A carriage rolled past them as they came out into the road. \n \n “That’s Mrs. Carteret’s landau,” said Vixen. “I breathe more freely. And there goes Mrs. Horwood’s brougham; so I suppose everything is over. How nice it is when one’s friends are so unanimous in their leave-taking.” \n \n “I shall try to remember that the next time I dine at the Abbey House,” said Mr. Scobel laughing. \n \n “Oh, please don’t!” cried Violet. “You and Mrs. Scobel are different. I don’t mind you; but those dreadful stiff old ladies mamma cultivates, who think of nothing but their dress and their own importance — a little of them goes a very long way.” \n \n “But, my dear Miss Tempest, the Carterets and the Horwoods are some of the best people in the neighbourhood.” \n \n “Of course they are,” answered Vixen. “If they were not they would hardly venture to be so stupid. They take the full license of their acres and their quarterings. People with a coat-of-arms found yesterday, and no land to speak of, are obliged to make themselves agreeable.” \n \n “Like Captain Winstanley,” suggested Mr. Scobel. “I don’t suppose he has land enough to sod a lark. But he is excellent company.” \n \n “Very,” assented Vixen, “for the people who like him.” \n \n They were at the gate by this time. \n \n “You shan’t come any further unless you are coming in to see mamma,” protested Vixen. \n \n “Thanks, no; it’s too late to think of that.” \n \n “Then go home immediately, and have some supper,” said Vixen imperatively. “You’ve had nothing but a cup of weak tea since two o’clock this afternoon. You must be worn out.” \n \n “On such an occasion as to-day a man must not think of himself,” said the Vicar. \n \n “I wonder when you ever do think of yourself,” said Vixen. \n \n And indeed Mr. Scobel, like many another Anglican pastor of modern times, led a life which, save for its liberty to go where he listed, and to talk as much as he liked, was but little less severe in its exactions upon the flesh and the spirit than that of the monks of La Trappe. \n \n The Abby House looked very quiet when Vixen went into the hall, whose doors stood open to the soft spring night. The servants were all at supper, treating themselves to some extra comforts on the strength of a dinner-party, and talking over the evening’s entertainment and its bearings on their mistress’s life. There was a feeling in the servants’ hall that these little dinners, however seeming harmless, had a certain bent and tendency inimical to the household, and household peace. \n \n “He was more particular in his manner to-night than hever,” said the butler, as he dismembered a duck which had been “hotted up” after removal from the dining-room. “He feels hisself master of the whole lot of us already. I could see it in his hi. ‘Is that the cabinet ‘ock, Forbes?’ he says to me, when I was a-filling round after the bait. ‘No,’ says I, ‘it is not. We ain’t got so much of our cabinet ‘ocks that we can afford to trifle with ’em.’ Of course I said it in a hundertone, confidential like; but I wanted him to know who was master of the cellar.” \n \n “There’ll be nobody master but him when once he gets his foot inside these doors,” said Mrs. Trimmer, the housekeeper, mournful shake of her head. “No, Porline, I’ll have a noo pertater. Them canister peas ain’t got no flaviour with them.” \n \n While they were enjoying themselves, with a certain chastening touch of prophetic melancholy, in the servants’ hall, Violet was going slowly upstairs and along the corridor which led past her mother’s rooms. \n \n “I must go in and wish mamma good-night,” she thought; “though I am pretty sure of a lecture for my pains.” \n \n Just at this moment a door opened, and a soft voice called “Violet,” pleadingly. \n \n “Dear mamma, I was just coming in to say good-night.” \n \n “Were you, darling? I heard your footstep, and I was afraid you were going by. And I want very particularly to see you to-night, Violet.” \n \n “Do you, mamma? I hope not to scold me for going with the school-children. They had such a happy afternoon; and ate! it was like a miracle. Not so little serving for so many, but so few devouring so much.” \n \n Pamela Tempest put her arm round her daughter, and kissed her, with more warmth of affection than she had shown since the sad days after the Squire’s death. Violet looked at her mother wonderingly. She could hardly see the widow’s fair delicate face in the dimly-lighted room. It was one of the prettiest rooms in the house — half boudoir half dressing-room, crowded with elegant luxuries and modern inventions, gipsy tables, book-stands, toy-cabinets of egg-shell china, a toilet table à la Pompadour, a writing-desk à la Sevigné. Such small things had made the small joys of Mrs. Tempest’s life. When she mourned her kind husband, she lamented him as the someone who had bought her everything she wanted. \n \n She had taken off her dinner-dress, and looked particularly fair and youthful in her soft muslin dressing-gown, trimmed with Mechlin lace which had cost as much as a small holding on the outskirts of the Forest. Even in that subdued light Violet could see that her mother’s cheeks were pinker than usual, that her eyes were clouded with tears, and her manner anxiously agitated. \n \n “Mamma,” cried the girl, “there is something wrong, I know. Something has happened.” \n \n “There is nothing wrong, love. Bat something has happened. Something which I hope will not make you unhappy — for it has made me very happy.” \n \n “You are talking in enigmas, mamma, and I am too tired to be good at guessing riddles, just now,” said Violet, becoming suddenly cold as ice. \n \n A few moments ago she had been all gentleness and love, responding to the unwonted affection of her mother’s caresses. Now she drew herself away and stood aloof, with her heart beating fast and furiously. She divined what was coming. She had guessed the riddle already. \n \n “Come and sit by the fire, Violet, and I will tell you — everything,” said Mrs. Tempest coaxingly, seating herself in the low semi-circular chair which was her especial delight. \n \n “I can hear what you have to tell just as well where I am,” answered Violet curtly, walking to the latticed window, which was open to the night. The moon was shining over the rise and fall of the woods; the scent of the flowers came stealing up from the garden. Without, all was calm and sweetness, within, fever and smothered wrath. “I can’t think how you can endure a fire on such a night. The room is positively stifling.” \n \n “Ah Violet, you have not my sad susceptibility to cold.” \n \n “No, mamma. I don’t keep myself shut up like an unset diamond in a jeweller’s strong-box.” \n \n “I don’t think I can tell you — the little secret I have to tell, Violet, unless you come over to me and sit by my side, and give me your hand, and let me feel as if you were really fond of me,” pleaded Mrs. Tempest, with a little gush of piteousness. “You seem like an enemy, standing over there with your back to me, looking out at the sky.” \n \n “Perhaps there is no need for you to tell me anything, mamma,” answered Violet, in a tone which, to that tremulous listener in the low seat by the fire, sounded as severe as the voice of a judge pronouncing sentence. “Shall I tell you the secret?” \n \n There was no answer. \n \n “Shall I, mamma?” \n \n “I don’t think you can, my love.” \n \n “Yes, I am afraid I can. The secret — which is no secret to me or to anyone else in the world, any more than the place where the ostrich has put his head is a secret when his body is sticking up out of the sand — the secret is that, after being for seventeen happy honourable years the wife of the best and tiniest of men — the kindest, most devoted, and most generous of husbands — you are going to take another husband, who comes to you with no better credentials than a smooth tongue and a carefully-drilled figure, and who will punish your want of faith and constancy to my dead father by making the rest of your life miserable — as you will deserve that it shall be. Yes, mother, I, your only child, say so. You will deserve to be wretched if you marry Captain Winstanley.” \n \n The widow gave a faint scream, half indignation, half terror. For the moment she felt as if some prophetic curse had been hurled upon her. The tall straight figure in the white gown, standing in the full flood of moonlight, looked awful as Cassandra, prophesying death and doom in the wicked house at Argos. \n \n “It is too bad,” sobbed Mrs. Tempest; “it is cruel, undutiful, disrespectful, positively wicked for a daughter to talk to a mother as you have talked to me to-night. How can Miss McCroke have brought you up, I wonder, that you are capable of using such language? Have you forgotten the Fifth Commandment?” \n \n “No. It tells me to honour my father and my mother. I honour my dead father, I honour you, when I try to save you from the perdition of a second marriage.” \n \n “Perdition!” echoed Mrs. Tempest faintly, “what language!” \n \n “I knew when that adventurer came here, that he intended to make himself master of this house — to steal my dead father’s place,” cried Vixen passionately. \n \n “You have no right to call him an adventurer. He is an officer and a gentleman. You offer him a cruel, an unprovoked insult. You insult me still more deeply by your abuse of him. Am I so old, or so ugly, or so altogether horrid, that a man cannot love me for my own sake?” \n \n “Not such a man as Captain Winstanley. He does not know what love means. He would have made me marry him if he could, because I am to have the estate by-and-bye. Failing that, he has made you accept him for your husband. Yes, he has conquered you, as a cat conquers a bird, fascinating the poor wretch with its hateful green eyes. You are quite young enough and pretty enough to win a good man’s regard, if you were a penniless unprotected widow, needing a husband to shelter you and provide for you. But you are the natural victim of such a man as Captain Winstanley.” \n \n “You are altogether unjust and unreasonable,” exclaimed Mrs. Tempest, weeping copiously. “Your poor dear father spoiled you. No one but a spoiled child would talk as you are talking. Who made you a judge of Captain Winstanley? It is not true that he ever wanted to marry you. I don’t believe it for an instant.” \n \n “Very well, mother. If you are wilfully blind ——” \n \n “I am not blind. I have lived twice as long as you have. I am a better judge of human nature than you can be.” \n \n “Not of your admirer’s, your flatterer’s nature,” cried Vixen. “He has slavered you with pretty speeches and soft words, as the cobra slavers his victim, and he will devour you, as the cobra does. He will swallow up your peace of mind, your self-respect, your independence, your money — all good things you possess. He will make you contemptible in the eyes of all who know you. He will make you base in your own eyes.” \n \n “It is not true. You are blinded by prejudice.” \n \n “I want to save you from yourself, if I can.” \n \n “You are too late to save me, as you call it. Captain Winstanley has touched my heart by his patient devotion, I have not been so easily won as you seem to imagine. I have refused him three times. He knows that I had made up my mind never to marry again. Nothing was farther from my thoughts than a second marriage. I liked him as a companion and friend. That he knew. But I never intended that he should be more to me than a friend. He knew that. His patience has conquered me. Such devotion as he has given me has not often been offered to a woman. I do not think any woman living could resist it. He is all that is good and noble, and I am assured, Violet, that as a second father ——” \n \n Vixen interrupted her with a cry of horror. \n \n “For God’s sake, mamma, do not utter the word ‘father’ in conjunction with his name. He may become your husband — I have no power to prevent that evil — but he shall never call himself my father.” \n \n “What happiness can there be for any of us, Violet, when you start with such prejudices?” whimpered Mrs. Tempest. \n \n “I do not expect there will be much,” said Vixen. “Good-night, mamma.” \n \n “You are very unkind. You won’t even stop to hear how it came about — how Conrad persuaded me to forego my determination.” \n \n “No, mamma. I don’t want to hear the details. The fact is enough for me. If it would be any use for me to go down upon my knees and entreat you to give up this man, I would gladly do it; but I fear it would be no use.” \n \n “It would not. Violet,” answered the widow, with modest resoluteness. “I have given Conrad my word. I cannot withdraw it.” \n \n “Then I have nothing more to say,” replied Vixen, with her hand upon the door, “except good-night.” \n \n “You will not even kiss me?” \n \n “Excuse me, mamma; I am not in a kissing humour.” \n \n And so Vixen left her. \n \n Mrs. Tempest sat by the fading fire, and cried herself into a gentle slumber. It was very hard. She had longed to pour the story of this second courtship — its thrilling, unexpected joys, its wondrous surprises — into a sympathetic ear. And Violet, the natural recipient of these gentle confidences, had treated her so cruelly. \n \n She felt herself sorely ill-used; and then came soothing thoughts about her trousseau, her wedding-dress, the dress in which she should start for her wedding-tour. All things would of course be chastened and subdued. No woman can be a bride twice in her life; but Mrs. Tempest meant that the trousseau should, in its way, be perfect. There should be no rush or excitement in the preparation; nothing should be scamped or hurried. Calmness, deliberation, and a faultless taste should pervade all things. \n \n “I will have no trimming but Valenciennes for my under-linen,” she decided; “it is the only lace that never offends. And I will have old English monograms in satin-stitch upon everything. My peignoirs will require a good deal of study; they admit of so much variety. I will have only a few dresses, but those shall be from Paris. Theodore must go over and get them from Worth. She knows what suits me better than I do myself. I am not going to be extravagant, but Conrad so appreciates elegance and taste; and of course he will wish me to be well dressed.” \n \n And so, comforted by these reflections, Mrs. Tempest sank into a gentle slumber, from which she was awakened by Pauline, who had discussed her mistress’s foolishness over a hearty supper, and now came to perform the duties of the evening toilet. \n \n “Oh Pauline,” cried the widow, with a shiver, “I’m glad you awoke me. I’ve just had such an awful dream.” \n \n “Lor’, ma’am! What about?” \n \n “Oh, an awful dream. I thought Madame Theodore sent me home a trousseau and that there was not a single thing that would fit. I looked an object in every one of the dresses.” \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1412/42378.html","bookId":1391,"book":{"id":1391,"title":"Vixen","description":"简介： The moon had newly risen, a late October moon, a pale almost imperceptible crescent, above the dark pine spires in the thicket through which Roderick Vawdrey came, gun in hand, after a long days rabbit-shooting. It was not his nearest way home, but h...","cover":"http://novel.tingroom.com/file/upload/201510/30/08-33-58-89-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1412","creation":"Aug 1, 2019 12:24:59 AM","modification":"Aug 1, 2019 12:24:59 AM"}}
