{"id":29646,"no":31,"title":"CHAPTER XXXI. FLORENCE IS DISCHARGED.","content":"Mrs. Leighton sat in her boudoir with a stern face and tightly compressed lips. Miss Carter had called the previous afternoon and informed her of the astounding discoveries she had made respecting the governess. She rang the bell. “Janet,” she said, “when the governess comes you may bring her up here to me.” “Yes, ma’am.” “She’s going to catch it—I wonder what for?” thought Janet, as she noted the grim visage of her employer. So when Florence entered the house she was told that Mrs. Leighton wished to see her at once. “I wonder what’s the matter now?” she asked herself. “Has she heard of my meeting her nephew in the car?” When she entered the room she saw at once that something was wrong. “You wished to see me, Mrs. Leighton?” she said. “Yes,” answered Mrs. Leighton, grimly. “Will you be seated?” Florence sat down a few feet from her employer and waited for an explanation. She certainly was not prepared for Mrs. Leighton’s first words: “Miss Linden, where do you live?” Florence started, and her face flushed. “I live in the lower part of the city,” she answered, with hesitation. “That is not sufficiently definite.” “I live at No. 27 — Street.” “I think that is east of the Bowery.” “You are right, madam.” “You lodge with an apple-woman, do you not?” “I do,” answered Florence, calmly. “In a tenement house?” “Yes, madam.” “And you actually come from such a squalid home to instruct my daughter!” exclaimed Mrs. Leighton, indignantly. “It is a wonder you have not brought some terrible disease into the house.” “There has been no case of disease in the humble dwelling in which I make my home. I should be as sorry to expose your daughter to any danger of that kind as you would be to have me.” “It is a merciful dispensation of Providence, for which I ought to be truly thankful. But the idea of receiving in my house an inmate of a tenement house! I am truly shocked. Is this apple-woman your mother?” “I assure you that she is not,” answered Florence, with a smile which she could not repress. “Or your aunt?” “She is in no way related to me. She is an humble friend. “Miss Linden, your tastes must be low to select such a home and such a friend.” “The state of my purse had something to do with the selection, and the kindness shown me by Mrs. O’Keefe, when I needed a friend, will explain my location further.” “That is not all. You met in the Madison Avenue car yesterday my nephew, Mr. Percy de Brabazon.” “It is coming,” thought Florence. “Who could have seen us?” Then aloud: “Yes, madam.” “Was it by appointment?” “Do you mean to insult me, Mrs. Leighton?” demanded Florence, rising and looking at the lady with flashing eyes. “I never insult anybody,” replied Mrs. Leighton. “Pray, resume your seat.” Florence did so. “Then I may assume that it was accidental. You talked together with the freedom of old friends?” “You are correctly informed.” “You seem to make acquaintances very readily, Miss Linden. It seems singular, to say the least, that after meeting my nephew for a single evening, you should become such intimate friends.” “You will be surprised, Mrs. Leighton, when I say that Mr. de Brabazon and I are old friends. We have met frequently.” “Where, in Heaven’s name?” ejaculated Mrs. Leighton. “At my residence.” “Good Heavens!” exclaimed the scandalized lady. “Does my nephew Percy visit at the house of this apple-woman?” “No, madam. He does not know where I live.” “Then you will explain your previous statement?” said Mrs. Leighton, haughtily. “I am at present suffering reversed circumstances. It is but a short time since I was very differently situated.” “I won’t inquire into your change of circumstances. I feel compelled to perform an unpleasant duty.” Florence did not feel called upon to make any reply, but waited for Mrs. Leighton to finish speaking. “I shall be obliged to dispense with your services as my daughter’s governess. It is quite out of the question for me to employ a person who lives in a tenement-house.” Florence bowed acquiescence, but she felt very sad. She had become attached to her young charge, and it cost her a pang to part from her. Besides, how was she to supply the income of which this would deprive her? “I bow to your decision, madam,” she said, with proud humility. “You will find here the sum that I owe you, with payment for an extra week in lieu of notice.” “Thank you. May I bid Carrie good-by, Mrs. Leighton?” “It is better not to do so, I think. The more quietly we dissolve our unfortunate connection the better!” Florence’s heart swelled, and the tears came to her eyes, but she could not press her request. She was destined, however, to obtain the privilege which Mrs. Leighton denied her. Carrie, who had become impatient, came downstairs and burst into the room. “What keeps you so long, Miss Linden?” she said. “Is mamma keeping you?” Florence was silent, leaving the explanations to Mrs. Leighton. “Miss Linden has resigned her position as your governess, Carrie.” “Miss Linden going away! I won’t have her go! What makes you go, Miss Linden?” “Your mamma thinks it best,” answered Florence, with moistened eyes. “Well, I don’t!” exclaimed Carrie, stamping her foot, angrily. “I won’t have any other governess but you.” “Carrie, you are behaving very unbecomingly,” said her mother. “Will you tell me, mamma, why you are sending Miss Linden away?” “I will tell you some other time.” “But I want to know now.” “I am very much displeased with you, Carrie.” “And I am very much displeased with you, mamma.” I do not pretend to defend Carrie, whose conduct was hardly respectful enough to her mother; but with all her faults she had a warm heart, while her mother had always been cold and selfish. “I am getting tired of this,” said Mrs. Leighton. “Miss Linden, as you are here to-day, you may give Carrie the usual lessons. As I shall be out when you get through, I bid you good-by now.” “Good-by, Mrs. Leighton.” Carrie and Florence went to the schoolroom for the last time. Florence gave her young pupil a partial explanation of the cause which had led to her discharge. “What do I care if you live in a poor house, Miss Linden?” said Carrie, impetuously. “I will make mamma take you back!” Florence smiled; but she knew that there would be no return for her. When she reached her humble home she had a severe headache and lay down. Mrs. O’Keefe came in later to see her. “And what’s the matter with you, Florence?” she asked. “I have a bad headache, Mrs. O’Keefe.” “You work too hard, Florence, wid your teacher. That is what gives you the headache.” “Then I shan’t have it again, for I have got through with my teaching.” “What’s that you say?” “I am discharged.” “And what’s it all about?” Florence explained matters. Mrs. O’Keefe became indignant. “She’s a mean trollop, that Mrs. Leighton!” she exclaimed, “and I’d like to tell her so to her face. Where does she live?” “It will do no good to interfere, my good friend. She is not willing to receive a governess from a tenement house.“ “Shure you used to live in as grand a house as herself.” “But I don’t now.” “Don’t mind it too much, mavoureen. You’ll soon be gettin’ another scholar. Go to sleep now, and you’ll sleep the headache away.” Florence finally succeeded in following the advice of her humble friend. She resolved to leave till the morrow the cares of the morrow. She had twelve dollars, and before that was spent she hoped to be in a position to earn some more. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2948/81045.html","bookId":464,"book":{"id":464,"title":"Adrift in New York","description":"简介： Uncle, you are not looking well to-night.Im not well, Florence. I sometimes doubt if I shall ever be any better.Surely, uncle, you cannot mean...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2948","creation":"Aug 1, 2019 12:18:49 AM","modification":"Aug 1, 2019 12:18:49 AM"}}
