{"id":96413,"no":15,"title":"Page 15","content":"The first lot he’d circled was a 1919 set of Albanian overprints, with a catalog value just under $500 and an estimate of $350. Keller had looked at the stamps, and figured he’d go $375, maybe $400. The bidding opened at $200, and there were no bids from the live online participants, no phone bids reported by either of the women manning the phones. Keller was one of a mere dozen bidders physically present in the room, and none of his companions showed any interest in the Albanian set. Nor did Keller. He sat there as if mummified while the set was sold to the book bidder for $200. Wonderful. That gave him something new to regret. After an Egyptian lot got away from him, knocked down to an Internet bidder for less than he’d been prepared to pay, Keller knew what he had to do. There was an exercise he’d developed to keep his work from exacting a psychic toll, and if it worked with dead people, why shouldn’t it work with a stamp from a dead country? First, he found the photo of lot 77 in his catalog and stared intently at it. Then he closed his eyes and held the image in his mind—the vivid color, the details of the design, the hand-stamped overprint, the handwritten initials. He brought the image in close, so that it was larger than its actual size. And then he turned it over to the Photoshop of his mind. He let the colors go dim, the vermilion washing out, the black overprint fading to gray. He pushed the stamp away, letting it recede in the distance, growing smaller and smaller in his mind’s eye. It became a distant colorless blur, and grew smaller and smaller until it vanished altogether. By the time the lots from France and the French Colonies came up, he was back in the game. Eighteen Back at his hotel room, Keller found another reason to be glad he’d missed the British East Africa stamp. The way things stood, it looked as though he wasn’t going to be able to carry out his assignment. Dot would have to refund the advance payment, and he wouldn’t be getting paid. With nothing coming in, he’d have to pay attention to his expenses. He still had substantial funds in an offshore bank, but he’d been dipping into them just to cover ongoing household expenses, ever since the economic downturn flattened the business of rehabbing houses and flipping them. He could still afford to buy stamps, but he could spend more freely out of profits than out of capital. He put away the stamps he’d just purchased, including a high value from Gabon that had eluded him for years. He was happy to have them, but maybe it was just as well he’d missed out on the stamps from Albania and Egypt. Maybe he should skip tomorrow’s afternoon session, with all of that outstanding German Colonial material. Maybe he should move up his departure. He could probably still get a seat on tonight’s 8:59 flight to New Orleans. He wouldn’t save anything on the hotel bill, it was hours past checkout time, but he’d be home a day earlier, and that had to be worth something. Call Dot, tell her there was nothing for it but to give back the money. Hell. Maybe he should have one last look at the monastery. It looked as impregnable as ever. Oh, he could get a foot in the door. All he had to do was bang away with the knocker, and some creature in a plain brown robe would open it. But it wouldn’t be O’Herlihy, because when you were the abbot, you didn’t have the job of opening up for visitors. Instead you kept busy telling everybody else what to do, or stayed in your room, sucking on the Scotch bottle. Or did monks have cells? They seemed to in books, but then they weren’t cloistered in Murray Hill town houses, not in the novels he’d read. O’Herlihy, he somehow knew, would have a large and well-appointed bedchamber all to himself, unless he managed to smuggle in one of those women he’d been bragging about. Would that bedchamber front on the street? Could the man be standing at his window now, looking out at the passing scene? Looking out, perhaps, at the man he knew as Timothy Hannan? Keller, on the north side of the street, drew back into the shadows. If you knew which room was his, and if it did indeed look out on 36th Street, then what? A bomb? Not a huge one to demolish the whole building, but something more along the lines of a hand grenade. Lob it through the window in the wee small hours of the morning, by which time O’Herlihy would have taken in enough Scotch to render him unconscious. Boom! The man would never know what hit him. Of course you’d have to know which window belonged to his room. And you’d also have to know where to get your hands on a grenade. Hmm. If he could just find another way into the building. A back door, say. So that he could contrive to be inside when all but a skeleton crew of monks had retired for the night, and their abbot along with them. Then, gliding down the corridors like a ninja, he could find O’Herlihy’s room with the man passed out and snoring, his intimidation factor severely diminished. Keller, who could bring any weapon he wanted, might as easily dispatch his quarry with his bare hands. He turned to his right, counting his steps as he walked to Madison Avenue, where he turned left and walked a block south. At 35th Street he turned left again, and counted his steps again, stopping when he reached the number he’d tallied earlier. Now, unless he’d screwed up somehow, the building in front of him was one that backed up on Thessalonian House. And a handsome building it was, four stories tall, with a limestone facade and Greek Revival pillars. Like Thessalonian House, it had surely started life as a private home, and was just as surely something else now. There was a brass plaque alongside the door, but Keller couldn’t make out what it said, and— “Edward!” The voice was familiar, even if the name was not. Keller turned, and there was Irv Feldspar, the man who’d recognized him from years ago at Stampazine. He was wearing a tweed jacket and a checked shirt and a big smile, and he hurried along the sidewalk to where Keller was standing. “Edward Nicholas,” he said, panting from the effort. “Knew you right away. Never thought you’d be a member, living where you do. New Mexico, didn’t you say?” “New Orleans.” “Well, I was close. But of course we’ve got plenty of out-of-town members. We just don’t get to see them so often. You’re here for the presentation?” “I was just walking down the street,” Keller said. “And I’m afraid I’m not a member of anything, Mr. Feldspar.” “Please, make it Irv. And do you prefer Ed or Edward?” “Well, I—” “Or Eddie, even, for all I know.” “Actually,” he said, “my name’s Nicholas Edwards, so—” “Well, I was close. Nick? Nicholas?” “Either one, Irv.” “So you’re not a member of the Connoisseurs? Your feet just brought you here? Well, I have to say you’ve got smart feet. We meet the first and third Wednesday of the month, drinks and hors d’oeuvres for an hour, then a one-hour presentation, and we’re out by half past seven. Tonight we’ve got a visiting speaker from Milwaukee, an expert on the philately of the Civil War. Come on.” Feldspar had taken him by the arm and was urging him toward the door. Keller said again that he wasn’t a member, but that didn’t seem to matter. “You’re my guest,” he said. “You’ll have a drink, you’ll have something to eat, and you’ll see some great philatelic material and listen to a terrific talk. And you’ll meet some wonderful fellows. Franklin Roosevelt was a member of this club, FDR himself. Come on, Nick, you don’t want to miss this.” “It was pretty interesting,” he told Julia. “The place is the next thing to a mansion, and it belongs to the club. Someone gave it to them a hundred years ago, and there’s no mortgage, and because they’re nonprofit there are no taxes to pay. And they can afford to put out a spread of food and drinks before every meeting, and it’s all free.” “And the people were nice?” “Very pleasant fellows. And a couple of women, too. Irv kept introducing me to people, and he got a couple of names wrong, but they know him well enough to be used to him.” “Ass-Backward syndrome,” she said. “How was the presentation?” “That’s what I wanted to tell you about. It was Civil War philately, which of course means the USA—” “And the CSA, buster.” “Well, yeah. But it’s an area I don’t collect, so that made the material on display less interesting to me than it might have been otherwise. But the talk was fascinating, and I learned some things I never knew. Do you know what happened in 1861?” “Well, I guess I do,” she said. “Y’all started a damn war for no good reason.” “Besides that,” he said. “See, someone in Washington realized that all those U.S. post offices in the southern states had large stocks of U.S. stamps on hand.” “So? They couldn’t mail letters with them. They were a separate nation by then, even if nobody in Washington was willing to acknowledge it.” “Sometimes,” he said, “you’re more southern than usual. This fellow in Washington was worried that those stamps constituted a danger to the Union. Confederate agents could smuggle them across the border and sell them at a discount to unscrupulous parties. On the one hand that would raise funds that could be used to aid the secessionist cause, and at the same time it could undermine the integrity of the United States mails.” “Would that work?” “I don’t see how. We’re talking about stamps, for God’s sake. But in order to nip such a scheme in the bud, the Post Office recalled all the current stamps and rushed a whole new series of stamps into production, with no end of complications that would only interest a stamp collector, and at a cost that had to be ten times what those mythical southern smugglers could have netted for their stamps.” “Yankees,” she said. “Was it a southern boy who gave the presentation?” “As a matter of fact he was from Milwaukee.” “Maybe his granddaddy moved north,” she said, “though why he’d want to do that is beyond me. I’m just having fun, you know, when I get like this.” “I know.” “It sounds as though you had a good time. Are the dues very high?” “Two hundred dollars a year.” “That’s hardly anything. What, four dollars a week?” “It’s even less for out-of-town members. He offered to sponsor me.” “Who, Mr. Asperger?” “Feldspar. I’d need references, but there are enough dealers I’ve done business with. And I’m a member of the American Philatelic Society.” “I think you should join.” “Well, I’ll think about it. Who knows when I’ll be back in New York?” “But you feel okay there?” “Pretty much.” She hadn’t asked about the job that had brought him there, nor had he volunteered anything. “But I’ll be glad to get home.” “Me, too. Tomorrow night, you said? I’ll pick you up at the airport.”","sourceLink":"https://allnovel.net/hit-me-keller-5/page-15.html","bookId":2316,"book":{"id":2316,"title":"Hit Me (Keller #5)","description":"Storyline: Hit Me (Keller #5) A man named Nicholas Edwards lives in New Orleans renovating houses, doing honest work and making decent money at it. Between his family and his stamp collection, all his spare time is happily accounted for. Sometimes it\u0027s hard to remember that he used to kill people for a living. But when the nation\u0027s economy tanks, taking the construction business with it, all it takes is one phone call to drag him back into the game. It may say Nicholas Edwards on his driver\u0027s license and credit cards, but he\u0027s back to being the man he always was: Keller. Keller\u0027s work takes him to New York, the former home he hasn\u0027t dared revisit, where his target is the abbot of a midtown monastery. Another call puts him on a West Indies cruise, with several interesting fellow passengers-the government witness, the incandescent young woman keeping the witness company, and, sharing Keller\u0027s cabin, his wife, Julia. But the high drama comes in Cheyenne, where a recent widow is looking to sell her husband\u0027s stamp collection...","cover":"https://allnovel.net/images/hit-me-keller-5.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/hit-me-keller-5.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:20:26 PM"}}
