{"id":96437,"no":39,"title":"Page 39","content":"“Our Jenny was turned around in the birth canal, and they were going to do a caesarean because she was leading with her behind, and that makes for a difficult delivery. But the obstetrician managed to get her turned around some, so that she emerged feet first.\n “We’d already decided that we both liked the name Jenny. It was high on our list. And then, when she flew into our lives upside down, well, that cinched it.”\n “She might have liked it,” Julia said. “Don’t you think? Her husband was a collector, and she had a million new reasons to like the whole idea of stamps.”\n “I figured it would take a long time to explain. It was nothing she needed to know, and I didn’t feel like going through it.”\n “So you didn’t sleep with her, and you didn’t tell her how your daughter got her name. You’re some houseguest. Glad to be home?”\n “Very.”\n “And you’re exhausted, aren’t you? You can tell me the rest tomorrow. And I guess you’ve got stamps to put in.”\n “Magic beans,” he said.\n “I won’t even ask what that means,” she said. “Good night, my sweet.”\n But she asked him the following afternoon. He’d caught up with the mail by then, and driven to Slidell to pick up the envelope that was waiting for him at a Mail Boxes Etc. office. Cash, his share of the money Joanne Hudepohl had wired to Dot in Flagstaff.\n Back home, he stashed the money, then went to work on his stamps. His office was not nearly so grand as Jeb Soderling’s beautifully appointed stamp room, but it suited him just fine. His chair was comfortable, his desk the right size and height, and the light fell on his books and stamps without getting in his eyes.\n Jenny took her usual perch on the chair beside his, and he kept up a running commentary while she watched every move he made. He was still hard at it when nap time came around, and Julia led Jenny away and came back to take her place at the stamp table.\n “Stamps are educational,” she said, “even when it’s your father who collects them. I’ll bet there’s not a kid in her whole day care center who knows a damn thing about the Turco-Italian War and the Treaty of Roseanne.”\n “Lausanne.”\n “I was close. Lausanne’s in Switzerland, isn’t it? Or am I thinking of Lucerne?”\n “They’re both in Switzerland.”\n “Both of them? That’s confusing, isn’t it? Which one is full of magic beans? You don’t have any idea what I’m talking about, do you? Well, that makes us even. Those were the last two words you said last night, right before you dropped off to sleep. Or maybe you were already asleep. Are you going to tell me about the magic beans?”\n It took him a minute. Then he remembered and recounted his dreamy conversation with his dead mother.\n “Magic beans,” Julia said. “Well, your mother might not agree, but I think taking your commission in stamps makes perfect sense. What do you figure they’re worth?”\n “The Scott value’s a little over a hundred thousand. On this sort of material, figure retail at somewhere between sixty and seventy-five percent of catalog. I couldn’t get that for them, but that’s what I’d have had to pay.”\n “But you didn’t have to pay anything. That’s nice.”\n “Very. You know, I don’t think it cost her anything, either. I can’t believe anybody’s bid would have been higher if the stamps I took were still in their albums.”\n “So everybody wins?”\n “Denia wins,” he said, “and so do I. Would Talleyrand Stamp and Coin net a few dollars more if these stamps were included in what they bought? I suppose so, but they’ll make out fine as it is.”\n “And they’ll never miss what they never knew was there. And you’re better off getting paid in stamps, because you’d have spent the money on stamps anyway. So you did fine with the magic beans, and that was only part of your compensation. The next time you talk with your mother you can let her know you picked up some cash while you were at it.”\n “That’ll be a load off her mind.”\n “Do you want to tell me about that part of it? Jenny’s good for another half hour minimum, if you feel like talking about what you did in Denver.”\n Forty-Eight\n I got in a twist over the GPS,” he told her. “I’d programmed it with two addresses where things happened.”\n “The house that burned and where else? Oh, of course. The loft where you wrapped things up.”\n “And anything digital lasts forever.”\n “And of course you’d rented the car under your own name.”\n “I did everything under my own name, including the car rental. So I hatched one brilliant idea after another. I could pull the GPS, smash it with a hammer, drop it off a bridge, and report it as stolen.”\n “That would work, wouldn’t it?”\n “You’d think so,” he said, “but suppose it’s got some kind of cyberconnection to a computer somewhere? Then making it disappear just might lead somebody to check with the mother ship and find out where it had been before it got lost. So I thought of opening it up and messing with its insides.”\n “To reprogram it? You could do that?”\n “Not in a million years. But I could probably find some way to make it stop working. I wouldn’t mention it, and nobody would notice until the next person to rent it couldn’t get it to work. If he even bothered to try.”\n “Is that what you did?”\n He shook his head. “I just left it alone and gave the car back to them. I decided it was nothing to worry about. If they have reason to suspect me, they won’t need GPS records. If they don’t, they won’t check them. And why should they? As far as they’re concerned, the case is closed. Richard Hudepohl is dead as a result of a fire set by the former lover of his jilted girlfriend.”\n “All of which is true.”\n “Well, almost true, and there’s nobody around to argue otherwise. Trish Heaney and Tyler Crowe are both dead. If the lab crew from CSI got on the case, they’d probably spot a few inconsistencies in the murder-suicide scenario, but real-life cops are in more of a hurry than the ones on TV. The case is closed, and the closest thing to a loose end is Joanne, and even if she’s crazy enough to tell someone, what can she say? She’s got the number of an unregistered phone that no longer exists, and she wired some money to a person who never existed in the first place.”\n “So it’s all over. And yet you seem…”\n “What?”\n “I don’t know. Moody? Dissatisfied?”\n “Maybe.”\n “Did you do that memory exercise? Making the mental picture smaller and bleaching the color out of it?”\n He shook his head. “I probably should,” he said. “I’ve spent so little time thinking about them that I didn’t even remember to fade them out of my memory. I can barely remember what they look like, Trish and Tyler. Very distinctive in appearance, both of them, and yet it’s hard for me to picture them.”\n “I wonder why.”\n Later he said, “It was peripheral, all of it. What I was most interested in was getting the best possible price for the Soderling collection. The job in Denver was something to shunt aside and take care of in my spare time.”\n “When it was supposed to be the other way around.”\n “I was all involved with the stamps,” he said, “and it took me a couple of days to go have a look at the house on Otis Drive. If I’d made it my first priority, there never would have been a fire. Hudepohl would have been a soft target, he wouldn’t have had his guard up, so how hard could it have been?”\n “For a man of your talents.”\n “Well,” he said. “The point is, by the time I managed to go see where he lived, there was no house there. And then there was nothing to do, so I headed north and went back to work on selling the stamps.”\n “Which was what you were really interested in anyway.”\n “Right. And when Dot went proactive and got in touch with Mrs. Hudepohl, I wondered why she couldn’t leave well enough alone.”\n “Because you already had half the money without doing anything.”\n “And now I’d have to do something. And I did, and it went smoothly enough, but it was a little like watching a movie.”\n “You weren’t really involved.”\n “I managed to stay in the moment,” he said, “because you have to. And I didn’t get thrown off at the prospect of making bad things happen to good people.”\n “Because they weren’t good people.”\n “They weren’t just the kind of people you see on Cops. They were the kind who call up their friends to make sure they tune in and watch. She was a tramp and he was a glassy-eyed pyromaniac. And they smelled.”\n “Oh?”\n “I don’t think he bathed much. Maybe he resented water because people put out fires with it, but you could tell he gave it a wide berth. And she was wearing this overpowering perfume, with a trace of body odor under it.”\n “Charming.”\n “I smelled it again a few hours ago, when I made their images get fainter and smaller. I got rid of their faces, but I couldn’t get rid of the perfume. Jesus, I’ll bet that’s what it was.”\n “What?”\n “Jungle Gardenia. It’s not as though I recognized it, because I don’t believe I’d ever smelled it before, but I mentioned it, didn’t I?”\n “It’s how your girlfriend got her name.”\n “Her mother wore it,” he remembered, “and it evidently drove her father mad with desire.”\n “But it just made you want to get back to your stamps.”\n “It made me want to get out of there,” he said. “I wish there was a way to get the smell out of my memory. If I can do it with a visual image, why can’t I do it with an aroma?”\n “Maybe you’ll figure out something.”\n “Or maybe it’ll go away on its own. It doesn’t matter. The point is my work didn’t have my full attention, and I think there’s a lesson there.”\n “Don’t try to do two things at once?”\n “That’s part of it,” he allowed, “but there’s more. The other thing, the Denver assignment. I don’t think I can do that anymore.”\n “Maybe it’s time to let go of it.”\n “That’s what I’ve been thinking. I thought I was done with it before, when Donny and I were doing okay rehabbing houses. And then I had a reason to go back to it, or thought I did, and it’s very seductive.”\n “Easy money,” she said.\n “Plus it’s easy to get involved. It’s problem solving, and you get caught up in it, and there’s a good feeling when it works out. Well, there can be a bad feeling, too, but you push that part aside. Except this time I didn’t get caught up in it, not really, and the good feeling didn’t amount to much. And there wasn’t exactly a bad feeling, but there was a bad smell.” \n","sourceLink":"https://allnovel.net/hit-me-keller-5/page-39.html","bookId":2316,"book":{"id":2316,"title":"Hit Me (Keller #5)","description":"Storyline: \n Hit Me (Keller #5) \n A man named Nicholas Edwards lives in New Orleans renovating houses, doing honest work and making decent money at it. Between his family and his stamp collection, all his spare time is happily accounted for. Sometimes it\u0027s hard to remember that he used to kill people for a living. \n But when the nation\u0027s economy tanks, taking the construction business with it, all it takes is one phone call to drag him back into the game. It may say Nicholas Edwards on his driver\u0027s license and credit cards, but he\u0027s back to being the man he always was: Keller. \n Keller\u0027s work takes him to New York, the former home he hasn\u0027t dared revisit, where his target is the abbot of a midtown monastery. Another call puts him on a West Indies cruise, with several interesting fellow passengers-the government witness, the incandescent young woman keeping the witness company, and, sharing Keller\u0027s cabin, his wife, Julia. But the high drama comes in Cheyenne, where a recent widow is looking to sell her husband\u0027s stamp collection...\n \n","cover":"https://allnovel.net/images/hit-me-keller-5.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/hit-me-keller-5.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:20:26 PM"}}
