{"id":96440,"no":42,"title":"Page 42","content":"“His grandmother died,” she said, “and left all her money in trust for him. He gets it when he turns twenty-one.”\n “If he turns twenty-one.”\n “There you go. So in a sense you’ve got seven years to do the job, but the client doesn’t want to wait that long.”\n He thought about it. “Shouldn’t be too hard to work out who the client is. Who gets the money if the kid’s out of the picture?”\n “It gets divided up. Three main beneficiaries, so the odds are that one of them’s our client.”\n “Or they’re all in it together, like something on Masterpiece Theatre. Dot, it’s not really my problem.”\n “I know.”\n “For all we know, he could be a mean little bastard. Starts fires, tortures animals, wets the bed.”\n “And whoever kills him will be doing the world a favor.”\n “For all we know. Why would I fly up there on a Sunday? What happens on Monday?”\n “That’s when he’s easy to find,” she said, “because every Monday after dinner he gets on the bus and goes downtown to his stamp club meeting.”\n Keller checked out the offerings of some of the vest-pocket dealers, but didn’t see anything he could use. He fell into a couple of conversations, none of them as absorbing as the one he’d had with the boy. At an adjacent table, he overheard the other lad, taller and heavier than Mark, contemplating the purchase of a set of World Cup stamps from Transnistria, the breakaway province of Moldova, which itself had broken away from the Soviet Union. Transnistria, its autonomy recognized only by Russia, didn’t field a World Cup team, and Keller wasn’t sure the inhabitants cared much about soccer, but that didn’t keep them from issuing stamps, and selling them to collectors.\n The meeting ended with an auction—a handful of members’ lots, with listless bidding and the highest sale price under $10. And then there was a raffle, and Mark’s trading partner won a souvenir sheet from Saint Vincent and the Grenadines, donated by one of the dealers.\n And that was that. Keller took his chair to the back of the room, where some men were stacking them, and Mark made a point of coming over and extending his hand. “I enjoyed talking with you, Nick,” he said. “Will you be coming again next week?”\n “I’m afraid not. I’m just in town on business.”\n “Next time bring your duplicates. Maybe we can trade.”\n “I’ll do that,” Keller said. “You spend a lot of time on stamps?”\n “As much as I can. I do okay in school, so homework doesn’t take much time, and I’m hopeless in sports, so that doesn’t take any time at all.”\n “I see your friend collects World Cup issues.”\n “He likes soccer. He even likes to play it.”\n “But you don’t.”\n “I like to sit at my desk and work on my stamps. Pretty boring, most people would say.”\n “Not in this room.”\n “Well, that’s true,” the boy agreed. “When I come here I don’t feel like a misfit. I don’t even feel like a kid.” He grinned. “In here,” he said, “I’m just another philatelist.”\n Downstairs, Keller found himself pausing at the desk on his way to the door. The same woman, who did in fact strongly resemble young Mark’s trading partner, smiled brightly. Keller said, “Why an A?”\n She didn’t hesitate. Because she could read his mind? No, more likely he was not the first person to ask. Possibly not even the first person that day.\n “It used to say YMCA,” she said.\n “Before the tornado struck?”\n “Only metaphorically. YMCA stands for Young Men’s Christian Association.”\n “And?”\n “And gradually one word after another became problematic. ‘Christian’? That might put off potential Jewish or Muslim members, and irritate atheists. Not to mention the Druids.”\n “I never mention the Druids.”\n “Then came ‘Men’s.’ There was a YWCA as well, but the two merged a while back, to eliminate sexism, and cut costs in the bargain. So what’s left? ‘Young Association’? In addition to sounding stupid, and vaguely ageist, it was just plain inaccurate. This place is more of a senior center than a young association. So all the letters came down.”\n “Except for the A. Is that what they call it now? The A?”\n “No, of course not,” she said. “Everybody calls it the Y, the same as they always did. Don’t you love it? And aren’t you glad you asked? But not so glad as I. Because now I feel useful, having just supplied some information you probably couldn’t have found on Google.”\n Keller walked back to his hotel, went up to his room, turned on the TV. He found a Spanish-language channel showing a soccer game, and turned it off when he realized he wasn’t paying it the slightest bit of attention. The only part he was enjoying, in a sort of subliminal way, was the audio, and that was because he couldn’t understand it.\n He called home, spoke to Julia. “I was hoping I wouldn’t like him,” he said, “but he’s a very nice boy. And serious about his stamps.”\n “So I guess you’ll be a few days.”\n “I could turn around and come home,” he said, “except I can’t.”\n He switched phones, called Dot. “Well, I’m in,” he told her. “I got here, and I met him, and I’m in.”\n “I figured the stamps would cinch it.”\n “I was probably in anyway. What choice do I have? It’s an obligation.”\n “That’s just waiting to be turned into a joke,” she said, “but I’m not going to touch it. Where do the two of us get off talking about moral obligations? But there’s no getting around it. That’s what it is.”\n He thought for a moment. “There are three people who collect if the kid doesn’t, right?”\n “Two aunts and an uncle. They each get a fourth, and that’s a lot, because Grandma was a wealthy lady.”\n “That’s three people each getting a fourth.”\n “The boy’s mother would get the last share, but—”\n “But it’s probably not her.”\n “Unless we’re back to Masterpiece Theatre, and she’s the classic Least Likely Suspect.”\n “If I brace them in turn, I should be able to pick a winner. I guess I’ll start with the uncle.”\n He took a shower, turned the TV on, turned it off again. Instead of arriving on Sunday, he’d flown in that very morning. So he hadn’t been to the Falls, and probably wouldn’t get there, either. If he hadn’t been working, he’d have brought Julia and Jenny along, and all three of them could have made the trip. Put on those yellow slickers, rode the Maid of the Mist right under the Falls, did all the tourist things.\n But if he hadn’t been working, how likely was it that he’d have come to Buffalo at all?\n Two aunts and an uncle. He could hang around for a week, then go home. Maybe the client would change his mind, maybe the broker would tell him to look elsewhere. Maybe it would take seven years before the uncle (or the aunt, or the other aunt) found somebody to do the job, and by then there’d be no job to do.\n Maybe what he himself ought to do was take out all three of them, the uncle and both aunts. The odds were they all three had it coming. If one of them happened to be the client, that was just because he (or she or she) thought of it first, or knew a number to call.\n He’d thought he was done with all of this crap. And all it took to draw him back in was a kid with a pair of tongs and a magnifier, a kid who knew a lot of useless information about Allenstein. (And wasn’t that redundant? Was it possible to know any useful information about Allenstein?)\n Was he going to be doing this sort of thing for the rest of his life? Couldn’t he just pack up his things and go home?\n Evidently not. And Mark was a nice young man, with a keen interest in his hobby, and philately needed a next generation. The torch had to be passed, and every issue of Linn’s held a lament for the paucity of future torchbearers.\n Not to worry, Keller told himself. He’d think of something. \n","sourceLink":"https://allnovel.net/hit-me-keller-5/page-42.html","bookId":2316,"book":{"id":2316,"title":"Hit Me (Keller #5)","description":"Storyline: \n Hit Me (Keller #5) \n A man named Nicholas Edwards lives in New Orleans renovating houses, doing honest work and making decent money at it. Between his family and his stamp collection, all his spare time is happily accounted for. Sometimes it\u0027s hard to remember that he used to kill people for a living. \n But when the nation\u0027s economy tanks, taking the construction business with it, all it takes is one phone call to drag him back into the game. It may say Nicholas Edwards on his driver\u0027s license and credit cards, but he\u0027s back to being the man he always was: Keller. \n Keller\u0027s work takes him to New York, the former home he hasn\u0027t dared revisit, where his target is the abbot of a midtown monastery. Another call puts him on a West Indies cruise, with several interesting fellow passengers-the government witness, the incandescent young woman keeping the witness company, and, sharing Keller\u0027s cabin, his wife, Julia. But the high drama comes in Cheyenne, where a recent widow is looking to sell her husband\u0027s stamp collection...\n \n","cover":"https://allnovel.net/images/hit-me-keller-5.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/hit-me-keller-5.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:20:26 PM"}}
