{"id":86168,"no":1,"title":"Page 1","content":"1\n Carlos\n I want to live life on my own terms. But I’m Mexican, so mi familia is always there to guide me in everything I do, whether I want them to or not. Well, “guide” is too weak a word. “Dictate” is more like it.\n Mi\u0027amá didn’t ask if I wanted to leave Mexico and move to Colorado to live with my brother Alex for my senior year of high school. She made the decision to send me back to America “for my own good”— her words, not mine. When the rest of mi familia backed her up, it was a done deal.\n Do they really think sending me back to the U.S. will prevent me from ending up six feet under or in jail? Ever since I got fired from the sugar mill two months ago, I’ve lived la vida loca. Nothing is ever gonna change that.\n I look out the small window as the plane soars above the snowcapped Rockies. I’m definitely not in Atencingo anymore . . . and I’m not in the suburbs of Chicago, either, where I lived my entire life before mi\u0027amá made us pack up and move to Mexico during my sophomore year.\n When the plane lands, I watch other passengers scramble to get off. I hold back and let this whole situation sink in. I’m about to see my brother for the first time in almost two years. Hell, I’m not even sure I want to see him.\n The plane is almost empty, so I can’t stall anymore. I grab my backpack and follow the signs for the baggage claim area. As I exit the terminal, I see my brother Alex waiting for me beyond the barricade. I thought I might not recognize him, or feel like we were strangers instead of family. But there’s no mistaking my big brother . . . his face is as familiar to me as my own. I get a little satisfaction that I’m taller than him now, and I don’t look anything like that scrawny kid he left behind.\n “Ya estás en Colorado,” he says as he pulls me into a hug.\n When he releases me, I notice faint scars above his eyebrows and by his ears that weren’t there the last time I saw him. He looks older, but he’s missing that guarded look he always carried around with him like a shield. I think I inherited that shield.\n “Gracias,” I say flatly. He knows I don’t want to be here. Uncle Julio stayed at my side until he forced me on the plane. And then threatened to stay at the airport until he knew my ass was off the ground.\n “You remember how to speak English?” my brother asks as we walk to the baggage claim.\n I roll my eyes. “We only lived in Mexico two years, Alex. Or should I say, me, Mamá, and Luis moved to Mexico. You ditched us.”\n “I didn’t ditch you. I’m goin’ to college so I can actually do somethin’ productive with my life. You should try it sometime.”\n “No, thanks. I like my unproductive life just fine.”\n I grab my duffel off the carousel and follow Alex out of the airport.\n “Why are you wearin’ that around your neck?” my brother asks me.\n “It’s a rosary,” I answer, fingering the black-and-white beaded cross. “I turned religious since I saw you last.”\n “Religious, my ass. I know it’s a gang symbol,” he says as we reach a silver Beemer convertible. My brother couldn’t afford a bangin’ car like that; he must have borrowed it from his girlfriend, Brittany.\n “So what if it is?” Alex was in a gang back in Chicago. Mi papá was a gang member before him. Whether Alex wants to admit it or not, being a badass is my legacy. I tried living by the rules. I never complained when I made less than fifty pesos a day and worked like a dog after school. After I got canned and started running with the Guerreros del barrio, I made over a thousand pesos in one day. It might have been dirty money, but it kept food on our table.\n “Didn’t you learn anything from my mistakes?” he asks.\n Shit, when Alex was in the Latino Blood back in Chicago I worshipped him. “You don’t want to hear my answer to that.”\n Shaking his head in frustration, Alex grabs my duffel out of my hand and tosses it in the back of the car. So what if he got jumped out of the Latino Blood? He’ll wear his tattoos the rest of his life. Whether he wants to believe it or not, he’ll always be associated with the LB whether he’s active in the gang or not.\n I take a long look at my brother. He’s definitely changed; I sensed it from the minute I saw him. He might look like Alex Fuentes, but I can tell he’s lost that fighting spirit he once possessed. Now that he’s in college, he thinks he can play by the rules and make the world a shinier place to live. It’s amazing how quickly he’s forgotten that not too long ago we lived in the slums of the Chicago suburbs. Some parts of the world can’t shine, no matter how much you try and polish off the dirt.\n “¿Y Mamá?” Alex asks.\n “She’s fine.”\n “And Luis?”\n “The same. Our little brother is almost as smart as you, Alex. He thinks he’s gonna be an astronaut like José Hernández.”\n Alex nods like a proud papa, and I think he really does believe Luis can live his dream. The two of them are delusional . . . both my brothers are dreamers. Alex thinks he can save the world by creating cures for diseases and Luis thinks he can leave the world to explore new ones.\n As we turn onto the highway, I see a wall of mountains in the far distance. It reminds me of the rough terrain in Mexico.\n “It’s called the Front Range,” Alex tells me. “The university is at the base of the mountains.” He points off to the left. “Those are the Flatirons, ’cause the rocks are flat like ironing boards. I’ll take you there sometime. Brit and I take walks there when we want to get away from campus.”\n When he glances at me, I’m looking at my brother like he’s got two heads.\n “What?” he asks.\n Is he kidding?—¿Me está tomando los pelos? “I’m just wondering who you are and what the hell you did with my brother. My brother Alex used to be a rebel, and now he’s talkin’ about mountains, ironin’ boards, and takin’ walks with his girlfriend.”\n “You’d rather I talked about getting drunk and fucked up?”\n “Yes!” I say, acting like I’m excited. “And then you can tell me where I can get drunk and fucked up, ’cause I won’t last long if I don’t get some kind of illegal substance in my system,” I lie. Mi\u0027amá probably told him she suspects I’m into drugs, so I might as well play the part.\n “Yeah, right. Save the bullshit for Mamá, Carlos. I don’t fall for it any more than you do.”\n I put my feet up on the dash. “You have no clue.”\n Alex shoves them down. “Do you mind? It’s Brittany’s car.”\n “You are seriously whipped, man. When are you gonna dump that gringa and start bein’ a normal college guy who hooks up with a bunch of girls?” I ask him.\n “Brittany and I don’t date other people.”\n “Why not?”\n “It’s called being boyfriend and girlfriend.”\n “It’s called bein’ a panocha. It’s not natural for a guy to be with one girl, Alex. I’m a free agent and I plan to stay one forever.”\n “Just so we’re clear, Señor Free Agent, you’re not screwin’ anyone in my apartment.”\n He might be my older brother, but our father has been dead and buried a long time. I don’t want or need his bullshit rules. It’s time I set some of my own. “Just so you’re clear, I plan on doin’ whatever the fuck I want while I’m here.”\n “Just do us both a favor and listen to me. You might actually learn somethin’.”\n I give a short laugh. Yeah, right. What am I gonna learn from him, how to fill out college applications? Do thermal chemistry experiments? I don’t plan on doing either of those.\n We’re both silent as we drive for another forty-five minutes, the mountains getting closer and closer with each mile. We pass right through the University of Colorado at Boulder campus. Redbrick buildings jut out of the landscape and college students with backpacks are scattered everywhere. Does Alex think he can beat the odds and actually find a high-paying job so he won’t be poor the rest of his life? Fat chance of that happening. People will take one look at him and his tattoos and throw his ass out the door.\n “I’ve got to be at work in an hour, but I’ll get you settled in first,” he says as he pulls into a parking space.\n I know he got a job working at some auto-body shop to help him pay off a shitload of school and government loans.\n “This is it,” he says as he points to the building in front of us. “Tu casa.”\n This round eight-story eyesore of a building resembling a giant corncob is the farthest thing from being a home, but whatever. I pull my duffel out of the trunk and follow Alex inside.\n “I hope this is the poor side of town, Alex,” I say. “ ’Cause I get hives around rich people.”\n “I’m not livin’ in luxury, if that’s what you mean. It’s subsidized student apartments.”\n We ride the elevator to the fourth floor. The hallway smells like stale pizza, and a bunch of stains are scattered across the carpet. Two hot girls in workout clothes pass us. Alex smiles at them. From their dreamy reaction I wouldn’t be surprised if they suddenly kneeled down and kissed the ground he walks on.\n “Mandi and Jessica, this is my brother Carlos.”\n “Hel-lo, Carlos . . .” Jessica scans me up and down— I have definitely reached horny college central. And I’m definitely feelin’ it. “Why didn’t you tell us he was a hottie?”\n “He’s in high school,” Alex warns them.\n What is he, my cock-blocker? “A senior,” I blurt out, hoping that’ll lessen the blow that I’m not a college guy. “I’ll be eighteen in a couple months.”\n “We’ll throw you a birthday party,” Mandi says.\n “Cool,” I say. “Can I have you two as my presents?”\n “If Alex doesn’t mind,” Mandi says.\n Alex walks away and weaves a hand through his hair. “I’m gonna get myself in trouble if I get into this discussion.”\n This time, the girls laugh. Then they jog down the hall, but not before looking back and waving bye.\n We go in Alex’s apartment. He’s definitely not living in the lap of luxury. A twin bed with a thin black fleece blanket is off to the side of the room, a table and four chairs are on the right, and a kitchen so small that two people would have a hard time fitting in together is by the front door. This isn’t even a one-bedroom apartment. It’s a studio. A small studio.\n Alex points to a door next to his bed. “There’s the bathroom. You can put your stuff in the closet across from the kitchen.”\n I toss my duffel in the closet and walk farther into the apartment. “Um, Alex . . . where do you expect me to sleep?”\n “I borrowed a blow-up bed from Mandi.”\n “Está buena— she’s cute.” I check out the room again. In our house back in Chicago I shared a much smaller room with Alex and Luis. “Where’s the TV?” I ask. \n","sourceLink":"https://allnovel.net/rules-of-attraction-perfect-chemistry-2/page-1.html","bookId":2768,"book":{"id":2768,"title":"Rules of Attraction (Perfect Chemistry #2)","description":"Storyline: \n Rules of Attraction (Perfect Chemistry #2) \n When Carlos Fuentes returns to America after living in Mexico for a year, he doesn’t want any part of the life his older brother, Alex, has laid out for him at a high school in Colorado. Carlos likes living his life on the edge and wants to carve his own path—just like Alex did. Then he meets Kiara Westford. She doesn’t talk much and is completely intimidated by Carlos’ wild ways. As they get to know one another, Carlos assumes Kiara thinks she’s too good for him, and refuses to admit that she might be getting to him. But he soon realizes that being himself is exactly what Kiara needs right now.\n \n","cover":"https://allnovel.net/images/rules-of-attraction-perfect-chemistry-2.jpg","author":"Simone Elkeles","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/rules-of-attraction-perfect-chemistry-2.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 5:11:27 PM"}}
