{"id":86203,"no":36,"title":"Page 36","content":"“Follow me.” I peek my head out the door, then wave him over. I hide a laugh as he tiptoes toward me. Sometimes this kid acts like a six-year-old, and sometimes he acts like someone who has more sense than some adults I know.\n We step down the stairs in silence. Before we reach the kitchen, someone walks out of Westford’s office. It’s Kiara, wearing a long black dress that hugs her delicious curves from her chest to her thighs. Her hair is not only flowing down the front of her chest, the ends have been carefully and perfectly curled. One of her long, lean legs peeks out from the insanely sexy slit on the side.\n I’m stunned.\n I’m speechless.\n My eyes roam over her, enjoying the view. I know I’ll remember this moment for the rest of my life. When I look down at her sexy open-toe pumps with a higher heel than I ever imagined her wearing, my heart skips a beat. I’m afraid to blink for fear she’s a figment of my imagination and will disappear.\n “W-w-well, w-w-what d-d-do you think?”\n Brandon gives her a loud, “Shh,” and puts a finger over his mouth. “We’re on a secret mission,” he whispers loudly, oblivious that his sister has transformed into a goddess. “Don’t tell Mom or Dad.”\n “I won’t,” she whispers. “What are you on a mission for?”\n “Candy. The unhealthy kind. Come on!”\n I look back at Kiara, wishing we were alone right now. Really wishing we were alone right now. “Brandon, go check where your dad is so we know the coast is clear,” I tell him. I need a few minutes alone with his sister.\n “Okay,” he says, slithering out of the hall. “Be right back.”\n I’ve got less than a minute alone with her. I shove my hands in my pockets, to prevent me from showing my nervous, shaking hands. She rewards me with a half smile, then looks at the ground.\n I look up at the ceiling, wishing I could get some advice, or at least a sign from my dad. I take another look at Kiara. Oh, man. She’s staring right at me now, waiting for me to say something. Before I can come up with a meaningful or funny remark, Brandon comes back. “He’s in his den. Let’s do it before he catches us.”\n I choked. I’ve got to get Brandon out of here. We all head for the kitchen. I reach up and open the small cabinet door above the refrigerator. Sure enough, there’s a big basket filled with contraband.\n Brandon tugs on the bottom of my shirt. “Show me, show me.”\n I put the basket on the table. Brandon steps on a kitchen chair and checks out the loot. “Here,” he says, shoving a chocolate bar in my hand. “They have nuts. I don’t like nuts.”\n In the end, Brandon swipes one milk chocolate bar and two pieces of licorice. Satisfied with his treasure, he hops off the chair.\n I put the basket back in the secret hiding place that everyone knows about. When I turn back around, Brandon is already breaking off a piece of chocolate and shoving it in his mouth.\n “Kiara, why do you look like a girl?” Brandon asks with a mouthful of chocolate.\n “I’m going on a date. With Carlos.”\n “Are you gonna French-kiss him?”\n Kiara gives him a scolding look. “Brandon! That’s totally not an appropriate thing to ask. Who told you about that?”\n “The fourth graders on the bus.”\n “What did the fourth graders say it was?”\n He gives her an exasperated look. “You know . . .”\n “Tell me,” she says. “Maybe I don’t know.”\n I have firsthand knowledge that she does know what French kissing is, but I’m not giving her secret away.\n “It’s when you lick the other person’s tongue,” he whispers.\n Damn, the kid knows more than I did at his age. First he’s a cyber drug dealer, now he’s talking about French kissing. Kiara looks to me, but I hold my hands up. While I’d like nothing better than to French-kiss her right now, I can wait until later. “He’s not my kid.”\n “You can get a lot of germs that way,” he says as he munches away and contemplates the consequences of French kissing.\n “Absolutely,” Kiara agrees. “Right, Carlos?”\n “Right. Germs. Lots of ’em.” I don’t tell him that some girls’ germs are worth getting.\n “I’m never gonna do it,” he declares.\n “Nobody’s ever gonna want to do it with you, cachorro, if you don’t wipe your mouth after you eat chocolate. You’re disgustin’.”\n As Kiara reaches for a napkin and wipes Brandon’s face, he looks up at her curiously. “You never answered my question. Are you and Carlos going to French-kiss?”\n 48\n Kiara\n “Brandon, stop asking that or I’m telling Mom you just snuck chocolate without her permission.” I lean over and kiss his now-clean cheek. “But I still love you.”\n “Meanie,” Brandon says, but I know he isn’t upset, because he bounces out of the kitchen with a spring in his step.\n We’re alone at last. Carlos comes up from behind me and gently swipes my hair to the side, exposing my neck. “Eres hermosa,” he whispers into my ear. Just the sound of the Spanish words makes my insides feel like Jell-O.\n I twirl around and face him. “Thanks. I needed to hear that.”\n “I should go take a shower and get dressed, but I don’t want to stop lookin’ at you.”\n I push him away from me, even though I’m actually giddy because he can’t stop staring. “Go. I’m not missing my first high school dance.”\n Forty-five minutes later, I’m still standing in heels afraid to sit down and wrinkle my dress. My mom insisted on painting my fingernails pink, so I resist picking at them even though I can’t help fidgeting. We’re in the backyard, where my mom and dad are snapping picture after picture of me standing next to the house, next to a potted plant, next to my car, with Brandon, and the fence and . . .\n Carlos opens the sliding glass door and steps onto the patio. A black suit and white button-down shirt have replaced his ever-present T-shirt and ripped jeans. Just looking at him all dressed up for me makes my heart beat faster and my tongue feel thick and heavy. Especially when I see him holding a corsage in his hand.\n “Oh, you look so handsome. You’re sweet to take Kiara to Homecoming,” my mom says. “She’s always wanted to go.”\n “It’s not a problem,” Carlos says.\n I don’t interrupt and tell my mom that he asked me because we shook on it. I’m pretty sure if we hadn’t made a deal we wouldn’t be standing here in the nicest clothes we own.\n “Here,” Carlos says, holding out the corsage full of purple-and-white flowers with yellow centers.\n “Put it on her, Carlos,” my mom says excitedly as she holds up her camera.\n My dad makes my mom put the camera down. “Colleen, let’s go inside. I think we should give them a few minutes alone.”\n When my parents give us privacy, Carlos slips the corsage on my wrist. “I know it doesn’t match your dress,” he says shyly. “And it’s not roses like I’m sure you were expectin’. They’re Mexican asters. Every time you look at it tonight, I wanted it to remind you of me.”\n “They’re p-p-perfect,” I say, bringing the purple and white flowers to my nose so I can breathe in their sweet scent.\n On the patio table is the boutonniere I bought him. It’s a simple white rose with green leaves. I pick it up and hold it out to him. “I’m supposed to p-p-pin it to your lapel.”\n He moves closer. My hands are shaking as I take the big pin and try to put it on right. “Here, I’ll just do it,” he says as he watches me struggle to push the pin through the green florist tape on the bottom of the boutonniere. Our fingers touch and I can hardly breathe.\n After we suffer through a few pictures with my parents, clouds start forming overhead. “It’s supposed to rain tonight,” my mom says, then orders me to bring my taupe raincoat that doesn’t match my dress but repels water. Carlos seems excited to drive me in Alex’s car. He knew I’d think it was cool that we have matching cars.\n We drive up to the school parking lot ten minutes later, which is packed. But before we get to the doors, out of nowhere Nick Glass and two other big guys block our path. It’s obvious they’re not here to dance . . . they’re here to cause trouble.\n I grab on to Carlos’s arm, scared that he’ll get into another fight.\n “It’s okay,” he assures me softly. “Trust me, chica.”\n “This is my territory,” Nick says, stepping closer. “I’m not sharin’ it.”\n “I don’t want it,” Carlos tells him.\n “What’s the problem here?” Ram says, walking up to us with a girl who I don’t recognize. Ram and Carlos have become friends in school, and it’s nice to know someone is willing to stick his neck out for Carlos even though it’s Homecoming.\n “We’re cool, right, Nick?” Carlos asks.\n Nick looks from Carlos to Ram and back. Nick’s friends aren’t from Flatiron High. They look like guys who aren’t afraid to fight, but in the end Nick steps back and lets us through.\n Carlos grabs my hand and pushes past them without fear.\n “If you need me, Carlos, I’m here,” Ram tells him as we reach the front door to the school.\n “Same to you, man,” Carlos responds, then squeezes my hand. “If you want to go somewhere else, Kiara, I’m totally game.”\n I shake my head. “A deal’s a deal. I want the photographer to take a picture, so I can pin it to my corkboard over my desk as a reminder of my first school dance. Just promise me, no fights.”\n “Okay, chica. But after the picture, if you want to go somewhere else, just let me know.”\n “Where would we go?” I ask him.\n He looks around at the streamers and the posters and the students yelling and dancing to the loud music. He pulls me closer. “Somewhere quiet, where we can be alone. I don’t really feel like sharin’ you tonight.”\n The thing is, I don’t feel like sharing him, either.\n The photographer has us pose for pictures before we enter the gymnasium. Actually, he poses us, treating us like mannequins in a department store.\n “Want a drink?” Carlos asks, his arm around my waist pulling me close so I can hear him over the loud, pounding music.\n I shake my head, taking in the scene. Most of the girls are wearing really short dresses with frilly skirts that fly up when they twirl and dance. I look out of place in my long, black, form-fitting vintage dress.\n “Food?” he asks. “There’s pizza.”\n “Not yet.” I watch the other students dancing. Most of them are dancing in groups, jumping up and down to the loud music. Madison isn’t here. Lacey isn’t, either. Knowing that I won’t be the subject of their rude remarks tonight makes me let down my guard.\n He grabs my hand and leads me to the far corner of the gymnasium. “Let’s dance.”\n “You’re not one hundred percent yet. Let’s wait until there’s a slow dance. I don’t want you to hurt yourself.” \n","sourceLink":"https://allnovel.net/rules-of-attraction-perfect-chemistry-2/page-36.html","bookId":2768,"book":{"id":2768,"title":"Rules of Attraction (Perfect Chemistry #2)","description":"Storyline: \n Rules of Attraction (Perfect Chemistry #2) \n When Carlos Fuentes returns to America after living in Mexico for a year, he doesn’t want any part of the life his older brother, Alex, has laid out for him at a high school in Colorado. Carlos likes living his life on the edge and wants to carve his own path—just like Alex did. Then he meets Kiara Westford. She doesn’t talk much and is completely intimidated by Carlos’ wild ways. As they get to know one another, Carlos assumes Kiara thinks she’s too good for him, and refuses to admit that she might be getting to him. But he soon realizes that being himself is exactly what Kiara needs right now.\n \n","cover":"https://allnovel.net/images/rules-of-attraction-perfect-chemistry-2.jpg","author":"Simone Elkeles","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/rules-of-attraction-perfect-chemistry-2.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 5:11:27 PM"}}
