{"id":86210,"no":43,"title":"Page 43","content":"“Listen, old man,” the kid says lazily, then leans back and plants his dirty shoes on Carlos’s desk. “I don’t follow rules.”\\n\\n Old man? Doesn’t follow rules? Damn, this kid needs a good ass-kicking. Truth be told, Carlos did see a bit of his old, rebellious self in the kid. Dick was the best stand-in father Carlos could ever ask for back when he’d first come to Colorado . . . Hell, he’d called the Professor “Dad” even before he married Kiara, and couldn’t imagine how his life would have turned out without her father’s guidance.\\n\\n Carlos pushes Dylan’s feet off his desk, then thinks back to the time Kiara’s dad recited a speech similar to the one about to come out of his mouth. “Uno, no drugs or alcohol. Dos, no profanity. I have three daughters and a wife, so keep it clean. Tres, curfew on weekdays is ten thirty; on weekends it’s midnight. Cuatro, you’re expected to clean up after yourself and help around the house when asked, just like our own children. Cinco, there’s no TV unless you’re done with homework. Seis . . .” He couldn’t remember what his father-in-law’s sixth rule was, but it didn’t matter. Carlos had his own rule he wanted to make sure was stated loud and clear. “Dating Cecilia is out of the question, so don’t even think about it. Any questions?”\\n\\n “Yeah, one.” The delinquent leans forward and looks Carlos straight in the eye with a mischievous smirk. “What happens when I break one of your fuckin’ rules?”\\n\\n","sourceLink":"https://allnovel.net/rules-of-attraction-perfect-chemistry-2/page-43.html","bookId":2768,"book":{"id":2768,"title":"Rules of Attraction (Perfect Chemistry #2)","description":"Storyline: Rules of Attraction (Perfect Chemistry #2) \\n When Carlos Fuentes returns to America after living in Mexico for a year, he doesn’t want any part of the life his older brother, Alex, has laid out for him at a high school in Colorado. Carlos likes living his life on the edge and wants to carve his own path—just like Alex did. Then he meets Kiara Westford. She doesn’t talk much and is completely intimidated by Carlos’ wild ways. As they get to know one another, Carlos assumes Kiara thinks she’s too good for him, and refuses to admit that she might be getting to him. But he soon realizes that being himself is exactly what Kiara needs right now.\\n","cover":"https://allnovel.net/images/rules-of-attraction-perfect-chemistry-2.jpg","author":"Simone Elkeles","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/rules-of-attraction-perfect-chemistry-2.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 5:11:27 PM"}}
