{"id":16206,"no":17,"title":"CHAPTER XVI. ROSWELL CRAWFORD RETIRES FROM BUSINESS.","content":"\"Can you send this home for me?\" asked a lady in Hall \u0026 Turner\u0027s store about three o\u0027clock in the afternoon of the day on which Dick, as we have related, was arrested. \"Certainly, madam. Where shall it be sent?\" asked the clerk. \"No. 47 West Fortieth Street,\" was the reply. \"Very well, it shall be sent up immediately. Here, Roswell.\" Roswell Crawford came forward not very willingly. He had no great liking for the task which he saw would be required of him. Fortieth Street was at least a mile and a half distant, and he had already just returned from a walk in a different direction. Besides, the bundle was a large one, containing three dress patterns. He did not think it very suitable for a gentleman\u0027s son to be seen carrying such a large bundle through the streets. \"Why don\u0027t you send Edward?\" he said, complainingly. \"He doesn\u0027t do half as much as I.\" \"I shall send whom I please,\" said the clerk, sharply. \"You wouldn\u0027t do anything if you could help it.\" \"I won\u0027t carry bundles much longer,\" said Roswell. \"You put all the heaviest bundles off upon me.\" Roswell\u0027s back being turned, he did not observe Mr. Turner, who had come up as he was speaking. \"What are you complaining about?\" asked that gentleman. Roswell turned, and colored a little when he saw his employer. \"What is the matter?\" repeated Mr. Turner. \"Mr. Evans always gives me the largest bundles to carry,\" said Roswell. \"He is always complaining of having to carry bundles,\" said the clerk. \"He says it isn\u0027t suitable work for a gentleman\u0027s son.\" \"I have noticed it,\" said Mr. Turner. \"On the whole, I think, Mr. Crawford,\" he said, with mock deference, \"I think you have mistaken your vocation in entering a dry-goods store. I advise you to seek some more gentlemanly employment. At the end of the week, you are at liberty to leave my employment for one better suited to you.\" \"I\u0027m ready to go now,\" said Roswell, sulkily. \"Very well; if you desire it, I will not insist upon your remaining. If you will come up to the desk, you shall receive what is due you.\" It was somewhat humiliating to Roswell to feel that his services were so readily dispensed with. Still he had never liked the place, and heartily disliked carrying bundles. By going at once, he would get rid of the large bundle to be carried to West Fortieth Street. Congratulating himself, therefore, on the whole, on escaping from what he regarded as a degrading servitude, he walked up to the desk in a dignified manner, and received the wages due him. \"I hope you will find some more congenial employment,\" said Mr. Turner, who paid him the amount of his wages. \"I have no doubt I shall,\" said Roswell, loftily. \"My father was a gentleman, and our family has considerable influence.\" \"Well, I wish you success. Good-by.\" \"Good-by,\" said Roswell, and walked out of the shop with head erect. He did not quite like going home at once, as explanation would be rather awkward under the circumstances. He accordingly crossed over to Fifth Avenue, considering that the most suitable promenade for a gentleman\u0027s son. He could not help regarding with some envy the happy possessors of the elegant buildings which he passed. Why had partial Fate denied him that fortune which would have enabled him to live in this favored locality? \"Plenty of snobs have got money,\" he thought. \"How much better I could use it than they! I wish I were rich! You wouldn\u0027t catch me slaving my life out in a dry-goods store, or any other.\" This was undoubtedly true. Work of any kind had no charms for Roswell. To walk up the avenue swinging a dandy cane, dressed in the height of the fashion, or, what was better yet, sitting back luxuriously in an elegant carriage drawn by a dashing span; such was what he regarded himself most fit for. But, unfortunately, he was not very likely to realize his wishes. The desire to enjoy wealth doesn\u0027t bring it, and the tastes of a gentleman are not a very good stock to begin life with. So Roswell sauntered along in rather a discontented frame of mind until he reached Madison Park, where he sat down on a bench, and listlessly watched some boys who were playing there. \"Hallo, Roswell!\" said one of his acquaintances, coming up by chance. \"How do you happen to be here?\" \"Why shouldn\u0027t I be here?\" \"I thought you were in a store somewhere on Sixth Avenue.\" \"Well, I was, but I have left it.\" \"When did you leave it?\" \"To-day.\" \"Got sacked, hey?\" \"Sacked,\" in the New York vernacular, means discharged from a place. The idea of having it supposed that he had been \"sacked\" was not pleasing to Roswell\u0027s pride. He accordingly answered, \"I never was \u0027sacked\u0027 in my life. Besides, it\u0027s a low word, and I never use it.\" \"Well, you know what I mean. Did they turn you off?\" \"No, they didn\u0027t. They would have been glad to have me stay.\" \"Why didn\u0027t you then?\" \"I didn\u0027t like the business.\" \"Dry goods,—wasn\u0027t it?\" \"Yes, a retail dry-goods store. If I ever go into that line again, it\u0027ll be in a wholesale store. There\u0027s a chance there for a man to rise.\" \"You don\u0027t call yourself a man yet,—do you?\" \"I call myself a gentleman,\" said Roswell, shortly. \"What are you going to do now?\" \"I\u0027m in no hurry about a new place. I shall look round a little.\" \"Well, success to you. I must be getting back to the shop.\" \"What are you doing?\" \"I\u0027m learning a trade.\" \"Oh!\" said Roswell, turning up his nose slightly, which was quite easy for him to do, as nature had given that organ an upward turn. He thought all trades low, and resolved hereafter to hold as little communication as possible with the boy who had so far demeaned himself as to be learning one. That was worse than being in a dry-goods store, and carrying around bundles. Towards six o\u0027clock Roswell rose from his seat, and sauntered towards Clinton Place, which was nearly a mile distant. He entered the house a little before dinner. \"Are you not earlier than usual, Roswell?\" asked his mother. \"I\u0027ve left the store,\" he said, abruptly. \"Left the store!\" echoed his mother, in some dismay. \"Why?\" \"Because they don\u0027t know how to treat me. It\u0027s no fit place for a gentleman\u0027s son.\" \"I am sorry, Roswell,\" said Mrs. Crawford, who, like her son, was \"poor and proud,\" and found the four dollars he earned weekly of advantage. \"I\u0027m afraid you have been foolish.\" \"Listen, mother, and I\u0027ll tell you all about it,\" he said. Roswell gave his explanation, which, it need hardly be said, was very favorable to himself, and Mrs. Crawford was finally brought to believe that Hall \u0026 Turner were low people, with whom it was not suitable for one of her son\u0027s gentlemanly tastes to be placed. His vindication was scarcely over, when the bell rang, and his Cousin Gilbert was admitted. Mr. Gilbert entered briskly, and with a smiling face. He felt unusually complaisant, having succeeded in his designs against our hero. \"Well, James,\" said Mrs. Crawford, \"you look in better spirits than I feel.\" \"What\u0027s happened amiss?\" \"Roswell has given up his place.\" \"Been discharged, you mean.\" \"No,\" said Roswell, \"I left the place of my own accord.\" \"What for?\" \"I don\u0027t like the firm, nor the business. I wish I were in Mr. Rockwell\u0027s.\" \"Well,\" said Gilbert, \"perhaps I can get you in there.\" \"Has the boot-black left?\" \"He\u0027s found another place,\" said Gilbert, smiling at what he regarded as a good joke. \"You don\u0027t mean to say he has left a place where he was earning ten dollars a week?\" said Mrs. Crawford, in surprise. \"Where is this new place that you speak of?\" \"In the station-house.\" \"Is he in the station-house?\" asked Roswell, eagerly. \"That is what I hear.\" \"What\u0027s he been doing?\" \"Charged with picking a pocket.\" \"Well, I do hope Mr. Rockwell will now see his folly in engaging a boy from the streets,\" said Mrs. Crawford, charitably concluding that there was no doubt of our hero\u0027s guilt. \"What\u0027ll be done with him, Cousin James?\" asked Roswell. \"He\u0027ll be sent to the Island, I suppose.\" \"He may get clear.\" \"I think not. Circumstances are very much against him, I hear.\" \"And will you try to get me in, Cousin James?\" \"I\u0027ll do what I can. Perhaps it may be well for you to drop in to-morrow about ten o\u0027clock.\" \"All right,—I\u0027ll do it.\" Both Mrs. Crawford\u0027s and Roswell\u0027s spirits revived wonderfully, and Mr. Gilbert, too, seemed unusually lively. And all because poor Dick had got into difficulties, and seemed in danger of losing both his place and his good name. \"It\u0027s lucky I left Hall \u0026 Turner\u0027s just as I did!\" thought Roswell, complacently. \"May be they\u0027d like to engage the boot-black when he gets out of prison. But I guess he\u0027ll have to go back to blacking boots. That\u0027s what he\u0027s most fit for.\"","sourceLink":"http://novel.tingroom.com/ertong/2965/81617.html","bookId":383,"book":{"id":383,"title":"Fame and Fortune or, The Progress of Richard Hunter","description":"简介： Fame and Fortune, like its predecessor, Ragged Dick, was contributed as a serial story to the Schoolmate, a popular juvenile magazine published in Boston. The generous commendations of the first volume by the Press, and by private correspondents whos...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2965","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
