{"id":16208,"no":19,"title":"CHAPTER XVIII. THE CUP AND THE LIP.","content":"While Dick\u0027s night preceding the trial was an anxious one, Gilbert and Roswell Crawford passed a pleasant evening, and slept soundly. \"Do you think Mr. Rockwell would be willing to give me the same wages he has paid to the boot-black?\" he inquired with interest. \"Perhaps he won\u0027t take you at all.\" \"I think he ought to pay some attention to your recommendation,\" said Mrs. Crawford. \"You ought to have some influence with him.\" \"Of course,\" said Gilbert, \"I shall do what I can in the matter; but it\u0027s a pity Roswell can\u0027t give better references.\" \"He\u0027s never been with a decent employer yet. He\u0027s been very unlucky about his places,\" said Mrs. Crawford. She might have added that his employers had considered themselves unfortunate in their engagement of her son; but, even if she had known it, she would have considered that they were prejudiced against him, and that they were in fault entirely. \"I will do what I can for him,\" continued Gilbert; \"but I am very sure he won\u0027t get as much as ten dollars a week.\" \"I can earn as much as the boot-black, I should hope,\" said Roswell. \"He didn\u0027t earn ten dollars a week.\" \"He got it.\" \"That\u0027s a very different thing.\" \"Well, if I get it, I don\u0027t care if I don\u0027t earn it.\" \"That\u0027s true enough,\" said Gilbert, who did not in his heart set a very high estimate upon the services of his young cousin, and who, had the business been his own, would certainly not have engaged him at any price. Roswell thought it best not to say any more, having on some previous occasions been greeted with remarks from his cousin which could not by any means be regarded as complimentary. \"Do you think I had better come in at ten o\u0027clock, Cousin James?\" inquired Roswell, as breakfast was over, and Gilbert prepared to go to the counting-room. \"Well, perhaps you may come a little earlier, say about half-past nine,\" said the book-keeper. \"All right,\" said Roswell. Being rather sanguine, he made up his mind that he was going to have the place, and felt it difficult to keep his good fortune secret. Now, in the next house there lived a boy named Edward McLean, who was in a broker\u0027s office in Wall Street, at a salary of six dollars a week. Now, though Edward had never boasted of his good fortune, it used to disturb Roswell to think that his place and salary were so much superior to his own. He felt that it was much more respectable to be in a broker\u0027s office, independent of the salary, than to run around the city with heavy bundles. But if he could enter such an establishment as Rockwell \u0026 Cooper\u0027s, at a salary of ten dollars, he felt that he could look down with conscious superiority upon Edward McLean, with his six dollars a week. He went over to his neighbor\u0027s, and found Edward just starting for Wall Street. \"How are you, Roswell?\" said Edward. \"Pretty well. Are you going down to the office?\" \"Yes.\" \"You\u0027ve got a pretty good place,—haven\u0027t you?\" \"Yes, I like it.\" \"How much do you get?\" \"Six dollars a week.\" \"That\u0027s very fair,\" said Roswell, patronizingly. \"How do you like your place?\" asked Edward. \"I believe you\u0027re in a dry-goods store on Sixth Avenue.\" \"Oh, no,\" said Roswell. \"You were?\" \"Yes, I went in temporarily to oblige them,\" said Roswell, loftily; \"but, of course, I wouldn\u0027t engage to remain any length of time in such a place, however large the inducements they might offer.\" Considering Roswell\u0027s tone, it would hardly have been supposed that the large inducements were four dollars a week, and that, even at that compensation, his services were not desired. \"Then it wasn\u0027t a good place?\" said Edward. \"Well enough for such as liked it,\" said Roswell. \"I have no complaint of Hall \u0026 Turner. I told them that it was not dissatisfaction with them that led me to leave the place, but I preferred a different kind of business.\" \"Have you got another place?\" \"I have an offer under consideration,\" said Roswell, consequentially; \"one of the most solid firms in the city. They offer me ten dollars a week.\" \"Ten dollars a week!\" repeated Edward, somewhat staggered by the statement. \"That\u0027s big pay.\" \"Yes,\" said Roswell; \"but I think I ought to get as much as that.\" \"Why, I thought myself lucky to get six dollars,\" said Edward. \"Yes, that\u0027s very fair,\" said Roswell, condescendingly. \"In fact, I\u0027ve worked at that figure myself; but, of course, one expects more as he grows older.\" \"I suppose you\u0027ll accept your offer,\" said Edward. \"I haven\u0027t quite made up my mind,\" said Roswell, carelessly. \"I think I shall.\" \"You\u0027d better. Such places don\u0027t grow on every bush.\" Though Edward did not more than half believe Roswell\u0027s statement, he kept his disbelief to himself, feeling that it was a matter of indifference to him whether Roswell received a large or small salary. \"I must be going down to the office,\" he said. \"Good-morning.\" \"Good-morning,\" said Roswell, and he re-entered the house, feeling that he had impressed Edward with a conviction of his superiority, and the value set upon his services by the business men of New York. He went upstairs, and picked out a flashy necktie from his drawer, tied it carefully before the glass, and about nine set out for Rockwell \u0026 Cooper\u0027s warehouse. It is necessary for us to precede him. Gilbert reached the counting-room at the usual time. His thoughts on the way thither were pleasant. \"I shan\u0027t be subjected to that young rascal\u0027s impertinence,\" he considered. \"That\u0027s one satisfaction.\" His astonishment, nay, dismay, may be imagined, therefore, when, on entering the counting-room, the first object his eyes rested on was the figure of Dick. \"Good-morning, Mr. Gilbert,\" said our hero, pleasantly. \"How came you here?\" he demanded. \"I walked,\" said Dick. \"I don\u0027t often ride. I think walkin\u0027s good for the constitution.\" \"You know what I mean, well enough. How did you get out of prison?\" \"I haven\u0027t been there.\" \"You were arrested for picking a man\u0027s pocket yesterday afternoon,\" said Gilbert. \"Excuse me, Mr. Gilbert, you\u0027re slightly mistaken there. I was arrested on suspicion of picking a man\u0027s pocket.\" \"The same thing.\" \"Not quite, as it has been proved that I was innocent, and the wallet was taken by another boy.\" \"Have you been tried?\" \"Yes, and acquitted.\" Gilbert looked and felt disappointed. He could not conceive how Dick could have escaped when the plot to entrap him had been so artfully contrived. \"Well, young man,\" he said, \"I\u0027ll give you a piece of advice, and if you\u0027re wise you\u0027ll follow it.\" \"That\u0027s kind in you,\" said Dick. \"I pass over your impertinence this time, and will advise you as a friend to resign your situation before Mr. Rockwell comes.\" \"Why should I?\" \"It\u0027ll save your being discharged.\" \"Do you think he\u0027ll discharge me?\" \"I know he will. He won\u0027t have any one in his employ who has been arrested for picking pockets.\" \"Not even if he didn\u0027t do it?\" \"Not even if he was lucky enough to get off,\" said Gilbert. \"You think I\u0027d better give up my place?\" \"That\u0027ll be the best course for you to pursue.\" \"But how\u0027ll I get another place?\" \"I\u0027ll do what I can to help you to another place if you leave at once.\" \"I think I\u0027ll wait and see Mr. Rockwell first.\" \"I\u0027ll make all the necessary explanations to Mr. Rockwell,\" said the book-keeper. \"I think I\u0027d rather see him myself, if it doesn\u0027t make any difference to you.\" \"You\u0027re acting like a fool. You\u0027ll only be kicked out of the store. If you don\u0027t follow my advice, I shan\u0027t interest myself in getting you another place.\" \"Do you think I took the wallet, Mr. Gilbert?\" asked Dick. \"Of course I do.\" \"Then how could you recommend me to another place?\" \"Because I think this may prove a lesson to you. You\u0027ve been lucky enough to escape this time, but you can\u0027t expect it always.\" \"I\u0027m much obliged to you for your favorable opinion; but I don\u0027t think I shall resign at once.\" At this moment Mr. Rockwell entered the warehouse. He had been informed of Dick\u0027s misfortune by Mr. Murdock, who had had occasion to call at his house on his way from the trial. \"How\u0027s this, Richard?\" he said, advancing, with a frank smile. \"I hear you got into strange quarters last night.\" \"Yes,\" said Dick; \"but I didn\u0027t like it well enough to stay long.\" \"Why didn\u0027t you send for me?\" \"Thank you, sir, I didn\u0027t like to trouble you. Mr. Murdock was very kind.\" \"Have they got the real thief?\" \"I don\u0027t know, sir.\" \"Well, \u0027all\u0027s well that ends well.\u0027 You can afford to laugh at it now.\" Mr. Gilbert listened to this colloquy with very little satisfaction. It seemed to show such a good understanding between Dick and his employer that he perceived that it would be a very difficult thing to supersede him. \"Mr. Rockwell seems to be infatuated with that boy,\" he muttered to himself. \"I think I won\u0027t resign just yet,\" said Dick, in a low voice, to the book-keeper. \"You\u0027ll be found out some day,\" said Gilbert, snappishly. \"Go to the post-office, and mind you don\u0027t stop to play on the way.\" Dick started on his errand, and, in passing out into the street, encountered Roswell Crawford, who, attired with extra care, had just come down the street from Broadway. On seeing Dick, he started as if he had seen a ghost. \"Good-morning, Roswell,\" said Dick, pleasantly. \"Good-morning,\" said Roswell, stiffly. \"Your cousin is in the counting-room. I am in a hurry, and must leave you.\" \"I thought he was on his way to the Island by this time,\" thought Roswell, perplexed. \"What can it mean?\" It occurred to him all at once that Dick might just have been discharged, and this thought cheered him up considerably. He entered the counting-room with a jaunty step. \"Good-morning, Cousin James,\" he said. Gilbert turned round, and said, in a surly tone, \"You may as well take yourself off. There\u0027s no chance for you here.\" \"Hasn\u0027t the boot-black been discharged?\" \"No; and isn\u0027t going to be.\" \"How is that?\" asked Roswell, looking very much disappointed. \"I can\u0027t stop to tell you now. You\u0027d better go now, and I\u0027ll tell you this evening.\" \"Just my luck!\" said Roswell to himself, considerably crest-fallen. \"I wish I hadn\u0027t said a word to Edward McLean about the place.\"","sourceLink":"http://novel.tingroom.com/ertong/2965/81619.html","bookId":383,"book":{"id":383,"title":"Fame and Fortune or, The Progress of Richard Hunter","description":"简介： Fame and Fortune, like its predecessor, Ragged Dick, was contributed as a serial story to the Schoolmate, a popular juvenile magazine published in Boston. The generous commendations of the first volume by the Press, and by private correspondents whos...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2965","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
