{"id":16211,"no":22,"title":"CHAPTER XXI. IDA GREYSON\u0027S PARTY.","content":"When Dick and his friend reached Mr. Greyson\u0027s house, two carriages stood before the door, from each of which descended young guests, who, like themselves, had been invited to the party. One of these brought two young girls of twelve, the other two boys of twelve and fourteen, and their sister of ten. Entering with this party, the two boys felt less embarrassed than if they had been alone. The door was opened by a servant, who said, \"Young ladies\u0027 dressing-room, second floor, left-hand room. Young gentlemen\u0027s dressing-room opposite.\" Following directions, the boys went upstairs and entered a spacious chamber, where they deposited their outer garments, and had an opportunity to arrange their hair and brush their clothes. \"Is your sister here this evening?\" asked one of the boys, addressing Dick. \"No,\" said Dick, soberly; \"she couldn\u0027t come.\" \"I\u0027m sorry for that. She promised to dance with me the first Lancers.\" \"Wouldn\u0027t I do as well?\" asked Dick. \"I don\u0027t think you would,\" said the other, laughing. \"But I\u0027ll tell you what,—you shall dance with my sister.\" \"I will, with pleasure,\" said Dick, \"if you\u0027ll introduce me.\" \"Why, I thought you knew her,\" said the other, in surprise. \"Perhaps I did,\" said Dick; \"but I exchanged myself off for another boy just before I came, and that makes a difference, you know. I shouldn\u0027t have known you, if you hadn\u0027t spoken to me.\" \"Do you know me now?\" asked the other boy, beginning to understand that he had made a mistake. \"You live on Twenty-First Street,—don\u0027t you?\" \"Yes,\" was the unexpected reply, for Dick had by a curious chance guessed right. \"You\u0027re Henry Cameron, after all.\" \"No,\" said Dick; \"my name is Richard Hunter.\" \"And mine is Theodore Selden; but I suppose you knew that, as you knew where I live. If you\u0027re ready, we\u0027ll go downstairs.\" \"Come, Fosdick,\" said Dick. \"We\u0027re going to have the Lancers first,\" said Theodore. \"Ida told my sister so. Have you a partner engaged?\" \"No.\" \"Then I\u0027ll introduce you to my sister. Come along.\" I may explain here that Dick, and Fosdick also, had several times danced the Lancers in the parlor at the boarding-house in the evening, so that they felt reasonably confident of getting through respectably. Still his new friend\u0027s proposal made Dick feel a little nervous. He was not bashful with boys, but he had very little acquaintance with girls or young ladies, and expected to feel ill at ease with them. Still he could not think of a good reason for excusing himself from the promised introduction, and, after going up to Ida in company with his new friend, and congratulating her on her birthday (he would not have known how to act if Theodore had not set him an example), he walked across the room to where one of the young ladies who had entered at the time he did was seated. \"Alice,\" said Theodore, \"this is my friend Mr. Hunter, who would like to dance with you in the first Lancers.\" Dick bowed, and Alice, producing a card, said, \"I shall be most happy. Will Mr. Hunter write his name on my card?\" Dick did so, and was thankful that he could now write a handsome hand. \"Now,\" said Theodore, unceremoniously, \"I\u0027ll leave you two to amuse each other, while I go off in search of a partner.\" \"I\u0027m in for it,\" thought Dick, seating himself on the sofa beside Alice. \"I wish I knew what to say.\" \"Do you like the Lancers?\" inquired the young lady. \"Yes, I like it,\" said Dick, \"but I haven\u0027t danced it much. I\u0027m afraid I shall make some mistakes.\" \"I\u0027ve no doubt we shall get along well,\" said Alice. \"Where did you learn?\" \"I learned at home,\" said Dick. \"I thought I had not met you at Dodworth\u0027s. I attended dancing school there last winter.\" \"No,\" said Dick; \"I never took lessons.\" \"Don\u0027t you like Ida Greyson?\" inquired Alice. \"Yes, I like her very much,\" said Dick, sincerely. \"She\u0027s a sweet girl. She\u0027s a very intimate friend of mine. Who is that boy that came into the room with you?\" \"His name is Henry Fosdick.\" \"He\u0027s going to dance with Ida. Come, let us hurry and get in the same set.\" Dick offered his arm, and, as the sets were already being formed, led his partner to the upper end of the room, where they were just in time to get into the same set with Ida. Theodore, with a girl about his own age, had already taken his position opposite Dick. Fosdick and Ida were the first couple, and opposite them Isaac and Isabella Selden, cousins of Theodore and Alice. They had scarcely taken their places when the music struck up. Dick felt a little flustered, but determined to do his best. Being very quick in learning figures, and naturally gracefully in his movements, he got through very creditably, and without a mistake. \"I thought you expected to make mistakes,\" said Alice Selden, as Dick led her back to her seat. \"I think you dance very well.\" \"It was because I had such a good partner,\" said Dick. \"Thank you for the compliment,\" said Alice, courtesying profoundly. \"Seems to me you\u0027re very polite, Alice,\" said Theodore, coming up. \"Mr. Hunter was paying me a compliment,\" said Alice. \"I wish you\u0027d tell me how,\" said Theodore to Dick. \"I wish he would,\" interrupted Alice. \"All your compliments are of the wrong kind.\" \"It isn\u0027t expected that brothers should compliment their sisters,\" said Theodore. Mrs. Greyson came into the room during the dancing, and was pleased to see that Dick and Henry Fosdick, instead of sitting awkwardly in the corner, were taking their part in the evening\u0027s amusement. Dick made an engagement with Alice for another dance later in the evening, but danced the second with Ida Greyson, with whom, by this time, he felt very well acquainted. \"I didn\u0027t know you knew Alice Selden,\" said Ida. \"Where did you meet her?\" \"Her brother Theodore introduced me this evening. I did not know her before.\" \"You haven\u0027t been here lately, Dick,\" said Ida, familiarly. \"No,\" said he. \"It\u0027s because I\u0027ve been very busy.\" \"You don\u0027t work in the evening,—do you?\" \"I study in the evening.\" \"What do you study, Dick?\" \"French, for one thing.\" \"Can you speak French?\" \"A little. Not much.\" \"I\u0027m going to try you \u0027Comment vous portez-vous, monsieur?\u0027\" \"\u0027Très bien, mademoiselle. Et vous?\u0027\" \"That\u0027s right,\" said Ida, gravely. \"I can\u0027t talk much yet myself. Who teaches you?\" \"I have a private teacher.\" \"So have I. She comes twice a week. When I don\u0027t know my lesson, she boxes my ears. Is your teacher cross?\" \"No,\" said Dick, laughing. \"He doesn\u0027t box my ears.\" \"That\u0027s because you\u0027re so large. I wish I could have you for my teacher. I\u0027d ask papa, if you could only speak it like a native.\" \"So I can,\" said Dick. \"You can, really?\" \"Yes, like a native of New York.\" Ida laughed, and was afraid that wouldn\u0027t do. When the dance was over, and Dick was leading Ida to her seat, a surprise awaited him. A boy came forward hastily, and said in a tone blending amazement with gratification, \"Is it possible that this is Dick Hunter?\" \"Frank Whitney!\" exclaimed Dick, clasping his hand cordially. \"How came you here?\" \"Just the question I was going to ask you, Dick. But I\u0027ll answer first. I am spending a few days with some cousins in Thirty-Seventh Street. They are friends of the Greysons, and were invited here this evening, and I with them. I little dreamed of meeting you here. I must say, Dick, you seem quite at home.\" \"Mr. Greyson has been a kind friend of mine,\" said Dick, \"and I\u0027ve met Ida quite often. But I felt a little nervous about coming to this party. I was afraid I\u0027d be like a cat in a strange garret.\" \"You\u0027re a wonderful boy, Dick. You look as if you had been used to such scenes all your life. I can hardly believe you\u0027re the same boy I met in front of the Astor House a little more than a year ago.\" \"If I\u0027m changed, it\u0027s because of what you said to me then, you and your father. But for those words I might still have been Ragged Dick.\" \"I\u0027m glad to hear you say that, Dick; but, for all that, a great deal of credit is due to yourself.\" \"I\u0027ve worked hard,\" said Dick, \"because I felt that I had something to work for. When are you going to enter college?\" \"I expect to apply for admission in about two months.\" \"At Columbia College?\" \"Yes.\" \"I am glad of that. I shall hope to see you sometimes.\" \"You will see me often, Dick.\" Here the music struck up, and the boys parted. It is unnecessary to speak farther of the events of the evening. Dick made several other acquaintances, and felt much more at ease than he had anticipated. He returned home, feeling that his first party had been a very agreeable one, and that he had on the whole appeared to advantage. \n \n","sourceLink":"http://novel.tingroom.com/ertong/2965/81622.html","bookId":383,"book":{"id":383,"title":"Fame and Fortune or, The Progress of Richard Hunter","description":"简介： Fame and Fortune, like its predecessor, Ragged Dick, was contributed as a serial story to the Schoolmate, a popular juvenile magazine published in Boston. The generous commendations of the first volume by the Press, and by private correspondents whos...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2965","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
