{"id":16193,"no":4,"title":"CHAPTER III. AT THE POST-OFFICE.","content":"The New York Post-Office is built of brick, and was formerly a church. It is a shabby building, and quite unworthy of so large and important a city. Of course Dick was quite familiar with its general appearance; but as his correspondence had been very limited, he had never had occasion to ask for letters. There were several letters in Box 5,670. Dick secured these, and, turning round to go out, his attention was drawn to a young gentleman of about his own age, who, from his consequential air, appeared to feel his own importance in no slight degree. He recognized him at once as Roswell Crawford, a boy who had applied unsuccessfully for the place which Fosdick obtained in Henderson\u0027s hat and cap store. Roswell recognized Dick at the same time, and perceiving that our hero was well-dressed, concluded to speak to him, though he regarded Dick as infinitely beneath himself in the social scale, on account of his former employment. He might not have been so condescending, but he was curious to learn what Dick was about. \"I haven\u0027t seen you for some time,\" he said, in a patronizing tone. \"No,\" said Dick, \"and I haven\u0027t seen you for some time either, which is a very curious coincidence.\" \"How\u0027s boot-blacking, now?\" inquired Roswell, with something of a sneer. \"Tip-top,\" said Dick, not at all disturbed by Roswell\u0027s manner. \"I do it wholesale now, and have been obliged to hire a large building on Pearl Street to transact my business in. You see them letters? They\u0027re all from wholesale customers.\" \"I congratulate you on your success,\" said Roswell, in the same disagreeable manner. \"Of course that\u0027s all humbug. I suppose you\u0027ve got a place.\" \"Yes,\" said Dick. \"Who are you with?\" \"Rockwell \u0026 Cooper, on Pearl Street.\" \"How did you get it?\" asked Roswell, appearing surprised. \"Did they know you had been a boot-black?\" \"Of course they did.\" \"I shouldn\u0027t think that they would have taken you.\" \"Why not?\" \"There are not many firms that would hire a boot-black, when they could get plenty of boys from nice families.\" \"Perhaps they might have secured your services if they had applied,\" said Dick, good-humoredly. \"I\u0027ve got a place,\" said Roswell, in rather an important manner. \"I\u0027m very glad I didn\u0027t go into Henderson\u0027s hat and cap store. I\u0027ve got a better situation.\" \"Have you?\" said Dick. \"I\u0027m glad to hear it. I\u0027m always happy to hear that my friends are risin\u0027 in the world.\" \"You needn\u0027t class me among your friends,\" said Roswell, superciliously. \"No, I won\u0027t,\" said Dick. \"I\u0027m goin\u0027 to be particular about my associates, now that I\u0027m gettin\u0027 up in the world.\" \"Do you mean to insult me?\" demanded Roswell, haughtily. \"No,\" said Dick. \"I wouldn\u0027t on any account. I should be afraid you\u0027d want me to fight a duel, and that wouldn\u0027t be convenient, for I haven\u0027t made my will, and I\u0027m afraid my heirs would quarrel over my extensive property.\" \"How much do you get a week?\" asked Roswell, thinking it best to change the subject. \"Ten dollars,\" said Dick. \"Ten dollars!\" ejaculated Roswell. \"That\u0027s a pretty large story.\" \"You needn\u0027t believe it if you don\u0027t want to,\" said Dick. \"That won\u0027t make any difference to me as long as they pay me reg\u0027lar.\" \"Ten dollars! Why, I never heard of such a thing,\" exclaimed Roswell, who only received four dollars a week himself, and thought he was doing well. \"Do you think I\u0027d give up a loocrative business for less?\" asked Dick. \"How much do you get?\" \"That\u0027s my business,\" said Roswell, who, for reasons that may be guessed, didn\u0027t care to mention the price for which he was working. Judging Dick by himself, he thought it would give him a chance to exult over him. \"I suppose it is,\" said Dick; \"but as you was so partic\u0027lar to find out how much I got, I thought I\u0027d inquire.\" \"You\u0027re trying to deceive me; I don\u0027t believe you get more than three dollars a week.\" \"Don\u0027t you? Is that what you get?\" \"I get a great deal more.\" \"I\u0027m happy to hear it.\" \"I can find out how much you get, if I want to.\" \"You\u0027ve found out already.\" \"I know what you say, but I\u0027ve got a cousin in Rockwell \u0026 Cooper\u0027s.\" \"Have you?\" asked Dick, a little surprised. \"Who is it?\" \"It is the book-keeper.\" \"Mr. Gilbert?\" \"Yes; he has been there five years. I\u0027ll ask him about it.\" \"You\u0027d better, as you\u0027re so anxious to find out. Mr. Gilbert is a friend of mine. He spoke only this morning of my valooable services.\" Roswell looked incredulous. In fact he did not understand Dick at all; nor could he comprehend his imperturbable good-humor. There were several things that he had said which would have offended most boys; but Dick met them with a careless good-humor, and an evident indifference to Roswell\u0027s good opinion, which piqued and provoked that young man. It must not be supposed that while this conversation was going on the boys were standing in the post-office. Dick understood his duty to his employers too well to delay unnecessarily while on an errand, especially when he was sent to get letters, some of which might be of an important and urgent nature. The two boys had been walking up Nassau Street together, and they had now reached Printing House Square. \"There are some of your old friends,\" said Roswell, pointing to a group of ragged boot-blacks, who were on the alert for customers, crying to each passer, \"Shine yer boots?\" \"Yes,\" said Dick, \"I know them all.\" \"No doubt,\" sneered Roswell. \"They\u0027re friends to be proud of.\" \"I\u0027m glad you think so,\" said Dick. \"They\u0027re a rough set,\" he continued, more earnestly; \"but there\u0027s one of them, at least, that\u0027s ten times better than you or I.\" \"Speak for yourself, if you please,\" said Roswell, haughtily. \"I\u0027m speakin\u0027 for both of us,\" said Dick. \"There\u0027s one boy there, only twelve years old, that\u0027s supported his sick mother and sister for more\u0027n a year, and that\u0027s more good than ever you or I did.—How are you, Tom?\" he said, nodding to the boy of whom he had spoken. \"Tip-top, Dick,\" said a bright-looking boy, who kept as clean as his avocation would permit. \"Have you given up business?\" \"Yes, Tom. I\u0027ll tell you about it some other time. I must get back to Pearl Street with these letters. How\u0027s your mother?\" \"She aint much better, Dick.\" \"Buy her some oranges. They\u0027ll do her good,\" and Dick slipped half a dollar into Tom\u0027s hand. \"Thank you, Dick. She\u0027ll like them, I know, but you oughtn\u0027t to give so much.\" \"What\u0027s half a dollar to a man of my fortune?\" said Dick. \"Take care of yourself, Tom. I must hurry back to the store.\" Roswell was already gone. His pride would not permit him to stand by while Dick was conversing with a boot-black. He felt that his position would be compromised. As for Dick, he was so well dressed that nobody would know that he had ever been in that business. The fact is, Roswell, like a great many other people, was troubled with a large share of pride, though it might have puzzled himself to explain what he had to be proud of. Had Dick been at all like him he would have shunned all his former acquaintances, and taken every precaution against having it discovered that he had ever occupied a similar position. But Dick was above such meanness. He could see that Tom, for instance, was far superior in all that constituted manliness to Roswell Crawford, and, boot-black though he was, he prepared to recognize him as a friend. When Dick reached the store, he did not immediately see Mr. Rockwell. He accordingly entered the counting-room where Gilbert, the book-keeper, was seated at a desk. \"Here are the letters, Mr. Gilbert,\" said Dick. \"Lay them down,\" said the book-keeper, sourly. \"You\u0027ve been gone long enough. How many did you drop on the way?\" \"I didn\u0027t know I was expected to drop any,\" said Dick. \"If I had been told to do so, I would have obeyed orders cheerfully.\" Mr. Gilbert was about to remark that Dick was an impudent young rascal, when the sudden entrance of Mr. Rockwell compelled him to suppress the observation, and he was obliged to be content with muttering it to himself. \"Back already, Richard?\" said his employer, pleasantly. \"Where are the letters?\" \"Here, sir,\" said Dick. \"Very well, you may go to Mr. Murdock, and see what he can find for you to do.\" Mr. Rockwell sat down to read his letters, and Dick went as directed to the head clerk. \"Mr. Rockwell sent me to you, Mr. Murdock,\" he said. \"He says you will find something for me to do.\" \"Oh, yes, we\u0027ll keep you busy,\" said the head clerk, with a manner very different from that of the book-keeper. \"At present, however, your duties will be of rather a miscellaneous character. We shall want you partly for an entry clerk, and partly to run to the post-office, bank, and so forth.\" \"All right, sir,\" said Dick. \"I\u0027m ready to do anything that is required of me. I want to make myself useful.\" \"That\u0027s the right way to feel, my young friend. Some boys are so big-feeling and put on so many airs, that you\u0027d think they were partners in the business, instead of beginning at the lowest round of the ladder. A while ago Mr. Gilbert brought round a cousin of his, about your age, that he wanted to get in here; but the young gentleman was altogether too lofty to suit me, so we didn\u0027t take him.\" \"Was the boy\u0027s name Roswell Crawford?\" \"Yes; do you know him?\" \"Not much. He thinks I\u0027m too far beneath him for him to associate with, but he was kind enough to walk up Nassau Street with me this morning, just to encourage me a little.\" \"That was kind in him, certainly,\" said the head clerk, smiling. \"Unless I am very much mistaken, you will be able to get along without his patronage.\" \"I hope so,\" said Dick. The rest of the day Dick was kept busy in various ways. He took hold with a will, and showed himself so efficient that he made a favorable impression upon every one in the establishment, except the book-keeper. For some reason or other Mr. Gilbert did not like Dick, and was determined to oust him from his situation if an opportunity should offer. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2965/81604.html","bookId":383,"book":{"id":383,"title":"Fame and Fortune or, The Progress of Richard Hunter","description":"简介： Fame and Fortune, like its predecessor, Ragged Dick, was contributed as a serial story to the Schoolmate, a popular juvenile magazine published in Boston. The generous commendations of the first volume by the Press, and by private correspondents whos...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2965","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
