{"id":66110,"no":22,"title":"Page 22","content":"She continued her everyday chores, helping with the gathering of plants, accompanying Alys to births and deaths. Sometimes Alys sent her alone to tend a simple cough or fever or rash. The old woman was increasingly bent over, and her walking now was slow. Her eyesight was dimmed. She needed more rest. Claire teased her gently and told her that she should train to climb out. “Look how strong Einar has made me!” she said, and held out her bare arm, tightening the muscles with pride. Each evening, after she had cleaned up the hut from dinner and while Alys sat knitting in her rocker, Claire took up her position, lying on her side on a mat near the wall, and breathed deeply. Then, legs straight, she raised her body on one arm, held herself there, hovering, and then eased herself slowly down. Again and again. First one arm. Then the other. Her sack of rocks was so heavy now that an ordinary person groaned, trying to lift it. But for Claire it was easy. She swung it onto her back each day and wore it while she tended the garden or gathered the herbs. She ran up and down the hill path with the sack on her back and another in her arms. Steep, rutted places that had once made her stumble and slip were now familiar and easy. He had her run the path at night. Things felt different in the dark. She trained her feet and hands to know the shapes of things and her mind to sense when she neared an edge and must back away lest she fall. He wanted to blindfold her so that she could practice the dark in daytime. But she said no. “I’ll do it at night, even in the middle of the night, when there’s no moon and when it’s bitter cold. But I can’t have something tied over my eyes. It’s like being on the sea. It’s a fearsome memory that I can’t—” She turned away and couldn’t finish. But he seemed to understand. “You must learn the dark, though,” he told her. “Part of the climbing out will be in dark. You’ll start before the sun comes up.” “Why?” “It’s too long a climb to do it all in daylight. If you wait and go at dawn, at sunup, then the dark part will come near the top. You’ll be making your way up and around places where a mistake will bring death on you. I’ll teach you to feel every bit with your feet, but even so you’ll need your eyes as you near the top.” Together they looked up at the shadowy cliff. Claire had to lean back to see the top. Mist swirled there and she could see hawks circling. He had said he would teach her to feel with her feet, and after some time she became aware, amused by it, that even her toes were supple now. With astonishment she realized that she could perceive the smallest of pebbles—and pick them up, if need be, with individual toes. She could grasp a twig between the third and fourth toe of her left foot, or carefully feel her way around the sharp edge of a flat rock by her right big toe, which was as sensitive now as a fingertip. She told this to Einar with delight. “Imagine that!” she said. “Toes!” He nodded in agreement but looked sad. “What’s wrong?” she asked him. But he turned away and didn’t reply. Guiltily she realized it had been cruel to be so gleeful over the strength and agility of her feet to someone who had lost his own. Eleven Twins! Two boys with bright red hair. Bryn, exhausted as she was, lay laughing at the surprise and the sight of them. Claire held one in each arm and then laughed herself as she realized she was raising and lowering them slightly, the same way Einar had her raise and lower heavy rocks to strengthen her forearms. It was almost winter again. She moved Yellow-wing’s cage indoors. It had hung all summer and into autumn from a tree branch in the dooryard. Now, in the warmth, he fluffed his wings and chirped. Bethan was there, and Elen. Their mother needed quiet to tend her two new boys, and sent the girls off to amuse themselves. Now little Elen, squatting on the floor, twisted twigs into a bird shape and pretended she had made a wife for Yellow-wing. Bethan was busily helping Alys sort some dried herbs to be packed into bags and stored. Claire, watching, realized that Alys was beginning to teach the young girl in the same way that she had taught Claire for these past years. The village would need someone to take Alys’s place. It was clear that it could not be Claire. She wrapped her hands around the thick branch that Einar had peeled and set firmly in place above the door. She lifted herself up until her chin was level with the peeled wood. She hung poised there and counted to ten, then lowered herself slowly. Doing this still hurt. That meant she needed it. She must do this each day until it stopped hurting. Then, she knew, Einar would tell her to put on her backpack filled with rocks and begin doing it again. Briefly, on a day when she was exhausted, she thought of Einar with frustration, of how demanding he was, how relentlessly he made her do the exercises again and again. Then she thought of how he watched her, assessing and admiring her strength, and she knew that his gaze was also that of someone who loved her. Tall Andras had married in midsummer, his new wife a fresh-faced, quick-smiling young girl named Maren. Standing at the ceremony, Claire felt no sadness; she had never wanted to be his wife. But once he had hoped for it, and now he had moved on and seemed happy. She thought sadly of Einar, alone in his hillside hut, and knew that a part of life was passing both of them by. “Soon?” she asked Einar, after she showed him how she could hold herself raised on the branch with her arms taut and unshaking, even while wearing the sack of rocks at its heaviest. He ignored her question. “One arm now,” he said. While he watched, she struggled to lift herself with just one. He wanted her arms to be equally strong on both sides, as her legs now were. On either leg she could hop up onto a rock slippery with damp moss and stand balanced there with the other tucked up like a waterbird. After rain she could slide, standing on one foot, down the steep muddy path and stop herself at any point by pressure on her heel or toes. She could hold a pebble on her raised foot and then move it by concentrating on it until it was between two toes, then under. From there she could move it from toe to toe, under and over. It made little Elen laugh uproariously to watch and then try the same feat with her own chubby toes. “Why do I need to spend time learning foolish tricks?” Claire asked Einar. “This seems a waste.” “It won’t be. It’s important. You’ll see.” She was eager to go. She had waited such a long time. But she had come to trust Einar, his wisdom and caring, deeply. So she sighed and nodded. In the winter she slept beside Alys. When the fire died late one night, with wind howling outside, the old woman shivered and Claire embraced her, trying to send warmth from her own body into the frail limbs that could no longer hold on to their own heat. “You’re a good girl,” Alys murmured. “Your own mum must miss you fierce.” Claire was startled. When she tried, in response to Alys’s words, to think of her mother, there was little that came forth. Parents. Yes. She had had parents. She could remember their faces, and could even recall the sound of their voices. But there was little else. “No,” she told Alys. “I don’t think she loved me.” Alys turned in the bed and through the dim light of the last embers that glowed in the fireplace, Claire could see her bright eyes, open in surprise. “How could that be, child?” Claire chuckled and hugged her. “I’m not a child anymore, Alys. Maybe I was when you found me. I was a young girl, then. But so much time has passed, Alys. I’m a woman now.” “To me you’re a child, still. And a mum always loves her child.” “It should be so, shouldn’t it? But something stood in the way of it. I think it was a—well, they called them pills. The mothers took pills.” “Pills?” “Like a potion.” “Ah.” That was something Alys understood. “But a potion is meant to fix an ill.” Claire yawned. She was achy and exhausted. “My people—” (“My people”? What did that mean? She didn’t really know) “They thought that it fixed a lot of ills, not to have feelings like love.” “Fools,” Alys muttered. Now she yawned too. “You loved your boy, though. That’s why you’re soon to climb out.” Claire closed her eyes and patted the old woman’s back. “I did,” she said. “I loved my boy. I still do.” Twelve In late spring, Tall Andras had a plump newborn son, and there were lambs prancing in the upper meadow, their soft fleece warm in the changed, gentler weather. Early wildflowers were in bloom, and lavender butterflies with lacy-patterned wings darted from one to the next. Bryn’s twin boys grinned and showed two teeth apiece. The fishermen folded freshly knotted nets they had mended in winter while their wives, beside them at the fire, made the sweaters they would wear on their boats. Even the wind seemed new. It wasn’t the same brutal wind that had ripped the roof thatch and swirled the snow. Now it pulled the warm scent of brine-washed sea urchins, mussels, and kelp from the rocks and carried it gently across the beach and up the hill. It lifted Claire’s long curls as she knelt and filled a basket with nettles. The rigid stems and heart-shaped leaves were covered with stiff hairs that were painful to touch, but she was wearing the special protective gloves Alys had made. The plant would be a valuable pain reliever for Old Benedikt, who was suffering from gout. “Don’t touch,” she warned Bethan, who had come with her and wanted to help. “It stings. You gather the elder bark, over there. Your mum needs it for your brothers.” Bethan peeled bits of the bark and added it to the basket. The twins were fussy from teething. “When I leave, you’ll be in charge of the gathering, then. Alys will make gloves for you. You must be careful with these nettles.” Bethan hung her head. “Do you think you can’t do it? You’ve learned so much,” Claire reassured her. “I can do it. But I don’t want you to leave.” “Ah, Bethy.” Claire hugged the slender girl. “You know why I must go.” “To find your baby.” Bethan sighed. “Yes, I know.” “Not a baby anymore. He’s a boy now. If I don’t go soon to find him, he’ll be a man!” “I fear for you, Claire.” Bethan’s voice was low. “Why is that? You know how strong I am. Look!” Claire reached up with one arm and grasped a limb of the elder tree. She raised herself until she balanced, unwavering, from the one muscled arm. Then, slowly, she lowered herself back to the ground. “Not even your pa can do that, can he?” Bethan smiled slightly. “No. And Pa’s getting fat, too, Ma says.” “You mustn’t fear for me, then. You can see that I’m strong, and swift, and . . .” “Smart, and sly, and . . .” Bethan giggled. It was a game they often played, with the sounds of words. “And silly!” “And sleepy!” “And slugbucket!” “Swatbottom!”","sourceLink":"https://allnovel.net/son-the-giver-quartet-4/page-22.html","bookId":1704,"book":{"id":1704,"title":"Son (The Giver Quartet #4)","description":"Storyline: Son (The Giver Quartet #4) They called her Water Claire. When she washed up on their shore, no one knew that she came from a society where emotions and colors didn’t exist. That she had become a Vessel at age thirteen. That she had carried a Product at age fourteen. That it had been stolen from her body. Claire had a son. But what became of him she never knew. What was his name? Was he even alive? She was supposed to forget him, but that was impossible. Now Claire will stop at nothing to find her child, even if it means making an unimaginable sacrifice. Son thrusts readers once again into the chilling world of the Newbery Medal winning book, The Giver, as well as Gathering Blue and Messenger where a new hero emerges. In this thrilling series finale, the startling and long-awaited conclusion to Lois Lowry’s epic tale culminates in a final clash between good and evil.","cover":"https://allnovel.net/images/son-the-giver-quartet-4.jpg","author":"Lois Lowry","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/son-the-giver-quartet-4.html","creation":"Oct 5, 2019 8:57:53 AM","modification":"Oct 5, 2019 9:59:34 AM"}}
