{"id":21936,"no":38,"title":"Chapter 4","content":"The old lady watched Berenice walk down the road, pausing for a moment in her beautiful needlework to admire her young daughter-in-law\u0027s slim, willowy figure, the eager pose of her head, her brown, beautifully plaited hair. The apple-green of her dress and the blue-green of the trees—she made such a beautiful picture, and the old lady shook her head and sighed. And one might imagine the old lady saying: When I was young I was as lissome as that, as pretty, had as eager a head. Time flies, and we grow old. Ah, the fine days of young womanhood! But that was not in her mind at all: she shook her head because she knew the heartaches, the difficulties, the terrors the young girl must go through before she attained to the reward of women—wisdom and peace. For they all came to that in the latter end, the old lady thought—the girls who started out dancing, and the girls whose eyes were troubled with thought, and the girls deep as rivers, and the shallow girls who angled for a honeyed word. And life, like some deft schoolmistress, caught them and taught them and put wisdom in their heads, and in their hearts little modest flowers, like forget-me-nots. And the sad girls learned laughter from little children on the floor, and the wayward ones learned loyalty from trouble, and great emotional currents put depths into the shallow ones. And life seemed so hard, the present so brutal, the future terrible as an army with banners—but one day it was gone. All was past. And in retrospect it seemed so little pain to have had, to learn such a great lesson, to come to such a sweet place! If one came through it, it was so much worth while. The hazards one made so much of ... Oh! Did n\u0027t she know! It seemed to her as she looked back now very strange that all the little tragedies of her life appeared to have faded and all the happiness intensified; and this was peculiar, for at the time the pain seemed so poignant and the happiness so diverse, so hard to grasp. A night at a theater, for instance, twenty years ago, and a dinner before it, and a supper afterward—how queer one could remember all that! Even the tunes the orchestra played, the clothes one wore, what this man said, how this woman looked. And one thought of the night young Barry, below, writing, was so near to death; and the utter terror, the tragedy of that time had faded. And one remembered only how pretty he looked, how kind the doctor was, how Mr. Valance, her husband, had put his hand on her shoulder in his big, kindly way. If young people knew how these things came out, they would n\u0027t worry so much, but there was no use telling them. They would have to find out for themselves. She had never been one to admire nature, had the old lady, but one thing she did know: she knew people and she knew life. Berenice was all right, a very fine girl for all her romantic thoughts, but Barry worried her occasionally. He was so intense about his career of writing. And she felt in her heart that if was not going to be a success. One knew, somehow. For instance this: she could tell whether or not a novice was going to be a great pianist, because she could see him as a master, if he were ever to arrive; his power, his aloofness, his concentration. She could see a merchant. She supposed it was a gift, just feeling what people were. And her son Barry below—she could not see him. And she was n\u0027t going to tell him, either. Men were queer. They bore grudges, even to their mothers. It was better to let him fight himself out, and be conquered, drop; and then pick himself up, and think it over, and go to something else, with a pang and more wisdom. And month by month the disappointment would pass, until the ramping of his early days was no more to him than a quaint gesture. And years later he would meet some great author for a moment, and be very courteous, a little shy with him. But he would never tell him of the struggle on his own account, never mention a word—ah, she knew, she knew! Barry would be all right. Only—only he must be broken. All humans must be broken, as Mr. Valance, her husband, had said horses are. And some horses are great race-horses, and some are hacks, and some hunters, and some just simply for use. But all have to be broken. And they are nearly all kind, nearly all good, as human beings are. For nearly all men and women are good, the old lady thought. One had to know their hearts,—their appearance, their gestures meant nothing,—and their hearts ought to have a chance to grow. And then they would all be good. Those who were n\u0027t had had the growth of their hearts stunted somehow. And they were n\u0027t to be hated, but pitied, poor things. If any one, any young person, were to know what her thoughts were—the old lady smiled—she would say she had known no trouble in life, was shallow, did not understand the tragedy of things. Well, she had had her share of life; her troubles as well as the rest of them. She had been a very sensitive girl. When she married Mr. Valance, her husband, she had hardly known him,—for such was the custom in her day, that he should satisfy her parents of his affection rather than herself,—and when the day came to leave her father and mother and her four brothers and her sisters, to leave the house she had known since she was born, to leave her own virginal room, and go away with a strange, terrifying, fascinating man—why, it was like jumping into the sea without knowing how to swim. In those days young girls did not know, were scared. And yet everything had been all right. She loved Mr. Valance, her husband. No two could ever have been closer than she and he. And she smiled at the terror of her leaving the home. And before Barry was born—oh, the ghastly nights, the ghastly, ghastly nights, of lying awake and fearing, fearing, and the hideous unimaginable dreams! And the birth itself, the surge of pain like some cruel, driving knife, and strength ebbing in a fast flood! And came kind unconsciousness, and when she woke there was a sort of white peace in her, and the little dark-haired boy, by some beneficent magic, was on the nurse\u0027s broad lap. And the strange miracle of how she had forgotten all the pain so soon ... how little it seemed, how natural! And how ready she would have been again. A little daughter, she had thought—how nice it would be! But it was n\u0027t to be. And when Mr. Valance, her husband, had died, for her had come, she thought, the end of the world. Yet now all she could remember were the peace and trust in his quiet face, when all had gone. And into the room where she was alone with him there came the quiet message that all was well. And the hearts of people were so warm. The doctor himself, who had seen so many die one would have thought he would have become callous, was so unaffectedly kind. Even people one had thought were enemies—or not enemies but just careless of one—showed a warmth, an understanding. And she had thought it impossible for her ever to be on the world alone; but somewhence strength had come to her, and poise; and all the fears she had when Mr. Valance, her husband, was alive, were dead now, she a widow. Lonely and down in grief at times, but afraid never! And she thought to herself, with a queer little smile, of the times when in the dark of the night, by the eerie Long Island waters, she had gone out, crying in a little misery, praying, wishing that Mr. Valance, her husband, would appear to her, that she might once more hear the beloved voice, sense the big dignity, perhaps feel the kindly hand upon her shoulder. But she waited in vain. Nothing came to her cries, her prayers, her wishes. But when she came in again, she felt she had emptied her heart of longing and loneliness, and all the familiar furnishings of her rooms spoke to her tactfully and friendly. She smiled, because now she recognized—however she did it she did not know—that what she wanted could not possibly be granted. Just for her alone an exception could not be made against the seemingly cruel, tremendously wise law that the dead should be silent. Everything was so wise, so ordered. And if one were to know exactly, the merchant would leave his shop, the seamstress her broidery, the workman his lathe. So it was kept a curtain of mystery, with a little hedge of terror before it. All was well. Life and death, all in good hands. She had often thought to herself, sitting there, as an old person might, that things did not seem as well as they were in her young days. But on second thoughts she discovered they were just the same. Life was a constant, as Mr. Valance, her husband used to say of things. Oftentimes while she sat in a corner and heard young people talk, she was amused, for they seemed to think she knew nothing of modern life. And life could not be modern or ancient. Life was a constant, as Mr. Valance, her husband, used to say. They had only manufactured new terms, discovered new angles. She smiled as she thought of their talks of psychoanalysis; of how one was very complex; and how one must get rid of obsessions by discovering them and talking about them to a specialist. One did the same in her day. One called the obsessions troubles, and on one\u0027s knees one poured one\u0027s heart out to God. And their talk of psychic things—why, when she was a grown woman, did n\u0027t they have the queer Eddys in Vermont, and that strange Russian woman, Madame Blavatsky, and Home, the medium, who floated through a window, feet first! And she was sure that when she was young there was just as intricate card games as bridge. And their talk of Socialism and man\u0027s rights! Did they forget that Lincoln freed the slaves? Ah, the young! She remembered a man saying—an old man—that what was wrong with the new generation was this: they left nothing to God. They wanted to do everything their own way. Fifty years ago, he said, every one was cognizant of God. But were they? pondered the old lady. Yes, they went to church. But did n\u0027t they go just because one went, as nowadays one goes to the movies? A habit. And did the rounded sentences of the ministers mean anything to the young? No. And the hymns—they were just melodies. One sang them, as young boys sang college songs. It was only when one was grown, man or woman tall, and the great wolves of the world harried one, harried until one could sense their white teeth, their red slavering mouths, and there was a blank wall and no escape—it was only then one felt the Immense Hand. And rarely afterward did one speak of it. It seemed like a strange secret order, being initiated to God. She was sure that it was like that to-day, as it was fifty years ago, as it must ever have been, as it must ever be. Looking up from her sewing an instant, she saw Berenice coming toward the house. It must be later than she thought. It must be lunch-time. They must make Barry, poor boy, stop now. Brain work was so fatiguing and he should n\u0027t overdo it. She paused for a breath, watching the brown head, the apple-green dress. She knew the girl\u0027s secret, though Berenice had never said anything, hinted at all about a baby. But the little exalted look in the eyes— \"I must say a prayer to-night,\" thought the old lady. He got up from the desk. No! it was no use. Nothing would come to-day. Another fruitless morning. If he could only find the trick those fellows had! Yes, but they all had something to write about, and he had nothing: this wretched urban setting, this calm, uninteresting sound. And he knew nobody. There was no encouragement, no inspiration. His mother, dear old lady—she knew nothing, could tell him nothing. And his wife—she was a dear girl, and he loved her, but— Oh, there was nothing to write about; no drama; no people of drama. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3292/90032.html","bookId":459,"book":{"id":459,"title":"Changeling and Other Stories","description":"简介： When it comes to the publishing of books, people are always pessimistic, and, in my case, always right. Success, I am sufficient of a heretic to believe, matters little, but friendship a great deal. And I could as little think of sending a story frie...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3292","creation":"Aug 1, 2019 12:18:47 AM","modification":"Aug 1, 2019 12:18:47 AM"}}
