{"id":21943,"no":45,"title":"Chapter 7","content":"Without, there were the grunts of her men as they strapped the packs of the elephants, the snarl of camels as they rose to their pads and turned to bite at their loads, the shuffle of the troops as they lined for the long night march, the quick gruff orders of the captains, the canter of horses. Within, Sheba stood very erect in the great hall. The poor white king writhed on his throne. Nathan stood by his side, erect and afraid. \"And I said—\" Sheba\u0027s voice was quiet—\"oh, you who were as my brother, that sucked the breasts of my mother! when I should find you without, I would kiss you, I would not be despised. \"For I thought I was set as a seal upon your arm, and that your love was as strong as death. \"I rose and went about the city in the streets, and in the broad ways I sought you, whom I thought my soul loved, but I found you not. \"The watchmen that went about the city found me, they smote me, they wounded me; the keepers of the walls took away my veils from me— \"Me, Sheba!\" Her eyes flashed. Solomon quailed in his seat. The prophet made a propitiatory gesture. \"Oh, do not fear, Nathan.\" Sheba smiled. \"I came not to conquer, but to find wisdom. I found it.\" She paused an instant. \"Before I go, let me give you, Solomon, called the wise, some wisdom of the heart. And you, Nathan the prophet, let me prophesy. You might have had one woman, Solomon, to love you all your life, but the day will come when you will seek my face among a thousand women, and never have me. You might have a temple that would have made the pyramids seem like outhouses, but one day your temple will be a little broken wall. And your people might have been the conquerors of Africa, but one day they will be helots in the Babylonian land. You have the wisdom of the shrewd and pious, Solomon, that can never meet the generous hand with the grateful heart.\" She turned and swept out of the hall. At the gates she stopped and bowed mockingly. \"O King, live forever!\"","sourceLink":"http://novel.tingroom.com/duanpian/3292/90039.html","bookId":459,"book":{"id":459,"title":"Changeling and Other Stories","description":"简介： When it comes to the publishing of books, people are always pessimistic, and, in my case, always right. Success, I am sufficient of a heretic to believe, matters little, but friendship a great deal. And I could as little think of sending a story frie...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3292","creation":"Aug 1, 2019 12:18:47 AM","modification":"Aug 1, 2019 12:18:47 AM"}}
