{"id":21945,"no":47,"title":"THE PARLIAMENT AT THEBES","content":"All around us, now, is the occult night of Egypt, and we sense that we are in a place we have known in dreams and desires, and perhaps seen a drawing of in some childhood\u0027s book. Before us we sense—we do not see, so little light does the moon behind the rolling clouds give us—an immensity of sand. In some places there are little hills; and in others billows as of the sea, and here a rude terrace, and there a minute cliff. Everywhere is the sand; live sand, not dead. And westward, we know, it rolls onward like the sea, through the width of Africa, through the Sahara, reaches Timbuktu, the secret city, and the jungle takes up the land, and rolls to the Gold Coast, where the Atlantic booms in great, curling surf. And south of us is Africa, too, the crags of Abyssinia, the great belt of Rhodesia, and the plains where Kaffirs dig for diamonds, and the great veldts the Boers have tamed, and Table Mountain, that old navigators know, and the cape they have called Good Hope. And southward and eastward is the pearly haze of Madagascar. And north of us the desert slopes away to where Alexandria was, to where the still Mediterranean is, which has no tides, and Tyre and Sidon flourished, that now are dead; and Carthage of the Phoenicians was, whence black Hannibal set forth against the eagles of Rome—and was conquered and yet lives, so great his name is. And here was the empire of the Moors, the slim bronze people who struck Spain in a great shattering wave, and from whom Charlemagne got glory in battle. All these are dead now, and the moon shines over dead cities, dead heroes, and great empires that are dead, and buried under shifting silver sands. But the land we are in is not dead; eternal Africa, eternal Egypt. And where we are now, it is old, the events of history being like the trivialities of a summer day. We sense that Egypt is older than Mohammed, whose revelation is law there now, and older than the Little Lord who fled hither from Palestine with Joseph and Mary, older than the painted kings who sleep in pyramids; older than the pyramids themselves; older than the Hebrews who helped build them; older than Moses, who revolted and used black magic against the Pharaoh of his time; older than the tradition of yellow shaven priests; older than Isis and Osiris whom they worshiped with polished ritual—older, and younger, than this; eternal. Above our heads now there is an occasional beam of the moon, and in front of us the plain of sand that extends to the little hillocks and minute cliffs the wind has made. And back of us is the broad and shallow Nile, where we hear an occasional lap of a little wave, and a splash as of some small fish jumping. And here and there are isolated palm-trees. And there are no men, anywhere, but there is a sense of men. We know there are men in the cities to the north of us, men and women dancing in great blazing hotels, men on great liners going eastward through the canal De Lesseps made, men south of us at camp fires in the jungle, men west of us on caravans to Timbuktu. But here, and near here, men there are none. There is a pocket of clearness in the clouds for a second and the moon shines through, and we see on the plain before us such assembly of life as only Noah saw when he took the creatures of the world in seven by seven and two by two, on board his great ship. In a great orderly gathering they are there, patient, silent. The bears are there, the brown bear, and the little black bear. And the moorland ponies, and the deer are there, great elks with horns like sails, and the little deer of parks, and they of the cat tribe, with sleek furs and green eyes, and the fox with his brush, and the lanky, wide-eyed hare, and the rabbit children do be loving. They are all gathered there. And the kine of the field are there, patient, stupid-looking. And the great monster of the river, the hippopotamus, and the armored creature that has the horn on its nose. And the last of the buffaloes. And the great springing thing of Australia that carries its young in a pouch, it is there. And the solemn sheep. And back of that is an infinity of little creatures, the furry little creatures of the woods, who run when approached. They are there. All, all are silent, patient, a little puzzled, one fancies. In front of this gathering, forward and a little apart, is a manner of deputation. The lion, who pads around a little, and in whose eyes there is anger. The great black and amber tiger, who is still but for the significant movement of the immense tail, and the elephant, that seems like some gigantic carven thing. And the crocodile lies in the sand, like some black sea-beaten log. And the polar bear is there with black dots for eyes. And the horse is still as in a stall. And next to the elephant the dog sits. And they are all there, gathered for some occult reason, in the night of Egypt, under the thin twilight of the clouded moon. And another beam of moonlight comes, and we see that the Angel of the Lord has appeared somewhence and stands before them. As we see the Angel of the Lord, one of the illusions of our childhood vanishes. He is not a shining figure armed with terror and majesty. True, he has wings and a sword and a white robe, and is of stature above mortal. But, on the other hand, he has a great red beard, and his fingers are gnarled. There is something shy in his appearance, and kindly. And about him there is something of disappointment. One gets the impression that once he was a very great angel indeed, but in latter centuries he has drifted into a sort of back-water. If he were a man and not an angel, with his red beard and gnarled fingers and shy ways, he might be an old-fashioned farmer who cared more for his land than for the price of corn, and who would allow no tractors or mechanical appliances on his place, still having faith in the firm hands of workmen, and the strength and canniness of horses. He is evidently embarrassed, and not quite at home, and it is easily seen that he is more accustomed to looking at the crack in a horse\u0027s frog, and tending sick ewes, and herding homeless dogs, than facing emotional tension such as seems to be present. He comes forward shyly, his brow wrinkled in an embarrassed smile. And the dog smiles back at him, opening a laughing mouth and wagging its tail. And the horse gives a little whinny. But the rest are silent. The elephant regarding him with a sort of kindly contempt, and the crocodile watching him with ophidian distrust. But the lion is warm with anger and the tiger dangerously cold with it. The great white bear is serious. The Angel of the Lord speaks. His voice is soft and his speech halting. And we have a sudden chill of horror as we recognize his accent as Irish. Not quite Southern Irish, and not distinguishably Northern Irish—neutral Irish. \"Well, now, this is an unusual thing, an out-of-the-way thing, I might say.... I ... I hope I see you all well?\" There is a rustle of the little creatures back of the deputation. And in the circle before the angel the dog is wagging his tail, and the horse throwing up his head. But silence. \"I take it there is something on all your minds, so! Well, let you speak up, now, and let me hear what it is. It isn\u0027t the weather: that\u0027s elegant. And it can\u0027t be the crops. I was talking to the Angel of the Crops last night, and devil a better season has he seen since the night of the big wind.\" He gets no answer. \"It\u0027s queer and shy you \u0027ve got all of a sudden. And why should you be shy with me? Sure there \u0027s never anything come between us since I was put over you. And have n\u0027t I always been your friend? Let one of you speak up, now. How about yourself?\" He turns to the lion. \"The king of beasts, they call you. Let you be speaking, now, for the crowd.\" All around us now is the occult night of Egypt. Live sand and the little wind among the hillocks, and back of us the antique Nile. Here first was magic. And here first the half-gods were worshiped under the guise of beasts; of the cat and of the crocodile, and of others. And here is the monument of the half-god, the Sphinx, that is woman and animal, beauty and terror. And as we listen, the beasts speak, and to our human mechanics the deep vibrations are translated into human sounds, and the voice of the lion is as the voice of some great one of our race speaking in anger. And in the deep rumble we can hear thunder: \"In the place where I live by the great lake there is lately come a man.\" So the lion! \"He is a trading man. His legs are bandy. He is rarely shaven. In the morning his eyes are bleary. He blinks at the green light of dawn. \"And in the green glade where he is come he has builded a house. He has littered the ground with mangled boughs of trees, with papers, with tin cans which are emptied of his food. And the winds cannot clean that place, nor the rains wash the obscenity away. \"And all day long this man sits behind his counter in the little shop and barters with the black man, giving knives and beads and cloth for the skins of the animals whom it is allotted to the black man to kill. And giving him white man\u0027s liquor. \"And the white man drinks his own liquor, and when his heart is high with it, he takes his rifle and comes to seek me—for he has to seek me; I and all the clean things of the land avoid him, so little kin is he to us. \"And if he kills me for his sport, my lioness will come and he will kill her, too, and what shall become of our little tawny cubs? \"Why should this man come into our clean land, and make unbeautiful the dells, and stalk me that he may boast to other drinking men: \u0027I have killed the king of beasts\u0027?\" \"Ay! Ay!\" The angel is disturbed. \"He does make the place look bad. And true for you, he does go after you. I understand. I understand fully, but—\" And now the tiger has arisen, and his speech comes sibilant, with a little snarl: \"They who come up the Hooghly are not unshaved but clean. They are precise, languid men. They come for gain in the country. They do not barter in shops, but gain comes to them. They govern, and for being governed the brown men of India pay tribute and tax. \"And when the languid men from over the sea grow tired of governing, they go out to seek adventure. They send out the brown Indian men on foot to rouse me from the jungle sleep. And they follow with guns on our brother the elephant, and when I am driven into the open, and stand there dazed with the sun, they shoot at me from the back of our brother the elephant. \"And was it for this I was made, given great emerald eyes, given amber skin with great black stripes, given silken muscles, and claws like knives, to be driven out of my warm green jungle into the blinding sun, and be killed by languid men?\" \"Well, now, you know what they say; if they did n\u0027t kill you, you \u0027d kill them.\" \"How many have I killed, except in defense? Is it sport for me to leave the cool, moonlit glades, and come to the hot cities to kill men? If I want fighting, are there not the wild boar and my brother the elephant? And if I want food, is man as succulent as the young kid?\" \"Ay, there \u0027s a lot in that. And what is your complaint?\" He turned to the great carven elephant. \"I am the wisest, the strongest, the most dignified of all. I live on the shoots of young trees, and raid sometimes the crops, but I kill nothing except in terror or defense. And once they sought me out in the secret places for great ivory teeth, and there was great danger. And it was either kill or be killed. \"And now they trap me with cunning. Now there are helot elephants trained to decoy the brethren of the warm woods, and traps to hold us. And when they have made us fast they starve us cruelly. And they bring us across waters and exhibit us, and the clown and the yokel pay their copper pennies to gaze at the wise and strong in captivity. And some greasy man pouches the wages of our prison. Was it for this we were made wise and kindly and strong?\" The angel is embarrassed. He looks right and left. He turns in relief to the great white bear: \"Sure, now, what complaint can you have? There \u0027s nobody going to shoot at you from the back of the elephant. And there\u0027s no man going to open a shop where you are. Begor, \u0027t is few customers he \u0027d have barring the sea-gulls. And whenever you get killed, \u0027t is your own fault. It\u0027s your curiosity brings you to where they can get a shot at you. If you \u0027d stick around your icebergs you \u0027d be better off. Sure, you lead the life of a lord\u0027s lady. What brings you here at all?\" \"I come for the little seals, and our sister the whale. They cannot walk. And they are in great trouble.\" \"I know. I know. Sure, my heart\u0027s just in chains for them.\" \"The seals huddle on the rocks with their young. They huddle and tremble, and each sinister boat in the Arctic seas is a menace. And the seas are wide, and the patrols are few.\" \"I know. I know.\" \"The black boats come, and the men with rifles.\" \"Ah, now, don\u0027t be talking! Don\u0027t I know!\" \"And our sister the whale skulks in black seas—she who once greeted the sun in the morning. And now seldom appears—who once loved to bask like a cat. She is haunted in her own ocean until she cannot show her steaming fountains. And as a people, she is a slender people, and will soon die.\" \"A great and terrible loss, surely. Sure, I \u0027m trying to forget, and you \u0027re reminding me. And you?\" \"I have no complaint,\" uttered the crocodile. \"They rarely kill me with guns. They seldom capture me. And there are always small black children bathing in the Nile. And boats get upset often. I have no complaint,\" he leered. \"Do you know—\" the angel is severe—\"I never liked you. And what use you are on this earth is more than I can see. Do you know,\" he said, \"I \u0027ve half a mind to hoof you back into the river. I have so. Now, here \u0027s one has a complaint.\" He turned to the horse. But the horse shook its head. \"No complaint, and you the hardest-worked of them all! And the rest of these lazy devils doing nothing but lolling around in the sun. And you, my darling?\" The dog uttered a joyous bark. \"You have no complaints, either.\" \"Except,\" the dog pleaded, \"that they should n\u0027t muzzle me in the heat of the day.\" \"Well, now, boys—\" the angel was awkward with his hands—\"I take it you \u0027ve all got a complaint to make against man. You object, I infer, to his shooting at you with guns, except, as he is entitled to, in self-defense. And I take it our friend the elephant also objects to being exhibited. On the whole, you object to the present attitude of man. Now, what do you want me to do?\" \"We want you,\" the lion said, \"to have God make man stop attacking us.\" \"Well, now—\" the angel shifts from one foot to the other—\"well, now, you \u0027ve touched on a very delicate situation. On all subjects, of course, you \u0027ll find God kind—I might say, to a degree. But the subject of Man is just a wee bit touchy. \"God, you know, is very much interested in Man. He thinks a lot of man, and He is very much inclined to let man have his own way. \"So whether He \u0027d listen to a complaint against man or not, I don\u0027t rightly know. Personally, between me and you, I think it might be dangerous to put it that way. \"But I \u0027ll tell you what I \u0027ll do. I \u0027ll wait until some fine day when they tell me He \u0027s in good humor, when He\u0027s pleased about Man having thought out some new fine scheme, or made a discovery, and then I \u0027ll tackle Him, nice and easy. \"Yes, I \u0027ll take it up some day, and I \u0027ll see what I can do. I \u0027m sure if I can get Him in a good humor, I can do something. Will that satisfy you?\" \"It will not,\" said the animals. \"Well, then, what do you want me to do?\" \"We want you,\" the tiger\u0027s sibilant purr came, \"to go from us to God now, to-night.\" \"Och! have sense! You don\u0027t know what you \u0027re asking. I suppose you think I \u0027ve only got to knock at the door and ask God to come out and talk it over, and offer Him a pinch of snuff, maybe, and ask Him how the weather \u0027s agreeing with Him. Do you know this wee earth is only one of a million? Of course you can\u0027t comprehend that, being only animals and having no reason.\" There is something like a snort from the elephant. The Angel of the Lord ventures a timid glance in that direction, but says nothing. The angel is rather in awe of the elephant, as a mother might be of a genius child. He switches to a different point: \"Besides, I suppose you think there are only a few angels of us in it—myself and the Angel of the Changing Seasons, and the Angel of the Growing Crops, and the Angel of the Rivers and Streams, and the Angel of the Five Oceans. Well, let me tell you, there\u0027s archangels, and there\u0027s powers and dominions, and cherubim and seraphim, and God knows what else. And there\u0027s angels you never heard of: there\u0027s the Angel of the Progress of Education, and there \u0027s the Angel of Economic Conditions, and the Angel of Atomic Energy. All very clever fellows—geniuses, you might say. And there \u0027s the Angel of Arts and Crafts, a sloppy-looking lad I would n\u0027t be caught talking to. \"And there \u0027s English angels, all very superior, and Italian angels, slick as be-damned; and Russian angels are always sighing and groaning and drinking tea; and American angels, brisk lads would convince a dying man he was the devil and all for strength and energy. And me nothing but a poor sort of fellow that knows nothing but animals; you see, I \u0027d better be keeping my mouth shut in that kind of assembly. \"I \u0027ll tell you what I will do. I \u0027ll get through my work early, and contrive to hang around the squares and gardens of heaven, and any one of these days the Grand Man Himself will be passing by and He \u0027ll see the glint of my old red whiskers, and He \u0027ll stop the archangels and the powers and dominions, and come over, so kindly He is.\" \"\u0027Where have you been hiding yourself, Michael John?\u0027 He \u0027ll say. \u0027And how\u0027s all your care?\u0027 \"\u0027They \u0027re fine, Sir. They \u0027re grand,\u0027 I \u0027ll say. \u0027Sure, \u0027t is to the queen\u0027s taste they are—barring a wee bit of trouble that\u0027s not worth mentioning.\u0027 \"\u0027And, sure, what\u0027s troubling you, my poor lad?\u0027 \"\u0027\u0027T is not worth troubling your Deity about. \u0027T is not so!\u0027 \"\u0027Out with it now, Michael John!\u0027 Himself will say. \"\u0027\u0027T is that my little people, Sir, do be worrying hard that man is after them a bit strong, and if Yourself would just direct him to be a wee bit easy\u0027—and I \u0027ll tell Him what you all say. \"Is n\u0027t that the jewel of a plan? Is n\u0027t that the great scheme entirely?\" \"We think it\u0027s rotten!\" champed the crocodile. \"Well, that\u0027s all I can do,\" the angel told them. \"If you \u0027ve got a better plan—\" \"We have decided,\" the lion rumbled, \"that if you could do nothing, we could. We can stalk man as he stalks us. We will not wait for him to come out; we will descend upon him. We will lie in wait for him in the way. I shall come to the villages with my kind and the spotted leopards that purr like the rumbling of drums, and the striped hissing snakes; and the rhinoceros shall lumber through the streets, and the great river-horse shall no longer avoid his frail boats but seek them.\" \"And my brother the elephant will crush him beneath his terrible knees,\" the tiger snarled, \"and trample his little houses. And the wild boar with tusks like knives will strike at him from the ground. And from the jungle I will come forth with the moon, and when dawn comes there will be wailing, if any are left to wail, and the small winged things of the jungle will assault him night and day, and there will be terror through the land.\" \"And there will be terror through the sea,\" the white bear prophesied. \"Our sister the whale will no longer flee but fight, and the sails of ships will quiver and the bulwarks give. And we will push icebergs in the paths of iron ships. The millions and millions of herring and cod will help. And the swordfish will founder the life-boats. And out of the gray-green depths of the sea the devil-fish will arise, his long, seeking tentacles over the gunnels—\" \"Oh, childer, childer dear!\" the angel implored. \"And our cousins the birds will help us,\" the lion took up the litany. \"The eagle and the hawk in their strength, and even the little sparrows in their number. They will buffet with wings, they will peck with their sharp beaks, the innumerable folk of the air.\" \"And from the North,\" the tiger promised, \"the wolves will come out with their red eyes, their slavering fangs, and the fox will revolt, with his teeth sharp as a dog\u0027s.\" \"And the things of the field will revolt,\" the bear went on, \"the patient kine, the sheep and goats, and the vibrations of battle will put panic on the horse so that he will smash his traces with his hoofs, and smash men\u0027s heads. And the turmoil will craze the dog, so that he will attack those he loves.\" \"For God\u0027s sake, children dear, will you stop breaking my heart!\" \"Death and terror on the land!\" prophesied the lion. \"Death and terror on the sea!\" promised the great white bear. \"My dears, will you let me put sense at you? Will you listen to me a moment?\" the angel pleaded. \"\u0027T is for your own sakes I ask. Will you just listen? \"What will become of you if you do all this? \"Don\u0027t you know that man will come against you with all his weapons and mechanical contrivances, his poison gas and his torpedoes, and wipe you off the face of your own earth? Childer dear, you have no idea of the terrible fellow he is at all. Myself, angel and all as I am, when I see some of those fellows coming hell-for-leather in their motor-cars, I leap like a hare out of their way, I do so. And oftentimes I \u0027m shaking in the legs for hours after it. I don\u0027t mind telling you. He \u0027ll kill you surely, childer dear.\" \"He \u0027ll kill us anyway,\" fluted the elephant. \"What matter to-day or to-morrow or a century from now? We die. What of the Irish elk, with horns like banners, so proud in his green pastures? What of the great buffalo, lord of the plains?—where is he? If we die, let us die together, fighting shoulder to shoulder!\" \"Besides, maybe it\u0027s worse than man you \u0027d have.\" \"What is worse than man?\" \"Maybe God Himself would come down against you, maybe,\" the angel\u0027s voice falls to a sacred whisper; \"maybe He will uncover His face!\" There is a movement of awe, or terror among the animals. The silent multitude back of the speakers rustles like leaves. The lion speaks: \"Even that we will brave, if we cannot have justice.\" For a little while they look at one another in awed tension. The animals are frightened, the angel is frightened. One would think they were terrified by their temerity, and were awaiting the avenging thunder of God. The angel plucks up courage. He gives a little nervous laugh. \"Now, here we are, my dear little people, making fools of ourselves as usual; letting our feelings run away with us. You \u0027d think it was at a political meeting you were, with you giving out manifestos and ultimatums, and wanting to die. \"Let us get down, now, to facts. Let us examine what material we have, and draw deductions. \"We were all agreed that we are here by the wisdom of God, and being here in that wise, are subject to his wishes in every way. Even old Go-by-the-ground—\" he looks at the crocodile—\"knows that.\" \"Now, from what I \u0027ve heard from the angels who are higher up,—from them, let me tell you, that are absolutely on the inside,—God designs to make out of man the perfect being. He intends to combine your bravery—\" he turns to the lion—\"and your wisdom—\" to the elephant—\"with your beauty\"; he is addressing the tiger. \"What about me?\" champs the crocodile. \"Och, be damned to you! Man,\" he goes on didactically, \"is essentially a creature of progress. He is the only being that builds houses—\" From the background comes a shrill squeak from the beaver. \"I mean houses with rooms—\" There is the angry droning of bees. \"What I mean is this: houses with fireplaces and pots and pans and what not. None of us will deny,\" he finishes lamely, \"the enormous progress of man.\" \"I deny it,\" the lion stormed. \"Can I forget the great black armies of the South, the glistening men with the silver armlets and the short keen spears? Not even of me were they afraid, those! Their drums resounded through veldt and plain, They asked only of the earth what they needed for their good. And when they hunted they hunted fair. They matched their strength against our speed. And their knowledge against our knowledge. And at night they sang and they danced beneath the moon. \"And now they are farm servants to the men who come overseas. They are not clean, as they once were. Their bodies that once were naked and glistening are caked with mud and covered with rags. And some of them are driven into the bowels of the earth, and the sunlight and the moonlight they were born to is kept from them. And they dig diamonds for men who are not satisfied with the luster of stars. And they who once fought me in the open with a spear now skulk with a gun.\" \"I remember an India that was,\" the tiger snarled, \"a land of rajahs and temples, of brown dancing girls and men who played little flutes. They grew the green sugar-cane, and cotton they might spin on great wooden wheels. And their smiths hammered brass into strange antique shapes. And they worshiped God with singing and dancing in cool temples. \"What are the rajahs now, that once were the wonder of the earth, but little helot princes? And the ranees—the cinnamon-colored queens with the minute silver bells upon their bud-like toes—but despised native women? Are the bazaars filled with the quaint work of smiths? No, but with the meretricious trinkets of the West. And black-coated men seek to turn them from native immemorial gods. And the machine that throws pictures the mummers make, fights against the music and the dancing and the temple bells. \"The beauty I stand for is passing away.\" \"In Burma, whence I come,\" said the elephant, \"there are jungles deeper than the jungle of Africa, or the Indian jungles. Great mossy trees, and painted flowers, and great brown rivers rolling to the sea. And the men there are beautiful as women, and the women beautiful as flowers. \"And once they paddled down the great brown river in glistening black canoes. They wore great gaudy sashes and had a flower in their teeth or a flower in their hair. Under the shadow of the great trees they paddled. And when they saw me they made reverence, saying, \u0027Our lord, the elephant!\u0027 On little reeds they made sweet, plaintive music. \"And now the great ancient trees are being cut down, and floated on the bosom of the hurt brown rivers. And the peace of the jungle is disturbed with the cough of the motor-boat, and oil is heavy on the warm jungle smells. And the men, beautiful as women, are clothed in soiled white garments; the rounded child-like bodies of the brown women chafe under a huddle of clothes. And when I am observed, the white man asks, demands, the help of the little brown men to hunt me, to whom they once did reverence, and I seem to hear no more sweet, plaintive music. \"From the quiet river I have seen the painted barges of the Pharaohs move along under the sweeps of the negro slaves. Color and majesty and dignity. And the shaven priests chanted their litanies at the change of the moon. And from the Sahara the desert tribes brought tribute and treasure to Egypt, the men with the white horses and the black tents. And the nodding dromedaries and camels and their tinkling bells. And the kings raised their pyramids, and the multitude of men like ants listened at sunrise to the great masonic prayer. And they left the Sphinx to denote their mystery. And Cleopatra, who was Lilith reborn, played with Rome for a doll. \"All these things have I seen: the magic of great Moses, and the flight of the Little God of Galilee; the perfumed Pharaohs; the sinister yellow priests; the gnarled masons at their secret prayers; and Cleopatra brown as a berry, magnificent as jewels, venomous as a snake; and the sculptor at work on the Sphinx. \"And now tourists unwrap the great kings, and hucksters chaffer where once the trains of the prince-merchants of Tyre passed, and we shall never see a Cleopatra any more. \"But I am not complaining. Men do not swim as well as in the elder days, nor handle a boat as surely.\" \"I know nothing of painted Pharaohs,\" said the great white bear, \"nor anything of Indian queens. In the North are neither kings nor masons, but day and night and ice, and a little people. In summer is the great sun, white light, and grass that is green for a little, and the thunder of breaking bergs, and in winter no sun but the flaming aurora and the white illimitable miles! \"And the swarthy little people were happy then. In the long nights they sang, and they bowed to the gods in boulder and stream, and set out in the little kayaks on the Arctic seas to hunt the great solemn walrus, or they set off in sledges through the pathless wastes. They were a brave people, a healthy people. \"And came the boats hunting our sister the whale, and the whales taught the little swarthy people progress, and everywhere now they are cunning and degraded and crusted with sin, and a great plague makes them spit blood, and waste to nothingness, and die.\" They all looked at the horse, but the horse was silent. \"Look back in the folds of your memory,\" the lion prompted. \"Look back well! Can you not remember the great races in the Roman circus? Listen a little! Can you not hear the trumpets of Agincourt?\" \"And you, little brother—\" the bear swung his ponderous head toward the dog—\"was there not a time when you lay before a fire in a rush-strewn hall? And now the houses are too little. They tell me—I do not know. And did you not once run barking joyously beside man on his horse? And now horses are out of fashion, are they not, little comrade? And the cars are too fast for your short legs.\" There is another silence, and the angel looks at them piteously. \"I wish to my God I had some of them clever fellows here could argue with you. I never was much good in an argument, anyway, never having had the education. But let me tell you there \u0027s angels could prove to you you \u0027re all wrong. I wish they \u0027d come here and talk to you, but I don\u0027t suppose they \u0027d care much about us and our wee affairs. But—but how about music,\" he hazarded, \"and poetry? Ay, and poetry.\" \"As to music—\" the elephant threw up his trunk in a sneer—\"what music can he make comparable to the birds of summer—the sun going down, and each bird with its separate song, blending into a gently-colored symphony, and the chime of the waves with it, and the rustle of the branches in the sundown breeze?\" \"Ay, but poetry.\" \"It will need poetry,\" thundered the lion, \"more poetry than can be ever written, to equalize the making ugly of earth. The great cliffs shamed by mean houses, and the splendid glades ruined that a train may pass. And the mouths of rivers spoiled by the slag of mills. And great noble trees hacked down. How many an epic to pay for a great forest dying, shepherd? How many a lyric for a tree where little trusting birds had their home?\" The angel throws out his hands abruptly. \"You have me,\" he says. \"You have me!\" He braces with decision, rises to his full height, and suddenly there is nobleness. \"Well, which is it to be?\" he asked. \"Will you follow my plan, or do you insist I go immediately?\" \"We insist.\" He pauses an instant. \"Very well. I \u0027ll go,\" he says. \"I \u0027ll go.\" He looks all around the gathering. In spite of his decision, and his bracing, there is a great emotion brewing in him. \"Now, before I go, let me tell some of you something. Do you, Philip—\" he turns to the bear—\"be getting back North as fast as you can. You poor fellow, you must be murdered with the heat entirely, and you with the Arctic furs on. You \u0027ll catch your death here. And as for you,\" he warns the crocodile, \"don\u0027t be obstinate, there \u0027s a good fellow! Keep to the water, and you \u0027ll be all right. It\u0027s only when you get out, they can get after you. And my little friends the beavers—where are they? Childer, can you hear me?\" \"But what\u0027s all this about?\" asks the elephant. \"It\u0027s just for fear I \u0027m not coming back.\" \"But why aren\u0027t you coming back?\" the lion growls. \"Och, it\u0027s just a notion. Are the beavers there at all, at all?\" \"No, just a moment!\" The tiger is on his feet. \"I want to hear more of this. What do you mean by notion? You aren\u0027t thinking of leaving us?\" There is a quick commotion, a little shudder among all the animals in the background. \"Well, now—\" the angel is embarrassed—\"it\u0027s a hard errand I have before me, and what will be at the end of the chapter no one knows. I to be arguing with the Great Man, and demanding your rights, and He to be losing His temper with me—there \u0027s no knowing. So to be on the safe side, I \u0027ll just say good-by to you now. Many \u0027s the pleasant hour we \u0027ve known and springtime coming, and many\u0027s the little day we \u0027ve spent together and winter roaring through the chilly air.\" \"But He never loses His temper, does he? He \u0027s always mild.\" \"Oh, childer dear, ye little know! You all know the Black Man, and when you get the cold wind of his coming you scurry away. He was an angel once, the greatest of them all. Lucifer, they called him, so I \u0027ve heard old angels say, and the Hebrew or something for Him who does be bearing light, such a gorgeous angel he was. But one day he and some of his lads began to argue with the Great Man, and before the words were half out of their mouths they were tumbling through the blue spaces of the stars, condemned to eternal hell-fire. Sure, you see them yourselves on Hallowe\u0027en, and them roaring up and down the world, and screeching fit to split the sky.\" A moan of terror ran through the massed animals. The dog raised his head and howled. \"And the wee half-god we all know, him with the horns of the goat, that does the piping in the valleys of spring—sure, he was an angel once. But something went contrary on him, and now he dare n\u0027t show his face on heaven or earth, but hides in the branches as wild as a squirrel.\" And a little shudder of pity arose. \"Ay, and there was others. There was a crowd of reckless fellows in the days before the flood—or after it; I don\u0027t know which—and they came from heaven to court the daughters of men, such grand women they had in those days. And the Lord God heard of it, and He stood up and looked at them, and he said just one word. They \u0027ve never been heard of since. One minute they were there, and the next was emptiness. \"Mind you, I \u0027m not saying anything like that will happen to me, for Himself has always been kindness to me. It\u0027s always \u0027How are you, Michael John?\u0027 and \u0027Don\u0027t you ever take a rest at all?\u0027 and \u0027Sometime I \u0027ll have to take a day and come down and see yourself and the wee ones!\u0027 But just, if I don\u0027t come back, don\u0027t think I \u0027ve taken a better job. Sure, I \u0027d never desert you, my wee darlings. It\u0027s just maybe I \u0027m getting a wee bit of discipline.\" \"I think—\" the elephant seemed husky in the throat—\"your own plan might be best—to wait for an opportunity and just suggest.\" \"Better say nothing at all,\" growled the lion. \"No, childer dear; I \u0027d better just go ahead. I will confess it was timid of me not to go in the first place. It was thinking of my old skin I was, and I should be ashamed of myself. Sure, there \u0027s no disgrace in asking for fair play, and you \u0027ve been sorely tried. I \u0027ll go.\" \"No, no, no!\" wailed the animals. \"No, your own plan was wise,\" the elephant insisted. \"If anything happened to you, what would become of us?\" \"Yes, what would become of us?\" the little ones wailed. \"Do you honestly think my own plan\u0027s wiser? You \u0027re not saying that to save me from trouble?\" \"We\u0027re not,\" the lion said. And \"Of course not,\" added the tiger. \"Just slip in a word when you can,\" from the elephant. \"Honestly, now, it would be best.\" The angel was relieved. \"I can talk about your loyalty; and, sure, I can remind him of the kine that gave shelter to the Wee Relative in Bethlehem, and the donkey that was proud to carry His weight; and I \u0027ll remind Him, too, that I \u0027ve never asked a favor yet, and if He could just see His way—\" \"Well,\" the elephant thought aloud, \"I \u0027ve got to be getting back to Burma.\" \"I \u0027m going your way,\" said the tiger. \"There \u0027s nothing to keep me up further,\" said the lion. \"I \u0027m very much obliged to you all—\" the angel was abashed with emotion—\"for not insisting. And it\u0027s lucky I am,\" said he, \"to have decent beasts to deal with and not man. For man would have insisted I \u0027d go, and not given a tinker\u0027s curse what would have happened me.\" \"Ay, man!\" sneers the great white bear. \"For God\u0027s sake Philip, will you be getting home out of this, before I have you sick on my hands! And as for you, Go-by-the-Ground, get back to the river or I \u0027ll sink my foot in your tail. Go on now! Be off with you!\" There is a shuff-shuff-shuff over the sand as the beasts scatter, going east, north, west, and south. The angel stands watching them as they go. Only the horse and the dog remain, the horse nudges him on the shoulder with its mouth, the dog puts a cold nose into his hand. \"Och, my darlings!\" \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3292/90041.html","bookId":459,"book":{"id":459,"title":"Changeling and Other Stories","description":"简介： When it comes to the publishing of books, people are always pessimistic, and, in my case, always right. Success, I am sufficient of a heretic to believe, matters little, but friendship a great deal. And I could as little think of sending a story frie...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3292","creation":"Aug 1, 2019 12:18:47 AM","modification":"Aug 1, 2019 12:18:47 AM"}}
