{"id":21949,"no":51,"title":"Chapter 4","content":"It had often seemed to her a strange thing, as she sat thinking, how all one labors to learn passes easily away, and what one feels remains, welcome or no. All the book-learning of her early years had gone, but there would never go the memory of her first blushing kiss, and though it was six-and-twenty years since he had gone from her life, yet the thought of the Philistine boy who was now a grandee of Egypt—that remained. So, likewise, all she had learned of the Hebrews was gone; now a legend, now a saying would come back to her, some proverb or a piece of ritual, but like a bar from a tune one has forgotten. But everything she felt, everything she had known of great Samson remained with her. One learns things and one lives things. The things written in the head fade out and die, but the words on the heart bite deeper and deeper.... She could remember every kiss he had given, the immense madness he had evoked.... O God, was it possible that she, so calm now, so respected, so wise, had once shaken like a leaf at his voice? Her knees had trembled; her heart had fought in her breast like a caged bird; her throat had gone dry.... Before she met him, she knew him by repute, a huge, turbulent man of immense strength, who had often been in trouble with the Philistine authorities.... In the tribal troubles, some years before, his name had been very prominent. He had married a Philistine girl in Timnath, and there had been a riot at the wedding, over a question of dowry, or something of the kind, and some of the girl\u0027s Philistine relations had been killed. A sort of vendetta had arisen and Samson had declared war against the nation. He had proceeded to burn the corn stacked in the fields; there was a strange rumor that he had captured an immensity of foxes and, tying burning brands to their tails, had loosed them among the harvest. Then, of course, from a family quarrel it had become a national affair and Samson was proscribed. Prodigious stories were told of his strength and valor, of his defeating patrols single-handed, and refuging on the rocks of Etom. The Hebrews were asked to give him up to authority, and brought him to Lehi bound. But there he burst his cords, such immense strength had he, and escaped after slaying twenty men in a hand-to-hand fight. Then he had become a bandit of the hills on whose head a price was set. Around him a romance grew, as will about all mountain chiefs, to which Samson lived up most gallantly. Careless of disguise, careless of danger, he had come, with his great red beard and his hair floating to his hips, into Gaza itself once, to see a woman. The watchmen were told, and the city gates were locked while they searched for him, but he crashed through the gates with his terrific shoulders and made his way to Hebron. It was said he carried parts of the ironwork with him to make weapons. All this had happened years before, and all the border warfare was over, and Samson was no longer a proscribed bandit but a great man of the Hebrews, leaping suddenly into fame and holding fame and power as such men will. He no longer raided harvests and kine, nor came to Gaza secretly, but now he walked like a conqueror. It was said that it irked him that everything was so peaceful and quiet, and he regretted the old roaming days. To the Hebrews he was a great figure, a champion. Delilah had never understood how they made a champion out of this guerilla fighter, but when she saw him for the first time she understood. He came to thank her for the interest she had taken in his race. \"You have been good to my people,\" his voice thundered. \"I thank you.\" Herself, a tall woman, had to look up like a child to him, and herself, no small woman, felt a reed beside that vast muscular bulk. She had two impressions of him, his immense masculine quality, and his tremendously arrogant manner. For everything Philistine he seemed to hold a tremendous contempt. He had beaten the Philistines, and physically he thought little enough of them. It seemed a little flaunting to her, at first, that great cape of red hair, of which he was so very proud, so very careful. In a smaller man it would have been effeminate, but in him it was a trait of virility, like a lion\u0027s mane. Beside him his followers, his clansmen, seemed so frail, so puny. No wonder they watched him with those adoring eyes. No wonder they exhibited him, so proud they were. To Delilah, it was a wonder and an irritation that she should be so moved, so thrown off her axis mentally and emotionally by the presence of this great hairy man. All her senses were jangled suddenly. One part of her, the Philistine lady, smiled in a little patronizing contempt for the unconcealed boastfulness of his words, for his insulting glance at the passers-by. But another, a strange Delilah clamored: \"No matter what he says, let him speak on. My heart opens at his voice.... Let him contemn all men with his arrogant eye, but let him not contemn me!\" The Philistine lady had a little disgust for the way he laid his hand on the heads and the shoulders of his followers, pawing them clumsily. But the new Delilah clamored: \"If he lays his hand on me, I shall faint to the ground and die!\" And a burning shame rose in her, and her face reddened. And she said to herself, \"God! God! I have suddenly gone mad!\" All her culture, her tradition, all the fine conventions of her life, seemed suddenly to vanish, become nothing, before this immense male. All the men of her life, friends, her young false lover, relatives seemed like puppets beside him—their shaven faces, their polished speech, their carefulness of dress and demeanor. The rufous giant had appeared, and \"Away,\" he seemed to have cried, and they had whirled off, like blown feathers. If she were troubled, he was troubled too. The directness of him read her perturbation. A great desire rose in the turbulent hillsman to be near her, to know her body and soul. He was accustomed to women, to love women, but never had he known a woman such as this—a beautiful groomed lady who possessed all that was a wonder to him, riches and foreign breeding and a strange, sweet culture. His wife of Timneth had been only a country girl, and his sweethearts of the hills had been tribeswomen, agile, angry as cats, like some hard, harsh fruit, and the women he had known in Gaza were venal women, for every man. But this was a great lady—and she loved him. A great pride, and a great wonder, and desire rose in him. He was stupefied as she. They looked at each other, each reading the other\u0027s thought, until their throats became dry, and all words were just trivial sounds, meaning nothing. Dumb and wondrous he was, and she dumb and bowing with shame. How they parted was to her a mystery, but that their hands touched, and at the touch all her bone and flesh seemed to go liquid, and her knees trembled as with an immensity of fear. And nothing seemed stable in the world but his great hot hand, that trembled too.... Bowed with shame she was, troubled, blind in purpose, all the familiar things of her house and lands were now unfamiliar, unimportant. The long day dragged, and in her heart was a storm, like a hot wind from the desert. She refuged in her inner rooms, in the coolness of her inner rooms, but that brought no relief, and restlessly she must come out again. The Asian sun crept slowly from east to west, but Delilah remained in a dull maze. \"Am I ill?\" she asked. \"Am I stricken with some strange disease?\" But no. \"I am insane,\" she thought. \"I must put it out of my head. I must n\u0027t think.\" Slowly, slowly the day wheeled by; but out of her head it would not go. And her face went white and slowly she whispered to herself: \"I am a bad woman. I never knew before. Oh, shame, shame and woe! I am an evil woman!\" The Asian sun dropped into the hissing sea, and came the soft Syrian dusk, and the swift coolth of the night. The heat of mind and body went with the heat of the day. There remained only a deep longing, that seemed to be a nostalgia of the infinite. Without, the night was blue, there was only a little wind among the apple-trees, and all the flowers had closed until dawn should come, but the birds were unsilent and the earth itself was restless, now spring was here. The night wind cooled her sweet brow and ruffled the dark perfumed hair at her temples. The cool night wind, like cool water. Then arose in Delilah a desire for it, and she wandered out among the vines and apple-trees, touching them, as she passed, in sympathy, for it seemed to her that they must share her yearning. Though all was darkness, yet all was not rest. Somewhere the sheep were grazing, and she could imagine the gods of the nearer East walking the earth, the passionate, seeking gods, the ever-young ones; they walked beside her, their slim, brown, beautiful bodies, their liquid eyes. All the longing of the night came to her lips in a little song—an air, and faltering, unthought words. \"O Spring, which begins now,\" went the throbbing contralto. There was a rustle among the trees. Her heart stopped beating. \"Is some one there? Who is there? Who?\" But she knew well who was there. \"Who is it? Who is it?\" She saw the great bulk in the blue night, like a giant, like some great giant of the earth. \"It is I—Samson.\" \"What—how—\" Words would not come to her. Nor would words mean anything. \"Why—\" She put out her hands—she knew not for what reason, perhaps to thrust him away—her slim white hands in the dusk. He seized them. Once again she throbbed from head to foot, and her knees became weak, and all of her melted. And she fell forward, will having left her, on the great bearded chest. \"I am dying,\" she murmured. \"O my God, I die!\"","sourceLink":"http://novel.tingroom.com/duanpian/3292/90045.html","bookId":459,"book":{"id":459,"title":"Changeling and Other Stories","description":"简介： When it comes to the publishing of books, people are always pessimistic, and, in my case, always right. Success, I am sufficient of a heretic to believe, matters little, but friendship a great deal. And I could as little think of sending a story frie...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3292","creation":"Aug 1, 2019 12:18:47 AM","modification":"Aug 1, 2019 12:18:47 AM"}}
