{"id":26522,"no":14,"title":"CHAPTER VI.","content":"Cheap Fiction—Penny Periodicals. The Railway Libraries—by which generic term we mean single volumes, printed in small type on indifferent paper, and sold mostly at a shilling—are almost wholly devoted to novels, English or American. Whatever be the quality of the fiction so published, we may ask, without any general depreciation of such works, if the popularity of this class of reading has not a tendency to indispose for other reading, however attractive be the mode in which information, historical, critical, or scientific, be presented; and is it not a necessary consequence that books of another character than novels should be compelled to address themselves to a smaller class of readers, and must, therefore, of necessity be dearer? If this be true of the railway books, it is equally true of the weekly sheets. The demand for fiction amongst the largest class of readers has forced upon every weekly periodical the necessity for introducing fiction in some form or other. The writers of eminence cannot put forth their powers in this direction without charging a higher price for their numbers than those in which inferior writers are employed at low salaries. The higher price necessarily induces a smaller sale. The dealers in cheap {278} periodicals say, \"you have no chance for a sale unless you give as much paper as the others give for a penny!\" In this respect, some of the more extensively circulated of these sheets would appear to defy all reasonable competition. They are sold for 50s. per thousand; their paper and machine-work cost, at the very least, 45s. Out of this 5s. per thousand they have to pay their publishing expenses, their writers, their woodcuts, their composition, their stereotype casts. It is a neck-and-neck race for a very doubtful \"plate;\" and what may appear a slight addition to the weight of the \"riders,\" in the shape of another halfpenny a pound upon their paper, would \"distance\" the greater number of them. When the popular estimate of a publication is that of the square inches which it contains of print, it requires no critical judgment to be assured that the amount of genius or knowledge engaged in its production is not very great. Hence, for the most part, a deluge of stories, that, to mention the least evil of them, abound with false representations of manners, drivelling sentimentalities, and impossible incidents. And yet they are devoured with an earnestness that is almost incomprehensible. The moralist may say— \"England, the time is come when thou shouldst wean Thy heart from this emasculating food.\" How is the weaning to be set about for this babyhood of the popular intellect? The insuperable obstacle to a successful competition with the existing class of penny periodicals {279} is their pre-eminence in external cheapness. They were all founded upon the principle of attraction by low price alone. They employed the meanest \"slaves of the lamp\" in their production. Sheets came out double the size of any other penny sheet, badly printed on the thinnest paper, but nevertheless they were the largest sheets; their roots were thus planted in the popular earth. Some who bought them turned away from their filth and their folly; others welcomed these qualities. Gradually the sense of the better class of artisans operated, whilst they continued their offences, to reduce their number of customers. They changed their style; they became decent, but they remained stupid. The weeds were kept down, though not rooted out, in that garden: a few gaudy flowers were planted; fruit there was little. They have maintained their hold, by their external cheapness, against any attempt to produce a higher literature, with better paper and print. They have beaten almost every competitor who has sought to address the same class of buyers with something higher, intrinsically as cheap, but not so cheap to the eye. The unequal war is still being waged. In June, 1846, the last number of \u0027The Penny Magazine\u0027 was published. Mr. Knight, who had been its editor from the commencement, in 1832, thus writes in his concluding \u0027Address to the Reader,\u0027 after stating that there then were published 14 three-halfpenny and penny miscellanies, and 37 weekly sheets, forming separate books:—\"It {280} is from this competition that the \u0027Penny Magazine\u0027 now withdraws itself. Its editor most earnestly wishes success to those who are keeping on their course with honesty and ability.... He rejoices that there are many in the field, and some who have come at the eleventh hour, who deserve the wages of zealous and faithful labourers. But there are others who are carrying out the principle of cheap weekly sheets to the disgrace of the system, and who appear to have got some considerable hold upon the less informed of the working people, and especially upon the young. There are manufactories in London whence hundreds of reams of vile paper and printing issue weekly; where large bodies of children are employed to arrange types, at the wages of shirt-makers, from copy furnished by the most ignorant, at the wages of scavengers. In truth, such writers, if they deserve the name of writers, are scavengers. All the garbage that belongs to the history of crime and misery is raked together, to diffuse a moral miasma through the land, in the shape of the most vulgar and brutal fiction.\" This is a curious and instructive record. \u0027The Penny Magazine,\u0027 popular as it once was, to the extent of a sale of 200,000, could not contend with a cheapness that was wholly regardless of quality; and it could not hold its place amidst this dangerous excitement. The editor had his hands fettered by the necessity of keeping up the purely instructive character of that journal. Without a large supply of fiction {281} it necessarily ceased to be popular. A French writer, who laments over the \"immondices\" of the literature of Paris in 1840, calls for romances \"appropriés par une imagination souple et brillante au go?t des classes laborieuses;\" and he suggests the principle upon which such works should be founded, viz. \"L\u0027étude des m?urs populaires, entreprise par un esprit pénétrant, et dirigée vers un but philosophique.\"[34] The \"immondices\" have for the most part vanished from our English penny literature. The host of penny Newgate novels, whether known as \u0027The Convict,\u0027 \u0027The Feast of Blood,\u0027 \u0027The Murder at the Old Jewry,\u0027 \u0027Claude Duval,\u0027 \u0027The Hangman\u0027s Daughter,\u0027 and so forth, may continue to be sold; but, as far as we can trace, there are no novelties in this once popular literature of the gallows. Abominations, called \u0027Mysteries\u0027 and \u0027Castles,\u0027 still lurk in dark corners; but the bulk of single Penny Novels, and the novels which \"drag their slow length along\" in penny journals, are marvellously changed. The most prudish regard to decency presides over every sentence and syllable. William the Conqueror has lost the brief ignoble title by which the old Saxons designated their oppressor, through a special interdict of the proprietor of one of these papers; and a lady of doubtful character must be mentioned by no more rugged name than that of a belle amie, which may be understood or not. But the \"études des m?urs populaires,\" and the \"but philosophique,\" {282} have not yet entered into the minds of the conductors of these elaborate works. Their scenes are invariably laid in the lord\u0027s palace or the right honourable\u0027s mansion; marriages are made at St. George\u0027s, Hanover Square, and the diamonds are bought at Storr and Mortimer\u0027s. If a young lady, who has the slight misfortune to be connected by the filial tie with a convicted felon, has a quarrel with her juvenile lover, she immediately rushes to the arms of an ancient baronet, who conducts her the next morning to the altar of his parish church. Boileau said of Mademoiselle Scudery, that she would never let her heroine get out of a house till she had taken an inventory of all the furniture. So, for the bewilderment of those who read these weekly novels by the one glimmering candle upon the deal table, their sick ladies recline in easy chairs, \"astral\" lamps diffuse their rich glow upon crimson curtains, and aromatic perfumes fill the air from pastiles burning in miniature castles of gilded porcelain. The style of these productions is magnificent: with golden zones on the summits of the mountains, and roseate tints edging the canopy of heaven; plants drooping with voluptuous languor, and shining insects skimming the air, as if borne on the wings of ardent passion. In all this we are speaking au pied de la lettre. Johnson described three sorts of unnatural style—the bombastic, the affected, and the weak. Most of these performances unite the three qualities, and are equally satisfactory {283} to the \"love of imbecility,\" which Johnson thought was to be found in many. We have only seen one penny journal which places its incidents, and somewhat adapts its language, in consonance with the habits of the classes which these works seek to interest. In \u0027The Leisure Hour,\u0027 issued by the Religious Tract Society, we have an Australian story, with \u0027Sydney by Gaslight.\u0027 We are now amongst convicts, and hear drunken shouts come out from miserable huts. The success of this publication is considerable. Perhaps those who really understand such matters may say of the writer of these laudable attempts to imitate the homely style, something akin to what the great Pierce Egan said of a fashionable novelist twenty years ago—\"Ah! he\u0027s very clever, but uncommon superficial in slang.\" Nevertheless, it is satisfactory to find that a mean has been sought, in the quarter where we might least have expected it, between the representations of humble and even of low life which are corrupting, and those pretended pictures of society which exhibit no life at all. In the number of \u0027The Leisure Hour\u0027 for February 16, 1854, there is a clever woodcut of a night auction at Sydney, which is as suggestive of a congregation of real vulgar sellers and bidders, with the necessary accompaniments of gin and tobacco, as might be connected with any of the exciting scenes of \u0027Life in London\u0027 at any period. The pictures of the penny sheets which the masses now greedily buy {284} are quite genteel. This is something to reflect upon. Some of the members of the Tract Society may think that \"Chaos is come again.\" We do not. This sort of subject will be attractive to the better portion of male readers amongst the artisans, and especially amongst the very large number who belong to \"temperance societies;\" but for the girls, who devour the novels of the other penny journals, certainly not. Those who have been watching the workings of the penny literature are unanimous in their conviction that very few men read these mawkish and unnatural fictions. The readers for the most part belong, in point of cultivation, to the same class of females, who, half a century ago, gave up their whole leisure—if they did not neglect every domestic duty—for the ghosts and the elopements of \u0027The Minerva Press.\u0027 The intelligence of the readers is the same, however widened the attraction. But, with all their bad taste, there is partial merit and manifest utility in some portions of the best of these penny journals. \u0027The Family Herald\u0027 has constantly a serious article of great good sense and shrewdness. This paper, and one or two others, have pages of \"Answers to Correspondents,\" which, for the most part, contain useful information and judicious advice. Real young ladies often pour their doubts into the ear of this \"Family\" oracle, about love, and courtship, and marriage; and, as far as we can judge, receive very safe counsel. In the whole range of these things we can detect nothing {285} that bears a parallel with what used to be called \"the blasphemous and seditious press.\" Neither, although these papers do not wholly abstain from comment upon what is passing in the world, can they be called newspapers. We see, however, that the new trump of war is calling up again one or two of the old class of unstamped violators of the law. In quiet times they cannot flourish. They may be difficult to suppress, \u0027Now all the youth of England are on fire.\u0027","sourceLink":"http://novel.tingroom.com/duanpian/3324/91043.html","bookId":389,"book":{"id":389,"title":"The Old Printer and the Modern Press","description":"简介： The Weald of KentCaxton\u0027s School-daysFrench disusedEnglish taughtVariations in EnglishBooks before PrintingLibrariesTranscribersBooks for the GreatBook TradeNo Books for the PeopleChanges produced by Printing....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3324","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
