{"id":26512,"no":4,"title":"CHAPTER IV.","content":"The Court of Burgundy—Caxton a Translator—Literature of Chivalry—Feudal Times—Caxton at the Ducal Court—Did Caxton print at Bruges—Edward the Fugitive—The new Art. The \"most dear\" Duke of Burgundy, with whom Caxton was appointed to negotiate in 1464, was Philip, surnamed the Good. He was a wise and peaceful prince, and honourably earned his title. We know not whether Caxton was in immediate attendance upon the court of Philip from the commencement of his mission until the death of the duke in 1467; but the evidence is subsequently clear that he was about the court in some office of trust after the succession to the dukedom of the eldest son of Philip, the Count of Charolois. The character of this prince was entirely opposed to that of his father; and he acquired the name of Charles le Téméraire, or the Rash. This fiery prince, whose influence in that warlike age was perhaps greater than the benignant power of his father, was not likely to have looked very favourably upon an envoy from Edward of England: for he was allied by blood on his mother\u0027s side to the house of Lancaster, and was consequently opposed to the fortunes of the house of York. The court of Burgundy was the resort of many of the adherents {63} of that unhappy house, who had fled from England after many a vain struggle with the triumphant Edward. These fugitives are described by Comines \"as young gentlemen whose fathers had been slain in England, whom the Duke of Burgundy had generously entertained as his relations of the house of Lancaster.\" Comines adds, \"Some of them were reduced to such extremity of want and poverty before the Duke of Burgundy received them, that no common beggar could have been in greater; I saw one of them, who was Duke of Exeter (but he concealed his name), following the Duke of Burgundy\u0027s train bare-foot and barelegged, begging his bread from door to door: this person was the next of the house of Lancaster; had married King Edward\u0027s sister: and being afterwards known, had a small pension allowed him for his subsistence. There were also some of the family of the Somersets, and several others, all of them slain since, in the wars.\" But the policy of Charles of Burgundy, after his accession to the dukedom, led him to consider the ties of ancient friendship as of far less importance than the strengthening of his hand by an alliance with the successful house of York. Within a year of his accession he married Margaret, sister of Edward IV. Comines says this marriage \"was principally to strengthen his alliance against the king of France, otherwise he would never have done it, for the love he bore to the house of Lancaster.\" The establishment of Margaret as Duchess of Burgundy {64} gave a direction to the fortunes of William Caxton, and was in all likelihood the proximate cause that he was our first English printer. Margaret Plantagenet was married to Charles of Burgundy at the city of Bruges, on the 3rd of July, 1468. We have the distinct evidence of Caxton that he was residing at Bruges some months previous to the marriage; that he had little to do; and that he employed his leisure in literary pursuits. In his \u0027Recuyell of the Historyes of Troye\u0027 it is stated in the title-page, \"which said translation and work was begun in Bruges, in the county of Flanders, the first day of March, the year of the Incarnation a thousand, four hundred, sixty and eight.\" The prologue begins as follows:—\"When I remember that every man is bounden by the commandment and counsel of the wise man to eschew sloth and idleness, which is mother and nourisher of vices, and ought to put myself unto virtuous occupation and business, then I, having no great charge or occupation, following the said counsel, took a French book and read therein many strange marvellous histories, wherein I had great pleasure and delight, as well for the novelty of the same, as for the fair language of the French, which was in prose so well and compendiously set and written, methought I understood the sentence and substance of every matter. And for so much as this book was new and late made and drawn into French, and never had seen it in our English tongue, I thought in myself it should be a good business to {65} translate it into our English, to the end that it might be had as well in the royaume of England as in other lands, and also for to pass therewith the time, and thus concluded in myself to begin this said work, and forthwith took pen and ink, and began boldly to run forth, as blind Bayard, in this present work.\" Philip de Comines, speaking of the prosperity of the people at the time of the accession of Charles, says, \"The subjects of the house of Burgundy lived at that time in great plenty and prosperity, grew proud and wallowed in riches.... The expenses and habits both of women and men were great and extravagant; their entertainments and banquets more profuse and splendid than in any other place that I ever saw.\" The city of Bruges was then the great seat of this wealth and luxury. The Flemish nobles lived here in mansions of striking architecture, some traces of which still remain. The merchants vied with the nobles in tasteful magnificence. The canals of Bruges were crowded with boats laden with the richest treasures of distant lands. It was commerce that made the inhabitants of Bruges, of Ghent, and the other great Flemish towns so rich and powerful; and the same commerce was the encourager of art, which even at this early period displayed itself amongst a people naturally disposed for its cultivation. Charles the Rash destroyed much of this prosperity by his aptitude for war. But in the onset of his career he fought with all the pomp and {66} graces of the old chivalry, and his court was the seat of such romantic pageantries that John Paston, an Englishman who went over with Margaret of York, writes, \"As for the duke\u0027s court, as for lords, ladies, and gentlewomen, knights, esquires, and gentlemen, I heard never of none like to it save King Arthur\u0027s court.\" It was here, without doubt, that William Caxton, the yeoman\u0027s son of the Weald of Kent, and afterwards the mercer\u0027s apprentice of the city of London, acquired that love for the literature of chivalry which he displays on many occasions in his office of translator and printer. Here he made acquaintances that led him to the study of the romance-writers, as for example of a worthy canon of whom he writes, \"Oft times I have been excited of the venerable man Messire Henry Bolomyer canon of Lausanne, for to reduce for his pleasure some histories, as well in Latin and in romance as in other fashion written; that is to say, of the right puissant, virtuous, and noble Charles the Great, King of France and Emperor of Rome, son of the great Pepin, and of his princes and barons, as Rowland, Oliver, and other.\" His zeal for this species of literature left him not in his latest years: for in his translation of \u0027The Book of the Order of Chivalry,\u0027 which was printed by him about 1484, he rises into absolute eloquence in his address at the conclusion of the volume: \"Oh, ye knights of England, where is the custom and usage of noble chivalry that was used in those days? What do ye now, but go to the baynes [baths] and {67} play at dice? And some, not well advised, use not honest and good rule, against all order of knighthood. Leave this, leave it! and read the noble volumes of St. Graal, of Lancelot, of Galaad, of Trystram, of Perse Forest, of Percyval, of Gawayn, and many more: there shall ye see manhood, courtesy, and gentleness. And look in latter days of the noble acts sith the Conquest, as in King Richard days C?ur de Lion, Edward I., and III. and his noble sons, Sir Robert Knolles, Sir John Hawkwode, Sir John Chandos, and Sir Gueltiare Manny. Read Froissart; and also behold that victorious and noble King Harry V., and the captains under him, his noble brethren the earls of Salisbury, Montagu, and many other, whose names shine gloriously by their virtuous noblesse and acts that they did in the honour of the order of chivalry. Alas, what do ye but sleep and take ease, and are all disordered from chivalry?\" Caxton was dazzled, as many others were, with the bravery and the generosity of the chivalric character. He did not see the cruelty and pride, the oppression and injustice, that lurked beneath the glittering armour and the velvet mantle. Yet he was amongst those who first helped to destroy the gross inequality upon which chivalry was founded, by raising up the middle classes to the possession of knowledge. There were scenes transacting at Bruges, even at the very hour when Margaret of York came to give her hand to Charles of Burgundy, that must have shown him what {68} fearful passions were too often the companions of the courage and graces of knighthood. At the midsummer of 1468 Bruges presented a scene of magnificence that was probably unequalled in those days of costly display. On the occasion of the approaching marriage, the nobility of Charles\u0027s extensive dominions arrived from every quarter. Ambassadors were there from all Christian powers. It looked like an occasion on which men should forget that there was such a thing as war in the world; and when despotism should put on its blandest smile and its most courteous reverence for all orders of men. The Duke of Burgundy anxiously desired the presence of the Count de St. P?l, the great Constable of France. The constable arrived, surrounded with every pomp that his pride could devise,—with trumpets and banners, with pages on foot and crowds of horsemen, and a naked sword borne before him as the symbol of sovereignty. Charles was irritated beyond measure, and refused to receive the great lord, who from that hour became his deadliest enemy. But there was something more tragic to be enacted in the midst of a population looking only for high triumphs and royal pleasures. One of the chamberlains of the Duke of Burgundy was an illegitimate son of the Lord of Condé; he was very young, of exceeding beauty, and the most agreeable manners. He had fought by the side of the duke at the battle of Montlhéry, and was one of his most especial favourites. The youth, with that {69} ferocious self-abandonment which was not incompatible with the gentlest manners in courts and the noblest honours in camps, committed a murder under circumstances of extraordinary aggravation. He was playing at tennis, and, the fairness of a stroke being doubtful, a bystander was called upon to decide. Deciding against the Bastard of Condé, the young man swore that he would be revenged. The bystander, who was a canon of the church, fled to his home, and the furious youth pursued him. The canon escaped, but his brother encountered the madman. Some victim must be offered up to appease his selfish rage, and the brother was in his path. The wretched man fell on his knees, and, clasping his hands, begged for mercy. Those uplifted hands were cut off in an instant, and the sword that had been honourably drawn at Montlhéry, pierced the breast of an unoffending citizen. Such a murder could not pass unnoticed; and yet the young man\u0027s friends did not doubt that he would go unpunished, for he had committed the crime in his father\u0027s lordship. Such crimes were often committed with impunity by the great and the powerful; and even the commonalty were unprepared to expect any heavier punishment than a pecuniary recompense to the relations of the murdered man. The duke, however, had taken his determination. The Bastard of Condé was held in arrest at the house of the gatekeeper of the city of Bruges. Charles was solicited on every side for pardon, and even the relations of the deceased, {70} having been moved by suitable presents, supplicated his release; but the duke kept the matter in suspense till Bruges was filled with his subjects from every part of his dominions, and especially with the most powerful of his nobles. At the instant that he was ready to depart to meet the Lady Margaret at the neighbouring port of Ecluse, he commanded that the young man should be taken to the common prison, and the next morning led to execution. Even the magistrate of the city to whom this command was intrusted thought it impossible that the duke should execute one so highly connected, as if he were a common offender. The execution was delayed several hours by the magistrate in the hope that the duke would relent; but no respite came. The youth was carried through the city to the place of execution, amidst the tears of the people, who forgot his crime in his beauty. He was beheaded, and his body divided into four quarters. The Lord of Condé and his adherents left the city vowing vengeance. The nobles assembled felt themselves outraged by this exercise of absolute power. Even the citizens attributed the stern decree of the duke to his indomitable pride rather than to his love of justice. Such was the prelude to the bridal festivities of the court of Burgundy; of which one who wrote an especial description in Latin says, \"The sun never shone upon a more splendid ceremony since the creation of the world.\" There can be no doubt that Caxton was in the {71} direct employ of Margaret, Duchess of Burgundy. What he has told us himself of his position in her court is far more interesting than all the conjectures which his biographers have exercised upon the matter. He was in an honourable position, he was treated with confidence, he was grateful. We have already given an extract from the prologue to his \u0027Recuyell of the Historyes of Troye,\u0027 which shows when and under what circumstances he commenced the translation of that work. Remembering his simpleness and unperfectness in the French and English languages (which passage we have already noticed), he continues: \"When all these things came before me, after that I had made and written five or six quires, I fell in despair of this work, and purposed no more to have continued therein, and the quires laid apart; and in two years after laboured no more at this work, and was fully in will to have left it. Till on a time it fortuned that the right high, excellent, and right virtuous princess, my right redoubted lady, my Lady Margaret\"—and then he gives her a host of titles—\"sent for me to speak with her good grace of divers matters, among the which I let her highness have knowledge of the aforesaid beginning of this work; which anon commanded me to shew the said five or six quires to her said grace. And when she had seen them, anon she found defaute [fault] in mine English, which she commanded me to amend, and moreover commanded me straightly [immediately] to continue and make an {72} end of the residue then not translated. Whose dreadful commandment I durst in no wise disobey, because I am a servant unto her said grace, and receive of her yearly fee, and other many good and great benefits, and also hope many more to receive of her highness; but forthwith went and laboured in the said translation after my simple and poor cunning, all so nigh as I can following mine author, meekly beseeching the bounteous highness of my said lady, that of her benevolence list to accept and take in gree [take kindly] this simple and rude work.\" The picture which Caxton thus presents to us of his showing his translation with an author\u0027s diffidence to the \"dreadful\" duchess, her criticism of his English, and her very flattering command that in spite of all its faults he should make an end of his work, is as interesting as Froissart\u0027s account of his literary recreations with Gaston de Foix:—\"The acquaintance of him and of me was because I had brought with me a book, which I made at the contemplation of Winceslaus of Bohemia, Duke of Luxembourg and of Brabant, which work was called \u0027Meliador,\u0027 containing all the songs, ballads, rondeaux, and virelays which the gentle duke had made in this time, which by imagination I had gathered together; which book the Count of Foix was glad to see. And every night after supper I read therein to him; and while I read there was none durst speak any word, because he would I should be well understood, wherein he took great solace.\" In both cases the {73} men of letters were received on a free and familiar footing in the courtly circles. In the case of Caxton this was even more honourable to the Lady Margaret, than the welcome which Gaston de Foix gave to the accomplished knight Sir John Froissart. Caxton had no knightly honours to recommend him; he was a plain merchant: but he was unquestionably a man of modesty and intelligence; he had travelled much; he was familiar with the most popular literature of his day; and he desired to extend the knowledge of it by translations into his native language. It is difficult to say what was his exact employment in the court of the Lady Margaret. He was somewhat too old to partake of its light amusements, to mingle in its gallantries, or even to prompt my lady\u0027s fool with some word of wisdom. We have seen that four months before Margaret of York came to Bruges he had \"no great charge or occupation,\" and he undertook the translation of a considerable work \"for to pass therewith the time.\" It has, however, been maintained of late years, that Caxton was at this very time a printer. The question is a curious one, and we may bestow a little space upon its examination. Mr. Hallam, in his \u0027Literature of Europe,\u0027 noticing the progress of printing, says that several books were printed in Paris in 1470 and 1471, adding, \"But there seem to be unquestionable proofs that a still earlier specimen of typography is due to an English printer, the famous Caxton. His \u0027Recueil {74} des Histoires de Troye\u0027 appears to have been printed during the life of Philip, Duke of Burgundy, and consequently before June 15, 1467. The place of publication, certainly within the duke\u0027s dominions, has not been conjectured. It is, therefore, by several years the earliest printed book in the French language. A Latin speech by Russell, ambassador of Edward IV. to Charles of Burgundy, in 1469, is the next publication of Caxton. This was also printed in the Low Countries.\" The authority upon which the learned and accomplished historian of the Middle Ages relies for this statement is that of Mr. Dibdin, in his \u0027Typographical Antiquities.\u0027 The French edition of the \u0027Recueil des Histoires de Troye\u0027 bears no printer\u0027s name, date, or place. It purports to have been composed by Raoul le Fevre, chaplain to Duke Philip de Bourgoyne, in the year 1464. The evidence that this book was printed by Caxton was summed up by Mr. Bryant, and communicated by him to Mr. Herbert, the first editor of Ames\u0027s \u0027Typographical Antiquities.\u0027 The Rev. Mr. Dibdin, the second editor, says that these memoranda of Mr. Bryant\u0027s \"clearly prove it to have been the production of Caxton.\" The argument rests upon these points: that the French and English editions of Le Fevre\u0027s work have an exact conformity and likeness throughout, for not only the page itself, but the number of lines in a page, the length, breadth, and intervals of the lines, are alike in both, and the letters, great and small, are of the same {75} magnitude. It corresponds too with \u0027The Game of the Chess,\u0027 printed by Caxton in England, in 1474. \"These considerations,\" says Mr. Bryant, \"settle who the printer was.\" We venture to doubt this. Mr. Bryant has himself shown how this resemblance might be produced between books printed by Caxton, and books supposed to be printed by him, without Caxton being the actual printer. \"Mentz was taken by the Duke of Saxony in the year 1462, and most of the artificers employed by John Fust, the great inventor, were dispersed abroad. I make no doubt but Caxton, who was at no great distance from Mentz, took this opportunity of making himself a master of the mystery, which he had been at much trouble and expense to obtain. This I imagine he effected by taking into pay some of Fust\u0027s servants, and settling them for a time at Cologne. Of this number probably were Pinson and Rood, Mechlin, Lettou, and Wynkyn de Worde. With the help of some of these, he printed the book [which Wynkyn de Worde says Caxton printed] \u0027Bartholomeus de Prop. Rerum,\u0027 and the translation of the \u0027Recueil;\u0027 and probably many other books, which, being either in French or Latin, were not vendible in our country, and consequently no copies are extant here. Of all the books he printed in England, I do not remember above one in a foreign language.\" The calamity which drove the printers of Mentz from their homes, the storming of the city by Adolphus of Nassau, would naturally disperse their types, as well as break up {76} their workshops. The resemblance between the doubtful books, and books undoubtedly printed by Caxton, was the resemblance of types cast in the same matrices; the spaces between the lines, as well as the form and magnitude of the letters, were produced by the letters being cast in the same mould. The resemblance would have been equally produced whether the types were used by one and the same printer, or by two printers. The typographical antiquarians say that the same types are used in the French and English works of Le Fevre and in Caxton\u0027s \u0027Game of Chess;\u0027 and Mr. Herbert adds, that the types are the same as those used by Fust and Schoeffer, the partners of Guttenberg. If the resemblance of types were sufficient to determine the printer of two or more books, then Fust and Schoeffer ought to be called the printers of the French \u0027Recueil,\u0027 as well as of the English translation which Caxton says he printed at Cologne. There can be little doubt that, when Caxton went to Cologne to be a printer in 1471, he became possessed of the types and matrices with which he printed his translation of Le Fevre, and subsequently brought to England to print his \u0027Game of Chess.\u0027 Another printer might have preceded him in their possession, and might have received them direct from Fust and Schoeffer. When the art ceased to be a mystery, a profit might arise from selling the types or multiplying the matrices. Upon these considerations we wholly demur to the assertion, resting solely upon this {77} resemblance, that Caxton was a printer during the life of Philip le Bon. The belief is entirely opposed to his own statement, that shortly after the death of this prince he was completely at leisure, and set about a translation to while away his time. To be a printer in those days was a mighty undertaking. We shall subsequently see that he declares that he had practised and learnt the art at great charge and expense. It is wholly unlikely, also, that so gossiping a man, who makes a familiar friend of his readers, telling them of almost every circumstance that led to the printing of every book, that he in his translation should not have said one word of being the printer of the original work. The other book, the Latin speech by Russell, in 1469, which has been called the second publication of Caxton, is attributed to him absolutely upon no other grounds than the same resemblance of type. Assuredly we cannot receive the fact of resemblance as conclusive of Caxton being the printer either in this case or in that of the preceding. He tells us that in 1470 he was a servant receiving yearly fee from the Duchess of Burgundy, and completed an extensive work at her command, which he simply began \"to eschew sloth and idleness,\" and to put himself \"unto virtuous occupation and business.\" When he did fairly become a printer, he left sufficiently clear indications of his habitual industry. We have no question how he filled up his time when the press at Westminster was at work. {78} It was in the autumn of 1470, when Master William Caxton would appear to have been busily labouring in some silent turret of the palace at Bruges, upon his translation of Raoul le Fevre, that an event occurred, of all others the most calculated to spread consternation in the court of Burgundy, and to make the bold duke feel that in abandoning his family alliance with the house of Lancaster he had not done the politic thing which he anticipated. Edward IV., who had sat for some years with tolerable quiet upon the English throne, to which he had fought his way in many a battlefield with prodigious bravery, suddenly arrived at Bruges, in the October of 1470, a discrowned fugitive. He made his escape from the overwhelming inroad of the power of Warwick, \"attended,\" says Comines, \"by seven or eight hundred men without any clothes but what they were to have fought in, no money in their pockets, and not one in twenty of them knew whither they were going.\" He, the most beautiful man of the time, as Comines describes him,—who for twelve or thirteen years of prosperity had lived a life of the most luxurious gratification,—he arrived at Bruges, after being chased by privateers, and with difficulty rescued from their hands, so poor that he \"was forced to give the master of the ship for his passage a gown lined with martens.\" At Bruges, then, did this fugitive remain nearly five months, when he again leaped into his throne, in the following April, with a triumphant boldness which has only one parallel {79} in modern history,—that of the march of Napoleon from Elba. In May, 1471, he addressed a letter in French to the nobles and burgomasters of Bruges, thanking them for the courtesy and hospitality he had received from them during his exile. Edward was of a sanguine temper; and, however depressed in fortune, was not likely, during those five months of humiliation, to have doubted that in good time he should regain the throne. He was of an easy and communicative disposition; and would naturally confer with his sister and her confidential servants upon his plans and prospects. Comines says, \"King Edward told me that, in all the battles which he had gained, his way was, when the victory was on his side, to mount on horseback, and cry out to save the common soldiers, and put the gentry to the sword.\" We mention this to show that he was not indisposed to talk of himself and his doings with those whom he met during his exile. It is more than probable, then, that he had the same sort of free communication with his countryman Caxton. It was at this period that the progress of the art of printing must have been a subject of universal interest The merchants of Bruges had commercial intercourse with all the countries of Europe; and they would naturally bring to the court of Burgundy some specimens of that art which was already beginning to create a new description of commerce. From Mentz, Bamberg, Cologne, Strasburg, and Augsburg, they would bring some of the Latin and German bibles {80} which, from 1461 to 1470, had issued from the presses of those cities. The presses of Italy, and especially of Rome, of Venice, and of Milan, had, during the same period, sent forth books, and more particularly classical works, in great abundance. The art had made such rapid progress in Italy, that in the first edition of St. Jerome\u0027s Epistles, printed in 1468, the Bishop of Aleria thus addresses Pope Paul II.: \"It was reserved for the times of your holiness for the Christian world to be blessed with the immense advantages resulting from the art of printing; by means of which, and with a little money, the poorest person may collect together a few books. It is a small testimony of the glory of your holiness, that the volumes which formerly scarcely an hundred golden crowns would purchase may now be procured for twenty and less, and these well-written and authentic ones.\" It is pretty clear that Caxton, when he began his translation of the \u0027Histories of Troye,\u0027 had some larger circulation in view than could be obtained by the medium of transcription: \"I thought in myself it should be a good business to translate it into our English, to the end that it might be had as well in the royaume of England as in other lands.\" It is also probable that he was moving about in search of the best mode of printing it; for he says, at the end of the second book of the \u0027Recueil,\u0027 \"And for as much as I suppose the said two books be not had before this time in our English language, therefore I had the better will {81} to accomplish the said work; which work was begun in Bruges, and continued in Gaunt [Ghent], and finished in Cologne, in time of the troublous world, and of the great divisions being and reigning as well in the royaumes of England and France as in all other places universally through the world, that is to wit, the year of our Lord one thousand, four hundred, and seventy-one.\" But he further says, with reference to his translation of the third book, which he doubted about doing, \"because that I have now good leisure, being in Cologne, and have none other thing to do at this time in eschewing of idleness, mother of all vices, I have deliberated in myself of the contemplation of my said redoubted lady, to take this labour in hand.\" We shall presently see when Caxton became, or at any rate avowed himself to have become, a printer. Up to this point we see him only as a translator, a man of leisure, and not one learning a new and difficult craft. But we see him moving about from Bruges to Ghent, from Ghent to Cologne, without any distinct or specified object. There can be little doubt, we believe, that he was endeavouring to make himself acquainted with the new art, still in great measure a secret art, the masters of which required to be approached with considerable caution. That the presence of Edward IV. in Flanders, during a period when Caxton might readily have had access to his person, might have led him to believe that the time would come when, under the patronage of the restored prince, he might carry {82} the art to London, is not an improbable conjecture. Amongst the companions of Edward\u0027s exile was his brother-in-law, the celebrated Lord Rivers. This brave and accomplished young nobleman subsequently translated a book called \u0027The Dictes and Sayings of Philosophers,\u0027 which Caxton printed at Westminster, in 1477. The printer has added an appendix to this translation, from which we collect that the noble author and his literary printer were upon terms of mutual confidence and regard: \"At such time as he had accomplished this said work, it liked him to send it to me in certain quires to oversee.... And so afterward I came unto my said lord, and told him how I had read and seen his book, and that he had done a meritorious deed in the labour of the translation thereof.... Then my said lord desired me to oversee it, and, where as I should find fault, to correct it, wherein I answered unto his lordship that I could not amend it.... Notwithstanding he willed me to oversee it.\" Earl Rivers, then Lord Scales, was also at Bruges upon the occasion of the Lady Margaret\u0027s marriage. Employed, therefore, by the Duchess of Burgundy, the sister of Edward IV., and honoured with the confidence of Earl Rivers, his brother-in-law, we may reasonably believe that the presence of Edward at Bruges in 1470-71 might have had some influence upon the determination of Caxton to learn and practise the new art of printing, and to carry it into England, if the \"troublous times\" could afford him occasion. We {83} have distinct evidence that Edward IV. gave a marked encouragement to the labours of Caxton as a translator, in a book printed by him without any date, \u0027The Life of Jason,\u0027 written, as were the \u0027Histories of Troy,\u0027 by Raoul le Fevre, in which Caxton says in his prologue, \"For as much as late by the commandment of the right high and noble princess my Lady Margaret, \u0026c., I translated a book out of French into English, named \u0027Recueil,\u0027 \u0026c.... Therefore, under the protection and sufferance of the most high, puissant, and Christian king, my most dread natural liege, Lord Edward, \u0026c., I intend to translate the said book of the \u0027Histories of Jason.\u0027\" The expression \"for as much as late by the commandment, \u0026c.,\" brings the date of the \u0027Histories of Jason\u0027 close to that of the \u0027Histories of Troy\u0027 and points out the probability that the protection and sufferance of Edward was afforded to Caxton when the king was a fugitive at the court of Burgundy. In the \u0027Issues of the Exchequer,\u0027 there is the following entry of a payment on the 15th of June, in the 19th of Edward IV., \"To William Caxton, in money paid to his own hands, in discharge of twenty pounds which the lord the king commanded to be paid to the same William for certain causes and matters performed by him for the said lord the king.\" This is eight years after the period of Edward\u0027s exile, being in 1479. But as the productions of Caxton\u0027s press were very prolific at this time, we may believe that the payment of such a large sum for certain {84} causes and matters performed for the king was in some degree connected with his labours in the introduction of printing into England,—a payment not improbably postponed for obligations incurred, and promises granted, at an earlier period. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3324/91033.html","bookId":389,"book":{"id":389,"title":"The Old Printer and the Modern Press","description":"简介： The Weald of KentCaxton\u0027s School-daysFrench disusedEnglish taughtVariations in EnglishBooks before PrintingLibrariesTranscribersBooks for the GreatBook TradeNo Books for the PeopleChanges produced by Printing....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3324","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
