{"id":3574,"no":47,"title":"MEANWHILE, BACK ON THE WALL . . .","content":"Hey, wait a minute!” some of you may be saying about now. “Wait a minute, wait a minute! Where’s Dany and the dragons? Where’s Tyrion? We hardly saw Jon Snow. That can’t be all of it. . . .” \\n\\n \\n\\n Well, no. There’s more to come. Another book as big as this one. \\n\\n \\n\\n I did not forget to write about the other characters. Far from it. I wrote lots about them. Pages and pages and pages. Chapters and more chapters. I was still writing when it dawned on me that the book had become too big to publish in a single volume . . . and I wasn’t close to finished yet. To tell all of the story that I wanted to tell, I was going to have to cut the book in two. \\n\\n \\n\\n The simplest way to do that would have been to take what I had, chop it in half around the middle, and end with “To Be Continued.” The more I thought about that, however, the more I felt that the readers would be better served by a book that told all the story for half the characters, rather than half the story for all the characters. So that’s the route I chose to take. \\n\\n \\n\\n Tyrion, Jon, Dany, Stannis and Melisandre, Davos Seaworth, and all the rest of the characters you love or love to hate will be along next year (I devoutly hope) in A Dance with Dragons, which will focus on events along the Wall and across the sea, just as the present book focused on King’s Landing. \\n\\n \\n\\n —George R. R. Martin \\n\\n June 2005 \\n\\n \\n\\n APPENDIX \\n\\n THE KINGS AND THEIR COURTS \\n\\n \\n\\n Heraldic crest \\n\\n \\n\\n THE QUEEN REGENT \\n\\n \\n\\n CERSEI LANNISTER, the First of Her Name, widow of {King Robert I Baratheon}, Queen Dowager, Protector of the Realm, Lady of Casterly Rock, and Queen Regent, \\n\\n \\n\\n —Queen Cersei’s children: \\n\\n \\n\\n —{KING JOFFREY I BARATHEON}, poisoned at his wedding feast, a boy of twelve, \\n\\n \\n\\n —PRINCESS MYRCELLA BARATHEON, a girl of nine, a ward of Prince Doran Martell at Sunspear, \\n\\n \\n\\n —KING TOMMEN I BARATHEON, a boy king of eight years, \\n\\n \\n\\n —his kittens, SER POUNCE, LADY WHISKERS, BOOTS, \\n\\n \\n\\n —Queen Cersei’s brothers: \\n\\n \\n\\n —SER JAIME LANNISTER, her twin, called THE KINGSLAYER, Lord Commander of the Kingsguard, \\n\\n \\n\\n —TYRION LANNISTER, called THE IMP, a dwarf, accused and condemned for regicide and kinslaying, \\n\\n \\n\\n —PODRICK PAYNE, Tyrion’s squire, a boy of ten, \\n\\n \\n\\n —Queen Cersei’s uncles, aunt, and cousins: \\n\\n \\n\\n —SER KEVAN LANNISTER, her uncle, \\n\\n \\n\\n —SER LANCEL, Ser Kevan’s son, her cousin, formerly King Robert’s squire and Cersei’s lover, newly raised to Lord of Darry, \\n\\n \\n\\n —{WILLEM}, Ser Kevan’s son, murdered at Riverrun, \\n\\n \\n\\n —MARTYN, twin to Willem, a squire, \\n\\n \\n\\n —JANEI, Ser Kevan’s daughter, a girl of three, \\n\\n \\n\\n —LADY GENNA LANNISTER, Cersei’s aunt, m. Ser Emmon Frey, \\n\\n \\n\\n —{SER CLEOS FREY}, Genna’s son, killed by outlaws, \\n\\n \\n\\n —SER TYWIN FREY, called TY, Cleos’s son, \\n\\n \\n\\n —WILLEM FREY, Cleos’s son, a squire, \\n\\n \\n\\n —SER LYONEL FREY, Lady Genna’s second son, \\n\\n \\n\\n —{TION FREY}, Genna’s son, murdered at Riverrun, \\n\\n \\n\\n —WALDER FREY, called RED WALDER, Lady Genna’s youngest son, a page at Casterly Rock, \\n\\n \\n\\n —TYREK LANNISTER, Cersei’s cousin, son of her father’s late brother Tygett, \\n\\n \\n\\n —LADY ERMESANDE HAYFORD, Tyrek’s child wife, \\n\\n \\n\\n —JOY HILL, bastard daughter of Queen Cersei’s lost uncle Gerion, a girl of eleven, \\n\\n \\n\\n —CERENNA LANNISTER, Cersei’s cousin, daughter of her late uncle Stafford, her mother’s brother, \\n\\n \\n\\n —MYRIELLE LANNISTER, Cersei’s cousin and Cerenna’s sister, daughter of her uncle Stafford, \\n\\n \\n\\n —SER DAVEN LANNISTER, her cousin, Stafford’s son, \\n\\n \\n\\n —SER DAMION LANNISTER, a more distant cousin, m. Shiera Crakehall, \\n\\n \\n\\n —SER LUCION LANNISTER, their son, \\n\\n \\n\\n —LANNA, their daughter, m. Lord Antario Jast, \\n\\n \\n\\n —LADY MARGOT, a cousin still more distant, m. Lord Titus Peake, \\n\\n \\n\\n —King Tommen’s small council: \\n\\n \\n\\n —{LORD TYWIN LANNISTER}, Hand of the King, \\n\\n \\n\\n —SER JAIME LANNISTER, Lord Commander of the Kingsguard, \\n\\n \\n\\n —SER KEVAN LANNISTER, master of laws, \\n\\n \\n\\n —VARYS, a eunuch, master of whisperers, \\n\\n \\n\\n —GRAND MAESTER PYCELLE, counselor and healer, \\n\\n \\n\\n —LORD MACE TYRELL, LORD MATHIS ROWAN, LORD PAXTER REDWYNE, counselors, \\n\\n \\n\\n —Tommen’s Kingsguard: \\n\\n \\n\\n —SER JAIME LANNISTER, Lord Commander, \\n\\n \\n\\n —SER MERYN TRANT, \\n\\n \\n\\n —SER BOROS BLOUNT, removed and thence restored, \\n\\n \\n\\n —SER BALON SWANN, \\n\\n \\n\\n —SER OSMUND KETTLEBLACK, \\n\\n \\n\\n —SER LORAS TYRELL, the Knight of Flowers, \\n\\n \\n\\n —SER ARYS OAKHEART, with Princess Myrcella in Dorne, \\n\\n \\n\\n —Cersei’s household at King’s Landing: \\n\\n \\n\\n —LADY JOCELYN SWYFT, her companion, \\n\\n \\n\\n —SENELLE and DORCAS, her bedmaids and servingwomen, \\n\\n \\n\\n —LUM, RED LESTER, HOKE, called HORSELEG, SHORT-EAR, and PUCKENS, guardsmen, \\n\\n \\n\\n —QUEEN MARGAERY of House Tyrell, a maid of sixteen, widowed bride of King Joffrey I Baratheon and of Lord Renly Baratheon before him, \\n\\n \\n\\n —Margaery’s court at King’s Landing: \\n\\n \\n\\n —MACE TYRELL, Lord of Highgarden, her father \\n\\n \\n\\n —LADY ALERIE of House Hightower, her mother, \\n\\n \\n\\n —LADY OLENNA TYRELL, her grandmother, an aged widow called THE QUEEN OF THORNS, \\n\\n \\n\\n —ARRYK and ERRYK, Lady Olenna’s guards, twins seven feet tall called LEFT and RIGHT, \\n\\n \\n\\n —SER GARLAN TYRELL, Margaery’s brother, THE GALLANT, \\n\\n \\n\\n —his wife, LADY LEONETTE of House Fossoway, \\n\\n \\n\\n —SER LORAS TYRELL, her youngest brother, the Knight of Flowers, a Sworn Brother of the Kingsguard, \\n\\n \\n\\n —Margaery’s lady companions: \\n\\n \\n\\n —her cousins, MEGGA, ALLA, and ELINOR TYRELL, \\n\\n \\n\\n —Elinor’s betrothed, ALYN AMBROSE, squire, \\n\\n \\n\\n —LADY ALYSANNE BULWER, a girl of eight, \\n\\n \\n\\n —MEREDYTH CRANE, called MERRY, \\n\\n \\n\\n —LADY TAENA MERRYWEATHER, \\n\\n \\n\\n —LADY ALYCE GRACEFORD, \\n\\n \\n\\n —SEPTA NYSTERICA, a sister of the Faith, \\n\\n \\n\\n —PAXTER REDWYNE, Lord of the Arbor, \\n\\n \\n\\n —his twin sons, SER HORAS and SER HOBBER, \\n\\n \\n\\n —MAESTER BALLABAR, his healer and counselor, \\n\\n \\n\\n —MATHIS ROWAN, Lord of Goldengrove, \\n\\n \\n\\n —SER WILLAM WYTHERS, Margaery’s captain of guards, \\n\\n \\n\\n —HUGH CLIFTON, a handsome young guardsman, \\n\\n \\n\\n —SER PORTIFER WOODWRIGHT and his brother, SER LUCANTINE, \\n\\n \\n\\n —Cersei’s court at King’s Landing: \\n\\n \\n\\n —SER OSFRYD KETTLEBLACK and SER OSNEY KETTLEBLACK, younger brothers to Ser Osmund Kettleblack, \\n\\n \\n\\n —SER GREGOR CLEGANE, called THE MOUNTAIN THAT RIDES, dying painfully of a poisoned wound, \\n\\n \\n\\n —SER ADDAM MARBRAND, Commander of the City Watch of King’s Landing (the “gold cloaks”), \\n\\n \\n\\n —JALABHAR XHO, Prince of the Red Flower Vale, an exile from the Summer Isles, \\n\\n \\n\\n —GYLES ROSBY, Lord of Rosby, troubled by a cough, \\n\\n \\n\\n —ORTON MERRYWEATHER, Lord of Longtable, \\n\\n \\n\\n —TAENA, his wife, a woman of Myr, \\n\\n \\n\\n —LADY TANDA STOKEWORTH, \\n\\n \\n\\n —LADY FALYSE, her elder daughter and heir, \\n\\n \\n\\n —SER BALMAN BYRCH, Lady Falyse’s husband, \\n\\n \\n\\n —LADY LOLLYS, her younger daughter, great with child but weak of wit, \\n\\n \\n\\n —SER BRONN OF THE BLACKWATER, Lady Lollys’s husband, a former sellsword, \\n\\n \\n\\n —{SHAE}, a camp follower serving as Lollys’s bedmaid, strangled in Lord Tywin’s bed, \\n\\n \\n\\n —MAESTER FRENKEN, in Lady Tanda’s service, \\n\\n \\n\\n —SER ILYN PAYNE, the King’s Justice, a headsman, \\n\\n \\n\\n —RENNIFER LONGWATERS, chief undergaoler of the Red Keep’s dungeons, \\n\\n \\n\\n —RUGEN, undergaoler for the black cells, \\n\\n \\n\\n —LORD HALLYNE THE PYROMANCER, a Wisdom of the Guild of Alchemists, \\n\\n \\n\\n —NOHO DIMITTIS, envoy from the Iron Bank of Braavos, \\n\\n \\n\\n —QYBURN, a necromancer, once a maester of the Citadel, more recently of the Brave Companions, \\n\\n \\n\\n —MOON BOY, the royal jester and fool, \\n\\n \\n\\n —PATE, a lad of eight, King Tommen’s whipping boy, \\n\\n \\n\\n —ORMOND OF OLDTOWN, the royal harper and bard, \\n\\n \\n\\n —SER MARK MULLENDORE, who lost a monkey and half an arm in the Battle of the Blackwater, \\n\\n \\n\\n —AURANE WATERS, the Bastard of Driftmark, \\n\\n \\n\\n —LORD ALESANDER STAEDMON, called PENNYLOVER, \\n\\n \\n\\n —SER RONNET CONNINGTON, called RED RONNET, the Knight of Griffin’s Roost, \\n\\n \\n\\n —SER LAMBERT TURNBERRY, SER DERMOT OF THE RAINWOOD, SER TALLAD called THE TALL, SER BAYARD NORCROSS, SER BONIFER HASTY called BONIFER THE GOOD, SER HUGO VANCE, knights sworn to the Iron Throne, \\n\\n \\n\\n —SER LYLE CRAKEHALL called STRONGBOAR, SER ALYN STACKSPEAR, SER JON BETTLEY called BEARDLESS JON, SER STEFFON SWYFT, SER HUMFREY SWYFT, knights sworn to Casterly Rock, \\n\\n \\n\\n —JOSMYN PECKLEDON, a squire and hero of the Blackwater, \\n\\n \\n\\n —GARRETT PAEGE and LEW PIPER, squires and hostages, \\n\\n \\n\\n —the people of King’s Landing: \\n\\n \\n\\n —THE HIGH SEPTON, Father of the Faithful, Voice of the Seven on Earth, an old man and frail, \\n\\n \\n\\n —SEPTON TORBERT, SEPTON RAYNARD, SEPTON LUCEON, SEPTON OLLIDOR, of the Most Devout, serving the Seven at the Great Sept of Baelor, \\n\\n \\n\\n —SEPTA MOELLE, SEPTA AGLANTINE, SEPTA HELICENT, SEPTA UNELLA, of the Most Devout, serving the Seven at the Great Sept of Baelor, \\n\\n \\n\\n —the “sparrows,” the humblest of men, fierce in their piety, \\n\\n \\n\\n —CHATAYA, proprietor of an expensive brothel, \\n\\n \\n\\n —ALAYAYA, her daughter, \\n\\n \\n\\n —DANCY, MAREI, two of Chataya’s girls, \\n\\n \\n\\n —BRELLA, a servingwoman, lately in the service of Lady Sansa Stark, \\n\\n \\n\\n —TOBHO MOTT, a master armorer, \\n\\n \\n\\n —HAMISH THE HARPER, an aged singer, \\n\\n \\n\\n —ALARIC OF EYSEN, a singer, far-traveled, \\n\\n \\n\\n —WAT, a singer, styling himself THE BLUE BARD, \\n\\n \\n\\n —SER THEODAN WELLS, a pious knight, later called SER THEODAN THE TRUE. \\n\\n \\n\\n King Tommen’s banner shows the crowned stag of Baratheon, black on gold, and the lion of Lannister, gold on crimson, combatant. \\n\\n \\n\\n Heraldic crest \\n\\n \\n\\n THE KING AT THE WALL \\n\\n \\n\\n STANNIS BARATHEON, the First of His Name, second son of Lord Steffon Baratheon and Lady Cassana of House Estermont, Lord of Dragonstone, styling himself King of Westeros, \\n\\n \\n\\n —QUEEN SELYSE of House Florent, his wife, presently at Eastwatch-by-the-Sea, \\n\\n \\n\\n —PRINCESS SHIREEN, their daughter, a girl of eleven, \\n\\n \\n\\n —PATCHFACE, Shireen’s lackwit fool, \\n\\n \\n\\n —EDRIC STORM, his bastard nephew, King Robert’s son by Lady Delena Florent, a boy of twelve, sailing the narrow sea on the Mad Prendos, \\n\\n \\n\\n —SER ANDREW ESTERMONT, King Stannis’s cousin, a king’s man, commanding Edric’s escort, \\n\\n \\n\\n —SER GERALD GOWER, LEWYS called THE FISHWIFE, SER TRISTON OF TALLY HILL, OMER BLACKBERRY, king’s men, Edric’s guards and protectors, \\n\\n \\n\\n —Stannis’s court at Castle Black: \\n\\n \\n\\n —LADY MELISANDRE OF ASSHAI, called THE RED WOMAN, a priestess of R’hllor, the Lord of Light, \\n\\n \\n\\n —MANCE RAYDER, King-Beyond-the-Wall, a captive condemned to death, \\n\\n \\n\\n —Rayder’s son by his wife {DALLA}, a newborn as yet unnamed, “the wildling prince,” \\n\\n \\n\\n —GILLY, the babe’s wet nurse, a wildling girl, \\n\\n \\n\\n —her son, another newborn as yet unnamed, fathered by her father {CRASTER}, \\n\\n \\n\\n —SER RICHARD HORPE, SER JUSTIN MASSEY, SER CLAYTON SUGGS, SER GODRY FARRING, called GIANTSLAYER, LORD HARWOOD FELL, SER CORLISS PENNY, queen’s men and knights, \\n\\n \\n\\n —DEVAN SEAWORTH and BRYEN FARRING, royal squires, \\n\\n \\n\\n —Stannis’s court at Eastwatch-by-the-Sea: \\n\\n \\n\\n —SER DAVOS SEAWORTH, called THE ONION KNIGHT, Lord of the Rainwood, Admiral of the Narrow Sea, and Hand of the King, \\n\\n \\n\\n —SER AXELL FLORENT, Queen Selyse’s uncle, foremost of the queen’s men, \\n\\n \\n\\n —SALLADHAR SAAN of Lys, a pirate and sellsail, master of the Valyrian and a fleet of galleys, \\n\\n \\n\\n —Stannis’s garrison at Dragonstone: \\n\\n \\n\\n —SER ROLLAND STORM, called THE BASTARD OF NIGHTSONG, a king’s man, castellan of Dragonstone, \\n\\n \\n\\n —MAESTER PYLOS, healer, tutor, counselor, \\n\\n \\n\\n —“PORRIDGE” and “LAMPREY,” two gaolers, \\n\\n \\n\\n —lords sworn to Dragonstone: \\n\\n \\n\\n —MONTERYS VELARYON, Lord of the Tides and Master of Driftmark, a boy of six, \\n\\n \\n\\n —DURAM BAR EMMON, Lord of Sharp Point, a boy of fifteen years, \\n\\n \\n\\n —Stannis’s garrison at Storm’s End: \\n\\n \\n\\n —SER GILBERT FARRING, castellan of Storm’s End, \\n\\n \\n\\n —LORD ELWOOD MEADOWS, Ser Gilbert’s second, \\n\\n \\n\\n —MAESTER JURNE, Ser Gilbert’s counselor and healer, \\n\\n \\n\\n —lords sworn to Storm’s End: \\n\\n \\n\\n —ELDON ESTERMONT, Lord of Greenstone, uncle to King Stannis, great uncle to King Tommen, a cautious friend to both, \\n\\n \\n\\n —SER AEMON, Lord Eldon’s son and heir, with King Tommen in King’s Landing, \\n\\n \\n\\n —SER ALYN, Ser Aemon’s son, likewise with King Tommen in King’s Landing, \\n\\n \\n\\n —SER LOMAS, brother of Lord Eldon, uncle and supporter of King Stannis, at Storm’s End, \\n\\n \\n\\n —SER ANDREW, Ser Lomas’s son, protecting Edric Storm upon the narrow sea, \\n\\n \\n\\n —LESTER MORRIGEN, Lord of Crows Nest, \\n\\n \\n\\n —LORD LUCOS CHYTTERING, called LITTLE LUCOS, a youth of sixteen, \\n\\n \\n\\n —Davos Seaworth, Lord of the Rainwood, \\n\\n \\n\\n —MARYA, his wife, a carpenter’s daughter, \\n\\n \\n\\n —{DALE, ALLARD, MATTHOS, MARIC}, their four eldest sons, lost in the Battle of the Blackwater, \\n\\n \\n\\n —DEVAN, a squire with King Stannis at Castle Black, \\n\\n \\n\\n —STANNIS, a boy of ten years, with Lady Marya on Cape Wrath, \\n\\n \\n\\n —STEFFON, a boy of six years, with Lady Marya on Cape Wrath. \\n\\n \\n\\n Stannis has taken for his banner the fiery heart of the Lord of Light; a red heart surrounded by orange flames upon a yellow field. Within the heart is the crowned stag of House Baratheon, in black. \\n\\n \\n\\n Heraldic crest \\n\\n \\n\\n KING OF THE ISLES AND THE NORTH \\n\\n \\n\\n The Greyjoys of Pyke claim descent from the Grey King of the Age of Heroes. Legend says the Grey King ruled the sea itself and took a mermaid to wife. Aegon the Dragon ended the line of the last King of the Iron Islands, but allowed the ironborn to revive their ancient custom and choose who should have the primacy among them. They chose Lord Vickon Greyjoy of Pyke. The Greyjoy sigil is a golden kraken upon a black field. Their words are We Do Not Sow. \\n\\n \\n\\n Balon Greyjoy’s first rebellion against the Iron Throne was put down by King Robert I Baratheon and Lord Eddard Stark of Winterfell, but in the chaos following Robert’s death Lord Balon named himself king once more, and sent his ships to attack the north. \\n\\n \\n\\n {BALON GREYJOY}, the Ninth of His Name Since the Grey King, King of the Iron Islands and the North, King of Salt and Rock, Son of the Sea Wind, and Lord Reaper of Pyke, killed in a fall, \\n\\n \\n\\n —King Balon’s widow, QUEEN ALANNYS, of House Harlaw, \\n\\n \\n\\n —their children: \\n\\n \\n\\n —{RODRIK}, slain during Balon’s first rebellion, \\n\\n \\n\\n —{MARON}, slain during Balon’s first rebellion, \\n\\n \\n\\n —ASHA, their daughter, captain of the Black Wind and conquerer of Deepwood Motte, \\n\\n \\n\\n —THEON, styling himself the Prince of Winterfell, called by northmen THEON TURNCLOAK, \\n\\n \\n\\n —King Balon’s brothers and half brothers: \\n\\n \\n\\n —{HARLON}, died of greyscale in his youth, \\n\\n \\n\\n —{QUENTON}, died in infancy, \\n\\n \\n\\n —{DONEL}, died in infancy, \\n\\n \\n\\n —EURON, called Crow’s Eye, captain of the Silence, \\n\\n \\n\\n —VICTARION, Lord Captain of the Iron Fleet, master of the Iron Victory, \\n\\n \\n\\n —{URRIGON}, died of a wound gone bad, \\n\\n \\n\\n —AERON, called DAMPHAIR, a priest of the Drowned God, \\n\\n \\n\\n —RUS and NORJEN, two of his acolytes, the “drowned men,” \\n\\n \\n\\n —{ROBIN}, died in infancy, \\n\\n \\n\\n —King Balon’s household on Pyke: \\n\\n \\n\\n —MAESTER WENDAMYR, healer and counselor, \\n\\n \\n\\n —HELYA, keeper of the castle, \\n\\n \\n\\n —King Balon’s warriors and sworn swords: \\n\\n \\n\\n —DAGMER called CLEFTJAW, captain of Foamdrinker, commanding the ironborn at Torrhen’s Square, \\n\\n \\n\\n —BLUETOOTH, a longship captain, \\n\\n \\n\\n —ULLER, SKYTE, oarsmen and warriors, \\n\\n \\n\\n —CLAIMANTS TO THE SEASTONE CHAIR AT THE KINGSMOOT ON OLD WYK \\n\\n \\n\\n GYLBERT FARWYND, Lord of the Lonely Light, \\n\\n \\n\\n —Gylbert’s champions: his sons GYLES, YGON, YOHN, \\n\\n \\n\\n ERIK IRONMAKER, called ERIK ANVIL-BREAKER and ERIK THE JUST, an old man, once a famed captain and raider, \\n\\n \\n\\n —Erik’s champions: his grandsons UREK, THORMOR, DAGON, \\n\\n \\n\\n DUNSTAN DRUMM, The Drumm, the Bone Hand, Lord of Old Wyk, \\n\\n \\n\\n —Dunstan’s champions: his sons DENYS and DONNEL, and ANDRIK THE UNSMILING, a giant of a man, \\n\\n \\n\\n ASHA GREYJOY, only daughter of Balon Greyjoy, captain of the Black Wind, \\n\\n \\n\\n —Asha’s champions: QARL THE MAID, TRISTIFER BOTLEY, and SER HARRAS HARLAW \\n\\n \\n\\n —Asha’s captains and supporters: LORD RODRIK HARLAW, LORD BAELOR BLACKTYDE, LORD MELDRED MERLYN, HARMUND SHARP \\n\\n \\n\\n VICTARION GREYJOY, brother to Balon Greyjoy, master of the Iron Victory and Lord Captain of the Iron Fleet, \\n\\n \\n\\n —Victarion’s champions: RED RALF STONEHOUSE, RALF THE LIMPER, and NUTE THE BARBER, \\n\\n \\n\\n —Victarion’s captains and supporters: HOTHO HARLAW, ALVYN SHARP, FRALEGG THE STRONG, ROMNY WEAVER, WILL HUMBLE, LITTLE LENWOOD TAWNEY, RALF KENNING, MARON VOLMARK, GOROLD GOODBROTHER, \\n\\n \\n\\n —Victarion’s crewmen: WULF ONE-EAR, RAGNOR PYKE \\n\\n \\n\\n —Victarion’s bedmate, a certain dusky woman, mute and tongueless, a gift from his brother Euron, \\n\\n \\n\\n EURON GREYJOY, called THE CROW’S EYE, brother to Balon Greyjoy and captain of the Silence, \\n\\n \\n\\n —Euron’s champions: GERMUND BOTLEY, LORD ORKWOOD OF ORKMONT, DONNOR SALTCLIFFE \\n\\n \\n\\n —Euron’s captains and supporters: TORWOLD BROWNTOOTH, PINCHFACE JON MYRE, RODRIK FREEBORN, THE RED OARSMAN, LEFT-HAND LUCAS CODD, QUELLON HUMBLE, HARREN HALF-HOARE, KEMMETT PYKE THE BASTARD, QARL THE THRALL, STONEHAND, RALF THE SHEPHERD, RALF OF LORDSPORT \\n\\n \\n\\n —Euron’s crewmen: CRAGORN \\n\\n \\n\\n —Balon’s bannermen, the Lords of the Iron Islands: \\n\\n \\n\\n \\n\\n ON PYKE \\n\\n \\n\\n —{SAWANE BOTLEY}, Lord of Lordsport, drowned by Euron Crow’s Eye, \\n\\n \\n\\n —{HARREN}, his eldest son, killed at Moat Cailin, \\n\\n \\n\\n —TRISTIFER, his second son and rightful heir, dispossessed by his uncle, \\n\\n \\n\\n —SYMOND, HARLON, VICKON, and BENNARION, his younger sons, likewise dispossessed, \\n\\n \\n\\n —GERMUND, his brother, made Lord of Lordsport \\n\\n \\n\\n —Germund’s sons, BALON and QUELLON, \\n\\n \\n\\n —SARGON and LUCIMORE, Sawane’s half brothers, \\n\\n \\n\\n —WEX, a mute boy of twelve years, bastard son of Sargon, squire to Theon Greyjoy, \\n\\n \\n\\n —WALDON WYNCH, Lord of Iron Holt, \\n\\n \\n\\n ON HARLAW \\n\\n \\n\\n —RODRIK HARLAW, called THE READER, Lord of Harlaw, Lord of Ten Towers, Harlaw of Harlaw, \\n\\n \\n\\n —LADY GWYNESSE, his elder sister, \\n\\n \\n\\n —LADY ALANNYS, his younger sister, widow of King Balon Greyjoy \\n\\n \\n\\n —SIGFRYD HARLAW, called SIGFRYD SILVERHAIR, his great uncle, master of Harlaw Hall, \\n\\n \\n\\n —HOTHO HARLAW, called HOTHO HUMPBACK, of the Tower of Glimmering, a cousin, \\n\\n \\n\\n —SER HARRAS HARLAW, called THE KNIGHT, the Knight of Grey Garden, a cousin, \\n\\n \\n\\n —BOREMUND HARLAW, called BOREMUND THE BLUE, master of Harridan Hill, a cousin, \\n\\n \\n\\n —Lord Rodrik’s bannermen and sworn swords: \\n\\n \\n\\n —MARON VOLMARK, Lord of Volmark, \\n\\n \\n\\n —MYRE, STONETREE, and KENNING, \\n\\n \\n\\n —Lord Rodrik’s household: \\n\\n \\n\\n —THREE-TOOTH, his steward, a crone, \\n\\n \\n\\n ON BLACKTYDE \\n\\n \\n\\n —BAELOR BLACKTYDE, Lord of Blacktyde, captain of the Nightflyer, \\n\\n \\n\\n —BLIND BEN BLACKTYDE, a priest of the Drowned God, \\n\\n \\n\\n ON OLD WYK \\n\\n \\n\\n —DUNSTAN DRUMM, The Drumm, captain of Thunderer, \\n\\n \\n\\n —NORNE GOODBROTHER, of Shatterstone, \\n\\n \\n\\n —THE STONEHOUSE, \\n\\n \\n\\n —TARLE, called TARLE THE THRICE-DROWNED, a priest of the Drowned God, \\n\\n \\n\\n ON GREAT WYK \\n\\n \\n\\n —GOROLD GOODBROTHER, Lord of the Hammerhorn, \\n\\n \\n\\n —his sons, GREYDON, GRAN, and GORMOND, triplets, \\n\\n \\n\\n —his daughters, GYSELLA and GWIN, \\n\\n \\n\\n —MAESTER MURENMURE, tutor, healer, and counselor, \\n\\n \\n\\n —TRISTON FARWYND, Lord of Sealskin Point, \\n\\n \\n\\n —THE SPARR, \\n\\n \\n\\n —his son and heir, STEFFARION, \\n\\n \\n\\n —MELDRED MERLYN, Lord of Pebbleton, \\n\\n \\n\\n ON ORKMONT \\n\\n \\n\\n —ORKWOOD OF ORKMONT, \\n\\n \\n\\n —LORD TAWNEY, \\n\\n \\n\\n ON SALTCLIFFE \\n\\n \\n\\n —LORD DONNOR SALTCLIFFE, \\n\\n \\n\\n —LORD SUNDERLY \\n\\n \\n\\n ON THE LESSER ISLANDS AND ROCKS \\n\\n \\n\\n —GYLBERT FARWYND, Lord of the Lonely Light, \\n\\n \\n\\n —THE OLD GREY GULL, a priest of the Drowned God. \\n\\n \\n\\n OTHER HOUSES GREAT AND SMALL \\n\\n \\n\\n Heraldic crest \\n\\n \\n\\n HOUSE ARRYN \\n\\n \\n\\n The Arryns are descended from the Kings of Mountain and Vale. Their sigil is a white moon-and-falcon upon a sky-blue field. House Arryn has taken no part in the War of the Five Kings. Their Arryn words are As High as Honor. \\n\\n \\n\\n ROBERT ARRYN, Lord of the Eyrie, Defender of the Vale, styled by his mother True Warden of the East, a sickly boy of eight years, sometimes called SWEETROBIN, \\n\\n \\n\\n —his mother, {LADY LYSA of House Tully}, widow of Lord Jon Arryn, pushed from the Moon Door to her death, \\n\\n \\n\\n —his stepfather, PETYR BAELISH, called LITTLEFINGER, Lord of Harrenhal, Lord Paramount of the Trident, and Lord Protector of the Vale, \\n\\n \\n\\n —ALAYNE STONE, Lord Petyr’s natural daughter, a maid of three-and-ten, actually Sansa Stark, \\n\\n \\n\\n —SER LOTHOR BRUNE, a sellsword in Lord Petyr’s service, the Eyrie’s captain of guards, \\n\\n \\n\\n —OSWELL, a grizzled man-at-arms in Lord Petyr’s service, sometimes called KETTLEBLACK, \\n\\n \\n\\n —Lord Robert’s household at the Eyrie: \\n\\n \\n\\n —MARILLION, a handsome young singer much favored by Lady Lysa and accused of her murder, \\n\\n \\n\\n —MAESTER COLEMON, counselor, healer, and tutor, \\n\\n \\n\\n —MORD, a brutal gaoler with teeth of gold, \\n\\n \\n\\n —GRETCHEL, MADDY, and MELA, servingwomen, \\n\\n \\n\\n —Lord Robert’s bannermen, the Lords of the Vale: \\n\\n \\n\\n —LORD NESTOR ROYCE, High Steward of the Vale and castellan of the Gates of the Moon, \\n\\n \\n\\n —SER ALBAR, Lord Nestor’s son and heir, \\n\\n \\n\\n —MYRANDA, called RANDA, Lord Nestor’s daughter, a widow, but scarce used, \\n\\n \\n\\n —Lord Nestor’s household: \\n\\n \\n\\n —SER MARWYN BELMORE, captain of guards, \\n\\n \\n\\n —MYA STONE, a mule tender and guide, bastard daughter of King Robert I Baratheon, \\n\\n \\n\\n —OSSY and CARROT, mule tenders, \\n\\n \\n\\n —LYONEL CORBRAY, Lord of Heart’s Home, \\n\\n \\n\\n —SER LYN CORBRAY, his brother and heir, who wields the famed blade Lady Forlorn, \\n\\n \\n\\n —SER LUCAS CORBRAY, his younger brother, \\n\\n \\n\\n —JON LYNDERLY, Lord of the Snakewood, \\n\\n \\n\\n —TERRANCE, his son and heir, a young squire, \\n\\n \\n\\n —EDMUND WAXLEY, the Knight of Wickenden, \\n\\n \\n\\n —GEROLD GRAFTON, the Lord of Gulltown, \\n\\n \\n\\n —GYLES, his youngest son, a squire, \\n\\n \\n\\n —TRISTON SUNDERLAND, Lord of the Three Sisters, \\n\\n \\n\\n —GODRIC BORRELL, Lord of Sweetsister, \\n\\n \\n\\n —ROLLAND LONGTHORPE, Lord of Longsister, \\n\\n \\n\\n —ALESANDOR TORRENT, Lord of Littlesister, \\n\\n \\n\\n —the Lords Declarant, bannermen of House Arryn joined together in defense of young Lord Robert: \\n\\n \\n\\n —YOHN ROYCE, called BRONZE YOHN, Lord of Runestone, of the senior branch of House Royce, \\n\\n \\n\\n —SER ANDAR, Bronze Yohn’s sole surviving son, and heir to Runestone, \\n\\n \\n\\n —Bronze Yohn’s household: \\n\\n \\n\\n —MAESTER HELLIWEG, tutor, healer, counselor, \\n\\n \\n\\n —SEPTON LUCOS, \\n\\n \\n\\n —SER SAMWELL STONE, called STRONG SAM STONE, master-at-arms, \\n\\n \\n\\n —Bronze Yohn’s bannermen and sworn swords: \\n\\n \\n\\n —ROYCE COLDWATER, Lord of Coldwater Burn, \\n\\n \\n\\n —SER DAMON SHETT, Knight of Gull Tower, \\n\\n \\n\\n —UTHOR TOLLETT, Lord of the Grey Glen \\n\\n \\n\\n —ANYA WAYNWOOD, Lady of Ironoaks Castle, \\n\\n \\n\\n —SER MORTON, her eldest son and heir, \\n\\n \\n\\n —SER DONNEL, her second son, the Knight of the Gate, \\n\\n \\n\\n —WALLACE, her youngest son, \\n\\n \\n\\n —HARROLD HARDYNG, her ward, a squire oft called HARRY THE HEIR, \\n\\n \\n\\n —BENEDAR BELMORE, Lord of Strongsong, \\n\\n \\n\\n —SER SYMOND TEMPLETON, the Knight of Ninestars, \\n\\n \\n\\n —{EON HUNTER}, Lord of Longbow Hall, recently deceased, \\n\\n \\n\\n —SER GILWOOD, Lord Eon’s eldest son and heir, now called YOUNG LORD HUNTER, \\n\\n \\n\\n —SER EUSTACE, Lord Eon’s second son, \\n\\n \\n\\n —SER HARLAN, Lord Eon’s youngest son, \\n\\n \\n\\n —Young Lord Hunter’s household: \\n\\n \\n\\n —MAESTER WILLAMEN, counselor, healer, tutor, \\n\\n \\n\\n —HORTON REDFORT, Lord of Redfort, thrice wed, \\n\\n \\n\\n —SER JASPER, SER CREIGHTON, SER JON, his sons, \\n\\n \\n\\n —SER MYCHEL, his youngest son, a new-made knight, m. Ysilla Royce of Runestone, \\n\\n \\n\\n —clan chiefs from the Mountains of the Moon, \\n\\n \\n\\n —SHAGGA SON OF DOLF, OF THE STONE CROWS, presently leading a band in the kingswood, \\n\\n \\n\\n —TIMETT SON OF TIMETT, OF THE BURNED MEN, \\n\\n \\n\\n —CHELLA DAUGHTER OF CHEYK, OF THE BLACK EARS, \\n\\n \\n\\n —CRAWN SON OF CALOR, OF THE MOON BROTHERS. \\n\\n \\n\\n Heraldic crest \\n\\n \\n\\n HOUSE FLORENT \\n\\n \\n\\n The Florents of Brightwater Keep are bannermen of Highgarden. At the outset of the War of the Five Kings, Lord Alester Florent followed his liege lord in declaring for King Renly while his brother Ser Axell chose Stannis, husband to his niece Selyse. After Renly’s death, Lord Alester went over to Stannis as well, with all the strength of Brightwater. Stannis made Lord Alester his Hand, and gave command of his fleet to Ser Imry Florent, his wife’s brother. The fleet and Ser Imry both were lost in the Battle of Blackwater, and Lord Alester’s efforts to negotiate a peace after the defeat were regarded by King Stannis as treason. He was given to the red priestess Melisandre, who burned him as a sacrifice to R’hllor. \\n\\n \\n\\n The Iron Throne has also named the Florents traitors for their support of Stannis and his rebellion. They were attainted, and Brightwater Keep and its lands were awarded to Ser Garlan Tyrell. \\n\\n \\n\\n The sigil of House Florent shows a fox head in a circle of flowers. \\n\\n \\n\\n {ALESTER FLORENT}, Lord of Brightwater, burned as a traitor, \\n\\n \\n\\n —his wife, LADY MELARA, of House Crane, \\n\\n \\n\\n —their children: \\n\\n \\n\\n —ALEKYNE, attainted Lord of Brightwater, fled to Oldtown to seek refuge at the Hightower, \\n\\n \\n\\n —LADY MELESSA, wed to Lord Randyll Tarly, \\n\\n \\n\\n —LADY RHEA, wed to Lord Leyton Hightower, \\n\\n \\n\\n —his siblings: \\n\\n \\n\\n —SER AXELL, a queen’s man, in service to his niece Queen Selyse at Eastwatch-by-the-Sea, \\n\\n \\n\\n —{SER RYAM}, died in a fall from a horse, \\n\\n \\n\\n —SELYSE, his daughter, wife and queen to King Stannis I Baratheon, \\n\\n \\n\\n —SHIREEN BARATHEON, her only child, \\n\\n \\n\\n —{SER IMRY}, his eldest son, killed in the Battle of the Blackwater, \\n\\n \\n\\n —SER ERREN, his second son, a captive at Highgarden, \\n\\n \\n\\n —SER COLIN, castellan at Brightwater Keep, \\n\\n \\n\\n —DELENA, his daughter, m. SER HOSMAN NORCROSS, \\n\\n \\n\\n —her natural son, EDRIC STORM, fathered by King Robert I Baratheon, \\n\\n \\n\\n —ALESTER NORCROSS, her eldest trueborn son, a boy of nine, \\n\\n \\n\\n —RENLY NORCROSS, her second trueborn son, a boy of three, \\n\\n \\n\\n —MAESTER OMER, Ser Colin’s eldest son, in service at Old Oak, \\n\\n \\n\\n —MERRELL, Ser Colin’s youngest son, a squire on the Arbor, \\n\\n \\n\\n —RYLENE, Lord Alester’s sister, m. Ser Rycherd Crane. \\n\\n \\n\\n Heraldic crest \\n\\n \\n\\n HOUSE FREY \\n\\n \\n\\n The Freys are bannermen to House Tully, but have not always been diligent in their duty. At the onset of the War of the Five Kings, Robb Stark won Lord Walder’s allegiance by pledging to marry one of his daughters or granddaughters. When he wed Lady Jeyne Westerling instead, the Freys conspired with Roose Bolton and murdered the Young Wolf and his followers at what became known as the Red Wedding. \\n\\n \\n\\n WALDER FREY, Lord of the Crossing, \\n\\n \\n\\n —by his first wife, {LADY PERRA, of House Royce}: \\n\\n \\n\\n —{SER STEVRON}, died after the Battle of Oxcross, \\n\\n \\n\\n —m. {Corenna Swann}, died of a wasting illness, \\n\\n \\n\\n —Stevron’s eldest son, SER RYMAN, heir to the Twins, \\n\\n \\n\\n —Ryman’s son, EDWYN, wed to Janyce Hunter, \\n\\n \\n\\n —Edwyn’s daughter, WALDA, a girl of nine, \\n\\n \\n\\n —Ryman’s son, WALDER, called BLACK WALDER, \\n\\n \\n\\n —Ryman’s son, {PETYR}, called PETYR PIMPLE, hanged at Oldstones, m. Mylenda Caron, \\n\\n \\n\\n —Petyr’s daughter, PERRA, a girl of five, \\n\\n \\n\\n —m. {Jeyne Lydden}, died in a fall from a horse, \\n\\n \\n\\n —Stevron’s son, {AEGON}, called JINGLEBELL, killed at the Red Wedding by Catelyn Stark, \\n\\n \\n\\n —Stevron’s daughter, {MAEGELLE}, died in childbed, m. Ser Dafyn Vance, \\n\\n \\n\\n —Maegelle’s daughter, MARIANNE VANCE, a maiden, \\n\\n \\n\\n —Maegelle’s son, WALDER VANCE, a squire, \\n\\n \\n\\n —Maegelle’s son, PATREK VANCE, \\n\\n \\n\\n —m. {Marsella Waynwood}, died in childbed, \\n\\n \\n\\n —Stevron’s son, WALTON, m. Deana Hardyng, \\n\\n \\n\\n —Walton’s son, STEFFON, called THE SWEET, \\n\\n \\n\\n —Walton’s daughter, WALDA, called FAIR WALDA, \\n\\n \\n\\n —Walton’s son, BRYAN, a squire, \\n\\n \\n\\n —SER EMMON, Lord Walder’s second son, m. Genna Lannister, \\n\\n \\n\\n —Emmon’s son, {SER CLEOS}, killed by outlaws near Maidenpool, m. Jeyne Darry, \\n\\n \\n\\n —Cleos’s son, TYWIN, a squire of twelve, \\n\\n \\n\\n —Cleos’s son, WILLEM, a page at Ashemark, ten, \\n\\n \\n\\n —Emmon’s son, SER LYONEL, m. Melesa Crakehall, \\n\\n \\n\\n —Emmon’s son, {TION}, a squire, murdered by Rickard Karstark while a captive at Riverrun, \\n\\n \\n\\n —Emmon’s son, WALDER, called RED WALDER, fourteen, a page at Casterly Rock, \\n\\n \\n\\n —SER AENYS, Lord Walder’s third son, m. {Tyana Wylde}, died in childbed, \\n\\n \\n\\n —Aenys’s son, AEGON BLOODBORN, an outlaw, \\n\\n \\n\\n —Aenys’s son, RHAEGAR, m. {Jeyne Beesbury}, died of a wasting illness, \\n\\n \\n\\n —Rhaegar’s son, ROBERT, a boy of thirteen, \\n\\n \\n\\n —Rhaegar’s daughter, WALDA, a girl of eleven, called WHITE WALDA, \\n\\n \\n\\n —Rhaegar’s son, JONOS, a boy of eight, \\n\\n \\n\\n —PERRIANE, Lord Walder’s daughter, m. Ser Leslyn Haigh, \\n\\n \\n\\n —Perriane’s son, SER HARYS HAIGH, \\n\\n \\n\\n —Harys’s son, WALDER HAIGH, a boy of five, \\n\\n \\n\\n —Perriane’s son, SER DONNEL HAIGH, \\n\\n \\n\\n —Perriane’s son, ALYN HAIGH, a squire, \\n\\n \\n\\n —by his second wife, {LADY CYRENNA, of House Swann}: \\n\\n \\n\\n —SER JARED, Lord Walder’s fourth son, m. {Alys Frey}, \\n\\n \\n\\n —Jared’s son, {SER TYTOS}, slain by Sandor Clegane during the Red Wedding, m. Zhoe Blanetree, \\n\\n \\n\\n —Tytos’s daughter, ZIA, a maid of fourteen, \\n\\n \\n\\n —Tytos’s son, ZACHERY, a boy of twelve sworn to the Faith, training at the Sept of Oldtown, \\n\\n \\n\\n —Jared’s daughter, KYRA, m. {Ser Garse Goodbrook}, slain during the Red Wedding, \\n\\n \\n\\n —Kyra’s son, WALDER GOODBROOK, a boy of nine, \\n\\n \\n\\n —Kyra’s daughter, JEYNE GOODBROOK, six, \\n\\n \\n\\n —SEPTON LUCEON, in service at the Great Sept of Baelor, \\n\\n \\n\\n —by his third wife, {LADY AMAREI of House Crakehall}: \\n\\n \\n\\n —SER HOSTEEN, m. Bellena Hawick, \\n\\n \\n\\n —Hosteen’s son, SER ARWOOD, m. Ryella Royce, \\n\\n \\n\\n —Arwood’s daughter, RYELLA, a girl of five, \\n\\n \\n\\n —Arwood’s twin sons, ANDROW and ALYN, four, \\n\\n \\n\\n —Arwood’s daughter, HOSTELLA, a newborn babe, \\n\\n \\n\\n —LYENTHE, Lord Walder’s daughter, m. Lord Lucias Vypren, \\n\\n \\n\\n —Lythene’s daughter, ELYANA, m. Ser Jon Wylde, \\n\\n \\n\\n —Elyana’s son, RICKARD WYLDE, four, \\n\\n \\n\\n —Lythene’s son, SER DAMON VYPREN, \\n\\n \\n\\n —SYMOND, m. Betharios of Braavos, \\n\\n \\n\\n —Symond’s son, ALESANDER, a singer, \\n\\n \\n\\n —Symond’s daughter, ALYX, a maid of seventeen, \\n\\n \\n\\n —Symond’s son, BRADAMAR, a boy of ten, a ward of Oro Tendyris, a merchant of Braavos, \\n\\n \\n\\n —SER DANWELL, Lord Walder’s eighth son, m. Wynafrei Whent, \\n\\n \\n\\n —{many stillbirths and miscarriages}, \\n\\n \\n\\n —{MERRETT}, hanged at Oldstones, m. Mariya Darry, \\n\\n \\n\\n —Merrett’s daughter, AMEREI, called AMI, m. {Ser Pate of the Blue Fork, slain by Ser Gregor Clegane}, \\n\\n \\n\\n —Merrett’s daughter, WALDA, called FAT WALDA, m. Roose Bolton, Lord of the Dreadfort, \\n\\n \\n\\n —Merrett’s daughter, MARISSA, a maid of thirteen, \\n\\n \\n\\n —Merrett’s son, WALDER, called LITTLE WALDER, eight, a squire in service to Ramsay Bolton, \\n\\n \\n\\n —{SER GEREMY}, drowned, m. Carolei Waynwood, \\n\\n \\n\\n —Geremy’s son, SANDOR, a boy of twelve, a squire, \\n\\n \\n\\n —Geremy’s daughter, CYNTHEA, a girl of nine, a ward of Lady Anya Waynwood, \\n\\n \\n\\n —SER RAYMUND, m. Beony Beesbury, \\n\\n \\n\\n —Raymund’s son, ROBERT, an acolyte at the Citadel, \\n\\n \\n\\n —Raymund’s son, MALWYN, serving with alchemist in Lys, \\n\\n \\n\\n —Raymund’s twin daughters, SERRA and SARRA, \\n\\n \\n\\n —Raymund’s daughter, CERSEI, called LITTLE BEE, \\n\\n \\n\\n —Raymund’s twin sons, JAIME and TYWIN, newborn, \\n\\n \\n\\n —by his fourth wife, {LADY ALYSSA, of House Blackwood}: \\n\\n \\n\\n —LOTHAR, Lord Walder’s twelfth son, called LAME LOTHAR, m. Leonella Lefford, \\n\\n \\n\\n —Lothar’s daughter, TYSANE, a girl of seven, \\n\\n \\n\\n —Lothar’s daughter, WALDA, a girl of five, \\n\\n \\n\\n —Lothar’s daughter, EMBERLEI, a girl of three, \\n\\n \\n\\n —Lothar’s daughter, LEANA, a newborn babe, \\n\\n \\n\\n —SER JAMMOS, Lord Walder’s thirteenth son, m. Sallei Paege, \\n\\n \\n\\n —Jammos’s son, WALDER, called BIG WALDER, eight, a squire in service to Ramsey Bolton, \\n\\n \\n\\n —Jammos’s twin sons, DICKON and MATHIS, five, \\n\\n \\n\\n —SER WHALEN, Lord Walder’s fourteenth son, m. Sylwa Paege, \\n\\n \\n\\n —Whalen’s son, HOSTER, a squire of twelve, in service to Ser Damon Paege, \\n\\n \\n\\n —Whalen’s daughter, MERIANNE, called MERRY, eleven, \\n\\n \\n\\n —MORYA, Lord Walder’s daughter, m. Ser Flement Brax, \\n\\n \\n\\n —Morya’s son, ROBERT BRAX, nine, a page at Casterly Rock, \\n\\n \\n\\n —Morya’s son, WALDER BRAX, a boy of six, \\n\\n \\n\\n —Morya’s son, JON BRAX, a babe of three, \\n\\n \\n\\n —TYTA, Lord Walder’s daughter, called TYTA THE MAID, \\n\\n \\n\\n —by his fifth wife, {LADY SARYA of House Whent}: \\n\\n \\n\\n —no progeny, \\n\\n \\n\\n —by his sixth wife, {LADY BETHANY of House Rosby}: \\n\\n \\n\\n —SER PERWYN, Lord Walder’s fifteenth son, \\n\\n \\n\\n —{SER BENFREY}, Lord Walder’s sixteenth son, died of a wound received at the Red Wedding, m. Jyanna Frey, a cousin, \\n\\n \\n\\n —Benfrey’s daughter, DELLA, called DEAF DELLA, a girl of three, \\n\\n \\n\\n —Benfrey’s son, OSMUND, a boy of two, \\n\\n \\n\\n —MAESTER WILLAMEN, Lord Walder’s seventeenth son, in service at Longbow Hall, \\n\\n \\n\\n —OLYVAR, Lord Walder’s eighteenth son, formerly a squire to Robb Stark, \\n\\n \\n\\n —ROSLIN, sixteen, m. Lord Edmure Tully at the Red Wedding, \\n\\n \\n\\n —by his seventh wife, {LADY ANNARA of House Farring}: \\n\\n \\n\\n —ARWYN, Lord Walder’s daughter, a maid of fourteen, \\n\\n \\n\\n —WENDEL, Lord Walder’s nineteenth son, thirteen, a page at Seagard, \\n\\n \\n\\n —COLMAR, Lord Walder’s twentieth son, eleven and promised to the Faith, \\n\\n \\n\\n —WALTYR, called TYR, Lord Walder’s twenty-first son, ten, \\n\\n \\n\\n —ELMAR, Lord Walder’s lastborn son, a boy of nine briefly betrothed to Arya Stark, \\n\\n \\n\\n —SHIREI, Lord Walder’s youngest child, a girl of seven, \\n\\n \\n\\n —his eighth wife, LADY JOYEUSE of House Erenford, \\n\\n \\n\\n —presently with child, \\n\\n \\n\\n —Lord Walder’s natural children, by sundry mothers, \\n\\n \\n\\n —WALDER RIVERS, called BASTARD WALDER, \\n\\n \\n\\n —Bastard Walder’s son, SER AEMON RIVERS, \\n\\n \\n\\n —Bastard Walder’s daughter, WALDA RIVERS, \\n\\n \\n\\n —MAESTER MELWYS, in service at Rosby, \\n\\n \\n\\n —JEYNE RIVERS, MARTYN RIVERS, RYGER RIVERS, RONEL RIVERS, MELLARA RIVERS, others \\n\\n \\n\\n Heraldic crest \\n\\n \\n\\n HOUSE HIGHTOWER \\n\\n \\n\\n The Hightowers of Oldtown are among the oldest and proudest of the Great Houses of Westeros, tracing their descent back to the First Men. Once kings, they have ruled Oldtown and its environs since the Dawn of Days, welcoming the Andals rather than resisting them, and later bending the knee to the Kings of the Reach and giving up their crowns whilst retaining all their ancient privileges. Though powerful and immensely wealthy, the Lords of the High Tower have traditionally preferred trade to battle, and have seldom played a large part in the wars of Westeros. The Hightowers were instrumental in the founding of the Citadel and continue to protect it to this day. Subtle and sophisticated, they have always been great patrons of learning and the Faith, and it is said that certain of them have also dabbled in alchemy, necromancy, and other sorcerous arts. \\n\\n \\n\\n The arms of House Hightower show a stepped white tower crowned with fire on a smoke-grey field. The House words are We Light the Way. \\n\\n \\n\\n LEYTON HIGHTOWER, Voice of Oldtown, Lord of the Port, Lord of the High Tower, Defender of the Citadel, Beacon of the South, called THE OLD MAN OF OLDTOWN, \\n\\n \\n\\n —LADY RHEA of House Hightower, his fourth wife, \\n\\n \\n\\n —Lord Leyton’s eldest son and heir, SER BAELOR, called BAELOR BRIGHTSMILE, m. Rhonda Rowan, \\n\\n \\n\\n —Lord Leyton’s daughter, MALORA, called THE MAD MAID, \\n\\n \\n\\n —Lord Leyton’s daughter, ALERIE, m. Lord Mace Tyrell, \\n\\n \\n\\n —Lord Leyton’s son SER GARTH, called GREYSTEEL, \\n\\n \\n\\n —Lord Leyton’s daughter, DENYSE, m. Ser Desmond Redwyne, \\n\\n \\n\\n —her son, DENYS, a squire, \\n\\n \\n\\n —Lord Leyton’s daughter, LEYLA, m. Ser Jon Cupps, \\n\\n \\n\\n —Lord Leyton’s daughter, ALYSANNE, m. Lord Arthur Ambrose, \\n\\n \\n\\n —Lord Leyton’s daughter, LYNESSE, m. Lord Jorah Mormont, presently chief concubine to Tregar Ormollen of Lys, \\n\\n \\n\\n —Lord Leyton’s son, SER GUNTHOR, m. Jeyne Fossoway, of the green apple Fossoways, \\n\\n \\n\\n —Lord Leyton’s youngest son, SER HUMFREY, \\n\\n \\n\\n —Lord Leyton’s bannermen: \\n\\n \\n\\n —TOMMEN COSTAYNE, Lord of the Three Towers, \\n\\n \\n\\n —ALYSANNE BULWER, Lady of Blackcrown, a girl of eight, \\n\\n \\n\\n —MARTYN MULLENDORE, Lord of Uplands, \\n\\n \\n\\n —WARRYN BEESBURY, Lord of Honeyholt, \\n\\n \\n\\n —BRANSTON CUY, Lord of Sunflower Hall, \\n\\n \\n\\n —the people of Oldtown: \\n\\n \\n\\n —EMMA, a serving wench at the Quill and Tankard, where the women are willing and the cider is fearsomely strong, \\n\\n \\n\\n —ROSEY, her daughter, a girl of five-and-ten whose maidenhead will cost a golden dragon, \\n\\n \\n\\n —the Archmaesters of the Citadel: \\n\\n \\n\\n —ARCHMAESTER NORREN, Seneschal for the waning year, whose ring and rod and mask are electrum, \\n\\n \\n\\n —ARCHMAESTER THEOBALD, Seneschal for the coming year, whose ring and rod and mask are lead, \\n\\n \\n\\n —ARCHMAESTER EBROSE, the healer, whose ring and rod and mask are silver, \\n\\n \\n\\n —ARCHMAESTER MARWYN, called MARWYN THE MAGE, whose ring and rod and mask are Valyrian steel, \\n\\n \\n\\n —ARCHMAESTER PERESTAN, the historian, whose ring and rod and mask are copper, \\n\\n \\n\\n —ARCHMAESTER VAELLYN, called VINEGAR VAELLYN, the stargazer, whose ring and rod and mask are bronze, \\n\\n \\n\\n —ARCHMAESTER RYAM, whose ring and rod and mask are yellow gold, \\n\\n \\n\\n —ARCHMAESTER WALGRAVE, an old man of uncertain wit, whose ring and rod and mask are black iron, \\n\\n \\n\\n —GALLARD, CASTOS, ZARABELO, BENEDICT, GARIZON, NYMOS, CETHERES, WILLIFER, MOLLOS, HARODON, GUYNE, AGRIVANE, OCLEY, archmaesters all, \\n\\n \\n\\n —maesters, acolytes, and novices of the Citadel: \\n\\n \\n\\n —MAESTER GORMON, who oft serves in Walgrave’s stead, \\n\\n \\n\\n —ARMEN, an acolyte of four links, called THE ACOLYTE, \\n\\n \\n\\n —ALLERAS, called THE SPHINX, an acolyte of three links, a devoted archer, \\n\\n \\n\\n —ROBERT FREY, sixteen, an acolyte of two links, \\n\\n \\n\\n —LORCAS, an acolyte of nine links, in service to the Seneschal, \\n\\n \\n\\n —LEO TYRELL, called LAZY LEO, a highborn novice, \\n\\n \\n\\n —MOLLANDER, a novice, born with a club foot, \\n\\n \\n\\n —PATE, who tends Archmaester Walgrave’s ravens, a novice of little promise, \\n\\n \\n\\n —ROONE, a young novice. \\n\\n \\n\\n Heraldic crest \\n\\n \\n\\n HOUSE LANNISTER \\n\\n \\n\\n The Lannisters of Casterly Rock remain the principal support of King Tommen’s claim to the Iron Throne. They boast of descent from Lann the Clever, the legendary trickster of the Age of Heroes. The gold of Casterly Rock and the Golden Tooth has made them the wealthiest of the Great Houses. The Lannister sigil is a golden lion upon a crimson field. Their words are Hear Me Roar! \\n\\n \\n\\n {TYWIN LANNISTER}, Lord of Casterly Rock, Shield of Lannisport, Warden of the West, and Hand of the King, murdered by his dwarf son in his privy, \\n\\n \\n\\n —Lord Tywin’s children: \\n\\n \\n\\n —CERSEI, twin to Jaime, now Lady of Casterly Rock, \\n\\n \\n\\n —SER JAIME, twin to Cersei, called THE KINGSLAYER, \\n\\n \\n\\n —TYRION, called THE IMP, dwarf and kinslayer, \\n\\n \\n\\n —Lord Tywin’s siblings and their offspring: \\n\\n \\n\\n —SER KEVAN LANNISTER, m. Dorna of House Swyft, \\n\\n \\n\\n —LADY GENNA, m. Ser Emmon Frey, now Lord of Riverrun, \\n\\n \\n\\n —Genna’s eldest son, {SER CLEOS FREY}, m. Jeyne of House Darry, killed by outlaws, \\n\\n \\n\\n —Cleos’s eldest son, SER TYWIN FREY, called TY, now heir to Riverrun, \\n\\n \\n\\n —Cleos’s second son, WILLEM FREY, a squire, \\n\\n \\n\\n —Genna’s second son, SER LYONEL FREY, \\n\\n \\n\\n —Genna’s third son, {TION FREY}, a squire, murdered while a captive at Riverrun, \\n\\n \\n\\n —Genna’s youngest son, WALDER FREY, called RED WALDER, a page at Casterly Rock, \\n\\n \\n\\n —WHITESMILE WAT, a singer in service to Lady Genna, \\n\\n \\n\\n —{SER TYGETT LANNISTER}, died of a pox, \\n\\n \\n\\n —TYREK, Tygett’s son, missing and feared dead, \\n\\n \\n\\n —LADY ERMESANDE HAYFORD, Tyrek’s child wife, \\n\\n \\n\\n —{GERION LANNISTER}, lost at sea, \\n\\n \\n\\n —JOY HILL, Gerion’s bastard daughter, eleven, \\n\\n \\n\\n —Lord Tywin’s other close kin: \\n\\n \\n\\n —{SER STAFFORD LANNISTER}, a cousin and brother to Lord Tywin’s wife, slain in battle at Oxcross, \\n\\n \\n\\n —CERENNA and MYRIELLE, Stafford’s daughters, \\n\\n \\n\\n —SER DAVEN LANNISTER, Stafford’s son, \\n\\n \\n\\n —SER DAMION LANNISTER, a cousin, m. Lady Shiera Crakehall, \\n\\n \\n\\n —their son, SER LUCION, \\n\\n \\n\\n —their daughter, LANNA, m. Lord Antario Jast, \\n\\n \\n\\n —LADY MARGOT, a cousin, m. Lord Titus Peake, \\n\\n \\n\\n —the household at Casterly Rock: \\n\\n \\n\\n —MAESTER CREYLEN, healer, tutor, and counselor, \\n\\n \\n\\n —VYLARR, captain of guards, \\n\\n \\n\\n —SER BENEDICT BROOM, master-at-arms, \\n\\n \\n\\n —WHITESMILE WAT, a singer, \\n\\n \\n\\n —bannermen and sworn swords, Lords of the West: \\n\\n \\n\\n —DAMON MARBRAND, Lord of Ashemark, \\n\\n \\n\\n —SER ADDAM MARBRAND, his son and heir, Commander of the City Watch of King’s Landing, \\n\\n \\n\\n —ROLAND CRAKEHALL, Lord of Crakehall, \\n\\n \\n\\n —Roland’s brother, {SER BURTON}, slain by outlaws, \\n\\n \\n\\n —Roland’s son and heir, SER TYBOLT, \\n\\n \\n\\n —Roland’s son, SER LYLE, called STRONGBOAR, \\n\\n \\n\\n —Roland’s youngest son, SER MERLON, \\n\\n \\n\\n —SEBASTON FARMAN, Lord of Fair Isle, \\n\\n \\n\\n —JEYNE, his sister, m. SER GARETH CLIFTON, \\n\\n \\n\\n —TYTOS BRAX, Lord of Hornvale, \\n\\n \\n\\n —SER FLEMENT BRAX, his brother and heir, \\n\\n \\n\\n —QUENTEN BANEFORT, Lord of Banefort, \\n\\n \\n\\n —SER HARYS SWYFT, good-father to Ser Kevan Lannister, \\n\\n \\n\\n —Ser Harys’s son, SER STEFFON SWYFT, \\n\\n \\n\\n —Ser Steffon’s daughter, JOANNA, \\n\\n \\n\\n —Ser Harys’s daughter, SHIERLE, m. Ser Melwyn Sarsfield, \\n\\n \\n\\n —REGENARD ESTREN, Lord of Wyndhall, \\n\\n \\n\\n —GAWEN WESTERLING, Lord of the Crag, \\n\\n \\n\\n —his wife, LADY SYBELL, of House Spicer, \\n\\n \\n\\n —her brother, SER ROLPH SPICER, newly raised to Lord of Castamere, \\n\\n \\n\\n —her cousin, SER SAMWELL SPICER, \\n\\n \\n\\n —their children: \\n\\n \\n\\n —SER RAYNALD WESTERLING, \\n\\n \\n\\n —JEYNE, widowed wife of Robb Stark, \\n\\n \\n\\n —ELEYNA, a girl of twelve, \\n\\n \\n\\n —ROLLAM, a boy of nine, \\n\\n \\n\\n —LORD SELMOND STACKSPEAR, \\n\\n \\n\\n —his son, SER STEFFON STACKSPEAR, \\n\\n \\n\\n —his younger son, SER ALYN STACKSPEAR, \\n\\n \\n\\n —TERRENCE KENNING, Lord of Kayce, \\n\\n \\n\\n —SER KENNOS OF KAYCE, a knight in his service, \\n\\n \\n\\n —LORD ANTARIO JAST, \\n\\n \\n\\n —LORD ROBIN MORELAND, \\n\\n \\n\\n —LADY ALYSANNE LEFFORD, \\n\\n \\n\\n —LEWYS LYDDEN, Lord of the Deep Den, \\n\\n \\n\\n —LORD PHILIP PLUMM, \\n\\n \\n\\n —his sons, SER DENNIS PLUMM, SER PETER PLUMM, and SER HARWYN PLUMM, called HARDSTONE, \\n\\n \\n\\n —LORD GARRISON PRESTER, \\n\\n \\n\\n —SER FORLEY PRESTER, his cousin, \\n\\n \\n\\n —SER GREGOR CLEGANE, called THE MOUNTAIN THAT RIDES, \\n\\n \\n\\n —SANDOR CLEGANE, his brother, \\n\\n \\n\\n —SER LORENT LORCH, a landed knight, \\n\\n \\n\\n —SER GARTH GREENFIELD, a landed knight, \\n\\n \\n\\n —SER LYMOND VIKARY, a landed knight, \\n\\n \\n\\n —SER RAYNARD RUTTIGER, a landed knight \\n\\n \\n\\n —SER MANFRYD YEW, a landed knight, \\n\\n \\n\\n —SER TYBOLT HETHERSPOON, a landed knight, \\n\\n \\n\\n —{MELARA HETHERSPOON}, his daughter, drowned in a well while a ward at Casterly Rock \\n\\n \\n\\n Heraldic crest \\n\\n \\n\\n HOUSE MARTELL \\n\\n \\n\\n Dorne was the last of the Seven Kingdoms to swear fealty to the Iron Throne. Blood, custom, geography, and history all helped to set the Dornishmen apart from the other kingdoms. At the outbreak of the War of the Five Kings Dorne took no part, but when Myrcella Baratheon was betrothed to Prince Trystane, Sunspear declared its support for King Joffrey. The Martell banner is a red sun pierced by a golden spear. Their words are Unbowed, Unbent, Unbroken. \\n\\n \\n\\n DORAN NYMEROS MARTELL, Lord of Sunspear, Prince of Dorne, \\n\\n \\n\\n —his wife, MELLARIO, of the Free City of Norvos, \\n\\n \\n\\n —their children: \\n\\n \\n\\n —PRINCESS ARIANNE, heir to Sunspear, \\n\\n \\n\\n —GARIN, Arianne’s milk brother and companion, of the orphans of the Greenblood, \\n\\n \\n\\n —PRINCE QUENTYN, a new-made knight, long fostered by Lord Yronwood of Yronwood, \\n\\n \\n\\n —PRINCE TRYSTANE, betrothed to Myrcella Baratheon, \\n\\n \\n\\n —Prince Doran’s siblings: \\n\\n \\n\\n —{PRINCESS ELIA, raped and murdered during the Sack of King’s Landing}, \\n\\n \\n\\n —{RHAENYS TARGARYEN}, her young daughter, murdered during the Sack of King’s Landing, \\n\\n \\n\\n —{AEGON TARGARYEN}, a babe at the breast, murdered during the Sack of King’s Landing, \\n\\n \\n\\n —{PRINCE OBERYN}, called THE RED VIPER, slain by Ser Gregor Clegane during a trial by combat, \\n\\n \\n\\n —ELLARIA SAND, Prince Oberyn’s paramour, natural daughter of Lord Harmen Uller, \\n\\n \\n\\n —THE SAND SNAKES, Oberyn’s bastard daughters: \\n\\n \\n\\n —OBARA, eight-and-twenty, Oberyn’s daughter by an Oldtown whore, \\n\\n \\n\\n —NYMERIA, called LADY NYM, five-and-twenty, his daughter by a noblewoman of Volantis, \\n\\n \\n\\n —TYENE, three-and-twenty, Oberyn’s daughter by a septa, \\n\\n \\n\\n —SARELLA, nineteen, his daughter by a trader, captain of the Feathered Kiss, \\n\\n \\n\\n —ELIA, fourteen, his daughter by Ellaria Sand, \\n\\n \\n\\n —OBELLA, twelve, his daughter by Ellaria Sand, \\n\\n \\n\\n —DOREA, eight, his daughter by Ellaria Sand, \\n\\n \\n\\n —LOREZA, six, his daughter by Ellaria Sand, \\n\\n \\n\\n —Prince Doran’s court, at the Water Gardens: \\n\\n \\n\\n —AREO HOTAH, of Norvos, captain of the guards, \\n\\n \\n\\n —MAESTER CALEOTTE, counselor, healer, and tutor, \\n\\n \\n\\n —threescore children of both high and common birth, sons and daughters of lords, knights, orphans, merchants, craftsmen, and peasants, his wards, \\n\\n \\n\\n —Prince Doran’s court, at Sunspear: \\n\\n \\n\\n —PRINCESS MYRCELLA BARATHEON, his ward, betrothed to Prince Trystane, \\n\\n \\n\\n —SER ARYS OAKHEART, Myrcella’s sworn shield, \\n\\n \\n\\n —ROSAMUND LANNISTER, Myrcella’s bedmaid and companion, a distant cousin, \\n\\n \\n\\n —SEPTA EGLANTINE, Myrcella’s confessor, \\n\\n \\n\\n —MAESTER MYLES, counselor, healer, and tutor, \\n\\n \\n\\n —RICASSO, Seneschal at Sunspear, old and blind, \\n\\n \\n\\n —SER MANFREY MARTELL, castellan at Sunspear \\n\\n \\n\\n —LADY ALYSE LADYBRIGHT, lord treasurer, \\n\\n \\n\\n —SER GASCOYNE of the Greenblood, Prince Trystane’s sworn shield, \\n\\n \\n\\n —BORS and TIMOTH, serving men at Sunspear, \\n\\n \\n\\n —BELANDRA, CEDRA, the sisters MORRA and MELLEI, servingwomen at Sunspear, \\n\\n \\n\\n —Prince Doran’s bannermen, the Lords of Dorne: \\n\\n \\n\\n —ANDERS YRONWOOD, Lord of Yronwood, Warden of the Stone Way, the Bloodroyal, \\n\\n \\n\\n —SER CLETUS, his son, known for a lazy eye, \\n\\n \\n\\n —MAESTER KEDRY, healer, tutor, and counselor, \\n\\n \\n\\n —HARMEN ULLER, Lord of Hellholt, \\n\\n \\n\\n —ELLARIA SAND, his natural daughter, \\n\\n \\n\\n —SER ULWYCK ULLER, his brother, \\n\\n \\n\\n —DELONNE ALLYRION, Lady of Godsgrace, \\n\\n \\n\\n —SER RYON, her son and heir, \\n\\n \\n\\n —SER DAEMON SAND, Ryon’s natural son, the Bastard of Godsgrace, \\n\\n \\n\\n —DAGOS MANWOODY, Lord of Kingsgrave, \\n\\n \\n\\n —MORS and DICKON, his sons, \\n\\n \\n\\n —SER MYLES, his brother, \\n\\n \\n\\n —LARRA BLACKMONT, Lady of Blackmont, \\n\\n \\n\\n —JYNESSA, her daughter and heir, \\n\\n \\n\\n —PERROS, her son, a squire, \\n\\n \\n\\n —NYMELLA TOLAND, Lady of Ghost Hill, \\n\\n \\n\\n —QUENTYN QORGYLE, Lord of Sandstone, \\n\\n \\n\\n —SER GULIAN, his eldest son and heir \\n\\n \\n\\n —SER ARRON, his second son, \\n\\n \\n\\n —SER DEZIEL DALT, the Knight of Lemonwood, \\n\\n \\n\\n —SER ANDREY, his brother and heir, called DREY, \\n\\n \\n\\n —FRANKLYN FOWLER, Lord of Skyreach, called THE OLD HAWK, the Warden of the Prince’s Pass, \\n\\n \\n\\n —JEYNE and JENNELYN, his twin daughters, \\n\\n \\n\\n —SER SYMON SANTAGAR, the Knight of Spottswood, \\n\\n \\n\\n —SYLVA, his daughter and heir, called SPOTTED SYLVA for her freckles, \\n\\n \\n\\n —EDRIC DAYNE, Lord of Starfall, a squire, \\n\\n \\n\\n —SER GEROLD DAYNE, called DARKSTAR, the Knight of High Hermitage, his cousin and bannerman, \\n\\n \\n\\n —TREBOR JORDAYNE, Lord of the Tor, \\n\\n \\n\\n —MYRIA, his daughter and heir, \\n\\n \\n\\n —TREMOND GARGALEN, Lord of Salt Shore, \\n\\n \\n\\n —DAERON VAITH, Lord of the Red Dunes. \\n\\n \\n\\n Heraldic crest \\n\\n \\n\\n HOUSE STARK \\n\\n \\n\\n The Starks trace their descent from Brandon the Builder and the Kings of Winter. For thousands of years, they ruled from Winterfell as Kings in the North, until Torrhen Stark, the King Who Knelt, chose to swear fealty to Aegon the Dragon rather than give battle. When Lord Eddard Stark of Winterfell was executed by King Joffrey, the northmen foreswore their loyalty to the Iron Throne and proclaimed Lord Eddard’s son Robb as King in the North. During the War of the Five Kings, he won every battle, but was betrayed and murdered by the Freys and Boltons at the Twins during his uncle’s wedding. \\n\\n \\n\\n {ROBB STARK}, King in the North, King of the Trident, Lord of Winterfell, eldest son of Lord Eddard Stark and Lady Catelyn of House Tully, a youth of sixteen called THE YOUNG WOLF, murdered at the Red Wedding, \\n\\n \\n\\n —{GREY WIND}, his direwolf, killed at the Red Wedding, \\n\\n \\n\\n —his trueborn siblings: \\n\\n \\n\\n —SANSA, his sister, m. Tyrion of House Lannister, \\n\\n \\n\\n —{LADY}, her direwolf, killed at Castle Darry, \\n\\n \\n\\n —ARYA, a girl of eleven, missing and thought dead, \\n\\n \\n\\n —NYMERIA, her direwolf, prowling the riverlands, \\n\\n \\n\\n —BRANDON, called BRAN, a crippled boy of nine, heir to Winterfell, believed dead, \\n\\n \\n\\n —SUMMER, his direwolf, \\n\\n \\n\\n —Bran’s companions and protectors: \\n\\n \\n\\n —MEERA REED, a maid of sixteen, daughter of Lord Howland Reed of Greywater Watch, \\n\\n \\n\\n —JOJEN REED, her brother, thirteen, \\n\\n \\n\\n —HODOR, a simple boy, seven feet tall, \\n\\n \\n\\n —RICKON, a boy of four, believed dead, \\n\\n \\n\\n —SHAGGYDOG, his direwolf, black and savage, \\n\\n \\n\\n —Rickon’s companion, OSHA, a wildling once captive at Winterfell, \\n\\n \\n\\n —his bastard half brother, JON SNOW, of the Night’s Watch, \\n\\n \\n\\n —GHOST, Jon’s direwolf, white and silent, \\n\\n \\n\\n —Robb’s sworn swords: \\n\\n \\n\\n —{DONNEL LOCKE, OWEN NORREY, DACEY MORMONT, SER WENDEL MANDERLY, ROBIN FLINT}, slain at the Red Wedding, \\n\\n \\n\\n —HALLIS MOLLEN, captain of the guards, escorting Eddard Stark’s bones back to Winterfell, \\n\\n \\n\\n —JACKS, QUENT, SHADD, guardsmen, \\n\\n \\n\\n —Robb’s uncles and cousins: \\n\\n \\n\\n —BENJEN STARK, his father’s younger brother, lost ranging beyond the Wall, presumed dead, \\n\\n \\n\\n —{LYSA ARRYN}, his mother’s sister, Lady of the Eyrie, m. Lord Jon Arryn, slain with a shove, \\n\\n \\n\\n —their son, ROBERT ARRYN, Lord of the Eyrie and Defender of the Vale, a sickly boy, \\n\\n \\n\\n —EDMURE TULLY, Lord of Riverrun, his mother’s brother, taken captive at the Red Wedding, \\n\\n \\n\\n —LADY ROSLIN, of House Frey, Edmure’s bride, \\n\\n \\n\\n —SER BRYNDEN TULLY, called THE BLACKFISH, his mother’s uncle, castellan of Riverrun, \\n\\n \\n\\n —the Young Wolf’s bannermen, the Lords of the North: \\n\\n \\n\\n —ROOSE BOLTON, Lord of the Dreadfort, the turncloak, \\n\\n \\n\\n —{DOMERIC}, his trueborn son and heir, died of a bad belly, \\n\\n \\n\\n —RAMSAY BOLTON (formerly RAMSAY SNOW), Roose’s natural son, called THE BASTARD OF BOLTON, castellan of the Dreadfort, \\n\\n \\n\\n —WALDER FREY and WALDER FREY, called BIG WALDER and LITTLE WALDER, Ramsay’s squires, \\n\\n \\n\\n —{REEK}, a man-at-arms infamous for his stench, slain while posing as Ramsay, \\n\\n \\n\\n —“ARYA STARK,” Lord Roose’s captive, a feigned girl betrothed to Ramsay, \\n\\n \\n\\n —WALTON called STEELSHANKS, Roose’s captain, \\n\\n \\n\\n —BETH CASSELL, KYRA, TURNIP, PALLA, BANDY, SHYRA, PALLA, and OLD NAN, women of Winterfell held captive at the Dreadfort, \\n\\n \\n\\n —JON UMBER, called THE GREATJON, Lord of the Last Hearth, a captive at the Twins, \\n\\n \\n\\n —{JON}, called THE SMALLJON, the Greatjon’s eldest son and heir, slain at the Red Wedding, \\n\\n \\n\\n —MORS called CROWFOOD, uncle to the Greatjon, castellan at the Last Hearth, \\n\\n \\n\\n —HOTHER called WHORESBANE, uncle to the Greatjon, likewise castellan at the Last Hearth, \\n\\n \\n\\n —{RICKARD KARSTARK}, Lord of Karhold, beheaded for treason and murder of prisoner, \\n\\n \\n\\n —{EDDARD}, his son, slain in the Whispering Wood, \\n\\n \\n\\n —{TORRHEN} his son, slain in the Whispering Wood, \\n\\n \\n\\n —HARRION, his son, a captive at Maidenpool, \\n\\n \\n\\n —ALYS, Lord Rickard’s daughter, a maid of fifteen, \\n\\n \\n\\n —Rickard’s uncle, ARNOLF, castellan of Karhold, \\n\\n \\n\\n —GALBART GLOVER, Master of Deepwood Motte, unwed, \\n\\n \\n\\n —ROBETT GLOVER, his brother and heir, \\n\\n \\n\\n —Robett’s wife, SYBELLE of House Locke, \\n\\n \\n\\n —their children: \\n\\n \\n\\n —GAWEN, a boy of three, \\n\\n \\n\\n —ERENA, a babe at the breast, \\n\\n \\n\\n —Galbart’s ward, LARENCE SNOW, natural son of {Lord Halys Hornwood}, a boy of thirteen, \\n\\n \\n\\n —HOWLAND REED, Lord of Greywater Watch, a crannogman, \\n\\n \\n\\n —his wife, JYANA, of the crannogmen, \\n\\n \\n\\n —their children: \\n\\n \\n\\n —MEERA, a young huntress, \\n\\n \\n\\n —JONJEN, a boy blessed with green sight, \\n\\n \\n\\n —WYMAN MANDERLY, Lord of White Harbor, vastly fat, \\n\\n \\n\\n —SER WYLIS MANDERLY, his eldest son and heir, very fat, a captive at Harrenhal, \\n\\n \\n\\n —Wylis’s wife, LEONA of House Woolfield, \\n\\n \\n\\n —WYNAFRYD, their daughter, a maid of nineteen years, \\n\\n \\n\\n —WYLLA, their daughter, a maid of fifteen, \\n\\n \\n\\n —{SER WENDEL MANDERLY}, his second son, slain at the Red Wedding, \\n\\n \\n\\n —SER MARLON MANDERLY, his cousin, commander of the garrison at White Harbor, \\n\\n \\n\\n —MAESTER THEOMORE, counselor, tutor, healer, \\n\\n \\n\\n —MAEGE MORMONT, Lady of Bear Island, \\n\\n \\n\\n —{DACEY}, her eldest daughter and heir, slain at the Red Wedding, \\n\\n \\n\\n —ALYSANE, LYRA, JORELLE, LYANNA, her daughters, \\n\\n \\n\\n —{JEOR MORMONT}, her brother, Lord Commander of the Night’s Watch, slain by own men, \\n\\n \\n\\n —SER JORAH MORMONT, Lord Jeor’s son, once Lord of Bear Island in his own right, a knight condemned and exiled, \\n\\n \\n\\n —{SER HELMAN TALLHART}, Master of Torrhen’s Square, slain at Duskendale, \\n\\n \\n\\n —{BENFRED}, his son and heir, slain by ironmen on the Stony Shore, \\n\\n \\n\\n —EDDARA, his daughter, captive at Torrhen’s Square, \\n\\n \\n\\n —{LEOBALD}, his brother, killed at Winterfell, \\n\\n \\n\\n —Leobald’s wife, BERENA of House Hornwood, captive at Torrhen’s Square, \\n\\n \\n\\n —their sons, BRANDON and BEREN, likewise captives at Torrhen’s Square, \\n\\n \\n\\n —RODRIK RYSWELL, Lord of the Rills, \\n\\n \\n\\n —BARBREY DUSTIN, his daughter, Lady of Barrowton, widow of {Lord Willam Dustin}, \\n\\n \\n\\n —HARWOOD STOUT, her liege man, a petty lord at Barrowton, \\n\\n \\n\\n —{BETHANY BOLTON}, his daughter, second wife of Lord Roose Bolton, died of a fever, \\n\\n \\n\\n —ROGER RYSWELL, RICKARD RYSWELL, ROOSE RYSWELL, his quarrelsome cousins and bannermen, \\n\\n \\n\\n —{CLEY CERWYN}, Lord of Cerwyn, killed at Winterfell, \\n\\n \\n\\n —JONELLE, his sister, a maid of two-and-thirty, \\n\\n \\n\\n —LYESSA FLINT, Lady of Widow’s Watch, \\n\\n \\n\\n —ONDREW LOCKE, Lord of Oldcastle, an old man, \\n\\n \\n\\n —HUGO WULL, called BIG BUCKET, chief of his clan, \\n\\n \\n\\n —BRANDON NORREY, called THE NORREY, chief of his clan, \\n\\n \\n\\n —TORREN LIDDLE, called THE LIDDLE, chief of his clan. \\n\\n \\n\\n The Stark arms show a grey direwolf racing across an ice-white field. The Stark words are Winter Is Coming. \\n\\n \\n\\n Heraldic crest \\n\\n \\n\\n HOUSE TULLY \\n\\n \\n\\n Lord Edmyn Tully of Riverrun was one of the first of the river lords to swear fealty to Aegon the Conquerer. King Aegon rewarded him by raising House Tully to dominion over all the lands of the Trident. The Tully sigil is a leaping trout, silver, on a field of rippling blue and red. The Tully words are Family, Duty, Honor. \\n\\n \\n\\n EDMURE TULLY, Lord of Riverrun, taken captive at his wedding and held prisoner by the Freys, \\n\\n \\n\\n —LADY ROSLIN of House Frey, Edmure’s young bride, \\n\\n \\n\\n —{LADY CATELYN STARK}, his sister, widow of Lord Eddard Stark of Winterfell, slain at the Red Wedding, \\n\\n \\n\\n —{LADY LYSA ARRYN}, his sister, widow of Lord Jon Arryn of the Vale, pushed to her death from the Eyrie, \\n\\n \\n\\n —SER BRYNDEN TULLY, called THE BLACKFISH, Edmure’s uncle, castellan of Riverrun, \\n\\n \\n\\n —Lord Edmure’s household at Riverrun: \\n\\n \\n\\n —MAESTER VYMAN, counselor, healer, and tutor, \\n\\n \\n\\n —SER DESMOND GRELL, master-at-arms, \\n\\n \\n\\n —SER ROBIN RYGER, captain of the guard, \\n\\n \\n\\n —LONG LEW, ELWOOD, DELP, guardsmen, \\n\\n \\n\\n —UTHERYDES WAYN, steward of Riverrun, \\n\\n \\n\\n —Edmure’s bannermen, the Lords of the Trident: \\n\\n \\n\\n —TYTOS BLACKWOOD, Lord of Raventree Hall, \\n\\n \\n\\n —{LUCAS}, his son, slain at the Red Wedding, \\n\\n \\n\\n —JONOS BRACKEN, Lord of the Stone Hedge, \\n\\n \\n\\n —JASON MALLISTER, Lord of Seagard, a prisoner in his own castle, \\n\\n \\n\\n —PATREK, his son, imprisoned with his father, \\n\\n \\n\\n —SER DENYS MALLISTER, Lord Jason’s uncle, a man of the Night’s Watch, \\n\\n \\n\\n —CLEMENT PIPER, Lord of Pinkmaiden Castle, \\n\\n \\n\\n —his son and heir, SER MARQ PIPER, taken captive at the Red Wedding, \\n\\n \\n\\n —KARYL VANCE, Lord of Wayfarer’s Rest, \\n\\n \\n\\n —his elder daughter and heir, LIANE, \\n\\n \\n\\n —his younger daughters, RHIALTA and EMPHYRIA, \\n\\n \\n\\n —NORBERT VANCE, the blind Lord of Atranta, \\n\\n \\n\\n —his eldest son and heir, SER RONALD VANCE, called THE BAD, \\n\\n \\n\\n —his younger sons, SER HUGO, SER ELLERY, SER KIRTH, and MAESTER JON, \\n\\n \\n\\n —THEOMAR SMALLWOOD, Lord of Acorn Hall, \\n\\n \\n\\n —his wife, LADY RAVELLA, of House Swann, \\n\\n \\n\\n —their daughter, CARELLEN, \\n\\n \\n\\n —WILLIAM MOOTON, Lord of Maidenpool, \\n\\n \\n\\n —SHELLA WHENT, dispossessed Lady of Harrenhal, \\n\\n \\n\\n —SER WILLIS WODE, a knight in her service, \\n\\n \\n\\n —SER HALMON PAEGE, \\n\\n \\n\\n —LORD LYMOND GOODBROOK. \\n\\n \\n\\n Heraldic crest \\n\\n \\n\\n HOUSE TYRELL \\n\\n \\n\\n The Tyrells rose to power as stewards to the Kings of the Reach, though they claim descent from Garth Greenhand, gardener king of the First Men. When the last king of House Gardener was slain on the Field of Fire, his steward Harlen Tyrell surrendered Highgarden to Aegon the Conquerer. Aegon granted him the castle and dominion over the Reach. Mace Tyrell declared his support for Renly Baratheon at the onset of the War of the Five Kings, and gave him the hand of his daughter Margaery. Upon Renly’s death, Highgarden made alliance with House Lannister, and Margaery was betrothed to King Joffrey. \\n\\n \\n\\n MACE TYRELL, Lord of Highgarden, Warden of the South, Defender of the Marches, and High Marshal of the Reach, \\n\\n \\n\\n —his wife, LADY ALERIE, of House Hightower of Oldtown, \\n\\n \\n\\n —their children: \\n\\n \\n\\n —WILLAS, their eldest son, heir to Highgarden, \\n\\n \\n\\n —SER GARLAN, called THE GALLANT, their second son, newly raised to Lord of Brightwater, \\n\\n \\n\\n —Garlan’s wife, LADY LEONETTE of House Fossoway, \\n\\n \\n\\n —SER LORAS, the Knight of Flowers, their youngest son, a Sworn Brother of the Kingsguard, \\n\\n \\n\\n —MARGAERY, their daughter, twice wed and twice widowed, \\n\\n \\n\\n —Margaery’s companions and ladies-in-waiting: \\n\\n \\n\\n —her cousins, MEGGA, ALLA, and ELINOR TYRELL, \\n\\n \\n\\n —Elinor’s betrothed, ALYN AMBROSE, squire, \\n\\n \\n\\n —LADY ALYSANNE BULWER, LADY ALYCE GRACEFORD, LADY TAENA MERRYWEATHER, MEREDYTH CRANE called MERRY, SEPTA NYSTERICA, her companions, \\n\\n \\n\\n —Mace’s widowed mother, LADY OLENNA of House Redwyne, called THE QUEEN OF THORNS, \\n\\n \\n\\n —ARRYK and ERRYK, her guardsmen, twins seven feet tall called LEFT and RIGHT, \\n\\n \\n\\n —Mace’s sisters: \\n\\n \\n\\n —LADY MINA, wed to Paxter Redwyne, Lord of the Arbor, \\n\\n \\n\\n —their children: \\n\\n \\n\\n —SER HORAS REDWYNE, twin to Hobber, called HORROR, \\n\\n \\n\\n —SER HOBBER REDWYNE, twin to Horas, called SLOBBER, \\n\\n \\n\\n —DESMERA REDWYNE, a maid of sixteen, \\n\\n \\n\\n —LADY JANNA, wed to Ser Jon Fossoway, \\n\\n \\n\\n —Mace’s uncles and cousins: \\n\\n \\n\\n —Mace’s uncle, GARTH, called THE GROSS, Lord Seneschal of Highgarden, \\n\\n \\n\\n —Garth’s bastard sons, GARSE and GARRETT FLOWERS, \\n\\n \\n\\n —Mace’s uncle, SER MORYN, Lord Commander of the City Watch of Oldtown, \\n\\n \\n\\n —Moryn’s son, {SER LUTHOR}, m. Lady Elyn Norridge, \\n\\n \\n\\n —Luthor’s son, SER THEODORE, m. Lady Lia Serry, \\n\\n \\n\\n —Theodore’s daughter, ELINOR, \\n\\n \\n\\n —Theodore’s son, LUTHOR, a squire, \\n\\n \\n\\n —Luthor’s son, MAESTER MEDWICK, \\n\\n \\n\\n —Luthor’s daughter, OLENE, m. Ser Leo Blackbar, \\n\\n \\n\\n —Moryn’s son, LEO, called LEO THE LAZY, a novice at the Citadel of Oldtown, \\n\\n \\n\\n —Mace’s uncle, MAESTER GORMON, serving at the Citadel, \\n\\n \\n\\n —Mace’s cousin, {SER QUENTIN}, died at Ashford, \\n\\n \\n\\n —Quentin’s son, SER OLYMER, m. Lady Lysa Meadows, \\n\\n \\n\\n —Olymer’s sons, RAYMUND and RICKARD, \\n\\n \\n\\n —Olymer’s daughter, MEGGA, \\n\\n \\n\\n —Mace’s cousin, MAESTER NORMUND, in service at Blackcrown, \\n\\n \\n\\n —Mace’s cousin, {SER VICTOR}, slain by the Smiling Knight of the Kingswood Brotherhood, \\n\\n \\n\\n —Victor’s daughter, VICTARIA, m. {Lord Jon Bulwer}, died of a summer fever, \\n\\n \\n\\n —their daughter, LADY ALYSANNE BULWER, eight, \\n\\n \\n\\n —Victor’s son, SER LEO, m. Lady Alys Beesbury, \\n\\n \\n\\n —Leo’s daughters, ALLA and LEONA, \\n\\n \\n\\n —Leo’s sons, LYONEL, LUCAS, and LORENT, \\n\\n \\n\\n —Mace’s household at Highgarden: \\n\\n \\n\\n —MAESTER LOMYS, counselor, healer, and tutor, \\n\\n \\n\\n —IGON VYRWEL, captain of the guard, \\n\\n \\n\\n —SER VORTIMER CRANE, master-at-arms, \\n\\n \\n\\n —BUTTERBUMPS, fool and jester, hugely fat, \\n\\n \\n\\n —his bannermen, the Lords of the Reach: \\n\\n \\n\\n —RANDYLL TARLY, Lord of Horn Hill, \\n\\n \\n\\n —PAXTER REDWYNE, Lord of the Arbor, \\n\\n \\n\\n —SER HORAS and SER HOBBER, his twin sons, \\n\\n \\n\\n —Lord Paxter’s healer, MAESTER BALLABAR, \\n\\n \\n\\n —ARWYN OAKHEART, Lady of Old Oak, \\n\\n \\n\\n —Lady Arwyn’s youngest son, SER ARYS, a Sworn Brother of the Kingsguard, \\n\\n \\n\\n —MATHIS ROWAN, Lord of Goldengrove, m. Bethany of House Redwyne, \\n\\n \\n\\n —LEYTON HIGHTOWER, Voice of Oldtown, Lord of the Port, \\n\\n \\n\\n —HUMFREY HEWETT, Lord of Oakenshield, \\n\\n \\n\\n —FALIA FLOWERS, his bastard daughter, \\n\\n \\n\\n —OSBERT SERRY, Lord of Southshield, \\n\\n \\n\\n —SER TALBERT, his son and heir, \\n\\n \\n\\n —GUTHOR GRIMM, Lord of Greyshield, \\n\\n \\n\\n —MORIBALD CHESTER, Lord of Greenshield, \\n\\n \\n\\n —ORTON MERRYWEATHER, Lord of Longtable, \\n\\n \\n\\n —LADY TAENA, his wife, a woman of Myr, \\n\\n \\n\\n —RUSSELL, her son, a boy of eight, \\n\\n \\n\\n —LORD ARTHUR AMBROSE, m. Lady Alysanne Hightower, \\n\\n \\n\\n —his knights and sworn swords: \\n\\n \\n\\n —SER JON FOSSOWAY, of the green-apple Fossoways, \\n\\n \\n\\n —SER TANTON FOSSOWAY, of the red-apple Fossoways. \\n\\n \\n\\n The Tyrell sigil is a golden rose on a grass-green field. Their words are Growing Strong. \\n\\n \\n\\n REBELS AND ROGUES \\n\\n SMALLFOLK AND SWORN BROTHERS \\n\\n \\n\\n LORDLINGS, WANDERERS, AND COMMON MEN \\n\\n \\n\\n —SER CREIGHTON LONGBOUGH and SER ILLIFER THE PENNILESS, hedge knights and companions, \\n\\n \\n\\n —HIBALD, a merchant fearful and niggardly, \\n\\n \\n\\n —SER SHADRICK OF THE SHADY GLEN, called THE MAD MOUSE, a hedge knight in Hibald’s service, \\n\\n \\n\\n —BRIENNE, THE MAID OF TARTH, also called BRIENNE THE BEAUTY, a maiden on a quest, \\n\\n \\n\\n —LORD SELWYN THE EVENSTAR, Lord of Tarth, her father, \\n\\n \\n\\n —{BIG BEN BUSHY}, SER HYLE HUNT, SER MARK MULLENDORE, SER EDMUND AMBROSE, {SER RICHARD FARROW}, {WILL THE STORK}, SER HUGH BEESBURY, SER RAYMOND NAYLAND, HARRY SAWYER, SER OWEN INCHFIELD, ROBIN POTTER, her onetime suitors, \\n\\n \\n\\n —RENFRED RYKKER, Lord of Duskendale, \\n\\n \\n\\n —SER RUFUS LEEK, a one-legged knight in his service, castellan of the Dun Fort at Duskendale, \\n\\n \\n\\n —WILLIAM MOOTON, Lord of Maidenpool, \\n\\n \\n\\n —ELEANOR, his eldest daughter and heir, thirteen, \\n\\n \\n\\n —RANDYLL TARLY, Lord of Horn Hill, commanding King Tommen’s forces along the Trident, \\n\\n \\n\\n —DICKON, his son and heir, a young squire, \\n\\n \\n\\n —SER HYLE HUNT, sworn to the service of House Tarly, \\n\\n \\n\\n —SER ALYN HUNT, Ser Hyle’s cousin, likewise in Lord Randyll’s service, \\n\\n \\n\\n —DICK CRABB, called NIMBLE DICK, a Crabb of Crackclaw Point, \\n\\n \\n\\n —EUSTACE BRUNE, Lord of the Dyre Den, \\n\\n \\n\\n —BENNARD BRUNE, the Knight of Brownhollow, his cousin, \\n\\n \\n\\n —SER ROGER HOGG, the Knight of Sow’s Horn, \\n\\n \\n\\n —SEPTON MERIBALD, a barefoot septon, \\n\\n \\n\\n —his dog, DOG, \\n\\n \\n\\n —THE ELDER BROTHER, of the Quiet Isle, \\n\\n \\n\\n —BROTHER NARBERT, BROTHER GILLAM, BROTHER RAWNEY, pentitent brothers of the Quiet Isle, \\n\\n \\n\\n —SER QUINCY COX, the Knight of Saltpans, an old man in his dotage, \\n\\n \\n\\n —at the old crossroads inn: \\n\\n \\n\\n —JEYNE HEDDLE, called LONG JEYNE, innkeep, a tall young wench of eighteen years, \\n\\n \\n\\n —WILLOW, her sister, stern with a spoon, \\n\\n \\n\\n —TANSY, PATE, JON PENNY, BEN, orphans at the inn, \\n\\n \\n\\n —GENDRY, an apprentice smith and bastard son of King Robert I Baratheon, ignorant of his birth, \\n\\n \\n\\n —at Harrenhal, \\n\\n \\n\\n —RAFFORD called RAFF THE SWEETLING, SHITMOUTH, DUNSEN, men of the garrison, \\n\\n \\n\\n —BEN BLACKTHUMB, a smith and armorer, \\n\\n \\n\\n —PIA, a serving wench, once pretty, \\n\\n \\n\\n —MAESTER GULIAN, healer, tutor, and counselor, \\n\\n \\n\\n —at Darry, \\n\\n \\n\\n —LADY AMEREI FREY, called GATEHOUSE AMI, an amorous young widow betrothed to Lord Lancel Lannister, \\n\\n \\n\\n —Lady Amerei’s mother, LADY MARIYA of House Darry, widowed wife of Merrett Frey, \\n\\n \\n\\n —Lady Amerei’s sister, MARISSA, a maid of thirteen, \\n\\n \\n\\n —SER HARWYN PLUMM, called HARDSTONE, commander of the garrison, \\n\\n \\n\\n —MAESTER OTTOMORE, healer, tutor, and advisor, \\n\\n \\n\\n —at the Inn of the Kneeling Man: \\n\\n \\n\\n —SHARNA, the innkeep, a cook and midwife, \\n\\n \\n\\n —her husband, called HUSBAND, \\n\\n \\n\\n —BOY, an orphan of the war, \\n\\n \\n\\n —HOT PIE, a baker’s boy, now orphaned. \\n\\n \\n\\n OUTLAWS AND BROKEN MEN \\n\\n \\n\\n {BERIC DONDARRION}, once Lord of Blackhaven, six times slain, \\n\\n \\n\\n —EDRIC DAYNE, Lord of Starfall, a boy of twelve, Lord Beric’s squire, \\n\\n \\n\\n —THE MAD HUNTSMAN of Stoney Sept, his sometime ally, \\n\\n \\n\\n —GREENBEARD, a Tyroshi sellsword, his uncertain friend, \\n\\n \\n\\n —ANGUY THE ARCHER, a bowman from the Dornish Marches, \\n\\n \\n\\n —MERRIT O’ MOONTOWN, WATTY THE MILLER, SWAMPY MEG, JON O’ NUTTEN, outlaws in his band, \\n\\n \\n\\n LADY STONEHEART, a hooded woman, sometimes called MOTHER MERCY, THE SILENT SISTER, and THE HANGWOMAN, \\n\\n \\n\\n —LEM, called LEM LEMONCLOAK, a onetime soldier, \\n\\n \\n\\n —THOROS OF MYR, a red priest, \\n\\n \\n\\n —HARWIN, son of Hullen, a northman once in service to Lord Eddard Stark of Winterfell, \\n\\n \\n\\n —JACK-BE-LUCKY, a wanted man, short an eye, \\n\\n \\n\\n —TOM OF SEVENSTREAMS, a singer of dubious report, called TOM SEVENSTRINGS and TOM O’ SEVENS, \\n\\n \\n\\n —LIKELY LUKE, NOTCH, MUDGE, BEARDLESS DICK, outlaws, \\n\\n \\n\\n SANDOR CLEGANE, called THE HOUND, once King Joffrey’s sworn shield, later a Sworn Brother of the Kingsguard, last seen feverish and dying beside the Trident, \\n\\n \\n\\n {VARGO HOAT} of the Free City of Qohor, called THE GOAT, \\n\\n \\n\\n a sellsword captain of slobbery speech, slain at \\n\\n \\n\\n Harrenhal by Ser Gregor Clegane, \\n\\n \\n\\n —his Brave Companions, also called the Bloody Mummers: \\n\\n \\n\\n —URSWYCK called FAITHFUL, his lieutenant, \\n\\n \\n\\n —{SEPTON UTT}, hanged by Lord Beric Dondarrion, \\n\\n \\n\\n —TIMEON OF DORNE, FAT ZOLLO, RORGE, BITER, PYG, SHAGWELL THE FOOL, TOGG JOTH of Ibben, THREE TOES, scattered and running, \\n\\n \\n\\n —at the Peach, a brothel in Stoney Sept: \\n\\n \\n\\n —TANSY, the red-haired proprietor, \\n\\n \\n\\n —ALYCE, CASS, LANNA, JYZENE, HELLY, BELLA, some of her peaches, \\n\\n \\n\\n —at Acorn Hall, the seat of House Smallwood: \\n\\n \\n\\n —LADY RAVELLA, formerly of House Swann, wife to Lord Theomar Smallwood, \\n\\n \\n\\n —here and there and elsewhere: \\n\\n \\n\\n —LORD LYMOND LYCHESTER, an old man of wandering wit, who once held Ser Maynard at the bridge, \\n\\n \\n\\n —his young caretaker, MAESTER ROONE, \\n\\n \\n\\n —the ghost of High Heart, \\n\\n \\n\\n —the Lady of the Leaves, \\n\\n \\n\\n —the septon at Sallydance. \\n\\n \\n\\n THE SWORN BROTHERS OF THE NIGHT’S WATCH \\n\\n \\n\\n JON SNOW, the Bastard of Winterfell, nine-hundred-and-ninety- eighth Lord Commander of the Night’s Watch, \\n\\n \\n\\n —GHOST, his white direwolf, \\n\\n \\n\\n —his steward, EDDISON TOLLETT, called DOLOROUS EDD, \\n\\n \\n\\n THE MEN OF CASTLE BLACK \\n\\n \\n\\n —BENJEN STARK, First Ranger, long missing, presumed dead, \\n\\n \\n\\n —SER WYNTON STOUT, an aged ranger, feeble of wit, \\n\\n \\n\\n —KEDGE WHITEYE, BEDWYCK called GIANT, MATTHAR, DYWEN, GARTH GREYFEATHER, ULMER OF THE KINGSWOOD, ELRON, PYPAR called PYP, GRENN called AUROCHS, BERNARR called BLACK BERNARR, GOADY, TIM STONE, BLACK JACK BULWER, GEOFF called THE SQUIRREL, BEARDED BEN, rangers, \\n\\n \\n\\n —BOWEN MARSH, Lord Steward, \\n\\n \\n\\n —THREE-FINGER HOBB, steward and chief cook, \\n\\n \\n\\n —{DONAL NOYE}, one-armed armorer and smith, slain at the gate by Mag the Mighty \\n\\n \\n\\n —OWEN called THE OAF, TIM TANGLETONGUE, MULLY, CUGEN, DONNEL HILL called SWEET DONNEL, LEFT HAND LEW, JEREN, WICK WHITTLESTICK, stewards, \\n\\n \\n\\n —OTHELL YARWYCK, First Builder, \\n\\n \\n\\n —SPARE BOOT, HALDER, ALBETT, KEGS, builders, \\n\\n \\n\\n —CONWY, GUEREN, wandering recruiters, \\n\\n \\n\\n —SEPTON CELLADOR, a drunken devout, \\n\\n \\n\\n —SER ALLISER THORNE, former master-at-arms, \\n\\n \\n\\n —LORD JANOS SLYNT, former commander of the City Watch of King’s Landing, briefly Lord of Harrenhal, \\n\\n \\n\\n —MAESTER AEMON (TARGARYEN), healer and counselor, a blind man, one hundred and two years old, \\n\\n \\n\\n —Aemon’s steward, CLYDAS, \\n\\n \\n\\n —Aemon’s steward, SAMWELL TARLY, fat and bookish, \\n\\n \\n\\n —IRON EMMETT, formerly of Eastwatch, master-at-arms, \\n\\n \\n\\n —HARETH called HORSE, the twins ARRON and EMRICK, SATIN, HOP-ROBIN, recruits in training, \\n\\n \\n\\n THE MEN OF THE SHADOW TOWER \\n\\n \\n\\n SER DENYS MALLISTER, Commander, Shadow Tower, \\n\\n \\n\\n —his steward and squire, WALLACE MASSEY, \\n\\n \\n\\n —MAESTER MULLIN, healer and counselor, \\n\\n \\n\\n —{QHORIN HALFHAND}, chief ranger, slain by Jon Snow beyond the Wall, \\n\\n \\n\\n —brothers of the Shadow Tower: \\n\\n \\n\\n —{SQUIRE DALBRIDGE, EGGEN}, rangers, slain in the Skirling Pass, \\n\\n \\n\\n —STONESNAKE, a ranger, lost afoot in Skirling Pass, \\n\\n \\n\\n THE MEN OF EASTWATCH-BY-THE-SEA \\n\\n \\n\\n COTTER PYKE, Commander, \\n\\n \\n\\n —MAESTER HARMUNE, healer and counselor, \\n\\n \\n\\n —OLD TATTERSALT, captain of the Blackbird, \\n\\n \\n\\n —SER GLENDON HEWETT, master-at-arms, \\n\\n \\n\\n —brothers of Eastwatch: \\n\\n \\n\\n —DAREON, steward and singer, \\n\\n \\n\\n AT CRASTER’S KEEP (THE BETRAYERS) \\n\\n \\n\\n —DIRK, who murdered Craster, his host, \\n\\n \\n\\n —OLLO LOPHAND, who slew his lord commander, Jeor Mormont, \\n\\n \\n\\n —GARTH OF GREENAWAY, MAWNEY, GRUBBS, ALAN OF ROSBY, former rangers \\n\\n \\n\\n —CLUBFOOT KARL, ORPHAN OSS, MUTTERING BILL, former stewards. \\n\\n \\n\\n the WILDLINGS, or THE FREE FOLK \\n\\n \\n\\n MANCE RAYDER, King-beyond-the-Wall, a captive at Castle Black, \\n\\n \\n\\n —his wife, {DALLA}, died in childbirth, \\n\\n \\n\\n —their newborn son, born in battle, not yet named, \\n\\n \\n\\n —VAL, Dalla’s younger sister, “the wildling princess,” a captive at Castle Black, \\n\\n \\n\\n —wildling chiefs and captains: \\n\\n \\n\\n —{HARMA}, called DOGSHEAD, slain beneath the Wall, \\n\\n \\n\\n —HALLECK, her brother, \\n\\n \\n\\n —THE LORD OF BONES, mocked as RATTLESHIRT, a raider and leader of a war band, captive at Castle Black, \\n\\n \\n\\n —{YGRITTE}, a young spearwife, Jon Snow’s lover, killed during the attack on Castle Black, \\n\\n \\n\\n —RYK, called LONGSPEAR, a member of his band, \\n\\n \\n\\n —RAGWYLE, LENYL, members of his band, \\n\\n \\n\\n —{STYR}, Magnar of Thenn, slain attacking Castle Black, \\n\\n \\n\\n —SIGORN, Styr’s son, the new Magnar of Thenn, \\n\\n \\n\\n —TORMUND, Mead-King of Ruddy Hall, called GIANTSBANE, TALL-TALKER, HORN-BLOWER, and BREAKER OF ICE, also THUNDERFIST, HUSBAND TO BEARS, SPEAKER TO GODS, and FATHER OF HOSTS, \\n\\n \\n\\n —Tormund’s sons, TOREGG THE TALL, TORWYRD THE TAME, DORMUND, and DRYN, his daughter MUNDA, \\n\\n \\n\\n —THE WEEPER, a raider and leader of a war band, \\n\\n \\n\\n —{ALFYN CROWKILLER}, a raider, slain by Qhorin Halfhand of the Night’s Watch, \\n\\n \\n\\n —{ORELL}, called ORELL THE EAGLE, a skinchanger slain by Jon Snow in the Skirling Pass, \\n\\n \\n\\n —{MAG MAR TUN DOH WEG}, called MAG THE MIGHTY, a giant, slain by Donal Noye at the gate of Castle Black, \\n\\n \\n\\n —VARAMYR called SIXSKINS, a skinchanger, master of three wolves, a shadowcat, and snow bear, \\n\\n \\n\\n —{JARL}, a young raider, Val’s lover, killed in a fall from the Wall, \\n\\n \\n\\n —GRIGG THE GOAT, ERROK, BODGER, DEL, BIG BOIL, HEMPEN DAN, HENK THE HELM, LENN, TOEFINGER, wildlings and raiders, \\n\\n \\n\\n {CRASTER}, master of Craster’s Keep, slain by Dirk of the Night’s Watch, a guest beneath his roof, \\n\\n \\n\\n —GILLY, his daughter and wife, \\n\\n \\n\\n —Gilly’s newborn son, not yet named, \\n\\n \\n\\n —DYAH, FERNY, NELLA, three of Craster’s nineteen wives. \\n\\n \\n\\n BEYOND THE NARROW SEA \\n\\n \\n\\n Heraldic crest \\n\\n \\n\\n THE QUEEN ACROSS THE WATER \\n\\n \\n\\n DAENERYS TARGARYEN, the First of Her Name, Queen of Meereen, Queen of the Andals and the Rhoynar and the First Men, Lord of the Seven Kingdoms, Protector of the Realm, Khaleesi of the Great Grass Sea, called DAENERYS STORMBORN, the UNBURNT, MOTHER OF DRAGONS, \\n\\n \\n\\n —her dragons, DROGON, VISERION, RHAEGAL, \\n\\n \\n\\n —her brother, {RHAEGAR}, Prince of Dragonstone, slain by Robert Baratheon on the Trident, \\n\\n \\n\\n —Rhaegar’s daughter, {RHAENYS}, murdered during the Sack of King’s Landing, \\n\\n \\n\\n —Rhaegar’s son, {AEGON, a babe in arms, murdered during the Sack of King’s Landing, \\n\\n \\n\\n —her brother {VISERYS}, the Third of His Name, called THE BEGGAR KING, crowned with molten gold, \\n\\n \\n\\n —her lord husband, {DROGO}, a khal of the Dothraki, died of a wound gone bad, \\n\\n \\n\\n —her stillborn son by Drogo, {RHAEGO}, slain in the womb by the maegi Mirri Maz Duur, \\n\\n \\n\\n —her Queensguard: \\n\\n \\n\\n —SER BARRISTAN SELMY, called BARRISTAN THE BOLD, once Lord Commander of King Robert’s Kingsguard, \\n\\n \\n\\n —JHOGO, ko and bloodrider, the whip, \\n\\n \\n\\n —AGGO, ko and bloodrider, the bow, \\n\\n \\n\\n —RAKHARO, ko and bloodrider, the arakh, \\n\\n \\n\\n —STRONG BELWAS, eunuch and former fighting slave, \\n\\n \\n\\n —her captains and commanders: \\n\\n \\n\\n —DAARIO NAHARIS, a flamboyant Tyroshi sellsword, commanding the company of Stormcrows, \\n\\n \\n\\n —BEN PLUMM, called BROWN BEN, a mongrel sellsword, commanding the company of Second Sons, \\n\\n \\n\\n —GREY WORM, a eunuch, commanding the Unsullied, a company of eunuch infantry, \\n\\n \\n\\n —GROLEO of Pentos, formerly captain of the great cog Saduleon, now an admiral without a fleet, \\n\\n \\n\\n —her handmaids: \\n\\n \\n\\n —IRRI and JHIQUI, two Dothraki girls, sixteen, \\n\\n \\n\\n —MISSANDEI, a Naathi scribe and translator, \\n\\n \\n\\n —her known and suspected enemies: \\n\\n \\n\\n —GRAZDAN MO ERAZ, a nobleman of Yunkai, \\n\\n \\n\\n —KHAL PONO, once ko to Khal Drogo, \\n\\n \\n\\n —KHAL JHAQO, once ko to Khal Drogo, \\n\\n \\n\\n —MAGGO, his bloodrider, \\n\\n \\n\\n —THE UNDYING OF QARTH, a band of warlocks, \\n\\n \\n\\n —PYAT PREE, a Qartheen warlock, \\n\\n \\n\\n —THE SORROWFUL MEN, a guild of Qartheen assassins, \\n\\n \\n\\n —SER JORAH MORMONT, formerly Lord of Bear Island, \\n\\n \\n\\n —{MIRRI MAZ DUUR}, godswife and maegi, a servant of the Great Shepherd of Lhazar, \\n\\n \\n\\n —her uncertain allies, past and present: \\n\\n \\n\\n —XARO XHOAN DAXOS, a merchant prince of Qarth, \\n\\n \\n\\n —QUAITHE, a masked shadowbinder from Asshai, \\n\\n \\n\\n —ILLYRIO MOPATIS, a magister of the Free City of Pentos, who brokered her marriage to Khal Drogo, \\n\\n \\n\\n —CLEON THE GREAT, butcher king of Astapor, \\n\\n \\n\\n —KHAL MORO, sometime ally of Khal Drogo, \\n\\n \\n\\n —RHOGORO, his son and khalakka, \\n\\n \\n\\n —KHAL JOMMO, sometime ally of Khal Drogo. \\n\\n \\n\\n The Targaryens are the blood of the dragon, descended from the high lords of the ancient Freehold of Valyria, their heritage marked by lilac, indigo, and violet eyes and hair of silver-gold. To preserve their blood and keep it pure, House Targaryen has oft wed brother to sister, cousin to cousin, uncle to niece. The founder of the dynasty, Aegon the Conquerer, took both his sisters to wife and fathered sons on each. The Targaryen banner is a three-headed dragon, red on black, the three heads representing Aegon and his sisters. The Targaryen words are Fire and Blood. \\n\\n \\n\\n IN BRAAVOS \\n\\n \\n\\n FERREGO ANTARYON, Sealord of Braavos, \\n\\n \\n\\n —QARRO VOLENTIN, First Sword of Braavos, his protector, \\n\\n \\n\\n —BELLEGERE OTHERYS called THE BLACK PEARL, a courtesan descended from the pirate queen of the same name, \\n\\n \\n\\n —THE VEILED LADY, THE MERLING QUEEN, THE MOONSHADOW, THE DAUGHTER OF THE DUSK, THE NIGHTINGALE, THE POETESS, famous courtesans, \\n\\n \\n\\n —TERNESIO TERYS, Merchant-Captain of the Titan’s Daughter, \\n\\n \\n\\n —YORKO and DENYO, two of his sons, \\n\\n \\n\\n —MOREDO PRESTAYN, Merchant-Captain of the Vixen, \\n\\n \\n\\n —LOTHO LORNEL, a dealer in old books and scrolls, \\n\\n \\n\\n —EZZELYNO, a red priest, oft drunk, \\n\\n \\n\\n —SEPTON EUSTACE, disgraced and defrocked, \\n\\n \\n\\n —TERRO and ORBELO, a pair of bravos, \\n\\n \\n\\n —BLIND BEQQO, a fishmonger, \\n\\n \\n\\n —BRUSCO, a fishmonger, \\n\\n \\n\\n —his daughters, TALEA and BREA, \\n\\n \\n\\n —MERALYN, called MERRY, proprietor of the Happy Port, a brothel near the Ragman’s Harbor, \\n\\n \\n\\n —THE SAILOR’S WIFE, a whore at the Happy Port, \\n\\n \\n\\n —LANNA, her daughter, a young whore, \\n\\n \\n\\n —BLUSHING BETHANY, YNA ONE-EYE, ASSADORA OF IBBEN, the whores of the Happy Port, \\n\\n \\n\\n —RED ROGGO, GYLORO DOTHARE, GYLENO DOTHARE, a scribbler called QUILL, COSSOMO THE CONJURER, patrons of the Happy Port, \\n\\n \\n\\n —TAGGANARO, a dockside cutpurse and thief, \\n\\n \\n\\n —CASSO, KING OF THE SEALS, his trained seal, \\n\\n \\n\\n —LITTLE NARBO, his sometime partner, \\n\\n \\n\\n —MYRMELLO, JOSS THE GLOOM, QUENCE, ALLAQUO, SLOEY, mummers performing nightly on the Ship, \\n\\n \\n\\n —S’VRONE, a dockside whore of a murderous bent, \\n\\n \\n\\n —THE DRUNKEN DAUGHTER, a whore of uncertain temper, \\n\\n \\n\\n —CANKER JEYNE, a whore of uncertain sex, \\n\\n \\n\\n —THE KINDLY MAN and THE WAIF, servants of the Many-Faced God at the House of Black and White, \\n\\n \\n\\n —UMMA, the temple cook, \\n\\n \\n\\n —THE HANDSOME MAN, THE FAT FELLOW, THE LORDLING, THE STERN FACE, THE SQUINTER, and THE STARVED MAN, secret servants of Him of Many Faces, \\n\\n \\n\\n —ARYA of House Stark, a girl with an iron coin, also known as ARRY, NAN, WEASEL, SQUAB, SALTY, and CAT \\n\\n \\n\\n —QUHURU MO, of Tall Trees Town in the Summer Isles, master of the merchantman Cinnamon Wind, \\n\\n \\n\\n —KOJJA MO, his daughter, the red archer, \\n\\n \\n\\n —XHONDO DHORU, mate on the Cinnamon Wind. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1570/46590.html","bookId":128,"book":{"id":128,"title":"冰与火之歌：A Feast for Crows 群鸦的盛宴","description":"简介： 《群鸦的盛宴》的故事时间紧接在《冰雨的风暴》之后，且与下一卷《魔龙的狂舞》平行。五王之战渐渐平息。罗柏史塔克、乔佛里拜拉席恩、蓝礼拜拉席恩和巴隆葛雷乔伊均已死亡。国王史坦尼斯拜拉席恩逃亡长城，琼恩雪诺已成为这里的总司令。国王托曼拜拉席恩，乔佛里八岁大...","cover":"http://novel.tingroom.com/file/upload/201605/31/14-51-15-74-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1570","creation":"Aug 1, 2019 12:18:19 AM","modification":"Aug 1, 2019 12:24:45 AM"}}
