{"id":99875,"no":11,"title":"Page 11","content":"\n “Do you really believe he loved you more?”\n “In his own way, that is selfish and cruel, yes, I do believe he loved me most.” I wiped my tears away with my handkerchief and set my book aside. Standing, I stared up at the night sky as though seeking guidance from the God whom I feared no longer heard my prayers. “Of course, his love never prevented him from hurting me. He made me kill my own mother. He is a monster.”\n “I could go for you and retrieve it,” Magda offered.\n “No, I could never ask that of you! They are vile. They would hurt you!” I protested immediately.\n “I could go in the daylight,” Magda suggested. “With Adem. We could go together and bring back whatever you desire from the castle. It is not so unusual for Vlad to be asleep during the day and Adem would not be suspicious at his absence.”\n Though we both sincerely liked Adem, we had agreed to keep the truth of my action against Vlad a secret. Despite my caution, I did trust Adem enough to know he would honor my request. Magda’s proposal appealed to me and the thought of recovering the rosary assuaged the guilt I felt at the neglect of my deceased family. Besides, it only seemed proper that my mother should be laid to rest with the rosary she had carried with her since her First Communion.\n “Could you truly do that for me? I would be so very grateful. I know exactly where it is located.” I worried for her safety, yet I trusted Adem. If they were careful and did not enter the areas of the castle where the sisters slept, they should be safe. It was rare for the sisters to rise before the sun set and if they did, they would stay within the darkness of the old chapel.\n “Yes, of course,” Magda promised. “Just instruct us on where to go and I know we shall be able to retrieve it.”\n Tingling with excitement and trepidation, I nodded my head. “Very well. Summon Adem so I might speak to him.”\n Laying aside her mending, Magda quickly rushed from the room to fetch Adem. Smoothing my skirt and tucking my curls from my face, I gazed upon the waning moon and smiled in my resolve. By this one act, I would restore my faith in my own humanity and honor my beloved mother. It was only proper and right. If luck, or God, was with us, then Adem and Magda would return safely and none would be the wiser as to the horrible fate I had inflicted upon Vlad Dracula.\n “You asked for me?” Adem’s voice said from behind me.\n I displayed a smile as I pivoted in his direction. “Yes. I have a most urgent request. I hope you will be kind enough to say yes.”\n Looking curious, Adem drew closer as Magda closed the door and joined us.\n “Would you go to the castle of Vlad Dracula and recover a precious item for me?”\n With a flash of a smile, Adem answered, “It would be my greatest of pleasures.”\n And as simple as that, I released my future to the fates.\n Chapter 6\n Letter from Adem to Astir continued...\n I had questioned Magda about the Countess\u0027 family hoping to lay the seed that would flourish into a possible gateway to the castle, but I was surprised at how quickly that seed grew. When the Countess approached me about escorting Magda to the castle to retrieve the rosary of Lady Antoinetta, I immediately agreed. That very hour, we made our plans. The Countess was certain if we arrived at the castle at noon the sisters and her husband would be deeply asleep and therefore would not interfere in the retrieval of the rosary. She stressed that she did not want her husband to be privy to her plans for her family since it was by his hand they had died. I vowed that we would do our very best to not disturb resting the place of the vampires.\n It was just this morning when Magda and I departed for the castle...\n The sun was high in the sky when I strode from the Golden Krone hotel with Magda hurrying behind me. She had spent the morning in the small chapel down the road praying while I prepared my weapons for any chance encounter with the Brides of Vlad Dracula or Dracula himself. Though the Countess had assured me that they would not rise during the hours of the day, I am inclined to be fully armed when entering the abode of vampires.\n The heat of the day rose from the cobblestones, warming the soles of my boots as I waited for my man to bring about the horse. Magda stood beside me, her fingers fussing with her long braids. She is a pretty woman with her large dark eyes, rounded cheeks, full lips, and a delicately pointed chin. I suspect her youthful appearance is as deceptive as my own. Her gaze is not that of a young woman, but also not that of one who has lived so long that the joy of life is lost. Therefore, I do not believe she matches my age. Clad as a local, Magda’s long skirt and the chemise were tied at her waist and a red scarf was draped about her face. She reminded me painfully of my lost love, and I raised my face to the sun to remind myself that while Saadat now dwells in darkness, I do not.\n Enre rounded the corner guiding my majestic equine companion. I am uncertain of its nature, or even if it is truly a horse, but I have grown fond of the arrogant creature. It often regards me with amusement and I wonder at its thoughts. Tossing its mane, it turned its dark eyes toward me, dancing back and forth with anticipation.\n Beside me, Magda crossed herself and the horse snorted with what I suspected was contempt.\n “It will not hurt you,” I promised her.\n “What is it?” Magda regarded the creature warily, sensing its unique nature.\n “I do not know. All I know is that Astir sent it and its companion to me.”\n “What is its name?” Regarding it warily, she took a step back toward the hotel.\n Enre looked amused as he fed the horse a bit of apple from his gloved hand. “No name is suitable for this one. It is wild magic.”\n The horse chomped down on the apple and chewed as it regarded Magda with great interest.\n “It must have a name,” Magda insisted, wilting beneath its gaze.\n “If it has a name, it does not tell us what it is,” I confessed. “Though I would be honored if it would let me one day know.”\n The horse neighed its delight and bumped my shoulder with its nose.\n This elicited a girlish laugh from Magda despite her misgivings. “I think it’s mocking you.”\n “I am sure it is,” I conceded, running my gloved hand affectionately down its mane.\n Magda relaxed her wary stance and approached slowly. I grabbed hold of the saddle and slung myself up, settling onto the back of the great beast. Enre handed me the reins as Magda waited. Reaching down, I took hold of her hand and lifted her easily onto the back of the beast. She clutched my waist as she arranged herself behind me. Like the countess, she rode with her legs slung to one side.\n Bothersome women should learn to ride as a man in this world fraught with danger. I vow that I shall teach both of them before the warm months are done.\n “Enre, we should return before nightfall. If we do not, send word to Astir and take the countess to Vienna without hesitation. Understood?” Though I was certain of a successful outcome, I would never wish to endanger the countess.\n Enre inclined his head. Satisfied with his obedience, I dug in my heels, flicked the reins, and the horse raced down the busy streets of Bistriţa. Magda gasped, clutching my sides tightly as the beast easily maneuvered around carts, pedestrians, small herds of goats, and wandering chickens as it galloped through the narrow streets. The sights and sounds of the living filled my senses and my heart soared with pleasure. I could almost allow myself to believe I was in Turkey, though the sun will never scorch me here as it did in the homeland of my youth. The windows of the white washed buildings were flung open and the fragrance of cooking food and boiling laundry mixed with the stench of the streets. I found it exhilarating and I laughed.\n Magda ducked her head down between my shoulder blades. I felt her heart thudding with fear, but I could also hear her laughter when children shouted as we passed by where they played. Though we are minions of supernatural creatures, we are both human and to be free of the darkness filled us both with joy. I could hear it in her laugh, and I touched her hand lightly in camaraderie.\n Once out of the town, the horse increased its speed until we were just a flicker of color to the eyes of mortals. The cool wind tore at our faces and Magda’s scarf trailed behind her like wings. She recovered from her fear and pressed her chin against my shoulder so she could see our terrifying, yet thrilling journey along the narrow lanes of the countryside. As the horse pounded up the road into the mountains, she pointed to the high summits, amazed at their beauty.\n At last we reached the road that would lead us to the castle perched so precariously along the top of the mountains. In my previous journeys with the countess, I could not always see the home of Count Dracula. Depending on her mood, it was either completely hidden in darkness, or like a mirage, shimmering in and out of my sight. Today I could see it in all its ruined glory. It still retained its imposing stature despite the crumbling facade. It was only one of Vlad’s castles he had inhabited during his mortal years, but it was the one his Mistress had banished him to when he had fallen from her favor.\n “Is that it?” Magda gasped.\n “Yes.”\n The side of the road fell away to reveal the glorious greenery of the valley below with the Arges River sparkling in the sunlight. The castle loomed majestically before us as we neared the vast structure. Drawing up on the reins, my horse companion obeyed and slowed, trotting briskly across the courtyard to the far side of the castle. I felt a pang of sorrow when I considered that this was where the dear countess had lost her family and her mortality. \n","sourceLink":"https://allnovel.net/the-vengeance-of-the-vampire-bride-vampire-bride-2/page-11.html","bookId":2615,"book":{"id":2615,"title":"The Vengeance of the Vampire Bride (Vampire Bride #2)","description":"Storyline: \n The Vengeance of the Vampire Bride (Vampire Bride #2) \n In THE TALE OF THE VAMPIRE BRIDE, Lady Glynis suffered great horrors at the hands of her evil vampire master, Count Vlad Dracula, and vowed she would one day escape him. \n In THE VENGEANCE OF THE VAMPIRE BRIDE, Glynis learns to embrace the title of Countess Dracula as she sets into motion her plans to seek revenge on those who betrayed Glynis and her family to Dracula and to reunite with the man she loves. \n Despite her ambitions, it soon becomes quite apparent that her life continues to be overshadowed by the ominous presence of Vlad Dracula. \n Set in the 1820s against the lush gothic backdrop of Buda, Hungary, the tale of one vampire bride’s quest for love, revenge, and the right to determine her own way in life is a sweeping saga that will enthrall any reader who loves the beautiful, deadly vampires of old.\n \n","cover":"https://allnovel.net/images/the-vengeance-of-the-vampire-bride-vampire-bride-2.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-vengeance-of-the-vampire-bride-vampire-bride-2.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:46:07 PM"}}
