{"id":99882,"no":20,"title":"Page 20","content":"“Dark magic of the vampire blood, then. He bound you with his blood. He deliberately encompassed you in his power. Yet, while he was creating a stronger bond between you, he was also empowering you. Surprising, really. I have known him for a very long time and he usually is loath to share any of his power with his fledglings.” I made a soft sound of distress. “Apparently, he has treated me in a far different manner from the other Brides.” Adem lightly touched my hand to comfort me. “I can tell you what I have observed and learned from Astir. When a vampire creates another, it automatically has dominion over the other. They can beckon you, confine you to a certain area by will alone, cause you to feel pain, and so forth.” “Yes. I experienced all of those things,” I admitted. “Some vampires create other vampires for companionship. There is a bond of love between them. The Master vampire feeds its fledgling his or her blood, infusing it with power until it can become its own Master. They become equals. Of course, the former fledgling can leave or strike down their creator if they choose, and that does happen, but oftentimes it does not. From what I know of Vlad, he creates only female vampires and does not infuse them with his blood and power. He keeps them strictly under his authority and does not allow them to be anything more than his harem and minions.” I mulled over Adem’s words, seeing the truth in them. Vlad had kept the sisters inexorably under his influence. I had also been treated in the same manner, but that had changed on the journey to Buda. Vlad had begun to feed me his blood and toward the end, he often forced me to drink when he lay with me. “But you are different. He has given you a far greater gift than I would ever imagine he would. And, obviously, you must mean a great deal to him for him to have done such a thing.” I laughed bitterly. “It was when I struck him down and his blood poured out of the wound that he willed his power to me. He didn’t do it out of love. He did it out of spite. I understand that now.” I felt tears in my eyes and refused to spill them. “He forced his power upon me as one last attempt to ensnare me.” “That you hate him and love him at the same time speaks of the bond he has created between you.” Adem leaned forward, adjusting his sword so he could rest one elbow upon his knee. “You wear his ring. You have his title. He has made you love him by more than blood, has he not?” Our last night together came fresh to my mind. He had been unusually kind to me. He had treated me as his beloved wife. His words and touch had been a gentle balm to my anxious nerves. In our last nights together after we left Buda, he had been all I had craved and wanted him to be: my loving, faithful, compassionate, protective husband. I had felt utterly entwined with him and truly his wife. I had despaired at the bond between us, fearful that I had betrayed not only my dead family, but also Ignatius. “That bastard!” I clenched my hands at my side. Anger coursed through me as I realized how expertly he had manipulated my emotions to the very point that I thought I had chosen to be with him. I wanted to rush back to the castle and lop off his head. He had thoroughly deceived me. Our lovely night of lovemaking and peaceful repose had been the result of his cleverly crafted plan to ensnare me from Ignatius and firmly into his grasp. In retrospect, it was all too clear to see. My thoughts were a storm within my mind, battering against my skull, and giving me a wrenching headache. Adem chuckled as I stomped my foot. “Truly, my Countess, you are far more than I think even he could ever dare hope to contain. My dear Lord Astir told me of your boldness, strength, and cleverness. He was not amiss in his assessment of your nature.” I pointed an accusing finger at Adem. “Astir sent you to spy upon me and discover Vlad’s whereabouts. Astir told me all. I trusted you and it was all a deceit.” I was so angry at Vlad, I knew I was lashing out at Adem in proxy, but I did not care. I was wounded to the core of my being by Vlad’s manipulation and betrayal. “I was asked to come here to protect you, which I intend to continue to do to the very best of my ability. You are caught in a complex web of Vlad Dracula’s creation, yet you are joyfully your own person. I find that enthralling and I rejoice that I am protecting someone who truly deserves my devotion, and not a pretty simpleton.” Mollified by his words, I folded my arms over my bosom. “I dare say you are an odd man. You are very unlike any servant I have ever encountered.” “I am, like you, caught in a web. And I, like you, desire to be free of it one day. We are very much alike, you and I. That is most likely why Astir sent me to you.” “He is a duplicitous, terrible creature!” “Oh, yes, when he desires to be. He can also be your greatest ally. It is best to remember that.” I pondered his words and all that had come before and slowly a thought dawned on me. “He sent you to tell me of Vlad. He wanted you to expose Vlad’s cruel deception, didn’t he?” Adem tilted his head and gazed at me solemnly. “No. That was my choice. Your spirit, your spark, is appealing in one who is one of the undead. It is rare. I do not wish to see it lost.” Touched by his words, I could not find any to respond. “What you did to Vlad Dracula is terrible, yet I commend you. I hope you will truly find freedom when we reach Buda and you are far from him. I hope that your nightmares recede and you find what will truly bring youhappiness.” Leaning over, he took my hand and kissed it. “Now, close your eyes and sleep until the night comes.” As my fury seeped away, I did feel the need to rest. I slouched down, leaning my head against the velvet fabric of the seat. Adem carefully covered me with Astir’s coat, tucking it around me to hide my face and hands. “Sleep well, my Countess,” he said softly, then departed. I was asleep before the carriage door closed. Chapter 11 When I next woke, a cool evening breeze flowed through the carriage, sweeping away the stale air trapped during the hours of the day. The palest swath of pink and lavender over the tops of the mountains revealed the descent of the sun. The wind rustled through the leaves of the trees lining the road as an owl called out. Night had come again. I tossed Astir’s coat aside and noted he was not in the carriage. Katya was asleep again, curled on the seat across from me. As Magda finished opening the last window, she realized I had awakened and quickly moved to help adjust my bonnet and smooth my skirts. I am usually a tad surly when I awaken and the cramped confines of the carriage annoyed me. Glancing out the window as Magda fixed my curls, I noted our escort was missing from view. “Where are the guards? Where is Astir?” “I am uncertain. Lord Astir disappeared after we stopped to freshen the horses and have a bite to eat,” Magda replied. I snorted with frustration. “He is most likely in Buda while we are doomed to a long journey. If only I had his power we would have already arrived. I despise traveling.” Impulsively, I leaned out of the open carriage window to seek out Adem. With relief I saw that the guards were trailing behind on horseback. Adem caught sight of me and spurred his mount to match the pace of the carriage. His curls bounced against his broad shoulders as the horse drew alongside. “Where is Astir?” I demanded. “He will return shortly,” Adem answered in a tone that was slightly evasive. “Truly?” I said doubtfully. “When do we reach the inn?” “Soon, but there may be a dire situation developing. We believe we are being followed,” Adem explained. “By whom? Hunters?” I frowned at the thought. The last time I had been confronted by the vampire hunters I had been gravely wounded and forced from Buda. “Perhaps. I have Enre scouting behind us to determine if they are actually pursuing us and if so, who they are.” “Keep me informed,” I ordered, before sitting back in my seat and scowling. “As you wish,” Adem answered, pulling up on the reins to fall back. “Whoever they are, I am sure Adem can handle them,” Magda assured me. “He did well against the Brides of Dracula.” I felt a pang of guilt ripple through me. I had yet to release my vampire sisters from the castle and had no real desire to do so until I was further away. I was uncertain as to whether or not I could even properly wield the power that Vlad had bestowed upon me. That I was leaving them to starve as Vlad had done in the past gnawed upon my already frayed nerves. I was already quite bad tempered and increasingly hungry. Eyeing Katya, I pondered drinking from her, but reconsidered. It was important that I maintain some distance from the girl. I had acted impulsively when I had brought her along. I had been incensed when her father had bartered with her body and life like common goods. It was a bitter reminder of how my own family had sought to marry me off to a man of power and wealth. Perhaps I was doing her no favors by arranging for her to have shelter and employment in Astir’s haven, but I had pushed myself into a corner from which I did not know how to extract myself. As if sensing my attention, Katya opened her eyes to gaze upon me. Slowly, she tilted her head, offering.","sourceLink":"https://allnovel.net/the-vengeance-of-the-vampire-bride-vampire-bride-2/page-20.html","bookId":2615,"book":{"id":2615,"title":"The Vengeance of the Vampire Bride (Vampire Bride #2)","description":"Storyline: The Vengeance of the Vampire Bride (Vampire Bride #2) In THE TALE OF THE VAMPIRE BRIDE, Lady Glynis suffered great horrors at the hands of her evil vampire master, Count Vlad Dracula, and vowed she would one day escape him. In THE VENGEANCE OF THE VAMPIRE BRIDE, Glynis learns to embrace the title of Countess Dracula as she sets into motion her plans to seek revenge on those who betrayed Glynis and her family to Dracula and to reunite with the man she loves. Despite her ambitions, it soon becomes quite apparent that her life continues to be overshadowed by the ominous presence of Vlad Dracula. Set in the 1820s against the lush gothic backdrop of Buda, Hungary, the tale of one vampire bride’s quest for love, revenge, and the right to determine her own way in life is a sweeping saga that will enthrall any reader who loves the beautiful, deadly vampires of old.","cover":"https://allnovel.net/images/the-vengeance-of-the-vampire-bride-vampire-bride-2.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-vengeance-of-the-vampire-bride-vampire-bride-2.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:46:07 PM"}}
