{"id":94209,"no":24,"title":"Page 24","content":"\n He stood, inhaling sharply. It had been a mistake to stop at Fincharn. The lass had been injured, though. They\u0027d needed to rest. Jean too. Neither would\u0027ve been able to press on at the pace he\u0027d have liked.\n And now he was suffering his mistake.\n Their tracks were clear enough, scuffed along gorse and scrub, headed for a distant grove on the outskirts of Scrymgeour\u0027s land.\n MacColla jogged toward it. His claymore thumped against his back with each stride. Stirring him, spurring him.\n He\u0027d underestimated Campbell. Or rather, he\u0027d underestimated what Haley meant to the man.\n Who is she and what does she have to do with Clan Campbell? His own clan\u0027s sworn enemies.\n She clearly wasn\u0027t a spy. He thought of that handprint on her pillow. If blood had to be spilled in the taking of her…\n The thought drove him into a run.\n The lass was strange. Strong and beautiful, in the guileless way of a wild creature. He felt a spark of desire whenever he saw her now. A dead man would, to glimpse those mysterious gray eyes.\n He had to admit he\u0027d wanted her from the start. Even before MacColla had known they shared a common enemy.\n He reached the trees. Squatted again, then went to hands and knees looking for the traces that were harder to pinpoint in the dense undergrowth.\n Snapped branches. A spot where the carpet of leaves had been disturbed to reveal the damp, dark loam beneath.\n He stood, walked slowly, hands on his knees as he bent close to the ground and followed the tracks to a clearing.\n A pile of dirt and ashes were all that was left of a small fire. Leaning over, he traced his fingers through the cinders. Still warm.\n They hadn\u0027t been gone long.\n He circled the camp, saw scuffs where hooves had shuffled along the rotted leaves. Three sets. Her two captors had met up with another.\n Campbell? He could only hope. He yearned to fight the man. Longed for it.\n MacColla\u0027s father and brother had lost years of their lives in a Campbell dungeon. Countless of his MacDonald clansmen had lost their lives fighting Campbell men, and MacColla had dreamt of the day he could take his revenge .\n He found two more sets of tracks, human, and heading deeper into the trees. At one point in the trail, underbrush had been scuffed away, revealing a small patch of silt. And a single footprint.\n A small, bare foot.\n “Och, Haley lass,” he muttered, tracing his finger along its outline.\n MacColla stood and jogged again, as fast as he could while still marking the tracks. He came to a clearing, and the laugh rumbled low from his chest before he could think to keep silent.\n A Campbell man, lying in the brush . Dead or near to it.\n “Good girl,” he whispered, grinning his relief.\n She was a fighter.\n He\u0027d find her and fight with her. Two on two.\n MacColla liked the odds.\n Chapter Sixteen\n Shit. Shit shit shit.\n Haley cursed, and then let loose a chuckle, giddy with nerves and fear.\n She\u0027d crested the first hill and came to rest, concealed by a rocky outcropping on just the other side. Her chest was killing her. She was winded, and each heaving breath shot pain through her torso.\n She thought she\u0027d load her weapon, and wait. But she examined it now, turning it in her hands. Cursing again, she tilted it toward the sunlight. It was a pretty little pistol, made of a simple dark wood capped with steel accents that shone a dull gray in the morning\u0027s watery light.\n And of course it had to be unlike anything she\u0027d ever fired.\n It was a predecessor to the flintlock. She thought of Graham\u0027s gun from the museum and gave another muted laugh. Here was her theory. Right here in her hands.\n Not many flintlocks in the first half of the seventeenth century.\n How the hell, she wondered, do you fire this thing?\n She\u0027d shot plenty of black-powder weapons for her research, but she\u0027d never laid her hands on something like this.\n She was pretty sure it was an early snaphaunce.\n They were called dog lock pistols, referring to the catch that locked the cock into the safe position. As she recalled, it was a gun used by the English soldiers.\n Of course. The Campbells had sided with the Covenanters in the Wars of the Three Kingdoms. And the Covenanters often found themselves on the same side as Cromwell\u0027s\n Parliamentary soldiers. It made sense Campbell would have access to guns used by the redcoats.\n She retrieved a bullet from the leather pouch and saying a prayer she didn\u0027t blow her hand off, proceeded to load the weapon, carefully pouring in powder, dropping and tamping down the ball, then pouring a measure more powder in the pan.\n She leaned back, and the rock at her spine felt cool. She realized she\u0027d worked herself into a sweat. Shutting her eyes, Haley tuned her senses outward, listening for the Campbell clansman she knew would find her.\n Campbell put his hand to his forehead, shielding his eyes from the sun. “There.” He pointed to the steepest area of the slope. A narrow stripe of dark gray spoke to scree recently displaced.\n His man had been searching for tracks along the low valleys between hills, but Campbell had suspected otherwise. If the woman was canny enough to smash in the head of one of his best men, she\u0027d not scramble hysterically into a trap.\n With them on horseback, staying to the lower elevations would corner her as easily as a hare in a hole.\n “Do we ride up then?”\n Campbell sneered. “Neither of us is riding up that.”\n He puckered his lips in thought. Studied the terrain to either side, then up along the mountain.\n “Off your horse,” he commanded. “I\u0027ll cut her off low on the other side. You race and catch her above.” He wheeled his mount around. “And one more thing, lad?”\n “Aye, sir?”\n “If you don\u0027t catch her” - Campbell gathered his reins in tight fists, the stout pony prancing anxiously beneath him “don\u0027t bother coming back.”\n Campbell kicked his horse, galloping into the valley and toward his Inveraray Castle beyond.\n He tracked the horses to the base of one of the steeper slopes. He studied the rise. The gravelly hillside told a clear story. One man hiked up and another rode off.\n MacColla raised his hands to the grip of his sword and leaned his head back to stare up into the glare.\n Her tracks were there too , in the scree, a thick line edged by two thinner ones. Her hands and feet scuffling up the hillside. Chased.\n Hissing a curse, his eyes scanned the foot of the slope, following the tracks where they headed into the valley. They were fresh. The ponies had left a trail that was easy to read, cutting a wake of broken branches and trampled leaves in the gorse and brush.\n Campbell. Campbell wouldn\u0027t have climbed a mountain -not when he had a man to do it for him. It was Campbell who would\u0027ve ridden off, riderless mounts beside him. Campbell who now headed in the direction of Inveraray Castle.\n “By crivens,” he muttered. MacColla deliberated for a moment. Looked back up the hill and down again to the valley. “Damn it and damn it to hell.”\n Campbell was close. Too close to ignore. And alone. That was what clinched it. MacColla could blindfold himself, tie both hands behind his back, and still he\u0027d best Campbell in a fight.\n Campbell was close, and he had to get him.\n MacColla turned, looked back up the hill, staring up at those tracks as he began to jog backward toward the valley.\n Away from Haley. He tried to ignore the sharp twinge in his chest.\n Haley, He had to hope she\u0027d be all right. She was a fighter.\n Braw, but canny too, using her brains and her strength.\n “Good Christ, lass.” he whispered. MacColla turned his back to her trail and took off after the Campbell. “Be safe.”\n He broke into a hard run, willing his physical exertion to push images of her from his mind. But those gray eyes haunted him, and he ran harder.\n He would catch the Campbell and kill him.\n He could come back for Haley.\n He was too close to stop now.\n And then he heard it. A shot cracked high above. Trees grew scant in the hills, and there was nothing to stop the sound of gunfire from echoing down to where he\u0027d stopped, panting, deep in the valley.\n And this time MacColla\u0027s decision was an easy one.\n Her eyes shot open. There it was. A distant snapping of a branch underfoot.\n Haley rose, tried to force calm into her trembling hands. She studied the gun. She\u0027d shot before. But never with intent to kill.\n The tang of black powder clung in her sinuses. She held the pistol in front of her, testing its weight in her hands. How much would it kick back? Would it aim truly?\n She thought of James Graham\u0027s combination weapon, able to serve as a blade if the gun failed to fire. Haley quickly wiped the palm of her right hand on her dress, then brought it back to the butt. She feared her own gun might be better suited as a bludgeon than as a straight-shooting weapon.\n Stepping out from behind the rock, she assumed her stance.\n Another snap.\n Here he comes.\n She knew at once: There was no fooling this one. Haley saw his dirty-blond hair first, then the shoulders of his brown coat. He crested the rise and his eyes seemed already to be pinned on her.\n The man saw the gun in her hands, and it was his laugh that stilled her trembling hands.\n “Bastard,” she whispered. And shot.\n He recoiled, fell, and his grunt of pain was swallowed by the wide -open sky.\n Exhilaration thrummed through her. But then he rose to his knees, slowly wavered to his feet, and her elation flipped into panic.\n They locked eyes again and the fury twisting his face chilled her. Haley quickly ran through her options.\n Could she fight him? He was injured. A hole was torn in his left shoulder, blood already staining his coat black. His left arm was useless, clenched frozen at his side.\n Or she could run. Her eyes skittered behind her to the hillside below. There was no place to hide.\n If his injury weren\u0027t that grave, he could catch her. Or Campbell eventually would. And then there would be two against her one.\n She had to fight. He had his own pistol, but he\u0027d never be able to load it one -handed.\n Haley\u0027s eyes went to his sword. A simple broadsword, hanging at his hip. He\u0027d only need his one hand to wield it. If he were right- handed, and she had to assume he was, he could kill her in one easy stroke. \n","sourceLink":"https://allnovel.net/warrior-of-the-highlands-highlands-3/page-24.html","bookId":1617,"book":{"id":1617,"title":"Warrior of the Highlands (Highlands #3)","description":"Storyline: \n Warrior of the Highlands (Highlands #3) \n While doing research for her dissertation, graduate student Haley Fitzpatrick stumbles upon a strange artifact—which sends her back in time to old Scotland, directly into the path of the notorious Alasdair MacColla, a warrior known for his enormous physical presence and bloodthirsty reputation. \n Assuming that this woman with the mysterious accent is an enemy spy, MacColla promptly kidnaps her. But Haley’s beauty and courage strike a chord in the Highlander, awakening a desire in him that he hadn\u0027t known existed. \n At first Haley’s frightened by her imposing captor. But she soon discovers that MacColla is much more than the brute that modern history describes, and decides she’s meant to be by his side. But unless she can find a way to change the past, the warrior she’s fallen for is destined to meet a tragic end…\n \n","cover":"https://allnovel.net/images/warrior-of-the-highlands-highlands-3.jpg","author":"Veronica Wolff","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/warrior-of-the-highlands-highlands-3.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:05:50 PM"}}
