{"id":94232,"no":47,"title":"Page 47","content":"\\n\\n Distant movement caught his eye. Four Parliamentary cavalrymen emerged, not far from where she\u0027d taken cover.\\n\\n Four men, he thought distantly, hoping there wasn\u0027t some other force at work that had already set destiny\u0027s top to spinning. She\u0027d said five.\\n\\n The men posed their challenge. MacColla knew: If this same scenario presented itself for him to live and relive in some mad eternity, he\u0027d always ever make the same choice. And he slashed and spun, cutting the horsemen one by one.\\n\\n He heard the click of the cocking pistol at his back. Pistol.\\n\\n Not musket.\\n\\n “If you\u0027d be so kind as to hand over your blade.”\\n\\n MacColla stilled. He knew the man who was left standing. He\u0027d sized him up at once. Standard-issue honor, with boots shined and brass polished. This particular soldier didn\u0027t frighten him.\\n\\n It was the mysterious fifth man who made MacColla wary, the one he predicted would appear from behind.\\n\\n “\u0027Twill be a tale for my children\u0027s children to tell,” the soldier crowed. “How their Grandfather O\u0027Grady offered the great MacColla quarter.” He paused and released his prisoner\u0027s arm. Reaching to the scabbard at MacColla\u0027s back, the man issued a stern rebuke, “I asked for your blade, man.”\\n\\n MacColla heard a rustle, and knew.\\n\\n “I\u0027ll avail myself of your prisoner, O\u0027Grady.” a voice said.\\n\\n There\u0027s the bastard.\\n\\n He needed to act fast. Though Haley couldn\u0027t tell him how much time he\u0027d have, she\u0027d described this scenario, these men in these very poses, and he reckoned it best not to tease the situation out too long.\\n\\n O\u0027Grady seemed a decent enough sort. He\u0027d offered MacColla quarter, and MacColla felt compelled to do the same.\\n\\n “Sorry, lad,” he muttered. Seizing his captor\u0027s hand where it reached for the hilt at MacColla\u0027s back, he elbowed the soldier hard in the gut. “You\u0027ve been an honorable enemy.” O\u0027Grady doubled over, and MacColla followed with a swift blow to the back of his head, knocking him out cold.\\n\\n He spun, his claymore extended, to face his would -be killer.\\n\\n The man was disappointingly ordinary, with an unremarkable face, riding an unremarkable horse.\\n\\n The musket in his grip gave pause enough, though, and MacColla watched as his hand twitched supporting the long barrel.\\n\\n Shaking his head, the man smiled slowly, and slid a hand to cock his weapon.\\n\\n A loud shot cracked behind him, and MacColla flinched despite himself, so ready was he to face this man\u0027s bullet.\\n\\n Haley. The lass must\u0027ve emerged from her hideout. And though her shot went wide, it was enough to spook the man\u0027s horse.\\n\\n The beast reared just as the man fired, and his bullet skewed high off the mark.\\n\\n Cursing, the man scanned the land behind MacColla, reaching to the powder flask at his belt. Thinking better of it, he threw his musket to the ground, jumped from the skittish horse, and stalked to MacColla.\\n\\n Who stood still as granite, waiting.\\n\\n “I\u0027d know the name of the man who\u0027d shoot me in the back,” MacColla snarled.\\n\\n “Purdon,” he replied cavalierly, unsheathing the sword from his side. The two men began to circle each other. “Major Nicholas Purdon.”\\n\\n He carried a cavalry saber. A strange, foreign thing, likely brought back from the warring on the Continent. Though an elegant weapon, the ridged steel was no less sturdy for its slight curve.\\n\\n Still, MacColla taunted, “That\u0027s a pretty wee sword you have there, Purdon.” He stretched his claymore out further and grinned at the sound of his joints popping. “Shall I slice your belly or take your head, do you think?”\\n\\n “Such coarseness. You surprise me, Alexander MacDonald.” Purdon tilted his head in mock contemplation. “Head or belly? You offer me two evils and no choice.”\\n\\n “You\u0027ll call me by my Scottish name,” he growled. He repeated Purdon\u0027s words in the Gaelic and smiled. “Da dhiù gun aon roghainn.” MacColla took two broad and confident strides toward him. “Two evils, no choice indeed. And so I\u0027ll do the choosing for you.”\\n\\n He swung his claymore down, the thick steel slamming onto Purdon\u0027s saber with a resonant clang.\\n\\n Curved cavalry blades weren\u0027t made for thrusting, and Purdon slashed and slashed again, his strikes no match for\\n\\n MacColla.\\n\\n “Head, I think,” MacColla said calmly, slashing his own blade down hard. The claymore\u0027s power was in its swing, and MacColla went at the man mercilessly. Down at his head, up from his legs, down at his head . Each strike was met with a block from his opponent, forced to support his blade with two hands to withstand MacColla\u0027s onslaught.\\n\\n A sideswipe at Purdon\u0027s belly nicked flesh, and Purdon gasped. Stumbled back.\\n\\n MacColla went at him with renewed force, luring him into a diagonal rhythm. Slashing up and down at angles. Up and down.\\n\\n Until with a final grunt. MacColla changed his pattern, swiping a sudden and final strike from the side, severing Purdon\u0027s head from his body.\\n\\n “May you rot, bastard,” he said, using Purdon\u0027s coat to wipe the blood from his blade.\\n\\n Haley caught up to him not long after the Parliamentary soldier fell. She was frantic, but that didn\u0027t prevent MacColla from swooping her up in an elated kiss.\\n\\n “We did it, leannan.”\\n\\n “You did it,” she said, smiling and panting. She scanned the valley nervously. “But now we have to get out of here.\\n\\n Rollo should be coming along soon… ” she muttered, then decided, “but I don\u0027t think we can wait.”\\n\\n She\u0027d watched the familiar scenario play out, with a blessedly different ending. And she\u0027d held her breath all the while. “There could be any number of other men approaching. It\u0027s anyone\u0027s guess what could happen next.”\\n\\n “Aye. I\u0027m of the same mind.” He gave a firm nod. Cupping her chin, he gave her one last, long look. “I\u0027ve no care for my own self, but I\u0027d have your pretty hide up and away from this place.”\\n\\n He turned at once to coo and beckon to Purdon\u0027s horse, trying to gather the skittish mare.\\n\\n “Wait,” she said suddenly. She stopped short, looking at the dead man\u0027s head with disgust. “I have an idea.”\\n\\n “But I\u0027m a fair spot taller than this lout was.” MacColla circled round Purdon\u0027s dead body, eyeing him with disdain.\\n\\n “Yeah, well… ” Haley shrugged. “He\u0027s even shorter now.”\\n\\n MacColla\u0027s laugh boomed, and s he flinched, automatically shifting her gaze to survey the horizon. She spared him an edgy smile, but was anxious to get out of there. They\u0027d already lost too many minutes while she tried to convince him of her plan.\\n\\n “Seriously, MacColla.” She extended he r hand, gesturing once more that he hand over his claymore. “People see what they want to see. If everyone thinks you\u0027re dead, it\u0027ll give us options.”\\n\\n “Options?” He scowled. “Well, lass, I opt not to leave my sword.”\\n\\n “We\u0027ll get you a new one. We can\u0027t stage your death without leaving that particular sword behind” she said, pointing emphatically to the claymore in his hand. The ring at the base of the pommel and its simple, unadorned design had a whiff of Irish to it. But the sheer size pinpointed MacColla as its owner.\\n\\n “I want Campbell\u0027s neck in my hands,” he groused, flexing his fingers. “Not options.”\\n\\n “You can\u0027t chase Campbell,” she said flatly. “Don\u0027t you see? You\u0027re supposed to be dead. We can\u0027t change the course of history.”\\n\\n “And why not?” He shrugged. “We just did, aye?”\\n\\n “Well, for one thing… ” Haley thought about it. For one thing, you could get yourself killed again.\\n\\n “I\u0027m Irish,” she said suddenly. “What if something we do impacts my family line?” She flashed to all the sci-fi movie cliches of people blipping out of existence. “I\u0027d never be born.”\\n\\n That gave him pause. He opened his mouth to speak, then promptly shut it again.\\n\\n Haley hated not giving him a choice. She knew what it meant to him to conquer Campbell. She also knew he\u0027d not be able to sit still for long, and this would only be the first time they\u0027d have this argument.\\n\\n She had another idea. Brightening, she said, “Listen, you can still battle the Campbell.”\\n\\n He looked at her, interest piqued.\\n\\n “Your actions will be so much more devastating if Campbell thinks you\u0027re dead.”\\n\\n “What are you saying?”\\n\\n She gestured again for his sword, and he finally relinquished it.\\n\\n “I\u0027m saying an anonymous enemy is the most dangerous one.” Haley knelt to wrap Purdon\u0027s hand around the hilt of MacColla\u0027s claymore, but froze, grimacing.\\n\\n He gently shifted her aside to finish the work for her. “You\u0027ll want to turn around, lass. If I plant my sword” - he began to strip the man of his uniformboots and breeches - “I\u0027ll need to plant my plaid as well.”\\n\\n Turning, she continued enthusiastically. “Think how easily, and how deeply, you could penetrate Campbell lands. The great MacColla is dead. What have they to fear?”\\n\\n She looked over her shoulder, assessing him. “You\u0027d need to be disguised though. You\u0027re too recognizable. Too great a hero.”\\n\\n “Och, leannan.” he grumbled playfully, tying his enormous shirt between his legs.\\n\\n He squeezed her bottom as he swung her up onto Purdon\u0027s horse. “Now you\u0027re just trying to flatter me.”\\n\\n Chapter Thirty-Five\\n\\n Stirling, Scotland, one year later\\n\\n “A dark knight, you say?” MacColla chafed under the armor. Haley insisted he wear it, though he had no idea how any man could move and fight freely in such a contraption.\\n\\n “Yeah, sort of like a Gaelic Bruce Wayne.”\\n\\n “Bruce… ?”\\n\\n “Nevermind,” she said, and wriggled his steel helmet into place. “Hey, at least I didn\u0027t make you get a visor.”\\n\\n “Armor is for cowards, leannan.” He pulled the helmet back off, raking his fingers through his hair. He despised the hot, constrained feel of the thing. “Can\u0027t I just grow a beard?” \\n\\n","sourceLink":"https://allnovel.net/warrior-of-the-highlands-highlands-3/page-47.html","bookId":1617,"book":{"id":1617,"title":"Warrior of the Highlands (Highlands #3)","description":"Storyline: Warrior of the Highlands (Highlands #3) \\n While doing research for her dissertation, graduate student Haley Fitzpatrick stumbles upon a strange artifact—which sends her back in time to old Scotland, directly into the path of the notorious Alasdair MacColla, a warrior known for his enormous physical presence and bloodthirsty reputation. \\n Assuming that this woman with the mysterious accent is an enemy spy, MacColla promptly kidnaps her. But Haley’s beauty and courage strike a chord in the Highlander, awakening a desire in him that he hadn\u0027t known existed. \\n At first Haley’s frightened by her imposing captor. But she soon discovers that MacColla is much more than the brute that modern history describes, and decides she’s meant to be by his side. But unless she can find a way to change the past, the warrior she’s fallen for is destined to meet a tragic end…\\n","cover":"https://allnovel.net/images/warrior-of-the-highlands-highlands-3.jpg","author":"Veronica Wolff","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/warrior-of-the-highlands-highlands-3.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:05:50 PM"}}
