{"id":87794,"no":31,"title":"Page 31","content":"\\n\\n When He rose, His height was equal to Nathan’s, but Nathan knew the stature of the Being before him had no ceiling. His form was merely convenient. He could not find the strength to rise to his feet before Him. There was no room for rational thought and therefore no room for deception. There was only emotion, pure raw. All that seemed to matter now was how badly he’d fucked up everything and how much he missed Dona.\\n\\n Needed her, even though he didn’t deserve even to have a memory of her.\\n\\n “We…belong together.” Saying the words was a comfort. It was the only response he had the strength to manage.\\n\\n “Since the beginning of time.” Lucifer nodded, considering him. Nathan felt the terrible power in that look, underscored by the disturbing keening still rising up from the flames, more muted now. “But the time has to be right. You’ve found your soul again, with her help. But it doesn’t absolve the crime. It does not pay your karmic debt.\\n\\n You haven’t been fully redeemed, now have you?”\\n\\n It flitted through him again, what he’d felt in her arms, joined with her. The shadows that represented the rage and darkness of his soul. The guilt at the things he’d done. The inability to forgive.\\n\\n “That’s not Dona’s failing, though she’ll think it is. If I returned you to Purgatory in a new body, you’re likely to let the same fears guide your actions. If you met her in mortal life, you could destroy her as you have destroyed others.” But I need her now…\\n\\n It was what his soul cried out, the soul that had begged for his mother.\\n\\n What’s behind the mirror?\\n\\n No Dona now. Nothing but himself to answer the question. So what was the answer?\\n\\n On his knees before what he knew was the Power behind everything, it was all as clear and simple as a mirror, ironically. The final true reflection was undeniable, like the feel of rain pounding on his skin. Dona had broken him down, broken him open. With this Being’s power pouring into those raw wounds, truth came bubbling up like pus out of an infection. It was pathetic, a cliché. It wasn’t that he hadn’t always known it. It was the difference between hearing and knowing.\\n\\n He knew what Dona’s husband had thrown away, because he’d thrown it away a dozen times. But for the first time he felt the actual weight of all the things he’d been offered and spurned. A weight that had grown so gradually over time he hadn’t realized everything he thought he was had been disintegrating beneath the tonnage, damaged beyond even Dona’s ability to repair.\\n\\n In the depths of his heart, he still believed women were evil. They had a power in them to make a man love them so much, but they would turn on him, use his love against him. Every time Dona had given him some slack, it had reared its head in him again, the need to teach them how it felt, his own brand of karmic justice. Rejecting every woman just as she gave him her love. Always wishing he could find his mother, do it to her. As if the vicious bitch had love to give. He would have done anything to keep her love. To not be abandoned to the demonic creatures that had masqueraded as his foster mothers.\\n\\n He closed his eyes, bowed his head.\\n\\n Look in the mirror. Look behind your mother and what do you see? What do you see, Nathan?\\n\\n As an unloved and unwanted child, he’d started spinning those mirrors early. Now he was a man unworthy of a woman’s love, a creation of his own making, full of anger and bitterness that he’d coated in charm and deception. All he wanted was for one woman to prove him wrong. To tear away all his weapons and shields, beat him to his knees before her, prove to him that he had no need of weapons or shields. Not with her.\\n\\n But she had done it, hadn’t she? Dona had done it. She could force him to trust, because he couldn’t make the choice himself.\\n\\n “Life has to be about that choice, or it isn’t earned.” A new energy, like the Lord before him, but different. Different and yet together.\\n\\n He’d felt hints of both of Them in Dona’s light. In that one touch, that one soft sentence, he crumbled to the rock, weeping. For now he felt a Mother’s love, felt it as it was meant to be. Unconditional. Forgiving, even while administering justice. Always there.\\n\\n Never to be doubted. He’d never needed to doubt Her. She was Dona and every woman who’d let Light into their souls to love a man with all they had. All he’d ever wanted was to love a woman unconditionally, freely, and receive this gift in return. So that he’d never know loneliness and abandonment again.\\n\\n “I’m sorry. I’m so sorry.”\\n\\n “I know.” Her touch along his body was warm and simple, like a blanket. “You have to find the courage to make the choice. You belong together. She needs you, maybe even more than you need her.”\\n\\n He didn’t have that kind of courage. He knew he didn’t. Like a man with a terminal disease, only of the mind instead of the body, he knew where he would fail.\\n\\n If he destroyed Dona, he knew without being told he’d damn himself forever. There were things that were beyond unforgivable. Meaning unfixable, and destroying one half of yourself, the best half, would certainly fall in that category.\\n\\n “Find the quiet place in yourself, the center. Let down all your shields and simply be. Accept what is. To pay for your transgressions, you have to be willing to accept that payment will be made. You have to forgive yourself.” He thought of the tree where he’d hidden his treasures, thought of laying down a carpet of soft pine needles for Dona there. Her fingers would caress his head, his ears and jaw, pressing him down between her legs to make him service her. The trees above would be layers of blues and green like Eden, the peace of nature all around. With the passion he’d bring the peace. Part of him acting as a lover, suckling her cunt, the other part of him like a son worshipping at the Mother’s womb, both aspects bringing fulfillment.\\n\\n The fire-like glow and the feel of the cold stone returned. He was there with just Lucifer, the Lady’s presence like a lullaby fading as he woke from sleep. Nathan pushed himself to his hands and knees, breathing deeply, hearing a silence in himself he’d never heard. A place of quiet, terrible truth.\\n\\n “I have to go to Hell, don’t I?”\\n\\n “I think so, yes.” Lucifer answered him. “But that is your choice. You have performed well enough in Redemption to earn the right to another body.” A body with a soul still infected with enough corruption that he could simply end up here again. He could feel the darkness in him, confused but waiting to reorganize as soon as doubt, guilt and rage crept in.\\n\\n “The time in Hell will be bad. You will pay through direct punishment for all that you’ve done to others. It will be far more than the pain you’ve suffered thus far. There is much of Jonathan in you still, so getting rid of his influence will not be pleasant. It will be agony.”\\n\\n Despair and pain knocked him back to the cold stone. It was every bad, anxious feeling he’d ever had magnified a thousand times, fears and terrors of the night he couldn’t even imagine crowding in on him. He thrashed, struck out. Abruptly he was back on the cold stone, huddled in a fetal ball, sick to his stomach but unable to retch.\\n\\n Lucifer regarded him with a dispassionate eye. “That was barely a tenth of what you will feel and I gave it to you for a blink of time. Do you still wish to undertake this course?”\\n\\n Nathan managed to respond, his voice hoarse. “If I go to Hell, will she be safe from me?”\\n\\n “Safer than if you don’t.”\\n\\n He had his answer. She needs you.\\n\\n “How long in Hell…” Nathan forced his lips to ask the question.\\n\\n “As long as I deem necessary. You won’t know how long. Only when it begins and when it is over.”\\n\\n “When it’s over…Dona? How long…?”\\n\\n For the first time, Lucifer hesitated. “The soul has no memory of its mate after Hell.\\n\\n Not at first. You won’t remember her. Not for a long time.” It was an effort like lifting the weight of the world, but he put one foot back beneath him, then the other. Stood up. “We’ll still be soul mates?”\\n\\n “It may be many lives before you recognize her as such. But, yes.”\\n\\n Surely time could be folded here, a thousand years to one minute on Earth. Science fiction couldn’t be that far off from the truth.\\n\\n As Lucifer considered him, Nathan knew that the Being wasn’t likely to respond well to such a persuasion. He thought hard, aching, needing her now. “May I keep her marks?” He directed his gaze to his piercings. “Can I have the compulsion to put them on myself when I’m older? To help me remember her?”\\n\\n “It will not help.”\\n\\n “So what’s the harm?”\\n\\n He felt a blast of heat and sulfur that made his knees tremble. He locked them, tried to at least stay steady even if he couldn’t meet the powerful Being’s gaze.\\n\\n “You’re as stubborn as she is.” Lucifer snorted. “Fine.” Pain could clarify as well as heal. Didn’t a submissive know that better than anyone? Nathan tried to focus on what he knew instead of the fear, the realization he was about to do something which was far over his head, the knowledge of it reflected in those powerful eyes. What was important was what would best serve his Mistress.\\n\\n Bring him to her side more quickly. She needed him. The Lady had said so.\\n\\n “So I’m guaranteed nothing.” He said it without censure.\\n\\n “Nothing, except the path itself.” There was a hint of sympathy in Lucifer’s voice.\\n\\n “That the journey continues until it’s done.”\\n\\n “I’ll know her.” Nathan remembered that kiss, held it to him like his own beating heart. “She knows me. She looks at me and doesn’t see a mirror. She sees me.” She sees who I’ve been, who I am.\\n\\n More than that, more than the punishment or anything else, there was one thing that made him sure that he’d remember her.\\n\\n She had faith in him, in who he could be. No one, not even himself, had ever given him that before. Since his brave, beautiful Mistress had never intended to have faith in a man again, that meant there had to be something worth loving in him. Had to be. \\n\\n","sourceLink":"https://allnovel.net/mistress-of-redemption-nature-of-desire-5/page-31.html","bookId":1910,"book":{"id":1910,"title":"Mistress of Redemption (Nature of Desire #5)","description":"Storyline: Mistress of Redemption (Nature of Desire #5) \\n The white-collar life Jonathan Powell created for himself is gone. Standing outside Wentworth prison after serving his five-year sentence, he knows he has to start over. No more hooking up with Dominant women so he can enjoy the challenge of screwing up their minds. But who knew his last target would be a psychopathic killer who tried to off two cops? No, it wasn\u0027t the game that was the problem. He just made some key mistakes. Mistakes he won\u0027t make again. \\n Then Mistress Dona shows up to give him a ride from the prison into his new life, and his resolve goes out the window. She\u0027s everything he can\u0027t resist. Dona knows she has to help Jonathan make the right choice this time, because Hell doesn\u0027t offer options. He has to understand and accept what surrender truly means. His only hope is a Mistress of Redemption. The problem is she may lose her own soul in the attempt to save his.\\n","cover":"https://allnovel.net/images/mistress-of-redemption-nature-of-desire-5.jpg","author":"Joey W. Hill","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/mistress-of-redemption-nature-of-desire-5.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:23:41 PM"}}
