{"id":19847,"no":12,"title":"Chapter 12: The Sad Side Of War.","content":"Before firing the keg of powder, Rupert and Hugh had rid themselves of their jackboots, coats, and vests, and they therefore swam easily and confidently. \"Listen, Hugh! Here is the boat coming back again,\" Rupert exclaimed. \"This thick mist is fortunate, for they can\u0027t see twenty yards. We can always dive when they come near. Mind you go down without making a splash. We are all right at present; the boat is going to our right, let us swim quietly in the other direction.\" Presently they heard a voice in English say, \"It is no use our troubling ourselves. It\u0027s a mere waste of time. The young rascals are dead. Drowned or blown up, what matters it? They will never trouble you again.\" \"You don\u0027t know the villains as well as I do. They have as many lives as cats. I could have sworn that they were burned at that mill, for I watched till it fell, and not a soul came out; and to this moment I don\u0027t know how they escaped, unless they flew away in the smoke. Then I thought at any rate the chief rogue was done for, when Muller wrote to tell me he was going to finish him for me the next day. Then they both got through that day\u0027s fighting by the Scheldt, though I hear they were in the front of it. And now, when I leave them fastened up like puppies in a basket, in a sinking boat, comes this explosion, and all is uncertain again.\" \"Not a bit of it,\" the other voice said; \"they simply preferred a sudden death to a slow one. The matter is simple enough.\" \"I wish I could think so,\" the other said. \"But I tell you, after this night\u0027s work I shall never feel my life\u0027s safe for one hour, till I hear certain news of their death. \"Stop rowing,\" he said, in Dutch. \"There is a bit of a plank; we must be just on the place where she blew up! Listen, does anyone hear anything?\" There was a long silence, and then he said, \"Row about for half an hour. It\u0027s as dark as a wolf\u0027s mouth, but we may come upon them.\" In the meantime, the two lads were swimming steadily and quietly away. Presently Hugh said, \"I must get rid of my sword, Master Rupert, it seems pulling me down. I don\u0027t like to lose it, for it was my grandfather\u0027s.\" \"You had better lose the grandfather\u0027s sword, Hugh, than the grandson\u0027s life. Loose your belt, Hugh, and let it go. Mine is no weight in comparison. I\u0027ll stick to it as long as I can, for it may be useful; but if needs be, it must follow yours.\" \"Which way do you think the shore lies?\" Hugh asked, after having, with a sigh of regret, loosed his sword belt and let it go. \"I have no idea, Hugh. It\u0027s no use swimming now, for with nothing to fix our eyes on, we may be going round in a circle. All we need do is to keep ourselves afloat till the mist clears up, or daylight comes.\" For an hour they drifted quietly. Hugh exclaimed, \"I hear a voice.\" \"So do I, Hugh. It may be on shore, it may be in a boat. Let us make for it in either case.\" In five minutes they saw close ahead of them a large boat, which, with its sail hanging idly by the mast, was drifting downstream. Two boatmen were sitting by the tiller, smoking their pipes. \"Heave us a rope,\" Hugh said in Dutch. \"We have had an upset, and shall be glad to be out of this.\" The boatmen gave a cry of surprise, but at once leapt to their feet, and would have thrown a rope, but by this time the lads were alongside, and leaning over they helped them into the boat. Then they looked with astonishment at their suddenly arrived guests. \"We are English soldiers,\" Hugh said, \"on our way to Bergen op Zoom, when by some carelessness a keg of powder blew up, our boat went to the bottom, and we have been swimming for it for the last couple of hours.\" \"Are you the English officer and soldier who left Dort this afternoon?\" one of the men said. \"We saw you come down to the quay with Mynheer Von Duyk and his daughter. Our boat lay next to the boat you went by.\" \"That is so,\" Hugh said. \"Are you going to Bergen? We have enough dollars left to pay our passage.\" \"You would be welcome in any case,\" the boatman said. \"Hans Petersen is not a man to bargain with shipwrecked men. But go below. There is a fire there. I will lend you some dry clothes, and a glass of hot schnapps will warm your blood again.\" Arrived at Bergen, one of the boatmen, at Rupert\u0027s request, went up into the town, and returned with a merchant of ready-made clothes, followed by his servant bearing a selection of garments such as Rupert had said that they would require, and in another half hour, after a handsome present to the boatmen, Rupert and Hugh landed, dressed in the costume of a Dutch gentleman and burgher respectively. Their first visit was to an armourer\u0027s shop, where Hugh was provided with a sword, in point of temper and make fully equal to that with which he had so reluctantly parted. Then, hiring horses, they journeyed by easy stages to Huy, a town on the Meuse, six leagues above Liege, which Marlborough, again forbidden by the Dutch deputies to give battle when he had every prospect of a great victory, was besieging. The capture of the fortress, and subsequently of Limberg, was all the campaign of 1703 effected; whereas, had the English commander been allowed to have his way, the great results which were not obtained until after three years\u0027 further fighting might at once have been gained. Rupert was greeted with enthusiasm by his comrades on his return. After the battle before Antwerp the duke had caused inquiries to be made as to the fate of his young friend, and had written to Dort, and had received an answer from Rupert announcing his convalescence and speedy return to duty. Upon hearing his tale of the fresh attempt upon his life by Sir Richard Fulke, the commander-in-chief wrote to the States General, as the government of Holland was called, and requested that orders should be issued for the arrest of Sir Richard Fulke, wherever he might be found, upon a charge of attempt at murder. Nothing was, however, heard of him, and it was supposed that he had either returned to England or passed into Germany. After the capture of Limberg the army went into winter quarters, and the 5th dragoons were allotted their old quarters near Liege. During the campaign of 1703, although slight advantages had been gained by the allies in Flanders, it was otherwise in Germany and Italy, where the greatest efforts of the French had been made. Beyond the Rhine the French and Bavarians had carried all before them, and Villars, who commanded their armies here, had almost effected a junction across the Alps with Vendome, who commanded the French troops in Italy. Had success crowned their efforts, the armies could have been passed at will to either one side or the other of the Alps, and could have thrown themselves with overwhelming force either upon Austria, or upon Prince Eugene, who commanded the imperial troops in Italy. The mountaineers of the Tyrol, however, flew to arms, and held their passes with such extreme bravery that neither the Bavarians on the north, nor the French on the south, could make any progress, and the design had for a time been abandoned. Austria was paralyzed by the formidable insurrection of Hungary, and it appeared certain that Vienna would in the ensuing campaign fall into the hands of the French. During the Winter Marlborough laboured earnestly to prepare for the important campaign which must take place in the spring, and after the usual amount of difficulties, arising from private and political enemies at home and in Holland, he succeeded in carrying out his plan, and in arranging that the Dutch should hold their frontier line alone, and that he should carry the rest of his army into Germany. The position there seemed well-nigh desperate. Marshal Tallard, with 45,000 men, was posted on the Upper Rhine, in readiness to advance through the Black Forest and join the advanced force and the Bavarians--who also numbered 45,000 men, and the united army was to advance upon Vienna, which, so weakened was the empire, was defended only by an army of 20,000 men, placed on the frontier. On the 8th of May, Marlborough set out with his army, crossed the Meuse at Maestricht, and arrived at Bonn on the 28th of that month. Marching up the Rhine, he crossed it at Coblentz on the 26th, and pushed on to Mundlesheim, where he met Prince Eugene, who now commanded the allied force there. Next only to Marlborough himself, Eugene was the greatest general of the age--skillful, dashing yet prudent, brave to a fault--for a general can be too brave--frank, sincere, and incapable of petty jealousy. Between him and Marlborough, from the date of their first meeting, the most cordial friendship, and the most loyal cooperation prevailed. Each was always anxious to give the other credit, and thought more of each other\u0027s glory than their own. So rapidly had Marlborough marched, that only his cavalry had come up; and Prince Eugene, reviewing them, remarked that they were the finest body of men he had ever seen. A few days later the Prince of Baden came down from the Austrian army of the Danube to meet him. Eugene and Marlborough wished the prince to take the command of the army of the Rhine, leaving the army of the Danube to their joint command. The prince, however, stood upon his rank; and it was finally arranged that Eugene should command the army of the Rhine, and that Marlborough and the Prince of Baden should command the army of the Danube on alternate days--an arrangement so objectionable that it is surprising it did not terminate in disaster. Marlborough at once marched with his force, and making his way with great difficulty through the long and narrow defile of Gieslingen, effected a junction with the Prince of Baden\u0027s army; and found himself on the 2nd of July at the head of an army of 96 battalions, 202 squadrons of horse, and 48 guns; confronting the French and Bavarian army, consisting of 88 battalions, 160 squadrons, 90 guns, and 40 mortars, in a strong position on the Danube. The bulk of the army was on the right bank. On the left bank was the height of Schellenberg, covering the passage of the river at Donauwoerth, and held by 12,000 men, including 2500 horse. Along the front of this hill was an old rampart, which the French were engaged in strengthening when the allied army arrived. The latter were not when they came up, according to the ordinary military idea, in a condition to attack. Their camp had been broken up at three in the morning, and it was two in the afternoon before they arrived, after a long and fatiguing march, in front of the enemy\u0027s position. Thinking that it was probable that he would be forced to fight immediately upon arriving, Marlborough had selected 530 picked men from each battalion, amounting to 6000 men, together with thirty squadrons of horse, as an advance guard; and close behind them followed three regiments of Imperial grenadiers, under Prince Louis. The total strength of this force was 10,500 men. The French and Bavarian generals did not expect an attack, knowing the distance that the troops had marched, and therefore quietly continued their work of strengthening the entrenchments. The Duke of Marlborough, seeing the work upon which they were engaged, determined to attack at once, for, as he said to the Prince of Baden, who wished to allow the men a night\u0027s rest, \"Every hour we delay will cost us a thousand men.\" Orders were therefore given for an instant assault upon the hill of Schellenberg. Not only was the position very strong in itself, but in front of it was a wood, so thick that no attack could be made through it. It was necessary, therefore, to attack by the flanks of the position, and one of these flanks was covered by the fire of the fortress of Donauwoerth. \"This is as bad as a siege,\" Rupert said, discontentedly, to his friend Dillon, for their squadron formed part of the advance. \"We are always out of it.\" \"You are in a great hurry to get that bright cuirass of yours dented, Rupert; but I agree with you, the cavalry are always out of it. There go the infantry.\" In splendid order the 6000 picked men moved forward against the face of the enemy\u0027s position, extending from the wood to the covered way of the fortress; but when they arrived within range of grape, they were swept by so fearful a storm of shot that the line wavered. General Goor and his bravest officers were struck down, and the line fell into confusion. The Bavarians seeing this, leapt from their entrenchment; and pursued their broken assailants with the bayonet; but when disordered by their rush, a battalion of English guards, which had kept its ground, poured so tremendous a fire into their flank that they fell back to their entrenchments. \"This looks serious,\" Dillon said, as the allies fell back. \"The enemy are two to our one, and they have got all the advantage of position.\" \"There is the duke,\" Rupert exclaimed, \"reforming them. There they go again, and he is leading them himself. What a terrible fire! Look how the officers of the staff are dropping! Oh, if the duke should himself be hit! See, the infantry are slackening their advance in spite of the shouts of their officers. They are wavering! Oh, how dreadful; here they come back again.\" \"The duke is going to try again, Rupert. See how he is waving his hand and exhorting the men to a fresh attack. \"That\u0027s right, lads, that\u0027s right. \"They have formed again; there they go.\" Again the troops wavered and broke under the terrible rain of bullets; and this time the Bavarians in great force leapt from their entrenchments, and pounced down upon the broken line. \"Prepare to charge!\" shouted General Lumley, who commanded the cavalry. \"Forward, trot, gallop, charge!\" With a cheer the cavalry, chafed at their long inaction while their comrades were suffering so terribly, dashed forward, and threw themselves furiously upon the Bavarians, driving them headlong back to their lines, and then falling back under a tremendous fire, which rolled over men and horses in numbers. At this moment a cheer broke from the dispirited infantry, as the heads of the three regiments of Imperial grenadiers, led by the Prince of Baden, arrived on the ground. These, without halting, moved forward towards the extreme left of the enemy\u0027s position--which had been left to some extent unguarded, many of the troops having been called off to repulse Marlborough\u0027s attack--pushed back two battalions of French infantry, and entered the works. General D\u0027Arco, the French commanding officer, withdrew some of his men from the centre to hold the Prince of Baden in check; and Marlborough profited by the confusion so caused to endeavour, for the fourth time, to carry the hill. His force was however, now fearfully weakened; and General Lumley, after conferring with him for a moment, rode back to the cavalry. \"The 5th dragoons will dismount and join the infantry,\" he said. In a moment every soldier was on his feet; and five minutes later the regiment, marching side by side with the infantry, advanced up the hill. This time the assault was successful. The enemy, confused by the fact that the allies had already forced their line on the left, wavered. Their fire was wild and ineffectual; and with a tremendous cheer the allies scaled the height and burst into the works. Close behind them General Lumley led his cavalry, who made their way through the gaps in the entrenchments, and fell upon the fugitives with dreadful slaughter. The French and Bavarians fled to a bridge across the Danube below Donauwoerth, which, choked by their weight, gave way, and great numbers were drowned. The rest retreated through Donauwoerth, their rear being gallantly covered by General D\u0027Arco, with a small body of troops who held together. Sixteen guns and thirteen standards fell into the victors\u0027 hands. The loss of the allies, considering the force that they brought into the field--for the main army had not arrived when the victory was decided--was extraordinary, for out of a total of 10,500 men, including cavalry, they lost 1500 killed, and 4000 wounded, or more than half their force; and the greater part of these were English, for upon them fell the whole brunt of the fighting. The enemy suffered comparatively little in the battle, but great numbers were killed in the pursuit or drowned in the Danube. Still greater numbers of Bavarians scattered to their homes; and out of 12000 men, only 3000 joined the army on the other side of the Danube. The Elector of Bavaria fell back with his army to Augsburg, under the cannon of which fortress he encamped, in a position too strong to be attacked. His strong places all fell into the hands of the allies; and every effort was made to induce him to break off from his alliance with France. The elector, however, relying upon the aid of Marshal Tallard, who was advancing with 45,000 men to his assistance, refused to listen to any terms; and the allied powers ordered Marlborough to harry his country, and so force him into submission by the misery of his subjects. Such an order was most repugnant to the duke, who was one of the most humane of men, and who by the uniform kind treatment of his prisoners, not only did much to mitigate the horrors of the war in which he was engaged, but set an example which has since his time been followed by all civilized armies. He had, however, no resource but to obey orders; and the cavalry of the allies were sent to carry fire through Bavaria. No less than 300 towns and villages were destroyed in this barbarous warfare. This duty was abhorrent to Rupert, who waited on the duke, and begged him as the greatest of favours to attach him for a short time to the staff, in order that he might not be obliged to accompany his regiment. The duke--who had already offered Rupert an appointment on his staff, an offer he had gratefully declined, as he preferred to do duty with his regiment--at once acceded to his request, and he was thus spared the horror of seeing the agony of the unhappy peasantry and townspeople, at the destruction of their houses. Rupert, in his rides with messages across the country, saw enough to make him heartsick at the distress into which the people of the country were plunged. One day when riding, followed by Hugh, he came upon a sad group. By a hut which had recently been burned, after some resistance, as was shown by the dead body of a Hessian trooper, a peasant knelt by the body of his wife. A dead child of some five years old lay by, and a baby kicked and cried by the side of its mother. The peasant looked up with an air of bewildered grief, and on seeing the British uniform sprang to his feet, and with a fierce but despairing gesture placed himself as if to defend his children to the last. Rupert drew his rein. \"I would not hurt you, my poor fellow,\" he said in Dutch. The man did not understand, but the gentleness of the tone showed him that no harm was meant, and he again flung himself down by his wife. \"I do not think that she is dead, Hugh,\" Rupert said. \"Hold my horse, I will soon see.\" So saying, he dismounted and knelt by the woman. There was a wound on her forehead, and her face was covered with blood. Rupert ran to a stream that trickled by the side of the road, dipped his handkerchief in water, and returning, wiped the blood from the face and wound. \"It is a pistol bullet, I imagine,\" he said to him; \"but I do not think the ball has entered her head; it has, I think, glanced off. Fasten the horses up to that rail, Hugh, get some water in your hands, and dash it in her face.\" The peasant paid no attention to what was being done, but sat absorbed in grief; mechanically patting the child beside him. \"That\u0027s it, Hugh. Now another. I do believe she is only stunned. Give me that flask of spirits out of my holster.\" Hugh again dashed water in the woman\u0027s face, and Rupert distinctly saw a quiver in her eyelid as he did so. Then forcing open her teeth, he poured a little spirit into her mouth, and was in a minute rewarded by a gasping sigh. \"She lives,\" he exclaimed, shaking the peasant by the shoulder. The man looked round stupidly, but Rupert pointed to his wife, and again poured some spirits between her lips. This time she made a slight movement and opened her eyes. The peasant gave a wild scream of delight, and poured forth a volume of words, of which Rupert understood nothing; but the peasant kneeling beside him, bent his forehead till it touched the ground, and then kissed the lappet of his coat--an action expressive of the intensity of his gratitude. Rupert continued his efforts until the woman was able to sit up, and look round with a frightened and bewildered air. When her eye caught her husband, she burst into tears; and as Hugh raised the baby and placed it in her arms she clasped it tightly, and rocked to and fro, sobbing convulsively. \"Look, Hugh, see if you can find something like a spade in that little garden. Let us bury this poor little child.\" Hugh soon found a spade, and dug a little grave in the corner of a garden under the shade of an old tree. Then the lads returned to the spot where the husband and wife, quiet now, were sitting hand in hand crying together. Rupert made a sign to him to lift the body of his little girl, and then led the way to the little grave. The father laid her in, and then fell on his knees by it with his wife, and prayed in a loud voice, broken with sobs. Rupert and Hugh stood by uncovered, until the peasant had finished. Then the little grave was filled in; and Rupert, pointing to the ruined house, placed five gold pieces in the woman\u0027s hand. Then they mounted their horses again and rode on, the man and his wife both kneeling by the roadside praying for blessings on their heads. A week later, Rupert again had occasion to pass through the village, and dismounted and walked to the little grave. A rough cross had been placed at one end, and some flowers lay strewn upon it. Rupert picked a few of the roses which were blooming neglected near, and laid them on the grave, and then rode on, sighing at the horrors which war inflicts on an innocent population. This time their route lay through a thickly wooded mountain, to a town beyond, where one of the cavalry regiments had its headquarters. Rupert was the bearer of orders for it to return to headquarters, as a general movement of the army was to take place. The road was a mere track, hilly and wild, and the lads rode with pistols cocked, in case of any sudden attack by deserters or stragglers from the Bavarian army. The journey was, however, performed without adventure; and having delivered their orders, they at once started on their homeward way. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3111/85661.html","bookId":933,"book":{"id":933,"title":"The Cornet of Horse","description":"简介： One, two, three, four, one, two, three, four--turn to your lady; one, two, three, four--now deep reverence. Now you take her hand; no, not her whole hand--the tips of her fingers; now you lead her to her seat; now a deep bow, so. That will do. You ar...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3111","creation":"Aug 1, 2019 12:23:52 AM","modification":"Aug 1, 2019 12:23:52 AM"}}
