{"id":19844,"no":9,"title":"Chapter 9: The Duel.","content":"Great was the excitement in the 5th Dragoons when, upon the arrival of Rupert and Hugh--the former of whom was able to ride, but the latter was carried by on a stretcher--they learned the attack which had been made upon one of their officers. The \"Little Cornet\" was a general favourite, short as was the time since he had joined; while Hugh was greatly liked by the men of his own troop. Rupert\u0027s colonel at once sent for him, to learn the particulars of the outrage. Rupert was unable to give farther particulars as to his assailants than that they were German soldiers; that much the dim light had permitted him to see, but more than that he could not say. He stated his reasons for believing Sir Richard Fulke was the originator of the attack, since he had had a quarrel with him in England, but owned that, beyond suspicions, he had no proof. The colonel at once rode down to headquarters, and laid a complaint before the Earl of Athlone, who promised that he would cause every inquiry to be made. Then the general commanding the Hesse contingent was communicated with, and the colonel of the cavalry regiment to which Sir Richard Fulke belonged was sent for. He stated that Captain Fulke had been away on leave of absence for three days, and that he had gone to England. The regiment was, however, paraded, and it was found that five troopers were missing. No inquiry, however, could elicit from any of the others a confession that they had been engaged in any fray, and as all were reported as having been in by ten o\u0027clock, except the five missing men, there was no clue as to the parties engaged. The five men might have deserted, but the grounds for suspicion were very strong. Still, as no proof could be obtained, the matter was suffered to drop. The affair caused, however, much bad feeling between the two regiments, and the men engaged in affrays when they met, until the order was issued that they should only be allowed leave into the town on alternate days. This ill feeling spread, however, beyond the regiments concerned. There had already been a good deal of jealousy upon the part of the Continental troops of the honour gained by the British in being first in at the breaches of Venloo and Liege, and this feeling was now much embittered. Duels between the officers became matters of frequent occurrence, in spite of the strict orders issued against that practice. As Rupert had anticipated, the letter by which he had been entrapped turned out a forgery. Lord Fairholm was extremely indignant when he heard the use that had been made of his name, and at once made inquiries as to the trooper who had carried the note to Rupert. This man he found without difficulty; upon being questioned, he stated that he had just returned from carrying a message when he was accosted by a German officer who offered him a couple of marks to carry a letter up to an officer of the 5th dragoons. Thinking that there was no harm in doing so, he had at once accepted the offer. Upon being asked if he could recognize the officer if he saw him, he replied that he had scarcely noticed his face, and did not think that he could pick him out from others. The first three or four duels which took place had not been attended with fatal result; but about three weeks after the occurrence of the attack on Rupert, Captain Muller, who had been away on leave, returned, and publicly announced his intention of avenging the insult to his regiment by insulting and killing one of the officers of the 5th dragoons. The report of the threat caused some uneasiness among the officers, for the fellow\u0027s reputation as a swordsman and notorious duellist was so well known, that it was felt that any one whom he might select as his antagonist would be as good as a dead man. A proposition was started to report the matter to the general, but this was decisively negatived, as it would have looked like a request for protection, and would so affect the honour of the regiment. There was the satisfaction that but one victim could be slain, for the aggressor in a fatal duel was sure to be punished by removal into some corps stationed at a distance. Rupert was silent during these discussions, but he silently determined that he would, if the opportunity offered, take up the gauntlet, for he argued that he was the primary cause of the feud; and remembering the words of Monsieur Dessin and Maitre Dalboy, he thought that, skillful a swordsman as Muller might be, he would yet have at least a fair chance of victory, while he knew that so much could not be said for any of the other officers of his regiment. The opportunity occurred two days later. Rupert, with his friend Dillon, went down to the large saloon, which was the usual rendezvous with his friends Fairholm and Loveday. The place was crowded with officers, but Rupert soon perceived his friends, sitting at a small table. He and Dillon placed two chairs there also, and were engaged in conversation when a sudden lull in the buzz of talk caused them to look up. Captain Muller had just entered the saloon with a friend, and the lull was caused by curiosity. As his boast had been the matter of public talk; and as all noticed that two officers of the 5th were present, it was anticipated that a scene would ensue. A glance at Dillon\u0027s face showed that the blood had left his cheek; for, brave as the Irishman was, the prospect of being killed like a dog by this native swordsman could not but be terrible to him, and he did not doubt for a moment that he would be selected. Captain Muller walked leisurely up to the bar, drank off a bumper of raw Geneva, and then turned and looked round the room. As his eyes fell on the uniform of the 5th, a look of satisfaction came over his face, and fixing his eyes on Dillon, he walked leisurely across the room. Rupert happened to be sitting on the outside of the table, and he at once rose and as calmly advanced towards the German. There was now a dead silence in the room, and all listened intently to hear what the lad had to say to the duellist. Rupert spoke first; and although he did not raise his voice in the slightest, not a sound was lost from one end of the room to the other. \"Captain Muller,\" he said, \"I hear that you have made a boast that you will kill the first officer of my regiment whom you met. I am, I think, the first, and you have now the opportunity of proving whether you are a mere cutthroat, or a liar.\" A perfect gasp of astonishment was heard in the room. Dillon leapt to his feet, exclaiming, \"No, Rupert, I will not allow it! I am your senior officer.\" And the gallant fellow would have pushed forward, had not Lord Fairholm put his hand on his shoulder and forced him back, saying: \"Leave him alone; he knows what he is doing.\" The German took a step back, with a hoarse exclamation of rage and surprise at Rupert\u0027s address, and put his hand to his sword. Then, making a great effort to master his fury, he said: \"You are safe in crowing loud, little cockerel; but Captain Muller does not fight with boys.\" A murmur of approval ran round the room; for the prospect of this lad standing up to be killed by so noted a swordsman was painful alike to the German and English officers present. \"The same spirit appears to animate you and your friend Sir Richard Fulke,\" Rupert said quietly. \"He did not care about fighting a boy, and so employed a dozen of his soldiers to murder him.\" \"It is a lie!\" the captain thundered, \"Beware, young sir, how you tempt me too far.\" \"You know it is not a lie,\" Rupert said calmly. \"I know he told you he was afraid to fight me, for that I was more than his match; and it seems to me, sir, that this seeming pity for my youth is a mere cover of the fact that you would rather choose as your victim someone less skilled in fence than I happen to be. Are you a coward, too, sir, as well as a ruffian?\" \"Enough!\" the German gasped. \"Swartzberg,\" he said, turning to his friend, \"make the arrangements; for I vow I will kill this insolent puppy in the morning.\" Lord Fairholm at once stepped forward to the Hessian captain. \"I shall have the honour to act as Mr. Holliday\u0027s second. Here is my card. I shall be at home all the evening.\" Rupert now resumed his seat, while Captain Muller and his friend moved to the other end of the saloon. Here he was surrounded by a number of German officers, who endeavoured to dissuade him from fighting a duel in which the killing of his adversary would be condemned by the whole army as child murder. \"Child or not,\" he said ferociously, \"he dies tomorrow. You think he was mad to insult me. It was conceit, not madness. His head is turned; a fencing master once praised his skill at fence, and he thinks himself a match for me--me! the best swordsman, though I say it, in the German army. No, I would not have forced a quarrel on him, for he is beneath my notice; but I am right glad that he has taken up the glove I meant to throw down to his fellow. In killing him I shall not only have punished the only person who has for many years ventured to insult Otto Muller, but I shall have done a service to a friend.\" No sooner had Rupert regained his seat than Dillon exclaimed, \"Rupert, I shall never forgive myself. Others think you are mad, but I know that you sacrifice yourself to save me. \"You did me an ill service, my lord,\" he said, turning to Lord Fairholm, \"by holding me back when I would have taken my proper place. I shall never hold up my head again. But it will not be for long, for when he has killed Rupert I will seek him wherever he may go, and force him to kill me, too.\" \"My dear Dillon, I knew what I was doing,\" Lord Fairholm said. \"It was clear that either he or you had to meet this German cutthroat.\" \"But,\" Dillon asked, in astonishment, \"why would you rather that your friend Rupert should be killed than I?\" \"You are not putting the case fairly,\" Lord Fairholm said. \"Did it stand so, I should certainly prefer that you should run this risk than that Rupert should do so. But the case stands thus. In the first place, it is really his quarrel; and in the second, while it is certain that this German could kill you without fail, it is by no means certain that he will kill Rupert.\" Dillon\u0027s eyes opened with astonishment. \"Not kill him! Do you think that he will spare him after the way he has been insulted before all of us?\" \"No, there is little chance of that. It is his power, not his will, that I doubt. I do not feel certain; far from it, I regard the issue as doubtful; and yet I feel a strong confidence in the result; for you must know, Master Dillon, that Rupert Holliday, boy as he is, is probably the best swordsman in the British army.\" \"Rupert Holliday!\" ejaculated Dillon, incredulously. Lord Fairholm nodded. \"It is as I say, Dillon; and although they say this German is also the best in his, his people are in no way famous that way. Had it been with the best swordsman in the French army that Rupert had to fight, my mind would be less at ease. \"But come now, we have finished our liquor and may as well be off. We are the centre of all eyes here, and it is not pleasant to be a general object of pity, even when that pity is ill bestowed. Besides, I have promised to be at home to wait for Muller\u0027s second. \"I will come round to your quarters, Rupert, when I have arranged time and place.\" The calm and assured manner of Rupert\u0027s two friends did more to convince Dillon that they were speaking in earnest, and that they really had confidence in Rupert\u0027s skill, than any asseveration on their part could have done, but he was still astounded at the news that this boy friend of his, who had never even mentioned that he could fence, could by any possibility be not only a first-rate swordsman, but actually a fair match for this noted duellist. Upon the way up to the barracks, Rupert persuaded his friend to say nothing as to his skill, but it was found impossible to remain silent, for when the officers heard of the approaching duel there was a universal cry of indignation, and the colonel at once avowed his intention of riding off to Lord Athlone to request him to put a stop to a duel which could be nothing short of murder. \"The honour of the regiment shall not suffer,\" he said, sternly, \"for I myself will meet this German cutthroat.\" Seeing that his colonel was resolute, Rupert made a sign to Dillon that he might speak, and he accordingly related to his astonished comrades the substance of what Lord Fairholm had told him. Rupert\u0027s brother officers could not believe the news; but Rupert suggested that the matter could be easily settled if some foils were brought, adding that half-an-hour\u0027s fencing would be useful to him, and get his hand into work again. The proposal was agreed to, and first one and then another of those recognized as the best swordsmen of the regiment, took their places against him, but without exerting himself in the slightest, he proved himself so infinitely their superior that their doubts speedily changed into admiration, and the meeting of the morrow was soon regarded with a feeling of not only hope, but confidence. It was late before Lord Fairholm rode up to the cornet\u0027s. \"Did you think I was never coming?\" he asked as he entered Rupert\u0027s quarters. \"The affair has created quite an excitement, and just as I was starting, two hours back, a message came to me to go to headquarters. I found his lordship in a great passion, and he rated me soundly, I can tell you, for undertaking to be second in such a disgracefully uneven contest as this. When he had had his say, of course I explained matters, pointed out that this German bully was a nuisance to the whole army, and that you being, as I myself could vouch, a sort of phenomenon with the sword, had taken the matter up to save your brother officer from being killed. I assured him that I had the highest authority for your being one of the best swordsmen in Europe, and that therefore I doubted not that you were a match for this German. I also pointed out respectfully to him that if he were to interfere to stop it, as he had intended, the matter would be certain to lead to many more meetings between the officers of the two nationalities. Upon this the general after some talk decided to allow the matter to go on, but said that whichever way it went he would write to the generals commanding all the divisions of the allied army, and would publish a general order to the effect that henceforth no duels shall be permitted except after the dispute being referred to a court of honour of five senior officers, by whom the necessity or otherwise of the duel shall be determined; and that in the case of any duel fought without such preliminary, both combatants shall be dismissed the service, whether the wounds given be serious or not. I think the proposal is an excellent one, and likely to do much good; for in a mixed army like ours, causes for dispute and jealousy are sure to arise, and without some stringent regulation we should be always fighting among ourselves.\" At an early hour on the following morning a stranger would have supposed that some great military spectacle was about to take place, so large was the number of officers riding from Liege and the military stations around it towards the place fixed upon for the duel. The event had created a very unusual amount of excitement, because, in the first place, the attempt to murder Rupert at the mill of Dettinheim had created much talk. The intention of Captain Muller to force a quarrel on the officers of the 5th had also been a matter of public comment, while the manner in which the young cornet of that regiment had taken up the gage, added to the extraordinary inequality between the combatants, gave a special character to the duel. It was eight in the morning when Rupert Holliday rode up to the place fixed upon, a quiet valley some three miles from the town. On the slopes of hills on either side were gathered some two or three hundred officers, English, Dutch, and German, the bottom of the valley, which was some forty yards across, being left clear. There was, however, none of the life and animation which generally characterize a military gathering. The British officers looked sombre and stern at what they deemed nothing short of the approaching murder of their gallant young countryman; and the Germans were grave and downcast, for they felt ashamed of the inequality of the contest. Among both parties there was earnest though quiet talk of arresting the duel, but such a step would have been absolutely unprecedented. The arrival of the officers of the 5th, who rode up in a body a few minutes before Rupert arrived with Lord Fairholm and his friend Dillon, somewhat changed the aspect of affairs, for their cheerful faces showed that from some cause, at which the rest were unable to guess, they by no means regarded the death of their comrade as a foregone event. As they alighted and gave their horses to the orderlies who had followed them, their acquaintances gathered round them full of expressions of indignation and regret at the approaching duel. \"Is there any chance of this horrible business being stopped?\" an old colonel asked Colonel Forbes as he alighted. \"There is a report that the general has got wind of it, and will at the last moment put an end to it by arresting both of them.\" \"No, I fancy that the matter will go on,\" Colonel Forbes said. \"But it is murder,\" Colonel Chambers said indignantly. \"Not so much murder as you think, Chambers, for I tell you this lad is simply a marvel with his sword.\" \"Ah,\" the colonel said. \"I had not heard that; but in no case could a lad like this have a chance with this Muller, a man who has not only the reputation of being the best swordsman in Germany, who now has been in something like thirty duels, and has more than twenty times killed his man.\" \"I know the ruffian\u0027s skill and address,\" Colonel Forbes said; \"and yet I tell you that I regard my young friend\u0027s chance as by no means desperate.\" Similar assurances had some effect in raising the spirits of the English officers; still they refused to believe that a lad like a recently joined cornet could have any real chance with the noted duellist, and their hopes faded away altogether when Rupert rode up. He was, of course, a stranger to most of those present, and his smooth boyish face and slight figure struck them with pity and dismay. Rupert, however, although a little pale, seemed more cheerful than anyone on the ground, and smiled and talked to Lord Fairholm and Dillon as if awaiting the commencement of an ordinary military parade. \"That is a gallant young fellow,\" was the universal exclamation of most of those present, whatever their nationality. \"He faces death as calmly as if he were ignorant of his danger.\" Five minutes later Captain Muller rode up, with his second; and the preparations for the conflict at once began. All except the combatants and their seconds retired to the slopes. Lord Fairholm and Captain Swartzberg stood in the middle of the bottom. Rupert stood back at a short distance, talking quietly with Dillon and his colonel; while Captain Muller walked about near the foot of the slope, loudly saluting those present with whom he was acquainted. There was but little loss of time in choosing the ground, for the bottom of the valley was flat and smooth, and the sun was concealed beneath a grey bank of clouds, which covered the greater part of the sky, so that there was no advantage of light. When all was arranged the length of the swords was measured. Both had come provided with a pair of duelling rapiers, and as all four weapons were of excellent temper and of exactly even length, no difficulty was met with here. Then a deep hush fell upon the gathering as the seconds returned to their principals. It had been arranged by the seconds that they should not fight in uniform, as the heavy boots impeded their action. Both were accordingly attired in evening dress. Rupert wore dark puce satin breeches, white stockings, and very light buckled shoes. His opponent was in bright orange-coloured breeches, with stockings to match. Coats and waistcoats were soon removed, and the shirt sleeves rolled up above the elbow. As they took stand face to face, something like a groan went through the spectators. Rupert stood about five feet nine, slight, active, with smooth face, and head covered with short curls. The German stood six feet high, with massive shoulders, and arms covered with muscle. His huge moustache was twisted upwards towards his ears; his hair was cropped short, and stood erect all over his head. It was only among a few of the shrewder onlookers that the full value of the tough, whipcordy look of Rupert\u0027s frame, and the extreme activity promised by his easy pose, were appreciated. The general opinion went back to the former verdict, that the disparity was so great that, even putting aside the German\u0027s well-known skill, the duel was little short of murder. Just before they stood on guard, Captain Muller said, in a loud voice, \"Now, sir, if you have any prayer to say, say it; for I warn you, I will kill you like a dog.\" A cry of \"Shame!\" arose from the entire body of spectators; when it abated Rupert said, quietly but clearly, \"My prayers are said, Captain Muller. If yours are not, say them now, for assuredly I will kill you--not as a dog, for a dog is a true and faithful animal, but as I would kill a tiger, or any other beast whose existence was a scourge to mankind.\" A cheer of approbation arose from the circle; and with a groan of rage Captain Muller took his stand. Rupert faced him in an instant, and their swords crossed. For a short time the play was exceedingly cautious on both sides, each trying to find out his opponent\u0027s strength. Hitherto the German had thought but little of what Fulke had told him that he had heard, of Rupert\u0027s skill; but the calm and confident manner of the young Englishman now impressed him with the idea that he really, boy as he was, must be something out of the common way. The thought in no way abated his own assurance, it merely taught him that it would be wiser to play cautiously at first, instead of, as he had intended, making a fierce and rapid attack at once, and finishing the struggle almost as soon as it began. The lightning speed with which his first thrusts were parried and returned soon showed him the wisdom of the course he had adopted; and the expression of arrogant disdain with which he had commenced the fight speedily changed to one of care and determination. This insolent boy was to be killed, but the operation must not be carelessly carried out. For a time he attempted by skillful play to get through Rupert\u0027s guard, but the lad\u0027s sword always met him; and its point flashed so quickly and vengefully forward, that several times it was only by quick backward springs that he escaped from it. The intense, but silent excitement among the spectators increased with every thrust and parry; and every nerve seemed to tingle in unison with the sharp clink of the swords. The German now endeavoured to take advantage of his superior height, length of arm, and strength, to force down Rupert\u0027s guard; but the latter slipped away from him, bounding as lightly as a cat out of range, and returning with such rapid and elastic springs, that the German was in turn obliged to use his utmost activity to get back out of reach. So far several slight scratches had been given on both sides, but nothing in any way to affect the combatants. As the struggle continued, gaining every moment in earnestness and effort, a look of anxiety gradually stole over the German\u0027s face, and the perspiration stood thick on his forehead. He knew now that he had met his match; and an internal feeling told him that although he had exerted himself to the utmost, his opponent had not yet put out his full strength and skill. Rupert\u0027s face was unchanged since the swords had crossed. His mouth was set, but in a half smile; his eye was bright; and his demeanour rather that of a lad fencing with buttoned foils than that of one contending for his life against a formidable foe. Now thoroughly aware of his opponent\u0027s strength and tactics, Rupert began to press the attack, and foot by foot drove his opponent back to the spot at which the combat had commenced. Then, after a fierce rally, he gave an opening; the German lunged, Rupert threw back his body with the rapidity of lightning, lunging also as he did so. His opponent\u0027s sword grazed his cheek as it passed, while his own ran through the German\u0027s body until the hilt struck it. Muller fell without a word, an inert mass; and the surgeon running up, pronounced that life was already extinct. The crowd of spectators now flocked down, the English with difficulty repressing their exclamations of delight, and congratulated Rupert on the result, which to them appeared almost miraculous; while the senior German officer present came up to him, and said: \"Although Captain Muller was a countryman of mine, sir, I rejoice in the unexpected result of this duel. It has rid our army of a man who was a scourge to it.\" Plasters and bandages were now applied to Rupert\u0027s wounds; and in a few minutes the whole party had left the valley, one German orderly alone remaining to watch the body of the dead duellist until a party could be sent out to convey it to the town for burial. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3111/85658.html","bookId":933,"book":{"id":933,"title":"The Cornet of Horse","description":"简介： One, two, three, four, one, two, three, four--turn to your lady; one, two, three, four--now deep reverence. Now you take her hand; no, not her whole hand--the tips of her fingers; now you lead her to her seat; now a deep bow, so. That will do. You ar...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3111","creation":"Aug 1, 2019 12:23:52 AM","modification":"Aug 1, 2019 12:23:52 AM"}}
