{"id":48413,"no":131,"title":"Volume 4: Chapter 40 - Hai Ri\u0027s Anger","content":"Volume 4: Chapter 40 - Hai Ri\u0027s Anger Hai Ri suddenly had a realization and said, “So, it was you brat! I heard from Hai Shui that you came back. I had planned to look for you tomorrow. You don’t know just how hell bent my sister has fallen for you. She keeps talking to me about you. You’re so capable! You just got back, but you already have your hands on her.” I laughed bitterly in my heart as I knew he had misunderstood. I hastily explained, ‘It’s not…” Hai Ri interrupted saying, “Why isn’t that the case? I have already seen it. You still want to make excuses? Haha, don’t worry! I would mind if it was other people courting her, but I don’t mind if it’s you. You’re suitable for my sister.” He showed an elder brother’s look. When I tried to explain to him again, Hai Shui stepped forward from behind me. She dully said, “Brother, please don’t meddle in our matter. There really is nothing happening between us.” Hai Ri smiled and said, “You’re still saying nothing is going on? I have already seen you two hugging each other. Haha. Hmm, sister, why did you cry? Did he bully you?” Hai Ri’s expression changed instantly after seeing tears on Hai Shui’s face. Hai Shui quickly replied, “Brother, he didn’t bully me. I already told you not to interfere with our matters. There’s really nothing going on between Zhang Gong and I. He already has a girlfriend.” “What? Zhang Gong, you’re really good. You actually dare to bully my sister. I won’t forgive you!” Hai Ri’s temper erupted again. Hai Shui stood in front of me and cried out, “Brother, please stop meddling in our matter! You also can’t blame Zhang Gong in this matter.” Hai Ri said in rage, “If I don’t blame him, don’t tell me that I should be the one to be blamed! Hai Shui, get out of my way! Zhang Gong, you stinking brat, if you’re a man, stop hiding behind my sister and fight with me. Since we were young, I’ve only fought you once. We haven’t fought since then. I really want to see just what you have that gives you the guts to bully my sister.” I used short distance teleportation to move in front of Hai Shui from behind her. I could only let Hai Ri let off some steam. At worst, I just won’t retaliate. Once Hai Ri saw me step out, he didn’t say anything, but chanted. “Boundless flames, please burn like my fighting spirit to turn into a violent flame to incinerate the enemy standing before you!” An enormous violent flame shot towards me. When Hai Shui wanted to stop the attack, I mentally told her, “Your brother can’t hurt me. Let him let out some steam! If not, he won’t be able to calm down.” After hearing what I said, she moved to the side and worriedly watched our battle. I cast a Holy light on myself; mellow and rich light elements protected me. Hai Ri’s magic power was so overbearing as I was forced to fly backwards after coming in contact with the violent flames. I was like a magic sandbag after that, as I was continuously hit by all kinds of fire magic from Hai Ri. I stayed in the area of my defensive spell and unceasingly chanting defensive spells. The sky was dyed red by Hai Ri’s fire magic. I cried out in my heart. Hai Ri is really strong. After fighting me for a long time, he was just as violent as he was initially; without any intention of stopping. Hai Shui wanted to help me a couple of times, but I kept on stopping her. I told her that I could still hold on. The people watching our battle from the surroundings gradually increased. They were really fellows that had nothing to do after eating one’s fill. They pointed and discussed among themselves. “Wah! Who made Boss Hai Ri so mad? The one getting beaten doesn’t have any strength to fight back.” As I was bombarded by countless magic spells, I couldn’t see who it was. “That fella is in deep trouble. He might become a roasted pig after the battle.” “He really can hold on. Who is that? His defense is quite good. Hai Shui is also here. He’s probably someone that was reckless enough to try and court her, which made Hai Ri furious.” As I stayed in my defensive spell, I withstood his attack. Even though Hai Ri was strong, he was still a rank lower than me. His attack wouldn’t be able to break my defense. The problem was that there was no end to his attacks and I also couldn’t fight back. This was really troublesome. Just as I was dreading, a violent gale suddenly blew past me. A few small Wind Tornados appeared in front of me. My body suddenly lightened. The pressure on my body caused by Hai Ri instantaneously disappeared. Mu Zi landed in front of me accompanied with a cool breeze. “Mu Zi, why did you come?” Mu Zi snorted and said, “You didn’t come to the canteen even after a long time had passed. I’m worried for you.” I moved my head in front of her ear and said as I laughed, “Were you afraid that I would be attracted to Hai Shui?” Mu Zi laughed and said, “Stop being so shameless! Hai Ri, why are you fighting Zhang Gong?” Hai Ri saw Mu Zi appear and block his attack. He stopped attacking and said, “Mu Zi, why are you here? This matter only involves Zhang Gong and I, so stop meddling in our affair and get out of the way!” Hai Ri looked a little scared after seeing Mu Zi. Mu Zi replied, “You’re shameless. Zhang Gong didn’t fight back and let you attack him, but you kept on attacking him.” Hai Ri coldly said, “He’s guilty since he bullied my sister, so I want to beat him up.” Mu Zi said, “How did he bully your sister? Did you see it happening?” Hai Ri was instantly speechless and yelled at the surrounding students who were whispering, “You all aren’t involved in this, so stop staying here to watch the show.” After he chased away the crowd, he turned to Hai Shui and asked, “Sister, did he bully you just now?” Once Hai Shui saw Mu Zi came, her expressions darkened. When she heard Hai Ri questioning her, she replied, “Brother, I already told you not to interfere with our matters. Zhang Gong really didn’t bully me. Let’s just go!” After Hai Ri heard what she said, he was stunned. “If he didn’t bully you, then why were you crying just now?” Hai Shui’s tears flowed again. She said as she cried, “You don’t need to care!” She turned and ran away. After Hai Ri saw Hai Shui running away, he said to Mu Zi, “Are you still going to say he didn’t bully her? You already saw how upset she was.” I walked out from behind Mu Zi and patted Hai Ri’s shoulder. Hai Ri shoved my hand away from him. “Don’t touch me! If you don’t give me a reasonable explanation, I won’t ever let this matter go!” I bitterly smiled and said, “Brother Hai Ri, please calm down a little and let me explain.” Hai Ri coldly looked at me and said, “Carry on.” I looked at Mu Zi and she nodded at me. I sighed before telling him everything from the start to the end of what happened. After Hai Ri heard what I said, he stunningly said, “So, it was a love triangle.” He pulled me to the side and whispered to me, “Brother, it was my bad previously, but it was your fault! Why did you choose Mu Zi? She’s so fierce and violent. It would have been better if you had fallen for my sister as she is prettier and gentler. You should have chosen her instead.” I helplessly replied, “You can’t make such comparisons in love relationships. I can only apologize to Hai Shui. Mu Zi and I mutually love each other. Brother Hai Ri, can you stop making things difficult for me?” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-4-chapter-40","bookId":1498,"book":{"id":1498,"title":"Child of Light","description":"The lazy Zhang Gong decides to learn light magic, a magic often ridiculed as useless for it’s defensive nature. However, he eventually becomes the legendary Grand Magister. While trying to end the continent’s east and west separation in order to unite all of the different races, he becomes every race’s Child of Light.","cover":"http://cunovel.com/img/CoL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/child-of-light","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:11 AM"}}
