{"id":48475,"no":193,"title":"Volume 8: Chapter 3 - Another Encounter with God\u0027s Light","content":"Volume 8: Chapter 3 - Another Encounter with God\u0027s Light ‘This isn’t good. I must find a place to cultivate quietly. Where should I go? I can’t roam too far from the village either. If I don’t have any replenishments, I’m afraid that I’ll revert to the previous situation I was in before coming to this village. There are a lot of people in this village, so it’s detrimental for my quiet cultivation. Ah! That’s right! Didn’t Jian Shan say that the waterfall was a forbidden area? I shall just cultivate there since there shouldn’t be anybody there. They won’t know about it anyway, and I’m don’t have any intentions of destroying either.’ After surveying my surroundings and confirming that there wasn’t anybody around, I used a few short-distance teleportations to reach the waterfall. The waterfall caused great ‘Long! Long!’ sounds, and the water then rushed into a basin, causing never-ending splashes . The rays of sunlight shone down on the water mist, turning it radiant, sparkling and translucent, resulting in a rainbow that floated on top half of the waterfall. There really was nothing more beautiful than that. All of the people here are aware that this was a forbidden area and so had no need to guard this area, but wasn’t this just a water fall? Why it then called this place the forbidden area? I gently scooped up some spring water in my hands and delightedly splashed it on my face. God damn it! I remembered Jian Shan’s words and immediately scrutinised my surroundings . Luckily, there wasn’t anyone around. I felt a little awkward; if I cultivated here and was caught red handed by someone who happened to pass by, what should I do then? They would say that I had trespassed the forbidden area. Looking at the unceasingly flowing spring water, an idea popped into my head suddenly. ‘Why don’t I try going under the waterfall? In the icy cold water, I would probably be able to concentrate even better.’ Taking action as soon as I had thought up the idea, I targeted a large rock beneath the waterfall and sent myself over using short-distance teleportation. Even though I was prepared, the force of the waterfall was exceptionally large. I felt a large force hit me the moment I landed on the rock. My entire body chilled and the very next moment, I was washed into the basin. I swallowed more than a few mouthfuls of the spring water in the midst of my panicking. I currently wasn’t feeling cool and refreshed by the spring water, but rather was in the danger of getting drowned by it. Luckily, my swimming skills weren’t too bad. I swam with all my might, reached the right side of the rock and grabbed onto a corner of it. After resting for a while, I circulated my battle spirit before flying up onto the stone. With the protection from my battle spirit, I succeeded in walking beneath the waterfall that had an extremely strong force. I expanded my battle spirit outwards and used magic to protect myself inside as I sat crossed legged on the rock. I was unable to calm my state of mind in the least due to the unceasing torrent of spring water. The only thing I could do was to bitterly try to withstand the force of the waterfall. I inwardly cried out in agony. If this continued, I would very quickly be washed off the rock. I forced myself to endure as wave after wave struck me with tremendous force, and constantly cast my internal battle spirit and magic outwards to stabilize my body. It seemed that it was impossible to stay here to do any training or cultivation. I should leave this place while I still had enough strength to do so. Just as I was about to leave the spring water, a warm power suddenly came towards me from the midst of the waterfall, making my protective battle spirit and magic power to expand in a single moment. My entire body felt warm and indescribably comfortable. This was a familiar power. What was that? When the Holy Sword on my chest met with that power, it started to merge with it. Ah! I understood why I the feeling was so familiar to me. It was because its characteristics and abilities were exceptionally similar to that of the Holy Sword. The Holy Sword in my body seemed to be celebrating, sending the warm power throughout my body as it greedily absorbed the power from the center of the waterfall. The waterfall was still rapidly rushing down and constantly giving out similar powers as the Holy Sword. My battle spirit and magic power that was being used to protect my body had suddenly disappeared. I was completely naked under the waterfall. The power of the Holy Sword gradually changed from being warm to getting hotter. Even though I was under the ice cold spring water, my body was scorching hot. It seemed to be lit on fire as it emitted golden light. I felt the meridians in my body seemed to be gradually disappearing. My magic power and battle spirit was slowly getting engulfed by the Holy Sword power. I couldn’t help but to be astonished. Surely the power that I had bitterly cultivated wouldn’t disappear just like that, right? I tried controlling the Holy Sword, but it strangely ignored my commands and continued to absorb the power from the spring water unceasingly. When the power reached the limits of what I could contain, I felt as though I was going to explode. There was an intense gold light in front of me before I lost consciousness. What I wasn’t aware of was that I had already spent an entire week away from the village. When I felt as though I was going to explode, the five elders felt the same reaction. The Great Elder said, “Not good! Someone is interfering with the spiritual influence of the Heavenly Spring. Quick! Gather everyone, immediately head towards the Heavenly Spring!” I felt as though I was in a dream and was being surrounded by twinkling stars. Ah! It seemed that I had got back to my inner sacred space. It was the same place where I had communicated with Mi Jia Lie. Could it be that I hadn’t exploded? “That’s right! Child, you didn’t explode. I never thought that you would unexpectedly find God Spirit’s channel.” “Is that you, Mi Jia Lie?” “Yes, it’s me. Under the assistance of the God Spirit’s channel, I was once again able to communicate with you. I asked in surprise, “What is God Spirit’s channel?” Mi Jia Lie replied, “I don’t know what it is either. All I know was that you have inherited God’s power from the God Spirit’s channel .” I heaved a sigh of relief. “I previously thought that I had exploded.” Mi Jia Lie chuckled. “Silly child, it wasn’t you that had exploded but rather your powers in your inner body that did.” I replied, “My inner body’s power had exploded? What’s going on? I previously felt as though the Holy Sword was absorbing my battle spirit and magic power.” Mi Jia Lie explained, “It really happened. Your battle spirit, magic power and the Holy sword’s power in your body aren’t segregated from each other anymore. Moreover, since you have absorbed some of God’s power, you’ll be able to control the Holy Sword. Even though it is still a small portion of it, it is already extremely powerful in the world. You already aren’t far off from becoming a Grand Magister. You’ll understand what I mean after you return to reality.” I asked, “Doesn’t that mean that all the magic power and battle spirit that I had bitterly cultivated are gone?” Mi Jia Lie replied smilingly, “Why would that happen? They’ve just changed their existential form and are much purer as compared to before. Even though this round of baptism in the Divine vein, it hasn’t really increased your level but it’ll still have great benefits to your future cultivation. You should quickly absorb the Divine vein’s power. After you have absorbed it, you must come to the Great Valley to find me. I have much more confidence in you inheriting my power with things the way they are now.” After he said that, Mi Jia Lie seemed to have curled his lips and his voice had abruptly stopped. However, his words had already aroused my suspicions. I asked, “What do you mean by being much more confident? It can’t be that inheriting your powers has an element of danger to it, right?” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-8-chapter-3","bookId":1498,"book":{"id":1498,"title":"Child of Light","description":"The lazy Zhang Gong decides to learn light magic, a magic often ridiculed as useless for it’s defensive nature. However, he eventually becomes the legendary Grand Magister. While trying to end the continent’s east and west separation in order to unite all of the different races, he becomes every race’s Child of Light.","cover":"http://cunovel.com/img/CoL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/child-of-light","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:11 AM"}}
