{"id":48303,"no":21,"title":"Volume 2: Chapter 10 Academy Life","content":"Volume 2: Chapter 10 – Academy Life\n “Zhang Gong, what teacher talked about today was very interesting. Why were you sleeping the whole time?” Ma Ke asked me after class.\n “I have already learned these topics before. I also know long range teleportation. It’s just that I have never used it before. With this being the case, what else am I to do but sleep? Don’t forget, my minor is spatial magic.” I lazily said.\n “Oh! It’s like this. What a pity that I didn’t learn spatial magic. Then, can you teach me?”\n “Well then, let’s go. I want to go eat. We’ll go practice magic in the afternoon.”\n ……\n “Zhang Gong, I’m not going to sit with you anymore if you continue eating like this.” Watching me wolf down my food 5th bowl of rice, Ma Ke complained a bit.\n “Hey, I’m still growing. If I don’t eat, then how will I grow? Who’s going to prevent you from eating?” I indistinctly said.\n Finally finishing my 6th bowl of rice, Ma Ke began dragging me out of the dining hall. From this time on, I had a new nickname: Light Element Rice Bucket.\n “Wow! Zhang Gong, quickly come watch. That water mage is really pretty.” Abruptly, Ma Ke said in awe.\n “Really?” I turned my head. Wow! My blood went straight to my forehead. She truly is very pretty. Covering her body is an azure magic robe, dark blue hair, white skin and two big sparkling eyes. Even though she’s still a child, she will definitely quickly grow up to become a beautiful woman. Indeed, pretty good. Although good is good, I still don’t feel an instant attraction to her. Maybe it’s because I’m too young.\n “She’s very pretty, but she’s not my type. I’m going to go back to the dorm room and sleep.” I say so in a big show for Ma Ke.\n “Boss, if you don’t want her, then I’m going to go chase her!”\n “You go chase her then. I’m going now.” I’ll watch how this youngster dies. Such a pretty girl surely has more than a few people chasing after her. Hey, I’m not going to join on the fun.\n After returning to the dorm room, I once again began meditating for the sake of Xiao Jin (I give everything that I receive from meditating to Xiao Jin, so of course I’m meditating for his sake).\n In the afternoon, I awaken from my meditation. In any case, it doesn’t matter. I need to find a place without people to practice magic. I don’t want to get punched in the face in the future due to a misfired spell.\n Today I’ll practice this then, the intermediate class light spell, the Elemental Spirit Restoration spell. I recited the incantation in the book and began gathering magic power. (Of course I improved the incantation a bit). “Great light elements, your friend requests you to save the creature before me!” Following my incantation, a layer of white light appeared around me. Little by little, the light gathered on my hands. Wa, I forgot something. Who am I supplying this to? I fell. I sure am crazy.\n However the Gods truly take good care of me. Right at that time, a man beaten to look like he had a pig’s head quickly ran towards me. He loudly shouted: “Save me Zhang Gong! I’m about to die!” Who is this person and how does he know my name? I help but be somewhat baffled. Well, whatever. He’s just in time for me to test out how powerful my magic is.\n I use the white light within my hands to cover up the pig head before me. “This spell still consumes a lot of magic power, consuming nearly one third of my magic power before I could treat this pig head’s injury. Wa, no way! To my surprise it’s actually Ma Ke!\n “Ma Ke, how did you end up like this?”\n “Don’t bring it up. Boss, what spell is that? It’s really powerful! It only took a moment to cure me.”\n “Hehe, this is the intermediate light restoration spell, Elemental Spirit Recovery.\n “Ah, this is an intermediate spell. I thought it was an advanced class spell. The power of this spell is about the same as advanced water treatment magic.”\n It turns out that my restoration magic is this effective? Pretty good. I don’t need to fear being injured in the future.\n “Ma Ke, you still didn’t say how you became like this?”\n “Boss Zhang Gong, you must act in my place. Ah, the opponent is very fierce.” After saying this, Ma Ke began telling me the whole story.\n So it was actually like this, Ma Ke went to chase that girl and approached her to strike up a conversation be asking: “I’ll treat you to some popsicles all right little sister?”, “What’s your name?”, “What grade are you in?” and so on. She basically took no notice of him and bluntly said: “So annoying. This housefly should quickly get lost, or else I’ll give you an ugly death.” Ma Ke obviously couldn’t accept this, as he continued bragging about him skipping a grade and how he grew to be so handsome. Finally, she urgently called a fourth grade student to beat him into this state.\n After listening to his story, I couldn’t help but rejoice in his misfortune. Serves his right. I’ve already predicted this would happen. Haha!\n “You’re an idiot. Don’t you know how to hit back? Aren’t you able to use advanced magic?\n “Fight back? You don’t know how powerful that guy is. He can use 6th rank magic as he pleases. I’m lucky he started of leniently with me, only using magic to bind me.\n “Then how did you get that appearance?”\n “Although he didn’t use magic to beat me, he can still use his fists. I was binded and couldn’t fight back, so of course I ended up like that.” Ma Ke had the appearance of someone remembering a painful past.\n “Who let you hit on people as you please. Serves you right. In the future, don’t provoke other people.”\n “No, I still must go. You don’t understand. Her angry appearance is really cute. She truly is very pretty!” Ma Ke’s eyes have already become heart shaped.\n “There’s no way you understand these things at such a young age. You’re still only 11 years old. Even if it’s puppy love, it’s still too early. Aren’t you afraid of being beaten?”\n “Boss, the power of love is great. With the backing of your powerful restoration magic, what would I be afraid of? If worst comes to worst, you can use one of those recovery spells on me then I’ll be fine.” Ma Ke said with a virtuous face.\n It’s the Elemental Spirit Recovery spell you idiot. Hnnng. If you continue to be troublesome, I’ll stop caring about you. You can do as you see fit.”\n “No, please! Boss…..” Ma Ke truly is a housefly, unceasingly bombarding me with his saliva.\n I really can’t stand him. To get it over with, I promised him I’ll help him in the future as he’s doing his best. However, I also warn him that he’s not allowed to tell anyone that I’m healing him.\n Is that girl really that attractive? To the point that he’s willing to sacrifice his life? It’s really hard to imagine. (The me who didn’t understand the male-female relationships couldn’t help but laugh at Ma Ke through my nose.)\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-2-chapter-10","bookId":1498,"book":{"id":1498,"title":"Child of Light","description":"The lazy Zhang Gong decides to learn light magic, a magic often ridiculed as useless for it’s defensive nature. However, he eventually becomes the legendary Grand Magister. While trying to end the continent’s east and west separation in order to unite all of the different races, he becomes every race’s Child of Light. \n","cover":"http://cunovel.com/img/CoL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/child-of-light","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:11 AM"}}
