{"id":48552,"no":270,"title":"Volume 10: Chapter 16 - Satan\u0027s Monster Transformation","content":"Volume 10: Chapter 16 - Satan\u0027s Monster Transformation\n I pulled down the muslin that was covering my face as I asked. “Is human invasion that important? I know that your Demon race’s life is bitter, but the eastern continent also doesn’t have things that are in the west continent. Since both sides has necessities, why can’t we trade? Why must we go to war? The waste of manpower and resources will shake the country’s foundation. Moreover there’s an outsider of our world is beginning to stir, the Monster Race. If something goes wrong, not only will the current territory not be able to maintain itself, but it may even lead to the extinction of your race.”\n Xiu Yu lept up and replied fumingly, “Stop saying such terrifying words to scare people. His Majesty might have been confused by your rumours, but what Monster race are you talking about? It’s merely a legend that from a couple thousand years ago. It’s credibility is still unknown. You want me to just hand over military leadership to you with just your words? Good niece, even though His Majesty has passed down his orders, you know that uncle is in favor to make war against the humans. I really can’t accept it, I refuse to retreat from just words.” \n It seemed that Shan Yun mentioned that they might refuse to listen to orders, excluding their Emperor, he wasn\u0027t wrong. Ke Lin Duo said, “Your Highness, are you going against the imperial edict then?”\n Xiu Yu glared at him before sighing heavily. Countless thoughts flashed through his mind. He really didn’t have the guts to go against the imperial edict and his beloved Mu Zi was in the middle of this.\n Xiu Yu sighed before saying, “Can you let me consider for a while? We really can’t mobilize the troops now.”\n Mu Zi suddenly become unyielding. “Uncle, you must give me a definite answer today, I don’t want the current progress of the negotiation with the three kingdoms to wither due to having a fire in my backyard. Uncle, would I harm you? Please believe in us.”\n Xiu Yu replied with difficulty, “Good Mu Zi, let uncle consider.” If we were to make Xiu Yu pass the military leadership over a short while, it would look really bad on him. He and Xiu Da had always been working hard in preparation to invade the Human race for many years already. When he had finally gotten the chance to command the main army and was able to press on Ström Fortress, how could he just give it up so willingly?\n “Reporting!” A dispatch voiced out from outside the tent.\n “Speak!”\n The dispatch said, partitioned from the tent, “Reporting to His Highness, Prince Satan has returned, accompanied with his guards, and says that he wants to meet you immediately.”\n We were all shocked by this news. Mu Zi pulled on Xiu Yu’s hand and said, “Uncle, Uncle Satan has been placed under house arrest by father since he didn’t agree to father’s decision. How can he suddenly be here? There must be a lie here.”\n Xiu Yu pondered before replying, “Let me meet him before we discuss further. The Demon Emperor might have changed his mind and no longer wants to negotiate with the Human race.”\n Xiu Yu’s words made me apprehensive. Right! Did Satan’s return here really mean that the Demon Emperor had changed his mind?\n Mu Zi was the first to calm down. “Alright, uncle, meet up with Uncle Satan here. We’ll hide first. If there’s any weird happenings, we’ll be in time to assist you.”\n Xiu Yu nodded. “Servers, quickly clean up the place.” After that, he pointed at both sides of the cabinets before saying, “You all hide behind the cabinet. Without my command, you’re not to come out.”\n Everyone hid after Mu Zi nodded.\n Just when the interior of the tent was cleared, the red uniformed guardian announced from outside, “His Highness, Prince Satan has arrived.”\n Xiu Yu smoothed his clothes before walking forward to greet him. When the entrance’s hanging screen opened, Demon King Satan’s lofty silhouette entered our sight with about a dozen followers behind him. What made me feel like laughing was that they unexpectedly were also masked. I kept feeling that there was something different about Satan, but didn’t know how to describe it for the moment. \n Xiu Yu said, “Elder brother, you’ve returned.”\n Satan snorted and replied, “The return to the Royal City has infuriated me. It seems that the Demon Emperor has gone senile to actually want to negotiate with the humans.”\n Xiu Yu silently poured a cup of water and passed it to Satan. “Elder brother, quickly tell me what’s the matter?”\n Satan drank the water content in one go before tossing the glass on the ground. “Brother, do you believe in me?”\n Xiu Yu was stunned before replying, “Of course I believe.”\n Satan replied with hatred, “Alright, since that’s the case, let us brothers make some big changes. Currently, we hold great powers, if the Demon Emperor dispatched people to negotiate with the humans, then we shall………” Upon saying that, he brought himself to Xiu Yu’s ears and whispered some words with laughter.\n After hearing Satan’s words, Xiu Yu seemed to be in great shock as he shouted, “Brother, we can’t do that as we’re one of the Demon race. How can we betray His Majesty? Moreover, if we were to betray him, aren’t you scared that he will come and find us to seek revenge? Are you confident that you can block his Dark Demon Dragon or Dark Dragon spear?” He had purposely said out loud for us to listen. This old fellow was really scheming.\n Satan smiled sinisterly. “Brother, lower your voice. You want everyone to hear our conversation? If I didn’t have a way to deal with him, how could I just come suggest this to you? Brother, listen and pass the military leadership to me. If you agree, we’ll first eliminate the humans and then the beast men. At that time, the world will be ours. We’ll have half of the world each. What do you think about that?” When he was saying that, Satan’s face emitted a sinister aura. Under the dusk coloured cloak, he wasn’t angry at all. \n After seeing this, Xiu Yu was so shocked that he retreated a few steps back. “Brother, what’s wrong with you?” \n I thought about something and mentally conveyed to everyone, “Be careful. Satan has already become a Monster. Everyone, please listen to my command. We’ll attack together momentarily. We mustn’t give them a chance to rest. If not, it’ll lead to a huge loss.”\n I felt that Mu Zi and Ke Lun Duo, who hadn’t meet with the Monster race before, instantly tensed up, while Big Brother Zhan Hu and the rest gathered their Divine powers. The best way to deal with the Monster race was with Divine power. Since Satan had changed into a monster, the masked people behind him must have also been changed into monsters. The Monster King would definitely have sent out elites in order to carry out the important mission of retrieving the Demon race’s military leadership. Thus, we must rapidly eliminate our opponents like silent thunderbolts. If not, it would be hard to know who would survive as it would be hard to deal with just Satan himself, who had changed into a Monster.\n Satan’s expression became increasingly sinister. He extended his right hand and said, “Brother, quickly pass the military leadership to me.” A grey aura emitted from his entire body and was gradually headed towards Xiu Yu.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-10-chapter-16","bookId":1498,"book":{"id":1498,"title":"Child of Light","description":"The lazy Zhang Gong decides to learn light magic, a magic often ridiculed as useless for it’s defensive nature. However, he eventually becomes the legendary Grand Magister. While trying to end the continent’s east and west separation in order to unite all of the different races, he becomes every race’s Child of Light. \n","cover":"http://cunovel.com/img/CoL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/child-of-light","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:11 AM"}}
