{"id":48609,"no":327,"title":"Volume 12: Chapter 1 - Reuniting with Ma Ke","content":"Volume 12: Chapter 1 - Reuniting with Ma Ke\\n\\n The palace of Aixia slumbered where it stood. The land transformed into a world of gold and jade in a dazzling splendor as the sun rose. After returning, I couldn’t calm my heart. I had left Aixia two years ago, but this place was filled with many memories. \\n\\n “Zhang Gong, why did you zone out again?” Jian Shan’s voice rang out beside me. His chest was heaving. He seemed to be exhausted from the time we hurried.\\n\\n “Jian Shan, has your cultivation deteriorated? It doesn’t seem to be as strong as it was before?”\\n\\n Jian Shan’s eyes widened as he finally said, “What? Don’t anger me! Who says that my cultivation is inferior to before? Even though I’ve yet to reach the Sword Saint rank, I’m already one of the top elites among the Radiant Knights. Could you stop comparing me with yourself? Don’t forget, you’re the God’s envoy so you’re different from ordinary people like us.”\\n\\n I made a realization after hearing his words. ‘That’s right. I don’t know how much my cultivation has improved by after receiving the inheritance which makes his cultivation seem weaker than before.’ I awkwardly replied, “I don’t mean that. I’m just trying to coax you into working harder.”\\n\\n Jian Shan snorted. “I’m already working diligently, it’s just that at this stage it will be difficult to increase my power; I can only improve slowly from this point on. Didn’t you want to get information from the palace? Let’s go!”\\n\\n I nodded and pulled Shan Jian along as I used a short teleportation spell to enter the palace. I easily avoided the patrolling guards and mages by using my acute divine sense. I pulled Jian Shan into the rock garden to determine my location and what direction to head to because I hadn’t come here often, so I wasn’t clear on which direction to go after such a long time.\\n\\n Jian Shan asked me, “Why didn’t we enter from the main entrance? Could it be that we can’t be seen by anyone?”\\n\\n I replied, “Isn’t this way better so we can speak with Ma Ke quicker? Do you think the guards would have easily let us in if we simply asked?! Time costs us lives, so wouldn’t it be better to use less of it?”\\n\\n Jian Shan pouted. “That seems reasonable. Where are we heading to now?”\\n\\n I found my bearings and motioned for Jian Shan to be silent. “You just close your eyes and don’t worry about a thing.” Upon saying that, I brought him along by using another short teleportation spell to quickly enter the inner palace. With my cultivation, how could the guards notice me? After making a couple of turns, we finally reached the location where the Emperor of Aixia lives. I used my divine power to scan the interior and was astonished to find that there wasn’t anyone within. ‘Ma Ke wasn’t here? Where did he go so early in the morning?’\\n\\n At that moment, two palace maids were heading our way. I hastily pulled Jian Shan along as I flew above them to the corridor ceiling.\\n\\n The two palace maids whispered while they walked.\\n\\n “Elder sister, did you see how hard working His Majesty is?! He went to settle the kingdom’s affairs so early in the morning. Despite the threat from the Monster race, after His Majesty ascended the throne our kingdom\u0027s power has increased daily. Ah! There’s also the group of experts from the God Protector Domain helping us. Perhaps we’ll be able to surpass the Kingdom of Dalu and become the most powerful of the three kingdoms! It’s really a blessing for our Aixia to be governed by such a wise king.”\\n\\n The other palace maid giggled. “Are you yearning for love? Who doesn\u0027t like His Majesty? He is youthful, handsome and capable, but, don’t even think about it. The love His Majesty and the Empress share is amazing. His Majesty treats her like a treasure and he never took an imperial concubine until now. I think you should just stop dreaming.”\\n\\n “You’re irritating. Elder sister only knows how to mock me. Don’t you also want to be doted upon by His Majesty?”\\n\\n 　…………\\n\\n I almost laughed when I heard their conversation. I didn’t know Ma Ke would have so many secret admirers. However, that fellow didn’t let me down and was governing the kingdom well! He should be at the main hall now. I just need to bring Jian Shan along and head there in order find him. I carefully dodged the few groups of patrolling guards and ended up outside the main hall. I sensed many chaotic auras in the main hall. It seemed that there were many people inside. Jian Shan and I looked at each other before I activated my divine power to bring us to the roof of the main hall. I withdrew my thoughts and listened to the voices inside the main hall.\\n\\n “Your Majesty, even though the situation is highly dangerous, you must not dispatch the Mage Army Squad anymore. It should be sufficient for Lord Ai, Lord Zhen, Lord Di and your friends from the God Protector Domain to be there. We need to leave some protection for the Capital of Aixia after all.” An old voice sounded.\\n\\n “No, I don’t think it’s enough. I feel that it’s different this time. The Monster race has been too quiet lately and are too opportunistic. They will surely dispatch a large force in the final wave this time, and since their forces are gathered at the fort, this place shouldn’t be in any danger. I already made my decision to personally lead the Royal Mage Army Squad in order to assist them. This is a critical moment. We mustn\u0027t get sentimental, instead we must set an example for the other two kingdoms.” Ma Ke’s undeniably imposing voice sounded. ‘This….is this still the brother that I know? Fort? What’s happening to the fort that he needs to personally head there? Where’s Mu Zi and the rest?’ I continued to listen in as I carried these thoughts.\\n\\n “But Your Majesty, you are the ruler of our kingdom! This old subordinate is willing to head forth in your stead.”\\n\\n “No! My decision is final. Pass down my orders, immediately gather the Royal Magic Army Squad and prepare to set off. Similarly, order the Third Division Mage Army Squad to remain here to protect the Capital. Alright, court dismissed!” After a chorus of sighs, over one hundred officials filed out of the main hall, leaving only a few guards in the main hall. There was a gentle aura beside Ma Ke. It should be Empress Hai Yue Xing.\\n\\n “Your Majesty, could you reconsider?” Hai Yue said gently.\\n\\n Ma Ke’s voice became gentler. “Empress, I absolutely can’t cower at such a time. If Boss Zhang Gong was here, he’d definitely support my decision. You shall just have to patiently wait for my return. I’ll certainly bring back news of victory from the annihilation of the Monster race.”\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-12-chapter-1","bookId":1498,"book":{"id":1498,"title":"Child of Light","description":"The lazy Zhang Gong decides to learn light magic, a magic often ridiculed as useless for it’s defensive nature. However, he eventually becomes the legendary Grand Magister. While trying to end the continent’s east and west separation in order to unite all of the different races, he becomes every race’s Child of Light. \\n","cover":"http://cunovel.com/img/CoL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/child-of-light","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:11 AM"}}
