{"id":48341,"no":59,"title":"Volume 3: Chapter 15 The Knight Academy","content":"Volume 3: Chapter 15 – The Knight Academy\n Entering the borders of Xiuda, there were many differences here compared to Aixia as expected, but the simple and honest nature of the people here were the same. Everywhere in Xiuda, you could see warriors wearing knight’s attire. Even a few remote villages were like this as well. It is clear that Xiuda held military tradition in esteem.\n On the road, I practiced a few rank 8 spells that I couldn’t use previously with the light magic book Teacher Di gave me. Although they were only one rank higher, they were truly awesome, their results were certainly as different as heaven and earth. My increase in strength made me feel full of confidence in completing this journey of learning.\n Because I wore the earth knight attire (what Zhan Hu had given me), I arrived at Xiuda Kingdom’s Capital City without a hitch. Ah, what grand buildings, the tall city gate tower intimidated people at first glance. From my observations, the city guards were all made up of advanced warriors, truly powerful.\n When city guards’ officers and men saw my earth knight’s attire, they displayed a gaze of reverence, satisfying my vanity once more. Just as I was about to enter the city, I suddenly heard a person shout from inside the city, “People in front, move out of the way!” I unconsciously stood to the side and looked toward the city’s interior. Wa, that’s an earth dragon?\n I saw ten massive creatures rush out. On top of each creature sat an armored knight holding a massive 3.6 meters long dragon spear. Truly awe inspiring. Those huge creatures should be earth dragons. I attentively observed, discovering that their lengths were similar to Xiao Jin’s, they were only a bit shorter. Their bodies were about five meters long and two meters tall, with two thick, strong hind legs to support their massive bodies and two large claws on their forelimbs. There was no doubt it had the power to rip a tiger apart.\n I inquired to the person to my side, “Hello, are those the Earth Dragon Corps?”\n The soldier looked at me and replied, “You aren’t a native? The Earth Dragon Corps routinely patrol the city every day. They are truly our idols.”\n I laughed and said, “That’s right. I came here to attend the Royal Knight Academy. I’ve never seen earth dragons before. They are truly impressive.”\n The soldier wore an expression of reverence and respectfully said, “In the future you will surely become a member of the Earth Dragon Corps.”\n Walking into the Xiuda city, everywhere in the city was bustling with noise and excitement. I only asked once and heard the directions to the Royal Knight Academy. Arriving at the academy’s gate, just as I was just about to enter, a guard barred the way.\n He politely said, “Hello sir, may I ask who you are looking for?”\n I promptly said, “Hello, I am a graduate from the Aixia Kingdom’s Royal Intermediate Magic Academy, on behalf of Principal Lao Lun Di to come and look for your academy’s principal Li Ke Wen.”\n “So you actually came from Aixia Kingdom, I’ll bring you to go see the principal.” He said straightforwardly.\n “Then I will thank you.” He explained to another guard, then brought me inside the knight academy. The first thing I saw entering the gate were a pair of statues of swift, noble horses. It seems that these are the knights’ emblem. The guard and I turned seven corners and moved through eight school buildings and several large training grounds, arriving at the corner of the academy. This environment is truly good. It was like a small forest; you rarely see so many plants growing. At the center of the forest, there was a small courtyard, at the center of the courtyard there was a small room. Without even being nearby, I heard people talking.\n A bold and angry voice said, “How are you so stupid? Don’t use inflexible strikes, use what you’ve learned creatively. If you continue to practice so inflexibly you will forever be unable to become a radiant knight. Damnably stupid.”\n A different bright and respectful voice replied, “Yes, Teacher.”\n “It’s like I’m with an idiot. Come, again.”\n I asked the guard, “What is this all about?”\n The guard smiled saying, “The Great Principal is teaching his disciple. Let’s go over.”\n In my heart, I was somewhat terrified, “Will it be alright if we disturb them?”\n Just as I let out my voice, the bold voice from the small, inner courtyard pieced it, “Who is it? Did I not command to disallow anyone casually disturb me?”\n The guard respectfully said, “Great Principal, Aixia Kingdom’s Great Lao Lun Di has sent a person to come find you.”\n “Oh? Quickly come over.”\n I entered the courtyard with the guard. There were two people inside. One was an elderly man with a height exceeding two meters and a dragon’s beard. He was wearing tight fitting warrior’s clothing and held a wooden sword. At his side was an adolescent that appeared not much different than me. He was a bit taller than me. His upper body was bright red and displayed strong, rugged muscle. It seems that a moment ago they were exchanging blows with wooden swords.\n I quickly walked in front of the old man and deeply paid my respects. I lowered my head and respectfully said, “Teacher Li Ke Wen, Hello. I am Zhang Gong Wei, a graduate from the Aixia Kingdom’s Royal Intermediate Magic Academy. I was entrusted by Teacher Di to come and meet you.”\n Teacher Wen looked from head to toe and said with a smile, “Lao Lun that old fellow, I thought he had already forgotten about me. You’re his disciple? Even now there are still people that are willing to learn his lousy light magic. It seems your aptitude is not bad but it isn’t equal to my learned martial skills, haha.”\n A very straightforward character, however his words made me somewhat embarrassed. Neither humbly nor arrogantly, I said, is “Teacher Di’s light magic still quite ferocious. Like your martial skills, they each have their own merits. Excuse me, this student cannot put this off any further. Here is a letter from Teacher Di. Please look at it.”\n Teacher Wen took the letter and said, “Don’t speak so formally. It is awkward for me to hear. I’ll look at what Teacher Di wrote.” He quickly finished reading the letter and once again looked at me from head to toe. Looking at my straight hair, he finally said, “Old Di wrote that he had much confidence in you, said you were a magic genius. I don’t know how much of a genius though.”\n I didn’t dare reply, fearing a reply would badly excite the fiery temperament of the old man. It was actually his apprentice that helped me out of the predicament. “Master, a guest arrived, won’t you invite him into the room to rest? You’re frightening him.”\n “Hehe, right. You youngsters will be very intimate in the future, huh? Walk. Let’s enter the room. Guard, you can return.”\n We entered the wooden room. Teacher Wen inquired from me how Teacher Di was doing. From his questions, I felt that he and Teacher Di had a deep friendship.\n Teacher Wen said, “Oh that’s right. I still haven’t given you an introduction. This is my disciple, Dong Ri Huo. He’s half elf. He’s a kid that keenly feels teacher’s temperament, hehe.”\n Dong Ri felt a bit embarrassed by Teacher Wen’s words. I nodded at him, saying, “Hello. Please take care of me in the future.” He gave a warm smile in return.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/child-of-light/col-volume-3-chapter-15","bookId":1498,"book":{"id":1498,"title":"Child of Light","description":"The lazy Zhang Gong decides to learn light magic, a magic often ridiculed as useless for it’s defensive nature. However, he eventually becomes the legendary Grand Magister. While trying to end the continent’s east and west separation in order to unite all of the different races, he becomes every race’s Child of Light. \n","cover":"http://cunovel.com/img/CoL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/child-of-light","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:11 AM"}}
