{"id":74159,"no":7,"title":"Page 7","content":"Of course this is the girl I would fall for.\\n\\n I close a hand over my mouth.\\n\\n I am losing my mind.\\n\\n I tug off my boots. Pull myself up onto my bed and allow my head to hit the pillows behind me.\\n\\n She slept here, I think. She slept in my bed. She woke up in my bed. She was here and I let her get away.\\n\\n I failed.\\n\\n I lost her.\\n\\n I don’t even realize I’ve tugged her notebook out of my pocket until I’m holding it in front of my face. Staring at it. Studying the faded cover in an attempt to understand where she might’ve acquired such a thing. She must’ve stolen it from somewhere, though I can’t imagine where.\\n\\n There are so many things I want to ask her. So many things I wish I could say to her.\\n\\n Instead, I open her journal, and read.\\n\\n Sometimes I close my eyes and paint these walls a different color.\\n\\n I imagine I’m wearing warm socks and sitting by a fire. I imagine someone’s given me a book to read, a story to take me away from the torture of my own mind. I want to be someone else somewhere else with something else to fill my mind. I want to run, to feel the wind tug at my hair. I want to pretend that this is just a story within a story. That this cell is just a scene, that these hands don’t belong to me, that this window leads to somewhere beautiful if only I could break it. I pretend this pillow is clean, I pretend this bed is soft. I pretend and pretend and pretend until the world becomes so breathtaking behind my eyelids that I can no longer contain it. But then my eyes fly open and I’m caught around the throat by a pair of hands that won’t stop suffocating suffocating suffocating\\n\\n My thoughts, I think, will soon be sound.\\n\\n My mind, I hope, will soon be found.\\n\\n The journal drops out of my hand and onto my chest. I run my only free hand across my face, through my hair. I rub the back of my neck and haul myself up so fast that my head hits the headboard and I’m actually grateful. I take a moment to appreciate the pain.\\n\\n And then I pick up the book.\\n\\n And turn the page.\\n\\n I wonder what they’re thinking. My parents. I wonder where they are. I wonder if they’re okay now, if they’re happy now, if they finally got what they wanted. I wonder if my mother will ever have another child. I wonder if someone will ever be kind enough to kill me, and I wonder if hell is better than here. I wonder what my face looks like now. I wonder if I’ll ever breathe fresh air again.\\n\\n I wonder about so many things.\\n\\n Sometimes I’ll stay awake for days just counting everything I can find. I count the walls, the cracks in the walls, my fingers and toes. I count the springs in the bed, the threads in the blanket, the steps it takes to cross the room and back. I count my teeth and the individual hairs on my head and the number of seconds I can hold my breath.\\n\\n But sometimes I get so tired that I forget I’m not allowed to wish for things anymore, and I find myself wishing for the one thing I’ve always wanted. The only thing I’ve always dreamt about.\\n\\n I wish all the time for a friend.\\n\\n I dream about it. I imagine what it would be like. To smile and be smiled upon. To have a person to confide in; someone who wouldn’t throw things at me or stick my hands in the fire or beat me for being born. Someone who would hear that I’d been thrown away and would try to find me, who would never be afraid of me.\\n\\n Someone who’d know I’d never try to hurt them.\\n\\n I fold myself into a corner of this room and bury my head in my knees and rock back and forth and back and forth and back and forth and I wish and I wish and I wish and I dream of impossible things until I’ve cried myself to sleep.\\n\\n I wonder what it would be like to have a friend.\\n\\n And then I wonder who else is locked in this asylum. I wonder where the other screams are coming from.\\n\\n I wonder if they’re coming from me.\\n\\n I’m trying to focus, telling myself these are just empty words, but I’m lying. Because somehow, just reading these words is too much; and the thought of her in pain is causing me an unbearable amount of agony.\\n\\n To know that she experienced this.\\n\\n She was thrown into this by her own parents, cast off and abused her entire life. Empathy is not an emotion I’ve ever known, but now it’s drowning me, pulling me into a world I never knew I could enter. And though I’ve always believed she and I shared many things in common, I did not know how deeply I could feel it.\\n\\n It’s killing me.\\n\\n I stand up. Start pacing the length of my bedroom until I’ve finally worked up the nerve to keep reading. Then I take a deep breath.\\n\\n And turn the page.\\n\\n There’s something simmering inside of me.\\n\\n Something I’ve never dared to tap into, something I’m afraid to acknowledge. There’s a part of me clawing to break free from the cage I’ve trapped it in, banging on the doors of my heart, begging to be free.\\n\\n Begging to let go.\\n\\n Every day I feel like I’m reliving the same nightmare. I open my mouth to shout, to fight, to swing my fists, but my vocal cords are cut, my arms are heavy and weighted down as if trapped in wet cement and I’m screaming but no one can hear me, no one can reach me and I’m caught. And it’s killing me.\\n\\n I’ve always had to make myself submissive, subservient, twisted into a pleading, passive mop just to make everyone else feel safe and comfortable. My existence has become a fight to prove I’m harmless, that I’m not a threat, that I’m capable of living among other human beings without hurting them.\\n\\n And I’m so tired I’m so tired I’m so tired I’m so tired and sometimes I get so angry\\n\\n I don’t know what’s happening to me.\\n\\n “God, Juliette,” I gasp.\\n\\n And fall to my knees.\\n\\n “Call for transport immediately.” I need to get out. I need to get out right now.\\n\\n “Sir? I mean, yes, sir, of course—but where—”\\n\\n “I have to visit the compounds,” I say. “I should make my rounds before my meeting this evening.” This is both true and false. But I’m willing to do anything right now that might get my mind off this journal.\\n\\n “Oh, certainly, sir. Would you like me to accompany you?”\\n\\n “That won’t be necessary, Lieutenant, but thank you for the offer.”\\n\\n “I—s-sir,” he stammers. “Of course, it’s m-my pleasure, sir, to assist you—”\\n\\n Good God, I have taken leave of my senses. I never thank Delalieu. I’ve likely given the poor man a heart attack.\\n\\n “I will be ready to go in ten minutes.” I cut him off.\\n\\n He stutters to a stop. Then, “Yes, sir. Thank you, sir.”\\n\\n I’m pressing my fist to my mouth as the call disconnects.\\n\\n Thirteen\\n\\n We had homes. Before.\\n\\n All different kinds.\\n\\n 1-story homes. 2-story homes. 3-story homes.\\n\\n We bought lawn ornaments and twinkle lights, learned to ride bikes without training wheels. We purchased lives confined within 1, 2, 3 stories already built, stories caught inside of structures we could not change.\\n\\n We lived in those stories for a while.\\n\\n We followed the tale laid out for us, the prose pinned down in every square foot of space we’d acquired. We were content with the plot twists that only mildly redirected our lives. We signed on the dotted line for the things we didn’t know we cared about. We ate the things we shouldn’t, spent money when we couldn’t, lost sight of the Earth we had to inhabit and wasted wasted wasted everything. Food. Water. Resources.\\n\\n Soon the skies were gray with chemical pollution, and the plants and animals were sick from genetic modification, and diseases rooted themselves in our air, our meals, our blood and bones. The food disappeared. The people were dying. Our empire fell to pieces.\\n\\n The Reestablishment said they would help us. Save us. Rebuild our society.\\n\\n Instead they tore us all apart.\\n\\n I enjoy coming to the compounds.\\n\\n It’s an odd place to seek refuge, but there’s something about seeing so many civilians in such a vast, open space that reminds me of what I’m meant to be doing. I’m so often confined within the walls of Sector 45 headquarters that I forget the faces of those we’re fighting and those we’re fighting for.\\n\\n I like to remember.\\n\\n Most days I visit each cluster on the compounds; I greet the residents and ask about their living conditions. I can’t help but be curious about what life must be like for them now. Because while the world changed for everyone else, it always stayed the same for me. Regimented. Isolated. Bleak.\\n\\n There was a time when things were better, when my father wasn’t always so angry. I was about four years old then. He used to let me sit on his lap and search his pockets. I’d get to keep anything I wanted as long as my argument was convincing enough. It was his idea of a game.\\n\\n But this was all before.\\n\\n I wrap my coat more tightly around my body, feel the material press against my back. I flinch without meaning to.\\n\\n The life I know now is the only one that matters. The suffocation, the luxury, the sleepless nights, and the dead bodies. I’ve always been taught to focus on power and pain, gaining and inflicting.\\n\\n I grieve nothing.\\n\\n I take everything.\\n\\n It’s the only way I know how to live in this battered body. I empty my mind of the things that plague me and burden my soul, and I take all that I can from what little pleasantness comes my way. I do not know what it is to live a normal life; I do not know how to sympathize with the civilians who’ve lost their homes. I do not know what it must’ve been like for them before The Reestablishment took over.\\n\\n So I enjoy touring the compounds.\\n\\n I enjoy seeing how other people live; I like that the law requires them to answer my questions. I would have no way of knowing, otherwise.\\n\\n But my timing is off.\\n\\n I paid little attention to the clock before I left base and didn’t realize how soon the sun would be setting. Most civilians are returning home to retire for the evening, their bodies bowed, huddled against the cold as they shuffle toward the metal clusters they share with at least three other families.\\n\\n These makeshift homes are built from forty-foot shipping containers; they’re stacked side by side and on top of one another, lumped together in groups of four and six. Each container has been insulated; fitted with two windows and one door. Stairs to the upper levels are attached on either side. The roofs are lined with solar panels that provide free electricity for each grouping.\\n\\n It’s something I’m proud of.\\n\\n Because it was my idea.\\n\\n When we were seeking temporary shelter for the civilians, I suggested refurbishing the old shipping containers that line the docks of every port around the world. Not only are they cheap, easily replicated, and highly customizable, but they’re stackable, portable, and built to withstand the elements. They’d require minimal construction, and with the right team, thousands of housing units could be ready in a matter of days.\\n\\n I’d pitched the idea to my father, thinking it might be the most effective option; a temporary solution that would be far less cruel than tents; something that would provide true, reliable shelter. But the result was so effective that The Reestablishment saw no need to upgrade. Here, on land that used to be a landfill, we’ve stacked thousands of containers; clusters of faded, rectangular cubes that are easy to monitor and keep track of. \\n\\n","sourceLink":"https://allnovel.net/destroy-me-shatter-me-1-5/page-7.html","bookId":1773,"book":{"id":1773,"title":"Destroy Me (Shatter Me #1.5)","description":"Storyline: Destroy Me (Shatter Me #1.5) \\n Perfect for the fans of Shatter Me who are desperately awaiting the release of Unravel Me, this novella-length digital original will bridge the gap between these two novels from the perspective of the villain we all love to hate, Warner, the ruthless leader of Sector 45. \\n In Tahereh Mafi’s Shatter Me, Juliette escaped from The Reestablishment by seducing Warner—and then putting a bullet in his shoulder. But as she’ll learn in Destroy Me, Warner is not that easy to get rid of. . . \\n Back at the base and recovering from his near-fatal wound, Warner must do everything in his power to keep his soldiers in check and suppress any mention of a rebellion in the sector. Still as obsessed with Juliette as ever, his first priority is to find her, bring her back, and dispose of Adam and Kenji, the two traitors who helped her escape. But when Warner’s father, The Supreme Commander of The Reestablishment, arrives to correct his son’s mistakes, it’s clear that he has much different plans for Juliette. Plans Warner simply cannot allow. \\n Set after Shatter Me and before its forthcoming sequel, Unravel Me, Destroy Me is a novella told from the perspective of Warner, the ruthless leader of Sector 45.\\n","cover":"https://allnovel.net/images/destroy-me-shatter-me-1-5.jpg","author":"Tahereh Mafi","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/destroy-me-shatter-me-1-5.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:30:07 AM"}}
