{"id":86697,"no":2,"title":"Page 2","content":"To make matters worse, he\u0027d learned over the years everything she couldn\u0027t stand about guys. She had this notion that a kiss should mean something and Trystan made it blatantly obvious that he didn\u0027t share that opinion. He\u0027d shot himself in the head in terms of ever having a relationship with her. That was what he had been trying to ask Seth about. Trystan wanted to know if his friend thought it was possible to back track, to fix things with her so he had a chance.\n Seth\u0027s response wasn\u0027t what he wanted to hear, and as Mari descended the stairs, Seth saw her first and his over-the-top language came out. The guy only talked like that when Mari was around, almost like he hoped his nasty comments would chase her off.\n Instead of running, Mari sat down next to Trystan. God, it was so hard to be so close to her and not touch her. Everything from that light floral scent, to her soft curls made him want her even more. Last night in a moment of panic, he thought about telling her that he was in love with her. But she wouldn\u0027t believe him. He knew she wouldn\u0027t. Instead, he grabbed his guitar and recorded a song he wrote for her, before uploading it on a whim. He poured his heart out, never saying her name, only telling her that he loved her, and that he wished she noticed him. No one knew he sang or played. It was a secret he didn\u0027t even tell Seth. At times life was too hard. Too much happened, too fast, and it left him feeling paralyzed. Trystan found solace in his music. He never shared any of it with anyone and now in the light of day, he thought he should go back and delete that song before someone saw it and figured out it was him.\n Mari leaned into him a little bit, her shoulder lightly touching his. Trystan stiffened, his smile faltered. As Seth and Mari argued, Trystan sat there with his insides lurching. He couldn\u0027t take Seth\u0027s crass mouth. He knew it was upsetting Mari, even though she didn\u0027t act like it. It was the little things he noticed, the way her fingers pressed into her jeans forming a little dent where the denim used to be smooth. The curve of her shoulders squared off slowly, her spine becoming straighter and straighter like she intended to fight Seth. After a moment, Trystan shot Seth a look that clearly said STOP.\n Seth didn\u0027t hang around much longer. When he heard Mari wanted to run lines, Trystan groaned inwardly. It was that scene - the one from yesterday. Though he didn\u0027t let on, every fiber of his body protested. The end of that scene had a kiss, and Trystan didn\u0027t think he could resist.\n Chapter 3\n ~MARI~\n \"So you just think she\u0027s waiting for the right guy?\" Trystan\u0027s question caught me by surprise. I was flipping through the book, looking for the right page.\n Stopping, I looked up at him. \"Yeah, most girls want the right guy. They aren\u0027t looking for a one-time thing.\"\n \"That includes you?\" The way he said it, the way his eyes bored into me made me squirm.\n The corner of my mouth pulled up and I shook my head, \"What I think doesn\u0027t matter. You want to know what she thinks.\" The movement made my hair fall over my shoulders. I pushed it out of my face, tucking a few stray curls behind my ear.\n \"How am I supposed to find out? Every time I get a second alone with her, someone interrupts us. And it\u0027s not the kind of question you can just ask.\"\n I glanced over at him, \"You asked me.\"\n There\u0027s a lightness to his voice, \"And you didn\u0027t answer.\" He smiled at me and looked down at his hands.\n For some reason I was hyperaware of my heart. I felt it beating inside of my chest. I shouldn\u0027t have told him, but my tongue was moving before my brain realized it, \"Yeah, I want the right guy. I\u0027m not interested in screwing around with a bunch of randoms. I want it to mean something. I want the connection, the relationship.\" Something inside my chest swirled as I said it and my throat tightened. I couldn\u0027t help but notice his eyes and how closely he watched me. His gaze was so intense that I looked away.\n Trystan nodded slowly and then says, \"You want him to love you.\"\n I wondered if I should respond, but I was up to my neck in the conversation already, \"Is that so wrong? I mean, wouldn\u0027t you want that too?\"\n \"If it were real, yeah. But there\u0027s no such thing as love. Love\u0027s a concoction of the Hallmark Channel.\" My mouth fell open as he said it, but he didn\u0027t stop. \"At least I thought there was no such thing. Now I\u0027m not so sure.\" His voice trailed off, like he was thinking, considering if it could be true - if that was what was making him so crazy.\n My shock changed from offended to surprised, \"Oh my God,\" I breathed. \"She\u0027s really gotten to you. The great Trystan Scott is in love.\"\n He didn\u0027t answer. The way he looked at me made me know I was right. Instead of teasing him, which would have been normal, I sat there in silent awe. \"Are you going to tell her?\"\n He shook his head and leaned back, \"No, I don\u0027t think so.\"\n I lean toward him and pressed my hand to his knee. \"You have to tell her. Damn, Trystan. If she\u0027s gotten to you like this, you should at least give it a shot.\" When his gaze lingered on my hand too long, I pulled it away. I wasn\u0027t a touchy feely person, so it was kind of strange for me to reach out and do anything.\n \"If she realizes it, I won\u0027t deny it, but I can\u0027t tell her.\" He looked at the ceiling as he spoke, his voice uncharacteristically soft. When he looked at me again, he sat up, breathed deeply and said, \"Come on. Run lines with me. Help me forget about her for a while.\"\n Chapter 4\n ~TRYSTAN~\n \"Are you going to tell her?\" Mari asked. Her big brown eyes remained fixed on his face, waiting for an answer that he couldn\u0027t give.\n It doesn\u0027t matter if I tell her, she won\u0027t believe me. You see Mari, it\u0027s you. You\u0027re the one I can\u0027t stop thinking about. You\u0027re the one who makes my heart race and my mood soar. You\u0027re the reason that I can\u0027t sleep, can\u0027t eat. The pain inside my chest, that ache that longs for your touch, devours me.\n Trystan thought these things. They raced through his mind like a swirl of wind. The words were stuck to his tongue. He couldn\u0027t tell her. It had to be something she saw for herself or she\u0027d never believe him.\n Shaking his head, Trystan leaned back against the couch, \"No, I don\u0027t think so.\"\n Mari twisted toward him, her slender hand extended forward. When she placed it on his knee, Trystan nearly crawled out of his skin. As she spoke, he stared at her hand, mesmerized by how much power she held over him. The simple act of patting his knee was too much. Being in the same room as Mari was too much, and here they were alone. Again.\n I did this, he thought to himself. I\u0027m the one who sent Seth away. His gaze was still fixated on Mari\u0027s hand. She lifted it slowly, like she\u0027d made a mistake. When he looked up at her, their eyes locked. Trystan was completely screwed. He couldn\u0027t hide it much longer, and telling her would only make it worse. Ironically, she was sitting there telling Trystan to confess, but she didn\u0027t understand. She didn\u0027t know it was her.\n Trying to put some distance between them, Trystan stretched and looked up at the ceiling. Mari\u0027s gaze was burning a hole on the side of his face, but he\u0027d kiss her if he looked at her again. His heart raced inside his chest. He couldn\u0027t slow the frantic pace. She was too close.\n When he spoke, his voice caught in his throat, \"If she realizes it, I won\u0027t deny it, but I can\u0027t tell her.\" He managed not to look at her as he said it. He knew she had a puzzled look on her face, like she didn\u0027t understand, especially since she could tell how miserable he was. Nothing slipped past Mari. At times Trystan thought she could see right through him, but right now she was blind. And he intended to keep things that way.\n The thought of her rejecting him after confessing how he felt about her made him feel sick. He couldn\u0027t bear it. As it was, he could barely bear this. Thank God Mari didn\u0027t date a lot. If she did, there\u0027d be no way to hide his feelings. They\u0027d come rushing out.\n Trystan looked at Mari again, resisting the urge to run his finger across her cheek. He blinked, clearing the thought from his head and sat up. \"Come on,\" he sighed. \"Run lines with me. Help me forget about her for a while.\"\n But running lines didn\u0027t help him forget about her. When they started, Trystan was acting like his character, seeing his lost love. But as they got into it, as they headed toward the end of the act, all he could think about was Mari\u0027s lips on his.\n Chapter 5\n ~MARI~\n Trystan knew his lines. He sat on the edge of the couch, facing me. Everything from the tone of his voice, to his inflections, to his expressions was perfect. Trystan had a way of looking at a girl that took her breath away. He used every skill he had in the scene, making it difficult to remember that it wasn\u0027t real - that the words weren\u0027t his. Before I knew what was happening, our eyes locked. Every muscle in my body tightened. While we were practicing, he moved closer to me. His knees faced mine. He was close enough to touch me, but he didn\u0027t.\n Still running lines, he continued, \"Then when I saw you again, I couldn\u0027t believe it was you. I watched you that night, trying to get up the nerve to talk to you. After everything that happened, after everything ended the way it did, I - \" he breathed in and closed his eyes. When he opened them again, he lowered his lashes and looked up at me, \"I couldn\u0027t risk ruining that moment. But it was a mistake...\"\n \"Why?\" I said the line, unable to look away. My pulse was racing even though I knew it wasn\u0027t real. Trystan was so intense, and when he looked at me like that it was impossible to notice anything but him.\n His eyes were dark as sapphires. They drifted to my cheek and a moment later, his hand was there touching me lightly. \"Because it haunts me. Every moment of every day is filled with regret. I wonder if I said something, if we could have had another chance...\" his voice trailed off. He brushed my cheek lightly with his thumb before pulling his hand away. Looking down, he breathed, \"But I didn\u0027t. I was a coward.\"\n Our gazes locked, and Trystan was so close to my face that I felt the warmth of his breath on my lips. My voice barely came out, \"If you had it to do over again, what would you do?\"\n This was the spot where he messed up yesterday. The scene had no passion and he totally bumbled his lines. There was no connection with the actress. But today it felt so intense, so real. Heat flushed my body. I wondered what he would do, when he would stop. The scene ended with a kiss and Trystan didn\u0027t break character. Instead he leaned closer to me, slowly, hesitantly. His lips were a breath from mine.\n He whispered, \"I\u0027d do this.\" The sound was soft and seductive passing over his lips, making butterflies erupt in my stomach. My body felt hot. Every inch of skin seared like it was on fire, pleading for his touch. He lingered, withholding the kiss, watching me through lowered lashes.\n There was nothing but him and me in that moment. We weren\u0027t in a dank prop room, we weren\u0027t running lines. The way he looked at me, the way his eyes pinned me in place and stole my breath, made my heart race faster. It banged into my ribs as his lips moved painfully slow toward mine. When his hand touched my face and slid back into my hair, I thought I\u0027d die. Every part of my body was on fire.\n Trystan\u0027s lips brushed lightly to mine. The soft caress sent a spark through me that kept me from pulling away. Instead I savored the sensation, the feel of his full mouth against mine. The heat from his lips, the softness of the kiss would be burned into my mind after that. That kiss would come unbidden when I least expected it. \n","sourceLink":"https://allnovel.net/collide-the-secret-life-of-trystan-scott-1/page-2.html","bookId":2773,"book":{"id":2773,"title":"Collide (The Secret Life of Trystan Scott #1)","description":"Storyline: \n Collide (The Secret Life of Trystan Scott #1) \n When Mari accidentally overhears that Trystan is in love, she can\u0027t believe it. He\u0027s pining over some girl that doesn\u0027t know he\u0027s alive. The confident swagger and endless stream of girls is a facade. It conceals his loneliness and hides how messed up he\u0027s really become trying to flee from a life that\u0027s battered him to his core. \n Trystan tries to figure out how to make it clear how much he loves Mari, but every insincere kiss and every broken promise haunts him, because she knows them all. Now, Trystan has to prove to the one girl he\u0027s actually fallen in love with that she\u0027s not just another conquest. \n Mari has no idea who Trystan loves, but she can tell that whoever it is has captured his heart entirely. Soon Mari sees the man behind the mask, the guy that Trystan tries so hard to hide. Everything about him is appealing, and too hard to resist. \n In a moment of desperation, Trystan uploads a love song he wrote for Mari, but before he can show it to her, the video goes viral. Everyone wants to know who he is, and the only thing shielding him is an anonymous account name and some thick shadows hiding his face. Tyrstan realizes that the consequences of revealing his identity will be disastrous. Everything he\u0027s tried so hard to hide will be exposed. It\u0027s a secret that is impossible to keep and the only girl who he wanted to hear it will never believe him.\n \n","cover":"https://allnovel.net/images/collide-the-secret-life-of-trystan-scott-1.jpg","author":"H.M. Ward","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/collide-the-secret-life-of-trystan-scott-1.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:17:05 PM"}}
