{"id":86700,"no":5,"title":"Page 5","content":"Trystan went through the rest of the day looking for Mari. She wasn\u0027t at her locker at the usual times, and she seemed to alter her normal path through the hallways. Was she avoiding him? Trystan instantly knew why - that kiss. He shouldn\u0027t have kissed her. At the time, he didn\u0027t think it upset her, but it must have. There was no other explanation as to why she was avoiding him. Trystan went into Tucker\u0027s room during his free period. \"I\u0027m here.\" His voice was distant, distracted. He wanted to find Mari and fix things. Tucker glanced up from under an overgrown monobrow. He pointed at the first desk in front of him, \"Sit.\" Tucker didn\u0027t bother to watch Trystan find his seat, instead he went back to the stack of papers in front of him. When he finished marking up the one he was working on, he lifted it and put them into a folder, leaving the pile of papers out on his desk. \"Want to tell me what\u0027s going on?\" Tucker asked. He walked in front of the desk and stopped in front of Trystan. Trystan stared straight ahead, \"I threw an apple core and got busted.\" Glancing up, he said smirking, \"I believe you were there. It was a pretty good throw. Crossed the room and sailed straight into the center of the can.\" \"Scott, you threw it when I walked in. Did you really think I\u0027d let it go? This little cry for help?\" Trystan straightened in his chair and looked directly in his teacher\u0027s face, \"What? That wasn\u0027t a cry for help. It was piss poor timing.\" Tucker\u0027s head tilted to the side. He folded his massive arms across his chest, \"Yeah, right. And I\u0027m the Toothfairy. Listen Scott, if you\u0027re in trouble there are people who can help. I know your dad - \" Trystan shot out of his chair. \"You don\u0027t know shit about my dad, so don\u0027t try your pschyobabble on me.\" Some emotion he couldn\u0027t identify reached out and crushed his gut. After a second he realized it was fear mingling with shame. If people knew the beatings he\u0027d taken, he\u0027d die. Trystan was stronger than his dad but he never fought back. He took his punches. Maybe it was some distorted sense of reality. Maybe he just wanted a father like everyone else had, someone who watched over him and played ball on the weekends. Instead he got the drunk mess, the shell of what used to be a great man. \"Trystan,\" Tucker said, turning toward him as Trystan made a bee line for the door. But Trystan didn\u0027t stop. No one could know. And Tucker was wrong. No one could save him. That was one fact he knew for certain. The last person who tried - shaking his head, he pushed the thought aside. He didn\u0027t want to think about it. His life was what he made it. As soon as Trystan crossed the stage at graduation and got his diploma, he was out of here. But Mari, a voice said in the back of his head. The jaded part of Trystan silently responded, If Mari doesn\u0027t come around by then, she never will. Chapter 11 ~MARI~ After school Trystan found me sitting alone in the theater, waiting for practice to start. I avoided him all day, and he noticed. \"You weren\u0027t at your locker.\" It was a statement, but there was a question in his voice. I shrugged, like it was normal. I had my math book open on my lap. \"Just trying to finish some homework.\" A lopsided grin lined his lips. Great. I knew that expression. He knew I was lying. Damn it. When did he get to know me so well? \"Mari, at least tell me what I did.\" \"You didn\u0027t do anything,\" I said, without looking up, starting another equation. He took the book from my lap and closed it quietly. When I looked up at him, he took my notebook and my pencil, too. \"I know you. Something\u0027s bothering you.\" I was impaled on his gaze as soon as I looked up. It darted through me, and I couldn\u0027t look away. His eyes searched my face and I felt naked. Somehow he\u0027d learned to read me. Two years of running lines had taught him too much. I looked away before he saw how I felt about him. I sighed and threw my head back like I was annoyed. \"Trystan, I\u0027m not mad at you, but I will be if you don\u0027t give me back my stuff.\" He took the pile of books off his lap and held them out over the aisle. Watching me, he dropped them on the floor. The pencil rolled away as the slap of the books echoed through the empty auditorium. I jumped up to push past him, but he blocked me. Trystan was a full head higher than me. I couldn\u0027t look at his face, those eyes would make me say stupid things. Instead I stared at his chest and the black tee shirt that clung to him. Trystan tensed. I could feel his gaze on my face. \"It was the kiss, wasn\u0027t it?\" I lifted my eyes and when I met his I knew I was screwed. I felt the truth about to tumble out of my mouth, but I bit it back. Pushing my curls out of my face I shook my head, \"No, of course not. It didn\u0027t mean anything. Besides, you kiss everyone.\" The expression on his face faltered when I said it and I instantly regretted my words. He looked like I kicked him in the stomach. But, Trystan recovered quickly. Nodding he said, \"Sometimes. Mostly girls.\" He grinned to cover the effect of my words. \"Still, I shouldn\u0027t have done it. I know how you feel about that stuff, and I just got caught up in the moment.\" He pushed his hands into his pockets, and looked up at me. His eyes were so blue. I tore my gaze away, \"It\u0027s fine.\" I tried to ignore the fact that my ribs felt like they were going to crack. My heart raced when he looked at me like that, making my pulse pound like I\u0027d been running. I wanted to turn away, but I couldn\u0027t. My arms folded against my chest. Trystan watched me do it. Then he reached out and touched my forearm, gently brushing my skin with his fingers. He had to know how crazy he was making me. That had to be the reason why he did it. Smiling, he looked up into my face and said, \"I wanted to tell you something. Every time we get a second, someone comes and drags you away. Listen - \" he swallowed hard, his dark lashes lowering. He paused like he can\u0027t figure out how to convey what he wanted to say. When he looked back up into my eyes, I felt like I couldn\u0027t breathe. The sensation of his palm on my arm, the way he looked at me, made me want to throw my arms around his neck, but I couldn\u0027t. The only actual thought registering in my mind at that moment was that Katie\u0027s going to kill me. \"Scott!\" Seth yelled as he walked into the auditorium. The sound bounced around the empty room. Trystan didn\u0027t turn toward him. Instead he stared at me like he wanted to say something else, but he couldn\u0027t. He finally blinked and turned toward Seth. Seth sounded agitated, \"I\u0027ve been looking all over for you.\" \"I\u0027m right here,\" Trystan said flatly. All indications of the seriousness of what he was going to say had washed away. When Seth walked up, he looked at my books on the floor and then back up at us. \"You peg him with your books? Nice.\" He grinned widely, his eyes sliding over me appreciatively. Trystan bent over and picked the books up. He handed them back to me and our fingers brushed, sending sparks through me when I took them. \"Can we finish talking about this later?\" I didn\u0027t trust my voice, so I nodded. \"I\u0027ll catch up with you after practice.\" Chapter 12 ~TRYSTAN~ When he saw Mari sitting alone in the dark theater, Trystan walked in and quietly sat beside her. He\u0027d been thinking about this moment all day. He was going to tell her that he was Day Jones. Dropping a big enough hint should help her figure out that she was the object of his affection. Then Seth bounded in and kept him from saying it. Part of Trystan considered blurting it out in front of his best friend, but he knew the guy wouldn\u0027t let him. Seth effectively ended the conversation. He pulled Trystan out into the hallway like nothing happened. \"What the hell?\" Trystan finally asked. He stopped at stared at Seth. Seth smiled carefully, like he knew he was on cracked ice. \"I can\u0027t let you do it.\" \"It\u0027s not your call,\" Trystan\u0027s voice was cold. His eyes narrowed as he stepped toward Seth. Seth could tell that this was going to be a fight, but he wasn\u0027t letting Trystan make this kind of mistake. He\u0027d seen it before. The guy is completely in love with some chick and then she shoots him between the eyes and bats her eyes like he was nothing. Seth knew Trystan was secretive about his life, and he never pressed him before, but he had to know now. \"Something\u0027s up with you, man. If it\u0027s not the girl, then what is it?\" A redheaded teacher stepped out of her classroom, \"Get out of the halls, gentlemen. You know there\u0027s no loitering after school.\" \"We\u0027re waiting for Tucker,\" Seth replied. Since we were standing in front of the auditorium, she didn\u0027t force the issue. \"Well, he should be here any second. If he isn\u0027t, come and get me and I\u0027ll turn on the lights for you.\" Seth nodded and said, \"Thanks.\" When she was inside her classroom, Seth turned to Trystan, \"I don\u0027t nose into your life, but something\u0027s going on. It\u0027s obvious. If it\u0027s not the girl, then what is it?\" Trystan was fuming. Did everyone see it? Did the dark circles under his eyes give him away? He couldn\u0027t tell anyone. Not even Seth. He wouldn\u0027t understand. Maybe it was a mistake, he wouldn\u0027t know until later, but he lied. \"It\u0027s the girl.\" Tucker raced past them, and into the theater. He didn\u0027t say anything to Trystan about his earlier outburst, or that he walked out of detention. Seth nodded curtly, \"That\u0027s all you had to say. I\u0027ll catch you later.\" Trystan walked into the theater and slipped into a chair while Tucker went over the things he wanted to work on that day. A group of girls sat down behind him, like always. Sometimes he wished they\u0027d follow someone else around. Trystan couldn\u0027t focus, he couldn\u0027t keep his mind here, until he heard Monica whispering behind him. She was one of the actors that were always around, but he didn\u0027t really know her. \"Did you see this? Someone offered Day Jones a contract.\" She held out her phone and the girl sitting next to her took it. \"Holy shit. What\u0027d he say?\" Chanel spoke too loudly and Tucker glared at her. After a small pause, Monica whispered, \"Nothing.\" Chapter 13 ~MARI~ Something was up, but I had no idea what. The way he looked at me was curious. There was something in his eyes that reminded me of panic, but it was more subdued. I couldn\u0027t place the emotion that darted off his face as soon as Seth called his name. Looking down at the play book in my lap, I followed along. I no longer fed people their lines. Instead, they waited next to me in the wings, waiting for their prompt to enter the stage. Brie stood next to me, her arms folded across her chest like she was bored. Her blue eyes were watching the actors on stage, completely ignoring me. When I heard her line, I motioned with my hand for her to enter, but she just stood there. \"Go,\" I whispered. She should have started walking two seconds ago. The pause will result in a gap in the on-stage banter. She\u0027d mess up and I\u0027d get blamed for it. \"I think I know my part better than you,\" she snapped. Before I could say anything, she stepped away from me and onto the stage. The lights shone down on her making her crown of golden waves look ethereal. Brie was a classic bitch. She had the cheerleader Barbie body and all the guys fell all over her. The way she swung her hips when she walked made her impossible to ignore. Today she had on thigh-high boots coupled with a short skirt and a tiny tee shirt that showed her midriff when she moved her arms. The outfit barely met the school dress code. All eyes were on her as she walked on set.","sourceLink":"https://allnovel.net/collide-the-secret-life-of-trystan-scott-1/page-5.html","bookId":2773,"book":{"id":2773,"title":"Collide (The Secret Life of Trystan Scott #1)","description":"Storyline: Collide (The Secret Life of Trystan Scott #1) When Mari accidentally overhears that Trystan is in love, she can\u0027t believe it. He\u0027s pining over some girl that doesn\u0027t know he\u0027s alive. The confident swagger and endless stream of girls is a facade. It conceals his loneliness and hides how messed up he\u0027s really become trying to flee from a life that\u0027s battered him to his core. Trystan tries to figure out how to make it clear how much he loves Mari, but every insincere kiss and every broken promise haunts him, because she knows them all. Now, Trystan has to prove to the one girl he\u0027s actually fallen in love with that she\u0027s not just another conquest. Mari has no idea who Trystan loves, but she can tell that whoever it is has captured his heart entirely. Soon Mari sees the man behind the mask, the guy that Trystan tries so hard to hide. Everything about him is appealing, and too hard to resist. In a moment of desperation, Trystan uploads a love song he wrote for Mari, but before he can show it to her, the video goes viral. Everyone wants to know who he is, and the only thing shielding him is an anonymous account name and some thick shadows hiding his face. Tyrstan realizes that the consequences of revealing his identity will be disastrous. Everything he\u0027s tried so hard to hide will be exposed. It\u0027s a secret that is impossible to keep and the only girl who he wanted to hear it will never believe him.","cover":"https://allnovel.net/images/collide-the-secret-life-of-trystan-scott-1.jpg","author":"H.M. Ward","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/collide-the-secret-life-of-trystan-scott-1.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:17:05 PM"}}
