{"id":93272,"no":10,"title":"Page 10","content":"Call the roller of big cigars,\n The muscular one, and bid him whip\n In kitchen cups concupiscent curds.\n Let the wenches dawdle in such dress\n As they are used to wear, and let the boys\n Bring flowers in last month\u0027s newspapers.\n Let be be finale of seem.\n The only emperor is the emperor of ice cream\n Take from the dresser of deal,\n Lacking the three glass knobs, that sheet\n On which she embroidered three fantails once\n And spread it so as to cover her face.\n If her horny feet protrude, they come\n To show how cold she is, and dumb.\n Let the lamp affix its beam.\n The only emperor is the emperor of ice cream.\n Wallace Stevens\n This column has\n A hole. Can you see\n The Queen of the Dead?\n George Seferis\n 1\n The kicking must have been going on for a long time, because it seemed to echo far down the avenues of sleep as he slowly struggled up to wakefulness. It was dark outside, but when he turned to grasp the clock and bring it to his face, he knocked it onto the floor. He felt dis?oriented and frightened.\n \u0027Who is it?\u0027 he called out.\n \u0027It\u0027s Eva, Mr Mears. There\u0027s a phone call for you.\u0027\n He got up, pulled on his pants, and opened the door bare-chested. Eva Miller was in a white terry-cloth robe, and her face was full of the slow vulnerability of a person still two-fifths asleep. They looked at each other nakedly, and he was thinking: Who\u0027s sick? Who\u0027s died?\n \u0027Long-distance?\u0027\n \u0027No, it\u0027s Matthew Burke.\u0027\n The knowledge did not relieve him as it should have done. \u0027What time is it?\u0027\n \u0027Just after four. Mr Burke sounds very-upset.\n Ben went downstairs and picked the phone up. \u0027This is Ben, Matt.\u0027\n Matt was breathing rapidly into the phone, the sound of his respiration coming in harsh little blurts. \u0027Can you come, Ben? Right now?\u0027\n \u0027Yes, all right. What\u0027s the matter? Are you sick?\u0027\n \u0027Not on the phone. Just come.\u0027\n \u0027Ten minutes.\u0027\n \u0027Ben?\u0027\n \u0027Yes.\u0027\n \u0027Have you got a crucifix? A St Christopher\u0027s medallion? Anything like that?\u0027\n \u0027Hell no. I\u0027m - was - a Baptist.\u0027\n \u0027All right. Come fast.\u0027\n Ben hung up and went back upstairs quickly. Eva was standing with one hand on the newel post, her face filled with worry and indecision - on one hand wanting to know, on the other, not wanting to mix in the tenant\u0027s business.\n \u0027Is Mr Burke sick, Mr Mears?\u0027\n \u0027He says not. He just asked me . . . say, you aren\u0027t Catholic?\u0027\n \u0027My husband was.\u0027\n \u0027Do you have a crucifix or a rosary or a St Christopher\u0027s medallion?\u0027\n \u0027Well . . . my husband\u0027s crucifix is in the bedroom. . . . I could . . . \u0027\n \u0027Yes, would you?\u0027\n She went up the hall, her furry slippers scuffing at the faded strip of carpet. Ben went into his room, pulled on yesterday\u0027s shirt, and slipped his bare feet into a pair of loafers. When he came out again, Eva was standing by his door, holding the crucifix. It caught the light and threw back dim silver.\n \u0027Thank you,\u0027 he said, taking it.\n \u0027Did Mr Burke ask you for this?\u0027\n \u0027Yes, he did.\u0027\n She was frowning, more awake now. \u0027He\u0027s not Catholic. I don\u0027t believe he goes to church.\u0027\n \u0027He didn\u0027t explain to me.\u0027\n \u0027Oh.\u0027 She nodded in a charade of understanding and gave him the crucifix. \u0027Please be careful of it. It has great value for me.\u0027\n \u0027I understand that. I will.\u0027\n \u0027I hope Mr Burke is all right. He\u0027s a fine man.\u0027\n He went downstairs and out onto the porch. He could not hold the crucifix and dig for his car keys at the same time, and instead of simply transferring it from his right hand to his left, he slipped it over his neck. The silver slipped comfortably against his shirt, and getting into the car he was hardly aware that he felt comforted.\n 2\n Every window on the lower floor of Matt\u0027s house was lit up, and when Ben\u0027s headlights splashed across the front as he turned into the driveway, Matt opened the door and waited for him.\n He came up the walk ready for almost anything, but Matt\u0027s face was still a shock. It was deadly pale, and the mouth was trembling. His eyes were wide, and they didn\u0027t seem to blink.\n \u0027Let\u0027s go in the kitchen,\u0027 he said.\n Ben came in, and as he stepped inside, the half light caught the cross lying against his chest.\n \u0027You brought one.\u0027\n \u0027It belongs to Eva Miller. What\u0027s the matter?\u0027\n Matt repeated: \u0027In the kitchen.\u0027 As they passed the stairs leading to the second floor, he glanced upward and seemed to flinch away at the same time.\n The kitchen table where they had eaten spaghetti was bare now except for three items, two of them peculiar: a cup of coffee, an old-fashioned clasp Bible, and a .38 revolver.\n \u0027Now, what\u0027s up, Matt? You look awful.\u0027\n \u0027And maybe I dreamed the whole thing, but thank God you\u0027re here.\u0027 He had picked up the revolver and was turning it over restively in his hands.\n \u0027Tell me. And stop playing with that thing. Is it loaded?\u0027 Matt put the pistol down and ran a hand through his hair. \u0027Yes, it\u0027s loaded. Although I don\u0027t think it would do any good . . . unless I used it on myself.\u0027 He laughed, a jagged, unhealthy sound like grinding glass.\n \u0027Stop that.\u0027\n The harshness in his voice broke the queer, fixed look in his eyes. He shook his head, not like a man propounding a negative, but the way some animals will shake themselves coming out of cold water.\n \u0027There\u0027s a dead man upstairs,\u0027 he said.\n \u0027Who?\u0027\n \u0027Mike Ryerson. He works for the town. He\u0027s a grounds keeper.\u0027\n \u0027Are you sure he\u0027s dead?\u0027\n \u0027I am in my guts, even though I haven\u0027t looked in on him. I haven\u0027t dared. Because, in another way, he may not be dead at all.\u0027\n \u0027Matt, you\u0027re not talking good sense.\u0027\n \u0027Don\u0027t you think I know that? I\u0027m talking nonsense and I\u0027m thinking madness. But there was no one to call but you. In all of \u0027salem\u0027s Lot, you\u0027re the only person that might . . . might . . .\u0027 He shook his head and began again. \u0027We talked about Danny Glick.\u0027\n \u0027Yes.\u0027\n \u0027And how he might have died of pernicious anemia . . . what our grandfathers would have called \"just wasting away.\"\u0027\n \u0027Yes.\u0027\n \u0027Mike buried him. And Mike found Win Purinton\u0027s dog impaled on the Harmony Hill Cemetery gates. I met Mike Ryerson in Dell\u0027s last night, and - \u0027\n 3\n \u0027 - and I couldn\u0027t go in,\u0027 he finished. Couldn\u0027t. I sat on my bed for nearly four hours. Then I crept downstairs like a thief and called you. What do you think?\u0027\n Ben had taken the crucifix off; now he poked at the glimmering heap of fine-link chain with a reflective finger. It was almost five o\u0027clock and the eastern sky was rose with dawn. The fluorescent bar overhead had gone pallid.\n \u0027I think we\u0027d better go up to your guest room and look. That\u0027s all, I think, right now.\u0027\n \u0027The whole thing seems like a madman\u0027s nightmare now, with the light coming in the window.\u0027 He laughed shakily. \u0027I hope it is. I hope Mike is sleeping like a baby.\u0027\n \u0027Well, let\u0027s go see.\u0027\n Matt firmed his lips with an effort. \u0027Okay.\u0027 He dropped his eyes to the table and then looked at Ben question?ingly.\n \u0027Sure,\u0027 Ben said, and slipped the crucifix over Matt\u0027s neck.\n \u0027It actually does make me feel better.\u0027 He laughed self?-consciously. \u0027Do you suppose they\u0027ll let me wear it when they cart me off to Augusta?\u0027\n Ben said, \u0027Do you want the gun?\u0027\n \u0027No, I guess not. I\u0027d stick it in the top of my pants and blow my balls off.\u0027\n They went upstairs, Ben in the lead. There was a short hall at the top, running both ways. At one end, the door to Matt\u0027s bedroom stood open, a pale sheaf of lamplight spilling out onto the orange runner.\n \u0027Down at the other end,\u0027 Matt said\n Ben walked down the hall and stood in front of the guest room door. He did not believe the monstrosity Matt had implied, but nonetheless he found himself engulfed by a wave of the blackest fright he had ever known.\n You open the door and he\u0027s hanging from the beam, the face swelled and puffed and black, and then the eyes open and they\u0027re bulging in the sockets but they\u0027re SEEING you and they\u0027re glad you came -\n The memory rose up in -almost total sensory reference, and for the moment of its totality he was paralyzed. He could even smell the plaster and the wild odor of nesting animals. It seemed to him that the plain varnished wood door of Matt Burke\u0027s guest room stood between him and all the secrets of hell.\n Then he twisted the knob and pushed the door inward. Matt was at his shoulder, and he was holding Eva\u0027s crucifix tightly.\n The guest room window faced directly east, and the top arc of the sun had just cleared the horizon. The first pellucid rays shone directly through the window, isolating a few golden motes as it fell in a shaft to the white linen sheet that was pulled up to Mike Ryerson\u0027s chest.\n Ben looked at Matt and nodded. \u0027He\u0027s all right,\u0027 he whispered. \u0027Sleeping.\u0027\n Matt said tonelessly, \u0027The window\u0027s open. It was closed and locked. I made sure of it.\u0027\n Ben\u0027s eyes centered on the upper hem of the flawlessly laundered sheet that covered Mike. There was a single small drop of blood on it, dried to maroon.\n \u0027I don\u0027t think he\u0027s breathing,\u0027 Matt said.\n Ben took two steps forward and then stopped. \u0027Mike? Mike Ryerson. Wake up, Mike!\u0027\n No response. Mike\u0027s lashes lay cleanly against his cheeks. His hair was tousled loosely across his brow, and Ben thought that in the first delicate light he was more than handsome; he was as beautiful as the profile, of a Greek statue. Light color bloomed in his cheeks, and his body held none of the deathly pallor Matt had mentioned - only healthy skin tones.\n \u0027Of course he\u0027s breathing,\u0027 he said a trifle impatiently. \u0027Just fast asleep. Mike - \u0027 He stretched out a hand and shook Ryerson slightly. Mike\u0027s left arm, which had been crossed loosely on his chest, fell limply over the side of the bed and the knuckles rapped on the floor, like a request for entry.\n Matt stepped forward and picked up the limp arm. He pressed his index finger over the wrist. \u0027No pulse.\u0027\n He started to drop it, remembered the grisly knocking noise the knuckles had made, and put the arm across Ryerson\u0027s chest. It started to fall anyway, and he put it back more firmly with a grimace.\n Ben couldn\u0027t believe it. He was sleeping, had to be. The good color, the obvious suppleness of the muscles, the lips half parted as if to draw breath . . . unreality washed over him. He placed his wrist against Ryerson\u0027s shoulder and found the skin cool.\n He moistened his finger and held it in front of those half-open lips. Nothing. Not a feather of breath.\n He and Matt looked at each other.\n \u0027The marks on the neck?\u0027 Matt asked.\n Ben took Ryerson\u0027s jaw in: his hands and turned it gently until the exposed cheek lay against the pillow. The movement dislodged the left arm, and the knuckles rapped the floor again.\n There were no marks on Mike Ryerson\u0027s neck.\n 4\n They were at the kitchen table again. It was 5:35 A.M. They could hear the lowing of the Griffen cows as they were let into their east pasturage down the hill and beyond the belt of shrubbery and underbrush that screened Taggart Stream from view.\n \u0027According to folklore, the marks disappear,\u0027 Matt said suddenly. \u0027When the victim dies, the marks disappear.\u0027\n \u0027I know that,\u0027 Ben said. He remembered it both from Stoker\u0027s Dracula and from the Hammer films starring Christopher Lee.\n \u0027We have to put an ash stake through his heart.\u0027\n \u0027You better think again,\u0027 Ben said, and sipped his coffee. That would be damned hard to explain to a coroner\u0027s jury. You\u0027d go to jail for desecrating a corpse at the very least. More likely to the funny farm.\u0027\n \u0027Do you think I\u0027m crazy?\u0027 Matt asked quietly.\n With no discernible hesitation, Ben said, \u0027No.\u0027\n \u0027Do you believe me about the marks?\u0027\n \u0027I don\u0027t know. I guess I have to. Why would you lie to me? I can\u0027t see any gain for you in a lie. I suppose you\u0027d lie if you had killed him.\u0027\n \u0027Perhaps I did, then,\u0027 Matt said, watching him.\n \u0027There are three things going against it. First, what\u0027s your motive? Pardon me, Matt, but you\u0027re just too old for the classic ones like jealousy and money to fit very well. Second, what was your method? If it was poison, he must have gone very easily. He certainly looks peaceful enough. And that eliminates most of the common poisons right there.\u0027\n \u0027What\u0027s your third reason?\u0027\n \u0027No murderer in his right mind would invent a story like yours to cover up murder. It would be insane.\u0027\n \u0027We keep coming back to my mental health,\u0027 Matt said. He sighed. \u0027I knew we would.\u0027\n \u0027I don\u0027t think you\u0027re crazy,\u0027 Ben said, accenting the first word slightly. \u0027You seem rational enough.\u0027\n \u0027But you\u0027re not a doctor, are you?\u0027 Matt asked. \u0027And crazy people are sometimes able to counterfeit sanity re?markably well.\u0027\n Ben agreed. \u0027So where does that put us?\u0027\n \u0027Back to square one.\u0027\n \u0027No. Neither one of us can afford that, because there\u0027s a dead man upstairs and pretty soon he\u0027s going to have to be explained. The constable is going to want to know what happened, and so is the medical examiner, and so is the county sheriff. Matt, could it be that Mike Ryerson was just sick with some virus all week and happened to drop dead in your house?\u0027\n For the first time since they had come back down, Matt showed signs of agitation. \u0027Ben, I told you what he said! I saw the marks on his neck! And I heard him invite someone into my house! Then I heard . . . God, I heard that laugh!\u0027 His eyes had taken on that peculiar blank look again.\n \u0027All right,\u0027 Ben said. He got up and went to the window,\u0027 trying to set his thoughts in order. They didn\u0027t go well. As he had told Susan, things seemed to have a way of getting out of hand.\n He was looking toward the Marsten House.\n \u0027Matt, do you know what\u0027s going to happen to you if you even let out a whisper of what you\u0027ve told me?\u0027 Matt didn\u0027t answer.\n \u0027People are going to start tapping their foreheads behind your back when you go by in the street. Little kids are going to get out their Halloween wax teeth when they see you coming and jump out and yell Boo! when you walk by their hedge. Somebody will invent a rhyme like One, two, three, four, I\u0027m gonna suck your blood some more. The high school kids will pick it up and you\u0027ll hear it in the halls when you pass. Your colleagues will begin looking at you strangely. There\u0027s apt to be anonymous phone calls from people purporting to be Danny Glick or Mike Ryerson. They\u0027ll turn your life into a nightmare. They\u0027ll hound you out of town in six months.\u0027\n \u0027They wouldn\u0027t. They know me.\u0027\n Ben turned from the window. \u0027Who do they know? A funny old duck who lives alone out on Taggart Stream Road. Just the fact that you\u0027re not married is apt to make them believe you\u0027ve got a screw loose anyway. And what backup can I give you? I saw the body but nothing else. Even if I had, they would just say I was an outsider. They would even get around to telling each other we were a couple of queers and, this was the way we got our kicks.\u0027\n Matt was looking at him with slowly dawning horror.\n \u0027One word, Matt. That\u0027s all it will take to finish you in salem\u0027s Lot.\u0027\n \u0027So there\u0027s nothing to be done.\u0027\n \u0027Yes, there is. You have a certain theory about who - or what - killed Mike Ryerson. The theory is relatively simple to prove or disprove, I think. I\u0027m in a hell of a fix. I can\u0027t believe you\u0027re crazy, but I can\u0027t believe that Danny Glick came back from the dead and sucked Mike Ryerson\u0027s blood for a whole week before killing him, either. But I\u0027m going to put the idea to the test. And you\u0027ve got to help.\u0027\n \u0027How?\u0027\n \u0027Call your doctor, Cody is his name? Then call Parkins Gillespie. Let the machinery take over. Tell your story just as though you I d never heard a thing in the night. You went into Dell\u0027s and sat down with Mike. He said he\u0027d been feeling sick since last Sunday. You invited him home with you. You went in to check him around three-thirty this morning, couldn\u0027t wake him, and called me.\u0027\n \u0027That\u0027s all?\u0027\n \u0027That\u0027s it. When you speak to Cody, don\u0027t even say he\u0027s dead.\u0027\n \u0027Not dead - \u0027\n \u0027Christ, how do we know he is?\u0027 Ben exploded. \u0027You took his pulse and couldn\u0027t find it; I tried to find his breath and couldn\u0027t do it. If I thought someone was going to shove me into my grave on that basis, I\u0027d damn well pack a lunch. Especially if I looked as lifelike as he does.\u0027\n \u0027That bothers you as much as it does me, doesn\u0027t it?\u0027\n \u0027Yes, it bothers me,\u0027 Ben admitted. \u0027He looks like a goddamn waxwork.\u0027\n \u0027All right,\u0027 Matt said. \u0027You\u0027re talking sense . . . as much as anyone can in a business like this. I guess I sounded nuts, at that.\u0027\n Ben started to deprecate, but Matt waved it off. \u0027But suppose . . . just hypothetically . . . that my first suspicion is right? Would you want even the remotest possibility in the back of your mind? The possibility that Mike might . . . come back?\u0027\n \u0027As I said, that theory is easy enough to prove or dis?prove. And it isn\u0027t what bothers me about all this.\u0027\n \u0027What is?\u0027\n \u0027Just a minute. First things first. Proving or disproving it ought to be no more than an exercise in logic - ruling out possibilities. First possibility: Mike died of some disease ?a virus or something. How do you confirm that or rule it out?\u0027\n Matt shrugged. \u0027Medical examination, I suppose.\u0027\n \u0027Exactly. And the same method to confirm or rule out foul play. If somebody poisoned him or shot him or got him to eat a piece of fudge with a bundle of wires in it - \u0027\n \u0027Murder has gone undetected before.\u0027\n \u0027Sure it has. But I\u0027ll bet on the medical examiner.\u0027\n \u0027And if the medical examiner\u0027s verdict is \"unknown cause\"?\u0027\n \u0027Then,\u0027 Ben said deliberately, \u0027we can visit the grave after the funeral and see if he rises. If he does - which I can\u0027t conceive of - we\u0027ll know. If he doesn\u0027t, we\u0027re faced with the thing that bothers me.\u0027\n \u0027The fact of my insanity,\u0027 Matt said slowly. \u0027Ben, I swear on my mother\u0027s name that those marks were there, that I heard the window go up, that - \u0027\n \u0027I believe you,\u0027 Ben said quietly.\n Matt stopped. His expression was that of a man who has braced himself for a crash that never came.\n \u0027You do?\u0027 he said uncertainly.\n \u0027To put it another way, I refuse to believe that you\u0027re crazy or had a hallucination. I had an experience once . . . an experience that had to do with that damned house on the hill . . . that makes me extremely sympathetic to people whose stories seem utterly insane in light of rational knowl?edge. I\u0027ll tell you about that, one day.\u0027\n \u0027Why not now?\u0027\n \u0027There\u0027s no time. You have those calls to make. And I have one more question. Think about it carefully. Do you have any enemies?\u0027\n \u0027No one who qualifies for something like this.\u0027\n \u0027An ex-student, maybe? One with a grudge?\u0027\n Matt, who knew exactly to what extent he influenced the lives of his students, laughed politely.\n \u0027Okay,\u0027 Ben said. \u0027I\u0027ll take your word for it.\u0027 He shook his head. \u0027I don\u0027t like it. First that dog shows up on the cemetery gates. Then Ralphie Glick disappears, his brother dies, and Mike Ryerson. Maybe they all tie in somehow. But this . . . I can\u0027t believe it.\u0027\n \u0027I better call Cody\u0027s home,\u0027 Matt said, getting up. \u0027Par?kins will be at home.\u0027\n \u0027Call in sick at school, too.\u0027\n \u0027Right.\u0027 Matt laughed without force. \u0027It will be my first sick day in three years. A real occasion.\u0027\n He went into the living room and began to make his calls, waiting at the end of each number sequence for the bell to prod sleepers awake. Cody\u0027s wife apparently referred him to Cumberland Receiving, for he dialed another number, asked for Cody, and went into his story after a short wait.\n He hung up and called into the kitchen: \u0027Jimmy will be here in an hour.\u0027\n \u0027Good,\u0027 Ben said. \u0027I\u0027m going upstairs.\u0027\n \u0027Don\u0027t touch anything.\u0027\n \u0027No.\u0027\n By the time he reached the second-floor landing he could hear Matt on the phone to Parkins Gillespie, answering questions. The words melted into a background murmur as he went down the hall.\n That feeling of half-remembered, half-imagined terror washed over him again as he contemplated the door to the guest room. In his mind\u0027s eye he could see himself stepping forward, pushing it open. The room looks larger, seen from a child\u0027s eye view. The body lies as they left it, left arm dangling to the floor, left cheek pressed against the pillow which still shows the fold lines from the linen closet. The eyes suddenly open, and they are filled with blank, animalistic triumph. The door slams shut. The left arm comes up, the hand hooked into a claw, and the lips twist into a vulpine smile that shows incisors grown wondrously long and sharp -\n He stepped forward and pushed the door with tented fingers. The lower hinges squeaked slightly.\n The body lay as they had left it, left arm fallen, left cheek pressed against the pillowcase -\n \u0027Parkins is coming,\u0027 Matt said from the hallway behind him, and Ben nearly screamed.\n 5\n Ben thought how apt his phrase had been: Let the machin?ery take over. It was very much like a machine - one of those elaborate German contraptions constructed of clockwork and cogs; figures moving in an elaborate dance.\n Parkins Gillespie arrived first, wearing a green tie set off by a VFW tie tack. There were still sleepy seeds in his eyes. He told them he had notified the county ME.\n \u0027He won\u0027t be out himself, the son of a bitch,\u0027 Parkins said, tucking a Pall Mall into the corner of his seamed mouth, \u0027but he\u0027ll send out a deputy and a fella to take pitchers. You touch the cawpse?\u0027\n \u0027His arm fell out of bed,\u0027 Ben said. \u0027I tried to put it back, but it wouldn\u0027t stay.\u0027\n Parkins looked him up and down and said nothing. Ben thought of the grisly sound the knuckles had made on the hardwood floor of Matt\u0027s guest room and felt a queasy laughter in his belly. He swallowed to keep it there.\n Matt led the way upstairs, and Parkins walked around the body several times. \u0027Say, you sure he\u0027s dead?\u0027 he asked finally. \u0027You tried to wake him up?\u0027\n James Cody, MD, arrived next, fresh from a delivery in Cumberland. After the amenities had passed among them (\u0027Good t\u0027seeya,\u0027 Parkins Gillespie said, and lit a fresh cigarette), Matt led them all upstairs again. Now, if we all only played instruments, Ben thought, we could give the guy a real send-off. He felt the laughter trying to come up his throat again.\n Cody turned back the sheet and frowned down at the body for a moment. With a calmness that astounded Ben, Matt Burke said, \u0027It reminded me of what you said about the Glick boy, Jimmy.\u0027\n \u0027That was a privileged communication, Mr Burke,\u0027 Jimmy Cody said mildly. \u0027If Danny Glick\u0027s folks found out you\u0027d said that, they could sue me.\u0027\n \u0027Would they win?\u0027\n \u0027No, probably not,\u0027 Jimmy said, and sighed.\n \u0027What\u0027s this about the Glick boy?\u0027 Parkins asked, frowning.\n \u0027Nothing,\u0027 Jimmy said. \u0027No connection.\u0027 He used his stethoscope, muttered, rolled back an eyelid, and shone a light into the glassy orb beneath.\n Ben saw the pupil contract and said quite audibly, \u0027Christ!\u0027\n \u0027Interesting reflex, isn\u0027t it?\u0027 Jimmy said. He let the eyelid go and it rolled shut with grotesque slowness, as if the corpse had winked at them. \u0027David Prine at Johns Hopkins reports pupillary contraction in some cadavers up to nine hours.\u0027\n \u0027Now he\u0027s a scholar,\u0027 Matt said gruffly. \u0027Used to pull C\u0027s in Expository Writing.\u0027\n \u0027You just didn\u0027t like to read about dissections, you old grump,\u0027 Jimmy said absently, and produced a small hammer. Nice, Ben thought. He retains his bedside manner even when the patient is, as Parkins would say, a cawpse. The dark laughter welled inside him again.\n \u0027He dead?\u0027 Parkins asked, and tapped the ash of his cigarette into an empty flower vase. Matt winced \u0027\n \u0027Oh, he\u0027s dead,\u0027 Jimmy told him. He got up, turned the sheet back to Ryerson\u0027s feet, and tapped the right knee. The toes were moveless. Ben noticed that Mike Ryerson had yellow rings of callus on the bottoms of his feet, at the ball of the heel and at the instep. It made him think of that Wallace Stevens poem about the dead woman. \u0027Let it be the finale of seem,\u0027 he misquoted. \u0027The only emperor is the emperor of ice cream.\u0027\n Matt looked at him sharply, and for a moment his control seemed to waver.\n \u0027What\u0027s that?\u0027 Parkins asked.\n \u0027A poem,\u0027 Matt said. \u0027It\u0027s from a poem about death.\u0027\n \u0027Sounds more like the Good Humor man to me,\u0027 Parkins said, and tapped his ash into the vase again.\n 6\n \u0027Have we been introduced?\u0027 Jimmy asked, looking up at Ben.\n \u0027You were, but only in passing,\u0027 Matt said. \u0027Jimmy Cody, local quack, meet Ben Mears, local hack. And vice versa.\u0027\n \u0027He\u0027s always been clever that way,\u0027 Jimmy said. \u0027That\u0027s how he made all his money.\u0027\n They shook hands over the body.\n \u0027Help me turn him over, Mr Mears.\n A little squeamishly, Ben helped him turn the body on its belly. The flesh was cool, not yet cold, still pliant. Jimmy stared closely at the back, then pulled the jockey shorts down from the buttocks.\n \u0027What\u0027s that for?\u0027 Parkins asked.\n \u0027I\u0027m trying to place the time of death by skin lividity,\u0027 Jimmy said. \u0027Blood tends to seek its lowest level when pumping action ceases, like any other fluid.\u0027 \n \u0027Yeah, sort of like that Drano commercial, That\u0027s the examiner\u0027s job, ain\u0027t it?\u0027\n \u0027He\u0027ll send out Norbert, you know that,\u0027 Jimmy said. \u0027And Brent Norbert was never averse to a little help from his friends.\u0027\n \u0027Norbert couldn\u0027t find his own ass with both hands and a flashlight,\u0027 Parkins said, and flipped his cigarette butt out the open window. \u0027You lost your screen offa this window, Matt. I seen it down on the lawn when I drove in.\u0027\n \u0027That so?\u0027 Matt asked, his voice carefully controlled.\n \u0027Yeah.\u0027\n Cody had taken a thermometer from his bag and now he slid it into Ryerson\u0027s anus and laid his watch on the crisp sheet, where it glittered in the strong sunlight. It was quarter of seven.\n \u0027I\u0027m going downstairs,\u0027 Matt said in a slightly strangled voice.\n \u0027You might as well all go,\u0027 Jimmy said. \u0027I\u0027ll be a little while longer. Would you put on coffee, Mr Burke?\u0027\n \u0027Sure.\u0027\n They all went out and Ben closed the door on the scene. His last glance back would remain with him: the bright, sun-washed room, the clean sheet turned back, the gold wristwatch heliographing bright arrows of light onto the wallpaper, and Cody himself, with his swatch of flaming red hair, sitting beside the body like a steel engraving.\n Matt was making coffee when Brenton Norbert, the assistant medical examiner, arrived in an elderly gray Dodge. He came in with another man who was carrying a large camera.\n \u0027Where is it?\u0027 Norbert asked.\n Gillespie gestured with his thumb toward the stairs. \u0027Jim Cody\u0027s up there.\u0027\n \u0027Good deal,\u0027 Norbert said. \u0027The guy\u0027s probably jitterbugging by now.\u0027 He and the photographer went upstairs.\n Parkins Gillespie poured cream into his coffee until it slopped into his saucer, tested it with his thumb, wiped his thumb on his pants, ]it another Pall Mall, and said, \u0027How did you get into this, Mr Mears?\u0027\n And so Ben and Matt started their little song and dance and none of what they said was precisely a lie, but enough was left unsaid to link them together in a tenuous bond of conspiracy, and enough to make Ben wonder uneasily if be wasn\u0027t in the process of abetting either a harmless bit of kookery or something more serious, something dark. He thought of Matt saying that he had called Ben because he was the only person in \u0027salem\u0027s Lot who might listen to such a story. Whatever Matt Burke\u0027s mental failings might be, Ben thought, inability to read character was not one of them. And that also made him nervous.\n 7\n By nine-thirty it was over.\n Carl Foreman\u0027s funeral wagon had come and taken Mike Ryerson\u0027s body away, and the fact of his passing left the house with him and belonged to the town. Jimmy Cody had gone back to his office; Norbert and the photographer had gone to Portland to talk with the county ME.\n Parkins Gillespie stood on the stoop for a moment and watched the hearse trundle slowly up the road, a cigarette dangling between his lips. \u0027All the times Mike drove that, I bet he never guessed how soon he\u0027d be ridin\u0027 in the back.\u0027 He turned to Ben. \u0027You ain\u0027t leavin\u0027 the Lot just yet, are you? Like you to testify for the coroner\u0027s jury, if that\u0027s okay by you.\u0027\n \u0027No, I\u0027m not leaving.\n The constable\u0027s faded blue eyes measured him. \u0027I checked you through with the feds and the Maine State Police R\u0026I in Augusta,\u0027 he said. \u0027You\u0027ve got a clean rep.\u0027\n \u0027That\u0027s good to know,\u0027 Ben said evenly.\n \u0027I hear it around that you\u0027re sparkin\u0027 Bill Norton\u0027s girl.\u0027\n \u0027Guilty,\u0027 Ben said.\n \u0027She\u0027s a fine lass,\u0027 Parkins said without smiling. The hearse was out of sight now; even the hum of its engine had dwindled to a drone that faded altogether. \u0027Guess she don\u0027t see much of Floyd Tibbits these days.\u0027 \n \u0027Haven\u0027t you some paper work to do, Park?\u0027 Matt prodded gently.\n He sighed and cast the butt of his cigarette away. \u0027Sure do. Duplicate, triplicate, don\u0027t-punch-spindle-or-mutilate. This job\u0027s been more trouble than a she-bitch with crabs the last couple of weeks. Maybe that old Marsten House has got a curse on it.\u0027\n Ben and Matt kept poker faces.\n \u0027Well, s\u0027long.\u0027 He hitched his pants and walked down to his car. He opened the driver\u0027s side door and then turned back to them. \u0027You two ain\u0027t holdin\u0027 nothin\u0027 back on me, are you?\u0027\n \u0027Parkins,\u0027 Matt said, \u0027there\u0027s nothing to hold back. He\u0027s dead.\u0027\n He looked at them a moment longer, the faded eyes sharp and glittering under his hooked brows, and then he sighed. \u0027I suppose,\u0027 he said. \u0027But it\u0027s awful goddamn funny. The dog, the Glick boy, then t\u0027other Glick boy, now Mike. That\u0027s a year\u0027s run for a pissant little burg like this one. My old grammy used to say things ran in threes, not fours.\u0027 He got in, started the engine, and backed out of the driveway. A moment later he was gone over the hill, trailing one farewell honk.\n Matt let out a gusty sigh. \u0027That\u0027s over.\u0027\n \u0027Yes,\u0027 Ben said. \u0027I\u0027m beat. Are you?\u0027\n \u0027I am, but I feel . . . weird. You know that word, the way the kids use it?\u0027\n \u0027Yes.\u0027\n \u0027They\u0027ve got another one: spaced out. Like coming down from an acid trip or speed, when even being normal is crazy.\u0027 He scrubbed a hand across his face. \u0027God, you must think I\u0027m a lunatic. It all sounds like a madman\u0027s raving in the daylight, doesn\u0027t it?\u0027\n \u0027Yes and no,\u0027 Ben said. He put a diffident hand on Matt\u0027s shoulder. \u0027Gillespie is right, you know. There is something going on. And I\u0027m thinking more and more that it has to do with the Marsten House. Other than myself, the people up there are the only new people in town. And I know I haven\u0027t done anything. Is our trip up there tonight still on? The rustic welcome wagon?\u0027\n \u0027If you like.\u0027\n \u0027I do. You go in and get some sleep. I\u0027ll get in touch with Susan and we\u0027ll drop by this evening.\u0027\n \u0027All right.\u0027 He paused. \u0027There\u0027s one other thing. It\u0027s been bothering me ever since you mentioned autopsies.\u0027\n \u0027What?\u0027\n \u0027The laugh I heard - or thought I heard - was a child\u0027 s laugh. Horrible and soulless, but still a child\u0027s laugh. Con?nected to Mike\u0027s story, does that make you think of Danny Glick?\u0027\n \u0027Yes, of course it does.\u0027\n \u0027Do you know what the embalming procedure is?\u0027\n \u0027Not specifically. The blood is drained from the cadaver and replaced with some fluid. They used to use formal?dehyde, but I\u0027m sure they\u0027ve got more sophisticated methods now. And the corpse is eviscerated.\u0027\n \u0027I wonder if all that was done to Danny?\u0027 Matt said, looking at him.\n \u0027Do you know Carl Foreman well enough to ask him in confidence?\u0027\n \u0027Yes, I think I could find a way to do that.\u0027\n \u0027Do it, by all means.\u0027\n \u0027I will.\u0027\n They looked at each other a moment longer, and the glance that passed between them was friendly but indefin?able; on Matt\u0027s part the uneasy defiance of the rational man who has been forced to speak irrationalities, on Ben\u0027s a kind of ill-defined fright of forces he could not understand enough to define.\n 8\n Eva was ironing and watching \u0027Dialing for Dollars\u0027 when he came in. The jackpot was currently up to forty-five dollars, and the emcee was picking telephone numbers out of a large glass drum.\n \u0027I heard,\u0027 she said as he opened the refrigerator and got a Coke. \u0027Awful. Poor Mike.\u0027\n \u0027It\u0027s too bad.\u0027 He reached into his breast pocket and fished out the crucifix on its fine-link chain.\n \u0027Do they know what - \u0027\n \u0027Not yet,\u0027 Ben said. \u0027I\u0027m very tired, Mrs Miller. I think I\u0027ll sleep for a while.\u0027\n \u0027Of course you should. That upstairs room is hot at midday, even this late in the year. Take the one in the downstairs hall if you like. The sheets are fresh.\u0027\n \u0027No, that\u0027s all right. I know all the squeaks in the one upstairs.\u0027\n \u0027Yes, a person does get used to their own,\u0027 she said matter-of-factly. \u0027Why in the world did Mr Burke want Ralph\u0027s crucifix?\u0027\n Ben paused on his way to the stairs, momentarily at a loss. \u0027I think he must have thought Mike Ryerson was a Catholic.\u0027\n Eva slipped a new shirt on the end of her ironing board. \u0027He should have known better than that. After all, he had Mike in school. All his people were Lutherans.\u0027\n Ben had no answer for that. He went upstairs, pulled his clothes off, and got into bed. Sleep came rapidly and heavily. He did not dream.\n 9\n When he woke up, it was quarter past four. His body was beaded with sweat, and he had kicked the upper sheet away. Still, he felt clear-headed again. The events of that early morning seemed to be far away and dim, and Matt Burke\u0027s fancies had lost their urgency. His job for tonight was only to humor him out of them if he could.\n 10\n He decided that he would call Susan from Spencer\u0027s and have her meet him there. They could go to the park and he would tell her the whole thing from beginning to end.\n He could get her opinion on their way out to see Matt, and at Matt\u0027s house she could listen to his \u0027version and complete her judgment. Then, on to the Marsten House. The thought caused a ripple of fear in his midsection.\n He was so involved in his own thoughts that he never noticed that someone was sitting in his car until the door opened and the tall form accordioned out. For a moment his mind was too stunned to command his body; it was busy boggling at what it first took to be an animated scarecrow. The slanting sun picked the figure out in detail that was sharp and cruel: the old fedora hat pulled low around the ears; the wrap-around sunglasses; the ragged overcoat with the collar turned up; the heavy industrial green rubber gloves on the hands.\n \u0027Who - \u0027 was all Ben had time to get out The figure moved closer. The fists bunched. There was an old yellow smell that Ben recognized as that of mothballs. He could hear breath slobbering in and out.\n \u0027You\u0027re the son of a bitch that stole my girl,\u0027 Floyd Tibbits said in a grating, toneless voice. \u0027I\u0027m going to kill you.\u0027\n And while Ben was still trying to clear all this through his central switchboard, Floyd Tibbits waded in. \n","sourceLink":"https://allnovel.net/salem-s-lot/page-10.html","bookId":2573,"book":{"id":2573,"title":"\u0027Salem\u0027s Lot","description":"Storyline: \n Something strange is going on in Jerusalem\u0027s Lot ... but no one dares to talk about it. By day, \u0027Salem\u0027s Lot is a typical modest New England town; but when the sun goes down, evil roams the earth. The devilishly sweet insistent laughter of a child can be heard echoing through the fields, and the presence of silent looming spirits can be felt lurking right outside your window. Stephen King brings his gruesome imagination to life in this tale of spine tingling horror.\n \n","cover":"https://allnovel.net/images/salem-s-lot.jpg","author":"Stephen King","type":"Horror","source":"allnovel","link":"https://allnovel.net/salem-s-lot.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:00:27 PM"}}
