{"id":93265,"no":3,"title":"Page 3","content":"No live organism can continue for long to exist sanely under conditions of absolute reality; even larks and katydids are supposed, by some, to dream. Hill House, not sane, stood by itself against its hills holding darkness within; it had stood for eighty years and might stand for eighty more. Within, walls con?tinued upright, bricks met neatly, floors were firm, and doors were sensibly shut; silence lay steadily against the wood and stone of Hill House, and what?ever walked there, walked alone.\n Shirley Jackson\n The Haunting of Hill House\n Chapter One BEN (I)\n 1\n By the time he had passed Portland going north on the turnpike, Ben Mears had begun to feel a not unpleasurable tingle of excitement in his belly. It was September 5, 1975, and summer was enjoying her final grand fling. The trees were bursting with green, the sky was a high, soft blue, and just over the Falmouth town line he saw two boys walking a road parallel to the expressway with fishing rods settled on their shoulders like carbines.\n He switched to the travel lane, stowed to the minimum turnpike speed, and began to look for anything that would jog his memory. There was nothing at first, and he tried to caution himself against almost sure disappointment. You were seven then. That\u0027s twenty-five years of water under the bridge. Places change. Like people.\n In those days the four-lane 295 hadn\u0027t existed. If you wanted to go to Portland from the Lot, you went out Route 12 to Falmouth and then got on Number 1. Time had marched on.\n Stop that shit.\n But it was hard to stop. It was hard to stop when -\n ?A big BSA cycle with jacked handlebars suddenly roared past him in the passing lane, a kid in a T-shirt driving, a girl in a red cloth jacket and huge mirror-lensed sunglasses riding pillion behind him. They cut in a little too quickly and he overreacted, jamming on his brakes and laying both hands on the horn. The BSA sped up, belching blue smoke from its exhaust, and the girl jabbed her middle finger back at him.\n He resumed speed, wishing for a cigarette. His hands were trembling slightly. The BSA was almost out of sight now, moving fast. The kids. The goddamned kids. Memor?ies tried to crowd in on him, memories of a more recent vintage. He pushed them away. He hadn\u0027t been on a motor?cycle in two years. He planned never to ride on one again.\n A flash of red caught his eye off to the left, and when, he glanced that way, he felt a burst of pleasure and recog?nition. A large red barn stood on a hill far across a rising field of timothy and clover, a barn with a cupola painted white - even at this distance he could see the sungleam on the weather vane atop that cupola. It had been there then, and was still here now. It looked exactly the same. Maybe it was going to be all right after all. Then the trees blotted it out. \n As the turnpike entered Cumberland, more and more things began to seem familiar. He passed over the Royal River, where they had fished for steelies and pickerel as boys. Past a brief, flickering view of Cumberland Village through the trees. In the distance the Cumberland water tower with its huge slogan painted across the side: \u0027Keep Maine Green.\u0027 Aunt Cindy had always said someone should print \u0027Bring Money\u0027 underneath that.\n His original sense of excitement grew and he began to speed up, watching for the sign. It came twinkling up out of the distance in reflectorized green five miles later:\n ROUTE 12 JERUSALEM\u0027S LOT\n CUMBERLAND CUMBERLAND CTR\n A sudden blackness came over him, dousing his good spirits like sand on fire. He had been subject to these since (his mind tried to speak Miranda\u0027s name and he would not let it) the bad time and was used to fending them off, but this one swept over him with a savage power that was dismaying. \n What was he doing, coming back to a town where he had lived for four years as a boy, trying to recapture something that was irrevocably lost? What magic could he expect to recapture by walking roads that he had once walked as a boy and were probably asphalted and straightened and logged off and littered with tourist beer cans? The magic was gone, both white and black. It had all gone down the chutes on that night when the motorcycle bad gone out of control and then there was the yellow moving van, growing and growing, his wife Miranda\u0027s scream, cut off with sudden finality when -\n The exit came up on his right, and for a moment he considered driving right past it, continuing on to Chamber?lain or Lewiston, stopping for lunch, and then turning around and going back. But back where? Home? That was a laugh. If there was a home, it had been here. Even if it had only been four years, it was his.\n He signaled, slowed the Citro?n, and went up the ramp. Toward the top, where the turnpike ramp joined Route 12 (which became Jointner Avenue closer to town), he glanced up toward the horizon. What he saw there made him jam the brakes on with both feet. The Citro?n shud?dered to a stop and stalled.\n The trees, mostly pine and spruce, rose in gentle slopes toward the east, seeming to almost crowd against the sky at the limit of vision. From here the town was not visible. Only the trees, and, in the distance, where those trees rose against the sky, the peaked, gabled roof of the Marsten House.\n He gazed at it, fascinated. Warring emotions crossed his face with kaleidoscopic swiftness.\n \u0027Still here,\u0027 he murmured aloud. \u0027By God.\u0027\n He looked down at his arms. They had broken out in goose flesh.\n 2\n He deliberately skirted town, crossing into Cumberland and then coming back into \u0027salem\u0027s Lot from the west, taking the Burns Road. He was amazed by how little things had changed out here. There were a few new houses he didn\u0027t remember, there was a tavern called Dell\u0027s just over the town line, and a pair of fresh gravel quarries. A good deal of the hardwood had been pulped over. But the old tin sign pointing the way to the town dump was still there, and the road itself was still unpaved, full of chuckholes and wash?boards, and he could see Schoolyard Hill through the slash in the trees where the Central Maine Power pylons ran on a northwest to southeast line. The Griffen farm was still there, although the barn had been enlarged. He wondered if they still bottled and sold their own milk. The logo had been a smiling cow under the name brand: \u0027Sunshine Milk from the Griffen Farms!\u0027 He smiled. He had splashed a lot of that milk on his corn flakes at Aunt Cindy\u0027s house.\n He turned left onto the Brooks Road, passed the wrought-iron gates and the low fieldstone wall surrounding Harmony Hill Cemetery, and then went down the steep grade and started up the far side - the side known as Marsten\u0027s Hill.\n At the top, the trees fell away on both sides of the road. On the right, you could look right down into the town proper - Ben\u0027s first view of it. On the left, the Marsten House. He pulled over and got out of the car.\n It was just the same. There was no difference, not at all. He might have last seen it yesterday.\n The witch grass grew wild and tall in the front yard, obscuring the old, frost-heaved flagstones that led to the porch. Chirring crickets sang in it, and he could see grass?hoppers jumping in erratic parabolas.\n The house itself looked toward town. it was huge and rambling and sagging, its windows haphazardly boarded shut, giving it that sinister look of all old houses that have been empty for a long time. The paint had been weathered away, giving the house a uniform gray look. Windstorms had ripped many of the shingles off, and a heavy snowfall had punched in the west corner of the main roof, giving it a slumped, hunched look. A tattered no-trespassing sign was nailed to the right-hand newel post.\n He felt a strong urge to walk up that overgrown path, past the crickets and hoppers that would jump around his shoes, climb the porch, peek between the haphazard boards into the hallway or the front room. Perhaps try the front door. If it was unlocked, go in.\n He swallowed and stared up at the house, almost hypno?tized. It stared back at him with idiot indifference.\n You walked down the hall, smelling wet plaster and rotting wallpaper, and mice would skitter in the walls. There would still be a lot of junk lying around, and you might pick something up, a paperweight maybe, and put it in your pocket. Then, at the end of the hall, instead of going through into the kitchen, you could turn left and go up the stairs, your feet gritting in the plaster dust which had sifted down from the ceiling over the years. There were fourteen steps, exactly fourteen. But the top one was smaller, out of proportion, as if it had been adde to avoi the evil number. At the top of the stairs you stand on the landing, looking down the hall toward a closed door. And if you walk down the hall toward it, watching as if from outside yourself as the door gets closer and larger, you can reach out your hand and put it on the tarnished silver knob -\n He turned away from the house, a straw-dry whistle of air slipping from his mouth. Not yet. Later, perhaps, but not yet. For now it was enough to know that all of that was still here. It had waited for him. He put his hands on the hood of his car and looked out over the town. He could find out down there who was handling the Marsten House, and perhaps lease it. The kitchen would make an adequate writing room and he could bunk down in the front parlor. But he wouldn\u0027t allow himself to go upstairs.\n Not unless it had to be done.\n He got in his car, started it, and drove down the hill to Jerusalem\u0027s Lot. \n","sourceLink":"https://allnovel.net/salem-s-lot/page-3.html","bookId":2573,"book":{"id":2573,"title":"\u0027Salem\u0027s Lot","description":"Storyline: \n Something strange is going on in Jerusalem\u0027s Lot ... but no one dares to talk about it. By day, \u0027Salem\u0027s Lot is a typical modest New England town; but when the sun goes down, evil roams the earth. The devilishly sweet insistent laughter of a child can be heard echoing through the fields, and the presence of silent looming spirits can be felt lurking right outside your window. Stephen King brings his gruesome imagination to life in this tale of spine tingling horror.\n \n","cover":"https://allnovel.net/images/salem-s-lot.jpg","author":"Stephen King","type":"Horror","source":"allnovel","link":"https://allnovel.net/salem-s-lot.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:00:27 PM"}}
