{"id":83260,"no":2,"title":"Page 2","content":"\"No,\" Darleen said firmly. \"I\u0027m through with him. He\u0027s the meanest man I\u0027ve ever known, and by Christ I can\u0027t understand what I ever saw in him!\"\n Swan recalled that she\u0027d said the same thing about both \"Uncle\" Rick and \"Uncle\" alex. She paused thoughtfully, trying to decide whether to ask the question or not, and then she drew a deep breath and said, \"Is it true, Mamai What Tommy said about you not knowing who my daddy really wasi\"\n \"Don\u0027t you say that!\" she snapped. She riveted her attention on the long ribbon of road. \"Don\u0027t you even think such a thing, young lady! I\u0027ve told you before: Your daddy\u0027s a famous rock \u0027n\u0027 roll star. He\u0027s got blond, curly hair and blue eyes like yours. The blue eyes of an angel dropped to earth. and can he play a guitar and sing! Can birds flyi Lord, yes! and I\u0027ve told you time and again that as soon as he divorces his wife we\u0027re going to go out and live in Hollywood, California. Won\u0027t that be somethin\u0027i You and me on that Sunset Stripi\"\n \"Yes, ma\u0027am,\" Swan said listlessly. She\u0027d heard that story before. all Swan wanted was to live in one place for more than four or five months, so she could make friends she wouldn\u0027t be afraid of losing, and go to the same school for a whole year. Because she had no friends, she turned all her energy and attention to her flowers and plants, spending hours creating gardens in the rough earth of trailer parks, boarding houses and cheap motels.\n \"Let\u0027s get us some music on the radio,\" Darleen said. She switched it on, and rock \u0027n\u0027 roll blared from the speakers. The volume was turned so loud that Darleen didn\u0027t have to think about the lie that she\u0027d told her daughter time and again; in truth, she only knew that he was a tall, blond hunk whose rubber had broken in mid-thrust. It hadn\u0027t mattered at the time; a party was going on, and in the next room everybody was raising hell, and both Darleen and the hunk were flying high on a mixture of LSD, angel dust and poppers. That had been when she was living in Las Vegas nine years ago, working as a blackjack dealer, and since then she and Swan had lived all over the west, following men who promised to be fun for a while or taking jobs as a topless dancer wherever she could find them.\n Now, though, Darleen didn\u0027t know where they were going. She was sick of Tommy, but she was afraid of him, too; he was too crazy, too mean. It was likely he\u0027d come after them in a day or so if she didn\u0027t get far enough away. Frankie, at the High Noon Saloon where she danced, might advance her some money on her next paycheck, but then wherei\n Home, she thought. Home was a little speck called Blakeman, up in Rawlins County in the northwest corner of Kansas. She\u0027d run away when she was sixteen, after her mother had died of cancer and her father had started going crazy on religion. She knew the old man hated her, and that\u0027s why she\u0027d left. What would home be like now, she wondered. She imagined her father would drop his teeth when he found out he had a granddaughter. Hell, no! I can\u0027t go back there!\n But she was already calculating the route she would take if she did decide to go to Blakeman: north on 135 to Salina, west through the sweeping corn and wheat fields on Interstate 70, north again on arrow-straight country roads. She could get enough money from Frankie to pay for the gas. \"How\u0027d you like to take a trip in the mornin\u0027i\"\n \"Where toi\" She clutched the Cookie Monster tighter.\n \"Oh, just somewhere. a little town called Blakeman. Not much going on, the last time I was there. Maybe we could go there and rest for a few days. Get our heads together and think. Righti\"\n Swan shrugged. \"I guess,\" she said, but she didn\u0027t care one way or the other.\n Darleen turned the radio down and put her arm around her daughter. Looking up, she thought she saw a glimmer of light in the sky, but then it was gone. She squeezed Swan\u0027s shoulder. \"Just you and me against the world, kid,\" she said. \"and know whati We\u0027re gonna win out yet, if we just keep on sluggin\u0027.\"\n Swan looked at her mother and wanted - wanted very badly - to believe.\n The Camaro continued into the night along the unfolding highway, and in the clouds hundreds of feet above, living chains of light linked across the heavens. \n Five\n 11:50 P.M. Mountain Daylight Time\n Blue Dome Mountain, Idaho\n a gunmetal gray Ford Roamer recreational vehicle climbed the narrow, winding road that led to the top of Blue Dome Mountain, eleven thousand feet above sea level and sixty miles northwest of Idaho Falls. On both sides of the road, dense pine forests clung to harsh ribs of stone. The RV\u0027s headlights bored holes in a low-lying mist, and the lights of the instrument panel glowed green on the drawn, tired face of the middle-aged man behind the wheel. In the reclined seat beside him, his wife was sleeping with a map of Idaho unfolded on her lap.\n On the next long curve, the headlights hit a sign on the roadside that said, in bright orange luminescent letters: PRIVaTE PROPERTY. TRESPaSSERS WILL BE SHOT.\n Phil Croninger slowed the RV, but he had the plastic ID card they\u0027d mailed him in his wallet, so he kept going past the forbidding sign and onward up the mountain road.\n \"Would they really do that, Dadi\" his son asked, in a reedy voice, from the seat behind him.\n \"Do whati\"\n \"Shoot trespassers. Would they reallyi\"\n \"You know it. They don\u0027t want anybody up here who doesn\u0027t belong.\" He glanced at the rearview mirror and caught his son\u0027s green-daubed face floating like a Halloween mask over his shoulder. Father and son closely resembled each other; they both wore thick-lensed eyeglasses, had thin, lank hair and were slight and bony. Phil\u0027s hair was threaded with gray and was receding rapidly, and the thirteen-year-old boy\u0027s was dark brown, cut in straight bangs to hide the height of his forehead. The boy\u0027s face was a study in sharp angles, like his mother\u0027s; his nose, chin and cheekbones all seemed to be about to slice through his pallid skin, as if a second face were underneath the first and on the edge of being revealed. His eyes, magnified slightly by the lenses, were the color of ashes. He wore a T-shirt done in military camouflage colors, a pair of khaki shorts and hiking boots.\n Elise Croninger stirred. \"are we there yeti\" she asked sleepily.\n \"almost. We should see something pretty soon.\" It had been a long, tiring trip from Flagstaff, and Phil had insisted on traveling at night because, by his calculations, the cooler temperatures were kinder on the tires and boosted gas mileage. He was a careful man who took no chances.\n \"I\u0027ll bet they\u0027re looking at us right now with radar.\" The boy stared toward the woods. \"I\u0027ll bet they\u0027re really taking us apart.\"\n \"Could be,\" Phil agreed. \"They\u0027ve got about everything you can think of up here. It\u0027s a terrific place, wait\u0027ll you see it!\"\n \"I hope it\u0027s cool in there,\" Elise said irritably. \"God knows I didn\u0027t come all this way to cook in a mine shaft.\"\n \"It\u0027s not a mine shaft,\" Phil reminded her. \"anyway, it\u0027s naturally cool, and they\u0027ve got all sorts of air-filtration systems and safety stuff. You\u0027ll see.\"\n The boy said, \"They\u0027re watching us. I can feel them watching us.\" He felt under his seat for what he knew was hidden there, and his hand came out with a .357 Magnum. \"Bang!\" he said, and he clicked the trigger toward the dark woods on his right. and another \"Bang!\" to the left.\n \"Put that thing down, Roland!\" his mother told him.\n \"Put it away, son. We don\u0027t want it out in the open.\"\n Roland Croninger hesitated and grinned slyly. He pointed the gun at the center of his mother\u0027s head, pulled the trigger and said quietly, \"Bang.\" and then a \"Bang\" and a click of the trigger at his father\u0027s skull.\n \"Roland,\" his father said in what passed for a stern voice, \"stop kidding around, now. Put the gun away.\"\n \"Roland!\" his mother warned.\n \"aw, heck!\" He shoved the weapon back under the seat. \"I was just having some fun! You two take everything too seriously!\"\n There was a sudden jolt as Phil Croninger planted his foot on the brake pedal. Two men in green helmets and camouflage uniforms were standing in the middle of the road; both of them were holding Ingram submachine guns and had .45s in holsters at their waists. The Ingram guns were pointed right at the RV\u0027s windshield.\n \"Jesus,\" Phil whispered. One of the soldiers motioned for him to roll down the window; when Phil had done so, the soldier stepped around to his side of the RV, snapped on a flashlight and shone it in his face. \"ID, please,\" the soldier said; he was a young man with a hard face and electric blue eyes. Phil brought out his wallet and the ID card and handed it to the young man, who examined Phil\u0027s photograph on the card. \"How many coming in, siri\" the soldier asked.\n \"Uh... three. Me, my wife and son. We\u0027re expected.\"\n The young man gave Phil\u0027s card to the other soldier, who undipped a walkie-talkie from his utility belt. Phil heard him say, \"Central, this is Checkpoint. We\u0027ve got three coming up in a gray recreational vehicle. Name on the card\u0027s Philip austin Croninger, computer number 0-671-4724. I\u0027ll hold for confirmation.\"\n \"Wow!\" Roland whispered excitedly. \"This is just like the war movies!\"\n \"Shhhh,\" his father warned.\n Roland admired the soldiers\u0027 uniforms; he noted that the boots were spit-shined and the camouflage trousers still held creases. above each soldier\u0027s heart was a patch that depicted an armored fist gripping a lightning bolt, and below the symbol was \"Earth House,\" stitched in gold.\n \"Okay, thank you, Central,\" the soldier with the walkie-talkie said. He returned the card to the other one, who handed it to Phil. \"There you go, sir. Your ETa was 10:45.\"\n \"Sorry.\" Phil took the card and put it away in his wallet. \"We stopped for a late dinner.\"\n \"Just follow the road,\" the young man explained. \"about a quarter mile ahead you\u0027ll see a stop sign. Make sure your tires are lined up with the marks. Okayi Drive on.\" He gave a quick motion with his arm, and as the second soldier stepped aside Phil accelerated away from the checkpoint. When he glanced in the sideview mirror again, he saw the soldiers reentering the forest.\n \"Does everybody get a uniform, Dadi\" Roland asked.\n \"No, I\u0027m afraid not. Just the men who work here wear uniforms.\"\n \"I didn\u0027t even see them,\" Elise said, still nervous. \"I just looked up and there they were. They were pointing those guns right at us! What if one had gone offi\"\n \"These people are professionals, hon. They wouldn\u0027t be here if they didn\u0027t know what they were doing, and I\u0027m sure all of them know how to handle guns. That just shows you how secure we\u0027re going to be for the next two weeks. Nobody can get up here who doesn\u0027t belong. Righti\"\n \"Right!\" Roland said. He had experienced a thrill of excitement when he\u0027d looked down the barrels of those two Ingram guns; if they\u0027d wanted to, he thought, they could\u0027ve blown us all away with a single burst. One squeeze of the trigger and zap! The feeling left him amazingly invigorated, as if cold water had been splashed in his face. That was good, he thought. Very good. One of the qualities of a King\u0027s Knight was to take danger in stride.\n \"There\u0027s the stop sign,\" Phil told them as the headlights hit it, dead ahead. The large sign was affixed to a wall of rough, jagged rock that ended the mountain road. around them were only dark woods and the rise of more rocky walls; there was no sign of the place they had come from Flagstaff to find.\n \"How do you get insidei\" Elise asked.\n \"You\u0027ll see. This was one of the neatest things they showed me.\" Phil had been here in april, after he\u0027d read an advertisement for Earth House in Soldier of Fortune magazine. He slowly guided the Roamer forward until its front tires sank into two grooves in the earth and triggered a pair of latches. almost immediately, there was a deep rumbling sound - the noise of heavy machinery, gears and chains at work. a crack of fluorescent light appeared at the base of the rock wall; a section of it was smoothly ascending, like the door of the Croninger garage at home.\n But to Roland Croninger it looked like the opening of a massive portal into a medieval fortress. His heart had begun to pound, and the crack of fluorescent light reflected in the lenses of his glasses grew wider and brighter.\n \"My God,\" Elise said softly. The rock wall was opening to reveal a concrete-floored parking deck, its spaces filled with cars and other recreational vehicles. a row of lights hung from a gridwork of iron beams at the ceiling. In the doorway stood a uniformed soldier, waving Phil to come ahead; he eased forward, the grooves guiding the Roamer down a concrete ramp and onto the parking deck. as soon as the tires had disengaged the latches again, the doorway began to rumble shut.\n The soldier motioned Phil along to a parking place between two other campers and made a gesture with a finger across his throat.\n \"What\u0027s that meani\" Elise asked uneasily.\n Phil smiled. \"He\u0027s telling us to cut the engine.\" He did. \"We\u0027re here, gang.\"\n The rock doorway closed with a solid, echoing thunk, and the outside world was sealed off.\n \"We\u0027re in the army now!\" Phil told his son, and the boy\u0027s expression was one of dreamy amazement. as they got out of the Roamer two electric carts pulled up; in the first one was a smiling young man, his hair sandy brown and clipped in a crewcut, wearing a dark blue uniform with the Earth House insignia on his breast pocket. The second cart carried two husky men in dark blue jumpsuits and pulled a flat luggage trailer like those used at airports.\n The smiling young man, whose white teeth seemed to reflect the fluorescent lighting, checked the information on his clipboard to make sure he had the name right. \"Hi, folks!\" he said cheerfully. \"Mr. and Mrs. Philip Croningeri\"\n \"Right,\" Phil said. \"and our son, Roland.\"\n \"Hi, Roland. You folks have a good trip from Flagstaffi\"\n \"a long trip,\" Elise told him; she gawked around at the parking deck, figuring that there were well over two hundred cars. \"My God, how many people are herei\"\n \"We\u0027re about ninety-five percent of capacity, Mrs. Croninger. We figure to be a hundred percent by the weekend. Mr. Croninger, if you\u0027ll give these two gentlemen your keys, they\u0027ll bring your luggage along for you.\" Phil did, and the two men began to unload suitcases and boxes from the Roamer.\n \"I\u0027ve got computer equipment,\" Roland told the young man. \"It\u0027ll be okay, won\u0027t iti\"\n \"Sure will. You folks just hop aboard here and I\u0027ll take you to your quarters. Corporal Mathisi\" he said, addressing one of the baggage-handlers, \"Those go to Section C, Number Sixteen. You folks readyi\" Phil had gotten into the front passenger\u0027s seat, and his wife and son in the back. Phil nodded, and the young man drove them across the parking deck and into a corridor - concrete-floored and lined with lights - that angled gently downward. a cool breeze circulated from an occasional strategically placed ceiling fan. Other corridors branched off from the first, and there were arrows that pointed to Sections a, B and C.\n \"I\u0027m Hospitality Sergeant Schorr.\" The young man offered his hand, and Phil shook it. \"Glad to have you with us. are there any questions I can answer for youi\"\n \"Well, I\u0027ve taken the tour - back in april - and I know about Earth House,\" Phil explained, \"but I don\u0027t think my wife and son got the full impact from the pamphlets. Elise was worried about the air circulation down here.\"\n Schorr laughed. \"Not to worry, Mrs. Croninger. We\u0027ve got two state-of-the-art air-filtration systems, one on-line and one backup. The system would power up within one minute of a Code Red - that\u0027s when we\u0027re... uh... expecting impact and we seal the vents. Right now, though, the fans are drawing in plenty of air from outside, and I can guarantee you that the air on Blue Dome Mountain is probably the cleanest you\u0027ll ever breathe. We\u0027ve got three living areas - Sections a, B and C - on this level, and underneath us is the Command Center and Maintenance Level. Down there, fifty feet below us, is the generator room, the weapons supply, the emergency food and water supply, the radar room and the officers\u0027 quarters. By the way, we have a policy of storing all incoming firearms in our weapons supply. Did you happen to have any with youi\"\n \"Uh... a .357 Magnum,\" Phil said. \"Under the back seat. I didn\u0027t know about that policy.\"\n \"Well, I\u0027m sure you overlooked it in the contract you signed, but I think you\u0027ll agree all firearms should be localized for the safety of Earth House residents. Righti\" He smiled at Phil, and Phil nodded. \"We\u0027ll code it and give you a receipt, and when you leave us in two weeks you\u0027ll get it back cleaned and shining.\"\n \"What lands of weapons do you have down therei\" Roland asked eagerly.\n \"Oh, pistols, automatic rifles, submachine guns, mortars, flamethrowers, grenades, antipersonnel and antivehicle mines, flares - about everything you can think of. and of course we keep our gas masks and antiradiation suits down there, too. When this place was put together, Colonel Macklin wanted it to be an impregnable fortress, and that\u0027s exactly what it is.\"\n Colonel Macklin, Roland thought. Colonel James \"Jimbo\" Macklin. Roland was familiar with the name through articles in the survivalist and weaponry magazines that his father subscribed to. Colonel Macklin had a long record of success as a 105-D Thunderchief pilot over North Vietnam, had been shot down in 1971 and had been a POW until the end of the war; then he\u0027d gone back into Vietnam and Indochina looking for MIas, and had fought with soldiers of fortune in South africa, Chad and Lebanon. \"Will we get to meet Colonel Macklini\"\n \"Orientation is at 0800 hours sharp, in the Town Hall. He\u0027ll be there.\"\n They saw a sign reading SECTION C with an arrow pointing to the right. Sergeant Schorr turned off the main corridor, and the tires jubbled over bits of concrete and rock that littered the floor. Water was dripping from above into a widening puddle, and it wet all of them before Schorr could brake the cart. Schorr looked back, his smile slipping; he stopped the cart, and the Croningers saw that part of the ceiling the size of a manhole cover had collapsed. Exposed in the hole were iron bars and chickenwire. Schorr took a walkie-talkie from the cart\u0027s dash, clicked it on and said, \"This is Schorr, near the junction of Central and C corridors. I\u0027ve got a drainage problem here, need a cleanup crew on the double. You read mei\"\n \"Read you,\" a voice replied, weakened by static. \"Trouble againi\"\n \"Uh... I\u0027ve got new arrivals with me, Corporal.\"\n \"Sorry, sir. Cleanup crew\u0027s on the way.\"\n Schorr switched off the walkie-talkie. His smile returned, but his light brown eyes were uneasy. \"Minor problem, folks. Earth House has a top-line drainage system, but sometimes we get these minor leaks. Cleanup crew\u0027ll take care of it.\"\n Elise pointed upward; she\u0027d noticed the jigsaw of cracks and patches in the ceiling. \"That doesn\u0027t look too safe. What if that thing falls ini\" She looked wide-eyed at her husband. \"My God, Phil! are we supposed to stay here for two weeks under a leaking mountaini\"\n \"Mrs. Croninger,\" Schorr said in his most soothing voice, \"Earth House wouldn\u0027t be at ninety-five percent capacity if it wasn\u0027t safe. Now I agree, the drainage system needs work, and we are getting it in shape, but there is absolutely no danger. We\u0027ve had structural engineers and stress specialists inspect Earth House, and all of them gave it the okay. This is a survivalist condominium, Mrs. Croninger; we wouldn\u0027t be here if we didn\u0027t want to survive the coming holocaust, righti\"\n Elise glanced back and forth between her husband and the young man. Her husband had paid fifty thousand dollars for membership in the Earth House timesharing plan: two weeks every year, for life, in what the pamphlets called a \"luxurious survivalist fortress in the mountains of southern Idaho.\" Of course, she believed the nuclear holocaust was coming soon, too; Phil had shelves of books on nuclear war and was convinced that it would happen within a year, and that the United States would be driven to its knees by the Russian invaders. He had wanted to find a place, as he told her, to \"make a last stand.\" But she\u0027d tried to talk him out of it, telling him that he was betting fifty thousand dollars that nuclear disaster would happen during one of their two-week timesharing periods, and that was a pretty crazy gamble. He\u0027d explained to her the \"Earth House Protection Option\" which meant that, for an extra five thousand dollars a year, the Croninger family could find refuge in Earth House at any time, within twenty-four hours of the detonation of an enemy-fired nuclear missile within the continental United States. It was holocaust insurance, he\u0027d told her; everybody knew the bombs were going to fall, it was just a question of when. and Phil Croninger was very aware of the importance of insurance, because he owned one of the largest independent insurance agencies in arizona.\n \"I suppose,\" she finally said. But she was troubled by those cracks and patches, and by the sight of that flimsy chickenwire sticking out of the new hole.\n Sergeant Schorr accelerated the electric cart. They passed metal doorways on both sides of the corridor. \"Must\u0027ve cost a lot of money to build this place,\" Roland said, and Schorr nodded.\n \"a few million,\" Schorr said. \"Not counting loose change. a couple of brothers from Texas put the money into it; they\u0027re survivalists too, and they got rich off oil wells. This place used to be a silver mine back in the forties and fifties, but the lode ran out, and it just sat here for years until the ausleys bought it. Here we are, just ahead.\" He slowed the cart and stopped in front of a metal door marked Sixteen. \"Your home sweet home for the next two weeks, folks.\" He opened the door with a key affixed to an Earth House insignia key chain, reached inside and switched on the lights.\n Before she followed her husband and son over the threshold, Elise Croninger heard the sound of water dripping, and she saw another puddle spreading in the corridor. The ceiling was leaking in three places, and there was a long, jagged crack two inches wide. Jesus! she thought, unnerved, but she stepped into the room anyway.\n Her first impression was of the starkness of a military barracks. The walls were beige-painted cinder block, decorated with a few oil paintings. The carpet was thick enough, and not a bad color of rust red, but the ceiling seemed awfully low to her. Though it cleared Phil\u0027s head by about six inches, and he was five feet eleven, the apparent lack of height in the suite\u0027s \"living area,\" as the pamphlets had called it, made her feel almost... yes, she thought, almost entombed. One nice touch, though, was that the entire far wall was a photographic mural of snow-capped mountains, opening up the room a little, if just by optical illusion.\n There were two bedrooms and a single bathroom connecting them. Sergeant Schorr took a few minutes to show them around, demonstrating the whooshing toilet that flushed upward to a tank, he said, that \"delivered the waste materials to the forest floor and so aided the vegetation growth. \"The bedrooms were also of beige-painted cinder block, and the ceilings were made of cork tile that presumably, Elise thought, hid the latticework of iron beams and reinforcing rods.\n \"It\u0027s great, isn\u0027t iti\" Phil asked her. \"Isn\u0027t this somethingi\"\n \"I\u0027m not sure yet,\" she replied. \"I still feel like I\u0027m in a mine shaft.\"\n \"Oh, that\u0027ll pass,\" Schorr told her amiably. \"Some of the first-timers get claustrophobia, but it wears off. Let me give you this,\" he said, and he handed Phil an Earth House map that unfolded to show the cafeteria, the gymnasium, the infirmary, and the arcade game room. \"The Town Hall\u0027s right here,\" he said, and he pointed on the map. \"It\u0027s really just an auditorium, but we figure we\u0027re a community down here, righti Let me show you the quickest way to get there from here...\"\n In his bedroom, the smaller of the two, Roland had switched on the bedside lamp and was scouting a suitable electrical outlet for his computer. The room was small, but he thought it was okay; it was the atmosphere that was important, and he looked forward to the seminars on \"Improvised Weapons,\" \"Living off the Land,\" \"Governments in Chaos,\" and \"Guerrilla Tactics\" that the pamphlets had promised.\n He found a good outlet, near enough to the bed so he could prop himself up on pillows while he programmed the King\u0027s Knight game on his computer. In the next two weeks, he thought, he was going to dream up dungeons and monsters to roam them that would make even an expert, jaded King\u0027s Knight like himself tremble in his jambeaus.\n Roland went to the closet and opened it to see how much room he had to store his stuff. The inside was cheaply paneled, a few wire hangers dangling from the rod. But something small and yellow suddenly flitted like an autumn leaf from the back of the closet. Roland instinctively reached out and caught it, closing his fingers around it. Then he walked over to the light and carefully opened his palm.\n Lying stunned in his hand was a fragile yellow butterfly with streaks of green and gold along its wings. Its eyes were dark green pinheads, like gleaming emeralds. The butterfly fluttered, weak and dazed.\n How long have you been in there, Roland wondered. No telling. Probably came in on somebody\u0027s car or camper, or in their clothes. He lifted his hand closer to his face and stared for a few seconds into the creature\u0027s tiny eyes.\n and then he crushed the butterfly in his fist, feeling the body smear under the power of his grip. Zap! he thought. Super Zap! He sure hadn\u0027t come all the way from Flagstaff, he told himself, to share a room with a fucking yellow bug!\n He dropped the mangled remnant into a wastebasket, then wiped the iridescent yellow sparkle from his palm onto his khakis and went back to the living room. Schorr was saying goodnight, and the other two men had just arrived with the luggage and Roland\u0027s computer gear.\n \"Orientation at 0800, folks!\" Schorr said. \"See you there!\"\n \"Great,\" Phil Croninger said excitedly.\n \"Great.\" Elise\u0027s voice delivered the jab of sarcasm. Sergeant Schorr, smile still locked in place, left Number Sixteen. But the smile disappeared as he stepped into the electric cart, and his mouth became a grim, rigid line. He turned the cart around and raced back to the area where the rubble lay on the floor, and he told the cleanup crew that they\u0027d better move their asses to patch those cracks - and this time keep them patched - before the whole goddamned section fell apart. \n TWO\n Burning Spears\n Six\n July 17\n 4:40 a.M. Eastern Daylight Time\n New York City\n \"He\u0027s still in there, ain\u0027t hei\" the black woman with orange hair asked in a whisper, and the Hispanic boy behind the candy counter nodded.\n \"Listen!\" the boy, whose name was Emiliano Sanchez, said, and his dark eyes widened.\n From beyond the faded red curtains that led into the auditorium of the Empire State Theater on Forty-second Street there came a laugh. It was a sound someone with a slashed throat might have made. The sound of it grew louder and higher, and Emiliano put his hands to his ears; the laughter had reminded him of a locomotive whistle and a child\u0027s shriek, and for a few seconds he was back in time, eight years old and living in Mexico City, witnessing his kid brother being struck and killed by a freight train.\n Cecily stared at him, and as the laughter rose in volume she heard a girl\u0027s scream in it, and she was fourteen years old and lying on the abortionist\u0027s table as the job was done. The vision was gone in an instant, and the laughter began to fade. \"Jesus Christ!\" Cecily managed to say, whispering again. \"What\u0027s that bastard smokin\u0027i\"\n \"I been listenin\u0027 to that since midnight,\" he told her. His shift had started at twelve and would continue until eight. \"You ever hear anythin\u0027 like iti\"\n \"He alone in therei\"\n \"Yeah. Few people come in, but they couldn\u0027t take it neither. Man, you shoulda seen their faces when they come out! Give you the creeps!\"\n \"Shit, man!\" Cecily said. She was the ticket-seller and worked in the booth out front. \"I couldn\u0027t stand to sit through two minutes of that movie, all them dead folks and such! Lordy, I sold that guy his ticket three shows ago!\"\n \"He come out, bought a large Coke and buttered popcorn. Tipped me a buck. But I tell you, I almost didn\u0027t wanna touch the money. It looked... greasy or somethin\u0027.\"\n \"Bastard\u0027s prob\u0027ly playin\u0027 with hisself in there. Prob\u0027ly lookin\u0027 at all them dead, messed-up faces and playin\u0027 with hisself! Somebody ought to go in there and tell him to - \"\n The laughter swelled again. Emiliano flinched; the noise now reminded him of the cry of a boy he\u0027d once gut-stabbed in a knife fight. The laughter broke and burbled, became a soft cooing that made Cecily think of the sounds the addicts made in the shooting gallery she frequented. Her face was frozen until the laughter went away, and then she said, \"I believe I\u0027ve got things to do.\" She turned away and hurried to the ticket booth, where she locked the door. She\u0027d figured that the guy inside the theater was going to be weird when she saw him: He was a big, husky Swedish-looking man with curly blond hair, milk-white skin and eyes like cigarette burns. as he bought his ticket he\u0027d stared notes through her and never said a word. Weird, she thought, and she picked up her People magazine with trembling fingers.\n Come on, eight o\u0027clock! Emiliano pleaded. He checked his wristwatch. In a few minutes, The Face of Death, Part Four would be ending, and Willy, the old drunk of a projectionist, would be changing the reels upstairs for Mondo Bizarro, which showed bondage scenes and such. Maybe the guy would leave when the picture changed. Emiliano sat on his stool and continued reading his Conan comic book, trying to shut off the bad memories that had been stirred up by the laughter from within.\n The red curtains moved. Emiliano hunched his shoulders as if about to be beaten. Then the curtains parted, and the man who liked movies emerged into the dingy lobby. He\u0027s leaving! Emiliano almost grinned, his gaze glued to the comic book. He\u0027s goin\u0027 out the door!\n But the man who liked movies said in a soft, almost childlike voice, \"I\u0027d like a large Coke and a tub of buttered popcorn, please.\"\n Emiliano\u0027s stomach clenched. Without letting himself look into the man\u0027s face, he got off his stool, drew the Coke into a cup from the dispenser, got the popcorn and splashed butter into it.\n \"More butter, please,\" the man who liked movies requested.\n Emiliano gave the popcorn another drool of butter and slid it and the Coke across the counter. \"Three bucks,\" he said. a five dollar bill was pushed toward him. \"Keep the change,\" the man said, and this time his voice had a Southern accent. Startled, Emiliano looked up.\n The man who liked movies stood about six four and was wearing a yellow T-shirt and green khaki trousers. Under thick black eyebrows, his eyes were hypnotically green against the amber hue of his flesh. Emiliano had already figured him to be South american as soon as he\u0027d walked in, maybe with some Indian blood in him, too. The man\u0027s hair was black and wavy, cut close to the skull. He stared fixedly at Emiliano. \"I want to see the movie again,\" he said quietly, and his voice carried what might\u0027ve been a Brazilian accent again.\n \"Uh... Mondo Bizarro\u0027s about to come on in a coupla minutes. Projection guy\u0027s prob\u0027ly got the first reel on - \"\n \"No,\" the man who liked movies said, and he smiled slightly. \"I want to see that movie again. Right now.\"\n \"Yeah. Well, listen. I mean... I don\u0027t make the decisions here, righti Y\u0027knowi I just work behind the counter. I don\u0027t have any say-so about - \" and then the man reached out and touched Emiliano\u0027s face with cold, butter-smeared fingers, and Emiliano\u0027s jaw seized up as if it had frozen solid.\n The world seemed to spin around him for a second, and his bones were a cage of ice. Then he blinked and his whole body trembled, and he was standing behind the counter and the man who liked movies was gone. Damn! he thought. Bastard touched me! He grabbed a paper napkin and wiped his face where the fingers had been, but he could still feel the chill they\u0027d left. The five dollar bill remained on the countertop. He put it in his pocket and came out from behind the counter, and he peeked through the curtains into the theater.\n On the screen, in glorious and gory color, were blackened corpses being pulled from the wreckage of cars by firemen. The narrator was saying, \"Face of Death will pull no punches. Everything you see will be real. If you are in any way squeamish, you should now be on your way out...\"\n The man who liked movies was sitting in the front row. Emiliano could see the outline of his head against the screen. The laughter began, and as Emiliano backpedaled away from the curtains he looked dumbly at his wristwatch and realized that almost twenty minutes of his life was a black hole. He went through a door and up a flight of stairs to the projection booth, where Willy sat sprawled on a couch reading Hustler.\n \"Hey!\" Emiliano said. \"What\u0027s goin\u0027 on, mani How come you showin\u0027 that shit againi\"\n Willy stared at him for a moment over the edge of the magazine. \"You lost your marbles, kidi\" he inquired. \"You and your friend just come up here and asked me to. Wasn\u0027t fifteen minutes ago. So I put it back on. Don\u0027t mean shit to me, one way or the other. anyway, I don\u0027t argue with no old perverts.\"\n \"Old pervertsi What\u0027re you talkin\u0027 about, mani\"\n \"Your friend,\" Willy said. \"Guy must be seventy years old. Beard makes him look like Rip Van Winkle. Where do these perverts come fromi\"\n \"You\u0027re... crazy,\" Emiliano whispered. Willy shrugged and returned to his reading.\n Outside, Cecily looked up as Emiliano ran into the street. He glanced back at her, shouted, \"I ain\u0027t stayin\u0027 in there! No way! I quit!\" and ran away along Forty-second Street and into the gloom. Cecily crossed herself, rechecked the lock on the ticket booth\u0027s door and prayed for dawn.\n In his seat in the front row, the man who liked movies dug a hand into his buttered popcorn and stuffed his mouth full. Before him were scenes of broken bodies being extracted from the rubble of a London building bombed by Irish terrorists. He cocked his head to one side, appreciating the sight of crushed bones and blood. The camera, blurred and unsteady, focused on the frantic face of a young woman as she cradled a dead child.\n The man who liked movies laughed as if he were watching a comedy. In the sound of that laughter was the shriek of napalm bombs, incendiary rockets and Tomahawk missiles; it echoed through the theater, and if other people had been sitting there each one would have squirmed with the memory of a private terror.\n and in the reflected light from the screen, the man\u0027s face was undergoing a transformation. No longer did he look Swedish, or Brazilian, or have a gray Rip Van Winkle beard; his facial features were running together like the slow melting of a wax mask, the bones shifting beneath the skin. The features of a hundred faces rose and fell like suppurating sores. as the screen showed an autopsy in close-up progress, the man clapped his hands together with merry glee.\n almost time! he thought. almost time for the show to start!\n He\u0027d been waiting a long time for the curtain to rise, had worn many skins and many faces, and the moment was soon, very soon. He\u0027d watched the lurch toward destruction through many eyes, had smelled fire and smoke and blood in the air like intoxicating perfumes. The moment was soon, and the moment would belong to him.\n Oh, yes! almost time for the show to start!\n He was a creature of patience, but now he could hardly keep himself from dancing. Maybe a little Watusi up the aisle would be in order, and then he\u0027d slamdance that cockroach behind the candy counter. It was like waiting for a birthday party, and when the candles were lit he would rear his head back and roar loud enough to stagger God.\n almost time! almost time!\n But where would it starti he wondered. Who would push the first buttoni No matter; he could almost hear the fuse crackling and the flame drawing near. It was the music of the Golan Heights, of Beirut and Teheran, of Dublin and Warsaw, Johannesburg and Vietnam - only this time the music would end in a final, deafening crescendo.\n He stuffed popcorn into a mouth that opened greedily on his right cheek. Party down! he thought, and he giggled with a noise like grinding glass.\n Last night he\u0027d stepped off a Trailways bus from Philadelphia and, strolling down Forty-second Street, had seen that this film was playing. He took the opportunity to admire his performances in The Face of Death, Part Four whenever he could. Just in the background, of course, always part of the crowd, but he could always recognize himself. There was a good shot of him standing over a mass of corpses after the bombing of an Italian soccer stadium, looking suitably shocked; another brief glimpse showed him, wearing a different face, at an airport massacre in Paris.\n Lately he\u0027d been on tour, riding the bus from city to city, seeing america. There were so many terrorist groups and armed firebrands in Europe that his influence was hardly needed, though he\u0027d enjoyed helping plant that nice potent bomb in Beirut. He\u0027d stayed a while in Washington, but none of the theaters were showing The Face of Death, Part Four there. Still, Washington held so many possibilities, and when you mixed and mingled with Pentagon boys and cabinet members at some of those parties you never knew what you might stir up.\n It was all coming around to him now. He sensed the nervous fingers hovering near red buttons all over the world. Jet pilots would be scrambling, submarine commanders would be listening to their sonars, and old lions would be eager to bite. and the amazing thing was that they were doing it all themselves. It almost made him feel useless - but his starring role was coming around very soon.\n His only concern was that it wouldn\u0027t be finished yet, not even with all the lightning soon to strike. There might still be pockets of humanity left, and small towns struggling to survive in the dark like rats in a collapsed basement. He understood very well that the firestorms, the whirlwinds of radiation and black rain would destroy most of them, and the ones that remained would wish they were dead a thousand times over.\n and in the end, he would Watusi on their graves, too.\n It was almost time. Tick tock tick tock, he thought. Nothing ever stops the clock!\n He was a patient creature, but it had been a long wait. a few more hours would only whet his appetite, and he was very, very hungry. For the time being, he could enjoy watching himself in this fine film.\n Curtain\u0027s going up! he thought, and the mouth in the center of his forehead grinned before it disappeared into the flesh like a gray worm in damp ground.\n It\u0027s showtime! Seven\n 10:16 a.M. Eastern Daylight Time\n New York City\n a blue light was spinning. Cold rain came down, and a young man in a yellow rain slicker reached out his arms. \"Give her to me, lady,\" he said, his voice as hollow as if he were speaking from the bottom of a well. \"Come on. Let me have her.\"\n \"NO!\" Sister Creep shouted, and the man\u0027s face fragmented into pieces like the shattering of a mirror. She thrust out her hands to push it away, but then she was sitting up and the nightmare was whirling away in pieces like silver bats. The sound of her cry echoed back and forth between the walls of rough gray brick, and she sat staring at nothing for a moment as the sputtering of nerves shook her body.\n Oh, she thought when her head cleared, that was a bad one! She touched her clammy forehead and her fingers came away damp. That was close, she thought. The young demon in the yellow raincoat was there again, very near, and he almost got my...\n She frowned. Got my whati The thought was gone now; whatever it had been, it had flipped over to the dark side of her memory. She often dreamed of the demon in the yellow raincoat, and he was always wanting her to give him something. In the dream, a blue light was always flashing, hurting her eyes, and rain was hitting her in the face. Sometimes the surroundings seemed terribly familiar, and sometimes she almost - almost - knew what it was he wanted, but she knew he was a demon - or probably the Devil himself, trying to pull her away from Jesus - because her head pounded so badly after the dream was over.\n She didn\u0027t know what time it was, or whether it was day or night, but her stomach was rumbling with hunger. She had tried to sleep on a subway bench, but the noise of some shouting kids scared her, so she\u0027d trundled off with her bag in search of a more secure place. She\u0027d found it at the bottom of a ladder that descended in a darkened section of subway tunnel. about thirty feet beneath the main tunnel was a drainage pipe, large enough for her to move through if she stooped over. Dirty water streamed past her sneakers, and the tunnel was illuminated by an occasional blue utility lamp that showed the network of cables and pipes just overhead. The tunnel shook with the thunder of a subway train passing, and Sister Creep realized she was under the rails; but as she continued along the tunnel the noise of the trains faded to a polite, distant growl. She soon found evidence that this was a popular place for members of the Ragtag Nation - a beat-up old mattress pushed back into a cubbyhole, a couple of empty wine bottles and some dried human excrement. She didn\u0027t mind; she\u0027d seen worse. and so she\u0027d slept on the mattress until the nightmare of the demon in the yellow raincoat had awakened her; she was hungry, and she decided she\u0027d climb back up to the subway station to search for scraps in the garbage cans, maybe try to find a newspaper, too, to see if Jesus had come while she was sleeping.\n Sister Creep stood up, put the strap of her bag around her shoulder and left the cubbyhole. She started back along the tunnel, tinged by the dim blue glow of the utility bulbs, and hoped she\u0027d find a hot dog today. She\u0027d always been fond of hot dogs, with plenty of good spicy mus -\n The tunnel suddenly trembled.\n She heard the sound of concrete cracking. The blue lamps flickered, went dark and then brightened again. There was a noise like the howl of wind, or a runaway subway train speeding overhead. The blue lamps continued to brighten until the light was almost blinding, and Sister Creep squinted in the glare. She took three more uncertain steps forward; the utility bulbs began to explode. She put her hands up to shield her face, felt pieces of glass strike her arms, and she thought with sudden clarity: I\u0027ll sue somebody for this!\n In the next instant the entire tunnel whipped violently to one side, and Sister Creep fell into the stream of dirty water. Chunks of concrete and rock dust cascaded from the ceiling. The tunnel whipped back in the other direction with a force that made Sister Creep think her insides were tearing loose, and the concrete chunks hit her head and shoulders as her nostrils filled with grit. \"Lord Jesus!\" she shouted, about to choke. \"Oh, Lord Jesus!\"\n Sparks shot overhead as the cables began to rip free. She smelled the wet heat of steam and heard a pounding noise like the footsteps of a behemoth treading above her head. as the tunnel pitched and swayed Sister Creep clung to her bag, riding out the gut-twisting undulations, a scream straining behind her clenched teeth. a wave of heat passed over her, stealing her breath. God help me! she shrieked in her mind as she struggled for air. She heard something pop and tasted blood streaming from her nose. I can\u0027t breathe, oh sweet Jesus, I can\u0027t breathe! She gripped at her throat, opened her mouth and heard her own strangled scream wail away from her through the shivering tunnel. Finally her tortured lungs dragged in a breath of scorched air, and she lay curled up on her side in the darkness, her body racked with spasms and her brain shocked numb.\n The violent twisting motion of the tunnel had stopped. Sister Creep drifted in and out of consciousness, and through the haze came the distant roar of that runaway subway train again.\n Only now it was getting louder.\n Get up! she told herself. Get up! It\u0027s Judgment Day, and the Lord has come in His chariot to take the righteous up into the Rapture!\n But a calmer, clearer voice spoke, perhaps from the dark side of her memory, and it said: Bullshit! Something bad\u0027s happened up there!\n Rapture! Rapture! Rapture! she thought, forcing the wicked voice away. She sat up, wiped blood from her nose and drew in steamy, stifling air. The noise of the runaway train was closer. Sister Creep realized that the water she was sitting in had gotten hot. She grasped her bag and slowly rose to her feet. Everything was dark, and when Sister Creep felt the tunnel\u0027s walls her fingers found a crazy quilt of cracks and fissures.\n The roaring was much louder, and the air was heating up. The concrete against her fingers felt like city pavement at noon in august, ready to fry eggs sunny side up.\n Far away along the tunnel there was a flicker of orange light, like the headlamp on a speeding subway tram. The tunnel had begun to tremble again. Sister Creep stared, her face tightening, as the orange light grew brighter, showing streaks of incandescent red and purple.\n She realized then what it was, and she moaned like a trapped animal.\n a blast of fire was roaring toward her along the tunnel, and she could already feel the rush of air being sucked into it as if into a vacuum. In less than a minute it would be upon her.\n Sister Creep\u0027s trance snapped. She turned and fled, holding her bag close, her sneakers splashing through steaming water. She leaped broken pipes and pushed aside fallen cables with the frenzy of the doomed. She looked back and saw the flames shooting out red tendrils that snapped in the air like whips. The vacuum suction pulled at her, trying to draw her backward into the fire, and when she screamed the air sizzled in her nostrils and at the back of her throat.\n She could smell burning hair, felt her back and arms rippling with blisters. In maybe thirty seconds she\u0027d be joining her Lord and Master, and it astounded her that she wasn\u0027t ready and willing to go.\n With a startled cry of terror, she suddenly tripped and fell headlong to the floor.\n as she started to scramble up she saw she\u0027d tripped over a grate into which the stream was draining. Beneath the grate was only darkness. She looked at the onrushing fire, and her eyebrows singed, her face broke into oozing blisters. The air was unbreathable. There was no time to get up and run; the fire was almost upon her.\n She gripped the bars of the grate and wrenched upward. One of the grate\u0027s rusted screws snapped, but the second held tight.\n The flames were less than forty feet away, and Sister Creep\u0027s hair caught fire.\n God help me! she screamed inwardly, and she pulled upward on the grate so hard she felt her shoulders almost rip loose from their sockets.\n The second screw snapped.\n Sister Creep flung the grate aside, had a second to grab her bag, then lunged headfirst into the hole.\n She fell about four feet into a coffin-sized space that held eight inches of water.\n The flames passed overhead, sucking the air from her lungs and scorching every inch of her exposed skin. Her clothes burst into flame, and she rolled frantically in the water. For a few seconds there was nothing but the roaring and the agony, and she smelled the odor of hot dogs being boiled in a vendor\u0027s cart.\n The wall of fire moved on like a comet, and in its wake returned a whooosh of outside air that carried the thick smell of charred flesh and molten metal.\n Down in the hole that fed drainage water to a sewer pipe, Sister Creep\u0027s body hitched and contorted. Three inches of water had risen as mist and evaporated, blunting the full force of the fire. Her burned, tattered body struggled for a breath, and finally gasped and sputtered, the blistered hands tightly gripping her smoldering canvas bag.\n and then she lay still. \n Eight\n 8:31 a.M. Mountain Daylight Time\n Blue Dome Mountain, Idaho\n The steady buzzing of the telephone on the table beside his bed brought the man up from a dreamless sleep. Go away, he thought. Leave me alone. But the buzzing continued, and finally he slowly turned over, switched on the lamp and, squinting in the light, picked up the receiver. \"Macklin,\" he said, his voice slurred and sleepy.\n \"Uh... Colonel, siri\" It was Sergeant Schorr. \"I\u0027ve got some people in orientation waiting to meet you, sir.\"\n Colonel James \"Jimbo\" Macklin looked at the little green alarm clock next to the phone and saw he was more than thirty minutes late for the orientation and hand-shaking session. Damn it to Hell! he thought. I set that alarm for 0630 sharp! \"all right, Sergeant. Keep them there another fifteen minutes.\" He hung up and then checked the back of the alarm clock; he saw that the little lever was still pressed down. Either he\u0027d never set the alarm or he\u0027d turned it off in his sleep. He sat on the edge of the bed, trying to summon the energy to get up, but his body felt sluggish and bloated; years ago, he mused grimly, he\u0027d never needed an alarm clock to wake him: He could\u0027ve been snapped out of sleep by the sound of a footstep in wet grass and he would\u0027ve been as alert as a wolf within seconds.\n Passing time, he thought. Long gone.\n He willed himself to stand up. Willed himself to walk across the bedroom, its walls decorated with photographs of Phantom and Thunderchief jets in flight, and walked into the small bathroom. He switched on the light and ran water into the sink; it came out rusty. He splashed the water on his face, dried himself with a towel and stood staring bleary-eyed at the stranger in the mirror.\n Macklin stood six foot two, and until five or six years ago his body had been lean and hard, his ribs covered with muscle, his shoulders strong and straight, his chest thrust out like Chobham armor on the snout of an M-1 tank. Now the definitions of his body were blurred by loose flesh, and his potbelly resisted the fifty situps he did every morning - that is, when he had time to do them. He detected a stoop in his shoulders, as if he were being bowed by an invisible weight, and the hair on his chest was sprinkled with gray. His biceps, once rock-hard, had deteriorated into flab. He\u0027d once broken the neck of a Libyan soldier in the crook of his arm; now he didn\u0027t feel as if he had the strength to crack a walnut with a sledgehammer.\n He plugged in his electric razor and guided it over the stubble on his jaw. His dark brown hair was clipped in a severe crewcut, showing flecks of gray at the temples; beneath a square slab of a forehead, his eyes were frosty blue and sunken in deep hollows of fatigue, like bits of ice floating on muddy water. as he shaved Macklin thought that his face had come to resemble any one of the hundreds of battlefield maps he\u0027d pored over long ago: the jutting cliff of his chin leading to the rugged ravine of his mouth, up to the highlands of his chiseled cheekbones and the craggy ridge of his nose, down again into the swamps of his eyes, then an upward sweep into the brown forests of his thick eyebrows. and all the terrain marks were there, as well: the pockmark craters of the severe acne he\u0027d had as an adolescent, the small trench of a scar zigzagging through his left eyebrow, compliments of a ricocheting bullet in angola. across his left shoulder blade was a deeper and longer scar carved by a knife in Iraq, and a reminder of a Viet Cong bullet puckered the skin over the right side of his rib cage. Macklin was forty-four years old, but sometimes he awakened feeling seventy, with shooting pains in his arms and legs from bones that had been broken in battles on distant shores.\n He finished shaving and drew aside the shower curtain to run the water, then he stopped, because littering the bottom of the small shower stall were ceiling tiles and bits of rubble. Water was dripping from a series of holes where the shower stall ceiling had given way. as he stared at the leaking water, realizing he was running late and could not take a shower, anger suddenly rose within him like molten iron in a blast furnace; he slammed his fist against the wall once, and then again; the second time, the force of his blow left a network of minute cracks.\n He leaned over the sink, waiting for the rage to pass, as it usually did. \"Steady,\" he told himself. \"Discipline and control. Discipline and control.\" He repeated it a few more times, like a mantra, drew a long, deep breath and straightened up. Time to go, he thought. They\u0027re waiting for me. He used his stick deodorant under his arms, then went out to the bedroom closet to choose his uniform.\n He picked a pair of crisply pressed dark blue trousers, a light blue shirt and his beige poplin flight jacket with leather patches on the elbows and MaCKLIN printed across the breast pocket. He reached up to the overhead shelf, where he kept a case containing his Ingram gun and ammo clips, and lovingly took his air Force colonel\u0027s cap down; he brushed an imaginary bit of lint off the polished brim and put the cap on his head. He checked himself in the full-length mirror on the back of the closet door: buttons polished, check; trousers creased, check; shoes shining, check. He straightened his collar, and then he was ready to go.\n His private electric cart was parked outside his quarters on the Command Center Level; he locked his door with one of the many keys he carried on a key chain, then got into the cart and drove along the corridor. Behind him, past his own quarters, was the sealed metal door of the weapons storage room and the emergency food and water supply. Down at the other end of the corridor, past the quarters of other Earth House technicians and employees, was the generator room and the air-filtration system controls. He passed the door of Perimeter Control, which contained the screens of the small portable battlefield surveillance radars set out to guard the entry to Earth House, and the main screen of the skyward-trained radar dish that sat atop Blue Dome Mountain. Within Perimeter Control was also the hydraulic system that sealed the air vents and the lead-lined doorway in the event of a nuclear attack, and the various radar screens were manned around the clock.\n Macklin guided the cart up a ramp to the next level and headed for the Town Hall. He passed the open doors of the gymnasium, where an aerobics class was in session. a few morning joggers were running in the corridor, and Macklin nodded at them as he sped past. Then he was in the wider corridor of Earth House\u0027s Town Square, a junction of hallways with a rock garden at its center. all around were various \"shops\" with storefronts made to resemble those in a country town. Earth House\u0027s Town Square contained a tanning salon, a theater where videotaped movies were shown, a library, an infirmary staffed by a doctor and two nurses, a game arcade and a cafeteria. Macklin caught the aroma of bacon and eggs as he drove past the cafeteria\u0027s doors and wished he\u0027d had time for breakfast. It was not his way to be late. Discipline and control, he thought. Those were the two things that made a man.\n But he was still angry about the collapsed ceiling in his shower stall. Lately, it seemed that the walls and ceiling in several areas of Earth House were cracking and giving way. He\u0027d called the ausley brothers many times, but they\u0027d told him the structural reports showed settling was to be expected. Settling, my ass! Macklin had said. We\u0027ve got a water drainage problem here! Water\u0027s collecting over the ceilings and leaking through!\n \"Don\u0027t get yourself in a dither, Colonel,\" Donny ausley had told him from San antonio. \"If you get nervous, them folks are gonna get nervous, righti and there ain\u0027t no sense in gettin\u0027 nervous, \u0027cause that mountain\u0027s been standing for a few thousand years, and it ain\u0027t goin\u0027 nowhere.\"\n \"It\u0027s not the mountain!\" Macklin had said, his fist tightening around the receiver. \"It\u0027s the tunnels! My cleanup crews are finding new cracks every day!\"\n \"Settlin\u0027, that\u0027s all. Now listen, Terry and me have pumped \u0027bout ten million big ones into that place, and we built it to last. If we didn\u0027t have bidness to run, we\u0027d be right there with you. Now, that far underground, you\u0027re gonna have some settlin\u0027 and water leaks. ain\u0027t no way \u0027round it. and we\u0027re payin\u0027 you one hundred thousand dollars a year to endorse Earth House and live down there, you bein\u0027 a big war hero and all. So you fix them cracks and keep everybody happy.\"\n \"You listen, Mr. ausley: If I don\u0027t get a structural engineer to look this place over within a week, I\u0027m leaving. I don\u0027t give a damn about my contract. I\u0027m not going to encourage people to stay down here if it\u0027s not safe!\"\n \"I believe,\" Donny ausley had said, his Texas accent getting a few degrees cooler, \"you\u0027d better calm yourself down, Colonel. Now, you don\u0027t want to walk out on a bidness deal. That ain\u0027t good manners. You just \u0027member how Terry and me found you and brought you along \u0027fore you start flyin\u0027 off the handle, okayi\"\n Discipline and control! Macklin had thought, his heart hammering. Discipline and control! and then he\u0027d listened as Donny ausley had told him he\u0027d send an engineer up from San antone within two weeks to go over Earth House with a fine-tooth comb. \"But meantime, you\u0027re head honcho. You got a problem, you fix it. Righti\"\n and that had been almost a month ago. The structural engineer had never come.\n Colonel Macklin stopped his cart near a pair of double doors. above the doors was the sign TOWN HaLL in ornate, old-timey lettering. Before he went in, he tightened his belt another notch, though the trousers were already squeezed around his midsection; then he drew himself up tall and straight and entered the auditorium.\n about a dozen people sat in the red vinyl seats that faced the podium, where Captain Warner was answering questions and pointing out features of Earth House on the wall map displayed behind him. Sergeant Schorr, who stood ready to field the more difficult questions, saw the colonel enter and quickly stepped to the podium\u0027s microphone. \"Excuse me, Captain,\" he said, interrupting an explanation about the plumbing and water-filtration system. \"Folks, I want to introduce you to someone who certainly needs no introduction: Colonel James Barnett Macklin.\"\n The colonel continued at a crisp pace along the center aisle as the audience applauded. He took his place behind the podium, framed by an american flag and the flag of Earth House, and looked out at the gallery. The applause went on, and a middle-aged man in a camouflage combat jacket rose to his feet, followed by his similarly dressed wife; then all of them were standing and applauding, and Macklin let it continue for another fifteen seconds before he thanked them and asked them to be seated.\n Captain \"Teddybear\" Warner, a husky ex-Green Beret who\u0027d lost his left eye to a grenade in the Sudan and now wore a black patch, took a seat behind the colonel, and Schorr sat beside him. Macklin paused, gathering in his mind what he was going to say; he usually gave the same welcoming speech to all the new arrivals at Earth House, told them how secure the place was and how it would be the last american fortress when the Russians invaded. afterward, he took their questions, shook their hands and signed a few autographs. That was what the ausley boys paid him for.\n He looked into their eyes. They were used to nice, clean beds, sweet-smelling bathrooms and roast beef on Sunday afternoons. Drones, he thought. They lived to breed and eat and shit, and they thought they knew all about freedom and loyalty and courage - but they didn\u0027t know the first thing about those attributes. He cast his gaze over the faces, saw nothing but softness and weakness; these were people who thought they\u0027d sacrifice their wives and husbands, infant children, homes and all their possessions as the price of keeping the Russian filth off our shores, but they would not, because their spirits were weak and their brains were corrupted by mental junk food. and here they were, like all the others, waiting for him to tell them they were true patriots.\n He wanted to open his mouth and tell them to get the hell out of Earth House, that the place was structurally unsound and that they - the weak-willed losers! - ought to go home and cower in their basements. Jesus Christ! he thought. What the hell am I doing herei\n Then a mental voice, like the sound of a cracking bullwhip, said, Discipline and control! Shape up, mister!\n It was the voice of the Shadow Soldier. Macklin closed his eyes for a second. When he opened them, he was staring into the face of a bony, fragile-looking boy sitting in the second row between his father and mother. a good strong wind would knock that kid to the ground, he decided, but he paused, examining the boy\u0027s pale gray eyes. He thought he recognized something in those eyes - determination, cunning, willpower - that he remembered from pictures of himself at that age, when he was a fat, clumsy slob that his air Force captain father had kicked in the ass at every opportunity.\n Of all of them sitting before me, he thought, that skinny kid might have a chance. The others were dogmeat.\n He braced himself and started giving the orientation speech with as much enthusiasm as if he were digging a latrine ditch.\n as Colonel Macklin spoke Roland Croninger examined him with intent interest. The colonel was a lot heavier than the photographs in Soldier of Fortune, and he looked sleepy and bored. Roland was disappointed; he\u0027d expected a trim and hungry war hero, not a used car salesman dressed up in military duds. It was hard to believe that this was the same man who had shot down three MiGs over the Thanh Hoa Bridge to save a buddy\u0027s crippled plane and then had ejected from a disintegrating aircraft.\n Rip-off, Roland decided. Colonel Macklin was a rip-off, and he was beginning to think Earth House might be a rip-off, as well. That morning he\u0027d awakened to find a dark water stain on his pillow; the ceiling was leaking from a crack two inches wide. There had been no hot water from the shower head, and the cold water was full of grit and rust. His mother had thrown a fit about not being able to get her hair clean, and his father had said he\u0027d mention the problem to Sergeant Schorr.\n Roland was fearful of setting up his computer because the air in his bedroom was so damp, and his first impression of Earth House as a neat-o medieval-type fortress was wearing thin. Of course, he\u0027d brought books to read - tomes on Machiavelli and Napoleon and a study of medieval siege warfare - but he\u0027d counted on programming some new dungeons for his King\u0027s Knight game while he was here. King\u0027s Knight was his own creation - 128K of an imaginary world shattered into feudal kingdoms at war with one another. Now it looked as if he was going to have to read all the time!\n He watched Colonel Macklin. Macklin\u0027s eyes were lazy, and his face was fat. He looked like an old bull that had been put out to pasture because he couldn\u0027t get it up anymore. But as Macklin\u0027s eyes met his and held for a couple of seconds before they slid away again, Roland was reminded of a picture he\u0027d seen of Joe Louis when the boxing champion had been a Las Vegas hotel greeter. In that picture, Joe Louis looked flabby and tired, but he had one massive hand clasped around the frail white hand of a tourist, and Joe Louis\u0027 eyes were hard and dark and somewhere far away - maybe back in the ring, remembering the feel of a blow slammed against another man\u0027s midsection almost to the backbone. Roland thought that the same distant stare was in Colonel Macklin\u0027s eyes, and, just as you knew Joe Louis could\u0027ve smashed the bones in that tourist\u0027s hand with one quick squeeze, Roland sensed that the warrior within Colonel Macklin was not yet dead.\n as Macklin\u0027s address continued the wall telephone beside the display map buzzed. Sergeant Schorr got up and answered it; he listened for a few seconds, hung the receiver up and started back across the platform toward the colonel. Roland thought that something in Schorr\u0027s face had been altered in the time he was on the telephone; Schorr appeared older now, and his face was slightly flushed. He said, \"Excuse me, Colonel,\" and he placed his hand over the microphone.\n Macklin\u0027s head snapped around, his eyes angry at the interruption.\n \"Sir,\" Schorr said quietly, \"Sergeant Lombard says you\u0027re needed in Perimeter Control.\"\n \"What is iti\"\n \"He wouldn\u0027t say, sir. I think... he sounded pretty damned shaken.\"\n Crap! Macklin thought. Lombard got \"shaken\" every time the radar picked up a flock of geese or an airliner passing overhead. Once they\u0027d sealed Earth House because Lombard thought a group of hang gliders were enemy paratroopers. Still, Macklin would have to check it out. He motioned for Captain Warner to follow him, and then he told Schorr to dismiss the orientation after they\u0027d gone. \"Ladies and gentlemen,\" Macklin said into the microphone, \"I\u0027m going to have to leave you now to take care of a small problem, but I hope to see each of you later this afternoon at the newcomers\u0027 reception. Thank you for your attention.\" and then he stalked up the aisle with Captain Warner right behind him.\n They drove back in the electric cart the way Macklin had come, Macklin muttering all the way about Lombard\u0027s stupidity. When they went into the Perimeter Control Room, they found Lombard peering into the screen that showed the returns from the sky radar atop Blue Dome. Near him stood Sergeant Becker and Corporal Prados, both staring at the screen as well. The room was full of electronic equipment, other radar screens and the small computer that stored the arrival and departure dates of Earth House\u0027s residents. On a shelf above a row of radar screens, a voice was blaring from a shortwave radio, almost obscured by the crackling of static. The voice was panicked, babbling so fast Macklin couldn\u0027t understand what was being said. But Macklin didn\u0027t like the sound of it, and instantly his muscles tensed and his heart began to pound.\n \"Move aside,\" he told the other men. He stood where he could get a good look at the screen.\n His mouth went dry, and he heard the sizzling of circuits in his own brain at work. \"God in Heaven,\" he whispered.\n The garbled voice from the shortwave radio was saying, \"New York got it... wiped out... the missiles are comin\u0027 in over the east coast... hit Washington... Boston... I can see flames from here...\" Other voices surged out of the storm of static, bits and pieces of information hurtling along the network of ham radio operators across the United States and picked up by Blue Dome Mountain\u0027s antennas. another voice with a Southern accent broke in, shouting, \"atlanta just went dead! I think atlanta got hit!\" The voices overlapped, swelled and faded, commingled into a language of sobs and shouts, weak, faint whispers and the names of american cities repeated like a litany of the dead: Philadelphia... Miami... Newport News... Chicago... Richmond... Pittsburgh...\n But Macklin\u0027s attention was fixed on what the radar screen showed. There could be no doubt about what they were. He looked up at Captain Warner and started to speak, but he couldn\u0027t find his voice for a second. Then he said, \"Bring the perimeter guards in. Seal the doorway. We\u0027re under attack. Move it!\"\n Warner picked up a walkie-talkie and hustled off. \"Get Schorr down here,\" Macklin said, and Sergeant Becker - a loyal and reliable man who had served with Macklin in Chad - instantly picked up the telephone and started pressing buttons. From the shortwave radio a frantic voice said, \"This is KKTZ in St. Louis! Calling anybody! I\u0027m lookin\u0027 at a fire in the sky! It\u0027s everywhere! God a\u0027mighty, I\u0027ve never seen such a - \" a piercing squeal of static and other distant voices flooded into the empty hole left by St. Louis.\n \"This is it,\" Macklin whispered. His eyes were shining, and there was a light sheen of sweat on his face. \"Ready or not, this is it.\"\n and deep inside him, in the pit where no light had shone for a very long time, the Shadow Soldier cried out with joy. \n","sourceLink":"https://allnovel.net/swan-song/page-2.html","bookId":2476,"book":{"id":2476,"title":"Swan Song","description":"Storyline: \n In a wasteland born of rage and fear, populated by monstrous creatures and marauding armies, earth\u0027s last survivors have been drawn into the final battle between good and evil, that will decide the fate of humanity: Sister, who discovers a strange and transformative glass artifact in the destroyed Manhattan streets . . . Joshua Hutchins, the pro wrestler who takes refuge from the nuclear fallout at a Nebraska gas station . . . and Swan, a young girl possessing special powers, who travels alongside Josh to a Missouri town where healing and recovery can begin with Swan\u0027s gifts. But the ancient force behind earth\u0027s devastation is scouring the walking wounded for recruits for its relentless army, beginning with Swan herself. . . .\n \n","cover":"https://allnovel.net/images/swan-song.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/swan-song.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:49:26 PM"}}
