{"id":27564,"no":101,"title":"CHAPTER XCIX — \"Marnee Ora, Ora Marnee\"","content":"During the afternoon of the day of the diver\u0027s decease, preparations were making for paying the last rites to his remains, and carrying them by torch-light to their sepulcher, the sea; for, as in Odo, so was the custom here. Meanwhile, all over the isle, to and fro went heralds, dismally arrayed, beating shark-skin drums; and, at intervals, crying—\"A man is dead; let no fires be kindled; have mercy, oh Oro!—Let no canoes put to sea till the burial. This night, oh Oro!—Let no food be cooked.\" And ever and anon, passed and repassed these, others in brave attire; with castanets of pearl shells, making gay music; and these sang— Be merry, oh men of Mondoldo, A maiden this night is to wed: Be merry, oh damsels of Mardi,— Flowers, flowers for the bridal bed. Informed that the preliminary rites were about being rendered, we repaired to the arbor, whither the body had been removed. Arrayed in white, it was laid out on a mat; its arms mutely crossed, between its lips an asphodel; at the feet, a withered hawthorn bough. The relatives were wailing, and cutting themselves with shells, so that blood flowed, and spotted their vesture. Upon remonstrating with the most abandoned of these mourners, the wife of the diver, she exclaimed, \"Yes; great is the pain, but greater my affliction.\" Another, the deaf sire of the dead, went staggering about, and groping; saying, that he was now quite blind; for some months previous he had lost one eye in the death of his eldest son and now the other was gone. \"I am childless,\" he cried; \"henceforth call me Roi Mori,\" that is, Twice-Blind. While the relatives were thus violently lamenting, the rest of the company occasionally scratched themselves with their shells; but very slightly, and mostly on the soles of their feet; from long exposure, quite callous. This was interrupted, however, when the real mourners averted their eyes; though at no time was there any deviation in the length of their faces. But on all sides, lamentations afresh broke forth, upon the appearance of a person who had been called in to assist in solemnizing the obsequies, and also to console the afflicted. In rotundity, he was another Borabolla. He puffed and panted. As he approached the corpse, a sobbing silence ensued; when holding the hand of the dead, between his, the stranger thus spoke:— \"Mourn not, oh friends of Karhownoo, that this your brother lives not. His wounded head pains him no more; he would not feel it, did a javelin pierce him. Yea; Karhownoo is exempt from all the ills and evils of this miserable Mardi!\" Hereupon, the Twice-Blind, who being deaf, heard not what was said, tore his gray hair, and cried, \"Alas! alas! my boy; thou wert the merriest man in Mardi, and now thy pranks are over!\" But the other proceeded—\"Mourn not, I say, oh friends of Karhownoo; the dead whom ye deplore is happier than the living; is not his spirit in the aerial isles?\" \"True! true!\" responded the raving wife, mingling her blood with her tears, \"my own poor hapless Karhownoo is thrice happy in Paradise!\" And anew she wailed, and lacerated her cheeks. \"Rave not, I say.\" But she only raved the more. And now the good stranger departed; saying, he must hie to a wedding, waiting his presence in an arbor adjoining. Understanding that the removal of the body would not take place till midnight, we thought to behold the mode of marrying in Mondoldo. Drawing near the place, we were greeted by merry voices, and much singing, which greatly increased when the good stranger was perceived. Gayly arrayed in fine robes, with plumes on their heads, the bride and groom stood in the middle of a joyous throng, in readiness for the nuptial bond to be tied. Standing before them, the stranger was given a cord, so bedecked with flowers, as to disguise its stout fibers; and taking: the bride\u0027s hands, he bound them together to a ritual chant; about her neck, in festoons, disposing the flowery ends of the cord. Then turning to the groom, he was given another, also beflowered; but attached thereto was a great stone, very much carved, and stained; indeed, so every way disguised, that a person not knowing what it was, and lifting it, would be greatly amazed at its weight. This cord being attached to the waist of the groom, he leaned over toward the bride, by reason of the burden of the drop. All present now united in a chant, and danced about the happy pair, who meanwhile looked ill at ease; the one being so bound by the hands, and the other solely weighed down by his stone. A pause ensuing, the good stranger, turning them back to back, thus spoke:— \"By thy flowery gyves, oh bride, I make thee a wife; and by thy burdensome stone, oh groom, I make thee a husband. Live and be happy, both; for the wise and good Oro hath placed us in Mardi to be glad. Doth not all nature rejoice in her green groves and her flowers? and woo and wed not the fowls of the air, trilling their bliss in their bowers? Live then, and be happy, oh bride and groom; for Oro is offended with the unhappy, since he meant them to be gay.\" And the ceremony ended with a joyful feast. But not all nuptials in Mardi were like these. Others were wedded with different rites; without the stone and flowery gyves. These were they who plighted their troth with tears not smiles, and made responses in the heart. Returning from the house of the merry to the house of the mournful, we lingered till midnight to witness the issuing forth of the body. By torch light, numerous canoes, with paddlers standing by, were drawn up on the beach, to accommodate those who purposed following the poor diver to his home. The remains embarked, some confusion ensued concerning the occupancy of the rest of the shallops. At last the procession glided off, our party included. Two by two, forming a long line of torches trailing round the isle, the canoes all headed toward the opening in the reef. For a time, a decorous silence was preserved; but presently, some whispering was heard; perhaps melancholy discoursing touching the close of the diver\u0027s career. But we were shocked to discover, that poor Karhownoo was not much in their thoughts; they were conversing about the next bread-fruit harvest, and the recent arrival of King Media and party at Mondoldo. From far in advance, however, were heard the lamentations of the true mourners, the relatives of the diver. Passing the reef, and sailing a little distance therefrom, the canoes were disposed in a circle; the one bearing the corpse in the center. Certain ceremonies over, the body was committed to the waves; the white foam lighting up the last, long plunge of the diver, to see sights more strange than ever he saw in the brooding cells of the Turtle Reef. And now, while in the still midnight, all present were gazing down into the ocean, watching the white wake of the corpse, ever and anon illuminated by sparkles, an unknown voice was heard, and all started and vacantly stared, as this wild song was sung:— We drop our dead in the sea, The bottomless, bottomless sea; Each bubble a hollow sigh, As it sinks forever and aye. We drop our dead in the sea,— The dead reek not of aught; We drop our dead in the sea,— The sea ne\u0027er gives it a thought. Sink, sink, oh corpse, still sink, Far down in the bottomless sea, Where the unknown forms do prowl, Down, down in the bottomless sea. \u0027Tis night above, and night all round, And night will it be with thee; As thou sinkest, and sinkest for aye, Deeper down in the bottomless sea. The mysterious voice died away; no sign of the corpse was now seen; and mute with amaze, the company long listed to the low moan of the billows and the sad sough of the breeze. At last, without speaking, the obsequies were concluded by sliding into the ocean a carved tablet of Palmetto, to mark the place of the burial. But a wave-crest received it, and fast it floated away. Returning to the isle, long silence prevailed. But at length, as if the scene in which they had just taken part, afresh reminded them of the mournful event which had called them together, the company again recurred to it; some present, sadly and incidentally alluding to Borabolla\u0027s banquet of turtle, thereby postponed. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2768/76441.html","bookId":1334,"book":{"id":1334,"title":"Mardi: and A Voyage Thither","description":"简介： Not long ago, having published two narratives of voyages in the Pacific, which, in many quarters, were received with incredulity, the thought occurred to me, of indeed writing a romance of Polynesian adventure, and publishing it as such; to see wheth...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2768","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
