{"id":27567,"no":104,"title":"CHAPTER CII — They Depart From Mondoldo","content":"Night passed; and next morning we made preparations for leaving Mondoldo that day. But fearing anew, lest after our departure, the men of Amma might stir up against me the people of the isle, I determined to yield to the earnest solicitations of Borabolla, and leave Jarl behind, for a remembrance of Taji; if necessary, to vindicate his name. Apprised hereof, my follower was loth to acquiesce. His guiltless spirit feared not the strangers: less selfish considerations prevailed. He was willing to remain on the island for a time, but not without me. Yet, setting forth my reasons; and assuring him, that our tour would not be long in completing, when we would not fail to return, previous to sailing for Odo, he at last, but reluctantly, assented. At Mondoldo, we also parted with Samoa. Whether it was, that he feared the avengers, whom he may have thought would follow on my track; or whether the islands of Mardi answered not in attractiveness to the picture his fancy had painted; or whether the restraint put upon him by the domineering presence of King Media, was too irksome withal; or whether, indeed, he relished not those disquisitions with which Babbalanja regaled us: however it may have been, certain it was, that Samoa was impatient of the voyage. He besought permission to return to Odo, there to await my return; and a canoe of Mondoldo being about to proceed in that direction, permission was granted; and departing for the other side of the island, from thence he embarked. Long after, dark tidings came, that at early dawn he had been found dead in the canoe: three arrows in his side. Yoomy was at a loss to account for the departure of Samoa; who, while ashore, had expressed much desire to roam. Media, however, declared that he must be returning to some inamorata. But Babbalanja averred, that the Upoluan was not the first man, who had turned back, after beginning a voyage like our own. To this, after musing, Yoomy assented. Indeed, I had noticed, that already the Warbler had abated those sanguine assurances of success, with which he had departed from Odo. The futility of our search thus far, seemed ominous to him, of the end. On the eve of embarking, we were accompanied to the beach by Borabolla; who, with his own hand, suspended from the shark\u0027s mouth of Media\u0027s canoe, three red-ripe bunches of plantains, a farewell gift to his guests. Though he spoke not a word, Jarl was long in taking leave. His eyes seemed to say, I will see you no more. At length we pushed from the strand; Borabolla waving his adieus with a green leaf of banana; our comrade ruefully eyeing the receding canoes; and the multitude loudly invoking for us a prosperous voyage. But to my horror, there suddenly dashed through the crowd, the three specter sons of Aleema, escaped from their prison. With clenched hands, they stood in the water, and cursed me anew. And with that curse in our sails, we swept off. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2768/76444.html","bookId":1334,"book":{"id":1334,"title":"Mardi: and A Voyage Thither","description":"简介： Not long ago, having published two narratives of voyages in the Pacific, which, in many quarters, were received with incredulity, the thought occurred to me, of indeed writing a romance of Polynesian adventure, and publishing it as such; to see wheth...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2768","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
