{"id":27568,"no":105,"title":"CHAPTER CIII — As They Sail","content":"As the canoes now glided across the lagoon, I gave myself up to reverie; and revolving over all that the men of Amma had rehearsed of the history of Yillah, I one by one unriddled the mysteries, before so baffling. Now, all was made plain: no secret remaining, but the subsequent event of her disappearance. Yes, Hautia! enlightened I had been but where was Yillah? Then I recalled that last interview with Hautia\u0027s messengers, so full of enigmas; and wondered, whether Yoomy had interpreted aright. Unseen, and unsolicited; still pursuing me with omens, with taunts, and with wooings, mysterious Hautia appalled me. Vaguely I began to fear her. And the thought, that perhaps again and again, her heralds would haunt me, filled me with a nameless dread, which I almost shrank from acknowledging. Inwardly I prayed, that never more they might appear. While full of these thoughts, Media interrupted them by saying, that the minstrel was about to begin one of his chants, a thing of his own composing; and therefore, as he himself said, all critics must be lenient; for Yoomy, at times, not always, was a timid youth, distrustful of his own sweet genius for poesy. The words were about a curious hereafter, believed in by some people in Mardi: a sort of nocturnal Paradise, where the sun and its heat are excluded: one long, lunar day, with twinkling stars to keep company. THE SONG Far off in the sea is Marlena, A land of shades and streams, A land of many delights. Dark and bold, thy shores, Marlena; But green, and timorous, thy soft knolls, Crouching behind the woodlands. All shady thy hills; all gleaming thy springs, Like eyes in the earth looking at you. How charming thy haunts Marlena!— Oh, the waters that flow through Onimoo: Oh, the leaves that rustle through Ponoo: Oh, the roses that blossom in Tarma: Come, and see the valley of Vina: How sweet, how sweet, the Isles from Hind: \u0027Tis aye afternoon of the full, full moon, And ever the season of fruit, And ever the hour of flowers, And never the time of rains and gales, All in and about Marlena. Soft sigh the boughs in the stilly air, Soft lap the beach the billows there; And in the woods or by the streams, You needs must nod in the Land of Dreams. \"Yoomy,\" said old Mohi with a yawn, \"you composed that song, then, did you?\" \"I did,\" said Yoomy, placing his turban a little to one side. \"Then, minstrel, you shall sing me to sleep every night, especially with that song of Marlena; it is soporific as the airs of Nora-Bamma.\" \"Mean you, old man, that my lines, setting forth the luxurious repose to be enjoyed hereafter, are composed with such skill, that the description begets the reality; or would you ironically suggest, that the song is a sleepy thing itself?\" \"An important discrimination,\" said Media; \"which mean you, Mohi?\" \"Now, are you not a silly boy,\" said Babbalanja, \"when from the ambiguity of his speech, you could so easily have derived something flattering, thus to seek to extract unpleasantness from it? Be wise, Yoomy; and hereafter, whenever a remark like that seems equivocal, be sure to wrest commendation from it, though you torture it to the quick.\" \"And most sure am I, that I would ever do so; but often I so incline to a distrust of my powers, that I am far more keenly alive to censure, than to praise; and always deem it the more sincere of the two; and no praise so much elates me, as censure depresses.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2768/76445.html","bookId":1334,"book":{"id":1334,"title":"Mardi: and A Voyage Thither","description":"简介： Not long ago, having published two narratives of voyages in the Pacific, which, in many quarters, were received with incredulity, the thought occurred to me, of indeed writing a romance of Polynesian adventure, and publishing it as such; to see wheth...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2768","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
