{"id":27604,"no":141,"title":"CHAPTER XXXIV. — Of The Isle Of Diranda","content":"In good time the shores of Diranda were in sight. And, introductory to landing, Braid-Beard proceeded to give us some little account of the island, and its rulers. As previously hinted, those very magnificent and illustrious lord seigniors, the lord seigniors Hello and Piko, who between them divided Diranda, delighted in all manner of public games, especially warlike ones; which last were celebrated so frequently, and were so fatal in their results, that, not-withstanding the multiplicity of nuptials taking place in the isle, its population remained in equilibrio. But, strange to relate, this was the very object which the lord seigniors had in view; the very object they sought to compass, by instituting their games. Though, for the most part, they wisely kept the secret locked up. But to tell how the lord seigniors Hello and Piko came to join hands in this matter. Diranda had been amicably divided between them ever since the day they were crowned; one reigning king in the East, the other in the West. But King Piko had been long harassed with the thought, that the unobstructed and indefinite increase of his browsing subjects might eventually denude of herbage his portion of the island. Posterity, thought he, is marshaling her generations in squadrons, brigades, and battalions, and ere long will be down upon my devoted empire. Lo! her locust cavalry darken the skies; her light-troop pismires cover the earth. Alas! my son and successor, thou wilt inhale choke-damp for air, and have not a private corner to say thy prayers. By a sort of arithmetical progression, the probability, nay, the certainty of these results, if not in some way averted, was proved to King Piko; and he was furthermore admonished, that war—war to the haft with King Hello—was the only cure for so menacing an evil. But so it was, that King Piko, at peace with King Hello, and well content with, the tranquillity of the times, little relished the idea of picking a quarrel with his neighbor, and running its risks, in order to phlebotomize his redundant population. \"Patience, most illustrious seignior,\" said another of his sagacious Ahithophels, \"and haply a pestilence may decimate the people.\" But no pestilence came. And in every direction the young men and maidens were recklessly rushing into wedlock; and so salubrious the climate, that the old men stuck to the outside of the turf, and refused to go under. At last some Machiavel of a philosopher suggested, that peradventure the object of war might be answered without going to war; that peradventure King Hello might be brought to acquiesce in an arrangement, whereby the men of Diranda might be induced to kill off one another voluntarily, in a peaceable manner, without troubling their rulers. And to this end, the games before mentioned were proposed. \"Egad! my wise ones, you have hit it,\" cried Piko; \"but will Hello say ay?\" \"Try him, most illustrious seignior,\" said Machiavel. So to Hello went embassadors ordinary and extraordinary, and ministers plenipotentiary and peculiar; and anxiously King Piko awaited their return. The mission was crowned with success. Said King Hello to the ministers, in confidence:—\"The very thing, Dons, the very thing I have wanted. My people are increasing too fast. They keep up the succession too well. Tell your illustrious master it\u0027s a bargain. The games! the games! by all means.\" So, throughout the island, by proclamation, they were forthwith established; succeeding to a charm. And the lord seigniors, Hello and Piko, finding their interests the same, came together like bride and bridegroom; lived in the same palace; dined off the same cloth; cut from the same bread-fruit; drank from the same calabash; wore each other\u0027s crowns; and often locking arms with a charming frankness, paced up and down in their dominions, discussing the prospect of the next harvest of heads. In his old-fashioned way, having related all this, with many other particulars, Mohi was interrupted by Babbalanja, who inquired how the people of Diranda relished the games, and how they fancied being coolly thinned out in that manner. To which in substance the chronicler replied, that of the true object of the games, they had not the faintest conception; but hammered away at each other, and fought and died together, like jolly good fellows. \"Right again, immortal old Bardianna!\" cried Babbalanja. \"And what has the sage to the point this time?\" asked Media. \"Why, my lord, in his chapter on \"Cracked Crowns,\" Bardianna, after many profound ponderings, thus concludes: In this cracked sphere we live in, then, cracked skulls would seem the inevitable allotments of many. Nor will the splintering thereof cease, till this pugnacious animal we treat of be deprived of his natural maces: videlicet, his arms. And right well doth man love to bruise and batter all occiputs in his vicinity.\" \"Seems to me, our old friend must have been on his stilts that time,\" interrupted Mohi. \"No, Braid-Beard. But by way of apologizing for the unusual rigidity of his style in that chapter, he says in a note, that it was written upon a straight-backed settle, when he was ill of a lumbago, and a crick in the neck.\" \"That incorrigible Azzageddi again,\" said Media, \"Proceed with your quotation, Babbalanja.\" \"Where was I, Braid-Beard?\" \"Battering occiputs at the last accounts,\" said Mohi. \"Ah, yes. And right well doth man love to bruise and batter all occiputs in his vicinity; he but follows his instincts; he is but one member of a fighting world. Spiders, vixens, and tigers all war with a relish; and on every side is heard the howls of hyenas, the throttlings of mastiffs, the din of belligerant beetles, the buzzing warfare of the insect battalions: and the shrill cries of lady Tartars rending their lords. And all this existeth of necessity. To war it is, and other depopulators, that we are beholden for elbow-room in Mardi and for all our parks an gardens, wherein we are wont to expatiate. Come on, then, plague, war, famine and viragos! Come on, I say, for who shall stay ye? Come on, and healthfulize the census! And more especially, oh War! do thou march forth with thy bludgeon! Cracked are, our crowns by nature, and henceforth forever, cracked shall they be by hard raps.\" \"And hopelessly cracked the skull, that hatched such a tirade of nonsense,\" said Mohi. \"And think you not, old Bardianna knew that?\" asked Babbalanja. \"He wrote an excellent chapter on that very subject.\" \"What, on the cracks in his own pate?\" \"Precisely. And expressly asserts, that to those identical cracks, was he indebted for what little light he had in his brain.\" \"I yield, Babbalanja; your old Ponderer is older than I.\" \"Ay, ay, Braid-Beard; his crest was a tortoise; and this was the motto:—\u0027I bite, but am not to be bitten.\u0027\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2768/76481.html","bookId":1334,"book":{"id":1334,"title":"Mardi: and A Voyage Thither","description":"简介： Not long ago, having published two narratives of voyages in the Pacific, which, in many quarters, were received with incredulity, the thought occurred to me, of indeed writing a romance of Polynesian adventure, and publishing it as such; to see wheth...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2768","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
