{"id":27615,"no":152,"title":"CHAPTER XLV. — They Behold King Bello\u0027s State Canoe","content":"At last, bidding adieu to King Bello; and in the midst of the lowing of oxen, breaking away from his many hospitalities, we departed for the beach. But ere embarking, we paused to gaze at an object, which long fixed our attention. Now, as all bold cavaliers have ever delighted in special chargers, gayly caparisoned, whereon upon grand occasions to sally forth upon the plains: even so have maritime potentates ever prided themselves upon some holiday galley, splendidly equipped, wherein to sail over the sea. When of old, glory-seeking Jason, attended by his promising young lieutenants, Castor and Pollux, embarked on that hardy adventure to Colchis, the brave planks of the good ship Argos he trod, its model a swan to behold. And when Trojan Aeneas wandered West, and discovered the pleasant land of Latium, it was in the fine craft Bis Taurus that he sailed: its stern gloriously emblazoned, its prow a leveled spear. And to the sound of sackbut and psaltery, gliding down the Nile, in the pleasant shade of its pyramids to welcome mad Mark, Cleopatra was throned on the cedar quarter-deck of a glorious gondola, silk and satin hung; its silver plated oars, musical as flutes. So, too, Queen Bess was wont to disport on old Thames. And tough Torf-Egill, the Danish Sea-king, reckoned in his stud, a slender yacht; its masts young Zetland firs; its prow a seal, dog-like holding a sword-fish blade. He called it the Grayhound, so swift was its keel; the Sea-hawk, so blood-stained its beak. And groping down his palace stairs, the blind old Doge Dandolo, oft embarked in his gilded barge, like the lord mayor setting forth in civic state from Guildhall in his chariot. But from another sort of prow leaped Dandolo, when at Constantinople, he foremost sprang ashore, and with a right arm ninety years old, planted the standard of St. Mark full among the long chin-pennons of the long-bearded Turks. And Kumbo Sama, Emperor of Japan, had a dragon-beaked junk, a floating Juggernaut, wherein he burnt incense to the sea-gods. And Kannakoko, King of New Zealand; and the first Tahitian Pomaree; and the Pelew potentate, each possessed long state canoes; sea-snakes, all; carved over like Chinese card-cases, and manned with such scores of warriors, that dipping their paddles in the sea, they made a commotion like shoals of herring. What wonder then, that Bello of the Hump, the old sea-king of Mardi, should sport a brave ocean-chariot? In a broad arbor by the water-side, it was housed like Alp Arsian\u0027s war-horse, or the charger Caligula deified; upon its stern a wilderness of sculpture:—shell-work, medal-lions, masques, griffins, gulls, ogres, finned-lions, winged walruses; all manner of sea- cavalry, crusading centaurs, crocodiles, and sharks; and mermen, and mermaids, and Neptune only knows all. And in this craft, Doge-like, yearly did King Bello stand up and wed with the Lagoon. But the custom originated not in the manner of the Doge\u0027s, which was as follows; so, at least, saith Ghibelli, who tells all about it:— When, in a stout sea-fight, Ziani defeated Barbarossa\u0027s son Otho, sending his feluccas all flying, like frightened water-fowl from a lake, then did his Holiness, the Pope, present unto him a ring; saying, \"Take this, oh Ziani, and with it, the sea for thy bride; and every year wed her again.\" So the Doge\u0027s tradition; thus Bello\u0027s:— Ages ago, Dominora was circled by a reef, which expanding in proportion to the extension of the isle\u0027s naval dominion, in due time embraced the entire lagoon; and this marriage ring zoned all the world. But if the sea was King Bello\u0027s bride, an Adriatic Tartar he wedded; who, in her mad gales of passions, often boxed about his canoes, and led his navies a very boisterous life indeed. And hostile prognosticators opined, that ere long she would desert her old lord, and marry again. Already, they held, she had made advances in the direction of Vivenza. But truly, should she abandon old Bello, he would straight-way after her with all his fleets; and never rest till his queen was regained. Now, old sea-king! look well to thy barge of state: for, peradventure, the dry-rot may be eating into its keel; and the wood-worms exploring into its spars. Without heedful tending, any craft will decay; yet, for ever may its first, fine model be preserved, though its prow be renewed every spring, like the horns of the deer, if, in repairing, plank be put for plank, rib for rib, in exactest similitude. Even so, then, oh Bello! do thou with thy barge. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2768/76492.html","bookId":1334,"book":{"id":1334,"title":"Mardi: and A Voyage Thither","description":"简介： Not long ago, having published two narratives of voyages in the Pacific, which, in many quarters, were received with incredulity, the thought occurred to me, of indeed writing a romance of Polynesian adventure, and publishing it as such; to see wheth...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2768","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
