{"id":27637,"no":174,"title":"CHAPTER LXVII. — They Visit One Doxodox","content":"Next morning, we came to a deep, green wood, slowly nodding over the waves; its margin frothy-white with foam. A charming sight! While delighted, all our paddlers gazed, Media, observing Babbalanja plunged in reveries, called upon him to awake; asking what might so absorb him. \"Ah, my lord! what seraphic sounds have ye driven from me!\" \"Sounds! Sure, there\u0027s naught heard but yonder murmuring surf; what other sound heard you?\" \"The thrilling of my soul\u0027s monochord, my lord. But prick not your ears to hear it; that divine harmony is overheard by the rapt spirit alone; it comes not by the auditory nerves.\" \"No more, Azzageddi! No more of that. Look yonder!\" \"A most lovely wood, in truth. And methinks it is here the sage Doxodox, surnamed the Wise One, dwells.\" \"Hark, I hear the hootings of his owls,\" said Mohi. \"My lord, you must have read of him. He is said to have penetrated from the zoned, to the unzoned principles. Shall we seek him out, that we may hearken to his wisdom? Doubtless he knows many things, after which we pant.\" The lagoon was calm, as we landed; not a breath stirred the plumes of the trees; and as we entered the voiceless shades, lifting his hand, Babbalanja whispered:—\"This silence is a fit introduction to the portals of Telestic lore. Somewhere, beneath this moss, lurks the mystic stone Mnizuris; whereby Doxodox hath attained unto a knowledge of the ungenerated essences. Nightly, he bathes his soul in archangelical circumlucencies. Oh, Doxodox! whip me the Strophalunian top! Tell o\u0027er thy Jynges!\" \"Down, Azzageddi! down!\" cried Media. \"Behold: there sits the Wise One; now, for true wisdom!\" From the voices of the party, the sage must have been aware of our approach: but seated on a green bank, beneath the shade of a red mulberry, upon the boughs of which, many an owl was perched, he seemed intent upon describing divers figures in the air, with a jet-black wand. Advancing with much deference and humility, Babbalanja saluted him. \"Oh wise Doxodox! Drawn hither by thy illustrious name, we seek admittance to thy innermost wisdom. Of all Mardian, thou alone comprehendest those arcane combinations, whereby to drag to day the most deftly hidden things, present and to come. Thou knowest what we are, and what we shall be. We beseech thee, evoke thy Tselmns!\" \"Tetrads; Pentads; Hexads; Heptads; Ogdoads:—meanest thou those?\" \"New terms all!\" \"Foiled at thy own weapons,\" said Media. \"Then, if thou comprehendest not my nomenclature:—how my science? But let me test thee in the portico.—Why is it, that as some things extend more remotely than others; so, Quadammodotatives are larger than Qualitatives; forasmuch, as Quadammodotatives extend to those things, which include the Quadammodotatives themselves.\" \"Azzageddi has found his match,\" said Media. \"Still posed, Babbalanja?\" asked Mohi. \"At a loss, most truly! But I beseech thee, wise Doxodox! instruct me in thy dialectics, that I may embrace thy more recondite lore.\" \"To begin then, my child:—all Dicibles reside in the mind.\" \"But what are Dicibles?\" said Media. \"Meanest thou, Perfect or Imperfect Dicibles?\" Any kind you please;— but what are they?\" \"Perfect Dicibles are of various sorts: Interrogative; Percontative; Adjurative; Optative; Imprecative; Execrative; Substitutive; Compellative; Hypothetical; and lastly, Dubious.\" \"Dubious enough! Azzageddi! forever, hereafter, hold thy peace.\" \"Ah, my children! I must go back to my Axioms.\" \"And what are they?\" said old Mohi. \"Of various sorts; which, again, are diverse. Thus: my contrary axioms are Disjunctive, and Subdisjunctive; and so, with the rest. So, too, in degree, with my Syllogisms.\" \"And what of them?\" \"Did I not just hint what they were, my child? I repeat, they are of various sorts: Connex, and Conjunct, for example.\" \"And what of them?\" persisted Mohi; while Babbalanja, arms folded, stood serious and mute; a sneer on his lip. \"As with other branches of my dialectics: so, too, in their way, with my Syllogisms. Thus: when I say,—If it be warm, it is not cold:— that\u0027s a simple Sumption. If I add, But it is warm:—that\u0027s an Assumption.\" \"So called from the syllogist himself, doubtless;\" said Mohi, stroking his beard. \"Poor ignorant babe! no. Listen:—if finally, I say,—Therefore it is not cold that\u0027s the final inference.\" \"And a most triumphant one it is!\" cried Babbalanja. \"Thrice profound, and sapient Doxodox! Light of Mardi! and Beacon of the Universe! didst ever hear of the Shark-Syllogism?\" \"Though thy epithets be true, my child, I distrust thy sincerity. I. — have not yet heard of the syllogism to which thou referrest.\" \"It was thus. A shark seized a swimmer by the leg; addressing him: \u0027Friend, I will liberate you, if you truly answer whether you think I. — purpose harm.\u0027 Well knowing that sharks seldom were magnanimous, he replied: Kind sir, you mean me harm; now go your ways.\u0027 \u0027No, no; my conscience forbids. Nor will I falsify the words of so veracious a mortal. You were to answer truly; but you say I mean you harm:—so harm it is:—here goes your leg.\u0027\" \"Profane jester! Would\u0027st thou insult me with thy torn-foolery? Begone—all of ye! tramp! pack! I say: away with ye!\" and into the woods Doxodox himself disappeared. \"Bravely done, Babbalanja!\" cried Media. \"You turned the corner to admiration.\" \"I have hopes of our Philosopher yet,\" said Mohi. \"Outrageous impostor! fool, dotard, oaf! Did he think to bejuggle me with his preposterous gibberish? And is this shallow phraseman the renowned Doxodox whom I have been taught so highly to reverence? Alas, alas—Odonphi there is none!\" \"His fit again,\" sighed Yoomy. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2768/76514.html","bookId":1334,"book":{"id":1334,"title":"Mardi: and A Voyage Thither","description":"简介： Not long ago, having published two narratives of voyages in the Pacific, which, in many quarters, were received with incredulity, the thought occurred to me, of indeed writing a romance of Polynesian adventure, and publishing it as such; to see wheth...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2768","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
