{"id":27643,"no":180,"title":"CHAPTER LXXIII. — At Last, The Last Mention Is Made Of Old Bardianna","content":"At Last, The Last Mention Is Made Of Old Bardianna; And His Last Will And Testament Is Recited At Length The day was waning. And, as after many a tale of ghosts, around their forest fire, Hungarian gipsies silent sit; watching the ruddy glow kindling each other\u0027s faces;—so, now we solemn sat; the crimson West our fire; all our faces flushed. \"Testators!\" then cried Media, when your last wills are all round settled, speak, and make it known!\" \"Mine, my lord, has long been fixed,\" said Babbalanja. \"And how runs it?\" \"Fugle-fogle—\" \"Hark ye, intruding Azzageddi! rejoin thy merry mates below;—go there, and wag thy saucy tail; or I will nail it to our bow, till ye roar for liberation. Begone, I say.\" \"Down, devil! deeper down!\" rumbled Babbalanja. \"My lord, I think he\u0027s gone. And now, by your good leave, I\u0027ll repeat old Bardianna\u0027s Will. It\u0027s worth all Mardi\u0027s hearing; and I have so studied it, by rote I know it.\" \"Proceed then; but I mistrust that Azzageddi is not yet many thousand fathoms down.\" \"Attend my lord:—-\u0027Anno Mardis 50,000,000, o.s. I, Bardianna, of the island of Vamba, and village of the same name, having just risen from my yams, in high health, high spirits, and sound mind, do hereby cheerfully make and ordain this my last will and testament. \"\u0027Imprimis: \"\u0027All my kith and kin being well to do in Mardi, I wholly leave them out of this my will. \"\u0027Item. Since, in divers ways, verbally and otherwise, my good friend Pondo has evinced a strong love for me, Bardianna, as the owner and proprietor of all that capital messuage with the appurtenances, in Vamba aforesaid, called \u0027The Lair,\u0027 wherein I now dwell; also for all my Bread-fruit orchards, Palm-groves, Banana-plantations, Taro- patches, gardens, lawns, lanes, and hereditaments whatsoever, adjoining the aforesaid messuage;—I do hereby give and bequeath the same to Bomblum of the island of Adda; the aforesaid Bomblum having never expressed any regard for me, as a holder of real estate. \"\u0027Item. My esteemed neighbor Lakreemo having since the last lunar eclipse called daily to inquire after the state of my health: and having nightly made tearful inquiries of my herb-doctor, concerning the state of my viscera;—I do hereby give and bequeath to the aforesaid Lakreemo all and sundry those vegetable pills, potions, powders, aperients, purgatives, expellatives, evacuatives, tonics, emetics, cathartics, clysters, injections, scarifiers, cataplasms, lenitives, lotions, decoctions, washes, gargles, and phlegmagogues; together with all the jars, calabashes, gourds, and galipots, thereunto pertaining; situate, lying, and being, in the west-by-north corner of my east-southeast crypt, in my aforesaid tenement known as \u0027The Lair.\u0027 \"\u0027Item. The woman Pesti; a native of Vamba, having oftentimes hinted that I, Bardianna, sorely needed a spouse, and having also intimated that she bore me a conjugal affection; I do hereby give and bequeath to the aforesaid Pesti:—my blessing; forasmuch, as by the time of the opening of this my last will and testament, I shall have been forever delivered from the aforesaid Pesti\u0027s persecutions. \"\u0027Item. Having a high opinion of the probity of my worthy and excellent friend Bidiri, I do hereby entirely, and wholly, give, will, grant, bestow, devise, and utterly hand over unto the said Bidiri, all that tenement where my servant Oram now dwelleth; with all the lawns, meadows, uplands and lowlands, fields, groves, and gardens, thereunto belonging:—IN TRUST NEVERTHELESS to have and to hold the same for the sole use and benefit of Lanbranka Hohinna, spinster, now resident of the aforesaid island of Vamba. \"\u0027Item. I give and bequeath my large carved drinking gourd to my good comrade Topo. \"\u0027Item. My fast friend Doldrum having at sundry times, and in sundry places, uttered the prophecy, that upon my decease his sorrow would be great; I do hereby give and bequeath to the aforesaid Doldrum, ten yards of my best soft tappa, to be divided into handkerchiefs for his sole benefit and behoof. \"\u0027Item. My sensible friend Solo having informed me, that he intended to remain a bachelor for life; I give and devise to the aforesaid Solo, the mat for one person, whereon I nightly repose. \"\u0027Item. Concerning my private Arbor and Palm-groves, adjoining, lying, and being in the isle of Vamba, I give and devise the same, with all appurtenances whatsoever, to my friend Minta the Cynic, to have and to hold, in trust for the first through-and-through honest man, issue of my neighbor Mondi; and in default of such issue, for the first through-and-through honest man, issue of my neighbor Pendidda; and in default of such issue, for the first through-and-through honest man, issue of my neighbor Wynodo: and in default of such issue, to any through-and-through honest man, issue of any body, to be found through the length and breadth of Mardi. \"\u0027Item. My friend Minta the Cynic to be sole judge of all claims to the above-mentioned devise; and to hold the said premises for his own use, until the aforesaid person be found. \"\u0027Item. Knowing my devoted scribe Marko to be very sensitive touching the receipt of a favor; I willingly spare him that pain; and hereby bequeath unto the aforesaid scribe, three milk-teeth, not as a pecuniary legacy, but as a very slight token of my profound regard. \"\u0027Item. I give to the poor of Vamba the total contents of my red- labeled bags of bicuspids and canines (which I account three-fourths of my whole estate); to my body servant Fidi, my staff, all my robes and togas, and three hundred molars in cash; to that discerning and sagacious philosopher my disciple Krako, one complete set of denticles, to buy him a vertebral bone ring; and to that pious and promising youth Vangi, two fathoms of my best kaiar rope, with the privilege of any bough in my groves. \"\u0027All the rest of my goods, chattels and household stuff whatsoever; and all my loose denticles, remaining after my debts and legacies are paid, and my body is out of sight, I hereby direct to be distributed among the poor of Vamba. \"\u0027Ultimo. I give and bequeath to all Mardi this my last advice and counsel:—videlicet: live as long as you can; close your own eyes when you die. \"\u0027I have no previous wills to revoke; and publish this to be my first and last. \"\u0027In witness whereof, I have hereunto set my right hand; and hereunto have caused a true copy of the tattooing on my right temple to be affixed, during the year first above written. \"\u0027By me, BARDIANNA.\u0027\" \"Babbalanja, that\u0027s an extraordinary document,\" said Media. \"Bardianna was an extraordinary man, my lord.\" \"Were there no codicils?\" \"The will is all codicils; all after-thoughts; Ten thoughts for one act, was Bardianna\u0027s motto.\" \"Left he nothing whatever to his kindred?\" \"Not a stump.\" \"Prom his will, he seems to have lived single.\" \"Yes: Bardianna never sought to improve upon nature; a bachelor he was born, and a bachelor he died.\" \"According to the best accounts, how did he depart, Babbalanja?\" asked Mohi. \"With a firm lip, and his hand on his heart, old man.\" \"His last words?\" \"Calmer, and better!\" \"Where think you, he is now?\" \"In his Ponderings. And those, my lord, we all inherit; for like the great chief of Romara, who made a whole empire his legatee; so, great authors have all Mardi for an heir.\"","sourceLink":"http://novel.tingroom.com/duanpian/2768/76520.html","bookId":1334,"book":{"id":1334,"title":"Mardi: and A Voyage Thither","description":"简介： Not long ago, having published two narratives of voyages in the Pacific, which, in many quarters, were received with incredulity, the thought occurred to me, of indeed writing a romance of Polynesian adventure, and publishing it as such; to see wheth...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2768","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
