{"id":27524,"no":61,"title":"CHAPTER LIX — Their Morning Meal","content":"Not wholly is our world made up of bright stars and bright eyes: so now to our story. A conscientious host should ever be up betimes, to look after the welfare of his guests, and see to it that their day begin auspiciously. King Media announced the advent of the sun, by rustling at my bower\u0027s eaves in person. A repast was spread in an adjoining arbor, which Media\u0027s pages had smoothed for our reception, and where his subordinate chiefs were in attendance. Here we reclined upon mats. Balmy and fresh blew the breath of the morning; golden vapors were upon the mountains, silver sheen upon the grass; and the birds were at matins in the groves; their bright plumage flashing into view, here and there, as if some rainbow were crouching in the foliage. Spread before us were viands, served in quaint-shaped, curiously-dyed gourds, not Sevres, but almost as tasteful; and like true porcelain, fire had tempered them. Green and yielding, they are plucked from the tree; and emptied of their pulp, are scratched over with minute marks, like those of a line engraving. The ground prepared, the various figures are carefully etched. And the outlines filled up with delicate punctures, certain vegetable oils are poured over them, for coloring. Filled with a peculiar species of earth, the gourd is now placed in an oven in the ground. And in due time exhumed, emptied of its contents, and washed in the stream, it presents a deep-dyed exterior; every figure distinctly traced and opaque, but the ground semi-transparent. In some cases, owing to the variety of dyes employed, each figure is of a different hue. More glorious goblets than these for the drinking of wine, went never from hand to mouth. Capacious as pitchers, they almost superseded decanters. Now, in a tropical climate, fruit, with light wines, forms the only fit meal of a morning. And with orchards and vineyards forever in sight, who but the Hetman of the Cossacs would desire more? We had plenty of the juice of the grape. But of this hereafter; there are some fine old cellars, and plenty of good cheer in store. During the repast, Media, for a time, was much taken up with our raiment. He begged me to examine for a moment the texture of his right royal robe, and observe how much superior it was to my own. It put my mantle to the blush; being tastefully stained with rare devices in red and black; and bordered with dyed fringes of feathers, and tassels of red birds\u0027 claws. Next came under observation the Skyeman\u0027s Guayaquil hat; at whose preposterous shape, our host laughed in derision; clapping a great conical calabash upon the head of an attendant, and saying that now he was Jarl. At this, and all similar sallies, Samoa was sure to roar louder than any; though mirth was no constitutional thing with him. But he seemed rejoiced at the opportunity of turning upon us the ridicule, which as a barbarian among whites, he himself had so often experienced. These pleasantries over, King Media very slightly drew himself up, as if to make amends for his previous unbending. He discoursed imperially with his chiefs; nodded his sovereign will to his pages; called for another gourd of wine; in all respects carrying his royalty bravely. The repast concluded, we journeyed to the canoe-house, where we found the little Chamois stabled like a steed. One solitary depredation had been committed. Its sides and bottom had been completely denuded of the minute green barnacles, and short sea-grass, which, like so many leeches, had fastened to our planks during our long, lazy voyage. By the people they had been devoured as dainties.","sourceLink":"http://novel.tingroom.com/duanpian/2768/76401.html","bookId":1334,"book":{"id":1334,"title":"Mardi: and A Voyage Thither","description":"简介： Not long ago, having published two narratives of voyages in the Pacific, which, in many quarters, were received with incredulity, the thought occurred to me, of indeed writing a romance of Polynesian adventure, and publishing it as such; to see wheth...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2768","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
