{"id":27534,"no":71,"title":"CHAPTER LXIX — The Company Discourse, And Braid-Beard Rehearses A Legend","content":"Finding in Valapee no trace of her whom we sought, and but little pleased with the cringing demeanor of the people, and the wayward follies of Peepi their lord, we early withdrew from the isle. As we glided away, King Media issued a sociable decree. He declared it his royal pleasure, that throughout the voyage, all stiffness and state etiquette should be suspended: nothing must occur to mar the freedom of the party. To further this charming plan, he doffed his symbols of royalty, put off his crown, laid aside his scepter, and assured us that he would not wear them again, except when we landed; and not invariably, then. \"Are we not all now friends and companions?\" he said. \"So companions and friends let us be. I unbend my bow; do ye likewise.\" \"But are we not to be dignified?\" asked Babbalanja. \"If dignity be free and natural, be as dignified as you please; but away with rigidities.\" \"Away they go,\" said Babbalanja; \"and, my lord, now that you mind me of it, I have often thought, that it is all folly and vanity for any man to attempt a dignified carriage. Why, my lord,\"—frankly crossing his legs where he lay—\"the king, who receives his ambassadors with a majestic toss of the head, may have just recovered from the tooth- ache. That thought should cant over the spine he bears so bravely.\" \"Have a care, sir! there is a king within hearing.\" \"Pardon, my lord; I was merely availing myself of the immunity bestowed upon the company. Hereafter, permit a subject to rebel against your sociable decrees. I will not be so frank any more.\" \"Well put, Babbalanja; come nearer; here, cross your legs by mine; you have risen a cubit in my regard. Vee-Vee, bring us that gourd of wine; so, pass it round with the cups. Now, Yoomy, a song!\" And a song was sung. And thus did we sail; pleasantly reclining on the mats stretched out beneath the canopied howdah. At length, we drew nigh to a rock, called Pella, or The Theft. A high, green crag, toppling over its base, and flinging a cavernous shadow upon the lagoon beneath, bubbling with the moisture that dropped. Passing under this cliff was like finding yourself, as some sea- hunters unexpectedly have, beneath the open, upper jaw of a whale; which, descending, infallibly entombs you. But familiar with the rock, our paddlers only threw back their heads, to catch the cool, pleasant tricklings from the mosses above. Wiping away several glittering beads from his beard, old Mohi turning round where he sat, just outside the canopy, solemnly affirmed, that the drinking of that water had cured many a man of ambition. \"How so, old man?\" demanded Media. \"Because of its passing through the ashes of ten kings, of yore buried in a sepulcher, hewn in the heart of the rock.\" \"Mighty kings, and famous, doubtless,\" said Babbalanja, \"whose bones were thought worthy of so noble and enduring as urn. Pray, Mohi, their names and terrible deeds.\" \"Alas! their sepulcher only remains.\" \"And, no doubt, like many others, they made that sepul for themselves. They sleep sound, my word for it, old man. But I — very much question, if, were the rock rent, any ashes would be found. Mohi, I deny that those kings ever had any bones to bury.\" \"Why, Babbalanja,\" said Media, \"since you intimate that they never had ghosts to give up, you ignore them in toto; denying the very fact of their being even defunct.\" \"Ten thousand pardons, my lord, no such discourtesy would I do the anonymous memory of the illustrious dead. But whether they ever lived or not, it is all the same with them now. Yet, grant that they lived; then, if death be a deaf-and-dumb death, a triumphal procession over their graves would concern them not. If a birth into brightness, then Mardi must seem to them the most trivial of reminiscences. Or, perhaps, theirs may be an utter lapse of memory concerning sublunary things; and they themselves be not themselves, as the butterfly is not the larva.\" Said Yoomy, \"Then, Babbalanja, you account that a fit illustration of the miraculous change to be wrought in man after death?\" \"No; for the analogy has an unsatisfactory end. From its chrysalis state, the silkworm but becomes a moth, that very quickly expires. Its longest existence is as a worm. All vanity, vanity, Yoomy, to seek in nature for positive warranty to these aspirations of ours. Through all her provinces, nature seems to promise immortality to life, but destruction to beings. Or, as old Bardianna has it, if not against us, nature is not for us.\" Said Media, rising, \"Babbalanja, you have indeed put aside the courtier; talking of worms and caterpillars to me, a king and a demi- god! To renown, for your theme: a more agreeable topic.\" \"Pardon, once again, my lord. And since you will, let us discourse of that subject. First, I lay it down for an indubitable maxim, that in itself all posthumous renown, which is the only renown, is valueless. Be not offended, my lord. To the nobly ambitious, renown hereafter may be something to anticipate. But analyzed, that feverish typhoid feeling of theirs may be nothing more than a flickering fancy, that now, while living, they are recognized as those who will be as famous in their shrouds, as in their girdles.\" Said Yoomy, \"But those great and good deeds, Babbalanja, of which the philosophers so often discourse: must it not be sweet to believe that their memory will long survive us; and we ourselves in them?\" \"I speak now,\" said Babbalanja, \"of the ravening for fame which even appeased, like thirst slaked in the desert, yields no felicity, but only relief; and which discriminates not in aught that will satisfy its cravings. But let me resume. Not an hour ago, Braid-Beard was telling us that story of prince Ottimo, who inodorous while living, expressed much delight at the prospect of being perfumed and embalmed, when dead. But was not Ottimo the most eccentric of mortals? For few men issue orders for their shrouds, to inspect their quality beforehand. Far more anxious are they about the texture of the sheets in which their living limbs lie. And, my lord, with some rare exceptions, does not all Mardi, by its actions, declare, that it is far better to be notorious now, than famous hereafter?\" \"A base sentiment, my lord,\" said Yoomy. \"Did not poor Bonja, the unappreciated poet, console himself for the neglect of his contemporaries, by inspiriting thoughts of the future?\" \"In plain words by bethinking him of the glorious harvest of bravos his ghost would reap for him,\" said Babbalanja; \"but Banjo,—Bonjo,— Binjo,—I never heard of him.\" \"Nor I,\" said Mohi. \"Nor I,\" said Media. \"Poor fellow!\" cried Babbalanja; \"I fear me his harvest is not yet ripe.\" \"Alas!\" cried Yoomy; \"he died more than a century ago.\" \"But now that you speak of unappreciated poets, Yoomy,\" said Babbalanja, \"Shall I give you a piece of my mind?\" \"Do,\" said Mohi, stroking his beard. \"He, who on all hands passes for a cypher to-day, if at all remembered hereafter, will be sure to pass for the same. For there is more likelihood of being overrated while living, than of being underrated when dead. And to insure your fame, you must die.\" \"A rather discouraging thought for your race. But answer: I assume that King Media is but a mortal like you; now, how may I best perpetuate my name?\" Long pondered Babbalanja; then said, \"Carve it, my lord, deep into a ponderous stone, and sink it, face downward, into the sea; for the unseen foundations of the deep are more enduring than the palpable tops of the mountains.\" Sailing past Pella, we gained a view of its farther side; and seated in a lofty cleft, beheld a lonely fisherman; solitary as a seal on an iceberg; his motionless line in the water. \"What recks he of the ten kings,\" said Babbalanja. \"Mohi,\" said Media, \"methinks there is another tradition concerning that rock: let us have it.\" \"In old times of genii and giants, there dwelt in barren lands, not very remote from our outer reef, but since submerged, a band of evil- minded, envious goblins, furlongs in stature, and with immeasurable arms; who from time to time cast covetous glances upon our blooming isles. Long they lusted; till at last, they waded through the sea, strode over the reef, and seizing the nearest islet, rolled it over and over, toward an adjoining outlet. \"But the task was hard; and day-break surprised them in the midst of their audacious thieving; while in the very act of giving the devoted land another doughty surge and Somerset. Leaving it bottom upward and midway poised, gardens under water, its foundations in air, they precipitately fled; in their great haste, deserting a comrade, vainly struggling to liberate his foot caught beneath the overturned land.\" \"This poor fellow now raised such an outcry, as to awaken the god Upi, or the Archer, stretched out on a long cloud in the East; who forthwith resolved to make an example of the unwilling lingerer. Snatching his bow, he let fly an arrow. But overshooting its mark, it pierced through and through, the lofty promontory of a neighboring island; making an arch in it, which remaineth even unto this day. A second arrow, however, accomplished its errand: the slain giant sinking prone to the bottom.\" \"And now,\" added Mohi, \"glance over the gunwale, and you will see his remains petrified into white ribs of coral.\" \"Ay, there they are,\" said Yoomy, looking down into the water where they gleamed. \"A fanciful legend, Braid-beard.\" \"Very entertaining,\" said Media. \"Even so,\" said Babbalanja. \"But perhaps we lost time in listening to it; for though we know it, we are none the wiser.\" \"Be not a cynic,\" said Media. \"No pastime is lost time.\" Musing a moment, Babbalanja replied, \"My lord, that maxim may be good as it stands; but had you made six words of it, instead of six syllables, you had uttered a better and a deeper.\"","sourceLink":"http://novel.tingroom.com/duanpian/2768/76411.html","bookId":1334,"book":{"id":1334,"title":"Mardi: and A Voyage Thither","description":"简介： Not long ago, having published two narratives of voyages in the Pacific, which, in many quarters, were received with incredulity, the thought occurred to me, of indeed writing a romance of Polynesian adventure, and publishing it as such; to see wheth...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2768","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
