{"id":27537,"no":74,"title":"CHAPTER LXXII — A Book From The Chronicles Of Mohi","content":"Many ages ago, there reigned in Juam a king called Teei. This Teei\u0027s succession to the sovereignty was long disputed by his brother Marjora; who at last rallying round him an army, after many vicissitudes, defeated the unfortunate monarch in a stout fight of clubs on the beach. In those days, Willamilla during a certain period of the year was a place set apart for royal games and diversions; and was furnished with suitable accommodations for king and court. From its peculiar position, moreover, it was regarded as the last stronghold of the Juam monarchy: in remote times having twice withstood the most desperate assaults from without. And when Roonoonoo, a famous upstart, sought to subdue all the isles in this part of the Archipelago, it was to Willamilla that the banded kings had repaired to take counsel together; and while there conferring, were surprised at the sudden onslaught of Roonoonoo in person. But in the end, the rebel was captured, he and all his army, and impaled on the tops of the hills. Now, defeated and fleeing for his life, Teei with his surviving followers was driven across the plain toward the mountains. But to cut him off from all escape to inland Willamilla, Marjora dispatched a fleet band of warriors to occupy the entrance of the defile. Nevertheless, Teei the pursued ran faster than his pursuers; first gained the spot; and with his chiefs, fled swiftly down the gorge, closely hunted by Marjora\u0027s men. But arriving at the further end, they in vain sought to defend it. And after much desperate fighting, the main body of the foe corning up with great slaughter the fugitives were driven into the glen. They ran to the opposite wall of cliff; where turning, they fought at bay, blood for blood, and life for life, till at last, overwhelmed by numbers, they were all put to the point of the spear. With fratricidal hate, singled out by the ferocious Marjora, Teei fell by that brother\u0027s hand. When stripping from the body the regal girdle, the victor wound it round his own loins; thus proclaiming himself king over Juam. Long torn by this intestine war, the island acquiesced in the new sovereignty. But at length a sacred oracle declared, that since the conqueror had slain his brother in deep Willamilla, so that Teei never more issued from that refuge of death; therefore, the same fate should be Marjora\u0027s; for never, thenceforth, from that glen, should he go forth; neither Marjora; nor any son of his girdled loins; nor his son\u0027s sons; nor the uttermost scion of his race. But except this denunciation, naught was denounced against the usurper; who, mindful of the tenure by which he reigned, ruled over the island for many moons; at his death bequeathing the girdle to his son. In those days, the wildest superstitions concerning the interference of the gods in things temporal, prevailed to a much greater extent than at present. Hence Marjora himself, called sometimes in the traditions of the island, The-Heart-of-Black-Coral, even unscrupulous Marjora had quailed before the oracle. \"He bowed his head,\" say the legends. Nor was it then questioned, by his most devoted adherents, that had he dared to act counter to that edict, he had dropped dead, the very instant he went under the shadow of the defile. This persuasion also guided the conduct of the son of Marjora, and that of his grandson. But there at last came to pass a change in the popular fancies concerning this ancient anathema. The penalty denounced against the posterity of the usurper should they issue from the glen, came to be regarded as only applicable to an invested monarch, not to his relatives, or heirs. A most favorable construction of the ban; for all those related to the king, freely passed in and out of Willamilla. From the time of the usurpation, there had always been observed a certain ceremony upon investing the heir to the sovereignty with the girdle of Teei. Upon these occasions, the chief priests of the island were present, acting an important part. For the space of as many days, as there had reigned kings of Marjora\u0027s dynasty, the inner mouth of the defile remained sealed; the new monarch placing the last stone in the gap. This symbolized his relinquishment forever of all purpose of passing out of the glen. And without this observance, was no king girdled in Juam. It was likewise an invariable custom, for the heir to receive the regal investiture immediately upon the decease of his sire. No delay was permitted. And instantly upon being girdled, he proceeded to take part in the ceremony of closing the cave; his predecessor yet remaining uninterred on the purple mat where he died. In the history of the island, three instances were recorded; wherein, upon the vacation of the sovereignty, the immediate heir had voluntarily renounced all claim to the succession, rather than surrender the privilege of roving, to which he had been entitled, as a prince of the blood. Said Rani, one of these young princes, in reply to the remonstrances of his friends, \"What! shall I be a king, only to be a slave? Teei\u0027s girdle would clasp my waist less tightly, than my soul would be banded by the mountains of Willamilla. A subject, I am free. No slave in Juam but its king; for all the tassels round his loins.\" To guard against a similar resolution in the mind of his only son, the wise sire of Donjalolo, ardently desirous of perpetuating his dignities in a child so well beloved, had from his earliest infancy, restrained the boy from passing out of the glen, to contract in the free air of the Archipelago, tastes and predilections fatal to the inheritance of the girdle. But as he grew in years, so impatient became young Donjalolo of the king his father\u0027s watchfulness over him, though hitherto a most dutiful son, that at last he was prevailed upon by his youthful companions to appoint a day, on which to go abroad, and visit Mardi. Hearing this determination, the old king sought to vanquish it. But in vain. And early on the morning of the day, that Donjalolo was to set out, he swallowed poison, and died; in order to force his son into the instant assumption of the honors thus suddenly inherited. The event, but not its dreadful circumstances, was communicated to the prince; as with a gay party of young chiefs, he was about to enter the mouth of the defile. \"My sire dead!\" cried Donjalolo. \"So sudden, it seems a bolt from Heaven.\" And bursting into exclamations of grief, he wept upon the bosom of Talara his friend. But starting from his side:—\"My fate converges to a point. If I but cross that shadow, my kingdom is lost. One lifting of my foot, and the girdle goes to my proud uncle Darfi, who would so joy to be my master. Haughty Dwarf! Oh Oro! would that I had ere this passed thee, fatal cavern; and seen for myself, what outer Mardi is. Say ye true, comrades, that Willamilla is less lovely than the valleys without? that there is bright light in the eyes of the maidens of Mina? and wisdom in the hearts of the old priests of Maramma; that it is pleasant to tread the green earth where you will; and breathe the free ocean air? Would, oh would, that I were but the least of yonder sun-clouds, that look down alike on Willamilla and all places besides, that I might determine aright. Yet why do I pause? did not Rani, and Atama, and Mardonna, my ancestors, each see for himself, free Mardi; and did they not fly the proffered girdle; choosing rather to be free to come and go, than bury themselves forever in this fatal glen? Oh Mardi! Mardi! art thou then so fair to see? Is liberty a thing so glorious? Yet can I be no king, and behold thee! Too late, too late, to view thy charms and then return. My sire! my sire! thou hast wrung my heart with this agony of doubt. Tell me, comrades,—for ye have seen it,—is Mardi sweeter to behold, than it is royal to reign over Juam? Silent, are ye? Knowing what ye do, were ye me, would ye be kings? Tell me, Talara.—No king: no king:—that were to obey, and not command. And none hath Donjalolo ere obeyed but the king his father. A king, and my voice may be heard in farthest Mardi, though I abide in narrow Willamilla. My sire! my sire! Ye flying clouds, what look ye down upon? Tell me, what ye see abroad? Methinks sweet spices breathe from out the cave.\" \"Hail, Donjalolo, King of Juam,\" now sounded with acclamations from the groves. Starting, the young prince beheld a multitude approaching: warriors with spears, and maidens with flowers; and Kubla, a priest, lifting on high the tasseled girdle of Teei, and waving it toward him. The young chiefs fell back. Kubla, advancing, came close to the prince, and unclasping the badge of royalty, exclaimed, \"Donjalolo, this instant it is king or subject with thee: wilt thou be girdled monarch?\" Gazing one moment up the dark defile, then staring vacantly, Donjalolo turned and met the eager gaze of Darfi. Stripping off his mantle, the next instant he was a king. Loud shouted the multitude, and exulted; but after mutely assisting at the closing of the cavern, the new-girdled monarch retired sadly to his dwelling, and was not seen again for many days. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2768/76414.html","bookId":1334,"book":{"id":1334,"title":"Mardi: and A Voyage Thither","description":"简介： Not long ago, having published two narratives of voyages in the Pacific, which, in many quarters, were received with incredulity, the thought occurred to me, of indeed writing a romance of Polynesian adventure, and publishing it as such; to see wheth...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2768","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
