{"id":27552,"no":89,"title":"CHAPTER LXXXVII — Nora-Bamma","content":"Still onward gliding, the lagoon a calm. Hours pass; and full before us, round and green, a Moslem turban by us floats—Nora-Bamma, Isle of Nods. Noon-tide rolls its flood. Vibrates the air, and trembles. And by illusion optical, thin-draped in azure haze, drift here and there the brilliant lands: swans, peacock-plumaged, sailing through the sky. Down to earth hath heaven come; hard telling sun-clouds from the isles. And high in air nods Nora-Bamma. Nid-nods its tufted summit like three ostrich plumes; its beetling crags, bent poppies, shadows, willowy shores, all nod; its streams are murmuring down the hills; its wavelets hush the shore. Who dwells in Nora-Bamma? Dreamers, hypochondriacs, somnambulists; who, from the cark and care of outer Mardi fleeing, in the poppy\u0027s jaded odors, seek oblivion for the past, and ecstasies to come. Open-eyed, they sleep and dream; on their roof-trees, grapes unheeded drop. In Nora-Bamma, whispers are as shouts; and at a zephyr\u0027s breath, from the woodlands shake the leaves, as of humming-birds, a flight. All this spake Braid-Beard, of the isle. How that none ere touched its strand, without rendering instant tribute of a nap; how that those who thither voyaged, in golden quest of golden gourds, fast dropped asleep, ere one was plucked; waking not till night; how that you must needs rub hard your eyes, would you wander through the isle; and how that silent specters would be met, haunting twilight groves, and dreamy meads; hither gliding, thither fading, end or purpose none. True or false, so much for Mohi\u0027s Nora Bamma. But as we floated on, it looked the place described. We yawned, and yawned, as crews of vessels may; as in warm Indian seas, their winnowing sails all swoon, when by them glides some opium argosie.","sourceLink":"http://novel.tingroom.com/duanpian/2768/76429.html","bookId":1334,"book":{"id":1334,"title":"Mardi: and A Voyage Thither","description":"简介： Not long ago, having published two narratives of voyages in the Pacific, which, in many quarters, were received with incredulity, the thought occurred to me, of indeed writing a romance of Polynesian adventure, and publishing it as such; to see wheth...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2768","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
