{"id":34128,"no":39,"title":"CHAPTER IV","content":"D. John started from Madrid to embark at Barcelona on Wednesday, the 6th of June, 1571, at three o\u0027clock in the afternoon. He was accompanied only by his Master of the Horse D. Luis de Córdoba, his gentleman D. Juan de Gúzman, the secretary Juan de Soto, the valet Jorge de Lima, a caterer, a cook, two D. Juanillos or fools, two couriers, a guide and three servants, in all fifteen horses. The rest of his following and servants had been divided into two parties, one which went on ahead with his Lord Steward the Conde de Priego, and the other which followed under the chamberlain D. Rodrigo de Benavides. D. John had arranged this in order to set out more quietly, and to avoid the manifestations of the love and enthusiasm of the people of Madrid, which he well knew not to be to the taste of certain personages. His precaution, however, was useless, because the people got wind of his departure, and from the morning waited in the little square of Santiago, watching for his coming, and when he got to the gate of Guadalajara, the crowd was so great, that it overflowed into the country and extended all along the side of the road. \\n\\n \\n\\n The magnificent Roman gate called Guadalajara still existed then, its strong blocks of rock united by an enormous arch with railings and balustrades of the same golden stone. Above this archway, and standing out bravely between two towers, was the beautiful chapel with two altars, one to venerate the figure of Our Lady, called la Mayor, the other that of a Guardian Angel, with a naked sword in his right hand and a model of Madrid in his left. All travellers used to pray there, and following the usual custom, D. John alighted and mounted to the chapel; and he appeared afterwards at the railing to bow to the people, who were acclaiming him, and such were the cries of blessing, good-byes and hurrahs, that, according to a writer of the time, \"it resounded more than was necessary in some crooked ears.\" \\n\\n \\n\\n D. John slept that night at Guadalajara, in the country house of the Duque del Infantado, who was waiting there for D. John, with his two brothers D. Rodrigo and D. Diego de Mendoza, his brother-in-law the Duque de Medina de Rioseco, and the Conde de Orgaz, all most intimate friends of D. John. He spent Thursday there, and on Friday, after dinner, continued his journey, with more haste and courage, says Vander Hammen, than pleased those who followed him. D. John truly journeyed with a light heart, and the way seemed long which separated him from his dreams of glory. His absolute confidence in Do?a Magdalena and her promises had dispelled the fears he had for his mother\u0027s future, and the affectionate farewell, and fatherly, prudent warnings of his brother the King, had made him believe that the murmurs and tittle-tattle of those envious of him had made no impression on the severe monarch. So D. John was at peace, and he smiled at life, as fortune smiled on him; he received everywhere honours and ovations, and, what pleased him more, sincere marks of love and appreciation. A courier overtook him at Calatayud with a papal brief and letters from Marco Antonio Colonna, General of the pontifical fleet, and from the Cardinal Granvelle, temporary Viceroy of Naples, urging him to come to Messina, which was the meeting-place of the fleets of the Holy League. \\n\\n \\n\\n He stopped two days at Montserrat to visit the celebrated sanctuary of the Virgin, and on Saturday, the 16th of June, he entered Barcelona at five in the evening, amidst the salutes of artillery on land and sea, the pealing of bells and the cheers of an enormous crowd. The Prior D. Hernando de Toledo, who was Viceroy of Catalonia, received him, with all the magistrates and nobility and the Knight Commander D. Luis de Requesens, D. John\u0027s naval lieutenant, who had been awaiting him there for three days. The city overflowed with the noise and animation natural to a seaport on the eve of the embarkation of a great enterprise. Flags were plentiful at sea, and on land soldiers, adventurers, and those seeking to be enlisted, long strings of slaves destined to row in the galleys, noble volunteers with brilliant suites, workmen from other arsenals who had come to work in these dockyards, merchandise of all kinds, pedlars, friars looking for souls, women seeking gain, and the curious who thronged the streets and encumbered the dock, already full of chests of provisions and ammunition, piles of arms, and pieces of artillery waiting to be put on board ship. \\n\\n \\n\\n D. John was in his element, and with intelligent and methodical activity at once began to receive information and to take measures to hasten the embarkation. He took counsel of the Knight Commander, the Viceroy of Catalonia, and the secretary Juan de Soto, and decided first to send an urgent message to the Marqués de Santa Cruz, who was at Cartagena, and to Sancho de Leiva and Gil de Andrade, who were waiting at Majorca, to come with the galleys they commanded to Barcelona; these last were to bring all the biscuit they possibly could. The Archdukes Rudolph and Ernest then arrived, as they were to embark with D. John to go from Genoa to their own home, and the next day, at four o\u0027clock in the afternoon, the merry pealing of all the bells and the shouts of the people announced that the galleys of Gil Andrade and of Sancho de Leiva were in sight. \\n\\n \\n\\n They entered the bay at nine that night, in battle array, with beautiful illuminations on yards and sides, firing salutes of arquebuses, which were answered by all the cannon of the city\u0027s walls and dockyards. \\n\\n \\n\\n D. John\u0027s royal galley came with these, the same built for him on his first expedition against the corsairs of the Mediterranean. The next morning, very early, he went to visit her, and was pleased with the new improvements, made under Sancho de Leiva\u0027s directions, following the original plan of Bergamesco and Tortilla. The hull had been carefully careened, the paintings and ornaments renovated, the sails and rigging renewed, and the artillery reinforced. The figure-head was changed, and instead of the former Hercules with his club was a Neptune, holding his trident, riding on a dolphin, and at the stern a new goddess—Thetis, between two golden eagles with black outlines, and above two life-sized lions, also gilded, supporting the arms of the King, those of D. John of Austria, and the Golden Fleece, whose chains ran along each side, standing out well on the red background, and joining at the prow. The old lantern with its statue of Fame had disappeared, and in its place, crowning the stern, were three great lanterns of bronze and copper, gilt outside and silvered inside, with figures of Faith, Hope and Charity, more than a palm high. The deck of the round-house was also new, formed of ninety squares of walnut, with outlines of ebony, boxwood, tin and blue enamel, with a large flower in gilt bronze in the centre of each; one could open these squares by means of a key, and beneath appeared chests in which were stored, in beautiful little wicker baskets, fresh bread, fruit, and all the service for the table. The crew wore as uniform jerkins of crimson damask, with little caps of the same, and the greatest order and cleanliness reigned everywhere. \\n\\n \\n\\n D. John was very pleased with his galley, and on the 1st of July he took his two nephews, the Archdukes Rudolph and Ernest, to visit her and gave them a collation. The galley was decked with streamers and pennons, and was adorned from stem to stern with red cloth, with many flowers and ribbons and crimson damask, which covered the bows. They arrived in a big boat, all hung with tapestry, and with a canopy of damask at the stern, under which their Highnesses sat; the twelve rowers wearing jerkins of crimson damask, and caps of the same slashed and trimmed with gold and feathers. \\n\\n \\n\\n When the Princes embarked on the galley, the slaves made their \"salva de forzado,\" which was a kind of song, or rather a sad complaining but not disagreeable cry, by which these wretches implored mercy of the visitors. Then a royal salute was fired from all her guns, which was answered by the galleys in the port. The Princes sat at a table in front of the roundhouse, under an awning of damask with crimson and white stripes, and there was served a collation of fruit, sweetmeats, green and cool drinks, which the heat of the day made delicious. \\n\\n \\n\\n Meanwhile, at the stern a band of musicians dressed in turquoise brocade were playing, and to their music the crew were executing a sort of flying dance, jumping, climbing, and doing a thousand feats among the yards, topsails, masts and rigging, with such agility, quickness and order that it was a spectacle of real merit. \\n\\n \\n\\n When the Princes rose, the Viceroy, the Knight Commander and all the gentlemen of the suites were served at the same table, with equal plenty, and at nightfall D. John regained the Viceroy\u0027s palace, where he was living, and where was waiting for him the greatest blow, perhaps, he ever received in his life, as it was the first and the most unexpected. \\n\\n \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1668/49156.html","bookId":1193,"book":{"id":1193,"title":"The Story of Don John of Austria","description":"简介： In one of the addresses delivered at the time of Padre Coloma\u0027s admission to the Real Academia Espa?ola there is a reference to Jeromn, as this Story of Don John of Austria is called in Spanish, which says that it awakes great interest in the reader...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1668","creation":"Aug 1, 2019 12:24:34 AM","modification":"Aug 1, 2019 12:24:34 AM"}}
