{"id":34145,"no":56,"title":"CHAPTER VIII","content":"Meanwhile the capture of Tunis had made patent to all Europe how deep was the wound that the credit and power of the Ottoman Empire had received at Lepanto. This great defeat was no doubt a disaster for the Turks; but a glorious disaster, both on account of the deeds of valour they had performed, and the titanic efforts it cost the victors to gain the triumph. The flight from Tunis without firing a shot, at the mere presence of D. John two years after this rude warning, showed how deeply rooted was the terror in the souls of the infidels, and how the renown of the Christian bravery had been enhanced, especially that of the Spaniards. All this cruelly wounded the overweening pride of Selim, and he was consumed with the desire of avenging himself by reconquering Tunis and Goletta. He was urged, with malicious eagerness, to undertake this enterprise by Aluch Ali and the renegade Mustafa, one of the engineers who built Goletta in the time of Charles V. The name of this traitor was Jacobo Zitolomini. Resenting the treatment he had received from Philip II, he fled to Algiers to Aluch Ali, who took him to Constantinople, where he revealed to Selim a sure and secret way of taking Goletta. At the beginning of May, 1574, D. John received an urgent message from Gabrio Cervelloni, to say that the Turks were preparing a very powerful fleet; that it was feared that they would fall suddenly upon Tunis, and that, in consequence of this, funds should be sent as quickly as possible to finish the new fort, which was not yet completed. D. John was at Genoa, quieting the disturbances there, and he hastened to send the Commissary of the Fleet Juan de Soto to Madrid, to warn Philip II of the danger which threatened. The King was not much alarmed about this, and, perhaps, saw a prompt and certain opportunity of ridding himself of this care and worry of Tunis. At any rate, his answer makes it clear that this new conquest was the least of his cares, and while writing to Cardinal Granvelle, Viceroy of Naples, and to the Duque de Terranova, Regent of Sicily, that they were to guard the ports and reinforce the garrisons, especially in Messina, Augusta, Syracuse, Trapani and Palermo, he contented himself with adding that they were not to forget to help his brother, and to look after the coast of Barbary. He also ordered D. García de Toledo and the Marqués de Santa Cruz to watch how D. John was garrisoning Goletta, and to the latter the King wrote that he was to do what he judged best in the matter, but that he was to remember that he had said that 2000 foot soldiers were enough to defend Goletta. D. John then sent D. Juan de Cardona with all the galleys under his command to Tunis without loss of time, taking the help for which Gabrio Cervelloni craved. This was not sufficient, and those in Tunis reiterated their request. D. John then exhausted all his resources, and sent D. Bernardino de Velasco with twenty Neapolitan galleys and four companies of Italian infantry. With these comings and goings summer was getting old, and on the 13th of August, at the Cape of Carthage, appeared the dreaded Turkish fleet of 300 ships and 60,000 soldiers, the fleet being commanded by Aluch Ali, and the troops by Selim\u0027s son-in-law Sinan Pasha, the renegade. A great outcry arose at the extreme peril of the Barbary Christians, and by every means in their power they sent to ask help from Granvelle, Terranova, and, above all, from D. John of Austria, in virtue of his office and Christian piety. He wished to fly to their aid, abandoning everything. He wrote first, however, to the Duque de Sesa, \"To urge the Cardinal to send people to help Goletta, as that province was in his charge.\" But the imperturbable Granvelle replied coldly, \"That he had much to guard in the Kingdom, and that it did not suit him to divide his forces.\" \"This was,\" says Vander Hammen, commenting on the fact, \"to give colour to the excuse. The real reason was Granvelle\u0027s dislike to support D. John, jealous of his favours with Mars and Venus, and because he was a foreigner, and because his brothers conspired in the Flemish rebellion;\" and Luis Cabrera de Córdoba expresses himself in similar words, equally severe, not forgetting Mars and Venus. And D. John himself wrote to his sister Donna Margarita: \"In short, Lady, everything goes badly; and in truth it is not entirely the fault of His Majesty, except for permitting those who govern his States to forget that those in their vicinity, or those that are not, are as much His Majesty\u0027s as those which each minister has charge of.\" Meanwhile D. John, tired of waiting for orders, troops and money which did not come, and making it a point of honour to go to Tunis, moved with desperate activity from Genoa to Naples, Messina and Palermo, recruiting soldiers everywhere, chartering ships, and pledging for all this his plate, his jewels, and even his word, until he had collected at Messina a moderate fleet with no lack of fighting men. He was all ready to sail for Africa, when he met with another obstacle, more powerful than the calculated coldness of Philip II, or the jealous hatred of the Cardinal. The sea! The terrible sea which rose in a furious storm which threw him to Trapani, much against his will, and kept him there days and days, giving time for Christians to perish and for the Turks to become victorious. Three times he tried to leave the port, defying the storm, and as often had to retire before the surging waves. Then he sent four galleys without quarter-decks and platforms on the forecastles to take the mere hope of help to Goletta, but the implacable tempest prevented this by destroying two of them. At last the weather improved; but before D. John could put to sea, a French galley, without masts and knocked about by the storm, was driven into the port of Trapani. On board of her was D. Juan Zagonera, with fifty soldiers, all that remained at liberty of the garrison that D. John had left in Barbary. From them he heard of the terrible disaster. The Turks were in possession of Tunis; three thousand soldiers were dead, and the rest wounded or captives; Pagano Doria had been beheaded; Gabrio Cervelloni, D. Pedro Portocarrero and D. Francisco de Avila were the slaves of Sinan; the new fort razed before it was finished; and Goletta, the glorious legacy of Charles V, blown up by mines, and erased from the African soil by Aluch Ali, as the wind of the desert obliterates footprints. Those who were jealous of D. John blamed him for this catastrophe, with which he had had nothing to do; the sensible public opinion, at times so right and sharp, blamed Granvelle, and songs, which have come down to us, were sung on the subject in the streets. A few, but very few, said in a whisper, as in those days it was necessary to do, that the Cardinal was not responsible, since in refusing aid to Goletta he had obeyed secret orders from Madrid. Of this, however, absolutely no proof exists. The energetic nature of D. John was not depressed by this bad news; but it awoke a thousand different sentiments in his mind, and under the impression of disgust, sorrow and wounded dignity, and, above all, his loyal frankness, which always urged him to treat questions openly and in a straightforward manner, he resolved to go to Spain to confer with his brother Philip II face to face about three different questions which were connected with each other—as to his remaining permanently in Italy as Lieutenant-Governor of those States, his recognition as Infante of Castille, and the mysterious scheme that Gregory XIII had proposed to him. So it fell out, and by January, 1575, D. John was already in Madrid. On the 15th of February he wrote to his sister Donna Margarita: \"Lady, I, praised be God, arrived a few days ago at this Court, where I have received such kindness from His Majesty that only to have gained this I consider that I have spent my life well. Since my arrival I think that he understands Italian affairs very differently from what he did before. I had thought, as I had prayed His Majesty, to stay some time in Madrid; but in the end he is resolved to order me to return to those parts, and is in a great hurry to send me off. I think that I shall start in the middle of the coming month, and I also think that I go to begin a new sort of service according to what suits His Majesty. Meanwhile one has to overcome difficulties and hasten on the things required for this summer\u0027s campaign. \"To all this I pay so much attention that each day, in councils and out of them, I do nothing else. It is already drawing so near summer, that I am satisfied with nothing that I do not see. Here, Lady, everything is councils; every day I hold two, besides a thousand other occupations, which leave me no time that I can call my own.\" D. Philip was under the spell of the fascination that D. John always exercised, and, notwithstanding the groundless suspicions of Antonio Pérez, he received his brother with loving affection and the gratitude and graciousness due to a leader who had added such lustre and glory to the arms and name of Spain. He listened long, and with great interest, to D. John\u0027s information about Italian affairs, changing his opinion much about them. He agreed with D. John in blaming the Ministers and Viceroys of those States, especially Granvelle and the Duque de Terranova. He talked over and fixed the loans which should be made to the various councils to enable them to guard themselves that summer against the Turk, whose pride had to be humbled after the recent capture of Tunis; and finally appointed him, with the approval of the whole council, and to the secret horror of Antonio Pérez, his Lieutenant-General of all Italy, with authority over all the Viceroys and Ministers who governed those States. This, however, was to remain a secret, to spare the reputations and prestige of these functionaries, and was only to be manifested in case of abuse of authority or boast of independence. \"This for Y. Highness only, I beg for many reasons,\" wrote D. John from Naples to Donna Margarita. \"I also bring an order that everyone has to act with obedience; but this is only to be used when some Minister persuades himself to the contrary, which I do not think will happen, as by letters they have learnt what concerns them.\" D. John, encouraged by this, dared to present the second part of his programme, which was that, in order to wound no one and to give an outward sign of this supremacy over the Italian Ministers, the King should concede to him the rank and title of Infante, which was spontaneously given him by all, great and small. D. Philip did not like to refuse this well-deserved favour, but with excuses made D. John understand that the time was not ripe for this. He did not do this out of ill-will, or from miserly stinginess, or still less from jealousy of his fame and renown, as some say, but because it was one of the maxims of this prudent King, inherited from his father Charles V, to stimulate the services of the Grandees with a reward in proportion to their rank; and without giving D. John a crown, which Philip did not wish to do, there remained no other reward worthy of him but the title of Infante, and it seemed premature to give him this now, considering the many and important services Philip hoped to obtain from him in the future. As to the project of Gregory XIII, D. John did not have to broach the subject to his brother. D. Philip himself began it, having already talked over and settled it with the Nuncio Ormanetto.","sourceLink":"http://novel.tingroom.com/jingdian/1668/49173.html","bookId":1193,"book":{"id":1193,"title":"The Story of Don John of Austria","description":"简介： In one of the addresses delivered at the time of Padre Coloma\u0027s admission to the Real Academia Espa?ola there is a reference to Jeromn, as this Story of Don John of Austria is called in Spanish, which says that it awakes great interest in the reader...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1668","creation":"Aug 1, 2019 12:24:34 AM","modification":"Aug 1, 2019 12:24:34 AM"}}
