{"id":34153,"no":64,"title":"CHAPTER XVI","content":"There was so much brave daring in D. John\u0027s act of entering alone a country, for the most part rebel and not a little heretical, his Spanish troops already dismissed, and without other guards than the Duke of Arschot\u0027s Flemings, that the Prince of Orange and his followers were amazed and understood that nothing would stop D. John if he were not deprived of life or liberty. They determined, therefore, to effect one or the other, and the numerous agents of Orange, helped by those of the Queen of England, went about the country spreading clever calumnies against him, to prepare the way, maliciously interpreting all his acts and gradually making him and his government hated. Faithful to the policy of peace which had been enjoined on him, D. John wished to confer with Orange, and sent the Duke of Arschot to tell him that the Provinces of Holland and Zeeland were the only two which had not signed the \"Perpetual Edict,\" and as they were under his command D. John confided this task to him. Orange then threw off that mask, which had gained for him the surname of \"Silent,\" and with which he had covered his ambitions and mischievous designs, and answered Arschot that Holland and Zeeland would never sign the \"Perpetual Edict,\" as both these provinces were Calvinistic and neither would promise to keep the Roman faith, and taking off his hat and showing his bald head, he said to the Duke, with a smile, \"You see my head is bald (calva)! Then know that it is not more so than my heart.\" This play upon words signified that the traitor meant he was also a Calvinist, and his apostasy being now known, all hopes of agreement were at an end. In truth, Orange continued his infamous war of calumnies and perfidious intrigues against D. John even more openly from this time, and with the greatest effrontery as also all that he had hitherto done in secret to the Catholic Church in the provinces of Holland and Zeeland: persecuting the clergy, expelling monks and nuns, destroying temples and altars, melting bells to make cannon, confiscating ecclesiastical revenues for his own purse or those of his partisans, and from the pulpits of Catholic churches making heretic ministers preach the doctrines of Calvin. At such impious insolence D. John proposed to the States to join their troops with those of the King, and make war on Orange and seize the provinces he had usurped; but the States put off his proposal with such shallow excuses that D. John could easily see that mutual and secret confidence existed between them and Orange. Meanwhile, in Brussels, the want of confidence and even the hatred which the agents and partisans of Orange the Silent had sown against the Austrian, grew more and more. These men became so barefaced that they wore special caps and medals with allusive letters, and the authorities and deputies became so arrogant that they ordered D. John to be called the Magistrate of Brussels, as if he were what we should now call the Mayor. He answered that they must come and see him, because it was not usual for the Magistrate to hear anyone outside the H?tel de Ville. \n \n The solemn festivity which the magistrates were accustomed to hold in the H?tel de Ville, a banquet, always presided over by the Governor-General, was about to take place. D. John received several warnings not to attend it, as something was being contrived against his person; but he, even more afraid of showing that he distrusted the magistrates, came to occupy his place, accompanied by eighty musketeers of his guard, who had orders that, happen what might, they were to wound nobody. Half-way through the banquet a crowd of seditious people attacked the H?tel de Ville, intending to enter by force, uttering insults and threats against the Austrian. The musketeers drove them back without wounding any, but many of them were hurt. D. John retired with those who remained uninjured, leaving the magistrates to deal with the guilty ones, but they overlooked this and let them go free, to show D. John that they did not consider an affront to his person worth punishing. Then it came to D. John\u0027s knowledge that the Baron of Hesse and Count de Lalaing, with two other great lords, confirmed heretics, had assembled one night in the house of another noble, and had arranged with the English ambassador and more than 500 neighbours to take D. John at the first opportunity and to kill him if he resisted. They thought that the procession of the Holy Sacrament, called in Brussels the \"Miracle,\" might afford a good one. It took place on the 3rd of July and was always presided over by the Governor-General. D. John did not wish to break with the States, who were consenting to all this, and preferred to avoid the danger by going to Mechlin on the pretence of settling the pay of the German troops, who were asking for their money, which was in arrears. But his friends did not think him safe there and so they told him; because the conspirators, furious at their prey having escaped them, armed the militia and took the road to Luxemburg, which was a quiet place where D. John and Alexander Farnese could take refuge, and to which the Spanish troops could return. With great patience D. John thought it wise still to dissimulate, and found another plausible excuse for leaving Mechlin and not returning to Brussels and getting nearer to a strong and safe place. He went to Namur, very quietly and calmly, to receive the Queen of Navarre, Margaret of Valois, who was passing in order to take the waters of Spa at Liége. This lady was the celebrated Queen Margot, first wife of Henry IV of France, then at the summit of her vaunted beauty and in the waxing period of her coquetry, which at last degenerated, as it generally does, into shameless and complete dissoluteness. \n \n Queen Margot entered Namur on the 24th of July in a litter entirely made of glass, a present from D. John of Austria. The glass of the litter was engraved with forty verses in Spanish and Italian, all alluding to the sun and its effects, to which the poet gallantly compared the beautiful Queen. D. John rode on her right, and their persons were guarded by the forty archers who surrounded them; they were preceded by a company of arquebusiers on horseback and one hundred Germans forming two lines, and were followed by the Princess de la Roche sur Yonne and Mme. de Tournon in litters; ten maids of honour, as pretty, coquettish and flighty as their mistress, were riding amid a crowd of gentlemen, who waited on them and flirted with them; six coaches were in the rear with the rest of the ladies, and the female servants and an escort of lancers on horseback. \n \n Queen Margot stayed four days in Namur, entertained all the time magnificently by D. John; at eleven o\u0027clock they dined in one of the delicious gardens of the place, and then danced till the hour of vespers, which they went devoutly to attend in some convent of friars. Then they went for a ride and supped at six o\u0027clock, also out of doors in the gardens, when more dancing followed, or romantic walks by the river in the moonlight with delightful music. The Bishop of Liége, who had come there, was present at all these gatherings, also the Canons and a crowd of native and foreign gentlemen, among whom Margot made her treacherous propaganda, because this bad woman, (as she always was in many ways) was in connivance with the Prince of Orange, and was working secretly in favour of her brother the Duke of Alen?on, whom Orange wished to appoint Governor of Flanders, D. John being a prisoner or dead. Margot knew this, and she, being very much taken with him and not wishing any harm to befall him, gave him several very useful warnings; through her he knew that the conspirators of Brussels had plans for carrying out their evil designs there in Namur, and then it was that, in agreement with the loyal Count of Barlaimont and his sons, he resolved to retire to the castle of Namur and break with the States. \n \n He was, however, ignorant of the number of the soldiers in the castle, and how far it was safe to count on the Governor de Ives; time pressed and he then formed a scheme, the execution of which Vander Hammen refers to as follows: \"Mos. de Hierges, eldest son of the Count of Barlaimont, said that he would go to sleep that night at the castle, as Mos. de Ives, the Governor, was a great friend of his; and that His Highness would come next morning to hunt, and as he passed, if he thought he could install himself in the castle, he would put his hand to his beard as a signal, and if not he was to commend himself to God and fly. They agreed on the plan and executed it the following day, without telling the Council of the States or the deputies or trusting them. He therefore pretended to go hunting, and passing by the gate of the castle asked what it was. They answered, \u0027One of the best in Flanders.\u0027 Monsieur de Barlaimont then said, \u0027My eldest son is there: would Y.H. like us to see if he wishes to go hunting?\u0027 D. John stopped and ordered him to be called. He came to the gate; His Highness asked why he had gone to sleep at a castle and had left the town, and then they began a conversation. In the middle of it he said, \u0027If you like to see it, it is still early and it will please them greatly,\u0027 and made the sign. D. John turned to the Duke of Arschot and the Marquis de Havré, and said to them, \u0027It is early, let us see it.\u0027 With this he reached the door and dismounted, carrying a pistol he had taken from the saddle-bow. Twenty-four Spanish lackeys preceded him. As relations were not ruptured, Mos. de Ives ordered the few Walloons (they were old soldiers, wearied by long wars) to open the door, and the twenty-four lackeys entered and disarmed the guard. The Lord D. John, standing at the door, said, \u0027All who are servants of the King, my Lord, come here to me,\u0027 and turning to Ives, he told him \u0027not to fear, because he had taken the castle for the King, his Lord, to whom it belonged, to free himself from a conspiracy formed against him.\u0027 He gave him the keys and permission to leave to all those who did not wish to stay with him. Nobody stirred, all mounted with him. Upstairs he took Arschot and Havré on one side, and told them all that had passed and the treaty they had made, and showed them his letters. The Duke, being convinced, offered, in the name of the States, to acknowledge him Lord of Flanders, and said that all would readily obey him if he liked to take them as vassals; but the Lord D. John reproved him very severely for the offer, and said many angry words. It was only his courage and loyalty which could do so heroic an action and resist such a great temptation. The talk ended by the two leaving the castle and going to the town, where their wives were; but on reaching it they, also Mos. de Capres and the soldiers who had come to capture His Highness fled, so hurriedly, that they scarcely collected their clothes, saying that there was nothing further to do there as he had escaped them. D. John\u0027s chief almoner, the Abbot de Meroles, who was crafty and untrustworthy, followed them with a few others. D. John heard of the flight of the Duke and the Marquis, and at once sent Octavio Gonzaga after them, with rather more than twenty gentlemen, to make them return, but they fled in such good earnest that he could not overtake them.\" \n \n The Duchess of Arschot and the Marchioness of Havré, who were at Namur, indignant at the bad conduct of their husbands, wrote to D. John protesting and offering themselves as hostages. He answered that his mission was to serve ladies, not to make them captive, and sent them 600 crowns, so that they might rejoin their husbands. So impoverished was D. John that to obtain this money he had to borrow from the gentlemen and servants who had followed him. Bad as this was, the worst part of D. John\u0027s situation was that Philip II persisted in upholding that policy of peace, which was encouraging the States more and more, forbidding the Spanish regiments to return to Flanders to continue the war, which D. John thought absolutely necessary, and as a means of forcing him to this obedience, against his opinions and wishes Philip adopted the plan of sending no money whatever to Flanders or answering the frequent and despairing letters the poor Prince wrote, which, after four centuries, give one pain to read. But what was the most extraordinary, and which immersed D. John in a sea of fears and perplexities and made him foresee grave catastrophes, was that his false friend Antonio Pérez did not write either, and the good and loyal Escovedo preserved the same silence. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1668/49181.html","bookId":1193,"book":{"id":1193,"title":"The Story of Don John of Austria","description":"简介： In one of the addresses delivered at the time of Padre Coloma\u0027s admission to the Real Academia Espa?ola there is a reference to Jeromn, as this Story of Don John of Austria is called in Spanish, which says that it awakes great interest in the reader...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1668","creation":"Aug 1, 2019 12:24:34 AM","modification":"Aug 1, 2019 12:24:34 AM"}}
