{"id":34156,"no":67,"title":"CHAPTER XIX","content":"During this time the diabolical craftiness of Antonio Pérez had again stirred into a flame Philip\u0027s slumbering suspicions of his brother. Absolute master of the King\u0027s confidence, and also master of that which he had treacherously obtained by pretending to favour the interests of D. John and Escovedo, it was easy for this past master of perfidy and intrigue to tangle the skein. The unfortunate troubles in Flanders had put an end to the English scheme; and Philip\u0027s tenacity in following the policy of peace when only that of war was possible helped Antonio Pérez very much. D. John and Escovedo often wrote to him, as faithful friends pursuing the same end, telling him of their plans and their fears, grumbling to him, and begging for his powerful support with the King. For his part Antonio Pérez took the echo of all this to D. Philip, but not as it was, sincere and frank, always loyal and noble, if sometimes violent, but changed in its meaning, exaggerated, its text even altered when deciphered by Fernando de Escobar, a creature of Antonio Pérez. He answered them, in agreement with Philip, trying to maintain their confidence, and his hypocrisy went the length of letting disrespectful words against the Monarch slip into his letters, in the hope that seeing these they would imitate his example, which he never succeeded in making them do. \\n\\n \\n\\n Sending one of these insidious letters for D. John to the deceived Sovereign for his approval, Antonio Pérez wrote: \\n\\n \\n\\n \"Sir, It is necessary to hear and write in this manner for your service, because thus they fall into the net, and one is better able to judge what course to take on behalf of your Majesty. And I would ask your Majesty to be careful not to be overlooked when reading these documents, as if my artifice were discovered, I could not serve you, and should have to give up the game. For the rest, I very well know, that for my conscience and duty I am acting as I ought in this matter, and I have need of no more casuistry than I possess to know it.\" \\n\\n \\n\\n The King answered Pérez on the margin of the letter: \"Believe me, I am very discreet, and my casuistry agrees with yours; and not only are you doing your duty, but you would fail in doing it towards God and everyone if you acted differently, in order that I may be well enlightened of all that is necessary according to the twists and turns of the world and its affairs, which certainly frighten me.\" \\n\\n \\n\\n Thus deceiving Philip II and betraying and calumniating D. John and Escovedo, Antonio Pérez made the false and subtle plot by which the hero of Lepanto lost his credit with the King, and honest Escovedo his life by a treacherous sword-thrust. Pérez, in his \"Memorial,\" shows the threads of the plot, whose falseness Philip II found out later, and which modern history has proved by many authentic documents. That D. John had disobeyed the King by refusing to dismantle Tunis, the better to raise himself in that kingdom; that behind the King\u0027s back he had sought protection from Rome; that he put the English expedition before all the King\u0027s interests; that he exaggerated the state of affairs in Flanders, in order to get aid from Spain to use in the said expedition; that, once master of England, he contemplated invading Spain at Santander, making over the castle of Mogro to Escovedo, who had solicited its lieutenancy; that the hope of the English expedition over, he thought of going to the help of the King of France at the head of the Spanish troops; that his wish to return to Spain was only to obtain a canopy and take possession of the government; that behind the King\u0027s back he had made a league with the Guise Princes, called the \"Defence of the two Crowns,\" going back to the idea of invading England. \\n\\n \\n\\n All these absurd, senseless plans Antonio Pérez did not attribute entirely to D. John. As formerly he represented Juan de Soto, so now he held up Escovedo as the instigator and principal agent, and D. John as a weak prince, who, devoured by ambition and blind through his vivid imagination, allowed himself to be dragged into disloyal adventures. For this, and perhaps because he loved D. John and was frightened of him, Philip II never showed his suspicion, nor took any steps against him, and took much trouble afterwards to hide his vengeance from him; so all his wrath fell on Escovedo, and he came to look on this rough and honest mountaineer as a dangerous man, capable of every treason and every crime. It is not wonderful that Escovedo\u0027s unexpected coming to Madrid in July, 1577, which we noted in a former chapter, should have given D. Philip a great shock; writing, as usual, on the margin of the letter in which Antonio Pérez announced the arrival of Escovedo at Santander, he says, \"It will be necessary to be well prepared, and to make haste to dispatch him before he kills us.\" \\n\\n \\n\\n Escovedo came, furious at what he considered the incomprehensible way D. John had been left without soldiers or money; furious also at Philip\u0027s policy of peace, which he presumed to describe as overdone, writing to the King himself, and finally determined, with all his rough energy, to claim the acceptance of the bills he had negotiated in Brussels, and the payment of the 80,000 gold crowns lent to D. John by the Pope\u0027s Nuncio, that the troops might be dismissed from Flanders. This he did with such hard words and bitter reproaches, that Philip sent one of Escovedo\u0027s letters to Pérez, adding on the margin, \"That you should see how he comes thirsting for blood.\" And shortly afterwards, lamenting over another letter from Escovedo, he wrote, \"Certainly if he said to me what he writes, I do not know if I could have helped losing my temper as he does.\" \\n\\n \\n\\n Photo Lacoste \\n\\n \\n\\n PHILIP II AS AN OLD MAN \\n\\n \\n\\n Pantoja de la Cruz. Prado Gallery, Madrid \\n\\n \\n\\n At last the news of D. John\u0027s retirement to the castle of Namur reached the Court, and the despairing letters of the distressed Prince began to arrive, in which, with such painful urgency, he craves for the return of Escovedo. \"Money, money, and more money, and Escovedo,\" he repeats in all his letters of this date. His anxiety to have his secretary at his side, and the same feeling which was noticed in Escovedo to return as quickly as possible to Flanders, awoke in D. Philip the suspicion that something was being plotted to continue the war there against his orders, and to favour D. John\u0027s pretensions. Antonio Pérez fanned this new fire, and henceforward Escovedo was in D. Philip\u0027s eyes a constant danger, a State criminal, who could not be sent back to Flanders, for fear lest he would carry out his work, or kept in Spain, without the risk of rousing the dreaded ire of D. John. For several days this vexed and perplexed Philip, until at last he made a resolution which Antonio Pérez himself relates in a letter to Gil de Mesa. \\n\\n \\n\\n One day Philip called him to his room in the Escorial. It was at an inconvenient time, and the secretary hastily ran, carrying the dispatches in a large bag. The King came to the door to meet him, and took him, with much mystery, to a distant, isolated room, where the furniture, ornaments and treasures for the still unfurnished house were stored. The King ordered Pérez to shut the door and put the bag of papers on the table. The furniture was stacked at the two sides, leaving a passage in the middle, up and down which Philip began to walk, his hands behind his back, preoccupied and thoughtful. Pérez kept a respectful silence, waiting for the King to break it, which he did at last, standing in front of Pérez, and saying very slowly and in measured tones, \"Antonio Pérez, I have passed many sleepless nights on account of my brother\u0027s affairs, or rather those of Juan de Escovedo and his predecessor Juan de Soto, and the point to which their plots have come, and I consider it is very necessary to take a resolution quickly, or we shall not be in time. And I can find no better remedy, in fact there is no other, than getting rid of Juan de Escovedo. Imprisoning him would result in exasperating my brother as much as killing him would. So I have determined on it, and trust this deed to no one but you, because of your well-proved fidelity and your ingenuity, as well known as your fidelity. Because you know all the plots, and I owe the discovery of them to you, yours shall be the hand to effect the cure. Speed is very necessary for the reasons you know.\" \\n\\n \\n\\n As he himself affirms, the heart of Antonio Pérez leapt, and he answered the King with great devotion that he was entirely his, and that he had no more wish or movement than the hand as regards its owner. But, as his cunning forethought always saw a long way ahead, he at once realised the risk that he ran in a matter so secret and with so powerful an accomplice, if he did not have a witness in his interest to note the facts, if things were ever discovered, and to share the responsibilities in case of disagreement, so he craftily added, \"But, Sir, let Y.M. permit me to speak with the presumption of love. I consider Y.M. outside this affair, although your prudence and presence of mind prevent your being incensed at the greatest crimes, I, as I might get angry at such offences against your person and crown, also have much interest in this. It will be well to bring in a third person to judge this determination, to justify it, and for the better ascertaining of the facts. This will be much to the point.\" \\n\\n \\n\\n Then he saw the King come towards him, who, stopping, answered: \"Antonio Pérez, if it is because you do not care to run the risk of this business that you wish for a third person, it is the same to me. To settle the matter I do not require a third person. Kings in such extreme cases have to act like King\u0027s physicians and great doctors among their inferiors with patients under their care: that in grave and urgent accidents they act on their own authority with promptitude, although in other illnesses they act with and follow the consultations of other doctors. Moreover, in these matters (believe me that what I say relates to my profession) there is more danger than security in consultations.\" \\n\\n \\n\\n Antonio Pérez makes the following comment on these royal words in his letter to Gil de Mesa: \"When old kings come to announcing such principles of their art, either they love much (a rare thing) or necessity opens the door of confidence (a certain fact).\" \\n\\n \\n\\n Well Antonio Pérez must have known and measured Philip\u0027s necessity when he determined to press him to interpose a third person, and even presumed to propose his friend and boon companion the Marqués de los Vélez, D. Pedro Fajardo, who was a Councillor of State and Lord Steward to the Queen Do?a Ana. At last Philip consented, and authorised Antonio Pérez to consult him. The secretary had little trouble in bringing the old noble to his opinion, a despot himself, a great soldier but absolutely illiterate, who considered Pérez an oracle, and for some years had owed D. John a grudge for having usurped, as he said, the triumph over the Moors. \\n\\n \\n\\n Pérez talked to him, and both agreed that Escovedo deserved to die as a disturber of the kingdom who was trying to make war in Flanders; that it was impossible to arrest, judge and sentence him in the ordinary way without risk of awaking the alarm of D. John and provoking fresh conflicts; but the King, as supreme arbiter of his subjects\u0027 lives, according to the precepts and practices of those times, could judge and sentence him by the secret law of his conscience, without any legal transactions, and entrust the execution of this sentence to some person in his confidence, whom he should authorise by a paper in his own writing, \"and that the best and least inconvenient way would be that with some mouthful or other similar means he should get out of the trouble, and even this with the greatest care, as the Lord D. John might not suspect it was the result of the true cause and motive, but of some vengeance and private grudge.\" \\n\\n \\n\\n And then the Marqués de los Vélez, with all the customary pomposity of a wind-bag, and with all the jealous rancour which he nourished, pronounced these words so often quoted by the apologists of Antonio Pérez, \"That if his opinion were asked, with the Sacrament in his mouth, who was the person it was most important to take away, Juan de Escovedo or anyone else, he would vote for Juan de Escovedo.\" \\n\\n \\n\\n In conformity, then, with this interview Philip II judged Escovedo and condemned him to death by the law of his conscience, and charged Antonio Pérez with the execution of the sentence, authorising him by a paper written by his own hand, in which he adds, \"That although it may be realised that he has nothing to do with all that has happened, it will be well that there should be no doubt whatever about it.\" \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1668/49184.html","bookId":1193,"book":{"id":1193,"title":"The Story of Don John of Austria","description":"简介： In one of the addresses delivered at the time of Padre Coloma\u0027s admission to the Real Academia Espa?ola there is a reference to Jeromn, as this Story of Don John of Austria is called in Spanish, which says that it awakes great interest in the reader...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1668","creation":"Aug 1, 2019 12:24:34 AM","modification":"Aug 1, 2019 12:24:34 AM"}}
