{"id":93799,"no":8,"title":"Page 8","content":"The whole universe seemed to be hushed and waiting, breath held.\n But Rob didn\u0027t move. He was on the brink of discovery-but not there yet.\n me strange rower\n He needs help, Kaitlyn thought. He still doesn\u0027t understand what\u0027s going on.\n It was up to her to show him, to help him take that first step-if she wanted to. And she did. Kaitlyn suddenly felt calm and clear. She saw in her mind what was going to happen, like a picture already finished.\n She would cradle his face with her hands and kiss him-very softly. And Rob would look at her with such surprise. So completely innocent-but not stupid. Rob wasn\u0027t slow to catch on. After she kissed him the second time, the astonishment would turn to dawning wonder. His golden eyes would start smoldering the way they did when he was angry . . . but for a very different reason.\n Then he\u0027d put his arms around her, and kiss her- so lightly-and the energy, the healing energy, would flow between them. And everything would be wonderful.\n Breath held, Kaitlyn reached up to touch Rob\u0027s face, seeing her own graceful artist\u0027s fingers on his jaw.\n Even that little contact sent sparks dancing up her palm. It all seemed so simple and natural-as if she knew what to do without thinking. As if she\u0027d always known, in some wise place inside.\n Imagine it-Kaitlyn the cold, knowing what to do, feeling so sure. It was all about to happen.\n Then voices broke into her reverie. Laughing, ordinary voices that didn\u0027t belong at all to the beautiful new world Kaitlyn was inhabiting. She looked up in confusion.\n Lewis and Anna were just outside the door. Gabriel was behind them.\n \"Hey, Kait,\" Lewis began cheerfully. And then, seeing her face, \"Uh, oops.\"\n Anna\u0027s dark eyes were stricken and apologetic. \"We didn\u0027t mean to interrupt,\" she said, grabbing Lewis\u0027s shoulder as if to propel him away.\n \"A little therapeutic touch in the dark?\" Gabriel asked blandly.\n Sick dismay swept through Kaitlyn. The discovery, the wonder, in Rob\u0027s face was shattered. It had been so fragile, something that was about to be born rather than something that already existed-and now it was gone. Snatched away, leaving only Rob\u0027s usual kindness and concern. His affection for Anna and Lewis.\n And his hatred for Gabriel.\n \"Kait had a headache,\" he said, standing up to face Gabriel directly. \"If it\u0027s any of your business.\"\n \"She seems to be better now,\" Gabriel observed, looking around him at Kaitlyn. Kaitlyn glared at him with deadly heat.\n \"It would help if people would leave me alone,\" she said.\n \"We were just going,\" Anna said, her eyes telegraphing her contrition to Kaitlyn. \"Come on, Lewis.\"\n \"That\u0027s right,\" Rob said, and then, to Kait\u0027s utter frustration and disbelief, he walked out the door himself.\n \"Want me to close this?\" he asked.\n If it had been a ploy to make sure Gabriel and the others stayed away, Kaitlyn would have understood.\n But it wasn\u0027t. Rob had reverted completely. The only emotion she could see in his golden eyes now was brotherly affection.\n And there was no way to get through to him, no way to change things back. At least for today, it was over.\n She didn\u0027t know who to be angry with-Gabriel and the others or Rob himself. She might just kill Rob-but she loved him more than ever.\n \"Yes, please close the door,\" she said.\n When they were all gone, Kaitlyn lay on her bed, watching as cool violet twilight replaced the warm light of afternoon. The room became shadowy, mysterious. She shut her eyes.\n A sound alerted her-a sound like paper rustling. Sitting up quickly, she stared around the room. There it was, something white glimmering out of the shadows, creeping in under the door. No, not creeping-being pushed.\n Kaitlyn quietly got off the bed and padded to the door. Yellow light from the hallway was shining through the crack beneath the door-and the paper was still moving. She ignored it, grabbed the doorknob, and yanked the door open.\n Marisol was kneeling on the hallway floor.\n The older girl\u0027s chin jerked up, and for a moment her brown eyes met Kaitlyn\u0027s. They looked shocked and surly. Then she was on her feet and heading for the stairs.\n \"Oh, no, you don\u0027t!\" Fired by all the emotions of the past afternoon, Kait pounced. Frustration, excitement, and fury gave her the strength to seize Marisol and spin her around.\n \"What were you doing pushing stuff under my door? What is that?\" Kaitlyn demanded, pointing to the piece of folded paper lying on the threshold.\n Marisol just tossed her hair out of her eyes and looked defiant.\n Kaitlyn let go of her long enough to pick up the paper, then blocked her as she headed for the stairway again.\n \"This is my picture!\" It was the one Kait had done yesterday, the one of her own face with the extra eye, the one she\u0027d left on the lab floor.\n Except that now it had writing on it.\n Scrawled across the bottom in heavy black pen were the words: watch out. this could happen to you.\n \"Another joke?\" Kaitlyn said grimly, drawing herself up.\n Marisol, who was several inches taller, just looked down at her with smoldering brown eyes. Kaitlyn, reckless of the consequences, grabbed Marisol\u0027s arm and shook her.\n \"Why are you trying to scare me? Is it because you hate psychics?\"\n Marisol laughed shortly.\n \"Do you want me to go away? Is it... oh, I don\u0027t know, some jealousy thing or something?\" Kaitlyn was desperately groping for a reason that made sense.\n Marisol pressed her full lips together.\n \"Okay, fine,\" Kaitlyn said, her voice slightly shaky. \"I guess I\u0027ll just have to go and ask Joyce.\"\n She got halfway to the stairs before Marisol spoke.\n \"Joyce can\u0027t help you. She doesn\u0027t know what\u0027s really going on. She wasn\u0027t around for the pilot study-but I was.\"\n \"What\u0027s a pilot study?\" Kaitlyn asked, without turning.\n \"Never mind. The point is, you won\u0027t get help from Joyce. All she cares about is getting her experiments done, getting her name in the journals. She\u0027s blind to what\u0027s really happening. That\u0027s why Zetes hired her.\"\n \"But what does this thing mean?\" Kaitlyn asked, shaking the paper.\n Silence. Kaitlyn turned around. More silence.\n \"God, you\u0027re dumb,\" Marisol said at last. \"Don\u0027t you remember the experiment today? Didn\u0027t you wonder at all how you got that picture of the grapes?\"\n Kaitlyn remembered that kaleidoscopic flood of images. \"I assume because I\u0027m psychic,\" she said, but she could hear the stiff defensiveness in her own voice.\n \"If you were really psychic, you\u0027d figure out why you\u0027re here. And then you\u0027d be on the next plane home.\"\n Kaitlyn had had it with innuendo. \"What are you talking about? Why can\u0027t you say something straight instead of all this secret stuff?\" she almost shouted. \"Unless you don\u0027t really have anything to say-\"\n Marisol had flinched at the volume of Kaitlyn\u0027s voice-and now she suddenly shoved past her, elbowing Kait hard in the arm. As she reached the stairway, she glanced back and snapped, \"I came up to tell you you\u0027re late for dinner.\"\n Kaitlyn sagged against the wall.\n This had been the most confusing roller coaster of a day ... and Marisol seemed to be crazy, that was all.\n Except that didn\u0027t explain what had happened during Kait\u0027s experiment. When Joyce had put that\n \"electrode\" on Kaitlyn\u0027s forehead ...\n Over my third eye, Kait thought. She looked at the now crumpled paper. The extra eye in the picture stared up at her grotesquely, as if trying to tell her something.\n I\u0027ve got to talk to somebody. I can\u0027t deal with this alone. I need help.\n The decision made her feel better. Kaitlyn wadded the paper up and stuck it in her pocket. Then she hurried down the stairs to dinner.\n \"What\u0027s it got to do with me?\" Gabriel said, flicking the paper back toward Kaitlyn. He was lying on his bed reading a magazine about cars-expensive cars. \"It\u0027s not my problem.\"\n Kaitlyn caught the paper in midair. It had taken a great deal of control to come here. She probably wouldn\u0027t have done it except that she couldn\u0027t face Rob alone just now, and Anna had been on the phone with her family since dinner.\n Grimly Kaitlyn held on to her precarious calm.\n \"If there\u0027s anything to what Marisol is saying, then it\u0027s everybody\u0027s problem,\" she told Gabriel tightly.\n \"And you were the one who said that there was something wrong here.\"\n Gabriel shrugged. \"What if I did?\"\n Kaitlyn felt like screaming. \"You really think something\u0027s wrong-but you don\u0027t care about finding out?\n You wouldn\u0027t want to do anything about it?\"\n A faint smile touched Gabriel\u0027s lips. \"Of course I\u0027m going to do something. I\u0027m going to do what I do best.\"\n Kaitlyn saw it coming, but couldn\u0027t avoid feeding him the straight line. Feeling like Sergeant Joe Friday at the end of a scene, she rapped out, \"And what\u0027s that?\"\n \"Taking care of myself,\" Gabriel said smugly. His dark eyes were full of wicked delight at having the last word.\n Kaitlyn didn\u0027t bother to hide her disgust as she left.\n Outside his door, she leaned against the wall again. Lewis was in the study playing Primal Scream\u0027s newest CD at tooth-vibrating levels. Anna was still in the bedroom on the phone. And as for Rob . ..\n \"Did the headache come back?\"\n Kaitlyn whirled, somehow feeling cornered against the wall. Why didn\u0027t she ever hear Rob coming?\n \"No,\" she said. \"I\u0027m fine. At least - No, I am fine.\" She couldn\u0027t deal with Rob right now, she really couldn\u0027t. She was afraid for him-afraid of what she might do to him if she got the chance. It seemed equally likely that she\u0027d kiss him or kill him.\n \"What\u0027s that?\" he said, and the next thing Kait knew, he was taking the paper out of her hand. She tried to snatch it back, but he was too fast.\n \"That\u0027s nothing-I mean-\"\n Rob smoothed the paper, glanced at it, then looked up at her sharply. \"Did you draw this?\"\n \"Yes ... but I didn\u0027t do the writing. I don\u0027t- Oh, it\u0027s all so confusing.\" Kaitlyn had come to the end of her resources. She was tired of fighting, of pushing, of badgering people. She was tired.\n \"Come on,\" Rob said gently. The hand that cupped her elbow was gentle, too, but irresistible. He guided her without hesitation to the one room on the second floor that wasn\u0027t occupied-the bedroom he and Lewis shared.\n \"Now, tell me all about it.\" He sat beside her on the bed, as naturally as if he were her brother, as close as that. And with as little ulterior motive. It was agonizing-and wonderful at the same time.\n And his eyes-he was looking at her with those grave golden eyes, extraordinary eyes. Wise eyes.\n I can trust him, Kait thought. No matter what else happens between us, I can trust him.\n \"It\u0027s Marisol,\" she said, and then she was telling him everything. About waking up that first night to find Marisol in her room, about the strange things Marisol had said. Watch out or get out. This place is different than you think. About Marisol claiming it was all a joke the next morning. About the experiment today, and how the pictures had come into her mind-after Joyce put the cold thing on her forehead.\n About Marisol pushing the drawing under her door.\n \"And then I tried to get her to explain-but all she talked about was some pilot study, and how if I knew why I was really here, I would be on the next plane home. And how Joyce didn\u0027t know what was really going on, either.\"\n She stopped. She half expected Rob to laugh, but he didn\u0027t. He was frowning, looking puzzled and intent.\n \"If Joyce doesn\u0027t know what\u0027s going on, then who does?\"\n \"I guess Mr. Zetes. But, Rob, it\u0027s all so crazy.\"\n Rob\u0027s mouth tightened. \"Maybe,\" he said under his breath. \"But I wondered about him. . . .\"\n \"That first day? The speech about us psychics being so superior and following different laws?\"\n Rob nodded. Kaitlyn was meeting his eyes without self-consciousness now, as grim as he was. He believed her, and that made this whole thing much more serious than before. This was business.\n \"And why he brought Gabriel here,\" Rob said.\n \"Yes,\" Kaitlyn said slowly. Someday she really would have to talk to Rob about Gabriel-but not now.\n \"But what does it all add up to?\"\n \"I don\u0027t know.\" Rob looked at the drawing again. \"But I know we have to find out. We have to talk to Joyce.\"\n Kaitlyn swallowed. It had been a lot easier to threaten to tell Joyce in the heat of anger than it was to consider going to her now. But of course, Rob was right.\n \"Let\u0027s do it,\" she said.\n Joyce\u0027s room was off the little wood-paneled hallway under the stairs that led to the front lab. It had originally been a solarium, a glass-enclosed porch. Not only that, but the French-door entrance was so large that anyone in the living room or foyer could see straight in. Only Joyce, Kait thought, could live in a room like this without any privacy. It probably had something to do with the fact that Joyce always looked good, whether she was doing business in a tailored suit or lounging in layered pink sweats-like tonight.\n \"Hi, guys,\" she said, looking up from a laptop computer. Light from her bedside lamp reflected off the glass walls.\n Kaitlyn sat gingerly on the bed, and Rob pulled up the desk chair. He was still holding the drawing.\n Joyce looked from one of them to the other. \"Why so serious?\"\n Kaitlyn took a deep breath at the same time as Rob said, \"We need to talk to you.\"\n \"Yes?\"\n Kait and Rob exchanged glances. Then Kaitlyn burst out, \"It\u0027s about Marisol.\"\n Joyce\u0027s eyebrows lifted toward her sleek blond hair. \"Yes?\"\n \"She\u0027s been saying things to Kaitlyn,\" Rob said. \"Weird things, about the Institute being dangerous. And she wrote ... this ... on a drawing Kaitlyn did.\"\n Still looking puzzled, Joyce took the paper, scanned it. Kait felt her stomach knot. She had stopped breathing completely.\n When Joyce threw back her head, Kait thought for a moment she was going to scream. Instead, she burst into laughter. \n","sourceLink":"https://allnovel.net/the-strange-power-dark-visions-1/page-8.html","bookId":2124,"book":{"id":2124,"title":"The Strange Power (Dark Visions #1)","description":"Storyline: \n The Strange Power (Dark Visions #1) \n They said she had evil eyes... \n Eyes that saw what was not meant to be seen. Kaitlyn Fairchild was frightened by her uncanny talent, by the prophetic drawings that isolated her at school. Until she was invited to California, to attend the Zetes institute with four other psychically gifted students, in return for a college scholarship. It was a chance to begin again, to belong; a great adventure, with the promise of romance...with Rob, irresistible, yet strangely innocent...with dark, enigmatic Gabriel. Until they learn the truth about an experiment that threatens their sanity, and their lives. All they have is each other, and a perilous psychic link that can save - or destroy - them all...\n \n","cover":"https://allnovel.net/images/the-strange-power-dark-visions-1.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-strange-power-dark-visions-1.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 6:04:15 PM"}}
