{"id":76222,"no":14,"title":"Page 14","content":"\"Seems like an asshole to me.\" \"Yeah, well, you pass around good shit and give out backstage passes to major shows, you get a little leeway in the personality department, okay? You invited me here and you\u0027re buying the beer. Just don\u0027t embarrass me.\" He wheeled himself around without waiting for an answer. Cam had disappeared inside the club. Probably gone to wax his guitar or tune his surfboard or something. Garrett flashed his blue handicapped placard and made some noise and got us back to the front of the line, then inside. The Cactus Cafe was an unlikely music venue, just a long narrow room off the corner of the Union lobby, a stage not much bigger than a kingsized bed, a little bar in back that served beer and wine and organically correct snacks. Not much in the way of atmosphere, but for fifteen years this had been one of the best places in Austin to hear small bands and solo acts. In Austin that was saying a lot. I followed Garrett through the crowd. He drove over as many feet as he could getting past the bar and to the far wall. I had to stand next to him, pressing against the thick burgundy drapes and hoping the window didn\u0027t open and spill us all out into the rain on Guadalupe Avenue. I had enough room only if I used one foot and kept my Shiner Bock close to my chest. \"Good crowd,\" I said. \"I caught her last month at the Broken Spoke,\" Garrett said. \"You wait.\" I didn\u0027t have to. Just as Garrett was about to say something else applause and hoots started up behind us. The band emerged from the back room and began pressing through the crowd. First onstage was the pudgy, whitebearded man from the photo on Milo\u0027s wall. Willis, Miranda\u0027s dad. He looked like a Texas version of Santa Claus—hair and whiskers the colour of wet cement, a jolly red face, a well fed body stuffed into Jordache jeans and a beige collar less shirt. He limped onto the stage with a cane, then substituted a standup bass for it. Next came Cam Comptom, looking not overjoyed. He stared out at the audience grudgingly, like he was afraid they were all going to pester him for autographs. When he plugged in his Stratocaster he put a blue pick in his mouth along with several frizzy strands of his hair. After him came a mousy librarianlooking woman who was apparently Julie Kearnes\u0027 replacement on the fiddle. Then an elderly railthin drummer—that would be Ben French. Then a fortyish acoustic guitar player with a darkcheckered shirt and black jeans and a black Stetson that was slightly too small for his head—Brent, Miranda\u0027s older brother. Miranda herself was not in the lineup. Daddy Santa Claus leaned on his bass and straightened his straw hat and waved at one of the older couples in the audience. Willis might\u0027ve been standing on his front porch picking for a few friends, or doing an impromptu hoedown at the local Elks Club. The rest of the band looked stiff, nervous, like their families were being held at gunpoint in the back room. After a few minutes of general cord fumbling and string plucking, the musicians all looked expectantly at Miranda\u0027s brother Brent. He came up to the mike uncertainly, mumbled \"Howdy,\" then lowered his head so you couldn\u0027t see anything except the brim of his black Stetson. Without warning he started strumming his guitar like he was afraid it might get away from him. His dad the bass player, undaunted, looked over at the others, smiled, and mouthed: \"Ah one, two, three—\" The rest of the band came in and started grinding through an instrumental version of \"San Antonio Rose.\" . The fiddle player sawed out the melody in a watery but fairly competent fashion. The crowd clapped, but not very enthusiastically. Many of them kept glancing toward the back of the room. Nobody onstage looked like they were having an exceptionally good time except for Willis Daniels, who tapped his good foot and plucked his bass and smiled at the audience like he was totally deaf and this was the best damn thing he\u0027d ever heard. The band lurched through a few more numbers—an anaemic polka, a version of \"Faded Love\" during which Cam Compton had a flashback and went into a Led Zep pelin solo, then Brent Daniels\u0027 vocal of \"Waltz Across Texas.\" Brent\u0027s voice wasn\u0027t bad, I decided after the second verse. None of the band members were bad, really. The drums were steady. The bass solid. Cam would\u0027ve made a better rock \u0027n\u0027 roller but he obviously knew his scales. Even the substitute fiddler didn\u0027t miss a note. The players just didn\u0027t go together very well. They weren\u0027t much of a group. They definitely weren\u0027t worth a fivedollar cover. The audience started to fidget. I wondered if there\u0027d been a mistake. Maybe they\u0027d all thought Jerry Jeff or Jimmie Dale was playing tonight. That might explain it. Then somebody at the bar gave a good \"yeehaw\" as Miranda Daniels came out from the back room wearing all black denim and carrying a tiny Martin guitar. The applause and whistling increased as Miranda squeezed her way through the audience. She looked like she did in the press release photos— petite, pale, curly black hair. She wasn\u0027t knockout beautiful by any means, but in person she had a kind of awkward, sleepy cuteness that the photos didn\u0027t convey. The band put an abrupt stop to their waltz across Texas when Miranda got onstage. She smiled tentatively into the lights—just a hint of her dad\u0027s crinkles around her eyes—then straightened her black shirt and plugged in her Martin. She was definitely cute. The men in the audience would be looking at her and thinking it might not be a terrible thing to be cuddled up with Miranda Daniels under a warm quilt. That was my impartial guess, anyway. Daddy Santa started an uptempo bass line going, tapping his foot like crazy, and the audience started clapping. Brent\u0027s rhythm guitar came in, more sure than before, then the drums. Miranda was still smiling, looking down at the floor but swaying a little to the music. She tapped her foot like her father did. Then she brushed her hair behind her ear with one hand, took the microphone, and sang: \"You\u0027d better look out, honey—\" The voice was amazing. It was clear and sexy and overpowering, not a hint of reservation. But it wasn\u0027t just the voice that nailed me to the wall for the next thirty minutes. Miranda Daniels became a different person— nothing tentative, nothing awkward. She forgot she was in front of an audience and sang every emotion in the world into the microphone. She broke her heart and fell in love and snared a man and then told him he was a fool in one song after another, hardly ever opening her eyes, and the lyrics were typical country and western cornball but coming from her it didn\u0027t matter. Toward the end of the set the band dropped away and Miranda did some acoustical solos, just her and her Martin. The first was a ballad called \"Billy\u0027s Senorita,\" about the Kid from his Mexican lover\u0027s perspective. She told us what it was like to love a violent man and she made us believe she\u0027d been there. The next song was even sadder—\"The Widower\u0027s TwoStep,\" about a man\u0027s last dance with his wife, with references to a little boy. It was unclear in the lyrics how the woman died, or whether the boy died too, but the impact was the same no matter how you interpreted it. Nobody in the cafe moved. The other band members could\u0027ve packed up and left for the night and nobody would\u0027ve noticed at that point. Most of the band looked like they knew it, too. I glanced over at Cam Compton, who had come to sit next to Garrett in a chair some woman had gladly given up for him. As Cam listened to Miranda his expression slipped from amused disdain into something worse— something between resentment and physical need. He looked at Miranda the way a hungry vegetarian might look at a Tbone. If it was possible to like him less, I liked him less. At the break the musicians dissipated into the audience. Miranda escaped into the back room. I was trying to figure out the best way to get in to talk to her when Cam Compton made up my mind for me. He downed what must have been the fourth beer someone had bought for him, got up unsteadily, and told Garrett, \"Time I had a talk with that girl.\" \"Wait a minute,\" I said. Cam pushed me into the curtains. I didn\u0027t have room or time to do anything about it. When I got to my feet again Garrett said, \"Uhuh, little bro. Cool it, now.\" Then he saw my eyes and said, \"Shit.\" Cam was moving toward the back room like a man with a purpose. A woman got in Cam\u0027s way to tell him how great he was and he pushed her into somebody at the bar. I followed Cam like I was a man with a purpose too. I was going to beat the living crap out of him. 15 The back room of the Cactus Cafe was not exactly the place to go to escape claustrophobia. Crates of organically correct snacks and kegs of beer were stacked to the ceiling along either side, and the back was an explosion of paperwork that had completely overrun the manager\u0027s desk and was now crawling up the wall by way of thumb tacks and overflowing onto the floor. Whatever free space might\u0027ve been left in the corners was now piled with the band\u0027s instrument cases. In the centre of the room Miranda Daniels and a blond woman who\u0027d been in the audience were just sitting down at a card table when Cam Compton barged in, followed by me, followed by the club manager. If anybody else wanted to follow him they were out of luck. There wasn\u0027t even room to close the door. A lot happened in a very short time. Miranda looked up at us, startled. The woman who was with Miranda rolled her eyes and said, \"I don\u0027t believe this,\" then started to get up, fumbling with a canister of Mace on her key chain. The manager tapped my shoulder hard and said, \"Excuse me—\" Cam walked over to Miranda, grabbed her wrist, and started pulling her up out of her chair. He was smiling, talking almost under his breath falsely calm and sweet the way you might coax a naughty dog out from under the house so you could whack it hard. \"Come on, darlin\u0027,\" he said. \"Come talk to me outside.\" The blonde cursed and tried to untangle her Mace and muttered \"you son of a bitch\" several times. Miranda was saying Cam\u0027s name and trying to stay calm and get down low so she wouldn\u0027t be pulled toward him. \"Excuse me!\" the manager said again. There were more people outside the doorway now, trying to see into the room—Miranda\u0027s brother, her father, a few other guys from the audience who smelled a possible fight. They were all asking what the hell was going on and pushing on the manager who was in turn pushing on me. Miranda glanced nervously at me, not having a clue who I was or why I was in line to abuse her next, then went back to reasoning with Cam while she pried at his fingers on her wrist, telling him to please calm down. Cam said, \"Just come on outside for a little bit, sweetheart. Just come on out.\" The blonde was still having no luck with her Mace. It was either wait for her to get it free or do something myself. I decided on the latter. I grabbed Cam Compton by his frizzy blond hair, yanked him back from Miranda, and slammed his head into a beer keg. I\u0027m not sure whether the lovely metallic sound came from the keg or Cam\u0027s skull, but it stopped him from pestering Miranda pretty effectively. His legs folded into praying position and his face hit the keg again on his way down to the floor. He curled into foetal position on the linoleum, squinting and trying to figure out how to close his mouth. Miranda\u0027s blond friend stared at me. She had just gotten her Mace out. She pointed at me, then looked at Cam on the floor, realized I wasn\u0027t a target, and said, \"Shit!\"","sourceLink":"https://allnovel.net/the-widower-s-two-step-tres-navarre-2/page-14.html","bookId":2417,"book":{"id":2417,"title":"The Widower\u0027s Two-Step (Tres Navarre #2)","description":"Storyline: The Widower\u0027s Two-Step (Tres Navarre #2) Tres Navarre has just hours of apprenticeship time to serve before he can go for his P.I. license. Staking out a musician suspected of stealing a demo tape should be a piece of pan dulce. But his attention wanders just long enough for fiddle player Julie Kearnes to be gunned down before his eyes. He should just back away and let the cops investigate, but backing away has never been Tres\u0027s strong point. The missing demo and Julie\u0027s murder are just two of the problems besetting Miranda Daniels, a pint-sized singer with Texas-sized talent. She\u0027s the prize in a tug-of-war between two music hotshots who want to manage her career. One has a habit of making bad things happen to people he doesn\u0027t like. The other has just vanished without a trace. As Tres looks into the dirty dealings surrounding Miranda, it becomes clear he\u0027s stepped into a rattlesnakes\u0027 nest of greed, double cross, and murder—and he may be the next to be snakebit.","cover":"https://allnovel.net/images/the-widower-s-two-step-tres-navarre-2.jpg","author":"Rick Riordan","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-widower-s-two-step-tres-navarre-2.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 10:37:12 AM"}}
