{"id":76249,"no":41,"title":"Page 41","content":"During the conversation I sipped my iced tea and subtly moved Garrett\u0027s gift off the table, then into my backpack. Out of sight, etc. When the food came Danny sat with us for a while. We ate Texicali burgers heavy with salsa and Monterey Jack and watched the afternoon traffic speed down South Oltorf. Dickhead the parrot sat on Garrett\u0027s shoulder, holding a tortilla chip in his claw and eating it piece by piece. He hadn\u0027t yet learned to dip it in salsa. That would probably take another month. After a while Garrett said he had to get back to work and Danny said he had to get back to the kitchen. A few raindrops started splattering the patio. \"Nice meeting you,\" Miranda told Garrett. Garrett wheeled his chair sideways and the parrot shot its wings out, correcting its balance. \"Yeah. And hey, little bro—\" \"Say it and die,\" I warned. Garrett grinned. \"Nice meeting you, too, Miranda.\" When we were alone I started shredding the wax paper from the burger basket. Miranda put her boot lightly on top of mine. Yes, I was wearing the new boots. Just happened to be in front of the closet. \"Hard to like them sometimes,\" Miranda said. \"What?\" \"Older brothers. I wish I\u0027d known—\" She stopped herself, probably remembering my injunction to Garrett. \"Here you drove all the way to Austin to pick me up, spent half your day.\" \"I wanted to.\" She took my hand and squeezed it. \"The taping went really well today. I owe that to you.\" \"I don\u0027t see how.\" She kept a hold on my hand. Her eyes were bright. \"I missed you last night, Mr. Navarre. You know how long it\u0027s been since I missed somebody that much? Can\u0027t help but change my singing.\" I stared out at the traffic on Oltorf. \"Has Les contacted you, Miranda?\" Her grip on my hand loosened just slightly. She had trouble maintaining her smile. \"Why would you think that?\" \"He hasn\u0027t then?\" \"Of course not.\" \"If you had to get away for a few days,\" I said, \"if you had to go somewhere safe that not too many people knew about, could you do it?\" She started to laugh, to put the idea away, but something in my expression made her stop. \"I don\u0027t know. There\u0027s the show tonight, then tomorrow is free, but then the tape audition on Friday—you don\u0027t seriously think—\" \"I don\u0027t know,\" I said. \"Probably it\u0027s nothing. But let\u0027s say you had to choose between keeping your schedule and being sure you stayed safe.\" \"Then I\u0027d keep my schedule and take you along.\" I looked down at the table. I turned over the bill and discovered that Danny Young had comped the meal. He\u0027d written \"Nothing\" in black marker across the green paper. The Zen waiter. Miranda turned my palm up so hers was on top. Raindrops starting pingpinging more steadily, a slow threequarter time against the metal umbrella. \"Anyplace else you need to go in Austin?\" she asked. \"As long as I got you up here?\" I watched the rain. I thought about Kelly Arguello, who would probably have some more paperwork for me. She might be sitting on her porch swing in Clarksville right now, clacking away on her portable computer and watching the raindrops pelt the neighbour’s yard appliances. \"Nothing that can\u0027t wait,\" I decided. 45 Two hours later we were back in San Antonio, in Erainya\u0027s neighbourhood. I had promised Jem I\u0027d come by Halloween evening, but it only took Jem a couple of blocks worth of trickortreating to decide that Miranda was the one he really wanted to play with. She raced him up each sidewalk. She laughed at his knockknock jokes. She showed the most appreciation for his costume. Jem was tickled to death when Miranda offered to be his Miss Muffett. \"She\u0027s good with kids,\" Erainya told me. Erainya and I were sitting on the hood of Erainya\u0027s Lincoln Continental, watching the action. There was plenty of it in Terrell Hills that evening. The neighbourhood Anglo kids were travelling in twos or threes, dressed in their storebought princess and ninja outfits, their pumpkin flashlights switched on and their plastic jacko\u0027lanterns stuffed with candy. The bubba esque parents strolled a few feet behind, drinking their Lone Stars, talking on the porches, some of the dads with little portable TVs to keep track of the college football games. Then there were the kids imported from the South Side travelling in groups of ten or twenty, unloaded from their parents\u0027 old station wagons into the rich gente neighbourhoods to gather up what food they could. They dressed in old sheets and maybe some smeared face paint, sometimes a plastic dimestore mask. The bigger kids, fifteen or sixteen years old, did their best to cover their hairy arms and their faces. They let their younger siblings do the asking. The parents always stayed well back on the sidewalk, and always said thank you. No Lone Stars. No portable TVs. Then there were the oddball loners like Jem. He was skipping awkwardly along in his bulbous homemade spider costume, the black fur coming off on the boxwood hedges and the wire arms flailing and catching on the paper skeletons people had hung from their mesquite trees. By the third block he didn\u0027t have much costume left, but nobody seemed to mind. Especially not Jem. I watched Miranda chasing Jem back down another sidewalk. Both of them jumped over a mesquite that grew flat across the front yard in the shape of a wave. Jem showed off the pralines and watermelon slice candy he\u0027d scored, then kept running with Miranda close behind. \"Way to go, Bubba,\" I told him. Miranda flashed me a smile. She went after Jem like she\u0027d been doing it all her life. Or all of Jem\u0027s, anyway. Erainya muttered something in Greek. \"What?\" I asked. \"I said you look like a Turk, honey. Why so sour?\" She was wearing the standard black Tshirt dress. When I\u0027d asked her why no costume she\u0027d said, \"What, I need to look like a witch, too?\" Her arms were crossed and she was grabbing her sharp elbows. Her expression was a little softer than usual, but I suspected that was just because she was tired. Over Erainya\u0027s objections, Jem had told me about their flush job at six that morning. He loves the canI useyourphonesoIcanlocatethisboy\u0027sparents routine. According to Jem the skipped husband\u0027s girlfriend opened the door right away and even offered them a Coke. Erainya had collected an easy day\u0027s fee from the wife\u0027s lawyer. \"I\u0027m not sour,\" I protested. Erainya tightened up her body a little more, extended one finger toward me like she was going to jab me with it. \"You got a nice lady with you, next week you get to come back to work with me—what\u0027s the trouble?\" \"It\u0027s nothing.\" Erainya nodded, but not like she believed me. \"You had it out with Barrera?\" I nodded. \"He give you reasons why people might be dying over this business with Sheckly?\" \"Yes. And reasons why it was over my head.\" We watched Jem wiggle his spider arms for the guy at the next front porch. The guy laughed and gave Jem an extra handful of candy from the large wicker basket he was holding. The guy also watched Miranda appreciatively from behind as she walked down the sidewalk. I wondered how much force it would take to fit the wicker basket onto his head. \"Don\u0027t listen to him,\" Erainya said. \"Don\u0027t let him cut you down.\" I looked at her, not sure if I\u0027d heard correctly. She examined her talon fingernails critically. \"I\u0027m not saying you did good, honey, getting involved the way you did. I\u0027m not saying I like your procedures. But I\u0027ll say this just once—you should do P.I. work.\" It was hard to read her expression in the dark. \"Erainya? That you?\" She frowned defensively. \"What? All I\u0027m saying is don\u0027t let Barrera treat you second class, honey. Cops make the worst P.I.s, no matter what he tells you. Cops know how to react, how to be tough. That\u0027s it. Most of them don\u0027t know the first thing about opening people up. They don\u0027t know about listening and untangling problems. They don\u0027t have the ganis or the sensitivity for that kind of work. You got ganis\" \"Thanks. I think.\" Erainya kept frowning. Her eyes drifted over to Miranda, who was racing Jem down the steps of the last porch on the block. \"How bad is the girl mixed up with this case?\" \"I wish I knew.\" \"Is somebody going to get hurt here?\" \"Not if I can help it.\" Erainya hugged her elbows and, just once, kicked the tire of the Lincoln with her heel, hard. \"You could do worse, honey.\" Jem and Miranda came back at full tilt, Jem running past me and Miranda running right into me, grabbing my forearms to stop herself. She had a little praline crumble at the corner of her mouth. Sneaking some of the loot. \"Hey,\" she said. Jem said he was ready to drive to another neighbourhood now. A Latino family of twelve walked by, the parents saying pretty much the same thing in Spanish. The father looked emptyeyed, like he\u0027d been driving around since way before sunset. The kids looked tired, the mother a combination of hungry and uneasy, doing her best to skirt her kids around the Bubba fathers with the portable TVs and the little blond kids with costumes that cost more than all her family\u0027s shoes put together. Erainya frowned down into Jem\u0027s candy bag, carefully chose a Sweetarts, the sourest thing she could find, and looked back up at me reprovingly. Then she ruffled Jem\u0027s balding furry headpiece and told him to get in the car. 46 \"We ain\u0027t going to make it.\" Miranda didn\u0027t sound concerned, exactly. More like she was getting a taste for tardiness and wasn\u0027t quite sure if she liked it or not. She\u0027d never been late to a gig before. Somebody else had always driven. Somebody responsible. No side trips to trickor treat with fouryearolds. \"I thought this was supposed to be impromptu,\" I said. \"Drop in on Robert Earle. Sing a couple of songs. Casual.\" \"This took Milo about a month to arrange, Tres. Century\u0027s got A \u0026 R folks coming from Nashville and everything. Milo will not be thrilled.\" She tried to fix her makeup again, not an easy task in a moving VW at night, even with the top up. She\u0027d wait until we passed under a highway light, then check her lips in the two seconds her face was illuminated in the visor mirror. She looked fine. During the next lighted moment I checked my watch. Nine o\u0027clock exactly. At Floore Country Store, two miles farther up the road, Robert Earle Keen would just be starting his first set, expecting to be pleasantly surprised halfway through by his old buddy, Miranda Daniels. Milo would be pacing by the entrance. Probably with brass knuckles. We zipped along with the front trunk rattling and the left rear wheel wobbling on its bad disc. I patted the VW\u0027s dashboard. \"Not this trip. Break down on the way home, please.\" Of course I told the VW that every trip. VWs are gullible that way. Miranda put away her makeup. She stared out at the ragged black line of huisache trees blurring past. \"I like your brother Garrett. I like Jem and Erainya.\" \"Yeah. They grow on you.\" She circled her hands around her knees. \"Thirty,\" she speculated. \"Hey—\" I warned.","sourceLink":"https://allnovel.net/the-widower-s-two-step-tres-navarre-2/page-41.html","bookId":2417,"book":{"id":2417,"title":"The Widower\u0027s Two-Step (Tres Navarre #2)","description":"Storyline: The Widower\u0027s Two-Step (Tres Navarre #2) Tres Navarre has just hours of apprenticeship time to serve before he can go for his P.I. license. Staking out a musician suspected of stealing a demo tape should be a piece of pan dulce. But his attention wanders just long enough for fiddle player Julie Kearnes to be gunned down before his eyes. He should just back away and let the cops investigate, but backing away has never been Tres\u0027s strong point. The missing demo and Julie\u0027s murder are just two of the problems besetting Miranda Daniels, a pint-sized singer with Texas-sized talent. She\u0027s the prize in a tug-of-war between two music hotshots who want to manage her career. One has a habit of making bad things happen to people he doesn\u0027t like. The other has just vanished without a trace. As Tres looks into the dirty dealings surrounding Miranda, it becomes clear he\u0027s stepped into a rattlesnakes\u0027 nest of greed, double cross, and murder—and he may be the next to be snakebit.","cover":"https://allnovel.net/images/the-widower-s-two-step-tres-navarre-2.jpg","author":"Rick Riordan","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-widower-s-two-step-tres-navarre-2.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 10:37:12 AM"}}
