{"id":76254,"no":46,"title":"Page 46","content":"He flipped a page of Today\u0027s Parent. \"Colic,\" he said, like he was talking to himself. \"It\u0027s driving me crazy.\" \"That\u0027s rough,\" I agreed. I waited. Frank turned a couple more pages. He read like he was looking at assembly instructions, his eyes flicking back and forth around the pages in no particular order, looking for the schematics on proper babybuilding. \"You supposed to be keeping tabs on me?\" I asked. Frank nodded, tapping his thumb on a picture of a new superabsorbent diaper. \"Sheckly?\" Frank nodded again. \"You want to come in for some enchiladas?\" Three times was a charm. Frank put down his magazine, picked up his briefcase, and got out of the car. We walked around the side of the house. My landlord Gary Hales was standing in his living room, watching out the window as I brought the man with the shoulder holstered gun and the black briefcase onto his property. Gary loves it when I do stuff like that. I opened the door of the inlaw and Robert Johnson padded up, bumped into Frank\u0027s leg, then stepped back indignantly, his superkeen animal senses suddenly warning him that I wasn\u0027t alone. \"Hey, blackie.\" Frank bent down and scratched Robert Johnson\u0027s ear. Frank apparently passed inspection. Robert Johnson began rubbing the side of his face vigorously on Frank\u0027s shoe. Frank glanced around the room, still in read schematic mode, until his eyes came to rest on the exhibition sword in the wall mount. \"Tai chi?\" I nodded, surprised. Nobody guesses correctly. Frank waved at the futon. \"Okay?\" \"Sure,\" I said. He sat, putting his briefcase on the coffee table. I went into the kitchen and took out the two foam boxes of enchilada dinners. Robert Johnson materialized on the counter instantly. I got out three paper plates in wicker plate holders. Two enchiladas for me, one for Frank, one for Robert Johnson. Flour tortillas and beans and rice and grease all around. I took the food into the main room, set Robert Johnson\u0027s on the rug, and handed Frank his. Frank sat forward on the futon. He rolled a tortilla into a tube, dipped it in enchilada sauce, and bit the end off. \"Enough\u0027s enough,\" he said. \"The briefcase has some prelims from the M.E. on Brent Daniels, some paperwork I borrowed from Hollywood Park on Alex Blanceagle. There\u0027s also some other cases from the Avalon Department where\"—he stopped, considering—\"where Sheckly\u0027s name has figured prominently.\" \"And you\u0027re showing all this to me?\" Frank read the wall. He chewed his tortilla. \"Some guys I know at Bexar County—Larry Drapiewski, Shel Masters—they tell me you\u0027re solid.\" I tried not to look surprised. Larry and Shel didn\u0027t always tell me I was solid. The adjectives they used about me much more frequently had to do with gas or liquid. Frank must\u0027ve caught them at a weak moment. \"You should be giving this to Samuel Barrera,\" I suggested. Frank gave me a brief smile, then he slid the briefcase toward me across the table. \"But Barrera would feel obliged to say where he got the information,\" I continued. \"You need someone who can take a little heat off you.\" He finished his tortilla, wiped his fingers, then stood up. \"Shame you didn\u0027t come home today,\" he speculated. \"I\u0027ll wait until midnight, then decide to call it quits. Agreed?\" I nodded. \"Good luck with the colic.\" Frank actually smiled. \"Yeah. And, Navarre—I hear things at the department. Elgin, some of the other guys who were at Floore\u0027s last night. They\u0027re hoping you come back into Avalon County sometime when they\u0027re on duty. If I were you, I wouldn\u0027t do it.\" When Frank was gone, I kicked off my Justins and let my toes expand to their normal size. Robert Johnson came over and discovered that his head fit perfectly in a size eleven boot. He shimmied in up to his waist and stayed that way, his tail flicking back and forth. \"You\u0027re weird,\" I told him. His back legs padded a few times. The tail flicked. Then I remembered I wasn\u0027t supposed to be home. That left several options, none of them pleasant. I reclaimed my boots and headed out toward Monte Vista. 51 When I got to the SaintPierres\u0027 house the realtor was just leaving. \"Mr. SaintPierre?\" she asked. Her tone was mildly amused. She held the front door open for me with just her fingertips, up at ear level, the way my mom used to hold up my dirty Tshirts, asking if I could get them in the hamper for once. \"Thanks,\" I said. \"I made some sketches.\" She wedged her clipboard snugly under the arm of her rottenapple brown blazer. \"The house has marvellous flow patterns.\" \"I\u0027ve always thought so.\" She nodded, pursed her lips, then appraised the front of the house one more time. \"Well, I\u0027ll get back to you.\" \"Allison gave you a time frame?\" \"She said immediately.\" \"Perfect.\" She gave me another amused smile—probably never met a talent agent before—then offered me her business card. Sheila Fletcher \u0026c Associates. The ink was the same colour brown as her jacket and her nails. She waved three fingers at me as she walked down the driveway and got into her Jeep. Sure enough, the interior of the house had great flow patterns now. Easy when there was nothing to flow around. The white sofas and the artwork pedestals were gone. The Oaxacan wall hangings had been removed so the walls were all white paint and windows. Six million moving boxes were stacked by the door. The bar was still set up, however, and there were two glasses on it, one sticky with lipstick and bourbon residue, the other half full of tepid water. The fireplace had been used the night before. The smell of smoke lingered from the poorly working flue. After the previous night, smoke was not a smell I was glad to encounter. I went upstairs and started checking the bedrooms. The first was packed. In Les\u0027 room the fourposter bed was stripped, the roll top desk taped shut, his closet empty. I opened one of the moving boxes packed in the corner. Les\u0027 Denton High School yearbook was on top. \"What the hell are you doing?\" I turned and found Allison was in the doorway. She\u0027d raked her blond hair into stiff wet rows, rinsed but not shampooed. Her complexion was pasty, the corners of her eyes unhealthy red. Her figure was totally hidden under a man\u0027s white dress shirt and baggy khakis. Maybe they were Les\u0027. The shirt was speckled with some light brown liquid. \"Glad I caught you before you left town,\" I said. She glared at me. \"Get the hell out, Tres. Isn\u0027t it enough—\" She faltered. She waved her hand vaguely north, in the direction of the Daniels ranch. I nudged the moving box with my foot. \"The realtor says you\u0027re moving out immediately.\" \"Is that any of your business?\" \"Possibly.\" She grabbed her forearm with her opposite hand like she was covering a wound. She looked past my shoulder. \"I\u0027m renting the house, all right? I can cover the mortgage that way until the sale can happen. It\u0027s about the only choice I had.\" \"What happened to taking over the agency?\" Allison laughed. Her voice was suddenly quivery. \"Milo\u0027s been real busy with Miranda, but not too busy to bring in some lawyers. Why don\u0027t you ask him?\" She stepped inside and sank down on the edge of the stripped mattress. She stared at the boxes of Les\u0027 things. \"Who did you have over last night, Allison?\" \"That is definitely none of your business.\" \"You\u0027re going to need an alibi.\" She opened her mouth. She searched for something to say but couldn\u0027t quite find it. \"Arson with murder is almost always to cover traces,\" I said. \"Homicide done hastily, by somebody who flew off the handle. Who does that sound like?\" She made a small croaking sound. \"You think—\" \"I don\u0027t think,\" I said. \"But it doesn\u0027t look good—you packing up and moving out. If I was the detective in charge of Brent\u0027s murder, maybe with Tilden Sheckly paying me to find a convenient solution, I\u0027d start with you. Your husband disappears, your lover gets torched, you\u0027ve got a history of violent, unpredictable behaviour. I doubt many people would come to your defence.\" She hugged her arms. \"I\u0027ve got nothing. Brent is dead. Les is gone, Milo\u0027s got the agency, and I\u0027ve got nothing. Just leave me alone, okay?\" She leaned forward until her face was almost over her knees. I counted to ten. It didn\u0027t help. \"Get up.\" My own voice sounded strange. \"Come on.\" I grabbed Allison\u0027s upper arms and lifted her to her feet. She was heavy—not dead weight, but her bones seemed to be lead. I had to use most of my strength to keep her from twisting out of my grip. Finally she succeeded and pulled away. She stood there, weteyed, rub The Widower\u0027s Two it Step 337 bing the white stripes on her arms where my fingers had been. \"You fucker.\" \"I don\u0027t appreciate the selfpity. It\u0027s not going to get us anywhere.\" \"Just get out, Tres. You hear me? I used to think you were all right.\" She glared at me, willing me away, but the anger was unsustainable. She took a long shaky breath and looked around at the boxes again, the roll top desk, the blank walls. Finally he sank back down onto the bed. \"I\u0027m so tired,\" she murmured. \"Just go away.\" \"Let\u0027s get you out of here. Let\u0027s do something constructive.\" She shook her head apathetically. When I sat next to her, Allison leaned against me—nothing personal, just like I was a new wall. \"I\u0027m moving home to goddamn Falfurrias,\" she said. \"Can you believe that? This house can buy me about six of the nicest houses down there. I can raise cows. Listen to crickets at night. Isn\u0027t that insane?\" She looked up at me. Her eyes were watery. \"I\u0027m the wrong person to ask.\" She laughed the word shit. \"You never give me a goddamn straight answer, do you? Where is Miranda?\" \"Staying safe.\" \"In your apartment? Sharing that little futon?\" \"No. Not with me.\" Allison looked at me uncertainly. She heard the finality and the edge of bitterness in my voice and she didn\u0027t know quite what to do with it. She started to get up but I held her shoulder, not forcefully. I\u0027d like to say that from there events took their own course and I was caught by surprise. But they didn\u0027t and I wasn\u0027t. I kissed her. For once Allison SaintPierre didn\u0027t put up a fight. She eased into the kiss with a kind of exhausted relief. After a long time she leaned back into the bed and I went with her. She bit and kissed and breathed in my ear as I tried futilely to work the first button on the massive white dress shirt until she laughed and whispered, \"Forget it.\" She sat up just enough to get the shirt off overhead. Then she pressed against me again and felt twice as warm, almost feverish. Her back was all goose bumps. We rolled around on Les SaintPierre\u0027s bed and with each new angle the most exposed piece of clothing was kicked or pulled or cursed away. I think Allison stopped crying by the time the clothes were all gone. Her skin was uncomfortably hot except for her fingers. Those were icecold.","sourceLink":"https://allnovel.net/the-widower-s-two-step-tres-navarre-2/page-46.html","bookId":2417,"book":{"id":2417,"title":"The Widower\u0027s Two-Step (Tres Navarre #2)","description":"Storyline: The Widower\u0027s Two-Step (Tres Navarre #2) Tres Navarre has just hours of apprenticeship time to serve before he can go for his P.I. license. Staking out a musician suspected of stealing a demo tape should be a piece of pan dulce. But his attention wanders just long enough for fiddle player Julie Kearnes to be gunned down before his eyes. He should just back away and let the cops investigate, but backing away has never been Tres\u0027s strong point. The missing demo and Julie\u0027s murder are just two of the problems besetting Miranda Daniels, a pint-sized singer with Texas-sized talent. She\u0027s the prize in a tug-of-war between two music hotshots who want to manage her career. One has a habit of making bad things happen to people he doesn\u0027t like. The other has just vanished without a trace. As Tres looks into the dirty dealings surrounding Miranda, it becomes clear he\u0027s stepped into a rattlesnakes\u0027 nest of greed, double cross, and murder—and he may be the next to be snakebit.","cover":"https://allnovel.net/images/the-widower-s-two-step-tres-navarre-2.jpg","author":"Rick Riordan","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-widower-s-two-step-tres-navarre-2.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 10:37:12 AM"}}
