{"id":98240,"no":6,"title":"Page 6","content":"\"Forcing her to marry you would gain you her fortune but tossing her overboard would remove the only witness.\" Lips drawn back off his teeth, Henry buried his hand in Sir William\u0027s hair and forced his head back. Cravat and collar were thrown to the floor, exposing the muscular column of throat. \"I don\u0027t know how you convinced her to accompany you, but it doesn\u0027t really matter now.\" With the last of his strength, Sir William shoved the crumpled piece of paper in Henry\u0027s face, his life saved by the faint scent of a familiar perfume clinging to it. Henry managed to turn aside only because he\u0027d fed at dawn. His left hand clutching the note, his right still holding Sir William\u0027s hair, he straightened. \"... I can no longer deny you but it must be tonight for reasons I can not disclose at this time.\" It was signed, C. Amworth. Frowning, he looked down into Sir William\u0027s face. If Carmilla had insisted that they leave for the yacht tonight there could be only one answer. \"Did Yves Bouchard suggest you seduce Miss Amworth?\" \"I do not seduce young woman on the suggestion of acquaintances,\" Sir William replied as haughtily as possible under the circumstances. \"However,\" he added hurriedly as the hazel eyes locked onto his began to darken, \"Bouchard may have mentioned she was not only rich but ripe for the plucking.\" So, there was the Bouchard connection. Caught between the two men, Carmilla Amworth was being used by both. By Bouchard to gain access to Wyndham\u0027s yacht and therefore France. By Wyndham to gain access to her fortune. And that seemed to be all that Sir William was guilty of. Still frowning, Henry stepped back. \"Well, if you didn\u0027t steal the document,\" he growled, \"who did?\" \"I did.\" As he turned, Carmilla pointed a small but eminently serviceable pistol at him. \"I\u0027ve been waiting in Sir William\u0027s carriage these last few moments and when no one emerged, I let myself in. Stay right where you are, Mr. Fitzroy,\" she advised, no longer looking either fragile or waif-like. \"I am held to be a very good shot.\" Her calm gaze took in the positions of the two men and she suddenly smiled, dimples appearing in both cheeks. \"Were you fighting for my honor?\" Lips pressed into a thin line, Henry bowed his head. \"Until I discovered you had none.\" The smile disappeared. \"I was raised a republican, Mr. Fitzroy, and I find the thought of that fat fool returning to the throne of France to be ultimately distasteful. In time...\" Her eyes blazed. \"...I\u0027ll help England be rid of her own fat fool.\" \"You think the English will rise and overthrow the royal family?\" \"I know they will.\" \"If they didn\u0027t rise when m...\" About to say, my father, he hastily corrected himself. \"...when King Henry burned Catholic and Protestant indiscriminately in the street what makes you think they\u0027ll rise now?\" Her delicate chin lifted. \"The old ways are finished. It\u0027s long past time for things to change.\" \"And does your uncle believe as you do?\" \"My uncle knows nothing. His little niece would come visiting him at his office and little bits of paper would leave with her.\" The scornful laugh had as much resemblance to the previous giggles as night to day. \"I\u0027d love to stand around talking politics with you, but I haven\u0027t the time.\" Her lavender kid glove tightened around the butt of one of Manton\u0027s finest. \"There\u0027ll be a French boat meeting Sir William\u0027s yacht very early tomorrow morning and I have information I must deliver.\" \"You used me!\" Scowling, Sir William got slowly to his feet. \"I don\u0027t appreciate being used.\" He took a step forward but Henry stopped him with a raised hand. \"You\u0027re forgetting the pistol.\" \"The pistol?\" Wyndham snorted. \"No woman would have the fortitude to kill a man in cold blood.\" Remembering how both his half-sisters had held the throne, Henry shook his head. \"You\u0027d be surprised. However,\" he fixed Carmilla with an inquiring stare, \"we seem to be at a stand-still as you certainly can\u0027t shoot both of us.\" \"True. But I\u0027m sure both of you gentlemen...\" The emphasis was less than complimentary. \"...will co-operate lest I shoot the other.\" \"I\u0027m afraid you\u0027re going to shoot no one.\" Suddenly behind her, Henry closed one hand around her wrist and the other around the barrel of the gun. He had moved between one heartbeat and the next; impossible to see, impossible to stop. \"What are you?\" Carmilla whispered, her eyes painfully wide in a face blanched of color. His smile showed teeth. \"A patriot.\" He\u0027d been within a moment of killing Sir William, ripping out his throat and feasting on his life. His anger had been kicked sideways by Miss Amworth\u0027s entrance and he supposed he should thank her for preventing an unredeemable faux pas. \"Sir William, if you could have your footman go to the house of Captain Charles Evans on Clarges Street, I think he\u0027ll be pleased to know we\u0027ve caught his traitor.\" \"... so they come and took the lady away but that still doesn\u0027t explain where you\u0027ve been \u0027til nearly sunup.\" \"I was with Sir William. We had unfinished business.\" Varney snorted, his disapproval plain. \"Oh. It was like that, was it?\" Henry smiled as he remembered the feel of Sir William\u0027s hair in his hand and the heat rising off his kneeling body. Well aware of what the smile meant, Varney snorted again. \"And did Sir William ask what you were?\" \"Sir William would never be so impolite. He thinks we fought over Carmilla, discovered she was a traitor, drank ourselves nearly senseless, and parted the best of friends.\" Feeling the sun poised on the horizon, Henry stepped into his bedchamber and turned to close the door on the day. \"Besides, Sir William doesn\u0027t want to know what I am.\" \"Got some news for you.\" Varney worked up a lather on the shaving soap. \"Something happened today.\" Resplendent in a brocade dressing gown, Henry leaned back in his chair and reached for the razor. \"I imagine that something happens every day.\" \"Well today, that Carmilla Amworth slipped her chain and runoff.\" \"She escaped from custody?\" \"That\u0027s what I said. Seems they underestimated her, her being a lady and all. Still, she\u0027s missed her boat so even if she gets to France she\u0027ll be too late. You figure that\u0027s where she\u0027s heading?\" \"I wouldn\u0027t dare to hazard a guess.\" Henry frowned and wiped the remaining lather off his face. \"Is everyone talking about it?\" \"That she was a French spy? Not likely, they\u0027re all too busy talking about how she snuck out of Lady Glebe\u0027s party and into Sir William\u0027s carriage.\" He clucked his tongue. \"The upper classes have got dirty minds, that\u0027s what I say.\" \"Are you including me in that analysis?\" Varney snorted. \"Ask your poet. All I say about you is that you\u0027ve got to take more care. So you saved Wellington\u0027s Army. Good for you. Now...\" He held out a pair of biscuit colored pantaloons. \"...do you think you could act a little more suitable to your condition?\" \"I don\u0027t recall ever behaving unsuitably.\" \"Oh, aye, dressing up so fine and dancing and going to the theater and sitting about playing cards at clubs for gentlemen.\" His emphasis sounded remarkably like that of Carmilla Amworth. \"Perhaps you\u0027d rather I wore grave clothes and we lived in a mausoleum?\" \"No, but...\" \"A drafty castle somewhere in the mountains of eastern Europe?\" Varney sputtered incoherently. Henry sighed and deftly tied his cravat. \"Then let\u0027s hear no more about me forgetting who and what I am. I\u0027m very sorry if you wanted someone a little more darkly tragic. A brooding, mythic personae who only emerges to slake his thirst on the fair throats of helpless virgins...\" \"Here now! None of that!\" \"But I\u0027m afraid you\u0027re stuck with me.\" Holding out his arms, he let Varney help him into his jacket. \"And I am almost late for an appointment at White\u0027s. I promised Sir William a chance to win back his eleven hundred pounds.\" His sensibilities obviously crushed, Varney ground his teeth. \"Now, what\u0027s the matter?\" The little man shook his head. \"It just doesn\u0027t seem right that you, with all you could be, should be worried about being late for a card game.\" His expression stern, Henry took hold of Varney\u0027s chin, and held the servant\u0027s gaze with his. \"I think you forget who I am.\" His fingertips dimpled stubbled flesh. \"I am a Lord of Darkness, a Creature of the Night, an Undead Fiend with Unnatural Appetites, indeed a Vampyre; but all of that...\" His voice grew deeper and Varney began to tremble. \"...is no excuse for bad manners.\"","sourceLink":"https://allnovel.net/what-manner-of-man/page-6.html","bookId":2608,"book":{"id":2608,"title":"What Manner of Man","description":"Storyline: Shortly after three o\u0027clock in the morning, Henry Fitzroy rose from the card table, brushed a bit of ash from the sleeve of his superbly fitting coat and inclined his head toward his few remaining companions. \"If you\u0027ll excuse me, gentlemen, I believe I\u0027ll call it a night.\" \"Well, I won\u0027t excuse you.\" Sir William Wyndham glared up at Fitzroy from under heavy lids. \"You\u0027ve won eleven hundred pounds off me tonight, damn your eyes, and I want a chance to win it back.\"","cover":"https://allnovel.net/images/what-manner-of-man.jpg","author":"Tanya Huff","type":"Horror","source":"allnovel","link":"https://allnovel.net/what-manner-of-man.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:32:45 PM"}}
