{"id":33794,"no":14,"title":"CHAPTER XIII. RESCUED.","content":"STEVE RUTHERFORD, the settler Owen, and Hugh made their way along at the foot of the steep rocks, keeping among the fallen boulders, stopping at times, and making a close survey of the plains to be sure that no Indians were in sight, before moving further. \"That is the point,\" Steve said presently; \"from among those rocks we can get a view of the village. You must keep your head low, Lightning, and not show it above the rocks. They will be keeping a sharp look-out, and like enough they would make out a lizard moving at this distance.\" When they reached the point they made their way with extreme care to the highest boulders, and then, lying down, looked through the interstices between them. Hugh started as he did so, for although the Indian village was nearly half a mile away, the mountain air was so clear that it did not seem a quarter of that distance. Its position was well chosen; the hill rose almost perpendicularly behind it, defending it from an attack on that side, while in front and on both sides the ground sloped away and was clear of brushwood or inequalities that would afford shelter to assailants. Trees stood in and around it, affording shade during the heat of the day. A number of horses were grazing close to the village, with half a dozen Indian boys round them, in readiness to drive them in at the shortest notice. Smoke was curling up from the top of the wigwams, and through the trees many figures of men and women could be seen moving about. [225] \"How long do you think it will be, Steve, before their scouts get back again?\" \"Another hour, I should guess; I expect they started at daybreak. Anyhow, they had gone before I got here. I reckon they wouldn\u0027t travel fast going there; in the first place they would scout about and look for signs of an enemy, and in the second they wouldn\u0027t want to blow their horses, for they might have to ride for their lives any moment. I should give them four hours, a good two and a half to get there, and something over an hour for one of them to get back again. He may be here in half an hour, he may not be here for an hour; it will be somewhere between one and the other.\" Twenty minutes passed, and then Steve exclaimed, \"Here he comes!\" The other two caught sight of the Indian at the same moment, as first his head and shoulders, then the whole rider and horse, appeared on the crest of a rise some four miles away. He was as yet invisible from the village, but in a few minutes they could perceive a stir there, and three or four warriors ran out from the village, leaped on to their horses, and galloped out to meet the returning scout. They saw them join him, and, sweeping round without a check, accompany him, and in ten minutes they reached the village. A minute later a mournful wail sounded in the air. \"They know it now,\" Steve said; \"they are just about beginning to feel as we do. It is all very well as long as they go out, and murder and burn, and come back with scalps, but they don\u0027t like it when the game is played on them.\" \"When will they start out again, do you think, Steve?\" \"Not yet awhile, they are going to talk; Indians never do anything without that. There, do you see, there ain\u0027t a man among the trees; there are some women and children, but nary a warrior. You may be sure that they are gathering for a great council; first of all the scout will tell his story, then the chiefs will talk. It will be another hour at least before there is a move made.\" \"Oh, I do hope our plan won\u0027t fail!\" Hugh said. [226] \"I don\u0027t think that there is much chance of it,\" Owen put in. \"They are bound to do something. Their scout can only report that, so far as he saw, there was not more than four men, and as they did not chase him he expects they have no horses. They never can leave it like that. They are bound to go out and see about it, otherwise they know they couldn\u0027t go in twos or threes without the risk of being ambushed, just as the scouts were; besides, they lost the two men they left behind, and maybe one, maybe three, this morning, and they are bound to have vengeance. Oh, they air safe to go!\" An hour later a sudden succession of wild yells were heard. \"Thar\u0027s their war-cry,\" Steve said; \"the thing is settled, and they air going.\" A few minutes later the Indian boys were seen driving the horses in towards the village, and then a number of warriors ran out. \"There air a good lot of them,\" Steve said, in a tone of satisfaction. \"They was sure to go, the question wur how many of them. It will be a strong party anyhow.\" The Indians were soon seen to be mounting. \"Now we can count them,\" Steve said. \"Five-and-thirty.\" \"I couldn\u0027t tell within four or five,\" Hugh said; \"they keep moving about so, but I should say that was about it.\" \"Yes, five-and-thirty,\" Owen agreed. \"You have the youngest legs, Lightning, you scoot across as hard as you can run and tell them to get ready; Steve and I will see them fairly off, and then we will come in. Don\u0027t let them move out of the hollow till we join you; there ain\u0027t no special hurry, for we mustn\u0027t attack till the band have got four or five miles away. If they heard the guns they would be back agin like a torrent.\" Hugh did as he was told. As he ran down over the crest into the dip he gave a shout of satisfaction at seeing Broncho Harry and the three men who had remained with him; they had arrived a few minutes before. \"Well, Harry, we saw all had gone right, as only one of their scouts came back.\" [227] \"Has it drawn them?\" Harry asked. \"Yes; a band of five-and-thirty started five minutes ago.\" \"Bully for us!\" Harry said. \"Then we have got them all right now. I expect there ain\u0027t above thirty fighting men left in the village, and, catching them as we shall, they won\u0027t have a show against us.\" \"How did you get on, Harry?\" \"It wur just as you reckoned, lad; three of \u0027em came out. They were very scarey about coming close; they yelled to their mates, and in course got no answer; then they galloped round, one at a time, getting nearer and nearer, but at last they concluded that the place was deserted, and rode up. We let them get so close that there wur no fear of our missing, and then we shot two of them; the other rode for it. We fired after him, but took good care not to hit him, and as soon as he had gone we ran to the wood where we had left our ponies, and came on here pretty slick. There wur no difficulty in following your trail; we reckoned that we should have to come pretty fast to be here in time, as it wur three or four miles further for us to go than the Injun would have, and he wouldn\u0027t spare his horse-flesh. Still we was sure it would be an hour at least before they was ready to start, more likely two. Jim Gattling wur flurried a bit; natural he wouldn\u0027t like not to be with the others when they went in to rescue Rosie. So it seems we air just in time with nothing to spare. But here comes Steve.\" By this time all had been got ready for a start. Horses had been brought up, saddles looked to, girths tightened, and blankets strapped on. A hearty greeting was exchanged between Steve and the party just arrived. \"We will give them another ten minutes afore we start,\" Steve said. \"Now, we had better settle, Broncho, as to what we should each do when we get in, else there may be confusion, and they may tomahawk the prisoners before we find them.\" \"Yes, that is best,\" Broncho agreed. \"Now, look here; our crowd will do the fighting, and you and your fellows jump off [228] as soon as you get in, and search the wigwams. You will know just where to go; the prisoners are safe to be in a wigwam close by that of the principal chief; he will keep them close under his eye, you may bet your life. And mind, boys, let us have no shooting at squaws or kids. We have come out to rescue the women they have carried off, and to pay out the men for the work they did, but don\u0027t let us be as bad as they are.\" There was a general assent from the cow-boys, but two or three of the men who had come with them grumbled, \"They have killed our wives and children, why shouldn\u0027t we pay them back in the same coin?\" \"Because we are whites and not Red-skins,\" Broncho Harry said. \"Look here, Steve; we have come here to help you, and we are risking our lives pretty considerable in this business, but afore we ride into that village we are going to have your word that there ain\u0027t going to be a shot fired at squaw or child. Those are our terms, and I don\u0027t think they are onreasonable.\" As a chorus of approval went up from the rest of the cow-boys, and as the others were well aware that what they said they meant, they unwillingly assented. \"That is right and square,\" Broncho Harry said. \"You have all given your promise, and if anyone breaks it, I begin shooting, that is all. Now it\u0027s about time to be moving, Steve.\" The men swung themselves up into their saddles. \"Now, boys, quietly until we get in sight of the village, and then as fast as we can go.\" But all were eager for the fight, and the pace gradually quickened till they came within sight of the village. Then they charged down upon it at full gallop. They had gone but a short distance when they heard the cry of alarm, the yells of the Indians, shouts and orders, screams of women and children, and the barking of the village dogs. Shots were fired, but to Hugh\u0027s surprise these ceased before the cow-boys reached the village. [229] \"The skunks are bolting,\" Broncho Harry exclaimed. \"Keep round the trees, No. 2 outfit, and straight across the plain after them. They may have got some of the girls.\" It was, however, less than two minutes from the moment the assailants had been seen to that when they burst into the village. The Indians, taken altogether by surprise at the appearance of a foe from a quarter from which no danger had been apprehended, and seeing a band of the dreaded cow-boys dashing down at a gallop, caught up their arms, and then, in obedience to the orders of the chief left behind in charge of the village, dashed out to their horses, mounted, and rode off. Their leader had seen at once that there was no hope of resistance. The assailants were nearly equal in number to the fighting men left in the village, they would be armed with those terrible pistols that were the dread of the Indians, and they had all the advantage of a surprise. There was nothing to do but to ride off to the main body. For a moment the thought of killing the prisoners before starting had crossed his mind, but there was no time to run to the wigwam in which they had been placed, and he saw too that their death would entail that of the Indian women and children. These had been no less speedy in their movements than the men, and at the first cry of danger the women had seized their infants and, followed by the boys and girls of the village, had fled along the foot of the cliff till they reached a spot where, although steep, it was accessible. Here a path, winding among boulders and hidden by bushes, led up to the top of the cliff. This had been constructed by the boys of the village at the time the Indians first established themselves there, for the purpose of enabling its occupants to make their escape in case of a sudden attack by superior forces. Steve and his party were astonished when, as they dashed into the village, they found the place almost deserted. A few old men stood at the entrances of their wigwams, and four or five aged women were assembled in front of one standing near the centre of the place; and as the cow-boys and settlers galloped [230] up, five white women ran out from the wigwam to meet them, with cries of joy. \"All safe, Rosie?\" Steve Rutherford shouted as he rode up. \"All safe, father;\" and a cheer burst from the rescuers as they leapt from their horses and crowded round the girls. These had all friends or relations among the party. \"Three of you let off your rifles one after the other,\" Steve said, the instant he had embraced his daughter. \"I told Broncho as he rode off that should be the signal that we had got them all. Then some of you had better ride as hard as you can after them. You may be wanted, though I don\u0027t expect the Indians will stop. Tell Broncho he had best come back again, there ain\u0027t no time to lose. The rest of you scatter and put a light to these wigwams. There is all the things they stole from us scattered among them, and all their skins and things, not worth much, perhaps, but a lot to them. Look into the huts and see there ain\u0027t no babies left in them. Where are all the women and children, Rosie?\" But Rosie was at that moment much too occupied with Jim Gattling to hear him. \"Never mind that now, gal,\" Steve said, striding up to them; \"there will be time enough for fooling when we get out of this. Whar are the women and children?\" \"I don\u0027t know, father. We know nothing about it. We were in the wigwam and suddenly heard shouts and screams, and then almost directly everything became quiet, and then these old women opened the door and made signs to us to come out, and as we did we saw you charging in among the trees.\" ALL SAFE, FATHER,\" CRIED ROSIE. \"Where are the squaws and children?\" Steve asked one of the old women in her own language. She looked vacantly at him as if she did not understand. \"Bah! that\u0027s no use,\" he said; \"I might have known that. Scatter about, boys; see if you can\u0027t find some of them. They can\u0027t have gone out on to the plain, that is sartin. They can\u0027t have got up this cliff—not here. Perhaps thar\u0027s a cave somewhere. Scatter along and sarch. Go right along some distance each way, thar may be some path up somewhere.\" [231] \"What does it matter about them, Steve?\" one of the settlers asked. \"We agreed there wurn\u0027t to be no killing of squaws or kids.\" \"I don\u0027t want to kill them,\" Steve said. \"I am just so pleased at getting my girl and the others back that I don\u0027t feel like hurting anything; what Broncho and me reckoned on was to take some of the chiefs\u0027 wives and children along with us as hostages. If we had them with us we reckoned they would not attack us on our way back. I tell you, boys, it may just make the difference of our scalps to us.\" Not another word was needed, and all, with the exception of a few of the friends of the rescued women, scattered on the search. It was ten minutes before they found the concealed path. The man who discovered it ran back to Rutherford. \"I have found the place, Steve; it is away three or four hundred yards to the left there. Just at the end of the clump of trees there are some bushes against the face of the hill. It didn\u0027t look as if there could be any way up, but I pushed through them, and, sure enough, there was some steps cut in the rock. I went up them, and round a sharp angle there was a sort of gap in the cliff. You couldn\u0027t see it from the plain, and a path went straight up there.\" \"That air bad news, Owen. They have got a quarter of an hour\u0027s start, and it ain\u0027t no sort of use our going after them. Waal, there is nothing to do but to ride for it. I wish Broncho\u0027s party was back.\" \"They air just coming back,\" a man said. \"I have been to the edge of the wood to look after them. They are galloping back, and will be here in a few minutes.\" By the time Broncho Harry and his party rode into the village the wigwams were all in flames. The men who had set fire to them had brought out the meat they had found inside. There were several quarters of deer, and a quantity of beef, doubtless the produce of animals belonging to the herd they had driven off. They were satisfied that the burning of the wigwams would be a heavy loss to the Indians, for they [232] had found many piles of skins and robes stored up to be used in barter for guns and horses. Indeed, the whole belongings of the tribe, except their cattle, were destroyed, together with, what perhaps would be even more severely felt, the scalps taken from their enemies in many a fight and massacre. A few words acquainted the new-comers with what had taken place, and they were delighted to find that they had arrived in time to save the women from the fate that awaited them. \"Did you hear the rifle-shots, Broncho?\" \"Nary one. We was having a skirmish with the Red-skins. They showed fight at first till they saw the rest of the boys coming out. We chased them two miles, and killed six of them. Then we thought it best to come back, for we could see that a couple of the best mounted had been sent straight off as hard as they could go after the first lot. We should not have chased them as far as we did, but we wanted to rope five of their horses for the women. As soon as we had done that we took the back track. Have you caught some of the squaws, Steve?\" \"No, worse luck, they had all cleared out afore we got here. There was nary a soul in the village except these old men and women.\" \"But where on earth did they get to?\" \"It took us a quarter of an hour to find out, and then one of the men lit on it pretty nigh by accident. Right along the cliff thar is some steps cut in the rock. They are hidden by bushes, and up above them is a sort of gap in the rock with a path up it. You can\u0027t see it from the plain at all. No doubt that is the principal reason why they fixed their village here. It gave them a means of escape if they were attacked.\" \"Waal, if you haven\u0027t got no hostages, Steve, there ain\u0027t another minute to waste here. You see we had figured on them hostages. I see you have got some meat; that is good. Waal, are you all ready? because if so, let\u0027s git.\" Three minutes later the party rode away from the burning village, the women mounted on the Indian horses. [233] \"Thar\u0027s our cattle,\" Steve said, pointing to a herd out on the plain, \"but it ain\u0027t any use thinking of them now.\" \"You bet,\" Broncho Harry replied. \"There ain\u0027t no thinking about horns or hides at present. It is our own har we have got to think of.\" \"You think they will catch us up, Broncho?\" said Steve. \"I don\u0027t think nothing at all about it. They are just as sure to catch us up as the sun is to rise. We have got every foot of a hundred miles to go, and the horses have been travelling hard for the last three days. By this time those fellows as have galloped on ahead are pretty nigh their main party, if they haven\u0027t overtook them before this. They had no call for speed, and would be taking it easy. You can\u0027t reckon much more than ten miles start. Still, when they catch us they won\u0027t be more than three to one. \"There was thirty-five went out, you said, Steve, and another twenty-five in the second lot. That brings them up to sixty, which is pretty nigh three to one. \"Well, three to one ain\u0027t such great odds even if they wur to come down and fight us in a body; but I reckon they would not do that. They are more likely to make a surround of it. They would know that we should have to leave pretty near half our number to guard the women, and the rest wouldn\u0027t be strong enough to charge them. Besides, it ain\u0027t only sixty we have got to reckon with. Like enough half a dozen of them started, as soon as we turned back, to the other villages of the tribe. You may reckon we shall have two or three hundred of them coming along in our track in an hour or two. Don\u0027t you make any mistake about it, Steve; we sha\u0027n\u0027t get away, and we have got to fight. Now, you know the country, and what you have got to reckon up is, where shall we fight? You can\u0027t calkilate on above fifty miles, and if you say forty it will be safer. A few of the horses might get a bit further than that, but taking them all round, and reckoning they have been going hard for the last few days, forty is the longest we can calkilate on afore we hear the Red-skin yells behind us.\" [234] \"The Two Brothers are about forty miles from here,\" Steve Rutherford said. \"Ah! I have heard of them. They are two buttes close together, ain\u0027t they?\" \"Yes. We should be safe enough there if all the Red-skins in creation was attacking us. They might starve us out, but they could never climb up. One of the Brothers there ain\u0027t no climbing up at all. It stands straight up all round, but the other has got a track up. I have seen cattle on the top.\" \"Do you know the way up, Steve?\" \"Yes. I was with a party that came out from the Canadian looking up cattle that had strayed. We didn\u0027t find many of the cattle. The Injuns had got them, you may be sure; but we stopped at the foot of the buttes, and did some hunting for a day or two. Three or four of us climbed up. It ain\u0027t a road you would choose to drive a team down, and I should not have thought that cattle would have climbed it if I hadn\u0027t been told they did so. Still it is good enough for us.\" There was no attempt to gallop at full speed, the horses being kept at a canter, the pace to which they are most accustomed. \"There,\" Steve said, pointing to the lower country ahead of them, for they had since starting been gradually descending, \"there are the Brothers.\" \"They don\u0027t look far away,\" Hugh, who was riding beside him, remarked. \"I guess they are near fifteen miles, Lightning.\" \"I should have said five if I had been asked,\" Hugh said. \"I wish they was only five. I expect before we get half way to them we shall hear the Injuns behind us.\" \"Yes, Broncho has been telling me what you think of it. Well, there is one thing, if we get to those buttes first we can keep the whole tribe at bay.\" \"Yes, lad, as far as fighting goes; but there is one thing agin us.\" \"Water?\" Hugh asked. [235] \"You have hit it. I don\u0027t say as there mayn\u0027t be some water up there. I reckon there is, for they told me the cattle would stay up there for some time without coming down. There weren\u0027t no cattle when I was there, and I didn\u0027t see no water, but it may be at times there is some. The top of the place seemed to me lowest in the centre—not a great deal, perhaps maybe not more than three or four feet—and if there is any hole in the middle there may be water there. I wurn\u0027t thinking of it at the time, and didn\u0027t look for it. Maybe in the rains it gets filled up, and there is enough to last the cattle some time. Everything depends on that.\" \"I have been thinking,\" Hugh said, \"that if I were to ride straight on I might get through to the next ranche. My horse is a first-rate one, and I am sure he could do the distance.\" \"If he had started after a couple of days\u0027 rest he could carry you a hundred miles, I don\u0027t doubt. There ain\u0027t nothing out of the way in that. I have ridden as much a score of times; but you see, lad, he has not had much rest and not much time to eat since we started. You rode him out from your camp and then on to the first halting place; that made eighty or ninety mile. Next day we made sixty, I reckon. Then he was going all yesterday till we halted before we went up through the pass, and he kept on going till a good bit past midnight. We may not have done more than fifty or sixty mile, but he got no feeding till we got into that dip about two o\u0027clock this morning. \"If you only had the horses after you that the Indians rode down to Gainsford I should say your horse would carry you as well as theirs would; but it won\u0027t be so. You bet your life, that mob we saw outside the village was a fresh one. The fust thing they would do when they got to camp in the afternoon would be to send some of the lads off to the grazing grounds with the horses they had ridden, and to fetch in a fresh lot. Besides that, as I told you, there will be others of the tribe coming up and jining in the chase. Scores of them. They will all be on fresh mounts, and they will be just on the best ponies they have got, for they will guess that we are heading [236] for the Canadian. No, no, lad; it\u0027ll never do. They would ride you down sartin. \"Another thing is, whoever goes has got to know every foot of the country, to travel at night, and to be able to find his way to the nearest ranche. That job will be mine, I reckon. I know more of the Injun ways than anyone here, and if anyone can do the job I can. Besides, it is my place. You have all gone into this affair to get my Rosie out of the hands of the Red-skins, and it is my duty to get you out of the scrape. Listen!\" The whole party checked their horses simultaneously as the air brought to their ears a long, quavering yell, and looking back they saw against the distant sky-line a confused body of horsemen. \"Two miles good, ain\u0027t it, Broncho?\" \"About that, I should say, Steve; and we have got twelve to ride. Now, then, let the ponies know they have got to do some work.\" The shouts of the riders, the tightening of the reins, and a touch of the spur told the horses what was required of them, and they sped along at a very different pace to that at which they had hitherto travelled. \"We are all right, I think,\" Long Tom said to Hugh. \"They have been riding a good deal faster than we have, and I don\u0027t think they will gain on us now—not anything to speak of. We shall be at the buttes long before they catch us, though you see when one party is chasing another they have got a great advantage.\" \"How do you mean, Tom? I don\u0027t see what advantage they have.\" \"They have this advantage, Lightning. All horses ain\u0027t the same. Some can go a lot faster than others. Some can keep on ever so much longer than others. There are some good and some bad.\" \"Of course there are, Tom, but that is the same with both parties.\" \"Sartin it is, lad, but you see the party that is chasing go at [237] the speed of their fastest horses; waal, not of their fastest, but the speed that the most of them can keep up. Those who are badly mounted drop in the rear and are left behind; the others don\u0027t consarn themselves about them. Now, it is just the contrairy with the party that is chased. They have got to go at the pace of the slowest horse among them. They can\u0027t leave one or two of their mates to the marcy of the Red-skins: they have got to keep together and to fight together, and, if must be, to die together. There is a lot of difference among the horses in this crowd. We just took what we could git when we started; thar wurn\u0027t no picking and choosing. Thar wur one apiece for us good or bad. The pace we are going ain\u0027t nothing to that horse of yours, but you\u0027ll soon see that some of the others can\u0027t keep it up, and then we shall have to slow down to their pace.\" \"I didn\u0027t think of that, Tom. Yes, I see, a party that pursues has an immense advantage over one that flies, providing, of course, they are greatly superior in numbers. If not, there will be a time when the best mounted men could no longer ride at full speed, because if they did they would be inferior in numbers to those they chased when they came up to them.\" \"That is reasonable, lad, and if those Red-skins behind us are only the lot from the village, that will bring them up a bit. They know well enough they can\u0027t lick us, if they ain\u0027t pretty nigh three to one, and so they will want their whole crowd up, and they won\u0027t be able to travel at the speed of their best horses. That is why I said that we shall beat them easy. It ain\u0027t really them, it is the bands from the other villages that we have got to fear. I don\u0027t know this kintry, and I don\u0027t know where the other villages are; but I shouldn\u0027t be surprised any moment to see bands cutting in from the right or left. Some of the Injuns would ride straight off there, and they will have heard the news as soon or sooner than the band that went after us to the rocks. They will guess the line we should take, and will all be on fresh horses. That is what I am thinking of all the time.\" [238] \"I suppose Steve knows?\" Hugh said. \"He knows. He ain\u0027t said much, but he dropt behind an hour ago, and said to me, \u0027Keep a sharp look-out on both sides, Tom; that is where the danger comes in.\u0027\" For the next five miles the pursuers did not appear to gain. \"Can\u0027t we take it easy, Steve?\" Jim Gattling asked. \"Some of the horses are beginning to blow a bit. There ain\u0027t more than seven miles now between us and the buttes. We might let them walk for five minutes now to get their wind again.\" Steve turned in his saddle and looked round at the horses. Wiry little animals as they were, many of them were showing signs of distress. \"We will go a little bit easier,\" he said, \"just a little. When we get to that brow a mile ahead we shall get a better view. Then we will see about it.\" The horses were pulled in a little, but still kept at a gallop until they got to the top of the ascent. From this point there was a smooth and regular fall right down to the valley from which rose the buttes six miles away. \"Now you have got to ride for it, and no mistake,\" Steve said sharply. \"There they come both ways. That is just what I was afeard of.\" An exclamation of something like dismay broke from many of the men, for two bands of Indians were seen, one on each hand, riding, like themselves, for the buttes. The one to the left was perhaps a mile away, but considerably in advance of them. That on the right was perhaps twice as far, and was, like themselves, just beginning to descend the long incline. \"We shall pass the crowd to the right,\" Broncho Harry said, \"but the others will cut us off, sure.\" \"That is so, Harry,\" Steve said quietly. \"But there is one thing, there ain\u0027t above forty or fifty of them, while that crowd to the right are twice as strong. If they had been first, it would have been all over with us. Well, don\u0027t travel too fast, lads. We can\u0027t pass ahead of that lot to the left, but there is no fear of the crowd to the right. Just go at the pace we are [239] going now. Look here, what has got to be done is this: we have got to keep together with the women in the middle of us. We have got to go right through them. Now nine of you have got rifles, you keep next to the gals. The moment we have got through the Injuns, you ride with them straight on to the foot of the butte. I must go with you, because I know just where the path starts, and no one else does. The moment you get there you jump off the ponies, take post among the rocks, and open fire on the Injuns. You, Broncho, with the rest of them, directly we are through, you turn again and charge them. Just check them for about a minute, that will be enough; then you ride in and we will cover you with our rifles.\" \"That is about it,\" Harry replied. \"Now, boys, you all hear. You with the rifles go straight on. And look here, empty your six-shooters into them as you charge—the more you wipe out the better. Then the rest of you with me just give a yell to scare them, and then close with them again. Don\u0027t you empty your six-shooters at first, but keep your fire till we are through them; it is mighty hard if the others, with six shots apiece, don\u0027t clear the way for us. You must bear in mind that you will want every shot after we are through, so don\u0027t throw away one. Don\u0027t you bother about the advance crowd with the women. I will keep my eye on them, and when I see they are ready I will give a yell, and then we will ride for it together.\" The Indians saw that they had it in their power to cut off the whites from the buttes, and they no longer rode at the headlong speed at which they were going when first perceived, but slackened down their pace. They could, if they had chosen, have brought on the fight at some distance from the buttes, but they had no motive for doing so. They saw the large party coming from the other side, and preferred to delay the contest till the last moment in order that their friends should be near at hand. Steve remarked with satisfaction that they did not attempt to outride his party. \"The fools,\" he said to Broncho Harry, \"they won\u0027t be there [240] above a hundred yards before us, and won\u0027t get above one shot each before we are on them. If they had known their business they would have ridden fit to kill their horses till they got there, and then jumped off and run up that path and held it. We should have lost half our number at least fighting our way up. In fact, with the women with us, we couldn\u0027t have done it.\" Scarce another word was spoken as the party galloped on. Mile after mile had been passed, and the buttes were now towering up in front of them. When within half a mile of the foot the riders gradually fell in to the places assigned to them. Those with rifles went in front, then the women, then the men with revolvers only. The small party of Indians kept on until within a hundred and fifty yards of the foot of the buttes, then they halted and turned. The whites were at the moment some two hundred yards behind them. The great party of Indians on the right were about half a mile away. The Indians in front did not await the shock of the whites, knowing that the impetus of the latter would give them an advantage, but raising their war-cry dashed forward to meet them, discharging their rifles as they came. Not a shot was fired by the whites until the two lines were within twenty paces of each other, then the revolvers of the ten men in front cracked out sharply. Several of the Indians fell. Then there was a crash as the lines met, and then for a moment a confused medley—the Indians fighting with tomahawk and spear, the whites with their deadly revolvers. The conditions were too unequal. There was not one among the band of whites who could not rely with certainty upon his aim, and as in a close line, boot touching boot, they pressed on, the Indians melted like snow before them. It seemed to Hugh but a moment from the time the fight began till the path before them to the buttes was open. \"Forward!\" shouted Steve. \"We are through them, boys.\" As Hugh dashed on he heard Broncho Harry\u0027s shout, the cracking of the revolvers, and the yell of the Indians. The women were riding abreast with them now. [241] \"Never mind the gals,\" Steve shouted. \"All tumble off together.\" It was but a few seconds before the first band threw themselves from their horses and took up their post behind boulders and bushes. As they dismounted Steve gave a loud shout, and almost at the same moment the party that had fought under the leadership of Broncho Harry wheeled round and rode towards them. Had there been only the Indians that had tried to bar their way to reckon with, there would have been no need for them to seek refuge at the buttes. Half their number had fallen under the bullets of the front line of the whites as they fell upon them. The charge of Broncho Harry\u0027s detachment had completed the effect of the blow. The whole conflict had only lasted half a minute, but in that time the deadly six-shooters had wrought terrible havoc with the band of Indians. Less than half of them went galloping back to meet their advancing friends, and several of these were leaning over their saddles evidently badly wounded. Over twenty lay together at the spot where the two parties had met. A few of the horses stood quietly beside their dead owners, the rest were careering wildly over the plain. A loud cheer broke from both parties of the whites as Broncho Harry\u0027s band rode in and dismounted. \"That has been a pretty tight race,\" Long Tom said, \"but we beat them handsome.\" \"Tom, do you all stow away your horses and ours as snug as you can among the rocks and trees, then take your places down here. We will get a bit higher up so as to get a wider range for our rifles, but we haven\u0027t time for that now, we must just give this other crowd a hint that we have got rifles and can use them. Now, boys, take steady aim at that clump of Red-skins. Don\u0027t throw away a shot. There is nothing like straight shooting for skeering a Red. Here goes;\" and Steve, taking a steady aim, fired, while his companions followed his example. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3127/85993.html","bookId":897,"book":{"id":897,"title":"Redskin and Cow-Boy","description":"简介： Cedar Gulch was, in 1851, a flourishing camp. There had been some good finds by the first prospectors, and a rush had of course followed. In many cases first discoveries proved illusive, but it was not so at Cedar Gulch. The ground turned out well, a...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3127","creation":"Aug 1, 2019 12:23:50 AM","modification":"Aug 1, 2019 12:23:50 AM"}}
