{"id":8072,"no":30,"title":"Chapter 28","content":"0400 Hours, August 30, 2552 (Military Calendar) /UNSCPillar of Autumn , in orbit around Epsilon Eridani System, Reach Military ComplexCortana never rested. Although based approximately on a human mind, AIs had no need to sleep ordream. Dr. Halsey had thought she could keep Cortana occupied by checking the systems of thePillar ofAutumn while she attended to her other secret projects. \n \n Her assumption was incorrect. \n \n While Cortana was intrigued with the unique design and workings of the ship—its preparation barelyoccupied a fraction of her processing power. \n \n She watched with thePillar of Autumn ’s camera as Captain Keyes approached the ship in a shuttle pod. \n \n Lieutenant Hikowa left to greet him in the docking bay. \n \n From C deck, Captain Keyes spoke over the intercom: “Cortana? Can we have power to move the ship? \n \n I’d like to get under way.” \n \n She calculated the remaining reactor burn-in time and made an adjustment to run it hotter. “The engines’ \n \n final shakedown is in theta cycle,” Cortana replied. “Operating well within normal parameters. Divertingthirty percent power to engines; aye, sir.” \n \n “And the other systems’ status?” Captain Keyes asked. \n \n “Weapons-system check initiated. Navigational nodes functioning. Continuing systemwide shakedownand triple checks, Captain.” \n \n “Very good,” he said. “Apprise me if there are any anomalies.” \n \n “Aye, Captain,” she replied. \n \n The COM channel snapped off. \n \n She continued her checks on thePillar of Autumn as ordered. There were, however, more importantthings to consider; namely, a little reconnaissance into ONI databases . . . and a little revenge. \n \n She dedicated the balance of her run time toward probing the SATCOM system around REACH forentry points. There. A ping in the satellite network coordination signal. She broadcast a resonant carrierwave at that signal and piggybacked into the system. \n \n First things first. She had two loose ends to take care of. \n \n While she and the Master Chief had been on the obstacle course, she had commandeered SATCOMobservation beacon 419 and rotated it to view them from orbit. \n \n She reentered the back door she had left open in the system, and rewrote the satellite’s guidance thrustersubroutine. If the system was analyzed later, it would be determined that this error had altered it to arandom orientation rather than a planned position. \n \n She withdrew, but left her back door intact. This trick might come in handy again. \n \n The other loose end that required her attentions was Colonel Ackerson—the man who had tried to eraseher and the Master Chief. \n \n Cortana reread Dr. Halsey’s recommended test specifications for the MJOLNIR system on the obstaclecourse. She had suggested live rounds, yes. But never a squad of Orbital drop Shock Troopers, chainguns,Lotus mines . . . and certainly not an air strike. \n \n That was the Colonel’s doing. He was an equation that needed to be balanced. What Dr. Halsey mighthave called “payback.” \n \n She linked to the UNSC personnel and planning database on Reach. The ONI AI there, Beowulf, knewher . . . and knew not to let her in. Beowulf was thorough, methodical, and paranoid; in her own way,Cortana couldn’t help but like him. But compared with her code-cracking skills, he might as well havebeen an accounting program. \n \n Cortana sent a rapid series of queries into the network node that processed housing transfer requests. Anormally quiet node—she overloaded it with a billion different pings per minute. \n \n The network attempted to recover and reconfigure, causing all nodes to lag, including node seventeen—personnel records. She stepped in and inserted a spike wedge, a subroutine that looked like a normalincoming signal, but bounced any handshake protocol. \n \n She slipped in. \n \n The Colonel’s CSV was impressive. He had survived three battles with the Covenant. Early in the war,he received a promotion and volunteered for a dozen black ops. For the last few years, however, hisefforts had focused on political maneuvers rather than battlefield tactics. He had filed several requestsfor increased funding for his Special Warfare projects. \n \n No wonder he wanted the Master Chief gone. The Spartan IIs and MJOLNIR were his directcompetition. Worse, they were succeeding where he failed. \n \n At best, Ackerson’s actions were treason. But Cortana wasn’t about to reveal all this to the ONIoversight committee. Despite the Colonel’s methods, the UNSC still needed him—and his SpecWarspecialists—in the war. \n \n Justice, however, would still be meted out. \n \n From the ONI database, she masqueraded as a routine credit check and entered the Colonel’s bankaccount—to which she wired a substantial amount to a brothel on Gilgamesh. She made sure the bankqueries sent to confirm the transaction were copied to his home immediately. Colonel Ackerson was amarried man . . . and his wife should be there to receive them. \n \n She cut into his personal E-mail and sent a carefully crafted message—requesting reassignment to aforward area—to personnel. Finally, she inserted a “ghost” record, an electronic footprint that identifiedthe source of the alterations: Ackerson’s personal-computer pad. \n \n By the time Ackerson was done untangling all of that, he’d be reassigned to field duty . . . and get backto fighting the Covenant where he belonged. \n \n With all loose ends neatly tied up, Cortana rechecked thePillar of Autumn ’s reactor; the shakedown wasproceeding nicely. She tweaked the magnetic-field strength, and part of her watched the output from theengines for fluctuations. She inspected all weapons systems three times, and then went back to her ownpersonal research. \n \n She considered how well the Master Chief had performed this morning on the obstacle course. He wasmore than Cortana could have hoped for. The Master Chief was much more than Dr. Halsey or the pressreleases had indicated. \n \n He was intelligent . . . not fearless, but as close to it as any human she had encountered. His reactiontime under stress was one-sixth the standard human norm. More than that, however, Cortana had sensedthat he had a certain—she searched her lexicon for the proper word—nobility. He placed his mission andhis duty and honor above his personal safety. \n \n She reexamined his Career Service Vitae. He had fought in 207 ground engagements against theCovenant, and been awarded every major service medal except the Prisoner of War Medallion. \n \n There were holes in his CSV, though. The standard black-out sections courtesy of ONI, of course . . . butmost curious, all data before he entered active duty had been expunged. \n \n Cortana wasn’t about to let a mere erasure stop her. She traced where the order to erase that data hadoriginated. Section Three. Dr. Halsey’s group. Curious. \n \n She followed the order pathway—crashed into layers of counter code. The code started a trace on hersignal. \n \n She blocked it—and it restarted a trace of the origin of her block. \n \n This was a very well-crafted piece of counterintrusion software, far superior to the normal ONIslugcode. If nothing else, Cortana liked a challenge. She withdrew from the database and looked for anunguarded way into ONI Section Three files. \n \n Cortana listened to the hum of coded traffic along the surface of ONI’s secure network. There was anunusual amount of packets today: queries and encrypted messages from ONI operatives. She peered intothem and unraveled their secrets as they passed her. There were orders for ship movements andoperatives outbound from Reach. This must be the new directive to send scouts into the peripherysystems and find the Covenant. She saw several ships docked in Reach’s space docks—ONI stealth jobsmade to look like private yachts. They had cute, innocuous names: theApplebee ,Circumference , andtheLark . \n \n She spotted something she could use: Dr. Halsey had just entered her laboratory. She was at checkpointthree. The doctor waited as her voice and retina patterns were being scanned. \n \n Cortana intercepted and killed the signal. The verification system reset. \n \n “Please rescan retina, Dr. Halsey,” the system requested, “and repeat today’s code phrase in a normalvoice.” \n \n Before Dr. Halsey could do this, Cortana sent her own files of Dr. Halsey’s retina and voice scans. Shehad long ago copied them and occasionally they came in handy. \n \n Section Three verification opened for Cortana. She had only a second before the doctor spoke andoverrode the previous entry access. \n \n Cortana, however, was a lightning strike in the system. She entered, searched, and found what shewanted. Every piece of data on SPARTAN 117 was copied to her personal directory within seventymilliseconds. \n \n She withdrew from the ONI database, routing all traces of her queries back to her Ackerson “ghost.” \n \n She closed all connections and returned to thePillar of Autumn . One quick check of the reactor—yes,operating within normal parameters—and she sent a complete report to Lieutenant Hall on the bridge. \n \n Cortana examined the Master Chief’scomplete CSV. She scanned backward through time: hisperformance data on the obstacle course, and the debriefing he had given at ONI headquarters. \n \n She paused and pondered the signal the Covenant had sent from Sigma Octanus IV. Intrigued, she triedto translate the sequence. The symbols looked tantalizingly familiar. Every algorithm and variation ofthe standard translation software she attempted, however, failed. Puzzled, she set it aside to examinelater. \n \n She continued, absorbing the data from the Master Chief’s files. She learned of the augmentations heand the other Spartans were made to endure; the brutal indoctrination and training they had received;and how he had been abducted at the age of six, and a flash clone used to replace him in an ONI blackop. \n \n All of it had been authorized by Dr. Halsey. \n \n Cortana paused for a full three processor cycles churning this new data through her ethicssubroutines . . . not comprehending. How could Dr. Halsey, who was so concerned for her Spartans,have done this to them? \n \n Of course—because it was necessary. There was no other way to preserve the UNSC against rebellionand Covenant forces. \n \n Was Dr. Halsey a monster? Or just doing what had to be done to protect humanity? Perhaps a little ofboth. \n \n Cortana erased her stolen files. No matter. Whatever the Master Chief had been through in the past . . . itwas done. He was in Cortana’s care now. She would do everything in her power—short ofcompromising their mission—to make sure nothing ever happened to him again. \n \n \n","sourceLink":"http://novel.tingroom.com/kehuan/975/29441.html","bookId":266,"book":{"id":266,"title":"Halo Series 光晕：致远星的沦陷","description":"简介： 人类进入宇宙殖民时代后，与强大而好战的圣约人遭遇，圣约人宣称人类亵渎了他们的信仰，对人类发动了全面战争。很早以前，人类就在进行一个绝密军事计划斯巴达II。...","cover":"https://cunovel.com/defaultCover.png","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/975","creation":"Aug 1, 2019 12:18:29 AM","modification":"Aug 1, 2019 12:18:29 AM"}}
