{"id":63310,"no":1,"title":"Page 1","content":"For Helen and Mackenzie, two of the sweetest Southern ladies I know. Prologue Claymorgan, England Spring 1199 Her passage through the woods set the leaves atremble. Her childish laughter rang through the trees and the wind blew her hair out behind her in a golden stream. The sun covered her with kisses and the rain-damp earth squelched up between her toes, embracing her with each step. Willa loved to run barefoot after a rain. However, if Eada or Papa found out about this, she knew there would be trouble. It was worth the risk. She broke into a clearing and abruptly paused. Her laughter faded at once, the happiness slipping from her face. Something was wrong. It was so silent. Too silent. The birds had stopped singing and were motionless in the trees. Even the bugs had stopped buzzing. And she couldn\u0027t hear Luvena running in front of her anymore. Her brow creased with worry as she peered slowly around the clearing. \"Luv?\" she whispered, taking a tentative step forward. \"Luv?\" A quiet rustle drew her head around. Something dropped from the small cliff near where she had entered the clearing. Cloth - golden as the sunlight - fluttered through the air like a chick tumbling from its nest. The bundle landed with an ominous thud. Willa swallowed nervously. Her gaze slid slowly over the bright pile of gilded material on the ground. It was the gown Lord Sedgewick had brought back from London for her. The one Luvena had been so eager to wear. Then she spied the small, motionless legs, in their fine new hose, peeking out from beneath the skirts. One of the soft slippers was missing. A hand lay half-curled in supplication amidst the material of the gown. Shiny red-gold tresses lay limp in the grass. Luvena\u0027s pale face was turned away, her head at an odd angle. These images assaulted Willa one after the other like the threads of a tapestry that had yet to be created. By the time her brain had woven them together and understood their meaning, she had been screaming for several moments.","sourceLink":"https://allnovel.net/what-she-wants/page-1.html","bookId":2652,"book":{"id":2652,"title":"What She Wants","description":"Storyline: A formidable Scottish knight used to getting his way, Earl Hugh Dulonget of Hillcrest has gotten himself into a bind. His uncle\u0027s will clearly states that Hugh must marry— yet he has just insulted his would-be bride by calling her a peasant! Now he must do whatever it takes to win back the fair Willa . . . Everyone has advice, it seems. His comrades-in-arms believe gifts and baubles will earn her love. The old witch who was her guardian wants Hugh to crawl back to Willa on his belly. And his castle priest suggests he read De Secretis Mulierum, a book on the secrets of women. But Hugh knows only one sure way to overcome her reluctance: he must convince Willa that his passion and devotion are not only what she needs, but what she wants more than anything else in the world.","cover":"https://allnovel.net/images/what-she-wants.jpg","author":"Lynsay Sands","type":"Historical","source":"allnovel","link":"https://allnovel.net/what-she-wants.html","creation":"Oct 5, 2019 8:59:00 AM","modification":"Oct 5, 2019 9:50:17 AM"}}
