{"id":10581,"no":3,"title":"CHAPTER III. BEGINNING AT HOME.","content":"“Charity creates much of the misery it relieves, but it does not relieve all the misery it creates.” Charity, as all the world knows, should begin at an “at home.” Lord Ferriby knew as well as any that there are men, and perhaps even women, who will give largely in order that their names may appear largely and handsomely in the select subscription lists. He also knew that an invitation card in the present is as sure a bait as the promise of bliss hereafter. So Lady Ferriby announced by card (in an open envelope with a halfpenny stamp) that she should be “at home” to certain persons on a certain evening. And the good and the great flocked to Cambridge Terrace. The good and great are, one finds, a little mixed, from a social point of view. There were present at Lady Ferriby\u0027s, for instance, a number of ministers, some cabinet, others dissenting. Here, a man leaning against the wall wore a blue ribbon across his shirt front. There, another, looking bigger and more self-confident, had no shirt front at all. His was the cheap distinction of unsuitable clothes. “Ha! Miss Ferriby, glad to see you,” he said as he entered, holding out a hand which had the usual outward signs of industrial honesty. Joan shook the hand frankly, and its possessor passed on. “Is that the gas-man?” inquired Major White, gravely. He had been standing beside her ever since his arrival, seeking, it seemed, the protection of one who understood these social functions. It is to be presumed that the major was less bewildered than he looked. “Hush!” And Joan said something hurriedly in White\u0027s large ear. “Everybody has him,” she concluded; and the explanation brought certain calm into the mildly surprised eye behind the eye-glass. White recognized the phrase and its conclusive contemporary weight. “Here\u0027s a flat-backed man!” he exclaimed, with a ring of relief. “Been drilled, this man. Gad! He\u0027s proud!” added the major, as the new-comer passed Joan with rather a cold bow. “Oh, that\u0027s the detective,” explained Joan. “So many people, you know; and so mixed. Everybody has them. Here\u0027s Tony—at last.” Tony Cornish was indeed making his way through the crowd towards them. He shook hands with a bishop as he elbowed a path across the room, and did it with the pious face of a self-respecting curate. The next minute he was prodding a sporting baronet in the ribs at the precise moment when that nobleman reached the point of his little story and on the precise rib where he expected to be prodded. It is always wise to do the expected. At the sight of Tony Cornish, Joan\u0027s face became grave, and she turned towards him with her little frown of preoccupation, such as one might expect to find upon the face of a woman concerned in the great movements of the day. But before Tony reached her the expression changed to a very feminine and even old-fashioned one of annoyance. “Oh, here comes mother!” she said, looking beyond Cornish, who was indeed being pursued by a wizened little old lady. Lady Ferriby, it seemed, was not enjoying herself. She glanced suspiciously from one face to another, as if she was seeking a friend without any great hope of finding one. Perhaps, like many another, she looked upon the world from that point Of view. Cornish hurried up and shook hands. “Plenty of people,” he said. “Oh yes,” answered Joan, earnestly. “It only shows that there is, after all, a great deal of good in human nature, that in such a movement as this rich and poor, great and small, are all equal.” Cornish nodded in his quick sympathetic way, accepting as we all accept the social statements of the day, which are oft repeated and never weighed. Then he turned to White and tapped that soldier\u0027s arm emphatically. “Way to get on nowadays,” he said, “is to be prominent in some great movement for benefiting mankind.” Joan heard the words, and, turning, looked at Cornish with a momentary doubt. “And I mean to get on in the world, my dear Joan,” he said, with a gravity which quite altered his keen, fair face. It passed off instantly, as if swept away by the ready smile which came again. A close observer might have begun to wonder under which mask lay the real Tony Cornish. Major White looked stolidly at his friend. His face, on the contrary never changed. Lady Ferriby joined them at this moment—a silent, querulous-looking woman in black silk and priceless lace, who, despite her white hair and wrinkled face, yet wore her clothes with that carefulness which commands respect from high and low alike. The world was afraid of Lady Ferriby, and had little to say to her. It turned aside, as a rule, when she approached. And when she had passed on with her suspicious glance, her bent and shaking head, it whispered that there walked a woman with a romantic past. It is, moreover, to be hoped that the younger portion of Lady Ferriby\u0027s world took heed of this catlike, lonely woman, and recognized the melancholy fact that it is unwise to form a romantic attachment in the days of one\u0027s youth. “Tony,” said her ladyship, “they have eaten all the sandwiches.” And there was something in her voice, in her manner of touching Tony Cornish\u0027s arm with her fan that suggested in a far-off, cold way that this social butterfly had reached one of the still strings of her heart. Who knows? There may have been, in those dim days when Lady Ferriby had played her part in the romantic story which all hinted at and none knew, another such as Tony Cornish—gay and debonair, careless, reckless, and yet endowed with the power of making some poor woman happy. “My dear aunt,” replied Cornish, with a levity with which none other ever dared to treat her, “the benevolent are always greedy. And each additional virtue—temperance, loving-kindness, humility—only serves to dull the sense of humour and add to the appetite. Give them biscuits, aunt.” And offering her his arm, he good-naturedly led her to the refreshment-room to investigate the matter. As she passed through the crowded rooms, she glanced from face to face with her quick, seeking look. She cordially disliked all these people. And their principal crime was that they ate and drank. For Lady Ferriby was a miser. At the upper end of the room a low platform served as a safe retreat for sleepy chaperons on such occasions as the annual Ferriby ball. To-night there were no chaperons. Is not charity the safest as well as the most lenient of these? And does her wing not cover a multitude of indiscretions? Upon this platform there now appeared, amid palms and chrysanthemums, a long, rotund man like a bolster. He held a paper in his hand and wore a platform smile. His attitude was that of one who hesitated to demand silence from so well-bred a throng. His high, narrow forehead shone in the light of the candelabra. This was Lord Ferriby—a man whose best friend did his best for him in describing him as well-meaning. He gave a cough which had sufficient significance in it to command a momentary quiet. During the silence, a well-dressed parson stood on tiptoe and whispered something in Lord Ferriby\u0027s ear. The suggestion, whatever it may have been, was negated by the speaker on receipt of a warning shake of the head from Joan. “Er—ladies and gentlemen,” said Lord Ferriby, and gained the necessary silence. “Er—you all know the purpose of our meeting here to-night. You all know that Lady Ferriby and myself are much honoured by your presence here. And—er—I am sure——” He did not, however, appear to be quite sure, for he consulted his paper, and the colonial bishop near the yellow chrysanthemums said, “Hear, hear!” “And I am sure that we are, one and all, actuated by a burning desire to relieve the terrible distress which has been going on unknown to us in our very midst.” “He has missed out half a page,” said Joan to Major White, who somehow found himself at her side again. “This is no place, and we have at the moment no time, to go into the details of the manufacture of malgamite. Suffice it to say, that such a—er—composition exists, and that it is a necessity in the manufacture of paper. Now, ladies and gentlemen, the painful fact has been brought to light by my friend Mr. Roden——” His lordship paused, and looked round with a half-fledged bow, but failed to find Roden. “By—er—Mr. Roden that the manufacture of malgamite is one of the deadliest of industries. In fact, the makers of malgamite, and fortunately they are comparatively few in number, stricken as they are by a corroding disease, occupy in our midst the—er—place of the lepers of the Bible.” Here Lord Ferriby bowed affably to the bishop, as if to say, “And that is where you come in.” “We—er—live in an age,” went on Lord Ferriby—and the practical Joan nodded her head to indicate that he was on the right track now—“when charity is no longer a matter of sentiment, but rather a very practical and forcible power in the world. We do not ask your assistance in a vague and visionary crusade against suffering. We ask you to help us in the development of a definite scheme for the amelioration of the condition of our fellow-beings.” Lord Ferriby spoke not with the ease of long practice, but with the assurance of one accustomed to being heard with patience. He now waited for the applause to die away. “Who put him up to it?” Major White asked Joan. “Mr. Roden wrote the speech, and I taught it to papa,” was the answer. At this moment Cornish hurried up in his busy way. Indeed, these people seemed to have little time on their hands. They belonged to a generation which is much addicted to unnecessary haste. “Seen Roden?” he asked, addressing his question to Joan and her companion jointly. “Never in my life,” answered Major White. “Is he worth seeing?” But Cornish hurried away again. Lord Ferriby was still speaking, but he seemed to have lost the ear of his audience, and had lapsed into generalities. A few who were near the platform listened attentively enough. Some who hoped that they were to be asked to speak applauded hurriedly and finally whenever the speaker paused to take breath. The world is full of people who will not give their money, but offer readily enough what they call their “time” to a good cause. Lord Ferriby was lavish with his “time,” and liked to pass it in hearing the sound of his own voice. Every social circle has its talkers, who hang upon each other\u0027s periods in expectance of the moment when they can successfully push in their own word. Lord Ferriby, looking round upon faces well known to him, saw half a dozen men who spoke upon all occasions with a sublime indifference to the fact that they knew nothing of the subject in hand. With the least encouragement any one of them would have stepped on to the platform bubbling over with eloquence. Lord Ferriby was quite clever enough to perceive the danger. He must go on talking until Roden was found. Had not the pushing parson already intimated in a whisper that he had a few earnest thoughts in his mind which he would be glad to get off? Lord Ferriby knew those earnest thoughts, and their inevitable tendency to send the audience to the refreshment-room, where, as Lady Ferriby\u0027s husband, he suspected poverty in the land. “Is not Mr. Cornish going to speak?” a young lady eagerly inquired of Joan. She was a young lady who wore spectacles and scorned a fringe—a dangerous course of conduct for any young woman to follow. But she made up for natural and physical deficiencies by an excess of that zeal which Talleyrand deplored. “I think not,” answered Joan. “He never speaks in public, you know.” “I wonder why?” said the young lady, sharply and rather angrily. Joan shrugged her shoulders and laughed. She sometimes wondered why herself, but Tony had never satisfied her curiosity. The young lady moved away and talked to others of the same matter. There were quite a number of people in the room who wanted to know why Tony Cornish did not speak, and wished he would. The way to rule the world is to make it want something, and keep it wanting. “I make so bold as to hope,” Lord Ferriby was saying, “that when sufficient publicity has been given to our scheme we shall be able to raise the necessary funds. In the fulness of this hope, I have ventured to jot down the names of certain gentlemen who have been kind enough to assume the trusteeship. I propose, therefore, that the trustees of the Malgamite Fund shall be—er—myself——” Like a practiced speaker, Lord Ferriby paused for the applause which duly followed. And certain elderly gentlemen, who had been young when Marmaduke Ferriby was young, looked with much interest at the pictures on the wall. That Lord Ferriby should assume the directorship of a great charity was to send that charity on its way rejoicing. He stood smiling benevolently and condescendingly down upon the faces turned towards him, and rejoiced inwardly over these glorious obsequies of a wild and deplorable past. “Mr. Anthony Cornish,” he read out, and applause made itself heard again. “Major White.” And the listeners turned round and stared at that hero, whom they discovered calmly and stolidly entrenched behind the eye-glass, his broad, tanned face surmounting a shirt front of abnormal width. “Herr von Holzen.” No one seemed to know Herr von Holzen, or to care much whether he existed or not. “And—my—er—friend—the originator of this great scheme—the man whom we all look up to as the benefactor of a most miserable class of men—Mr. Percy Roden.” Lord Ferriby meant the listeners to applaud, and they did so, although they had never heard the name before. He folded the paper held in his hand, and indicated by his manner that he had for the moment nothing more to say. From his point of advantage he scanned the whole length of the large room, evidently seeking some one. Anthony Cornish had been the second name mentioned, and the majority hoped that it was he who was to speak next. They anticipated that he, at all events, would be lively, and in addition to this recommendation there hovered round his name that mysterious charm which is in itself a subtle form of notoriety. People said of Tony Cornish that he would get on in the world; and upon this slender ladder he had attained social success. But Cornish was not in the room, and after waiting a few moments, Lord Ferriby came down from the platform, and joined some of the groups of persons in the large room. For already the audience was breaking up into small parties, and the majority, it is to be feared, were by now talking of other matters. In these days we cannot afford to give sufficient time to any one object to do that object or ourselves any lasting good. Presently there was a stir at the door, and Cornish entered the large room, followed leisurely by a tired-looking man, for whom the idlers near the doorway seemed instinctively to make way. This man was tall, square-shouldered, and loose of limb. He had smooth dark hair, and carried his head thrown rather back from the neck. His eyes were dark, and the fact that a considerable line of white was visible beneath the pupil imparted to his whole being an air of physical delicacy suggestive of a constant feeling of fatigue. “Who is this?” asked Major White, aroused to a sense of stolid curiosity which few of his fellow-men had the power of awakening. “Oh, that,” said Joan, looking towards the door—“that is Mr. Percy Roden.”","sourceLink":"http://novel.tingroom.com/duanpian/2873/79481.html","bookId":1165,"book":{"id":1165,"title":"Roden\u0027s Corner","description":"简介： It is the Professor von Holzen, said a stout woman who still keeps the egg and butter shop at the corner of St. Jacob Straat in The Hague; she is a Jewess, as, indeed, are most of the denizens of St. Jacob Straat and its neighbour, Bezem Straat, wher...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2873","creation":"Aug 1, 2019 12:24:30 AM","modification":"Aug 1, 2019 12:24:30 AM"}}
