{"id":72100,"no":11,"title":"Page 11","content":"The place is crammed with people taking shots and sipping beers. There’s a cloud of smoke from a very packed smoking section near the sliding glass door and the sexual tension from the dance floor is like poison in the air. Some of the things they’re doing are making my cheeks heat with excessive blood flow.\\n\\n My body tenses as Alex’s breath touches my ear and his hand grazes the small of my back. “Relax, I promised you’d be okay and I never break a promise. Remember?”\\n\\n My shoulder jolts upward from the nearness of him as I nod. “I’d be a little bit more comfortable if I knew why we’re here.”\\n\\n He leans over my shoulder and I tilt my head to the side to meet his eyes. My depth perception is off and I almost end up kissing him. “I just have to pick something up.” He threads his fingers through mine and pulls me toward the crowd.\\n\\n I can’t stop staring at our interlocked fingers, even as stray elbows and shoulders slam into my ribs and sides. No one’s ever held my hand. Ever. In fact, I’ve never even been hugged, that I know of.\\n\\n “Don’t drink anything offered to you,” Alex calls out over the music as a woman dressed in a short black dress whisks by us with a tray of green Jell-O shots.\\n\\n Nodding, I coordinate with his steps, staying as close to him as possible. As we approach a hallway my gaze falls on a woman dancing by herself in the corner. She has a margarita glass in her hand and is spilling her drink everywhere as she shimmies her hips to the music. As her head tips back, her hair moves and each strand forms a head. It looks like she has snakes in her hair; like she’s Medusa. My eyes widen as one of the snakes hisses in my direction and I gasp. Holy shit.\\n\\n “Gemma,” Alex’s voice rises over my thoughts as he squeezes my hand.\\n\\n I blink and her hair doesn\u0027t look like snakes anymore, but long, black locks of hair. I divert my concentration to Alex.\\n\\n He’s watching me inquisitively. “Are you okay?”\\n\\n I nod, suddenly aware that nothing can help me escape the hallucinations, nightmares and daydreams. They’re going to haunt me for the rest of my life. Or until I finally go off the deep end and get locked up.\\n\\n Alex’s eyes are locked on me as he backs the rest of the way to the hallway, leading me along with him and, again, I feel safe. I walk with him, step-by-step, maneuvering through the people effortlessly, and I’m temporarily put into a state of euphoria. He doesn’t look away until we reach the end and he opens a door, pulling me inside after him before shutting the door. It’s quiet. And mellow. And normal.\\n\\n “What exactly are they smoking out there?” I inquire as I examine the small room. There is a queen-size bed, covered with a black comforter, and the walls are red just like the lighting flowing from the ceiling and everywhere else in the house.\\n\\n Alex starts opening the drawers of one of the dressers and digging through them. “Who knows? Maybe Peyote.”\\n\\n I’m not sure if he’s being serious or not. “I thought I saw something weird.”\\n\\n His chin tips up and there’s an inquisitive look on his face. “Like what?”\\n\\n I shrug and my hands fall to my side and I sit down on the bed. The springs creak below my weight. “A woman with snakes for hair.”\\n\\n He lets out a soft laugh as he shuts the drawer. “Don’t worry. As long as you don’t see anyone with fangs, we’re fine. Or a guy with a snake tattoo on his neck. If you see someone with that, then we’d need to run.”\\n\\n Did he inhale some of the peyote? “Um… what?”\\n\\n He winks at me and dimples appear as he smiles. “Relax, he’s not supposed to be here, even though it’s his house.” He shucks off his coat before he places his hand on the wall.\\n\\n “What would happen if he was here?” I wonder as he runs his fingers along the wall.\\n\\n Drawing his elbow back, he raises his fist beside his head. “Then, he’d probably try to kill me.” With one swift swing, he hammers his hand through the wall. Sheetrock crumbles, breaking off and falling to the floor as I jump to my feet.\\n\\n “What are you doing?” I hiss. “You just punched a hole into someone’s wall!”\\n\\n He shakes his hand and dusts bits of debris off his knuckles. “Obviously.”\\n\\n I kick a large chunk of wall out of the way and step up beside him. “But, what about snake tattoo guy?”\\n\\n Standing on his toes, he snakes his arm into the hole. “I already told you he isn’t supposed to be here. Besides, he may try to kill me, but it doesn’t mean he can.” He draws his arm back and there’s something silver clutched in his hands.\\n\\n I move forward and lean over to get a better look. “What’s that?”\\n\\n He quickly stuffs it into his pocket. “It’s nothing you need to worry about.”\\n\\n I cross my arms and step back. “You drag me up to a party where people are smoking peyote and there’s a guy that may want to kill you. You punch a hole in the wall and take out something, but I shouldn’t worry about it?”\\n\\n He stares at me musingly. “I didn’t drag you out here. You came of your own freewill.”\\n\\n I open my mouth to argue, but he’s right. “Fine, you’re right. Can we go now?”\\n\\n His gaze never wavers from me. “Do you want to go? Or do you want to stay here a little longer… with me?”\\n\\n “I…” Why can’t I answer that question?\\n\\n His eyes flicker to the bed and then settle back on me. The starvation in his eyes both pulls me and pushes me away. I’m afraid, yet curious of what will happen and where the night will take me if I dare to do something out of the norm. “We could hang out here for a while.”\\n\\n “What about snake tattoo guy?” My voice squeaks and I clear my throat. “What if he shows up and tries to kick your ass?”\\n\\n “Again, he can try,” he says with a grin and reduces the already limited space between us. “But it doesn’t mean he can.”\\n\\n The defensive wall I’ve built around myself slowly crumbles. “Okay.”\\n\\n His eyebrows arch in surprise. “Okay? You want to stay?”\\n\\n I nod. “Yeah, I want to stay.”\\n\\n Again, he glances at that damn bed. What is he thinking? I sure as hell know what I’m thinking and it requires a lot of time on that bed. “I’m going to go get us something to drink.” He speaks slowly as he steps back. “Wait here.”\\n\\n “I thought you said not to drink anything offered to me?”\\n\\n His lips quirk as he opens the door. “That excludes me.” Before I can respond, he walks out and shuts the door.\\n\\n I collapse on the bed, letting out a breath I hadn’t realized I’ve been holding. What am I doing here with a guy I barely know? I have a feeling the night is only going to result in trouble, yet, I don’t seem to give a shit.\\n\\n I roll on my back and stare up at the cracks in the ceiling. I start counting each one as my nerves begin to short-circuit through my blood, taking each limb over and ultimately my heart. The prickle stabs at the back of my neck and I feel out of control and helpless, then I feel nothing. A numbing sensation takes me over and my body starts to sink into the mattress. Immobility consumes each nerve. I’m paralyzed and as the images form in front of my face, all I can do is watch as my spirit detaches from my body. I float away into the ceiling and, seconds later, darkness immerses me.\\n\\n When my feet touch the ground again, I’m standing in the middle of a field. The night sky is covered with stars and there are crickets chirping from the grass. The air smells like lilacs and the warm breeze caresses my cheeks. A feeling of peace has overtaken me and I stroll through the grass with no direct destination.\\n\\n If I had one wish in my life, I’d wish that I could stay and feel this way forever. Content and weightless with no worry or sorrow of the past. No confusion about life or how I feel. It’s right then that I realize just how lonely and discontent I am. How empty I feel even though I’m a bundle of emotions. I’ve never lived, never loved, never done anything.\\n\\n Moments later the feeling is stolen away with a gust of wind. I turn around and the tall grass hisses at my legs. In the distance of the land, two figures surface. One is tall and the other is very short. They are holding hands and step slowly as if they are savoring the moments of their journey.\\n\\n “We’re almost there,” the tall figure says. It’s one of the loveliest voices I\u0027ve ever heard from a woman; not too high or too low. She wears a dress and her long hair dances in the wind. I wonder what she looks like, but as she gets closer, I realize her face is obscured and distorted with a haze.\\n\\n The shorter figure’s face is also distorted, but I see that she has a skip to her walk, like she is happy to be here. “I’m so excited!”\\n\\n “I know you are, honey,” replies the woman, swaying her arms and giving the little girl a swing. “And you should be. There is a lot to be excited about right now.”\\n\\n I watch them with fascination. Who are they? Deep down it feels like I know the answer, but my mind can’t quite connect it together, like it’s missing a piece of the puzzle.\\n\\n I remain motionless in the field as they near me. I start to lift my hand to wave at them when they get close enough, but they walk by me as if I’m nonexistent, as if I’m a ghost. Maybe I’ve died back on the bed in the cabin and this is the afterlife?\\n\\n “Hello,” I call out, trailing after them.\\n\\n Neither of them flinches nor makes any move that tells me they heard me as they continue on with their conversation. I speed up and chase after them. They stop beside a large oak tree that stretches to the dark sky. The moonlight glimmers across their faces and the only details I can make out about them are that they have long hair and fair complexions.\\n\\n “Here we go. This spot is perfect.” The woman raises her hand to the sky and points at the stars. “See that one right there?”\\n\\n The little girl’s head tilts up. “Yeah, I see it, Mama.”\\n\\n “That one’s yours,” the mother tells her. “That spot right there.”\\n\\n “It belongs to you,” the mother continues, sadness filling her voice. I wonder if my own mother ever talked to me like this when I was a baby. Did she love me? Did she want to make me happy? I only had a year with her and I can’t remember a single aspect or detail, nothing.\\n\\n “For forever?” the girl asks, spinning in a circle with her arms out and her head tipped back as she basks in the moment.\\n\\n “I hope not,” she replies sadly and picks up the girl.\\n\\n The girl throws her arms around her mother and they hug each other as if nothing else in the world matters. It’s a feeling I will never understand. I shut my eyes, no longer able to bear something I wish I had, but know I never will. I may be able to feel now, but that doesn’t mean I can travel through the past and have moments like these with my mother. I know this. Somehow I know that my life will be short, that I’ll be very lonely, and that when it all ends, I’ll only have myself.\\n\\n Chapter 7\\n\\n When I open my eyes, I’m lying on my back on the bed at the cabin, no longer staring at the ceiling, but at Alex’s worried face above me. My arms rest lifelessly out to my side and, for a moment, I can’t move. When Alex places his hand on my cheek, the connection launches a zap to my heart and brings my body back to life. \\n\\n","sourceLink":"https://allnovel.net/shattered-promises-shattered-promises-1/page-11.html","bookId":1976,"book":{"id":1976,"title":"Shattered Promises (Shattered Promises #1)","description":"Storyline: Shattered Promises (Shattered Promises #1) \\n For twenty-one year-old Gemma, life has never been normal. She knows nothing about her past and has been haunted by the same monsters in her nightmares for the last few months. Unemotional and numb to life, she feels disconnected from everyone. Until the very first day she cries. After that, nothing in her life is the same. \\n Her emotions slowly surface and she starts experiencing love, happiness, and anger, feelings she never knew existed. But they leave her confused and she doesn’t know whether to embrace them or run away from them. \\n Her life only gets more complicated when she meets Alex. Sexy, arrogant, and secretive, Alex can get under Gemma’s skin like no one can. Yet she’s drawn to him by an invisible connection she has no control over. She’s also seen him before. In her nightmares. \\n Every part of Gemma’s mind is screaming at her to stay away from Alex, but every other part of her is begging to get close to him. But the closer she gets, the more she realizes Alex knows more about her than he originally let on. \\n As secrets about her past unravel, Gemma’s life becomes threatened. She needs to figure out what’s going on, before she winds up dead. But the only person she can turn to for answers is the one person she isn’t sure she can trust.\\n","cover":"https://allnovel.net/images/shattered-promises-shattered-promises-1.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/shattered-promises-shattered-promises-1.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:22:30 AM"}}
