{"id":72106,"no":17,"title":"Page 17","content":"His eyes scan me from head to toe and my skin electrifies like magic. Like witch magic. “What are you talking about? What kind of trouble? Did something happen that I don’t know about.”\n “How would you know about anything?” I inquire with suspicion. “I haven’t told you anything.”\n He situates a hand on my cheek and I shiver from the sparkling it causes inside me. “I know more than you think.”\n I freeze as the electricity sings through my veins and crashes into my heart. My lungs swell from the pressure and the position of the glass alters. The pain causes me to moan, but the tingling sensation in my lower abdomen causes me to gasp. It’s the strangest noise that has ever passed my lips.\n Alex must have thought so, too, because his eyes enlarge. “Are you okay?”\n I slant my head back from his hand. “I’m fine. I’m just shocked because you can feel it too.”\n “Of course I can feel it.” He sighs back in the chair. “How can I not?” He trails off, his voice softening. “But, I’m not supposed to… I’m breaking so many Goddamn rules.”\n “What rules?” I probe. “You know, you speak in riddles sometimes.”\n He rakes his fingers roughly through his hair and pieces stick up in every direction. I have the urge to put them back in place, but the pained expression on his face warns me that it’s best not to touch him. I tuck my hands underneath my legs to keep them restrained. “How the hell am I supposed to explain to you how important you are? It’s fucking impossible.” He stares at his scraped up hands, turning them over as he examines them.\n “How important I am?” I scan the room, even though it’s obvious he’s talking to me, and aim an incredulous look at him. “I think you’re getting me mixed up with someone else because, trust me, there’s nothing important about me.”\n “You have no idea how wrong you are.” He sucks in a slow breath and then raises his chin up to look at me. The intensity in his eyes makes me shrink back. “You’re the most im—”\n “I found one.” Aislin races into the room with a proud look on her face. She’s carrying a first-aid kit and her hair has been pulled back into a bun. She’s also taken off her coat and boots.\n Alex instantly springs to his feet like he’s guilty of some heinous crime. “It took you long enough. Jesus, what the hell were you doing?” He joins her in the middle of the room, frowning. “You seriously cleaned up? God, Gemma’s bleeding out here and you go wash up.”\n “I’m fine,” I say, but they either don’t hear me or don’t care what I have to say.\n “I had glass in my hair.” She shoves the first-aid kit at him. “And it took me a second to find Laylen.”\n “Sure it did.” There’s insinuation in his tone. “Just like it always does.”\n “Whatever, Alex. It’s not like that between us anymore and you know it.” She flips her hair from her shoulder and then puts her hands on her hips. “And, just so you know, Laylen’s going to stay away until…” She glances at me, then leans closer to Alex as she lowers her voice.\n I can’t hear what they are saying. I hunch over, leaning forward to listen, but all I gather is something about “staying away” and “blood.” I give up and rest back against the couch with my arm draped over my stomach. I’m tired so I shut my eyes and let the numbness of approaching sleep consume me. It seems like I should be terrified out of my mind and I guess I am, in a sense. If Death Walkers or some other strange creature came running in, I would run, but I also feel empty. Not like how I had before I could feel. It feels like I’ve emptied all my worries. I’m no longer in this madness alone. Alex is here. And Aislin. And I guess this Laylen guy--whoever he is—is here, too. I’m not just roaming around the world solo, seeing bizarre things and otherworldly creatures. They can see them too. So, whether they are real or not, it’s a relief to know that I’m not the only one who’s crazy.\n “All right, but Stephan’s going to be pissed,” I hear Aislin say and then footsteps head toward the door.\n “Are you sleeping?” Alex’s voice drifts over me and I crack open my eyelids. He stands above me with the first-aid kit tucked under his arm. There are worry lines around his eyes and across his forehead.\n “Who’s Stephan?”\n He sets the first-aid kit on the table, flips the latches open and lifts up the lid. “My father.”\n “Your father.” That isn’t what I expected. I sit up and scoot to the edge of the sofa. “Really?”\n “Really.” He nods, then snatches a throw pillow from the recliner nearby and places it on the sofa beside me. “Lay down so I can get that piece of glass out of you and I’ll try to explain what I know while I do.”\n “Like why the Death Walkers haunt my dreams? And why you think I’m so important? And also, why I saw another one of you more than once?”\n He freezes. “You saw the mirage more than once?”\n I nod. “But I thought I blacked out or something and it was just a dream. Now, though, I’m second guessing that thought. I’m second guessing all my original thoughts.”\n “That’s probably a wise idea.” He rummages around in the kit and takes out square pieces of gauze and some Band-Aids. “It might help you believe what I’m going to tell you.” His hand stills as his eyes wander up to me. “Are you scared yet?”\n I analyze my emotions; confusion, inquisitiveness and eagerness are flowing inside me, causing chaos. Fear is absent, though. “I think I’m good. Although, I’m confused.”\n He scratches his head like it’s the weirdest response he’s ever heard. “Alright then, lie down and I’ll do my best to eliminate some of the confusion.”\n I lie down on the sofa and situate my head on the pillow with my arms resting at my sides. “Is a mirage like a doppelganger?”\n He gapes at me with a needle in his hand. “How do you know what a doppelganger is?”\n I shrug. “I read a lot.”\n His hand falls to the side and he almost stabs himself with the needle. “Again, you surprise me.” He pauses with a look of contemplation. “Gemma, were you always like this? Growing up, I mean? Or were you… different?”\n I’m not ready to answer that question yet, but the simple fact that he’s asked it leads me to believe he knows things about me and my past. “You go first.”\n Sighing with frustration, he bends over so he’s hovering over me. “Okay, try to hold as still as possible while I do this.”\n I fix my eyes on the ceiling, trying to think of something else besides the glass lodged in my side and the fact that he’s about to tug it out. All that I can think of, though, is that the red ceiling reminds me of blood and I’m very aware of every jerking movement. I flop my arm over my face, seal my eyes shut, and inhale through the pain. It’s easier than I expected, but, for some reason, I have a hunch that what lies ahead is going to be more painful.\n “Are you doing okay?” he whispers. “You’re not going to pass out on me, are you?”\n I shake my head from side to side, but my ribs are on fire. “I’m good.”\n “Okay, it’s all over.” He sounds choked so I open my eyes. In his palm is a long, but thin piece of glass. “This little thing right here is what was in you.”\n “That’s it?” I pick it up and turn it over in my hand. “It’s so small.”\n “Yeah, I know, but it was in pretty deep.” He takes the glass from me and tosses it into the first aid kit. Then he grabs a cotton ball, unscrews the lid of the rubbing alcohol bottle and douses the cotton ball with it. “Gemma, I’m really sorry.”\n “For what?”\n “For this.” He presses the cotton ball onto the open wound on my rib. It feels like someone has dumped gasoline on my skin and lit a match. My skin is blazing with a fire that’s invisible to the naked eye. I squeeze my eyes shut, bite down on my lip, and try not to scream bloody murder.\n “Sorry about that.” He removes the cotton ball from my skin, which is soaked with my blood, and discards it into the kit. “I just thought it would be better if I caught you off-guard. That way, you wouldn’t anticipate it.”\n “I don’t… God that hurt.” I complain and my voice cracks.\n “Now, I just have to stitch it up.” He pauses and I open my eyes to see what he’s doing. His gaze is aimed at my side, but not the one that is split open; the opposite one that is free of gaping holes.\n I start to sit up. “Is there another one?”\n He flattens his palm against my stomach and settles his gaze on my face. “Don’t move until I get it fixed up.” He shifts his body, then jerks his hand away and flexes his fingers as if my touch has burned him. “Anyway, the cut isn’t very big, so it shouldn’t take me that long.”\n “Are you sure you’re going to be okay?” I ask, lying back down. “You seem out of it.”\n “I’ll be fine.” His voice comes out sharp and he quickly clears his throat. He takes out a spool of string and begins unwinding it around his hand.\n The atmosphere between us has been killed by awkwardness and discomfort, which doesn’t make sense. Moments ago, I felt fine with him.\n “So… are you going to explain to me why you think I’m so important?” I ask.\n “Yeah, give me a second.” He refuses to look at me and snips the end of the string with a pair of scissors. “But you have to promise me two things first… The first is that you have to promise that you’ll try to keep an open mind about what I say.”\n “Okay, that seems easy enough,” I assure him with confidence. “What’s the second thing?”\n He drops the scissors into the kit. “That you’ll let me finish talking before you start freaking out.”\n A chill slithers up my spine and I shiver. “How do you know I’ll freak out?”\n He squints his eyes as he raises the needle and loops the piece of clear string through the end. “Because any sane person would freak out at what I’m about to tell them; even someone like you who seems to welcome the crazy.”\n “I don’t welcome it,” I state. “I just don’t know how to react sometimes.”\n He stations the needle just above my ribcage. “I know, but this might push you over the edge, so I need you to try your hardest to keep it together. It’s important.”\n I nod, but deep down, I know that it can end up out of my hands if the prickle makes a grand appearance. “I’ll do my best.” His hand dips toward my exposed stomach and I recoil because I absolutely hate needles.\n “I’m not even sure where to begin.” He rubs his hand across his face and his concentration sidetracks to stitching me up. “Hold still,” he instructs and I hold my breath as he guides the needle through my skin. \n","sourceLink":"https://allnovel.net/shattered-promises-shattered-promises-1/page-17.html","bookId":1976,"book":{"id":1976,"title":"Shattered Promises (Shattered Promises #1)","description":"Storyline: \n Shattered Promises (Shattered Promises #1) \n For twenty-one year-old Gemma, life has never been normal. She knows nothing about her past and has been haunted by the same monsters in her nightmares for the last few months. Unemotional and numb to life, she feels disconnected from everyone. Until the very first day she cries. After that, nothing in her life is the same. \n Her emotions slowly surface and she starts experiencing love, happiness, and anger, feelings she never knew existed. But they leave her confused and she doesn’t know whether to embrace them or run away from them. \n Her life only gets more complicated when she meets Alex. Sexy, arrogant, and secretive, Alex can get under Gemma’s skin like no one can. Yet she’s drawn to him by an invisible connection she has no control over. She’s also seen him before. In her nightmares. \n Every part of Gemma’s mind is screaming at her to stay away from Alex, but every other part of her is begging to get close to him. But the closer she gets, the more she realizes Alex knows more about her than he originally let on. \n As secrets about her past unravel, Gemma’s life becomes threatened. She needs to figure out what’s going on, before she winds up dead. But the only person she can turn to for answers is the one person she isn’t sure she can trust.\n \n","cover":"https://allnovel.net/images/shattered-promises-shattered-promises-1.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/shattered-promises-shattered-promises-1.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:22:30 AM"}}
