{"id":108727,"no":3,"title":"Page 3","content":"In the hall, Franz passed the black knobless door of the disused broom closet and the smaller padlocked one of an old laundry chute or dumbwaiter (no one remembered which) and the big gilded one of the elevator with the strange black window beside it, and he descended the red-carpeted stairs, which between each floor went in right-angling flights of six and three and six steps around the oblong stair well beneath the dingy skylight two stories up from his floor. He didn\u0027t stop at Gun\u0027s and Saul\u0027s floor - the next, the fifth - though he glanced at both their doors, which were diagonally opposite each other near the stairs, but kept on to the fourth.\n At each landing he glimpsed more of the strange black windows that couldn\u0027t be opened and a few more black doors without knobs in the empty red-carpeted halls. It was odd how old buildings had secret spaces in them that weren\u0027t really hidden but were never noticed; like this one\u0027s five airshafts, the windows to which had been painted black at some time to hide their dinginess, and the disused broom closets, which had lost their function with the passing of cheap maid service, and in the baseboard the tightly snap-capped round openings of a vacuum system which surely hadn\u0027t been used for decades. He doubted anyone in the building ever consciously saw them, except himself, newly aroused to reality by the tower and all. Today they made him think for a moment of the old times when this building had probably been a small hotel with monkey-faced bellboys and maids whom his fancy pictured as French with short skirts and naughty low laughs (dour slatterns more likely, reason commented). He knocked at 407.\n It was one of those times when Cal looked like a serious schoolgirl of seventeen, lightly wrapped in dreams, and not ten years older, her actual age. Long, dark hair, blue eyes, a quiet smile. They\u0027d been to bed together twice, but didn\u0027t kiss now - it might have seemed presumptuous on his part, she didn\u0027t quite offer to, and in any case he wasn\u0027t sure how far he wanted to commit himself. She invited him in to the breakfast she was making. Though a duplicate of his, her room looked much nicer - too good for the building - she had redecorated it completely with help from Gunnar and Saul. Only it didn\u0027t have a view. There was a music stand by the window and an electronic piano that was mostly keyboard and black box and that had earphones for silent practicing, as well as speaker.\n \"I came down because I heard you blowing the Telemann,\" Franz said.\n \"Perhaps I did it to summon you,\" Cal replied offhandedly from where she was busy with the hot plates and toaster. \"There\u0027s magic in music, you know.\"\n \"You\u0027re thinking of The Magic Flute?\" he asked. \"You make a recorder sound like one.\"\n \"There\u0027s magic in all woodwinds,\" she assured him. \"Mozart\u0027s supposed to have changed the plot of The Magic Flute midway so that it wouldn\u0027t be too close to that of a rival opera, The Enchanted Bassoon.\"\n He laughed, then went on. \"Musical notes do have at least one supernatural power. They can levitate, fly up through the air. Of course words can do that, too, but not as well.\"\n \"How do you figure that?\" she asked over her shoulder.\n \"From cartoons and comic strips,\" he told her. \"Words need balloons to hold them up, but notes just come flying out of the piano or whatever.\"\n \"They have those little black wings,\" she said, \"at least the eighth and shorter ones. But it\u0027s all true. Music can fly - it\u0027s all release - and it has the power to release other things and make them fly and swirl.\"\n He nodded. \"I wish you\u0027d release the notes of this piano, though, and let them swirl out when you practice harpsichord,\" he said, looking at the electronic instrument, \"instead of keeping them shut up inside the earphones.\"\n \"You\u0027d be the only one who\u0027d like it,\" she informed him.\n \"There\u0027s Gun and Saul,\" he said.\n \"Their rooms aren\u0027t on this shaft. Besides, you\u0027d get sick of scales and arpeggios yourself.\"\n \"I\u0027m not so sure,\" he said, then teased, \"But maybe harpsichord notes are too tinkly to make magic.\"\n \"I hate that word,\" she said, \"but you\u0027re still wrong. Tinkly (ugh!) notes can make magic too. Remember Papageno\u0027s bells - there\u0027s more than one kind of magic music in The Flute.\"\n They ate toast, juice, and eggs. Franz told Cal of his decision to send the manuscript of Towers of Treason off just as it was.\n He finished, \"So my readers won\u0027t find out just what a document-shredding machine sounds like when it works - what difference does that make? I actually saw that program on the tube, but when the Satanist wizard fed in the rune, they had smoke come out - which seemed stupid.\"\n \"I\u0027m glad to hear you say that,\" she said sharply. \"You put too much effort into rationalizing that silly program.\" Her expression changed. \"Still, I don\u0027t know. It\u0027s partly that you always try to do your best, whatever at, that makes me think of you as a professional.\" She smiled.\n He felt another faint twinge of guilt but fought it down easily.\n While she was pouring him more coffee, he said, \"I\u0027ve got a great idea. Let\u0027s go to Corona Heights today. I think there\u0027d be a great view of Downtown and the Inner Bay. We could take the Muni most of the way, and there shouldn\u0027t be too much climbing.\"\n \"You forget I\u0027ve got to practice for the concert tomorrow night and couldn\u0027t risk my hands, in any case,\" she said a shade reproachfully. \"But don\u0027t let that stop you,\" she added with a smile that asked his pardon. \"Why not ask Gun or Saul - I think they\u0027re off today. Gun\u0027s great on climbing. Where is Corona Heights?\"\n He told her, remembering that her interest in Frisco was neither as new nor as passionate as his - he had a convert\u0027s zeal.\n \"That must be close to Buena Vista Park,\" she said. \"Now don\u0027t go wandering in there, please. There\u0027ve been some murders there quite recently. Drug related. The other side of Buena Vista is right up against the Haight.\"\n \"I don\u0027t intend to,\" he said, \"though maybe you\u0027re a little too uptight about the Haight. It\u0027s quieted down a lot the last few years. Why, I got these two books there in one of those really fabulous secondhand stores.\"\n \"Oh, yes, you were going to show them to me,\" she said.\n He handed her the one that had been open, saying, \"That\u0027s just about the most fascinating book of pseudoscience I\u0027ve ever seen - it has some genuine insights mixed with the hokum. No date, but printed about 1900, I\u0027d judge.\"\n \"\u0027Megapolisomancy,\u0027\" she pronounced carefully. \"Now what would that be? Telling the future from... from cities?\"\n \"From big cities,\" he said, nodding.\n \"Oh, yes, the mega.\"\n He went on. \"Telling the future and all other sorts of things. And apparently making magic, too, from that knowledge. Though de Castries calls it a \u0027new science,\u0027 as if he were a second Galileo. Anyhow, this de Castries is very much concerned about the \u0027vast amounts\u0027 of steel and paper that are being accumulated in big cities. And coal oil (kerosene) and natural gas. And electricity, too, if you can believe it - he carefully figures out just how much electricity is in how many thousands of miles of wire, how many tons of illuminating gas in tanks, how much steel in the new skyscrapers, how much paper for government records and yellow journalism, and so on.\"\n \"My-oh-my,\" Cal commented. \"I wonder what he\u0027d think if he were alive today.\"\n \"His direst predictions vindicated, no doubt. He did speculate about the growing menace of automobiles and gasoline, but especially electric cars carrying buckets of direct electricity around in batteries. He came so close to anticipating our modern concern about pollution - he even talks of \u0027the vast congeries of gigantic fuming vats\u0027 of sulphuric acid needed to manufacture steel. But what he was most agitated about was the psychological or spiritual (he calls them \u0027paramental\u0027) effects of all that stuff accumulating in big cities, its sheer liquid and solid mass.\"\n \"A real proto-hippie,\" Cal put it. \"What sort of man was he? Where did he live? What else did he do?\"\n \"There\u0027s absolutely no indication in the book of any of those things,\" Franz told her, \"and I\u0027ve never turned up another reference to him. In his book he refers to New England and eastern Canada quite a bit, and New York City, but only in a general way. He also mentioned Paris (he had it in for the Eiffel Tower) and France a few times. And Egypt.\"\n Cal nodded. \"What\u0027s with the other book?\"\n \"Something quite interesting,\" Franz said, passing it over. \"As you can see, it\u0027s not a regular book at all but a journal of blank rice-paper pages, as thin as onionskin but more opaque, bound in ribbed silk that was tea rose, I\u0027d say, before it faded. The entries, in violet ink with a fine-point fountain pen, I\u0027d guess, hardly go a quarter of the way through. The rest of the pages are blank. Now when I bought these books they were tied together with an old piece of string. They looked as if they\u0027d been joined for decades - you can still see the marks.\"\n \"Uh-huh,\" Cal agreed. \"Since 1900 or so? A very charming diary book - I\u0027d like to have one like it.\"\n \"Yes, isn\u0027t it? No, just since 1928. A couple of the entries are dated, and they all seem to have been made in the space of a few weeks.\"\n \"Was he a poet?\" Cal asked. \"I see groups of indented lines. Who was he, anyway? Old de Castries?\"\n \"No, not de Castries, though someone who had read his book and knew him. But I do think he was a poet. In fact, I think I have identified the writer, though it\u0027s not easy to prove since he nowhere signs himself. I think he was Clark Ashton Smith.\"\n \"I\u0027ve heard that name,\" Cal said.\n \"Probably from me,\" Franz told her. \"He was another supernatural horror writer. Very rich, doomful stuff: Arabian Nights chinoiserie. A mood like Beddoes\u0027s Death\u0027s Jest-Book. He lived near San Francisco and knew the old artistic crew, he visited George Sterling at Carmel, and he could easily have been here in San Francisco in 1928 when he\u0027d just begun to write his finest stories. I\u0027ve given a photocopy of that journal to Jaime Donaldus Byers, who\u0027s an authority on Smith and who lives here on Beaver Street (which is just by Corona Heights, by the way, the map shows it), and he showed it to de Camp (who thinks it\u0027s Smith for sure) and to Roy Squires (who\u0027s as sure it isn\u0027t). Byers himself just can\u0027t decide, says there\u0027s no evidence for an extended San Francisco trip by Smith then, and that although the writing looks like Smith\u0027s, it\u0027s more agitated than any he\u0027s ever seen. But I have reasons to think Smith would have kept the trip secret and have had cause to be supremely agitated.\"\n \"Oh, my,\" Cal said. \"You\u0027ve gone to a lot of trouble and thought about it. But I can see why. It\u0027s tres romantique, just the feel of this ribbed silk and rice paper.\"\n \"I had a special reason,\" Franz said, unconsciously dropping his voice a little. \"I bought the books four years ago, you see, before I moved here, and I read a lot in the journal. The violet-ink person (whoever, I think Smith) keeps writing about \u0027visiting Tiberius at 607 Rhodes.\u0027 In fact, the journal is entirely - or chiefly - an account of a series of such interviews. That \u0027607 Rhodes\u0027 stuck in my mind, so that when I went hunting a cheaper place to live and was shown the room here - \"\n \"Of course, it\u0027s your apartment number, 607,\" Cal interrupted.\n Franz nodded. \"I got the idea it was predestined, or prearranged in some mysterious way. As if I\u0027d had to look for the \u0027607 Rhodes\u0027 and had found it. I had a lot of mysterious drunken ideas in those days and didn\u0027t always know what I was doing or where I was - for instance, I\u0027ve forgotten exactly where the fabulous store was where I bought these books, and its name, if it had one. In fact, I was pretty drunk most of the time - period.\"\n \"You certainly were,\" Cal agreed, \"though in a quiet way. Saul and Gun and I wondered about you and we pumped Dorotea Luque and Bonita,\" she added, referring to the Peruvian apartment manager and her thirteen-year-old daughter. \"Even then you didn\u0027t seem an ordinary lush. Dorotea said you wrote \u0027ficcion to scare, about espectros y fantasmas de los muertos y las muertas,\u0027 but that she thought you were a gentleman.\"\n Franz laughed. \"Specters and phantoms of dead men and dead ladies. How very Spanish! Still, I\u0027ll bet you never thought - \" he began and stopped.\n \"That I\u0027d some day get into bed with you?\" Cal finished for him. \"Don\u0027t be too sure. I\u0027ve always had erotic fantasies about older men. But tell me - how did your weird then-brain fit in the Rhodes part?\"\n \"It never did,\" Franz confessed. \"Though I still think the violet-ink person had some definite place in mind, besides the obvious reference to Tiberius\u0027s exile by Augustus to the island of Rhodes, where the Roman emperor-to-be studied oratory along with sexual perversion and a spot of witchcraft. The violet-ink person doesn\u0027t always say Tiberius, incidentally. It\u0027s sometimes Theobald and sometimes Tybalt, and once it\u0027s Thrasyllus, who was Tiberius\u0027s personal fortuneteller and sorcerer. But always there\u0027s that \u0027607 Rhodes.\u0027 And once it\u0027s Theudebaldo and once Dietbold, but three times Thibaut, which is what makes me sure, besides all the other things, it must have been de Castries that Smith was visiting almost every day and writing about.\"\n \"Franz,\" Cal said, \"all this is perfectly fascinating, but I\u0027ve just got to start practicing. Working up harpsichord on a dinky electronic piano is hard enough, and tomorrow night\u0027s not just anything, it\u0027s the Fifth Brandenburg Concerto.\"\n \"I know, I\u0027m sorry I forgot about it. It was inconsiderate of me, a male chauvinist - \" Franz began, getting to his feet.\n \"Now, don\u0027t get tragic,\" Cal said briskly. \"I enjoyed every minute, really, but now I\u0027ve got to work. Here, take your cup - and for heaven\u0027s sake, these books - or I\u0027ll be peeking into them when I should be practicing. Cheer up - at least you\u0027re not a male chauvinist pig, you only ate one piece of toast.\n \"And - Franz,\" she called. He turned with his things at the door. \"Do be careful up there around Beaver and Buena Vista. Take Gun or Saul. And remember - \" Instead of saying what, she kissed two fingers and held them out toward him for a moment, looking quite solemnly into his eyes.\n He smiled, nodded twice, and went out feeling happy and excited. But as he closed the door behind him he decided that whether or not he went to Corona Heights, he wouldn\u0027t ask either of the two men on the next floor up to go with him - it was a question of courage, or at least independence. No, today would be his own adventure. Damn the torpedoes! Full speed ahead! \n","sourceLink":"https://allnovel.net/our-lady-of-darkness/page-3.html","bookId":2519,"book":{"id":2519,"title":"Our Lady of Darkness","description":"Storyline: \n Middle-aged San Francisco horror writer Franz Westen is rediscovering ordinary life following a long alcoholic binge. Then one day, peering at his apartment window from atop a nearby hill, he sees a pale brown thing lean out his window…and wave. \n This encounter sends Westen on a quest through ancient books and modern streets, for the dark forces and paramental entities that thrive amidst the towering skyscrapers of modern urban life…and meanwhile, the entities are also looking for him.\n \n","cover":"https://allnovel.net/images/our-lady-of-darkness.jpg","author":"Fritz Leiber","type":"Horror","source":"allnovel","link":"https://allnovel.net/our-lady-of-darkness.html","creation":"Oct 5, 2019 8:58:50 AM","modification":"Oct 5, 2019 11:24:08 PM"}}
