{"id":94767,"no":12,"title":"Page 12","content":"\n Sister Hannahlily stood a dozen yards away, pretending to water flowers, but she was clearly watching Eve. Deep lines of concern were etched into her face.\n Eve’s face was slack, her mouth open, her eyes dull and fixed, as if all her internal lights had been switched off. It was how she often was, drifting between moderate highs and very deep lows. Benny took the bag of balloons from his pocket, tore it open, selected a bright yellow one, and began blowing it up as he strolled over in front of the swings. Riot saw what he was doing and raised her eyebrows in surprise. Balloons were rare—like most things from the old world, they weren’t made to last, and most of them were so dried out that any attempt to blow them up was a failure. The ones in the bag were wonderfully preserved, and with each puff the balloon grew and grew.\n Eve’s face remained slack, but after the fifth or sixth puff her eyes reclaimed a little bit of their focus and shifted toward him. The more the balloon expanded, the more awareness seemed to grow in the little girl’s eyes. Riot gave Benny a grateful smile that glistened with tears.\n It really must be one of Eve’s bad days, Benny thought. Riot looks like she’s ready to scream.\n Finally Benny stopped and tied off the balloon.\n “For milady,” he said, presenting the balloon to Eve with an exaggerated flourish and bow. “I believe you ordered a big, squishy, yellow thing.”\n There was a moment when Eve did nothing except look at the balloon, her mouth and body still slack. Then, like the sun peering shyly through the darkest of storm clouds, a small smile formed on her lips. She glanced at Benny and blinked several times, as if she was seeing him for the first time. Which, he thought sadly, she probably was. He kept his own smile pasted onto his face while the girl struggled out of the shadows. When her tiny hand slowly rose and reached for the balloon, she took it as lightly as someone reaching for an illusion in a dream, as if she was afraid it would suddenly vanish.\n Benny straightened and took two more balloons from the pack, a blue one and a green one. He almost picked a red one, but Riot gave him a quick and desperate sharp shake of the head. He stuffed the red one quickly out of sight and handed the other balloons to Riot.\n “If you fly away to the land of Oz,” said Benny, “make sure to send me a message via delivery Munchkin.”\n Eve nodded seriously, as if that was a reasonable suggestion.\n Benny left, and when he looked over his shoulder, Riot was teaching Eve how to blow up the green balloon. The little girl was smiling, but the whole thing hurt Benny’s heart. He was aware that the older nun, Sister Hannahlily, was watching him. He smiled and nodded to her, and she responded. A nod, no smile.\n A few minutes later Benny found Joe Ledger working out in a small enclosure behind the last of the hangars on this side of the trench. Grimm, Joe’s dog, opened one baleful eye, decided Benny wasn’t a lunch being delivered, and went back to sleep. Even so, Benny stayed well away from the mastiff as he entered the enclosure.\n Joe Ledger was stripped to the waist, wearing only camo pants and boots, and he shifted around on the balls of his feet as he worked a heavy bag. Joe barraged the leather with jabs, hooks, overhands, uppercuts, backhands, hammer blows, two-knuckle hits, corkscrew punches, elbows, and the occasional cutting palm. Then he shifted to kicks—snaps and roundhouse kicks, hooks and slashing knees. The bag juddered and danced as if it was being hit by continuous gunfire, and with each blow dust puffed through the canvas’s thick weave.\n It bothered Benny that despite Joe being at least thirty years older than Tom, the man was at least as fast. Maybe faster. And a whole lot stronger. That was annoying. It felt wrong, somehow, as if this man’s superior skill was in some way an insult to Tom’s memory. Even so . . . it was mesmerizing to watch.\n Eventually, though, his impatience ran faster than his fascination with the display of martial arts. Benny cupped his hands around his mouth and yelled, “Hey—Joe!”\n Grimm gave him a single, scolding bark.\n “I wasn’t talking to you,” said Benny.\n Benny could almost swear that the dog cocked one eyebrow in wry amusement.\n Finally Joe stepped back from the bag, chest heaving, sweat running in lines down his body and limbs. His face was flushed a deeper red than his sunburn, and his eyes were bright. He no longer looked hungover.\n “Hey, kid, what’s shaking?” asked Joe as he took a canteen from where it rested atop a stack of cinder blocks, unscrewed the cap, and took a long pull. There was no alcohol stink, and Benny was pleased to see that the canteen was filled with water rather than any “hair of the dog” booze. Joe seemed to sense something of that and grinned. “Best way to clean the system out is a lot of water and the kind of workout that gets the blood pumping.”\n “Or you could stay sober.”\n Joe peered at Benny while he took another long pull. “You’re kind of a pain in the ass, anyone ever tell you that?”\n “It’s come up in conversation.”\n “No doubt. So,” said Joe as he raised the canteen for another drink, “to what do I owe the honor of your company?”\n Benny said, “A reaper tried to kill me today.”\n Joe spat water halfway across the enclosure. “What? Where?”\n “Out at the plane.”\n “At the plane?” Joe yelled. “What in the wide blue hell were you doing out there?”\n “Not dying, thanks for asking,” Benny shouted back.\n Joe pointed a finger at Benny. “I thought I told you kids not to go anywhere near that plane.”\n “You did,” agreed Benny. “I ignored you. Mostly because I don’t remember you being the boss of me. When did that happen?”\n “When you met a responsible adult,” thundered Joe.\n “Really?” returned Benny acidly. “Responsible adult? That’s a joke. Almost every adult we’ve met since we left home has been one kind of psychopath or another. Bounty hunters who tried to make us fight in the zombie pits at Gameland. Nutjob loners who like putting people’s heads on their gateposts. Way-station monks who think the zoms are the meek who are supposed to inherit the earth. Scientists who lock themselves in a blockhouse and won’t even talk to us. Reapers who are trying to kill everyone, and you—whatever you are. Joe Action Figure. Don’t lecture me on ‘responsible adults.’ Me and my friends—the kids you’re talking about—we haven’t started fights with anyone. We’re not trying to push our religious views on anybody, and we’re not trying to take what anyone else has. And just because we’re teenagers doesn’t mean that we can’t make good decisions and take care of ourselves. We’re not little kids anymore. We’ve had to grow up a lot in the last few months. A whole lot. We came out here to find proof that the people of your generation haven’t actually destroyed everything that was ever worth anything. Why? Because your story might be over, but ours isn’t. I just hope that when we become adults we’re not as vicious, violent, and destructive as most of the so-called adults we’ve met out here in the Ruin. ’Cause I’m here to tell you, Joe, we could use some better role models.”\n Joe sucked his teeth. “You finished?”\n “No. The reaper who attacked me was also an adult.”\n Grimm gave a throaty whuff.\n Joe shot the dog an evil look. “Who asked you to take sides?” He wiped his mouth with the back of his hand and said, “Okay, okay, so life’s been hard for you, kid, I get it. Later on we can sit down and cry a little. Right now, though, how about you stop making speeches and tell me what happened at the plane? Actually, no. First tell me how you got away? And where’s the reaper now?”\n “He’s dead.”\n “How—?”\n Benny looked him straight in the eye. “I killed him.”\n Joe said, “What?”\n “I killed him. He came at me with a knife. I . . . had no choice.”\n “Ah, jeez, kid.” Joe sat down heavily on the stack of cinder blocks. “Look, Ben, I’m glad you’re okay, and I’m sorry you had to go through that.”\n It was not the response Benny had expected. He thought there would be more yelling, or some booyah crap about the glory of combat. Instead Joe looked genuinely sad. It confused Benny.\n “I’m pretty sorry I had to go through it too,” he said.\n “You sure you’re not hurt?” asked Joe.\n Benny shrugged. “Some bruises. A bad case of the shakes . . . and I guess a sick feeling in my stomach.”\n “Yeah. That pretty much comes with the job.”\n “Job? What job? I’m not a soldier.”\n “Maybe not, but let’s face it, kid, we are at war. Saint John has launched a genocidal holy war, and the very fact that we’re alive makes us enemy combatants in his book.”\n “I don’t want to fight Saint John.”\n “Hey, I don’t either.”\n “Besides, the reaper army vanished. You drove them off with the rocket launchers and all that.”\n Joe shook his head. “Be nice if that was true, kid, but the reapers I fought were Mother Rose’s splinter group. The main force of the reaper army is somewhere else. Hopefully they’re far, far from here, but the plain fact is they’re out there somewhere.”\n “ ‘Main force’? How many reapers are there?”\n “Conservative guess, including the group with Saint John and a half-dozen smaller groups he could gather together if he needs . . . call it thirty-five, forty thousand.”\n Benny nearly fell down. “What?”\n “Could be more.”\n “But . . . that’s more than all the people in Mountainside and the other eight towns put together!”\n “I know. It’s also why Saint John keeps winning. He has too big an army to lose any fight. Even if the defenders are well armed, Saint John can keep throwing bodies at them until they run out of bullets. He’s not a tactical genius, you know, he’s simply willing to do whatever it takes to win.”\n “And people are willing to die for him . . . that’s so . . .”\n “You’re looking at it the wrong way,” said Joe. “They’re not dying for Saint John, they’re dying for what he’s selling. He has them convinced that death is the antidote to pain and suffering, and it’s a hard argument to beat. Most religions talk about an afterlife or a paradise, right? Well, this world has been pretty much a crap sandwich for fifteen years, and it wasn’t always so friggin’ wonderful before that. Life is hard, people suffer, people get sick, they lose those they love. If you really believed that once you pass into the darkness, as Saint John calls it, there is no more pain, no more suffering, just bliss—if you believed that, you’d do anything to get there. Even walk into a fusillade of bullets. Especially if you believed that by dying for the cause you’re ensuring the salvation and bliss of everyone else. It’s a win-win situation. Saint John may actually believe this crap too, and probably does. In strategic terms, though, he’s adopted an ‘anything goes’ approach to winning.”\n “Jeez . . .”\n “The reason no one’s beat him yet,” said Joe, “is that people these days are afraid. They’re fighting like whipped dogs. There’s no genuine aggression left in them. They fight defensively, and that’s why they’re going to lose every battle.”\n “I thought the saying was that the best offense is a strong defense.”\n “You have it the wrong way around. The best defense is a strong offense. There’s an adage from the Wing Chun style of kung fu that goes ‘The hand which blocks also strikes.’ You understand what that means?”\n Benny nodded.\n “It’s academic, though . . . there’s no one west of the Rockies with either the technical oomph or the monkey-bat crazy nerve to fight him the right way.”\n “What’s the right way?”\n Joe cocked his head and considered Benny. “I’ve got my fair share of psychological issues,” he said. “There have been times when I’ve been in situations where I should have lost. I’ve been up against better numbers, and I’ve fought tougher men. You know why I’m still sucking air and they’re worm food? Because when it comes right down to it, there’s nothing I won’t do to win. Nothing. One time when we were really up against it, a guy I worked for looked at me and said, ‘I’d burn down heaven itself to stop this thing.’ If you think that sounds grandiose, that’s ’cause you didn’t know the man. That’s what he was willing to do, and I’m a whole lot crazier than him. So . . . I guess you have to ask yourself, young samurai, how far would you be willing to go to stop Saint John if he was coming after you and yours? How scary are you willing to be in order to take the heart out of the enemy? Are you willing to be the monster in the dark? Are you willing to be the boogeyman of their nightmares? If you can look inside your own head and see the line that you won’t cross, the limit that’s too far, then I can guarantee you Saint John will win. No question about it.”\n FROM NIX’S JOURNAL\n Until we found the crashed transport plane, we didn’t know what was out there in the Ruin. We knew someone had managed to fly a jet, but that didn’t tell us much.\n Now we know about the American Nation.\n The old government collapsed, and even though there are rumors that the president and some members of Congress went into hiding in a bunker, no one’s ever heard from them again. Captain Joe Ledger told us that a big group of survivors managed to take over the city of Asheville in North Carolina. There are more than a hundred thousand people there, and at least another fifty thousand living in fortified towns near there. Joe and a bunch of soldiers cleared out the zoms, and they have teams working to clear out all the areas around the city. They took back an army base and an air force base, too, which is why they have so many weapons. And the jet. They also have Black Hawk and Apache attack helicopters. Most of that stuff is in North Carolina. \n","sourceLink":"https://allnovel.net/fire-and-ash-benny-imura-4/page-12.html","bookId":2584,"book":{"id":2584,"title":"Fire and Ash (Benny Imura #4)","description":"Storyline: \n Fire and Ash (Benny Imura #4) \n Benny Imura and his friends have made it to Sanctuary, they\u0027ve found the jet and they\u0027ve discovered that civilization is struggling to regain its foothold in the aftermath of the zombie apocalypse. Scientists are on the verge of finding a cure for the zombie plague. It should be time for celebration, but it\u0027s not. Benny\u0027s best friend, Chong, has been infected by an arrow dipped in the flesh of a zombie and he hovers between life and death and Dr McReady, a researcher who may have the critical formula for a cure, has gone missing. So Benny convinces Captain Ledger to mount a search and rescue mission to find the doctor and help Chong. But with the Reapers still pursuing their plan to turn all zombies into super-fast shock troops even if they can save Chong, can they save themselves? In the fourth book of the thrilling and emotionally charged Rot \u0026 Ruin series, the battle to end all battles is about to begin...\n \n","cover":"https://allnovel.net/images/fire-and-ash-benny-imura-4.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/fire-and-ash-benny-imura-4.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:09:39 PM"}}
