{"id":94772,"no":17,"title":"Page 17","content":"\n The monk sputtered at them, but there was nothing he could do. Nix gave him a smile as bright as all the flowers in the world. Riot winked at him. They unslung their gear and began looking through the compartments of their quads. They had food, carpet coats, their entire remaining supply of cadaverine, every weapon they possessed, and a first-aid kit. Benny wore his sword slung over his shoulder the same way Tom used to wear it. Nix had Dojigiri, the Monster Cutter—the ancient sword given her by Joe—in her belt, and Tom’s old Smith \u0026 Wesson .38 revolver snugged into a shoulder holster. Riot wore her bandoliers of firecrackers, a Raven Arms .25 automatic in a belt holster, various knives, and her favorite weapon—a sturdy pre–First Night slingshot and a full pouch of sharp stones and metal ball bearings. Lilah had weapons everywhere, including a nine-millimeter pistol. They each wore vests with many small pockets crammed with other survival gear.\n The monk gave up trying to physically stand between them and the bikes and began fretting over them. He double-checked their food and water and admonished them about using violence against any of God’s creatures, living or dead.\n Nix slid into the saddle of her quad, a fiery red Kawasaki. “Brother,” she said, “we don’t ever want to hurt anyone. We’re actually trying to save lives.”\n The monk studied her. “Seriously?”\n Riot held up a hand. “Swear to God.”\n That put a puzzled look on the monk’s face, and it was still there when they fired up their quads and drove away.\n They passed through the chain-link gate, and Riot took the lead. Even though Benny, Nix, and Lilah knew the way, Riot was the expert; she knew every inch of this country. As soon as they cleared the twisted maze that was the hidden path leading from the open desert to Sanctuary, Riot raised her hand over her head and swung it in a circle. They immediately revved their engines, and the four of them burned their way back toward the dying forest.\n They drove fast, and except for the roar of their engines, they traveled in silence. Benny kept reviewing everything that had happened since yesterday morning: Chong, the strange interviews with the scientists, the fight with Nix, the ugly truth about the missing D-series files, the fight with the reaper who used to be a soldier, the discovery of the Teambook, the conversation with Joe, and the realization that he knew where Sergeant Ortega might be. No . . . where Sergeant Ortega was.\n They paused once on a rocky hill overlooking a big swath of the forest. The plateau with the crashed transport plane was off to the east. The densest part of the forest was north and west of them. A thin man-made stream that was part of the golf course’s original landscape design cut through the terrain, and from this distance they could catch glimpses of it as a blue ribbon winding haphazardly through the trees. Farther west was a big field that had once been a fairway. A ruptured irrigation pipe had carved a channel through the field, undercutting the foliage to create a long, crooked ravine that was surprisingly deep. The ravine was in a natural depression in the landscape, so Benny figured that what little rain runoff there was had helped to cut the channel through the loose and sandy soil.\n Benny pointed.\n “There,” he said, though they all knew it. It was the place where Benny and Nix had first met Riot. That first meeting had been strange. Riot had used the sharp bangs from her firecrackers to scare off a pride of hungry lions that had trapped Benny and the others. The rescue hadn’t been a kindness—Riot’s true goal had been to save Eve, who Benny had found in that very ravine. Eve was part of the group of refugees fleeing a reaper massacre; Riot was taking them to Sanctuary when Eve went missing. Oddly, it was an attack by reapers that had allowed Benny and Nix to escape Riot and her companions. That had been another very strange day.\n Nix took her binoculars out of their holder and surveyed the landscape, shook her head, and handed them to Lilah.\n “See anything?” asked Benny.\n “No,” said Lilah.\n Benny wasn’t much relieved. Zoms were surprisingly hard to spot in a landscape like this. Unless they were actively pursuing prey, they tended to stand still. Absolutely still, with none of the small, reflexive, or habitual gestures all humans make after a while.\n Riot took a long pull on her canteen, then cocked an eye at Benny. “Are y’all sure about this?”\n “Pretty much.”\n Riot grinned. “ ‘Pretty much’ ain’t as comforting as y’all might think.”\n “It’s what I have,” confessed Benny.\n “Fair enough.”\n “Stop talking,” said Lilah. She gunned her engine, crested the rise, and went roaring down the slope.\n “Fair enough,” Riot said again. She winked at Benny and plunged after Lilah.\n Benny cast a meaningful look at Nix.\n “He’ll be there,” said Nix, but her words were pitched in exactly the tone people use when they’re trying to help you brace for a disappointment. She aimed her quad toward the ravine.\n The voice inside Benny’s head said, On the plus side, if this works, people might stop thinking you’re a half-wit.\n “Oh . . . shut up.”\n Benny gave the Honda some gas and raced downhill to catch up.\n FROM NIX’S JOURNAL\n If I was in charge, I’d do things differently.\n Ever since I was ten I’ve been collecting every bit of information I could about zombies. How they move, how they attack. I’ve talked to every single member of the fence guards and all of the members of the town watch. I talked to everyone whose job it is to protect the town against the living dead. And the thing is . . . they’re doing it wrong.\n They think that the fence and the watch-towers are the right way to go because we’ve never been hit with a big wave of zoms. Tom said that it’s because zombies won’t go uphill unless they’re actively following prey. Mountainside is way up in the Sierra Nevadas. That’s why there are so many more zoms in the valleys and lowlands. So . . . it’s not that our defenses are all that great, it’s just that we’re lucky because of where we are.\n What if that changes? There are faster zoms now, we’ve seen them. We fought some of them. And since leaving town we’ve seen zoms moving in flocks. The reapers can even make the zoms move in flocks or herds.\n If a big wave of zoms attacked, the chain-link fence wouldn’t stop them.\n I’ve read so many books about fortifications and defenses. From ancient Rome to medieval sieges, to the Napoleonic wars to the tunnel wars in Vietnam. There are a lot of ways to make better defenses. The people in town are too lazy to be smart.\n If I was in charge I’d do things differently.\n I’d do them better.\n 42\n THEY PARKED THEIR QUADS AT the far side of the field, turned off the engines, dismounted, and then ran quickly and lightly through the shadows under the trees. They found a good spot several hundred yards away from the edge of the clearing, and there they stopped to observe the place where they’d parked. Lilah touched a finger to her lips, but they were all cautious enough to make no sound. Benny remembered one of Tom’s lessons about stealth and observation. When in doubt, observe, listen, wait, and evaluate.\n The roar of their quads had been an unavoidable noise, which meant that they had announced their arrival to everyone and everything. The spot where they’d parked the quads was in deep shadow, though. It was impossible to tell from any distance where the riders of those vehicles were. If there were predators out here—zoms, reapers, the pride of lions, or anything else—then they would be observing that spot, waiting for movement.\n Riot gestured to the others to indicate that she was going to go deeper into the woods and circle around to check the vicinity. Lilah nodded and took off in yet a different direction, leaving Nix and Benny where they were. With the two best hunters abroad in the woods, they’d be able to establish a very good idea of how safe they were.\n Long minutes passed, and gradually the natural sounds of the forest returned. There were plenty of birds in this part of the forest, and some chattering monkeys. Insects buzzed through the air. A deer stepped tentatively out from under the trees on the far side of the field and began grazing among the juniper bushes. After ten minutes, Lilah walked out of the woods near where the quads were parked. Her pistol was holstered, and she held her spear loosely in her hands. Seconds later, Riot came trotting out from between a rock and a big bristlecone tree. She waved all clear.\n “Let’s go,” said Benny, and he and Nix left the shadows and walked out into the sunlight. The field was covered in tall, dry grass that sighed with every breath of wind.\n They walked through the tall grass and approached the edge of the ravine with caution, testing the ground with their feet in case it was undercut. A month ago Benny had stood on the edge of this ravine and thought he was safe from a group of pursuing zoms, but the edge had collapsed under him, tumbling him down to the bottom along with dozens of the dead.\n They found one very solid spot and stood shoulder to shoulder looking down.\n A sea of white faces looked back up at them.\n Zoms.\n “God,” said Benny, “they’re still here.”\n Riot looked at him. “I thought that’s exactly what you expected.”\n “Sure,” he admitted, “but think about it. These zoms are going to be down there forever. Just standing there. Year after year.”\n “That’s horrible,” said Nix.\n “That’s hell as far as I see it,” said Riot.\n “That’s the Ruin,” said Lilah coldly.\n They all glanced at her, then they looked down again. The faces of the dead were as pale as worms, their skin streaked with dirt, their eyes dusty, their hands reaching upward.\n “How many you reckon are down there?” asked Riot.\n “More than before,” said Nix. “A lot more. After the first bunch fell in while chasing Benny, others must have been drawn to the sounds.”\n Lilah walked along the edge of the trench. Benny marveled that she could walk without a limp. It was only a few weeks after her injury, and every step had to hurt. The fact that she did not limp at all meant that she was eating her pain with each step. That was nearly as impressive as it was creepy.\n We all eat our pain, observed his inner voice. All four of us, and Chong, and Joe and everyone else. Eating our pain gives us the fuel to keep fighting.\n For once Benny could find no fault with what that inner voice said. He nodded to himself.\n “I’ll take the other side,” he said. “Nix, Riot . . . you guys go down to the other end and start up from there.” He gave them as good a description of Ortega as he could remember.\n Riot started to go, but Nix lingered a moment.\n “What?” asked Benny.\n She stepped closer and kept her voice low enough so that only he could hear her.\n “Benny, yesterday was a mess.”\n He shrugged.\n “No,” she insisted, “it was. I freaked out about Chong, and I reacted the wrong way.”\n “It’s—”\n “I know we already talked about it, and I know we’re supposed to be over it,” she said. “But I’m not over it. I don’t know who that was yesterday, but that wasn’t me.”\n “Yeah,” he said with a gentle smile, “I get that.”\n “Do you?”\n “I really do.”\n Nix touched Benny’s cheek, but the action was tentative, almost fearful. “Can—can I ask you one question, Benny?”\n “You can ask me anything.”\n She took a breath and seemed to be steeling herself for what she was about to say. “Do you . . . do you still love me?”\n He almost laughed.\n Luckily, his inner voice and whatever common sense he possessed grappled with his automatic reaction and wrestled it to the floor. So instead of a laugh, he gave her a smile. Even so, Nix’s face instantly clouded.\n “I’m serious,” she said sharply.\n Benny nodded. “I know.”\n He kissed her.\n “That’s the silliest question I’ve ever been asked.”\n Her frown deepened. “It’s not silly.”\n “It is to me. Of course I still love you. I’m always going to love you,” he said.\n Nix looked at him, troubled and puzzled. “Why?”\n “What?”\n She shook her head. “Why on earth do you still love me? Why on earth do you want to?”\n “I—”\n “I’m vicious and moody and nasty, I’m cold to you too much of the time, and sometimes I bite your head off when you’re just trying to be nice. I’m a monster.”\n “Yeah, and I’m always a yummy box of chocolates. C’mon, Nix, how shallow do you think I am?”\n Before she could answer, Benny turned away and began walking along the ravine, peering down through shadows at the pale faces below. He could feel Nix’s eyes on him, and he thought he could imagine at least some of what was going on in her head. Some. However, he wondered if she was trying to guess what was going on in his head. Benny remembered something Captain Strunk of the town watch once said on a hot summer afternoon on the porch of Lafferty’s General Store. Benny, Chong, and Morgie were sitting on the porch steps, opening packs of Zombie Cards; Captain Strunk was sitting in an old kitchen chair, and a bunch of other town men were with him. Mayor Kirsch; Wriggly Sputters, the town’s mailman; big one-armed Leroy Williams; Morgie Mitchell’s dad; and four or five others. The men had been talking about relationships, before and after First Night. When one of the men had, in exasperation, pronounced that all women were crazy and that all men were crazier for falling in love with them, everyone laughed. They agreed that there was just no understanding the mysteries of love. No sir, no how. Chong, who was twelve at the time, said, “What’s not to understand? People fall in love.” \n","sourceLink":"https://allnovel.net/fire-and-ash-benny-imura-4/page-17.html","bookId":2584,"book":{"id":2584,"title":"Fire and Ash (Benny Imura #4)","description":"Storyline: \n Fire and Ash (Benny Imura #4) \n Benny Imura and his friends have made it to Sanctuary, they\u0027ve found the jet and they\u0027ve discovered that civilization is struggling to regain its foothold in the aftermath of the zombie apocalypse. Scientists are on the verge of finding a cure for the zombie plague. It should be time for celebration, but it\u0027s not. Benny\u0027s best friend, Chong, has been infected by an arrow dipped in the flesh of a zombie and he hovers between life and death and Dr McReady, a researcher who may have the critical formula for a cure, has gone missing. So Benny convinces Captain Ledger to mount a search and rescue mission to find the doctor and help Chong. But with the Reapers still pursuing their plan to turn all zombies into super-fast shock troops even if they can save Chong, can they save themselves? In the fourth book of the thrilling and emotionally charged Rot \u0026 Ruin series, the battle to end all battles is about to begin...\n \n","cover":"https://allnovel.net/images/fire-and-ash-benny-imura-4.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/fire-and-ash-benny-imura-4.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:09:39 PM"}}
