{"id":94784,"no":29,"title":"Page 29","content":"\n Joe took the papers back and crumpled them up, his face a mask of disgust.\n “This is a monster factory,” he said.\n 65\n BROTHER PETER WATCHED AS TWO of the Red Brothers carried Sister Sun up the slope. Every day the woman seemed to have aged ten years. The cancer that consumed her was a merciless and ravenous thing. It would take her soon. A few days, a week at the most.\n In a way, Brother Peter envied her. She would be going into the darkness soon, and he was doomed to live until the work of the Night Church was completed.\n The reapers set her down, and one of them produced a small folding stool and supported her as she sat down on it. Peter ordered one of them to fetch water and directed another to erect the portable awning.\n They were in a cleft of rock that provided an excellent view of the chain-link fence, the airfield, the row of siren towers, and the hangars on both sides of the miles-long trench. However, from a reverse position, the reapers were invisible inside a bank of deep shadows.\n A reaper came trotting into the cleft.\n “Beloved of god,” he said to Sister Sun and Brother Peter, “we are ready.”\n Brother Peter nodded. “Good. Has there been any sign of the helicopter?”\n “No, my brother. I have ten scouts watching for it.”\n “Very well.”\n “The wind continues to veer,” said the reaper. “Sister Alice thinks it will shift two or three more points, but I ran the math a couple of times. We’re good to go now.”\n Brother Peter nodded again. “Go down to the fence and wait for the net crews. Sister Sun will be giving the signal.”\n The man bowed and left.\n Sister Sun smiled at Brother Peter and reached for his hand and squeezed it with what little strength she had. “You’ll let me do that? That’s so kind of you, Peter.”\n “This is your victory, sister.”\n “I know that Saint John is so proud of you,” she said, “and you will be gathered in with loving arms when it is your time to go into the darkness.”\n He bent and kissed the skeletal hand and pressed it to his cheek. On the other side of the desert, beyond the red rock mountains, the sun was beginning its long fall toward a fiery twilight. To both of them, the vital young man and the dying older woman, it looked like the whole world was about to burn.\n There was a rustling sound behind them, and they turned to see a dozen reapers walking in pairs along the shaded path by the rock wall heading down to the fence. Each pair held a bundle of rope ends that were connected to huge nets. The nets looked impossibly huge, but they were wrapped around clusters of brightly colored balloons. Thousands of them in each net.\n The men in each net crew nodded their respect as they passed. Down below, closer to the fence, the reaper known as Sister Alice was tossing handfuls of sand into the air to watch the direction of its fall.\n “It’s time,” said Brother Peter.\n But before she could give the signal, a terrible coughing fit struck Sister Sun. She bent over as sharply as if she’d been punched in the stomach, and drops of blood splattered her lap and knees and the dust at her feet. Brother Peter watched helplessly as the fit tore the dying woman apart. Other reapers stood by, their faces mournful. Even though each of them wished only the soothing darkness for Sister Sun, they ached for her to first witness the triumph of her plan.\n By slow, torturous degrees the coughs eased in intensity and then slowly, slowly passed.\n Sister Sun perched on the edge of her stool like a frail puppet held in place by a single frayed string. The reapers—and the world around them—held their breath, and even the wind slackened for a moment as if unwilling to blow without her permission.\n Her right hand trembled in her lap, and it was clear that she could barely lift it. Finally it rose. First barely an inch, then another, and another.\n Brother Peter let out a burning ball of air that was searing the walls of his lungs, and in a ringing voice he called, “Sister Sun has given the word. May the darkness bless us all.”\n The reapers at the fence made final cuts in work they had already begun with tin snips and bolt cutters. A quarter-mile length of the fence collapsed to the ground. Immediately the net teams rushed onto the airfield, running between the two southernmost of the siren towers. They formed a long line, and other reapers ran up to help them slash the lines that formed the nets. Immediately the captured balloons tumbled out and were shoved away by the wind that blew out of the southeast.\n Darkness was closing around Sister Sun’s thoughts, but as the red and yellow and blue and green balloons bobbed and danced across the hot sands, she thought a single word and her lips formed it silently.\n “Beautiful.”\n Then the darkness wrapped her in its arms and she fell forward.\n 66\n “WHAT’S THAT SUPPOSED TO MEAN?” asked Benny. “What kind of monsters did they make here? Or is that a naive question?”\n The ranger didn’t answer.\n Benny snorted in disgust. “More and more often I get the feeling that growing up after civilization ended is a better deal.”\n “More and more often I agree with you, kid.” Joe nodded toward the dead man. “That’s why I resigned today. I reached my limit of shame and guilt for being a part of the old system.”\n “Did you know about the Reaper Plague?” asked Nix.\n “Nah, that’s not what I mean. Like I told you, I was the guy who tried to stop this sort of thing. I loved my country, and I guess I still do, though I kind of feel the way a kid might feel when they discover that not only are their parents not perfect heroes, but they’re deeply flawed.”\n “Was the whole country like that?” asked Benny.\n “No—not even close. For the most part it was pretty great. But there never was a country, no matter how noble or well-intentioned, that wasn’t infected by a greedy and power-hungry few. It’s no different from those parasites infecting the zoms. We can’t really blame the afflicted person any more than we can blame the entire country, but we can sure as hell despise those parasites.”\n Lilah stood closest to the dead man. “Who was he?”\n “According to the paperwork we found, he was the deputy director of this facility in charge of operations. He kept this place running, before, during, and after First Night. He’s been keeping those old secrets all this time This place is way off the grid. . . . I’ll bet there are all sorts of things here that shouldn’t be anywhere.”\n “Well, isn’t that comforting?” said Nix sourly.\n They went back to the hallway. The corridor they’d been following ended at a blank wall, but on the far side of the blasted entrance was a much longer hallway that stretched off into shadows. Some residual smoke hung in the air, shifting like ghosts in the breeze. It obscured the hallway like fog in an alley on a humid night.\n “I lead,” said Joe, “you follow. Lilah, you watch our backs.”\n A month ago—or perhaps a few hours ago—Benny knew that he might resent Lilah being picked out for the more important job; but his mind was running in a different gear now and he knew it. Lilah was the better fighter, and she was far more experienced with being alert and moving with caution. Of course she was the better choice. He also knew that if Riot were here, she would have made a good alternate choice.\n There was a certain comfort in accepting these things. It touched on an old lesson Tom had given him, about seeing things as they are without being filtered through anticipation, expectation, or assumption. There was something liberating in seeing things with that clarity.\n I’m not who I was, thought Benny as he fell into step behind Nix. This is who I am. I’m not Tom and I’m not little Benny anymore.\n I’m me.\n Despite everything Benny smiled to himself.\n He wanted to tell Nix about this. He knew she would understand, and thinking that made something else click into place in his mind. He and Nix had fought a lot since leaving Mountainside; their relationship had eroded to more of a friendship than romantic love. He thought he understood why. The two people who’d fallen in love were naive and innocent kids back in a secluded town hidden behind a fence. Those kids didn’t exist anymore. For Benny the separation from naive child to aware teen had started the first time Tom took him out into the Ruin and he saw the realities and brutality of the world outside. The real world in no way resembled the version he’d constructed in his head. Even the things like combat and adventure were different beyond the gates. They weren’t fun, they weren’t part of a game. People got hurt and they died and there wasn’t always a happy ending and you couldn’t just clear the pieces off the game board and start again. For Benny, it began with that, but the process of change included fighting for his life, killing to save his life and the lives of others, seeing people die, seeing Tom die, and then leaving the place where Tom was buried and traveling farther out into the Ruin, past all known places and all chance of safety. Out here, where every day was a hardship and every choice was a hard one, something had happened to the old Benny. It wasn’t that he died, but the child in him stepped back and something else emerged. Not an adult—but an older teenager who was in charge of his own life.\n A similar process must have been going on in Nix. She wasn’t the funny, happy, easygoing girl Benny had first fallen in love with. Life since then hadn’t given her many reasons to laugh, and happiness was hard to maintain under the brutal sun of a wasteland. And who was easygoing out here in the Ruin? Joe pretended to be, but Benny knew now that the old ranger was playing a role. In truth, he was a heartbroken man who’d spent his entire life trying to save the world while constantly being disappointed in some of the people he should have been able to trust. His banter and jokes were probably the only props that kept him on his feet.\n Nix must have felt his thoughts, as she so often did. She turned and looked at him. Benny gave her a small nod and a brief but genuine smile. Nix’s brow furrowed for just a moment, and then he could see the exact moment when she understood that he understood. She was already there.\n That was when Benny saw something in Nix’s eyes that he hadn’t seen since before her mother died.\n Joy.\n Only a spark of it. But proof that her fire hadn’t gone out any more than his had.\n It made him want to laugh out loud, to shout, to hug her.\n But Nix turned around and followed the ranger and his dog. He followed her through smoke and shadows in a place of mystery and death, but Benny Imura was truly happy and content for the first time in his life.\n Yeah, he thought, this is who I am.\n 67\n THEY MOVED THROUGH THE BUILDING. There were storerooms filled with scientific equipment, offices whose only occupants were spiders in dusty old webs, and some rooms in which they found dead bodies. A few had been left to rot, but most were wrapped neatly in plastic. Once they were past the damaged entrance, they found that the electricity was still working. They passed through a generator room where a big unit encased in metal hummed with patient diligence.\n They entered a room marked MESS HALL. It was big, with two other doors leading out; one that bore the sign STAFF QUARTERS, and the other that led to the kitchens. The kitchen doors were propped open, but the room beyond was in total darkness. The whole mess hall was lit by only two functioning overhead lights. All the tables had been pushed back to make room for stacks upon stacks of plastic boxes. Five boxes to a stack, five stacks to a row. They stretched from just inside the door almost to the far wall. Beside the containers were waist-high heaps of large clear-plastic bags. Each bag was in turn filled with smaller bags crammed with clear capsules filled with a bright red powder. Benny guessed that there were at least a thousand of these big bags, and countless hundreds of thousands of the capsules.\n When Joe Ledger saw those bags, he stopped dead in his tracks.\n “That powder,” said Nix in a hushed voice. “Is it the same stuff that was on the fast zoms?”\n “I think so,” said the ranger. “Color’s a little different, though. The stuff I took off the zoms was paler.”\n Benny reached out to pick up one of the bags, but Joe caught his wrist. “No. Not without gloves.”\n “Why? What is this stuff?”\n “I think it’s Archangel.”\n “Is that a poison?” asked Lilah.\n “No . . . not poison,” said Joe, but before he could finish, Grimm suddenly turned toward the open kitchen doorway at the far side of the room, uttering a low and very menacing growl.\n All four of them spun around and brought their weapons up. Joe moved quickly to the front, his right index finger stretched along the outside curve of his pistol’s trigger guard, barrel aimed at the center of the doors.\n “What is it?” asked Nix.\n But Benny only shook his head. He shuffled sideways to give himself and Nix enough room to swing their swords.\n “Look . . . ,” said Lilah in an urgent whisper.\n There was a suggestion of movement beyond the doors, inside the darkened kitchen. It was formless and indistinct, like a piece of shadow shifting, and Benny couldn’t even be sure it was anything at all.\n There was a sound. A scuff. Soft and passive, like a foot being dragged.\n “Get ready,” whispered Joe. “If this goes south on us, I want you to haul your asses back to the chopper.”\n Something was emerging from the darkness. It did not look human. It was big and monstrous, with a misshapen head and limbs as thick as tree trunks.\n Grimm’s whole body trembled, either with the urge to attack or flee, Benny could not tell. For his own part, Benny wanted to run.\n The lumbering creature kept moving forward, and now Benny could see that it had some weird, wrinkled skin. Pale and unnatural. \n","sourceLink":"https://allnovel.net/fire-and-ash-benny-imura-4/page-29.html","bookId":2584,"book":{"id":2584,"title":"Fire and Ash (Benny Imura #4)","description":"Storyline: \n Fire and Ash (Benny Imura #4) \n Benny Imura and his friends have made it to Sanctuary, they\u0027ve found the jet and they\u0027ve discovered that civilization is struggling to regain its foothold in the aftermath of the zombie apocalypse. Scientists are on the verge of finding a cure for the zombie plague. It should be time for celebration, but it\u0027s not. Benny\u0027s best friend, Chong, has been infected by an arrow dipped in the flesh of a zombie and he hovers between life and death and Dr McReady, a researcher who may have the critical formula for a cure, has gone missing. So Benny convinces Captain Ledger to mount a search and rescue mission to find the doctor and help Chong. But with the Reapers still pursuing their plan to turn all zombies into super-fast shock troops even if they can save Chong, can they save themselves? In the fourth book of the thrilling and emotionally charged Rot \u0026 Ruin series, the battle to end all battles is about to begin...\n \n","cover":"https://allnovel.net/images/fire-and-ash-benny-imura-4.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/fire-and-ash-benny-imura-4.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:09:39 PM"}}
