{"id":9647,"no":8,"title":"CHAPTER VIII. A BITTER CRY.","content":"The next few days were so full of a new excitement for Violet that she scarcely had time to think of the little hunchback, or of the shock her feelings had received from Fritz\u0027s words. All day long she sat in the window, absorbed in watching what was going on in the street beneath. Regiments of soldiers were constantly marching past, bands were playing, and flags flying from many of the opposite windows. Great forage-carts toiled up the hill, driven by soldiers; and Uhlans were for ever dashing up and down the street on their great tall horses, so that the points of their lances often seemed to come up to the very window at which she sat. Going forth to War Going forth to War. Page 76. But Violet was not afraid of them, for even in their haste they gave her often a nod as they went by. Many of the Uhlans were friends of her father\u0027s, and though she scarcely recognized some of them in their square caps, they knew her; and not a few, as they[Pg 77] rode quickly past and saw the white face in the window, felt a shiver at their heart as they asked themselves the question, \"If John goes to the war, what is to happen to the child?\" But as yet the question was not decided, and though Violet had heard through Kate some talk of the war, her heart lay still in an unsuspecting calm. Once, as she saw a little child crying in the street below and holding on to its father\u0027s long military coat in an anguish of grief, she lifted her head suddenly and said to her father, who was busy making one of the wheels for her new carriage, \"Thou art not a soldier, father?\" \"No, darling, no, not at this moment.\" \"Thou wast a soldier once though, long ago, before Violet was born. Is it not so? Fritz has told me thou wert.\" \"Yes, a long time ago.\" \"And wert thou ever in a battle, father?\" \"Yes, my sweetest treasure, in several; but we will not talk of battles. Thou hast not asked me all to-day about the carriage. I have got the springs home this morning from the blacksmith, and it will be so light when it is finished that even Fritz could draw thee about in it.\" \"How lovely to go up and down the street with[Pg 78] Fritz as Ella does, ever so fast down the hill, and ever so slow up. I am not so heavy as Ella, am I, father?\" \"No, my poor little daughter, I am afraid not.\" \"And thou, father, some day, thou wilt take me in my carriage to the hill, and we will gather nuts and bring them home in my carriage; and every one will wonder when they see no one in the window. They will look up and they will say, \u0027Where is little Violet?\u0027 and they will never think that she is gone far, far away, to that hill which is so very far off.\" The child\u0027s face was radiant; her eyes had turned to that deep purple hue which seemed always to match the shadows of her dress, and her cheeks had crimsoned with the thought of this new and wonderful life which was so soon to be hers. Poor John put down his wheel and went over to his favourite seat on the broad sill beside her. He had purposely set her to talk on this theme, and now she was breaking his heart with her innocent raptures. \"I am afraid father is a great idler,\" he said, putting his head down very softly against her shoulder. \"I ought to be downstairs in my workshop now, instead of chattering nonsense to thee all day.\" \"But we were not talking nonsense, were we,[Pg 79] father? It is quite true about the carriage, is it not? it is not a fairy tale, father?\" \"A fairy tale?\" \"Fritz says—;\" she paused. \"What does Fritz say?\" John asked the question somewhat dreamily. He had been gazing at her earnestly for some minutes, and now he kissed her twice passionately, as if without any apparent reason. \"Thou art father\u0027s little treasure, his darling, his own sweet little maiden,\" he said with almost a sob in his throat, \"and thou must try and grow strong for father\u0027s sake.\" Violet looked up a little shyly, and put her arms round his neck. \"And thou art the best father in all the world—dear, dear father.\" The old policeman, walking by in the street, saw the little maiden with her arms so tightly clasped round her father\u0027s neck; and he said to himself with a groan, \"Poor maiden! she knows it all now, and she would fain hold him back if she could;\" and he walked on. But Violet did not know it all, nor for many days did the truth dawn upon her. It fell to Fritz\u0027s lot, as usual, to be the one to proclaim the tidings. It was one evening about a month after war had been proclaimed. It had been a very hot day, and[Pg 80] Violet was tired and weak, and not inclined to play or talk. She was leaning back against her pillows looking out at the pigeons, which always came at this hour of a summer\u0027s afternoon to sit and preen their feathers on the lantern-chain which hung high up across the street. She knew these pigeons quite well; she had given them all names. She placed crumbs for them every day on the window-sill beside her chair, and she delighted to see their fussy ways, twirling round and cooing angrily, and trying to push each other off the sill so as to secure the larger share of the food. But to-day she only watched them languidly. For the last three days neither Fritz nor Ella had called in to play with her. She had seen them in the street hanging on to the backs of the forage-waggons, and Fritz had once appeared in the window opposite with Ella\u0027s doll speared at the end of a lance, but seeing Violet beckoning to him to come across, he had shaken his head lugubriously and disappeared from her sight. So Violet, whose back was aching and whose little heart sank easily under any depressing influence, was alternately watching her father putting some finishing touches to the hood of her new carriage, and gazing out languidly at the pigeons and the storks on the[Pg 81] red roofs, and the jackdaw in Fritz\u0027s window opposite, hopping everlastingly up and down from its perch, and screaming out some words which the baker\u0027s boy had taught it with much trouble to say. Beyond the roofs and between the fretted spire of the church she saw also the hill, looking so green and fresh in the golden evening air; and above it there was a pale green sky, flecked with amber clouds and little bars of red. Violet sighed heavily, and John looked up from his work. \"What ails my treasure?\" \"Nothing, father, only I am so, so tired; and Fritz and Ella, they have not come to see me for so many days.\" \"Ah, I will call over there presently and send them across to thee. I have but one or two nails to put in this hood, and then thy carriage will be finished; that is good, is it not?\" \"Delightful!\" cried Violet, raising herself up in her chair to see better the last finishing touches put to her new possession; but as she did so her eyes fell for a moment on the pavement opposite, where a soldier was just stopping at the Adlers\u0027 door with a bundle of papers in his hand, surrounded and followed by a large and excited crowd. [Pg 82] \"What is it? father, come here. There is such a fuss in the street. A soldier has just gone in at the Adlers\u0027 house, and all the people are standing at their door, and one woman is crying.\" \"I am afraid a great many women and children will cry before this evening is over,\" said her father very gravely, as he rose and went over to the window. \"Why, father?\" \"Because their husbands and fathers will have to go away from them to the war, and leave them. Yes; it is just as I thought. It is the orderly corporal leaving the names at the different houses. Whose turn will it be next?\" \"But Fritz\u0027s father cannot be sent to the war; he is not a soldier, father?\" \"We must all be soldiers, little one, when a war comes, and we are called out to fight.\" \"But thou, father, art not a soldier; thou saidst so to me thyself the other day. Father, dear father, turn round thy face to me. Tell Violet that thou wilt never be a soldier.\" \"I cannot tell Violet what she asks me,\" said John slowly, turning his face and speaking in a strained, thick voice. \"If the king wants me to fight for God and the Fatherland, of course I must go.\" [Pg 83] \"But he does not want thee; he has not sent for thee?\" \"Not yet,\" he said, sitting down beside his little girl, and lifting up one of her hands tenderly; \"but he may want me. And if he does, I must go; must I not, Violet? Father could not stay at home if his king called him. A brave soldier is always ready to fight for his country.\" \"But thou art not a soldier, father. The king has not called; and if he were to call for thee, I would not let thee go. For if father goes away to the war, and leaves Violet all alone, she must die! she must die! she must die!\" Violet sobbed, and rocked herself to and fro in her chair. \"There, there, my heart, thou must not say such things. The corporal has not called yet with father\u0027s name. Keep still, my lamb, and cease crying. Fritz will be here soon, and thou wilt see how brave he is. I will go over and call him,\" cried John, rising precipitately. The corporal had come out of the Adlers\u0027 house, and was crossing over towards their own doorway. \"Father, father, stay!\" cried Violet. \"I would rather have thee to sit with me than Fritz.\" She caught at his coat. \"Come back to me! come back, come back!\" [Pg 84] But he was already closing the door after him, and in a moment more she heard his footsteps hurrying down the stairs. With eyes full of blinding tears, she turned quickly to see him emerge into the street beneath; but though she brushed them from her eyes, he was nowhere to be seen. She looked up at the windows opposite, but he was not there either—only she could see Fritz lying on his face on the floor, and Ella stooping caressingly over him, with her little white apron to her eyes. The crowd was now gathered exactly under their own window, and Violet\u0027s heart beat so fast that at last she cried out loud in her misery, and Kate opening the door came in. \"Kate, Kate, where is father?\" she cried out anxiously. \"Father is busy talking to the corporal downstairs. He cannot come up just yet.\" \"The corporal!\" screamed Violet passionately; \"he is not coming to call my father to the war? Go down, Kate, to the door, and tell him he must not call him away. Father could not go to the war and leave me all alone.\" \"No, no; to be sure not,\" said Kate soothingly. \"Men with children have no business to go off fighting. I will tell him so when he comes up, and—[Pg 85] Ah, here comes Master Fritz, tearing across the street like a madman, and Miss Ella too.\" \"Shut the door!\" screamed Violet. \"I do not want to see Fritz; I do not want to see Ella: I want only father, only father to come back.\" But before Kate\u0027s stiff bones could bear her across the room, the door flew open and the children rushed in. Fritz\u0027s cheeks were purple, his eyes were red, his blue-striped blouse was damp with tears. Ella tumbled in after him, her face also streaked and smeared from crying, and her pinafore hopelessly crumpled. \"Hast thou heard the news, Violet?\" screamed Fritz excitedly. \"The Reserve has been called out, and father is to go to the war!\" \"What is the Reserve?\" \"Oh, all the soldiers who have been out fighting before, long ago. My father was in lots of battles before, and so was yours.\" \"My father is not in the Reserve?\" cried Violet, leaning forward eagerly. \"Yes; of course he is. I saw the corporal put the same blue paper into his hand downstairs as he did into father\u0027s a few minutes ago.\" \"And he is to go away to the war?\" \"Yes.\" \"When?\" [Pg 86] \"The day after to-morrow.\" Then such a cry of bitter anguish burst from Violet\u0027s lips that Fritz and Ella absolutely stood aghast with terror. She struggled wildly to get free from her chair, and to push her little table away which held her a close prisoner—\"Let me out! let me down, Fritz, Ella! I must find father.—Father, father, father!\" till at last the bitter cry echoed through the room, the house, and out into the street. Madam Adler opposite heard it, and thrust her fingers into her ears; the policeman walking past covered his eyes suddenly with his gloved hands; and John, saying farewell to the corporal in the hall, heard it also. In a few moments he was up the stairs, and held his darling close to his heart. Fritz and Ella speedily departed homewards, leaving the door wide open behind them. John rose and closed it, and he and Violet were left alone to their grief. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3323/91011.html","bookId":391,"book":{"id":391,"title":"On Angel\u0027s Wings","description":"简介： Every one knew little Violet. She sat always in a small window which projected out over the street, and her purple frock and pale face were looked for and recognized by almost every passer-by....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3323","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
