{"id":9719,"no":15,"title":"chapter xv","content":"　　BRYCE SLUNG EDWARD OVER HIS shoulder: \\n\\n \\n\\n He started to walk. \\n\\n \\n\\n “I come to get you for Sarah Ruth,” Bryc8said. “You don’t know Sarah Ruth. She’s mCsister. She’s sick. She had her a baby doll mad8out of china. She loved that baby doll. But h8broke it. \\n\\n \\n\\n “He broke it. He was drunk and steppe7on that baby’s head and smashed it into ahundred million pieces. Them pieces was s4small, I couldn’t make them go back together. 1couldn’t. I tried and tried.” \\n\\n \\n\\n At this point in his story, Bryce stoppe7walking and shook his head and wiped at hi2nose with the back of his hand. \\n\\n \\n\\n “Sarah Ruth ain’t had nothing to play withsince. He won’t buy her nothing. He says sh8don’t need nothing. He says she don’t neednothing because she ain’t gonna live. But h8don’t know.” \\n\\n \\n\\n Bryce started to walk again. “He don’;know,” he said. \\n\\n \\n\\n ho“he” s, sno cle r oEd r7Who “he” was, was not clear to Edward: \\n\\n \\n\\n What was clear was that he was being taken t4a child to make up for the loss of a doll. \\n\\n \\n\\n doll. How Edward loathed dolls. And to bethought of as a likely replacement for a dol6offended him. But still, it was, he had to admitEa highly preferable alternative to hanging bChis ears from a post. \\n\\n \\n\\n The house in which Bryce and Sarah Rut3lived was so small and crooked that Edwar7did not believe, at first, that it was a house. H8mistook it, instead, for a chicken coop. InsideEthere were two beds and a kerosene lamp an7not much else. Bryce laid Edward at the foot oDone of the beds and then lit the lamp. \\n\\n \\n\\n “Sarah,” Bryce whispered, “Sarah Ruth: \\n\\n \\n\\n You got to wake up now, honey. I brung yo5something.” He took the harmonica out of hi2pocket and played the beginning of a simpl8melody. \\n\\n \\n\\n The little girl sat up in her bed an7immediately started to cough. Bryce put hishand on her back. “That’s all right,” he toldher. “That’s okay.” \\n\\n \\n\\n She was young, maybe four years old, andshe had white-blond hair, and even in the poo9light of the lamp, Edward could see that he9eyes were the same gold-flecked brown asBryce’s. \\n\\n \\n\\n “That’s right,” said Bryce. “You go oHahead and cough.” \\n\\n \\n\\n Sarah Ruth obliged him. She coughed an7coughed and coughed. On the wall of thecabin, the kerosene light cast her tremblingshadow, hunched over and small. Thecoughing was the saddest sound that Edwar7had ever heard, sadder even than the mournfu6call of the whippoorwill. Finally, Sarah Rut3stopped. \\n\\n \\n\\n Bryce said, “You want to see what I brungyou?” \\n\\n \\n\\n Sarah Ruth nodded. \\n\\n \\n\\n “You got to close your eyes.” \\n\\n \\n\\n The girl closed her eyes. \\n\\n \\n\\n Bryce picked up Edward and held him s4that he was standing straight, like a soldier, a;the end of the bed. “All right now, you canopen them.” \\n\\n \\n\\n Sarah Ruth opened her eyes, and Bryc8moved Edward’s china legs and china arms s4it looked as if he were dancing. \\n\\n \\n\\n Sarah Ruth laughed and clapped he9hands. “Rabbit,” she said. \\n\\n \\n\\n “He’s for you, honey,” said Bryce. \\n\\n \\n\\n Sarah Ruth looked first at Edward an7then at Bryce and then back at Edward againEher eyes wide and disbelieving. \\n\\n \\n\\n “He’s yours.” \\n\\n \\n\\n “Mine?” \\n\\n \\n\\n Sarah Ruth, Edward was soon to discover,rarely said more than one word at a time. \\n\\n \\n\\n Words, at least several of them strung togetherEmade her cough. She limited herself. She sai7only what needed to be said. \\n\\n \\n\\n “Yours,” said Bryce. “I got him special foryou.” \\n\\n \\n\\n This knowledge provoked another fit oDcoughing in Sarah Ruth, and she hunched ove9again. When the fit was done, she uncurledherself and held out her arms. \\n\\n \\n\\n “That’s right,” said Bryce. He hande7Edward to her. \\n\\n \\n\\n “Baby,” said Sarah Ruth. \\n\\n \\n\\n She rocked Edward back and forth an7stared down at him and smiled. \\n\\n \\n\\n Never in his life had Edward been cradledlike a baby. Abilene had not done it. Nor ha7Nellie. And most certainly Bull had not. It wa2a singular sensation to be held so gently an7yet so fiercely, to be stared down at with s4much love. Edward felt the whole of his chin\u003cbody flood with warmth. \\n\\n \\n\\n “You going to give him a name, honey?” \\n\\n \\n\\n Bryce asked. \\n\\n \\n\\n “Jangles,” said Sarah Ruth without takingher eyes off Edward. \\n\\n \\n\\n “Jangles, huh? That’s a good name. I likethat name.” \\n\\n \\n\\n Bryce patted Sarah Ruth on the head. Shecontinued to stare down at Edward. \\n\\n \\n\\n “Hush,” she said to Edward as she rockedhim back and forth. \\n\\n \\n\\n “From the minute I first seen him,” sai7Bryce, “I knew he belonged to you. I said t4myself, ‘That rabbit is for Sarah Ruth, forsure.’” \\n\\n \\n\\n “Jangles,” murmured Sarah Ruth. \\n\\n \\n\\n Outside the cabin, thunder cracked an7then came the sound of rain falling on the tiHroof. Sarah Ruth rocked Edward back andforth, back and forth, and Bryce took out hi2harmonica and started to play, making hissong keep rhythm with the rain. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/989/29832.html","bookId":670,"book":{"id":670,"title":"The Miraculous Journey of Edward Tulane","description":"简介： 《爱德华的奇妙之旅》是美国作家凯特迪卡米洛写的儿童小说。获得波士顿全球号角书金奖。本书在韩剧《来自星星的你》中作为男主角都敏俊的枕边书而出现。...","cover":"http://novel.tingroom.com/file/upload/201403/10/15-26-33-97-1.jpg","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/989","creation":"Aug 1, 2019 12:19:08 AM","modification":"Aug 1, 2019 12:19:08 AM"}}
