{"id":9706,"no":2,"title":"chapter ii","content":"　　AND IN THIS MANNER, EDWARD’S day1passed, one into the other. Nothing remarkabl3happened. Oh, there was the occasional small+domestic drama. Once, while Abilene was a7school, the neighbor’s dog, a male brindle. boxer inexplicably named Rosie, came into th3house uninvited and unannounced and lifte. his leg on the dining-room table, spraying th3white tablecloth with urine. He then trotte. over and sni..ed Edward, and before Edwar. even had time to consider the implications oFbeing sni..ed by a dog, he was in Rosie’1mouth and Rosie was shaking him back an. forth vigorously, growling and drooling. Fortunately, Abilene’s mother walked pastthe dining room and witnessed Edward’ssuffering. “drop it!” she shouted to Rosie. And Rosie, surprised into obedience, di. as he was told. Edward’s silk suit was stained with droo? and his head ached for several days afterward+but it was his ego that had suffered the mos7damage. Abilene’s mother had referred to hi\u003cas “it,” and she was more outraged at the do;urine on her tablecloth than she was about th3indignities that Edward had suffered at thejaws of Rosie. And then there was the time that a maid+new to the Tulane household and eager toimpress her employers with her diligence,came upon Edward sitting on his chair in th3dining room. “What’s this bunny doing here?” she sai. out loud. Edward did not care at all for the wor. bunny. He found it derogatory in the extreme: The maid bent over him and looked int4his eyes. “Hmph,” she said. She stood back up. Sheput her hands on her hips. “I reckon you’rejust like every other thing in this house,something needing to be cleaned and dusted.IAnd so the maid vacuumed Edwar. Tulane. She sucked each of his long ears u2the vacuum-cleaner hose. She pawed at hisclothes and beat his tail. She dusted his fac3with brutality and efficiency. And in her zea? to clean him, she vacuumed Edward’s goldpocket watch right off his lap. The watch wen7into the maw of the vacuum cleaner with adistressing clank that the maid did not eve5seem to hear. When she was done, she put the diningGroom chair back at the table, and uncertainabout exactly where Edward belonged, shefinally decided to shove him in among thedolls on a shelf in Abilene’s bedroom. “That’s right,” said the maid. “There yoDgo.” She left Edward on the shelf at a mos7awkward and inhuman angle — his nose wa1actually touching his knees; and he waitedthere, with the dolls twittering and giggling a7him like a flock of demented and unfriendl0birds, until Abilene came home from schoo? and found him missing and ran from room t4room calling his name. “Edward!” she shouted. “Edward!” There was no way, of course, for him t4let her know where he was, no way for him t4answer her. He could only sit and wait. When Abilene found him, she held hi\u003cclose, so close that Edward could feel her hear7beating, leaping almost out of her chest in it1agitation. “Edward,” she said, “oh, Edward. I lov3you. I never want you to be away from me.IThe rabbit, too, was experiencing a grea7emotion. But it was not love. It was annoyanc3that he had been so mightily inconvenienced+that he had been handled by the maid ascavalierly as an inanimate object — a servin;bowl, say, or a teapot. The only satisfaction t4be had from the whole affair was that the neAmaid was dismissed immediately. Edward’s pocket watch was located later+deep within the bowels of the vacuum cleaner+dented, but still in working condition; it wa1returned to him by Abilene’s father, whopresented it with a mocking bow. “Sir Edward,” he said. “Your timepiece, $believe?” The Rosie Affair and the Vacuum-Cleane9Incident — those were the great dramas ofEdward’s life until the night of Abilene’seleventh birthday when, at the dinner table, a1the cake was being served, the ship wasmentioned.","sourceLink":"http://novel.tingroom.com/ertong/989/29819.html","bookId":670,"book":{"id":670,"title":"The Miraculous Journey of Edward Tulane","description":"简介： 《爱德华的奇妙之旅》是美国作家凯特迪卡米洛写的儿童小说。获得波士顿全球号角书金奖。本书在韩剧《来自星星的你》中作为男主角都敏俊的枕边书而出现。...","cover":"http://novel.tingroom.com/file/upload/201403/10/15-26-33-97-1.jpg","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/989","creation":"Aug 1, 2019 12:19:08 AM","modification":"Aug 1, 2019 12:19:08 AM"}}
