{"id":9724,"no":20,"title":"chapter xx","content":"　　EXCEEDINGLY WELL MADE,” SAID the ma5who was running a warm cloth over Edward’8face,“a work of art,I would say — 4surpassingly,unbelievably dirty work of artbut art nonetheless. And dirt can be dealt withIJust as your broken head has been dealt with.. \n \n Edward looked into the eyes of the manI“Ah,there you are,” the man said. “I ca5see that you are listening now. Your head wa8broken. I fixed it. I brought you back from th2world of the dead.” \n \n My heart,thought Edward,my heart i8broken. \n \n “No,no. No need to thank me,” the ma5said. “It’s my job,quite literally. Allow me t7introduce myself. I am Lucius Clarke,dollmender. Your head . . . may I tell you? Will i0upset you? Well,I always say the truth must b2met head-on,no pun intended. Your headyoung sir,was in twenty-one pieces.” \n \n Twenty-one pieces? Edward repeate@mindlessly. \n \n Lucius Clarke nodded. “Twenty-one,” h2said. “All modesty aside,I must admit that 4lesser doll mender,a doll mender without mEskills,might not have been able to rescue youIBut let’s not speak of what might have beenILet us speak instead of what is. You are wholeIYou have been pulled back from the brink oBoblivion by your humble servant,LuciusClarke.” And here,Lucius Clarke put his han@on his chest and bowed deeply over EdwardIThis was quite a speech to wake up toand Edward lay on his back trying to absorb itIHe was on a wooden table. He was in a roo3with sunshine pouring in from high windowsIHis head,apparently,had been in twenty-on2pieces and now was put back together intoone. He was not wearing a red suit. In fact,h2had no clothes on at all. He was naked againIAnd he did not have wings. \n \n And then he remembered: Bryce,th2diner,Neal swinging him through the air. \n \n Bryce. \n \n “You are wondering,perhaps,about you9young friend,” said Lucius,“the one with th2continually running nose. Yes. He brought yo: \n \n here,weeping,begging for my assistance. ‘Pu0him together again,’ he said. ‘Put him backtogether.’ \n \n “I told him,I said,‘Young sir,I am 4businessman. I can put your rabbit backtogether again. For a price. The question iscan you pay this price?’ He could not. Ofcourse,he could not. He said that he could notI“I told him then that he had two optionsIOnly two. The first option being that he seeDassistance elsewhere. Option two was that Iwould fix you to the very best of myconsiderable abilities and then you wouldbecome mine — his no longer,but mine.” \n \n Here Lucius fell silent. He noddedagreeing with himself. “Two options only,” h2said. “And your friend chose option two. H2gave you up so that you could be healed. \n \n Extraordinary,really.” \n \n Bryce,thought Edward. \n \n Lucius Clarke clapped his hands togetherI“But no worries,my friend. No worries. I fullEintend to keep up my end of the bargain. Iwill restore you to what I perceive to be you9former glory. You shall have rabbit-fur earsand a rabbit-fur tail. Your whiskers will berepaired and replaced,your eyes repainted t7a bright and stunning blue. You will be clothe@in the finest of suits. \n \n “And then,someday,I will reap the returnon my investment in you. All in good time. Al\u003e \n \n in good time. In the doll business,we have 4saying: there is real time and there is doll timeIYou,my fine friend,have entered doll time.. \n \n \n \n","sourceLink":"http://novel.tingroom.com/ertong/989/29837.html","bookId":670,"book":{"id":670,"title":"The Miraculous Journey of Edward Tulane","description":"简介： 《爱德华的奇妙之旅》是美国作家凯特迪卡米洛写的儿童小说。获得波士顿全球号角书金奖。本书在韩剧《来自星星的你》中作为男主角都敏俊的枕边书而出现。...","cover":"http://novel.tingroom.com/file/upload/201403/10/15-26-33-97-1.jpg","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/989","creation":"Aug 1, 2019 12:19:08 AM","modification":"Aug 1, 2019 12:19:08 AM"}}
