{"id":87602,"no":56,"title":"Page 56","content":"God, this is so bad.\n When we reach my car, he heads straight for the driver’s side door. He points to the passenger side and says, “Get in, Lily.”\n He doesn’t speak to me the entire time we’re driving. I say his name once, but he just shakes his head like he’s not ready to hear my explanation yet. When we pull into my parking garage, he gets out of the car as soon as he turns it off, like he can’t get away from me fast enough.\n He’s pacing the length of the car when I get out. “It wasn’t what it looked like, Ryle. I swear.”\n He stops pacing, and when he looks at me, my heart doubles over. There’s so much pain in his eyes right now, and it’s not even necessary. It was all due to a stupid misunderstanding.\n “I didn’t want this, Lily,” he says. “I didn’t want a relationship! I didn’t want this stress in my life!”\n As much as he’s hurting because of what he thinks he saw, his words still piss me off. “Well, then leave!”\n “What?”\n I throw my hands up. “I don’t want to be your burden, Ryle! I’m so sorry my presence in your life is so unbearable!”\n He takes a step forward. “Lily, that’s not at all what I’m saying.” He throws his hands up in frustration and then walks past me. He leans against my car and folds his arms over his chest. There’s a long stretch of silence while I wait for what he has to say. His head is down, but he lifts it slightly, looking up at me.\n “Naked truths, Lily. That’s all I want from you right now. Can you please give me that?”\n I nod.\n “Did you know he worked there?”\n I purse my lips together and wrap my arm over my chest, grabbing at my elbow. “Yes. That’s why I didn’t want to go back, Ryle. I didn’t want to run into him.”\n My answer seems to release a little of his tension. He runs a hand down his face. “Did you tell him what happened last night? Did you tell him about our fight?”\n I take a step forward and shake my head adamantly. “No. He assumed. He saw my eye and your hand and he just assumed.”\n He blows out a laden breath and leans his head back, looking up at the roof. It looks like it’s almost too painful for him to even ask the next question.\n “Why were you alone with him in the bathroom?”\n I take another step forward. “He followed me in there. I know nothing about him now, Ryle. I didn’t even know he owned that restaurant, I thought he was just a waiter. He’s not a part of my life anymore, I swear. He just . . .” I fold my arms together and drop my voice. “We both grew up in abusive households. He saw my face and your hand and . . . he was just worried for me. That’s all it was.”\n Ryle brings his hands up and covers his mouth. I can hear the air rushing through his fingers as he releases his breath. He stands up straight, allowing himself a moment to soak in all I’ve just said.\n “My turn,” he says.\n He pushes off the car and takes the three steps toward me that previously separated us. He puts both hands on my cheeks and looks me dead in the eyes. “If you don’t want to be with me . . . please tell me right now, Lily. Because when I saw you with him . . . that hurt. I never want to feel that again. And if it hurts this much now, I’m terrified to think of what it could do to me a year from now.”\n I can feel the tears begin to stream down my cheeks. I place my hands on top of his and shake my head. “I don’t want anyone else, Ryle. I only want you.”\n He forces the saddest smile I’ve ever seen on a human. He pulls me to him and holds me there. I wrap my arms around him as tight as I can as he presses his lips to the side of my head.\n “I love you, Lily. God, I love you.”\n I squeeze him tight, pressing a kiss to his shoulder. “I love you, too.”\n I close my eyes and wish I could wash away the entire last two days.\n Atlas is wrong about Ryle.\n I just wish Atlas knew he was wrong.\n Chapter Sixteen\n “I mean . . . I’m not trying to be selfish, but you didn’t taste the dessert, Lily.” Allysa groans. “Oh, it was sooo good.”\n “We’re never going back there,” I say to her.\n She stomps her foot like a little kid. “But . . .”\n “Nope. We have to respect your brother’s feelings.”\n She folds her arms over her chest. “I know, I know. Why did you have to be a hormonal teenager and fall in love with the best chef in Boston?”\n “He wasn’t a chef when I knew him.”\n “Whatever,” she says. She walks out of my office and closes the door.\n My phone buzzes with an incoming text.\n Ryle: 5 hours down. About 5 more to go. So far so good. Hand is great.\n I sigh, relieved. I wasn’t sure if he’d be able to do the surgery today, but knowing how much he was looking forward to it makes me happy for him.\n Me: Steadiest hands in all of Boston.\n I open my laptop and check my email. The first thing I see is an inquiry from the Boston Globe. I open it and it’s from a journalist interested in running an article about the store. I grin like an idiot and start emailing her back when Allysa knocks on the door. She opens it and sticks her head in.\n “Hey,” she says.\n “Hey,” I say back.\n She taps her fingers on the doorframe. “Remember a few minutes ago when you told me I could never go back to Bib’s because it’s unfair to Ryle that the boy you loved when you were a teenager is the owner?” \n","sourceLink":"https://allnovel.net/it-ends-with-us/page-56.html","bookId":1823,"book":{"id":1823,"title":"It Ends with Us","description":"Storyline: \n Instant New York Times Bestseller \n The newest, highly anticipated novel from beloved #1 New York Times bestselling author, Colleen Hoover. \n Sometimes it is the one who loves you who hurts you the most. \n Lily hasn’t always had it easy, but that’s never stopped her from working hard for the life she wants. She’s come a long way from the small town in Maine where she grew up—she graduated from college, moved to Boston, and started her own business. So when she feels a spark with a gorgeous neurosurgeon named Ryle Kincaid, everything in Lily’s life suddenly seems almost too good to be true. \n Ryle is assertive, stubborn, maybe even a little arrogant. He’s also sensitive, brilliant, and has a total soft spot for Lily. And the way he looks in scrubs certainly doesn’t hurt. Lily can’t get him out of her head. But Ryle’s complete aversion to relationships is disturbing. Even as Lily finds herself becoming the exception to his “no dating” rule, she can’t help but wonder what made him that way in the first place. \n As questions about her new relationship overwhelm her, so do thoughts of Atlas Corrigan—her first love and a link to the past she left behind. He was her kindred spirit, her protector. When Atlas suddenly reappears, everything Lily has built with Ryle is threatened.\n \n","cover":"https://allnovel.net/images/it-ends-with-us.jpg","author":"Colleen Hoover","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/it-ends-with-us.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:20:39 PM"}}
