{"id":87605,"no":59,"title":"Page 59","content":"“It’s your birthday,” he said. “And you’re still my favorite person. And I’ve missed you.” It was probably no later than ten o’clock when he got there, but we talked so much, I remember it was after midnight the next time I looked at the clock. I can’t even remember what all we talked about, but I do remember how I felt. He seemed so happy and there was a light in his eyes that I’d never seen there before. Like he’d finally found his home. He said he wanted to tell me something and his voice grew serious. He readjusted me so that I was straddling his lap, because he wanted me to look him in the eyes when he told me. I was thinking maybe he was about to tell me he had a girlfriend or that he was leaving even sooner for the military. But what he said next shocked me. He said the first night he went to that old house, he wasn’t there because he needed a place to stay. He went there to kill himself. My hands went up to my mouth because I had no idea things had gotten that bad for him. So bad that he didn’t even want to live anymore. “I hope you never know what it’s like to feel that lonely, Lily,” he said. He went on to tell me that the first night he was at that house, he was sitting in the living room floor with a razor blade to his wrist. Right when he was about to use it, my bedroom light went on. “You were standing there like an angel, backlit by the light of heaven,” he said. “I couldn’t take my eyes off you.” He watched me walk around my bedroom for a while. Watched me lie on the bed and write in my journal. And he put down the razor blade because he said it’d been a month since life had given him any sort of feeling at all, and looking at me gave him a little bit of feeling. Enough to not be numb enough to end things that night. Then a day or two later is when I took him the food and set it on his back porch. I guess you already know the rest of that story. “You saved my life, Lily,” he said to me. “And you weren’t even trying.” He leaned forward and kissed that spot between my shoulder and my neck that he always kisses. I liked that he did it again. I don’t like much about my body, but that spot on my collarbone has become my favorite part of me. He took my hands in his and told me he was leaving sooner than he planned for the military, but that he couldn’t leave without telling me thank you. He told me he’d be gone for four years and that the last thing he wanted for me was to be a sixteen-year-old girl not living my life because of a boyfriend I never got to see or hear from. The next thing he said made his blue eyes tear up until they looked clear. He said, “Lily. Life is a funny thing. We only get so many years to live it, so we have to do everything we can to make sure those years are as full as they can be. We shouldn’t waste time on things that might happen someday, or maybe even never.” I knew what he was saying. That he was leaving for the military and he didn’t want me to hold on to him while he was gone. He wasn’t really breaking up with me because we weren’t ever really together. We’d just been two people who helped each other when we needed it and got our hearts fused together along the way. It was hard, being let go by someone who had never really grabbed hold of me completely in the first place. In all the time we’ve spent together, I think we both sort of knew this wasn’t a forever thing. I’m not sure why, because I could easily love him that way. I think maybe under normal circumstances, if we were together like typical teenagers and he had an average life with a home, we could be that kind of couple. The kind who comes together so easily and never experiences a life where cruelty sometimes intercepts. I didn’t even try to get him to change his mind that night. I feel like we have the kind of connection that even the fires of hell couldn’t sever. I feel like he could go spend his time in the military and I’ll spend my years being a teenager and then it will all fall back into place when the timing is right. “I’m going to make a promise to you,” he said. “When my life is good enough for you to be a part of it, I’ll come find you. But I don’t want you to wait around for me, because that might never happen.” I didn’t like that promise, because it meant one of two things. Either he thought he might never make it out of the military alive, or he didn’t think his life would ever be good enough for me. His life was already good enough for me, but I nodded my head and forced a smile. “If you don’t come back for me, I’ll come for you. And it won’t be pretty, Atlas Corrigan.” He laughed at my threat. “Well, it won’t be too hard to find me. You know exactly where I’ll be.” I smiled. “Where everything is better.” He smiled back. “In Boston.” And then he kissed me. Ellen, I know you’re an adult and know all about what comes next, but I still don’t feel comfortable telling you what happened over those next couple of hours. Let’s just say we both kissed a lot. We both laughed a lot. We both loved a lot. We both breathed a lot. A lot. And we both had to cover our mouths and be as quiet and still as we could so we wouldn’t get caught. When we were finished, he held me against him, skin to skin, hand to heart. He kissed me and looked straight in my eyes. “I love you, Lily. Everything you are. I love you.” I know those words get thrown around a lot, especially by teenagers. A lot of times prematurely and without much merit. But when he said them to me, I knew he wasn’t saying it like he was in love with me. It wasn’t that kind of “I love you.”","sourceLink":"https://allnovel.net/it-ends-with-us/page-59.html","bookId":1823,"book":{"id":1823,"title":"It Ends with Us","description":"Storyline: Instant New York Times Bestseller The newest, highly anticipated novel from beloved #1 New York Times bestselling author, Colleen Hoover. Sometimes it is the one who loves you who hurts you the most. Lily hasn’t always had it easy, but that’s never stopped her from working hard for the life she wants. She’s come a long way from the small town in Maine where she grew up—she graduated from college, moved to Boston, and started her own business. So when she feels a spark with a gorgeous neurosurgeon named Ryle Kincaid, everything in Lily’s life suddenly seems almost too good to be true. Ryle is assertive, stubborn, maybe even a little arrogant. He’s also sensitive, brilliant, and has a total soft spot for Lily. And the way he looks in scrubs certainly doesn’t hurt. Lily can’t get him out of her head. But Ryle’s complete aversion to relationships is disturbing. Even as Lily finds herself becoming the exception to his “no dating” rule, she can’t help but wonder what made him that way in the first place. As questions about her new relationship overwhelm her, so do thoughts of Atlas Corrigan—her first love and a link to the past she left behind. He was her kindred spirit, her protector. When Atlas suddenly reappears, everything Lily has built with Ryle is threatened.","cover":"https://allnovel.net/images/it-ends-with-us.jpg","author":"Colleen Hoover","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/it-ends-with-us.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:20:39 PM"}}
