{"id":82174,"no":13,"title":"Page 13","content":"Which sucks because I’m out with my friend Tadd, a costar from School Pride, and he’s going back home to Chicago tomorrow. We meet for dinner and end up at the bar in his hotel after. “Seen anyone since May?” he asks once the waitress, who’s trying her damnedest to act like she doesn’t know who the two of us are, leaves our drinks. “Partied with Quinton once, and ran into Jenna at an awards show last month. She’s looking pretty hot.” Tadd pauses, his dirty martini halfway to his lips. “Dude, Jenna’s like sixteen.” “God, what the hel is it with everyone and the underage girl alert? I’m aware, okay?” I sigh, running a hand through my hair and reining in my temper. In light of the whole Gabriel e-Dori issue, I may be overreacting a bit. “Chil , dude—I’m not accusing you of anything.” Tadd leans up, elbows on the table. “I know you’re smarter than that.” He smirks. “As much of an asstard as you are in other matters.” I laugh and shake my head. “Emma, right?” “I was referring to the fact that you wrecked your car and almost kil ed yourself… but yeah, man, you screwed up your love life, too.” We’re silent for a minute, and I know he’s waiting for me to ask what he knows I’m going to ask. “Have you seen her?” He leans back, gives me a once-over like he’s gauging how much I can take. “We got together a couple of weeks ago in New York. She’s starting NYU in a few weeks, but she moved there last month. She and Graham, uh, didn’t want to be apart al summer.” I imagine the two of them together, waiting to feel wounded, but it’s not real y there. “So that whole thing is working out, I guess.” “So far, yeah.” Tadd takes a sip of the martini, checking my reaction through the pale fringe of a hair hanging perpetual y over his right eye. “I met up with both of them, actual y. They seem comfortable—like, they fit, you know? I can shut up now.” I shrug and shake my head. “No. I’m glad she’s happy.” Surprisingly, I realize I mean it. “So what about you, lover boy? Getting any from a regular source, or stil breaking hearts and bal s al over the country?” Tadd leans up again, his face earnest. “Dude, I met someone a month ago, and I’m so in love it’s not even funny. I’m like head over heels, first time ever. It’s sick.” “Al right, Thaddeus.” I put up my fist and he bumps it with his, beaming. “So who is he?” I lean up. “Are you about to out somebody? Cause if so, you know you can trust me.” “Nah, he’s an architect. So damned smart it blows my mind. Creative, gorgeous, funny, sexy…” He’s lost in his own thoughts for a couple of seconds. “Okay, okay, stop or I’m gonna have to consider going gay, man,” I say, and he laughs. “Dude—it’s al we can do to keep our hands off of each other in public. It’s always felt a little daring—al the covert stuff.” He shrugs. “I’ve never felt like this before. I want to hold his hand when we’re walking, or brush the hair out of his eyes when he’s got coffee in one hand and the dog’s leash in the other.” His mouth quirks up on one side again as he stares into his drink. “It’s different when you’re in love.” I think of al of the things I take for granted. I could grab a stranger, kiss her in public, and the worst anyone wil think or say is get a room. Tadd’s in love, but they can’t hold hands in most public places without worrying what someone might do or say. “Sucks to be you, man,” I say, and he makes like he’s gonna punch me in the arm. I flinch and spil part of my drink on the table. “Dude!” We’re both laughing when he says, “So what about you? We’re both laughing when he says, “So what about you? Anybody new?” I shake my head. “You don’t even want to know.” “Oh?” Both eyebrows angle up as he leans closer. “Oh, yes I do. I so do. Lay it on me, man. Is it that girl from the Habitat place?” Damned paparazzi. “That was just a clumsy girl fal ing off of a patio.” Out of nowhere I remember the fruit fal ing from the sky, so surreal. The feel of her in my arms as I caught her. Her face flaming as she struggled to move off of me. I almost made a smartass comment about her lack of grace, but she was already so humiliated that I couldn’t do it. I fol owed her inside instead. I don’t know what I expected. I sure didn’t expect to try to kiss her—that was completely spontaneous. When she ran her fingers across my scalp to search for stray bits of fruit, I had a sharp, three-second vision of her lying under me in my bed, her hands thrusting into my hair as I lean down to kiss her... “Earth to Reid.” Tadd’s voice is pure cynicism. I blink and look up and he shakes his head slowly. “Oh, yeah. There’s nothing going on there. Not at al .” Busted. “Yeah, wel , she’s not the slightest bit into me. I tried to kiss her and she objected in a resounding no-means-no sort of way. And then disappeared for the rest of the week.” Tadd smiles and holds his drink aloft towards me. “Here’s to chal enges, dude.” My friend may have a point. Maybe Dori’s just playing hard-to-get better than any girl I’ve ever met, and I’ve just gotten lazy. Dori, one. Reid, zero. But not for long. Dori Nick and I were planning to hang out tonight, but he’d forgotten his promise to watch his foster brothers while his parents take his foster sister to San Diego for a supervised visit with her birth mother. I assured him several times that I understood completely and was fine with the late cancel ation. Mom and Dad are out with friends. “Wel , Esther, it’s just you and me tonight,” I tel her, scratching gently behind her floppy spaniel ears, which are the only spaniel component on her. The rest of her is a curious mix of—as far as we can tel —golden retriever, shepherd, and possibly dachshund. She’s a true mutt. “Let’s make sandwiches.” I pul ingredients out of the fridge and pantry, and rol slices of deli turkey for her. Her tail tick-tocks gently side to side as I set the plate in front of her. “Need a pickle with that? No?” I ask as she gingerly lifts each rol and gobbles it down. She lies next to me on the sofa (an Esther no-no she gets away with when we’re alone) while I eat my pita sandwich and scrol through network TV options. Nothing looks interesting, so I browse the pay-per-view selections. I’m in the mood for something cute. No slashers, no thril ers, no buddy flicks. No historical drama or redemption-through-pain-and-or-suffering films. Especial y nothing that says profoundly moving or grab a hankie! in the description. “Here we go, Esther: ‘Trey begins his senior year at a new school with girls swooning for him, and jocks as friends. Things get complicated when he fal s for quiet, bookish Amanda, who becomes a social pariah after she rats out the footbal players’ cheating ring, half the first string fails English, and the team loses the big championship game.’” Esther turns on her side and lays her head on my leg. “I think we have a winner.” I click buy, press the play button and grab a handful of popcorn, thinking that I should be sad that Nick had to bail on me. That I didn’t have time to make plans with anyone else. That I’m spending my Saturday night alone. But I’m fine. I’m more than fine. The movie is everything I hoped for. Until about ten minutes in… when one of the random jocks turns out to be Reid. I gasp, and Esther raises her head sharply and looks at me, and then swivels around, looking for the unknown menace. I should have looked up his filmography on IMDb last night. Al I real y know of him are his last two, more major roles. This movie is almost three years old. His role is minor, and he spends most of his onscreen time in the background, but once I recognize him, I’m either watching him or waiting for him to show up again. The movie is an hour and fifty-seven minutes long, but it takes me nearly twice that to get al the way through it because I’m rewinding and replaying every moment he’s onscreen. In one party scene, several couples are in various states of making out. I spot Reid on the left side of the screen, sitting in a chair, kissing one of the cheerleader characters, who’s straddling him. Their mouths are fused, but I watch his hands—gripping her arms, sliding down to the smal of her back, holding her like he held me when I fel on him. I rewind the scene and watch it a third time. “Oh, fudge,” I whisper, and Esther looks at me and sighs. Chapter 17 REID Olaf is a beast. I don’t think my trainer expected me to stil be in decent shape, though I told him I’d been working construction for Habitat. Not a fan of bodybuilding through natural means, he employs weights, pul eys, rubber bands and medicine bal s to shape his clients. As far as Olaf is concerned, exercise is not painting, digging fence posts or swinging a sledgehammer to break up a 200 pound boulder. Exercise is done indoors, while a guy who could break you in two over his rock-hard quadriceps provides motivation like, “What do you want to be when you grow up? A girl?” I think I pissed him off, flaunting my organical y maintained muscle tone. I should have feigned weakness. Once he saw that I was primed for what he had planned, he stepped up the pain factor by several notches in what I can only assume was an attempt to kil me, so he could resuscitate me and kil me again. I went out with John last night— not the best idea after a session with Olaf—and crashed on his sofa around two a.m. I hear him snoring from the bedroom, the sound on exhale a cross between the horn on a semi and a walrus’s mating cal . I have no idea what time it is, but judging by the light, it’s not quite noon. Every muscle in my body is aching, my head is throbbing, and I have no one to blame but myself. And possibly John, because I can. I shuffle into his kitchen to make coffee… but there isn’t any. Awesome. There’s also nothing in the fridge but beer, a mostly empty tub of margarine, and questionable takeout boxes of sweet and sour chicken and beef with cashews. No milk. No juice. The pantry boasts a box of stale cereal and an equal y stale bag of corn chips. The kitchen in this place is state-of-the-art, and this is al the food it has to offer? Sad. Starving, I have no choice but to shower and go out in search of food. John and I are close enough to the same size that I can borrow a t-shirt and shorts, though ten to one there’s something of mine in his closet that I can just reclaim. There’s a bagel place a few doors down from John’s building. I want bagels and cream cheese, but Olaf is determined to pump up the muscle I’ve got and reduce me to near-zero percent body fat. A compromise is in order— bagels and lox. Lox has protein, right? Going out without a bodyguard or a car is always tricky. Fans in LA or NYC are much less likely to mob celebrities, but it’s far from unheard of, and the paparazzi are always on the lookout. I grab my sunglasses and a hat (Lakers—","sourceLink":"https://allnovel.net/good-for-you-between-the-lines-3/page-13.html","bookId":2741,"book":{"id":2741,"title":"Good For You (Between the Lines #3)","description":"Storyline: Good For You (Between the Lines #3) Reid Alexander\u0027s celebrity life is an open book. Every relationship, every error in judgment is analyzed by strangers. His latest mistake totaled his car, destroyed a house and landed him in the hospital. As his PR team works overtime to salvage his image, one thing is clear—this is one predicament he won’t escape without paying for it. Dori Cantrell is a genuine humanitarian—the outward opposite of everything Reid represents. When his DUI plea bargain lands him under her community service supervision, she proves unimpressed with his status and indifferent to his proximity, and he soon wants nothing more than to knock her off of her pedestal and prove she\u0027s human. Counting the days until his month of service ends, Dori struggles to ignore Reid’s wicked pull while challenging him to recognize his own wasted potential. But Dori has secrets of her own, safely locked away until one night turns her entire world upside down. Suddenly their only hope for connection and redemption hinges on one choice: whether or not to have faith in each other.","cover":"https://allnovel.net/images/good-for-you-between-the-lines-3.jpg","author":"Tammara Webber","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/good-for-you-between-the-lines-3.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:40:43 PM"}}
