{"id":82200,"no":39,"title":"Page 39","content":"When it’s clear I’m not going to offer any more, Nick inclines his head and shifts his eyes to his mug. “Just, you know, proceed with caution. He’s not exactly in our league.” He bobs the teabag restlessly. “I don’t want you to get hurt.\n You’re vulnerable right now.”\n I know he’s right, and I’m sliding headlong into something that can’t end wel . Avoiding his gaze, I promise,\n “I’l be careful,” and just like that, I’m official y lying to everyone I know. Everyone except Reid.\n Chapter 43\n REID\n “If you close your eyes, you won’t know if he’s dead yet,” I say.\n Dori’s hammering away on the control er, click-click-clack-clack-clack, hacking the thing on the life-sized screen until it’s a bloody pulp. “But it’s disgusting.” We’re in the media room where I sit on the sofa with her cross-legged on the floor between my knees. My guy is already dead, so I’m just watching her. For a former non-gamer girl, she’s a remarkably quick learner. “Eww eww eww,” she says.\n Squeamish, but quick.\n “I’m pretty sure you’ve kil ed him.” She flashes me a sideways look and I grin, one palm up— what?—and then she chops the thing one more time.\n “I just want to make sure.”\n “And I want to make sure you’re on my team if demonic predators ever attack earth.”\n My phone buzzes with a text from Dad: Come to my study when you have a minute.\n He never puts in an appearance to my side of the house to speak with me—I always get a text summons to his office. Once, I was away on location and he sent one requesting tax receipts. I took great satisfaction in replying that I wasn’t in the house, or LA, or California for that matter. He prides himself on being a detail guy, but he didn’t notice his only kid was out of town? Pretty sure he lost out on Father of the Year for that.\n “I’ve gotta go talk to Dad about something. Back in a sec.” Dori nods without looking at me, alternating between staring at the action onscreen and squeezing her eyes shut\n —every single time she’s kil ing something. It’s so cute that I can’t resist leaning forward, pul ing her hair away from her neck and running the tip of my tongue along the bumpy vertebrae, nibbling the smooth skin.\n “Mmm.” Her arms go a little slack and her eyes drift closed. Her avatar is going to get slaughtered thanks to me. “You’re distracting me, Reid. You’re going to get me kil ed.” I chuckle and she shrieks, hunching her shoulders.\n “No tickling!”\n “I didn’t mean to.” I lean around, turn her face towards me and kiss her, and she forgets to hit pause before dropping the control er into her lap—such a girl. Judging by the sounds roaring from the speakers, she’s dying a quick bloody death, but she doesn’t seem to care.\n “You didn’t mean to tickle me, or you didn’t mean to kil me?” Her voice is a breathy whisper into my mouth.\n I kiss her again before saying, “Neither. I was trying to distract you, though. To see if I could break through your bloodlust.”\n Something flashes through her eyes, so quickly I almost miss it. “Mission accomplished,” she murmurs.\n “Hmm. What was that look for?” She shakes her head, her ears pink. My arms surround her and I fold over her like a tent. “Was it because I said—” I lower my voice “— lust?” Her skin darkens under the dusting of freckles across her cheeks. “Is that what you’re feeling for me?” I hold her face steady, kissing the corner of her mouth, preventing her from turning her head and fusing our lips together—not yet. “I feel so used.” I run my tongue along her lower lip and she gasps. “Good thing I’m total y okay with that, huh?” When I kiss her this time, her head fal s back against my thigh, her torso twisted as her hands reach for me. Winning her desire is like nothing I’ve ever accomplished. The pathway to it was proving that I’m worthy of her trust, and somehow, I’ve done that. She was indifferent to everything that usual y matters to people in my experience. A bolt of panic shoots through me when I realize I don’t even know what it was that earned her confidence.\n My phone rings, startling us both. While my jaw clenches, she jumps and pul s away as though someone has walked into the room and caught us kissing. As though we don’t have every right to do so, the rest of the world be damned.\n It’s Dad. “Yeah?”\n “Are you home? I thought I saw your friend’s car outside…”\n I am not discussing Dori with him.\n “I’m on my way down. It’s a big house.”\n “I just need a signature on a court doc.”\n “Sure. Be right there.” I hang up, and Dori is saving and signing off of her failed demon-exterminating mission—the one I wrecked. I can’t be sorry for wrecking it. “You can restart the level, you know.”\n She smiles. “Maybe next time. I’ve sort of lost interest in, um, bloodlust.”\n I’m biting back the licentious replies pouring through my brain because I’ve already exceeded my daily quota for inciting mad flushes to scurry across her skin. “We have time to watch a movie. I won’t be long—he just needs me to sign something.” I hate giving up even ten minutes with her, a fact that should alarm me, but doesn’t.\n When I get to Dad’s office, he presents a pen and a document with an X at the bottom, my ful named typed under the line that needs my signature. “Once this is recorded, you’l have completed the initial probationary requirements of your sentence.” I scrawl my name as his words sink in.\n “My license suspension?” I feel like it’s been years since I drove a car, as opposed to six months.\n He sighs, taking the pen, pushing the signed document into an envelope. “The suspension terminates on the twentieth, though this is a permanent strike against you that will be counted if you repeat the offense. Assuming you don’t just get yourself kil ed next time.” He eyes me. “I’m sure you know—but I’l say it regardless—that I’d prefer you not to drive at al .”\n I hear the implication that there wil be a next time, and I hear the implication that there wil be a next time, and that I, like my mother, should be safeguarded against the combination of alcohol and vehicles. I subdue the resentment threatening to strangle me. “If I choose to drink, I won’t drive. I’ve learned my lesson.”\n His expression is rigid, discontented with my admission that I don’t intend to give up drinking, thankful that at least I’m agreeing to sidestep driving if I do. Puffing out a sigh, he says, “I guess if that’s al the reassurance I’l get, I have to accept it.” He stares for a moment, and just when I’m about to turn and leave, he asks, “So who’s the girl?” Answers skip unspoken across my tongue. The girl upstairs now? The girl I was just kissing like a boy who hasn’t screwed so many hot girls in the past five years that there’s no hope of remembering the vast majority of them?\n “What girl?”\n His sardonic expression is a replica of mine, or vice versa. “The girl who drives the ten year old Honda parked in the driveway several nights a week for the past month or so.” Dad has never been good at playing along.\n “Dori.”\n His eyebrows jump. “The Habitat girl? The Berkeley girl?”\n How the hell does he remember these details? It’s as remarkable as it is grating. “Yes, but she didn’t—hasn’t started at Berkeley yet.”\n “Oh?”\n There’s that predictable disdain in his tone, and I can’t resist quashing it. He assumes everyone associated with me is dissolute and aimless, his prime (and favorite) example being John. “Her sister had an accident right before she was supposed to start. Closed head injury. Dori postponed col ege to be around for her family.”\n “That’s… accommodating of her,” he says. I’m too familiar with his condescension to pretend I don’t hear it.\n His assumption of her possible motives for the deferral is infuriating.\n “No, Dad, that’s selfless and devoted. Traits the Alexander gene apparently lacks.”\n He looks like I’ve just gut-punched him, which is less gratifying than I’d thought it would be. Shuffling papers on his desk, he switches gears. “I assume you’l be purchasing another car shortly. If you’l let me know an approximate price range, I’l pul funds from your investments so they’l be available.”\n “Sure. We done?”\n Straightening and stacking, he says, “Yes. I suppose so.”\n Running a hand through my hair, I wish I could reel back the implication that he’s unsupportive. John is studying finance against his wil . Dori is being forced to lie to her parents just to see me. Celebs with exploitive parents are a dime a dozen. He could be so much worse. Maybe that isn’t the best parental commendation, but maybe it is. Shit.\n Shit.\n “So, thanks for handling everything.”\n Visibly stunned, his hands stil as he looks at me. “You’re welcome.”\n I nod, he nods, and I leave before I examine this new consciousness any more closely.\n Dori\n Reid’s mother just left the room after a conversation that awakened, for a moment, my aspiration to study social work. I’ve spent the past several months emotional y detached from the volunteer work I continue to do, as though an impenetrable wal stands between me and the joy I once felt when I believed that what I did mattered.\n “Am I intruding?” she said from the doorway.\n I stood, conscious of the banter regarding lust and the suspended make-out session I’d just had with her son.\n “No.” I felt myself blushing. “This is your home, after al .” She smiled. “I try not to encroach on Reid’s part of it. In al honesty, though, I noticed him leaving and I wanted to talk to you, if that’s al right.”\n “Of course,” I said, annoyed with my monosyl abic vocabulary, apprehensive about what Reid’s mother could possibly want with me.\n When she perched on the sofa where Reid had been minutes prior, I sat back down, mul ing over my parents’\n judgment of him and wondering if I was about to be measured by his mother in the same prejudicial way.\n “I don’t mean to make you uncomfortable—Dori, wasn’t it?” I nodded, holding my breath. “Reid hasn’t brought anyone home in so long.” This couldn’t be true, based on his wel -known exploits, but mentioning that would do neither of us any good, aside from the fact that I’d rather not contemplate it at al . “You said you and he are—friends?” I nodded again, my gaze darting away and then back. I tried to keep the eye contact steady, knowing that avoiding her eyes would just make me look guiltier. “Yes.” We’d not declared ourselves to be anything else or anything more.\n Reckless, my conscience muttered, that’s what we are together. The blush returned with a vengeance. \n","sourceLink":"https://allnovel.net/good-for-you-between-the-lines-3/page-39.html","bookId":2741,"book":{"id":2741,"title":"Good For You (Between the Lines #3)","description":"Storyline: \n Good For You (Between the Lines #3) \n Reid Alexander\u0027s celebrity life is an open book. Every relationship, every error in judgment is analyzed by strangers. His latest mistake totaled his car, destroyed a house and landed him in the hospital. As his PR team works overtime to salvage his image, one thing is clear—this is one predicament he won’t escape without paying for it. \n Dori Cantrell is a genuine humanitarian—the outward opposite of everything Reid represents. When his DUI plea bargain lands him under her community service supervision, she proves unimpressed with his status and indifferent to his proximity, and he soon wants nothing more than to knock her off of her pedestal and prove she\u0027s human. \n Counting the days until his month of service ends, Dori struggles to ignore Reid’s wicked pull while challenging him to recognize his own wasted potential. But Dori has secrets of her own, safely locked away until one night turns her entire world upside down. Suddenly their only hope for connection and redemption hinges on one choice: whether or not to have faith in each other.\n \n","cover":"https://allnovel.net/images/good-for-you-between-the-lines-3.jpg","author":"Tammara Webber","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/good-for-you-between-the-lines-3.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:40:43 PM"}}
