{"id":82206,"no":45,"title":"Page 45","content":"“Popsicles,” I mutter, staring at the search engine results. There are a lot of guys named Chad Roberts in the world, and none of them are directly connected to Reid Alexander. I don’t have time to do a more thorough search now. I have to be at the new Habitat project in twenty minutes—we’re restoring two foreclosed homes in the same neighborhood this time, with the help of an entire group of celebrities, apparently.\n Oh, joy.\n Chapter 48\n REID\n Dori is facing away, standing in the center of a room so similar to that first room we painted together that we could have been transported back in time. She’s humming while examining the spec sheet and wearing the same familiar shorts and construction boots with her faded M.A.D.D. tshirt. Ponytailed, her hair hangs down the center of her back. Buckets of paint and painting implements are spread across the tarp in the center of the room.\n Everything would be déjà vu except for this—I know how soft her hair feels when I push my fingers through it, and how it looks loose around her shoulders or flowing over my pil ow while she sleeps. I know her scent, like something sweet and edible, an observation I whispered months ago when I wanted nothing more than to make her shiver from wanting me. I know her muscular shoulders and arms, her soft breasts. I know the feel of the tiny silver ring in her navel, its single heart-shaped charm brushing against the tip of my tongue. I know the firm curve of her waist, the smooth flare of her hip, the taste of her mouth. I know the feel of her losing control against me and trusting me to catch her when she comes apart.\n Even stil , there’s more to this complex girl, and the physical craving I feel for her is merely an index to the rest of it. I know her patience, her kindness, her inherent desire to leave the world a better place than she found it. I’ve felt her forgiveness, her strength, and her ability to see something good in anyone. The whole of her is overwhelming, and the fact that I may have found her only to lose her scares the hel out of me.\n Having sensed my presence in the room behind her, she raises her head from the paperwork in her hands. Turning slowly, her eyes connect with mine and widen, and she blinks in disbelief. My heart slams against my ribs, daring me to close the distance between us.\n “Hey, boss,” I say. We’re standing ten feet apart and I want to know if she’s experiencing the same gravitational pul towards me that I’m feeling towards her. Her eyes are black from this distance, and I stare at her lips, her ears, her hands that stil hold the specs—they’re shaking. That tremor is for me, though I know better than to feel infal ible because of it.\n “Reid?” Her voice almost undoes me, speaking my name. I have this injudicious urge to do whatever the present-day equivalent is of grabbing her up, tossing her over my shoulder and finding a cave to make her mine. My hands clench and she notices.\n “I heard you need an experienced painter in here.” I lower my chin and stare into her eyes. “And I think I’m your man.” Her breath catches as I move closer. “Just so you know—I don’t believe in going halfway. I won’t quit until the job’s been performed to your complete satisfaction.” Her lower lip trembles and she sucks it into her mouth just enough to catch it with her teeth. “What then?” she asks. “When everything is done?”\n Careful y, I touch my fingers under her chin and her lips open, her breath hitching again as she looks up at me.\n “Then I start over, yeah? No such thing as ‘done.’” Her eyes slide down and she steps back, and I drop my hand. “Y-you can paint this room, and I’l do the other.”\n “Whatever you want,” I say, and she nods and leaves the room at an almost-run. When she’s gone I release a pent-up breath.\n Round One, tied? This is going to kil me.\n Two photographers and a reporter from People have been assigned to this goodwil story. The public loves to see celebs acting like regular, generous people (who remain natural y beautiful while performing charitable acts, of course). Fans don’t see the schedule interruptions we impose on said charitable project due to our lighting prep and rearrangement, or the makeup crew, or the video camera getting a few short takes for the online mag. The positive side is less paparazzi outside, since sanctioned photographers al owed up close—with an authorized story\n —trump any photo someone could nab from a distance, even with the finest in telephoto lenses at their disposal.\n Just before lunch break, I’m alone and wondering if Dori wil be the one to retrieve me when my costar appears in wil be the one to retrieve me when my costar appears in the doorway. “Hey, sexy,” Chelsea says, slinking across the room in her white shorts and cherry red tank, her hair in a messy updo, cascading perfectly around her flawless face.\n “Ooh, look at you!” She turns a little pirouette mid-room, admiring my work. “You’re harboring some wicked DIY\n skil s behind that pretty face and those buff biceps. Who’d have thought?”\n “Who indeed,” I say, automatical y posing for the cameraman who fol owed her in—ful awareness of which side I’m presenting, al wide smiles and exaggerated laughter. I\u0027m looking at Chelsea and not the camera, like we’re alone in the room. We do a few shots with me recreating rol ing mint green paint on a wal , though I’ve already finished the first coat, including the patching, priming and cutting in top and bottom. There’s not so much as a swipe of green on the ceiling or the floorboards, either.\n As though I invoked her, Dori stands in the doorway the next time I glance up, taking in the room, the cameraman, the fact that Chelsea is hamming it up, holding a brush tipped in green paint and pretending to dab it on my nose. I take Chelsea’s wrist and move the paintbrush away as Dori whirls and disappears. I cal her name, but she’s gone.\n Chelsea takes al of this in with wide green eyes and I rol mine when she says, “Is that the Dori?” And then I squint at her. “Wait. How do you know\n — Chad. Dammit, Chelsea. What the hel happened to attorney-client privilege?”\n “He didn’t say a thing to me, I swear!” She holds up one hand and pantomimes placing the other on a bible. “I just, you know, see things on his desk occasional y…” Her fingers wrap around my arm and she whispers frantical y.\n “Reid, please don’t tel him. Oh, God, I would be in so much trouble. I swear I haven’t told anyone anything and he’s not discussed a thing with me.”\n I sigh and examine her face. Chelsea is a girl who absorbs gossip. She loves it but doesn’t spread it unless it’s common knowledge. “Fine. But leave it alone.” She locks her lips and tosses an invisible key behind her, nodding.\n “Come on, gossip girl, let’s go find your husband and get something to eat.”\n Dori\n Every time I convince myself I’l never see Reid again, he turns up. Roberta straightens every item on her desk and avoids my gaze while pretending she’d forgotten that Reid was one of the celeb volunteers. The two red spots on her cheeks beg to differ. “And anyway,” her brows crinkle, “I was under the impression you two were friendly.” Now it’s my turn to be visibly flustered, and with my darned ears ful y exposed, too. What can I say? My parents don’t want me dating a Hollywood heartthrob who’ll just use and discard me, or how about I told him I couldn’t see him anymore and he couldn’t comply fast enough, and now I haven’t seen him in a month and I didn’t think I’d ever have to be this near him again.\n When I continue to stand there, silent and disconcerted, she misinterprets my uneasiness as repulsion. “We’l find you a different project to work on. They’l only be here this week. You can come back next week. I’l just cal —”\n “No, I’l be fine.” She thinks I dislike Reid, when nothing could be further from the truth.\n When I saw him this morning, I wanted to run across the room and throw my arms around him and not let go. I wanted to tel him I would take whatever he could give me, however long it lasts. That’s when I recal ed the Janis Joplin quote Deb taped to her bedroom mirror years ago: Don’t compromise yourself. You are all you’ve got.\n And then he said, “Hey boss.” So glib and casual and over whatever had been there between us. Whatever I’d imagined was there. The other stuff, the flirting, that was just classic Reid—sexy and effortlessly seductive. And replicated with his stunning costar ten minutes ago.\n Maybe I should switch projects. Be smart and bolt while I can.\n “He’s got enough experience to be given specific tasks, so you won’t have to supervise him or even be near him,” Roberta says.\n Fighting the urge to tel her she’s got it al backwards, I nod and slip out back to get something to eat. I don’t look around the yard for him, and don’t intend to remain outside any longer than it takes to gather lunch and go back inside.\n As luck would have it, what I grab is a bowl of fruit and an iced tea, and my ears go hot remembering the first time Reid tried to kiss me, when I shoved him away. I’m Reid tried to kiss me, when I shoved him away. I’m conscious of someone speaking nearby, hearing the name before I’m ful y paying attention. “…Chad Roberts, and despite my good looks, I’m not an actor. I’m just Chelsea’s husband.”\n Frank laughs in response. “That is not a position to be taken lightly, young man. That girl is a firecracker.”\n “Oh, don’t I know it!” They both laugh.\n My head is spinning.\n Chad Roberts.\n Chelsea Radin’s husband.\n The same name of the attorney in charge of Deb’s trust.\n “Mr. Roberts? Could I speak with you a moment, please?”\n “Certainly.” He seems genial, and he is good-looking.\n I’ve had a hard time catching him separated from Chelsea’s side. He and his actress wife are obviously friends with Reid, and I’ve concluded that what I thought was flirting between Reid and Chelsea earlier was just the two of them play-acting for the photo shoot People is doing that wil benefit both Habitat and the opening weekend of their movie.\n Jealousy is an unpleasant, alien sensation.\n We walk a few feet from the demolition site—Chad has been helping Frank take down a dilapidated shed in the back yard. “This may be an odd question, but by any chance… are you an attorney?”\n “Yes, I am.” He gives me a perplexed look. “Do you need legal assistance?”\n This is too bizarre to be coincidence. “No. Maybe. Um.\n Do you work for Barnes, Bancroft and Cole?” He pul s the work gloves from his hands and takes the water bottle I hand him. “Yes, I do.”\n I take a deep breath as al the dots connect. This has to link to Reid. There’s no other explanation.\n After a long drink, he peers at me. “What is this in relation—”\n “There’s a trust that you administer, I think. It’s for Deborah Cantrel ?”\n His eyes flick towards the house, where Reid is, then right back to me, like he realizes he’s giving something away. “Um, yes, that’s true.” \n","sourceLink":"https://allnovel.net/good-for-you-between-the-lines-3/page-45.html","bookId":2741,"book":{"id":2741,"title":"Good For You (Between the Lines #3)","description":"Storyline: \n Good For You (Between the Lines #3) \n Reid Alexander\u0027s celebrity life is an open book. Every relationship, every error in judgment is analyzed by strangers. His latest mistake totaled his car, destroyed a house and landed him in the hospital. As his PR team works overtime to salvage his image, one thing is clear—this is one predicament he won’t escape without paying for it. \n Dori Cantrell is a genuine humanitarian—the outward opposite of everything Reid represents. When his DUI plea bargain lands him under her community service supervision, she proves unimpressed with his status and indifferent to his proximity, and he soon wants nothing more than to knock her off of her pedestal and prove she\u0027s human. \n Counting the days until his month of service ends, Dori struggles to ignore Reid’s wicked pull while challenging him to recognize his own wasted potential. But Dori has secrets of her own, safely locked away until one night turns her entire world upside down. Suddenly their only hope for connection and redemption hinges on one choice: whether or not to have faith in each other.\n \n","cover":"https://allnovel.net/images/good-for-you-between-the-lines-3.jpg","author":"Tammara Webber","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/good-for-you-between-the-lines-3.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:40:43 PM"}}
