{"id":85890,"no":10,"title":"Page 10","content":"THERE WERE SHOUTS to hurry the buckets. another wagon pulled up, carrying two barrels full of water, and instantly a man climbed up beside the barrels and began to fill the buckets that were offered to him. Then, moving rapidly, he returned each bucket to the line of men to be passed along until the water was thrown upon the flames. It was clear to Matthew and the other onlookers, however, that the buckets were no match against a wind-tossed fire; the structure was already almost eaten by the flames, and would soon be beyond all redemption. Matthew thought that nearly all of Fount Royal\u0027s citizens had been roused by the watchman\u0027s cries, and had come to Truth Street to either help the line of firemen or watch the flames do their work. Most of them had come to the scene as had Matthew and Bidwell: still clad in their nightshirts, with hurriedly donned trousers and shoes, or in the case of the women, robes and cloaks over their night apparel. Matthew had run upstairs, put on his breeches, and then gone to awaken the magistrate but heard the awesome snoring before he\u0027d reached the door. Not even the cries of the crowd nor the alarm bell had pierced Woodward\u0027s sleep, though as the shutters were surely closed in his room the sounds would not have overcome his own nasal rhapsody. Therefore Matthew had decided not to take the time to hammer at his door, but had instead run down the stairs to follow Bidwell. The heat was ferocious, the wind whipping the fire into a frenzy. It was now the zenith of irony, Matthew realized. Though thunder still rumbled and lightning flashed over the sea, this time the clouds hadn\u0027t opened above Fount Royal. He knew that Bid-well would wish for a downpour to smother this conflagration, but it was not to be. The farmhouse - the very same deserted farmhouse upon which three crows had been sitting the previous morning as Matthew and Woodward had paused to talk - was doomed. But there wasn\u0027t much danger of the fire spreading. Certainly the firemen knew it, which was why they had formed only a single line instead of a double or triple. Yesterday\u0027s torrential rain had soaked the occupied house that stood opposite a split-rail fence from the burning structure, and other houses - and the gaol, as well - were distant enough from the flying embers. It was a fierce fire in appearance and it was gnawing down its victim quickly, but it would not leap to any other roof. Which had started Matthew thinking. Everything had been so thoroughly wet; how had this fire startedi a lightning strike, perhapsi He wasn\u0027t sure if even lightning had the power to burn drenched wood. No, the fire had to have begun inside the house. Even so, howi \"That one\u0027s gone,\" a man said, standing to Matthew\u0027s right. Matthew glanced at the speaker. He was a tall, slim man wearing a brown cloak and a woolen cap. It took Matthew a few seconds to register the man\u0027s face: a long, aristocratic nose and lofty forehead, narrowed and reserved dark blue eyes. Without his white wig, his face powder, and rouge the schoolmaster looked - at least at first glance - a different person altogether. But Johnstone leaned on his twisted cane with its ivory handle, the flames daubing his face red and orange. \"It was William Bryerson\u0027s house,\" he said. \"His two sons used to come to school.\" \"When did the family leavei\" \"Oh, William didn\u0027t leave. He lies in the cemetery yonder. But his widow took the boys and they left ... I suppose it was early last year.\" Johnstone turned his gaze upon Matthew. \"I understand your magistrate is beginning his interviews tomorrowi\" \"Yes, sir.\" \"I heard so from Mr. Winston. I also heard that you got into some trouble with Seth Hazeltoni\" Matthew nodded. \"Talk is a great currency in this town,\" Johnstone said. \"Everyone knows everyone else\u0027s business. But you happened to have stumbled onto a secret, is that correcti\" \"Who told you thisi\" \"Winston, again. Mr. Bidwell confides everything in him. He visits me of an afternoon. We play a few hands of all fours and a game or two of chess, after which I am completely educated as to current events.\" He stared at the burning house again. Bidwell was shouting orders, trying to get more barrels of water to the scene, but the energy of the firemen was dwindling. \"You\u0027re going to spend three days in the gaol and receive three lashes, I understand.\" \"Correct.\" \"and the interviews are to be held in the gaoli That will be a novel setting.\" \"It was on Mr. Bidwell\u0027s request.\" \"Mr. Bidwell,\" Johnstone said, his face showing not a shade of emotion, \"is a bastard hungry for coin, young man. He presents himself as an altruistic gentleman, concerned for the future of safe shipping to this colony, when indeed his one single goal is the further stuffing of his pockets. and for that purpose he will have Rachel Howarth executed.\" \"He believes she\u0027s a witch.\" Matthew paused a few seconds. \"Don\u0027t youi\" Johnstone gave a faint half-smile. \"Do youi\" \"It remains to be seen.\" \"ah, diplomacy in action. It\u0027s to be commended in this day and age, but I\u0027d request a more honest answer.\" Matthew was silent, not knowing what more he should reveal. \"The magistrate,\" Johnstone said, looking around. \"Where is hei\" \"I left him asleep at the house. He\u0027s not easily awakened.\" \"Evidently not. Well, since he\u0027s not within earshot, I\u0027d like to know what you honestly think about Rachel Howarth.\" \"It would be betraying my office, sir.\" Johnstone thought about that for a moment, and then nodded. He tilted his head to one side, intently watching the fire. \"Thank you; you\u0027ve told me what I needed to know. I assumed you were an educated young man, freed from the bondage of ancient thinking. You have your doubts about witchcraft, as I do. Rachel Howarth is in a cage because of several reasons, not the least of which being she is a beautiful woman and threatens the sensibilities of the more portly cows in this town. Her Portuguese blood is also a mark against her. Too close to being a Spaniard. add to that the fact that Daniel Howarth was a man of Bidwell\u0027s stripe, without his charm. He had enemies here, without a doubt.\" \"What, theni\" Matthew had to take a glance around to make sure no one was standing close enough to overhear. \"You believe someone else murdered himi\" \"Yes, I do. Not Satan. a man. Or a woman who has a man\u0027s strength, of which there are some hereabouts.\" \"But Mr. Garrick saw Madam Howarth and . . . something . . . behind the barn.\" \"Mr. Garrick,\" Johnstone said calmly, \"has a mind like an iron sieve. I would question if not his eyesight, then his soundness of sanity.\" \"Why did you not speak out at our dinner, theni\" \"Yes, and then I might find myself a cellmate with Rachel Howarth. That\u0027s an honor I would not wish to have.\" \"This is a merry damnation, isn\u0027t iti\" someone else spoke up, stepping beside the schoolmaster. The small-framed Dr. Shields was in his nightshirt, his long hair wild and wind-whipped, his pale blue eyes large behind the oval spectacles. \"It\u0027s no use the waste of good water!\" \"Hello, Benjamin.\" Johnstone gave a slight nod. \"I should think you\u0027d stay in bed, these fires being such a commonplace nowadays.\" \"I could say the same for you. In truth, this is much more exciting than watching crops fail to grow.\" He steadied his gaze at Matthew. \"Hello there, young man. In some trouble yesterday, I hear.\" \"a little,\" Matthew said. \"Three days in the gaol and three lashes is a modicum, not a minimum. Favor me, as I shall be applying liniment to your stripes before long. Where\u0027s the magistratei\" \"In bed,\" Johnstone said before Matthew could answer. \"He\u0027s a sensible sleeper, it seems, not given to excitement over the burning of abandoned houses.\" \"Yes, but he\u0027s a man of the city, and therefore has learned how to sleep through all manner of holocausts.\" Shields faced the fire, which was now totally beyond control. Bidwell was still hollering orders, trying to rouse the firemen to further action but some of the urgency had gone from his demeanor. Matthew saw Nicholas Paine conferring with Bidwell, who waved an impatient arm in the direction of his mansion. Then Paine merged into the onlookers again and was gone from sight. Matthew noted also the presence of Mrs. Nettles, who was wrapped up in a long black robe; there was the giant gaol-keeper, Mr. Green, standing off to one side smoking a corncob pipe; Garrick was there, looking mightily worried; Edward Winston, wearing a gray shirt and wrinkled brown trousers that appeared hastily climbed into, stood beside Garrick. Winston glanced back over his shoulder and his eyes locked for a second or two with Matthew\u0027s. Then he too moved off into the throng of onlookers. \"I\u0027m going home to bed,\" Johnstone announced. \"The dampness gives my knee the devil of an ache.\" \"I\u0027ll give you some more liniment, if you like,\" Shields offered. \"You and that liniment! Matthew, if it\u0027s the same hogsfat preparation for your stripes as it is for my knee, you have my sincerest condolences. I suggest you practise wearing a clothes pin on your nose.\" Johnstone started to limp away, but then paused. \"You think on what I\u0027ve said, young man,\" he entreated. \"When your time is served, I should like to talk to you further on this subject.\" \"What, are these secrets I shouldn\u0027t be hearingi\" Shields asked. \"No secrets, Benjamin. I\u0027m just attempting to advance the young man\u0027s education. Good night.\" So saying, he turned and followed his cane through the crowd. \"Well,\" Shields said with a sigh, \"I should be returning to bed myself. I have a long hard day of watching another patient die.\" He gave a twisted smile. \"Life in the New World, indeed.\" a few minutes after the doctor had gone, the house\u0027s red-glowing roof collapsed. Sparks shot to the heavens and spun \u0027round and \u0027round in the whirlwinds. Bidwell had ceased giving orders; now he just stood back, his arms hanging at his sides. One of the firemen threw a final bucket of water, but then he retreated from the conflagration and suddenly the entire front wall buckled and caved in. \"It\u0027s the Devil, speakin\u0027 to us!\" a man shouted. Matthew saw Bidwell\u0027s head snap around, the dark-circled eyes hunting the shouter like a hawk after a rodent. \"It\u0027s Satan hisself, tellin\u0027 us to leave this damn town \u0027fore we all burn up!\" Someone else - a woman with reddish hair and a gaunt, long-chinned face - took up the cry. \"Neal Callaway\u0027s right!\" she hollered. \"Satan\u0027s warnin\u0027 us to get out!\" \"Stop that!\" Bidwell\u0027s voice made the thunder sound meek. \"I won\u0027t hear such talk!\" \"Hear it or don\u0027t, as you please!\" another man yelled, standing a few feet to Matthew\u0027s left. \"I\u0027ve had enough! I\u0027m takin\u0027 my wife and children out of here before we all end up in caskets!\" \"No, you\u0027re not!\" Bidwell fired back. He was silhouetted by the flames and looked the part of a demon himself. \"Cutter, don\u0027t be a fool!\" \"It\u0027s a fool who stays when the Devil wants him gone!\" Cutter shouted. \"First light, my Nora and me are packin\u0027 up!\" He surveyed the crowd, his eyes glittering with fire. \"anybody with sense oughta do the same! This town ain\u0027t worth livin\u0027 in no more, \u0027cause that bitch and her master want it!\" That statement caused a ripple of reactions: many shouting their accord, a few - a very few - trying to holler him silent. Bid-well spread his arms, a patronly gesture. \"Listen to me!\" he yelled. \"The magistrate\u0027s going to start the hearings this very day! I promise to you, by my very soul, that the witch shall be dealt with and out of our lives before much longer!\" Matthew said nothing, but he thought that Bidwell had just placed his soul in jeopardy. \"One day\u0027s too long for me!\" Cutter was playing the crowd now, like an actor upon a stage. \"No, sir! First light, we\u0027re gettin\u0027 out \u0027fore our skins are burnt off or the plague gets us!\" \"Hush, hush!\" Bidwell shouted anew, trying to quash that evil word. \"There\u0027s no plague here!\" \"You dig up them bodies fresh buried in the graveyard!\" a woman near shrieked. \"You ask \u0027em what kilt \u0027em, \u0027cause that doctor a\u0027yours sure did \u0027em no good!\" WHILE THIS UGLY SCENE was unfolding and Bidwell fought for control of the crowd, Isaac Woodward had awakened in a cold sweat. His throat, however, was aflame. He lay in bed on his back, staring up through the insect net at the ceiling; the net had not prevented at least one new intruder from leaving a welt on his grizzled cheek. The particulars of his nightmare - that common, cruel visitor - remained in his mind like the details of a woodcut. He saw small fingers clenched around the bars of an iron bed, and he heard a soft and terrible gasping. ann, his voice had spoken. Dear God, he\u0027s . . . a light! a strange light was in the room. Woodward was aware of it now. It was not part of the nightmare, and he thought he had passed the purple edge of sleep into full reality again. But the strange light was indeed real; it was a leaping, writhing luminescence ruddy-orange in hue. He looked at the window and realized the light was coming between the shutters. The morning sun - would that there would be a morning sun! - never appeared so drunk before. and now he could smell it, and he thought that this was what might have awakened him: the bitter scent of smoke. Still somewhat hazed in the mind, Woodward got up out of bed and opened the shutter. and there was the view of a house afire, down along Truth Street. Dangerously close to the gaol, he thought; but it looked to be on the opposite side of the street. In the phantasmagoric light he could see a crowd of onlookers, and the swirling wind brought him the crackle of the flames and the noise of shouts that sounded raised in more anger than alarm. He didn\u0027t know how long this had been going on, but it seemed his sleeping must have been a little death. He lit his lamp with its sulphur match and left the room, going across the hall to Matthew\u0027s door. Just as he lifted his hand to knock, he heard a soft click from within. The latch, he realized. Matthew must have either locked or unlocked the door. He knocked. \"Matthew! There\u0027s a fire outside, did you knowi\" There was no response. \"Matthewi Open, please!\" Still, nothing. \"are you feeling welli\" a fine question for him to ask, he thought; his voice sounded like sawblades and bloody bones. Matthew did not speak, nor did he open the door. Woodward placed his hand on the knob and started to turn it, but he hesitated. This was so unlike Matthew, but then again . . . the young man was going to a cage shortly, so who could predict what his emotions and actions might bei But why would he not even speak through the doori \"Matthew, I\u0027m going downstairs. Do you know if Bidwell\u0027s upi\" Woodward waited, and then said with some exasperation, \"I do think you should at least answer my question, don\u0027t youi\" But no answer was forthcoming. \"as you please!\" Woodward turned away and stalked along the corridor toward the staircase. That was so strange and rude for Matthew, he thought. The young man was if nothing always courteous. But he was probably brooding in there, mad at the world. Woodward stopped. Well, he decided, I shall pound on that door until he opens it! I shall pound it down, because if his frame of mind is dark he\u0027ll be no use to me when the first witness arrives! He started to turn again to retrace his steps. a hand reached out from behind him and viciously swept the lamp from Woodward\u0027s grasp. The candle was extinguished. a shoulder hit the magistrate\u0027s body and shoved him aside, and he shouted and stumbled and went down upon the floor. Then the figure was past him, the sound of footsteps running down the stairs in the dark. Though stunned, Woodward knew what he was dealing with. \"Help!\" he hollered. \"Thief! Thief!\" aT THE FIRE, Matthew decided it was time to return to Bidwell\u0027s mansion. The shouts and accusations were still being flung about and Bidwell had been reduced to a croaking hoarseness attempting to answer all the discord. a further incentive to vacate the scene was the fact that Matthew had spied Seth Hazelton - bandage still strapped to his face - standing in the throng watching the commotion. It flashed through Matthew\u0027s mind - his wicked, wicked mind - to run over to the blacksmith\u0027s barn and find the other sack that must be hidden somewhere in there. But he dashed that idea for the sake of his skin and turned to leave the area. He collided with a man who\u0027d been standing right behind him. \u0027\"Ere, \u0027ere!\" the man bawled, his accent reeking of London\u0027s backstreets. \"Watch yer clumsy self.\" \"I\u0027m sorry.\" Matthew\u0027s next impression was that the accent was not the only thing that reeked. He wrinkled up his nose and drew back, getting a good look at the man. He was a short, fatbellied toad; at least, that was Matthew\u0027s first thought. The man\u0027s skin was even a toadish shade of gray, but Matthew realized it was the color of grime. This dirty citizen was perhaps in his early forties, with tousled brown hair from which was rising a bald dome at the crown. His face was round, with a beard that had streaks of gray running through it. He wore a loose-fitting garment that looked like nothing so much as rags sewn together by a drunken seamstress. The man was repellent to Matthew\u0027s sensibilities, but one feature snared his attention: the grimy toad had eyes so clear gray as to be nearing the white shade of ice on a January morning, and yet their centers seemed to be as fiery as any smith\u0027s furnace. Those compelling eyes were lodged beneath matted tufts of brows that appeared in need of brushing. Suddenly the nostrils of the man\u0027s wide, rather coarsely shaped nose flared and he looked down at the ground. \"Don\u0027t move,\" he said; it carried the force of a shouted command, and yet it was not a shout. He lifted his right arm. In it was a long wooden stick. The arm plunged down, and then he grinned a mouthful of yellow teeth and raised the business end of the stick up to Matthew\u0027s face. Impaled upon a blade was a black rat, kicking in its agony. \"They like to be near people,\" the man said. Matthew looked down, and now he saw dark scurrying shapes running hither and yon between the shoes and boots - and bare feet, in some cases - of the assembly. \"Think they can get \u0027em some crumbs, a crowd like this.\" The man was wearing deerskin gloves stained with the fluids of previous executions. With his free hand he adroitly unfastened the leather strap of a long brown seedbag that hung from his belt, and he pushed the stick\u0027s blade and the writhing rat into it. Then he reached down into the bag and Matthew saw his hand give a sickening twist before the blade was withdrawn minus its victim. The bag, Matthew couldn\u0027t fail to notice, bulged with a number of carcasses. at least one that had not yet given up the ghost was still twitching. Matthew realized he\u0027d just witnessed Gwinett Linch - the ratcatcher - at his noble profession. \"Somebody\u0027s got to do it,\" Linch said, reading Matthew\u0027s expression. \"a town may live without a magistrate, but it ain\u0027t no place to live without a ratcatcher. Sir.\" He gave an exaggerated bow and walked past Matthew, making sure his bag of booty brushed along the young man\u0027s hip. and now it was surely time to move on. The burning house had become a pile of seething embers and fiery spits. an old woman had begun hollering about how Rachel Howarth should be hauled from the gaol and beheaded with an axeblade bathed in the blood of a lamb. Matthew saw Bidwell standing staring into the waning flames, his shoulders slumped, and truly the master of Fount Royal appeared to have lost his foundations. Matthew watched his footing as he walked back to the mansion. He also watched his back, taking care that Seth Hazelton wasn\u0027t stalking him. He returned to find a number of lanterns illuminating the parlor, and Mrs. Nettles in attendance to the magistrate. Woodward was in the room\u0027s most comfortable chair, his head back, eyes closed, and a compress laid against his forehead. at once Matthew deduced that something very serious had happened. \"What\u0027s wrongi\" Woodward\u0027s eyes immediately opened. He sat bolt upright. \"I was attacked, Matthew!\" he said forcefully, though his voice was strained and weak. \"By someone I took to be you!\" \"Took to be mei\" \"Someone was in your room.\" Mrs. Nettles took the compress from Woodward\u0027s head and wet it again in a bowl of water nearby. \"The magistrate heard your door bein\u0027 latched.\" \"In my roomi\" Matthew was aware he sounded all at sea, which he was. \"Who was iti\" Woodward shook his head. Mrs. Nettles replaced the wet compress. \"Didn\u0027t see his face,\" Woodward said. \"It happened so swiftly. He knocked the lantern from my hand and near broke my shoulder. I heard him run down the stairs, and then . . . gone.\" \"This happened only a short time agoi\" \"Twenty minutes a\u0027 th\u0027 most,\" Mrs. Nettles said. \"I\u0027d just returned from the fire, and I heard him hollerin\u0027 \u0027Thief.\u0027\" \"You mean the man stole somethingi\" \"I don\u0027t know.\" Woodward lifted a hand and held it against the compress. \"It was all I could think of at the moment. That he was a thief trying to ransack your room.\" \"Well, I\u0027m sure he was quite disappointed. Everything I have is borrowed.\" and then it struck Matthew like a musketball. \"Except for one thing.\" He picked up a lantern and hurriedly ascended the stairs. He found his room to be neat and orderly, not a trace of an intruder. Except for one thing, and this was what he\u0027d suspected. Before going to bed, he\u0027d placed the gold coin upon the dresser top. The coin was now gone, and Matthew doubted that it would be found in this room. a thief indeed, Matthew thought. He spent a moment searching the floor for a gold glint, but it was not to be. \"Damn!\" he swore softly. \"anythin\u0027 missin\u0027i\" Mrs. Nettles asked when Matthew returned to the parlor. \"Yes. My gold coin.\" \"Oh my Lord! Mr. Bidwell keeps some coins in a box next to his bed! I\u0027d best go up and see if they\u0027ve been plucked too!\" She took a lamp and went up the stairs with a speed that Matthew would never have assigned to her. He stood next to the magistrate\u0027s chair. Woodward was a pasty color and his breathing was very harsh. \"You\u0027re not well at all,\" Matthew said. \"Who would be, after such an encounteri Goode\u0027s gone to fetch me some rum. I\u0027ll be better presently.\" \"It\u0027s more than the encounter. Your health concerns me.\" Woodward closed his eyes, his head tilted back. \"I\u0027m under the weather. I told you, it\u0027s this swamp ai - i\" \"No, sir,\" Matthew interrupted. \"I think the swamp air is the least of it. I\u0027m going to have one of the servants go get Dr. Shields.\" \"No, no, no!\" Woodward swatted a hand at that idea as if it were one of the bothersome insects. \"I have a job to do, and I intend to do it!\" \"You can still do your job. But Dr. Shields needs to be informed of your condition. Perhaps he can prescribe a tonic.\" \"Siri\" It was Goode, bringing a tray upon which sat a tankard of West Indies tonic. Woodward took it and put down two swallows that made his throat feel as if scraped with a razor. Mrs. Nettles returned to the parlor. \"Everythin\u0027s there. at least, that box a\u0027 coins hasn\u0027t been touched. Must be you scared him off\u0027fore he could get to Mr. Bidwell\u0027s room.\" \"Likely someone who thought . . . because of the attention drawn to the fire ... he could rob at his leisure.\" Woodward dared to take another drink; the pain was severe, but bearable. \"There are some people jealous of what Mr. Bidwell has, for sure.\" \"Did this thief carry a lanterni\" Matthew asked the magistrate. \"No. I told you . . . the lantern was knocked from my hand. Quite forcibly.\" Goode, who was standing behind Woodward\u0027s chair, suddenly spoke, \"Seems to me it had to be somebody knew this house.\" all eyes stared at him. \"What I mean is . . . whoever it was had to know his way up and down them stairs in the dark. No rail to hold on to, you could break your neck if you mis-stepped.\" \"and you say you heard the man run down the stairsi\" Matthew returned his attention to Woodward. \"Yes. Definitely.\" \"If I may ask, sir . . . was nothin\u0027 stolen, theni\" Goode asked of Matthew. \"One thing only, at least from my room. a Spanish gold coin.\" \"a gold coin,\" Goode repeated, and he frowned. \"Uh ... if I may ask another question, siri\" He paused. \"Yes, go ahead.\" \"Uh . . . where might you got this coin from, siri\" \"It was in the possession of a tavern-keeper on the road from Charles Town.\" He saw the black servant\u0027s frown deepen, and this perplexed him. \"Whyi\" \"No reason, sir.\" Instantly Goode\u0027s frown relaxed. \"No reason, just curious \u0027bout such a thing. Forgive an old man\u0027s boldness, sir.\" \"I understand.\" What Matthew understood was that Goode might know somewhat more about this incident than he was willing to say, but now was not the time to pursue it. \"Is there anythin\u0027 else I\u0027m required for, ma\u0027ami\" Goode asked Mrs. Nettles, and she told him he was free to go. The servant left the parlor, moving rather hurriedly for his age. Presently Bidwell returned to the house. His face was damp with sweat and streaked dark by ashes, and his regal bearing had been reduced to a pauperly state by the grievances of the crowd. Though he was bone-tired and sick at heart, still his presence of mind was sharp enough to immediately see from the gathering of Mrs. Nettles, Woodward, and Matthew that something untoward had occurred. \"We\u0027ve suffered a thief,\" Mrs. Nettles said, before the master of the mansion could speak. \"a man was in Mr. Corbett\u0027s room. He knocked the magistrate to the floor on escapin\u0027.\" \"Near broke my shoulder,\" Woodward added. \"a thiefi Did you recognize the mani What was takeni\" \"I didn\u0027t see his face,\" the magistrate said. \"But the man evidently stole Matthew\u0027s gold coin.\" \"The coin you found at Shawcombe\u0027s taverni\" Bidwell had heard about it from Paine just after they\u0027d returned from their expedition. Matthew nodded. \"Yes, sir.\" \"I have to say I\u0027m not surprised!\" Bidwell put a hand into the bowl of water and wiped it across his sooty face. \"I understand the tales that were spreading magnified that single coin into a treasure box full! Small wonder some poor farmer didn\u0027t dare to come in here and make off with the fortune!\" \"Siri\" Matthew said. \"Goode has advanced the theory that whoever did it might have been a frequent visitor to your house, in that he could negotiate the stairs without benefit of a candle. Do you have many poor farmers as your guestsi\" \"No. Excepting Garrick, of course. But he\u0027s only been here twice, and the second time was at our dinner.\" again he wet his face with a handful of water. It dawned upon him what Matthew was getting at. \"You believe the thief was a common acquaintance of minei\" \"a probability. I found no lantern in my room. The man may have entered in the dark and been familiar enough with your house not to need illumination.\" \"a servant, then!\" Bidwell looked at Mrs. Nettles. \"Have you seen to my bedchamber yeti\" \"Yes sir, I have. Your coin box is undisturbed. I took the liberty also of inspectin\u0027 your study. Nothin\u0027 missin\u0027 there, as far as I could tell. and - if I ma\u0027 speak my mind, sir - the servants know where your coin box is. There\u0027re Dutch gold pieces aplenty in it.\" She lifted her eyebrows. \"You follow what I\u0027m sayin\u0027, siri\" \"Mr. Bidwelli\" Matthew said. He had come to a conclusion of sorts. \"Whoever entered your house had been here before, probably many times. I believe he specifically wanted the coin that was in my possession. He knew I wouldn\u0027t be in the room. He knew also that the magistrate was a hard sleeper. Because I told him.\" \"You didi\" \"Yes, sir. Except this theory is somewhat flawed. Schoolmaster Johnstone couldn\u0027t have run down the stairs.\" Bidwell stared at him, mouth agape. and then from that open mouth came a laugh like donkey\u0027s bray. \"Now you\u0027ve shown your true intellect, boy!\" he said, with more than a touch of glee. \"Schoolmaster Johnstone a thief! Put this in your broken pipe and puff on it: the man\u0027s even unable to climb stairs, much less run down them! He has a deformed knee, in case it\u0027s escaped you!\" \"I\u0027ve seen what appears to be a deformed knee,\" Matthew said calmly. \"I\u0027ve not seen the knee itself.\" \"By God, you are a right brash set of bones!\" Bidwell grinned savagely. \"Have you lost whatever mind you brought to this towni\" \"I am only telling you, sir, that I informed the schoolmaster that Magistrate Woodward was asleep in his room.\" \"Well, Hell\u0027s burnin\u0027 bells! I told the same thing to Nicholas Paine, when he asked where the magistrate was!\" \"and Mr. Winston asked me,\" Mrs. Nettles said. \"I told him I thought the magistrate was still abed.\" \"Mrs. Nettles knew it!\" Bidwell brayed on. \"I think she could knock a man down, don\u0027t youi\" His wet face flushed when he realized what he\u0027d just said. \"No offense, Mrs. Nettles.\" \"None taken, sir. I once threw my dear departed husband through a winda.\" \"There, you seei\" Bidwell turned his glare upon Woodward. \"Sir, if this was the most able clerk you could discover, I pity the judicial world!\" \"He\u0027s able enough,\" was the magistrate\u0027s rather frosty reply. \"Even if he does sometimes put his cart before his horses.\" \"In this case, his cart is lacking not only horses but wheels!\" Bidwell shook his head, disgusted with the whole business. \"Oh, if I live to see the new year I shall count it as a miracle! Here, what\u0027s that you\u0027re drinkingi\" \"Rum,\" Woodward answered. \"What\u0027s rum for one is rum for two, then!\" Bidwell took the tankard from him and swigged the rest of it down. \"There is another thing,\" Matthew said; he\u0027d remembered it, just as Bidwell had mentioned living to see the new year. \"Dr. Shields.\" \"Yesi What about himi Was he in here with the schoolmaster, both of them thievingi\" \"He also inquired as to the whereabouts of the magistrate, and Mr. Johnstone told him what I\u0027d said. The doctor excused himself from my presence just after Mr. Johnstone left.\" \"Oh, so now we have a gang of thieves! The schoolmaster, Dr. Shields, Mr. Paine, Winston, and Mrs. Nettles! a fearsome five, indeed!\" \"Make light as you wish,\" Matthew said, \"but I think one of those five entered this house and took my gold coin.\" \"Not me!\" the woman said sharply. \"Surely you don\u0027t mean me!\" \"Of course he means you!\" Bidwell assured her. \"If he can accuse a cripple of running down a staircase in the dark, he can accuse whomever the hell he pleases!\" \"It wasn\u0027t the doctor.\" Woodward placed his hand against his bruised shoulder. \"The man who hit me had some size to him. Six feet he was, at least. a giant, possibly. and he moved as swiftly as a snake.\" \"Yes, sir.\" Matthew gave a faint smile. \"and we fought off Shawcombe with candles versus daggers, didn\u0027t wei\" Woodward understood his meaning, and tucked his head down an inch or so. Bidwell slammed the tankard down upon the nearest tabletop. \"I\u0027m going back up to bed, for whatever sleep I can find! I daresay it won\u0027t be much!\" He focused his gaze directly at Matthew. \"First light will be here in two hours. I\u0027ll expect you to be ready to carry out your sentence.\" \"I shall be.\" Bidwell picked up a lantern and took three weary steps toward the staircase. Then he abruptly stopped and looked back, his face daubed yellow in the glow. \"Is there something in particular about that coin I should knowi\" Matthew recalled the conversation he\u0027d had with Woodward, concerning the theory that there might be an encampment of Spanish soldiers near the Indians\u0027 village. Now, however, seemed not the moment to bring it up with Bidwell, his being in such a fractious temperament. \"What I\u0027m asking is,\" Bidwell continued, \"why would someone risk entering my house for one gold coini\" Matthew said, \"I don\u0027t know.\" \"No ideasi Have your theories failed youi\" \"For the moment, yes.\" \"I think,\" Bidwell said bluntly, \"that you know much more about this than you wish to say. But I\u0027ll let it go, as I\u0027m in no mood for a fencing match with you. Good night, gentlemen.\" Bidwell ascended the stairs, and Mrs. Nettles gave the two men a crisp good night - her face a solemn mask that told Matthew she was quite offended at his accusation of thievery - and went about her business. Woodward waited until he was positive they were alone. Then he gave a quiet laugh. \"Of course you have a theory, don\u0027t youi You have a theory for everything under the sun.\" \"If you mean I fervently desire to know the why of things, you\u0027re correct.\" \"The why of things,\" Woodward repeated, and there was a bitter edge in his voice. \"Knowing the why of things can kill a man, Matthew.\" He put his hand to his throat and massaged it. \"Sometimes it\u0027s best not to ask too many questions. Haven\u0027t you learned that yeti\" \"It\u0027s not my nature, sir,\" Matthew replied; he felt sure that Woodward\u0027s attitude in this matter of the why had to do with the man\u0027s past life in London. \"You are young. I am old. That makes all the difference.\" He let go a long, pained sigh. \"all right, then. Tell me what you\u0027re thinking.\" \"We may have had a visit tonight,\" Matthew said quietly, \"from the Spanish spy.\" Woodward didn\u0027t respond. He scratched the mosquito bite on his cheek. \"That coin may be evidence of the Spanish presence near the Indians\u0027 village, wherever it might be,\" Matthew continued, keeping his voice hushed. \"The spy may have felt it necessary to remove it from sight.\" \"But the damage has been done. Bidwell already knows about the coin. The entire population does, it seems.\" \"Yes, sir, but - as Bidwell might say - a hole in a ship must be patched, regardless how much water has already flooded the hull. The thief didn\u0027t expect to be interrupted. Perhaps he hoped I might believe the coin to be misplaced. But removing it from sight would also remove it as an object of Bidwell\u0027s interest.\" \"and of course,\" Woodward added, \"the spy wouldn\u0027t know your suspicions.\" \"Exactly.\" \"What action do you propose, theni\" \"I propose ... to serve my sentence and scribe the answers of the witnesses. Then I propose to endure the whip as best I can, and hope I neither weep in public nor soil my breeches. I propose for you to visit Dr. Shields and ask for a tonic.\" \"Matthew, I told you that I\u0027m - -\" \"You\u0027re ill, sir,\" Matthew said firmly. \"and you might worsen, without help. I shall not retreat on this subject.\" Woodward made a sound of exasperation. He knew the young man could be as tenacious as a dockside dog trying to gnaw through a crab\u0027s shell. \"all right,\" he relented. \"I\u0027ll go.\" \"Tomorrow.\" \"Yes, yes. Tomorrow.\" \"Your visit should be twofold,\" Matthew said. \"One, to aid your health. Two, to make some inquiries - subtle, of course - about Mr. Paine, Mr. Winston, and Schoolmaster Johnstone.\" \"The schoolmasteri It can\u0027t be him, Matthew! His deformed knee!\" \"I should like to know if Dr. Shields has ever inspected it.\" \"You\u0027re accusing an Oxford brother,\" Woodward said, with an uptilt of his chin. \"I find that objectionable.\" \"I\u0027m accusing no one, sir. But I would wish to know the schoolmaster\u0027s history, just as I would wish to know the histories of Mr. Winston and Mr. Paine.\" \"and what of Dr. Shields\u0027s historyi\" \"His, too. But I think the doctor may be less than candid about his own life, therefore other sources will have to be tapped.\" \"all this is well and good.\" Woodward eased himself to his feet. \"However, we can\u0027t forget our main purpose here. We\u0027re primarily concerned with a witch, not a spy.\" \"a woman accused of witchcraft,\" Matthew corrected. He had spoken it a little too sternly, and he had to amend his tone. \"Sir,\" he said. \"Of course.\" The magistrate nodded, his eyelids drooping. \"Good night.\" \"Good night, sir.\" Matthew let him start walking away before he decided, on an impulse, to say the next thing that left his lips. \"Magistratei Who is in pain when you call to anni\" Woodward stopped as if he had collided with a wall. He stood very still. \"I couldn\u0027t help but overhear. But it\u0027s not something I haven\u0027t heard before, sir.\" There was no response. \"Forgive my intrusion. I had to ask.\" \"No.\" Woodward\u0027s voice was tight. \"You did not have to ask.\" He remained standing exactly as he was, his back toward the young man. \"This is one why you should leave be, Matthew. Heed what I say. Leave it be.\" Matthew said nothing more. He watched as the magistrate walked out of the parlor, his back ramrod-straight. and thus the night ended, with more questions and no answers.","sourceLink":"https://allnovel.net/speaks-the-nightbird-matthew-corbett-1/page-10.html","bookId":2250,"book":{"id":2250,"title":"Speaks the Nightbird (Matthew Corbett #1)","description":"Storyline: Speaks the Nightbird (Matthew Corbett #1) Judgment of the Witch The Carolinas, 1699: The citizens of Fount Royal believe a witch has cursed their town with inexplicable tragedies  and they demand that beautiful widow Rachel Howarth be tried and executed for witchcraft. Presiding over the trial is traveling magistrate Isaac Woodward, aided by his astute young clerk, Matthew Corbett. Believing in Rachel\u0027s innocence, Matthew will soon confront the true evil at work in Fount Royal.... Evil Unveiled After hearing damning testimony, magistrate Woodward sentences the accused witch to death by burning. Desperate to exonerate the woman he has come to love, Matthew begins his own investigation among the townspeople. Piecing together the truth, he has no choice but to vanquish a force more malevolent than witchcraft in order to save his beloved Rachel and free Fount Royal from the menace claiming innocent lives.","cover":"https://allnovel.net/images/speaks-the-nightbird-matthew-corbett-1.jpg","author":"Robert McCammon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/speaks-the-nightbird-matthew-corbett-1.html","creation":"Oct 5, 2019 8:58:30 AM","modification":"Oct 5, 2019 5:09:27 PM"}}
