{"id":85903,"no":23,"title":"Page 23","content":"SaTaN SaID, \"I have a gift for thee.\" Matthew could not speak or move; his mouth was frozen shut, his body rigid. He saw, however, in the leaping crimson firelight that Satan indeed wore a black cloak with six gold buttons arranged three by three. a hood covered the fiend\u0027s head, and where his face should have been was only deeper darkness.\\n\\n \"a gift,\" Satan repeated, in a voice that sounded much like that of Exodus Jerusalem. He opened his cloak with long-fingered, bloodless hands, exposing the gold-striped waistcoat he wore beneath it. Then from the confines of his waistcoat he produced a wet and dripping turtle, squirming in its dark green shell, which he held out toward Matthew.\\n\\n Satan\u0027s hands gripped opposite edges of the shell and with no apparent effort tore the reptile open. The carapace cracked like a musket shot. The slow and horrid twisting of those infernal hands ripped the turtle\u0027s exposed body in two, and Matthew saw the creature\u0027s mouth gape wide with agony. Then its gory internals oozed and slithered out, their colors the red, white, and blue of the British flag.\\n\\n Gold and silver coins began to fall from the mass of ruined vitals, like money spilling from the bottom of a razor-sliced purse. Satan winnowed his left hand into the guts and showed Matthew his bloody palm: in it was a single gold piece, fouled with carnage.\\n\\n \"This one belongs to thee, \" Satan said. He drifted forward, his left arm outstretched and the coin between forefinger and thumb. Matthew was unable to retreat, as if his legs and arms were bound. Then Satan was upon him like a dark bird of prey, and placed the coin\u0027s edge against Matthew\u0027s lips.\\n\\n Slowly, inexorably, the gold piece was pushed into Matthew\u0027s mouth. He felt his eyes widen and tasted bitter blood. It was then that he saw what was aflame, just behind the master of Pandemonium: a burning stake, and lashed to it was a fire-consumed figure that writhed in untold damnations of the flesh.\\n\\n Matthew heard himself moan. The coin was in his throat. He was choking on it. and then from within the hood Satan\u0027s face began to emerge, within inches of Matthew\u0027s own. Bared fangs came out, set in a jaw of exposed bone. a skeletal muzzle followed, and empty canine eyesockets. The dog\u0027s skull pressed against Matthew\u0027s face and exhaled a hot breath that carried all the mephitic abomination of the charnel house.\\n\\n He awakened with a further moan. a few heartbeats passed before he realized where he was, and that his audience with the Devil had been an exceptionally vivid dream. He thought he could still taste the blood, but then he recognized it as the strongly peppered sausage Bidwell had offered him at dinner. In fact, the sausage was most likely responsible for the entire production. His heartbeat was still rapid, and beads of sweat had collected on his face and chest. The first order of business was banishing this darkness. He found the matchholder and flint on his bedside table, struck a flame - a match never flared on the first strike when one really needed it - and lit the lantern he\u0027d extinguished upon retiring. Then he got out of bed and went to the dresser, where he poured himself a cup from the water pitcher and drank it down, followed by a second.\\n\\n \"Whew!\" Matthew said, in an exclamation of relief. Still, he felt his senses were yet affected by the nightmare, as the walls of his room seemed to be closing in on him. He crossed to the window, opened the shutters wide, and drew a long, deep breath to clear his head of the confusion.\\n\\n But for the distant barking of a single dog, the night was quiet. No lanterns burned in the slave quarters. Matthew saw a flash of lightning over the sea, though the storm looked to be very far away. and then he saw something that gladdened his soul: a glimpse of stars through the slow-moving clouds. Dare he hope that the grim weather was taking its leavei This strange May with its chills and swelters had been enough to drain the energy of the strongest man, and perhaps with the coming of sustained sunlight June might be a kinder month for Fount Royal.\\n\\n Then again, what did it matter to himi He and the magistrate would very soon be departing this town, never to return. and good riddance to it and Bidwell, Matthew thought. at dinner, the man had been contentious in his remarks concerning Rachel, such as - between bites of that hellish sausage - \"Clerk, if you\u0027re growing so fond of the witch, I\u0027m sure it might be arranged for you to hold her hand while she burns!\"\\n\\n Matthew had answered that and other goads with silence, and after a while Bidwell had ceased his needling and concentrated on stuffing his face. Matthew would rather have taken his dinner upstairs with the magistrate, who forced down his distressed throat a bowlful of pap and some hot tea. Then Dr. Shields had arrived again, and the lancet and bleeding bowl had seen more work. Matthew had left Woodward\u0027s room halfway through the grisly procedure, his stomach in knots, and he reckoned that sight of the dripping crimson fluid had also counted toward his nightmare.\\n\\n He watched the stars disappear and then reappear again, as the clouds continued their advance. He had read Buckner\u0027s testimony in the documents Woodward had already finished, but had found nothing there that might lead him toward his fox; tomorrow he would read the testimonies of Garrick and Violet adams after the magistrate was done, but by then Woodward would be close to dictating his decree.\\n\\n The particulars of his nightmare haunted him: Satan in the black cloak with six gold buttons... nothing but darkness where the face should have been... the fresh-caught turtle... the sinewy hands breaking open the green shell, and bloody coins spilling out...\\n\\n The coins, Matthew thought. Gold and silver pieces. He saw in his mind\u0027s eye the contents of the turtle bellies that Goode had shown him. Spanish coins swallowed by turtles. Where had they come fromi How was it that an Indian and turtles shared possession of such lucrei\\n\\n His theory about the Spanish spy was still alive, even though it had been severely wounded by Paine\u0027s revelations. However, the fact remained that Shawcombe had gotten the gold piece from a redskin, and that the Indian must\u0027ve received it from a Spaniard. But what Spaniard had fed gold and silver coins to turtlesi\\n\\n Matthew had taken his fill of the night air, though he was in no hurry to return to bed. He watched the dance of the stars for a moment longer, and then he grasped hold of one of the shutters in preparation of closing it.\\n\\n Before he did, he saw an orange glare of light that reminded him much too uncomfortably of the burning stake in his dream. It was not a light whose source was visible, but rather the reflection of light originating from a westerly direction. Perhaps ten seconds passed, and then there came a man\u0027s distant shout affirming what Matthew had already suspected: \"Fire! Fire!\"\\n\\n The call was picked up and echoed by a second man. Directly Matthew heard a door slam open and knew it must be Bidwell, roused from sleep. The alarm bells began to ring, more people were shouting, and the dogs of Fount Royal were barking up a fury. Matthew hurriedly dressed in the clothes he\u0027d worn yesterday, took the lantern to illume his way down the stairs, and went outside. There he saw the red and orange flames attacking a structure on Truth Street, terribly near to the gaol.\\n\\n In fact, the fire was so close to the gaol that Matthew was struck with dread like a blow to the belly. If the gaol was aflame, and Rachel was trapped in her cell...\\n\\n He started running toward Truth Street, his face tight with fear. He passed the spring, where one horse-drawn wagon was pulling away with a load of water barrels while a second had just arrived. \"What\u0027s burnini\" a woman yelled at him as he went by a house, but he dared not answer. a score of citizens were converging onto the scene, some of them still wearing their night-clothes. He beat the water-wagon to its destination, and was keenly gratified to find that the fire was not burning down the gaol but was instead destroying the schoolhouse.\\n\\n It was a hot conflagration and was working with great speed. There was Bidwell, wearing a powdered wig but clad in a blue silk night-robe and slippers, hollering at the onlookers to make way for the approaching wagon. The horses got through, and the six firemen aboard the wagon jumped down and began to haul the barrels off. One of them scooped a bucket into the water and ran forward to dash the flames, but - as in the case of the previous fire Matthew had witnessed - it was clear to all that the schoolhouse was doomed.\\n\\n \"Get that fire out! Hurry, all of you!\" came a shout that was part command and part plea. Matthew saw the schoolmaster, bareheaded and wearing a long dark green robe with yellow trim. Johnstone was standing perilously close to the roaring blaze, leaning on his cane with one hand and motioning the firemen on with the other, sparks flying around him like red wasps and his face contorted with urgency. \"Hurry, I beg of you, hurry!\"\\n\\n \"alan, stand back!\" Bidwell told him. \"You\u0027re in danger there!\" a man grasped Johnstone\u0027s arm and attempted to pull him away from the flames, but the schoolmaster\u0027s mouth twisted with anger and he wrenched his arm free.\\n\\n \"Damn it!\" Johnstone bellowed at the firemen, who were obviously doing their best to throw their buckets of water but were being hindered by the sheer cruelty of the heat. \"Put that fire out, you idiots! Can\u0027t you move any quickeri\"\\n\\n Unfortunately they could not, and all but the schoolmaster seemed to realize the futility of the battle. Even Bidwell simply stood with his hands on his hips and made no effort to bully the firefighters to a frenzied pace.\\n\\n as the schoolhouse was a small structure and the fire was so eager, Matthew doubted that sixty firemen with sixty buckets could have saved it. The second wagon arrived, bringing three additional men. Several more stalwarts from the crowd stepped forward to help, but it was a matter not of enough hands and hearts but of enough buckets and time.\\n\\n \"Damn it!\" Johnstone had ceased his pleading now, and had become visibly enraged. He hobbled back and forth, occasionally aiming a shout of disgust or derision at the ineffective firemen, then cursing the blaze itself. Fire had begun to chew through the schoolhouse\u0027s roof. In another few moments Johnstone\u0027s raving stopped; he seemed to accept that the fight was truly lost - lost, even, before it had begun - and so he retreated from the flames and smoke. The firemen continued to work, but at this point it was more to justify their presence than anything else. Matthew watched Johnstone, who in turn watched the fire with glazed eyes, his shoulders slumped in an attitude of defeat.\\n\\n and then Matthew happened to turn his head a few more degrees to the right and his heart rose to his throat. There not ten feet away stood Seth Hazelton. The blacksmith, who still wore a bandage bound to his injured face, was attentive to the spectacle of the flames and thus hadn\u0027t seen his antagonist. Matthew doubted if Hazelton was aware of very much anyway, as the man held a brown clay jug at his side and took a long swig from it as Matthew observed him. Hazelton\u0027s slow blink and slack-jawed countenance spoke as to the contents of that jug, and his dirty shirt and breeches proclaimed that Hazelton was definitely more interested in wine than water.\\n\\n Matthew carefully stepped backward a few paces, putting two other onlookers between them just in case the blacksmith might glance around. The thought - an evil thought, but compelling just the same - came to him that now would be an excellent time to search Hazelton\u0027s barn. What with the man here at the fire, and weak from strong drink as well...\\n\\n No, no! Matthew told himself. That barn - and whatever was hidden in it - had caused him trouble enough! Hang it, and let it go!\\n\\n But Matthew knew his own nature. He knew he might present every reason in the world not to go to the blacksmith\u0027s barn and search for the elusive burlap sack, up to and including further lashings. However, his single-minded desire to know - the quality that made him, in the magistrate\u0027s opinion, \"drunk beyond all reason\" - was already at work in him. He had a lamp and the opportunity. If ever he was to find that well-guarded bag, now was the moment. Dare he try iti Or should he listen to that small voice of warning and chalk his back-stripes up as a lesson learnedi\\n\\n Matthew turned and walked briskly away from the fire. One backward glance showed him that Hazelton had never noted his presence, but was again indulging in a taste from the jug. Matthew\u0027s jury was still in deliberation concerning his future actions. He knew what Woodward would say, and he knew what Bidwell would say. Then again, neither of them doubted Rachel\u0027s guilt. If whatever Hazelton was hiding had something to do with her case...\\n\\n He was aware that this was the same reasoning that had lured him into trying to open the grainsack to begin with. Yet it was a valid reasoning, in light of the circumstances. So what was the decision to bei\\n\\n as he reached the conjunction of streets, his scale swung in the direction that Matthew had known it would. He looked over his shoulder, making sure that the blacksmith was not coming up from behind, and then he held the lantern before him and broke into a run toward Hazelton\u0027s barn.\\n\\n When Matthew reached the barn, he lifted the locking timber and pulled the door open just enough for him to squeeze through. The two horses within rumbled uneasily at his presence as he followed the glow of his lantern. He went directly to the area where he remembered finding the sack, put the lamp down on the ground, and then started searching through the straw. Nothing there but straw and more straw. Of course Hazelton had moved the sack, had dragged it to some other location either inside the barn or perhaps inside his house. Matthew stood up, went to another pile of straw on his right, and searched there, but again there was nothing. He continued his explorations to the very back of the barn, where the straw was piled up in copious mounds along with an ample supply of horse apples. Matthew thrust his hands into the malodorous piles, his fingers questing for the rough burlap without success.\\n\\n at last he realized it was time to go, as he\u0027d already been here longer than was sensible. The sack, if indeed it remained in the straw, was not to be found this night. So much for his opportunity of discovery!\\n\\n He stood up from his knees, picked up the lantern, and started for the door. as he reached it, something - an instinct of caution perhaps, or a stirring of the hairs on the back of his neck - made him pause to blow down the lantern\u0027s chimney and extinguish the candle since he no longer needed the incriminating light.\\n\\n Which turned out to be a blessing of fortune, because as Matthew prepared to leave the barn he saw a staggering figure approaching, so close he feared Hazelton would see him, roar with rage, and attack him with the jug. Matthew hung in the doorway, not knowing whether to run for it or retreat. He had only a few seconds to make his decision. Hazelton was coming right at him, the blacksmith\u0027s head lowered and his legs loose at the knees.\\n\\n Matthew retreated. He went all the way to the rear of the barn, where he sprawled flat and frantically dug both himself and the lantern into a mound of straw. But before he could do half a good job, the door was pulled open wider and there entered Hazelton\u0027s hulking dark figure.\\n\\n \"Who\u0027s in herei\" Hazelton growled drunkenly. \"Damn your eyes, I\u0027ll kill you!\" Matthew stopped his digging and lay very still, the breath catching in his lungs. \"I know you\u0027re in here! I closed that damn door!\" Matthew dared not move, though a piece of straw was fiercely tickling his upper lip.\\n\\n \"I closed it!\" Hazelton said. \"I know I did!\" He lifted the jug and Matthew heard him gulp a swallow. Then he wiped his mouth with his sleeve and said, \"I did close it, didn\u0027t I, Lucyi\"\\n\\n Matthew realized he was addressing one of the horses. \"I think I did. John Shitass, I think I\u0027m drunk too!\" He gave a harsh laugh. \"Drunk as a damned lord, that\u0027s what I am! What d\u0027ya think of that, Lucyi\" He staggered toward one of the horses in the dark, and Matthew heard him patting the animal\u0027s hindquarters.\\n\\n \"My sweet girl. Love you, yes I do.\"\\n\\n The noise of Hazelton\u0027s hand on horseflesh ceased. The blacksmith was silent, possibly listening for any sound of an intruder hiding in the bam. \"anybody in herei\" he asked, but the tone of his voice was uncertain. \"If you\u0027re here, you\u0027d best get out \u0027fore I take a fuckin\u0027 axe to you!\" Hazelton staggered back into Matthew\u0027s field of vision and stood at the center of the barn, his head cocked to one side and the jug hanging loosely. \"I\u0027ll let you go!\" he announced. \"Go on, get out!\"\\n\\n Matthew was tempted, but he feared that even drunk and unsteady the blacksmith would seize him before he reached the door. Better to just lie right here and wait for the man to leave.\\n\\n Hazelton said nothing and did not move for what seemed a full minute. Finally the blacksmith lifted the jug to his lips and drank, and then upon reaching the bottom he reared back and flung the jug against the wall nearly square above Matthew\u0027s head. The jug whacked into the boards and fell, broken into five or six pieces, and the startled horses whinnied and jumped in their stalls.\\n\\n \"The hell with it!\" Hazelton shouted. He turned around and made his way out of the barn, leaving the door open.\\n\\n Now Matthew was faced with a dangerous choice: should he get out while he could, risking the fact that Hazelton might be waiting for him out there just beyond the doorway, or should he lie just as he wasi He decided it was best to remain in his prone position for a while longer, and indeed he took the opportunity to bury himself more completely in the straw.\\n\\n Within a minute or two, Hazelton returned carrying a lighted lantern, though the glass was so dirty it hardly counted as illumination. The lantern was not so fearsome to Matthew as the short-handled hatchet Hazelton gripped in his right hand.\\n\\n Matthew took a deep breath and let it out, trying to flatten himself even further under his covering of straw and horse apples. Hazelton started staggering around the barn, probing with the dim light, the hatchet held ready for a brain-cleaving blow. He gave the nearest strawpile a kick that might have broken Matthew\u0027s ribs. Then, muttering and cursing, Hazelton stomped the straw for good measure. He paused and lifted the lantern. Through the mask of hay that covered his face, Matthew saw the blacksmith\u0027s eyes glitter in the foul light and knew Hazelton was looking directly at his hiding place.\\n\\n Don\u0027t move! Matthew cautioned himself. For God\u0027s sake, be still!\\n\\n and the sake of his own skull, he might have added.\\n\\n Hazelton came toward Matthew\u0027s refuge, his heavy boots crushing down. Matthew realized with a start of terror that the man was going to step on him momentarily, and he braced himself to burst out of the straw. If he came up hollering and shrieking, he reasoned he might scare Hazelton into a retreat or at least might cause him to miss with the first swing of the hatchet.\\n\\n He was ready. Two more steps, and the blacksmith would be upon him.\\n\\n Then: crack!\\n\\n Hazelton stopped his advance, the straw up around his knees. He reached down with his free hand, searching. Matthew knew what the noise had been. The lantern\u0027s glass had broken, the lantern lying perhaps eight inches from the fingertips of Matthew\u0027s right hand. Reflexively, Matthew closed his hand into a fist.\\n\\n The blacksmith discovered what he\u0027d stepped on. He held the lamp by its handle, lifting it up for inspection. There was a long, dreadful silence. Matthew clenched his teeth and waited, his endurance stretched to its boundary.\\n\\n at last Hazelton grunted. \"Lucy, I found that damn lantern!\" he said. \"Was a good one, too! Hell\u0027s sufferin\u0027 bells!\" He tossed it aside with a contemptuous gesture, and Matthew realized the man thought in his tipsied state that it was a lamp he had previously misplaced. If he\u0027d been coherent enough to touch the pieces of broken glass, Hazelton might have found they were still warm. But the blacksmith thereafter turned and crunched back through the straw to the barn\u0027s bare earth, leaving Matthew to contemplate how near he\u0027d come to disaster.\\n\\n But - as was said - a miss was as good as a mile. Matthew began breathing easier, though he would not take a full breath until Hazelton had gone. Then another thought struck him, and it might well have been a hatchet to the head: if Hazelton went out and locked the door, he\u0027d be trapped in here. It might be sunrise or later before Hazelton came to the barn again, and then Matthew would be forced to face him anyway! Better run for it while he was able, Matthew decided. But there was the problem of the straw. That which protected him would also hinder his flight.\\n\\n Now, however, his attention was drawn to the blacksmith once more. Hazelton had hung the lantern up on a wallpeg beside the far stall, and he was speaking to the horse he seemed to favor. \"My fine Lucy!\" he said, his voice slurred. \"My fine, beautiful girl! You love me, don\u0027t youi Yes, I know you do!\" The blacksmith began to murmur and whisper to his horse, and though Matthew couldn\u0027t hear the words he was beginning to think this affection was rather more than that of a man for his mount.\\n\\n Hazelton came back into sight. He thunked the hatchet\u0027s blade into the wall next to the door, and then he pulled the door shut. When he turned again, moisture glistened on his face; and his eyes - directed toward Lucy - seemed to have sunken into dark purple hollows.\\n\\n \"My good lady, \" Hazelton said, with a smile that could only be described as lecherous. a cold chill crept up Matthew\u0027s spine. He had an inkling now of what the blacksmith intended to do.\\n\\n Hazelton went into Lucy\u0027s stall. \"Good Lucy, \" he said. \"My good and lovely Lucy. Come on! Easy, easy!\"\\n\\n Carefully, Matthew lifted his head to follow the blacksmith\u0027s movements. The light was dim and his view was restricted, but he could make out Hazelton turning the horse around in her stall so her hindquarters faced the door. Then Hazelton, still speaking \" quietly though drunkenly to Lucy, eased her forward and guided her head and neck into a wooden collar-like apparatus that was meant to hold horses still as they were being shod. He latched the collar shut, and thus the horse was securely held. \"Good girl, \" he said. \"That\u0027s my lovely lady!\" He went to a corner of the stall and began to dig into a pile of hay provided for Lucy to eat. Matthew saw him reach down for something and pull it out. Whether it was the grainsack or not, Matthew couldn\u0027t tell, but he presumed it was at least what might have been secreted inside the sack.\\n\\n Hazelton came out of the stall carrying what appeared to be an elaborate harness made out of smoothed cow\u0027s hide. The blacksmith staggered and almost fell under its bulk, but it seemed that his fevered intent had given him strength. The harness had iron rings attached to both ends: the two circles Matthew had felt through the burlap. Hazelton fixed one of the rings around a peg on the wall, and the second ring was fixed to a peg on a nearby beam so that the harness was stretched to its full width at the entrance to Lucy\u0027s stall.\\n\\n Matthew realized what Hazelton had devised. He recalled Gwinett Linch saying about the smithy: He\u0027s an inventor, once he puts his mind to a task. It was not Hazelton\u0027s mind, however, that was about to be put to work.\\n\\n at the center of the harness-like creation was a seat formed of leather lattice. The pegs had been placed so the iron rings could stretch the harness and lift the seat up until whoever sat in it would be several feet off the ground and positioned just under Lucy\u0027s tail.\\n\\n \"Good Lucy, \" Hazelton crooned, as he dropped his breeches and pulled them off over his boots. \"My good and beautiful girl.\" His bum naked and his spike raised, Hazelton brought over a small barrel that appeared to be empty, from the ease with which he handled it. He stepped up onto the barrel, swung his behind into the leather seat and lifted the horse\u0027s tail, which had begun flopping back and forth in what might have been eager anticipation.\\n\\n \"ahhhhh!\" Hazelton had eased his member into Lucy\u0027s channel. \"There\u0027s a sweet girl!\" His fleshy hips began to buck back and forth, his eyes closed and his face florid.\\n\\n Matthew remembered something Mrs. Nettles had said, concerning the blacksmith\u0027s deceased wife: I happ\u0027n to know that he treated Sophie like a three-legged horse \u0027fore she died. It was very clear, from the noises of passion he was making, that Hazelton much preferred horses of the four-legged variety.\\n\\n Matthew also knew now why Hazelton had so desired this apparatus of strange pleasure not to be discovered. In most of the colonies the sodomizing of animals was punishable by hanging; in a few, it was punishable by being drawn and quartered. It was a rare crime, but quite morally heinous. In fact, two years ago Woodward had sentenced to hanging a laborer who had committed buggery with a chicken, a pig, and a mare. By law, the animals were also put to death and buried in the same grave with their human offender.\\n\\n Matthew ceased watching this loathsome spectacle and stared instead at the ground beneath him. He could not, however, voluntarily cease from hearing Hazelton\u0027s exhortations of passion for his equine paramour.\\n\\n at last - an interminable time - the barnyard lothario groaned and shuddered, indicating the climax of his copulation. Lucy, too, gave a snort but hers seemed to be more relief that her stud was done. Hazelton lay forward against the horse\u0027s hind and began to speak to Lucy with such lover\u0027s familiarity that Matthew blushed to the roots of his hair. Such speech would be indecent between a man and his maid, but was absolutely shameless between a man and his mare. Obviously, the blacksmith had banged one too many horseshoes over a red-hot forge.\\n\\n Hazelton didn\u0027t try to remove himself from the harness. His voice was becoming quieter and more slurred. Shortly thereafter, he stopped speaking entirely and began to offer a snore and whistle to his object of affection.\\n\\n Just as Matthew had recognized an opportunity to enter the barn, now he recognized an opportunity to depart it. He began to slowly push himself out of the straw, mindful that he not suffer a cut from the lantern\u0027s broken glass. Hazelton\u0027s snoring continued at its regularity and volume, and Lucy seemed content to stand there with her master in repose against her hindquarters. Matthew eased up to a crouch, and then to a standing position. It occurred to him that even if Hazelton awakened and saw him, he couldn\u0027t free himself at once from the harness and would be quite reluctant to give chase. But Matthew wasn\u0027t above giving Hazelton something to think about, so he picked up the man\u0027s dirty breeches and took them with him when he walked unhurriedly to the door, pushed it open, and left the site of such immoral crime. In this case, he pitied not Hazelton but poor Lucy.\\n\\n Matthew saw that the flames over on Truth Street had died down. He reckoned he\u0027d entered the barn an hour or so ago, and thus most of the schoolhouse had by now been consumed. There would be much conjecture tomorrow about Satan\u0027s fiery hand. Matthew didn\u0027t doubt that daylight would see another wagon or two leaving Fount Royal.\\n\\n He laid Hazelton\u0027s breeches out in the middle of Industry Street, after which he was glad to rinse his hands in a nearby horse trough. Then he set off on the walk to Bidwell\u0027s mansion, his curiosity concerning the hidden grainsack well and truly quenched.\\n\\n as the hour was so late and the excitement of the fire worn off, the streets were deserted. Matthew saw a couple of houses where the lanterns were still lit - probably illuminating talk between husband and wife of when to quit the Satan-burnt town - but otherwise Fount Royal had settled again to sleep. He saw one elderly man sitting on a doorstep smoking a long clay pipe, a white dog sprawled beside him, and as Matthew neared him the old man said simply, \"Weather\u0027s breakin\u0027.\"\\n\\n \"Yes, sir, \" Matthew answered, keeping his stride. He looked up at the vast expanse of sky and saw now that the clouds had further dwindled, exposing a multitude of sparkling stars. The scythe of a pumpkin-colored moon had appeared. The air was still damp and cool, but the soft breeze carried the odor of pinewoods rather than stagnant swamp. Matthew thought that if the weather broke and held, the magistrate\u0027s health would surely benefit.\\n\\n He\u0027d decided not to inform Woodward of the blacksmith\u0027s activities. It might be his duty to report such a crime - which would surely lead to Hazelton\u0027s dance on the gallows - but the magistrate didn\u0027t need any further complications. Besides, the loss of a blacksmith would be a hard blow to Fount Royal. Matthew thought that sooner or later someone might discover Hazelton\u0027s bizarre interest and make an issue of it, but for his part he would keep his mouth shut.\\n\\n Before he proceeded to the mansion and therefore to bed, Matthew approached the spring and stood beside an oak tree on its grassy bank. a chorus of frogs thrummed in the darkness, and a number of somethings - turtles, he presumed - plopped into the water off to his right. He saw the reflection of stars and moon on the surface, over which spread slow ripples.\\n\\n How was it that turtles had Spanish gold and silver coins - as well as silverware and pottery shards - in their belliesi Matthew sat down on his haunches, plucked up some grass, and stared out across the ebon pond.\\n\\n / have a gift for thee, Satan had said in his dream.\\n\\n He thought of the coins spilling from the turtle\u0027s guts. He thought of Goode showing him what he\u0027d found, and saying, It\u0027s a thing needs answerin\u0027.\\n\\n It surely is, Matthew told himself. From where might the turtles have gotten such coinsi They\u0027d swallowed them, of course. Most likely the limit of their world was this spring, and so...\\n\\n Oh, Matthew thought. Oh!\\n\\n The suspicion went off like a cannon blast inside his head. He realized he should have heard such a blast as soon as Goode had shown him the coins, but there had been too many other questions crowding his mind. Now, though, here in the quiet dark, the idea was thunderous in its impact.\\n\\n Goode had found Spanish gold and silver coins within the bellies of turtles that lived in the spring... because there were Spanish gold and silver coins within the spring.\\n\\n abruptly, Matthew stood up. He placed a hand on the trunk of the oak tree beside him, if only to steady his thoughts. This suspicion - like the tearing open of a turtle in his dream - was full of glittering possibilities.\\n\\n One gold and one silver piece, one pottery shard, and one silver spoon did not make a treasure hoard... but who might say what was lying down in the mud at the very bottom of Fount Royal\u0027s center of existencei\\n\\n He recalled with a jolt of the senses something that Nicholas Paine had said, back at Shawcombe\u0027s tavern, upon viewing the original gold piece: No black-flagger in his right mind would bury his loot in redskin wilderness. They hide their gold where they can easily get to it, but it would be a poor pirate whose winnings could be found and unearthed by savages.\\n\\n Unearthedi But what about sunken to the bottom of a freshwater springi\\n\\n His brain had caught fire. Bidwell had decided to build Fount Royal around the spring, as it would be - among other considerations - convenient as a source of fresh water for merchant ships arriving from the Indies.\\n\\n But what was fresh water for merchants was also fresh water for those flying a blacker flag, was it noti and was it not possible that the spring had been discovered and used for such a purpose long before Bidwell had even set eyes on iti If that were true, the spring would make an excellent vault in which to deposit - as Paine had put it - \"winnings.\"\\n\\n This was all, however, the wildest possible conjecture. Still... how else to explain the coins in the turtles\u0027 belliesi The turtles, searching for food down at the bottom of the spring, may have scooped up the coins from the mud or else been attracted by their shine. The same might be true of the spoon and the pottery shard. The question remained: what else could be down there, secreted away for safekeepingi\\n\\n But how to explain an Indian\u0027s possession of Spanish goldi If indeed there had been pirate treasure in the spring, had the Indians found and raised it before Fount Royal was borni If so, they\u0027d missed a few trinkets. He would have to sleep on these questions, and pursue them - quietly - in the morning. Bidwell might know something, but he would have to be carefully approached.\\n\\n Matthew paused a little longer, staring out at the pond that seemed now to contain a further enigma. Nothing could be answered tonight, so it was time to get to bed though sleep might be nigh impossible.\\n\\n He continued on his way along Peace Street toward the mansion, which was dark. He had no idea what the hour was, though it must be long past midnight. and with the next step he took he suddenly stopped and froze, looking straight ahead.\\n\\n a figure in a tricorn hat and dark cloak was striding briskly past the mansion, in the direction of the slaves\u0027 quarters. It took no more than five or six seconds for the figure to disappear from view. Matthew hadn\u0027t seen if the man was carrying an unlit lantern or not, but he knew who it was. The fox was on the prowl, he thought. Going to what destination, and for what purposei\\n\\n This indeed was a night of opportunities, though this one Matthew realized might be far more treacherous than the blacksmith\u0027s hatchet.\\n\\n His mouth was dry, his blood racing. He looked around but saw no other person out on the street. The embers of the school house still glowed a faint red, and the breeze blew a whirl of sparks into the sky.\\n\\n He would have to go. He knew it. But he would have to hurry, to find the fox before he got away into the swamp. The fox would be wary around the watchman\u0027s tower, and so too would Matthew have to be because he couldn\u0027t depend on the fact that the watchman was asleep.\\n\\n a little dagger of fear stabbed Matthew in the chest. Whoever that midnight prowler was, he was likely to be dangerous if he realized he was being followed. There was the chance that, out in the swamp, anything could happen, and all of it bad.\\n\\n But there was no time for dawdling. Fear would have to be conquered. The fox was moving fast, and so must Matthew. \\n\\n","sourceLink":"https://allnovel.net/speaks-the-nightbird-matthew-corbett-1/page-23.html","bookId":2250,"book":{"id":2250,"title":"Speaks the Nightbird (Matthew Corbett #1)","description":"Storyline: Speaks the Nightbird (Matthew Corbett #1) \\n Judgment of the Witch \\n The Carolinas, 1699: The citizens of Fount Royal believe a witch has cursed their town with inexplicable tragedies  and they demand that beautiful widow Rachel Howarth be tried and executed for witchcraft. Presiding over the trial is traveling magistrate Isaac Woodward, aided by his astute young clerk, Matthew Corbett. Believing in Rachel\u0027s innocence, Matthew will soon confront the true evil at work in Fount Royal.... \\n Evil Unveiled \\n After hearing damning testimony, magistrate Woodward sentences the accused witch to death by burning. Desperate to exonerate the woman he has come to love, Matthew begins his own investigation among the townspeople. Piecing together the truth, he has no choice but to vanquish a force more malevolent than witchcraft in order to save his beloved Rachel and free Fount Royal from the menace claiming innocent lives.\\n","cover":"https://allnovel.net/images/speaks-the-nightbird-matthew-corbett-1.jpg","author":"Robert McCammon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/speaks-the-nightbird-matthew-corbett-1.html","creation":"Oct 5, 2019 8:58:30 AM","modification":"Oct 5, 2019 5:09:27 PM"}}
