{"id":85915,"no":35,"title":"Page 35","content":"a PaSSING THUNDERSHOWER had wet the earth just before dawn, but Saturday\u0027s sun shone through the dissipating clouds, and the blue sky again reappeared before the hour of eight. By then Matthew had finished his breakfast and was on his way to the maskers\u0027 camp.\\n\\n He discovered - by sense of hearing before sense of sight - Phillip Brightman in discourse with two other thespians, all of them sitting in chairs behind a canvas screen, reading over and reciting pages from one of their morality scenes. When Matthew asked where he might find David Smythe, Brightman directed him to a yellow awning set up to protect a number of trunks, lanterns, and sundry other prop items. Beneath it Matthew found Smythe inspecting some brightly hued costumes that one of the troupe\u0027s women was adorning with rather used-looking peacock feathers.\\n\\n \"Good morning, Mr. Smythe, \" Matthew said. \"May I have a word with youi\"\\n\\n \"Oh... good morning, Mr. Corbett. What may I help you withi\"\\n\\n Matthew glanced quickly at the seamstress. \"May we speak in private, pleasei\"\\n\\n \"Certainly. Mrs. Prater, these are coming along very well. I\u0027ll speak with you again when the work is further advanced. Mr. Corbett, we might go over there if you like.\" Smythe motioned toward a stand of oak trees about sixty feet behind the encampment.\\n\\n as they walked, Smythe slid his thumbs into the pockets of his dark brown breeches. \"I think an apology is in order for our behavior last night. We left so abruptly... and for such an obvious reason. at least we might have tempered it with a more diplomatic excuse.\"\\n\\n \"No apology is necessary. Everyone understood the reason. and better the truth than a false excuse, no matter how diplomatic.\"\\n\\n \"Thank you, sir. I appreciate your candor.\"\\n\\n \"The reason I wished to speak to you, \" Matthew said as they reached the oak trees\u0027 shade, \"concerns Gwinett Linch. The man you believe to be Jonathan Lancaster.\"\\n\\n \"If I may correct you, not believe to be. as I said last night, I would swear to it. But he appears... so different. So changed. The man I knew would not be... well, would not be caught dead in such dirty rags. In fact, I recall he had a marked affinity for cleanliness.\"\\n\\n \"and orderi\" Matthew asked. \"Would you say he had an affinity for that as welli\"\\n\\n \"He kept his wagon neat enough. I remember one day he complained to my father about not having a supply of wheel grease on hand to silence a squeak.\"\\n\\n \"Hm, \" Matthew said. He leaned against the trunk of an oak and crossed his arms. \"Exactly who was... I mean, who is... Jonathan Lancasteri\"\\n\\n \"Well, I mentioned he had an act that involved trained rats. He had them jump through hoops and run races and such. The children loved it. Our circus travelled through most of England, and we did play London on several occasions but we found ourselves restricted to a very bad part of the city. So we mostly travelled from village to village. My father was the manager, my mother sold tickets, and I did whatever needed doing.\"\\n\\n \"Lancaster, \" Matthew said, guiding Smythe back to the subject. \"He made his living with this trained rat showi\"\\n\\n \"Yes, he did. None of us were exactly wealthy, but... we all pulled together.\" Smythe frowned, and Matthew could tell he was forming his next statement. \"Mr. Lancaster... was a puzzling man.\"\\n\\n \"How soi Because he worked with ratsi\"\\n\\n \"Not only that, \" Smythe said. \"But because of the other act he performed. The one that was done... well... that was done only behind closed curtains, for a small audience of adults - no children allowed - who wished to pay an extra coin to see it.\"\\n\\n \"and what was thati\"\\n\\n \"His display of animal magnetism.\"\\n\\n \"animal magnetismi\" Now it was Matthew\u0027s turn to frown. \"What is thati\"\\n\\n \"The art of magnetic manipulation. Have you not heard of such a thingi\"\\n\\n \"I\u0027ve heard of the process of magnetism, but never animal magnetism. Is this some theatrical whimsyi\"\\n\\n \"It\u0027s been more popular in Europe than in England, I understand. Particularly in Germany, according to what my father told me. Mr. Lancaster was once a leading light of the cult of magnetism in Germany, though he was English-born. This is also according to my father, who if nothing else has a fortune of friends in the craft of public entertainment. That was, however, in Mr. Lancaster\u0027s younger years. an incident occurred that caused him to flee Germany.\"\\n\\n \"an incidenti Do you know what it wasi\"\\n\\n \"I know what my father told me, and wished me to keep secret.\"\\n\\n \"You are no longer in England and no longer under your father\u0027s jurisdiction, \" Matthew said. \"It is vital that you tell me everything you know about Jonathan Lancaster. Particularly the secrets.\"\\n\\n Smythe paused and cocked his head to one side. \"May I ask why this is so important to youi\"\\n\\n It was a fair question. Matthew said, \"I\u0027m going to trust you, as I hope you will trust me. Obviously Lancaster has hidden his true identity from Mr. Bidwell and everyone else in this town. I wish to know why. also... I have reason to believe that Lancaster may be involved with the current situation in which this town finds itself.\"\\n\\n \"Whati You mean the witchi\" Symthe offered a nervous smile. \"You\u0027re joking!\"\\n\\n \"I am not, \" Matthew said firmly.\\n\\n \"Oh, that can\u0027t be! Mr. Lancaster may have been strange, but he wasn\u0027t demonic. I\u0027d venture that his closed-curtain talent appeared to some to be witchcraft, but it was evidently based on principles of science.\"\\n\\n \"ah.\" Matthew nodded, his heartbeat quickening. \"Now we approach the light, Mr. Smythe. What exactly was his closed-curtain talenti\"\\n\\n \"Manipulation of the mind, \" Smythe answered, and Matthew had to struggle to suppress a victorious grin. \"By the application of magnetic force, Mr. Lancaster could deliver mental commands to some members of his audience, and cause them to do, believe, and say things that... um... would probably not suit the eyes and ears of children. I have to admit; I sneaked behind the curtains and watched on more than a few occasions, because it was a fascinating show. I recall he would cause some to believe day was night, and that they were getting ready for their beds. One woman he caused to believe was freezing in a snowstorm in the midst of July. a particular scene I remember was a man he caused to believe had stepped into a nest of biting ants, and how that man jumped and hollered was nothing short of ludicrous. The other members of the audience laughed uproariously, but that man never heard a giggle of it until Mr. Lancaster awakened him.\"\\n\\n \"awakened himi These people were put to sleep in some wayi\"\\n\\n \"It was a sleep-like state, yet they were still responsive. Mr. Lancaster used various objects to soothe them into this state, such as a lantern, a candle, or a coin. anything that served to secure their attention. Then he would further soothe and command them with his voice... and once you heard his voice, it was unforgettable. I myself would have fallen under his magnetism, if I hadn\u0027t known beforehand what he was doing.\"\\n\\n \"Yes, \" Matthew said, staring past Smythe in the direction of Fount Royal. \"I can well understand that.\" He directed his gaze back to the man. \"But what is this about magnetismi\"\\n\\n \"I don\u0027t quite fathom it, but it has to do with the fact that all bodies and objects hold iron. Therefore a skilled practitioner can use other objects as tools of manipulation, since the human body, blood, and brain also contain iron. The attraction and manipulation is called magnetism. That, at least, is how my father explained it when I asked him.\" Symthe shrugged. \"Evidently it was a process first discovered by the ancient Egyptians and used by their court magicians.\"\\n\\n Matthew was thinking 7 have you now, Sir Fox.\\n\\n \"This must be very important to you indeed, \" Smythe said, dappled sunlight falling through the oak branches and leaves onto his face.\\n\\n \"It is. as I said, vital.\"\\n\\n \"Well... as you also said, I am no longer in England or under my father\u0027s jurisdiction. If it\u0027s so vital that you know... the secret my father asked me to keep concerns Mr. Lancaster\u0027s career before he joined the circus. In his younger years he was known as a healer of sorts. a faith-healer, I suppose, in that he could use magnetism to deliver people from illnesses. apparently he travelled to Europe to practise this art, and drew the attention of a German nobleman who wished Mr. Lancaster to teach him and his son how to be magnetizers themselves. Now... be aware that all this I recall my father telling me, and I might have garbled it in the retelling.\"\\n\\n \"I shall, \" Matthew said. \"But please continue.\"\\n\\n \"Mr. Lancaster did not speak German, though his host spoke a little English. There was a translation problem. Whether that had anything to do with the results, I don\u0027t know, but my father told me Mr. Lancaster had fled Germany because the nobleman and his son were adversely affected by their studies. The latter killed himself with a poisoned dagger, and the former went half-mad. Which I suppose testifies to the power of magnetism falling into the wrong hands. In any case, a bounty was offered on Mr. Lancaster\u0027s head and so he returned to England. But he obviously was a changed man, too, and he sank to the level of trained rats and a few magnetist\u0027s tricks behind closed curtains.\"\\n\\n \"Possibly he wished to keep a low profile, \" Matthew said, \"for fear that someone would seek him out and claim the bounty.\" He nodded. \"Yes, that explains a lot. as, for instance, why Goode told me no Dutchmen or Germans had seen the Devil. It was because Lancaster feared Germans and likely is limited to only the English tongue.\"\\n\\n \"Goodei\" Smythe asked, looking perplexed. \"I\u0027m sorry, I\u0027m not following you.\"\\n\\n \"My apologies. My thoughts became words.\" Matthew, his nervous energy at high flux, began to pace back and forth. \"Tell me this, if you will: what caused Lancaster to leave the circus, and when was thisi\"\\n\\n \"I don\u0027t know. My family and I left before Mr. Lancaster did.\"\\n\\n \"Oh. Then you haven\u0027t seen Lancaster sincei\"\\n\\n \"No. Certainly we didn\u0027t wish to return to that circus.\"\\n\\n Matthew caught a hint of bitterness. \"Whyi Was your father dischargedi\"\\n\\n \"Not that. It was my father\u0027s wish to leave. He didn\u0027t care for the way Mr. Cedarholm - the man who owned the circus - had decided to run things. My father is a very decent man, God love him, and he bridled about bringing in the freaks.\"\\n\\n Matthew suddenly stopped his pacing. \"Freaksi\"\\n\\n \"Yes. Three of them, to begin with.\"\\n\\n \"Three, \" Matthew repeated. \"May I... ask what they werei\"\\n\\n \"The first was a black-skinned lizard, as big as a ram. The thing had come from some South Sea island, and it near made my mother faint to look upon it.\"\\n\\n \"The second, \" Matthew said, his mouth dry. \"Might it have been an imp of some kindi a dwarf, possibly, with a childlike face and long white hairi\"\\n\\n \"Yes. Exactly that. How did...\" Now Smythe truly appeared confounded. \"How did you knowi\"\\n\\n \"The third, \" Matthew prompted. \"Was it... an unspeakable thingi\"\\n\\n \"The third one was what made my father pack our bags. It was a hermaphrodite with the breasts of a woman and... the tools of a man. My father said even Satan would shrink to look upon such a blasphemy.\"\\n\\n \"Your father might be interested, Mr. Smythe, to know that all three of those creatures have lately found work in Fount Royal, with Satan\u0027s blessing. Oh, I have him now! I have him!\" Matthew couldn\u0027t restrain himself from smacking his palm with his fist, his eyes bright with the fire of the hunt. He immediately reined in his enthusiasm, as he noted that Smythe took a backward step and appeared concerned that he might be dealing with a lunatic. \"I have a request. again, a very important one. I happen to know where Lancaster lives. It\u0027s not very far from here, at the end of this street. Would you go there with me - this moment - and look upon him face-to-face and tell me you positively know he\u0027s the man you claim him to bei\"\\n\\n \"I\u0027ve already told you. I saw his eyes, which are as unforgettable as his voice. It is him.\"\\n\\n \"Yes, but nevertheless I require you to identify him in my presence.\" Matthew also wanted Lancaster to know before another hour had passed that a blade had been thrust into his repugnant, inhuman plans, and twisted for good measure.\\n\\n \"I... do have some work to get done. Perhaps later this afternooni\"\\n\\n \"No, \" Matthew said. \"Now.\" He correctly read the reticence in Smythe\u0027s eyes. \"as an officer of the court, I must tell you this is official business. also that I am empowered by Magistrate Woodward to compel you to accompany me.\" It was an outright falsehood, but Matthew had no time for dawdling.\\n\\n Smythe, who obviously had well learned the lessons of decency from his esteemed father, said, \"No compelling is necessary, sir. If this has to do with a matter of law, I should be glad to go.\"\\n\\n Matthew and Smythe proceeded along Industry Street - the former in expectant haste and the latter more understandably moderate in his willingness to advance - toward the house of the formerly known Gwinett Linch. Smythe\u0027s pace slowed as they reached the execution field, and he regarded the stake and pyre with dread fascination. an oxcart had been pulled up beside the woodpile, and two men - one of them the giant Mr. Green, Matthew saw - were at work unloading another cargo of witch-burning fuel.\\n\\n Yes, build it up! Matthew thought. Waste your muscles and your minutes, for when this day is done one less nightbird shall be confined in a cage and one more vulture there in her place!\\n\\n Further on stood the house. \"My God!\" Smythe said, aghast. \"Mr. Lancaster lives therei\"\\n\\n \"Lancaster lives within, \" Matthew replied, his pace yet quickening. \"The ratcatcher has groomed the exterior.\"\\n\\n He felt a gnaw of disappointment. No smoke rose from the chimney, though indeed the breakfast hour was long past. But all the shutters were closed, indicating that Lancaster was out. Matthew inwardly muttered a curse, for he\u0027d wished to have this identification promptly done and then escort Smythe directly to see Bidwell. It dawned on him that if Lancaster was indeed in there, closed up from the sunlight like a night-faring roach, he might turn violent, and they had no weapon of defense. Perhaps it would be best to go fetch Mr. Green as a precaution. But then another thought hit Matthew, and this one had terrible implications.\\n\\n What if Lancaster, upon knowing he\u0027d been recognized, had fled Fount Royali He would have had ample time last night. But what was the procedure for getting out the gate after sunseti Surely such a thing was unheard of. Would the watchman have allowed him to leave without informing Bidwelli But what if Lancaster had saddled a horse and gone yesterday afternoon while it was still lighti\\n\\n \"You\u0027re near running!\" Smythe said, trying to keep up. Without Lancaster, Rachel\u0027s fate was still in doubt. Damned right Matthew was nearly running, and he did break into a run the final twenty yards.\\n\\n He slammed his fist on the door. He had expected no answer, and therefore was immediately prepared to do what he next did: open the door and enter.\\n\\n Before he could cross the threshold, Matthew was struck in the face.\\n\\n Not by any physical fist, but rather by the overwhelming smell of blood. He instinctively recoiled, his mouth coming open in a gasp.\\n\\n These were the things he saw, in a torrent of hideous impressions: light, streaming between the shutter slats and glistening off the dark red blood that had pooled on the floorboards and made large brown blotches on the pallet\u0027s sheet; Lancaster\u0027s corpse, lying on its right side on the floor, the left hand gripping at the sheet as if to pull itself up, the mouth and icy gray eyes horribly open in a slashed and clawed face, and the throat cut like a red-lipped grin from ear to ear; the formerly meticulous household ravaged as if by a whirlwind, clothes pulled from the trunk and strewn about; desk drawers wrenched out and upturned, cooking implements thrown hither and yon; hearth ashes scooped up and tossed to settle over the corpse like grave dust.\\n\\n Smythe had also seen. He gave a choked moan and staggered back, and then off he ran along Industry Street in the direction of his companions, his face bone-white and his mouth trailing the shattering cry, \"Murder! Murder!\"\\n\\n The shout might have alarmed everyone else who heard it, but it served to steady Matthew\u0027s nerves because he knew he had only a short time to inspect this gruesome scene before being intruded upon. He realized as well that the sight of Lancaster lying dead and so brutally disfigured must have been the same sight viewed by Reverend Grove\u0027s wife and by Jess Maynard, who had discovered Daniel Howarth\u0027s body. Little wonder, then, that Mrs. Grove and the Maynards had fled town.\\n\\n The cut throat. The face savaged by demonic claws. and, it appeared, the shoulders, arms, and chest also slashed through the bloody ribbons of the man\u0027s shirt.\\n\\n Yes, Matthew thought. a true Satan had been at work here.\\n\\n He felt sick to his stomach and scared out of his wits, but he had time for neither debility. He looked about the wreckage. The desk\u0027s drawers, all the papers and everything else dumped out, the inkwell smashed. He wished to find two items before Mr. Green surely arrived: the sapphire brooch and the book on ancient Egypt. But even as he knelt down to negotiate this mess of blood, ink, and blood-inked papers he knew with a sinking certainty that those two items, above all else, would not be found.\\n\\n He spent a moment or two in search, but when he suffered the smear of blood on his hands he gave up the quest as both impossible and unreasonable. He was fast weakening in this charnel house, and the desire for fresh air and untainted sunlight was a powerful call. It occurred to him that Smythe had been correct: Lancaster would indeed not be caught dead in his ratcatcher\u0027s rags, as he wore what had once been a white shirt and a pair of dark gray breeches.\\n\\n and now the need to get out was too much to withstand. Matthew stood up and, as he turned to the door - which had not opened to its full extent, but rather just enough to allow his entry - he saw what was scrawled there on its inner surface in the clotted ink of Lancaster\u0027s veins.\\n\\n My Rachel Is Not alone\\n\\n In the space of a hammered heartbeat Matthew\u0027s flesh prickled and the hairs rose at the back of his neck. The first words that came to his mind were Oh... shit.\\n\\n He was still staring numbly at that damning declaration a moment later when Hannibal Green came through the door, followed by the other rustic with whom he\u0027d been working. at once Green stopped in his tracks, his red-bearded face twisted with horror. \"Christ\u0027s Mercy!\" he said, stunned to the soles of his four-teen-inch boots. \"Linchi\" He looked at Matthew, who nodded, and then Green saw the clerk\u0027s gore-stained hands and hollered, \"Randall! Go fetch Mr. Bidwell! Now!\"\\n\\n In the time that ensued, Green would have thought Matthew a bloody-handed murderer had not David Smythe, pallid but resolute, returned to the scene and explained they\u0027d both been together when the corpse was discovered. Matthew took the opportunity to wipe his hands on one of the clean shirts that had been so rudely torn from the trunk. Then Green had his own hands full trying to keep people who\u0027d been alerted by Smythe\u0027s cry - among them Martin and Constance adams - out of the house.\\n\\n \"Is that Lancasteri\" Matthew asked Smythe, who stood to one side staring down at the corpse.\\n\\n Smythe swallowed. \"His face is... so... swollen, but... I know the eyes. Unforgettable. Yes. This man... was Jonathan Lancaster.\"\\n\\n \"Move back!\" Green told the onlookers. \"Move back, I said!\" Then he had no choice but to close the door in the gawkers\u0027 faces, and thereupon he saw the bloody scrawl.\\n\\n Matthew thought Green might go down, for he staggered as if from a mighty blow. When he turned his head to look at Matthew, his eyes seemed to have shrunken and retreated in his face. He spoke in a very small voice, \"I shall... I shall guard the door from the outside.\" So saying, he was gone like a shot.\\n\\n Smythe had also seen the bloody writing. His mouth opened, but he made not a sound. Then he lowered his head and followed Green out the door with similar haste.\\n\\n Now the die was well and truly cast. alone in the house with the deadly departed, Matthew knew this was the funeral bell for Fount Royal. Once word got out about that declaration on the door - and it was probably beginning its circuit of tongues right now, starting with Green - the town wouldn\u0027t be worth a cup of cold drool.\\n\\n He avoided looking at Lancaster\u0027s face, which had not only been severely clawed but had become misshapen from such injury. He knelt down and continued his search for the brooch and book, this time using a cloth to move aside blood-spattered wreckage. Presently a wooden box caught his attention, and he lifted its lid to find within the tools of the ratcatcher\u0027s trade: the odious long brown seedbag that had served to hold rodent carcasses, the stained deerskin gloves, the cowhide bag, and various wooden jars and vials of - presumably - rat bait. also in the box was the single blade - wiped clean and shining - that had been secured to the end of the ratcatcher\u0027s sticker.\\n\\n Matthew lifted his gaze from the box and looked around the room. Where was the sticker itselfi and - most importantly - where was that fearsome appliance with the five curved blades that Hazelton had fashionedi\\n\\n Nowhere to be seen.\\n\\n Matthew opened the cowhide bag, and in doing so noted two drops and a smear of dried blood near its already-loosened drawstring. The bag was empty.\\n\\n To be such a cleanliness fanatic, why would Lancaster have not wiped the rodent blood from the side of this bag before putting it back into the wooden boxi and why was the five-bladed appliance - -that \"useful device\" as Lancaster had called it - not here with the other utensilsi\\n\\n Now Matthew did force himself to look at Lancaster\u0027s face, and the claw marks upon it. With a mind detached from his revulsion he studied the vicious slashings on the corpse\u0027s shoulders, arms, and chest.\\n\\n He knew.\\n\\n In perhaps another fifteen minutes, during which Matthew searched without success for the appliance, the door opened again - tentatively, this time - and the master of Fount Royal peered in with eyes the size of teacup saucers. \"What... what has happened herei\" he gasped.\\n\\n \"Mr. Smythe and I found this scene. Lancaster has left us, \" Matthew said.\\n\\n \"You mean... Linch.\"\\n\\n \"No. He was never truly Gwinett Linch. His name is - was - Jonathan Lancaster. Please come in.\"\\n\\n \"Must Ii\"\\n\\n \"I think you should. and please close the door.\"\\n\\n Bidwell entered, wearing his bright blue suit. The look of sickness contorted his face. He did close the door, but he remained pressed firmly against it.\\n\\n \"You ought to see what you\u0027re pressing against, \" Matthew said.\\n\\n Bidwell looked at the door, and like Green he staggered and almost fell. His jerking away from it made him step into the bloody mess on the floor and for a dangerous instant he balanced on the precipice of falling alongside the corpse. His fight against gravity was amazing for a man of his size, and with sheer power of determination - and more than a little abject, breeches-wetting terror - he righted himself.\\n\\n \"Oh my Jesus, \" he said, and he took off both his bright blue tricorn and his gray curled wig and mopped his sandy pate with a handkerchief. \"Oh dear God... we\u0027re doomed now, aren\u0027t wei\"\\n\\n \"Steady yourself, \" Matthew instructed. \"This was done by a human hand, not a spectral one.\"\\n\\n \"a human handi are you out of your mindi Only Satan himself could have done this!\" He pushed the handkerchief to his nose to filter the blood smell. \"It\u0027s the same as was done to the reverend and Daniel Howarth! Exactly the same!\"\\n\\n \"Which should tell you the same man committed all three murders. In this case, though, I think there was a falling out of compatriots.\"\\n\\n \"What are you running off at the lips about nowi\" Bidwell\u0027s sickness had receded and anger was beginning to flood into its mold. \"Look at that on the door! That\u0027s a message from the damned Devil! Good Christ, my town will be dust and maggots before sunset! Oh!\" It was a wounded, terrible cry, and his eyes appeared near bursting out. \"If the witch is not alone... then who might the other witches and warlocks bei\"\\n\\n \"Shut up that yammering and listen to me!\" Matthew advanced upon Bidwell until they stood face to sweating face. \"You\u0027ll do yourself and Fount Royal no good to fall to pieces! If your town needs anything now, it\u0027s a true leader, not a bullier or a weeper!\"\\n\\n \"How... how dare you...\"\\n\\n \"Put aside your bruised dignity, sir. Just stand there and listen. I am as confounded about this as you, because I thought Linch - Lancaster - was alone in his crimes. Obviously - and stupidly - I was wrong. Lancaster and his killer were working together to paint Rachel as a witch and destroy your town.\"\\n\\n \"Boy, your love for that witch will put you burning at her side!\" Bidwell shouted, his face bright red and the veins pulsing at his temples. He looked to be courting an explosion that would blow off the top of his head. \"If you wish to go to Hell with her, I can arrange it!\"\\n\\n \"This was written on the door, \" Matthew said coldly, \"by a human hand determined to finish Fount Royal at one fell swoop. The same hand that cut Lancaster\u0027s throat and - when he was dead or dying - used the ratcatcher\u0027s own five-bladed device to strike him repeatedly, thereby giving the impression of a beast\u0027s claws. That device was also used to inflict similar wounds on Reverend Grove and Daniel Howarth.\"\\n\\n \"Yes, yes, yes! It\u0027s all as you say, isn\u0027t iti Everything is as you say!\"\\n\\n \"Most everything, \" Matthew answered.\\n\\n \"Well, you didn\u0027t even see those other bodies, so how can you knowi and what nonsense is this about some kind of five-bladed devicei\"\\n\\n \"You\u0027ve never seen iti Then again, I doubt you would have. Seth Hazelton forged it for the use - he thought - of killing rats. actually, it was probably planned for its current use all along.\"\\n\\n \"You\u0027re mad! absolutely roaring mad!\"\\n\\n \"I am neither mad, \" Matthew said, \"nor roaring, as you are. To prove my sanity, I will ask Mr. Smythe to go to your house and explain to you Lancaster\u0027s true identity as he explained it to me. I think you\u0027ll find it worth your while.\"\\n\\n \"Reallyi\" Bidwell sneered. \"If that\u0027s the case, you\u0027d best go find him! When my carriage passed their camp, the actors were packing their wagons!\"\\n\\n Now a true spear of terror pierced Matthew\u0027s heart. \"Whati\"\\n\\n \"That\u0027s right! They were in a fever to do it, too, and now I know why! I\u0027m sure there\u0027s nothing like finding a Satan-mauled corpse and a bloody message from Hell to put one in mind for a merry play!\"\\n\\n \"No! They can\u0027t leave yet!\" Matthew was out the door faster even than Green\u0027s pistol-ball exit. Straightaway his progress was blocked by the seven or eight persons who stood just outside, including Green himself. Then he had to negotiate a half-dozen more citizens who dawdled between the house and Industry Street. He saw Goode sitting in the driver\u0027s seat of Bidwell\u0027s carriage, but the horses faced west and getting them turned east would take too long. He set off toward the maskers\u0027 camp, running so fast he lost his left shoe and had to forfeit precious time putting it back on.\\n\\n Matthew let loose a breath of relief when he reached the campsite and saw that, though the actors were indeed packing their trunks, costumes, featherboxes, and all the rest of their theatrical belongings, none of the horses had yet been hitched to a wagon. There was activity aplenty, however, and it was obvious to Matthew that Smythe\u0027s tale of what was discovered had put the fear of Hell\u0027s wrath into these people.\\n\\n \"Mr. Brightman!\" Matthew called, seeing the man helping another thespian lift a trunk onto a wagon. He rushed over. \"It\u0027s urgent I speak with Mt. Smythe!\"\\n\\n \"I\u0027m sorry, Mr. Corbett. David is not to be spoken with.\" Brightman looked past Matthew. \"Franklin! Help Charles fold up that tent!\"\\n\\n \"I must, \" Matthew insisted.\\n\\n \"That\u0027s impossible, sir.\" Brightman stalked off toward another area of the camp, and Matthew walked at his side. \"If you\u0027ll pardon me, I have much work to do. We plan on leaving as soon as we\u0027re packed.\"\\n\\n \"You needn\u0027t leave. None of your troupe is in danger.\"\\n\\n \"Mr. Corbett, when we discovered your... um... situation with the witch from a source in Charles Town, I myself was reluctant - extremely reluctant - to come here. But to be perfectly honest we had nowhere else to go. Mr. Bidwell is a very generous friend, therefore I was talked into making the trip.\" Brightman stopped walking and turned to face Matthew. \"I regret my decision, young man. When David told me what had happened... and what he saw in that house... I immediately gave the order to break camp. I am not going to risk the lives of my troupe for any amount that Mr. Bidwell might put on our table. End of pronouncement.\" He began walking once more and boomed, \"Thomas! Make sure all the boots are in that box!\"\\n\\n \"Mr. Brightman, please!\" Matthew caught up with him again. \"I understand your decision to leave, but... please... it is absolutely urgent that I speak to Mr. Smythe. I need for him to tell Mr. Bidwell about - \"\\n\\n \"Young man, \" Brightman said with an exasperated air as he halted abruptly. \"I am trying to be as pleasant as possible under the circumstances. We must - I repeat must - get on the road within the hour. We\u0027ll not reach Charles Town before dark, but I wish to get there before midnight.\"\\n\\n \"Would it not be better to stay the night here, and leave in the morningi\" Matthew asked. \"I can assure you that - \"\\n\\n \"I think neither you nor Mr. Bidwell can assure us of anything. Including the assurance that we\u0027ll all be alive in the morning. No. I thought you had only one witch here, and that was bad enough; but to have an unknown number, and the rest of them lurking about ready and eager to commit murder for their master... no, I can\u0027t risk such a thing.\"\\n\\n \"all right, then, \" Matthew said. \"But can\u0027t I request that Mr. Smythe speak to Mr. Bidwelli It would only take a few minutes and it would - \"\\n\\n \"David cannot speak to anyone, young man, \" Brightman said firmly. \"Did you hear mei I said can not.\"\\n\\n \"Well, where is hei If I can have a moment with him - \"\\n\\n \"You are not listening to me, Mr. Corbett.\" Brightman took a step toward him and grasped his shoulder with one of those viselike hands. \"David is in one of the wagons. Even if I allowed you to see him, it would do no good. I am being truthful when I say that David cannot speak. after he told me what he\u0027d seen - and particularly about the writing - he broke into a fit of shivering and weeping and thereafter was silent. What you don\u0027t know about David is that he is a very sensitive young man. Precariously sensitive, I might say.\"\\n\\n Brightman paused, staring intently into Matthew\u0027s eyes. \"He has had some nervous difficulties in the past. For that reason, he lost his positions with both the Saturn Cross Company and James Prue\u0027s Players. His father is an old friend of mine, and so when he asked me to take his son on as a favor - and watch over him - I agreed. I think the sight of that murdered man has sent him to the edge of... well, it\u0027s best not to say. He has been given a cup of rum and a pair of day-blinders. Therefore I certainly will not let you see him, as he must rest and be quiet for any hope of a prompt recovery.\"\\n\\n \"Can\u0027t I... just... for one...\"\\n\\n \"No, \" Brightman said, his voice like the tolling of a bass-tuned bell. He released his grip on Matthew\u0027s shoulder. \"I\u0027m sorry, but whatever it is you want with David cannot be granted. Now: it was a pleasure to meet you, and I hope all goes well with this witchcraft situation. I hope you sleep with a Bible in your bed and a candle by your hand tonight. Perhaps also a pistol under your pillow. Good luck to you, and goodbye.\" He stood with his arms crossed, waiting for Matthew to move away from the camp.\\n\\n Matthew had to give it one more try. \"Sir, I\u0027m begging you. a woman\u0027s life lies in the balance.\"\\n\\n \"What womani\"\\n\\n He started to speak the name, but he knew it wouldn\u0027t help. Brightman regarded him with a stony stare.\\n\\n \"I don\u0027t know what intrigues are in progress here, \" Bright-man said, \"and neither do I wish to know. It is my experience that the Devil has a long arm.\" He scanned the vista of Fount Royal, his eyes saddened. \"It pains me to say it, but I doubt we shall have need to come this way next summer. Many fine people lived here, and they were very kind to us. But... such are the tides of life. Now please pardon me, as I have work to do.\"\\n\\n Matthew could say nothing more. He watched as Brightman walked away to join a group of men who were taking down the yellow awning. Horses were being hitched to one of the wagons, and the other horses were being readied. It occurred to him that he might assert his rights and go to each wagon in turn until Smythe was found, but what theni If Smythe was too anguished to speak, what good would it doi But no, he couldn\u0027t let Smythe just ride out of here without telling Bidwell who the ratcatcher really was! It was inconceivable!\\n\\n and it was equally inconceivable to grab an ailing person with a nervous disorder by the scruff of the neck and shake him like a dog until he talked.\\n\\n Matthew staggered, light-headed, to the other side of Industry Street and sat down at the edge of a cornfield. He watched the camp dwindling as the wagons were further packed. Every few minutes he vowed he would stand, march defiantly over there and find Smythe for himself. But he remained seated, even when a whip cracked and the cry \"Get up!\" rang out and the first wagon creaked away.\\n\\n Once the departure of wagons had begun, the others soon followed. Brightman, however, remained with the final wagon and helped the Falstaffian-girthed thespian lift a last trunk and two smaller boxes. Before the work was completed, Bidwell\u0027s carriage came into view. Bidwell bade Goode halt, and Matthew watched as the master of Fount Royal climbed down and went to speak with Brightman.\\n\\n The discussion lasted only three or four minutes. Bidwell did a lot of listening and nodding. It ended with the two men shaking hands, and then Brightman got up onto the driver\u0027s plank of his wagon, which the Falstaffian gentleman already occupied. a whip popped, Brightman boomed, \"Go on there, go on!\" and the horses began their labor.\\n\\n Matthew felt tears of bitter frustration burn his eyes. He bit his lower lip until it nearly bled. Brightman\u0027s wagon trundled away. Matthew stared at the ground until he saw a shadow approaching, and even then he kept his head bowed.\\n\\n \"I have assigned James Reed to guard the house, \" Bidwell said. His voice was wan and listless. \"James is a good, dependable man.\"\\n\\n Matthew looked up into Bidwell\u0027s face. The man had donned both his wig and tricorn again, but they sat at crooked angles. Bidwell\u0027s face appeared swollen and the color of yellow chalk, his eyes like those of a shot-stunned animal. \"James will keep them out, \" he said, and then he frowned. \"What shall we do for a ratcatcheri\"\\n\\n \"I don\u0027t know, \" was all Matthew could say.\\n\\n \"a ratcatcher, \" Bidwell repeated. \"Every town must have one. Every town that wishes to grow, I mean.\" He looked around sharply as another wagon - this one open-topped and carrying the hurriedly packed belongings of Martin and Constance adams - passed along Industry Street on its way out. Martin was at the reins, his face set with grim resolve. His wife stared straight ahead also, as if terrified to even glance back at the house they were fleeing. The child, Violet, was pressed between them, all but smothered.\\n\\n \"Essential for a town, \" Bidwell went on, in a strangely calm tone. \"That rats be controlled. I shall... I shall put Edward on the problem. He will give me sound advice.\"\\n\\n Matthew clasped his fingers to his temples and then released the pressure. \"Mr. Bidwell, \" he said. \"We are dealing with a human being, not Satan. One human being. a cunning fox of which I have never before seen the like.\"\\n\\n \"They\u0027ll be frightened at first, \" Bidwell replied. \"Yes, of course they will be. They were so looking forward to the maskers.\"\\n\\n \"Lancaster was murdered because his killer knew he was about to be exposed. Either Lancaster told that man - or a very strong and ruthless woman - about Smythe identifying him... or the killer was in your house last night when Smythe related it to me.\"\\n\\n \"I think... some of them will leave. I can\u0027t blame them. But they\u0027ll come to their senses, especially with the burning so near.\"\\n\\n \"Please, Mr. Bidwell, \" Matthew said. \"Try to hear what I\u0027m saying.\" He lowered his head again, his mind almost overwhelmed by what he was thinking. \"I don\u0027t believe Mr. Winston to be capable of murder. Therefore... if indeed the killer was someone in your house last night... that narrows the field to Mrs. Nettles and Schoolmaster Johnstone.\" Bidwell was silent, but Matthew heard his rough breathing.\\n\\n \"Mrs. Nettles... could have overheard, from outside the parlor. There may be... may be a fact I\u0027ve missed about her. I recall... she said something important to me, concerning Reverend Grove... but I can\u0027t draw it up. The schoolmaster... are you absolutely certain his knee is - \"\\n\\n Bidwell began to laugh.\\n\\n It was possibly the most terrible sound Matthew had ever heard. It was a laugh, yes, but also in the depths of it was something akin to a strangled shriek.\\n\\n Matthew raised his eyes to Bidwell and received another shock. Bidwell\u0027s mouth was laughing, but his eyes were holes of horror and tears had streaked down his cheeks. He began to back away as the laughter spiralled up and up. He lifted his arm and aimed his index finger at Matthew, his hand trembling.\\n\\n The crazed laughter abruptly stopped. \"You, \" he rasped. and now not only was he weeping, but his nose had begun to run. \"You\u0027re one of them, aren\u0027t youi Sent to ruin my town and drive me mad. But I\u0027ll beat you yet! I\u0027ll beat all of you! I\u0027ve never failed and I shall not fail! Do you hear mei Never failed! and I shall not ... shall not... shall - \"\\n\\n \"Mr. Bidwell, suhi\" Goode had stepped beside the man and gently taken hold of his arm. Though it was such an improper gesture between slave and master, Bidwell made no attempt to pull away. \"We ought best be goin\u0027.\"\\n\\n Bidwell continued to stare at Matthew, his eyes seeing only a prince of destruction. \"Suhi\" Goode prompted quietly. \"Ought be goin\u0027.\" He gave Bidwell\u0027s arm just the slightest tug.\\n\\n Bidwell shivered, though the sun was bright and warm. He lowered his gaze and wiped the tearstreaks from his face with the back of his free hand. \"Oh, \" he said; it was more the exhalation of breath than speech. \"I\u0027m tired. Near... worn out.\"\\n\\n \"Yes suh. You do needs a rest.\"\\n\\n \"a rest.\" He nodded. \"I\u0027ll feel better after a rest. Help me to the carriage, will youi\"\\n\\n \"Yes suh, I will.\" Goode looked at Matthew and put a finger to his lips, warning Matthew to make no further utterances. Then Goode steadied Bidwell, and the slave and master walked together to the carriage.\\n\\n Matthew remained where he was. He watched Goode help his master into a seat, and then Goode got up behind the horses, flicked the reins, and the horses started off at an ambling pace.\\n\\n When the carriage had departed from sight, Matthew stared blankly at the empty field where the maskers had been and thought he might weep himself.\\n\\n His hopes of freeing Rachel were wrecked. He had not a shred of evidence to prove any of the things he knew to be true. Without Lancaster - and without Smythe to lend credence to the tale - the theory of how Fount Royal had been seduced by mental manipulation was a madman\u0027s folly. Finding the sapphire brooch and the book on ancient Egypt would have helped, but the killer had already known their value - and must have been well aware of their presence - and so had stolen them away as efficiently as he had murdered Lancaster. He - or she, God forbid - had even torn up the house so no one would know the ratcatcher\u0027s true living habits.\\n\\n So. What nowi\\n\\n He had come through this maze to find himself at a dead end. Which only meant, he believed, that he must retrace his steps and search for the proper passage. But the time was almost gone.\\n\\n almost gone.\\n\\n He knew he was grasping at straws by accusing either the schoolmaster or Mrs. Nettles. Lancaster might have told his killer yesterday that he\u0027d been recognized, and the cunning fox had waited until long after dark to visit the wretched-looking house. Just because Smythe had revealed his recognition to Matthew in Bidwell\u0027s parlor didn\u0027t mean the killer had been there to overhear it.\\n\\n He trusted Mrs. Nettles, and did not want to believe she had a hand in this. But what if everything the woman had said was a liei What if she had been manipulating him all alongi It might not have been Lancaster who took the coin, but Mrs. Nettles. She certainly could have laid the magistrate out cold if she\u0027d chosen to.\\n\\n and the schoolmaster. an Oxford man, yes. a highly educated man. The magistrate had seen Johnstone\u0027s deformed knee, it was true, but still...\\n\\n There was the question of the bearded surveyor and his interest in the fount. It was important. Matthew knew it was, but he could not prove it.\\n\\n Neither could he prove the fount was a pirate\u0027s treasure vault, nor indeed that it held a single coin or jewel.\\n\\n Neither could he prove that any of the witnesses had not actually seen what they believed to see, and that Rachel hadn\u0027t made those damning poppets and hidden them in her house.\\n\\n Neither could he prove that Rachel had been chosen as the perfect candidate to paint as a witch by two persons - possibly morei - who both were masters of disguise.\\n\\n Certainly he couldn\u0027t prove that Linch was Lancaster and Lancaster had been murdered by his accomplice, and that Satan himself didn\u0027t scrawl that message on the door.\\n\\n Now Matthew truly felt close to weeping. He knew everything - or almost everything - of how it had been done, and he felt sure he knew why it had been done, and he knew the name of one of the persons who\u0027d done it...\\n\\n But without proof he was a beggar in the house of justice, and could expect not a single scrap.\\n\\n another wagon passed along Industry Street, carrying a family and their meager belongings away from this accursed town. The last days of Fount Royal had come.\\n\\n and Matthew was keenly aware that Rachel\u0027s last hours were passing away, and that on Monday morning she would surely burn and for the rest of his life - the rest of his miserable, frost-souled life - only he would know the truth.\\n\\n No, that was wrong. There would be one other, who would grin as the flames roared and the ashes flew, as the houses emptied and the dream perished. Who would grin as the thought came clear: all the silver, gold, and jewels... all mine now... and those fools never even knew.\\n\\n Only one fool knew. and he was powerless to stop either the flow of time or the flow of citizens fleeing Fount Royal. \\n\\n","sourceLink":"https://allnovel.net/speaks-the-nightbird-matthew-corbett-1/page-35.html","bookId":2250,"book":{"id":2250,"title":"Speaks the Nightbird (Matthew Corbett #1)","description":"Storyline: Speaks the Nightbird (Matthew Corbett #1) \\n Judgment of the Witch \\n The Carolinas, 1699: The citizens of Fount Royal believe a witch has cursed their town with inexplicable tragedies  and they demand that beautiful widow Rachel Howarth be tried and executed for witchcraft. Presiding over the trial is traveling magistrate Isaac Woodward, aided by his astute young clerk, Matthew Corbett. Believing in Rachel\u0027s innocence, Matthew will soon confront the true evil at work in Fount Royal.... \\n Evil Unveiled \\n After hearing damning testimony, magistrate Woodward sentences the accused witch to death by burning. Desperate to exonerate the woman he has come to love, Matthew begins his own investigation among the townspeople. Piecing together the truth, he has no choice but to vanquish a force more malevolent than witchcraft in order to save his beloved Rachel and free Fount Royal from the menace claiming innocent lives.\\n","cover":"https://allnovel.net/images/speaks-the-nightbird-matthew-corbett-1.jpg","author":"Robert McCammon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/speaks-the-nightbird-matthew-corbett-1.html","creation":"Oct 5, 2019 8:58:30 AM","modification":"Oct 5, 2019 5:09:27 PM"}}
