{"id":85884,"no":4,"title":"Page 4","content":"aT LaST THE aFTERNOON SUN had cleaved a path through the clouds and shone now on the drenched earth. The weather had warmed considerably, compared to the chill of the night before. This was more like the usual May, though the clouds - dark gray and swollen with more ghastly rain - were still looming, slowly converging together from all points of the compass to overtake the sun again. \"Go on,\" said the heavyset, lavishly bewigged man who stood at a second-floor window of his house, overlooking the vista. \"I am listening.\" The second man in the room - which was a study lined with shelves and leather-bound books, a gold-and-red Persian rug on the pinewood floor - sat on a bench before a desk of african mahogany, a ledger book open in his lap. He was the visitor here, however, as the bewigged man had recently lifted his 220-pound bulk from his own chair, which stood on the other side of the desk facing the bench. The visitor cleared his throat and placed a finger upon a line written in the ledger. \"The cotton plants have again failed to take root,\" he said. \"Likewise the tobacco seedlings.\" He hesitated before he delivered the next blow. \"I regret to say that two-thirds of the apple trees have been blighted.\" \"Two-thirdsi\" said the man at the window, without turning away from the view. His wig, a majesty of white curls, flowed down around the shoulders of his dark blue, brass-buttoned suit. He wore white ruffles at his sleeves, white stockings on his thick calves, and polished black shoes with silver buckles. \"Yes, sir. The same is true of the plum trees, and about half of the pears. at present the blackcherries have been spared, but it is Goode\u0027s opinion that a parasite of some kind may have laid eggs in all the fruit trees. The pecans and the chestnuts are so far unblemished, but the fields have been washed to the extent that many of their roots are now aboveground and vulnerable to harm.\" The speaker halted in his recitation of agricultural maladies and pushed his spectacles up a little further on his nose. He was a man of medium height and stature, also of medium age and appearance. He had light brown hair, a lofty forehead, and pale blue eyes, and he bore the air of a wearied accountant. His clothes, in contrast to the other man\u0027s finery, consisted of a plain white shirt, brown cloth waistcoat, and tan trousers. \"Continue, Edward,\" the man at the window urged quietly. \"I am up to the hearing.\" \"Yes, sir.\" The speaker, Edward Winston, returned his attention to the items quilled in the ledgerbook. \"Goode has made a suggestion regarding the fruit trees that he felt important for me to pass to you.\" again, he paused. \"and that suggestion isi\" Winston lifted his hand and slowly ran two fingers across his mouth before he went on. The man at the window waited, his broad back held straight and rigid. Winston said, \"Goode suggests they be burned.\" \"How many treesi Only those afflicted, yesi\" \"No, sir. all.\" There was a long silence. The man at the window pulled in his breath and let it slowly out, and when he did so his shoulders lost their square set and began to sag. \"all,\" he repeated. \"Goode believes that burning is the only way to kill the parasite. He says it will do no good in the long run to destroy only the trees presently showing ill. Furthermore, he believes that the site of the fruit orchards should be moved and the earth itself cleansed with seawater and ashes.\" The man at the window made a soft noise that had some pain in it. When he spoke, his voice was weak. \"How many trees are to be burned, theni\" Winston consulted his ledger. \"Eighty-four apple, fifty-two plum, seventy-eight blackcherry, forty-four pear.\" \"and so we start over yet again, is that iti\" \"I fear it is, sir. as I always say, it\u0027s better to be safe than sorry.\" \"Damn,\" the man at the window whispered. He placed his hands on the sill and stared down through red-rimmed hazel eyes at his endangered dream and creation. \"Is she cursing us, Edwardi\" \"I don\u0027t know, sir,\" answered Winston, in all candor. Robert Bidwell, the man at the window, was forty-seven years old and scarred with the marks of suffering. His deeply lined face was strained, his forehead furrowed, more lines bracketing his thin-lipped mouth and cutting across his chin. Many of those markings had afflicted him in the past five years, since the day he had been presented with official papers deeding him 990 acres on the coast of the Carolina colony. But this was his dream, and there before him, under the ochre sunlight that slanted through the ominously building clouds, lay his creation. He\u0027d christened it Fount Royal. The reason for the name was twofold: one, to thank King William and Queen Mary for their fount of faith in his abilities as a leader and manager; and two, as a geographic waypoint for future commerce. Some sixty yards from the front gate of Bidwell\u0027s house - which was the sole two-story structure in the community - was the fount itself: an oblong-shaped spring of fresh, cold aquamarine-colored water that covered an expanse of nearly three acres. Bidwell had learned from a surveyor who\u0027d been mapping the area several years ago and who\u0027d also plumbed the spring that it was more than forty feet deep. The fount was of vital importance to the settlement; in this country of salt marshes and stagnant black ponds, the spring meant that fresh water would always be in abundance. Bulrushes grew in the spring\u0027s shallows, and hardy wildflow-ers that had endured the intemperate chill grew in clumps on the grassy banks. as the spring was the center of Fount Royal, all streets - their muddy surfaces made firmer by sand and crushed oyster shells - radiated from it. The streets were four in number, and had been named by Bidwell: Truth ran to the east, Industry to the west, Harmony to the north, and Peace to the south. along those streets were the whitewashed clapboard houses, red barns, fenced pastures, lean-to sheds, and workshops that made up the settlement. The blacksmith toiled at his furnace on Industry Street; on Truth Street stood the schoolhouse, across from the general store; Harmony Street was host to three churchhouses: anglican, Lutheran, and Presbyterian; the cemetery on Harmony Street was not large, but was unfortunately well-planted; Peace Street led past the slave quarters and Bidwell\u0027s own stable to the forest that stood just short of the tidewater swamp and beyond that the sea; Industry Street continued to the orchards and farmland where Bidwell hoped someday to see bounties of apples, pears, cotton, corn, beans, and tobacco; on Truth Street also stood the gaol, where she was kept, and near it the building that served as a meeting-house; the surgeon-barber was located on Harmony Street, next to Van Gundy\u0027s Publick Tavern; and a number of other small enterprises, scattered about the fledgling town in hopes that Bidwell\u0027s dream of a southernmost city might come to fruition. Of the 990 acres Bidwell had purchased, little more than two hundred were actually built upon, tilled, or used as pasture. a wall made of logs, their uptilted ends shaved and honed by axes into sharpened points, had been constructed around the entire settlement, orchards and all, as protection against Indians. The only way in or out - notwithstanding the seacoast, though a watchtower built in the forest there was occupied day and night by a musket-armed militiaman - was through the main gate that opened onto Harmony Street. a watchtower also stood beside the gate, allowing its militiaman a view of anyone approaching on the road. So far in the existence of Fount Royal, the Indian element had offered no trouble; in fact, they\u0027d been invisible, and Bidwell might have questioned whether there were indeed redskins within a hundred miles, if Solomon Stiles hadn\u0027t discovered strange symbols painted on the trunk of a pinetree during a hunting expedition. Stiles, a trapper and hunter of some regard, had explained to Bidwell that the Indians were marking the wilderness beyond the tree as territory not to be trespassed upon. Bid-well had decided not to press the issue, though by the royal deed all that land belonged to him. No, best to let the redskins alone until it was time to smoke them out. Looking down upon the current decrepit condition of his dream hurt Bidwell\u0027s eyes. There were too many empty houses, too many gardens gone to weed, too many broken fences. Un-tended pigs lay about in the muck and dogs wandered, snapping and surly. In the past month five hard-built structures - all deserted at the time - had been reduced to piles of ash by midnight fires, and a burnt smell still tainted the air. Bidwell was aware of whom the residents blamed for these fires. If not her hand directly, then the hands - or claws, as the case might be - of the infernal beasts and imps she invoked. Fire was their language, and they were making their statements very clear. His dream was dying. She was killing it. Though the bars of her cell and the thick walls of the gaol confined her body, her spirit - her phantasm - escaped to dance and cavort with her unholy lover, to plot more wreckage and woe to Bidwell\u0027s dream. To banish such a hydra into the judgment of the wilderness was not enough; she had plainly said she would not go, that no power on earth could make her leave her home. If Bidwell hadn\u0027t been a lawful man, he might have had her hanged at the beginning and been done with it. Now it was a matter for the court, and God help the judge who must sit in attendance. No, he thought grimly. God help Fount Royal. \"Edward,\" BidweU said, \"what is our present populationi\" \"The exact figurei Or an estimatei\" \"an estimate will do.\" \"One hundred or thereabouts,\" Winston offered. \"But that will change before the week is done. Dorcas Chester is ill onto death.\" \"Yes, I know. This damp will fill up our cemetery ere long.\" \"Speaking of the cemetery . . . alice Barrow has taken to bed as well.\" \"alice Barrowi\" Bidwell turned from the window to face the other man. \"Is she ailingi\" \"I had cause to visit John Swaine this morning,\" Winston said. \"according to Cass Swaine, alice Barrow has told several persons that she\u0027s been suffering dreams of the Dark Man. The dreams have so terrified her that she will not leave her bed.\" Bidwell gave an exasperated snort. \"and so she\u0027s spreading them about like rancid butter on scones, is that iti\" \"It seems to be. Madam Swaine tells me the dreams have to do with the cemetery. More than that, she was too fearful herself to say.\" \"Good Christ!\" Bidwell said, the color rising in his jowls. \"Mason Barrow is a sensible man! Can\u0027t he control his wife\u0027s tonguei\" He took two strides to the desk and slapped a hand down upon its surface. \"This is the kind of stupidity that\u0027s destroying my town, Edward! Our town, I mean! But by God, it\u0027ll be ruins in six months if these tongues don\u0027t cease wagging!\" \"I didn\u0027t mean to upset you, sir,\" Winston said. \"I\u0027m only recounting what I thought you should know.\" \"Look out there!\" Bidwell waved toward the window, where the rain-swollen clouds were beginning to seal off the sunlight once again. \"Empty houses and empty fields! Last May we had more than three hundred people! Three hundred! and now you say we\u0027re down to one hundredi\" \"Or thereabouts,\" Winston corrected. \"Yes, and how many will alice Barrow\u0027s tongue send runningi Damn it, I cannot stand by waiting for a judge to arrive from Charles Town! What can I do about this, Edwardi\" Winston\u0027s face was damp with perspiration, due to the room\u0027s humid nature. He pushed his spectacles up on his nose. \"You have no choice but to wait, sir. The legal system must be obeyed.\" \"and what legal system does the Dark Man obeyi\" Bidwell planted both hands on the desk and leaned toward Winston, his own face sweating and florid. \"What rules and regulations constrain his mistressi Damn my eyes, I can\u0027t watch my investment in this land be destroyed by some spectral bastard who shits doom in people\u0027s dreams! I did not build a shipping business by sitting on my bum quaking like a milksop maid.\" This last had been said through gritted teeth. \"Come along or not as you please, Edward! I\u0027m off to silence alice Barrow\u0027s prattling!\" He stalked toward the door without waiting for his town manager, who hurriedly closed his ledger and stood up to follow, like a pug after a barrel-chested bulldog. They descended what to the ordinary citizens of Fount Royal was a wonder to behold: a staircase. It was without a railing, however, as the master carpenter who had overseen the construction of the stairs had died of the bloody flux before its completion. The walls of Bidwell\u0027s mansion were decorated with English pastoral paintings and tapestries, which upon close inspection would reveal the treacheries of mildew. Water stains marred many of the whitewashed ceilings, and rat droppings lay in darkened niches. as Bidwell and Winston came down the stairs, their boots loudly clomping, they became the focus of Bidwell\u0027s housekeeper, who was always alert to her master\u0027s movements. Emma Nettles was a broad-shouldered, heavyset woman in her mid-thirties whose hatchet-nosed and square-chinned face might\u0027ve scared a redskin warrior into the arms of Jesus. She stood at the foot of the stairs, her ample body clad in her customary black cassock, a stiff white cap enforcing the regimented lie of her oiled and severely combed brown hair. \"May I he\u0027p you, siri\" she asked, her voice carrying a distinct Scottish burr. In her formidable shadow stood one of the servant girls. \"I\u0027m away to business,\" Bidwell replied curtly, plucking from a rack on the wall a navy blue tricorn hat, one of several in a variety of colors to match his costumes. He pushed the hat down on his head, which was no simplicity due to the height of his wig. \"I shall have toss \u0027em boys and jonakin for my supper,\" he told her. \"Mind the house.\" He strode past her and the servant girl toward the front door, with Winston in pursuit. \"as I always do, sir,\" the madam Nettles said quietly an instant after the door had closed behind the two men, her flesh-hooded eyes as dark as her demeanor. Bidwell paused only long enough to unlatch the ornate white-painted iron gate - six feet tall and shipped at great expense from Boston - that separated his mansion from the rest of Fount Royal, then continued along Peace Street at a pace that tested Winston\u0027s younger and slimmer legs. The two men passed the spring, where Cecilia Semmes was filling a bucket full of water; she started to offer a greeting to Bidwell, but she saw his expression of angry resolve and thought it best to keep her tongue sheltered. The last of the miserly sunlight was obscured by clouds even as Bidwell and Winston strode past the community\u0027s brass sundial, set atop a wooden pedestal at the conjunction of Peace, Harmony, Industry, and Truth streets. Tom Bridges, guiding his oxcart to his farmhouse and pasture on Industry, called a good afternoon to Bidwell, but the creator of Fount Royal did not break stride nor acknowledge the courtesy. \"afternoon to you, Tom!\" Winston replied, after which he had to conserve his wind for keeping up with his employer as Bidwell took a turn onto the easterly path of Truth. Two pigs occupied a large mud puddle in the midst of the street, one of them snorting with glee as he rooted deeper into the mire while a mongrel dog blotched with mange stood nearby barking his indignation. David Cutter, Hiram abercrombie, and arthur Dawson stood not far from the pigs and puddle, smoking their clay pipes and engrossed in what appeared to be stern conversation. \"Good day, gentlemen!\" Bidwell said as he passed them, and Cutter removed his pipe from his mouth and called out, \"Bidwell! When\u0027s that judge gettin\u0027 herei\" \"In due time, sir, in due time!\" Winston answered, still walking. \"I\u0027m talkin\u0027 to the string puller, not the puppet!\" Cutter fired back. \"We\u0027re gettin\u0027 tired a\u0027 waitin\u0027 for this thing to be resolved! You ask me, they ain\u0027t gonna never send us a judge!\" \"We have the assurances of their councilmen, sir!\" Winston said; his cheeks were stinging from the insult. \"Damn their assurances!\" Dawson spoke up. He was a spindly red-haired man who served as Fount Royal\u0027s shoemaker. \"They might assure us the rain will cease, too, but what of iti\" \"Keep walking, Edward,\" Bidwell urged sotto voce. \"We\u0027ve had a gutful of this dawdlin\u0027!\" Cutter said. \"She needs to be hanged and done with it!\" abercrombie, a farmer who\u0027d been one of the first settlers to respond to Bidwell\u0027s broadsheets advertising the creation of Fount Royal, threw in his two shillings: \"The sooner she hangs, the safer we\u0027ll all sleep! God save us from bein\u0027 burnt up in our beds!\" \"Yes, yes,\" Bidwell muttered, lifting a hand into the air as a gesture of dismissal. His stride had quickened, sweat gleaming on his face and darkening the cloth at his armpits. Behind him, Winston was breathing hard; the air\u0027s sullen dampness had misted his spectacles. With his next step, his right foot sank into a pile of moldering horse apples that Bidwell had just deftly avoided. \"If they send us anybody,\" Cutter shouted as a last riposte, \"it\u0027ll be a lunatic they plucked from the asylum up there!\" \"That man speaks knowingly of asylums,\" Bidwell said, to no one in particular. They passed the schoolhouse and next to it Schoolmaster Johnstone\u0027s house. a pasture where a small herd of cattle grazed stood next to Lindstrom\u0027s farmhouse and barn, and then there was the meeting-house with a flagpole before it from which drooped the British colors. Just a little further on, and Bidwell\u0027s pace hastened even faster; there loomed the rough and windowless hardwood walls of the gaol, its single entrance door secured with a chain and iron lock. In front of the gaol was a pillory where miscreants who thieved, blasphemed, or otherwise incurred the wrath of the town council found themselves bound and sometimes pelted with the same substance that currently weighted Winston\u0027s right boot. Past the gaol, a number of houses with barns, gardens, and small fieldplots occupied the last portion of Truth Street. Some of the houses were empty, and one of them had dwindled to a charred shell. Weeds and thorns had overtaken the forlorn gardens, the fields now more frightful swamp than fruitful earth. Bidwell walked to the door of a house almost at the very end of the street and knocked solidly while Winston stood nearby, blotting the sweat from his face with a shirtsleeve. Presently the door was opened a crack and the grizzled, sunken-eyed face of a man who needed sleep peered out. \"Good afternoon to you, Mason,\" Bidwell said. \"I\u0027ve come to see your wife.\" Mason Barrow knew full well why the master of Fount Royal was at his door; he drew it open and stepped back, his black-haired head slumped like that of a dog about to be whipped. Bid-well and Winston entered the house, which seemed the size of a wig box compared to the mansion they\u0027d recently left. The two Barrow children - eight-year-old Melissa and six-year-old Preston - were also in the front room, the older watching from behind a table and the younger clinging to his father\u0027s trouser leg. Bidwell was not an ungracious man; he removed his hat, first thing. \"She\u0027s to bed, I understand.\" \"Yes sir. Sick to the soul, she is.\" \"I shall have to speak to her.\" \"Yes sir.\" Barrow nodded numbly. Bidwell noted that the two children also looked in need of sleep, as well as in need of a good hot meal. \"as you please.\" Barrow motioned toward the room at the rear of the house. \"Very well. Edward, come with me.\" Bidwell walked to the open door of the other room and looked in. alice Barrow was lying in the bed there, a wrinkled sheet pulled up to her chin. Her eyes were open and staring at the ceiling, her sallow face gleaming with sweat. The room\u0027s single window was shuttered, but the light was strong because seven tallows were aflame, as well as a clay bowl full of pine knots. Bidwell knew it was a remarkable extravagance for a farmer such as Mason Barrow, whose children must be suffering due to this surplus of illumination. as Bidwell stepped across the threshold, a loose plank squeaked underfoot and the woman looked at him; her eyes widened, she sucked in her breath as if she\u0027d been struck, and shrank away from him deeper into the confines of the bed. Bidwell immediately halted where he stood. \"Good afternoon, madam,\" he said. \"May I have a word with youi\" \"Where\u0027s my husbandi\" the woman cried out. \"Mason! Where\u0027s he gonei\" \"I\u0027m here!\" Barrow replied, standing behind the other two men. \"all\u0027s well, there\u0027s naught to fear.\" \"Don\u0027t let me sleep, Mason! Promise me you won\u0027t!\" \"I promise,\" he said, with a quick glance at Bidwell. \"What\u0027s all this nonsensei\" Bidwell asked him. \"The woman\u0027s feared to sleepi\" \"Yes, sir. She fears fallin\u0027 asleep and seein\u0027 - \" \"Don\u0027t speak it!\" alice Barrow\u0027s voice rose again, tremulous and pleading. \"If you love me, don\u0027t speak it!\" The little girl began to cry, the little boy still clinging to his father\u0027s leg. Barrow looked directly into Bidwell\u0027s face. \"She\u0027s in a bad way, sir. She ain\u0027t slept for the past two nights. Cain\u0027t abide the dark, not even the day shadows.\" \"This is how it begins,\" Winston said quietly. \"Rein yourself!\" Bidwell snapped at him. He produced a lace-rimmed handkerchief from a pocket of his jacket and wiped beads of sweat from his cheeks and forehead. \"Be that as it may, Barrow, I must speak to her. Madami May I enteri\" \"No!\" she answered, the damp sheet drawn up to her terror-stricken eyes. \"Go away!\" \"Thank you.\" Bidwell walked to her bedside and stood there, looking down at her with both hands gripping his hat. Winston followed behind him, but Mason Barrow remained in the other room to comfort the crying little girl. \"Madam,\" Bidwell said, \"you must desist in your spreading of tales about these dreams. I know you\u0027ve told Cass Swaine. I would ask - \" \"I told Cass \u0027cause she\u0027s my friend!\" the woman said behind her sheet. \"I told others of my friends too! and why shouldn\u0027t Ii They should know whatIknow, if they value their lives!\" \"and what is it that makes your knowledge so valuable, madami\" She pushed the sheet away and stared defiantly up at him, her eyes wet and scared but her chin thrust toward him like a weapon. \"That whoever lives in this town is sure to die.\" \"That, I fear, is only worth a shilling. all who live in any town are sure to die.\" \"Not by his hand! Not by fire and the torments of Hell! Oh, he told me! He showed me! He walked me through the graveyard, and he showed me them names on the markers!\" The veins in her neck strained, her brown hair lank and wet. She said in an agonized whisper, \"He showed me Cass Swaine\u0027s marker! and John\u0027s too! and he showed me the names of my children!\" Her voice cracked, the tears coursing down her cheeks. \"My own children, laid dead in the ground! Oh, sweet Jesus!\" She gave a terrible, wrenching moan and pulled the sheet up to her face again, her eyes squeezed shut. With all the candle flames, the pine knot smoke, and the humidity seeping in, the room was a hotbox. Bidwell felt as if drawing a breath was too much effort. He heard the rumble of distant thunder, another storm approaching. a response to alice Barrow\u0027s phantasms was in order, but for the life of him Bidwell couldn\u0027t find one. There was no doubt a great Evil had seized upon the town, and had grown in both murky day and blackest night like poisonous mushrooms. This Evil had invaded the dreams of the citizens of Fount Royal and driven them to frenzies. Bidwell knew that Winston was correct: this indeed was how it began. \"Courage,\" he offered, but it sounded so very weak. She opened her eyes; they had become swollen and near-scarlet. \"Couragei\" she repeated, incredulously. \"Courage again\u0027 himi He showed me a graveyard full of markers! You couldn\u0027t take a step without fallin\u0027 over a grave! It was a silent town. Everybody gone ... or dead. He told me. Standin\u0027 right at my side, and I could hear him breathin\u0027 in my ear.\" She nodded, her eyes staring straight through Bidwell. \"Those who stay here will perish and burn in Hell\u0027s fires. That\u0027s what he said, right in my ear. Burn in Hell\u0027s fires, forever and a day. It was a silent town. Silent. He said Shhhhhhhh, alice. He said Shhhhhhhh, listen to my voice. Look upon this, he said, and know what I am.\" She blinked, some of the focus returning to her eyes, but she still appeared dazed and disjointed. \"I did look,\" she said, \"and I do know.\" \"I understand,\" Bidwell told her, trying to sound as calm and rational as a man at the bitter end of his rope possibly could, \"but we must be responsible, and not so eager to spread fear among our fellows.\" \"I\u0027m not wantin\u0027 to spread fear!\" she answered sharply. \"I\u0027m wantin\u0027 to tell the truth of what was shown me! This place is cursed! You know it, I know it, every soul with sense knows it!\" She stared directly at one of the candles. The little girl in the other room was still sobbing, and alice Barrow said with small strength in her voice, \"Hush, Melissa. Hush, now.\" Bidwell, again, was lost for words. He found himself gripping his tricorn with a force that made his fingers ache. The distant thunder echoed, nearer now, and sweat was crawling down the back of his neck. This hotbox room seemed to be closing in on him, stealing his breath. He had to get out. He abruptly turned, almost bowling Winston over, and took the two strides to the door. \"I saw his face,\" the woman said. Bidwell stopped as if he\u0027d run into a brick wall. \"His face,\" she repeated. \"I saw it. He let me see it.\" Bidwell looked at her, waiting for the rest of what she had to say. She was sitting up, the sheet fallen aside, a terrible shiny anguish in her eyes. \"He was wearin\u0027 your face,\" she said, with a savage and half-crazed grin. \"Like a mask, it was. Wearin\u0027 your face, and showin\u0027 me my children laid dead in the ground.\" Her hands came up and covered her mouth, as if she feared she might let loose a cry that would shatter her soul. \"Steady, madam,\" Bidwell said, but his voice was shaky. \"You must tend to reality, and put aside these visions of the netherworld.\" \"We\u0027ll all burn there, if he has his way!\" she retorted. \"He wants her free, is what he wants! Wants her free, and all of us gone!\" \"I\u0027ll hear no more of this.\" Bidwell turned away from her again, and got out of the room. \"Wants her free!\" the woman shouted. \"He won\u0027t let us rest \u0027til she\u0027s with him!\" Bidwell kept going, out the front door, with Winston following. \"Sir! Sir!\" Barrow called, and he came out of the house after them. Bidwell paused, trying mightily to display a calm demeanor. \"Beg pardon, sir,\" Barrow said. \"She meant no disrespect.\" \"None taken. Your wife is in a precarious condition.\" \"Yes, sir. But . . . things bein\u0027 as they are, you\u0027ll understand when I tell you we have to leave.\" a fine drizzle was starting to fall from the dark-bellied clouds. Bidwell pushed the tricorn down on his head. \"Do as you please, Barrow. I\u0027m not your master.\" \"Yes sir.\" He licked his lower lip, plucking up the courage to say what was on his mind. \"This was a good town, sir. Used to be, before . . .\" He shrugged. \"It\u0027s all changed now I\u0027m sorry, but we cain\u0027t stay.\" \"Go on, then!\" Bidwell\u0027s facade cracked and some of his anger and frustration spilled out like black bile. \"No one\u0027s chaining you here! Go on, run like a scared dog with the rest of them! I shall not! By God, I have planted myself in this place and no phantasm shall tear me - \" a bell sounded. a deep-tolling bell. Once, then a second and third time. It was the voice of the bell at the watchman\u0027s tower on Harmony Street. The bell continued to sound, announcing that the watchman had spied someone coming along the road. \" - shall tear me out!\" Bidwell finished, with fierce resolve. He looked toward the main gate, which was kept closed and locked against Indians. New hope blossomed in his heart. \"Edward, it must be the judge from Charles Town! Yes! It has to be! Come along!\" Without another word to Mason Barrow, Bidwell started off toward the junction of the four streets. \"Hurry!\" he said to Winston, picking up his pace. The rain was beginning to fall now in earnest, but not even the worst deluge since Noah would\u0027ve kept him from personally welcoming the judge this happy day. The bell\u0027s voice had started a chorus of dogs to barking, and as Bidwell and Winston rushed northward along Harmony Street - one grinning with excitement and the other gasping for breath - a number of mutts chased round and round them as if at the heels of carnival clowns. By the time they reached the gate, both men were wet with rain and perspiration and were breathing like bellows. a group of a dozen or so residents had emerged from their homes to gather around, as a visitor from the outside was rare indeed. Up in the watchtower, Malcolm Jennings had ceased his pulling on the bell-cord, and two men - Esai Pauling and James Reed - were readying to lift the log that served as the gate\u0027s lock from its latchpost. \"Wait, wait!\" Bidwell called, pushing through the onlookers. \"Give me room!\" He approached the gate and realized he was trembling with anticipation. He looked up at Jennings, who was standing on the tower\u0027s platform at the end of a fifteen-foot-tall ladder. \"are they white meni\" \"Yes sir,\" Jennings answered. He was a slim drink of water with a shockpate of unruly dark brown hair and perhaps five teeth in his head, but he had the eyes of a hawk. \"Two of \u0027em. I mean to say ... I think they be white.\" Bidwell couldn\u0027t decipher what that was supposed to mean, but neither did he want to tarry at this important moment. \"Very well!\" he said to Pauling and Reed. \"Open it!\" The log was lifted and pulled from its latch. Then Reed grasped the two wooden handgrips and drew the gate open. Bidwell stepped forward, his arms open to embrace his savior. In another second, however, his welcoming advance abruptly stopped. Two men stood before him: one large with a bald head, one slender with short-cropped black hair. But neither one of them was the man he\u0027d hoped to greet. He presumed they were white. With all the mud they wore, it was difficult to tell. The larger - and older - had on a mud-covered coat that seemed to be black under its earth daubings. He was barefoot, his skinny legs grimed with muck. The younger man wore only something that might serve as a nightshirt, and he appeared to have recently rolled on the ground in it. He did wear shoes, however filthy they might be. The mutts were so excited by all the commotion that they began to snarl and bark their lungs out at the two arrivals, who seemed dazed at the appearance of people wearing clean clothing. \"Beggars,\" Bidwell said; his voice was quiet, dangerously so. He heard thunder over the wilderness, and thought it must be the sound of God laughing. His welcoming arms fell heavily to his sides. \"I have been sent beggars,\" he said, louder, and then he began to laugh along with God. Soft at first it was, and then the laughter spiraled out of him, raucous and uncontrollable; it hurt his throat and made his eyes water, and though he ardently wanted to stop - ardently tried to stop - he found he had as much power over this laughter as if he\u0027d been a whirligig spun by the hand of a foolish child. \"Beggars!\" he shouted through the wheezing. \"I . . . have . . . run ... to admit beggars!\" \"Sir,\" spoke the larger man, and he took a barefooted step forward. an expression of anger swept across his mud-splattered features. \"Sir!\" Bidwell shook his head and kept laughing - there seemed to be some weeping in it as well - and he waved his hand to dismiss the wayfaring jaybird. Isaac Woodward pulled in a deep breath. If the night of wet hell had not been enough, this crackerjack dandy was here to test his mettle. Well, his mettle broke. He bellowed, \"Sir!\" in his judicial voice, which was loud and sharp enough to silence for a moment even the yapping dogs. \"1 am Magistrate Woodward, come from Charles Town!\" Bidwell heard; he gasped, choked on a last fragment of laughter, and then he stood staring with wide and shocked eyes at the half-naked mudpie who called himself a magistrate. a single thought entered Bidwell\u0027s mind like a hornet\u0027s sting: // they send us anybody, it\u0027ll be a lunatic they plucked from the asylum up there! He heard a moan, quite close. His eyelids fluttered. The world - rainstorm, voice of God, green wilderness beyond, beggars and magistrates, parasites in the apples: ruin and destruction like the shadows of vulture wings - spun around him. He took a backward step, looking for something to lean against. There was nothing. He fell onto Harmony Street, his head full of cold gray fog, and there was cradled to sleep.","sourceLink":"https://allnovel.net/speaks-the-nightbird-matthew-corbett-1/page-4.html","bookId":2250,"book":{"id":2250,"title":"Speaks the Nightbird (Matthew Corbett #1)","description":"Storyline: Speaks the Nightbird (Matthew Corbett #1) Judgment of the Witch The Carolinas, 1699: The citizens of Fount Royal believe a witch has cursed their town with inexplicable tragedies  and they demand that beautiful widow Rachel Howarth be tried and executed for witchcraft. Presiding over the trial is traveling magistrate Isaac Woodward, aided by his astute young clerk, Matthew Corbett. Believing in Rachel\u0027s innocence, Matthew will soon confront the true evil at work in Fount Royal.... Evil Unveiled After hearing damning testimony, magistrate Woodward sentences the accused witch to death by burning. Desperate to exonerate the woman he has come to love, Matthew begins his own investigation among the townspeople. Piecing together the truth, he has no choice but to vanquish a force more malevolent than witchcraft in order to save his beloved Rachel and free Fount Royal from the menace claiming innocent lives.","cover":"https://allnovel.net/images/speaks-the-nightbird-matthew-corbett-1.jpg","author":"Robert McCammon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/speaks-the-nightbird-matthew-corbett-1.html","creation":"Oct 5, 2019 8:58:30 AM","modification":"Oct 5, 2019 5:09:27 PM"}}
