{"id":10096,"no":14,"title":"PART III THE SPIRIT OF SYRIA","content":"In the first and second parts of this book we have been collecting impressions of the Land and its Invaders. It remains for us in the third part to gather these together into something which may enable us to realise more clearly the general meaning and quality of the spirit of Syria. In the main two things must be noted, and the first of them is religious. Whatever else Palestine may be, she is certainly a land with a God. The meaning of Syria is disclosed in her Israelite and Christian periods, whose great fact and characteristic process is the revelation of God to men on earth. All her other invasions have to reckon with that fact. Some of them were bitterly hostile to it, but they were powerless to efface it. Others were indifferent, entering Syria for ends of their own; but history shews them bent over to God’s purposes and unconsciously made the instruments of working out His will. That will brought Israel to her land, isolated her there, hemmed her in, bore her and carried her in everlasting arms on through her centuries, finally was incarnate in her life. For Jesus Christ was a Syrian, and we must orientalise our thoughts of Him before we can rightly understand the Christian revelation.{174} Not less clear is the second impression, which is that of the unfinishedness and imperfection of all things Syrian. It is a place of wreckage, new and old. But the peculiarity of that wreckage is that it was always there, more or less. None of the ideals of the land were ever quite realised. It was never completely conquered by the Israelites, their ambition stopping short and their energy flagging before their task was done. It was never completely cultivated, or made to yield its full harvest of natural wealth. In countless small things this incompleteness is evident. The contrast between the beauty of the distant view and the disorder and slovenliness of the near has been already noted. The post-office in Damascus is a quite good post-office, so far as letters and telegrams go. But you inquire for these in a hall which looks like a very dirty stable-yard with a very dirty fountain in the middle of it, furnished with little rough-sawn wooden boxes for private letters, such as no self-respecting grocer would pack with oranges. Even the tombs, about which so much sacredness is supposed to gather, are the untidiest of sepulchres. You may see a large and expensive tombstone, shining white in the distance, with all the air of aristocratic self-importance which man’s pride can lend to death; but when you approach, it is railed off with bamboo and barbed wire which might have been picked off a rubbish-heap. There are good roads in places, but they lead to nowhere. Generally they collapse into mere watercourses after a few miles, or they run on in a squared and measured lane of sharp boulders down{175} which no horse can walk. Nor is this incompleteness a peculiarity of Turkish administration. Probably nothing in Palestine is older than the landmarks which divide the fields. From generation to generation these have been held sacred, laws against their removal having been in force among the ancient Canaanites before the conquest by Israel. So sacred are they that even murderers and thieves will seldom dare to tamper with them. Yet through all the long past the landmarks are said to have remained as the first men laid them down—mere inconspicuous heaps of little stones, the easiest things in the world to remove. When we take the unfinishedness of the land along with the revelation and consider them together, we can hardly fail to gain a lesson of far-reaching meaning. The great incompleteness of Syria—the thing in which her life has been most lamentably unfinished—was her response to the revelation of her God. She never was at pains to understand it; she never fully opened her heart to its new progress, nor felt her high destiny as the bearer of good tidings to the world. She never seriously set herself to obey its plainest ethical demands. The wreckage is her price paid for the neglect. No man nor nation can finish any task to perfection, who has not done justice to such revelation of God as his heart and conscience have received. It is truth to the inward light that keeps us from losing heart and enables us to feel that energy and patience to the end are worth our while. Right dealing with revelation is the secret of all efficient performance. The combination in Palestine{176} of such revelation and such defect in strenuous action shows us a land that has just missed the most amazing destiny on earth. It is in the remembrance of these thoughts that the chapters of this part should be read. The Shadow of Death has fallen because these men could not escape their knowledge of some greatness in death, more moving than anything life had to show. The spectral is but a degenerate and perverse form of their sense of God. The Cross gives its ethical significance to the burden and sorrow of the land. Resurrection shows signs even now that God has not yet done with Syria. But first, before we treat these aspects of her spirit, let us look at it on its brighter side—the smile and song of the land.{177} [Image unavailable.] INTERIOR OF THE DOME OF THE ROCK (MOSQUE OF OMAR), FROM THE SOUTH-EAST.","sourceLink":"http://novel.tingroom.com/jingdian/1917/55134.html","bookId":910,"book":{"id":910,"title":"The Holy Land","description":"简介： The secrets of satisfactory travel are mainly twoto have certain questions ready to ask; and to detach oneself from preconceptions, so as to find not what one expects, or desires to find, but what is there. These rules I endeavoured to follow while i...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1917","creation":"Aug 1, 2019 12:23:51 AM","modification":"Aug 1, 2019 12:23:51 AM"}}
