{"id":92589,"no":13,"title":"Page 13","content":"I AWOKE FACEDOWN in the bed with a warm hand slipped under my T-shirt, cupping my rib cage and primed to do likewise with my breast. \"You give great dream,\" Ric\u0027s voice whispered against my neck. I rolled over to find dark eyes smiling into mine. Eyes, plural. The brown contact lens over Ric\u0027s transmuted iris covered the silver perfectly. This incredible moment-Ric conscious and acting normally-seemed like any lazy, ordinary intimate \"morning after,\" although we hadn\u0027t had many morning afters during our brief love affair. And we hadn\u0027t been indulging in sex last night but a bizarre form of erotic healing. Something new under the sun popped up every day in the post-Millennium Revelation world. How good to know that Ric\u0027s return to full consciousness was also filled with pleasurable memories to counter the horrible ones sure to return someday soon. \"What\u0027d you dream?\" I asked him, unafraid of his answer at the moment. He looked as lazy and satisfied as a tomcat in the sun. \"Your lips and mouth had developed a magic touch, Delilah. Must have been wearing that crazy, hot Lip Venom again. I came at every kiss, over and over again.\" \"Wow. The only way I can offer that in a waking state is we log a lot of time in the sack from now on,\" I joked. \"Yeah.\" He frowned and looked around. \"Where are we anyway? Cushy, but not your or my home, sweet home.\" I used his distraction to run my hand around his hip, meeting no resistance, and up his back. Meeting major resistance. His entire body bucked away. \"Time to get going.\" He jumped up to face me by the bedside. \"What is this thing?\" he asked, discovering the soft cotton straitjacket of a hospital gown hanging from his shoulders. A tiny strawberry print was definitely not Ricardo Montoya\u0027s style. I knee-walked over the empty mattress to keep it from sliding off his shoulders. He didn\u0027t need privacy from me in the front, but he was conditioned to keep his scarred back covered and untouched. \"You\u0027ve been a little sick and I\u0027m your night nurse,\" I cooed to calm him down. He frowned again. After the horrors he\u0027d faced, no wonder he had temporary amnesia. That we could reconnect as lovers before those traumas pushed to the surface was a gift. Helena had been right. I ran a daring finger over where a particularly long thick welt had disfigured his back. Ric bucked away like a bronco again, then his face registered shock. \"You... touched my back.\" \"So?\" \"It felt... good. My back feels-\" \"Smooth and creamy?\" I asked provocatively, pushing into a full frontal embrace, running my fingers over the faint smooth tracks of the erased scars, feeling his torso quiver with pleasure instead of flinching away. He tilted his forehead against mine and cupped the sides of my face so we were enclosed in our own secret communion, breath mingling between us, warm and intoxicating. \"It wasn\u0027t a dream, was it, Delilah? Somehow you kissed me whole again.\" \"Yes.\" I inhaled his breath and wafted it back into his mouth on that long sibilant sound, like a sigh. I\u0027d tell him about the Resurrection Kiss later. \"You see ghosts in mirrors, you turn my oldest pain into pleasure, what else on earth can you do, Delilah Street?\" \"Love you,\" I said. Our kiss right then was a vow. We felt nothing more extraordinary than accelerated human heartbeats. How we both appreciated that. I especially felt relieved. No way did I want to keep passing on Brimstone Kiss side effects. \"So where the hell are we?\" Ric asked as our lips parted. \"What happened and where are my frigging clothes?\" I hesitated. His clothes were probably rags in the deepest bowels of the Karnak Hotel. To explain that, I\u0027d have to spin an incredible yarn about rogue CinSims, vivified dragons, carnivorous hyenas and zombie mummies, Egyptian vampire warriors, and the sacred and profane underground rivers of Vegas. Even a man who could dowse for the dead wouldn\u0027t buy this whole scenario until he had time to get oriented. \"Look, my dear hombre,\" I told him. \"We\u0027ve been in big trouble and ended up depending on the kindness of Christophe at the Inferno. Until now you were in the healing hands of a doctor and a group of no-nonsense nurses.\" \"The day shift, you must mean,\" he qualified. \"I think I can wrap the night nurse around my little finger and big-\" I fanned my fingers over his mouth before I got too interested in what he was going to say. \"Serious professional nurses, Ric. You need a doctor\u0027s permission to leave here. I\u0027m sure he\u0027ll check you pretty soon and dismiss you. Meanwhile, give me your sizes, amor, and I can have this fun clothes shopping spree for you in the hotel galleria.\" \"Yeah?\" He frowned again. \"The left side of my neck really throbs.\" His fingers patted the square gauze patch. \"What happened there?\" \"We\u0027re in a suite at the Inferno,\" I said, going back to his first and easiest question. \"Some bad operators got hold of you but we got you back.\" \"And they kept my clothes?\" \"Right. It\u0027s a long story, Ric. You need to sit down with something bracing besides me and hear it step by step. Wouldn\u0027t you be more effective dressed than wearing an air-conditioned, string-tied, sissy hospital gown when you tell those sponge-bearing, bath-hungry nurses that you\u0027re fine and to buzz off?\" He thought about it-the exposure of a hospital gown\u0027s open rear slit combined with his back phobia-and nodded. \"Don\u0027t spend too much, chica. I doubt you\u0027ll get what I would.\" \"Oh, no worry. I\u0027ll just load up on Elvis T-shirts and Hawaiian shirts and Bermuda shorts. Cheap, fast, and they show off your legs. That\u0027s so you.\" \"Delilah!\" I quick-kissed him good-bye and escaped before he could ask too many more questions. While I dashed into my bedroom to snag my handy messenger bag, a morning nurse came out from her bedroom. I asked her to call the doctor, saying that Ric was awake and restless. Then I skedaddled, telling Quicksilver to watch on the way out and keep an eye out for Grizelle. I winced to think of how Snow\u0027s potent Brimstone Kiss had boomeranged to put the risen Ric in mortal danger from Snow\u0027s shape-shifting bodyguard. That\u0027s another reason I wanted Ric ambulatory and out of here. I didn\u0027t want either of us depending on Snow\u0027s \"hospitality\" now that he had a bitter personal reason to hate us both. A man who can raise a centuries-dead dragon from its ashes may not be a master vampire but he sure was something dark that decent folks should frown on. I tried to make my passage through the hotel a low-profile slink. I was doing fine until I had to cross the casino area to get to the shopping arcade called Beelzebub\u0027s Boutiques. That was the Inferno Hotel, a relentless theme park of evil. A small pale dog came yapping after my heels. That so reminded me of my lost Achilles that I played the sucker and paused to look. This dog was taller than a Lhasa. It was a curly-haired white dog with gray touches on its forehead and perked ears like a center-parted toupee. I recognized the wire-haired terrier with a sinking heart and a soft \"Damn.\" \"Asta? What are you doing here?\" I asked fruitlessly. The dog danced around me once, then bounced a few steps away and paused so I would follow. He wasn\u0027t Lassie but I knew exactly where he wanted me to go. I gave up and followed Asta back to the Inferno Bar, where his master, Nick Charles, debonair detective possessed of the best pencil-thin mustache of his era and the Inferno house CinSim, held forth. Nicky stood beside a willowy woman with a side-parted thirties hairdo in tight Marcel waves. The curls broke into adorable fluff at her sharp chin line. She more leaned than sat on a bar stool. She had thin arched eyebrows and wore a chic, dark, slim day gown bowed and ruffled around the shoulders. I would kill for that dress, and then I\u0027d have to kill again to be thin enough to get into it. \"Delilah,\" Nicky greeted me, with a devilish arched eyebrow. He took me aside to mumble in my ear. \"Are you by any chance responsible for my new condition of domestic bliss here at the Inferno Bar? It does cut down on my cigarette-lighting for attractive women tourists.\" I sighed to indicate my plea. \"Guilty.\" And I had three times the reason to plead guilty. I\u0027d talked Snow into giving Nicky his two CinSim better halves a while back. Here was walking, bouncing, barking evidence that Snow had lived up to his word. Great, I\u0027d just condemned him to Living Hell. Although it may have been his natural element. Lighten up, Irma told me. The Family Charles makes a helluva better Inferno Bar attraction than Nicky feeling low-down and solo. You think the guy tourists won\u0027t flock to witty, winsome Nora like the dames go for Nicky? And that Asta is too cute for words. Snow owes you for peerless marketing moxie. Again. I\u0027d just let his probably immortal back be sliced to chopped liver to restore Ric\u0027s. The pure profit motive wasn\u0027t enough to overcome Snow\u0027s enmity now. Interesting to contemplate what physical torture he would consider sufficient repayment. And now he knew my weaknesses... Still, I doubted he\u0027d use Ric against me. The lead singer of the Seven Deadly Sins had too much pride. No, it would be between him and me only and it would not be pretty. Perhaps not even survivable. For me. Snow wouldn\u0027t want scars for scars. He\u0027d want what I most feared he did. My soul. \"Why the glum face, Miss Delilah?\" Nick Charles coaxed me. \"Here\u0027s a fresh Brimstone Kiss. It\u0027s the new In drink.\" I couldn\u0027t help recoiling. \"Ah, too fiery a concoction even for its inventor, but just the thing to loosen the tongue of my pal, Rick Blaine. We\u0027re fellow film barflies from way back. I quite agree. I prefer dry and subtle. Speaking of which, you have favorably impressed the CinSim Consortium. You definitely ought to be in pictures.\" He winked. That reminded me. The Inferno\u0027s infernal floating mirror-ball surveillance cameras would soon pinpoint my whereabouts. Better keep moving if I didn\u0027t want to be zapped with Seven Deadly Sins lightning. I blew a farewell kiss to Nick and Nora. Asta, who was now perched on a bar stool, wagged his stubby tail. The trio made a sophisticated film still in living black and white. I kept on a direct line for the Devil\u0027s shopping zone. Once there I could window-shop the world\u0027s finest clothing brands for my baby. Nothing too good for his rehabilitated back or my sensitive fingers. I found a shop selling Zimmerli Swiss men\u0027s \"furnishings.\" \"Pagan style\" briefs in finest cotton, a red silk iridescent shirt, silver satin tie, dove gray sport coat, and charcoal slacks. Ric would leave the Inferno ready for a road show company of Guys and Dolls. I hesitated at bill-paying time. Snow had promised Helena that anything Ric or she needed would be \"on\" the hotel. Nope. I had three fat checks coming for my snoop work from Hector, the CinSims, and Howard Hughes. Technically, I\u0027d also been hired by Snow to discover the identity of Loretta Cicereau\u0027s ancient vampire lover boy, but I\u0027d taken my blood money, and how. I charged the clothes to my credit card, glad I could put Ric in glad rags on my own ticket. I circled the bar on my trip back upstairs and arrived to find Quicksilver waiting and my things packed in the same suitcase and sturdy sacks Godfrey had sent from Hector\u0027s place. Ric was standing with the doctor, a CinSim with a vague smudge of dark beard that lacked the brunet perfection of Ric\u0027s dusky jawline. \"Do not bend, spindle, or mutilate this young man for the first day or so,\" the doctor advised me. \"You could still drill to China through that neck wound.\" Ric grabbed my suitcase, then my newly freed hand, and rushed after me and my crinkling shopping bags into my bedroom. As soon as the door closed, he flung the hospital gown to the floor, standing as nude as Adam and almost as unmarked, except for having a navel. \"I finally caved and let those nosy nurses give me a frontal sponge bath, chica,\" he admitted, \"so I\u0027m fit for new clothes.\" I dug out the underwear, not tighty whities and not boxers, but something smooth and close-fitting in between. \"What the hell are these?\" \" \u0027Pagan\u0027 briefs. European. Expensive.\" \"Dios! Trust women to go for freaky underwear.\" He pulled them on and they were all they could be, from my viewpoint. I\u0027d looked him over good. No vampire tsetse fly or leech bite scars, just the faint silvery rays on his back. He paused to turn his head over his shoulder to the mirror and view his back in wonder while I pulled out and undid the packaging on his new ensemble. The Holy Family was much appealed to, along with other saints and martyrs, but Ric was finally clothed in my selections and looked like a million dollars. For a Vegas gambling shark. \"Not bad for a speed run,\" I said. \"I wish Helena could see you now.\" \" Helena? My mother the shrink? She-? You-? Delilah?\" \"I love you with your jaw dropped but we really, really want to leave here, pronto. I\u0027ll explain it all once we\u0027re at your place. Or mine?\" \"My place,\" he said absently, tying a perfect double Windsor in the pricey silver Italian silk tie. Now I understood why he was the \"freaking best-dressed Fed\" I\u0027d ever seen, as I\u0027d told him when we\u0027d met in Sunset Park. Now I realized why he always craved a silky skin of posh clothing. It wasn\u0027t vanity. It wasn\u0027t snobbery. It was urban survival for someone who\u0027d had to develop a skin of sandpaper way too young. I smiled. Ric was busy asserting his druthers. Let the little things ease him back into his post-Karnak nightmare life. We\u0027d handle the big things later.","sourceLink":"https://allnovel.net/vampire-sunrise-delilah-street-3/page-13.html","bookId":2115,"book":{"id":2115,"title":"Vampire Sunrise (Delilah Street #3)","description":"Storyline: Vampire Sunrise (Delilah Street #3) Werewolf mobsters and vampires run Vegas, but that\u0027s yesterday\u0027s news for Delilah Street, paranormal investigator. What\u0027s truly fearsome is her bloody discovery of an undead evil rooted in ancient Egypt. Now, with her lover Ric fighting for life after a grim battle, the chips are down. But Delilah is a born winner who has never let a little danger throw off her game, and she\u0027s been learning fast since she came to Sin City. Her affinity for silver is making mirror-walking a real breeze, and being forced to accept the albino rock star sorcerer Snow\u0027s Brimstone Kiss has ramped up her powers to a startling new level. With the help of her trusty uber-wolfhound Quicksilver, not to mention the orange demon parking valet Manny, Delilah is determined to solve even more paranormal secrets, and hopefully save the few innocents left in town...","cover":"https://allnovel.net/images/vampire-sunrise-delilah-street-3.jpg","author":"Carole Nelson Douglas","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/vampire-sunrise-delilah-street-3.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 5:55:37 PM"}}
