{"id":92606,"no":30,"title":"Page 30","content":"I AWOKE, EYES wide, staring up at the white canopy on my four-poster bed. Oh, my God! I\u0027d somehow done what I\u0027ve never done since a child. I had turned over on my back during sleep. Panic made me gasp, drawing heaving breaths. This must be a dream. I checked both sides of the bed. No goggle-eyed alien spectators gowned in white fenced me in. I rolled onto my side so fast I almost got sweatsuit burns. In the dimly lit room, my eyes adjusted to scan the high, peaked ceiling and the dormer window where Dracula had come calling a couple weeks ago. No sinister CinSim waited there for admittance, although the window frame cast shadows on my bare wood floor. Nothing loomed above me, or outside the bedroom to threaten me. I drew deep, calming breaths and read the luminous dial on my nightstand. Five A.M. More than thirty hours. I whimpered my pain. A shadow from the window vines twitched on my floor like a dark star twinkling. I looked down, around. Oh, God! Oh, Shazzam... Shamu... Shezmou! Oh, oh, oh, Osiris! I scrambled half up in the sheets. I saw-blink-the gray form of a dog sitting guard beside my bed. He was stretched out on his belly, gazelle-graceful paws straight forward, haunches gathered in back, head up... and what a head. It was a sphinx in the Egyptian wiglike headdress and uraeus, wearing no ears and muzzle, but the face of... Lilith! How did I know it was Lilith and not me? Because the right, camera-side nostril bore the icy star sparkle of a blue topaz stud. I\u0027d dumped that bit of bling when I\u0027d discovered it made me a marked woman. Quicksilver and Lilith had merged into a bizarre new form? This must be a dream! I turned over on my stomach, curled my fingers into the bottom sheet, and muttered, \"This is a dream,\" afraid to crawl out of the covers and find I was in my alien abduction nightmare all over again. SO YOU OPEN your eyes. The room is flooded with daylight and your sweatsuit has huge damp spots under the arms and across the back and the floor is sunny and cheerful and empty of both night-visiting ogres and angels. And it\u0027s just real life again, swallowed by a loss you won\u0027t admit. It was also late afternoon, I discovered. Why had I been out so long? I wouldn\u0027t call my previous state \"sleep.\" My bedside cell phone had three messages. I rang Ric back without listening. \"Del?\" He sounded like he was talking on ice, so careful. \"Yeah. I was... sleeping.\" \"Good!\" Much too hearty. \"Just rest, Del. Since Malloy\u0027s warrant didn\u0027t get anywhere at the Karnak, I, uh, visited your last satisfied client.\" \"Nightwine?\" \"Cesar Cicereau. He lost his first team of werewolf guards the other night, as you well know, but he can volunteer a second crew.\" \"Cicereau is gathering a hunt party for Quicksilver?\" \"Yeah. He says his werewolf pack can track the true wolf blood in your mongrel wolfhound now that the moon is full. Sansouci and I are taking them underground.\" \"The moon is full?\" I\u0027d been underground myself too long to notice. \"You and Sansouci? Don\u0027t tell me... Snow is in on this too?\" \"Christophe? He\u0027s doing his nightly rock idol riff as \u0027Cocaine\u0027 per usual. This has nothing to do with the Inferno. No, Sansouci, Cicereau\u0027s go-to guy, says that freako cop who hassled you, Haskell, hangs out at a biker bar. We can \u0027persuade\u0027 him to take us to the latest location of the Sinkhole. Stink finds stink. \"Del, are you there? Awake?\" Not really. I hadn\u0027t realized how many unlikely suspects would be willing to help me find Quicksilver. Now I was thinking some of the methods might be subconscious. My previous night\u0027s \"dream\" may have been a message: to find Quicksilver I had to find Lilith, for real and for once and for all. \"Good hunting, Ric,\" I wished him, signing off. I didn\u0027t know where I was going, but it would be somewhere. I ripped off the ripe sweatsuit and took a shower. I opened my closet door myself for once, grabbing jeans and knit top and my customized cop duty belt. Cowboy boot-style mules for my feet. Dressed, I went to stand before my hallway mirror. Just me looked back. I wasn\u0027t fooled. \"Lilith, you bitch,\" I said, \"you taunt me with glimpses of your image on film and in my mirror and then you have the nerve to show up in my dreams at the worst moment in my life, in my own bedroom, glued to my dog, the best dog in the whole damn world. Any of them. \"He\u0027s missing now too but he\u0027d never desert me. Maybe you can lead me to him somehow, so I\u0027m going to find you before another day goes by. Just saying.\" VOWS ARE DRAMATIC motivators. I still needed a concrete trail to follow. I went downstairs to use the laptop in the study/office (unlike Hector, I don\u0027t have room for single-purpose areas). Why hadn\u0027t I ever explored the CSI V: Las Vegas website before? Maybe it had felt like a creepy combination of vanity and voyeurism. Of course, Lilith\u0027s autopsy segment was available for download. My shaky hands hit the arrow and I sat back to see my \"dead\" body-what was the famous T. S. Eliot line about the night? \"Etherized like a patient on a table.\" That was how I really pictured Lilith, etherized on a table, helpless, dead. \"Maggie,\" the lone maggot, wriggled onstage briefly and then the star-making performance was done and gone. I forced myself to play the entire two minutes, then reran them. Behind Lilith\u0027s bare body, I spotted the blurry, out-of-focus scrubs of minor players like myself. How little it took to make a star these days: a freaky YouTube video. I could move from \"maggot CSI\" topics to a \"maggot art\" page. There, the pallid fly larvae were dipped in harmless colored paints to writhe random strokes on a page, later sold as \"art.\" Was self-expression now the domain of brain-worms as well as human brains? I was thinking one of those resident tequila-bottle worms, being obviously uninhibited, might have a smashing creative career as an artist with the right manager. Actually, the brains behind the maggot art project was an entomology expert who aided law enforcement on handling insects as crime scene evidence. Even my own \"Maggie\" was immortalized by the Nightwine media empire. A click elsewhere on the CSI site produced the tape of Maggie and me doing our garbled version of a graveside soliloquy. TV reporting had made me an effective line reader. A tear was wandering, maggot-wise, down my nose when the segment ended. Get it together, I ordered myself, to cut Irma off at the pass. I hit my bookmarks on the ancient-Egypt sites. Sure enough, Shezmou was there exactly as I\u0027d seen him, under several less pronounceable spellings of his name, Shesmu, et cetera. His being a blood demon and Lord of the Slaughter was a constant, though. And Bez... his name was spelled only one way: Bes. You\u0027d never want to call him \"Bess,\" though. Bez was the phonetic version and much better. The sight of his curly mane of hair and beard and genial Bert Lahr Cowardly Lion face made me feel another almost labor-pain wrench of loss for Quicksilver. I wondered where the two forgotten gods were, now that the underground food pens were history. Had they retreated back to their pillars if Anubis had left any standing? Deliberately leaving tragic memories of the Karnak, I switched to my email, two screens full of unopened email, mostly Nigerian in origin. I started deleting with a vengeance, then blinked and checked my Delete file. There it was: [email protected] /* */!function(t,e,r,n,c,a,p){try{t\u003ddocument.currentScript||function(){for(t\u003ddocument.getElementsByTagName(\u0027script\u0027),e\u003dt.length;e--;)if(t[e].getAttribute(\u0027data-cfhash\u0027))return t[e]}();if(t\u0026\u0026(c\u003dt.previousSibling)){p\u003dt.parentNode;if(a\u003dc.getAttribute(\u0027data-cfemail\u0027)){for(e\u003d\u0027\u0027,r\u003d\u00270x\u0027+a.substr(0,2)|0,n\u003d2;a.length-n;n+\u003d2)e+\u003d\u0027%\u0027+(\u00270\u0027+(\u00270x\u0027+a.substr(n,2)^r).toString(16)).slice(-2);p.replaceChild(document.createTextNode(decodeURIComponent(e)),c)}p.removeChild(t)}}catch(u){}}()/* */ Dot-sup was a new URL address, pronounced \"soup,\" to handle the explosion of supernatural websites after the Millennium Revelation. Those not in the know pronounced it \"sup\" as in \"dine.\" That was also appropriate for our new supernatural population of vampires and werewolves and such. [email protected] /* */!function(t,e,r,n,c,a,p){try{t\u003ddocument.currentScript||function(){for(t\u003ddocument.getElementsByTagName(\u0027script\u0027),e\u003dt.length;e--;)if(t[e].getAttribute(\u0027data-cfhash\u0027))return t[e]}();if(t\u0026\u0026(c\u003dt.previousSibling)){p\u003dt.parentNode;if(a\u003dc.getAttribute(\u0027data-cfemail\u0027)){for(e\u003d\u0027\u0027,r\u003d\u00270x\u0027+a.substr(0,2)|0,n\u003d2;a.length-n;n+\u003d2)e+\u003d\u0027%\u0027+(\u00270\u0027+(\u00270x\u0027+a.substr(n,2)^r).toString(16)).slice(-2);p.replaceChild(document.createTextNode(decodeURIComponent(e)),c)}p.removeChild(t)}}catch(u){}}()/* */ sure sounded like a Snow groupie user name. I skimmed my new mail list. Among the \"AWARD\" and \"FOR YOU, DEAREST ONE\" subject lines were several slugged \"Graduation.\" It had been ages since I\u0027d graduated from anything, so I checked the email addresses. Yes! Amazed, I recognized such user names as infernobait, stonedonsnow, snowgasm224, cocainiac, snowkissedslut, all at a new web address, kissedoffsnow.sup. The Snow groupies were having a weaned-off-the-Brimstone-Kiss graduation ceremony tomorrow night and they wanted me to be valedictorian. Self-esteem had won out over the one-time multiple orgasm kiss and doomed hope of ever getting another from Cocaine the rock star. I felt the first rush of positive emotion since Quicksilver had vanished into the beetle pit. Maybe I should attend, I thought, teary eyes blurring the screen. Maybe I\u0027d really helped these women. Maybe they really liked me. I opened a few messages to make myself feel better. And got another bolt from the ethernet. Lilith! They\u0027d found mention of the Seven Deadly Sins rock band and lead singer Cocaine on [email protected] /* */!function(t,e,r,n,c,a,p){try{t\u003ddocument.currentScript||function(){for(t\u003ddocument.getElementsByTagName(\u0027script\u0027),e\u003dt.length;e--;)if(t[e].getAttribute(\u0027data-cfhash\u0027))return t[e]}();if(t\u0026\u0026(c\u003dt.previousSibling)){p\u003dt.parentNode;if(a\u003dc.getAttribute(\u0027data-cfemail\u0027)){for(e\u003d\u0027\u0027,r\u003d\u00270x\u0027+a.substr(0,2)|0,n\u003d2;a.length-n;n+\u003d2)e+\u003d\u0027%\u0027+(\u00270\u0027+(\u00270x\u0027+a.substr(n,2)^r).toString(16)).slice(-2);p.replaceChild(document.createTextNode(decodeURIComponent(e)),c)}p.removeChild(t)}}catch(u){}}()/* */ They\u0027d emailed her to attend their \"Solicitous\" get-together. I couldn\u0027t ask for anything more in my quests to find my double as well as figure out who\u0027d killed the Snow groupie behind the Inferno Hotel. Well, one thing more. I could wish that I was still as pure as the driven \"Snow\" when it came to the Brimstone Kiss. I was not the innocent anti-Kiss crusader who\u0027d organized this groupie self-help bunch a couple weeks ago. Since then, I\u0027d taken the Brimstone Kiss myself, under duress. I hadn\u0027t had an orgasm, much less several, and I\u0027d never become addicted to anything afterward but shame. Still, I was a fine one to talk now, and that\u0027s just what they wanted me to do.","sourceLink":"https://allnovel.net/vampire-sunrise-delilah-street-3/page-30.html","bookId":2115,"book":{"id":2115,"title":"Vampire Sunrise (Delilah Street #3)","description":"Storyline: Vampire Sunrise (Delilah Street #3) Werewolf mobsters and vampires run Vegas, but that\u0027s yesterday\u0027s news for Delilah Street, paranormal investigator. What\u0027s truly fearsome is her bloody discovery of an undead evil rooted in ancient Egypt. Now, with her lover Ric fighting for life after a grim battle, the chips are down. But Delilah is a born winner who has never let a little danger throw off her game, and she\u0027s been learning fast since she came to Sin City. Her affinity for silver is making mirror-walking a real breeze, and being forced to accept the albino rock star sorcerer Snow\u0027s Brimstone Kiss has ramped up her powers to a startling new level. With the help of her trusty uber-wolfhound Quicksilver, not to mention the orange demon parking valet Manny, Delilah is determined to solve even more paranormal secrets, and hopefully save the few innocents left in town...","cover":"https://allnovel.net/images/vampire-sunrise-delilah-street-3.jpg","author":"Carole Nelson Douglas","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/vampire-sunrise-delilah-street-3.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 5:55:37 PM"}}
