{"id":92582,"no":6,"title":"Page 6","content":"I HAD TO hand it to Helena Burnside.\\n\\n She didn\u0027t smirk once when I was Alice-in-Wonder-landed to Andrews Air Force Base southeast of D.C. and driven up to a waiting small private jet. Shortly after we were up, up, and away as the sun sank slowly in the west. It was almost 8:00 P.M. and the three-hour time difference meant we\u0027d chase the sunset all the way, arriving at about the same hour we\u0027d left.\\n\\n I\u0027d gone wide-eyed when I spotted the turn-off for Andrews and don\u0027t think I blinked until we were airborne and sitting in cushy leather chairs that had more positions than a yoga class.\\n\\n \"You can catch up on your sleep,\" Helena suggested, \"or we can have a drink and talk. Your call.\"\\n\\n \"We need to talk and I need a drink.\"\\n\\n \"Fine. Any druthers?\"\\n\\n I\u0027d followed her to a built-in cabinet whose exotic wood doors concealed an awesome wall of branded bottles. Guess this wasn\u0027t Alice \u0027s Restaurant, as in the old song by Arlo Guthrie, but Alice\u0027s Bar.\\n\\n \"I\u0027ll concoct something,\" I said. \"Hmmm, no white chocolate liqueur aboard for an Albino Vampire.\"\\n\\n \"This is usually a guy\u0027s plane, Delilah. No sweet girly liquors allowed. An Albino Vampire? That does sound intriguing.\"\\n\\n Wait until she met Snow, which she would. He may deny being a literal vampire but he was a money-sucking albino casino owner, so I\u0027d named the drink to irk him.\\n\\n \"Vodka\u0027s a manly drink,\" I said, spotting a crown-shaped vodka bottle of cut and frosted glass touched with gilt. Hmm, this Regalia Gold was something decadently pricey the Inferno bar might feature. \"I\u0027ll whip up something apropos. I seem to have a way with spirits.\"\\n\\n Into a highball glass I poured a jigger or so of the high-end vodka-though I\u0027d have preferred pepper vodka-and a half jigger of cinnamon schnapps, then five ounces of orange juice from an under-counter mini-refrigerator. Feeling frisky, I added two jiggers of orange-flavored cognac from a fancy little bottle. Finally, in went a scant half-jigger of rich thick red grenadine to sink to the bottom. Sweet! I did it all over again and brought the second drink to Ric\u0027s mother.\\n\\n \"It matches the sunset,\" she commented, lifting her glass. We settled into our chairs to watch the sun painting the horizon dark watercolor hues through the windows. \"We should be shadowing the sunset like Sam Spade on a case all the way west.\"\\n\\n She eyed her vivid glass. \"Umm. Subtle yet spicy... for modern women like us. What will you name this concoction, Delilah? It looks like a Tequila Sunrise.\"\\n\\n \"No tequila in it. How about a... Vampire Sunrise?\"\\n\\n \"Don\u0027t vampires retire to their coffins to sleep all day about then?\"\\n\\n \"So says the legend. Let\u0027s drink to that.\"\\n\\n We clicked rims even as I was thinking that, whenever they grabbed some shut-eye, the Karnak vampires threatened to become the major force in Vegas. They made Cicereau\u0027s Gehenna werewolves look tame.\\n\\n I kicked off my shoes.\\n\\n \"Panty hose? Why don\u0027t you peel out of those unbearably unbreathable things in the executive washroom?\"\\n\\n I grinned. \"How did you know I don\u0027t usually wear them?\"\\n\\n \"No sane woman does these days.\"\\n\\n No sane woman. I thought that over while I wriggled the hose down past the shy silver hip chain in a bathroom three times the size of a commercial jet\u0027s biffy. I\u0027d worn nylon bikini briefs underneath the panty hose to make them slide on better, so I was still decent enough for an Our Lady of the Lake Convent School girl.\\n\\n Pretty sharp lady, Irma said as I rolled the hose into a ball and washed my hands. Watch yourself around her. We don\u0027t know where she\u0027s coming from. And she is a shrink. She\u0027d frown on me for sure. Want you to dump me. You\u0027ve already had me on \"mute\" too long.\\n\\n I won\u0027t dump you, I told her. It\u0027s just been so stressful lately.\\n\\n Because you\u0027ve been doing things you didn\u0027t want witnesses for.\\n\\n That\u0027s enough! I slammed a door shut in my mind. I\u0027d never done that to Irma before.\\n\\n Yet she was right. Helena Troy Burnside had transformd Ric from a feral child before the Millennium Revelation into a secure and dedicated man in a world where nothing was certain anymore but change. She wouldn\u0027t be easy to fool.\\n\\n I returned to the main cabin to find her pensively watching the sunset blaze of purple and orange turn lavender and yellow, like a fading bruise.\\n\\n What should I tell her about Ric?\\n\\n With his paranormally healing tongue, my wonder dog, Quicksilver, had licked Ric\u0027s skin clear of the sores from the vampire tsetse-fly bites. I couldn\u0027t conceal that ragged hole in his neck from when he served as the \"catch of the day\" for the Twin Pharaohs\u0027 bloodthirsty undead minions at the Karnak Hotel three nights ago.\\n\\n I sat down, my calves rubbing together and giving me a mental flash of how inciting Ric would find my bare legs under this prim, uniform-suggestive suit. I\u0027m your stewardess, Delilah. Fly me, as the old airline ad went.\\n\\n Here I didn\u0027t even know if Ric was coming out of his coma, with or without a soul, if you believed in that sort of thing, and I was thinking about us having sex.\\n\\n Helena looked away from the window to me as I picked up my Vampire Sunrise for a sip.\\n\\n \"How long have you and Ric been sleeping together, Delilah?\"\\n\\n \"Ah-\" I got my mind doing mental math. That would short-circuit intimate memories. \"A few weeks.\"\\n\\n She was smiling at me like the Madonna, all-wise and a bit rueful.\\n\\n \"I\u0027m not exactly Ric\u0027s mother,\" she said, \"but the relationship is close enough to that, so I don\u0027t really need to know certain things. You might want to shutter some strong memories. I do sense you and Ric share unconventional and trying childhoods. You seem to be a good match. And, no, mild bondage during sex is not abnormal, especially when the woman is terrified of losing control because of a forgotten childhood trauma. It might be just what the doctor would order. In matters of sex, if it\u0027s effective, it\u0027s right.\"\\n\\n This \"old-fashioned\" girl was flushing like a red light. I could feel the heat suffusing my pale chest and face, scarlet against the white and navy of my outfit. I was vividly patriotic at the moment.\\n\\n She laughed softly.\\n\\n \"Are you... psychic?\" I asked. \"You can read minds?\"\\n\\n \"I always was intuitive,\" Helena explained, looking out the window as she sipped my \" Sunrise, Sunset\"-colored cocktail. The sentimental song about love and life ran through my mind, not vampires. \"It was really only close observation, in the way Sherlock Holmes practiced it. His methods, as he called them, were learned from a brilliant diagnostician, a doctor Arthur Conan Doyle studied under.\"\\n\\n \"Really? The fictional Sherlock Holmes was inspired by a doctor?\"\\n\\n \"Maybe there were always those who had millennial gifts.\" She sighed, perhaps thinking of Ric. \"After the Millennium Revelation, I found my \u0027insights\u0027 became much more literal. I can \u0027see\u0027 high-impact or traumatic incidents from my patients\u0027 past. It\u0027s not like \u0027reading minds,\u0027 though.\" She eyed me again. \"It\u0027s like surfing Web pages really fast. Skittering images and emotions. I sense a lot of upheaval in you.\"\\n\\n \"I can\u0027t imagine why,\" I said ruefully. \"I lost my dog and my home and my job in Kansas. I\u0027m supposed to be an orphan but I saw my double being autopsied on CSI V: Las Vegas. I came here to find her and found Ric instead. So far.\"\\n\\n \"You\u0027re not one to give up, I can also sense that. I do see mirror images colliding around you. And, like Ric, you had no one to nurture you as a small child. No one to hold you and keep you safe. No one to tell you that you were a pretty and smart girl, as every girl is, in some way. I suspect those raging, suppressed infantile emotions will manifest themselves in your adult powers.\"\\n\\n \"I\u0027ll have delayed tantrums?\"\\n\\n \"Maybe not. You\u0027re a very sensible and mature young woman, Delilah, a bit too much so. You\u0027re so demanding of yourself and others. Your relationship with Ric has been good for you but now you must concentrate on being good for Ric. I hope not, but what\u0027s just happened to him could undo the years of reclamation work I did to overcome his brutal childhood.\"\\n\\n And she barely knew the half of it. I drove out my haunting worries about his torture at the Karnak by concentrating on something happier, another lovemaking session she really didn\u0027t want to spy on. I could sense her regard blurring and withdrawing.\\n\\n \"Yes, you can block my unconscious \u0027readings\u0027 if you concentrate,\" she told me, unaware that I was putting up barriers by thinking about sex with her patient-son.\\n\\n Some things never change, Millennium Revelation or not. When it comes to parents and children of any age neither generation can quite bear to think of the other \"doing it.\"\\n\\n \"Thanks for the warning,\" I said. \"But, just to follow up, you say Ric is trying to overcome my, ah, position phobia about lying on my back in dentists\u0027 and doctors\u0027 offices in, um, bed?\"\\n\\n \"He was a very bright boy who survived a nightmare childhood and underwent years of therapy. Yes, he can help you, Delilah. More important, I sense that he badly wants to.\"\\n\\n Shoot! I blushed again. Time to get away from my intimacy issues and back to finding out what Ric is really about. Wanting to help must be our mutual weakness.\\n\\n \"So what is your relationship to Ric?\" I asked.\\n\\n She considered. \"He\u0027s not quite a son to us. More like a beloved foreign student who came to live with us for a long time.\"\\n\\n \"Does your husband know about your expanded intuition?\"\\n\\n \"No. Philip is a military man by profession. He must remain skeptical to maintain equilibrium. He can\u0027t even face Ric injured and in pain, not because he doesn\u0027t care but because he\u0027d choke on helpless rage. He\u0027d want to raid Mexico and make someone pay.\"\\n\\n I thought hard about those awful piano lessons I suddenly remembered having at Our Lady of the Lake school to block her enhanced intuitions. Did I want to correct their assumption, that Ric had been captured and tortured while out of the country, not in Vegas? No.\\n\\n \"Why does Ric keep returning to Mexico?\" I asked instead. \"His memories must be horrendous.\"\\n\\n \"The men who held him captive then are crime kingpins now, drug lords and human and unhuman slavers. They\u0027re exploiting and torturing his people. He needs to stop them.\"\\n\\n \"I saw-\" I began.\\n\\n \"Saw what? Oh.\" She drew back as if I\u0027d slapped her.\\n\\n I\u0027d been unable to keep the image of Ric\u0027s whip-scarred back from my mind\u0027s eye.\\n\\n We both sipped Vampire Sunrises, girding ourselves.\\n\\n \"What did he tell you about the scars?\" she asked finally.\\n\\n \"Nothing. I saw them while he was sleeping. He keeps me-I imagine all women-from touching his back, even clothed.\"\\n\\n She fidgeted in the cushy chair. \"That\u0027s not good but understandable.\"\\n\\n \"He was just a child!\"\\n\\n \"Nine when he was freed.\"\\n\\n \"Who? Why?\"\\n\\n \"El Demonio. A fittingly obvious name,\" she said bitterly. \"This \u0027demon\u0027 surnamed Torbellino now heads a dozen criminal operations all over Mexico and along the U.S. border. When Ric was captured, El Demonio was only a border-running coyote. Ric ran away, and when he was inevitably caught and returned, he was whipped. El Demonio had a thirty-foot bullwhip he liked to unfurl, at long distance or short.\"\\n\\n My stomach told me I was getting nauseous. Our shared dream had made me feel the unimaginable brutality of using such force against a valuable child laborer. I just suffered from a lack of love. Ric had been hated.\\n\\n \"One whipping like that would have killed him,\" I said, amazed he was still here to talk about.\\n\\n \"Ric ran away and was caught, and then ran away again. And again.\"\\n\\n \"Even though he knew-? That\u0027s crazy.\"\\n\\n \"It was how he kept his spirit from being broken. If he let those men intimidate him into giving up on freedom, it would mean nothing if and when he finally got it. They call it \u0027fire in the belly.\u0027 Ric is probably the only person who challenged El Demonio and lived.\\n\\n \"So,\" she went on, \"from what you\u0027ve said, he either didn\u0027t fall into El Demonio\u0027s hands this time, or the man\u0027s henchmen didn\u0027t know whom they\u0027d captured. If he was tortured lying on his back, as the frontal injuries you describe indicate, his identity would remain secret.\"\\n\\n I clasped my arms against the chill I felt at her medical, logical approach to this atrocity. Perhaps to keep her motherly feelings at bay?\\n\\n Even worse, I now knew that two demonic forces would love to recapture and try to break Ricardo Montoya yet again, this El Demonio and his associates as well as the Egyptian vampires.\\n\\n She saw my goose bumps, picked up her doffed cardigan, and laid it over my shoulders. That motherly gesture nearly undid me. Nobody had touched me or my clothes that I could remember, nobody had ever dressed me until Ric started undressing me, which was another thing entirely.\\n\\n Still, her words haunted me. I was supposed to be glad the Pharaoh freaks had wanted Ric\u0027s throat accessible while they tormented him with leeches and vampire tsetse flies and held a group suck party at his neck?\\n\\n \"Delilah, I can\u0027t glimpse your thoughts right now, but I can tell you\u0027re overdramatizing,\" she said softly.\\n\\n Darn right.\\n\\n \"Your husband hasn\u0027t even the slightest notion that you\u0027re able to see into other people\u0027s heads since the millennium turned?\" I asked, wondering what that would do to the trust in a marriage. Who was I kidding? In my relationship with Ric too.\\n\\n \"No. Washington bureaucrats only subscribe to facts. They are the most inadaptable creatures on the planet.\"\\n\\n I wondered if either of the Burnsides knew Ric could dowse for the dead and guessed they didn\u0027t. Ric had been only nine when he was rescued and the wife began to work with him. He was only fifteen at the Millennium Revelation. He didn\u0027t start dowsing for the dead again until he was out of college and training at the FBI\u0027s Body Farm. Helena admitted her enhanced \"intuitions\" could be blocked. An adult Ric would surely hide his resurrected powers to avoid worrying his only parental figures, as he had concealed his disfigured back from me. The Burnsides probably thought El Demonio had kept him prisoner as a goatherd.\\n\\n \"Will he look the same?\" she asked, visibly nervous for the first time.\\n\\n I nodded. Yes, he would.\\n\\n Especially now that I had sneaked that long-wear brown contact lens into the Inferno bridal suite.\\n\\n He would look perfectly the same.\\n\\n Only time and a return to consciousness would tell if he was the Ric I knew and loved. \\n\\n","sourceLink":"https://allnovel.net/vampire-sunrise-delilah-street-3/page-6.html","bookId":2115,"book":{"id":2115,"title":"Vampire Sunrise (Delilah Street #3)","description":"Storyline: Vampire Sunrise (Delilah Street #3) \\n Werewolf mobsters and vampires run Vegas, but that\u0027s yesterday\u0027s news for Delilah Street, paranormal investigator. What\u0027s truly fearsome is her bloody discovery of an undead evil rooted in ancient Egypt. Now, with her lover Ric fighting for life after a grim battle, the chips are down. But Delilah is a born winner who has never let a little danger throw off her game, and she\u0027s been learning fast since she came to Sin City. Her affinity for silver is making mirror-walking a real breeze, and being forced to accept the albino rock star sorcerer Snow\u0027s Brimstone Kiss has ramped up her powers to a startling new level. With the help of her trusty uber-wolfhound Quicksilver, not to mention the orange demon parking valet Manny, Delilah is determined to solve even more paranormal secrets, and hopefully save the few innocents left in town...\\n","cover":"https://allnovel.net/images/vampire-sunrise-delilah-street-3.jpg","author":"Carole Nelson Douglas","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/vampire-sunrise-delilah-street-3.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 5:55:37 PM"}}
