{"id":104691,"no":19,"title":"Page 19","content":"“You know a kid named Justin White, Mr. Wong? High school kid?” “No. You asked me that back at the police station. He’s one of the missing, right?” No, you know him. Think. Morgan said, “Drives a cherry-red ’65 Mustang?” Ah. I didn’t know the man but I knew the car. This was the baby-faced blond kid I saw Jennifer making out with at the party. “I know what he looks like, that’s it.” “He’s the guy who called in the—the whatever happened here. Now, this is how my day started. Just so you understand me, so you understand my state of mind. Okay? Kid calls nine-one-one in a panic, hysterical, talkin’ about a dead body. This was about four in the morning. I happened to be two blocks away at the time. So I race over and I’m the first one there and from outside I hear screamin’. And there’s people runnin’ away, kids peelin’ out in their cars. Party that went bad and all that.” He stopped splashing the gasoline and sat the can on the ground. He stared off into space for a moment. He sucked some inspiration from his cigarette butt and spoke again. “I go up to the door, I tell ’em it’s the cops. I go inside and I see— —I WAS THERE. Just like that. I was still in the trailer, standing in the exact same spot. Only the pain in my cheek was gone, and horrible rap/reggae hammered my ears from a floor stereo across the room. The light was different and a glance toward a window told me it was night. I looked down and again couldn’t see my feet. Here, but not here. It was like somebody had hit rewind on the trailer, the playback from about twelve hours ago. The room was full of people. I spotted the faces of Jennifer Lopez and Justin White in the crowd. I scanned the room for John, but there was no sign of him. But of course he would have been gone by now, back at his apartment having a rough night of his own. The music thumped but nobody was moving, or talking. All were standing frozen, their eyes fixed on a spot to my right. Holy shit the song was bad. It was “Informer” by the white reggae rapper Snow. “Infooooormer, younosaydaddymesnowblahblahblay . . .” I turned to see what was so compelling as to draw a room full of frozen stares. Robert the pseudo-Jamaican’s body was curled up on the floor, twitching. He was saying, “I’m okay, I’m okay, mon! Just give me a minute now! I’m feelin’ better!” His words would have been more reassuring if his head hadn’t been separated from his body, laying a good two feet away from the shredded pink stump of his neck. The disembodied head kept offering reassurances, the head scooting around the floor slightly with each movement of his jaw. One of Robert’s arms came free at the shoulder, landing softly on the carpet. I realized with revulsion something was wriggling in the exposed guts, like worms. Someone screamed. The party turned into a stampede. I jumped as some girl ran through me, passing through where my body should be. Everybody was circling around Robert, trying to get to the door while avoiding the infested, oozing mess and—holy shit is this song bad. It was like the singer was stabbing my ear with a dagger made of dried turds. The music stopped abruptly. Somebody had knocked over the stereo. I saw Justin in the corner, screaming into his cell phone. “I said he’s dead! And he’s talking! But he’s also dead! Just fucking get down here and you can see for yourself!” I watched the partygoers spill out of the door, but never saw Jennifer pass me. I turned and saw the back of somebody heading the opposite way, down the hall. No door down there, dumbass. But there is a basement under the bathroom. There was a sound like a garbage bag of pudding dropped off a tall building onto a sidewalk. Robert had erupted, chunks slapping off the walls in every direction. Justin let the phone fall from his hand. His mouth hung open. The room had emptied, now just him and the pink pile of what was left of the Rastafarian drug dealer, together in total silence. A single white insect appeared. It circled above the wet wreckage of Robert’s former body, a white streak, creating the faintest buzz in the silent room. The insect was joined by another. Then two more. The sound grew. A high-pitched noise somewhere between the chattering of angry squirrels and the screech of locusts. Dozens now. Each time I blinked, the swarm doubled in size. The bugs were long, like worms, and flew horizontally. Too many to count now, a swirling cloud above the spilled flesh. I wanted out of this room, out of this town, off this planet. I had no means to move. It was the nightmare we’ve had a thousand times, a horror we can’t run from because the horror has swallowed us whole. The sound grew with the swarm, I could feel it, it had a gut-level power like the pulse of John’s music at the party last night. Then, in unison, the white swarm flew toward Justin. He screamed. The door burst open— —I BLINKED, AND saw Morgan in front of me. The stench of gasoline flooded my sinuses. Back again. “I come through the door and this kid, Justin, he’s on his hands and knees and just wailing. And I think he’s been stabbed in the gut but I look closer and he’s got something on him. All over him, his arms and his face.” Morgan left the cigarette in his mouth as he spoke, the paper burning away, leaving a quarter inch of ash dangling off the end. Gasoline dripped off the wallpaper around me. “It looks like, like thick hairs. All over him,” he said. “White, maybe like pipe cleaners, or little twisted bits of fishing line. And they’re on his eyelids and ears and neck and arms and this guy is screamin’, on his hands and knees, just shrieking like a little kid. And I see these things in the air, too, buzzing around him.” A half inch of ash hanging off his cigarette now. My eyes moved from it to the gasoline-soaked floor at his feet. “And man, I am frozen there, in the doorway. I mean, I look over and on one side of the room I got a guy sprayed all over the walls like he stepped on a land mine and then there’s this, and I should go try to, try to render some assistance but I don’t wanna touch him. I don’t want whatever’s on him on me.” Morgan’s words trailed off again. He looked down at his own hands, as if to make absolutely sure they were clean. The long hunk of ash fell off of his cigarette, onto the wet carpet below. It went out with a soft hiss. Morgan said, “Then I did what I shouldn’t have done: I ran back out to my car and called for the ambulance. I mean, it’s already on the way and I shoulda stayed in and, I don’t know, found a can of bug spray or somethin’ or dragged the guy off into the shower and washed these things off him but I couldn’t. I couldn’t make myself because of the way the guy was screamin’. But not just that. Bugs, even biting bugs, I’ll handle if I got to. But I could . . .” He paused, testing what he was about to say in his own head. “I could hear them. Inside me. Do you understand?” I didn’t, but found myself unable to speak. He opened a closet, doused the contents with gas. “So I go to the car and I call it in and I’m real vague about what’s goin’ on, okay? I got a can of Mace in the car and I grab it and I head back inside and I’m thinkin’ I should call a hazmat team, guys who could come in and, I don’t know, seal this place off, disinfect it. But I gotta try to help this guy first and I rush back inside, and . . . he’s fine. Just like that. He’s standing there fixin’ his hair and there’s no sign of these things nowhere, the bugs or whatever. And this kid, Justin, he starts talkin’ like normal, like I just got there.” I went down to the bedroom, threw open the door and, without looking in, tossed in the half-full gas can. I shut the door behind me. Morgan saw me, smiled. “Yeah, you saw that. That painting. That’s messed up, ain’t it? Ain’t no man who could do that. And I tell ya what, you stay in there long enough, that mural gets inside your head. The dude that was takin’ pictures of the crime scene, he went in there for half an hour. He had to be dragged out and he was cryin’. Like a little baby.” I said nothing. He went on. “So the ambulance gets here, and the kid says he’s fine but I put him in it anyway, told the guys the kid maybe had somethin’ in his blood that could kill him any second. I mean, I know this kid is . . . infested, I guess. And I wanna know what this stuff is, but I never found out because the kid never arrived at the hospital. That ambulance took off from here with sirens and lights and it’s goin’ to St. John’s, which is just ten minutes away. Ambulance crew shows up there forty-five minutes later, laughin’ and jokin’ and carryin’ fast-food cups, and the kid is nowhere in sight. They ask the two guys what happened and they got no idea what anybody’s talkin’ about. No memory of any of it. Nobody’s heard from the kid since and when they go back out to the garage they find the effing ambulance is gone. They still ain’t found it. So, do you understand the kind of day I’m havin’?” I wiped my cheek with the handkerchief, now deep red and sticky. My hands stank of fuel. I tried to process all this, still studying the carpet, wondering if maybe there wasn’t a swarm of alien bugs zipping around under the subfloor. “So,” I said, “can you, uh, hear anything? Right now? Like they’re still hanging around in here?” “Not since I got back.” “But you’re gonna burn the place down just to make sure?” “That’s right.” “And you’re not gonna let me go.” He was silent for a moment, then said, “Those things that were on the guy? I been describing them like they were bugs or worms or something, you know, something you’ve seen before. But when they flew, I had one fly right across my face, okay, and they didn’t have, like, wings or anything. They had this little row of bristles, spiraling down their length like a barbershop pole. They sort of twisted through the air like that, headlong. A corkscrew motion. And the ones that were on the guy, on his skin? That’s what they were doin’ I think, turnin’ and drillin’ themselves into him. You understand?”","sourceLink":"https://allnovel.net/john-dies-at-the-end-john-dies-at-the-end-1/page-19.html","bookId":2487,"book":{"id":2487,"title":"John Dies at the End (John Dies at the End #1)","description":"Storyline: John Dies at the End (John Dies at the End #1) STOP. You should not have touched this flyer with your bare hands. NO, don\u0027t put it down. It\u0027s too late. They\u0027re watching you. My name is David Wong. My best friend is John. Those names are fake. You might want to change yours. You may not want to know about the things you\u0027ll read on these pages, about the sauce, about Korrok, about the invasion, and the future. But it\u0027s too late. You touched the book. You\u0027re in the game. You\u0027re under the eye. The only defense is knowledge. You need to read this book, to the end. Even the part with the bratwurst. Why? You just have to trust me. The important thing is this: The drug is called Soy Sauce and it gives users a window into another dimension. John and I never had the chance to say no. You still do. I\u0027m sorry to have involved you in this, I really am. But as you read about these terrible events and the very dark epoch the world is about to enter as a result, it is crucial you keep one thing in mind: None of this was my fault.","cover":"https://allnovel.net/images/john-dies-at-the-end-john-dies-at-the-end-1.jpg","author":"David Wong","type":"Humorous","source":"allnovel","link":"https://allnovel.net/john-dies-at-the-end-john-dies-at-the-end-1.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:35:08 PM"}}
