{"id":104674,"no":2,"title":"Page 2","content":"\\n\\n “Yes. I can hear him, too. And he, uh . . .”\\n\\n She brushed the bandage on the side of her skull. I looked at her in bewilderment. Was she serious?\\n\\n “He hits you?”\\n\\n “Yes.”\\n\\n “With his fist?”\\n\\n “Yes.”\\n\\n John looked up from his coffee indignantly. “Man, what a dick!”\\n\\n I did roll my eyes this time and glared at John once they stopped. I don’t know if you’ve ever seen a ghost, but I’m guessing that if you did, the thing didn’t run over and punch you in the face. I’m guessing that’s never happened to any of your friends, either.\\n\\n “When it first happened,” Shelly said, “I thought I was going crazy. Up until now, I’ve never bel—”\\n\\n “Believed in ghosts,” I finished. “Right.” That line was obligatory, everybody wanting to come off as the credible skeptic. “Look, Miss, I don’t want to—”\\n\\n “I told her we would look into it tonight,” John said, heading me off before I accidentally introduced some rational thought into this thing. “He’s haunting her house, out in [town name removed for privacy]. I thought you and I could head over there, get out of the city for a night, show this bastard what’s what.”\\n\\n I felt a burst of irritation, mostly because John knew the story was bullshit. But then it suddenly clicked in my mind that, yes, John knew, and he had called me because he was trying to set me up with this girl. Button-cute, dead boyfriend, chance to be her hero. As usual, I didn’t know whether to thank him or punch him in the balls.\\n\\n Sixteen different objections rose up in my mind at once and somehow they all canceled each other out. Maybe if there had been an odd number. . . .\\n\\n WE HEADED OUT, in my Bronco. We had told Shelly not to drive herself, in case she had a concussion, but the reality was that, whether or not her story was true, we still had vivid memories of Mr. Campo and his unusually spidery car. You see, Frank found out the hard way that the dark things lurking in the night don’t haunt old houses or abandoned ships. They haunt minds.\\n\\n Shelly was in the passenger seat, hugging herself, looking blankly out the windshield. She said, “So, do you guys, like, do this a lot?”\\n\\n “Off and on,” said John. “Been doing it for a few years.”\\n\\n “How does somebody get into this?”\\n\\n “There was an incident,” he said. “A series of incidents, I guess. A dead guy, another dead guy. Some drugs. It’s kind of a long story. Now we can see things. Sometimes. I have a dead cat that follows me around, wondering why I never feed it. Oh, and I had one hamburger that started mooing when I ate it.” He glanced at me. “You remember that?”\\n\\n I grunted, said nothing.\\n\\n It wasn’t mooing, John. It was screaming.\\n\\n Shelly didn’t look like she was listening anymore.\\n\\n “I call it Dante’s Syndrome,”\\n\\n John said. I had never heard him call it any such thing. “Meaning, I think Dave and I gained the ability to peer into Hell. Only it turns out Hell is right here, it’s all through us and around us and in us like the microbes that swarm through your lungs and guts and veins. Hey, look! An owl!”\\n\\n We all looked. It was an owl, all right.\\n\\n “Anyway,” I broke in, “we just did a couple of favors for people, eventually word got around.”\\n\\n I felt like that was enough background and I wanted to stop John before he got to the part where he says he kept eating that screaming hamburger, down to the last bite.\\n\\n I left the truck running as I jumped out at my place for supplies. I bypassed the house for the weatherworn toolshed in the backyard, opened the padlocked door and swept over the dark shelves with my flashlight:\\n\\n A Winnie the Pooh toy with dried blood around its eyes;\\n\\n A stuffed and mounted badgerconda (a cross between a badger and an anaconda);\\n\\n A large Mason jar filled with cloudy formaldehyde, where inside floated a six-inch clump of cockroaches arranged roughly in the shape of a human hand.\\n\\n I grabbed a medieval-style torch John had stolen from the wall of a theme restaurant. I picked up a clear squeeze bottle filled with a thick green liquid that immediately turned bloodred as soon as I touched it. I reconsidered, sat it back on the shelf and grabbed my vintage 1987 ghetto blaster instead.\\n\\n I went into the house and called to Molly. I opened a small plastic tub in the kitchen cabinet filled with little pink, rubbery chunks, like erasers. I put a handful in my pocket and rushed back out the door, the dog following on my heels.\\n\\n Shelly lived in a simple two-story farmhouse, black shutters on white siding. It sat on an island of turf in a sea of harvest-flattened cornfields. We walked past a mailbox shaped like a cow and saw a hand-painted sign on the front door that read THE MORRISON’S—ESTABLISHED 1962. John and I had a long debate at the door about whether or not that apostrophe belonged there.\\n\\n I know, I know. If I had a brain, I would have walked away right then.\\n\\n John stepped up, pushed open the front door and ducked aside. I dug in my pocket and pulled out one of the pink chunks. They were steak-shaped dog treats, complete with little brown grill lines. I realized at that moment that no dog would know what those grill lines were and that they were purely for my benefit.\\n\\n “Molly!”\\n\\n I shook the treat in front of her and then tossed it through the door. The dog ran in after it.\\n\\n We waited for the sound of, say, dog flesh splattering across a wall, but heard only the padding of Molly’s paws. Eventually she came back to the door, grinning stupidly. We decided it was safe to go in.\\n\\n Shelly opened her mouth as if to express some kind of disapproval, but apparently decided against it. We stepped into the dark living room. Shelly moved to flip on a light, but I stopped her with a hand motion.\\n\\n Instead, John hefted the torch and touched his lighter to it. A foot-tall flame erupted from the head and we slowly crept through the house by its flickering light. I noticed John had brought along a thermos of his coffee, this “favor” already qualifying as an all-nighter. I admit, the horrific burning sensation really did keep you awake.\\n\\n I asked, “Where do you see him, mostly?”\\n\\n Shelly’s fingers started twisting at her skirt again. “The basement. And once I saw him in the bathroom. His hand, it, uh, came up through the toilet while I—”\\n\\n “Okay. Show us the basement door.”\\n\\n “It’s in the kitchen, but I—guys, I don’t wanna go down there.”\\n\\n “It’s cool,” John said. “Stay here with the dog, we’ll go down and check it out.”\\n\\n I glanced at John, figuring that should have been my line as her handsome new knightly protector. We clomped down the stairs, torchlight pooling down the stairwell. Shelly waited behind us, crouching next to Molly and stroking her back.\\n\\n A nice, modern basement.\\n\\n Washer and dryer.\\n\\n A hot-water heater making a soft ticking sound.\\n\\n One of those waist-deep floor freezers.\\n\\n John said, “He’s not here.”\\n\\n “Big surprise.”\\n\\n John used the torch to light a cigarette.\\n\\n “She seems like a nice girl, doesn’t she?” John said softly and with a kind of smarmy wink in his voice. “You know, she reminds me of Amber. Jennifer’s friend. When she came to my door, for a second I actually thought it was her. By the way, I wanna thank you for comin’ along, Dave, sort of being my wingman on this. I’m not saying I’m going to take advantage of her distress or anything, but . . .”\\n\\n I had tuned John out. Something was off, I knew right then. Lingering in the back of my mind, like a kid in the last row of the classroom with his hand up. John was acting all detectivey now, leaning over a large sink with a bundle of white cloth draped over the side.\\n\\n “Oh, yeah,” said John, pulling up a length of cloth. “Take a look at this shit.” The garment was white, a single piece with straps, like an apron. Well, it had been white. Once. Now it was mostly smudges of faded-blood pink at the center, like a kindergarten kid’s rendering of the Japanese flag.\\n\\n I turned to the large floor freezer. That freaking dread again, cold and hard and heavy. I strode over and opened the lid.\\n\\n “Oh, geez.”\\n\\n It was a tongue. That’s the first thing I saw, rubbery and purplish and not quite human. It was longer, animal-like, twisted inside a ziplock bag and coated in frost. And it wasn’t alone; the freezer was filled with hunks of flesh, some in clear bags, some bigger chunks in pink-stained white paper.\\n\\n Butcher paper. White apron.\\n\\n “Well, I think it’s obvious,” said John. “Those stories of UFOs that go around mutilating cows? I think we just solved it, my friend.”\\n\\n I sighed.\\n\\n “It’s a deer, you jackass. Her dad hunts, apparently. They keep the meat.”\\n\\n I nudged around and found a frozen turkey, some sausages. I closed the lid to the fridge, feeling stupid, though not for the reason I should have felt stupid. I wasn’t thinking. Too late at night, too little sleep.\\n\\n John started poking around in cabinets. I glanced around for the boom box, realizing now that we hadn’t brought it down here. Why did that bother me? It was upstairs with Shelly, right?\\n\\n “Hey, Dave. You remember that guy whose basement got flooded, then called us and swore he had a fifteen-foot great white shark swimmin’ down there?”\\n\\n I did remember but didn’t answer, afraid of losing that thread of thought that kept floating just out of reach like a wayward balloon on a windy day. Besides, when we got there, it wasn’t a great white at all. Just a garden-variety eight-foot tiger shark. We told the guy to wait until the basement dried out and call us back. When the water left, so did the shark, as if it evaporated or seeped out the tiny cracks in the concrete.\\n\\n Think. Damned attention span. Something is wrong here.\\n\\n I tried to pull myself back from my tangent, thinking of the boom box again. John had found it at a garage sale. There’s a story in the Old Testament, a young David driving away an evil spirit by playing pretty music on his harp—\\n\\n Wait a second. \\n\\n","sourceLink":"https://allnovel.net/john-dies-at-the-end-john-dies-at-the-end-1/page-2.html","bookId":2487,"book":{"id":2487,"title":"John Dies at the End (John Dies at the End #1)","description":"Storyline: John Dies at the End (John Dies at the End #1) \\n STOP. You should not have touched this flyer with your bare hands. NO, don\u0027t put it down. It\u0027s too late. They\u0027re watching you. My name is David Wong. My best friend is John. Those names are fake. You might want to change yours. You may not want to know about the things you\u0027ll read on these pages, about the sauce, about Korrok, about the invasion, and the future. But it\u0027s too late. You touched the book. You\u0027re in the game. You\u0027re under the eye. The only defense is knowledge. You need to read this book, to the end. Even the part with the bratwurst. Why? You just have to trust me. \\n The important thing is this: The drug is called Soy Sauce and it gives users a window into another dimension. John and I never had the chance to say no. You still do. I\u0027m sorry to have involved you in this, I really am. But as you read about these terrible events and the very dark epoch the world is about to enter as a result, it is crucial you keep one thing in mind: None of this was my fault.\\n","cover":"https://allnovel.net/images/john-dies-at-the-end-john-dies-at-the-end-1.jpg","author":"David Wong","type":"Humorous","source":"allnovel","link":"https://allnovel.net/john-dies-at-the-end-john-dies-at-the-end-1.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:35:08 PM"}}
