{"id":104710,"no":38,"title":"Page 38","content":"\\n\\n The roach pile in the seat grew and grew until it was a grotesque, lumpy column two feet high. Bugs were pouring around my shoes like floodwater, flowing up the tires and across the fenders and into the driver’s seat. Their stampede made a soft sound like someone crunching cereal from across the room and I could smell the things, an odor like an old fryer full of dirty cooking oil.\\n\\n In the seat, two smaller columns jutted from the base of the bug pile like tree roots, hanging off the front of the seat, building down toward the floorboard. The lump now had legs.\\n\\n They were, I saw, forming themselves into a human figure.\\n\\n Hey, why not?\\n\\n Arms formed a few seconds later. Finally, a head. A full replica of a man sculpted entirely from cockroaches now sat comfortably in the driver’s seat.\\n\\n The compacted ball of roaches that was its skull rotated toward me, as if it had turned to look me in the eye.\\n\\n It spoke.\\n\\n “A cockroach has no soul. Yet it runs and eats and shits and fucks and breeds. It has no soul, yet it lives a full life. Just like you.”\\n\\n Time froze. I was locked in this moment, with this thing. I spoke, but I don’t think my mouth ever moved.\\n\\n I said, or thought, “Who are you?”\\n\\n “Who are you? Who are you to one like Korrok, who fills his belly with great men, swallowing them as a whale swallows swarms of krill? The desires and ambitions of men who towered over you are, in Korrok, digested over eternities, fermenting into an anguish that exceeds the sum of all of living mankind’s suffering through the ages. Populations of worlds roil in his guts, the mad screams and desperate longings of seven trillion souls escape every time Korrok farts. And he does fart. So let me repeat my question: who are you, you shit-spewing crotch-fruit?”\\n\\n “I’m nobody,” I found myself saying. “I’m nobody. Why not just leave me be? I have nothing you can take.”\\n\\n “Korrok enjoys bitter food, and he has decided to let you rest on his tongue. Then, he will swallow. You wish to be left alone? You will get that wish. You will die alone, with shit in your pants. That is a prophecy.”\\n\\n I blinked, and realized that the time standing still wasn’t an illusion—no time had actually passed. The whole conversation was relayed directly to me via a conduit the soy sauce granted me all those months ago.\\n\\n The roach man raised its hand. My car keys. It started the Hyundai. Its other arm clasped the open door with fingers of knotted insects, and pulled it shut.\\n\\n The roach man shifted into reverse, backed out of the space and drove to the parking lot exit. It signaled a right turn, then drove off into the night. I looked down and saw the lot was now clean of insect life.\\n\\n John threw away his cigarette and said, “Shit. I knew that was gonna happen.”\\n\\n Shakily I said, “What now?”\\n\\n “You okay?”\\n\\n “It . . . spoke to me. I think.”\\n\\n “What’d it say?”\\n\\n “Just . . . I don’t know.”\\n\\n “Man, how are you gonna report this to your insurance company?”\\n\\n We heard an engine from behind us, a white Ford Focus rolling into the parking lot. Out the side window popped the pretty head of Krissy, the girl from the couch at the crime scene. I stepped closer and saw that, yes, her body was attached.\\n\\n “Hey, I’m glad I caught you guys. Did you see that newscast?”\\n\\n John trotted up, carrying his satchel. “Yes. Wexler’s gone. We need your car.”\\n\\n “What? Why?”\\n\\n John circled around to the passenger-side door and said, “Car chase.”\\n\\n She smiled. “Cool. Hop in.”\\n\\n “Wait,” I said, digging out my roll of TestaMints. “Here. Eat one of these.”\\n\\n “And who are you, again?” she asked.\\n\\n “I’m the only man here who has his head on straight. This ain’t a situation for the dogcatcher anymore. There’s something else, something dark. We’re talking every bad thing you’ve ever thought didn’t exist, demons and witchcraft and gremlins and Sasquatch and I don’t care if you believe or—”\\n\\n “All right, all right. Stop talking. I know what I saw tonight.” She reached into her sweatshirt and pulled out a gold cross dangling on a thin chain. “See? Could I wear this if I were some kind of a devil or vampire or something? Now are you getting in or not?”\\n\\n I studied her as best I could, judged her on the spot. I got in the car. The tires chirped as she pulled out of the parking lot, turning the same direction roach man had gone.\\n\\n Traffic was dead at this hour and we hummed along with the speedometer hovering just over the seventy-five mark.\\n\\n So freaking dark. No moon and no stars and we’re all on our own down here—\\n\\n “There!” said John. Taillights way up ahead. Small and close together. It was my boy, all right. It was at this moment I realized we, again, had no plan for what to do once we caught up to it. The same thing apparently occurred to Krissy, who asked, “What do we do now?”\\n\\n “Get up alongside,” said John. “And then ram it off the road.”\\n\\n “I’m not doin’ that! Who’s gonna pay for the—”\\n\\n She cut off her words with a scream. We were close now, close enough for her to see the driver. “What is that thing?”\\n\\n “You don’t wanna know,” John said. “But don’t be afraid. Get up close again, I got a plan.”\\n\\n She looked confused, but faced forward and pressed the Focus up to eighty. We ran up alongside the blue compact. “Keep us even,” John said as he rolled down the window. Roach man had his window down, too, one roachy elbow resting outside the window like a trucker. The occasional roach dripped off his arm like candle wax, flicking off into the wind.\\n\\n John started to climb out of the window, wind whipping his hair around his face and I had the crazy idea that he was going to try to fling himself over to the other car like Bruce Willis. Instead he leaned his torso back against the car and braced his knees against the inside of the door. He unzipped his pants.\\n\\n Roach man turned his roach head toward us just in time to take a windblown spray of urine to the face. The creature flailed and convulsed; the Hyundai wobbled in its lane. The little tires lost traction and the car went soaring off the side of the road. It plowed through weeds and tipped nose-down over an embankment, landing in a culvert with a white explosion of water.\\n\\n Krissy pulled over and we all spilled out.\\n\\n “What was that? Huh?” I screamed at John. “What the hell was that?”\\n\\n “Hey, we stopped him.”\\n\\n “The goal was to get the car back. My car. Intact. And not splattered with urine.”\\n\\n “Look! Oh, man—”\\n\\n A dark shape.\\n\\n Floating up from the Hyundai.\\n\\n A black plume of smoke.\\n\\n With two glowing eyes.\\n\\n I felt it. It was as if the shadow man had reached out to me, cold fingers running through my skull and down my spine.\\n\\n Then, it was gone, slipping soundlessly off into the night. I heard a breathy sound from Krissy. She had slapped a hand over her mouth, eyes wide.\\n\\n John said, “They’re here, Dave. They’re here. They’re here, they’re here, they’re here. Shit.”\\n\\n I hissed, “What are they?”\\n\\n “Don’t know. It’s probably in Marconi’s book but I can never finish it, it gets so slow after the first two chapters.”\\n\\n To Krissy I said, “Don’t worry, it looks like it left. You saw it?”\\n\\n She shook her head. “I felt it. It just ran through me, this sort of heavy feeling like—like there was nothing here. Like everything was nothing, everything everywhere. There’s like molecules and stuff but behind it, nothing. Just cold and dark . . .”\\n\\n She fell into silence.\\n\\n I said to John, “When it spoke to me, it mentioned Korrok. Just like Molly.”\\n\\n “Was that thing Korrok?”\\n\\n “No. I’m sure of that.”\\n\\n Krissy wasn’t following this conversation at all, and instead focused her attention down toward the crashed Hyundai, two-thirds submerged in the standing water, its rear stuck into the air like the Titanic.\\n\\n “Ew! What’s that?”\\n\\n A layer of cockroaches two inches thick floated out from around the car like an oil slick, clumps here and there still holding the shape of limbs. A half dozen old fast-food bags floated up from the interior and hung nearby like buoys.\\n\\n “Roaches,” I said. “You can see them?”\\n\\n “Yeah. Where’d they come from?”\\n\\n “My car was really dirty.” I turned to John. “What the shadow guy here did with the bugs? I think he did the same to Molly. Just reached out and took over.”\\n\\n John said, “And Wexler, too, I guess. So. They can do that.”\\n\\n “This is indescribably bad. What now?”\\n\\n Krissy asked, “Are they, like, demons?”\\n\\n “Well, they’re evil,” said John. “You just saw one of them steal a car.”\\n\\n “Molly!”\\n\\n Krissy, pointing down the road.\\n\\n Sure enough, the dog that was standing about twenty yards away, it was either Molly or an exact replica.\\n\\n To me John said, “Ghost?”\\n\\n “Krissy can see her.”\\n\\n “Zombie then. Well, she’s earthbound, that’s a positive sign.”\\n\\n Molly barked, trotted off down the road, then turned and barked again.\\n\\n John said to Krissy, “She wants us to follow her.” He said it to her, not to me. Leaving me out of the decision. Asshole.\\n\\n I glanced at my watch. “Anybody want to go to Denny’s? Maybe this thing will sort itself out.”\\n\\n They both went to the car. I started listing all of the things that were retarded about this plan, and by the time I reached the end we were all rolling down the street with the copper dog in our headlights.\\n\\n After a few minutes, the dog, looking perfectly healthy despite having exploded in half earlier that evening, turned and bounded off the road. She streaked across an expanse of weeds, gravel and busted concrete.\\n\\n We were at the Mall of the Dead. \\n\\n","sourceLink":"https://allnovel.net/john-dies-at-the-end-john-dies-at-the-end-1/page-38.html","bookId":2487,"book":{"id":2487,"title":"John Dies at the End (John Dies at the End #1)","description":"Storyline: John Dies at the End (John Dies at the End #1) \\n STOP. You should not have touched this flyer with your bare hands. NO, don\u0027t put it down. It\u0027s too late. They\u0027re watching you. My name is David Wong. My best friend is John. Those names are fake. You might want to change yours. You may not want to know about the things you\u0027ll read on these pages, about the sauce, about Korrok, about the invasion, and the future. But it\u0027s too late. You touched the book. You\u0027re in the game. You\u0027re under the eye. The only defense is knowledge. You need to read this book, to the end. Even the part with the bratwurst. Why? You just have to trust me. \\n The important thing is this: The drug is called Soy Sauce and it gives users a window into another dimension. John and I never had the chance to say no. You still do. I\u0027m sorry to have involved you in this, I really am. But as you read about these terrible events and the very dark epoch the world is about to enter as a result, it is crucial you keep one thing in mind: None of this was my fault.\\n","cover":"https://allnovel.net/images/john-dies-at-the-end-john-dies-at-the-end-1.jpg","author":"David Wong","type":"Humorous","source":"allnovel","link":"https://allnovel.net/john-dies-at-the-end-john-dies-at-the-end-1.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:35:08 PM"}}
