{"id":104748,"no":77,"title":"Page 77","content":"\n I said, “Amy, I told you before—”\n “No. We tried it your way. Let’s get far away from here and if the bad guys follow, we’ll deal with it then. But let’s at least try.”\n “Okay, but it’ll take time for us, John and me. We got jobs, we got to get things in order. John’s got family here. But you, you can go now and I say we do it tomorrow. Is there anywhere you can go? You got friends far away? Anywhere? Somebody with a couch you can crash on?”\n “I don’t know. I guess. I know a girl on the Internet; she lives in Utah with another girl. They’re lesbians.”\n “Good. That’s good. You’ll call them or send them something on your computer and ask if you can crash there. We’ll buy a plane ticket and fly your ass to Utah.”\n She said nothing. She scooted over and leaned her head on my shoulder, ribbons of firelight dancing on the lenses of her glasses. Eventually she said, “And then I’ll never, ever see you again.”\n I couldn’t think of a way to answer that without telling an outright lie, so I just mumbled something that sounded reassuring. She said, “I’ll go, but I’ll call when I’m out there. And you have to take my calls. If you don’t I’ll just come right back. If I don’t get an answer from you I’ll be on a flight the next day.”\n “Okay. Um, sure.”\n She rearranged herself so that she was lying down, her head on my lap. Her breathing slowed and softened as she drifted off. She mumbled, “It’s, like, so cool that it’s snowing out there but not in here. It can’t snow on us. That’s so cool . . .”\n She started snoring softly.\n And that was that. I formulated a plan that if she got out there and away from the Hell that is this town, got a job and went to bars with her lesbian roommates, she’d settle in. Forget all about this, all about me. Out there the guys would figure out how hot she was, even without both hands, and she’d meet somebody and she’d stop calling and then all the loose ends would be tied up. I could shoot myself or take a bunch of pills and that would clean up the situation once and for all. I could do a real will, even have a lawyer draw it up, complete with a stipulation that John had to deliver my eulogy in the form of a seventeen-minute-long guitar solo, performed with a dual-necked guitar shaped like a naked woman. As for the property, I could sign it over to—\n I saw a light to my left. I slowly turned my head to see that, with power still out all over the city, the television had clicked on.\n Hands. That’s what I saw, a pair of hands, palms pressed against the screen. Then another pair, fingers clawing at the glass as if trying to escape. For a moment I thought it was snowing in the background but then my mind registered the worms, the white flying worms that poured through the air behind them. I thought I heard a scream, or felt it somehow, and a spray of red splattered the hands on the screen. A pair of hands fell away and just two were left, grabbing at the glass in desperation. One hand formed a fist and smashed against the glass, as if trying to break it. It pounded again and again, and I thought I could see blooms of blood opening on the knuckles. The fist reared way back this time and swung and—\n Thump\n —the TV shook. I almost pissed my pants. The fist pulled back, blood trickling down between the fingers now, and smashed against the screen once more. Again, the TV rattled on the shelf of my entertainment center, the whole set edging forward an inch with the impact. The fist drew back one last time—the set clicked off. Blackness.\n Those transmissions, the ones from Shit Narnia, never returned. It took me four hours to fall asleep.\n IT ACTUALLY WASN’T for another couple of days that we were able to get Amy on a plane. The storm broke that next day but the weather had still messed up the flight schedules. It took a day to hear back from her lesbians. They were thrilled to the point of giddiness to have her, though, and after an hour-long, giggly phone conversation they made arrangements to meet her at the airport in Salt Lake City. The two girls lived in Millcreek, which I guess was just outside of the city.\n We kept busy during those two days before Amy left for presumably forever and I successfully avoided any real conversation with her. I had lots of snow to clear off the sidewalk and even made paths around the side of the house for Molly. We took Amy shopping and she bought luggage and a bunch of sweaters because we couldn’t convince her that Utah wasn’t a frozen, mountainous wasteland year-round. I went back to Wally’s and finished a long-delayed project of placing anti-theft stickers on all of our DVDs. It was the kind of tedious, dreaded task that I wouldn’t want to dump in someone else’s lap after I committed suicide.\n On Wednesday Amy packed up and I drove her the three hours to Undisclosed International Airport in my Bronco. I had begged John to come along to act as a buffer against the awkwardness but he had work, his crew fixing a wall on a local diner that had collapsed under the weight of a fallen tree. Several times during the drive Amy would ask me if I was okay and I would say, “Sure!” and turn up the radio.\n I almost made it. I carried her bags in and we waded through the airport bullshit that seemed to take forever. She picked up her boarding pass and we checked her bags and there the security guys made it clear that only the one with a boarding pass could go any farther. I said good-bye and wished her a pleasant flight. And that’s where Amy lost it. She threw her arms around my neck and started crying into my shirt, telling me I had saved her life and she didn’t know what she would do if something happened to me and a whole lot of other ridiculous things. Then she made me promise that I would take care of myself. I did, before I could catch it.\n She stepped back and wiped her eyes and said, “You promise?”\n “Yeah.”\n “Remember that. Remember you promised.”\n I pointed at her and said, “Hey, say what you want about me but I keep my promises.”\n “And you guys will come see me out in Utah? I’m serious about this now. I’m gonna be mad if you don’t.”\n “Sure, Amy. You and me can share a room, John can sleep with the lesb—”\n “And you’ll look after Molly? And take care of my house?”\n By “take care of” she meant “destroy.” We had talked about that, decided to burn the place down. Our only point of disagreement is I wanted to make it look like an accident to collect the insurance money. She wanted to do the opposite, let the insurance lapse and just blatantly torch the place.\n We kissed and said some gooey things to each other that would sound silly if you weren’t there. I stood around and waited for her to board, passing through security and letting them check her shoes and all that shit, watched her walk away and kept watching out of a terminal window as her plane climbed and turned into a speck in the sky. I didn’t cry. And if you think I did, good luck proving it, asshole.\n I started to wander back toward the exits when I noticed a little girl following me. She couldn’t have been more than five years old, chubby, blond hair down to her waist. I walked, she kept up, I stopped, she stopped. Her eyes never left mine. I finally turned and was about to ask if she was lost, when she got down on her hands and knees and then lay flat on her stomach.\n Confused, I considered just walking away when she started slithering along the floor like a snake, legs clasped together and swishing back and forth behind her like a tail. She slithered across the floor like this all the way to the nearest wall, pushing her way into the men’s restroom, opening the swinging door with the crown of her head.\n Of course, I followed. I stepped into the room and saw the little girl melt into a puddle of black oil. The blackness rose and took shape and I began to consider that I had made a mistake.\n I started to back out of the room, realizing the two guys pissing at the urinals nearby didn’t even acknowledge any of this. Suddenly the black shape sprung at me and for a second, all I could see was darkness.\n THE AIR STANK. My ankles were submerged in cold liquid that sloshed when I moved my feet. I blinked and could almost see I was in a doorless room. I reached out and touched a metal wall. I could see only by two small spots of orange light and I realized with horror that it was the shadow creature’s eyes. There was a steady rumbling sound from all around us and I had to brace myself as the floor seemed to shift and tilt under me. The black thing stood at the end of the room and stared.\n “Where are we?” I asked, to see if it would respond more than anything else.\n The answer did not come in the form of an audible voice, but a picture. In a blink I had a perfect, mental image of an airliner and of a spot under the passenger compartment where a large center fuel tank was housed. I was standing inside the center fuel tank of a passenger jet. The liquid at my feet was jet fuel. I also knew with some certainty that this was Amy’s plane, that I was standing just a few feet under the spot where she was sitting and likely striking up a conversation with whoever she was seated with.\n Strangely, the first thought that came to me—even before “Am I really here?”—was that they had forgotten to fill up this tank. Then the answer came to me that they often leave it empty depending on the distance and load of the flight. Then I realized how creepy it was that I was having this telepathic conversation with this thing and I made an effort to close my mind to it.\n The shadow thing moved. It drifted like a puff of smoke in a mild breeze, stopping near a bulky apparatus that emerged from the ceiling and dangled to the floor, probably an instrument for measuring how much fuel was left. The fumes were burning my eyes and nose and lungs. It was making me light-headed. The black thing drifted to the apparatus, swirled a black appendage over and around a conduit, a jointed line that probably housed an electrical wire. The black thing caressed the line, almost sensually. Sparks flew from the conduit.\n I screamed.\n I TURNED TO Arnie and said, “There was light and heat and noise. A sound like a junkyard falling down a mountain.”\n I concentrated, tried to bring back the memory. That very real feeling of my flesh burning to vapor in a millisecond, my bones cooking to black charcoal. But I couldn’t, not really. The memory was hazy and unreal, like the memories of the hamster we owned when I was five, the one that escaped and then got eaten by a snapping turtle. I can’t picture it, but I know it was there. And that it wasn’t very fast. \n","sourceLink":"https://allnovel.net/john-dies-at-the-end-john-dies-at-the-end-1/page-77.html","bookId":2487,"book":{"id":2487,"title":"John Dies at the End (John Dies at the End #1)","description":"Storyline: \n John Dies at the End (John Dies at the End #1) \n STOP. You should not have touched this flyer with your bare hands. NO, don\u0027t put it down. It\u0027s too late. They\u0027re watching you. My name is David Wong. My best friend is John. Those names are fake. You might want to change yours. You may not want to know about the things you\u0027ll read on these pages, about the sauce, about Korrok, about the invasion, and the future. But it\u0027s too late. You touched the book. You\u0027re in the game. You\u0027re under the eye. The only defense is knowledge. You need to read this book, to the end. Even the part with the bratwurst. Why? You just have to trust me. \n The important thing is this: The drug is called Soy Sauce and it gives users a window into another dimension. John and I never had the chance to say no. You still do. I\u0027m sorry to have involved you in this, I really am. But as you read about these terrible events and the very dark epoch the world is about to enter as a result, it is crucial you keep one thing in mind: None of this was my fault.\n \n","cover":"https://allnovel.net/images/john-dies-at-the-end-john-dies-at-the-end-1.jpg","author":"David Wong","type":"Humorous","source":"allnovel","link":"https://allnovel.net/john-dies-at-the-end-john-dies-at-the-end-1.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:35:08 PM"}}
