{"id":98540,"no":21,"title":"Page 21","content":"Shit. She had a point. I let her drag me toward a group of girls that were dancing, which was conveniently close to the ping pong table. Brit held onto my hand as she shimmied around me, singing along to the song. It took a couple of moments to work up the nerve to do another thing I hadn’t done in years and I sort of wished I’d finished off the beer.\\n\\n Closing my eyes, I let myself feel the music and catch the beat. Once that happened, my hips were swaying and I was smiling. Eyes open now, I still held onto Brit’s hand as we danced together. The group around us grew larger and over Brit’s shoulder, I saw Cam.\\n\\n He wasn’t paying attention to Steph.\\n\\n He was watching us—watching me.\\n\\n Brit was a freaking genius.\\n\\n She looked behind her and then turned back to me, biting her lip. “Fuck ‘em.”\\n\\n I tipped my head back and laughed. “Fuck ‘em.”\\n\\n “That’s my girl.”\\n\\n Jimmie joined us, coming up behind Brit, dropping his hands on her waist. I raised my brows, and she shrugged, which was code for holding off on the punching in the vagina. My hair was damp along my temples and my sweater had ridden up. The three of us were joined by Jacob, who pretty much flailed around. I was so caught up in laughing at him that when hands landed on my hips, I jumped a good five inches off the floor.\\n\\n Brit’s eyes widened.\\n\\n I looked over my shoulder and saw a relatively unfamiliar face. The guy’s cheeks were red, eyes slightly glazed over as he ground his hips.\\n\\n “Hey,” he slurred, smiling.\\n\\n “Hi.” I turned back around, making a face at Brit as I stepped forward. I made it about an inch before Drunk Guy’s grip tightened.\\n\\n “Where you going?” he said. “We’re dancing.”\\n\\n I twisted to the side, and the guy followed, staying at my back. My stomach dropped and a strange, shivery sensation crawled up the back of my neck, raising the tiny hairs there. Thrown back several years, I froze for a second. Brit, Jacob, the party—everything—disappeared. I felt him pull me back against him, his hands on the bare skin of my stomach. Without any warning, reality seemed to shift.\\n\\n I wasn’t here.\\n\\n I was back there, with his hands under my skirt, and I couldn’t breathe or see; the fabric of the couch rough against my cheek.\\n\\n “Baby,” the guy crooned in my ear. “Dance with me.”\\n\\n “Baby,” Blaine had said, his breath heavy in my ear. “You can’t tell me you don’t want this.”\\n\\n The garage shifted to a basement and back again. I tried to pull away, my heart beating so fast I was going to be sick. “Let me go.”\\n\\n “Come on, it’s just a dance.” His hand was on my stomach, under my sweater. “You—”\\n\\n “Let me go.” My breath caught in my throat as I struggled. “Let me go!”\\n\\n There was a surprised shout and a squeal. Suddenly I was torn out of the drunk guy’s grip. I stumbled back, bumping into someone. Heart racing, I pushed my hair out of my face and lifted my head.\\n\\n Oh my God.\\n\\n Cam had the guy against the wall.\\n\\n Chapter 14\\n\\n A small crowd had already circled Cam and the guy. Some watching on in interest, others jeering on the fight.\\n\\n Cam had pinned the guy with one hand shoved into his chest. He was right up in his face, his free hand curled into a fist at his side. “What the fuck, man? Do you have a fucking hearing problem?”\\n\\n “I’m sorry,” the guy blubbered, hands raised at his sides. “We were just dancing. Didn’t mean any shit by it.”\\n\\n “Cam.” My voice came out strangled, hoarse as I started forward.\\n\\n Brit was beside me, capturing my arm. “Do not get involved, Avery.”\\n\\n How could I not get involved? My stomach roiled and what little beer I had consumed rose in my throat.\\n\\n Cam shoved the guy back into the wall again and then Jase was suddenly there, getting an arm around Cam’s waist, pulling him back. The guy slumped against the wall, eyes closed.\\n\\n “You need to chill the fuck out,” Jase said.\\n\\n Cam sidestepped his friend, eyes narrowed on the other guy. “Let me the fuck go, Jase.”\\n\\n “Fuck no.” Jase got in-between them, putting his hands on Cam’s chest. “You don’t need this, remember? Getting into a fight is the last thing you fucking need right now. So back down.”\\n\\n Something in what Jase had said seemed to reach Cam. He cast the guy against the wall one last promising look and then shrugged off Jase’s hands. Cam turned, thrusting his hand through his hair. Through the people standing between us, his gaze landed on me and Brit. He started forward, but Jase said something that made him stop. Out of nowhere, Ollie appeared, shoving a bottle of beer in Cam’s hands. Between the two of them, they ushered him back into the house. I started after them, but Brit hauled me into a corner, her wings bouncing as she turned to me. “What the hell happened?”\\n\\n “I don’t know.” My chest rose and fell sharply. “The guy wouldn’t let me go and Cam just came out of nowhere. I need to—”\\n\\n “No.” She stopped me, blocking my path. “You need to let him cool down. He’s with his boys, let him be.”\\n\\n Smoothing my hands over my hips, I was slow to process what Brit was saying. There was a good chance I was going to hurl. I looked around, willing my heart to slow down. Some people were staring at us. Others had lost interest the moment it was obvious there wouldn’t be a fight. Steph was at the ping pong table, lips thinning as our gazes collided. Music picked back up, thumping in tune with my heart. Sweat dotted my brow.\\n\\n “Hey, Avery, you okay?” Brit asked.\\n\\n I forced a nod, but I wasn’t okay. The garage was shifting again—all the costumes and the sounds amplified. Pressure clamped down on my chest. The smell of beer, perfume, and sweat clouded the air. I took a breath, but it didn’t seem like enough.\\n\\n “I need fresh air,” I told Brit, pulling free.\\n\\n “I’ll go with you.”\\n\\n “No. No, I’m fine. Stay here.” I didn’t want to ruin her night. “I’m okay. Really. I just need some fresh air.”\\n\\n Brit relented with a little more coaxing, and I hurried out of the garage, feeling like a hundred eyes were on my back even though I knew probably no one was looking.\\n\\n Cool air lifted the damp hair off my neck, but I didn’t really feel it. I didn’t stop. I kept walking, my hands opening and closing at my sides. I was by my car before I realized it. Digging my keys out of my pocket, I got in behind the wheel.\\n\\n Hands shaking, I pressed them against my face. Oh God, I could still feel his hands—not the drunk guy’s but Blaine’s. I could hear him whispering in my ear, feel him behind me and the pressure…. Throwing my head back against the headrest, I squeezed my eyes shut. “No. I’m not doing this.”\\n\\n The words seemed to echo in the car and were thrown back in my face, because I was doing this. I was doing exactly what I shouldn’t do.\\n\\n I couldn’t go back in there, not for my friends or for my hoodie.\\n\\n Shoving the keys into the ignition, I eased my car out from between two cars. I don’t even know how I got home. I didn’t remember anything from the ride, just that I was standing in the middle of my apartment, trying to catch my breath.\\n\\n I made it to the hallway before I slid down the wall, bringing my knees against my chest. I curled up, thrusting my hands into my hair. I squeezed my eyes shut, but the tears snuck free, spilling down my cheeks.\\n\\n There was no doubt in my mind that I had screwed up—I’d overreacted. The guy at the party had been obnoxiously grabby, but I had overreacted. I’d let the past distort what had been really happening. I’d panicked and Cam almost got into a fight over it.\\n\\n I pressed my forehead against my knees, pulling my hair back. I couldn’t do it. I’d tried and I had turned a good time into an epic fail. What was wrong with me?\\n\\n There were several valid answers to that—a lot was wrong. Not breaking news there but this… I had wanted so badly for tonight to be good, for tonight to be that extra push in the right direction, whatever direction that was. A sob rose and I clamped my jaw shut until my molars ached. Instead, I was here, back to where I started.\\n\\n The throbbing in my head had increased until it felt like the entire apartment was pounding right along with it. Wincing, I opened my eyes and realized I was where I’d sat down, in the hall and my entire body ached. I’d fallen asleep, maybe for an hour or two.\\n\\n And the thumping wasn’t just in my head—it was on my door.\\n\\n I pushed off the floor, hurrying to the door in a haze. I was so out of it I didn’t even check to see who it was.\\n\\n Cam barreled through the door and I was against his chest before I processed what was happening. Strong arms swept around me and his hand came up, cradling the back of my head. I inhaled deeply, drawing in the faint scent of cologne and alcohol.\\n\\n “Jesus Christ,” he said, his hand fisting in my hair. “Why haven’t you answered your damn phone?”\\n\\n “I left my phone in the car, I think.” My voice was muffled against his chest.\\n\\n He swore again as he pulled back. His hands went to my cheeks, holding me in place in a way that didn’t trigger dark memories. “I’ve been blowing up your phone—so have Jacob and Brittany.”\\n\\n “I’m sorry.” I blinked slowly. “I didn’t—”\\n\\n “You’ve been crying.” His eyes narrowed until only a thin strip of blue showed in both. “You’ve been fucking crying.”\\n\\n “No, I haven’t.” The lie sounded lame.\\n\\n “Have you looked in the mirror?” he demanded. When I shook my head, he dropped his hands and closed the door behind him. He then took my hand. A muscle ticked along his jaw and when he spoke his voice was hard. “Come on.”\\n\\n I let him pull me into the hallway bathroom. When he flipped on the overhead light, I winced and then I saw myself in the mirror. “Oh God…”\\n\\n My eyes were puffy and red, but it was the streaks of black mascara that truly cemented the fact that my first attempt at attending a party in five years had not ended well. My gaze met Cam’s in the mirror and embarrassment swamped me. I dropped my head in my hands and muttered, “Perfect—just perfect.”\\n\\n “It’s not that bad, sweetheart.” His voice softened as his hands settled on my upper arms. He gently pulled my hands. “Sit down.”\\n\\n I sat on the closed toilet seat. Staring at my fingers, I forced my sluggish brain to catch up. “What are you doing here?”\\n\\n “What am I doing here?” He ran a washcloth under the tap and knelt down in front of me. “Is that a serious question?”\\n\\n “Guess not.”\\n\\n “Look at me.” When I didn’t, he repeated it. “Dammit, Avery, look at me.”\\n\\n Whoa. Anger rose like smoke through me. My chin lifted. “Happy?”\\n\\n The muscle was back, ticking away. “Why would I come here? You left a party without saying a word to anyone.”\\n\\n “I told—”\\n\\n “You told Brittany you were getting some fresh air. That was three hours ago, Avery. They thought you were with me, but when they saw me later they knew you weren’t. After what happened with that asshole, you scared them.” \\n\\n","sourceLink":"https://allnovel.net/wait-for-you-wait-for-you-1/page-21.html","bookId":2001,"book":{"id":2001,"title":"Wait for You (Wait for You #1)","description":"Storyline: Wait for You (Wait for You #1) \\n by J. Lynn, Jennifer L. Armentrout \\n Some things are worth waiting for… \\n Traveling thousands of miles from home to enter college is the only way nineteen-year-old Avery Morgansten can escape what happened at the Halloween party five years ago—an event that forever changed her life. All she needs to do is make it to her classes on time, make sure the bracelet on her left wrist stays in place, not draw any attention to herself, and maybe—please God—make a few friends, because surely that would be a nice change of pace. The one thing she didn’t need and never planned on was capturing the attention of the one guy who could shatter the precarious future she’s building for herself. \\n Some things are worth experiencing… \\n Cameron Hamilton is six feet and three inches of swoon-worthy hotness, complete with a pair of striking blue eyes and a remarkable ability to make her want things she believed were irrevocably stolen from her. She knows she needs to stay away from him, but Cam is freaking everywhere, with his charm, his witty banter, and that damn dimple that’s just so… so lickable. Getting involved with him is dangerous, but when ignoring the simmering tension that sparks whenever they are around each other becomes impossible, he brings out a side of her she never knew existed. \\n Some things should never be kept quiet… \\n But when Avery starts receiving threatening emails and phone calls forcing her to face a past she wants silenced, she’s has no other choice but to acknowledge that someone is refusing to allow her to let go of that night when everything changed. When the devastating truth comes out, will she resurface this time with one less scar? And can Cam be there to help her or will he be dragged down with her? \\n And some things are worth fighting for…\\n","cover":"https://allnovel.net/images/wait-for-you-wait-for-you-1.jpg","author":"Jennifer L. Armentrout","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/wait-for-you-wait-for-you-1.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 6:33:32 PM"}}
