{"id":13383,"no":43,"title":"THE EGYPTIAN NIGHTS CHAPTER I.","content":"Charsky was one of the native-born inhabitants of St. Petersburg. He was not yet thirty years of age; he was not married; the service did not oppress him too heavily. His late uncle, having been a vice-governor in the good old times, had left him a respectable estate. His life was a very agreeable one, but he had the misfortune to write and print verses. In the journals he was called \"poet,\" and in the ante-rooms \"author.\" In spite of the great privileges which verse-makers enjoy (we must confess that, except the right of using the accusative instead of the genitive, and other so-called poetical licenses of a similar kind, we fail to see what are the particular privileges of Russian poets), in spite of their every possible privilege, these persons are compelled to endure a great deal of unpleasantness. The bitterest misfortune of all, the most intolerable for the poet, is the appellation with which he is branded, and which will always cling to him. The public look upon him as their own property; in their opinion, he was created for their especial benefit and pleasure. Should he return from the country, the first person who meets him accosts him with: \"Haven\u0027t you brought anything new for us?\" Should the derangement of his affairs, or the illness of some being dear to him, cause him to become lost in thoughtful reflection, immediately a trite smile accompanies the trite exclamation: \"No doubt he is composing something!\" Should he happen to fall in love, his beauty purchases an album at the English warehouse, and expects an elegy. Should he call upon a man whom he hardly knows, to talk about serious matters of business, the latter quickly calls his son and compels him to read some of the verses of so-and-so, and the lad regales the poet with some of his lame productions. And these are but the flowers of, the calling; what then must be the fruits! Charsky acknowledged that the compliments, the questions, the albums, and the little boys bored him to such an extent, that he was constantly compelled to restrain himself from committing some act of rudeness. Charsky used every possible endeavour to rid himself of the intolerable appellation. He avoided the society of his literary brethren, and preferred to them the men of the world, even the most shallow-minded: but that did not help him. His conversation was of the most commonplace character, and never turned upon literature. In his dress he always observed the very latest fashion, with the timidity and superstition of a young Moscovite arriving in St. Petersburg for the first time in his life. In his study, furnished like a lady\u0027s bedroom, nothing recalled the writer; no books littered the table; the divan was not stained with ink; there was none of that disorder which denotes the presence of the Muse and the absence of broom and brush. Charsky was in despair if any of his worldly friends found him with a pen in his hand. It is difficult to believe to what trifles a man, otherwise endowed with talent and soul, can descend. At one time he pretended to be a passionate lover of horses, at another a desperate gambler, and at another a refined gourmet, although he was never able to distinguish the mountain breed from the Arab, could never remember the trump cards, and in secret preferred a baked potato to all the inventions of the French cuisine. He led a life of unbounded pleasure, was seen at all the balls, gormandized at all the diplomatic dinners, and appeared at all the soirees as inevitably as the Rezan ices. For all that, he was a poet, and his passion was invincible. When he found the \"silly fit\" (thus he called the inspiration) coming upon him, Charsky would shut himself up in his study, and write from morning till late into the night. He confessed to his genuine friends that only then did he know what real happiness was. The rest of his time he strolled about, dissembled, and was assailed at every step by the eternal question: \"Haven\u0027t you written anything new?\" One morning, Charsky felt that happy disposition of soul, when the illusions are represented in their brightest colours, when vivid, unexpected words present themselves for the incarnation of one\u0027s visions, when verses flow easily from the pen, and sonorous rhythms fly to meet harmonious thoughts. Charsky was mentally plunged into a sweet oblivion... and the world, and the trifles of the world, and his own particular whims no longer existed for him. He was writing verses. Suddenly the door of his study creaked, and the unknown head of a man appeared. Charsky gave a sudden start and frowned. \"Who is there?\" he asked with vexation, inwardly cursing his servants, who were never in the ante-room when they were wanted. The unknown entered. He was of a tall, spare figure, and appeared to be about thirty years of age. The features of his swarthy face were very expressive: his pale, lofty forehead, shaded by dark locks of hair, his black, sparkling eyes, aquiline nose, and thick beard surrounding his sunken, tawny cheeks, indicated him to be a foreigner. He was attired in a black dress-coat, already whitened at the seams, and summer trousers (although the season was well into the autumn); under his tattered black cravat, upon a yellowish shirt-front, glittered a false diamond; his shaggy hat seemed to have seen rain and bad weather. Meeting such a man in a wood, you would have taken him for a robber; in society—for a political conspirator; in an ante-room—for a charlatan, a seller of elixirs and arsenic. \"What do you want?\" Charsky asked him in French. \"Signor,\" replied the foreigner in Italian, with several profound bows: \"Lei voglia perdonar mi, si ...\" (Please pardon me, if....) Charsky did not offer him a chair, and he rose himself: the conversation was continued in Italian. \"I am a Neapolitan artist,\" said the unknown: \"circumstances compelled me to leave my native land; I have, come to Russia, trusting to my talent.\" Charsky thought that the Italian was preparing to give some violoncello concerts and was disposing of his tickets from house to house. He was just about to give him twenty-five roubles in order to get rid of him as quickly as possible, but the unknown added: \"I hope, signor, that you will give a friendly support to your confrère, and introduce me into the houses to which, you have access.\" It was impossible to offer a greater affront to Charsky\u0027s vanity. He glanced haughtily at the individual who called himself his confrère. \"Allow me to ask, what are you, and for whom do you take me?\" he said, with difficulty restraining his indignation. The Neapolitan observed his vexation. \"Signor,\" he replied, stammering: \"Ho creduto ... ho sentito ... la vostra Eccelenza ... mi ferdonera...\" (I believed ... I felt ... Your Excellency ... will pardon me....) \"What do you want?\" repeated Charsky drily. \"I have heard a great deal of your wonderful talent; I am sure that the gentlemen of this place esteem it an honour to extend every possible protection to such an excellent poet,\" replied the Italian: \"and that is why I have ventured to present myself to you....\" \"You are mistaken, signor,\" interrupted Charsky. \"The calling of poet does not exist among us. Our poets do not solicit the protection of gentlemen; our poets are gentlemen themselves, and if our Maecenases (devil take them!) do not know that, so much the worse for them. Among us there are no ragged abbés, whom a musician would take out of the streets to compose a libretto. Among us, poets do not go on foot from house to house, begging for help. Moreover, they must have been joking, when they told you that I was a great poet. It is true that I once wrote some wretched epigrams, but thank God, I haven\u0027t anything in common with messieurs les poètes, and do not wish to have.\" The poor Italian became confused. He looked around him. The pictures, marble statues, bronzes, and the costly baubles on Gothic what-nots, struck him. He understood that between the haughty dandy, standing before him in a tufted brocaded cap, gold-embroidered nankeen dressing-gown and Turkish sash,—and himself, a poor wandering artist, in tattered cravat and shabby dress-coat—there was nothing in common. He stammered out some unintelligible excuses, bowed, and wished to retire. His pitiable appearance touched Charsky, who, in spite of the defects in his character, had a good and noble heart. He felt ashamed of his irritated vanity. \"Where are you going?\" he said to the Italian. \"Wait ... I was compelled to decline an unmerited title and confess to you that I was not a poet. Now let us speak about your business. I am ready to serve you, if it be in my power to do so. Are you a musician?\" \"No, Eccelenza,\" replied the Italian; \"I am a poor improvisatore.\" \"An improvisatore!\" cried Charsky, feeling all the cruelty of his reception. \"Why didn\u0027t you say sooner that you were an improvisatore?\" And Charsky grasped his hand with a feeling of sincere regret. His friendly manner encouraged the Italian. He spoke na?vely of his plans. His exterior was not deceptive. He was in need of money, and he hoped somehow in Russia to improve his domestic circumstances. Charsky listened to him with attention. \"I hope,\" said he to the poor artist, \"that you will have success; society here has never heard an improvisatore. Curiosity will be awakened. It is true that the Italian language is not in use among us; you will not be understood, but that will be no great misfortune; the chief thing is that you should be in the fashion.\" \"But if nobody among you understands Italian,\" said the improvisatore, becoming thoughtful, \"who will come to hear me?\" \"Have no fear about that—they will come: some out of curiosity, others to pass away the evening somehow or other, others to show that they understand Italian. I repeat, it is only necessary that you should be in the fashion, and you will be in the fashion—I give you my hand upon it.\" Charsky dismissed the improvisatore very cordially, after having taken his address, and the same evening he set to work to do what he could for him. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3029/83781.html","bookId":1065,"book":{"id":1065,"title":"The Prose Tales of Alexander Pushkin","description":"简介： My father, Andrei Petrovitch Grineff, after having served in his youth under Count Mnich,[1] quitted the service, in the year 17, with the rank of senior major. He settled down upon his estate in the district of Simbirsk, where he married Avdotia Vas...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3029","creation":"Aug 1, 2019 12:24:16 AM","modification":"Aug 1, 2019 12:24:16 AM"}}
