{"id":101972,"no":43,"title":"Page 43","content":"I’d been stupid in thinking I could somehow bargain my life back, but I didn’t regret what led me here. I’d rather fail than to have sat back and done nothing to bring Mel’s murderers to justice, even as fruitless as it turned out to be. The Luxen behind me pulled me back against his chest, and as my gaze darted around the room I saw there were more waiting in the shadows. Dozens of Luxen. I tried to take a breath, but it got stuck. The calm acceptance I felt earlier had abandoned me. My eyes locked with the senator’s and I knew—oh God—I knew this wasn’t going to be quick. Fear emptied into me like an icy downpour. The senator’s slow smile chilled me to the marrow. My muscles tensed painfully and then my brain clicked off. I twisted to the side, desperately trying to break the Luxen’s hold. I felt his grip slip and I tore free. A Luxen appeared in front of me, out of thin air it seemed. “Hi.” I whirled around, crying out. Another stood behind me, his eyes orbits of white light. Darting to the side, my feet left the ground as an arm went around my waist. Someone laughed, and then I hit the floor so fast and so hard that I slid on my side several feet. My body burned from the impact, and for a moment I was stunned into immobility. Air rushed around me and I was shoved onto my back. My head cracked on the floor. Starbursts exploded behind my eyes. The Luxen was on top of me, a knee on either side of my hips and his hand wrapped around my throat, each finger pressing in my skin with the slightest pressure. Over his shoulder, Senator Vanderson stood there. “Who else knows about this letter or its contents, Miss Cross?” Besides Hunter’s suspicions, there was no one else that I knew of, but obviously the senator feared I’d told more. The senator dragged in a deep breath. “I’m getting very tired of this game, Miss Cross.” I forced my throat to work around the punishing grip. “Go…go fuck yourself.” Senator Vanderson’s eyes went from blue to white in a heartbeat. “That was really not a polite thing to say. And for that, I’m going to make sure you—” He cut himself off and his head tipped up toward the ceiling. “You have got to be kidding me.” The Luxen above me had stilled, his head cocked to the side. His nostrils flared as if he scented something in the air. All around us, I heard the sharp intake of breaths and the flicker of bright, white light. I didn’t feel anything, but I knew. In my very soul, I knew who was here. Forcing my gaze up, I met the senator’s brilliant stare. I smiled even though it made my lips ache. “Told you.” Chapter 30 Less than half a football field away from one of the senator’s storage warehouses, the dull, translucent bodies of the Luxen guarding the building lay dead at my feet. It was like crushing fireflies between my fingers, without all the glowy mess. But Mr. Talkative wasn’t among them. He brought me here. So I did let him go and he ran like he knew he should’ve. Raw energy undulated through my veins, buzzing like a hit off the purest drug out there. Feeding from so many Luxen was dangerous to anyone who would cross my path. The power hummed under my skin, splintered my cells. Luxen were like galactic Pringles in a fucked-up way. Once you popped one, you just couldn’t stop —like stop at all. No one would be safe around me when I was through. Not even Serena. But she was in there and they were doing God knows what to her. She was still alive—she had to be. I couldn’t allow myself to consider any other outcome. I moved across the empty parking lot, sensing a cluster of Luxen on the first floor and the roof. Stopping along the side of the building, I focused on the roof. Becoming a part of the dark shadows, I rose up to the ledge and crouched. Three Luxen stood in the center. Their heads whipped toward me like prairie dogs. “Arum,” one of them called. Clever. I slipped down from the ledge, feeling the borrowed energy reverberate through my form as I spread out. The night around us turned darker. I didn’t give them a chance to fight or run. I was on them in a second, slipping behind the first and slamming my hand through the Luxen’s chest. My other arm extended and I speared the second. I spun, tossing the first on the third. They went down like a pile of bricks. I drained the second until he was nothing more than an alien prune. Tasty. The other two were getting up, both turning into walking light bulbs. My laugh carried like smoke. YOU SSSHOULD’VE SSSTAYED down. Focusing on the two Luxen, I drew them in like I was taking a big old breath of air. They skidded over the roof, their glowing arms flailing like beacons. There was nothing to hold on to, nothing to stop them. Within a second, I slammed my hands through both of their chests. It was over like red rover. Leaving their bodies on the roof, I went to the door of the emergency exit. The steel door nearly came off its hinges as I tore it open. I flew down the stairwell, silent as I drew the shadows into me. They waited on the bottom floor, at least a dozen of the fucking glowworms from outer space. I searched out Serena, not seeing her but knowing she was in the middle of them. I could feel her. I also smelled blood— human blood. Serena’s blood. Rage rose like a savage, black wave. It rolled across the warehouse floor, becoming a living, breathing entity clawing at release. I took my human form as the air turned stagnant. “For daring to even touch a single hair on her head, you all will die.” One of the Luxen rushed me and I caught the SOB around the neck. He went Lite-Brite on me, but I twisted my wrist, snapping his neck cleanly and I kept twisting, until bone erupted through the skin. Another one grew balls and shot forward and I spun to the side as I kicked out, aiming my big-ass boot into his glowing stomach. He doubled over as static crackled in the air. Dipping around, I shoved my hand through the light. The Luxen flickered into human form for only a second, but it was long enough. My hand was inside him and I wrapped my fingers around the slender length of bone. I yanked my arm back and the Luxen howled. He fell into a boneless mess on the floor. I tossed the spine aside and whirled around, slamming my fist into the jaw of another Luxen. His head snapped back and on the return, I grasped the sides of his face, and slammed my head into his, and then I twisted. The darkness inside of me howled at the sound of cracking bone. Light pulsed around the nearest Luxen a second before a bolt shot across the distance, slamming into my shoulder. It knocked me back a step, but not down. I laughed. “I kind of liked how that felt.” The Luxen reared back, releasing another blast of supercharged power. I dodged the blow this time, then shot forward, mowing him down before he knew what was coming. As I straightened, I caught sight of Serena’s terrified face. A Luxen had ahold of her. A fucker in a suit was beside her, who I assumed was the senator. My focus went right back to Serena. There were bruises on her face and her lip was bloodied. The Luxen holding her jerked her back roughly and her answering whimper sliced through me like nothing else could. I lost control of my human form. My mass grew with the absorbed power of so many feedings. The walls of the warehouse rattled like tin cups. A lone chair in the corner skidded across the floor. Storage cabinets shook and then toppled over, sliding across the floor. The chair reached the dark tendrils surrounding me first and then the cabinets. Each item spun into the air, whirling around me in a vicious cyclone of debris and dirt. THISSS ISSS GOING TO BE painful, I promised. The items stopped, suspended for a flicker of a moment, and then they collapsed into themselves like a giant hand crumbling paper. There was nothing left of the cabinets or the chair. Not even dust. I drew the power in again, focusing on four of the Luxen standing between Serena and me. Fighting this way would expel energy more quickly, even with the opal cuff, but I was beyond pissed, beyond controlling myself. I wanted them all dead in a painful way. The Luxen flew toward me, flipping back and forth between their true forms and their human facades. Someone yelled, but it was lost in the vacuum. The moment they touched the darkness surrounding me, their screams became a chorus. The pressure clamped down on them as they were caught in the shadows. They were gone, too, and like the chair and cabinets, nothing remained when the air settled. It wasn’t that I was necessarily stronger than them. Luxen were formidable opponents. I was fighting differently than I ever had before. It wasn’t about the age-old battle of Arum versus Luxen. I wasn’t fighting to feed or to work off aggression. I wasn’t fighting because I was told or was obligated. I was fighting for Serena. She meant everything to me. Knowing that, fully understanding what that meant, I was on a motherfucking warpath. The remaining Luxen rushed me, and blasts of the Source lit up the room, cutting through the shadows pooling in from outside through the cracks in the wall. I took a hit but barely felt it. I fed again and rose up. A Luxen followed. We twisted along the ceiling. Light. Darkness. Light. Darkness. Darkness won. The Luxen’s lifeless body dropped to the floor with a heavy thud. I mowed through each one that came after that. I could feel the energy seeping out of me and shit was going to hurt like a bitch, but I grabbed the nearest Luxen and speared him through the chest. I brought the dying Luxen to the floor, preparing to finish the glowbug off. Serena’s sudden shrill scream stopped me when nothing else in this world could. I rose up, immediately finding her in the chaos. Only one Luxen remained—the senator, and the bastard had his hand around her fragile neck. I took my human form, breathing raggedly. My body ached, but I ignored the pain. “If you have an ounce of intelligence, you’ll let her go now.” “Or what?” the senator said, backing away, dragging Serena along with him. “You come after me, she dies.” The air darkened and charged around me. I focused on the senator’s glowing eyes, because if I looked at Serena right now, I’d lose my shit. “You’re not going to get out of here, especially if you hurt her.” Senator Vanderson’s lips quirked up at the edges. “Is that so? I’m sure I’m the one in the position of power right now.” “I’ve killed all your Luxen and I’ll kill more if they come.” I took a step forward, but stopped when Serena whimpered. My hands curled into fists. “That may be true, but I have this feeling you’d do anything to make sure she walks out of this situation.” His grip tightened, and she gasped. “Isn’t that right?” My gaze flickered to Serena’s. I didn’t hesitate. “I would.” “Good,” he replied, taking another step back. Over his shoulder was the exit. “Get on your knees, Arum. Where you belong.”","sourceLink":"https://allnovel.net/obsession/page-43.html","bookId":1666,"book":{"id":1666,"title":"Obsession","description":"Storyline: This is a stand alone novel that is an adult spin-off of the Lux Series You do not need to read a Lux book to read Obsession and vice versa. He’s arrogant, domineering, and... To. Die. For. Hunter is a ruthless killer. And the Department of Defense has him firmly in their grasp, which usually doesn’t chafe too badly because he gets to kill bad guys. Most of the time he enjoys his job. That is, until he’s saddled with something he’s never had to do before: protect a human from his mortal enemy. Serena Cross didn’t believe her best friend when she claimed to have seen the son of a powerful senator turn into something... unnatural. Who would? But then she witnesses her friend’s murder at the hands of what can only be an alien, thrusting her into a world that will kill to protect their secret. Hunter stirs Serena’s temper and her lust despite their differences. Soon he’s doing the unthinkable—breaking the rules he’s lived by, going against the government to keep Serena safe. But are the aliens and the government the biggest threats to Serena’s life… or is it Hunter?","cover":"https://allnovel.net/images/obsession.jpg","author":"Jennifer L. Armentrout","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/obsession.html","creation":"Oct 5, 2019 8:57:50 AM","modification":"Oct 5, 2019 10:08:49 PM"}}
