{"id":101940,"no":9,"title":"Page 9","content":"My face scrunched up. “You’re like an incubus or something.” “Well, how do you think myths get started? And stop staring at me like I’ve damaged you. I didn’t take enough to kill you. You’ve only been asleep for two days. Eat some chocolate and you’ll be back where you were.” I wasn’t sure I’d heard him right. Two days? That meant today was Saturday. I’d lost two whole days. “You knocked me out for two days? That can’t be healthy.” His brows lowered. “You could be dead.” Good God, I wanted to hit him. “You fed off me, dude. I can’t even categorize how messed up that is. That’s not okay.” “I’ll tell you what’s not okay, is you throwing shit at me.” Curiosity marked his expression. “Why did you throw something at me?” When I didn’t answer, a muscle popped in his jaw. “You’re not going to answer me? Or do I need to repeat myself for a third time? It’s okay. I like to hear myself talk.” In a second, anger and irritation roared through me. Something about his cocky tone pissed me off. So did my body’s reaction to him. Parts of me were all kinds of tingly, especially when I wiggled again and felt him twitch. “Get off me.” I tried to push him off, but that didn’t work. “Get off me now!” “Or what?” He tilted his head down so that his mouth was inches from mine. “You going to pick up a picture frame next and wing it at my head?” “Maybe,” I snapped back. “Then I can’t let you up.” I stared at him in disbelief and sputtered, “You can’t— Get off!” One single brow arched up. “I can’t get off? Oh, I most definitely can get off.” The flush increased until I felt like I was under the sweltering sun. Muscles in my stomach tightened. “That’s not what I meant and you know it.” “Hmm, so you say…so you say.” He was— Oh my God, I was struck speechless. A long minute passed as he stared down at me, and then he released my wrists, finger by finger. Then in one fluid, unbelievably quick motion, he rolled off and stood. Jesus, the guy was part alien, part human, and part ninja. I sat up and almost toppled off the side of the bed. Peering through the mass of tangled hair, I got my first real good look at Hunter. I’d been caught off guard in the parking garage and too frightened in my apartment to really get a good look at him, and since he had all that very human flesh on display, I drank him in. Holy hotness… Jeans hung low on narrow hips. Hunter’s stomach was perfection— each taut muscle tight and totally lickable. Not that I’d ever licked a man’s stomach before, but now I got why someone would want to. I was in six-pack heaven. He even had those dips beside the hip- bones… Oh God, I felt dizzy. His chest was defined and cut like marble. I got hung up on staring at that for a few moments before I literally had to force myself to look at his face. Checking him out couldn’t be right. What was wrong with me? “Look, I’m sorry about the whole throwing things at you and everything else—” “You don’t look very apologetic.” I frowned. “Well, I am. Things are kind of… messed up. And you knocked me out. And you’re half naked—” “Have you looked in the mirror?” he cut in. “You’re just as naked as I am. And I didn’t throw anything at your head.” Glancing down at myself, I cringed. Somehow I’d forgotten that I was in my shirt and undies. Flushing all over again, I wanted to dart behind something, but I folded my arms. “I didn’t throw anything at your head. I was—” “Do you always overreact like this?” Oh my God, if he interrupted me one more time I was going to throw something at his head. “I woke up in a strange place, kidnapped by an alien. I can’t even believe I’m explaining why I overreacted. What were you doing in my room anyway?” He mimicked my stance. “Correction: this is my house and therefore this is my room. Not that I need to explain myself, but I was checking to make sure everything was secure outside.” “But you did kidnap me.” “I did not.” I threw up my hands. “What’s all this? Where am I?” “West Virginia.” My mouth dropped open. Oh my God, this couldn’t be happening. “I’m in a different time zone? Are you fuc—” Hunter threw up his hand, silencing me. The tip of my tongue literally burned to lay into him. “What the hell is that noise?” Before I could respond, he stalked past the bed and entered the bathroom. “Jesus! What are you trying to do in here?” His voice carried from the bathroom. “Giving the floor a bath?” he demanded. I searched desperately for my jeans, but came up empty. Hunter returned, hands on his hips. Too late. “Seriously?” “I forgot I turned the faucet on. Geez, you’re grumpy.” “And you’re already turning out to be a huge pain in my thigh.” “Look, I’m really sorry about that. Okay? I’ve been through some really traumatic events here recently and, yes, I might have overreacted.” I struggled with my patience. “And I really would like to know where my pants are.” “Your pants were folded on the corner of the bed. You probably knocked them on the floor.” What? I wanted to check, but I so wasn’t bending down in my panties in front of him. “And how did they get off me and folded on the bed?” “I did it. Thought you’d be more comfortable.” Oh geez, I had no idea what to think about that. A thank-you so wasn’t in order though. He undressed me while I was unconscious, for crying out loud. My entire body felt red-hot. “I’m not going to say thank you for that.” “Not like I’d expect that common courtesy from you,” he replied, his pale eyes dancing…with what? Anger? Amusement? “After all, you never thanked me for saving your ass—a pretty ass at that. So I can add inconsiderate to your growing list of attributes. Put that right next to: overreacts, acts first and then thinks, drama—” “Oh, go fu—” “You do not want to finish that sentence,” Hunter warned, his voice low enough to send warning shivers down my spine. “The one thing I don’t do is fuck myself.” I doubted he needed to. Then again, he probably opened his mouth and ruined everything. “All right, this is not what I intended. I just need to know what’s going on and get my pants—” “How about you do this,” he said, stalking up to me. I took a step back, hitting the bed. His gaze dropped from my face to my chest, his stare so intense it felt like he was touching me. “Why don’t you put some more clothes on? You’re a little distracting right now.” I gaped at him in disbelief. What the hell had I been trying to do? A quick grin flashed across his face. Not necessarily warm, but there was definitely something to it. Was he messing with me? “When you’re done, you can join me downstairs,” he continued, strolling past me. “We have a few things we need to go over.” I spun around, hands curling into useless fists. “Why don’t you put some clothes on?” Stopping at the door, he glanced over his shoulder. “Do I distract you?” Clamping my mouth shut, I glared daggers at him. He was distracting, but a zombie could eat my brains before I’d admit that. Hunter smirked. “Downstairs. Five minutes.” “You—” He slammed the door shut in my face. Chapter 7 Never in my life had I been more frustrated. Go figure it wouldn’t be with a human but a freaking alien. At least I now knew that the male species were asses no matter what planet they hailed from. After digging my jeans out from underneath the bed and slipping them on, I sat on the edge of the bed and glared at the door. Be downstairs in five minutes? That insufferable, arrogant, and demanding ass was going to wait at least ten. But damn, he was insanely hot for an…alien. Groaning, I dropped my head into my hands. I didn’t feel right. The whole not knowing where I was, what was happening at home, and being so far out of what I knew was reality was driving me insane. The door suddenly swung open, causing me to jump. Hunter filled the doorway, still shirtless and eyes narrowed. “Five minutes have been up,” he said. “I don’t like to wait.” “I don’t like to be bossed around.” He tilted his head to the side. “Then we’re going to have a problem, Serena.” A part hidden deep inside responded to the sound of my name coming from his mouth, warming and turning liquid. The way it rolled off his tongue was sinful. Hunter waited. Snapping out of it, I climbed to my feet and grumbled the whole way past him. Hunter said nothing as we went downstairs. It was a few blissful moments of silence, which I used to admire what he had going on in the back. Nice ass. We entered a massive room with white, pristine sectional couches and sitting chairs. A large flat-screen TV hung from the wall. Vases decorated the end tables and took up the corners of the room. There was a faint smell of roses in the air. I was half afraid to touch anything, like I’d leave sticky fingerprints. I followed him down a hallway and into a kitchen area. Bright sunlight spilled through the floor-to-ceiling windows, giving the room a warm, welcoming feeling, while the living room was sort of sterile. Several bar stools surrounded the island and top-of-the-line appliances furnished the kitchen— stainless-steel double oven, side-by-side fridge, and a sink you could bathe in. Off to the left was a dining table and, beyond that, an entrance to a sunroom full of plants and chaise lounges. “Sit,” he said, gesturing at one of the stools. I debated on ignoring him, but decided it wouldn’t get us anywhere. Sitting, I folded my hands in my lap. “Where—” “Would you like a drink?” he interrupted, heading toward the cabinet near the fridge. My brows rose. “Yes. That would be nice. Thank you.” Hunter glanced at me. “You sound surprised.” “You don’t seem like the type who does civil things like that.” He smirked. Turning back to the cabinet, he grabbed two glasses. “I have soda, milk, water—” “Milk? I’m not ten.” He turned around, lips tipped up on one side. “And how old are you? Nineteen?” Offended, I leaned back on the stool. “I’m twenty- three, but I’ll try to take that as a compliment.”","sourceLink":"https://allnovel.net/obsession/page-9.html","bookId":1666,"book":{"id":1666,"title":"Obsession","description":"Storyline: This is a stand alone novel that is an adult spin-off of the Lux Series You do not need to read a Lux book to read Obsession and vice versa. He’s arrogant, domineering, and... To. Die. For. Hunter is a ruthless killer. And the Department of Defense has him firmly in their grasp, which usually doesn’t chafe too badly because he gets to kill bad guys. Most of the time he enjoys his job. That is, until he’s saddled with something he’s never had to do before: protect a human from his mortal enemy. Serena Cross didn’t believe her best friend when she claimed to have seen the son of a powerful senator turn into something... unnatural. Who would? But then she witnesses her friend’s murder at the hands of what can only be an alien, thrusting her into a world that will kill to protect their secret. Hunter stirs Serena’s temper and her lust despite their differences. Soon he’s doing the unthinkable—breaking the rules he’s lived by, going against the government to keep Serena safe. But are the aliens and the government the biggest threats to Serena’s life… or is it Hunter?","cover":"https://allnovel.net/images/obsession.jpg","author":"Jennifer L. Armentrout","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/obsession.html","creation":"Oct 5, 2019 8:57:50 AM","modification":"Oct 5, 2019 10:08:49 PM"}}
