{"id":92373,"no":16,"title":"Page 16","content":"\n “Your girls will need help finding their first class,” Ronan told Amanda. He stood over me. I felt his presence like a solar eclipse.\n “Oh, I’ve done this a time or two before.” There was a smile in Amanda’s tone.\n I wondered how many years she’d been there. How many years were girls stuck on this island before they graduated off? I filed my questions away for another day. I didn’t trust my voice at the moment, anyway.\n Ronan still stood there. I stared at my hands, trying to breathe normally. I was angry with him, so why did I also feel so nervous?\n “Annelise?”\n Oh, God, the way he says that. Was my reaction to him real, or was he even now using some sort of spellbinding juju? I looked up, mortified to feel my face so hot. “Yeah, hi.”\n “Time for class.” The green sweater did do crazy things to his eyes, making them look deep and vibrant and soulful. That gaze searched mine—or at least I imagined it did. Was it fraught with meaning, looking for answers? Trying to hypnotize me into doing something horrible? Or was he just impatiently waiting for the silly Acari to say something? He chuckled into the silence, and I wanted to disappear under the table. “You have looked at your class list, aye?”\n “Um, no . . .” I fumbled in my coat pocket and pulled out the envelope.\n “Most girls get four classes and a private study,” Amanda said.\n I brightened. “A private study?” My whole life, I’d longed to do a private study. My mind raced, thinking of all the possibilities. Theoretical mathematics. Deconstructionist philosophy. Or maybe it was a private tutorial having something to do with that Viking mythology book. I’d dabbled in a few Germanic languages, but would love to try Old Norse.\n I tore it open. The paper looked expensive, like yellowed parchment with unfinished edges. What, did they think I was going to save it in my scrapbook or something?\n I had to read and reread my schedule a few times for the full and truly effed-upness of it all to sink in. Phenomena class? Decorum? Combat? Freaking fitness? It was one part Baroque atelier, one part YMCA.\n But it was the last item on the list that made me want to hurl. My private study. It was swimming.\n “Swimming?” My voice cracked. The notion had taken a moment to register. It’d been the last thing I’d expected to face.\n “Aye, that’s your private study,” Ronan said in a tone that brooked no disagreement.\n Amanda stood and put on her coat. She was chuckling.\n “But I don’t swim.”\n “You do now.” He crossed his arms in front of that broad chest. “And I’m your teacher.”\n CHAPTER FOURTEEN\n “But, seriously.” I jogged to catch up to Ronan on his way Bout of the dining hall. “I can’t swim.”on his way out of the dining hall. “I can’t swim.”\n Just the thought of it was enough to freak me out. I despised it. Despised the sensation of being submerged, of water going up my nose and gurgling in my ears. It was just wrong.\n To top it all off, Ronan was my teacher. Ronan would be the one sitting front and center at my carnival of lameness, ineptitude, and irrational fears. Clearly, the fates did not believe in the personal dignity of Annelise Drew.\n Not to mention, this did nothing for my plan. How was I to excel and escape if I had to swim? I would never excel at swimming. “What happens if I can’t learn?”\n “You will.” He held the door open for me.\n I pulled on my cap and zipped up my coat, following him down the stairs, my mind racing. Surely there were Watchers out there who weren’t great in the water. We were training to be emissaries for vampires, not mermen. “But if I don’t, will I still be able to progress to the next level? I don’t care how much you try to hypnotize me—I really can’t swim.”\n “That’s why you’re in a private study. And I didn’t hypnotize you.” With a sigh, he stopped and faced me. “Now it’s time for you to get to your first class. Do you know how to get to the science building?”\n I stared at him. “I’m so not done discussing this whole swim thing.”\n He turned onto the path, ignoring my comment. “Never mind. I’m going that way. I’ll show you.”\n “But wait.” The path appeared to head away from the buildings, so I turned away from him and stepped onto the quad instead. The snow had transformed into shoals of dingy gray ice atop mucky gray gravel, and it crunched underfoot. “Isn’t it this way?”\n “Stop,” he said abruptly. “Acari aren’t allowed to stray from the path.”\n I gaped in disbelief. “You’re kidding, right? Is that supposed to be a metaphor? Some sort of Karate Kid, wax-on, wax-off thing?”\n He gave me that peeved quit-your-joking look he sometimes got.\n Shoulders slumping, I reined in the sarcasm and rejoined him. “So, you’re saying we have to take every corner around the quad, every time? Not just for naked midnight hazing runs?”\n He gave a brisk nod and strode ahead. “No shortcuts.”\n “And if an Acari breaks the rule?” Catching up to him, I saw the expression on his face and quit that line of questioning right there. “Okay, I got it. I won’t break the rules. But you’ve got to help me at least drop swim class.”\n Ronan raised his brows. “Have you learned how to swim in the past twenty-four hours?”\n “No.” Duh.\n “Do you wish to drown during your stay on the isle?”\n “Of course not. I—”\n “Then you have no choice, Drew. There is no dropping classes. There is no choice. You do as you’re told, and you survive. You will learn to swim. And, moreover, you will be the best.”\n Ronan had no idea what he was talking about. Surely I’d be able to fudge my way out of it. Because I not only couldn’t swim, I wouldn’t swim. I was terrified of choking, of drowning. Just the thought of it clenched my chest with panic.\n I had to change the subject. I fished my course list back out of my pocket and shook it at him. “And what’s with these other classes? Come on, I have to take a class in decorum?”\n The word had come out louder than I’d intended. By Ronan’s exasperated headshake, I could tell the irony wasn’t lost on him.\n “You may want to keep it down,” he muttered, looking around. I’d caught the attention of one of the Initiates, and he gave her a nod. His friendly expression struck me as forced, but it seemed to satisfy her.\n I toed a rock free from the path, kicking it a few steps ahead of me. “Decorum,” I grumbled. “I’d thought you were putting me in some sort of gifted-and-talented program, and instead you’re making me take a class in manners?”\n “I’m not making you do anything. It’s required of all Acari. The vampires find modern girls to be . . . coarse.” He shrugged. “You should be pleased I got you out of piano.”\n “Piano would’ve been cool.”\n “So you’d think.”\n “And what’s with combat? Are they sending me to war?” I tossed off a cynical laugh, but his curious stare silenced me. “Wait. They’re not sending me to war or anything, right?”\n “No wars per se.” He was trying to assure me, I think. It wasn’t working. “But you must learn to fight. Hand-to-hand sparring. Other necessary tactics.”\n “Fighting?” I felt the cold, prickly sensation of blood draining from my head. I’d been hit enough times in my life already—I’d hoped to put the whole getting-pummeled thing behind me. “You’re going to make me fight? I can’t fight.”\n “We’ll train you.”\n I pulled the black knit cap from my head and raked my fingers through my hair. “Like, fight with the other girls? I thought we were training to be attachés.”\n “You’ll be that and more. You must be ready for anything, at all times.”\n I clenched my hands, feeling a familiar dread wash over me. Needing to be ready for anything sounded a bit too much like my childhood. “But swimming? Combat? I can’t do all that stuff. And I definitely can’t fight the other girls.”\n He touched my shoulder. “You can and you will.”\n The contact was light and quick, but it was enough to halt my growing hysteria. I calmed a little, noticing I’d accidentally crumpled my schedule.\n And then my body seized. I flinched my shoulder away from him. I didn’t trust him or his supernatural touches. “Don’t touch me.”\n He actually managed to seem confused and innocent for a moment. Bravo, Ronan. Then he said, “You must learn to trust me.”\n We were approaching the group of buildings, and Ronan slowed his pace. “It’s not all academics on this isle. Combat tactics, physical prowess—those elements are integral to success. This system is built to train girls just like you. Trust me on this, if nothing else. You can do it.”\n I tugged the cap back onto my head. I thought it might be a little askew, but I didn’t particularly care at the moment. “Trust you? You’re the one who got me into this mess in the first place.”\n He stopped on the path, looking at me thoughtfully. “Annelise, the swimming aside, I think you might be surprised at how much you enjoy your studies.”\n I scowled, remembering the scene in the dining hall. I wasn’t exactly looking forward to witnessing my peers salivating over one another. “So, boys will be in the classes?” They’d struck me as a bunch of jocks, the lot of them. I wondered if they were as meat-headed as they looked.\n “Just decorum and phenomena. Male Trainees have a different physical-education program.”\n “I’ll bet.” It seemed obvious that stalking potential victims, catching them, and then drinking their blood required a completely different skill set.\n I shivered. Did the vampires in training know what was ahead of them? How did they feel about this whole messed-up scene? \n","sourceLink":"https://allnovel.net/isle-of-night-the-watchers-1/page-16.html","bookId":2291,"book":{"id":2291,"title":"Isle of Night (The Watchers #1)","description":"Storyline: \n Isle of Night (The Watchers #1) \n Is life offering fewer and fewer options? Then join the dead. \n When Annelise meets dark and seductive Ronan, he promises her a new life-if she has the courage to chance the unknown. Now, she\u0027s whisked away to a mysterious island and pitted against other female recruits to become a Watcher-girls who are partnered with vampires and assist them in their missions. To survive and become a Watcher, Annelise has to beat out every other girl, but she\u0027s determined to do so, because to fail doesn\u0027t mean dishonor-it means death.\n \n","cover":"https://allnovel.net/images/isle-of-night-the-watchers-1.jpg","author":"Veronica Wolff","type":"Mystery","source":"allnovel","link":"https://allnovel.net/isle-of-night-the-watchers-1.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 5:54:40 PM"}}
