{"id":92387,"no":30,"title":"Page 30","content":"\\n\\n “Very well, then,” Trinity said briskly. “Go wash. You smell foul. But come back here. You’ll not sleep tonight. You stand vigil with us. Waiting to see which girls come back.”\\n\\n Which girls. That meant they didn’t expect everyone to return. Dread unfurled in my belly. I tried not to think how it was all my fault that everyone was in this situation in the first place. Tried not to think how any death tonight would be on my head.\\n\\n Lilac’s group returned not long after we’d finished dressing. Her eyes found me the instant she entered the common area and they lingered there, as cold and sharp as the edge of a knife.\\n\\n She spoke for the girls as their leader, which was no surprise. What was a surprise was how they could’ve possibly made it back, and in such good time.\\n\\n “Tell,” Masha ordered.\\n\\n “I burned them.” Lilac pulled off her gloves. Black char marks smudged her fingers and the backs of her hands. Fire. Fire was how she’d kept everyone alive. Fire was Lilac’s gift.\\n\\n Them. She’d taken down more than one. I shivered. My unpredictable pyro roommate unnerved me more than any monster I might face in the dark.\\n\\n IT’D DAWNED CLEAR, AND BRIGHT bolts of sunlight sent a million shards of crystal glittering atop last night’s snow. The place looked like a winter wonderland. All the more obscene an atmosphere in which to hear the news.\\n\\n The final group had returned. All two of them. The others had been slaughtered. By a single Draug.\\n\\n The French girl with the pixie-cropped hair—I’d learned that her name was Stefinne—vomited repeatedly in a trash can in the corner. Her friend with the short bangs had been among the victims.\\n\\n I’d been responsible for her friend’s death. Me and my iPod and my mother’s picture, too. Though I knew in that moment I’d have risked it all to keep alive any connection to my mom. But that connection was lost now, forever. I wondered if they’d destroyed the photo.\\n\\n I wished I could get sick. To vomit and scream and weep. But I refused to let my face show any of it. Staring at Stefinne’s stupid hair—dyed black, the roots growing in a mousy brown—I forced the thoughts from my head.\\n\\n Her companion, a generically pretty Idaho girl, repeated the story. Meanwhile, the Initiates sank into the chairs and couches of the common area like they were settling in for movie night.\\n\\n “It came. It took us one by one. We threw stuff at it.” She was traumatized, covered in blood and scratches, speaking in a lifeless monotone. A tic in her cheek was all that told me there was a person in there somewhere. “Rocks. Tried to hit it. But it just kept grabbing girls. Like it wanted to hug them. Smell them. It pushed them down. Climbed on. Biting . . .”\\n\\n With a sharp inhale, life slid back into her eyes, lighting her face with horror. “Oh, my God!” she shrieked. She began to shake and scream, as though still fighting the monster. “Oh, God! Make it stop!”\\n\\n “Congratulations.” At the sound of Lilac’s voice, my head shot up. I saw her reflection in the window, hovering at my back like an assassin. She’d showered and somehow managed to look perfect in her gray uniform, despite the lack of sleep. “You must be so proud.”\\n\\n Amanda sprang from the couch, putting her arm around the Idaho girl’s shoulder. “It’s all right, dolly. You’re back safe. How about we get you and your mate washed up?”\\n\\n “Five down.” Guidon Trinity looked at her nails. She might’ve been discussing a football score, for all the emotion that was in her voice.\\n\\n Emma and I shared a quick look, then glanced away. Instinct told me to show no emotion, no allegiances.\\n\\n Five girls. Dead. It was my fault.\\n\\n Finally, we all dispersed. Numb, I staggered up to the room.\\n\\n Crawling into bed was such a blessed relief—I didn’t remember the last time I’d slept. I almost didn’t care who my roommate was. Von Slutling could torch me in my sleep, for all I cared.\\n\\n Her voice chimed into my consciousness, just as I began to drift off. “Watch your back, Charity. So many girls want to take you down, they’re going to have to start giving out numbers.”\\n\\n CHAPTER TWENTY-EIGHT\\n\\n The gym lights flickered to life with a loud click-click. Yasuo stood in the doorway, looking skeptically at the heavyduty fluorescent domes. “Are you sure we’re allowed to be in here?”\\n\\n “Ronan says we’re encouraged to use the gym after hours. As long as it’s before curfew and all.” I slung my bag on the floor against the wall and pulled off my coat. I shot him a challenging glare. “Don’t tell me you’re backing out now.”\\n\\n “Trainee Yasuo Ito doesn’t know the words back out.” He joined me, shucking off his black wool peacoat. “I just don’t get why you need me. Aren’t you learning how to fight in combat class?”\\n\\n “Yeah, sure. Combat rocks—or it will. They’re still mostly having us do intro stuff, like basic fencing or tai chi forms.” I climbed over the ropes into the ring. “I didn’t exactly have an épée handy when that Draug came at us. I can’t help but worry it was dumb luck that saved me.”\\n\\n Yas smiled. “Sounds like Emma was pretty cool about the whole thing.”\\n\\n I heard something in his voice. Emma was attractive in a refreshingly scrubbed, prairie sort of way. If it were the normal world, I might think about setting them up. “So you think Emma’s cool, huh?”\\n\\n “I don’t know.” He wandered around the gym floor, stopping at the hanging rope, giving it a tug, as if he might need to test it out. “I’ve never met anyone like her. Especially not in Hell-Lay, California.”\\n\\n I leaned over the edge of the ring, trying to get a good look at his face. “Are you blushing?”\\n\\n “Guys don’t blush.”\\n\\n “Uh-huh.” I shoved against the side of the ring a few times, but the ropes barely gave. There were five of them, fully padded and sturdier than they looked. “Come on, then. Unless you’re chicken. I want to see some of your good old L.A. street-fighting moves.”\\n\\n He prickled. “You think because I’m from Los Angeles and I’m Asian, I’m in some sort of gang?”\\n\\n I gave him my don’t-go-there look. “No. . . . I think because you’re a guy who claims to have killed his Yakuza father that maybe you know a thing or two.”\\n\\n Smiling, he shook his head, and like that, the tension was gone. “Yeah, I guess I’ve got some choice MMA moves.”\\n\\n “What’s MM . . . ohhh.” Understanding dawned. “Mixed martial arts? That’s, like, late-night, cable-TV, cage-fighting stuff, right?”\\n\\n “Drew, I’m shocked.” He hopped into the ring, his movements lithe as a cat’s. Clearly, he’d done this before. “MMA is a highly respected form of fighting.”\\n\\n “Forgive me if I’m not acquainted with the vernacular.” I stared as he bobbed from foot to foot, shaking out his arms. “Jeez, Yas, you are such a guy.”\\n\\n “I should hope so. Now get ready. I’m going to teach you my favorite move.” He flashed me a brilliant smile. “Ground and pound, baby.”\\n\\n I approached him warily. “Sounds like a cooking thing.”\\n\\n “Nope. It’s the thing that’s going to save your ass someday. When you’re fresh out of those ninja stars or you drop your fencing . . . foil, or whatever those wussy-ass swords are called.”\\n\\n I had to agree with him on the fencing. The moves were elegant, and I could see how repeating the same series of stances increased arm strength and built the foundation for stronger overall fighting. Only I’d seen the eyes of that Draug, and it’d wanted to eat me. All the hopping and feinting in the world wouldn’t save me if I were caught off guard.\\n\\n But Yasuo had dissed my throwing stars, and nobody dissed my throwing stars. “My weapon is known as the shuriken.”\\n\\n “Wakatta yo.” He shot me a look of exaggerated annoyance. “As in, Duh, Drew. I think I know what they’re called in Japanese.”\\n\\n “Okay, okay, sensei. So let’s ground around this thing.” I stretched my arms in front of me, cracking my knuckles, but it kind of hurt, so I shook them out with a scowl instead.\\n\\n “Ground and pound,” he said distractedly. He’d begun to circle me like a tiger about to pounce.\\n\\n It put me on my guard, and I squatted in a standard defensive posture, hands bracing the air in front of me. He was taking too long to attack, so I taunted, “What’s the problem, Yas? Afraid to hit a girl?”\\n\\n But then he pounced, and the breath whooshed from me as I hit the ground, shutting me up. I knew he wasn’t my real enemy, I knew this was a friendly grapple, but still, adrenaline dumped into my veins.\\n\\n Memories tumbled into my head. The breath whooshing from me when Daddy Dearest shoved me to the ground. The creak of my ribs when he’d grip me tight, flinging me into my room and slamming the door. I forced the images from my head. I’d survived my father and it’d made me stronger. That other girl wasn’t me anymore.\\n\\n Because now I had the tools to fight back.\\n\\n We rolled on the floor. I scrapped and scratched, managing to get on top. I suspected he’d let me.\\n\\n “Come on, Drew. Push me down.”\\n\\n I scrambled, painfully aware of how tiny I was compared to him. It would be that way with every fight for me.\\n\\n “That’s it.” He began to shout encouragements. “Push me down. Pin me. Use your elbows. Hold me down.”\\n\\n “But you’re too big.” It was frustrating, and I snarled my anger at him.\\n\\n “Get used to it. Everyone’s bigger than you. Now shut up and use your weight.” He slapped at my leg. “Use it all. Get your knee in my stom—”\\n\\n I jammed my knee onto his belly, and he grunted. “Damn, D, not so hard. But yeah . . .” He shifted, grunting again. “Now use your other hand to pound my face.”\\n\\n I went at him, and he flinched. Laughing, he yelled, “Not for real!”\\n\\n Finally, I got him down—one knee on his stomach and a fist poised over his face. “Pretty simple,” I said, feeling triumphant. \\n\\n","sourceLink":"https://allnovel.net/isle-of-night-the-watchers-1/page-30.html","bookId":2291,"book":{"id":2291,"title":"Isle of Night (The Watchers #1)","description":"Storyline: Isle of Night (The Watchers #1) \\n Is life offering fewer and fewer options? Then join the dead. \\n When Annelise meets dark and seductive Ronan, he promises her a new life-if she has the courage to chance the unknown. Now, she\u0027s whisked away to a mysterious island and pitted against other female recruits to become a Watcher-girls who are partnered with vampires and assist them in their missions. To survive and become a Watcher, Annelise has to beat out every other girl, but she\u0027s determined to do so, because to fail doesn\u0027t mean dishonor-it means death.\\n","cover":"https://allnovel.net/images/isle-of-night-the-watchers-1.jpg","author":"Veronica Wolff","type":"Mystery","source":"allnovel","link":"https://allnovel.net/isle-of-night-the-watchers-1.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 5:54:40 PM"}}
