{"id":33175,"no":2,"title":"2 The “Gossip” Runs Wild","content":"The whole trick was clear to him now. In the general orders of the day, read to the cadets on the previous day, the fact that no excuse would be accepted had been sternly emphasized. Terry was not the kind who would carry tales even if he thought they would excuse him and win him sympathy, and as he realized how badly fooled he had been his eyes flashed in anger. \\n\\n 22 \\n\\n \\n\\n “I see the whole business, now,” he reflected. “Jack Olson is a crony of Rowen’s and he carried that note supposedly signed by Rush. They know I won’t tell Rush about it, and there isn’t any use in thumping Olson, because he probably had to take his orders from Rowen. But I sure would like my hands on that surly guy!” \\n\\n \\n\\n Realizing that every moment counted the red-headed youth looked around the small room, his eyes having grown used to the darkness. He hoped that there might be some instrument that would make it possible for him to pry up a board and so make his escape, but the only thing in sight was the pile of harness. There was not even a piece of metal on the harness and although he examined every corner of the little cell he was unable to find a single object that would aid him. \\n\\n \\n\\n “Guess I’ll just have to use my hands and feet, if that will do any good,” he reflected. \\n\\n \\n\\n Dropping on his hands and knees he examined the floor carefully to see if any of the boards were loose, but all of them were securely fastened to the huge beams that made up the framework of the barn. The boards were very thick and any thought of escaping under the barn was out of the question. From there he went to the door, feeling carefully along the sides to see if any signs of weakness existed here, but once again he was disappointed. Like the rest of the barn the door and the frame had been strongly constructed and it did not even quiver under his hearty kicks. \\n\\n 23 \\n\\n \\n\\n “About the only thing I can do—if I can do it—is to kick a board off the side of the wall,” he decided. \\n\\n \\n\\n With this thought in mind he raised his foot, but then a sound reached his ears, a sound that made his blood chill. \\n\\n \\n\\n With a clarity and snap the call of assembly rang out on the morning air! \\n\\n \\n\\n “Good night!” groaned Terry, the sweat breaking out on his forehead. “There goes the call to assemble! If I’m ever going to get out of here in time, now is the moment!” \\n\\n \\n\\n With desperation Terry kicked stoutly at the wall boards, but with the first kick the bitter truth was forced upon him. The sides of the barn were as strongly composed as the rest of the building, and all the kicking in the world would not get him out of the room in which he was held prisoner. To further worry him certain sounds told him that the process of assembly was going forward rapidly. \\n\\n 24 \\n\\n \\n\\n Doors slammed, running footsteps sounded on the parade grounds, voices rang out as the assembling cadets gathered. The butt of a rifle cracked on the pavement, and the noise of stamping horses reached his ears. The cavalrymen, of which Jim Mercer was the chief, were leading out the spirited mounts, and the creaking of leather, the snorts of the horses, and the cries of the young soldiers, reached the ears of the unfortunate young cadet. Hoping to attract their attention he pounded and yelled at the top of his voice, but no response came back to him. They were making too much noise themselves to hear him. \\n\\n \\n\\n Closer at hand there was a deeper rumble and Terry groaned in spirit. It was the members of his own division, the artillery, taking out the field guns that they were to take with them for the summer practice. He was the chief gunner on the sleek steel monster which he had named the “Gossip” and he knew that the others of his crew must be wondering where he was. Just as soon as the guns were in formation and the roll call sounded he would be officially marked absent from duty and held guilty of disobeying orders. As he heard the guns roll out of the barracks and heard the noise of the towing cables being connected he knew it was too late. \\n\\n \\n\\n From the barracks to the parade ground there was a slight hill and the trucks began to pull the weapons up the grade. He heard them go up one by one and then something seemed to go wrong. There was a snap, a rumble and somebody cried out. \\n\\n \\n\\n “Look out!” he heard Captain Rush bellow. “Number One gun is loose!” \\n\\n 25 \\n\\n \\n\\n That gun was Terry’s own piece of equipment. From the cries that arose he gathered that the gun had broken from the cable and was rolling down the hill. There was an increasing rumble that seemed suddenly close at hand, and before his brain had time to realize what had happened there was a tremendous crash, the boards of his cell burst open like matchwood, and the butt of the “Gossip” halted a scant foot from his stomach! \\n\\n \\n\\n For a single instant Terry was stunned. The sudden glare of morning sunlight made him blink, the dust filled his mouth and the echoes of the crash remained in his ears. But it did not take him long to regain his composure and spring forward. He placed affectionate hands on the gun. \\n\\n \\n\\n “Good old ‘Gossip,’” he whooped. “You wouldn’t go on parade without me, would you? Talk about luck!” \\n\\n \\n\\n A half dozen artillerymen appeared at the opening, led by Captain Rush. At the sight of Terry they halted and stared in amazement. \\n\\n \\n\\n “Where have you been?” Cadet Emerson, Terry’s mate, shouted. \\n\\n \\n\\n “Waiting for the old ‘Gossip’ to let me out!” retorted Terry gleefully. \\n\\n \\n\\n Rush approached him. “Where have you been, Mr. Mackson?” he inquired formally. \\n\\n \\n\\n “Someone locked me in here and I couldn’t get out, captain,” returned Terry. \\n\\n 26 \\n\\n \\n\\n “Then the accident was a lucky one for you,” nodded the captain. He turned to the young artillerymen. “We have only a few minutes to make the parade grounds. Snap to it!” \\n\\n \\n\\n Terry threw himself into the work, rejoicing in the chance to be busy. The truck was backed down the hill and the broken cable was stripped from it and new material substituted. A loose pin was driven into the shaft and when the “Gossip” was harnessed it was drawn up to the top of the hill in safety and wheeled swiftly into position. And on the rear box sat Terry, grinning from ear to ear. \\n\\n \\n\\n When his name was called he answered brightly, stealing a look across the parade ground to the infantry, where Rowen stood in the second rank. The face of the sullen one was a study in amazement. \\n\\n \\n\\n In accordance with previous instructions the cavalry swung out first, taking the long, dusty road that led to Rustling Ridge. Next in line marched the infantry and the artillery rumbled in the rear. Terry sat on his gun, happy and thankful for the good fortune he had had. He smiled frequently, but there was a grim set to his jaw nevertheless. \\n\\n 27 \\n\\n \\n\\n All through the morning they marched and it was noon before they paused to make temporary camp. Just as soon as the long column came to a halt and broke up Terry made his way to where Rowen and his few friends sat on a grassy bank. He halted directly in front of the other. \\n\\n \\n\\n “Didn’t work, did it?” Terry asked. \\n\\n \\n\\n Rowen looked at him with a haughty frown. “I don’t know what you are talking about,” he said. \\n\\n \\n\\n “Yes, you do. Your plan to lock me in the barn until I was late for camp didn’t turn out very well, did it?” \\n\\n \\n\\n “I don’t know anything about it, and you can’t prove that I do,” snapped the dark-haired boy. \\n\\n \\n\\n “Don’t be silly!” growled Terry. “I can do that easily. All I have to do is to give that little sneak Jack Olson a good, stiff beating and he’ll tell. Look at how pale he is! Or I can ask Captain Rush about it and we’d have you in a fine mess. But I don’t intend to do anything like that, Rowen, and you know it. I would have been blacklisted by my captain if I had been late for encampment, and you figured on that. Now, look here! Just one more piece of freshness out of you and I’ll give you the peachiest licking you ever saw, right in front of the cadet corps. Don’t forget it, my friend!” \\n\\n \\n\\n Turning on his heel Terry walked off, his eyes dancing slightly. There was no word spoken by the ones back of him, and perhaps it was just as well. The redhead was dynamite and ready to go. \\n\\n 28 \\n\\n \\n\\n In that brief period he encountered Don. Jim was far ahead with the supply corps but Don, who was a lieutenant in the infantry, was close at hand. He was delighted to see his pal. \\n\\n \\n\\n “Where in the world were you at assembly?” Don demanded. “Jim and I nearly turned the building upside down looking for you.” \\n\\n \\n\\n Terry explained briefly and Don approved of his recent charge to Rowen. “That fellow certainly has a grudge against you,” said Don. “You couldn’t exactly call him a bully, because he isn’t big enough or strong enough, but his surly nature makes him anything but trustworthy. A fine mess you would have had if you had been several days late for encampment. As far as that goes, you might have been a prisoner in that storage room for a long time.” \\n\\n \\n\\n “That’s right,” agreed Terry. “And to anyone who likes to eat as well as I do that would have meant something!” \\n\\n \\n\\n After an afternoon of leisurely marching the cadets came to an open meadow where the cavalry and the supply corps had set up tents. Here they spent the night and the next morning they pushed on to Rustling Ridge, arriving there about noontime. \\n\\n 29 \\n\\n \\n\\n Rustling Ridge was a long slope that rose gradually from a flat meadow. It was in the heart of delightful country, and here and there solitary farmhouses could be seen. Close beside the camp there was a deep swimming hole, which the cadets welcomed with unrestrained delight. The camp itself was pitched in a grove about a quarter way up the slope, the white tents rising in somewhat irregular lines between the trees. The wide glades on either side of the camp permitted the creation of natural centers for the horses and the supply wagons and guns. By midafternoon the camp was in first-class order and the tired cadets enjoyed their first swim in the near-by swimming hole. \\n\\n \\n\\n After supper large fires were lighted, but the cadets did not linger long around them. Even before taps many of them had sought their cots, falling asleep as soon as they crawled in between their blankets. Sentries were posted and soon the camp was quiet except for the stamping of horses and the tramp of the sentries. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/1705/50223.html","bookId":654,"book":{"id":654,"title":"The Mercer Boys in the Ghost Patrol","description":"简介： The summer camp of Woodcrest Military Institute was always an exciting event to the Mercer boys and Terry Mackson. But when the cadets camped near Rustling Ridge, the boys ran into a series of startling occurrences: a horse stampede, a mysterious fir...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/1705","creation":"Aug 1, 2019 12:19:06 AM","modification":"Aug 1, 2019 12:19:06 AM"}}
