{"id":111103,"no":16,"title":"Page 16","content":"The line moved forward again as the next car opened its doors. The tourists, and Chapel and Julia, filed in, filling all the available space. The operator of the Skyride announced that this was the last car of the evening, and that the mountaintop would be closing down in just thirty minutes. The tourists grumbled and booed but good-naturedly, disappointed that they weren\u0027t going to have much time at the top.\\n\\n In compensation, though, they got to see the carving come alive with the sunset.\\n\\n Red light washed over the face of Stone Mountain, filling in every crack and crevice of the massive bas-relief. The mountain itself seemed to glow like a titanic jewel, a rich luster that only brightened even as the sun faded.\\n\\n \"That\u0027s kind of beautiful,\" Julia said, leaning against the side of the car, pressing her face close to the glass of its windows. Behind her the tourists oohed and aahed, but Chapel only had eyes for her, this woman he\u0027d dragged out of New York City and taken with him on this mad trip.\\n\\n \"It\u0027s exactly the same color as your hair,\" he observed.\\n\\n She turned and faced him, her mouth curled up in a look of bewilderment. \"I\u0027m trying to give you the cold shoulder,\" she said. \"You shouldn\u0027t say things like that to me right now. It was way too close to being sweet.\"\\n\\n \"Couldn\u0027t help it,\" he told her.\\n\\n She shook her head and turned to look at the mountain again. \"I know you were just trying to protect me. But not telling me about the . . . about you know what. That wasn\u0027t protecting me. That was hurting me.\"\\n\\n \"It was?\" Chapel asked.\\n\\n \"You took away my right to make decisions for myself. That\u0027s what I hate about secrets. If I don\u0027t know things, I can\u0027t do anything about them.\"\\n\\n \"It\u0027s important that some secrets be kept,\" he said. Because it was what he believed.\\n\\n \"I suppose so. And I suppose that\u0027s your job.\" She sighed. \"Chapel, how can I ever trust somebody when I know they lie to me professionally? This is just weird.\"\\n\\n \"I can tell you one true thing,\" he said. \"When I came out of that hatch in the Underground, and you weren\u0027t there, my heart almost stopped. I didn\u0027t know what had happened to you. I was terrified you were gone. That I\u0027d lost you.\"\\n\\n \"As it turned out, I didn\u0027t need your protection,\" she told him, though her voice was softer than the words would suggest. \"Thanks. I guess.\"\\n\\n \"When this is over,\" he said, \"maybe-\"\\n\\n \"When this is over, I\u0027m going back to New York. I\u0027m going to live my life the way I choose to. Openly. Honestly. Or-or I\u0027ll go . . . where they tell me. The Catskills. Wherever.\" She shook her head, and her hair swung around in front of the red-stained mountain. He wanted to reach out and put his hands on her shoulders but he didn\u0027t dare.\\n\\n \"That\u0027s what you want,\" he said. It wasn\u0027t a question. \"Just-we part ways, then. And I never see you again.\"\\n\\n \"Just . . . stop, Chapel. Don\u0027t go there.\"\\n\\n \"I\u0027m sorry,\" he said.\\n\\n \"It doesn\u0027t matter. Listen, I can\u0027t give you the silent treatment. We\u0027re stuck in this thing together, and if I don\u0027t talk to somebody, I\u0027m going to go crazy. So we\u0027ll work together from now. Be civil to each other. But that\u0027s it. Let\u0027s just keep this relationship professional, okay?\" She was silent for the rest of the ride to the top.\\n\\n STONE MOUNTAIN, GEORGIA: APRIL 13, T+35:31\\n\\n The top of Stone Mountain looked like a patch of the moon transported to earth.\\n\\n Nothing grew up there save a few scraggly bushes and some lichens. It was bare rock, smoothed out by the wind but broken into ridges and basins where a little rainwater could gather and support the sparse plant life. By that point the sunset was over, though a yellow smudge of light still lingered on the far horizon. The rock was lit blue with deep purple shadows that were fading to black.\\n\\n There wasn\u0027t much to see up top. Just a visitors\u0027 center where the Skyride ended, a few radio antennas topped with blinking bulbs to warn off low-flying aircraft-and the view. In the distance Chapel saw the lights of Atlanta scattered among the darkening greenery of Georgia.\\n\\n A few of the braver tourists walked out onto the naked rock, perhaps in search of better views of the sunset or the scenery. Park rangers stood around with their hands in their pockets, giving everyone a little time before they had to head back down. There was no sign of Jeremy Funt.\\n\\n \"He must be here by now,\" Chapel said. \"This is right when he told me to meet him. Maybe he\u0027s hiding inside.\"\\n\\n \"I wouldn\u0027t blame him,\" Julia said, rubbing at her arms.\\n\\n It was cold up top, much cooler than it had been when they boarded the cable car. She took out the pink sweatshirt she\u0027d bought in the Underground and pulled it on, zipping it up to her throat. \"This is the ugliest thing I\u0027ve ever owned,\" she said, \"but right now, it\u0027s my favorite.\"\\n\\n Chapel wanted to take off his jacket and give it to her, but he couldn\u0027t. If he did, everyone would see his holstered sidearm, and the park rangers would definitely have questions. If he was going to make this meeting with Funt, he had to stay inconspicuous.\\n\\n \"Let\u0027s walk over to the far side,\" Chapel said, pointing at a fence on the other side of the mountaintop.\\n\\n \"There\u0027s nobody over there,\" Julia told him.\\n\\n \"I want to make myself as visible as possible so he can find me,\" Chapel replied. He didn\u0027t like this. He\u0027d expected Funt to meet him as soon as he stepped out of the cable car. He\u0027d expected the man to want to talk to him.\\n\\n Maybe that had been too much to hope for.\\n\\n \"Chapel,\" Angel said, \"I\u0027ve got bad news. Maybe.\"\\n\\n \"Go ahead,\" he told her.\\n\\n \"I\u0027ve been listening to the chatter on the park service radio channel. They\u0027re all checking in, confirming everybody\u0027s off the mountain and they can close up shop for the night. Except one ranger hasn\u0027t called in yet. They keep requesting he confirm his position, but he\u0027s not responding.\"\\n\\n \"Could be anything. Maybe his radio\u0027s battery just died. Or he could have ducked out for a smoke break.\"\\n\\n \"Maybe,\" Angel said. \"Considering how things have gone since we started with this case, you think that\u0027s likely?\"\\n\\n \"No,\" Chapel agreed. He bit his lip. \"Damn. If the CIA knows we\u0027re up here-\" he began, but he was interrupted.\\n\\n \"Chapel,\" Julia said in a forced whisper, \"behind you!\"\\n\\n Chapel swung around just in time for someone to poke a gun barrel in his ribs.\\n\\n He froze in place.\\n\\n The gunman wore the uniform of a park ranger, including the Smokey Bear hat. He was grinning maniacally.\\n\\n \"Hi,\" Jeremy Funt said.\\n\\n STONE MOUNTAIN, GEORGIA: APRIL 13, T+35:36\\n\\n \"Nice to see you again,\" Chapel said. He kept his hands at his sides. Funt hadn\u0027t told him to put them up, and he didn\u0027t want the paranoid ex-FBI agent to think he was reaching for a weapon.\\n\\n \"Give me a second here. Look behind you-there, you see?\"\\n\\n From the visitors\u0027 center a park ranger-presumably a real park ranger-made a series of hand gestures, rolling her hands around each other, tapping her watch. Clearly she was suggesting it was time for everybody to head back down. She looked over in the direction where Funt and Chapel were standing. Funt waved his free hand at her, then held up his fingers splayed out as if to suggest he needed five more minutes.\\n\\n The female park ranger shrugged and headed inside the center.\\n\\n \"In a second we\u0027ll have this place all to ourselves,\" Funt told Chapel.\\n\\n \"You know her? You set this up?\"\\n\\n \"Nope. I was up here about a month ago, scouting out new locations for booby traps. I watched the rangers and studied their routine. Half of them are hard-core pot smokers. They invite their friends up here after hours and they get high while the laser show plays on the side of the mountain. The supervisors don\u0027t interfere as long as they don\u0027t draw too much attention.\"\\n\\n The tourists were all herded back into the visitors\u0027 center and into the Skyride cable car to head back down to the park below. All the park rangers went with them, including one who turned out most of the lights in the visitors\u0027 center before he boarded the cable car. Eventually it departed.\\n\\n \"Okay, just us, now,\" Funt said. \"Why don\u0027t you take two steps back, very carefully-the ground here is none too level. And then you can tell me who the hell Red here is, and why you brought her.\"\\n\\n \"She\u0027s someone I\u0027m protecting,\" Chapel said, nodding in Julia\u0027s direction.\\n\\n \"I\u0027m Julia Taggart. I don\u0027t work for the government.\"\\n\\n Funt didn\u0027t look away from Chapel\u0027s face. \"Who do you work for, then?\"\\n\\n \"Cats and dogs,\" Julia said. She sounded perfectly calm.\\n\\n Well, Chapel supposed that was easier when you didn\u0027t have a gun pointed at your large intestine.\\n\\n \"She\u0027s a veterinarian. A chimera tried to kill her in New York,\" Chapel said.\\n\\n Funt nodded. \"I\u0027ll buy it. For now. I did some checking up on you, Chapel. I still have a few friends left in interesting places. You\u0027re definitely not CIA.\" Funt stopped as if he\u0027d just thought of something. \"Wait a minute. Taggart?\"\\n\\n \"William Taggart is her father. You know William Taggart?\"\\n\\n Funt shrugged. \"I met him, a long time ago. Mad scientist type. Liked to clone up perversions of nature in his spare time. Made the chimeras.\"\\n\\n \" \u0027Made\u0027 them. I guess that\u0027s not a bad way to put it. What are they, specifically?\"\\n\\n \"You don\u0027t know?\" Funt asked.\\n\\n \"I only know what I\u0027ve seen. I got no briefing at all, just a warning they were tough. The one in New York was definitely that. He also had funny eyelids. I know what the word \u0027chimera\u0027 means, too. An organism with DNA from two or more sources. Which is more than they\u0027re supposed to have.\"\\n\\n Funt nodded. \"Okay. I\u0027m going to trust you, just a little bit. I can\u0027t hold this gun on you all night, after all. So I\u0027m going to put it away. But first, you\u0027re going to give me yours. Then I\u0027ll tell you what I know, and then we can discuss getting me out of Atlanta. That\u0027s the deal. You okay with it?\"\\n\\n \"I\u0027d rather hold on to my weapon.\"\\n\\n Funt smiled. \"I\u0027d rather be married to Phoebe Cates. I\u0027d rather be in Philadelphia right now, eating a cheesesteak. The last fifteen years, I\u0027ve had to deal with how things are, not how I\u0027d rather they were.\"\\n\\n \"Fair enough,\" Chapel said. Very, very slowly he reached into his jacket and removed his weapon. He handed it to Funt by the grip.\\n\\n \"Good,\" Funt said, shoving it in one of his pockets. He lowered his own pistol, but he kept it in his hand. \"Now we can talk.\"\\n\\n STONE MOUNTAIN, GEORGIA: APRIL 13, T+35:39\\n\\n \"I have a lot of questions,\" Chapel said. \"Starting with what they are. I want to know about the one you called Malcolm, and what your relationship with him is. I want to know when you first encountered them and-\"\\n\\n Funt held up his hands for peace. \"Stop. I\u0027ll tell you my whole story. That should answer most of your questions. But first I need something from you. I want your promise that when we\u0027re done here, we\u0027ll go straight to the nearest airport. You\u0027ll make sure I get a plane ride to anywhere I want to go.\"\\n\\n \"Done,\" Chapel said.\\n\\n \"That easy, huh?\"\\n\\n \"I\u0027ve got carte blanche to deal with the chimeras,\" Chapel told him. \"My boss-at the DIA-just wants to make sure they don\u0027t kill anyone else.\"\\n\\n \"Oh, I\u0027m certain that\u0027s not all he wants.\" Funt rolled his eyes. \"Whatever. If you get me away from Malcolm, that\u0027s all I care about. Okay. Let me think about where to start with this.\"\\n\\n \"The beginning\u0027s always a good place,\" Julia said.\\n\\n Chapel looked across at her. She was standing close enough the three of them might as well be whispering. Clearly she intended to listen in on this. Chapel knew that Hollingshead probably didn\u0027t want her to hear it, but he figured this time he wouldn\u0027t try to stop her. He was in enough hot water as it was. If Funt started revealing state secrets, that would be another thing, of course.\\n\\n But as far as Chapel was concerned, the chimeras were fair game.\\n\\n \"It started in 1996. I worked for the bureau back then.\" Funt looked at Julia. \"That\u0027s the FBI.\" She just nodded, so he went on. \"I wasn\u0027t exactly famous; I mean, it\u0027s not like I was a household name. But I had cracked some missing persons cases, found some kids who\u0027d been abducted by religious cults or their parents or whatever and I had a reputation as the kind of guy who could find anybody. One day my AD-that\u0027s assistant director-calls me into his office and tells me to sign out for the day, then take a train to Virginia and meet with some guy in Langley. It was all very hush-hush and I wasn\u0027t supposed to let anybody know where I was going.\\n\\n \"The guy in question was CIA, which wasn\u0027t exactly a surprise-somebody says \u0027Langley,\u0027 that\u0027s what you think. His name was Banks. Asshole. Giant asshole.\"\\n\\n Chapel fought back a grin.\\n\\n \"Tells me,\" Funt went on, \"that he\u0027s got a missing person he needs found. A kid, about ten years old, named Malcolm. He\u0027s been missing for over a week. I always hated hearing something like that. With abducted kids, unless it\u0027s a parent who took them, if they\u0027ve been gone more than forty-eight hours you think to yourself, I\u0027m not looking for a kid. I\u0027m looking for a body. That\u0027s how you approach the case-otherwise you go insane when you do find the body. Banks assured me this kid was still alive, though he wouldn\u0027t say how he knew that. And he told me it definitely wasn\u0027t his parents who took him. Then he asked for my security clearance. He already knew it by heart, but I gave him what he wanted. He said I was going to see some things nobody was ever supposed to know about. At the time I didn\u0027t realize that meant I wasn\u0027t supposed to know them either, and I was going on his hit list.\"\\n\\n Chapel interrupted. \"Why did he bring you in on this in the first place? The CIA couldn\u0027t find the kid on their own?\"\\n\\n \"This was the mid-nineties. There wasn\u0027t even an Internet to speak of back then,\" Funt pointed out, \"much less the kind of satellites we have now. Back then when you needed somebody found, you went to the FBI. I was simply the best man for the job.\\n\\n \"The CIA flew me up to some place in New York State, I never did find out exactly where. They introduced me to William Taggart-your father who, forgive me, miss, was an asshole as well, though not as big an asshole as Banks.\"\\n\\n \"I\u0027m not exactly offended,\" Julia said.\\n\\n Funt nodded in thanks. \"He treated me like I was a kid. You could tell when he talked he was translating in his head, from big multisyllabic science words down to the kind of slangy English somebody like me might understand. He said the kid I was looking for was named Malcolm, and he was very, very special.\\n\\n \"They showed me some of the chimeras. Had them come out and speak to me, say, hello, Mr. Detective, isn\u0027t the weather nice today. Then one of them took off his shirt. There were a bunch of cinder blocks set up in the room. This kid-his name was Ian, I remember-goes over to them and breaks them, one at a time, by punching them. When he\u0027s done, he\u0027s breathing a little heavy and his eyes go weird. You know what I mean. An extra black eyelid slides down over his eyes and blinks at me a couple of times.\\n\\n \"When I stopped wanting to scream for my mother, I said, thanks, that was very impressive, but what in God\u0027s name did I just see? Dr. Taggart explained they were called chimeras, and they\u0027re the next step in human evolution. Ninety-nine percent human, he said, just like you and me. The other one percent was cobbled together from DNA sequences he stole from chimpanzees and rattlesnakes and something called a water bear, which I\u0027d never heard of. They were survivors, he said. They could live through anything, they could survive gunshot wounds, blood loss, hypothermia. They were faster than people, stronger, and, he thought, probably smarter, though they had a hard time testing for that.\\n\\n \"I asked a whole bunch of questions, like how one percent difference could account for everything he\u0027d told me, and why on earth he\u0027d chosen to do this, and whether he thought the devil had a special place for him in hell or if he was just going to get the usual treatment. He got pretty pissed off then and walked out on me. It was another scientist, a woman with red hair like yours but going gray, who showed me the rest.\"\\n\\n \"That . . . would have been my mother,\" Julia said.\\n\\n \"Are you going to get mad if I tell you she was kind of an asshole, too?\"\\n\\n \"She\u0027s dead,\" Julia said.\\n\\n \"Oh. Crap. I . . . didn\u0027t know-\"\\n\\n \"She\u0027s dead, which is the only thing that keeps me from agreeing with you,\" Julia told him.\\n\\n \" . . . Right. Well, this woman, who didn\u0027t even tell me her name, she showed me the place they had the chimeras living. Camp Putnam, they called it. They were all living in a sort of dormitory there. It looked pretty much like a summer camp, except all the kids were exactly the same age and size, and they all kind of looked alike. And instead of hot little counselors in tight T-shirts and short shorts, they had soldiers carrying M4 carbines. The kids didn\u0027t seem to think it was weird. They\u0027d never known anything else, your mom told me. They\u0027d been there their whole lives.\"\\n\\n \"Hold on,\" Chapel said. \"Julia-your parents moved away from the Catskills in, when, 1995?\"\\n\\n \"We moved to our house, yeah. For the first couple of years Dad only came to see us on the weekends, and Mom would commute to and from work. She had to get up really early so I had to get myself ready for school in the morning.\"\\n\\n \"But if the camp was operational then, why wouldn\u0027t they want to live closer to it?\" Chapel asked. \"If that was where they worked-\"\\n\\n \"Did you want to hear the rest of my story?\" Funt asked.\\n\\n \"Yes. Sorry,\" Chapel told him. \"Just trying to keep the facts straight.\"\\n\\n Funt snorted in derision and went on. \"Good luck with that. This was the weirdest case I ever saw, and I only got little glimpses of it. Your mom took me to see the fence around the camp. At the time it was just a normal cyclone fence, twelve feet high. They were already building a new one when I was there. Much bigger, and with barbed wire on top. Your mom told me the fence was electrified. They didn\u0027t think the chimeras would dare climb it. In this one case, they were wrong. Malcolm had gone right over it. The guards caught him when he landed on the other side.\"\\n\\n \"They caught him?\" Julia asked. \"But-\"\\n\\n \"They caught him. They couldn\u0027t hold him, though. Three soldiers, heavily armed. He killed all three of them, snapped their necks, and ran off into the woods. He was ten years old at the time.\"\\n\\n STONE MOUNTAIN, GEORGIA: APRIL 13, T+35:48\\n\\n \"He was . . . ten?\" Julia asked, her face pale even in the darkness that had settled over the top of Stone Mountain. \"In 1996, he was ten . . . they were all . . . ten?\"\\n\\n \"Yeah,\" Funt said. \"That significant, somehow?\"\\n\\n \"Just . . . to me. No. I mean, no-it\u0027s not significant. Please, go on.\"\\n\\n Chapel shot her a glance, but her face wasn\u0027t giving anything away. Maybe she had some secrets of her own.\\n\\n Funt shrugged and went on. He took off his ranger hat and rubbed his arms. \"I had my case, anyway. This weird mutant kid had escaped from the camp and I had to track him down. I tried not to think too much about what he\u0027d done to those soldiers, or what the other one, Ian, had done to those cinder blocks. I worked it like any other missing persons. I asked a lot of people a lot of questions, made a lot of phone calls, wore out some shoe leather. I\u0027m guessing the details aren\u0027t too important, not now. I spent three weeks looking, and every day Agent Banks from the CIA would call me and bitch me out for not finding Malcolm. Eventually I tracked the kid down to a house outside of Philadelphia. Nice place, just on the edge of farmland. No fence, just a real big lawn he could play on. It was owned by a family called the Gabors. They\u0027d found him walking along the side of a country road outside of Utica, New York, while they were on vacation. Figured he was a runaway so they took him in, raised him like their own. Hippie types-Mr. Gabor worked for a nonprofit feeding homeless people. The Mrs. was a lawyer, but the bumper sticker on her car said No Blood for Oil, so she wasn\u0027t exactly the rich kind of lawyer. I\u0027m guessing they were nice people.\"\\n\\n \"You\u0027re guessing? You didn\u0027t talk to them?\" Chapel asked.\\n\\n \"Nope. What I know about them I got from their daughter. She was a student at Villanova. She came home for Thanksgiving and found them in their bed. Her mom had been strangled. Looked like her dad tried to put up a fight. He was in pieces.\"\\n\\n \"Oh, God,\" Julia said. \"Don\u0027t-please don\u0027t explain what you mean.\"\\n\\n \"I\u0027d prefer not to, myself,\" Funt said. \"I don\u0027t even like thinking about what I saw in that bedroom. It was a classic rage killing, from the look of it. What you\u0027d expect if a six-foot-four linebacker came home and found his wife in bed with the mailman. A little more brutal than that, maybe. The daughter was in hysterics, of course, but she gave me the info I needed to find Malcolm. He was in his favorite place, the place he always went to, she said, when he was angry or confused, which happened a lot. He was in this tree fort in their backyard. He was still there when I got to the house. Just sitting up there, staring down at me. He\u0027d been crying. I asked him why he\u0027d done that to his foster parents. Why he\u0027d killed them. He told me. Seems he had been given a cat for a pet, and the cat disappeared. He didn\u0027t tell me where it went and I didn\u0027t ask. I wasn\u0027t in Missing Pets. His foster mom and dad got pretty upset about the whole thing, though, so they must have known what happened to it. He asked if he could have another one, and they said no. Absolutely not.\"\\n\\n \"What does that have to do with the parents\u0027 murder?\" Julia asked.\\n\\n \"You\u0027re not listening. That was the whole reason. They wouldn\u0027t let him have another cat. So he killed them.\"\\n\\n \"What? That\u0027s insane,\" Chapel said.\\n\\n \"Yeah. Exactly. The chimeras-they\u0027re ninety-nine percent human. But that one percent makes a serious difference,\" Funt told him. \"They don\u0027t think like us. They look like us, but they don\u0027t feel like us. To them everything is serious. Deadly serious. When they get frustrated, or upset . . . even just confused, it makes them angry-and when they\u0027re angry, nobody is safe. They\u0027re not human. They\u0027re monsters.\"\\n\\n Chapel felt a chill run down his spine. \"What did you do?\" he asked.\\n\\n \"I asked him to come down from his tree house. I told him I would find him some new parents to live with, that everything was going to be okay. Working in Missing Persons you learn how to talk to kids who are so scared they can\u0027t see straight. You learn how to calm them down. You also learn how to get them to climb into a stranger\u0027s car. I got Malcolm buckled in and I drove him straight to the local police station. He started freaking out then, but I thought I could handle him. Then Dr. Taggart-your dad-showed up, and Malcolm went ballistic.\\n\\n \"One of the cops at that station ended up on an early pension. Maybe he learned to walk again. I didn\u0027t have a chance to follow up. As for me, I was in the hospital for a long time with a broken pelvis and two broken legs. I came real close to putting a bullet in Malcolm\u0027s head. Instead, your dad put five tranquilizer darts in him and eventually he fell down and went to sleep. It was the last I ever saw of him.\"\\n\\n \"You told him he would be safe,\" Julia said.\\n\\n \"That\u0027s right. I lied to him,\" Funt told her. \"I betrayed him. I feel bad about that every once in a while. Then I think about the five people he killed, and what he did to that cop, and to me. He looked like a kid. He sounded like a kid. When he got angry, he was a demon out of hell. I have no idea what they did to him at Camp Putnam when he got back-for all I know they ran Nazi-style experiments on him night and day. Honest to God, I can\u0027t say for sure if I think he deserved it or not.\"\\n\\n STONE MOUNTAIN, GEORGIA: APRIL 13, T+36:02\\n\\n Chapel shook his head. Some of this was new information, but he didn\u0027t see how much of it helped him. \"So the CIA . . . created the chimeras, and then just warehoused them in this camp. But why? Why create them in the first place? What were they supposed to do? What were they supposed to be?\"\\n\\n \"You think they\u0027d tell me things like that? I only got to see the camp so I would know how dangerous Malcolm was. How tough my job was going to be,\" Funt said.\\n\\n \"Okay. Okay.\" Chapel scrubbed at his face with his hands. He felt soiled just from hearing Funt\u0027s story. \"Then-\"\\n\\n \"The whole time,\" Julia said. Both men turned to face her, but it was clear she was talking to herself. She had her arms wrapped around her chest and was bending over slightly at the waist. She looked like she might throw up-or start screaming. She shivered violently, and Chapel took his coat off and put it around her shoulders, but it didn\u0027t seem to help. \"The whole time I was growing up. The whole time,\" she repeated. She stared into Chapel\u0027s eyes. \"I was sixteen years old when all that happened. My dad was teaching me how to drive. Then he went and shot a boy full of tranquilizer darts and took him back to prison. My parents-I thought I knew who they were, but-oh God. When I was six, they were just being born. Or made, or grown in vats, or whatever. When I was in first grade, learning to read, my parents were giving birth to little monsters. Chapel. Chapel!\"\\n\\n \"I\u0027m here,\" he said, and reached for her, but she shoved him away.\\n\\n \"Chapel, they\u0027re my brothers. Maybe not in, you know, a genetic way. But in every other way that counts. My brothers!\"\\n\\n \"No,\" he said. \"No. You can\u0027t think like that.\"\\n\\n \"How can I not?\" she asked him. \"How can I think about them any other way?\"\\n\\n He started to answer, though he honestly had no idea what he was going to say. Before any words could come out of his mouth, though, a great booming noise ripped through the air and he jumped in surprise. It was followed by a deafening fanfare, and then a haze of light burst over the top of the mountain.\\n\\n \"What the hell?\" Chapel asked. He let go of Julia long enough to run over toward the visitors\u0027 center and see what was going on.\\n\\n Then the fanfare resolved into music-familiar fiddle music. It was the Charlie Daniels Band, singing about Georgia. The light came from powerful floodlights that were illuminating the carving on the side of the mountain.\\n\\n The nightly laser show had begun.\\n\\n Down at the bottom of the mountain, hundreds, maybe thousands of tourists would be staring in awe up at the carving as the lasers animated the generals and made it appear their horses were galloping across the stone. They were probably gaping in surprise and delight, looking up toward where Chapel, Julia, and Funt stood at the summit.\\n\\n \"Come on,\" Chapel said. \"Right now?\"\\n\\n Nearby someone laughed. Chapel spun around, half expecting Laughing Boy to step out of the darkness. But the figure that moved into the haze of light now was taller than Laughing Boy, and more heavily muscled.\\n\\n \"Funny story, huh?\" the figure asked.\\n\\n \"Who-\" Chapel began, but he already knew who it was.\\n\\n \"I never heard his version before. Real funny.\" The haze of light turned red for a moment, then died down to a less diffuse glow. Chapel\u0027s eyes adjusted to the sudden darkness, and he could make out the details of the newcomer\u0027s face.\\n\\n His eyes were black from side to side, with no white showing at all.\\n\\n Malcolm had arrived.\\n\\n STONE MOUNTAIN, GEORGIA: APRIL 13, T+36:09\\n\\n \"No fucking way,\" Funt shouted. \"Why did you bring him here?\" \\n\\n","sourceLink":"https://allnovel.net/chimera-a-jim-chapel-mission-jim-chapel-1/page-16.html","bookId":1585,"book":{"id":1585,"title":"Chimera: A Jim Chapel Mission (Jim Chapel #1)","description":"Storyline: Chimera: A Jim Chapel Mission (Jim Chapel #1) \\n Wounded Special Forces veteran Jim Chapel has been stuck behind a desk rather than out in the field, but medical technology has finally caught up with his ambitions. Coupled with his unstoppable determination, it will take him back to where he thrives: the thick of the action. Drafted into a new war, this time in our homeland, Chapel is tasked with hunting a group of escapees from a top secret military compound-all extremely deadly, genetically modified killers-and unraveling the mystery behind their existence. Aided by an enigmatic woman named Angel and a courageous, beautiful veterinarian, Chapel begins a cross-country hunt to stop the murders. But are the killers really rogues, or are they part of a sinister conspiracy that reaches into the highest levels?\\n","cover":"https://allnovel.net/images/chimera-a-jim-chapel-mission-jim-chapel-1.jpg","author":"David Wellington","type":"Thriller","source":"allnovel","link":"https://allnovel.net/chimera-a-jim-chapel-mission-jim-chapel-1.html","creation":"Oct 5, 2019 8:57:45 AM","modification":"Oct 6, 2019 12:16:29 AM"}}
