{"id":111105,"no":18,"title":"Page 18","content":"\"A quick cremation. That\u0027s all,\" Angel told him. \"The men I sent you are trained in bacteriological warfare protocols. They\u0027ll be safe.\"\\n\\n Chapel nodded. There wouldn\u0027t be any ceremony for Malcolm, he knew. No prayers, no weeping mourners.\\n\\n Maybe it was for the best. The chimera had been a killer, through and through. He\u0027d lived for nothing but revenge. After the story Funt had told, though, Chapel couldn\u0027t shake an image from his head: a ten-year-old boy, sitting in a tree house, scared and very, very alone. Not knowing what kind of future waited for him. Barely aware of where he was.\\n\\n Enough. Chapel\u0027s job was to hunt down four chimeras, and he was half done.\\n\\n He climbed into the helicopter and pulled on a crash helmet. \"Let\u0027s go,\" he told the pilot.\\n\\n IN TRANSIT: APRIL 13, T+36:48\\n\\n The chopper set down-much more smoothly this time-on a helipad at DeKalb-Peachtree Airport, only a few miles away from Stone Mountain. An airport medical team was waiting to take Funt away in an ambulance that sat waiting on the tarmac. Angel had timed everything perfectly, as usual.\\n\\n Julia ran over to the ambulance to tell the paramedics what she knew about Funt\u0027s condition. The medical team didn\u0027t waste any time getting him out of there. When Julia came back to the helipad, she was frowning. \"Will he be safe if they take him to the hospital?\" she asked. \"Laughing Boy may be out of the picture, but-\"\\n\\n Chapel nodded. The CIA had been trying to kill Funt for years. This was the perfect chance. They could even make it look like a natural death, like he had died of his injuries. \"They\u0027re not taking him to a civilian hospital,\" he told her. In fact he\u0027d been in touch with Admiral Hollingshead and arranged for Funt to be taken to a military hospital where he could be guarded night and day until he recovered. \"As long as they keep him alive until he\u0027s conscious, I\u0027m okay with this. Once he\u0027s awake, well, we saw how good he is at keeping one step ahead of them.\"\\n\\n Julia shrugged. \"I guess it\u0027s all we can do. What\u0027s next?\"\\n\\n Chapel nodded toward a nearby runway. Hollingshead\u0027s personal jet was already taxiing toward them. \"Say good-bye to Atlanta.\"\\n\\n \"Gladly,\" Julia said. Her red hair whipped in the breeze. \"I\u0027m about ready for another of those goat cheese and mandarin orange salads, too. How can I be hungry at a time like this? I should be sitting in a corner crying my eyes out, begging for somebody to make everything okay. Chapel, I killed a man. I don\u0027t feel bad about it. I don\u0027t feel scared right now. I don\u0027t even feel mad at you anymore.\"\\n\\n He knew the look in her eyes. He\u0027d seen it often enough when he was fighting alongside the Rangers. \"It\u0027s going to hit you, eventually. But right now your body knows you aren\u0027t safe. It knows you need to keep fighting. It\u0027s flooding your brain with endorphins.\"\\n\\n She put a hand over her face and laughed. \"This is not how I thought my week was going to go.\"\\n\\n He put his good hand on her shoulder and squeezed. She didn\u0027t push him away. Probably because she was in shock.\\n\\n They had to wait a few minutes while boarding stairs were moved into position, but when they climbed up into the jet, Chief Petty Officer Andrews was waiting for them with hot towels. The jet\u0027s main door was closed and suddenly they were in silence, sitting in comfortable chairs, and nobody was trying to kill them.\\n\\n Chapel had to admit it was a nice change of pace.\\n\\n \"We\u0027re cleared for takeoff right away,\" Andrews told them. \"Fasten your seat belts until we\u0027re in the air, okay? Our flight time to Denver will be a little under three hours. I\u0027ll dim the cabin lights now, and-\"\\n\\n \"Denver? We\u0027re not going to Denver,\" Chapel said.\\n\\n \"Oh. I\u0027m sorry,\" Andrews told him. \"I was informed you were. Was there a last-minute change?\"\\n\\n \"There needs to be. We\u0027re going to Chicago.\" He needed to check in with Eleanor Pechowski. Make sure she was safe.\\n\\n And find out everything she knew about chimeras and Camp Putnam.\\n\\n In his pocket his phone began to ring.\\n\\n IN TRANSIT: APRIL 13, T+36:54\\n\\n Chief Petty Officer Andrews smiled warmly and went to talk to the pilot. Julia looked at Chapel expectantly. His phone kept ringing.\\n\\n Finally he couldn\u0027t take it anymore, so he answered it.\\n\\n \"Sweetie,\" Angel said, \"I filed your flight plan for Denver-\"\\n\\n \"I need to make sure Eleanor Pechowski is safe,\" he told her.\\n\\n \"Of course you do. Which is why I\u0027ve been calling her every two hours and sending police around to keep an eye on the place she\u0027s staying. But Franklin Hayes\u0027s people have been calling me, about every fifteen minutes, wanting an update on where you are and how soon you\u0027ll be arriving in Denver.\"\\n\\n Chapel glanced at his watch. \"We have at least eleven hours before a chimera could even possibly reach Denver,\" he said.\\n\\n \"More like fourteen, because of the time zone difference,\" Angel confirmed. \"That gives you plenty of time to get to Denver and set up your defense for when the chimera comes for Hayes.\"\\n\\n \"Hayes will be fine. He\u0027s surrounded by security. I have no doubt a chimera is going to try to kill him, but even one of them can\u0027t realistically break into a federal courthouse full of cops. As far as I\u0027m concerned, Hayes is the safest name on the list. I\u0027ve finally got some breathing room here, Angel. I finally have time to follow up on some leads, and the last thing I need is to babysit some judge who\u0027s in no real danger.\"\\n\\n \"Sweetie-\"\\n\\n \"Unless you know something you\u0027re not telling me, Angel, I\u0027ve made my decision.\"\\n\\n She was silent for way too long.\\n\\n Chapel closed his eyes. \"What does Admiral Hollingshead say about this?\"\\n\\n Angel sounded sincerely apologetic. \"He suggested to me-without actually saying anything directly, of course-that your next stop would be Denver.\"\\n\\n \"He suggested that, huh? Which suggests to me,\" Chapel told her, \"that he knows exactly where the chimeras are going.\"\\n\\n \"I\u0027m not sure I like what you\u0027re implying,\" Angel said, caution thickening her voice.\\n\\n \"Angel. I\u0027m going to tell you something plainly now. No suggestions, no implications. Somebody knew we were going to Stone Mountain. Somebody told Malcolm where to find us.\"\\n\\n \"I\u0027m not sure I follow,\" Angel said.\\n\\n He was damned sure she did. She just wanted him to say it out loud. Maybe so when things went bad she could cover her posterior. Maybe she just wanted a record of him defying official orders.\\n\\n Chapel didn\u0027t really care anymore.\\n\\n \"Someone told Malcolm where Funt would be. They wanted Funt killed. Malcolm told me he was getting orders over the phone from someone he called the Voice. I don\u0027t know who this Voice is, but it had to be somebody who can access your line, Angel. Because the only people who knew about Stone Mountain were Funt, me . . . and you.\"\\n\\n Angel sounded panicky as she responded to that. Chapel wondered how good an actress she was. \"You think my system\u0027s been compromised again?\" she asked. \"Oh my God-should I move to different servers again?\"\\n\\n \"I don\u0027t think there\u0027s any point. I think the Voice can get to you anytime he wants to. Which means the Voice might be Director Banks. Or it might be Admiral Hollingshead.\"\\n\\n \"You can\u0027t mean that,\" Angel said.\\n\\n \"Someone\u0027s been setting me up for a while now, Angel. They tried to get me to run out to Denver while I was still en route to Atlanta. That\u0027s why Hayes was able to break into your line. They must have known Malcolm was on his way to kill Funt, but they tried to keep me from saving him. They wanted him dead. Now the same mysterious person wants me to rush out to Denver rather than check up on Eleanor Pechowski.\"\\n\\n \"I promise you she\u0027s safe,\" Angel said. \"I checked in with her just an hour ago and-\"\\n\\n \"I\u0027m sure she\u0027s safe. I\u0027m not worried about her health. But I\u0027m very interested in what she might be able to tell me-and why this Voice wants to make sure I don\u0027t hear it. I\u0027m going to Chicago, Angel. If Hollingshead won\u0027t let me take his private plane there, I\u0027ll walk over to the terminal and buy a ticket on a Delta flight with my own credit card.\"\\n\\n It was a bluff, and one that could cost him. He knew perfectly well that if Hollingshead or Angel truly wanted him in Denver, he\u0027d have no choice. With one phone call they could cut off his credit card-or put him on a no-fly list. They could make it impossible for him to go anywhere but Denver.\\n\\n There was only silence on the line for a long while. \"Angel?\" Chapel called, but she didn\u0027t respond.\\n\\n By his watch, three minutes passed before she came back. \"I\u0027ve changed your flight plan,\" she said. \"You\u0027re cleared to go to Chicago. But Chapel-\"\\n\\n \"What is it, Angel?\"\\n\\n \"You don\u0027t have a lot of friends. It\u0027s probably best if you don\u0027t start making any new enemies, now.\"\\n\\n It was a cryptic threat but he got it. He understood exactly what he was being told. He was on a leash, a short leash, and he would be choked if he strayed too far.\\n\\n PART THREE\\n\\n IN TRANSIT: APRIL 13, T+37:21\\n\\n Chapel knew he should take a nap on the flight from Atlanta to Chicago, but Julia was still wired, still a little freaked out that she\u0027d killed Malcolm, and she kept getting up from her seat and walking up and down the aisle between them. Chief Petty Officer Andrews turned the cabin lights back up so Julia wouldn\u0027t trip over anything.\\n\\n \"Come help me with something,\" he told her, just to get her mind off things. She walked over and gasped when she saw what he was doing.\\n\\n He had rolled up his sleeve and had used a steak knife to cut into the silicone flesh around his artificial wrist.\\n\\n \"What on earth are you doing?\" she demanded.\\n\\n \"Look at the fingers,\" he told her. They were half melted, some of them fused together by the electrical shock he\u0027d gotten back on Stone Mountain. \"The motors and actuators underneath are fine, but the artificial skin has to go.\"\\n\\n She stared at him in horror but when he kept cutting at the fake flesh, she eventually shook her head and grabbed the knife away from him. \"I do this for a living. Kind of,\" she said. She neatly cut away the synthetic hand and then stripped it back like she was peeling off a glove. He lifted the artificial hand and flexed its various joints, listening to the soft whine of the motors.\\n\\n He spent the rest of the flight putting the hand through various exercises, getting used to how different it felt. If anything, the fingers were stronger now-they didn\u0027t have to work against the silicone. Julia seemed fascinated by the robotic hand, which cheered him up a little. He\u0027d expected her to be repulsed by this reminder that he wasn\u0027t like everyone else. He should have known she was tougher than that.\\n\\n The plane set down in Midway airport in Chicago a little after nine thirty. When they\u0027d taxied up to the terminal, Chief Petty Officer Andrews went to open the main cabin door. \"Brace yourselves,\" she said. \"Chicago in springtime can be a shocking thing.\" The door popped open and a blast of frigid air rushed inside the plane. Julia immediately reached for her pink hoodie.\\n\\n \"It must be forty degrees out there,\" Chapel said, rubbing at his good arm with his robotic hand.\\n\\n \"The local temperature is closer to thirty-seven Fahrenheit,\" Andrews told him with a perky smile. \"Don\u0027t say you weren\u0027t warned.\"\\n\\n \"We\u0027ll freeze to death out there,\" Julia said. She shook her head. \"Chapel, I\u0027m not dressed for this. Maybe I should stay in the plane.\"\\n\\n Angel had thought of everything though, as usual. A pile of cardboard boxes were waiting on the tarmac, having been delivered even while they were taxiing in from the runway.\\n\\n Julia got the boxes open and started pulling winter coats out of their wrapping paper. \"This one\u0027s yours, I think,\" she said, holding up a black coat with a lot of pockets and zippers. \"Plenty of room for all your spy gadgets.\" The next box held a woman\u0027s coat in a shade of grayish blue. \"Oh, there\u0027s a note with this one,\" she said, and picked it up. \" \u0027I thought this color might suit you more than hot pink,\u0027 \" she read. She pulled on the coat and zipped it to her neck. Almost instantly she looked happier. \"Wow. The coat I have at home isn\u0027t this nice.\"\\n\\n Chapel took a second to appreciate the way the color worked with her hair and the way the coat\u0027s lines suited Julia\u0027s slender frame. He\u0027d never cared a fig for fashion, and definitely not for women\u0027s coats, but he had to admit that Angel had picked the perfect one for Julia. He smiled. His life might be in danger and there might be homicidal lunatics on the loose, but at least he had attractive company. \"What\u0027s in the other two boxes?\" he asked.\\n\\n The remaining boxes were much smaller. One held a hands-free unit identical to the one he\u0027d lost in Atlanta. He wasted no time putting it in his ear. \"Angel,\" he said, \"nice work here. Julia loves the coat you got her.\"\\n\\n \"You\u0027re welcome, sugar. I know what it\u0027s like to be a woman in a cold climate,\" the operator responded, as if she\u0027d been sitting on his shoulder the whole time. \"What do you think of the gloves?\"\\n\\n The final box held three different pairs of black leather gloves. \"I wasn\u0027t sure what size you would need now that your hand is thinner,\" Angel told him. \"I hope one of them will work.\"\\n\\n \"Thanks, Angel. You did great.\" Chapel tried the gloves on until he found one that fit comfortably over his robotic hand. He held it up and showed it to Julia. She nodded in approval.\\n\\n He went to the cabin door and started wrestling it open again, prepared now for the cold. \"Come on,\" he said. \"We have to go meet an elderly schoolteacher, and there\u0027s no time to lose.\"\\n\\n CHICAGO, ILLINOIS: APRIL 13, T+39:44\\n\\n They caught a cab and fought traffic all the way through the center of Chicago. Chapel checked his watch constantly as they struggled through the streetlights but there was nothing for it. He had to do this, and it didn\u0027t matter how long it took.\\n\\n \"You were almost relaxed, back on the plane,\" Julia told him. \"I was so wound up I kept wondering how you could be chill at a time like this. Now you\u0027re just as keyed up as you were last night when we landed in Atlanta.\"\\n\\n He watched the streetlights and the shadows alternately paint her face. \"It\u0027s an army thing. Our unofficial motto is \u0027Hurry up and wait.\u0027 You spend a lot of time in the army sitting around somewhere wondering when you\u0027re going to be called up, when the next firefight is going to happen. Eventually, if you\u0027re lucky, you learn to compartmentalize. You recognize when you\u0027re safe and you can let your guard down. It happens so infrequently that you have to take advantage of it when it does happen.\"\\n\\n \"I feel like I\u0027m never going to relax again,\" Julia said, pulling her shoulders in. \"I keep expecting to fall down. I know that everything that\u0027s happened, everything I\u0027ve done is going to catch up with me. I\u0027m just waiting for the hammer to drop.\"\\n\\n Chapel nodded. He\u0027d seen what extreme stress could do to people. He\u0027d seen soldiers come back from firefights whooping and hollering with adrenaline, and before they\u0027d taken their boots off they were already lost, dropped down a hole into their own thoughts. Sometimes they never climbed back out of that hole.\\n\\n \"The only treatment for what you have is to keep moving,\" he told her. \"Your body\u0027s smart. It knows how to keep you alive, if you listen to it. Right now it\u0027s telling you not to lie down, not to rest.\"\\n\\n Julia frowned. \"That\u0027s not a great solution either. That\u0027ll give you ulcers and migraines and who knows what else.\"\\n\\n \"Hang in there,\" he told her. \"This will be over at some point. Then you can figure it all out for yourself.\" It was the best comfort he had to offer her.\\n\\n The cab took them up Lake Shore Drive to a neighborhood called the Near North Side. It was a region of mansions and town houses, everything covered with a sheen of old money. And ice. Some of the houses still had icicles hanging from their eaves.\\n\\n \"It felt like summer was right around the corner, back in Atlanta,\" Julia said, like she was talking to herself. Maybe she just wanted to change the subject.\\n\\n The cab pulled up in front of a town house, and they stepped out into a knife-edged wind. Lake Michigan filled half the world around them, and gusts that rippled its surface buffeted them almost constantly.\\n\\n \"Coat or no coat, I want to get inside,\" Julia told Chapel.\\n\\n \"I\u0027m with you there,\" he said. He went up to the door of the town house where Eleanor Pechowski was staying and rang the bell. The door was answered almost instantly by an older man wearing thick glasses and a sweater vest.\\n\\n \"You must be Captain Chapel. Please, come inside,\" the man said. He kept one hand hidden behind the door while he looked out at the street, scanning up and down the rows of parked cars.\\n\\n \"What have you got there?\" Chapel asked, nodding at the concealed hand.\\n\\n The man frowned in embarrassment. He opened the door wider and Chapel saw he held a long sword. \"Just come in, please. I\u0027m Julius Apomotov, and this is my house.\"\\n\\n CHICAGO, ILLINOIS: APRIL 13, T+39:52\\n\\n Chapel and Julia stepped inside and Apomotov closed the door behind them, struggling to shut it against the wind.\\n\\n The house\u0027s foyer was all polished wood and sparkling glass chandeliers. Tapestries hung on the walls and a suit of armor stood next to a stairway leading up. The sword clearly belonged with the armor.\\n\\n \"The best I could find, under the circumstances,\" Apomotov said, lifting his weapon. \"I\u0027ve never believed in guns.\" He squinted, his eyes magnified by his thick glasses, and then shook his head. \"That is, I believe they exist, but-\" He shook his head again, in frustration. \"Never mind.\" He glanced down at the sword in his hand as if he didn\u0027t know where it had come from. For lack of anything better to do, he dropped it in an umbrella stand. \"Come in, come in. Eleanor is waiting for you. She\u0027s holding up remarkably well, under the circumstances.\"\\n\\n He took their coats and hung them in a closet near the door. Then he stood there for a while, one hand lifted in front of him as if he was going to point at something. He snapped his fingers. \"Chapel. Chapel. I had a student named Chapel once. Mark Chapel. Quite gifted. Any relation?\"\\n\\n \"I\u0027m not sure,\" Chapel said. \"My family\u0027s from Florida.\"\\n\\n \"Oh good God, no, no relation then,\" Apomotov said. \"Mark wouldn\u0027t be caught dead beneath the Mason-Dixon line. Through here, please. He was a Connecticut boy, bled Union blue if you cut him.\" Apomotov stopped in place and turned to look at them. \"Not that I ever cut him. You understand.\"\\n\\n \"Of course,\" Chapel said.\\n\\n Apomotov led them into a wide parlor behind the stairs. It was tastefully decorated, except for the hundreds of crossbows hanging on the walls, each of them suspended on individual wires from the crown molding. \"There,\" he said, waving at a couch on the far side of the room. An elderly woman there was struggling to stand up and greet them.\\n\\n \"Eleanor Pechowski, I presume,\" Chapel said.\\n\\n \"You must, absolutely must, call me Ellie,\" the woman said, coming over to take Chapel\u0027s hand. \"You\u0027re Chapel, of course, the one that very nice young woman keeps saying is my shield against trouble in these dark times. And who\u0027s this? Who\u0027s this?\" she asked, looking at Julia.\\n\\n \"She didn\u0027t introduce herself,\" Apomotov said. \"I thought it best to let her in anyway, under the circumstances.\"\\n\\n \"I\u0027m so sorry,\" Julia said. \"I\u0027m Julia Taggart.\"\\n\\n \"Ah!\" Eleanor Pechowski-Ellie-said. \"Aha! Your name precedes you, dear.\"\\n\\n \"I, uh, I take it you knew my father,\" Julia said, looking uncomfortable.\\n\\n \"And your mother as well. Come, sit. Have some refreshment. Julius, be a dear and fetch more cups.\"\\n\\n The elderly man nodded and headed off deeper into the house.\\n\\n \"An absolute gem of a man,\" Ellie said when he was gone. \"One of the leading lights in Russian medieval studies, a scholar of no small renown. Demented now, of course, quite as crazy as a moth meeting its first lightbulb but still a stellar human being. Took me in when I was told my own-far more modest-apartment wasn\u0027t safe anymore. Why aren\u0027t you two sitting down?\"\\n\\n Chapel hurried to take a place on a divan near a roaring fire. Julia joined him, sitting closer than he\u0027d expected.\\n\\n \"You\u0027ll take something to drink, of course,\" Ellie said, sitting down herself and lifting a teacup from a table near her. She tucked her legs up under herself on the couch. Chapel saw she wasn\u0027t wearing any shoes, and that there were holes in the toes of her pantyhose.\\n\\n \"Tea would be . . . lovely,\" Chapel said.\\n\\n Ellie snorted in derision. \"At this hour? It\u0027s whiskey or nothing. Now tell me-exactly-why you are here.\"\\n\\n She fixed Chapel with eyes that could have bored through steel plate. Even if he hadn\u0027t known, he would have guessed right away she\u0027d been a schoolteacher once.\\n\\n \"Well,\" Chapel said, \"I wanted to make sure you were safe, and-\"\\n\\n \" \u0027Rock-bottomed and copper-sheathed,\u0027 \" Ellie said.\\n\\n \"I beg your pardon?\"\\n\\n \"It\u0027s an old phrase from The Devil and Daniel Webster. It means I\u0027m just fine. There\u0027s been no trouble and I\u0027ll have Julius to protect me if need be.\"\\n\\n \"I\u0027m sure he\u0027s loyal, but-\"\\n\\n \"Then there\u0027s the squad of plainclothes policemen sitting in a car out front, where they\u0027ve been for nearly two days now,\" Ellie added. \"I must remember to send Julius down with some sandwiches and a thermos of coffee later. Cold duty this time of year, and this is a cold year even for Chicago.\" She clucked her tongue. \"Captain Chapel, I\u0027m old. I know I\u0027m old. I do not believe I am yet an old fool. I know the danger I\u0027m facing. I also know you wouldn\u0027t be here, sitting and chatting with me, just to be cordial. I take you for a man with far better things to do than comfort spinsters. So why don\u0027t you ask the question that you\u0027ve been holding on the back of your tongue since you walked in the door?\"\\n\\n \"All right,\" Chapel said. \"I need you to tell me everything you know about the chimeras, and Camp Putnam.\"\\n\\n In his ear Angel sounded very worried. \"Chapel, sweetie, she\u0027s not necessarily cleared to talk about-\"\\n\\n He pulled the hands-free set out of his ear. When his phone began to ring in his pocket, he switched it to vibrate. \"Excuse me,\" he said.\\n\\n CHICAGO, ILLINOIS: APRIL 13, T+39:53\\n\\n \"Hee. Ha heh. Ha.\"\\n\\n Tyrone Jameson had been a trauma nurse for twenty-two years. He\u0027d seen his share of horrors in that time, working in the ER at Piedmont Hospital in Atlanta. He\u0027d seen people come through the doors who looked like they were chopped in pieces-and who had eventually walked out again under their own power. He\u0027d seen people gone out of their mind on drugs take gunshot wounds to the face and not even feel it.\\n\\n This asshole took the cake.\\n\\n \"Ha. Heh . . . ha,\" the man said. He swung his injured foot off the bed and put it down on the floor. Put his weight on it.\\n\\n The man screamed-and laughed at the same time.\\n\\n \"Jesus, buddy, just-just lie down for me, okay? Will you do that for me?\" Tyrone asked, his hands reaching to grab the guy\u0027s shoulders and push him back down onto the bed.\\n\\n The look the patient gave him made Tyrone\u0027s blood turn to icy slush.\\n\\n \"Ha.\"\\n\\n The jerk had lost two toes. The front half of his foot looked like hamburger when he came in. Now it was encased in a hard cast and a metal brace just to keep the foot from falling off. And he was putting weight on it.\\n\\n And laughing about it.\\n\\n \"Hee hee ho,\" the man said, standing up on wobbly legs. He grabbed for his shirt, which was hanging on a chair next to the bed.\\n\\n \"Look, I can see in your face, you think you\u0027re some kind of badass tough guy,\" Tyrone said, not sure what to do. He should call for security, get some orderlies in here and a doctor to sedate the man. But he was scared. He was honestly scared of what his patient would do to him. \"But if you try to walk out of here, you\u0027re going to undo all the good the surgeon did. You\u0027re going to wreck that foot permanently.\"\\n\\n He could only watch as the man got dressed, one painful button at a time. He never stopped laughing.\\n\\n As he headed for the door, clearly intending to check himself out against medical advice, Tyrone just shook his head. \"You need to lie down, buddy. You need to spend the next six weeks in that bed. Or you\u0027re doing yourself a real disservice.\"\\n\\n \"Ha. Hee. Can\u0027t wait,\" the patient said. He turned around to give Tyrone a nasty look. \"I\u0027ve got a body to find, and burn. And then I\u0027ve got to kill a bunch of people. Ha. Hee ha hee. It\u0027s going to be a full day.\"\\n\\n Tyrone shook his head. \"No, seriously. Seriously-\"\\n\\n The man\u0027s smile was worse than his laugh. It was the kind of smile you would expect to find on a corpse.\\n\\n \"Doesn\u0027t it hurt?\" Tyrone asked, because he couldn\u0027t find any other words.\\n\\n \"Hee ha ha ha! Like you can\u0027t imagine,\" the patient admitted. \"Now. Where-hee ha hee-do I go to find a taxi out of here?\"\\n\\n CHICAGO, ILLINOIS: APRIL 13, T+40:07\\n\\n \"The chimeras. Well,\" Ellie said, \"that is quite an interesting thing to be asking about. You do understand I\u0027m absolutely forbidden to speak of that with anyone? I signed more than one nondisclosure agreement.\"\\n\\n \"I wouldn\u0027t ask if the need wasn\u0027t great,\" Chapel told her. \\n\\n","sourceLink":"https://allnovel.net/chimera-a-jim-chapel-mission-jim-chapel-1/page-18.html","bookId":1585,"book":{"id":1585,"title":"Chimera: A Jim Chapel Mission (Jim Chapel #1)","description":"Storyline: Chimera: A Jim Chapel Mission (Jim Chapel #1) \\n Wounded Special Forces veteran Jim Chapel has been stuck behind a desk rather than out in the field, but medical technology has finally caught up with his ambitions. Coupled with his unstoppable determination, it will take him back to where he thrives: the thick of the action. Drafted into a new war, this time in our homeland, Chapel is tasked with hunting a group of escapees from a top secret military compound-all extremely deadly, genetically modified killers-and unraveling the mystery behind their existence. Aided by an enigmatic woman named Angel and a courageous, beautiful veterinarian, Chapel begins a cross-country hunt to stop the murders. But are the killers really rogues, or are they part of a sinister conspiracy that reaches into the highest levels?\\n","cover":"https://allnovel.net/images/chimera-a-jim-chapel-mission-jim-chapel-1.jpg","author":"David Wellington","type":"Thriller","source":"allnovel","link":"https://allnovel.net/chimera-a-jim-chapel-mission-jim-chapel-1.html","creation":"Oct 5, 2019 8:57:45 AM","modification":"Oct 6, 2019 12:16:29 AM"}}
