{"id":111111,"no":24,"title":"Page 24","content":"\"Colorado doesn\u0027t have a mandatory seat belt law?\" Chapel asked.\\n\\n \"Well now, we do, but we can\u0027t pull you over unless there\u0027s some other reason,\" Young told him. \"Unless you\u0027re under seventeen, we don\u0027t even make you wear a helmet when you\u0027re riding a motorcycle.\"\\n\\n \"I guess things are a little different out west,\" Chapel said.\\n\\n \"Sure are. We all think of ourselves as having a little cowboy in our souls, still. So we don\u0027t much like the government treating us like children who have to be told what to do.\" Young clucked her tongue. \"Does make you think twice, though, when you get a report of some family of vacationers in a crashed car, and all you find is raspberry jelly all over the dashboard.\"\\n\\n Chapel laughed, despite himself. \"That\u0027s gruesome, Young. Truly gruesome.\"\\n\\n \"Oh, I\u0027m sorry,\" she said. \"I guess that\u0027s what we call dark humor. Helps us get through our job. You know. You ever want to see gruesome for real, you come out for a ride along with me up in the mountains.\"\\n\\n \"If I ever decide that yes, I want to see gruesome for real, I\u0027ll do just that,\" Chapel told her. He turned his head and saw one of the sedans full of Reinhard\u0027s goons just ahead of him and to one side. \"What about those?\" he asked. \"Tinted windshields. I thought those were illegal, too.\"\\n\\n \"It\u0027s a kind of iffy thing. You\u0027re allowed to tint them down to twenty-seven percent, which means twenty-seven percent of available light gets through. I\u0027d say those sedans are pushing the limit.\"\\n\\n \"Only twenty-seven percent of available light? That\u0027s ridiculous,\" Chapel said. \"How can they expect to see anything? They\u0027re missing three-quarters of their visual perimeter like that.\"\\n\\n \"I have a feeling, now, that Mister Reinhard figures, if you can\u0027t see in, you can\u0027t tell who\u0027s in the car. So you can\u0027t tell which car the judge is in.\"\\n\\n \"Unless you notice that one of the cars is a limo, and the rest are sedans,\" Chapel pointed out.\\n\\n \"That is what we might call, in my line of work, a clue,\" Young agreed.\\n\\n Chapel touched his hands-free unit. \"Reinhard, your people can\u0027t see anything through those tinted windows.\"\\n\\n \"Captain Chapel? I told you to keep your thoughts to yourself,\" Reinhard replied.\\n\\n \"Have them roll down their windows. It\u0027ll be windy but they\u0027ll survive,\" Chapel ordered.\\n\\n \"Those windows are bulletproof, Captain. They\u0027re up for a reason.\"\\n\\n Chapel grimaced. \"Our guy isn\u0027t a shooter. That\u0027s not his style. Roll down the damned windows.\"\\n\\n \"Chapel, I swear, if you don\u0027t clear this-\"\\n\\n Reinhard\u0027s transmission cut off in midsentence. At first Chapel thought something had gone wrong, that Quinn had somehow disrupted their communications, but then he realized Reinhard had just muted his microphone, presumably so he could talk to the judge.\\n\\n \"All right, Chapel,\" Reinhard said, after a while. \"The judge says I have to play nice with you. I\u0027ll make you a deal. If I have them roll down their windows, will you promise to stay off this channel?\"\\n\\n \"Cross my heart and hope to die,\" Chapel said.\\n\\n \"I\u0027ll hold you to that,\" Reinhard replied.\\n\\n Young laughed. \"That boy does not like you, he surely does not,\" she said. \"You\u0027d think the two of you might get along, being in the same line of work.\"\\n\\n \"Oil and water are both liquids, but they won\u0027t mix,\" Chapel pointed out. He craned his head around, watching all the sedans. One by one they started lowering their windows and he could see the black-suited security guards inside. The guards blinked and squinted as the pure mountain sunlight hit their eyes.\\n\\n \"Tell the truth, now. Did you do that just to annoy \u0027em all?\" Young asked.\\n\\n \"I think I\u0027d like to have my lawyer present before I answer that-\"\\n\\n Chapel stopped talking, then.\\n\\n \"Something wrong?\" Young asked.\\n\\n \"Yeah,\" Chapel said.\\n\\n One of the security guards, up in a sedan just ahead of Young\u0027s car, didn\u0027t squint or blink in the sun. No, he didn\u0027t need to.\\n\\n His third, black eyelid just slid down to protect his eyes.\\n\\n Quinn had been with them the whole time.\\n\\n IN TRANSIT: APRIL 14, T+58:51\\n\\n \"Angel? Angel, can you hear me?\" Chapel called. There was no response. \"Angel, come in! I need you to patch me through to the walkie-talkie system Reinhard\u0027s people are using. Angel!\"\\n\\n Trooper Young glanced over at him. \"Maybe we\u0027re just out of cell range. Reception is still kind of spotty out here,\" she suggested.\\n\\n \"Maybe,\" Chapel said. Though he\u0027d assumed that Angel\u0027s signal was carried by the satellite network, not by cell towers. She\u0027d reached him in all kinds of strange places.\\n\\n He tried the leader of the security guards. \"Reinhard, come in. Reinhard-the assassin is riding in car three!\" There was no response. Just as there hadn\u0027t been since he\u0027d first called the man. \"Damn it, Reinhard-I know you can hear me!\" The head security guard wasn\u0027t responding. Maybe he\u0027d been serious about clearing Chapel off his radio frequency. Maybe he\u0027d turned off his walkie-talkie.\\n\\n The timing suggested that was more than a coincidence.\\n\\n He grabbed the handset of the radio unit built into the car\u0027s dashboard. He tried to raise anyone and heard only static in response.\\n\\n \"That can\u0027t be right,\" Young said. \"I ran a radio check not ten minutes before we left the courthouse. It was working just fine.\"\\n\\n \"Somebody\u0027s jamming it,\" Chapel said. It was the only thing that made sense. Except it made no sense at all. \"We have to let them know. There has to be some way to communicate with them.\" Two of the sedans were way up ahead, one in front and one in back of the limo. Car three, with Quinn in its backseat, was just ahead of Young\u0027s car, which was trailing at the back of the convoy. \"Short of yelling at them-\"\\n\\n \"There\u0027s a thought,\" Young said. Chapel looked at her, having no idea what she meant. She laughed and gripped the steering wheel with both hands. \"I guess I\u0027ve been doing this longer than you. I remember back before we had cell phones, before we had wireless Internet, before-\"\\n\\n \"Young? What are you talking about?\"\\n\\n \"Just hold on,\" she said, and floored the accelerator.\\n\\n The patrol cruiser shot forward, swerving to narrowly miss the rear bumper of car three. The sedan made way for them, though the driver flashed his lights and honked his horn. Young ignored him. \"There\u0027s a pen and paper in the door pocket by your right hand,\" she told him. \"Write a message, quick.\"\\n\\n Chapel scrabbled for the items-a ballpoint and a citation book. He scrawled out the words ASSASSIN IN CAR THREE CALL REINHARD while Young pulled up alongside car two, directly behind the limo.\\n\\n \"Here, give me it,\" Young said, and grabbed the citation book. She flicked her siren on and off until the guard in the passenger seat of car two looked over in their direction. She held the citation book up to her window. \"Is he looking?\"\\n\\n \"Yeah,\" Chapel said, watching the passenger\u0027s face. \"Yeah, I think he\u0027s got it. He\u0027s shouting something but I can\u0027t hear him.\"\\n\\n Young rolled down her window. Air burst into the car, ruffling the pages of the citation book.\\n\\n \"I said,\" the passenger shouted, \"are you nuts?\"\\n\\n Chapel grimaced in frustration.\\n\\n \"Our radio is out,\" Young shouted back.\\n\\n The passenger in car two rolled up his tinted window.\\n\\n \"I don\u0027t think they\u0027re taking us serious,\" Young said. Her face was impassive, but Chapel knew she must be thinking the same thing he was.\\n\\n They were a guard detail for a man who had been targeted by an implacable assassin. They might doubt what Chapel had to say. They might think he was trying to sabotage the detail. But there was no excuse for not being cautious and heeding what he said.\\n\\n \"We have to assume a few things,\" Chapel told her, picking his words carefully. \"We have to assume they have orders not to listen to us.\"\\n\\n \"I\u0027ll go that far,\" Young replied.\\n\\n \"We have to assume they\u0027re not going to take any action,\" he went on.\\n\\n \"That\u0027s what I\u0027m seeing,\" she said.\\n\\n Chapel nodded. He had a couple more assumptions he wasn\u0027t going to say out loud. He had to assume that Reinhard-and his entire security crew-already knew that Quinn was in car three, and that they were on his side. On the side of the Voice and the chimeras. They were in on the assassination plot.\\n\\n Chapel also had to assume that Young wasn\u0027t in on it, too. If she was, this was going to be over very quickly.\\n\\n \"The judge is in danger,\" Chapel said.\\n\\n \"Yep.\"\\n\\n \"Are we going to do something about that?\" he asked.\\n\\n \"We sure as hell are.\" Young flipped on her lights and sirens and stamped on the brakes.\\n\\n IN TRANSIT: APRIL 14, T+58:59\\n\\n The sedans-cars two and three-shot past the cruiser as Young maneuvered them back to the rear of the convoy again, straddling the two lanes. Chapel saw her plan immediately-she was leaving the right lane open so car three could move across to the shoulder, but not leaving any room for them to fall back. As soon as the cruiser was clear of car three\u0027s bumper she picked up speed again, until they were separated by only a single car length\u0027s distance.\\n\\n She grabbed the microphone and switched on her loudspeakers. \"Car three, break off from the convoy immediately,\" she said, and Chapel heard her voice repeated so loud outside the car it made the windshield rattle. \"Move to the shoulder and stop your vehicle. You have ten seconds to comply.\" She switched over to the radio, but held her palm over the microphone. She glanced over at Chapel. \"I know I can trust my fellow troopers. I\u0027ve worked with some of \u0027em for years.\"\\n\\n Chapel remembered the judge saying he\u0027d worked with Reinhard for years, too. But they needed allies. There were three troopers on motorcycles in front of the limo, screening its advance, and two more well behind them keeping an eye on their tail. \"Call them,\" he said.\\n\\n Young flipped some switches on the radio and got on a state police restricted channel. \"This is Sergeant Young, calling all motorcycle units. Have identified that car three is a threat, repeat, car three.\"\\n\\n \"Tell them to screen the limo and get it off the road if they can,\" Chapel told her.\\n\\n \"Forward units, protect the principal, and get it to safety,\" Young said into her microphone. \"Rear units, close this road to traffic! Fall back and deploy flares. Calling headquarters, calling headquarters. We have an immediate need to close the northbound lanes of I-36 south of Broomfield. Repeat, we need an immediate road closure of I-36 northbound south of Broomfield.\" Almost instantly the units ahead of the limo called in to report they had received Young\u0027s orders and would do what they could. At least the troopers were paying attention.\\n\\n Chapel leaned forward to peer through the windshield. Car three hadn\u0027t changed its speed or position at all. Neither had the other sedans. All three of them had rolled up their windows, though. He couldn\u0027t see anything through the tinted glass.\\n\\n \"Do we hail \u0027em again, give \u0027em another chance?\" Young asked. \"I don\u0027t want to start shooting out tires or running anybody off the road if we don\u0027t have to.\"\\n\\n \"I think-\" Chapel said, but he didn\u0027t get to finish his thought.\\n\\n Up ahead the rear passenger-side door of car three popped open, and a man in a black suit flew out. He bounced off the asphalt and came caroming straight toward the patrol cruiser.\\n\\n \"Mother Mary!\" Young shouted, and whipped her wheel over to the side, narrowly avoiding rolling right over the security guard.\\n\\n Chapel spun around in his seat to watch as they raced past the man. He was struggling to get to his feet in the middle of the fast lane of the highway. It looked like he had a broken leg.\\n\\n Chapel guessed immediately what had happened. Quinn must have panicked. The other guards in car three must have tried to mollify him.\\n\\n Chimeras didn\u0027t take well to attempts to calm them down.\\n\\n \"Shotgun, mounted behind your head,\" Young said, her voice tight with worry.\\n\\n Chapel looked for and found the shotgun where it was held behind the headrests by a pair of metal clips. He grabbed it and broke it open. \"Shells,\" he said.\\n\\n \"Glove compartment. Grab the blue ones, those are slugs,\" Young told him. Her eyes were all over the road.\\n\\n Chapel yanked open the glove compartment and found the box of shells. Half of them were shot packed in red paper. The other half were solid slugs mounted in blue plastic casings. She was right-they would be far more effective against vehicle tires than the shells full of buckshot. He loaded two in the shotgun and nodded at her.\\n\\n \"Aim for the right rear tire,\" she told him. \"That\u0027ll make \u0027em slew over to the left, into the median. It\u0027s the safest-Jesus!\"\\n\\n He looked up to see what had her attention. The rear window of car three erupted in shards of glass. Chapel could see Quinn using his fist to clear the remaining glass. The barrel of a pistol emerged from inside the vehicle and started to track them.\\n\\n \"Head down!\" Young shouted, as she veered to the right. Chapel was thrown up against the passenger-side door, jarring his good shoulder. The box of shotgun shells burst open and spilled all over his lap, the shells rolling down into the leg well.\\n\\n The windshield of the patrol cruiser cracked from top to bottom as a pistol round tore through its cabin, narrowly missing Young\u0027s ear.\\n\\n \"I\u0027m fine,\" she shouted, and he nodded, snapping the shotgun closed and rolling down his window. \"Take your shot, quick!\"\\n\\n Chapel caught a flash of motion ahead of them and saw car two drifting back toward them. Either they\u0027d come to see what was happening-or to help. Whether they wanted to help Chapel or Quinn was an open question.\\n\\n \"I\u0027ve got this,\" Young told him. \"Take that shot!\"\\n\\n IN TRANSIT: APRIL 14, T+59:03\\n\\n Chapel rolled down his window and unbuckled his seat belt. Cradling the shotgun in his arm, he got his knees up on the seat and leaned out the window. The wind of their velocity tried to tear him out of the car but he braced himself and held on. Young shouted something at him but he couldn\u0027t hear. He could barely keep his eyes open as the air slapped him in the face over and over, but he managed to get the shotgun clear of the window and brought it up to his shoulder.\\n\\n Then a second pistol shot struck the hood of the cruiser, and Young had to veer to the side. Chapel flopped like a rag doll as the car shifted under him. He had to grab for the car door with his artificial hand, and nearly lost the shotgun. A third shot took off the wing mirror on the driver\u0027s side.\\n\\n At least Quinn-or whoever it was shooting from car three-wasn\u0027t aiming at Chapel. They clearly intended to incapacitate Young so she couldn\u0027t continue the pursuit. Chapel had to end this before that happened. He raised the shotgun and tried to find an angle to get the rear tire of car three. Normally with a shotgun you didn\u0027t need to aim-you just pointed and fired. This shotgun was loaded with slugs, though, solid projectiles that acted similar to rifle bullets. He needed to make his shot precise and clean.\\n\\n That wasn\u0027t going to happen with him hanging out of his window. He was firing across the car and the hood was in the way.\\n\\n There was only one thing for it. He reached forward with his left hand and grabbed the windshield wipers so he could pull himself forward. He was going to have to climb out onto the hood.\\n\\n Up ahead car two had fallen back in the right lane, boxing car three in. Were they trying to help? Their windows were up, and he couldn\u0027t see anyone inside the car. They weren\u0027t shooting at him, which was nice, but they were preventing car three from complying with Young\u0027s instructions. Not that Quinn was likely to let the driver of car three just pull over and surrender.\\n\\n No, it was on Chapel. He dragged himself forward, compensating every time Young veered or drifted into one lane or the other, trying to make it as hard as possible for the shooter in car three to get a bead on her. He could hardly blame her for not wanting to stand still, even if it did make it next to impossible for him to move out onto the hood. He glanced through the windshield and saw her sitting up in her seat, trying to see over him. Her eyes were firmly on the road. Either she knew what he was trying to do or she figured it was his own neck at risk.\\n\\n Stop stalling, he thought. He tried to channel Top, tried to hear his old physical therapist\u0027s voice in his head. This wasn\u0027t exactly a situation Top had prepared him for, though, and no words came.\\n\\n It didn\u0027t matter. He knew what Top would want him to do.\\n\\n Chapel kicked his legs out of the window and flopped down hard on the hood of the cruiser. Inertia tried to yank him up over the windshield and onto the roof of the car but he kept his center of gravity down and hugged the hood, the mechanical fingers of his left hand grabbing at the grill on the front of the car because it was the only thing to hold on to. Heat from the engine seared his chest and groin. The buttons of his shirt soaked up that heat and scorched his flesh, but he could only ignore it. With his right arm he reached around and brought the shotgun to bear. He braced it against the hood, angling the barrel down toward the tire of car three.\\n\\n That was when Quinn erupted out of the shattered rear window, howling in rage, hauling himself through the broken glass. The chimera pulled himself onto the trunk of car three. His mouth was wide open, virus-carrying saliva forming long strands between his massive white teeth. He stared at Chapel with eyes as black as the bottom of a well.\\n\\n Quinn had a pistol in his hand.\\n\\n Chapel had the shotgun.\\n\\n Quinn lifted his weapon and pointed it straight at Chapel\u0027s face. There was no way Chapel could dodge the bullet, no safe place he could move to.\\n\\n His weapon was already aimed.\\n\\n He took his shot.\\n\\n IN TRANSIT: APRIL 14, T+59:07\\n\\n The sound of the rear tire of car three exploding was the loudest bang Chapel had ever heard. Shreds of hot rubber and steel belting blasted outward in a cloud of stinging, slapping chaff. Chapel looked up and saw Quinn\u0027s pistol discharge. He could have sworn he saw the bullet come out of the barrel, that he watched it travel in slow motion straight for him. He dropped the shotgun and let it clatter away between the two cars. Car three was already turning, swerving over into the grassy median strip, dust and pieces of torn-up vegetation rising in a plume from its front tires.\\n\\n Chapel couldn\u0027t tell if he\u0027d been hit or not. Quinn had fired from point-blank range. He\u0027d been aiming right at Chapel. Had the car started to swerve before or after Quinn pulled the trigger? Chapel knew from past experience that you could be shot and not know it for long seconds, that the brain under stress could delay pain reactions for a surprisingly long time.\\n\\n Was he already dead, but his body hadn\u0027t realized it yet?\\n\\n He wanted to look down at himself, check himself for wounds, but he didn\u0027t dare. Car three had rumbled to a stop, nose down in the median, and was rocking back and forth on its suspension. Young hit the cruiser\u0027s brakes, though she was careful not to decelerate so hard that Chapel went flying. When he decided she\u0027d slowed down enough, when he could look down at the asphalt and see the grain in it, the texture of the road surface, he scrambled forward off the burning hot hood of the cruiser and rolled down to the ground, taking the fall on his artificial left arm. In a moment he was back up on his feet. He felt like he was floating, like adrenaline lifted him up into the air and then he was running, dashing full tilt back down the highway toward where car three sat, lifeless and unmoving.\\n\\n On the far side of the median civilian cars went by so fast they were just blurs of color in the air, red, bottle green, gunmetal gray. He heard the sirens of Young\u0027s cruiser but only as if they were far away, as if they were in the next county. He heard the breath surging in and out of his lungs. He heard his own heartbeat.\\n\\n His right side felt wet and cold. That was probably blood. Not a good sign, but he still didn\u0027t feel any pain, and he definitely didn\u0027t feel like it could slow him down. Quinn was back there, Quinn-a third chimera, one of his targets-\\n\\n His head was vibrating, like he\u0027d taken a punch to the temple. His brains felt like they were quivering Jell-O inside his skull.\\n\\n Black cars were moving all around him, slotting themselves into place. Men in black suits were jogging across the asphalt, guns and walkie-talkies in their hands. He glanced back and saw the limo almost right behind him, pulled across both lanes of the highway, standing across the road.\\n\\n \"The judge,\" he shouted. He couldn\u0027t hear his own voice. That wasn\u0027t a good sign. It could mean a lot of things, though, anything from a concussion to a gunshot wound to the head. \"Get the judge out of here! Get the limo out of here!\"\\n\\n Up ahead car three stood in the median. Beyond it he could see something black and white moving, thrashing around.\\n\\n It was Quinn. They\u0027d dressed him in one of their suits, made him look like a member of the security detail. They had cut his hair neat and professional, made him look like an ex-soldier or maybe an ex-football player. The kind of man who would work for Reinhard. If his eyes weren\u0027t covered by those nictitating membranes, Chapel would never recognize him. Quinn was staggering back and forth on the median like he was drunk. Like he was trying to walk on the deck of a heaving ship.\\n\\n Someone was shouting at Chapel. One of the troopers, one of the motorcycle troopers, was shouting at him, but Chapel couldn\u0027t hear the words, he could only see the man\u0027s lips moving. Chapel waved him away and ran toward Quinn.\\n\\n Around the median there was a ring of black suits. Men in black suits. Their eyes were normal, at least, but why were they standing there? Why were they just standing there?\\n\\n Quinn saw Chapel and pulled himself upright. He pounded at his ears with his palms as if they were full of water and he was trying to clear them. Was he deaf too? Maybe-maybe the noise of the tire blowout had deafened them both.\\n\\n Chapel had no time to think. He couldn\u0027t think. He drew his sidearm. Stood sideways to make a smaller target of himself, pointed his weapon at Quinn. \"Lie down! Lie down on the ground and put your hands behind your head!\" Chapel shouted. He could just hear the words, though they sounded distorted and weird.\\n\\n Quinn scrubbed at his face with his hands. His jacket was torn all up one side, and the white cuff had frayed down to torn ribbons. The skin of his palm on that side was pink and bloody. He must have gone flying when car three veered into the median. He must have been thrown clear and slid twenty feet on his hand and side. No wonder he looked so disoriented.\\n\\n He was still a chimera, though. Even as Chapel watched Quinn seemed to regain his composure. He pulled himself up to his full height. Tilted his head back and roared like a lion.\\n\\n Tell me who the Voice is. Tell me why the Voice wants you to kill Hayes. Tell me why you were created.\\n\\n There were a million questions in Chapel\u0027s head, questions he wanted to ask Quinn. He dearly wanted Quinn to surrender, wanted him to stand down so Chapel could take him into custody and interrogate him.\\n\\n Quinn was a chimera. He was hurt, and angry, and scared. He wouldn\u0027t be taken without a fight.\\n\\n He rushed straight at Chapel, his head down, his arms out like he would grab Chapel around the waist and knock him to the ground. Like he was going to crush Chapel\u0027s life right out of him.\\n\\n Chapel breathed out, aimed at the top of Quinn\u0027s head, and fired until Quinn dropped to the ground, dead as meat.\\n\\n IN TRANSIT: APRIL 14, T+59:10\\n\\n Chapel holstered his gun and closed his eyes, trying to clear his head. His ears rang with the noise of his own gunshots. He could hear the sirens of Young\u0027s cruiser better now.\\n\\n Slowly he opened his eyes. He was looking down at his feet. He was standing in a patch of dry, dusty weeds in the median strip. Quinn was nearby. Covered in blood.\\n\\n \"Nobody touch him,\" Chapel called out. \"Stay away from the blood, especially.\"\\n\\n He could hear his own voice a little better, now. That was good.\\n\\n Without even thinking about it he moved his good hand to his side. He could feel the wetness there. He lifted up his jacket and saw his whole side slick with blood.\\n\\n Not so good.\\n\\n Quinn had shot him. Chapel couldn\u0027t tell if it was a flesh wound or if the bullet had pierced his abdominal cavity. There was an awful lot of blood. His blood. Quinn\u0027s blood. His head started to spin again.\\n\\n You hurtin\u0027? Top asked him. In his head, that voice was just in his head, he forced himself to remember that. You feelin\u0027 the burn? You know what that means.\\n\\n \"Means I\u0027m still alive,\" Chapel said, because they\u0027d been through this so many times it was like a litany. Every time Chapel flagged or slowed down during their workout sessions, every time he wanted to take a break, Top would say the same thing.\\n\\n And if you\u0027re still livin\u0027-\\n\\n \"Then there\u0027s still work to do,\" Chapel said, out loud.\\n\\n He opened his eyes again. He didn\u0027t remember closing them. He kept them open, looked around himself.\\n\\n The security guards were standing in a circle around him, around him and Quinn\u0027s body. Some of them looked shocked. Maybe they\u0027d never seen a man\u0027s head blown off before. Maybe they just couldn\u0027t believe Chapel was still standing.\\n\\n One of them was holding a walkie-talkie. It squawked and Chapel heard something, heard Reinhard\u0027s voice come through, though he couldn\u0027t make out the words.\\n\\n Reinhard-who was in the limo with Judge Hayes. Reinhard-who maybe wasn\u0027t quite as trustworthy as the judge thought.\\n\\n \"Out of my way,\" Chapel said, as he ran through the circle of black suits. They didn\u0027t try to stop him. He got back up on the asphalt, started running as his feet hit solid highway pavement. The limo was still sitting there, across the lanes. It hadn\u0027t moved at all. Chapel ran up to the back door, tried the handle. It was locked at least.\\n\\n \"Your Honor,\" Chapel shouted. \"We need to move you out of here now. The assassin might have had backup.\" That wasn\u0027t how the chimeras normally worked, but this kill was different. The judge had been singled out by the Voice. It was possible the Voice had a contingency plan. \"Your Honor?\" \\n\\n","sourceLink":"https://allnovel.net/chimera-a-jim-chapel-mission-jim-chapel-1/page-24.html","bookId":1585,"book":{"id":1585,"title":"Chimera: A Jim Chapel Mission (Jim Chapel #1)","description":"Storyline: Chimera: A Jim Chapel Mission (Jim Chapel #1) \\n Wounded Special Forces veteran Jim Chapel has been stuck behind a desk rather than out in the field, but medical technology has finally caught up with his ambitions. Coupled with his unstoppable determination, it will take him back to where he thrives: the thick of the action. Drafted into a new war, this time in our homeland, Chapel is tasked with hunting a group of escapees from a top secret military compound-all extremely deadly, genetically modified killers-and unraveling the mystery behind their existence. Aided by an enigmatic woman named Angel and a courageous, beautiful veterinarian, Chapel begins a cross-country hunt to stop the murders. But are the killers really rogues, or are they part of a sinister conspiracy that reaches into the highest levels?\\n","cover":"https://allnovel.net/images/chimera-a-jim-chapel-mission-jim-chapel-1.jpg","author":"David Wellington","type":"Thriller","source":"allnovel","link":"https://allnovel.net/chimera-a-jim-chapel-mission-jim-chapel-1.html","creation":"Oct 5, 2019 8:57:45 AM","modification":"Oct 6, 2019 12:16:29 AM"}}
