{"id":110105,"no":23,"title":"Page 23","content":"EDGAR LOOKED SADLY AT THE BROKEN PIECES OF THE FLASK. UNFORTU-nately, he wasn\u0027t dressed appropriately for expressing profound sorrow¡ªloose shorts with a jolly pattern, a baggy undershirt, and his paunch oozing out between the two of them. Inquisitors obviously didn\u0027t take great care to keep in good shape¡ª they relied more on the power of their magic. \"This isn\u0027t Prague,\" I said, trying to comfort him. \"This is Russia. When bottles don\u0027t surrender here, they\u0027re exterminated.\" \"Now I\u0027ll have to write an explanatory note,\" Edgar said gloomily. \"Czech bureaucracy is a match for the Russian version any day.\" \"But at least we know now that Las isn\u0027t an Other.\" \"We still don\u0027t know anything,\" the Inquisitor muttered irritably. \"A positive result would have been unambiguous. With a negative one, there\u0027s still a chance he\u0027s such a powerful Other that he sensed the trap and decided to have a little joke with us.\" I didn\u0027t try to object. It was a possibility that we really couldn\u0027t exclude. \"He doesn\u0027t seem like an Other to me,\" Kostya said in a low voice. He was sitting on his bunk in just his shorts, streaming with sweat and breathing heavily. It looked like he\u0027d spent too long flitting about in the body of a bat. \"I checked him out back at the Assol. Every way I could. And just now too... Doesn\u0027t look like it.\" \"I have something else to say to you,\" Edgar snapped. \"Why did you have to fly right outside the window?\" \"I was observing.\" \"Couldn\u0027t you just sit on the roof and lean down?\" \"At sixty miles an hour? I might be an Other, but the laws of physics still apply. I\u0027d have been blown off!\" \"So the laws of physics don\u0027t prevent you from flying at sixty miles an hour, but you can\u0027t stay on the roof of the car?\" Kostya frowned and stopped talking. He reached into his jacket and took out a small flask full of some thick, dark crimson liquid. He took a mouthful of it. Edgar frowned. \"How soon will you require... food?\" \"If I don\u0027t have to transform any more¡ªtomorrow evening.\" Kostya waved the flask through the air, making a heavy splashing sound. \"I\u0027ve got enough left for breakfast.\" \"I could... in view of the special circumstances...\" Edgar paused and cast a sideways glance at me. \"I could issue you a license.\" \"No,\" I said quickly. \"That\u0027s a breach of established procedure.\" \"Konstantin is on active service with the Inquisition at present,\" Edgar reminded me. \"The Light Ones would receive compensation.\" \"No,\" I repeated. \"He has to nourish himself somehow. And the people in the train are probably doomed anyway. Every last one of them.\" Kostya said nothing, looking at me. Without smiling, a serious, intent kind of look... \"Then I\u0027ll get off the train,\" I said. \"And you can do whatever you like.\" \"I recognize the Night Watch style,\" Kostya said in a quiet voice. \"Washing your hands of the whole business. That\u0027s the way you always act. You give us the people yourselves, and then you turn your noses up in contempt.\" \"Quiet!\" Edgar barked, getting up and standing between us. \"Quiet, both of you. This is no time for squabbling. Kostya, do you need a license? Or can you hold out?\" Kostya shook his head. \"I don\u0027t need a license. While we\u0027re stopped somewhere in Tambov I\u0027ll get out and catch a couple of cats.\" \"Why cats?\" Edgar asked curiously. \"Why... er... not dogs, for instance?\" \"I feel sorry for dogs,\" Kostya explained. \"Cats too... but where am I going to find a cow or a sheep in Tambov? And the train doesn\u0027t stop for long at the small stations.\" \"We\u0027ll get you a ram in Tambov,\" Edgar promised. \"There\u0027s no point in helping spread mystical rumors. That\u0027s how it all begins¡ªthey find the bodies of animals drained of blood, write their articles for the gutter press...\" He took out his cell phone and selected a number from its address book. He had to wait a long time before someone who had been sleeping peacefully answered. \"Dmitry? Stop whining, this is no time for sleeping, the motherland calls...\" Edgar squinted at us and said in a clear voice: \"Greetings from Solomon, with all the signatures and seals.\" Edgar stopped talking for a while, either allowing the man to gather his wits or listening to his reply. \"Yes. Edgar. Remember now? Precisely so,\" said Edgar. \"We haven\u0027t forgotten about you. And we need your help. In four hours the Moscow¡ªAlmaty train will stop in Tambov. We need a ram. What?\" Taking the phone away from his face and covering the microphone with his hand, Edgar said angrily, \"What stupid asses they are, these human personnel.\" \"An ass would suit me fine too,\" Kostya chuckled. Edgar spoke into the phone again. \"No, not you. It has to be a ram. You know, the animal. Or an ordinary sheep. Or a cow. That doesn\u0027t bother me. In four hours, be standing near the station with the animal. No, a dog\u0027s no good! Because it\u0027s no good! No, no one\u0027s going to eat it. You can keep the meat and the skin. Right, I\u0027ll call you when we get there.\" Edgar put his cell away. \"We have a very limited... contingent... in Tambov. There aren\u0027t any Others there at the moment, only a human member of staff.\" \"Oh.\" That was my only comment. There had never been any humans in the Watches. \"Sometimes it\u0027s unavoidable,\" Edgar explained vaguely. \"Never mind, he\u0027ll manage it. He\u0027s paid for it. You\u0027ll get your ram, Kostya.\" \"Thanks,\" Kostya replied amicably. \"A sheep would be better, of course. But a ram will do the job too.\" \"Is the gastronomical discussion over now?\" I asked sarcastically. Edgar turned to me and said in a didactic tone, \"Our battle-readiness is a matter of great importance... So, you tell us that this... Las... has been influenced by magic?\" \"That\u0027s right. This morning. The desire to travel to Alma-Ata by train was implanted in his mind.\" \"It makes sense,\" Edgar agreed. \"If you hadn\u0027t discovered the trace, we\u0027d have put serious effort into this guy. And wasted a bundle of time and energy. But that means...\" \"That the perpetrator is intimately familiar with the affairs of the Watches,\" I said with a nod. \"He\u0027s in the know about the investigation at the Assol complex, he knows who was under suspicion. In other words...\" \"Someone from the very top,\" Edgar agreed. \"Five or six Others in the Night Watch, the same number in the Day Watch. Let\u0027s say twenty altogether, at most... Even so, it\u0027s not many, not many at all.\" \"Or someone from the Inquisition,\" said Kostya. \"Okay. A name, brother, a name.\" Edgar laughed. \"Who?\" \"Witezslav.\" Kostya paused for a second. \"For instance.\" For a few seconds I thought the Dark Magician, usually so imperturbable, was about to let rip and swear obscenely. And definitely in a Baltic accent. But Edgar restrained himself. \"Maybe you\u0027re feeling a bit tired after the transformation, Konstantin?\" he asked. \"Maybe it\u0027s time to go night night?\" \"Edgar, I\u0027m younger than you, but we\u0027re both babes in arms compared to Witezslav,\" Kostya replied calmly. \"What did we see? Clothes filled with dust. Did we personally analyze that dust?\" Edgar didn\u0027t answer that. \"I\u0027m not sure you can tell anything from the remains of a vampire...\" I put in. \"Why would Witezslav...\" Edgar began. \"Power,\" Kostya answered laconically. \"What\u0027s power got to do with it? If he\u0027d decided to steal the book, why report that he\u0027d found it? He could have just taken it and slipped away. He was alone when he found it! Do you understand that? Alone!\" \"He might not have realized immediately what he was dealing with,\" Kostya parried. \"Or decided not to steal it right away. But to fake his own death and bolt with the book while we\u0027re trying to catch his killer is a brilliant move!\" Edgar started breathing faster. He nodded. \"All right. I\u0027ll ask them to check it. I\u0027ll get in touch with... with the Higher Ones in Moscow and ask them to check the remains.\" \"Just to be sure, ask Gesar and Zabulon both to check the remains,\" Kostya advised him. \"We can\u0027t be sure one of them isn\u0027t involved.\" \"Don\u0027t teach your granddad how to make children...\" Edgar growled. He settled down more comfortably on the bunk¡ªand switched off. Gesar and Zabulon weren\u0027t going to get a good night\u0027s sleep either... I yawned and said, \"Gentlemen, I don\u0027t know about you, but I\u0027m going to sleep.\" Edgar didn\u0027t answer¡ªhe was engaged in mental conversation with one of the Great Ones. Kostya nodded and climbed under his own blanket. I climbed up onto the top bunk, undressed, and shoved my jeans and shirt onto the shelf. I took off my watch and put it beside me¡ªI don\u0027t like sleeping with my watch on. Below me, Kostya clicked the switch of the night lamp and it went dark. Edgar sat there without moving. The wheels hammered reassuringly. They say that in America, where they use incredibly long rails cast in one piece, they make special notches in them to imitate the joints and recreate that comforting rhythm of the wheels... I couldn\u0027t sleep. Someone had killed a Higher Vampire. Or the vampire himself had faked his own death. It didn\u0027t matter which. In any case, someone was in possession of unimaginable Power. Why would he run? Why hide on a train¡ªwith the risk that the entire train would be destroyed or, for instance, surrounded by hundreds of Others and subjected to an exhaustive search? It was stupid, unnecessary, risky. He had become the most powerful Other of all¡ªsooner or later Power would come to him. In a hundred years, or two hundred¡ªwhen everybody would have forgotten about the witch Arina and the mythical book. If anybody would have understood all that, Witezslav would. It was... it was too human, somehow. Messy and illogical. Nothing like the way a wise and powerful Other would have acted. But only an Other like that could possibly have killed Witezslav. Again it didn\u0027t add up. Down below, Edgar began to stir. He sighed and his clothes rustled as he climbed up onto his bunk. I closed my eyes and tried to relax as much as I could. I imagined the rails stretching out behind the train... through the stations and the small halts, past the cities and the little towns, all the way back to Moscow, and the roads running away from the station until out beyond the Ring Road they were pocked by potholes and after the sixtieth mile they were transformed into strips of pulverized tarmac and went creeping toward the sleepy little village and up to the old log house... \"Svetlana?\" \"I was waiting, Anton. How are you getting on?\" \"Still traveling. But there\u0027s something strange going on...\" I tried to open myself up to her as much as possible... or almost as much as possible. To unroll my memory like a bolt of cloth on the cutter\u0027s table. The train, the Inquisitors, the conversation with Las, the conversation with Edgar and Kostya... \"It\u0027s strange,\" Svetlana said after a short pause. \"Very strange. I get the feeling someone\u0027s playing games with you all. I don\u0027t like it, Anton.\" \"Me neither. How\u0027s Nadya?\" \"She\u0027s been asleep for ages.\" In this kind of conversation that only Others can have, there is no inflexion of the voice. But there is something that replaces it¡ªI could sense Svetlana\u0027s slight indecision. \"Are you at home?\" \"No. I\u0027m... visiting a certain old lady.\" \"Svetlana!\" \"I\u0027m just visiting, don\u0027t worry. I decided to talk the situation over with her.. . and learn a bit about the book.\" Yes, I ought to have realized right away that it wasn\u0027t just concern for our daughter that had made Svetlana leave us. \"And what have you found out?\" \"It was the Fuaran. The real one. And... we were right about Gesar\u0027s son. The old woman thought that was hilarious... and she reestablished some useful contacts at the same time.\" \"And then she sacrificed the book?\" \"Yes. She left it behind, absolutely certain that the secret room would soon be found, and the search would be called off.\" \"And what does she think about what\u0027s happened?\" I carefully avoided using any names, as if a conversation like this could be tapped. \"I think she\u0027s in a panic. Although she\u0027s putting a brave face on.\" \"Svetlana, how quickly can the Fuaran turn a human being into an Other?\" \"Almost instantly. It takes ten minutes to pronounce the spells, and you need a few ingredients... or rather, one... blood from twelve people. Maybe only a drop, but from twelve different people.\" \"What for?\" \"You\u0027d have to ask Fuaran that. I\u0027m sure any other liquid would have done instead of blood, but the witch bound the spell to blood... Anyway, ten minutes\u0027 preparation, twelve drops of blood¡ªand you can turn a human being into an Other. Or a whole group of people, just as long as they\u0027re all within your field of vision.\" \"And what level of Power will they be on?\" \"It varies, but you can raise the level of the weak ones with the next spell. In theory you can turn any human into a Higher Magician.\" There was something in what she\u0027d just said. Something important. But I just couldn\u0027t grasp the thread yet... \"Sveta, what is the... old woman afraid of?\" \"The transformation of people into Others on a massive scale.\" \"Is she planning to come in and confess?\" \"No. She\u0027s planning to run for it. And I can understand her.\" I sighed. We ought to have brought Arina to justice after all... if only the Inquisition hadn\u0027t charged her with sabotage. And then there was Gesar... \"Sveta, ask her... ask her if the Fuaran will acquire great power at the place where the book was written?\" A pause. What a pity this wasn\u0027t a cell phone and I couldn\u0027t talk to the witch directly. But alas, direct conversation is only possible between soul mates and people who have other close connections. \"No... She\u0027s very surprised. She says the Fuaran isn\u0027t tied to any particular place. The book will work in the Himalayas or Antarctica, or in the Ivory Coast if you like.\" \"Then... then find out if Witezslav could have used it? After all, he was a vampire, a lower Other...\" Another pause. \"He could have. Any vampire or werewolf could. Dark Ones or Light Ones. There are no limitations. Except for one¡ªthe book couldn\u0027t have been used by a human being.\" \"That\u0027s clear enough... Anything else?\" \"Nothing, Anton. I was hoping she might be able to give us a clue... but I was wrong.\" \"Okay. Thanks. I love you.\" \"And I love you. Get some rest. I\u0027m sure everything will be clearer in the morning...\" The subtle thread stretching between us snapped. I squirmed around on the bunk, settling down more comfortably. Then I couldn\u0027t help myself¡ªI looked at the table. The pointer of the compass was still rotating. The Fuaran was still on the train. I woke up twice during the night. Once when one of the Inquisitors came to Edgar to relate that some reports or other were missing. The second time when the train stopped in Tambov and Kostya quietly left the compartment. It was after ten when I got up. Edgar was drinking tea. Kostya, looking pink and fresh, was chewing a salami sandwich. The pointer was rotating. No change at all. I got dressed up there on the bunk and jumped down. I\u0027d found a tiny piece of soap in the bundle of bedclothes, and that was the only item of personal hygiene I had. \"Here,\" Kostya muttered, moving a plastic bag over toward me. \"I picked up a few things... in Tambov...\" The bag contained a pack of disposable razors, an aerosol can of Gillette shaving cream, a toothbrush, and a tube of New Pearl toothpaste. \"I forgot the aftershave,\" said Kostya. \"I didn\u0027t think of it.\" It wasn\u0027t surprising he\u0027d forgotten¡ªvampires and werewolves aren\u0027t any too fond of strong smells. Maybe the supposed effect of garlic, which was really quite harmless to vampires, was linked with the fact that it made it harder for them to find their prey? \"Thanks,\" I said. \"How much do I owe you?\" Kostya shrugged. \"I\u0027ve already given him the money,\" Edgar told me. \"You\u0027re entitled to expenses too, by the way. Fifty dollars a day, plus food, on submission of the checks.\" \"It\u0027s a good life in the Inquisition,\" I quipped. \"Any news?\" \"Gesar and Zabulon are trying to make sense of Witezslav\u0027s remains.\" That was what he said¡ª\"remains\"¡ªin a solemn, official voice. \"But it\u0027s hard to get much out of them. You know yourself¡ªthe older a vampire is, the less there is left of him after he dies...\" Kostya chewed intently on his sandwich. \"Sure,\" I agreed. \"I\u0027ll go take a wash.\" Almost everyone in the car was awake already. Only a couple of compartments where the merrymaking had been a bit too intense were still closed. I waited in the short line and then squeezed into the barracks comfort of the railway car\u0027s privy. Warm water oozed sluggishly out of the iron nipple of the tap. The sheet of polished steel that took the place of a mirror was unusable, spattered all over with soap. As I brushed my teeth with the hard Chinese brush, I recalled my nighttime conversation with Sveta. There was something important in what Svetlana had said. There was¡ªbut it had gone unrecognized by both of us. And I had to understand it. When I got back to the compartment I was still no closer to the truth, but I did have an idea that I thought might lead somewhere. My traveling companions had already finished their breakfast and when I closed the door I got straight to the point. \"Edgar, I\u0027ve got an idea. On a long stretch your guys unhitch the cars. One by one. To make sure the train doesn\u0027t stop, one of them monitors the driver. We watch the compass. As soon as the car with the book is unhitched¡ªthe pointer will turn toward it.\" \"And?...\" Edgar asked sourly. \"We get a fix on the book. We know which car it\u0027s in. And then we can surround that car and take the passengers aside with their luggage, one by one. As soon as we find the killer, the pointer will tell us. And that\u0027s it! No more need to destroy the train.\" \"I thought about that,\" Edgar said reluctantly. \"There\u0027s just one argument against it, but it\u0027s decisive. The perpetrator will realize what\u0027s happening. And then he\u0027ll be able to strike first.\" \"Get Gesar, Zabulon, Svetlana, and Olga here... do the Dark Ones have other powerful magicians?\" I looked at Kostya. \"We can find a few,\" Kostya answered evasively. \"But will we have enough Power?\" \"To deal with one Other?\" \"Not just an Other,\" Edgar reminded me. \"According to the legend, several hundred magicians were assembled to destroy Fuaran.\" \"Then we\u0027ll assemble them too. The Night Watch has almost two hundred members of staff, and the Day Watch has just as many. And there are hundreds of reservists. Each side can easily muster a thousand Others.\" \"Mostly weak, sixth- or seventh-level. We can\u0027t get together more than a hundred real magicians, third-level and up.\" Edgar spoke so confidently that there was no possible doubt he really had thought through the option of direct confrontation. \"That might be enough¡ªif we back up the Dark and Light Magicians with Inquisitors, use amulets and combine the two Powers. But it might not be. Then the strongest fighters would be killed and the perpetrator will be left with a free hand. Don\u0027t you think he might be counting on us taking this very approach?\" I shook my head. \"And another thing I\u0027ve been thinking about,\" Edgar said with gloomy satisfaction. \"The perpetrator might regard the train as a trap that will draw together all the powerful magicians in Russia. He could have hung the train from end to end with spells that we can\u0027t sense.\" \"Then what\u0027s the point of all our efforts?\" I asked. \"What are we doing here? One nuclear bomb¡ªand the problem\u0027s solved.\" Edgar nodded. \"Yes. It has to be nuclear, to penetrate all the levels of the Twilight. But first we have to make sure the target won\u0027t slip away at the last moment.\" \"Have you accepted Zabulon\u0027s viewpoint then?\" I asked. Edgar sighed. \"I\u0027ve accepted the viewpoint of common sense. An exhaustive search of the train and the use of massive force is fraught with the danger of magical carnage. And by the way, people would be killed anyway. Destroy the train... of course I feel sorry for the people. But at least we\u0027d avoid any global convulsions.\" \"But if there\u0027s still a chance...\" I began. \"There is. That\u0027s why I propose to continue with the search,\" Edgar agreed. \"Kostya and I take my young guys and we comb the whole train¡ªfrom the back and the front at the same time. We\u0027ll use amulets, and in suspicious cases, we\u0027ll try to check the suspect through the Twilight. And you have another word with Las. He\u0027s still under suspicion, after all.\" I shrugged. It all sounded too much like playing at searching. In his heart of hearts Edgar had already given up. \"So when\u0027s zero hour?\" I asked. \"Tomorrow evening,\" Edgar replied. \"When we\u0027re passing through the uninhabited area around Semipalatinsk. They exploded nuclear bombs in that area anyway... one more tactical weapon\u0027s no great disaster around there.\" \"Happy hunting,\" I said and walked out of the compartment. It was all obscene. It was all no more than a few lines in the report that Edgar was already preparing to write: \"Despite the efforts made to isolate the perpetrator and locate the Fuaran...\" There had been a time when I used to find myself thinking the Inquisition was a genuine alternative to the Watches. After all, what was it we did? We divided people from Others. We made sure that the actions of Others impacted people as little as possible. Yes, it was practically impossible¡ªsome of the Others were parasites by their very nature. Yes, the contradictions between Light Ones and Dark Ones were so great that conflicts were inevitable. But there was still the Inquisition. It stood above the Watches, and it also maintained the balance. It was a third power and a dividing structure of a higher level. It corrected the mistakes made by the Watches... But things had not turned out like that. There wasn\u0027t any third power. There wasn\u0027t and there never had been. The Inquisition was an instrument for keeping the Dark Ones and the Light Ones apart. It supervised the observance of the Treaty, but not in the interests of people, only in the Others\u0027 own interests. The Inquisition was made up of those Others who knew that we were all parasites and a Light Magician was no better than a vampire. Going to work in the Inquisition was an act of resignation. It meant finally growing up, abandoning the naive extremism of youth for healthy adult cynicism. Accepting that there were people and there were Others, and they had nothing in common. Was I ready to accept that? Yes, probably I was. Only somehow I didn\u0027t want to go over to the Inquisition. It was better to keep toiling away in the Night Watch. To go on doing the work no one needed, protecting the people no one needed. And by the way, why shouldn\u0027t I check out our only suspect? While there was still time. Las was already awake, sitting in his compartment and gloomily contemplating the bleak view through the window. The table top was raised and the bottle of kumis was cooling in the washbasin under a thin trickle of water. \"There\u0027s no refrigerator,\" he said mournfully. \"Even in the best compartment they don\u0027t provide a refrigerator. Want some kumis?\" \"I already had breakfast.\" \"So?\" \"Well, just a little bit...\" I agreed. Las poured us literally a drop of cognac each, just enough to moisten our lips. We drank it and Las said thoughtfully: \"Just what came over me yesterday, eh? No, tell me, why the hell would any rational man go to Kazakhstan on vacation? Spain maybe. Or Turkey. Or Beijing, for the festival of kisses, if you\u0027re looking for extreme tourism. But what is there to do in Kazakhstan?\" I shrugged. \"It was a strange mental aberration,\" Las said. \"I was just thinking...\" \"And you decided to get off the train,\" I prompted. \"Right. And then get on a train going the other way.\" \"A sound decision,\" I said, quite sincerely. In the first place, we\u0027d have one suspect less. And in the second place, a good man would be saved. \"In a couple of hours we\u0027ll reach Saratov,\" Las said out loud. \"That\u0027s where I\u0027ll get off. I\u0027ll phone one of my business partners and ask him to meet me there. Saratov\u0027s a good town.\" \"What makes it so good?\" I inquired. \"Well...\" Las poured another two glasses, a bit more generously this time. \"There have been people living in the territory around Saratov since time immemorial. That gives it an advantage over the regions of the Far North and the like. During czarist times it was the capital of a province, but a backward one¡ªno wonder Chatsky said in Griboedov\u0027s Woe from Wit \"into the wilderness, to Saratov!\" But nowadays it\u0027s the industrial and cultural center of the region, a major railroad junction.\" \"Okay,\" I said cautiously. I couldn\u0027t tell if he was being serious or just snowing me, and the word \"Saratov\" could easily be replaced by \"Kostroma,\" \"Rostov,\" or any other city. \"The most valuable thing is the major railway junction,\" Las explained. \"I\u0027ll get a bite to eat in some McDonalds and then set off back home. And there\u0027s an old cathedral there too¡ªI\u0027ll definitely take a look at that. So my journey\u0027s not completely wasted, is it?\" Yes, our unknown opponent had definitely been overly cautious. The suggestion had been too weak and it had dissipated in only twenty-four hours. \"Tell me, what was it that made you suddenly go dashing off to Kazakhstan?\" I asked carefully. \"I told you, I just felt like it,\" Las sighed. \"You just felt like it, and that\u0027s all?\" \"Well... I\u0027m sitting there, not bothering anyone, changing the strings on my guitar. Somebody got a wrong number, they were looking for some Kazakh... I can\u0027t even remember the name. I hung up and started wondering how many Kazakhs there were living in Moscow. And right then I had just two strings on my guitar, like a dombra. I tightened them up and started strumming. It was strange. There was even a kind of melody... sort of haunting, alluring. And I just thought¡ª why don\u0027t I go to Kazakhstan?\" \"A melody?\" I asked. \"Uh huh. Sort of alluring, calling to me. The steppes, kumis, all that stuff...\" Could it really have been Witezslav? Magic is usually imperceptible to an ordinary person. But vampires\u0027 magic is something halfway between genuine magic and very powerful hypnosis. It requires a glance, a sound, a touch¡ªsome kind of contact, even the very tiniest, between vampire and human being. And it leaves a trace¡ªthe sensation of a glance, a sound, a touch... Had the old vampire duped us all? \"Anton,\" Las said thoughtfully. \"You don\u0027t really trade in milk products.\" I didn\u0027t answer. \"If I\u0027d done anything that would interest the FSB, I\u0027d be pissing myself,\" Las went on. \"Only I get the feeling this is something that would frighten the FSB.\" \"Let\u0027s not get into that, okay?\" I suggested. \"It would be best that way.\" \"Uh huh,\" Las agreed promptly. \"Right. So what should I do¡ªget off at Saratov?\" \"Get off and make straight for home,\" I said, nodding as I stood up. \"Thanks for the cognac.\" \"Yes sir,\" said Las. \"Always glad to be of help.\" I couldn\u0027t tell if he was clowning about or not. Evidently that way of speaking just comes naturally to some people. After a fairly solemn handshake with Las, I went out into the corridor and set off toward our car. So it was Witezslav then? What a cute trickster... A tried and tested agent of the Inquisition. I was bursting with excitement. Obviously, having become unimaginably powerful, Witezslav was capable of disguising himself as absolutely anyone. Even that two-year-old boy peeping cautiously out of his compartment. Even that fat girl with the huge, vulgar gold earrings. Even that conductor who fawned on Edgar¡ªand why not? Even Edgar or Kostya... I stopped, gazing at the Inquisitor and the vampire standing in the corridor outside the door of our compartment. What if... No, stop, this is insanity. Everything is possible, but not everything happens. I\u0027m me, Edgar\u0027s Edgar, Witezslav\u0027s Witezslav. Otherwise it\u0027s just not possible to do anything. \"I have some information,\" I said, standing between Kostya and Edgar. \"Well?\" Edgar asked with a nod. \"Las was influenced by a vampire. He remembers... something like music luring him into the journey.\" \"How poetic,\" Edgar snorted, but he wasn\u0027t smiling. He nodded approvingly. \"Music? That certainly sounds like bloodsu¡ª... Sorry, Kostya. Like vampires.\" \"You could use the correct term: Like hemoglobin-dependent Others,\" Kostya smiled with just his lips. \"Hemoglobin\u0027s got nothing to do with it, as you know,\" Edgar snapped. \"Well then. It\u0027s a lead.\" He suddenly smiled and clapped me on the shoulder. \"You never give up. Well, now the train has a chance. Wait for me here.\" Edgar moved off quickly down the corridor. I thought he was on the way to his troops, but Edgar went into the captain\u0027s compartment and closed the door. \"What scheme has he come up with now?\" asked Kostya. \"How should I know?\" I glanced sideways at him. \"Maybe there are some special spells for detecting vampires?\" \"No,\" Kostya snapped. \"It\u0027s exactly the same as for all the Others. If Witezslav\u0027s hiding among the humans you can\u0027t winkle him out with any spells. It\u0027s all so stupid...\" He was feeling nervous now¡ªand I could understand him. After all, it\u0027s tough being a member of the most despised minority in the world of Others¡ªand to have to hunt down one of your own fellows. He once told me¡ªwhen I was a young, stupid, bold vampire hunter, \"There aren\u0027t many of us. When someone departs, we sense it immediately.\" \"Kostya, did you sense Witezslav\u0027s death?\" \"How do you mean, Anton?\" \"You once told me you can sense the death of... your own kind.\" \"We sense it if the vampire\u0027s registered. When it\u0027s the registration seal that kills him, the recoil is agony for everyone for miles around. Witezslav didn\u0027t have any seal.\" \"But Edgar\u0027s obviously come up with something,\" I muttered. \"Some special kind of Inquisitor\u0027s trick, maybe?\" \"Probably.\" Kostya frowned. \"Why is it like that, Anton? Why are we the only ones who are always persecuted... even by our own side? The Dark Magicians kill us too!\" Suddenly he was speaking to me the way he used to. Like when he was still an innocent vampire-boy... but then, what kind of innocence could a vampire have? It was terrible, it used to tear me apart¡ªthose cursed questions and that cursed predestination. And now I was hearing it from someone who had already crossed the line. Who had started to hunt and kill... \"You kill... for food,\" I said. \"And killing for power, for money, for amusement¡ªis that nobler?\" Kostya asked bitterly. He turned toward me and looked into my eyes. \"Why do you talk to me so... squeamishly? We used to be friends. What happened?\" \"You became a Higher Vampire.\" \"And so what?\" \"I know how your kind become Higher Vampires, Kostya.\" He looked into my eyes for a few seconds. And then he started to smile. With that special vampire smile, as if there are no fangs in his mouth yet, but you can already feel them on your throat. \"Ah yes... Drink the blood of young virgins and children, kill them... The old, classical recipe. That\u0027s how dear old Witezslav became a Higher One... You mean you never once looked in my file?\" \"No,\" I replied. He actually went limp. And his smile became pitiful and confused. \"Not even just once?\" \"No,\" I said, already beginning to realize I\u0027d made a mistake somewhere along the line. Kostya made a clumsy gesture with his hands and started talking in nothing but conjunctions, interjections, and pronouns: \"Why that... it\u0027s... look... but you... and I... yes... and you...\" \"I don\u0027t like looking in a friend\u0027s file,\" I said, and added awkwardly, \"not even a former friend\u0027s.\" \"And I thought you\u0027d looked at it,\" said Kostya. \"Right. This is the twenty-first century, Anton. Look...\" He reached into his jacket pocket and took out his flask. \"A concentrate of donor\u0027s blood. Twelve people give blood¡ªand there\u0027s no need to kill anyone. Of course, hemoglobin has nothing to do with it! The emotions a person feels when he gives blood are far more important. You can\u0027t imagine how many people are mortally afraid, but they still go to the doctor and give blood for members of their family. My own personal formula... \u0027Saushkins\u0027s prescription.\u0027 Only it\u0027s usually called \u0027Saushkin\u0027s cocktail.\u0027 That must be in the file.\" He looked at me triumphantly... and he probably couldn\u0027t understand why I wasn\u0027t smiling. Why I didn\u0027t mumble guiltily, \"Kostya, forgive me, I thought you were a low son of a bitch and a murderer... but you\u0027re an honorable vampire, a good vampire, a modern vampire...\" Yes, that\u0027s what he was. Honorable, good, and modern. He hadn\u0027t wasted his time in the Hematological Research Institute. Only why had he told me about the formula? About the blood from twelve people? I knew why. How could I have known what was in the Fuaran? How could I have known that the spell required precisely the blood of twelve people? Witezslav didn\u0027t have the blood of twelve people with him. He couldn\u0027t have worked the spell in the Fuaran and increased his powers. But Kostya had had his flask. \"Anton, what\u0027s wrong with you?\" Kostya asked. \"Why don\u0027t you say something?\" Edgar came out of the conductor\u0027s compartment, saying something, shook the captain of the train by the hand and came toward us¡ªstill with a satisfied smile on his face. I looked at Kostya. And read everything in his eyes. He knew that I knew. \"Where are you hiding the book?\" I asked. \"Quick. This is your last chance. Your only chance. Don\u0027t destroy yourself.\" And at that moment he struck. Without any magic¡ªunless you can call a vampire\u0027s inhuman strength magic. The world exploded in a white flash, the teeth in my mouth crunched and my jaw suddenly went numb. I was sent flying down the corridor and flew up against a passenger who\u0027d come out at the wrong moment for a breath of air. I probably had him to thank for the fact that I didn\u0027t lose consciousness¡ªin fact, it was the passenger who flaked out instead of me. Kostya stood there, rubbing his fist, and his body flickered, moving rapidly into the Twilight and back out again, slipping between the worlds. That ability the vampires have that had once astounded me so much... Gennady, Kostya\u0027s father, walking toward me across the courtyard, Kostya\u0027s mother Polina, with her arm around the shoulders of a vampire who\u0027s still a little kid... we\u0027re law-abiding... we don\u0027t kill anyone... what a surprise¡ªto have a Light Magician as a neighbor... \"Kostya!\" Edgar exclaimed, coming to a halt. Kostya slowly turned his head toward Edgar. I couldn\u0027t see, but I sensed him bare his fangs. Edgar flung his hands out in front of him and the corridor was blocked off by a dull, translucent wall that looked like a layer of rock crystal. Maybe the Inquisitor still hadn\u0027t realized what was going on, but his instincts were in good order. Kostya made a low, howling sound and pressed his hands against the wall. The wall held. The car lurched and swayed over the points and behind my back a woman launched into a slow, measured wail. Kostya lurched backward and forward, trying to break through Edgar\u0027s line of defense. I raised my hand and directed a Gray Prayer at Kostya¡ªan ancient spell against non-life. The Gray Prayer tears to shreds any organic matter raised from the grave that possesses no consciousness of its own and only lives through the will of a sorcerer. It slows vampires down and weakens them. Kostya swung around when the fine gray threads wrapped themselves around him in the Twilight. He took a step toward me, shook himself¡ªand the spell was torn apart before my eyes. I\u0027d never seen such crude but effective work before. \"Don\u0027t get in my way!\" he bellowed. Kostya\u0027s features had lengthened and sharpened, his fangs were all the way out now. \"I don\u0027t want... I don\u0027t want to kill you...\" I managed to get up and crawl over the felled passenger into a compartment. On the top bunks, two men of impressive dimensions started squealing¡ªoutdoing the woman who was yelling outside by the door of the washroom. There were glasses and bottles rolling around on the floor underneath me. In a single bound Kostya appeared in the doorway. He cast a glance at the men and they fell silent. \"Surrender...\" I whispered, sitting up on the floor beside the table. The way my jaw moved felt strange¡ªit didn\u0027t seem to be dislocated, but every movement was agony. Kostya laughed. \"I\u0027ll finish you all off... if I want to. Come with me, Anton. Come! I don\u0027t want to hurt anyone. What\u0027s this Inquisition to you? Or these Watches? We\u0027ll change everything.\" He was speaking absolutely sincerely. Actually pleading. Why do you always have to become stronger than anyone else before you can permit yourself weakness? \"Come to your senses...\" I whispered. \"You fool! You fool!\" Kostya growled, taking a step toward me. He reached out his hand¡ªthe fingers already ended in claws. \"You...\" A half-full bottle of Posolskaya vodka, with its contents lazily draining out, rolled right into my hand. \"It\u0027s time we drank to Briiderschaft,\" I said. Kostya managed to dodge away, but a few splashes still got him in the face. He howled and threw his head back. Even if you\u0027re the Highest Vampire of them all, for you alcohol is still poison. I stood up, grabbed a full glass off the little table and drew my hand back. I shouted, \"Night Watch! You\u0027re under arrest! Put your hands above your head! Withdraw your fangs!\" At precisely that moment three Inquisitors appeared in the doorway. Either Edgar had summoned them, or they\u0027d sensed something was wrong. They grabbed hold of Kostya, who was still wiping his bloody face. One of them tried to press a gray metal disk against his neck¡ªsomething charged up to the hilt with magic... And the next moment Kostya showed what he was capable of. A kick sent the glass flying out of my hand and flattened my back against the window. The frame gave a loud crack. And then where Kostya had been standing there was nothing but a gray blur¡ªthe punches and kicks followed each other faster than any movie hero could have thrown them. There were splashes of blood and scraps of flesh flying in all directions, as if someone was grinding up a piece of fresh meat in a blender. Then Kostya jumped into the corridor, glanced around, and dove out through the window, as if he hadn\u0027t even noticed the twin panes of thick glass. The glass didn\u0027t notice him either. I caught one last glimpse of Kostya outside the window, tumbling down the embankment¡ªand then the train hurtled on. I\u0027d heard about that vampire trick, but I\u0027d always thought it was pure fantasy. Even in the textbooks the phrase \"walking though walls and panes of glass in the real world\" was marked with a prudish \"n.p.\"¡ªfor \"not proven.\" Two of the Inquisitors were lying in a shapeless heap in the compartment¡ªso badly mutilated there was no point in trying to find any kind of pulse. The third one had been lucky¡ªhe was sitting on a bunk, squeezing shut a wound in his stomach. There was blood slopping down over his feet. The passengers on the upper bunks weren\u0027t yelling any more¡ªone had covered his head with a pillow, the other was staring down with glassy eyes and giggling quietly. I climbed down off the table and staggered out into the corridor.","sourceLink":"https://allnovel.net/twilight-watch-watch-3/page-23.html","bookId":2537,"book":{"id":2537,"title":"Twilight Watch (Watch #3)","description":"Storyline: Twilight Watch (Watch, #3) Twilight Watch (sometimes translated Dusk Watch) (Russian: Sumerechniy Dozor, Сумеречный Дозор) is a fantasy novel by Russian writer Sergey Lukyanenko. It is the sequel to The Night Watch and Day Watch and the third part of tetralogy that concludes with Final Watch. Lukyanenko returns to a structure closer to that he used in the Night Watch novel than the Day Watch novel. Twilight Watch is divided into three stories- Nobody\u0027s Time, Nobody\u0027s Space, and Nobody\u0027s Power. Each story begins with a prologue followed by seven numbered chapters and concluding with an Epilogue. Except for the prologues, the events of each story are written in a first person narrative using the voice of the Light Magician character Anton Gorodetsky, a member of Night Watch. Events in each of the prologues are written in a third person narrative and take place entirely outside of Gordetsky\u0027s presence. The entire novel is written in the past tense.","cover":"https://allnovel.net/images/twilight-watch-watch-3.jpg","author":"Sergei Lukyanenko","type":"Horror","source":"allnovel","link":"https://allnovel.net/twilight-watch-watch-3.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 5, 2019 11:50:06 PM"}}
