{"id":110106,"no":24,"title":"Page 24","content":"AS THE HERO OF A CERTAIN HOARY OLD JOKE PUT IT, \"BUT NOW LIFE IS\n returning to normal!\"\n The passengers in the captain\u0027s car were sitting in their compartments and staring vacantly out the windows. For some reason people walking through the car lengthened their stride and only looked straight ahead. In one closed compartment there were two bodies packed in black plastic sacks and the wounded Inquisitor, who was lying down after a colleague had treated him with healing spells for about fifteen minutes. Another two Inquisitors were standing on guard at the door of our compartment.\n \"How did you guess?\" Edgar asked.\n He\u0027d fixed my jaw in about three minutes, after he\u0027d helped his wounded comrade. I hadn\u0027t asked what the problem was¡ª simple bruising, a crack or a break. He\u0027d fixed it, and that was all I cared about. But my two front teeth were still missing, and it felt weird to feel the place with my tongue.\n \"I remembered something about the Fuaran...\" I said. In the commotion of the first few minutes after Kostya bolted, I\u0027d had time to think of what to tell him. \"The witch... you know, Arina... said that according to the legends, for the spells in the Fuaran to work, you had to have the blood of twelve people. Just a drop from each one would do.\"\n \"Why didn\u0027t you tell me earlier?\" Edgar asked sharply.\n \"I didn\u0027t figure it was important. At the time I thought the whole story of the Fuaran was pure fantasy... And then Kostya mentioned that his cocktail was made from the blood of twelve people, and it clicked.\"\n \"I see. Witezslav didn\u0027t have twelve people handy,\" Edgar said with a nod. \"If only you\u0027d told me right away... if only you\u0027d told me...\"\n \"You knew about the formula of the cocktail?\"\n \"Yes, of course. The Inquisition has discussed Saushkin\u0027s cocktail. The stuff doesn\u0027t work any miracles, it won\u0027t increase a vampire\u0027s strength beyond the natural limits. But it does allow a vampire to rise to his maximum potential without killing anyone...\"\n \"Rise or sink?\" I asked.\n \"If there\u0027s no killing involved, then rise,\" Edgar replied coolly. \"And you didn\u0027t know... would you believe it...\"\n I said nothing.\n Yes, I hadn\u0027t known. I hadn\u0027t wanted to know. What a hero. And now two Inquisitors were wearing black polyethylene and no one could do anything to help them...\n \"Let\u0027s drop it.\" Edgar decided. \"What point is there now... He\u0027s flying after us, do you see?\"\n I glanced at the compass. Yes, it looked that way. The distance between us and Kostya, or rather, the book, hadn\u0027t changed, although the train was hurtling along at forty or fifty miles an hour. He had to be flying after us. He wasn\u0027t making a run for it after all.\n \"There has to be something he wants in Central Asia...\" said Edgar, perplexed. \"The only thing is...\"\n \"We should summon the Great Ones,\" I said.\n \"They\u0027ll come,\" Edgar said casually. \"I\u0027ve informed them of everything, put up a portal... they\u0027re deciding what to do.\"\n \"I know what they\u0027re deciding,\" I muttered. \"Zabulon\u0027s demanding that Kostya be handed over to him. And, of course, together with the Fuaran.\"\n \"No one\u0027s going to get their hands on the book, don\u0027t you worry.\"\n \"Apart from the Inquisition?\"\n Edgar didn\u0027t answer that.\n I made myself more comfortable. Felt my jaw.\n It didn\u0027t hurt.\n But I was upset about the teeth. I\u0027d have to go to a dentist or a healer. The trouble was that even the very best Light healers couldn\u0027t fix your teeth without any pain. They simply couldn\u0027t do it...\n The pointer of the compass quivered, but maintained its direction. The distance hadn\u0027t changed¡ªsix or seven miles. So Kostya must have undressed and transformed into a bat... or maybe some other creature? A gigantic rat, a wolf... That wasn\u0027t important. He\u0027d transformed, probably into a bat, and he was flying after the train, clutching a bundle containing his clothes and the book in his paws. Where had he been hiding it, the son of a bitch? On his body? In a secret pocket in his clothes?\n He was a son of a bitch all right... but he had some nerve! The sheer insolence of it¡ªto join in the hunt for himself, to come up with theories, give advice...\n He\u0027d duped everyone.\n But in the name of what? The desire for absolute power? The chances of victory weren\u0027t all that good, and Kostya had never been particularly ambitious. Well, he was ambitious, of course, but without any manic ideas about ruling the world.\n And why wasn\u0027t he making a run for it now? He had the blood of three Inquisitors on his hands. That was something that would never be forgiven, even if he gave himself up and confessed, even if he gave back the book. He ought to run, after first destroying the book that the tracking spell was linked to. But no, he was still carrying the book and following the train. That was just plain crazy... Or was he hoping for negotiations?\n \"How were you expecting to identify Witezslav among the passengers?\" I asked Edgar.\n \"What?\" The Inquisitor, lost in thought, answered after a pause. \"A simple trick, the same thing you used: alcohol intolerance. We were going to get dressed up in white coats and carry out a medical inspection of the entire train. Supposedly looking for people with atypical pneumonia. We would have given everyone a thermometer well soaked in medical spirit. Anyone who couldn\u0027t take it in his hands or was burned would have been a suspect.\"\n I nodded. It might have worked. Of course, we\u0027d have been taking a risk, but taking risks was our job. And the Great Ones would have been somewhere close at hand, on call, ready to strike with all their might if necessary.\n \"The portal\u0027s opening...\" Edgar grabbed hold of my hand and pulled me down onto the bunk. We sat beside each other, with our legs pulled in. A trembling white radiance filled in the compartment. There was a low exclamation¡ªGesar had banged his head against a bunk as he emerged from the portal.\n Then Zabulon appeared¡ªin contrast with my boss, he had a mellow smile on his face.\n Gesar rubbed the top of his head, looked at me dourly and barked, \"You might as well have put up a portal in a Za-porozhets automobile... What\u0027s the situation?\"\n \"The passengers have been pacified, we\u0027ve washed away the blood, the wounded agent is receiving treatment,\" Edgar reported. \"The suspect, Konstantin Saushkin, is moving parallel with the train at a speed of forty miles an hour.\"\n \"No point in calling him a suspect any more...\" Zabulon said caustically. \"Ah, what a talented boy he was... what promise he had.\"\n \"You don\u0027t seem to have much luck with promising young colleagues, Zabulon,\" Edgar said in a quiet voice. \"Somehow they don\u0027t stay around for very long.\"\n The two Dark Magicians glared hostilely at each other. Edgar had old scores to settle with Zabulon¡ªever since that business with Fafnir and the Finnish sect. No one likes to be used as a pawn.\n \"Please refrain from sarcasm, gentlemen,\" said Gesar. \"I could say a few things on my own account... to you, Zabulon, and to you, Edgar... How powerful is he?\"\n \"Very powerful,\" said Edgar, still looking at Zabulon. \"The guy was already a Higher...\"\n \"Vampire,\" Zabulon said with a contemptuous laugh.\n \"Higher Vampire. Without much experience, of course... far less than you. But then he used the book, and became stronger than Witezslav. And that\u0027s already serious. I\u0027m inclined to believe that Witezslav was on the same level as you are, Great Ones.\"\n \"How did he finish Witezslav off?\" Zabulon asked. \"Do you have any theories?\"\n \"I do now,\" Edgar said with a nod. \"Vampires have a hierarchy of their own. The boy challenged him to a duel for preeminence. It\u0027s not very... spectacular. A battle of minds, a duel of wills. Rather like a crude stare-down. After a few seconds one backs down and submits totally to the other\u0027s will. Whenever the Inquisition came up against vampires, Witezslav always subdued them easily. But this time he lost.\"\n \"And was killed,\" said Zabulon, nodding.\n \"That\u0027s not necessarily the outcome,\" Edgar observed. \"Kostya could have made him his slave. But either he was afraid of losing control or he decided to see it through to the end. Basically, he ordered Witezslav to dematerialize. And Witezslav had no choice but to obey.\"\n \"A talented boy,\" Gesar said ironically. \"I won\u0027t lie, Witezslav\u0027s final destruction doesn\u0027t exactly upset me... Okay, Konstantin has become more powerful than Witezslav. Just how powerful, what\u0027s your evaluation?\"\n Edgar shrugged.\n \"How can I evaluate that? He\u0027s more powerful than I am. I assume he\u0027s more powerful than either of you. Maybe more powerful than all of us taken together.\"\n \"Don\u0027t start a panic,\" Zabulon muttered. \"He\u0027s inexperienced. Magic isn\u0027t arm-wrestling, magic\u0027s an art. When you have a sword in your hand, the important thing is to strike a precise blow, not just swing wildly with all your might...\"\n \"I\u0027m not panicking,\" Edgar said in a gentle voice. \"It\u0027s just hard to assess his level of power. It\u0027s very high. I used the Crystal Shield¡ªKostya very nearly broke through it.\"\n The Great Ones exchanged glances.\n \"The Crystal Shield can\u0027t be broken,\" Gesar observed. \"And anyway, how could you... all right, I understand. More artifacts from the special vault.\"\n \"He very nearly broke through the shield,\" Edgar repeated.\n \"And how did you manage to survive?\" Gesar asked me. Maybe I imagined it, but I thought I heard a note of sympathy in his voice.\n \"Kostya didn\u0027t want to kill me,\" I said simply. \"He went for Edgar... at first I hit him with the Gray Prayer,\"¡ªGesar nodded in approval¡ª\"... and then I found some vodka and I splashed it in his face. Kostya went wild. But he still didn\u0027t want to kill me. Then the Inquisitors distracted him, he tore them to shreds and left.\"\n \"A purely Russian approach¡ªsolving a problem with a glass of vodka,\" Gesar said morosely. \"What for? Why did you provoke him? He\u0027s not a novice. It must have been obvious you couldn\u0027t handle him. Was I supposed to present Svetlana with your remains afterward?\"\n \"I got carried away myself,\" I admitted. \"It was all just too unexpected. And then when Kostya started saying \u0027Come with me, I don\u0027t want to hurt anyone\u0027...\"\n \"He doesn\u0027t want to hurt anyone,\" Gesar said bitterly. \"A vampire reformer. A progressive lord of the world...\"\n \"Gesar, we have to decide what to do,\" Zabulon said quietly. \"I can have the fighters from the military airport scrambled.\"\n Neither magician spoke for a while.\n I imagined jet fighters screeching through the sky in pursuit of a bat, blazing away at it with their cannons and firing their rockets...\n A phantasmagorical vision.\n \"Helicopters then...\" Gesar said thoughtfully. \"No. That\u0027s nonsense, Zabulon. He\u0027ll just brush any humans aside.\"\n \"A bomb after all, then?\" Zabulon asked curiously.\n \"No!\" Gesar shook his head. \"No. Not here. And it\u0027s too late for that... he\u0027s on the alert. We have to strike at him with magic.\"\n Zabulon nodded. Then he suddenly started giggling quietly.\n \"What\u0027s this?\" Gesar asked.\n \"All my life...\" said Zabulon. \"Would you believe it, my old enemy? All my life I\u0027ve dreamed of working in harness with you! Well now I really am... from hatred to love...\"\n \"You really are an absolute goon,\" Gesar said in a quiet voice.\n \"We\u0027re all a bit touched in the head,\" Zabulon giggled. \"Well then? You and me? Or shall we bring in our colleagues? They can pump in Power, and we can be the spearhead, striking the blow.\"\n Gesar shook his head. \"No, Zabulon. We shouldn\u0027t go near Konstantin. I have a different suggestion...\"\n He looked at me.\n I felt at the broken stump of a tooth with my tongue. That was a real drag...\n \"I\u0027m ready, Gesar.\"\n \"Yes, there\u0027s a chance,\" Zabulon said, with a nod of approval. \"Since Kostya still allows sentimental considerations to influence him... the only thing is, will you be able to strike at him, Anton?\"\n I didn\u0027t answer immediately. I had to think about it seriously.\n There was no question of an arrest. I\u0027d have to strike swiftly and surely and kill him. Become the spearhead, the focus of the Power that would be pumped into me by Gesar, Zabulon, Edgar... and maybe other magicians as well. Sure, I was less experienced than the Great Ones. But there was a chance I could get close to Kostya without a fight\n On account of those \"sentimental considerations.\"\n The alternative was simple¡ªthe Great Ones would gather all their Power into a single fist. Even Nadya\u0027s Power would be required¡ªand Gesar would demand that Svetlana initiate our daughter...\n There was no alternative.\n \"I\u0027ll kill Kostya,\" I said.\n \"Wrong,\" Gesar said in a low voice. \"Say it right, watchman!\"\n \"I\u0027ll subdue the vampire,\" I whispered.\n Gesar nodded.\n \"And don\u0027t get all introspective about it, Gorodetsky,\" Zab-ulon added. \"None of your intellectual sniveling. That nice boy Kostya doesn\u0027t exist any more. And he never did. Maybe he hasn\u0027t killed anybody for blood, but he\u0027s still a vampire. Non-life.\"\n Gesar nodded in support.\n I closed my eyes for a moment.\n Non-life.\n He was lacking that thing that we simply call a soul.\n A certain vital component that even we Others can\u0027t define. From early in his childhood¡ªthanks to his parents. As the boy grew up, the doctor in the local clinic had listened to his heart and admired his robust health. He had turned from a boy into a man, and no girl had ever said his lips were cold when she kissed them. He could have had children¡ªperfectly ordinary children with a perfectly ordinary human woman.\n But it was all non-life. It was all borrowed and stolen¡ªand when Kostya died, his body would instantly crumble to dust... because it had already been dead for a long, long time.\n We\u0027re all condemned to death from the moment we\u0027re born.\n But at least we can live until we die.\n \"Leave me alone with Anton,\" Gesar said. \"I\u0027ll try to prepare him.\"\n I heard Zabulon and Edgar stand up. They went out into the corridor. There was a rustling sound¡ªGesar had evidently shielded us against observation. And then he asked, \"Are you suffering?\"\n \"No.\" I shook my head without opening my eyes. \"I\u0027m thinking. Kostya tried not to behave like a vampire, after all...\"\n \"And what conclusions have you reached?\"\n \"He won\u0027t be able to hold on.\" I opened my eyes and looked at Gesar. \"He won\u0027t be able to hold on, he\u0027ll lose control. He\u0027s managed to subdue the physiological need for living blood, but as for all the rest... he\u0027s non-life among the living and that\u0027s a torment to him. Sooner or later Kostya will lose control.\"\n Gesar waited.\n \"He\u0027s already lost control,\" I said. \"When he killed Witezslav and the Inquisitors... one of the Inquisitors was a Light One, right?\"\n Gesar nodded.\n \"I\u0027ll do the right thing,\" I promised. \"I feel sorry for Kostya, but there\u0027s nothing to be done.\"\n \"I have faith in you, Anton,\" Gesar said. \"And now tell me what you really wanted to ask.\"\n \"What keeps you in the Night Watch, boss?\" I asked.\n Gesar smiled.\n \"When you get right down to it, we\u0027re all tarred with the same brush,\" I said. \"We don\u0027t fight the Dark Ones, we fight the ones that even the Dark Ones reject¡ªthe psychopaths, the maniacs, the lawless ones. For obvious reasons there are more of them among the vampires and the werewolves. The Dark Ones do the same... the Day Watch hunts the Light Ones who want to do good to everyone all at once... basically the ones who might reveal our existence to human beings. The Inquisition supposedly stands above the fray, but what it actually does is make sure the Watches don\u0027t take their functions seriously. Make sure the Dark Ones don\u0027t attempt to gain formal control over the human world and the Light Ones don\u0027t try to wipe out the Dark Ones completely... Gesar, the Night Watch and the Day Watch are just two halves of a single whole.\"\n Gesar just looked at me for a while without saying anything.\n \"Were things... deliberately arranged that way?\" I asked. Then I answered my own question. \"Yes, probably. The young ones, the newly initiated Others, might not have accepted a single Watch for Light Ones and Dark Ones: I can\u0027t do that¡ªgo out on patrol with a vampire! I would have been outraged myself... And so two Watches were set up, the lower ranks hunt each other fervently, the leaders plot and scheme¡ªout of sheer boredom¡ªjust to keep up appearances. But it\u0027s a joint leadership.\"\n Gesar sighed and took out a cigar. He cut its tip off and lit it.\n \"And like a fool,\" I muttered, keeping my eyes on Gesar, \"I always used to wonder how we managed to survive at all. The watches of Samara, of Novogorod Veliky, of little Kireevsky village in the Tomsk region. All supposedly independent. But basically, when there\u0027s any kind of problem, they come running to us, to Moscow... Okay, so the arrangement\u0027s not de jure, it\u0027s all de facto¡ªbut the Moscow Watch runs all the Watches in Russia.\"\n \"And in three of the newly independent states...\" Gesar muttered. He blew out a stream of smoke and the smoke gathered together into a dense cloud in midair, instead of dispersing throughout the compartment.\n \"All right, what comes next?\" I asked. \"How do the independent Watches of Russia and, say, Lithuania, interact? Or Russia, Lithuania, the USA, and Uganda? In the human world what happens is clear enough: whoever has the biggest stick and the thickest purse calls the tune. But the Russian Watches are stronger than the American ones! I even think...\"\n \"The strongest Watch is the French one,\" Gesar said in a bored voice. \"Strong, but extremely lazy. An amazing phenomenon. We can\u0027t understand what the reason is¡ªit can\u0027t just be a matter of consuming massive quantities of dry wine and oysters...\"\n \"The Watches are run by the Inquisition,\" I said. \"It doesn\u0027t settle disputes, it doesn\u0027t punish renegades, it runs things. It gives permission for one social experiment or another, it appoints and removes the leaders... it transfers them from Uzbekistan to Moscow... There\u0027s one Inquisition, with two operational agencies. The Night Watch and the Day Watch. And the Inquisition\u0027s only goal is to maintain the existing status quo. Because victory for the Dark Ones or the Light Ones means defeat for the Others in general.\"\n \"And what else, Anton?\" Gesar asked.\n I shrugged.\n \"What else? Nothing else. People get on with their little human lives and enjoy their little human joys. They feed us with their bodies... and provide new Others. The Others who are less ambitious live almost ordinary lives. Only their lives are more prosperous, more healthier, and longer than ordinary people\u0027s. Those who just can\u0027t live without excitement, who long for battles and adventures, a struggle for exalted ideals¡ªthey join the Watches. The ones who are disillusioned with the Watches join the Inquisition.\"\n \"And... ?\" Gesar asked, encouraging me to continue.\n \"What are you doing in the Night Watch, boss?\" I asked. \"Aren\u0027t you sick of it yet... after thousands of years?\"\n \"Let\u0027s just say that after all this time I still enjoy battles and adventures,\" Gesar said. \"Eh?\"\n I shook my head. \"No, Boris Ignatievich, I don\u0027t believe you. I\u0027ve seen you when you\u0027re... different. Too weary. Too disillusioned.\"\n \"Then let\u0027s assume that I\u0027d really like to finish off Zabulon,\" Gesar said calmly.\n I thought for a second. \"That\u0027s not it, either. In hundreds of years one of you would have finished off the other already. Zabulon said that fighting with magic is like swordplay. Well, you\u0027re not fighting with swords, you\u0027re fencing with sports rapiers. You claim a hit, but you don\u0027t make a hole in your opponent.\"\n Gesar nodded and paused before speaking. Another dense stream of tobacco smoke joined the blue-gray cloud. \"What do you think, Anton, is it possible to live for thousands of years and still feel the same pity for people?\"\n \"Pity?\" I queried.\n Gesar nodded.\n \"Precisely pity. Not love¡ªit\u0027s beyond our power to love the entire world. And not admiration¡ªwe know only too well what human beings are like.\"\n \"It probably is possible to pity them,\" I said and nodded. \"But what good is your pity, boss? It\u0027s pointless, barren. Others don\u0027t make the human world any better.\"\n \"We do, Anton. We do, no matter how bad things still are. Trust an old man who\u0027s seen a lot.\"\n \"But even so...\"\n \"I\u0027m waiting for a miracle, Anton.\"\n I looked at Gesar quizzically.\n \"I don\u0027t know exactly what kind of miracle. For all people to acquire the abilities of Others. For all Others to become human again. For a day when the dividing line won\u0027t run between Other and human being, but between good and bad.\" Gesar smiled gently. \"I have absolutely no idea how anything of the sort could ever happen and if it ever will. But if it ever does... I prefer to be on the side of the Night Watch. And not the Inquisition¡ªthe mighty, clever, correct, all-powerful Inquisition.\"\n \"Maybe Zabulon\u0027s waiting for the same thing?\"\n Gesar nodded. \"Maybe. I don\u0027t know. But better an old enemy you know than a young, unpredictable freak. You can call me a conservative, but I prefer rapiers with Zabulon to baseball bats with a progressive Dark Magician.\"\n \"And what would you advise me to do?\"\n Gesar shrugged and spread his hands. \"What advice would I give you? Make up your own mind. You can get out and lead an ordinary life. You can join the Inquisition... I won\u0027t object if you do. Or you can stay in the Night Watch.\"\n \"And wait?\"\n \"And wait. Preserve the part of you that\u0027s still human. Avoid falling into ecstatic raptures and trying to impose the Light on people when they don\u0027t want it. Avoid relapsing into contemptuous cynicism and imagining that you are pure and perfect. That\u0027s the hardest thing of all¡ªnever to become cynical, never to lose faith, never to become indifferent.\"\n \"Not a huge choice...\" I said.\n \"Ha!\" Gesar said, smiling. \"Just be glad that there\u0027s any choice at all.\"\n The suburbs of Saratov flitted by outside the windows. The train was slowing down.\n I was sitting in an empty compartment and watching the spinning pointer.\n Kostya was still following us.\n What was he expecting?\n Arbenin\u0027s voice sang in the earphones:\n From deception to deception\n Only manna pours down from the sky.\n From siesta to siesta\n They feed us only manifestoes.\n Some have gone, some have left.\n I have only made a choice.\n And I sense it with my back:\n We are different, we are other.\n I shook my head. It should be \"We are Others.\" But even if we were to disappear, people would still be divided into people and Others. No matter how those Others were different.\n People can\u0027t get by without Others. Put two people on an uninhabited island, and you\u0027ll have a human being and an Other. And the difference is that an Other is always tormented by his differentness. It\u0027s easier for people. They know they\u0027re people, and that\u0027s what they ought to be. And they all have no choice but to be that way. All of them, forever.\n We stand in the center, We blaze like a fire on an ice-floe And try to warm ourselves, Disguising the means with the goal. Burning through to our souls In meditative solitude.\n The door opened and Gesar came into the compartment. I pulled the earphones out of my ears.\n \"Look.\" Gesar put his palm-held computer on the table. There was a dot crawling across the map on the screen¡ªour train. Gesar glanced at the compass, nodded, and confidently marked a thick line on the screen with his stylus.\n \"What\u0027s that?\" I asked, looking at the square that Kostya\u0027s trajectory was heading for. I guessed the answer myself: \"An airport?\"\n \"Precisely. He\u0027s not hoping for negotiations.\" Gesar laughed. \"He\u0027s making a dash straight for the airport.\"\n \"Is it military?\"\n \"No, civilian. But what\u0027s the difference? He has the piloting templates.\"\n I nodded. For \"backup\" all operational agents carried a collection of useful skills¡ªdriving a car, flying a plane or a helicopter, emergency medical assistance, martial arts... Of course the template didn\u0027t provide perfect skills; an experienced driver would overtake an Other with a driving template, a good doctor would operate far more skillfully. But Kostya could get any kind of aircraft into the air.\n \"Surely that\u0027s a good thing,\" I said. \"We\u0027ll scramble the jet fighters and...\"\n \"What if there are passengers?\" Gesar asked sharply.\n \"It\u0027s still better than the train,\" I said in a quiet voice. \"Fewer casualties.\"\n And that very moment I felt an odd twinge of pain somewhere deep inside. It was the first time I\u0027d ever weighed human casualties on the invisible scales of expediency and decided one pan was lighter than the other.\n \"That\u0027s no good...\" said Gesar, and then added, \"Fortunately. What does he care if the plane\u0027s destroyed? He\u0027ll just transform into a bat and fly down.\"\n The station platform appeared outside the window. The locomotive blew its whistle as it slowed to a halt at the station.\n \"Ground-to-air nuclear missiles,\" I said stubbornly.\n Gesar looked at me in amazement. \"Where from? The nuclear warheads were all removed ages ago. Except for the air defense units around Moscow... but he won\u0027t go to Moscow.\"\n \"Where will he go?\" I asked expectantly.\n \"How should I know? It\u0027s your job to make sure he doesn\u0027t get anywhere,\" Gesar snapped. \"That\u0027s it! He\u0027s stopped!\"\n I looked at the compass. The distance between us and Kostya had started to increase. He\u0027d been flying in the form of a bat, or running along in the form of the Gray Wolf from the fairytale, but now he\u0027d stopped.\n The interesting thing was that Gesar hadn\u0027t even looked at the compass.\n \"The airport,\" Gesar said, sounding pleased. \"Okay, no more talk. Go. Requisition someone with a good car and get to that airport pronto.\"\n \"But...\" I began.\n \"No artifacts, he\u0027ll sense them,\" Gesar retorted calmly. \"And no one else goes with you. He can sense all of us now, you understand? All of us! So move it!\"\n The brakes hissed and the train came to a halt. I paused for a moment in the doorway and heard him say, \"Yes, stick to the Gray Prayer. Don\u0027t make things complicated. We\u0027ll pump you so full of Power he\u0027ll be splattered across the apron.\"\n That was all. Apparently the boss was so fired up I didn\u0027t even have to say anything to him¡ªhe could hear my thoughts before they were formulated in words.\n In the corridor I walked past Zabulon, and couldn\u0027t help shuddering when he gave me an encouraging slap on the shoulder.\n Zabulon didn\u0027t take offense. He just said, \"Good luck, Anton! We\u0027re counting on you!\"\n The passengers were sitting quietly in their compartments. The captain of the train was the only one who watched me go with a glassy stare as he made some announcement into a microphone.\n I opened the door into the lobby at the end of the car, lowered the step and jumped down onto the platform. Everything was moving fast somehow. Too fast...\n There was the usual bustle in the station. A noisy group turnbled out of the next car, and one of them bellowed, \"Now, where are all those grannies with our favorite stuff?\"\n The \"grannies\"¡ªaged from twenty to seventy¡ªwere already hurrying to answer the call. Now there\u0027d be vodka, and beer, and roast chicken legs, and pies with dubious fillings.\n \"Anton!\"\n I swung around. Las was standing beside me with his bag thrown over his shoulder. He had an unlit cigarette in his mouth and an expression of blissful relief on his face.\n \"Are you getting off too?\" Las asked. \"Maybe I can give you a lift somewhere? I\u0027ve got a car waiting.\"\n \"A good car?\" I asked.\n \"I think it\u0027s a Volkswagen.\" Las frowned. \"Is that good enough? Or do you insist on a Cadillac?\"\n I turned my head to look at the windows of the captain\u0027s car. Gesar, Zabulon, and Edgar were watching me.\n \"That\u0027s fine,\" I said glumly. \"Right... I\u0027m sorry. I\u0027m really in a great hurry and I need a car. I turn you toward...\"\n \"Well, let\u0027s get going, why are we standing here, if you\u0027re in such a hurry?\" Las asked, interrupting the standard formula for recruiting volunteers.\n And he slipped into the crowd so smartly that I had no choice but to follow him.\n We forced our way through the mindless, jostling crowd in the station and out onto the square in front of it. I caught up with Las and tapped him on the shoulder:\n \"I turn you...\"\n \"I see it, I see it!\" Las said, totally ignoring me. \"Hi, Roman!\"\n The man who came up to us was quite tall, with a well-fed look, almost like a child¡ªso sleek and well-rounded, with the folds of skin around the wrists and ankles you find on a plump baby. A small mouth with tight little lips and small, inexpressive eyes that looked bored behind his spectacles.\n \"Hello, Alexander,\" this gentleman said in a way that was somehow very formal, holding his hand out smoothly to Las.\n \"This is Anton, my friend, can we give him a lift?\"\n \"Why shouldn\u0027t we give him a lift?\" Roman agreed sadly. \"The wheels go around, it\u0027s a smooth road.\" Then he turned and walked toward a brand-new Volkswagen Bora.\n We followed him and got into the car. I impudently slipped into the front passenger seat. Las cleared his throat loudly, but climbed meekly into the back. Roman switched on the ignition and asked: \"Where do you want to go, Anton?\"\n His speech was as smooth and streamlined as if he wasn\u0027t speaking, but writing the words in the air.\n \"The airport, it\u0027s urgent,\" I said somberly.\n \"Where?\" Roman asked in genuine amazement. He looked at Las. \"Perhaps your friend ought to find a taxi?\"\n Las gave me an embarrassed look. Then he gave Roman an equally embarrassed one.\n \"All right,\" I said. \"I turn you toward the Light. Reject the Darkness, defend the Light. I grant you the vision to distinguish Good from Evil. I grant you the faith to follow the Light. I grant you the courage to battle the Darkness.\"\n Las giggled. And then immediately fell silent.\n It\u0027s not a matter of words, of course. Words can\u0027t change anything, not even if you emphasize every last one of them with a capital letter. It\u0027s like the witches\u0027 spells¡ªa mnemonic formula, a template implanted in my memory. I can simply compel someone to obey me, but this way... this way\u0027s more correct. It brings an old, tried, and tested mechanism into play.\n Roman straightened up and his cheeks even seemed to lose some of their plumpness. A moment ago the person beside me had been an overgrown, capricious infant, but now he was a man. A warrior!\n \"The Light be with you!\" I concluded.\n \"To the airport!\" Roman declared in delight.\n The engine roared and we went tearing off, squeezing every last ounce of power out of the small German car. I\u0027m sure that sports sedan had never really shown what it could do before.\n I closed my eyes and looked through the Twilight¡ªat a pattern of branching colored lines against a background of darkness. Like a crumpled bundle of optical fibers¡ªsome green, some yellow, some red. I\u0027m not the best at reading the lines of probability, but this time I found it surprisingly easy. I was feeling in better shape than I ever had before.\n That meant there was already Power flowing into me. Power from Gesar and Zabulon, Edgar and the Inquisitors. And maybe right now Others were transfixed across Moscow, Light Ones and Dark Ones¡ªthe ones Gesar and Zabulon had the right to draw Power from.\n I\u0027d only ever felt anything like this once before. That time when I drew Power directly out of people.\n \"We go left at the third turn, there\u0027s a traffic jam ahead,\" I said. \"Then we turn right into the yard and out through the archway... into the side street there...\"\n I\u0027d never been in Saratov before, but that didn\u0027t make any difference right now.\n \"Yes sir,\" Roman replied briskly.\n \"Faster!\"\n \"Very well!\"\n I looked at Las. He took out a pack of cigarettes and lit one. The car hurtled through the crowded streets. Roman drove with the wild fury of a tram driver who\u0027s been given a chance to lap Schumacher in a Formula-1 grand prix.\n Las sighed and asked, \"Now what\u0027s going to happen to me? Are you going to take a little flashlight out of your pocket and tell me \u0027it was a marsh gas explosion?\u0027\"\n \"You can see for yourself¡ªno flashlight\u0027s required,\" I said.\n \"But will I stay alive?\" Las persisted.\n \"You will,\" I reassured him. \"Only you won\u0027t remember anything. I\u0027m sorry, but that\u0027s standard procedure.\"\n \"I get it,\" Las said sadly. \"Shit... Why is that always the way? Tell me, since it makes no difference...\"\n The car tore along the side street, bouncing over the potholes. Las stubbed his cigarette out and went on. \"Tell me, who are you?\"\n \"An Other.\"\n \"What sort of other exactly?\"\n \"A magician. Don\u0027t worry¡ªI\u0027m a Light Magician.\"\n \"My, but you\u0027ve grown, Harry Potter...\" Las said. \"What a crazy business. Maybe I\u0027ve just lost my mind?\"\n \"No chance...\" I said, pushing my hands hard against the ceiling. Roman was really going for it, driving straight across some flowerbeds to cut a corner. \"Careful, Roman! We need to move fast, but safely.\"\n \"Then tell me,\" Las persisted. \"Does this car race have anything to do with that abnormally large bat we saw yesterday night?\"\n \"Believe it or not, it does,\" I confirmed. The Power was seething inside me, as intoxicating as champagne. It made me feel like clowning. \"Are you afraid of vampires?\"\n Las took a flask of whisky out of his bag, tore the top off it and took a long swig. Then he said cheerfully, \"Not a bit!\" \n","sourceLink":"https://allnovel.net/twilight-watch-watch-3/page-24.html","bookId":2537,"book":{"id":2537,"title":"Twilight Watch (Watch #3)","description":"Storyline: \n Twilight Watch (Watch, #3) \n Twilight Watch (sometimes translated Dusk Watch) (Russian: Sumerechniy Dozor, Сумеречный Дозор) is a fantasy novel by Russian writer Sergey Lukyanenko. It is the sequel to The Night Watch and Day Watch and the third part of tetralogy that concludes with Final Watch. \n Lukyanenko returns to a structure closer to that he used in the Night Watch novel than the Day Watch novel. Twilight Watch is divided into three stories- Nobody\u0027s Time, Nobody\u0027s Space, and Nobody\u0027s Power. Each story begins with a prologue followed by seven numbered chapters and concluding with an Epilogue. Except for the prologues, the events of each story are written in a first person narrative using the voice of the Light Magician character Anton Gorodetsky, a member of Night Watch. Events in each of the prologues are written in a third person narrative and take place entirely outside of Gordetsky\u0027s presence. The entire novel is written in the past tense.\n \n","cover":"https://allnovel.net/images/twilight-watch-watch-3.jpg","author":"Sergei Lukyanenko","type":"Horror","source":"allnovel","link":"https://allnovel.net/twilight-watch-watch-3.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 5, 2019 11:50:06 PM"}}
