{"id":435,"no":143,"title":"Chapter 71","content":"Dors said, \"That wasnt a very long interview, Hari.\" \n \"I know. The surroundings were terribly unpleasant and I felt I had learned enough. Amazing how these folktales tend to magnify.\" \n \"What do you mean, magnify?\" \n \"Well, the Mycogenians fill their Aurora with human beings who lived for centuries and the Dahlites fill their Earth with a humanity that lived for millions of years. And both talk of a robot that lives forever. Still, it makes one think.\" \n \"As far as millions of years go, theres room for-- Where are we going?\" \n \"Mother Rittah said we go in this direction till we reach a rest area, then follow the sign for CENTRAL WALKWAY, bearing left, and keep on following the sign. Did we pass a rest area on the way in?\" \n \"We may be leaving by a route different from the one we came in. I dont remember a rest area, but I wasnt watching the route. I was keeping my eye on the people we passed and--\" \n Her voice died away. Up ahead the alley swelled outward on both sides. Seldon remembered. They had passed that way. There had been a couple of ratty couch pads resting on the walkway floor on either side. There was, however, no need for Dors to watch passersby going out as she had coming in. There were no passersby. But up ahead in the rest area they spotted a group of men, rather large-sized for Dahlites, mustaches bristling, bare upper arms muscular and glistening under the yellowish indoor light of the walkway. Clearly, they were waiting for the Outworlders and, almost automatically, Seldon and Dors came to a halt. For a moment or two, the tableau held. Then Seldon looked behind him hastily. Two or three additional men had stepped into view. \n Seldon said between his teeth, \"Were trapped. I should not have let you come, Dors.\" \n \"On the contrary. This is why Im here, but was it worth your seeing Mother Rittah?\" \n \"If we get out of this, it was.\" \n Seldon then said in a loud and firm voice, \"May we pass?\" \n One of the men ahead stepped forward. He was fully Seldons height of 1.73 meters, but broader in the shoulders and much more muscular. A bit flabby at the waist, though, Seldon noted. \n \"Im Marron,\" he said with self-satisfied significance, as though the name ought to have meaning, \"and Im here to tell you we dont like Outworlders in our district. You want to come in, all right--but if you want to leave, youll have to pay.\" \n \"Very well. How much?\" \n \"All youve got. You rich Outworlders have credit tiles, right? Just hand them over.\" \n \"No.\" \n \"No point saying no. Well just take them.\" \n \"You cant take them without killing me or hurting me and they wont work without my voiceprint. My normal voiceprint.\" \n \"Thats not so, Master--see, Im being polite--we can take them away from you without hurting you very much.\" \n \"How many of you big strong men will it take? Nine? No.\" Seldon counted rapidly. \"Ten.\" \n \"Just one. Me.\" \n \"With no help?\" \n \"Just me.\" \n \"If the rest of you will clear away and give us room, I would like to see you try it, Marron.\" \n \"You dont have a knife, Master. You want one?\" \n \"No, use yours to make the fight even. Ill fight without one.\" \n Marron looked about at the others and said, \"Hey, this puny guy is a sport. He dont even sound scared. Thats sort of nice. It would be a shame to hurt him. I tell you what, Master. Ill take the girl. If you want me to stop, hand over your credit tile and her tile and use your right voices to activate them. If you say no, then after Im through with the girl ... and thatll take some time\"--he laughed--\"Ill just have to hurt you.\" \n \"No,\" said Seldon. \"Let the woman go. Ive challenged you to a fight--one to one, you with a knife, me without. If you want bigger odds, Ill fight two of you, but let the woman go.\" \n \"Stop, Hari!\" cried out Dors. \"If he wants me, let him come and get me. You stay right where you are, Hari, and dont move.\" \n \"You hear that?\" said Marron, grinning broadly. \" You stay right where you are, Hari, and dont move. I think the little lady wants me. You two, keep him still.\" \n Each of Seldons arms were caught in an iron grip and he felt the sharp point of a knife in his back. \n \"Dont move,\" said a harsh whisper in his ear, \"and you can watch. The lady will probably like it. Marrons pretty good at this.\" \n Dors called out again. \"Dont move, Hari!\" She turned to face Marron watchfully, her half-closed hands poised near her belt. \n He closed in on her purposefully and she waited till he had come within arms length, when suddenly her own arms flashed and Marron found himself facing two large knives. \n For a moment, he leaned backward and then he laughed. \"The little lady has two knives--knives like the big boys have. And Ive only got one. But thats fair enough.\" His knife was swiftly out. \"I hate to have to cut you, little lady, because it will be more fun for both of us if I dont. Maybe I can just knock them out of your hands, huh?\" \n Dors said, \"I dont want to kill you. Ill do all I can to avoid doing so. Just the same, I call on all to witness, that if I do kill you, it is to protect my friend, as I am honor-bound to do.\" \n Marron pretended to be terrified. \"Oh, please dont kill me, little lady.\" Then he burst into laughter and was joined by the other Dahlites present. Marron lunged with his knife, quite wide of the mark. He tried it again, then a third time, but Dors never budged. She made no attempt to fend off any motion that was not truly aimed at her. \n Marrons expression darkened. He was trying to make her respond with panic, but he was only making himself seem ineffectual. The next lunge was directly at her and Dorss left-hand blade moved flashingly and caught his with a force that pushed his arm aside. Her right-hand blade flashed inward and made a diagonal slit in his T-shirt. A thin bloody line smeared the dark-haired skin beneath. Marron looked down at himself in shock as the onlookers gasped in surprise. \n Seldon felt the grip on him weaken slightly as the two who held him were distracted by a duel not going quite as they had expected. He tensed himself. \n Now Marron lunged again and this time his left hand shot outward to enclose Dorss right wrist. Again Dorss left-hand blade caught his knife and held it motionless, while her right hand twisted agilely and drew downward, even as Marrons left hand closed upon it. It closed on nothing but the blade and when he opened his hand there was a bloody line down the palm. \n Dors sprang back and Marron, aware of the blood on his chest and hand, roared out chokingly, \"Someone toss me another knife!\" There was hesitation and then one of the onlookers tossed his own knife underhanded. Marron reached for it, but Dors was quicker. Her right-hand blade struck the thrown knife and sent it flying backward, whirling as it went. \n Seldon felt the grips on his arms weaken further. He lifted them suddenly, pushing up and forward, and was free. His two captors turned toward him with a sudden shout, but he quickly kneed one in the groin and elbowed the other in the solar plexus and both went down. \n He knelt to draw the knives of each and rose as double-armed as Dors. Unlike Dors, Seldon did not know how to handle the blades, but he knew the Dahlites would scarcely be aware of that. \n Dors said, \"Just keep them off, Hari. Dont attack yet.--Marron, my next stroke will not be a scratch.\" \n Marron, totally enraged, roared incoherently and charged blindly, attempting by sheer kinetic energy to overwhelm his opponent. Dors, dipping and sidestepping, ducked under his right arm, kicked her foot against his right ankle, and down he crashed, his knife flying. \n She then knelt, placed one blade against the back of his neck and the other against his throat, and said, \"Yield!\" \n With another yell, Marron struck out against her with one arm, pushed her to one side, then scrambled to his feet. \n He had not yet stood up completely when she was upon him, one knife slashing downward and hacking away a section of his mustache. This time he yowled like a large animal in agony, clapping his hand to his face. When he drew it away, it was dripping blood. \n Dors shouted, \"It wont grow again, Marron. Some of the lip went with it. Attack once more and youre dead meat.\" \n She waited, but Marron had had enough. He stumbled away, moaning, leaving a trail of blood. \n Dors turned toward the others. The two that Seldon had knocked down were still lying there, unarmed and not anxious to get up. She bent down, cut their belts with one of her knives and then slit their trousers. \"This way, youll have to hold your pants up when you walk,\" she said. She stared at the seven men still on their feet, who were watching her with awestruck fascination. \"And which of you threw the knife?\" \n There was silence. \n She said, \"It doesnt matter to me. Come one at a time or all together, but each time I slash, someone dies.\" \n And with one accord, the seven turned and scurried away. Dors lifted her eyebrows and said to Seldon, \"This time, at least, Hummin cant complain that I failed to protect you.\" \n Seldon said, \"I still cant believe what I saw. I didnt know you could do anything like that--or talk like that either.\" \n Dors merely smiled. \"You have your talents too. We make a good pair. Here, retract your knife blades and put them into your pouch. I think the news will spread with enormous speed and we can get out of Billibotton without fear of being stopped.\" \n She was quite right. \n Undercover \n DAVAN-- ... In the unsettled times marking the final centuries of the First Galactic Empire, the typical sources of unrest arose from the fact that political and military leaders jockeyed for \"supreme\" power (a supremacy that grew more worthless with each decade). Only rarely was there anything that could be called a popular movement prior to the advent of psychohistory. In this connection, one intriguing example involves Davan, of whom little is actually known, but who may have met with Hari Seldon at one time when ... \n ENCYCLOPEDIA GALACTICA \n \n \n","sourceLink":"http://novel.tingroom.com/kehuan/1560/46454.html","bookId":12,"book":{"id":12,"title":"基地系列 Prelude to Foundation 基地前奏","description":"简介： 故事倒回哈里谢顿二十多岁首次踏足川陀和发展心理史学的经过。本书是一本长篇小说，内分19 章，主要讲述谢顿在川陀的历险过程。阿西莫夫写作本书的目的是为了要统一其笔下三大系列小说机器人、银河帝国和基地。本书出现了艾氏最出名的机器人学三(四)大法则和机器人系列...","cover":"http://novel.tingroom.com/file/upload/201605/18/15-03-30-81-1.jpg","type":"双语小说","link":"http://novel.tingroom.com/kehuan/1560","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:22:58 AM"}}
