{"id":449,"no":157,"title":"Chapter 78","content":"Casilia Tisalver stood ramrod straight with a tight smile on her round face and her dark eyes glinting. Her husband was leaning moodily against the wall. In the center of the room were two men who were standing stiffly upright, as though they had noticed the cushions on the floor but scorned them. Both had the dark crisp hair and the chick black mustache to be expected of Dahlites. Both were thin and both were dressed in dark clothes so nearly alike that they were surely uniforms. There was thin white piping up and over the shoulders and down the sides of the tubular trouser legs. Each had, on the right side of his chest, a rather dim Spaceship-and-Sun, the symbol of the Galactic Empire on every inhabited world of the Galaxy, with, in this case, a dark \"D\" in the center of the sun. \\n\\n Seldon realized immediately that these were two members of the Dahlite security forces. \\n\\n \"Whats all this?\" said Seldon sternly. \\n\\n One of the men stepped forward. \"I am Sector Officer Lanel Russ. This is my partner, Gebore Astinwald.\" \\n\\n Both presented glittering identification holo-tabs. Seldon didnt bother looking at them. \"What it is you want?\" \\n\\n Russ said calmly, \"Are you Hari Seldon of Helicon?\" \\n\\n \"I am.\" \\n\\n \"And are you Dors Venabili of Cinna, Mistress?\" \\n\\n \"I am,\" said Dors. \\n\\n \"Im here to investigate a complaint that one Hari Seldon instigated a riot yesterday.\" \\n\\n \"I did no such thing,\" said Seldon. \\n\\n \"Our information is,\" said Russ, looking at the screen of a small computer pad, \"that you accused a newsman of being an Imperial agent, thus instigating a riot against him.\" \\n\\n Dors said, \"It was I who said he was an Imperial agent, Officer. I had reason to think he was. It is surely no crime to express ones opinion. The Empire has freedom of speech.\" \\n\\n \"That does not cover an opinion deliberately advanced in order to instigate a riot.\" \\n\\n \"How can you say it was, Officer?\" \\n\\n At this point, Mistress Tisalver interposed in a shrill voice, \"I can say it, Officer. She saw there was a crowd present, a crowd of gutter people who were just looking for trouble. She deliberately said he was an Imperial agent when she knew nothing of the sort and she shouted it to the crowd to stir them up. It was plain that she knew what she was doing.\" \\n\\n \"Casilia,\" said her husband pleadingly, but she cast one look at him and he said no more. \\n\\n Russ turned to Mistress Tisalver. \"Did you lodge the complaint, Mistress?\" \\n\\n \"Yes. These two have been living here for a few days and theyve done nothing but make trouble. Theyve invited people of low reputation into my apartment, damaging my standing with my neighbors.\" \\n\\n \"Is it against the law, Officer,\" asked Seldon, \"to invite clean, quiet citizens of Dahl into ones room? The two rooms upstairs are our rooms. We have rented them and they are paid for. Is it a crime to speak to Dahlites in Dahl, Officer?\" \\n\\n \"No, it is not,\" said Russ. \"That is not part of the complaint. What gave you reason, Mistress Venabili, to suppose the person you so accused was, in fact, an Imperial agent?\" \\n\\n Dors said, \"He had a small brown mustache, from which I concluded he was not a Dahlite. I surmised he was an Imperial agent.\" \\n\\n \"You surmised? Your associate, Master Seldon, has no mustache at all. Do you surmise he is an Imperial agent?\" \\n\\n \"In any case,\" said Seldon hastily, \"there was no riot. We asked the crowd to take no action against the supposed newsman and Im sure they didnt.\" \\n\\n \"Youre sure, Master Seldon?\" said Russ. \"Our information is that you left immediately after making your accusation. How could you witness what happened after you left?\" \\n\\n \"I couldnt,\" said Seldon, \"but let me ask you--Is the man dead? Is the man hurt?\" \\n\\n \"The man has been interviewed. He denies he is an Imperial agent and we have no information that he is. He also claims he was handled roughly.\" \\n\\n \"He may well be lying in both respects,\" said Seldon. \"I would suggest a Psychic Probe.\" \\n\\n \"That cannot be done on the victim of a crime,\" said Russ. \"The sector government is very firm on that. It might do if you two, as the criminals in this case, each underwent a Psychic Probe. Would you like us to do that?\" \\n\\n Seldon and Dors exchanged glances for a moment, then Seldon said, \"No, of course not.\" \\n\\n \"Of course not,\" repeated Russ with just a tinge of sarcasm in his voice, \"but youre ready enough to suggest it for someone else.\" The other officer, Astinwald, who had so far not said a word, smiled at this. Russ said, \"We also have information that two days ago you engaged in a knife fight in Billibotton and badly hurt a Dahlite citizen named\"--he struck a button on his computer pad and studied the new page on the screen--\"Elgin Marron.\" \\n\\n Dors said, \"Does your information tell you how the fight started?\" \\n\\n \"That is irrelevant at the moment, Mistress. Do you deny that the fight took place?\" \\n\\n \"Of course we dont deny the fight took place,\" said Seldon hotly, \"but we deny that we in any way instigated that. We were attacked. Mistress Venabili was seized by this Marron and it was clear he was attempting to rape her. What happened afterward was pure self-defense. Or does Dahl condone rape?\" \\n\\n Russ said with very little intonation in his voice, \"You say you were attacked? By how many?\" \\n\\n \"Ten men.\" \\n\\n \"And you alone--with a woman--defended yourself against ten men?\" \\n\\n \"Mistress Venabili and I defended ourselves. Yes.\" \\n\\n \"How is it, then, that neither of you shows any damage whatever? Are either of you cut or bruised where it doesnt show right now?\" \\n\\n \"No, Officer.\" \\n\\n \"How is it, then, that in the fight of one--plus a woman--against ten, you are in no way hurt, but that the complainant, Elgin Marron, has been hospitalized with wounds and will require a skin transplant on his upper lip?\" \\n\\n \"We fought well,\" said Seldon grimly. \\n\\n \"Unbelievably well. What would you say if I told you that three men have testified that you and your friend attacked Marron, unprovoked?\" \\n\\n \"I would say that it belies belief that we should. Im sure that Marron has a record as a brawler and knifeman. I tell you that there were ten there. Obviously, six refused to swear to a lie. Do the other three explain why they did not come to the help of their friend if they witnessed him under unprovoked attack and in danger of his life? It must be clear to you that they are lying.\" \\n\\n \"Do you suggest a Psychic Probe for them?\" \\n\\n \"Yes. And before you ask, I still refuse to consider one for us.\" \\n\\n Russ said, \"We have also received information that yesterday, after leaving the scene of the riot, you consulted with one Davan, a known subversive who is wanted by the security police. Is that true?\" \\n\\n \"Youll have to prove that without help from us,\" said Seldon. \"Were not answering any further questions.\" \\n\\n Russ put away his pad. \"Im afraid I must ask you to come with us to headquarters for further interrogation.\" \\n\\n \"I dont think thats necessary, Officer,\" said Seldon. \"We are Outworlders who have done nothing criminal. We have tried to avoid a newsman who was annoying us unduly, we tried to protect ourselves against rape and possible murder in a part of the sector known for criminal behavior, and weve spoken to various Dahlites. We see nothing there to warrant our further questioning. It would come under the heading of harassment.\" \\n\\n \"We make these decisions,\" said Russ. \"Not you. Will you please come with us?\" \\n\\n \"No, we will not,\" said Dors. \\n\\n \"Watch out!\" cried out Mistress Tisalver. \"Shes got two knives.\" \\n\\n Officer Russ sighed and said, \"Thank you, Mistress, but I know she does.\" He turned to Dors. \"Do you know its a serious crime to carry a knife without a permit in this sector? Do you have a permit?\" \\n\\n \"No, Officer, I dont.\" \\n\\n \"It was clearly with an illegal knife, then, that you assaulted Marron? Do you realize that that greatly increases the seriousness of the crime?\" \\n\\n \"It was no crime, Officer,\" said Dors. \"Understand that. Marron had a knife as well and no permit, I am certain.\" \\n\\n \"We have no evidence to that effect and while Marron has knife wounds, neither of you have any.\" \\n\\n \"Of course he had a knife, Officer. If you dont know that every man in Billibotton and most men elsewhere in Dahl carry knives for which they probably dont have permits, then youre the only man in Dahl who doesnt know. There are shops here wherever you turn that sell knives openly. Dont you know that?\" \\n\\n Russ said, \"It doesnt matter what I know or dont know in this respect. Nor does it matter whether other people are breaking the law or how many of them do. All that matters at this moment is that Mistress Venabili is breaking the anti-knife law. I must ask you to give up those knives to me right now, Mistress, and the two of you must then accompany me to headquarters.\" \\n\\n Dors said, \"In that case, take my knives away from me.\" \\n\\n Russ sighed. \"You must not think, Mistress, that knives are all the weapons there are in Dahl or that I need engage you in a knife fight. Both my partner and I have blasters that will destroy you in a moment, before you can drop your hands to your knife hilt--however fast you are. We wont use a blaster, of course, because we are not here to kill you. However, each of us also has a neuronic whip, which we can use on you freely. I hope you wont ask for a demonstration. It wont kill you, do you permanent harm of any kind, or leave any marks--but the pain is excruciating. My partner is holding a neuronic whip on you right now. And here is mine.--Now, let us have your knives, Mistress Venabili.\" \\n\\n There was a moments pause and then Seldon said, \"Its no use, Dors. Give him your knives.\" \\n\\n And at that moment, a frantic pounding sounded at the door and they all heard a voice raised in high-pitched expostulation. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/kehuan/1560/46468.html","bookId":12,"book":{"id":12,"title":"基地系列 Prelude to Foundation 基地前奏","description":"简介： 故事倒回哈里谢顿二十多岁首次踏足川陀和发展心理史学的经过。本书是一本长篇小说，内分19 章，主要讲述谢顿在川陀的历险过程。阿西莫夫写作本书的目的是为了要统一其笔下三大系列小说机器人、银河帝国和基地。本书出现了艾氏最出名的机器人学三(四)大法则和机器人系列...","cover":"http://novel.tingroom.com/file/upload/201605/18/15-03-30-81-1.jpg","type":"双语小说","link":"http://novel.tingroom.com/kehuan/1560","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:22:58 AM"}}
