{"id":369,"no":77,"title":"Chapter 38","content":"Seldon looked with some distress at their quarters. It had a small but individual kitchen and a small but individual bathroom. There were two narrow beds, two clothes closets, a table, and two chairs. In short there was everything that was necessary for two people who were willing to live under cramped conditions. \"We had an individual kitchen and bathroom at Cinna,\" said Dors with an air of resignation. \"Not I,\" said Seldon. \"Helicon may be a small world, but I lived in a modern city. Community kitchens and bathrooms.--What a waste this is. You might expect it in a hotel, where one is compelled to make a temporary stay, but if the whole sector is like this, imagine the enormous number and duplications of kitchens and bathrooms.\" \"Part of the egalitarianism, I suppose,\" said Dors. \"No fighting for favored stalls or for faster service. The same for everyone.\" \"No privacy either. Not that I mind terribly, Dors, but you might and I dont want to give the appearance of taking advantage. We ought to make it clear to them that we must have separate rooms--adjoining but separate.\" Dors said, \"Im sure it wont work. Space is at a premium and I think they are amazed by their own generosity in giving us this much. Well just make do, Hari. Were each old enough to manage. Im not a blushing maiden and youll never convince me that youre a callow youth.\" \"You wouldnt be here, were it not for me.\" \"What of it? Its an adventure.\" \"All right, then. Which bed will you take? Why dont you take the one nearer the bathroom?\" He sat down on the other. \"Theres something else that bothers me. As long as were here, were tribespeople, you and I, as is even Hummin. Were of the other tribes, not their own cohorts, and most things are none of our business.--But most things are my business. Thats what Ive come here for. I want to know some of the things they know.\" \"Or think they know,\" said Dors with a historians skepticism. \"I understand they have legends that are supposed to date back to primordial times, but I cant believe they can be taken seriously.\" \"We cant know that until we find out what those legends are. Are there no outside records of them?\" \"Not that I know of. These people are terribly ingrown. Theyre almost psychotic in their inward clinging. That Hummin can break down their barriers somewhat and even get them to take us in is remarkable--really remarkable.\" Seldon brooded. \"There has to be an opening somewhere. Sunmaster was surprised--angry, in fact--that I didnt know Mycogen was an agricultural community. That seems to be something they dont want kept a secret.\" \"The point is, it isnt a secret. Mycogen is supposed to be from archaic words meaning yeast producer. At least, thats what Ive been told. Im not a paleolinguist. In any case, they culture all varieties of microfood--yeast, of course, along with algae, bacteria, multicellular fungi, and so on.\" \"Thats not uncommon,\" said Seldon. \"Most worlds have this microculture. We have some even on Helicon.\" \"Not like Mycogen. Its their specialty. They use methods as archaic as the name of their section--secret fertilizing formulas, secret environmental influences. Who knows what? All is secret.\" \"Ingrown?\" \"With a vengeance. What it amounts to is that they produce protein and subtle flavoring, so that their microfood isnt like any other in the world. They keep the volume comparatively low and the price is skyhigh. Ive never tasted any and Im sure you havent, but it sells in great quantities to the Imperial bureaucracy and to the upper classes on other worlds. Mycogen depends on such sales for its economic health, so they want everyone to know that they are the source of this valuable food. That, at least, is no secret.\" \"Mycogen must be rich, then.\" \"Theyre not poor, but I suspect that its not wealth theyre after. Its protection. The Imperial government protects them because, without them, there wouldnt be these microfoods that add the subtlest flavors, the tangiest spices, to every dish. That means that Mycogen can maintain its odd way of life and be haughty toward its neighbors, who probably find them insupportable.\" Dors looked about. \"They live an austere life. Theres no holovision, I notice, and no book-films.\" \"I noticed one in the closet up on the shelf.\" Seldon reached for it, stared at the label, and then said in clear disgust, \"A cookbook.\" Dors held out her hand for it and manipulated the keys. It took a while, for the arrangement was not quite orthodox, but she finally managed to light the screen and inspect the pages. She said, \"There are a few recipes, but for the most part this seems to consist of philosophical essays on gastronomy.\" She shut it off and turned it round and about. \"It seems to be a single unit. I dont see how one would eject the microcard and insert another. A one-book scanner. Now thats a waste.\" \"Maybe they think this one book-film is all anyone needs.\" He reached toward the end table that was between the two beds and picked up another object. \"This could be a speaker, except that theres no screen.\" \"Perhaps they consider the voice sufficient.\" \"How does it work, I wonder?\" Seldon lifted it and looked at it from different sides. \"Did you ever see anything like this?\" \"In a museum once--if this is the same thing. Mycogen seems to keep itself deliberately archaic. I suppose they consider that another way of separating themselves from the so-called tribesmen that surround them in overwhelming numbers. Their archaism and odd customs make them indigestible, so to speak. Theres a kind of perverse logic to all that.\" Seldon, still playing with the device, said, \"Whoops! It went on. Or something went on. But I dont hear anything.\" Dors frowned and picked up a small felt-lined cylinder that remained behind on the end table. She put it to her ear. \"Theres a voice coming out of this,\" she said. \"Here, try it.\" She handed it to him. Seldon did so and said, \"Ouch! It clips on.\" He listened and said, \"Yes, it hurt my ear. You can hear me, I take it.--Yes, this is our room. No, I dont know its number. Dors, have you any idea of the number?\" Dors said, \"Theres a number on the speaker. Maybe that will do.\" \"Maybe,\" said Seldon doubtfully. Then he said into the speaker, \"The number on this device is 6LT-3648A. Will that do?--Well, where do I find out how to use this device properly and how to use the kitchen, for that matter?--What do you mean, It all works the usual way? That doesnt do me any good. See here, Im a ... a tribesman, an honored guest. I dont know the usual way.--Yes, Im sorry about my accent and Im glad you can recognize a tribesman when you hear one. My name is Hari Seldon.\" There was a pause and Seldon looked up at Dors with a longsuffering expression on his face. \"He has to look me up. And I suppose hell tell me he cant find me.--Oh, you have me? Good! In that case, can you give me the information?--Yes. Yes.--Yes.--And how can I call someone outside Mycogen?--Oh, then what about contacting Sunmaster Fourteen, for instance?--Well, his assistant then, his aide, whatever?--Uh-huh.--Thank you.\" He put the speaker down, unhooked the hearing device from his ear with a little difficulty, turned the whole thing off, and said, \"Theyll arrange to have someone show us anything we need to know, but he cant promise when that might be. You cant call outside Mycogen--not on this thing anyway--so we couldnt get Hummin if we needed him. And if I want Sunmaster Fourteen, Ive got to go through a tremendous rigmarole. This may be an egalitarian society, but there seem to be exceptions that I bet no one will openly admit.\" He looked at his watch. \"In any case, Dors, Im not going to view a cookbook and still less am I going to view learned essays. My watch is still telling University time, so I dont know if its officially bedtime and at the moment I dont care. Weve been awake most of the night and I would like to sleep.\" \"Thats all right with me. Im tired too.\" \"Thanks. And whenever a new day starts after weve caught up on our sleep, Im going to ask for a tour of their microfood plantations.\" Dors looked startled. \"Are you interested?\" \"Not really, but if thats the one thing theyre proud of, they should be willing to talk about it and once I get them into a talking mood then, by exerting all my charm, I may get them to talk about their legends too. Personally, I think thats a clever strategy.\" \"I hope so,\" said Dors dubiously, \"but I think that the Mycogenians will not be so easily trapped.\" \"Well see,\" said Seldon grimly. \"I mean to get those legends.\"","sourceLink":"http://novel.tingroom.com/kehuan/1560/46310.html","bookId":12,"book":{"id":12,"title":"基地系列 Prelude to Foundation 基地前奏","description":"简介： 故事倒回哈里谢顿二十多岁首次踏足川陀和发展心理史学的经过。本书是一本长篇小说，内分19 章，主要讲述谢顿在川陀的历险过程。阿西莫夫写作本书的目的是为了要统一其笔下三大系列小说机器人、银河帝国和基地。本书出现了艾氏最出名的机器人学三(四)大法则和机器人系列...","cover":"http://novel.tingroom.com/file/upload/201605/18/15-03-30-81-1.jpg","type":"双语小说","link":"http://novel.tingroom.com/kehuan/1560","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:22:58 AM"}}
