[{"id":2424,"title":"Casino Royale (James Bond #1)","description":"Storyline: \n Casino Royale (James Bond (Original Series) #1) \n In the first of Ian Fleming\u0027s James Bond novels, 007 declares war on Le Chiffre, French communist and paymaster of the Soviet murder organization SMERSH. \n The battle begins with a fifty-million-franc game of baccarat, gains momentum during Bond\u0027s fiery love affair with a sensuous lady spy, and reaches a chilling climax with fiendish torture at the hands of a master sadist. For incredible suspense, unexpected thrills, and extraordinary danger, nothing can beat James Bond in his inaugural adventure.\n \n","cover":"https://allnovel.net/images/casino-royale-james-bond-1.jpg","author":"Ian Fleming","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2425,"title":"Live and Let Die (James Bond #2)","description":"Storyline: \n Live and Let Die (James Bond (Original Series) #2) \n \"Her hair was black and fell to her shoulders. She had high cheekbones and a sensual mouth, and wore a dress of white silk. Her eyes were blue, alight and disdainful, but, as they gazed into his with a touch of humour, Bond realized that they contained a message. Solitaire watched his eyes on her and nonchalantly drew her forearms together so that the valley between her breasts deepened. The message was unmistakable.\" \n Beautiful, fortune-telling Solitaire is the prisoner (and tool) of Mr Big—master of fear, artist in crime and Voodoo Baron of Death. James Bond has no time for superstition—he knows that this criminal heavy hitter is also a top SMERSH operative and a real threat. More than that, after tracking him through the jazz joints of Harlem, to the everglades and on to the Caribbean, 007 has realized that Big is one of the most dangerous men that he has ever faced. And no-one, not even the mysterious Solitaire, can be sure how their battle of wills is going to end…\n \n","cover":"https://allnovel.net/images/live-and-let-die-james-bond-2.jpg","author":"Ian Fleming","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2426,"title":"Moonraker (James Bond #3)","description":"Storyline: \n Moonraker (James Bond (Original Series) #3) \n Moonraker, Britain\u0027s new ICBM-based national defense system, is ready for testing, but something\u0027s not quite right. At M\u0027s request, Bond begins his investigation with Sir Hugo Drax, the leading card shark at M\u0027s club, who is also the head of the Moonraker project. But once Bond delves deeper into the goings-on at the Moonraker base, he discovers that both the project and its leader are something other than they appear to be.\n \n","cover":"https://allnovel.net/images/moonraker-james-bond-3.jpg","author":"Ian Fleming","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2427,"title":"Diamonds Are Forever (James Bond #4)","description":"Storyline: \n Diamonds Are Forever (James Bond (Original Series) #4) \n \"Listen, Bond,\" said Tiffany Case. \"It’d take more than Crabmeat Ravigotte to get me into bed with a man. In any event, since it’s your check, I’m going to have caviar, and what the English call “cutlets”, and some pink champagne. I don’t often date a good-looking Englishman and the dinner’s going to live up to the occasion.\" \n Meet Tiffany Case, a cold, gorgeous, devil-may-care blonde; the kind of girl you could get into a lot of trouble with—if you wanted. She stands between James Bond and the leaders of a diamond-smuggling ring that stretches from Africa via London to the States. Bond uses her to infiltrate this gang, but once in America the hunter becomes the hunted. Bond is in real danger until help comes from an unlikely quarter, the ice-maiden herself …\n \n","cover":"https://allnovel.net/images/diamonds-are-forever-james-bond-4.jpg","author":"Ian Fleming","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2428,"title":"The Spy Who Loved Me (James Bond #10)","description":"Storyline: \n The Spy Who Loved Me (James Bond (Original Series) #10) \n ‘He was about six feet tall, slim and fit. The eyes in the lean , slightly tanned face were a very clear grey-blue and as they observed the men they were cold and watchful. His good looks had a dangerous, almost cruel quality that had frightened me. But now I knew he could smile, I thought his face exciting, in a way no face had ever excited me before …’ \n Vivienne Michel is in trouble. Trying to escape her tangled past, she has run away to the American backwoods, winding up at the Dreamy Pines Motor Court. A far cry from the privileged world she was born to, the motel is also the destination of two hardened killers—the perverse Sol Horror and the deadly Sluggsy Morant. When a coolly charismatic Englishman turns up, Viv, in terrible danger, is not just hopeful, but fascinated. Because he is James Bond, 007; the man she hopes will save her, the spy she hopes will love her …\n \n","cover":"https://allnovel.net/images/the-spy-who-loved-me-james-bond-10.jpg","author":"Ian Fleming","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2429,"title":"The Caves of Steel (Robot #1)","description":"Storyline: \n The Caves of Steel (Robot #1) \n A millennium into the future two advancements have altered the course of human history: the colonization of the galaxy and the creation of the positronic brain. Isaac Asimov\u0027s \"Robot\" novels chronicle the unlikely partnership between a New York City detective and a humanoid robot who must learn to work together. Like most people left behind on an over-populated Earth, New York City police detective Elijah Baley had little love for either the arrogant Spacers or their robotic companions. But when a prominent Spacer is murdered under mysterious circumstances, Baley is ordered to the Outer Worlds to help track down the killer. The relationship between Life and his Spacer superiors, who distrusted all Earthmen, was strained from the start. Then he learned that they had assigned him a partner: R. Daneel Olivaw. Worst of all was that the \" R\" stood for robot--and his positronic partner was made in the image and likeness of the murder victim\n \n","cover":"https://allnovel.net/images/the-caves-of-steel-robot-1.jpg","author":"Isaac Asimov","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2430,"title":"The Naked Sun (Robot #2)","description":"Storyline: \n The Naked Sun (Robot #2) \n A millennium into the future, two advancements have altered the course of human history: the colonization of the Galaxy and the creation of the positronic brain. \n On the beautiful Outer World planet of Solaria, a handful of human colonists lead a hermit-like existence, their every need attended to by their faithful robot servants. To this strange and provocative planet comes Detective Elijah Baley, sent from the streets of New York with his positronic partner, the robot R. Daneel Olivaw, to solve an incredible murder that has rocked Solaria to its foundations. The victim had been so reclusive that he appeared to his associates only through holographic projection. Yet someone had gotten close enough to bludgeon him to death while robots looked on. Now Baley and Olivaw are faced with two clear impossibilities: Either the Solarian was killed by one of his robots--unthinkable under the laws of Robotics--or he was killed by the woman who loved him so much that she never came into his presence!\n \n","cover":"https://allnovel.net/images/the-naked-sun-robot-2.jpg","author":"Isaac Asimov","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2431,"title":"The Robots of Dawn (Robot #3)","description":"Storyline: \n The Robots of Dawn (Robot #3) \n A millennium into the future two advances have altered the course of human history: the colonization of the Galaxy and the creation of the positronic brain. Isaac Asimov\u0027s Robot novels chronicle the unlikely partnership between a New York City detective and a humanoid robot who must learn to work together. \n Detective Elijah Baiey is called to the Spacer world Aurora to solve a bizarre case of roboticide. The prime suspect is a gifted roboticist who had the means, the motive, and the opportunity to commit the crime. There\u0027s only one catch: Baley and his positronic partner, R. Daneel Olivaw, must prove the man innocent. For in a case of political intrigue and love between woman and robot gone tragically wrong, there\u0027s more at stake than simple justice. This time Baley\u0027s career, his life, and Earth\u0027s right to pioneer the Galaxy lie in the delicate balance.\n \n","cover":"https://allnovel.net/images/the-robots-of-dawn-robot-3.jpg","author":"Isaac Asimov","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}}]
