[{"id":2323,"title":"Eight Million Ways to Die (Matthew Scudder #5)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eEight Million Ways to Die (Matthew Scudder #5) \u003c/p\u003e\n \u003cp\u003eNobody knows better than Matthew Scudder how far down a person can sink in this city. A young prostitute named Kim knew it also—and she wanted out. Maybe Kim didn\u0027t deserve the life fate had dealt her. She surely didn\u0027t deserve her death. The alcoholic ex-cop turned p.i. was supposed to protect her, but someone slashed her to ribbons on a crumbling New York City waterfront pier. Now finding Kim\u0027s killer will be Scudder\u0027s penance. But there are lethal secrets hiding in the slain hooker\u0027s past that are far dirtier than her trade. And there are many ways of dying in this cruel and dangerous town—some quick and brutal ... and some agonizingly slow.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/eight-million-ways-to-die-matthew-scudder-5.jpg","author":"Lawrence Block","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2324,"title":"When the Sacred Ginmill Closes (Matthew Scudder #6)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eWhen the Sacred Ginmill Closes (Matthew Scudder #6) \u003c/p\u003e\n \u003cp\u003eThese were the dark days for Matthew Scudder. An ex-New York cop, he had drowned his career in booze. Now he was drinking away his life in a succession of seedy establishments that opened early and closed late, reduced to doing paid \"favors\" for the cronies who gathered with him to worship the bottle. \u003c/p\u003e\n \u003cp\u003eNow, in a sad and lonely place like so many before it, opportunity comes knocking — a chance to help the ginmil\u0027s owner recover his stolen doctored financial records; a chance to help out a drinking buddy accused of murdering his wife. But when cases flow together in dangerous and disturbing ways — like the nightmare images in a drunkard\u0027s delirium — it\u0027s time for Scudder to change his priorities: to staying sober...and staying alive.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/when-the-sacred-ginmill-closes-matthew-scudder-6.jpg","author":"Lawrence Block","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2325,"title":"Out on the Cutting Edge (Matthew Scudder #7)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eOut on the Cutting Edge (Matthew Scudder #7) \u003c/p\u003e\n \u003cp\u003eIt isn\u0027t called Hell\u0027s Kitchen for nothing - a gritty landscape of dark doorways and dirty alleys inhabited by crack addicts and the homeless. For Matt Scudder, it\u0027s a city gone mad, but a city he can\u0027t leave as he\u0027s been hired to find missing would-be actress Paula Hoeldtke.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/out-on-the-cutting-edge-matthew-scudder-7.jpg","author":"Lawrence Block","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2326,"title":"A Ticket to the Boneyard (Matthew Scudder #8)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eA Ticket to the Boneyard (Matthew Scudder #8) \u003c/p\u003e\n \u003cp\u003eThe streets of New York are never safe, but the release of James Leo Motley, a psychopath who went down swearing revenge on Matt Scudder on all who knew him, means death is out there looking for a victim. No-one is safe - friends, lovers or just those unfortunate enough to share the same name.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/a-ticket-to-the-boneyard-matthew-scudder-8.jpg","author":"Lawrence Block","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2327,"title":"A Dance at the Slaughter House (Matthew Scudder #9)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eA Dance At The Slaughterhouse (Matthew Scudder #9) \u003c/p\u003e\n \u003cp\u003eA Dance At The SlaughterhouseIn Matt Scudder\u0027s mind, money, power, and position elevate nobody above morality and the law. Now the ex-cop and unlicensed p.i. has been hired to prove that socialite Richard Thurman orchestrated the brutal murder of his beautiful, pregnant wife. During Scudder\u0027s hard drinking years, he left a piece of his soul on every seedy corner of the Big Apple. But this case is more depraved and more potentially devastating than anything he experienced while floundering in the urban depths. Because this investigation is leading Scudder on a frightening grand tour of New York\u0027s sex-for-sale underworld -- where an innocent young life is simply a commodity to be bought and perverted ... and then destroyed.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/a-dance-at-the-slaughter-house-matthew-scudder-9.jpg","author":"Lawrence Block","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2328,"title":"A Walk Among the Tombstones (Matthew Scudder #10)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eA Walk Among the Tombstones (Matthew Scudder #10) \u003c/p\u003e\n \u003cp\u003eThe wife of Kheran Khoury, heroin wholesaler, is killed after he haggles over the price of her ransom. With the help of two computer geniuses, a streetwise punk, drug lords and his friend, ex-cop Scudder, they track the killers through the back streets of Brooklyn.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/a-walk-among-the-tombstones-matthew-scudder-10.jpg","author":"Lawrence Block","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2329,"title":"The Devil Knows You\u0027re Dead (Matthew Scudder #11)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eThe Devil Knows You\u0027re Dead (Matthew Scudder #11) \u003c/p\u003e\n \u003cp\u003eWhen Yuppie lawyer Glenn Holtzmann sits in his penthouse gazing at the setting sun, he little imagines that within half an hour he will be dead. Everyone believes it to be a clear-cut case, but Scudder isn\u0027t convinced that the evidence or the victim are what they seem.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/the-devil-knows-you-re-dead-matthew-scudder-11.jpg","author":"Lawrence Block","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2330,"title":"A Long Line of Dead Men (Matthew Scudder #12)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eA Long Line of Dead Men (Matthew Scudder #12) \u003c/p\u003e\n \u003cp\u003eIn Manhattan, thirty men have been meeting once a year for years; they form a tontine, a secret, private club, the only purpose of which is to record the passage of time and to give a toast to the joys of life. But when these men start to die at alarming rates, murder rears its ugly head. It\u0027s clear someone is determined to kill them all. Hired by one of the members, Matt Scudder, ex-cop and recovering alcoholic, enters the world of privilege, which may as well be on another planet from the world of street hustlers and career criminals he\u0027s so familiar with. As the case draws Matt deeper and deeper, he\u0027s forced to look at his own life--his work, his loves, his friendships and his destiny.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/a-long-line-of-dead-men-matthew-scudder-12.jpg","author":"Lawrence Block","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2331,"title":"Even the Wicked (Matthew Scudder #13)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eEven the Wicked (Matthew Scudder #13) \u003c/p\u003e\n \u003cp\u003eMatthew Scudder knows that justice is an elusive commodity in the big city, where a harmless man can be shot dead in a public place criminals fly free through holes in a tattered legal system. But now a vigilante is roaming among the millions, executing those he fees deserve to die. He calls himself \"The Will of the People\"—an ingenious serial killer who announces his specific murderous intentions to the media before carrying through on his threats. A child molester, a Mafia don, a violent anti-abortionist—even the protected and untouchable are being ruthlessly erased by New York\u0027s latest celebrity avenger.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/even-the-wicked-matthew-scudder-13.jpg","author":"Lawrence Block","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2332,"title":"Everybody Dies (Matthew Scudder #14)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eEverybody Dies (Matthew Scudder #14) \u003c/p\u003e\n \u003cp\u003eMatt Scudder is finally leading a comfortable life. The crime rate\u0027s down and the stock market\u0027s up. Gentrification\u0027s prettying-up the old neighborhood. The New York streets don\u0027t look so mean anymore. \u003c/p\u003e\n \u003cp\u003eThen all hell breaks loose. \u003c/p\u003e\n \u003cp\u003eScudder quickly discovers the spruced-up sidewalks are as mean as ever, dark and gritty and stained with blood. He\u0027s living in a world where the past is a minefield, the present is a war zone, and the future\u0027s an open question. It\u0027s a world where nothing is certain and nobody\u0027s safe, a random universe where no one\u0027s survival can be taken for granted. Not even his own. \u003c/p\u003e\n \u003cp\u003eA world where everybody dies.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/everybody-dies-matthew-scudder-14.jpg","author":"Lawrence Block","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2333,"title":"Hope to Die (Matthew Scudder #15)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eHope to Die (Matthew Scudder #15) \u003c/p\u003e\n \u003cp\u003eThe city caught its collective breath when upscale couple Byrne and Susan Hollander were slaughtered in a brutal home invasion. Now, a few days later, the killers themselves have turned up dead behind the locked door of a Brooklyn hellhole -- one apparently slain by his partner in crime who then took his own life. \u003c/p\u003e\n \u003cp\u003eThere\u0027s something drawing Matthew Scudder to this case that the cops have quickly and eagerly closed: a nagging suspicion that a third man is involved, a cold, diabolical puppet master who manipulates his two accomplices, then cuts their strings when he\u0027s done with them. No one but Scudder even suspects he exists. And his worst fear is that the guy is just getting started ...\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/hope-to-die-matthew-scudder-15.jpg","author":"Lawrence Block","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2334,"title":"All the Flowers Are Dying (Matthew Scudder #16)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eAll the Flowers Are Dying (Matthew Scudder #16) \u003c/p\u003e\n \u003cp\u003e\"A man in a Virginia prison awaits execution for three hideous murders he swears, in the face of irrefutable evidence, he did not commit. A psychologist who claims to believe the convict spends hours with the man in his death row cell, and ultimately watches in the gallery as the lethal injection is administered. His work completed, the psychologist heads back to New York City to attend to unfinished business.\" \u003c/p\u003e\n \u003cp\u003eMeanwhile, Matthew Scudder has just agreed to investigate the ostensibly suspicious online lover of an acquaintance. It seems simple enough. At first. But when people start dying and the victims are increasingly closer to home, it becomes clear that a vicious killer is at work. And the final targets may be Matt and Elaine Scudder.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/all-the-flowers-are-dying-matthew-scudder-16.jpg","author":"Lawrence Block","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2335,"title":"A Drop of the Hard Stuff (Matthew Scudder #17)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eA Drop of the Hard Stuff (Matthew Scudder #17) \u003c/p\u003e\n \u003cp\u003e\"Right up there with Mr. Block\u0027s best....A DROP OF THE HARD STUFF keeps us guessing.\"--Tom Nolan, Wall Street Journal \u003c/p\u003e\n \u003cp\u003eFacing his demons in his first year of sobriety, Matthew Scudder finds himself on the trail of a killer. When Scudder\u0027s childhood friend Jack Ellery is murdered, presumably while attempting to atone for past sins, Scudder reluctantly begins his own investigation, with just one lead: Ellery\u0027s Alcoholics Anonymous list of people he wronged. One of them may be a killer, but that\u0027s not necessarily Scudder\u0027s greatest danger. Immersing himself in Ellery\u0027s world may lead him right back to the bar stool. \u003c/p\u003e\n \u003cp\u003eIn a novel widely celebrated by critics and readers, Lawrence Block circle back to how it all began, reestablishing the Matthew Scudder series as one of the pinnacles of American detective fiction.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/a-drop-of-the-hard-stuff-matthew-scudder-17.jpg","author":"Lawrence Block","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2336,"title":"The Thief Who Couldn\u0027t Sleep (Evan Tanner #1)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eThe Thief Who Couldn\u0027t Sleep (Evan Tanner #1) \u003c/p\u003e\n \u003cp\u003eEvan Michael Tanner hasn\u0027t slept in more than a decade—not since a small piece of battlefield shrapnel invaded his skull and obliterated his brain\u0027s sleep center. Still, he\u0027s managed to find numerous inventive ways to occupy his waking hours. \u003c/p\u003e\n \u003cp\u003eTanner is a card-carrying member of hundreds of international organizations, from the Internal Macedonian Revolutionary Order to the Flat Earth Society—not because he believes in their myriad lost causes, he\u0027s simply a joiner by nature. Besides, it gives him something to do. \u003c/p\u003e\n \u003cp\u003eThe Russians think Tanner is a CIA operative on a covert mission. The CIA is certain he\u0027s a Soviet agent. Actually, he\u0027s in Turkey pursuing a fortune in hidden Armenian gold. But Tanner\u0027s up for anything, including a little spycraft, if it helps him reach his big payday. And if need be, he\u0027ll even start a small revolution . . .\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/the-thief-who-couldn-t-sleep-evan-tanner-1.jpg","author":"Lawrence Block","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2338,"title":"Tanner\u0027s Virgin (Evan Tanner #6)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eTanner\u0027s Virgin (Evan Tanner #6) \u003c/p\u003e\n \u003cp\u003eThe CIA, the FBI, the KGB, Interpol—not one of the world\u0027s premier intelligence organizations knows quite what to make of Evan Michael Tanner. Is he a spy, a mercenary, a footloose adventurer, or simply a screwball sucker for hopeless causes? \u003c/p\u003e\n \u003cp\u003e(Actually he\u0027s a little bit of all of the above. Plus he never sleeps. Ever.) \u003c/p\u003e\n \u003cp\u003eOne thing\u0027s for sure: Tanner\u0027s a true romantic, which is why he can\u0027t refuse a distraught mother who begs him to rescue her lost, pure-as-driven-snow daughter. Phaedra Harrow (nee Deborah Horowitz) once shared Tanner\u0027s apartment but not his bed. And now the virginal beauty\u0027s been abducted by white slavers in the Afghan wilderness. \u003c/p\u003e\n \u003cp\u003eFinding Phaedra will be difficult enough. Bringing her back alive and unmolested may be impossible. And first Tanner will have to swim the English Channel, survive trigger-happy Russian terrorists . . . and maybe pull off a timely assassination or two.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/tanner-s-virgin-evan-tanner-6.jpg","author":"Lawrence Block","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2339,"title":"Killing Floor (Jack Reacher #1)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eDue to some reason, the article content has been deleted. Please do sympathize ! Please read the other stories. \u003c/p\u003e\n \u003cp\u003eDo you like this book you can buy books: \u003c/p\u003e\n \u003cp\u003eKilling Floor (Jack Reacher #1) \u003c/p\u003e\n \u003cp\u003eEx-military policeman Jack Reacher is a drifter. He’s just passing through Margrave, Georgia, and in less than an hour, he’s arrested for murder. Not much of a welcome. All Reacher knows is that he didn’t kill anybody. At least not here. Not lately. But he doesn’t stand a chance of convincing anyone. Not in Margrave, Georgia. Not a chance in hell. \u003c/p\u003e\n \u003cp\u003eThe sleepy, forgotten town of Margrave, Georgia, hasn\u0027t seen a crime in decades, but within the span of three days it witnesses events that leave everyone stunned. An unidentified man is found beaten and shot to death on a lonely country road. The police chief and his wife are butchered on a quiet Sunday morning. Then a bank executive disappears from his home, leaving his keys on the table and his wife frozen with fear. The easiest suspect is Jack Reacher - an outsider, a man just passing through. But Reacher is a tough ex-military policeman, trained to think fast and act faster. When authorities learn the first victim was someone from Reacher\u0027s past, and he cannot convince them of his innocence, his patient self-defense becomes a raging crusade of revenge. With two cops who believe in him - a thoughtful black detective and a woman named Roscoe - he closes in on a ruthless conspiracy hiding behind Margrave\u0027s rural charm. But closing in on him is a team of killers. Step by step, the two teams circle - waiting to see which will be the first to walk onto the killing floor.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/killing-floor-jack-reacher-1.jpg","author":"Lee Child","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2340,"title":"Die Trying (Jack Reacher #2)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eDie Trying (Jack Reacher #2) \u003c/p\u003e\n \u003cp\u003eWhen a woman is kidnapped off a Chicago street in broad daylight, Jack Reacher\u0027s in the wrong place at the wrong time. He\u0027s kidnapped with her. Handcuffed together and racing across America toward an unknown destination, they\u0027re at the mercy of a group of men demanding an impossible ransom - the woman is worth more than he can imagine.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/die-trying-jack-reacher-2.jpg","author":"Lee Child","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2341,"title":"Tripwire (Jack Reacher #3)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eTripwire (Jack Reacher #3) \u003c/p\u003e\n \u003cp\u003eJack Reacher, ex-military policeman relaxed in Key West until Costello turned up dead. The amiable PI was hired in New York by the daughter of Reacher\u0027s mentor and former commanding officer, General Garber. Garber\u0027s investigation into a Vietnam MIA sets Reacher on collision with hand-less \"Hook\" Hobie, hours away from his biggest score.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/tripwire-jack-reacher-3.jpg","author":"Lee Child","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2342,"title":"Running Blind (Jack Reacher #4)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eRunning Blind (Jack Reacher #4) \u003c/p\u003e\n \u003cp\u003eWomen are being murdered nationwide by a killer who leaves no trace of evidence, no fatal wounds, no signs of struggle, and no clues to an apparent motive. All the victims have one thing in common: they each knew Jack Reacher.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/running-blind-jack-reacher-4.jpg","author":"Lee Child","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2343,"title":"Echo Burning (Jack Reacher #5)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eEcho Burning (Jack Reacher #5) \u003c/p\u003e\n \u003cp\u003eJack Reacher returns in Lee Child\u0027s new \"rip-roaring thriller\" (\"Denver Rocky Mountain News\"). This time, he\u0027s a hitchhiker picked up by a troubled beauty. And what happens between them has everybody talking. \u003c/p\u003e\n \u003cp\u003e\"Smashingly suspenseful...Child builds tension to unbearable extremes.\"\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/echo-burning-jack-reacher-5.jpg","author":"Lee Child","type":"Mystery","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":19,"name":"Mystery","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}}]
