{"id":86427,"no":14,"title":"Page 14","content":"\\n\\n Pressing his face into the side of her head, he squeezed his lids tight, not wanting to let unmanly tears fall when her screams became sobs, a keening wail of pain.\\n\\n He expected Christina to burst in, but when she didn’t, he remembered her words. She’s angry. A lot. This wasn’t the first meltdown she’d heard. It made him relieved and furious at once. He pushed the latter aside with effort.\\n\\n “It’s all right, sweetheart,” he said roughly. “I’ve got you. I’m not letting you go.”\\n\\n “You can’t. . . . I’m already gone.”\\n\\n “No, you’re not, damn it.” He fished for something, anything. “I asked you a question at the end of every one of those letters. You remember?” It took a while, but at last she nodded. When he warily lifted some of his weight off her, her nose was running. She worked her hand up underneath the weight of him to wipe at it gracelessly, her eyes still streaming in silent anguish. He swallowed.\\n\\n “I asked you if you’d ever thought about a different career, other than the army. What was your answer to that?”\\n\\n She sniffled, shook her head. “I . . . I can’t do that anymore.”\\n\\n “What was it?” He wouldn’t reassure her yet. If it was something that required sight and hearing, well, they’d figure out something else she could do and love.\\n\\n She squeezed her eyes shut, as if she could still see, another way she could hide. “I wanted to be a minister. Give people . . . faith, and hope, that life could be better.” He stared down at her as the tears increased. She turned her face into the carpet to let the sobs take her anew. Setting his jaw, Peter rose and lifted her off the carpet in one motion.\\n\\n “We’re going,” he said.\\n\\n “You owe me such an astronomical favor, I could demand your first-born. I’ve met Middle Eastern terrorist leaders less intimidating than that nurse friend of yours. She agreed to three days before calling the cops, but only because I said you’d call her with progress reports and let her talk to Dana whenever she wanted to. She said either way she’s going to have a piece of your hide for reneging on your original agreement.”\\n\\n “Dana wouldn’t agree to go with me, but she refused for the wrong reason. She doesn’t think she deserves me.”\\n\\n “Smart girl. No decent human being deserves you.”\\n\\n Peter offered a suitable hand gesture, which Ben returned, the videoconferencing connection making it a slow-motion movement. The signal at his bayou home was a little broken up at times. Then Ben shrugged. “Seriously, I think you’re okay. Christina knows you’re good folk. In fact, between you and me, I think she actually expected you to do something like this. Did Jon make the changes you wanted before you got home?”\\n\\n “Yeah. I’ve got to go. Give Christina my cell number so she can call me anytime.”\\n\\n “Will do. We still on for tomorrow night?” Ben lifted a brow at Peter’s pause. “You rethinking this?”\\n\\n “Yes. No. Hell, it’s been a stressful few hours. Haven’t slept since yesterday. Getting an unwilling woman on a flight, even a private one, is a bitch.”\\n\\n “Get some rest,” Ben advised, studying him in a way that told Peter he saw that the exhaustion was more than physical. “When you need someone to spell you, give us a buzz. If she’d be more comfortable with a woman, Savannah or Cassie is more than willing to take a shift. Good luck.”\\n\\n Peter nodded and cut the line, returning to his living room to face his mutinous houseguest. Her unreasoning rage from hours before had morphed into a woman’s silent anger. He wanted to interpret it as an improvement, now more about not wanting to be told what to do, rather than a complete unwillingness to believe there was a good reason to be here.\\n\\n Fortunately, she’d exhausted herself by the time he’d put her in his car, belting her in.\\n\\n They’d been almost to the airport when she rallied. Getting her out of the rental had been a bit of a scuffle, alarming the attendant. Dana informed him that Peter was a complete overbearing bastard, but then thankfully subsided without a demand for police intervention. The attendant had given him an askance look, to which Peter gave him a bland “you know women” look that earned a grin and forward progress.\\n\\n It gave him hope that, deep inside, she did want to come here. Of course, she’d been scared shitless and he was her only familiar link. As angry as she was, she clung to his side, shaking as he took the shuttle to the private hangar. He described everything as they went, told her what was going to happen before it happened. While she didn’t respond, her fingers held on to his as though she were hanging off the side of a cliff. Fuck, had she been out of that house at all?\\n\\n She’d fallen asleep on the plane. While part of it was emotional exhaustion, he knew it was more than that. Ben wasn’t the only K\u0026A man he owed. He made a mental note to send Lucas a case of his favorite Scotch. The CFO was a master at pleasuring women with his mouth. The techniques he’d shared with Peter, in a variety of memorable past experiences, were what had sent Dana into that spinning pleasure, which likely had knocked her off balance enough for him to get this far.\\n\\n He’d carried her to the K\u0026A limo that had met them at their private hangar in Baton Rouge. When she woke in his lap, she’d kept her cheek pressed to his chest. He’d seen the slow movement of her lashes as she blinked. They’d been thick and lustrous that night long ago. He wondered if the injuries made them thinner and more delicate-looking now, or she’d had on more mascara than he’d realized. He’d touched those tiny hairs with his fingers, stroked them. While the car drove toward the outskirts of Baton Rouge, he thought about all the things he wanted to know about her, to give her.\\n\\n When they reached his house, he’d guided her through the basic landmarks of the different rooms, then settled her in a chair in the main room as he called Ben. She’d remained there, unmoving, her face telling him nothing, though he sensed a cauldron brewing.\\n\\n He could deal with that. What he couldn’t accept was leaving her there another minute.\\n\\n Every tear she’d shed after her climax, the storm of emotion it and his misguided attempt to burn the letters had unleashed, had felt like acid on his insides. He was responsive to women’s tears, yes, but this woman affected him differently. She had that first night, and she did now. The vicious pounding in his head was unrelenting. As unreasonable as he knew it was, he should have been there to protect her. He hadn’t been, so he was going to help her now.\\n\\n Despite what she thought, it wasn’t charity. He needed to see that fire in her eyes again, see the courage that came with her submission to him, that willingness to surrender that was a gift, not a defeat. She’d dreamed of him for months, she’d said so, while he’d been haunted by her. She haunted him even now, the ghost of a woman hovering over the shell she’d become.\\n\\n “I’m thirsty,” she said abruptly. “Do I have to beg for food and water?”\\n\\n “I might make you beg for everything, sweetheart. If I remember correctly, the way you begged had a sweet sound to it.”\\n\\n She pressed those luscious lips together, but he saw her swallow. There were women who were submissives only within the defined boundaries of a sexual situation, but for some that undercurrent could run under a wide variety of things, and he knew she was one of them. That would help here. He knew it, if he could figure out how to tip the scales away from her fears. He was banking on the fact her passion for life would be inextricably tangled with the desires of the flesh. And her response earlier said she hadn’t yet cut those ties, thank God.\\n\\n While he’d been content to be a Dom within other women’s boundaries, this was the kind of submissive he’d wanted. One who had that tantalizing undercurrent. Savannah and Cassie were similar, another way the K\u0026A men were alike in their needs and desires.\\n\\n When Jon and Ben found their own women, he’d lay money it would be the same.\\n\\n He went to a squat by the straight chair in which she sat so rigid, wearing the baggy jeans he’d put on under her sweatshirt. He’d left most of her clothes there, because he wanted her to leave that persona behind. As soon as he could get her out of these, he’d probably burn them.\\n\\n “If you’re hungry or thirsty, Dana”—he traced her lips with a forefinger—“ask your Master for food and something to drink.”\\n\\n That same painful and rigid expression crossed her face. “Peter, please don’t. I’m feeling too vulnerable right now, you know?”\\n\\n “I know. But here’s the deal, sweetheart.” He shifted so his splayed knees were bracketing her calves. His one hand closed over both of hers, clenched in her lap. “Give me three days. Be what you would have wanted to be to me, and trust me to help you do that. On day three, if you want to go back to that damn box, I’ll take you there myself.\\n\\n But give me that. What do you have to lose?”\\n\\n He was lying, of course. Even when K\u0026A did their negotiations, he was the floor man, the guy who went in and evaluated a plant’s assets and their production processes. He wasn’t the poker player like the others. But he put everything into his voice to convince her he meant it, that he would take her back to that pointless existence if he couldn’t get through to her. Even though she had no one else.\\n\\n Yeah, right.\\n\\n There were times that lying in a relationship was the best thing. He had no qualms that this was one of those moments, whether he was lying to her or she was lying to herself about believing him. But in the space of a held breath, she gave a short, barely there nod.\\n\\n “Okay,” she whispered.\\n\\n Dana felt his hand tighten over hers, an approval. She knew this was wrong, but he’d brought her here, his will irresistible. How was she going to say no in three days, when she couldn’t say no now? And why wasn’t she saying no? Was it a pathetic reason, letting her destiny be decided like a broken branch carried by whitewater? Or was there a kernel of hope left inside of her, a hope that some will to live that had escaped her these many months still existed in her heart and soul, and he could find it? She didn’t know. \\n\\n","sourceLink":"https://allnovel.net/honor-bound-knights-of-the-board-room-3/page-14.html","bookId":1902,"book":{"id":1902,"title":"Honor Bound (Knights of the Board Room #3)","description":"Storyline: Honor Bound (Knights of the Board Room #3) \\n Peter Winston is a successful business man and a captain in the National Guard. On the night before his second tour in Afghanistan, he and his partners at Kensington \u0026 Associates head out to enjoy an upscale BDSM club. While the evening begins with laughter and whiskey, it takes a sharp turn when Peter, a sexual Dominant, sets his eyes on a beautiful masked submissive… \\n Army Sergeant Dana Smith doesn’t often seek the shelter of a man, but being Peter’s gives her a welcome sense of sanctuary. What begins as a night of fantastic pleasure becomes something they hope will never end. But duty calls, and it will be over a year before they can see each other again. And when they do, things have drastically changed. \\n Severely injured in the line of duty, Dana has lost her sight and her will to live. But Peter doesn’t accept defeat in business, battle or love. With the talents of the other K\u0026A males, he’ll set the stage for another special night for them, knowing that only a submissive’s willingness to trust her Master will bring her back to love and life again.\\n","cover":"https://allnovel.net/images/honor-bound-knights-of-the-board-room-3.jpg","author":"Joey W. Hill","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/honor-bound-knights-of-the-board-room-3.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:13:29 PM"}}
