{"id":86436,"no":23,"title":"Page 23","content":"\\n\\n “Even without his deadbeat ass,” another voice put in, and her hand was taken in a new strong grasp. “I’m Ben.”\\n\\n She didn’t need eyes to know the two men were tall, a little dangerous and a lot sexy.\\n\\n With the sensory overload Peter had inflicted on her up to now, her body fairly vibrated in response to any stimulus. It hadn’t occurred to her eye candy would still have an effect on her, but apparently it was misnamed. A good-looking man had a way of appealing to more than one sense. Of course, Peter had already proven that to her. She cleared her throat, tried to rally the spirit belonging to that girl Peter remembered.\\n\\n “You must be the slick lawyer.”\\n\\n “I see he’s already set you against me. He’s insecure that way. Afraid I’ll take you right out from under his nose.”\\n\\n O’Neill crossed her mind. His teasing, the playful sexual innuendos. He’d come to see her when they’d both been at Walter Reed. She gave him kudos for coming more than once, because she’d been a bitch most of the time. She should have been kinder, more responsive, because in hindsight, she realized he suffered guilt over her injuries. He’d healed, with only a harrowing scar to impress the girls, but psychological wounds could fester. Maybe she’d write or e-mail him. Peter would help her.\\n\\n Now, though, she tuned back in to her immediate surroundings, lifting a brow in Ben’s direction. “Men tend to underestimate a short woman’s ability to kick their balls into the back of their throat. Lower center of gravity and all.”\\n\\n “Ouch,” Ben responded, a grin in his voice. “Peter, I’m definitely going to take my shot.”\\n\\n “I’m sure,” her escort said. Peter’s touch slid down her back, giving her buttock a caress.\\n\\n The pressure of his hand against the stiff corset, giving way to the thin fabric and her accessible flesh beneath it, riveted all her nerve endings toward that point. The caress made her already aroused body even more so, such that she was glad another introduction was forthcoming, letting her catch her breath.\\n\\n “I’m Matt Kensington, Dana. It’s a pleasure to have you join us. This is my wife, Savannah.”\\n\\n There was a charisma to that voice, a rolling power to the grip that confirmed he was the leader of this pack, because the position of Peter’s body changed, a shift as if he was presenting her for approval. Then she felt Savannah’s cool, slim fingers, a welcoming, firm hold. Aside from that, the brace of diamonds on her wedding ring was enough to tempt a closer investigation, because Peter was right. Dana did like jewelry.\\n\\n “Thank you for what you did in Iraq,” Savannah said quietly. “Your sacrifice means so much to us all. If you need anything, you need only ask.” She wasn’t sure what to do with that, but then she met the last member of Peter’s unusual circle of close friends.\\n\\n “Jon.” This voice was tranquil, a sexy almost-like-a-dream quality to it. “Dana, when you’re comfortable, I’ve been studying some impressive advances in sensory technology that may interest you.”\\n\\n “Jon’s our mechanical genius.” Peter’s caress again. “In a variety of ways. The device you experienced earlier today is one of his far simpler ones.” Dana cleared her throat, glad for once she couldn’t see because she was sure she’d blush up to her roots meeting Jon’s knowing gaze. “It was . . . effective.”\\n\\n “Glad you enjoyed it.” Jon’s sensitive, clever fingers enclosed hers, stroking her palm, an easy intimacy that seemed to reflect the way they’d all touched her. As if somehow by being Peter’s, she was part of an inner circle, provocative and calming at once.\\n\\n In the car, Peter had reminded her all four men were sexual Dominants, their attitudes and preferences like his own. She hadn’t really believed it, but now, in their presence, there was no doubt. In another situation fear might have trickled through her, wondering how much she really knew about Peter, taking her to a BDSM club with his friends. But, despite the different quality and mannerisms to each, they had that same humming undercurrent that Peter had. Firm, confident sexuality with an underlying . . . tenderness.\\n\\n Protective. It acknowledged the fears she might be facing, and yet sent them a message: Nothing’s going to happen to you while we have anything to say about it.\\n\\n On top of that, in Cass’s and Savannah’s voices, she heard the purring ease that reflected well-loved women. And finally, even if she was putting too much stock in this test flight of her other senses, it didn’t change one inexplicable fact—she trusted Peter.\\n\\n He’d plunged right into her shit without any invitation. He’d been overbearing and pushy, a bully in every sensual, protective way. There wasn’t anything cruel about him. He might frustrate the hell out of her, such that, if she had any intention of accepting his ludicrous offer to stay, she’d occasionally have to hit him in the head with a blunt object while he slept. But he’d never let anything hurt her. Even if she was too uncertain of her handicap for her irrational mind to accept it, her rational mind did.\\n\\n “Let’s have a drink and get to know one another before we go,” Matt suggested, the masculine Texas drawl in his voice as alluring to a woman’s senses as she suspected the rest of him was. “Then we’ll go.”\\n\\n While Peter and Lucas lifted the sleeping Jeremy and carried him back to his room, where his younger sister Marcie would tend him that evening, Cass and Savannah guided Dana to a circular sofa arrangement. Used to being self-conscious, worried about what sentences she might miss, she found it amazing that this group of strangers so quickly dispelled her anxiety, on those issues at least.\\n\\n Dana felt no catty or pitying vibes from Cassandra and Savannah at all. They integrated her into the conversation, drawing out information on her interests and pointing her toward shopping and recreational activities in the area they’d love to visit with her. She hadn’t felt so easily accepted since basic training.\\n\\n When Peter returned and settled next to her, the group delved into cocktails, catching up on business, some social talk. As the men moved around, it brought her the distracting, pleasurable scents of male heat, cologne, aftershave, dry-cleaned silk and cotton. The first one to touch her was Jon. A casual brush of her knee accompanied the courteous, “Would you like another drink, Dana?”\\n\\n As Ben and Lucas stood behind the couch, exchanging opinions with Peter on some business matter, Lucas’s thumb and forefinger circled her nape, a light pressure as he leaned over to respond to his wife’s gentle reproof about talking business. Ben followed it up with a joke about being henpecked, and his knuckles slid along the point of Dana’s shoulder.\\n\\n During the mixture of conversations, it happened several times, each of the men apparently taking turns with the sensual but respectful caresses. It was when Matt Kensington did it, taking brief hold of her foot in a large hand to straighten the strap of her sandal for her, awakening the highly sensitive nerve endings along her ankle, she realized, with shock, what they were doing.\\n\\n They were marking her. Identifying her with the pack, but also helping her to recognize them as well. She could be crazy, but she was almost certain she wasn’t. Instead, she was impressed by their intuitive understanding of how it reassured her, to have tactile imprints to anchor and center her.\\n\\n Beyond that noble purpose, it enhanced the charge of sexual anticipation flavoring the air, since they all knew where they were going tonight. Peter had his arm stretched behind her, and she was hyperaware whenever he dropped his hand from the couch to tease her collarbone. Once, his other hand settled on her leg, gliding up her thigh. Just a brief, sweet caress to the inside, and before she thought, she’d started to spread her legs, a submissive’s automatic response to a Master’s touch there. He gripped her smoothly, stopping her, but before she could get discomfited, his lips brushed her ear in approval.\\n\\n Cassandra and Savannah were both submissives, she reminded herself. Since she knew the nature of a submissive, she wasn’t surprised they were successful businesswomen.\\n\\n The fact they gave their men a lot of playful shit was a bonus, one that had her laughing and joining in the banter herself. Peter threatened to take her home before they taught her bad habits.\\n\\n Home. It didn’t sound as odd as she would expect. She let that thought bolster her when they finally headed out to the club.\\n\\n More conversation, the scent of champagne and truffles, and then a chocolate-covered strawberry Peter fed to her directly from his own mouth, settling his lips over hers as she laid back in the cradle of his arm in the spacious limo. The taste of the fruit and confection melted her body into the insistent strength of his.\\n\\n “Hell,” Ben groused from the seat across from them. “Way to get my dick hard before we get there, Peter. Ease up or I’m going to jump the first pretty ass I see.”\\n\\n “Like you need an excuse,” Jon observed wryly. “When we went to St. Bart’s, I thought they were going to kick us off the island.”\\n\\n As Peter lifted his head at last, Dana drew in a ragged breath. “Just how rich are you all?”\\n\\n “Peter’s a poor cousin, really.” Ben’s knee grazed hers, then his calf as he stretched out a long leg on the side opposite of Peter. “One of those hangers-on that sponges off his betters. We tolerate him because his whole soldier routine attracts women. You’d be much better off with a lawyer.”\\n\\n “Particularly a castrated one,” Peter said.\\n\\n “Peter is quite well-off, Dana,” Savannah reassured her. “You don’t have to worry about working two or three jobs to support him.”\\n\\n Dana let herself smile. “Well, as long as he’s not after my fortune. I have two or three of these kind of limos lying around, you know.”\\n\\n Then her stomach was jumping again, because the limo pulled in the club parking lot.\\n\\n She tried to calm it, focusing on Peter’s reassuring grip on her hand. While Surreal was not as upscale as The Zone, Peter had said it was still one of Louisiana’s best fetish clubs, doing its best to emulate The Zone’s example on the more limited budget it had. As the others got out, she was hit by a wave of loud voices and white noise. Heat and a flicker at the corners of her dark vision suggested a lot of flashing light. “It’s busy tonight,” Jon mentioned, as he exited the limo last. \\n\\n","sourceLink":"https://allnovel.net/honor-bound-knights-of-the-board-room-3/page-23.html","bookId":1902,"book":{"id":1902,"title":"Honor Bound (Knights of the Board Room #3)","description":"Storyline: Honor Bound (Knights of the Board Room #3) \\n Peter Winston is a successful business man and a captain in the National Guard. On the night before his second tour in Afghanistan, he and his partners at Kensington \u0026 Associates head out to enjoy an upscale BDSM club. While the evening begins with laughter and whiskey, it takes a sharp turn when Peter, a sexual Dominant, sets his eyes on a beautiful masked submissive… \\n Army Sergeant Dana Smith doesn’t often seek the shelter of a man, but being Peter’s gives her a welcome sense of sanctuary. What begins as a night of fantastic pleasure becomes something they hope will never end. But duty calls, and it will be over a year before they can see each other again. And when they do, things have drastically changed. \\n Severely injured in the line of duty, Dana has lost her sight and her will to live. But Peter doesn’t accept defeat in business, battle or love. With the talents of the other K\u0026A males, he’ll set the stage for another special night for them, knowing that only a submissive’s willingness to trust her Master will bring her back to love and life again.\\n","cover":"https://allnovel.net/images/honor-bound-knights-of-the-board-room-3.jpg","author":"Joey W. Hill","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/honor-bound-knights-of-the-board-room-3.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:13:29 PM"}}
