{"id":102930,"no":11,"title":"Page 11","content":"\n He was lying on something firm, but possibly intended to be comfortable. Maybe this meant he wasn’t dead; but the room felt very small and close, as if he were resting in a coffin. Then his thoughts circled around to the conviction that nobody would pay for a coffin to bury his sorry corpse—and, anyway, dead people couldn’t possibly hurt this much, unless they were in hell. He was pretty sure of that. Read it in the Good Book once.\n And with every ounce of his aching body, his rattled consciousness, his uncertain sanity … he wanted sap. He imagined he could smell it nearby—the tang of its cooking, the sharp whiff of the terrible yellow substance curling into smoke on a sheet of tin.\n So he asked for some, on the off chance that anyone was listening … and, if so, that they’d be willing to share.\n No one gave him any. But sometimes people talked to him.\n For a while he heard voices conversing entirely in Chinese, and then came the dim sensation of being physically moved, forcibly relocated to some distant place in a cart, or a wheelbarrow, or something else that held him sprawling and left his elbows bruised. After that, he didn’t hear Chinese anymore. He heard English—mostly from men, but sometimes from women.\n “Yes, that’s him. A little skinnier than last I saw him, but you can’t mistake that hair.”\n “Your boy said his name’s Rector. What kind of name is that?”\n “No idea. He might’ve made it up, for all I know—but that’s what everyone called him.”\n His eyes opened slowly, independently of each other, one slim crack at a time. The left one stuck a little. His vision cleared enough to pick out the details of a woman. She was leaning over him, her face a little too close for his comfort.\n It felt familiar.\n He recognized her, and realized this wasn’t the first time she’d loomed over him, wearing a similar frown. His lips parted with the same degree of difficulty as his eyelids. He tried to say her name, but only a cracking wheeze came forth.\n Briar Wilkes.\n Zeke’s mother.\n If he’d had the energy, he might’ve recoiled. She was mean—he knew it firsthand. She’d threatened his life, limbs, and soul after Zeke had gone under the city walls; and now that Zeke was dead, she had plenty of reason to follow through on those threats. He wanted to cringe away from her, to sink farther into the thin mattress (a mattress? Yes … it was definitely a mattress) to avoid her and her inevitable wrath.\n “He’s waking up.”\n Briar Wilkes said, “If you can call it that. Hey, Rector, can you see me? Do you know what happened? Do you know where you are?”\n He tried to shake his head, but it wouldn’t move. His best defense was a pitiful one. He quit the uphill fight to hold his eyelids open, and let them shut, so at least he couldn’t see her.\n The other woman said, “It’s all that powder he’s burned up. It’s cooked his brain. Look at him, you can see he’s been using.”\n “Worthless kid. Should’ve tossed him right back over the wall.”\n “He reminds me of the men in the Salvation Army hospital. I told you about that, didn’t I?”\n Miss Wilkes again. “How one of ’em tried to bite you?”\n “That’s right. This boy, he’s not that bad yet. It’s not too late.”\n “You’ve got more faith in him than I do.”\n “Well, I never met him before. Could be he’ll convince me otherwise.”\n The second woman had a funny accent, which Rector couldn’t place. As his mind drifted backwards, away from the scene, he wondered where she came from. Didn’t sound local, didn’t sound like one of the Chinamen. And anyway, there weren’t any Chinawomen in the city; everybody knew that.\n The next time he came around enough to listen, if not to talk, the same woman was speaking. She had a nice voice, he decided. Not the worst thing he could listen to by a long shot. This time she was talking to someone else—an older man, one of the Chinese fellows. His English wasn’t great, but with some struggle from both sides, he and the woman were able to make themselves understood.\n “Too much yellow in his nose.”\n “I know. But sometimes, when people … it’s like when people drink too heavy and they come to depend on it. It’s hard for them to stop, and when they do, they get sick. This might be the same thing. He might be just fine when he wakes up proper.”\n “Been three days.”\n “His color’s better. His head’s healing up, too. Isn’t there some medicine we could try?”\n “Time. Water. Tea. Boy not sick. Boy broke himself.”\n “You’re probably right.”\n The Chinaman added, “If not, you shoot him. Take off his head. Have enough rotters already.”\n Rector didn’t stay awake long enough to hear her response. It was easier to faint dead away than to listen to any further discussion of his violent dissection.\n When he came around again, no one was talking, but he knew before opening his eyes that he was not alone.\n He wasn’t sure how he knew this. It was a quiet, odd sensation of sensing someone else breathing nearby, or someone else’s heartbeat ticking away just outside his hearing. His head felt clammy, inside and out—like someone had left his skull out in the rain. Every limb was numb, and deep within his ears he heard a persistent whistling that was not at all like ringing, except that it was equally irksome.\n He opened one eye and blinked it.\n The room was dim, but not completely dark, due to the two lanterns at opposite ends of the room. For the first time he saw it clearly enough to note a few details: a row of cabinets without doors stuffed with bottles, tinctures, bandages, and other assorted doctoring supplies; jars with peeling labels and contents the color of whiskey; a barrel of water with a tap and a bucket; rags, some folded and clean, others dirty and piled in a basket; a small crowd of unlit lanterns with mirrors to direct their light as necessary.\n And in a chair against the wall a lean figure waited with sharp brown eyes and a long black ponytail. This figure leaned forward and said, “Good morning, Rector. Good afternoon, really. It’s almost dinnertime. Are you hungry? Thirsty? Do you want anything? Miss Mercy said I should get you whatever you asked for, if I could.”\n On the one hand, Rector liked the sound of being given whatever he wanted. On the other, he was barely awake and rather confused. All he could muster in response was something like, “What?” And even that single word came out missing half its letters.\n The other fellow left his chair and came to stand beside Rector’s bed.\n “Water? Is that what you said?”\n Close enough.\n Rector nodded, realizing that he would like some water, yes, thank you. He struggled to lift his head off the pillow, and somehow dragged his elbow up underneath himself. “Thanks,” he mumbled as he took the offered mug. The water smelled awful and didn’t taste much better, but that only meant that it was local. The Blight gas had to be distilled out of the water for miles around Seattle to be safe, and even then it never tasted as fresh as a mountain stream … or even outhouse runoff.\n Rector was used to it. He drank it down and didn’t complain. He’d had no idea how parched he’d become. He asked for more.\n His companion obliged, and this time the young Chinaman sat on the foot of the bed while Rector drank down the tepid liquid. The Chinaman drew one leg up beneath himself and began to chatter.\n “I’m Houjin, but people call me Huey. Mostly I stay over in Chinatown Underground, as Captain Cly calls it, but sometimes I stay here in the Vaults, too. Why did you come inside the wall? Usually people are running away from something, or running to something.”\n But before Rector could respond, Houjin continued. “I mean, I didn’t run here. I came here when I was small, with my uncle. I don’t have any other family.”\n “Orphan,” Rector choked out between swallows.\n “Yes, both of my parents are dead. But there’s my uncle,” he repeated. “I heard your parents are dead, too. That’s why you lived in the home with the holy women, isn’t that right?”\n Holy women? Rector frowned, then said, “Oh, yeah. The nuns. I lived in the Catholic home, that’s right.”\n Houjin cocked his head and stared at Rector in a calculating fashion. “You must have been a baby when the Blight came.”\n Rector cleared his throat. His voice was coming back. “Not sure. Don’t remember. But they tell me I’m eighteen, so I had to leave the home and make my own way.”\n Nodding earnestly, Houjin said, “I’m not eighteen yet, but I make my own way.”\n “You have a job?”\n “I work on an airship. I’m learning to navigate, and maintain the engines. I want to be an engineer. Sometimes here in the city I work with the men at the Station, and Yaozu pays me to fix things. And sometimes I translate.”\n Slowly, Rector propped himself more fully upright. “You mean, Chinese to English? That kind of thing?”\n “There’s more than one kind of Chinese, you know. I speak a couple of them, good enough to go back and forth. And my Portuguese is good—better than my Spanish, but I’m learning. And I’m interested in French, too. I went to New Orleans a few months ago. Lots of people there speak French.”\n “You’re a regular ol’ dictionary, ain’t you?”\n “I like to talk. I like to learn different ways to talk. That’s all.”\n Rector felt it’d be polite to throw the younger boy a bone. “You’re real good at it. You’ve hardly got a China accent at all.”\n “Captain Cly says I’ve been losing more of my accent the more time I spend on the Naamah Darling. And the longer I spend around Zeke.”\n “What’s a—”\n Rector almost asked what a Naamah Darling was, but two things stopped him. First, his addled brain caught up to the fact that it must be the airship on which Houjin served. Second, his attention tripped over the word Zeke. So he asked, to make sure he’d heard correctly. “Zeke?” \n","sourceLink":"https://allnovel.net/the-inexplicables-the-clockwork-century-4/page-11.html","bookId":1670,"book":{"id":1670,"title":"The Inexplicables (The Clockwork Century #4)","description":"Storyline: \n The Inexplicables (The Clockwork Century #4) \n Rector “Wreck ’em” Sherman was orphaned as a toddler in the Blight of 1863, but that was years ago. Wreck has grown up, and on his eighteenth birthday, he’ll be cast out out of the orphanage. \n And Wreck’s problems aren’t merely about finding a home. He’s been quietly breaking the cardinal rule of any good drug dealer and dipping into his own supply of the sap he sells. He’s also pretty sure he’s being haunted by the ghost of a kid he used to know—Zeke Wilkes, who almost certainly died six months ago. Zeke would have every reason to pester Wreck, since Wreck got him inside the walled city of Seattle in the first place, and that was probably what killed him. Maybe it’s only a guilty conscience, but Wreck can’t take it anymore, so he sneaks over the wall. \n The walled-off wasteland of Seattle is every bit as bad as he’d heard, chock-full of the hungry undead and utterly choked by the poisonous, inescapable yellow gas. And then there\u0027s the monster. Rector\u0027s pretty certain that whatever attacked him was not at all human—and not a rotter, either. Arms far too long. Posture all strange. Eyes all wild and faintly glowing gold and known to the locals as simply “The Inexplicables.” \n In the process of tracking down these creatures, Rector comes across another incursion through the wall -- just as bizarre but entirely attributable to human greed. It seems some outsiders have decided there’s gold to be found in the city and they’re willing to do whatever it takes to get a piece of the pie unless Rector and his posse have anything to do with it.\n \n","cover":"https://allnovel.net/images/the-inexplicables-the-clockwork-century-4.jpg","author":"Cherie Priest","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-inexplicables-the-clockwork-century-4.html","creation":"Oct 5, 2019 8:57:51 AM","modification":"Oct 5, 2019 10:16:10 PM"}}
