{"id":108366,"no":10,"title":"Page 10","content":"\"SALLY,\" I SAID QUIETLY into the telephone on Martin\u0027s desk. \"I want to have lunch with you at my place or your place soon, okay? I need to ask you some questions. You covered the Julius disappearance, didn\u0027t you? Do you still have a file on it somewhere, of your notes you took at the time?\" Sally, cohostess at my bridal shower, had worked at the Lawrenceton Sentinel for at least fifteen years.\n \"I don\u0027t keep my notes on fiftieth wedding anniversaries or who won the watermelon-seed-spitting contest, but I do keep my notes on major crimes.\" She sounded a little testy.\n \"Okay, okay!\" I said hastily. \"I\u0027m sorry. I don\u0027t know how reporters do things!\" \"Yes, I have the file right here,\" she said in a mollified tone. \"And I can certainly understand why you\u0027re interested. My better half - well, my other half - is attending a seminar in Augusta on interrogation techniques, so I\u0027m footloose and fancy free for two days. What suits you?\" \"What about here, tomorrow, for lunch at noon?\" I asked. I knew Sally, like all of Lawrenceton, wanted to see the house.\n I hung up as Martin came down the stairs, sweating and relaxed after his session with the Soloflex. He played racquetball at the Athletic Club too, but sometimes the hours didn\u0027t suit him. He liked having the exercise equipment at home. \"I\u0027m sweaty,\" he warned me. I didn\u0027t care since I could use a shower myself after my work in the garage that morning. Angel and I had finished our measurements later in the afternoon, and there was a four-inch question mark running down the middle of the garage, but I figured that was just where Mrs. Zinsner had demanded Mr. Zinsner make it a two-car garage. I didn\u0027t think four inches was enough space to hide three bodies, and Angel agreed. I hugged Martin, sliding my hands around his waist and up his back.\n \"Roe,\" he said hesitantly.\n \"Um?\"\n \"Are you mad?\"\n \"Yes. But I\u0027m working on it.\"\n \"Working on it.\"\n \"Yeah. I suppose you didn\u0027t tell me all that before we got married in case I wouldn\u0027t marry you if I knew it. Is that right? Or did you just hope I wouldn\u0027t ever ask? Or did you just think I was desperate or stupid enough not to notice that there were a few holes in your story?\"\n \"Well...\"\n \"I\u0027ll give you a clue, Martin. There\u0027s only one correct answer to that.\"\n \"I was afraid you wouldn\u0027t marry me if you knew.\"\n \"And that was the correct answer.\"\n \"Good.\"\n \"So now I have to decide how I feel about you wanting me to enter into marriage, a very serious thing, not knowing all the facts about your life. Am I flattered that you were so anxious to keep me that you wouldn\u0027t risk it? Sure.\" I traced his spine with my fingernail and felt him shiver. \"Am I angry that you treated me like some fifties little woman, the less I knew the better? You bet.\" I dug the fingernail in. He gasped. \"Martin, you have to be honest with me. My self-respect - I can\u0027t stand being lied to, no matter how much I love you.\"\n The next day, the day I was going to have Sally Allison over to lunch, Martin and I had also been invited to dinner at the home of one of Pan-Am Agra\u0027s division chiefs. This man, Bill Anderson, was a new employee, hired by Martin\u0027s boss and sent to Lawrenceton to evaluate and expand the plant\u0027s safety program. So I woke with a certain sense of anticipation. Martin was shaving as I groped past him into the bathroom for a quick stop on my way downstairs to the coffeepot. We were beginning to find our routine. He liked to be at his desk when the other Pan-Am Agra executives arrived. And Martin always looked spic and span. His clothes were all expensive and he liked his shirts taken to the laundry to be starched, which frankly suited me. I didn\u0027t mind in the least dropping them by or picking them up. I hated ironing worse than anything in the world, and Martin, who could do a competent job of it, didn\u0027t have the time or inclination unless there was an emergency. Luckily, we both liked noncommunication until coffee had been consumed. He would come downstairs and make his own breakfast and pour his own coffee. By that time I would have finished the front section of the paper, which I had fetched from the end of the driveway. He would read that, then I would hand him the inside sections. Martin was not much interested in team sports, I had noted silently. One-on-one sports, now that was something he checked the scores on. When Martin had finished the paper and his breakfast, we had a brief conversation about appointments for the day. He went upstairs to brush his teeth. I poured another cup of coffee and worked the crossword puzzle in the newspaper.\n He came downstairs, gathered his briefcase, checked with me to make sure we didn\u0027t need to talk about anything else, told me he was going to be out of his office most of the afternoon, and kissed me good-bye. He was gone by seven-thirty, or earlier.\n I felt we had made a success of mornings, anyway. So far.\n This morning Angel reported about eight-thirty. \"Shelby says,\" she began without preamble, \"that we need to find out if an aerial search was made, particularly of the fields around the house.\" \"Hmmmm,\" I said, and made a note on my list. \"I\u0027ll remember to ask that at lunch. A local reporter is a friend of mine, and she\u0027s coming over for lunch.\" \"You sure have a social life.\"\n \"Oh?\"\n \"You\u0027re always having people over, or you go out, or people call you, seems like.\"\n \"I grew up here. I expect if you were still in the town you were born in, it would be the same.\"\n \"Maybe,\" said Angel doubtfully. \"I\u0027ve never had that many friends. When I grew up, we lived way out in the swamps. I had my brothers and sisters. What about you?\"\n \"I have a half-brother, but he\u0027s in California. He\u0027s a lot younger than me.\" \"Well, except for some Cubans, it was just us out there. We pretty much kept to ourselves. When I was a teenager, I began to date... but even then, I was usually glad to get home. I wasn\u0027t much good at small talk, and if you didn\u0027t talk and drink, they wanted to do the other thing, and I didn\u0027t.\" We smiled at each other for the first time.\n Then Angel clammed up, and I realized she would only speak about herself in rationed drips, and I had had my allotment for the day. We went out into the bright spring air to measure the outside of the house. Then we measured each inside room and drew a detailed map of our house. \"I guess sometime having this will come in handy,\" I sighed, a comparison of figures having shown that the walls were only walls and not secret compartments with grisly contents. So much for a hidden closet. \"Oh, I\u0027m sure,\" Angel said drily. \"The next time someone wants to know how to get to the bathroom, all you have to do is tell him to go forty-one inches from the newel post, due east, then north two feet.\" I stared at her blankly for a second and then suddenly began to laugh. Maybe our strange association was going to be more fun than either of us had anticipated.\n Angel looked down at the plans.\n \"There was something in the attic,\" she said.\n \"What! What?\"\n \"Nothing, most likely. But you know the chimney comes up from the living room, runs up one end of your bedroom where you have a fireplace, goes through the attic and out the roof.\"\n \"Right.\"\n \"It seemed to me that in the attic there was too much chimney.\"\n \"They might be sealed up in there,\" I said breathlessly.\n \"They might not. But we can see.\"\n \"Who can we call to knock it down?\"\n \"Shoot, I can do it. But you got to think, here, Roe. What if there\u0027s nothing there? What if you\u0027re just knocking down a perfectly good chimney for the hell of it?\"\n \"It\u0027s my chimney.\" I crossed my arms on my chest and looked up at her. \"So it is,\" she said. \"Then let\u0027s go. You go up there and look, and I\u0027ll go to the garage and get a sledgehammer and one or two other things we might need.\" I let down the attic steps and climbed up. In the heat of the little attic, with sunlight coming in through the circular vent at the back of the house, I calmed down. The attic was floored, with the old original floorboards, wide and heavy. They creaked a little as I crossed to look at the chimney. Sure enough, the bricks looked a little different from the bricks downstairs, though I couldn\u0027t say they looked newer. And the chimney was wider. I remained skeptical. I felt sure the police would have noticed fresh brickwork.\n Angel came up the stairs in a moment, the sledgehammer in her hand. She eyed the bricks. She slid on a pair of clear plastic safety goggles. I stared at her.\n \"Brick fragments,\" she said practically. \"You should stand well back, since you don\u0027t have safety glasses.\"\n I retreated as far as I could, back into an area where I could barely stand, and on Angel\u0027s further advice I turned my back to the action. I heard the thunk as the hammer hit the bricks, and then more and more thunks, until gradually that sound became accompanied by the noises of cracking and falling. Then Angel was still, and I turned.\n She was looking at something in the heap of dislodged bricks and mortar chips.\n \"Oh, shit,\" she breathed.\n I felt my skin crawl.\n I scuttled over to Angel and stood by her looking down as she was doing. In the rubble was a small figure wrapped in blankets blackened by smoke and soot.\n My hand went up over my mouth.\n We stood for the longest moments of my life, staring down at that little bundle. Then I knelt and with shaking hands began to unwrap the blanket. A tiny white face looked up at me.\n I screamed bloody murder.\n I think Angel did, too, though she afterward denied it hotly. \"It\u0027s a doll,\" she said, kneeling beside me and gripping my shoulders. \"It\u0027s a doll, Roe. It\u0027s china.\" She shook me, and I believe she thought she was being gentle.\n Later on, after we\u0027d both showered and Angel had called a mason to come repair the chimney, we speculated on how the compartment had gotten sealed up, how the doll had been left inside. I figured that the story of Sarah May Zinsner\u0027s desire for a closet and her husband\u0027s sealing one up out of sheer cussedness had its basis in whatever had happened by the chimney. We ended up deciding that she\u0027d ordered an extra frame of brickwork for shelving, to store - who knew what? Maybe she\u0027d intended the shelving for the use of the maid who may have been living in the attic. But that final change had been the straw that had metaphorically broken John L. Zinsner\u0027s back. He\u0027d had the shelves bricked up, and while the mason was working, perhaps one of the daughters of the house had set her wrapped-up \"baby\" temporarily (she thought) on the shelves. Now I had it, all these years later, and it had scared the hell out of Angel and me.\n Somehow, when my mother called while I was slicing strawberries for lunch, I didn\u0027t tell her about my morning\u0027s adventure. She would be horrified that I was looking for the Julius family; also, I didn\u0027t care to relate how deeply upset I\u0027d been when I\u0027d seen that tiny white face.\n For once, she didn\u0027t sense that I was less than happy. That was remarkable, since we spoke on the phone or in person almost every day. She was all the family I had, since my father had moved with my stepbrother to California. That was something I had in common, I realized, with the Julius family. They had been nearly as untangled from the southern cobweb of family connections as I was. \"I had a closing this morning,\" Mother said. She was as proud of each sale as though it were her first, which I found sort of endearing. When I was in my early teens, when she\u0027d begun to work but before she was independent and very successful, I\u0027d felt each house she sold should be celebrated by a party. Mother seemed just as driven now as she had been after she\u0027d separated from my father and become a needy wage earner; my father had never been too good about sending child support payments.\n \"Which one?\" I asked, to show polite interest.\n \"The Anderton house,\" she said. \"Remember, I told you I had it sold last week. I was scared until the last minute that they were going to back out. Some idiot told them about Tonia Lee Greenhouse.\" Tonia Lee, a local realtor, had been murdered in the master bedroom. \"But it went through.\" \"That\u0027ll make Mandy happy. By the way,\" the similar names had reminded me, \"we\u0027re going to dinner at Bill Anderson\u0027s tonight. You sold them a house, didn\u0027t you? What\u0027s his wife like?\"\n \"Nice enough, not too bright, if I remember correctly. They\u0027re renting, with an option to buy.\"\n After we said our good-byes, and I returned to my task at the sink, hurrying because the attic escapade had made me late, I tried to imagine what my mother would do in my present predicament - but it was like trying to picture the pope tap dancing.\n Sally arrived punctually, in a very expensive outfit that she intended to wear to rags. Sally had been forty-two for a number of years. She was an attractive woman with short permed bronzey hair. She was neither slim nor fat, neither short nor tall.\n During the past two or three years, Sally had been close to breaking into the big time with a larger paper, but it just hadn\u0027t happened. She had settled for being the mentor and terror of the young cub reporters who regularly came and went at the Sentinel as they learned their trade. For the first time, Sally gave me a ritual hug. It was a recognition of the big things I\u0027d undergone since last we met, the fact that I was now a respectable married woman, and not only married, but married to a real prize, an attractive plant manager who presumably had an excellent income. This really can all be conveyed in a hug.\n \"You look great, Roe,\" Sally pronounced.\n I don\u0027t know why people seem impelled to tell brides that. Is regular sex supposed to make you prettier? A number of acquaintances had told me how great I looked since we\u0027d come back from the honeymoon. Maybe only married sex made you look better.\n \"Thanks, Sally. Come on in and see the house.\"\n \"I haven\u0027t been in here in years. Not since it happened. Oh, who would have known there were hardwood floors! It looks wonderful!\" Sally followed me around, exclaiming appropriately at each point of interest. As I put lunch on the table, she told me all about her son Perry and the wonderful girl he\u0027d met in his therapy group, and about her husband Paul and the shakiness of their new marriage.\n \"Surely you can work it out, Sally! You had such high hopes when you married him, and it\u0027s only been a few months!\"\n \"Fourteen,\" she said precisely, spearing a strawberry with her fork. \"Oh. Well. Would marriage counseling help, do you think? Aubrey Scott is really good.\"\n \"Maybe,\" she said. \"We\u0027ll talk about it when Paul gets back from Augusta.\" \"So, can you tell me all about the disappearance?\" I asked gently, when she\u0027d poked at her dill pickle for a few seconds of recovery. \"Do you have the stories from the Sentinel?\"\n \"Yes, the main one. I really want to know what you didn\u0027t put in the paper, or what stuck out in your mind. Were you out here then?\" \"Along with a slew of other reporters. Though I did get an exclusive for one day. The disappearance was really hot for a while, until a week had passed with no news. But being the local reporter paid off.\" Sally laid down her fork and opened her briefcase. She extracted a few pages of computer printout from a file folder.\n \"Those are your notes?\" I\u0027d expected a spiral notebook with scribbles. \"Yes,\" Sally said with a hint of surprise. \"Of course I put them on a disk when I get back to the office. Let me see ... this will be a reconstruction.\" She glanced over the pages, organizing herself, and nodded. \"When the police got here,\" she began . ..\n There\u0027s an old woman standing out in the driveway. She\u0027s small, and gray, and alternately distraught and grumpy. Her name, she says, is Melba Totino, and she is the mother of Mrs. Julius, Hope Julius. They\u0027re all gone, she says: Hope, and her husband T.C., and their girl, Charity. They vanished in the night. She herself had risen at her usual hour and gone over to the house to prepare breakfast, as she always did. She had expected all of them to be there, even Charity, who had been home sick the day before. Charity is a sophomore at Lawrenceton High, newly enrolled. She\u0027d had a hard six weeks getting used to being in a new school, missing her boyfriend, but finally she\u0027d adjusted. She\u0027d had a low fever the past couple of days. But Charity, sick or not, now wasn\u0027t in the house.\n Melba Totino goes in by the front door, since the back door of the kitchen faced outward over a new expanse of concrete, poured the day before to make a patio. She is unsure whether or not it\u0027s okay to walk on the concrete yet, so she goes to the front. The door\u0027s unlocked. No lights on inside. No stirring, no movement.\n Mrs. Totino steps inside hesitantly, calling. She doesn\u0027t want to stroll in without warning. But no one answers her call. She creeps through the house, now anxious, looking about for signs of the untoward. The house is clean and peaceful. The cuckoo clock in the living room makes its brainless noise, and the old lady jumps.\n Where is her daughter? Where is Hope? With approaching panic, the old lady finally screams up the stairs, but no one answers. Telling herself she is being ridiculous, and she\u0027ll give them a real talking-to when they come home, Melba Totino sits at the kitchen table, waiting for someone to come. She doesn \u0027t dare to touch a thing. The dishes are all put away. There is no coffee perking, nothing baking in the oven. After half an hour, she walks back out the front door and looks in the garage. She hadn\u0027t bothered on her way over - why would she?\n And now, as far as she can see, everything is the same. She doesn\u0027t drive, she doesn\u0027t know anything about cars, but this car is her daughter\u0027s family car, the truck is her son-in-law\u0027s pickup, with \"Julius Home Carpentry\" proudly painted on the side, phone number right below.\n No one is in either vehicle.\n She goes from the entrance to the garage past the stairs leading up to her apartment, across the covered walkway over to the house, into the his backyard. She is glad she has her sweater on, there\u0027s a nip in the air for sure. There\u0027s a turkey buzzard circling in the sky. The yard itself is empty. She looks up to the second story of the house, hoping to see movement at Charity\u0027s window, but there is nothing.\n Bewildered, trying to keep her terror a secret from herself, the old woman walks slowly back to the front of the house, still trying to keep pristine that new concrete that the owners of the house will never see again. Finally, after some interminable hours, she calls the police.\n \"Parnell Engle drove by that morning in his pickup truck,\" Sally explained, \"and since he\u0027d poured the concrete the day before, naturally he glanced at the place as he went by. After he saw all the police cars there, he just happened to stop by the paper to check on his classified ad, and just happened to wander into the newsroom and let me know what he\u0027d seen.\"\n \"Naturally,\" I agreed.\n \"Of course, this was a couple of years before he \u0027found the Lord,\u0027\" Sally said. \"Lucky for me, because I was able to talk to the old lady before any other reporters even knew something had happened. By the next day she wasn\u0027t talking to anyone. Wonder where she is now?\"\n \"In Peachtree Leisure Apartments,\" I said smugly. \"She gave me a wedding present.\" It was not often I got to impart news to Sally. \"It\u0027s odd she chose to stay here, with no family. I gather she and her sister had been living in New Orleans. Wonder why she didn\u0027t go back?\" \"She told me she was waiting for the Juliuses to turn up.\" Sally shuddered, and took a sip of her iced tea. \"That\u0027s creepy in more ways than one. You know, Hope Julius would be dead by now, even if she was alive.\" I raised my eyebrows, and after a second, Sally realized what she\u0027d said. She shook her head in self-exasperation.\n \"What I mean is, Hope Julius had cancer,\" Sally explained. \"She had ovarian cancer, I think, very advanced. Though there was apparently little hope, she was undergoing radiation treatment in Atlanta. All her hair had fallen out... I remember seeing one wig and one empty stand in her room when the police let me walk through the house... Mrs. Totino said it was okay. One wig, a curly one that she wore almost every day, was gone. The one that was left was fancier, like she\u0027d had her hair put up. She wore that one to church and parties.\" \"Oooo,\" I said. \"That\u0027s awful.\" A woman\u0027s false hair, sitting there in her room when the woman was gone.\n \"It really was,\" Sally agreed. She turned a page in her notebook.\n \"Why was the wig there, I wonder? That makes it look bad for Mrs. Julius.\" \"Yes, it does. She wouldn\u0027t leave without her extra wig, would she? And the wig made the whole scene eerier... like Martians had beamed them up right after they\u0027d made their beds that morning, but before they\u0027d gone down to breakfast.\" \"They\u0027d made their beds,\" I repeated.\n \"Yes, unless something happened during the night, before they went to bed but after Mrs. Totino had gone to sleep up in her apartment.\" \"And what time was that, do you remember?\"\n \"Yes, I have it here... nine-thirty, she said. She was extra tired from all the activity of the day... the Dimmoch boy coming to visit Charity and help T.C., Parnell coming to pour the patio.\"\n It was hard picturing that as exhausting since someone else had done all the work. I said as much to Sally.\n \"Yes, but you see, since her daughter was so ill she\u0027d been doing most of the cooking, the evening meals anyway, and lots of the laundry, I gathered.\" \"Maybe that was why T.C. was agreeable to building her the apartment? Because Hope was so sick?\"\n \"That\u0027s what I presumed. I never met him. The few people who did meet him, like Parnell Engle, liked him, and liked Hope, too. The picture I get is of a rigid kind of man, very honest and aboveboard, very meticulous in his dealings, punctual, orderly; of course, some of that might be from being in the service for so long. As far as I can tell, Hope was not a strong person, emotionally or physically, and I\u0027m sure her illness had sapped her.\" \"And Charity?\"\n \"Charity was a typical teenager, according to the local kids who knew her for a few weeks. She talked all the time about her boyfriend she\u0027d had to leave behind when she moved here, but most of the girls I interviewed seemed to feel that was a ploy to make her look important. Though since the Dimmoch boy cared enough to drive over, I guess they were wrong. Her grades, if I am remembering correctly, weren\u0027t that good, implying either that she wasn\u0027t bright or that she was more interested in other things; don\u0027t know which. She was an attractive girl, they all said that in one way or another, even though she didn\u0027t seem so pretty in a photo. I managed to talk to a couple of kids who knew her when she lived in Columbia, and they all spoke of her as being a strong girl, one with a lot of adult qualities, especially after her mother got sick.\" I offered Sally another glass of tea. She looked down at her wrist.\n \"No, thanks. I\u0027ve got to be at a City Council meeting in ten minutes.\"\n Sally left me with a lot to think about as I put the dishes in the dishwasher.\n And I realized I\u0027d forgotten to ask her about the aerial search. After I saw Angel leave on some errand of her own that afternoon, I did something peculiar.\n I retraced Mrs. Totino\u0027s movements of the morning of the disappearance - no, the morning the disappearance was reported - as she had told them to Sally. I walked in the front door, looked around, went to the kitchen, went out the front door again, looked in the garage, went between the garage and the house to the backyard. I looked around it, and up at the window of our guest bedroom, the room that had been Charity\u0027s. Then I went in the front door yet another time. I was certainly glad we lived out in the country so no one would see this bizarre exercise, which netted me exactly nothing but chills up and down my spine.\n I called Lynn Liggett Smith that afternoon. Conversations between Lynn and me were always egg-walking exercises. On the one hand, she\u0027d married Arthur Smith, the policeman whom I\u0027d dated and been very fond of for months before he up and married Lynn - who was pregnant. I didn\u0027t care so much about that anymore, but Lynn felt a certain delicacy. On the other hand, we would have liked each other if it hadn\u0027t been for that, I\u0027d always thought. \"How\u0027s Lorna?\" I asked. I pictured Lynn at her desk at the Lawrenceton police station, tall, slim Lynn who\u0027d lost all her baby-weight very fast and resumed her tailored suits and bright blouses with ease. I\u0027d seen Lynn at the wedding, but of course she and Arthur hadn\u0027t brought the baby. Since I\u0027d seen Lorna being born, I was always interested in her progress. \"Is she walking yet?\" I had a very shaky idea of baby chronology.\n \"She\u0027s been walking for months now,\" Lynn said. \"And she\u0027s talking. She knows at least forty words!\"\n \"Eating real food?\"\n \"Oh, yes! You ought to see Arthur feeding her yogurt.\"\n I thought I would pass that up.\n \"So what can I help you with today, Roe?\"\n \"I wondered,\" I said, \"if you would mind very much looking in the file on the Julius disappearance, and telling me exactly how the police searched.\" Long silence.\n \"That\u0027s all you want to know?\" Lynn asked cautiously.\n \"Yes, I think so.\"\n \"I can\u0027t think of a good reason why not.\"\n The phone clunked as it hit Lynn\u0027s desk, and I heard other detectives talking in the background as the click of Lynn\u0027s pumps receded. With the phone clamped awkwardly between my shoulder and ear, I wiped the kitchen counter. I tried to decide what I\u0027d wear to dinner that night. Should we take a bottle of wine with us? What if the Andersons were teetotal? Lots of people in this area were.\n \"Roe?\"\n I jumped. The telephone was speaking to me.\n \"Every inch of the house was searched, and the garage apartment, too. No bloodstains. No signs of foul play. Gas in both vehicles, both vehicles running normally ... so they hadn\u0027t been disabled. Beds stripped and mattresses tested . ...ard gone over inch by inch. The fields visually surveyed. According to the file, Jack Burns requested an aerial search but the city didn\u0027t have enough money left in the budget to pay for one.\"\n \"Golly. Since there wasn\u0027t enough money, one wasn\u0027t done?\"\n \"You got it.\"\n \"That\u0027s wrong.\"\n \"That\u0027s fiscal responsibility.\"\n \"I just never thought about police department budgets not permitting things like that.\"\n Lynn laughed sardonically, and did a good job of it, too. \"Budgets don\u0027t permit lots of things we\u0027d like to do. Our budget doesn\u0027t even permit us to do some of the things we need, much less the things we\u0027d like.\" \"Oh,\" I said inadequately, still at a loss.\n \"But short of that, the investigation was very thorough. And the search was meticulous. There was a complete search of the house, an exhaustive search of the yard and the field around the house, and a lab examination of the two vehicles, all of which turned up absolutely nothing. Bus stations, airlines, train stations, all queried for anyone answering the description of any or all members of the family. That took some time, since they were all more or less average looking, though Hope was visibly ill. But no leads.\" \"Eerie.\" I jumped at the sound of the pet door as Madeleine entered. She walked over to her food bowl and deposited something in it, something furry and dead. \"Jack still talks about that case, when he\u0027s had a beer or two. Which is more often - \" Lynn stopped, reconsidered, and changed the subject. \"So how\u0027s your husband?\"\n \"He\u0027s fine,\" I said, a little surprised. Arthur had strong views about Martin, and he had shared them with Lynn, I could tell. \"He is a little older than you?\"\n \"Fifteen years. Well, fourteen plus.\"\n I could feel my brows contracting over my nose. I took off my glasses - the tortoiseshell pair today - and rubbed the little spot where tension always gathered. Madeleine was waiting for me to come over and compliment her. \"I want to talk to you sometime soon,\" Lynn said, with an air of suddenly made decision.\n Arthur and Lynn, through some law-enforcement channel, had heard something about Martin\u0027s former activities, I thought. All I needed at this point was someone else lecturing me. Or telling me something I didn\u0027t know about my own husband, pitying me.\n \"I\u0027ll give you a call when I\u0027m free,\" I said. \n","sourceLink":"https://allnovel.net/the-julius-house-aurora-teagarden-4/page-10.html","bookId":2239,"book":{"id":2239,"title":"The Julius House (Aurora Teagarden #4)","description":"Storyline: \n The Julius House (Aurora Teagarden Mysteries #4) \n Since she met her fiance Martin Bartell, Roe Teagarden has never been happier. There\u0027s a difference in age and in background, but he seems to know exactly what she wants - like the Julius house. Roe is thrilled when Martin gives her the house as a wedding present. She\u0027s a keen amateur sleuth, and she has always been intrigued by its infamous history: six years ago, the family who lived there disappeared, never to be seen again. As Roe throws herself into renovating the Julius house, her misgivings about Martin\u0027s rather murky past recede. But when Roe is attacked by an axe-wielding maniac, she realises that the secrets inside her four walls - and her brand-new marriage - could destroy her.\n \n","cover":"https://allnovel.net/images/the-julius-house-aurora-teagarden-4.jpg","author":"Charlaine Harris","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-julius-house-aurora-teagarden-4.html","creation":"Oct 5, 2019 8:58:30 AM","modification":"Oct 5, 2019 11:18:44 PM"}}
