{"id":66969,"no":37,"title":"Page 37","content":"Soon their lips met in a soft kiss. After a moment, Jon reluctantly eased his mouth from hers. He gazed at her, eyes narrowed, as if he wasn’t sure he should continue. As if he sought her permission… Maryellen brought her lips back to his. She’d practically thrown herself at him after Christmas, and he’d rejected her. Her heart would break if he spurned her again. She needn’t have worried. They kissed a second time, their mouths straining while they tore at each other’s clothes. Maryellen’s nightgown was easy to slip off. Jon, however, had remained fully clothed. While he unbuttoned his shirt, Maryellen heard Katie in the other room. Jon froze. Maryellen, too. “I’ll see if I can get her back to sleep.” Sometimes, if she gave Katie her pacifier, the baby would sleep for a few more minutes. Maryellen prayed she could convince their daughter to give her parents this rare opportunity. As quickly and quietly as possible, Maryellen threw on her nightgown and tiptoed into Katie’s room. Sure enough, as soon as she had her pacifier, Katie closed her eyes. Maryellen remained by her side and patted her back. All the while, she prayed the mood between her and Jon hadn’t been destroyed. She so badly wanted to make love with him. When she returned to the bedroom, Maryellen knew it was too late. Jon sat on the side of the bed, his back rigid as he faced the wall. “Katie’s asleep,” she whispered. He didn’t respond. Kneeling on the bed, she moved behind him and wrapped her arms around his shoulders. She kissed his neck, then ran her tongue over his earlobe and felt a shiver race through him. Jon took her hand and kissed her palm. “It’s a good thing Katie woke up when she did.” “She’s asleep, Jon,” Maryellen said. “It isn’t a good idea for us to get involved sexually,” he whispered. He got up abruptly and turned to face her. Maryellen sank back on her heels, humiliated beyond words by his rejection. “It would be the easiest thing in the world to make love to you now, but I’m not going to do it. The truth is, I don’t trust you. You’ve lied to me once. You tried to keep my daughter from me—” “That was before—” “Before what?” he demanded. Before I realized I could trust you, before I realized I love you. But she dared not tell him that. “I explained why I behaved the way I did,” she said, and kept her head lowered, unable to meet his gaze. “I was as honest as I knew how to be.” He didn’t say anything for a long moment. “I want to be honest with you, too, Maryellen.” His voice throbbed with sincerity. Hope flared in her and she raised her eyes. He stood with his fists clenched at his sides, his face hard. “I don’t trust you—or myself. I can’t.” “Why can’t you?” she pleaded. She could see the war that raged inside him. He longed to trust her, yearned to release the burden that weighed him down. She wondered why this burden, whatever it was, hadn’t troubled him a year earlier, when he’d made love to her. The reason suddenly occurred to her. “Jon,” she whispered, and somehow managed to blurt out the question. “Are you married?” “Is that what you think?” “I don’t know what to think,” she cried. Her raised voice must have startled Katie, whose loud wail shattered the tense moment. “I’ll get her,” Maryellen said, hurrying into the nursery. She picked up the baby and changed her diaper. Katie was in much better spirits, almost back to normal, which was encouraging. When Maryellen returned to the bedroom, Jon had disappeared. She looked out the living room window just in time to see his car turn the corner. Judging by the way he drove, he couldn’t get away from her fast enough. Rosie watched Allison tackle a thick stack of pancakes at the Pancake Palace. As if aware of her mother’s scrutiny, Allison glanced up and smiled. This was a chance for them to talk privately. Zach was off with Eddie on a father-son Boy Scout event and he’d suggested Rosie take Allison to dinner. It’d been a good idea. At the time of the divorce, Rosie had thought she’d never have anything to do with Zach again. She’d known they’d have to cooperate on practical matters, but beyond that, she’d figured their relationship was over. Things had turned out differently than she’d expected. These days, they talked frequently; in fact, they were much happier divorced. It pained her to admit that, but it was true. “All-you-can-eat pancakes for a buck,” Rosie said, reaching for the syrup dispenser once Allison had finished with it. “You certainly can’t beat the price.” “Cecilia says they’re the best in town.” If Rosie heard the other woman’s name one more time, she thought she’d scream. On the other hand, she was so grateful to have her daughter back, she knew she really didn’t have cause to complain. Two bucks for dinner was about all Rosie could afford. They still had massive legal bills—well, Zach did—and the cost of maintaining two homes. Plus, Rosie now had the additional expenses associated with working full-time. The money situation was as bad as ever, but she’d grown accustomed to stretching her pennies. “So you like the job at your father’s office?” The answer was obvious, but it opened the door to conversation. “I didn’t the first day,” Allison confessed, grabbing her water glass and gulping down several swallows. “Dad was awful to be around. He was totally unreasonable.” That wasn’t the way Rosie had heard it, but she wasn’t going to contradict Allison. “Then he made Cecilia my boss, and it worked out much better.” Rosie smiled, wondering what it was about Cecilia, whom she’d never met, that had influenced Allison so profoundly. “Dad told you about Cecilia and her husband, didn’t he?” “Yes.” Zach had also mentioned the baby Cecilia had lost. “Cecilia’s baby was named Allison, too?” Her daughter nodded. “Would it be all right if we put flowers on her grave one day?” “I think that would be very nice.” “Her birthday was June 25.” “Perhaps we should do it then,” Rosie suggested. Allison nodded again. “Okay! I’ll pay for them myself.” She poured a generous amount of syrup on what remained of her pancakes. “We talk, you know?” She looked up, as if she expected Rosie to object. “I know.” “Cecilia’s really smart, but she said she didn’t always realize that. Ian was the one who convinced her she could go to college and be anything she wanted.” “Didn’t I hear you say that Ian’s away just now?” “The term is ‘at sea,’ Mom.” Rosie hid a smile. “Sorry.” “Do we know anyone else who’s married to someone in the navy?” Rosie had to think about that. “Mrs. Alman’s husband is in the navy. I teach with her.” “Oh,” Allison murmured absently. The question Rosie had wanted to ask her daughter, and dared not, clamored within her. Zach hadn’t referred to Janice Lamond in weeks, and for that matter, neither had Allison. It wasn’t right to grill her children about their father’s activities; Rosie had promised herself she’d never put them in a situation that would divide their loyalties. She’d never force them to defend their father—or worse, choose between their parents. The silence about the other woman confused her, but then she hadn’t mentioned Bruce Peyton, either. Not that there was much to say… “So how’s everything at the office?” Rosie asked as nonchalantly as she could. She hoped Allison would bring up Janice’s name without any prompting. “Dad’s really, really busy. Tax season is hard. He goes to work at six and he usually has to stay late. He has appointments all day. I hardly see him anymore.” Zach had always been an early riser. During tax season, he often left the house before dawn, usually while Rosie was still asleep. From experience, she knew how tired and cranky he could be at the end of the day, too. “I hope he’s hired the extra help he needs,” Rosie muttered. Allison laid her fork next to her plate. “Mom, are you trying to find out about Mrs. Lamond?” Instant color heated Rosie’s cheeks. She could deny it and almost did, but Allison was smart enough to recognize a lie. Rosie nodded. “I apologize, sweetheart, I shouldn’t be—” “She quit,” Allison said as she leaned toward Rosie in a conspiratorial kind of way. A smile flashed in her daughter’s eyes. “Quit?” Rosie repeated. “When?” “Weeks ago. Before Christmas.” Before Christmas? That was impossible. Rosie vaguely remembered Zach’s saying he’d given the other woman a promotion. “What’s the matter, didn’t she get a big enough pay raise?” Rosie asked. She didn’t try to disguise her dislike for the other woman. “I don’t know anything about a pay raise, but the gossip is she left without notice and Dad was really upset about it.” Rosie would just bet he was. “The other staff members didn’t like her, either.” “Really?” This was interesting, and contrary to what Zach had told her. He’d made Janice sound like a paragon of efficiency and helpfulness, implying that no one could resist liking such a friendly, supportive person. “At first Mrs. Lamond was really nice. That’s what Mrs. Long said—you know, the office manager. But then later Mrs. Lamond got all uppity with the other staff. They said she manipulated Dad to do whatever she wanted.” As if Rosie didn’t already know that. “I’m sure she did,” she said. “Do you know why she quit like that?” “No one seems to have any idea.” Rosie would have derived real satisfaction from discovering the details. “Do you want me to find out more?” Allison asked, obviously eager to dig up dirt. The temptation was strong, but Rosie shook her head. “Don’t worry about it.” She and Allison chatted easily through dinner, laughing frequently and even reminiscing about pre-divorce days. It buoyed Rosie’s spirits to have this relaxed conversation with her daughter—and to learn that the Lamond woman was gone from the office. The following afternoon, Rosie dropped by the accounting firm. She hadn’t been to the office since shortly before the separation, mainly because she hadn’t wanted to give Janice Lamond the opportunity to gloat. Mary Lou Miller was at the reception desk. She looked up when Rosie stepped into the office, and her face showed surprise, followed almost immediately by genuine welcome. There’d been a time when Rosie’s relationship with the office staff had been pleasant and mutually respectful. “Mrs. Cox, it’s so good to see you!” Mary Lou said. “Hi, Mary Lou.” The sense of welcome was gratifying and helped ease her nervousness. Rosie hadn’t mentioned to Zach that she planned to stop by. Classes were cut short for the day because of a teachers’ seminar on new curriculum requirements in the areas of math and science. Rosie was exempted, since she’d taken the course while updating her skills. She had a rare afternoon free.","sourceLink":"https://allnovel.net/311-pelican-court-cedar-cove-3/page-37.html","bookId":1943,"book":{"id":1943,"title":"311 Pelican Court (Cedar Cove #3)","description":"Storyline: 311 Pelican Court (Cedar Cove #3) Rosie Cox 311 Pelican Court Cedar Cove, Washington Dear Reader, One thing about Cedar Cove  people sure are interested in what other people are doing. Take me, for instance. Everybody in the town knows that my husband, Zach, and I recently got a divorce. Everybody also know that Judge Olivia Lockhard decreed a pretty unusual custody arrangement. It won\u0027t be the kids moving between my place and Zach\u0027s. We\u0027re the ones who\u0027ll be going back and forth! Olivia isn\u0027t immune to gossip herself. Will she stay with Jack, the guy who runs our local paper, or will she get back with her ex? Inquiring minds want to know! But the really big gossip has to do with the dead guy  the man who died at a local bed-and-breakfast. Who is he and why did he show up there in the middle of the night? Roy McAfee, our local private investigator, is absolutely determined to find out. I hope he does  and then I\u0027ll let you know! See you soon. . . Rosie","cover":"https://allnovel.net/images/311-pelican-court-cedar-cove-3.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/311-pelican-court-cedar-cove-3.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:02:26 AM"}}
