{"id":66937,"no":5,"title":"Page 5","content":"“Hi,” she said weakly, staring down at the floor and the watery mess she was standing in.\n “So you’ve got yourself in a little predicament here.” His smile warmed her.\n “Were you serious about wanting to see Katie’s birth?” she asked. The panic was completely gone now that he was here.\n “I’d like that if it’s possible.”\n “Looks like you’ve just been nominated to drive me to the hospital’s birthing center.”\n In three quick strides he was across the room and scooped her into his arms as if her considerable weight was of little consequence.\n She wanted to protest, to suggest she was too heavy for him, but she didn’t. For the first time since she’d tried to reach her mother, Maryellen felt protected. Safe. He helped her change clothes and then carried her out the door.\n He carefully placed her inside his vehicle. “Is your suitcase packed?” he asked.\n She nodded. “All except my toothbrush.”\n “I’ll grab that and your overnight bag and be right back.”\n He left her and returned just as she was having a contraction. They’d gotten much stronger in the minutes since her water broke. Closing her eyes, she tilted her head back and exhaled, trying to remember everything she’d learned in her birthing class.\n Jon was in the driver’s seat beside her when she opened her eyes again.\n “You okay?” he asked.\n He’d gone pale, she noticed. She attempted to reassure him with a smile.\n Later, Maryellen remembered almost nothing about the ride from Cedar Cove into Silverdale and the birthing center. Jon didn’t speak, and she didn’t, either, concentrating on the breathing techniques she’d learned while he drove, expertly weaving through traffic.\n When they arrived at the center, there seemed to be all kinds of activity going on around her. She was stripped, prepped, helped into bed and had a fetal monitor attached. Jon disappeared, and she wondered if he’d dropped her off and then left again. She supposed that made sense, since she’d clearly called him in the middle of his shift.\n Then she was alone in a comfortable room with every modern device to distract her from the pain. There was soft music and a television with VCR should she care to watch, but none of that interested her.\n The contractions were far more intense than anyone could have warned her. She mentally counted the seconds as each contraction came over her, working its way from her back to her front, tightening her belly.\n “Maryellen?” Jon’s voice was low.\n Her eyes flew open and she found him standing in the doorway. Her relief and gratitude were instantaneous. Propping herself up on one elbow, she asked hopefully, “Can you stay?”\n “If that’s what you want.”\n She did. Until that moment, she hadn’t realized how much she wanted him with her, how much she needed him. Not just anyone. Him.\n Coming all the way into the room, he sat on the chair by her side and studied the monitor as it recorded her labor. Although he hadn’t attended a single birthing class, he seemed to know exactly what to say and do to comfort her. When she moved onto her side, he rubbed her back and whispered reassurances. His voice was encouraging as he repeatedly told her what a good job she was doing.\n The length and intensity of the contractions continued, and in the middle of one that lasted almost a minute—the longest minute of her life—the pain overwhelmed her. She whimpered softly.\n “Do something!” Jon demanded of the nurse who happened to step into the room just then. “She can’t take this pain.”\n The woman smiled benevolently. “Maryellen has opted for a natural birth. We’re simply respecting her wishes.”\n “I’m okay,” Maryellen said, but she wondered how long she could hold out. “Would it be all right if I held your hand?”\n Jon was on his feet and leaning toward her. He braced his elbow against the bed and offered her his hand. From that moment on, she clung to him. When it was time to bear down, Jon was with her, his head close to her own, his arm around her shoulders. Dr. Abner arrived, and that assured her it wouldn’t be much longer.\n Jon introduced himself and then in a low, soothing voice, continued to offer Maryellen encouragement and support. Leaning against him, she strained, pushing this child from her body and panting wildly between pains.\n With the next contraction she gripped Jon’s hand and pushed, groaning with the effort. Sweat poured off her. Then all at once, her daughter slipped free. Maryellen gasped as she heard Catherine Grace’s fragile cry.\n Pride and love filled Maryellen and her eyes brimmed with tears. She smiled tremulously at Jon and was surprised to see that he, too, had tears rolling down his cheeks.\n “Welcome, Katie,” she whispered.\n Jon looked at her. “Katie, not Catherine?”\n Maryellen nodded. She’d gotten in the habit of calling her daughter that. “Catherine seems a bit of a mouthful for such a tiny baby, don’t you think?” Katie was his mother’s name, too, and Maryellen wanted to do that for him—to honor the mother he’d obviously loved.\n Jon studied their child’s red face, contorted by angry cries. “Thank you,” he whispered, and his arm tightened around her shoulders. Dr. Abner handed their wailing daughter to the nurse.\n “You can come with me, Dad,” the delivery nurse told him. “I’m going to weigh and wash her up, and then you can hold your little girl.”\n Jon seemed to be seeking her approval. With tears of joy and jubilation, Maryellen nodded. Nothing in the world could compare to this feeling. This wonderful sense of triumph, of joy, of love. Because Maryellen already knew that she loved her baby. The power of that love settled over her heart unlike anything she’d ever experienced.\n Jon and the nurse were busy on the other side of the room. Maryellen couldn’t see everything that was happening, but she saw Jon’s face when the woman settled Katie in his arms. His look was one of such awe and elation, she felt profoundly moved. At just that moment, he glanced up and their eyes met.\n “She’s beautiful,” he mouthed, cradling her protectively in the crook of his arm.\n Wanting to hold her, Maryellen stretched out her arms and Jon crossed the room and placed Katie in her waiting embrace.\n This was the way it would be with them, Maryellen realized. They’d have to learn to share their daughter. To work together. To put their own wants and needs aside—to put Katie’s first.\n There was a knock at the door, which Maryellen ignored. Instead, she studied Catherine Grace. Her tiny face was still red and her eyes were squeezed tightly shut, as if the lights were too strong for her.\n Jon offered her his finger and Katie’s tiny hand wrapped around it.\n A young woman, apparently a volunteer, stuck her head into the room. “A Mrs. Sherman is outside. She says she’s supposed to be your birthing partner.”\n “That would be my mother,” Maryellen explained, smiling.\n The volunteer smiled back. “I’ll send her in.”\n A couple of minutes later, both her mother and Kelly were in the room. Maryellen was bombarded with questions. Before she was even aware of it, Jon had disappeared. She hadn’t had a chance to thank him.\n While she waited for the city council meeting to start, Charlotte Jefferson dug out her knitting. It distressed her that more people in the community didn’t concern themselves with local government. But then, this was only her second meeting in seventy-five years. Until recently, she hadn’t paid much attention to civic affairs herself.\n “Hello, Louie,” she said, nodding politely when the mayor walked in. She sat alone in the front row.\n “I understand congratulations are in order,” Louie Benson said as he strolled past her. The Bensons were an old Cedar Cove family. Louie’s younger brother, Otto, was a prominent attorney in town.\n “Yes, I have a great-grandson,” she confirmed. “My first.”\n “I understand Grace Sherman’s a grandmother now—for the second time, I think.”\n “Just last week.” Grace was as proud of her first granddaughter, Maryellen’s baby, as she was of her grandson, Kelly and Paul’s little Tyler. Charlotte thought it had worked out nicely that her daughter, Olivia, and Olivia’s best friend could be grandmothers together. Those two had always been close and a blessing to each other.\n “It’s unusual to see you at the council meetings,” the mayor said. “Not that it isn’t a pleasure.”\n “I’m here for a reason.” Charlotte jerked fiercely on her yarn as she continued knitting.\n “Anything I can do?” the mayor had the good sense to inquire.\n Frankly Charlotte had hoped he’d ask. “I want to propose that this town open a health clinic. I think it’s shameful that we haven’t had one before now.” At a minimum, people had to drive ten or fifteen miles to the Bremerton area for medical attention, and it often meant waiting hours in the emergency room. A town the size of Cedar Cove could easily support a clinic. But Charlotte wanted a particular kind of health facility, a place for everyone in Cedar Cove.\n “Now, Charlotte—”\n “One that’ll take patients on a sliding fee scale,” she added, unwilling to listen to Louie’s objections. “I know Medicare and Medicaid patients would welcome the opportunity to avoid having to go all the way into Bremerton or Silverdale for their health needs.”\n “I agree, but—”\n “Too many of my friends are reluctant to see a physician for fear of what it’ll cost.”\n “Yes, I realize that, but—”\n “Louis Benson, you’re talking like a politician.”\n “Now, Charlotte, you and I both know this is strictly a figurehead position. The town’s run by a hired manager. If you want to talk to Matthew Harper about setting up a low-cost health clinic, then go ahead, but I can tell you right now there’s no budget for it.”\n Fine, if that was what it took, she’d discuss this with the manager. “I will.”\n The mayor looked slightly uncomfortable and glanced over his shoulder. When he spoke again, he lowered his voice. “A bit of advice.”\n “Anything you can tell me would be welcome,” she assured him, staring down at her knitting as if it demanded her full concentration.\n “Get all your facts together before you see Matt Harper.”\n “I will,” she assured him. Harper was reputed to be a tough bargainer, scrupulous about town budgets, but he’d met his match if he thought he could roadblock her efforts. If it was the last thing she did before she died, Charlotte fully intended to see that Cedar Cove got a health facility of its own.\n The door opened, and the mayor quickly straightened. “How’s everyone at the SeniorCenter doing?” he asked, as if making polite conversation.\n “Laura’s rheumatism is acting up,” Charlotte informed him. “She says it’s going to be a hard winter. Bess has had a cough all summer. I keep telling her she should see a doctor, but she’s afraid of what he might tell her so she refuses to go. If there was a clinic here in town, I’d make the appointment and drag her in myself. And Evelyn…” Charlotte paused when she realized Louie was no longer listening. His attention was focused elsewhere. \n","sourceLink":"https://allnovel.net/311-pelican-court-cedar-cove-3/page-5.html","bookId":1943,"book":{"id":1943,"title":"311 Pelican Court (Cedar Cove #3)","description":"Storyline: \n 311 Pelican Court (Cedar Cove #3) \n Rosie Cox \n 311 Pelican Court \n Cedar Cove, Washington \n Dear Reader, \n One thing about Cedar Cove  people sure are interested in what other people are doing. Take me, for instance. Everybody in the town knows that my husband, Zach, and I recently got a divorce. Everybody also know that Judge Olivia Lockhard decreed a pretty unusual custody arrangement. It won\u0027t be the kids moving between my place and Zach\u0027s. We\u0027re the ones who\u0027ll be going back and forth! \n Olivia isn\u0027t immune to gossip herself. Will she stay with Jack, the guy who runs our local paper, or will she get back with her ex? Inquiring minds want to know! \n But the really big gossip has to do with the dead guy  the man who died at a local bed-and-breakfast. Who is he and why did he show up there in the middle of the night? Roy McAfee, our local private investigator, is absolutely determined to find out. I hope he does  and then I\u0027ll let you know! See you soon. . . \n Rosie\n \n","cover":"https://allnovel.net/images/311-pelican-court-cedar-cove-3.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/311-pelican-court-cedar-cove-3.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:02:26 AM"}}
