{"id":94403,"no":40,"title":"Page 40","content":"Muttering an oath, he gained his feet and stalked toward the window. His senses told him the storm had passed. Soon, the sun would set. If he drew back the heavy drapes and leaned out the window, how long would it take for the setting sun to turn his body to a pile of smoldering ash? He took a step forward, watched his hand move toward one of the drapes… “Stop it!” Savanah grabbed his arm and pulled him away from the window. “What are you doing? Have you lost your mind?” He stared down at her, at the pulse beating rapidly in the hollow of her throat. “Rane, please…” She laid a gentle hand against his singed cheek. “I love you. I can only imagine what you’re going through, how painful this must be…” “You can’t imagine it! No one can. I can’t look at you without wanting you, without wanting to drink and drink until there’s nothing left! Why do you stay with me? You should be running for your life. You’re in danger, Savanah, more than you know.” His words, the intensity of his gaze, frightened her to the depths of her being and yet she couldn’t leave him, couldn’t run, not even to save her own life. He was hurting, suffering, and it was all her fault. If she hadn’t gone outside, none of this would have happened. She lifted the silver chain over her head, then brushed the hair from her neck and canted her head to one side. “Didn’t I tell you not to take that off?” He stared at her, his eyes glowing, his hands clenched at his sides. “I’m not sure even that could save you.” “I’m not afraid. Drink, Rane, if that’s what you want, what you need.” “Dammit, woman, haven’t you heard a word I said?” “I heard.” Cupping his face in her hands, she drew his head down. “Do what you have to.” His hands folded over her shoulders, imprisoning her in his grasp. His tongue brushed his fangs as he inhaled the scent of the crimson river flowing through her veins. She was his for the taking. The thought enflamed him. He was lowering his head to her neck when she murmured, “I love you.” Rane lifted his head, his gaze meeting hers. And as had happened once before, the trust shining in her beautiful sky-blue eyes, the unconditional love in her voice, calmed the beast within him. He sighed as her arms slid around his waist. “Savanah.” Whispering her name, he rested his forehead against hers. As long as she was his, maybe there was hope for him, after all. Chapter Thirty-Four Taking a deep breath, Savanah unlocked the front door of her father’s house and stepped into the entryway. She stood there a moment while memories of happier times spent in this house played through her mind—a vague recollection of her mother walking her to kindergarten on the first day of school, the scent of freshly baked cookies that had always lingered in the air on Monday afternoons, the birthday parties and holidays in the backyard, the flowers her father had sent her the day she received her first big assignment at the Chronicle, all the nights she and her father had spent talking, laughing, working together. “Oh, Dad,” she murmured, “I miss you so much.” She was about to go into the living room when Rane moved up beside her. “Wait a minute.” Frowning, she looked up at him. “Is something wrong?” “I don’t think so. Just wait.” Rane moved past her into the living room. Standing in the middle of the floor, he opened his preternatural senses. The air smelled a little stale; other than that, he sensed nothing amiss. After closing and locking the front door, he carried her belongings and one of his suitcases into the living room and dropped them on the sofa. Following him into the room, Savanah turned on the table lamps. “It’s just a house without him,” she said quietly. “He’s the one who made it a home.” Rane nodded, but said nothing. Savanah blew out a sigh. She had known it would be hard coming back here, but she hadn’t expected it to hurt so much. “Did you bring my mother’s books?” she asked. “No.” “Where are they? Did you leave them at Mara’s? I thought…” “I buried them up in the mountains before we left.” Savanah blinked at him. “How can I refer to them if they’re not here?” she asked, striving not to lose her temper. “They’re my books, Rane. I want them.” “I know you do.” He rubbed a hand over his jaw. “But…” “But you don’t think I can keep them safe?” “I don’t think you’ll be safe as long as they exist.” He was probably right, but right or wrong, she was too tired to argue about it now. Swallowing her anger, she said, “It’s late. I’m going upstairs to take a bath.” She picked up her suitcase. “Are you staying?” “If you still want me to.” “I do.” He couldn’t help admiring the gentle sway of her hips as she headed for the staircase, or the way the lamplight gilded her hair. He could smell her frustration, knew she was annoyed with him because of the books, but he didn’t care. He had to do what he thought was best, and right now, keeping Savanah and those accursed books as far apart as possible seemed like the wisest thing to do. He glanced up as he heard the water come on in the bathroom. It took damned little effort to imagine her disrobing, her movements graceful and unhurried, her skin smooth and clear, aglow with good health. Warm and alive. He swore softly as images of Savanah reclining in a tub filled with foamy bubbles sprang full-blown into his mind. Before he quite realized what he was doing, he was climbing the stairs two at a time. He hesitated only a moment before he opened the door and stepped into the bathroom. Savanah’s eyelids flew open as he entered the room. “Oh! It’s you. You scared the heck out of me.” “Sorry.” His voice was low, little more than a rasp of sound. The frothy bubbles floating on the surface of the water did little to hide the swell of her breasts or her long, slender legs. She looked up at him, her head canted to one side, one brow raised in amusement. “Would you care to join me?” “I can’t think of anything I’d rather do.” “Well, come on, then.” She sat up to make room for him, watched avidly as he quickly undressed. Her gaze moved over him. The burns on his face looked pretty much the same as they had the day before, but the angry redness on his arms had faded. “Turn around.” He lifted on brow. “Excuse me?” “I want to look at your back.” The muscles in his jaw tightened as he did as she asked. “It looks better. I thought you said it would take a long time to heal.” Rane shrugged as he turned to face her. He supposed the blood he had taken from her, along with the blood from the two young women and four men on the mountain, accounted for his healing. Water sloshed over the edge of the bathtub as he stepped in and sat down, facing her. “You need a bigger tub.” “You think?” He shrugged. “Maybe not.” He spread his legs, then drew her into the vee of his thighs so that her legs rested over his. “So, here we are, naked in the water again,” Savanah said with a grin. “Indeed.” She touched his cheek. “Does it still hurt terribly?” “Not as bad as it did.” Taking up the soap, he reached around her and began washing her back. Savanah rested her forehead on his shoulder. “That feels wonderful.” A soft sound of assent rose in Rane’s throat as his hands stroked over her soapy flesh. He washed her arms, her neck, her breasts. Leaning forward, he dropped kisses on the crown of her head. After he had washed her, she took the soap to return the favor, but one touch of her hand on his chest and he was lost. Drawing her into his arms, he rose in one fluid movement and carried her into the bedroom where he lowered her onto the bed and then followed her down, his body covering hers as his mouth claimed her lips in a long searing kiss. She ran her hands over his body, reveling in the way his skin rippled beneath her fingertips, in the flex and play of his biceps as she kneaded the muscles there. She quivered with anticipation as his hands caressed her, bold hands, strong hands. Sensations flowed over her and through her—the damp sheets at her back, Rane’s heated flesh, the sweep of his tongue across her lips, the brush of his hair against her shoulders as he nuzzled her neck, the rapid beat of her heart, the husky yearning in his voice as he whispered love words in her ear. Right or wrong, she wanted him, all of him, the good and the bad. Wanted him with a desperation she had never known before. He was the strength to her weakness, a constant in her ever-changing world. The light to her darkness. No doubt he would find that as amusing as she did. Grinning inwardly, Savanah wrapped her legs around his waist, holding him close, afraid he would change his mind yet again and leave her yearning for more. But he had no thought to leave her, not now, not ever again. Closing her eyes, Savanah gave herself into his keeping, body and soul, and as she did so, her thoughts became his, as his became hers. It was amazing, to feel what he felt, to know he experienced her pleasure as she experienced his. There was no shyness between them, no need for words. She satisfied his every desire as he satisfied hers. Truly, they were two halves made whole, two bodies with one heart, one mind. The touch of his fangs at her throat sent her world spiraling out of control. Sobbing his name, she writhed beneath him, her body quivering with ecstasy until she lay sated and spent beneath him. Rane’s climax came quickly on the heels of her own. With a sigh, he wrapped his arms around her and rolled onto his side so that they lay facing each other, their bodies still intimately joined together. His gaze searched hers. “Still no regrets?” “Not one. You?” He shook his head. He had many regrets in life, but making love to Savanah wasn’t one of them. He just wished he was worthy of her love, her trust. He had never intended for their relationship to go this far, never intended to fall in love with her, but now…it was beyond his control. He would love her, cherish her, until the end of time.","sourceLink":"https://allnovel.net/night-s-pleasure-children-of-the-night-4/page-40.html","bookId":2302,"book":{"id":2302,"title":"Night\u0027s Pleasure (Children of The Night #4)","description":"Storyline: Night\u0027s Pleasure (Children of The Night #4) Desire Casts a Dark Spell... Savanah Gentry’s life was so much simpler when she was a reporter for the local newspaper. That was before her father’s sudden death drew her into a mysterious new world she was just beginning to understand. A Vampire hunter by birth, Savanah has been entrusted with a legacy that puts everyone she cares for in danger—including the seductive, sensual Vampire who unleashes her most primal desires. Rane Cordova has always been alone, half hating himself for his dark gift, even as he relishes its extraordinary power. But one look at Savanah fills him with the need to take everything she has to give and carry her to heights of unimagined ecstasy. And though he never intended their relationship to go this far, now Savanah is in more danger than she knows—and facing a relentless enemy determined to eliminate Rane and all his kind.","cover":"https://allnovel.net/images/night-s-pleasure-children-of-the-night-4.jpg","author":"Amanda Ashley","type":"Mystery","source":"allnovel","link":"https://allnovel.net/night-s-pleasure-children-of-the-night-4.html","creation":"Oct 5, 2019 8:58:34 AM","modification":"Oct 5, 2019 6:06:59 PM"}}
