{"id":91794,"no":23,"title":"Page 23","content":"\\n\\n “Yes, we’ll fill out a report,” he told her. “I’ll go ahead and get an officer out here for you to do that. I don’t think you’ll find that any of your coworkers took the book.”\\n\\n She thanked him, flustered, and they went out. Liam headed to his house to change for the viewing at the funeral home. He was determined to be there when Kelsey arrived.\\n\\n Kelsey left the house, locking it carefully as she did so, ridiculously pleased that she was leaving while it was still daylight.\\n\\n She thought she smelled the scent of death and decay again, but she was impatient with herself; she had it set in her mind that she could still smell the horrible lonely end that had met her grandfather, and she wasn’t going to change what was set in her mind. She felt oddly irritated with Liam, though at the same time, she wished that he was with her. She wasn’t a scaredy-cat. He was turning her into one.\\n\\n She walked slowly to the funeral home, knowing she was a little bit early. But that didn’t matter. Liam was there when she arrived. He was extremely handsome in a dark pin-striped suit, clean shaven, his hair still damp. He met her at the entrance.\\n\\n “You’re early,” he told her.\\n\\n “You’re earlier,” she noted.\\n\\n He smiled. “I didn’t want you to be alone.”\\n\\n “Thanks.”\\n\\n They walked on in. As Liam had predicted, the hallway was alive with flowers. The funeral director came out to greet them, telling Kelsey that her grandfather’s was the only viewing that night, and so they had been liberal with the layout of the arrangements, which he hoped was fine with her. She assured him it was.\\n\\n “Where is…Cutter?” she asked.\\n\\n “Right here, first door to the left,” the director told her.\\n\\n They walked into the room with its rows of chairs, multitude of wreaths and flower arrangements, and, at the far end, the podium, stand and coffin.\\n\\n The coffin was open.\\n\\n Liam walked in ahead of her, moving quickly. She heard him make a strange sound, and then he turned back to her.\\n\\n “Kelsey, please. Let me have them close the coffin. I thought they were going to leave it closed,” he said, irritated.\\n\\n The funeral director, correctly solemn in his dark suit, said in quick explanation, “In such cases, we wait for the family to arrive.”\\n\\n Liam was aggravated, she knew. Yet why he didn’t want her seeing her grandfather perplexed her, and made her want to see him more.\\n\\n She pushed past Liam and came to the coffin.\\n\\n She’d seen what ravages disease could cause the human body, and in that sense, he didn’t look horrible.\\n\\n He was pasty and slightly plastic-looking, as she’d expected. Pale. Sunken. She could see that his eyes had been delicately sewn shut.\\n\\n But his eyes were open.\\n\\n Tiny trails of spiderweb-thin thread clung to his eyelashes.\\n\\n He stared out at the world in horror, as if, even in death, he was still seeing something eternally malignant and evil.\\n\\n “Kelsey.”\\n\\n Liam was behind her; his hands rested on her shoulders.\\n\\n “It’s all right,” she said. “I’ve seen death before.”\\n\\n “Please, let’s close the coffin,” he said softly.\\n\\n She nodded.\\n\\n She had brought a tiny cross Cutter had given her when she had been a little girl. She pulled it from her purse and set it around his icy-cold fingers.\\n\\n The director had called for one of his assistants. As they closed the coffin, the first visitor for the evening arrived, the Episcopalian priest from Cutter’s favorite church on the island. He greeted Kelsey with familiarity, and she remembered him from her childhood. She felt oddly detached and cold, still stunned by the look in her grandfather’s eyes, open and dusted with the remnants of the stitches that had held them closed.\\n\\n But she felt that people were what they were—creatures of social habit. She greeted Father Tom warmly, thanking him for coming. He told her that her grandfather had been a beautifully spiritual man—loving God no matter what his thoughts or disagreements with any organized religion might have been.\\n\\n She tried to make sure that she gave all the proper responses. Father Tom was speaking with sincerity. She had known that her grandfather had always respected and cared about him and that her parents had enjoyed him as well. It was wonderful that he was here.\\n\\n She refrained from shouting out, What made my grandfather die with that horrible terror in his eyes? Tell me, tell me, please, that he was never into devil worship, that he never delved into the black arts, that…\\n\\n “…and so wonderfully intelligent, Kelsey. He was a brilliant man. He knew the world, and what was so wonderful was that he understood all God’s creatures—and humanity with its different cultures and beliefs. Well, you knew him. Rest assured, he is in God’s hands now,” Father Tom said.\\n\\n She thanked him. He told her to let him know anytime she wanted him to start the prayer service she’d planned for the evening.\\n\\n By then, the next visitor had arrived.\\n\\n Cutter Merlin’s attorney, Joe Richter, had arrived. He awkwardly told her how sorry he was and patted her hands over and over again. Once more, she wanted to scream. They had been fine in Richter’s office, but now he didn’t know what to say and she didn’t, either.\\n\\n “Ah, well, at least he left you in a very nice position. That can’t be said in many such a situation,” Richter told her.\\n\\n “Mr. Richter, my parents left me in a fine position. They taught me to get an education, and I have my own work and my own income,” she reminded him.\\n\\n He blushed to the roots of his white hair. “I didn’t mean…forgive me. But, you know, Cutter seriously left everything in your hands. He left you instructions, but he also left a sizable fortune and incredible riches, you know.”\\n\\n “I haven’t begun to go through his collections yet, Mr. Richter. And I plan to honor all of my grandfather’s wishes.”\\n\\n Maybe she looked uncomfortable. Liam was speaking with the priest and the funeral director, but Jonas had arrived and came over to rescue her. “Kelsey,” he said, excusing himself as he came between them. He gave her a warm hug, steering her away from the attorney. “You all right?” he asked her, studying her eyes. “You seem a bit shell-shocked.”\\n\\n She shook her head. “I’m fine. Honestly. Where’s Clarinda?”\\n\\n “She’ll be along in a minute. She had to finish getting ready for work—it’s Sunday night, and she and Katie are both on the schedule, but they’re coming by.”\\n\\n Just then, Katie, David, Sean, Vanessa and Clarinda came in, all giving Kelsey hugs and saying appropriate things. She assured them she was fine.\\n\\n People she didn’t remember began to arrive. Then there were those she did recognize. Several of her old teachers were there, and others from her grandfather’s and her parents’ generations. If she’d been afraid that it would be a lonely viewing, that fear was quickly set to rest. The room was overflowing by the time Father Tom gave his little eulogy and prayer. The priest was already speaking when Jaden and Ted slipped in, nodding to her across the room and giving her the kind of “we’re here for you” smiles that friends gave at such a time.\\n\\n It was nice; it was good. Cutter would have been happy. He would have wanted all the money that had gone into flowers used in a more productive way, but other than that, he would have been proud. Old cronies spoke of better, brighter times. Days gone by when they’d argued over beers, dressed up for Hemingway Days just to outdo one another, and various other events. One of her old teachers spoke about how wonderful Cutter had been about coming in to talk to different classes about different cultures or one of his many escapades.\\n\\n It was eleven by the time everyone trailed out. Kelsey felt drained.\\n\\n Clarinda, Jonas, Katie and David had slipped out early, heading off to a Sunday night’s work. But Jaden and Ted lingered.\\n\\n Kelsey yawned broadly, certain Liam would notice.\\n\\n He didn’t.\\n\\n “Jaden, how are you doing on the reliquary?” Liam asked.\\n\\n “I think I might have it pinned down to the time and place,” she said. “There are some markings on the bottom. I went in a few wrong directions, but I think it’s French,” she said excitedly. “And, if I’m right, it might hold a fragment of the remnants of Joan of Arc.”\\n\\n “What?” Kelsey gasped.\\n\\n “Don’t go getting excited. There are a few more tests to perform, and for a real assessment, you’re going to need at least one other expert. But it’s fascinating,” Jaden said.\\n\\n “We know people who are experts, of course,” Ted said. “But you might want to bring in an independent, as well. Someone from one of the world’s major universities, someone specializing in Roman Catholic history, relics and symbolism.”\\n\\n “Joan of Arc was burned at the stake. To ash,” Liam said.\\n\\n “Even burning at the stake allows for bone fragments,” Jaden said.\\n\\n “So, Cutter was holding a reliquary that might have contained the bones of a highly regarded saint?” Kelsey asked.\\n\\n “Thought by many to be exceptionally holy, to place the possessor in a position to combat evil,” Jaden said.\\n\\n “I think that the Church has gone beyond that kind of thought process,” Kelsey said, puzzled. “I mean, such relics might be honored, as we honor our dead…or bow to a cross, but to actually believe that a reliquary could ward off evil? I don’t know about that.”\\n\\n “I didn’t say that the Catholic Church had such a belief or doctrine,” Jaden said. “I believe that there are people out there who might believe it.”\\n\\n “Everything is in belief, isn’t it?” Ted asked, and shrugged.\\n\\n “If it is what I think it is, it’s worth a small fortune,” Jaden said.\\n\\n “If it is what you think it is, I’ll find a way to give it to the Catholic Church,” Kelsey said.\\n\\n Jaden laughed. “I honestly don’t believe that God will smite you for selling it.”\\n\\n Kelsey shook her head. “You don’t understand. I don’t need the money. I don’t need to be incredibly wealthy. I like working. I will have a nest egg to fall back on, certainly, even if I send everything that Cutter wanted in specific places exactly where he wanted it all to go. He didn’t collect for the wealth of it—he collected because he loved history and the objects that taught history. He was like one of the last great adventurers.” \\n\\n","sourceLink":"https://allnovel.net/ghost-moon-bone-island-trilogy-3/page-23.html","bookId":2288,"book":{"id":2288,"title":"Ghost Moon (Bone Island Trilogy #3)","description":"Storyline: Ghost Moon (Bone Island #3) \\n Reclusive collector Cutter Merlin is seldom seen in Key West — lately, not at all. Officer Liam Beckett visits Merlin\u0027s curious house and discovers the gentleman in his study. In his death grip: a volume of occult lore and a reliquary. His eyes are wide with fright, his mouth a horrified rictus where spiders now dwell. \\n Kelsey Donovan returns to the old house to catalog her estranged grandfather\u0027s collection of artifacts and antiquities, vowing to see his treasures divested properly. But she cannot ignore the sense that she\u0027s being watched, the reports of malevolent black figures, the pervasive smell of death. \\n Is the Merlin house haunted, even cursed? Liam knows well that some ghost stories are true and he swears to protect Kelsey. But there are forces at work for whom one more life is a pittance to pay for their deepest desire...\\n","cover":"https://allnovel.net/images/ghost-moon-bone-island-trilogy-3.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/ghost-moon-bone-island-trilogy-3.html","creation":"Oct 5, 2019 8:58:33 AM","modification":"Oct 5, 2019 5:52:43 PM"}}
