{"id":91808,"no":37,"title":"Page 37","content":"\n “Have you been visiting the library?” Liam asked him.\n Vargas’s face twisted in a frown. “The library? No. I’m not much of a reader. Neither was Gary. I don’t know what you’re getting at.”\n “There’s a book missing from the rare-book room.”\n “I didn’t steal any book,” Vargas said. “Look, I’ve been telling you the truth. I knew about the kids breaking into the house. I thought we could slip in, find some little thing and slip back out. I admitted it that night. I did not steal a book. I’m not a library kind of guy.”\n “Who else was Gary hanging around with?” Liam asked.\n Vargas shrugged. “I don’t know. Gary just hangs around. Look, can I go back to work now?”\n “It didn’t really look like you were working,” Liam commented.\n “I was trying to work. And a cop hanging around me doesn’t help bring in the inebriated tourist who may need a little help getting back to his hotel room.”\n “Yeah, yeah, go ahead,” Liam said, frustrated.\n Vargas stared at him.\n “Go on.”\n “I need you to leave. This is my corner,” Vargas told him.\n One of Key West’s innumerable roosters crowed off-hour and went walking by them. “Watch yourself, Vargas,” he warned.\n “I will. Swear it,” Vargas said.\n Liam returned to his car. He sat there a minute, wishing that he wasn’t grasping at straws.\n “You see me,” the apparition said quietly.\n It was the pirate. The outline she had seen walking behind Liam. She was either falling under too much pressure, or she was staring at the ghost of a long-gone swain, a handsome man, perhaps thirty, decked out in the fashion of his day.\n He might have been flesh and blood as he stood there. He had been staring broodingly out the study window, until she had opened the door.\n And seen him.\n “I see…” she whispered, “something.”\n She blinked. He didn’t disappear.\n It was still broad daylight. She was wide awake, not dreaming.\n “Well, you’re not screaming or running,” he said, moving away from the window to come to the center of the room.\n He still looked real. So damned real. And his voice. She could see him speaking just as if he were Liam or Avery or any other living man.\n “May I introduce myself?” he asked, sweeping off his hat in a broad and elegant gesture, bending low in a bow. “Captain Bartholomew, privateer, unjustly led to the gallows, though that travesty has since been righted. And still I remain. The Becketts and I are connected, you see.”\n She was silent, staring at him, trying to determine if she could possibly be seeing—and hearing—a ghost.\n Ghosts. Apparitions. Spirits. They were supposed to be nothing but mist. They roamed the fields of Gettysburg and such places as the Vatican or Westminster Abbey, Notre Dame, the Lizzie Borden house. They went about their spectral existences without stopping to talk to people, for God’s sake, and a man such as Liam, a cop, for God’s sake, did not walk around with a ghost for a friend.\n Definitely, it had to be the pressure.\n “I am having some kind of a mental breakdown, brought on by the events surrounding my grandfather’s death, and the fact that a man was murdered on my property,” Kelsey said.\n He smiled. It was a charming, handsome smile.\n “I knew you sensed me before,” he said. “Many people do. Well, they sense me, and others, of course.”\n Kelsey made her way to the desk, skirting around the ghost, keeping her eyes on him all the time. She tried to sit calmly and rationally in Cutter’s desk chair.\n “If ghosts haunt this house, they should be the ghosts of my mother or grandfather,” she said. “Ghosts are supposed to haunt the places where traumatic things happened.”\n He reflected on that. “I’m ever so sorry,” he said.\n She swallowed. “Liam—sees you?”\n “Yes.”\n “We’re sharing a mental breakdown?” she asked.\n He walked around and sat at the chair in front of the desk, crossing one stockinged leg over the other. She noted the heels on his shoes and the buckles, the brocade of his coat and the elegance of his waistcoat.\n They were so real.\n He sighed. “No, I’m quite real. Or surreal, I suppose. For quite a while, I couldn’t begin to imagine why I was still here, but first there was the issue with David Beckett, although I had been attached to Katie O’Hara. She’s quite amazing, with a sight that rivals any I’ve come across. Oh, there are others out there, of course. Liam? He doesn’t have great sight. But he is a Beckett, and he’s been forced to see me, poor boy. It’s just been the way that things have come about.”\n “Just how many people are sharing this breakdown?” she asked.\n He smiled again, setting his hat on his lap. “Now? Hmm. Well, Katie and Sean and Vanessa and David, Liam—and now you.”\n “Are we crazy?”\n “Aren’t we all, just a bit?”\n Kelsey closed her eyes, keeping them closed. She opened them. He was still there.\n She hadn’t even been drinking.\n “I’m glad that you see me,” he said. “It does make trying to protect you so much easier.”\n “You’re trying to protect me?” she asked.\n “Of course. Ghosts aren’t evil. Well, wait, I retract that statement. Most ghosts aren’t evil. But people are in death as they were in life, and sometimes…well, I don’t know what hell is, myself, and I’m hoping I never do. I don’t believe I’m headed in that direction, wherever it may actually be. I have seen the darkness of evil come up to claim its own, but never mind, that’s neither here nor there. As it stands, I believe that I’ve remained though the remnants of the past that directly involved me have been solved in order to see that justice befalls all Becketts.”\n “I’m not a Beckett,” Kelsey said.\n “No matter. A Beckett has involved himself with you. Oh, please, don’t take that wrong! You’re a lovely young woman. I’m delighted to help in any way that I can.”\n “You’re a ghost.”\n “Yes, I believe we’ve established that fact.”\n Was there such thing as dreaming while one was wide awake? Had she blacked out, blanked out—without knowing it? Maybe she would wake up on the floor, having been hit on the head with a candlestick or a gargoyle or Chinese good luck cat.\n “My dear young woman, you’re gaping. Not that you’re unattractive even while staring at me openmouthed, but you are lovelier still with a more customary and benign expression,” he said.\n “I still don’t understand.” She suddenly felt tears pricking her eyes. Figment of her imagination, creation of stress or real remnant of the past, she couldn’t understand why she would see an unknown privateer and not her mother or her grandfather.\n “I don’t think any of us actually understands,” he said.\n “Can you talk to my mother or my grandfather?” she asked.\n “I’m sorry. Truly sorry. If they’ve remained behind, I’ve yet to come across them,” he told her. “And I’ve been in this house quite frequently lately. Nor have I met either in the cemetery.”\n This was crazy.\n A crazy that she wanted.\n “But if you’re here, isn’t it possible that they are here, too? Somewhere?” she asked.\n “Yes, it’s possible. But I’ve told you—I have not had the pleasure of the acquaintance of your mother or grandfather.”\n “They could still be here,” she said stubbornly.\n He appeared to inhale and exhale, sighing, but, of course, he was a ghost.\n He wasn’t breathing.\n “I’m sorry, Kelsey. Key West sometimes seems to crawl with spirits, and yet they are but two or three percent of those from this area who have passed on to whatever it is the next life brings to us,” he said. “Some walk down Duval, seeking what they lost or never had, lovers come and gone, wives, husbands, children. And there are those who see one, and those who see many, like Katie O’Hara. Still, I don’t suggest you share your sighting of me with those who don’t already know of my presence. People do tend to think that you’ve lost your mind.”\n “I think that I’ve lost my mind,” Kelsey said.\n “I rest my case.”\n She frowned suddenly and gasped. “It was you—you staring down at me in my sleep. Or, you are what I fear, what I feel.”\n He sat very straight, staring at her indignantly. “Never!” he said.\n “Was that fear, my imagination, then? My paranoia? Or was it as real as seeing a ghost?” she asked.\n Once again, he seemed to sigh. “My dear, dear Miss Donovan. I don’t have all the answers. I don’t even have all the questions. This lack of life is much like life itself in several ways. I can only be one place at one time. I can only travel with the speed of my legs or that of any conveyance in which I might be seated. One day, before I pass over, I’d like to take an airplane ride. How wonderful! Soaring above the earth. Ah, but that is not for now. Now I am trying to discover what I can that will help you. I don’t have the power to push large pieces of furniture, but I am quite proud of my prowess with a modern coffee brewer. I can push buttons. I can think. I can see. And what I see, I can tell those who see me. Am I making sense?”\n Kelsey smiled. She was seated at her grandfather’s desk. A ghost was sitting across the desk from her, speaking as if they were at a casual meeting.\n Did the ghost make sense?\n “You see me,” he said quietly. “I’m trying to tell you in what ways I can help—and in what ways I cannot.”\n “Did you know my grandfather when he was alive?” she asked.\n “I’m afraid I did not. I saw him a few times about town. But I did not know him. I spent years being nothing more than a shiver or, perhaps, upon occasion, a source of comfort, before Katie O’Hara finally spoke to me.” \n","sourceLink":"https://allnovel.net/ghost-moon-bone-island-trilogy-3/page-37.html","bookId":2288,"book":{"id":2288,"title":"Ghost Moon (Bone Island Trilogy #3)","description":"Storyline: \n Ghost Moon (Bone Island #3) \n Reclusive collector Cutter Merlin is seldom seen in Key West — lately, not at all. Officer Liam Beckett visits Merlin\u0027s curious house and discovers the gentleman in his study. In his death grip: a volume of occult lore and a reliquary. His eyes are wide with fright, his mouth a horrified rictus where spiders now dwell. \n Kelsey Donovan returns to the old house to catalog her estranged grandfather\u0027s collection of artifacts and antiquities, vowing to see his treasures divested properly. But she cannot ignore the sense that she\u0027s being watched, the reports of malevolent black figures, the pervasive smell of death. \n Is the Merlin house haunted, even cursed? Liam knows well that some ghost stories are true and he swears to protect Kelsey. But there are forces at work for whom one more life is a pittance to pay for their deepest desire...\n \n","cover":"https://allnovel.net/images/ghost-moon-bone-island-trilogy-3.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/ghost-moon-bone-island-trilogy-3.html","creation":"Oct 5, 2019 8:58:33 AM","modification":"Oct 5, 2019 5:52:43 PM"}}
