{"id":40009,"no":1,"title":"A STORY OF THE RUSSIAN FAMINE. BY OCTAVE THANET.","content":"The Editor of the Round Table has asked me to relate some incident of my life which may be of interest to its readers. Will they permit me to tell them that episode in my life which gives me, when I recall it, the greatest pleasure? It is the old story of the pebble and the ever-widening circle in the water. Do you remember how all through the autumn of 1893 there appeared in corners of newspapers, in telegraphic columns, then in editorial \"briefs,\" sinister allusions to the total failure of the Russian crops and the menace of a famine? Do you remember how the dreary paragraphs expanded; how the menace became ghastly reality; how we grew to find, every morning, as we sat down to our bountiful American breakfasts, woful tales how men and women were dying of starvation fever, and little children turned wailing away from the horrible bread of weeds and refuse? I read as others read. And I read also of the titanic efforts of the Russian government and the wonderful generosity of the Russian people in that year of disaster. I experienced the momentary shudder of pity and horror that such tales excite, and, like other people, I thought \"Somebody ought to do something\"; and then pushed the hideous picture into the background of my mind. One night Mr. Arthur M. Judy, the pastor of the Unitarian Church in Davenport, dined with us. The talk drifted to the famine in Russia. I told how a friend who had[Pg 74] passed through Russia in August described the look of the ruined wheat-fields and the sadness already settling over the villages. \"We ought to do something for those people,\" said he. \"They came to our rescue during the civil war; they have always been friendly with us; we ought not to stand by idle now. We ought to do something, right here in Iowa.\" We all agreed that it would be a good thing, but there was no definite plan proposed. Only later in the evening, as my mother, my sister, and I sat together before the fire, we talked of those starving people until it was uncomfortable. I found it hard to push the pictures of agony and death and piteous self-sacrifice into the background of my mind. You perceive that the pebble had been thrown into the water. Sunday, not long afterwards, we were having a little family dinner party, our own and my two brothers\u0027 families, and my elder brother\u0027s wife spoke of the famine. She is of English-Irish descent, and much of her life has been spent across the water. She has met many Russians, and she surprised us all by the intensity of her realization of the horrors of famine. Yet possibly it is not so strange. Early in the century her ancestors mortgaged their estates to fight the great Irish famine. \"It is horrible!\" cried she; \"and we sit here, while they are dying, eating and drinking. We talk of somebody doing something! Why don\u0027t we do something?\" \"That\u0027s right,\" said my younger brother, cheerfully turning on me. \"Sissy, why don\u0027t you do something?\" \"I will,\" I answered, meekly; \"I will go down to the Democrat office and ask Mr. Tillinghast to do something!\" Then we all laughed; but presently we were discussing the best manner in which to effect our purpose. The Democrat is the leading journal of our town, owned by Mr. D. N. Richardson, author of a delightful book of travels which ought to be on every round table, and his brother, J. J. Richardson, for many years the Iowa National Committeeman. Mr. Richardson and Mr. Tillinghast were the editors, Mr. Richardson being what one may call the consulting editor, and Mr. Tillinghast the active editor. Mr. Calkins, the new city editor, I had occasion to know later. I went to the Democrat. I stated our case. I can see the editor now, his slender figure turning quickly in his chair as he threw his arm over the back of it, his dark eyes kindling, and his black brows meeting in a little frown of concentrated thought; and I can hear his leisurely, distinct tones as he spoke: \"I like the idea. I like it very much. But—you know there are difficulties. In the first place, we must discover whether the Russian government will accept our offering. We don\u0027t want to be lacking in courtesy any more than in generosity. In the second place, there are so many prejudices and so many falsehoods circulating about Russia that we want to select some channel of distribution which will be above suspicion.\" \"George thinks that the Red Cross and Clara Barton would satisfy every one.\" \"They would; and she is in Washington, where she can consult the Russian legation.\" \"And George says he will go with you any day this week to stir up Governor Boies to issue a proclamation and name a committee.\" Thus lightly we entered on a work that was to absorb most of our time, our energies, and our hearts for the next three months. The Governor was found already interested. His proclamation was issued immediately. Like all the Governor\u0027s state papers, it was dignified and to the point, but it contained in its brief lines a touch of pathos which is not often seen in state documents. Eleven of the most prominent citizens of the State were named as the Russian Famine Committee, the chairman being the Hon. Hiram Wheeler, Republican candidate for Governor in the campaign which had elected Mr. Boies. Mr. B. F. Tillinghast was named as secretary, and the Auditor of the State as treasurer. And it may be said here that upon the secretary and the treasurer fell the burden and the heat of the work of organizing an immense undertaking. Mr. Tillinghast, in especial, gave up almost his entire time, night and day, the owners of the Democrat loyally backing him up, and contributing not only the columns of the paper, but generous gifts of money and their own time. The first work was to organize enthusiasm—to spread the circle wider and wider. \"First we must get the committee red hot, then they must get their committees red hot, and the press must keep up the fire,\" said Mr. Tillinghast. The press all over the State nobly responded, publishing anything bearing on the famine which the Famine Committee would furnish. Mr. Tillinghast every day culled from exchanges, American and foreign, from private letters and public letters, what seemed best calculated to rouse the public feeling. It was in itself an immense work. He, with his staff, was an entire literary bureau; but this was only a fraction of his work. He and a few others of us who were interested corresponded with hundreds of people, with the officers of the Red Cross, with Colonel Murphy and Buchanan and other corn experts (we had decided that our gift should be corn, and events proved the wisdom of our decision), with people in our own country, with the workers in Russia. Thousands of copies of the proclamation of the Famine Committee were printed, and thousands more slips of extracts from testimony from authentic sources regarding the sufferings of the peasants and the heroic relief-work of their country-men were also made ready. Almost the entire work of their selection and preparation was done by Mr. Tillinghast. At the same time he was holding in his hand all the reins of the different forces. I remember that, accidentally, the \"Horrors,\" as we used to call them, were printed on colored paper—red, orange, and blue. To our surprise, we found that the colors attracted so much attention that what began by accident continued by design. One of our best sources of information was the Northwestern Miller, which was advocating the sending of a cargo of wheat flour by the millers of the country. The generous millers raised the ship load, and Mr. Edgar, of the Northwestern Miller, accompanied it to Europe. He was thanked in person, for the evidence of friendship, by the Czarowitz, the present Czar. Every Sunday night Mr. Tillinghast would come to my mother\u0027s house, the telephone would summon my two brothers and their wives, and a council of war would be held on the week\u0027s progress and the plans for the next week. It was immediately after the meeting of the Famine Committee that my own mere active part in the work began. Mr. Tillinghast had reported the plan of campaign. He added: \"Yes, the prospect is good. I think we can easily raise a train of corn. But I am more ambitious; I want to send a ship-load; and I think to do it we need to—interest the women.\" The women present said very little; but after he was gone, in the fashion of women, we \"talked it over.\" And that was the pebble that is responsible for the Iowa Women\u0027s Auxiliary to the Red Cross. First, I wrote to prominent women in society and in philanthropy all over the State, proposing the plan of an organization of women who should sign a pledge. The pledge is before me; it binds the subscriber to Obey her superior officers. Inform herself so far as in her power regarding the famine. Influence her friends in favor of the objects of the Auxiliary, so far as in her lies. Aid in any effort made by the Auxiliary to raise money for the Russian Famine Committee, by public entertainments. The badge was a red cross on black satin ribbon, with the letters I.W.A. in gold above the cross. The officers generally decked the satin with gold fringe, and pinned a knot of ribbon in the Russian colors above. The admission fee was ten cents, which included the badge. Yet this sum more than paid all our expenses, principally because every member among the officers paid her own expenses. Never, perhaps, was a large charitable undertaking run more cheaply. All the committees worked for nothing, at their own charges; the railways donated passes, the telegraph companies donated their wires for the work, the newspapers[Pg 75] opened their columns, several owners of theatres and public halls offered them free for our entertainments in aid of the fund, the underwriters made a present of their charges, the very laborers who packed the cargo gave their labor. Two weeks sufficed to organize, to have lists signed all over the State petitioning the Governor to name a committee; and before three weeks had passed, the committee had met in Des Moines. The chairman was Mrs. William Larrabee, wife of ex-Governor Larrabee; and I took the position of secretary. The members of the Central Committee were chosen as representing Congressional districts, that being the basis of representation in the Russian Famine Committee. They were Mrs. Francis Ketcham, Mrs. Charles Ashmead Schaeffer, Mrs. Matthew Parrott, Mrs. John F. Duncombe, Mrs. Ella Hamilton Durley, Mrs. Albert Swalm, Mrs. J. B. Harsh, Mrs. George West, Mrs. J. T. Stoneman, Mrs. Julian Phelps. We considered the officers of the Russian Famine Committee as our superior officers, and all moneys were turned in to them. Miss Barton advised with us, and it was through her personal efforts that the ship that carried our corn was secured. The weeks that followed I have not the space to describe. The president and secretary travelled among the districts; each district chairman travelled in her own district, organizing subcommittees and reporting to the secretary, who reported to the chairman. We held meetings in libraries and club-rooms and hotel parlors. There was always the same result; the simple recital of the misery, which we grew daily to feel more acutely the harder we worked to help it, was enough to stir the generous Western heart. Workers rose up all about us. They, in turn, inspired others. One old lady, enfeebled by rheumatism, a farmer\u0027s widow, wrote me for information, and carried the red and yellow slips which I sent her around among her neighbors, reading them, and collecting money. She raised $17. Sometimes, she said, it was hard for her to climb in and out of the wagon; but she thought of the poor starving creatures, and that gave her strength. Two Swedish servant-girls added almost a hundred members to the Auxiliary by their own efforts. One of our most effective appeals was to tell (quoting our Russian informants) that a man or woman could be fed from then to the next harvest for the sum of $2.80. It seemed incredible, but Tolstoi and several others were our informants, and our Red Cross men later verified the statement. We used to say, \"Will you not ask your friends to join with you and save one Russian life?\" A poor seamstress came to one district chairman and offered her some money ($1.75), saying, \"I can\u0027t save a grown-up Russian, but maybe this will save some child.\" We raised money by different devices. Charity balls were given, and Russian receptions, and kind-hearted musicians sang. The opera of the Mikado, given in Davenport, helped our fund by over $800. There were other unions of the appeal to the sense of humanity and the appetite for amusement, but in general we simply asked for money in an honest, direct way, and it was given to us. In the cities and towns we asked for money with which to buy corn; in the country we asked for corn itself. Mrs. Duncombe and Mrs. Ketcham sent out wagon solicitors, who drove from farm to farm. The Iowa farmers are very generous, and the wagons were heaped long before the circuit could be completed. The result of the united efforts of men and women was the largest ship-load of corn that ever sailed from our shores. It is not only the result of our labors which makes the memory of that hard-working, anxious time precious; it is, most of all, the revelation that came to me, day after day, of the noble qualities of mine own people. I remember how, in one of the counties, a hail-storm had pelted the corn-fields and laid waste the harvest. We were questioning whether, at the same time that we were asking aid for others, we should ask for our own sufferers, when one of the chairmen received a letter from Adair, saying: \"We\u0027re all right; we don\u0027t want anything. What are you thinking about? We\u0027ve collected a car-load of corn for the Russians. Where shall we send it?\" And I remember very tenderly how the committees of women worked. Their tact, their enthusiasm, their unselfish loyalty, will always rise before me as I think of that time. And their virtues of omission were as shining as those of commission. We had our difficulties, our disappointments; we were harassed and discouraged, and a few times despairing; but in all that time, during which I had hundreds of letters and scores of meetings and innumerable private consultations with my comrades, I am not haunted by the humiliating spectre of even a single squabble. Nor did any of the chairmen report such a thing out of her own experience. Yet, for the credit of the sex, I would not wish to think that one of the husbands was right when he said: \"You\u0027ve broken the world\u0027s record. You haven\u0027t had a racket!\" But now is it not easy to understand why, of the experiences of my life, this is the one that is the jewel of my memory? And it is the old story of the pebble and the circle in the water. A BAD PLACE TO BE BORN IN. There are a great many advantages in being born an American citizen. One can hope to become President of the United States and various other high and mighty things; but, after all, the greatest privilege is in being born among a people who are free from foolish superstitions. Suppose you had been born on the Congo River, for instance. How would you like that when you consider some of their beliefs? It is told by persons supposed to be well informed that the people inhabiting the district round the Congo River share with the Ashantees, of whom we have recently heard such a lot, the belief that if their high priest, the Chitome, were to die a natural death the whole world would follow suit at once, and would dissolve into air, for it is, according to them, only held together by his personal will. Accordingly, when the pontiff falls ill, and the illness is serious enough to make a fatal termination probable, a successor is nominated, and he, so soon as he is consecrated, enters the high priest\u0027s hut and clubs him or strangles him to death. A somewhat similar custom obtains in Unyore when the King falls seriously ill, and seems likely to die, for his wives to kill him. The same rule is followed if he gets beyond a certain age, for an old Unyore prophecy states that the throne will pass away from the family in the event of the King dying a natural death. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3322/90991.html","bookId":393,"book":{"id":393,"title":"Harper\u0027s Round Table, November 24, 1896","description":"简介： The Editor of the Round Table has asked me to relate some incident of my life which may be of interest to its readers. Will they permit me to tell them that episode in my life which gives me, when I recall it, the greatest pleasure?It is the old stor...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3322","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
