{"id":40011,"no":3,"title":"A THANKSGIVING GAME. BY S. SCOVILLE, JUN.","content":"\"It\u0027s outrageous!\" said the pater, banging his fist down on the breakfast table in a way that made the mater, accustomed as she was to his ways, jump in spite of herself. \"So that\u0027s the reason the young rascal\u0027s not going to be with us to-morrow until late in the evening. Listen to this;\" and the pater began indignantly to read an extract from the morning paper: \"\u0027An important change has been effected in the makeup of the Yale eleven. Teddie Larned, \u002799, has recently made such a fine showing at full-back that he will fill that position in the championship game against Princeton on Thanksgiving day. His punting and line-breaking are phenomenally good.\u0027 \"That\u0027s what I was afraid of when I sent him to college,\" continued the pater, solemnly, as he folded up the paper. \"Football\u0027s a rough, brutal game, and those that play it become rough and brutal, when they don\u0027t injure themselves for life, as most of \u0027em do. I wouldn\u0027t have one of those young savages in my house. I\u0027ll just go up to that game early to-morrow afternoon,\" he went on, \"and bring Teddie home with me. They\u0027ll have to get somebody else to fill his place in spite of his being such a phenomenal—er—line-smasher—whatever that is.\" \"Don\u0027t be too hasty,\" advised the mater, in whom Teddie, knowing his father\u0027s violent aversion to athletics, had confided. \"This game means a great deal to our boy.\" \"Nonsense!\" snorted Mr. Larned, indignantly; \"it\u0027s nothing but a silly school-boy affair anyway. I\u0027m astonished that grown men waste their time encouraging such things by going.\" Long before the elevated train had reached Harlem it was packed and jammed to the doors with lusty college boys, pretty girls, and sedate heads of families, among whom Mr. Larned saw with astonishment many men of note. All were wearing college colors, all were filled with a delightful, suppressed excitement. Involuntarily the pater began to feel the contagion. But everybody was talking football, and their language sounded strangely to his ears. \"They say that Larned\u0027s a regular find for Yale,\" remarked a chrysanthemum-headed youth to his friend hanging to a strap beside him. \"He kicked a goal from the field last week, when he was playing on the scrub, from the forty-five-yard line. You ought to see him buck a line!\" Teddie\u0027s name was on every one\u0027s lips, and the pater began, in spite of himself, to feel proud of his son, and to have a sneaking desire to see some of those accomplishments of his that other people seemed to know so much about. Fighting his way through the crush at the gate, Mr. Larned finally found himself inside, albeit in a decidedly dishevelled condition. An official with a long flowing badge directed him to the training-quarters where the Yale team was reposing during the last hour before the game. At the door the pater was confronted by Mike, the grizzled old trainer. \"Of course Mr. Larned\u0027s here,\" he responded, surprisedly, to the former\u0027s inquiry, \"but he can\u0027t see anybody just now.\" \"Tell him that his father wishes to speak with him at once,\" said the pater, authoritatively. The trainer\u0027s manner became more respectful. \"I\u0027m very sorry, Mr. Larned,\" he said, firmly, \"but the team can see no one before the game. The coachers are giving them a last talk now.\" \"Do you mean to tell me,\" the pater demanded, hotly, \"that I can\u0027t see my own son?\" \"Exactly, sir,\" replied the trainer, inexorably. \"Just at present he\u0027s the full-back on the Yale eleven, and nothing else goes. And now, Mr. Larned, I\u0027ll write you out a pass to the grand stand, and then I must run back to the boys. After the game you can see your son aplenty—if there\u0027s anything left of him.\" And with this cheering suggestion, Mike scribbled a few words on a card, which he handed to Mr. Larned, and retired. The latter stood speechless for a moment. That a power on the Street, a man whose name was among the great ones of Manhattan, should be treated thus cavalierly, and that by a hired trainer— \"Why, it\u0027s preposterous!\" exclaimed the pater to himself; nor was his ruffled self-esteem soothed when he read the scrawl on the card: \"This is Teddie Larned\u0027s father. He wants to see the game. Mike.\" But then it proved an \"open sesame,\" and the ushers, after reading the magic words, received him with the most marked attention, passed him along through the crowds of ordinary people who were not fathers to famous full-backs, and finally seated him in a front box which was specially reserved for the parents of the players—though Mr. Larned did not know this. Next to him was seated a tall, ruddy-faced man, wearing the slouch hat which the old generation of Westerners still cling to. He was beaming with jollity, and joined a deep bass to some of the college songs that Yale voices were chanting all around him. \"Well, to-day\u0027s the day we watch the youngsters distinguish themselves,\" he remarked, cheerily, to Mr. Larned, during a lull in the cheering that was surging up and down the grand stand. But before the pater could rebuff this friendly overture, as in his present state of mind he felt inclined to, a roar of cheers swept up and down the field, and the speaker sprang to his feet, waving his slouch hat frantically. Out on the brownish-green field trotted eleven shock-headed youths clad in dirty, heavily padded mole-skins, cleated shoes, and canvas jackets, frayed and torn, but each with the great varsity \"Y\" on its breast. An oval brown ball was hurled and caught with, what seemed to the pater\u0027s inexperienced eye, wonderful swiftness, and then as the ball rolled along the ground each man took his turn, as it came near, in sprawling down on it in a most comical manner. Suddenly it was passed nearly thirty yards, straight as an arrow into the arms of a short, chunky youngster, with an extremely dirty face, who seemed carved out of a solid block. With almost a single movement—so deftly was it done—the ball was caught and poised in both hands for the tiniest fraction of a second. Then came a hollow thump as the dropped oval was punted. Up, and up, and out in a tremendous parabola, almost the length of the field it soared. \"AA! AA!\" howled the Yale tiers. \"Get on to that punt! What\u0027s the matter with Teddie Larned?\" The pater stared, at first incredulously, but sure enough that marvellous kicker was his own son Teddie, though disguised by the grime, the pads, and the tangled hair. It must have been the excitement around him which made the pater stand up and watch with all his eyes every sky-scraping punt that the dirty-faced boy continued to make, and by a mere accident all at once he found himself saying \"AA!\" as loudly as any one before he had been on his feet a minute. His companion was wild with excitement. \"See that big chap?\" he exclaimed, pointing out a young giant whose face looked like some monstrous mask, with its huge rubber nose-guard. \"That\u0027s Bright, the centre rush. Ain\u0027t he a corker?\" \"Looks too fat,\" said the pater, critically. \"Too fat, eh?\" replied the other, excitedly. \"Well, you just watch him play, and see if he\u0027s too fat. That little Larned\u0027s the one that\u0027s too fat. He punts all right, but a full-back ought not to be so round.\" \"Not at all! Not at all!\" hotly responded the pater, who, though he did not know a full-back from a goal-post, was not going to sit by and hear his only son maligned. \"A pull-back should always be thickset! They—er—pull better when they\u0027re like that. And—that\u0027s my son sir!\" The Westerner choked until he was nearly black in the face. \"Well, shake, old man, and we\u0027ll call it square,\" he said, finally, when he had recovered breath enough to speak. \"Bright happens to be my son, and in spite of their fat I think our two boys won\u0027t disgrace us this day—eh?\" And again it must have been the excitement of the game, for the dignified and somewhat exclusive Mr. Larned found himself shaking hands with a total stranger as if he had[Pg 79] been a life-long friend. All his bad temper had disappeared. He was aglow with excitement; the most delightful little thrills ran up and down his back, while an irresistible impulse to shout had taken possession of him. \"This is your first game, isn\u0027t it?\" Mr. Bright questioned. But just then came another punt, and the pater found it much easier to stand up and yell \"AA!\" than to answer any such searching questions. Then all further conversation was made impossible by a torrent of cheers from the Princeton tiers, and eleven other men, with the same grimy, weather-beaten costumes, and the same businesslike air of deadly earnestness, spread across the field and went through similar preliminaries. Only their stockings were of a barber-pole pattern, with alternate rings of orange and black instead of a uniform blue, while a large orange \"P\" blazed on every breast in place of the Y. And now there was no controlling the audience. Orange and black banners were confronted by yards of Yale blue. Yellow chrysanthemums glared at bunches of violets and bachelor\u0027s-buttons, while the wearers—men, women, and children—sent out volleys of cheers that made the grand stand shake. The pater and his newly found friend were on their feet with the rest. Near by was a crowd of Yale \"rooters,\" as Mr. Bright graphically termed them, shouting a rhythmic cheer containing too many x\u0027s and other bewildering Greek consonants for the pater, while he invariably added an extra \"Rah!\" to the regulation cheer. But to his satisfaction he found that not even the deep-voiced Bright could shout \"AA!\" with more earnest emphasis and volume, and he fell back on that as his strong point. Suddenly there is silence, a warning whistle blows. Yale has the ball, and the forwards group themselves in a curious zigzag formation, awaiting the kick off. The short and chunky Teddie takes a run, his foot swings and strikes the ball with what seems hardly more than a gentle touch, but the oval is spinning clear down to the other end of the field, followed by the terrible rush of the whole Yale team. It is caught by a running Princeton man, who, with a swerve of his body, avoids the spring of one runner, hurls another aside with the \"straight-arm,\" and comes tearing down the field like a deer. A tremendous shout from the wearers of the orange and black masses is bitten off with surprising abruptness. For Teddie smashes straight through the interference, and with a lightning-like dive, which there is no evading, tackles the runner just about the knees and hurls him headlong. In a flash the lined-up elevens are facing each other, and the fight is on. \"Too fat, eh? Just look at that!\" chuckles Mr. Bright, slapping the erstwhile dignified Mr. Larned ecstatically on the back, as Yale\u0027s centre catches his opponent napping, hurls him aside, and downs a runner in his tracks. Back and forth surges the tide of battle. The elevens are almost evenly matched, and though the ball has been dangerously close to either goal, it has always been kicked or rushed back in time. The pater marvels at Teddie. Where had his boy learned the daring, the coolness, and the self-reliance that characterize him that day? Time after time the Yale backs smash at the Princeton line and fail to make the necessary ground, and the ball is close to the goal, with only the swing of Teddie\u0027s right leg to ward off a touch-down. But the boy never falters. Unerringly he catches the ball, and just at the right moment when the rush of the opposing backs is almost upon him, the ball spins far out of danger, and a long-drawn breath of relief comes from the Yale seats. And once when Teddie dives into the line with the ball, and the great seething mass of arms and legs untangles itself, there is one that fails to rise with the rest. The little full-back lies very limp and still, and there is a cry for water, while old Mike rushes from the side-lines with a great blanket flapping in the breeze. The pater\u0027s face becomes all of a sudden drawn and white, and he trembles so that the great Westerner drops his arm across his shoulders. \"Steady, old man,\" he says, soothingly; \"the boy\u0027s only had the wind pounded out of him. He\u0027ll be up and playing in a second.\" And maybe the two fathers don\u0027t join in the tremendous cheer that arises when Teddie trots back to his place—a little unsteadily, to be sure—and the game goes on. \"They\u0027re saving him,\" says Mr. Bright, after watching the play carefully for some time. \"He\u0027s only been sent against the line three times this half, and now the other backs are doing most of the punting. They\u0027ll send him in to save the game in the last ten minutes.\" The ball is back almost in the middle of the field again, when suddenly the warning whistle sounds shrilly, and the first half is over. A great buzz goes up from thousands of seats as the spectators discuss the details of the game, and, long before one expects them, the players are trooping back. Hair all adrip from the hurried sponging that the rubbers have given their grimy faces, bodies still atingle from the stinging alcohol rub-downs, with the hoarse, earnest, words of the graduate coachers still ringing in their ears, they line up for the bitter second half. From the start the advantage lies with the orange and black. The weight of their tremendous rush-line begins to make itself felt. Back and forth goes the ball, but—significant fact to the knowing ones—it stays constantly in Yale\u0027s territory. For the first time during the afternoon there is a dead silence, and the thud of the players\u0027 bodies as a back strikes the rush-line or tries to smash through the interference can be heard, and their sobbing breathing as again and again the confused heap untangles itself. The shrill voices of the quarter-backs as they call out the signal for the next play punctuates every struggle, and now and then one or the other of the Captains claps his muddy hands sharply together with a \"Play hard, boys! Hit it up! Now show your sand!\" Above the struggling, changing mass hangs a thin white steam—truly a battle-mist. Finally, towards the end of the half, by a series of short, hard rushes, Princeton is on Yale\u0027s 20-yard line. But here the wearers of the blue stand like a stone wall, and, after three vain attempts, the ball goes to Yale on downs. Instantly it is passed back for a punt, and then—no one knows how it happened, perhaps the Yale guard was napping, perhaps the tackle was to blame—straight through the line, between tackle and guard, smashes the great right guard of Princeton and blocks the kick. The ball bounds from his broad chest clear across the line. In a flash one of the Princeton ends has followed, fallen on it, and the score is 4-0 in favor of Princeton. A crumb of comfort is it, but only a crumb to the Yale adherents, who sit gloomy and despondent amid a roaring storm of Princeton cheers, that no goal is kicked. \"Only seven minutes left,\" exclaims Mr. Bright, despairingly, \"and that\u0027s not time to do anything against a rush-line like that. But the boys\u0027ll die a-trying, anyhow!\" Grim and unyielding the Yale men line up for these last stern minutes. They have failed. No matter the reason, the audience may call it a fluke, a piece of hard luck; but up on the Yale campus it is results that count—not excuses. In their hands is the honor of the college, and but seven minutes remain to wipe off the stain of defeat before thrice ten thousand people. Like a flash the eleven lines up. The battle opens with a last-resort flying-wedge play, too risky to try except at such a desperate time when every chance must be taken. When it is over the blue line is twelve yards nearer the Princeton goal; but two of the precious minutes are gone. \"Five, seven, twenty-nine!\" shouts the quarter-back, hoarsely, and the ball goes back to Teddie, and smash he goes into the line. Like a flash the tangled mass dissolves, with the ball six yards nearer the goal. Nothing is harder to stand than the dumb furious rush of a despairing eleven, nerved by the sting of defeat, and seeing a chance to retrieve itself. No end plays now, but straight through the centre they go, and even Princeton\u0027s mighty rush-line wavers. Mr. Bright\u0027s prediction as to Teddie\u0027s having been held in reserve proves a true one. Back into his hands goes the ball for nearly every play, and gallantly that day does he sustain his reputation as the best line-breaker that has ever worn a Y. Sometimes it is a \"turtle-back,\" or one of the huge guards makes a hole for him at the centre, or again, in a tandem play, Teddie follows the smashing rush of the heaviest back. But, whatever the play,[Pg 80] crashing through or even leaping over the opposing line, as they crouch for his approach, pushing, boring, squirming, with the weight of half a dozen men crushing the breath out of him, Teddie always gains ground. Sometimes the gains are small, to be sure, but always enough for Yale to keep the ball. Once there is a line-up by the side-line close to where the two fathers sit, and Mr. Larned looks down into Teddie\u0027s face scarce ten yards away. It shows very white now underneath the grime and sweat, while the blood, oozing from a cut in the forehead, clots blackly in little streams down the side of his face. But, strangely enough, the pater forgets to characterize the whole thing as brutal. In fact, his teeth are clinched as grimly as his son\u0027s as he leans far forward to see every move of the game, and his heart goes out to those \"young savages\" who are making such a dogged up-hill fight of it. And now the ball is on the twenty-yard line, diagonally from the goal. \"Thirty seconds to play,\" shouts the umpire, poring over his stop-watch. \"Thirty seconds to make one last attempt for Yale, and every man on the eleven nerves himself to hold against the Princeton rush-line as against death himself. As the quarter-back cries the signal, the right and left half-backs, from mere force of habit, crouch ostentatiously, as if prepared for a run round the end. But the feint is unnecessary. Every man on the Princeton eleven, every coacher on the side-lines, every football-player on the crowded grand stands, knows that a goal from the field is Yale\u0027s only chance, knows that on Teddie\u0027s coolness depends the fate of the day. Back goes the ball on a long, low, accurate pass from the wiry little quarter-back. And before it has reached Teddie\u0027s outstretched hands the crash comes, and against the sternly waiting line comes the full force of the Princeton rushers bent on breaking through and blocking the kick. \"Hold \u0027em, Yale!\" gasps the Captain from his place at tackle, as he braces against the hard-pressed right-guard. And for a second Yale holds. Then the line wavers, and straight for Teddie, from as many different points, spring three men. But that second had been enough. Deftly and slowly, as if in practice, the ball is poised and dropped. Struck on the rebound by Teddie\u0027s foot, it spins up and out just above the outstretched fingers of the Princeton rushers, who leap high in the air to intercept it. The goal is a difficult, diagonal one to make, and every player forgets to breathe as the ball sails slowly on, until it just clears the cross-bar, making the score stand 5-4 in favor of Yale; the game has been won in the last quarter of a minute. THE GAME HAS BEEN WON IN THE LAST QUARTER OF A MINUTE. In such an indescribable turmoil as the one that followed, with every Yale sympathizer swarming out on the field to embrace the eleven which had so gallantly snatched a victory from the jaws of defeat, it was impossible to chronicle events with perfect accuracy; but it has been reported, on reliable authority, that shortly after the goal was kicked, a hatless and much dishevelled individual, bearing some faint resemblance to the dignified Mr. Larned, the well-known financier of New York, was seen enthusiastically hugging a muddy Yale player, supposed to be the full-back, pouring forth divers fragments of cheers the while, and at intervals embracing a tall man in a slouch hat who was performing a vigorous war-dance with variations. Both of these parties mentioned were also said to have been members of the group that carried the aforesaid full-back around the field on their shoulders in triumph. Undoubtedly the facts in the case have been much exaggerated, but it is certainly true that Mrs. Larned, to her unbounded amazement, received the following telegram from her husband late that evening: \"Teddie, my friend Bright, and four of the Yale eleven will eat Thanksgiving dinner with us to-night.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3322/90993.html","bookId":393,"book":{"id":393,"title":"Harper\u0027s Round Table, November 24, 1896","description":"简介： The Editor of the Round Table has asked me to relate some incident of my life which may be of interest to its readers. Will they permit me to tell them that episode in my life which gives me, when I recall it, the greatest pleasure?It is the old stor...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3322","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
