{"id":40012,"no":4,"title":"A LOYAL TRAITOR.","content":"A STORY OF THE WAR OF 1812 BETWEEN AMERICA AND ENGLAND. BY JAMES BARNES. CHAPTER V. THE LION\u0027S GREED. So we ran on with the wind holding fair until late in the evening, steering northeast by east. I had overcome a great deal of my timidity already, and had asked so many questions and paid such close attention to the way the brig was being handled, that by nightfall I thought I knew not a little about the working of a ship. Captain Morrison, seeing my interest was so real, and put in a good-humor, as I have said, by the escape from the 74, explained to me something about steering by compass, and the wherefore of several orders. The planter\u0027s wife had so far recovered from her indisposition as to take a seat at the swinging-table in the cabin, and we made a very jolly party at supper. The skipper, warmed by a bottle of port which Mr. Chaffee had set upon the table, began to tell tales of the sea. I have heard many stories in my life, but I do not think that I have ever been thrilled or excited by any in the way that I was that evening. Mrs. Chaffee must have noticed it, for she closed her hand over mine (that were tightly gripping the edge of the table), and stroked them gently in a motherly way. I resented this (although I am glad I did not show it), for was not I at that very time employed with the Captain in repelling an attack of a Barbary corsair? and Mrs. Chaffee\u0027s kindly touch recalled me to myself, and reminded me that I was but a boy, after all, who a few hours before had been almost in tears for the lack of what she had shown me—a little sympathy and the comfort of a kindly glance and touch. The Captain had not finished his yarn-spinning—in fact, he was but in the middle of it—when the first mate thrust his head down the companionway. \"Will you come on deck, sir, and take a look at the glass on the way up?\" he asked. To my surprise, the Captain cast his tale adrift without an apology and hurried out, pausing for an instant only for a hasty glance at the barometer, which hung against the bulkhead at the foot of the ladder. \"It\u0027s evidently fallen calm,\" said Mr. Chaffee. \"And very glad am I that it has,\" answered his wife. \"I think any more of that pitch and toss and I should have died.\" For the last three-quarters of an hour, indeed, the Minetta had been stationary, heaving a little now and then, but in such a small way and keeping on such an even keel as scarcely to move the coffee in our cups. The Captain had been gone but a few minutes when we all went up on deck. The seas were round and oily, and the brown sails hung in lazy folds against the masts. The man at the wheel now and again gave the spokes a whirl this way and that, and he was forever casting his eye aloft as if by some motion of his he might catch a stray breath of wind. It was past sundown, and there was a strange, suffused glow everywhere, more like dawn than the twilight of evening. But off to the northwest towered a black tumble of clouds that were edged with a fringe of lighter color. They were stretching upwards and peering grandly above the horizon-line like a range of growing mountains. Suddenly a quiver of light flashed all around, and then a streak of forked lightning ripped horizontally, like a tear in a heavy curtain, against the pit of the cloud. The Captain went below at this, to look at the barometer again. [Pg 82] \"It\u0027s falling, Mr. Norcross,\" he said, raising his head. \"Shorten sail, sir, and be lively!\" The men tumbled out from the deck-house. The top-sails which we had carried all the afternoon were taken in, and a reef put in the foresail and mainsail. I watched all this bustling about with much delight, and then my attention was drawn to the sky. The clouds had now spread so that they were almost over us; a few big rain-drops fell and made little splotches on the surface of the water and spattered the deck in spots as big as dollars. They could be heard falling in the stillness against the dry sails overhead. Then, without a warning, there came another flash of lightning and a deafening thunder-roll. A slight puff of wind trailed the heavy blocks on the main boom rattling across the deck. The yards swung about with a complaining, creaking noise. The Captain seized the glass and pointed to the westward; then he jumped to the wheel, jammed it over, and immediately began shouting orders to close the hatches, haul in the main-sheet, and make all snug. Every eye had followed the aiming of the telescope—a line of white below a wall of gray was coming toward us on the rush! A few more drops of rain fell softly, and then the thunder began to crash and roar on every hand. Warned by the Captain, Mr. Chaffee and his wife went down to the cabin, both pale with fright. I, however, kept the deck, and in some way (I cannot account for it) was overlooked. And here nearly comes an ending to my story. So suddenly and so fair abeam did the wind strike us that it was almost a knockdown then and there, and the first thing I knew I slid across the deck over against the lee bulwarks. The scuppers were running so full that I went under from head to foot; I thought surely I was going to be drowned—in fact, I think I took a few strokes and imagined myself overboard. The masts were extending over the water so far that the yard-arms almost dipped, the crew were hanging on by anything they could lay hand to, and the wind raised such a screeching in the rigging that the Captain, who was bawling at the top of his lungs, might as well have held silence; his voice apparently blew down his throat. Nevertheless, some of the crew must have understood him, for they clambered into the shrouds. This I noticed as I tried to crawl up the slope of the deck. Then there came a loud report; the foresail blew out into tatters, and the brig righted. A turn of the wheel, and she was put before it, crashing down into the sea (that came tumbling under her quarters), and now and then lifting her stern as if she would roll over like a ball—any which way. I managed with difficulty to make the head of the after-ladder, and stumbled down it head first, some one slamming the sliding-hatch with a bang almost on my heels as they went over the combing. Looking about me, I found Mr. Chaffee and his wife engaged in prayer. They were much bruised from having been flung about the cabin, and were in great fear that we were about to founder. But the Minetta was going so much steadier now that we all three sought our bunks, and managed to stay in them, and I had so much confidence in the Captain and crew, and was so unfamiliar with terror, that probably I did not recognize the nearness we had come to disaster, so after an hour or so I went to sleep. When I awakened the sunlight was pouring in at the transoms, and we were gently heaving up and down. There was nothing to give me an idea of the time of day, but I could smell the brewing of coffee, and dressed hastily. No one was in the cabin, and the breakfast was untasted on the table; so, hearing the sounds of conversation, I went on deck. We were hove to, and within an eighth of a mile of us another vessel was coming up into the wind. She was very trim to look at, and I saw that a boat was being lowered over her side, and that she had the weather-gage of us. The Captain was walking up and down with his arms folded, and our crew were gathered in the waist, muttering in surly and half-frightened voices. \"We are in for it this time, Master Hurdiss,\" said Mr. Chaffee, casting a bitter look over the taffrail at the stranger, from whose peak was flying the British Jack. \"We are under the lion\u0027s paw, and no mistaking it.\" Norcross, the mate, leaned over the rail and spoke to one of the men on the deck below him. \"Dash, do you know that vessel, my man?\" \"Indeed I do, sir,\" was the reply from the light-haired seaman who had appeared so elated at the escape of the previous day. \"It\u0027s his Majesty\u0027s sloop-of-war Little Belt, if I\u0027m not mistaken, and she is a little floating hell, sir; that\u0027s what she is!\" Nevertheless, as I have said, she was a trim-looking craft, and I could not but admire the way the men tumbled into the boat and the long, well-timed sweep of the oars as they pulled toward us. When alongside, within a few yards, a young man in a huge cocked hat stood up in the stern-sheets. \"What brig is that?\" he asked, brusquely. Captain Morrison answered, giving our name and destination. \"I will board you,\" was the short reply of the cocked-hatted one, and he gave orders to the bowman, who was ready with his boat-hook, to make fast to the fore-chains. The English seamen, a sturdy-looking set, were all armed with cutlasses, and four or five of them followed their officer over the bulwarks. The young Britisher\u0027s insolence must have been hard to stand. \"Muster your crew and let me see your papers,\" he ordered, with a toss of his head; \"I would have a look at both of them.\" Our Captain\u0027s politeness in replying, however, was quite as insulting. \"You have only to mention your wish, my courteous gentleman,\" he sneered. \"Here are my papers and there are my crew. Will you help yourself to the cargo also? And pardon my not firing a salute, but we have a lady with us who objects to noise.\" At this the English Lieutenant lifted his great hat, but he glared at the Captain as if he would have liked to lay hands on him; then he ordered two of the crew to rout out the forecastle (in a lower tone of voice), and two of them to give a look into the cabin and deck-house. He waited until they had returned, and then taking the papers that had been extended to him, he called off the names of the American seamen. Each one stepped forward in turn, but without saluting, and replied to the Lieutenant\u0027s questioning; apparently they all hailed from New England. Two of them, however, he told to stand over to the larboard side. The men obeyed, and I have never seen such hate on any faces as they had on theirs. But the scene, which was tragic enough in all conscience, despite the grinning of the armed man-o\u0027-war\u0027s men who stood behind their leader, was to be broken by a climax as unexpected as a bolt from a clear sky. \"John Dash,\" read the officer. There was no answer, and he called it louder again, without result. \"Where is this man?\" he asked, impatiently. The Captain made a low bow. \"Thanks to your honor for your kind inquiry,\" he replied. \"But the man failed to report on the morning of sailing.\" It might have gone well had it not been for the interference of a low-visaged petty officer, who, with his fingers to his cap, here spoke. \"I saw a man go over the bow as we came up, sir,\" he said. Two of the men hurried forward and leaned over the side. I, being near the rail, looked over also. There was John Dash, holding on to the bobstay, his frightened face just above the surface of the water. In an instant he was hauled on board. \"Ah, there\u0027s where you\u0027ve been all the time, Mr. Dash!\" said Captain Morrison, sarcastically. \"And how strange I not knowing it! This gentleman has been asking for you very kindly.\" The poor man, dripping wet, was standing erect before the boarding-officer. [Pg 83] The titter that had run through the English sailors ceased as they saw the look on his face. He was drawing quick breaths, half-snarling like a dog, but he was trembling from head to foot. \"Oho!\" said the servant of the King, lifting his eyebrows, \"and here we are, eh? I think you know me, as I remember you, Charles Rice! You left us at the Port of Spain and forgot to return, you may remember. You owe his Majesty an accounting.\" \"I AM AN AMERICAN CITIZEN,\" RETURNED THE SAILOR, HOARSELY. \"I am an American citizen,\" returned the sailor, hoarsely, \"born at Barnstable, Massachusetts! I was impressed from the ship Martha on the high seas, and owe accounting to no one.\" \"None of your insolence,\" cried the Englishman, drawing back his closed hand. \"We\u0027ll see about that. You\u0027ll come with me, and these other two fine fellows also.\" Dash, or Rice (I understood afterwards the latter was his real name), gave a leap backward and ran into the deck-house. The officer turned. \"Bring that man out,\" he said to two of his bullies. Before they had crossed the deck something happened, and no one who witnessed it can ever shake it from his memory. The tall sailor appeared at the doorway. His hands were behind his back, and his blue eyes were absolutely rolling in his head. \"No, by the God of Heaven, you shall not be served!\" he cried. \"There is something you cannot command, at least, to do your bidding!\" With a swift motion he drew his left arm from behind his back and flung something on the deck. It was his right hand, severed at the wrist! Such a horror possessed us all that not a word was said. The planter\u0027s wife went in a heap to the deck, and as for myself, I went sick with the misery of it, and reeled to the side of the ship. The Lieutenant fell back as if struck a blow over the heart, and without a word, followed by his men, he clambered weakly down to his boat and shoved off. Dash lifted the bloody stump above his head; a curse broke from him, and then he fell into the arms of one of the black seamen. They carried him into the deck-house, and all hands followed, even the wheel being left deserted. As for myself, I crawled below into my bunk and wound the blankets about my head—Mrs. Chaffee was screaming in hysterics. Then and there was born in my heart such a hatred for the sight of the cross of St. George that I have never confounded my prejudice with patriotism, and this may account for some of my actions subsequently. No one referred to the happening in our talk after this—it might not have occurred. However, in such ways as we could we made the poor fellow comfortable; but John Dash, seaman, existed no longer; a poor, maimed, half-crazed hulk of a man was left of a gallant, noble fellow. But he had lived to teach a lesson. A day later we sighted Sandy Hook, and beating up the bay, anchored in New York Harbor, where the planter and his wife and the heroic seaman were put on shore. As the wind and tide were ripe to take us up the East River and through the narrows of Hell Gate into the Sound, we tarried but long enough to drop anchor and get it in again, and I caught only a panorama of houses and spires and the crowded wharfs of the city. The voyage up the Sound was uneventful, and my landing in Connecticut and what followed I shall make another chapter. But we passed many coasting-vessels and towns (whose number seemed past counting on both shores), and at last we entered the narrow sound of Fisher\u0027s Island and crept up close to the wharfs of Stonington. I made up my mind not to go ashore until the following morning, as it was after sunset before we had found a berth that suited the skipper. Oh, I have forgotten to add that when I returned to my bunk, after being boarded by the party from the Little Belt, I had missed the miniature which I had left hanging by a nail driven into one of the stanchions. That one of the British sailors, on the hurried search of the cabin, had helped himself to it was beyond doubting. [to be continued.]","sourceLink":"http://novel.tingroom.com/duanpian/3322/90994.html","bookId":393,"book":{"id":393,"title":"Harper\u0027s Round Table, November 24, 1896","description":"简介： The Editor of the Round Table has asked me to relate some incident of my life which may be of interest to its readers. Will they permit me to tell them that episode in my life which gives me, when I recall it, the greatest pleasure?It is the old stor...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3322","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
