{"id":88168,"no":13,"title":"Page 13","content":"“Do you have your schedule for tomorrow?” He asked the question without looking up as he opened his computer and powered it on.\\n\\n “My schedule?” She almost laughed. Rigid schedules and Aiden were one and the same. “I thought I’d rent a car, get a map from the concierge, and see some of the city.”\\n\\n “You have a car and driver.” Leaving the computer screen open, he passed her on his way through the living room to the bar. He got a bottle of water out of the built-in refrigerator, handed it to her, and reached for another. “Tell the truth, Cordelia. You’ve got the Rayburns’ address, and you want to drive by, see their house, right?”\\n\\n She shrugged. “Maybe.”\\n\\n “They live in a gated community. You’ll have to scale the wall in order to see their house.” He grinned, picturing it.\\n\\n “That isn’t going to happen,” she said. “And how do you know where they live?”\\n\\n “I had one of my assistants look them up,” he explained.\\n\\n “I do want to see them without their knowing.”\\n\\n “The Gallery Ball will be the perfect time, then,” he said. “Remember, I told you the Rayburns will be attending the ball. It’s a benefit for the arts. They have one every year.”\\n\\n “And you’re invited every year?”\\n\\n “Yes.”\\n\\n “Have you ever gone?”\\n\\n “No,” he answered. “But I’m a benefactor.”\\n\\n “Meaning you give them money.”\\n\\n “Yes.”\\n\\n “And you’re sure they’ll be there?”\\n\\n “Louis sent me the guest list I showed you. The Rayburns were on it. So was Simone’s father, Julian Taylor.”\\n\\n “Who is Louis?”\\n\\n “One of my managers. He pretty much runs this hotel.”\\n\\n “Okay, then,” she said. “I’d like to go to the ball with you if that’s all right.”\\n\\n “Of course.”\\n\\n Aiden returned to his bedroom, went straight to his computer, and pulled up his e-mails, his plan to get some work done. He could operate at full capacity on three hours of sleep a night, and he had almost eighty messages to get through.\\n\\n “Cordelia?” he called. He looked through the open door and could see she hadn’t moved from her spot in the living room.\\n\\n “Yes?”\\n\\n “What’s the matter? You’re standing there looking frozen,” Aiden remarked. Concerned, he added, “You don’t have to do anything you don’t want to do.”\\n\\n “I know. I was just wondering if I’m going to cringe when I see her.”\\n\\n “You’ll be fine,” he predicted. “Now, get some sleep.”\\n\\n Walking toward her bedroom she asked over her shoulder, “When is the ball?”\\n\\n “Saturday.”\\n\\n “That soon? That’s only three days away.” She was ready to protest but stopped herself. “I can do it,” she said, deciding she could shop for a ball gown tomorrow, beg for quick alterations—nothing ever fit off the rack—and be ready by Saturday night.\\n\\n “Two days, Cordelia. It’s Thursday now.”\\n\\n “No, it’s . . .”\\n\\n “Time difference,” he reminded her. “Sydney is a day ahead of us.”\\n\\n She’d forgotten the time change, and she was completely rattled. Only two days to get mentally ready to come face-to-face with Simone. “I’ll have to shop to find something suitable . . . I don’t usually pack a ball gown when I travel.”\\n\\n “Louis knows who to call. He’ll help you tomorrow. Now, get some rest.”\\n\\n She didn’t argue. She was tired and out of sorts, but sleep eluded her. Aiden was the reason. She couldn’t stop thinking about him. Boston was going to be her salvation, she remembered. All she had to do was get through this trip. Once she was away from him, she wouldn’t have to see his blond beauty queens hanging on his arm, wouldn’t have to put up with any of that nonsense, and wouldn’t have to constantly pretend it didn’t bother her that he completely ignored her. She would be alone, and that was what she wanted. Right?\\n\\n When she finally crashed, she slept hard and didn’t wake until after nine the next morning. Her eyes slowly opened and squinted against the bright sun shining through her window. It took her a few seconds to get her bearings, and then she threw back the thick duvet and sat on the side of the bed, watching a tall ship glide its way into the harbor. She detected the aroma of fresh-brewed coffee coming from the next room, but she wasn’t a coffee drinker. She preferred an icy-cold Diet Coke to wake her up. After she showered and dressed in a short pale-pink dress and nude flats, she put her hair in a ponytail and went in search of caffeine. She walked into the living room and came to a quick stop. Aiden was standing by the window with two other men in suits. They all turned when she entered the room. In his black suit and crisp white shirt, Aiden looked refreshed and completely put together. Nothing new about that, she thought grudgingly.\\n\\n “Good morning,” she said softly. “I didn’t mean to interrupt. I’ll just get a Diet Coke and be out of your way.”\\n\\n “Cordelia, I’d like you to meet Louis. He’ll set your schedule for today.”\\n\\n A young man with sandy hair and handsome hazel eyes came forward to shake her hand.\\n\\n Aiden nodded toward the other man. “And this is Cavanaugh. He’ll be your driver while we’re here.”\\n\\n Cavanaugh was either a fitness trainer or a bodyguard, and she was betting on her second guess. He was tall and as solid as a hundred-year-old oak and had the neck to prove it. He, too, came forward to shake her hand. Then he gave her his card with his phone number.\\n\\n “Keep this with you, please. I’ll be in the lobby,” he explained. “Whenever you’re ready, call or text me and I’ll bring the car around.”\\n\\n She didn’t feel it was appropriate to argue because Cavanaugh was following orders, but she did not need a driver. It seemed a waste of his time to wait around for her.\\n\\n “Aiden, may I have a word?”\\n\\n He was flipping through some papers but paused to look at her. “What do you need?” he asked impatiently.\\n\\n She turned back to Louis. “Did he say you’ll set my schedule?” she asked, wondering what exactly that meant.\\n\\n Louis handed her a sheet of stationery with times and locations listed. “I took the liberty of making an appointment for you at Chasnoff’s dress shop first. It’s quite exclusive and isn’t open to the public,” he explained. “It’s by appointment only, and you’re scheduled for eleven o’clock this morning. The owner has been given approximate specifications and should have a good selection of ball gowns for you to try on.”\\n\\n “By ‘approximate specifications’ you mean measurements?”\\n\\n “Yes, that’s right.”\\n\\n “Who came up with my measurements?”\\n\\n “I did,” Aiden said, grinning. “I guessed.”\\n\\n She didn’t know what to say, but the bell saved her from the awkward conversation. Louis opened the door for a waiter who pushed in a cart filled with food. He went to the dining table, set two places, and proceeded to lay out a spread worthy of a king. Besides the usual breakfast fare of eggs, bacon, scones, yogurt, and granola, there was a huge bowl of every kind of fruit imaginable.\\n\\n Louis handed Cordie a card with his cell phone number, and then he and Cavanaugh left. She immediately headed to the refrigerator to get her Diet Coke. She put ice in a glass and carried the bottle over to the table and sat. She didn’t realize how hungry she was until she took a bite of the buttery scone.\\n\\n Aiden joined her. “I’ve got meetings all day,” he said as he poured himself a cup of coffee from the silver carafe. “But I wanted to talk to you before I left.”\\n\\n “Okay. What would you like to talk about?” she asked as she popped a plump, ripe strawberry into her mouth.\\n\\n “The Rayburns,” he said. “They’re a prominent family here in Sydney, and their status comes primarily from Simone’s family owning Merrick Enterprises. Craig and Simone are a power couple. Craig Rayburn works for Merrick, and he’s become quite wealthy because of it. From the lifestyle he lives, he certainly knows how to spend money.”\\n\\n “Which is probably why Simone married him. Money is important to her. It certainly wasn’t because of his looks. Though it’s cruel of me to say, he reminds me of a bulldog.”\\n\\n Aiden laughed. “I think the photo of the family that Alec found was fairly recent . . . and now that you mention it, he did look a little like a bulldog.”\\n\\n Serious once again, Aiden continued. “Craig and Simone have become pillars of the community. They’re major benefactors to half a dozen institutions, everything from hospitals to universities. They’re often seen together at various functions. By all accounts, the Rayburns are a model family, and the sons treat their mother like a queen.”\\n\\n Cordie pushed her plate away. The thought of Simone surrounded by an adoring family made her suddenly lose her appetite.\\n\\n Aiden continued. “You’re about to drop a grenade into their lives. We need to anticipate their reaction.”\\n\\n He’d included himself in the plan, and she thought that was terribly nice of him. Aiden could actually be very considerate and kind when he wanted to be. In fact, on numerous occasions she’d seen him come to the rescue of someone who needed help. Yes, he was domineering and bossy, but when he let his guard down, there was definitely a softer side to him. Maybe it was jet lag, but right now all she could think about was kissing him. She suddenly realized she was staring at his mouth, so she closed her eyes and took a breath. Get a little control, she told herself.\\n\\n “Are you falling asleep on me?” Aiden asked, shaking her from her fantasy.\\n\\n She laughed. “Just jet leg.”\\n\\n “Did you hear what I said?”\\n\\n “About the grenade? Yes, I did.”\\n\\n “I don’t like going in without a plan, so you’ve got until tomorrow night to decide exactly what you want to do. Agreed?”\\n\\n “Agreed.”\\n\\n She watched him pick up his cell phone and keys, slip them into his pocket. He opened his briefcase and deposited the papers he’d been reading earlier. “If you need anything, just ask Louis.” He snapped the case closed and walked out the door.\\n\\n Cordie checked her watch. It was almost eleven, so she went to her room and called for the car. Cavanaugh was waiting just inside the lobby doors. It was a beautiful day, a bit on the chilly side, in the high fifties, and she was glad she’d carried along a lightweight coat. Cavanaugh reminded her that it was winter now in Sydney, which made her smile. Compared to winter in Chicago and Boston, Sydney was Utopia. Traffic was just as congested, though. It took a long while to get to the dress shop. There wasn’t a name on the door, and there wasn’t a front window with pretty dresses on display. It was almost as though Chasnoff’s was hiding the fact that it was in business.\\n\\n Miss Marie, an older woman with a no-nonsense attitude, met her at the door and introduced herself. She took Cordie by the arm and led her into the back of the shop, where a seamstress waited along with two salesladies eager to assist. The room Cordie was ushered into didn’t have any windows, but the white walls and white carpet made it seem quite large. There were three wingback chairs in a semicircle, and directly ahead was a carpet-covered circular platform that faced three huge mirrors guaranteed to show every flaw.\\n\\n Miss Marie was thrilled with Cordie’s figure. “It’s about time I dressed someone who isn’t built like a stick. And those eyes. Your fabulous eyes. You must wear a sapphire-blue gown. I insist. You really are stunning, you know.”\\n\\n No, she didn’t know, and she wasn’t sure how to respond to the exaggerated compliments. Stunning? Miss Marie was obviously nearsighted.\\n\\n “We’ll take care of everything,” she continued. “Your undergarments, makeup, gowns, and dresses, and of course wraps. Shall we get started?”\\n\\n “I just need one ball gown,” Cordie explained.\\n\\n “Those weren’t my instructions from Mr. Madison,” she replied.\\n\\n Cordie tried to argue, but Miss Marie wasn’t paying her any attention. For the next three and a half hours Cordie tried on beautiful gowns and dresses and skirts and wonderful silk blouses. Miss Marie and her staff treated her like a mannequin, tugging and pulling and pretty much ignoring any of her opinions, but once Miss Marie was finished, Cordie had a new name for her . . . Miracle Worker.\\n\\n Cavanaugh was waiting for her when she walked out of the shop. He drove her back to the hotel by way of a scenic route. She had wanted to experience some of the city, but jet lag wasn’t through with her. All she wanted now was a hot bath and a bed.\\n\\n She didn’t see Aiden that night or the next morning. He had already left for yet another round of meetings by the time she awoke, so she called down to Cavanaugh, who took her on a sightseeing tour. They rode the ferry around the harbor. It was drizzling, but Cordie didn’t mind. In her estimation the afternoon was perfect. Seeing the spectacular city from this vantage point only made her want to see more.\\n\\n Miss Marie and two assistants arrived at the penthouse at promptly six o’clock. They came in with a rack filled with clothes hidden by garment bags. Cordie was rendered speechless when she was told all of the clothes were for her. Since most of the items had been altered, she couldn’t send them back.\\n\\n Once again she was treated like a mannequin. They tugged and pulled, spackled, sprayed, and curled, and by seven thirty the transformation was complete. Her hair was brushed back and fashioned into curls with loose tendrils floating down to the base of her neck. In the past, Cordie had always applied makeup sparingly. She never used eyeliner or shadow. Occasionally she would brush on a little mascara, but that was rare. Miss Marie, however, had her own ideas and went to town with her makeup kit, all the while chastising Cordie for ignoring her incredible features. Never in her career, she said, had she seen such a flawless complexion, such beautiful eyes, such full lips. When she finally let Cordie look in the mirror, she barely recognized herself. Her eyes, her face, her body, had been transformed. Miss Marie really was a miracle worker.\\n\\n The gown, in a color that matched her eyes exactly, was exquisite. It had a plunging scoop neckline, and the bodice fit so perfectly it looked as though it was molded to her body. The floor-length skirt was straight with a slit that reached the top of her knee. Cordie had never worn anything so magnificent and didn’t think it could possibly be improved on, and then Miss Marie handed her a hooded cape. It was black velvet with a lining the same sapphire blue as the dress. Miss Marie even provided a small beaded clutch. Cordie couldn’t believe the vision that stared back at her in the mirror and decided she didn’t want to know how much it was all going to cost her. One huge splurge in her life was all right. Besides, she was going to a ball with Aiden. \\n\\n","sourceLink":"https://allnovel.net/fast-track-buchanan-renard-12/page-13.html","bookId":1825,"book":{"id":1825,"title":"Fast Track (Buchanan-Renard #12)","description":"Storyline: A corrupt congressman, a mother’s secrets, and a sizzling romance ignite passion and suspense in the new novel from #1 New York Times bestselling author Julie Garwood. \\n Cordelia Kane has always been a daddy’s girl—her father raised her alone after her mother died in a car crash when Cordelia was just two years old. So when he has a serious heart attack, Cordelia is devastated, and the emotion is only intensified by the confusion she feels when he reveals the shocking truth about her mother. \\n Cordelia can’t suppress her curiosity about the woman who gave birth to her, and when she discovers the answers to her questions lie in Sydney, Australia, she travels there to get them. \\n Hotel magnate Aiden Madison is Cordelia’s best friend’s older brother. He’s oblivious to the fact that she’s had a crush on him for years. When he gets railroaded into taking her along to Sydney on his company jet, he unknowingly puts her life at risk. He’s recently angered a powerful congressman by refusing to purchase overvalued land. Congressman Chambers is not a man to let such an offense slide, and he has the resources to get even and to get what he wants. \\n In Australia sparks are flying between Cordelia and Aiden, but multiple attempts on Aiden’s life are made while Cordelia is with him, and he realizes he must put a stop to the madness before he loses the thing he values most.\\n","cover":"https://allnovel.net/images/fast-track-buchanan-renard-12.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/fast-track-buchanan-renard-12.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:26:23 PM"}}
