{"id":68796,"no":9,"title":"Page 9","content":"Howard Keller and Lara were having dinner.\n \"How do we get started?\" Lara asked.\n \"First of all, we\u0027re going to get you the best team money can buy. We\u0027ll start out with a real estate lawyer to work out the contract with the Diamond brothers. Then we want to get you a top architect. I have someone in mind. After that, we want to hire a top construction company. I\u0027ve done a little arithmetic of my own. The soft costs for the project will come to about three hundred thousand dollars a room. The cost of the hotel will be about seven million dollars. If we plan it right, it can work.\"\n The architect\u0027s name was Ted Tuttle, and when he heard Lara\u0027s plans, he grinned and said, \"Bless you. I\u0027ve been waiting for someone to come along with an idea like this.\"\n Ten working days later he had rendered his drawings. They were everything Lara had dreamed of.\n \"Originally the hotel had a hundred and twenty-five rooms,\" the architect said. \"As you can see, I\u0027ve cut it down to seventy-five keys, as you\u0027ve asked.\"\n In the drawing there were fifty suites and twenty-five deluxe rooms.\n \"It\u0027s perfect,\" Lara said.\n Lara showed the plans to Howard Keller. He was equally enthusiastic.\n \"Let\u0027s go to work. I\u0027ve set up a meeting with a contractor. His name is Steve Rice.\"\n Steve Rice was one of the top contractors in Chicago. Lara liked him immediately. He was a rugged, no-nonsense, down-to-earth type.\n Lara said, \"Howard Keller tells me that you\u0027re the best.\"\n \"He\u0027s right,\" Rice said. \"Our motto is \u0027We build for posterity.\u0027 \"\n \"That\u0027s a good motto.\"\n Rice grinned. \"I just made it up.\"\n The first step was to break down each element into a series of drawings. The drawings were sent to potential subcontractors: steel manufacturers, bricklayers, window companies, electrical contractors. All in all, more than sixty subcontractors were involved.\n The day escrow closed, Howard Keller took the afternoon off to celebrate with Lara.\n \"Does the bank mind your taking this time off?\" Lara asked.\n \"No,\" Keller lied. \"It\u0027s part of my job.\" The truth was that he was enjoying this more than he had enjoyed anything in years. He loved being with Lara: he loved talking to her, looking at her. He wondered how she felt about marriage.\n Lara said, \"I read this morning that they\u0027ve almost completed the Sears Tower. It\u0027s a hundred and ten stories - the tallest building in the world.\"\n \"That\u0027s right,\" Keller said.\n Lara said gravely, \"Someday I\u0027m going to build a higher one, Howard.\"\n He believed her.\n They were having lunch with Steve Rice at the Whitehall. \"Tell me what happens next,\" Lara asked.\n \"Well,\" Rice said, \"first we\u0027re going to clean up the interior of the building. We\u0027ll keep the marble. We\u0027ll remove all the windows and gut the bathrooms. We\u0027ll take out the electrical risers for the installation of the new electrical wiring and update the plumbing. When the demolition company is through, we\u0027ll be ready to begin building your hotel.\"\n \"How many people will be working on it?\"\n Rice laughed. \"A mob, Miss Cameron. There\u0027ll be a window team, a bathroom team, a corridor team. These teams work floor by floor, usually from the top floor down. The hotel is scheduled to have two restaurants, and you\u0027ll have room service.\"\n \"How long is all this going to take?\"\n \"I would say - equipped and furnished - eighteen months.\"\n \"I\u0027ll give you a bonus if you finish it in a year,\" Lara told him.\n \"Great. The Congressional should...\"\n \"I\u0027m changing the name. It\u0027s going to be called the Cameron Palace.\" Lara felt a thrill just saying the words. It was almost a sexual feeling. Her name was going to be on a building for all the world to see.\n At six o\u0027clock on a rainy September morning, the reconstruction of the hotel began. Lara was at the site eagerly watching as the workmen trooped into the lobby and began to tear it apart.\n To Lara\u0027s surprise, Howard Keller appeared.\n \"You\u0027re up early,\" Lara said.\n \"I couldn\u0027t sleep.\" Keller grinned. \"I have a feeling this is the beginning of something big.\"\n Twelve months later the Cameron Palace opened to rave reviews and land office business.\n The architectural critic for the Chicago Tribune wrote, \"Chicago finally has a hotel that lives up to the motto \u0027Your home away from home!\u0027 Lara Cameron is someone to keep an eye on...\"\n By the end of the first month the hotel was full and had a long waiting list.\n Howard Keller was enthusiastic. \"At this rate,\" he said, \"the hotel will be paid off in twelve years. That\u0027s wonderful. We...\"\n \"Not good enough,\" Lara said. \"I\u0027m raising the rates.\" She saw the expression on Keller\u0027s face. \"Don\u0027t worry. They\u0027ll pay it. Where else can they get two fireplaces, a sauna, and a grand piano?\"\n Two weeks after the Cameron Palace opened, Lara had a meeting with Bob Vance and Howard Keller.\n \"I found another great site for a hotel,\" Lara said. \"It\u0027s going to be like the Cameron Palace, only bigger and better.\"\n Howard Keller grinned. \"I\u0027ll take a look at it.\"\n The site was perfect, but there was a problem.\n \"You\u0027re too late,\" the broker told Lara. \"A developer named Steve Murchison was here this morning, and he made me an offer. He\u0027s going to buy it.\"\n \"How much did he offer?\"\n \"Three million.\"\n \"I\u0027ll give you four. Draw up the papers.\"\n The broker blinked only once. \"Right.\"\n Lara received a telephone call the following afternoon.\n \"Lara Cameron?\"\n \"Yes.\"\n \"This is Steve Murchison. I\u0027m going to let it go this time, bitch, because I don\u0027t think you know what the hell you\u0027re doing. But in the future stay out of my way - you could get hurt.\"\n And the line went dead.\n It was 1974, and momentous events were occurring around the world. President Nixon resigned to avoid impeachment, and Gerald Ford stepped into the White House. OPEC ended its oil embargo, and Isabel Peron became the president of Argentina. And in Chicago Lara started construction on her second hotel, the Chicago Cameron Plaza. It was completed eighteen months later, and it was an even bigger success than the Cameron Palace. There was no stopping Lara after that. As Forbes magazine was to write later, \"Lara Cameron is a phenomenon. Her innovations are changing the concept of hotels. Miss Cameron has invaded the traditionally male turf of real estate developers and has proved that a woman can outshine them all.\"\n Lara received a telephone call from Charles Cohn.\n \"Congratulations,\" he said. \"I\u0027m proud of you. I\u0027ve never had a protegee before.\"\n \"I\u0027ve never had a mentor before. Without you, none of this would have happened.\"\n \"You would have found a way,\" Cohn said.\n In 1975 the movie Jaws swept the country, and people stopped going into the ocean. The world population passed four billion, reduced by one when Teamster President James Hoffa disappeared. When Lara heard the four billion population figure, she said to Keller, \"Do you have any idea how much housing that would require?\"\n He was not sure whether she was joking.\n Over the next three years, two apartment buildings and a condominium were completed. \"I want to put up an office building next,\" Lara told Keller, \"right in the heart of the Loop.\"\n \"There\u0027s an interesting piece of property coming on the market,\" Keller told her. \"If you like it, we\u0027ll finance you.\"\n That afternoon they went to look at it. It was on the waterfront, in a choice location.\n \"What\u0027s it going to cost?\" Lara asked.\n \"I\u0027ve done the numbers. It will come to a hundred and twenty million dollars.\"\n Lara swallowed. \"That scares me.\"\n \"Lara, in real estate the name of the game is to borrow.\"\n Other people\u0027s money, Lara thought. That\u0027s what Bill Rogers had told her at the boardinghouse. All that seemed so long ago, and so much had happened since then. And it\u0027s only the beginning, Lara thought. It\u0027s only the beginning.\n \"Some developers put up buildings with almost no cash of their own.\"\n \"I\u0027m listening.\"\n \"The idea is to rent or resell the building for enough money to pay off the debt on it, and still have money left over to buy some more property with that cash, and borrow more money for another property. It\u0027s an inverted pyramid - a real estate pyramid - that you can build on a very small initial cash investment.\"\n \"I understand,\" Lara said.\n \"Of course, you have to be careful. The pyramid is built on paper - the mortgages. If anything goes wrong, if the profit from one investment fails to cover the debt on the next one, the pyramid can topple and bury you.\"\n \"Right. How can I acquire the waterfront property?\"\n \"We\u0027ll set up a joint venture for you. I\u0027ll talk to Vance about it. If it\u0027s too big for our bank to handle, we\u0027ll go to an insurance company or a savings and loan. You\u0027ll take out a fifty-million-dollar mortgage loan. You\u0027ll get their mortgage coupon rate - that would be five million and a ten percent rate, plus amortization on the mortgage - and they\u0027ll be your partners. They\u0027ll take the first ten percent of the earnings, but you\u0027ll get your property, fully financed. You can get your cash repaid and keep one hundred percent of the depreciation, because financial institutions have no use for losses.\"\n Lara was listening, absorbing every word.\n \"Are you with me so far?\"\n \"I\u0027m with you.\"\n \"In five or six years, after the building is leased, you sell it. If the property sells for seventy-five million, after you pay off the mortgage, you\u0027ll net twelve and a half million dollars. Besides that, you\u0027ll have a tax-sheltered earning stream of eight million in depreciation that you can use to reduce taxes on other income. All of this for a cash investment of ten million.\"\n \"That\u0027s fantastic!\" Lara said.\n Keller grinned. \"The government wants you to make money.\"\n \"How would you like to make some money, Howard? Some real money?\"\n \"I beg your pardon?\"\n \"I want you to come to work for me.\"\n Keller was suddenly quiet. He knew he was facing one of the most important decisions of his life, and it had nothing to do with money. It was Lara. He had fallen in love with her. There had been one painful episode when he had tried to tell her. He had practiced his marriage proposal all night, and the following morning he had gone to her and stammered, \"Lara, I love you,\" and before he could say more, she had kissed him on the cheek and said, \"I love you, too, Howard. Take a look at this new production schedule.\" And he had not had the nerve to try again.\n Now she was asking him to be her partner. He would be working near her every day, unable to touch her, unable to...\n \"Do you believe in me, Howard?\"\n \"I\u0027d be crazy not to, wouldn\u0027t I?\"\n \"I\u0027ll pay you twice whatever you\u0027re making now, and give you five percent of the company.\"\n \"Can I...can I think about it?\"\n \"There\u0027s really nothing to think about, is there?\"\n He made his decision. \"I guess not...partner.\"\n Lara gave him a hug. \"That\u0027s wonderful! You and I are going to build beautiful things. There are so many ugly buildings around. There\u0027s no excuse for them. Every building should be a tribute to this city.\"\n He put his hand on her arm. \"Don\u0027t ever change, Lara.\"\n She looked at him hard.\n \"I won\u0027t.\" \n","sourceLink":"https://allnovel.net/the-stars-shine-down/page-9.html","bookId":2364,"book":{"id":2364,"title":"The Stars Shine Down","description":"Storyline: \n Lara Cameron is a famous powerful wealthy New York building developer who struggled from brutal poverty in Glace Bay, a banker who took her body as part of her first deal, to Chicago, banker Keller whose love she takes lightly for granted. As her skyscrapers and boutique hotels tower on earth, she is at the top of a male dominated field. She lies and cheats to close a deal, making cruel enemies. She is forty, beautiful, glamorous, insecure, ruthless, vulnerable, secretly generous, rich - and still wants more. She marries an international concert pianist, the Lochinvar of her childhood dreams, but someone puts him in the hospital and threatens to take down her empire.\n \n","cover":"https://allnovel.net/images/the-stars-shine-down.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-stars-shine-down.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:10:22 AM"}}
