{"id":111722,"no":22,"title":"Page 22","content":"Damon and I remained in the cell for several minutes after the man left, too stunned to even contemplate escaping. The guards didn\u0027t come back in with the keys. I didn\u0027t blame them.\n I cursed, slamming the bars. It seemed that no matter what I decided to do, which way I turned, things got worse. And the Sutherlands... they had just been innocent bystanders, swept up in the path of destruction just because they were at the wrong place at the wrong time. While my brother didn\u0027t actively cause their deaths, he was no less responsible. I turned on him, ready to tear him apart.\n And then I saw the look on his face.\n Damon\u0027s eyes had glazed over and he leaned against the wall for support. He\u0027d worn the same dazed expression for weeks after he\u0027d woken up as a vampire and discovered that Katherine was dead.\n \"What was that?\" he whispered, finally looking at me.\n But I had no idea what that was. All I knew was that it was more powerful, more dangerous, more deadly than any creature I\u0027d ever encountered. Anger at my brother drained away and something like exhaustion set in. \"I\u0027m not sure, though I think he left me a message,\" I said, remembering the bloody scrawl on the side of the Sutherlands\u0027 home. \"But what was that about Katherine? What was he to her?\"\n Damon shrugged. \"I have no idea. She never told me about that... thing.\"\n \"He said we took her from him. What the hell does that mean? What curse is he talking about? Did Emily cast a spell on someone?\" I said. I began to pace, my mind racing.\n \"I\u0027m guessing it means he believes we killed her. Which you did, brother,\" Damon said.\n In a pique, Damon sat down, stretched his legs out, and put his hands behind his head, pillowing it against the stone. I would get no more answers out of him.\n I slid down against the bars and buried my head in my hands, thinking of my time with Katherine. Had she ever said anything about her past? Let anything slip? But I had been so completely under her thrall that it was impossible to know what had been real and what she had compelled me to believe. Though I remembered biting her, I didn\u0027t have any memory of her feeding me her blood. But she must have often, as I had enough of her blood in my system to come back as a vampire after my father shot me. In a funny way, Katherine had made me. We were almost like her children.\n My mind snagged. \"Did Katherine ever tell you about her sire?\" I asked, putting words to a horrible thought forming in my mind. \"The vampire who made her?\"\n Damon looked up at me, shocked out of his sulk. \"You think... ?\"\n I nodded.\n Damon leaned back and knocked his head against the wall. He had been genuinely in love with Katherine. I wondered if meeting Katherine\u0027s maker made our little tryst in Mystic Falls seem like a speck in the vastness of eternity.\n \"I suppose we should call a guard over and compel him to free us,\" he said tiredly.\n A sound of commotion from the lobby stopped us. There were muffled thuds, like bodies hitting the floor.\n There was a scream. It was high-pitched and hard to tell whether it came from a woman or a man, so great was the pain. Then came the grating sound of a desk being moved, and what might have been a wooden chair being shattered against the wall.\n I stood. So did Damon.\n Damon and I glanced at each other. The pocket watch Winfield had given me ticked loudly in the sudden silence.\n The door to the stockade opened once again and in came a girl wearing men\u0027s trousers and black suspenders, a long blond braid over her shoulder.\n \"Lexi!\" I gasped.\n \"I\u0027m growing tired of bailing you boys out,\" she said as she shook the key at us. \"I should leave you in there overnight, teach you a lesson about making trouble,\" she joked.\n I reached through the bars to grab her free hand. \"I\u0027ve never been happier to see anyone.\"\n \"I don\u0027t doubt it,\" Lexi said drily, but a small smile curved the edges of her lips.\n Damon rolled his eyes. \"We were just about to free ourselves, thank you very much.\"\n \"I don\u0027t doubt that, either. Just figured I\u0027d speed up the escape,\" she said. Her nose twitched, and her flat tone indicated she didn\u0027t entirely approve of his existence. The last time she\u0027d seen him, he\u0027d just gotten through killing Callie and was starting in on me.\n \"So did you knock out the entire precinct?\" Damon asked, straightening the shoulders of his jacket.\n Lexi undid the final lock on the door. The door sprang open and I rushed to hug her. \"No, only some of them. The rest I compelled. Some of us don\u0027t like needless violence - or messes that need to be explained later,\" she said into my shoulder. I released her and she motioned us toward the door. \"Now let\u0027s get out of here before anyone else shows up.\"\n \"I always cover my tracks,\" Damon said defensively as we rushed through the door of the containment area and into the front offices. Several policemen sat at their desks, poring over ledgers, oblivious to the two prisoners escaping and the general state of disarray. Desks had been pushed aside, among the splintery remains of what had once been a chair, and the man who had sat there was lying on the floor, a rivulet of blood leaking from his head. But his eyes were open and he appeared to be whispering some word over and over again.\n \"Strong-willed, that one,\" Lexi said.\n \"How were you able to find us?\" I asked, following her down the stairs.\n \"A mysterious Italian count with black hair and ice-blue eyes and a flair for the dramatic sweeps into the New York social scene and very quickly marries the most eligible society girl?\" she said, rolling her eyes. \"They ran your picture in the social pages.\"\n Damon at least had the grace to look sheepish.\n \"I always cover my tracks,\" she mimicked. \"There are a lot of ways to live rich and powerfully as a vampire... none of which involve sweeping into the New York social scene...\"\n \"... and marrying the most eligible society girl. Fair enough,\" Damon conceded. \"At least I did it with style.\"\n We exited the prison, and the cold evening air washed over me. The stars were just beginning to flicker in the night sky, and the gaslights cast a warm glow over the street. It was a beautiful night, the like of which Bridget, Lydia, Winfield, and Mrs. Sutherland would never enjoy again - all because of me, Damon, and Katherine.\n I only came to New York to escape. Escape Damon, memories of Callie, vampires, Mystic Falls, Katherine... and yet it all still followed me like an onerous shadow. I knew then that I\u0027d never escape my past, not fully. Such dark things don\u0027t fade with time - they merely reverberate through the centuries.\n I could only hope that Margaret was safe somewhere, away from the hell-beast that had violently murdered her entire family.\n \n","sourceLink":"https://allnovel.net/stefan-s-diaries-the-craving-the-vampire-diaries-3/page-22.html","bookId":2075,"book":{"id":2075,"title":"Stefan\u0027s Diaries: The Craving (The Vampire Diaries #3)","description":"Storyline: \n The Craving (The Vampire Diaries: Stefan\u0027s Diaries #3) \n After his brother, Damon Salvatore, betrays him in New Orleans, Stefan starts over in Manhattan. Vowing never to harm another human, he roams the streets, trying to disappear into the city’s chaos. But just when he thinks he’s left his past behind, Stefan discovers that he can never escape his brother. Damon has grand plans for the vampire Salvatore brothers—whether Stefan likes it or not. Together, they take New York by storm. When their exploits end up on the society pages, an old enemy resurfaces—one hell-bent on revenge.\n \n","cover":"https://allnovel.net/images/stefan-s-diaries-the-craving-the-vampire-diaries-3.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/stefan-s-diaries-the-craving-the-vampire-diaries-3.html","creation":"Oct 5, 2019 8:58:19 AM","modification":"Oct 6, 2019 12:31:00 AM"}}
