{"id":111725,"no":25,"title":"Page 25","content":"November 13, 1864 I am cursed. It is obvious now. Maybe that\u0027s what being a vampire means. Maybe tragedy and evil come with the hunger and the fangs; it isn\u0027t just having to live off human blood. It is the unending aloneness, being cut off from real life and from real relationships. Death will always be there to separate me from those I loved. There is a scroll of names in my head, and the list kept getting longer every day. Rosalyn was the first to die because of me. Katherine couldn\u0027t stand that I was engaged, so she killed the girl. Even Katherine\u0027s blood was on my hands. Though she came into my and my brother\u0027s lives and turned them upside down. She died as a result of my actions. I should never have tried to reason with my father, never tried to convince him of a different viewpoint. As soon as he confided in me about the vampire hunt, I should have done everything I could to get Katherine out of town. Pearl. She, too, could have escaped. I don\u0027t know exactly what her story was, but she seemed far more peaceable than Katherine. Alice the barmaid. All the humans I fed on in New Orleans. Too many to name, even if I had bothered learning their names. They were just unlucky folk who accidentally crossed my path when I was hungry or needed something. Callie. She died because I was stupid enough to think that she would be rewarded for helping out two vampires. The Sutherlands. Bridget, Lydia, Mrs. Sutherland, and Winfield. A normal family who just happened to catch the attention of one insane, vengeful vampire. And now Lexi. Lexi should have stayed in New Orleans in her hostel for the undead, safe in her own world where she could continue her own version of doing good. She will be the next to die unless I figure out how to save her. I have spent too much time in New York bemoaning my fate, moping, feeling cursed. By standing idly by, by complaining, I am letting evil occur all around me. Now is the time for action, for justice. I must channel my loneliness and despair into rage. I must stop being a coward, as I\u0027ve always been, in both life, when I let my father bully me into a marriage I didn\u0027t want, and in death, when I\u0027ve allowed Damon to torture me and kill the people I love. Never again will I let others bend me to their will. From now on I will fight. And I will free Lexi, if it is the last thing I do. I crumpled the piece of paper in my fist, growling with anger. How had he taken her? I hadn\u0027t heard a thing, even with my vampire senses. The servants, a couple of mice and rats in the walls, but nothing else. The vampire Lucius had come in complete silence and managed to seize - or disable - Lexi before she was able to cry out. What speed, what Power this beast must have! But for all of the vampire\u0027s ancientness, for all that he was a \"direct descendant from Hell,\" for all of the monster he was, he had, with that single piece of paper, revealed one very human weakness about himself. He had a very petty need to gloat. If Damon were in his place, I would have come downstairs and seen Lexi dead on the floor. But the beast wanted me to know that everyone around me was in danger, to scare me before he killed me. Now there was only one thing on my mind. If Lexi was still alive, it was my duty to go after her and save her. And if she wasn\u0027t alive... it was my right and pleasure to kill Klaus\u0027s foot soldier. This I swore. What was it he had said in the prison? An eye for an eye. He took something valuable from me and Damon, our wives and their family, because we had taken Katherine from him. But the Sutherlands were human, of no importance and very easily disposed of. His beloved Katherine died in a church fire. What if... The words struggled to the surface of my brain. What if he planned on killing Lexi the same way? Suddenly I felt like I had a chance again. But which church? There had to be hundreds in the city. I ran outside. The smell of decay hung heavy in the air, as though Lucius had unwittingly laid a path for me. I followed it south, feeling as though I were gaining strength with each step that brought me closer to where Lexi might be - and who I should be. I had tried to stay away from humans, and that hadn\u0027t worked. I had tried living with them, with disastrous results. But I had never tried a more moderate path. I would never be human, but I could help them, as I\u0027d helped Bridget that night in the park. I could never live among humans, but I could find companionship among humans like Mrs. Sutherland and vampires like Lexi. Those ties would tether me to this world and keep me honest. I ran past a brick town house and grabbed a pigeon in midflight from the air, tearing into its neck for extra fuel. The stench was stronger now, and I saw an Irish Catholic church just two streets away. I knew people had actually been worried about this particular structure being torched, as had been done to others during the religious riots in Pennsylvania. But the place was quiet, with several old women sitting in the front pews, and oddly, the scent of decay that had permeated the air outside so strongly had evaporated. There was no odor of anything besides candles and incense burning at the altar. I slunk into a back pew and regarded the rose oculus window. The scene depicted a grieving Mother Mary in lapis lazuli blue as the sun, a bloody garnet, rose behind her. I closed my eyes and thought, hard. Why had Lucius thrown me off his scent? Was I wrong to assume that he wanted to bait me, so I could arrive at the correct church just as he put the match to the powder keg? What church would he choose - and why? Then it hit me: I was being stupid. The vampire had done due diligence and found out exactly where my bride\u0027s family lived; he wouldn\u0027t have just chosen a random church to burn down. He would have picked the chapel in which I was married. I knew the truth of this deep in my bones. But just as surely I knew that I couldn\u0027t go after him by myself. And there was only one person who was capable of helping me. Damon. Damon, who had trapped me into the stupid marriage that got the Sutherlands all killed. Damon, who had killed Callie. Damon, who swore to make my life a living hell for all eternity. But in the end I needed him. I had seen him control his powers in ways I could not. And I would need all the Power I could get on my side if I was to find a way to defeat an old one. Lexi had rescued us from prison, and surely even someone as debased and fallen as Damon would recognize that we owed her. The only problem was finding him. And now, I think I\u0027m ready for a drink was what he had said. For most vampires that only meant one thing. For my brother, well, he could easily have meant hitting the bottle as well as draining a person or two. But where? In the weeks between following me to New York and \"finding\" me at the Chesters\u0027 ball, he had, as Lexi said, been sweeping the New York society scene as an Italian count. He had probably talked - or compelled - his way into any number of private clubs or restaurants. I wracked my brains, trying to remember the prattle Bridget had bored me with, about who was seen where with whom, and where was the latest place to go, and how there was an oyster bar serving genuine Pimm\u0027s Cup, just like in England. For lack of any better idea, I went there first. It was a lovely place in an otherwise unwholesome area at the southern seaport. Uncertain-looking sailors wandered from pool of streetlight to pool of streetlight, gathering in twos and threes to quietly discuss the seedier side of import and export, laugh loudly, and sing old drinking songs. Among all of this rotting seaweed, though, fancy livery and decorated carriages were parked: society men lured by the oysters, Pimm\u0027s Cups, and the dangerous aspect of the place. Inside there were quite a few of the young men I had seen at the Chesters\u0027 ball, as well as at my own wedding. Even Bram was there, but he was keeping to himself and looked ill. His face was ashen and his eyes sunken, and he wore black ribbons around his sleeves for mourning. His drink was untouched and he just stared sadly out the windows at the river. I turned my back to him, not wanting him to call out that a murderer - as he no doubt thought I was - was in their midst. I beckoned for the hostess to come over. \"Has D - uh, the Count DeSangue been by here tonight?\" I asked. The girl looked me up and down, face flushing with excitement. \"With him accused of murder and this being his favorite place and me being his favorite girl, what on earth would make me tell you something like that?\" I could see by the thick scarf she wore around her neck that she wasn\u0027t just warding off the cold night air - this had definitely been one of Damon\u0027s haunts. I started to reach into my pocket for bribe money. She saw where I was going and shook her head. \"Not on your life, love. Not for Damon.\" \"You have no idea who he is, or what you\u0027re getting involved in,\" I growled, grabbing her wrist. Her face fell and she tried to struggle out of my grasp. \"Listen to me. I\u0027m Stefan Salvatore - the other man accused of murdering the Sutherlands. Neither one of us did it, all right? We\u0027re both on the run from the police. Now tell me where he is.\" I didn\u0027t compel her. I didn\u0027t exactly threaten her. But she nodded mutely and I relaxed my grip. \"I don\u0027t know,\" she said, rubbing her wrist. \"I know he liked a drink at some of those fancy uptown places like the Skinny Black Cat and Xerxes\u0027 Repose. He even had his own table at the Twenty-Two Club.\" At that moment a waitress came out. \"Are you talking about the count?\" she asked, an excited grin spreading across her face. I sighed. \"Yes.\" \"Well, he once took me to Strange Fruit just a few blocks down.\" \"He took you on a date?\" the hostess said, envy apparent in her voice. The waitress nodded proudly. \"Thank you,\" I said, meaning it. Lexi or Damon would have compelled the women to forget me at that point. I sighed, thinking about how much easier life would be if my Powers were stronger and my will weaker. I checked Winfield\u0027s pocket watch. It was five A.M.; an hour had passed since Lexi and I had first entered the mansion. Time was ticking by far too quickly for my liking, and every minute seemed to seal Lexi\u0027s fate more completely. Seconds later I was standing inside the door of Strange Fruit, a large, low, dark bar with giant wooden fans slowly turning overhead. The sailors who couldn\u0027t get into the oyster bar were there, along with every type of shady personality, lost soul, and criminal genius that managed to stay just this side of the law. Damon sat at a small rickety table by himself in just his shirtsleeves, a half-empty bottle of bourbon before him. \"Nursing your wounds?\" I asked, walking over. He didn\u0027t even bother looking surprised. \"A minor setback, brother. Don\u0027t forget I have those dowry checks. As soon as things quiet down a bit I, and they, are out of this town.\" \"Doubtful any bank would cash a check for a suspected murderer.\" \"You really need to stop thinking like a human and start thinking like a vampire. There is no bank teller I can\u0027t compel.\" He stretched languorously and poured some drink into his glass. Then he offered the glass to me, and chugged a big swallow directly from the bottle. \"I need your help,\" I said, pushing the glass away. I handed him the piece of paper and filled him in on what had happened. He squinted his eyes as he read it. \"So?\" I looked at him, gape-mouthed. \"He has Lexi,\" I repeated. Then, afraid he was too drunk to understand what that meant, I pointed out the obvious. \"We have to save her!\" \"Mm.\" He thought about it for a moment. \"Nope.\" He made a big show of slowly kicking his legs back up onto the table, as if he had been in the midst of an important activity when I had interrupted him. \"What is wrong with you?\" I demanded. \"You saw him - he\u0027ll destroy her!\" \"So what?\" Damon asked. \"It was her choice to come to New York. No one asked her to come up here.\" \"She got us out of prison - \" \"We, excuse me, I was doing, just fine in that department. You forget. We could have gotten out on our own. We didn\u0027t need her for that. She was meddling. If further meddling got her captured, well, that\u0027s her own damn fault.\" The anger that had ignited in me upon finding the note from the beast was now stoked into a rage that almost had me turning into full vampire mode. For just a moment, I didn\u0027t care who saw me. \"You,\" I said, trying to calm down, trying to put the blackness I felt into words. Damon sat up and looked me in the eye almost eagerly, waiting for the fight. \"You are... you are...\" I spat. \"I am what you made me,\" Damon said dully, lifting his glass as though to toast me. I grabbed his shoulders. \"No. You don\u0027t have to be a heartless killer. Even Katherine wasn\u0027t that.\" Damon\u0027s eyes flashed. \"Don\u0027t speak to me about who Katherine was! I knew her better than you did.\" I shook my head. \"Even you know that\u0027s not true. You loved her more, but I knew her just as well. All Katherine wanted was for the three of us to be together forever. She would not have wanted us to be at odds, fighting. She would not have wanted this.\" The surprise and anger on his face at what I\u0027d said was almost worth it. Almost. \"I\u0027m going to save Lexi. Or die trying. And if by some miracle I don\u0027t die - I never want to see you again.\" And before he could prepare some witty comeback or some threat, I banged my way out into the night, leaving my brother behind forever.","sourceLink":"https://allnovel.net/stefan-s-diaries-the-craving-the-vampire-diaries-3/page-25.html","bookId":2075,"book":{"id":2075,"title":"Stefan\u0027s Diaries: The Craving (The Vampire Diaries #3)","description":"Storyline: The Craving (The Vampire Diaries: Stefan\u0027s Diaries #3) After his brother, Damon Salvatore, betrays him in New Orleans, Stefan starts over in Manhattan. Vowing never to harm another human, he roams the streets, trying to disappear into the city’s chaos. But just when he thinks he’s left his past behind, Stefan discovers that he can never escape his brother. Damon has grand plans for the vampire Salvatore brothers—whether Stefan likes it or not. Together, they take New York by storm. When their exploits end up on the society pages, an old enemy resurfaces—one hell-bent on revenge.","cover":"https://allnovel.net/images/stefan-s-diaries-the-craving-the-vampire-diaries-3.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/stefan-s-diaries-the-craving-the-vampire-diaries-3.html","creation":"Oct 5, 2019 8:58:19 AM","modification":"Oct 6, 2019 12:31:00 AM"}}
