{"id":106604,"no":28,"title":"Page 28","content":"“Show me.” He was more forceful than the uniform had been. I blew him off just the same.\\n\\n “Show yourself.” I wasn’t trying to be a smartass. I just wasn’t going back into that house. I was a civilian now. There were things I shouldn’t have to look at. I told the detective where to find Jamie. I told him that there wasn’t anyone else in the house. I told him I would wait there. The detective assigned a uniform to make sure I did. He returned twenty minutes later. His cheeks were pale and his breath came hard, yet he spoke steadily.\\n\\n “Touch anything?”\\n\\n “Back door handle, in and out.”\\n\\n “Anything else?”\\n\\n “No.”\\n\\n “Sure?”\\n\\n “Yes.”\\n\\n “We might take your fingerprints, anyway.”\\n\\n “They’re already on file,” I told him. That raised an eyebrow until I explained that I used to work the job he was working. Yet I doubt I had done it any better. He took my statement calmly, professionally, leading me through my discovery of the victim.\\n\\n The victim.\\n\\n Already Jamie’s identity was disappearing under the weight of what she had become. A victim. Her name no longer represented a living, breathing woman. Whatever her history, whatever her accomplishments and failings, Jamie’s life would now and forever be defined by one of the worst things that could happen to a human being. She was a victim now. Nothing more. Murder does that.\\n\\n Someone laughed, a technician. That’s when I noticed Bobby Dunston. He glared at the tech like he wanted to destroy him in place and was looking forward to the opportunity. The laughter died in the tech’s throat.\\n\\n By now the brick house was surrounded by trucks and squads, marked and unmarked. They came silently, without siren, without lights. Yet the neighbors heard them just the same. They emerged from their stately homes and watched from their stoops, wondering what evil had invaded their community and threatened their children. A yellow ribbon went up, circling the Bruder house. POLICE LINE DO NOT CROSS. Neighbors who rarely spoke before gathered in small clusters to discuss it—comradeship in the face of adversity. It happens every time there’s a heavy storm.\\n\\n “What does it mean?” they asked, shaking their collective heads at the army of St. Paul police officers and technicians. The residents of Highland Park were already embarrassed and ashamed. They weren’t yet sure what had happened, but they all knew that it wasn’t supposed to happen there. University-Summit, maybe. Or Frogtown. Or the west side of St. Paul. Not there. Highland Park was a “safe” neighborhood. All the real estate agents said so.\\n\\n I gave my statement twice more, the second time to Bobby, only I told him things I didn’t tell the others.\\n\\n “I picked the back door lock.” I didn’t want any scratches I might have left on the metal to confuse his investigation.\\n\\n “Goddammit, McKenzie.”\\n\\n “Thought you should know.”\\n\\n “What else?”\\n\\n “I listened to the answering machine. Two messages. The first was from a man named Warren, the second was from Merci Cole.”\\n\\n “I already secured the tape.”\\n\\n I nodded.\\n\\n “What the hell were you doing here?” he wanted to know.\\n\\n “This morning I killed a man named Bradley Young.” The rest of the story came out in a flood and Bobby forced me to repeat it, slowly.\\n\\n “What do you think?” I asked after I had finished.\\n\\n “I don’t believe in coincidences.”\\n\\n “Neither do I.”\\n\\n “But, they do happen.”\\n\\n “Yes, they do.”\\n\\n “Know anything about the husband?”\\n\\n “Good Deal Dave? Do you honestly believe a man could do something like that to his own wife?”\\n\\n “Christ, Mac. Men do things like that to their wives all the fucking time.”\\n\\n Bobby was trying hard to contain his rage, but it was spilling out in his language. “Where the fuck is he?”\\n\\n “And the child,” I added.\\n\\n “And the child.”\\n\\n “The killing—it’s just like Katherine’s, isn’t it?”\\n\\n Bobby rubbed his eyes.\\n\\n “Maybe it’s the guy I killed.”\\n\\n “We should be so lucky.”\\n\\n “Bobby?”\\n\\n “Yeah?”\\n\\n “Will you make the call to the Carlsons? I mean, you’re gonna have to call them anyway, right?”\\n\\n “You coward.”\\n\\n Yeah, that’s me all right.\\n\\n “What are you doing here, McKenzie?” It was Deputy Chief Tommy Thompson. Neither Bobby nor I saw him approach. “I’m waiting for an answer.”\\n\\n Thompson often spoke in a very soft monotone and you’d better listen carefully because if you asked, “Huh, what did you say?” he’d turn on you with an angry squint and demand to know why he should waste his breath if you can’t even be bothered to pay attention.\\n\\n “McKenzie discovered the body,” Bobby answered for me. “He has an angle on the case.”\\n\\n “I must have missed that memo. The St. Paul Police Department is hiring consultants?”\\n\\n Bobby rubbed his eyes some more. “He discovered the body.”\\n\\n “I’m listening,” Thompson said. \\n\\n","sourceLink":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1/page-28.html","bookId":2225,"book":{"id":2225,"title":"A Hard Ticket Home (Mac McKenzie #1)","description":"Storyline: Ex-St. Paul cop Rushmore McKenzie has more time, and more money, than he knows what to do with. In fact, when he\u0027s willing to admit it to himself (and he usually isn\u0027t), Mac is downright bored. Until he decides to do a favor for a friend facing a family tragedy: Nine-year-old Stacy Carlson has been diagnosed with leukemia, and the only one with the matching bone marrow that can save her is her older sister, Jamie. Trouble is, Jamie ran away from home years ago. \\n Mac begins combing the backstreets of the Twin Cities, tracking down Jamie\u0027s last known associates. He starts with the expected pimps and drug dealers, but the path leads surprisingly to some of the Cities\u0027 most respected businessmen, as well as a few characters far more unsavory than the street hustlers he anticipated. As bullets fly and bodies drop, Mac persists, only to find that what he\u0027s looking for, and why, are not exactly what he\u0027d imagined. \\n David Housewright\u0027s uncanny ability to turn the Twin Cities into an exotic, brooding backdrop for noir fiction, and his winning, witty hero Rushmore McKenzie, serve as a wicked one-two punch in A Hard Ticket Home, a series debut that reinforces Housewright\u0027s well-earned reputation as one of crime fiction\u0027s rising stars.\\n","cover":"https://allnovel.net/images/a-hard-ticket-home-mac-mckenzie-1.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:57:26 PM"}}
