{"id":106606,"no":30,"title":"Page 30","content":"“Lies!” I barked, tossing the magazine aside. There are only two reasons people commit murder—love and money. I wondered which motive applied to Jamie Carlson Bruder.\\n\\n “God,” I screamed, using His name like an obscenity. I certainly wasn’t calling on Him. I hadn’t called on Him since my mother died. I fell to my knees and started shaking when they told me the news. It’s the closest I’d come to prayer since. What good would He do me, anyway? Go to confession. Bless me, father, for I have sinned. I broke the biggie. Number five on the Roman Catholic hit parade. Thou Shalt Not Kill. What penance do you get for that? Five Our Fathers? Three Hail Marys? Sure, I dread the loss of heaven and the pain of hell, but you know what? I’ve done it before. I might do it again.\\n\\n Besides, I had some serious misgivings about God. Is He really all powerful and all loving, both at the same time, like they say? See, I can understand how an all-loving God, one who cares deeply, might not have the power to intervene. But if He’s all powerful and still allows innocent people to suffer and die as Jamie and Katherine had suffered and died, wouldn’t that make Him one callous sonuvabitch?\\n\\n I picked up the phone, set it down, picked it up again, hesitated, punched Kirsten Sager Whitson’s home number and hung up before it rang.\\n\\n Call someone else.\\n\\n Who?\\n\\n There was no one else.\\n\\n Shelby?\\n\\n No. Absolutely not.\\n\\n I consulted my watch. Nine-forty-one and forty-five seconds. My, how time flies when you’re having fun.\\n\\n Work. Fill the hours with work, I told myself. Concentrate on that. I sat at the kitchen table and wrote notes to myself. I filled half a yellow tablet, gripping the pen so hard I bent it. I forced myself to record every detail since I met the Carlsons while they were still relatively fresh. I didn’t really think remembering would be a problem. Forgetting, now that was a different matter.\\n\\n I had made Jamie the star of my sexual fantasies, dancing with her in my prepubescent imagination at the same time she was being raped and butchered. How could I get past that?\\n\\n I took a long hot shower and climbed between my bed sheets. I don’t know why I bothered. Sleep was impossible. I gave it an hour before rolling out of bed, pulling on gym shorts and a T-shirt. I grabbed the plastic ice cream bucket filled with dried corn that I keep on my back porch and went to the pond. I called for the ducks. They came to me even in the darkness. I tossed them the corn and they ate happily although the smallest, Maureen, my favorite, insisted on feeding from my hand. That didn’t bode well for the long flight south, yet I fed her just the same.\\n\\n Think, I urged myself. Think clearly.\\n\\n Jamie was murdered just hours after I located her. There had to be a connection—life is a lot less random than we believe. Was Bradley Young the connection? Did he kill Jamie, and Katherine before her? Bobby would find out in a hurry. He was probably already talking to the Ramsey County ME.\\n\\n Think.\\n\\n Whether he killed her or not, there had to be a connection. Young came to my house because of Jamie. I knew it. Maybe he didn’t kill Jamie, but he tried to kill me because of her.\\n\\n Think.\\n\\n Bobby wouldn’t hesitate for a second to arrest me for obstruction if I even came within shouting distance of his investigation. So, I needed to be careful. But I was going to learn the connection between Young and Jamie. That was my a-gen-da, as Kirsten would put it. That’s what I’m going to do, screw Dunston.\\n\\n And then there was Stacy. Oh God, did she die when Jamie died?\\n\\n Think.\\n\\n Did I have to kill Young? What if I had just stayed in the house and called the cops? What if I had left my gun in the drawer? What if I had been more forceful when I confronted him. What if …?\\n\\n Kirsten was right. There is so much in my world that’s wrong.\\n\\n “Are you okay?”\\n\\n I had been concentrating on the ducks and my own thoughts and didn’t see her approach.\\n\\n “Are you okay?” she repeated.\\n\\n “Margot?”\\n\\n Her white satin robe gleamed in the moonlight, seemed nearly as bright as the moon. She was standing in bare feet on her side of the pond, her arms folded under her ample bosom. Her reflection shimmering in the water reminded me of Galadriel, the ethereal elf in The Lord of the Rings.\\n\\n “As well as can be expected,” I told her.\\n\\n “I heard what happened. I guess everyone in the neighborhood has heard what happened. Are you sure you’re all right?”\\n\\n “Yes.”\\n\\n “I think you should know, Karl Olson is making noises about getting up a petition to force you to move.”\\n\\n “Throw one dead body on the front yard and the whole place gets paranoid.”\\n\\n “It is the suburbs.”\\n\\n “Just barely,” I reminded her.\\n\\n “I saw you from my bedroom window.” She gestured with her head at the large white house behind her. “I thought you might want to talk.”\\n\\n “No. Thank you.”\\n\\n Margot sat on her well-trimmed lawn, hugging her bare legs to her chest. She rested her chin on her knees. She seemed so young, although she was a half decade older than I was.\\n\\n “How are the ducks?”\\n\\n “They’ll be leaving soon, I think.”\\n\\n “I’ll miss them.” \\n\\n","sourceLink":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1/page-30.html","bookId":2225,"book":{"id":2225,"title":"A Hard Ticket Home (Mac McKenzie #1)","description":"Storyline: Ex-St. Paul cop Rushmore McKenzie has more time, and more money, than he knows what to do with. In fact, when he\u0027s willing to admit it to himself (and he usually isn\u0027t), Mac is downright bored. Until he decides to do a favor for a friend facing a family tragedy: Nine-year-old Stacy Carlson has been diagnosed with leukemia, and the only one with the matching bone marrow that can save her is her older sister, Jamie. Trouble is, Jamie ran away from home years ago. \\n Mac begins combing the backstreets of the Twin Cities, tracking down Jamie\u0027s last known associates. He starts with the expected pimps and drug dealers, but the path leads surprisingly to some of the Cities\u0027 most respected businessmen, as well as a few characters far more unsavory than the street hustlers he anticipated. As bullets fly and bodies drop, Mac persists, only to find that what he\u0027s looking for, and why, are not exactly what he\u0027d imagined. \\n David Housewright\u0027s uncanny ability to turn the Twin Cities into an exotic, brooding backdrop for noir fiction, and his winning, witty hero Rushmore McKenzie, serve as a wicked one-two punch in A Hard Ticket Home, a series debut that reinforces Housewright\u0027s well-earned reputation as one of crime fiction\u0027s rising stars.\\n","cover":"https://allnovel.net/images/a-hard-ticket-home-mac-mckenzie-1.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:57:26 PM"}}
