{"id":106582,"no":6,"title":"Page 6","content":"“What did the doctors tell you?”\\n\\n “Leukemia,” Richard Carlson answered from across the living room, answered as if he wished to spare his wife the pain of speaking the word. “They say her body is producing too many white blood corpuscles. They say her spleen and lymph glands are enlarged. They say she needs a bone marrow transplant or she’ll die. Only, neither of us is compatible and finding a donor outside the family, that’s a twenty thousand to one shot. Leastwise, that’s what they say.”\\n\\n Carlson was a big man, big in every direction, 275 at least and not all of it was fat. His eyes were a pale green and what little hair he had was gray. All the other times I had seen him he had worn the faded jeans and T-shirts of a working contractor—a guy who not only designed and sold lake homes, but who also dug foundations and hammered nails. Today he was wearing his Sunday best: black boots, designer jeans, a checkered shirt with imitation pearl snaps, and a belt with a garish buckle declaring his fidelity to Winston Cup racing. He lived in a three-story house that he had built himself in a neighborhood where all the other houses were close to the ground. Somehow he had managed to build it without uprooting the dozen magnificent oak, maple, and birch trees that surrounded it. It was because of the house and trees that I had hired Carlson to build my own lake home.\\n\\n “You want me to find a donor for Stacy?” I asked.\\n\\n “We want you to find our other daughter, Jamie,” Carlson said.\\n\\n “Jamie,” repeated Mrs. Carlson. Her voice was soft, almost a whisper. She was wearing a powder-blue dress printed with yellow flowers. She was eighteen inches shorter and 150 pounds lighter than her husband, but her hair was just as gray. She sat in a chair, her hands folded neatly in her lap, and watched Stacy through a large bay window. She never took her eyes off the girl.\\n\\n “We had—we have another daughter. Jamie. She left us seven years ago. Stacy was only two back then. We had her late. She was—a present. Anyway, Jamie left us and never came back. We tried to find her, even thought about hiring a private investigator. Then we figured, well, that’s the way Jamie wanted it. Only now …”\\n\\n “Jamie might be a compatible donor,” I volunteered. “Jamie might be able to save Stacy’s life.”\\n\\n Molly nodded. “Family members are best. And Jamie has a rare blood type, B-negative, same as Stacy. The doctors say, the first thing you need to be a compatible donor is the same blood type.”\\n\\n A missing person. Missing persons made me nervous. Most missing persons are missing because they want to be and rarely does anything good come of finding them. Still, Stacy Carlson was nine years old and she was dying. Her hair was long and blond and tied in a ponytail. Her eyes were vibrant green, her smile was bright enough to melt snow. I couldn’t possibly imagine the pain and anguish Molly and Richard Carlson must have suffered as they watched their daughter, knowing she was literally dying before their eyes. When I was in the sixth grade I lost my mother to a brain tumor literally overnight. My father died just five months ago, yet his passing too was fairly quick, although we had both seen it coming. This was something else. Losing a child, slowly …\\n\\n “Tell me about Jamie,” I said.\\n\\n “You’ll try to find her?” Molly asked, her face bright with hope.\\n\\n “I can’t promise anything, but yes, ma’am, I’ll try.”\\n\\n Molly squeezed my hands like it was a done deal. “Thank you,” she said.\\n\\n “You understand, right? Richard told you I’m not a private investigator? I don’t have a license. I don’t have legal standing.”\\n\\n “He said you used to be a policeman.”\\n\\n “Yes. For eleven years in St. Paul.”\\n\\n “He said you help people.”\\n\\n “Sometimes. When I can.”\\n\\n “I appreciate this, Mac,” Carlson said. In all my previous dealings with Carlson, he had spoken loudly. I figured he always spoke that way, big men sometimes do. Yet in his own home his voice was small. It was what my mother had called “an indoor voice.”\\n\\n “I can’t tell you how much I appreciate it,” he added. “Only, I’m not asking for charity. I know you usually do these things for free, but I’m a man who likes to pay his own way. Just ask anybody in Grand Rapids. Money’s not a problem.”\\n\\n “Don’t worry about it,” I said. “Money’s not a problem with me, either. I have plenty.”\\n\\n “I pay my own way,” Carlson insisted.\\n\\n “We’ll talk about it later.”\\n\\n “I know you’ve been thinking about extending the deck at your place, maybe screening off part of it.”\\n\\n “We’ll talk about it later.”\\n\\n Carlson nodded.\\n\\n “You spell your name S-O-N, right?” I said.\\n\\n “What?”\\n\\n “Your name. S-O-N or S-E-N?”\\n\\n “S-E-N is Danish. I’m Swedish,” Carlson answered with a certain pride.\\n\\n I made a note of it on a yellow legal pad I stole from my girlfriend’s office. “How do you spell your daughter’s name?”\\n\\n “J-A-M-I-E.” \\n\\n","sourceLink":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1/page-6.html","bookId":2225,"book":{"id":2225,"title":"A Hard Ticket Home (Mac McKenzie #1)","description":"Storyline: Ex-St. Paul cop Rushmore McKenzie has more time, and more money, than he knows what to do with. In fact, when he\u0027s willing to admit it to himself (and he usually isn\u0027t), Mac is downright bored. Until he decides to do a favor for a friend facing a family tragedy: Nine-year-old Stacy Carlson has been diagnosed with leukemia, and the only one with the matching bone marrow that can save her is her older sister, Jamie. Trouble is, Jamie ran away from home years ago. \\n Mac begins combing the backstreets of the Twin Cities, tracking down Jamie\u0027s last known associates. He starts with the expected pimps and drug dealers, but the path leads surprisingly to some of the Cities\u0027 most respected businessmen, as well as a few characters far more unsavory than the street hustlers he anticipated. As bullets fly and bodies drop, Mac persists, only to find that what he\u0027s looking for, and why, are not exactly what he\u0027d imagined. \\n David Housewright\u0027s uncanny ability to turn the Twin Cities into an exotic, brooding backdrop for noir fiction, and his winning, witty hero Rushmore McKenzie, serve as a wicked one-two punch in A Hard Ticket Home, a series debut that reinforces Housewright\u0027s well-earned reputation as one of crime fiction\u0027s rising stars.\\n","cover":"https://allnovel.net/images/a-hard-ticket-home-mac-mckenzie-1.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:57:26 PM"}}
