{"id":106637,"no":61,"title":"Page 61","content":"“Two dead and three wounded,” Thompson shouted. “He’s responsible.” I felt like crying. Only what good would that do? It wasn’t going to bring back Bruder. Or the mother of three who had been standing next to him. It wasn’t going to heal the wounds of the businessman directly behind her, the one who caught it in the gut. Or the bicycle courier. Or the secretary. “What do we know about these Family Boyz?” the lieutenant asked. “They don’t exist!” Thompson shouted. “They’re a figment of McKenzie’s warped imagination.” “My chief wants …” “I don’t work for your chief.” The lieutenant wasn’t impressed by Thompson’s outburst. Calmly, but firmly, he said, “You are a guest of the Minneapolis Police Department. You are in our house now. If you do not behave I will ask you to leave.” “Who do you think you’re talking to, Lieutenant?” Thompson said the word “lieutenant” like it was the medical term for a social disease. The lieutenant rose from his place at the conference table and went to the closed door. He opened it. “Thank you for coming, Deputy Chief Thompson.” Thompson didn’t say a word, nor did he make a move toward the open door. After a tense couple of moments the lieutenant shut the door firmly and returned to his seat. “Tell us again what happened, Mr. McKenzie.” I told my story for the fifth time. “And you’re sure it was the Family Boyz?” “I can’t identify the assailants,” I confessed. “I only saw the black van, but yeah, I’m sure. The machine gun …” “We found shell casings,” Rask interjected. “Seven-point-ninety-two millimeter. Czechoslovakian made.” “They carry a lot of heavy stuff,” I added. “How does this tie into your investigation of Bruder?” This time it was the assistant Hennepin County attorney who asked the question. He was talking to Bobby. “It doesn’t,” Thompson told him. “We believe this—assault—wasn’t meant for Bruder but for McKenzie.” “Do you agree with that, Mr. McKenzie?” “I don’t know.” “You don’t know,” Thompson snorted. “Our chief suspect in two brutal murders is dead and you don’t know.” “I wonder,” Bobby said softly. All eyes turned to him. “Now that we have him, there are tests we can perform to determine whether or not Bruder did, in fact, kill his wife and Katherine Katzmark. What interests me is his reference to they. When McKenzie mentioned the Family Boyz, Bruder didn’t do the one thing everyone else has done.” “Which is what?” Thompson wanted to know. “He didn’t ask, ‘who?’” “We may never know,” Thompson insisted. “Two dead and three wounded.” He said it just that once too often. “Excuse me.” I was up and moving quickly toward the door. “I need to use the rest room.” I squatted before the porcelain toilet, expecting to vomit. But the gesture alone seemed to quiet my stomach. After a few minutes of unproductive hacking, I left the stall. Rask was waiting for me. “You better wash,” he said, gesturing to the dried blood on my hands and the red swipe on my forehead. I did what he suggested. The blood mixing with the liquid soap created a sickly pink color in the sink and again I felt like throwing up. I dried my hands, looked at myself in the mirror. I didn’t like what I saw. The sight of my own drawn and haggard face made me back away until I was hard against the far wall. I slid down the wall until I was sitting at its base, my legs drawn up, and hugging my knees. “God help me.” Rask grinned. “Nothing like catastrophe to separate the true atheists from the whiners.” “Do you believe in God, LT?” “Yes.” “After everything you’ve seen on the job?” “Especially after what I’ve seen.” “I stopped believing.” “No you didn’t. You just found an excuse to stop praying.” “I wasn’t looking for a sermon.” “No, only absolution. Can’t help you there, my friend.” I didn’t suppose he could. After a few more minutes of feeling sorry for myself, I used the wall to climb onto my unsteady legs. “What’s going to happen to me?” “You didn’t do anything illegal, McKenzie. You didn’t do anything wrong.” “Two dead and three wounded,” I said. “And the child still missing.” “It’s not your fault.” “It feels like my fault. I had to be a hero. I had to show everyone how clever I was.” “C’mon,” he said, putting a comforting hand on my shoulder. “Thompson will think you’re making a break for it.”","sourceLink":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1/page-61.html","bookId":2225,"book":{"id":2225,"title":"A Hard Ticket Home (Mac McKenzie #1)","description":"Storyline: Ex-St. Paul cop Rushmore McKenzie has more time, and more money, than he knows what to do with. In fact, when he\u0027s willing to admit it to himself (and he usually isn\u0027t), Mac is downright bored. Until he decides to do a favor for a friend facing a family tragedy: Nine-year-old Stacy Carlson has been diagnosed with leukemia, and the only one with the matching bone marrow that can save her is her older sister, Jamie. Trouble is, Jamie ran away from home years ago. Mac begins combing the backstreets of the Twin Cities, tracking down Jamie\u0027s last known associates. He starts with the expected pimps and drug dealers, but the path leads surprisingly to some of the Cities\u0027 most respected businessmen, as well as a few characters far more unsavory than the street hustlers he anticipated. As bullets fly and bodies drop, Mac persists, only to find that what he\u0027s looking for, and why, are not exactly what he\u0027d imagined. David Housewright\u0027s uncanny ability to turn the Twin Cities into an exotic, brooding backdrop for noir fiction, and his winning, witty hero Rushmore McKenzie, serve as a wicked one-two punch in A Hard Ticket Home, a series debut that reinforces Housewright\u0027s well-earned reputation as one of crime fiction\u0027s rising stars.","cover":"https://allnovel.net/images/a-hard-ticket-home-mac-mckenzie-1.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:57:26 PM"}}
