{"id":106644,"no":68,"title":"Page 68","content":"I recalled immediately what Bobby had told me in Rice Park: The killer was a southpaw.\n “See you around, McKenzie,” Bobby said abruptly. He retreated to the Oldsmobile and climbed inside. He never once looked back at me. That should have told me something. But it didn’t.\n The maniac who slaughtered Jamie and Katherine Katzmark was left-handed. Bruder was right-handed. Ergo, Bruder was innocent. Fine. Glad to hear it. Only why would Justice feel the need to share that information with me? It didn’t make sense and thinking about it caused me enough confusion that I nearly sideswiped a minivan when I took the 10th Street exit into downtown St. Paul. I decided to forget about it and instead concentrate on the task at hand, specifically finding an open parking meter within hiking distance of the Minnesota Department of Motor Vehicles.\n I ran the plates on the black Volvo I had followed the previous evening and was disappointed by the result. The car was owned by Geno Belloti, who apparently left for St. Petersburg on a much later flight than his wife had been told. I wondered if Charlotte knew that Lila had gotten to him, too.\n “I’m sorry, Charlotte,” I said out loud. So much betrayal.\n Next I ran the Audi’s plates. No surprise. The car was owned by Lila’s husband, Warren Casselman.\n Only the very rich name their houses as if they were pets. The Casselman house was called “Birchwood.” It said so on the iron arch that straddled the driveway. I drove under the arch and along the curving concrete driveway to the four-stall garage. The door to the second stall was up, revealing the limousine. The man who drove the limo and gave Lila her late night snack was now driving a lawn tractor around a clump of maple trees. There were maple, ash, and fir trees scattered all over the property, but no birch. Go figure.\n When the driver noticed me he steered the tractor in my direction, coming fast, cutting a swath through the tall grass. He was wearing khaki pants and sneakers, no shirt, taking advantage of the unseasonably warm September day. Twenty yards out he hit the kill switch and the tractor shuddered to a halt. He dismounted and moved closer. He was tall and rough looking—dirty blond hair cut short, sweat glistening on taut muscle. As he closed the distance between us I made the gold earring. Closer still and I could see the terrible scar tissue on his shoulder and stomach. I took a deep breath.\n “I don’t need this,” I told myself as I watched the driver approach. “I really don’t.”\n “You want something, asshole?” he asked.\n “I take it you’re not with Welcome Wagon.”\n “We don’t like peddlers here.”\n “Too bad. If I sell enough magazine subscriptions …”\n He threw a left. I ducked under it. Only he was quick. Before I could step away he set a headlock with his left arm and pulled up. I brought my right hand up under his chin and pushed his head to the left, forcing him to release his grip. I slipped out of the headlock and reversed the move, moving my right hand down and around so that my forearm was under his chin. I drilled an elbow just inside his right shoulder blade, putting him down. It should have been enough. It wasn’t. He came up with a left to my head. I blocked it with my right forearm. He followed with a right to my stomach. My right arm swept counterclockwise across my body for another block. Then I uncurled a vicious back fist into his jaw and followed with a four-knuckle punch to his solar plexus. He backed away and grinned at me, a wicked, yellow-tooth grin. Yeah, this sure beats the hell out of cutting grass.\n “Pussy,” he hissed.\n “Chauffeur,” I hissed back. It wasn’t much of an insult but I felt I had to say something.\n He moved closer than I wanted him to be. I could smell his breath—he needed a mint. Yet it was his eyes that got me. Everything you wanted to know was in those eyes. Eyes from a black-and-white movie, the color sucked out. Eyes that said he didn’t care if he lived or died.\n I reached for my gun.\n “Devanter! Devanter, what the hell!”\n I heard the voice and footsteps before I saw the man. It was Casselman. He grabbed Devanter’s shoulder, the one with the scar. “Are you crazy?”\n Devanter pushed Casselman back. “Don’t touch me!” he snarled.\n Casselman backed away. Suddenly he was a five-year-old losing a battle with an ice cream cone on a hot summer day. Yet at the same time he was used to giving orders and having them obeyed.\n “Don’t talk to me that way,” he said evenly. “You will treat my guests with respect.”\n Devanter smirked. I didn’t think Casselman sounded convincing, either.\n “Don’t you have work to do?” Casselman asked.\n Devanter grunted and then deposited a gob of spit next to my shoe before shooting me a mocking “next-time” glance. Not if I can help it, pal. As he restarted the lawn tractor Casselman took my arm and shouted above the noise, “Are you all right?” \n","sourceLink":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1/page-68.html","bookId":2225,"book":{"id":2225,"title":"A Hard Ticket Home (Mac McKenzie #1)","description":"Storyline: \n Ex-St. Paul cop Rushmore McKenzie has more time, and more money, than he knows what to do with. In fact, when he\u0027s willing to admit it to himself (and he usually isn\u0027t), Mac is downright bored. Until he decides to do a favor for a friend facing a family tragedy: Nine-year-old Stacy Carlson has been diagnosed with leukemia, and the only one with the matching bone marrow that can save her is her older sister, Jamie. Trouble is, Jamie ran away from home years ago. \n Mac begins combing the backstreets of the Twin Cities, tracking down Jamie\u0027s last known associates. He starts with the expected pimps and drug dealers, but the path leads surprisingly to some of the Cities\u0027 most respected businessmen, as well as a few characters far more unsavory than the street hustlers he anticipated. As bullets fly and bodies drop, Mac persists, only to find that what he\u0027s looking for, and why, are not exactly what he\u0027d imagined. \n David Housewright\u0027s uncanny ability to turn the Twin Cities into an exotic, brooding backdrop for noir fiction, and his winning, witty hero Rushmore McKenzie, serve as a wicked one-two punch in A Hard Ticket Home, a series debut that reinforces Housewright\u0027s well-earned reputation as one of crime fiction\u0027s rising stars.\n \n","cover":"https://allnovel.net/images/a-hard-ticket-home-mac-mckenzie-1.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:57:26 PM"}}
