{"id":106583,"no":7,"title":"Page 7","content":"“Middle name?” “Anne,” he said, then added, “with an E.” I wrote it down. “Jamie Anne Carlson. Pretty name.” “Thank you.” Molly smiled slightly and looked down at her hands, still folded in her lap. Carlson sat in an old, stuffed chair that had carried too much weight for too long and stared at a spot on the wall that no one else could see, leaving his wife to answer my questions. “It was the year Jamie graduated from high school,” Molly said. “Right after the Fourth—the weekend after the Fourth—she just took the clothes that would fit into one suitcase and left. We thought she would come back when her money ran out. She didn’t. When she didn’t come back by September, we went to the police. They said they couldn’t help us. They said since she wasn’t a minor and since there wasn’t any indication of foul play—that’s the phrase they used, foul play—well, they said they couldn’t do anything.” “We thought of looking for her ourselves,” Carlson said. “Hiring a private detective. But I guess we didn’t see any point in it. Besides, we always thought she’d call. We always thought she’d come home.” “Why did she leave?” I asked. “Was she unhappy?” “She didn’t seem unhappy,” Molly said. “Did you have a fight, a serious disagreement of some kind?” “No. I don’t remember a fight. Truth is—truth is, Mr. McKenzie, we don’t know why she left. One day she was living here perfectly fine, talking about going to the community college in the fall. Next day she was gone.” “Boyfriend?” “No!” Molly was adamant. It was the first time she had raised her voice. “My Jamie wasn’t like that.” “Something made her leave,” I reminded her. “I guess she just wanted to see some of the world.” “The world.” Carlson spat the word like it was an obscenity. Molly stared at him for a moment before continuing. “She didn’t like it here. She said there was nothing for someone her age to do.” Carlson shook his head in disbelief. “Plenty to do,” he insisted. “It’s not like Grand Rapids is some hick town.” “Yes, it is,” said Molly. “We like it, but … Mr. McKenzie, Jamie was young and she was pretty, she was smart and she was bored. She wanted to leave here and she knew we disapproved, knew we would try to talk her out of it … .” “Maybe so, but she didn’t have to just up and go like that. Without saying good-bye. Without even leaving a note. That ain’t right.” And she hasn’t tried to contact you again, not once in seven years, I thought but didn’t say. “No, it isn’t right,” I agreed. “Where do you think Jamie went?” I asked. “The Cities,” Molly said. “Where else?” In Minnesota? There was no place else, I agreed silently. “Do you know Jamie’s social security number? It’ll help me find her.” “I don’t know,” Molly said. “I know she had one—the government gave her one when she was born. It’s probably around here somewhere.” I took a white card from my wallet. I had five hundred printed about a year ago with just my name and phone number. I think I had given out twenty so far. “If you can find her social security number, call me.” “R. McKenzie,” Molly read slowly. “What does the R stand for?” Usually when people ask that question, I simply answer, “My first name.” For some reason I told Molly the truth. “Rushmore.” “Rushmore? I never heard that before.” “My parents took a vacation to the Badlands of South Dakota. They told me I was conceived in a motor lodge near Mount Rushmore, so that’s what they named me. I’m sure they thought it was a good idea at the time. Anyway, it could have been worse. I could have been Deadwood.” Both Carlson and Molly thought that was pretty funny. ’Course, they had never had to raise their hands when teachers called “Rushmore” on the first day of school. “Driver’s license?” I asked. “Jamie had one. I don’t know the number or anything.” I made note of that on the legal pad, too. The Department of Motor Vehicles would be one of my first stops. “You said she was talking about going to a two-year college. What major?” “She wanted to be a paralegal and work in a law office.” I made a note of that, then said, “I could use a photograph of her.” “I’ll get it.” Molly rose from the chair and went into an adjacent dining room. Carlson watched her leave, then said, “You might wanna try talking to Merci Cole,” his voice dropping several decibels. “Who?” If I had trouble hearing Carlson, his wife did not. A moment later, she was standing under the arch that separated the living room from the dining room. “Merci Cole? Why do you say that?” “Who’s Merci Cole?” I asked, writing her name on the yellow pad.","sourceLink":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1/page-7.html","bookId":2225,"book":{"id":2225,"title":"A Hard Ticket Home (Mac McKenzie #1)","description":"Storyline: Ex-St. Paul cop Rushmore McKenzie has more time, and more money, than he knows what to do with. In fact, when he\u0027s willing to admit it to himself (and he usually isn\u0027t), Mac is downright bored. Until he decides to do a favor for a friend facing a family tragedy: Nine-year-old Stacy Carlson has been diagnosed with leukemia, and the only one with the matching bone marrow that can save her is her older sister, Jamie. Trouble is, Jamie ran away from home years ago. Mac begins combing the backstreets of the Twin Cities, tracking down Jamie\u0027s last known associates. He starts with the expected pimps and drug dealers, but the path leads surprisingly to some of the Cities\u0027 most respected businessmen, as well as a few characters far more unsavory than the street hustlers he anticipated. As bullets fly and bodies drop, Mac persists, only to find that what he\u0027s looking for, and why, are not exactly what he\u0027d imagined. David Housewright\u0027s uncanny ability to turn the Twin Cities into an exotic, brooding backdrop for noir fiction, and his winning, witty hero Rushmore McKenzie, serve as a wicked one-two punch in A Hard Ticket Home, a series debut that reinforces Housewright\u0027s well-earned reputation as one of crime fiction\u0027s rising stars.","cover":"https://allnovel.net/images/a-hard-ticket-home-mac-mckenzie-1.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:57:26 PM"}}
