{"id":106666,"no":91,"title":"Page 91","content":"“Speaking of gifts, Shelby is waiting for me.”\\n\\n “Thanks, Bobby.”\\n\\n Before he left, Bobby found the remote control and aimed it at the TV set suspended on the wall at the foot of the bed. He surfed past several channels until he found WGN—the Cubs were playing Houston. Sammy Sosa was up with two on base.\\n\\n “Are you going to be all right, alone like this?”\\n\\n “What do you mean alone? I’m in a hospital.”\\n\\n “I have a few minutes. Let’s watch the game.”\\n\\n “Get out of here. Shelby’s waiting.”\\n\\n “McKenzie?”\\n\\n “Dunston?”\\n\\n “Screw it. I’ll see you in a couple of days.”\\n\\n “Love to the family.”\\n\\n “Back at ya.”\\n\\n After he left I turned up the volume.\\n\\n “Whaddaya say, Sammy,” I said to the TV screen. “Just me and you, man. Just me and you.” \\n\\n","sourceLink":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1/page-91.html","bookId":2225,"book":{"id":2225,"title":"A Hard Ticket Home (Mac McKenzie #1)","description":"Storyline: Ex-St. Paul cop Rushmore McKenzie has more time, and more money, than he knows what to do with. In fact, when he\u0027s willing to admit it to himself (and he usually isn\u0027t), Mac is downright bored. Until he decides to do a favor for a friend facing a family tragedy: Nine-year-old Stacy Carlson has been diagnosed with leukemia, and the only one with the matching bone marrow that can save her is her older sister, Jamie. Trouble is, Jamie ran away from home years ago. \\n Mac begins combing the backstreets of the Twin Cities, tracking down Jamie\u0027s last known associates. He starts with the expected pimps and drug dealers, but the path leads surprisingly to some of the Cities\u0027 most respected businessmen, as well as a few characters far more unsavory than the street hustlers he anticipated. As bullets fly and bodies drop, Mac persists, only to find that what he\u0027s looking for, and why, are not exactly what he\u0027d imagined. \\n David Housewright\u0027s uncanny ability to turn the Twin Cities into an exotic, brooding backdrop for noir fiction, and his winning, witty hero Rushmore McKenzie, serve as a wicked one-two punch in A Hard Ticket Home, a series debut that reinforces Housewright\u0027s well-earned reputation as one of crime fiction\u0027s rising stars.\\n","cover":"https://allnovel.net/images/a-hard-ticket-home-mac-mckenzie-1.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/a-hard-ticket-home-mac-mckenzie-1.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:57:26 PM"}}
