{"id":99535,"no":18,"title":"Page 18","content":"She was suddenly glad Big Bolliger was with Kaz. That Kaz had chosen Jesper to be one of his seconds was no surprise. Twitchy as Jesper was, with or without his revolvers, he was at his best in a fight, and she knew he’d do anything for Kaz. She’d been less sure when Kaz had insisted on Big Bolliger as well. Big Bol was a bouncer at the Crow Club, perfectly suited to tossing out drunks and wasters, but too heavy on his feet to be much use when it came to a real tussle. Still, at least he was tall enough to look Elzinger in the eye.\n Inej didn’t want to think too much on Geels’ other second. Oomen made her nervous. He wasn’t as physically intimidating as Elzinger. In fact, Oomen was made like a scarecrow—not scrawny, but as if beneath his clothes, his body had been put together at wrong angles. Word was he’d once crushed a man’s skull with his bare hands, wiped his palms clean on his shirtfront, and kept right on drinking.\n Inej tried to quiet the unease roiling through her, and listened as Geels and Kaz made small talk in the square while their seconds patted each of them down to make sure no one was carrying.\n “Naughty,” Jesper said as he removed a tiny knife from Elzinger’s sleeve and tossed it across the square.\n “Clear,” declared Big Bolliger as he finished patting down Geels and moved on to Oomen.\n Kaz and Geels discussed the weather, the suspicion that the Kooperom was serving watered-down drinks now that the rent had been raised—dancing around the real reason they’d come here tonight. In theory, they would chat, make their apologies, agree to respect the boundaries of Fifth Harbor, then all head out to find a drink together—at least that’s what Per Haskell had insisted.\n But what does Per Haskell know? Inej thought as she looked for the guards patrolling the roof above, trying to pick out their shapes in the dark. Haskell ran the Dregs, but these days, he preferred to sit in the warmth of his room, drinking lukewarm lager, building model ships, and telling long stories of his exploits to anyone who would listen. He seemed to think territory wars could be settled as they once had been: with a short scuffle and a friendly handshake. But every one of Inej’s senses told her that was not how this was going to play out. Her father would have said the shadows were about their own business tonight. Something bad was going to happen here.\n Kaz stood with both gloved hands resting on the carved crow’s head of his cane. He looked totally at ease, his narrow face obscured by the brim of his hat. Most gang members in the Barrel loved flash: gaudy waistcoats, watch fobs studded with false gems, trousers in every print and pattern imaginable. Kaz was the exception—the picture of restraint, his dark vests and trousers simply cut and tailored along severe lines. At first, she’d thought it was a matter of taste, but she’d come to understand that it was a joke he played on the upstanding merchers. He enjoyed looking like one of them.\n “I’m a business man,” he’d told her. “No more, no less.”\n “You’re a thief, Kaz.”\n “Isn’t that what I just said?”\n Now he looked like some kind of priest come to preach to a group of circus performers. A young priest, she thought with another pang of unease. Kaz had called Geels old and washed up, but he certainly didn’t seem that way tonight. The Black Tips’ lieutenant might have wrinkles creasing the corners of his eyes and burgeoning jowls beneath his sideburns, but he looked confident, experienced. Next to him Kaz looked … well, seventeen.\n “Let’s be fair, ja? All we want is a bit more scrub,” Geels said, tapping the mirrored buttons of his lime-green waistcoat. “It’s not fair for you to cull every spend-happy tourist stepping off a pleasure boat at Fifth Harbor.”\n “Fifth Harbor is ours, Geels,” Kaz replied. “The Dregs get first crack at the pigeons who come looking for a little fun.”\n Geels shook his head. “You’re a young one, Brekker,” he said with an indulgent laugh. “Maybe you don’t understand how these things work. The harbors belong to the city, and we have as much right to them as anyone. We’ve all got a living to make.”\n Technically, that was true. But Fifth Harbor had been useless and all but abandoned by the city when Kaz had taken it over. He’d had it dredged, and then built out the docks and the quay, and he’d had to mortgage the Crow Club to do it. Per Haskell had railed at him and called him a fool for the expense, but eventually he’d relented. According to Kaz, the old man’s exact words had been, “Take all that rope and hang yourself.” But the endeavor had paid for itself in less than a year. Now Fifth Harbor offered berths to mercher ships, as well as boats from all over the world carrying tourists and soldiers eager to see the sights and sample the pleasures of Ketterdam. The Dregs got first try at all of them, steering them—and their wallets—into brothels, taverns, and gambling dens owned by the gang. Fifth Harbor had made the old man very rich, and cemented the Dregs as real players in the Barrel in a way that not even the success of the Crow Club had. But with profit came unwanted attention. Geels and the Black Tips had been making trouble for the Dregs all year, encroaching on Fifth Harbor, picking off pigeons that weren’t rightfully theirs. \n","sourceLink":"https://allnovel.net/the-demon-in-the-wood-the-grisha-0-1/page-18.html","bookId":2010,"book":{"id":2010,"title":"The Demon in the Wood (The Grisha #0.1)","description":"Storyline: \n Limited collector’s edition of the final book features an exclusive Darkling prequel story! \n Before he became the Darkling, he was just a lonely boy of extraordinary power. Get a look into the past that forged a brutal and brilliant leader.\n \n","cover":"https://allnovel.net/images/the-demon-in-the-wood-the-grisha-0-1.jpg","author":"Leigh Bardugo","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-demon-in-the-wood-the-grisha-0-1.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:43:57 PM"}}
