{"id":76548,"no":17,"title":"Page 17","content":"Garrett popped his wheelchair open, shoved the Velcro cushion in, then eased himself onto it. He\u0027d taken off his tie. The untucked flaps of his dress shirt hung from the edge of the seat like elf shoes.\n Ruby produced two Shiner longnecks from an ice chest and passed them to us. The light from the empty kitchen silhouetted her hair like redhot filaments.\n \"Hell of a step up from a houseboat.\" She leaned against the railing, rested her fingertips lightly on Garrett\u0027s shoulder. \"Next winter I\u0027ll be able to shoot deer from here.\n I swear to God, they walk right up my driveway.\"\n \"Sportsmanlike,\" Garrett mumbled.\n She drank from her Sprite can. \"It\u0027s either shoot them or wait for them to run in front of my Miata, dear heart. The gun is more humane.\"\n We watched a meteor streak across the western sky, fade and die.\n Crickets and owls were sounding off. The air smelled of pinon smoke from the dried cedar deadfall collected and burned daily in the Hill Country.\n Down below, I watched the small form of Clyde Simms emerge from the drystack warehouse, stand in a pool of light by the fork lift. He was smoking a cigarette, maybe looking up at the moon. Maybe watching us.\n \"We can\u0027t sell Techsan,\" Garrett told Ruby. \"You know that.\"\n She smiled frailly. \"I know we don\u0027t have much choice.\"\n \"We can hold out. We prove the bastard sabotaged us.\"\n Ruby looked much sadder now than she had at her exhusband\u0027s funeral.\n She ran a finger along Garrett\u0027s beard. Garrett stayed stone still, as if her touch was an ice pick.\n \"There was a time, Tres,\" Ruby said, \"when your brother and I actually got along.\n Before Jimmy— Well, Jimmy was a sweet man. He had a talent for GUI, graphic interfaces. But Garrett is the genius. If he\u0027d applied himself to the job ten, fifteen years ago, he could\u0027ve written industry standards. I\u0027ve never seen anybody better.\"\n Garrett didn\u0027t look happy with the compliment. He took Ruby\u0027s finger, pushed it gently away.\n \"What\u0027s your specialty, Ruby?\" I asked. \"Public relations?\"\n \"I\u0027m the QA person.\"\n I looked at Garrett.\n \"Quality assurance,\" he translated. \"She breaks things. We write a program, Ruby figures out how to screw it up. That way we find the glitches and fix them before the product goes to market. And yeah, she\u0027s pretty fucking awesome at breaking things.\"\n Ruby nodded her thanks.\n \"We were a good team,\" Garrett said. \"We could prove Pena sabotaged us, pull things out of the hole. We could still do it.\"\n Ruby moved away from the railing. \"With you under investigation for murder? It\u0027s only a matter of time before they charge you.\"\n A meteor streaked past the tail of Canis Major. Garrett kept his eyes on the sky long after the trail was gone. \"You think I killed Jimmy. Don\u0027t you?\"\n \"Of course not,\" Ruby said.\n He looked at me. \"You both think I killed him.\"\n I wanted to speak up for him, say something optimistic, but the truth was, I didn\u0027t understand why Lopez hadn\u0027t already filed charges. Garrett looked guilty as hell. Most likely, with Maia\u0027s appearance, her reputation as a defence attorney, Lopez had simply decided to take his time building an airtight case.\n \"I\u0027m sorry, Garrett,\" Ruby said. \"With Jimmy\u0027s murder. With the betatesters suing us.\n With investors treating us like the Black Plague. I don\u0027t see it, Garrett. I don\u0027t see how we can stay in business.\"\n \"Pena screwed us,\" he said, \"and you still want to deal with him.\"\n \"If we\u0027d taken his first offer, dear heart—\"\n \"He killed Jimmy. Do you care about that?\"\n Her expression turned brittle. \"I can\u0027t believe Matthew would go that far.\"\n Again, the first name. The way she spoke it, I couldn\u0027t help thinking of Mrs. Hayes, sitting obliviously on her couch, extolling young Matthew\u0027s virtues.\n \"He stands for everything Jimmy and I hate,\" Garrett told Ruby. \"He\u0027s a vulture capitalist. He feeds off other people\u0027s talent.\"\n Ruby pursed her lips. \"Unfortunately, dear heart, he\u0027s also our only hope—he\u0027s doing us a favour. Either sell Techsan or go under.\"\n Down at the lake, a small motorboat came toward the marina, its forward light cutting an arc across the water. The prow was shiny\n white, pinstriped blue. From here it looked like a bathtub toy. The night air carried up the sounds of its outboard motor, laughter, a radio playing the Dixie Chicks.\n Clyde Simms flicked his cigarette into the dark, went to meet the newcomers.\n From a nearby deck chair, Ruby picked up a sheaf of paperwork, tossed it into Garrett\u0027s lap.\n \"I won\u0027t sign it,\" he said.\n The motorboat veered to port. The engine cut out and the boat glided silently toward home. Passengers kept laughing. Music kept playing.\n \"You have to sign it,\" I told him. \"You have no choice.\"\n Garrett glared at me. \"Your idea of help, little bro?\"\n \"I don\u0027t like it. But she\u0027s right. Pena has backed you into a corner. You don\u0027t have time to find the problem in the software. Especially if you insist that the program isn\u0027t at fault, if you don\u0027t let anyone help you look.\"\n \"The code is solid. I can do one thing well—I can program. I will not let Pena steal that from me.\"\n Clyde Simms was at the dock now, one foot on the prow of the boat, tying up the line.\n I wondered what the boaters thought of him as they strolled off deck for a last drink of the evening—if they even paid attention to the big Viking with the bloodied nose.\n \"You need to cut your losses,\" I told my brother. \"You\u0027re in a bad place with the police.\n You put yourself into debt. You have to take responsibility.\"\n \"Responsibility. My little brother\u0027s lecturing me on responsibility. Despite your awesome credentials in that department, man, I am not selling.\"\n Ruby sat down on the edge of her hot tub, laced her arms around her knees. \"Here\u0027s the thing, dear heart. You don\u0027t really have a choice.\"\n Garrett pivoted his chair toward her. \"And why would that be?\"\n \"Because, as per our incorporation agreement, I\u0027m buying out Jimmy\u0027s share in the company. Unless, of course, you are in a position to make a counteroffer. In the event one of us died, that\u0027s how it was supposed to work, remember?\"\n Garrett was silent long enough to replay her words several times. \"You\u0027re buying control.\"\n \"I\u0027m sorry, Garrett. I\u0027ve already called my lawyer.\"\n \"You coldblooded—with Jimmy not even in the ground two hours?\"\n \"By tomorrow, I expect to control two thirds of Techsan. You can sign the sellout agreement or not, dear, but I\u0027m afraid you\u0027re outvoted. We are selling Techsan to Matthew Pena\u0027s client, AccuShield.\"\n Garrett made a fist around his beer bottle, then drained it.\n He chunked the empty Shiner off the deck. It spun in the light, a brown pinwheel, landing somewhere below with a metallic CLANKCLANK.\n \"That better not have been my convertible,\" Ruby told him.\n \"I should be so lucky.\"\n Garrett produced a pen from his wheelchair pouch, clicked it, signed the papers.\n I looked down at my untouched beer. Condensation had soaked a cold ring through my jeans.\n When Garrett finished the signatures, he tossed the papers at Ruby\u0027s feet.\n \"Another divorce, Ruby. That\u0027s what this is. Pay me off. Then leave me the fuck alone.\"\n The night air between them was radioactive—glowing with grief and rage and recrimination so intimate I felt like a voyeur. I tried to convince myself two people could make each other so miserable merely through a business deal.\n Ruby turned toward me, managed a crooked smile. \"Well, Tres. Your ranch is saved.\"\n Garrett\u0027s face was murderously calm. \"You said the plumbing\u0027s working?\"\n \"Yes, dear heart. It is.\"\n \"Little bro, I\u0027ll be inside. You want to leave, come get me. Something about being in Ruby\u0027s place too long—I start feeling sick.\"\n He wheeled himself toward the sliding glass door, spun inside.\n The night got intensely quiet.\n Ruby rubbed her face. She still had that naturally quizzical look, but the impishness had been replaced with sour dissatisfaction.\n \"Your brother is impossible,\" she said.\n I imagined her looking like this as an older woman—in her sixties, handsome and stern, the red hair turned to steel, cut short, that\n eyebrow still raised in disapproval, her aged eyes like a falcon\u0027s, critically watching other people\u0027s grandchildren, thanking her stars that she didn\u0027t have any.\n She fished something out of her pocket—a medication bottle. She popped out three pink pills and swallowed them dry.\n I watched the pill bottle disappear back into Ruby\u0027s pocket.\n She crossed her legs at the ankles, looked up at the stars. \"Tonight at Scholz Garten, you almost killed Clyde.\"\n \"I wouldn\u0027t have killed him.\"\n \"The way you say that—like you could have killed him if you wanted to. Tres, why did you get involved?\"\n \"I don\u0027t like uneven fights. Too many Underdog cartoons as a kid.\"\n She laughed.\n \"What were you popping?\"\n She looked confused, then remembered the bottle. \"Popping. God, that sounds so dirty. Just my attitude medicine, Tres. I\u0027m a real nasty redheaded bitch without it, I\u0027m afraid. I know that must be hard for you to imagine.\"\n \"Jimmy\u0027s autopsy report,\" I said. \"He\u0027d been taking tricyclic antidepressants.\"\n She pushed her legs straight on the deck, pointed her toes toward me. \"Jimmy and I were quite a compatible match. Both fuckedup rich kids. You want to know why I couldn\u0027t live with him? We were too much alike.\"\n \"You got along with Matthew Pena.\"\n She stared at the sellout papers, still untouched at her feet. \"Give Pena credit, Tres.\n He understands people. He understood how we\u0027d overextended ourselves—how desperate Garrett must have been to mortgage that family ranch, for instance. He can sense immediately what\u0027s important to someone. He\u0027s the first person I ever met who really understood why I dive.\"\n \"And why is that?\"\n She came back to the railing, looked toward the water. \"You have your ranch. Jimmy had that lakeside property—that damn shrine to his mother. I have this.\"\n \"The marina.\"\n \"Not just the marina, Tres. My family, the McBrides—we used to be big landowners out here on the Colorado River. This was in my grandfather\u0027s time, the 1930s, before that.\n When the state built Mansfield Dam, they bought out the farms, the orchards—every damn thing. Eminent domain. What you see here, this little point of land, is the one percent that wasn\u0027t flooded. That\u0027s my inheritance out there—under the lake. That\u0027s what I showed Pena, the day he wanted to take me diving. I said, \u0027Come see the property line.\u0027 Our orchards are still down there. Trees my greatgrandfather planted.\n Pieces of the original barbed wire fence. Eventually, I intend to map the whole estate.\"\n She stared out at the water as if peeling back the flood, trying to see the land that had been there seventy years ago.\n \"And Pena understood that,\" I said.\n \"He understood why I needed money to build this house, why I\u0027d never had the courage to build before. It\u0027s hard to put down roots on land when you\u0027ve spent your life hearing about a flood.\" \n","sourceLink":"https://allnovel.net/the-devil-went-down-to-austin-tres-navarre-4/page-17.html","bookId":2419,"book":{"id":2419,"title":"The Devil Went Down to Austin (Tres Navarre #4)","description":"Storyline: \n The Devil Went Down to Austin (Tres Navarre #4) \n Rick Riordan, triple-crown winner of the Edgar, Anthony, and Shamus Awards, brings his fast-talking, hard-living, Texas-hip P.I. Tres Navarre to the heart of the Lone Star State—Austin—to unravel a case so dark, twisted, and deadly, it can only involve family.... \n Tres Navarre, the P.I. with a Ph.D. in literature, heads to Austin for a laid-back summer teaching gig. But he’s in store for a whole lot more. His big brother Garrett--computer whiz, Jimmy Buffett fanatic, and all-around eccentric—is hoping to retire a multimillionaire by the fall. He’s bet his career and the Navarre family ranch to do it. \n Then Garrett’s oldest friend and business partner is murdered—and Garrett is the only suspect. As Tres delves into Garrett’s bizarre world to find the truth behind the murder, he comes face to face with the damaged relationships, violent lives, and billion-dollar schemes of a high-tech world gone haywire. Connecting them all is beautiful Lake Travis and the shocking secret that lies within its depths. Now, as Tres struggles with his own troubled family past and to clear his brother’ s name, he finds himself stalked by a cold-blooded killer—one who could spell the death of both Navarres.\n \n","cover":"https://allnovel.net/images/the-devil-went-down-to-austin-tres-navarre-4.jpg","author":"Rick Riordan","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-devil-went-down-to-austin-tres-navarre-4.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 10:38:40 AM"}}
