{"id":100851,"no":27,"title":"Page 27","content":"Dwight\u0027s assurances about Ruby left me ten times more unsettled than I\u0027d already been, but I didn\u0027t tell him that. \"Last question,\" I said. \"Did you tell Pena about Jimmy\u0027s call?\" Dwight nodded slowly. \"I told him that if Jimmy was right about the sabotage, I would go to the SEC. Matthew just laughed, told me I was crazy and I should stick to what I do best—finding him fresh blood.\" \"And a week later, Jimmy was murdered.\" Dwight\u0027s eyes were small brown points of pain. \"Why do you think I\u0027m talking to you?\" In daylight, Ruby\u0027s property looked much less romantic—a series of eroded limestone shelves, dotted with twisted live oaks, sloping down toward the shore. I\u0027d noticed the illuminated sign at the gates the night before— POINT LONE STAR, docking services, day trips, eats. Back from the road was a much older sign—deep block letters burned into a weathered square of wood. It was barely readable now, but the underbrush and tree branches had been carefully trimmed away from it. MCBRIDE FARMS—pecans, peaches, in season. The giant padded forklift was bringing a yacht out of the warehouse. On the deck of the floating restaurant, couples were having lunch. Up the hill, construction workers were taking a soda break in the driveway of Ruby\u0027s tower. I parked my truck in the marina lot, watched the boat jockeys, and pondered my next move. I grabbed my backpack, got out of the truck, and took a stroll toward the pier. It was easy enough to get past the boat jockeys. The security gate was open. When I asked one of the dockworkers where Ruby was, he told me she\u0027d gone into town on business. I tried to look disappointed. \"Tell her Mr. White would like to see her on his yacht when she returns,\" I said. \"Tell her it\u0027s about the purchase of the new sixty footer.\" The dockworker let me pass. I walked down the pier, scanning names of boats without slowing down. Fortunately, Ruby\u0027s was conveniently named the Ruby, Too—a white Sea Ray with bright red trim, docked in wet slip 12B. I climbed aboard, dropped into a squat next to the main cabin door, out of sight unless another boat happened to come up from the stern. I put on surgical gloves and opened my backpack, spread out my leather roll of lockpicking implements. I chose the one for deadbolts—a thin metal rod curved like a W at the end. In a few minutes, the lock clicked? the door slid open with a sigh. At the bottom of the stairs was a large living room/workroom with a kitchenette in the back. One wall was devoted to computer equipment—two highend Dell workstations, a portable power generator, a wireless modem setup, a colour printer, and several backup tape units. The trash can was full of Pecan Street Ale bottles. An incense holder on top of one monitor was loaded with a halfburned stick of copal. Sticking out of a CD tray was Buffett\u0027s latest live recording. All the signs that Garrett and Jimmy Doebler had once worked here. This was the room where Techsan had been born. I spent too much time booting up the computers, only to find I couldn\u0027t get past the first password. I went down a narrow hall into the sleeping cabin. Open boxes were filled with winter clothes—sweaters, longsleeve shirts, things Ruby wouldn\u0027t need for months. The bed was made, though there was an impression like a snow angel in the centre, as if Ruby had lain there looking at the ceiling. On the dresser were photographs. One showed a young Ruby in graduation robes, standing next to an older, rustyhaired man in a tuxedo—her father, I assumed. Ruby was smiling brilliantly, as if to make up for her father, who stared out at me with a slightly dazed expression. The next photo showed Ruby midair during a parachute jump. Another photo was Ruby in scuba gear, underwater, waving as she floated over a bank of coral. The final photo showed Ruby and Jimmy together, standing on a beach. I compared the photos, didn\u0027t like what I saw. In each, Ruby had the expression of a thrillseeker. Her excitement seemed forced, her eyes too wild, as if her desire to have fun was almost desperate—as if she\u0027d never yet caught fire with anything, and was beginning to fear that she couldn\u0027t. What I liked least was my own imagined addition to her photo collection—Ruby standing next to Matthew Pena, signing away her company. Garrett\u0027s company. I checked the nightstand drawer. It was locked. I picked it open. I found a .38 calibre automatic and a halffinished pint of Jack Daniel\u0027s. I sat on the bed, deliberating whether to call Lopez about the gun. By breaking in, I\u0027d rendered all potential evidence useless, of course. If it became known that I broke in. I wondered if Travis County would serve a search warrant based on an anonymous tip. I doubted it. I turned my attention to the moving boxes, found that a few of them contained archived paperwork—more than I could possibly read. There were orders for boat repairs, personnel files on boat jockeys, maintenance records for numerous yachts. Letters from an accountant documented financial troubles the marina had been suffering from in the early 1990s. From a box marked 1990 AND PRIOR, I pulled a stack of yellowing brochures that announced the opening of the marina in 1975. POINT LONE STAR, Rouell McBride, Proprietor. Behind these was a whole folder full of photographs that Ruby\u0027s father had apparently considered using for promotional materials. Many of them were ancient black and white shots showing the family orchards before they\u0027d been flooded. In one, a large family sat under a pecan tree, rows of other pecans stretching out behind them, a split rail fence running along one side. Afternoon sunlight filtered through the branches. The darksuited patriarch sat on a folding chair, his wife beside him in a white Edwardian dress. Children of various ages fanned out on either side, sitting crosslegged on quilts—the boys in coat and tie, the girls with bobbed hair and 1920s dresses. It was obvious they were all McBrides. I could imagine the photo in colour—so many green eyes, so much red hair. A note paperclipped to the back of the photo was written in what I assumed was Ruby\u0027s father\u0027s handwriting: The McBride name has been an institution—Here a few words were scratched out—The McBrides have been landowners on Lake Travis—more scratch outs—No one knows the lake better than the McBrides. Trust us for all your boating needs. I looked at the brochure. Mr. McBride hadn\u0027t used the old photo. He\u0027d opted instead for glossy colour aerials of the marina. A little more digging in the clothes boxes got me something I had not been anxious to find—a letter from Matthew Pena, folded into the pocket of Ruby\u0027s winter coat. It read: Next weekend, then. I\u0027ll see about the Farallons. Fondly, Matthew. Hardly damning evidence of anything illegal, but it meant that sometime during the winter, very possibly before Matthew approached Techsan, he\u0027d been corresponding with Ruby McBride. And while Ruby was still married to Jimmy, she\u0027d been talking to Pena about a weekend trip to San Francisco—a boat ride out to the Farallon Islands. I crumpled up the letter, made it into as small a ball as I could. I had an irrational impulse to overturn Ruby\u0027s nightstand, dump her boxes on the carpet. The only thing that sobered me was thinking what Garrett would do if he\u0027d found the letter instead of me. If he blamed Ruby for abandoning him, then watched her marry Jimmy Doebler, and then, on top of it all, suspected Ruby was spending time with Matthew Pena . . . betraying both of them. I thought about the night Jimmy had died—Garrett getting so angry upon hearing Ruby\u0027s name that he\u0027d shot off the kiln goddess\u0027 arm. While I was thinking about this, I found myself staring at a poster on Ruby\u0027s bedroom wall. It was a huge topographical map of the lake with longitude and latitude coordinates. Depths were noted. Boating hazards. I got up to take a closer look. There was a green pushpin marking Point Lone Star, and out in the water, five red pins, making a curve from the shore to a point close to the boating channel. The pins were equidistant—about one hundred yards apart. Her flooded family land, I guessed. I remembered what she\u0027d said about mapping the old property lines, and about taking Matthew Pena down there. And then a voice behind me said, \"There is no Mr. White at this marina.\" Clyde Simms stood in the doorway. His nose had a butterfly pattern of bruises around it from our encounter at Scholz Garten. There was a tire iron in his hand. \"Thank God,\" I said. \"I must\u0027ve taken a wrong turn. I was on my way to Jimmy\u0027s—\" \"If I liked police,\" Simms snarled, \"they\u0027d be hauling your ass away right now.\" \"And since you don\u0027t?\" He lifted the tire iron, patted it against his palm. \"You\u0027re walking with me over to my place. Nice and friendly, no scaring the customers. No joint locks. And then we\u0027ll see.\" CHAPTER 23 Clyde\u0027s homestead was set back in the woods about fifty yards from the marina, just enough to be out of sight of the paying customers. Along the gravel path, we passed two Chevrolet carcasses, three cow skulls nailed to mesquite trees, and a bikinied store manikin who\u0027d been given a lobotomy and an appendectomy by shotgun. The joys of simple country living. The house itself was an overgrown portable shed with a plywood porch and a corrugated tin roof heaped with fuzzy brown cedar fur. Parked out front was a HarleyDavidson hog. On the front porch post, a sign read FEROCIOUS DOGS —NO UNANNOUNCED VISITORS. \"Come in,\" Clyde told me. \"And don\u0027t think I won\u0027t kill you, you try any more of that kung fu shit on me. You know how much I snore when I get my nose broke?\" Clyde opened the screen door and the smell of burning pork and beans came wafting out. He cursed, pushed past me toward the stove. Apparently he\u0027d forgotten a culinary experiment in his haste to apprehend me. I stepped into the dark kitchen area, and one of the advertised ferocious dogs appeared from the hallway. It was a Doberman—sleek black, tan muzzle, little devilhorn ears. It took one look at me with its sad, milky eyes and squeaked the toy in its mouth—a pink rubber bunny. Then the Doberman plodded forward a few steps, collapsed on the rug as if it had been shot, and sighed. \"Vicious,\" I said. \"Terrifying.\" Clyde glowered at me. He picked up a spatula with baked bean crust on the edge, took his black, smoking pan of lunch off the electric stovetop. \"I had me two other asseating Dobes,\" he growled. \"Mean ones—Harley and Davidson. Both died since Christmas. Now all I got left is Miata.\" \"Let me guess. Ruby named her after her car.\" His ears turned bright red. \"Fucking disgrace. You don\u0027t go out of here talking about this, you understand?\" I crossed my heart. Clyde\u0027s living room was a cozy combination bike garage, poker den, and army surplus centre. Tables overflowed with greasy wrenches, nuts and bolts, cartridge boxes, and pieces of disassembled weapons. Somebody had played 52pickup across the rug. There was one sofa that looked like a piece of chewed gum. Clyde told me to sit down. I chose the edge of a table. Clyde offered me a drink—raw egg shake, Gatorade, or beer. I declined. He plopped himself onto the chewing gum couch, popped open a beer. \"Before I kill you,\" he said, \"what were you doing on Ruby\u0027s boat?\" \"Just visiting. Finding out Ruby\u0027s a lot closer to Matthew Pena than she lets on.\"","sourceLink":"https://allnovel.net/the-devil-went-down-to-austin-tres-navarre-4/page-27.html","bookId":2419,"book":{"id":2419,"title":"The Devil Went Down to Austin (Tres Navarre #4)","description":"Storyline: The Devil Went Down to Austin (Tres Navarre #4) Rick Riordan, triple-crown winner of the Edgar, Anthony, and Shamus Awards, brings his fast-talking, hard-living, Texas-hip P.I. Tres Navarre to the heart of the Lone Star State—Austin—to unravel a case so dark, twisted, and deadly, it can only involve family.... Tres Navarre, the P.I. with a Ph.D. in literature, heads to Austin for a laid-back summer teaching gig. But he’s in store for a whole lot more. His big brother Garrett--computer whiz, Jimmy Buffett fanatic, and all-around eccentric—is hoping to retire a multimillionaire by the fall. He’s bet his career and the Navarre family ranch to do it. Then Garrett’s oldest friend and business partner is murdered—and Garrett is the only suspect. As Tres delves into Garrett’s bizarre world to find the truth behind the murder, he comes face to face with the damaged relationships, violent lives, and billion-dollar schemes of a high-tech world gone haywire. Connecting them all is beautiful Lake Travis and the shocking secret that lies within its depths. Now, as Tres struggles with his own troubled family past and to clear his brother’ s name, he finds himself stalked by a cold-blooded killer—one who could spell the death of both Navarres.","cover":"https://allnovel.net/images/the-devil-went-down-to-austin-tres-navarre-4.jpg","author":"Rick Riordan","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-devil-went-down-to-austin-tres-navarre-4.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 10:38:40 AM"}}
