{"id":76518,"no":4,"title":"Page 4","content":"Then I heard a car engine—Garrett\u0027s van. I stumbled downstairs, pulled on my boots, and came out the door in time to see Garrett\u0027s taillights disappearing below the rise in the woods, heading toward the kiln. Dry ice started burning in my stomach. The sky above was a solid gray sheet of clouds, tinted orange in the east from the perpetual glow of Austin. I ran, every rainsoaked branch thwapping into me on my way downhill. The VW safari van had been parked with its front wheel on the cement slab of Jimmy\u0027s future studio, slammed into the side of the kiln. The driver\u0027s door was open, the engine idling with its steady, tubercular cough. The headlights cut a yellow oval in the woods, illuminating wet trees hung with Spanish moss, silver streaks of gnats, the back bumper of Jimmy Doebler\u0027s Chevy pickup. The truck had rolled from where I\u0027d last seen it—down the slope of the bank, over a few young saplings, and straight into the lake. Its nose was completely submerged, the cab just at the waterline. Garrett\u0027s wheelchair was overturned in the mud about twelve feet away. Garrett was on the ground and something metal gleamed in the mud nearby. When he saw me, Garrett tried to speak. In the dark, his eyes wild, his bearded face glazed with sweat, he looked like some sort of cornered night animal. He lifted one muddy hand and pointed toward the truck. \"I couldn\u0027t get down there. I couldn\u0027t—\" I focused on the Lorcin—Garrett\u0027s .380—in the mud about three feet from him. I ran past him, toward the truck. The odour of gun discharge hit me. Then a fainter smell, like a breeze through a butcher\u0027s apron. I sank bootdeep into silty water, put my hand on the passenger\u0027s side door handle and looked in the open window. My vision telescoped. It refused to register anything but the smallest details—the gurgle of lake water springing from the cracks at the bottom of the driver\u0027s door, glossing the parchmentcoloured boots a shiny brown. An upturned palm, callused fingers curled inward. \"Tres?\" Garrett called, his voice brittle. The driver\u0027sside window was shattered, the frame and remaining shards painted burgundy and gray. \"Is he in there?\" Garrett called.. \"Please to fucking Christ, tell me he\u0027s not in there.\" I tried to step back from the truck, but my boots wouldn\u0027t come free of the silt. I want to stay down here a little longer. Garrett called again. \"Tres?\" I wasn\u0027t seeing this. I\u0027ve got a lot of time to make up for. I grasped at that sentence like a burning rope, but it wouldn\u0027t pull me out. It couldn\u0027t change what my eyes were showing me. Jimmy Doebler had been shot in the head, and my brother was the one with the gun. Date: Fri 09 Jun 00 04:18:05 Pacific Daylight Time From: [email protected] I pal_mail.com To: \u003crecipient list suppressed\u003e Subject: the tracks XMSMailPriority: Normal I\u0027ve spent years imagining what that night must\u0027ve been like. His good buddy taught him the trick, didn\u0027t he? It was so easy from where they lived, down in the Olmos Basin. The Union Pacific line went straight through, two times a night, always slowing for the crossings. He was fighting with his father again—about the length of his hair, maybe. Or drugs. Maybe his father didn\u0027t like his plans to drop out of business school, become a mathematician. That was his plan back then, wasn\u0027t it? Straight math. Pure numbers. So he stormed out of the house on Contour around eleven o\u0027clock, midnight. He\u0027d already made plans to meet his buddy down at the tracks, and his anger must\u0027ve given way to excitement. He made his way down to the crossing—to the far side, the signal box where they always meet. He knelt in a clump of marigolds and waited. It might\u0027ve been cold, that late in October. Or maybe it was one of those unseasonable Texas fall nights—steamy and mild, moths and gnats everywhere, the smell of river mud and garbage from Olmos Creek. He waited, and his buddy didn\u0027t show. He knew the train schedule. He was a little late. His friend could\u0027ve caught the last train, could already be on his way north, to the junction of the MKT line—that underpass where they\u0027d stashed a lifetime supply of stolen beer. His friend could be there right now, hanging out in the broken sidecar where, on a good night, they could find the transients with the Mexican hash. He gets a sudden thrill, because he\u0027s never tried to hitch alone, but he knows he can do it. And when he catches those rungs, he\u0027ll be Jack Kerouac. He\u0027ll be Jimmie Rodgers. And he knows his friend will be there at the junction to hear him brag about it—because it\u0027s a shared dream. His friend gave him the itch, reassured him, that first scary time—Look how slow it moves. It\u0027s beautiful, man. Just waiting for you. Let\u0027s get the rhythm. Count to three— So he makes his decision, waits for the rumble of the second train, the glare of the headlamp. He smells diesel, feels the strange, steady rhythm of a million tons of steel in motion. How could he know that his good buddy has forgotten all about him—that he is already in Austin, tending to his poor mamma, who has called out of the blue, after years of fuckyou good riddance nothing parenting? And his buddy went running to her. He doesn\u0027t know that, so waits for a good car—one of the old fashioned flatbeds. AII he has to do is jump on. When he targets one, his friend could\u0027ve told him—not that one. Look at the ladder. But there\u0027s no one to warn him. He times it, then runs, catches the metal side rails. His boot hits the bottom rung and slips. His sole drags in the gravel. He should be able to hoist himself back up, but he hasn\u0027t planned on the rungs being so wet—cold metal, newly painted. His heel snags a rail tie and his fingers betray him. The last thing he feels is gravel and cold steel as he\u0027s pulled underneath, and the slow rhythm is not so slow after all—the giant metal wheel, a smooth disk, covering what—thirty inches?—in the space of a second. Whatever noise he makes can\u0027t be heard above the rumble of the train. There\u0027s no pain. No blood loss—every artery sealed perfectly against the tracks. He lies there in shock, staring at the stars. How long—an hour? Two? How long before this little brother got nervous, decided to give away the secret of where Big Brother goes when he\u0027s angry? And what did he think about as he lay there? I hope he thought about his good buddy who\u0027d abandoned him, made him fall in love with trains, gave him a few months of freedom that he would now pay for by being immobile, bound to metal wheels—forever. I hope, somewhere inside, he wished his friend had been the one on the tracks. Because he\u0027s waited twenty years for this train. I want him to enjoy the ride. CHAPTER 4 Coffee and stale garlic bagels at the Travis County Sheriff\u0027s Department didn\u0027t improve my frame of mind. Neither did twelve hours of waiting rooms, shoe prints, fingerprints, atomic swab absorption tests, and questions from the lead investigator, Victor Lopez, who was convinced he had a sense of humour. I saw my brother once, from across the homicide office. The betrayed look he gave me made me glad the deputies had separated us. If Jimmy\u0027s exwife made an appearance, I didn\u0027t notice her. The only member of the Doebler clan I spotted was one of Jimmy\u0027s cousins from the wealthy branch of the family—Wesley or Waylon, I couldn\u0027t remember his name. Jimmy had introduced us once at a Christmas party, maybe a decade ago. He wore a gray silk suit and three gold rings and a look of professional concern he probably saved for family tragedies and stock devaluations. He spent a few minutes at the opposite end of the room, talking to the sheriff, then gave me a cold glance on his way out. At 4:30 in the afternoon, I was finally trundled into the backseat of a patrol car next to Detective Lopez and chauffeured toward Garrett\u0027s apartment. We cruised up Lavaca, through West Campus neighbourhoods of white antebellum sorority houses and highrent condominiums. The postrain air steamed with sumac. Every front yard was strewn with pink and white from blooming crape myrtles. On Guadalupe across from UT, a cute Asian girl in plaid pants and a tank top was reading a Henry James novel outside Quacken bush\u0027s Intergalactic Coffeehouse. Street vendors were selling glass beads and incense in the Renaissance Market. Construction workers were drilling a crater in the middle of 24th Street. Jimmy\u0027s death was expanding inside my rib cage like a nitrogen bubble, but the rest of the world kept right on going. It was enough to make me resent a sunny afternoon in a beautiful city. The patrol car turned on San Gabriel. Garrett\u0027s apartment building is a threestory redwood box with exterior walkways like a motel. On one side is a $40,000 steelframe handicappedaccess elevator that the landlord recently installed after three years in court. The landlord loves Garrett. Below and on both sides of Garrett\u0027s unit are college kids who put up with my brother playing Jimmy Buffett CDs at full volume night and day. The college kids love Garrett. The rest of the building is populated by smalltime drug dealers, angstridden artists and drunks, all of whom spend their time fighting and throwing each other\u0027s furniture off the balconies and loving Garrett. The name of the apartment complex is The Friends. The Carmen Miranda—Garrett\u0027s VW safari van with the Caribbean dancing women airbrushed along the sides and the plastic tropical fruit hotglued to the roof—had been returned from the crime scene, special delivery. I guess if I were the Travis County sheriff, I would want to get it away from my crime scene as fast as possible, too. Parked next to it was my black Ford F150. \"I\u0027ll only be a second,\" Lopez told our driver. \"You hang tight.\" The deputy glanced in the rearview mirror—shot me a notso veiled fuck you look. \"Whatever you say, sir.\" Lopez and I walked toward the apartment complex. Lopez stopped in front of the Carmen Miranda, shook his head in admiration. \"I dig the pineapples,\" he said. Lopez\u0027s features were satanically pleasant, teaandmilk complexioned, framed by a square jaw and a severe, greasy buzz cut. He had a halfback\u0027s build and the eyes of a chess player. \"When does Garrett get released?\" I asked. Lopez feigned surprise. \"Should be upstairs right now. Why? You thought we would hold him?\" That was a hook I decided not to bite. \"Don\u0027t look so down,\" Lopez said. \"Y\u0027all cooperated beautifully. Now we just got to find who whacked your friend, right?\" I leaned against the back of the van, hating how leaden my eyes felt, hating the odour of smoke in my clothes from last night\u0027s fire. \"Garrett wouldn\u0027t kill Jimmy. Even if he wanted to, his wheelchair ...\" Lopez\u0027s eyes glittered. \"Sure, Mr. Navarre. According to your statement, there\u0027s no way. We\u0027re just asking questions, you know? Got to explain those nagging details, like why your brother\u0027s gun had been fired. Why there was powder residue on his hand.\" \"I told you—\" \"He shot a statue. Happens every day. And we\u0027ll have to explain the fact there was no shell casing at the scene. You know. Just some little details like that.\" Lopez was watching me the way a fisherman watches the tide, moving across it with a skeining net. I said, \"He\u0027s disabled, Lopez.\" \"I prefer to think of him as differently abled, don\u0027t you? But don\u0027t worry—I\u0027m sure we\u0027ll find the casing sooner or later. Ballistics has the projectile now—probably find out it was from a completely different gun. Some anonymous killer in the night, I imagine.\"","sourceLink":"https://allnovel.net/the-devil-went-down-to-austin-tres-navarre-4/page-4.html","bookId":2419,"book":{"id":2419,"title":"The Devil Went Down to Austin (Tres Navarre #4)","description":"Storyline: The Devil Went Down to Austin (Tres Navarre #4) Rick Riordan, triple-crown winner of the Edgar, Anthony, and Shamus Awards, brings his fast-talking, hard-living, Texas-hip P.I. Tres Navarre to the heart of the Lone Star State—Austin—to unravel a case so dark, twisted, and deadly, it can only involve family.... Tres Navarre, the P.I. with a Ph.D. in literature, heads to Austin for a laid-back summer teaching gig. But he’s in store for a whole lot more. His big brother Garrett--computer whiz, Jimmy Buffett fanatic, and all-around eccentric—is hoping to retire a multimillionaire by the fall. He’s bet his career and the Navarre family ranch to do it. Then Garrett’s oldest friend and business partner is murdered—and Garrett is the only suspect. As Tres delves into Garrett’s bizarre world to find the truth behind the murder, he comes face to face with the damaged relationships, violent lives, and billion-dollar schemes of a high-tech world gone haywire. Connecting them all is beautiful Lake Travis and the shocking secret that lies within its depths. Now, as Tres struggles with his own troubled family past and to clear his brother’ s name, he finds himself stalked by a cold-blooded killer—one who could spell the death of both Navarres.","cover":"https://allnovel.net/images/the-devil-went-down-to-austin-tres-navarre-4.jpg","author":"Rick Riordan","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-devil-went-down-to-austin-tres-navarre-4.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 10:38:40 AM"}}
