{"id":76746,"no":47,"title":"Page 47","content":"Gravel crunched underfoot as we walked toward the water. I watched the restaurant for signs of movement. Two different planks led from shore. Beer bottles floated in the scummy water between. Maia drew her Sig Sauer and gestured that she would take the left plank. Matthew and I took the right. I stepped across the gangplank, pushed on the heavy wooden door. The sign NO ONE UNDER 18 ADMITTED crinkled under my palm. A dove flitted out of the exposed rafters and I nearly shot at it. Matthew and I made our way through a barroom that smelled like lemon ammonia and dried whiskey. I brought out my pencil flashlight and shone it into dark corners—a plastic spoon, a napkin, a forgotten handbag. It was so quiet we could hear the lake gurgle and plunk against the aluminium pontoon floats beneath the floor. I thought, just for a moment, that I heard a man\u0027s voice—a murmured question. I stopped Pena. We listened. Nothing. We rendezvoused with Maia in the main dining room—a forest of upsidedown chairs stacked on tables. The deck doors were open, letting in the smell of the water and the entire panorama of the lake. Mansfield Dam rose up immediately on the left—an enormous slab of charcoal. Pena started to whisper, \"This was a waste—\" And then someone else spoke, directly in front of us. There was a human form out on the deck. Pena and I moved toward it, Maia a few steps behind, bringing up the rear. The man glistened—the glint of wet suit material. Victor Lopez was sitting on the railing of the deck. \"Vic?\" I called. We were at the open doorway now, Lopez only ten feet away. As my eyes adjusted, I noticed his gear—the air tank, the regulator, the mask around his neck. He wore two weight belts that were solid with squares of lead, another two belts crossing his chest like bandoliers. No BC to counteract the lead. No fins. If Lopez went over the side like that, he would sink fast and have a hell of a time coming back up. He was also holding a gun at his thigh—not a service pistol. Something smaller. An oldstyle Raven from back in the 1980s. A .380 automatic. Lopez was staring out over the water, as if in a reverie. I glanced back at Maia, who shook her head slightly—I don\u0027t know. Then Vic mumbled something. \"Here. Right here, I think.\" \"Lopez?\" I called. He looked over, said nothing. There was more scuba equipment at his feet—another air tank, fastened to a BC. On a nearby table was a mask. Next to that, a computer disk. I shone my pencil flashlight in Lopez\u0027s face. His pupils stayed fully dilated. His expression didn\u0027t change— as if there were no circulation in his face. \"Is this—\" he droned. \"Is this . . . okay?\" \"We should leave,\" Pena murmured. \"Now.\" Then the deck boards creaked behind us. I spun. A second figure had separated from the darkness right next to Maia. The only thing that wasn\u0027t pure black was the gun. It was pressed against Maia\u0027s temple. \"Yes,\" said the voice I didn\u0027t recognize at all. \"That\u0027s fine, Vic. Put your mask on.\" Metal thudded against wood—Maia\u0027s gun dropping. \"That\u0027s good, dear heart,\" the voice crooned, the face still in the shadows. \"Now your friend\u0027s—gun and the flashlight in the water, please.\" Maia said, \"Don\u0027t, Tres.\" \"Ah,\" the voice said. \"But Tres can\u0027t shoot, can he? He doesn\u0027t trust his aim. He doesn\u0027t trust guns. And certainly, he knows I\u0027ll kill you if he doesn\u0027t cooperate.\" Next to me, Pena stayed still. I tossed my gun and flashlight over the railing, heard two tiny plooshes in the water. The figure stepped forward, pushing Maia ahead. A black baseball cap. A wet suit. A face painted black, eyes intense as a raptor\u0027s. The gun slid down, pressed tightly into Maia\u0027s jugular vein. \"My hero.\" Dwight Hayes gave me a pleasant smile. \"Thanks for coming, Tres.\" CHAPTER 41 \"You son of a bitch,\" Pena said. \"You don\u0027t know how appropriate your comment is, Matthew.\" Dwight\u0027s wrist rested on Maia\u0027s shoulder. The neoprene of the wet suit was soaking the top of her shirt. He moved his free hand around her waist, spreading his fingers caressingly across her abdomen. \"You smell good,\" Dwight told her. \"I\u0027ve never been close enough—except for your apartment, looking through your things. I\u0027m glad you decided to pursue us, Maia.\" She swallowed. Her throat muscles pushed against Dwight\u0027s gun and made it look like she was nodding. I watched her fingers, waited for our old sign—a threefinger countdown, which would mean she was about to risk a move. \"All right, Victor,\" Dwight said. Lopez had raised his gun. He was pointing it at Dwight Hayes, but his arm was bent, the gun turned sideways, as if some invisible armwrestling opponent was forcing his hand back at the wrong angle. \"You won\u0027t need that,\" Dwight assured Lopez. His voice was calm, deep. \"Don\u0027t you remember?\" \"You\u0027re drugged, Lopez,\" I said. \"Fight it. Shoot the bastard.\" Lopez\u0027s arm trembled. His chest had begun to cave in like an old man\u0027s under the weight and heat of the scuba gear. \"Don\u0027t remember,\" he mumbled. \"The little boy,\" Dwight told him. \"The little Asian child. He was right under the deck, wasn\u0027t he?\" \"The boy.\" \"Right about where you\u0027re sitting.\" Pena said, \"Jesus Christ, Dwight.\" Pena started to move forward, but Dwight pressed the gun into Maia\u0027s throat, made her gag. \"Tsk, tsk, old friend. First things first.\" Lopez mumbled, \"Right here.\" \"Good,\" Dwight said, nodding pleasantly. \"What should you do?\" \"Search.\" \"That\u0027s an excellent idea. You can leave the gun, I think. Your prints are on it now. That should be sufficient.\" Lopez\u0027s hand lowered. The Raven clunked on the floor. \"I can\u0027t— No.\" \"You need your mask on,\" Dwight suggested. \"And you\u0027ll have to keep looking. Even if it gets cold, even if you can\u0027t get out, you can\u0027t leave a little boy alone down there. Can\u0027t let that happen again.\" Dwight\u0027s voice had taken on a cadence that wasn\u0027t quite human— more like a drum, hit by a small, angry windup machine. \"You\u0027ll just need to keep searching, Vic. That little boy is down there somewhere. Drowning in the dark.\" Lopez fumbled with his mask. \"No, Vic,\" I said. But I was just part of the nightmare. His heart must have been slowing, his mind turning to thick sap, flowing over Dwight\u0027s words, hardening wherever they stuck. He bit the regulator\u0027s mouthpiece, groping for a pressure gauge. \"Oh, there isn\u0027t one, Victor,\" Dwight reassured him. \"Time is the diver\u0027s enemy. This dive, you won\u0027t have any limits. No charts. Just your task. Now over you go—it\u0027ll feel so good to get into the cold water, won\u0027t it?\" Lopez had trouble getting his leg over the railing. He slid off awkwardly, his tank hitting the rail as he fell, and then he was gone. The sound in my ears compressed into a roar. I looked at Dwight. \"How much time, you sick fuck?\" He cocked his head. \"Air consumption is unpredictable when their metabolism slows down. It\u0027s a race, really, whether his heart fails from the drugs before the air gives out.\" Next to me, Pena made his hands into fists. \"You killed her. You drugged Adrienne. You followed us—waited for me to leave. You goddamn—\" Dwight made shhshhshh sounds, the way you would for a restless infant. \"Adrienne was getting too close to you, Matthew. She was softening you. I couldn\u0027t allow that. You made too good of a shadow to stand in, allowed me to get away with so much. I couldn\u0027t give up all the years I\u0027d cultivated you.\" \"You pointed Pena toward Techsan,\" I said. \"You made the pact with Ruby, killed her when she started having regrets. It was all\"\u0027 your idea—you intended to destroy Jimmy.\" He rubbed his hand across Maia\u0027s belly. \"Lopez needs help. I\u0027ll tell you what, Maia—there\u0027s my equipment. I\u0027ll let you go in. Only you.\" If it was possible for Maia to look any more tense than she already did, with a gun at her throat, Dwight\u0027s comment did the trick. \"It\u0027s only about twenty feet there,\" Dwight told her. \"Pitch black. And of course, you\u0027d have to feel around—not knowing when you\u0027ll touch human flesh, and if he\u0027ll still be alive when you do. What do you say, honey? It would be worth it, letting you save Lopez\u0027s life, just to see you face that.\" Pena said, \"I\u0027ll destroy you.\" Dwight raised his eyebrows. \"Don\u0027t lose your only admirable quality now, Matthew. You\u0027ve got to be strong. You\u0027ve got to cut those ties, stand alone. That\u0027s what you always wanted. That was why I visited your parents that Christmas. I granted your wish.\" Pena was deadly still for half a second, and then, foolishly, he charged. It might have been an opportunity, but before I could even think of using it, Dwight fired. The bullet caught Pena in the gut. He contracted like he was catching a football, slammed down on his knees. After the shot, the silence was intense. \"I\u0027ve learned a lot of lessons from you, Matthew,\" Dwight told him. \"I was hoping to spare you. But it\u0027s only right you\u0027re here to help me end this.\" Matthew hugged his middle, made small sounds of pain. A sheen of sweat had formed on Dwight\u0027s blackened face, but I got the feeling it had nothing to do with the insulation of the wet suit. Dwight Hayes was overheating from the inside. \"You remember, Matthew? How many times we lay awake at night in the dorm room talking, that first semester? Don\u0027t you remember when you gave me the idea? You told me about changing your name, how you wished your parents were dead for ignoring you all those years? You were my inspiration.\" \"No,\" Pena managed. There was a wet stain on the wood, blood spreading around his knees. \"Oh, yes, you were,\" Dwight insisted. \"You gave me the courage to live. You gave me a purpose.\" I met Maia\u0027s eyes, saw what she was thinking. Distract him. \"You\u0027re Jimmy\u0027s brother,\" I told him. \"Clara and Ewin\u0027s son.\" Dwight\u0027s smile became disdainful. \"You don\u0027t see the resemblance, Tres? Don\u0027t worry—the disk there on the table, I take the blame for it all. When they find your bodies, they\u0027ll understand. All the roots will be pulled—all the pieces of my family, Jimmy\u0027s family, will be gone. I\u0027m sorry Garrett couldn\u0027t be here, but he\u0027ll have enough charges against him to destroy him. After tonight, Clara\u0027s younger son can rest in peace.\" The way he spoke of himself in the third person chilled me even more than his threat. \"Kill him, Tres,\" Pena moaned. \"You have to kill him.\" Maia\u0027s first finger went down. I\u0027d have to tackle him. But the way Dwight shot, the speed with which he moved—I was pretty sure Maia and I were both going to die. Maia\u0027s second finger went down. A floorboard creaked in the main dining room, and a voice grumbled, \"Eh! What the fucking gunshot about?\" Armand the biker. I had never been happier to hear a Cajun accent in my life.","sourceLink":"https://allnovel.net/the-devil-went-down-to-austin-tres-navarre-4/page-47.html","bookId":2419,"book":{"id":2419,"title":"The Devil Went Down to Austin (Tres Navarre #4)","description":"Storyline: The Devil Went Down to Austin (Tres Navarre #4) Rick Riordan, triple-crown winner of the Edgar, Anthony, and Shamus Awards, brings his fast-talking, hard-living, Texas-hip P.I. Tres Navarre to the heart of the Lone Star State—Austin—to unravel a case so dark, twisted, and deadly, it can only involve family.... Tres Navarre, the P.I. with a Ph.D. in literature, heads to Austin for a laid-back summer teaching gig. But he’s in store for a whole lot more. His big brother Garrett--computer whiz, Jimmy Buffett fanatic, and all-around eccentric—is hoping to retire a multimillionaire by the fall. He’s bet his career and the Navarre family ranch to do it. Then Garrett’s oldest friend and business partner is murdered—and Garrett is the only suspect. As Tres delves into Garrett’s bizarre world to find the truth behind the murder, he comes face to face with the damaged relationships, violent lives, and billion-dollar schemes of a high-tech world gone haywire. Connecting them all is beautiful Lake Travis and the shocking secret that lies within its depths. Now, as Tres struggles with his own troubled family past and to clear his brother’ s name, he finds himself stalked by a cold-blooded killer—one who could spell the death of both Navarres.","cover":"https://allnovel.net/images/the-devil-went-down-to-austin-tres-navarre-4.jpg","author":"Rick Riordan","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-devil-went-down-to-austin-tres-navarre-4.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 10:38:40 AM"}}
