{"id":75803,"no":18,"title":"Page 18","content":"He entered the combination on the padlock and unlocked the grate, pulling it to one side. After stepping through, he followed protocol and relocked the grate behind him. Then he walked to the gray wooden door.\n “È chiuso!” he yelled through the door, hoping the person outside would hear. “Non si può entrare!”\n The banging continued.\n Ernesto gritted his teeth. New Yorkers, he wagered. They want what they want. The only reason their Red Bulls soccer team was having any success on the world stage was that they’d pilfered one of Europe’s best coaches.\n The banging continued, and Ernesto reluctantly unlocked the door and pushed it open a few inches. “È chiuso!”\n The banging finally stopped, and Ernesto found himself face-to-face with a soldier whose eyes were so cold they literally made Ernesto step back. The man held up an official carnet bearing an acronym Ernesto did not recognize.\n “Cosa succede?!” Ernesto demanded, alarmed. What’s going on?!\n Behind the soldier, a second was crouched down, tinkering with what appeared to be a toy helicopter. Still farther away, another soldier stood guard on the staircase. Ernesto heard police sirens nearby.\n “Do you speak English?” The soldier’s accent was definitely not New York. Europe somewhere?\n Ernesto nodded. “A bit, yes.”\n “Has anyone come through this door this morning?”\n “No, signore. Nessuno.”\n “Excellent. Keep it locked. Nobody in or out. Is that clear?”\n Ernesto shrugged. That was his job anyway. “Sì, I understand. Non deve entrare, né uscire nessuno.”\n “Tell me, please, is this door the sole entrance?”\n Ernesto considered the question. Technically, nowadays this door was considered an exit, which was why it had no handle on the outside, but he understood what the man was asking. “Yes, l’accesso is this door only. No other way.” The original entrance inside the palace had been sealed for many years.\n “And are there any other hidden exits from the Boboli Gardens? Other than the traditional gates?”\n “No, signore. Big walls everywhere. This only secret exit.”\n The soldier nodded. “Thank you for your help.” He motioned for Ernesto to close and lock the door.\n Puzzled, Ernesto obeyed. Then he headed back up the corridor, unlocked the steel grate, moved through it, relocked it behind him, and returned to his football match.\n CHAPTER 30\n Langdon and Sienna had seized an opportunity.\n While the muscular soldier was pounding on the door, they had crawled deeper into the grotto and were now huddled in the final chamber. The tiny space was adorned with rough-hewn mosaics and satyrs. At its center stood a life-size sculpture of a Bathing Venus, who, fittingly, seemed to be glancing nervously over her shoulder.\n Langdon and Sienna had ensconced themselves on the far side of the statue’s narrow plinth, where they now waited, staring back at the single globular stalagmite that climbed the deepest wall of the grotto.\n “All exits confirmed secure!” shouted a soldier somewhere outside. He was speaking English with a faint accent that Langdon couldn’t place. “Send the drone back up. I’ll check this cave here.”\n Langdon could feel Sienna’s body tighten beside him.\n Seconds later, heavy boots were padding into the grotto. The footsteps advanced quickly through the first chamber, growing louder still as they entered the second chamber, coming directly toward them.\n Langdon and Sienna huddled closer.\n “Hey!” a different voice shouted in the distance. “We’ve got them!”\n The footsteps stopped short.\n Langdon could now hear someone running loudly down the gravel walkway toward the grotto. “Positive ID!” the breathless voice declared. “We just spoke to a couple of tourists. A few minutes ago, the man and the woman asked them directions to the palace’s costume gallery … which is over at the west end of the palazzo.”\n Langdon glanced at Sienna, who seemed to be smiling ever so faintly.\n The soldier regained his breath, continuing. “The western exits were the first to be sealed … and confidence is high that we’ve got them trapped inside the gardens.”\n “Execute your mission,” the nearer soldier replied. “And call me the instant you’ve succeeded.”\n There was a flurry of departing footsteps on gravel, the sound of the drone lifting off again, and then, thankfully … total silence.\n Langdon was about to twist sideways in order to peer around the plinth, when Sienna grabbed his arm, stopping him. She held a finger to her lips and nodded at a faint humanoid shadow on the rear wall. The lead soldier was still standing silently in the mouth of the grotto.\n What is he waiting for?!\n “It’s Brüder,” he said suddenly. “We’ve got them cornered. I should have confirmation for you shortly.”\n The man had placed a phone call, and his voice sounded unnervingly close, as if he were standing right beside them. The cavern was acting like a parabolic microphone, collecting all the sound and focusing it at the rear.\n “There’s more,” Brüder said. “I just received an update from forensics. The woman’s apartment appears to be a sublet. Underfurnished. Clearly short term. We located the biotube, but the projector was not present. I repeat, the projector was not present. We assume it’s still in Langdon’s possession.”\n Langdon felt a chill to hear the soldier speak his own name.\n The footsteps grew louder, and Langdon realized that the man was moving into the grotto. His gait lacked the intensity of a few moments before and sounded now as if he were simply wandering, exploring the grotto as he talked on the phone.\n “Correct,” the man said. “Forensics also confirmed a single outbound call shortly before we stormed the apartment.”\n The U.S. Consulate, Langdon thought, remembering his phone conversation and the quick arrival of the spike-haired assassin. The woman seemed to have disappeared, replaced by an entire team of trained soldiers.\n We can’t outrun them forever.\n The sound of the soldier’s boots on the stone floor was now only about twenty feet away and closing. The man had entered the second chamber, and if he continued to the end, he would certainly spot the two of them crouched behind Venus’s narrow base.\n “Sienna Brooks,” the man declared suddenly, the words crystal clear.\n Sienna startled beside Langdon, her eyes reeling upward, clearly expecting to see the soldier staring down at her. But nobody was there.\n “They’re going through her laptop now,” the voice continued, about ten feet away. “I don’t have a report yet, but it is definitely the same machine we traced when Langdon accessed his Harvard e-mail account.”\n On hearing this news, Sienna turned to Langdon in disbelief, gaping at him with an expression of shock … and then betrayal.\n Langdon was equally stunned. That’s how they tracked us?! It hadn’t even occurred to him at the time. I just needed information! Before Langdon could convey an apology, Sienna had turned away, her expression going blank.\n “That’s correct,” the soldier said, arriving at the entrance to the third chamber, a mere six feet from Langdon and Sienna. Two more steps and he would see them for certain.\n “Exactly,” he declared, taking one step closer. Suddenly the soldier paused. “Hold on a second.”\n Langdon froze, bracing to be discovered.\n “Hold on, I’m losing you,” the soldier said, and then retreated a few steps into the second chamber. “Bad connection. Go ahead …” He listened for a moment, then replied. “Yes, I agree, but at least we know who we’re dealing with.”\n With that, his footsteps faded out of the grotto, moved across a gravel surface, and then disappeared completely.\n Langdon’s shoulders softened, and he turned to Sienna, whose eyes burned with a mixture of fear and anger.\n “You used my laptop?!” she demanded. “To check your e-mail?”\n “I’m sorry … I thought you’d understand. I needed to find out—”\n “That’s how they found us! And now they know my name!”\n “I apologize, Sienna. I didn’t realize …” Langdon was racked by guilt.\n Sienna turned away, staring blankly at the bulbous stalagmite on the rear wall. Neither one of them said anything for nearly a minute. Langdon wondered if Sienna remembered the personal items that had been stacked on her desk—the playbill from A Midsummer Night’s Dream and press clippings about her life as a young prodigy. Does she suspect I saw them? If so, she wasn’t asking, and Langdon was in enough trouble with her already that he was not about to mention it.\n “They know who I am,” Sienna repeated, her voice so faint that Langdon could barely hear her. Over the next ten seconds, Sienna took several slow breaths, as if trying to absorb this new reality. As she did so, Langdon sensed that her resolve was slowly hardening.\n Without warning, Sienna scrambled to her feet. “We should go,” she said. “It won’t take long for them to figure out we’re not in the costume gallery.”\n Langdon stood up with her. “Yes, but go … where?”\n “Vatican City?”\n “I beg your pardon?”\n “I finally figured out what you meant before … what Vatican City has in common with the Boboli Gardens.” She motioned in the direction of the little gray door. “That’s the entrance, right?”\n Langdon managed a nod. “Actually, that’s the exit, but I figured it was worth a shot. Unfortunately, we can’t get through.” Langdon had heard enough of the guard’s exchange with the soldier to know this doorway was not an option.\n “But if we could get through,” Sienna said, a hint of mischief returning to her voice, “do you know what that would mean?” A faint smile now crossed her lips. “It would mean that twice today you and I have been helped by the same Renaissance artist.”\n Langdon had to chuckle, having had the same thought a few minutes ago. “Vasari. Vasari.”\n Sienna grinned more broadly now, and Langdon sensed she had forgiven him, at least for the moment. “I think it’s a sign from above,” she declared, sounding half serious. “We should go through that door.”\n “Okay … and we’ll just march right past the guard?”\n Sienna cracked her knuckles and headed out of the grotto. “No, I’ll have a word with him.” She glanced back at Langdon, the fire returning to her eyes. “Trust me, Professor, I can be quite persuasive when I have to be.”\n The pounding on the little gray door had returned.\n Firm and relentless.\n Security guard Ernesto Russo grumbled in frustration. The strange, cold-eyed soldier was apparently back, but his timing could not have been worse. The televised football match was in overtime with Fiorentina a man short and hanging by a thread.\n The pounding continued.\n Ernesto was no fool. He knew there was some kind of trouble out there this morning—all the sirens and soldiers—but he had never been one to involve himself in matters that didn’t affect him directly.\n Pazzo è colui che bada ai fatti altrui.\n Then again, the soldier was clearly someone of importance, and ignoring him was probably unwise. Jobs in Italy were hard to find these days, even boring ones. Stealing a last glance at the game, Ernesto headed off toward the pounding on the door.\n He still couldn’t believe he was paid to sit in his tiny office all day and watch television. Perhaps twice a day, a VIP tour would arrive outside the space, having walked all the way from the Uffizi Gallery. Ernesto would greet them, unlock the metal grate, and permit the group to pass through to the little gray door, where their tour would end in the Boboli Gardens.\n Now, as the pounding grew more intense, Ernesto opened the steel grate, moved through it, and then closed and locked it behind him.\n “Sì?” he shouted above the sounds of pounding as he hurried to the gray door.\n No reply. The pounding continued.\n Insomma! He finally unlocked the door and pulled it open, expecting to see the same lifeless gaze from a moment ago.\n But the face at the door was far more attractive.\n “Ciao,” a pretty blond woman said, smiling sweetly at him. She held out a folded piece of paper, which he instinctively reached out to accept. In the instant he grasped the paper and realized it was nothing but a piece of trash off the ground, the woman seized his wrist with her slender hands and plunged a thumb into the bony carpal area just beneath the palm of his hand.\n Ernesto felt as if a knife had just severed his wrist. The slicing stab was followed by an electric numbness. The woman stepped toward him, and the pressure increased exponentially, starting the pain cycle all over again. He staggered backward, trying to pull his arm free, but his legs went numb and buckled beneath him, and he slumped to his knees.\n The rest happened in an instant.\n A tall man in a dark suit appeared in the open doorway, slipped inside, and quickly closed the gray door behind him. Ernesto reached for his radio, but a soft hand behind his neck squeezed once, and his muscles seized up, leaving him gasping for breath. The woman took the radio as the tall man approached, looking as alarmed by her actions as Ernesto was.\n “Dim mak,” the blond said casually to the tall man. “Chinese pressure points. There’s a reason they’ve been around for three millennia.”\n The man watched in wonder.\n “Non vogliamo farti del male,” the woman whispered to Ernesto, easing the pressure on his neck. We don’t want to hurt you.\n The instant the pressure decreased, Ernesto tried to twist free, but the pressure promptly returned, and his muscles seized again. He gasped in pain, barely able to breathe.\n “Dobbiamo passare,” she said. We need to get through. She motioned to the steel grate, which Ernesto had thankfully locked behind him. “Dov’è la chiave?” \n","sourceLink":"https://allnovel.net/inferno-robert-langdon-4/page-18.html","bookId":2415,"book":{"id":2415,"title":"Inferno (Robert Langdon #4)","description":"Storyline: \n Inferno (Robert Langdon #4) \n In his international blockbusters The Da Vinci Code, Angels \u0026 Demons, and The Lost Symbol, Dan Brown masterfully fused history, art, codes, and symbols. In this riveting new thriller, Brown returns to his element and has crafted his highest-stakes novel to date. \n In the heart of Italy, Harvard professor of symbology Robert Langdon is drawn into a harrowing world centered on one of history’s most enduring and mysterious literary masterpieces . . . Dante’s Inferno. \n Against this backdrop, Langdon battles a chilling adversary and grapples with an ingenious riddle that pulls him into a landscape of classic art, secret passageways, and futuristic science. Drawing from Dante’s dark epic poem, Langdon races to find answers and decide whom to trust . . . before the world is irrevocably altered.\n \n","cover":"https://allnovel.net/images/inferno-robert-langdon-4.jpg","author":"Dan Brown","type":"Mystery","source":"allnovel","link":"https://allnovel.net/inferno-robert-langdon-4.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 10:35:34 AM"}}
