{"id":75816,"no":31,"title":"Page 31","content":"According to lore, it was here at this church, at the age of nine, that Dante first laid eyes on Beatrice Portinari—the woman with whom he fell in love at first sight, and for whom his heart ached his entire life. To Dante’s great anguish, Beatrice married another man, and then died at the youthful age of twenty-four. It was also in this church, some years later, that Dante married Gemma Donati—a woman who, even by the account of the great writer and poet Boccaccio, was a poor choice of wife for Dante. Despite having children, the couple showed little signs of affection for each other, and after Dante’s exile, neither spouse seemed eager to see the other ever again. The love of Dante’s life had always been and would always remain the departed Beatrice Portinari, whom Dante had scarcely known, and yet whose memory was so overpowering for him that her ghost became the muse that inspired his greatest works. Dante’s celebrated volume of poetry La Vita Nuova overflows with flattering verses about “the blessed Beatrice.” More worshipful still, The Divine Comedy casts Beatrice as none other than the savior who guides Dante through paradise. In both works, Dante longs for his unattainable lady. Nowadays, the Church of Dante has become a shrine for the brokenhearted who suffer from unrequited love. The tomb of young Beatrice herself is inside the church, and her simple sepulchre has become a pilgrimage destination for both Dante fans and heartsick lovers alike. This morning, as Langdon and Sienna wound their way through old Florence toward the church, the streets continued to narrow until they became little more than glorified pedestrian walkways. An occasional local car appeared, inching through the maze and forcing pedestrians to flatten themselves against the buildings as it passed. “The church is just around the corner,” Langdon told Sienna, hopeful that one of the tourists inside would be able to help them. He knew their chances of finding a good Samaritan were better now that Sienna had taken back her wig in exchange for Langdon’s jacket, and both had reverted to their normal selves, transforming from rocker and skinhead … to college professor and clean-cut young woman. Langdon was relieved once again to feel like himself. As they strode into an even tighter alleyway—the Via del Presto—Langdon scanned the various doorways. The entrance of the church was always tricky to locate because the building itself was very small, unadorned, and wedged tightly between two other buildings. One could easily walk past it without even noticing. Oddly, it was often easier to locate this church using not one’s eyes … but one’s ears. One of the peculiarities of La Chiesa di Santa Margherita dei Cerchi was that it hosted frequent concerts, and when no concert was scheduled, the church piped in recordings of those concerts so visitors could enjoy the music at any time. As anticipated, as they advanced down the alleyway, Langdon began to hear the thin strains of recorded music, which grew steadily louder, until he and Sienna were standing before the inconspicuous entrance. The only indication that this was indeed the correct location was a tiny sign—the antithesis of the bright red banner at the Museo Casa di Dante—that humbly announced that this was the church of Dante and Beatrice. When Langdon and Sienna stepped off the street into the dark confines of the church, the air grew cooler and the music grew louder. The interior was stark and simple … smaller than Langdon recalled. There was only a handful of tourists, mingling, writing in journals, sitting quietly in the pews enjoying the music, or examining the curious collection of artwork. With the exception of the Madonna-themed altarpiece by Neri di Bicci, almost all of the original art in this chapel had been replaced with contemporary pieces representing the two celebrities—Dante and Beatrice—the reasons most visitors sought out this tiny chapel. Most of the paintings depicted Dante’s longing gaze during his famous first encounter with Beatrice, during which the poet, by his own account, instantly fell in love. The paintings were of widely varying quality, and most, to Langdon’s taste, seemed kitschy and out of place. In one such rendering, Dante’s iconic red cap with earflaps looked like something Dante had stolen from Santa Claus. Nonetheless, the recurring theme of the poet’s yearning gaze at his muse, Beatrice, left no doubt that this was a church of painful love—unfulfilled, unrequited, and unattained. Langdon turned instinctively to his left and gazed upon the modest tomb of Beatrice Portinari. This was the primary reason people visited this church, although not so much to see the tomb itself as to see the famous object that sat beside it. A wicker basket. This morning, as always, the simple wicker basket sat beside Beatrice’s tomb. And this morning, as always, it was overflowing with folded slips of paper—each a handwritten letter from a visitor, written to Beatrice herself. Beatrice Portinari had become something of a patron saint of star-crossed lovers, and according to long-standing tradition, handwritten prayers to Beatrice could be deposited in the basket in the hope that she would intervene on the writer’s behalf—perhaps inspiring someone to love them more, or helping them find their true love, or even giving them the strength to forget a love who had passed away. Langdon, many years ago, while in the throes of researching a book on art history, had paused in this church to leave a note in the basket, entreating Dante’s muse not to grant him true love, but to shed on him some of the inspiration that had enabled Dante to write his massive tome. Sing in me, Muse, and through me tell the story … The opening line of Homer’s Odyssey had seemed a worthy supplication, and Langdon secretly believed his message had indeed sparked Beatrice’s divine inspiration, for upon his return home, he had written the book with unusual ease. “Scusate!” Sienna’s voice boomed suddenly. “Potete ascoltarmi tutti?” Everyone? Langdon spun to see Sienna loudly addressing the scattering of tourists, all of whom now glanced over at her, looking somewhat alarmed. Sienna smiled sweetly at everyone and asked in Italian if anyone happened to have a copy of Dante’s Divine Comedy. After some strange looks and shakes of the head, she tried the question in English, without any more success. An older woman who was sweeping the altar hissed sharply at Sienna and held up a finger to her lips for silence. Sienna turned back to Langdon and frowned, as if to say, “Now what?” Sienna’s calling-all-cars solicitation was not quite what Langdon had had in mind, but he had to admit he’d anticipated a better response than she’d received. On previous visits, Langdon had seen no shortage of tourists reading The Divine Comedy in this hallowed space, apparently enjoying a total immersion in the Dante experience. Not so today. Langdon set his sights on an elderly couple seated near the front of the church. The old man’s bald head was dipped forward, chin to chest; clearly he was stealing a nap. The woman beside him seemed very much awake, with a pair of white earbud cables dangling from beneath her gray hair. A glimmer of promise, Langdon thought, making his way up the aisle until he was even with the couple. As Langdon had hoped, the woman’s telltale white earbuds snaked down to an iPhone in her lap. Sensing she was being watched, she looked up and pulled the earbuds from her ears. Langdon had no idea what language the woman spoke, but the global proliferation of iPhones, iPads, and iPods had resulted in a vocabulary as universally understood as the male/female symbols that graced rest-rooms around the world. “iPhone?” Langdon asked, admiring her device. The old woman brightened at once, nodding proudly. “Such a clever little toy,” she whispered in a British accent. “My son got it for me. I’m listening to my e-mail. Can you believe it—listening to my e-mail? This little treasure actually reads it for me. With my old eyes, it’s such a help.” “I have one, too,” Langdon said with a smile as he sat down beside her, careful not to wake up her sleeping husband. “But somehow I lost it last night.” “Oh, tragedy! Did you try the ‘find your iPhone’ feature? My son says—” “Stupid me, I never activated that feature.” Langdon gave her a sheepish look and ventured hesitantly, “If it’s not too much of an intrusion, would you mind terribly if I borrowed yours for just a moment? I need to look up something online. It would be a big help to me.” “Of course!” She pulled out the earbuds and thrust the device into his hands. “No problem at all! Poor dear.” Langdon thanked her and took the phone. While she prattled on beside him about how terrible she would feel if she lost her iPhone, Langdon pulled up Google’s search window and pressed the microphone button. When the phone beeped once, Langdon articulated his search string. “Dante, Divine Comedy, Paradise, Canto Twenty-five.” The woman looked amazed, apparently having yet to learn about this feature. As the search results began to materialize on the tiny screen, Langdon stole a quick glance back at Sienna, who was thumbing through some printed material near the basket of letters to Beatrice. Not far from where Sienna stood, a man in a necktie was kneeling in the shadows, praying intently, his head bowed low. Langdon couldn’t see his face, but he felt a pang of sadness for the solitary man, who had probably lost his loved one and had come here for comfort. Langdon returned his focus to the iPhone, and within seconds was able to pull up a link to a digital offering of The Divine Comedy—freely accessible because it was in the public domain. When the page opened precisely to Canto 25, he had to admit he was impressed with the technology. I’ve got to stop being such a snob about leather-bound books, he reminded himself. E-books do have their moments. As the elderly woman looked on, showing a bit of concern and saying something about the high data rates for surfing the Internet abroad, Langdon sensed that his window of opportunity would be brief, and he focused intently on the Web page before him. The text was small, but the dim lighting in the chapel made the illuminated screen more legible. Langdon was pleased to see he had randomly stumbled into the Mandelbaum translation—a popular modern rendition by the late American professor Allen Mandelbaum. For his dazzling translation, Mandelbaum had received Italy’s highest honor, the Presidential Cross of the Order of the Star of Italian Solidarity. While admittedly less overtly poetic than Longfellow’s version, Mandelbaum’s translation tended to be far more comprehensible. Today I’ll take clarity over poesy, Langdon thought, hoping to quickly spot in the text a reference to a specific location in Florence—the location where Ignazio hid the Dante death mask. The iPhone’s tiny screen displayed only six lines of text at a time, and as Langdon began to read, he recalled the passage. In the opening of Canto 25, Dante referenced The Divine Comedy itself, the physical toll its writing had taken on him, and the aching hope that perhaps his heavenly poem could overcome the wolfish brutality of the exile that kept him from his fair Florence. CANTO XXV If it should happen … if this sacred poem— this work so shared by heaven and by earth that it has made me lean through these long years— can ever overcome the cruelty that bars me from the fair fold where I slept, a lamb opposed to wolves that war on it … While the passage was a reminder that fair Florence was the home for which Dante longed while writing The Divine Comedy, Langdon saw no reference to any specific location in the city. “What do you know about data charges?” the woman interrupted, eyeing her iPhone with sudden concern. “I just remembered my son told me to be careful about Web surfing abroad.” Langdon assured her he would be only a minute and offered to reimburse her, but even so, he sensed she would never let him read all one hundred lines of Canto 25. He quickly scrolled down to the next six lines and continued reading. By then with other voice, with other fleece, I shall return as poet and put on, at my baptismal font, the laurel crown; for there I first found entry to that faith which makes souls welcome unto God, and then, for that faith, Peter garlanded my brow. Langdon loosely recalled this passage, too—an oblique reference to a political deal offered to Dante by his enemies. According to history, the “wolves” who banished Dante from Florence had told him he could return to the city only if he agreed to endure a public shaming—that of standing before an entire congregation, alone at his baptismal font, wearing only sackcloth as an admission of his guilt. In the passage Langdon had just read, Dante, having declined the deal, proclaims that if he ever returns to his baptismal font, he will be wearing not the sackcloth of a guilty man but the laurel crown of a poet. Langdon raised his index finger to scroll farther, but the woman suddenly protested, holding out her hand for the iPhone, apparently having reconsidered her loan. Langdon barely heard her. In the split second before he had touched the screen, his eye had glossed over a line of text … seeing it a second time. I shall return as poet and put on, at my baptismal font, the laurel crown; Langdon stared at the words, sensing that in his eagerness to find mention of a specific location, he’d almost missed a glowing prospect in the very opening lines. at my baptismal font … Florence was home to one of the world’s most celebrated baptismal fonts, which for more than seven hundred years had been used to purify and christen young Florentines—among them, Dante Alighieri. Langdon immediately conjured an image of the building containing the font. It was a spectacular, octagonal edifice that in many ways was more heavenly than the Duomo itself. He now wondered if perhaps he’d read all he needed to read. Could this building be the place Ignazio was referring to? A ray of golden light blazed now in Langdon’s mind as a beautiful image materialized—a spectacular set of bronze doors—radiant and glistening in the morning sun.","sourceLink":"https://allnovel.net/inferno-robert-langdon-4/page-31.html","bookId":2415,"book":{"id":2415,"title":"Inferno (Robert Langdon #4)","description":"Storyline: Inferno (Robert Langdon #4) In his international blockbusters The Da Vinci Code, Angels \u0026 Demons, and The Lost Symbol, Dan Brown masterfully fused history, art, codes, and symbols. In this riveting new thriller, Brown returns to his element and has crafted his highest-stakes novel to date. In the heart of Italy, Harvard professor of symbology Robert Langdon is drawn into a harrowing world centered on one of history’s most enduring and mysterious literary masterpieces . . . Dante’s Inferno. Against this backdrop, Langdon battles a chilling adversary and grapples with an ingenious riddle that pulls him into a landscape of classic art, secret passageways, and futuristic science. Drawing from Dante’s dark epic poem, Langdon races to find answers and decide whom to trust . . . before the world is irrevocably altered.","cover":"https://allnovel.net/images/inferno-robert-langdon-4.jpg","author":"Dan Brown","type":"Mystery","source":"allnovel","link":"https://allnovel.net/inferno-robert-langdon-4.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 10:35:34 AM"}}
