{"id":75821,"no":36,"title":"Page 36","content":"“Oh … my God,” he stammered. “That explains everything.” Langdon watched the anger drain from the man’s face. “Robert,” the newcomer whispered, “we thought you had …” He shook his head as if trying to get the pieces to fall into place. “We thought you had switched sides … that maybe they had paid you off … or threatened you … We just didn’t know!” “I’m the only one he’s spoken to,” Sienna said. “All he knows is he woke up last night in my hospital with people trying to kill him. Also, he’s been having terrible visions—dead bodies, plague victims, and some woman with silver hair and a serpent amulet telling him—” “Elizabeth!” the man blurted. “That’s Dr. Elizabeth Sinskey! Robert, she’s the person who recruited you to help us!” “Well, if that’s her,” Sienna said, “I hope you know that she’s in trouble. We saw her trapped in the back of a van full of soldiers, and she looked like she’d been drugged or something.” The man nodded slowly, closing his eyes. His eyelids looked puffy and red. “What’s wrong with your face?” Sienna demanded. He opened his eyes. “I’m sorry?” “Your skin? It looks like you contracted something. Are you ill?” The man looked taken aback, and while Sienna’s question was certainly blunt to the point of rudeness, Langdon had wondered the same thing. Considering the number of plague references he’d encountered today, the sight of red, blistering skin was unsettling. “I’m fine,” the man said. “It was the damned hotel soap. I’m deathly allergic to soy, and most of these perfumed Italian soaps are soy-based. Stupid me for not checking.” Sienna heaved a sigh of relief, her shoulders relaxing now. “Thank God you didn’t eat it. Contact dermatitis beats anaphylactic shock.” They shared an awkward laugh. “Tell me,” Sienna ventured, “does the name Bertrand Zobrist mean anything to you?” The man froze, looking as if he’d just come face-to-face with the three-headed devil. “We believe we just found a message from him,” Sienna said. “It points to someplace in Venice. Does that make any sense to you?” The man’s eyes were wild now. “Jesus, yes! Absolutely! Where is it pointing!?” Sienna drew a breath, clearly prepared to tell this man everything about the spiraling poem she and Langdon had just discovered on the mask, but Langdon instinctively placed a quieting hand on hers. The man certainly appeared to be an ally, but after today’s events, Langdon’s gut told him to trust no one. Moreover, the man’s tie rang a bell, and he sensed he might very well be the same man he had seen praying in the small Dante church earlier. Was he following us? “How did you find us in here?” Langdon demanded. The man still looked puzzled that Langdon was not recalling things. “Robert, you called me last night to say you had set up a meeting with a museum director named Ignazio Busoni. Then you disappeared. You never called in. When I heard Ignazio Busoni had been found dead, I got worried. I’ve been over here looking for you all morning. I saw the police activity outside the Palazzo Vecchio, and while waiting to find out what happened, by chance I saw you crawling out of a tiny door with …” He glanced over at Sienna, apparently drawing a blank. “Sienna,” she prompted. “Brooks.” “I’m sorry … with Dr. Brooks. I followed you hoping to learn what the hell you were doing.” “I saw you in the Cerchi church, praying, didn’t I?” “Yes! I was trying to figure out what you were doing, but it made no sense! You seemed to leave the church like a man on a mission, and so I followed you. When I saw you sneak into the baptistry, I decided it was time to confront you. I paid off the docent for a couple minutes alone in here.” “Gutsy move,” Langdon noted, “if you thought I had turned on you.” The man shook his head. “Something told me you would never do that. Professor Robert Langdon? I knew there had to be some other explanation. But amnesia? Incredible. I never would have guessed.” The man with the rash began scratching nervously again. “Listen, I was given only five minutes. We need to get out of here, now. If I found you, then the people trying to kill you might find you, too. There is a lot going on that you don’t understand. We need to get to Venice. Immediately. The trick will be getting out of Florence unseen. The people who have Dr. Sinskey … the ones chasing you … they have eyes everywhere.” He motioned toward the door. Langdon held his ground, finally feeling like he was about to get some answers. “Who are the soldiers in black suits? Why are they trying to kill me?” “Long story,” the man said. “I’ll explain on the way.” Langdon frowned, not entirely liking this answer. He motioned to Sienna and ushered her off to one side, talking to her in hushed tones. “Do you trust him? What do you think?” Sienna looked at Langdon like he was crazy for asking. “What do I think? I think he’s with the World Health Organization! I think he’s our best bet for getting answers!” “And the rash?” Sienna shrugged. “It’s exactly what he says—severe contact dermatitis.” “And if it’s not what he says?” Langdon whispered. “If it’s … something else?” “Something else?” She gave him an incredulous look. “Robert, it’s not the plague, if that’s what you’re asking. He’s a doctor, for heaven’s sake. If he had a deadly disease and knew he was contagious, he wouldn’t be reckless enough to be out infecting the world.” “What if he didn’t realize he had the plague?” Sienna pursed her lips, thinking a moment. “Then I’m afraid you and I are already screwed … along with everyone in the general area.” “You know, your bedside manner could use some work.” “Just being honest.” Sienna handed Langdon the Ziploc bag containing the death mask. “You can carry our little friend.” As the two returned to Dr. Ferris, they could see that he was just ending a quiet phone call. “I just called my driver,” the man said. “He’ll meet us out in front by the—” Dr. Ferris stopped short, staring down at Langdon’s hand and seeing, for the first time, the dead face of Dante Alighieri. “Christ!” Ferris said, recoiling. “What the hell is that?!” “Long story,” Langdon replied. “I’ll explain on the way.” CHAPTER 60 New York editor Jonas Faukman awoke to the sound of his home-office line ringing. He rolled over and checked the clock: 4:28 A.M. In the world of book publishing, late-night emergencies were as rare as overnight success. Unnerved, Faukman slipped out of bed and hurried down the hall into his office. “Hello?” The voice on the line was a familiar deep baritone. “Jonas, thank heaven you’re home. It’s Robert. I hope I didn’t wake you.” “Of course you woke me! It’s four o’clock in the morning!” “Sorry, I’m overseas.” They don’t teach time zones at Harvard? “I’m in some trouble, Jonas, and I need a favor.” Langdon’s voice sounded tense. “It involves your corporate NetJets card.” “NetJets?” Faukman gave an incredulous laugh. “Robert, we’re in book publishing. We don’t have access to private jets.” “We both know you’re lying, my friend.” Faukman sighed. “Okay, let me rephrase that. We don’t have access to private jets for authors of tomes about religious history. If you want to write Fifty Shades of Iconography, we can talk.” “Jonas, whatever the flight costs, I’ll pay you back. You have my word. Have I ever broken a promise to you?” Other than missing your last deadline by three years? Nevertheless Faukman sensed the urgency in Langdon’s tone. “Tell me what’s going on. I’ll try to help.” “I don’t have time to explain, but I really need you to do this for me. It’s a matter of life and death.” Faukman had worked with Langdon long enough to be familiar with his wry sense of humor, but he heard no trace of joking in Langdon’s anxious tone at that moment. The man is dead serious. Faukman exhaled, and made up his mind. My finance manager is going to crucify me. Thirty seconds later, Faukman had written down the details of Langdon’s specific flight request. “Is everything okay?” Langdon asked, apparently sensing his editor’s hesitation and surprise over the details of the flight request. “Yeah, I just thought you were in the States,” Faukman said. “I’m surprised to learn you’re in Italy.” “You and me both,” Langdon said. “Thanks again, Jonas. I’m heading for the airport now.” NetJets’ U.S. operations center is located in Columbus, Ohio, with a flight support team on call around the clock. Owner services representative Deb Kier had just received a call from a corporate fractional owner in New York. “One moment, sir,” she said, adjusting her headset and typing at her terminal. “Technically that would be a NetJets Europe flight, but I can help you with it.” She quickly patched into the NetJets Europe system, centered in Paço de Arcos, Portugal, and checked the current positioning of their jets in and around Italy. “Okay, sir,” she said, “it looks like we have a Citation Excel positioned in Monaco, which we could have routed to Florence in just under an hour. Would that be adequate for Mr. Langdon?” “Let’s hope so,” the man from the publishing company replied, sounding exhausted and a bit annoyed. “We do appreciate it.” “Entirely our pleasure,” Deb said. “And Mr. Langdon would like to fly to Geneva?” “Apparently.” Deb kept typing. “All set,” she finally said. “Mr. Langdon is confirmed out of Tassignano FBO in Lucca, which is about fifty miles west of Florence. He will be departing at eleven-twenty A.M. local time. Mr. Langdon needs to be at the FBO ten minutes before wheels up. You’ve requested no ground transportation, no catering, and you’ve given me his passport information, so we’re all set. Will there be anything else?” “A new job?” he said with a laugh. “Thanks. You’ve been very helpful.” “Our pleasure. Have a nice night.” Deb ended the call and turned back to her screen to complete the reservation. She entered Robert Langdon’s passport information and was about to continue when her screen began flashing a red alert box. Deb read the message, her eyes widening. This must be a mistake. She tried entering Langdon’s passport again. The blinking warning came up again. This same alert would have shown up on any airline computer in the world had Langdon tried to book a flight. Deb Kier stared a long moment in disbelief. She knew NetJets took customer privacy very seriously, and yet this alert trumped all of their corporate privacy regulations. Deb Kier immediately called the authorities. Agent Brüder snapped his mobile phone shut and began herding his men back into the vans. “Langdon’s on the move,” he announced. “He’s taking a private jet to Geneva. Wheels up in just under an hour out of Lucca FBO, fifty miles west. If we move, we can get there before he takes off.” At that same moment a hired Fiat sedan was racing northward along the Via dei Panzani, leaving the Piazza del Duomo behind and making its way toward Florence’s Santa Maria Novella train station. In the backseat, Langdon and Sienna huddled low while Dr. Ferris sat in front with the driver. The reservation with NetJets had been Sienna’s idea. With luck, it would provide enough misdirection to allow the three of them to pass safely through the Florence train station, which undoubtedly would otherwise have been packed with police. Fortunately, Venice was only two hours away by train, and domestic train travel required no passport. Langdon looked to Sienna, who seemed to be studying Dr. Ferris with concern. The man was in obvious pain, his breathing labored, as if it hurt every time he inhaled. I hope she’s right about his ailment, Langdon thought, eyeing the man’s rash and picturing all the germs floating around in the cramped little car. Even his fingertips looked like they were puffy and red. Langdon pushed the concern from his mind and looked out the window. As they approached the train station, they passed the Grand Hotel Baglioni, which often hosted events for an art conference Langdon attended every year. Seeing it, Langdon realized he was about to do something he had never before done in his life. I’m leaving Florence without visiting the David. With quiet apologies to Michelangelo, Langdon turned his eyes to the train station ahead … and his thoughts to Venice. CHAPTER 61 Langdon’s going to Geneva? Dr. Elizabeth Sinskey felt increasingly ill as she rocked groggily in the backseat of the van, which was now racing out of Florence, heading west toward a private airfield outside of the city. Geneva makes no sense, Sinskey told herself. The only relevant connection to Geneva was that it was the site of the WHO’s world headquarters. Is Langdon looking for me there? It seemed nonsensical considering that Langdon knew Sinskey was here in Florence. Another thought now struck her. My God … is Zobrist targeting Geneva? Zobrist was a man who was attuned to symbolism, and creating a “ground zero” at the World Health Organization’s headquarters admittedly had some elegance to it, considering his yearlong battle with Sinskey. Then again, if Zobrist was looking for a receptive flash point for a plague, Geneva was a poor choice. Relative to other metropolises, the city was geographically isolated and was rather cold this time of year. Most plagues took root in overcrowded, warmer environments. Geneva was more than a thousand feet above sea level, and hardly a suitable place to start a pandemic. No matter how much Zobrist despises me.","sourceLink":"https://allnovel.net/inferno-robert-langdon-4/page-36.html","bookId":2415,"book":{"id":2415,"title":"Inferno (Robert Langdon #4)","description":"Storyline: Inferno (Robert Langdon #4) In his international blockbusters The Da Vinci Code, Angels \u0026 Demons, and The Lost Symbol, Dan Brown masterfully fused history, art, codes, and symbols. In this riveting new thriller, Brown returns to his element and has crafted his highest-stakes novel to date. In the heart of Italy, Harvard professor of symbology Robert Langdon is drawn into a harrowing world centered on one of history’s most enduring and mysterious literary masterpieces . . . Dante’s Inferno. Against this backdrop, Langdon battles a chilling adversary and grapples with an ingenious riddle that pulls him into a landscape of classic art, secret passageways, and futuristic science. Drawing from Dante’s dark epic poem, Langdon races to find answers and decide whom to trust . . . before the world is irrevocably altered.","cover":"https://allnovel.net/images/inferno-robert-langdon-4.jpg","author":"Dan Brown","type":"Mystery","source":"allnovel","link":"https://allnovel.net/inferno-robert-langdon-4.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 10:35:34 AM"}}
