{"id":75790,"no":5,"title":"Page 5","content":"My God, Langdon thought. Sienna. That explains a few things.\\n\\n Langdon recalled one of Harvard’s most famous graduates had been a child prodigy named Saul Kripke, who at the age of six had taught himself Hebrew and read all of the works of Descartes by the age of twelve. More recently, Langdon recalled reading about a young phenom named Moshe Kai Cavalin, who, at age eleven, had earned a college degree with a 4.0 grade-point average and won a national title in martial arts, and, at fourteen, published a book titled We Can Do.\\n\\n Langdon picked up another press clipping, a newspaper article with a photo of Sienna at age seven: CHILD GENIUS DISPLAYS 208 IQ.\\n\\n Langdon had been unaware that IQs even went that high. According to the article, Sienna Brooks was a virtuoso violinist, could master a new language in a month, and was teaching herself anatomy and physiology.\\n\\n He looked at another clipping from a medical journal: THE FUTURE OF THOUGHT: NOT ALL MINDS ARE CREATED EQUAL.\\n\\n This article had a photo of Sienna, now maybe ten years old, still a towhead, standing beside a large piece of medical apparatus. The article contained an interview with a doctor, who explained that PET scans of Sienna’s cerebellum revealed that it was physically different from other cerebella, in her case a larger, more streamlined organ capable of manipulating visual-spatial content in ways that most human beings could not begin to fathom. The doctor equated Sienna’s physiological advantage to an unusually accelerated cellular growth in her brain, much like a cancer, except that it accelerated growth of beneficial brain tissue rather than dangerous cancer cells.\\n\\n Langdon found a clipping from a small-town newspaper.\\n\\n THE CURSE OF BRILLIANCE.\\n\\n There was no photo this time, but the story told of a young genius, Sienna Brooks, who had tried to attend regular schools but was teased by other students because she didn’t fit in. It talked about the isolation felt by gifted young people whose social skills could not keep up with their intellects and who were often ostracized.\\n\\n Sienna, according to this article, had run away from home at the age of eight, and had been smart enough to live on her own undiscovered for ten days. She had been found in an upscale London hotel, where she had pretended to be the daughter of a guest, stolen a key, and was ordering room service on someone else’s account. Apparently she had spent the week reading all 1,600 pages of Gray’s Anatomy. When authorities asked why she was reading medical texts, she told them she wanted to figure out what was wrong with her brain.\\n\\n Langdon’s heart went out to the little girl. He couldn’t imagine how lonely it must be for a child to be so profoundly different. He refolded the articles, pausing for one last look at the photo of the five-year-old Sienna in the role of Puck. Langdon had to admit, considering the surreal quality of his encounter with Sienna this morning, that her role as the mischievous, dream-inducing sprite seemed strangely apt. Langdon only wished that he, like the characters in the play, could now simply wake up and pretend that his most recent experiences were all a dream.\\n\\n Langdon carefully replaced all the clippings on the proper page and closed the playbill, feeling an unexpected melancholy as he again saw the note on the cover: Sweetheart, never forget you’re a miracle.\\n\\n His eyes moved down to the familiar symbol adorning the cover of the playbill. It was the same early Greek pictogram that adorned most playbills around the world—a 2,500-year-old symbol that had become synonymous with dramatic theater.\\n\\n Le maschere.\\n\\n Langdon looked at the iconic faces of Comedy and Tragedy gazing up at him, and suddenly he heard a strange humming in his ears—as if a wire were slowly being pulled taut inside his mind. A stab of pain erupted inside his skull. Visions of a mask floated before his eyes. Langdon gasped and raised his hands, sitting down in the desk chair and closing his eyes tightly, clutching at his scalp.\\n\\n In his darkness, the bizarre visions returned with a fury … stark and vivid.\\n\\n The silver-haired woman with the amulet was calling to him again from across a bloodred river. Her shouts of desperation pierced the putrid air, clearly audible over the sounds of the tortured and dying, who thrashed in agony as far as the eye could see. Langdon again saw the upside-down legs adorned with the letter R, the half-buried body pedaling its legs in wild desperation in the air.\\n\\n Seek and find! the woman called to Langdon. Time is running out!\\n\\n Langdon again felt the overwhelming need to help her … to help everyone. Frantic, he shouted back to her across the bloodred river. Who are you?!\\n\\n Once again, the woman reached up and lifted her veil to reveal the same striking visage that Langdon had seen earlier.\\n\\n I am life, she said.\\n\\n Without warning, a colossal image materialized in the sky above her—a fearsome mask with a long, beaklike nose and two fiery green eyes, which stared blankly out at Langdon.\\n\\n And … I am death, the voice boomed.\\n\\n CHAPTER 8\\n\\n Langdon’s eyes shot open, and he drew a startled breath. He was still seated at Sienna’s desk, head in his hands, heart pounding wildly.\\n\\n What the hell is happening to me?\\n\\n The images of the silver-haired woman and the beaked mask lingered in his mind. I am life. I am death. He tried to shake the vision, but it felt seared permanently into his mind. On the desk before him, the playbill’s two masks stared up at him.\\n\\n Your memories will be muddled and uncataloged, Sienna had told him. Past, present, and imagination all mixed together.\\n\\n Langdon felt dizzy.\\n\\n Somewhere in the apartment, a phone was ringing. It was a piercing, old-fashioned ring, coming from the kitchen.\\n\\n “Sienna?!” Langdon called out, standing up.\\n\\n No response. She had not yet returned. After only two rings, an answering machine picked up.\\n\\n “Ciao, sono io,” Sienna’s voice happily declared on her outgoing message. “Lasciatemi un messaggio e vi richiamerò.”\\n\\n There was a beep, and a panicked woman began leaving a message in a thick Eastern European accent. Her voice echoed down the hall.\\n\\n “Sienna, eez Danikova! Where you?! Eez terrible! Your friend Dr. Marconi, he dead! Hospital going craaazy! Police come here! People telling them you running out trying to save patient?! Why!? You don’t know him! Now police want to talk to you! They take employee file! I know information wrong—bad address, no numbers, fake working visa—so they no find you today, but soon they find! I try to warn you. So sorry, Sienna.”\\n\\n The call ended.\\n\\n Langdon felt a fresh wave of remorse engulfing him. From the sounds of the message, Dr. Marconi had been permitting Sienna to work at the hospital. Now Langdon’s presence had cost Marconi his life, and Sienna’s instinct to save a stranger had dire implications for her future.\\n\\n Just then a door closed loudly at the far end of the apartment.\\n\\n She’s back.\\n\\n A moment later, the answering machine blared. “Sienna, eez Danikova! Where you?!”\\n\\n Langdon winced, knowing what Sienna was about to hear. As the message played, Langdon quickly put away the playbill, neatening the desk. Then he slipped back across the hall into the bathroom, feeling uncomfortable about his glimpse into Sienna’s past.\\n\\n Ten seconds later, there was a soft knock on the bathroom door.\\n\\n “I’ll leave your clothes on the doorknob,” Sienna said, her voice ragged with emotion.\\n\\n “Thank you so much,” Langdon replied.\\n\\n “When you’re done, please come out to the kitchen,” she added. “There’s something important I need to show you before we call anyone.”\\n\\n Sienna walked tiredly down the hall to the apartment’s modest bedroom. Retrieving a pair of blue jeans and a sweater from the dresser, she carried them into her bathroom.\\n\\n Locking her eyes with her own reflection in the mirror, she reached up, grabbed a clutch of her thick blond ponytail, and pulled down hard, sliding the wig from her bald scalp.\\n\\n A hairless thirty-two-year-old woman stared back at her from the mirror.\\n\\n Sienna had endured no shortage of challenges in her life, and although she had trained herself to rely on intellect to overcome hardship, her current predicament had shaken her on a deeply emotional level.\\n\\n She set the wig aside and washed her face and hands. After drying off, she changed her clothes and put the wig back on, straightening it carefully. Self-pity was an impulse Sienna seldom tolerated, but now, as the tears welled up from deep within, she knew she had no choice but to let them come.\\n\\n And so she did.\\n\\n She cried for the life she could not control.\\n\\n She cried for the mentor who had died before her eyes.\\n\\n She cried for the profound loneliness that filled her heart.\\n\\n But, above all, she cried for the future … which suddenly felt so uncertain.\\n\\n CHAPTER 9\\n\\n Belowdecks on the luxury vessel The Mendacium, facilitator Laurence Knowlton sat in his sealed glass cubicle and stared in disbelief at his computer monitor, having just previewed the video their client had left behind.\\n\\n I’m supposed to upload this to the media tomorrow morning?\\n\\n In his ten years with the Consortium, Knowlton had performed all kinds of strange tasks that he knew fell somewhere between dishonest and illegal. Working within a moral gray area was commonplace at the Consortium—an organization whose lone ethical high ground was that they would do whatever it took to keep a promise to a client.\\n\\n We follow through. No questions asked. No matter what.\\n\\n The prospect of uploading this video, however, had left Knowlton unsettled. In the past, no matter what bizarre tasks he had performed, he always understood the rationale … grasped the motives … comprehended the desired outcome.\\n\\n And yet this video was baffling.\\n\\n Something about it felt different.\\n\\n Much different.\\n\\n Sitting back down at his computer, Knowlton restarted the video file, hoping a second viewing might shed more light. He turned up the volume and settled in for the nine-minute show.\\n\\n As before, the video began with the soft lapping of water in the eerie water-filled cavern where everything was bathed in a numinous red light. Again the camera plunged down through the surface of the illuminated water to view the silt-covered floor of the cavern. And again, Knowlton read the text on the submerged plaque:\\n\\n IN THIS PLACE, ON THIS DATE, THE WORLD WAS CHANGED FOREVER.\\n\\n That the polished plaque was signed by the Consortium’s client was disquieting. That the date was tomorrow … left Knowlton increasingly concerned. It was what followed, however, that had truly set Knowlton on edge.\\n\\n The camera now panned to the left to reveal a startling object hovering underwater just beside the plaque.\\n\\n Here, tethered to the floor by a short filament, was an undulating sphere of thin plastic. Delicate and wobbling like an oversize soap bubble, the transparent shape floated like an underwater balloon … inflated not with helium, but with some kind of gelatinous, yellow-brown liquid. The amorphous bag was distended and appeared to be about a foot in diameter, and within its transparent walls, the murky cloud of liquid seemed to swirl slowly, like the eye of a silently growing storm.\\n\\n Jesus, Knowlton thought, feeling clammy. The suspended bag looked even more ominous the second time around.\\n\\n Slowly, the image faded to black.\\n\\n A new image appeared—the cavern’s damp wall, dancing with the rippling reflections of the illuminated lagoon. On the wall, a shadow appeared … the shadow of a man … standing in the cavern.\\n\\n But the man’s head was misshapen … badly.\\n\\n Instead of a nose, the man had a long beak … as if he were half bird.\\n\\n When he spoke, his voice was muffled … and he spoke with an eerie eloquence … a measured cadence … as if he were the narrator in some kind of classical chorus.\\n\\n Knowlton sat motionless, barely breathing, as the beaked shadow spoke.\\n\\n I am the Shade.\\n\\n If you are watching this, then it means my soul is finally at rest.\\n\\n Driven underground, I must speak to the world from deep within the earth, exiled to this gloomy cavern where the bloodred waters collect in the lagoon that reflects no stars.\\n\\n But this is my paradise … the perfect womb for my fragile child.\\n\\n Inferno.\\n\\n Soon you will know what I have left behind.\\n\\n And yet, even here, I sense the footfalls of the ignorant souls who pursue me … willing to stop at nothing to thwart my actions.\\n\\n Forgive them, you might say, for they know not what they do. But there comes a moment in history when ignorance is no longer a forgivable offense … a moment when only wisdom has the power to absolve.\\n\\n With purity of conscience, I have bequeathed to you all the gift of Hope, of salvation, of tomorrow.\\n\\n And yet still there are those who hunt me like a dog, fueled by the self-righteous belief that I am a madman. There is the silver-haired beauty who dares call me monster! Like the blind clerics who lobbied for the death of Copernicus, she scorns me as a demon, terrified that I have glimpsed the Truth.\\n\\n But I am not a prophet.\\n\\n I am your salvation.\\n\\n I am the Shade.\\n\\n CHAPTER 10\\n\\n “Have a seat,” Sienna said. “I have some questions for you.”\\n\\n As Langdon entered the kitchen, he felt much steadier on his feet. He was wearing the neighbor’s Brioni suit, which fit remarkably well. Even the loafers were comfortable, and Langdon made a mental note to switch to Italian footwear when he got home.\\n\\n If I get home, he thought.\\n\\n Sienna was transformed—a natural beauty—having changed into formfitting jeans and a cream-colored sweater, both of which complemented her lithe figure. Her hair was still pulled back in a ponytail, and without the authoritative air of medical scrubs, she seemed more vulnerable somehow. Langdon noticed her eyes were red, as if she had been crying, and an overwhelming guilt again gripped him.\\n\\n “Sienna, I’m so sorry. I heard the phone message. I don’t know what to say.”\\n\\n “Thanks,” she replied. “But we need to focus on you at the moment. Please sit down.”\\n\\n Her tone was firmer now, conjuring memories of the articles Langdon had just read about her intellect and precocious childhood.\\n\\n “I need you to think,” Sienna said, motioning for him to sit. “Can you remember how we got to this apartment?” \\n\\n","sourceLink":"https://allnovel.net/inferno-robert-langdon-4/page-5.html","bookId":2415,"book":{"id":2415,"title":"Inferno (Robert Langdon #4)","description":"Storyline: Inferno (Robert Langdon #4) \\n In his international blockbusters The Da Vinci Code, Angels \u0026 Demons, and The Lost Symbol, Dan Brown masterfully fused history, art, codes, and symbols. In this riveting new thriller, Brown returns to his element and has crafted his highest-stakes novel to date. \\n In the heart of Italy, Harvard professor of symbology Robert Langdon is drawn into a harrowing world centered on one of history’s most enduring and mysterious literary masterpieces . . . Dante’s Inferno. \\n Against this backdrop, Langdon battles a chilling adversary and grapples with an ingenious riddle that pulls him into a landscape of classic art, secret passageways, and futuristic science. Drawing from Dante’s dark epic poem, Langdon races to find answers and decide whom to trust . . . before the world is irrevocably altered.\\n","cover":"https://allnovel.net/images/inferno-robert-langdon-4.jpg","author":"Dan Brown","type":"Mystery","source":"allnovel","link":"https://allnovel.net/inferno-robert-langdon-4.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 10:35:34 AM"}}
