{"id":74886,"no":11,"title":"Page 11","content":"\"Still testing, but so far they check out. Cables rigged to spec.\" \"You\u0027ll finish when?\" \"End of first shift today.\" \"Electrical?\" Ron said, \"We\u0027ve checked the principal wiring pathways. Nothing yet. I think we should schedule a CET on the entire aircraft.\" \"I agree. Can we run it overnight to save time?\" Ron shrugged. \"Sure. It\u0027s expensive, but - \" \"The hell with expense. Anything else?\" \"Well, there\u0027s one funny thing, yes,\" Ron said. \"The DEU faults indicate there may have been a problem with proximity sensors in the wing. If the sensors failed, we might get a slats misread in the cockpit.\" This was what Casey had noticed the night before. She made a note to ask Ron about it later. And also the matter of the AUX readings on the printout. Her mind drifted again, thinking of the raise. Allison could go to a real school, now. She saw her at a low desk, in a small classroom - Marder said: \"Powerplant?\" \"We\u0027re still not sure he deployed the thrust reversers,\" Kenny Burne said. \"It\u0027ll be another day.\" \"Go until you can rule it out. Avionics?\" Trung said, \"Avionics check out so far.\" \"This autopilot thing...\" \"Haven\u0027t gotten to autopilot yet. It\u0027s the last thing in the sequence that we confirm. We\u0027ll know by Flight Test.\" \"All right,\" Marder said. \"So: new question regarding proximity sensors, check that today. Still waiting on flight recorder, powerplant, avionics. That cover it?\" Everyone nodded. \"Don\u0027t let me keep you,\" Marder said. \"I need answers.\" He held up the JAA fax. \"This is the tip of the iceberg, people. I don\u0027t have to remind you what happened to the DC-10. Most advanced aircraft of its time, a marvel of engineering. But it had a couple of incidents, and some bad visuals, and bang - the DC-10\u0027s history. History. So get me those answers!\" NORTON AIRCRAFT 9:31 A.M. Walking across the plant toward Hangar 5, Richman said, \"Marder seemed pretty worked up, didn\u0027t he? Does he believe all that?\" \"About the DC-10? Yes. One crash finished the aircraft.\" \"What crash?\" \"It was an American Airlines flight from Chicago to LA,\" Casey said. \"May, 1979. Nice day, good weather. Right after takeoff the left engine fell off the wing. The plane stalled and crashed next to the airport, killing everybody on board. Very dramatic, it was all over in thirty seconds. A couple of people taped the flight, so the networks had film at eleven. The media went crazy, called the plane a winged coffin. Travel agents were flooded with calls canceling DC-10 bookings. Douglas never sold another one of them.\" \"Why did the engine fall off?\" \"Bad maintenance,\" Casey said. \"American hadn\u0027t followed Douglas\u0027s instructions on how to remove the engines from the plane. Douglas told them to first remove the engine, and then the pylon that holds the engine to the wing. But to save time, American took the whole engine-pylon assembly off at once. That\u0027s seven tons of metal on a forklift. One fork-lift ran out of gas during the removal, and cracked the pylon. But the crack wasn\u0027t noticed, and eventually the engine fell off the wing. So it was all because of maintenance.\" \"Maybe so,\" Richman said, \"but isn\u0027t an airplane still supposed to fly, even missing an engine?\" \"Yes, it is,\" Casey said. \"The DC-10 was built to survive that kind of failure. The plane was perfectly airworthy. If the pilot had maintained airspeed, he\u0027d have been fine. He could have landed the plane.\" \"Why didn\u0027t he?\" \"Because, as usual, there was an event cascade leading to the final accident,\" Casey said. \"In this case, electrical power to the captain\u0027s cockpit controls came from the left engine. When the left engine fell off, the captain\u0027s instruments were shut off, including the cockpit stall warning and the backup warning, called a stick shaker. That\u0027s a device that shakes the stick to tell the pilot the plane is about to stall. The first officer still had power and instruments, so the first officer\u0027s chair didn\u0027t have a stick shaker. It\u0027s a customer option for the first officer, and American hadn\u0027t ordered it. And Douglas hadn\u0027t built any redundancy into their cockpit-stall warning system. So when the DC-10 began to stall, the first officer didn\u0027t realize he had to increase throttle.\" \"Okay,\" Richman said, \"but the captain shouldn\u0027t have lost his power in the first place.\" \"No, that was a designed-in safety feature,\" Casey said. \"Douglas had designed and built the aircraft to survive those failures. When the left engine tore off, the aircraft deliberately shut down the captain\u0027s power line, to prevent further shorts in the system. Remember, all aircraft systems are redundant. If one fails, the backup kicks in. And it was easy to get the captain\u0027s instrumentation back again; all the flight engineer had to do was trip a relay, or turn on emergency power. But he didn\u0027t do either one.\" \"Why not?\u0027 \"No one knows,\" Casey said. \"And the first officer, lacking the necessary information on his display, intentionally reduced his airspeed, which caused the plane to stall and crash.\" They were silent for a moment, walking. \"Consider all the ways this might have been avoided,\" Casey said. \"The maintenance crews could have checked the pylons for structural damage after servicing them improperly. But they didn\u0027t. Continental had already cracked two pylons using forklifts, and they could have told American the procedure was dangerous. But they didn\u0027t. Douglas had told American about Continental\u0027s problems, but American didn\u0027t pay any attention.\" Richman was shaking his head. \"And after the accident, Douglas couldn\u0027t say it was a maintenance problem, because American was a valued customer. So Douglas wasn\u0027t going to put the story out. In all these incidents, it\u0027s always the same story - the story never gets out unless the media digs it out. But the story\u0027s complicated, and that\u0027s difficult for television ... so they just run the tape. The tape of the accident which shows the left engine falling off, the plane veering left, and crashing. The visual implies the aircraft was poorly designed, that Douglas hadn\u0027t anticipated a pylon failure and hadn\u0027t built the plane to survive it. Which was completely inaccurate. But Douglas never sold another DC-10.\" \"Well,\" Richman said. \"I don\u0027t think you can blame the media for that. They don\u0027t make the news. They just report it.\" \"That\u0027s my point,\" Casey said. \"They didn\u0027t report it, they just ran the film. The Chicago crash was a kind of turning point in our industry. The first time a good aircraft was destroyed by bad press. The coup de grace was the NTSB report. It came out on December 21. Nobody paid any attention. \"So now, when Boeing introduces their new 777, they arrange a complete press campaign to coincide with the launch. They allow a TV company to film the years of development, and at the end there\u0027s a six-part show on public television. There\u0027s a book to go with it. They\u0027ve done everything they can think of to create a good image for the plane in advance. Because the stakes are too high.\" Richman walked along beside her. \"I can\u0027t believe the media has that much power,\" he said. Casey shook her head. \"Marder is right to be worried,\" she said. \"If anybody in the media gets onto Flight 545, then the N-22 will have had two incidents in two days. And we\u0027re in big trouble.\" NEWSLINE/NEW YORK 1:54 P.M. In midtown Manhattan, in the twenty-third-floor offices of the weekly news show Newsline, Jennifer Malone was in the editing bay, reviewing tape of an interview with Charles Manson. Her assistant Deborah walked in, dropped a fax on her desk, and said casually, \"Pacino dumped.\" Jennifer hit her pause button. \"What?\" \"Al Pacino just dumped.\" \"When?\" \u0027Ten minutes ago. Blew Marty off, and walked.\" \"What? We shot four days of B-roll on the set in Tangier. His picture opens this weekend - and he\u0027s slated for the full twelve.\" A twelve minute segment on Newsline, the most-watched news show on television, was the kind of publicity that money couldn\u0027t buy. Every star in Hollywood wanted on the show. \"What happened?\" \"Marty was chatting with him during makeup, and mentioned that Pacino hadn\u0027t had a hit in four years. And I guess he got offended, and walked.\" \"On camera?\" \"No. Before.\" \"Jesus,\" Jennifer said. \"Pacino can\u0027t do that. His contract calls for him to do publicity. This was set up months ago.\" \"Yeah, well. He did.\" \"What\u0027s Marty say?\" \"Marty is pissed. Marty is saying, What did he expect, this is a news show, we ask hard-hitting questions. You know, typical Marty.\" Jennifer swore. \"This was just what everyone was worried about.\" Marty Reardon was a notoriously abrasive interviewer. Although he had left the news division to work on Newsline - at a much higher salary - two years before, he still viewed himself as a hard-hitting newsman, tough but fair, no-holds-barred - though in practice he liked to embarrass interviewees, putting them on the spot with intensely personal questions, even if the questions weren\u0027t relevant to the story. Nobody wanted to use Marty on the Pacino shoot, because he didn\u0027t like celebrities, and didn\u0027t like doing \"puff pieces.\" But Frances, who usually did the celeb pieces, was in Tokyo interviewing the princess. \"Has Dick talked to Marty? Can we salvage this?\" Dick Shenk was the executive producer of Newsline. In just three years, he had skillfully built the show from a throwaway summer replacement, into a solid prime-time success. Shenk made all the important decisions, and he was the only person with enough clout to handle a prima donna like Marty. \"Dick is still at lunch with Mr. Early.\" Shenk\u0027s lunches with Early, the president of the network, always lasted late into the afternoon. \"So Dick doesn\u0027t know?\" \"Not yet.\" \"Great,\" Jennifer said. She glanced at her watch: it was 2 P.M. If Pacino had dumped, they had a twelve-minute hole to fill, and less than seventy-two hours to do it. \"What\u0027ve we got in the can?\" \"Nothing. Mother Teresa\u0027s being recut. Mickey Mantle isn\u0027t in yet. All we have is that wheelchair Little League segment.\" Jennifer groaned. \"Dick will never go with that.\" \"I know,\" Deborah said. \"It sucks.\" Jennifer picked up the fax her assistant had dropped on the console. It was a press release from some PR group, one of hundreds that every news show received each day. Like all such faxes, this one was formatted to look like a breaking news story, complete with a headline at the top. It said: JAA DELAYS CERTIFICATION OF N-22 WIDEBODY JET CITING CONTINUED AIRWORTHINESS CONCERNS \"What\u0027s this?\" she said, frowning. \"Hector said give it to you.\" \"Why?\" \"He thought there might be something in it.\" \"Why? What the fuck\u0027s the JAA?\" Jennifer scanned the text; it was a lot of aerospace babble, dense and impenetrable. She thought: No visuals. \"Apparently,\" Deborah said, \"it\u0027s the same plane that caught fire in Miami.\" \"Oh. Hector wants to do a safety segment? Good luck. Everybody\u0027s seen the tape of the burning plane already. And it wasn\u0027t that good to begin with.\" Jennifer tossed the fax aside. \"Ask him if he has anything else.\" Deborah went away. Alone, Jennifer stared at the frozen image of Charles Manson on the screen in front of her. Then she clicked the image off, and decided to take a moment to think. Jennifer Malone was twenty-nine years old, the youngest segment producer in the history of Newsline. She had advanced quickly because she was good at her job. She had shown talent early; while still an undergraduate at Brown, working as a summer intern like Deborah, she had done research late into the night, hammering away at the Nexis terminals, combing the wire services. Then, with her heart in her mouth, she had gone in to see Dick Shenk, to propose a story about this strange new virus in Africa, and the brave CDC doctor on the scene. That led to the famous Ebola segment, the biggest Newsline break of the year, and another Peabody Award for Dick Shenk\u0027s Wall of Fame. In short order, she had followed with the Darryl Strawberry segment, the Montana strip-mining segment, and the Iroquois gambling segment. No college intern in memory had ever gotten a segment on air before; Jennifer had four. Shenk announced he liked her spunk, and offered her a job. The fact that she was bright, beautiful, and an Ivy Leaguer did not hurt, either. The following June, when she graduated, she went to work for Newsline. The show had fifteen producers doing segments. Each was assigned to one of the on-camera talent; each was expected to deliver a story every two weeks. The average story took four weeks to build. After two weeks of research, producers met with Dick, to get the go-ahead. Then they visited the locations, shot B-roll for background, and did the secondary interviews. The story was shaped by the producer, and narrated by the on-air star, who flew in for a single day, did the stand-ups and the major interviews, and then flew on to the next shoot, leaving the producer to cut the tape. Sometime before air, the star would come into the studio, read the script the producer had prepared, and do the voice-overs for visuals. When the segment finally aired, the on-camera star would come off as a real reporter: Newsline jealously protected the reputations of its stars. But in fact the producers were the real reporters. The producers picked the stories, researched and shaped them, wrote the scripts and cut the tape. The on-camera talent just did as they were told. It was a system Jennifer liked. She had considerable power, and she liked working behind the scenes, her name unknown. She found the anonymity useful. Often, when she conducted interviews, she would be treated as a flunky, the interviewees speaking freely, even though tape was rolling. At some point, the interviewee would say, \"When will I get to meet Marty Reardon?\" She would solemnly answer that that hadn\u0027t been decided yet, and continue with her questions. And in the process, nail the stupid bozo who thought she was just a dress rehearsal. The fact was, she made the story. She didn\u0027t care if the stars got the credit. \"We never say they do the reporting,\" Shenk would intone. \"We never imply they are interviewing someone they didn\u0027t actually interview. On this show, the talent is not the star. The star is the story. The talent is just a guide - leading the audience through the story. The talent is someone they trust, someone they\u0027re comfortable inviting into their home.\" That was true, she thought. And anyway, there wasn\u0027t time to do it any other way. A media star like Marty Reardon was more heavily booked than the president, and arguably more famous, more recognizable on the street. You couldn\u0027t expect a person like Marty to waste his valuable time doing spade-work, stumbling over false leads, putting together a story. There just wasn\u0027t time. This was television: there was never enough time. She looked again at her watch. Dick wouldn\u0027t return from lunch until three or three-thirty. Marty Reardon was not going to apologize to Al Pacino. So when Dick came back from lunch, he was going to blow his top, rip Reardon a new one - and then be desperate for a package to fill the hole. Jennifer had an hour to find him one. She turned on her TV, and started idly flipping channels. And she looked again at the fax on her desk. JAA DELAYS CERTIFICATION OF N-22 WIDEBODY JET CITING CONTINUED AIRWORTHINESS CONCERNS Wait a minute, she thought. Continued airworthiness concerns? Did that mean an ongoing safety problem? If so, there might be a story here. Not air safety - that had been done a million times. Those endless stories about air traffic control, how they were using 1960s computers, how outdated and risky the system was. Stories like mat just made people anxious. The audience couldn\u0027t relate because there was nothing they could do about it. But a specific aircraft with a problem? That was a product safety story. Don\u0027t buy this product. Don\u0027t fly this airplane. That might be very, very effective, she thought. She picked up the phone and dialed. HANGAR 5 11:15 A.M. Casey found Ron Smith with his head in the forward accessory compartment, just back of the nose wheel. All around him, his electrical team was hard at work. \"Ron,\" she said, \"tell me about this fault list.\" She had brought the list with her, all ten pages. \"What about it?\" \"There\u0027s four AUX readings here. Lines one, two, three, and COA. What do they service?\" \"Is this important?\" \"That\u0027s what I\u0027m trying to determine.\" \"Well.\" Ron sighed. \"AUX 1 is the auxiliary power generator, the turbine in the tail. AUX 2 and AUX 3 are redundant lines, in case the system gets an upgrade and needs them later. AUX COA is an auxiliary line for Customer Optional Additions. That\u0027s the line for customer add-ons, like a QAR. Which this plane doesn\u0027t have.\" Casey said, \"These lines are registering a zero value. Does that mean they\u0027re being used?\" \"Not necessarily. The default is zero, so you\u0027d have to check them.\" \"Okay.\" She folded up the data sheets. \"And what about the proximity sensor faults?\" \"We\u0027re doing that now. We may turn up something. But look. The fault readings are snapshots of a moment in time. We\u0027ll never figure out what happened to this flight with snapshots. We need the DFDR data. You\u0027ve got to get it for us, Casey.\" \"I\u0027ve been pushing Rob Wong...\" \"Push him harder,\" Smith said. \"The flight recorder is the key.\" From the back of the airplane, she heard a pained shout \"Fuck a hairy duck! I don\u0027t believe this!\" It had come from Kenny Burne. He was standing on a platform behind the left engine, waving his arms angrily. The other engineers around him were shaking their heads. Casey went over. \"You found something?\" \"Let me count the ways,\" Bume said, pointing to the engine. \"First off, the coolant seals are installed wrong. Some maintenance idiot put them in backward.\" \"Affecting flight?\u0027 \"Sooner or later, yeah. But that\u0027s not all. Take a look at this inboard cowl on the reversers.\" Casey climbed the scaffolding to the back of the engine, where the engineers were peering inside the open cowls of the thrust reversers. \"Show her, guys,\" Burne said. They shone a work light on the interior surface of one cowl. Casey saw a solid steel surface, precisely curved, covered with fine soot from the engine. They held the light close to the Pratt and Whitney logo, which was embossed near the leading edge of the metal sleeve. \"See it?\" Kenny said. \"What? You mean the parts stamp?\" Casey said. The Pratt and Whitney logo was a circle with an eagle inside it, and the letters P and W. \"That\u0027s right. The stamp.\" \"What about it?\" Burne shook his head. \"Casey,\" he said. \"The eagle is backward. It\u0027s facing the wrong way.\" \"Oh.\" She hadn\u0027t noticed that. \"Now, do you think Pratt and Whitney put their eagle on backward? No way. This is a goddamn counterfeit part, Casey.\" \"Okay,\" she said. \"But did it affect flight?\" That was the critical point. They\u0027d already found counterfeit parts on the plane. Amos had said there would be more, and he was undoubtedly right. But the question was, Did any of them affect the behavior of the plane during the accident? \"Could have,\" Kenny said, stomping around. \"But I can\u0027t tear down this engine, for Chrissakes. That\u0027d be two weeks right there.\" \"Then how will we find out?\u0027 \"We need that flight recorder, Casey. We\u0027ve got to have that data.\" Richman said, \"You want me to go over to Digital? See how Wong is coming?\" \"No,\" Casey said. \"It won\u0027t do any good.\" Rob Wong could be temperamental. Putting more pressure on him wouldn\u0027t accomplish anything; he was likely to walk out, and not return for two days. Her cell phone rang. It was Norma. \"It\u0027s starting,\" she said. \"You got calls from Jack Rogers, from Barry Jordan at the LA Times, from somebody named Winslow at the Washington Post. And a request for background material on the N-22, from Newsline.\" \"Newsline? That TV show?\" \"Yeah.\" \"They doing a story?\" \"I don\u0027t think so,\" Norma said. \"It sounded like a fishing expedition.\" \"Okay,\" Casey said. \"I\u0027ll call you back.\" She sat down in a corner of the hangar and took out her notepad. She began to write out a list of documents to be included in a press package. Summary of FAA certification procedures for new aircraft. Announcement of FAA certification of the N-22; Norma would have to dig that up from five years ago. Last year\u0027s FAA report on aircraft safety. The company\u0027s internal report on N-22 safety in flight from 1991 to present - the record was outstanding. The annual updated history of die N-22. The list of ADs issued for the aircraft to date - there were very few. The one-sheet features summary on the plane, basic stats on speed and range, size and weight. She didn\u0027t want to send too much. But that would cover the bases. Richman was watching her. \"What now?\" he said. She tore off the sheet, gave it to him. \"Give this to Norma. Tell her to prepare a press packet, and send it to whoever asks for it.\" \"Okay.\" He stared at the list. \"I\u0027m not sure I can read - \" \"Norma will know. Just give it to her.\" \"Okay.\" Richman walked away, humming cheerfully. Her phone rang. It was Jack Rogers, calling her directly. \"I keep hearing the wing\u0027s being offset. I\u0027m told Norton is shipping the tools to Korea, but they\u0027re going to be transshipped from there to Shanghai.\" \"Did Marder talk to you?\" \"No. We\u0027ve traded calls.\" \u0027Talk to him,\" Casey said, \"before you do anything.\" \"Will Marder go on the record?\" \"Just talk to him.\" \"Okay,\" Rogers said. \"But he\u0027ll deny it, right?\" \u0027Talk to him.\" Rogers sighed. \"Look, Casey. I don\u0027t want to sit on a story that I\u0027ve got right - and then read it two days from now in the LA Times. Help me out, here. Is there anything to the wing tooling story, or not?\u0027 \"I can\u0027t say anything.\" \u0027Tell you what,\" Rogers said. \"If I were to write that several high-level Norton sources deny the wing is going to China, I assume you wouldn\u0027t have a problem with that?\" \"I wouldn\u0027t, no.\" A careful answer, but then it was a careful question. \"Okay, Casey. Thanks. I\u0027ll call Marder.\" He hung up. NEWSLINE 2:25 P,M. Jennifer Malone dialed the number on the fax, and asked for the contact: Alan Price. Mr. Price was still at lunch, and she spoke to his assistant, Ms. Weld. \"I understand there\u0027s a delay in European certification of the Norton aircraft. What\u0027s the problem?\u0027 \"You mean the N-22?\" \"That\u0027s right.\" \"Well, this is a contentious issue, so I\u0027d prefer to go off the record.\" \"How far off?\" \"Background.\" \"Okay.\" \"In the past, the Europeans accepted FAA certification of a new aircraft, because that certification was thought to be very rigorous. But lately JAA has been questioning the U.S. certification process. They feel that the American agency, the FAA, is in bed with the American manufacturers, and may have relaxed its standards.\" \"Really?\" Perfect, Jennifer thought. Inept American bureaucracy. Dick Shenk loved those stories. And the FAA had been under attack for years; there must be plenty of skeletons there. \"What\" s the evidence?\" she asked. \"Well, the Europeans find the whole system unsatisfactory. For example, the FAA doesn\u0027t even store certification documents. They allow the aircraft companies to do that It seems entirely too cozy.\" \"Uh-huh.\" She wrote: - FAA in bed with mfrs. Corrupt! \"Anyway,\" the woman said, \"if you want more information, I suggest you call the JAA directly, or maybe Airbus. I can give you the numbers.\" She called the FAA instead. She got put through to their public affairs office, a man named Wilson. \"I understand the JAA is refusing to validate certification of the Norton N-22.\" \"Yes,\" Wilson said. \"They\u0027ve been dragging their feet for a while now.\" \"The FAA has already certified the N-22?\" \"Oh sure. You can\u0027t build an airplane in this country without FAA approval and certification of the design and manufacturing process from start to finish.\" \"And do you have the certification documents?\" \"No. They\u0027re kept by the manufacturer. Norton has them.\" Ah-ha, she thought. So it was true. - Norton keeps certification, not FAA. - Fox guarding chicken coop? \"Does it bother you that Norton holds the documentation?\" \"No, not at all.\" \"And you\u0027re satisfied that the certification process was proper?\" \"Oh sure. And like I said, the plane was certified five years ago.\" \"I\u0027ve been hearing that the Europeans are dissatisfied with the entire process of certification.\" \"Well, you know,\" Wilson said, adopting a diplomatic tone, \"the JAA\u0027s a relatively new organization. Unlike the FAA, they have no statutory authority. So, I think they\u0027re still trying to decide how they want to proceed.\" She called the information office for Airbus Industries in Washington, and got put through to a marketing guy named Samuelson. He reluctantly confirmed that he had heard of the JAA confirmation delays, though he didn\u0027t have any details. \"But Norton\u0027s having a lot of problems these days,\" he said. \"For example, I think the China sale is not as firm as they pretend it is.\" This was the first she had heard of a China sale. She wrote:","sourceLink":"https://allnovel.net/airframe/page-11.html","bookId":2409,"book":{"id":2409,"title":"Airframe","description":"Storyline: The twin jet plane en route to Denver from Hong Kong is merely a green radar blip half an hour off the California coast when the call comes through to air traffic control: \u0027Socal Approach, this is TransPacific 545. We have an emergency.\u0027 The pilot requests priority clearance to land - then comes the bombshell - he needs forty ambulances on the runway. But nothing prepares the rescue workers for the carnage they witness when they enter the plane. Ninety-four passengers are injured. Three dead. The interior cabin virtually destroyed. What happened on board Flight TPA 545?","cover":"https://allnovel.net/images/airframe.jpg","author":"Michael Crichton","type":"Mystery","source":"allnovel","link":"https://allnovel.net/airframe.html","creation":"Oct 5, 2019 8:58:41 AM","modification":"Oct 5, 2019 10:32:59 AM"}}
