{"id":74880,"no":5,"title":"Page 5","content":"\u0027Ten minutes, max,\" Smith said.\\n\\n \"Oh sure,\" Doherty said, from inside the cockpit. \u0027Ten minutes max, oh sure. Not that it matters. I wanted to beat rush hour traffic but now I guess I can\u0027t. It\u0027s my kid\u0027s birthday, and I won\u0027t be home for the party. My wife\u0027s going to give me hell.\"\\n\\n Ron Smith was starting to laugh. \"Can you think of anything else that might go wrong, Doug?\"\\n\\n \"Oh sure. Lots of things. Salmonella in the cake. All the kids poisoned,\" Doherty said.\\n\\n Casey looked out the door. The maintenance people had all climbed off the wing. Burne was finishing up his inspection of the engines. Trung was loading the DFDR into the van.\\n\\n It was time to go home.\\n\\n As she started down the stairs, she noticed three Norton Security vans parked in a corner of the hangar. There were about twenty security guards standing around the plane, and in various parts of the hangar.\\n\\n Richman noticed, too. \"What\u0027s this about?\" he said, gesturing to the guards.\\n\\n \"We always put security on the plane, until it\u0027s ferried to the plant,\" she said.\\n\\n \"That\u0027s a lot of security.\"\\n\\n \"Yeah, well.\" Casey shrugged. \"It\u0027s an important plane.\"\\n\\n But she noticed that the guards all wore sidearms. Casey couldn\u0027t remember seeing armed guards before. A hangar at LAX was a secure facility. There wasn\u0027t any need for the guards to be armed.\\n\\n Was there?\\n\\n BLDG 64\\n\\n 4:30 P.M.\\n\\n Casey was walking through the northeast corner of Building 64, past the huge tools on which the wing was built. The tools were crisscrossed blue steel scaffolding, rising twenty feet above the ground. Although they were the size of a small apartment building, the tools were precisely aligned to within a thousandth of an inch. Up on the platform formed by the tools, eighty people were walking around, putting the wing together.\\n\\n To the right, she saw groups of men packing tools into large wooden crates. \"What\u0027s all that?\" Richman said.\\n\\n \"Looks like rotables,\" Casey said.\\n\\n \"Rotables?\"\\n\\n \"Spare tooling that we rotate into the line if something goes wrong with the first set We built them to gear up for the China sale. The wing\u0027s the most time-consuming part to build; so the plan is to build the wings in our facility in Atlanta, and ship them back here.\"\\n\\n She noticed a figure in a shirt and tie, shirtsleeves rolled up, standing among the men working on the crates. It was Don Brull, the president of the UAW local. He saw Casey, called to her, and started toward her. He made a flicking gesture with his hand; she knew what he wanted.\\n\\n Casey said to Richman, \"Give me a minute. I\u0027ll see you back at the office.\"\\n\\n \"Who is that?\" Richman said.\\n\\n \"I\u0027ll meet you back at the office.\"\\n\\n Richman remained standing there, as Brull came closer. \"Maybe you want me to stay and - \"\\n\\n \"Bob,\" she said. \"Get lost.\"\\n\\n Reluctantly, Richman headed back toward the office. He kept glancing over his shoulder as he walked away.\\n\\n Brull shook her hand. The UAW president was a short and solidly built man, an ex-boxer with a broken nose. He spoke in a soft voice. \"You know, Casey, I always liked you.\"\\n\\n \"Thanks, Don,\" she said. \"Feeling\u0027s mutual.\"\\n\\n \"Those years when you were on the floor, I always kept my eye on you. Kept you out of trouble.\"\\n\\n \"I know that, Don.\" She waited. Brull was notorious for long windups.\\n\\n \"I always thought, Casey isn\u0027t like the others.\"\\n\\n \"What\u0027s going on, Don?\" she said.\\n\\n \"We got some problems with this China sale,\" Brull said.\\n\\n \"What kind of problems?\"\\n\\n \"Problems with the offset.\"\\n\\n \"What about it?\" she said, shrugging. \"You know there\u0027s always offset with a big sale.\" In recent years, airframe manufacturers had been obliged to send portions of the fabrication overseas, to the countries ordering planes. A country that ordered fifty planes expected to get a piece of the action. It was standard procedure.\\n\\n \"I know,\" Brull said. \"But in the past, you guys sent part of the tail, maybe the nose, maybe some interior fab. Just parts.\"\\n\\n \"That\u0027s right.\"\\n\\n \"But these tools we\u0027re crating up,\" he said, \"are for the wing. And the Teamsters on the loading dock are telling us these crates aren\u0027t going to Atlanta - they\u0027re going to Shanghai. The company\u0027s going to give the wing to China.\"\\n\\n \"I don\u0027t know the details of the agreement,\" she said. \"But I doubt that - \"\\n\\n \"The wing, Casey,\" he said. \"That\u0027s core technology. Nobody ever gives away the wing. Not Boeing, nobody. You give the Chinese the wing, you give away the store. They don\u0027t need us any more. They can build the next generation of planes on their own. Ten years from now, nobody here has a job.\"\\n\\n \"Don,\" she said, \"I\u0027ll check into this, but I can\u0027t believe the wing is part of the offset agreement.\"\\n\\n Brull spread his hands. \"I\u0027m telling you it is.\"\\n\\n \"Don. I\u0027ll check for you. But right now I\u0027m pretty busy with this 545 incident, and - \"\\n\\n \"You\u0027re not listening, Casey. The local\u0027s got a problem with the China sale.\"\\n\\n \"I understand that, but - \"\\n\\n \"A big problem\" He paused, looked at her. \"Understand?\u0027\\n\\n She did. The UAW workers on the floor had absolute control over production. They could slow down, sick out, break tooling, and create hundreds of other intractable problems. \"I\u0027ll talk to Marder,\" she said. \"I\u0027m sure he doesn\u0027t want a problem on the line.\"\\n\\n \"Marder is the problem.\"\\n\\n Casey sighed. Typical union misinformation, she thought. The China sale had been made by Hal Edgarton and the Marketing team. Marder was just the COO. He ran the plant. He didn\u0027t have anything to do with sales.\\n\\n \"I\u0027ll get back to you tomorrow, Don.\"\\n\\n \"That\u0027s fine,\" Brull said. \"But I\u0027m telling you, Casey. Personally. I\u0027d hate to see anything happen.\"\\n\\n \"Don,\" she said. \"Are you threatening me?\"\\n\\n \"No, no,\" Brull said quickly, with a pained expression. \"Don\u0027t misunderstand. But 1 hear that if the 545 thing isn\u0027t cleared up fast, it could kill the China sale.\"\\n\\n \"That\u0027s true.\"\\n\\n \"And you\u0027re speaking for the IRT.\"\\n\\n \"That\u0027s true, too.\"\\n\\n Brull shrugged. \"So, I\u0027m telling you. Feelings are strong against the sale. Some of the guys are pretty hot about it. I was you, I\u0027d take a week off.\"\\n\\n \"I can\u0027t do that. I\u0027m right in the middle of the investigation.\"\\n\\n Brull looked at her.\\n\\n \"Don. I\u0027ll talk to Marder about the wing,\" she said. \"But I have to do my job.\"\\n\\n \"In that case,\" Brull said, putting his hand on her arm, \"you take real good care, honey.\"\\n\\n ADMINISTRATION\\n\\n 4:40 P.M.\\n\\n \"No, no,\" Marder said, pacing in his office. \"This is nonsense, Casey. There\u0027s no way we\u0027d send the wing to Shanghai. What do they think, we\u0027re crazy? That\u0027d be the end of the company.\"\\n\\n \"But Brull said - \"\\n\\n \"The Teamsters are screwing with the UAW, that\u0027s all. You know how rumors run through the plant. Remember when they all decided composites made you sterile? Damn guys wouldn\u0027t come to work for a month. But it wasn\u0027t true. And this one\u0027s not true, either. Those tools are going to Atlanta,\" he said. \"And for one very good reason. We\u0027re fabbing the wing in Atlanta so that the senator from Georgia will stop messing with us every time we go to the Ex-Im Bank for a big loan. It\u0027s a jobs program for the senior senator from Georgia. Got it?\"\\n\\n \"Then somebody better get the word out,\" Casey said.\\n\\n \"Christ,\" Marder said. \"They know this. The union reps sit in on all the management meetings. It\u0027s usually Brull himself.\"\\n\\n \"But he didn\u0027t sit in on the China negotiations.\"\\n\\n \"I\u0027ll speak to him,\" Marder said.\\n\\n Casey said, \"I\u0027d like to see the offset agreement.\"\\n\\n \"And you will, as soon as it\u0027s final.\"\\n\\n \"What are we giving them?\"\\n\\n \"Part of the nose, and the empennage,\" Marder said. 75\\n\\n \"Same as we did for France. Hell, we can\u0027t give them anything else, they\u0027re not competent to build it.\"\\n\\n \"Brull was talking about interfering with the IRT. To stop the China sale.\"\\n\\n \"Interfering how?\" Marder said, frowning at her. \"Did he threaten you?\"\\n\\n Casey shrugged.\\n\\n \"What did he say?\"\\n\\n \"He recommended a week\u0027s vacation.\"\\n\\n \"Oh, for Christ\u0027s sake,\" Marder said, throwing up his hands. \"This is ridiculous. I\u0027ll talk to him tonight, straighten him out. Don\u0027t worry about this. Just stay focused on the job. Okay?\"\\n\\n \"Okay.\"\\n\\n \"Thanks for the heads-up. I\u0027ll take care of this for you.\"\\n\\n NORTON QA\\n\\n 4:53 P.M.\\n\\n Casey rode the elevator from the ninth floor down to her own offices, on the fourth floor. She replayed the meeting with Marder, and decided he wasn\u0027t lying. His exasperation had been genuine. And it was true what Marder said - rumors flew through the plant, all the time. A couple of years back, there was a week when the UAW guys had all come up to her, asking solicitously, \"How do you feel?\u0027 It was days before she learned there was a rumor she had cancer.\\n\\n Just a rumor. Another rumor.\\n\\n She walked down the corridor, past the photographs of famous Norton aircraft from the past, with a celebrity posed in front: Franklin Delano Roosevelt beside the B-22 that carried him to Yalta; Errol Flynn, with smiling girls in the tropics, in front of an N-5; Henry Kissinger, on the N-12 that had taken him to China in 1972. The photographs were sepia-toned, to convey a sense of age, and the stability of the company.\\n\\n She opened the doors to her offices: frosted glass, with raised lettering: \"Quality Assurance Division.\" She came into a large open room. The secretaries sat in the bullpen; executive offices lined the walls.\\n\\n Norma sat by the door, a heavyset woman of indeterminate age, with blue-rinse hair, and a cigarette dangling from her mouth. It was against regulations to smoke in the building, but Norma did as she pleased. She had been with the company as long as anyone could remember; it was rumored that she had been one of the girls in the picture with Errol Flynn, and that she had had a hot affair with Charley Norton back in the fifties. Whether any of that was true or not, she certainly knew where all the bodies were buried. Within the company, she was treated with a deference bordering on fear. Even Marder was cautious around her.\\n\\n Casey said, \"What\u0027ve we got, Norma?\"\\n\\n \"The usual panic,\" Norma said. \u0027Telexes are flying.\" She handed a stack to Casey. \"The Fizer in Hong Kong phoned three times for you, but he\u0027s gone home now. Fizer in Vancouver was on the horn half an hour ago. You can probably still get him.\"\\n\\n Casey nodded. It was not surprising that the Flight Service Representatives in the major hubs would be checking in. The FSRs were Norton employees assigned to the carriers, and the carriers would be worried about the incident.\\n\\n \"And, let\u0027s see,\" Norma said. \"The Washington office is all atwitter, they\u0027ve heard the JAA is going to exploit this on Airbus\u0027s behalf. What a surprise. Fizer in Dusseldorf wants a confirm it was pilot error. Fizer in Milan wants information. Fizer in Abu Dhabi wants a week in Milan. Fizer in Bombay heard engine failure. I straightened him out. And your daughter said to tell you she did not need her sweatshirt.\"\\n\\n \"Great.\"\\n\\n Casey took the faxes back to her office. She found Richman sitting at her desk. He looked up in surprise, and rose quickly from her chair. \"Sorry.\"\\n\\n Casey said, \"Didn\u0027t Norma find you an office?\"\\n\\n \"Yes, I have one,\" Richman said, walking around the desk. \"I was just, ah, just wondering what you wanted me to do with this.\" He held up a plastic bag with the video camera they had found on the plane.\\n\\n \"I\u0027ll take it.\"\\n\\n He gave it to her. \"So. What happens now?\"\\n\\n She dropped the stack of telexes on her desk. \"I\u0027d say you\u0027re through for the day,\" she said. \"Be here tomorrow at seven.\"\\n\\n He left, and she sat down in her chair. Everything seemed to be as she had left it. But she noticed that the second drawer on the desk was not quite closed. Had Richman been going through her desk?\\n\\n Casey pulled the drawer open, revealing boxes of computer disks, stationery, a pair of scissors, some felt-tip pens in a tray. It all looked undisturbed. But still...\\n\\n She heard Richman leave, then went back down the hall to Norma\u0027s desk. \"That kid,\" she said, \"was sitting behind my desk.\"\\n\\n \u0027Tell me,\" Norma said. \"The little twerp asked me to get him coffee.\"\\n\\n \"I\u0027m surprised Marketing didn\u0027t straighten him out,\" Casey said. \"They had him a couple of months.\"\\n\\n \"As a matter of fact,\" Norma said, \"I was talking to Jean over there, and she says they hardly ever saw him. He was always on the road.\"\\n\\n \"On the road? A new kid, a Norton relative? Marketing would never send him on the road. Where\u0027d he go?\"\\n\\n Norma shook her head. \"Jean didn\u0027t know. You want me to call Travel, and find out?\"\\n\\n \"Yeah,\" Casey said. \"I do.\"\\n\\n Back in her office, she turned to the plastic bag on the desk, opened it, and pulled the videotape from the shattered camera. She set the tape to one side. Then she dialled Jim\u0027s number, hoping to talk to Allison, but she got the answering machine. She hung up without leaving a message.\\n\\n She thumbed through the telexes. The only one that interested her was from the FSR in Hong Kong. As always, he was way behind the curve.\\n\\n FROM: RICK RAKOSKI, FSR HK TO: CASEY SINGLETON, QA/IRT NORTON BBK\\n\\n TRANSPACIFIC AIRLINES TODAY REPORTS FLIGHT 545, AN N-22, FUSE 271, FOREIGN REGISTRY 098/443/HB09, FLYING FROM HK TO DENVER EXPERIENCED A TURBULENCE UPSET DURING CRUISE FL370 APPROXIMATELY 0524 UTC POSITION 39 NORTH/170 EAST. SOME PASSENGERS AND CREW SUFFERED MINOR INJURIES. AIRCRAFT MADE EMERGENCY LANDING LAX.\\n\\n FLIGHT PLAN, PASSENGER AND CREW MANIFEST ATTACHED. PLS ADVISE SOONEST.\\n\\n The telex was followed by four pages of passenger manifest and crew list. She glanced at the crew list:\\n\\n JOHN ZHEN CHANG, CAPTAIN 5/7/51\\n\\n LEU ZAN PING, FIRST OFFICER 3/11/59\\n\\n RICHARD YONG, FIRST OFFICER 9/9/61\\n\\n GERHARD REIMANN, FIRST\\n\\n OFFICER 7/23/49\\n\\n HENRI MARCHAND, ENGINEER 4/25/69\\n\\n THOMAS CHANG, ENGINEER 6/29/70\\n\\n ROBERT SHENG, ENGINEER 6/13/62\\n\\n HARRIET CHANG, FLIGHT\\n\\n ATTENDANT 5/12/77\\n\\n LINDA CHING, FLIGHT\\n\\n ATTENDANT 5/18/76\\n\\n NANCY MORLEY, FLIGHT\\n\\n ATTENDANT 7/19/75\\n\\n KAY LIANG, FLIGHT ATTENDANT 6/4/67\\n\\n JOHN WHITE, FLIGHT ATTENDANT 1/30/70\\n\\n M. V. CHANG, FLIGHT\\n\\n ATTENDANT 4/1/77\\n\\n SHA YAN HAO, FLIGHT\\n\\n ATTENDANT 3/13/73\\n\\n YEE JIAO, FLIGHT ATTENDANT 11/18/76\\n\\n HARRIET KING, FLIGHT\\n\\n ATTENDANT 10/10/75\\n\\n B. CHOI, FLIGHT ATTENDANT 11/18/76\\n\\n YEE CHANG, FLIGHT ATTENDANT 1/8/74\\n\\n It was an international crew, of the kind that often flew for charter companies. Hong Kong crews had often flown for the Royal Air Force and were extremely well trained.\\n\\n She counted the names: eighteen in all, including seven flight crew. Such a large flight crew was not strictly necessary. The N-22 was designed to be flown by a two-man crew, just a captain and first officer. But all the Asian carriers were expanding rapidly, and they generally carried larger crews for extra training hours.\\n\\n Casey went on. The next telex was from the FSR in Vancouver.\\n\\n FROM: S. NIETO, FSR VANC TO: C. SINGLETON, QA/IRT\\n\\n FYI FLIGHT CREW TPA 545 DEADHEAD ON TPA 832, FROM LAX TO VANCOUVER, FIRST OFFICER LU ZAN PING TAKEN OFF THE AIRCRAFT AT VANCOUVER MEDICAL EMERGENCY DUE TO PREVIOUSLY UNRECOGNIZED HEAD INJURY. F/0 COMATOSE IN VANC GEN HOSP, DETAILS TF. REMAINING CREW OF TPA 545 TRANSIT BACK TO HONG KONG TODAY.\\n\\n So the first officer had been seriously injured, after all. He must have been in the tail when the incident occurred. The man whose cap they had found.\\n\\n Casey dictated a telex to the FSR in Vancouver, asking him to interview the first officer as soon as possible. She dictated another to the FSR in Hong Kong, suggesting an interview with Captain Chang on his return.\\n\\n Norma buzzed her. \"No luck on the kid,\" she said.\\n\\n \"Why not?\"\\n\\n \"I talked to Maria in Travel. They didn\u0027t make Richman\u0027s arrangements. His trips were charged to a special company account, a set-aside for foreign, off-budget stuff. But she heard the kid ran up a hell of a big charge.\"\\n\\n \"How big?\" Casey said.\\n\\n \"She didn\u0027t know.\" Norma sighed. \"But I\u0027m having lunch tomorrow with Evelyn in Accounting. She\u0027ll give me everything.\"\\n\\n \"Okay. Thanks, Norma.\"\\n\\n Casey turned back to the telexes on her desk. They were all other business:\\n\\n Steve Young, from the FAA\u0027s Certification office, asking about fire-retardant test results on seat cushions the previous December.\\n\\n A query from Mitsubishi about burnouts of then- five-inch displays in the first-class section of American N-22 widebodies.\\n\\n A list of revisions to the N-20 Aircraft Maintenance Manual (MR 06-62-02).\\n\\n A revision of the prototype Virtual Heads-Up Display units, to be delivered in the next two days.\\n\\n A memo from Honeywell advising replacement of die D-2 electrical bus on all FDAU units numbered A-505/9 through A-609/8.\\n\\n Casey sighed, and went to work.\\n\\n GLENDALE\\n\\n 7:40 P.M.\\n\\n She was tired when she got home. The house seemed empty without Allison\u0027s lively chatter. Too tired to cook, Casey went into the kitchen and ate a cup of yogurt. Allison\u0027s colorful drawings were taped on the refrigerator door. Casey considered calling her; but it was right around her bedtime, and she didn\u0027t want to interrupt if Jim was putting her to sleep.\\n\\n She also didn\u0027t want Jim to think she was checking up on him. That was a sore point between them. He always felt she was checking.\\n\\n Casey went into the bathroom and turned on the shower. She heard the phone ring, and went back into the kitchen to answer it. It was probably Jim. She picked up the receiver. \"Hello, Jim - \"\\n\\n \"Don\u0027t be stupid, bitch,\" a voice said. \"You want trouble, you\u0027ll get it. Accidents happen. We\u0027re watching you right now.\"\\n\\n Click.\\n\\n She stood in the kitchen, holding the phone in her hand. Casey had always thought of herself as levelheaded, but her heart was pounding. She forced herself to take a deep breath as she hung up the receiver. She knew these calls happened sometimes. She\u0027d heard of other vice-presidents getting threatening calls at night. But it had never happened to her, and she was surprised at how frightened she felt. She took another deep breath, tried to shrug it off. She picked up her yogurt, stared at it, put it down. She was suddenly aware that she was alone in a house with all the blinds open.\\n\\n She went around the living room, closing the blinds. When she came to the front window, she looked out at the street. In the light of the overhead street lamps, she saw a blue sedan parked a few yards up from her house.\\n\\n There were two men inside.\\n\\n She could see their faces clearly, through the windshield. The men stared at her as she stood at the window.\\n\\n Shit.\\n\\n She went to the front door, bolted it, locked the security chain. She set the burglar alarm, her ringers trembling and clumsy as she punched in the code. Then she flicked off the living room lights, pressed her body to the wall, and peered out the window.\\n\\n The men were still in the car. They were talking now. As she watched, one of them pointed toward her house.\\n\\n She went back to the kitchen, fumbled in her purse, found her pepper spray. She clicked off the safety. With her other hand she grabbed the phone, and pulled it on the long cord back to the dining room. Still watching the men, she called the police.\\n\\n \"Glendale police.\"\\n\\n She gave her name and address. \"There are men parked outside my house. They\u0027ve been here since this morning. I\u0027ve just gotten a threatening call.\"\\n\\n \"Okay, ma\u0027am. Is anybody in the house with you now?\"\\n\\n \"No. I\u0027m alone.\"\\n\\n \"Okay, ma\u0027am. Lock your door and set the alarm if you have one. A car is on the way.\"\\n\\n \"Hurry,\" she said.\\n\\n On the street, the men were getting out of the car.\\n\\n And walking toward her house.\\n\\n They were dressed casually, in polo shirts and slacks, but they looked grim and tough. As they came forward they split up, one walking onto the lawn, the other heading toward the back of the house. Casey felt her heart thump in her chest. Had she locked the back door? Gripping the pepper spray, she moved back to the kitchen, turning off the light there, then past the bedroom to the back door. Looking through the window in the door, she saw one of the men standing in the back alley. He was looking around cautiously. Then his gaze turned toward the back door. She crouched down, slipped the chain across the door.\\n\\n She heard the sound of soft footsteps, coming closer to the house. She looked up at the wall, just above her head. There was a keypad for the alarm, and a big red button marked EMERGENCY. If she hit that button, a screeching alarm would sound. Would that scare him away? She wasn\u0027t sure. Where were the damned police, anyway? How long had it been?\\n\\n She realized she could not hear the footsteps any more. Cautiously, she raised her head until she could peer out the bottom corner of the window.\\n\\n The man was walking down the alley away from her now. Then he turned, circling the house. Heading back to the street.\\n\\n Staying low, Casey ran back to the front of the bungalow, to the dining room. The first man was no longer on her lawn. She felt panic: Where was he? The second man appeared on the lawn, squinted at the front of her house, then headed back toward the car. She saw the first man was already in the car, sitting in the passenger seat. The second man opened the door and got in behind the wheel. Moments later, a black-and-white squad car pulled up behind the blue sedan. The men in the car seemed surprised, but they didn\u0027t do anything. The squad car turned on its spotlight, and one officer got out, moving cautiously forward. He talked to the men in the sedan for a moment. Then the two men got out. They all walked up the steps to her front door - the policeman and the two men from the car.\\n\\n She heard the doorbell ring, and answered it.\\n\\n A young police officer said, \"Ma\u0027am, is your name Singleton?\" \"Yes,\" she said.\\n\\n \"You work for Norton Aircraft?\" \"Yes, I do...\" \"These gentlemen are Norton Security. They say they\u0027re guarding you.\"\\n\\n Casey said, \"What?\" \\n\\n \"Would you like to see their credentials?\"\\n\\n \"Yes,\" she said. \"I would.\"\\n\\n The policeman shone a flashlight while the two men each held out their wallets for her. She recognized credentials for Norton Security Services.\\n\\n \"We\u0027re sorry, ma\u0027am,\" one of the guards said. \"We thought you knew. We\u0027ve been told to check the house every hour. Is that all right with you?\"\\n\\n \"Yes,\" she said. \"It\u0027s fine.\" \\n\\n","sourceLink":"https://allnovel.net/airframe/page-5.html","bookId":2409,"book":{"id":2409,"title":"Airframe","description":"Storyline: The twin jet plane en route to Denver from Hong Kong is merely a green radar blip half an hour off the California coast when the call comes through to air traffic control: \\n \u0027Socal Approach, this is TransPacific 545. We have an emergency.\u0027 The pilot requests priority clearance to land - then comes the bombshell - he needs forty ambulances on the runway. \\n But nothing prepares the rescue workers for the carnage they witness when they enter the plane. \\n Ninety-four passengers are injured. Three dead. The interior cabin virtually destroyed. \\n What happened on board Flight TPA 545?\\n","cover":"https://allnovel.net/images/airframe.jpg","author":"Michael Crichton","type":"Mystery","source":"allnovel","link":"https://allnovel.net/airframe.html","creation":"Oct 5, 2019 8:58:41 AM","modification":"Oct 5, 2019 10:32:59 AM"}}
