{"id":67135,"no":5,"title":"Page 5","content":"THE REST OF THE DAY went by as though he were under water. A few of the patients made reference to Carol\u0027s murder, but the more disturbed ones were so self-absorbed that they could think only of themselves and their problems. Judd tried to concentrate, but his thoughts kept drifting away, trying to find answers to what had happened. He would go over the tapes later to pick up what he had missed. At seven o\u0027clock, when Judd had ushered out the last patient, he went over to the recessed liquor cabinet and poured himself a stiff scotch. It hit him with a jolt, and he suddenly remembered that he had not had any breakfast or lunch. The thought of food made him ill. He sank into a chair and thought about the two murders. There was nothing in the case histories of any of his patients that would cause someone to commit murder. A blackmailer might have tried to steal them. But blackmailers were cowards, preying on the weaknesses of others, and if Carol had caught one breaking in and he had killed her, it would have been done quickly, with a single blow. He would not have tortured her. There had to be some other explanation. Judd sat there a long time, his mind slowly sifting the events of the past two days. Finally he sighed and gave it up. He looked at the clock and was startled to see how late it was. By the time he left his office, it was after nine o\u0027clock. As he stepped out of the lobby into the street, a blast of icy wind hit him. It had started to snow again. The snow swirled through the sky, gently blurring everything so that it looked as though the city had been painted on a canvas that had not dried and the paints were running, melting down skyscrapers and streets into watery grays and whites. A large red-and-white sign in a store window across the street on Lexington Avenue warned: ONLY 6 SHOPPING DAYS \u0027TIL CHRISTMAS Christmas. He resolutely turned his thoughts away from it and started to walk. The street was deserted except for a lone pedestrian in the distance, hurrying home to his wife or sweetheart. Judd found himself wondering what Anne was doing. She was probably at home with her husband, discussing his day at the office, interested, caring. Or they had gone to bed, and...Stop it! he told himself. There were no cars on the windswept street, so just before he reached the corner, Judd began to cross at an angle, heading toward the garage where he parked his car during the day. As he reached the middle of the street, he heard a noise behind him, and turned. A large black limousine without lights was coming toward him, its tires fighting for traction in the light powder of snow. It was less than ten feet away. The drunken fool, thought Judd. He\u0027s in a skid and he\u0027s going to kill himself. Judd turned and leaped back toward the curb and safety. The nose of the car swerved toward him, the car accelerating. Too late Judd realized the car was deliberately trying to run him down. The last thing he remembered was something hard smashing against his chest, and a loud crash that sounded like thunder. The dark street suddenly lit up with bright Roman candles that seemed to explode in his head. In that split second of illumination, Judd suddenly knew the answer to everything. He knew why John Hanson and Carol Roberts had been murdered. He felt a sense of wild elation. He had to tell McGreavy. Then the light faded, and there was only the silence of the wet darkness. From the outside, the Nineteenth Police Precinct looked like an ancient, weatherbeaten four-story school building: brown brick, plaster facade, and cornices white with the droppings of generations of pigeons. The Nineteenth Precinct was responsible for the area of Manhattan from Fifty-ninth Street to Eighty-sixth Street, from Fifth Avenue to the East River. The call from the hospital reporting the hit-and-run accident came through the police switchboard a few minutes after ten and was transferred to the Detective Bureau. The Nineteenth Precinct was having a busy night. Because of the weather, there had been a heavy increase in rapes and muggings. The deserted streets had become a frozen wasteland where marauders preyed on the hapless stragglers who wandered into their territory. Most of the detectives were out on squeals, and the Detective Bureau was deserted except for Detective Frank Angeli and a sergeant, who was interrogating an arson suspect. When the phone rang, Angeli answered. It was a nurse who had a hit-and-run patient at the city hospital. The patient was asking for Lieutenant McGreavy. McGreavy had gone to the Hall of Records. When she gave Angeli the name of the patient, he told the nurse that he would be right over. Angeli was hanging up the receiver as McGreavy walked in. Angeli quickly told him about the call. \"We\u0027d better get right over to the hospital,\" Angeli said. \"He\u0027ll keep. First I want to talk to the captain of the precinct where that accident occurred.\" Angeli watched as McGreavy dialed the number. He wondered whether Captain Bertelli had told McGreavy about his conversation with Angeli. It had been short and to the point. \"Lieutenant McGreavy is a good cop,\" Angeli had said, \"but I think he\u0027s influenced by what happened five years ago.\" Captain Bertelli had given him a long, cold stare. \"Are you accusing him of framing Dr. Stevens?\" \"I\u0027m not accusing him of anything, Captain. I just thought you should be aware of the situation.\" \"Okay, I\u0027m aware of it.\" And the meeting was over. McGreavy\u0027s phone conversation took three minutes while McGreavy grunted and made notes and Angeli impatiently paced back and forth. Ten minutes later the two detectives were in a squad car on the way to the hospital. Judd\u0027s room was on the sixth floor at the end of a long, dreary corridor that had the sickly-sweet smell of all hospitals. The nurse who had phoned was escorting them to Judd\u0027s room. \"What shape is he in, Nurse?\" asked McGreavy. \"The doctor will have to tell you that,\" she said primly. And then continued, compulsively. \"It\u0027s a miracle the man wasn\u0027t killed. He has a possible concussion, some bruised ribs, and an injured left arm.\" \"Is he conscious?\" asked Angeli. \"Yes. We\u0027re having a terrible time keeping him in bed.\" She turned to McGreavy. \"He keeps saying he has to see you.\" They walked into the room. There were six beds in the room, all occupied. The nurse indicated a bed at the far corner that was curtained off, and McGreavy and Angeli walked over to it and stepped behind the curtain. Judd was in bed, propped up. His face was pale and there was a large adhesive plaster on his forehead. His left arm was in a sling. McGreavy spoke. \"I hear you had an accident.\" \"It wasn\u0027t an accident,\" said Judd. \"Someone tried to kill me.\" His voice was weak and shaky. \"Who?\" asked Angeli. \"I don\u0027t know, but it all fits in.\" He turned to McGreavy. \"The killers weren\u0027t after John Hanson or Carol. They were after me.\" McGreavy looked at him in surprise. \"What makes you think so?\" \"Hanson was killed because he was wearing my yellow slicker. They must have seen me go into my building wearing that coat. When Hanson came out of my office wearing it, they mistook him for me.\" \"That\u0027s possible,\" said Angeli. \"Sure,\" said McGreavy. He turned to Judd. \"And when they learned that they had killed the wrong man, they came into your office and tore your clothes off and found out you were really a little colored girl, and they got so mad they beat you to death.\" \"Carol was killed because they found her there when they came to get me,\" Judd said. McGreavy reached in his overcoat pocket and took out some notes. \"I just talked to the captain of the precinct where the accident happened.\" \"It was no accident.\" \"According to the police report, you were jaywalking.\" Judd stared at him. \"Jaywalking?\" he repeated weakly. \"You crossed in the middle of the street, Doctor.\" \"There were no cars so I - \" \"There was a car,\" McGreavy corrected. \"Only you didn\u0027t see it. It was snowing and the visibility was lousy. You stepped out of nowhere. The driver put on his brakes, went into a skid, and hit you. Then he panicked and drove away.\" \"That\u0027s not the way it happened and his headlights were off.\" \"And you think that\u0027s evidence that he killed Hanson and Carol Roberts?\" \"Someone tried to kill me,\" repeated Judd insistently. McGreavy shook his head. \"It won\u0027t work, Doctor.\" \"What won\u0027t work?\" asked Judd. \"Did you really expect me to start beating the bushes for some mythical killer while you take the heat off yourself?\" His voice was suddenly hard. \"Did you know your receptionist was pregnant?\" Judd closed his eyes and let his head sink back on the pillow. So that was what Carol had wanted to speak to him about. He had half-guessed. And now McGreavy would think...He opened his eyes. \"No,\" he said wearily. \"I didn\u0027t.\" Judd\u0027s head began pounding again. The pain was returning. He swallowed to fight off the nausea that engulfed him. He wanted to ring for the nurse, but he was damned if he would give McGreavy the satisfaction. \"I went through the records at City Hall,\" said McGreavy. \"What would you say if I told you that your cute little pregnant receptionist had been a hooker before she went to work for you?\" The pounding in Judd\u0027s head was becoming steadily worse. \"Were you aware f that, Dr. Stevens? You don\u0027t have to answer. I\u0027ll answer for you. You knew it because you picked her up in night court four years ago, when she was arrested on a charge of soliciting. Now isn\u0027t it a little far-out for a respectable doctor to hire a hooker as a receptionist in a high-class office?\" \"No one is born a hooker,\" said Judd. \"I was trying to help a sixteen-year-old child have a chance at life.\" \"And get yourself a little free black tail on the side?\" \"You dirty-minded bastard!\" McGreavy smiled without mirth. \"Where did you take Carol after you found her in night court?\" \"To my apartment.\" \"And she slept there?\" \"Yes.\" McGreavy grinned. \"You\u0027re a beauty! You picked up a good-looking young whore in night court and took her to your apartment to spend the night. What were you looking for - a chess partner? If you really didn\u0027t sleep with her, there\u0027s a damn good chance you\u0027re a homosexual. And guess who that ties you in with? Right. John Hanson. If you did sleep with Carol, then the chances are pretty good that you continued sleeping with her until you finally got her knocked up. And you have the gall to lie there and tell me some cock-and-bull story about a hit-and-run maniac who\u0027s going around murdering people?\" McGreavy turned and strode out of the room, his face red with anger. The pounding in Judd\u0027s head had turned to a throbbing agony. Angeli was watching him, worried. \"You all right?\" \"You\u0027ve got to help me,\" Judd said. \"Someone is trying to kill me.\" It sounded like a threnody in his ears. \"Who\u0027d have a motive for killing you, Doctor?\" \"I don\u0027t know.\" \"Do you have any enemies?\" \"No.\" \"Have you been sleeping with anyone\u0027s wife or girl friend?\" Judd shook his head and instantly regretted the motion. \"Is there any money in your family - relatives who might want to get you out of the way?\" \"No.\" Angeli sighed. \"OK. So there\u0027s no motive for anyone wanting to murder you. What about your patients? I think you\u0027d better give us a list so we can check them out.\" \"I can\u0027t do that.\" \"All I\u0027m asking for is their names.\" \"I\u0027m sorry.\" It was an effort to speak. \"If I were a dentist or a chiropodist I\u0027d give it to you. But don\u0027t you see? These people have problems. Most of them serious problems. If you started questioning them, you\u0027d not only shatter them; you\u0027d destroy their confidence in me. I wouldn\u0027t be able to treat them any more. I can\u0027t give you that list.\" He lay back on the pillow, exhausted. Angeli looked at him quietly, then asked, \"What do you call a man who thinks that everyone\u0027s out to kill him?\" \"A paranoiac,\" said Judd. He saw the look on Angeli\u0027s face. \"You don\u0027t think I\u0027m...?\" \"Put yourself in my place,\" Angeli said. \"If I were in that bed right now, talking like you, and you were my doctor, what would you think?\" Judd closed his eyes against the stabs of pain in his head. He heard Angeli\u0027s voice continue. \"McGreavy\u0027s waiting for me.\" Judd opened his eyes. \"Wait...Give me a chance to prove that I\u0027m telling the truth.\" \"How?\" \"Whoever\u0027s trying to kill me is going to try again. I want someone with me. Next time they try, he can catch them.\" Angeli looked at Judd. \"Dr. Stevens, if someone really wants to kill you, all the policemen in the world can\u0027t stop them. If they don\u0027t get you today, they\u0027ll get you tomorrow. If they don\u0027t get you here, they\u0027ll get you somewhere else. It doesn\u0027t matter whether you\u0027re a king or a president, or just plain John Doe. Life is a very thin thread. It only takes a second to snap it.\" \"There\u0027s nothing - nothing at all you can do?\" \"I can give you some advice. Have new locks put on the doors of your apartment, and check the windows to make sure they\u0027re securely bolted. Don\u0027t let anyone in the apartment unless you know them. No delivery boys unless you\u0027ve ordered the delivery yourself.\" Judd nodded, his throat dry and aching. \"Your building has a doorman and an elevator man,\" continued Angeli. \"Can you trust them?\" \"The doorman has worked there for ten years. The elevator operator has been there eight years. I\u0027d trust them with my life.\" Angeli nodded approvingly. \"Good. Ask them to keep their eyes open. If they\u0027re on the alert, it\u0027s going to be hard for anyone to sneak up to your apartment. What about the office? Are you going to hire a new receptionist?\" Judd thought of a stranger sitting at Carol\u0027s desk, in her chair. A spasm of helpless anger wracked him. \"Not right away.\" \"You might think about hiring a man,\" said Angeli. \"I\u0027ll think about it.\" Angeli turned to go, then stopped. \"I have an idea,\" he said hesitantly, \"but it\u0027s a longshot.\" \"Yes?\" He hated the eagerness in his voice. \"This man who killed McGreavy\u0027s old partner...\" \"Ziffren.\" \"Was he really insane?\" \"Yes. They sent him to the Matteawan State Hospital for mentally ill criminals.\" \"Maybe he blames you for having him put away. I\u0027ll check him out. Just to make sure he hasn\u0027t escaped or been released. Give me a call in the morning.\" \"Thanks,\" Judd said gratefully. \"It\u0027s my job. If you\u0027re involved in any of this, I\u0027m going to help McGreavy nail you.\" Angeli turned to go. He stopped again. \"You don\u0027t have to mention to McGreavy that I\u0027m checking on Ziffren for you.\" \"I won\u0027t.\" The two men smiled at each other. Angeli left. Judd was alone again. If the situation was bleak that morning it was even bleaker now. Judd knew that he would already have been arrested for murder except for one thing - McGreavy\u0027s character. McGreavy wanted vengeance and he wanted it so badly that he would make sure that every last bit of evidence was in place. Could the hit-and-run have been an accident? There had been snow on the street, and the limousine could have accidentally skidded into him. But then, why had the headlights been off? And where had the car come from so suddenly? He was convinced now that an assassin had struck - and would strike again. With that thought, he fell asleep. Early the next morning Peter and Norah Hadley came to the hospital to see Judd. They had heard about the accident on the morning news. Peter was Judd\u0027s age, smaller than Judd and painfully thin. They had come from the same town in Nebraska and had gone through medical school together. Norah was English. She was blond and chubby with a large, soft bosom a bit too large for her five feet three inches. She was vivacious and comfortable, and after five minutes\u0027 conversation with her, people felt they had known her forever. \"You look lousy,\" Peter said, studying Judd critically. \"That\u0027s what I like, Doctor. A bedside manner.\" Judd\u0027s headache was almost gone and the pain in his body had been reduced to a dull, aching soreness. Norah handed him a bouquet of carnations. \"We brought you some flowers, love,\" she said. \"You poor old darling.\" She leaned over and kissed him on the cheek. \"How did it happen?\" asked Peter. Judd hesitated. \"It was a hit-and-run accident.\" \"Everything hit the fan at once, didn\u0027t it? I read about poor Carol.\" \"It\u0027s dreadful,\" said Norah. \"I liked her so much.\" Judd felt a tightness in his throat. \"So did I.\" \"Any chance of catching the bastard who did it?\" Peter asked. \"They\u0027re working on it.\" \"In this morning\u0027s paper it said that a Lieutenant McGreavy is close to making an arrest. Do you know anything about it?\" \"A little,\" Judd said dryly. \"McGreavy likes to keep me up to date.\" \"You never know how wonderful the police are until you really need them,\" Norah said. \"Dr. Harris let me take a look at your X rays. Some nasty bruises - no concussion. You\u0027ll be out of here in a few days.\" But Judd knew he had no time to spare. They spent the next half hour in small talk, carefully avoiding the subject of Carol Roberts. Peter and Norah were unaware that John Hanson had been a patient of Judd\u0027s. For some reason of his own, McGreavy had kept that part of the story out of the newspapers. When they got up to leave, Judd asked to speak to Peter alone. While Norah waited outside, Judd told Peter about Harrison Burke. \"I\u0027m sorry,\" said Peter. \"When I sent him to you, I knew he was in a bad way, but I was hoping there was still time for you to help him. Of course you have to put him away. When are you going to do it?\" \"As soon as I get out of here,\" Judd said. And he knew he was lying. He didn\u0027t want Harrison Burke sent away. Not just yet. He wanted to find out first whether Burke could have committed the two murders. \"If there\u0027s anything I can do for you, old buddy - call.\" And Peter was gone. Judd lay there, planning his next move. Since there was no rational motive for anyone wanting to kill him, it stood to reason that the murders had been committed by someone who was mentally unbalanced, someone with an imagined grievance against him. The only two people he could think of who might fit into that category were Harrison Burke and Amos Ziffren, the man who had killed McGreavy\u0027s partner. If Burke had no alibi for the morning Hanson was killed, then Judd would ask Detective Angeli to check him out further. If Burke had an alibi, then he would concentrate on Ziffren. The feeling of depression that had enveloped him began to lift. He felt that at last he was doing something. He was suddenly desperately impatient to get out of the hospital. He rang for the nurse and told her he wanted to see Dr. Harris. Ten minutes later Seymour Harris walked into the room. He was a little gnome of a man with bright blue eyes and tufts of black hair sticking out of his cheeks. Judd had known him a long time and had great respect for him. \"Well! Sleeping Beauty\u0027s awake. You look terrible.\" Judd was getting tired of hearing it. \"I feel fine,\" he lied. \"I want to get out of here.\" \"When?\" \"Now.\" Dr. Harris looked at him reprovingly. \"You just got here. Why don\u0027t you stick around a few days? I\u0027ll send you in a few nymphomaniac nurses to keep you company.\" \"Thanks, Seymour. I really do have to leave.\" Dr. Harris sighed. \"OK. You\u0027re the doctor, Doctor. Personally, I wouldn\u0027t let my cat walk around in your condition.\" He looked at Judd keenly. \"Anything I can do to help?\" Judd shook his head. \"I\u0027ll have Miss Bedpan get your clothes.\" Thirty minutes later the girl at the reception desk called a taxi for him. He was at his office at ten-fifteen.","sourceLink":"https://allnovel.net/the-naked-face/page-5.html","bookId":2354,"book":{"id":2354,"title":"The Naked Face","description":"Storyline: Judd Stevens is a psychoanalyst faced with the most critical case of his life. If he does not penetrate the mind of a murderer he will find himself arrested for murder or murdered himself... Two people closely involved with Dr. Stevens have already been killed. Is one of his patients responsible? Someone overwhelmed by his problems? A neurotic driven by compulsion? a madman? Before the murderer strikes again, Judd must strip away the mask of innocence the criminal wears, uncover his inner emotions, fears, and desires - expose the naked face beneath...","cover":"https://allnovel.net/images/the-naked-face.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-naked-face.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:03:33 AM"}}
