{"id":74782,"no":34,"title":"Page 34","content":"By the time he’d gotten on the transport, his fingers had frozen into claws in his pockets and his jaw had locked down on his clapping molars. The warm-up of all his corporeal merchandise had been an exercise in burning pain, but he’d barely noticed. It was a sad commentary on where he and Romina came from that both of them were nothing but pawns in a social chess game to their families. God, that poor female. And he had no idea what he was going to do about it. What was clear? His absence during that cheese and fruit course had been duly noted. His phone had rung three times, and his father had left him voice messages. Peyton didn’t listen to them. Why bother? He knew what they said; he could dub the words and the tone in just fine— “We have arrived, sire.” Peyton jumped in his seat. Fritz, the loyal doggen butler who served as the bus driver most nights, was both concerned and smiling, his wrinkled face peeled back like a set of curtains in a friendly house. “Sire? Are you all right? May I get you anything?” “Sorry.” Peyton rose to his feet. “Sorry—I’m fine. Thank you.” Bullshit, he was fine. Matter of fact, he was so far from fine, he couldn’t see goddamn Fine-landia from where he was. As he got off the bus, the butler escorted him over to the reinforced steel door, their footfalls echoing throughout the multi-layered concrete parking area. And then they were inside, proceeding down the long, wide corridor. When Peyton stopped in front of the closed door to Novo’s hospital room, Fritz bowed low and kept on going to his next duty. Before Peyton knocked, he brushed his hair back with his fingers. Made sure his cuffs were down. Checked his— “You can come in.” At the dry sound of Novo’s voice, Peyton straightened his spine and pushed into the hospital room. Okay…wow. She looked so much better. She was sitting up, a couple of the monitors were gone, and there was a tray with the remnants of food on it: fresh Danish, a half-eaten bowl of fruit, toast points, and a little pot of strawberry jam. She’d obviously eaten the scrambled eggs. Hospital food here was not “hospital” at all. “So formal,” she murmured. “You didn’t have to dress for the occasion.” He glanced down at himself. “I’m wearing my tux.” “You sound surprised. What did you think you had on?” When he looked back at her, Novo sat up a little higher on the stack of pillows that was holding her to the vertical—and the grunt and grimace she tried to hide told him that much as she might appear stronger, she wasn’t going home at the end of the night. Feeding or no feeding. “You okay?” she asked. He considered tossing a jocular fish back, but then thought about Romina. “No, I’m really not.” “Unrequited love got you down? You want me to get you a card or something. Teddy bear to cuddle. No, wait…chocolate and a glass of wine?” Peyton ignored all that and went over to the far corner, his legs going loose right on schedule so that he fell into the chair there. Putting his head in his hands, he just stared at the floor. He wanted Novo like all get-out. But he couldn’t get his head away from what he’d been told by that other female. Where he was with his own family. How bad things could get when you had money, but nothing else, to back you up in the world. “Jesus,” Novo murmured, “you look like you’re having a nervous breakdown.” “Tell me about your family,” he heard himself say. “What are they like? What do they do that hurts you?” Novo looked away. “We don’t need to go into that.” As disappointment surged, he told himself he shouldn’t try to re-create that friendship he’d had with Paradise with anybody else. That had been a time-limited period in his life, something that had passed now that she had moved on and he was still where he had always been. God, he wanted a smoke. Patting the inside pocket of his jacket, he felt around—oh, thank you, motherfucker, he thought as he discovered a couple of old joints in there. He took one out and snagged the gold lighter he kept in his slacks. “You can’t smoke in here.” Peyton glanced across to the hospital bed. “Do you not like the smell?” “I don’t care. But there’s an oxygen tank over there, and I’m pretty sure the docs won’t appreciate it even if you don’t blow us sky high.” With a groan, he got up and went to the metal cylinder. There was a valve on the top and he thought, Rightie-tightie. The Brothers had taught him that. And yup, the thing was closed. He flicked the lighter open on the way back to the chair and had his first draw as he sat down. Holding the hissing inhale deep, he waited impatiently for the buzz to come and froth up his frontal lobe until the piece of shit took a chill. “Please,” he said on the exhale. “Just…tell me something, anything. I need to talk.” Maybe it was the drugs, Novo thought. Maybe it was the reminder the night before that she was mortal. Maybe it was all the text messages and voicemails that had come in about her sister from her mother, her sister, her sister’s friends. Maybe it was the fact that Peyton wasn’t looking like his regular, James Spader circa Pretty in Pink self. But something made her open her mouth. “My sister is not like me,” she blurted into the silence. “At all.” “So she’s dumb?” Peyton exhaled more smoke and loosened his black bow tie. “Ugly? Uncoordinated? Wait, she throws a baseball like a—” “Stop.” She shook her head at him. “I can’t be real with you if you’re going to do the Peyton dog-and-pony show.” He put the joint between his teeth and shrugged out of his tuxedo jacket. Then he unbuttoned the top quarter of his dress shirt. As he resettled, he exhaled again and spoke through the smoke. “I’m serious about all of that. I think you’re smart, beautiful, and a great fighter.” There was no twinkle in his eye. No lift to his lips. No har-har-har in his tone. And then he just stared at her as if he were daring her to refute his opinion. Well, crap, she thought. He was dangerous like this…all sexy as he sprawled in that chair, his arms draped over the sides, his legs now crossed at the knee. In that pose, with that loose bow tie and the V of golden skin at his throat, he looked like he could please a female any way he liked—and the impression was probably correct. He sure had the anatomy for it. She knew that firsthand. But more than all that physical stuff? He was focused on her as if what she might tell him, whatever it was, was the only thing that he cared to hear in all the world. He seemed to really see her, no distractions, no side glances somewhere else, no tapping feet or drumming fingers. To a female who had always been second fiddle to a loud, pink, gardenia-smelling lace-and-bows nightmare? It was just as addicting as the taste of his blood. How far did she go, though. She had told no one, not even the Brotherhood during her psych eval, what had happened to her. The first was true because she hated pity. The second? Well, duh, she didn’t want to get kicked out of the program for being mentally unstable. Which she was not. But they might think she had reason to be. “So tell me about your family problems,” he prompted. “It’s nothing, really,” she muttered. “Sibling stuff, you know.” As her hand moved over to rest on her stomach, she caught herself even though he couldn’t possibly guess at why she would feel protective. “Come on.” He took another inhale. “You have to do better than that.” As if on cue, her phone rang on the table that she’d pulled over her knees. Tilting the cell up, she cursed when she saw who it was. “And here it is.” She rolled her eyes. “My sister, again. She’s getting mated, and she picked me to be her little bitch through the whole thing. I am soooo touched, you can’t imagine.” “When is the ceremony?” “Wedding,” she corrected. “And very soon.”","sourceLink":"https://allnovel.net/blood-fury-black-dagger-legacy-3/page-34.html","bookId":1777,"book":{"id":1777,"title":"Blood Fury (Black Dagger Legacy #3)","description":"Storyline: A vampire aristocrat, Peyton is well aware of his duty to his bloodline: mate with an appropriate female of his class and carry on his family’s traditions. And he thought he’d found his perfect match—until she fell in love with someone else. Yet when his split-second decision in a battle with the enemy endangers the life of another trainee, Peyton has to face the idea that his future, and his heart, actually lie with another. Novo, as a female in the Black Dagger Brotherhood’s training program, feels like she has to prove herself to everybody—and she has no interest in being distracted by falling in love. But when Peyton proves to be so much more than a rich playboy, she is forced to confront the tragedy that has broken her soul and closed her off from love. As the two grapple with Novo’s past and Peyton’s present, another couple must contend with an erotic connection that is unparalleled—and potentially scandalous. Saxton, who has had his heart broken, discovers in himself a deep-seated attraction to Ruhn, a new member of the household. But will the other male explore the connection? Or will he close his mind and his heart to what could be true love . . . and cost Saxton everything?","cover":"https://allnovel.net/images/blood-fury-black-dagger-legacy-3.jpg","author":"J.R. Ward","type":"Romance","source":"allnovel","link":"https://allnovel.net/blood-fury-black-dagger-legacy-3.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:31:48 AM"}}
