{"id":74797,"no":49,"title":"Page 49","content":"His heart pounded equally over either.\\n\\n Ruhn stepped up to the front door of the farmhouse and found himself straightening his wool jacket. There was blood on it. His knuckles were busted. And he had been hit a couple of times in the face, although the pain was muted from the cold.\\n\\n He was a fucking mess.\\n\\n After Saxton had dematerialized out of the scene behind the French restaurant, Ruhn had spoken with the Brothers for a time. They didn’t seem particularly bothered by any of the violence or the fact that he’d nearly killed the human. But their opinion was not what mattered to him.\\n\\n He knocked on the door and stepped back, stomping his boots in preparation for going in. And then things were open. Saxton was on the other side, his coat having been removed, his blond hair flopped off his cowlick as if he had been dragging restless hands through it.\\n\\n His stare locked on Ruhn’s left eye, the one that had its own heartbeat from the swelling.\\n\\n Ruhn lifted a hand and covered whatever was going on up there. But that was stupid. “May I come in?”\\n\\n Saxton seemed to shake himself. “Yes, please. It’s cold. I’m making coffee?”\\n\\n As the male indicated the way in, Ruhn followed the direction and then just stood there in the little entry area at the base of the stairs. Saxton’s eyes traveled around, but always returned to Ruhn’s face.\\n\\n Maybe his injuries were worse than he thought? They didn’t feel like much. But then, with his high pain tolerance, they never did.\\n\\n “It’s fine,” he said as he touched his face. “Whatever this is.”\\n\\n Saxton cleared his throat. “Yes. Of course. Ah, coffee?”\\n\\n Ruhn shook his head and proceeded in the solicitor’s wake to the back of the house. Sure enough, there were a pair of mugs on the counter and the scent of fresh brew in the air.\\n\\n “Do you like anything in yours?” Saxton went for the pot and pulled it out from its base. “I just like a little sugar in mine—”\\n\\n “I was conscripted into a fighting ring. For a decade.”\\n\\n Saxton slowly pivoted, coffeepot in his hand. “I’m sorry?”\\n\\n Ruhn paced around and tried not to get lost in how much he hated talking about the past. “It was an indentured fighting ring, run in South Carolina. Humans do them for dogs and birds. Vampires do it for our own species. I spent ten years getting in the ring with other males so that people could bet on the outcome. I was very good at it and I hated it. Every second.”\\n\\n When Saxton didn’t say anything, he stopped and looked across the homey kitchen at the other male. Such surprise. Such stunned shock.\\n\\n Fates, he wanted to throw up.\\n\\n “I’m sorry,” he blurted. Even though he wasn’t sure exactly what he was apologizing for.\\n\\n No, wait, he knew. It was the fact he had anything like this to confess to such a fine, upstanding male—and also now that he’d spoken of the past, Ruhn was drowning in it once again.\\n\\n He remembered the stench of the stables where the fighting males were kept. The spoiled food. The kill-or-be-killed reality that had meant he had been in the ring even with those just out of their transitions. He had had to beat others who were weaker than him and be beaten by those closer to his level. And all the while, the masters of the fighting ring had profited from the bodies that had been maimed, crippled…destroyed.\\n\\n The young ones were what haunted him the most: all those begging, bloodshot eyes, and pleading mouths, and heaving chests from pain and exertion. He had cried every time at the end. When the moment had inevitably come, his tears had run through the dirt, sweat, and blood down his face.\\n\\n But if he did not do the job, his family was going to pay the price.\\n\\n And so he had learned that in fact you could die even as you lived.\\n\\n “I’m sorry,” he croaked again.\\n\\n Saxton blinked. And then put the coffeepot back in the machine without pouring anything. “I’m not…ah, I don’t believe I knew of such a thing in the New World. I have heard stories about betting on males in brokered combat in the Old Country, however. How did you…if you don’t mind me asking, how did you come to be a part of the practice? ‘Conscripted’ means in servitude. Were you…how did this happen?”\\n\\n Ruhn crossed his arms over his chest and let his head hang. “I loved my father. He was a male who provided well for my mahmen and his family. We never were rich, but we never were left wanting.” Images of the male chopping wood, and building things, and fixing cars, replaced the ugliness of the fighting ring. “He had a weakness, though. All of us do, and those of us who think they do not are not being honest. He had a gambling problem. He bet on the fights for some time, and eventually racked up so many debts that not only was he going to lose our house—but my sister and my mahmen…well, they were in danger. They were going to be conscripted for…activities of another sort. Do you understand what I’m saying?” As Saxton paled and nodded, Ruhn continued, “I had to do something to cover what he owed. I mean, I wasn’t going to stand by and have those two innocent females pay…Fates, I can still hear the sound of my father begging the boss, weeping for some more time to try to pay up.”\\n\\n When his voice cracked, he coughed a little. “You know, I think I will have some coffee, if you do not mind.”\\n\\n “Let me get it for you—”\\n\\n Ruhn put his hand out. “No. I will do it.”\\n\\n He needed something to occupy him for a moment; otherwise, he was liable to break down. The memories were too clear, like lasers burning through him. He could still remember the banging on the door when the boss had shown up and threatened to take his sister and use her to work off the debts.\\n\\n The male had said if their mahmen came, too, it would go quicker. Five years instead of ten. They had until dawn came to make good.\\n\\n Instead, Ruhn had departed before the sun had risen and he had traveled farther south, to the deep woods that had hidden within them an extensive operation of fighting, illegal gambling, and prostitution. They had tested him out in the offices, sending in a male who had been half his height and twice his weight. Ruhn had taken a brutal beating, but he had just kept getting up, over and over again, even as he had bled from his mouth and from cuts and bruises all over his body.\\n\\n After they had accepted him, he had made his mark on some kind of document he hadn’t been able to read, and that was that.\\n\\n Coming back to the present, Ruhn looked down and found a full mug in his hand. Guess he had poured himself the coffee.\\n\\n Taking a test sip, he found that the taste was perfect—but a sting suggested his lower lip was split. “As I said, I needed to be the one who fixed it. My father was too old to fight, and I was out of my transition by about twenty years at that time. I’ve always been big and very strong. Sometimes what we do to survive…is harder than what we do when we die.” He shrugged. “But my parents were able to rebuild their lives. My sister…well, that was another story.” He looked at the solicitor. “Please know, it was not something I would have chosen freely. It is not in my nature to be violent, but I learned that I will do anything to take care of those I love. I also learned that if someone is trying to hurt me…I will defend myself, to the death.”\\n\\n He shook his head. “My father…he never got over what happened. He never bet a single penny after I went away, and by the time I came out, they were both working and in good health. I couldn’t see them, of course, while I was fighting. You were not allowed out of your stall.”\\n\\n “Stall?” Saxton said with horror.\\n\\n “They kept us underground in stalls, as you would horses. The spaces were six feet by six feet. We were allowed out only to fight, and we had no visitors except for the females they gave us to feed from. That’s what they wanted to use my sister and my mahmen for.” Through a tight throat, he added, “And sometimes we had to service…well. Anyway.”\\n\\n Saxton seemed to wipe his eyes. “I cannot imagine what that was like.”\\n\\n “It was…” Ruhn touched the side of his head. “It did something in here. It rewired me, and I wasn’t sure whether it was permanent….Until tonight, I hadn’t been in a position where I was fighting again. It came back, though. All of it.” \\n\\n","sourceLink":"https://allnovel.net/blood-fury-black-dagger-legacy-3/page-49.html","bookId":1777,"book":{"id":1777,"title":"Blood Fury (Black Dagger Legacy #3)","description":"Storyline: A vampire aristocrat, Peyton is well aware of his duty to his bloodline: mate with an appropriate female of his class and carry on his family’s traditions. And he thought he’d found his perfect match—until she fell in love with someone else. Yet when his split-second decision in a battle with the enemy endangers the life of another trainee, Peyton has to face the idea that his future, and his heart, actually lie with another. \\n Novo, as a female in the Black Dagger Brotherhood’s training program, feels like she has to prove herself to everybody—and she has no interest in being distracted by falling in love. But when Peyton proves to be so much more than a rich playboy, she is forced to confront the tragedy that has broken her soul and closed her off from love. \\n As the two grapple with Novo’s past and Peyton’s present, another couple must contend with an erotic connection that is unparalleled—and potentially scandalous. \\n Saxton, who has had his heart broken, discovers in himself a deep-seated attraction to Ruhn, a new member of the household. But will the other male explore the connection? Or will he close his mind and his heart to what could be true love . . . and cost Saxton everything?\\n","cover":"https://allnovel.net/images/blood-fury-black-dagger-legacy-3.jpg","author":"J.R. Ward","type":"Romance","source":"allnovel","link":"https://allnovel.net/blood-fury-black-dagger-legacy-3.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:31:48 AM"}}
