{"id":74756,"no":8,"title":"Page 8","content":"As if Ruhn sensed the presence behind him, the male wrenched around. “Oh, excuse me. I’m in your way.” “Not at all.” A gust blew in between them, ushering a swirl of flakes through the distance that separated their bodies. Then Ruhn abruptly stepped back into the fresh snow and rested the business end of the shovel at his feet. Dropping his head, he folded his hands on the handle and assumed the role of a servant male, prepared to wait through even the deadly rising sun if it was necessary for his social superior to move along. “Why are you out here?” Saxton asked. Ruhn’s eyes rose in surprise. “I…there needs to be a path cleared.” “Fritz has a snowblower.” “He is busy inside.” Those eyes refocused on the ground. “And I would like to help.” “Does he know you are doing this?” Except that was a silly question. Regardless of Ruhn’s station prior to moving in, the male was now a guest in the First Family’s house, and as such, the idea he was doing manual labor out here in a storm? The butler would have an apoplectic fit. “I won’t tell anyone.” Saxton shook his head even though the male wasn’t looking at him. “I promise.” Those toffee-colored eyes lifted again. “I don’t…I don’t wish to cause any difficulty. But the truth is…” Another volley of wind barreled into them, and Saxton had to shift his weight to keep from being pushed over. When things re-quieted, he waited for Ruhn to finish. “You can talk to me,” he said as the male stayed silent. “I’m an attorney. I’m used to keeping things to myself.” Eventually, Ruhn shook his head. “It just doesn’t sit well with me.” “What doesn’t?” “Being here and not…doing anything.” The male’s eyes traced over the mansion’s great gray profile. “It’s not right.” “You’re an honored guest.” “No, I’m not. Or I should not be. And I do not wish…” As the male stalled out again, Saxton prompted, “What do you not wish?” “I do not wish to be purposeless.” The male frowned. “Are you truly going out in this weather?” “Do I look so fragile?” Ruhn bowed low. “Forgive me. I meant no offense—” “No, no.” Saxton stepped forward with his hand out, thinking he might reassure the male. But he stopped himself. “I’m just kidding. And I’ll be fine. Thank you for your concern, however.” There was an awkward pause. And indeed, it was impossible not to notice that flakes had landed in that dark hair, and dusted those shoulders…and there was a scent in the air, a heady, sexy scent of a male in good health exerting himself…and God, in the midst of the blizzard, that rugged profile was the kind of thing that made one wish to loosen one’s scarf. “I best be off,” Saxton said gruffly. “But do stay out here as long as you like. We all must let it out somehow.” On that note, he dematerialized himself off into the waning night. In the midst of his scatter of molecules, he had a fleeting thought that when he came back the following evening, the entire mountaintop might well be free of snow. Ruhn certainly seemed to have the strength for it. Down in the training center’s physical therapy suite, Novo was in a debate with herself as she held her cell phone to her ear and caught a barrage of blather. “—good to talk to you! Oh, my God, it’s been sooooo long. I mean, after you moved out and…” As her sister’s high-pitched voice played piccolo over the connection, Novo closed her eyes and hopped up on one of the massage tables. The pro for returning the call was that it was a rip-the-Band-Aid-off solution to a problem that wasn’t going to go away: no pit in her stomach for nights while she put off what was inevitable. When Sophy wanted something, she could be tenacious as a fresh coat of paint. The con? Well, that was obvious. The female never called unless she had an agenda that benefited her, and the saccharine warm-up to the ask was bad soap opera acting draped over a hard-stack of narcissism. Oh, and if you pointed out that the female might as well skip that shit and get to the point? Then you enjoyed an hour-long crying jag that was as moving and authentic as a sock-puppet account on the Internet. So yeah, as painful as it was, it was much more efficient to let Sophy waltz through the preamble. And it made Novo think of those Tums ads where the person eats something that fights back and slaps the crap out of them? Except in this case, it was her new Samsung going straight-up ninja on the side of her head. “—Mommy and Daddy are so excited for Oskar and me. Anyway, I want you to be my maid of honor.” Wait…say whaaaaaaaat? A cold flush shot through Novo’s body—which was what happened when your prettier-than-you-are sister called to tell you she was mating your ex—and she distracted herself by getting annoyed with Sophy’s insistence on referring to their parents by those human titles. Like, really. Do you have to pretend you’re human just ’cuz you think it’s cool? And maid of honor? What the fuck? Were they doing a human ceremony and not a proper vampire one? “Novo? Hello? Did you hear me?” She cleared her throat. “Yes, I did—” “I know this must be a shock to you.” That voice lowered from Minnie Mouse all the way down to Michelle Tanner. “Novo, I realize this must be awkward. But you’re my sister. It wouldn’t be my big night without you.” Translation: It wouldn’t be even half as much fun if I get the trophy without you being at the award ceremony. “Novo?” For a moment, she closed her eyes and imagined speaking from the heart: I already know you won. You got him and you can have him. How about I just stipulate that here and now and we move along? Oh, and this was not a shock. It wasn’t even awkward. In fact, this “happy” announcement was the culmination of exactly what Sophy had set in motion two and a half years ago. The only moderate surprise was that it had taken this long for her to get to the mating. “Please, Novo. You have to be there.” No, she really didn’t. The healthy thing to do was to politely decline the kind frickin’ invitation, wish the female well, and pretend that she wasn’t actually going to be legally related to the male who’d left her for her sister. Unfortunately, that felt like a cop-out. A cowardly retreat. The larger part of Novo’s makeup, the part that never said die, that refused to be beat, that would take physical amputation over losing face or pride, mandated that she go. Just to prove to herself she was strong. Unbroken. Whole. In spite of the tragedy that had happened after Oskar had pulled out of their relationship. “Novo?” “Yeah. Sure. I’ll do it.” Cue the happy tears. The gratitude. The Cosmo magazine, Insta-gratuitous, Fakebook emotion: all for show. As her sister started rattling off maid-of-honor duties and bridal-shower details—again, what was with the human bullshit? She was getting mated, not married—Novo shook her head. “I gotta go.” “Wait, what? You can’t. You have a job to do and we need to discuss this. You need to organize my shower and my bachelorette party, and we need to pick out dresses—” “Bachelorette party? Shower? Sophy, what the fuck is all that?” There was a pause. “Please watch your language.” Like you’re the fucking Queen of England, Novo thought. “And I never imagined you as prejudicial.” Sophy went on the huff. “Humans have traditions that can be adapted around our ceremonies. Why not? They’ll make my night more special.” Riiight. Because it’s not really about the male you’re mating. It’s what you can post online for people to see. “I’ll do what I can. But I’m working.” “And you have a responsibility to me as your sister.” “I’m fighting in the war, Soph. Do you even know what that is? It’s the pesky thing that’s been killing people like you and me for the last couple of centuries. And you want me to get all thought up about a party? Come on.”","sourceLink":"https://allnovel.net/blood-fury-black-dagger-legacy-3/page-8.html","bookId":1777,"book":{"id":1777,"title":"Blood Fury (Black Dagger Legacy #3)","description":"Storyline: A vampire aristocrat, Peyton is well aware of his duty to his bloodline: mate with an appropriate female of his class and carry on his family’s traditions. And he thought he’d found his perfect match—until she fell in love with someone else. Yet when his split-second decision in a battle with the enemy endangers the life of another trainee, Peyton has to face the idea that his future, and his heart, actually lie with another. Novo, as a female in the Black Dagger Brotherhood’s training program, feels like she has to prove herself to everybody—and she has no interest in being distracted by falling in love. But when Peyton proves to be so much more than a rich playboy, she is forced to confront the tragedy that has broken her soul and closed her off from love. As the two grapple with Novo’s past and Peyton’s present, another couple must contend with an erotic connection that is unparalleled—and potentially scandalous. Saxton, who has had his heart broken, discovers in himself a deep-seated attraction to Ruhn, a new member of the household. But will the other male explore the connection? Or will he close his mind and his heart to what could be true love . . . and cost Saxton everything?","cover":"https://allnovel.net/images/blood-fury-black-dagger-legacy-3.jpg","author":"J.R. Ward","type":"Romance","source":"allnovel","link":"https://allnovel.net/blood-fury-black-dagger-legacy-3.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:31:48 AM"}}
