{"id":89989,"no":1,"title":"Page 1","content":"Chapter One\\n\\n Scythia, 2257 CE\\n\\n Women in the warrior society of Scythia had no need of men. Men, it was universally acknowledged, were good for only one thing—making babies.\\n\\n Tolerated only for short periods of time as a necessary, though inconvenient, evil, men were banned from even living on the planet. It was imperative, then, that no one ever find out about Princess Kai, of the Royal Family of Scythia, second daughter of the High Queen Ashlan. Princess Kai hid a terrible secret from the moment of her birth. Princess Kai was a man.\\n\\n His mind distracted with these heavy thoughts, Kai walked resignedly into the dressing chamber to allow his body servants to assist him with the heavy ceremonial robes. The rich, purple robes the Scythian royal family wore to all state occasions were oppressive in the heat, but the wedding this day was that of the royal heiress to the throne, Princess Delanon, and would be a solemn and momentous occasion.\\n\\n The heavy robes were good for one thing—hiding Kai’s shame. On Scythia, where males were considered defective and undesirable, the secret would surely mean imprisonmentor even death for Kai and his mother. While the queen was a powerful and respected monarch, the laws were quite clear on the subject. The only men or non-persons who were allowed to enter their world were traders or ambassadors from other planets, and then only temporarily.\\n\\n The worst thing was that time was running out for Kai. His mother’s council was already urging her to find Kai a husband, and Kai was very afraid that when that time came, he was doomed. His sister, Princess Delanon, was already making plans to take over the throne from the aging queen. In their war-like society, the queen was expected to lead the army, and Queen Ashlan was far too old to go into battle. She would be stepping aside soon for the royal succession, and once Delanon became queen, Kai knew she would insist a consort be found for him immediately to get him away from Scythia.\\n\\n Delanon’s wedding ceremony on this day was the first step in the process. Once a female child was born, Delanon and her consort would go their separate ways until such time, if any, as Delanon might want another child. The consort would return to his home planet in the meantime, and Delanon would be free to live her own life. The arrangement was mutually beneficial. The royal consort was well-compensated with a rich dowry, and it was common for male consorts to take love slaves when they got back home to satisfy their sexual needs outside the marriage. As for Delanon, she would have a girl child to rear who would one day, in her turn, become queen, and in the meantime she was free to take lovers of her own.\\n\\n Kai was the queen’s youngest child. His sister, Delanon had been born a healthy, beautiful girl, the heiress to the throne, so another child was not required, but his mother had done something almost unthinkable in their culture. The warrior queen had fallen in love at first sight with her royal consort. After the Princess Delanon was born, the queen managed to visit her consort again and again, telling her advisors she was trying for another child. When she became pregnant for the second time, she was ecstatic, but her happiness was short-lived. Her beloved consort, Willon, was killed in a battle on his home planet of Alger.\\n\\n The queen was almost inconsolable with grief, and when her child was born a male, she was paralyzed by fear and dread. The child looked so much like his father that it hurt her heart to gaze on him, but neither could she bear to part with him. The idea of giving the boy child to the priestesses was unthinkable. Instead, since the hour of Kai’s birth, his mother concealed his gender by demanding that only she or the women of her chamber tend to Kai. It was almost unheard of not to hire a royal nursemaid, but she was the queen and her word was law. The women of her chamber were all fiercely loyal to their queen, and they agreed to keep her secret.\\n\\n Her people whispered about her unnatural attachment to the child, but never to her face and never within her hearing. As Kai grew older, the queen warned him that it would be disastrous beyond measure for both of them should anyone discover Kai was a boy.\\n\\n When it was time to show himself on the royal dais behind his sister, Kai remembered to make short steps like he’d been carefully taught, and keep his eyes demurely down. As a royal princess, he was carefully guarded, and he stood between two of the large women who were his personal escorts. Kai had taken after his father’s people, and he was even larger than the tall, heavily built Scythians. He was taller than both his mother and his sister, though his body was lean. His mother had long encouraged him to lift weights to develop pectoral muscles in his chest, to simulate the swelling of a woman’s breasts. The weights also kept his waist trim, so his chest and abdominal muscles were large and well-defined.\\n\\n His undesirable genitals were a constant trial to him, and as they grew, it was getting harder and harder to push things between his legs and cover up the leftover bulges in his leggings. He bitterly resented having to live the lie, but it was all he’d ever known. He was also fiercely protective of his mother and would do anything she asked of him.\\n\\n His sister, Delanon, came forward on the dais, wearing her diamond-studded crown. She cast a glance over at Kai and frowned. They’d never gotten along as he’d once longed to. She was jealous of the attention he was paid by his mother, not knowing the true reason behind it. Their mother had never trusted the envious child not to reveal the secret, and from the looks she gave Kai when she thought their mother wasn’t looking, Kai was only too glad she didn’t have that ammunition to use against him.\\n\\n Her new husband, another prince of Alger like Kai’s father had once been, stepped up beside her for the formal vows. Kai was fascinated by him. Not because he was particularly good looking—the poor man’s teeth were too big and stuck out in front, and he had a little bald spot on the back of his head. But because he was a man, and Kai had never seen many men outside of a few pictures. When he turned to take Delanon’s hand for the final vows, Kai could see the large bulge in the front of his leggings, and he felt an odd little flutter down deep inside, one that shot straight to his own carefully strapped-down genitals, and made them ache a little. What in the world was that about?\\n\\n He’d been around females all his life in various stages of undress and had never been aroused before. Now, with just one look at his new brother-in-law’s large bulge, the long piece of flesh between his legs was trying to thicken. Thank the gods Kai was wearing his robes. Surreptitiously, he tried pinching his thigh really hard to keep his own flesh from swelling and hardening.\\n\\n It had been happening more and more often since he was about twelve cycles, and recently it had been occurring almost every day—sometimes several times a day. He had disturbing dreams and often he would awaken in the mornings to find a sticky mess on his stomach. He never told his mother, but he worried that something was wrong with him. He squirmed a little in embarrassment, just thinking about it. He’d confided to Merrial, a servant who’d been with him since he was a baby, but she hadn’t been much help. She told him she had no idea what the substance might be, or why the flesh between his legs grew so rigid, but not to worry his mother with the problem. She had so much on her mind already.\\n\\n Merrial had never had children of her own, and therefore she’d never seen a man naked. The laws of Scythia were so strict and narrow that even pictures of males in any state of undress were strictly forbidden. Punishments for infractions were severe, and few Scythians ever tried to circumvent this law. Really, most women had very little interest in seeing the male form anyway. It was whispered that there were deviants, of course, who seemed to like the men they mated with, but these women were cast out and forced to leave with their mates.\\n\\n Their priestesses were quite clear on the subject. The goddess of their religion had forbidden love and affection between the sexes. She had been quite clear on that subject. Anyone who loved a member of the opposite sex was a deviant, plain and simple, and would be cast from their society.\\n\\n His mother, the noble Queen Ashlan, had warned him never to reveal his true sex, as it was far too dangerous. It was said on his planet when a woman had a male child, which was roughly half the time, she had delivered a baby that was a non-person. This child would then be immediately turned over to the priestesses, who followed the ancient law and custom of re-assimilation of all non-persons born to Scythian women. According to their ancient beliefs, males had birth defects between their legs and in their brains.\\n\\n In Scythia’s ancient past, most male children were simply cast off—except, of course, those kept as breeders—and sent to their biological father’s planet to be raised. Centuries before, however, men who had been cast off while children mounted a bloody rebellion against the Scythian monarchy.It had been a terrible, costly war, even though the rebels had eventually been defeated, and all the leaders executed. After that, it was decided that if these brain-damaged creatures were born to Scythian women, they would be handed over to the priestesses to be re-assimilated back to the goddess. They said the children were then reborn as females. It was supposed to be a quick and merciful process. Scythian males were too volatile, too unpredictable to be allowed to grow up.\\n\\n Kai’s sister interrupted his daydreams by giving him an evil look that froze the marrow in his bones. He stopped fidgeting right away and cast his eyes back down, not wishing to get into yet another argument with her.\\n\\n When the ceremony was finally over, he followed the crowd back into the banquet room for the wedding feast, wondering how quickly he could make an excuse to go back to his rooms. His mother caught his eye and motioned to him to come near. When he got close to her, she drew him aside, clearly excited about something, and Kai didn’t think it was only his sister’s wedding.\\n\\n “The matchmaker I hired has found you a match, darling. A husband!”\\n\\n Kai felt the blood drain from his face and he staggered back a step. “B-but Mother, I-I can’t! What will he do when he finds out? He’ll send me back, or even get so angry he’ll have me executed.”\\n\\n “He won’t do that,” she said firmly. “I’ve chosen carefully and had a wonderful stroke of luck. I’ve been looking for a chance like this ever since you turned sixteen. Thanks to the gods we finally have the perfect man.” \\n\\n","sourceLink":"https://allnovel.net/reluctant-alpha-love-slaves-of-the-alphas-4/page-1.html","bookId":1594,"book":{"id":1594,"title":"Reluctant Alpha (Love Slaves of the Alphas #4)","description":"Storyline: Reluctant Alpha (Love Slaves of the Alphas #4) \\n Handsome, young Kai is living a lie. On Scythia, male children are “rejected” so his mother, the queen, hid his true sex all his life. On this planet of Amazon-like women, he’s been able to hide out, but his mother needs to get him safely away from the planet, arranging a marriage to the powerful Lycan alpha. Lucas likes men but is being pressured to find a female and have an heir. Reluctantly, he agrees to meet Princess Kai, and is shocked to discover Kai is no princess, but a handsome young man! Instantly recognizing him as his bloodmate, Lucas is still furious at the deception. He mates with Kai and takes him home, but the lies between them threaten to tear them apart. Kai is still harboring a terrible secret—one that will destroy his world if it ever becomes known.\\n","cover":"https://allnovel.net/images/reluctant-alpha-love-slaves-of-the-alphas-4.jpg","author":"Shannon West","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/reluctant-alpha-love-slaves-of-the-alphas-4.html","creation":"Oct 5, 2019 8:57:45 AM","modification":"Oct 5, 2019 5:38:54 PM"}}
