{"id":74243,"no":14,"title":"Page 14","content":"IT’S DECIDED THAT DADDY WILL propose to Ms. Rothschild on Saturday, after hiking on one of their favorite trails. He’s going to do it right by a waterfall. The plan is for Peter and Kitty and me to hide behind trees and record the whole thing, then pop out with a romantic picnic basket. Daddy was nervous about the video part, in case Ms. Rothschild doesn’t say yes, but Kitty begged. “It’s for Margot,” she kept saying, when really she’s just nosy and wants to see it go down. Of course I do too. Peter’s along for the ride, literally. He’s giving us a ride. That morning, before he leaves to pick up Ms. Rothschild, Daddy says, “Guys, if it doesn’t look like it’s going to be a yes, can you stop videotaping?” I’m carefully wrapping roast beef sandwiches in wax paper. I look up to say, “She’s going to say yes.” “Just promise me you’ll quietly slip away,” he says. He gives Kitty a pointed look. “You got it, Dr. Covey,” Peter says, lifting his hand for a high five. As they slap hands, I say, “Daddy, did you pack the ring?” “Yup!” Then he frowns. “Wait, did I?” He pats his pockets and unzips the inside compartment of his windbreaker. “Damn, I forgot it!” Then he runs upstairs. Peter and I exchange a look. “I’ve never seen your dad so stressed out,” he says, popping a grape in his mouth. “He’s usually a cool customer.” I slap Peter’s hand away from the grapes. Kitty steals a grape and says, “He’s been like this all week.” Daddy runs back downstairs with the engagement ring. Kitty and I helped him pick it out. It’s a white-gold princess cut with a diamond halo. I was certain about the princess cut and Kitty was certain about the halo. Daddy heads off to pick up Ms. Rothschild, and I finish putting together the picnic basket. I’m glad to have an excuse to bring it out. I bought it from a yard sale ages ago, and I haven’t used it once. I pack a bottle of champagne, a perfect cluster of grapes, the sandwiches, a wedge of Brie, crackers. “Pack a bottle of water, too,” Peter says. “They’ll be dehydrated from the hike.” “And probably from all the crying after she says yes,” Kitty says. “Should we play some music for them, when he gets down on one knee?” Peter suggests. “We didn’t discuss that part of the plan, and Daddy’s nervous enough as it is,” I say. “He can’t be thinking about how we’re hiding in the bushes waiting to cue up music for them. It’ll make him self-conscious.” “Besides, we can add the music in post,” Kitty says. “We need to be able to hear the dialogue.” I give her a look. “Katherine, this isn’t a movie. This is real life.” I leave them to go to the downstairs bathroom, and after I wash my hands, I’m turning off the faucet when I hear Kitty say, “Peter, when Lara Jean’s gone, will you still come visit me sometimes?” “Course I will.” “Even if you guys break up?” There’s a pause. “We’re not breaking up.” “But if you do?” she presses. “We won’t.” She ignores this. “Because we never see Josh anymore, and he said he’d visit too.” Peter scoffs. “Are you kidding me? You think I’m the same as Sanderson? Me? I’m a completely different league than him. I’m insulted you would even compare us.” Kitty lets out a relieved kind of laugh, the kind that sounds more like a sigh. “Yeah, you’re right.” “Trust me, kid. You and I have our own thing.” I love him so much for that I could cry. He’ll look after Kitty for me, I know he will. * * * Daddy told us they’d get to the waterfall around noon, so we should be there by eleven forty-five to get into position. We end up going a little earlier than that, just to be on the safe side, at Kitty’s insistence. We pick a hiding spot far enough away that Ms. Rothschild won’t spot us, but close enough to see. Kitty and I hide behind a tree, and Peter crouches behind one close by, phone in his hand, ready to record. Kitty wanted to be the one to do it, but I make the executive decision that it should be Peter, because he isn’t as emotionally invested in this moment and will have a steady hand. Just after twelve, they come up the trail. Ms. Rothschild is laughing about something, and Daddy is laughing robotically with that same nervous look on his face. It’s funny to watch them interact when she doesn’t know we’re watching. Kitty was right; it is a bit like a movie. He looks somehow younger next to her—maybe it’s because he’s in love. They walk over to the waterfall, and Ms. Rothschild sighs with happiness. “God, it’s gorgeous up here,” she says. “I can barely hear anything,” Kitty whispers to me. “The waterfall is too loud.” “Shh. You’re the one being loud.” “Let’s take a picture,” Daddy says, fishing around in his windbreaker pocket. “I thought you were morally opposed to selfies!” She laughs. “Hold on, let me try and fix my hair for this momentous occasion.” She pulls her hair out of its ponytail holder and tries to fluff it up. Then she pops what looks like a cough drop or a piece of candy in her mouth. Daddy’s taking so long that for a second I’m afraid he’s lost the ring or his nerve, but then he gets down on one knee. Daddy clears his throat. It’s happening. I grab Kitty’s hand and squeeze it. Her eyes are shining. My heart is bursting. “Trina, I never expected to fall in love again. I thought I got my shot, and I was okay with that, because I had my girls. I didn’t realize anything was missing. Then came you.” Ms. Rothschild’s hands are covering her mouth. She has tears in her eyes. “I want to spend the rest of my life with you, Trina.” Ms. Rothschild starts choking on her candy, and Daddy leaps up off his knee and starts pounding her on the back. She’s coughing like crazy. From his tree Peter whispers, “Should I go do the Heimlich on her? I know how to do it.” “Peter, my dad’s a doctor!” I whisper back. “He’s got it.” As her coughing subsides, she stands up straight and wipes her eyes. “Wait. Were you asking me to marry you?” “I was trying to,” Daddy says. “Are you all right?” “Yes!” She claps her hands to her cheeks. “Yes, you’re all right, or yes, you’ll marry me?” Daddy asks her, and he’s only half kidding. “Yes, I’ll marry you!” she screams, and Daddy reaches for her, and they kiss. “This feels private,” I whisper to Kitty. “It’s all part of the show,” she whispers back. Daddy hands Ms. Rothschild the ring box. I can’t quite make out what he says next, but whatever it was, it makes her double over laughing. “What’s he saying?” Kitty asks me, just as Peter says, “What did he say?” “I can’t hear! Both of you be quiet! You’re ruining the video!” Which is when Ms. Rothschild looks over in our direction. Shoot. We all pop back behind our respective trees, and then I hear Daddy’s wry voice call out, “You can come out, guys. She said yes!” We run out from behind the trees; Kitty launches herself into Ms. Rothschild’s arms. They fall over onto the grass, and Ms. Rothschild is laughing breathlessly, her laughter echoing through the woods. I hug Daddy, and meanwhile Peter’s still playing videographer, recording the moment for posterity like the good boyfriend he is. “Are you happy?” I ask, looking up at my dad. His eyes brimming with tears, he nods and hugs me tighter. And just like that, our little family grows bigger.","sourceLink":"https://allnovel.net/always-and-forever-lara-jean-to-all-the-boys-i-ve-loved-before-3/page-14.html","bookId":1775,"book":{"id":1775,"title":"Always and Forever, Lara Jean (To All the Boys I\u0027ve Loved Before #3)","description":"Storyline: Lara Jean is having the best senior year. And there’s still so much to look forward to: a class trip to New York City, prom with her boyfriend Peter, Beach Week after graduation, and her dad’s wedding to Ms. Rothschild. Then she’ll be off to college with Peter, at a school close enough for her to come home and bake chocolate chip cookies on the weekends. Life couldn’t be more perfect! At least, that’s what Lara Jean thinks . . . until she gets some unexpected news. Now the girl who dreads change must rethink all her plans—but when your heart and your head are saying two different things, which one should you listen to?","cover":"https://allnovel.net/images/always-and-forever-lara-jean-to-all-the-boys-i-ve-loved-before-3.jpg","author":"Jenny Han","type":"Romance","source":"allnovel","link":"https://allnovel.net/always-and-forever-lara-jean-to-all-the-boys-i-ve-loved-before-3.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:30:26 AM"}}
