{"id":74255,"no":26,"title":"Page 26","content":"AT STEVE BLEDELL’S HOUSE, A\n bunch of people are in the family room smoking pot and watching soccer on the huge flat-screen\n TV\n mounted on the wall. Lucas is here, and when I tell him my big news, he picks me up and spins me around. “You’re getting out of here too!” he shouts.\n “Well, I’m only going next door to North Carolina,” I say, laughing. What an unexpected thrill to say those words out loud. “It’s not that far.”\n “But it’s\n away\n .” Lucas sets me back down on the floor and puts his hands on my cheeks. “This is going to be very good for you, Lara Jean.”\n “You think?”\n “I know it.”\n I’m in the kitchen getting myself a Coke when Genevieve walks in, barefoot, wearing a Virginia Tech hoodie and carrying a beer in a Virginia Tech koozie. She sways on her feet before saying, “I heard you got into Chapel Hill. Congrats.”\n I wait for the whammy, the underhanded little dig, but it doesn’t come. She just stands there, a little drunk but sober enough. “Thank you,” I say. “Congrats on Tech. I know you always wanted to go there. Your mom must be happy.”\n “Yeah. Did you hear Chrissy’s going to Costa Rica? Lucky bitch.” She takes a sip of her beer. “Chapel Hill and here are pretty far away, huh?”\n “Not that far. Just three hours,” I lie.\n “Well, good luck with that. I hope he stays as devoted to you as he is today. But knowing him, I seriously doubt it.” Then she lets out a loud belch, and the look of startled surprise on her face is so funny, I almost laugh out loud. For a second it looks like she might too, but she stops herself, glares, and leaves the kitchen.\n I only catch glimpses of Peter throughout the night, talking to other people, swigging on his beer. He seems to be in a better mood. He’s smiling; his face is a little flushed from the beer. He’s drinking a lot more than I’ve seen him drink.\n Close to one, I go looking all around the house for Peter, and when I find him, he’s with a bunch of people playing flip cup on the Ping-Pong table in Steve’s garage. They are all cracking up over something he just said. He sees me standing at the top of the steps and beckons to me. “Come play with us, Covey,” he says, too loudly.\n My feet stay planted on the steps. “I can’t. I have to get home.”\n His smile slips. “All right, I’ll take you.”\n “No, it’s fine, I’ll get a ride or call an Uber to come get me.” I turn to leave, and Peter follows me.\n “Don’t do that. I’ll take you,” he says.\n “You can’t. You’re drunk.” I try not to make the words sound mean, but it is what it is.\n He laughs. “I’m not drunk. I’ve only had three beers over the course of, what, three hours? I’m fine. You don’t drink so you don’t know, but that’s nothing. I promise.”\n “Well, I can smell your breath, and I know you wouldn’t pass a breathalyzer.”\n Peter peers at me. “Are you mad?”\n “No. I just don’t want you driving me home. You shouldn’t drive yourself home either. You should just spend the night here.”\n “Aw, you are mad.” He leans closer to me and looks around before he says, “I’m sorry for before. I should’ve been more excited for you. I was just tired is all.”\n “It’s fine,” I say, thought it isn’t, not completely.\n Stormy used to have a saying. Leave with the one you came with, unless he’s a drunk—then find your own way home. I end up getting a ride home from Lucas, and I make it before my curfew, just. After last night, I can’t be pushing it.\n Peter keeps texting me, and I’m petty enough to be glad he’s not enjoying himself anymore. I make him wait long minutes before I text back a terse reply not to drive home tonight, and he texts back a picture of him lying on Steve’s couch, with somebody’s jacket as a blanket.\n I can’t sleep, so I go downstairs to make myself a grilled cheese sandwich. Kitty’s down there too, watching late-night\n TV\n and playing a game on her phone. “Want a grilled cheese?” I ask.\n “Sure,” she says, looking up from her phone.\n I make Kitty’s first. I keep pressing the sandwich into\n the pan, so the bottom gets crispy and the sandwich flattens. I cut off another dab of butter and watch it melt into a puddle, still feeling a bit out of sorts from the night, when out of nowhere it comes to me. Direct contact. The bread needs direct contact with the hot pan to get the right amount of crisp.\n That’s it. That’s the answer to my chocolate chip cookie problem. All this time, I’ve been using my Silpat baking sheet so the cookies don’t stick to the pan. Parchment paper is the answer. It’s whisper thin, unlike Silpat. With parchment paper, the dough has more direct contact with heat, and therefore the dough spreads more! Voilà, thinner cookies.\n I’m so determined, I start grabbing ingredients from the pantry. If I make the dough right this minute, it can rest all night, and I’ll be able to test my theory tomorrow.\n * * *\n I sleep in again, because there’s no school thanks to teacher meetings and because I was up till three making my dough and watching\n TV\n with Kitty. When I wake up, just like the day before there are texts from Peter.\n I’m sorry.\n I’m a dick.\n Don’t be mad.\n I read his texts over and over. They’re spaced minutes apart, so I know he must be fretting over whether I’m still\n mad or not. I don’t want to be mad. I just want things to go back to how they were before.\n I text back:\n Do you want to come over for a surprise?\n He immediately replies:\n ON MY WAY\n “The perfect chocolate chip cookie,” I intone, “should have three rings. The center should be soft and a little gooey. The middle ring should be chewy. And the outer ring should be crispy.”\n “I can’t hear her give this speech again,” Kitty says to Peter. “I just can’t.”\n “Be patient,” he says, squeezing her shoulder. “It’s almost over, and then we get cookies.”\n “The perfect cookie is best eaten while still warm, but still delicious at room temperature.”\n “If you don’t quit talking, they won’t be warm anymore,” Kitty grumbles. I shoot her a glare, but truthfully, I’m glad she’s here to be a buffer between Peter and me. Her presence makes things feel normal.\n “In the baking world, it is a truth universally acknowledged that Jacques Torres has perfected the chocolate chip cookie. Peter, you and I tasted it for ourselves just a few months ago.” I’m really stretching it now to make them\n suffer. “How will my cookie measure up? Spoiler alert. It’s amazing.”\n Kitty slides off her stool. “That’s it. I’m out of here. A chocolate chip cookie isn’t worth all this.”\n I pat her on the head. “Oh, naive little Kitten. Dear, foolish girl. This cookie is worth all this and more. Sit or you will not partake.”\n Rolling her eyes, she sits back down.\n “My friends, I have finally found it. My white whale. My golden ring. The cookie to rule them all.” With a flourish, I whisk off the tea towel and present them with my flat, chewy, non-puffy cookies, artfully arranged on the plate.\n To my dismay, Peter shoves one in his mouth whole. With his mouth full he says, “Delicious!”\n He’s still worried that I’m upset, so he’ll say anything right now. “Eat slower. Savor it, Peter.”\n “I am, trust me.”\n Kitty is the true critic to please. Eagerly I say, “I used muscovado sugar. Can you taste that hint of molasses?”\n She is munching thoughtfully. “I can’t taste the difference between this one and the one you made two batches ago.”\n “This time I used chocolate fèves and not chunks. See the way the chocolate melts in streaks?”\n “What’s a fève?”\n “It’s a disc.”\n “Then just say disc. Also didn’t Daddy get mad because you spent thirty dollars on chocolate?”\n “I wouldn’t say he was\n mad\n . Maybe annoyed. But I think\n he’ll agree that it’s worth it.” Kitty gives me a look, like,\n Yeah, right\n , and I mumble, “It’s Valrhona, okay? It doesn’t come cheap. And also, it was a two-pound bag! Look, that isn’t the point. Can’t you tell how much crispier the edges are, and how much chewier it is in the center? Do I need to explain to you guys again about Silpat versus parchment paper?”\n “We got it,” Kitty says.\n Peter hooks his finger into the loop of my jeans and pulls me closer. “Best cookie of my life,” he declares. He’s really laying it on thick, but I’m not quite done being mad.\n “You guys are so corny,” Kitty says. “I’m taking my share of the cookies and getting out of here.” She starts stacking cookies on a napkin, rapid-fire.\n “Only take three!”\n She puts two back, then heads upstairs.\n Peter waits until she is gone before he asks, “Are you still pissed at me? I’ll never drink on a night I’m supposed to drive you ever again, I promise.” He gives me his winning smile.\n “Are you really okay with me going to\n UNC\n ?” I ask him.\n His smile fades, and there is a slight hesitation before he nods. “It’s like you said. We’ll get the hang of it, whatever it is.” For the briefest of moments his eyes search mine, and I know he’s looking for reassurance. That’s when I put my arms around him and hug him tight to me, tight enough that he knows I’m here; I won’t let go. \n","sourceLink":"https://allnovel.net/always-and-forever-lara-jean-to-all-the-boys-i-ve-loved-before-3/page-26.html","bookId":1775,"book":{"id":1775,"title":"Always and Forever, Lara Jean (To All the Boys I\u0027ve Loved Before #3)","description":"Storyline: \n Lara Jean is having the best senior year. \n And there’s still so much to look forward to: a class trip to New York City, prom with her boyfriend Peter, Beach Week after graduation, and her dad’s wedding to Ms. Rothschild. Then she’ll be off to college with Peter, at a school close enough for her to come home and bake chocolate chip cookies on the weekends. \n Life couldn’t be more perfect! \n At least, that’s what Lara Jean thinks . . . until she gets some unexpected news. \n Now the girl who dreads change must rethink all her plans—but when your heart and your head are saying two different things, which one should you listen to?\n \n","cover":"https://allnovel.net/images/always-and-forever-lara-jean-to-all-the-boys-i-ve-loved-before-3.jpg","author":"Jenny Han","type":"Romance","source":"allnovel","link":"https://allnovel.net/always-and-forever-lara-jean-to-all-the-boys-i-ve-loved-before-3.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:30:26 AM"}}
