{"id":74267,"no":38,"title":"Page 38","content":"CHRIS IS THE FIRST TO leave. she comes by the house that week and says, “I can’t go to your dad’s wedding this weekend. I’m leaving for the Dominican Republic tomorrow.” “What?” “I know. I’m sorry.” Chris doesn’t look the least bit sorry; she has a huge grin on her face. “It’s so crazy. A spot opened up for me at an eco-hotel, and there’s no way I can pass this up. They speak Spanish in the Dominican Republic, too, right?” “Yes. But I thought you were going to Costa Rica!” Shrugging, she says, “This other opportunity came up so I pounced on it.” “But—I can’t believe you’re leaving so soon! You weren’t supposed to leave until August. When do you come back?” “I don’t know. . . . I guess that’s the beauty of it. I could stay for six months, or something else will come up and I’ll go there.” I blink. “So you’re leaving for good, then?” “Not for good . Just for now.” Something inside of me knows that this really is for good. I don’t see Chris coming back here a year from now to go to Piedmont Virginia Community College. This is Chris, the stray cat, who comes and goes as she pleases. She’ll always land on her cat tippy-toes. “Don’t look so sad. You’ll be fine without me. You have Kavinsky.” For a second I can’t breathe. Just hearing his name is like a dagger in my heart. “Anyway we’re all leaving soon enough. I’m just glad I’m not going to be left behind.” That’s how it would feel to her—staying here, going to a community college, working at Applebee’s. I feel a surge of gladness that instead of that, she’s off on an adventure. “I just can’t believe you’re leaving so soon.” I don’t tell her that Peter and I broke up, that I don’t have him anymore. Today isn’t about me and Peter; it’s about Chris, and her exciting new future. “Can I at least come help you pack?” “I’m already packed! I’m only bringing the essentials. My leather jacket, bikinis, a few crystals.” “Shouldn’t you bring sneakers and work gloves and that kind of thing, just in case?” “I’ll wear sneakers on the plane, and whatever else I need, I’ll get when I’m there. That’s the whole point of an adventure. Pack light and figure the rest out as you go.” I thought we’d have more time, me and Chris in my bedroom, sharing secrets late into the night, eating chips in bed. I wanted to cement our friendship before she left: Lara Jean and Chrissy, like the old days. It’s all ending.","sourceLink":"https://allnovel.net/always-and-forever-lara-jean-to-all-the-boys-i-ve-loved-before-3/page-38.html","bookId":1775,"book":{"id":1775,"title":"Always and Forever, Lara Jean (To All the Boys I\u0027ve Loved Before #3)","description":"Storyline: Lara Jean is having the best senior year. And there’s still so much to look forward to: a class trip to New York City, prom with her boyfriend Peter, Beach Week after graduation, and her dad’s wedding to Ms. Rothschild. Then she’ll be off to college with Peter, at a school close enough for her to come home and bake chocolate chip cookies on the weekends. Life couldn’t be more perfect! At least, that’s what Lara Jean thinks . . . until she gets some unexpected news. Now the girl who dreads change must rethink all her plans—but when your heart and your head are saying two different things, which one should you listen to?","cover":"https://allnovel.net/images/always-and-forever-lara-jean-to-all-the-boys-i-ve-loved-before-3.jpg","author":"Jenny Han","type":"Romance","source":"allnovel","link":"https://allnovel.net/always-and-forever-lara-jean-to-all-the-boys-i-ve-loved-before-3.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:30:26 AM"}}
