{"id":74238,"no":9,"title":"Page 9","content":"WHEN I WAKE UP IN the morning, it’s the first thing I think of. How I’m not going to UVA , how I don’t even know where I’m going. My whole life I’ve never had to worry about that. I’ve always known where my place is, where I belong. Home. As I lie there in bed, I start a mental tally of all the things I’m going to miss out on, not going to a college just around the corner from home. The moments. Kitty’s first period. My dad’s an OB , so it’s not like he doesn’t have it covered, but I’ve been waiting for this moment, to give Kitty a speech about womanhood that she’ll hate. It might not happen for another year or two. But I got mine when I was twelve and Margot got hers when she was eleven, so who knows? When I got my first period, Margot explained all about tampons and what kind to use for what days, and to sleep on your belly when your cramps are particularly bad. She made me feel like I was joining some secret club, a woman’s club. Because of my big sister, the grief I felt about growing up was less acute. Kitty likely won’t have either of her big sisters here, but she does have Ms. Rothschild, and she’s only just across the street. She’s grown so attached to Ms. Rothschild that she’ll probably prefer a period talk from her anyway, truth be told. Even if in the future Daddy and Ms. Rothschild were to break up, I know Ms. Rothschild would never turn her back on Kitty. They’re cemented. I’ll miss Kitty’s birthday, too. I’ve never not been at home for her birthday. I’ll have to remind Daddy to carry on our birthday-sign tradition. For the first time ever, all of the Song girls will be living truly apart. We three probably won’t ever live in the same house together again. We’ll come home for holidays and school breaks, but it won’t be the same. It won’t be what it was. But I suppose it hasn’t been, not since Margot left for college. The thing is, you get used to it. Before you even realize it’s happening, you get used to things being different, and it will be that way for Kitty too. At breakfast I keep stealing glances at her, memorizing every little thing. Her gangly legs, her knobby knees, the way she watches TV with a half smile on her face. She’ll only be as young as this for a little while longer. Before I leave, I should do more special things with her, just the two of us. At the commercial break she eyes me. “Why are you staring at me?” “No reason. I’m just going to miss you is all.” Kitty slurps the rest of her cereal milk. “Can I have your room?” “What? No!” “Yeah, but you won’t be living here. Why should your room just sit there and go to waste?” “Why do you want my room and not Margot’s? Hers is bigger.” Practically, she says, “Yours is closer to the bathroom and it’s got better light.” I dread change, and Kitty steps right into it. She leans in extra hard. It’s her way of coping. “You’ll miss me when I’m gone, I know it, so quit pretending you won’t,” I say. “I’ve always wondered what it would be like to be an only child,” she says in a singsong voice. When I frown, she hurries to say, “Only kidding!” I know Kitty’s just being Kitty, but I can’t help but feel a tiny stab of hurt. Why would anyone want to be an only child? What’s so great about having no one to warm your feet up against on a cold winter night? “You’ll miss me,” I say, more to myself than to her. She doesn’t hear me anyway; her show is back on. * * * When I get to school, I go straight to Mrs. Duvall’s office to tell her the news. As soon as Mrs. Duvall sees the look on my face, she says, “Come sit down,” and she gets up from behind her desk and closes the door behind me. She sits in the chair next to mine. “Tell me.” I take a deep breath. “I didn’t get into UVA .” Now that I’ve said it a few times, you’d think it would be easier to get the words out, but it’s not—it’s worse. She heaves a sigh. “I’m surprised. I’m very, very surprised. Your application was strong, Lara Jean. You’re a wonderful student. I did hear that they got a few thousand more applicants this year than in years past. Still, I would’ve thought you’d be wait-listed at the very least.” All I can do is give her a small shrug in response, because I don’t trust my voice right now. She leans forward and hugs me. “I heard from a source in the admissions department that William and Mary will be sending out their decisions today, so buck up for that. And there’s still UNC , and U of R. Where else did you apply? Tech?” I shake my head. “ JMU .” “All great schools. You’ll be fine, Lara Jean. I’m not the least bit worried about you.” I don’t say what I’m thinking, which is that we both thought I’d get into UVA , too; instead I just offer a weak smile. * * * When I walk out, I see Chris at the lockers. I tell her the news about UVA , and she says, “You should come with me and work on a farm in Costa Rica.” Stunned, I lean back against the wall and say, “Wait—what?” “I told you about this.” “No, I don’t think you did.” I’ve known Chris wasn’t going away to college, that she was going to go to community college first and then see. She doesn’t have the grades, or much inclination, really. But she never said anything about Costa Rica. “I’m going to take a year off and go work on farms. You work for like five hours, and they give you room and board. It’s amazing.” “But what do you know about farming?” “Nothing! It doesn’t matter. You just have to be willing to work; they’ll teach you. I could also work at a surfing school in New Zealand, or learn how to make wine in Italy. Basically, I could go anywhere. Doesn’t that sound amazing?” “It does. . . .” I try to smile but my face feels tight. “Is your mom okay with it?” Chris picks at her thumbnail. “Whatever, I’m eighteen. She doesn’t have a choice.” I give her a dubious look. Chris’s mom is tough. I have a hard time picturing her being okay with this plan. “I told her I’d do this for a year and then come back and go to PVCC , and then transfer to a four-year college,” she admits. “But who knows what will happen? A year is a long time. Maybe I’ll marry a DJ , or join a band, or start my own bikini line.” “That all sounds so glamorous.” I want to feel excited for her, but I can’t seem to muster up the feeling. It’s good that Chris has her own thing to look forward to, something that no one else in our class is doing. But it feels like everything all around me is shifting in ways I didn’t expect, when all I want is for things to stand still. “Will you write me?” I ask. “I’ll Snapchat everything.” “I’m not on Snapchat, and besides, that’s not the same thing.” I nudge her with my foot. “Send me a postcard from every new place you go, please.” “Who knows if I’ll even have access to a post office? I don’t know how post offices work in Costa Rica.” “Well, you can try.” “I’ll try,” she agrees. I haven’t seen as much of Chris this year. She got a job hostessing at Applebee’s, and she’s become very close with her work friends. They’re all older, some of them have kids, and they pay their own bills. I’m pretty sure Chris hasn’t told any of them she still lives at home and pays exactly no bills. When I visited her there last month, one of the servers said something about hoping to make enough that night for rent, and she looked at Chris and said, “You know how it is,” and Chris nodded like she did. When I gave her a questioning look, she pretended not to see. The warning bell rings, and we start walking to our first-period classes. “Kavinsky must be freaking out that you didn’t get into UVA ,” Chris says, checking her reflection in a glass door we walk past. “So I guess you guys will do long-distance?” “Yeah.” My chest gets tight. “I guess.” “You should definitely get people in place to keep an eye on the situation,” she says. “You know, like spies? I think I heard Gillian McDougal got in. She’d spy for you.” I give her a look. “Chris, I trust Peter.” “I know—I’m not talking about him! I’m talking about random girls on his floor. Dropping by his room. You should give him a picture of you to keep him company, if you know what I mean.” She frowns at me. “Do you know what I mean?” “Like, a sexy picture? No way!” I start backing away from her. “Look, I’ve gotta go to class.” The last thing I want to do is think about Peter and random girls. I’m still trying to get used to the idea that we won’t be together at UVA this fall. Chris rolls her eyes. “Calm down. I’m not talking about a nudie. I would never suggest that for you of all people. What I’m talking about is a pinup-girl shot, but not, like, cheesy. Sexy. Something Kavinsky can hang up in his dorm room.” “Why would I want him to hang up a sexy picture of me in his dorm room for all the world to see?” Chris reaches out and flicks me on the forehead. “Ow!” I shove her away from me and rub the spot where she flicked me. “That hurt!” “You deserved it for asking such a dumb question.” She sighs. “I’m talking about preventative measures. A picture of you on his wall is a way for you to mark your territory. Kavinsky’s hot. And he’s an athlete. Do you think other girls will respect the fact that he’s in a long-distance relationship?” She lowers her voice and adds, “With a Virgin Mary girlfriend?” I gasp and then look around to see if anyone heard. “Chris!” I hiss. “Can you please not?” “I’m just trying to help you! You have to protect what’s yours, Lara Jean. If I met some hot guy in Costa Rica with a long-distance gf who he wasn’t even sleeping with? I don’t think I’d take it very seriously.” She gives me a shrug and a sorry-not-sorry look. “You should definitely frame the picture too, so people know you’re not someone to mess with. A frame says permanence. A picture taped on a wall says here today, gone tomorrow.” I chew on my bottom lip thoughtfully. “So maybe a picture of me baking, in an apron—” “With nothing underneath?” Chris cackles, and I flick her forehead lightning quick. “Ow!” “Get serious then!” The bell rings again, and we go our separate ways. I can’t see myself giving Peter a sexy picture of me, but it does give me an idea—I could give him a scrapbook instead. All of our greatest hits. That way when he’s missing me at UVA , he can look at it. And keep it on his desk, for any “random girl” who might happen by. Of course I won’t mention this idea to Chris—she’d just laugh and call me Grandma Lara Jean. But I know Peter will love it.","sourceLink":"https://allnovel.net/always-and-forever-lara-jean-to-all-the-boys-i-ve-loved-before-3/page-9.html","bookId":1775,"book":{"id":1775,"title":"Always and Forever, Lara Jean (To All the Boys I\u0027ve Loved Before #3)","description":"Storyline: Lara Jean is having the best senior year. And there’s still so much to look forward to: a class trip to New York City, prom with her boyfriend Peter, Beach Week after graduation, and her dad’s wedding to Ms. Rothschild. Then she’ll be off to college with Peter, at a school close enough for her to come home and bake chocolate chip cookies on the weekends. Life couldn’t be more perfect! At least, that’s what Lara Jean thinks . . . until she gets some unexpected news. Now the girl who dreads change must rethink all her plans—but when your heart and your head are saying two different things, which one should you listen to?","cover":"https://allnovel.net/images/always-and-forever-lara-jean-to-all-the-boys-i-ve-loved-before-3.jpg","author":"Jenny Han","type":"Romance","source":"allnovel","link":"https://allnovel.net/always-and-forever-lara-jean-to-all-the-boys-i-ve-loved-before-3.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:30:26 AM"}}
