{"id":63774,"no":1,"title":"Page 1","content":"Summer 1831, Vitebsk, Belarus\\n\\n The streets were full of dying soldiers and smoldering rubble. Looters scurried from house to house, dragging sacks of food and silverware they\u0027d scavenged from the ruins of the city. Cannons fired in the distance. The Russian armies had marched on to the next city, on to the next massacre. Ignoring the scent of blood everywhere, Princess Johanna Cantacuzene searched the bodies until she found him.\\n\\n Her husband, the Koldun and former king of Poland, lay dead under another soldier\u0027s decapitated body. One of the Dekebristi had been trying to protect him. The vampire princess had no tears, only cold rage that shook her entire body. She would find her husband\u0027s killer and make him and his descendants pay for his crime. \"Bogatyr!\" she screamed. \"Will you come for me as well? I do not fear death. And neither did he.\" She cradled Konstantin Pavlovich\u0027s body to her. Then, seething in her hatred for the supernatural knight protector of Russia who had killed his own brother, she chanted vile curses against the Romanovs.\\n\\n Konstantin had given up his rights to the throne of Russia to marry Johanna, the Polish princess who was a blood drinker. His elder brother Tsar Alexander had declared him king of Poland as consolation. Konstantin had been perfectly happy with his new wife and his new kingdom. But when Alexander died, the throne of Russia went to the ambitious younger brother, Nicholas Pavlovich. Nicholas sent his armies to take Poland away from his older brother and return it to the Russian empire.\\n\\n Johanna fumed. She wanted Konstantin to have not only Poland, but also to take back his rightful inheritance. She wanted him to rule all of Russia as well. But Nicholas the First had a necromancer mistress who used ancient dark magic of her own to invoke the bogatyr and defeat Konstantin and Johanna\u0027s forces. To protect her husband\u0027s life, Johanna had turned him into a blood drinker. But it would not be enough to save him.\\n\\n The young tsar accused Konstantin of heresy and treason and ordered his own brother\u0027s death. The Polish people revolted against Nicholas the First and rallied behind Konstantin. But Konstantin was unable to defend them. Or himself. When the battle spilled over out of Poland into the rest of the Eastern Provinces, Konstantin Pavlovich at last confronted his brother in the muddy streets of Vitebsk.\\n\\n Johanna attempted to help her husband as he flung ancient Slavic spells and incantations at the bogatyr. Her Dekebristi minions attacked the young tsar\u0027s troops mercilessly. But the young tsar\u0027s mistress had powers much stronger than those of the vampire princess. The necromancer cloaked the bogatyr with shadows and commanded the dead soldiers in the street to march against the Dekebristi. She imprisoned Johanna in the Graylands, the realm of the dead, with an ancient Egyptian spell, and Johanna was forced to watch helplessly as Konstantin fell to his brother\u0027s sword.\\n\\n While trapped in the Graylands, Johanna stumbled across a very old and very angry Egyptian necromancer. She stole his spell book and made a devil\u0027s bargain that allowed her to return from the Graylands in an attempt to save Konstantin with the power of necromancy.\\n\\n Princess Cantacuzene sought to bring Konstantin back to life by pouring her own blood into his mouth. But no amount of blood could restore him after his defeat at the hands of the bogatyr. Johanna had to use the blackest of black magics to bind his soul and keep it safe, using a ritual from the Egyptian\u0027s spell book and a relic she stole from her half sister, the Montenegrin queen Milena. But Johanna was not strong enough to bring her love back. After burying her husband\u0027s body in the Romanov crypt with his ancestors, she faked her own death and assumed the identity of a distant Cantacuzene cousin. She deceived the foolish Nicholas Pavlovich and gained control over the remaining blood drinkers who had not been exiled to Siberia. She hid in the heart of St. Petersburg with the stolen relic, the Talisman of Isis, slowly gathering other vampires loyal to her and waiting decades for her chance at revenge.\\n\\n She waited for the day when she could restore her husband to the throne. She waited for the day when she could restore him to life. \\n\\n","sourceLink":"https://allnovel.net/the-morning-star-katerina-3/page-1.html","bookId":2655,"book":{"id":2655,"title":"The Morning Star (Katerina #3)","description":"Storyline: The Morning Star (Katerina #3) \\n St. Petersburg, Russia, 1890 \\n Katerina Alexandrovna, Duchess of Oldenburg, wants to be known as a doctor, not a necromancer. But Tsar Alexander III forbids women to attend medical school; his interest in Katerina extends only to her ability to raise the dead. Twice now, Katerina has helped him by using her power to thwart the forces of darkness—vampires bent on resurrecting the lich tsar Konstantin Pavlovich so that he can take what he sees as his rightful place on the throne. Katerina thought she had bound Konstantin to the Greylands, the realm of the dead, but he has found a way out. Now he is searching for the Morning Star, a sword that will allow him to command a legion of supernatural warriors. \\n Katerina must find the sword before Konstantin does—and she must travel to Egypt to do so. Along the way, she puts up with unwanted attention from her former fiancé, the nefarious Prince Danilo, and struggles with her feelings for her true love, George Alexandrovich. But with the looming threat from Konstantin, Katerina\u0027s focus remains on the sword. Russia\u0027s fate will be determined by whoever wields the Morning Star—and delivers the final blow.\\n","cover":"https://allnovel.net/images/the-morning-star-katerina-3.jpg","author":"Robin Bridges","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-morning-star-katerina-3.html","creation":"Oct 5, 2019 8:59:00 AM","modification":"Oct 5, 2019 9:51:43 AM"}}
