{"id":63791,"no":18,"title":"Page 18","content":"Danilo left me alone in the dining saloon, for which I was grateful. I wanted nothing more than to escape back to my cabin in peace. I spotted the two Grigori on the observation deck, speaking in hushed tones with the girl in the black habit. As much as I wished to retire to bed, I wanted to learn more about my traveling companions. The full moon was high in the sky, lighting up the sea almost as bright as daylight. The moonlight also lent an unholy look to the pale, stone-faced men as I approached them. They were taller than any of the other men I\u0027d seen on the boat, and they towered over the girl. \"Why are you here with the crown prince?\" I asked. \"Why would you want to help him?\" The one on the right appeared to be the older of the two. \"We serve the sword, Duchess. When the sword calls, we must obey.\" The girl\u0027s smile wasn\u0027t friendly. \"We must all obey the lich tsar, including you.\" \"But he doesn\u0027t possess the sword yet,\" I said. \"What has convinced you to obey him now?\" She shrugged. \"He has you. And you will help him find the sword soon enough.\" I turned back to the strange men. \"What if the one who holds the sword is wicked? Are you still forced to serve that person?\" The elder Grigori looked down at me, his face impassive. He reminded me of the members of the Order of St. Lazarus. \"The sword itself is very wicked, my lady. Do you not know who first carried the Morning Star? It was Lucifer himself. With that sword, he led the angels\u0027 rebellion.\" I stared at him as the meaning of his words sank in. The breeze off the water had turned chilly, and my hair was beginning to fall from its carefully arranged knot. I rubbed my arms and hugged myself. What made Konstantin believe he had the power to wield Lucifer\u0027s sword? \"You are demons, then. Fallen from heaven.\" \"Not demons, though they are our brethren. When the Grigori fell, they were trapped on earth in physical bodies. Not mortal, but not able to leave this plane either.\" \"And you cannot die.\" What a terrible army they would make. A formidable match for my own undead soldiers. No wonder Danilo wanted the Grigori on his side. He smiled, but the gesture did not make him appear any friendlier. \"No.\" His companion, the younger-looking one, said something to him in a language unfamiliar to me. Nodding, the older of the two looked back at me. \"It is true. You are a necromancer and you could wield the Morning Star. But are you strong enough to command the Grigori?\" The girl laughed. \"I think not.\" \"And who exactly are you?\" I asked, whirling on her. \"What has Danilo promised for your part in all of this?\" Her eyes hardened. \"The crown prince has not promised anything. And what has been promised to me is not your concern.\" She stalked off, leaving me alone with the Grigori. \"Are you here against your will?\" I asked the younger one. When he looked at his elder and they both nodded, it gave me a little courage. They probably had as much reason to hate the crown prince as I did. \"So why would you allow Danilo to command you to fight the current tsar and his family?\" \"We are condemned to chaos, Duchess. It is our nature,\" the elder Grigori said. \"You don\u0027t wish for something different?\" I asked. \"Don\u0027t you grow tired of the battles?\" The younger one spoke up. \"We\u0027ve been weary of the battles and the fighting for a thousand years already. But nothing will ever change. The sword passes from man to man, and we follow the sword.\" \"What if the sword was destroyed?\" There had to be a way to keep the Grigori safe from the lich tsar\u0027s clutches. The elder Grigori\u0027s face remained impassive. \"The Morning Star was forged in heaven itself. It cannot be destroyed.\" Their lack of emotion was unsettling. They were like wooden soldiers. I decided to return to my cabin before they tired of answering my questions. Hopefully I would be able to talk to them again before reaching Egypt. When I got back to my cabin, I remembered that my copy of A Necromancer\u0027s Companion had been left behind in Riga, with George. I slumped down on the elegant iron bed, wishing I had the book with me to research the Grigori. Surely there would be information in Princess Cantacuzene\u0027s book about the creatures. Especially if they were linked to necromancers. I\u0027d heard Danilo call them Watchers, but that implied that the Grigori stood back and did not interfere in the human lives around them. This was an inaccurate assumption, I feared. I wondered what George had done with my things. The book was surely lost to me now, along with the medical texts Dr. Badmaev had given me. I sighed. The Tibetan doctor\u0027s clinic seemed so far away, and medicine was of no help in my predicament. Magic was what I needed. And total command over my cold light powers. I took a last look at the moonlit waves from the porthole and wished on the one bright star I could see. I wished that I would live to see George at least one more time. It was purely selfish of me, and if I\u0027d truly believed a wish had any chance of coming true, I should have used it to wish for the defeat of Konstantin. But I was afraid I\u0027d need the power of every last star in the sky to accomplish that.","sourceLink":"https://allnovel.net/the-morning-star-katerina-3/page-18.html","bookId":2655,"book":{"id":2655,"title":"The Morning Star (Katerina #3)","description":"Storyline: The Morning Star (Katerina #3) St. Petersburg, Russia, 1890 Katerina Alexandrovna, Duchess of Oldenburg, wants to be known as a doctor, not a necromancer. But Tsar Alexander III forbids women to attend medical school; his interest in Katerina extends only to her ability to raise the dead. Twice now, Katerina has helped him by using her power to thwart the forces of darkness—vampires bent on resurrecting the lich tsar Konstantin Pavlovich so that he can take what he sees as his rightful place on the throne. Katerina thought she had bound Konstantin to the Greylands, the realm of the dead, but he has found a way out. Now he is searching for the Morning Star, a sword that will allow him to command a legion of supernatural warriors. Katerina must find the sword before Konstantin does—and she must travel to Egypt to do so. Along the way, she puts up with unwanted attention from her former fiancé, the nefarious Prince Danilo, and struggles with her feelings for her true love, George Alexandrovich. But with the looming threat from Konstantin, Katerina\u0027s focus remains on the sword. Russia\u0027s fate will be determined by whoever wields the Morning Star—and delivers the final blow.","cover":"https://allnovel.net/images/the-morning-star-katerina-3.jpg","author":"Robin Bridges","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-morning-star-katerina-3.html","creation":"Oct 5, 2019 8:59:00 AM","modification":"Oct 5, 2019 9:51:43 AM"}}
