{"id":63811,"no":38,"title":"Page 38","content":"I wandered the halls of the Graylands for what seemed like hours, wary of the soft wisps of cold light that followed me down the dark corridors. I kept my own cold light reined in tightly and was careful not to touch the wisps. I did not want to interfere with any other beings anymore. The mist seemed to ebb and flow around me, but I never came across anyone else. None of the tsar\u0027s mages came looking for me, nor did Militza.\n I still had my mortal body in an immortal land, and I was growing tired. I would have to find a room to settle in, much like Ankh-al-Sekhem the Egyptian had. I shuddered, hoping I would not run into him here. But if he had survived the attack of the resurrected mummies, then he was still in his pyramid in Giza. He would not wish to return to the Graylands any time soon.\n I discovered a beautiful, cozy chamber with golden mosaic tiles embellishing the door and its frames. The room was full of bookcases loaded with heavy books. A table was set with a bronze tea service and plates of sweet cakes. I suddenly realized I was famished, but I was reluctant to eat anything here.\n There had been spells in A Necromancer\u0027s Companion that requested nourishment for the dead. I\u0027d seen hieroglyphics on the walls of the temple in Abydos that portrayed priests bearing gifts of food and drink and leaving it for the souls trapped in the afterlife. And the sweet cakes with their cardamom and vanilla did smell heavenly. It was as if they were waiting just for me.\n A gold-embroidered satin cushion that was larger than the door itself stood up against one of the bookshelves. I placed it on the floor. Curling up with the Morning Star in my arms, I fell asleep for the first time in days. I slept a deep, dreamless sleep and felt at peace at last.\n I awoke some time later. I had no idea how long I\u0027d slept, but I felt much restored. I puttered around the chamber, looking at books and nibbling on some of the sweet cakes. I knew someone would be returning soon to these quarters, and whoever lived here was not likely to take kindly to a young girl invading their home in the land of the dead.\n Reluctantly, I put the book of poetry that I\u0027d found back on its shelf and tidied up. I was curious to know what kind of person this space belonged to. Male or female? Young or old? What had they done to earn this sort of cozy existence in the afterlife?\n The heavy stone door began to slide open. I gripped my sword in alarm but hastily hid the Morning Star behind my back.\n A brilliant glow of cold light preceded the person entering the chamber. I could barely make out the silhouette of a young man behind it. As the door shut, the glow dimmed, and I was able to see him more clearly. My heart stopped beating when he looked at me.\n \"Katiya?\"\n \"George?\"\n No wonder I felt as if I\u0027d come home.\n George did not rush to take me into his arms. He actually looked unhappy to see me. \"Katiya? What have you done?\"\n \"What do you mean? You don\u0027t know how happy I am to find you! I hadn\u0027t even dared to look. I thought you were dead.\" I reached for him and was hurt when he flinched.\n \"Katiya, I am dead. And if you are here in this Hall of the Fallen, you must be dead too.\"\n I shook my head. \"I defeated Konstantin. I dragged him back to the Graylands and gave him the second death. And I realized I couldn\u0027t face your parents again. I did not want to return to St. Petersburg without you.\"\n He reached up and touched my hair gently. \"You are ridiculous. You chose to stay here? Alone?\"\n I nodded. \"Can I stay here with you?\"\n He cupped my face in his hands and kissed me. My dead husband did not feel very dead at all. He felt very much alive. And his kisses lit my soul on fire.\n Gently, George lowered me to the floor cushion. His lips never left mine as his fingers traced the curls in my hair and slid down my arms and around my waist. I stretched my arms around his neck, yearning for him.\n \"Katiya, are you sure you want to remain here?\" His kisses trailed down my jaw and his hand played with my buttons.\n \"Where else would we go?\" I asked. I did not want him to stop kissing me. My heart was pounding. My body shivered with fright and excitement.\n He raised his head and looked at me. \"You could take me home.\"\n \"What are you talking about?\" I asked.\n He searched my face uncertainly. \"Katiya, you do realize that you have the ability to bring me back.\"\n \"But I saw your cold light disappear!\" The thought that I might be able to bring him back to the land of the living filled me with hope. And a little fear. \"I can\u0027t bring you back as one of the undead, George. That would not be any kind of life for you. And it would break your mother\u0027s heart.\"\n He was trying not to laugh. \"Love, why is it that I have learned more about your necromancer powers than you have?\" His fingers were tracing the collar of my regimental jacket, making it extremely difficult for me to pay attention to what he was saying.\n \"I was too busy trying to study medicine,\" I said. \"I didn\u0027t want to know how to be a necromancer.\" But I knew George had studied many schools of magic when he was in Paris. And he would have had a certain interest in learning about my powers.\n \"Katiya, if you want to go to medical school, I will still support you. We can live wherever we need to-Paris, Zurich, London. We\u0027ll go to America if that\u0027s what it takes.\"\n I shook my head. \"I want to continue learning from Dr. Badmaev. His Tibetan medicine has a better chance of finding a cure for your sickness.\" And since we were already married, what was the worst thing the tsar could do?\n Exile. We could be sent away from Russia. Or the tsar might punish Dr. Badmaev for helping me and have him sent away. I\u0027d have to convince the tsar that I was trying to save his son.\n I looked at the grand duke more closely and realized his cold light had returned. It was still bright, betraying his delicate health, but it was there. That meant I could still save him.\n I sat up straighter, pushing George back a little. \"Your illness! Is it worse here in the Graylands?\" Or had it disappeared? I didn\u0027t dare hope.\n George shrugged. \"It\u0027s no better, but I worry that the time spent here will affect it. I might be weaker if I return to the land of the living.\"\n I started to protest, but he knew what I was about to say. He put his fingers to my lips. \"No,\" he said. \"I am willing to risk it. This is not a life, Katiya. What I\u0027m doing here in the Graylands is just existing. I don\u0027t want to stay here trapped for centuries like your Egyptian friend. I want a life with you. A family.\"\n I couldn\u0027t help blushing as I thought of having a family with him. Of carrying George\u0027s babies. I wondered, though, if our travels through the Graylands would alter our ability to have children. Princess Cantacuzene\u0027s greatest regret as a vampire had been her inability to give Konstantin an heir. I understood now how she must have felt, and I felt her sorrow as my own.\n \"You must think me stupid for not coming to look for you immediately,\" I said. \"Will you ever forgive me?\"\n George shrugged as he smiled. \"I was more worried for you, Katiya. I was safe here, away from Konstantin, and able to mend, while you had him engaged in battle. But I hated not knowing what was happening to you. And I hated not being at the battle with my parents.\"\n \"You\u0027ll hear the stories and legends for years, I\u0027m sure.\" I sighed. \"And your parents will think me very stupid for telling them that you were lost. I never even had a chance to tell them we were married.\" Which was probably for the best. And I\u0027d had a reasonable excuse.\n \"Well then,\" George said as he stood up and held out his hand to me. \"Shall we?\"\n I paused. I couldn\u0027t help thinking of Danilo and Mala. Perhaps they would be able to find each other somewhere beyond the Graylands.\n I looked up at George and smiled. My beautiful boy. My husband. I gave him my hand. \"Let\u0027s go home.\" \n","sourceLink":"https://allnovel.net/the-morning-star-katerina-3/page-38.html","bookId":2655,"book":{"id":2655,"title":"The Morning Star (Katerina #3)","description":"Storyline: \n The Morning Star (Katerina #3) \n St. Petersburg, Russia, 1890 \n Katerina Alexandrovna, Duchess of Oldenburg, wants to be known as a doctor, not a necromancer. But Tsar Alexander III forbids women to attend medical school; his interest in Katerina extends only to her ability to raise the dead. Twice now, Katerina has helped him by using her power to thwart the forces of darkness—vampires bent on resurrecting the lich tsar Konstantin Pavlovich so that he can take what he sees as his rightful place on the throne. Katerina thought she had bound Konstantin to the Greylands, the realm of the dead, but he has found a way out. Now he is searching for the Morning Star, a sword that will allow him to command a legion of supernatural warriors. \n Katerina must find the sword before Konstantin does—and she must travel to Egypt to do so. Along the way, she puts up with unwanted attention from her former fiancé, the nefarious Prince Danilo, and struggles with her feelings for her true love, George Alexandrovich. But with the looming threat from Konstantin, Katerina\u0027s focus remains on the sword. Russia\u0027s fate will be determined by whoever wields the Morning Star—and delivers the final blow.\n \n","cover":"https://allnovel.net/images/the-morning-star-katerina-3.jpg","author":"Robin Bridges","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-morning-star-katerina-3.html","creation":"Oct 5, 2019 8:59:00 AM","modification":"Oct 5, 2019 9:51:43 AM"}}
