{"id":76994,"no":1,"title":"Page 1","content":"CHAPTER ONE\n In Which I Introduce Myself\n The best day of my life happened when I was five and almost died at Disney World.\n I’m sixteen now, so you can imagine that’s left me with quite a few days of major suckage.\n Like Career Day? Really? Do we need to devote an entire six hours out of the high school year to having “life counselors” tell you all the jobs you could potentially blow at? Is there a reason for dodgeball? Pep rallies? Rad soda commercials featuring Parker Day’s smug, fake-tanned face? I ask you.\n But back to the best day of my life, Disney, and my near-death experience.\n I know what you’re thinking: WTF? Who dies at Disney World? It’s full of spinning teacups and magical princesses and big-assed chipmunks walking around waving like it’s absolutely normal for jumbo-sized stuffed animals to come to life and pose for photo ops. Like, seriously.\n I don’t remember a whole lot about it. Like I said, I was five. I do remember that it was hot. Surreal hot. The kind of hot that makes people shell out their life savings for a bottle of water without even bitching about it. Even the stuffed animals started looking less like smiling, playful woodland creatures and more like furry POWs on a forced march through Toonland. That’s how we ended up on the subterranean It’s a Small World ride and how I nearly bit it at the place where America goes for fun.\n I don’t know if you’ve ever experienced the Small World ride. If so, you can skip this next part. Honestly, you won’t hurt my feelings, and I won’t tell the other people reading this what an ass**le you are the minute you go into the other room.\n Where was I?\n Oh, right—so much we share, time aware, small world. After all.\n So. Small World ride, brief sum-up: Long-ass wait in incredibly slow-moving line. Then you’re put into this floating barge and set adrift on a river that winds through a smiling underworld of animatronic kids from every country on the planet singing along in their various native tongues to the extremely catchy, upbeat song.\n Did I mention it’s about a ten-minute ride?\n Of the same song?\n In English, Spanish, Swahili, and Japanese?\n I’m not going to lie to you; I loved it. Dude, I said to myself, this is the shit. Or something like that in five-year-old speak. I want to live in this new Utopia of singing children of all nations. With luck, the Mexican kids will let me wear their que festivo sombreros. And the smiling Swedes will welcome me into their happy Nordic hoedown. Välkommen, y’all. I will ride the pink fuzzy camel in some vaguely defined Middle Eastern country (but the one with pink fuzzy camels) and shake a leg with the can-can dancers in Gay Paree.\n Bonjour.\n Bienvenido.\n Guten Tag.\n Jambo.\n I was with the three people who were my world—Mom, Dad, my twin sister, Jenna—and for one crazy moment, we were all laughing and smiling and sharing the same experience, and it was good. Maybe it was too good. Because I started to get scared.\n I don’t know exactly how I made the connection, but right around Iceland, apparently, I got the idea that this was the after life. Sure, I had heatstroke and had eaten enough sugar to induce coma, but really, it makes sense in a weird way. It’s dark. It’s creepy. And suddenly, everybody’s getting along a little too well, singing the same song. Or maybe it had to do with my mom. She used to teach English classics, heavy on the mythology, at the university B.C. (Before Children) and liked to pepper her bedtime stories with occasional bits about Valhalla or Ovid or the River Styx leading to the underworld and other cheery sweet-dreams matter. We’re a fun crew. You should see us on holidays.\n Whatever it was, I was convinced that this ride was where you went to die. I would be separated from my family forever and end up in some part of the underworld where smiling kid robots in boater hats sang nonstop in Portuguese. I had to keep that from happening. And then—O Happy Day! Salvation! Right behind the Eskimo igloo (this was before they were the more politically correct but slightly naughty-sounding Inuits), I saw this little door.\n “Mommy, where does that door go to?” I asked.\n “I don’t know, honey.”\n We were headed for certain death on the River Styx. But somehow I knew that if I could just get to that little door, everything would be okay. I could stop the ride and save us all. That was pretty much it for me. My five-year-old freak-out meter totally tripped. I slipped free of the seat and splashed into the fishy-smelling water, away from the doe-eyed, pinafored girl puppet singing, “En värld full av skratt, en värld av tårar” (Swedish, I’m told, for “It’s a world of laughter, a world of tears”). \n","sourceLink":"https://allnovel.net/going-bovine/page-1.html","bookId":2718,"book":{"id":2718,"title":"Going Bovine","description":"Storyline: \n Can Cameron find what he’s looking for? \n All 16-year-old Cameron wants is to get through high school—and life in general—with a minimum of effort. It’s not a lot to ask. But that’s before he’s given some bad news: he’s sick and he’s going to die. Which totally sucks. Hope arrives in the winged form of Dulcie, a loopy punk angel/possible hallucination with a bad sugar habit. She tells Cam there is a cure—if he’s willing to go in search of it. With the help of a death-obsessed, video-gaming dwarf and a yard gnome, Cam sets off on the mother of all road trips through a twisted America into the heart of what matters most. \n \n","cover":"https://allnovel.net/images/going-bovine.jpg","author":"Libba Bray","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/going-bovine.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 3:29:31 PM"}}
