{"id":77118,"no":128,"title":"Page 128","content":"“Dude, what the hell?” Gonzo yells, rubbing his head.\\n\\n A guy with massively tattooed arms crouches down and asks Gonzo if he’s okay. Yeah, I’m fine, thanks. No need to check here. Just leave me on the ground, watch your step.\\n\\n “You all right?” Gonzo asks me, almost as an afterthought.\\n\\n “No,” I say, standing with effort. “We lost Balder.”\\n\\n “We’ll get him back,” he says, checking his head with his hands. “I’ll be in the first-aid tent.”\\n\\n “Yeah. Got it,” I snap, practically pushing him toward the tent with tattoo boy.\\n\\n Keith welcomes his friends up onstage. He gives Marisol the gnome as a gift. She squeals and collects her prize, holding our gnome over her head, showing him to the crowd.\\n\\n “He’s so cuuuuute!” she yelps. “We’re going to use him for the new ad campaign for I Double Dog Dare You!” The crowd loves this. They go wild. I remember the last TV spots they did for that show. It involved a stuffed bear. In one spot, they hacked his arm off with a chain saw. In another, they put a firecracker in his mouth and set it on fire. By the end of the five spots, he was nothing but a few pieces of dirty, scorched fluff attached to one glass eye.\\n\\n “Hey, get a picture!” Keith Middle Guy Asshole Taker of Other People’s Yard Gnome Friends yells out to his buddies. He puts his arm around Marisol. And she gives him a big kiss on the mouth.\\n\\n “Whooo-hooo! This is the rockingest day of my life!” Keith yells. The guys make that weird dog sound they do when they want to show their support. My heart sinks, both because I’ve lost Balder and because I’ve somehow put Keith on a path to certain doom. I hate that I know this. I hate that I can’t just hate him.\\n\\n “Hey, Marisol!” Keith grins from ear to ear. “Wanna screw?”\\n\\n There’s a collective stunned gasp from the crowd. Marisol’s mouth hangs open. Keith pulls my magic screw from his pocket and hands it to her. “Here. It’s a magic screw. Supposed to bring you good luck.”\\n\\n People laugh now, even though it’s about the stupidest thing I’ve ever heard. Marisol seems like she still wants to hit him but, hey, she’s on TV and she needs to at least pretend to be cool, so she laughs, too, and says, “Omigosh, you are too funny!” The crowd yells “Magic screw!” over and over, and then Marisol signs off with her trademarked “I’m Marisol, over and outie—later days!” Thumping house music blares out of the speakers for the part where they roll credits on TV. Marisol does a silly dance with Balder and the screw, one in each hand, so that nobody gets the idea that she takes this—or anything else, for that matter—seriously. It’s all one big laugh, one big party house. No need to care. Or get involved. No risk, no mess, no hassle.\\n\\n A couple of suits meet Keith when he comes offstage. They shake hands and offer cards. “We loved what you did with that magic screw business,” they say. “The kids loved it, too.”\\n\\n “Yeah?” Keith grins. “I didn’t plan it or anything. It just happened.”\\n\\n “Yeah, great. Listen, we were just talking about building some YA! TV promos around you. You could be the wacky Magic Screw Guy. What do you say to that?”\\n\\n “I’d be on TV?” Keith punches the air with his fist. “All right! Sign me up, man!”\\n\\n “Great! We’ll go fill out the paperwork. Listen, you like Rad soda?”\\n\\n And just like that, something in the cosmos shifts. A butterfly flaps its wings in South America. Snow falls in Chicago. You give an idiot a stupid magic screw and it turns out to be a necessary part after all.\\n\\n CHAPTER FORTY-ONE\\n\\n In Which Gonzo Makes a Life-or-Yard-Gnome Decision\\n\\n A hundred bucks of my prize money has gotten us intel about Balder. He’s currently in Marisol’s dressing room, where she’s using him as a jewelry tree. Another hundred bucks has gotten us badges that allow us backstage access. The minute Marisol leaves her dressing room for the beach stage to film a spot, we duck inside. We find Balder buried under a collection of colorful scarves. His face is red and he looks tired.\\n\\n “Thank the gods you’ve found me,” he says with a sheepish smile. “I’ve never been so humiliated in all my life. Do you know she let her friends put makeup on me?”\\n\\n Balder is indeed sporting some sparkly blue eye shadow and glossy lipstick.\\n\\n “It’s cool,” Gonzo says. “You look pretty glam rock.”\\n\\n “Let’s just get you out of here, okay?” I bundle Balder up in one of the scarves and we head for the door just as Parker walks in. \\n\\n","sourceLink":"https://allnovel.net/going-bovine/page-128.html","bookId":2718,"book":{"id":2718,"title":"Going Bovine","description":"Storyline: Can Cameron find what he’s looking for? \\n All 16-year-old Cameron wants is to get through high school—and life in general—with a minimum of effort. It’s not a lot to ask. But that’s before he’s given some bad news: he’s sick and he’s going to die. Which totally sucks. Hope arrives in the winged form of Dulcie, a loopy punk angel/possible hallucination with a bad sugar habit. She tells Cam there is a cure—if he’s willing to go in search of it. With the help of a death-obsessed, video-gaming dwarf and a yard gnome, Cam sets off on the mother of all road trips through a twisted America into the heart of what matters most. \\n","cover":"https://allnovel.net/images/going-bovine.jpg","author":"Libba Bray","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/going-bovine.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 3:29:31 PM"}}
