{"id":77120,"no":130,"title":"Page 130","content":"“It’s sixty-five dollars a night and free cable,” I explain. “I’ll be out in one second.” She nods and I enter the hazy room with Balder. I turn on the bedside lamp. “Balder, I’ve gotta deal with my sister. Will you be okay here by yourself?” “Just lock the door, please,” he says. “I don’t care to have any more adventures.” “Sure thing.” “Cameron.” “Yeah?” “That was a very brave thing you did today, rescuing me, offering all your money.” “Well, I couldn’t let them turn one of my best buds into a promo snuff reel,” I say. Balder gives me a self-satisfied little smile. “I’ve told you, I can’t be harmed.” “Yeah. Sure. I know that. But still.” “Will Gonzo be okay?” Gonzo. Shit. “Don’t worry. The show doesn’t tape till late tonight. I’ll rescue him before then and we’ll all be long gone by morning.” Balder nods. For the first time, he looks worried. “What’s up?” I ask. “Sometimes, I dream of my ship, of Ringhorn. It shines like the sun after rain, and I’m running toward it.” “Sounds like a good dream.” His face is thoughtful. “But I never reach it.” “We’ll get there,” I promise him. “We’ll make it to the ocean.” I help him up into Gonzo’s bed, pour him a soda, and give him the remote. When I close the door behind me, he’s lying there, happily channel surfing, a Viking warrior on spring break. CHAPTER FORTY-TWO Wherein I Have a Conversation with My Sister and the Fates Throw Me a Bone Jenna and I find a place to sit in the loud, packed beach lounge. Every television is turned to YA! TV except one, which shows the ConstaToons channel. The sound has been muted on all of them. A succession of musical acts plays on the tiny stage—bands, acoustic-guitar girls, comics who sing, rappers. Partiers wander in from the mosh pit scene outside, carrying cups of beer. Some have flasks that they hide in their swim trunks and pull out when they think no one’s looking. They’re all checking each other out. I buy Jenna and me a couple of sodas. It takes half an hour just to make it to the bar. “Here you go,” I say, handing her a cup. “It’s diet, right?” I roll my eyes. “Don’t worry.” Some guy shoves another guy, who sort of half falls onto our table, nearly spilling Jenna’s soda. “Sorry,” he says, laughing. “Look what you did, man!” he screams to his friends as he runs over and grabs one in a drunken headlock. Jenna gives me a frogger in the arm, not hard, just like she used to do when we were eight. “Ow.” “Cameron, I am so mad at you!” she says. “Why did you run away from the hospital? Have you really been doing all those things?” I rub the sore spot on my arm. “It’s hard to explain.” “Try me.” She’s got her all-business face on, the one that has seen her through countless cheerleader tryouts and student council elections. I’m defenseless against the Face. I take a deep breath and dive in. By the end of it, I’m exhausted and Jenna looks like somebody’s secretly replaced her reality with a different one, which I suppose is one hundred percent true. “You know this sounds crazy,” Jenna says finally. I shake my head. “Believe me, I know. But I’m not going back, Jenna. I can’t. Not yet.” The guys goofing around near our table get a little too physical again, and the same guy bumps our table hard. He doesn’t apologize this time. “Do you mind?” Jenna says, and the guy moves away. “Cameron, how do you know this is all true?” “I don’t.” “That scares me.” “Yeah. It scares me, too.” I need to change the subject, and fast. “So, spring break at the Party House, huh? How’d that happen? Weren’t you supposed to go skiing with the Lord?” She makes a face. “I meant Chet. I get those two mixed up sometimes.” Jenna fiddles with her straw. “Chet and I broke up.” “Oh. Sorry.” “No you’re not,” she says, laughing. Okay, I’m not. But I am sorry she’s sorry. “He didn’t mess with you or anything, did he?” She rolls her eyes. “No. He just kept pressuring me to be more like him, and if I wasn’t like him, he didn’t know what to do with me. He’s dating some girl from his church now. They like all the same things.”","sourceLink":"https://allnovel.net/going-bovine/page-130.html","bookId":2718,"book":{"id":2718,"title":"Going Bovine","description":"Storyline: Can Cameron find what he’s looking for? All 16-year-old Cameron wants is to get through high school—and life in general—with a minimum of effort. It’s not a lot to ask. But that’s before he’s given some bad news: he’s sick and he’s going to die. Which totally sucks. Hope arrives in the winged form of Dulcie, a loopy punk angel/possible hallucination with a bad sugar habit. She tells Cam there is a cure—if he’s willing to go in search of it. With the help of a death-obsessed, video-gaming dwarf and a yard gnome, Cam sets off on the mother of all road trips through a twisted America into the heart of what matters most.","cover":"https://allnovel.net/images/going-bovine.jpg","author":"Libba Bray","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/going-bovine.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 3:29:31 PM"}}
