{"id":77022,"no":29,"title":"Page 29","content":"Principal Hendricks steps up to the mike. “Take your seats, people, please.” He waits for things to settle down to a dull roar before continuing. “As you know, we’re here to honor a very brave student today and show him our support. Cameron Smith.” The gym explodes in sound. It’s meaningless. I’m going to die. Principal Hendricks shouts over the din. “Cameron, we know you’re gonna beat this thing. And every single one of us is pulling for you. Just embrace the positive.” “Amen,” Chet King says, and I wonder if he’s pissed that I’ve surpassed him on the God Will Test You Because He Loves You scale. He didn’t get a special pep rally shout-out when he broke his vertebrae. “Let’s give Cameron a special cheer,” Principal Hendricks says, applauding. Eight cheerleaders turn the gym floor into a blur of athletic tumbles and pumped fists. They clap and yell and motion for the crowd to get on their feet. Grudgingly, kids stand. Now that they can see I don’t have three heads or large boils covering my body, they probably want this over with so they can get out, go home, go smoke a J, get in the chat rooms, game it, whatever. The rah-rahs lead the crowd in a rousing chant of my name. “Cam-a-run, Cam-a-run, Cam-a-run!” The sound bounces around the rafters and off the bleachers in a thick roar that hurts my ears. Some jackass moos and the principal of vice takes the mike to warn them they will be “subject to disciplinary action,” plus what they’re doing “isn’t nice.” February 20 is officially declared Cameron Smith Day at Calhoun High School. Teachers say nice, generic things about me at the mike. They can’t say nice, specific things because that would entail actually knowing and caring about me. Mom and Dad sit on the bleacher closest to the basketball net. They look gray and flat, clapping along when they’re supposed to, but never smiling. Every now and then, Mom ducks her head and I see her hand go up to her face, wiping. The visiting nurse pats my shoulder, and I want to tell him to stop. His comfort is too much. I take some ragged breaths, holding back the tears, because I don’t want my last high school moment to be me sobbing on a cheesy JumboTron. Fuck you, I think instead. Fuck you for living. The wall of gymnasium sound thrums in my head like a g-force. I just want this to be over. And then, up in the stands I see her—a girl with short pink hair, torn fishnets, black lace-up punker boots, and a tarnished breastplate like some Wagnerian heroine. From behind her back, two white buds appear on either side of her arms and begin to bloom like enormous daisies reaching for the sun, stretching out for what seems like forever. Wings. She’s staring right at me and smiling. Her smile is the biggest thing on her face, like it almost doesn’t fit. And I swear she’s glowing. Getting brighter by the second. The light drowns out the other sights and sounds in the gym. The wings reach their maximum span, and now I can read the message written there: Hello, Cameron! And just like that, everything inside my head goes dark. CHAPTER THIRTEEN In Which I Check into the Hospital and Have an Encounter with an Angel and Other Strange, Annoying Things “Cameron?” The voice sounds like it’s coming to me from inside a tunnel. Ow, shit! Could you get that light out of my eyes? “Cameron, can you hear me?” Yes, I can hear you. Can you hear me, because I was really f**king serious about that instrument of torture disguised as a penlight that for some reason you seem to find it amusing to shine directly into my pupils. I’m pretty sure they prosecute people as war criminals for this kind of shit. The dulcet tones of Dr. Asshole float back to my ears. “If you hear me, Cameron, just make a sound.” Hello! Are you not listening? I’ve been talking. Haven’t I? “If you don’t want to speak you can squeeze my hand or nod if you understand.” I nod and my brain throbs in my head. “Good. Very good, Cameron.” The light stops, thank God, and I’m able to drift in and out, catching snippets of conversation between Dr. Asshole and my ’rents. “We’re giving him … for discomfort …” I’m floating in space. It’s nice here. A comet zooms past. A star. The Buddha Cow twirls by on her lotus-flower hamburger patty. She raises a hoof in Zen salute. I’ve been blessed by the Cow. Amen. “We’d like your permission to try something experimental, something that in trials has had some success with destroying the prions that attack the brain and may slow the progression of the disease.”","sourceLink":"https://allnovel.net/going-bovine/page-29.html","bookId":2718,"book":{"id":2718,"title":"Going Bovine","description":"Storyline: Can Cameron find what he’s looking for? All 16-year-old Cameron wants is to get through high school—and life in general—with a minimum of effort. It’s not a lot to ask. But that’s before he’s given some bad news: he’s sick and he’s going to die. Which totally sucks. Hope arrives in the winged form of Dulcie, a loopy punk angel/possible hallucination with a bad sugar habit. She tells Cam there is a cure—if he’s willing to go in search of it. With the help of a death-obsessed, video-gaming dwarf and a yard gnome, Cam sets off on the mother of all road trips through a twisted America into the heart of what matters most.","cover":"https://allnovel.net/images/going-bovine.jpg","author":"Libba Bray","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/going-bovine.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 3:29:31 PM"}}
