{"id":77039,"no":46,"title":"Page 46","content":"“Dude, I can’t see a f**king thing,” Gonzo complains.\n There’s an opening in the crowd. I squeeze through, pulling Gonzo along, and we position ourselves in the front. When the couple we’ve pushed aside starts to complain, I point to Gonzo. “His mom’s on one of the floats. I promised to bring him down,” I lie, and the woman, who’s drunk, gets all sentimental and starts singing nursery songs to Gonzo, which makes no sense, but if there’s anything I’m starting to learn about people it’s (a) that they are fundamentally suspicious and afraid of anyone who is “different,” and (b) that fear makes them do and say asinine things.\n Gonzo scowls. “Is she kidding me with that?”\n “Ride it out, little dude,” I say. “We’re here and you can see everything.”\n Gonzo can’t argue with that, so we stand on the parade route, taking it all in. Revelers in tall, wack-a-doodle hats and neon-bright wigs dance and sing as the floats pass by. They shout for beads and the krewes on the floats answer their calls. I nearly get beaned by a handful of bright purple necklaces. I slip some over my neck and offer the rest to Gonzo, who shakes his head like I’m giving him Bubonic Plague in jewelry form.\n “You don’t know where that’s been, man.”\n Eubie was right—Mardi Gras is amazing. A guy in a skeleton costume, his face painted like a skull, dances down the street while acrobats in glittery harlequin outfits tumble and jump around waving long paper streamers. On a float painted like a flood, a drag queen in a sash that reads MISS LEVEE waves to the crowd and they go wild. A funeral band marches right past us. The musicians come first, playing trumpets and banging drums. Behind them, the people raise their hands and dance, whooping it up like it’s just another celebration. Farther down the line, the partiers roar their approval, signaling that the next float is a winner. It’s the most elaborate float we’ve seen, a good ten feet high with these huge gates in the middle, one white, the other gray with the faint outline of a horn on it. A tall dude in a feathered bird mask stands on the edge and spreads his arms wide.\n “I am Morpheus, king of dreams,” he says, and the speakers carry his deep voice for blocks. “We all walk in a land of dreams. For what are we but atoms and hope, a handful of stardust and sinew. We are weary travelers trying to find our way home on a road that never ends. Am I a part of your dream? Or are you but a part of mine? Welcome my brother, Phantasos, for this is surely a phantasmagoria, a fantasy world, and we are all players.”\n “Dude!” Gonzo yells over the din. “That is so seriously fawesome. I want to drive one of those to school! Whoo-hoo!” He’s grinning and dancing in place. “When I kick, this is exactly how I want to go out. Just pure party. You know?”\n “Yeah, sure,” I say, but there’s a catch in my chest while I watch those funeral dancers marching down the street. For the first time since we got off the bus, it strikes me how crazy this all is. How scary and uncertain. I’m at Mardi Gras, sandwiched between beer-soaked drunkards, with nothing more to go on than some vague, probably delusional belief that I’m where I should be. My legs get a weird tingly sensation, and I try not to panic.\n Signs. Coincidences. The random.\n Frantically, I search for clues. Is there a “Dr. X is Here” banner on one of these floats? A billboard with an arrow pointing the way? I rub a hand over the E-ticket wristband and hope that it will protect me from those rogue prions long enough to find Dr. X, wherever he might be.\n The streets erupt with a fresh wave of cheering, pulling me back to the parade.\n Morpheus laughs and blows some sort of glittery powder at us, coating our shirts in sparkles that make me sneeze like crazy. I reach into my pocket for a tissue and my fingers find the matchbook given to me by the lady on the bus. The Horn \u0026 Ivory Club. Junior Webster. 141 N. Rampart.\n Signs. Coincidences. The random.\n “Come on,” I say, whapping Gonzo’s arm. “Time to go.”\n “Go? But we just got here! Go where?”\n “Here,” I say, flipping the matches to Gonzo, who fumbles and recovers them.\n “What’s this?”\n “Where we’re headed next.”\n CHAPTER NINETEEN\n Wherein We Have an Encounter with a Drag Queen and the Most Famous Jazzman Alive or Dead\n “So let me get this straight—we’re guiding our path based on a matchbook cover?” Gonzo asks.\n “Just keep walking.” I pick up my pace on the narrow, cobble stone street. \n","sourceLink":"https://allnovel.net/going-bovine/page-46.html","bookId":2718,"book":{"id":2718,"title":"Going Bovine","description":"Storyline: \n Can Cameron find what he’s looking for? \n All 16-year-old Cameron wants is to get through high school—and life in general—with a minimum of effort. It’s not a lot to ask. But that’s before he’s given some bad news: he’s sick and he’s going to die. Which totally sucks. Hope arrives in the winged form of Dulcie, a loopy punk angel/possible hallucination with a bad sugar habit. She tells Cam there is a cure—if he’s willing to go in search of it. With the help of a death-obsessed, video-gaming dwarf and a yard gnome, Cam sets off on the mother of all road trips through a twisted America into the heart of what matters most. \n \n","cover":"https://allnovel.net/images/going-bovine.jpg","author":"Libba Bray","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/going-bovine.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 3:29:31 PM"}}
