{"id":77060,"no":69,"title":"Page 69","content":"“How do you pay for all of this?” I ask.\\n\\n “We put together SPEW tests for the entire nation, plus all the prep materials, ‘Everything you need to SPEW without a second thought,’” Daniel says.\\n\\n “So, what were you doing out on the road?” Ruth asks. When I don’t answer, she puts her hand on mine. “Hey. It’s okay. We’ve all been there.”\\n\\n Everybody’s been so nice to me here. It’s the first time since my diagnosis that I’ve felt sort of normal, and I’m afraid of f**king it all up. “You wouldn’t believe me,” I say.\\n\\n Ruth and Daniel stop eating and give me their full attention. “It’s okay,” Daniel echoes. “There are no secrets here. Secrets hurt your happiness.”\\n\\n I’m too tired to keep hiding, so I tell them everything about my mad cow disease, our mission to try to find Dr. X and save the universe, the Wizard of Reckoning, and the fire gods on my ass. I half expect them to kick me out, but they don’t.\\n\\n Daniel takes hold of my shoulder in a protective way. “No one’s gonna get you here, Cameron. The world is not going to end. I promise you that. You’re one hundred percent safe. As for your disease, doctors are wrong all the time. They need sick people in order to make money.”\\n\\n “Only people who want to get sick actually get sick. They do it to themselves,” Ruth adds. “You can even think yourself well if you want to.”\\n\\n “Yeah? You think so?”\\n\\n “I know so!” Daniel says. “I’ve seen it happen. You can beat it.”\\n\\n I think how easy it would be to stay here, but Dulcie told me that I need Dr. X to be cured. Then again, where the hell is she?\\n\\n “Cameron? You’re making a frowny face,” Ruth says.\\n\\n Just thinking about Dulcie has soured my happiness, and I am pretty happy here. I could stay at CESSNAB and bowl and have a big smoothie and take it easy.\\n\\n “Are you okay?” Ruth says, her hand hovering near the commando alarm.\\n\\n I give her a big smile. “Yeah, I’m good. Really good. In fact, I’d like to stay for a while, if that’s okay.”\\n\\n Ruth gives a little shriek and hugs me. Daniel claps me on the back. “That totally increases my happiness, friend.”\\n\\n CHAPTER TWENTY-FIVE\\n\\n About What Happens When I Learn the Secret of Perfect Bowling and the Revolution Goes Down Big-time\\n\\n For five days, I’ve been learning how to become a part of the CESSNAB Crusaders family. In choir group, I picked up four new songs—“Who Wants to Be Happy,” “Happy Time Starts Right Now,” “Everything About You Is Totally Perfect,” and “Your Name Is Spelled Like ‘Special’ (Only with Different Letters)”—and got to do a big tambourine solo, which I rocked. Daniel and Ruth took me to the CESSNAB video gaming center where we played Extreme Self-esteem Builder! and How Awesome Are You? And of course, there’s church. Every day, we congregate in the huge, gleaming bowling alley, think our most positive I-am-special thoughts, and bowl perfect game after perfect game, which Daniel says is proof that we’re doing everything right. The only blip on the happiness road came on day one, when I had a small seizure and woke up surrounded by five hulking commandos with giant smoothie cups at the ready. So I had some vanilla yum through a straw while Daniel explained that it was not the prions attacking my brain, I just needed to say my mantra over and over—I am special; special people don’t die—and maybe order more stuff. And it’s been great ever since.\\n\\n “Dude, you are living in a dreamworld,” Gonzo says as I ponder ordering a pair of Extra-Cushion-Action CESSNAB Bowling Shoes from the Instant Satisfaction station in the Snackateria. He is definitely not increasing my happiness. “They don’t even have any killing games.”\\n\\n “Mmmm-hmmm.”\\n\\n “Five days, dude. Five f**king days of Smiling Zombie Nation. I can’t bowl or make CESSNAB T-shirts or smoothie it for one more minute. I’m telling you, these guys are freaky. Don’t you think they’re freaky?”\\n\\n “No, I don’t. And don’t forget you thought they were serial killers.”\\n\\n “They totally still could be, dude. They’re fattening us up for the kill.”\\n\\n “No, they’re helping me get well.” I’m not going to let him defrost my happy chill. “Why don’t you order something, friend? A new jacket or some tunes? You like music.”\\n\\n Gonzo snorts. “Yeah, real music. Not this hideous, bowling-for-God CESSNAB shit that’s been raping my eardrums all week.” \\n\\n","sourceLink":"https://allnovel.net/going-bovine/page-69.html","bookId":2718,"book":{"id":2718,"title":"Going Bovine","description":"Storyline: Can Cameron find what he’s looking for? \\n All 16-year-old Cameron wants is to get through high school—and life in general—with a minimum of effort. It’s not a lot to ask. But that’s before he’s given some bad news: he’s sick and he’s going to die. Which totally sucks. Hope arrives in the winged form of Dulcie, a loopy punk angel/possible hallucination with a bad sugar habit. She tells Cam there is a cure—if he’s willing to go in search of it. With the help of a death-obsessed, video-gaming dwarf and a yard gnome, Cam sets off on the mother of all road trips through a twisted America into the heart of what matters most. \\n","cover":"https://allnovel.net/images/going-bovine.jpg","author":"Libba Bray","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/going-bovine.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 3:29:31 PM"}}
