{"id":77062,"no":71,"title":"Page 71","content":"“Fine. I’ll take a copy of Don’t Hurt Your Happiness.” She stamps the card and hands me the book. “You can turn it in at the end of the week. Or whenever, really. It’s just a formality. We find that requiring things of people and making them responsible is a big drag, and that is so not happy. Enjoy!” Grumpy thoughts threaten to invade my new sunny-day brain. I push them away and settle into one of the ergonom-ically correct Day-Glo yellow chairs and open to page one. You are special, it says in big block letters. Everybody is. “Hey,” I say to the guy sitting next to me. He’s totally into his CESSNAB electronic bowling game. The beeping digital score card shows three hundred perfect strikes in a row. “Have you read this?” “Some of it,” he says, without looking up. “But I have friends who know other people who’ve read it and they told me everything.” “Well, I was just wondering about this thing on page one: You’re special. Everybody is.” “Yeah?” “How can you be special if everybody is?” “You’re just part of the specialness, I guess.” He makes another strike and the game congratulates him with an electronic “That is awesome, friend. Way to go!” “Oh,” I say. “Thanks.” “No problem.” Page two: Happiness is the new Manifest Destiny. Go stake your claim on it! Page three: If you start to feel unhappy, buy something. Page four: Embrace the positive! I look up for a second. Library Girl is staring a hole through me. I start toward her, and she quickly opens the books on the return desk, stamping them a little forcefully. “Finished already?” she asks in a fake-happy voice. “Yeah.” “Was it enlightening? Life-changing? Mood-altering? Did it increase your happiness?” She fiddles with one of the ten earrings along her left ear. There’s no doubt she’s playing me. There’s also no doubt that she’s pretty hot. “I’m a-tingling with joy,” I say, matching her smile and wiggling my fingers like I’m on some highly caffeinated drill team. It’s sarcastic, and I know sarcasm hurts your happiness, but it feels kind of good to do it, like stretching a muscle I haven’t used in a while. The corners of Library Girl’s lips twitch into something resembling a smirk, an expression that feels one hundred percent real. “Meet me in the bowling alley,” she whispers. “Five minutes.” When I get there, the church is empty except for Library Girl. She’s perched on my favorite ball return, chewing a huge wad of pink gum and blowing bubbles she pops with loud smacks. “So, tell me,” she says, sucking a dead bubble back into her mouth. “How do you like it here?” “It’s great.” “Yeah,” she says, staring at the ceiling and swinging one leg. “Great. Special. We’re all special.” “Exactly.” “Wanna put that to the test?” she says. “What do you mean?” “A little scientific experimentation. Go ahead. Bowl a perfect game. You can’t lose. If you believe you can do it …” “… Then you can!” I finish. “So why don’t you test it. Think the worst thing you could possibly think and let the ball roll. See if the universe gets mad.” “If I get sad, the alarm will go off and the commandos will come in. So you can’t really test it,” I say. “Huh.” She pushes up her sleeves, revealing a pair of kick-ass biceps. “Here’s a secret,” she says, looking around. “Sometimes, they’re busy ordering stuff and don’t watch. Like now.” She flips a switch and the balls come to life, bouncing along on their well-oiled, shiny grooves. My favorite purple ball is within reach. I haven’t had any unhappy thoughts for days. I’m out of practice. I’m sort of annoyed at Gonzo for what he said earlier but not enough to really work myself up about it. Dulcie pops into my mind, the way she just left. And then a thought I have no control over works its way into my brain: What if I never see her again? “Oooh, you look pretty bummed. Let her rip.” I throw the ball at the lane. It bounces and skitters across the smooth, polished wood, careening unpredictably. By all rights, it should hit the gutter, but it doesn’t. Instead, it scoots right back to the center and delivers a perfect strike. “Try again,” Library Girl urges.","sourceLink":"https://allnovel.net/going-bovine/page-71.html","bookId":2718,"book":{"id":2718,"title":"Going Bovine","description":"Storyline: Can Cameron find what he’s looking for? All 16-year-old Cameron wants is to get through high school—and life in general—with a minimum of effort. It’s not a lot to ask. But that’s before he’s given some bad news: he’s sick and he’s going to die. Which totally sucks. Hope arrives in the winged form of Dulcie, a loopy punk angel/possible hallucination with a bad sugar habit. She tells Cam there is a cure—if he’s willing to go in search of it. With the help of a death-obsessed, video-gaming dwarf and a yard gnome, Cam sets off on the mother of all road trips through a twisted America into the heart of what matters most.","cover":"https://allnovel.net/images/going-bovine.jpg","author":"Libba Bray","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/going-bovine.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 3:29:31 PM"}}
