{"id":77071,"no":80,"title":"Page 80","content":"I’m not real sure on the etiquette for advice on shoplifting so I just say, “Cool. Thanks.”\\n\\n Some guy drives up in a tricked-out SUV. “Tara, where the hell you been?” he shouts through the open passenger window.\\n\\n Taking the lollipop out of her mouth, she yells back, “None of your f**king business!”\\n\\n “Why you gotta talk that way? Let’s go to the party.”\\n\\n Tara tosses the lollipop into the parking lot. “I’m out of cigarettes.”\\n\\n “I got cigs. Who’s this?” he asks, nodding in my direction.\\n\\n Great. Just what I need.\\n\\n “Whaddyou care,” she says. “Maybe he’s my new boyfriend.”\\n\\n “I just came here for a soda,” I say.\\n\\n “Yeah? Where is it, then?” the guy in the SUV taunts.\\n\\n If this were a movie, I would bust a secret move so fierce the entire place would be razed to the ground. I’d finish with something snappy like “And don’t forget my soda, punk” while I strolled off into the night. But it’s not a movie, and I just stuff my twitching hands into my pockets like the big mad-cow-disease-afflicted chickenshit that I am.\\n\\n “You’re not the boss of me!” Tara shouts to the guy in the SUV. “I can do whatever I want. In case you forgot, we are broken up, Jus-tin!” She gives it a head swivel for added effect and puts her arm around my waist, which is basically like painting a target on my chest.\\n\\n “I should be getting back,” I say, stepping away from her.\\n\\n Jus-tin! turns on his inside car light. I can see he’s wearing a blue trucker hat and an oversized football jersey, and a huge diamond stud in his right ear. He’s got a scruffy brown beard. “Aw, come on, Tara. You don’t mean that, baby.”\\n\\n She turns to me. “Do you have any cigarettes?”\\n\\n “Sorry. No.”\\n\\n “Can you get some?” she asks, sidling up to me. I notice with no small percentage of fear that the Justin guy looks like he could seriously kick my ass.\\n\\n “That guy won’t let me back in,” I say, holding out my hands in a “sorry” pose. They’ve stopped spazzing, so there’s that, at least.\\n\\n Employee #12 stands near the doors with his arms folded across his chest, letting us know we are not welcome in his Gas-It-N-Git lot. It’s a cops-will-be-called stance. An I-am-an-action-hero-of-the-all-night-mart stance. I wonder how he would sound saying “Don’t forget my soda, punk”?\\n\\n “Dammit,” Tara says, chewing at a ragged nail. She saunters over to the open passenger window on the SUV. “Gimme a smoke.”\\n\\n A lighted cigarette is passed through the window. She takes a deep puff, blows out some smoke, and just like that, opens the door and crawls in. There’s some intense kissing. Justin turns off the interior light.\\n\\n “Okay, later,” I say, walking back toward the hulking shadow of the interstate.\\n\\n “Wait!” Tara calls. She’s hanging out the window, her arms dangling, the cigarette stuck between her first and second fingers. “You wanna go to a party?”\\n\\n We drive through the sleeping town. The traffic lights have gone to blinking yellows, and the streets glisten from an earlier rain. Tara tells me her five-minute life story. She’s fifteen. She lives with her mom, who works as a nail technician and brings home free polish and cucumber lotion to the trailer they share with four cats. “The whole dang bathroom smells like cucumber and cat poop, I swear,” she says, offering me a cigarette, which I decline. Tara hates school but loves a show about supermodels and wants to be one.\\n\\n “She just did a boat show,” Justin tells me with a mix of pride and wariness. Like he only wants other guys to notice that he’s with a hot girl, not actually notice the hot girl herself. Justin’s eighteen but still a junior. He also lives with his mom and her “sorry-assed retard of a boyfriend” in a “crappy, two-bedroom apartment near Enormo-Mart.” For money, he bags groceries and sells the odd bit of pot, which is why hitting Brian Kinner’s party is “so vital.”\\n\\n They finally ask me about myself. Usually I would edit my story, say as little as possible so I could stay in hiding mode. It’s been my M.O. my entire life—living just below the radar. But tonight, I’m so tired I just tell them everything. It feels good not to hold myself in check.\\n\\n “Mad cow disease?” Tara says, exhaling smoke. “Is that something you get from sex?”\\n\\n “No,” I say. “It’s not contagious.”\\n\\n “Wow,” Tara says. “That’s so sad. Justin, don’t you think that’s so sad?” \\n\\n","sourceLink":"https://allnovel.net/going-bovine/page-80.html","bookId":2718,"book":{"id":2718,"title":"Going Bovine","description":"Storyline: Can Cameron find what he’s looking for? \\n All 16-year-old Cameron wants is to get through high school—and life in general—with a minimum of effort. It’s not a lot to ask. But that’s before he’s given some bad news: he’s sick and he’s going to die. Which totally sucks. Hope arrives in the winged form of Dulcie, a loopy punk angel/possible hallucination with a bad sugar habit. She tells Cam there is a cure—if he’s willing to go in search of it. With the help of a death-obsessed, video-gaming dwarf and a yard gnome, Cam sets off on the mother of all road trips through a twisted America into the heart of what matters most. \\n","cover":"https://allnovel.net/images/going-bovine.jpg","author":"Libba Bray","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/going-bovine.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 3:29:31 PM"}}
