{"id":98231,"no":18,"title":"Page 18","content":"\u0027It was just the complete pizdets.\u0027\\n\\n He uttered the Russian obscene word, which was commonly used in two senses - \u0027total fuck-up\u0027 and \u0027unsurpassable excellence, in some way related to a total fuck-up\u0027. Yet it had one more rare meaning that I suddenly recalled. I sat upright.\\n\\n \u0027That\u0027s it, I\u0027ve remembered!\u0027\\n\\n \u0027What have you remembered?\u0027\\n\\n \u0027I\u0027ve remembered who you are.\u0027\\n\\n \u0027And who am I?\u0027\\n\\n \u0027I read somewhere about a dog like you with five legs. The Dog Pizdets. He sleeps up among the eternal snows, and when enemies descend on Russia in their hordes, he wakes up and . . .\u0027\\n\\n \u0027Treads on them with his leg?\u0027 he asked.\\n\\n \u0027No. He . . . He kind of happens to them. Like shit happens, you know. That\u0027s it. And I think in the northern myths he\u0027s called \"Garm\". Have you come across him? The Nordic project\u0027s your area, after all.\u0027\\n\\n \u0027No,\u0027 he said, \u0027I haven\u0027t. It\u0027s interesting. Tell me more.\u0027\\n\\n \u0027He\u0027s a truly fearsome dog. The wolf Fenrir\u0027s double. He\u0027ll come into his own after Ragnarek. But in the meantime he guards the house of the dead.\u0027\\n\\n \u0027What other information do you have?\u0027\\n\\n \u0027Something else a bit vague . . . Like he\u0027s supposed to spy on men to see how they make fire and pass the secret on to women . . .\u0027\\n\\n \u0027Skip this,\u0027 he growled. \u0027What else?\u0027\\n\\n \u0027That\u0027s all I remember.\u0027\\n\\n \u0027And what are the practical consequences here?\u0027\\n\\n \u0027Concerning Garm, I don\u0027t know. You need to go to Iceland for a consultation. But concerning Pizdets . . . Try to happen to something.\u0027\\n\\n I said that to him as a joke, but he took my words absolutely seriously.\\n\\n \u0027To what?\u0027\\n\\n I was suddenly infected with his seriousness. I ran my eyes over the surrounding space. The laptop? No. The electric kettle? The light bulb?\\n\\n \u0027Try happening to the light bulb,\u0027 I said.\\n\\n A second went by. Then suddenly the light bulb flared up in a bright bluish glare and went out. Everything went dark. But for a few more seconds the spiral of wire, photographed by my retina, continued to illuminate my inner world with an echo of its extinguished light. When that imprint faded, the darkness became total. I got up, fumbled on the wooden crate that served us as a table to find the torch, and turned it on.\\n\\n There was no one else in the room.\\n\\n He didn\u0027t come back for two days and nights. I was sick with worry and exhausted by the uncertainty. But when he came in I didn\u0027t reproach him, not a single word. Chekhov was right: a woman\u0027s soul is essentially an empty vessel that is filled by the sorrows and joys of her beloved.\\n\\n \u0027Well, how was it? Tell me!\u0027\\n\\n \u0027What point is there in telling you?\u0027 he said. \u0027This I have to show you.\u0027\\n\\n \u0027Have you learned to do it?\u0027\\n\\n He nodded.\\n\\n \u0027And what can you happen to?\u0027\\n\\n \u0027Why, to anything,\u0027 he said.\\n\\n \u0027Anything at all?\u0027\\n\\n He nodded again.\\n\\n \u0027Even me?\u0027\\n\\n \u0027Well, not unless you ask me to.\u0027\\n\\n \u0027Can you happen to yourself?\u0027\\n\\n He gave strange sort of chortle.\\n\\n \u0027That\u0027s what I did first of all. Straight after the light bulb. Otherwise, what kind of Pizdets am I?\u0027\\n\\n I was intrigued and even a little frightened - after all, this was a serious metaphysical action we were talking about here.\\n\\n \u0027And what kind of Pizdets are you?\u0027 I asked in a voice hushed with respect.\\n\\n \u0027Total,\u0027 he replied. \u0027Absolute, final, complete and irreversible.\u0027\\n\\n At that moment he exuded such romantic power and mystery that I couldn\u0027t restrain myself and reached out to kiss him. He turned pale and stepped back, but then apparently realized that wasn\u0027t the way real machos behaved, and allowed me to finish what I\u0027d begun. Every muscle in his body tensed up, but nothing terrible happened.\\n\\n \u0027I\u0027m so happy for you, darling!\u0027 I said.\\n\\n Not many were-creatures know what it is to feel happy for someone else. And tailless monkeys know even less about it, all they know how to do is smile broadly in order to boost their social adaptability and increase the volume of sales. While imitating the feeling of happiness for someone else, the tailless monkey actually experiences envy or, in the best case, remains indifferent. But I really did experience that feeling, as pure and transparent as the water in a mountain stream.\\n\\n \u0027You can\u0027t imagine how happy I am for you,\u0027 I repeated and kissed him again.\\n\\n This time he didn\u0027t move away.\\n\\n \u0027Really?\u0027 he asked. \u0027But why?\u0027\\n\\n \u0027Because after all this time you\u0027re in a good mood. You\u0027re feeling better. And I love you.\u0027\\n\\n His face darkened a little.\\n\\n \u0027I love you too. But I keep thinking that you\u0027re going to leave me. You\u0027d probably be better off if you did. But I won\u0027t feel any happiness for you.\u0027\\n\\n \u0027In the first place, I\u0027m not planning on going anywhere,\u0027 I said. \u0027And in the second place, the feeling you speak of isn\u0027t love, it\u0027s a symptom of egoism. To the male chauvinist in you, I\u0027m merely a toy, a piece of property and a trophy status symbol. And you\u0027re afraid of losing me in the same way a property owner is afraid of being parted from some expensive item. You can never feel happy for someone else that way.\u0027\\n\\n \u0027So how do you feel happy for someone else?\u0027\\n\\n \u0027For that you have to want nothing for yourself.\u0027\\n\\n \u0027You\u0027re telling me you don\u0027t want anything for yourself?\u0027 he asked suspiciously.\\n\\n I shook my head.\\n\\n \u0027But why?\u0027\\n\\n \u0027I told you that once already. When you look inside yourself for a long time, you realize that there\u0027s nothing there. How can you want something for that nothing?\u0027\\n\\n \u0027But if there\u0027s nothing inside you, there\u0027s nothing inside anyone else either.\u0027\\n\\n \u0027If you think about it properly, there\u0027s nothing real anywhere,\u0027 I said. \u0027There\u0027s only the choice with which you fill emptiness. And when you feel happy for someone else, you fill emptiness with love.\u0027\\n\\n \u0027Whose love? If there isn\u0027t anybody anywhere, then whose love is it?\u0027\\n\\n \u0027That doesn\u0027t matter to emptiness. And don\u0027t you get hot and bothered about it either. But if you want a meaning for life, you\u0027ll never find a better one.\u0027\\n\\n \u0027But love - isn\u0027t that emptiness too?\u0027\\n\\n \u0027Sure.\u0027\\n\\n \u0027Then what\u0027s the difference?\u0027\\n\\n \u0027The difference is emptiness too.\u0027\\n\\n He thought for a moment.\\n\\n \u0027But can you fill the emptiness . . . with justice?\u0027\\n\\n \u0027If you start filling the emptiness with justice, you soon end up as a war criminal.\u0027\\n\\n \u0027You\u0027re getting something confused there, Ginger. Why a war criminal?\u0027\\n\\n \u0027Well, who\u0027s going to decide what\u0027s just and what isn\u0027t?\u0027\\n\\n \u0027People.\u0027\\n\\n \u0027And who\u0027s going to decide what the people should decide?\u0027\\n\\n \u0027We\u0027ll think of something,\u0027 he said and glanced at a fly soaring past. The bluebottle dropped to the floor.\\n\\n \u0027What are you doing, you brute? Do you want to be like them?\u0027\\n\\n I nodded in the direction of the city.\\n\\n \u0027I am like them,\u0027 he said.\\n\\n \u0027Like who?\u0027\\n\\n \u0027The nation.\u0027\\n\\n \u0027The nation?\u0027 I echoed incredulously.\\n\\n I think even he was embarrassed by the pomposity of the phrase, and he decided to change his tone.\\n\\n \u0027I was just thinking, maybe I ought to go to work. To find out how things are going.\u0027\\n\\n I was staggered.\\n\\n \u0027Are you serious? Aren\u0027t three bullets enough for you? You want more?\u0027\\n\\n \u0027You get these misunderstandings in our profession.\u0027\\n\\n \u0027What misunderstandings?\u0027 I groaned. \u0027It\u0027s the system! You thought the system needed bright individuals, did you? It needs everyone grunting along together!\u0027\\n\\n \u0027If necessary, I\u0027ll grunt with the rest. You just think, what are we going to do when the money runs out?\u0027\\n\\n \u0027Oh, that\u0027s not a problem. Don\u0027t worry about that. When I go to the shop I can do some streetwalking.\u0027\\n\\n He knitted his eyebrows in a frown.\\n\\n \u0027Don\u0027t you dare talk like that!\u0027\\n\\n \u0027And don\u0027t you dare say \"don\u0027t you dare\" to me, all right?\u0027\\n\\n \u0027My girl\u0027s going to sell herself . . . I can\u0027t get my head round that.\u0027\\n\\n \u0027\"My girl, my girl . . .\" Exactly when did you privatize me?\u0027\\n\\n \u0027Are you going to earn money from prostitution? And feed us with it? Like something out of Dostoevsky.\u0027\\n\\n \u0027Oh fuck your Dostoevsky,\u0027 I exploded. \u0027And I have.\u0027\\n\\n He looked at me with interest.\\n\\n \u0027Well, how was it?\u0027\\n\\n \u0027Nothing special.\u0027\\n\\n We both laughed. I don\u0027t know what he was laughing at, but I had a good reason. I won\u0027t include it in these pages, out of respect for Russian literature, but let me just say that the red spider in The Possessed once crawled across the hem of my sarafan ... Ah, all the titans of the spirit to whom I have given my amusing little gift! My only regret is that I never raised to Vladimir Vladimirovich Nabokov\u0027s lips the goblet that he described so magnificently. But in Soviet times leaving the country was a problem. Let this be yet another villainous outrage on the conscience of the baleful communist regime.\\n\\n Fortunately the nascent quarrel had ended in laughter. I had almost made a mistake - you should never directly contradict a man, especially if he is tormented by doubts about his own worth. I ought to have found out what was on his mind first.\\n\\n \u0027Do you want to go back to pumping oil?\u0027 I asked.\\n\\n \u0027No, not there. Mikhalich does the howling there now.\u0027\\n\\n I guessed that during his absence he had been in contact with the outside world - he might have seen someone or spoken with them on the phone. But I didn\u0027t show the slightest curiosity about that.\\n\\n \u0027Mikhalich? But when he howled, the skull didn\u0027t cry.\u0027\\n\\n \u0027They\u0027ve come up with a new technology. Take five ccs of ketamine, add two ccs of pervitine, inject and then apply an electric current.\u0027\\n\\n \u0027To the skull?\u0027\\n\\n \u0027To Mikhalich.\u0027\\n\\n \u0027The perverts.\u0027\\n\\n \u0027Too true,\u0027 he said. \u0027It\u0027ll be curtains in a year like that.\u0027\\n\\n \u0027For Mikhalich?\u0027\\n\\n \u0027Nah, it makes no difference to Mikhalich. Curtains for the skull. It\u0027s already covered in cracks from all those tears . . . Caliphs for an hour . . . As long as the oil\u0027s flowing, the money\u0027s rolling in, they\u0027re doing fine. But nobody wants to think about what\u0027s going to happen tomorrow.\u0027\\n\\n \u0027Listen, what kind of skull is that?\u0027 I said, finally asking a question that had been tormenting me for ages.\\n\\n \u0027That\u0027s something I can\u0027t tell you,\u0027 he said, suddenly turning sombre. \u0027It\u0027s a state secret. And in general, don\u0027t talk about my job.\u0027\\n\\n I wasn\u0027t surprised that he still thought of the old firm as his work. There are some jobs you can\u0027t resign from of your own free will. But I hadn\u0027t expected him to want to go back to the people who had put three silver bullets in him. Although I did-n\u0027t know what had really happened then - he never shared it with me.\\n\\n \u0027Where will you go, if not to the oilfield?\u0027 I asked.\\n\\n \u0027They\u0027ll find something for a super-werewolf to do.\u0027\\n\\n \u0027What?\u0027 I said with a frown. \u0027What super-werewolf?\u0027\\n\\n \u0027Me,\u0027 he replied, surprised.\\n\\n \u0027Since when did you become a super-werewolf?\u0027\\n\\n \u0027Since when? As if you haven\u0027t seen.\u0027\\n\\n \u0027You think you\u0027re a super-werewolf?\u0027\\n\\n \u0027What do you mean - think? I know.\u0027\\n\\n \u0027From what?\u0027\\n\\n \u0027From this,\u0027 he said. \u0027Watch.\u0027\\n\\n Another fly zooming along just below the ceiling dropped to the floor. It was strange to watch - the flies didn\u0027t drop vertically, they followed parabolic curve, continuing their forward motion, and they looked like microscopic kamikaze planes, nose-diving at the enemy from on high.\\n\\n \u0027Stop showing off,\u0027 I said. \u0027What does one thing have to do with the other?\u0027\\n\\n \u0027Meaning?\u0027\\n\\n \u0027Well, let\u0027s accept you can kill these flies. Let\u0027s accept that you\u0027re Pizdets and Garm. But why have you suddenly decided that on top of all that you\u0027re the super-werewolf as well?\u0027\\n\\n \u0027Then who is the super-werewolf, if not me?\u0027\\n\\n \u0027I told you already,\u0027 I said. \u0027The super-werewolf is a metaphor. To call some individual creature the super-werewolf means to descend to a very primitive level.\u0027\\n\\n \u0027Okay, then I\u0027ll be him on that primitive level,\u0027 he said in a conciliatory tone. \u0027You got a problem with that, Ginger?\u0027\\n\\n \u0027No, we can\u0027t leave things like that. Let\u0027s analyse this question properly.\u0027\\n\\n He sighed.\\n\\n \u0027Go on, then.\u0027\\n\\n \u0027Imagine I buy myself a uniform on Arbat Street and start walking round town in it, making out that I\u0027m a general in the FSB. You tell me I\u0027m not a general, and I say, ah, go on, let me be a general for a bit, what\u0027s your problem?\u0027\\n\\n \u0027That\u0027s an entirely different matter. The rank of general is awarded by a specific structure.\u0027\\n\\n \u0027Right. That\u0027s what I\u0027m talking about. Now think how you found out about the super-werewolf. You didn\u0027t hear it from Mikhalich, did you?\u0027\\n\\n \u0027No.\u0027\\n\\n \u0027Then there\u0027s probably some system of values that the word came from. Super-werewolf is the same kind of rank as general. Only it\u0027s awarded by tradition. And you have about as much to do with that tradition as I do with your firm. Do you understand that, grey one?\u0027\\n\\n \u0027And I suppose you, Ginger, do have something to do with this tradition, right?\u0027\\n\\n \u0027Not only do I have something to do with it,\u0027 I said. \u0027I\u0027m the carrier of the tradition. The line holder, to use the correct term.\u0027\\n\\n \u0027What line\u0027s that?\u0027\\n\\n \u0027The line of transmission.\u0027\\n\\n \u0027You mean you\u0027re the absolute authority here as well?\u0027 he asked. \u0027Straining yourself a bit, aren\u0027t you? Think you\u0027ll be able to hold up the roof?\u0027\\n\\n He seemed to be genuinely irritated - he even used an expression from the criminal jargon used by bandits and the FSB.\\n\\n \u0027Don\u0027t confuse a mystical tradition with the Shangri-La casino,\u0027 I said. \u0027The line holders are called that because they hold on to the line, not because they hold it up.\u0027\\n\\n My answer seemed to puzzle him.\\n\\n \u0027But what is that - a line of transmission?\u0027 he asked. \u0027What\u0027s transmitted along it?\u0027\\n\\n \u0027Nothing.\u0027\\n\\n \u0027What?\u0027\\n\\n \u0027Like I said. Nothing. I\u0027ve explained that to you so often, this kettle will understand it soon.\u0027 \\n\\n","sourceLink":"https://allnovel.net/the-sacred-book-of-the-werewolf/page-18.html","bookId":2607,"book":{"id":2607,"title":"The Sacred Book of the Werewolf","description":"Storyline: One of the most progressive writers at work today, Victor Pelevin?s comic inventiveness has won him comparisons to Kafka, Calvino, and Gogol, and Time has described him as a ?psychedelic Nabokov for the cyberage.? In The Sacred Book of the Werewolf, a smash success in Russia and Pelevin?s first novel in six years, paranormal meets transcendental with a splash of satire as A Hu-Li, a two-thousand-year-old shape-shifting werefox from ancient China meets her match in Alexander, a Wagner-addicted werewolf who?s the key figure in Russia?s Big Oil. Both a supernatural love story and an outrageously funny send-up of modern Russia, this stunning and ingenious work of the imagination is the sharpest novel to date from Russia?s most gifted literary malcontent.\\n","cover":"https://allnovel.net/images/the-sacred-book-of-the-werewolf.jpg","author":"Victor Pelevin","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-sacred-book-of-the-werewolf.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:32:13 PM"}}
