{"id":98222,"no":9,"title":"Page 9","content":"\u0027It\u0027s because of the smell,\u0027 he said. \u0027It has a special chemical that doesn\u0027t let smells through.\u0027\n \u0027And what can you smell up here?\u0027 I asked, surprised.\n We were sitting by the door to the roof, which was open (he avoided going out of his mirror-walled birdhouse, because he was worried about snipers, or photographers, or avenging lightning from the heavens). Apart from a very faint whiff of exhaust fumes from the street, I couldn\u0027t detect any smells at all.\n \u0027I can smell everything in the world up here,\u0027 he said with a frown.\n \u0027Such as?\u0027\n He looked at my white blouse and drew in a deep breath through his nose.\n \u0027That blouse of yours,\u0027 he said. \u0027Before you, it was worn by a middle-aged woman who used home-made eau-de-cologne made from Egyptian lotus extract . . .\u0027\n I sniffed my blouse. It didn\u0027t smell of anything.\n \u0027Seriously?\u0027 I queried. \u0027I bought it in a second-hand shop, I liked the embroidered pattern.\u0027\n He drew in another breath of air.\n \u0027And what\u0027s more, she diluted the extract with fake vodka. There\u0027s a lot of fusel oil.\u0027\n \u0027What are you saying?\u0027 I asked, nonplussed. \u0027I feel like taking the blouse off and throwing it away . . . So what else can you smell?\u0027\n He turned towards the open door.\n \u0027There\u0027s a terrible smell of petrol. Bad enough to give you a splitting headache. And there\u0027s a smell of asphalt, rubber, tobacco smoke . . . And of toilets, human sweat, beer, baking, coffee, popcorn, dust, paint, nail varnish, doughnuts, newsprint . . . I could go on and on with the list.\u0027\n \u0027But don\u0027t these smells get mixed up together?\u0027\n He shook his head in reply.\n \u0027It\u0027s more as if they\u0027re layered over each other and contained in each other, like a letter in an envelope that\u0027s lying in the pocket of a coat that\u0027s hanging in a wardrobe, and so on. The worst thing by far is that very often you find out lots of things you absolutely didn\u0027t want to know. For instance, they give you a document to sign, and you can tell that yesterday there was a sandwich with stale salami lying on it. And that\u0027s not all, the smell of the sweat from the hand that gave you the document makes it clear that what it says in the document isn\u0027t true . . .\n And so on.\u0027\n \u0027And why does this happen to you?\u0027\n \u0027It\u0027s just the usual lupine sense of smell. It often stays with me even in the human phase. It\u0027s tough. But I suppose it saves me from lots of bad habits.\u0027\n \u0027For instance?\u0027\n \u0027For instance, I can\u0027t smoke hash. And definitely not snort cocaine.\u0027\n \u0027Why?\u0027\n \u0027Because from the first line I can tell how many hours the mule was carrying it up his ass on his way from Colombo to Minsk. And that\u0027s nothing, I even know how many times that ass of his was . . .\u0027\n \u0027Don\u0027t,\u0027 I interrupted. \u0027Don\u0027t go on. I\u0027d already got the idea.\u0027\n \u0027And the worst thing is, I never know when it\u0027s suddenly going to overwhelm me. It\u0027s as unpredictable as a migraine.\u0027\n \u0027You poor thing,\u0027 I sighed. \u0027What a pain.\u0027\n \u0027Well, it\u0027s not always a pain,\u0027 he said. \u0027There are some things about it I really enjoy. For instance, I like the way you smell.\u0027\n I was embarrassed. A fox\u0027s body really does have a very faint aroma, but people usually take it for perfume.\n \u0027And what do I smell of?\u0027\n \u0027I can\u0027t really say . . . Mountains, moonlight. Spring. Flowers. Deception. But not a wily kind of deception, more as if you\u0027re having a joke. I really love the way you smell. I think I could breathe that smell in all my life and still keep finding something new in it.\u0027\n \u0027Well that\u0027s nice,\u0027 I said. \u0027I felt very awkward when you said that about my blouse. I\u0027ll never buy anything in second-hand shops again.\u0027\n \u0027Don\u0027t worry about it,\u0027 he said. \u0027But I would be grateful if you\u0027d take it off.\u0027\n \u0027Is the smell that strong?\u0027\n \u0027No, it\u0027s very weak. It\u0027s just that I like you better without any blouse.\u0027\n I thought for a moment and then pulled the blouse off over my head.\n \u0027You\u0027re not wearing any bras today,\u0027 he laughed.\n \u0027Right,\u0027 I said. \u0027I read that when a girl goes to see her young man and something is supposed to happen . . . You know, if she is ready for something to happen . . . Then she doesn\u0027t put one on. It\u0027s a kind of etiquette.\u0027\n \u0027Where did you read that?\u0027 he asked.\n \u0027In Cosmopolitan. Listen, I\u0027ve been wanting to ask you for a long time. Do you mind that I have small breasts?\u0027\n \u0027No, I really like that,\u0027 he said. \u0027I just want to go on and on kissing them for ever.\u0027\n It seemed to me that he was talking with an effort, as if his jaws were being cramped by a yawn. That was what usually happened just before the transformation. Despite his reassuring declaration about \u0027going on kissing them for ever\u0027, we rarely got that far. But then, his hot wolf\u0027s tongue . . . But I won\u0027t transgress the bounds of propriety, the reader understands perfectly well without that.\n He barely had time to take my knickers off before it all happened: sexual arousal triggered the mysterious mechanism of his metamorphosis. Less than a minute later, standing there in front of me was a sinister, handsome beast, whose most astounding asset was his instrument of love. Every time I found it impossible to believe that my simulacrum pouch was really capable of accommodating that hammer of the witches.\n When he turned into a wolf, Alexander lost the ability to speak. But he could understand everything he heard - although, of course, I had no guarantee that his wolfish understanding was the same as his human one. His remaining communicative capabilities were inadequate for conveying the complex motions of the soul, but he could reply in the affirmative or the negative. \u0027Yes\u0027 was signified by a short, muffled roar:\n \u0027Gr-r-r!\u0027\n And he expressed the meaning \u0027no\u0027 with a sound like something halfway between a howl and a yawn.\n \u0027Whoo-oo-oo!\u0027\n I found this \u0027whoo-oo-oo\u0027 rather funny - it was more or less the way a dog whines in the heat when its masters have locked it out on the balcony. But I didn\u0027t tell him about this observation of mine.\n His hands didn\u0027t turn into wolf\u0027s paws, they were more like the fantastic extremities of some movie Martian. I found it impossible to believe those claws were capable of tender touching, even though I knew it from my own experience.\n And so, when he set them on my bare stomach, as always, I felt a bit uneasy.\n \u0027What do you want, beastling?\u0027 I asked. \u0027Shall I lie on my side?\u0027\n \u0027Whoo-oo-oo!\u0027\n \u0027On my tummy?\u0027\n \u0027Whoo-oo-oo!\u0027\n \u0027Kneel down?\u0027\n \u0027Gr-r-r!\u0027\n \u0027All right, only be careful, okay?\u0027\n \u0027Gr-r-rrrrrr-r!\u0027\n I wasn\u0027t entirely certain that last \u0027grrrr\u0027 meant \u0027yes\u0027, and not just \u0027grrr\u0027, but even so I did as he asked. And I was immediately sorry: he took hold of my tail with his paw.\n \u0027Hey,\u0027 I said, \u0027let go, you monster!\u0027\n \u0027Whoo-oo-oo!\u0027\n \u0027Really, let go,\u0027 I repeated plaintively.\n \u0027Whoo-oo-oo!\u0027\n And then what I was most afraid of happened - he pulled my tail. Not very hard, but still hard enough for me suddenly to remember the Sikh from the National hotel. And when he jerked my tail a little more sharply, I felt so ashamed for the role I\u0027d played in that man\u0027s fate that I sobbed out loud.\n Alexander hadn\u0027t deliberately pulled my tail. He was just holding it, quite gently in fact. But the blows of his hips pushed my body forward, and the result was as if he was trying to rip my tail out of my body. I tensed all my muscles, but I just wasn\u0027t strong enough. With every jerk my soul was inundated by waves of unbearable shame. But the most terrible thing was that the shame didn\u0027t simply sear my heart, it also mingled into a single whole with the pleasure I was getting from what was going on.\n It was something quite unimaginable - truly beyond good and evil. It was then that I finally understood the fatal abysses trodden by De Sade and Sacher-Masoch, who I had always thought absurdly pompous. No, they weren\u0027t absurd at all - they simply hadn\u0027t been able to find the right words to convey the true nature of their nightmares. And I knew why - there were no such words in any human language.\n \u0027Stop,\u0027 I whispered through my tears.\n \u0027Whoo-oo-oo!\u0027\n But in heart I didn\u0027t know what I wanted - for him to stop or to carry on.\n \u0027Stop,\u0027 I repeated, gasping for breath, \u0027please!\u0027\n \u0027Whoo-oo-oo!\u0027\n \u0027Do you want to kill me?\u0027\n \u0027Gr-r-r!\u0027\n I couldn\u0027t hold back any longer and I started crying. But they were tears of pleasure, a monstrous, shameful pleasure that was too enthralling to be abandoned voluntarily. I soon lost any idea of what was happening - perhaps I even lost consciousness too. The next ting I remember is Alexander leaning down over me, already in his human form. He looked perplexed.\n \u0027Did I hurt you?\u0027\n I nodded.\n \u0027I\u0027m sorry . . .\u0027\n \u0027Promise me one thing,\u0027 I whispered. \u0027Promise that you\u0027ll never pull my tail again. Never, do you hear?\u0027\n \u0027My word as an officer,\u0027 he said and set his hand on his medal ribbons. \u0027Was it really bad?\u0027\n \u0027I felt ashamed,\u0027 I whispered. \u0027You know, I\u0027ve done a lot of things in my life that I don\u0027t want to remember. I\u0027ve done a lot of harm to people . . .\u0027\n His face suddenly turned serious.\n \u0027Don\u0027t,\u0027 he said. \u0027Please don\u0027t. Not just now.\u0027\n We foxes are keen hunters of English aristocrats and chickens. We hunt English aristocrats because English aristocrats hunt us, and it\u0027s a sort of point of honour. But we hunt chickens for our own enjoyment. Both types of hunting have their passionate supporters who will shout themselves hoarse defending their choice. The way I see things, hunting chickens has several serious advantages:\n 1. hunting English aristocrats is a source of bad karma, which is acquired by killing even the most useless of men. The karma from chickens is not all that serious.\n 2. to hunt aristocrats you have to travel to Europe (although some believe that the best place is a transatlantic cruise ship). You can hunt chickens anywhere you like.\n 3. while hunting English aristocrats, foxes don\u0027t undergo any physical changes. But when we hunt chickens something happens that bears a distant similarity to a werewolf\u0027s transformation - we come to resemble our wild relatives for a while.\n I haven\u0027t hunted English aristocrats for many decades, and I don\u0027t regret it in the least. But to this day I\u0027m still enthusiastic about chicken-hunting.\n It\u0027s hard to explain to an outsider what chicken-hunting really is. When you cast off your clothes and your shoes and pound furiously against the ground with three paws, clutching the chicken against your breast with the fourth, its little heart beats in unison with yours, and the speed-blurred course of your zigzag run flows freely through your empty mind. At that moment you see clearly that you, and the chicken, and even the pursuers clamouring behind you are really parts of a single incomprehensible whole that dons masks and plays hide-and-seek with itself . . . You want to believe that even the chicken realizes the same thing. And if it doesn\u0027t, then in some life to come it very definitely will!\n These are the basic principles of chicken-hunting:\n 1. you should approach the chicken coop in the guise of a extravagantly clad socialite - wearing an evening dress and high stiletto heels. Your clothes should restrict your movements as much as possible and provoke associations with glamorous fashion magazines.\n 2. you must attract the attention of the owners of the chicken coop - they have to see their elegant visitor steal a chicken.\n 3. you must not run away from your furious pursuers too fast, but not too slowly either - the most important aspect of the hunt is maintaining their confidence that they can overtake the thief.\n 4. when the pursuers have no strength left to continue the pursuit (and also in those cases when they suffer shock from seeing the transformation take place), you should erase their memory of what has happened with a special twitch of your tail and let the chicken go free.\n I introduced the last addendum myself. Only don\u0027t ask me what the chicken will do with this freedom. You can\u0027t just wring its neck, can you? Of course, it sometimes happens that the chicken passes on during the chase. But would it be any better for its evolution to end this life in suburban soup?\n Some of us extend the same logic to the English aristocrats, but I don\u0027t agree with that - theoretically speaking, any English aristocrat could become a Buddha in this life, and you can\u0027t deprive him of that chance just for the sake of idle amusement.\n Ninety-nine per cent of aristocrat-hunting is a tedious social exercise that differs little from a formal tea party. But sometimes the most hard-bitten of my sisters, those with whom I want absolutely nothing to do, gather together in a pack and arrange battues, in the course of which many English aristocrats depart this life at once. In these cases events become quite picturesque, and the concomitant hallucination can be experienced by many thousands of people at the same time - you can get some idea of what I mean from the story of the so-called Battle of Waterloo. But the most shocking details remain hidden from the public.\n I realize how hard it must be to believe in the possibility of such appalling mass deceptions, but the important point here is that when one and the same hallucination is induced simultaneously by several foxes, its power increases proportionately to their number cubed. That is, one and the same suggestion, implanted simultaneously by three foxes, will be almost thirty times as powerful as an illusion created by one of them on her own. This is achieved with the use of secret methods and practices - first the foxes study together how to visualize an object that they have just seen, then an object that they haven\u0027t seen, and then they make others perceive objects that don\u0027t exist, and so on. A complex technique, and the training for it lasts several centuries. But if ten or twelve foxes who have mastered it get together . . . Well, you can see what they\u0027re capable of.\n Some might ask why, in that case, the foxes are not yet the rulers of this world. There are two reasons:\n 1. foxes are not so stupid as to take on that heavy burden.\n 2. foxes are very egotistical and incapable of reaching long-term agreements with each other about anything, except for the collective hunting of English aristocrats.\n These days people possess many new tracking and monitoring devices, and so foxes avoid interfering in human history and solve the problem in a simpler way. In the north of England there are several privately owned castles where aristocrats are bred from the finest stock and raised specially for hunting by foxes - the output isn\u0027t all that large, but the quality is excellent. There are similar nurseries in Argentina and Paraguay, but the conditions there are appalling, and the English aristocrats, who are bred en masse using artificial insemination (so far attempts at cloning have been a failure) are only good for helicopter safaris: they talk like gauchos, drink tequila by the bucketful, require more than three attempts to draw their family tree, and as their last wish just before they die they ask to hear the song \u0027Un Hombre\u0027, dedicated to Che Guevara. Evidently, even in their final moments they are mimicking the portfolio investors whom they aspired to become.\n There is another school of hunting, in which an English aristocrat is individually selected, and the fox herds him along his final road for several years - she becomes his mistress or wife and is there beside him right down to the moment of truth, which in this case is rather horrific. One day, during a thunder-storm or at some other dramatic moment, the fox reveals the whole truth to him and exposes her tail - not in order to implant a suggestion of one more dose of family happiness, but to strike him dead . . . This is the most complicated form of hunting, and it requires a virtuosic mastery of social manners, in which there is no one who can compare with my sister E Hu-Li, who has lived in England for many centuries and attained genuine perfection in this sport.\n The greatest advantage of hunting chickens consists in the supraphysical transformation that we undergo. The chicken is required as a living catalyst who helps us to achieve it - in thousands of years of civilized life foxes have almost lost this ability and, like Dante, we require a guide to lead us into the lower worlds. The transformation does not always take place, and it doesn\u0027t last long in any case, but the sensations it induces are so powerful that you are energized by the memories for many days afterwards.\n Something similar happens to foxes when we are badly frightened, but that process is uncontrollable, whereas the art of chicken-hunting lies precisely in controlling our fear. You have to allow the pursuers to get close enough to trigger the mechanisms of internal alchemy which for a few seconds will turn you into a predatory beast, free from good and evil. Naturally, to avoid being freed from good and evil permanently, you have to maintain a safe distance. Basically, it\u0027s pretty much like surfing, only the price paid for losing your balance is very much more serious. But the positive emotions are far stronger too - nothing is so refreshing for the soul as risk and pursuit.\n It sometimes happens that dogs trail after me, but they immediately give up once they realize who I am. Dogs are just as easily to hypnotize as people. And in addition, they have a special system for spreading information, something like the Internet, only based on smells, so that news travels fast in their circles. After one courageous Rottweiler, who tried to play with me was raped by two Caucasian brothers (I mean sheepdogs), the dogs in the Bitsevsky forest began avoiding me. They\u0027re intelligent beasts, capable of tracing the causal link between a certain Rottweiler growling as he attacks a beautiful red-haired sportswoman and all the male dogs, who are two heads taller than the said Rottweiler, suddenly taking him for a wide-eyed, lovesick bitch in full heat.\n My decision to take Alexander hunting had nothing to do with any desire to boast. A fox\u0027s transformation during a chicken hunt doesn\u0027t go as far as what happens to a wolf, so there was nothing to boast about. But I thought that if I were to undergo the supraphysical shift while Alexander was watching, it would be the best way of saying to him, \u0027you and I are of the same blood\u0027. Perhaps it would extinguish the remnants of mistrust between us and bring us closer - that was what I was vaguely counting on.\n I\u0027d picked out the place for the hunt a lot earlier. One of the tracks that wound through the Bitsevsky forest emerged from the trees at a wooden house in which a forester lived (I\u0027m not sure that\u0027s the correct term, but the man\u0027s job definitely had something to do with the park). Beside the house there was a chicken coop - a very rare thing in modern Moscow. I\u0027d spotted it when I was riding my bike through the forest, and now I decided to make use of my discovery. But first I had to check everything one more time and determine my lines of retreat. Having devoted an entire day to reconnaissance on my bike, I established the following:\n 1. there were chickens in the chicken coop, and also people in the house; and so the two essential ingredients for the hunt were present.\n 2. I should bolt along the road that led into the forest.\n 3. I needed to escape from pursuit before the track emerged from the forest on the other side - there were always a lot of people strolling along the edge of the trees, mostly young mothers with prams.\n In addition, I discovered how to drive a car almost right up to the chicken coop - although the forester\u0027s house looked as if it was lost in the forest, the city began only three hundred metres away: the forest was cut short by a line of six-storey concrete buildings. I noted down the address of the block closest to the chicken coop. Now everything was ready for the hunt.\n My bicycle reconnaissance trip also produced another result. On my way home I rode along a track I didn\u0027t know and discovered a wonderful place where I\u0027d never been before. It was a wide waste lot, actually more like a field, sloping down on one side to a small river and surrounded by the forest. The field was criss-crossed by narrow tracks, and on the slope leading down to the river there was a bike ramp for jumping - a steep embankment of earth worn smooth by numerous tyres. I didn\u0027t dare jump, all I did was ride up it slowly, imagining how it would feel to pick up speed and go soaring into the air. But I wasn\u0027t sure that I would be able to land.\n Not far from the ramp I discovered a strange sculptural composition. A number of grey logs of various lengths had been set into the ground. Their tops had been chiselled into images of the faces of warriors. The warrior-logs stood tight against each other, and coarse, solid benches had been laid out around them. Standing at the outer perimeter, orientated towards the four points of the compass, were four simple gateways made of one log set across the tops of two others, as grey, monolithic and cracked as all the other elements. The whole thing was reminiscent of a wooden Stonehenge that had already suffered damage in its battle with eternity: the logs had been mutilated by camp-fires lit on them by the local kids. But despite the black scorch marks and a host of empty beer bottles, the site had beauty and even some vague kind of grandeur.\n I sat down on one of the logs, fixed my gaze on the red disc of the sun (in Moscow you only get sunsets like that in May) and withdrew into thoughts of the past. I remembered a man I had met more than a thousand years earlier - he was called the Yellow Master, after the name of the Yellow Mountain on which his monastery stood. I only spent one night in conversation with him, but it was a conversation that I shall never forget - I only had to close my eyes and I could see the Yellow Master\u0027s face as clearly as if he were there beside me. And yet I had encountered so many people from day to day over so many years - and they hadn\u0027t left the slightest trace in my memory . . . My sister E knew the Yellow Master too, I thought. I wonder if she remembers him? I\u0027ll have to ask her.\n Just at that moment my mobile phone rang.\n \u0027Hello,\u0027 I said.\n \u0027Hello, Red.\u0027\n I couldn\u0027t believe my ears.\n \u0027Sister E? How wonderful! I was just thinking about you . . .\u0027\n \u0027So that\u0027s why my tail\u0027s itching,\u0027 she laughed. \u0027I\u0027m already in Moscow.\u0027\n \u0027Where are you staying?\u0027\n \u0027In the National hotel. What are you doing tomorrow at one?\u0027\n I was afraid I\u0027d have problems getting into the National, but none of the security men took any notice of me. Maybe that was because I was met by a young female administrator who looked like a Scharfuhrer holding a board with the words \u0027Valued guest of Lady Cricket-Taylor\u0027. She showed me to one of the de luxe suites. All that was missing was a guard of honour with an orchestra.\n E Hu-Li received me sitting on a stripy divan in the suite\u0027s drawing room. I was bothered by the suspicion that I had once met a client in this apartment, either a businessman from South Korea or an Arab arms-dealer. But it might just have been that stripy divan, they have those in lots of the rooms there. When she saw me, my sister stood up to greet me and we embraced tenderly. A transparent plastic bag appeared in her hands.\n \u0027This is for you,\u0027 she said. \u0027Not expensive, but elegant.\u0027\n The bag contained a T-shirt with one word on it in Russian and English:\n The Sacred Book of the Werewolf\n \u0027They sell them in London,\u0027 she said. \u0027In all the different languages. But in Russian the effect is especially nice.\u0027\n And she laughed quietly. I couldn\u0027t help myself and I laughed too - \u0027cockney\u0027 in Russian spells and sounds like \u0027whack\u0027 in the imperative mood; I never noticed that before.\n E Hu-Li looked exactly the same as she had in 1929, when she came to Russia on business for the Comintern, which was fashionable at the time. Only now her hair seemed to be cut just a little shorter. As always, she was dressed absolutely impeccably.\n E Hu-Li\u0027s style hadn\u0027t changed for the last thousand years - it was a kind of extreme radicalism, disguised as utilitarian minimalism. I envied her bold taste - she was always half a step ahead of the fashion. Fashion is cyclical, and over the long centuries my sister E had developed the knack of riding the crests of these cycles with all the skill of a professional surfer - in some miraculous way she was always at the precise point that all the fashion designers were desperately trying to identify.\n And right now she was wearing a mind-blowing waistcoat that looked like a huge bandolier with lots of different-coloured applique pockets that were embroidered with tiny green Arabic script and the big words \u0027Ka-Boom!\u0027 in orange. It was a variation on the theme of the Muslim radical\u0027s explosive belt - the way it would have been made for him by a libertine Japanese designer. At the same time it was a very convenient item - the owner of a waistcoat like that had absolutely no need for a handbag.\n \u0027Isn\u0027t that a little too bold for London?\u0027 I asked. \u0027Doesn\u0027t anyone wax indignant?\u0027\n \u0027Of course not! The English expend all their spiritual energy on hypocrisy. There\u0027s none left over for intolerance.\u0027\n \u0027Is everything really as dismal as that?\u0027\n She waved her hand dismissively.\n \u0027If I had my way, I\u0027d introduce a new term to emphasize the scale of the problem: \"Hippopocrisy\".\u0027\n I can\u0027t stand it when someone speaks badly about entire nations. In my opinion, such a person is either a loser or has a guilty conscience. There was no way sister E was any kind of loser. But as for her conscience . . .\n \u0027But why can\u0027t you be the first to stop being hypocritical?\u0027 I asked.\n \u0027Then that would be cynicism. And who can say which is worst. All in all, the closet\u0027s dark and damp.\u0027\n \u0027What closet?\u0027\n \u0027I mean the English soul, it reminds me of a closet. The best of the English spend all their lives trying to get out of it, but as a rule they only manage it at the moment of death.\u0027\n \u0027How do you know?\u0027\n \u0027Do you have to ask? I can see from the inside, I\u0027m English myself. Well, of course, not entirely - about as much as you\u0027re Russian. We could say that you\u0027re Russian, couldn\u0027t we?\u0027\n \u0027I suppose so,\u0027 I agreed and sighed quietly.\n \u0027And what is the Russian soul like?\u0027\n I thought about it.\n \u0027Like the cab of a long-distance truck. The driver took you in so that you could give him a blowjob. And then he died, so you\u0027re left in the cab on your own, surrounded by nothing but the boundless steppe, the sky and the road. And you have no idea how to drive.\u0027\n \u0027And is the driver still in the cab, or . . .?\u0027 \n","sourceLink":"https://allnovel.net/the-sacred-book-of-the-werewolf/page-9.html","bookId":2607,"book":{"id":2607,"title":"The Sacred Book of the Werewolf","description":"Storyline: \n One of the most progressive writers at work today, Victor Pelevin?s comic inventiveness has won him comparisons to Kafka, Calvino, and Gogol, and Time has described him as a ?psychedelic Nabokov for the cyberage.? In The Sacred Book of the Werewolf, a smash success in Russia and Pelevin?s first novel in six years, paranormal meets transcendental with a splash of satire as A Hu-Li, a two-thousand-year-old shape-shifting werefox from ancient China meets her match in Alexander, a Wagner-addicted werewolf who?s the key figure in Russia?s Big Oil. Both a supernatural love story and an outrageously funny send-up of modern Russia, this stunning and ingenious work of the imagination is the sharpest novel to date from Russia?s most gifted literary malcontent.\n \n","cover":"https://allnovel.net/images/the-sacred-book-of-the-werewolf.jpg","author":"Victor Pelevin","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-sacred-book-of-the-werewolf.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:32:13 PM"}}
