{"id":87847,"no":25,"title":"Page 25","content":"“Well?” He threw up his arms. Was the whole place ghost story crazy? Crazy. The word ricocheted in his head. He was definitely crazy. In lust. Who the hell had said it, Carter or Cliff? Did it matter? He wished that was the long and short of it. Every time he learned something new about her, he only wanted more. There was so much about her that was an enigma, but then looking into her eyes he could see the honesty, the fear, and most of all, the terrible wariness. As if any closeness was an enormous risk. Well, it was. She was…different. And he did have a guard up against her, it just wasn’t doing him much good. The second he had risen, he had wanted nothing more than to lie back down beside her, feel the cool silk of her flesh, watch those eyes open, vulnerable if only for a second. She was truly the most sensuous and incredible lover he’d ever known, and maybe that had been half to do with him, because being with her made him just want so much more, and to be so much more himself. His world had changed because of a ridiculous chance meeting in the night. A bizarre incident at that, because she was the ghost catcher, he was the rational man, and she had been convinced that there had been a real person out on the balcony, and he sure as hell hadn’t found evidence of anyone when he had searched. When they’d opened Melody House to the public, they’d had alarms installed in the main house and the stables. Nuts. It was all simply nuts, and getting worse. And it was going to get worse. He simply would not accept the kind of sensationalism the media would try to put on this latest event. He could not accept that some kind of doorway to the dead had allowed her to find the skull. But then, she had said that research had led her to it. Pray God she remembered that when talking to the papers. But he could see again the way she had looked, digging frantically, and then producing the skull. An image that had chilled him… He should have thought of that before last night. But what the hell did either of them think that they were doing? It was sex in the twenty-first century. Most adults indulged on a whim now and then. He’d had his own share of too-casual relationships. Could be it was just another. Temptation and hormones and human instinct. Except that it wasn’t. “Matt?” “I’ll be in my office,” he said, a bit too gruffly. Shirley looked at him, puzzled. He couldn’t explain. Darcy woke at a quarter of eight, realized that Matt was gone, and tried to reflect on both the wonder and idiocy of the night gone by. But thinking about it merely made her head hurt. Granted, she didn’t have much of what could be called a social life, and as far as a sex life went, it certainly had been nonexistent for a very long time. That had been mainly her choice. But her college years had made her feel somewhat punch-drunk, and since she was afraid of the outcome of any involvement, it had seemed prudent to be a very private person. She had a loving family and good friends at Harrison Investi gations, who understood what it was like to be different. She had never imagined such an overwhelming physical attraction to a man, and she had not envisioned that she could feel such an emotional pull to someone like Matt Stone. The thought that last night had been a serious mistake came only this morning, when Darcy awoke. And along with it, of course, was the knowledge that she was going to get hurt, because she didn’t seem able to put the relationship in any kind of perspective. She felt a tremendous aching for what happened with Matt to be something that could go on…and on. Amazing, when he had truly been such a jerk when they had met, how living in a man’s house, knowing those who knew him well, could give so much insight to his life, and his true character. She hadn’t felt this way since…well, maybe forever. And it was so foolish. She felt elated, having pushed so much that could be incredible between a man and a woman to the back burners of her existence, and also miserable, because a simple night had created a fantasy, a new excitement, and it was something that she well knew could never really be. Her bed now contained the simple, subtle scent of the man within it, memories of warmth and fire, passion and a closeness that remained staggering in its brief intensity. She started to rise, then decided to screw the notion. She didn’t have to be anywhere—other than exactly where she was. The day might look a little better and everything might make more sense if she just had a little sleep. She would close her eyes for a few minutes more, and maybe get, at the least, just a bit more rest. Yet even in a subconscious state, falling into a far deeper sleep than she had imagined, she knew when the dream state came, when the actions and emotions of the past slipped into her, almost as if she slipped into the skin of another. And she knew instantly, on that distant plane, that she had now encoun tered two people. First, a man, then a woman, and now a man again. And that what trauma had taken place between them had reached a heated pinnacle here, in this room, where she slept. She could see herself, below, at the door, though she couldn’t make out face or form, because she was seeing from his eyes, as if the memories of long ago had entered her mind as completely as they had, at one time, touched his reality. Staring up at the house, he knew that it was empty, except for her. And so he stepped inside, quietly closing the door behind him. He knew the house. Knew those who usually peopled it, surrounded it, called it home, or laid a claim to the place. And he knew where they all were. Just as he was aware that she would have come here, thinking she had the right to do so. She didn’t have the right. She had no rights. And what she might have imagined had come to her through him! There was nothing that night to bar his entry. As he had known. He didn’t care if she had heard the door close. She would know he was there soon enough. He stood in the foyer, staring up the stairs, hands rapping idly against his pockets. He felt the bulge in the one. Ah, yes, the item he had stuffed in it earlier. A strip of leather from the stables. He pulled it from his pocket, stretched it out between his hands, tightened it until the leather was taut… Easy to do. He was a strong man. Actually, quite strong. Stronger even than he appeared. No… A protest echoed in his head. A protest against himself. He gritted his teeth, and the whole of his body was as taut as the strip of leather between his hands. Slowly… He forced himself to relax. And he looked to the stairs again…. “Darcy! Darcy! Are you all right dear?” Jostled from the dream, Darcy winced, bolting up. The rapping on her door sounded like thunder, and she rued the interruption with a deep dismay. She’d begun to see so much so clearly. And if only, she thought, she could see these images through, she would have the answers. “Darcy!” “Penny, I’m fine. Just overslept, that’s all!” she called out. “Thank God! I thought that maybe the ghost of the Lee Room had…well, never mind. I don’t mind telling you that it makes me quite nervous, you sleeping in there alone at night!” Darcy stared blankly at the door, wondering if Penny would feel better if she realized that she hadn’t actually been sleeping in there alone last night. “I—I’m fine,” she repeated. “Want me to bring you up a tray?” Penny asked. “No, no, I’ll be right down, thanks.” “Darcy?” Penny persisted beyond the door. “Yes?” “I just had to tell you. You were so right—and so ingenuous! The skull you found was the poor younger sister. You’re incredible! Well, we assume it must be her, of course, I mean, I think that’s the only story we have about a young girl of that age. We have some other female ghosts, of course, but they all have their heads. You’re amazing!” “Thanks, Penny.” “We’ll get her buried—well, we’ll get her head buried with her body!—and she’ll be able to rest in peace, or something like that, right?” “Something like that, yes,” Darcy called. “Well, I’ll be down in my office if you need me. I’ll leave fresh coffee in the kitchen for whenever you want it.” “Thanks, Penny.” She heard the housekeeper walk away as she closed her eyes. She opened them again. She wasn’t going to be able to fall back asleep, and it wouldn’t matter anyway, she didn’t think. She had lost the slender cord of just exactly whatever it was that she could sometimes hold. Darcy looked around the room and held still. The presence was there, but… In the background. Watching. Not coming forward. Waiting? For what? Josh, where are you? Why can’t you help me in here? She thought. No answer. She spoke aloud. “Josh?” It wasn’t that she’d ever had complete control of finding him. He was her spirit guide. John, a Shoshoni friend and another of Adam’s employees, had once tried to explain to her. There beside her, with her, because he had loved her so dearly as a friend when he had lived. And because, somehow, with his death, he had passed his strange gift—or curse—on to her. “Josh, you helped me in the forest, why not here?” But she knew. The sense of violence and bitterness that lingered in this room was too strong. Suddenly, she was anxious to get out herself. Strange, Matt just being in the room had changed it so much…. She wasn’t here to feel secure and safe. She was here to solve the puzzle. She rose, unnerved, and wondering why. She had long ago accustomed herself to ghosts. It was the living who could hurt you! She had heard that often enough. And she had believed it, still believed it. But then again… She had never experienced things quite the way they were happening in the Lee Room. There was no way not to talk to Max Aubry. Though Matt didn’t return the call, Aubry caught him at one o’clock sharp, right when he was heading out to the Wayside Inn to get some lunch. “Matt! Hey, I’ve been trying to get you on the phone.”","sourceLink":"https://allnovel.net/haunted-harrison-investigation-1/page-25.html","bookId":2267,"book":{"id":2267,"title":"Haunted (Harrison Investigation #1)","description":"Storyline: Haunted (Harrison Investigation #1) Love is everywhere. . . When does a gift become a curse? Matt Stone doesn\u0027t believe in ghosts. But there are those who are convinced his home, a historic Virginia estate that dates back to the Revolutionary War, is haunted. Pressured to get at the truth about some strange happenings at Melody House, he agrees to let Harrison Investigations explore the house. But he isn\u0027t ready for beautiful, intriguing Darcy Tremayne. As a paranormal investigator, Darcy has learned to believe in the unbelievable. And she\u0027s given Matt fair warning: sometimes people don\u0027t like the skeletons she finds. She never dreamed that the warning would apply to herself. For she\u0027s about to discover that Melody House holds much more than a simple mystery form the distant past. What it holds is a very real and lethal danger, one that will cast her into a struggle against the worlds of both the living and the dead.","cover":"https://allnovel.net/images/haunted-harrison-investigation-1.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/haunted-harrison-investigation-1.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:23:31 PM"}}
