{"id":87853,"no":31,"title":"Page 31","content":"\n “I suppose,” Carter said. With a shrug he added. “I’ll let you ladies play, Murder, She Wrote.” He stretched and yawned. “If you’ll excuse me. I think I’m going to head out to play some pool. Anyone want to join me?”\n He looked hopefully around the table.\n “Not tonight,” Clint said.\n “You sure?” Carter asked. “Darcy?”\n She shook her head. “Thanks. Maybe tomorrow night.”\n Clint laughed. “Carter, you don’t need to look like an old hanged dog. I heard that our lovely new young city commissioner, Delilah, plays pool a lot of evenings. Ah, hm. I’ll bet you knew that. Makes the Wayside Inn so much more appealing, huh?”\n “She may be there, she may not,” Carter said.\n “Why don’t you just ask her out?” Darcy suggested.\n “Well, since I’m barking up the wrong tree following you around like a coonhound with his tongue on the ground, I might as well.”\n Darcy smiled at him, certain that he was joking, but feeling just a little bit uncomfortable anyway. But Carter’s smile deepened and he winked. “So I should just ask her out, huh?”\n “Sounds like a plan to me,” she said.\n “I’ll give it some real thought. Meanwhile, I’m going to go play pool and see if I run into her. Night, all.”\n With a wave, he left the room.\n Penny stood. “Heavens. I forgot to make those fellows help clean up!”\n “I’d like a little busywork right now,” Darcy told her. “We’ll get this all picked up in a matter of minutes.”\n She stood, gathering plates. Clint rose with her. “I guess I didn’t run out fast enough,” he said, moaning to Penny, giving Darcy a quick grimace.\n “Young man, work is good for you.”\n “I’ll have you know that I actually have lots of irons in the fire. I’m just not sharing my activities until I have something really sound to say.”\n Penny eyed him skeptically. “Hm.” Then she took a casserole plate and moved on into the kitchen.\n Darcy rinsed dishes while Clint put them into the dishwasher. He was amusing as they worked, finding a way to break into a song regarding every comment Penny made as she put leftovers into containers and then into the refrigerator.\n By the time they had finished, Penny was groaning, Darcy was laughing. And yet, Penny was very fond of Clint, and not half as dismayed by his antics as she tried to appear to be.\n Matt didn’t come back in.\n When they finished, Darcy excused herself, anxious to get up to the Lee Room.\n She turned the light on as she closed the door behind her. She looked around the room, then closed her eyes, and tried to let any sensations ease into her.\n The room seemed extraordinarily still and quiet. And empty.\n “Arabella?” she murmured softly aloud. “If there was an injustice, we can at least let it be known. There’s no need to be so hostile. We’re trying to help you.”\n No response. No whisper of a breeze, no hint of a voice on the air. No coldness. Nothing.\n The ghost was lying dormant. Darcy didn’t even get her usual chilling sense of being watched.\n She hesitated a few minutes, then went out on the balcony, gripped the rail, and stared into the night. So beautiful. Surely, this area of Virginia was blessed.\n After a few moments, she went back in.\n She turned on the television, and was surprised to realize that the late-night talk shows had come on. Idly, she began to strip down for bed, started to choose a T-shirt for sleep, then hesitated.\n Matt would come. She was certain.\n She opted for a light-blue silk peignoir.\n Seated upon the bed, she watched the television for several seconds, waiting. But that night, the Lee Room seemed to be giving her nothing.\n “I don’t understand at all,” she said out loud. “You obviously want help. Let me help you. Or are you simply angry with the Stones for what happened to you, Arabella, and eager to hurt them? They are not the same people now. Matt Stone is not the man who did this to you.”\n Still…nothing.\n With a sigh, she turned around and curled up with her pillow.\n Matt wasn’t sure why he stayed out on the porch so late. But then again, there were times when he did just sit out there, doing nothing, feeling the light, watching the land beneath the moonlight. There was something calming and reaffirming about doing so. He did love Melody House. More than that, he loved Virginia, especially his county. It was as if the heritage and history were ingrained in him, and as if his love for the land returned to him sometimes on nights like this, strengthening.\n Either that, or he didn’t want to listen to any more nonsense from Penny.\n Carter had gone to play pool. After a while, Clint, too, had decided to head into town claiming he was feeling a little edgy and might as well go to the Wayside Inn and play some pool.\n Matt lingered outside a bit longer, then went in.\n The house was silent. Those who hadn’t headed out rabblerousing had gone to bed.\n He went to his own room first, but didn’t stay more than a few seconds. Walking out on the balcony, he paused a few minutes again, staring at Darcy’s door. It was closed. She probably hadn’t locked it, though, and he didn’t know if he’d be relieved or angry once he made certain that he was right. She should be locking it.\n But then again, maybe she had left it open for him.\n He tried the door. Open.\n He should go in and yell at her.\n Matt stepped into Darcy’s room, closed and locked the balcony doors behind him. For a few moments he stood where he was, thinking that she had been through a traumatic day. Except that a near-death experience hadn’t seemed so traumatic to her.\n He should leave.\n He wasn’t about to do so.\n The television was on, but the lights had been dimmed. And Darcy was soundly sleeping.\n He walked to the bed, treading softly.\n She looked like a heroine of old, red hair splaying out like an elegant, fire-touched shawl. She was long and lean, slender legs visible beneath the gauze of her nightgown, feet just peeking out. The way she slept…her position enhanced her cleavage. And the way her arms were curled around it…he wanted nothing more than to be her pillow at that moment.\n “Darcy?” he said softly.\n “Um?”\n She stirred, turning. Her eyes, heavy-lidded, opened slowly. She stared at him, a slow, seductive smile curling her lips.\n “Why, Sheriff Stone,” she said softly.\n “You left the balcony doors open,” he said, sliding down to sit beside her.\n Her smile deepened. “Not to be too presumptuous, but…I assumed you might arrive here,” she said. Heavy with sleep, her voice was husky, the sound of it eliciting drumbeats in his veins that echoed into his mind. And beyond.\n “You’re sure…you’re fine? After today?” he queried.\n Her smile deepened. She lifted her arms, curling them around his shoulders as she halfway rose to him. Head cast back, throat at an incredible arch, voice richer than carnal sin itself, she assured him. “Really, truly, fine. Better than fine. Want me to prove it?”\n She had come to him completely, hot breath of her whispered words against his ear, causing the drumbeat to shudder down to a mambo in his groin. He wrapped his arms around her, finding her lips, her mouth, depth and heat and wetness, and locking her into a kiss that seemed to fuse his body to hers. He had to press her back to struggle in his haste to remove his clothing. Bared to muscle and sinew and pure lust, he rose above her, fingers finding the hem of the gauzy gown, dragging it up before he settled, flesh against flesh, arousal spiraling with the first brush of the senses. He could drown in the sweet aroma of her soap, perfume, and self. The feel and taste of her were seductive, intoxicating, and he ran his palms over her flesh again and again, savoring the feel, bringing his lips against her next for a taste of the texture of her skin. The impact of their bodies against one another created an arousal within him that he fought, not just for the desire to be a giving lover, but to prolong the excruciating promise of climax and pleasure.\n Yet that night, she was the aggressor, pressing against him, pushing him away and forcing him to his knees, fingers radiating over his chest, a flutter of kisses and the tip of her tongue drawing exquisite lines against his flesh caused it to burn, chill, and burn again. Her hands aroused and caressed, encircling the fullness of his arousal, before her lips moved again, the liquid fire of her tongue creating an agony of hunger, the energy within her a lightning storm that catapulted around him until it was unbearable and she was in his arms again, bodies fused and fitted and moving in an ever increasing, staccato beat that drove ever upward, wild, sweet, and all but blinding to every thing but the needs of the senses, in the end, totally raw, and then explosive. The force of climax left them both breathless, veins still thundering, hearts pulsing, arms and limbs entwined. He held her against him, loathe to let her go even as satiation seeped throughout him. There were things he wanted to say, and could not. In a distant corner of his mind, he longed not to be entan gled, because his world was real, and she believed so fiercely in all that was not.\n And yet…\n Impossible. He harbored a fear of her. Not because she was an elegant redhead. Because there was something—\n Something, perhaps, that challenged all his beliefs, and therefore, his strengths.\n He thought of all the lies that passed so easily between men and women. And she was far too fine to be told lies.\n And yet…\n “It’s all right, you don’t need to say anything,” she told him.\n His muscles inadvertently flexed.\n Shadow and light filled the room. “I’ve never expected forever,” she told him.\n “Darcy—”\n “It’s all right.”\n “Darcy—”\n “I’m telling you—”\n “Don’t. Don’t tell me anything,” he said, and added, “Just be with me.”\n He cradled her against him. Neither tried to speak again. \n","sourceLink":"https://allnovel.net/haunted-harrison-investigation-1/page-31.html","bookId":2267,"book":{"id":2267,"title":"Haunted (Harrison Investigation #1)","description":"Storyline: \n Haunted (Harrison Investigation #1) \n Love is everywhere. . . \n When does a gift become a curse? \n Matt Stone doesn\u0027t believe in ghosts. But there are those who are convinced his home, a historic Virginia estate that dates back to the Revolutionary War, is haunted. Pressured to get at the truth about some strange happenings at Melody House, he agrees to let Harrison Investigations explore the house. But he isn\u0027t ready for beautiful, intriguing Darcy Tremayne. \n As a paranormal investigator, Darcy has learned to believe in the unbelievable. And she\u0027s given Matt fair warning: sometimes people don\u0027t like the skeletons she finds. She never dreamed that the warning would apply to herself. For she\u0027s about to discover that Melody House holds much more than a simple mystery form the distant past. What it holds is a very real and lethal danger, one that will cast her into a struggle against the worlds of both the living and the dead.\n \n","cover":"https://allnovel.net/images/haunted-harrison-investigation-1.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/haunted-harrison-investigation-1.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:23:31 PM"}}
