{"id":87854,"no":32,"title":"Page 32","content":"In the dream, or somewhere in the deep recesses of her mind, she knew she was someone else. The woman in the room. She had known the woman in the dream before, sat within her entity, and she had known the beginning of the scene from both sides, for she had entered into the energy or entity of the man involved as well. But tonight…she saw it all from the woman’s eyes. Felt the spasm of fear as she heard the sound. Near. Within the house. A creaking of old floorboards. The woman hesitated, straightening, listening, wondering why an ordinary sound should elicit such an instinctive sense of fear. So often, the house was filled with people. Not that night. And at first, she had been glad that it would be so empty. Now… She rose, exiting the room, hurrying to the second-floor landing of the staircase, and looking down. Her breath caught as her eyes focused on the figure at the foot of the stairs. He had entered the house. He had the right, in his own mind, at least. He had the right to everything. She did not. Strange, he had stood there, looking up at her, dozens of times before. Then, he had smiled. Admired the way that moonlight played through the white fabric of her nightgown. He had instilled within her an intoxicating sense of anticipation, pleasure…excitement. He was so many things that a man should be, physically arresting, sensual, exuding a sense of power that was all but an aphrodisiac. But tonight… He did not smile. They stared at one another for several long moments. Maybe an eternity. Then… She saw what he carried. What was in his hands. And the way that he held it…she knew what he intended to do with it. A scream rose to her throat; she held it back, for there would be no one to hear. Then words, disjointed, tumbled from her lips, for she still couldn’t believe what appeared to be his intent. “You…you loved me,” she murmured. “You must still…love me. Somewhat. You can’t mean to…to…you can’t!” The last was whispered. It was a plea. It was a tone that called forth all that had come between them…before. All that had been shared. His eyes remained upon hers. He didn’t reply. He started up the stairs. And she ran. First, back to the room where she had been writing, setting down words, her own revenge. But even as she attempted to close the door, she felt the force of his weight against it. As he burst in, she saw the metal bed warmer hanging on the wall, and she grabbed hold of it firmly, dashing him against the side of the head. He cried out, staggering back. She took flight, forcing her way past him, tearing down the stairs, her white gown trailing in a diaphanous cloud behind her. Blackness, a cloud of shadows, arose around the vision. Darcy’s visions were often so crystal clear in dreams. Sometimes, the fact that they were fading awakened her. And sometimes, the fact that she awakened ended the dream. Perhaps, some instinct inside caused her to awaken so that she wouldn’t witness too much. Maybe innate fear kicked in. But she didn’t want any natural defense mechanisms kicking in on her now. But… She was losing it. Losing touch of the vision. Awakening. No! She knew that she had to see the end. She cried out silently in fierce frustration, knowing she was close…so close…to knowing the end. Knowing that she felt…what the woman had felt. She fought both the fading of the dream, and the terror that was washing over her. She leapt to her feet, crying out, racing to the door. She thought that it was opened. It was not. She slammed against it, woke completely, and stood, facing the door, shaking off the aftereffects. “Darcy?” She heard his voice, startled, deeply concerned. She was aware that he was looking at her, though her back was to him. A wave of misery swept over her; she was certain that there would be revulsion in his eyes. She turned quickly, grabbing her robe from the foot of the bed, slipping into it and heading out the balcony doors. She inhaled deeply, breathing in the night air. She was startled to feel his hands fall upon her shoulders, his presence, warm and strong behind her. “Darcy, are you all right?” His voice was deep, resonant, husky, and deeply concerned. She wondered just what she had done in her sleep. “Yes. Look, I’m really sorry—” “Don’t be. What—happened?” he asked. “What was it? The house? A sound?” “No, nothing. Nothing at all. Just a dream.” “Tell me about it.” “I—can’t,” she lied. “It’s faded already.” “Darcy, please, tell me—” “I can’t. It’s gone.” “All right, then just—” “You don’t want anything to do with this…with me, and it’s all right, honestly—” “Honestly, Darcy, even knowing you as I do, seeing what I’ve seen…I’m not sure what I believe. But I wish you’d try to tell me more about it.” She swung around, startled to see that the eyes she expected to be so filled with wary distaste held nothing but gentleness. Strangely, his manner made her a bit more determined to pull away. He really didn’t understand the half of it. He still didn’t believe. If he really did, he would pull away. She lifted her hands. “It’s very difficult to explain what you don’t understand yourself.” “All right. Let me help.” He smoothed back a lock of hair that the night breeze had sent drifting over her forehead. “Did you always…have visions?” She shook her head. “No.” “Then?” She had to turn away from him. She gripped the balcony. In the distance, the mountains were deeper indigo shadows against the rich deep blue of the moonlit night sky. The entire world might have been at peace. The struggle was within herself. “I was very good friends with Adam Harrison’s son, Josh, when we were in high school. He was bright, funny…charming. But most of the kids stayed away from him. They thought he was strange. He didn’t run around giving out prophesies or anything, but there were moments when it was a little eerie. He knew when it was going to rain or snow, when the ponds had frozen over solidly, when the ice was going to break. There were other little things. He would be cramming for a test when we weren’t supposed to be having one, and then we’d walk into a class to find out that we were having a pop quiz. He knew when Mrs. Malone was going to be out for an extended time, because he had known when her husband was going to die. He didn’t know everything—it wasn’t as if he had a crystal ball that offered up any image he wanted to conjure. There were just times when he did know things that there was really no earthly way he should have.” “I think I did know that Adam had a son. He was actually my grandfather’s friend. They were both tremendous history buffs,” Matt offered, his voice soft as he spoke behind her. “Where is his son now? Does he work for Adam as well.” Darcy shook her head slowly. “Josh is dead.” “I’m sorry. Truly sorry.” Then, a moment later, “What happened?” Darcy shrugged and inhaled again. “We were in a car accident. I’d been dating someone in high school forever, but we had a huge breakup just before senior prom. I asked Josh to go with me. He was great, but Hunter had a real jerk of a friend, and he decided to chase after Josh and play chicken with the cars after the prom. Hunter’s friend was killed as well. I survived. And…” “And?” he said, prompting her after a moment. She turned around at last, her eyes meeting his. “At the funeral, I felt as if I was talking to Josh, as if I saw him. And it had been very strange, because he had known he was going to die. But he told me that it was all right. After that…well, I began to know the little things as well. Where something was when it had been lost. At first, it wasn’t so bad. There were just little things, the day-to-day things. Just the way it had been with Josh. And I thought—and even the therapist I went to thought—that I was creating conversations with Josh in my mind as a way to accept his death.” “But you weren’t?” He was still soft-spoken, watching her with curious eyes, and not those that as yet condemned and warily shut her out. “But then, I started seeing other ghosts,” she said flatly, watching for his reaction. A slight smile twitched his lips, but he was making a serious effort not to mock her. “What ghosts?” Again, she shrugged. “I went to NYU, as I told you.” “Yes?” Darcy kept watching him. “I was walking by one of the very old Episcopalian churches near my dorm and I ran into a woman in front of the church. She was pacing, looking really nervous and distraught, and,” she added wryly, “though my folks had warned me when I went to school not to talk to strangers, she was so upset that I stopped and asked her if she was lost, or if there was anything that I could do. She looked at me as if she had seen a ghost, and said, ‘You can see me?’ I told her that yes, of course, I could see her. She touched my shoulders, and looked as if she was about to cry, and at the same time, she looked incredibly relieved. Then she said, ‘I beg of you, find my granddaughter, Charisse, and tell her that the diamonds are in the Shirley Temple doll. Please, please, do this for me. She’s in there now, in the church, and I can’t seem to reach her, no matter how hard I try. She just can’t see me.’ I thought then that she might be seriously unhinged and I tried to reassure her, to tell her that, of course, her granddaughter could see her, and that she just needed to talk to her. But the woman shook her head violently, becoming so distressed that I told her I would go in and tell Charisse that the diamonds were in the Shirley Temple doll, whatever that meant. I left her on the sidewalk and started to walk into the church. I turned around, and I couldn’t see her anymore. When I opened the door to the church, I saw that a funeral was taking place. Since I felt like an intrusive fool, I walked back out and looked for the woman again. I couldn’t find her. I went back to my dorm. That night, when I was sleeping, I woke up to the sound of sobbing. I nearly had a heart attack. The woman who had been in front of the church was sitting at the foot of my bed. I had chills that went straight into my bones, goose bumps broke out all over my flesh. I couldn’t even scream, I was so scared. But then, the fear just kind of locked in on me. She was sobbing in such horrible pain that I did manage to reach out and touch her. And she looked at me and said, ‘You told me that you’d tell Charisse. You don’t understand, she supported me, and she had nothing, and I knew that I was dying, but that it would be all right, because when I died, she could sell the diamonds, and she and the children would be okay. Please, she cared for an old woman when no one else cared, she with Ben dead in that awful train accident, with two jobs and three children. You’ve got to help me, help her, you have to, she can’t hear me, though I try so hard.’ I knew, I just knew then, that she was dead, that she was a ghost, and that I was somehow communicating with her just as if she were real, and sitting with me, talking to me, in the middle of the night.”","sourceLink":"https://allnovel.net/haunted-harrison-investigation-1/page-32.html","bookId":2267,"book":{"id":2267,"title":"Haunted (Harrison Investigation #1)","description":"Storyline: Haunted (Harrison Investigation #1) Love is everywhere. . . When does a gift become a curse? Matt Stone doesn\u0027t believe in ghosts. But there are those who are convinced his home, a historic Virginia estate that dates back to the Revolutionary War, is haunted. Pressured to get at the truth about some strange happenings at Melody House, he agrees to let Harrison Investigations explore the house. But he isn\u0027t ready for beautiful, intriguing Darcy Tremayne. As a paranormal investigator, Darcy has learned to believe in the unbelievable. And she\u0027s given Matt fair warning: sometimes people don\u0027t like the skeletons she finds. She never dreamed that the warning would apply to herself. For she\u0027s about to discover that Melody House holds much more than a simple mystery form the distant past. What it holds is a very real and lethal danger, one that will cast her into a struggle against the worlds of both the living and the dead.","cover":"https://allnovel.net/images/haunted-harrison-investigation-1.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/haunted-harrison-investigation-1.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:23:31 PM"}}
