{"id":87882,"no":60,"title":"Page 60","content":"“But you are here, and Thayer is in control. Oh, Matt! It means so much to everyone when the Stone of Stoneyville takes part!”\n “All right, Penny, all right. Where’s the uniform?”\n “In the laundry. I’ll bring it right to you.”\n Penny’s excitement and enthusiasm regarding the day was contagious. Darcy had barely emerged from the shower when Penny arrived with a surprisingly complicated costume. “Naturally, it’s the real thing, corset, pantalettes, hoop, chemise…it’s a little hot, being summer, but not so bad. We’re going to have a breeze. Of course, in a way, that’s bad. There will be black powder everywhere, but it’s great, really, because you get the true essence of how horrible battle was and just what the poor men faced. It will be great. Now, the chemise goes on first, corset over that, then the dress. It’s not an elegant evening gown, but a typical day dress. Nice one, and it will look great on you. Deep blue. It will do wonders for your hair.”\n “Thanks, Penny,” Darcy said, and she meant it until Penny tried to tie her too tightly into the corset.\n “It’s how they really wore them!” Penny told her.\n “Hey, that was then, this is now. I’m not passing out on the battlefield, okay, please?”\n With a sigh, Penny eased her hold on the ribbons. “Lavinia will let you tie her up until she’s just about dead.”\n “I’ll just bet she looks great then,” Darcy said. “I want to breathe through the show.”\n When she went downstairs, she discovered that Matt had already headed out—as a last-minute participant, he had to fill in his registration papers for insurance purposes. But Carter and Clint were waiting for her.\n “Wow!” Clint told her. “It’s a look—it’s a look!”\n “The best that money can buy, huh?” Carter teased.\n They were alone with Penny in the foyer. “Is Lavinia coming with us?”\n “Lavinia, ride? Are you kidding? Adam is driving her down the road to the field. We’ll go the way we came back yesterday.”\n “Great,” Darcy said. She felt a cold nose touch her hand. Oola. She stroked the dog and looked at the two men. “Can she come?”\n “Sure,” Carter said with a shrug.\n “Maybe we should leave her in the house,” Clint said. “All the commotion out there…she may not be used to it,” Clint said.\n “There will be all kinds of dogs around. People bring their pets,” Carter said.\n “I guess you’re right. All right, Oola. Let’s see what kind of a cavalry dog you’ll make. Of course, you won’t really be riding with the cavalry,” Clint said. “We’ll set you up with Penny, Lavinia, and Adam, and whoever else is around, during the battle.”\n “Sounds good,” she said.\n When they arrived at the field, they could see it was already crawling with people. Darcy was startled when the three of them were asked to stop a dozen times for tourists to take pictures.\n Carter grinned at her. “See, you look great.”\n “Thanks. I’m glad I make a good camp follower.”\n “The dress is too good,” Clint said. “You get to be my wife today.”\n “Your wife? Why not mine?” Carter argued.\n Darcy could see that most of the people were arranged behind a makeshift fence. There were officers in sheriff’s department uniforms patrolling the lines, while those in Civil War attire were on the other side of the fence. “Where’s Matt?”\n “With his company, probably,” Carter said. “We’ll find them later. We’ll position you back here—you can see better.”\n “Where will Adam and the others be?” Darcy asked.\n “If they get here soon enough, we’ll bring ’em back with you,” Carter said. “If not, they’re going to have to join the rest of the tourists.” He tipped his hat to her, then dismounted to offer her a hand down. “We’ll tether Nellie right here. Don’t you love that—a perfect historical image, until you see the hotdog stand!”\n “Ah, well, progress, what can you do?” Darcy sympathized.\n “I have to go down on the first volley,” Clint told her, “so I’ll get back to you as soon as I can reasonably crawl, noble and injured, off the field.”\n “You get to go down with the first volley?” Carter asked him as they rode off.\n Darcy grinned, and was then surprised when a Robert E. Lee look-alike rode out to the center of the field on a beautiful white horse, dismounted, and lifted a megaphone to speak. He introduced the day of the battle, the circumstances that brought about the skirmish. Yankee troops, cut off, were trying to wind their way back to Meade, while the Southern troops were riding to catch up with Lee before the battle at Sharpsburg. A militia troop had recently held up a Northern baggage train, and, realizing they had a small force of the enemy in their sights, decided to turn the stolen guns against their enemy. It had been a bitter day of fighting, some of it house-to-house, but the majority of the action had taken place here, when the guns had sent the tattered Northerners fleeing. And yet it had not been a victory for either side as far too many lives had been lost.\n When he finished speaking, he gave a flourish of his hat, mounted his white horse, and left the field in a flurry of hooves and dirt. The moment he was gone, the first cannon sounded. The battle commenced.\n Darcy was spellbound. She had never imagined what such a battle must have been like. Within minutes, the powder produced by the cannons and guns filled the air. Officers roared out commands from both sides of the field. The cavalry came in first, and it was an incredible show, horses rearing, swords flying. Men advanced, went down, retreated.\n She saw Matt, riding with his sword swirling in the black-misted air, all but standing in his saddle. A pang touched her heart.\n He disappeared into the field of black powder.\n Foot soldiers advanced behind the cavalry. From the hillock where Clint and Carter had left her, Darcy was in perfect position, and she was enthralled.\n Suddenly she felt an odd sense of real pain and nostalgia sweep over her. She closed her eyes, and the shouting seemed to change.\n She opened her eyes to true horror.\n There were twice as many men on the field. And there were no spectators. Broken, bleeding, riddled with bullets, soldiers in blue and in gray lay littering the field. A horse whinnied in terror and went down. Bullets flew hard and furious…she heard the whap of one as it struck the tree near her.\n Darcy had closed her eyes…and opened them to a vision of what had once been real. It was appalling, horrifying. Northern soldiers and Southern soldiers, praying to the same God, dying…praying that they headed for the same heaven. For a moment, the image, and the pain it awakened, was almost unbearable.\n At her side, she heard a whining sound. She shook her head and blinked.\n And she was drawn back to the present.\n She heard the crowd yelling in appreciation. Oola pawed her, huge brown eyes wide with distress as they fell upon Darcy.\n “It’s okay, girl,” she said, hugging the dog. “I’m back.”\n Suddenly, Oola barked excitedly. Darcy looked back to see a soldier emerging from the powder that now seemed to blanket the entire scene.\n “Darcy?”\n “Clint!”\n She rose, dusting her hands on her skirt. “That was truly magnificent. So sad, of course, but it’s true, the reenactment really makes you appreciate what it must have been like.”\n He grinned at her. “Hey, Matt is off the field, too. Let’s mount up, and we’ll find him.”\n “Where’s your horse?”\n Clint sighed. “I told you, I had to go down at the first volley. My horse is with the Yankees now.” He grinned. “We’ll get him back later. My buddy, Aaron Swenson got to capture him. I’ll hop up with you on Nellie for now, if it’s all right.”\n “Of course, it’s all right,” Darcy said.\n She mounted first. Clint leapt up ably behind her. Oola stared at them, barking furiously.\n “Oola, what is the matter with you?” Darcy said. “Clint, which way?”\n “That way,” he said, and pointed ahead.\n “Are you sure? Isn’t that back toward the house, through the fields?”\n “You’re disoriented, Darcy. It’s the powder. Trust me, I know where I’m going.”\n He’d had a hell of a good time, Matt had to admit. Riding off the field in triumph, laughing with James Arnold, head of one of the Union companies, he congratulated his friend on the excellent fake sword fight they had waged, and their speed and prowess in getting off the field.\n “Hey, Matt, never give it up!” James told him, giving him a thumbs-up sign as they left the field.\n Matt nodded and grinned, then realized that his cell phone was ringing.\n “Hey, did you guys have those back then?” James teased.\n “Hell, no. We’d have won the war if we’d had ’em,” Matt said. “Sheriffs have to carry them,” he said in something of an apology.\n He urged his horse a distance from the field as he punched in to answer.\n “Hello? Matt Stone.”\n “Matt! Jesus! I’ve been trying to get you for hours.”\n “Randy?” Matt said, his muscles tensing instantly at his friend’s tone. “You found the bones?”\n “No, but I found something else.”\n “What?”\n “You know you asked me about missing persons?”\n “Yep.”\n “There are at least five women last seen in or around your area who’ve been reported missing.”\n A strange freeze settled over Matt.\n “I can change and get right up there.”\n “No need. I can fax you this stuff. But get this—none of them were really from the area. Just passing through. But this one, Susan Howell, twenty-six, five-five, one-hundred-twenty pounds. Professional girl, no family, last seen at the gas station right by the highway exit to Stoneyville. Here’s another. Catherine Angsley, last seen at the drugstore on the town line. She came from Stamford, Connecticut, folks deceased, another professional, a biochemist, made good money, and was reported missing months after that incident by a grandmother, who has since passed away. Then there’s—” \n","sourceLink":"https://allnovel.net/haunted-harrison-investigation-1/page-60.html","bookId":2267,"book":{"id":2267,"title":"Haunted (Harrison Investigation #1)","description":"Storyline: \n Haunted (Harrison Investigation #1) \n Love is everywhere. . . \n When does a gift become a curse? \n Matt Stone doesn\u0027t believe in ghosts. But there are those who are convinced his home, a historic Virginia estate that dates back to the Revolutionary War, is haunted. Pressured to get at the truth about some strange happenings at Melody House, he agrees to let Harrison Investigations explore the house. But he isn\u0027t ready for beautiful, intriguing Darcy Tremayne. \n As a paranormal investigator, Darcy has learned to believe in the unbelievable. And she\u0027s given Matt fair warning: sometimes people don\u0027t like the skeletons she finds. She never dreamed that the warning would apply to herself. For she\u0027s about to discover that Melody House holds much more than a simple mystery form the distant past. What it holds is a very real and lethal danger, one that will cast her into a struggle against the worlds of both the living and the dead.\n \n","cover":"https://allnovel.net/images/haunted-harrison-investigation-1.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/haunted-harrison-investigation-1.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:23:31 PM"}}
