{"id":87831,"no":8,"title":"Page 8","content":"\\n\\n “I see,” interrupted Chisel-face. “You’re here to investigate some of the eerie stories associated with the house, but you’re not trying to cash in on ghosts?” His voice was deep, the words were evenly spoken; somehow, they still dripped scorn.\\n\\n “No. I’ve just explained. We’re investigators.”\\n\\n “Um,” Chisel-face murmured. He stared at her hard. “You said that most of the time what you discovered was creaky floorboards or leaky plumping. What happens when it’s not ‘most of the time’?”\\n\\n “We do our best to right matters,” she said, wishing that she’d never gotten into the conversation.\\n\\n “And how do you do that? Without, of course, making a bid to fascinate people—or cash in on the ghosts.”\\n\\n She hesitated. She didn’t really need to be having this conversation with a skeptic; she was looking for Matt Stone. But they were indeed in a small town. And Adam had suggested that she do her best to get along with the locals. In such a place, they were usually full of information, and could be very helpful. She shrugged. Adam wanted it; she could try to be social.\\n\\n “Some ghosts are actually a part of history, and it’s the history that creates the legends that make them so fascinating to people. Some home owners and even corporations—especially those with places as significant as Melody House—want to have a resident ghost rapping on walls now and then to attract their clientele. Watch television, and you’ll know that there’s a huge population out there interested in being frightened. What we do is find out first if there actually is any inexplicable phenomena—or if someone is merely playing games. If there is something beyond the ordinary, we find out why, and deal with it from that point,” Darcy said, staring at the man, and returning all the attitude she was being given. Adam Harrison had already spoken with Matt Stone, and apparently, done so with enough dignity that he had agreed to the meeting. Actually, Stone had called Adam, after receiving his letter. And whether or not Stone wanted his property turned into a national center for the occult, he apparently could use the exorbitant fee that Adam had been willing to pay for his team to investigate the stories circulating about the house. She knew historic mansions were incredibly hard to maintain. Especially when they were being held privately. She was suddenly angry with herself for having been intimidated by the good old boys in the bar. Hell. She’d spent enough years in a very similar environment, and that should have prepared her to deal with any form of male that pretended to walk on two feet. She had also dealt with her fair share of total, mocking skeptics. Usually, no manner of behavior bothered her. She had her beliefs, and everyone else in the world was welcome to their own. People who really wanted help usually came and asked for it.\\n\\n She’d been social enough, she decided.\\n\\n “Excuse me, gentlemen, but my employer has already been in contact with Mr. Stone, and apparently, he is willing to allow us into Melody House. I’ll make arrangements to meet him at a later date.”\\n\\n “I know you,” Dimple-face said suddenly. He offered her his lazy smile once again. “I could swear I’ve seen your face before.”\\n\\n Darcy hesitated. All she needed to do was tell this pack that she’d been a model for a cosmetics company for several years during and right after college and they’d never take her seriously. But then again, what the hell did she care? Her business was with Stone.\\n\\n “I’m sure we’ve never met,” she murmured politely. “Thank you for your time. And excuse me.”\\n\\n “’Original Sin’!” Dimple-face said triumphantly. He grinned sheepishly. “I wound up buying the men’s aftershave. Your face has been on billboards all over the country.”\\n\\n Even in Hicksville? she was tempted to say, and then she was angry with herself, because she’d never felt that way about anything or anyone, her parents being really wonderful people who had taught her continually that people were people, didn’t matter where they came from, and everyone in any corner of the country or even on the earth deserved an open mind and respect.\\n\\n “So…you’re a model.”\\n\\n Chisel-face’s statement might as well have been, So you’re a dumb blonde with boobs. Except that she was more of a redhead and certainly not overly-stacked.\\n\\n “I worked for Original Sins cosmetics, yes,” she said, again forcing her tone to be even. “I also have graduate degrees in American history and sociology from NYU.”\\n\\n “I heard that Adam Harrison would be coming here himself,” Chisel-face said.\\n\\n Darcy gritted her teeth. “Yes, Mr. Harrison will come down at some time during the investigation. He’s been delayed. At the moment, he is tied up with business in London.” She stopped, irritated that she’d felt herself obliged to explain anything to these men.\\n\\n She was about to rise when the fourth member of the party—the man with the decent haircut and store-bought clothing suddenly leaned forward, extending a hand to her. “Sorry, we should have introduced ourselves, especially me, right away. I’m David Jenner, Jenner Equipment—and someone from your office approached me about renting some recording and video equipment.” He shrugged, flashing a glance across the table. “Should the project go forward.”\\n\\n “David, nice to meet you,” she said. “Justin, our office manager, told me that he had talked to you.”\\n\\n “You don’t have your own equipment?” Chisel-face asked.\\n\\n “Of course, we have some very specialized equipment,” Darcy forced herself to say politely. “But we like to rent video cameras and tape recorders from local facilities. That keeps anyone from suggesting that we’ve rigged anything. Mr. Stone knows how we work and what we do—he was sent information on the company.”\\n\\n Chisel-face inclined his head, and she wished that the idiot wasn’t wearing sunglasses in the middle of a smoky bar. “It’s good to hear that you think local facilities might offer you enough—you know, equipment up to the par of your…investigative techniques.”\\n\\n “We’ve worked across the country—and abroad,” she said coolly, “and we have always maintained excellent work relationships in every area.”\\n\\n “That sounds mighty fine!”\\n\\n Darcy was startled when the voice came from behind her. She turned to see that the pool player who had been called Carter had come up behind her. He was taller than she had realized; she was fairly tall herself at five nine, and in her heels, she had another two inches. He wore a beard and mustache, and had intense green eyes. And beneath his worn flannel shirt, he seemed to be in exceptional condition. She did, however, feel as if she had completely stepped back in time. Put a uniform on him, and he might have been the cavalry general Jeb Stuart, having stepped off his horse and into the local tavern. He stared at her with a strange sincerity as he spoke. “Too many times, Yankees have come down South and thought themselves like almighty gods. But, hey, you know, this just might be the right one. Ms. Tremayne, I’ve seen your face all over on billboards, too. You just may be the one.”\\n\\n “Thanks,” she murmured. Yankees had come south? She’d done a lot of traveling, but she’d never felt a time warp such as this before. “You know,” she said quietly, “my company isn’t really headquartered more than two hours away.”\\n\\n “A popular face,” Chisel-face murmured. “Forgive me—it just seems so strange. A model. Hm. Maybe they sent you down to manipulate Matt Stone. Not a bad idea? I mean, could you possibly really be the business end of this deal? You are an exceptionally fine-looking Yank—even with a packet of degrees from NYU.”\\n\\n Darcy felt fury suddenly take root in every limb of her body. Get along with the locals! Like hell! She’d had it. Everything she’d learned in college, in business, and in life, fled her mind, and her temper kicked in.\\n\\n “It’s an excellent school,” she said, rising. “And I’m afraid, gentlemen, that the rest of the world has entered the twenty-first century. The Civil War was lost during the nineteenth. We’re all one big country now, you might recall. Washington D.C.—where I’m based—is extremely close. Busy. The world goes on there.”\\n\\n “D.C.,” Chisel-face murmured, then grinned at his fellows. “I’ll bet the old boys considered it just one and the same as this area, eh boys?”\\n\\n She rose, hands planted firmly down on the table, and assessed him coolly. Words seemed to spit from her before she took the time to think them out. “You know, I did forget to return your rather backward compliment. Actually, you’re not too bad-looking for a total asshole. You really will excuse me. In truth, none of this, me, my credentials, my job here—is any of your business. I need to discuss matters with Mr. Stone, and no one else.” She allowed her gaze to sweep with disdain over the lot of them and she turned and walked with crisply clicking heels to the door, where she turned back. “By the way, just for your information, the South lost the war. If any of you happen to see Mr. Stone, perhaps you’ll be good enough to let him know that I did come to meet him. I’ll be calling.”\\n\\n As she stared at the men, they rose, staring back at her. The most friendly of them, Dimple-face, began to smile.\\n\\n “What?” she demanded.\\n\\n “Oh,” he said, “I think Matt Stone definitely knows you were here.”\\n\\n “Really?” she grated. “And why is that.”\\n\\n Chisel-face spoke up. “Ms. Tremayne, I am Matt Stone.”\\n\\n Adam Harrison would have handled it all much better. He would have found a way to be both dignified and smooth. But of course, if Adam had felt that he’d cast himself into a den of testosterone, he would have had managed to gain respect immediately, no matter what.\\n\\n Darcy couldn’t quite diffuse the steam rising in her.\\n\\n “Well, I’m sorry that I can’t say it’s been a pleasure, since you’ve done nothing but amuse yourself at my expense, Mr. Stone. And if you destroy this opportunity, it won’t hurt me in the least. My employer is the man who deems your house important.” \\n\\n","sourceLink":"https://allnovel.net/haunted-harrison-investigation-1/page-8.html","bookId":2267,"book":{"id":2267,"title":"Haunted (Harrison Investigation #1)","description":"Storyline: Haunted (Harrison Investigation #1) \\n Love is everywhere. . . \\n When does a gift become a curse? \\n Matt Stone doesn\u0027t believe in ghosts. But there are those who are convinced his home, a historic Virginia estate that dates back to the Revolutionary War, is haunted. Pressured to get at the truth about some strange happenings at Melody House, he agrees to let Harrison Investigations explore the house. But he isn\u0027t ready for beautiful, intriguing Darcy Tremayne. \\n As a paranormal investigator, Darcy has learned to believe in the unbelievable. And she\u0027s given Matt fair warning: sometimes people don\u0027t like the skeletons she finds. She never dreamed that the warning would apply to herself. For she\u0027s about to discover that Melody House holds much more than a simple mystery form the distant past. What it holds is a very real and lethal danger, one that will cast her into a struggle against the worlds of both the living and the dead.\\n","cover":"https://allnovel.net/images/haunted-harrison-investigation-1.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/haunted-harrison-investigation-1.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:23:31 PM"}}
