{"id":23259,"no":19,"title":"CHAPTER XVIII. WALTER FINDS HIMSELF IN HOT WATER.","content":"Two days later two women entered Mr. Drummond\u0027s store. One was Joshua\u0027s customer, and she wore the same shawl which she had purchased of him. It happened that Walter was out, but Mr. Drummond and Nichols were both behind the counter. \"Have you got any more shawls like this?\" asked the first lady, whom we will call Mrs. Blake. \"Mrs. Spicer, who is a neighbor of mine, liked it so well that she wants to get another just like it.\" This was addressed to Mr. Drummond, who happened to be nearest the door. \"Did you buy this shawl of us?\" asked Mr. Drummond. \"Yes, sir. I bought it about a fortnight ago, and paid five dollars for it.\" \"Five dollars! There must be some mistake.[Pg 166] We never sell such a shawl as that for less than ten dollars.\" \"I can\u0027t help it,\" said Mrs. Blake, positively. \"I bought it here, and paid five dollars for it.\" \"Why, those shawls cost me seven dollars and a half at wholesale. It is not likely I would sell them for five.\" \"I didn\u0027t buy it of you.\" \"Mr. Nichols,\" said Mr. Drummond, \"did you sell this lady the shawl she is wearing, for five dollars?\" \"No, sir; have not sold a shawl like that for two months. I know the price well enough, and I wouldn\u0027t sell it for less than ten dollars.\" \"I didn\u0027t buy it of him, I bought it of a boy,\" said Mrs. Blake. \"It must have been that stupid Conrad,\" exclaimed Mr. Drummond, angrily. \"Wait till he comes in, and I\u0027ll haul him over the coals.\" \"Then you won\u0027t let my friend have another like it for five dollars?\" \"No,\" said Mr. Drummond, provoked. \"I don\u0027t do business that way. I\u0027ve lost nearly three dollars[Pg 167] by that shawl of yours. You ought to make up the wholesale price to me.\" \"I shan\u0027t do it,\" said Mrs. Blake. \"If you\u0027ve made a mistake, it\u0027s your lookout. I wasn\u0027t willing to pay more than five dollars.\" The two ladies were about to leave the store when Mr. Drummond said, \"The boy will be back directly. I wish you would wait a few minutes, so that if he denies it you can prove it upon him.\" \"I\u0027ve got a call to make,\" said Mrs. Blake, \"but I\u0027ll come in again in about an hour.\" They left the store, and Mr. Drummond began to berate the absent Walter. He was provoked to find that he had lost two dollars and a half, and, if Walter had been in receipt of any wages, would have stopped the amount out of his salary. But, unfortunately for this plan of reprisal, our hero received his board only, and that could not very well be levied upon. However, he might have some money in his possession, and Mr. Drummond decided to require him to make up the loss. \"When did she say she bought the shawl, Mr. Nichols?\" asked his employer. [Pg 168] \"About a fortnight ago.\" \"Will you look on the books, and see if you find the sale recorded? I am surprised that it escaped my attention.\" Nichols looked over the book of sales, and announced that no such entry could be found. Mr. Drummond was surprised. Though not inclined to judge others any too charitably, he had never suspected Walter of dishonesty. \"Are you sure you looked back far enough?\" he asked. \"Yes,\" said Nichols; \"to make sure, I looked back four weeks. The woman said only a fortnight, you know.\" \"I know. Then it seems Conrad has concealed the sale and kept the money.\" \"Perhaps,\" suggested Nichols, who rather liked Walter, \"he forgot to put it down.\" \"If he did, he forgot to put the money in the drawer, for the cash and the sales have always balanced. He\u0027s an ungrateful young rascal,\" continued Mr. Drummond, harshly. \"After I took him into my house and treated him as a son (this was not[Pg 169] saying much, if Joshua may be believed), he has robbed me in the most cold-blooded manner.\" Why there should be anything cold-blooded in appropriating the price of the shawl, even had the charge been true, I cannot say, nor could Mr. Drummond probably, but he thought that the use of this term would make the offence seem more aggravated. Even Nichols was a little staggered by the evidence against our hero. He did not like to think him guilty, but it certainly seemed as if he must be. \"What are you going to do about it, Mr. Drummond?\" he asked. \"I suppose I ought to have him arrested. He deserves it.\" \"I hope you won\u0027t do that. He may be able to explain it.\" \"If I do not proceed to extremities, it will be on account of his relationship, which I blush to acknowledge.\" The time had been, and that not long since, when Mr. Drummond felt proud of his relationship to the rich Squire Conrad of Willoughby; but that was before his loss of property. Circumstances alter cases. [Pg 170] Quite unconscious of the storm that was gathering, Walter at this moment entered the store. \"So you\u0027ve got back!\" said Mr. Drummond, harshly. \"Yes, sir.\" \"You haven\u0027t been in any particular hurry. However, that was not what I wished to speak to you about. We have made a discovery since you went out.\" \"Have you, sir?\" asked Walter, rather surprised by the peculiar tone which Mr. Drummond saw fit to adopt. \"Yes, and not a very agreeable one.\" \"I am sorry for that,\" said Walter, not knowing what else was expected of him. \"No doubt you are sorry,\" sneered Mr. Drummond. \"I should think he would be, eh, Mr. Nichols?\" \"I am sorry also,\" said Nichols, who, though rather weak-minded, was a good-hearted young man. \"So am I sorry,\" said Mr. Drummond. \"It strikes me I have most reason to be sorry, considering that the loss has fallen on me.\" All this was an enigma to Walter, and he had not[Pg 171] the faintest idea of what his employer meant. He inferred, however, that some blame was about to be laid upon him. \"If you have no objection, Mr. Drummond,\" he said quietly, \"perhaps you will tell me what has happened.\" \"I have found out your ingratitude, Conrad,\" said Mr. Drummond, preparing for a lecture, which he rather liked to indulge in, as his wife could have testified. \"I have discovered how like a viper you have repaid me for my kindness. You didn\u0027t think I would find out, but your iniquity has providentially come to light. While I was loading you with benefits, you prepared to sting the hand of your benefactor.\" \"I don\u0027t know what you are talking about, Mr. Drummond,\" said Walter, impatiently. \"I wish you would stop talking in riddles, and let me know in what way I resemble a viper.\" \"Did you ever witness such brazen effrontery, Mr. Nichols?\" demanded Mr. Drummond, turning to his head salesman; \"even when he is found out, he brazens it out.\" [Pg 172] \"Wouldn\u0027t it be as well to tell him what is the matter, Mr. Drummond?\" asked Nichols, who was in hopes our hero would be able to prove his innocence. \"Won\u0027t you tell me, Mr. Nichols?\" asked Walter. \"No,\" said Mr. Drummond, waving his hand; \"it is my duty to tell him myself. I will do so briefly. Walter Conrad, when I admitted you into my house I little dreamed that I was harboring a thief.\" \"A thief!\" exclaimed Walter, his eyes flashing with anger, and elevating his fist involuntarily. \"Who dares to call me a thief?\" \"No violence, Conrad,\" said Mr. Drummond. \"Such a theatrical display of indignation and surprise won\u0027t help you any. We are not to be imposed upon by your artful demonstrations.\" \"Mr. Drummond,\" burst forth Walter, fairly aroused, \"you are insulting me by every word you speak. I am no more a thief than you are.\" \"Do you call me a thief?\" exclaimed Mr. Drummond, turning white about the lips. \"No, I don\u0027t; but I have as much right to call you one as you have to charge such a thing upon me.\" [Pg 173] \"I can prove what I say,\" said his employer. \"I have got you in a net.\" \"It won\u0027t take me long to get out of any net you may set for me. I insist upon your telling me at once what you mean.\" \"This language is rather extraordinary for a boy convicted of dishonesty to use towards his employer.\" \"I am not convicted of dishonesty. Mr. Nichols, I appeal to you to tell me, what Mr. Drummond does not seem disposed to do, what is the meaning of this false charge which he has trumped up against me.\" \"I am sure you can prove your innocence, Conrad,\" said Nichols, soothingly. \"Mr. Nichols, will you do me the favor to be silent?\" said his employer, sharply. \"The matter concerns Conrad and myself, and I don\u0027t choose that any one should communicate with him except myself. To come to the point, did you, or did you not, a fortnight since, sell one of those shawls, such as you see on the counter, for five dollars?\" \"I did not,\" said Walter, promptly. \"It might not have been exactly a fortnight. Have you sold such a shawl within four weeks?\" \"I have not sold such a shawl since I have been in your employ, Mr. Drummond.\" \"You hear what he says, Mr. Nichols,\" said Mr. Drummond. \"You see how he adds falsehood to dishonesty. But that is not uncommon. It is only what I expected. Do you mean to say, Walter Conrad, that you didn\u0027t sell such a shawl for five dollars (only half price), and, instead of entering the sale, put the money into your own pocket?\" \"I do deny it most emphatically, Mr. Drummond,\" said Walter, impetuously, \"and I challenge you to prove it.\"","sourceLink":"http://novel.tingroom.com/ertong/3005/82942.html","bookId":296,"book":{"id":296,"title":"Strong and Steady Or, Paddle Your Own Canoe","description":"简介： It\u0027s ever so much better than my roomtwice as big, to begin with. Then, my carpet looks as if it had come down through several generations. I\u0027ll bet the old lady had it when she was first married. As for a mirror, I\u0027ve got a seven-by-nine looking-gla...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3005","creation":"Aug 1, 2019 12:18:31 AM","modification":"Aug 1, 2019 12:18:31 AM"}}
