{"id":23277,"no":37,"title":"CHAPTER XXXVI. JOSHUA BIDS GOOD-BY TO STAPLETON.","content":"Leaving Walter busily engaged in selling books, we will glance at the Drummond household, and inquire how the members of that interesting family fared after Walter\u0027s departure. Joshua\u0027s discontent increased daily. He was now eighteen, and his father absolutely refused to increase his allowance of twenty-five cents a week, which was certainly ridiculously small for a boy of his age. \"If you want money you must work for it,\" he said. \"How much will you give me if I will go into your store?\" asked Joshua. \"Fifty cents a week and your board.\" \"I get my board now.\" \"You don\u0027t earn it.\" \"I don\u0027t see why I need to,\" said Joshua. \"Aint you a rich man?\" [Pg 346] \"No, I\u0027m not,\" said his father; \"and if I were I am not going to waste my hard-earned money on supporting you extravagantly.\" \"There\u0027s no danger of that,\" sneered Joshua, \"We live meaner than any family in town.\" \"You needn\u0027t find fault with your victuals, as long as you get them free,\" retorted his father. \"If you\u0027ll give me two dollars a week, I\u0027ll come into the store.\" \"Two dollars!\" exclaimed Mr. Drummond. \"Are you crazy?\" \"You think as much of a cent as most people do of a dollar,\" said Joshua, bitterly. \"Two dollars isn\u0027t much for the son of a rich man.\" \"I have already told you that I am not rich.\" \"You can\u0027t help being rich,\" said Joshua, \"for you don\u0027t spend any money.\" \"I\u0027ve heard enough of your impudence,\" said his father, angrily. \"If you can get more wages than I offer you, you are at liberty to engage anywhere else.\" \"Tom Burton gets a dollar and a quarter a day for[Pg 347] pegging shoes,\" said Joshua. \"He dresses twice as well as I do.\" \"He has to pay his board out of it.\" \"He only pays three dollars a week, and that leaves him four dollars and a half clear.\" \"So you consider Tom Burton better off than you are?\" \"Yes.\" \"Then I\u0027ll make you an offer. I\u0027ll get you a place in a shoe-shop, and let you have all you earn over and above three dollars a week, which you can pay for your board.\" Joshua seemed by no means pleased with this proposal. \"I\u0027m not going to work in a shoe-shop,\" he said, sullenly. \"Why not?\" \"It\u0027s a dirty business.\" \"Yet you were envying Tom Burton just now.\" \"It\u0027ll do well enough for him. He\u0027s a poor man\u0027s son.\" \"So was I a poor man\u0027s son. I had to work when I was a boy, and that\u0027s the way I earned all I have.[Pg 348] Not that I am rich,\" added Mr. Drummond, cautiously, for he was afraid the knowledge of his wealth would tempt his family to expect a more lavish expenditure, and this would not by any means suit him. \"You didn\u0027t work in a shoe-shop.\" \"I should have been glad of the chance to do it, for I could have earned more money that way than by being errand-boy in a store. It\u0027s just as honorable to work in a shop as to be clerk in a store.\" Though we are not partial to Mr. Drummond, he was undoubtedly correct in this opinion, and it would be well if boys would get over their prejudice against trades, which, on the whole, offer more assured prospects of ultimate prosperity than the crowded city and country stores. This conversation was not particularly satisfactory to Joshua. As he now received his board and twenty-five cents a week, he did not care to enter his father\u0027s store for only twenty-five cents a week more. Probably it would have been wiser for Mr. Drummond to grant his request, and pay him two dollars a week. With this inducement Joshua might have[Pg 349] formed habits of industry. He would, at all events, have been kept out of mischief, and it would have done him good to earn his living by hard work. Mr. Drummond\u0027s policy of mortifying his pride by doling out a weekly pittance so small that it kept him in a state of perpetual discontent was far from wise. Most boys appreciate considerable liberality, and naturally expect to be treated better as they grow older. Joshua, now nearly nineteen, found himself treated like a boy of twelve, and he resented it. It set him speculating about his father\u0027s death, which would leave him master, as he hoped, of the \"old man\u0027s\" savings. It is unfortunate when such a state of feeling comes to exist between a father and a son. The time came, and that speedily, when Mr. Drummond bitterly repented that he had not made some concessions to Joshua. Finding his father obstinate, Joshua took refuge at first in sullenness, and for several days sat at the table without speaking a word to his father, excepting when absolutely obliged to do so. Mr. Drummond, however, was not a sensitive man, and troubled himself very little about Joshua\u0027s moods. [Pg 350] \"He\u0027ll get over it after a while,\" he said to himself. \"If he\u0027d rather hold his tongue, I don\u0027t care.\" Next Joshua began to consider whether there was any way in which to help himself. \"If I only had a hundred dollars,\" he thought, \"I\u0027d go to New York, and see if I couldn\u0027t get a place in a store.\" That, he reflected, would be much better and more agreeable than being in a country store. He would be his own master, and would be able to put on airs of importance whenever he came home on a vacation. But his father would give him no help in securing such a position, and he could not go to the city without money. As for a hundred dollars, it might as well be a million, so far as he had any chance of securing it. While he was thinking this matter over, a dangerous thought entered his mind. His father, he knew, had a small brass-nailed trunk, in which he kept his money and securities. He had seen him going to it more than once. [Pg 351] \"I wonder how much he\u0027s got in it?\" thought Joshua. \"As it\u0027s all coming to me some day there\u0027s no harm in my knowing.\" There seemed little chance of finding out, however. The trunk was always locked, and Mr. Drummond carried the key about with him in his pocket. If he had been a careless man, there might have been some chance of his some day leaving the trunk unlocked, or mislaying the key; but in money matters Mr. Drummond was never careless. Joshua would have been obliged to wait years, if he had depended upon this contingency. One day, however, Joshua found in the road a bunch of keys of various sizes attached to a ring. He cared very little to whom they belonged, but it flashed upon him at once that one of these keys might fit his father\u0027s strong-box. He hurried home at once with his treasure, and ran upstairs breathless with excitement. He knew where the trunk was kept. Mr. Drummond, relying on the security of the lock, kept it in the closet of his bed-chamber. [Pg 352] \"Where are you going, Joshua?\" asked his mother. \"Upstairs, to change my clothes,\" was the answer. \"I\u0027ve got a piece of pie for you.\" \"I\u0027ll come down in five minutes.\" Joshua made his way at once to the closet, and, entering, began to try his keys, one after the other. The very last one was successful in opening the trunk. Joshua trembled with excitement as he saw the contents of the trunk laid open to his gaze. He turned over the papers nervously, hoping to come upon some rolls of bills. In one corner he found fifty dollars in gold pieces. Besides these, there were some mortgages, in which he felt little interest. But among the contents of the trunk were some folded papers which he recognized at once as United States Bonds. Opening one of them, he found it to be a Five-Twenty Bond for five hundred dollars. Five hundred dollars! What could he not do with five hundred dollars! He could go to the city, and board, enjoying himself meanwhile, till he could find a place. His galling dependence would be over, and[Pg 353] he would be his own master. True it would be a theft, but Joshua had an excuse ready. \"It will all be mine some day,\" he said to himself. \"It\u0027s only taking a part of my own in advance.\" He seized the gold and the bond, and, hastily concealing both in his breast-pocket, went downstairs, first locking the trunk, and putting it away where he found it. \"What\u0027s the matter, Joshua?\" asked his mother, struck by his nervous and excited manner. \"Nothing,\" he answered, shortly. \"Are you well?\" \"I\u0027ve got a little headache,—that is all.\" \"Perhaps you\u0027d better not eat anything then.\" \"It won\u0027t do me any harm. I\u0027ll take a cup of tea, if you\u0027ve got any.\" \"I can make some in five minutes.\" Joshua ate his lunch, and, going upstairs again, came down speedily, arrayed in his best clothes. He got out of the house without his mother seeing him, and made his way to a railway station four[Pg 354] miles distant, where he purchased a ticket for New York. He took a seat by a window, and, as the car began to move, he said to himself, in exultation, \"Now I am going to see life.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/3005/82960.html","bookId":296,"book":{"id":296,"title":"Strong and Steady Or, Paddle Your Own Canoe","description":"简介： It\u0027s ever so much better than my roomtwice as big, to begin with. Then, my carpet looks as if it had come down through several generations. I\u0027ll bet the old lady had it when she was first married. As for a mirror, I\u0027ve got a seven-by-nine looking-gla...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3005","creation":"Aug 1, 2019 12:18:31 AM","modification":"Aug 1, 2019 12:18:31 AM"}}
