{"id":23245,"no":5,"title":"CHAPTER IV. JACOB DRUMMOND, OF STAPLETON.","content":"Jacob Drummond kept a dry-goods store in the village of Stapleton. As the village was of considerable size, and he had no competitors, he drove a flourishing trade, and had already acquired quite a comfortable property. In fact, even had he been less favorably situated, he was pretty sure to thrive. He knew how to save money better, even, than to earn it, being considered, and with justice, a very mean man. He carried his meanness not only into his business, but into his household, and there was not a poor mechanic in Stapleton, and scarcely a poor laborer, who did not live better than Mr. Drummond, who was the rich man of the place. No one, to look at Jacob Drummond, would have been likely to mistake his character. All the lines of his face, the expression of his thin lips, his cold gray eyes, all bespoke his meanness. Poor Mrs.[Pg 34] Drummond, his wife, could have testified to it, had she dared; but in this house, at least, the husband was master, and she dared not express the opinions she secretly entertained of the man to whom she was bound for life. At five o\u0027clock on the afternoon of the day after Mr. Conrad\u0027s death, Mr. Drummond entered the house, which was on the opposite side of the street from the store. This was the supper hour, and supper was ready upon the table. A single glance was sufficient to show that Mr. Drummond was not a man to indulge in luxurious living. There was a plate of white bread, cut in thin slices, a small plate of butter, half a pie, and a plate of cake. A small pitcher of milk, a bowl of coarse brown sugar, and a pot of the cheapest kind of tea completed the preparations for the evening meal. Certainly there was nothing extravagant about these preparations; but Mr. Drummond thought otherwise. His attention was at once drawn to the cake, and instantly a frown gathered upon his face. [Pg 35] \"Are we going to have company to-night, Mrs. Drummond?\" he asked. \"Not that I know of,\" answered his wife, in some surprise. \"Then why is it that you have put both pie and cake on the table?\" \"There was only half a pie, Mr. Drummond,\" said she, nervously. \"Well, there are but three of us. You can get three good-sized pieces from half a pie. That will be one for each of us. What would you have more?\" \"The cake is a cheap kind.\" \"No cake is cheap, Mrs. Drummond. I take it you used eggs, butter, and sugar in making it.\" \"Yes, but—\" \"No buts, if you please, Mrs. Drummond. You are probably not aware that all these articles are very dear at present. Until they get lower we need not have cake, except when company is present.\" That being the case, Mr. Drummond was not likely to be put to much expense on this score. They seldom had company, and those who came once were not anxious to come again. For even on such[Pg 36] occasions Mr. Drummond could not forget his ruling principle. The overflowing hospitality which even in the humblest village households crowns the board with plenty when visitors are present, was never to be found there; and, besides, the visitors could not help having an uneasy suspicion that their host grudged them the niggardly entertainment he did provide. So for three years the Stapleton Sewing Circle had met but once at the Drummonds\u0027, and there was no immediate prospect of their meeting there for another three years. It may be supposed that Mr. Drummond was not fond of good eating. This, however, would be quite a mistake. When he dined or took tea out, he always did full justice to the different dainties which were provided, and quite seemed to enjoy them as long as they were furnished at the expense of another. \"Take away the cake, if you please, Mrs. Drummond,\" continued her husband. \"You can save it for Sunday evening.\" \"I am afraid it will be dried up by that time.\" \"If it is dry, you can steam it.\" \"That spoils cake.\" \"You seem very contrary to-night, Mrs. Drummond. I have continually to check you in your extravagant tastes. Cake and pie, indeed! If you had your way, you would double my household expenses.\" Mrs. Drummond rose from the table, and meekly removed the offending cake. Just then the third and only other member of the family entered. This was Joshua Drummond, the only son, now eighteen years of age, though he looked scarcely more than sixteen. He inherited his father\u0027s meanness, but not his frugality. He was more self-indulgent, and, though he grudged spending money for others, was perfectly ready to spend as much as he could get hold of for himself. \n \n","sourceLink":"http://novel.tingroom.com/ertong/3005/82928.html","bookId":296,"book":{"id":296,"title":"Strong and Steady Or, Paddle Your Own Canoe","description":"简介： It\u0027s ever so much better than my roomtwice as big, to begin with. Then, my carpet looks as if it had come down through several generations. I\u0027ll bet the old lady had it when she was first married. As for a mirror, I\u0027ve got a seven-by-nine looking-gla...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3005","creation":"Aug 1, 2019 12:18:31 AM","modification":"Aug 1, 2019 12:18:31 AM"}}
