{"id":23248,"no":8,"title":"CHAPTER VII. MR. DRUMMOND\u0027S HUMBLE ROOF.","content":"\"Mrs. Drummond,\" said her husband, \"young Mr. Conrad will be here by four o\u0027clock this afternoon. You will have a nice supper ready at five.\" \"Shall I have cake and pie both?\" inquired Mrs. Drummond, doubtfully. \"Certainly. Indeed, it may be as well to have two kinds of pie, say apple and pumpkin; and, as we have not had hot biscuit for some time, you may bake some.\" Mrs. Drummond looked at her husband as if she had doubts as to his sanity. Such a luxurious meal was quite unheard of in the Drummond household. \"Cake, two kinds of pie, and hot biscuit!\" she repeated. \"Yes,\" he replied. \"I am not in general in favor of such extra living, but it is well to pay some respect to the memory of my deceased kinsman in[Pg 59] the person of his son. Being the son of a rich man, he has been accustomed to rich living, and I wish him, on his advent into our family, to feel at home.\" Mrs. Drummond prepared to obey her husband\u0027s directions with alacrity. \"Joshua will get a good supper for once,\" she thought, thinking more of her son than of the stranger who was to enter the family. \"How surprised he will be to see such a variety on the table!\" Not that Joshua was strictly confined to the spare diet of his father\u0027s table. Through his mother\u0027s connivance there was generally an extra piece of pie or cake in the pantry laid aside for him. Had Mr. Drummond suspected this, he would have been very angry; but, being at the store the greater portion of the time, he was not aware of the extra indulgence. Mr. Drummond himself met Walter at the depot. \"I am delighted to welcome you to Stapleton, my young friend,\" he said, shaking his hand cordially. \"In the affliction which has come upon you, let me hope that you will find a haven of rest beneath my humble roof.\" \"I wonder why he always speaks of his \u0027humble[Pg 60] roof,\u0027\" thought Walter. \"Does he live in a shanty, I wonder?\" He made suitable acknowledgments, and proceeded to walk beside Mr. Drummond to the house which he termed humble. It did not deserve that name, being a substantial two-story house, rather ugly architecturally, but comfortable enough in appearance. \"That is my humble dwelling,\" said Mr. Drummond, pointing it out. \"It is not equal to the splendid mansion in which you have been accustomed to live, for my worldly circumstances differ widely from those of your late lamented parent; but I trust that in our humble way we shall be enabled to make you comfortable.\" \"Thank you, Mr. Drummond; I have no doubt of that. Your house looks very comfortable.\" \"Yes, it is plain and humble, but comfortable. We are plain people. We are not surrounded by the appliances of wealth, but we manage, in our humble way, to get through life. That is my son Joshua, who is looking out of the front window. I hope you[Pg 61] may become good friends, considering how nearly you are related.\" Walter raised his eyes, and saw Joshua, whose small, mean features, closely resembling his father\u0027s, expressed considerable curiosity. Walter secretly doubted whether he should like him; but this doubt he kept to himself. Mr. Drummond opened the outer door, and led the way in. \"This is my wife, Mrs. Drummond,\" he said, as she approached, and kindly welcomed the young stranger. \"I think I shall like her,\" thought Walter, suffering his glance to rest for a moment on her mild, placid features; \"she is evidently quite superior to her husband.\" \"Joshua, come here and welcome Mr. Conrad,\" said his father. Joshua came forward awkwardly, and held out his hand with the stiffness of a pump-handle. \"How dy do?\" he said. \"Just come?\" \"Yes,\" said Walter, accepting the hand, and shaking it slightly. [Pg 62] \"Are you tired with your journey, Mr. Conrad?\" asked Mrs. Drummond. \"Perhaps you would like to be shown to your room.\" \"Thank you,\" said Walter. \"I will go up for a few minutes.\" \"Where are you going to put our young friend, Mrs. Drummond?\" \"In the spare chamber.\" \"That is right. You will find some difference, Mr. Conrad, between our humble accommodations and the sumptuous elegance of your own home; but we will try and make it up by a hearty welcome.\" \"I wish he wouldn\u0027t use the word humble so much,\" thought Walter. Walter went upstairs, preceded by Mr. Drummond, who insisted on carrying his carpet-bag, for his trunk would not arrive till the next day, having been forwarded by express. \"I say, mother,\" remarked Joshua, \"the old man\u0027s awfully polite to this young fellow.\" \"You shouldn\u0027t speak of your father in that way, Joshua.\" \"Oh, what\u0027s the odds? He is an old man, isn\u0027t[Pg 63] he? I just wish he\u0027d be as polite to me. I say, I hope he\u0027ll like his boarding-place. What are you going to have for supper?\" \"Hot biscuit, cake, and two kinds of pie.\" \"Whew! won\u0027t the old man look like a thundercloud?\" \"That\u0027s what he told me to get. You do your father injustice, Joshua.\" Mrs. Drummond knew in her secret heart that her husband was intensely mean; but she was one of those who like to think as well as possible of every one, and was glad of an opportunity to prove that he could, on rare occasions, be more generous. \"Father\u0027s brain must be softening,\" said Joshua, after recovering in a measure from his astonishment. \"I hope it will be permanent. Isn\u0027t supper most ready?\" \"At five o\u0027clock, Joshua.\" \"This young chap\u0027s got a lot of money, I suppose, and the governor\u0027s after some of it. That explains the matter.\" \"I wish you wouldn\u0027t speak so disrespectfully of your father, Joshua.\" [Pg 64] \"I won\u0027t if he\u0027ll keep on as he\u0027s begun. I\u0027m glad this young Conrad has come to board here. I\u0027m going to get thick with him.\" \"He seems like a very nice boy,\" said Mrs. Drummond. \"I don\u0027t care what sort of a boy he is, as long as he\u0027s got the tin. I\u0027m going to make him treat.\" \"You must be considerate of his feelings, Joshua. Remember that he has just lost his father.\" \"Suppose he has, there\u0027s no need of looking glum about it.\" Had Jacob Drummond died, Joshua would have borne the loss with the greatest fortitude. Of that there was no doubt. Indeed, he would rather have hailed the event with joy, if, as he expressed it, the \"old man did the right thing,\" and left him the bulk of his property. Though such feelings did not do Joshua much credit, it must be said in extenuation that his father was far from being a man to inspire affection in any one, however nearly related. At five o\u0027clock they sat down to supper. \"I hope, Mr. Conrad,\" said Jacob, \"you will be able to relish our humble repast.\" [Pg 65] \"Humble again!\" thought Walter. He was about to say that everything looked very nice, when Joshua broke in. \"If you call this humble, I don\u0027t know what you\u0027d say to the suppers we commonly have.\" Mr. Drummond, who desired, for this day, at least, to keep up appearances, frowned with vexation. \"Joshua,\" he said, \"I desire that you will act in a more gentlemanly way, or else leave the table.\" As leaving the table on the present occasion would have been, indeed, a deprivation, Joshua thought it wise not to provoke his father too far, at any rate until after he had made sure of his supper. He therefore left most of the conversation to his father. \"Have you ever been in Stapleton before, Mr. Conrad?\" asked Mr. Drummond. \"No, sir; never.\" \"It is not a large place, but it is growing; the people are plain, but they have kind hearts. I hope you may like the town after a while.\" \"Thank you, sir; I have no doubt I shall.\" \"If you feel inclined for a walk, Joshua will go out with you after supper, and show you the [Pg 66]mill-dam, the church, and the school-house. He will also point out the store—it is only across the way—where, in my humble way, I try to earn a living. I shall be very glad if you will come in and take a look inside. I may be busy, for work has accumulated during my absence, but Joshua will show you around.\" \"Thank you, sir.\" \"Will you have another cup of tea, Mr. Conrad?\" asked Mrs. Drummond. \"Thank you.\" \"May I ask, Mr. Conrad,—excuse my intruding the question,—who is left executor of your father\u0027s estate?\" \"Mr. Shaw, the lawyer in our village.\" \"Is he? Do you have confidence in him?\" \"He is an excellent man, very honest and upright. He was an intimate friend of my father.\" \"Ah, indeed! I am glad of it. Then he will consult your interests.\" \"Yes, sir, I feel quite safe in his hands.\" \"I am so glad to hear you say so. So many lawyers, you know, are tricky.\" \"Mr. Shaw is not tricky.\" \"We have no lawyer here,\" pursued Mr. Drummond. \"You will perhaps be surprised to hear it, but my humble services are frequently called into requisition, in administering and settling estates.\" \"Indeed, sir.\" \"Yes; but I am glad you have got a man you can trust. Mrs. Drummond, I think Mr. Conrad will have another piece of pie.\" Supper was over at length, and Walter, by invitation, went out to walk with Joshua. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/3005/82931.html","bookId":296,"book":{"id":296,"title":"Strong and Steady Or, Paddle Your Own Canoe","description":"简介： It\u0027s ever so much better than my roomtwice as big, to begin with. Then, my carpet looks as if it had come down through several generations. I\u0027ll bet the old lady had it when she was first married. As for a mirror, I\u0027ve got a seven-by-nine looking-gla...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3005","creation":"Aug 1, 2019 12:18:31 AM","modification":"Aug 1, 2019 12:18:31 AM"}}
