{"id":65742,"no":13,"title":"Page 13","content":"CHAPTER SEVENTEEN TRIS I WAKE JUST before the sun. No one else stirs in their cot—Tobias’s arm is draped over his eyes, but his shoes are now on, like he got up and walked around in the middle of the night. Christina’s head is buried beneath her pillow. I lay for a few minutes, finding patterns in the ceiling, then put on my shoes and run my fingers through my hair to flatten it. The hallways in the compound are empty except for a few stragglers. I assume they are just finishing the night shift, because they are hunched over screens, their chins propped on their hands, or slumped against broomsticks, barely remembering to sweep. I put my hands in my pockets and follow the signs to the entrance. I want to get a better look at the sculpture I saw yesterday. Whoever built this place must have loved light. There is glass in the curve of each hallway’s ceiling and along each lower wall. Even now, when it is barely morning, there is plenty of light to see by. I check my back pocket for the badge Zoe handed to me at dinner last night, and pass the security checkpoint with it in hand. Then I see the sculpture, a few hundred yards away from the doors we entered through yesterday, gloomy and massive and mysterious, like a living entity. It is a huge slab of dark stone, square and rough, like the rocks at the bottom of the chasm. A large crack runs through the middle of it, and there are streaks of lighter rock near the edges. Suspended above the slab is a glass tank of the same dimensions, full of water. A light placed above the center of the tank shines through the water, refracting as it ripples. I hear a faint noise, a drop of water hitting the stone. It comes from a small tube running through the center of the tank. At first I think the tank is just leaking, but another drop falls, then a third, and a fourth, at the same interval. A few drops collect, and then disappear down a narrow channel in the stone. They must be intentional. “Hello.” Zoe stands on the other side of the sculpture. “I’m sorry, I was about to go to the dormitory for you, then saw you heading this way and wondered if you were lost.” “No, I’m not lost,” I say. “This is where I meant to go.” “Ah.” She stands beside me and crosses her arms. She is about as tall as I am, but she stands straighter, so she seems taller. “Yeah, it’s pretty weird, right?” As she talks I watch the freckles on her cheeks, dappled like sunlight through dense leaves. “Does it mean something?” “It’s the symbol of the Bureau of Genetic Welfare,” she says. “The slab of stone is the problem we’re facing. The tank of water is our potential for changing that problem. And the drop of water is what we’re actually able to do, at any given time.” I can’t help it—I laugh. “Not very encouraging, is it?” She smiles. “That’s one way of looking at it. I prefer to look at it another way—which is that if they are persistent enough, even tiny drops of water, over time, can change the rock forever. And it will never change back.” She points to the center of the slab, where there is a small impression, like a shallow bowl carved into the stone. “That, for example, wasn’t there when they installed this thing.” I nod, and watch the next drop fall. Even though I’m wary of the Bureau and everyone in it, I can feel the quiet hope of the sculpture working its way through me. It’s a practical symbol, communicating the patient attitude that has allowed the people here to stay for so long, watching and waiting. But I have to ask. “Wouldn’t it be more effective to unleash the whole tank at once?” I imagine the wave of water colliding with the rock and spilling over the tile floor, collecting around my shoes. Doing a little at once can fix something, eventually, but I feel like when you believe that something is truly a problem, you throw everything you have at it, because you just can’t help yourself. “Momentarily,” she says. “But then we wouldn’t have any water left to do anything else, and genetic damage isn’t the kind of problem that can be solved with one big charge.” “I understand that,” I say. “I’m just wondering if it’s a good thing to resign yourself quite this much to small steps when you could take some big ones.” “Like what?” I shrug. “I guess I don’t really know. But it’s worth thinking about.” “Fair enough.” “So . . . you said you were looking for me?” I say. “Why?” “Oh!” Zoe touches her forehead. “It slipped my mind. David asked me to find you and take you to the labs. There’s something there that belonged to your mother.” “My mother?” My voice comes out sounding strangled and too high. She leads me away from the sculpture and toward the security checkpoint again. “Fair warning: You might get stared at,” Zoe says as we walk through the security scanner. There are more people in the hallways up ahead now than there were earlier—it must be time for them to start work. “Your face is a familiar one here. People in the Bureau watch the screens often, and for the past few months, you’ve been involved in a lot of interesting things. A lot of the younger people think you’re downright heroic.” “Oh, good,” I say, a sour taste in my mouth. “Heroism is what I was focused on. Not, you know, trying not to die.” Zoe stops. “I’m sorry. I didn’t mean to make light of what you’ve been through.” I still feel uncomfortable with the idea that everyone has been watching us, like I need to cover myself or hide where they can’t look at me anymore. But there’s not much Zoe can do about it, so I don’t say anything. Most of the people walking the halls wear variations of the same uniform—it comes in dark blue or dull green, and some of them wear the jackets or jumpsuits or sweatshirts open, revealing T-shirts of a wide variety of colors, some with pictures drawn on them. “Do the colors of the uniforms mean anything?” I ask Zoe. “Yes, actually. Dark blue means scientist or researcher, and green means support staff—they do maintenance, upkeep, things like that.” “So they’re like the factionless.” “No,” she says. “No, the dynamic is different here—everyone does what they can to support the mission. Everyone is valued and important.” She was right: People do stare at me. Most of them just look at me for a little too long, but some point, and some even say my name, like it belongs to them. It makes me feel cramped, like I can’t move the way I want to. “A lot of the support staff used to be in the experiment in Indianapolis—another city, not far from here,” Zoe says. “But for them, this transition has been a little bit easier than it will be for you—Indianapolis didn’t have the behavioral components of your city.” She pauses. “The factions, I mean. After a few generations, when your city didn’t tear itself apart and the others did, the Bureau implemented the faction components in the newer cities—Saint Louis, Detroit, and Minneapolis—using the relatively new Indianapolis experiment as a control group. The Bureau always placed experiments in the Midwest, because there’s more space between urban areas here. Out east everything is closer together.” “So in Indianapolis you just . . . corrected their genes and shoved them in a city somewhere? Without factions?” “They had a complex system of rules, but . . . yes, that’s essentially what happened.” “And it didn’t work very well?” “No.” She purses her lips. “Genetically damaged people who have been conditioned by suffering and are not taught to live differently, as the factions would have taught them to, are very destructive. That experiment failed quickly—within three generations. Chicago—your city—and the other cities that have factions have made it through much more than that.” Chicago. It’s so strange to have a name for the place that was always just home to me. It makes the city smaller in my mind. “So you guys have been doing this for a long time,” I say. “Quite some time, yes. The Bureau is different from most government agencies, because of the focused nature of our work and our contained, relatively remote location. We pass on knowledge and purpose to our children, instead of relying on appointments or hiring. I’ve been training for what I’m doing now for my entire life.” Through the abundant windows I see a strange vehicle—it’s shaped like a bird, with two wing structures and a pointed nose, but it has wheels, like a car. “Is that for air travel?” I say, pointing at it. “Yes.” She smiles. “It’s an airplane. We might be able to take you up in one sometime, if it doesn’t seem too daunting for you.” I don’t react to the play on words. I can’t quite forget how she recognized me on sight. David is standing near one of the doors up ahead. He raises his hand in a wave when he sees us. “Hello, Tris,” he says. “Thank you for bringing her, Zoe.” “You’re welcome, sir,” Zoe says. “I’ll leave you to it, then. Lots of work to do.” She smiles at me, then walks away. I don’t want her to leave—now that she’s gone, I’m left with David and the memory of how I yelled at him yesterday. He doesn’t say anything about it, just scans his badge in the door sensor to open it. The room beyond it is an office with no windows. A young man, maybe Tobias’s age, sits at one desk, and another one, across the room, is empty. The young man looks up when we come in, taps something on his computer screen, and stands. “Hello, sir,” he says. “Can I help you?” “Matthew. Where’s your supervisor?” David says. “He’s foraging for food in the cafeteria,” Matthew says. “Well, maybe you can help me, then. I’ll need Natalie Wright’s file loaded on a portable screen. Can you do that?” Wright? I think. Was that my mother’s real last name? “Of course,” Matthew says, and he sits again. He types something on his computer and pulls up a series of documents that I’m not close enough to see clearly. “Okay, it just has to transfer. “You must be Natalie’s daughter, Beatrice.” He props his chin on his hand and looks at me critically. His eyes are so dark they look black, and they slant a little at the edges. He does not look impressed or surprised to see me. “You don’t look much like her.” “Tris,” I say automatically. But I find it comforting that he doesn’t know my nickname—that must mean he doesn’t spend all his time staring at the screens like our lives in the city are entertainment. “And yeah, I know.” David pulls a chair over, letting it screech on the tile, and pats it. “Sit. I’ll give you a screen with all Natalie’s files on it so that you and your brother can read them yourselves, but while they’re loading I might as well tell you the story.” I sit on the edge of the chair, and he sits behind the desk of Matthew’s supervisor, turning a half-empty coffee cup in circles on the metal. “Let me start by saying that your mother was a fantastic discovery. We located her almost by accident inside the damaged world, and her genes were nearly perfect.” David beams. “We took her out of a bad situation and brought her here. She spent several years here, but then we encountered a crisis within your city’s walls, and she volunteered to be placed inside to resolve it. I’m sure you know all about that, though.” For a few seconds all I can do is blink at him. My mother came from outside this place? Where? It hits me, again, that she walked these halls, watched the city on the screens in the control room. Had she sat in this chair? Had her feet touched these tiles? Suddenly I feel like there are invisible marks of my mother everywhere, on every wall and doorknob and pillar. I grip the edge of the seat and try to organize my thoughts enough to ask a question. “No, I don’t know,” I say. “What crisis?” “The Erudite representative had just begun to kill the Divergent, of course,” he says. “His name was Nor—Norman?” “Norton,” says Matthew. “Jeanine’s predecessor. Seems he passed on the idea of killing off the Divergent to her, right before his heart attack.” “Thank you. Anyway, we sent Natalie in to investigate the situation and to stop the deaths. We never dreamed she would be in there for so long, of course, but she was useful—we had never thought about having an insider before, and she was able to do many things that were invaluable to us. As well as building a life for herself, which obviously includes you.” I frown. “But the Divergent were still being killed when I was an initiate.” “You only know about the ones who died,” David says. “Not about the ones who didn’t die. Some of them are here, in this compound. I believe you met Amar earlier? He’s one of them. Some of the rescued Divergent needed some distance from your experiment—it was too hard for them to watch the people they had once known and loved going about their lives, so they were trained to integrate into life outside the Bureau. But yes, she did important work, your mother.” She also told quite a few lies, and very few truths. I wonder if my father knew who she was, where she was really from. He was an Abnegation leader, after all, and as such, one of the keepers of the truth. I have a sudden, horrifying thought: What if she only married him because she was supposed to, as part of her mission in the city? What if their entire relationship was a sham? “So she wasn’t really born Dauntless,” I say as I sort through the lies that must have been. “When she first entered the city, it was as a Dauntless, because she already had tattoos and that would have been hard to explain to the natives. She was sixteen, but we said she was fifteen so she would have some time to adjust. Our intention was for her to . . .” He lifts a shoulder. “Well, you should read her file. I can’t do a sixteen-year-old perspective justice.”","sourceLink":"https://allnovel.net/allegiant-divergent-3/page-13.html","bookId":1700,"book":{"id":1700,"title":"Allegiant (Divergent #3)","description":"Storyline: Allegiant (Divergent #3) The faction-based society that Tris Prior once believed in is shattered—fractured by violence and power struggles and scarred by loss and betrayal. So when offered a chance to explore the world past the limits she’s known, Tris is ready. Perhaps beyond the fence, she and Tobias will find a simple new life together, free from complicated lies, tangled loyalties, and painful memories. But Tris’s new reality is even more alarming than the one she left behind. Old discoveries are quickly rendered meaningless. Explosive new truths change the hearts of those she loves. And once again, Tris must battle to comprehend the complexities of human nature—and of herself—while facing impossible choices about courage, allegiance, sacrifice, and love. Told from a riveting dual perspective, Allegiant, by #1 New York Times best-selling author Veronica Roth, brings the Divergent series to a powerful conclusion while revealing the secrets of the dystopian world that has captivated millions of readers in Divergent and Insurgent.","cover":"https://allnovel.net/images/allegiant-divergent-3.jpg","author":"Veronica Roth","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/allegiant-divergent-3.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:58:20 AM"}}
