{"id":26229,"no":26,"title":"Chapter 26","content":"We took the subway to Columbia. David Borenstein had notreplied to my email. I did not mention this to Rosie whoinvited me to her meeting, if it did not clash with mine. ‘I’ll say you’re a fellow researcher,’ she said. ‘I’d like you to seewhat I do when I’m not mixing drinks.’ Mary Keneally was an associate professor of psychiatry in theMedical Faculty. I had never asked Rosie the topic of her PhD. It turned out to be Environmental Risks for Early OnsetBipolar Disorder, a serious scientific topic. Rosie’s approachappeared sound and well considered. She and Mary talked forfifty-three minutes, and then we all went for coffee. ‘At heart,’ Mary said to Rosie, ‘you’re a psychiatrist rather thana psychologist. You’ve never thought of transferring toMedicine?’ ‘I came from a medical family,’ said Rosie. ‘I sort of rebelled.’ ‘Well, when you’ve finished rebelling, we’ve got a great MDprogramme here.’ ‘Right,’ said Rosie. ‘Me at Columbia.’ 210/290‘Why not? In fact, since you’ve come all this way …’ She madea quick phone call, then smiled. ‘Come and meet the Dean.’ As we walked back to the Medical building, Rosie said to me,‘I hope you’re suitably impressed.’ We arrived at the Dean’soffice and he stepped out to meet us. ‘Don,’ he said. ‘I just got your email. I haven’t had a chanceto reply.’ He turned to Rosie. ‘I’m David Borenstein. And you’re withDon?’ We all had lunch at the faculty club. David told Rosie that hehad supported my O-1 visa application. ‘I didn’t lie,’ he said. ‘Any time Don feels like joining the main game, there’s a jobfor him here.’ Coal-oven pizza is supposedly environmentally unsound, but Itreat statements of this kind with great suspicion. They arefrequently emotionally based rather than scientific and ignore fulllife-cycle costs. Electricity good, coal bad. But where does the electricity comefrom? Our pizza at Arturo’s was excellent. World’s Best Pizza. I was interested in one of the statements Rosie had made atColumbia. ‘I thought you admired your mother. Why wouldn’t you wantto be a doctor?’ ‘It wasn’t my mother. My father’s a doctor too. Remember? That’s what we’re here for.’ She poured the rest of the redwine into her glass. ‘I thought about it. I did the GAMSAT, like I told PeterEnticott. And I did get seventy-four. Suck on that.’ Despite theaggressive words, her expression remained friendly. ‘I thoughtthat doing Medicine would be a sign of some sort of obsessionwith my real father. Like I was following him rather than Phil. Even I could see that was a bit fucked-up.’ Gene frequently states that psychologists are incompetent atunderstanding themselves. Rosie seemed to have provided goodevidence for that proposition. Why avoid something that shewould enjoy and be good at? And surely three years ofundergraduate education in211/290psychology plus several years of postgraduate research shouldhave provided a more precise classification of her behavioural,personality and emotional problems than ‘fucked-up’. Naturally Idid not share these thoughts. We were first in line when the museum opened at 10.30 a.m. I had planned the visit according to the history of the universe,the planet and life. Thirteen billion years of history in six hours. At noon, Rosie suggested we delete lunch from the schedule toallow more time with the exhibits. Later, she stopped at thereconstruction of the famous Laetoli footprints made byhominids approximately 3.6 million years ago. ‘I read an article about this. It was a mother and child, holdinghands, right?’ It was a romantic interpretation, but not impossible. ‘Have you ever thought of having children, Don?’ ‘Yes,’ I said, forgetting to deflect this personal question. ‘But itseems both unlikely and inadvisable.’ ‘Why?’ ‘Unlikely, because I have lost confidence in the Wife Project. And inadvisable because I would be an unsuitable father.’ ‘Why?’ ‘Because I’d be an embarrassment to my children.’ Rosie laughed. I thought this was very insensitive, but sheexplained, ‘All parents are an embarrassment to their kids.’ ‘Including Phil?’ She laughed again. ‘Especially Phil.’ At 4.28 p.m. we had finished the primates. ‘Oh no, we’redone?’ said Rosie. ‘Is there something else we can see?’ ‘We have two more things to see,’ I said. ‘You may find themdull.’ 212/290I took her to the room of balls – spheres of different sizesshowing the scale of the universe. The display is not dramatic,but the information is. Non-scientists, non- physical- scientists,frequently have no idea of scale – how small we are comparedto the size of the universe, how big compared to the size of aneutrino. I did my best to make it interesting. Then we went up in the elevator and joined the HeilbrunnCosmic Pathway, a one-hundred-and-ten-metre spiral ramprepresenting a timeline from the big bang to the present. It isjust pictures and photos and occasional rocks and fossils onthe wall, and I didn’t even need to look at them, because Iknow the story, which I related as accurately and dramaticallyas I could, putting all that we had seen during the day intocontext, as we walked down and round until we reached theground level and the tiny vertical hairline representing all ofrecorded human history. It was almost closing time now, andwe were the only people standing there. On other occasions, Ihave listened to people’s reactions as they reach the end. ‘Makes you feel a bit unimportant, doesn’t it?’ they say. Isuppose that is one way of looking at it – how the age of theuniverse somehow diminishes our lives or the events of historyor Joe DiMaggio’s streak. But Rosie’s response was a verbal version of mine. ‘Wow,’ shesaid, very quietly, looking back at the vastness of it all. Then,in this vanishingly small moment in the history of the universe,she took my hand, and held it all the way to the subway.","sourceLink":"http://novel.tingroom.com/jingdian/1840/53308.html","bookId":1000,"book":{"id":1000,"title":"罗茜的计划 The Rosie Project","description":"简介： I may have found a solution to the Wife Problem. As with somany scientific breakthroughs, the answer was obvious inretrospect. But had it not been for a series of unscheduledevents, it is unlikely I would have discovered it....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1840","creation":"Aug 1, 2019 12:24:08 AM","modification":"Aug 1, 2019 12:24:08 AM"}}
