{"id":44463,"no":18,"title":"XVI MRS. FOLYAT DISSECTED","content":"If you had married a conscientious Bishop and made him live in a pig-stye—à la bonne heure! \n JOHN RUSKIN \n \n FROM being a governess with extremely small wages Annette became a servant with no wages at all. A few months after her return to her father’s house, Ada, the cook-general, married (beneath her) and she was replaced by a gnomish child of sixteen who wore short dresses and had her hair done up at the back in a tight little bun. She talked an entirely unintelligible language and delighted the Folyat family on the day after her arrival by saying to Annette, who happened to be in the kitchen: \n \n “Eeh! Annie,”—never a “Miss” from a North-country girl—“Eeh! Annie, will ye whack t’ pots on t’ table while I wash me ’ead?” \n \n Annette obliged, and “whacking the pots on the table” became the family euphemism for getting a meal ready. \n \n Gertrude and Mary had gradually retired from active service—Mary with better excuse than Gertrude—and the whole administration of the household devolved on Annette. Nothing was said to her about it, no arrangement was made; it just happened, and nobody noticed that it had happened. From early morning when she prepared tea for her mother, to late at night when she boiled her chocolate, Annette was cooking, washing up, dusting, making the beds, \u0026c., and her only excursions, except to church or the schools, were to the shops to buy the wherewithal to cook, wash-up, dust, \u0026c. Nobody ever thanked her: for many weeks nobody remarked [Pg 171]that she was doing so much, and then Serge found her dragging a heavy coal-scuttle up the stairs to his studio, relieved her of it and questioned her. After that, when he was at home, he did what he could to assist her in the heavy work. \n \n As for Mrs. Folyat, she was a very lily, in that she toiled not neither did she spin. When she thought of it, she resented the decline and fall of her kitchen from cook-housemaid and parlourmaid to the sixteen-year-old hobgoblin, but, resentment being rather an active state of mind, she avoided it by giving no thought to the matter. \n \n If Mrs. James Lawrie could be likened to a garden roller, Mrs. Folyat could most nearly be said to resemble a mill-stone. She was of the great and ignoble army of people who are neither good nor bad, renounce their potentialities in either direction, and drag all those to whom they cling—for cling they must if they are to remain above ground—down to the lowest depths of impotence, than which there is no worse state. She made herself comfortable with fiction and preferred everything to truth. An amazing capacity she had for compelling others to acquiesce in her self-deceptions by tickling their sentimentality so that it rose in them like a flood of treacle and slopped over their imagination and critical faculty. Had it ever occurred to her to exercise this power in print she might have become an enormously successful novelist. She was to all appearances much loved, and all her acquaintances and many of those whom she called her friends always spoke of her as “dear Mrs. Folyat.” She was never unhappy, but, on the other hand, she was never happy. In all material matters she was a furious optimist. She liked eating and sleeping and gossiping and going to the theatre and reading. If she could indulge in all these seemingly harmless pleasures to the extent of her appetite it seemed to her that all was well with the world. \n \n When she married Francis, ambition was stirred in her and satisfied. Through the long years at St. Withans she bore him children with great regularity and also with [Pg 172]the indifference of an automaton. She regarded herself as a perfect wife because she was faithful, and as a perfect mother for no other reason than that she was a mother. When her children offended her she chastised them, when they pleased her she kissed and fondled them. On the whole she brought them up on the principle of Rabelais’ Abbé: Fais ce que vouldras. On that principle also she conducted her own life, but, unhappily, she never wanted anything much. \n \n She believed herself to be a Christian. She was so familiar with the Bible that it had absolutely no meaning for her. Her memory was astonishing, so that she did not need to read the book. Her childhood had been spent in an atmosphere of great piety, and she had absorbed the whole Scripture from Genesis to Revelation, through the pores of her skin rather than through her brains. What most nearly penetrated her consciousness was, curiously enough, the prophecies of the end of the world: There shall be wars and rumours of wars, and every now and then she indulged herself in the luxury of terror, reading signs in everything. She was extremely superstitious and would never walk under a ladder, nor sit thirteen at a table, and when a mirror was broken in the house or salt was spilt or knives were crossed, she would see in the next disaster, great or small, the infallible consequence. She was delighted when she met a hunchback in the street, for that portended luck; alarmed on an encounter with a cross-eyed woman, for that boded no good. Her mind was like a dusty empty room, the door of which was sealed with cobwebs, showing that she had not for many years passed out nor had any entered in. She was romantic and picturesque, loving the romance of fiction, and entirely oblivious of the romance of fact. Only twice in her life did she deliver herself of utterances the least philosophical, and as, being what she was, her sincerity must remain suspect, neither can be taken as giving a clue to the inward workings of her mind. These are they: \n \n (1) Long after Gertrude was married and had lived through her little tragi-comedy she said: \n \n [Pg 173] \n \n “All men are beasts. I married the best of them, and he’s a beast.” \n \n (2) When one of her grandchildren—(this being a digression we may skirmish up and down the alleys of time)—beset by philosophic doubt, wanted to know what was going to happen to the world she made this pronunciamento: \n \n “The world will go on getting worse and worse until the end of everything comes, just as the Bible tells you. There shall be wars and rumours of wars, . . . \u0026c.” \n \n At the back of her mind during all her adult life was the belief in the proximity of the end of the world, and in her inevitable translation to divine regions, where, with her husband, she would live an untroubled and unsexed life of uninterrupted habit. She took her husband with her, partly because he was a clergyman and had a prescriptive right to a heavenly mansion, but chiefly because, after so many years, she was unable to conceive of an existence without him. It was all very hazy, but it was towards this future that she turned when she said her prayers morning and evening. This she did as mechanically as she dressed and undressed, between which two operations she devoted herself to her public duties as rector’s wife—Bible classes, mothers’ meetings, and mission work—and to the cultivation of the nearest approach to a passion in her existence, gentility. She spent many solitary hours in the drawing-room because she could not sit with Francis in his study, as she disliked the smell of tobacco and detested his allegiance to a clay pipe. She was hardly ever known to stoop to enter the kitchen. \n \n Withal her authority was never questioned, and she obtained from her family, their friends and acquaintances, the homage and service she expected. \n \n She was a match-maker, and no combination of male and female was too grotesque for her. She was delighted with Gertrude’s engagement. Bennett Lawrie’s personality lent itself to sentimental heroics, and she was more than a little in love with him herself—as a little girl is in love with the first-comer. Minna’s plurality [Pg 174]in affairs of the heart baffled and annoyed her, for in love she always looked for constancy. She had marked down Streeten Folyat for Mary, though, beyond sending a brace of grouse every August, he showed little sign of desiring the more acquaintance of his cousins. . . . Annette and Serge she left unmated, of Serge she was afraid, and of Annette she took little account. But for Frederic she had planned many famous weddings and had laid countless traps for him. He never saw her scheming, but, going his own way, he ever evaded her until, having failed in her higher flights, she came to look nearer home. The Clibran-Bells had inherited money, and there was only one life between them and a large fortune, so that all the girls would possess some three hundred a year, while George would eventually be a man of large means, for the money came through Mrs. Clibran-Bell and avoided Mr. Clibran-Bell altogether. This sudden and unexpected outcrop of wealth occasioned great excitement in Fern Square, and the Clibran-Bells added another servant to their two. They also made a gift of two new altar-cloths and a chalice to the church. One of the altar-cloths was worked by Jessie Clibran-Bell with embroidery and appliqué. She was an accomplished needlewoman, had many little talents, and she was intelligent and pious. She was the eldest of the family and the most nearly beautiful. Her nose was straight and like her mother’s, whereas her sisters had unfortunately gone to their father for their noses and got them of an unwomanly hugeness. Mrs. Folyat selected Jessie for Frederic, and soon perceived, what had escaped her before, that she was in love with him. \n \n Jessie was two years older than Frederic. She was just a little austere in temperament, singularly pure and innocent in mind. The wave of religious fervour which follows on confirmation had endured with her, and she had secretly aspired to become a nun until the advent of Frederic. Then, having escaped the wasteful expenditure of affection upon folly that fills the adolescence of most young women, she suffered a tremendous upheaval. [Pg 175]Living with a prying, curious family, she thrust her emotion away and tried to cover it, and affected a frivolity which was entirely foreign to her. Alternately she avoided and sought Frederic’s company, as first one and then the other procedure seemed to her the less conspicuous. Her labours were all in vain, for Minna knew her condition almost as soon as she did herself, and made no secret of it. As time went on Jessie grew accustomed to the presence of love in her life, realised that it would be impossible for her to take any other husband than Frederic, and resigned herself with truly Christian fortitude and patience to wait until that happened which she desired should happen. She had never enjoyed any confidence with her mother, whom she had been brought up to regard as the most beautiful lady in the world, the “very pinnacle of human virtue.” (The phrase was her father’s, often on his lips, and Minna always referred to Mrs. Clibran-Bell as “The Pinnacle.”) \n \n It may be ennobling and purifying to idealise your womenkind, but if your womenkind accept the position they are rather apt to believe, with disastrous results, that it is more blessed to receive than to give. Certain it is that if Robert Clibran-Bell had an ideal, he never had a wife, and that his children never had a mother. \n \n Jessie Clibran-Bell in her simplicity believed that the Folyats had all that she had lacked. She was devoted to Francis, and when Mrs. Folyat played her sentimentalist’s game with her she was entirely deceived, saw in Mrs. Folyat a perfect hen of a mother and crept under her wing. All this took some time, and it was not until the change in the Clibran-Bell fortunes that Mrs. Folyat made room for Jessie. She made her snug and warm, and, in sheer gratitude, without making any actual confession, Jessie laid bare her feelings. Mrs. Folyat kissed her and gave her to understand that though Frederic was her favourite child and a paragon among men, yet he was unworthy of such profound, such patient, such unselfish devotion. The more she abused Frederic the more warmly did Jessie’s fondness flow. They both enjoyed themselves [Pg 176]thoroughly, and often met in conclave in the Folyat drawing-room. So absorbed did Mrs. Folyat become in the pursuit of this new intrigue that she lost interest in Gertrude’s affair and devoted herself to the snaring of Frederic. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1620/47953.html","bookId":1231,"book":{"id":1231,"title":"Round the Corner","description":"简介： Being of such a strange temper and vision that when I aim my pen at a man I am as likely as not to hit his grandfather, I have in this instance endeavoured to forestall the treachery of my faculties and to go straight for the grandfather, though my i...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1620","creation":"Aug 1, 2019 12:24:40 AM","modification":"Aug 1, 2019 12:24:40 AM"}}
