{"id":44472,"no":27,"title":"XXV LAWRIEAN PHILOSOPHY","content":"I now mean to be serious—it is time. \n DON JUAN. \n \n MEANWHILE Serge and old Lawrie became so interested in each other that they walked far into the night. It was Serge who opened the conversation: \n \n “I gather that you will be charged with drunkenness and obscene language.” \n \n “Aye. When I’m fou I’m mighty full o’ poetry. The exact words were ‘bloody symbol.’ The man probably thought I was referring to his vices. I told him he was a symbol of Society’s hypocritical endeavour to suppress the consequences of its own villainy. My drunkenness is one of those consequences. It is the direct outcome of the habit of loneliness. . . . Did I talk to you about that before? . . . No. It would be your father. Have you ever been to prison?” \n \n Serge regretted that he had never had that experience. \n \n “It was a dirty cell they put me in, but it was shining with the truth, the blackguardly truth of all humanity. Man, I found there what I’ve been seeking these thirty years. . . . I wonder now if ye’ll understand me. I would like to know what ye make of life, or if ye make anything of it at all.” \n \n “It seems to me simple enough,” replied Serge. “A man is born. Two things lie before him, love and death.” \n \n “That’s it. That’s it. Now mark what I’m going to tell you. On the walls of my cell were drawings and writings—horrible drawings of women, lewd verses, and hysterical outbursts in the name of Jesus Christ. They were conventional, I admit, but that only makes it all the worse. It means that men are imprisoned in their [Pg 261]own minds, debarred from woman on the one hand and from God on the other. You may tell me that my cell has been occupied only by lowest types, but if the Prince of Wales were to be incarcerated in it he would in time add to the collection of bawdy rhymes, and if he were followed by the Archbishop of Canterbury there would be one more such inscription as: ‘Christ died to save me and the magistrate.’ Some men are reduced to filthiness, some to hysteria, some to both. For the superficial and trivial purposes of existence such as the day’s work, marriage, family duties, the so-called pleasures of society, they contrive to cover up their deplorable condition. Within themselves they are reduced to the most devastating loneliness. In their day-to-day prison of Society they do not write their thoughts on the walls (except for an occasional jubilant outburst over the successful issue of an amorous adventure), and it has remained for me to find in an actual acknowledged prison the frank revelation of the state of the human mind. . . . It has always been so. . . . Britons never shall be slaves indeed! They never have been, never will be, anything else.” \n \n Serge quoted: \n \n “L’inconvénient du règne de l’opinion, c’est qu’elle se mêle à ce dont elle n’a que faire; par exemple, la vie privée. De là la tristesse de l’Amérique et de l’Angleterre.” \n \n “Aye,” said the old man. “And what would the man that wrote that say if he could see our town and all the other towns, the rusty links in the world-wide thing the men of our time are so pleased to call industrialism? Men make everything in their own image. If you want to know what men are look at their towns, look at their houses, look at their books, their art. . . . At first, being human, ye’ll be dazzled and pleased by the conceit and egoism that have gone to the making of them, but soon beneath the conceit and the egoism ye’ll find nothing but fear—fear of death, fear of love; appeals to Jesus Christ from the one, abuse of women by way of escape from the other. Fools [Pg 262]and blind! There’s no escape. There’s no good life but in the honest meeting of the one and the other. . . .” \n \n “And women?” asked Serge. \n \n “Their minds reflect only the minds of men. I think now that all the trouble, all the distress, and all the muddle come from the arrogance of men, who have always preferred the reflection of life in the flattering mirror of their minds to life itself. They have dropped the bone for the shadow, when they might have had both. They could have admired the shadow and eaten the bone; but, in the folly of their arrogance, they have thrown both away. . . . They must be almost as great a trial to God as they are to themselves. God is very merciful, since, though they will not love, yet He allows them to die. The mistake is understandable. A man’s eyes, all his senses, assure him that he is the centre of the universe. Quite obviously his senses lie, but it is often difficult to see the obvious. There cannot be more than one centre of the universe, and, if a man will only reflect for a moment, he will see that all his neighbours, his dog, the tree in his garden—if he has a garden—every star in the sky, must be victims of the same delusion. Unhappily, though man has lived on this world for thousands of years, he has not yet made the small mental effort necessary for the slight correction of his senses. It has taken him thousands of years to discover that this earth on which he has his dwelling is not the centre of the solar system. That was a shock to his vanity, and his endeavour since then has been to prove his own all-importance in the scheme of things. He has turned to and pigeon-holed his knowledge and called it science. He has become increasingly adventurous and busy, simply because of the restlessness that has come over him on being confronted with his mistakes. He has discovered the whole habitable globe and proceeded to defile it. In my lifetime he has blundered into the discovery of steam-power, electricity, and they talk of oil as a generator of more power. I have seen many changes, but always it has come back to the same thing. The principles of life are few and simple. Every discovery puts a girdle round the earth, every [Pg 263]invention that liberates man in body and mind makes the command sound clearly and more loud: ‘Thou shalt love and thou shalt die. . . .’ With every discovery however the egoism of mankind waxes more and more fat and they stop their ears to the command. They insist that they are the crowning achievement and purpose of creation—the old delusion, you observe, of being the centre of the universe. Those who are most strongly obsessed by this delusion thrust those in whom the conviction is not so strong away from their path or down under their feet. They thrust and fight their way to the centres of human organisation, which they mistake for the centre of the universe, the point at which their centre-hood can be most openly declared for all men to see. They thrust and fight their way to power, only to find themselves powerless, for, in spite of themselves, in spite of the lies with which they are fed and feed themselves, men do obey the laws of love and death. . . . But in such a way, such a halting, mean, decrepit, stealthy way!” \n \n Here the old fellow paused, and Serge said: \n \n “You have come to my contention that good and bad, for men and women, lie wholly in the use or the abuse of things.” \n \n But old Lawrie was so intent on his own thoughts that he seemed not to hear Serge. They came to the bridge under the Collegiate Church and leaned against the parapet. Oily black the river ran under the dark walls of warehouses and mills. The lights of the windows and the street lamps shone and flickered in the greasy depths of the tainted water. \n \n “Yon river,” said old Lawrie, “is like the life of a man. I know not where it rises, but it comes pure and sweet from the hill-side, meandering and murmuring through meadows, growing wider and ever wider in its irresistible and purposeful progress to the sea. In the towns and cities of men it becomes poisoned and poisonous, but, tainted as it is, it hastens onward to its goal. . . . I beg your pardon if I have obscured my meaning with parable. What I see, and what much bitter experience has taught me, is that there is evil enough lying in wait for men [Pg 264]without their adding to the sum of it by mental and moral confusion. Say their place in the creation is the highest, say that in them life finds its keenest expression, should not their glory be the glory of service rather than the vain-glory of servitude? Why must they always be demanding applause for the work they do so ill? Is there any work that men have ever done—outside the arts—that could not have been done better? . . . I say there is none. And I have found the answer to all these questions only to-day, in my prison-cell. To a man diseased with egoism—and how many men are not?—love and death are hurtful things, for they are not flattering to his vanity. In the reflection of life in which men strive to live (for in that reflection their vanity can have free play, exactly as it can and always does when a man scans his features in a glass) love and death are not seen. All human codes of conduct and of morals, all dealings between man and man, are cut to fit the reflection and not life itself. . . . What, then, is human life?—what are the depths that sustain the yeasty turbulence of man’s knavery and folly and dirtiness and hysteria? . . . A man is kin and comrade with all things living, from the great sun to the motes dancing in the sun’s rays. He is a part of that radiance which rises from the centre of the universe and courses through the veins of every stone and every tree and every living thing. . . . Aye, such a power of life in a man, and such a comical small thing as he makes of himself! . . . Such a comical, small thing as I’ve made of myself! . . . Rapacity made this town what it is. Think what it might have been, what all towns might have been, if love had made them! . . . There’ll come a time when Society will no longer be a prison walled off with fear of love and fear of death. The poets have not lived and sung for nothing. They’ll cleanse the walls of the filth and the cry of bitter anguish; and when man has done with discovering the world and playing at conquerors and king o’ the castle, he will come to the most glorious day of all when he shall know himself, what he is: \n \n [Pg 265] \n \n Great Nature spoke, with air benign: \n \n ‘Go on, ye human race! \n \n This lower world I you resign, \n \n Be fruitful and increase. \n \n The liquid fire of strong desire, \n \n I’ve poured in every bosom; \n \n Here, on this hand, does Mankind stand, \n \n And there is Beauty’s blossom.’ \n \n That’s Robert Burns for ye! . . . Good night.” \n \n He walked away abruptly, and Serge only remembered then that he had intended to inform the old man of the fate that had befallen his son. More than ever he felt that Bennett and Annette were, in the main principle of their action, right, though they might be wrong in the details of their manner of doing it. The world would exact a heavy penalty of them. The world would be wrong. \n \n \n \n Old Lawrie awoke next morning to find his wife standing by his bedside holding out a letter. It was from Mrs. Folyat and was extremely offensive. Old Lawrie read it: \n \n “There’s no doubt,” he said, “that he’s a son of mine.” \n \n He handed the letter back to his wife, turned over on his side and went to sleep again. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1620/47962.html","bookId":1231,"book":{"id":1231,"title":"Round the Corner","description":"简介： Being of such a strange temper and vision that when I aim my pen at a man I am as likely as not to hit his grandfather, I have in this instance endeavoured to forestall the treachery of my faculties and to go straight for the grandfather, though my i...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1620","creation":"Aug 1, 2019 12:24:40 AM","modification":"Aug 1, 2019 12:24:40 AM"}}
