{"id":44474,"no":29,"title":"XXVII GERTRUDE MAKES THE BEST OF IT","content":"De quels ravissements nous privent nos intempérances. JOUBERT. WHEN Annette’s baby—a boy—was born, Gertrude was the first to go and see it. She took with her a woollen bonnet and a horn spoon. Having become capitalists with the enormous sum that had come to Annette, they had left their lodgings for a little house in a row of little houses each of seven rooms and a scullery. They had a little maid, who opened the door to Gertrude. She was a tiny wizened creature but very voluble. Gertrude was not a yard inside the house when she had a full description of the baby, its layette, Annette’s condition and appearance, and the devotion of Bennett, who, she said, “never had no eyes for nothink ’cept ’is ugly little wife.” Gertrude was shown upstairs, to find Annette sitting up chattering to an enormously fat woman, who was introduced to her as Mrs. Entwistle. They were talking about Serge, of whom the fat woman expressed the most glowing admiration. The baby, a very little one, ugly and blotched, was handed to Gertrude, and she was properly ecstatic over it. Mrs. Entwistle said: “Eeh! Ow I did ’ave to slap ’is little buttocks to make ’im cry!” “Slap?” said Gertrude, rather horrified. “Eeh! Miss, didn’t ye know that? Well, I never. Sometimes you ’ave to fair leather into ’em.” Gertrude held the baby in her arms and hugged him [Pg 275]close to her breast. She was feeling very mournful, and envy tugged at her heart. She said: “It’s a very little house you live in.” “Isn’t it? But we love it. It’s just big enough for the three of us.” “How—how is Bennett?” “Oh! He’s very well, and he gets more money now, though still very little. I’m afraid we shall never have very much as long as he remains in business, and if he left it I suppose we should have nothing. But we don’t think about it—much.” “You must be very happy.” Very mournfully Gertrude said this. She was disappointed. She had fancied that when she held Annette’s baby in her arms she would feel all kinds of beautiful and exalted emotions. It was certainly pleasant to feel its warmth, and to hold it, so helpless as it was, gave her a genial sense of protection, but she was wanting, hoping for more than that. And when Annette replied that she was very happy—she looked it too—Gertrude realised painfully that she was brutally indifferent. The starving cannot rejoice with the well-fed. Gertrude felt her life trickling away through her fingers: worst of all, though she was not conscious of it, her desire for life was ebbing away from her. All the bitterness, all the hunger, all the hard envy in her heart she translated into one word: “Old.” She said to herself: “I am getting old.” . . . Having come to a concise and rounded thought she was pricked by it into revolt, and she said gently, at first, to Annette: “I envy you. I remember you when you were a little girl. I have always thought of you as little, so that I have hardly known you. . . . And I must have always seemed to you beyond your reach. Now it is you who are beyond mine. Isn’t it funny?” She gave the child to Annette, watched it blindly wriggling against its mother’s breast, and tears trickled down her nose on to the counterpane. Annette was so engrossed in her boy that she did not notice it, and Gertrude was at once ashamed of her tears, brushed them [Pg 276]away, and angrily, in her heart, accused Annette of selfishness. She would have been so grateful only for a little pressure of the hand, a little smile, something that would bid her come into the circle of warmth, so radiant with the joy of the child. She was too timid, too much taken up with pity for herself, to force her way in. She dared not assume that she would be welcome, for she was too conscious of her own awkwardness. She let slip the opportunity as she had spoiled so many. The conflict in her soul left her bruised and sore, and she almost hated Annette—Annette who had lied and cheated to take her lover. She turned from her thwarted emotion to sentimentality, raked over the ashes of the past, and artificially reconstructed the ruses and strategems that she supposed Annette had used to capture Bennett during her absence. . . . With effusive cordiality she kissed Annette and the baby and promised often to come and see it. A little awkwardly—she was not always tactful—Annette explained that Bennett’s sister was to be the baby’s Godmother. That gave Gertrude the handle she was seeking, and she persuaded herself that she had deliberately been slighted. She went away almost without another word. On her way home she was thrust by her fancied injuries into contemplating her future. As people always do when they contemplate the future, she lost sight of the infinite gradations which led from the point at which she stood to the point on which her eyes were fixed, so that all her forward life was presented to her mental vision as acid, cold, bitterly assailing her without clemency. All her desire was to escape that future, and to evade the phantoms conjured up by her own mind—a mind very similar to her mother’s and also infected by it—and to do so in a way that should, if ever so slightly, prick Annette’s conscience . . . Ideas are too often the gaolers of our souls, which, seeking health and freedom, groping out of prison, take counsel of the first-comer, an idea whom we have fee’d with prejudice and cowardice to stand guard over us. [Pg 277]Gertrude, seeking freedom from her home, from her own folly, from herself, accosted the first-comer, Marriage, who, with a false smile, opened a door and clapped her into another cell. This, being larger than the other, she took for a place wide open to the winds of Heaven, and passed from querulous fear of the future to excitement in the immediate view. To be sure, she only saw four walls, but there was more light on them, more air and mystery between her and them. . . . Above all, nowhere in her cell could she see the figure of her sister Mary, whom she had begun to detest, nervously and irritably. . . . Mrs. Folyat had grown more and more incapable. The work of the house was divided between Gertrude and Mary. Between the two there was a grim struggle as to which of the two should make herself the less indispensable to her mother. It was very certain, as both knew in their inmost hearts, that if one of them were to be left, that one would remain for ever, with nothing to do save to turn the hour-glass when the sands ran out. Mary, being the weaker of the two, was the more good-natured, and it was for Mary that Mrs. Folyat most often called when she dropped her knitting-needle, or mislaid her spectacles, or lost her book by sitting on it, or wished to play Patience at some inappropriate hour. Everybody said Mrs. Folyat was a dear old lady. She liked the character, clung to it and abused it. Either Gertrude or Mary must be gobbled up by her selfishness. Both Gertrude and Mary believed that their mother was a dear old lady. They dreamed not that they were in revolt against her, but fancied—as it seemed more heroical to do—that they were at grips in a fearful struggle with life. They were both very near hysteria, Gertrude, after her visit to Annette, being the nearer. There came to live near the town at this time Mrs. Bradby-Folyat, an aunt of the Folkestone Folyats, an old lady of much wealth, whose estate was continually being augmented by legacies bequeathed by irascible Bradbys and Folyats who were sickened by the attentions [Pg 278]of their legacy-hunting poorer relations. Mrs. Bradby-Folyat left her relations alone, and the harvest of her wisdom was great. . . . Being a lady of strong character and almost masculine intelligence she had a great fondness for the weak and almost idiotic Streeten Folyat, who long ago had abandoned his sheep-farm in Westmoreland and wandered from one profession to another, shedding in each a portion of his patrimony. Between journalism and market-gardening he spent several months with his aunt at Boynton and amused himself in the town in Frederic’s company. Occasionally he visited the house in Burdley Park. . . . Then he bought a small fleet of fishing-smacks at Scarborough, sold them after ten months at a heavy loss and returned to Boynton. His income had dwindled to four hundred. He bought houses in our town and was quickly embroiled in a law-suit—his idleness made him quarrelsome—and placed the case in Frederic’s hands. By sheer luck Frederic won the case and delighted the old lady at Boynton, who insisted on considering that he had saved Streeten from ruin. She invited Frederic and his wife to stay with her, and entrusted him with the management of her estate. Frederic was almost delirious at this access of fortune, and calculated that if the old lady lived for another ten years he would make at least six thousand pounds. He was in debt—he could not amuse himself with Streeten for nothing—and he borrowed money from a friendly moneylender whose rate of interest per cent. per mensem seemed reasonable and low. When Frederic was not at Boynton Streeten was at Frederic’s house, and when Streeten was at Frederic’s house there also was Gertrude. Streeten was amazingly vain, a fop, and as eager to scan his features in the glass as a little boy just on the verge of adolescence, who is beginning to feel that the eyes of the world are upon him. Such men, when no mirror is near, will turn to the nearest woman. If in her he can see the faintest reflection of himself, pat he will fall in love with it. . . . There were not many mirrors in Frederic’s house. Streeten turned to Jessie but saw only Frederic, to Gertrude then, and he [Pg 279]saw himself enlarged, heightened, dazzling. It was the most bewildering reflection of himself that he had ever seen, and at once he was prostrate before it. Almost before he could realise what had happened he was picked up, thrust into a frock-coat and silk hat, taken to church, married to Gertrude, and packed off for a honeymoon to Ilfracombe. He was very bored and savage. He wanted to be at Boynton or amusing himself with Frederic. It is one thing to steal glances at your own reflection when you think no one is looking, quite another to be married to it, though the mirror tell its tale never so constantly. It were too cruel, it were indecent, to write of Gertrude’s honeymoon.","sourceLink":"http://novel.tingroom.com/jingdian/1620/47964.html","bookId":1231,"book":{"id":1231,"title":"Round the Corner","description":"简介： Being of such a strange temper and vision that when I aim my pen at a man I am as likely as not to hit his grandfather, I have in this instance endeavoured to forestall the treachery of my faculties and to go straight for the grandfather, though my i...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1620","creation":"Aug 1, 2019 12:24:40 AM","modification":"Aug 1, 2019 12:24:40 AM"}}
