{"id":83206,"no":32,"title":"Page 32","content":"Her hopes crushed, Cinderella stared at the ground, her hands clamped into fists.\\n\\n “It does not matter to me what you choose to do. I will look into alternate housing for my daughters and me. Please tell me when you have made your decision,” Lady Klara said, extending the paper to Cinderella.\\n\\n When Cinderella didn’t take it, Lady Klara dropped it and walked away, her steps echoing in the empty chamber.\\n\\n A door opened and closed, and Cinderella’s shoulders shook with rage and misery.\\n\\n Cinderella roared and picked up the papers. She flung them across the room before she slumped forward and pounded the floor with her fists.\\n\\n This was it. After everything she had done, she would still lose Aveyron.\\n\\n This was the end.\\n\\n “You look terrible.”\\n\\n Cinderella closed her eyes. She couldn’t deal with him right now. “Go away, Friedrich.”\\n\\n “Oh no. You just used my name. This calls for a celebration,” the Colonel said, plopping down in the dirt next to Cinderella.\\n\\n Cinderella was huddled against a fountain in the public gardens. It was early in the day, so the gardens were empty, but there were still patrolling soldiers around to ignore Cinderella’s tears and keep her safe.\\n\\n “How did you know I was here?” Cinderella asked, covering her swollen, red-rimmed eyes with her hands.\\n\\n “Several soldiers reported to me that my darling Pet was sobbing her eyes out in the gardens.”\\n\\n “Could you stop with the jokes? You might be enjoying yourself, but this isn’t funny. If you’re just going to call me silly names would you please leave?”\\n\\n The Colonel peeled Cinderella’s hands away from her eyes. “Cinderella, what’s wrong?” he asked in a gentle voice.\\n\\n “I’ve lost,” Cinderella said in a broken whisper. “Aveyron is as good as gone.”\\n\\n “How?”\\n\\n “There were fines. I didn’t know about them. They were from directly after the takeover, when my father still…They’re so big now I cannot possibly pay them as well as taxes.”\\n\\n “Can’t you sell any land, or layoff servants?”\\n\\n “No,” Cinderella said. “I cannot let any of the staff members go, and the only reason Aveyron survives as it has is because of all the farm land and grazing land.”\\n\\n “But if you lose Aveyron, all of your servants will be lost as well.”\\n\\n “Aveyron isn’t what’s important. It’s the servants. Choosing whom to abandon and let go—I can’t do it.”\\n\\n “So what will you do?”\\n\\n “Either I lose Aveyron to the crown at the end of this summer, or I sell it. Unless I want to be penniless and homeless, I will have to marry,” Cinderella said, tipping her head back to stare at the blue sky. It seemed wrong that the weather could be so delightful as Cinderella’s world fell apart.\\n\\n “So marry me.”\\n\\n “What?”\\n\\n “Marry me,” Friedrich repeated.\\n\\n “You must be out of your mind,” Cinderella said.\\n\\n “No.”\\n\\n “Then you are joking.”\\n\\n “I’m not.”\\n\\n “What could possibly move you to want to marry someone from Trieux?”\\n\\n “Love?”\\n\\n “HAH!”\\n\\n “Aren’t you jaded,” Friedrich said, adjusting his black patch.\\n\\n “You’re not in love with me. You aren’t even hurt by my refusal.”\\n\\n “I’m very hurt. Deep inside my heart is crying,” Friedrich said.\\n\\n Cinderella snorted.\\n\\n “And although you might fight it, you’re considered an Erlauf citizen.”\\n\\n “That does nothing to change my situation.”\\n\\n “I know; I just wanted to be sure you knew. But you’ve gotten me off track. Cinderella Lacreux, please marry me,” Friedrich said. He picked up one of Cinderella’s hands and grazed her knuckles with his lips.\\n\\n “Friedrich, I’m going to have a mountain of debt on me. You could not possibly pay it off.”\\n\\n “Perhaps I can’t pay it off, but I have other resources,” Friedrich said.\\n\\n Cinderella shook her head. “No. I can’t. Unless you can afford to pay this amount as a bride price, my answer is no.” Cinderella said, digging the crumpled paper that listed the amounts Aveyron owed out of her apron pocket.\\n\\n Friedrich smoothed the paper and whistled. “I hope your servants are worth it.”\\n\\n “They’re all I have.”\\n\\n “Well. If I get this amount and present it to you, you’ll marry?”\\n\\n “If you have it before the summer is over, yes,” Cinderella said.\\n\\n “Right. Can I keep this?”\\n\\n “If you want,” Cinderella said, massaging her temples.\\n\\n “In the meantime, I have something that might bring you a smile,” Friedrich said, shifting so he could unhook a pouch from his belt.\\n\\n “I cannot possibly take another gift. You’ve already given me more than I can repay you.”\\n\\n “Then consider it not a gift, but a reward for wearing the necklace,” Friedrich said, nodding at the bit of chain that was visible on the back of Cinderella’s neck before he passed the pouch over.\\n\\n She opened the bag and peered inside. “Seeds?” \\n\\n","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-32.html","bookId":1806,"book":{"id":1806,"title":"Cinderella and the Colonel (Timeless Fairy Tales #3)","description":"Storyline: Scratching out a living in a land recovering from war and a hostile takeover, Cinderella—an orphaned, destitute duchess—is desperate to save her lands and servants in spite of the terrible taxes placed upon her by the Erlauf queen, even if it means she must don servants’ clothes and work like a commoner. \\n Her sacrifices aren’t enough, and when a mountain of debt is levied against her, she is given one season to produce the funds. Cinderella realizes it is only a matter of time before she loses everything she has struggled to protect, and it seems that all is lost until she is befriended by the debonair Colonel Friedrich—a member of the Erlauf military and a citizen of the oppressing country that rules her homeland. \\n From helping her break into the royal library to saving her from a rogue mage, Friedrich draws her closer and challenges her mindset of the queen and the war. \\n Cinderella knows Friedrich is not all he appears to be, but can she trust him with her country and her heart? \\n CINDERELLA AND THE COLONEL is fairy tale retelling of love, sacrifice, adventure, and magic. It is filled with humor, deception, and clean romance, and it belongs to the top selling series, TIMELESS FAIRY TALES. The books in this series take place in the same world and can be read all together, or as individual, stand-alone books.\\n","cover":"https://allnovel.net/images/cinderella-and-the-colonel-timeless-fairy-tales-3.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:48:02 PM"}}
