{"id":83214,"no":40,"title":"Page 40","content":"“I’m working on her,” Friedrich said. “She’s softening to Erlauf. Some.” “When do we get to meet her?” Merrich asked. “Not for a long while,” Friedrich said. “I don’t want you scaring her off.” “I’m hurt,” Merrich said before taking a swig of his drink. “I can’t believe you brought her by the camp when I wasn’t there,” “You took her to the First Regiment’s camp?” Diederick asked. Friedrich nodded. “Yes.” “Part of his plan to soften her,” Merrich said. “I see,” Diederick said. “I think he’s just acting like a besotted fool,” Merrich said. “I am not besotted.” “Then why are you pouting over being called Fred?” “…” “And that is my point,” Merrich said with an irritating amount of superiority. Friedrich rolled his eyes. “You’re just…,” he trailed off when he saw a head of shockingly brilliant red hair. “This is the historic district of Alzette. The Great Erlauf architect Filibert Frejem designed it over a hundred years ago with the purpose of stimulating commerce. He made revolutionary changes that allowed for shops to be placed close together, with limited fire hazards.” There was no mistaking that mop of red hair. And even though she was mostly blocked by a group of Erlauf soldiers, Friedrich could never forget the white flag she waggled above her head. It was Cinderella. All the soldiers with her were from the First Regiment. Friedrich thought he saw Ivo and Kurt among the crowd, perhaps even Gustav. “I’m just?” Merrich prompted. “Uhhh,” Friedrich said. Diederick turned in his chair to see what Friedrich stared at. “Oh, is that—,” “If you will excuse me, gentlemen, I must leave for a moment. I will return for more drinks, you can be sure,” Friedrich said, standing up so quickly his chair was thrown to the ground. “Keep him here,” Friedrich said to Diederick as Merrich righted the chair. “As you wish,” Diederick said. “You’re a good man,” Friedrich said, slapping him on the back before he hurried after Cinderella and his men. He caught up with them when they made a turn, heading towards the Trieux Royal Library. “Down this road we have—,” Cinderella said. “Isn’t this a sight,” Friedrich said, darting in front of them. “My Lady Love and my underlings,” he said, glowering at his men. They sheepishly scuffed their boots on the ground but said nothing. “Good afternoon, Friedrich. Do you ever work? I’m starting to suspect you don’t,” Cinderella said. Friedrich nonchalantly adjusted his eye patch. “I thought we agreed you were finished with historical tours.” “Yes, perhaps. But these fine gentlemen are soldiers. Your soldiers. I couldn’t be safer anywhere else than I am with them. And besides, they asked so sweetly. Marie said they saw the sign in one of Armel’s stores and asked for a tour with all due niceties and polish.” Friedrich looked from Cinderella to his men. “And the lot of you were filled with the sudden thirst for history lessons, I suppose?” Gustav nodded passionately. “Yes, sir,” he said. “We wanted to experience what you so deeply enjoyed on your tours with Lady Lacreux.” Another soldier smacked the back of Gustav’s head. “What he means to say,” Ivo drawled. “Is he never knew Erlauf history was entrenched so deeply in Trieux.” The rest of the tour attendees nodded in agreement with Ivo. Friedrich sighed and pinched the bridge of his nose. “He’s being selfish by trying to keep all this historical knowledge to himself,” Cinderella murmured. “I heard that,” Friedrich said. “You were meant to,” Cinderella said with a smile as sweet as fresh baked pastries. “I suppose even if I tried to stop this, you would not stand for it?” Friedrich asked. “I would want them to get their money’s worth, else I would feel terrible,” Cinderella said. Friedrich studied his men with his stoniest look. Kurt and Ivo stood strong, but Gustav and a few others shivered. “Just this once,” he said to them. “Never again. Tell anyone back at camp with the same harebrained scheme: NO.” “Yes, sir,” his men said, saluting him. “Well then, let us continue. As I was saying, down this road one may find the historical building of Volognex.” “Oohhhh,” Gustav said in appreciation. “Quite so. It is famous because…,” Cinderella’s voice trailed out of hearing range as the soldiers trailed after her like a herd of attentive cows. Friedrich adjusted his hat. “I want them to like her. I want her to like them,” he repeated to himself. He groaned as he headed back to his friends. “Who am I kidding? Diederick is right. She is a firecracker.” Chapter 9","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-40.html","bookId":1806,"book":{"id":1806,"title":"Cinderella and the Colonel (Timeless Fairy Tales #3)","description":"Storyline: Scratching out a living in a land recovering from war and a hostile takeover, Cinderella—an orphaned, destitute duchess—is desperate to save her lands and servants in spite of the terrible taxes placed upon her by the Erlauf queen, even if it means she must don servants’ clothes and work like a commoner. Her sacrifices aren’t enough, and when a mountain of debt is levied against her, she is given one season to produce the funds. Cinderella realizes it is only a matter of time before she loses everything she has struggled to protect, and it seems that all is lost until she is befriended by the debonair Colonel Friedrich—a member of the Erlauf military and a citizen of the oppressing country that rules her homeland. From helping her break into the royal library to saving her from a rogue mage, Friedrich draws her closer and challenges her mindset of the queen and the war. Cinderella knows Friedrich is not all he appears to be, but can she trust him with her country and her heart? CINDERELLA AND THE COLONEL is fairy tale retelling of love, sacrifice, adventure, and magic. It is filled with humor, deception, and clean romance, and it belongs to the top selling series, TIMELESS FAIRY TALES. The books in this series take place in the same world and can be read all together, or as individual, stand-alone books.","cover":"https://allnovel.net/images/cinderella-and-the-colonel-timeless-fairy-tales-3.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:48:02 PM"}}
