{"id":83227,"no":53,"title":"Page 53","content":"“She is fine, just feeling a bit peckish,” Lady Klara said with her usual lack of audible compassion. “Must you retrieve a supervisor to approve the debt payment plan?”\n “No. My word is more than plenty,” Lord Diederick said, perhaps a little affronted.\n Cinderella closed her eyes, barely listening to the conversation. She felt ashamed. To think she considered fleeing to Windtop, even if it was for a brief moment. I don’t deserve their loyalty. I have done nothing to warrant it.\n “Cinderella, your signature as witness is required,” Lady Klara said.\n Cinderella bit her lip and pushed the feelings aside. “Yes, I apologize,” she said, discreetly brushing tears from her eyes before she fixed a pleasant smile on her face. “Where do I sign?”\n “Here,” Lord Diederick said. “Read the agreement before signing.”\n Cinderella did as he advised and saw nothing alarming. In fact, to her surprise, Lady Klara noted that any surplus profit from Windtop would be used against Aveyron’s land tax.\n “You will hold all paperwork pertaining to Windtop Manor?” Cinderella asked.\n “Until it is sold, yes. Strictly speaking, the fine will not be collected until after the sale. Holding the deed will assure the crown of future compensation.”\n “How fast must Windtop Manor be sold?” Cinderella asked.\n Lord Diederick tapped a spot on the paper. “You have one year. If it fails to sell in that time, the crown will seize Windtop itself as reimbursement for the debt.”\n “That seems reasonable,” Cinderella said. She hesitated a moment longer before she signed the document, freeing Aveyron from Queen Freja’s grasp.\n “Thank you for your valuable time, Lord Diederick,” Lady Klara said, standing.\n “Of course, it is my pleasure to assist you,” Lord Diederick said, pushing away from his enormous desk so he could stand and bow.\n “I’m sure,” Lady Klara said before she curtsied. “I will see you at home, Cinderella.”\n “Yes, Step-Mother,” Cinderella said, following her out of the room.\n “Duchess Lacreux,” Lord Diederick called.\n Lady Klara forged ahead, heedless of the call, but Cinderella paused in the threshold of the lord’s office. “Yes?”\n “I am glad your financial situation is resolved,” Lord Diederick said. “I am a close friend of Colonel Friedrich’s. He was…concerned for you.”\n “I see. In that case, I am pleased to make your acquaintance, Lord Diederick,” Cinderella said.\n Lord Diederick bowed again. “The pleasure is mine. In the future, I hope to see you for less…personal circumstances.”\n Cinderella awkwardly nodded. “I agree,” she said, not certain if she meant it. “If you will excuse me, Lord Diederick.”\n “Certainly. Good day to you, Lady Lacreux.”\n “Good day, Lord Diederick.”\n “So, she is free, now,” Diederick said. “For better or for worse, she has squirmed out from the pile of debt and is influence free,” he said before tossing back the rest of his drink.\n Merrich leaned forward to avoid the exuberant jubilation of three farmers seated at the table behind him. “You are giving her quite a long leash. Is that wise?”\n “I don’t want her leashed at all,” Friedrich said. “I want her free.”\n “That sounds terrifying,” Merrich said.\n “It is,” Friedrich said, tracing the rim of his tankard with a thumb. In spite of the uproar in the pub—everyone in the room was drunk or halfway there, excluding Friedrich and his friends—Friedrich retained an aura of intense clarity. “But I want her. And if we’re all to survive this, the country needs her free. I can’t hold it together, not with my duties in the Army. She must be the one to do that.”\n “So the Veneno Conclave representatives had nothing helpful to say, I take it?” Diederick asked.\n Friedrich shook his head and scratched at his eye patch. “They spoke not at all of the magical mishaps taking place worldwide. The Conclave is scared—you can see it in the way the representatives avoid speaking of the sudden outbreak of cursed royalty and the increase in sightings and skirmishes with dark creatures and users of black magic. I think the Conclave means to ignore the problem because they cannot solve it, and they are terrified to admit it.”\n “How can they ignore it? Even if one excludes the creatures, it is indisputable that the royal class is under attack. Prince Severin—restored as he may be—was attacked in his family’s palace and cursed there. There are the twelve princesses of the south no one can seem to cure, and aren’t we still waiting to see if the Sole princess cursed to sleep will slide through her birthday?”\n “If the representatives refused to talk about the dark tide of magic, what did they speak of?” Diederick asked.\n “A lot of pretty things, but mostly they communicated their unhappiness with us for taking over Trieux,” Friedrich said. \n","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-53.html","bookId":1806,"book":{"id":1806,"title":"Cinderella and the Colonel (Timeless Fairy Tales #3)","description":"Storyline: \n Scratching out a living in a land recovering from war and a hostile takeover, Cinderella—an orphaned, destitute duchess—is desperate to save her lands and servants in spite of the terrible taxes placed upon her by the Erlauf queen, even if it means she must don servants’ clothes and work like a commoner. \n Her sacrifices aren’t enough, and when a mountain of debt is levied against her, she is given one season to produce the funds. Cinderella realizes it is only a matter of time before she loses everything she has struggled to protect, and it seems that all is lost until she is befriended by the debonair Colonel Friedrich—a member of the Erlauf military and a citizen of the oppressing country that rules her homeland. \n From helping her break into the royal library to saving her from a rogue mage, Friedrich draws her closer and challenges her mindset of the queen and the war. \n Cinderella knows Friedrich is not all he appears to be, but can she trust him with her country and her heart? \n CINDERELLA AND THE COLONEL is fairy tale retelling of love, sacrifice, adventure, and magic. It is filled with humor, deception, and clean romance, and it belongs to the top selling series, TIMELESS FAIRY TALES. The books in this series take place in the same world and can be read all together, or as individual, stand-alone books.\n \n","cover":"https://allnovel.net/images/cinderella-and-the-colonel-timeless-fairy-tales-3.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:48:02 PM"}}
