{"id":83234,"no":60,"title":"Page 60","content":"It was over in the time it took Cinderella to turn around. The mage was dead, speared by the pitchfork-wielding Erlauf man.\\n\\n “He’s dead,” Ivo said in disgust. “The Colonel will be angry. I’m sure he would have wanted to question him.”\\n\\n “It was our fault for failing to hold him,” Ivo’s companion soldier said.\\n\\n Cinderella retreated several steps and averted her eyes from the gory sight. “Thank you, sir,” she said, to the ox-man, her voice shaking.\\n\\n “He was right,” her rescuer said.\\n\\n “Pardon?”\\n\\n The ox-man kicked the dead mage as soldiers trooped down the road. “We hate,” the ox-man said.\\n\\n Cinderella opened her mouth to reply, but the ox-man continued, “But that doesn’t mean there’s no hope,” he said, turning around to watch the injured Erlauf woman stand unsteadily. “Not when a Trieux lady is willing to risk ‘er life for an Erlauf woman.”\\n\\n Cinderella smiled wanly. “And not when an Erlauf man risks his neck for a Trieux lady.”\\n\\n The ox-man bobbed his head, and then the soldiers were on them.\\n\\n The lieutenant of the squadron and an accompanying captain were riding horses. Ivo picked Cinderella up and tossed her on the captain’s horse before she noticed how close the animal was.\\n\\n “Gather the mage’s body. We will meet you at camp,” the captain said.\\n\\n “Yes, sir,” Ivo said with a smart salute.\\n\\n The captain and lieutenant exchanged nods before cuing their horses into a canter. Cinderella clung to the captain and his horse as the city bounced past. There was more than one close call when they almost ran into a wagon or loose animals, but the officers would not slow their pace.\\n\\n Before Cinderella could believe it, they were riding into the First Regiment’s camp. “Attack, attack on Lady Lacreux,” the lieutenant shouted.\\n\\n “Oh, dear,” Cinderella said, her stomach gurgling from the crazed ride and the image of the violently killed mage dancing in her mind.\\n\\n “Have no fear. You’re safe now, Lady,” the captain said, sliding off his horse before helping her down.\\n\\n “No, that’s not it,” Cinderella said, her head swimming.\\n\\n “Cinderella?” Friedrich shouted. His voice was pinched, and he broke through the ring of soldiers surrounding Cinderella.\\n\\n “Are you hurt? What happened?” Friedrich asked.\\n\\n “Friedrich,” Cinderella gasped.\\n\\n “Yes?”\\n\\n “I’m sorry, but I think I’m going to be sick again.”\\n\\n Cinderella was curled like a cat on the thin pallet she had dragged to the spot of sunshine at the window. The heat and light caressed her, driving back the nightmares of the mage attack.\\n\\n The door to Friedrich’s office opened. Cinderella opened an eye to watch Friedrich duck past Ensign Kurt.\\n\\n Cinderella yawned and sat up, ringed by a halo of sunlight. “You have questions for me?”\\n\\n Friedrich crouched down in front of her and placed a hand on her cheek. “Sorry, Pet, but the more we learn, the safer you will be,” he said, leaning forward so his forehead touched hers.\\n\\n Cinderella pushed Friedrich back with a finger. “There’s not much to tell,” she said. “I left Marie’s and noticed I had a tail—and he wasn’t one of yours. He chased me, and I hid, intending to steal my way to the nearest patrol point. I think it irritated him because that was when he found the Erlauf woman. Somehow, he froze everyone on the streets, and I was the only one available to help the poor woman.”\\n\\n “So, you attacked him,” Friedrich wryly said.\\n\\n “Yes.”\\n\\n “By flinging yourself off a roof.”\\n\\n “Ivo was proud of me for that part.”\\n\\n Friedrich held his tongue, but the look he gave Cinderella said he was not impressed.\\n\\n “Maybe next time I’m attacked I shouldn’t run? I did it automatically—because of the library and everything—but it seems I ran so fast, I left Ivo and his compatriots behind.”\\n\\n “No,” Friedrich said. “The mage identified them before you came out of Marie’s house and froze them in place. It was good you ran—you took him so far away, they were out of the range of his magic and recovered.”\\n\\n “Why didn’t the mage freeze me in place as he froze everyone else?”\\n\\n “I assume he tried, Pet, but because you wear my token of devotion he couldn’t,” Friedrich said.\\n\\n Cinderella narrowed her eyes. “Friedrich, now is hardly the time—.”\\n\\n “I’m completely serious,” Friedrich said. “The necklace isn’t a bauble I found in the market. It’s laced with magic.” \\n\\n","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-60.html","bookId":1806,"book":{"id":1806,"title":"Cinderella and the Colonel (Timeless Fairy Tales #3)","description":"Storyline: Scratching out a living in a land recovering from war and a hostile takeover, Cinderella—an orphaned, destitute duchess—is desperate to save her lands and servants in spite of the terrible taxes placed upon her by the Erlauf queen, even if it means she must don servants’ clothes and work like a commoner. \\n Her sacrifices aren’t enough, and when a mountain of debt is levied against her, she is given one season to produce the funds. Cinderella realizes it is only a matter of time before she loses everything she has struggled to protect, and it seems that all is lost until she is befriended by the debonair Colonel Friedrich—a member of the Erlauf military and a citizen of the oppressing country that rules her homeland. \\n From helping her break into the royal library to saving her from a rogue mage, Friedrich draws her closer and challenges her mindset of the queen and the war. \\n Cinderella knows Friedrich is not all he appears to be, but can she trust him with her country and her heart? \\n CINDERELLA AND THE COLONEL is fairy tale retelling of love, sacrifice, adventure, and magic. It is filled with humor, deception, and clean romance, and it belongs to the top selling series, TIMELESS FAIRY TALES. The books in this series take place in the same world and can be read all together, or as individual, stand-alone books.\\n","cover":"https://allnovel.net/images/cinderella-and-the-colonel-timeless-fairy-tales-3.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:48:02 PM"}}
