{"id":83239,"no":65,"title":"Page 65","content":"“There is no time like the present. Isn’t there a ball coming up? I nearly drowned in the invitations when the queen learned I was here,” Sybilla said. “It is tonight,” Angelique said. “Perfect! There you have it—a ball is a public party. You will freely be able to approach the queen, or at least a member of the royal family,” Sybilla said. “Yes,” Cinderella said, warming to the subject. “If the ball is being held now, you ought to go change so you may leave as soon as possible,” Sybilla helpfully added. Cinderella blinked. “I haven’t any dresses suitable for the occasion. My step-sister said I could borrow something of hers—though she is taller than me,” Cinderella frowned. “I know—I can walk to Werra and borrow something from Marie.” “Borrow? Borrow? Goodness, no. There will be no borrowing of ball gowns tonight,” Sybilla said, shivering as if the word was dirty. “Than what am I to wear?” “I can help you,” Angelique said, standing up. Her dress was spotless and perfect even though she should have wrinkled it while sitting on the ground. “I am a little skilled in alteration magic. If you do not mind the wait, I should have something suitable in a minute or two.” “In that case, please excuse me, so I may wash,” Cinderella said, shakily rising. She ran to the well and scrubbed at her hands, face, and neck. She poked her head in the kitchen, looking for some of Aveyron’s servants, but they were nowhere to be found. Cinderella looked through the chateau for a few minutes before she gave up and rushed back to the enchantress and fairy godmother. “Ahh, there she is,” Sybilla said, clapping her hands. “Please hold still for a moment, Duchess Lacreux,” Angelique said. She walked a circle around Cinderella, first brushing Cinderella’s chin-length hair. Immediately Cinderella’s head was heavy with hair as her long, scarlet locks draped to her elbow. As if it had a mind of its own, her hair started moving, braiding small tendrils that pinned themselves to the crown of her head with pearl-topped pins and white roses the size of a thumbnail. When Angelique touched the sleeve of Cinderella’s dress, the fabric changed to a beautiful shade of snow-white silk. The changed fabric bloomed across Cinderella, rearranging itself as it moved, and grew until Cinderella had a full-skirted dress that brushed the ground. The tops of her shoulders were bare, but a stretch of pale, storm-gray fabric skirted around the top of Cinderella’s dress and glided around the sides of her arms before fastening in the back. A similar shade of fabric gathered at the waist, held in place by a string of pearls. Gloves the same storm-gray as the highlighter fabric encased her hands and ran up to her elbow. Pearl bracelets appeared on her wrists, and a pearl necklace with a diamond shaped like a heart draped across her chest and fastened itself at the back of her neck. “It is a masquerade ball, yes?” Angelique asked. “Yes,” Cinderella said. “Then you will need this,” Angelique said, brushing her palms together. As she slid her hands apart she revealed a mask—covered with white silk and storm-gray lace—that would cover Cinderella’s nose and circle around her eyes—just as Mariska’s mask did. She handed it to Cinderella, who held it close to admire the lace pattern. “And for the final touch,” Angelique said, placing the glass slippers she held on the ground. “I couldn’t,” Cinderella protested. “Please,” Angelique smiled. “They are not what I was searching for, and I have no use for them.” “I cannot thank you enough,” Cinderella said, sliding her feet into the shoes. They were surprisingly comfortable—as if made of pillows of water rather than glass. “You have helped me beyond what I could have dreamed of. Is there nothing I can do for you?” The Lady Enchantress shook her head. “It is the duty of those of us gifted with magic to use it for whatever good purposes we can find. I am pleased I could help you.” Cinderella shyly brushed the fabric of her dress. “Thank you,” she said, her cheeks turning light pink. “Now, shall we call for your footmen and carriage?” Sybilla asked, eagerly clapping her hands. Cinderella smiled uneasily. “I will walk.” Sybilla blinked. “Walk?” “Aveyron does not have a carriage, and I cannot use the horses. They have worked all day and are likely to be eating their evening hay.” Angelique cleared her throat and thoughtfully looked away. Sybilla gaped, her jaw hanging. “No carriage?” she repeated. “No.” “Humph. We shall fix that—temporarily at least,” Sybilla said. She turned and studied the goats. “No, but I will be back for you later,” she said to the unconcerned livestock. “Cows—oh goodness no. You can hardly have spotted horses. Sheep? Too stupid. Hmm, I know. Attention, creatures. This young lady is in need of some assistance to reach a ball. Are there any volunteers?” Aveyron was silent.","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-65.html","bookId":1806,"book":{"id":1806,"title":"Cinderella and the Colonel (Timeless Fairy Tales #3)","description":"Storyline: Scratching out a living in a land recovering from war and a hostile takeover, Cinderella—an orphaned, destitute duchess—is desperate to save her lands and servants in spite of the terrible taxes placed upon her by the Erlauf queen, even if it means she must don servants’ clothes and work like a commoner. Her sacrifices aren’t enough, and when a mountain of debt is levied against her, she is given one season to produce the funds. Cinderella realizes it is only a matter of time before she loses everything she has struggled to protect, and it seems that all is lost until she is befriended by the debonair Colonel Friedrich—a member of the Erlauf military and a citizen of the oppressing country that rules her homeland. From helping her break into the royal library to saving her from a rogue mage, Friedrich draws her closer and challenges her mindset of the queen and the war. Cinderella knows Friedrich is not all he appears to be, but can she trust him with her country and her heart? CINDERELLA AND THE COLONEL is fairy tale retelling of love, sacrifice, adventure, and magic. It is filled with humor, deception, and clean romance, and it belongs to the top selling series, TIMELESS FAIRY TALES. The books in this series take place in the same world and can be read all together, or as individual, stand-alone books.","cover":"https://allnovel.net/images/cinderella-and-the-colonel-timeless-fairy-tales-3.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:48:02 PM"}}
