{"id":83242,"no":68,"title":"Page 68","content":"The Major swept her into the dance—which was, surprisingly, a dance Cinderella recognized as originating in Loire. It was simple, thank goodness. All Cinderella had to do was hold her dress with one hand and the Major’s shoulder with the other.\n The Major was a competent dancer. He swept Cinderella across the floor, keeping time with the other dancers.\n Attempting conversation seemed awkward, so Cinderella allowed herself to be silently guided along. When the song finished, she dipped in an elegant curtsey.\n “Thank you for the dance,” Cinderella said.\n “Thank you, Lady,” the major said, bowing over Cinderella’s gloved hand and kissing her knuckles.\n After Cinderella reclaimed her hand she muttered, “Perhaps I have not given Friedrich enough credit. Maybe all Erlauf men are the grabbing type.”\n She directed her attention to the line of those waiting to address Queen Freja. The queue curled around the stairs. “Still too long, back to the refreshments,” Cinderella said.\n When she turned around, she nearly smacked into an elegantly dressed male.\n “I apologize. I did not look to see where I was going,” she said.\n “No harm done,” the man—he was perhaps a decade older than Cinderella—said, straightening his jacket. “Skirts, I have been told, could almost be considered a weapon. Would you care to dance?”\n “Certainly, thank you,” Cinderella said, once again allowing herself to be pulled into a dance.\n Her second time on the dance floor was slightly more difficult, as it was an Erlauf dance Cinderella rarely took part of. She did not mind the lack of conversation as she focused on moving her feet.\n The beat was faster, and by the end of the song, Cinderella knew she was flushed.\n “Thank you, Lady, for the wonderful dance. You are very skilled,” Cinderella’s partner said when it was over.\n “You are too kind,” Cinderella said, breathing heavily. “But I thank you for the compliment, and for the dance,” she curtsied.\n “The pleasure was all mine,” the man said, kissing Cinderella’s knuckles like her previous partner.\n Glad she was wearing gloves, Cinderella glanced at the line to the throne—it was still long—before she slipped through the crowd, making her way towards a patio.\n “Lady, I beg you to forgive my impertinence, but would you grant me the pleasure of dancing with me?”\n Cinderella almost ignored the request—he couldn’t possibly be talking to her—before she realized she was the only one standing near the man—a middle-aged soldier. He looked to be in his late forties or early fifties. It was difficult to guess thanks to his half mask. His uniform was…different.\n Cinderella couldn’t put her finger on it, but the cut of his jacket was unusual, and he wore no identifying badges or medals.\n “Of course,” Cinderella said, allowing herself to be led back to the dancers and musicians.\n “What do you think of the ball?” her companion asked.\n “It is lovely,” Cinderella said.\n “What do you enjoy most? The dancing?”\n “The food. It is exquisite,” Cinderella said with feeling.\n Cinderella’s dance partner released a bark of laughter, drawing glances from some of their fellow dancers.\n “I am glad to hear you think so,” the man said.\n Cinderella noticed that as they swept past a group of soldiers, the men saluted.\n Am I dancing with a general?\n “The music is skillfully played, of course, and everyone is dressed beautifully,” Cinderella added, slightly insulted by the humor he found in her choice.\n “And what of the venue?”\n “No one can say the Trieux Palace is not grand.”\n “And the throne?”\n Cinderella was silent for a few beats. “It is mostly an eyesore,” she admitted.\n The solider—or in all likelihood, officer—smiled at Cinderella. “It is certainly gaudy. You could feed an army for at least a few months with the funds that monstrosity cost.”\n “Or you could buy a year’s supply of seed and hay. Perhaps more,” Cinderella said almost dreamily.\n “You seem like you’ve got a good head on your shoulders,” Cinderella’s dance companion said, his voice colored with approval.\n “Thank you, sir. I would like to think I do.”\n They chatted for a few minutes more, until the dance was over and they parted ways.\n “Thank you for the splendid dance, sir.”\n “No, thank you, Mademoiselle. You have done me a great service,” the officer said. He bowed over Cinderella’s hand but did not touch it with his lips. He clicked his heels, nodded at her, and disappeared in the crush of the crowd.\n Encouraged by the fun, Cinderella once again tried to fight her way to the refreshments. Halfway there, another young man found her and begged her for a dance. \n","sourceLink":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3/page-68.html","bookId":1806,"book":{"id":1806,"title":"Cinderella and the Colonel (Timeless Fairy Tales #3)","description":"Storyline: \n Scratching out a living in a land recovering from war and a hostile takeover, Cinderella—an orphaned, destitute duchess—is desperate to save her lands and servants in spite of the terrible taxes placed upon her by the Erlauf queen, even if it means she must don servants’ clothes and work like a commoner. \n Her sacrifices aren’t enough, and when a mountain of debt is levied against her, she is given one season to produce the funds. Cinderella realizes it is only a matter of time before she loses everything she has struggled to protect, and it seems that all is lost until she is befriended by the debonair Colonel Friedrich—a member of the Erlauf military and a citizen of the oppressing country that rules her homeland. \n From helping her break into the royal library to saving her from a rogue mage, Friedrich draws her closer and challenges her mindset of the queen and the war. \n Cinderella knows Friedrich is not all he appears to be, but can she trust him with her country and her heart? \n CINDERELLA AND THE COLONEL is fairy tale retelling of love, sacrifice, adventure, and magic. It is filled with humor, deception, and clean romance, and it belongs to the top selling series, TIMELESS FAIRY TALES. The books in this series take place in the same world and can be read all together, or as individual, stand-alone books.\n \n","cover":"https://allnovel.net/images/cinderella-and-the-colonel-timeless-fairy-tales-3.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/cinderella-and-the-colonel-timeless-fairy-tales-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:48:02 PM"}}
