{"id":73589,"no":12,"title":"Page 12","content":"Chapter Eleven\\n\\n Cage\\n\\n For three days she’d been gone. Three very long days. When I’d woke up to find a letter had been left beside my bed I’d been hoping it was a sexy letter letting me know when I would get to be alone with her again. Instead it was a letter telling me that Jeremy was coming to get her and take her to visit his family in Louisiana and that she’d be back in a couple of days.\\n\\n I had been anxious since she left. I knew he was telling her about his plans and it was making me nervous as shit. I didn’t like thinking about her being off somewhere and upset. Reminding myself that Jeremy knew how to deal with her emotions just fine was hard.\\n\\n Low would be here to get me in the morning and I didn’t want to leave without seeing Eva first. I wouldn’t enjoy my day off without knowing she was okay. How did I not have her damn phone number? I’d slept all night with her in my arms and I’d given her an orgasm in the lake. I didn’t normally plan on seeing a girl again so I never asked for their numbers unless they knew the score. Eva didn’t fall into either of those categories. She was… more. I needed her fucking cell number.\\n\\n I stepped out of the shower and wrapped a towel around my waist. Maybe I could call Low and see if she just wanted to do something around here for a few hours. I didn’t have to go check on my apartment. The idea of hanging out with Preston and picking up girls on the beach no longer held the same appeal. Eva Brooks was screwing with my head.\\n\\n I picked up my phone and pressed Low’s speed dial number.\\n\\n “Cage?”\\n\\n “Yeah, you good?”\\n\\n Larissa squealed in the background and started clapping while calling my name.\\n\\n “Someone wants to talk to you, hold on.”\\n\\n Smiling, I waited for Larissa’s little voice. I hadn’t seen her since I came out here. Larissa was Low’s niece. Until Larissa’s father decided to become part of her life I’d helped Low take care of Larissa while Larissa’s mother did other things. At times it was like Larissa was Low’s child. Things changed though once Low’s fiancé, Marcus Hardy, walked into her life. Now, Larissa only came to visit Low when Low asked for her.\\n\\n “Hey Cage,” Larissa said into the phone.\\n\\n “Hey baby girl. You having fun with Low?”\\n\\n “Yes! Martus here too,” she yelled into the phone. She hadn’t figured out yet that she could just speak normally into the phone.\\n\\n “Then I bet you’re getting all kinds of attention. How are all your princesses doing?”\\n\\n “Got a new one! Martus buyed me Media. Her has Low Low’s hair.”\\n\\n I had no idea what that meant but I wasn’t about to tell her that.\\n\\n “You’ll have to show me next time I see you.”\\n\\n Low started talking and Larissa told me, “Bye”\\n\\n “Did you get that thing about the princess’s new hair?” Low asked with an amused voice.\\n\\n “Nope.”\\n\\n “Didn’t think you would. Disney has a new princess. Her name is Merida and her hair is long, red, and curly. It is much messier than mine but Marcus is having entirely too much fun with it. He’s bought Larissa several Merida things and calls her Princess Low instead.”\\n\\n The happiness in her voice made everything that was wrong feel right. She’d been handed one shithole life. Now things had changed and Low had finally found herself a break.\\n\\n “I can’t wait to see this new redheaded princess.”\\n\\n “Hmmm, but that isn’t why you called. What’s up?”\\n\\n “I need,” I turned around to see Eva standing in the doorway with an odd expression. “Uh, let me call you back.” I ended the call and walked over to take Eva’s hand and pull her inside so I could close the door behind her.\\n\\n “Hey, you’re back.”\\n\\n She stared up at me with a softness I wasn’t expecting. “Did I just hear you talk to a little girl about her princesses?”\\n\\n How long had she been standing there?\\n\\n “Yeah, it was Low’s niece, Larissa.”\\n\\n “And you talk to her on the phone about her dolls? I really don’t know you at all, Cage York.”\\n\\n I reached out and wrapped one of her long curls around my finger. I just needed to touch her somehow. “You’re back,” I repeated.\\n\\n She tried to smile and failed. I could see the small wobble in her bottom lip.\\n\\n “What’s wrong?” I asked already knowing this was about Jeremy.\\n\\n A small tear escaped and I quickly swiped it away with my finger. “Jeremy is moving. He needs to. I want him to. I mean he needs to live his life.” She swallowed hard then closed her eyes tightly. “I knew he was moving before he told me. Seeing his apartment and his new life just was a lot to take in. I’m happy for him but I’m going to miss him. I’ll be lost without him.”\\n\\n I pulled her into my arms and she buried her face in my shoulder. The warm tears splashed against my skin and each drop broke my heart. I’d fix this if I knew how. I just didn’t know what to do that could make this any better. Jeremy was her safety net.\\n\\n “It’s just that,” she choked out, “he’s moving on. He’s forgetting.” She stopped herself and pulled back from me. I could see the pain in her eyes and the desire to tell me about Josh. I wanted her to. I wanted to be able to talk to her about it. I hated that she felt like she only had Jeremy to run to.\\n\\n “What’s he forgetting, Eva?” I asked. She’d avoided telling me anything more about the fact she’d taken off her engagement ring. I was trying so hard to keep her from running from me but I needed more now.\\n\\n “The past,” she finally replied. Turning around she reached for the doorknob. Fuck. She was gonna run.\\n\\n “Don’t,” I begged. “Stay. Talk to me.”\\n\\n She didn’t turn back around. Instead, she opened the door and walked away.\\n\\n Eva\\n\\n Cage hadn’t returned until after midnight Sunday night. The only reason I knew this was because the last time I looked at the clock by my bed it said it was 12:05 am. Shortly after, I’d fallen asleep. By the time I got up Monday morning, Cage was already out with the cows. Daddy was having him tag the ones he was sending to the stockyard. I’d gone down to the lake hoping he’d come looking for me but after three hours I realized I’d pushed him too far.\\n\\n He’d been open with me from the beginning. He hadn’t held back anytime I asked him something. I knew so much more about him than he knew about me. That was my fault. How did I tell him about Josh? How did I explain to another guy that losing Josh broke me? How would I deal with seeing the pity in Cage’s eyes when he looked at me? I just didn’t think I could handle it. Jeremy was moving on but I couldn’t.\\n\\n I’d gone back to delivering Cage’s towel and thermos anonymously. He obviously didn’t want to see me. I’d walked out on him when he’d asked me not to go. The pleading sound in his voice haunted my dreams.\\n\\n He wasn’t the hard selfish playboy I’d expected when I first met him. Cage was gentle when he needed to be. The way his voice had gone all sweet when he’d talked to the little girl on the phone and the way he’d so willingly pulled me into his arms without question to comfort me when he realized I was upset proved it.\\n\\n When he’d noticed my ring was missing he’d asked me about it and I’d ignored it and distracted him. He hadn’t pushed for more then either. Cage had put up with a lot from me. He’d had enough.\\n\\n I pulled my legs up so I could wrap my arms around them and rest my chin on my knees. I had grown so pathetic over the past few days just trying to get a glimpse of Cage that I spent more time on the rocker on the porch than I did anywhere else.\\n\\n Gravel crunched and I watched as Becca Lynn’s little red convertible swung into the driveway. She’d stayed away longer than I expected. We had talked very little about Cage before we’d started drinking shots of tequila the night we went out.\\n\\n Today her boots were candy apple red. Almost a perfect match to her car. She’d probably known that when she bought them. Knowing Becca she’d asked to take a boot outside and compare colors so she got it just right.\\n\\n “Well, look at you sitting out here in the rocking chair like you’re sixty years old,” Becca teased as she pranced across the front yard and up the steps.\\n\\n “It’s a nice spot,” I replied, one where I could catch glimpses of Cage.\\n\\n Becca Lynn pursed her red lips, also a pretty dang close match to her boots, together and scanned the yard. “Don’t see your badass help anywhere,” she chirped.\\n\\n “His name is Cage, you know that,” I snapped.\\n\\n Becca swung her gaze back to me. “Oooooh testy. Did you go and get a soft spot for the resident hottie?”\\n\\n “He’s not such a bad guy after all. He didn’t take advantage of you, did he?”\\n\\n Becca stiffened and then shrugged as if she couldn’t care less. “I think he’s probably one of those smoking hot but very gay types. Normally when a guy is that pretty he is too good to be true. My guess is he has an equally beautiful partner back home. Don’t get me wrong, I’m so not a homophobe. I think it would be hot as shit to see. But it’s a shame such perfection doesn’t bat on the right team.”\\n\\n She did not just accuse Cage of being gay because he wouldn’t screw her after just meeting her. I wanted to scream just how not gay Cage was but I controlled myself.\\n\\n “I’ve seen the girl in his life. He isn’t gay,” I informed her. She didn’t have to know Willow was engaged to someone else.\\n\\n Becca frowned, “He has a girlfriend?”\\n\\n Technically, yes. He had a girl who was a friend. “They’ve grown up together. Been together for years.”\\n\\n Becca’s face went sad and it dawned on me what I’d just said. She was thinking about me and Josh. This was the pity I didn’t ever want to see on Cage’s face. I got enough pity from everyone else. Jeremy was the only one who hadn’t pitied me. He’d stood by me and mourned with me but he’d never pitied me.\\n\\n “Jeremy’s going to LSU in the fall,” I blurted out, needing to tell someone and needing to change the subject. I wasn’t in the mood to discuss Josh with her.\\n\\n “Oh, wow.” Becca was watching me closely. She was waiting on me to break down and cry. I’d done that already. For two full days I’d cried every time I thought about him moving on. I was done with the tears. They weren’t tears of sadness over losing Jeremy. They were tears of sadness because he had found a way to move on and I was still stuck, unable to move past Josh.\\n\\n “So, when did you find out?”\\n\\n “Last week. He took me to see his new place. He’s leasing an apartment with his cousin from Jefferson Parrish. He leaves for good next month. He needs to find a job and get settled in before school starts.”\\n\\n “You two gonna be okay apart?”\\n\\n What she really meant was I going to be okay without him. Everyone seemed to understand that Jeremy was ready to get on with his life.\\n\\n “We’ll be fine. Jeremy needs to live.”\\n\\n Becca nodded, “Yeah, he does,” she paused, “and so do you.”\\n\\n I wish I knew how.\\n\\n The rumble of a truck interrupted us and Becca turned from her perch on the railing to watch as Cage pulled up from the pasture.\\n\\n “God, I hope he has his shirt off,” she whispered.\\n\\n I was in agreement with that wish.\\n\\n When he stepped out of the truck he looked our way but quickly shifted his gaze and walked into the barn. He was wearing a white tee shirt that looked a little too small. I wondered if he was wearing it because he had his barbell in.\\n\\n “I’m going to go talk to him. I’ll be back,” Becca announced as she jumped down from the railing and started down the stairs.\\n\\n What if he was changing? What if she saw his pierced nipple? I didn’t want her to see it. It was my secret. I opened my mouth to say something to stop her but I didn’t have an excuse other than I didn’t want to share him. How ridiculous was that? I watched helplessly as Becca Lynn pranced across the yard toward the barn doors. Short of running after her and tackling her to the ground I couldn’t do anything about this. \\n\\n","sourceLink":"https://allnovel.net/while-it-lasts-sea-breeze-3/page-12.html","bookId":1987,"book":{"id":1987,"title":"While It Lasts (Sea Breeze #3)","description":"Storyline: While It Lasts (Sea Breeze #3) \\n Maybe driving home after a few (or more) shots of tequila had been a bad idea, but hell, he did it all the time. The cops had to have been freaking bored to have pulled him over. He wasn’t even swerving! That’s Cage York’s story and he’s sticking to it. \\n Unfortunately, his baseball coach isn’t buying it. Cage has a free ride to the local junior college for baseball -- or he did, until he’d gotten a DUI. Now, Cage has to decide: does he drop out and give up his dream of getting noticed by a college in the SEC, and possibly making it into the Major Leagues -- or does he give in to his coach’s demands and spend his summer baling hay? \\n Eva Brooks planned out her life step by step when she was eight years old. Not once over the years had she lost sight of her goals. Josh Beasley, her next door neighbor, had been the center of those goals. He’d been her first boyfriend at seven, her first kiss at ten, her first date at fifteen, and her first tragedy at eighteen. The moment she’d received the phone call from Josh’s mother saying he’d been killed along with four other soldiers just north of Baghdad, Eva’s carefully planned life imploded in the worst way possible. \\n Cage isn’t real happy with his closet-sized bedroom in the back of a foul smelling barn, or his daily interactions with cows, but he knows that if he doesn’t make his coach happy then he can kiss his scholarship goodbye. Only a sick and twisted man would decide his punishment was to be working on a farm all summer. No hot babes in bikinis waiting to meet a Southern boy to make her vacation complete. Just him and the damned cows. \\n Oh -- and an uptight, snarky brunette with the biggest blue eyes he’s every seen. But she doesn’t count, because as hard as he’s tried to charm her out of her panties - he’s pretty sure she’d rather see him hung from the rafters than let him get a taste of her pretty little lips.\\n","cover":"https://allnovel.net/images/while-it-lasts-sea-breeze-3.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/while-it-lasts-sea-breeze-3.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:27:59 AM"}}
