{"id":107185,"no":17,"title":"Page 17","content":"As summer took hold of the Carpathian Mountains a few more travelers fetched up at Sanctu-Eustachios the Hermit, bearing tales of Huns and refugees in ever-more-colorful details. More refugees straggled into the monastery in groups of three to twenty, seeking the only true asylum to be found in the whole of this part of the mountain range; there had been raids on villages three and four leagues away, but no large company of Huns was seen on the road to the monastery, and no Hunnic scouts wandered this part of the mountains. Encouraged by this apparent indifference of the Huns, another ninety-six people left the protection of the monastery\u0027s double walls and set out southward for Roman-held territory, leaving the monastery unevenly staffed, and the defenders troubled by the loss of men to fight in case of another attack; most of the new arrivals had had their fill of fighting and were set to more commonplace labors.\n Antoninu Neves and Tribune Rotlandus Bernardius strove to integrate their two groups of men, arriving at an arrangement that they hoped would be most likely to work in the event the Huns returned in force. The Watchmen of Apulum Inferior were added to the company of soldiers and mercenaries. Priam Corydon set up a council among his monks to help ease their dissatisfaction with the refugees, promising his followers to enforce stricter codes of behavior on those living within the walls. Four huntsmen from Tsapousso were injured while hunting for wild boar when the animal they sought turned on them; they brought home the boar and were treated by Dom Feranescus Rakoczy Sanctu-Germainios, who occupied a portion of each day digging in the slopes around Sanctu-Eustachios for malachite, which he powdered into medicine and used on those coming to him with injuries; it was not as effective as his sovereign remedy, but it was better than nothing.\n Two days after the refugees\u0027 festivities for the Summer Solstice - which offended the monks, being given over to rowdiness and lasciviousness and other pagan excesses - a lone man riding an ash-colored horse and leading a well-laden bay horse and two mules arrived at the gates of the monastery. He was dark-haired and dark-eyed, dressed in a pallium and trabea of heavy linen, leather braccae decorated with lavish embroidery, and calcea laced from ankle to knee. Although he had no escort, his air was prosperous, and when he presented himself to the warder-monk and Watchman, he offered a handsome sum for admission. \"I prefer to pay for a bed within than to camp outside.\"\n \"Sanctu-Eustachios the Hermit will - \"\n Mangueinic, summoned to the gate for his advice, interrupted, \"Two horses, two mules, no guards. He seems harmless enough. Let him in. If nothing else, he should have news for us. And he says he\u0027s willing to pay.\" He signaled to the Watchman manning the gates to pull them open.\n Once inside, and the gates secured behind him, the stranger dismounted and saluted first the monk, then the Watchman, saying, \"Thank you for admitting me. I am come from Aquileia at the behest of the Roman noblewoman Atta Olivia Clemens, with supplies that may help you in this difficult time. I am her bondsman, Niklos Aulirios, and I bear a greeting from her.\" He spoke the regional dialect with a strong Greek accent, and noticed that he had attracted some attention from the guards in the gate-tower.\n Monachos Egidius Remigos nodded brusquely. \"Give me the greeting from your bond-holder. I will present it to the Priam. You are welcome to Sanctu-Eustachios the Hermit.\" He indicated the leader of the Watch, who stood next to him. \"Mangueinic will see to your housing.\" And with that, he took the letter and the gold coin Niklos proffered with equal disdain for each, then trod off toward the monastery church, saying something under his breath as he went.\n \"Cordial fellow,\" said Niklos.\n \"He\u0027s tired of dealing with the laity.\" Leaning heavily on his crutch, Mangueinic offered Niklos the suggestion of a salute. \"Your animals can be taken to the stable to be unloaded, watered, groomed, and fed. I will show you where you can sleep for the duration of your stay.\" He swung away from Niklos and took his first step away, heading toward the main barn and stable.\n Niklos gave Mangueinic a glittering smile as he took the lead- reins of his four animals in hand, tugging them after him. \"I am told that Dom Feranescus Rakoczy Sanctu-Germainios is here. He is a blood relative of Bondama Clemens; I have messages from her to deliver to him. Perhaps it would be possible for me to share his quarters?\"\n \"Do you know Dom Sanctu-Germainios?\" Mangueinic looked startled.\n \"We have met occasionally over the years,\" said Niklos, who had been restored to life by Sanct\u0027 Germainus more than a century before. \"No doubt he would recognize me, if you wonder at our connection.\"\n \"Dom Sanctu-Germainios is out on the eastern ridge, digging for malachite,\" said Mangueinic, watching Niklos through narrowed eyes. \"But his assistant is in the old chapel. You could tell her you are here, and then wait for the Dom to return and decide what he would like you to do.\" He considered for a long moment. \"It would be easiest if you were to stay with him and the woman in the old chapel.\"\n \"If that is what will suit you, then I will comply, with thanks,\" said Niklos, his face showing the most cordial expression he could muster; he wondered who the woman was. \"If you\u0027ll accompany me to the stable, or direct me where to find it, and whom I should speak with there, I\u0027ll see to the unloading of the mules and horse.\"\n \"There are slaves who will do that,\" said Mangueinic.\n \"No doubt there are,\" said Niklos, maintaining his geniality, but with a touch more decisiveness in his tone. \"Nonetheless, I would prefer to do the task myself.\"\n Mangueinic shrugged. \"Whatever you say, Bondsman. If you seek more work for yourself, who am I to deny you?\" He went on down toward the barn and stable, remaining silent until they reached the stable-yard. \"There are line-stalls within, and paddocks behind. You\u0027ll want to bring them in at night; it may be summer, but wolves and bears and cats are hungry all the same.\"\n \"I\u0027m aware of that,\" said Niklos, stepping into the shadow of the stable, clucking to his animals. \"Come up,\" he said in Latin to the four of them; his ash-colored horse craned his neck, wary of this new place. Then he whinnied, and was answered by a chorus of others from inside and outside the stable. \"Conduct, Vulcan, conduct,\" Niklos admonished him, kissing to him to urge him forward. \"Remember: we are guests here.\"\n Vulcan minced into the alley between the line-stalls, pulling the bay and the mules after him; three slaves rushed forward to help him.\n \"Just tie them and tell me where I may store my tack,\" said Niklos, once again in the local patois, forestalling their efforts.\n \"You may store it atop your chests, once you have unladed them. No one will touch it, or them; we have strict rules here regarding theft,\" said Mangueinic, then scratched his beard, giving Niklos another thorough scrutiny. \"Yes. I\u0027ll leave you to your animals. When you\u0027re finished here, ask one of the slaves to show you to the old chapel, or have anyone point the way.\" He stumped toward the door, then faltered. \"You really do know the Dom, don\u0027t you?\"\n \"Yes; as I said, he and the Bondama are blood relations.\" Niklos was tying Vulcan to a long railing that ran half the length of the middle of the stable. \"I haven\u0027t seen him in some years, but we aren\u0027t total strangers.\"\n \"Very good,\" said Mangueinic, and went back out into the sunlight.\n Niklos separated the leads of his other equines and handed them to the slaves. \"Just secure them. I\u0027ll manage the rest,\" he said. \"What food for them?\" asked the nearest slave.\n \"If you have grain, a handful of grain and a flake of hay for each, in the manger where they\u0027ll be tied. And some raisins, if you have any. They like raisins. For now, a bucket of water for each.\" He patted Vulcan on the neck and went to unfasten his bedroll from the back of the saddle, dropping it onto the ground before loosening the girth and pulling it free from the buckles. The mules - both a version of dun: one butter-colored, one dust, both with charcoal manes and tails - dropped their heads as the slaves tied them to the railing, with enough length in the lead to enable them to reach the full buckets of water set hurriedly beneath the rail. The bay horse whickered as Niklos came to unload his pack-saddle. \"Where do I stack the chests and cases?\"\n \"There,\" said one of the slaves, pointing to a recess in the line of mangers. \"Put your animals on either side of your things.\"\n \"I will; thank you,\" said Niklos, ignoring the surprise in the slaves\u0027 eyes. By the time he finished unpacking, untacking, grooming, feeding, and stalling the horses and mules, a number of residents of the monastery had come by the stable to ask him where he had come from, how his journey had been, and why he had made it; Niklos answered them the same way, with honesty: \"I am here on an errand ordered by Bondama Atta Olivia Clemens, Roman noblewoman, presently living on her estate near Aquileia, who has entrusted me with a message and supplies for her blood relation Dom Sanctu-Germainios.\" By the time he left his horses and mules in their stalls to eat, he was sure almost everyone in the monastery knew his mission, and had begun adding their imaginations to what they knew.\n Leaving the stable, he asked one of Antoninu Neves\u0027 men where he might find the old chapel. The mercenary - a Goth with braids in his orange beard - pointed the way, and in exchange, wanted to know how conditions on the roads were. \"Are there many travelers abroad?\"\n \"Not as many as I have encountered in years past. The Roman roads are in poor repair, but I suppose you know that. Every traveler deplores their condition. The secondary roads are no better; some are much worse. There are four bridges I wouldn\u0027t care to cross between here and Drobetae, and a fifth that I\u0027d use only in dire need.\"\n \"There is a man here from Drobetae,\" the soldier remarked. \"He says much the same thing.\"\n \"I should hope so, unless he\u0027s been here for years, or isn\u0027t being completely candid about himself,\" said Niklos, aware that the inquiry had been a trap to see if he had actually come from the Roman south. \"And I doubt there\u0027ll be much improvement over the next year, not with the Huns continuing their raids. No one would be foolish enough to take work-gangs out.\"\n \"Then you believe they still might come here?\" The mercenary sounded as if this were in question. \"The Huns?\"\n \"Oh, yes,\" said Niklos. \"They have built up a major camp to the northwest of here, at the edge of the plains, or so everyone I met coming from that direction has claimed. They are gathering forces there, enlarging their armies, and recruiting local soldiers to their ranks. They\u0027ve already sacked most of the towns in this quarter of the mountains; they\u0027ll pick off these small valleys at their leisure.\" He started walking toward the old chapel; the mercenary fell in half a step behind him.\n \"So, do you think we\u0027ll have to fight?\"\n \"I fear so, if you remain here,\" said Niklos.\n \"But when? Other places have fallen, but not...\" He gestured to finish his thought.\n Niklos shaded his eyes to look at the small fields and the orchard in the widest separation of the two defensive walls. \"I\u0027d expect the Huns to come in the autumn, after the harvest, to take your crops as well as your animals. They have many mouths to feed, and they aren\u0027t farmers.\" He said this as bluntly as he could, and saw the suggestion of a smile cross the man\u0027s face. \"You want to fight them?\"\n \"Certainly - so we can win,\" he said almost merrily, his hand on the hilt of his Byzantine sword.\n \"Are you sure you will? Be able to defend this place from them?\" Niklos asked. \"I\u0027ve seen what the Huns do to small places like this.\" He made no attempt to suppress a shudder; he had passed through Hunnic devastation only four days ago and the vision of the havoc they had left was still sharp in his mind. \"Other village fortresses had defenders, too, and they\u0027re nothing but rubble now, rubble and ash, with bones strewn through them.\" He had passed through five other such ruins on his travels north; he knew that the monastery would not be able to withstand any concerted attack by the Huns or any other company of barbarians or rogues.\n \"We\u0027ve had some time to prepare ourselves for another onslaught. We\u0027ve turned the time to good use.\" He made the sign used to signal readiness to fight. \"The Huns will be surprised, I think.\" - nodding in the direction of the ancient wooden building with the barrel-dome atop it - \"That\u0027s the old chapel.\"\n \"Thank you,\" said Niklos, and went on with a wave to the mercenary. He studied the thick, weathered planks that made up the walls; its shape was irregular, there were few windows piercing its flanks, and those in the barrel-dome were of old, thick, greenish glass, one or two with jagged cracks running through them. There was a small door in an oblong projection at one end of the building, which Niklos assumed must be a side-door on account of its size, for it was narrow and inconspicuous. He went toward it, whistling so that he would not alarm anyone inside. At the door, he paused, gathering his thoughts, deciding how to introduce himself, and was startled when it opened, and a pale-eyed young woman with a taut, broad-shouldered body and neatly clubbed dark hair, dressed in an embroidered muted-lavender linen palla over blue femoralia, stepped out, taking her stance directly in front of him.\n \"Yes?\" she demanded, meeting his gaze squarely.\n \"I am - \"\n \"A stranger, yes, so I\u0027ve been told. You\u0027ve come to see Dom Sanctu-Germainios. He isn\u0027t here.\"\n \"I understand that,\" said Niklos. \"May I wait for him?\"\n \"If you like,\" she said. \"But not alone with me; they think enough ill of me already.\" She stepped back and closed the door with an emphatic bang.\n Niklos stood looking at the door with a mildly distracted air, doing his best to pay no heed to the many eyes turned on him or the occasional whispers of those who were watching him. He took a little time to walk around the building. He noticed it was older than the rest of the monastery, and that suggested to him that this place was yet another ancient shrine adopted by the Christians as one of their own; this part of the world, as he had seen, was strewn with them. The large doors at the end of the chapel convinced him of it; worn carvings of vines and flowers and flowing water adorned the ancient oak. He was about to proceed around the rest of the structure when he heard his name called. Turning toward the sound, he saw Sanctu-Germainios , in a black cotton pallium, black femoralia, and peri, all dusty, coming toward him, a sack slung over his shoulder, a wide- bladed trowel in his hand. \"Sanct\u0027 Germain!\" he called out in Latin.\n \"Niklos! What an unexpected arrival!\" Speaking the same language Sanctu-Germainios came up to him and clapped his shoulder. \"I need not ask what brings you here.\"\n \"Olivia,\" said Niklos unnecessarily. \"I have a few things with me she thought you would want to have. And three letters, one from Rogerian ... Rugierus. It arrived shortly before I left Aquileia. She said you\u0027d want to have it, along with all the rest she ordered me to bring.\"\n \"How ... how very like her,\" said Sanctu-Germainios, slipping the sack off his shoulder and lowering it to the ground with a noisy thunk. \"What things are these, that you have brought?\"\n \"They\u0027re in the stable. Earth, medicaments, bandages, clothes. Money.\"\n Sanctu-Germainios nodded. \"All very practical and all much needed. I thank you profoundly for bringing them here.\" He smiled, but the smile faded rapidly.\n \"Part of your preparations for resistance?\" Niklos guessed.\n \"A very crucial part, much of which are in short supply,\" Sanctu-Germainios said. \"Without an athanor, I have had to rely on my stores of medicaments and gold; both are running low.\" He shrugged. \"What do you think of our fortifications?\"\n \"Outer wall reinforced, with raised battlements for the soldiers inside, the plantations and orchards between it and the inner wall built up and strengthened, giving the crops a measure of security in an attack,\" Niklos mused aloud. \"You\u0027re making plans to hold the Huns off, I understand?\"\n \"Yes.\" He paused. \"At least while there are people here to protect.\"\n \"They slip away, don\u0027t they?\" Niklos observed.\n \"By twos and threes, some of them, and in groups of fifty and more, carrying their goods on the backs of their horses and goats,\" Sanctu-Germainios confirmed. \"They go into the forests, along the hunters\u0027 tracks to small villages, and abandoned towns, and from there, toward the old Roman fortress-towns.\" He turned away. \"Some go to the Huns, of course.\"\n \"Of course,\" said Niklos.\n \"I think the greater number still try for Roman territory,\" said Sanctu-Germainios, \"but that may change. Others arrive, but in smaller numbers, and many of them pass on to the west and the south.\"\n \"The company of refugees who told me where I might find you were heading for Viminacium. I encountered them in a fortified village near Drobetae called Sisincum.\" Niklos paused. \"They said you had agreed with the Watchmen of Apulum Inferior that the town couldn\u0027t be defended and had decided to come here, at least for a time. They said they had decided to make for Verona. I don\u0027t know how many of them actually reached their destination.\"\n Sanctu-Germainios gave a single laugh. \"How could you know? How could any of us?\"\n \"Apulum Inferior faced the same dangers as Porolissum,\" Niklos pointed out. \"Olivia took your advice and left. And good thing, too, as it turned out.\"\n The side-door of the old chapel swung open and Nicoris said, \"I heard voices.\"\n Sanctu-Germainios held out his hand to her and, speaking in the local dialect again, said, \"Nicoris, come out. I want you to meet Niklos Aulirios, an old ... associate of mine.\"\n Nicoris did as she was bade, watching Niklos suspiciously. \"As you wish, Dom Sanctu-Germainios,\" she said, a bit too formally.\n \"He is the bondsman to my blood relative Atta Olivia Clemens,\" Sanctu-Germainios explained. \"He has brought us supplies from Aquileia, from Olivia.\"\n \"And news from Roma and Rogerian,\" Niklos added, and saw Sanctu-Germainios smile.\n \"And where are they, these supplies?\" Nicoris asked, making no apology for her confrontational question.\n \"At the moment they are in the stable, stacked up between a pair each of horses and mules,\" Niklos said affably. \"I\u0027ll bring them up to you whenever you\u0027re ready to receive them.\"\n She studied him carefully, then held the door wide. \"For now, you should come in. Shouldn\u0027t he, Dom?\"\n \"Indeed he should,\" said Sanctu-Germainios. \"I have a great deal to ask him, and better to do it inside, in reasonable comfort, than to stay out here in the sun.\" Little as he wanted to admit it, the sunlight was beginning to wear on him, whittling away at his strength and making him ache from its relentless might; the lining of his native earth in the soles of his peri was nearing the end of its efficacy and would need to be changed shortly.\n \"Thank you, Sanct\u0027 Germain,\" said Niklos in Latin.\n \"It is my pleasure. Mind the right foot,\" he said, stepping over the threshold in the approved way of Imperial Roma.\n Nicoris laughed at this custom, but said nothing as she closed the door behind them and went into the center of the chapel where the room was most light. \"I can get some beer for you, Dom Aulirios, if you would like.\"\n \"I\u0027m not Dom, I\u0027m a bondsman,\" said Niklos. \"And thank you, but I need nothing just now.\"\n \"You might want something to sit on,\" Sanctu-Germainios suggested, still in Imperial Latin. \"That short bench is the best we have to offer. There are pallets stacked up, if you would prefer I get one ready for you.\"\n \"Then I will accept the bench gladly for now,\" said Niklos, adding, \"I may ask for a pallet for the night, or discover if the refugees will grant me a bed in the men\u0027s dormitory, though a fellow with a crutch - I didn\u0027t catch his name - told me I should stay here with you.\"\n \"That would be Mangueinic. He\u0027s leader of the Watchmen from Apulum Inferior, and part of his job is to assign new arrivals to their quarters.\" Very deliberately, he changed to the local dialect; he had seen that Nicoris was growing restive. \"How long have you been on the road?\"\n \"Thirty-four days. Not too bad, considering the conditions.\" Niklos patted his clothes. \"Is there a bath-house here? And a laundry? I can feel the grime all the way to my skin.\" He saw Nicoris out of the corner of his eye; she kept to the shadows, watching him.\n \"There is a small bath-house,\" said Sanctu-Germainios. \"The monks disapprove, but the refugees have demanded it. Mangueinic will arrange for you to use it. There is no laundry, but one of the refugee women will gladly wash your clothes in the lake for a couple of silver Angels.\"\n \"Speaking of coins,\" said Niklos, \"I should probably fetch the sacks of them that Olivia sent to you.\" He got to his feet. \"I\u0027ll return shortly with two of the chests I brought you. No doubt you will be pleased with their contents.\"\n \"Do you need any help?\" Sanctu-Germainios asked.\n \"If you think it wise, come with me and carry one of the chests. We can bring them up here before nightfall.\" He thought again. \"Is there someone whose help it would be prudent to ask? Someone who\u0027s curious enough to want to help?\"\n Sanctu-Germainios chuckled. \"Perhaps one of the Watchmen might be willing to assist us, for a few coins.\"\n \"Naturally,\" said Niklos, trying not to sound cynical, and glanced again at Nicoris. \"Where should we put them?\"\n Before Sanctu-Germainios could answer, she spoke up. \"Next to the hearth, as the Gepidae do. Otherwise the monks might claim you are setting up a pagan altar.\"\n Sanctu-Germainios nodded at once. \"Nicoris is right. The monks are always looking out for signs of paganism. A stack of chests and cases in this chapel would raise their suspicions unless they are at the hearth, where household goods are kept.\"\n Niklos shrugged. \"If that\u0027s what will spare us suspicions, then that\u0027s what we\u0027ll do.\" He smiled at Nicoris, but received only a troubled look for a response. \"It\u0027s what Olivia would do.\"\n Although he was keenly aware of the growing tension between Nicoris and Niklos, Sanctu-Germainios gave no indication of it. \"How is Olivia?\"\n Niklos turned to Sanctu-Germainios. \"Olivia is well, but worried, and not solely for you. She is convinced that neither Ravenna nor Constantinople will risk the men and arms to drive the Huns from these mountains, and that will turn out to be great folly, for which everyone will pay dearly.\" He stretched, beginning to ease the strain of travel from his body. \"She\u0027s already planning to go to Lecco next year.\"\n \"A beautiful place, Lecco,\" said Sanctu-Germainios. \"Surrounded by mountains,\" said Niklos. \"She thinks they\u0027re safer than the plains.\"\n \"She may be right,\" Sanctu-Germainios said, a wry turn to his mouth. \"The monks here believe it.\"\n \"They believe their Christian God protects them,\" Nicoris said.\n \"That\u0027s all they care about. Monachos Anatolios says that the stockades show a lack of faith.\"\n Niklos looked to Nicoris, a quizzical tilt to his brows. \"What\u0027s this?\"\n \"Oh, there is an apocalypticistic hermit living in a cave above the lake,\" Sanctu-Germainios said, and explained Monachos Anatolios\u0027 disputes with the residents of the monastery, and his determination to be a martyr. \"So far few of the monks within the walls have joined with him, but - \"\n \"But they might,\" said Nicoris, frowning fiercely.\n \"Does this hermit have many followers among the refugees?\" Niklos asked.\n \"Not that I know of,\" said Sanctu-Germainios. \"But there may be.\" He started toward the side-door. \"This is not bringing the chests.\"\n Niklos went to him. \" \u0027The sooner begun, the sooner completed,\u0027 \" he said, quoting an old Roman aphorism. As he followed Sanctu-Germainios out of the old chapel, he could almost feel Nicoris\u0027 penetrating gaze on his skin, like tiny, hot flames.\n Text of a letter from Rugierus to Atta Olivia Clemens, written in Imperial Latin in blue paint on scraped vellum, carried by the Eclipse Trading Company ship Magna Mater and delivered thirty- eight days after it was written, then forwarded to Sanctu-Germainios with Niklos Aulirios.\n To the most noble Roman noblewoman, Bondama Atta Olivia Clemens, the greetings of the bondsman to Dom Feranescus Rakoczy Sanctu-Germainios, Rugierus, Ave.\n Bondama Clemens,\n As you must undoubtedly know, I have been detained by the Emperor\u0027s authorities in Constantinople, so that my efforts to rejoin my master in the former Province of Dacia are for nothing. I am suspected, it appears, of aiding the enemies of the Eastern and Western Roman Empires, according to Patras Methodos, a priest of unusual zeal, and an adherence to the minutiae of the law. I understand it is you who has authorized the payment of a bond for my release, from my master\u0027s extensive holdings, and for this I am most appreciative.\n I believe there have been communications sent from you and from my master that have not reached me, and so if I discuss issues that have been addressed already or that may have been resolved, I ask your indulgence for my ignorance: Patras Methodos is a man who is inclined to eke out news to me, when he provides any at all. He has limited the visits of Artemidorus Iocopolis to one every two weeks, and would curtail them more if money were not involved in the Eclipse factor\u0027s visits; there is a donation required for every time Patras Methodos opens the door. I must also assume that all communications that I have been allowed to receive have been read and that all I have sent have also been perused.\n Stories have reached this city that the Huns are breaking through everywhere in the Carpathian Mountains, and because of that, I am taking advantage of your kind offer to receive letters to my master; I must suppose that he is no longer in Apulum Inferior, and might have been driven to any one of a number of havens. If anyone knows where he can be found, it must be you, and so I trust you will send him word that you have heard from me, and that efforts are now under way to end my confinement. Once I have secured my release, if I have heard nothing from him, I will take ship for Aquileia, trusting that you will be able to tell me where my master has gone.\n The amount to secure my release is a large one; I am shocked that Patras Methodos should demand so much money. Let me say that it is my ardent wish that the amount can somehow be reclaimed, at least in part, when it can be proven that the accusations laid against me were false. Until that time, I am most humbly grateful to you for your prompt action on my behalf.\n Rugierus of Gades bondsman to Dom Feranescus Rakoczy Sanctu-Germainios\n on the Feast of Hagia Scholastica, the Christian year 439 \n","sourceLink":"https://allnovel.net/burning-shadows-saint-germain-23/page-17.html","bookId":2505,"book":{"id":2505,"title":"Burning Shadows (Saint-Germain #23)","description":"Storyline: \n Burning Shadows (Saint-Germain #23) \n In Burning Shadows, Yarbro looks at the legendary Huns from the perspective of the people who faced the brunt of their attacks. The vampire Saint-Germain seeks sanctuary at an isolated monastery, unwilling to abandon the hundreds of terrified villagers he has led in flight from the Huns. A few Roman soldiers and some village Watchmen are the monastery\u0027s defense force - and they are undermined by the religious fervor of some of the monks, who argue that since everyone\u0027s fate is in God\u0027s hands, it is foolish to defend themselves. In the hothouse atmosphere of the high-walled monastery, Saint-Germain must take special care when slaking his vampire thirst, for discovery of his True Nature will result in his True Death.\n \n","cover":"https://allnovel.net/images/burning-shadows-saint-germain-23.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/burning-shadows-saint-germain-23.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:04:30 PM"}}
