{"id":15561,"no":2,"title":"CHAPTER I","content":"Introduction; History of Brescello; Birth; Parentage; Education Carbonaro; Piedmontese and Neapolitan Revolutions, 1820-1; I Processi di Rubiera. \n \n The labour attached to the biographer’s task depends on the amount and quality of incident in the career, as well as the peculiar characteristics of the person whose life is portrayed, provided there be a sufficiency of salient points in these respects to have made him conspicuous in the eyes of the world. It would be difficult, both to writer and reader, to follow the career of a conventional country gentleman or clergyman, however diligently and conscientiously either might have discharged the duties alloted to him in his particular sphere. The life of the Curé of Ars, however, although in reality as much hidden from the public eye as that of the most ordinary squire or parson, must ever be reckoned, if only for the psychological study it presents, amongst the most interesting and, from certain points of view, the most instructive of biographies. \n \n 4The subject of the following “Memoirs,” so far as regards the two points above mentioned, would seem to offer most favourable conditions for the pen of the biographer; nevertheless, the writer confesses that the very facility presented has caused difficulties to spring up in his way. Though utterly a novice in such work, an ardent longing has possessed him to write of one with whom he lived for twenty years on terms of the most intimate friendship, little, if at all, inferior in warmth to consanguineous affection. He has deemed it his duty, after duly weighing the many communications received from his friend in hours of confidential intercourse, and regarding them as illustrative not only of the life of the man himself, but in their wider sense as pertaining to contemporary history, and elucidating the opinions of the great statesmen and other notable individuals with whom the subject of this memoir was in daily intercourse—to show forth his life to the world, calling to aid personal memories of the events recorded, original documents in the writer’s own possession or those he could obtain from others, besides information given orally by friends. \n \n That life, chequered even at the outset by struggle and adventure, devoted to incessant activity, and bound up, as it were, with all the stirring public events of the most active period of our age, being of necessity gathered from documents so voluminous as to constitute a veritable “embarras de richesses”—a plethora of material—the mere task of condensation and selection has proved a formidable one; whilst the arrangement of facts following closely on one another has presented at times considerable difficulty. \n \n 5Other causes have stimulated the biographer in his work, inasmuch as he himself was not unconcerned in some of the more important and exciting events of the life which he records. The struggles of oppressed nationalities, the numerous revolutions and changes of dynasty, the intrigues of politicians throughout Europe, the face of which may be said to have been changed during the middle of this century, the varied events at home, and the vicissitudes of the country which his friend had adopted for his own, and for which he evinced unswerving affection and fidelity, have supplied matter which must be treated at some length in order to depict his life in its true light, and to represent adequately the motive power which prompted his ways and actions. \n \n These matters may be but feebly and imperfectly shadowed forth here, and scant justice may possibly have been done to the varied details; nevertheless, these pages will be recognised as an earnest endeavour to sketch the life of a meritorious, able, and—it might without exaggeration be added—in his way a great man. \n \n Where events follow their forerunners with extreme rapidity, where it is sometimes necessary to record circumstances which are simultaneous, it requires the greatest care and discrimination to avoid confusion, and to present the subject clearly to the reader’s mind. The utmost pains have been taken in these volumes to maintain correct chronological order: dates are almost always given, so that no doubt shall arise and no uncertainty exist as to the time of action. Should quotations appear at any time too copious or prolix, the author 6asks the indulgent reader to impute this to his idea of the importance of perspicuity in dealing with an intricate subject. \n \n With these remarks we enter upon our arduous but pleasant task, with a profoundly sincere hope that from a life of so much energy and perseverance, our readers may extract for themselves an example worthy of admiration and imitation. \n \n Men have not lived in vain when, either by indomitable spirit they have left behind encouragement for their fellow-men to enter as keenly as themselves into the battle of life, or have proved in their own persons how strict integrity and undeviating rectitude finally bring their reward; and such an example, we venture to declare, was the subject of this memoir. \n \n In the territory of Modena, on the right bank of the River Po, stands an ancient town formerly called Brixellum or Brexillum, hodie Brescello. Father Bardetti (Lingua dei primi abitatori d’Italia) informs us that the name of “Brescello” is derived from the remote Gallo-Germanic words Brig, a bridge, and sella, to observe. With all due respect to the learned father, to his skill in philology, and to his knowledge of the Gallo-Germanic dialect, our opinion is that the names Brixellum and Brescello are simply the common diminutives of Brixia and Brescia respectively, a town not one hundred miles from Brescello. \n \n However that may be, it is certain that Brescello is a place of most respectable antiquity, for according to Pliny the younger it was a Roman colony, founded during the period of the Republic. It is equally 7certain that Brescello has, from the time of its foundation, undergone as many of the vicissitudes of fortune, and suffered as much from the horrors of war, as many towns of far greater size and importance in the eyes of the world. A brief notice of its history will, however, cause our readers to marvel, not so much at the ruin and destruction which has fallen with such persistent recurrence upon Brescello as at the almost miraculous power possessed by this ph?nix among cities of straightway rising again from its own ashes. \n \n The first event of local historical importance which strikes us is the suicide (A.D. 69) of the Emperor Otho, which took place while he was encamped here, on receiving the news of the total defeat of his army by Vitellius. A tomb erected in the town to the memory of the unfortunate Emperor, for whom we have always entertained a certain amount of sympathy, possibly arising in a great measure from our contempt of his rival, is mentioned by Plutarch as having been seen by himself. \n \n From A.D. 69 to A.D. 388 nothing is known of the history of Brescello. This interval, however, seems to have been one rather of obscurity than of quiet; for the name next occurs in a letter of St. Ambrose, of the last-mentioned date, wherein he speaks of the place as amongst one of the many ruined cities, and ranks it with the equally oppressed towns of Bologna, Modena, Reggio, and Piacenza. It may be conjectured that by the year 452 Brescello must have been wholly rebuilt; for in a letter of Eusebius to Leo I. (St. Leo), commencing “Ciprianus Episcopus Ecclesie Brixellensis,” it is stated that the town not only gave 8name to a see, but was the dwelling place of a bishop. \n \n In the troubled times of the Longobardi it was destroyed by King Autharis, circa. A.D. 585, but even then gave promise of future vitality; for again it was rebuilt, and a monastery existed there in the tenth century. In the year 1099, for the first time, the Castle of Brescello comes to our knowledge, with the addition of fortifications to the town. \n \n It is needless to follow the fortunes of Brescello throughout the wars between the Cremonese and Parmese, of the many horrors of which, and notably those which occurred in the year 1121, it was the scene. The following brief statement of facts will probably supply as much of the history of this much-suffering place as may be desired. \n \n In 1247, while Frederick II. Emperor of Germany was besieging Parma, his ally Ezzellino IV., the Tyrant, took possession of Brescello and Guastalla, in order to deprive the inhabitants of Parma of all means of subsistence, and thus reduce them to submission by famine. During this campaign the first-named town was partially destroyed; but Frederick and Ezzellino made up to a considerable extent for the damage inflicted on the Brescellese by building for them a bridge over the Po. \n \n The Parmese, always the bitter foes of Frederick, retook Brescello two years later—i.e., in the year 1249—and erected important fortifications, which, however, were destroyed in 1251 by the Cremonese, under the leadership of Uberto Pallavicino. \n \n 9Peace was declared two years afterwards, and the conquered town became a portion of Parmese territory. A congress took place here between the Parmese and the Cremonese in 1295, and in 1303 Giberto of Correggio was made Lord of Brescello. This nobleman at once fortified his new possession so strongly that the Cremonese, after a most furious attack, were obliged to beat a hasty retreat. A second bridge was constructed during the same year, but it was soon destroyed by the strong currents of the river. \n \n Twelve months had hardly elapsed when the Cremonese, undaunted by their previous defeat, again attacked Brescello, and this time with such success that the town was set on fire and utterly destroyed; only, however, to be rebuilt by the determined citizens, who soon afterwards were under the dominion of the Marquis Obizzo III., of Este, at whose death, in 1352, the government of the town passed into the hands of the Visconti, and continued so up to 1421. In 1425 the Venetians took possession of Brescello, and held it until 1432, when it was captured by the Duke of Milan, who, in the years 1442-3, gave it to Erasmo Trivulzio. \n \n In 1479 Brescello passed into the possession of the Duke Galeazzo Maria, Ercole I., and in 1512 and 1551 was under the yoke of foreign troops. In 1552, Ercole II., re-fortified the town with very strong forts, which were, however, totally destroyed in 1704 by Gallispani. \n \n Here, on the 16th September, 1797, was born the subject of our memoir, Antonio Genesio Maria 10Panizzi; a great portion of whose chequered life seemed, in its changes and chances, to reflect the early fortunes of his birth-place. \n \n The similarity in the unsettled state of both is striking, and it is a source of gratification to watch, how, in progress of time, Panizzi was enabled to surmount misfortune, and, freed from private as well as political trouble, to end his life in assured peace and security. His father, Luigi Panizzi, was the son of Dottor Antonio Panizzi, a lawyer. His mother, Caterina Gruppi, was descended from a respectable line of ancestors, many of whom had earned for themselves honourable distinction chiefly in the profession of the law. \n \n At an early age Antonio Panizzi was sent to a school of the better class at Reggio, where he was placed under the care of the Abbate Fratuzzi, Professor of Rhetoric and Director of the Lyceum, with whom, as stated by a contemporary, Dr. Zatti, he soon became a special favourite. Of this school Panizzi seems always to have cherished happy memories, and the author remembers hearing him narrate a rather amusing incident of his school-days. \n \n This anecdote is presented to our readers with some apology, and with the recommendation, after the manner of facetious novelists when about to introduce a more than ordinarily racy chapter, to use their own discretion as to its perusal. \n \n It is the custom at schools in Italy, even at the present day, for one of the pupils to be chosen to serve at mass. For this office the Abbate Fratuzzi on one occasion selected Panizzi. It so happened 11that the priest was administering the sacrament to a man, whose head was of conspicuous uncleanliness, and was uttering the usual sentence, “Corpus Domini nostri Jesu Christi custodiat animam tuam in vitam ?ternam.” Young Antonio, interrupting the priest at the word “custodiat,” murmured to himself “pediculos tuos,” then looked at the priest, who omitting the “animam,” in a great hurry concluded the sentence, perhaps unconsciously, “in vitam ?ternam. Amen.” \n \n Surely never yet had man and his tormentors in combination so rich a blessing invoked on them. \n \n Having finished his first course of studies at the Lyceum, early in the year 1814 Panizzi entered the University of Parma, where he kept the terms necessary to qualify him for the legal profession. In August, 1818, he obtained the Baccalaureat, with the title of “Dottor” Panizzi. The original certificate conferring this degree was taken away from him when subsequently he became involved in political troubles; but a second fully certified copy was sent to him on the 22nd of May, 1827, most probably at his own request, for about this period there was a possibility of his appointment to the chair of Italian professor at the London University. \n \n As every detail is important to our subject, it may be mentioned here that, within a month of his obtaining his degree, he was attacked so violently by typhoid fever, that his life was for awhile despaired of. \n \n It was Panizzi’s good fortune at this time to stand on the best possible terms with the ruler of his State, 12Francis IV. Duke of Modena, who esteemed the young man so highly as to appoint him, though still a mere youth, to the office of Inspector of Public Schools at Brescello. This office he seems to have discharged with more than common industry and conscientiousness, bestowing on every detail, whether of management or expenditure, the most careful supervision. For the favour with which the Duke regarded him, he was indebted to an intimacy existing between Francis IV. and the Advocate Cocchi, with whom Panizzi acted as a sort of legal partner, and whom he constantly assisted in the various causes before the Tribunal at Reggio. \n \n One who knew Panizzi about that time, thus describes his personal appearance: tall, thin, and of dark complexion; in temper somewhat hot and hasty, but of calm and even judgment, which commanded respect and caused him to be looked up to by all. He must have been most diligent in his pursuit of knowledge, losing no opportunity of study, for he is described as constantly engaged in reading, even while walking from his house to the office. \n \n As regards his professional reputation, he may be said to have certainly occupied more than an average position, both as counsel and as a legal authority. His powers of eloquence were of no mean order; they were especially conspicuous in a law suit, in which he was engaged for the defence, and was opposed by the celebrated advocate Tizioni, well-known as a most formidable, and (as was said) unscrupulous opponent. \n \n It was about this period that the political condition of Italy began to engage, and shortly afterwards to 13absorb his attention; and, in this place, it will be best to notice a charge, openly brought against Panizzi, that he was a Carbonaro. The truth of this assertion must be at once and freely admitted; for although no one ever heard him confess it in England, nor is there in his book “Processi di Rubiera,” of which more hereafter, any allusion to his having been of the Association, yet it is indisputable that he was not only a Carbonaro, but one of the most active members of that Society. We have it on the evidence of Doctor Minzi (one of his greatest friends), that in the month of January, 1821, he, Dr. Minzi, and an ex-captain of the Napoleonic army were admitted by Panizzi as members of the Society, that such admission took place in Panizzi’s own bedroom, and that he himself had then been a member since the month of March, 1820. \n \n In this country all secret Societies are apt to be regarded—to use the mildest term—with disfavour. It is true that ridicule attaches to the general denunciation of Freemasonry indulged in by the Roman Catholic Church; for, except that the manner of creating a Freemason, and the sacred signs by which he may hereafter be known, are kept in darkness from the profane world, the Institution itself is about as much a secret society as a London club; there is, however, unfortunately, in a portion of these realms a dark and dangerous organisation,[A] unjustifiable, we conceive, as regards its purpose, and unscrupulous as to the means which it employs to carry out its designs. 14From the condition of this conspiracy, and of the country where it is carried on, we are doing an injustice to other and widely different nations to judge of the causes from which their societies spring by the same standard; for, let us frankly and impartially put ourselves in the place of some at least of these, and we may possibly find a sort of exculpation if not a justification even of the Carbonaro. \n \n A. “Ribbonism” a society organised in Ireland about 1820, to retaliate on landlords any injuries done to their tenants, not scrupling even at assassination. An Act was passed to suppress it, 16th June, 1871. \n \n Where the law is so weak that justice cannot be obtained at its hands, some other organisation will naturally be resorted to for the protection of life and property, and this organisation being beyond, and therefore to a certain extent antagonistic to the law as existing, or at least as administered at the time, must, if it would be effectual, be secret. No peaceful and well-conducted inhabitants of certain cities in the Far West, have yet, to our knowledge been heard to complain of the existence or action of that most terrible of Vehmgerichte, the “Vigilance” Committee. Where, on the other hand, despotism, uncontrolled by law, exercises an uncertain and galling tyranny, or being acquiesced in by the majority, reduces sovereign and subjects to the lowest moral and intellectual, and it might almost be added physical level, whatever there is of life and spirit in a nation will be forced into some plan of action for the preservation both of itself and the country; and this action will of necessity be secret. \n \n Conditions such as these existing, as will be hereafter seen, in Panizzi’s own country, may fairly be alleged as an excuse—if excuse be needed—for his complicity with Carbonarism. \n \n 15It is not brought forward as a further justification, but simply adduced as a fact, that such distinguished and eminent men, as Silvio Pellico, and the Principe della Cisterna, are known to have been deeply imbued with Carbonarism, and the late Emperor Napoleon III. was among the number of those accused of taking an active interest in the doings of this society. \n \n Into the condition of Italy at the time of which we are writing it is unnecessary to enter as yet. Suffice it to say that the restraints upon personal liberty and the despotic conduct of the ruling powers aroused the spirit of Panizzi, and he longed to liberate his country; ardent patriot as he was, it seemed to him that freedom could only be secured by the expulsion, in the first place, of certain persons whom he deemed tyrants. With a view of bringing about this result, he thought it necessary to belong to a sect, or secret society, whose predominant ideas were—to free Italy, to unite her several States, and to expel the “stranger.” \n \n In order that the reader may not be misled in any way in judging of the early political principles of Antonio Panizzi, it will be well to give in this place a short account of the source whence Carbonarism sprung, of its original purpose, and of the more ambitious aims which it in aftertimes developed. Let it be first of all clearly understood that the Carbonari of 1820 had nothing in common with the Communists of the present day. \n \n The Italian society of Carbonari dates from the period of the French Revolution (1790); it’s name was 16derived from that of a similar association which had existed in Germany from a very early period. The necessity of affording aid to one another induced the charcoal-burners who inhabited the vast forests of Germany to unite against robbers and enemies. \n \n By conventional signs, known only to themselves, they claimed and afforded mutual assistance. The criminal attempt of Conrad de Kauffungen (executed 14th July, 1455), to carry off the Saxon princes, failed through the intervention of the charcoal-burners; and, at a more recent period, a Duke of Wurtemberg was compelled by them, under threat of death, to abolish certain forest laws, considered offensive and cruel. This association gradually acquired more consistency, and spread itself all over Germany, France, and the Netherlands—the oath its members took being called “the faith of colliers or charcoal-burners.” It is asserted that several members of the French Parliaments were enrolled in its ranks in the years 1770-1790, and it may be remarked, en passant“$2”$3, that in France there had long existed, in the department of the Jura, an association known as the “Charbonniers” or “Bucherons,” and that amongst its members it was known as “Le Bon Cusinage.” This society was revived and brought into activity by the Marquis de Champagne, in the reign of Napoleon I. \n \n But it is Italy which claims our immediate attention, and in treating of the rise and progress of Carbonarism in that country a somewhat remarkable personage must be introduced—no other, in fact, than he to whom Carbonarism owed its existence. This was one Maghella, a Genoese of low extraction, 17who had risen from the position of clerk in a counting-house to that of minister of police in the Ligurian Republic. He was in high favour with Murat, who had made his acquaintance during the French campaign in Piedmont. \n \n Shortly after Murat had succeeded Joseph Bonaparte on the throne of Naples he sent for Maghella, and in course of time made him minister of police. It may be a matter of question whether or no the king found in his newly appointed officer the best of counsellors or the most faithful of friends. Maghella was actuated by two feelings of equal intensity—hatred of Napoleon and a desire for the independence of Italy. With these views he took upon himself to urge on Murat not only that he should refuse to join in the campaign now (1812) projected by Bonaparte against Russia, but should openly declare himself against the Emperor. How Murat received this advice, which, proffered from such a quarter to such a man, appears to us now to betoken madness, there is no record to show. As he shortly afterwards appeared in the field as general of Napoleon’s cavalry, his proper sphere, it is pretty plain that he did not adopt it. \n \n The unfortunate termination of the Russian expedition, and the complete disaster which befel the French army therein, gave fresh encouragement to Maghella to carry out his patriotic schemes. Now, he conceived, there was a golden opportunity for driving the French troops out of Rome, Tuscany, and Genoa, and for placing himself at the head of the insurrectionist party. In this, as is well known, he signally failed. 18That the occasion he took for the accomplishment of his project was not, however, so ill-timed as might generally have been supposed, is proved by the subsequent revolution at Milan, which broke out on the 20th April, 1814, and which showed that the government of Eugène de Beauharnais was much less stable than had been fondly imagined. \n \n Although Maghella’s plans had thus failed, he still had means at command to employ for the benefit of his enslaved and distracted country. Of these the society of Carbonari presented the readiest; and he accordingly set himself to work to introduce the association into Naples. In this he was successful, and a duly constituted branch of the institution was established there by his efforts; the object aimed at being stated, in express terms, to be the liberation of Italy from a foreign yoke. That qualification of character was required for admission into the ranks of the Neapolitan league appears from the following extract from their rules:—“General doctrine of the order.” Article 4. “Tried virtue and purity of morals, and not Pagan qualities, render men worthy of belonging to the Carbonari.” Although the ordinary Neapolitan Carbonaro might possibly have failed to fulfil these rather severe conditions, yet we do not believe, still less is there any evidence to prove, that the Carbonari of Naples in general were animated by any less worthy motive than by a thoroughly sincere, if not very enlightened, spirit of patriotism. \n \n It cannot, however, be denied that whatever may be said of these new Southern Members of the Society, the men of Northern Italy, who in 1819 and subsequent 19years joined in considerable numbers, were of a class vastly superior, so far as regards social standing, culture, and education, energy and decision of character, to their confrères of the South—and amongst the Northern Italian associates was Antonio Panizzi. \n \n By 1820 Carbonarism had spread all over the Peninsula; it could scarcely be called any longer a secret society. There were head centres in almost every town. It had reached a numerical strength far above that of any other society, and it is hardly too much to say that, by this time, it had made itself respected as the expression of a national idea. \n \n The system had, as will have been seen, now developed itself into something very different from, and, to the various rulers of divided Italy, far more formidable than the innocent convention for mutual support and defence of the German charcoal-burners. It is not, therefore, under the circumstances, surprising that certain people outside the pale of the society, though we can hardly suppose them altogether ignorant of its professed objects, should have come to regard it with a vague and uneasy feeling of fear and aversion. In the Lombardo-Venetian Kingdom, as it was then styled, His Majesty the Emperor of Austria had, in August, 1820, issued a decree against the Carbonari, which, after accusing them of high treason, went on to declare that “The precise object of the Carbonari is the subversion and destruction of all governments.” Now, with whatever danger to the Austrian Government the organization might have been suspected to be fraught, and it must be readily granted that there were grounds for such suspicion, the foregoing universal 20proposition presents a remarkable variation from the truth. The aim of the Carbonari was, it is true, to liberate their country from the yoke of the foreigner, but there cannot be a doubt that it pointed in an equally direct degree to the unification of Italy, or at the least to a confederation of her several States under Italian government or presidency. \n \n Having thus endeavoured to trace the origin, growth, and aim of Carbonarism, it behoves us to consider how it affected the state of Naples, what was the condition of that place at the time of its introduction, and what were its immediate and subsequent results. To do this it will now be necessary to recapitulate the events of the memorable years 1820 and 1821. \n \n Whilst the secret societies and the people united in endeavouring to upset the existing state of affairs, the government of Naples, utterly unconscious of all danger, continued its arbitrary career. Such, indeed, was its feeling of security, that it had the amazing stupidity to imprison any person, who from excess of zeal or mistaken patriotism gave intimation of approaching danger. Danger there was, however, and in 1820 the revolution broke out in Naples. Two months afterwards a similar revolution, caused by the obstinacy and arbitrary acts of Ferdinand VII. of Spain, occurred at Cadiz. All Europe greeted these movements with applause. The Neapolitans, more eager and more active than the others, obtained their political reforms at the cost of but little bloodshed, and no public injury; had the revolution presented itself with its usual accompaniments of risk 21and disaster, the Carbonari, and, indeed, the Liberals, would not have felt inclined to proceed. Never was there greater excitement amongst the former, and never did their numbers and strength increase so rapidly. \n \n Thus encouraged they made essay of their strength on the ranks of the regular army, and were fortunate enough to be able to add to their Society no inconsiderable number of associates, both of the rank and file, and of officers. \n \n The Government was completely taken by surprise. Calabria, Capitanata, and Salerno issued various proclamations, whilst the army joined the Carbonari against King Ferdinand I. \n \n One morning five Carbonari, the most distinguished of the sect, entered the royal palace, announcing that they came in the name of the people, and that they desired to speak with the King or some high authority of the Court. Whereupon the Duke d’Ascoli presented himself, and was informed by one of the delegates in unmistakable words that tranquility could not be preserved in the city unless the King granted the constitution demanded. On the 6th of July, 1820, Ferdinand was compelled to issue an edict “To the Nation of the Two Sicilies,” in which he solemnly promised to “publish the basis of the constitution within eight days’ time.” New ministers were appointed, and shortly afterwards a document appeared stating that the King had resigned the royal authority to his son. The people suspected this to be a stratagem, and insisted on the establishment of the “Cortes” at once. The Viceroy Francis was induced to publish a 22decree declaring that the constitution of the Two Sicilies should be the same as that adopted in Spain in 1812. Thus the Government was constituted on its new basis amid general approbation. \n \n In Palermo, however, a rebellion had broken out which forced the King to send 2,000 soldiers to reduce the town to obedience. Emboldened by his success over the Sicilian rebels, he now fancied himself safe, and forthwith entered upon extreme measures. A general disarmament of the civil population commenced, death being the sentence of all found in secret possession of arms. The liberal-minded monarch further proceeded to prohibit or suspend the action of all public schools, universities, and lyceums, and to disband the militia. \n \n Such was the wretched state of Naples, when premonitory and alarming symptoms of disaffection appeared in the north. On the 11th of January, 1821, a band of young men, wearing the red cap of liberty, appeared at the theatre of the Ardennes, in the district of Novara, and raised a tumult. This ebullition of enthusiasm was put down by the troops on guard at Turin; but the revolutionary spirit was checked only for the moment, and soon broke out again supported by men of wealth and influence. In the month of February, on the representation of the Austrian Ministry, the revolutionary party was publicly accused of conspiring to expel the Austrians from Italy. On this charge, which might possibly be true enough, many men of noble birth and of the highest social position, were imprisoned in the citadel of Finistrello. This was the signal for a general rising. Officers and 23statesmen joined the revolutionists, and, according to Santorre Santa-Rosa, even the heir-apparent, Charles Albert, Prince of Carignano, was no stranger to the intrigues that were going on. \n \n On the morning of the 4th of March symptoms of revolt appeared in some regiments stationed near Vercelli; but they were speedily suppressed by the soldiers who remained faithful to the royal cause. \n \n On the 10th of March the Spanish constitution was publicly proclaimed at Alessandria. As soon as the news of this gain to the cause became known throughout Italy, great were the rejoicings of the Carbonari, and loud and frequent the shouts of “Viva il Re! Viva La Costituzione!” A cavalry regiment was raised and stationed on the heights of Carmagnuolo, under the command of Captain Lisio, the soldiers shouting, “Death to the Austrians!” Turin, abandoned by its governor, was occupied amid the acclamations of the people and many of the soldiers. \n \n The King all this time was at his chateau of Moncaliere; but on hearing of the events above described at once hastened to the capital. His first impulse was to put himself at the head of his troops and attack Alessandria; but he was forced to relinquish this enterprise owing to the unfaithfulness of his soldiers. Thus baffled, he attempted, as a sort of half measure, a proclamation of the French constitution. But it was too late—the insurgents had gained the upper hand. As a last resource, the King sent the Prince of Carignano to the revolutionists in order to ascertain their demands. The prince was received with respect and military honours, accompanied by 24shouts of “Viva la Costituzione di Spagna!” He was told that war with Austria was desired. The King, on hearing this, rather than give way, abdicated in favour of his heir. \n \n On the 13th the royal family left Turin and set out for Nice, and a proclamation was issued that the Prince of Carignano had been appointed regent of the realm. He was soon afterwards installed in full sovereignty, and the constitution of Spain proclaimed. \n \n We may be permitted in closing this necessarily very short sketch of the two revolutions, to quote a passage from that most amusing but slightly erratic writer, Lady Morgan, on the subject of the Piedmontese Revolution:—“Had this revolution not been disturbed by the unprincipled interference of foreign nations it would have led to the happiest consequences. What is to be said of a Government which reduces the great majority of the people to a slavish insensibility to national degradation, to a perfect indifference to national honour?” \n \n It may certainly be asked, on the other hand, how a nation reduced to the state described by Lady Morgan could be entrusted to work out for itself a revolution which “would have led to the happiest consequences.” But liberty in Italy, as elsewhere, must have taken time to grow; even under the most patriotic of leaders a nation does not become suddenly ripe for the blessings of freedom. Nor can it be doubted that by the spirit that moved in 1820-1822, and which burst forth so brightly in aftertime, were laid the first foundations of that structure of Italian unity finally completed by politicians more skilled but not more patriotic than the revolutionists. \n \n 25How far Panizzi’s own country, Modena, was concerned in the attempted work of liberation will be best shown by a short notice of his book, the “Processi di Rubiera.” \n \n By this work, no doubt originally intended for the world, but even then so sparingly circulated and subsequently so rigidly suppressed by the writer that very few persons have even seen it, the circumstances which drove Panizzi into exile, though not detailed in all their fulness, are illustrated and rendered intelligible. \n \n A somewhat minute analysis is not therefore out of place here, although, whether from indisposition to thrust himself forward or from fear of compromising others, the author’s name occurs but once or twice in the body of the work, which therefore contributes hardly anything to the elucidation of his own biography. It has usually been referred to as “I Processi di Rubiera,” Rubiera being the name of the fortress situated between Reggio and Modena, where the prosecution of Modenese political offenders was conducted before a tribunal nominated ad hoc. The title of the book, however, is “Dei Processi e delle Sentenze contra gli imputati di Lesa-Maestà e di aderenza alle Sette proscritte negli Stati di Modena;” 247 pages, besides the title, Madrid, 8°., 1823. The imprint was a disguise; the publication, if the work can be said to have been published, took place at Lugano. The designation of the anonymous editor, dating from Madrid, Feb. 2, 1823, and subscribing himself, “Un membro della società landeburiana,” was no doubt equally apocryphal, and may probably have concealed Panizzi himself. The document is altogether 26one of the most interesting productions of its author, especially as an indication of the eminence he might have attained in his chosen profession of advocacy had his lot been cast in a free State. The style borders on the oratorical, charged with fiery but restrained indignation, while the vehemence of invective is supported by legal acumen, and a thorough acquaintance with the maxims of jurisprudence, to which the writer continually appeals. His power of recollection and mastery of incidents, whether public or personal, appear extraordinary when it is considered that, his papers having been seized at Cremona, Panizzi himself must have depended to a very great extent upon his memory. Yet the completeness of the documents, which are all given in full, induce the belief that he might somehow have preserved this part of his materials, or have subsequently obtained it indirectly. Some inaccuracies may well have crept unheeded into the narrative under such circumstances, and this may possibly account for his evident desire to suppress the work. Years after, being questioned on the subject by the biographer, he answered, “Better say nothing about it.” It seems difficult to assign any other reason, unless it might be an excessive deference to the sentiment alluded to in the preface, “che lo scoprire le turpitudini delta patria sua, comecchè a ciascuna persona non istia bene, a coloro poi che per capriccio di malvagia fortuna furono fuori del seno di lei trabalzati, più specialmente non convenga.” The tone of the production can scarcely have been disapproved by his maturer judgment. Though emphatic, it is always decorous, 27whilst the literary effect is even impaired by a punctilious adherence to constitutional fictions in criticizing the acts of the sovereign. There is nothing capable of being construed to the writer’s own disadvantage, unless an adversary were sufficiently malicious or prejudiced to discover an incentive to political assassination, in his report of a matter of fact, that Modena rejoiced at hearing the news that a tyrannical official could persecute his fellow-townsmen no more. This moderation of tone certainly cannot have arisen from any vacillation on Panizzi’s part. He never altered his opinion of the Modenese Government; and, even if his mere opinion were disregarded, the documents printed by him speak sufficiently for themselves. It is fortunate that he did not succeed in entirely suppressing so lamentable an illustration of the forlorn condition of the Italy of his youth. \n \n The book commences with a retrospective survey of the then recent history of Italy, displaying remarkable insight into personal character, and containing shrewd remarks on State policy. This introduction may one day be appealed to as a testimony that the true founder of Italian independence and unity was neither Charles Albert nor Victor Emmanuel, not Cavour, nor Mazzini, nor Garibaldi, but Napoleon. Nothing, certainly, could have been farther from the intention of the rapacious conqueror, who, ere the ink was well dry with which he had assured the citizens of the Cisalpine Republic that their liberties would shortly be secure, proceeded to confiscate them himself. \n \n A contemporary writer mentions the project which Bonaparte is known to have long entertained, for consolidating 28Italy into one State, and adds: “While he was Emperor of France he probably intended to administer his new Government by a Viceroy, but since his abdication we are satisfied from all we have seen and heard of his conduct that he dreams of his Italian kingdom for himself.” \n \n It was, however, impossible for a revolutionary invader, whose authority involved the negation of the old order of things, to govern Italy without appealing to Italian national sentiment. The various branches of administration fell into the hands of natives. A national army was formed which participated to the full in the glories of the Empire, and Italy regained something of that reputation for valour and conduct which she had forfeited for three hundred years. The Italian youth, no longer condemned by the jealousy of their rulers to an existence of indolence and frivolity, awoke to the perception that their immediate progenitors had reversed the mission of their forefathers. \n Excudent alii spirantia mollius ?ra, ... \n Tu regere imperio populos, Romane, memento. \n \n For themselves, if still subjects, they were no longer slaves. \n \n Napoleon, “nato,” in Panizzi’s pregnant phrase, “per dar l’orma all’età sua”, prepared the way for the love of liberty by reviving the love of glory. Looking around them, the Italians beheld an enlightened code of laws, impartial judges, religious toleration, education fostered by the State, active industry, flourishing finances, above all, a strictly national administration, 29with every post accessible to desert. The instinctive sagacity of the race taught them to be content with so large a measure of good for the present, and to reserve their aspirations for independence until their beneficent master should bequeath his empire to his son. That day never came. Bonaparte fell, execrated by the many nations which he had pillaged and dismembered, but cherished by the one he had trained to national life, with a regard which is still a force in European politics. \n \n Six millions of Italians had, in Napoleon’s time at least, been permitted to bear the Italian name. The Congress of Vienna resolved them back into Lombards, Piedmontese, and the people of Parma and Modena. Modena was assigned to the Austrian Archduke, descended on the female side from the ancient house of Este, a petty tyrant of a peculiarly exasperating type, timorous, suspicious, and hypocritical. His first act was to abolish the Code Napoleon, and replace it by the code promulgated by authority in 1771. The motive for this retrograde proceeding was apparent. The code Napoleon was lucid and comprehensive; the obscurity and imperfection of the “Codice Estense” left a margin of uncertainty, under cover of which the maxims of the antiquated civil and canon law would always be introduced when required. The judge had thus the power of resorting to either as he pleased, and his arbitrary decision might be the most potent element in the proceedings. This was plainly equivalent to a denial of justice to persons charged with political offences. The remodelled magistracy was filled with subservient functionaries; 30but the real main-spring of the judicial administration was Besini, the Chief of Police. Every act of the Government betrayed the same tendency, especially the oppressive system of taxation, introduced to replenish the Duke’s private exchequer, and the restrictions imposed upon higher education. Schools and colleges were placed under the control of the Jesuits; and scholarships established for the support of poor students at the universities were suppressed, the Duke declaring openly that people must not be encouraged to aspire beyond their station. Every person of liberality or culture became disaffected, and as all open expression of discontent was prohibited, secret societies began to permeate the entire duchy. \n \n Matters were in this state when the sudden explosion of the Neapolitan revolution turned the apprehensions of the petty Italian Governments into an actual panic. Austrian troops, hastily summoned to repress the Liberal movement, passed through Modena on their march. Some of these were Hungarians, a nation sympathising with Italy. An address was prepared and secretly circulated among them, imploring them not to fight against the Neapolitans. The jealousy of the Modenese Government was roused to the highest pitch. Many arrests were made, chiefly by means of espionage and the violation of private correspondence; and on March 14th, 1821, a special tribunal was constituted for the trial of political offenders. It was the formal inauguration of a reign of terror. “Avrà luogo,” says the decree, “un processo e un giudizio statario—Statario, dal latino statim, se mal non avviso,” is the sarcastic note of the editor. \n \n 31The etymology might seem borne out by the injunction that the duration of the proceedings was in no case to exceed eight days, and by the sinister regulation: “Si terrà, pronto il carnefice, si potrà secondo le circonstanze, eriggere il patibolo anche preventivamente, e si disporrà per aver pronto un religioso il quale assista coloro che fossero condannati.” The priest and the executioner, however, were not immediately called into requisition; and the Neapolitan and Piedmontese revolutions having been promptly extinguished, the tempest seemed about to pass off, when suddenly, about the beginning of 1822, numerous arrests were made of persons suspected of participation in the meetings of secret societies. It was soon reported that one of those implicated had denounced his friends, and dark stories became current of the tortures and privations by which the chief of the police, Giulio Besini, sought to wring out confession. By a decree of unheard of injustice and indecency, this natural enemy of the accused was appointed their judge, and charged to receive the depositions he had himself extorted. The issue was eagerly awaited, when, on the evening of May 14th, 1822, Besini perished by an unknown hand. Besini was taken home, surgeons sent for, and the blow declared mortal. Quick as lightning the welcome news spread through Modena, and the people heard with joy that there was a man in the town who had been bold enough to rid the land of a miscreant. With his dying breath he denounced a certain Gaetano Ponzoni, who, he said, had cause to be his enemy, “as if,” observes Panizzi, “Ponzoni were the only such person in the duchy.” \n \n 32Upon the admonition of the attendant magistrate, Solmi, Besini acknowledged that he could not positively identify his assailant. Ponzoni was nevertheless arrested, and Solmi’s humane interference cost him his office. The special tribunal, hitherto dormant, was called into activity for Ponzoni’s trial. \n \n The course of the procedure gave earnest of what was to follow. Parenti, Ponzoni’s advocate, was allowed only three days to prepare his defence, and denied an opportunity of examining the adverse witnesses, a part even of the written depositions was withheld from him, he was charitably admonished not to occupy the time of the court with trivialities, and referred to a secret Ducal decree conferring unlimited powers on the tribunal, which could not be shown to the advocate, because it contained very confidential instructions intended for the court alone. In spite of all these obstacles, Ponzoni’s innocence was irrefragably established; but his judges, afraid to acquit and ashamed to condemn, simply laid the proceedings before the Duke, who left them unnoticed, and when Panizzi wrote, Ponzoni was still in prison, where he remained, though innocent, till the year 1831. The true assassin proved to be a certain Morandi, who, when safe in London, openly avowed having committed the deed. \n \n This prosecution was but a preliminary to the indictment of the unfortunate men who had languished in captivity since the beginning of the year. About the middle of June the commission appointed to try them commenced its session at Fort Rubiera. Its first task was to receive the confessions extorted from 33the prisoners during their incarceration, and to elude the numerous retractations of the accused. All these avowals proved to have been obtained under Besini’s management by fraud or force. Manzotti had been chained to a wall in such a manner as to oblige him to remain in an erect position until he subscribed to what was required of him; Nizzoli’s signature was affixed during the paroxysms of a fever fit, after he had been chained so as not to be able to sit down for forty days. Conti was entrapped by a forged confession attributed to another prisoner; Alberici was gained by allurements and flatteries; Caronzi was persuaded by the prayers and tears of his wife, whose honour was said to have been the price of a fallacious promise of her husband’s deliverance, he being sentenced to twenty years’ penal servitude, a term reduced by the Duke to fifteen. Peretti, Maranesi, Farioli, and others testified to similar deceits and cruelties ineffectually employed against themselves; some, beguiled by the inducement held out to them, remained silent. The chief prosecutor, Vedriani, a man of honour and integrity, called upon the tribunal to acquaint the prisoners that such promises were illusory and unauthorised. His colleague Fieri opposed him; the question was referred to the Duke, who denied having authorised Besini to hold out any expectations of indulgence. Vedriani insisted that the culprits should be apprised of this declaration; the judges, fearful lest the unfortunate men should escape from the snare into which they had fallen, peremptorily negatived the demand. Vedriani indignantly threw up his brief, and the last hope of justice 34vanished with him. A more supple instrument was found, and the prosecution proceeded as the Government desired. The prisoners were debarred from choosing their own advocates, and those selected were only allowed to confer with them under restrictions. The defenders nevertheless did their duty, and although they could not, without subverting the entire judicial fabric of Modena, as then understood, have brought the judges to acknowledge the uselessness of extorted confessions (the sole evidence against most of the accused)—the illegality of the tribunal itself ab initio, or, even granting its legality, the incompetence of the tribunal to take cognisance of offences which it had not been constituted to try—they deterred the court from accepting the conclusions of the prosecutor Fieri. \n \n This man had demanded the execution of forty-two persons, at most only guilty of belonging to a secret society, and accused of no overt offence against public tranquility. The tribunal reduced the penalty to various terms of imprisonment. The sentences, before they were pronounced, had to be submitted to the Duke for confirmation. Francis, enraged at their lenity, summoned the President of the Commission before him, the revised sentences assumed a very different complexion, and all the three judges stultified their previous decision by subscribing them “perchè tale fù la Sovrana mente e volontà.” Nine of the accused, some of whom had fortunately made their escape, were condemned to death; the remainder to the galleys or imprisonment for life, or for various periods. A Ducal decree appeared after some delay maintaining the punishment of death against those 35who had escaped, pronouncing a virtual sentence of imprisonment for life against those who had steadfastly maintained their innocence, and extending marked indulgence to those who had merited it by a “sincere, prompt, and spontaneous confession,” in other words, those who had been cajoled or intimidated into betraying their associates. The latter part of Panizzi’s publication is occupied with a legal demonstration of the incompetence of a tribunal constituted to try charges of high treason to deal with the mere offence of belonging to a secret society. The argument seems conclusive, but in fact the tribunal had voluntarily branded itself with a deeper mark than any that its assailant’s eloquence or ingenuity could have affixed to it. \n \n On a perusal of the sentences, which are given “totidem verbis” in the appendix of the book, the civilized reader remarks with astonishment that, on the tribunal’s own showing, half the offences for which it awards penalties are not proved at all. First, is recited a series of facts considered to be established, by far the greater part of which relate merely to the presence of the inculpated person at the formal reception of some new member into a secret society. Then, in many instances, comes a second string of accusations, confessedly not proved, but considered possible “perchè si ha pure in processo qualche indizio.” And sentence is equally awarded for both! \n \n The reasons, for which the sentence on a priest, Giuseppe Andreoli, was carried out, are worthy of attention:— \n \n 1. Because he had committed a crime which was punishable with death. \n \n 362. Because he had been the means of corrupting the younger part of the community. \n \n 3. Because he had abused the situation of Professor of Belles Lettres, at Correggio, in converting it into an instrument of Carbonarism. \n \n 4. Because he had confessed his crime too late, and not within that time, which the Duke had fixed upon as available for such confessions. \n \n As to the latter, it is to be borne in mind, that he confessed, simply on account of the Duke’s encouragement. The sentence was confirmed on the 11th of October, 1822, not because it was legally necessary, but, indeed, for the personal gratification of Francis IV; “Invocando il Santissimo nome di Gesù.” \n \n At the period of the production of this work Panizzi’s own process was in suspense. He mentions it in a note, complaining of the delay, as intended to discredit him in the eyes of the other Italian patriots. His cousin, Francesco Panizzi, had, it appears, made some sort of confession, and been treated with suspicious lenity. If the Modenese Government had any intention of forcing or enticing Antonio into the like course of action with his cousin, it must have been frustrated by his publication, which may account for the impotent passion evinced in the subsequent proceedings against him. The work would be felt the more irritating from its sobriety of manner, its moderation even in the midst of invective, and its constant appeal to establish legal principle, as the criterion of the whole question. While proclaiming his fervent aspirations for the independence of his country, the author incidentally disclaims any participation 37in the proceedings of the Carbonari, and the commission of any act tending to the overthrow of the existing Government. \n \n Such would be the natural attitude of a citizen like Panizzi, and he may well have affiliated himself to the secret society, as at that time the sole efficient agent in the cause of Italian freedom. \n \n It is, nevertheless, difficult to conceive a man of his solid sense and practical sagacity, long acquiescing in the mummery of a Carbonarist conclave, and submitting to be known to the initiated as Thrasybulus or Archimedes. He represents, however, all the more faithfully, the indignation of the generous youth who had grown up under the comparative liberty of Napoleon’s sway, and who, on attaining maturity, found themselves deprived by political changes in other countries, of their birthright in their own; forbidden to call or think themselves Italians; and with every avenue in life closed against them, unless they consented to become instruments of a cruel and senseless despotism. \n \n As this generation has passed away other aspects of the Italian question have come into greater prominence; the stately tree of Italian unity has covered the soil in which it originally took root. Even more as a picture of contemporary national feeling, than as an exposure of the fraud and cruelty of an extinct tyranny, is Panizzi’s youthful work, worthy of being rescued from the oblivion to which he for so long condemned it. \n \n Deeply interesting as are these recollections of the struggle for freedom in Italy, and intimately as they 38are connected with the life of Panizzi, than whom no stauncher advocate for the liberty of his country ever existed, it must not be forgotten that the object we have immediately in view is to refer to these exciting events so far only as Panizzi himself was concerned with them, and not to allow ourselves to be carried away by our subject beyond the limits necessary to elucidate the object we have at heart. \n \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2713/74588.html","bookId":1438,"book":{"id":1438,"title":"The life and correspondence of Sir Anthony Panizzi","description":"简介： The first chapter of these Volumes discloses the reasons which induced me to undertake the present Biographya task amounting to a labour of love, owing to the personal interest I have felt in it from beginning to end. How far, however, I may succeed...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2713","creation":"Aug 1, 2019 12:25:06 AM","modification":"Aug 1, 2019 12:25:06 AM"}}
