{"id":15564,"no":5,"title":"CHAPTER IV","content":"The British Museum; Appointment Discussed; First Duties; Royal Society; Promotion; Cary; Hallam’s Letter; Official Residence. Sir Hans Sloane Not before the middle of the eighteenth century had the grand idea of establishing a National Museum been entertained in England. The project was suggested by the will of Sir Hans Sloane, Bart., of Chelsea, who, during a long period of eminent practice in physics, had gathered together whatever was within his reach of rare and curious, not only in England, but in other countries. This great originator of our National Collection was born in 1660, and died in 1753. The codicil of his will bears date the 20th of July, 1749, and expresses a desire that his collection might be kept together and preserved in his Manor House. By the said codicil the testator directs that his trustees should make their humble application to His Majesty, or to Parliament at the next session after his 103own decease, offering the entire collection for the sum of ￡20,000. This consisted of a numerous library of books, and MSS., with drawings, prints, medals, and coins, articles of virtu, cameos, precious stones, \u0026c., \u0026c., which he had himself collected at an outlay of ￡50,000. His testamentary offer to the nation was accepted by Parliament, and in 1753 an Act (26 George II., c. 20) was passed, which may be termed a Charter of Foundation. Trustees were appointed, the identical individuals named by Sir Hans during his lifetime, who had been consulted by competent persons, and strongly felt the necessity of procuring the collection as a whole for the use of the nation. The attention of the legislature was not confined simply to the collection of Sir Hans Sloane. The Act which directed the purchase of his museum also gave instructions for the purchase of the Harleian collection of MSS., for which a sum of ￡10,000 was granted. This Act also directed that the Cottonian Library of MSS., which had been granted to the Government for public uses by an Act of the 12th and 13th, William III., should, with the addition of the library of Major Arthur Edwards, form part of the general collection. It was ordered that these several collections should be kept in their respective places of deposit until a more convenient and durable repository, safer from fire, and nearer to the chief places of public resort, could be provided for the reception of them all. To defray the expenses of these purchases, to procure a fit repository for their preservation, and to 104provide a fund for the permanent support of the establishment when formed, the Act directed that ￡100,000 should be raised by way of lottery, the net produce of which, together with the several collections, was to be vested in a corporate body selected from the highest in the land so far as regards rank, station, and literary attainments, upon whom it conferred ample powers for the disposition, preservation, and management of the Institution, which, it was determined, should bear the name of The British Museum. The sum really raised under this Act, partly in consequence of benefits arising from unsold tickets, amounted to ￡101,952. 7s. 6d.; but the expenses of the lottery amounted to ￡6,200, and the cashier of the bank received more than ￡550 in consideration of his management of it, so that the net produce was ￡95,194. 8s. 2d. Out of this the sum of ￡20,000 was paid to the executors of Sir Hans Sloane; ￡10,000 to the Earl and Countess of Oxford for the Harleian MSS.; ￡10,250 to Lord Halifax for Montague House, and ￡12,873 for its repairs, which had been estimated at ￡3,800; ￡30,000 being set apart as a fund for the payment of future salaries, taxes, and other expenses. Some loss was also sustained by the difference of price between the times of buying and selling stock, and ￡4,660 were expended for furniture. The surplus was applied to the gradual liquidation of numerous and general expenses, including the removal of the different collections. The only buildings offered as general repositories were Buckingham House, with the gardens and field, for ￡30,000, and Montague House for ￡10,000. 105The consideration of the former was waived, partly from the exorbitant sum demanded for it, and partly from the inconvenience of the situation. The latter was finally fixed upon, and the agreement for its possession was drawn up in the spring of 1754. No offer of ground for building a repository was made, except in Old Palace Yard, where it was at one time proposed that the Museum should find a place in the general plan which had been there recently designed by Kent for the New Houses of Parliament. Montague House was originally built about 1674, by Ralph, Duke of Montague, after the style of a French palace. It was erected from the design of Robert Hooke, the celebrated mathematician, who took so important a part in the re-building of London after the great fire. Foreign artists were chiefly engaged in its completion, and amongst them Verrio superintended the decorations. When finished it was considered a most magnificent building; but on the 19th January, 1686, owing to the negligence of a servant the house was burnt to the ground. The large income of the owner was again brought into requisition for the re-construction of his palace; and, though executed by fresh artists, the plan was the same, the new structure being raised upon the foundation and remaining walls of the old one. The architect now employed was Peter Puget, a native of Marseilles, who was assisted by C. de la Fosse, J. Rousseau, and J. B. Monnoyer, three artists of great eminence. The exclusive employment of French artists gave rise to the popular, but improbable, tale that Montague 106House was re-built at the expense of Louis XIV., to whose Court the Duke had twice been attached as Ambassador. The second building was purchased as a repository for the collections. In 1755 the Harleian MSS. were removed into it, and the following year the other collections were added, and when all had been properly distributed and arranged the British Museum was opened for public inspection on the 15th of January, 1759. The government of the Institution was vested in trustees, to the end that, as the Act says: “A free access to the collections may be given to all studious and curious persons at such times, and in such manner, and under such regulations for inspecting and consulting the said collections, as by the said trustees, or the major part of them, may be determined in any general meeting assembled.” The trustees are forty-eight in number. Twenty-three are called official, being the holders for the time being of certain high offices; by these the National interests of Church and State, Law, Science, and Art are presumed to be represented and protected. Of these the Archbishop of Canterbury, the Lord Chancellor, and the Speaker of the House of Commons are termed the Principal Trustees. Nine others are called the Family Trustees, as representing the families of Sloane, Cotton, Harley, etc., etc.; one is termed the Royal Trustee, because nominated directly by the Crown. The remaining fifteen are styled the Elected Trustees, who are all chosen by the other twenty-three. 107In accordance with the desire of Sir Hans Sloane, the elected were chosen in the beginning from among the adepts in learning and science, and this practice continued until about 1791, when the vacancies began to be filled almost exclusively by persons of rank and fortune. The chief officer of the British Museum is styled the Principal Librarian, which is to a certain extent a misnomer, as he has no more to do with the books than with the other portions of the collection; he derives his appointment from the Crown under sign manual, and is entrusted with the care and custody of the Museum, his duty being to see that all the subordinate officers and servants perform their respective duties properly. The different departments are each managed by a head called Keeper, and in most of them there is also an Assistant-Keeper, besides assistants and attendants. The patronage of the Museum is vested in the three Principal Trustees, of whom the Archbishop of Canterbury takes precedence. The hours for the opening of the Museum in 1759 were from 9 o’clock in the morning till 3 in the afternoon, from Monday to Friday between the months of September and April inclusive, and also at the same hours on Tuesday in May, June, July, and August, but on Monday and Friday only from 4 o’clock till 8 in the afternoon during these four months. Persons desirous of inspecting the Museum were to be admitted by printed tickets to be delivered by the 108porter upon their application in writing. No more than ten tickets were to be delivered out for each hour; five of the persons producing such tickets were to be attended by the Under-Librarian, and the other five by the Assistant Librarian in each Department. On the 30th of March, 1761, the hours of admission were changed from nine to eleven and one, and the number admitted at one time was increased to 15. On the 9th of February, 1774, a Committee of the House of Commons was appointed to consider a more convenient method of admitting persons into the Museum, and on the 11th of May the Committee suggested that on certain days visitors should pay for admission. This was adopted and the practice continued for 36 years afterwards, when, in 1810, Mr. Planta, then Principal Librarian, first took the step of having the Museum opened three times a week from ten to four o’clock, without tickets. The first “Principal Librarian” was Dr. Gowin Knight, a distinguished member of the College of Physicians. He was appointed in 1756, and remained at the Museum till 1772, when he was succeeded by Dr. Matthew Maty, who was born in 1718, near Utrecht, and was educated at the University of Leyden. In 1740 he published “Dissertatio philosophica inauguralis de Usu,” and, later on, a work on the effects of habit and custom upon the human frame. Coming to England in 1741, he practised as a physician, and soon became a man of reputation, but much of his spare time was occupied in literary pursuits, and at the death of Dr. Knight he was appointed Principal 109Librarian, which post, however, he held only for four years, as he died in 1776. Dr. Charles Morton, a native of Westmoreland, born in 1716, was his successor. He was the author of several important works, and contributed largely to the “Philosophical Transactions.” His death took place on the 10th of February, 1799. Joseph Planta next obtained the appointment, having been engaged in 1773 as an Assistant Librarian. A native of Switzerland,he was born on the 21st of February, 1744, and educated at Utrecht, besides having been a student at the University of G?ttingen. From the date of his appointment as Principal Librarian (1799) it may be said that the affairs of the Museum began to improve; chiefly devoting himself to the improvement of the reading-room, in 1816 the number of visitors increased, and, as already stated, he suggested the vast improvement of throwing open the doors of the British Museum freely three times a week. He died in 1827. Sir Henry Ellis next occupied the position of Principal Librarian, having been a servant of the Trustees since 1800. He was born at Shoreditch, in London, 29th of November, 1777, but of him we shall have occasion to speak more fully hereafter. During this period the contents of the British Museum were divided into three separate departments, namely, Printed Books, Manuscripts, and Natural History, and to the first of these we must now draw the reader’s attention. The department of Printed Books consisted at first only of the library of Sir Hans Sloane, which is said 110to have amounted to 50,000 volumes, and that of Major Edwards; these were not, however, actually transferred to the Museum till 1769. In 1757 His Majesty George II., “fully impressed with a conviction of the utility of this Institution,” by instrument under the Great Seal, added the Library of Printed Books and Manuscripts, which had been gradually collected by the Sovereigns of these realms from Henry VII. down to William III. Rich in the prevailing literature of different periods, and including, with others, the libraries of Archbishop Cranmer and of Isaac Casaubon, this library also contains the venerable Alexandrian Codex of the Bible. His Majesty added to his gift the privilege which the Royal Library had acquired in the reign of Anne, of being supplied with a copy of every publication entered at Stationers’ Hall. The bulk of this Royal Collection consists of books of English divinity, history, classics, \u0026c., as well as of Italian and Spanish works, many of the volumes remarkable for being printed on vellum, or dedication copies. The most valuable among them are the productions of Vérard, the celebrated Paris printer (1480-1530), who struck off, during the reign of Henry VII., a copy on vellum of every book he printed. Unfortunately, part of this collection was dispersed. In 1759, Mr. Salomon Da Costa presented 180 Hebrew books, which, as he states, “had been gathered and bound for King Charles II.” The department was further enriched, in 1762, by a donation from George III. of a collection of pamphlets and periodicals published in the convulsive 111interval between the years 1640 and 1660. Chiefly illustrative of the civil wars in the time of Charles I., they were collected by an eminent bookseller, George Thomason; the whole comprises upwards of 30,000 articles, bound in about 2,000 volumes. It is impossible to enumerate in detail all the additions which have been since made by gift or purchase. Dr. Thomas Birch’s library, bequeathed in 1766, is rich in biography; two collections of books on musical science were also presented—one by Sir John Hawkins, in 1778, and the other by Dr. Charles Burney. Sir Joseph Banks In 1780, 900 volumes of old English plays were given to the Museum by Garrick. In 1786, numerous classics from the library of Thomas Tyrwhitt, and a collection of ceremonials, processions, and heraldry from Mrs. Sophia Sarah Banks was added. These gifts were supplemented in 1818, two years later, by the library of Sir Joseph Banks, consisting of about 16,000 volumes, particularly rich in scientific journals, transactions of societies, and books on natural history, but which were not actually transferred to the Museum till 1827. A collection of Italian history and topography from Sir Richard Colt-Hoare, Bart., was presented in 1825. This gentleman printed only twelve copies of the catalogue of his books, and wrote on the fly-leaf of the copy 112which accompanied the presentation, “Anxious to follow the liberal example of our gracious monarch, George IV.; of Sir George Beaumont, Bart., of Richard Payne-Knight, Esq. (though in a very humble degree), I do give unto the British Museum THIS my collection of topography, made during a residence of five years abroad, and hoping that the more modern publications may be added to it hereafter, A.D. 1825. Richard Colt-Hoare. This catalogue contains 1,733 articles.” The valuable library of the Rev. Clayton Mordaunt Cracherode, consisting of 4,500 volumes, came into the possession of the Museum in 1799; and lastly, in 1835, Major-General Hardwicke bequeathed to the Trustees the deficient works on natural history which formed part of his library, and which caused an accession of 300 volumes. Parliament also evinced its interest in the library, and gave instructions for the following purchases:— Mr. Francis Hargrave, an eminent barrister, had formed an important collection of law books, which was purchased in 1813 for ￡8,000, having been valued by a bookseller at ￡2,247. 8s. Dr. Burney’s library was likewise purchased in 1818, and was estimated at the value of 9,000 guineas. It contained a remarkable collection of Greek classics, besides 700 volumes of newspapers, \u0026c., \u0026c. In 1769 a sum of ￡7,000 was paid for Major Edwards’ library, and in 1804 the sum of ￡150 was applied to the purchase of a collection of Bibles belonging to Mr. Combe. 113In 1807 classical works, with MS. notes by Dr. Bentley, were also obtained by purchase. ￡1,000 were spent in 1812 in the purchase of works on English history and topography, and in 1815 books on music, belonging to Dr. Burney, were acquired for the sum of ￡253. In the course of the same year a collection of books, portraits, minerals, \u0026c., belonging to Baron Moll, of Munich, became national property for the consideration of ￡4,777. 17s. 5d., and in 1818, the Ginguené collection, consisting of 1,675 articles, chiefly on Italian literature, besides 2,686 articles in Greek, Latin, French, \u0026c., \u0026c., \u0026c., became another addition for ￡1,000. Four separate collections of tracts, illustrating the Revolutionary History of France, have been purchased at different times by the Trustees. One was that formed by the last President of the Parliament of Brittany, at the commencement of the revolution; two others extended generally throughout the period, whilst the fourth was a collection of tracts and papers published during the “Hundred Days” of the year 1815, and became the property of the Museum in 1823, the whole forming a library of revolutionary history, which contains as complete an account of those important days for France as does the already-mentioned collection of tracts of the civil wars of England. Another and unrivalled feature of the Museum history is its progressive collection of newspapers from 1588. But as, for the purposes of this biography, we have stated enough of the condition of the Museum 114at the time of Panizzi’s appointment, we shall say no more on the subject except to add a few words on the general collection at the British Museum, which may not be devoid of interest at this point of our narrative. Between 1805 and 1816 were added the choice statues and antiques of Mr. Charles Townley, the Lansdowne MSS., the Greville minerals, the Phigaleian and the Elgin marbles. Whilst, however, treasures upon treasures were accumulating in the Institution, other good opportunities were allowed, through apathy and ignorance, to be neglected, and amongst the rarities thus lost were Dodwell’s Greek vases, Belzoni’s alabaster sarcophagus, the ?gina marbles, the Millingen vases, and, last but not least, the famous collection of drawings by old masters acquired by the energy of Sir Thomas Lawrence, which, by the terms of his will, was offered to the nation for one-third of its original cost. To this neglect was added the sale of duplicate books, which so much disheartened Lord Fitzwilliam (who died in 1816, and who intended to bequeath his collection to the British Museum), that he altered his mind, and handed it over to the University of Cambridge. In 1823 the library of George III. was presented by George IV. to the nation, and ordered by Parliament to be added to the Library of the British Museum, but for ever to be kept separate from the other books. Immediately after his accession George III. began to purchase books, and for this purpose gave Mr. Joseph Smith, Consul at Venice, ￡10,000 for 115his collection, besides other money which he sent to various continental agents. This library contains selections of the rarest kind, more especially works in the first stages of the art of printing, and is rich in early additions of the classics, in books by Caxton, in the history of the States of Europe, in the Transactions of Academies, \u0026c. At the time of its formation the houses of the Jesuits were undergoing suppression, and their libraries were on sale. It was accumulated during more than half a century at an expenditure of little less than ￡200,000. In the preface to the catalogue it is stated that it was compiled in accordance with a plan suggested by Dr. Samuel Johnson. His Majesty’s Librarian was Sir Frederick Barnard, who survived his royal master, and continued to hold the appointment until the library became national property. He died at the age of 87 on the 27th of January, 1830. Soon after the reception of the gift, a select Committee of the House of Commons reported (April 18, 1823) that a new fire-proof building ought to be erected to preserve it from all risks, and accordingly the present east wing of the Museum was built, at the cost of ￡140,000, by Sir Robert Smirke. The upper floor, though it has been used for the Natural History collection, was intended for a picture gallery and for the reception of MSS. The new building was completed in 1826, but the library was not opened for two years afterwards. The room is 300 feet in length, 55 feet in width in the centre, and 31 in height. The presses are all glazed to preserve the books from dust. In the centre of the room are four 116columns of Aberdeen granite, each of a single piece, surmounted by Corinthian capitals of Derbyshire alabaster. Over the door are inscriptions, one in Latin and the other in English, in these terms:—“This Library, collected by King George III., was given to the British Nation by his Most Gracious Majesty George IV., in the third year of his reign, A.D., MDCCCXXIII.” As to the reality of the gift to the nation there is some doubt; for it appears that George IV., having some pressing call for money, did not decline a proposition for selling the library in question to the Emperor of Russia. Mr. Heber, the bibliographer and book collector, having ascertained the facts, and that the books were in danger of leaving for the Baltic, sought an interview with Lord Sidmouth, the Home Secretary, and stated the case, observing—“What a shame it would be that such a collection should go out of the country!” to which Lord Sidmouth replied, “It shall not;” and, as it proved afterwards, the library was presented to the nation, but on condition that the value should be paid, which was done from the surplus of certain funds furnished by France for the compensation of “losses by the revolution.” With this necessarily brief account of the rise and progress of the British Museum, we return now to the immediate subject of these memoirs. In the previous chapter reference has been made to Panizzi’s dislike to the appellation of “foreigner” a dislike, which, indeed, he always entertained. The act of naturalization took place scarcely one year after he became a servant of the Trustees of the 117British Museum. It bears the date of March 24th, 1832, and was, as might be expected, a source of great satisfaction to him. It has already been noticed that the National Institution had previously enrolled amongst its increasing staff other foreigners, who all held important, if not responsible, appointments—viz., Dr. Maty, a Dutchman, and the very first Under-Librarian of the Department of Printed Books, afterwards Principal Librarian; Dr. Solander, a Swede, and Joseph Planta, a Swiss, besides Charles K?nig, a German. Of these, strange to say, not one was naturalized. Panizzi was now an Englishman after his own heart, and his subsequent political career will amply testify to the pride he took in being so. His suitability for the appointment and the causes which led to his selection for so responsible an office, will be best understood from the Archbishop of Canterbury’s own statement before the select Committee on the British Museum, which sat in 1836; but on this subject more will be said hereafter. His answer (No. 5,511) to a question put to him was as follows:— “Mr. Panizzi was entirely unknown to me, except by reputation; I understood that he was a civilian who had come from Italy, and that he was a man of great acquirements and talents, peculiarly well suited for the British Museum; that was represented to me by several persons who were not connected with the Museum, and it was strongly pressed by several Trustees of the Museum, who were of opinion that Mr. Panizzi’s appointment would prove very advantageous for the Institution; and considering the qualifications of that 118gentleman, his knowledge of foreign languages, his eminent ability and extensive attainments, I could not doubt the propriety of acceding to their wishes.” The news of his appointment was first communicated to him on the 25th of April, 1831, by the Right Hon. Thomas Grenville. “I am just come from a meeting of the Trustees of the Museum and have the satisfaction of telling you that your name, when proposed to succeed to the vacant Assistant Librarianship, was received with high testimony to you, universally approved, and the Archbishop said he would lose no time in signing the appointment, and in obtaining the Chancellor’s concurrence. The appointment was ￡200 per annum for five days in the week, and ￡75 for extra attendance to Mr. Walter. I am very glad of your success, and think that your appointment will be of great value to the Museum.” That the Trustees were satisfied with the performance of Panizzi’s duties there can be no doubt, and it will be interesting to record his earliest labours. His first report is dated May 4th, 1831, in which it is stated that he was engaged in transcribing a catalogue of duplicates to be submitted to the Royal Society for their selection. This duty was soon followed by cataloguing an extraordinary collection of tracts, illustrative of the history of the French Revolution, and formerly the property of Mr. Croker. That it was no easy task, and that it demanded special attention, may be gathered from a letter which the cataloguer addressed on the 18th of April, 1834, to Mr. Baber, then his superior officer:— “1st. As to the omission of the Christian name of the author, when his family name is given. 2nd. As to the great proportion of anonymous tracts. 1193rd. As to the number of works without any author’s name or title whatever, or with so vague a title as to be of no use for the purpose of cataloguing the work.” He continues:— “Much time is spent in searching for names or for authors, and in glancing over tracts to see what is their subject, to catalogue them properly, after a most tedious search proves useless with respect to the first point, and no evidence remains of the trouble and loss of time which it causes. I cannot catalogue more than forty tracts each day.” As it is a matter of importance that Panizzi’s stormy connection with the Royal Society should be fairly and impartially added to these memoirs, and as we have now arrived at the period when, for the proper elucidation of the facts thereto belonging, the whole circumstances of the case should be thoroughly weighed and dwelt upon, it will be necessary to devote a few pages to a clear account of the proposal made by that Society, of the obstacles that were placed in Panizzi’s path, in his conscientious endeavours to fulfil the obligations imposed on him, and of the untiring zeal and patience he displayed in doing his duty in the matter, and in opposing the force with which it was attempted to crush the evidence of his superior talent, and to trample under foot even the Society’s own verbal agreements upon which, as coming from a body of men beyond suspicion, Panizzi relied. The whole of that opposition was successfully surmounted by his undoubted genius. Biographers generally have to undergo the tedium of monotony in their faithful endeavours to reproduce the lives of those whose careers they pen, and it is only at certain epochs in the course of the lives of 120consistent men that an opportunity is afforded for a discursive chapter such as is now presented to our readers. It deserves, however, due consideration, and has its value as a proof of the forbearance, learning, and perseverance of the man of whom we are writing; whilst it, without doubt, throws somewhat into shade the members of a very learned Society, who vainly strove, first from want of knowledge of their own requirements, and secondly from non-appreciation of him with whom they had to deal, to undervalue true talent, and, by their associative power, to make a show of quashing not only Panizzi’s (subsequently proved) intelligence, but also his right to acknowledgment for the new light he threw upon their want of accuracy and knowledge for the work which they had confided to him, and for which they should—some, at least, must—have known he was so eminently fitted. The origin, progress, and déno?ment of this affair cannot be brought within very small compass; but attracting (as they did at the time) the notice of many literary men, are worthy of some space in this volume. It would be amusing to watch the progress of this attempt to thwart Panizzi’s intentions for the development of that which he so well understood, even were it not also a necessary record of the heartburnings of, and wrongs done to, one who, justly confident in his own position, had to prove, step by step, willingly or not, for his own defence, his superiority to those whose business it was to direct him, and not to derive from him their inspiration. To proceed, then, as we have intimated above, in reference to the connection of Panizzi with the Royal 121Society; and to give our readers a clear conception of that connection, it will be necessary to make considerable quotations from his own letters and notes, for which, considering their importance as indications of his learning, and humility under adverse treatment, it will scarcely be necessary for us to offer any apology. In the year (1832-33) the Royal Society, from the incompetency of those who had taken the matter in hand, found it advisable to engage the services of some known and experienced cataloguer to revise a work, which had been begun on their behalf by one of the members, whose presumption and arrogance cannot be better proved than in the mild unassuming language of Panizzi himself:— “So long ago as October, 1832, I happened to meet Dr. Roget at dinner, who told me that the Catalogue of the Royal Society, of which a sheet had been set up in type as a specimen, had been found to require revision in passing through the press, and that a Committee, on that very day, had requested him to ask me whether I would undertake the task. I said that I had no objection, and I received from him a proof of the sheet in question. The same evening, on my return home, glancing over it, I was astonished at the numberless errors by which it was disfigured. The more I looked into it, the worse did it appear, and I soon felt convinced that it was utterly incapable of correction. I immediately wrote a note to Dr. Roget, stating the conclusion to which I had come, and begging to decline to have anything to do with a work which I felt satisfied would be disgraceful to the Royal Society, and to any person who should venture to meddle with it. Either in that note, or verbally, shortly after, I mentioned to Dr. Roget that it would be necessary for the Royal Society to have an entirely new Catalogue, compiled in such a manner as would answer the expectations 122which the public had a right to form; adding, that, although I would never attempt to correct what had already been done, I was ready to undertake a new compilation. I had no idea when I so candidly expressed my opinion, that I was making a powerful and unrelenting enemy in one of the most influential officers of the Royal Society, who, as I have learned since, had put together the titles of books which were to form the Catalogue, and was so well satisfied with his performance as to order a very large number of titles to be set up in type; whatever, in fact, he included in classes, which he called: Mathematics, Astronomy and Navigation, Mechanics, Optics, Transactions, Tables and Journals. The Members of the Catalogue Committee, on being informed of what had passed between Dr. Roget and myself, perceived that my opinion, as to the value of the work done, was correct, and it was resolved that the compilation of a new Catalogue should be intrusted to my care. Thus, not only all that had been done was undone at once, but the time which had been lost, and, what is more, the unwarrantable expense incurred by sending so large a proportion of the ill-digested work to press, was thrown away. Such is the origin of my connection with the Royal Society.” This is an extract from a letter dated 28th January, 1837, from Panizzi to his Royal Highness the Duke of Sussex (then President of the Royal Society), a letter wherein is fully set forth his whole conduct in the case, and which, besides revealing the puerile and almost unpardonable errors he detected in the titles brought under his notice, is a wonderful certificate to the patience, endurance, and acuteness of a gentleman who was called upon to contend, single-handed, with a corporate body, supported by a clique necessarily jealous of its own distinction. We shall now explain as clearly as possible the course pursued by the Society, and the pains-taking, 123much enduring way in which Panizzi met his opponents. Let us, therefore, continue to extract from the memorable letter to H.R.H. the Duke of Sussex, those passages wherein are particularized the egregious blunders of Panizzi’s predecessor in the work:— “Authors’ names were not better treated than the subjects. Bonaventura, the Christian name of Cavalieri, was taken for a family name, and a cross reference put from it to Cavalieri; of the three mathematical decades of Giovan Camillo Gloriosi, one was put under Camillo, his second Christian name, and the remainder under his family name Gloriosi. On entering a collection, the word Collezione was taken for a surname, and Nuova for a christian name, and thus the entry is to be found “Collezione (N.)” I will not notice mere errors of the press, of which the number is prodigious; but there are entries which prove abundantly that the printer was not to be accused of them. Cossali’s History of Algebra in Italy was printed Nella Real Tipografia Parmense, and Parmense was gravely inserted as the name of the place where the book was printed. Da Cunha’s mathematical principles were translated into French by D’Abreu after the author’s death, and have this title: “Principes Mathématiques de feu J. A. Da Cunha.” Anyone who has even merely heard of the “feu Lord Maire de Londres” may easily guess, without much knowledge of French, that feu here means late, i.e., deceased. The compiler of this Catalogue, however, did not attach such a gloomy meaning to this word; but philosophically conceived it to signify fire, as is evident by his precaution in writing it with a capital F, Feu; and by substituting the word Opuscules for the correct one, Principes, the following entry was made:— “Da Cunha (J. A.), Opuscules Mathématiques de Feu, traduits littéralement du Portugais, par J. M. D’ Abreu. 8vo Bordeaux, 1811. The idea conveyed to a Frenchman by this title would not be very clear, but it might possibly be understood that this is 124an infamous book, deserving to be burnt. It is a fortunate thing for feu Mr. Da Cunha, that this libel on his fair name was not published in his own country (he was a Portuguese) when he was living, and when the fashion was, not only to burn books, but authors; else, so dangerous an insinuation by the Royal Society of London might have exposed him to the chance of paying dearly for their blunders and bad French. If errors of so ludicrous a nature occur in the first sheet which was so often revised, one may easily conceive in what state that part of the catalogue was which was set up, but not corrected. As a specimen I transcribe three entries in the last slip, containing a list of names put down pêle-mêle, of works said to be mathematical. Litheosphorus, sive de lapide Bononiensi lucem in se conceptam ab ambiente claro mox in tenebris mire conseruante liber Fortunii Liceti Genuensis pridem in Pisano, nuper in Patauino, nunc in Bononiensi Archigymnasio Philosophi eminentis. 4to. Utini, 1646. I suspected at one time, that the error arose from Litheosphorus being mistaken for a star, and no attention being paid to that explanation “sive de Lapide Bononiensi.” I am now satisfied that my suspicion was unfounded, and that the blunder is gravely, deliberately, and learnedly perpetrated; it is not to be attributed to the mere ignorance, that lapis means a stone, not a star, but to a very ingenious process of reasoning, by which phosphorus was metamorphosed into a heavenly body. To demonstrate in “as correct and complete” a manner “as the circumstances of the case will allow,” I beg to call Your Royal Highness’s attention to another work by Liceti, which does exist in the library of the Royal Society, and which was catalogued in the following manner, in the specimen now under consideration. Licetus (Fort). De Lun? sub obscura luce prope Conjunctiones Libri III. 4to. Utini, 1641. 125In my proofs it stands thus: Licetus (Fortunius). De Lun? subobscura luce prope conjunctiones, et in eclipsibus observata. 4to. Utini, 1642. Your Royal Highness may have heard of the Board of Agriculture having sent for twelve copies of Miss Edgeworth’s essay on Irish Bulls, for the use of that Institution, and this ludicrous mistake was thought so exquisite, that no one would have fancied it could possibly be equalled. But the attempt at cataloguing drawn up by some learned astronomers, the ornament and pride of the Royal Society, proves that among the members of this famous Institution, there are some who could leave the whole Board of Agriculture in the shade. The work on star-fish, mistaken for a work on constellations, not only is adorned with plates, showing that it treated of aquatic not heavenly bodies, but on the very title-page there is an oval engraving representing on the upper half the heavens covered with stars, and the lower half, the sea with star-fish; with the motto, sicut superius ita est inferius, which was taken literally by the acute individual who made this entry, and who very mathematically argued that the stars below, must belong to the domain of astronomical science, if they be, as the author declares, like those above. On the recto of the following page a dedication of the work occurs to Sir Hans Sloane, as President, and to the Fellows of the Royal Society, which probably was either passed over unread by the modest fellow who catalogued the book; or served to dazzle his understanding with such passages as this: “fulgent sidera in c?lis, in orbe litterario illustris vestra Societas. Sideribus inscribere stellas convenit.” But how could any one doubt that the work was astronomical, when the writer provokingly begins his preface: “C?lorum spectare sidera decet juvatque Astronomos.” It is true he continues: “Physicorum interest stellis marinis visum intendere.” But this was probably taken for a figurative speech; and with that bold decision by which great men are distinguished, this work on so inferior a subject as star-fish, dedicated to the Royal Society, was by the élite of that same 126body declared to be a treatise on much higher bodies, on constellations, and consequently classed among astronomical books, whilst I, thinking marine stars to be animals, did not dare to follow an example so splendidé mendax, and classed the work among others on zoological subjects. What a difference, both with respect to the length of the title and the classes in which it was entered! Linckius would rise from his grave, were he to see mis-classed a work, which, as he said, he had dedicated to the resplendent constellations forming the Royal Society of his days, just because it treated of stars! How fortunate that the learned persons who are to render my Catalogue correct and complete have it still in their power to appease his indignant shade by re-classing the work among astronomical treatises! These few specimens will satisfy any one of the justice of my assertion that it was impossible to correct such a work. I am fully aware of the difficulties, nay, of the impossibility, of compiling any catalogue which shall be free from errors of a very grave description. No work requires more indulgence than one of this sort; but the specimens which I have given are such as cannot admit of excuse or palliation: they must at once convince the most indulgent observer that those who committed them were incapable, utterly incapable of performing the task they had undertaken. After what we have seen, shall we wonder that Newton’s Principia should be misplaced? We cannot wonder; but by Your Royal Highness, who has the honour to fill the chair once occupied by that immortal man, and by those Fellows of the Royal Society who are not unworthy of the distinction, something like sorrow must be felt, when they see in the catalogue of their Library that work classed among pure Mathematics, as if Mechanics had nothing to do with it.” How amusing are some of Panizzi’s remarks, and how fully do they evince the supreme contempt he must have felt for the ignorance displayed in the sheets, which were submitted for his correction. It is 127impossible not to help dwelling on and re-quoting such a sentence as this: “It is a fortunate thing for feu Mr. Da Cunha that this libel (the utter non-appreciation of the word feu) on his fair name was not published in his own country (he was a Portuguese) when he was living, and when the fashion was not only to burn books, but authors.” This must have been a cutting but amusing hint for His Royal Highness, and then we perceive the manly tone of Panizzi when he added: “So dangerous an insinuation by the Royal Society of London might have exposed him to the chance of paying dearly for their blunders and bad French.” In October, 1833, the New Catalogue, entrusted to Panizzi was commenced; not, however, left to his own discretion, for cabined, cribbed, confined, he was called on to follow a plan, concocted by the Library Committee, of which he incidentally remarks: “Heaven forbid that I should ever be supposed guilty of having approved of it, or be suspected capable of selecting such a plan, had I been at liberty to execute the work as I pleased. I agreed to carry their plan into execution on my own responsibility.” The agreement entered into with the Council of the Society was only a verbal one, and, by its terms, the compiler of the Catalogue was to be paid according to the number of titles written, and at certain stages of his labour, the first instalment when the whole of the titles were written, the second when they were ready for the printer, and the third when the book was completed. This agreement or contract was never reduced to writing. Panizzi, it may be, was inexperienced 128in a business point of view, but it is more probable that he placed implicit confidence in the understanding with the Council, through the Chairman Mr. Lubbock. As the work progressed, however, the members of the Library Committee appear to have conceived that they had a right to interfere with the execution of the work. The compiler firmly resisted this, and it was ultimately conceded that any proposals of the Committee were to be regarded merely as suggestions. In the course of a year Panizzi, having nearly completed the writing of the titles on slips of paper, applied for the first instalment of the remuneration in proportion to the number he had written. What must have been his mortification to find that the Council would not accept his computation, but referred his account to an underling, in consequence of whose report they reduced the demand by one-third. The consequent offer was rejected, and Panizzi’s claim afterwards admitted by payment of the full amount. A similar difficulty or objection arose about the second instalment, due in July, 1835; when, after the Council had voted but one half the amount, they ultimately granted the other, and the whole was paid. When matters had progressed to the final stage, the revision of the printer’s work for press, Panizzi had again occasion to complain of the interference of the Catalogue Committee, and of insufficient access to the books. The Council hereupon took the opinion of certain then well-known bibliographers, which was unanimously 129in favour of the compiler, nevertheless it was resolved “that Panizzi he no longer employed in the formation of the Catalogue.” The Council had only paid a portion of the value of the work in its possession, had refused arbitration, and by their summary resolution thought to escape further liability. Not so thought Panizzi. He maintained his claim, and the matter, after narrowly escaping the intervention of the law, was settled satisfactorily through the good offices of friends. The summing up of his case, as expressed by himself, in concluding his letter to the Duke of Sussex, is worthy of reproduction here. “It would be an empty boast were I to say that the pecuniary loss which I must needs submit to is indifferent to me. It is no such thing; yet I can conscientiously say, that I should never have taken the trouble of writing on this subject, had the pecuniary loss been the only consequence of the conduct of the Council towards me. But, after the observations made by Your Royal Highness, were I to submit without stating the whole truth, I might be suspected guilty either of unwillingness or incapability of fulfilling my contract, and that I could not brook. I have offered over and over again to the Council, through the secretaries, to refer our disputes to any two competent judges; the consciousness of their being in the wrong has made the Council shrink from this fair proposal. I can and will do no more. If, however, Your Royal Highness considers it no more than due to the character of the Royal Society, that the transactions between the Council and myself should be thoroughly and openly investigated, I will readily and cheerfully submit them to the consideration of a tribunal so constituted. If, on the contrary, Your Royal Highness be advised that no further steps need be taken in the matter, I shall have my own 130opinion of the conduct of the Council, and of the Society at large, as well as the Public, will be at liberty to form their own. They will perceive that a contract was entered into between the Council of the Royal Society and myself for the performance of a literary work: That the Council broke the terms of that contract: That they refused to state by what right they did so: That they would never answer my proposals of referring to arbitration any point in which they thought I did not act in accordance with our agreement: That, after the rudest and most uncourteous proceeding, they stooped to having clandestine access to private drawers containing the proofs of what they owe to me, and have now the meanness not to pay their debt, which, by their dishonest proceedings they are aware it is out of my power legally to claim.” Thus thwarted and impeded at every step, Panizzi at last succeeded in once again proving that right can contend successfully with might; and though years have elapsed since this unseemly treatment at the hands of a great and learned Society took place, it is well that the occurrence should not pass into oblivion, as it forms a conclusive proof of the determined astuteness of the man, of his endurance of character, and of his ability to judge of the weak points of his adversaries, a foretaste of his prowess in many a subsequent struggle in his oft-times arduous career. Panizzi’s dealings with the Royal Society having been thus satisfactorily disposed of, it will now be necessary to return to the more matter-of-fact conduct of this remarkably persevering man in his every-day efforts to attain that position which he held steadily in view—efforts which were finally crowned with success. At this time it was not an unusual thing, and especially during the absence of the Keeper, for him 131to spend some of his holidays, and evenings after official hours, in the Library; and it is a well-known fact that in the winter, when the Museum closed early, he remained at his post working by candle-light, which, however, was put a stop to on account of the alleged possible danger of the practice. About three years after his appointment, Panizzi was, in a report written April 26th, 1834, proposed by Mr. Baber to direct the General Catalogue then contemplated, Mr. Baber’s scheme of Cataloguing the books in the Library not having been adopted. Panizzi and other of his colleagues were desired to prepare titles for a new Catalogue. It appeared, by the end of the year (1834), that he had written a larger quantity of titles than any two of the other gentlemen, which assiduity gained for him the approbation of the Trustees. Panizzi’s own words before a Royal Commission on the 20th of May, 1848, were in these terms:— “In 1835, without my knowing anything about it, the Trustees found, from a return laid before them in the month of January, that I had been so fortunate as to do my duty well, and in a manner that satisfied them. Mr. Baber was called in (I know this from himself), and he was asked, I believe, if I recollect right, by the Bishop of London (Dr. Blomfield) how it was that I had done so remarkably well; and as there was an election going on, I remember the expression used (as Mr. Baber reported to me) was, that I was ‘at the head of the poll,’ Mr. Baber told me, that he had the goodness to answer that I was there, and that I would keep there. That led the Trustees to consider how I was remunerated, and they found that my remuneration was much lower than that of other people.” In consequence of this the adequacy of the remuneration in question was, on the 10th of January, 1835, 132referred to the Sub-Committee of Finance for their consideration; but at this meeting nothing material was resolved on, except that the claim was admitted, and the matter considered worthy of further deliberation. Sir R. H. Inglis was added to the Finance Committee for this purpose; but in June of the same year a meeting took place, with Lord Farnborough in the chair, when the following resolution was passed:— “That it is the unanimous opinion of the Sub-Committee that it would be desirable for the Trustees to mark, by an increased remuneration to Mr. Panizzi to the amount of ￡75 a year, that making up the sum that he would receive if he were an Assistant Librarian, their sense of Mr. Panizzi’s value to the Museum, and also of the particular service which, by his zeal and knowledge, he has rendered in an eminent degree to the advancement of the new Catalogue of the Printed Books.” The members present, beside the Chairman, were the Marquis of Lansdowne, Lord Ashburton, and the Right Hon. Thomas Grenville. Here, therefore, was strong admission of the inadequacy of Panizzi’s remuneration at the time, and strong special reasons were advanced to support that admission, as well as the proposal for a more adequate salary. It was necessary for this resolution to be submitted to the General Meeting on July 11th, 1835. Another minute was then passed openly against the principle affirmed six months previously; it ran:— “The Trustees, having taken into their consideration the Report of the Sub-Committee of June 20th, although entirely concurring in the opinion expressed by the Sub-Committee as to the zeal and ability with which Mr. Panizzi has discharged the duties of his office, and desirous of evincing the sence which they entertain of his services to the Museum, yet feel themselves 133to be precluded, by the general principles upon which the scale of remuneration to officers in similar stations and with the same degrees of responsibility must of necessity be framed, from adopting a rate of payment to Mr. Panizzi differing from that which is fixed for the office which he at present holds in the Museum.” It might be interesting to inquire into the motives of the Committee, in taking the adequacy of the remuneration in question into their consideration. Was the concession made to the office or to the man who held it? But we need not pursue this. The minute of the General Meeting produced an unprecedented event. Mr. Grenville, one of the Committee present, when he saw what was taking place, rose, left the room, and never attended a meeting of the Trustees again. The increase was not granted. To preserve the correctness of our chronology, it is necessary to reserve an account of Mr. Grenville till much later on. It is fair to state that Lord Lansdowne and Lord Ashburton were not present on this occasion; but the Board considered it necessary to instruct the Secretary (then Mr. J. Forshall) to forward to Mr. Grenville a copy of the minute which he sent to Panizzi, with the following note:— “I do not lose a moment in transmitting to you, for your own custody, the minute made by the Trustees: it is at least an honourable testimony of the sense which they entertain of the value of your services in the British Museum, and as such I send you the original minute as I received it, and I beg you to keep it.—Yours, \u0026c., \u0026c., T. Grenville.” In March, 1837, the Keeper, Mr. Baber, gave notice that he intended to resign his post at midsummer. 134Mr. Cary, the celebrated translator of Dante, who was then an Assistant-Librarian, would have been the natural successor; but on account of his infirmities the Principal Trustees raised an objection to such an appointment. Now it is of great importance to us that these statements should be made known, for much controversy, angry discussion, amounting to personal vituperation, and many letters ensued on the appointment of Panizzi as Keeper of the Printed Books, which, notwithstanding, took place on the 15th of July of the same year. Meetings were held against the “Foreigner;” and one of the speakers made an open statement that Panizzi had been seen in the streets of London selling white mice: had it been a few years later, possibly the distinctive title of organ-grinder would have been added. The infirmities of Mr. Cary were well known, and Panizzi, out of regard and in fairness to him, never asked for the place, nor took any decided step for the purpose of obtaining it. On the 13th of March, 1837, he addressed a letter to the Archbishop of Canterbury and the other Principal Trustees, soliciting in general terms that if any appointment was to take place they would bear his past services in mind. The letter was to the following effect:— “British Museum, March 13, 1837. “My Lord Archbishop, It is reported, that, in consequence of the new arrangements which are going to be introduced into this establishment, some vacancies are likely to occur in the offices of 135the several departments. Having been so fortunate as to be honoured with the approbation of the Trustees for (as they were pleased to say in July, 1835), ‘the zeal and ability’ with which I have (during a period of nearly six years), discharged the duties of the office which I now hold in the British Museum, I venture to beg of your Grace, and the other Principal Trustees, to keep my humble services in view should any place become vacant for which I should be deemed qualified. I take the liberty of appealing to my past as an earnest of my future conduct, should the Principal Trustees deem it expedient to promote me to any higher situation than that which I now hold, and in which I might humbly but warmly second the views and wishes of the Trustees in extending the public utility of this Institution. In the hope that this application may receive the favourable consideration of your Grace and the other Principal Trustees, I have the honour to be, \u0026c., A. Panizzi.” The letters to the Lord Chancellor and Speaker were in the same terms. It was a common opinion that Mr. Cary had been ill-treated and passed over in favour of Panizzi. However, Samuel Rogers, the poet, a friend of Cary’s, after having strongly recommended the latter, thought that, considering his ill-health it would scarcely be acting fairly to the Principal Trustees, or to the public to press his claims. Mr. Cary saw the Speaker, who, in the course of conversation, said: “I heard of a Mr. Panizzi, who is next: What do you know of him?” What Cary’s answer was is not known; but it is certain that, when the post was declared vacant, the gentleman went to the Archbishop of Canterbury on the 24th of June, 1837, and 136again solicited the appointment, which, as might have been expected, was withheld. Panizzi, having heard of it directly from Gary, asked, in the presence of Mr. Baber, whether he would object to his applying for it, when he answered, “Not at all.” There and then Panizzi sat down and wrote this letter to the Archbishop:— “My Lord Archbishop, Since I had the honour of addressing your Grace, Mr. Baber has resigned the Keepership of the Printed Books in this establishment. I hope your Grace will not deem it presumptuous in me, to beg respectfully of your Grace and the other Principal Trustees to take my case into consideration, should they think it requisite to depart from the usual system of regular promotion, on appointing his successor. I venture to say this much, having been informed by Mr. Cary of the conversation he has had the honour to have the morning before last with your Grace, and beg to subscribe myself with the greatest respect, \u0026c., \u0026c. A. Panizzi.” No sooner was the promotion made known than the controversy began. It was a piece of favouritism, to a Foreigner, and an injustice to Mr. Cary. As to the first point, Panizzi was at the time personally unknown to the Principal Trustees. Of this there was sufficient evidence. There was ample precedent for the appointment of a Foreigner, and, if so, objections could not be made, especially to a naturalized Foreigner, and there was plenty of time for a better qualified person to come forward, as quite four months elapsed between Mr. Baber’s announced resignation and the appointment of a successor. If there was a semblance of injustice, it was because the claims of an individual 137had been postponed to the necessities of the Institution. Mr. Cary then thought fit to write the following letter to the Lord Chancellor Cottenham, which was published in the “Times” of July 18th, 1837. “The following letter has been sent to the Lord Chancellor by the Rev. H. F. Cary, the Translator of Dante, who seems to have been treated with extraordinary injustice:— ‘British Museum, July 17, ‘My Lord, I cannot suffer the communication yesterday made to me by our Secretary, of your having passed me by in the nomination to the vacant office of Librarian, and appointed a subordinate Officer over my head, to reach me without an immediate remonstrance against this disposal of your patronage. I have for the course of eleven years been constant in the discharge of irksome duties in this establishment; and at a moment when I was told to expect the reward never yet denied in this place to such claims, I find it snatched from me by yourself and the Speaker of the House of Commons, in the face of a recommendation from the other Principal Trustee, the Archbishop of Canterbury, the only one of the three who has been in the habit of attending here, and making himself acquainted with our proceedings. My repeated requests for a personal interview with your Lordship were met by refusal, and a desire to communicate whatever I had to say by letter. Three letters which I addressed to you were met by silence. In the last of these letters I endeavoured to answer the objections which the Archbishop with his usual humanity and consideration for the humblest of those who have any claim on his attention, had apprised me of, as existing on the part of the other Trustees. The objections were my age and the general state of my health. My age, between 64 and 65 years, it was plain, might rather ask for me that alleviation of labour which, 138in this as in many other public offices is gained by promotion to a superior place, than call for a continuance of the same laborious employment. My health for the last four years has been such as to allow me, with the interval of one fortnight only, to attend closely through every day to the business of my department. Before that time (and it was the only other instance of ill-health since I have been here) I had a severe illness, occasioned by domestic affliction, on account of which I was permitted to pass six months on the Continent, and even that time was not wholly lost to the Museum, as I availed myself of the opportunity to inquire into the state and management of the public Libraries in most of the principal cities in Italy, where chiefly my time was spent. Lest however, I should deceive myself as to the present state of my health, I thought it right to consult three medical men who best know the ailments I have been subject to. Their opinions I immediately laid before the Archbishop, and copies of them before yourself and the Speaker. They were unanimous as to my fitness in point of health for the place I solicited. On their testimonies and on his own previous knowledge of my character and services, the Archbishop was pleased to declare his determination to appoint me, with the understanding that if at any future time infirmity should render me unfit for my trust, I should resign. You, my Lord, and the Speaker, have refused to concur in the appointment, and have placed my subordinate officer, Mr. Panizzi, a Foreigner, who has been here some years less than myself, over me, and at the head of our national library. Being convinced that when the nomination to offices in the British Museum was intrusted by the country to men themselves holding high offices in the State, it was on the implied condition that they would either acquit themselves of their duty by an attention to its internal management, or abstain from active interference if they were conscious of having given no such attention. I feel that I owe it not merely to myself, but to my fellow-countrymen, to protest against your 139present decision, to call publicly for an inquiry into the mode in which my duty in the Museum has been performed, and into the particulars of what I have done, which may be ascertained by means of our monthly reports, and to demand for what reason a person in an inferior station has been preferred to me, in opposition to the only one of the three nominators who regularly inspects the minutes of the establishment, and is at all likely to have an intimate and accurate knowledge of its concerns, and to be capable of forming a just judgment concerning them. I am, \u0026c., H. F. Cary.’” In justification of Panizzi, Hallam’s opinion of his fitness for the post is given:— “Wimpole Street, July 6, 1837 My dear Sir, Henry Hallam You first mentioned to me, about two months since, the prospect of attaining a higher station in the Museum, in consequence of Mr. Baber’s resignation, and seemed rather desirous of testimonies to your literary and general character. The closer connection I have since had with the Museum does not, I think, make it improper for me to say what I would then readily have said had it appeared to me as requisite at that time; but you are, of course, perfectly aware that I am only to be considered as a private person, who has had frequent opportunities of seeing you in the Library. In the many conversations on literary subjects we have had together, both there and on other occasions, I have been struck with your extensive and very ready knowledge of books, which has several times been of much service to myself. Your zeal and activity in the Department 140are so generally acknowledged that no testimony of mine can be of much additional value, and the many private friends you possess, among whom I reckon not a few of my own, bear sufficient witness to the sincerity and integrity of your character. I am, \u0026c., Henry Hallam.” Panizzi then wrote to the Archbishop:— “British Museum, July 19, 1837. “I have just been informed by Mr. Forshall that your Grace has been pleased to concur in my appointment of Under-Librarian, and I must beg your Grace to accept my most sincere and respectful thanks for so much kindness. Your Grace will allow me to add that it will be the height of my ambition to show myself not unworthy of the honourable trust reposed on me, by a zealous discharge of the arduous duties of my office to the utmost of my humble powers. I have, \u0026c., A. Panizzi.” A fortnight had scarcely elapsed when a question arose on the subject of an official residence, and this involved a lengthy correspondence between Panizzi, the Secretary (the Rev. J. Forshall), and Sir F. Madden. The latter—who, from the outset, appears to have regarded his colleague in an inimical spirit (and no doubt the feeling was reciprocal)—evinced the greatest eagerness to take possession of a certain one of the lodgings which accompanied the appointments. Further details would weary the reader; it will, therefore, be only necessary to state that Panizzi was unsuccessful on this occasion in obtaining the house to which, according to his own account, he was entitled. 141The following letter, however, is worthy of perusal as a specimen of his persuasive and straightforward argument in the matter:— “British Museum, July 25th, 1837. I should not trouble you again with respect to the question now pending before the Trustees, as to the apartments to be assigned to Sir Frederick Madden and myself, did it not seem to me that the point of seniority is the one which will probably influence their determination. I am well aware that the Trustees are not bound to assign the best apartments to the Senior Under-Librarian; but should they be pleased to make seniority the ground of their decision, it is important that they should have clearly before them facts and dates. Mr. Baber resigned on the 24th of last June, and had his successor been immediately appointed he might have been installed in his office, and have had apartments assigned to him before you had vacated the office to which Sir Frederick has been promoted. The appointment of the successor to Mr. Baber, although made after your place had become vacant, preceded, nevertheless, that of your successor; and it seems to me that, however short the interval between the two nominations, he who was last elected cannot be senior with respect to the other. The circumstance of Sir Frederick having been an officer of this house for a longer period, appears not to affect the case, since the point is as to the seniority of the two Under-Librarians as such. I believe in the army or navy the point would not bear discussion. Mr. Baber had been in this house before Mr. K?nig,and to give Mr. Baber seniority over Mr. K?nig on their both being promoted at the same time, the appointment of the former gentleman was purposely dated earlier than that of the latter, and then no one doubted Mr. Baber’s seniority. It was not thought seniority would be given by the former services of Mr. Baber, or else both appointments might have been dated the same day, when they were actually agreed upon by the Principal Trustees. Yours, \u0026c., \u0026c., A. Panizzi. The Rev. Josh. Forshall.","sourceLink":"http://novel.tingroom.com/duanpian/2713/74591.html","bookId":1438,"book":{"id":1438,"title":"The life and correspondence of Sir Anthony Panizzi","description":"简介： The first chapter of these Volumes discloses the reasons which induced me to undertake the present Biographya task amounting to a labour of love, owing to the personal interest I have felt in it from beginning to end. How far, however, I may succeed...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2713","creation":"Aug 1, 2019 12:25:06 AM","modification":"Aug 1, 2019 12:25:06 AM"}}
