{"id":78500,"no":106,"title":"Page 106","content":"How sweet revenge would taste when the Bluejay had cured the book and his own rotting flesh! Dream of your revenge, Silver Prince, thought Fenoglio as he wrote down the Adderhead’s dark thoughts. Think of nothing but your revenge and forget that you’ve never trusted your daughter!\\n\\n \"Well, fancy that, he’s writing!\" The words were only a whisper, but the Adderhead\\n\\n ‘s face, so clear a moment ago that Fenoglio could have touched it, blurred and changed into the face of Signora Loredan. Meggie was with her. Why wasn’t the child asleep? It didn’t surprise Fenoglio in the least that her deranged great-aunt clambered around the branches by night, very likely in pursuit of every shining moth, but Meggie she was tired to death after insisting on climbing the trunk with Doria instead of being pulled up like the children.\\n\\n \"Yes, he’s writing,\" he growled. \"And he’d probably have finished long ago if people didn’t keep interrupting him the whole time.\"\\n\\n \"What do you mean, the whole time?\" replied Loredan. She sounded aggressive again, and she looked so silly in the three dresses she was wearing, one on top of the other. It was amazing she could find so many in her considerable size. Luckily, Battista had been able to make jackets for the children out of the monstrous garment she’d been wearing when she had stumbled into Fenoglio’s world.\\n\\n \"Elinor —\" Meggie tried to interrupt her, but no one could ever stop that busy tongue, as Fenoglio had discovered by now.\\n\\n \"The whole time, he says!\" Now she was letting wax from her candle drop onto the paper, too! \"Is he hard at work day and night making sure the children don’t fall out of these damn nests, is he climbing up and down this wretched tree to bring up something to eat? Is he repairing the walls so that the wind doesn’t kill us all, is he keeping watch? No, but people are interrupting him the whole time.\"\\n\\n Splash. Another drop of candle wax. And what a nerve she had, leaning over to look at the words he’d lust written. \"This really doesn’t sound bad,\" she informed Meggie, as if Fenoglio had dissolved into the cold forest air before their eyes. \"No, not at all bad.\"\\n\\n It was beyond belief.\\n\\n Now Rosenquartz, too, was bending over his lines, wrinkling up his glassy forehead so much that it looked as if water were tracing folds there.\\n\\n \"Oh, and do you, by any chance, want to deliver your opinion as well before I go on writing?\" Fenoglio asked him sharply. \"Anything in particular you fancy? You want me to put a heroic glass man into the story, or a fat woman who always knows best and will drive the Adderhead to such distraction that he’ll hand himself over to the White Women of his own free will? That would be one solution, I suppose.\"\\n\\n Meggie came up to him and put her hand on his shoulder. \"You don’t know how much longer you’ll need, do you?\" Her voice sounded so desolate. Not at all like a voice that had already changed this world several times.\\n\\n \"It won’t be long now.\" Fenoglio took great care to sound confident. \"The words are coming. They--\"\\n\\n He fell silent.\\n\\n From outside came the hoarse, long-drawn-out cry of a falcon. Again and again. The guards’ alarm signal. Oh no.\\n\\n The nest into which Fenoglio had settled hung over a branch broader than any street in Ombra, but once again he felt dizzy when he climbed down the ladder Doria had made him so that he wouldn’t have to let himself down on a rope. On the Black Prince’s orders, ropes woven by the robbers from bark and climbing plants had been stretched everywhere. In addition, the tree itself had so many air-roots and branches hanging down that there was always something to hold on to. Yet none of that could make you forget the deep void yawning under the slippery boughs. The fact is, Fenoglio, you’re no squirrel, he told himself as he clung to a few woody shoots and peered down. But for an old man, you’re not doing too badly up here.\\n\\n \"They’re hauling in the ropes!\" Signora Loredan, unlike him, was surprisingly agile as she moved through the air along the wooden paths.\\n\\n \"I can see that for myself!\" growled Fenoglio. They were hauling up all the ropes that went down to the foot of the tree. That boded no good.\\n\\n Farid came climbing down to them. He often joined the guards posted by the Black Prince in the top branches of the tree. Heavens, how could any human being climb like that? The boy was almost as good at it as his marten.\\n\\n \"Torches! They’re coming closer!\" he said breathlessly. ‘And do you hear the dog barking?\" He looked accusingly at Fenoglio. \"Didn’t you say no one knew about this tree? Didn’t you claim it had been forgotten, and the nests with it?\"\\n\\n Blaming him. Of course. Something goes wrong, and it’s all Fenoglio’s fault!\\n\\n \"Well? Dogs find forgotten places, too!\" he snapped at the boy. \"Why not ask who wiped out our tracks? Where’s the Black Prince?\"\\n\\n \"Down on the ground with his bear. Trying to hide him. The stupid creature just refuses to be hauled up!\"\\n\\n Fenoglio listened. Sure enough, he heard dogs. Damn it, damn it, damn it!\\n\\n \"So what about it?\" Of course Signora Loredan was acting as if none of it bothered her at all. \"They can’t get us down, can they? A tree like this must be easy to defend!\"\\n\\n \"They can starve us out, though.\"\\n\\n Farid understood more about situations like this, and Elinor Loredan suddenly looked rather anxious after all. And who was she staring at?\\n\\n \"Ah, so now I’m your last hope again, is that right?\" Fenoglio imitated her voice.\\n\\n \"Write something, Fenoglio, go on! It can’t be all that difficult!\"\\n\\n The children clambered out of the nests where they slept. They ran along the branches as if they were meadow footpaths, peering down in alarm. They looked like pretty beetles in the gigantic tree. Poor little things.\\n\\n Despina ran to Fenoglio. \"They can’t get up the tree, can they?\"\\n\\n Her brother just looked at him.\\n\\n \"Of course not,’ said Fenoglio, although Jvo’s eyes accused him of lying. Jvo was spending more and more time with Roxane’s son, Jehan, these days. The two boys got on well. They both knew too much about the world for lads of their age.\\n\\n Farid took Meggie’s arm. \"Battista says we ought to get the children into the top nests. Will you help me?\"\\n\\n Of course she nodded she still liked him far too much—but Fenoglio held her back.\\n\\n \"Meggie stays here. I might need her.\"\\n\\n Naturally, Farid immediately knew what he was talking about. In his black eyes Fenoglio saw the reborn Cosimo riding through the streets of Ombra and the dead men lying among the trees in the Wayless Wood.\\n\\n \"We don’t need your words!\" said the boy. \"I’ll send fire raining down on them if they try to climb up!\"\\n\\n Fire? An alarming word in a forest.\\n\\n \"Well, perhaps I can think of something better,\" said Fenoglio, and sensed Meggie’s desperate eyes on him. What about my father? they asked. Yes, what about him?\\n\\n Which set of words was more urgent now? Damn it, damn it, damn it!\\n\\n A few of the children began crying, and below him Fenoglio saw the torches that Farid had mentioned. They. shone in the night like fire-elves but with far more menace.\\n\\n Farid led Despina and Ivo away with him. The other children followed. Darius went to them, his thin hair untidy from sleep, and took the small hands that reached out in search of his. He glanced in concern at Elinor, but she just stood there staring darkly at the depths below, her hands clenched into fists. \\n\\n","sourceLink":"https://allnovel.net/inkdeath-inkworld-3/page-106.html","bookId":2721,"book":{"id":2721,"title":"Inkdeath (Inkworld #3)","description":"Storyline: CAUGHT BETWEEN THE COVERS OF A CURSED STORY... \\n Ever since the extraordinary events of Inkspell, when the enchanted book Inkheart drew Meggie and her father, Mo, into its chapters, life in the Inkworld has been more tragic than magical. \\n The fire-eater Dustfinger is dead, having sacrificed his life for his apprentice Farid\u0027s, and now, under the rule of the evil Adderhead, the fairy-tale land is in bloody chaos, its characters far beyond the control of Fenoglio, their author. Even Elinor, left behind in the real world, believes her family to be lost - lost between the covers of a book. \\n Facing the threat of eternal winter, Mo inks a dangerous deal with Death itself. There yet remains a faint hope of changing the cursed story - if only he can fill its pages fast enough. \\n Inkdeath - the captivating final tale in the Inkheart trilogy.\\n","cover":"https://allnovel.net/images/inkdeath-inkworld-3.jpg","author":"Cornelia Funke","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/inkdeath-inkworld-3.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 3:42:22 PM"}}
