{"id":78421,"no":26,"title":"Page 26","content":"\"Why would I be interested in that? I hope he’s dead and gone. Trodden underfoot.\"\\n\\n Grim-faced, Elinor went up to the shelves and took out haifa dozen books, supplies for another cheerless day in bed. \"Yes, trodden underfoot! By a giant. Or—no, wait!\\n\\n Even better — I hope his clever tongue is blue and sticking out of his mouth because they’ve hanged him!\"\\n\\n That brought a smile to Darius’s owlish face.\\n\\n \"Elinor, Elinor!\" he said. \"I think you could teach the Adderhead himself the meaning of fear.\"\\n\\n \"Of course I could!\" replied Elinor. \"Compared to me, the White Women are a bunch of sisters of mercy! But I’m stuck for the rest of my life in a story where there’s no part for me but the role of a batty old woman!\"\\n\\n Darius didn’t reply to that. However, when Elinor came downstairs again that evening to find another book, he was standing in front of the glass case once more, looking at the words Orpheus had written on the sheet of paper.\\n\\n CHAPTER 12\\n\\n BACK IN THE SERVICE OF ORPHEUS\\n\\n Of course, the city gates of Ombra were closed when Farid finally rode his stubborn donkey around the last bend in the road. A thin crescent moon shone down on the castle towers, and the guards were passing the time by throwing stones at the bones dangling from the gallows outside the city walls. The Milksop had left some skeletons hanging there; though, to spare his sensitive nose, the gallows were no longer in use. Presumably he thought that gallows left empty were too reassuring a sight for his subjects.\\n\\n \"Well, well, who comes here?\" grunted one of the guards, a tall, thin fellow propping himself on his spear as if his legs alone wouldn’t carry him. \"Take a look at this laddie!\" he added roughly seizing Farid’s reins. \"Riding around all on his own in the middle of the night! Aren’t you afraid the Bluejay will steal that donkey from under your skinny behind? After all, he had to leave his horse up at the castle today, so he could do with your donkey. And you he’ll feed to the Black Prince’s bear!\"\\n\\n \"I’ve heard the bear eats nothing but men-at-arms because they crunch so nicely in his jaws.\" As a precaution, Farid’s hand went to his knife. He felt too tired to be humble and perhaps it made him lightly reckless to know that the Bluejay had managed to get out of the Milksop’s castle safe and sound. Yes, he, too, found himself calling Silvertongue by that name more and more often, although Meggie was always cross if she heard him.\\n\\n \"Ho, ho, hark at the lad, will you, Rizzo?\" called the guard to the other man on duty.\\n\\n \"Maybe he stole the donkey himself to sell to the sausage-maker in Butchers’ Alley before the poor beast drops dead under him!\"\\n\\n Rizzo came closer, smiling unpleasantly, and raised his lance until the ugly spearhead was pointing straight at Farid’s chest. \"I know this fellow,\" he said. He had two missing front teeth, which made him hiss like a snake. \"Saw him breathing fire once or twice in the marketplace. Aren’t you the one they say learned his trade from the Fire-Dancer?\"\\n\\n \"Yes. What about it?\" Farid’s stomach muscles contracted. They always did when Dustfinger was mentioned.\\n\\n \"What about it?\" Rizzo prodded him with the spearhead. \"Get off your decrepit donkey and give us a bit of a show. Maybe we’ll let you into the city afterward.\"\\n\\n They did finally open the gates—after he had turned night into day for almost an hour for their pleasure, making the fire grow flowers as he had learned to do from Dustfinger. Farid still loved the flames, even though the crackling of their voices reminded him only too painfully of the man who had taught him all about them. But he no longer made them dance in public, he did it only for himself. The flames were all that was left to him of Dustfinger, and sometimes, when he missed him so much that his heart was numb with longing, he wrote his name in fire on a wall somewhere in Ombra and stared at the letters until they went out, leaving him alone, just as Dustfinger had left him alone.\\n\\n Now that Ombra had lost its menfolk, it was usually as quiet as a city of the dead by night. Tonight, however, Farid ran into several troops of soldiers. The Bluejay had stirred them up like a wasps’ nest and they were still buzzing around, as if that would bring the bold intruder back. Lowering his head, Farid dragged the donkey past them, and was glad when he finally reached Orpheus’s house.\\n\\n It was a magnificent building, one of the finest in Ombra, and the only one on this unrestful night with candlelight still shining through the windows. Torches burned at the entrance Orpheus lived in constant terror of thieves and their flickering light brought to life the stone gargoyles above the gate. Farid always shuddered to see them stare down with their bulging eyes, their mouths wide open, their nostrils distended, looking as if they were about to snort in his face. He tried to put the torches to sleep with a whisper, as Dustfinger often did, but the fire wasn’t listening to him. That happened more and more often now as if to remind him that a pupil whose master was dead was a pupil forever.\\n\\n He was so tired. The dogs barked at him as he led the donkey across the yard to its stable. Back again. Back in the service of Orpheus. He would so much rather have rested his head in Meggie’s lap or sat by the fire with Silvertongue and the Black Prince. But for Dustfinger’s sake he always came back here. Again and again.\\n\\n Farid let Jink climb out of the rucksack onto his shoulder and looked up at the stars as if he could find Dustfinger’s scarred face there. Why didn’t he appear to him in a dream and tell him how to bring him back? Didn’t the dead sometimes do that for those they loved? Or did Dustfinger come only to Roxane, as he had promised, and to his daughter? No, if Brianna was visited by any dead man it was Cosimo. The other maids said she whispered his name in her sleep and sometimes put out her hand to him, as if he were lying beside her.\\n\\n Perhaps he doesn’t appear to me in my dreams because he knows I’m afraid of ghosts, thought Farid as he climbed the steps to the back door. The main entrance of the house, which led straight out into the square, was of course reserved for Orpheus himself and his fine customers. Servants, strolling players, and deliverymen had to plow through the muck in the yard and ring the bell at the modest little door hidden at the back of the house.\\n\\n Farid rang three times, but nothing stirred. By all the demons of the desert, where was that Chunk? He had nothing to do but open a door now and then. Or was he snoring away like a dog outside Orpheus’s bedroom door again?\\n\\n However, when the bolt was finally pushed aside it wasn’t Oss who let him in but Brianna. Dustfinger’s daughter had been working for Orpheus for two weeks now, but presumably Cheeseface had no idea whose daughter was doing his laundry and scrubbing his pots. Orpheus was so blind.\\n\\n Without a word, Brianna held the door open, and Farid was equally silent as he passed her. There were no words between them except those that went unspoken: My fat her died for you. He left us alone for you, only for you. Brianna blamed him for every tear her mother shed. She had told him so in a low voice after their first day together in the service of Orpheus. \"For every single tear!\" Yet again, he thought he felt her glance on the back of his neck like a curse when he turned his back to her.\\n\\n \"Where’ve you been all this time?\" Oss seized him as he was stealing away to the place in the cellar where he slept. Jink hissed and ran off. Last time Oss kicked the marten he had almost broken Jink’s ribs. \"He’s been asking for you a hundred times over! Made me search every damn alleyway. I haven’t had a wink of sleep all night because of you!\" \\n\\n","sourceLink":"https://allnovel.net/inkdeath-inkworld-3/page-26.html","bookId":2721,"book":{"id":2721,"title":"Inkdeath (Inkworld #3)","description":"Storyline: CAUGHT BETWEEN THE COVERS OF A CURSED STORY... \\n Ever since the extraordinary events of Inkspell, when the enchanted book Inkheart drew Meggie and her father, Mo, into its chapters, life in the Inkworld has been more tragic than magical. \\n The fire-eater Dustfinger is dead, having sacrificed his life for his apprentice Farid\u0027s, and now, under the rule of the evil Adderhead, the fairy-tale land is in bloody chaos, its characters far beyond the control of Fenoglio, their author. Even Elinor, left behind in the real world, believes her family to be lost - lost between the covers of a book. \\n Facing the threat of eternal winter, Mo inks a dangerous deal with Death itself. There yet remains a faint hope of changing the cursed story - if only he can fill its pages fast enough. \\n Inkdeath - the captivating final tale in the Inkheart trilogy.\\n","cover":"https://allnovel.net/images/inkdeath-inkworld-3.jpg","author":"Cornelia Funke","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/inkdeath-inkworld-3.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 3:42:22 PM"}}
