{"id":78431,"no":37,"title":"Page 37","content":"Luckily, Meggie hadn’t read his thoughts this time. \"Resa?\" She tasted the roast meat and thanked Doria with a smile. \"She rode over to see Roxane.\" \"Roxane? But Roxane is here.\" Mo glanced at the tent used as an infirmary for the sick. One of the robbers was in there, curled up in pain probably from eating poisonous fungi — and Roxane stood outside the tent talking to two women who were nursing him. Meggie looked at her, bewildered. \"But Resa said she’d arranged to meet Roxane.\" Mo pinned the flower that had been meant for her mother to Meggie’s dress. \"How long has she been gone?\" He did his best to sound casual, but Meggie was not to be deceived. Not by him. \"She set out around midday! If she’s not with Roxane, then where is she?\" She was looking at him in bewilderment. No, she really had no idea. He kept forgetting that she didn’t know Resa nearly as well as she knew him. A year was not a particularly long time to get acquainted with your own mother. Have you forgotten our quarrel? he wanted to reply. She’s gone to see Fenoglio. But he bit back the words. Fear made his chest feel tight, and he’d only too gladly have believed it was fear for Resa. But he was as bad at lying to himself as to anyone else. He was not afraid for his wife, although he had reason to be. He feared that somewhere in Ombra, the words were already being read aloud that would take him back to his old world, like a fish caught in a river and flung back into the pond it came from. . . . Don’t be stupid, Mortimer, he thought angrily. Who is going to read the Words, even if Fenoglio really did write them for Resa? Well, a voice inside him whispered, who do you think? Orpheus. Meggie was still looking at him in concern, while Doria stood beside her hesitantly, unable to take his eyes off her face. Mo turned. \"I’ll be back soon,\" he said. \"Where are you going? Mo!\" Meggie hurried after him when she saw him go over to the horses, but he did not turn again. Why in such a hurry, Mortimer? the voice inside him mocked. YOU think you can ride faster than Orpheus can speak the words with his oily tongue? Darkness was falling from the sky like a scarf, a dark scarf smothering everything, the colors, the birdsong Resa. Where was she? Still in Ombra, or on her way back already? And suddenly he felt the other fear as bad as the fear of those words. The fear of footpads and nocturnal spirits, the memory of women they had found dead in the bushes. Had she at least taken the Strong Man with her? Mo uttered a quiet curse. No, of course not. He was sitting there with Battista and Wayfarer by the fire, and he had already drunk so much that he was beginning to sing. He ought to have known. Resa had been very quiet since their quarrel. Had he forgotten what that meant? He knew that silence of hers. But he had gone off with the Black Prince instead of talking to her again about what made her so silent — almost as silent as in the days when she had lost her voice. \"Mo, what are you doing?\" Meggie’s voice sounded faint with fear. Doria had followed them. Meggie whispered something to him, and he set off toward the Prince’s tent. \"Damn it, Meggie, what’s the idea of that?\" Mo tightened the horse’s girth. He wished his fingers weren’t shaking so much. \"Where are you going to look for her? You can’t leave this camp! Have you forgotten the Piper?\" She clung to him. Then Doria came back with the Prince. Mo cursed and put the horse’s reins over its head. \"What are you doing?\" The Black Prince stopped behind him, the bear at his side. \"I have to go to Ombra.\" \"Ombra?\" The Prince gently moved Meggie aside and reached for the reins. What was he to say to him? Prince, my wife wants Fenoglio to write words that will make me disappear before your eyes, words that will turn the Bluejay back to what he once was nothing but an old man’s invention, vanishing as suddenly as he appeared? \"This is suicide. You’re not immortal, whatever the songs say. This is real life. Don’t forget that.\" Real life. What’s that, Prince? \"Resa has ridden to Ombra. She set out hours ago. She’s alone, and it’s night. I must go after her.\" . . . and find out if the words have already been written. Written and read aloud. \"But the Piper’s there. Are you going to make him a present of yourself? Let me send some men after her.\" \"Which men? They’re all drunk.\" Mo listened to the night air. He thought he could already hear the words that would send him back — words as powerful as those that had once protected him from the White Women. Above him the withering foliage rustled in the wind, and the drunken voices of the robbers by the fire came to him. The air smelled of resin, autumn leaves, and the fragrant moss that grew in Fenoglio’s forest. Even in winter it was still covered with tiny white flowers that tasted like honey if you crushed them in your fingers. I don’t want to go back, Resa. A wolf howled in the mountains. Meggie turned her head in alarm. She was afraid of wolves, like her mother. I hope she stayed in Ombra, thought Mo. Even if that means I have to pass the guards. \"Let’s go back, Mo. Please!\" He swung himself up on the horse. Before he could stop her, Meggie was up there, too, sitting behind him. As determined as her mother.., she put her arms around him so firmly that he didn’t even try to persuade her to stay behind. \"Do you see that, bear?\" asked the Prince. \"Do you know What it means? It means there’ll soon be a new song—about the Bluejay’s sheer pigheadedness, and how the Black Prince sometimes has to protect him from himself.\" There were still two men sober enough to ride. Doria came, too, getting up behind the Prince on his horse without a word. He wore a sword that was too large for him, but he could handle it well, and he was as fearless as Farid. They would be in Ombra before it was light, although the moon now stood high in the sky. But words were so much faster than any horse. CHAPTER 18 A DANGEROUS ALLY When Resa arrived, Farid had just taken Orpheus his second bottle of wine. Cheeseface was celebrating. He was drinking to himself and his genius, as he called it. \"A unicorn! A perfect unicorn, snorting, pawing the ground with its hooves, ready to put its silly head in a virgin’s lap anytime! Why do you think there weren’t any unicorns in this world, Oss? Because Fenoglio couldn’t write them! Fluttering fairies, hairy brownies, glass men, yes, but no unicorns. Farid would happily have tipped the wine over Orpheus’s white shirt to make it as red as the coat of the unicorn. The unicorn brought into this world by Orpheus only for the Milksop to kill it. Farid had seen it. He had been on the way to Orpheus’s tailor to get yet another pair of trousers that had become too tight for Cheeseface altered. When they carried the unicorn by, he had felt so sick at the sight of those dull eyes that he had to sit down in a doorway. Murderer. Farid had been listening when Orpheus read the words that had brought it to life, such beautiful words that he had stood as if rooted to the spot outside the study door. It came through the trees, white as wild jasmine flowers. And the fairies danced around it in dense swarms, as if they had been waiting, fufl of longing, for its arrival. Orpheus’s voice had shown Farid the horn, the waving mane, had made him hear the unicorn snorting and scraping at the frozen grass with its hooves. For three whole days he had actually thought it might have been a good idea after all to bring Orpheus here. Three days, if he had counted them correctly—that was as long as the unicorn lived before the Milksop’s hounds chased it on to the huntsmen’s spears. Or was the tale Brianna told down in the kitchen the true version: that one of Sootbird’s lovers had lured it to them with her smile?","sourceLink":"https://allnovel.net/inkdeath-inkworld-3/page-37.html","bookId":2721,"book":{"id":2721,"title":"Inkdeath (Inkworld #3)","description":"Storyline: CAUGHT BETWEEN THE COVERS OF A CURSED STORY... Ever since the extraordinary events of Inkspell, when the enchanted book Inkheart drew Meggie and her father, Mo, into its chapters, life in the Inkworld has been more tragic than magical. The fire-eater Dustfinger is dead, having sacrificed his life for his apprentice Farid\u0027s, and now, under the rule of the evil Adderhead, the fairy-tale land is in bloody chaos, its characters far beyond the control of Fenoglio, their author. Even Elinor, left behind in the real world, believes her family to be lost - lost between the covers of a book. Facing the threat of eternal winter, Mo inks a dangerous deal with Death itself. There yet remains a faint hope of changing the cursed story - if only he can fill its pages fast enough. Inkdeath - the captivating final tale in the Inkheart trilogy.","cover":"https://allnovel.net/images/inkdeath-inkworld-3.jpg","author":"Cornelia Funke","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/inkdeath-inkworld-3.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 3:42:22 PM"}}
