{"id":31834,"no":14,"title":"CHAPTER XIV","content":"The doctor\u0027s words rang in Monsalvat\u0027s ear. \"Nacha has returned to the profession.\" How ironical the phrase! Profession, in truth, but of despair instead of faith in God, in law, in science! Yet oddly enough, this very relapse of hers gave him hope. He knew now where to look for her; and at the thought his blood ran faster. The very signs on the street corners spoke of finding her; automobile horns, the cries of street venders, all the incongruous voices of the enormous city, clamored to him that soon he would find Nacha. When his thoughts dwelt on all that was horrible, inhuman and painful in the life the girl must at that very moment be leading, his heart seemed to grow cold. No, it was better not to think.... Yet, were it not for these facts too horrible to think of, he might never trace her! So, with his friend the doctor, he began the search for Nacha, and also for his sister, although his recovery of Eugenia was now a secondary interest. Together they started on a painful and long journey through the circles of that living hell reserved for fallen women, a martyrdom among other more frightful martyrdoms. Yet these stages of his journey led him through only the first circles of that inferno; for it was in these first circles that he expected to find the two women he was seeking. There are other circles more frightful and more tragic still. With the doctor as his guide Monsalvat descended into these regions. The entrance gate was Madame Annette\u0027s front door; and upon it might very well have been blazoned forth \"Through me you pass into the city of woe, Through me you pass into eternal pain, Through me among the people lost for aye!\" But, alas, these were not the only gates of hell! Their number was infinite, and the women who passed through returned no more. However, the door of Mme. Annette\u0027s house was the principal gate, the gate of gold! \"Nacha Regules?\" the French woman repeated coldly. \"I don\u0027t know her.\" The doctor persisted however in his inquiries, for he had caught a false intonation in the woman\u0027s denial. Mme. Annette kept to her first statement; and as he watched her vulgar gestures and listened to her displeasing voice, Monsalvat felt an indefinable uneasiness. How could such a woman, disagreeable, coarse, bad-tempered as she appeared, have the patrons of the sort Torres asserted she had? Surely crime lurked under the apparent luxury of this place; and if this evil enchantress succeeded in satisfying her aristocratic clients, it was with morsels of delicate flesh obtained by the most unspeakable deceptions and cruelties! \"Shall I call in the girls?\" Mme. Annette asked abruptly, mistrustful of her callers; for she scarcely knew Torres and she had noticed Monsalvat\u0027s disgust. \"Let us go to the dining-room. Ask them to have a glass of champagne with us,\" the doctor replied. Three of the girls came in. One of them was the child with whom Nacha had made friends. Monsalvat started at sight of this young thing. His eyes flashed anger as he looked at Mme. Annette, who lowered hers, more frightened than ashamed. Torres called the child to him and she sat down on the sofa beside him. Mme. Annette left her callers for a moment while she went to prepare the champagne. A fine-looking brunette, who declared herself a Paraguayan, entered into conversation with Monsalvat. Her eyes, indeed all her features, and her manner of speaking, bore witness to not very remote Indian ancestors. She knew nothing of Nacha or Eugenia, had never heard of them. Monsalvat, who thought every woman in this profession must be the victim of hostile circumstances, asked her to tell him her story. No doubt she too had suffered at the hands of father, or lover, or some exploiter of women! The girl, however, protested that the life she was leading was the only life for her. It meant pleasure, freedom, money; she did not have to work and heard nothing but pretty speeches from men. As she spoke a savage sensuality played about her eyes and lips. Obviously she loved pleasure for pleasure\u0027s sake. While she praised her profession she blew kisses into the air or pressed her arms tightly against her breasts in a kind of ecstasy; and she drank her champagne slowly, tasting its sweetness to the full, licking her lips, and looking mischievously at Monsalvat out of the corner of her eye. He was thinking meanwhile that though she was far from looking upon herself as a victim, she was one nevertheless. Who could tell what fatal inheritance was hers? The descendant perhaps of alcoholics who had sought in liquor some alleviation for the misery of their material circumstances, or for that other misery caused by the hatred and prejudices of their neighbors! A link by itself meant nothing. One had to consider the whole chain; evil could be born only of evil. Meanwhile Torres was obtaining information. The child beside him knew nothing of Eugenia but she recalled very distinctly a girl who had come there one afternoon. \"She felt so sorry for me,\" the child went on, \"and her name was Nacha. She went away, because she had a quarrel with Madame—I don\u0027t know what about—.\" Madame meanwhile had admitted to Torres, when he told her that they wanted to find Nacha for some reason connected with \"justice,\" that she had been there. \"You put her in jail, do! That\u0027s where she belongs! You ought to hear the language she uses! I\u0027m a respectable woman: I don\u0027t owe a cent to anybody, and I\u0027m a good mother! There aren\u0027t many who pay more for their daughter\u0027s education! Some of the best people in Buenos Aires are my friends and that impudent little hussy allows herself to talk back to me!\" As the two men were leaving they met an acquaintance of the doctor\u0027s at the curb. Just as she was getting out of a taxi Torres inquired of the seductive Amelia if she could give him any news of Nacha. \"Go to Juanita\u0027s. Someone told me only yesterday that she went there. I must say I don\u0027t understand Nacha. Juanita\u0027s of all places! Such a crazy thing to do! One must keep up one\u0027s position, don\u0027t you think? There\u0027s no need of stepping down in the world before one has to. She just lowers herself going to Juanita\u0027s.... How am I looking, darling Doctor? Am I getting old, do you think? Well, so long! Good-bye, old man!\" It was still only about six o\u0027clock; and they decided to go to the Sanmartino house then and there. Juanita received them in a large parlor, stuffy with hangings and filled with pretentious furniture. With her usual stately dignity and Victoria-like appearance, Mme. Sanmartino met her two callers very graciously. Monsalvat who was standing in the middle of the room saw a little girl of thirteen or so pass through the hall. He felt that behind the portières of the doorway women were watching; and it seemed to him that everywhere in that house, in the air, in the furnishings, were traces of Nacha; yet he divined also that he would not find her there. \"Yes, she used to come here,\" Juanita was saying in an ingratiating tone, slowly moving her head up and down. \"A very nice girl, too. Quite pretty! But she doesn\u0027t come any more. No doubt she has found somebody to take care of her....\" She stopped, and looked at both men fearing her words might have wounded one of them. Monsalvat had not been able to control a start. \"Well, anyway, she doesn\u0027t come here any more, but I don\u0027t know why. Sometimes our patrons take girls away from the house—and set them up. But I don\u0027t think that in this case....\" Monsalvat turned pale. He had lost her again! But Torres inquired the name of the patron who had made friends with Nacha, and Juanita gave it to him at once. Then, in the silence that followed, the doctor looked at his friend and nodded. Monsalvat understood. Now was the time to ask about Eugenia; but he had not the courage. Torres came to his rescue, but obtained no satisfaction. Perhaps the girl had changed her name! Monsalvat described her. But what good was his description? There were several girls in that very house who answered it. \"Did you see that child in the hall?\" Monsalvat asked nervously when he and Torres reached the street. \"That\u0027s Juanita\u0027s daughter. It\u0027s strange, isn\u0027t it? Juanita is sacrificing herself for that child. She hopes to work up a business that\u0027s good enough to sell, and then retire on a small fortune. It\u0027s for her daughter\u0027s sake that she exploits other women!\" Monsalvat demurred. \"Why did she keep her daughter in such surroundings?\" \"Why, those girls wouldn\u0027t say a word in that child\u0027s presence that she oughtn\u0027t to hear! Of course, now and then, they may let something slip without thinking. But, after all, that child couldn\u0027t help but consider that the relations between men and women are nothing but a simple business arrangement. She will see that the girls she knows sell themselves, and she too will sell herself, to some good fellow with a fortune; but her price will be not twenty or thirty thousand dollars but a hundred thousand. She\u0027ll make a good match.\" Monsalvat was losing hope. That inferno was too vast, the catacombs of this subterranean world too obscure and intricate! Torres, as if to cheer him, drew a paper from his pocket. It was a sinister, a terrifying list of two hundred houses of the kind they had just visited, some of them aristocratic, some of them middle class, most of them modest or shabby; and somewhere in these houses were the women they sought! Monsalvat kept the list, but decided to continue his search alone. He could not take up more of the doctor\u0027s time. Torres insisted, however, on taking him to a house where there was a good chance of obtaining information. They sent in their names and a servant ushered them into a room which had none of the perfumed, wholesale, elegance of Mme. Annette\u0027s house, nor the heavy, mediocre luxuriousness over which Juanita queened it. Here everything was extremely simple without being actually shabby. The owner of the establishment was not long in appearing. \"Florinda,\" said the doctor, \"this is my friend Monsalvat—and this is my friend Florinda, the most charming of creoles....\" \"At your service, gentlemen. I am entirely at your orders, but don\u0027t believe what this flatterer says. He\u0027s an old friend—from good old times, long past. But sit down sir! So honored by your call....\" Florinda, a creole, in the forties, tall and thin and decidedly plain, was married, and had a battalion of children whom she kept at the back of the house. The youngest was six months old. Her husband was obligingly unaware of his wife\u0027s occupation; and he was too prudent, \"too good-natured,\" Florinda put in, to inquire as to the source of the money which supported him. He always left the house early in the morning and returned late at night. He loved and admired his faithful consort, model of wives and housekeepers, and always proclaimed her a \"thorough lady.\" His own claims to distinction, a slow and pompous manner of speaking, exaggerated manners, constant praise of his wife\u0027s good qualities and his amazing physical beauty, attached her with unbreakable bonds to this ideal husband. \"Oh, you want to know something about Nacha, sir?\" Florinda murmured, in her thin and somewhat sleepy voice. \"Yes, I know her. Distinguished, isn\u0027t she? Always very correct, and very kind! I know her. I have the pleasure of her acquaintance, and I have always been very fond of her, for I know how to value people, and I always recognize good breeding. I can\u0027t bear people who are ill-bred. And I always say that breeding is something that can\u0027t be taught. You get it in your cradle. Good blood is the best certificate....\" The conversation went on at length. Torres always found this woman amusing. Now and then he produced a word or phrase of double meaning, whereupon Florinda would lower her eyes, and smile, looking like a plump, good-natured cat. However, she did not know Nacha\u0027s lodging place, and had never heard of Eugenia. The two friends left, Florinda taking leave of them with a whole series of bows, pretty speeches, and every manner of courtesy. \"Now there\u0027s a woman who really thinks she\u0027s respectable and she sold her own daughter. Queer, isn\u0027t it?\" \"We are all responsible for things such as that,\" Monsalvat exclaimed, as if thinking aloud. \"In that sale, the man who bought the girl was guilty, and the parents and friends of the man to whom she was sold had their share of guilt; and the teachers who taught that man; and the authors of the books he read. For who of all these prevented that sale? And what law have the law-makers devised to abolish these evils? And weren\u0027t all those who looked on, and did nothing to prevent, accomplices?\" Torres did not accept this collective guilt. From his point of view the man responsible for a crime was the man who committed it or the man who helped directly. Society? Bah! What was society but an abstraction? Only the individual exists, and society is made up of individuals. Monsalvat took leave of the doctor because he did not want to discuss theories with him; he was in no mood for discussion. He affirmed, and roundly, dogmatically, sometimes with the ideas and often in the very language of the prophets.... Monsalvat, his list in his pocket, continued his journey next day through the regions of the accursed. Two days later, as his eye fell quite by chance on the police news in the morning paper, he learned of his sister\u0027s death. The item gave the drug addict\u0027s name, mentioned her career as a courtesan; and after thus delivering over to public ignominy a respected name, went on to moralizings of the kind always available in the make-up rooms of certain newspapers. Eugenia\u0027s death, and under such conditions, was a heavy blow. Monsalvat suddenly grew ten years older. Now he was indeed alone. His attempts to find Nacha became frantic; failure exasperated him. No sooner was he out of his office in the afternoon than he jumped into a taxi and started off on his search; so all October passed. But these regions of the lower world cannot be traversed with impunity by the first corner. Monsalvat did not know the ways of these circles; and he experienced annoyances, insults, all manner of humiliation. In some houses they demanded money. In one he was robbed. On more than one occasion he failed to gain admission and was bespattered with gross words from within the fast-locked doors; and all the while he suffered for these unhappy inmates as well as for himself, and came out from his exploration of the dark wood of evil, his heart bleeding, his soul aching, and his brain confused and exhausted. Everything was useless! Nowhere was there trace of Nacha. Time and hope were passing, and Monsalvat began to have periods of doubt. Perhaps he would not find Nacha; perhaps he had not found himself! In moments of weakness he regretted the comparative happiness of his former life. He began to believe himself defeated, and fell into profound discouragement. He tried to forget; he planned several articles; he thought again of his proposed remodelling of the tenement building, held in check by the obstinacy of his tenants. Poor creatures! Exploited for centuries, their grand-parents, their parents, they themselves, knew nothing else; how could they then sense his good intentions? Their whole experience prevented it. They could not help believing that his plans concealed a new form of exploitation; and they considered his request for them to move as an infringement on their rights. They were now protesting angrily against the regulations of the new superintendent who was trying to make his tenants observe a few elementary practices of public hygiene. Monsalvat was anxious to have the work begun; for the sum lent him by the bank was in danger of disappearing what with his constant charities to people who really needed aid, and to those who imposed upon his good faith and sympathy. One afternoon in November he went to the tenement house. In its over-shadowed courtyard hungry, ragged children were running about; a few women waiting for a husband or a daughter to come home, sat paring vegetables, while someone at the back of the house played an accordion. The yard was littered with boxes, boards, baskets, broken flower-pots, and all sorts of articles. At sight of Monsalvat, the children began rushing from one end of the house to the other yelling that the landlord had come. One might have thought from their mother\u0027s expressions that they were announcing an enemy. The court was soon full of people, for many of the tenants were home from work at that hour. Monsalvat noticed a girl, rather well dressed, and wearing a large hat, who drew near to one of the groups as he began speaking: \"You showed me a little while ago that you did not trust me; and when I thought it over, I decided you did right, for I hadn\u0027t talked to you sincerely, although I tried to. But I didn\u0027t know how to tell you what is so simple after all; and it is that I can\u0027t help thinking of you all as my brothers, because you are my brothers; and I want to free you from needless suffering. I\u0027m not much. I can\u0027t do a great deal for you. I can\u0027t even give you this house because it\u0027s mortgaged; but it\u0027s mortgaged so that you can have air and light and sanitary conditions, so that you can live like human beings. All the money raised on this house will be spent on it to make it a good house to live in. Then you will come back to it and you will pay me very little rent, less than you pay now. All I want from you is enough to pay the interest on the mortgage. I could sell this house and rent another; but I cannot have you herded together like cattle! Please don\u0027t doubt me. I am not your enemy, I am your friend....\" But they did not understand. \"He\u0027s some joker,\" a sharp voice exclaimed. Someone else invited him to shut up and go away. That struck the crowd as humorous and there were bursts of laughter. The children, no longer scared, clapped and shouted. A creole, who was a typesetter and an anarchist, was about to make a speech in behalf of those who refused to accept the plan, when there was a sudden commotion. \"There\u0027s that street-walker turned traitor!\" yelled one of the women shaking her fist at the girl Monsalvat had noticed. Everyone turned on her, insulting her and threatening her. The girl defended herself vigorously; until suddenly she began to cry. This pacified the tenants. Only the women scoffed at her tears, not believing that one such as she could really weep. They would have liked to scratch her and tear out her hair in vengeance for her hats and dresses which seemed so fine to them. How ironical that this girl should be the only one of his audience to try to defend Monsalvat, and to insist that the plan he proposed was to everyone\u0027s advantage! Earlier in his career Monsalvat would have been amazed that of all these people, a good sort after all, no one but this girl should understand him! But now it seemed to him quite natural. He had learned that girls such as she know the full meaning of suffering; and he knew now that grief was the school for kindness and understanding. Moreover, a girl of this profession, even though born into the laboring class, does not belong to it. Through her dealings with the rich, she acquires the ways of the rich and she learns to understand these ways. In addition her experience of men teaches her that, if some of them are possessed of perversity and cruelty hard to conceive of, others have an equally unbelievable kindness of heart. Monsalvat saw that it was impossible to convince these people by any such methods as those he had tried, and went away. But he returned the next day, and every day; for he was determined to make friends with his tenants. He found work for some of those who needed it, and he was generous to those who could not pay their rent. One day he talked with the girl who had taken his side in the courtyard scene. She was a short, sad-faced little thing, who behaved so properly in the house that no one could have guessed the nature of her trade. He listened with sympathy but with no particular interest to the story she was telling him of her experiences, until she began talking about Florinda. Then it occurred to him to ask if she knew Nacha. She replied that she did not; but a week or so later she announced to him with a smile that she had just met the girl he had asked her about. \"You called her Nacha, didn\u0027t you? A slender girl who lived awhile with Pampa Arnedo? Well, go to this address. The house belongs to a woman who is paralyzed and pushes herself about in a wheel chair. I go there quite often; and Nacha and I are getting to be good friends.\" But Monsalvat was no longer listening. He could hear nothing now in the whole wide universe but the words ringing in his heart.... Nacha found! Nacha at this address! And he actually held the address on a slip of crumpled paper in his hand! Never had Nacha seemed so near as at this moment.... \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3110/85638.html","bookId":934,"book":{"id":934,"title":"Nacha Regules","description":"简介： An August night! Hot with the fever of her adolescence as a national capital, Buenos Aires was ablaze with millions of lights and rejoicing in noisy revelry.The Centennial festivities had been going on since May. Thousands of people had flocked in fr...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3110","creation":"Aug 1, 2019 12:23:52 AM","modification":"Aug 1, 2019 12:23:52 AM"}}
