{"id":94305,"no":25,"title":"Page 25","content":"Alustriel watched from her high perch as the southern face of Fourthpeak flickered with light that seemed to be blinking like the stars above. The exchange of enchanted pellets from the defenders and countering dark magic from the invaders was furious. As she brought her chariot around the southwestern cliffs, the Lady of Silverymoon grew terribly afraid, for the defenders had been pushed into a U formation, surrounded on all sides by goblins, kobolds, and fierce drow warriors. Still, the forces of the four armies fought well, practically back to back, and their line was strong. No great number could strike at them from the gap at the top of the U, the logical weak spot, because of the almost sheer cliffs, and the defenders were tightly packed enough along the entire line to hold against any concentrated assaults. Even as Alustriel fostered that thought, her hopes were put to the test. A group of goblins, led by huge bugbears, seven-foot, hairy versions of goblins, formed into a tight diamond and spearheaded into the defenders\u0027 eastern flank. The line wavered; Alustriel almost revealed herself with a flurry of explosive magic. But amidst the chaos and the press rose one sword above all others, one song above all others. Berkthgar the Bold, his wild hair flying, sang to Tempus with all his heart, and Bankenfuere hummed as it swept through the air. Berkthgar ignored the lesser goblins and charged straight for the bugbears, and each mighty swipe cut one of them down. The loader of Settlestone took a vicious hit, and another, but no hint of pain crossed his stern visage or slowed his determined march. Those bugbears who escaped the first furious moments of the huge man\u0027s assault fled from him thereafter, and with their leaders so terrified, the goblins quickly lost heart for the press and the diamond disintegrated into a fleeing mob. Many would be the songs to celebrate Berkthgar, Alustriel knew, but only if the defenders won. If the dark elves succeeded in their conquest, then all such heroics would be lost to the ages, all the songs would be buried beneath a black veil of oppression. That could not happen, the Lady of Silverymoon decided. Even if Mithril Hall were to fall this night, or the next, the war would not be lost. All of Silverymoon would mobilize against the drow, and she would go to Sundabar, in the east, to Citadel Adbar, stronghold of King Harbromme and his dwarves, and all the way to Waterdeep, on the Sword Coast, to muster the necessary forces to push the drow back to Menzoberranzan! This war was not lost, she reminded herself, and she looked down at the determined defenders, holding against the swarm, fighting and dying. Then came the tragedy she had expected and feared all along: the magical barrage, bursts of fireballs and lightning, lines of consuming magical energy and spinning bolts of destruction. The assault focused on the southwestern corner of the U, blew apart the ranks of the Riders of Nesme, consuming horse and man alike. Many humanoid slaves fell as well, mere fodder and of no concern to the wicked drow wizards. Tears streamed down Alustriel\u0027s face as she watched that catastrophe, as she heard the agonized cries of man and beast and saw that corner of the mountain become charred under the sheer power of the barrage. She berated herself for not foreseeing this war, for underestimating the intensity of the drow march, for not having her army fully entrenched, warriors, wizards and priests alike, in the defense of Mithril Hall. The massacre went on for many seconds, seeming like hours to the horrified defenders. It went on and on, the explosions and the cries. Alustriel found her heart again and looked for the source, and when she saw it, she came to realize that the dark elf wizards, in their ignorance of the surface world, had erred. They were concentrated within a copse of thick trees, under cover and hurling out their deadly volley of spells. Alustriel\u0027s features brightened into a wicked smile, a smile of vengeance, and she cut her chariot across at a sharp angle, swooping down the mountainside from on high, flying like an arrow for the heart of her enemies. The drow had erred; they were in the trees. As she crossed the northern edge of the battlefield, Alustriel cried out a command, and her chariot, and the team of enchanted horses that pulled it, ignited into bright flames. Below her she heard the cries of fear, from friend and enemy alike, and she heard the trumpets from the Knights in Silver, who recognized the chariot and understood that their leader had come. Down she streaked, a tremendous fireball leading the way, exploding in the heart of the copse. Alustriel sped right to the trees\u0027 edge, then banked sharply and rushed along the thick line, the flames of her chariot igniting branches wherever she passed. The drow wizards had erred! She knew the dark elves had likely set up wards against countering magic-perhaps even over themselves-that would defeat even the most intense fires, but they did not understand the flammable nature of trees. Even if the fire did not consume them, the flames would blind them and effectively put them out of the fighting. And the smoke! The thick copse was damp from previous rains and frost, and billowing black clouds thickened the air. Even worse for the drow, the wizards countered as they had always countered fire, with spells creating water. So great was their response, that the flames would have been quenched, except that Alustriel did not relent, continued to rush about the copse, even cut into the copse wherever she found a break. No water, not the ocean itself, could extinguish the fires of her enchanted chariot. As she continued to fuel the flames, the drenching spells by the wizards added steam to the smoke, thickened the air so that the dark elves could not see at all and could not breathe. Alustriel trusted in her horses, extensions of her will, to understand her intent and keep the chariot on course, and she watched, her spells ready, for she knew the enemy could not remain within the copse. As she expected, a drow floated up through the trees, rising above the inferno, levitating into the air and trying to orient himself to the scene beyond the copse. Alustriel\u0027s lightning bolt hit him in the bark of the head and sent him spinning over and over, and he hung, upside down and dead, until his own spell expired, dropping him back into the trees. Even as she killed that wizard, though, a ball of flame puffed in the air right before the chariot, and the speeding thing, and Alustriel with it, plunged right through. The Lady of Silverymoon was protected from the flames of her own spell, but not so from the fireball, and she cried out and came through pained, her face bright from burn. Higher up the mountainside, Besnell and his soldiers witnessed the attack against Alustriel. The elf steeled his golden eyes; his men cried out in outrage. If their earlier exploits had been furious, they were purely savage now, and Berkthgar\u0027s men, fighting beside them, needed no prodding. Goblins and kobolds, bugbears and orcs, even huge minotaurs and skilled drow, died by the score in the next moments of battle. It hardly seemed to matter. Whenever one died, two took its place, and though the knights and the barbarians could have cut through the enemy lines, there was nowhere for them to go. Farther to the west, his own Longriders similarly pressed, Reg-weld understood their only hope. He leaped Puddlejumper to a place where there were no enemies and cast a spell to send a message to Besnell. To the west! the wizard implored the knight leader. Then Regweld took up the new lead and turned his men and the barbarians closest to them westward, toward Keeper\u0027s Dale, as the original plan had demanded. The drow wizards had been silenced, momentarily at least, and now was the only chance Reg-weld would have. A lightning bolt split the darkening air. A fireball followed, and Regweld followed that, leaping Puddlejumper over the ranks of his enemies and loosing a barrage of magical missiles below him as he flew. Confusion hit the enemy ranks, enough so that the Longriders, men who had fought beside the Harpells for all their lives and understood Regweld\u0027s tactics, were able to slice through, opening a gap. Beside them came many of the Settlestone warriors and the few remaining horsemen from Nesme. Behind them came the rest of the barbarian force and the Knights in Silver, mighty Berkthgar bringing up the rear, almost single-handedly keeping the pursuing monsters at bay. The defenders punched through quickly, but found their momentum halted as another force, mostly drow, cut across in front, forming thick ranks. Regweld continued his magical barrage, charged ahead with Puddlejumper, expecting to die. And so he would have, except that Alustriel, forced away from the copse by the increasingly effective counters of the drow wizards, rushed back up the mountainside, right along the dark elf line, low enough so that the drow who did not flee were trampled and burned by her fiery passing. Besnell and his men galloped to the front of the fleeing force, cried out to Alustriel and for the good of all goodly folk, and plunged into the confusion of the drow ranks, right into the flaming chariot\u0027s charred wake. Many more men died in those few moments of hellish fighting, many men and many drow, but the defenders broke free to the west, ran and rode on, and found the path into Keeper\u0027s Dale before the enemy could block it. Above the battle once more, Alustriel slumped with exhaustion. She had not launched so concentrated a barrage of magic in many, many years, and had not engaged so closely in any conflict since the days before she had come to rule Silverymoon. Now she was tired and wounded, burned and singed, and she had taken several hits by sword and by quarrel as she had rushed along the drow ranks. She knew the disapproval she would find when she returned to Silverymoon, knew that her advisors, and the city\u0027s council, and colleagues from other cities, would think her rash, even stupid. Mithril Hall was a minor kingdom not worth her life, her detractors would say. To take such risks against so deadly an enemy was foolish. So they would say, but Alustriel knew better, knew that the freedoms and rights that applied to Silverymoon were not there simply because of her city\u0027s size and strength. They applied to all, to Silverymoon, to Waterdeep, and to the smallest of kingdoms that so desired them, because otherwise the values they promoted were meaningless and selfish. Now she was wounded, had nearly been killed, and she called off her chariot\u0027s flames as she rose high into the sky. To show herself so openly would invite a continuing magical attack that would likely destroy her. She was sorely wounded, she knew, but Alustriel was smiling. Even if she died this night, the Lady of Silverymoon would die smiling, because she was following her heart. She was fighting for something bigger than her life, for values that were eternal and ultimately right. She watched with satisfaction as the force, led by Besnell and her own knights, broke free and sped for Keeper\u0027s Dale, then she climbed higher into the cold sky, angling for the west. The enemy would pursue, and more enemies were coming fast around the north, and the battle had only just begun. The Undercity, where two thousand dwarves often labored hard at their most beloved profession, had never seen such bustle and tumult as this day. Not even when the shadow dragon, Shimmer-gloom, and its host of evil gray dwarves had invaded, when Bruenor\u0027s grandfather had been king, had the Undercity been engulfed in such a battle. Goblins and minotaurs, kobolds and wicked monsters that the dwarves could not name flooded in from the lower tunnels and through the floor itself, areas that had been breached by the magic of the illithids. And the drow, scores of dark elves, struggled and battled along every step and across the wide floor, their dance a macabre mix of swirling shadows in the glow of the many low-burning furnaces. Still, the main tunnels to the lower levels had not been breached, and the greatest concentration of enemies, particularly the drow force, remained outside Mithril Hall proper. Now the dark elves who had gained the Undercity meant to open that way, to link up with the forces of Uthegental and Matron Baenre. And the dwarves meant to stop them, knowing that if that joining came to pass, then Mithril Hall would be lost. Lightning flashed, green and red and sizzling black bolts from below, from the drow, and it was answered from above by Harkle and Bella don DelRoy. The lowest levels began to grow darker as the drow worked their magic to gain a favorable battlefield. The fall of light pellets upon the floor sounded like a gentle rain as Stumpet Rakingclaw and her host of dwarven priests countered the magic, brightening the area, loading spell after spell, stealing every shadow from every corner. Dwarves could fight in the dark, but they could fight in the light as well, and the drow and other creatures from the Underdark were not so fond of brightness. One group of twenty dwarves formed a tight formation on the wide floor and rolled over a band of fleeing goblins. Their boots sounded like a heavy, rolling wheel, a general din, mowing over whatever monster dared to stay in their path. A handful of dark elves fired stinging crossbow quarrels, but the dwarves shook off the hits-and, since their blood ran thick with potions to counter any poisons, they shook off the infamous drow sleeping drug as well. Seeing that their attack was ineffective, the drow scattered, and the dwarven wedge rolled toward the next obstacle, two strange-looking creatures that the bearded folk did not know, two ugly creatures with slimy heads that waved tentacles where the mouths should have been, and with milky white eyes that showed no pupils. The dwarven wedge seemed unstoppable, but when the illithids turned their way and loosed their devastating mental barrage, the wedge wobbled and fell apart, stunned dwarves staggering aimlessly. \"Oh, there they are!\" Harkle squealed from the third tier of the Undercity, more than sixty feet from the floor. Bella don DelRoy\u0027s face crinkled with disgust as she looked at mind flayers for the first time. She and Harkle had expected the creatures; Drizzt had told them about Matron Baenre\u0027s \"pet.\" Despite her disgust, Bella, like all Harpells, was more curious than afraid. The illithids had been expected-she just hadn\u0027t expected them to be so damned ugly! \"Are you sure of this?\" the diminutive woman asked Harkle, who had devised the strategy for fighting the squishy-headed things. Her good eye revealed her true hopes, though, for while she talked to Harkle, it remained fixated on the ugly illithids. \"Would I have gone to all the trouble of learning to cast from the different perspective?\" Harkle answered, seeming wounded by her doubts. \"Of course,\" Bella replied. \"Well, those dwarves do need our help.\" \"Indeed.\" A quick chant by the daughter of DelRoy brought a shimmering blue, door-shaped field right before the two wizards. \"After you,\" Bella said politely. \"Oh, rank before beauty,\" Harkle answered, waving his hand toward the door, indicating that Bella should load. \"No time for wasting!\" came a clear voice behind them, and surprisingly strong hands pressed against both Bella and Harkle\u0027s hips, heaving them both for the door. They went through together, and Fret, the tidy dwarf, pushed in right behind them. The second door appeared on the floor, between the illithids and their stunned dwarven prey, and out popped the three dimensional travelers. Fret skidded to the side, trying to round up the vulnerable dwarves, while Harkle and Bella don DelRoy mustered their nerve and faced the octopus-headed creatures. \"I understand your anger,\" Harkle began, and he and his companion shuddered as a wave of mental energy rolled across their chests and shoulders and heads, leaving a wake of tingles. \"If I were as ugly as you...\" Harkle continued, and a second wave came through. \"... I would be mean, too!\" Harkle finished, and a third blast of energy came forth, followed closely by the illithids. Bella screamed and Harkle nearly fainted as the monstrous things pushed in close, tentacles latching onto cheeks and chins. One went straight up Harkle\u0027s nose, in search of brain matter to devour. \"You are sure?\" Bella cried out. But Harkle, deep in the throes of his latest spell, didn\u0027t hear her. He didn\u0027t struggle against the illithid, for he didn\u0027t want the thing to jostle him too severely. It was hard enough to concentrate with wriggling tentacles burrowing under the skin of his face! Those tentacles swelled now, extracting their prize. An unmistakably sour look crossed the normally expressionless features of both the creatures. Harkle\u0027s hands came up slowly, palms down, his thumbs touching and his other fingers spread wide. A flash of fire erupted from his hands, searing the confused illithid, burning its robes. It tried to pull away, and Harkle\u0027s facial skin bulged weirdly as the tentacles began to slide free. Harkle was already moving with his next spell. He reached into his robes and extracted a dart, a leaf that had been mushed to powder, and a stringy, slimy thing, a snake\u0027s intestine, and squashed them all together as he completed the chant. From that hand came forth a small bolt, shooting across the two feet to stick into the still-burning illithid\u0027s belly. The creature gurgled something indecipherable and finally fell away, stumbling, grasping at its newest wound, for while the fires still nipped at it in places, this newest attack hurt more. The enchanted bolt pumped acid into its victim. Down went the illithid, still clutching at the leaking bolt. It had underestimated its enemy, and it telepathically sent that very mesage to its immediate companion, who already understood their error, and to Methil, deep in the caverns beside Matron Baenre. Bella couldn\u0027t concentrate. Though her spell of polymorph had been perfect, her brain safely tucked away where the illithid could not find it, she simply couldn\u0027t concentrate with the squiggly tentacles probing around her skull. She berated herself, told herself that the daughter of DelRoy should be more in control. She heard a rumbling sound, a cart rolling near, and opened her eyes to see Fret push the cart right up behind the illithid, a host of drow in pursuit. Holding his nerve, the tidy dwarf leaped atop the cart and drew out a tiny silver hammer. \"Let her go!\" Fret cried, bringing the nasty little weapon to bear. To the dwarf\u0027s surprise, and disgust, his hammer sank into the engaged illithid\u0027s bulbous head and ichor spewed forth, spraying the dwarf and staining his white robes. Fret knew the drow were bearing down on him; he had resolved to take one attack on the illithid, then turn in defense against the dark elves. But all plans flew away in the face of that gory mess, the one thing that could bring the tidy dwarf into full battle rage. No woodpecker every hit a log as rapidly. Fret\u0027s hammer worked so as to seem a blur, and each hit sent more of the illithid\u0027s brain matter spraying, which only heightened the tidy dwarf\u0027s frenzy. Still, that would have been the end of Fret, of all of them, had not Harkle quickly enacted his next spell. He focused on the area in front of the charging drow, threw a bit of lard into the air, and called out his next dweomer. The floor became slick with grease, and the charge came to a stumbling, tumbling end. Its head smashed to dripping pulp, the illithid slumped before Bella, the still-clinging tentacles bringing her low as well. She grabbed frantically at those tentacles and yanked them free, then stood straight and shuddered with pure revulsion. \"I told you that was the way to fight mind flayers!\" Harkle said happily, for it had been his plan every step of the way. \"Shut up,\" Bella said to him, her stomach churning. She looked all about, seeing enemies closing in from many directions. \"And get us out of here!\" she said. Harkle looked at her, confused and a bit wounded by her disdain. The plan had worked, after all! A moment later, Harkle, too, became more than a little frightened, as he came to realize that he had forgotten that last little detail, and had no spells left that would transport them back to the higher tiers. \"Ummm,\" he stammered, trying to find the words to best explain their dilemma. Relieved he was, and Bella, too, when the dwarven wedge reformed about them, Fret joining the ranks. \"We\u0027ll get ye back up,\" the leader of the grateful dwarves promised, and on they rolled, once more burying everything in their path. Even more destructive now was their march, for every so often a blast of lightning or a line of searing fire shot out from their ranks as Harkle and Bella joined in the fun. Still, Bella remained uncomfortable and wanted this all to end so that she could return to her normal physiology. Harkle had studied illithids intently, and knew as much about them as perhaps any wizard in all the Realms. Their mentally debilitating blasts were conical, he had assured her, and so, if he and she could get close, only the top half of their bodies would be affected. Thus they had enacted the physical transformation enchantment, wherein Harkle and Bella appeared the same, yet had transfigured two areas of their makeup, their brains and their buttocks. Harkle smiled at his cleverness as the wedge rolled on. Such a transformation had been a delicate thing, requiring many hours of study and preparation. But it had been worth the trouble, every second, the Harpell believed, recalling the sour looks on the ugly illithid faces! The rumbles from the collapse of the bridges, and of all the antechambers near Garumn\u0027s Gorge, were felt in the lowest tunnels of Mithril Hall, even beyond, in the upper passages of the wild Underdark itself. How much work Bruenor\u0027s people would have if ever they tried to open the eastern door again! But the drow advance had been stopped, and was well worth the price. For now General Dagna and his force of defenders were free to go. But where? the tough, battle-hardened dwarf wondered. Reports came to him that the Undercity was under full attack, but he also realized that the western door, near Keeper\u0027s Dale, was vulnerable, with only a few hundred dwarves guarding the many winding tunnels and with no provisions for such catastrophic measures as had been taken here in the east. The tunnels in the west could not be completely dropped; there had not been time to rig them so. Dagna looked around at his thousand troops, many of them wounded, but all of them eager for more battle, eager to defend their sacred homeland. \"The Undercity,\" the general announced a moment later. If the western door was breached, the invaders would have to find their way through, no easy task considering the myriad choices they would face. The fighting had already come to the Undercity, so that was where Dagna belonged. Normally it would have taken many minutes, a half hour or more, for the dwarves to get down to the fighting, even if they went the whole way at a full charge. But this, too, had been foreseen, so Dagna led his charges to the appointed spot, new doors that had been cut into the walls connecting to chimneys running up from the great furnaces. As soon as those doors were opened, Dagna and his soldiers heard the battle, so they went without delay, one after another, onto the heavy ropes that had been set in place. Down they slid, fearlessly, singing songs to Clanggedon. Down they went, hitting the floor at a full run, rushing out of the warm furnaces and right into the fray, streaming endlessly, it seemed, as were the drow coming in from the lower tunnels. The fighting in the Undercity grew ever furious.","sourceLink":"https://allnovel.net/siege-of-darkness-legacy-of-the-drow-3/page-25.html","bookId":2129,"book":{"id":2129,"title":"Siege of Darkness (Legacy of the Drow #3)","description":"Storyline: Legacy of the Drow #3: Siege of Darkness Gods Walk the Realms! Rising up from the black depths of the Underdark, the drow once more meet the dwarves of Mithral Hall. Bruenor Battlehammer, with Drizzt at his side, won\u0027t go down without a fight--but they\u0027ll have to fight without Wulfgar or Catti-brie at their sides.","cover":"https://allnovel.net/images/siege-of-darkness-legacy-of-the-drow-3.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/siege-of-darkness-legacy-of-the-drow-3.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:07:03 PM"}}
