{"id":94288,"no":8,"title":"Page 8","content":"Uthegental Armgo, the patron and weapon master of Barrison del\u0027Armgo, Second House of Menzoberranzan, was not Jarlaxle\u0027s favorite drow. In fact, Jarlaxle wasn\u0027t certain that this one was truly a drow at all. Standing near six feet, with a muscled torso that weighed close to two hundred pounds, Uthegental was the largest dark elf in Menzoberranzan, one of the largest of the normally slender race ever seen in the Underdark. More than size distinguished the fierce weapon master, though. While Jarlaxle was considered eccentric, Uthegental was simply frightening. He cropped his white hair short and spiked it with the thick, gelatinous extract gained by boiling rothe udders. A mithril ring was stuck through Uthegental\u0027s angular nose, and a golden pin protruded through each cheek.\\n\\n His weapon was a trident, black like the fine-fitting mail of jointed plates he wore, and a net-magical, so it was said-hung on his belt, within easy reach.\\n\\n Jarlaxle was glad that at least Uthegental wasn\u0027t wearing his war paint this day, zigzagging streaks of some dye the mercenary did not know that showed yellow and red in both the normal and infrared spectrums. It was common knowledge in Menzoberranzan that Uthegental, in addition to being patron to Matron Mother Mez\u0027Barris, was the consort of many Barrison del\u0027Armgo females. The second house considered him breeding stock, and the thought of dozens of little Uthegentals running around brought a sour expression to Jarlaxle\u0027s face.\\n\\n \"The magic is wild, yet I remain strong!\" the exotic weapon master growled, his perpetually furrowed brow making him even more imposing. He held one iron-muscled arm to the side and tightened his biceps as he crooked his elbow, the rock-hard muscles of his arm standing high and proud.\\n\\n Jarlaxle took a moment to remind himself where he was, in the midst of his own encampment, in his own room and seated behind his own desk, secretly surrounded by a dozen highly skilled and undeniably loyal soldiers of Bregan D\u0027aerthe. Even without the concealed allies, Jarlaxle\u0027s desk was equipped with more than a few deadly traps for troublesome guests. And, of course, Jarlaxle was no minor warrior himself. A small part of him-a very small part of him-wondered how he might measure up in battle against Uthegental.\\n\\n Few warriors, drow or otherwise, could intimidate the mercenary leader, but he allowed himself a bit of humility in the face of this maniac.\\n\\n \"Ultrin Sargtlin!\" Uthegental went on, the drow term for \"Supreme Warrior,\" a claim that seemed secure within the city with Dantrag Baenre dead. Jarlaxle often imagined the battle that most of Menzoberranzan\u0027s dark elves thought would one day be waged by bitter rivals Uthegental and Dantrag.\\n\\n Dantrag had been the quicker-quicker than anyone-but with his sheer strength and size, Uthegental had rated as Jarlaxle\u0027s favorite in such a contest. It was said that when he went into his battle rage, Uthegental possessed the strength of a giant, and this fearsome weapon master was so tough that when he battled lesser creatures, such as goblin slaves, he always allowed his opponent to swing first, and never tried to parry the attack, accepting the vicious hit, reveling in the pain, before tearing his enemy limb from limb and having the choicest body parts prepared for his supper.\\n\\n Jarlaxle shuddered at the notion, then put the image from his mind, reminding himself that he and Uthegental had more important business.\\n\\n \"There is no weapon master, no drow at all, in Menzoberranzan to stand against me,\" Uthegental continued his boasting, for no reason that Jarlaxle could discern beyond the savage\u0027s overblown sense of pride.\\n\\n He went on and on, as was his way, and while Jarlaxle wanted to ask him if there was a point to it all, he kept silent, confident that the emissary from the second house would eventually get around to a serious discussion.\\n\\n Uthegental stopped his mounting tirade suddenly, and his hand shot out, snatching from the top of the desk a gem that the mercenary used as a paperweight. Uthegental muttered some word that Jarlaxle did not catch, but the mercenary\u0027s keen eye did note a slight flicker in the huge drow\u0027s brooch, the house emblem of Barrison del\u0027Armgo. Uthegental then held the gem aloft and squeezed it with all his strength. The muscles in his sculpted arm strained and bulged, but the gem held firm.\\n\\n \"I should be able to crush this,\" Uthegental growled. \"Such is the power, the magic, that I have been Lloth-blessed with!\"\\n\\n \"The gem would not be worth as much when reduced to powder,\" Jarlaxle replied dryly. What was Uthegental\u0027s point? he wondered. Of course, something strange was going on with magic all over the city. Now Jarlaxle better understood Uthegental\u0027s earlier boasting. The exotic weapon master was indeed still strong, but not as strong, a fact that apparently worried Uthegental more than a little.\\n\\n \"Magic is failing,\" the weapon master said, \"failing everywhere. The priestesses kneel in prayer, sacrifice drow after drow, and still nothing they do brings Lloth or her handmaidens to them. Magic is failing, and it is Matron Baenre\u0027s fault!\"\\n\\n Jarlaxle took note of the way Uthegental seemed to repeat things. Probably to remind himself of what he was talking about, the mercenary mused, and his sour expression aptly reflected his opinion of Uthegental\u0027s intellect. Of course, Uthegental would never catch the subtle indication.\\n\\n \"You cannot know that,\" the mercenary replied. Uthegental\u0027s accusation no doubt came from Matron Mez\u0027Barris herself. Many things were coming clear to the mercenary now, mostly the fact that Mez\u0027Barris had sent Uthegental to feel out Bregan D\u0027aerthe, to see if the time was ripe for a coup against Baenre. Uthegental\u0027s words could certainly be considered damning, but not against Barrison del\u0027Armgo, for their weapon master was always running off at the mouth, and never with anything complimentary to anyone but himself.\\n\\n \"It was Matron Baenre who allowed the rogue Do\u0027Urden to escape,\" Uthegental bellowed. \"It was she who presided over the failed high ritual! Failed, as magic is failing.\"\\n\\n Say it again, Jarlaxle thought, but wisely kept that derisive reply silent. The mercenary\u0027s frustration at that moment wasn\u0027t simply with the ignorance revealed by Uthegental. It was with the fact that Uthegental\u0027s reasoning was common all over the city. To Jarlaxle\u0027s thinking, the dark elves of Menzoberranzan continually limited themselves by their blind insistence that everything was symptomatic of a deeper meaning, that the Spider Queen had some grand design behind their every movement. In the eyes of the priestesses, if Drizzt Do\u0027Urden denied Lloth and ran away, it was only because Lloth wanted House Do\u0027Urden to fall and wanted the challenge of recapturing him presented to the other ambitious houses of the city.\\n\\n It was a limiting philosophy, one that denied free will. Certainly Lloth might play a hand in the hunt for Drizzt. Certainly she might be angered by the disruption of the high ritual, if she even bothered to take note of the event! But the reasoning that what was happening now was completely tied to that one event-ultimately a minor one in the five-thousand year history of Menzoberranzan-was a view of foolish pride, wherein the dwellers of Menzoberranzan seemed to think that all the multiverse revolved about them.\\n\\n \"Why then is all magic failing every house?\" Jarlaxle asked Uthegental. \"Why not just House Baenre?\"\\n\\n Uthegental briskly shook his head, not even willing to consider the reasoning. \"We have failed Lloth and are being punished,\" he declared. \"If only I had met the rogue instead of pitiful Dantrag Baenre!\"\\n\\n Now that was a sight Jarlaxle would wish to see! Drizzt Do\u0027Urden battling Uthegental. The mere thought of it sent a tingle down the mercenary\u0027s spine.\\n\\n \"You cannot deny that Dantrag was in Lloth\u0027s favor,\" Jarlaxle reasoned, \"while Drizzt Do\u0027Urden most certainly was not. How, then, did Drizzt win?\"\\n\\n Uthegental\u0027s brow furrowed so fiercely that his red-glowing eyes nearly disappeared altogether, and Jarlaxle quickly reassessed the prudence of pushing the brute along this line of reasoning. It was one thing to back Matron Baenre; it was another altogether to shake the foundation for this religion-blinded slave\u0027s entire world.\\n\\n \"It will sort itself out properly,\" Jarlaxle assured. \"In all of Arach-Tinilith, in all of the Academy, and in every chapel of every house, prayers are being offered to Lloth.\"\\n\\n \"Their prayers are not being answered,\" Uthegental promptly reminded. \"Lloth is angry with us and will not speak with us until we have punished those who have wronged her.\"\\n\\n Their prayers were not being answered, or their prayers were not even being heard, Jarlaxle thought. Unlike most of the other typically xenophobic drow in Menzoberranzan, the mercenary was in touch with the outside world. He knew from his contacts that Blingdenstone\u0027s svirfneblin priests were having equal difficulty in their communion, that the deep gnomes\u0027 magic had also gone awry. Something had happened to the pantheon itself, Jarlaxle believed, and to the very fabric of magic.\\n\\n \"It is not Lloth,\" he said boldly, to which Uthegental\u0027s eyes went wide. Understanding exactly what was at stake here, the entire hierarchy of the city and perhaps the lives of half of Menzoberranzan\u0027s drow, Jarlaxle pressed ahead. \"Rather, it is not solely Lloth. When you go back into the city, consider Narbondel,\" he said, referring to the stone pillar clock of Menzoberranzan. \"Even now, in what should be the cool dark of night, it glows brighter and hotter than ever before, so hot that its glow can even be viewed without the heat-sensing vision, so hot that any drow near the pillar cannot even allow their vision to slip into the heat-sensing spectrum, lest they be blinded.\\n\\n \"Yet Narbondel is enchanted by a wizard, and not a priestess,\" Jarlaxle went on, hoping that dim Uthegental would follow the reasoning.\\n\\n \"You doubt that Lloth could affect the clock?\" the weapon master growled.\\n\\n \"I doubt she would!\" Jarlaxle countered vehemently. \"The magic of Narbondel is separate from Lloth, has always been separate from Lloth. Before Gromph Baenre, some of the previous archmages of Menzoberranzan were not even followers of Lloth!\" He almost added that Gromph wasn\u0027t so devout, either, but decided to keep that bit of information back. No sense in giving the desperate second house additional reasons to think that House Baenre was even more out of the Spider Queen\u0027s favor.\\n\\n \"And consider the faerie fires highlighting every structure,\" Jarlaxle continued. He could tell by the angle of Uthegental\u0027s furrowed brow that the brute was suddenly more curious than outraged-not a common sight. \"Blinking on and off, or winking out altogether. Wizard\u0027s faerie fire, not the magic of a priestess, and decorating every house, not just House Baenre. Events are beyond us, I say, and beyond the high ritual. Tell Matron Mez\u0027Barris, with all my respect, that I do not believe Matron Baenre can be blamed for this, and I do not believe the solution will be found in a war against the first house. Not unless Lloth herself sends us a clear directive.\"\\n\\n Uthegental\u0027s expression soon returned to its normal scowl. Of course this one was frustrated, Jarlaxle realized. The most intelligent drow of Menzoberranzan, the most intelligent svirfnebli of Blingdenstone, were frustrated, and nothing Jarlaxle might say would change Uthegental\u0027s mind, or the war-loving savage\u0027s desire to attack House Baenre. But Jarlaxle knew he didn\u0027t have to convince Uthegental. He just had to make Uthegental say the right things upon his return to House Barrison del\u0027Armgo. The mere fact that Mez\u0027Barris sent so prominent an emissary, her own patron and weapon master, told Jarlaxle she would not lead a conspiracy against Baenre without the aid of, or at least the approval of, Bregan D\u0027aerthe.\\n\\n \"I go,\" Uthegental declared, the most welcome words Jarlaxle had heard since the brute had entered his encampment.\\n\\n Jarlaxle removed his wide-brimmed hat and ran his hands over his bald pate as he slipped back comfortably in his chair. He could not begin to guess the extent of the events. Perhaps within the apparent chaos of the fabric of reality, Lloth herself had been destroyed. Not such a bad thing, Jarlaxle supposed.\\n\\n Still, he hoped things would sort themselves out soon, and properly, as he had indicated to Uthegental, for he knew this request-and it was a request-to go to war would come again, and again after that, and each time, it would be backed by increasing desperation. Sooner or later, House Baenre would be attacked.\\n\\n Jarlaxle thought of the encounter he had witnessed between Matron Baenre and K\u0027yorl Odran, matron mother of House Oblodra, the city\u0027s third, and perhaps most dangerous, house, when Baenre had first begun to put together the alliance to send a conquering army to Mithril Hall. Baenre had dealt from a position of power then, fully in Lloth\u0027s favor. She had openly insulted K\u0027yorl and the third house and forced the unpredictable matron mother into her alliance with bare threats.\\n\\n K\u0027yorl would never forget that, Jarlaxle knew, and she could possibly be pushing Mez\u0027Barris Armgo in the direction of a war against House Baenre.\\n\\n Jarlaxle loved chaos, thrived amidst confusion, but this scenario was beginning to worry him more than a little.\\n\\n Contrary to the usually correct mercenary\u0027s belief, K\u0027yorl Odran was not nudging Matron Mez\u0027Barris into a war against House Baenre. Quite the opposite, K\u0027yorl was working hard to prevent such a conflict, meeting secretly with the matron mothers of the six other ruling houses ranked below House Baenre (except for Ghenni\u0027tiroth Tlabbar, Matron of House Faen Tlabbar, the fourth house, whom K\u0027yorl could not stand and would not trust). It wasn\u0027t that K\u0027yorl had forgiven Matron Baenre for the insult, and it wasn\u0027t that K\u0027yorl was afraid of the strange events. Far from it.\\n\\n If it hadn\u0027t been for their extensive scouting network beyond House Oblodra and the obvious signs such as Narbondel and the winking faerie fire, the members of the third house wouldn\u0027t even have known that anything was amiss. For the powers of House Oblodra came not from wizardly magic, nor from the clerical prayers to the Spider Queen. The Oblodrans were psionicists. Their powers were formed by internal forces of the mind, and, thus far, the Time of Troubles had not affected them.\\n\\n K\u0027yorl couldn\u0027t let the rest of the city know that. She had the score of priestesses under her command hard at work, forcing the psionic equivalent of faerie fire highlighting her house to blink, as were the other houses. And to Mez\u0027Barris and the other matron mothers, she seemed as agitated and nervous as they.\\n\\n She had to keep a lid on things; she had to keep the conspiracy talk quieted. For when K\u0027yorl could be certain that the loss of magic was not a devious trick, her family would strike-alone. She might pay House Faen Tlabbar back first, for all the years she had spent watching their every ambitious move, or she might strike directly against wretched Baenre.\\n\\n Either way, the wicked matron mother meant to strike alone.\\n\\n Matron Baenre sat stiffly in a chair on the raised and torch-lit central dais in the great chapel of her house. Her daughter Sos\u0027Umptu, who served as caretaker to this most holy of drow places, sat to her left, and Triel, the eldest Baenre daughter and matron mistress of the drow Academy, was on her right. All three stared upward, to the illusionary image Gromph had put there, and it seemed strangely fitting that the image did not continue its shape-shifting, from drow to arachnid and back again, but rather, had been caught somewhere in the middle of the transformation and suspended there, like the powers that had elevated House Baenre to its preeminent position.\\n\\n Not far away, goblin and minotaur slaves continued their work in repairing the dome, but Matron Baenre had lost all hope that putting her chapel back together would right the strange and terrible events in Menzoberranzan. She had come to believe Jarlaxle\u0027s reasoning that something larger than a failed high ritual and the escape of a single rogue was involved here. She had come to believe that what was happening in Menzoberranzan might be symptomatic of the whole world, of the whole multiverse, and that it was quite beyond her understanding or her control.\\n\\n That didn\u0027t make things easier for Matron Baenre. If the other houses didn\u0027t share those beliefs, they would try to use her as a sacrifice to put things aright. She glanced briefly at both her daughters. Sos\u0027Umptu was among the least ambitious drow females she had ever known, and Baenre didn\u0027t fear much from that one. Triel, on the other hand, might be more dangerous. Though she always seemed content with her life as matron mistress of the Academy, a position of no minor importance, it was widely accepted that Triel, the eldest daughter, would one day rule the first house.\\n\\n Triel was a patient one, like her mother, but, like her mother, she was also calculating. If she became convinced that it was necessary to remove her mother from the throne of House Baenre, that such an act would restore the Baenre name and reputation, then she would do so mercilessly.\\n\\n That is why Matron Baenre had recalled her from the Academy to a meeting and had located that meeting within the chapel. This was Sos\u0027Umptu\u0027s place, Lloth\u0027s place, and Triel would not dare strike out at her mother here.\\n\\n \"I plan to issue a call from the Academy that no house shall use this troubled time to war against another,\" Triel offered, breaking the virtual silence-for none of the Baenres had taken note of the hammering and groaning from the slaves working on the curving roof a mere hundred feet away. None of them took note even when a minotaur casually tossed a goblin to its death, for no better reason than enjoyment.\\n\\n Matron Baenre took a deep breath and considered the words, and the meaning behind the words. Of course Triel would issue such a plea. The Academy was perhaps the most stabilizing force in Menzoberranzan. But why had Triel chosen this moment to tell her mother? Why not just wait until the plea was presented openly and to all?\\n\\n Was Triel trying to reassure her? Matron Baenre wondered. Or was she merely trying to put her off her guard?\\n\\n The thoughts circled in Matron Baenre\u0027s mind, ran about and collided with one another, leaving her in a trembling, paranoid fit. Rationally, she understood the self-destructive nature of trying to read things into every word, of trying to outguess those who might be less than enemies, who might even be allies. But Matron Baenre was growing desperate. A few weeks before, she had been at the pinnacle of her power, had brought the city together beneath her in readiness for a massive strike at the dwarven complex of Mithril Hall, near the surface.\\n\\n How fast it had been taken away, as fast as the fall of a stalactite from the ceiling of the cavern above her treasured chapel.\\n\\n She wasn\u0027t done yet, though. Matron Baenre had not lived through more than two thousand years to give up now. Damn Triel, if she was indeed plotting to take the throne. Damn them all!\\n\\n The matron mother clapped her hands together sharply, and both her daughters started with surprise as a bipedal, man-sized monstrosity popped into view, standing right before them, draped in tremendous flowing crimson robes. The creature\u0027s purplish head resembled that of an octopus, except that only four skinny tentacles waved from the perimeter of its round, many-toothed orifice, and its eyes were pupilless and milky white.\\n\\n The illithid, or mind flayer, was not unknown to the Baenre daughters. Far from it, El-Viddenvelp, or Methil, as he was commonly called, was Matron Baenre\u0027s advisor and had been at her side for many years. Recovered from their startlement, both Sos\u0027Umptu and Triel turned curious stares to their surprising mother.\\n\\n My greetings to you Triel, the illithid imparted telepathically. And, of course, to you, Sos\u0027Umptu, in this, your place.\\n\\n Both daughters nodded and conjured similar mental replies, knowing that Methil would catch the thoughts as clearly as if they had spoken them aloud.\\n\\n \"Fools!\" Matron Baenre shouted at both of them. She leaped from her chair and spun about, her withered features fierce. \"How are we to survive this time if two of my principle commanders and closest advisors are such fools?\"\\n\\n Sos\u0027Umptu was beside herself with shame, wrought of confusion. She even went so far as to cover her face with the wide sleeve of her thick purple-and-black robe.\\n\\n Triel, more worldly-wise than her younger sister, initially felt the same shock, but quickly came to understand her mother\u0027s point. \"The illithid has not lost its powers,\" she stated, and Sos\u0027Umptu peeked curiously from above her arm.\\n\\n \"Not at all,\" Matron Baenre agreed, and her tone was not happy.\\n\\n \"But then we have an advantage,\" Sos\u0027Umptu dared to speak. \"For Methil is loyal enough,\" she said bluntly. There was no use in masking her true feelings behind words of half-truth, for the illithid would read her mind anyway. \"And he is the only one of his kind in Menzoberranzan.\"\\n\\n \"But not the only one who uses such powers!\" Matron Baenre roared at her, causing her to shrink back in her chair once more.\\n\\n \"K\u0027yorl,\" Triel gasped. \"If Methil has use of his powers...\"\\n\\n \"Then so do the Oblodrans,\" Baenre finished grimly.\\n\\n They exercise their powers continually, Methil telepathically confirmed to all three. The highlights of House Oblodra would not be winking were it not for the mental commands of K\u0027yorl\u0027s coven.\\n\\n \"Can we be certain of this?\" Triel asked, for there seemed no definite patterns in the failing of magic, just a chaotic mess. Perhaps Methil had not yet been affected, or did not even know that he had been affected. And perhaps Oblodra\u0027s faerie fire highlights, though different in creation than the fires glowing about the other houses, were caught in the same chaos.\\n\\n Psionic powers can be sensed by psionic creatures, Methil assured her. The third house teems with energy.\\n\\n \"And K\u0027yorl gives the appearance that this is not so,\" Matron Baenre added in a nasty tone.\\n\\n \"She wishes to attack by surprise,\" Triel reasoned.\\n\\n Matron Baenre nodded grimly.\\n\\n \"What of Methil?\" Sos\u0027Umptu offered hopefully. \"His powers are great.\"\\n\\n \"Methil is more than a match for K\u0027yorl,\" Matron Baenre assured her daughter, though Methil was silently doing the same thing, imparting a sense of undeniable confidence. \"But K\u0027yorl is not alone among the Oblodrans with her psionic powers.\"\\n\\n \"How many?\" Triel wanted to know, to which Matron Baenre merely shrugged.\\n\\n Many, Methil\u0027s thoughts answered.\\n\\n Triel was thinking it, so she knew that Methil was hearing it, and so she said it aloud, suspiciously. \"And if the Oblodrans do come against us, which side will Methil take?\"\\n\\n Matron Baenre was, for an instant, shocked by her daughter\u0027s boldness, but she understood that Triel had little choice in divulging her suspicions.\\n\\n \"And will he bring in his allies from the illithid cavern not far away?\" Triel pressed. \"Surely if a hundred illithids came to our side in this, our time of need...\"\\n\\n There was nothing from Methil, not a hint of telepathic communication, and that was answer enough for the Baenres.\\n\\n \"Our problems are not the problems of the mind flayers,\" Matron Baenre said. It was true enough, and she knew so. She had tried to enlist the illithids in the raid on Mithril Hall, promising them riches and a secure alliance, but the motivations of the otherworldly, octopus-headed creatures were not the same as those of the dark elves, or of any race in all the Underdark. Those motivations remained beyond Matron Baenre\u0027s understanding, despite her years of dealing with Methil. The most she could get from the illithids for her important raid was Methil and two others agreeing to go along in exchange for a hundred kobolds and a score of drow males, to be used as slaves by the illithid community in their small cavern city.\\n\\n There was little else to say. The house guards were positioned at full readiness; every spare drow was in prayer for help from the Spider Queen. House Baenre was doing everything it could to avert disaster, and yet, Matron Baenre did not believe they would succeed. K\u0027yorl had come to her unannounced on several occasions, had gotten past her magical fence and past the many magical wards set about the complex. The matron mother of House Oblodra had done so only to taunt Baenre, and, in truth, had little power remaining to do anything more than that by the time her image was revealed to Baenre. But what might K\u0027yorl accomplish with those magical guards down? Baenre had to wonder. How could Matron Baenre resist the psionicist without countering magic of her own?\\n\\n Her only defense seemed to be Methil, a creature she neither trusted nor understood.\\n\\n She did not like the odds. \\n\\n","sourceLink":"https://allnovel.net/siege-of-darkness-legacy-of-the-drow-3/page-8.html","bookId":2129,"book":{"id":2129,"title":"Siege of Darkness (Legacy of the Drow #3)","description":"Storyline: Legacy of the Drow #3: Siege of Darkness \\n Gods Walk the Realms! Rising up from the black depths of the Underdark, the drow once more meet the dwarves of Mithral Hall. Bruenor Battlehammer, with Drizzt at his side, won\u0027t go down without a fight--but they\u0027ll have to fight without Wulfgar or Catti-brie at their sides.\\n","cover":"https://allnovel.net/images/siege-of-darkness-legacy-of-the-drow-3.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/siege-of-darkness-legacy-of-the-drow-3.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:07:03 PM"}}
