{"id":94289,"no":9,"title":"Page 9","content":"Guenhwyvar knew pain, knew agony beyond anything the panther had ever felt. But more than that, the panther knew despair, true despair. Guenhwyvar was a creature formed of magic, the manifestation of the life-force of the animal known on Toril as the panther. The very spark of existence within the great panther depended on magic, as did the conduit that allowed Drizzt and the others before him to bring Guenhwyvar to the Prime Material Plane.\n Now that magic had unraveled; the fabric that wove the universal magic into a mystical and predictable pattern was torn. The panther knew despair.\n Guenhwyvar heard Drizzt\u0027s continued calling, begging. The drow knew Guen was in trouble; his voice reflected that desperation. In his heart, so connected with his panther companion, Drizzt Do\u0027Urden understood that Guenhwyvar would soon be lost to him forever.\n The chilling thought gave the panther a moment of renewed hope and determination. Guenhwyvar focused on Drizzt, conjured an image of the pain she would feel if she could never again return to her beloved master. Growling low in sheer defiance, the panther scraped her back legs so forcefully that more than one claw hooked on the smooth, hard surface and was subsequently yanked out.\n The pain did not stop the panther, not when Guenhwyvar measured it against the reality of slipping forward into those flames, of falling out of the tunnel, the only connection to the material world and Drizzt Do\u0027Urden.\n The struggle went on for more time than any creature should have resisted. But though Guenhwyvar had not slid any closer to the breach, neither had the panther earned back any ground toward her pleading master.\n Finally, exhausted, Guenhwyvar gave a forlorn, helpless look over her shoulder. Her muscles trembled, then gave way.\n The panther was swept to the fiery breach.\n Matron Baenre paced the small room nervously, expecting a guard to run in at any moment with news that the compound had been overrun, that the entire city had risen against her house, blaming her for the troubles that had befallen them.\n Not so long ago, Baenre had dreamt of conquest, had aspired to the pinnacle of power. Mithril Hall had been within her grasp, and, even more than that, the city seemed ready to fall into step behind her lead.\n Now she believed she could not hold on to even her own house, to the Baenre empire that had stood for five thousand years.\n \"Mithril Hall,\" the wicked drow growled in a damning curse, as though that distant place had been the cause of it all. Her slight chest heaving with forced gasps of air, Baenre reached with both hands to her neck and tore free the chain that lay there.\n \"Mithril Hall!\" she shouted into the ring-shaped pendant, fashioned from the tooth of Gandalug Battlehammer, the patron of Bruenor\u0027s clan, the real link to that surface world. Every drow, even those closest to Matron Baenre, thought Drizzt Do\u0027Urden was the catalyst for the invasion, the excuse that allowed Lloth to give her blessing to the dangerous attempt at a conquest so near the surface.\n Drizzt was but a part of the puzzle, and a small part, for this little ring was the true impetus. Sealed within it was the tormented spirit of Gandalug, who knew the ways of Mithril Hall and the ways of Clan Battlehammer. Matron Baenre had taken the dwarf king herself centuries before, and it was only blind fate that had brought a renegade from Menzoberranzan in contact with Bruenor\u0027s clan, blind fate that had provided an excuse for the conquest Matron Baenre had desired for many, many decades.\n With a shout of outrage, Baenre hurled the tooth across the room, then fell back in shock as the item exploded.\n Baenre stared blankly into the room\u0027s corner as the smoke cleared away, at the naked dwarf kneeling there. The matron mother pulled herself to her feet, shaking her head in disbelief, for this was no summoned spirit, but Gandalug\u0027s physical body!\n \"You dare to come forth?\" Baenre screamed, but her anger masked her fear. When she had previously called Gandalug\u0027s physical form forth from the extradimensional prison, he was never truly whole, never corporeal-and never naked. Looking at him now, Baenre knew Gandalug\u0027s prison was gone, that Gandalug was returned exactly as he had been the moment Baenre had captured him, except for his clothes.\n The battered old dwarf looked up at his captor, his tormentor. Baenre had spoken in the drow tongue, and of course, Gandalug hadn\u0027t understood a word. That hardly mattered, though, for the old dwarf wasn\u0027t listening. He was, in fact, beyond words.\n Struggling, growling, with every pained movement, Gandalug forced his back to straighten, then put one, then the other, leg under him and rose determinedly. He understood that something was different. After centuries of torment and mostly emptiness, a fugue state in a gray void, Gandalug Battlehammer felt somehow different, felt whole and real. Since his capture, the old dwarf had lived a surreal existence, had lived a dream, surrounded by vivid, frightening images whenever this old wretch had called him forth, encompassed by interminable periods of nothingness, where place and time and thought were one long emptiness.\n But now... now Gandalug felt different, felt even the creaks and pains of his old bones. And how wonderful those sensations were!\n \"Go back!\" Baenre ordered, this time in the tongue of the surface, the language she always used to communicate with the old dwarf. \"Back to your prison until I call you forth!\"\n Gandalug looked around, to the chain lying on the floor, the tooth ring nowhere in sight.\n \"I\u0027m not fer tinkin\u0027 so,\" the old dwarf remarked in his heavy, ancient dialect, and he advanced a step.\n Baenre\u0027s eyes narrowed dangerously. \"You dare?\" she whispered, drawing forth a slender wand. She knew how dangerous this one could be, and thus she wasted no time in pointing the item and reciting an arcane phrase, meaning to call forth a stream of webbing that would engulf the dwarf and hold him fast.\n Nothing happened.\n Gandalug took another step, growling like a hungry animal with every inch.\n Baenre\u0027s steely-eyed gaze fell away, revealing her sudden fear. She was a creature weaned on magic, who relied on magic to protect her and to vanquish her enemies. With the items she possessed (which she carried with her at all times) and her mighty spell repertoire, she could fend off nearly any enemy, could likely crush a battalion of toughened dwarven fighters. But without those items, and with no spells coming to her call, Matron Baenre was a pitiful, bluffing thing, withered and frail.\n It wouldn\u0027t have mattered to Gandalug had a titan been standing before him. For some reason he could not understand, he was free of the prison, free and in his own body, a sensation he had not felt in two thousand years.\n Baenre had other tricks to try, and in truth, some of them, like the pouch that carried a horde of spiders that would rush to her call, had not yet fallen into the chaotic and magical web that was the Time of Troubles. She couldn\u0027t chance it, though. Not now, not when she was so very vulnerable.\n She turned and ran for the door.\n The corded muscles of Gandalug\u0027s mighty legs tightened, and the dwarf sprang, clearing the fifteen feet to get to the door before his tormentor.\n A fist slammed Baenre\u0027s chest, stealing her breath, and before she could respond, she was up in the air, twirling about over the enraged dwarf\u0027s head.\n Then she was flying, to crash and crumple against the wall across the room.\n \"I\u0027m to be rippin\u0027 yer head off,\" Gandalug promised as he steadily advanced.\n The door burst open, and Berg\u0027inyon rushed into the room. Gandalug spun to face him as Berg\u0027inyon drew his twin blades. Startled by the sight-how had a dwarf come into Menzoberranzan, into his own mother\u0027s private chambers?-Berg\u0027inyon got the blades up just as Gandalug grabbed them, one in each hand.\n Had the enchantment still been upon the weapon master\u0027s fine blades, they would have cut cleanly through the tough dwarven flesh. Even without the enchantment, the magic lost in the swirl of chaos, the swords dug deeply.\n Gandalug hardly cared. He heaved Berg\u0027inyon\u0027s arms out wide, the slender drow no match for his sheer strength. The dwarf whipped his head forward, crashing it into Berg\u0027inyon\u0027s supple armor, slender rings that also relied on enchantment for their strength.\n Gandalug repeated the movement over and over, and Berg\u0027inyon\u0027s grunts fast became breathless gasps. Soon the young Baenre was out on his feet, hardly conscious as Gandalug yanked the swords from his hands. The dwarf\u0027s head came in one more time, and Berg\u0027inyon, no longer connected to, and thus supported by, the dwarf, fell away.\n Still ignoring the deep cuts on his hands, Gandalug threw one of Berg\u0027inyon\u0027s swords to the side of the room, took the other properly in hand, and turned on Matron Baenre, who was still sitting against the wall, trying to clear her thoughts.\n \"Where\u0027s yer smile?\" the dwarf taunted, stalking in. \"I\u0027m wantin\u0027 a smile on yer stinkin\u0027 face when I hold yer head up in me hand fer all t\u0027see!\"\n The next step was the dwarf king\u0027s last, as an octopus-headed monstrosity materialized before him, its grotesque tentacles waving his way.\n A stunning blast of mental energy rolled Gandalug over, and he nearly dropped the sword. He shook his head fiercely to keep his wits about him.\n He continued to growl, to shake his hairy head, as a second blast, then a third, assaulted his sensibilities. Had he held that wall of rage, Gandalug might have withstood even these, and even the two subsequent attacks from Methil. But that rage melted into confusion, which was not a powerful enough feeling to defeat the mighty illithid\u0027s intrusions.\n Gandalug didn\u0027t hear the drow-made sword fall to the stone, didn\u0027t hear Matron Baenre call out for Methil and for the recovering Berg\u0027inyon, as she instructed the pair not to kill the dwarf.\n Baenre was scared, scared by these shifts in magic that she could not understand. But that fear did not prevent her from remembering her wicked self. For some unexplained reason, Gandalug had become alive again, in his own body and free of the apparently disintegrated ring.\n That mystery would not prevent Baenre from paying this one back for the attack and the insult. Baenre was a master at torturing a spirit, but even her prowess in that fine art paled beside her abilities to torture a living creature.\n \"Guenhwyvar!\" The figurine was wickedly hot now, but Drizzt held on stubbornly, pressed it close to his chest, his heart, though wisps of smoke were running up from the edge of his cloak and the flesh of his hands was beginning to blister.\n He knew, and he would not let go. He knew that Guenhwyvar would be gone from him forever, and like a friend hugging close a dying comrade, Drizzt would not let go, would be there to the end.\n His desperate calls began to lessen, not from resignation, but simply because his voice could not get past the lump of grief in his throat. Now his fingers, too, were burning, but he would not let go.\n Catti-brie did it for him. On a sudden, desperate impulse, the young woman, herself torn with the pain of grief, grabbed roughly at Drizzt\u0027s arm and slapped hard the figurine, knocking it to the ground.\n Drizzt\u0027s startled expression turned to one of outrage and denial, like the final burst of rage from a mother as she watched her child\u0027s casket lowered into the grave. For the moment the figurine hit the ground, Catti-brie drew Khazid\u0027hea from its sheath and leaped to the spot. Up went the sword, over her head, its fine edge still showing the red line of its enchantment.\n \"No!\" Drizzt cried, lunging for her.\n He was too late. Tears rimming her blue eyes, her thoughts jumbled, Catti-brie found the courage for a last, desperate try, and she brought the mighty blade to bear. Khazid\u0027hea could cut through stone, and so it did now, at the very instant that Guenhwyvar went through the breach.\n There came a flash, and a throbbing pain, a pulsating magic, shot up Catti-brie\u0027s arm, hurling her backward and to the ground. Drizzt skidded, pivoted, and ducked low, shielding his head as the figurine\u0027s head fell free, loosing a line of raging fire far out into the air.\n The flames blew out a moment later and a thick gray smoke poured from the body of the broken figurine. Gradually Drizzt straightened from his defensive crouch and Catti-brie came back to her senses, both to find a haggard-looking Guenhwyvar, the panther\u0027s thick coat still smoking, standing before them.\n Drizzt dove to his knees and fell over the panther, wrapping Guenhwyvar in a great hug. They both crawled their way to Catti-brie, who was still sitting on the ground, laughing and sobbing though she was weak from the impact of the magic.\n \"What have you done?\" Drizzt asked her.\n She had no immediate answers. She did not know how to explain what had happened when Khazid\u0027hea struck the enchanted figurine. She looked to the blade now, lying quiet at her side, its edge no longer glowing and a burr showing along its previously unblemished length.\n \"I think I\u0027ve ruined me sword,\" Catti-brie replied softly.\n Later that same day, Drizzt lounged on the bed in his room in the upper levels of Mithril Hall, looking worriedly at his panther companion. Guenhwyvar was back, and that was a better thing, he supposed, than what his instincts had told him would have happened had Catti-brie not cut the figurine.\n A better thing, but not a good thing. The panther was weary, resting by the hearth across the small room, head down and eyes closed. That nap would not suffice, Drizzt knew. Guenhwyvar was a creature of the Astral Plane and could truly rejuvenate only among the stars. On several occasions necessity had prompted Drizzt to keep Guenhwyvar on the Material Plane for extended periods, but even a single day beyond the half the cat usually stayed left Guen exhausted.\n Even now the artisans of Mithril Hall, dwarves of no small skill, were inspecting the cut figurine, and Bruenor had sent an emissary out to Silverymoon, seeking help from Lady Alustriel, as skilled as any this side of the great desert Anauroch in the ways of magic.\n How long would it take? Drizzt wondered, unsure if any of them could repair the figurine. How long could Guenhwyvar survive?\n Unannounced, Catti-brie burst through the door. One look at her tear-streaked face told Drizzt that something was amiss. He rolled from the bed to his feet and stepped toward the mantle, where his twin scimitars hung.\n Catti-brie intercepted him before he had completed the step and wrapped him in a powerful hug that knocked them both to the bed.\n \"All I ever wanted,\" she said urgently, squeezing tight.\n Drizzt likewise held on, confused and overwhelmed. He managed to turn his head so he could look into the young woman\u0027s eyes, trying to read some clues.\n \"I was made for ye, Drizzt Do\u0027Urden,\" Catti-brie said between sobs. \"Ye\u0027re all that\u0027s been in me thoughts since the day we met.\"\n It was too crazy. Drizzt tried to extract himself, but he didn\u0027t want to hurt Catti-brie and her hold was simply too strong and desperate.\n \"Look at me,\" she sobbed. \"Tell me ye feel the same!\"\n Drizzt did look at Catti-brie, as deeply as he had ever studied the beautiful young woman. He did care for her-of course he did. He did love her, and had even allowed himself a fantasy or two about this very situation.\n But now it seemed simply too weird, too unexpected and with no introduction. He got the distinct feeling that something was out of sorts with the woman, something crazy, like the magic all about them.\n \"What of Wulfgar?\" Drizzt managed to say, though the name got muffled as Catti-brie pressed tightly, her hair thick against Drizzt\u0027s face. The poor drow could not deny the woman\u0027s allure, the sweet scent of Catti-brie\u0027s hair, the warmth of her toned body.\n Catti-brie\u0027s head snapped as if he had hit her. \"Who?\"\n It was Drizzt\u0027s turn to feel as if he had been slapped.\n \"Take me,\" Catti-brie implored.\n Drizzt\u0027s eyes couldn\u0027t have gone any wider without falling out of their sockets.\n \"Wield me!\" she cried.\n \"Wield me?\" Drizzt echoed under his breath.\n \"Make me the instrument of your dance,\" she went on. \"Oh, I beg! It is all I was made for, all I desire.\" She stopped suddenly and pushed back to arm\u0027s length, staring wide-eyed at Drizzt as though some new angle had just popped into her head. \"I am better than the others,\" she promised slyly.\n What others? Drizzt wanted to scream, but by this point, the drow couldn\u0027t get any words out of his slack-jawed mouth.\n \"As are yerself,\" Catti-brie went on. \"Better than that woman, I\u0027m now knowing!\"\n Drizzt had almost found his center again, had almost regained control enough to reply, when the weight of that last statement buried him. Damn the subtlety! the drow determined, and he twisted and pulled free, rolling from the bed and springing to his feet.\n Catti-brie dove right behind, wrapped herself about one of his legs, and held on with all her strength.\n \"Oh, do not deny me, me love!\" she screamed, so urgently that Guenhwyvar lifted her head from the hearth and gave a low growl. \"Wield me, I\u0027m begging! Only in yer hands might I be whole!\"\n Drizzt reached down with both hands, meaning to extract his leg from the tight grip. He noticed something then, on Catti-brie\u0027s hip, that gave him pause, that stunned him and explained everything all at once.\n He noticed the sword Catti-brie had picked up in the Underdark, the sword that had a pommel shaped into the head of a unicorn. Only it was no longer a unicorn.\n It was Catti-brie\u0027s face.\n In one swift movement, Drizzt drew the sword out of its sheath and tugged free, hopping back two steps. Khazid\u0027hea\u0027s red line, that enchanted edge, had returned in full and beamed now more brightly than ever before. Drizzt slid back another step, expecting to be tackled again.\n There was no pursuit. The young woman remained in place, half sitting, half kneeling on the floor. She threw her head back as if in ecstacy. \"Oh, yes!\" she cried.\n Drizzt stared down at the pommel, watched in blank amazement as it shifted from the image of Catti-brie\u0027s face back into a unicorn. He felt an overwhelming warmth from the weapon, a connection as intimate as that of a lover.\n Panting for breath, the drow looked back to Catti-brie, who was sitting straighter now, looking around curiously.\n \"What\u0027re ye doing with me sword?\" she asked quietly. Again she looked about the room, Drizzt\u0027s room, seeming totally confused. She would have asked, \"And what am I doing here?\" Drizzt realized, except that the question was already obvious from the expression on her beautiful face.\n \"We have to talk,\" Drizzt said to her. \n","sourceLink":"https://allnovel.net/siege-of-darkness-legacy-of-the-drow-3/page-9.html","bookId":2129,"book":{"id":2129,"title":"Siege of Darkness (Legacy of the Drow #3)","description":"Storyline: \n Legacy of the Drow #3: Siege of Darkness \n Gods Walk the Realms! Rising up from the black depths of the Underdark, the drow once more meet the dwarves of Mithral Hall. Bruenor Battlehammer, with Drizzt at his side, won\u0027t go down without a fight--but they\u0027ll have to fight without Wulfgar or Catti-brie at their sides.\n \n","cover":"https://allnovel.net/images/siege-of-darkness-legacy-of-the-drow-3.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/siege-of-darkness-legacy-of-the-drow-3.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:07:03 PM"}}
