{"id":34948,"no":2,"title":"Chapter 1 Ultimatum","content":"Bella,I don’t know why you’re making Charlie carry notes to Billy like we’re in second grade if Iwanted to talk to you I would answer theYou made the choice here, okay? You can’t have it both ways whenWhat part of ‘mortal enemies’ is too complicated for you toLook, I know I’m being a jerk, but there’s just no way aroundWe can’t be friends when you’re spending all your time with a bunch ofIt just makes it worse when I think about you too much, so don’t write anymoreYeah, I miss you, too. A lot. Doesn’t change anything. Sorry.\n 　　Jacob\n 　　Laughing was the last thing I felt like doing now as I reread the words I’d already memorized. His answerto my pleading note — passed from Charlie to Billy to him, just like second grade, as he’d pointed out — wasno surprise. I’d known the essence of what it would say before I’d opened it.\n 　　What was surprising was how much each crossed-out line wounded me — as if the points of the lettershad cutting edges. More than that, behind each angry beginning lurked a vast pool of hurt; Jacob’s pain cut medeeper than my own.\n 　　While I was pondering this, I caught the unmistakable scent of a smoking burner rising from the kitchen. Inanother house, the fact that someone besides myself was cooking might not be a cause for panicking.\n 　　I shoved the wrinkled paper into my back pocket and ran, making it downstairs in the nick of time.\n 　　The jar of spaghetti sauce Charlie’d stuck in the microwave was only on its first revolution when I yankedthe door open and pulled it out.\n 　　“What did I do wrong?” Charlie demanded.\n 　　“You’re supposed to take the lid off first, Dad. Metal’s bad for microwaves.” I swiftly removed the lid asI spoke, poured half the sauce into a bowl, and then put the bowl inside the microwave and the jar back in thefridge; I fixed the time and pressed start.\n 　　Charlie watched my adjustments with pursed lips. “Did I get the noodles right?”\n 　　I looked in the pan on the stove — the source of the smell that had alerted me. “Stirring helps,” I saidmildly. I found a spoon and tried to de-clump the mushy hunk that was scalded to the bottom.\n 　　Charlie sighed.\n 　　“So what’s all this about?” I asked him.\n 　　He folded his arms across his chest and glared out the back windows into the sheeting rain. “Don’t knowwhat you’re talking about,” he grumbled.\n 　　I was mystified. Charlie cooking? And what was with the surly attitude? Edward wasn’t here yet; usuallymy dad reserved this kind of behavior for my boyfriend’s benefit, doing his best to illustrate the theme of“unwelcome” with every word and posture. Charlie’s efforts were unnecessary — Edward knew exactly whatmy dad was thinking without the show.\n 　　The word boyfriend had me chewing on the inside of my cheek with a familiar tension while I stirred. Itwasn’t the right word, not at all. I needed something more expressive of eternal commitment. . . . But wordslike destiny and fate sounded hokey when you used them in casual conversation.\n 　　 Edward had another word in mind, and that word was the source of the tension I felt. It put my teeth onedge just to think it to myself.\n 　　Fiancée. Ugh. I shuddered away from the thought.\n 　　“Did I miss something? Since when do you make dinner?” I asked Charlie. The pasta lump bobbed in theboiling water as I poked it. “Or try to make dinner, I should say.”\n 　　Charlie shrugged. “There’s no law that says I can’t cook in my own house.”\n 　　“You would know,” I replied, grinning as I eyed the badge pinned to his leather jacket.\n 　　“Ha. Good one.” He shrugged out of the jacket as if my glance had reminded him he still had it on, andhung it on the peg reserved for his gear. His gun belt was already slung in place — he hadn’t felt the need towear that to the station for a few weeks. There had been no more disturbing disappearances to trouble thesmall town of Forks, Washington, no more sightings of the giant, mysterious wolves in the ever-rainy woods. .\n 　　. .\n 　　I prodded the noodles in silence, guessing that Charlie would get around to talking about whatever wasbothering him in his own time. My dad was not a man of many words, and the effort he had put into trying toorchestrate a sit-down dinner with me made it clear there were an uncharacteristic number of words on hismind.\n 　　I glanced at the clock routinely — something I did every few minutes around this time. Less than a halfhour to go now.\n 　　Afternoons were the hardest part of my day. Ever since my former best friend (and werewolf), JacobBlack, had informed on me about the motorcycle I’d been riding on the sly — a betrayal he had devised inorder to get me grounded so that I couldn’t spend time with my boyfriend (and vampire), Edward Cullen —Edward had been allowed to see me only from seven till nine-thirty p.m., always inside the confines of myhome and under the supervision of my dad’s unfailingly crabby glare.\n 　　This was an escalation from the previous, slightly less stringent grounding that I’d earned for anunexplained three-day disappearance and one episode of cliff diving.\n 　　Of course, I still saw Edward at school, because there wasn’t anything Charlie could do about that. Andthen, Edward spent almost every night in my room, too, but Charlie wasn’t precisely aware of that. Edward’sability to climb easily and silently through my second-story window was almost as useful as his ability to readCharlie’s mind.\n 　　Though the afternoon was the only time I spent away from Edward, it was enough to make me restless,and the hours always dragged. Still, I endured my punishment without complaining because — for one thing— I knew I’d earned it, and — for another — because I couldn’t bear to hurt my dad by moving out now,when a much more permanent separation hovered, invisible to Charlie, so close on my horizon.\n 　　My dad sat down at the table with a grunt and unfolded the damp newspaper there; within seconds hewas clucking his tongue in disapproval.\n 　　“I don’t know why you read the news, Dad. It only ticks you off.”\n 　　He ignored me, grumbling at the paper in his hands. “This is why everyone wants to live in a small town!\n 　　Ridiculous.”\n 　　“What have big cities done wrong now?”\n 　　“Seattle’s making a run for murder capital of the country. Five unsolved homicides in the last two weeks.\n 　　Can you imagine living like that?”\n 　　“I think Phoenix is actually higher up the homicide list, Dad. I have lived like that.” And I’d never comeclose to being a murder victim until after I moved to his safe little town. In fact, I was still on several hit lists. . .\n 　　. The spoon shook in my hands, making the water tremble.\n 　　“Well, you couldn’t pay me enough,” Charlie said.\n 　　I gave up on saving dinner and settled for serving it; I had to use a steak knife to cut a portion of spaghettifor Charlie and then myself, while he watched with a sheepish expression. Charlie coated his helping withsauce and dug in. I disguised my own clump as well as I could and followed his example without muchenthusiasm. We ate in silence for a moment. Charlie was still scanning the news, so I picked up my much-abused copy of Wuthering Heights from where I’d left it this morning at breakfast, and tried to lose myself inturn-of-the-century England while I waited for him to start talking.\n 　　I was just to the part where Heathcliff returns when Charlie cleared his throat and threw the paper to the floor.\n 　　“You’re right,” Charlie said. “I did have a reason for doing this.” He waved his fork at the gluey spread. “Iwanted to talk to you.”\n 　　I laid the book aside; the binding was so destroyed that it slumped flat to the table. “You could have justasked.”\n 　　He nodded, his eyebrows pulling together. “Yeah. I’ll remember that next time. I thought taking dinner offyour hands would soften you up.”\n 　　I laughed. “It worked — your cooking skills have me soft as a marshmallow. What do you need, Dad?”\n 　　“Well, it’s about Jacob.”\n 　　I felt my face harden. “What about him?” I asked through stiff lips.\n 　　“Easy, Bells. I know you’re still upset that he told on you, but it was the right thing. He was beingresponsible.”\n 　　“Responsible,” I repeated scathingly, rolling my eyes. “Right. So, what about Jacob?”\n 　　The careless question repeated inside my head, anything but trivial. What about Jacob? What was Igoing to do about him? My former best friend who was now . . . what? My enemy? I cringed.\n 　　Charlie’s face was suddenly wary. “Don’t get mad at me, okay?”\n 　　“Mad?”\n 　　“Well, it’s about Edward, too.”\n 　　My eyes narrowed.\n 　　Charlie’s voice got gruffer. “I let him in the house, don’t I?”\n 　　“You do,” I admitted. “For brief periods of time. Of course, you might let me out of the house for briefperiods now and then, too,” I continued — only jokingly; I knew I was on lockdown for the duration of theschool year. “I’ve been pretty good lately.”\n 　　“Well, that’s kind of where I was heading with this. . . .” And then Charlie’s face stretched into anunexpected eye-crinkling grin; for a second he looked twenty years younger.\n 　　I saw a dim glimmer of possibility in that smile, but I proceeded slowly. “I’m confused, Dad. Are wetalking about Jacob, or Edward, or me being grounded?”\n 　　The grin flashed again. “Sort of all three.”\n 　　“And how do they relate?” I asked, cautious.\n 　　“Okay.” He sighed, raising his hands as if in surrender. “So I’m thinking maybe you deserve a parole forgood behavior. For a teenager, you’re amazingly non-whiney.”\n 　　My voice and eyebrows shot up. “Seriously? I’m free?”\n 　　Where was this coming from? I’d been positive I would be under house arrest until I actually moved out,and Edward hadn’t picked up any wavering in Charlie’s thoughts. . . .\n 　　Charlie held up one finger. “Conditionally.”\n 　　The enthusiasm vanished. “Fantastic,” I groaned.\n 　　“Bella, this is more of a request than a demand, okay? You’re free. But I’m hoping you’ll use that freedom. . . judiciously.”\n 　　“What does that mean?”\n 　　He sighed again. “I know you’re satisfied to spend all of your time with Edward —”\n 　　“I spend time with Alice, too,” I interjected. Edward’s sister had no hours of visitation; she came and wentas she pleased. Charlie was putty in her capable hands.\n 　　“That’s true,” he said. “But you have other friends besides the Cullens, Bella. Or you used to.”\n 　　We stared at each other for a long moment.\n 　　“When was the last time you spoke to Angela Weber?” he threw at me.\n 　　“Friday at lunch,” I answered immediately.\n 　　Before Edward’s return, my school friends had polarized into two groups. I liked to think of those groupsas good vs. evil. Us and them worked, too. The good guys were Angela, her steady boyfriend Ben Cheney,and Mike Newton; these three had all very generously forgiven me for going crazy when Edward left. LaurenMallory was the evil core of the them side, and almost everyone else, including my first friend in Forks,Jessica Stanley, seemed content to go along with her anti-Bella agenda.\n 　　With Edward back at school, the dividing line had become even more distinct.\n 　　 Edward’s return had taken its toll on Mike’s friendship, but Angela was unswervingly loyal, and Benfollowed her lead. Despite the natural aversion most humans felt toward the Cullens, Angela sat dutifullybeside Alice every day at lunch. After a few weeks, Angela even looked comfortable there. It was difficult notto be charmed by the Cullens — once one gave them the chance to be charming.\n 　　“Outside of school?” Charlie asked, calling my attention back.\n 　　“I haven’t seen anyone outside of school, Dad. Grounded, remember? And Angela has a boyfriend, too.\n 　　She’s always with Ben. If I’m really free,” I added, heavy on the skepticism, “maybe we could double.”\n 　　“Okay. But then . . .” He hesitated. “You and Jake used to be joined at the hip, and now —”\n 　　I cut him off. “Can you get to the point, Dad? What’s your condition — exactly?”\n 　　“I don’t think you should dump all your other friends for your boyfriend, Bella,” he said in a stern voice.\n 　　“It’s not nice, and I think your life would be better balanced if you kept some other people in it. Whathappened last September . . .”\n 　　I flinched.\n 　　“Well,” he said defensively. “If you’d had more of a life outside of Edward Cullen, it might not have beenlike that.”\n 　　“It would have been exactly like that,” I muttered.\n 　　“Maybe, maybe not.”\n 　　“The point?” I reminded him.\n 　　“Use your new freedom to see your other friends, too. Keep it balanced.”\n 　　I nodded slowly. “Balance is good. Do I have specific time quotas to fill, though?”\n 　　He made a face, but shook his head. “I don’t want to make this complicated. Just don’t forget yourfriends . . .”\n 　　It was a dilemma I was already struggling with. My friends. People who, for their own safety, I wouldnever be able to see again after graduation.\n 　　So what was the better course of action? Spend time with them while I could? Or start the separation nowto make it more gradual? I quailed at the idea of the second option.\n 　　“. . . particularly Jacob,” Charlie added before I could think things through more than that.\n 　　A greater dilemma than the first. It took me a moment to find the right words. “Jacob might be . . .\n 　　difficult.”\n 　　“The Blacks are practically family, Bella,” he said, stern and fatherly again. “And Jacob has been a very,very good friend to you.”\n 　　“I know that.”\n 　　“Don’t you miss him at all?” Charlie asked, frustrated.\n 　　My throat suddenly felt swollen; I had to clear it twice before I answered. “Yes, I do miss him,” Iadmitted, still looking down. “I miss him a lot.”\n 　　“Then why is it difficult?”\n 　　It wasn’t something I was at liberty to explain. It was against the rules for normal people — humanpeople like me and Charlie — to know about the clandestine world full of myths and monsters that existedsecretly around us. I knew all about that world — and I was in no small amount of trouble as a result. I wasn’tabout to get Charlie in the same trouble.\n 　　“With Jacob there is a . . . conflict,” I said slowly. “A conflict about the friendship thing, I mean.\n 　　Friendship doesn’t always seem to be enough for Jake.” I wound my excuse out of details that were true butinsignificant, hardly crucial compared to the fact that Jacob’s werewolf pack bitterly hated Edward’s vampirefamily — and therefore me, too, as I fully intended to join that family. It just wasn’t something I could workout with him in a note, and he wouldn’t answer my calls. But my plan to deal with the werewolf in person haddefinitely not gone over well with the vampires.\n 　　“Isn’t Edward up for a little healthy competition?” Charlie’s voice was sarcastic now.\n 　　I leveled a dark look at him. “There’s no competition.”\n 　　“You’re hurting Jake’s feelings, avoiding him like this. He’d rather be just friends than nothing.”\n 　　Oh, now I was avoiding him?\n 　　“I’m pretty sure Jake doesn’t want to be friends at all.” The words burned in my mouth. “Where’d you getthat idea, anyway?”\n 　　 Charlie looked embarrassed now. “The subject might have come up today with Billy. . . .”\n 　　“You and Billy gossip like old women,” I complained, stabbing my fork viciously into the congealedspaghetti on my plate.\n 　　“Billy’s worried about Jacob,” Charlie said. “Jake’s having a hard time right now. . . . He’s depressed.”\n 　　I winced, but kept my eyes on the blob.\n 　　“And then you were always so happy after spending the day with Jake.” Charlie sighed.\n 　　“I’m happy now,” I growled fiercely through my teeth.\n 　　The contrast between my words and tone broke through the tension. Charlie burst into laughter, and I hadto join in.\n 　　“Okay, okay,” I agreed. “Balance.”\n 　　“And Jacob,” he insisted.\n 　　“I’ll try.”\n 　　“Good. Find that balance, Bella. And, oh, yeah, you’ve got some mail,” Charlie said, closing the subjectwith no attempt at subtlety. “It’s by the stove.”\n 　　I didn’t move, my thoughts twisting into snarls around Jacob’s name. It was most likely junk mail; I’d justgotten a package from my mom yesterday and I wasn’t expecting anything else.\n 　　Charlie shoved his chair away from the table and stretched as he got to his feet. He took his plate to thesink, but before he turned the water on to rinse it, he paused to toss a thick envelope at me. The letter skiddedacross the table and thunked into my elbow.\n 　　“Er, thanks,” I muttered, puzzled by his pushiness. Then I saw the return address — the letter was fromthe University of Alaska Southeast. “That was quick. I guess I missed the deadline on that one, too.”\n 　　Charlie chuckled.\n 　　I flipped the envelope over and then glared up at him. “It’s open.”\n 　　“I was curious.”\n 　　“I’m shocked, Sheriff. That’s a federal crime.”\n 　　“Oh, just read it.”\n 　　I pulled out the letter, and a folded schedule of courses.\n 　　“Congratulations,” he said before I could read anything. “Your first acceptance.”\n 　　“Thanks, Dad.”\n 　　“We should talk about tuition. I’ve got some money saved up —”\n 　　“Hey, hey, none of that. I’m not touching your retirement, Dad. I’ve got my college fund.” What was leftof it — and there hadn’t been much to begin with.\n 　　Charlie frowned. “Some of these places are pretty pricey, Bells. I want to help. You don’t have to go toall the way to Alaska just because it’s cheaper.”\n 　　It wasn’t cheaper, not at all. But it was far away, and Juneau had an average of three hundred twenty-oneovercast days per year. The first was my prerequisite, the second was Edward’s.\n 　　“I’ve got it covered. Besides, there’s lots of financial aid out there. It’s easy to get loans.” I hoped my bluffwasn’t too obvious. I hadn’t actually done a lot of research on the subject.\n 　　“So . . . ,” Charlie began, and then he pursed his lips and looked away.\n 　　“So what?”\n 　　“Nothing. I was just . . .” He frowned. “Just wondering what . . . Edward’s plans are for next year?”\n 　　“Oh.”\n 　　“Well?”\n 　　Three quick raps on the door saved me. Charlie rolled his eyes and I jumped up.\n 　　“Coming!” I called while Charlie mumbled something that sounded like, “Go away.” I ignored him andwent to let Edward in.\n 　　I wrenched the door out of my way — ridiculously eager — and there he was, my personal miracle.\n 　　Time had not made me immune to the perfection of his face, and I was sure that I would never take anyaspect of him for granted. My eyes traced over his pale white features: the hard square of his jaw, the softercurve of his full lips — twisted up into a smile now, the straight line of his nose, the sharp angle of hischeekbones, the smooth marble span of his forehead — partially obscured by a tangle of rain-darkenedbronze hair. . . .\n 　　 I saved his eyes for last, knowing that when I looked into them I was likely to lose my train of thought.\n 　　They were wide, warm with liquid gold, and framed by a thick fringe of black lashes. Staring into his eyesalways made me feel extraordinary — sort of like my bones were turning spongy. I was also a littlelightheaded, but that could have been because I’d forgotten to keep breathing. Again.\n 　　It was a face any male model in the world would trade his soul for. Of course, that might be exactly theasking price: one soul.\n 　　No. I didn’t believe that. I felt guilty for even thinking it, and was glad — as I was often glad — that I wasthe one person whose thoughts were a mystery to Edward.\n 　　I reached for his hand, and sighed when his cold fingers found mine. His touch brought with it the strangestsense of relief — as if I’d been in pain and that pain had suddenly ceased.\n 　　“Hey.” I smiled a little at my anticlimactic greeting.\n 　　He raised our interlaced fingers to brush my cheek with the back of his hand. “How was your afternoon?”\n 　　“Slow.”\n 　　“For me, as well.”\n 　　He pulled my wrist up to his face, our hands still twisted together. His eyes closed as his nose skimmedalong the skin there, and he smiled gently without opening them. Enjoying the bouquet while resisting the wine,as he’d once put it.\n 　　I knew that the scent of my blood — so much sweeter to him than any other person’s blood, truly likewine beside water to an alcoholic — caused him actual pain from the burning thirst it engendered. But hedidn’t seem to shy away from it as much as he once had. I could only dimly imagine the Herculean effortbehind this simple gesture.\n 　　It made me sad that he had to try so hard. I comforted myself with the knowledge that I wouldn’t becausing him pain much longer.\n 　　I heard Charlie approaching then, stamping his feet on the way to express his customary displeasure withour guest. Edward’s eyes snapped open and he let our hands fall, keeping them twined.\n 　　“Good evening, Charlie.” Edward was always flawlessly polite, though Charlie didn’t deserve it.\n 　　Charlie grunted at him, and then stood there with his arms crossed over his chest. He was taking the ideaof parental supervision to extremes lately.\n 　　“I brought another set of applications,” Edward told me then, holding up a stuffed manila envelope. Hewas wearing a roll of stamps like a ring around his littlest finger.\n 　　I groaned. How were there any colleges left that he hadn’t forced me to apply to already? And how didhe keep finding these loophole openings? It was so late in the year.\n 　　He smiled as if he could read my thoughts; they must have been very obvious on my face. “There are stilla few open deadlines. And a few places willing to make exceptions.”\n 　　I could just imagine the motivations behind such exceptions. And the dollar amounts involved.\n 　　Edward laughed at my expression.\n 　　“Shall we?” he asked, towing me toward the kitchen table.\n 　　Charlie huffed and followed behind, though he could hardly complain about the activity on tonight’sagenda. He’d been pestering me to make a decision about college on a daily basis.\n 　　I cleared the table quickly while Edward organized an intimidating stack of forms. When I movedWuthering Heights to the counter, Edward raised one eyebrow. I knew what he was thinking, but Charlieinterrupted before Edward could comment.\n 　　“Speaking of college applications, Edward,” Charlie said, his tone even more sullen — he tried to avoidaddressing Edward directly, and when he had to, it exacerbated his bad mood. “Bella and I were just talkingabout next year. Have you decided where you’re going to school?”\n 　　Edward smiled up at Charlie and his voice was friendly. “Not yet. I’ve received a few acceptance letters,but I’m still weighing my options.”\n 　　“Where have you been accepted?” Charlie pressed.\n 　　“Syracuse . . . Harvard . . . Dartmouth . . . and I just got accepted to the University of Alaska Southeasttoday.” Edward turned his face slightly to the side so that he could wink at me. I stifled a giggle.\n 　　“Harvard? Dartmouth?” Charlie mumbled, unable to conceal his awe. “Well that’s pretty . . . that’ssomething. Yeah, but the University of Alaska . . . you wouldn’t really consider that when you could go Ivy League. I mean, your father would want you to . . .”\n 　　“Carlisle’s always fine with whatever I choose to do,” Edward told him serenely.\n 　　“Hmph.”\n 　　“Guess what, Edward?” I asked in a bright voice, playing along.\n 　　“What, Bella?”\n 　　I pointed to the thick envelope on the counter. “I just got my acceptance to the University of Alaska!”\n 　　“Congratulations!” He grinned. “What a coincidence.”\n 　　Charlie’s eyes narrowed and he glared back and forth between the two of us. “Fine,” he muttered after aminute. “I’m going to go watch the game, Bella. Nine-thirty.”\n 　　That was his usual parting command.\n 　　“Er, Dad? Remember the very recent discussion about my freedom . . . ?”\n 　　He sighed. “Right. Okay, ten-thirty. You still have a curfew on school nights.”\n 　　“Bella’s no longer grounded?” Edward asked. Though I knew he wasn’t really surprised, I couldn’t detectany false note to the sudden excitement in his voice.\n 　　“Conditionally,” Charlie corrected through his teeth. “What’s it to you?”\n 　　I frowned at my dad, but he didn’t see.\n 　　“It’s just good to know,” Edward said. “Alice has been itching for a shopping partner, and I’m sure Bellawould love to see some city lights.” He smiled at me.\n 　　But Charlie growled, “No!” and his face flushed purple.\n 　　“Dad! What’s the problem?”\n 　　He made an effort to unclench his teeth. “I don’t want you going to Seattle right now.”\n 　　“Huh?”\n 　　“I told you about that story in the paper — there’s some kind of gang on a killing spree in Seattle and Iwant you to steer clear, okay?”\n 　　I rolled my eyes. “Dad, there’s a better chance that I’ll get struck by lightning than that the one day I’m inSeattle —”\n 　　“No, that’s fine, Charlie,” Edward said, interrupting me. “I didn’t mean Seattle. I was thinking Portland,actually. I wouldn’t have Bella in Seattle, either. Of course not.”\n 　　I looked at him in disbelief, but he had Charlie’s newspaper in his hands and he was reading the front pageintently.\n 　　He must have been trying to appease my father. The idea of being in danger from even the most deadly ofhumans while I was with Alice or Edward was downright hilarious.\n 　　It worked. Charlie stared at Edward for one second more, and then shrugged. “Fine.” He stalked offtoward the living room, in a bit of a hurry now — maybe he didn’t want to miss tip-off.\n 　　I waited till the TV was on, so that Charlie wouldn’t be able to hear me.\n 　　“What —,” I started to ask.\n 　　“Hold on,” Edward said without looking up from the paper. His eyes stayed focused on the page as hepushed the first application toward me across the table. “I think you can recycle your essays for this one.\n 　　Same questions.”\n 　　Charlie must still be listening. I sighed and started to fill out the repetitive information: name, address,social. . . . After a few minutes I glanced up, but Edward was now staring pensively out the window. As I bentmy head back to my work, I noticed for the first time the name of the school.\n 　　I snorted and shoved the papers aside.\n 　　“Bella?”\n 　　“Be serious, Edward. Dartmouth?”\n 　　Edward lifted the discarded application and laid it gently in front of me again. “I think you’d like NewHampshire,” he said. “There’s a full complement of night courses for me, and the forests are very convenientlylocated for the avid hiker. Plentiful wildlife.” He pulled out the crooked smile he knew I couldn’t resist.\n 　　I took a deep breath through my nose.\n 　　“I’ll let you pay me back, if that makes you happy,” he promised. “If you want, I can charge you interest.”\n 　　“Like I could even get in without some enormous bribe. Or was that part of the loan? The new Cullenwing of the library? Ugh. Why are we having this discussion again?”\n 　　 “Will you just fill out the application, please, Bella? It won’t hurt you to apply.”\n 　　My jaw flexed. “You know what? I don’t think I will.”\n 　　I reached for the papers, planning to crumple them into a suitable shape for lobbing at the trashcan, butthey were already gone. I stared at the empty table for a moment, and then at Edward. He didn’t appear tohave moved, but the application was probably already tucked away in his jacket.\n 　　“What are you doing?” I demanded.\n 　　“I sign your name better than you do yourself. You’ve already written the essays.”\n 　　“You’re going way overboard with this, you know.” I whispered on the off chance that Charlie wasn’tcompletely lost in his game. “I really don’t need to apply anywhere else. I’ve been accepted in Alaska. I canalmost afford the first semester’s tuition. It’s as good an alibi as any. There’s no need to throw away a bunchof money, no matter whose it is.”\n 　　A pained looked tightened his face. “Bella —”\n 　　“Don’t start. I agree that I need to go through the motions for Charlie’s sake, but we both know I’m notgoing to be in any condition to go to school next fall. To be anywhere near people.”\n 　　My knowledge of those first few years as a new vampire was sketchy. Edward had never gone into details— it wasn’t his favorite subject — but I knew it wasn’t pretty. Self-control was apparently an acquired skill.\n 　　Anything more than correspondence school was out of the question.\n 　　“I thought the timing was still undecided,” Edward reminded me softly. “You might enjoy a semester ortwo of college. There are a lot of human experiences you’ve never had.”\n 　　“I’ll get to those afterward.”\n 　　“They won’t be human experiences afterward. You don’t get a second chance at humanity, Bella.”\n 　　I sighed. “You’ve got to be reasonable about the timing, Edward. It’s just too dangerous to mess aroundwith.”\n 　　“There’s no danger yet,” he insisted.\n 　　I glared at him. No danger? Sure. I only had a sadistic vampire trying to avenge her mate’s death with myown, preferably through some slow and torturous method. Who was worried about Victoria? And, oh yeah,the Volturi — the vampire royal family with their small army of vampire warriors — who insisted that my heartstop beating one way or another in the near future, because humans weren’t allowed to know they existed.\n 　　Right. No reason at all to panic.\n 　　Even with Alice keeping watch — Edward was relying on her uncannily accurate visions of the future togive us advance warning — it was insane to take chances.\n 　　Besides, I’d already won this argument. The date for my transformation was tentatively set for shortly aftermy graduation from high school, only a handful of weeks away.\n 　　A sharp jolt of unease pierced my stomach as I realized how short the time really was. Of course thischange was necessary — and the key to what I wanted more than everything else in the world put together —but I was deeply conscious of Charlie sitting in the other room enjoying his game, just like every other night.\n 　　And my mother, Renée, far away in sunny Florida, still pleading with me to spend the summer on the beachwith her and her new husband. And Jacob, who, unlike my parents, would know exactly what was going onwhen I disappeared to some distant school. Even if my parents didn’t grow suspicious for a long time, even if Icould put off visits with excuses about travel expenses or study loads or illnesses, Jacob would know the truth.\n 　　For a moment, the idea of Jacob’s certain revulsion overshadowed every other pain.\n 　　“Bella,” Edward murmured, his face twisting when he read the distress in mine. “There’s no hurry. I won’tlet anyone hurt you. You can take all the time you need.”\n 　　“I want to hurry,” I whispered, smiling weakly, trying to make a joke of it. “I want to be a monster, too.”\n 　　His teeth clenched; he spoke through them. “You have no idea what you’re saying.” Abruptly, he flung thedamp newspaper onto the table in between us. His finger stabbed the headline on the front page:\n 　　DEATH TOLL ON THE RISE, POLICE FEAR GANG ACTIVITY“What does that have to do with anything?”\n 　　“Monsters are not a joke, Bella.”\n 　　 I stared at the headline again, and then up to his hard expression. “A . . . a vampire is doing this?” Iwhispered.\n 　　He smiled without humor. His voice was low and cold. “You’d be surprised, Bella, at how often my kindare the source behind the horrors in your human news. It’s easy to recognize, when you know what to lookfor. The information here indicates a newborn vampire is loose in Seattle. Bloodthirsty, wild, out of control.\n 　　The way we all were.”\n 　　I let my gaze drop to the paper again, avoiding his eyes.\n 　　“We’ve been monitoring the situation for a few weeks. All the signs are there — the unlikelydisappearances, always in the night, the poorly disposed-of corpses, the lack of other evidence. . . . Yes,someone brand-new. And no one seems to be taking responsibility for the neophyte. . . .” He took a deepbreath. “Well, it’s not our problem. We wouldn’t even pay attention to the situation if wasn’t going on so closeto home. Like I said, this happens all the time. The existence of monsters results in monstrous consequences.”\n 　　I tried not to see the names on the page, but they jumped out from the rest of the print like they were inbold. The five people whose lives were over, whose families were mourning now. It was different fromconsidering murder in the abstract, reading those names. Maureen Gardiner, Geoffrey Campbell, Grace Razi,Michelle O’Connell, Ronald Albrook. People who’d had parents and children and friends and pets and jobsand hopes and plans and memories and futures. . . .\n 　　“It won’t be the same for me,” I whispered, half to myself. “You won’t let me be like that. We’ll live inAntarctica.”\n 　　Edward snorted, breaking the tension. “Penguins. Lovely.”\n 　　I laughed a shaky laugh and knocked the paper off the table so I wouldn’t have to see those names; it hitthe linoleum with a thud. Of course Edward would consider the hunting possibilities. He and his “vegetarian”\n 　　family — all committed to protecting human life — preferred the flavor of large predators for satisfying theirdietary needs. “Alaska, then, as planned. Only somewhere much more remote than Juneau — somewherewith grizzlies galore.”\n 　　“Better,” he allowed. “There are polar bears, too. Very fierce. And the wolves get quite large.”\n 　　My mouth fell open and my breath blew out in a sharp gust.\n 　　“What’s wrong?” he asked. Before I could recover, the confusion vanished and his whole body seemed toharden. “Oh. Never mind the wolves, then, if the idea is offensive to you.” His voice was stiff, formal, hisshoulders rigid.\n 　　“He was my best friend, Edward,” I muttered. It stung to use the past tense. “Of course the idea offendsme.”\n 　　“Please forgive my thoughtlessness,” he said, still very formal. “I shouldn’t have suggested that.”\n 　　“Don’t worry about it.” I stared at my hands, clenched into a double fist on the table.\n 　　We were both silent for a moment, and then his cool finger was under my chin, coaxing my face up. Hisexpression was much softer now.\n 　　“Sorry. Really.”\n 　　“I know. I know it’s not the same thing. I shouldn’t have reacted that way. It’s just that . . . well, I wasalready thinking about Jacob before you came over.” I hesitated. His tawny eyes seemed to get a little bitdarker whenever I said Jacob’s name. My voice turned pleading in response. “Charlie says Jake is having ahard time. He’s hurting right now, and . . . it’s my fault.”\n 　　“You’ve done nothing wrong, Bella.”\n 　　I took a deep breath. “I need to make it better, Edward. I owe him that. And it’s one of Charlie’sconditions, anyway —”\n 　　His face changed while I spoke, turning hard again, statue-like.\n 　　“You know it’s out of the question for you to be around a werewolf unprotected, Bella. And it wouldbreak the treaty if any of us cross over onto their land. Do you want us to start a war?”\n 　　“Of course not!”\n 　　“Then there’s really no point in discussing the matter further.” He dropped his hand and looked away,searching for a subject change. His eyes paused on something behind me, and he smiled, though his eyesstayed wary.\n 　　“I’m glad Charlie has decided to let you out — you’re sadly in need of a visit to the bookstore. I can’t believe you’re reading Wuthering Heights again. Don’t you know it by heart yet?”\n 　　“Not all of us have photographic memories,” I said curtly.\n 　　“Photographic memory or not, I don’t understand why you like it. The characters are ghastly people whoruin each others’ lives. I don’t know how Heathcliff and Cathy ended up being ranked with couples likeRomeo and Juliet or Elizabeth Bennet and Mr. Darcy. It isn’t a love story, it’s a hate story.”\n 　　“You have some serious issues with the classics,” I snapped.\n 　　“Perhaps it’s because I’m not impressed by antiquity.” He smiled, evidently satisfied that he’d distractedme. “Honestly, though, why do you read it over and over?” His eyes were vivid with real interest now, trying— again — to unravel the convoluted workings of my mind. He reached across the table to cradle my face inhis hand. “What is it that appeals to you?”\n 　　His sincere curiosity disarmed me. “I’m not sure,” I said, scrambling for coherency while his gazeunintentionally scattered my thoughts. “I think it’s something about the inevitability. How nothing can keepthem apart — not her selfishness, or his evil, or even death, in the end. . . .”\n 　　His face was thoughtful as he considered my words. After a moment he smiled a teasing smile. “I still thinkit would be a better story if either of them had one redeeming quality.”\n 　　“I think that may be the point,” I disagreed. “Their love is their only redeeming quality.”\n 　　“I hope you have better sense than that — to fall in love with someone so . . . malignant.”\n 　　“It’s a bit late for me to worry about who I fall in love with,” I pointed out. “But even without the warning,I seem to have managed fairly well.”\n 　　He laughed quietly. “I’m glad you think so.”\n 　　“Well, I hope you’re smart enough to stay away from someone so selfish. Catherine is really the source ofall the trouble, not Heathcliff.”\n 　　“I’ll be on my guard,” he promised.\n 　　I sighed. He was so good at distractions.\n 　　I put my hand over his to hold it to my face. “I need to see Jacob.”\n 　　His eyes closed. “No.”\n 　　“It’s truly not dangerous at all,” I said, pleading again. “I used to spend all day in La Push with the wholelot of them, and nothing ever happened.”\n 　　But I made a slip; my voice faltered at the end because I realized as I was saying the words that they werea lie. It was not true that nothing had ever happened. A brief flash of memory — an enormous gray wolfcrouched to spring, baring his dagger-like teeth at me — had my palms sweating with an echo of rememberedpanic.\n 　　Edward heard my heart accelerate and nodded as if I’d acknowledged the lie aloud. “Werewolves areunstable. Sometimes, the people near them get hurt. Sometimes, they get killed.”\n 　　I wanted to deny it, but another image slowed my rebuttal. I saw in my head the once beautiful face ofEmily Young, now marred by a trio of dark scars that dragged down the corner of her right eye and left hermouth warped forever into a lopsided scowl.\n 　　He waited, grimly triumphant, for me to find my voice.\n 　　“You don’t know them,” I whispered.\n 　　“I know them better than you think, Bella. I was here the last time.”\n 　　“The last time?”\n 　　“We started crossing paths with the wolves about seventy years ago. . . . We had just settled nearHoquiam. That was before Alice and Jasper were with us. We outnumbered them, but that wouldn’t havestopped it from turning into a fight if not for Carlisle. He managed to convince Ephraim Black that coexistingwas possible, and eventually we made the truce.”\n 　　Jacob’s great-grandfather’s name startled me.\n 　　“We thought the line had died out with Ephraim,” Edward muttered; it sounded like he was talking tohimself now. “That the genetic quirk which allowed the transmutation had been lost. . . .” He broke off andstared at me accusingly. “Your bad luck seems to get more potent every day. Do you realize that yourinsatiable pull for all things deadly was strong enough to recover a pack of mutant canines from extinction? Ifwe could bottle your luck, we’d have a weapon of mass destruction on our hands.”\n 　　I ignored the ribbing, my attention caught by his assumption — was he serious? “But I didn’t bring them back. Don’t you know?”\n 　　“Know what?”\n 　　“My bad luck had nothing to do with it. The werewolves came back because the vampires did.”\n 　　Edward stared at me, his body motionless with surprise.\n 　　“Jacob told me that your family being here set things in motion. I thought you would already know. . . .”\n 　　His eyes narrowed. “Is that what they think?”\n 　　“Edward, look at the facts. Seventy years ago, you came here, and the werewolves showed up. Youcome back now, and the werewolves show up again. Do you think that’s a coincidence?”\n 　　He blinked and his glare relaxed. “Carlisle will be interested in that theory.”\n 　　“Theory,” I scoffed.\n 　　He was silent for a moment, staring out the window into the rain; I imagined he was contemplating the factthat his family’s presence was turning the locals into giant dogs.\n 　　“Interesting, but not exactly relevant,” he murmured after a moment. “The situation remains the same.”\n 　　I could translate that easily enough: no werewolf friends.\n 　　I knew I must be patient with Edward. It wasn’t that he was unreasonable, it was just that he didn’tunderstand. He had no idea how very much I owed Jacob Black — my life many times over, and possiblymy sanity, too.\n 　　I didn’t like to talk about that barren time with anyone, and especially not Edward. He had only beentrying to save me when he’d left, trying to save my soul. I didn’t hold him responsible for all the stupid thingsI’d done in his absence, or the pain I had suffered.\n 　　He did.\n 　　So I would have to word my explanation very carefully.\n 　　I got up and walked around the table. He opened his arms for me and I sat on his lap, nestling into his coolstone embrace. I looked at his hands while I spoke.\n 　　“Please just listen for a minute. This is so much more important than some whim to drop in on an oldfriend. Jacob is in pain.” My voice distorted around the word. “I can’t not try to help him — I can’t give upon him now, when he needs me. Just because he’s not human all the time. . . . Well, he was there for me whenI was . . . not so human myself. You don’t know what it was like. . . .” I hesitated. Edward’s arms were rigidaround me; his hands were in fists now, the tendons standing out. “If Jacob hadn’t helped me . . . I’m not surewhat you would have come home to. I owe him better than this, Edward.”\n 　　I looked up at his face warily. His eyes were closed, and his jaw was strained.\n 　　“I’ll never forgive myself for leaving you,” he whispered. “Not if I live a hundred thousand years.”\n 　　I put my hand against his cold face and waited until he sighed and opened his eyes.\n 　　“You were just trying to do the right thing. And I’m sure it would have worked with anyone less mentalthan me. Besides, you’re here now. That’s the part that matters.”\n 　　“If I’d never left, you wouldn’t feel the need to go risk your life to comfort a dog.”\n 　　I flinched. I was used to Jacob and all his derogatory slurs — bloodsucker, leech, parasite. . . .\n 　　Somehow it sounded harsher in Edward’s velvet voice.\n 　　“I don’t know how to phrase this properly,” Edward said, and his tone was bleak. “It’s going to soundcruel, I suppose. But I’ve come too close to losing you in the past. I know what it feels like to think I have. Iam not going to tolerate anything dangerous.”\n 　　“You have to trust me on this. I’ll be fine.”\n 　　His face was pained again. “Please, Bella,” he whispered.\n 　　I stared into his suddenly burning golden eyes. “Please what?”\n 　　“Please, for me. Please make a conscious effort to keep yourself safe. I’ll do everything I can, but I wouldappreciate a little help.”\n 　　“I’ll work on it,” I murmured.\n 　　“Do you really have any idea how important you are to me? Any concept at all of how much I love you?”\n 　　He pulled me tighter against his hard chest, tucking my head under his chin.\n 　　I pressed my lips against his snow-cold neck. “I know how much I love you,” I answered.\n 　　“You compare one small tree to the entire forest.”\n 　　I rolled my eyes, but he couldn’t see. “Impossible.”\n 　　 He kissed the top of my head and sighed.\n 　　“No werewolves.”\n 　　“I’m not going along with that. I have to see Jacob.”\n 　　“Then I’ll have to stop you.”\n 　　He sounded utterly confident that this wouldn’t be a problem.\n 　　I was sure he was right.\n 　　“We’ll see about that,” I bluffed anyway. “He’s still my friend.”\n 　　I could feel Jacob’s note in my pocket, like it suddenly weighed ten pounds. I could hear the words in hisvoice, and he seemed to be agreeing with Edward — something that would never happen in reality.\n 　　Doesn’t change anything. Sorry.\n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/148/5944.html","bookId":330,"book":{"id":330,"title":"暮光之城：月食 Eclipse","description":"简介： The vampire Victoria (James\u0027 mate from Twilight) has created an army of \"newborn\" vampires to battle the Cullen family and murder Bella for revenge. Meanwhile, Bella is compelled to choose between her relationship with Edward and her friendship ...","cover":"http://novel.tingroom.com/uploads/allimg/101230/129203183520ad4.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/148","creation":"Aug 1, 2019 12:18:34 AM","modification":"Aug 1, 2019 12:18:34 AM"}}
