{"id":103223,"no":1,"title":"Page 1","content":"1\n For six days, Croggon Hainey watched the Rockies scroll beneath the borrowed, nameless dirigible, until finally the last of the jagged ridges and snow-dusted plateaus slipped behind the ship on the far side of Denver. He’d made this run a dozen times before, in fair weather and foul, with contraband cargo and passengers alike; and on this particular trip a tailwind gently urged the ship forward.\n But the speed that took him from the Pacific Northwest, over the mountains and down to the flatlands, did not improve the captain’s mood.\n With his hands balled into fists and jammed atop his knees, he groused, “We should’ve caught them by now. We ought to be right on top of them.”\n “The breeze moves us both,” the first mate said, and he shrugged. He adjusted his goggles to guard against the glare of the sun on the clouds and added, “But we’ll catch them. Any minute now.”\n Hainey shifted in the captain’s seat, which had been built with a smaller man in mind. He removed his hat and squeezed at his forehead as if he could massage it into greater wakefulness or concentration. “They’ll have to dock soon. They didn’t even get a full tank of hydrogen back in Grand Junction. Simeon?” he asked the first mate, who was likewise crammed into a seat beside him.\n “Yessir?”\n “They have to set down in Topeka, don’t they? There’s no place else you know that’ll take them…or us?”\n “No place I know of. But I ain’t been through this way in awhile. Brink may know something I don’t,” he said, but he didn’t sound very worried. Over his shoulder he asked, “What’s our fuel situation look like?”\n Lamar adjusted a lip full of tobacco and said, “Doing all right. We’ll make it past Topeka, if that’s what you want to hear.” The engineer glanced at the doorway to the engine room, though he couldn’t quite see the tanks from where he was sitting. “Maybe even into Missouri.”\n The captain didn’t precisely brighten, but for a moment he sounded less unhappy. “We might make Kansas City?”\n “We might, but I wouldn’t bet the boat on it.” Lamar squeezed his lip to adjust his chew.\n Simeon reached for a thruster lever and knocked his elbow on a big glass knob. He said, “Well, I might bet this boat.” But he didn’t push his complaint. Everybody already knew that the nameless craft, fitted for small men and light cargo, was not anyone’s preferred vessel; and no one wanted to imply, even in jest, that everything was not being done to retrieve the captain’s ship of choice.\n Hainey unfurled himself from the captain’s chair. His knees popped when he stood and he crouched to keep from hitting his head on the glass shield that separated him from the sky. He put one hand out against it and leaned that way, staring as far into the distance, and as far along the ground, and as far up into the heavens as his eyes could reach, but the view told him nothing he did not already know.\n His ship—his true ship, the one he’d stolen fair and square eight years before—was nowhere to be seen.\n He asked everyone, and no one in particular, “Where do you think they’re taking her?” But since he’d asked that question a dozen times a day for the last week, he already knew he could expect no useful answer. He could speculate easily enough, but none of his speculation warmed him with hope.\n The red-haired thief Felton Brink had taken Hainey’s ship, the Free Crow, and he was flying east with it. That much was apparent.\n The chase had brought Croggon Hainey from the Pacific port city of Seattle down through Idaho, past Twin Falls and into Wyoming where he’d almost nabbed Brink in Rock Springs. Then the course had shifted south and a bit west, to Salt Lake City and then east, through Colorado and now the trail was taking them both through Kansas.\n East. Except for that one brief detour, always east.\n And it didn’t much matter whether the Free Crow would veer to the north or south on the far side of the Mississippi River. Either way, the captain was in for trouble and he knew it.\n The Mason-Dixon meant only a little to him. Either side meant capture and probably a firing squad or a noose, though all things being equal, he would’ve preferred to take his lumps from the Union. The southern states in general (and Georgia in particular) had given him plenty already. The raised, pink stripes on his back and the puckered brand on his shoulder were souvenirs enough from a life spent in slavery, and he’d accept no addition to that tally.\n So as much as he might’ve said aloud, “I don’t care where they’re taking my ship, I plan to take it back,” he privately prayed for a northern course. In the Union he was only a pirate and only to be shot on sight. In the Confederate states he was all that and fugitive property, too.\n It wasn’t fair. He’d had no intention of coming back past the river again, not for several years…or not until the war had played itself out, anyway; and it wasn’t fair that some underhanded thief—some conniving boy nearly young enough to be his son—had absconded with his rightfully pilfered and customized ship.\n Whatever Felton Brink was getting paid, Hainey hoped it was worth it. Because when Hainey caught up to him, there wouldn’t be enough left of the red-headed thief to bury.\n The tailwind gusted and the nameless ship swayed in its course. A corresponding, correcting gust from the appropriate thruster kept the craft on track, and sitting on the straight, unbroken line of the prairie horizon a tiny black dot flicked at the corner of Croggon Hainey’s vision.\n He stood up straight, too quickly. He rapped his bald, dark head on the underside of the cabin’s too-short roof and swore, then pointed. “Men,” he said. He never called them “boys.” “On the ground over there. You see it? That what I think it is?”\n Simeon leaned forward, languid as always. He squinted through the goggles and said, “It’s a ship. It’s grounded.”\n “I can see it’s a ship. What I can’t see is if it’s my ship or not. Give me the glass,” he demanded. He held out his hand to Simeon but Lamar brought the instrument forward, and stayed to stand by the window.\n Hainey extended the telescoping tube and held it up to his right eye. From habit, he rested his thumb on the scar that bisected that side of his face from the corner of his mouth to his ear. He closed his left eye. He scanned and aimed, and pointed the scope at the distant dot, and he declared in his low, loud, rumbling voice, “There she is.”\n Lamar held his hands over his eyes like an awning. “You sure?”\n “Of course I’m sure.”\n “How far out?” Simeon asked. He adjusted his position so that he could reach the important levers and pertinent buttons, readying himself for the surge of speed that Hainey was mere moments away from ordering.\n “Couple of miles?” the captain guessed. “And open sky, no weather to account for.” He snapped the scope back to its smaller size and jammed it into his front breast pocket.\n Lamar shook his head, not arguing but wondering. “They’ve been moving so slow. No wonder they had to set down out here.”\n Simeon removed his goggles and set them atop his head, where their strap strained against the rolled stacks of his roughly braided hair. “They’ve never gotten any speed beneath them,” he said, the island drawl stretching his words into an accusation.\n Hainey knew, and it worried him, but this was his chance to gain real ground. The Free Crow, which Brink had renamed the Clementine, had once been a Confederate war dirigible and she was capable of tremendous speed when piloted properly. But she’d been flying as if she were crippled and it meant one of two things: Either she was critically damaged, or she was so heavily laden that she could barely maintain a good cruising altitude.\n Her true and proper captain hoped for the latter, but he knew that her theft had been a violent event, and he didn’t have the faintest clue what she carried. It was difficult not to fear the worst.\n Only a significant head start had prevented Hainey from retrieving her so far, and here she was—having dragged herself across the sky, limping more than sailing, and now she was stopped within a proverbial spitting distance.\n “Simeon,” he said, and he didn’t need to finish.\n The Jamaican was already pulling the fuel release valves and flipping the switches to power up the boosters. “Fifteen seconds to fire,” he said, meaning that the three men had that long to secure themselves before the jolt of the steam-driven back-up tanks would shoot the dirigible forward.\n Lamar buckled his skinny brown body into a slot against the wall, within easy reach of the engine room. Hainey sat back down in the captain’s seat and pulled his harness tight across his chest; Simeon used his last five seconds to light one of the hand-rolled cigarettes he kept in a tin that was bolted onto the ship’s console.\n At the end of the prescribed time, the unnamed airship lurched forward, snapping against the hydrogen tank that held it aloft and leaping in a back-and-forth motion until the tank and the engines found their rhythm, and the craft moved smoothly, and swiftly. Hainey didn’t much like his temporary vessel, but he had to give it credit—it was fast, and it was light enough to soar when necessary.\n “What are we…” Lamar said from his seat on the wall, then he swallowed and started again. “What will we do when we catch them?”\n The captain pretended he hadn’t given it much thought. He declared, “We’re going to kill the sons of bitches and take our ship back.” But it would be more complicated than that, and he didn’t really know what he’d find when the ships and their crews had a chance to collide.\n He’d been weighing the pros, cons, and possibilities since leaving Seattle.\n The Free Crow was heavily reinforced, but heavily powered to compensate for its armor. It was a juggernaut of a machine, but if Hainey had learned one thing from following the bird over a thousand miles, he’d learned that Brink’s crew did not yet know what the Free Crow was capable of. The ship was barely flying without knocking into mountains and mowing down trees. \n","sourceLink":"https://allnovel.net/clementine-the-clockwork-century-1-1/page-1.html","bookId":1672,"book":{"id":1672,"title":"Clementine (The Clockwork Century #1.1)","description":"Storyline: \n Clementine (The Clockwork Century #1.1) \n Maria Isabella Boyd’s success as a Confederate spy has made her too famous for further espionage work, and now her employment options are slim. Exiled, widowed, and on the brink of poverty…she reluctantly goes to work for the Pinkerton National Detective Agency in Chicago. \n Adding insult to injury, her first big assignment is commissioned by the Union Army. In short, a federally sponsored transport dirigible is being violently pursued across the Rockies and Uncle Sam isn’t pleased. The Clementine is carrying a top secret load of military essentials—essentials which must be delivered to Louisville, Kentucky, without delay. \n Intelligence suggests that the unrelenting pursuer is a runaway slave who’s been wanted by authorities on both sides of the Mason-Dixon for fifteen years. In that time, Captain Croggon Beauregard Hainey has felonied his way back and forth across the continent, leaving a trail of broken banks, stolen war machines, and illegally distributed weaponry from sea to shining sea. \n And now it’s Maria’s job to go get him. \n He’s dangerous quarry and she’s a dangerous woman, but when forces conspire against them both, they take a chance and form an alliance. She joins his crew, and he uses her connections. She follows his orders. He takes her advice. \n And somebody, somewhere, is going to rue the day he crossed either one of them.\n \n","cover":"https://allnovel.net/images/clementine-the-clockwork-century-1-1.jpg","author":"Cherie Priest","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/clementine-the-clockwork-century-1-1.html","creation":"Oct 5, 2019 8:57:51 AM","modification":"Oct 5, 2019 10:21:35 PM"}}
