{"id":74026,"no":19,"title":"Page 19","content":"She pivoted on her heel, gazing into the wide expanse of the store. Then she remembered her grocery cart. She’d abandoned it by a Jenga-tower display of organic biscotti cookies, but now it was gone. The store hummed, the price scanners made small, polite beeps, the butcher called the next person in line. Joanna could just see the wellscrubbed grocery boy who had rescued her cart, now removing the butcher paper from her purchased meats and slapping them back behind the glass. Two Cornish hens. Slabs of lamb. Gnarled hamburger. Everything back in its right place.\\n\\n Chapter 8\\n\\n A t the end of the day Jake stuck his hand between the closing elevator doors. “We have an interview set up for next Tuesday with little woman on the prairie,” he said. “Bronwyn … Pemberley? Paddington? Something like that.”\\n\\n Pembroke, Charles wanted to correct him. “Okay,” he answered. Jake held the doors open. He’d been watching Charles all day with a perverse curiosity. He was right to watch, of course—something was bothering Charles, something that was directly linked to work. Not that Charles was about to explain himself.\\n\\n They stared at each other for a few seconds more. Then the elevator buzzer sounded, indicating that the door had been held open for too long. “So, see ya,” Jake finally said, releasing his hand.\\n\\n “Yep,” Charles answered. The elevator doors slid closed. So this was where Bronwyn had turned up after twelve years. Charles didn’t see her the summer after senior year. In fact, none of his circle did. She didn’t attend the parties people held when they were all home on breaks from their respective colleges the following Thanksgiving and Christmas, and no one heard from her the next summer, when they were all home for three months. Bronwyn’s dad was still a member of the local country club, and a few of Charles’s friends asked him if Bronwyn was okay. Bronwyn was doing wonderfully, he reported. She’d aced her first year at Dartmouth, just as everyone thought she would. Mr. Pembroke had gotten her a prestigious internship in Europe for the entire three-month summer break. The same thing happened the summer after sophomore year and junior year—more far-flung internships, all orchestrated by her father. By the time everyone finished senior year, many weren’t coming home for summers anymore. They’d found jobs elsewhere. Their strong ties to their Swithin friends were forgotten, at least until the five-year reunion. But Charles, well, Charles didn’t know how to move on.\\n\\n Charles couldn’t see Bronwyn now. There was no way, not after all this time, not after what he’d done, what she’d heard, which he was sure was why she’d stayed away. Or maybe he could face her: how bad could it be? And really, wasn’t he kind of curious? But then he pictured her with that pitying look on her face, the one she’d given Scott when she cornered him on the patio, probably asking him to come and sit with Charles and the rest of his friends. The same one she’d given Charles the very last moment they were together.\\n\\n She’d still feel sorry for Charles. She’d see him as a powerless consumer, a slave to modernity. Not brave enough to build a tent, for he’d told her that story of how he’d failed miserably at camping with his dad. He’d told her lots of things about his father in moments of weakness. He’d even slipped out a few resentful words about Scott. Charles always took back everything he said about anyone quickly and repentantly, and Bronwyn understood he didn’t mean it—”Family can be so awful sometimes,” she’d say—but that only made what Charles eventually screamed to Scott in the mud room all the more shameful. It proved to Bronwyn once and for all that he really did mean all those things he’d said. His father and brother affected him far more than he let on.\\n\\n And then Charles was right back to where he started—he couldn’t see her. He had to get out of this. He could pretend he was sick, maybe, the day of the interview. Or he could just blow it off altogether. Which would get him fired.\\n\\n If only he could ask Joanna what he should do. But he also knew that hearing about Bronwyn made her uncomfortable—it was a sensitive spot when they first started dating, and he feared raising it again. Soon after they’d become serious, they’d revealed their past relationships. Joanna had had several: some boyfriends in high school, casual flings in college, someone with whom she was serious about shortly after she graduated. It had surprised Joanna when Charles admitted he’d only dated Bronwyn; he’d gone on dates after that, but nothing had panned out. Her eyes had widened. A look of intimidation had crossed her face. “Was she the one who got away?” she’d teased, trying to sound playful. Charles hadn’t offered up a satisfying explanation— everything sounded like a halfhearted excuse. It wasn’t really that no one could measure up to Bronwyn. It was more that he wasn’t sure he deserved anyone after she broke it off.\\n\\n But it was more than just wanting to spare Joanna’s feelings that held him back from telling her. The longer he and Joanna were together as a married couple, the more she made him uneasy. He sensed something was a little off in her; she was a little restless. There was something on the tip of her tongue she wanted to say but never did, and this hesitance had multiplied since they’d moved out of the city. Several possibilities floated through his mind—was she resentful of family obligations, especially since they lived much closer to Roderick now? Did she hate living in the suburbs altogether? When Charles had walked her through their current house, she’d passed through the rooms silently, woodenly. Then when she was done, she gave him a yearning, pleading look. “What?” Charles had snapped.\\n\\n “Nothing,” she answered quickly, opening a cabinet and peering inside.\\n\\n “You don’t like it.”\\n\\n “No, I do. It’s … nice.”\\n\\n “Then what?”\\n\\n “Nothing.”\\n\\n Was there something wrong with the suburbs? Joanna had lived here before, though; she’d known what to expect. She said she wanted to move out here with him. Why was she making him feel so wrongfooted, like he’d forced her into it?\\n\\n The looks came so often these days. He’d gotten one when he rearranged some of his books she’d unpacked on the bookshelf. He’d gotten another one when he corrected her on the correct pronunciation of Kandahar and another when he came home with window curtains he’d ordered from Horchow. Hadn’t she wanted window coverings? Hadn’t she said she hated how people could look in and see everything they were doing? She’d looked at the curtains and said, in a baffling, crushed voice, “I’ve never even heard of Horchow.” Charles had no idea how he was supposed to respond. In apology?\\n\\n Those looks got to him in ways he couldn’t articulate. And then not long ago, it had clicked: they were the same exasperated, disappointed looks his father used to give him. Joanna raised the same questions in him, too. What am I doing wrong? What do you want from me? Perhaps that was why Charles’s father liked her. Perhaps he saw himself in this girl. It both drew Charles to Joanna and repelled him from her at times.\\n\\n If he told her about the Bronwyn conundrum, he might also get that disappointed look. How dare you? How could you? More than that, Charles wasn’t sure if he could get into the nuts and bolts of it with Joanna. He wasn’t sure he could tell her what he’d said to Scott and why Bronwyn had broken up with him. If he did, Joanna might think differently about him altogether.\\n\\n It began to pour as he boarded the westbound SEPTA train. He watched the rain drip down the windows, flooding the streets. At his station, he bought a bouquet from the flower seller by Starbucks and sprinted to his car. When he got home, he sat in the driveway, windshield wipers squeaking, and took in his own house’s brick facade— the newly growing grass, the red flag on their mailbox. The house was on a hill, and in the rearview mirror he could see the rest of the development splayed out in the valley. Lights were on in the windows. TVs flickered. A woman stood at a kitchen sink, rinsing dishes. There was the perfectly circular cul-de-sac, the flat, well-sodded dog park, the softly lit sign at the development’s entrance. Down the hill to the left was Spirit, the street of unsold homes. There no lights were on. Every window was bare.\\n\\n Somewhere beyond the trees was Swithin. Charles hadn’t been there in a while, but he knew that right in the middle of the grand lobby was a bronzed relief of Charles’s great-grandfather’s face. The first time Charles visited the school was when he was about four years old, not long after his parents adopted Scott. His mother let him walk up to the plaque and run his hands over the mold of his grandfather’s nose, the sharp etchings of his eyebrows, the cross-hatchings of his mustache.\\n\\n “This school wouldn’t be here if it weren’t for great-grandpa,” she whispered, squeezing his hand. “He made all this possible. And you’re part of this story, too. You have his name.”\\n\\n “What about Scott?” Charles asked. “He’s not part of the story, is he? He’s not one of us.”\\n\\n His mother looked conflicted. “You shouldn’t say things like that,” she said after a moment.\\n\\n When Scott was in second grade at Swithin and Charles was in fourth, Scott came home and announced a rumor he’d heard: Greatgrandpa Charlie Bates once paid a wealthy black family a lot of money not to go to Swithin. “Is that true?” Scott gasped. “Did he not like black people?”\\n\\n Scott understood by then that black was part of his identity, too. He stood out from the rest of them, so their parents couldn’t keep his adoption a secret. They’d taught him that his difference was good, special. To Charles, it just felt like another thing Scott had and he didn’t—it seemed like that list of things was getting bigger by the day. And although Scott hadn’t become connected with black culture yet— that would come later—he was certainly curious about black people.\\n\\n Charles had heard the rumors Scott was referring to, but Sylvie had quickly dispelled them. He stood up and faced his brother, feeling that he needed to set this straight. “You shouldn’t say that,” he said to Scott. He repeated what their mother said to him: “He was a good man. He rebuilt the school.”\\n\\n “But …” Scott looked confused. “Why would someone say it if it’s not true?”\\n\\n “It’s not true.” Charles looked at Sylvie for assistance. She sat there, stunned, her fork at her plate. “He’s the reason you’re here,” he said to Scott. “You should be grateful.”\\n\\n “Enough,” James said, rising to his feet. His face was red again. He pointed to the door, sending Charles to his room.\\n\\n “James!” their mother pleaded.\\n\\n “I don’t want him saying things like that,” James boomed, turning to her. He looked at Charles again, who had shrunk against the wall, tears in his eyes. “Just go,” James said.\\n\\n Charles ran upstairs as fast as he could. His bedroom was configured in such a way that a moment later he could hear his parents whispering through the vents. They must have been in the dining room, putting some distance between themselves and Scott. \\n\\n","sourceLink":"https://allnovel.net/everything-we-ever-wanted/page-19.html","bookId":2401,"book":{"id":2401,"title":"Everything We Ever Wanted","description":"Storyline: A late-night phone call on a Sunday evening rarely brings good news. So when Sylvie, a recently-widowed mother of two, receives a call from the head teacher of the school she\u0027s on the board of, she knows it won\u0027t be something she wants to hear.\\n","cover":"https://allnovel.net/images/everything-we-ever-wanted.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/everything-we-ever-wanted.html","creation":"Oct 5, 2019 8:58:41 AM","modification":"Oct 5, 2019 10:29:27 AM"}}
