{"id":74084,"no":48,"title":"Page 48","content":"Over the next few days he went to the adoption agency again and again, begging for answers. The obsession with knowing metastasized in his head. It was the only way, he decided, that he would truly understand who he was. But it was always that same padded woman, always that same dim smile, always the same I’m sorry. Once, he threw a balled-up napkin at her, furious. Another time, he fought with the locked door to the agency’s bathroom until the person on the inside came out, hands raised in surrender, as if Scott was robbing him. It was an old man, a suspicious wet dribble on the front of his khaki pants. “I’m sorry,” the man said over and over. His eyes looked enormous behind his glasses. “It’s all yours. I’m sorry.” As the complex’s security guard escorted Scott out of the agency, telling him he was never allowed to set foot there again, Scott felt sticky with shame.\\n\\n This was all his parents’ fault, he decided, for hiding the truth from him. For his mother wanting him to be part of their world but always making him feel separate. For his father never encouraging him to look beyond working on cars or beating up kids in wrestling to something loftier and more challenging. For both of them turning the other cheek at his miserable report cards, for nodding mutely when he said he wanted to quit piano lessons, all the while forcing Charles to play, smacking his wrists if he didn’t practice. For never telling Scott to move out of their house, for so completely sheltering him from the world.\\n\\n And why? Was it because of some long-seeded, pent-up guilt? Some fist-curling, hair-pulling agony they felt for all the dirty looks and thoughts they’d had about people of different races, people of different means? What flowed out of Charles’s mouth that day of the party all those years ago didn’t surprise Scott in the slightest—it was what he’d imagined they thought all along. Except they weren’t saying it, of course. They were suppressing it as best they could. They had been so politically correct with him, tripping over their feet trying to make him feel equal, merely pigeonholing him more.\\n\\n Or maybe they hadn’t pushed him because they’d known he wouldn’t be able to take it. Maybe they’d lost faith in him long before he’d had the chance to prove anything. Maybe that was part of the pigeonhole, too. They knew Charles’s background and thus could pinpoint his potential, but with Scott? Who the hell knew? Just let him do whatever the hell he wants.\\n\\n Didn’t we give you a good life? His mother had said to him. Didn’t we take care of you?\\n\\n And then there was that kid, Christian. Scott knew his name all too well now, called up his name at lightning speed, whereas before it sometimes took him a moment, only identifying him by the nickname he’d given him in his head, Phantom, because of the way he lurked around the locker room, because of the way he slipped soundlessly into warm-up before practice, because of his pancake-white face and that burlap thing he wore as a jacket and the way he chattered to himself, freaking out the other boys. He wasn’t a nice kid. Oh they twisted that after he died. He was a son of a bitch, sniggering remarks about the other kids loud enough for them to hear, precisely diagnosing their worst insecurities: one boy’s bubble ass, another boy’s stutter. Scott even heard Christian’s snarky, slithery, Jack Nicholson-timbre voice cackle about the puny size of a certain kid’s cock, the biggest, burliest kid on the team, the one who made disparaging remarks about homos at every turn. It was surgical, the way Christian did it. A precise, deadly talent.\\n\\n And no wonder the kid got shit for it. As time went on, though, Scott came to realize that Christian wanted to provoke them. He wanted to catch hell for it. After practice one day, Scott caught him alone and grabbed his arm. Christian’s face got stone hard and opaque. There were a lot of things Scott wanted to say to him. Scott knew why he was doing it. He might not know the specifics—a shitty home life, an absent father, an overworked mother, beatings, molestation, somehow landing in this school, always feeling unwanted and never knowing his place—but Christian had a good eye for insecurities because he had so many of his own. Scott wanted to tell the kid that he didn’t have to be like this, and the more he was, the worse it would be. The thicker the shell, the darker the days, the more miserable the life until he would wake up and have no idea who he fucking was anymore. He wanted to bestow dadlike wisdom to him, really get through to him that it didn’t have to be like this. But all he could say was, “Watch it, bro. Got it?” And Christian had stared at him, dead-eyed, and hissed, “Whatever, white boy. Go drive your Lexus.” And then he turned around and sauntered out.\\n\\n A few days later, Scott saw some of the boys in the practice room, huddled in a circle, Christian in the middle. It was probably where someone got the idea they were hazing—there was a fraternal ritual to it, each boy taking an orderly turn to throw a punch. And yeah, Scott looked away. He felt no emotions about it, either. His apathy formed a hard and waxy crust around him, like the outer shell of a beetle. Fuck that kid. Let him learn the hard way. He deserved it.\\n\\n In Arizona, after the guard shoved Scott out of the agency, fury snapped off his body like lightning. He hated that he’d walked away from that kid. He hated what he’d somehow become. He sank to the ground and slammed his fist into the concrete sidewalk, again and again, blood rising on his knuckles. He did it until it hurt, and then cradled his damaged fist in his lap, watching the blood pool.\\n\\n Next door to the adoption agency was another office, some sort of nonprofit for immigrant services. A blade-thin woman pushed out that office’s door and noticed him, sitting there, bleeding, his arms around his jack-knifed knees. “Oh my goodness,” she said, rushing over. “What happened?”\\n\\n Scott didn’t answer. She crouched down. Her lipstick was glossy and over-applied. Under her arm were a bunch of papers in a manila folder. Scott’s mouth felt dry. The Arizona desert had sucked all the words from him. He could hear his heart sloshing in his ears. All the breath seemed to leave him, and spots formed in front of his eyes.\\n\\n When he woke up, he was lying on an uncomfortable couch. The room was very cold; the woman who had been standing over him outside was now sitting behind a gray, metal desk, watching him carefully. She sighed with relief as he took in a breath. “I think you had a panic attack,” she said. “My brother used to get them. I’m Veronica, by the way.”\\n\\n She let Scott lie there for a moment and get his bearings, bringing him a sip of water from a paper cone. After a while, she gestured toward where the adoption agency was and asked if he had been turned down. “Yes,” he answered.\\n\\n She clucked her tongue. “Their rules,” she said. “The way I see it, whoever wants a child should get one.”\\n\\n He blinked, startled. “No, I am the child,” he said.\\n\\n At that, Veronica said she was finished with work for the day. She took him by the hand and brought him back to her apartment, which was only a few blocks away. It was the bottom unit of a sunburst-yellow stucco building, the railings chipped, the walkways crumbling, the landscaping tattered and weedy. The apartment was small but clean, with cheerful striped curtains in the windows. She got him some tea, and then sat down next to him on the couch and asked him to tell her what had happened. Scott did. And when he was finished, he asked what he should do. “Keep going back to that agency,” she said. ‘They’ll eventually tell you, if you want to know.” “They kicked me out.”\\n\\n “I’ll go for you, if you want.”\\n\\n Because he didn’t want to touch any more of the money he’d withdrawn from his trust—he didn’t want his family to trace him here—Scott got a job cleaning a dog daycare center in the university section of town to pay for his tiny, one room apartment. Veronica, who slept over a lot, pestered the adoption agency again and again, but it never came to anything. Still, she kept trying.\\n\\n A year passed, a whole year in Arizona—the excruciating heat leading to brain-melting heat, leading to God-fearing thunderstorms, leading to thick humidity. There were about two weeks of pleasant weather, and then the cycle repeated again. Veronica was originally from Phoenix. She told him about her job helping undocumented workers find work and medical care and housing. She told Scott stories of how those people trekked through the desert for six days just to reach the United States, some of them falling behind, some of them getting lost, many of them dying of dehydration. “All to get here,” she said. “All to get to this country and have what we all take for granted.”\\n\\n Scott hadn’t meant to fall in love with her; he hadn’t meant to fall in love with anyone. And yet, maybe he’d fallen in love with her the very first moment she’d squatted down on that hot pavement and put her arms around him. Maybe he’d fallen for her for listening.\\n\\n But he should have known. He should have known the day was going to come. He was lying in Veronica’s bed, the sheets wrapped around him, the fan pointed at his head, Veronica emerged from the bathroom holding something plastic between her fingers. There had been a big smile on her face when she held the pink wand aloft. Her happiness had been the most shocking part of it all.\\n\\n After she told him, he sat up in bed. “I’m not going to be able to give you what you want,” he said. “I can’t be the person you need for this.”\\n\\n “Oh, now,” she said, perching next to him. “You’re just scared. I called my family. You should call yours.”\\n\\n “Call mine?” he repeated. He shook his head. He expected her, of all people, to understand. “I can’t do that. I can’t do this.”\\n\\n Her face fell. She set the wand on the nightstand. “Why not?”\\n\\n “Because … I can’t. I can’t do anything.”\\n\\n She blew a raspberry at him. “Of course you can. Do you think I just go around sleeping with anybody? Do you think I would’ve even come to you if I thought you wouldn’t have been able to handle this?”\\n\\n He stared at her. It was then he realized that in her eyes, he had actually seemed capable. Powerful. Up to the challenge. It wasn’t something he was used to.\\n\\n He stood up and thrust his legs into his jeans. “I have to go.”\\n\\n “What?” she cried.\\n\\n “I just need some time.”\\n\\n “Can you talk to me about it?”\\n\\n But he wasn’t sure he could explain it if he tried, only that it felt like there was a pressure inside of him, a blinking red light ready to detonate. Escaping seemed like the only option. He kept his phone off, not wanting to answer her calls. He would disappear. She would never hear from him again.\\n\\n At first, he didn’t know where he was going. On the road, his fingers gripping the wheel, the car stinking of his sweat, he screamed when people cut him off. He smoked cigarettes down to the nub and immediately lit new ones. A child stuck her tongue out at him as a minivan passed, and he felt the urge to run the car off the road.\\n\\n And then, all of the anger seeped out of him, a slow leak from a tire. Was it really the worst thing that someone believed in him? Was it really the smartest thing to run from her? He thought about what Joanna had said more than a year ago, that acting like an asshole was easier because people had fewer expectations of him. It was what he was doing. It was what that spook kid had done, too. \\n\\n","sourceLink":"https://allnovel.net/everything-we-ever-wanted/page-48.html","bookId":2401,"book":{"id":2401,"title":"Everything We Ever Wanted","description":"Storyline: A late-night phone call on a Sunday evening rarely brings good news. So when Sylvie, a recently-widowed mother of two, receives a call from the head teacher of the school she\u0027s on the board of, she knows it won\u0027t be something she wants to hear.\\n","cover":"https://allnovel.net/images/everything-we-ever-wanted.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/everything-we-ever-wanted.html","creation":"Oct 5, 2019 8:58:41 AM","modification":"Oct 5, 2019 10:29:27 AM"}}
