{"id":70765,"no":15,"title":"Page 15","content":"“Do you want me to close the door?” she asked, one hand on it. The door clung to its hinges, but only barely.\n “No no no,” I said, perhaps too nervously.\n “Okay,” she said. “I’ll call school on my way to work. You let me know if you need anything. Anything. Or if you want me to come home. And you can always call Dad. And I’ll check up on you this afternoon, okay?”\n I nodded, and then pulled the covers back up to my chin. Even though the bucket had been cleaned, I could smell the puke underneath the detergent, and the smell of it reminded me of the act of puking, which for some reason made me want to puke again, but I just took slow, even mouth breaths until I heard the Chrysler backing down the driveway. It was 7:32. For once, I thought, I would be on time. Not to school, admittedly. But still.\n I showered and brushed my teeth and put on dark jeans and a plain black T-shirt. I put Margo’s scrap of newspaper in my pocket. I hammered the pins back into their hinges, and then packed. I didn’t really know what to throw into my backpack, but I included the doorjamb-opening screwdriver, a printout of the satellite map, directions, a bottle of water, and in case she was there, the Whitman. I wanted to ask her about it.\n Ben and Radar showed up at eight on the dot. I got in the backseat. They were shouting along to a song by the Mountain Goats.\n Ben turned around and offered me his fist. I punched it softly, even though I hated that greeting. “Q!” he shouted over the music. “How good does this feel?”\n And I knew exactly what Ben meant: he meant listening to the Mountain Goats with your friends in a car that runs on a Wednesday morning in May on the way to Margo and whatever Margotastic prize came with finding her. “It beats calculus,” I answered. The music was too loud for us to talk. Once we got out of Jefferson Park, we rolled down the one window that worked so the world would know we had good taste in music.\n We drove all the way out Colonial Drive, past the movie theaters and the bookstores that I had been driving to and past my whole life. But this drive was different and better because it occurred during calculus, because it occurred with Ben and Radar, because it occurred on our way to where I believed I would find her. And finally, after twenty miles, Orlando gave way to the last remaining orange tree groves and undeveloped ranches—the endlessly flat land grown over thick with brush, the Spanish moss hanging off the branches of oak trees, still in the windless heat. This was the Florida where I used to spend mosquito-bitten, armadillo-chasing nights as a Boy Scout. The road was dominated now by pickup trucks, and every mile or so you could see a subdivision off the highway—little streets winding for no reason around houses that rose up out of nothing like a volcano of vinyl siding.\n Farther out we passed a rotting wooden sign that said GROVE-POINT ACRES. A cracked blacktop road lasted only a couple hundred feet before dead-ending into an expanse of gray dirt, signaling that Grovepoint Acres was what my mom called a pseudovision—a subdivision abandoned before it could be completed. Pseudovisions had been pointed out to me a couple times before on drives with my parents, but I’d never seen one so desolate.\n We were about five miles past Grovepoint Acres when Radar turned down the music and said, “Should be in about a mile.”\n I took a long breath. The excitement of being somewhere other than school had started to wane. This didn’t seem like a place where Margo would hide, or even visit. It was a far cry from New York City. This was the Florida you fly over, wondering why people ever thought to inhabit this peninsula. I stared at the empty asphalt, the heat distorting my vision. Ahead, I saw a strip mall wavering in the bright distance.\n “Is that it?” I asked, leaning forward and pointing.\n “Must be,” Radar said.\n Ben pushed the power button on the stereo, and we all got very quiet as Ben pulled into a parking lot long since reclaimed by the gray sandy dirt. There had once been a sign for these four storefronts. A rusted pole stood about eight feet high by the side of the road. But the sign was long gone, snapped off by a hurricane or an accumulation of decay. The stores themselves had fared little better: it was a single-story building with a flat roof, and bare cinder block was visible in places. Strips of cracked paint wrinkled away from the walls, like insects clinging to a nest. Water stains formed brown abstract paintings between the store windows. The windows were boarded up with warped sheets of particleboard. I was struck by an awful thought, the kind that cannot be taken back once it escapes into the open air of consciousness: it seemed to me that this was not a place you go to live. It was a place you go to die.\n As soon as the car stopped, my nose and mouth were flooded with the rancid smell of death. I had to swallow back a rush of puke that rose up into the raw soreness in the back of my throat. Only now, after all this lost time, did I realize how terribly I had misunderstood both her game and the prize for winning it.\n I get out of the car and Ben is standing next to me, and Radar next to him. And I know all at once that this isn’t funny, that this hasn’t been prove-to-me-you’re-good-enough-to-hang-out-with-me. I can hear Margo that night as we drove around Orlando. I can hear her saying to me, “I don’t want some kids to find me swarmed with flies on a Saturday morning in Jefferson Park.” Not wanting to be found by some kids in Jefferson Park isn’t the same thing as not wanting to die.\n There is no evidence that anyone has been here in a long time except for the smell, that sickly sour stench designed to keep the living from the dead. I tell myself she can’t smell like that, but of course she can. We all can. I hold my forearm up to my nose so I can smell sweat and skin and anything but death.\n “MARGO?” Radar calls. A mockingbird perched on the rusted gutter of the building spits out two syllables in response. “MARGO!” he shouts again. Nothing. He digs a parabola into the sand with his foot and sighs. “Shit.”\n Standing before this building, I learn something about fear. I learn that it is not the idle fantasies of someone who maybe wants something important to happen to him, even if the important thing is horrible. It is not the disgust of seeing a dead stranger, and not the breathlessness of hearing a shotgun pumped outside of Becca Arrington’s house. This cannot be addressed by breathing exercises. This fear bears no analogy to any fear I knew before. This is the basest of all possible emotions, the feeling that was with us before we existed, before this building existed, before the earth existed. This is the fear that made fish crawl out onto dry land and evolve lungs, the fear that teaches us to run, the fear that makes us bury our dead.\n The smell leaves me seized by desperate panic—panic not like my lungs are out of air, but like the atmosphere itself is out of air. I think maybe the reason I have spent most of my life being afraid is that I have been trying to prepare myself, to train my body for the real fear when it comes. But I am not prepared.\n “Bro, we should leave,” Ben says. “We should call the cops or something.” We have not looked at each other yet. We are all still looking at this building, this long-abandoned building that cannot possibly hold anything but corpses.\n “No,” Radar says. “No no no no no. We call if there’s something to call about. She left the address for Q. Not for the cops. We have to find a way in there.”\n “In there?” Ben says dubiously.\n I clap Ben on the back, and for the first time all day, the three of us are looking not forward but at one another. That makes it bearable. Something about seeing them makes me feel as if she is not dead until we find her. “Yeah, in there,” I say.\n I don’t know who she is anymore, or who she was, but I need to find her.\n 18.\n We walk around the back of the building and find four locked steel doors and nothing but ranch land, patches of palmettos dotting an expanse of gold-green grass. The stench is worse here, and I feel afraid to keep walking. Ben and Radar are just behind me, to my right and left. We form a triangle together, walking slowly, our eyes scanning the area.\n “It’s a raccoon!” Ben shouts. “Oh, thank God. It’s a raccoon. Jesus.” Radar and I walk away from the building to join him near a shallow drainage ditch. A huge, bloated raccoon with matted hair lies dead, no visible trauma, its fur falling off, one of its ribs exposed. Radar turns away and heaves, but nothing comes out. I lean down next to him and put my arm between his shoulder blades, and when he gets his breath back, he says, “I am so fucking glad to see that dead fucking raccoon.”\n But even so, I cannot picture her here alive. It occurs to me that the Whitman could be a suicide note. I think about things she highlighted: “To die is different from what any one supposed, and luckier.” “I bequeath myself to the dirt to grow from the grass I love, / If you want me again look for me under your bootsoles.” For a moment, I feel a flash of hope when I think about the last line of the poem: “I stop some where waiting for you.” But then I think that the I does not need to be a person. The I can also be a body.\n Radar has walked away from the raccoon and is tugging on the handle of one of the four locked steel doors. I feel like praying for the dead—saying Kaddish for this raccoon—but I don’t even know how. I’m so sorry for him, and so sorry for how happy I am to see him like this.\n “It’s giving a little,” Radar shouts to us. “Come help.”\n Ben and I both put our arms around Radar’s waist and pull back. He puts his foot up against the wall to give himself extra leverage as he pulls, and then all at once they collapse onto me, Radar’s sweat-soaked T-shirt pressed up against my face. For a moment, I’m excited, thinking we’re in. But then I see Radar holding the door handle. I scramble up and look at the door. Still locked.\n “Piece of shit forty-year-old goddamned doorknob,” Radar says. I’ve never heard him talk like this before.\n “It’s okay,” I say. “There’s a way. There has to be.”\n We walk all the way around to the front of the building. No doors, no holes, no visible tunnels. But I need in. Ben and Radar try to peel the slabs of particleboard from the windows, but they’re all nailed shut. Radar kicks at the board, but it doesn’t give. Ben turns back to me. “There’s no glass behind one of these boards,” he says, and then he starts jogging away from the building, his sneakers splashing sand as he goes.\n I give him a confused look. “I’m going to bust through the particleboard,” he explains.\n “You can’t do that.” He is the smallest of our light trio. If anyone tries to smash through the boarded-up windows, it should be me.\n He balls his hands into fists and then extends his fingers out. As I walk toward him, he starts talking to me. “When my mom was trying to keep me from getting beat up in third grade, she put me in tae kwon do. I only went to like three classes, and I only learned one thing, but the thing comes in handy sometimes: we watched this tae kwon do master punch through a thick wooden block, and we were all like, dude, how did he do that, and he told us that if you move as though your hand will go through the block, and if you believe that your hand will go through the block, then it will.”\n I’m about to refute this idiotic logic when he takes off, running past me in a blur. His acceleration continues as he approaches the board, and then utterly without fear, he leaps up at the last possible second, twists his body sideways—his shoulder out to bear the brunt of the force—and slams into the wood. I half-expect him to burst through and leave a Ben-shaped cutout, like a cartoon. Instead, he bounces off the board and falls onto his ass in a patch of bright grass amid the sea of sandy dirt. Ben rolls onto his side, rubbing his shoulder. “It broke,” he announces.\n I assume he means his shoulder as I race toward him, but then he stands up, and I’m looking at a Ben-high crack in the particle-board. I start kicking at it, and the crack spreads horizontally, and then Radar and I get our fingers inside the crack and start tugging. I squint to keep the sweat from burning my eyes, and pull with all my force back and forth until the crack starts to make a jagged opening. Radar and I urge it on with silent work, until eventually he has to take a break and Ben replaces him. Finally we are able to punch a big chunk of the board into the minimall. I climb in feetfirst, landing blindly onto what feels like a stack of papers.\n The hole we’ve carved into this building gives a little light, but I can’t even make out the dimensions of the room, or whether there is a ceiling. The air in here is so stale and hot that inhaling and exhaling feel identical.\n I turn around and my chin hits Ben’s forehead. I find myself whispering, even though there’s no reason to. “Do you have a—”\n “No,” he whispers back before I can finish. “Radar, did you bring a flashlight?”\n I hear Radar coming through the hole. “I have one on my key chain. It’s not much, though.”\n The light comes on, and I still can’t see very well, but I can tell we’ve stepped into a big room filled with a labyrinth of metal shelves. The papers on the floor are pages from an old day-by-day calendar, the days scattered through the room, all of them yellowing and mouse-bit. I wonder if this might once have been a little bookstore, although it’s been decades since these shelves held anything but dust.\n We fall into line behind Radar. I hear something creak above us, and we all stop moving. I try to swallow the panic. I can hear each of Radar’s and Ben’s breaths, their shuffling footsteps. I want out of here, but that could be Margo creaking for all I know. It could also be crack addicts.\n “Just the building settling,” Radar whispers, but he seems less sure than usual. I stand there unable to move. After a moment, I hear Ben’s voice. “The last time I was this scared, I peed myself.”\n “The last time I was this scared,” Radar says, “I actually had to face a Dark Lord in order to make the world safe for wizards.” \n","sourceLink":"https://allnovel.net/paper-towns/page-15.html","bookId":2377,"book":{"id":2377,"title":"Paper Towns","description":"Storyline: \n Quentin Jacobsen has spent a lifetime loving the magnificently adventurous Margo Roth Spiegelman from afar. So when she cracks open a window and climbs back into his life — dressed like a ninja and summoning him for an ingenious campaign of revenge — he follows. \n After their all-nighter ends and a new day breaks, Q arrives at school to discover that Margo, always an enigma, has now become a mystery. But Q soon learns that there are clues — and they’re for him. Urged down a disconnected path, the closer he gets, the less Q sees of the girl he thought he knew.\n \n","cover":"https://allnovel.net/images/paper-towns.jpg","author":"John Green","type":"Mystery","source":"allnovel","link":"https://allnovel.net/paper-towns.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:17:35 AM"}}
