{"id":70778,"no":28,"title":"Page 28","content":"This first bench seat is the first bedroom. It’s the less desirable bedroom, because it is close to the kitchen and the living room, where people are awake and talking, and sometimes there is music on the radio.\n Behind that is the second bedroom, which is darker and quieter and altogether superior to the first bedroom.\n And behind that is the refrigerator, or cooler, which currently contains the 210 beers that Ben has not yet peed into, the turkey-that-looks-like-ham sandwiches, and some Coke.\n There is much to recommend this house. It is carpeted throughout. It has central air-conditioning and heating. The whole place is wired for surround sound. Admittedly, it contains only fifty-five square feet of living space. But you can’t beat the open floor plan.\n Hour Eight\n Just after we pass into South Carolina, I catch Radar yawning and insist upon a driver switch. I like driving, anyway—this vehicle may be a minivan, but it’s my minivan. Radar scoots out of his seat and into the first bedroom, while I grab the steering wheel and hold it steady, quickly stepping over the kitchen and into the driver’s seat.\n Traveling, I am finding, teaches you a lot of things about yourself. For instance, I never thought myself to be the kind of person who pees into a mostly empty bottle of Bluefin energy drink while driving through South Carolina at seventy-seven miles per hour—but in fact I am that kind of person. Also, I never previously knew that if you mix a lot of pee with a little Bluefin energy drink, the result is this amazing incandescent turquoise color. It looks so pretty that I want to put the cap on the bottle and leave it in the cup holder so Lacey and Ben can see it when they wake up.\n But Radar feels differently. “If you don’t throw that shit out the window right now, I’m ending our eleven-year friendship,” he says.\n “It’s not shit,” I say. “It’s pee.”\n “Out,” he says. And so I litter. In the side-view mirror, I can see the bottle hit the asphalt and burst open like a water balloon. Radar sees it, too.\n “Oh, my God,” Radar says. “I hope that’s like one of those traumatic events that is so damaging to my psyche that I just forget it ever happened.”\n Hour Nine\n I never previously knew that it is possible to become tired of eating GoFast nutrition bars. But it is possible. I’m only two bites into my fourth of the day when my stomach turns. I pull open the center console and stick it back inside. We refer to this part of the kitchen as the pantry.\n “I wish we had some apples,” Radar said. “God, wouldn’t an apple taste good right now?”\n I sigh. Stupid fourth food group. Also, even though I stopped drinking Bluefin a few hours ago, I still feel exceedingly twitchy.\n “I still feel kinda twitchy,” I say.\n “Yeah,” Radar says. “I can’t stop tapping my fingers.” I look down. He is drumming his fingers silently against his knees. “I mean,” he says, “I actually cannot stop.”\n “Okay, yeah I’m not tired, so we’ll stay up till four and then we’ll get them up and we’ll sleep till eight.”\n “Okay,” he says. There is a pause. The road has emptied out now; there is only me and the semitrucks, and I feel like my brain is processing information at eleven thousand times its usual pace, and it occurs to me that what I’m doing is very easy, that driving on the interstate is the easiest and most pleasant thing in the world: all I have to do is stay in between the lines and make sure that no one is too close to me and I am not too close to anyone and keep leaving. Maybe it felt like this for her, too, but I could never feel like this alone.\n Radar breaks the silence. “Well, if we’re not going to sleep until four . . .”\n I finish his sentence. “Yeah, then we should probably just open another bottle of Bluefin.”\n And so we do.\n Hour Ten\n It is time for our second stop. It is 12:13 in the morning. My fingers do not feel like they are made of fingers; they feel like they are made of motion. I am tickling the steering wheel as I drive.\n After Radar finds the nearest BP on his handheld, we decide to wake up Lacey and Ben.\n I say, “Hey, guys, we’re about to stop.” No reaction.\n Radar turns around and puts a hand on Lacey’s shoulder.\n “Lace, time to get up.” Nothing.\n I turn on the radio. I find an oldies station. It’s the Beatles. The song is “Good Morning.” I turn it up some. No response. So Radar turns it up more. And then more. And then the chorus comes, and he starts singing along. And then I start singing along. I think it is finally my atonal screeching that awakes them.\n “MAKE IT STOP!” Ben shouts. We turn down the music.\n “Ben, we’re stopping. Do you have to pee?”\n He pauses, and there’s a kerfuffle in the darkness back there, and I wonder if he has some physical strategy for checking the fullness of his bladder. “I think I’m okay, actually,” he says.\n “Okay, then you’re on gas.”\n “As the only boy who has not yet peed inside this car, I call first bathroom,” says Radar.\n “Shhh,” mumbles Lacey. “Shhh. Everybody stop talking.”\n “Lacey, you have to get up and pee,” Radar says. “We’re stopping.”\n “You can buy apples,” I tell her.\n “Apples,” she mumbles happily in a cute little girl voice. “I likey the apples.”\n “And then after that you get to drive,” Radar says. “So you really gotta wake up.”\n She sits up, and in her regular Lacey voice, she says, “I don’t so much likey that.”\n We take the exit and it’s .9 miles to the BP, which doesn’t seem like much but Radar says that it’s probably going to cost us four minutes, and the South Carolina traffic hurt us, so it could be real trouble with the construction Radar says is an hour ahead of us. But I am not allowed to worry. Lacey and Ben have now shaken off their sleep well enough to line up together by the sliding door, just like last time, and when we come to a stop in front of the pump, everybody flies out, and I flip the keys to Ben, who catches them in midair.\n As Radar and I walk briskly past the white man behind the counter, Radar stops when he notices the guy is staring. “Yes,” Radar says without embarrassment. “I’m wearing a HERITAGE NOT HATE shirt over my graduation gown,” he says. “By the way, do you sell pants here?”\n The guy looks nonplussed. “We got some camo pants over by the motor oil.”\n “Excellent,” Radar says. And then he turns to me and says, “Be a dear and pick me out some camo pants. And maybe a better T-shirt?”\n “Done and done,” I answer. Camo pants, it turns out, do not come in regular numbered sizes. They come in medium and large. I grab a pair of medium pants, and then a large pink T-shirt that reads WORLD’S BEST GRANDMA. I also grab three bottles of Bluefin.\n I hand everything to Lacey when she comes out of the bathroom and then walk into the girls’ room, since Radar is still in the guys’. I don’t know that I’ve ever been inside a girls’ bathroom in a gas station before.\n Differences:\n No condom machine\n Less graffiti\n No urinal\n The smell is more or less the same, which is rather disappointing.\n When I come out, Lacey is paying and Ben is honking the horn, and after a moment of confusion, I jog toward the car.\n “We lost a minute,” Ben says from the passenger seat. Lacey is turning onto the road that will take us back to the interstate.\n “Sorry,” Radar answers from the back, where he is sitting next to me, wiggling into his new camo pants beneath his robe. “On the upside, I got pants. And a new T-shirt. Where’s the shirt, Q?” Lacey hands it to him. “Very funny.” He pulls off the robe and replaces it with the grandma shirt while Ben complains that no one got him any pants. His ass itches, he says. And on second thought, he kind of does need to pee.\n Hour Eleven\n We hit the construction. The highway narrows to one lane, and we’re stuck behind a tractor-trailer driving the precise roadwork speed limit of thirty-five mph. Lacey is the right driver for the situation; I’d be pounding the steering wheel, but she’s just amiably chatting with Ben until she turns half around and says, “Q, I really need to go to the bathroom, and we’re losing time behind this truck anyway.”\n I just nod. I can’t blame her. I would have forced us to stop long ago had it been impossible for me to pee in a bottle. It was heroic of her to make it as long as she did.\n She pulls into an all-night gas station, and I get out to stretch my rubbery legs. When Lacey comes racing back to the minivan, I’m sitting in the driver’s seat. I don’t even really know how I came to be sitting in the driver’s seat, why I end up there and not Lacey. She comes around to the front door, and she sees me there, and the window is open, and I say to her, “I can drive.” It’s my car, after all, and my mission. And she says, “Really, you’re sure?” and I say, “Yeah, yeah, I’m good to go,” and she just throws open the sliding door and lies down in the first row.\n Hour Twelve\n It is 2:40 in the morning. Lacey is sleeping. Radar is sleeping. I drive. The road is deserted. Even most of the truck drivers have gone to bed. We go minutes without seeing headlights coming in the opposite direction. Ben keeps me awake, chattering next to me. We are talking about Margo.\n “Have you given any thought to how we will actually, like, find Agloe?” he asks me.\n “Uh, I have an approximate idea of the intersection,” I say.\n “And it’s nothing but an intersection.”\n “And she’s just gonna be sitting at the corner on the trunk of her car, chin in her hands, waiting for you?”\n “That would certainly be helpful,” I answered.\n “Bro, I gotta say I’m a little worried that you might, like—if it doesn’t go as you’re planning it—you might be really disappointed.”\n “I just want to find her,” I say, because I do. I want her to be safe, alive, found. The string played out. The rest is secondary.\n “Yeah, but— I don’t know,” Ben says. I can feel him looking over at me, being Serious Ben. “Just— Just remember that sometimes, the way you think about a person isn’t the way they actually are. Like, I always thought Lacey was so hot and so awesome and so cool, but now when it actually comes to being with her . . . it’s not the exact same. People are different when you can smell them and see them up close, you know?”\n “I know that,” I say. I know how long, and how badly, I wrongly imagined her.\n “I’m just saying that it was easy for me to like Lacey before. It’s easy to like someone from a distance. But when she stopped being this amazing unattainable thing or whatever, and started being, like, just a regular girl with a weird relationship with food and frequent crankiness who’s kinda bossy—then I had to basically start liking a whole different person.”\n I can feel my cheeks warming. “You’re saying I don’t really like Margo? After all this—I’m twelve hours inside this car already and you don’t think I care about her because I don’t— ” I cut myself off. “You think that since you have a girlfriend you can stand atop the lofty mountain and lecture me? You can be such a—”\n I stop talking because I see in the outer reaches of the headlights the thing that will shortly kill me.\n Two cows stand oblivious in the highway. They come into view all at once, a spotted cow in the left lane, and in our lane an immense creature, the entire width of our car, standing stock-still, her head turned back as she appraises us with blank eyes. The cow is flawlessly white, a great white wall of cow that cannot be climbed or ducked or dodged. It can only be hit. I know that Ben sees it, too, because I hear his breath stop.\n They say that your life flashes before your eyes, but for me that is not the case. Nothing flashes before my eyes except this impossibly vast expanse of snowy fur, now only a second from us. I don’t know what to do. No, that’s not the problem. The problem is that there is nothing to do, except to hit this white wall and kill it and us, both. I slam on the brakes, but out of habit not expectation: there is absolutely no avoiding this. I raise my hands off the steering wheel. I do not know why I am doing this, but I raise my hands up, as if I am surrendering. I’m thinking the most banal thing in the world: I am thinking that I don’t want this to happen. I don’t want to die. I don’t want my friends to die. And to be honest, as the time slows down and my hands are in the air, I am afforded the chance to think one more thought, and I think about her. I blame her for this ridiculous, fatal chase—for putting us at risk, for making me into the kind of jackass who would stay up all night and drive too fast. I would not be dying were it not for her. I would have stayed home, as I have always stayed home, and I would have been safe, and I would have done the one thing I have always wanted to do, which is to grow up.\n Having surrendered control of the vessel, I am surprised to see a hand on the steering wheel. We are turning before I realize why we are turning, and then I realize that Ben is pulling the wheel toward him, turning us in a hopeless attempt to miss the cow, and then we are on the shoulder and then on the grass. I can hear the tires spinning as Ben turns the wheel hard and fast in the opposite direction. I stop watching. I don’t know if my eyes close or if they just cease to see. My stomach and my lungs meet in the middle and crush each other. Something sharp hits my cheek. We stop.\n I don’t know why, but I touch my face. I pull my hand back and there is a streak of blood. I touch my arms with my hands, hugging my arms to myself, but I am only checking to make sure that they are there, and they are. I look at my legs. They are there. There is some glass. I look around. Bottles are broken. Ben is looking at me. Ben is touching his face. He looks okay. He holds himself as I held myself. His body still works. He is just looking at me. In the rearview mirror, I can see the cow. And now, belatedly, Ben screams. He is staring at me and screaming, his mouth all the way open, the scream low and guttural and terrified. He stops screaming. Something is wrong with me. I feel faint. My chest is burning. And then I gulp air. I had forgotten to breathe. I had been holding my breath the whole time. I feel much better when I start up again. In through the nose, out through the mouth. \n","sourceLink":"https://allnovel.net/paper-towns/page-28.html","bookId":2377,"book":{"id":2377,"title":"Paper Towns","description":"Storyline: \n Quentin Jacobsen has spent a lifetime loving the magnificently adventurous Margo Roth Spiegelman from afar. So when she cracks open a window and climbs back into his life — dressed like a ninja and summoning him for an ingenious campaign of revenge — he follows. \n After their all-nighter ends and a new day breaks, Q arrives at school to discover that Margo, always an enigma, has now become a mystery. But Q soon learns that there are clues — and they’re for him. Urged down a disconnected path, the closer he gets, the less Q sees of the girl he thought he knew.\n \n","cover":"https://allnovel.net/images/paper-towns.jpg","author":"John Green","type":"Mystery","source":"allnovel","link":"https://allnovel.net/paper-towns.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:17:35 AM"}}
