{"id":70783,"no":33,"title":"Page 33","content":"She raises her fingers to her lips, as if concentrating, or as if hiding her mouth from me, or as if to feel the words she speaks. “You’re pretty something,” she says finally. She stares at me, my eyes and her eyes and nothing between them. I have nothing to gain from kissing her. But I am no longer looking to gain anything. “There’s something I have to do,” I say, and she nods very slightly, as if she knows the something, and I kiss her.\n It ends quite a while later when she says, “You can come to New York. It will be fun. It will be like kissing.”\n And I say, “Kissing is pretty something.”\n And she says, “You’re saying no.”\n And I say, “Margo, I have a whole life there, and I’m not you, and I—” But I can’t say anything because she kisses me again, and it’s in the moment that she kisses me that I know without question that we’re headed in different directions. She stands up and walks over to where we were sleeping, to her backpack. She pulls out the moleskin notebook, walks back to the grave, and places it in the ground.\n “I’ll miss you,” she whispers, and I don’t know if she’s talking to me or to the notebook. Nor do I know to whom I’m talking when I say, “As will I.”\n “Godspeed, Robert Joyner,” I say, and drop a handful of dirt onto the notebook.\n “Godspeed, young and heroic Quentin Jacobsen,” she says, tossing in dirt of her own.\n Another handful as I say, “Godspeed, fearless Orlandoan Margo Roth Spiegelman.”\n And another as she says, “Godspeed, magical puppy Myrna Mountweazel.” We shove the dirt over the book, tamping down the disturbed soil. The grass will grow back soon enough. It will be for us the beautiful uncut hair of graves.\n We hold hands rough with dirt as we walk back to the Agloe General Store. I help Margo carry her belongings—an armful of clothes, her toiletries, and the desk chair—to her car. The preciousness of the moment, which should make it easier to talk, makes it harder.\n We’re standing outside in the parking lot of a single-story motel when the good-byes become unavoidable. “I’m gonna get a cell, and I’ll call you,” she says. “And email. And post mysterious statements on Omnictionary’s Paper Towns talk page.”\n I smile. “I’ll email you when we get home,” I say, “and I expect a response.”\n “You have my word. And I’ll see you. We’re not done seeing each other.”\n “At the end of the summer, maybe, I can meet you somewhere before school,” I say.\n “Yeah,” she says. “Yeah, that’s a good idea.” I smile and nod. She turns away, and I am wondering if she means any of it when I see her shoulders collapse. She is crying.\n “I’ll see you then. And I’ll write in the meantime,” I say.\n “Yes,” she says without turning around, her voice thick. “I’ll write you, too.”\n It is saying these things that keeps us from falling apart. And maybe by imagining these futures we can make them real, and maybe not, but either way we must imagine them. The light rushes out and floods in.\n I stand in this parking lot, realizing that I’ve never been this far from home, and here is this girl I love and cannot follow. I hope this is the hero’s errand, because not following her is the hardest thing I’ve ever done.\n I keep thinking she will get into the car, but she doesn’t, and she finally turns around to me and I see her soaked eyes. The physical space between us evaporates. We play the broken strings of our instruments one last time.\n I feel her hands on my back. And it is dark as I kiss her, but I have my eyes open and so does Margo. She is close enough to me that I can see her, because even now there is the outward sign of the invisible light, even at night in this parking lot on the outskirts of Agloe. After we kiss, our foreheads touch as we stare at each other. Yes, I can see her almost perfectly in this cracked darkness. \n","sourceLink":"https://allnovel.net/paper-towns/page-33.html","bookId":2377,"book":{"id":2377,"title":"Paper Towns","description":"Storyline: \n Quentin Jacobsen has spent a lifetime loving the magnificently adventurous Margo Roth Spiegelman from afar. So when she cracks open a window and climbs back into his life — dressed like a ninja and summoning him for an ingenious campaign of revenge — he follows. \n After their all-nighter ends and a new day breaks, Q arrives at school to discover that Margo, always an enigma, has now become a mystery. But Q soon learns that there are clues — and they’re for him. Urged down a disconnected path, the closer he gets, the less Q sees of the girl he thought he knew.\n \n","cover":"https://allnovel.net/images/paper-towns.jpg","author":"John Green","type":"Mystery","source":"allnovel","link":"https://allnovel.net/paper-towns.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:17:35 AM"}}
