{"id":19051,"no":13,"title":"CHAPTER XI.—THE HAWK AND THE DOVE.","content":"The scene of our story changes for a time from smoky London to a lonely road close to the sea-coast of Normandy. It is the sunset of a rainy day, a fierce red light beats down on the yellow colza fields, sprinkled with great bells of crimson poppy; on the deep, wind-swept patches of yellow wheat; on the little villages embowered in foliage, each with its old-fashioned auberge and its glittering spire. \n \n An open post-chaise, drawn by a pair of heavy horses, is flying seaward, towards the marine town of Fécamp. Side by side within it sit two figures, a very young lady, wrapped in a fur-lined silk cloak, and a tall, haggard-looking man of thirty, with very long hair and a jet-black moustache. \n \n Every now and again the man leans forward and urges on the driver, then, after a quick glance on the road, which winds far away behind them, he sinks back upon his seat. \n \n They halt and change horses in a quaint little village, where old women and maidens ply their antique spinning-wheels at the cottage doors, and blue-bloused loungers puff their sous cigars on wooden forms before the auberge. They do not alight, but the gentleman brings the lady a tiny glass of the liqueur called ‘Bénédictin,’ and some wine biscuits. She sips the liqueur and breaks a biscuit, while the loungers in blue blouses look on in admiration. \n \n The young lady is very pale, and looks so young that the loungers whisper wonderingly at each other. Now and then her lip quivers, and her eyes fill with tears. The gentleman with her watches her anxiously, trying to anticipate every look and wish, but she scarcely looks at him—her thoughts are far away. \n \n ‘How far to Fécamp?’ the gentleman asks of the ostler, as he slips the pour-boire into his hand; and when he finds that it is still many kilometres away, and that it is impossible to reach it in less than three or four hours, he mutters an imprecation. \n \n There is a quick, cat-like look in his eyes, as he converses with the world at large; but when he turns to his companion the look is exchanged for one of touching humility and sweetness. \n \n They are ready to start again, the driver is in his place, when the young lady springs up and cries in French, ‘Arrêtez!’ The gentleman, who is again seated by her side, looks at her in astonishment, ‘Madeline! mon ange!’ \n \n She answers him in English. \n \n ‘It is not too late—let us turn and go back. I am sorry now I came away. Monsieur Belleisle, I insist on turning back.’ \n \n ‘Mais non!’ \n \n ‘Madame Collemache will forgive me—I will go upon my knees and ask her—Madame is a good woman. Oh, why did you ask me to do anything so foolish? Look how these people are staring! Turn back at once!’ \n \n But, at a sign from the gentleman, the driver has started off, and they are soon leaving the village at full gallop. To comfort her, Monsieur slips his hand round her waist. He is not prepared for the result, which came in the shape of a sharp slap in the face from the little gloved hand. \n \n ‘How dare you? I will not be pulled about, and I will go back to Madame. If you are a gentleman you will take me back at once.’ \n \n Monsieur rubs his cheek and tries to smile, but there is an angry light in his eyes nevertheless. \n \n ‘You are cruel, and I—ah, how I love you! Have you not promised to be my little wife? Mine own Madeline!’ \n \n He is about to embrace her again, but the look in her face deters him. \n \n ‘I was angry with Madame because I thought her cruel and unjust. She made me mad, and so I listened to you. Drive me back, Monsieur, and I will like you very much. I will take all the blame upon myself—only drive me back.’ \n \n ‘Do not speak so,’ is the reply. ‘We love each other—we will be happy—ah, so happy—-with one another. Madeline! my bride!’ \n \n ‘I have changed my mind. I will not marry you, Monsieur Belleisle!’ \n \n ‘Ah ciel, you do not mean what you say!’ \n \n ‘I do mean it. Why should I marry you? I do not like you. I shall hate you soon.’ \n \n ‘It is too late to say that.’ \n \n ‘But it is true.’ \n \n ‘Ah, I will not beliefe it! You are triste—the journey make you triste and fatiguée—to-morrow you will smile again upon your own Auguste.’ \n \n ‘Pray don’t talk nonsense,’ answered the young lady. ‘I liked you very well when you gave me my lessons, and last night in my anger, in my wickedness, I thought I would come with you, because I wished to be revenged on Madame and Mademoiselle Blanche. But now I have repented, Monsieur. I was a little fool, and I will beg their pardon. They have been very kind to me. I was ungrateful. I will return.’ \n \n All this in an impetuous stream, half soliloquy, half entreaty. In her passion and excitement the girl looks very lovely, and the Frenchman gazes at her in growing admiration. Then a thought seems to strike him, and he looks at her slyly and smiles. \n \n ‘Why are you laughing, Monsieur?’ she cries. \n \n ‘I was thinking, mignonne, how ridiculous you would look if you returned. Ah, Dieu, how they would laugh!’ This is a move in the right direction. The young lady cannot bear ridicule, and she frowns at the very thought of it. For some minutes she seems plunged in bitter reflection; then she speaks again. \n \n ‘No, I am not afraid,’ she cries; ‘I do not fear any but Madame, and when I have apologised she will take my part. Oh, why did I come with you? why did I think of running away?’ \n \n ‘Because you love me, mon ange!’ \n \n ‘Love you, Monsieur Belleisle? I like you better than Herr Bunsen, because he is always cross and stupid and you are good-tempered. And I thought you handsome. Well, I did not know my mind. I will not marry you—the thought is ridiculous. You are thirty years old, and I do not like Frenchmen.’ \n \n Despite her protestations, the post-chaise still continues its wild career. It is dark at last, and the darkness is deepened by long avenues of spectral fir-trees which line the road on either side. A diligence passes swiftly by, with murmur of voices and jingling of bells. \n \n As night comes on the girl grows frightened, shrinks away from her companion, and sobs bitterly. He tries to comfort her with embraces and loving words, but she avoids his touch, and rejects all his consolations. \n \n If there were enough light to show his face, it would reveal an aspect almost Mephistophelean in its cat-like expression. His long fingers close and unclose nervously; he would like to use force, but he lacks the courage. \n \n At last he wins her to comparative quiescence by proving to her that return is impossible before the morrow, and by promising that when the morrow comes he will, if she still wishes it, see her safely back to school. With this poor comfort she is obliged to be content; for the house she left at daybreak lies thirty miles behind, and it would be useless to turn thither now. \n \n Presently the lights of a town gleam before them, and, after rattling through some dark suburbs, they draw up before the threshold of an inn—the Lion d’Or. It is a large dreary place, with little or no custom. A ghostly waiter shows them to a great salle à manger, which is totally deserted. \n \n ‘While dinner is preparing, perhaps Madame would like to make her toilette?’ \n \n He lays emphasis on the ‘Madame’; and then demands, respectfully, how many chambers will be required. \n \n Madeline does not hear, but her companion explains that two chambers will be wanted—one for the young lady, one for himself. The waiter bows and withdraws. An elderly chambermaid soon appears, and shows Madeline up to a great bedroom, grim and lonely as an empty barn, with one little chilly bed in the corner. There are no curtains to the window, and the moonlight is creeping in with a ghastly gleam. \n \n Left alone, Madeline resigns herself to remorse and despair, and sobs as if her heart would break. An hour passes thus. Then the chambermaid appears with the intimation that Monsieur is waiting dinner, and is impatient. After a moment’s hesitation Madeline descends. \n \n They are alone in the salle à manger, and the first course is served, when there enters a muscular young man in a shooting coat, a shirt very loose about the collar, and a loose necktie. ‘Englishman’ is written in every lineament of his brown, sun-tanned countenance. In the manner of many of his nation, he scowls at his fellow-guests, and then, without a word, falls upon the soup. \n \n Dish after dish goes from Madeline untasted. She breaks a little bread, that is all, and drinks a little Bordeaux and water. Her face is white as death, and all the tremendousness of the situation is full upon her. \n \n Monsieur Belleisle, for his part, feeds ravenously, and drinks more than one bottle of light wine. He is agitated, but preserves his composure. In his heart he curses the unwelcome third party present; he burns for a tête-à-tête. \n \n Third party proceeds leisurely with his dinner, only addressing the waiter in monosyllables. He is a man of thirty, of splendid physique and perfect health. He seems to see and hear nothing, but all the time his eyes and ears are wide open. He starts when the young lady—whom he has been watching quietly—speaks in the English tongue. \n \n ‘The chambermaid says there is a train from this place to Rouen. It leaves at daybreak, Monsieur Belleisle.’ \n \n ‘We will talk of that to-morrow,’ murmurs the Frenchman, with his mouth full. \n \n ‘That will be too late. I will leave by the first train, and get a cab from Rouen to Millefleurs. I will explain all—they may punish me as they please—I do not care.’ \n \n ‘Diable, and what will then become of me?’ \n \n ‘I don’t know—I suppose you will lose your situation, but you will soon get another.’ \n \n Monsieur sinks his voice and whispers— \n \n ‘Another wife, mignonne? Ah non! If you abandon me I shall blow out my brains;’ then, still in a low voice, inaudible to the other person in the room, he continues, ‘But you are mad, my Madeline, to think of going back. \n \n Hélas, it is too late; you must marry me now, or do you know what they will say? They will say that your character is gone, that you are méchante, and then no one will marry you to be put to shame. Yes, it is too late. You should have thought of this before to-morrow. You must become Madame my wife, or you will not be able to face the world.’ \n \n If the speaker were an individual of any insight, or the least sensitiveness, he would get uncomfortable under the calm unconscious wonder of the eyes which regard him. His threat, for his words amount to a threat, is completely vain. The girl looks at him quietly, and for some minutes makes no reply whatever. \n \n Encouraged by this silence, he pours out a low stream of endearing epithets, cursing all the time the third party whose presence compels him to sink his voice to a whisper. \n \n At that juncture, however, the third party rises, and walks quietly from the room. Monsieur Belleisle jumps up, closes the door, and turns to Madeline with extended aims, repeating in a louder voice his volley of endearments. \n \n ‘Do not talk nonsense, Monsieur,’ is the girl’s reply. ‘I am not an angel; I am more like a devil, Mademoiselle Collemache has often said. Do not come near me—I will not be embraced. I tell you I will not marry you. Even if I liked you well enough, and I don’t, it would be too absurd.’ \n \n ‘Absurd!’ echoed the Frenchman, with indignation. \n \n ‘Yes. I am a great deal too young. It was wicked of you, Monsieur, to tempt me—to come upon me when I was in a passion, and persuade me to elope.’ \n \n ‘But I love you—ah Dieu, how much!’ \n \n ‘Don’t speak of it, Monsieur. Let me go back to Madame in peace, and implore her forgiveness—I will do so—on my knees if she wishes it. I deserve whipping—no punishment is too bad for me—I am so wicked.’ \n \n ‘Madeline,’ says the Frenchman, yielding at last to the growing fury within him, ‘let us finish this folly. I will not lose you so—no, a hundred times no. I tell you there is no escape—you will marry me to-morrow; you will, you must. If you do not, if you refuse, take care.’ And his eyes roll with a look of significance, which she does not understand. \n \n ‘Take care of what, Monsieur?’ \n \n ‘Of the world—of me. Voilà! If you do not marry me, you will never marry another man! You do not know me—I am desperate. I will follow you up and down the world—I will say such things, ah, Dieu, what will I not say?—until at last you go upon your bended knees and beg me to make you my wife.’ \n \n As he speaks his face is livid with fury, and he seems positively transformed. The girl looks at him in supreme astonishment and growing dislike; then she gives a little forced laugh. \n \n ‘Do not lose your temper, Monsieur. One would think you were giving a French lesson to one of the little girls.’ \n \n ‘I will give you such a lesson,’ he exclaims, ‘as you will remember. I am not a common man, and I will not be so befooled—no, no! You treat all love as nothing—at my devotion you laugh—you are cruel, but I can be cruel too.—Ah, now, I do not mean that! I love you too well. You promised to marry me, and you will marry me, n’est-ce pas, my Madeline?’ \n \n He starts and tries to compose his features, for that moment the obnoxious third party re-enters the room, and, taking a chair, proceeds, with an air of great carelessness, to read a journal. \n \n After an awkward suspense of some minutes, Belleisle, in his turn, leaves the apartment, not without glancing significantly at the stranger, and expressively putting his finger to his lips to enjoin silence. \n \n Scarcely has he vanished when the third party rises, looks at Madeline, and, walking quietly over to her, says in English— \n \n ‘Pardon me, but is that gentleman your husband?’ \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1856/53775.html","bookId":834,"book":{"id":834,"title":"The Martyrdom of Madeline","description":"简介： In this story I have touched, very feebly and inadequately, on one of the greatest and saddest of human problemsas great and sad, certainly, as the problem which forms the central purpose of my Shadow of the Sword. What the creed of Peace is to the s...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1856","creation":"Aug 1, 2019 12:19:37 AM","modification":"Aug 1, 2019 12:19:37 AM"}}
