{"id":19063,"no":25,"title":"CHAPTER XXIII.—AT THE CLUB.","content":"James Forster, of the great City firm of Forster and Forster, found himself at the early age of thirty-five a rich and prosperous man, with plenty of leisure and a simple taste for imaginative literature and the fine arts. He was a widower, his wife having died ten years previously in the first year of their marriage, leaving him an only son; and his fine mansion in Cromwell Road, South Kensington, was presided over by his spinster sister Margaret, his elder by some five years. \n \n The cares of business sat lightly on this good man’s shoulders, and he could at any moment have retired with a large independence; but early habits and inclination kept him to the office, long after his daily presence there was unnecessary, and he wished to remain there until his son was old enough to take his place. His office hours, however, were very short, and when they were over he assiduously cultivated the society of painters and men of letters. Many a struggling artist had cause to bless his liberality. The walls of his house were decorated with some of the finest paintings of the period; and he loved nothing better than to add to his collection by discovering genius, and paying liberally for its works, long before the trumpet of fame had given those works a price in the market. \n \n Although himself a strict man of business, he loved Bohemian society and Bohemian ways, always holding good-humouredly that it was the prerogative of artists and authors to play pranks denied to plain men like himself. His admiration for genius was quite simple and boy-like. In certain departments of literature, particularly in that of early English poetry, he had an almost special knowledge, gained in the course of his acquisition of a fine old-fashioned library; and nothing delighted him more than to communicate informally to the ‘Megatherium’ or to ‘Notes and Queries’ occasional notes and correspondence on the pet subjects of his study. \n \n He had known White for years, and been his staunchest helper and benefactor. Poor White, the best and kindliest fellow in the world, had neither the art of making money nor the knack of keeping it when it came; so that he was generally neck deep in difficulties, and would have sunk often in the quagmire of bankruptcy had no helping hand been near. As a painter he was not a genius; yet Forster bought his pictures, very often commissioning and paying for them long before they had taken shape on the easel. So that the gentle Bohemian had been heard more than once to exclaim that, in the course of his long heavenward pilgrimage, he had encountered only one guardian angel, and that angel was James Forster. \n \n The day after the interview described in a recent chapter, White and Forster sat alone dining at a quiet table in the Junior Athen?um Club, of which the merchant was a member. \n \n ‘I am glad she has told you,’ said Forster quietly. ‘Yes, I have asked her to become my wife.’ \n \n White did not speak for some minutes, and his expression was very sad and scared. \n \n ‘I am very sorry,’ he murmured at last. ‘I can’t tell how sorry I am. I—I don’t know what to say, upon my soul. It is such an honour—such a surprise too—and you, God knows you are the best man in the world. But it can’t be. You had it from her own lips. She will never marry.’ \n \n White’s eyes were full of tears, and he gulped down a glass of wine in extreme emotion. \n \n ‘After all,’ he added eagerly, not meeting the other’s eyes, ‘she’s only a poor girl, and it wouldn’t be right for a man in your position to marry an actress.’ \n \n ‘I never loved a woman before,’ returned the merchant, ‘and I know I shall never love again. My first marriage was not altogether a happy one, and I was driven more than led into it; but, thank God, I did my duty, and I have my boy. But I’m a lonely man—you don’t know how lonely, and I thought—I thought this might have been.’ \n \n ‘I wish to God it could, I do with all my soul.’ \n \n ‘I am sure of that.’ \n \n ‘And oh, my dear Forster,’ cried White, almost sobbing, ‘don’t fancy that my dear girl doesn’t value you at your worth. She knows how good you are. She knows what a friend you have been to us all, but—but——’ \n \n ‘But she does not love me. Well, I could hardly dare to expect it.’ \n \n ‘It’s not that. I swear it’s not that. As I’m a living man I believe she worships the very ground you tread on. “Dear Guardian,” she said to me last night, “I never was so happy and proud, and yet I never was so sad. Tell him how grateful I am, how gladly I would die to serve him—but as for marriage, you know it can never be.”’ \n \n ‘Do you know that?’ asked Forster, looking keenly at his companion. \n \n White’s face was pale as death. \n \n ‘I do know it.’ \n \n ‘She will never marry?’ \n \n ‘Never.’ \n \n I think I understand,’ said Forster, with a sigh of relief. ‘She has made up her mind to devote herself to her noble profession, and she believes, perhaps wisely, that a great artist should be free of all domestic ties. But do you think I am one of those idiots, those miserable moneybags, who account the profession of an actress a degradation? She should never leave the stage, unless of her own wish and will. She should be encouraged, helped as far as a plain fellow like myself could help her—in all the aspirations of her art. I should glory in her success, and triumph in her triumph—I should indeed.’ \n \n White looked at the bright open face of Forster, and fairly wrung his hands in despair. \n \n ‘I wish it were possible,’ he groaned. ‘For her sake, even more than yours.’ \n \n Forster leant over the table, and continued in rapid, eager tones. \n \n ‘If she loves another man, tell me, and I shall be satisfied. I don’t want to know his name, but if he is poor let me make him rich. More than anything in the world, even more than my own happiness, I seek her welfare. I love her, White, and mine is not a selfish love.’ \n \n ‘You are wrong, dear friend. She loves no one else. Poor child! She has never known what love is, and she never will know it.’ \n \n Something in White’s manner at last awoke the other’s suspicion and wonder. The face of the poor fellow was so utterly forlorn, his words and gestures so extraordinary, that Forster began to share his agitation. \n \n ‘There is some mystery. Cannot I know it?’ ‘Impossible. But you are right.’ \n \n ‘Does it concern Madeline herself?’ \n \n ‘Yes.’ \n \n ‘Her friends and relations?’ \n \n ‘No.’ \n \n ‘For God’s sake, tell me—that is, if it can be told.’ \n \n White fell back in his chair, and let his hands drop heedlessly by his side, ‘It cannot be told. My poor darling! It is something in her past life.’ \n \n There he paused in despair. But Forster, himself trembling violently, touched him on the arm. \n \n ‘Her past life? What is that to me? I know nothing of it, and I seek to know nothing. If there is any page in her life she wishes me not to read, let her close the book; I will never ask her to open it. I love her too absolutely not to be content with what she is, the sweetest and purest woman I have ever known.’ \n \n ‘You think her pure? So she is, God knows.’ \n \n ‘I think she is worthy to be a queen. I think I am not worthy to tie her shoe-strings. But this does not prevent me loving her; it only makes my love something like idolatry. Don’t think that it is mere infatuation. I know my own mind well, and I shall never change.’ \n \n More followed in the same strain, but Forster did not succeed in eliciting any further explanation. \n \n So White remained the very picture of misery, and, with his eyes full of tears, wrung the merchant’s hand again and again, uttering wild professions of personal attachment. \n \n Some hours later they parted. White, with somewhat unsteady steps, for he had drunk liberally, made his way to his favourite club. Forster walked rapidly to Piccadilly, and, entering an omnibus, rode in sad reverie to South Kensington. \n \n A footman in gorgeous livery admitted the plain man into his princely home; and along a lobby hung with choice pictures, up a staircase ornamented with some of the most perfect specimens of modern sculpture, he found his way to the drawing-room, where his sister Margaret was sitting in solitary state. \n \n Margaret Forster was fresh and wholesome-looking like her brother, but her forehead was lower, her lips thinner and tighter, her whole expression colder, harder, and more respectable, and she wore much more gorgeous apparel She adored her brother and his child, with the quiet adoration of a frosty and impeccable well-dressed virgin. In matters of religion she was very High Church, a staunch follower of the Rev. Father Seraphin, of the Kensington Oratory, and there was scarcely a day in the year on which she did not hear morning and evening mass. \n \n ‘You are late, James,’ she said as he entered. ‘I suppose you have dined?’ \n \n ‘Yes, at the club. I have just time to dress for the theatre. Will you come and bring James? I have a box.’ \n \n ‘What theatre, James?’ \n \n ‘The Parthenon.’ \n \n ‘What are they playing?’ \n \n ‘Shakespeare’s “Cymbeline.”’ \n \n ‘Why, James, you have seen that performance twice already to my knowledge,’ said Margaret, lifting her eyebrows. ‘Is it so very good?’ \n \n ‘So much so that I want you to see it again, and—and I want James to see it. The new actress is charming. But there is no time to lose, and the carriage will be at the door in half an hour.’ \n \n Margaret rose, smiling, well pleased at the attention of her brother, and passed upstairs to prepare her little nephew. Left alone in the drawing-room, Forster paced up and down in a somewhat gloomy brown study, muttering again and again to himself, and pausing from time to time to gaze into one of the great mirrors; he was not, however, gazing at his own reflection, though he seemed to be doing so—he was contemplating a visionary figure far away. \n \n Later on in the evening, Forster, with his sister and his son, occupied a box in the Parthenon. They arrived late, and when they entered ‘Imogen’ was in the middle of her first parting with ‘Posthumus,’ but as she left the stage she glanced up and met Forster’s eyes. Margaret Forster saw that look, and in a moment her suspicions were awakened. For the rest of the evening she was busily engaged, not following the play, but jealously watching her brother. As she did so, her face hardened and her eyes grew cold as steel; for she had discovered his secret. \n \n The play ended, the curtain descended, and in answer to the enthusiastic applause of the audience Imogen came before the curtain. Then Margaret Forster saw the actress glance up again with a smile of recognition. \n \n They drove home and supped together in the great dining-room. Forster was generally a water-drinker, but on this occasion he ordered champagne, and pressed his sister to partake of it with him. The wise virgin, who saw that something was coming, was not to be persuaded. \n \n Presently Forster dismissed the footman in waiting; then, looking to Margaret with a bright but somewhat nervous smile he asked— \n \n ‘Well, how did you like her?’ \n \n ‘Miss Vere? I think she is rather pretty and acts intelligently.’ \n \n ‘Intelligently! She is a genius. Do take some champagne.’ \n \n Margaret shook her head. She saw that her brother was excited, and determined to keep cool. To try him, she changed the subject. \n \n ‘How pretty the Princess looked. I suppose the greyheaded gentleman with her was her father, the King of Denmark?’ \n \n ‘Yes—but Miss Vere! How beautifully she spoke those lines at the mouth of the cave!’ \n \n ‘I liked her best in the earlier portions of the play,’ returned Margaret quietly. ‘I have a prejudice against seeing women dressed up in male attire. I suppose she is a modest woman, but—by the way, James, she seemed to recognise you? Do you know her?’ \n \n ‘Yes.’ \n \n ‘You cannot have met her in society?’ \n \n ‘I was introduced to her by her guardian, White, the dramatic author. We have been acquainted for some time.’ \n \n ‘Indeed!’ said Margaret, more coldly than ever. \n \n She drew back her chair, and rose to go. ‘I am very tired. I think I will say good-night.’ ‘Don’t go yet,’ exclaimed Forster. ‘I—I want to talk to you.’ \n \n ‘Yes?’ \n \n ‘About Miss Vere.’ Then he continued, nervously and hurriedly, ‘I have not only a great respect for her, Margaret, but a stronger feeling. I should have spoken to you concerning her before, but I had certain reasons for keeping silence. Now I think you ought to know everything. I have asked her to marry me.’ \n \n Margaret Forster gazed at her brother in horror. Her face went ghastly pale, and she felt as if a sharp knife had stabbed her to the heart. \n \n ‘You cannot be serious!’ she cried. \n \n ‘Quite serious!’ \n \n ‘My dear James, you are joking with me. I will never believe you capable of such folly.’ \n \n ‘You think it is folly to marry again?’ \n \n ‘That is for you to determine, James; but whenever you marry, you will at least marry a lady.’ \n \n Forster’s face darkened. ‘He knew his sister’s strong prepossessions on certain subjects, but he hardly expected so decided an opposition, ‘Listen to me, Margaret,’ he said firmly; ‘and before we go further let me beseech you, for my sake, to refrain from saying anything offensive concerning Miss Vere. Understand me clearly. I love her—deeply, passionately; and with a man at my age, love means the highest sort of respect. She is as far my superior in every gift of nature as I, perhaps, am hers in worldly position.’ \n \n He paused, but Margaret made no sign. She kept her cold eyes fixed upon his face, as if fascinated by the horror of a degrading confession; but her pulses temperately kept time, and her self-control was perfect. \n \n Then he continued:— \n \n ‘I repeat, that I ought possibly to have consulted you earlier on this subject, and I am not at all astonished at your surprise. I never thought to have married a second time. My first experience, as you know, was not encouraging, and since her death you have made my home very happy. My dear Margaret, forgive me if I have seemed unkind, but setting aside the reasons to which I have alluded, I thought it better not to speak of this until I had spoken to Miss Vere. Well, I have spoken, and I thought you ought to know the result. That is why I took you to the theatre. That is why I have spoken.’ \n \n He paused again. This time his sister replied— \n \n ‘Of course, James, you are your own master. I have no right to object.’ \n \n ‘That is not the question,’ he cried impatiently. ‘I should certainly take no important step in life without consulting you. I am to understand, then, that you object?’ \n \n ‘Most certainly.’ \n \n ‘To my marrying?’ \n \n ‘No, James. To your marrying a person in Miss Vere’s position.’ \n \n Forster rose to his feet with an angry exclamation. \n \n ‘Her position is as good as mine. I am a clod, she is a genius.’ \n \n ‘She is not a lady,’ returned Margaret, compressing her lips firmly. \n \n ‘Good heavens, what do you mean? There is not a whisper against her, she is divinely gifted, all the world is raving about her. Not a lady! she is a queen!’ \n \n Margaret smiled—a cold sickly smile of supreme feminine pity. Irritated by the smile, and driven out of his usual reticence by the wine he had taken at supper, Forster took a rapid turn round the room, and then, turning back to his sister, cried in a voice broken with agitation— \n \n II thought you above these shameful prejudices. The profession of an actress is one of the noblest under the sun. The same insane bigotry which still pursues theatrical performers persecuted until lately all the arts, literature and painting more particularly. At the bottom of it all is the Church—the Church which denied Adrienne Lecouvreur Christian burial, and which from the beginning of time has been the enemy of light, freedom, knowledge.’ \n \n He was going on in the same strain when his sister quietly interfered— \n \n ‘My dear James, how absurd! I am very fond of the theatre, as you know.’ \n \n ‘But you despise those who act.’ \n \n ‘Nothing of the kind. I only desire to see them in their proper place in society.’ \n \n ‘Where is that, pray?’ \n \n ‘Among themselves—in their own artistic world. In point of fact, they are much happier there.’ \n \n ‘Stop a moment, Margaret,’ said Forster, with a short, excited laugh. ‘You speak of their world. What is mine? To what sphere do I belong?’ \n \n ‘You? My dear James, you are a merchant and a gentleman.’ \n \n ‘I am a tradesman, Margaret, received in certain circles because I have so much money, rejected in others because I have neither the birth nor the breeding of an aristocrat. The same measure you mete to Miss Vere is meted to me—to you also—by those who affect to be our social superiors. What nonsense it all is! What d—d nonsense!’ \n \n Margaret Forster shuddered. She had never before in her life heard her brother swear, and his use of even so mild an oath showed the situation to be desperate. She went up to him gently, and put her cheek for his goodnight salute. \n \n ‘I think I had better go now,’ she said. ‘We are both tired, and if you are really in earnest, we can talk it over to-morrow. Good-night, James.’ \n \n ‘Good-night,’ returned Forster, just touching her cheek with his lips. ‘But don’t go till you have heard me out, I have told you that I love Miss Vere, and that I have proposed to her, but there is something more.’ \n \n ‘Yes?’ \n \n ‘She has refused me—that is all.’ \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1856/53787.html","bookId":834,"book":{"id":834,"title":"The Martyrdom of Madeline","description":"简介： In this story I have touched, very feebly and inadequately, on one of the greatest and saddest of human problemsas great and sad, certainly, as the problem which forms the central purpose of my Shadow of the Sword. What the creed of Peace is to the s...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1856","creation":"Aug 1, 2019 12:19:37 AM","modification":"Aug 1, 2019 12:19:37 AM"}}
