{"id":19082,"no":44,"title":"CHAPTER XLII.—EXIT GAVROLLES.","content":"Several weeks after the wandering woman, who called herself ‘Jane Peartree,’ became an inmate of Mount Eden, that cosmic creature, Auguste de Gavrolles, author of the immortal ‘Parfums de la Chair,’ was entertained at a little supper in the house of Ponto, the art-critic. The occasion was an interesting one, originating in the fact that London was about to lose, for a time at least, the light of the French poet’s presence. Urgent private affairs, no less than the home-sickness of a great man for the scene of his struggles and his triumphs, were the reason of his departure. Frankly, as he confessed to his admirers, London was insufferably bête after the true centre of the universe, Paris. It contained many choice spirits, notably those who had nourished their sublime youth with the fiery fleshliness of the Impeccable Master, but even these could not compensate for the fine atmosphere of Parisian salons, the soul-satisfying sunlight of Parisian streets. In a word, both duty and pleasure beckoned the cosmic creature back to his Cosmos, and he was compelled, though with a certain reluctance, to say farewell. The gathering was a very quiet one Ponto’s house, situated in the dismally aesthetic region of Chiswick, was a small but elegant artistic villa, furnished in the superbest spirit of enlightened chilliness and elegant squalor. There, in a tiny reception room with golden-spotted walls and a cerulean ceiling, some dozen gentlemen and about half a dozen ladies assembled; among the company being the young aesthetic poets, Botticelli Jones and Omar Milde; Lady Milde, mother of the bard, known in her girlhood as the fair ‘Lachryma’ of the albums; Gass and Barbius, Ponto’s brother-critics; the editor of the ‘Megatherium’; Clothilde Max, daughter of the Teutonic patriot, Hermann Max; and a few others. The affair was affecting, if not festive. There were gay spongecakes and nondescript confectionery on a sideboard, together with the finest Marsala wine, for those who sought refreshment. When, in a few well-chosen words, Ponto wished Godspeed to the guest of the evening, several persons present were dismally affected. Gavrolles, more than usually jubilant, replied, thanking perfidious Albion, in the person of its noblest representatives, for their cordial treatment of him, a stranger, an exile. He had come to them on his merits, a poor artiste, a lover of the beautiful, a pupil of Gautier, and they had received him as a brother. He should bear back to his beloved Paris the memory of their kindness. He should inform his countrymen that France and England were thenceforth bound together by a tie stronger than all commercial treaties—the tie of sympathy in poetic aspirations, in divine Art. He should tell his compatriots that even in England, despite its Philistinism, despite its climate, there were singers as sweet and critics as profound as even those who possessed the inestimable advantages of a Parisian education. Need he mention, as a sample of all that was superb in song, his friend, Botticelli Jones? Need he cite, as an example of all that was subtle in perception and perfect in expression, the name of his friend and host—nay, might he not say, his brother?—Ponto, prince of critics? The lank and limp ladies clung around him, with every expression of sympathy and affection, until the hour of parting came. Then Gavrolles, with tears in his eyes, read aloud, with considerable emphasis, a French sonnet which he had composed for the occasion, and in which the names of many present were touchingly introduced. This effusion was afterwards passed from hand to hand until it reached the editor of the ‘Megatherium,’ who claimed the privilege of publishing it in the forthcoming number of his journal, along with a reply (in the same language) from Young Botticelli Jones. Finally, the party separated, and Gavrolles, triumphant, drove home to his lodgings in a hansom cab. The next evening, bearing with him in a small portmanteau and a morocco hand-bag all his worldly goods, Gavrolles left Charing Cross by the night mail, en route for Boulogne. It was a wild wintry night, pitch dark, with gusts of rain and sleet; even the station looked dreary and forlorn, despite the pale brilliance of the electric light. Wrapt in a large travelling cloak, profusely trimmed with fur, and wearing an artistic felt hat, the broad brim of which was drawn down over his face, Gavrolles strolled up and down the platform with a theatrical swagger, taking care to clutch always his little handbag of black morocco. When the ticket office opened he approached the aperture, and, opening a purse full of bright new sovereigns, took a first-class ticket to Boulogne. He looked at nobody, heeded nobody, he seemed too obviously wrapt up in his own happy thoughts. His air, his walk, the feverishly delighted laugh in which he indulged from time to time, all seemed to betoken some special good fortune; and what wonder, seeing he had that very day cashed a large open cheque—payable to ‘Bearer’—at a London bank, and afterwards, at a neighbouring money-changer’s, converted the greater portion of the amount into glittering coin of the French realm. Perhaps, had he been less jubilant and self-involved, he might have taken some little notice of his fellow-passengers—particularly of two individuals who, closely wrapped up and muffled almost to the eyes, observed him from a distance, listened in the shadow when, in a loud voice, he demanded his ticket, and then, after he had withdrawn, took two tickets, also for Boulogne, but second-class. The express left London and plunged into the darkness. Gavrolles found himself alone—for there were few passengers that night—in the smoking compartment of a first-class carriage. While the rain hissed upon the window pane, and the noise of the train drowned even the roaring of the wind, he opened his little handbag, and eagerly recounted his treasure. His eye glittered with delight as he fingered the glittering gold pieces, and found them all safe. Then he wrapt his cloak around him, and resigned himself to a doze. At Folkestone the weather looked ugly in the extreme; the wind roared, and the sea flashed in the darkness, while the packet rocked and throbbed with an uneasy motion. At first Gavrolles hesitated, but his horror of sea-sickness yielded to his intense longing to be again among certain choice spirits on his native soil, and with a few shivering compatriots he crept on board. Among those who followed him were the two men who had watched him so curiously at Charing Cross. The passage was a miserable one. Gavrolles, to whom expense was no consideration when he was in funds, occupied the deck cabin, and suffered agonies through seasickness. In the grey of a wintry morning, he alighted, a piteous spectacle, ghastly, dishevelled, hideous, on the quay at Boulogne. Among the groups assembled to see the voyagers alight was a white-haired woman, respectably but plainly dressed in black. She watched the passengers alighting one by one, until her eye fell upon a sinister-looking individual smoking, with serene defiance of the elements, a clay pipe. She at once greeted him by name, and, leading him aside, accosted him in French. ‘What! do you come alone? Where are those in your charge?’ ‘Calm yourself, madame,’ said the man with gruff politeness. ‘I shall fulfil my contract. They would not cross in such weather.’ ‘But they remain?’ ‘Safe in the charge of my wife, at Folkestone. You will find two of them charming; the third not so good-looking, but très gentille. As I wrote you, one is a domestic servant, another a tradesman’s runaway daughter, the third a figurante of the theatre. They all seek situations, which I have promised them, as you are aware.’ ‘But do they understand? With the last there was a scandal, and I want no more trouble.’ ‘Trust my wife, madame; there will be no difficulty. As usual, when they find themselves under your kind care, they will behave discreetly.’ At this juncture Gavrolles crawled up the gangway, the picture of misery and collapse. No sooner did the woman espy him than she uttered an exclamation. ‘I see another friend!’ she exclaimed to her companion. ‘Go on to my house, and await me there.’ Gavrolles, followed by a porter carrying his portmanteau, elbowed his way along the pier. Suddenly he felt a touch upon his arm, and, turning sharply, saw the woman. ‘Well met, Belleisle!’ she said with a grim smile and a not too amiable compression of the lips. So worn and washed out was the cosmic creature that at the first glance he failed to recognise his old companion, Madame de Fontenay. ‘What!’ she exclaimed. ‘Do you forget me?’ At last, his glazed and fish-like countenance expressed a dim and irritated recognition. ‘Is it you, Madame Louise?’ ‘Yes; it is I!—And you? It is many a long day since we met, though I have often inquired after you in vain. You are a sly rascal, Belleisle; you forget old friends, old services, old debts. Ah! but I remember.’ ‘I have been in England,’ replied Gavrolles, surveying her with strong dislike. ‘Ah, yes, so I heard. Have you been fortunate there, mon ami?’ ‘On the contrary. But you? You live here?’ ‘Yes,’ said the woman. ‘You follow the old trade, madame?’ The woman nodded, and the two passed on in conversation. Gavrolles did not look back, or he would have seen, still watching him with curiosity, the two men who had followed him from Charing Cross. Gavrolles slept that night in the H?tel de Rouen, a chilly place, half-hotel, half-prison, in a back street of Boulogne. Here he had the pleasure of meeting two or three gentlemen of his acquaintance, who earned their money at the card table and in the billiard room, and spent it in dingy dissipation, like cavaliers of pleasure. With one of these individuals, an elderly man in a seedy military undress, and with the face and manners of a fire-eater, Gavrolles strolled out next morning, cigar in mouth. Roaming along by the sea, he came face to face, in a quiet spot, with two Englishmen—James Forster and Edgar Sutherland. Gavrolles started and turned livid, clinging to his companion’s arm, as Sutherland accosted him. ‘I salute you, Monsieur Gavrolles. A word with you, if you please.’ ‘What do you seek with me?’ cried Gavrolles, shrilly, ‘I see you are not alone. If monsieur le mari yonder wishes to recede from his bargain, it is too late. As for you, monsieur, I once warned you; and, as we are no longer in England, beware!’ Sutherland smiled. Forster, who looked pale as death, was about to interpose, when the younger man continued: ‘Monsieur Gavrolles, it is precisely because we are no longer in England that I accost you. Once, in London, you did me the honour to express a hope that we might meet on French soil. It was simply to realise that hope that my friend supplied you with money. You came—we followed—you understand?’ Gavrolles shrank back from the powerful figure, and eyed the determined face with baleful hate. ‘I have no quarrel with you. I—I do not know you.’ Before Sutherland could say another word Forster interfered. ‘The man is right. As I said to you from the first—his quarrel is with me. Listen to me, man!’ he continued, facing Gavrolles. ‘I am not a duellist, I know nothing of your weapons, but unless you consent to fight me I shall have you arrested as an extortioner and a thief. You are still wanted in London, and if you refuse——’ Gavrolles, who had been watching the speaker keenly, and had paid particular attention to his words, answered with a scowl:— ‘With you it is another affair, monsieur. I am at your service.’ ‘When?’ ‘As soon as you please. I am sorry that we could not end our little disagreement amicably, but since you are determined——’ And Gavrolles shrugged his shoulders. Sutherland pulled Forster aside, while Gavrolles, with an ugly smile, turned and volubly explained matters to his companion. ‘You are mad!’ Sutherland cried. ‘You should have left this affair to me. He is an expert duellist, and may kill you.’ ‘And if he does, so much the better.’ ‘You are determined?’ ‘Yes. For God’s sake settle the matter as soon as possible.’ Here Gavrolles’ companion with pompous dignity approached Sutherland. ‘Monsieur, that is my card. I am the Chevalier de Beauvoisin, and I represent my friend. Where and when can I see you and arrange the preliminaries?’ ‘Now, on this spot.’ The two men walked aside, and remained for some minutes in conversation. Then Sutherland returned to Forster, took his arm, and led him away. ‘It is arranged for to-morrow at daybreak,’ he said, ‘on the sands yonder, two miles from Boulogne. As you are the challenger, they had the choice of weapons. They have chosen pistols.’ ‘Very well.’ ‘Have you ever practised at a mark?’ Forster-shook his head. ‘I have never fired a pistol in my life.’ ‘Then it is an ugly affair. Let me entreat you, accept me as your substitute—I will force them to consent——’ ‘No,’ answered Forster with determination. ‘It is my place, not yours. I shall either avenge my poor martyred wife or follow her to the grave.’","sourceLink":"http://novel.tingroom.com/jingdian/1856/53806.html","bookId":834,"book":{"id":834,"title":"The Martyrdom of Madeline","description":"简介： In this story I have touched, very feebly and inadequately, on one of the greatest and saddest of human problemsas great and sad, certainly, as the problem which forms the central purpose of my Shadow of the Sword. What the creed of Peace is to the s...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1856","creation":"Aug 1, 2019 12:19:37 AM","modification":"Aug 1, 2019 12:19:37 AM"}}
