{"id":1263,"no":25,"title":"EASTSIDER JOAN FONTAINE","content":"EASTSIDER JOAN FONTAINE \\n\\n Actress turns author with No Bed of Roses \\n\\n \\n\\n 12-30-78 \\n\\n \\n\\n The Oscar statuette stands on the end of a shelf about eight feet off the floor, partially obscured by a row of books, its gold surface gleaming dully in the subdued light of the room. Below, in one of the apartment\u0027s four fireplaces, a small log is softly burning. This room, like the rest of the large, immaculate home, is furnished in the style of an early 20th century country manor. Here, in the heart of the Upper East Side, Joan Fontaine has spent 15 years of an immensely productive life. I take a seat on one side of the fire, and Miss Fontaine faces me from the opposite side of the room, her slender, regal form resting comfortably in an antique chair, to talk about her best-selling autobiography, No Bed Of Roses (Morrow, $9.95). Published in September, the book has already sold more than 75,000 copies in hardcover. \\n\\n \\n\\n As the title implies, Miss Fontaine\u0027s life has been one long roller coaster ride of triumph and tragedy. During the 1940s she received three Oscar nominations for Best Actress in the space of four years, and won the award for Suspicion (1941). She had the joy of raising two children — one of them adopted — but the disappointment of four divorces. Her mother, who died in 1975, was the best friend she has ever known, yet both her father and her stepfather gave her nothing but unhappiness, and she never had a close relationship with her famous older sister, Olivia de Havilland. In fact, the pair have not spoken in years — for reasons clearly explained in Fontaine\u0027s book. \\n\\n \\n\\n A fiercely independent woman who has flown her own airplane and taken part in international ballooning competition, she has suffered through numerous illnesses and injuries that brought her close to permanent disability or death. These are the elements of No Bed Of Roses, a disarmingly frank memoir that is frequently unsettling but never boring. \\n\\n \\n\\n \"The fan mail for this book is getting to be enormous,\" says Fontaine, still radiant at 61. \"A lot of people identify with the illnesses, or with trying to bring up children alone. Some people empathize because they had harsh relations with their siblings. A lot of men have told me they cried at the end, in my epitaph to my mother. And then of course, I have heard from a lot of people who wanted to be actresses, or actors.\" \\n\\n \\n\\n Did she write the entire book herself? \"Every single word. I wouldn\u0027t let them touch one of them. … It\u0027s not a sordid book; it\u0027s not tacky. One reviewer said it was immoral. I don\u0027t think I can figure that out. If you ask me, it\u0027s rather religious.\" \\n\\n \\n\\n The words come out like perfect silver beads. She has always been a formidable presence on the screen, and is no less so in person, as she gives her unrestrained opinions on every topic introduced. \\n\\n \\n\\n Marriage, says Fontaine, is \"waiting on — or waiting for somebody.\" Asked whether she believes two average people can remain happily married for a lifetime, she replies: \"It depends how hypocritical they are, and how much lying they want to do. … I think the word \u0027love\u0027 means an entirely different thing to a woman than it does to a man.\" \\n\\n \\n\\n Her classic movies, including Rebecca, Jane Eyre, Suspicion, and This Above All, are frequently seen on television now, but Fontaine has little respect for television as a medium: \"I consider it nothing more than B pictures. I think we took a little more care with B pictures; the actors and actresses got a chance. In a television film, if the actor slips on a word, to hell with it. We\u0027ll cut around it.\" \\n\\n \\n\\n Earlier this year, Fontaine appeared in the made-for-television movie The Users, starring Jaclyn Smith. She could do many others, but prefers to be choosy. \"The quality of the scripts is so poor. I think it\u0027s the taste of the times. It\u0027s a brutal world; it\u0027s a vulgar world. … It\u0027s quite different from the romance of Jane Eyre. I don\u0027t think I could act those roles. I\u0027d rather sit in my library in front of the fire.\" \\n\\n \\n\\n In truth, she has little time for sitting around: her acting talents are too much in demand, in dinner theatres and in college auditoriums around the country. Recently she returned from a three-month working trip. In February she\u0027ll be opening in Dallas. \"I haven\u0027t decided on the play yet,\" she says. \\n\\n \\n\\n In spite of her words, she somehow comes off as being thoroughly charming. A highly sociable woman who loves to attend cocktail parties and make new acquaintances, Fontaine is also a gourmet cook. \"At Christmas I cook for about 75 people. No one married can come. I\u0027m thrilled that one of my friends has just gotten divorced. Now she can come.\" Among the Eastside restaurants that Fontaine visits frequently are 21 and the Four Seasons. \\n\\n \\n\\n When she has time to herself, Fontaine enjoys reading literature and adapting it for her lectures. \"I lecture on many subjects,\" she says. \"I do the entire Jane Eyre — all the roles. It takes about an hour and a half. It\u0027s more like a film reading than a lecture. I do one on American poets, and one on Robert and Elizabeth Barrett Browning — all their own words. Then a new one has crept up — if I may say so, by popular demand — called \u0027The Golden Years.\u0027 I tell how to do it — how to make these years the best. I\u0027ve never felt so happy or so free or so contented as I am now.\" born 10-22-17 \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/mingren/1506/44916.html","bookId":46,"book":{"id":46,"title":"100 New Yorkers of the 1970s","description":"简介： 《百位1970年代纽约人》出版于2005年，是由作者麦克斯米勒德为纽约本地报纸《电视信息报》所写的210篇人物专访中精选出一百篇结册，采访对象多为艺术界和娱乐界名人。人物专访往往具有一定的时效性，涉及诸多时代背景要素，会提及各种人物、地点、组织、事件等等。因此...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/1506","creation":"Aug 1, 2019 12:18:13 AM","modification":"Aug 1, 2019 12:18:13 AM"}}
