{"id":1268,"no":30,"title":"EASTSIDER LILLIAN GISH 78 years in show business","content":"EASTSIDER LILLIAN GISH 78 years in show business 1-5-80 D.W. Griffith, the father of motion pictures, used to say there were only two people who outworked him — Mary Pickford and Lillian Gish. Pickford, who died last May, made her final film in 1933. But Lillian Gish never got around to retiring. At 83, she is perhaps the most active living legend in America. Sipping tea at her Eastside apartment, which is decorated like a Victorian drawing room, Gish appears to have defeated time. Her clear blue eyes, porcelain-smooth complexion, and slender, girlish figure have not changed all that much since she rose to international stardom in Griffith\u0027s controversial 1915 classic, The Birth of a Nation. She also starred in his 1916 film Intolerance, a box office failure when released, but later recognized as a masterpiece. An animated speaker who makes sweeping gestures, she still has the crystalline voice and flawless enunciation that enabled her to make the transition from silent films to talkies and Broadway shows in the early 1930s. The 1978 Robert Altman film A Wedding marked her 100th screen appearance. \"I\u0027ve never worked harder in my life than I have in the last three or four years,\" says Miss Gish, who, during that period has made her singing and dancing debut in Washington\u0027s Kennedy Center, hosted a 13-week series for public television, The Silent Years, appeared in an ABC-TV movie of the week, and toured the world three times to present a one-woman show that combines film clips with narration. Her autobiography, The Movies, Mr. Griffith and Me, has been translated into 13 languages. \"I dedicated the book to my mother, who gave me love; to my sister, who taught me to laugh; to my father, who gave me insecurity; and to Mr. Griffith, who taught me that it was more fun to work than to play,\" she recalls with merriment, describing how her mother wound up in the theatre around 1901 due to financial need. Five-year-old Lillian and her 4-year-old sister Dorothy soon followed in the business. \"We didn\u0027t use our real names because we didn\u0027t want to disgrace the family. … They used to have signs on hotels: \u0027No actors or dogs allowed.\u0027\" She never got a chance to attend school. \"I loved the book Black Beauty, and everybody would read it to me on the train or waiting for the train. Well, I finally had it read to me so much, I knew it by heart. And that\u0027s how I learned to read. When we were travelling around, mother would always take her history book. When we were in historical places, she\u0027d take us to where history happened.\" At the height of her silent film career, Lillian received 15,000 fan letters a week, many from overseas. \"Silent films are the universal language that the Bible predicted would bring about the millennium. … When Mr. Griffith made his first talking picture in 1921, he said, \u0027This is committing suicide. My pictures play to the world. Five percent of them speak English. Why should I lose 95 percent of my audience?\u0027 \"One of the things I\u0027m trying to do now is to bring back silent films and beautiful music. I\u0027m doing it with my film La Boheme, which was made in 1926. I\u0027ve done it in the opera house in Chicago with an organist, and at Town Hall here. Harold Schonberg of the New York Times gave it the most ecstatic review.\" Her credits include an honorary Oscar award, dozens of major stage roles, and a movie that she co-wrote and directed. But Miss Gish, with characteristic modesty, prefers to talk about her friends and family. Bitterness and complaint are alien to her nature, although life has not always been easy. She never married, and her mother, to whom she was highly devoted, spent the last 25 years of her life as an invalid. \"But she was never unhappy,\" testifies Lillian. \"She was always the first to laugh, and the gayest.\" Following her mother\u0027s death in 1948, the apartment was given to Dokey, her nurse, who died the following year. Then Lillian and Dorothy Gish shared the apartment until Dorothy\u0027s death in 1968. Although Lillian now lives alone, she has no opportunity to be lonely. Besides work, travel, and reading — her favorite activities — she has 13 godchildren. One thing that helps keep her young, says Miss Gish, is her intense curiosity. \"I was born with it, thank heavens. I feel sorry for people who say they\u0027re bored. How in the world can anyone be bored in the world today? How can fiction complete with what\u0027s going on?\" A few of her films, have been lost forever, since no original prints exist in good condition. Most, however, are still shown around the globe, which explains why her autobiography is available in such languages as Burmese and East Malaysian. The Museum of Modern Art on West 53rd Street has one of the country\u0027s finest collections of vintage Gish films. One of her upcoming projects is a movie based on a story by the Danish writer Isak Dinesen, scheduled to begin shooting in Europe this winter. Another is a television pilot to be shot in California for Julius Evans. Asked to name some of the things she is most curious about today, Miss Gish quickly replies, \"Naturally what\u0027s happening in Cambodia — how they\u0027re going to solve that problem. Those poor children. It breaks my heart. … And who\u0027s going to be our next president. We\u0027ve come to the point where we should have two presidents, I think — someone to look after the world and somebody to look after us.\" died of natural causes 2-27-93. born 10-14-1893 WESTSIDER MILTON GLASER Design director of the new Esquire 2-11-78 Two decades before Playboy first hit the newsstands, there was only one men\u0027s magazine in America. A generation of schoolchildren grew up speaking its name in hushed whispers, though anyone reexamining those early issues today could hardly understand why. The magazine was Esquire. Its popularity has dipped somewhat in recent years, but Esquire still sells one million copies per month. And it still has the reputation of being the most tasteful, literary, and sophisticated publication for the American male. If some people have complained that it has not kept up with the times, they won\u0027t be able to say that any longer — not since Esquire became the property of Clay Felker and Milton Glaser, the publishing team who made New York magazine into one of the best-selling weeklies in the city. With Felker as editor and Glaser as design director, Esquire will have a totally new look starting with the February 14 issue. It will have a different size, binding, shape, length, and contents. It will also change its name to Esquire Fortnightly and appear 26 times a year instead of 12. \"The new Esquire will be ungimmicky, easy to understand,\" says Milton Glaser, taking a half-hour break from his numerous artistic projects. He is as animated as his enlarged signature, which glows from a custom-made neon lamp on the wall beside a Renaissance Madonna and a framed Islamic drawing. The first thing you notice about Glaser is the colored handkerchief adorning his jacket pocket. Then you notice how relaxed he is, and how easily he smiles. \"The name of the game is to get an audience that identifies with the magazine and feels it\u0027s on their side. People buy a magazine because it\u0027s of considerable interest to them, not because they get a deal on the subscription. … What you want to do is to find the right-size audience, made up of people who believe in the values that the magazine reflects.\" The original Esquire, Glaser points out, helped to glamorize the rich, privileged man of the world — the man who had arrived, who knew his place in the world, and whose greatest desire was to surround himself with the symbols of wealth, such as fancy cars and beautiful women. Today, says Glaser, the American male no longer measures success by symbols alone. Rather, he aims for self-development, for the richness of life itself — professional, personal, physical, intellectual and spiritual. Clay Felker writes, in a yet-unreleased editorial in Esquire: \"We will explore how a man can develop a more rewarding life with the women and children in his life. … I see Esquire magazine as a cheery, book filled, comfortable den, a place of wit and sparkling conversation, of goodwill and genial intelligence, where thoughtful discussions take place and wise conclusions are reached.\" Milton Glaser is probably the best-qualified artist in America to redesign Esquire. Besides his success with New York magazine, which began as a Sunday supplement to the old New York Herald Tribune, Glaser has designed The Village Voice, Circus magazine, New West and two of France\u0027s leading publications, L\u0027Express and Paris-Match. Glaser\u0027s posters have sold in the millions. He has put on one-man exhibitions in the U.S., Europe and the Middle East. (He believes, in fact, that his work is more appreciated abroad than at home). He has designed everything from stores to toys to new typefaces. He is a faculty member at both Cooper union and the School of Visual Arts. He is responsible for all the graphic design and decorative programs at the World Trade Center. Two volumes of his works have been published — Milton Glaser: Graphic Arts and The Milton Glaser Poster Book. In addition, he is a noted food critic. For the past 10 years he has co authored and constantly updated the best-selling Manhattan restaurant guide, The Underground Gourmet. A native New Yorker, Milton Glaser has fond memories of his boyhood in the Bronx. He especially likes recalling an event that took place in 1933 — the year that Esquire was founded. \"When I was 4 years old, a cousin of mine said, \u0027Would you like to see a pigeon?\u0027 He had a paper bag with him and I thought he meant there was a pigeon in it. But then he took out a pencil and drew a picture of a bird. I was so astonished that you could invent reality that I never recovered from it. The only thing I wanted to do in my life was to make images.\" Milton and his wife, Shirley, moved to the West Side last August. \"I guess it was the opportunity to find the right physical space. I like the neighborhood because of the mix of working class, middle class, and upper class. … That really is the richest thing the urban scene offers.\" The number of Westside restaurants listed in The Underground Gourmet has sharply increased over the years. Among his favorite dining spots of all price ranges are Ying\u0027s on Columbus Avenue (at 70th St.), the Cafe des Artistes (1 West 67th St.), and the Harbin Inn (2637 Broadway). Look in any New York subway station and you\u0027ll see a poster advertising the School of Visual Arts. It shows two identical men in a room. One is lying on a bed and the other is floating in the air. The caption reads: \"Having a talent isn\u0027t worth much unless you know what to do with it.\" Milton Glaser, the designer of that poster, is a supreme example of a man with many talents who knows what to do with all of them.","sourceLink":"http://novel.tingroom.com/mingren/1506/44921.html","bookId":46,"book":{"id":46,"title":"100 New Yorkers of the 1970s","description":"简介： 《百位1970年代纽约人》出版于2005年，是由作者麦克斯米勒德为纽约本地报纸《电视信息报》所写的210篇人物专访中精选出一百篇结册，采访对象多为艺术界和娱乐界名人。人物专访往往具有一定的时效性，涉及诸多时代背景要素，会提及各种人物、地点、组织、事件等等。因此...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/1506","creation":"Aug 1, 2019 12:18:13 AM","modification":"Aug 1, 2019 12:18:13 AM"}}
