{"id":1292,"no":54,"title":"WESTSIDER MALACHY McCOURT","content":"WESTSIDER MALACHY McCOURT \\n\\n Actor and social critic \\n\\n \\n\\n 9-22-79 \\n\\n \\n\\n \"I never take anything seriously — least of all myself,\" says Malachy McCourt, one of the wittiest, most outrageous Irish personalities in New York. \"I find my life is cyclical, and so I move every five or six years from one interest to another. Now that I\u0027m doing acting sort of full-time, I thoroughly enjoy the uncertainty of it. But I do appear almost also every Wednesday at the unemployment office at 90th Street. I do a matinee from 2:15 to 2:45.\" \\n\\n \\n\\n He concludes the remarks with his customary gust of laughter. As opinionated as he is entertaining, Malachy McCourt is one of those larger than-life characters who has mastered the art of conversation to such a degree that no matter what people think of him, they cannot help being magnetically attracted by his words. \\n\\n \\n\\n In 1968 he had his own talk show in WOR-TV that was canceled because of the controversy it raised. From 1970 to 1976 he had a weekend show on WMCA radio, and lost that as well — for publicly condemning the station\u0027s treatment of an employee whose job was abolished. \"They called him in on a Friday at five minutes to five, and told him to clear his desk. He had been there for 28 years.\" \\n\\n \\n\\n The airwaves\u0027 loss has been the theatre\u0027s gain, because in the past three years, Malachy has developed an ever-increasing reputation as a character actor. Well-known for his roles in Irish plays — especially those by John Millington Synge — he has also been seen recently in movies and television. His films include Two for the Seesaw and The Brink\u0027s Job, while on television, he appeared in last season\u0027s The Dain Curse with James Coburn and in Thomas Wolfe\u0027s You Can\u0027t Go Home Again. \\n\\n \\n\\n His current vehicle is The Shadow of a Gunman by Sean O\u0027Casey, the great Irish playwright. In the role of Seamus Shields, whom Malachy describes as \"a snivelling, sycophantic swine of a braggart,\" he is co starring with Stephen Lang at the Off-Off Broadway Symphony Space for the Performing Arts, 95th Street and Broadway. \\n\\n \\n\\n The action takes place in Dublin in 1920. \"It was during the time of what they euphemistically call \u0027the Troubles,\u0027\" explains Malachy in his broad, breezy irish accent. We\u0027re sitting in his Westside living room. The walls are so loaded down with books that they seem ready to collapse. \"The English brought in a bunch of gangsters from their prisons, called the Black and Tans. They were paid an extraordinary amount of money to go over and pacify the country. They could do anything they pleased. You could be tortured, raped and robbed.\" \\n\\n \\n\\n Born in Limerick in 1931, Malachy quit school at the age of 12. \"It was an equal struggle. They couldn\u0027t teach me and I couldn\u0027t learn.\" He joined the Irish Army at 14, was kicked out at 15, then went to England, where he worked as a laborer prior to emigrating to the U.S. at the age of 20. His conversational brilliance soon made him famous as a saloon keeper. At one time he ran a Malachy\u0027s and a Malachy\u0027s II on the Upper East Side. \"I gave it up,\" he quips, \"for the sake of the wife and the kidneys.\" Now the only bartending he does is on the ABC soap opera Ryan\u0027s Hope, where he is a regular. \"I much prefer that. It\u0027s a fake bar, and everybody else cleans it up.\" \\n\\n \\n\\n He has few happy memories of his native country. \"There should not be a united Ireland,\" he asserts. \"In the South, the government is subject to enormous pressures by the church all the time, in the areas of birth control, contraception, abortion. People should have the rights to their own bodies and their own lives. … Consequently, those of us who escape get very savage about it. Very savage. \\n\\n \\n\\n \"Someone I was talking to the other day said, \u0027I can\u0027t understand how you can be an atheist and have of fear of death.\u0027 I said, \u0027I have no fear of death because I grew up with it.\u0027 It was all around. I woke up one morning when I was 5 and a half to find my brother dead beside me. Another brother had died six months before. My sister died in her crib. So therefore, what can you fear, when you know it so well? I\u0027m alive today. I\u0027ll probably get up tomorrow. There\u0027s great comfort in the fact that we\u0027re all going to die eventually.\" \\n\\n \\n\\n Asked about Daniel P. Moynihan, whom he somewhat resembles physically, Malachy describes the senator as \"the Nureyev of politics. He can leap from conservative crag to liberal crag with gay abandon. A man who could serve Kennedy and compare Nixon to Disraeli must be either insane or insanely clever. I look at him and I cannot believe that this twinkly-eyed, overweight leprechaun can be so cunning.\" \\n\\n \\n\\n Malachy\u0027s wife Diana — \"she\u0027s the only Smith graduate I know that became a carpenter\" — does custom carpentry work out of a shop called Space Constructs on 85th Street. Westsiders for two decades, the McCourts have two children, Conor and Cormic. One of their favorite local restaurants is Los Panchos at 71st and Columbus; it is owned by Malachy\u0027s brother Alfie. \\n\\n \\n\\n Although Malachy has no desire to return to Ireland to live, he recommends it for tourists because \"it\u0027s the last outpost of civilized conversation. The Irish have an attitude that when God made time, he made plenty of it. So for God\u0027s sake, don\u0027t be rushing around. Stand there and talk to me.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/mingren/1506/44979.html","bookId":46,"book":{"id":46,"title":"100 New Yorkers of the 1970s","description":"简介： 《百位1970年代纽约人》出版于2005年，是由作者麦克斯米勒德为纽约本地报纸《电视信息报》所写的210篇人物专访中精选出一百篇结册，采访对象多为艺术界和娱乐界名人。人物专访往往具有一定的时效性，涉及诸多时代背景要素，会提及各种人物、地点、组织、事件等等。因此...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/1506","creation":"Aug 1, 2019 12:18:13 AM","modification":"Aug 1, 2019 12:18:13 AM"}}
