{"id":1299,"no":61,"title":"WESTSIDER LeROY NEIMAN","content":"WESTSIDER LeROY NEIMAN \n America\u0027s greatest popular artist \n \n 1-27-79 \n \n Like Norman Rockwell before him, LeRoy Neiman has the distinction of being one of the very few American artists whose work is familiar to practically everybody in the country — rich and poor, black and white, urban and rural, educated and illiterate. \n \n This is as far as their similarity goes, however. Rockwell, who died in November, 1978 at the age of 84, was known for his meticulously detailed, placid portraits of American family life, while Neiman has built his reputation on action-filled scenes composed of bold splashes of color. Rockwell\u0027s career started and ended at the Saturday Evening Post; Neiman\u0027s began at Playboy and has reached its zenith in an entirely new medium — television. His televised mural of the 1976 Olympic Games was seen by an estimated 170 million people. \n \n One of the most commercially successful artists in the world, LeRoy Neiman has spent the last 18 years living and working in a huge apartment/studio just off Central Park West. His original paintings command up to $50,000 each, but the larger portion of his work comes out in the form of limited-edition serigraphs (silkscreen prints). A single piece of silkscreen art generally yields some 300 prints, each of which sells for about $1,500. \n \n Neiman\u0027s eye-catching style is admired everywhere. His posters and calendars are best-sellers in Japan; several of his painting are on permanent display at the Hermitage Museum in Leningrad. He was the official United States artist-in-residence for the last two Olympics and will be for the 1980 Games as well. Although best known for his sports pictures, Neiman is also a renowned portraitist who specializes in famous faces. He is attracted by drama and excitement of any kind, whether found in a tavern inhabited by the Beautiful People, in a heavyweight fight, in a world chess championship, or, as television viewers witnessed last January, in a Super Bowl. Neiman sat on the sidelines of that contest drawing pictures of the game in progress, using a computer-controlled electronic pen and palette. The pictures were then flashed onto the television screen. \n \n \"It\u0027s painting with light,\" explains Neiman one morning in his studio, taking a break from the half-dozen oils and acrylics he is working on. \"It gives you the same sense of creation as any other art medium. You\u0027re building and creating an image of your own that wasn\u0027t there when you started. The only limitation you ever have in doing a work of art is yourself.\" \n \n Starting this month, Neiman\u0027s work has become a regular feature of CBS Sports Spectacular. At the beginning and end of each program, Neiman\u0027s paintings are interspersed with photographs of athletes to form a moving collage of colors and shapes. The artist has been contracted to make six or seven personal appearances on the program over the next year, in which he will demonstrate the art of drawing sports in action. \n \n Neiman is a suave, sophisticated man who loves his work and loves to talk about it. Dressed in a fancy denim-style suit, with a long, thin cigar protruding from under his handlebar moustache, he expounds on a score of subjects as if he had all the time in the world. In the adjacent room, the telephone rings almost unceasingly. It is answered by his assistant, who calls out the message to him. More likely than not, it is a request for Neiman\u0027s artistic services. \n \n \"I sketch all the time,\" he says. \"A sketch is not necessarily a study to me. It\u0027s a record — something to consult with. I sketch an awful lot in public. Because when I go someplace and I get bored, I sketch. Everybody forgives me for it. They think I have an uncontrollable desire to draw.\" \n \n His style, says Neiman, \"came out of nowhere. It happened very suddenly, about 1954, just before I started with Playboy.\" That magazine recently honored him with an award for being one of the five most important contributors in its 25-year history. \n \n During his childhood in Minnesota, recalls Neiman, \"I was always drawing pictures and getting special treatment at school — showing off, copping out of other things. … I lived a couple of years in England and France.\" since moving to New York, he has been a constant Westsider. Central Park, says Neiman, \"is the West Side\u0027s front yard, but the East Side\u0027s back yard.\" \n \n Neiman\u0027s latest one-man show is an exhibit of approximately 50 \n serigraphs, etching, and drawings at Hammer Graphics on East 57th \n Street. Part of the proceeds from sales will go to the U.S. Olympic \n Committee. \n \n \"I turn most things down, because they\u0027re not stimulating and inspiring,\" says Neiman matter-of-factly. \"Money isn\u0027t enough stimulus to do something I don\u0027t like. … I work very hard. I fool around a lot too, but I don\u0027t go on vacations. I don\u0027t have hobbies. I put my vices within my craft.\" \n \n \n","sourceLink":"http://novel.tingroom.com/mingren/1506/44986.html","bookId":46,"book":{"id":46,"title":"100 New Yorkers of the 1970s","description":"简介： 《百位1970年代纽约人》出版于2005年，是由作者麦克斯米勒德为纽约本地报纸《电视信息报》所写的210篇人物专访中精选出一百篇结册，采访对象多为艺术界和娱乐界名人。人物专访往往具有一定的时效性，涉及诸多时代背景要素，会提及各种人物、地点、组织、事件等等。因此...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/1506","creation":"Aug 1, 2019 12:18:13 AM","modification":"Aug 1, 2019 12:18:13 AM"}}
