{"id":1306,"no":68,"title":"EASTSIDER GEORGE PLIMPTON","content":"EASTSIDER GEORGE PLIMPTON \n Author, editor and adventurer \n \n 2-2-79 \n \n It was an unusual statement to come from a man who has made a career out of fearing nothing. \"I\u0027m scared to death every time I sit down at a typewriter,\" confessed George Plimpton, who, in his 20 years as America\u0027s foremost \"participatory journalist,\" has played football with the Detroit Lions, fought the light heavyweight champion of the world, pitched to major league baseball players, raced cars internationally, and performed with the New York Philharmonic as a percussionist. \n \n \"Sometimes you can do it, and sometimes it\u0027s not there,\" continued Plimpton, leaning back in the desk chair at his Eastside apartment. \"It\u0027s very hard to work alone. There\u0027s the television set, and all these books, and your son and daughter in the next room. Sometimes I have to get away. So I go to bars and I sit in a corner and write. You\u0027re trapped in there. There\u0027s nothing else to do but write.\" \n \n As we sat talking, the telephone rang frequently, and Plimpton, apologizing for the interruption, spoke to the callers with widely varying degrees of enthusiasm, but was consistently polite, urbane and witty. I noticed a hint of an English accent in his voice — the result of his early education at St. Bernard\u0027s School on the Upper East Side, followed much later by four years of study in England. It is easy to imagine him stepping into a boxing ring like an English gentleman, calmly lacing on his gloves for a friendly bout. \n \n Which is precisely what he did in 1959 when, for the purpose of one of his countless stories for Sports Illustrated, he took on Archie Moore, then king of the light heavyweight division, for a three-round exhibition match in New York. Since that time, Plimpton has never lost his interest in boxing. A close friend of Muhammad Ali\u0027s who has followed the champion around the world, he made Ali the chief character of his book Shadow Box, which came out in paperback this month from Berkley. As with most of Plimpton\u0027s works, the story is told with an abundance of humor. \n \n Currently at work on three new books, Plimpton emphasized that he writes on many subjects outside of sports. A lifelong friend of the Kennedy family, he has co-authored an oral history volume titled American Journey: The Times of Robert F. Kennedy. He is an associate editor of Harper\u0027s magazine and a regular contributor to the International Food \u0026 Wine Review. His first love, in fact, seems to be not sports at all, but the Paris Review, a magazine for up-and-coming serious writers that he has edited since its creation in 1953. One of the most important literary magazines in the English-speaking world, the Paris Review is published four times a year as a 175-page journal devoted almost exclusively to fiction and poetry. \n \n His hair is mostly silver now, and there are creases starting to appear on his ruggedly handsome face, but Plimpton, at 52, is still the same larger than-life, charismatic figure he has been since he came to national attention in 1961 with the publication of Out of My League, a book about his foray into major league baseball. Paper Lion (1966), which told of his brief career as a quarterback with the Detroit Lions, cemented his reputation as the nation\u0027s most realistic sportswriter. His other books include The Bogey Man, One More July, and Mad Ducks and Bears. As a lecturer, he is in demand all over the country. He and his wife Freddy have been married for 11 years. \n \n Born in New York City, he grew up around 98th Street and 5th Avenue, attended Harvard University (where he edited the Harvard Lampoon), and spent three years in the Army before heading for England to study at King\u0027s College, Cambridge. During an Easter vacation there, he joined some friends in Paris to discuss the launching of the literary magazine he has guided ever since. \n \n In 1979, said Plimpton with a grin, \"I\u0027m supposed to manage the New York Yankees for a day, and go through the whole procedure of being fired by George Steinbrenner. I hope it\u0027s followed by a beer commercial with Billy Martin.\" \n \n Asked about his attachment to the East Side, Plimpton stressed his fondness for the city as a whole. \"In the last couple of years, there\u0027s been an enormous rebirth of excitement about living in the city. … I think Mayor [Ed] Koch has a lot to do with pulling it up. He seems to fit everywhere. If I saw him twirling up a pancake dough in a pizza shop on Broadway, or driving a 5th Avenue bus, or carrying a briefcase into 20 Exchange Place, I wouldn\u0027t be surprised. He\u0027s a quintessential New Yorker.\" \n \n When my visit with Plimpton was about to end, I couldn\u0027t resist testing him with my favorite sports question: \"Who was the only man to play for the Boston Red Sox, the Boston Patriots and the Boston Bruins?\" He couldn\u0027t guess. The answer, I told him, was a guy named John Kiley, who played the national anthem on the organ. \n \n But Plimpton got the last word in. \n \n \"Who was the only man to play for the Boston Bruins and the Boston \n Celtics?\" he asked. I said I didn\u0027t know. He smiled and replied: \"George \n Plimpton.\" \n \n \n","sourceLink":"http://novel.tingroom.com/mingren/1506/44993.html","bookId":46,"book":{"id":46,"title":"100 New Yorkers of the 1970s","description":"简介： 《百位1970年代纽约人》出版于2005年，是由作者麦克斯米勒德为纽约本地报纸《电视信息报》所写的210篇人物专访中精选出一百篇结册，采访对象多为艺术界和娱乐界名人。人物专访往往具有一定的时效性，涉及诸多时代背景要素，会提及各种人物、地点、组织、事件等等。因此...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/1506","creation":"Aug 1, 2019 12:18:13 AM","modification":"Aug 1, 2019 12:18:13 AM"}}
