{"id":1313,"no":75,"title":"WESTSIDER BUDDY RICH","content":"WESTSIDER BUDDY RICH \\n\\n Monarch of the drums \\n\\n \\n\\n 1-5-80 \\n\\n \\n\\n \"Mediocrity has no place in my life,\" says fast-talking, hard-driving Buddy Rich, wrapped in a bathrobe at his luxurious Westside apartment. \"Anybody who is expert at what they do, I admire, whether it\u0027s drumming, tennis, or whatever. If they do it at the top of their form, constantly, I become a fan.\" \\n\\n \\n\\n Dragging deeply on his cigarette, the man whom critics and fellow jazz artists have frequently called the greatest drummer in the world — perhaps of all time — dismisses such labels with something approaching annoyance. \\n\\n \\n\\n \"I don\u0027t think anybody is the best of anything in the world. Babe Ruth\u0027s record was broken, Joe Louis was knocked out. … I\u0027d rather not be the world\u0027s greatest anything. I\u0027d rather be what I am, which is a good drummer.\" \\n\\n \\n\\n It is an unexpected statement to come from a bandleader and drummer known more for arrogance than modesty, but in an hour-long interview, Buddy\u0027s complex personality unfolds itself in all its richness, and he proves to be far more than a flamboyant, free-thinking musician who pulls no punches. \\n\\n \\n\\n In Buddy\u0027s hands, a snare drum comes to life: it whispers, shouts, purrs, snarls, chuckles, gasps or roars, as the mood of the music strikes him. He began playing in 1921 at the age of 4, when his parents — vaudeville actors from Brooklyn — included him in their act and then made him the star. By the age of 7 he had toured the world as \"Traps, the Drum Wonder.\" At 15, he was second only to Jackie Coogan as the highest-paid child performer in America. He began recording in 1937, joined bands headed by Artie Shaw and Tommy Dorsey, and finally formed his own band in 1946. Over the next 20 years, as both a drummer/bandleader and as the highest-paid sideman in the business, he made hundreds of recordings with some of the biggest names in the history of jazz — Charlie Parker, Dizzy Gillespie, Oscar Peterson, Lionel Hampton, Count Basie, Harry James, Thelonius Monk. \\n\\n \\n\\n Then in 1966 he formed his current band, the 15-man Buddy Rich Orchestra. In December he brought the band to the chic, newly remodeled Grand Finale on West 70th Street. Seated at his drums in the center of the orchestra, he effortlessly mixes snare, tom-tom, bass drum and cymbals in a whirling, benumbing mass of sound. \\n\\n \\n\\n Back in his huge living room, which is decorated much like a summer house in Newport, Rhode Island, Buddy says that his nightclub gigs are rare. \"We do about nine months on the road, which includes Europe and the Orient. All the cities of this country. Most of the tours I\u0027m on are 90 percent concert halls and schools. … The main reason is educational. It\u0027s good for the young people to discover all of a sudden that music isn\u0027t just a guitar and a drum and a bad out-of-tune singer. … I think as young people become more sophisticated in their tastes, they begin to realize that jazz is just as high an art form as classical music.\" \\n\\n \\n\\n One of his chief gripes about jazz in America, he explains in a voice as rough as sandpaper, is that \"during the season you might see 15 or 20 award shows on television dedicated to country and western slop, but you\u0027ll never see a jazz presentation in its true form. When there\u0027s an extended piece of music, they usually cloud it up with dancing girls and trick lighting and anything that distracts from the music, instead of presenting the music as the attraction, the way they do in Europe.\" \\n\\n \\n\\n Another sore spot is the 55-mile-per-hour speed limit. \"I\u0027m heavily into sports cars; I used to race long ago. I find that the restrictions placed on us today are insane, contradictory, and hypocritical. … I don\u0027t know anyone on the highway who actually does 55 miles an hour, and it\u0027s just another way of making money for the state or the local community, and I think it\u0027s no better than a *ing stickup!\" \\n\\n \\n\\n He doesn\u0027t keep any drums in the apartment, and never practices. \"I want my days to be as a man, and I want my nights to be as a working man. In the day, I exercise, I do karate — I have a black belt — and totally disengage myself from the person I am at night.\" His apartment is shared by Buddy\u0027s wife Marie and their 25-year-old daughter Cathy, a singer. \\n\\n \\n\\n \"My wife is just as beautiful today as she was the day I married her,\" Buddy says proudly. \"She used to be in pictures, but she gave it up when we married. Now she\u0027s a wife and a female and a woman, and she\u0027s not into ERA and she\u0027s not into \u0027I got my thing man and you got your thing.\u0027 She\u0027s a woman, and wears dresses so that I know she\u0027s a woman. That\u0027s what I like.\" \\n\\n \\n\\n He often performs free at prisons and hospitals, but refuses to give details. \"I do these things for the good that it does for me,\" he asserts. \"To have someone write about it takes the goodness away from it. I\u0027d rather not have anybody know what I do as long as I know.\" \\n\\n \\n\\n Buddy suffered a heart attack in 1959 and has had others since, but apart from giving up liquor, he has made few adjustments in his whirlwind lifestyle. \"I really don\u0027t think of past illnesses,\" he declares. \"I think I\u0027m healthier and stronger today than I\u0027ve ever been in my life. I smoke more now, and I run around more, and I do more exercise. I don\u0027t put too much reality into warnings about \u0027don\u0027t do this and don\u0027t do that.\u0027 Do what you have to do, and do it. If you cut out — it was time.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/mingren/1506/45000.html","bookId":46,"book":{"id":46,"title":"100 New Yorkers of the 1970s","description":"简介： 《百位1970年代纽约人》出版于2005年，是由作者麦克斯米勒德为纽约本地报纸《电视信息报》所写的210篇人物专访中精选出一百篇结册，采访对象多为艺术界和娱乐界名人。人物专访往往具有一定的时效性，涉及诸多时代背景要素，会提及各种人物、地点、组织、事件等等。因此...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/1506","creation":"Aug 1, 2019 12:18:13 AM","modification":"Aug 1, 2019 12:18:13 AM"}}
