{"id":1327,"no":89,"title":"EASTSIDERS TOM \u0026 DICK SMOTHERS","content":"EASTSIDERS TOM \u0026 DICK SMOTHERS \n Stars of I Love My Wife on Broadway \n \n 2-17-79 \n \n As the Smothers Brothers, they were perhaps the funniest, most original American music and comedy team to come out of the 1960s. Their 10 albums sold in the millions, and for three seasons they had the most controversial show on television, The Smothers Brothers Comedy Hour. When CBS abruptly canceled their contract in 1969 for seemingly political reasons, they became a cause celebre by suing the network and winning a million dollars in damages. After 18 years of performing together as a team, they retired their act in December, 1976, saying that their brand of satire had been \"stated,\" and that repetition would bore them. The brothers parted on friendly terms, each determined to make his mark separately as an entertainer. \n \n This past Labor Day, they were reunited as a comedy team — not on television or in a nightclub, but on the stage of the Ethel Barrymore Theatre on West 47th Street, where they instantly breathed new life into the long-running musical I Love My Wife. Cast in the roles of two would-be wife swappers from Trenton, New Jersey, they insisted on being billed not as the Smothers Brothers, but as Dick and Tom Smothers. However, anyone who laments the demise of the Smothers Brothers act should catch the show before the six-month contract runs out on March 4. Dick Smothers, as Wally, a smooth-talking pseudo-sophisticate, and Tom Smothers, as his naive, bumbling friend Alvin, a moving man, wear their roles as if they had been written for no one else. \n \n \"I like theatre and I\u0027m going to do more of it,\" said Tom, 42, during a recent dressing room interview after a matinee performance. His brother Dick, 40, had other plans. \"As soon as this show is over, I have to go back to California and do some bottling for my winery. And I want to do more auto racing. I race for American Motors. As far as making a career in acting on Broadway: no. I think I could work at it and become a fairly decent actor, but while I\u0027m making wine, I want to play in cabaret theatre and dinner theatre. It\u0027s fun, and it keeps you sharp. Broadway isn\u0027t a place you should learn. What we\u0027re doing is apprenticing on Broadway. \n \n \"But that\u0027s how we got our television show,\" protested Tom. \"We\u0027d never done a television show before.\" \n \n In spite of the box office success of their Broadway debut, Dick cannot help feeling disappointed that, as always, he is cast as the straight man. His character Wally is a foil to the lovable, slow-witted Alvin. \"There\u0027s not a whole lot to do with Wally,\" said Dick, pouring me a glass of his Smothers white Riesling wine. \"The fact is, everyone is pretty locked in except for Alvin. We\u0027re all dancing around him.\" \n \n Tom\u0027s only complaint about the show is that it has put a strain on his health, and especially on his throat. \"This is the first time I\u0027ve been close to the edge of anxiety healthwise,\" he confided, sipping hot tea with lemon. \"As soon as I arrived n New York I got tonsillitis. Now I have insomnia. Antibiotics really drain your body. I\u0027ve lost 15 pounds so far. It\u0027s a very demanding part physically.\" \n \n Both brothers seemed very serious offstage, although Tom went through his full range of marvelous mug expressions as he answered the questions and posed for photos. Asked about how his current salary compares to what he has earned previously, he replied: \"Broadway you do for love of the craft. The money is nothing to what you can make in film. You do it because not many actors can do theatre.\" Dick commented: \"Some of the big stars in Las Vegas get 20 to 30 times what we\u0027re making. It\u0027s the prestige and the experience.\" \n \n Tom and Dick were born on Governor\u0027s Island in New York Harbor. Their father, an Army major, died in the Philippines near the end of World War II. Their mother then took them to the West Coast, and when Tom was 12, she gave him a guitar. \"I wanted to be a bandleader first, then a comedian,\" he recalled. \"At San Jose State, I was in a trio, and we needed a tenor. So I got Dickie to come to school.\" While still in college, they played their first professional engagement as the Smothers Brothers at San Francisco\u0027s Purple Onion nightclub and got four encores. Before long, Jack Paar invited them on The Tonight Show, and their career was assured. \n \n One thing that is particularly touching about Tom and Dick Smothers is the great affection they have for each other. They live in separate Upper East Side apartments about a mile apart, but Dick drives Tom to the theatre each day, and they frequently socialize together. \n \n Tom\u0027s mind is currently on a 19th-century farce, Nothing but the Truth, which he plans to start rehearsing this fall and hopes to eventually bring to Broadway. Dick, meanwhile, is thinking more about the jeep he recently won in a celebrity auto race. \"I\u0027m going to drive it home to Santa Cruz,\" he commented, with obvious satisfaction. \"It has four-wheel drive, bush guards, a roll bar, and heavy off-road tires. It\u0027s perfect for Manhattan.\" \n \n \n","sourceLink":"http://novel.tingroom.com/mingren/1506/45034.html","bookId":46,"book":{"id":46,"title":"100 New Yorkers of the 1970s","description":"简介： 《百位1970年代纽约人》出版于2005年，是由作者麦克斯米勒德为纽约本地报纸《电视信息报》所写的210篇人物专访中精选出一百篇结册，采访对象多为艺术界和娱乐界名人。人物专访往往具有一定的时效性，涉及诸多时代背景要素，会提及各种人物、地点、组织、事件等等。因此...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/1506","creation":"Aug 1, 2019 12:18:13 AM","modification":"Aug 1, 2019 12:18:13 AM"}}
