{"id":1332,"no":94,"title":"EASTSIDER ARNOLD WEISSBERGER","content":"EASTSIDER ARNOLD WEISSBERGER \n Theatrical attorney for superstars \n \n 9-29-79 \n \n What do Leonard Bernstein, Helen Hayes, Otto Preminger, Carol \n Channing, Truman Capote and George Balanchine have in common? \n \n All are giants in the performing arts. And all are — or have been — clients of Arnold Weissberger, one of the world\u0027s foremost theatrical attorneys. Now in his 50th year of practice, the Brooklyn-born, Westside-raised Weissberger has been representing stars ever since a chance encounter brought Orson Welles to his office in 1936. \n \n \"Most of my clients are involved in making contracts that have to do with plays or films or television,\" says Weissberger on a recent afternoon. The scene is his small, richly furnished law firm in the East 50s. Dressed in a dark suit, with a white carnation in his buttonhole to match his white mustache, Weissberger looks very much like the stereotype of a business tycoon. \"Part of my job,\" he continues, \"is to be familiar with the rules of guilds and unions. And I have to know about the treaties between countries that affect the payment of taxes.\" \n \n Smiling benevolently, his hands folded in front of him, the gentlemanly lawyer quickly proves himself a gifted storyteller. In his upper-class Boston accent, acquired during seven years at Harvard, he delights in telling anecdotes about his favorite performers. Not shy about dropping names, Weissberger drops only the biggest, such as Sir Laurence Olivier — a client who had invited him to lunch the previous day — and Martha Graham. \n \n His work is so crowded that whenever he has to read anything that is longer than three pages, he puts it in his weekend bag. Yet Weissberger devotes an hour or two every day to one of several philanthropic organizations. At the top of his list is the Martha Graham Center of Contemporary Dance, of which he is co-chairman. \"I consider her one of the three great seminal figures in the arts in the 20th century, and I prize her friendship enormously.\" The other two outstanding artistic figures of the century, he says, are \"Stravinsky, who it was also my privilege to represent, and Picasso, who I did not represent.\" \n \n He serves as chairman of the New Dramatists, a group that nurtures young playwrights; he is a board member of Fountain House, a halfway house for ex-mental patients; and he is chairman of the Theatre and Music Collection of the Museum of the City of New York. \n \n On Monday through Thursday, Weissberger lives in a luxurious Eastside apartment that he shares with his longtime friend, theatrical agent Milton Goldman. Each Friday after work, Weissberger departs for Seacliff, Long Island, where he owns a house overlooking the ocean. Goldman and Weissberger, whose careers have run a parallel course during the 35 years of their acquaintance, travel widely each summer, generally spending a month in London, where both have many clients. \n \n \"Our interests are very similar, except that I am an opera buff, and Milton is not. He\u0027s a realist. I started going to opera when I was 10 years old, so I don\u0027t mind if a 300-pound soprano dies of consumption in Traviata, as long as she sings beautifully.\" \n \n An avid art collector, Weissberger buys only what he has room to display on the walls of his home and office. For the past 30 years his chief hobby has been photography. He has published two volumes of his work — Close Up (1967) and Famous Faces (1971). Although he has never taken a photography course, and never uses flash, he captures the essence of his subjects through his rapport with them. \"I have discussed the possibility of doing a photo book of children I\u0027ve taken around the world,\" he notes. \"And now, of course, I have enough photos for a second volume of famous faces.\" \n \n His vigorous appearance to the contrary, Weissberger claims to get little exercise. \"I have one of those stationary bicycles at home, but I\u0027ve never gotten round to using it. And I\u0027ve got to do so before I next see my doctor, or I won\u0027t be able to face him. … It\u0027s interesting how doctorial advice changes. I remember several years ago, it was not considered a good idea for people who were no longer young to climb stairs, and now my doctor says that climbing stairs is the best thing I can do for my constitution.\" \n \n So closely connected are the various aspects of his life that Weissberger is able to say: \"There\u0027s no demarcation between my workday and my play day. People ask me when I\u0027m going to retire, and I say there\u0027s no need for me to retire, because I enjoy my work so much. I become part of people\u0027s lives. I become privy to their problems. It is, in many ways, an extension, an enhancement of my own life to be able to participate in the lives of my clients. I remember a few months ago, when Lilli Palmer was sitting right there, and I said, \u0027Lilli, what a lucky person I am. I\u0027m having to do a tax return and I\u0027m doing it for Lilli Palmer.\u0027 Because there sat this beautiful, charming, intelligent, lovely lady, and I was representing her professionally. For me, I can\u0027t think of any profession that could possibly be more rewarding.\" \n \n \n","sourceLink":"http://novel.tingroom.com/mingren/1506/45039.html","bookId":46,"book":{"id":46,"title":"100 New Yorkers of the 1970s","description":"简介： 《百位1970年代纽约人》出版于2005年，是由作者麦克斯米勒德为纽约本地报纸《电视信息报》所写的210篇人物专访中精选出一百篇结册，采访对象多为艺术界和娱乐界名人。人物专访往往具有一定的时效性，涉及诸多时代背景要素，会提及各种人物、地点、组织、事件等等。因此...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/1506","creation":"Aug 1, 2019 12:18:13 AM","modification":"Aug 1, 2019 12:18:13 AM"}}
