{"id":84961,"no":1,"title":"Page 1","content":"FOREWORD\n UNTIL WE BURN is a novella to introduce Dominic Kinkaide, the main character from BEFORE WE FALL.\n This novella is intended to illustrate Dominic’s lifestyle, his behavior and his mindset which will enhance his character as you read BEFORE WE FALL. Because his lifestyle is a bit wild, this novella will contain explicit language and adult content.\n If you like a bad boy, you’ll love Dominic. I’ve always found this to be true: The badder they are, the harder they fall. Dominic will prove this notion in BEFORE WE FALL. He’ll fall hard….eventually.\n But until then, he’s immersed in his bad boy ways. I hope you enjoy UNTIL WE BURN.\n Chapter One\n “Harder,” the girl whispers. Obligingly, I slap her ass again. Hard.\n The stinging sound echoes through the night, rippling through the silence of Mount Lee. A hundred feet below, the giant letters of the Hollywood sign gleam ghostly white in the darkness.\n I smile against the back of the girl’s pale neck and bite it. Hard.\n My teeth sink into her soft flesh, but she likes it. She moans, twisting around so that she can clutch at my chest, twisting her fingers in my tux jacket.\n “Dominic,” she sighs. “I can’t believe I’m here with you right now. Dominic Kinkaide is slapping my ass.”\n “Dominic Kinkaide is doing more than that to your ass,” I point out, remembering how I’d just pulled out of it a minute ago, how I’d rolled off the condom and flicked it away.\n As the coatcheck girl from the black gala event I’d just vacated, she probably had no idea when her evening started that it was going to end like this: with quick, hard anal sex in public….with me.\n Even though it’s two a.m. and it’s unlikely that anyone will be hiking up Hollywood Ridge Trail, the knowledge that they could, the knowledge that strangers might stumble upon us and find us in this intimate situation, turned me on quicker than anything.\n I finished what I set out to do within a few minutes and now, I pull away and adjust my clothes as the girl pulls at her own.\n I don’t know her name.\n Her name doesn’t matter.\n The girl looks up at me, batting her eyelashes. “That was nice. If you want to… you know, um, actually sleep with me, call me, okay? I’ll give you my number.”\n I look at her in amusement. “Actually sleep with you?”\n She looks embarrassed. “I don’t mean like… sleep in my bed overnight. I mean, real sex. Not just… what we did.”\n “Anal?” I raise an eyebrow. We’re both adults here. We can call a spade a spade.\n “Yeah,” she manages to say, her cheeks flushed. “Anal. That’s the first time I’ve ever done that, by the way.”\n That’s what they all say and I have a hard time believing it. This is the twenty-first century after all. I grin at her though, deciding to humor her.\n “And? What’d you think?”\n She bats her eyelashes again, coy now, laying her hand against my chest. “I think that you can do anything you want with me,” she purrs.\n I fight to not roll my eyes at her sticky-sweet tone now. She’s too compliant, too needy, too willing to do anything at all that I ask of her. Why the fuck are they always like this? Are they so desperate to sleep with someone famous, even one single time, that they’ll do anything for it?\n Nine times out of ten, the answer is yes.\n And nine times out of ten, I capitalize on that. I’d be an idiot if I didn’t.\n But to be honest, the whole thing is getting tiresome. I’m weary of it. I’m weary of the shallow people, I’m weary of people using other people, I’m weary of easy women who constantly throw themselves at me.\n They only want to say “I was with Dominic Kinkaide.” They want to claim a tiny piece of me, no matter how small that piece or moment was.\n In this case, Coatcheck Girl will be able to say that she claimed ten minutes of my time. But from the look on her face, the wonderstruck expression, that ten minutes was enough.\n “Won’t Amy be mad at you?” she asks curiously as she runs her fingers through her tangled hair in the dark. She doesn’t sound concerned as she mentions the woman that most people assume is my girlfriend.\n I shake my head at thought of Amy Ashby, a woman whose fame is equal to my own, a woman whose jaded outlook on life surpasses even my own. She’s beautiful, successful and savvy.\n She’s also a cold-hearted bitch. It’s one of things I like about her.\n “For one thing, Amy and I aren’t exclusive,” I answer, turning to walk back toward my car. “And for the other, it’s not your business.”\n My voice is cool now. I’m not rude, just matter of fact. It’s just a way of my life. I have to constantly try to keep people at arm’s length, out of reach and out of my business. It’s a full-time job. Actually, it’s several people’s full-time jobs. I employ an entire staff of publicity people for this very reason.\n “Shall we?” I ask politely, holding out my elbow to the girl. I’m a gentleman now, something that women adore about me.\n I’m an actor. I can be whatever they want me to be, I morph into whatever role I’m playing, whether I’m on-screen or off. On-screen, I’ve been a serial killer, rapist, romantic, misunderstood, vampire and poet.\n Off-screen, the role I play the best is that of an asshole.\n The girl smiles up at me now and I can see that this one simple gesture took the sting out of me telling her to mind her own business.\n “Will you call me?” she asks hesitantly as I help her into my slate gray Porsche.\n “Probably not,” I answer honestly as I close her door, still the gentleman. Gentlemen are polite. Gentlemen use manners and most importantly, gentlemen are honest. I’m almost always honest.\n “Seriously?” she stares at me as drop into the driver’s seat.\n “Seriously,” I nod. “Not because I won’t want to, but because this isn’t the kind of life that would be good for you. If you were linked to me in any way, the press would hunt you down, stalk you, photograph you, and pretty much drive you insane. Trust me, it’s for your own good. I won’t call you because I want to you protect you from that.”\n Lie.\n Okay, fine. I’m not always honest.\n And I’m not always a gentleman.\n I stare at the road in front of me as I drive down the winding trail. The engine of my 911 revs around each curve as the tires hug the road.\n “OK. That makes sense,” the girl nods, buying every bit of my line of shit. “Well then, can I call you?”\n “That probably wouldn’t be a good idea either,” I answer bluntly. “But it was nice being together tonight, wasn’t it? I had fun.”\n From my periphery, I see her shoulders slump as she realizes what I’m saying. But what the fuck did she expect? She handed me my coat and offered herself to me on a platter. Did she expect a long-term relationship?\n “Oh well,” she says with forced brightness. “You’re right. It was fun. Can I at least have an autograph?”\n “Of course,” I tell her. “It would be my pleasure.”\n A few minutes later, after we glide to a stop outside of the Shangri-La hotel where she works, I scribble my name on a piece of paper and hand it to her.\n “Thanks, Dominic,” she murmurs, staring me in the eye. “If you change your mind, you know where to find me.”\n I nod and she gets out. I barely glance in her direction before I drive away, although I know that she’s standing on the sidewalk watching me disappear into traffic. They always do.\n Deep down, I should feel guilty. I should feel bad. And once in a while, every once in a blue moon, I do. But then I stomp the shit out of that emotion and put it out of my mind.\n These girls throw themselves at me, not the other way around.\n I’m only giving them what they want.\n It’s a public service, really.\n But none of them, not one, will ever see the real Dominic Kinkaide. In fact, I’m not even sure that he exists anymore.\n I might’ve been successful in drowning out his existence in a barrage of women, kink and whiskey.\n As I drive toward my home overlooking Hollywood Hills, my phone buzzes in my pocket. Pulling it out, I see Amy Ashby’s name flash on the screen.\n I sigh, debating whether or not to answer it.\n Yes, she understands me… or at least, the part of me that is like her. The part that has to shield itself from the public. And yes, I like that she’s bitchy and tough. I admire it because I always know where she stands. But sometimes, like tonight, I’m just not in the mood for it.\n I answer the call anyway.\n “Why did you leave the gala so fast?” Amy complains into the phone, forgoing a greeting. “I wanted to ride home with you. My brother was boring me.”\n Amy’s older brother Sam was the host of the event tonight, in an effort to raise money for autism. He’s as different from Amy as he can be: kind, considerate and normal. Because of those things, he’s not in show business.\n I shake my head, although she can’t even see me. “Because I was tired of the whole thing,” I answer, not mentioning the coat check girl. “You could’ve left with me.”\n Lie. Amy’s a freak in the sack, but she wouldn’t have enjoyed being with a coat-check girl. She likes to think she has standards. \n","sourceLink":"https://allnovel.net/until-we-burn-beautifully-broken-2-5/page-1.html","bookId":2760,"book":{"id":2760,"title":"Until We Burn (Beautifully Broken #2.5)","description":"Storyline: \n Until We Burn (Beautifully Broken #2.5) \n Dominic Kinkaide does bad, bad things. \n As a 24-year old actor with the world on a string, not many women tell Dominic no. In a life where no doesn’t exist, he stretches the boundaries between what is right, what is wrong and what is downright depraved. Dark and damaged, Dom wants no commitments. \n He wants no attachments. \n He only wants to disappear into the taboo, into a place where he feels something. \n Anything. \n But when the aching need to disappear into the darkness is the only thing he has left, Dominic flounders. In a world that is hollow and sexual, without a guiding light or a reason to breathe, Dominic is lost and broken. He knows he’ll never be fixed. So he makes a decision. \n If he’s going to hell, he might as well make it worth it.\n \n","cover":"https://allnovel.net/images/until-we-burn-beautifully-broken-2-5.jpg","author":"Courtney Cole","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/until-we-burn-beautifully-broken-2-5.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 5:03:52 PM"}}
