{"id":32643,"no":14,"title":"Chapter 14","content":"Now the harvest had been gathered; apples hung red and heavy on the trees, and the maples blazed like torches against endless blue skies. Sycamores and birches burned gold, and the sumac’s red deepened until it looked almost black. Every morning each blade of grass was edged in frost; it gleamed and glistened until it was melted by the rising sun. The passion of the autumn colors never had been so intense, Molly thought. How the light under the maples changed! And the pale glow that surrounded the sycamores! “Molly?” Miriam’s voice roused her from the window, and she turned reluctantly. “Molly, what are you doing?” “Nothing. Thinking of the work for today.” Miriam paused. “Will it take you much longer? We miss you.” “I don’t think so,” Molly said, and started for the door. Miriam moved slightly; her movement was enough to make Molly stop again. “Another two or three weeks,” Molly said quickly, not wanting Miriam’s hand on her arm. Miriam nodded, and the moment passed when she could have touched Molly, could have held her. She felt baffled. Again and again when she would have embraced Molly, the moment passed, just as it now had, and they stood apart, not touching. Molly left her in the large room, and presently Miriam walked to the hospital. “Are you too busy?” she asked, standing in the doorway to Ben’s office. “I would like to talk with you.” “Miriam?” The inflection was automatic, as was her slight nod. Only Miriam would come alone; a younger sister would have been accompanied by her. “Come in. It’s about Molly, isn’t it?” “Yes.” She closed the door and sat down opposite his desk. His desk was covered with papers, notes, his medical notebook that he had carried on the trip with him. She looked from the papers to the man, and thought he was different too. Like Molly. Like all of them who had gone away. “You told me to come back if it didn’t get better,” she said. “She’s worse than before. She’s bringing unhappiness to all the sisters. Can’t you do something for her?” Ben sighed and leaned back in his chair and looked at the ceiling. “It’s going to take time.” Miriam shook her head. “You said that before. How is Thomas, and Jed? How are you?” “We’re all coming around,” Ben said, smiling slightly. “She will too, Miriam. Believe me, she will.” Miriam leaned toward him. “I don’t believe you. I don’t think she wants to come back to us. She’s resisting us. I wish she hadn’t come back at all if this is how she’s going to be from now on. It’s too hard on the other sisters.” She had become very pale, and her voice shook; she turned away from him. “I’ll speak to her,” Ben said. Miriam drew a piece of paper from her pocket. She unfolded it and put it on his desk. “Look at that. What does it mean?” They were the caricatures Molly had sketched of the brothers early in the trip. Ben studied them, the one of himself in particular. Was he really that grim-looking? That determined? And surely his eyebrows were not that heavy and menacing? “She’s mocking us! Mocking all of you. She has no right to make fun of our brothers like that,” Miriam said. “She’s watching all the time, watching her sisters as they work and play. She won’t participate unless I give her wine, and even then I can feel a difference. Always watching us. Everyone.” Ben smoothed the sketch paper and asked, “What do you propose we do, Miriam?” “I don’t know. Make her stop working on the drawings of the trip. That’s keeping her mind on it, on what happened. Make her join her sisters in their daily work, as she used to. Stop letting her isolate herself for hours in that small room.” “She has to be alone to do the drawings,” Ben said. “Just as I have to be alone to write my report, and Lewis has to be alone to assess the capabilities of the boat and the changes needed in it.” “But you and Lewis, the others, are all doing it because you must, and she is doing it because she wants to. She wants to be alone! She looks for excuses to be alone, and she’s working on other things, not just the trip drawings. Make her let you in that room, let you see what else she’s been doing!” Ben nodded slowly. “I’ll see her today,” he said. After Miriam had gone, Ben studied the sketches again, and he smiled slightly. She certainly had captured them, he thought. Cruelly, coldly, and accurately. He folded the paper and put it in his leather pouch, and thought about Molly and the others. He had lied about Thomas. He wasn’t back to normal, and might never be normal again. He had become almost totally dependent on his brothers. He refused to be separated from them even momentarily, and he slept with one or another of them every night. Jed was somewhat better, but he too showed a need for constant reassurance. Lewis seemed virtually untouched by the voyage. He had stepped out of this life and back into it almost casually. Harvey was nervous, but less so than he had been a week ago, much less than when he first rejoined his brothers. Eventually he would be well. And he, Ben. What about Ben? he asked himself mockingly. He was recovered, he decided. He went to talk to Molly. She had a room in the hospital administration wing. He tapped lightly at the door, then opened it before she answered. They so seldom closed doors, rarely in the day, but it seemed natural for her to have closed her door, just as he felt it natural to close his when he was working. He stood for a moment looking at her. Had she slid something under the paper that lay on her drawing board? He couldn’t be certain. She sat with her back to the window, the board tilted before her. “Hello, Ben.” “Can you spare a few minutes?” “Yes. Miriam sent you, didn’t she? I thought she would.” “Your sisters are very concerned about you.” She looked down at the table and touched a paper. She was different, Ben thought. No one would ever mistake her for Miriam, or another of the sisters. He came around the table and looked at the drawing. Her sketch pad was open to a page filled with small, hastily done line drawings of buildings, ruined streets, hills of rubble. She was doing a full page of one section of Washington. For a moment he had a curious feeling of being there, seeing the devastation, the tragedy of a lost era; Molly had the power to put images from his mind onto paper. He turned and looked out the window at the hills, which were splashes of color now with the sun full on them. Watching him, Molly thought: neither Thomas nor Jed would talk with her at all. Thomas shied away as if she carried plague, and Jed remembered other things, urgent things he had to do. Harvey talked too much, and said nothing. And Lewis was too busy. But she could talk with Ben, she thought. They could relive the trip with each other, they could try to understand what had happened, for whatever had happened to her had happened to him. She could see it in his face, in the way he had turned so abruptly from her drawing. Something lay within him, ready to awaken, ready to whisper to him, if he would let it, just as it lay within her and changed the world she saw. It spoke to her, not in words, but in colors, in symbols that she didn’t understand, in dreams, in visions that passed fleetingly through her mind. She watched him where he stood, with the sun shining on him. Light fell on his arm in a way that made each hair gleam golden, a forest of golden trees on a brown plain. He shifted and the twilight on the plain turned the trees black. “Little sister,” he began, and she smiled and shook her head. “Don’t call me that,” she said. “Call me . . . whatever you want, but not that.” She had disturbed him; a frown came and went, leaving his face unreadable. “Molly,” she said. “Just call me Molly.” But now he couldn’t think what it was he had started to say to her. The difference was in her expression, he thought suddenly. Physically she was identical to Miriam, to the other sisters, only the expression was changed. She looked more mature, harder? That wasn’t it, but he thought it was close to what he meant. Determined. Deeper. “I want to see you on a regular basis for a while,” Ben said abruptly. He hadn’t started to say that at all, hadn’t even thought of it until he said it. Molly nodded slowly. Still he hesitated, puzzled about what else he might say. “You should set the time,” Molly said gently. “Monday, Wednesday, Saturday, immediately after lunch,” he said brusquely. He made a note in his book. “Starting today? Or should I wait until Monday?” She was mocking him, he thought angrily, and snapped his book shut. He wheeled about and strode to the door. “Today,” he said. Her voice held him at the door. “Do you think I’m losing my mind, Ben? Miriam does.” He stood with his hand on the knob, not looking at her. The question jolted him. He should reassure her, he knew, say something soothing, something about Miriam’s great concern, something. “Immediately after lunch,” he said harshly, and let himself out. Molly retrieved the paper she had slid under the Washington drawing and studied it for a time with her eyes narrowed. It was the valley, distorted somewhat so that she could get in the old mill, the hospital, and the Sumner house, all lined up in a way that suggested relatedness. It wasn’t right, however, and she couldn’t decide what was wrong. There were faint marks where the people were to go in the drawing, a cluster of them at the mill, more at the entrance to the hospital, a group in the field behind the old house. She erased the marks and sketched in, very lightly, a single figure, a man, who stood in the field. She drew another figure, a woman, walking between the hospital and the house. It was the size of everything, she thought. The buildings, especially the mill, were so large, the figures so small, dwarfed by the things they had made. She thought of the skeletons she had seen in Washington; a body reduced to bones was smaller still. She would make her figures emaciated, almost skeletal, stark . . . Suddenly she snatched up the paper, crumpled it into a ball, and threw it into the wastecan. She buried her face in her arms. They would have a “Ceremony for the Lost” for her, she thought distantly. The sisters would be comforted by the others, and the party would last until dawn as they all demonstrated their solidarity in the face of grievous loss. In the light of the rising sun the remaining sisters would join hands, forming a circle, and after that she would cease to exist for them. No longer would she torment them with her new strangeness, her apartness. No one had the right to bring unhappiness to the brothers or sisters, she thought. No one had the right to exist if such existence was a threat to the family. That was the law. She joined her sisters for lunch in the cafeteria, and tried to share their gaiety as they talked of the coming-of-age party for the Julie sisters that night. “Remember,” Meg said, laughing mischievously, “no matter how many offers we get, we refuse all bracelets. And whoever sees the Clark brothers first slips on a bracelet before he can stop her.” She laughed deep in her throat. Twice they had tried to get to the Clark brothers and twice other sisters had beaten them. Tonight they were separating, to take up posts along the path to the auditorium to lie in wait for the young Clark brothers, whose cheeks were still downy, who had crossed the threshold into adulthood only that autumn. “They’ll all cry ‘Unfair!’ ” Miriam said, protesting feebly. “I know,” Meg said, laughing again. Melissa laughed with her and Martha smiled, looking at Molly. “I’m to be at the first hedge,” she said. “You wait by the path to the mill.” Her eyes sparkled. “I’ve got the bracelets all ready. They’re red, with six little silver bells tied in place. How he’ll jingle, whoever gets the bracelet!” The six bells meant all the sisters were inviting all the brothers. All over the cafeteria groups were huddled just like this, Molly thought, glancing about. Small groups of people, all conspiring, planning their conquests with glee, setting traps . . . Look-alikes, she thought, like dolls. The Julie sisters had blond hair, hanging loose and held back with tiaras made of deep red flowers. They had chosen long tunics that dipped down low in the back, high in the front in drapes that emphasized their breasts charmingly. They were shy, smiling, saying little, eating nothing. They were fourteen. Molly looked away from them suddenly and her eyes burned. Six years ago she had stood there, just like that, blushing, afraid and proud, wearing the bracelet of the Henry brothers. The Henry brothers, she thought suddenly. Her first man had been Henry, and she had forgotten that. She looked at the bracelet on her left wrist, and looked away again. One of the sisters had gotten to Clark first, and later Molly and her sisters would play with the Clark brothers on the mat. So smooth still, their faces were as smooth as the Julie faces. People were trying to match up the bracelets now, and there was much laughter as everyone milled about the long tables and made excuses to examine each other’s bracelets. “Why didn’t you come to my office this afternoon?” Molly whirled about to find Ben at her elbow. “I forgot,” she said. “You didn’t forget.” She looked down and saw that he still wore his own bracelet. It was plain, grass braided without adornment, without the brothers’ symbol. Slowly, without looking at him, she began to pluck the silver bells from her own bracelet and when there was only one left on it, she slipped the bracelet off her wrist and reached out to put it on his. For a moment he resisted, then he held out his hand and the bracelet slid over his knuckles, over the jutting wrist bone. Only then did Molly look into his face. It was a mask—hard, unfamiliar, forbidding. If she could peel off the mask, she thought, there would be something different. Abruptly Ben nodded, and turned and left her. She watched him go. Miriam and the others would be angry, she thought. Now there would be an extra Clark brother. It didn’t matter, but Miriam had counted on all of them to participate, and now it would be uneven. The Julie sisters were dancing with the Lawrence brothers, two by two, and Molly felt a pang of sadness suddenly. Lewis was fertile, perhaps others of his group were also. If one of the Julie sisters conceived and was sent to the breeders’ compound, the next party for them would be the Ceremony for the Lost. She watched them and couldn’t tell which man was Lewis, which Lawrence, Lester . . . She danced with Barry, then with Meg and Justin, then with Miriam and Clark, and again with Meg and Melissa and two of the Jeremy brothers; not with Jed, though, who stood against the wall and watched his brothers anxiously. He still wore his own bracelet. The other brothers had an assortment of bracelets on their wrists. Poor Jed, Molly thought, and almost wished she had given hers to him. She sat with Martha and Curtis and ate a minced-beef sandwich and drank more of the amber wine that made her head swim delightfully. Then she danced with one of the Julie sisters, who was looking solemn now as the hour grew late. Presently the Lawrence brothers would claim them for the rest of the night. The music changed. One of the Lawrence brothers claimed the girl Molly had danced with; the girl looked at him with a timid smile that appeared, vanished, appeared again. He danced her away. Molly felt a tap on her arm, and turned to face Ben. He was unsmiling. He held out his arm for her and they danced, not speaking, neither of them smiling. He danced her to the table, where they stopped and he handed her a small glass of wine. Silently they drank, and then walked together from the auditorium. Molly caught a glimpse of Miriam’s face as they left. Defiantly she held her back stiffer, her head higher, and went out into the cold night with Ben.","sourceLink":"http://novel.tingroom.com/kehuan/340/651.html","bookId":315,"book":{"id":315,"title":"迟暮鸟语 Where Late the Sweet Birds Sang","description":"简介： Where Late the Sweet Birds Sang is a science fiction novel by Kate Wilhelm, published in 1976. Parts of it appeared in Orbit 15 in 1974. It was the recipient of the Hugo Award for Best Novel in 1977, and was nominated for the Nebula Award f...","cover":"http://novel.tingroom.com/uploads/110713/1-110G3144003D3.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/340","creation":"Aug 1, 2019 12:18:31 AM","modification":"Aug 1, 2019 12:18:31 AM"}}
