{"id":32648,"no":19,"title":"Chapter 19","content":"The cold hand squeezed harder. Molly felt for the door-frame behind her and held it tightly. “Why do you come here?” she whispered. “Why?”\n “It’s all your fault! You spoiled everything. They laugh at me and lock me up. . .”\n “And you still come here. Why?”\n Suddenly he darted to the workbench and swept it clean. The elephant, the heads, the foot, hands, everything crashed to the floor and he jumped up and down on the pieces, sobbing incoherently, screaming sounds that were not words. Molly didn’t move. The rampage stopped as abruptly as it began. Mark looked down at the gray dust, the fragments that remained.\n “I’ll tell you why you come back,” Molly said quietly. She still held the doorframe hard. “They punish you by locking you up in a small room, don’t they? And it doesn’t frighten you. In the small room you can hear yourself, can’t you? In your mind’s eye you see the clay, the stone you will shape. You see the form emerging, and it is almost as if you are simply freeing it, allowing it to come into being. That other self that speaks to you, it knows what the shape is in the clay. It tells you through your hands, in dreams, in images that no one but you can see. And they tell you this is sick, or bad, or disobedient. Don’t they?”\n He was watching her now. “Don’t they?” she repeated. He nodded.\n “Mark, they’ll never understand. They can’t hear that other self whispering, always whispering. They can’t see the pictures. They’ll never hear or get a glimpse of that other self. The brothers and sisters overwhelm it. The whisper becomes fainter, the images dimmer, until finally they are gone, the other self gives up. Perhaps it dies.” She paused and looked at him, then said softly, “You come here because you can find that self here, just as I could find my other self here. And that’s more important than anything they can give you, or take away from you.”\n He looked down at the floor, at the shambles of the pieces he had made, and wiped his face with his arm. “Mother,” he said, and stopped.\n Now Molly moved. Somehow she reached him before he could speak again and she held him tightly and he held her, and they both wept.\n “I’m sorry I busted everything.”\n “You’ll make more.”\n “I wanted to show you.”\n “I looked at them all. They were very good. The hands especially.”\n “They were hard. The fingers were funny, but I couldn’t make them not funny.”\n “Hands are the hardest of all.”\n He finally pushed away from her slightly, and she let him go. He wiped his face again. “Are you going to hide here?”\n “No. They’ll be back looking for me.”\n “Why did you come here?”\n “To keep a promise,” she said softly. “Do you remember our last walk up the hill, you wanted to climb to the top, and I said next time? Remember?”\n “I’ve got some food we can take,” he said excitedly. “I hide it here so when I get hungry I’ll have something.”\n “Good. We’ll use it. We’ll start as soon as it gets light enough to see.”\n \n \n It was a beautiful day, with high thin clouds in the north, the rest of the sky unmarred, breathtakingly clear. Each hill, each mountain in the distance, was sharply outlined; no haze had formed yet, the breeze was gentle and warm. The silence was so complete that the woman and boy were both reluctant to break it with speech, and they walked quietly. When they paused to rest, she smiled at him and he grinned back and then lay with his hands under his head and stared at the sky.\n “What’s in your big pack?” he asked as they climbed later. She had made a small pack for him to carry, and she still carried the laundry bag, now strapped to her back.\n “You’ll see,” she said. “A surprise.”\n And later he said, “It’s farther than it looked, isn’t it? Will we get there before dark?”\n “Long before dark,” she said. “But it is far. Do you want to rest again?”\n He nodded and they sat under a spruce tree. The spruces were coming down the mountains, she thought, recalling in detail old forestry maps of the region.\n “Do you still read much?” she asked.\n Mark shifted uneasily and looked at the sky, then at the trees, and finally grunted noncommittally.\n “So did I,” she said. “The old house is full of books, isn’t it? They’re so brittle, though, you have to be careful with them. After you went to sleep every night I sat up and read everything in the house.”\n “Did you read the one about Indians?” he asked, and rolled over on his stomach and propped his head up in his cupped hands. “They knew how to do everything, make fires, make canoes, tents, everything.”\n “And there’s one about how boys, a club or something, used to go camping and relearn all the Indian methods. It can still be done,” she said dreamily.\n “And what you can eat in the woods, and stuff like that? I read that one.”\n They walked, rested, talked about the books in the old house, talked about the things Mark planned to make, climbed some more, and late in the afternoon they came to the summit of the mountain and looked down over the entire valley, all the way to the Shenandoah River in the distance.\n Molly found a spot that was level and sheltered, and Mark finally got to see the surprise she had prepared for him: blankets, some preserved food, fruits, meat, six pieces of cornbread, and corn to pop over the open fire. After they ate, they pushed spruce needles into mounds and Mark rolled up in his blanket and yawned.\n “What’s that noise?” he asked after a moment.\n “The trees,” Molly said softly. “The wind moves up there even when we can’t feel it down here, and the trees and wind tell each other secrets.”\n Mark laughed and yawned again. “They’re talking about us,” he said. Molly smiled in the dark. “I can almost hear the words,” he said.\n “We’re the first human beings they’ve seen in a long time,” she said. “They’re probably surprised that there are any more of us around.”\n \n \n “I won’t go back either!” Mark shouted at her. They had eaten the last of the cornbread and dried apples, and the fire was out, the ground smoothed around it.\n “Mark, listen to me. They will put me back in the breeders’ compound. Do you understand? I won’t be allowed out again. They will give me medicines that will keep me very quiet and I won’t know anything or anyone. That will be my life back there. But you? You have so much to learn. Read all the books in the old house, learn everything you can from them. And one day you might decide to leave, but not until you’re a man, Mark.”\n “I’m staying with you.”\n She shook her head. “Remember the voices of the trees? When you’re lonely, go into the woods and let the trees talk to you. Maybe you’ll hear my voice there too. I’ll never be far away, if you listen.”\n “Where are you going?”\n “Down the river, to the Shenandoah, to look for your father. They won’t bother me there.”\n Tears stood in his eyes, but he didn’t shed them. He lifted his pack and put his arms through the harness. They started down the mountain again. Midway down they stopped. “You can see the valley from here,” Molly said. “I won’t go any farther with you.”\n He didn’t look at her.\n “Good-bye, Mark.”\n “Will the trees talk to me if you’re not there?”\n “Always. If you listen. The others are looking to the cities to save them, and the cities are dead and ruined. But the trees are alive, and when you need them, they’ll talk to you. I promise you that, Mark.”\n Now he came to her and hugged her hard. “I love you,” he said. Then he turned and started down the hill, and she stood watching him until her tears blinded her and she could no longer see him.\n She waited until he emerged from the woods and started across the cleared valley. Then she turned and walked south, toward the Shenandoah. All that night the trees whispered to her. When she awakened, she knew the trees had accepted her; they didn’t stop their murmuring as they had always done in the past when she stirred about. Over and under and through their voices she could hear the voice of the river, still far off, and beyond it, she was certain she could hear Ben’s voice, growing stronger as she hurried toward him. She could smell the fresh water now; and the voices of the river and the trees and Ben’s voice blended as they called to her to hurry. She ran toward him joyously. He caught her and together they floated down, down into the cool, sweet water.\n \n \n","sourceLink":"http://novel.tingroom.com/kehuan/340/656.html","bookId":315,"book":{"id":315,"title":"迟暮鸟语 Where Late the Sweet Birds Sang","description":"简介： Where Late the Sweet Birds Sang is a science fiction novel by Kate Wilhelm, published in 1976. Parts of it appeared in Orbit 15 in 1974. It was the recipient of the Hugo Award for Best Novel in 1977, and was nominated for the Nebula Award f...","cover":"http://novel.tingroom.com/uploads/110713/1-110G3144003D3.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/340","creation":"Aug 1, 2019 12:18:31 AM","modification":"Aug 1, 2019 12:18:31 AM"}}
