{"id":100219,"no":11,"title":"Page 11","content":"The dreary weather seemed fitting indeed to poor Diane as she sat on the wet grass of a small, cleared hillock in Tir na n\u0027Og, not far from the continuing battle. \"We should be getting ye back to the prisoners,\" Mickey, sitting beside her and honestly sympathetic, remarked. \"Even though most o\u0027 the prisoners seem to have a heart to be joining our side instead of fighting with Kinnemore, and even them that don\u0027t join with us aren\u0027t showing much spirit for keeping their fighting for th\u0027other side.\" The leprechaun blew a ring of blue smoke out of his gigantic pipe. It floated up into the air, then descended over Diane, encircling her like some magical necklace. Mickey blinked his eyes alternately and the ring shifted hue, moving right through the rainbow spectrum of colors. \" \u0027Course, that might be soon to be changing,\" the leprechaun finished glumly. Diane understood Mickey\u0027s reasoning. Many Connacht soldiers had sworn fealty to Tir na n\u0027Og, or more particularly to the hero wearing the armor of Cedric Donigarten. But now that hero was gone, taken captive, perhaps even killed, and the armor was in Kinnemore\u0027s hands. Diane sniffled back a wave of emotion. \"I want to go home,\" she whispered. \"If Gary\u0027s dead, then I want to go home.\" Mickey had explained to her the ramifications of death in Faerie. If Gary or Diane died here, then dead they would be, in both worlds. If Kinnemore had killed Gary, and Mickey and Diane could not retrieve his body, then he would, as far as people in the other world were concerned, simply vanish. Diane wondered how she might explain that one to her mother-in-law. Even if they found the body, returned to the ruined castle on the hill in Duntulme, how was she going to get back to the United States and explain sword wounds? \"He\u0027s not dead yet, lassie,\" Mickey remarked. Diane turned sharply on the sprite. \"How do you know?\" \"Kinnemore\u0027ll make a show of it,\" Mickey reasoned. \"Gary Leger was hurting, but not too bad, when I left him. If Kinnemore means to finish the job, he\u0027ll do it in grand style, an open hanging in Dilnamarra - or might be that he\u0027ll take Gary all the way back to Connacht, where a hundred times the number might watch. He was always one for crowd-pleasin\u0027.\" Diane thought it over for a moment. \"If you get me beside him, can you just beam us out?\" she asked. \"Can I what?\" Mickey responded, eyeing her curiously. Despite the awful predicament, Diane gave a small snort. With the accent, Mickey did sound a bit like Scotty. \"Can you send us away?\" she explained. \"Back to our own world?\" Mickey took a deep draw on his pipe and nodded his understanding. \"Only through a bridge,\" he replied. \"And suren there\u0027s few o\u0027 them left. And truth be telled, I cannot do it. That\u0027s pixie work.\" Mickey studied Diane\u0027s crestfallen look for a moment, then his voice took on an angry and frustrated edge. \"I telled ye ye\u0027d not want to be here,\" he accused. \"Not now, not at this time!\" Diane looked away, but she did not blame Mickey. \"I\u0027m not thinking that Kinnemore\u0027ll kill Gary and Kelsey at all,\" Mickey went on, trying to offer some comfort at least. \"Ceridwen\u0027s coming free soon, and the witch\u0027d not be pleased to learn that her puppet King stealed such pleasure from her.\" Diane started to respond, but stopped short, her mind working furiously down a new avenue of thought. \"Is Kinnemore afraid of Ceridwen?\" she asked. \"Ye\u0027d be afraid o\u0027 her, too, if ye knowed her,\" Mickey was quick to respond. \"How often does he speak with her?\" Mickey shrugged, having no way to know the answer. \"And you told me that Gary was the only one who could shorten her banishment,\" Diane rolled on, taking no further notice of Mickey\u0027s responses. \"And he did shorten it, when the dragon was alive and loose. So he could shorten it again, right?\" \"Lassie, we\u0027re in enough trouble now,\" Mickey said dryly. But Diane\u0027s smile did not diminish; the weight had been lifted from her shoulders. She felt suddenly like she was in the middle of a delicious novel and, for the first time, like she might have some control over the pen. They crouched at the corner of a small building, the sunlight fast fading behind them. Getting into Dilnamarra had not been much of a problem, as Diane\u0027s plan had worked wonders on the badly informed common soldiers of Kinnemore\u0027s army. \"There\u0027s Kinnemore,\" Mickey whispered, indicating the area before the door of the town\u0027s squat keep. \"With Prince Geldion beside him.\" \"I thought you said that Gary was brought to Faerie in the first place because he was big enough to fit Donigarten\u0027s armor,\" Diane whispered. \"Kinnemore\u0027s got to be a foot taller than him!\" \"Aye,\" Mickey replied. \"And bigger than I\u0027m remembering him. But he\u0027s too big for the armor - and ye think we\u0027d have had a chance o\u0027 persuading him to go, anyway?\" Diane nodded. King Kinnemore seemed indeed an aberration. Diane, at five-foot-eight, was taller than any man she had met in Faerie, except for the giant King. The two remained in place for some time, watching Kinnemore and Geldion, and the King did not seem very pleased with his son! Diane, carrying all of her otherworldly equipment with her, glanced back to the westering sun, then took out a small meter. Nodding happily, she brought her Polaroid around from her side and lifted it towards the King. \"Here now, what\u0027re ye up to?\" Mickey wanted to know. \"We can\u0027t go starting a fight in the middle o\u0027 Dilnamarra.\" \"No fight,\" Diane promised and clicked off the picture. The exposed film ejected and she took it away. \"You\u0027ll see.\" Geldion stormed away from the meeting and leaped atop his horse, thundering out of town, his father\u0027s scowl on his back and his own scowl set on the road before him. Then Kinnemore spun about, knocking one of the guardsmen to the ground, and entered the keep. \"Come along,\" Mickey instructed, wanting to get this over with quickly, before the King had the time to relax and sort things out (and, possible, to make some sort of contact with Ceridwen!). The leprechaun, who looked like a spindly-armed goblin, skittered out, and Diane began to follow. She took one quick look at the developing photo, meaning to tuck it into a pocket. \"Hel-lo,\" she said in surprise. She looked to Mickey, who was too far ahead, and decided this newest \"development\" would have to wait. She tucked the picture safely away and rushed to catch up. If Diane had any doubts about the power of Mickey\u0027s latest illusion, they vanished the moment the two guards standing beside the iron-bound door to Dilnamarra Keep noticed the pair coming. They bristled about and readied their weapons at the sight of Mickey, in goblin guise, and how they blanched, falling all over themselves in a feeble attempt to come to rigid attention, when they noticed Diane! Mickey walked right up to them boldly, daring them. Neither dared to look down at the little goblin; neither dared to move his eyes at all, or even to breathe. \"Whereses is Kinnemore?\" Mickey rasped in his best goblin imitation. \"The Lady wantses to see Kinnemore!\" \"The King is inside the keep,\" one of the guards was quick to answer. \"I will announce - \" \"Stop!\" Diane said, and the man nearly fainted. \"Where is Prince Geldion?\" The guards looked nervously at each other. \"He went to the prisoners,\" the first answered. \"Then he was off to the battlefield to direct the next attack.\" \"Ah, yes, the prisoners,\" Diane remarked, trying to hide her overwhelming relief that Gary and Kelsey were apparently still alive. \"You have caught that wretched Gary Leger, and an elf-lord of Tir na n\u0027Og. Pray tell me, where has Geldion put those two?\" \"In a secluded barn,\" the guard promptly answered. \"West of Dilnamarra, beside an abandoned farmhouse. They . . .\" \"I\u0027m for knowin\u0027 the . . .\" Mickey interrupted, and he caught himself, and his unwelcome change of accent quickly and looked to the guards to make sure they had not caught the slip. \"Geek knowses the place, lady,\" he corrected. \"Geek knowses the place!\" Diane stood as if in deep thought. \"Come along, Geek,\" she said at length, her tone wicked with thick sarcasm. \"We will visit with Kinnemore later - for now, let us go and tell Gary Leger how fine it is to see him again! \"And you!\" she snapped at the pale guards. \"Say nothing to Kinnemore of my coming. Ceridwen needs no announcement.\" She rose up, tall and terrible, completely amazed at the power granted her by this disguise. \"If your King has even a hint that I have been here,\" she warned, \"you will live out your pitiful lives as barnyard animals!\" She held her hand up and out towards the men, drawing their attention, and then with a pop there came a blinding flash, followed by clouds of leprechaun smoke, and when it cleared, Mickey and Diane were gone, leaving the bewildered and terrified guards to their uncomfortable watch. \"Fine trick, lassie,\" Mickey remarked as he and Diane skittered across the field west of Dilnamarra. \"How\u0027d ye do it?\" Diane held up the flash for her Pentax. Mickey eyed it curiously, his keen ears picking up the faint whining sound as the batteries brought the flash back to the ready. \"Fine trick,\" the leprechaun said again, and he let it go at that, having no time, with the barn prison now in sight, to search out the details. \"Are ye ready?\" Diane nodded. \"We go in hard and furious,\" she said, paraphrasing the leprechaun\u0027s earlier plans. \"Intimidation is our ally.\" \"Aye,\" Mickey agreed. \"And a bit o\u0027 luck wouldn\u0027t hurt.\" Diane looked at the sprite\u0027s grim expression. \"I\u0027m hoping Prince Geldion\u0027s not about,\" Mickey explained. \"I\u0027ve seen a lot o\u0027 that one, and he\u0027s seen a lot o\u0027 me, and suren he\u0027ll be harder to fool!\" Diane skidded to a stop, as though she had just realized the potential implications of failure. \"Should we wait?\" she asked nervously. Mickey nodded ahead, to the dilapidated wooden barn and the many Connacht guards standing about it. \"Yer Gary\u0027s in there,\" he grimly reminded her, and Diane said no more. The door to the keep swung open and King Kinnemore rushed out, his expression curious. He looked from one guard to the other (and both silently agreed that they were not having the best of days!), then began sniffing the air. \"Who has been about?\" Kinnemore demanded in his most commanding voice. One of the guards cleared his throat; his knees went weak. \"No one, my King!\" the other guard quickly put in, fearing the prospect of viewing the world through a pig\u0027s eyes. \"Er, just some beggars - there are so many beggars in this filthy . . .\" \"Silence!\" Kinnemore demanded, and he sniffed the air again, his face crinkling as though he had smelled something utterly foul. \"Be on your best guard,\" he said to his men, as he continued to glance all about. \"I smell leprechaun, and that can only mean trouble.\" Now the two guards were in a terrible dilemma. They looked to each other, exchanging unspoken fears about their previous encounter. If that was a leprechaun\u0027s trick, then they had played into their enemy\u0027s hands. But if they told Kinnemore of the incident and that last visitor was truly Ceridwen, then the consequences would be horrid. \"Look alert!\" Kinnemore roared, not understanding the silent exchange. He pushed between the men and back into his keep, slamming the door behind him. \"What are we to do?\" one of the guards asked his companion. The other guard hushed him, but had no answers. He didn\u0027t want to betray his King, but he didn\u0027t think he would look so good sporting a curly little tail. There came the sound of a galloping horse, and a moment later Prince Geldion came charging through Dilnamarra, heading for the keep. \"That witch didn\u0027t say nothing about telling Geldion, now did she?\" the first guard said slyly. His companion smiled broadly, with sincere relief, thinking they had just been let off the hook. ***** Walking up the dirt path to the barn, by the stone skeletal remains of the farmhouse, the pair met a small horse-drawn cart coming the other way. A dirty soldier drove the cart, one of his shoulders heavily wrapped in soiled and bloody bandages. The man widened his eyes in shock at facing the illusionary Lady Ceridwen, and he coaxed his horse to a near stop and pulled far to the side. \"Geek, see what he is carrying,\" Diane instructed, and Mickey rushed over and climbed the side of the cart. \"Ooo, Lady!\" the leprechaun exclaimed in perfect goblin voice. \"He\u0027s gotses the armor and spear! And an elfs\u0027s armor, too!\" \u0027Turn that cart around,\" Diane said without hesitation. \"But the King has ordered the armor to Dilnamarra Keep,\" the poor soldier weakly protested. He started to go on with the explanation, but his next words, with help from a ventriloquist leprechaun\u0027s trick, came out sounding like the croak of a bullfrog. Predictably, the man\u0027s eyes widened in shock. \"A frog, Lady?\" Mickey happily squeaked. \"Can Geek eatses the frog?\" \"Patience, dear Geek,\" Diane replied coolly. \"Let us see if this one is ready to obey.\" She hadn\u0027t even finished talking before the cart swung about on the road and rushed off the other way, back for the barn. \"Well done,\" Mickey congratulated. \"Just a bit more o\u0027 the tricks, and we\u0027ll all run free.\" Diane nodded determinedly, but in truth, she was actually enjoying this charade. She, and not Mickey, led the rest of the way to the barn, passing among the dozen or so bewildered soldiers with a confidence that defeated any forthcoming words of protest before they were ever uttered. She stalked right up to the man holding a spear across his chest as he blocked the barn door, and, with a simple swish of her head, sent him dancing aside. He turned on her as she started to enter, but the camera flash fired in his face and he shrieked and stumbled backwards, tripping over his own feet and falling to the ground. \"Leave us,\" Diane ordered the two men inside the barn, and she did well to keep her voice firm and steady at the sight of Gary, Kelsey, and TinTamarra, obviously beaten. They stood in a line, their arms chained above them, their feet barely touching the floor. One of Gary\u0027s arms was cocked at a curious angle as it went up above his head, held fast by the chains, and was paining him greatly. Diane\u0027s gaze never left her love, and she jumped when the barn door banged hard behind her, swung wide by the fleeing men. A bit of leprechaun magic brought the door swinging closed. \"So you\u0027re free,\" Gary Leger growled defiantly at Diane, which confused her for just an instant. \"Give me back the spear, witch, and I\u0027ll put you back in your hold!\" Kelsey, standing beside Gary, eyed Ceridwen and Geek curiously for a moment, then, to Gary\u0027s confusion, both he and his elfish companion began to laugh. \"Aye, none can see through tricks better\u0027n the Tylwyth Teg,\" Mickey remarked, using his own voice. Gary\u0027s eyes widened. \"Dear Geek,\" Diane said. \"Do go out and have the good soldiers bring the equipment into the barn.\" Gary, figuring it all out then, tried to laugh, but the attempt brought waves of stinging pain shooting through his shoulder. Diane was beside him immediately. \"Dislocated,\" she said after a quick inspection. \"Get away,\" Gary whispered, and Diane moved back just as the door opened again and Mickey entered, accompanied by three soldiers bearing piles of equipment. \"They broughtses the dwarfs\u0027s things, too,\" the illusion-ary goblin explained. \"The dwarf?\" both Gary and Kelsey mouthed silently. Diane was trying to figure out how she might convince the guards to leave the keys for the shackles as well, without making them too suspicious, but to her surprise, Mickey forcefully dismissed the men, practically chasing them out of the barn. She met the leprechaun just inside the door. \"We need to get the keys,\" she started to explain, but Mickey smiled wide, put a hand into a deep pocket, and produced a ring of keys. Diane was back at Gary\u0027s side in a moment, carefully freeing him and helping him to a sitting position. She hugged him tightly, taking care not to press the dislocated shoulder. \"Get to Kelsey!\" Mickey sharply reminded her. \"We\u0027ve not the time.\" Diane fumbled with the ring, finally finding the right key, and Kelsey, too, was free. He rushed for the pile and quickly began donning his fine armor, while Diane went to the still-chained TinTamarra. \"Hurry,\" Mickey prodded her, but there were a score of keys on the chain and she fumbled about. The leprechaun\u0027s declaration that they had little time rang painfully true then, as the barn door swung open. \"Out a bit early, aren\u0027t you, Ceridwen?\" Prince Geldion remarked.","sourceLink":"https://allnovel.net/dragonslayer-s-return-spearwielder-s-tale-3/page-11.html","bookId":2186,"book":{"id":2186,"title":"Dragonslayer\u0027s Return (Spearwielder\u0027s Tale #3)","description":"Storyline: Dragonslayer\u0027s Return (Spearwielder\u0027s Tale #3) The threat of war looms over the realm of Faerie, as an evil king brutally supresses his subjects, and a powerful witch wages a campaign of destruction. The peaceful folk of Faerie summon Gary Leger, the heroic Dragonslayer, to return for his ultimate challenge--he must save the kingdom from the eternal curse of war.","cover":"https://allnovel.net/images/dragonslayer-s-return-spearwielder-s-tale-3.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/dragonslayer-s-return-spearwielder-s-tale-3.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:50:43 PM"}}
