{"id":100220,"no":12,"title":"Page 12","content":"The slender man looked ominous indeed, silhouetted in the barn door, his soldiers at his back and his worn traveling cloak billowing in the stiff breeze.\\n\\n Gary forced himself to his feet, Diane holding him by his good arm until he regained his balance. Kelsey dropped his armor - he had no chance of donning it - but held fast to his fine sword, its tip gleaming furiously in the slanted rays of light coming through the open barn door.\\n\\n \"You will drop that weapon,\" Prince Geldion said to him matter-of-factly.\\n\\n Kelsey didn\u0027t flinch.\\n\\n \"Kill the chained elf,\" the Prince calmly ordered, and the two soldiers closest to him, both holding crossbows, stepped up to the threshold and took aim at TinTamarra.\\n\\n Gary, Kelsey, and Diane all cried out denials at the same time, but it was Mickey\u0027s voice, his magical voice, raised in an illusion outside the barn, that saved the chained elf. Several soldiers cried out warnings of the ambush, and the crossbowmen, seeing a host of fierce elves coming at them down the dirt road, instinctively loosed their bolts in that direction.\\n\\n Mickey couldn\u0027t witness the flights of the quarrels from inside the barn, of course, and so his illusionary force did not properly react, tipping the Prince and his men off to the truth of the matter.\\n\\n \"A leprechaun trick!\" Geldion yelled above the general commotion. \"My father said that a leprechaun was not long ago outside the keep. He said he smelled the foul thing!\"\\n\\n \"I\u0027m meaning to ask him how it is that he keeps doing that,\" Mickey replied, coming visible (and looking like a leprechaun again) and perched on a beam above where Gary had been shackled.\\n\\n Before Geldion or his crossbowmen could react to the appearance of the sprite, Mickey waved his hand, and Cedric\u0027s mighty spear lifted from the pile near Kelsey and floated across the room, to Gary Leger\u0027s waiting grasp. Gary held the thing tentatively in his good hand, his other shoulder throbbing with pain.\\n\\n Well met, young sprout! the spear emphatically greeted him.\\n\\n \"If you say so,\" Gary replied, a deep sense of hopelessness evident in his voice.\\n\\n Geldion was fuming by this point. \"Take them!\" he cried. \"Take them all, and if any die in the event, then so be it!\"\\n\\n The soldiers bristled about, but did not immediately advance. Some glanced to the side again, to the continuing, and unnerving, illusion of an elf host. Others looked to Mickey, their expressions revealing both greed and trepidation, and still others looked to Kelsey, and mostly to Gary, the spearwielder, supposedly the dragonslayer. He had been captured out on the field near the catapults, and had been taken easily, but on that occasion, Geldion and Kinnemore had more than ten times this number of soldiers surrounding him.\\n\\n \"Aye!\" Mickey yelled unexpectedly, and unexpected, too, was his apparent agreement with Geldion\u0027s call. \"Take them, as the foul Prince has spoken! Kill the wielder of Donigarten\u0027s own, he who slew Robert and saved yer precious town, and any other town in all the land. Take him now, this hero who\u0027s come from far off to show us the way!\"\\n\\n Whispers erupted among the soldiers; Geldion called again for a charge and drew out his dirk, and the men did come on - at least, most of them came on. There was some commotion near the back of the ranks, and before any Connacht men got near to Kelsey or Gary, the sound of steel against steel rang out, along with a call for \"Sir Cedric!\"\\n\\n \"That\u0027s me noble soldier,\" Mickey whispered, and the sprite faded away again to invisibility, honestly wondering how many tricks he had left. Diane\u0027s disguise went away as well, then, the leprechaun trying to conserve his magical energies - energies he had already depleted considerably.\\n\\n Kelsey ran to the side, around a ladder and under the barn\u0027s loft. The closest two soldiers came fast in close pursuit. Kelsey dashed around a hay bale, turning to ambush the men, but they did not follow the course, stopping instead and rolling the bale aside.\\n\\n As soon as the obstacle was out of the way, Kelsey charged ahead, right into the two, his sword slashing and hacking mightily as he tried to score a quick kill.\\n\\n He got near one man\u0027s face, and struck the other\u0027s shield hard enough to break one of its straps and leave it hanging awkwardly on the man\u0027s arm. But he drew no blood in that initial flurry and the trained soldiers, well armored in thick leather jacks that were sewn with interlocking metallic rings, moved a few steps apart, measuring their strikes.\\n\\n Diane rushed back to TinTamarra, still hanging limply from the shackles. She fumbled frantically with the key ring, going through several keys before finding the one that fit. She got it in place, but before she could turn it, she yelped in pain and moved away, the key still hanging in the elf\u0027s shackle, as a swordtip pinched her side.\\n\\n Two soldiers stalked her, and she fell back against the wall, stumbled along it. The chained elf lifted his feet from the floor and kicked one of the men hard in the thigh. The soldier grimaced and turned, slapping the still-kicking legs aside with the flat of his sword. \"Get the woman!\" he told his companion, and he moved in on TinTamarra, punching hard with the hilt of his sword repeatedly.\\n\\n Mickey exerted some magical energy then, trying to telekinetically push the key all the way in and turn it. To the leprechaun\u0027s dismay, though, the soldier coincidentally reached up and pulled the key free of the shackle, throwing it to the hay-strewn ground.\\n\\n Not far away, Gary\u0027s only thought was to get back to Diane\u0027s side, to protect his love. But he too found two men facing him, circling him, feigning thrusts and swipes, one with a sword, the other with a club.\\n\\n Gary jabbed with the sentient spear, waved it across in front of him frantically to keep the men at bay. As balanced as it was, however, the nine-foot-long weapon was unwieldy when used in one hand, and Gary spent a long time recovering from the momentum of each swing. Soon both the soldiers were smiling, then even laughing openly at Gary\u0027s feeble attempts to fend.\\n\\n Across came the sword, and one of the men, instead of his typical retreat, stepped ahead, inside the slashing tip, dropped his own weapon, and caught the spearshaft in both hands.\\n\\n \"Here now, mighty dragonslayer,\" he taunted. \"What are you to do now?\"\\n\\n The end had come, so Gary thought, as the other man lifted his club and advanced, while the man holding the spear gave a great tug. Gary held on stubbornly, though he didn\u0027t know what good that would do.\\n\\n \"What are you to do now?\" the man chided a second time.\\n\\n Cedric\u0027s spear answered for Gary.\\n\\n Gary felt the telltale tingles an instant before the spear\u0027s magical energy gathered along the shaft and blasted into the man. His hair stood on end, and off he flew, across the barn, to crash into a fork and scythe and wheelbarrow. He came up on his elbows, staring incredulously, his hair still flying wildly and his whole body trembling from the jolt. Then his eyes crossed and he fell back to the ground, out of the fight.\\n\\n The soldier\u0027s companion watched the flight in disbelief, but Gary wasted no time. As soon as the spearshaft was free of the man\u0027s grasp, Gary whipped it across, tucking it tight against his side for support. The powerful weapon easily cut through the remaining soldier\u0027s armor, gashing his side, and the man cried out in pain and fell back. He ran a hand over his wound, then stared at the blood in his palm.\\n\\n \"Son of a Bretaigne pig!\" he roared at Gary. \"You\u0027re to die for that one!\" On he came fiercely, his club banging away at the blocking spear. Gary fought hard to keep the long weapon up between him and the man, not doubting the threat in the least, but each clubbing blow sent a shock wave of pain coursing up his side, and he feared that he would surely pass out.\\n\\n Diane was in trouble, Gary was in trouble, and Kelsey was fighting two against one without any armor. Even worse, the fighting had ended back at the door, leaving two men dead, but Geldion remained, his dirk dripping blood and four more soldiers ready at his side.\\n\\n And Mickey could do nothing to help any of those situations, for TinTamarra was in truly desperate straights. The chained elf was helpless, and the soldier meant to kill him - that much the leprechaun knew for certain. \"Here now, laddie,\" Mickey called from his perch, and he came back into view. \"When ye\u0027re done with him, ye think ye might take a try for me pot o\u0027 gold?\"\\n\\n The bait didn\u0027t work quite as the leprechaun had expected, for, though the man pushed away from the battered elf and lunged for him, he did so with his long sword leading. Mickey was nearly skewered. He skittered back along the beam as the soldier pressed onward, up on his tiptoes and poking eagerly. Stubbornly, the man leaped up and grabbed the beam with his free hand, determined to skewer the leprechaun, or to chase the troublesome sprite away.\\n\\n How his hungry expression changed when the open shackles, shackles that had been used to hold Gary Leger, seemed to come to life, grabbing at his wrists, locking fast about his wrists!\\n\\n The soldier fell from the beam to a hanging position (for he was not as tall as Gary). He held fast to his sword, but the weapon would do him little good with his hands so tightly bound.\\n\\n \"Where are ye to run, pretty lass?\" the pursuing soldier asked Diane, and it took all her courage to steel her emotions against the implications of his lewd tone. More ominous did he seem, for his face was dirty, his beard several days old, and judging from the abundance of dried blood on his tunic, he had seen quite a bit of fighting at the front lines.\\n\\n She continued her slide along the barn\u0027s back wall, hoping to get under the loft, where she might dart around some of the hay piled in there and get to Kelsey\u0027s side.\\n\\n That plan disappeared in an instant, though, first as Diane bumped into something hard protruding from the wall, breaking her momentum, and a moment later when she heard one of the newcomers to the fray call out to her pursuer.\\n\\n \"I\u0027ve got her this way!\" the second soldier declared.\\n\\n The pursuing soldier stopped and held his arms out wide, spinning the heavy club in one hand. \"You got nowhere to run,\" he chided. \"So come along easy.\"\\n\\n Diane glanced over her shoulder and saw the second man coming out from under the loft, smiling as wickedly as her pursuer. She glanced farther over her shoulder, to see what had stopped her retreat, to see what inanimate object had so deceived her.\\n\\n A small windlass was set into the wall, running a rope to a pulley over the loft, and to a bale of hay, suspended near the loft\u0027s edge. Diane needed luck, couldn\u0027t stop to measure the angle or the timing. She grabbed at the windlass crank and pulled free its pin.\\n\\n \"What?\" her closest pursuer asked as the rope spun out. The suspended hay bale dropped five feet to bonk the man\u0027s oblivious reinforcement on his thick head.\\n\\n The man went down under the bale.\\n\\n Kelsey worked magnificently, his sword darting so quickly from side to side and straight ahead that neither of the soldiers he faced scored as much as a nick on his unarmored body. But the few hits that Kelsey managed were not significant, his thrusts pulled short for fear of a counter, and the solid armor of his opponents absorbing most of what was left.\\n\\n The elf went on undaunted, too angry at Geldion and Connacht to let the odds dismay him, too angry at Ceridwen and at the despoiling of Tir na n\u0027Og to think of anything but his fury.\\n\\n His sword banged hard off a shield, whipped back across to intercept a thrust from the other man, then snapped back again, this time slipping past the shield to deflect off the first man\u0027s shoulder.\\n\\n Back the sword came again, and Kelsey stepped ahead, prodding and poking. The soldier worked desperately to counter, his sword flicking back and forth as he stumbled into a short retreat, but Kelsey would have had him cleanly had not his companion recovered from the stinging nick in time to come ahead and force the elf to relent.\\n\\n Kelsey narrowed his golden eyes, his frustration finally beginning to build. These two were practiced swordsmen, and had fought side by side before, and Kelsey realized that he had little chance of scoring a fast kill.\\n\\n The three were near to the loft\u0027s ladder then, Kelsey still forcing back his adversaries. For a moment, the elf thought himself tiring, thought that his vision was blurring. Then he understood. He held his smile and his hopes, and pressed the attack.\\n\\n The soldier nearest the ladder reached for it, thinking to make use of its offered support and defensive advantages. His eyes deceived him, though, and he grabbed only air.\\n\\n He lurched sidelong, through Mickey\u0027s illusionary ladder, to bang into the real one, a foot farther to the side. On came Kelsey, before the man or his startled companion could recover. Wisely, the off-balance soldier twisted so that he would fall all the way around the ladder, farther from the elf\u0027s wicked reach, but Kelsey\u0027s move at him ended short anyway; it was only a feint.\\n\\n The second man, sliding across to block the elf from his companion, widened his eyes in shock as Kelsey pulled up short and cut sharply to the side. The soldier got his sword up for a block, but Kelsey\u0027s blade was too swift, sliding past the parry to jab deeply into the soldier\u0027s belly. Kelsey did not have to fear a counter by the other man this time; there was nothing to stop his deadly progress.\\n\\n Nothing but his expanding conscience.\\n\\n The soldier fell away, grasping his wounded belly. He went to the floor, writhing, but very much alive, and totally confused as to why the fierce elf had pulled up short, had not finished him with a simple twist of the wrist, a simple change in the angle of the penetrating blade. In any case, the man was out of the fight. Diane spun back, but her pursuer was upon her, his club right over his head and coming to bear. Again the woman\u0027s reaction was purely instinctual, a simple movement she had learned in basic self-defense classes her work office had offered a year before. She brought her open hands up in front of her and stepped ahead and to the side, pivoting on one foot and turning her upper body as she went. Predictably, her attacker shifted the angle of his descending club, but Diane\u0027s nearest hand was too close for the weapon to strike effectively. She caught it right above the man\u0027s hands and continued her turning retreat, absorbing the energy of the blow and putting the man off balance.\\n\\n At the same time, Diane tugged fiercely at the club and stomped hard on the man\u0027s instep.\\n\\n \"You witch!\" he protested through a groan. He was stumbling forward, and let go of the club with one hand, trying to grab onto something for support.\\n\\n Diane reversed her tug into a hard shove, and the butt end of the club smacked the soldier in the face, crunching his nose.\\n\\n \"You witch!\" he shouted again, sputtering with warm blood.\\n\\n Diane pivoted back in to face him squarely, only a few inches away, and up came her knee.\\n\\n And up the groaning man went on his tiptoes, his eyes crossing.\\n\\n \"You witch,\" he tried to say again, but suddenly he had no breath for the words.\\n\\n Diane yanked the club free of his grasp and stepped back, thinking to hit him. But there was no need. His nose broken, his breath nowhere to be found, the soldier fell hard against the wall and to the ground, curling into a fetal position.\\n\\n \"Ooo lassie, well done!\" Mickey, finished with his latest trick, congratulated her.\\n\\n Diane looked at the leprechaun in disbelief. She looked to the club, as though it might offer some answers. Then she looked back to the crumpled soldier and shrugged, embarrassed and apologetic, and sincerely amazed at the effectiveness of her self-defense tactics. The situation was pressing, and far from won, but Diane made a mental note then and there that if she got out of Faerie alive, she would enroll in more martial arts classes.\\n\\n Gary winced repeatedly as the soldier\u0027s club slammed hard against his spear, jolts of energy coursing along the vibrating shaft. He hardly thought he could hold out against this single adversary, yet when he looked past the man, he saw two others steadily advancing, their swords already bloody from their fight with the traitors at the barn door.\\n\\n Gary had no time to even think about those two, though, as his current opponent kept up the pressure. A few more parries, a few more stinging hits, and a distracted Gary wondered where the man\u0027s reinforcements might be. Why hadn\u0027t they come in yet to strike at him?\\n\\n He glanced over the soldier\u0027s shoulder once again - and saw, to his disbelief, that the two others were battling each other!\\n\\n Gary thought about it only long enough to come to the conclusion that Mickey was somehow involved. His relief did not last long, however, for his spear was slammed on the side, and wavered across his body. He instinctively reached for it with his other hand, and the sudden throbs of agony from his wounded shoulder nearly overwhelmed him.\\n\\n Gary somehow managed to put the mighty spear back in line before his opponent, who was justifiably wary of the weapon, dared to advance. But Gary was still wobbly when the next hit came, and then the next, both clubbing straight down atop the spearshaft.\\n\\n Gary hardly even realized that he was no longer holding the weapon. More from exhaustion and agony than from any set plan, Gary tumbled backwards and to the floor, his good hand coming to rest on the very end of the fallen spear\u0027s shaft.\\n\\n Gary understood then his doom, realized that the soldier was fast advancing. He clutched the spear but, holding it so near to the back end, had no hope that he could even lift it.\\n\\n Now, young sprout! the spear cried in his head.\\n\\n A blast of energy came out from the sentient spear\u0027s tip, scorching the ground and blasting the tip upward. At the same moment, Gary pulled with all his strength, and to his amazement (for he had not seen the energy release), its huge tip rose up from the ground.\\n\\n To the amazement of the approaching soldier, as well. The man caught the flying tip in the hip, the spear\u0027s hungry head biting hard through the meager padding of his armor, through his flesh and bone. He toppled to the side, screaming, taking the embedded spear from Gary\u0027s weakened grasp.\\n\\n Gary was on the verge of unconsciousness, but he heard those pitiful screams, and surely they tore at his heart.\\n\\n Diane heard them too, and was equally horrified. She wanted to run over to Gary, then, to offer support and to get some, but she had her own problems. The man she had clobbered with the bale was crawling out, more angry than hurt.\\n\\n Fuming with unfocused rage, mad at all the violent world, Diane charged and leaped atop the rising man, bearing him to the ground. She whacked him with the club across the shoulder blades and told him to lie still, and when he did not, she whacked him again.\\n\\n She hoped he would fall unconscious; she feared she would have to kill him.\\n\\n Kelsey would have finished the remaining man at the ladder quickly, but then Prince Geldion was at the soldier\u0027s side and it was two against one once more.\\n\\n The elf fell back in despair and went to the defensive, fending off the sword attacks and Geldion\u0027s surprisingly adept strikes with his long and nasty dirk. Even worse, Kelsey noticed that the other man, the one he had wounded in the belly, was starting to rise, and the elf wondered if his mercy had been misguided.\\n\\n \"He had me!\" the wounded man cried breathlessly. \"Liam, he had me. I tell ye!\"\\n\\n The man fighting beside Geldion eyed his wounded companion curiously, then turned his confused gaze upon Kelsey.\\n\\n \"Too many have died for an unlawful King!\" the elf growled, seizing the moment and the possibility for further dissention in Geldion\u0027s shaky ranks. Kelsey had already seen enough evidence that the Connacht army\u0027s heart was not in this conquest to guess what his adversary might be thinking.\\n\\n Geldion apparently understood the sentiments, too. \"Fight on!\" the Prince roared. \"For the glory of King and country!\"\\n\\n \"He had me dead, Liam!\" the wounded man, staggering for the door, said again. Liam looked to Geldion, his expression truly horrified. The Prince snarled in response and lashed out with his dirk - for Liam and not for Kelsey!\\n\\n But Liam was quick enough to sidestep, and he ran off, grabbing his wounded friend and shuffling for the barn door.\\n\\n Geldion threw a hundred empty threats at his retreating back.\\n\\n \"Now it is as it should be,\" Kelsey said grimly, stepping aside to momentarily break the melee. \"You and I shall decide this, Prince Geldion, a course you began those weeks ago when you unlawfully tried to prevent my quest.\"\\n\\n \"Kinnemore is law!\" Geldion spat. \"And the Tylwyth Teg are outlaws all!\" On came the bold Prince, his dirk slashing.\\n\\n Kelsey hardly understood the tactic; with his longer yet equally wieldy weapon, he could easily defeat any of Geldion\u0027s thrusts.\\n\\n But Geldion was not out of tricks. His dirk shot forward, and as Kelsey\u0027s sword moved to intercept, the Prince uttered an arcane phrase and the dirk elongated, its blade thickening, but holding still its razor edge. The angle of Kelsey\u0027s parrying sword was all wrong as the blade elongated, and the magical weapon slipped past the defense.\\n\\n Kelsey threw his hips out behind him, scampering with quick steps to be out of the Prince\u0027s surprising reach. He only took a small hit on the thigh, but his troubles came frombehind, where Geldion\u0027s last soldier stood ready, club in hand. The soldier had left the barn when the Prince had joined the fight with Kelsey, and had subsequently crawled back in through a side window, behind the hay at Kelsey\u0027s back.\\n\\n His club connected solidly on Kelsey\u0027s lower back, and the elf straightened, his arms falling weakly at his sides.\\n\\n Geldion waded in, fist balled over the hilt of his dirk-turned-sword, and slammed Kelsey in the face, and Kelsey toppled. Geldion\u0027s soldier hit the elf again, on the back of the neck as he rolled, and Kelsey knew no more.\\n\\n \"Mickey!\" Diane\u0027s call was purely frantic. She moved beside Gary and helped him back to his feet. The realization of what had just happened stunned Diane; in the space of a few minutes so many men lay dead or wounded on the floor.\\n\\n So many men, and Kelsey.\\n\\n And Diane did not like the prospects now facing her as a grim Geldion and his soldier came out from under the loft and steadily advanced.\\n\\n \"Mickey?\" she called again.\\n\\n \"I think he\u0027s gone,\" Gary answered. He nodded to the door. \"The two that were fighting each other ran out - probably chasing Mickey.\"\\n\\n \"Well, imposter, what have you to say for your treason?\" Geldion asked, drawing them from their private conversation.\\n\\n \"Nothing, to you,\" Gary spat back.\\n\\n \"But I am judge and jury,\" Geldion calmly explained. With no response apparently forthcoming, the Prince began to laugh aloud, a wicked laugh indeed.\\n\\n He stopped abruptly, studying Gary\u0027s wounds. \"See to the woman,\" he told his soldier. \"I will settle the lie of the spearwielder, the imposter hero who claims the defeat of the dragon Robert.\"\\n\\n \"I did kill Robert,\" Gary insisted.\\n\\n Geldion laughed again. \"Then a mere Prince should pose no difficulty for you.\"\\n\\n Driven by a sense of honor, Gary nudged Diane aside. She stared at him, somewhat disappointed, and thinking his honor misplaced. He was still holding the long spear in only one hand, his other arm too weak to do much more than help guide the weapon\u0027s swipes.\\n\\n He was surely going to get himself killed, Diane decided, but she couldn\u0027t spend too much time thinking about that now, not with the club-wielder, a powerfully built man, his smile more filled by gaps than stained teeth, steadily approaching.\\n\\n She readied her own club, putting her feet wide apart, feeling her balance. In stalked the soldier, casually snapping off a series of blows. Diane blocked and responded in kind. Each hit sent a shock wave along her arms, but she stubbornly held on, her confidence returning, her survival instincts washing away her fears. But then the man\u0027s club hit hers down low, near the handle, and hit, too, Diane\u0027s lead hand. Her fingers went strangely numb, a wave of pain rolled up her arm, and the man\u0027s next solid hit knocked the club from her hand.\\n\\n And he was still smiling wickedly.\\n\\n Geldion showed Gary, and that legendary spear, great respect for the early passes of their fight. The Prince could see the fatigue and the pain in Gary\u0027s eyes and in his every movement, and the dislocated shoulder was evident enough.\\n\\n Geldion did not think that there could be much power behind the spear pokes and swipes, but he had no intention of learning the truth firsthand - obviously this badly wounded man had found enough power to knock two of Geldion\u0027s men from the fight already. So the Prince would play defensive, would bide his time and let exhaustion force that heavy speartip to the ground.\\n\\n Geldion\u0027s logic was obvious to Gary as well, and he tried to conserve his energy as much as possible. But that was no easy task with Diane in a fight against a trained soldier barely twenty feet away.\\n\\n \"Shall you watch her die?\" Geldion asked, smiling wickedly.\\n\\n Gary saw the bait for what it was - but could not ignore the image Geldion\u0027s words had conjured in his mind. He roared in protest and started ahead.\\n\\n No, young sprout! came the sobering cry in his head.\\n\\n Geldion sidestepped the awkward attack and slapped at the speartip, knocking it farther aside. Gary was already backpedaling, though, and the Prince got no clear strike.\\n\\n \"Easy,\" Gary whispered over and over to himself. He needed to keep his control.\\n\\n He looked over his shoulder, though, ready to explode, when Diane cried out.\\n\\n She took the only course left open to her.\\n\\n She ran.\\n\\n Diane cut around a hay bale, sensed her enemy\u0027s movement and reversed direction, coming back out the same side as the soldier circled the other way. He was still on her heels, though, and his swishing club clicked off her ankle and nearly tripped her up.\\n\\n \"Mickey!\" she called, but the leprechaun was nowhere about. She went under the loft, cut around another bale, and came right back out. She hopped over the man she had clobbered with the hay bale and nearly tripped again as the semiconscious soldier grabbed at her ankle.\\n\\n Off balance, head low, she cut a straight line across the barn, past the man Mickey had tricked into the shackles, past the beaten TinTamarra, hanging limp at the end of his chains. The eager Connacht soldier came in close pursuit, ignoring the pleas of his trapped comrade, pushing the hanging elf roughly aside.\\n\\n He did not notice that TinTamarra was watching him under half-closed eyelids, and his surprise was complete when the elf\u0027s legs came up suddenly and wrapped about his neck, pulling him off balance.\\n\\n Diane heard the commotion and dared to look back - just in time to see the soldier snap his club up above his head for a solid hit on TinTamarra\u0027s chest. Still the stubborn elf held on, and the man hit him again, and lowered his club to begin a third strike.\\n\\n Diane barreled into the soldier, wrapping him in a tight bear hug, pinning the club down low. The soldier and Diane pitched right over, but held fast in the grasp of the elf\u0027s strong legs, they did not fall all the way to the floor. They hung there, weirdly, the soldier\u0027s neck twisted and his air cut off.\\n\\n Geldion saw the turn of events by the shackles and pressed furiously, his magical dirk/sword throwing sparks whenever it struck the metal tip of Cedric\u0027s spear.\\n\\n Gary matched the Prince\u0027s intensity, though the effort pained him greatly. He swiped with the spear, accepting the jolt as Geldion\u0027s sword connected, and when the Prince sidestepped one thrust and rushed in, Gary promptly retreated, turning as he went.\\n\\n He crashed into one of the barn\u0027s supporting beams.\\n\\n Gary, and Geldion too, heard the crack as Gary\u0027s shoulder popped back into place. Nausea and agony swept over the man; he thought he saw Diane, entangled with the soldier and the hanging elf. But the dazed Gary couldn\u0027t be sure of what he saw at that awful moment.\\n\\n He thought the floor was up in his face, thought one of the barn\u0027s walls was falling outward.\\n\\n He heard the ring as Geldion\u0027s sword slashed the speartip once again, saw the sparks igniting.\\n\\n But they, too, were tilted weirdly, falling and spinning like all the world.\\n\\n The man went limp under her. TinTamarra, his energy expended, let go, and Diane pulled herself from the pile. She knew that Gary was in trouble, knew that she had to help, and so she got right back to her feet and turned about, nursing her swollen hand but stubbornly searching for a weapon.\\n\\n The soldier\u0027s club was not far away, but Diane found suddenly that she had no time to even go for it.\\n\\n Geldion\u0027s sword slashed across, connecting solidly on the shaft of Cedric\u0027s spear. The weapon flew out wide, out of Gary\u0027s grasp. He caught it with his other hand, winced with the shock of pain, then grabbed it again. But his grip was reversed, his defensive posture shattered, and Geldion, sword up high, surely had him.\\n\\n \"Gary!\" Diane cried, running desperately, reaching into the belt pouch Mickey had given back to her in Tir na n\u0027Og, looking for anything that might save the moment.\\n\\n Geldion snapped his head around, shifted as though he would strike Diane down first. His sword remained up high, at the ready, and Diane\u0027s hand came up as well - to block, the Prince figured.\\n\\n She pushed a little button on the strange black box she held, and there came a flash, the likes of which the startled Prince Geldion had never before witnessed. Blinded and thinking some evil sorcery had befallen him, Geldion stumbled backwards, and Diane, ever the opportunist, rushed into him, both her hands locking desperately on his weapon arm.\\n\\n Geldion caught his balance quickly and pushed back, whipping his arm about to pull it loose. He grabbed a handful of Diane\u0027s thick hair and tugged viciously.\\n\\n \"Gary!\"\\n\\n Diane\u0027s cry seemed distant, but her husband did not miss its intensity. He fought through the nausea and the dizziness, forced his eyes to focus, and jabbed straight out with the butt of the spear, popping the Prince in the side of the head and sending him and Diane tumbling to the ground.\\n\\n Diane hung on like a pit bull, and to her surprise, Geldion let go of his sword, which immediately reverted to its dirk form. She understood when she looked up - to see Gary standing over the man, speartip pressed to Geldion\u0027s throat. \\n\\n","sourceLink":"https://allnovel.net/dragonslayer-s-return-spearwielder-s-tale-3/page-12.html","bookId":2186,"book":{"id":2186,"title":"Dragonslayer\u0027s Return (Spearwielder\u0027s Tale #3)","description":"Storyline: Dragonslayer\u0027s Return (Spearwielder\u0027s Tale #3) \\n The threat of war looms over the realm of Faerie, as an evil king brutally supresses his subjects, and a powerful witch wages a campaign of destruction. The peaceful folk of Faerie summon Gary Leger, the heroic Dragonslayer, to return for his ultimate challenge--he must save the kingdom from the eternal curse of war.\\n","cover":"https://allnovel.net/images/dragonslayer-s-return-spearwielder-s-tale-3.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/dragonslayer-s-return-spearwielder-s-tale-3.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:50:43 PM"}}
