{"id":100215,"no":7,"title":"Page 7","content":"High in the boughs of a pine tree, Mickey awoke from a restful sleep to the twang of bows and the screams of men later that night. Truly the leprechaun was bothered by what was going on in the woods all about him, and by the turmoil that had become general in Faerie, but he meant to stay out of the battle. He had gone on the quest to fix the spear, had recovered his precious pot of gold, had helped to put the dragon down, and had even done a bit of spying for Baron Pwyll and the others resisting King Kinnemore, but now Mickey was back in Tir na n\u0027Og, the forest he called home, and by his sensibilities, all of this had become someone else\u0027s problem. He rested back on the pliable pine branch, pulled the front of his tam-o\u0027-shanter down over his eyes, and dreamed of running barefoot through a field of four-leafed clover. Then Mickey heard someone cry out for Kelsey, and the image of the clover field disappeared in the blink of a mischievous gray eye. \"O begorra,\" Mickey muttered, realizing that he could not dismiss it all, not with friends as loyal as Kelsey in danger down below. He popped open an umbrella that conveniently came to his hand, used the pine branch like a spring board and leaped out into the night air, floating down gently to the forest floor. On the ground, the leprechaun tried to figure out from which direction the noise of the fighting was coming, but there were apparently several separate battles raging all at once. Mickey tapped his umbrella (now appearing as a small and carved walking stick) atop a mushroom. \"Good toadstool,\" he asked of the fungi, \"might ye know where Kelsey the elf\u0027s hiding?\" Mickey listened for the answer, and got one (because leprechauns can do those kinds of things), then he politely thanked the mushroom and moved to a crack at the base of the pine in which he had been sleeping. He politely asked the tree for permission to enter, then did, magically traveling along the root system from tree to tree (because leprechauns can do those kinds of things) until he stepped out of a crack in a wide elm near to the fighting. To Mickey\u0027s surprise, he saw not an elf in the small clearing ahead of him, but a human, a Connacht soldier, clutching tightly to a sword and glancing nervously about, as though he had gotten separated from his fellows. How the man\u0027s eyes widened when he turned about and saw a leprechaun standing before him! It seemed as if some craziness came over the soldier then, and all fear flew away, his eyes bulging and his face brightening with a smile. He tossed his weapon aside and dove down at the leprechaun, thinking his fortune found and all the life\u0027s prayers answered. The soldier came up a moment later, clutching his prize, eyes darting this way and that in case any saw. Then he peeked at the catch - and found that he was holding a dirty mushroom. He took off his helmet and scratched at his head. \"Ye got to be quicker than that,\" he heard, and he spun about to see the leprechaun leaning easily against a tree. Cautiously, still holding tight to the mushroom, the soldier approached. \"How\u0027d you do that?\" he asked. Then he blinked, seeing that the leprechaun on the ground was really a mushroom. He looked back to his catch, still a mushroom, and scratched his head again. \"Behind ye,\" Mickey said. The soldier spun about, and saw the leprechaun once again. The man\u0027s hungry grin lasted only the moment it took him to realize that the sprite was sitting atop the shoulder of a very angry elfish warrior. \"Have ye met me friend Kelsey?\" said the leprechaun\u0027s voice, and though this newest illusionary image of Mickey disappeared, the very real Kelsey remained. The soldier threw the mushroom at Kelsey, and the elf promptly batted it aside and advanced - pausing and wincing only when he heard the slapped \"mushroom\" groan. The soldier looked all about for his weapon, spotted it on the ground and dove for it. But Kelsey\u0027s foot stamped upon his fingers as they closed about the swordhilt, and Kelsey\u0027s deadly sword came down, stopping with its keen edge against the side of the soldier\u0027s neck. \"Don\u0027t ye kill him,\" the disheveled Mickey, who was not a mushroom anymore, said to Kelsey. \"It\u0027s not really his fight.\" The soldier turned his head to nod his full agreement with the plea for mercy, but when the man looked upon the stern elf, he fainted away, thinking his life at its end. Kelsey growled and lifted his sword as if to strike. \"By me own eyes,\" Mickey moaned from the side. \"And here I be, thinking the Tylwyth Teg\u0027re the good folk.\" Kelsey winced and let the sword slowly come back to rest against the man\u0027s neck. The elf narrowed his golden eyes as he regarded the smug Mickey. \"Candella is dead,\" Kelsey said, referring to a female elf, a good friend to Kelsey, and more than a mere acquaintance to Mickey. Mickey shook his head slowly, helplessly. \"And what o\u0027 yerself?\" he asked, pointing to Kelsey\u0027s arm, the elf\u0027s white sleeve darkened with fresh blood. Kelsey looked down at the wound. \"A crossbow,\" he explained. \"Just before you appeared.\" Mickey glanced about. They were fully a hundred yards inside the border of Tir na n\u0027Og, and it suddenly struck him as odd to see a soldier so deep in the wood. \"Is he the only one left alive?\" the leprechaun asked, realizing that many other soldiers must have accompanied this one for him to get so far in. \"The only one of two score,\" Kelsey answered grimly. Something seemed very wrong to Mickey, very out of place. \"They tried to get in, then,\" the leprechaun reasoned. \"But why would soldiers, human soldiers who do\u0027no\u0027 see so well in the dark, try to get into Tir na n\u0027Og under the light o\u0027 the moon? Why would they come in at night to fight the elfs that do see well in the dark?\" \"They were pursuing us,\" Kelsey explained. Mickey shrugged and seemed not to understand. \"On penalty of their deaths, were we to escape,\" Kelsey went on. \"Since King Kinnemore prizes the armor and spear of Cedric Donigarten above all other treasures in his realm.\" \"Ye stole the spear and the armor?\" Mickey gawked. Kelsey nodded gravely. \"Then Candella died for the sake o\u0027 the spear and armor?\" Mickey asked incredulously. Kelsey didn\u0027t flinch. \"But ye got none to wear it or wield it,\" the leprechaun reasoned. \"Ye all got yerselfs shot at and chased for the sake of a treasure that\u0027s only for show!\" The leprechaun continued his tirade for a few moments longer, until he realized that Kelsey wasn\u0027t blinking, wasn\u0027t even listening to the arguments. Mickey stopped with a loud huff and stood trembling, hands on hips, one holding the umbrella-turned-walking-stick. \"Well?\" the leprechaun demanded. \"You said that Gary Leger wanted to get back,\" Kelsey answered, as though that should explain everything. It took Mickey a long moment to digest this unexpected turn. In their two adventures side by side, Kelsey had come to trust in Gary, and even to like the man, but Mickey could hardly believe that any member of the haughty Tylwyth Teg would risk his or her life for the sake of any human! \"But I didn\u0027t say I\u0027d bring him in,\" Mickey reasoned. Kelsey didn\u0027t flinch. Gary stood transfixed at the end of a bay, staring across the dark waters of the North Atlantic to the westering sun, its slanted rays skimming the waters about the many pillarlike rocks that stood like gigantic sentinels, silent and proud testaments to ancient times, to times before men and science had dominated the world. The wind was constant and strong, straight off the water, blowing the salty mist into Gary\u0027s face. Its bite was fierce and chill, but Gary didn\u0027t care, couldn\u0027t pull himself away from this place. A hundred yards out in the bay lay a rock island, triangular and imposing. How many ancient mariners had tried to sail in past that rock? Gary wondered. How many had braved the winds and the cold waters to come to this shore, and how many more had died out there, their feeble boats splintered against the timeless rocks? It seemed likely to Gary that more had perished than had successfully navigated this stretch. There was a power here far greater than the wood of boats, one that transcended even the human spirit. A preternatural power, a sheer strength that had not been tamed by the encroachment of civilization. Standing near that bay, in Duntulme, on the northern rim of the Isle of Skye, Gary Leger felt at once insignificant and important. He was a little player in a great universe, a tiny drop of dye on the great tapestry of nature. But he was indeed part of that tapestry, part of that majesty. He couldn\u0027t tame these waters and these pillars, but he could share in their glory. That was the most important lesson Gary had learned in the land of Faerie. That is what the Buldrefolk living amongst the mighty peaks of Dvergamal, and the Tylwyth Teg, so at home in the forest Tir na n\u0027Og, had shown to him. \"It\u0027s incredible,\" Diane whispered, standing beside him, her arm in his. In full agreement, Gary put his hand over her forearm and led on, picking his way across the sharp rocks and wet sand. The land climbed steeply along the left side of the bay, coming to a high point where the somewhat sheltered water widened into the North Atlantic. On that pinnacle stood the ruins of a small castle, an ancient outpost. Diane resisted as Gary made his way along the curving beach, to the narrow trail that topped the edge of the cliff face. \"Most of the others are going up there tomorrow,\" she explained, for the trail seemed treacherous in the fast- dying light. She noticed, too, that Gary had his small pack with him, and she worried that if he got up on that cliff, it might be a long time before she could coax him back down. \"That\u0027s why we\u0027re going up there today,\" Gary replied calmly, and moved on. Despite her very real fears, Diane didn\u0027t argue. The sight was spectacular, to say the least, and her heart was pulling at her to go up to that pinnacle, that lost outpost, almost as much as Gary\u0027s was pulling at him. She pictured what the sunset might look like from the high vantage point, realized that she would glimpse an eternal scene, the same view as that of the men who had once manned that outpost. As was her habit on this trip, Diane carried two cameras with her: her reliable old Pentax 35mm and a Polaroid. All along this trip, whenever Diane spotted what looked like a reasonable shot, she\u0027d click one off with the Polaroid. As that picture developed before her eyes, she would get a better idea of the effect of the lighting and the scenery, and then she\u0027d go to work with the Pentax, often clicking off two rolls at a stretch. The worst part of the climb was the ever-present sheep manure on the trail, slimy and slippery. A rope had been strung to the right side of the path, offering some protection from a drop into the bay, and a sturdier fence (though it was broken in many places) had been erected on the left, portioning off a sheep field. Diane had always thought that sheep were cute little beasties, but when they came towards her now, on that narrow and slippery trail, she was more than a little nervous. Gary would have been nervous, too, if he had been paying any attention to the sheep. His eyes were squarely focused, transfixed, on the ruins up above. He felt the energy of this place more keenly with every step, felt the tingles of magic building in the air about him. The wind increased tenfold when the pair crested the hill, and they could both understand what had so battered the walls of this ancient bastion. Men had come to this place and built their stone fortress, and had probably thought themselves invulnerable up on that cliff, behind thick stone walls and surrounded by the treacherous and rocky waters. Gary couldn\u0027t imagine that any enemy humans had conquered this fortress, or destroyed its walls, that any hostile ships (the longships of Vikings, perhaps?) had put up on the beach. But the fortress had been defeated. It had been taken down by the incessant and undeniable power of nature. Like the men who had manned it, the constructed castle had been taken down and turned to crumbling dust, a temporary bastion in an eternal universe. Gary found a high perch on a fallen slab. He looked to the low sun, then spread his arms high and wide above him to catch as much of the wind as he possibly could, to feed off its strength. Diane milled about behind him, clicking away with her Pentax. So entranced was she, so alive at that moment, that the normally sensible woman crawled out through a hole in the wall to a precarious perch on the very edge of the northern cliff, simply to get a good angle on a shot. Then, when she came back within the boundaries of the fortress, she braved a trek into a small and dark tunnel, though a plaque on the stone warned against entry. Gary noticed some flickers of light, and turned to the side curiously as Diane emerged from the other end of the tunnel, her camera flash in hand and her smile from ear to ear. \"You\u0027re not supposed to go down there,\" he remarked. Diane\u0027s smile was infectious, made Gary picture her as a little girl with her hand in the proverbial cookie jar. He was glad that she was so entranced by this place, because he had already made up his mind that the sun would be long gone before he made his way back down to the bay and the inn. It got cold after sunset and the two huddled together behind a fallen slab of rock. \"It will probably rain,\" Diane remarked, a reasonable guess in this perpetually gloomy land. There were stars shining up above them, but both had been on the isles long enough to realize that could change in the matter of a few minutes. They talked and they cuddled; they kissed and they cuddled some more. Gary spoke of his adventures in Faerie, and Diane listened, and under that enchanting sky in that enchanting place, she could almost hear the song of the fairies and the rhythmic ringing of the Buldrefolk hammers. Gary realized that Diane\u0027s patience with his wild stories was a precious gift. In all the years since his first trip, Diane had been the only one he had told. Even his father had not known. \"Were there any unicorns?\" Diane asked him at one point, a question that she often asked him during his recountings. Gary shook his head. \"None that I saw,\" he replied. \"But I wouldn\u0027t bet against it.\" \"I\u0027d love to see a unicorn,\" said Diane. \"Ever since I was a little gir . . .\" She stopped abruptly and Gary turned to her, hardly able to make out her features in the dark night. \"What?\" he prompted. There came no reply. \"Diane?\" he asked, nudging her a bit. She rolled with the push and let out a profound snore. Gary laughed, thinking it cute how quickly she had fallen off to sleep. Too quickly, Gary suddenly realized. How could she possibly be talking one instant and snoring the next? Gary went on the alert, rolling up into a crouch. \"Where are you?\" he asked into the quiet night. He fully expected what came next, but still found that he could hardly draw his breath. A tiny sprite, no more than a foot tall, stepped up onto the rock slab, small bow in hand. The same bow the creature had used to shoot Diane, Gary knew, remembering well the sleeping poison of the sprites. \"Mickey wants me back?\" Gary reasoned. The sprite gave him a smirk and half turned on the slab, leading Gary\u0027s gaze to a small clearing just beyond the back edge of the ruins. A glow came up, a ring of soft lights, accompanied by a sweet melody, tiny voices singing arcane words that Gary did not understand. With a disarming smile on his face, Gary lifted his small pack and started to rise. His hand reached into the pack and shot out suddenly, and the sprite, quick as it was, could not avoid the wide-spreading reach of the hurled net. The creature thrashed and scrambled, but Gary was on it, quick as a cat. He grabbed it up in one hand, cried out as it drove a tiny dagger into his palm, then closed his other hand over its head. \"All I want is for you to take her along with me,\" he explained to the suddenly calm sprite. \"Just take her to Faerie. You can do that.\" The creature uttered some response, its high-pitched voice moving too fast for Gary to decipher any words. Gary closed his hand a bit tighter over the sprite\u0027s head. \"Tell them to dance around her,\" he said, suddenly grim. \"Or I\u0027ll squish your little head.\" It was an idle threat, of course; Gary would never harm one of Faerie\u0027s fairies. But the sprite, engulfed by a pair of hands that were each nearly half the size of its entire body, was in no position to take any chances. Again came its squeaking voice, and a moment later, the fairy ring broke apart, the soft lights flickering away into the darkness. Gary didn\u0027t know if he had been deceived, and he clutched the sprite a bit tighter, fearing that it too would fade away into the night. He breathed easier when the lights and the song reappeared, encircling Diane with their magic. Gary let go of the sprite and removed the net and quickly joined his wife in the ring. He winced when a not-unexpected little arrow stung him in the butt - but he figured he had earned that. Gary didn\u0027t fall asleep immediately, though, felt no tingling poison coursing through his veins. He looked back to the sprite, on the slab still, bow in hand and glaring wickedly his way, and he realized that the arrow had not been poison-tipped, had not been fired for any better reason than payback. Gary started to say, \"Touche,\" but stopped and fought hard to hold his balance as all the world blurred around him, blurred and begin to spin, slowly and smoothly, like the soft lights of the fairy ring. And then they were on a ridge in Tir na n\u0027Og, under a beautiful starry sky and with a very confused Mickey McMickey staring open-mouthed at the sleeping Diane. Gary tossed a mischievous wink and a smile at the leprechaun\u0027s unusually stern expression, but Mickey just shook his head slowly, back and forth.","sourceLink":"https://allnovel.net/dragonslayer-s-return-spearwielder-s-tale-3/page-7.html","bookId":2186,"book":{"id":2186,"title":"Dragonslayer\u0027s Return (Spearwielder\u0027s Tale #3)","description":"Storyline: Dragonslayer\u0027s Return (Spearwielder\u0027s Tale #3) The threat of war looms over the realm of Faerie, as an evil king brutally supresses his subjects, and a powerful witch wages a campaign of destruction. The peaceful folk of Faerie summon Gary Leger, the heroic Dragonslayer, to return for his ultimate challenge--he must save the kingdom from the eternal curse of war.","cover":"https://allnovel.net/images/dragonslayer-s-return-spearwielder-s-tale-3.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/dragonslayer-s-return-spearwielder-s-tale-3.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:50:43 PM"}}
