{"id":1345,"no":1,"title":"Chapter 1. Birth and Education—Cambridge.","content":"I cannot, perhaps, more fitly begin this short biography than with some words in which its subject has expressed his own feelings as to the spirit in which such a task should be approached. “Silence,” says Wordsworth, “is a privilege of the grave, a right of the departed: let him, therefore, who infringes that right by speaking publicly of, for, or against, those who cannot speak for themselves, take heed that he opens not his mouth without a sufficient sanction. Only to philosophy enlightened by the affections does it belong justly to estimate the claims of the deceased on the one hand, and of the present age and future generations on the other, and to strike a balance between them. Such philosophy runs a risk of becoming extinct among us, if the coarse intrusions into the recesses, the gross breaches upon the sanctities, of domestic life, to which we have lately been more and more accustomed, are to be regarded as indications of a vigorous state of public feeling. The wise and good respect, as one of the noblest characteristics of Englishmen, that jealousy of familiar approach which, while it contributes to the maintenance of private dignity, is one of the most efficacious guardians of rational public freedom.” \n \n In accordance with these views the poet entrusted to his nephew, the late Bishop of Lincoln, the task of composing memoirs of his life, in the just confidence that nothing would by such hands be given to the world which was inconsistent with the dignity either of the living or of the dead. From those memoirs the facts contained in the present work have been for the most part drawn. It has, however, been my fortune, through hereditary friendships, to have access to many manuscript letters and much oral tradition bearing upon the poet’s private life;1 and some details and some passages of letters hitherto unpublished, will appear in these pages. It would seem, however, that there is but little of public interest, in Wordsworth’s life which has not already been given to the world, and I have shrunk from narrating such minor personal incidents as he would himself have thought it needless to dwell upon. I have endeavoured, in short, to write as though the Subject of this biography were himself its Auditor, listening, indeed, from some region where all of truth is discerned, and nothing but truth desired, but checking by his venerable presence, any such revelation as public advantage does not call for, and private delicacy would condemn. \n \n As regards the critical remarks which these pages contain. I have only to say that I have carefully consulted such notices of the poet as his personal friends have left us, and also, I believe, nearly every criticism of importance which has appeared on his works. I find with pleasure that a considerable agreement of opinion exists,— though less among professed poets or critics, than among men of eminence in other departments of thought or action whose attention has been directed to Wordsworth’s poems. And although I have felt it right to express in each case my own views with exactness, I have been able to feel that I am not obtruding on the reader any merely fanciful estimate in which better accredited judges would refuse to concur. \n \n 1 I take this opportunity of thanking Mr. William Wordsworth, the son (now deceased), and Mr. William Wordsworth, the grandson, of the poet, for help most valuable in enabling me to give a true impression of the poet’s personality.] \n \n Without further preface I now begin my story of Wordsworth’s life, in words which he himself dictated to his intended biographer. “I was born,” he said, “at Cockermouth, in Cumberland, on April 7th, 1770, the second son of John Wordsworth, attorney-at-law—as lawyers of this class were then called—and law-agent to Sir James Lowther, afterwards Earl of Lonsdale. My mother was Anne, only daughter of William Cookson, mercer, of Penrith, and of Dorothy, born Crackanthorp, of the ancient family of that name, who from the times of Edward the Third had lived in Newbiggen Hall, Westmoreland. My grandfather was the first of the name of Wordsworth who came into Westmoreland, where he purchased the small estate of Sockbridge. He was descended from a family who had been settled at Peniston, in Yorkshire, near the sources of the Don, probably before the Norman Conquest. Their names appear on different occasions in all the transactions, personal and public, connected with that parish; and I possess, through the kindness of Colonel Beaumont, an almery, made in 1525, at the expense of a William Wordsworth, as is expressed in a Latin inscription carved upon it, which carries the pedigree of the family back four generations from himself. The time of my infancy and early boyhood was passed, partly at Cockermouth, and partly with my mother’s parents at Penrith, where my mother, in the year 1778, died of a decline, brought on by a cold, in consequence of being put, at a friend’s house in London, in what used to be called ‘a best bedroom.’ My father never recovered his usual cheerfulness of mind after this loss, and died when I was in my fourteenth year, a schoolboy, just returned from Hawkshead, whither I had been sent with my elder brother Richard, in my ninth year.” \n \n “I remember my mother only in some few situations, one of which was her pinning a nosegay to my breast, when I was going to say the catechism in the church, as was customary before Easter. An intimate friend of hers told me that she once said to her, that the only one of her five children about whose future life she was anxious was William; and he, she said, would be remarkable, either for good or for evil. The cause of this was, that I was of a stiff, moody, and violent temper; so much so that I remember going once into the attics of my grandfather’s house at Penrith, upon some indignity having been put upon me, with an intention of destroying myself with one of the foils, which I knew was kept there. I took the foil in hand, but my heart failed. Upon another occasion, while I was at my grandfather’s house at Penrith, along with my eldest brother, Richard, we were whipping tops together in the large drawing-room, on which the carpet was only laid down upon particular occasions. The walls were hung round with family pictures, and I said to my brother, ‘Dare you strike your whip through that old lady’s petticoat?’ He replied, ‘No, I won’t.’ ‘Then’, said I, ‘here goes!’ and I struck my lash through her hooped petticoat; for which, no doubt, though I have forgotten it, I was properly punished. But, possibly from some want of judgment in punishments inflicted, I had become perverse and obstinate in defying chastisement, and rather proud of it than otherwise.” \n \n “Of my earliest days at school I have little to say, but that they were very happy ones, chiefly because I was left at liberty then, and in the vacations, to read whatever books I liked. For example, I read all Fielding’s works, Don Quixote, Gil Bias, and any part of Swift that I liked—Gulliver’s Travels, and the Tale of the Tub, being both much to my taste. It may be, perhaps, as well to mention, that the first verses which I wrote were a task imposed by my master; the subject, The Summer Vacation; and of my own accord I added others upon Return to School. There was nothing remarkable in either poem; but I was called upon, among other scholars, to write verses upon the completion of the second centenary from the foundation of the school in 1585 by Archbishop Sandys. These verses were much admired—far more than they deserved, for they were but a tame imitation of Pope’s versification, and a little in his style.” \n \n But it was not from exercises of this kind that Wordsworth’s school-days drew their inspiration. No years of his life, perhaps, were richer in strong impressions; but they were impressions derived neither from books nor from companions, but from the majesty and loveliness of the scenes around him;—from Nature, his life-long mistress, loved with the first heats of youth. To her influence we shall again recur; it will be most convenient first to trace Wordsworth’s progress through the curriculum of ordinary education. \n \n It was due to the liberality of Wordsworth’s two uncles, Richard Wordsworth and Christopher Crackanthorp (under whose care he and his brothers were placed at there father’s death, in 1783), that his education was prolonged beyond his school-days. For Sir James Lowther, afterwards Lord Lonsdale,—whose agent Wordsworth’s father, Mr. John Wordsworth, was—becoming aware that his agent had about 5000￡ at the bank, and wishing, partly on political grounds, to make his power over him absolute, had forcibly borrowed this sum of him, and then refused to repay it. After Mr. John Wordsworth’s death much of the remaining fortune which he left behind him was wasted in efforts to compel Lord Lonsdale to refund this sum; out it was never recovered till his death in 1801, when his successor repaid 8500￡ to the Wordsworths, being a full acquittal, with interest, of the original debt. The fortunes of the Wordsworth family were, therefore, at a low ebb in 1787, and much credit is due to the uncles who discerned the talents of William and Christopher, and bestowed a Cambridge education on the future Poet Laureate, and the future Master of Trinity. \n \n In October, 1787, then, Wordsworth went up as an undergraduate to St. John’s College, Cambridge. The first court of this College, in the south-western corner of which were Wordsworth’s rooms, is divided only by a narrow lane from the Chapel of Trinity College, and his first memories are of the Trinity clock, telling the hours “twice over, with a male and female voice”, of the pealing organ, and of the prospect when \n \n From my pillow looking forth, by light \n \n Of moon or favouring stars I could behold \n \n The antechapel, where the statue stood \n \n Of Newton with his prism and silent face. \n \n The marble index of a mind for ever \n \n Voyaging through strange seas of Thought, alone. \n \n For the most part the recollections which Wordsworth brought away from Cambridge are such as had already found expression more than once in English literature; for it has been the fortune of that ancient University to receive in her bosom most of that long line of poets who form the peculiar glory of our English speech. Spenser, Ben Jonson, and Marlowe; Dryden, Cowley, and Waller; Milton, George Herbert, and Gray—to mention only the most familiar names—had owed allegiance to that mother who received Wordsworth now, and Coleridge and Byron immediately after him. “Not obvious, not obtrusive, she;” but yet her sober dignity has often seemed no unworthy setting for minds, like Wordsworth’s, meditative without languor, and energies advancing without shock or storm. Never, perhaps, has the spirit of Cambridge been more truly caught than in Milton’s Penseroso; for this poem obviously reflects the seat of learning which the poet had lately left, just as the Allegro depicts the cheerful rusticity of the Buckinghamshire village which was his now home. And thus the Penseroso was understood by Gray, who, in his Installation Ode, introduces Milton among the bards and sages who lean from heaven, \n \n To bless the place where, on their opening soul, \n \n First the genuine ardour stole. \n \n “’Twas Milton struck the deep-toned shell,” and invoked with the old affection the scenes which witnessed his best and early years: \n \n Ye brown o’er-arching groves, \n \n That contemplation loves, \n \n Where willowy Camus lingers with delight! \n \n Oft at the blush of dawn \n \n I trod your level lawn. \n \n Oft wooed the gleam of Cynthia silver-bright \n \n In cloisters dim, far from the haunts of Folly, \n \n With Freedom by my side, and soft-eyed Melancholy. \n \n And Wordsworth also “on the dry smooth-shaven green” paced on solitary evenings “to the far-off curfew’s sound,” beneath those groves of forest-trees among which “Philomel still deigns a song” and the spirit of contemplation lingers still; whether the silent avenues stand in the summer twilight filled with fragrance of the lime, or the long rows of chestnut engirdle the autumn river-lawns with walls of golden glow, or the tall elms cluster in garden or Wilderness into towering citadels of green. Beneath one exquisite ash-tree, wreathed with ivy, and hung in autumn with yellow tassels from every spray, Wordsworth used to linger long “Scarcely Spenser’s self,” he tells us, \n \n Could have more tranquil visions in his youth, \n \n Or could more bright appearances create \n \n Of human forms with superhuman powers, \n \n Than I beheld loitering on calm clear nights \n \n Alone, beneath this fairy work of earth. \n \n And there was another element in Wordsworth’s life at Cambridge more peculiarly his own—that exultation which a boy born among the mountains may feel when he perceives that the delight in the external world which the mountains have taught him has not perished by uprooting, nor waned for want of nourishment in field or fen; that even here, where nature is unadorned, and scenery, as it were, reduced to its elements,—where the prospect is but the plain surface of the earth, stretched wide beneath an open heaven,—even here he can still feel the early glow, can take delight in that broad and tranquil greenness, and in the august procession of the day. \n \n As if awakened, summoned, roused, constrained, \n \n I looked for universal things; perused \n \n The common countenance of earth and sky— \n \n Earth, nowhere unembellished by some trace \n \n Of that first Paradise whence man was driven; \n \n And sky, whose beauty and bounty are expressed \n \n By the proud name she bears—the name of Heaven. \n \n Nor is it only in these open-air scenes that Wordsworth has added to the long tradition a memory of his own. The “storied windows richly dight,” which have passed into a proverb in Milton’s song, cast in King’s College Chapel the same “soft chequerings” upon their framework of stone while Wordsworth watched through the pauses of the anthem the winter afternoon’s departing glow: \n \n Martyr, or King, or sainted Eremite, \n \n Whoe’er ye be that thus, yourselves unseen, \n \n Imbue your prison-bars with solemn sheen, \n \n Shine on, until ye fade with coming Night. \n \n From those shadowy seats whence Milton had heard “the pealing organ blow to the full-voiced choir below,” Wordsworth too gazed upon— \n \n That branching roof \n \n Self-poised, and scooped into ten thousand cells \n \n Where light and shade repose, where music dwells \n \n Lingering, and wandering on as both to die— \n \n Like thoughts whose very sweetness yieldeth proof \n \n That they were born for immortality. \n \n Thus much, and more, there was of ennobling and unchangeable in the very aspect and structure of that ancient University, by which Wordsworth’s mind was bent towards a kindred greatness. But of active moral and intellectual life there was at that time little to be found within her walls. The floodtide of her new life had not yet set in: she was still slumbering, as she had slumbered long, content to add to her majesty by the mere lapse of generations, and increment of her ancestral calm. Even had the intellectual life of the place been more stirring, it is doubtful how far Wordsworth would have been welcomed, or deserved, to be welcomed, by authorities or students. He began residence at seventeen, and his northern nature was late to flower. There seems, in fact, to have been even less of visible promise about him than we should have expected; but rather something untamed and insubordinate, something heady and self-confident; an independence that seemed only rusticity, and an indolent ignorance which assumed too readily the tones of scorn. He was as yet a creature of the lakes and mountains, and love for Nature was only slowly leading him to love and reverence for man. Nay, such attraction as he had hitherto felt for the human race had been interwoven with her influence in a way so strange that to many minds it will seem a childish fancy not worth recounting. The objects of his boyish idealization had been Cumbrian shepherds—a race whose personality seems to melt into Nature’s—who are united as intimately with moor and mountain as the petrel with the sea. \n \n A rambling schoolboy, thus \n \n I felt his presence in his own domain \n \n As of a lord and master—or a power, \n \n Or genius, under Nature, under God; \n \n Presiding; and severest solitude \n \n Had more commanding looks when he was there. \n \n When up the lonely brooks on rainy days \n \n Angling I went, or trod the trackless hills \n \n By mists bewildered, suddenly mine eyes \n \n Have glanced upon him distant a few steps, \n \n In size a giant, stalking through thick fog, \n \n His sheep like Greenland bears; or, as he stepped \n \n Beyond the boundary line of some hill-shadow, \n \n His form hath flashed upon me, glorified \n \n By the deep radiance of the setting sun; \n \n Or him have I descried in distant sky, \n \n A solitary object and sublime, \n \n Above all height! Like an a?rial cross \n \n Stationed alone upon a spiry rock \n \n Of the Chartreuse, for worship. Thus was man \n \n Ennobled outwardly before my sight; \n \n And thus my heart was early introduced \n \n To an unconscious love and reverence \n \n Of human nature; hence the human form \n \n To me became an index of delight, \n \n Of grace and honour, power and worthiness. \n \n “This sanctity of Nature given to man,”—this interfusion of human interest with the sublimity of moor and hill,—formed a typical introduction to the manner in which Wordsworth regarded mankind to the end,—depicting him as set, as it were, amid impersonal influences, which make his passion and struggle but a little thing; as when painters give but a strip of their canvas to the fields and cities of men, and overhang the narrowed landscape with the space and serenity of heaven. \n \n To this distant perception of man—of man “purified, removed, and to a distance that was fit”—was added, in his first summer vacation, a somewhat closer interest in the small joys and sorrows of the villagers of Hawkshead,—a new sympathy for the old Dame in whose house the poet still lodged, for “the quiet woodman in the woods,” and even for the “frank-hearted maids of rocky Cumberland,” with whom he now delighted to spend an occasional evening in dancing and country mirth. And since the events in this poet’s life are for the most part inward and unseen, and depend upon some stock and coincidence between the operations of his spirit and the cosmorama of the external world, he has recorded with especial emphasis a certain sunrise which met him as he walked homewards from one of these scenes of rustic gaiety,—a sunrise which may be said to have begun that poetic career which a sunset was to close: \n \n Ah! Need I say, dear Friend! That to the brim \n \n My heart was full; I made no vows, but vows \n \n Were then made for me; bond unknown to me \n \n Was given, that I should be, else sinning greatly, \n \n A dedicated Spirit. \n \n His second long vacation brought him a further gain in human affections. His sister, of whom he had seen little for some years, was with him once more at Penrith, and with her another maiden, \n \n By her exulting outside look of youth \n \n And placid under-countenance, first endeared; \n \n whose presence now laid the foundation of a love which was to be renewed and perfected when his need for it was full, and was to be his support and solace to his life’s end. His third long vacation he spent in a walking tour in Switzerland. Of this, now the commonest relaxation of studious youth, he speaks as of an “unprecedented course,” indicating “a hardy slight of college studies and their set rewards.” And it seems, indeed, probable that Wordsworth and his friend Jones were actually the first undergraduates who ever spent their summer in this way. The pages of the Prelude which narrate this excursion, and especially the description of the crossing of the Simplon,— \n \n The immeasurable height \n \n Of woods decaying, never to be decayed,— \n \n form one of the most impressive parts of that singular autobiographical poem, which, at first sight so tedious and insipid, seems to gather force and meaning with each fresh perusal. These pages, which carry up to the verge of manhood the story of Wordsworth’s career, contain, perhaps, as strong and simple a picture as we shall anywhere find of hardy English youth,—its proud self-sufficingness and careless independence of all human things. Excitement, and thought, and joy, seem to come at once at its bidding; and the chequered and struggling existence of adult men seems something which it need never enter, and hardly deigns to comprehend. \n \n Wordsworth and his friend encountered on this tour many a stirring symbol of the expectancy that was running through the nations of Europe. They landed at Calais “on the very eve of that great federal day” when the Trees of Liberty were planted all over France. They met on their return \n \n The Brabant armies on the fret \n \n For battle in the cause of liberty. \n \n But the exulting pulse that ran through the poet’s veins could hardly yet pause to sympathize deeply even with what in the world’s life appealed most directly to ardent youth. \n \n A stripling, scarcely of the household then \n \n Of social life, I looked upon these things \n \n As from a distance; heard, and saw, and felt— \n \n Was touched, but with no intimate concern. \n \n I seemed to move along them as a bird \n \n Moves through the air—or as a fish pursues \n \n Its sport, or feeds in its proper element. \n \n I wanted not that joy, I did not need \n \n Such help. The ever-living universe, \n \n Turn where I might, was opening out its glories; \n \n And the independent spirit of pure youth \n \n Called forth at every season new delights, \n \n Spread round my steps like sunshine o’er green fields. \n \n \n","sourceLink":"http://novel.tingroom.com/mingren/1460/43875.html","bookId":48,"book":{"id":48,"title":"Wordsworth","description":"简介： I cannot, perhaps, more fitly begin this short biography than with some words in which its subject has expressed his own feelings as to the spirit in which such a task should be approached. Silence, says Wordsworth, is a privilege of the grave, a rig...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/1460","creation":"Aug 1, 2019 12:18:13 AM","modification":"Aug 1, 2019 12:18:13 AM"}}
