{"id":42064,"no":13,"title":"CHAPTER XII THE SUMMIT OF CHILKAT PASS","content":"The prediction of snow was fulfilled to the letter. When the Bradfords awoke, they found the air thick with feathery flakes, which came gently and noiselessly down on tent and tree and drift. Already the green boughs of the spruces were heavily laden. In Mr. Bradford\u0027s thermometer the mercury stood at twenty-five degrees above zero. \n \n Long Peter noted the direction of the wind, which was so light as hardly to be perceptible. Then he examined the snowflakes, which were damp and large, indicating that the cloud currents of the air were not intensely cold. \n \n \"We can go,\" said he to Uncle Will. \n \n Breakfast hurriedly disposed of, the sleds were loaded with half the supplies, oiled canvas being bound over the goods to keep them dry. Uncle Will knew that Long Peter was one of the most experienced pathfinders in his tribe, and would not undertake the march if he were not well able to bring them through in safety. By seven o\u0027clock they were on their way, the Indian leading and treading a path with his narrow, turned-up[102] snow-shoes. The others followed easily in his track, all wearing snow-shoes, for otherwise they would have broken through the thin crust of the old snow, and the sleds would frequently have been stalled. \n \n As they had camped in the edge of the woods, they were quickly out of sight of the trees, and traversing a barren, snowy waste which presented a gentle upward incline. The falling snow cut off the distant prospect, and in the absence of all landmarks the Indian was guided solely by the slope of the ground and the direction of the wind. Uncle Will, however, verified his course from time to time by a small compass. \n \n After travelling thus about a mile, they arrived at the edge of a bank or bluff, which sloped steeply down to a level space fifty feet below. \n \n \"Devil\u0027s Slide,\" said the Indian to Uncle Will, in a tone of satisfaction. \n \n \"Yes,\" replied the latter. \"I remember this place and its curious name very well.\" \n \n \"I don\u0027t see how we are going to get these loads down,\" said Roly. \"It\u0027s awfully steep.\" \n \n Long Peter, so far as his own sled was concerned, quickly solved that problem. He drew his load to the edge of the bluff, and then, with apparent recklessness, threw himself upon it just as it toppled over the brink. The others held their breath while man and sled went down, as Roly[103] said afterward, \"like greased lightning;\" but the runners cut through the snow at the bottom of the hill, and the outfit brought up safely. \n \n Mr. Bradford declared that might do for Long Peter, but he didn\u0027t care to risk it. He accordingly let his sled go alone, which it did gracefully enough until half-way down, when it swerved, upset, and rolled over and over, the gee-pole finally sticking in the snow and ending its wild career. It was necessary to repack the whole load. \n \n Uncle Will\u0027s sled fared better. As for the boys, they ventured to coast down as Long Peter had done, and reached the bottom in a whirl of snow without any mishap. \n \n Near the foot of the slide they entered a narrow ravine,—the bed of a mountain brook now buried deep under the drifts,—and followed it up for a mile or two, emerging at length upon an almost level expanse, which Uncle Will said was one of the highest places on the pass. \n \n \"Indeed,\" said he, \"we may as well call this the summit, although for many miles we shall continue at about this height. There is a shallow lake in the little hollow ahead, Long Peter tells me, but you wouldn\u0027t guess it to look at this unbroken snow-field.\" \n \n On their right they could now dimly see, through the falling flakes, an abrupt mountain peak, whose lower[104] slopes they were already skirting. Its top was cut into several sharp points like saw-teeth. Uncle Will informed his friends that it was one of the best landmarks on the pass, being visible in fair weather for miles in either direction,—in fact, it was such a steadfast, reliable peak that it had earned the name, \"Mount Stay-there.\" To the left was a low ridge of rounded hills, beyond which nothing could be seen in the thick air. It was here that the Bradfords discovered the first, or five-mile cache of the Mysterious Thirty-six,—a huge pile of boxes and sacks protected from the weather by oiled canvas. \n \n Drawing their sleds into the lee of the goods, they seated themselves for a brief and much needed rest, for both of the boys were complaining of their backs, and Mr. Bradford suffered considerably in the same way. Their feet, too, protested with almost equal insistence against the present journey, coming as it did hard upon the excessive strain of the preceding week. No one thought of calling himself disabled, however, and the pain was borne patiently, and for the most part silently. The soreness in their faces and fingers continued too, but that was a minor evil. \n \n Roly presently turned his head and listened intently. \"What is that noise?\" he asked,—\"that clucking which sounds so near? I can\u0027t see anything, though I\u0027ve heard it several times.\" \n \n \"You\u0027ll have to look sharp to see those visitors,\"[105] answered Uncle Will. \"What you hear is the call of the ptarmigan, a bird which in summer is brown, but in winter is white as the snow.\" \n \n \"So we\u0027re in a ptarmigan country, are we?\" said Mr. Bradford. \"I believe that bird is considered quite a delicacy.\" \n \n \"There\u0027s nothing finer,\" said his brother. \"We shall have plenty of ptarmigan from now on.\" \n \n \"What do the birds live on?\" asked David. \"I don\u0027t see anything but snow here.\" \n \n His uncle replied that there were places where the wind kept the ground bare, allowing the birds to pick seeds from the grasses, and buds from the willows. \n \n \"There!\" exclaimed Roly, who had been gazing steadily into the storm, \"I see two of them on the little knoll yonder. They\u0027re not quite as big as the spruce partridge.\" \n \n The boys wished to add them to the larder, but as revolvers were the only available weapons, and it would not do to stray away from the party, Mr. Bradford vetoed the proposition, saying that they would undoubtedly have better opportunities. \n \n \"What a funny note they have!\" said Roly. \"I do believe they are calling Long Peter. Listen, now. \u0027Peter, Peter, Peter; come over, come over.\u0027\" \n \n The others agreed that this was a very fair interpretation, and the Indian exclaimed, \"Me come over[106] bime-by; make ptarmigan sick,\"—whereat they were all amused, and for the moment forgot their pain and discomfort. \n \n It would not do, however, to rest too long, for they were becoming chilled, and stiff in every joint. With much limping until renewed exercise had limbered their sore muscles, the little band resumed the march, making brief halts when their breath gave out on the hills, but gaining ground the rest of the time slowly but steadily. Long Peter turned to the left from the base of Mount Stay-there, and for several miles followed the northeastern slope of a range of low, rounded hills, descending gradually until he reached the valley of a brook which Uncle Will said must be one of the sources of the Chilkat, since it flowed to the south. The brook was buried under the snow for the most part, but near noon an open place was discovered, to which, with mouths parched from toil, they all rushed, for there had been no water to drink since leaving the brook at Rainy Hollow, and eating snow was prohibited, owing to repeated warnings from the Indian that it would \"make sick.\" Had it not been for the beef tablets, they would have suffered more than they did. \n \n Here they ate a cold repast of salt pork and hard-tack, and never did food taste better than those thick slices of fat meat. The dry, tough crackers, too, now that there was water in plenty, seemed sweeter than the[107] sweetest morsel at home. Thus do hunger and hard work transform the rudest fare. \n \n After the meal, and a half-hour\u0027s rest, the snow became increasingly sticky, clogging beneath their snow-shoes in hard, icy masses, and making those articles extremely heavy, so that it was necessary to halt often and rap off the frozen particles. The boys were getting very tired, and in spite of their light loads were fain, time and again, to pause for breath and a rest. Hour after hour hardly a word was spoken, no one having any surplus energy to expend in that way. David was really more exhausted than Roly, for though the older, he was the weaker, owing to his rapid growth; but, with an elder brother\u0027s pride, he would have dropped rather than complain first. So for the greater part of the afternoon he struggled on in silence, scarcely able to drag one foot after the other, but pluckily dogging his father\u0027s sled, though at last his head swam so that he fairly wavered as he walked. Poor fellow! he realized, as never before, how light in reality were the tasks of home and school, which had seemed so often distasteful and hard. He thought of his mother and Helen by the comfortable fireside, and then of a bright-haired girl waving her handkerchief to him from the wharf,—and then he knew no more. \n \n It was a cry from Roly which gave the others the first intimation of David\u0027s collapse. Roly had been close[108] behind him, bringing up the rear of the procession, and had seen his brother pitch forward like a log into the snow and lie there motionless. Mr. Bradford and Uncle Will ran back in alarm, and while the former placed a coat under David\u0027s head and rubbed his forehead with snow, the other, after feeling his pulse, drew forth a flask of brandy, which he carried for such emergencies, and poured a little between the boy\u0027s lips. It was several minutes before he opened his eyes and asked where he was, and what was the matter. \n \n Seeing that he was reviving, the others held a hurried consultation. It was now about four o\u0027clock. Uncle Will and Long Peter, both of whom were well fitted to judge, were of the opinion that in spite of many rests and a snail-like progress, they had fully covered ten miles, as they had planned to do. The return journey with empty sleds was still before them, and must be accomplished before nightfall. Long Peter moreover looked skyward, and shook his head ominously. \n \n \"Wind come bime-by,\" said he. \"We stop here—make cache—go back quick. Too much wind no good!\" \n \n \"That\u0027s just what we\u0027ve got to do,\" said Uncle Will, observing the signs of the storm\u0027s increase. \"Off with the goods, and don\u0027t lose a minute!\" \n \n Boxes and bags were hurriedly loosed from the lashings, and piled in a high heap, so that the topmost ones would remain visible above the deepest snow-fall. The[109] cache was then covered with oiled canvas held in place by boxes, loose ropes were gathered up and fastened upon the sleds, and all was ready. \n \n Now came the question of what to do with David, who was sitting up, faint and dazed, but undaunted. He insisted that he could walk in a few moments, but the others would not hear of it, for no sooner did he try to rise than he fell back again weak and dizzy. It was decided that he should lie upon a long sled and be drawn by the three men in turn, at least for an hour or two, until he recovered more fully. \n \n In this manner, therefore, they started at once to retrace their steps, Mr. Bradford taking the first turn at drawing his disabled son. The snowflakes were whirling and driving now before the rising gusts, and the air felt colder. David was accordingly wrapped in the heavy coats of the others, he being the only one who could not keep warm by exercise. \n \n The rest and the ride refreshed him greatly, so that at the open brook where they had lunched, he declared, after a drink of cold water, that he would not be drawn any farther. He threw off the coats impatiently, not forgetting, however, to thank his faithful friends, and standing up, found himself strong enough to walk. Uncle Will now insisted that Roly should ride for a while, though that youth, tired as he was, did not think it necessary, and only yielded with reluctance. So[110] wearied was he, however, that no sooner had he stretched himself on the sled than he fell fast asleep, and rode in that manner much farther than he had intended, the others having no heart to wake him. \n \n The valleys and slopes were comparatively easy to identify and follow with the aid of Uncle Will\u0027s compass, until Mount Stay-there was reached, but by that time it was between six and seven o\u0027clock, and darkness was settling down. Meanwhile, the wind had increased, and the snow was drifting. It was very evident now why the Indians dreaded a storm on the summit. Terrible indeed would it be, to become confused in such a place! Here was no hospice of St. Bernard, sending out its men and dogs to the rescue, but only a howling, uninhabited, frozen waste for miles. \n \n For a little while yet, the Bradfords were in no danger of losing their way. It was not difficult to find the head of the ravine which they had ascended that morning, and it led them straight to the Devil\u0027s Slide. But the last mile from there to camp lay across the bleak, wind-swept upland. They were never in more need of the compass than now, but, alas! they could no longer see it. \n \n With great difficulty matches were lighted at intervals, and though these were invariably blown out directly, they enabled the party to determine their course. Side by side and close together they walked, in order that no one might lag behind or be lost in the blinding storm.[111] It was a wild experience, and one which the boys will never forget, nor their elders either, for that matter. \n \n Suddenly they heard the Indian exclaim, \"Trees!\" \n \n They had struck the timber line at last, some distance from their camp, but presently, having ascertained their whereabouts, they covered the remaining interval, and with glad hearts flung themselves into the tents. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1642/48532.html","bookId":1228,"book":{"id":1228,"title":"Gold-Seeking on the Dalton Trail","description":"简介： Among my first passions was that for exploration. The Unknownthat region of mysteries lying upon the outskirts of commonplace environmentdrew me with a mighty attraction. My earliest recollections are of wanderings into the domains of the neighbors,...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1642","creation":"Aug 1, 2019 12:24:40 AM","modification":"Aug 1, 2019 12:24:40 AM"}}
