{"id":11867,"no":11,"title":"CHAPTER IX. MIDDLE LIFE.","content":"On his return from his Italian tour my brother at once commenced practice in the Ecclesiastical Courts, and took a small house in Bell Yard, Doctors’ Commons, where he went to reside, and which he describes to his mother as follows:— “April 1851.—I am in excellent health and spirits. I have a funny little house here: there are three floors and two rooms on each: then there is a ground-floor, the front room of which I use as an office, and the back room as a bath room, for I stick diligently to the cold-water system. A kitchen below completes my establishment. I have a housekeeper, who sits downstairs in the kitchen and sleeps in the top story; she is miraculously clean and tidy, and cooks very well, although I never dine at home. She is also a wonderful gossip.” Here he practised for a few years regularly, and with very fair success, but his professional career was destined to be short and broken, and need not detain us. It is his home life with which we are concerned, and it was the[131] pressure of what he looked upon as a higher home duty which decided him, after a struggle, to abandon his profession. He was married in the autumn of 1852, and, in the course of a few years, the health of his wife’s mother by adoption made it desirable that they should be always with her, and that she should spend the winter months abroad. When it became clear that this was necessary, he accepted it, and made the best of it; though I find abundant traces in his correspondence of the effort which it required to do so. Thus he writes from Pau, the place fixed upon for their foreign winter residence, “I always found that changing one’s residence and plans gave one a fit of the blues for a time, sometimes longer, sometimes shorter.” And again; “The business of life is to be bored in all directions. You must not imagine, however, that I am ill, or out of spirits. I have no right to be either, and won’t be, please God.” But the necessary want of regular employment, the sinking into what is called “an idle man,” and abandoning all active part in “the struggle for existence,” was no small trial to one who held that the “full employment of all powers, physical, mental, and spiritual, is the true secret of happiness, so that no time may be left for morbid self-analysis.” You are all perhaps too young to understand this, and probably, when you think about such matters at all, imagine that the happiest life must be one in which you would only have to amuse yourselves. It may, I hope, shake any such belief to find that the[132] period in my brother’s life in which he was thus thrown on his own resources, and had the most complete liberty to follow his own fancies, was just that in which you may find traces of ennui, and a tendency to be dissatisfied with the daily task of getting through time. He took the best course of getting rid of the blues, however, by throwing himself heartily into such occupations as were to be had at Pau. The chief of these was a Pen and Pencil Club, to which most of the English and American residents belonged, and of which he became the secretary. Besides the ordinary meetings, for which he wrote a number of vers de société, on the current topics and doings of the place, the Club indulged in private theatricals. On these occasions he was stage manager, and frequently author; most of the charades and short pieces, which you have seen, and acted in, at Offley, were originally written by him for the Pen and Pencil Club at Pau. “It was a mild literary society,” an old friend writes to me, “which he carried almost entirely on his own shoulders, and made a success.” Then he set to work for the first time to cultivate in earnest his talent for music, and took to playing the violoncello, communicating intelligence of his own progress, and of musical doings at Pau generally, to his sister, whom he looked upon as his guide and instructress. These were not always devoid of incident, as for instance the following:— [133] “Pau, Villa Salusbury. “We have an opera here this season. The prima donna and the tenor are good; the rest so-so. The orchestra and chorus bad; the basso execrable: when he doesn’t bellow like a bull, he neighs like a horse; however, he does his best. I don’t know how you feel, but to me a mediocre opera is an unmitigated bore. I would rather by half hear a good French play. There was a scene at the opera the other night. The conductor of the orchestra is the amant of the contralto. Just before the opera began, the conductor in a jealous fit tried to strangle the contralto: whereupon the basso profundo knocked the conductor down: whereupon the conductor ran off towards the river to drown himself: whereupon he was knocked down again to save his life: whereupon he threatened to cut everybody’s throat: whereupon he was locked up in prison, and there remains. So there is no conductor, and the contralto can’t sing from the throttling.” The violoncello soon grew to be a resource, and I believe he played really well, though he used to groan to me as to the impossibility of adapting adult fingers to the work, and to mourn over the barbarism of our school days, when no one ever thought of music as a possible study for boys. Soon, however, other objects of deeper interest began to gather round him. His eldest boy was born in 1853, his second in 1855, during their summer in England. “The young one,” he writes to his sister, “is like his mamma, they say, and is going to be dark, which will be a good contrast to Herbert, who is a regular Saxon. I want his (Herbert’s) yellow hair to grow long that it may be[134] done into a pigtail; I think it would look quaint and create a sensation among the Cockneys, but I’m afraid I shan’t get my own way. To return to the new arrival, you will be happy to hear that he inherits your talent for music; he is always meandering with his hands as if he was playing the violoncello; it is a positive fact, I assure you, and makes me laugh to bursting point. A—— must have been more struck with my performances than I had credited. I feel quite flattered to possess an infant phenomenon who played (or would have played) the violoncello, if we had let him, from his birth. In the meantime that instrument has been somewhat neglected by me. A——, the baby, and the partridges (what a conjunction), divide my allegiance. However, my music mania is as strong as ever, in spite of the rather excruciating tones which all beginners draw from the instrument: they tell me that the sounds resemble the bellowings of a bereaved cow; luckily the house is a large one.” He took to farming also, as another outlet for superfluous energy, but without much greater success than generally falls to the lot of amateurs. Indeed, his long winter absences from England kept him from gaining anything more than a superficial knowledge of agriculture, such as is disclosed in the following note to his mother, in answer to inquiries as to crops and prospects:— “Farming is better certainly this year than the last, but we farmers always grumble, as you know, and I don’t like to say anything until the new wheat is threshed. You ought to sow your tares and rye immediately, and they will do very well after potatoes; they ought to be well manured. If you mean by ‘rye’ Italian rye-grass, I don’t[135] exactly know when it is best to sow it; in the spring I believe, but I have never had any yet, and you must ask about it. One thing I know, that it ought to have liquid manure, to be put on directly after cutting; this will give you a fresh crop in a little more than a month.” When the Volunteer movement began, he threw himself into it at once; for no man was more impatient of, or humiliated by, the periodical panics which used to seize the country. He helped to raise a corps in his own neighbourhood, of which he became captain, and went to one of the first classes for Volunteers at the School of Musketry, to make himself competent to teach his men. As to the result he writes:— “Undercliff, 1860. “Our schooling at Hythe terminated on Friday last, on which day 100 lunatics were let loose upon society. I say lunatics, because all of us just now have but one idea, and talk, think, and dream of nothing but the rifle (call it Miss Enfield) morning, noon, and night. Colonel Welsford, the chief instructor, is a charming man and a delightful lecturer, and withal a greater lunatic than any of us—just the right man in the right place. I shot fairly, but did not distinguish myself as Harry did.” I spoke of his “vers de société” just now, and in this connection will here give you a specimen of them. The expenses of the corps of course considerably exceeded the Government grant, and the deficiency had to be met somehow. My brother started a theatrical performance in the Town Hall, Hitchin, as a method at once of making both[136] ends meet, and of interesting the townspeople in the corps. The last piece of the entertainment was one of his own. The characters were played chiefly by members of his own family. He himself acted the part of a pompous magistrate, and at the close spoke the following EPILOGUE. “Silence in Court! what’s this unseemly rumpus? Attention to the parting words of Bumpus. Tired of disguise, of borrowed rank and station, Thus in a trice I work my transformation. His wig and nose removed, the beak appears A simple officer of Volunteers, Who to himself restored, and sick of mumming, Begs leave to thank you each and all for coming, Spite of cross roads, dark lanes, tenacious clay, And benches not too soft, to hear our play. Next, to those friends my warmest thanks are due Who give their aid to-night, but chief to you Who for my sake, and only for to-day, O’ercome your natural shyness of display. Now comes the hardest portion of my task, A most momentous question ’tis to ask. I pause for your reply with bated breath— I humbly hope you’ve not been bored to death? Thanks for the signal which success assures; Welcome to all, but most to amateurs. Thanks, gentle friends, your welcome cheers proclaim We have not altogether missed our aim. Not ours your hearts to thrill, your tears to move, With Hamlet’s madness, Desdemona’s love. We dare not bid in high heroic strain [137] Wolsey or Richelieu rise and breathe again. We walk in humbler paths, and cannot hope (To quote the spirit-stirring verse of Pope) ‘To wake the soul with tender strokes of Art, To raise the genius and to mend the heart; To make mankind in conscious virtue bold, Live o’er each scene and be what they behold.’ No—with deep reverence for these nobler views, We seek not to instruct you, but amuse; To make you wiser, better, we don’t claim— To make you laugh, our only end and aim. And as the test of everything, men say, Is just this simple question—does it pay? Well, then (I speak for self and comrades present), This acting pays us well; we find it pleasant. If at the same time it amuses you, We reap a double gain vouchsafed to few, To please ourselves and please our neighbours too. Besides, to-night in more material sense, It pays us well in shillings, pounds, and pence. Your dollars flush our regimental till, But in more sterling coin we’re richer still: Yes, doubly, trebly, rich in your goodwill. And so farewell! but stop, before we part, We’ll sing one song and sing it from the heart. Just one song more: you guess the song I mean: Our brave time-honoured hymn, ‘God save the Queen.’” He continued also to act as mentor to his younger brothers, two of whom went in due course to Cambridge, and, to his great delight, pulled in their college racing boat (Trinity Hall), which was then at the head of the river. He often visited them at Cambridge, and, whenever[138] he could manage it, would spend some part of the vacation with them, joining them in all their amusements, and helping them in their studies. You may judge of the sort of terms they were on, by this extract from a letter to his mother in August 1856:— “We shall be very happy to join you in Scotland. I want to know whether good fishing tackle is procurable at Stirling, or in the neighbourhood of Callender. At Edinbro’ and Glasgow I know it can be obtained, and much cheaper than in London. Perhaps Harry can inform me, if he is not too much occupied in discovering the value of χ, which I believe is the great object of mathematics (I speak it not profanely). Tell Harry and Arthur I expect to find them both without breeches. ‘Those swelling calves were never meant To shun the public eye,’ as Dr. Watts remarks, or would have remarked if he had written on the subject.” Such occupations as these, with magistrate’s work, and field sports taken in moderation, served to fill up his time, and would have satisfied most men situated as he was. But he could never in all these years get the notion quite out of his head (though it wore off later) that he was not doing his fair share of work in the world, and was a useless kind of personage, for whom no one was much the better but his wife and children, and whom[139] nobody but they would miss. This feeling showed itself in his immense respect for those who were working in regular professions, and in the most conscientious scrupulousness about taking up their time. Often he has come to my chambers, and, after hurrying through some piece of family business, has insisted on going away directly, though I might not have seen him for a month, and was eager to talk on fifty subjects. The sight of open papers was enough for him; and he had not practised long enough to get the familiarity which breeds contempt, and to know how gladly the busiest lawyer puts aside an Abstract, or Interrogatories in Chancery, for the chance of a pleasant half-hour’s gossip. I think, however, that I can show you clearly enough, in a very few words, what his real work in the world was during these years, and how perfectly unconscious he was that he was doing it faithfully. In 1857, your grandfather had a dangerous attack of illness, from which he never recovered. George was with him and nursed him during the crisis. As soon as he was well enough to use a pen, he wrote as follows to Lady Salusbury:— “Amongst other things it occurs to me how much I have had to thank God for through life, and how my family have always drawn together in the way I wished them. And here I should be doing injustice to George, if I did not in my own mind trace much of this happy result to his quiet and imperceptible influence as an elder brother, in many ways of which my wife and I were not exactly[140] cognizant at the time. Perhaps I am thinking more about him just now as he was in his natural place as my right-hand man when I was taken unwell; and when I say truly, that neither his mother or I ever had even an unkind word or disrespectful look from him since he was born, and that his constant study through life, as far as we are concerned, has been to spare us rather than give us trouble, and throw his own personal interests over much more than we chose to allow him, it is especially for the purpose of giving dear A—— (her adopted daughter) a precedent to quote with her own lips in the training of her own boys which I know will be particularly acceptable to herself. It is the last theme on which he would like to expatiate, but that such was my deliberate and true opinion, will be, I doubt not, one of these days, a source of satisfaction to them both, and to the children.” Your grandfather died shortly afterwards, and a year later George wrote to his mother:— “I feel that we have great cause for gratitude and rejoicing as a family; I mean for the way in which we hang together, and the utter absence of any subject of discord or disagreement between any of our members. I think we may well be happy, even while thinking of what happened this time last year, as I have done very frequently of late.” He would have been impatient, almost angry, if anyone had told him that the “hanging together,” at which he rejoiced, was mainly his own doing. In the village, too, he was beginning to find occupation of the most useful kind. Thus he opened a village reading-room[141] for the labourers, which was furnished with books and papers, and lighted and warmed, every evening from seven to nine. “Hitherto it is a great success,” he writes in 1868: “we have fifty members who subscribe 2d. a week, and we give them a cup of coffee and a biscuit for 1d. Some of them drink five or six cups a night. Whether coffee will continue to beat beer I don’t know, but at present it keeps them from the public-house, and saves their wages for their wives. Some of them are very fond of reading, and the rest play draughts and dominoes.” Then there were frequent “laundry entertainments,”—penny readings, or theatrical performances in the big laundry,—of which his sister writes: “The boys and Mr. Phillips and I used to make the music, but the great hits of the evening were always George’s. He used to recite ‘The One-horse Chay,’ or some Ingoldsby Legend, or ‘The Old Woman of Berkeley,’ or sing a comic song, and the people liked his performances better than anything. Like all very reserved people, he acted wonderfully well, and always knew how every part should be done, so he used to coach us all when a play was being got up. But he would never criticise unless asked: he always thought that people knew as well as he did how to do their parts, but they did not. He was always so droll on these occasions. When a performance was proposed by the boys, he used to say it was too much trouble, and that he wanted to be left quiet. But they always got their way, and when it[142] was inevitable he would learn his entire part while we others were mastering a page. I was always whip, because I could not stand doing anything by halves, and used to drive everyone mercilessly till the scenes began to go smoothly. He would sometimes rehearse his part almost under his breath, gabbling it off with the book in his hand, and then I would remonstrate, and he would go through it splendidly, as well as on the day of performance.” But the reform which he had most at heart he never lived to carry out. The industry of straw-plaiting, which prevails in the neighbourhood, while it enables the women and girls to earn high wages, makes them bad housewives, all their cooking and cleaning being neglected, while they run in and out of neighbours’ houses, gossiping and plaiting. In the hope of curing this evil he looked forward to fitting up a large barn in the village as a sort of general meeting-place. Here, when he had made the roof air-tight, and laid down a good floor, there was to be a stove for cooking and baking, and appliances for instruction in other household work. Under his wife and sister there were to be “cooking classes, sewing classes, and singing classes; and, in the evenings, entertainments for the poor people, a piano and night classes, sometimes theatricals, and often concerts, and when the boys wanted to dance they were to have their dances there. He used to think that constant meetings in the barn would[143] humanize us all, and be a very pleasant thing for making rich and poor meet on equal terms.” It is perhaps vain to dwell upon such things, but I cannot help hoping that some day those of you who have the opportunity of realizing such plans may remember to what purposes the big barn was once destined. Of one other part of his village work, his Sunday evening classes for the big boys, I shall have to speak presently. But you must not suppose from anything in this chapter that he ever lost his interest in politics, or public affairs. He was always a keen politician, retaining, however, all his early beliefs. “You have all got far beyond me,” he writes to his sister; “and my dear mother turning Radical in her old age is delightful.” Perhaps the most ardent politician amongst us all is the best witness to call on this subject. “I don’t think anything was more remarkable about George than his politics. He, who was so good an old Tory in many ways, showed that he believed in a universal principle and duty underlying all the political opinions about the best means of carrying out reforms. I think it is very rare, when people are discussing politics, to find this constant recognition of something beyond party nostrums. But (as in his father) I have always detected it in George; and, when I have got very hot whilst propounding Radicalism against all the rest here, have always found sympathy from him at the bottom; and I have always felt at last how much more truly liberal[144] he was at heart than we Radicals, because we are always wanting to force on our opinions our own way, whilst in him I always recognized a divine sort of justice and patience, which used to make me feel very conceited, and wanting in faith. He was born with aristocratic instincts, being by nature intensely sensitive and refined, with a loathing of anything blatant and in bad taste, and with an intense love of justice; and the unwise, violent, foolish way in which many men like —— expound their doctrines disgusted him beyond measure, though he would always recognize the real truth that lay at the bottom of Radicalism.” But he shall speak for himself on one great event, which you are all old enough to remember, the late war between France and Germany. Almost the first incident of the war—the despatch of the then Emperor, speaking of the Prince Imperial’s “baptism of fire”—roused his indignation so strongly that it found vent in the following lines:— By! baby Bunting, Daddy’s gone a hunting, Bath of human blood to win, To float his baby Bunting in. By, baby Bunting. What means this hunting? Listen! baby Bunting— Wounds—that you may sleep at ease, Death—that you may reign in peace. Sweet baby Bunting. [145] Yes, baby Bunting! Jolly fun is hunting! Jacques in front shall bleed and toil, You in safety gorge the spoil. Sweet baby Bunting. Mount! baby Bunting, Ride to Daddy’s hunting! On its quiet cocky-horse, Two miles in the rear, of course. Precious baby Bunting. Ah, baby Bunting! Oftentimes a hunting, Eager riders get a spill— Let us hope your Daddy will. Poor little Bunting. Perpend, my small friend, After all this hunting, When the train at last moves on Daddy’s gingerbread “salon” May get a shunting. Poor baby Bunting! Curse on such a hunting! Woe to him who bloods a child For ambitious visions wild, Poor baby Bunting! “October 6th, 1870.—I am, I think, rapidly changing sides about this horrid war. You know I was a tremendous Prussian at the outset, but (although the French deserve all they get) I really can’t stand the bombardment of Paris; besides, Bismarck is repulsive.” [146] “Offley, 1871. “I think that the high and mighty tone assumed by Herr Gustave Solling (German superhuman excellence, Handel, Beethoven, Minnesingers, \u0026c.) the worst possible vehicle for the defence of the German terms of peace. When a man talks ‘buncombe,’ it shows that he has an uneasy feeling that his case is a weak one. The cynical line is the right one for the Germans; why not say, in the words of Wordsworth,— ‘And why? Because the good old rule Sufficeth them; the simple plan, That they should take who have the power, And they should keep who can.’ But pray don’t say this to our cousin, and thank her for her translation. You know what I think about the matter; I would have gone to war with the French to stop the war; and I would have gone to war with the Germans to stop the peace. There’s an Irish view of it, from a sincere war-hater.” The person who knew him best once wrote of your grandfather’s politics: “Men of all parties speak of him as belonging to their clique. This proves to me, if I had required the proof to strengthen the conviction, that there is a point on the plain of politics at which the moderate Tory, the sensible Whig, and the right-minded Radical, in other words all true patriots, meet; like the vanishing point in a picture to which all true and correct lines tend. And thus it is with him: he has reached that point, and there he foregathers with all of all parties, who, throwing aside[147] party prejudice, act and think for the good of their fellow-creatures.” The description, I cannot but think, applied equally well to my brother, though he continued nominally a Tory to the end, and, as you will all recollect, lived as quiet, methodical a country life as if he had no interests in the world beyond crops, field sports, and petty sessions. But that it must have required a considerable effort on his part to do this comes out in much of his most intimate correspondence. For instance, only a month or two before his death he writes to his sister:—“Thanks, many, for your letter, and Mrs. S——’s. Hers is delightful, and I so fully understand her feeling. I always feel uncomfortable in point-device places, where the footman is always brushing your hat, and will insist upon putting out your clothes, and turning your socks ready to put on, and, if you say half a word, will even put them on for you. How I hate being ‘valeted!’ I should like to black my own boots, like Mr. ——, but then he is (or was) a master of foxhounds, and, being of course on that account a king of men, can do as he pleases, in spite of Mrs. Grundy. I am also a gypsey (is that rightly spelt? That word, and some others, are stumbling-blocks to me; I am afraid all my spelling is an affair of memory), a Bohemian at heart. I sometimes feel an almost irresistible desire to doff my breeches and paint myself blue. I should also like (I would limit myself to one month per annum) to go with a[148] carpet-bag to the nearest station, and to rough it in all sorts of outlandish places—but then A—— can’t rough it, and there are the brats, and lots of other impediments. The very act of wandering anywhere delights me. I think we spoil half the enjoyment of life by being too particular; how terrible dinner-parties are becoming! But enough of my sermon. In spite of my secret longings I shall continue to do as my neighbours, and it would be wicked in my case to be discontented. They threatened to nominate me Chairman of the Board of Guardians here, but finding that the Vice-chairman was standing (and thinking him better qualified), I declined any contest, and was not put up. I am sorry for it, for the office, although troublesome, is capable of being made useful, and I think I should have liked it in time;” and then comes a sentence which may serve to explain to some of you your feelings towards him—“I cannot forgive —— for putting ——” (one of his nephews) “on a bolting horse. If you do mount a boy, you ought to give him the cleverest and quietest horse in your stable, and no sportsman would do otherwise.” There is one more trait in his character which I must not omit here, as I wish to give you as perfect a knowledge of him as I have myself. I have already told you how very scrupulous he was with regard to money matters. He had, indeed, a horror of debt which made him morbidly sensitive on the subject; and he recognized the fact, and[149] treated himself for it as he would have done for a fit of bile, or any other physical disorder. On more than one occasion, when some unlooked for expenditure seemed likely to bring on a more than usually severe attack, he cured himself by some piece of unwonted extravagance, such as buying a diamond ornament for his wife, or making a handsome present to some poor relation. The remedy answered perfectly in his case; but I am bound to add that it is one which I cannot recommend as a specific without the warning, that, before using it, you-must satisfy yourselves, as he always did, that there were no reasonable grounds for uneasiness. But if he sometimes worried himself about money, he kept his anxiety to himself, and was constantly doing the most liberal acts in the most thoughtful manner. Of the many instances I could give of this, I select one, which an old friend has communicated to me with permission to mention it. I give it in his own words:—“There is one little incident connected with his personal relations to me which I shall always remember with feelings of gratitude and pleasure. When the Suez Canal was opened I had an offer of a free passage out and home in a P. and O. steamer, and I was rather exercised in my mind by not feeling it prudent to accept, as I knew that living in Egypt for a fortnight at that time would be very expensive, and I knew that I could not afford it. I happened to be writing to him about that[150] time, and mentioned this in my letter. By return of post he sent me a cheque for ￡50, begging me to accept it as a loan, to be paid when I had as much to spare, or never if I preferred it. I did not take advantage of his generous kindness, and I declare I almost regret now that I did not, as I believe I should have given him sincere pleasure in so doing.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2859/79030.html","bookId":1208,"book":{"id":1208,"title":"Memoir of a Brother","description":"简介： This Memoir was written for, and at the request of, the near relatives, and intimate friends, of the home-loving country gentleman, whose unlooked-for death had made them all mourners indeed. Had it been meant originally for publication, it would hav...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2859","creation":"Aug 1, 2019 12:24:36 AM","modification":"Aug 1, 2019 12:24:36 AM"}}
