{"id":11864,"no":8,"title":"CHAPTER VI. START IN LIFE.","content":"My brother, after taking his degree, remained up at Oxford in lodgings, attending lectures; and, when I went out of College in the term before my own examination, I joined him, and once again we found ourselves living in a common sitting room. I think it was a very great pleasure to both of us; and as soon as my troubles in the Schools were over, and the short leisure time which generally follows that event had set in, we began to talk over subjects which had hitherto been scarcely mentioned between us, but which, on the threshold of active life, were becoming of absorbing interest. In the previous autumn I had made a tour with a pupil in the North of England and Scotland. I had gone, by choice, to commercial hotels in several of the large northern towns, as I had discovered that commercial rooms were the most likely places for political discussion, and was anxious to talk over the great question of that day with the very vigorous and able gentlemen who frequented them. The Anti-Corn-Law agitation was then at its height,[89] and, to cut a long story short, I had come back from the North an ardent Freetrader. In other directions also I was rapidly falling away from the political faith in which we had been brought up. I am not conscious, indeed I do not believe, that Arnold’s influence was ever brought to bear directly on English politics, in the case even of those boys who (like my brother and myself) came specially under it, in his own house, and in the sixth form. What he did for us was, to make us think on the politics of Israel, and Rome, and Greece, leaving us free to apply the lessons he taught us in these, as best we could, to our own country. But now his life had been published, and had come like a revelation to many of us; explaining so much that had appeared inexplicable, and throwing a white light upon great sections, both of the world which we had realized more or less through the classics, and the world which was lying under our eyes, and all around us, and which we now began, for the first time, to recognize as one and the same. The noble side of democracy was carrying me away. I was haunted by Arnold’s famous sentence, “If there is one truth short of the highest for which I would gladly die, it is democracy without Jacobinism;” and “the People’s Charter” was beginning to have strange attractions for me. It was just one of those crises in one’s life in which nothing is so useful, or healthy, for one, as coming into direct and constant contact with an intellect stronger than[90] one’s own, which looks at the same subjects from a widely different standpoint. Now, in the Anti-Corn-Law agitation the leaders of the League were in the habit of using very violent language. Their speeches were full of vehement attacks on the landlords and farmers of England, and of pictures of country life as an inert mass of selfishness, tyranny, and stupidity. My brother’s hatred of exaggeration and unfairness revolted against all this wild talk; and his steady appeal to facts known to us both often staggered my new convictions. On the general economical question, imperfectly as I understood it, I think I often staggered him. But, on the other hand, when he appealed to the example of a dozen landlords whom I knew (including your grandfather), and made me look at the actual relations between them and their tenants and their labourers, and ask myself whether these statements were not utterly untrue in their case and in the county we knew; whether they were not probably just as untrue of other counties; and, if that were so, whether a cause which needed such libels to support it could be a just one, I was often in my turn sadly troubled for a reply. Again, though Arnold’s life influenced him quite as powerfully as it did me, it was in quite a different direction, strengthening specially in him the reverence for national life, and for the laws, traditions, and customs with which it is interwoven, and of which it is the expression. Somehow, his natural dislike to change, and preference[91] for the old ways, seemed to gain as much strength and nourishment from the teaching and example of our old master, as the desire and hope for radical reforms did in me. As for democracy, not even Arnold’s dictum could move him. “The Demos” was for him always, the fatuous old man, with two oboli in his cheek, and a wide ear for the grossest flatteries which Cleon or the Sausage-seller could pour into it. Those of you who have begun Aristophanes will know to what I allude. Now, if he had been a man who had any great reverence for rank or privilege, or who had no sympathies with or care for the poor, or who was not roused to indignation by any act of oppression or tyranny, in the frame of mind I was in I should have cared very little for anything he might have urged. But, knowing as I did that the fact was precisely the reverse—that no man I had ever met was more indifferent to rank and title, more full of sympathy and kindliness to all below him, or more indignant at anything which savoured of injustice—I was obliged to admit that the truth could not be all on my side, and to question my own new faith far more carefully than I should have done otherwise. And so this was the last good deed which he did for me when our ways in life parted for the first time, and I went up to London to read for the Bar, while he remained at Oxford. His plans were not fixed beyond the summer. He had promised to take two or three Oriel men to Scotland[92] on a reading party, and accordingly went with them to Oban in July; and, while there, accepted an offer, which came to him I scarcely know how, to take charge of the sons of the late Mr. Beaumont at Harrow, as their private tutor. I must own I was much annoyed at the time when I heard of this resolution. I could see no reason for it, and many against it. Here was he, probably the most popular man of his day at Oxford, almost sure of a fellowship if he chose to stay up and read for it, one of the best oars and cricketers in England, a fine sportsman, and enjoying all these things thoroughly, and with the command of as much as he chose to take of them, deliberately shelving himself as the tutor of three young boys. I am afraid there was also a grain of snobbishness at the bottom of my dislike to the arrangement. Private tutors were looked upon then by young men—I hope it is so no longer—as a sort of upper servants; and I was weak enough, notwithstanding my newly acquired liberalism, to regard this move of George’s as a sort of loss of caste. He was my eldest brother, and I was very fond and proud of him. I was sure he would distinguish himself in any profession he chose to follow, while there was no absolute need of his following any; and it provoked me to think of his making what I thought a false move, and throwing away some of the best years of his life. However, I knew it was useless to remonstrate, as he had[93] made up his mind, and so held my tongue, and came to see that he was quite right. It was not till nearly three years later, when his engagement was over and he had entered at Doctors’ Commons, that I came to understand and appreciate his motives. The first of these you may gather from the following extract from a letter of your grandfather’s, dated February 23rd, 1849:—“George, it seems, is unusually lively at the idea of going tooth and nail to work with men instead of boys; and, now that he has for three years gratified his whim of keeping himself wholly off my hands, consents to be assisted like his brothers.” This “whim” of proving to his own satisfaction that he was worth his keep, and could make his own living, is not a very usual one nowadays, when most young Englishmen seem to assume that they have a natural right to maintenance at the expense of some one. He had then six other brothers, on whom the example was not altogether thrown away, though none of us were ever able quite to come up to it. It had the effect, however, of making us thoughtful in the matter of expenditure; and, consequently, of the four who went to the universities, and two who entered the army, not one got into any money difficulties. But George had other motives for this step besides the “whim” of independence. He wished for leisure to make up his mind whether he should take holy orders, as he had at one time intended to do. And, since leaving Rugby, he had had no time either for the study of modern languages[94] or for general reading, and he was anxious to make up his arrears in both of these directions. This engagement would give him the leisure he wanted, while keeping him at regular routine work. His resolve, though taken at the risk of throwing himself back some years in his future profession, whatever that might be, was thoroughly characteristic of him, and owing, I think, in great measure to your grandfather’s own precepts. He was fond of telling us family stories, and there was none of these of which he was more proud than that of his maternal great-grandmother. This good lady was the widow of George Watts, Vicar of Uffington, a younger son himself, who died at the age of forty-two, leaving her in very poor circumstances. She sold off everything, and invested the proceeds in stocking a large dairy farm in the village where she had lived as the great lady, there being no resident squire in the parish. If any of you ever care to make a pilgrimage to the place, you will find the farmhouse, which she occupied nearly 200 years ago, close to the fish-pond in Uffington. She was well connected, and her friends tried to persuade her not to give up her old habits; but she steadily refused all visiting, though she was glad to give them a cup of chocolate, or the like, when they chose to call on her. By attending to her business, rising early and working late, she managed to portion her daughter, and give her son a Cambridge education, by which he profited, and died Master of the Temple, where[95] you may see his monument. He was true to his mother’s training, and sacrificed good chances of further preferment, by preaching a sermon at Whitehall before George II. and his mistress, on Court vices, on the text, “And Nathan said unto David, Thou art the man.” Such stories, drunk in by a boy of a quiet, self-contained, thorough nature, were sure to have their effect; and this “whim” of George’s was one of their first-fruits in his case. I must add, that there is no family tradition which I would sooner see grow into an article of faith with all of you than this of thriftiness, and independence, as points of honour. So long as you are in statu pupillari, of course you must live at the expense of your friends; but you may do so either honestly, or dishonestly. A boy, or young man, born and bred a gentleman, ought to feel that there is an honourable contract between him and his friends; their part being to pay his bills, and make him such an allowance as they can afford, and think right, and sufficient; his, to work steadily, and not to get in debt, or cultivate habits and indulge tastes which he cannot afford. You will see through life all sorts of contemptible ostentation and shiftlessness on every side of you. Nurses, if they are allowed, begin with fiddle-faddling about children, till they make them utterly helpless, unable to do anything for themselves, and thinking such helplessness a fine thing. Ladies’ maids, grooms, valets, flunkeys, keepers, carry on the training as they get older. Even at public schools I can see this extravagance[96] and shiftlessness growing in every direction. There are all sorts of ridiculous expenses, in the shape of costumes and upholstery of one kind or another, which are always increasing. The machinery of games gets every year more elaborate. When I was in the eleven at Rugby, we “kept big-side” ourselves; that is to say, we did all the rolling, watering, and attending to the ground. We chose and prepared our own wickets, and marked out our own creases, for every match. We had no “professional” and no “pavilion,” but taught ourselves to play; and when a strange eleven was coming to play in the school close, asked the Doctor for one of the schools, in which we sat them down to a plain cold dinner. I don’t say that you have not better grounds, and are not more regularly trained cricketers now; but it has cost a great deal in many ways, and the game has been turned into a profession. Now, one set of boys plays just like another; then, each, of the great schools had its own peculiar style, by which you could distinguish it from the rest. And, after you leave school, you will find the same thing in more contemptible forms, at the Universities and in the world. You can’t alter society, or hinder people in general from being helpless, and vulgar—from letting themselves fall into slavery to the things about them if they are rich, or from aping the habits and vices of the rich if they are poor. But you may live simple manly lives yourselves, speaking your own thought, paying your own way, and doing your own[97] work, whatever that may be. You will remain gentlemen so long as you follow these rules, if you have to sweep a crossing for your livelihood. You will not remain gentlemen in anything but the name, if you depart from them, though you may be set to govern a kingdom. And whenever the temptation comes to you to swerve from them, think of the subject of this memoir, of the old lady in the farmhouse by Uffington fish-pond, and the tablet in the Temple Church. Such a resolution as that which, as I have just shown you, was taken by my brother at the end of his residence at Oxford, is always a turning-point in character. If faithfully and thoroughly carried out, it will strengthen the whole man; lifting him on to a new plane, as it were, and enabling him, without abruptly breaking away from his old life, to look at its surroundings from a higher standpoint, and so to get a new and a truer perspective. If repented of, or acted out half-heartedly, it is apt to impair a man’s usefulness sadly, to confuse his judgment, and soften the fibre of his will. He gets to look back upon his former pursuits with an exaggerated fondness, and to let them gradually creep back, till they get a stronger hold on him than ever, so that he never learns to put them in their right place at all. The moral of which to you boys is—think well over your important steps in life, and, having made up your minds, never[98] look behind. George never did. From Oban he writes home: “My forthcoming engagement occupies all my thoughts, and indeed a good deal of my time; for if I intend to succeed, I must be well up in everything. I shall not, therefore, be able to make many excursions from Oban.” Your grandfather had been a friend of Sir Walter Scott, and had brought us up on his works; and had suggested to George that this would be a good opportunity for visiting a number of the spots immortalized by the Wizard of the North. This was his answer. In the same spirit I find him writing about the same time as to a new cricket club, which was starting under very favourable auspices in Berkshire, and in which he had been asked to take a leading part: “I shall certainly not join the A. C. Club; and as for Tom, I should think his joining more improbable still. Cricket is over for both of us, except accidentally.” In this spirit he took to his new work; and, going into it heartily and thoroughly, found it very pleasant. He occupied Byron House at Harrow, with his pupils, in which his old friend Mr. M. Arnold afterwards lived. There were several of his old schoolfellows, and college friends, among the Masters; and I, and others of his old friends, used to run down occasionally, on half-holidays, from London, and play football or cricket with the boys, amongst whom the prestige of his athletic career of course made him a great favourite and hero.[99] Thus he got as much society as he cared for, and found time, in the intervals of his regular work, for a good deal of general reading. In fact, I never knew him more cheerful than during these years of what most of us regarded as lost time, and in which we certainly expected he would have been bored, and disappointed. This would not have been so perhaps had he proved unsuccessful; but his pupils got on well in the school and their father soon found him out, and appreciated him. At the beginning of the first long vacation he writes home:— “Mr. Beaumont, finding I am fond of a gun, has most kindly offered me a week’s shooting on his moors. I could easily manage it, and meet you in London in time to visit Lady Salusbury. You will not think, I know well, that I like shooting better than home; and if you would like to see me before you go to London, pray say so, and the moors will not occupy another thought in my head. It is not everyone who would have taken the trouble to find out that I liked shooting and I feel Mr. Beaumont’s kindness; in fact, he seems as generous as a prince to everyone with whom he has anything to do.” But it was in his own family, where he would have wished for it most, that the reward came most amply. He became in these years the trusted adviser of your grandfather on all family matters, and especially with respect to his three youngest brothers. The direction of their education was indeed almost handed over to[100] him, and nothing could exceed the admiration and devotion with which they soon learnt to regard him. The eldest of them was sent to Harrow in 1848 to be under his eye, and you may judge of the sort of supervision he exercised by this specimen of his reports:— “I think he has been suffering the usual reaction which takes place when a boy goes to a new school. He worked hard at first, and then, finding he had a good deal of liberty and opportunity of amusement, grew slack. He is too fond of exercise to be naturally fond of work, as some boys are who are blessed with small animal spirits; and he is not yet old enough to see clearly the object of education, and the obligation of work. I have no doubt he will very soon find this out; but, if not, it will very soon be forced on his notice by the unpleasantness of being beaten by his contemporaries.” Speaking of his letters of advice to the boys, your grandfather writes:— “They have given me at least as much pleasure as them. You are doing a very kind thing in the most judicious way, and have assisted the stimulus which they required. Good leaders make a steady-going team, and allow the coachman to turn round on his box. Arthur [the youngest] will in his turn benefit by these fellows, I doubt not. You would, I think, be pleased to see how naturally he takes to cricket. In fact, take him altogether, he is a very good specimen of a six-year-old.” But perhaps nothing will show you in a short space what he was to his younger brothers so well as one of[101] their own letters to him, and one of his to your grandmother. The first is from your uncle Harry, written almost at the end of his first half at Rugby:— “My dear George, “I am very much obliged to you for writing such a capital letter to me the other day, and for all your kind advice, which you may be sure is not entirely thrown away. I remember all the kind advice you gave me last winter, as we were coming from skating at Benham. You warned me from getting into ‘tick,’ and you said you were sure I should be able to act upon your good advice, and from that moment I determined not to go on tick, without I could possibly help. I haven’t owed a penny to anyone this half-year, and I don’t mean to owe anybody anything in the money way; and I have not spent all my money yet, and if I have not got enough to last me till the end of the half-year, I am determined not to tick; and I heartily thank God that I have elder brothers to guide me and advise me; I am afraid I should have done badly without them. You advised me also in your kind letter to work steadily. I fancy I am placed pretty decently; the form I am in is the upper remove. I keep low down in my form, principally from not knowing my Kennedy’s grammar. I find it very hard to say by heart. I should have been placed higher, I think, if I had known it; and I should advise Arthur to begin it now, if he is coming to Rugby, which I hope he is. He will find it disagreeable now, but he would find it worse if he did not know it when he came here. I think if you would be kind enough to write to him, and show him how necessary it is for him to learn it, he would be only too glad to do it. I think the great fault in me is, not so much forgetfulness, but a not having a determination to do a thing at the moment. I put it off. But I[102] have, I am sorry to say, innumerable other faults. Mamma sent me a book of prayers, which I read whenever I have got time, and I say my prayers every night and morning, and I pray for all of you. I have now mentioned, I think, everything that you seemed anxious about in your letter.” The next letter is dated two years later, when the question what profession the writer of the last was to follow, had become important:— “Dearest Mother, “I will answer your questions as well as I am able. Harry will not lower himself by farming. It might have been so ten years ago, but the world is getting less absurd, and, besides, I think more gentlemen are now taking it up as a profession (Mr. Huxtable, for instance, and many others), and are most highly respected. But to succeed in farming in England now, one must be a remarkable man; one must thoroughly understand all practical details, and be able to work oneself better than a labourer; besides this, the farmer must be a tolerable chemist and geologist, must understand bookkeeping and accounts, and must be enterprising and yet cautious; as patient as Job, and as active minded (and bodied) as anyone you can think of. Now Harry, although amiable, is rather indolent, and unless he can entirely get rid of this, he will ruin himself in a year by farming in England. In Ireland or the colonies it might be different. For the same reasons I would not recommend the Bar for Harry. It is very laborious, the confinement great, and it requires a hard head: moreover, the education is quite as expensive as an Oxford one, if that is any consideration. However, if you think that Harry can acquire (not an ordinary, but) an extraordinary[103] amount of diligence, let him come to the Bar or farm. I confess I should discourage both ideas. If you can get a cadetship for him, I would certainly accept it. The two dangers of Indian military life are extravagance and dissipation, and I don’t think Harry inclined to either. He has not been extravagant at Rugby, and the temptations of a public school are as great as they are anywhere; and I think he is well-principled and kind-hearted, which will save him from the other danger. The army is getting much better, and officers begin to find out that they may do immense good in their profession by looking after the condition of their men. If you should obtain a cadetship, it will not be difficult to make Harry understand that he will have other duties besides drill, and I believe he would perform them. I am sure he would be exceedingly popular with officers and men. If he had been bad-tempered, or disobedient, or ill-conditioned, I should have recommended the navy, as by far the best school for such a character; but as he does not want such discipline, as we have no interest, as it is a poor profession in a worldly point of view, and as he is (I fancy) rather too old, I think it is out of the question. I confess I should hesitate much between orders and the army. If I saw any likelihood of Harry’s doing anything at Oxford, I should like to see him a clergyman. I am sure he would be a conscientious one, and therefore happy. But I don’t think he would do anything (though of course he would pass), and there are the same temptations there as in the army. On the whole, I would try immediately to procure a cadetship; if you cannot get one, I would try to induce Harry to take orders. I said something about Ireland and the colonies in connection with farming. On second thoughts, I don’t think Harry would be a suitable person. Amiable tempers always require (at first) some one to look up to and lean upon; they are[104] longer in learning to stand alone. Now, no one is so much isolated as a colonist. He is thrown entirely on his own resources, and has no one to give him advice and sympathy. In the army, and indeed in orders, one is generally trained to bear responsibility. So I am for the cadetship. He will be at once provided for, and will return to England in the prime of life with a competence. This is always supposing that he will escape the dangers of the profession (as I think), and that you and he do not think the advantages counterbalanced by the separation. I have no doubt that when communication with India is easier (and it will soon be incredibly easier), officers will come home at shorter intervals.” Meantime he was studying the same question carefully in his own case, with a view to determining whether he should take orders when his work at Harrow was over. His father and mother, though on the whole wishing that he should do so, were perfectly content to let him think the matter out, and settle it his own way. They seem, however, to have supplied him with specimens of contemporary pulpit literature, upon some of which he comments in his correspondence, not, on the whole, with any enthusiasm. “Surely,” he sums up some criticism on a popular preacher of that day, “there is a pulpit eloquence equally remote from fine writing and familiarity, such as was Dr. Arnold’s. I am doubtful as to reading these books, for I know that I ought not to think of the style, and yet I cannot help it. It takes me down against my will.” Your grandfather replied: “The Church ought certainly[105] to be a labour of love, and followed with zeal. If on a final review of your sentiments, aided perhaps by the advice of some clergyman you look up to (why not Vaughan?) you do not think you could engraft this zeal on sound convictions, and an upright character, you are quite right in deciding for the Bar. In after life you will not be wholly dependent on a profession, and many of our best men have started as late.” In the end he made up his mind against taking orders, but not on any of the grounds which deter so many young men of ability now. “My only objection,” he writes to his mother, “to taking orders is, that it might not suit me. Once ordained, it is impossible to change your profession; and unless a man has his whole soul in this profession, he is useless, or worse.” And so, at the end of his three years at Harrow, he resolved to go to the Bar, and choosing that branch of it for which his previous reading had best qualified him, took his degree of Doctor of Civil Law, and entered at Doctors’ Commons. You will have recognized by this time how carefully your grandfather watched the development of character in his sons, and that he was by no means inclined to overlook their faults, or to over-estimate their good qualities. The longer I live myself, the more highly I am inclined to rate his judgment of men and things, and this is the conclusion he had formed at this time of his eldest son’s[106] character. It occurs in a letter to a relative then living, and dated 25th January, 1849:— “I am glad you have had an opportunity (difficult to get from his reserved character) of seeing what is in George when put to the proof. There are many men of his age with more active benevolence and habits of more general utility, as well as perhaps warmer spiritual feeling, also more useful acquired knowledge. His great forte, rather lies in those qualities which give men the ascendency in more troubled times—perfect consistency of word and purpose, great moral and physical courage, and a scrupulous sense of what is due to oneself and others in the relations of social life, combined with the caution a man should possess, who never intends to retract an opinion or a profession. Much perhaps of the chevalier sans tache who used to be the fashion in the rough times before steam and ’ologies came in. In my time these sort of people were always more popular among Oxford youngsters (who are very acute in reading character) than mere wits, scholars, or dashing men. I suppose it is so still, and thereby account for the estimation which it seems he had in Oriel. And I apprehend this sort of established character must help a man in a profession where he means to work, and I will answer for his doing so.” But there is one feature in George’s character which this estimate of it does not bring out. I mean his great unselfishness. As an illustration of this, I will show you how he treated a proposal made on account of your grandfather while he was at Harrow. We had had the first loss in our circle. Your uncle Walter, whom none of you remember, a young officer in the[107] Artillery, had died of an attack of yellow fever in British Guiana. This had shaken your grandfather a good deal, and his health was no longer strong enough to allow him to follow, and enjoy, his country pursuits. Besides, the house at Donnington was too big for the shrunken family which now gathered there, and those of us who had flitted were settled, or likely to settle, in London. So it was thought that it would be well for your grandfather, and all of us, if he were to follow, and move up to the neighbourhood of town. In any case George’s opinion would have been the first taken on such a step, but in this it was necessary that he should consent, as Donnington was settled on him. He was very much attached to the place in which we had all grown up; and local, and county, and family associations had a peculiarly strong hold on him. But all these were set aside without a second thought. All he was anxious about was, that so serious a change should be well considered. “I think,” he writes to his mother, “you should be cautious about changing. In the first place, it will cause you personally an immense amount of annoyance, which you ought never to incur, especially now. Then you will miss your garden, and your village occupations, and your neighbours. My last letter might have led you to suppose that I myself preferred Hampstead to Donnington, but that is not the case. I should consider it desirable under certain circumstances. If you and my father, and Jeanie and the[108] rest, think these circumstances exist, I sincerely hope you will change, and lose no time about it. But do not do a thing which will cause you a great deal of trouble and annoyance without the clearest grounds. Above all, believe, and this I say with the most perfect truth, that I shall be equally happy whichever you do.” \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2859/79027.html","bookId":1208,"book":{"id":1208,"title":"Memoir of a Brother","description":"简介： This Memoir was written for, and at the request of, the near relatives, and intimate friends, of the home-loving country gentleman, whose unlooked-for death had made them all mourners indeed. Had it been meant originally for publication, it would hav...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2859","creation":"Aug 1, 2019 12:24:36 AM","modification":"Aug 1, 2019 12:24:36 AM"}}
