{"id":90096,"no":33,"title":"Page 33","content":"\"What happened?\" Cassandra asked. \"Are you OK?\"\\n\\n I wasn\u0027t sure. I\u0027d been here, but not here. Myself, yet not myself. The sensation should have been frightening; instead it had been...\\n\\n \"Comforting.\" My voice was my own again. I no longer felt... full.\\n\\n \"What was comforting?\" Cassandra asked.\\n\\n \"Erzulie. She\u0027s like...\" Again I groped for a word to describe her.\\n\\n \"A mother.\"\\n\\n I tilted my head. \"If you say so.\"\\n\\n My mother was nothing like Erzulie.\\n\\n Cassandra frowned, but she refrained from exploring that avenue, thank goodness. Bending, she untwined Lazarus from her ankle, then dumped him into his box.\\n\\n \"Tell me everything,\" she ordered, so I did.\\n\\n When I was finished, Cassandra bit her lip, and her forehead crinkled. I began to get uneasy.\\n\\n \"What?\" I asked.\\n\\n \"You went further than anyone else ever has. Most only hear the voice of the loa, become a little scrambled. You traveled to Ife.\"\\n\\n \"I didn\u0027t go anywhere. Did I?\"\\n\\n \"Not physically.\"\\n\\n \"I just traveled to He in my head.\" I paused. \"What\u0027s He?\"\\n\\n \"There\u0027s a town called Ife in Nigeria, but the one you went to is a legendary place, the mecca of vodoun, where the revelations of the has came to the first faithful.\"\\n\\n \"Terrific,\" I muttered. \"And what about this?\"\\n\\n I showed her the petal of the fire iris that I\u0027d picked in a place I hadn\u0027t actually gone.\\n\\n \"I can\u0027t believe you brought a piece back.\"\\n\\n \"What does it mean that I did?\"\\n\\n \"Not sure.\"\\n\\n \"Wow. You\u0027re as helpful as she was.\"\\n\\n Cassandra ignored me. I wished I could do that whenever someone was annoying. Instead, I always felt compelled to sarcasm them to death - or at least until they went away.\\n\\n \"Keep the petal nearby,\" Cassandra said. \"Any questions you have should soon be answered.\"\\n\\n \"Just like that? Poof. I know the truth?\"\\n\\n \"Got me.\"\\n\\n I narrowed my eyes. \"What happened in the past when you performed this ceremony?\"\\n\\n \"The has came, inhabited someone else, and answered their questions.\"\\n\\n \"Truthfully?\"\\n\\n \"Loas don\u0027t he.\"\\n\\n \"Then why didn\u0027t she answer me?\"\\n\\n \"Maybe you had too many questions. Maybe she didn\u0027t know the answers. Maybe you could only discover the truth by seeing it yourself.\"\\n\\n \"Maybe this is all bullshit.\"\\n\\n Cassandra tilted her head, and I had to admit, if the previous hour had been bullshit, it was extremely convincing bullshit.\\n\\n \"Never mind.\" I tightened my fingers around the petal. \"I\u0027ll just wait for the answers. Should be along anytime now.\"\\n\\n \"You believe?\" she asked.\\n\\n I considered the question, remembered what had happened, where I\u0027d been, how I\u0027d felt\\n\\n \"Yeah.\" How could I not?\\n\\n \"I need to do some research,\" Cassandra said. \"Make some calls. Find out why you traveled to Ife. How you could have brought something out.\"\\n\\n A thought occurred to me. \"Isn\u0027t there bom good and bad voodoo?\"\\n\\n \"They\u0027re mirror images. Can\u0027t have one without the other.\"\\n\\n \"So Erzulie might have been bad.\"\\n\\n \"No. The has are all about truth. It\u0027s the maker of the magic who brings about good or bad. We call the evildoers \u0027ones who serve the has with bom hands.\u0027\"\\n\\n \"You used both hands.\"\\n\\n \"It\u0027s an expression. Don\u0027t you trust me?\"\\n\\n She appeared so crestfallen, I wanted to reassure her, but I didn\u0027t want to lie, either. \"I\u0027ve never dealt with voodoo, Cassandra. For all I know you could have been calling Satan himself. He could be running around New Orleans having a grand old time.\"\\n\\n \"He already is,\" she said dryly.\\n\\n \"Ha-ha.\"\\n\\n \"You spoke to the loa, Diana, which means the good or the evil intent came from you. Are you evil?\"\\n\\n I thought about it. \"Sometimes.\"\\n\\n \"That just makes you human. When you asked for help, direction, truth, did you ask so you could use the result to hurt someone else?\"\\n\\n \"No.\"\\n\\n \"Then go in peace.\"\\n\\n I glanced at my watch and my eyes widened. \"It\u0027s almost morning.\"\\n\\n \"Time flies,\" Cassandra said. \"Let me put that petal into something before you ruin or lose it.\"\\n\\n She rustled through the mess on one of the shelves and came up with an empty gris-gris bag.\\n\\n \"Do you have those lying around all over the place?\" I asked.\\n\\n She didn\u0027t bother to answer, just held open the bag.\\n\\n I hesitated. \"Will it work in there?\"\\n\\n \"Of course.\"\\n\\n I guess I had to take her word for it.\\n\\n I should leave. I wanted to discover if the petal would reveal the truth, but - \"How will I know what\u0027s true?\"\\n\\n \"You just will.\"\\n\\n \"That is so not helpful.\"\\n\\n \"It\u0027s like love - you\u0027ll just know.\"\\n\\n \"I\u0027ll know the love I\u0027m afraid is contrived is real because I\u0027ll just know. That makes no sense.\"\\n\\n \"What does?\" As usual, she ignored my scowl. \"If you find a charm, destroying it should break the spell.\"\\n\\n \"What does a charm look like?\"\\n\\n \"Could be a gris-gris, or maybe a fetish.\"\\n\\n \"Which is?\"\\n\\n \"A small figure - wood, bone, maybe stone, even cloth - fashioned into the shape of a person. Many cultures use totems for luck, for curses or charms - both good and evil.\"\\n\\n \"All right,\" I said. \"Find something weird, destroy it, and the magic is gone.\" Although how I would destroy stone, I had no idea.\\n\\n \"Or you could just leave it be.\"\\n\\n I glanced up. \"What?\"\\n\\n \"Is being in love with him so bad?\"\\n\\n \"I need the truth, Cassandra. That\u0027s just the way I am.\"\\n\\n She nodded as if she\u0027d known I\u0027d say that. Hell, she probably had. \"If Erzulie said the truth would be revealed, it will. I\u0027m not sure how, or why, or when, but have faith.\"\\n\\n \"Faith has never been my strong suit,\" I muttered, and left\\n\\n If I\u0027d had faith in Simon none of this would have been necessary. But if I hadn\u0027t had it then, in him, how could I have it now in someone I barely knew and in something I didn\u0027t trust?\\n\\n Got me.\\n\\n Never one to put off what I could do today, I drove past Adam\u0027s trailer, but his car wasn\u0027t there. I even walked out to the shack, but it was empty.\\n\\n So I spent my time setting up a trap in the clearing where Charlie had died. Scene of the crime and all that. Besides, I didn\u0027t have a better idea.\\n\\n I also had my doubts the snare would work. If a werewolf had human eyes, it might have a human brain, and then the beast would know better than to creep into the cage and let the door close behind it.\\n\\n However, I planned to be sitting in a tree with my loaded tranquilizer gun. If I had to, I\u0027d shoot the thing, men shove it inside myself. There was more than one way to skin a cat. Although I\u0027d never actually figured out a second way.\\n\\n I spent several days tramping through the swamp in the heat, went to town a few times for supplies. Then I endured as many nights with very little sleep, lying alone on the floor, listening to weird noises and faraway howls that should be coyotes but weren\u0027t. I hadn\u0027t seen Adam, and I\u0027d kind of stopped looking for him.\\n\\n I\u0027d been all gung ho for the truth, but the more time passed, the more time I had to think about things, the more afraid I became. What if he\u0027d misled me about something important? Something I wouldn\u0027t be able to forgive.\\n\\n What if Luc had cast a spell over me, and what I felt for both of them was a lie? I didn\u0027t want it to be a lie. Caring for Adam and his son was the first thing that had felt right in a long, long time.\\n\\n I considered Cassandra\u0027s suggestion that I just let everything be. It wasn\u0027t a bad suggestion.\\n\\n However, what if there wasn\u0027t a spell? What if I truly loved Adam and he didn\u0027t love me?\\n\\n I considered all the questions that had no answers as I took a sponge bath in the tributary in front of the mansion. I never had managed to rent another hotel room.\\n\\n I fell asleep eating a sandwich on my sleeping bag. I must have been near meltdown, because I didn\u0027t wake up until sometime after sunset and only then because I sensed I wasn\u0027t alone.\\n\\n My heart kicked up a notch, but before I could fully panic, a silhouette appeared in the window. I\u0027d know that shape anywhere.\\n\\n \"Adam.\"\\n\\n He didn\u0027t answer, just crossed the room and lowered himself onto the sleeping bag.\\n\\n Hell, let\u0027s be honest, he towered himself onto me.\\n\\n The only thing adorning his upper body was his bracelet I liked him best that way. His khakis were soft, his body already hard. Despite the clothes, we fit together just right. Pressure, friction, heat. What more could a girl ask for?\\n\\n Truth.\\n\\n In that moment, I understood that I couldn\u0027t go on without knowing it Where was that petal?\\n\\n I kept one hand on his shoulder while the other crept around like Thing from The Addams Family. I was distracted by Adam\u0027s lips crushing mine, his tongue sweeping into my mouth. I wore loose shorts and his fingers skimmed my thigh, drifted higher, slipped beneath. His thumb stroked in a rhythm to match his tongue, and I forgot about the gris-gris bag.\\n\\n After my makeshift bath, the high temperature had made me opt for a thin light green camisole. I hadn\u0027t even considered a bra. So when his lips closed around my nipple, the moist heat encircled me as if there weren\u0027t anything between us but air. Not long after, there wasn\u0027t.\\n\\n He hadn\u0027t spoken, had barely looked at me, and I needed him to, so I touched his face.\\n\\n His eyes met mine at the very first thrust. My free hand clenched as did my body, and my fingers brushed the gris-gris.\\n\\n I gathered the small bag into my palm, and a breeze swirled through the room. Scented with cinnamon, it whispered indecipherable words but left behind a feeling of certainty.\\n\\n Whatever else might be a lie, this was the truth. \\n\\n","sourceLink":"https://allnovel.net/night-creature-crescent-moon-nightcreature-4/page-33.html","bookId":2091,"book":{"id":2091,"title":"Night Creature: Crescent Moon (Nightcreature #4)","description":"Storyline: Crescent Moon(Night Creature series book 4) \\n New Orleans is known for sinful pleasures and strange magic, but for cryptozoologist Diana Malone it offers one irresistible attraction. For over a hundred years there have been whispers of wolves around the Crescent City, and the recent discovery of bodies in the nearby swamps hints at a creature even more dangerous...one that could make Diana\u0027s career and fortune, if she lives to capture it. Adam Ruelle is a reclusive former Special Forces officer, the last of a mysterious Cajun family rumored to be cursed, and the only person skilled enough to guide Diana in her search. Rugged and captivating, he fills her nights with desire...but by day, Diana is plagued with doubts. Adam clearly knows more than he\u0027s telling, but is his aim to protect her or distract her? Something is stalking its prey in the Louisiana bayous, and every step towards the horrifying truth brings Diana closer to a centuries-old enemy that lives for the smell of fear and the thrill of killing, again and again...\\n","cover":"https://allnovel.net/images/night-creature-crescent-moon-nightcreature-4.jpg","author":"Lori Handeland","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/night-creature-crescent-moon-nightcreature-4.html","creation":"Oct 5, 2019 8:58:20 AM","modification":"Oct 5, 2019 5:39:26 PM"}}
