{"id":79781,"no":13,"title":"Page 13","content":"I cleared the housing estate a few minutes later. In the distance police sirens screamed like banshees in the night. The stadium would be their first priority, but once word reached them of the scuffle on the housing estate, units would be sent to investigate.\n As I stood bent over, panting for breath, I studied the path I\u0027d taken and saw little puddles of blood marking my course - a clear trail for anyone who followed. If I was to progress any further undetected, I\u0027d have to do something about my wound.\n I examined the hole. There was a tiny bit of shaft sticking out of it, attached to the arrow head. I took hold of the light piece of wood, closed my eyes, bit down hard, and pulled. \"Charna\u0027s guts!\"\n I fell back, shivering, fingers twitching, mouth opening and shutting rapidly. For maybe a minute, I knew only pain. The houses around me could have collapsed and I wouldn\u0027t have noticed.\n Gradually the pain abated and I was able to study the wound again. I hadn\u0027t managed to pull the head out, but I\u0027d drawn it closer towards the hole, plugging it up. Blood still oozed out but it wasn\u0027t flowing steadily like it had been. That would have to do. Tearing a long strip off my shirt, I balled it up and pressed it over the wound. After a few deep breaths, I got to my feet. My legs were shaking like a newborn lamb\u0027s, but they held. I made sure I wasn\u0027t dripping blood, then resumed my sluggish flight.\n The next ten or fifteen minutes passed in a slow, agonized blur. I had enough sense left to keep moving, but I wasn\u0027t able to take note of street names or plot a course back to the Cirque Du Freak. All I knew was that I couldn\u0027t stop.\n I kept to the sides of streets and alleys, so I could grab a fence for support or lean against a wall to rest. I didn\u0027t pass many people. Those I did pass ignored me. That surprised me, even in my dazed state, until I realized how I must look. A teenager, reeling along the path, head bowed, body crooked over, moaning softly - they thought I was drunk!\n Eventually I had to stop. I was at the end of my rope. If I didn\u0027t sit down and rest, I\u0027d drop in the middle of the street. Luckily I was close to a dark alley. I fell into it and crawled away from the streetlights, deep into welcome shadows. I stopped beside a large black garbage bin, sat up against the wall by which it was set, and dragged my legs in.\n \"Just? a short? rest,\" I wheezed, laying my head on my knees, wincing at the pain in my shoulder. \"A few? minutes? and then I can?\"\n I got no further. My eyelids fluttered shut and I flaked out, at the mercy of any who happened to chance upon me.\n My eyes opened. It was later, darker, colder. I felt like I was encased in a block of ice. I tried lifting my head, but even that small effort proved too much for me. I blacked out again.\n The next time I awoke, I was choking. Some stinging liquid was being forced down my throat. For a confused moment I thought I was a raw half-vampire again, and that Mr Crepsley was trying to force me to drink human blood. \"No!\" I mumbled, slapping at the hands holding my head. \"Not gonna? be like you!\"\n \"Hold him still!\" someone grunted.\n \"It\u0027s not that easy,\" the person holding me complained. \"He\u0027s stronger than he looks.\" Then I felt a body pressing down on mine and a voice whispered in my ear, \"Steady, kid. We\u0027re only trying to help.\"\n My head cleared slightly and I stopped struggling. Blinking, I tried to focus on the faces of the men around me, but it was either too dark or my sight was clouded with pain. \"What? are you?\" I gasped, meaning were they friends or foes.\n The man holding me must have misheard my question, and thought I\u0027d askedwho were they. \"I\u0027m Declan,\" he said. \"This is Little Kenny.\"\n \"Open wide,\" Little Kenny said, pressing the rim of a bottle to my lips. \"This is cheap and nasty, but it\u0027ll warm you up.\"\n I drank reluctantly, unable to argue. My stomach filled with a sickening fire. When Little Kenny took the bottle away, I leant my head back against the wall and groaned. \"What time? is it?\" I asked.\n \"We don\u0027t bother with watches,\" Declan chuckled. \"But it\u0027s late, maybe one or two in the morning.\" He took hold of my chin, turned my head left and right, then picked at the strip of shirt which was stuck to my shoulder with dried blood.\n \"Ow!\" I yelped.\n Declan released me immediately. \"Sorry,\" he said. \"Does it hurt much?\"\n \"Not? as much? as it did,\" I muttered. Then my head began to swim and I half-blacked out again. When I recovered, the two men were huddled together a metre away, discussing what to do with me.\n \"Leave him,\" I heard Little Kenny hiss. \"He can\u0027t be more than sixteen or seventeen. He\u0027s no good to us.\"\n \"Every person matters,\" Declan disagreed. \"We can\u0027t afford to be picky.\"\n \"But he\u0027s not one ofus ,\" Little Kenny said. \"He probably has a family and home. We can\u0027t start recruiting normal people, not until we\u0027re told.\"\n \"I know,\" Declan said. \"But there\u0027s something different about him. Did you see his scars? And he didn\u0027t get that wound fighting in the playground. We should take him back with us. If the ladies choose not to keep him, we can get rid of him easily enough.\"\n \"But he\u0027ll know where we are!\" Little Kenny objected.\n \"The shape he\u0027s in, I doubt he even knows what town this is!\" Declan snorted. \"He\u0027s got more things to worry about than marking the route we take.\"\n Little Kenny grumbled something I couldn\u0027t hear, then said, \"OK, but don\u0027t forget it was your choice, not mine. I\u0027m not taking the blame for this.\"\n \"Fine,\" Declan said, and returned to my side. He rolled my eyelids all the way up and I got my first clear look at him. He was a large, bearded man, dressed in shabby clothes, covered in grime - a tramp. \"Kid,\" he said, snapping his fingers in front of my eyes. \"You awake? Do you know what\u0027s going on?\"\n \"Yes.\" I glanced over at Little Kenny and saw that he was also a tramp.\n \"We\u0027re taking you back with us,\" Declan said. \"Can you walk?\"\n I assumed that they meant to take me to a mission house or homeless shelter. That wasn\u0027t as preferable as the Cirque Du Freak, but it was better than a police station. I wet my lips and locked gazes with Declan. \"No? police,\" I moaned.\n Declan laughed. \"See?\" he said to Little Kenny. \"I told you he was our kind of people!\" He took hold of my left arm and told Little Kenny to take my right. \"This will hurt,\" he warned me. \"You ready for it?\"\n \"Yes,\" I said.\n They pulled me to my feet. The pain in my shoulder flared back into life, my brain ignited with fireworks, and my stomach lurched. Doubling over, I was sick on the alley floor. Declan and Little Kenny held me while 1 vomited, then hauled me up.\n \"Better?\" Declan asked.\n \"No!\" I gasped.\n He laughed again, then shuffled around, dragging me with him, so we were facing the entrance of the alley. \"We\u0027ll carry you as best we can,\" Declan said. \"But try to use your legs - it\u0027ll make life easier for all of us.\"\n I nodded to show I understood. Declan and Little Kenny linked hands behind my back, put their other hands on my chest to support me, then led me away.\n Declan and Little Kenny were a strange pair of guardian angels. They encouraged me along with a series of curses, pushes and pulls, kicking my feet every so often to goad me into short bursts of self-momentum. We rested every few minutes, leaning against walls or lampposts, Declan and Little Kenny panting almost as hard as I was. They obviously weren\u0027t accustomed to this much exercise.\n Even though it was the middle of the night, the town was abuzz. Word of the stadium slaughter had spread, and people had taken to the streets in outrage. Police cars passed us regularly, sirens blaring, flashlights glaring.\n We marched in plain view of the police and angry citizens, but nobody took any notice of us. With Declan and Little Kenny holding me, I looked like the third of a trio of drunk tramps. One policeman did stop and shout at us to get the hell off the streets - hadn\u0027t we heard what happened?\n \"Yes, sir,\" Declan mumbled, half-saluting the policeman. \"Going home right now. Don\u0027t suppose you could arrange a lift for us?\"\n The policeman snorted and turned away. Declan chuckled, then led us on again. When we were out of earshot, he said to Little Kenny, \"Have you any idea what all the fuss is about?\"\n \"Something to do with football, I think,\" Little Kenny said.\n \"How about you?\" Declan asked me. \"Do you know what people are up in arms about?\"\n I shook my head. Even if I\u0027d wanted to tell them the truth, I couldn\u0027t have. The pain was worse than ever. I had to keep my teeth ground tightly together to stop myself from screaming out loud.\n We carried on walking. I half-hoped I\u0027d black out again, to numb myself to the pain. I didn\u0027t even care that Declan and Little Kenny would probably dump me in a gutter to die, rather than drag my deadweight body along. But I stayed awake, if not entirely alert, and managed to swing my legs into action when prompted.\n I\u0027d no idea where I was being taken, and I wasn\u0027t able to raise my head to mark the way. When we finally came to a halt in front of an old, brown-faced building, Little Kenny darted forward to open a door. I tried looking up to see what the number was. But even that was beyond me, and I could only stare at the ground through half-closed eyes as Declan and Little Kenny dragged me inside and laid me on a hard wooden floor.\n Little Kenny stayed with me, keeping watch, as Declan went upstairs. They\u0027d lain me on my left side, but I rolled over on to my back and stared up at the ceiling. I could feel my last sparks of consciousness flickering out. As I watched, my eyes played tricks and I imagined the ceiling was shimmering, like sea water in a light breeze.\n I heard Declan coming back with somebody. He was talking quickly and quietly. I tried turning my head to see who he was bringing, but the scene on the ceding was too captivating to turn away from. Now I was imagining boats, sails filled with the breeze, circling the sea/ceiling above me.\n Declan stopped by my side and examined me. Then he stepped back and the person with him bent over to look. That\u0027s when I knew I was really losing my grip on reality, because in my delirium I thought the person was Debbie Hemlock, my ex-girlfriend. I smiled weakly at the ludicrous thought of running into Debbie here. Then the woman standing over me exclaimed, \"Darren! Oh my?\"\n And then there was only darkness, silence and dreams. \n","sourceLink":"https://allnovel.net/lord-of-the-shadows-the-saga-of-darren-shan-11/page-13.html","bookId":2447,"book":{"id":2447,"title":"Lord of the Shadows (The Saga of Darren Shan #11)","description":"Storyline: \n The Saga of Darren Shan #11: Lord of the Shadows \n Lord Of The Shadows is the eleventh book in The Saga of Darren Shan series by the author Darren Shan. It is also the second book in the Vampire Destiny trilogy. Along with the Cirque Du Freak, Darren Shan returns to his home town, the place where it all began. While the Cirque Du Freak rests at an old abandoned football stadium, Darren walks through his old home. After spotting his sister, Annie, living a happy life with her son at their old house, Darren decides not to disturb them. One night before the freak show starts a boy shows up hoping to get a ticket to attend the freak show. The boy, Darius, asks many question and acts strangely leaving Harkat and Darren curious. After meeting up with Tommy Jones at that night\u0027s freak show, Darren\u0027s childhood friend, now a world famous soccer star; Darren seems that his experience returning might be a good one...\n \n","cover":"https://allnovel.net/images/lord-of-the-shadows-the-saga-of-darren-shan-11.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/lord-of-the-shadows-the-saga-of-darren-shan-11.html","creation":"Oct 5, 2019 8:58:43 AM","modification":"Oct 5, 2019 4:19:34 PM"}}
