{"id":63006,"no":13,"title":"Page 13","content":"\"Are you sure you don\u0027t want to come tonight?\" Christiana asked, eyeing Lisa with concern.\n \"Positive,\" Lisa assured her, avoiding her eyes.\n Actually, part of her did want to go, the part that wanted to avoid any chance of being forced to speak to Robert. However, another part, the part that also wanted to avoid having to dance with and possibly be proposed to by Lord Findlay, definitely didn\u0027t want to go. She was basically stuck between a rock and a hard place at the moment. Avoiding two men.\n Unfortunately, while Lisa could avoid Findlay by staying home, Robert was going to be a bit trickier. She could stay in her room of course, but there was no guarantee he wouldn\u0027t come harass her here. He had knocked at her door three times already since she\u0027d charged up here after their tumble in the stables. She\u0027d refused to speak to him each time, and there had been little he could do but leave her alone with Richard and Christiana in the house. She suspected, however, that he wouldn\u0027t be quite as accommodating without them here.\n \"Very well,\" Christiana said finally, and turned to walk to the door, but paused there to ask, \"Is there any message for Lord Findlay? He\u0027s sure to ask where you are.\"\n \"No,\" Lisa said on a sigh. \"Just say I was not feeling well. Better yet, say getting caught in the rain has given me a cough or something.\"\n Nodding, Christiana turned away and slid from the room. The moment she was gone, Lisa turned and paced to her window to look out, her mind seeking some way to avoid Robert. He would come, she was sure. Probably the minute Christiana and Richard had left and the last thing she wanted was another argument with him. Her resistance to the man was pretty much completely absent at this point. The idea of marrying and enjoying the pleasure he stirred in her for the rest of her life was tempting. It was the time in between such sessions that worried her. The days of silent suspicion and accusation.\n Lisa knew she couldn\u0027t bear that. Perhaps she should just head home to Madison, she thought suddenly. She could not marry anyone now. Men wanted their wives to be pure on their wedding nights, not slightly used and possibly expecting. The thought made her grimace. There was now twice the chance that she may be carrying Robert\u0027s child. She didn\u0027t want to make it thrice. But if she stayed here, Lisa had absolutely no doubt that it would happen again.\n Good Lord, her body was already hungry again for more. Now that her body had experienced the pleasure to be had, it was insatiable. Turning abruptly, she glanced to Bet.\n \"Unless you want to be trapped up here all night with me, I suggest that you leave now,\" she said and then turned to grab the chair by her window and began to drag it toward the door. Bet\u0027s eyes widened and then she headed for the door. \"I\u0027ll be downstairs if ye need me.\"\n \"I won\u0027t need you until morning,\" Lisa assured her and waited for her to slip out before jamming the chair firmly under the doorknob. Satisfied that she had done what she could, Lisa then turned and paced back to the window. She hadn\u0027t been there more than a moment when a knock sounded at the door.\n \"Go away, Robert,\" she said firmly.\n \"We need to talk, Lisa,\" he said just as firmly. \"I don\u0027t want to,\" was her response.\n A moment of silence followed and then the doorknob twisted, but the chair held it closed. There was a heavy silence and then Robert growled, \"Have you locked the door?\"\n \"No. I jammed a chair under it,\" she announced. \"I am not speaking to you, Robert. Just go away.\"\n Lisa waited a moment, almost holding her breath, but when no response came, she moved cautiously to the door and listened. However, she couldn\u0027t hear anything and couldn\u0027t tell if he was still out there or not.\n Frowning, Lisa turned away and peered around the room. She then paced restlessly toward the window only to stop halfway there and swing back impatiently toward her bed. She would not spend the next five hours pacing around like a caged animal. It would drive her crazy. She needed to sleep, or read, or something.\n Thinking would be good too, Lisa acknowledged, but she had been trying to do that ever since returning. However, rather than think about what to do, her mind seemed fixed on Robert and all the delightful things he had done to her today and yesterday. That was the last thing she wanted to do now when Richard and Christiana were not here to prevent her from repeating her folly yet again.\n Sighing, Lisa quickly removed her gown and set it across the foot of the bed, then moved to her chest to find a nightgown. The first thing she saw, of course, was the see-through gown of Mrs. Morgan\u0027s. Lisa sighed as she peered at it where it lay folded and resting on top of the clothes in the chest. She would have to tell Bet to burn the damned thing, she thought, but couldn\u0027t resist reaching out to caress it as her mind flooded with memories.\n Shaking her head to try to remove the images filling it, Lisa grabbed a white nightgown and straightened, then whirled with a gasp as her window burst open with a crash.\n \"Robert?\" she said with amazement as he swung himself into the room. \"What the devil?\"\n \"We shall have to put a better lock on that window,\" he said calmly, pushing the two sides closed, but not bothering to try to relatch it. It was dangling and definitely broken. Turning back, he added, \"And it was incredibly foolish of you to jam the door with the chair. If your hooded man returned, I wouldn\u0027t have been able to get in to help you.\"\n \"I was more concerned about keeping you out than anything else,\" she said dryly.\n \"Yes, well . . .\" He grimaced. \"That didn\u0027t work very well.\" She rolled her eyes at the ridiculously obvious claim and then stilled as she saw a small dark stain on his shirt. Biting her lip, she asked shakily, \"Is that blood?\"\n Robert glanced down at the spot, and then to her and quickly covered the spot with one hand. \"No. I must have got some sap on me or something when I climbed up here.\"\n Lisa frowned, not sure she believed him, but wanting to. She really didn\u0027t handle blood well. \"You shouldn\u0027t be climbing about in trees, my lord. You\u0027ll reopen your wound.\"\n \"I\u0027m fine,\" he assured her, moving toward the door. \"I\u0027ll just go change my shirt.\" He removed the chair and then glared at her. \"Do not replace the chair. I will just climb through your window again if you do.\"\n Lisa grimaced, but gave a short, sharp nod of assent. Letting his breath out on a sigh, he nodded and turned to the door, but then paused and asked, \"Where is Bet?\"\n \"Downstairs, why?\"\n \"I have some mending I am hoping she will help me with,\" he muttered and slid out of the room.\n Lisa stared at the closed door for a moment and then hurried to open it and rush out into the hall . . . and nearly ran over Robert, who had stopped to undo his shirt and pull the bandaging away to examine his wound.\n Probably checking to see just how much damage he\u0027d done, she thought and immediately averted her eyes. \"Go to your room. I\u0027ll send Bet to sew you back up.\"\n \"No, that\u0027s all right. I didn\u0027t burst my stitches. I just pulled one a bit. I\u0027m going to clean it up and rebandage it,\" he said, releasing the bandage. \"Don\u0027t bother Bet.\"\n \"You can\u0027t rebandage yourself, Robert. Let me - \"\n \"I\u0027m fine,\" he interrupted, and turned to head into his room. Lisa instinctively started to follow, but paused when she saw Bet appear at the top of the stairs. Concerned by her alarmed expression, Lisa moved to meet her. \"Is something wrong?\"\n \"Aye,\" Bet murmured. \"I thought I\u0027d best warn ye. I heard Handers mention to Cook that he saw Lord Langley go outside and I thought it odd since he\u0027s so determined to watch out for ye. But then it occurred to me he might try climbing the tree to come in yer window.\"\n Lisa nodded wryly. \"Yes, you were right. He did, and now he\u0027s pulled his stitches. Can you fetch some salve and . . .\" she let the last of the request die away. Bet had already turned with a nod and hurried back up the hall to go after what she needed.\n With nothing else to do, Lisa moved to the door of Robert\u0027s room and peered cautiously inside. She spotted him at once. He was seated on the opposite side of the bed with his back to her. He\u0027d already removed the old bandage and was now mopping at his chest with a bunched up bit of the used cloth.\n \"Robert, wait for Bet, she - \"\n \"I don\u0027t need Bet, I\u0027m fine,\" he muttered, continuing what he was doing.\n \"The wound needs to be properly cleaned. Salve needs to be applied and then a fresh bandage has to be put on, Robert. You cannot do it alone,\" she said firmly.\n \"I can,\" he said stubbornly and Lisa shook her head, then glanced around as Bet appeared beside her with a basin of water, a cloth, salve and bandages.\n Lisa stepped aside and gestured for the maid to enter, but remained by the door rather than risk seeing blood.\n \"Thank you, Bet,\" Robert said quietly when Bet moved to the bedside table to set down the items she\u0027d brought. \"That\u0027ll do.\"\n Bet hesitated, but it was definitely a dismissal, so she turned and crossed back toward Lisa with a shrug. What else could she do? Once the maid was gone, Lisa closed the door, but remained by it, watching silently as Robert cleaned the wound properly and applied the salve. It was when he then tried to rebandage himself that he ran into trouble. Which was exactly what she\u0027d expected. \"Lisa?\" he said finally after spending several minutes struggling to get the cloth around himself just once. \"Do you think you could . . . ?\" He glanced over his shoulder to her apologetically.\n Tsking with exasperation, Lisa straightened from where she\u0027d leaned against the door frame, and crossed the room to stand in front of him, very kindly not saying I told you so. Much to her relief the one round of bandaging he\u0027d managed to get around his chest, while crooked, covered the wound and was a clean, fresh white with no sign of blood to be seen. Letting her breath out, she took the roll of bandaging from him and said, \"Arms up.\"\n \"Lisa,\" he murmured, reaching for her instead. \"You can\u0027t marry Findlay.\"\n \"Don\u0027t talk, Robert, it will just end in an argument,\" she warned. \"But - \"\n \"Shall I have Bet do this?\" she asked, raising one eyebrow. The threat made him fall silent and sit back. Relieved, Lisa quickly began to run the clean white cloth of the fresh bandage around his chest. \"You smell delicious,\" Robert murmured as she passed the bandage around his back, her arms around him and her face next to his.\n \"Thank you,\" she said stiffly, bringing the bandage around his front again.\n \"And you\u0027re beautiful.\"\n \"Robert,\" she said on a sigh as she began to run it around his back again.\n \"It\u0027s true,\" he said simply. \"You smell good, you look good . . . you feel good,\" he added, his hands lowering to run from her shoulders and down her upper arms and back as she brought the bandage around his back to the front again.\n \"Robert.\" This time his name was a plea and she paused in her efforts, her eyes closing briefly. Just that light, almost innocent touch of her arms had her nipples hardening and her thighs clenching against a stirring there.\n \"You want me,\" he murmured, leaning forward to press a kiss to her neck that made her shudder. His hand rose to close over one breast then, and he squeezed gently. \"You can\u0027t marry Findlay. He could never make you feel like this.\"\n Lisa shook her head weakly and then brought the bandage around to his chest again and quickly tucked it under the cloth, trying, but finding it impossible to ignore the way he was caressing her. The moment she straightened, his other hand snaked around her hips to clasp her behind through her gown. He used the hold to urge her forward between his open legs as he massaged and kneaded her flesh.\n \"We could do this every night if you married me,\" he said quietly, his hand dipping between her legs from behind and caressing her through her gown.\n Biting her lip, Lisa caught at his shoulders and closed her eyes as her body began to sing under what he was doing.\n \"Marry me, Lisa.\"\n \"Shut up,\" she muttered and caught his face in her hands to raise it so that she could kiss him. Lisa didn\u0027t struggle or demur when he suddenly turned, urging her onto the bed next to him.\n A burst of laughter brought Robert awake. Frowning into the darkness, he listened briefly, slowly relaxing as he recognized the murmur of Christiana and Richard\u0027s voices drawing near. He heard Christiana suggest they check on him and felt a smile curve his lips as he glanced at the lump in the bed next to him, and then the door opened, light splashed in and he saw that the lump was merely the comforter bunched up. Lisa was gone.\n \"Oh, you\u0027re awake,\" Richard said from the door. \"Everything all right?\"\n \"Fine,\" Robert muttered, turning his head to scowl at him. \"I was sleeping but your laughter woke me up.\"\n Richard\u0027s eyebrows rose at the testy voice he used. \"Sorry about that, then. Good night.\"\n Robert sighed as the door closed. He shouldn\u0027t have snapped and felt bad about it, but dammit, Lisa had slipped away again when being caught here would have solved everything.\n Damn, he thought. Next time he would make sure he made love to her in her room. The thought made him blink in surprise. Hell.\n Was he really now contemplating compromising Lisa to force her into marriage? Well, she was already compromised, he just had to prove it. However, the point was that only a matter of days ago, he would have laughed at the suggestion that he wanted to marry anyone, and now he was willing to use dirty tricks to force Lisa into his bed and marriage.\n What a difference a day or two could make, Robert thought wryly and then shook his head. He couldn\u0027t believe she was not willing to marry him. Most women would be screaming holy murder and demanding he put a ring on their finger after being bedded. But not Lisa.\n Robert supposed it was that damned romantic nature of hers. Those bloody books had raised ideas in her. She wanted romance, proclamations of undying love, and happy ever afters. But that wasn\u0027t how the real world worked. People married and were miserable for the rest of their days. Well, most of them, he supposed, thinking of Christiana and Suzette\u0027s happy marriages to Richard and Daniel. Of course, both couples had only been together for a couple of years. There was still plenty of time for the misery to settle in. He was sure even his father and mother must have enjoyed a year or two of happiness at the start.\n Sighing, he shifted on his side in bed, wincing as his chest gave a twinge of pain. He\u0027d not been any more concerned with it tonight than he had been the first night or in the stables. The damned thing was never going to heal if he wasn\u0027t more careful. But he didn\u0027t really care about that when he had Lisa shivering and shaking in his arms, her nails biting into his skin and her pleas ringing in his ear. There was no way he would ever again think of her as a little sister. Robert couldn\u0027t believe that he ever had. The woman was as passionate as he, meeting him thrust for thrust and demanding more. He would claim her for his own. Robert was determined. He just needed to figure out how.\n Lisa turned over in her bed and peered toward the window as she heard her sister and brother-in-law\u0027s bedroom door close and silence return to the house. She\u0027d woken up and slipped back to her room only moments before they\u0027d returned. Just in time, she thought and almost sighed aloud with something like disappointment. If she\u0027d been caught, she would have had to marry Robert. He would have seen to it. And the thought was a tempting one. Enjoying such pleasure every night? Who would not be tempted?\n \"You cannot marry Findlay. He could never make you feel like this.\"\n Robert\u0027s words from earlier rang through her head and she turned restlessly onto her back. The words just continued to repeat through her mind though. And she wondered . . . Could he? Could anyone? Surely Robert wasn\u0027t the only one in the world who could kiss and touch her in a way that roused her passions? The thought was a depressing one. While she didn\u0027t think she could live with his waiting for her to cheat on him, she was also beginning to think she couldn\u0027t live a celibate life in the country either. The man had brought her body to life and she didn\u0027t think it would easily or quickly forget the pleasures it had learned and enjoyed. She didn\u0027t even want to.\n Surely, someone could make her feel at least some of this passion?\n A quiet life with a man she liked, whose company she enjoyed and who could make her feel even half the passion she\u0027d experienced so far sounded far preferable to the alternatives. And she liked Charles Findlay. She enjoyed dancing and chatting with him, had really enjoyed reading with him, the race and . . . well, she liked him. True, his first kiss had barely stirred her passions and had left her wanting. And yes, the second kiss had been painful, but that was her fault. She\u0027d asked him to kiss her punishingly and that\u0027s exactly what he\u0027d done. How was she supposed to know that Robert\u0027s kisses hadn\u0027t been punishing at all?\n Perhaps if she asked Charles to kiss her passionately rather than punishingly it would make a difference, she thought. It was worth a try.\n Of course, he might not be willing to marry her once she confessed that she had been with Robert. And she would have to confess, Lisa thought unhappily. She couldn\u0027t live with such a secret. Her conscience would kill her. But even if he turned from her then, at least if he kissed her and managed to stir her passion she would know that Robert was not the only man in the world who could do so.\n Obviously, all this depended on her not being with child. But then Suzette and Christiana had been married for two years and she knew darned right well from their talk that they were enjoying their marriage bed often and well. Yet neither of them were with child. Okay, Christiana had been once, but she\u0027d miscarried. So perhaps the females in her line didn\u0027t easily get pregnant and that would not be a worry.\n The thought gave her hope. Ruined by itself was definitely better than ruined and with child.\n Lisa turned onto her side again and stared at the window as she contemplated what she should do. She would ask Charles to kiss her passionately. If that worked out all right and he did ask her to marry him, she would tell him about Robert and see how he reacted, and then . . . She supposed the \"and then\" would depend on how he reacted.\n It wasn\u0027t much, but it was the first bit of hope Lisa had felt in days. She might not be able to have the kind of marriage her sisters enjoyed, but then again she might. After all, neither Suzette nor Christiana had known their husbands for years before marrying them. Actually, they\u0027d both only known them for a matter of days. There was still hope for her without Robert. She just had to keep her spirits up and resist the temptation he offered in the meantime. It was the temptation that was her biggest worry. All the man had to do was touch her and her resistance crumbled like a house of cards. It was pathetic really, when she thought about it. She\u0027d been raised better than that. But so long as he was guarding her, she very much feared -\n Lisa sat up in bed abruptly. As long as he was guarding her . . . That was the problem. Richard and Daniel had arranged things so that he would have to guard her in the hopes that he would admit he loved her and give up this ridiculous idea about a curse on the Langley men. But Christiana wasn\u0027t with child, and the women knew about the suitor. There was no longer any excuse not to hire a proper bodyguard to trail her around rather than Robert. And doing that would remove temptation for her.\n \"Damn,\" Lisa muttered, dropping back in bed. She should have thought of this before. She would talk to Richard about it tomorrow. With any luck, Robert and his temptation would be out of the house by tomorrow afternoon.\n \"Oh, it\u0027s you.\"\n Robert stopped his pacing of Richard\u0027s office and turned at that comment to find the man standing in the open office door.\n \"I heard someone in the hall upstairs and got up to investigate, but by the time I pulled on my trousers the hall was empty, so I thought to check the rest of the house,\" Richard explained, moving into the room and pushing the door closed behind him.\n \"I couldn\u0027t sleep,\" Robert muttered, turning away to pace to the fireplace again.\n \"How is the wound?\" Richard asked, moving to the sideboard to pour himself a whiskey.\n \"Healing,\" he answered without interest. It wasn\u0027t his sliced chest that was bothering him. It was Lisa\u0027s refusal to marry him. He couldn\u0027t believe she\u0027d rejected the proposal out of hand. For God\u0027s sake, she\u0027d trailed him around like a puppy for most of their lives, following him with adoring eyes. And she\u0027d slept with him, for pity\u0027s sake. She\u0027d let him do things that no man but a husband should do. She could be carrying their child! And yet she refused to marry him? He would never understand women.\n \"So what has you up and pacing?\" Richard asked, settling in one of the chairs before the fire and eyeing him curiously.\n \"Explain women to me,\" Robert demanded rather than answer. Richard raised his eyebrows and lowered the glass he\u0027d just raised to his lips. \"Any woman in particular?\"\n \"Lisa,\" he growled.\n Richard nodded solemnly. \"What would you like me to explain about her?\"\n \"I asked her to marry me,\" he admitted after a brief struggle, and then added, \"Several times.\"\n Richard didn\u0027t gasp in shock. He didn\u0027t even appear surprised, just asked, \"And why did you do that?\"\n Robert turned away, unwilling to reveal the events that had led to the proposal.\n \"I thought you had no desire to marry?\" Richard prodded. \"That any woman you were foolish enough to shackle yourself to would surely be unfaithful and make your life a misery.\"\n Robert grunted with a nod.\n \"So why ask Lisa to marry you?\"\n He scowled into the cold, blackened logs in the unlit fireplace and shook his head, unwilling to explain.\n After a moment, Richard said, \"Perhaps she refuses because she doesn\u0027t want to be painted an adulteress when she hasn\u0027t earned it.\"\n Robert glanced around with surprise at those words. \"What?\" Richard shrugged. \"Trust is a part of love and necessary for a good marriage, Robert. I have to trust Christiana every day in many small and large ways and she me. If we didn\u0027t have that trust, our marriage could never survive the trials and tribulations of daily life.\"\n He took a sip of his whiskey and then added, \"And it is the same for Daniel and Suzette. Trust is important in a marriage. Lisa knows that. But you aren\u0027t offering it to her with your proposal.\" \"I trust her . . . mostly,\" he added uncomfortably.\n \"Mostly isn\u0027t enough,\" Richard said quietly. \"And I suspect if you can\u0027t offer her your full trust, you will never win her.\" Robert turned back to the fireplace with a frown.\n Several moments of silence passed and then Richard asked, \"Do you think I should trust Christiana as I do?\"\n \"Of course,\" he said without having to think about it. \"And can Daniel trust Suzette?\"\n \"Again yes,\" he said at once. \"Neither of them have a deceptive bone in their body.\"\n \"Well I wouldn\u0027t go that far,\" Richard said with amusement, and then quickly added, \"But my question is, why then do you not trust Lisa? She is their sister. Raised by the same parents with the same values. Why is she untrustworthy when her sisters are not?\"\n \"I do trust Lisa,\" he said with a frown.\n \"Not if you think she would be unfaithful,\" Richard said firmly. \"That is different. It wouldn\u0027t be - it\u0027s not that I think she - it\u0027s - \"\n \"The curse?\" Richard suggested when Robert paused again. \"Yes,\" he said on a sigh and the other man shook his head. \"You do not even recognize how irrational that sounds, do you? Your father pounded that ingrained belief so firmly into your head, you cannot see that it was just the rantings of a bitter old man.\" \"They weren\u0027t rantings,\" Robert said quietly. \"My mother was unfaithful.\"\n \"Has it occurred to you that he may have driven her to it with his beliefs and suspicions?\" Richard suggested quietly. \"I suspect your father was raised by his own father on the same milk of hate and mistrust for women as he tried to instill in you. I think had you not been such good friends with the Madison sisters, you would have grown up a woman hater like him.\"\n Robert frowned. \"He didn\u0027t hate women.\"\n \"Really?\" Richard asked with a disbelieving laugh. \"Give one example of a good or kind thing he ever said about women. Because I met your father a time or two over the years when I was younger and it seemed to me he was a bitter, nasty woman hater.\"\n Richard downed his drink then and stood up. \"I am going back to bed to cuddle up to my wife. You should get some rest too. You are still healing.\"\n Robert merely nodded. His thoughts were now on his father as he sought for even one good thing the man had ever said about any woman. The only thing he could come up with was that Cook made damned fine pasties. Sadly, he\u0027d followed that up with the comment that it was too bad she wasn\u0027t a man.\n Frowning, he moved to the chair Richard had just vacated and settled into it, his mind going back over his childhood and his parent\u0027s interactions. What he recalled were a lot of fights and yelling, usually every time his mother came back from visiting one or another of their boarders or had tea with a friend. Which was almost daily. He recalled his father shouting accusations and his mother responding with frustration and despair. He hadn\u0027t understood at the time, but supposed now that his father had been accusing her of meeting a lover or being unfaithful. And since Robert had usually been with her on those visits and knew she hadn\u0027t been . . . well, all those battles had been for naught. They\u0027d been nothing more than paranoia and false accusations against a woman who hadn\u0027t deserved them.\n It must have been unbearable for her, Robert thought with a frown. How had he never seen this before? Somehow as a young man he had ended up taking his father\u0027s side in everything, sure he was right and she was nothing more than a faithless whore. And, yes, in the end she had turned to another man. But was it possible his father had driven her into the arms and succor of another man with years of what really amounted to abuse? To give her credit, the only affair Robert was even sure his mother ever had was the one with Gower and that had not started until his parents had begun to live apart.\n This was casting an entirely new light on his parents . . . not to mention his beliefs in the supposed curse on the Langley men. It was possible it was nothing more than a case of believing it would happen bringing it about. Had Lisa consented to marry him, would he have driven her to leave him and take up with another for comfort?\n \"Jesus,\" he muttered. \n","sourceLink":"https://allnovel.net/the-husband-hunt-madison-sisters-3/page-13.html","bookId":2649,"book":{"id":2649,"title":"The Husband Hunt (Madison Sisters #3)","description":"Storyline: \n The Husband Hunt (Madison Sisters #3) \n Let the hunt begin… \n Lisa Madison wants a husband, and she has just the candidate in mind: Robert Langley. Trouble is, the infuriating man insists on seeing her as the impish girl she once was—even as every other gentleman in London has taken notice of her womanly…charms. When her beauty lands her in danger, it’s Robert who comes to the rescue…only to announce his affections are not of the romantic variety! \n Robert saw enough sorrow in his parents’ union to know he wants nothing to do with marriage, which is exactly what he’ll be trapped into if he acts on his desire for the irksome siren. And then Lisa does what Robert least expects: gives up on him! As feigned indifference gives way, blistering passion burns at last. But just before the pair can give in to hard-won bliss, an enemy with unfinished business lurks threatening to destroy them both.\n \n","cover":"https://allnovel.net/images/the-husband-hunt-madison-sisters-3.jpg","author":"Lynsay Sands","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-husband-hunt-madison-sisters-3.html","creation":"Oct 5, 2019 8:59:00 AM","modification":"Oct 5, 2019 9:49:25 AM"}}
