{"id":40837,"no":4,"title":"Chapter 4 Mission Impossible","content":"the Massimo Bellini Theater, Catania, Eastern Sicily\n ARTEMIS Fowl and his bodyguard, Butler, relaxed in a private box at the stage-left side of Sicily\u0027s world-famous Massimo Bellini Theatre. Perhaps it is not altogether accurate to say Butler relaxed. Rather he appeared to relax, as a tiger appears to relax in the moment before it strikes. Butler was even less happy here than he had been in Barcelona. At least for the Spain trip he\u0027d had a few days to prepare, but for this jaunt he barely had time to catch up on his martial arts routines.\n As soon as the Fowl Bentley had pulled up at Fowl Manor, Artemis had disappeared into his study, firing up his computers. Butler took the opportunity to work out, freshen up and prepare dinner: onion marmalade tartlets, rack of lamb with garlic gratin and a red berries crepe to finish.\n Artemis broke the news over coffee.\n \u0027We need to go to Sicily,\u0027 he said, toying with the biscotti on his saucer. \u0027I made a breakthrough on the time spell figures.\u0027\n \u0027How soon?\u0027 asked the bodyguard, mentally listing his contacts on the Mediterranean island.\n Artemis looked at his Rado watch and Butler moaned.\n \u0027Don\u0027t check your watch, Artemis. Check the calendar.\u0027\n \u0027Sorry, old friend. But you know time is limited. I can\u0027t risk missing a materialization.\u0027\n \u0027But on the jet you said that there wasn\u0027t another mate-rialization due for six weeks.\u0027\n \u0027I was wrong, or rather, Foaly was wrong. He missed a few new factors in the temporal equation.\u0027\n Artemis had filled Butler in on the eighth family details as the jet soared over the English Channel.\n \u0027Allow me to demonstrate,\u0027 said Artemis. He put a silver salt cellar on his plate, \u0027Let us say that this salt cellar is Hybras. My plate is where it is: our dimension. And your plate is where it wants to go: Limbo. With me so far?\u0027\n Butler nodded reluctantly. He knew that the more he understood, the more Artemis would tell him, and there wasn\u0027t much space in a bodyguard\u0027s head for quantum physics.\n \u0027So, the demon warlocks wanted to move the island from plate A to plate B, but not through space, through time.\u0027\n \u0027How do you know all this?\u0027\n \u0027It\u0027s all in the fairy Book,\u0027 replied the Irish teenager. \u0027Quite a detailed description, if a bit flowery.\u0027\n The Book was the fairy Bible, containing their history and commandments. Artemis had managed to obtain a copy from a drunken sprite in Ho Chi Minh City years earlier. It was proving to be an invaluable source of information.\n \u0027I doubt the Book has too many charts and graphs,\u0027 noted Butler.\n Artemis smiled. \u0027No, I got the specifics from Foaly, not that he knows he\u0027s sharing information.\u0027\n Butler rubbed his temples. \u0027Artemis. I warned you not to mess with Foaly. The decoy thing is bad enough.\u0027\n Artemis was fully aware that Foaly was tracking him and any decoys he sent out. In fact he only sent out the decoys to make Foaly dip into his funds. It was his idea of a joke.\n \u0027I didn\u0027t initiate the surveillance,\u0027 objected Artemis. \u0027Foaly did. I found over a dozen devices on my computers alone. All I did was reverse the spike to get into some of his shared files. Nothing classified. Well, maybe a few. Foaly\u0027s been busy since he left the LEP.\u0027\n \u0027So, what did Foaly\u0027s files tell you?\u0027 said Butler resignedly.\n \u0027They told me about magic. Basically, magic is energy and the ability to manipulate energy. To move Hybras from A to B, the demon warlocks harnessed the power of their volcano to create a time rent, or tunnel.\u0027 Artemis rolled his napkin into a tube, popped the salt cellar into it and deposited the cellar on Butler\u0027s plate.\n \u0027Simple as that?\u0027 said Butler doubtfully.\n \u0027Not really,\u0027 said Artemis. \u0027In fact the warlocks did an exceptional job, considering the instruments available to them at the time. They had to calculate the power of the volcano, the size of the island, the energy of each individ-ual demon on the island, not to mention the reverse pull of lunar attraction. It\u0027s amazing the spell worked as well as it did.\u0027\n \u0027There was a glitch?\u0027\n \u0027Yes. According to the Book, the warlocks induced the volcano, but the force was too strong. They couldn\u0027t control it and the magic circle was broken. Hybras and the demons were transported, but the warlocks were blasted into space.\u0027\n Butler whistled. \u0027That\u0027s quite a glitch.\u0027\n \u0027It\u0027s more than a glitch. The demon warlocks were all killed, so now the rest of the pride are stuck in Limbo, held by a magical spell that was never meant to be perma-nent, without a warlock to bring them back.\u0027\n \u0027Couldn\u0027t Foaly go and get them?\u0027\n \u0027No. It would be an impossible mission to recreate the same circumstances. Imagine trying to steer a feather in a sandstorm, then land the feather on a particular grain of sand, except you don\u0027t know where the grain is. And even if you did know where the grain was, demon magic can only be controlled by a demon. They are by far the most powerful of warlocks.\u0027\n \u0027Tricky,\u0027 admitted Butler. \u0027So, tell me why these demons are popping up here, now?\u0027\n Artemis corrected him with a wagging finger. \u0027Not just here, and not just now. The demons have always felt an attraction to their home world, a combination of lunar and terrestrial radiations. But a demon could only be pulled back if he was at his end of the time-tunnel mouth, the crater, and not wearing a dimensional anchor.\u0027\n Butler fingered his wristband. \u0027Silver.\u0027\n \u0027That\u0027s right. Now because of massively increased radi-ation levels worldwide, the pull on demons is much stronger and reaches critical level with greater frequency.\u0027\n Butler was struggling to keep up. Sometimes it was not easy being a genius\u0027s bodyguard.\n \u0027Artemis, I thought we weren\u0027t going into specifics.\u0027\n Artemis continued regardless. He was hardly going to stop now, in mid-lecture.\n \u0027Bear with me, old friend. Nearly there. So now, energy spikes occur more often than Foaly thinks.\u0027\n Butler raised a finger. \u0027Ah yes, but the demons are OK as long as they stay away from the crater.\u0027\n Artemis raised a triumphant finger. \u0027Yes!\u0027 he crowed. \"That\u0027s what you would think. That\u0027s what Foaly thinks. But when our last demon was off course, I ran the equation from back to front. My conclusion is that the time spell is decaying. The tunnel is unravelling.\u0027\n Artemis allowed the napkin tube to widen in his hand. \u0027Now the catchment area is bigger, as is the deposit area. Pretty soon, demons won\u0027t be safe anywhere on Hybras.\u0027\n Butler asked the obvious question. \u0027What happens when the tunnel decays altogether?\u0027\n \u0027Just before that happens, demons all over Hybras will be plucked off the island, silver or no silver. When the tunnel collapses, some will be deposited on earth, more on the moon and the rest scattered through space and time. One thing is for sure, not many of them will survive, and those that do will be locked up in laboratories and zoos.\n Butler frowned. \u0027We need to tell Holly about this.\u0027 \u0027Yes,\u0027 agreed Artemis. \u0027But not just yet. I need one more day to confirm my figures. I\u0027m not going to Foaly with nothing but theory.\u0027\n \u0027Don\u0027t tell me,\u0027 said Butler. \u0027Sicily, right?\u0027\n So now they were in the Massimo Bellini Theatre, and Butler had barely half an idea why they were there. If a demon materialized on that stage, then Artemis was right and the fairy People were in major trouble. And if the fairies were in trouble, then it was up to Artemis to help them. Butler was actually quite proud that his young charge was doing something for somebody else for a change. Even so, they had only a week to complete their task and return to Fowl Manor, because in seven days Artemis\u0027s parents returned from Rhode Island where Artemis Fowl Senior had finally taken possession of an artificial bio-hybrid leg, to replace the one he had lost when the Russian Mafiya blew up his ship.\n Butler peered out of the box at the hundreds of golden arches and the thirteen hundred-odd people enjoying the evening\u0027s performance of Bellini\u0027s Norma.\n \u0027First a Gaudi building, now this theatre,\u0027 commented the bodyguard, his words audible only to Artemis, thanks to their box\u0027s isolation and the booming volume of the opera. \u0027Don\u0027t these demons ever materialize somewhere quiet?\u0027\n Artemis replied in a whisper. \u0027Just let the sublime music flow over you, enjoy the show. Don\u0027t you know how difficult it is to get a box for a Vincenzo Bellini opera? Especially Norma. Norma combines the requirements of both a coloratura and a dramatic soprano. And the soprano is excellent, comparable to Callas herself.\u0027\n Butler grunted. Perhaps it was difficult for ordinary people to get a box in the theatre, but Artemis had simply called his billionaire environmentalist friend Giovanni Zito. The Sicilian had gladly surrendered his own box, in exchange for two cases of the finest Bordeaux. Hardly surprising since Artemis had recently invested over ten million euros in Zito\u0027s water purification research.\n A Sicilian drinking Bordeaux? Artemis had chuckled down the phone. You should be ashamed of yourself.\n \u0027Keep your watch pointed at the stage,\u0027 directed Artemis, interrupting Butler\u0027s thoughts. \u0027The chances are miniscule that a demon will be caught without silver, even away from the crater, but if one does show up, I want it on film to prove to Foaly that my theory is correct. If we don\u0027t have incontrovertible proof, the fairy Council will never take action.\u0027\n Butler checked that his watch crystal that doubled as a camera lens was angled towards the stage. \u0027The camera is fine, but if you don\u0027t mind I won\u0027t be letting the sublime music flow over me, I have enough to do keeping you safe.\u0027\n The Bellini Theatre was a bodyguard\u0027s nightmare. Multiple entrances and exits, over a thousand patrons that refused to be frisked, hundreds of golden arches that could conceal a gunman and countless nooks, crannies and corri-dors that probably didn\u0027t appear on the theatre plan. Nevertheless, Butler was reasonably confident that he had done all he could to protect Artemis.\n Of course there were certain things that bodyguards could not guard against, as Butler was about to find out. Invisible things.\n Artemis\u0027s phone vibrated gently. Usually Artemis deplored the kind of person who kept their phone on during a performance, but this phone was special and he never turned it off. It was the fairy communicator given to him by Holly Short, plus a few modifications and add-ons made by Artemis himself.\n The phone was the size and shape of a two-euro coin, with a pulsing red crystal at its centre. This was a fairy omni-sensor, which could interface with any communica-tions system, including the human body. The phone was disguised as a rather ostentatious ring on Artemis\u0027s middle finger. Artemis twisted the ring so that the phone sat on his palm, then closed his middle fingers, extending his thumb and little finger. The sensor would decode vibra-tions in his little finger and send them as voice patterns. It would also use the bones in his hand to transmit the caller\u0027s voice to the tip of his thumb.\n Artemis looked for all the world like a young boy talk-ing on an imaginary phone.\n \u0027Holly?\u0027 he said.\n Butler watched as Artemis listened for a few moments, then hung up, twisting the phone back into ring position.\n He looked steadily at Butler. \u0027Don\u0027t draw your weapon,\u0027 he said.\n Which of course had Butler reaching for the butt of his Sig Sauer.\n \u0027It\u0027s fine,\u0027 said Artemis reassuringly. \u0027Someone is here. A friend.\u0027\n Butler\u0027s hand dropped to his side. He knew who it was.\n Holly Short materialized in the velvet-covered seat beside Artemis. Her knees were drawn to her chin and her pointed ears were covered by a black helmet. As she fizzled into the visible spectrum, a full-face visor collapsed into sections and stored itself in her helmet. Her arrival among the humans was covered by the theatre\u0027s darkness.\n \u0027Afternoon, Mud Boys,\u0027 she said, smiling. Her hazel eyes sparkled impishly, or more accurately elfishly.\n \u0027Thanks for calling ahead,\u0027 said Butler sarcastically. \u0027Wouldn\u0027t want to spook anyone. No shimmer?\u0027\n Usually when fairies used their magic to shield, the only thing visible was a slight shimmer, like a heat haze. Holly\u0027s entrance had been completely undetectable.\n Holly patted her own shoulder. \u0027New suit. Made entirely from smart wafers. It vibrates with me.\u0027\n Artemis studied one of the wafers, noting the microfilaments in the material. \u0027Foaly\u0027s work? Section Eight issue’.\n Holly could not hide her surprise. She punched Artemis playfully on the shoulder. \u0027How do you know about Section Eight? Aren\u0027t we allowed any secrets?\u0027\n \u0027Foaly shouldn\u0027t spy on me,\u0027 said Artemis. \u0027Where there\u0027s a way in, there\u0027s a way back. I suppose I should congratulate you on the new job. And Foaly too.\u0027 He nodded at the tiny lens over Holly\u0027s right eye. \u0027Is he watch-ing us now?\u0027\n \u0027No. He\u0027s trying to figure out how you know what he doesn\u0027t. We\u0027re taping, though.\u0027\n \u0027I presume you\u0027re talking about demons.\u0027\n \u0027I might be.\u0027\n Butler stepped between them, interrupting the verbal sparring that was bound to follow.\n \u0027Before you two get into negotiations, how about a real hello?\u0027\n Holly smiled fondly at the huge bodyguard. She acti-vated the electronic wings built into her suit and hovered to his eye level. Holly kissed his cheek, then wrapped her arms all the way round his head. They barely made it.\n Butler rapped her helmet. \u0027Nice equipment. Not run-of-the-mill Lower Elements Police.\u0027\n \u0027No,\u0027 agreed Holly, removing the helmet. \u0027This Section Eight stuff is years ahead of standard LEP. You get what you pay for, I suppose.\u0027\n Butler plucked the helmet from her hands. \u0027Anything an old soldier would be interested in?\u0027\n Holly pressed a button on her wrist computer. \u0027Check out the night vision. It\u0027s as clear as… well… day. And the clever thing is that the filter reacts to light as it passes through, so no more being blinded by camera flashes.\u0027\n Butler nodded appreciatively. Night vision\u0027s major draw-back had historically been that it left the soldier vulnerable to sudden flashes of light. Even a candle flame could blind the wearer momentarily.\n Artemis cleared his throat. \u0027Excuse me, Captain. Are you two going to weep salty tears of admiration over a helmet all night, or do we have matters to discuss?\u0027 94\n Holly winked at Butler. \u0027Your master calls. I better see what he wants.\u0027\n Holly deactivated her wings, settling into the chair. She folded her arms, looking Artemis straight in the eyes.\n \u0027OK, Mud Boy. I\u0027m all yours.\u0027\n \u0027Demons. We need to talk about demons.\u0027\n Holly\u0027s eyes lost their playful twinkle. \u0027And why are you so interested in demons, Artemis?\u0027\n Artemis opened two shirt buttons and pulled out a gold coin on a thong. The coin had a circular hole in the centre. Put there by a blast from Holly\u0027s laser.\n \u0027You gave this to me after you saved my father\u0027s life. I owe you. I owe the People. So now, I\u0027m doing something for them.\u0027\n Holly wasn\u0027t entirely convinced. \u0027Usually before you do anything for the People, you negotiate a fee.\u0027\n Artemis accepted the accusation with a slight nod. \u0027It\u0027s true. It was true, but I have changed.\u0027\n Holly folded her arms. \u0027And?\u0027\n \u0027And it\u0027s nice to find something Foaly missed, even if I did stumble on to it by accident.\u0027\n \u0027And?\u0027\n Artemis sighed. \u0027Very well. There is another factor.\u0027\n \u0027I thought so. What do you want? Gold? Technology?\u0027\n \u0027No. Nothing like that.\u0027\n Artemis sat forward in his seat. \u0027Have you any idea how difficult it is to have had all those thrilling adventures with the LEP and suddenly not be a part of that world any more?\u0027\n \u0027Yes,\u0027 replied Holly. \u0027Actually I do.\u0027\n \u0027I went from saving the world to geometry in a week. I\u0027m bored, Holly. My intellect is not being challenged, so when I came across the demon gospel in the Book, I real-ized that here was a way to be involved without affecting things. I could simply observe, and perhaps refine, Foaly\u0027s calculations.\u0027\n \u0027Which are not actually in the Book,\u0027 Holly pointed out. \u0027Simply observe, my foot.\u0027\n Artemis waved Holly\u0027s point away. \u0027Some harmless hack-ing. The centaur started it. So, I began travelling to mat-erialization sites, but nothing happened until Barcelona. A demon showed up all right, except he showed up in the wrong place, and late. I simply stumbled across him. I would be floating in prehistoric space right now if Butler hadn\u0027t anchored me to this dimension with silver.\u0027\n Holly stifled a laugh. \u0027So it was luck. The great Artemis Fowl trumps the mighty Foaly thanks to dumb luck.\u0027\n Artemis was miffed. \u0027Informed luck, I think, is a better description. Anyway, that is unimportant. I have recalcu-lated with the new figures, and my conclusions, if borne out, could be calamitous for the People.\u0027\n \u0027Go on, tell me. In short words, though. You wouldn\u0027t believe the amount of science I had to listen to today.\u0027\n \u0027This is serious, Holly,\u0027 snapped Artemis. His outburst was followed by a chorus of shushes from the audience.\n \u0027This is serious,\u0027 he repeated in hushed tones.\n \u0027Why?\u0027 asked Holly. \u0027Surely it\u0027s just a matter of sharing your new figures and letting Foaly take care of the rest with light-distortion projectors?\u0027\n \u0027Not quite,\u0027 said Artemis, settling back in his chair. \u0027If a demon appears on that stage in the next four minutes, then soon there won\u0027t be enough projectors to go round. If I\u0027m right and the time spell is unravelling, then Hybras and everyone on it will soon be dragged back into this dimen-sion. Most of the demons won\u0027t make it alive, but those who do could pop up anywhere and at any time.\u0027\n Holly switched her gaze to the stage. A raven-haired woman was holding ridiculously high notes for a ridicu-lously long time. Holly wondered if the woman would even notice a demon popping out of the air for a second or two. There wasn\u0027t supposed to be a materialization today. If there was, then that would mean Artemis was right, as usual, and a lot more demons were on the way. If that happened, then Artemis Fowl and Holly Short would be up to their necks in the whole saving-the-fairy-race thing, yet again.\n Holly glanced sideways at Artemis, who was studying the stage through a pair of opera glasses. She would never tell him, but if a human had to be involved with saving the fairy People, then Artemis was probably the best man, or boy, for the job.\n the island of hybras, Limbo\n No.l struggled up towards the first rocky ridge on the side of the volcano. Several demons passed him on the trail, but not one tried to talk him out of it. In fact, he\u0027d bumped into Hadley Shrivelington Basset, who had offered to scratch a map on a piece of bark for him. No.l suspected that if he did take the big dimensional jump, no one would miss him any more than they would miss their favourite crossbow target. Except perhaps the demoness with red markings who smiled at him. The one from the compound. Maybe she would miss him a little. No.l stopped in his tracks when he realized that the only demon who would care if he was gone was one he had never spoken to.\n He moaned aloud. How depressing was that!\n No.l trudged onwards past the final warning which, with typical demon subtlety, was in the form of a blood-reddened wolf skull mounted on a stick.\n \u0027What\u0027s that even supposed to mean?\u0027 muttered No.l as he passed the sign. \u0027A wolf\u0027s head on a stick. Big wolf barbe-cue tonight. Bring your own wolf.\u0027\n Barbecue. Another word from Lady Heatherington Smythe.\n No.l sat on the ridge, wiggling his rump to dig a little trench for his tail. Might as well be comfortable before jumping the hundred or so metres into the mouth of a steaming volcano. Of course, even if he didn\u0027t get whisked away to the old country, the still wouldn\u0027t be vaporized by the lava. No, he would probably be dashed against the rocks on the way down. What a cheery thought.\n From his seat on the ridge, No.l could see the jagged mouth of the crater and the rhythmic wisps of smoke that drifted skywards like the breath of a sleeping giant. It was the nature of the time spell that things progressed as though Hybras were still attached to the rest of the world, albeit at a different pace. So the volcano still bubbled and occa-sionally burped up a skinny column of flame, even though there was no Earth beneath it.\n If No.l was honest with himself, his resolve was waver-ing. It was easy to imagine hopping into an interdimensional crater when you were rolling your cocooned classmates into a becrusted dung pit. It had seemed then, as the flakes of ash had fluttered down on him, that things could not get any worse. And there had been something in Abbot\u0027s voice that made the idea seem irresistible. But now, sitting on the ridge, with a gentle wind cooling his chest plates, things didn\u0027t seem quite as bleak. At least he was alive, and there was no guarantee that the crater led anywhere except into the belly of the volcano. None of the other demons had made it back alive. They came back all right. Some encased in blocks of ice, some burned to a crisp, but none hale and hearty like the pride leader. Although for some reason, when No.l thought about Abbot, the many moments of cruelty he had suffered at the pride leader\u0027s whim seemed hazy, hard to focus on. All he could remember was that beauti-ful insistent voice telling him to cross over.\n Moon madness. That was the heart of the matter. Demonkind was attracted to the moon. It sang to them, agitating particles in their blood. They dreamed of it at night and ground their teeth at its absence. At any hour of the so-called day here on Hybras, demons could be seen stopping in their tracks to gaze at the space where the moon used to be. It was part of them, a live organic part, and on an atomic level, they belonged together.\n There were threads of the time spell still in the crater. Wisps of magic that curled about the mountain top, snag-ging any demon stupid enough to be caught without silver. And coded inside the magic was the song of the moon, calling the demons back, enticing them with visions of white light and weightlessness. Once those pale tendrils had a grip on a demon\u0027s mind, he would do anything to be closer to the source. The magic and moon madness would pour energy into the atoms of his being, vibrating his very electrons to a new orbit, changing his molecular structure, pulling him through time and space.\n But there was only Abbot\u0027s word that this journey would end on Earth. It could end on the moon, and as much as demons loved the moon, they knew that nothing survived on its barren surface. The elders said that sprites could not fly close without freezing to death, spiralling to Earth with frozen wings and blue faces.\n For some reason, No.l wanted to take the journey today. He wanted the moon to call him into the crater, then deposit him somewhere where another warlock existed. Someone who would teach him to control his strange powers. But, he admitted miserably, he didn\u0027t have the courage. He could not just hurl himself into a rocky crater. The volcano\u0027s base was littered with the charred corpses of those who had imagined the moon calling to them. How could he know if the moon\u0027s power was truly beckoning, or if it was simply wishful thinking?\n No.l rested his face in his hands. Nothing for it but to return to the school. The imps in the pit would need turn-ing or their hides could suffer dung lividity marks.\n He sighed. This was not the first time he had made this desperate journey. But now No.l really thought he would do it. Abbot was in his head, urging him on. He could almost bear the idea of the rocks rushing towards him. Almost.\n No.l toyed with the silver bangle on his wrist. It would have been so easy to slip off this trinket and just disappear.\n Slip it off then, little one, said a voice in his head. Slip it off and come to me.\n No.l was not surprised by the voice. Actually it was more a feeling than a voice. No.l had supplied the words himself. He often conversed with voices in his head. There was no one else to talk to. There was Flambard the shoemaker, and\n Lady Bonnie the spinster and his favourite, Bookie the lisp-ing gossip.\n This voice was new. More forceful.\n A moment without silver, and a new world could be yours.\n No.1\u0027s bottom lip jutted as he considered. He could remove the bangle, he supposed, just for a moment. What harm could it do? He was nowhere near the crater, and the magic rarely strayed beyond the volcano.\n No harm. No harm at all. One little tug.\n The ridiculous notion had No.l now. Taking off the bangle could be like a practice run for the day when he finally worked up the courage to feel the moon madness. His fingers traced the runes on the bangle. They were precisely the same as the markings on his chest. A double charm. Repelling the moon magic. Removing one meant that the force of his own markings was reversed, pulling him straight towards the moon.\n Take it off. Reverse the power.\n No.l watched his fingers grip the bangle\u0027s rim. He was in a daze, a buzzing fugue. The new voice had coated his mind with fog and was in control.\n We will be together, you and I. You will bask in my light.\n Bask in my light? thought the last conscious sliver of No.l. This new voice is quite the drama queen. Bookie is not going to like you.\n Take it off, little one.\n No.l watched his hand tug the bangle over his knuck-les. He was powerless to stop himself — not that he wanted to.\n Moon madness, he realized with a jolt. All the way over here. How can that be?\n Something in him knew. The warlock part of him, perhaps.\n The time spell is breaking down. No one is safe.\n No.l saw the bangle, his dimensional anchor, slip from his fingers and spin to the ground. It seemed to happen in slow motion, the silver flowed and rippled like sunlight through water.\n No.l felt the tingle that comes when every atom in your body is overloaded with energy and boosted into a gaseous form. It really should be terribly painful, but the body doesn\u0027t really know how to respond to this kind of cell damage and so throws up a pathetic tingling.\n There was no time to scream; all No.l could do was disappear into a million flashing pinpoints of light, which quickly wound themselves into a tight band following a path to another dimension. In seconds there was nothing left to show that No.l had ever been there but a spinning silver bangle.\n It would be a long time, relatively speaking, before anyone missed him. And no one would care enough to come looking.\n the Massimo BELLini theatre, SiciLY\n To look at Artemis Fowl, you would have thought that he was here simply for the opera. One hand trained a pair of opera glasses on the stage, the other hand conducted expertly, following the score note for note.\n \u0027Maria Callas is the acknowledged seminal Norma,\u0027 he said to Holly, who nodded politely, then rolled her eyes at Butler. \u0027But I have a confession: I actually prefer Montserrat Caballe. She took the role on in the seventies. Of course, I have only heard recordings, but to me, Caballe\u0027s perform-ance is more robust.\u0027\n \u0027Really,\u0027 said Holly. \u0027I\u0027m trying to care, Artemis, really. But I thought it was all supposed to be over when the fat lady sings. Well, she\u0027s singing, but it doesn\u0027t appear to be over.\u0027\n Artemis smiled, exposing his incisors. \u0027That\u0027s Wagner you\u0027re thinking of.\u0027\n Butler did not participate in the opera-related chit-chat. To him it was just another layer of distraction to be zoned out. Instead he decided to test the night-vision filter on Holly\u0027s new helmet. If it could indeed overcome the white-out problem, as Holly claimed, then he would have to ask Artemis to procure one for him.\n Needless to say, Holly\u0027s helmet would not fit Butler\u0027s head. In fact it would barely slot over his fist, so the body-guard folded the filter\u0027s left wing out until he could squint through it by holding the helmet to his cheek.\n The effect was impressive. The filter successfully equal-ized the light throughout the building. It boosted or dimmed so that every person in the building was seen in the same light. Those on the stage appeared caked in make-up, and those in the boxes had no shadows to hide in.\n Butler panned across the boxes, satisfying himself that there was no threat present. He saw plenty of nose-picking and handholding, sometimes by the same people. But nothing obviously dangerous. But in a second-tier box, adjacent to the stage, there was a girl with a head of blonde curls, all dressed up for a night of theatre.\n Butler immediately recalled seeing the same girl at the materialization site in Barcelona. And now she was here too? Coincidence? There was no such thing. In the body-guard\u0027s experience, if you saw a stranger more than once, either they were following you, or you were both after the same thing.\n He scanned the rest of the box. There were two men behind the girl. One in his fifties, paunchy, expensive tuxedo, was filming the stage with his mobile-phone camera. This was the first man from Barcelona. The second man was there too, possibly Chinese, wiry, spiked hair. He had apparently not yet recovered from his leg injury and was adjusting one of his crutches. He flipped it round, removed a rubber grip from the foot, then nestled it against his shoulder like a rifle.\n Butler automatically moved between Artemis and the man\u0027s line of fire. Not that the crutch was aimed at his charge, it was pointed stage right. A metre from the soprano. Just where Artemis was expecting his demon to show up.\n \u0027Holly,\u0027 he said in a low, calm voice. \u0027I think you should shield.\u0027\n Artemis lowered his opera glasses. \u0027Problems?\u0027\n \u0027Maybe,\u0027 replied Butler. \u0027Though not for us. I think somebody else knows about the new materialization figures, and I think they\u0027re planning to do more than just observe.\u0027\n Artemis tapped his chin with two fingers, thinking fast. \u0027Where?\u0027\n \u0027Tier two. Beside the stage. I see one possible weapon trained on the stage. Not a standard gun. Maybe a modified dart rifle.\u0027\n Artemis leaned forward, gripping the brass rail. \u0027They plan to take the demon alive, if one turns up. In that case, they will need a distraction.\u0027\n Holly was on her feet. \u0027What can we do?\u0027\n \u0027It\u0027s too late to stop them,\u0027 said Artemis, a frown slash-ing his brow. \u0027If we interfere, we may upset the distrac-tion, in which case the demon will be exposed. If these people are clever enough to be here, you may be sure their plan is a good one.\u0027\n Holly claimed her helmet, slotting it over her ears. Air pads automatically inflated to cradle her head. \u0027I can\u0027t just let them kidnap a fairy.\u0027\n \u0027You have no choice,\u0027 snapped Artemis, risking the audi-ence\u0027s displeasure. \u0027Best and most likely case scenario, noth-ing happens. No materialization.\u0027\n Holly scowled. \u0027You know as well as I do that fortune never sends the best-case scenario our way. You have too much bad karma.\u0027\n Artemis had to chuckle. \u0027You\u0027re right, of course. Worst-case scenario, a demon appears, they anchor it with the dart rifle, we interfere and in the confusion the demon is swept up by the local polizia and we all end up in custody.\u0027\n \u0027Not good. So we just sit back and watch.\u0027\n \u0027Butler and I sit back and watch. You get over there and record as much data as possible. And when these people go, you go after them.\u0027\n Holly activated her wings. They slid from her backpack, crackling blue as the flight computer sent a charge through them.\n \u0027How much time do I have?\u0027 asked Holly, as she faded from sight.\n Artemis checked the stopwatch on his watch.\n \u0027If you hurry,\u0027 he said, \u0027none.\u0027\n Holly launched herself out over the audience, controlling her trajectory using the joystick built into the thumb of her glove. She soared above the gathered humans, invisible.\n With the aid of her helmet\u0027s filters, she could clearly see the occupants of the stage-side box.\n Artemis was wrong. There was time to stop this. All she had to do was throw the shooter\u0027s aim off a little. The demon would never get anchored, and Section 8 could track these Mud Men at their leisure. It was simply a matter of touching the marksman\u0027s elbow with her buzz baton to make him lose control of all his motor functions for a few seconds. Plenty of time for a demon to appear, then disap-pear.\n Then Holly smelled burning ozone and felt heat on her arm. Artemis was not wrong. There was no time. Someone was coming.\n No.l appeared on the stage, more or less intact. The trip had cost him the last knuckle on his right index finger, and about two gigabytes worth of memories. But they were mostly bad memories and he had never been very good with his hands.\n Dematerialization isn\u0027t a particularly painful process, but materialization happens to be a thoroughly enjoyable one. The brain is so happy to register all the body\u0027s essential bits and bobs coming together again that it releases a surge of happy endorphins.\n No.l looked at the nub where his previously whole index finger used to be.\n \u0027Look,\u0027 he said, tittering. \u0027No finger.\u0027\n Then he noticed the humans. Scores of them, arranged in rings, rising up to the heavens. No.l knew instantly what this must be.\n \u0027A theatre. I\u0027m in a theatre. With only seven and a half fingers. / have only seven and a half fingers, not the theatre.\u0027 This observation brought on another fit of giggles, and that would have been about it for No.l. He would have been whisked off to the next stop on his interdimensional jaunt, had not a human near the stage aimed a tube at him.\n \u0027Tube,\u0027 said No.l, proud of his human vocabulary, point-ing with the finger that wasn\u0027t altogether there.\n After that, things happened very quickly. A flurry of events blurred like mixed stripes of vivid paint. The tube flashed, something exploded over his head. A bee stung No.l on the leg, a female screamed piercingly. A herd of animals, elephants perhaps, passed directly below him.Then most disconcertingly, the ground disappeared from beneath his feet and everything went black. The blackness was rough against his fingers and face.\n The last thing No.l heard before his own personal blackness claimed him, was a voice. It was not a demon\u0027s voice — the tones were lighter. Halfway between bird and boar.\n \u0027Welcome, demon,\u0027 said the voice, then sniggered.\n They know, thought No.l, and he would have panicked, had the chloral hydrate seeping into his system through a leg wound allowed such exertions. They know all about us.\n Then the knockout serum caressed his brain, tipping him off a cliff into a deep dark hole.\n Artemis watched events unfold from his box. A smile of admiration twitched at the corners of his mouth as the plan unrolled smoothly like the most expensive Tunisian carpet. Whoever was behind this was good. More than good. Perhaps they were related.\n \u0027Keep your camera pointed at the stage,\u0027 Artemis said to Butler. \u0027Holly will get the box.\u0027\n Butler was squirming to cover Holly\u0027s back, but his place was at Artemis\u0027s side. And after all, Captain Short could look after herself. He made sure his watch crystal was trained on the stage. Artemis would never let him forget it if he missed even a nanosecond of the action.\n On stage, the opera was almost over. Norma was lead-ing Pollione to the pyre, where they were both to be burned. All eyes were upon her. Except those involved in a drama of the fairy kind.\n The music was lush and layered, providing an unwitting soundtrack to the real-life drama unfolding in the theatre.\n It began with an electric crackle downstage, stage right. Barely noticeable, unless you were expecting it. And even I, if some patrons did notice the glow, they were not alarmed. It could easily be a reflected blotch of light, or one of the special effects these modern theatre directors were so fond of.\n So, thought Artemis, feeling the excitement buzz in his fingertips. Something is coming. Another game begins.\n The \u0027something\u0027 began to materialize inside the crack-ling blue envelope. It took on a vague, humanoid shape. Smaller than the last one, but definitely a demon, and definitely not a reflected blotch of light. Initially the shape was insubstantial, wraithlike, but after a second it became less transparent and more of this world.\n Now, thought Artemis. Anchor it, and tranquilize it too.\n A slender silver tube poked from the shadows on the opposite side of the theatre. There was a small pop, and a dart sped from the tube\u0027s mouth. Artemis did not need to follow the dart\u0027s path. He knew that it was headed straight into the creature\u0027s leg. The leg would be best. A good target, but unlikely to be fatal. A silver tip with some kind of knockout cocktail.\n The creature was trying to communicate now and making wild gestures. Artemis heard a few gasps from the audience as patrons noticed the shape inside the light.\n Very well. You have anchored it. Now you need a distraction. Something flashy and loud, but not particularly dangerous. If some-body gets hurt, there will be an investigation.\n Artemis switched his gaze to the demon. Solid now in the shadows. Around him the opera steamrolled towards Act Four\u0027s crescendo. The soprano lamented hysterically and almost every eye in the theatre was riveted on her. Almost every eye. But there are always a few bored audience members at an opera, especially by the time Act Four comes along. Those particular eyes would be wander-ing around the hall, searching for something, anything, interesting to watch. Those eyes would land on the little demon downstage, stage right, unless they were distracted.\n Right on cue, a large stage lamp broke free of its clamp in the rigging and swung on its cable into the back canvas. The impact was both flashy and loud. The bulb exploded, showering the stage and orchestra pit with glass fragments. The bulb\u0027s filament glowed with a magnesium glare, temporarily blinding everyone staring at it. Which was almost the entire audience.\n Glass rained down on the orchestra, and the musicians panicked, fleeing en masse towards the green room, drag-ging their instruments behind them. A cacophony of squeal-ing strings and overturned percussion instruments shattered any echoes of Bellini\u0027s masterpiece.\n Nice, thought Artemis appreciatively. The clamp and the filament were rigged. The stampeding orchestra is a lucky bonus.\n Artemis appreciated all of this out of the corner of his eye. His main focus was the diminutive demon, lost in the shadows behind a canvas flat.\n Now if it was me, thought the Irish teenager, I would have Butler drop a black sack over that little creature and whisk him out of the stage door into a four-wheel drive. We could be on the ferry to Ravenna before the theatre crew got the bulb changed.\n What actually happened was slightly different. A stage trapdoor opened beneath the demon and it disappeared on a hydraulic platform.\n Artemis shook his head in admiration. Fabulous. His mysterious adversaries must have hijacked the theatre computer system. And when the demon appeared, they simply sent a command to open the appropriate trapdoor panel. Doubtless there was someone waiting below to transfer the sleeping demon to an idling vehicle outside.\n Artemis leaned over the railing, gazing into the audi-ence below. As the house lights were brought up, the theatre patrons rubbed their dazzled eyes and spoke in the sheep-ish tones that follow shock. There was no talk of demons. No pointing and screaming. He had just witnessed the perfect execution of a perfect plan.\n Artemis gazed across to the box on the far side of the stage. The three occupants stood calmly. They were simply leaving. The show was over and it was time to go. Artemis recognized the pretty girl from Barcelona and her two guardians. The thin man seemed to have recovered from his leg injury, as his crutches were now tucked underneath one arm.\n The girl wore a self-satisfied smile, the kind that usually decorated Artemis\u0027s own face after a successful mission.\n It\u0027s the girl, Artemis realized with some surprise. She is the brains here.\n This girl\u0027s smile, a reflection of his own, rankled Artemis. He was not accustomed to being two steps behind. No doubt she believed that victory was hers. She may have won this battle, but the campaign was far from over.\n It\u0027s time, he thought, that this girl knew she had an oppo-nent.\n He brought his hands together in a slow handclap.\n \u0027Brava,\u0027 he called. \u0027Brava, ragazza!\u0027\n His voice carried easily above the heads of the audience. The girl\u0027s smile froze on her lips and her eyes searched for the source of this compliment. In seconds she located the Irish teenager, and their eyes locked.\n If Artemis had been expecting the girl to quail and trem-ble at the sight of him and his bodyguard, then he was disappointed. True, a shadow of surprise flitted across her brow, but then she accepted the applause with a nod and royal wave. The girl said two words before she left. The distance was too great for Artemis actually to hear them, but even if he hadn\u0027t long since trained himself to lip-read, it would have been easy to guess what they were.\n Artemis Fowl, she said. Nothing more. There was a game beginning here. No doubt about it. How intriguing.\n Then a funny thing happened. Artemis\u0027s clapping hands were joined by a scattering of others from various spots in the theatre. The applause grew from hesitant beginnings to a crescendo. Soon the patrons were on their feet and the bewildered singers were forced to take several curtain calls.\n On his way through the lobby minutes later, Artemis was highly amused to overhear several audience members gushing over the unorthodox direction of the opera\u0027s final scene. The exploding lamp, mused one buff\", was doubtless a metaphor for Norma\u0027s own falling star. But no, argued a second. The lamp was obviously a modernistic interpreta-tion of the burning stake which Norma was about to face. Or perhaps, thought Artemis as he pushed through the crowd to find a light Sicilian mist falling on his forehead, the exploding lamp was simply an exploding lamp.\n \n \n","sourceLink":"http://novel.tingroom.com/kehuan/60/210.html","bookId":387,"book":{"id":387,"title":"Artemis Fowl:The Lost Colony失落的种族","description":"简介： Artemis Fowl and the Lost Colony is the fifth book in the Artemis Fowl Series by Irish writer Eoin Colfer. The book, originally expected to be published in the UK and Ireland on September 7 2006, was shipped to stores early. On September 12 of the sam...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1285550044512bd.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/60","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
