{"id":73799,"no":27,"title":"Page 27","content":"She stood in the shade of a mesquite tree, uncertainty coiling inside her. Why was he still here? He didn’t know anything about the killer—did he? But her head snapped up as Ethan’s words came drifting back to her. If we had access to Garrett’s texts or e-mail, we’d be able to see if he sent the link. They didn’t have Garrett’s phone. But the message might still be somewhere on Travis’s. With another glance around, she climbed the stairs to his door and knocked. For a moment nothing happened. She knocked again, louder. From the parking lot, a middle-aged couple in matching Hawaiian shirts paused as they climbed out of their station wagon, staring up at her. Emma swallowed, sweat gathering on the back of her neck. She lifted her hand to knock one more time, but before she could, the door jerked open. Travis stood in the doorway, his hat off. He wore a white tank top snug across his meaty chest, and a thick gold chain dangled from his neck. His chin jutted belligerently at her. Behind him, Arnold Schwarzenegger filled the TV screen, roaring up the freeway on a motorcycle. “What do you want, lady?” For a moment, she didn’t remember that she was in costume. She blinked, then pulled off her glasses. “It’s me. Emma.” His jaw fell slack. He looked her slowly up and down, his piggy little eyes bulging. The smell of stale tobacco and sweat hung around him. “I need your help,” she said, putting on the sweetest expression she could muster. “Everyone thinks I killed my sister.” “Yeah, I know,” he said, grinning. “That one cop, Quinlan or whatever? He’s been trying to get me to tell him all about you.” She chewed on her thumbnail, knowing she had to play this just right. “What have you told him so far?” Travis shrugged, bracing himself against the door frame so he loomed over her. “So far just about your freaky little habit,” he said. “You mean that video someone sent you?” she said, choosing her words carefully. “Yup,” he said. “Man, I liked watching that. Such a bummer they took it down.” Bingo. Garrett had sent him that link. Her heart swelled with excitement. If she could get her hands on his phone, she could prove it. She took a deep breath. “I didn’t kill Sutton,” she said, a soft, pleading note entering her voice. “You believe me, don’t you?” He smirked. “I don’t know, Emma. You were pretty violent with me. Always had a nasty temper.” Emma tensed, fighting the angry retort that was rising in her chest. She’d kneed Travis in the groin once after he’d tried to cop a feel. That was what had led to his framing her for the theft of Clarice’s money. Travis’s voice dropped conspiratorially. “Besides, Tucson’s a pretty nice place. The cops have me set up here all week—free HBO, room service. All for telling them anything I can about you.” She looked up at him, blinking through her thick lashes, her eyes wide and vulnerable. I was impressed—back in the day, I’d been a master of the puppy-dog-in-the-rain look. If only she could make herself cry on command, Emma would give me a run for my money. “Why are you doing this to me?” She gave her voice the slightest tremble, pretending to wipe at the corner of her eye. Travis glanced left and right as if looking for eavesdroppers. Then he leaned forward, putting his mouth right by her ear as if to share a secret. His breath was rancid with sugar and pot. “The thing is, Emma, you’re a real bitch.” It took all her willpower not to slap him in the face. But she had to play nice. Her lips slightly parted, she rested a hand on his bare bicep. Travis’s eyes flickered down to where she was touching him. “I’m desperate,” she whispered, ignoring the surge of bile at the back of her throat. “I’ll do anything. You have to help me, Travis. You’re the only one who can.” He stared at her blankly for a moment, his malice overcome by surprise. She ran her eyes appraisingly over his body, trying to look seductive, hunting for the telltale rectangular outline of his phone. There. It was in his front pocket, just against his hip. A slow smile spread across his face. “Anything, huh?” He stepped back from the door, holding it open for her. As she stepped past him, he slapped her on the butt, and she jumped. Her stomach lurched. For a moment, she wondered if she was making a huge mistake. Travis was dangerous. But Emma was tough, too. And she needed that phone. She reached up to take the itchy wig off her head, but Travis grabbed her hand. “Leave it,” he murmured, his breath hot on her face. “I like it.” Emma dropped her hands to Travis’s hips, leaving the blonde wig where it was. Slowly, she slid her hands into his pockets. His eyes closed, his breath coming quicker. Her fingers searched past stray coins and a baggie of something she was sure was pot before closing around the hard plastic form of his phone. As she wrenched it from his pocket, his eyes shot open. “What—” But he didn’t get to finish his question. She brought her knee up as hard as she could between his legs. His eyes crossed, and he fell backward onto the bed, clutching at his groin. She was out the door and slamming it behind her before he could even move, taking the stairs three at a time, adrenaline coursing through her veins. By the time he wrenched the door open, she was already at the bottom. “You crazy bitch!” he screamed, limping after her. “I’ll kill you!” “You’ll have to get in line!” Emma yelled over her shoulder as she took off running. She zigzagged around an acne-scarred man dressed in the polyester blazer of a hotel staffer, then sprinted across the parking lot, leaping over medians and dodging cars. The muscles blazed in her legs, but she barely noticed. For a moment, she felt like she could fly. And I was flying right next to her, chanting her name like a cheer. Finally, my sister had gotten her hands on something that might be able to clear her name. And finally, she’d been able to hit Travis exactly where it hurt. 26 SHOW US YOUR TEXTS Emma burst into Ethan’s room thirty minutes later, the phone pressing sharply into her palm. He jumped up from where he’d been sitting at his desk, his mouth open round in surprise. She whipped the wig off her scalp and threw it down in victory, unable to wipe the grin from her face. Ethan stared at the BlackBerry in her hand, then looked up at her wonderingly. “What . . .” “It’s Travis’s phone!” She quickly explained what had happened, leaving out the fact that she’d had to faux-seduce him. “Emma, you’re amazing!” Ethan took the phone, a smile spreading across his face. She sank to the edge of his bed, running her fingers through her mussed-up hair. There wasn’t enough soap in the world to get the memory of Travis off her skin—but it was worth it. She’d gotten the phone. Ethan’s fingers danced over the BlackBerry’s keys, and she held her breath, watching him carefully. After a minute, he shook his head. “It looks like his text history and his e-mails have been cleared pretty recently.” Emma’s heart sank. “So it was all for nothing?” “Not necessarily.” Ethan popped the SD card out of its slot and held it pinched between his thumb and index finger. “That stuff stays forever, if you know how to look for it. And it just so happens that your boyfriend is sort of a techno-geek.” He shot her a grin as he stepped toward his computer. “What are you doing?” Emma said. Ethan stopped. “Plugging it in. Don’t you want to see what’s on it?” “But . . . shouldn’t we take it to the library or something?” Anxiety streaked through her. “What if someone can trace it to your computer? I don’t want it to look like you had anything to do with stealing it.” He shook his head impatiently. “The nearest branch is closed for the night. We can’t wait for tomorrow. Emma, this could answer all our questions. This could be the solution we’ve been looking for!” She rubbed her palms into her eyes. Then she nodded. “Okay. You’re right. Plug it in.” Ethan turned back to his laptop, inserted the card into a small device, and plugged it into the USB port. Instantly a window popped open on his screen, listing the contents of the phone. Ethan clicked to view all the files at once—and blushed a vibrant red as Travis’s entire pornography collection opened on his desktop. He lunged forward, covering the monitor with his torso to shield it from her view. “I’m so sorry,” he mumbled, fumbling to close all the images. Emma’s own face was burning, too, but she couldn’t keep a nervous giggle from escaping. “That was all on his phone?” she exclaimed. “Like, that’s what he takes with him everywhere he goes?” “Just let me . . .” Ethan kept hiding the monitor from her with his body, typing furiously. The back of his neck was scarlet. And suddenly, Emma couldn’t help herself—she laughed. After all she’d been through, after everything that had happened, they were so close to finding out the truth. The only thing stopping them was a few hundred pictures of boobs. By the time Ethan managed to close all the pictures, Emma had reined in her laughter. She moved closer to his desk and put a hand on his shoulder. He was still bright red with discomfort and was looking carefully away from her. “That was like my worst nightmare come true,” he muttered. She looked at the monitor over his shoulder. “Was there room for anything else on his phone?” “We’ll find out.” Ethan’s fingers flew deftly over the keyboard. He typed in several commands she didn’t understand, then paused for a moment before striking hard on the “enter” button with his index finger. Pages of texts and e-mails immediately shot open. Her jaw dropped. “Now who’s amazing?” she breathed, leaning down to kiss his cheek. His flush, which had started to drain away, brightened again. The most recent texts included an exchange between Travis and a girl named “Sapphire” that started with the line HEY GIRL WHUT U WEARIN? Ethan made a disgusted face. “You lived with this guy?” “Child Protective Services didn’t exactly give me a lot of choice,” Emma said, leaning over. “What’s in his e-mail from back in August?” He hesitated. “We’re not accidentally going to find naked pictures of him on here, are we?” She grimaced. “I never said this would be easy.” Emma watched as Ethan scrolled down to the e-mails from August. All of Travis’s friends had e-mail addresses like markdogg69 or bluntmeister. She rolled her eyes. Then she saw it. On August twenty-ninth, someone named hollier_hell had sent a message with the subject line Check this out. She lifted a trembling finger to point to it. Ethan’s eyes widened. “‘Hollier_hell’?” She tucked her hair behind her ears, catching a lock in her hands and twirling it around her finger. “Open it.” Ethan double-clicked on the message.","sourceLink":"https://allnovel.net/seven-minutes-in-heaven-the-lying-game-6/page-27.html","bookId":2398,"book":{"id":2398,"title":"Seven Minutes in Heaven (The Lying Game #6)","description":"Storyline: Seven Minutes in Heaven (The Lying Game #6) My sister wants the truth. But sometimes the truth hurts. For months, my long-lost twin, Emma, has been living my life and trying to solve my murder. She\u0027s unearthed dark secrets about my friends, my family, and my tangled past. But when it comes to finding my killer, she keeps running into dead ends. Until my body shows up in Sabino Canyon. Suddenly everyone knows there are two girls who look like Sutton Mercer—and that one of them is dead. At first the police assume the body is Emma\u0027s. But as questions and accusations start flying, it\u0027s harder than ever for Emma to keep playing me. The truth is bound to come out eventually. And when it does, Emma will be suspect number one in my murder investigation. If she can\u0027t find my killer before time runs out, she\u0027ll end up behind bars . . . or worse. Sara Shepard, the #1 New York Times bestselling author of the Pretty Little Liars books, finally reveals the shocking truth about Sutton\u0027s murder in this riveting novel about secrets, lies, and killer consequences.","cover":"https://allnovel.net/images/seven-minutes-in-heaven-the-lying-game-6.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/seven-minutes-in-heaven-the-lying-game-6.html","creation":"Oct 5, 2019 8:58:41 AM","modification":"Oct 5, 2019 10:28:29 AM"}}
