{"id":87379,"no":14,"title":"Page 14","content":"He wasn\u0027t going to come. Why had she been so stupid? It was too soon. No, it wouldn\u0027t have mattered. It would have been that much harder to accept in a week, two weeks, particularly if they continued on at the same level of intensity. She\u0027d suggested dinner as a way to ease up, of sorts. Take them out of the realm of the dungeon or a home like Tyler\u0027s, which were geared specifically toward D/s play. This was about how they got along when it wasn\u0027t whips and chains, at least not totally. They\u0027d tested those waters on the way to and from Tyler\u0027s and she\u0027d found them to her liking. She wanted more of everything when it came to Mac Nighthorse. Yes, it was better to get it out in the open now. Despite what she had told him, it might have been an act on his part, and she\u0027d just been part of whatever his undercover assignment had been at The Zone. \"Violet,\" she muttered. \"Don\u0027t start doubting yourself now. You know that\u0027s bullshit. Nobody is that good at undercover.\" But he had been on the job in The Zone, and she\u0027d known it the moment she had seen him for the first time. As clearly as she\u0027d known he was a genuine sexual submissive, the most unexpected combination she\u0027d ever encountered in her life. But it was five after. Submissives, particularly ones like Mac, were not late. Ever. Not for their Mistress. She moved to the window again, cursing herself, and saw a black Dodge Ram pickup pull into her driveway, Mac at the wheel. She hastily stepped back so he wouldn\u0027t see her there, but she stayed in the shadow next to the lace curtain panel to watch him get out of the truck, bend into the back area to retrieve the groceries, and turn to come up her walkway. \"My, oh my,\" she murmured. She suspected the jeans were new, or he didn\u0027t wear them often. They were stretch denim and clung to every muscular curve of his lower body, his ass and long thighs, outlining the heavy bulge of his cock and testicles, creasing in all the right places as he walked. He wore something easy to remove, a heavy weight black cotton T-shirt. Violet hoped old Mrs. Zerbrowsky wasn\u0027t looking out her window or she\u0027d have to call 911 to have the widow\u0027s pacemaker jumpstarted. Her own heart was doing a triple-time beat up against the base of her throat, but it wasn\u0027t all due to his appearance, though it by itself screamed sex on demand. Her demand. It had as much to do with the intent focus of his eyes, and the dozen lavender roses he carried in one arm, wrapped in a matching velvet cloth and tied with ribbon, opposite the three bags of groceries he balanced in the other. He hadn\u0027t just showed. With the flowers, he\u0027d made it clear that he\u0027d showed because he wanted to do so. Violet moved to the foyer. Outside the range of the window, she allowed herself a little spin on the hardwood floor, then composed herself at the door and opened it. \"Hi,\" she said. She\u0027d worn a soft knit dress in a deep blue hue that clung to her curves, etching them out in detail, since she\u0027d chosen not to wear a bra or panties. She was barefoot, because she wanted to enhance a casual atmosphere, but as she opened the door, it reminded her forcibly how much taller he was than her. Those silver eyes covered every inch of her, and when they rested on her face at last, it was all she could do not to seize him by the shirt front and kiss him the way she wanted to do. Because she knew the rewards for waiting, she reined herself in. Also, though he had chosen to be here, there were things they needed to talk about. \"Mistress,\" he said softly, extending the roses. She took them and he stepped over the doorway at her gesture. She closed the door with a quiet snick that locked them together in intimate solitude. Mac sat the groceries down on the bench of her antique hallway tree. Crossed his arms over his abdomen in order to grasp his shirt, pull it from the waistband and lift it over his head, baring his upper body as she had ordered. The naked hip bone she glimpsed when he stretched told her that he had followed her every demand and there was nothing under those form fitting jeans but him. The movement brought the light smell of his aftershave to her, just a touch of cologne, and the musk of the male animal beneath it. Mac laid the shirt aside, neatly folding it over the arm of the tree, toed off his shoes and placed them beneath the seat. \"I missed you,\" he said, his dark lashes fanning his cheeks as he lowered his gaze. \"I\u0027d like to honor you, Mistress. Show my devotion to you.\" Violet swallowed. \"Very well,\" she whispered. He knelt, one knee then the other. As he had that night at the supper table, he bent, but now he offered the deference to her as a gift, those broad bare shoulders flexing to take him low enough so that his lips touched her sensitive instep. She didn\u0027t expect him to be completely well-behaved, and she wasn\u0027t disappointed. His tongue traced the arch, and she drew in a breath, the sensation from his mouth tightening every nerve ending between the point of contact up to her pussy. Moisture flooded her so instantly that she couldn\u0027t control it. Her response trickled down her thigh to her knee, paused there only a moment, working its way over the shell of her knee cap, forced by gravitational pull to the inside to run down her calf, as if eager to race to where his lips pressed against her skin. She knew when it reached his mouth, for he abruptly went still. Then his lips moved slightly, taking in her taste. He licked it away, began to trace the path of her pussy\u0027s invitation up her ankle. The heavy soft knit dress covered his head, settling on his shoulders as he followed the track, sucking the dew gently from her skin even as more came down her thigh, like a hot spring from deep within the womb of the earth, her pussy eager to offer its honey to his mouth, but only one drop at a time, wanting to tease. He was above her knee now, his beard brushing her thighs, the hair on his head tickling her clit. Her thighs were too close together to allow him access to the deep channel between them, but he wasn\u0027t deterred. Violet moaned as he reached the top of her thigh, his head completely covered by the skirt. She watched his skull turn, jolted and cried out as his lips touched her clit, the tip of his tongue and his moustache making a tiny tickling movement against her, like the quivering of a light bulb filament. Unbelievably, she came. Suddenly, explosively, a climax of vibration rather than convulsion, shuddering up through the balls of her feet to arrow hard and fast through her cunt. The flowers dropped from her grasp, rolled down his back in their soft wrapping and to the floor, scattering several lavender petals across his calves. Her response gushed forth between her thighs, and he made a soft growl of pleasure but did not move his mouth or tongue from giving butterfly kisses to that tiny jewel of spasming flesh. The moment she started to come, his arms lifted, went around her hips and thighs, a double band to anchor her, keep her steady. Perversely it kept her legs sealed together, so it only doubled the force of the quivering sensation on the clitoral point of contact, especially when she struggled against the inexorable force of his strength. When she finally could breathe, he was carrying her weight, her toes not even on the floor as she clung to his shoulders, his mouth pressed against her clit, at last unmoving. \"I think you missed me, too,\" her slave murmured, his face still obscured by her skirt. The movement of his lips, the soft abrasion of his moustache against her made her whimper, a quiet cry. She reached down, cupped his chin, felt his hot moist breath through the fabric, a little ragged. His act of devotion had been the perfect one to catapult her over the edge, a physical and emotional stimulus she could not resist, sweeping any control away. She could say it was partially the culmination of several days of intense sexual frustration, and partially him, but it was all him. She had denied herself any satisfaction, only wanting it from Mac. \"Put me down,\" she said, her voice unsteady, and he obeyed, setting her on her feet as if she were porcelain. Violet stepped back, uncovered those beautiful bare shoulders, the tousled head, the face rigid with his own suppressed desires. She bent, kissed him gently on the lips, let him clasp her trembling hands as she tasted herself on his lips. \"Come make me dinner,\" she said. Violet had never appreciated the erotic art of cooking until she watched a man she desired as much as Mackenzie do it. The capable way his large hands sliced the fresh vegetables after carefully washing them, sliding his fingers into every crevice to gently remove any dirt, leaving the glistening color of the green zucchini and yellow squash unmarred. The firm, human flesh-like covering of the ripe tomatoes responding to his caress by revealing the deepest hue of their red color. The casual way he tossed them into the pot, a man completely at ease with what he was doing. Scents of preparing food filled her kitchen, adding to the warmth already surrounding them. She placed her wine glass on the counter and turned to hitch herself up on it, and found him there, his hands at her waist. \"Allow me, Mistress.\" She nodded and he lifted her, placing her on the counter with the same care with which he had laid out his eggs on a towel. She splayed her knees, inviting him in, and he obliged, coming close enough that she could glide her hands over his beautiful furred chest, enjoying the touch of his mouth, scented with wine, cruising under her ear. \"Are you going to burn my supper?\" she asked, a smile on her lips. Mac turned his head, nuzzled her cheek with his nose. \"If my Mistress desires me to do so.\" She laughed, pushed him away. \"Not a chance. You bragged about your cooking prowess, you\u0027re going to have to live up to it.\" He returned to the stove. He didn\u0027t initiate further conversation, and she knew he was waiting. Maybe he thought it would be rude for him to bring it up, that she should initiate the discussion as Mistress, though the topic itself lay outside the bounds of their sexual roles. It was hard to tell where the roles ended and began between the two of them, though, so she took a breath and took the first step. \"You can talk about it, if you like,\" she said, taking up her wine and crossing her legs, bracing herself with a hand. \"After all, I opened up the can of worms. Since you\u0027re here, I\u0027m assuming you\u0027re willing for us to get more personal. But you may also...have problems with it.\" His greeting had greatly reassured her, but she knew that it could still go south for them. She didn\u0027t want to wait. She wanted to make sure he could accept what she was, and that she knew what he was, and still go forward. If he couldn\u0027t...well, she supposed she could figure out a way to tie him to her bed and sexually torment him until he got over it, but there were laws against that route, and she controlled Mac physically only with her mind. If he chose to resist her, he\u0027d have her outmatched. Unless she had a stun gun with the capacity to take down an elephant. He turned and saw the worry in her eyes before she could mask it with a light smile. \"You didn\u0027t think I\u0027d come tonight,\" he said. \"I wasn\u0027t sure.\" She lifted a shoulder. \"Cops can be funny about dating other cops to begin with. It was something I needed to know about you before I got too deep.\" Too late on that, he thought. For both of them. He saw the unspoken truth of it reflected in her own expression. He measured a blend of fresh herbs into a bowl, mixed them with his fingers. \"Officer Violet Siemanski, Florida State Highway Patrol. A state trooper. \" He brushed off his hand, extended it to her. \"Mackenzie Nighthorse, Homicide Squad. Though you seem to know that.\" \"I just suspected you were a cop. I didn\u0027t know where, or what level.\" She set down her wine, reached out and clasped his hand. He took it to his lips, brushed them over her knuckles, caressed her fingers. \"My pleasure, Officer. How long have you been on the force?\" \"About four years. You?\" \"Rookie.\" He grinned at her narrow look. \"About twenty now. What did you do before you went into law enforcement?\" He returned to his cooking, watched her out of the corner of his eye. She hesitated, then took up her wine, that hand he\u0027d just touched curled loosely in her lap, signs that he\u0027d reassured her somewhat. No doubt about it, she\u0027d completely knocked him out with the knowledge she was a cop. But what he felt for her couldn\u0027t be shaken that easily, nor was he going to let her worry for a moment that it would. \"I went into the Marines on their scholarship program. I never got posted anywhere very hot, just Germany, Japan.\" \"Scholarship program then, and a Stealth now?\" He gave her a sidelong glance. \"You on the take, Officer?\" She chuckled. \"Not hardly. My aunt was a bit on the eccentric side. Lived in a small house in a neighborhood backed up to the interstate. Never bought a car, bitched about every cent she had to spend on us for Christmas or birthdays. I took care of her when she got sick, because she couldn\u0027t tolerate anyone else. When she died, we were all stunned to find out she was a really shrewd investor, and she left it all to me. I\u0027ve kept most of it in investments, using her portfolio manager. But I paid off my college loans, some of my family\u0027s debts, despite my dad\u0027s protests, and then a year ago, treated myself to the Stealth. I bought it from a guy who had treated it like a baby, who liked looking at it more than driving it, so it barely had any mileage.\" She crossed her legs and gave him a thorough appraisal, lingering over his bare chest and the prominent display of his groin area in the tight jeans. \"I don\u0027t indulge often, but when I do, I go for quality. Goes from zero to fifty-five in under six seconds.\" She could make his blood temperature do the same with those sultry eyes, but Mac managed to stay in neutral, gave her an arch look. \"And how about zero to a hundred?\" \"Fourteen point three seconds.\" She examined her nails. \"According to the factory specifications.\" \"Of course.\" He chuckled. \"So what else did you do in the Marines?\" \"I trained to be an MP and served most of my stint in that. I liked it, and it dovetailed well when I went for my criminal law minor.\" \"What gave away that I was a cop?\" Mac inserted it as a casual question, but it was bothering him. He needed to know. She shrugged. \"I just knew. You didn\u0027t give it away the way a rookie would, with the constant ready stance, but you had that air about you that... well, you know. We just know sometimes.\" He nodded, understanding perfectly, though it disturbed him that he hadn\u0027t been able to out her in the same way. But then, she\u0027d thrown him off stride from the first. \"What\u0027s the frown about?\" \"Just thinking if I put in the right amount of oregano,\" he lied. There was male pride to be preserved, after all. \"So, do you always wear black jeans?\" He shrugged. \"They don\u0027t show dirt, and they can all go in the wash together.\" She chuckled. \"Mackenzie, you just without a doubt told me you\u0027re a bachelor.\" \"I already told you I wasn\u0027t married.\" \"Yes, but now I know I can believe you.\" He looked at her. \"You can trust me, Violet.\" \"Not yet. Not until you know you can completely trust me.\" She gave him an even look in return that told him she\u0027d seen the change in his expression, knew his frown meant something different. But she didn\u0027t push it. Just gave him that face that said he wasn\u0027t fooling her, and took another sip of her wine. \"What\u0027s in there?\" She nodded to the plastic container he\u0027d left on the counter. \"That\u0027s dessert. A chocolate torte.\" Her eyes lit up in anticipation and he grinned. \"I think I\u0027ve found your weakness.\" No, that\u0027s you. Though she thought it rather than said it, he saw it in her eyes as if he\u0027d heard her thoughts. A flush heated his skin, the reaction of an adolescent, but for once he didn\u0027t fight it, didn\u0027t try to remain cool. He let her see how much she was affecting him. \"The fanciest chocolate dessert I\u0027ve had is a Sara Lee fudge cake at Wal-Mart,\" she said. \"And that was pretty darn good. What\u0027s a torte?\" \"A torte is a thin layer of cake with a filling in between the layers. In this case a chocolate gnoche mousse, which is like a whipped chocolate cream. When you place it in your mouth, it should melt into your taste buds. You don\u0027t have to distract yourself with the energy of chewing.\" \"And you made it?\" She leaned over, lounging her body across the counter like a decadent queen, and peeked into the container. \"Wow,\" she said. \"Mackenzie, I might have to marry you.\" He raised his head and saw, though she was teasing him, there was a serious undercurrent to her words. \"I would never be good enough for you, Mistress.\" \"I think you should let me decide that. So, what are you making there?\" she straightened up, reclaimed her wine and distracted him with the sight of her moist lips pressed against the clear glass. \"It looks fairly simple, compared to this.\" \"Making perfectly cooked pasta is an art,\" he informed her. \"And since the dessert is rich, I wanted to provide something simple for the entree. An angel hair pasta tossed in a blend of garlic and oil, with a bit of herbal seasoning, and organic scrambled egg mixed in for protein. A side dish of steamed vegetables. I make the pasta myself.\" He had the pleasure of seeing Violet\u0027s mouth very nearly drop open. She caught it with a snap. \"This isn\u0027t a casual thing for you.\" \"Yes, and no. The job.\" He gestured vaguely with the knife. \"I needed a variety of things to keep me human.\" \"No meat? Is that typical for you?\" He nodded. \"I\u0027ve been a vegetarian for about ten years. When I worked deep cover in the dog fighting rings, early in my career, they liked to warm the dogs up for the crowd with farm animals.\" He sampled the herb blend, nodded to himself before he continued. \"I saw them tear apart a pig, chickens, a cow, then other, weaker dogs. Later, when I was in situations where I saw men fighting for their lives, knowing they weren\u0027t going to win, I saw them lose all their identity. They were nothing but their fear in those last moments. The faces of those animals were the same, and I can\u0027t eat a hamburger or anything like it anymore without seeing that in my head.\" He shrugged. \"I don\u0027t have to cause them to die to live. And so I made my choice. I hope that\u0027s okay.\" She nodded, let him work in silence for awhile. Mac found it a comfortable one, enjoyed the smell of her perfume, the tilt of her head, the sparkle of interest in her eyes at every step that went into the process of preparing food well. He also liked the way her eyes often wandered over his body, enjoying it as she said she would. \"How did you get into D/s?\" she said at length, her tone a little distracted. Mac gave a self-conscious chuckle before he could stop himself. What the hell, he might as well tell her. The worst she could do was laugh. \"I had this dream growing up, about this woman. She\u0027s no one I know, just a figment of my imagination. She\u0027d come to me, and I couldn\u0027t lift my hands, couldn\u0027t touch her unless she said so, and she\u0027d do incredible things to me. When I was about twenty-five, someone took me to a place like The Zone, only a lot more vanilla, as a joke. Sort of a cross S/M strip club where the girls wrapped around the poles wore leather and cracked whips. It did things to me, watching them, and I couldn\u0027t get it out of my head. \" \"So you investigated it some more.\" He shook his head. \"Not at first, but I wanted to. Told myself I was crazy, that it was crazy for a cop to be looking into something like that. We both know what a dangerous line D/s is to walk, what places it can take you, but it lingered in my mind. It was always there whenever sex was an issue. \"Then I got an undercover assignment where the suspect liked to frequent places like The Zone. I saw the less seedy side of it, started realizing it might not be up there with kiddie porn. On a lark, the suspect talked me into playing Dom one night to one of the willing staff. I sucked at it, but fortunately that helped my cover. When it was over, a Mistress came over to me, whispered into my ear. \u0027You\u0027re not a Dom, love. You\u0027re a sub. You ever want to find out what that means, give me a call.\u0027 \"I thought she was putting me down because I\u0027d been so bad at it, yanking my chain, but something about the way she looked at me, trailed her hand down my arm like she had the right to touch me, and the way I felt, like I should stand still and let her do anything to me she wanted to do, really got everything churned up inside. I couldn\u0027t get her out of my head. When the case was over, I called her. Lisbeth. And here I am.\" \"I liked her,\" Violet admitted. \"And yet I\u0027m jealous, regardless.\" \"No need. She liked breaking me into it, but once that novelty was over, she moved on. She didn\u0027t...there wasn\u0027t a true emotional attachment. Not...\" Like with us. The words hung between them, too potent and soon to be voiced. \"You\u0027re a complete enigma, Mac.\" She shook her head. \"Most cops couldn\u0027t do it, even if they had the urge. It\u0027s like you\u0027ve got this split personality thing going, where you crave a Mistress but you\u0027re terrified to let go of the control, because you of all people know how much is outside of your control.\" \"I had bad panic attacks the first few times I was tied up. It still...I still have to fight them off. But I\u0027ve learned to control my reaction. The...desire is stronger.\" \"Mac, look at me.\" When he did, he saw the stunned amazement in her gaze at his admission. \"But you do it anyway.\" He lifted a shoulder. \"As I said, it doesn\u0027t really make sense. Guess it\u0027s not supposed to. With you...it\u0027s different.\" Standing in her kitchen, cooking, the air full of scents and of her, he felt like he could tell her things he had not told anyone, had not had within him to tell anyone until he met her. But he lowered his attention back to preparing their salad, before he said what else he felt he needed to say. \"You scared me more than anyone, but now I don\u0027t know what I was so afraid of. There was a wall. I\u0027m not sure I even knew it was there, though you tried to tell me it was there from the first. Every time a Mistress pushed on it, I felt like I had to keep her away from it, but at the same time I wanted her to try and shove past it, fight me for it. I didn\u0027t understand it, still don\u0027t maybe. I just know you did it, and I feel like you\u0027re inside me now, in a place where I\u0027ve always wanted... a woman to be. Fuck me, I can\u0027t explain it right.\" \"You don\u0027t have to. I don\u0027t think there are any words for the \u0027why\u0027 of it, any more than there are for why I knew that\u0027s where I needed to go.\" He nodded and opened a small covered dish, laid it out on the counter. \"Appetizers. Marinated mushrooms.\" He picked one up, took it to her lips, offering it to her. She could tell the raw sincerity of his admission had unsettled him. It was time to move it back into more comfortable territory. Violet opened her mouth, closed her lips on the mushroom, watched his face as he brushed his fingers over her lips, carefully taking the oill away and then putting them in his own mouth, a quick lick to clean the oill off his fingertips and take her into him. The warmth of the gesture mingled with the effect of the wine, and spread through her. \"What I can\u0027t figure out is how a four-year rookie made me for a cop and I never once suspected her of being on the job,\" he said, shaking his head in disgust. She tilted her head, managed a smile. \"What did you think I was?\" \"I thought maybe some type of company executive, but that seemed cliched. I\u0027d about decided you were a construction equipment operator. You know, bulldozers and such. Since you\u0027re so good at pushing around people bigger than you are.\" \"You\u0027re picking on me now.\" \"Yes.\" He gave her a wicked grin. \"I am.\" \"There\u0027s only one reason I made you for a cop and you didn\u0027t make me,\" she observed, watching his delightful ass as he moved around the kitchen. How pants could be that tight and still be legal, she didn\u0027t know, but she thanked the fashion experts for all their blessings. So tight they creased the tops of his thighs and his ass as he moved, shifted, the cleft well defined for her gaze. \"And what was that?\" \"I\u0027ll tell you later. Come here.\" Mac put down his knife, brushed his hands on the dishtowel and came to her, until he stood between her knees again. He braced a hand on either side of her hips, bringing all his overwhelming presence within her grasp. She moved a hand around his hip, over the curve of one cheek, squeezed, closed her eyes, enjoyed how the muscles tightened under her touch. She felt him begin to lean in, but shook her head, a bare movement. He stopped in mid-motion. Her thighs dampened anew. She had spoken the truth. She didn\u0027t know what made her the way she was, why she so enjoyed a man willing to submit to her, why his obedience to the most subtle command, so subtle it was like he\u0027d read her mind, could overwhelm her. The man between her legs was high-powered, well-trained, but had never been broken. Until her. Until he became hers. \"Take the wine.\" She lifted it. \"And drink. Drink it all, until the last swallow, and then give me that last swallow from your mouth.\" He lifted the glass, his silver gaze now liquid heat, and put it to his lips. She slid both hands along his waistband and to the back of his jeans, firmly grasping his ass in both hands, kneading, stroking, easily imagining what it would be like to feel them flexing, tightening as he drove into her in a slow, pumping rhythm. She watched the glass tilt up, his head back as he downed the wine in slow, measured swallows, his throat working. She brought her hands back around front, palmed the tightly bound package of his erection and testicles, tightened her grasp. He lowered the glass, holding his mouth closed to contain the wine she\u0027d requested of him. Violet released him, hooked one hand in the waistband of his jeans, and used her other to bring his head down to her. The wine flooded her mouth with his tongue, and she savored both, swirling them around, tasting their potency, consuming them. \"Perhaps next time I have wine in my mouth,\" he murmured against her lips, \"you\u0027ll let me put your legs on my shoulders, and I\u0027ll put my mouth on your pussy, slip my tongue in your cunt and let all that warm, red wine run down inside. Mix with your sweet taste and drink from that.\" \"I like that image,\" she breathed against him. She felt his other arm slide around her, pull her closer to his hips, and she let him, rubbing herself against him before she eased off the counter at last, down his hard length. Her bare feet came to rest on top of his and she smiled up at him. \"But I want dinner first.\"","sourceLink":"https://allnovel.net/natural-law-nature-of-desire-2/page-14.html","bookId":1907,"book":{"id":1907,"title":"Natural Law (Nature of Desire #2)","description":"Storyline: Natural Law (Nature of Desire #2) Mackenzie \"Mac\" Nighthorse is a highly respected homicide detective and a career cop. There isn\u0027t a dangerous situation that can back him down. However, the personal becomes uncomfortably entangled in the professional when he goes undercover in a high class BDSM club as a male submissive in order to find a Dominatrix who is winning the trust and then murdering her chosen partners. When his path crosses Violet Siemanski\u0027s, he realizes he\u0027s found a Mistress willing to be his ally in finding the murderess. But Violet is also going to shatter Mac\u0027s shields and make him question who he is and what he wants, a challenge more disturbing than any case he\u0027s ever worked.","cover":"https://allnovel.net/images/natural-law-nature-of-desire-2.jpg","author":"Bella Forrest","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/natural-law-nature-of-desire-2.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:21:10 PM"}}
