{"id":87381,"no":16,"title":"Page 16","content":"He stayed to make her breakfast. And to give her information. While she watched him make muffins from the scratch materials in her kitchen, he told her about his case. She had heard about the two murdered men, but he gave her a high level of detail so she could offer her opinion, complimenting her instincts in a way she could not miss or deny being flattered by. \"You\u0027re moving in the same circles as the murderess,\" he explained, \"and you\u0027re trained. The more you know, the more likely you\u0027ll remember something you saw, or you\u0027ll see something that will help. \" He hesitated. \"I brought pictures of the victims. I thought you might want to take a closer look, see if you remembered them.\" She examined them, the family-provided photos next to the gruesome remains of those smiling portraits. \"They must have come on different nights from me.\" She tapped Rodriguez\u0027s face. \"This one is familiar, but I didn\u0027t know him at The Zone. Most of us have a regular schedule when we go, and those of us with day jobs can\u0027t come as often or stay as late. Did they have memberships in other clubs?\" \"None in common except The Zone.\" \"Well, why even have that commonality?\" \"She wants the top of the line, the ones who are obsessively careful and well established. She\u0027s saying something by killing them.\" \"Well, if that\u0027s the case, and she\u0027s as smart as you say, I\u0027m willing to bet she finds her mark at The Zone, but she approaches them and picks them up elsewhere, so she\u0027s never seen with them at the place that they had in common.\" Violet slid the photos back in the envelope. \"Possible,\" he agreed, rising to put the case file away. \"It\u0027s an angle we\u0027re investigating now.\" Violet rubbed her stomach, eyed the steaming blueberry muffins. Her brow drew down over her forehead. \"I don\u0027t have fresh blueberries.\" \"No, you don\u0027t. You do have some raisins that look about two years old. I pitched them before you poison yourself.\" \"Did you bring a toothbrush in one of those grocery bags, too?\" She asked archly. Mac grinned, bent down and kissed her cheek, didn\u0027t appear at all surprised when she turned and bit his throat. \"A good slave is always well prepared.\" \"Smooth talker.\" When he went back to the sink, she indulged herself in breaking off a piece. \"You\u0027re dangerous to have around, Nighthorse. I\u0027m going to have to spend all my time in the gym.\" \"You can work out with me, sugar. I\u0027ll keep you in shape.\" She rolled her eyes at him, then abruptly sat up straight in her chair. \"Mac, that\u0027s it. The gym. That\u0027s where I saw Rodriguez. The guys who visit the clubs like The Zone, particularly subs, they\u0027re workout-aholics. Maybe...what if your perp scopes them out at The Zone, notes the bag they carry in and out of the club? It\u0027s what most of us use to bring our change of clothes. Most of them have the logo of whatever the fitness club is. All she\u0027d have to do is notice that, get herself a guest membership to that gym, stake out the parking lot a few days, show up on a night he\u0027s there. \"A guest membership is just a slip of paper, with no name on it,\" she continued, thinking hard, \"So it gives her an excellent cover. She initiates a contact, gets to know him, lets him know by the vibes she\u0027s a Dom, wires into that part of him, wins his trust and - \" \"Bingo,\" Mac said softly. \"She has her victim, without ever having been seen together at The Zone, where she first selected him. Possibly not even the same place as the other vics, if they all had different workout memberships. And a gym is a meat market. Defenses are down, open to physical contact and stimulation.\" He pursed his lips, nodded, pulled out his cell phone, dialed. \"Consuela. Mac. Do me a favor, sugar. See if the workout clubs of our bondage vics keep any kind of guest membership rosters, and if there\u0027s any record of our victims visiting there with a guest in the past couple months. I\u0027ve got a good tip. I think it will pan out.\" His eyes shifted to Violet, who picked up her orange juice, set it back down. \"Just leave what you find on my voice mail. Appreciate it.\" He disconnected, studied Violet who was staring moodily now at her plate. \"What\u0027s bothering you, sugar?\" he reached out, covered her hand on the table. \"Her.\" She shook her head. \"I\u0027m sorry. I\u0027m going to sound stupid and naive, and I\u0027m not.\" \"No, you\u0027re not,\" he agreed. \"So nothing you\u0027re going to say is going to sound that way. Tell me.\" Violet rose, went to her window, stared out through the sheer panel. \"It offends me,\" she said at last. \"Deeply. I... To be given the trust of a sub... every Mistress, every Master longs for that. It\u0027s a gift beyond comprehension to the vanilla world. Maybe even to subs. From what you told me, this isn\u0027t a random one night fuck, two people just living on the edge. She chooses a careful sub, a person who lives his life in a moral, responsible way. She wins his trust, builds that bond. She likely achieves that gift. And I think that\u0027s when she does it. That horrifies me.\" She turned to face him, raised her chin. \"Now you can tell me I\u0027m being too sensitive, too green.\" He shook his head. \"I\u0027ve worked on this case for over two months. When I leave you, I go to the station, stare at the pictures, try to connect the dots and sack out in the break room. I\u0027m pouring my soul into this one. For the same reason you feel as you do now. I understand the deep breach, the line she\u0027s broken, and it hits very close to home. It was a bond of trust, and that trust should never be betrayed.\" Icy fear touched her abruptly at the flash of anger in his tone. \"Mac, you aren\u0027t...I\u0027m the only Dom you\u0027re involved with right now.\" \"I told you, I don\u0027t - \" \"I wasn\u0027t questioning your fidelity. I meant for your job.\" She came to him. With him sitting, she had a slight height advantage to stare hard into his face, try to impose her will on him through sheer determination. \"Your undercover work.\" \"Yes, right now. There hasn\u0027t been a need to branch out, because I felt hooking up with a well-connected Dom in the scene would be enough, and I\u0027ve been just trawling through on my off nights, watching the rooms and the action, trying to make connections. And see some connection I\u0027ve missed,\" he added quickly, at her narrowed eyes. \"You won\u0027t go there alone anymore.\" \"Violet,\" he scraped back the chair, stood. \"This is my job.\" \"And it\u0027s your ass you\u0027re carrying around, and it belongs to me.\" She was riding on fear, because she could see clearly what he did not seem to. No safe words, no boundaries. Silver eyes could become steel very quickly, she found, and she remembered the expression on his face when he had wanted to go after Jonathan, that first night. And the picture in the paper. The unbridled fury wasn\u0027t there, but the icy edge of danger was. \"Careful, sugar. There\u0027s a big difference between a sexual submissive and a lap dog. I don\u0027t take orders from anyone but the sergeant when it comes to my job.\" \"No,\" she shook her head, staving off his annoyed response. \"She knows what she\u0027s doing, and as a sub, you could be vulnerable to that.\" \"Violet, I\u0027ve been on the force for twenty years - \" \"But you\u0027re too close to it - \" \"And I\u0027m with you,\" he finished, startling her into silence with the forceful statement. \"I\u0027m with you,\" he said, more softly, touching her face. \"I know,\" she put her forehead on his chest, closed her eyes, listened to his heartbeat. \"I had to try. I care about you, Mac. I care a lot. Let me help you.\" \"You are.\" \"Why are you the undercover person for this? They don\u0027t usually put in an established detective. You\u0027d be too easily made.\" \"Because it\u0027s plausible that a cop who is really a sexual submissive would choose to indulge it in a heavy security place like The Zone.\" \"Then why is your sergeant letting you be in there without back up?\" She said, frustrated. \"This isn\u0027t my area of expertise, but shouldn\u0027t somebody be watching your back?\" \"Somebody is,\" he said. \"She just wasn\u0027t aware of it until this moment.\" \"Not if you\u0027re going in there when I\u0027m not around,\" she said, not mollified. \"Don\u0027t try charm, Mackenzie. It will only piss me off more.\" Patiently he explained the call-in contact arrangement he had with Darla. Violet\u0027s eyes widened as he briefly touched on their conversation. \"You told your boss.\" She shook her head. \"I knew you had impressive balls, but they\u0027re even larger than they look.\" \"It wasn\u0027t easy,\" he shifted, obviously uncomfortable with the flattery. \"It just had to be done.\" She nodded. \"I get that. So you\u0027re going to do two things for me.\" \"What?\" he asked warily. She went to her phone table, came back with another card like she\u0027d given him, scrawled her cell phone, pager and home phone on the back. \"You give that to your sergeant. Tell her I\u0027ll be the inside person watching your back.\" \"Violet, that means she\u0027ll know. I don\u0027t want to risk you or your reputation in your department. It was hard enough for me to do it. You know cops work on the streets, close to the hookers and peep shows, and they don\u0027t see a big difference between what we do and the criminal side of it.\" \"You trusted your sergeant enough to tell her. Now I will, too. We both want the same thing. You, alive. If you trust her, I trust her.\" She held his gaze. \"I won\u0027t crowd you, I\u0027ll defer to your experience, but I won\u0027t let you be in there unprotected. This is a smart, smart Dom, Mac. If she figures out you\u0027re there for her, I\u0027m willing to bet she won\u0027t run. She\u0027ll want to stand and fight. And because she\u0027s a woman, she\u0027ll fight dirty. She\u0027ll try to take you down when you\u0027re not looking.\" \"I\u0027m hoping not. I\u0027d like the chance to take her down.\" \"Then we can do it together. Though I expect to get my department a stroke if I\u0027m right about the gym bag.\" \"A full month\u0027s worth of Krispy Kremes, I promise.\" \"Arrogant creep,\" she retorted, but some of the stress eased out of her as he raised his hand, threaded it through her hair and stroked. \"What was the second thing?\" \"What - oh.\" Her eyes crinkled. \"You ever call another woman \u0027sugar\u0027 again, other than me, and you won\u0027t sit down for a week.\" He grinned, the tension leaving his shoulders as well. \"Yes, Mistress.\"","sourceLink":"https://allnovel.net/natural-law-nature-of-desire-2/page-16.html","bookId":1907,"book":{"id":1907,"title":"Natural Law (Nature of Desire #2)","description":"Storyline: Natural Law (Nature of Desire #2) Mackenzie \"Mac\" Nighthorse is a highly respected homicide detective and a career cop. There isn\u0027t a dangerous situation that can back him down. However, the personal becomes uncomfortably entangled in the professional when he goes undercover in a high class BDSM club as a male submissive in order to find a Dominatrix who is winning the trust and then murdering her chosen partners. When his path crosses Violet Siemanski\u0027s, he realizes he\u0027s found a Mistress willing to be his ally in finding the murderess. But Violet is also going to shatter Mac\u0027s shields and make him question who he is and what he wants, a challenge more disturbing than any case he\u0027s ever worked.","cover":"https://allnovel.net/images/natural-law-nature-of-desire-2.jpg","author":"Bella Forrest","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/natural-law-nature-of-desire-2.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:21:10 PM"}}
