{"id":87382,"no":17,"title":"Page 17","content":"Mac swore, viciously, as he knelt over the body. Suarez stared down at the victim. \"Might as well get a cookie cutter, the way she picks out exactly the same type of guy.\" \"Yeah.\" Only Edward Turner hadn\u0027t been a cookie cutout to his family, Mac thought. \"She moved on this one fast,\" Suarez observed. \"They must have broken through that trust barrier fast.\" It could happen that way. It was something about which Mac couldn\u0027t have claimed firsthand knowledge only a handspan of days before. But he knew he would trust Violet with his life. \"Which may mean they had a prior association, or a mutual friend. Someone will remember her. She\u0027s getting bloodthirsty, and that means she\u0027s getting careless. Or she\u0027s playing more than one at a time.\" \"She\u0027s also getting bolder.\" Consuela squatted next to him. \"She wanted to see the parent arrive on the scene this time. Body was still warm when we got here.\" \"You seal off the block?\" \"Instantly, but you know she\u0027s too smart for that. We\u0027re doing a door to door, but my guess and my gut tell me she slipped right between arrivals. Laughing her ass off, probably.\" She made a disgusted face. \"No, not laughing.\" Mac studied the body, his eyes marking every detail, evaluating its significance or lack of import to the crime. \"This one snapped quickly. I think she\u0027s been carrying around her psychosis for quite a while. But something happened a couple months ago that manifested it. Suddenly, it was all clear to her. She could ease the ache with the kill. And now she\u0027s like a junkie needing the fix, it\u0027s rushing up so hard and fast in her. She\u0027s got a lifetime of pain to get rid of. Killing them wasn\u0027t enough. Seeing the parent find him tonight, she thought that might help, but it won\u0027t. She was in the house when he was discovered, I\u0027d bet on it. Probably left out a back door while they were still standing over him in shock. She\u0027s going to keep varying her MO until she figures out what works for her, and nothing\u0027s going to work. She\u0027s starting not to care about being smart. Getting rid of the pain is what matters. \"Turner\u0027s on The Zone member list.\" Connie noted. \"She\u0027s sticking to that, at least.\" Suarez shook his head, looked like he would have spit if they hadn\u0027t been where they were. \"She\u0027s got a pool to choose from. Seems like there\u0027s a rash of guys lining up to have a woman beat on them these days. Got dealers in school yards handing out coke patches to six-year-olds, and we\u0027re having to waste time with this freak who was begging to get iced.\" Mac used his pen to lift the chin of Edward Turner, looked into the lifeless gray eyes. \"Suarez, that was your daughter that came through the station the other day, wasn\u0027t it? The Britney Spears wannabe in hip huggers and crop top?\" \"Yeah. She\u0027s into that stuff now. You know how teenagers are. Smart about some things, but hormones get in the way of good sense.\" Mac nodded. \"Even so, I guess if someone jumped her on the way home, raped her and left her dead in a ditch, we\u0027d probably bend over her and say the same thing. I mean, with that outfit, she\u0027s got to be asking for it, a twelve-year-old dressed up in an outfit a hooker\u0027d blush to wear?\" \"Crime scene,\" Consuela snapped as Suarez surged forward a step, into her slapped palm. \"Crime scene,\" she repeated. \"Don\u0027t do this, guys.\" \"Look around the room, Suarez,\" Mac said, his voice deadly and low. \"What is it that says freak to you? The picture of his family on the dresser? The TV Guide with his favorite sports shows circled? The suit he\u0027d laid out in the bathroom to wear to work tomorrow? \"Did you notice the display cabinet in the front hallway? This guy was the United Way fundraiser chair at his office, raised fucking fifty thousand this year. In the laundry room there\u0027s a dry-cleaned and wrapped set of suits he was planning to have the men\u0027s shelter pick up to help some down-on-their-luck guys get jobs.\" Mac\u0027s voice was raised now, and he was vaguely aware of the uniforms just outside the door, frozen in shock at the outburst, but there was something boiling inside him, a fire he had to unleash or it would consume him. \"But you know what? That doesn\u0027t matter. Even if he\u0027d been a selfish yuppie prick who\u0027d made less of a mark on the world than a twelve-year-old not old enough to make her mark on anything yet except her daddy\u0027s heart, he\u0027d deserve our help. Less than twelve hours ago, someone stood in this room and played God. I don\u0027t need a repeat performance from an asshole like you. Get out of my crime scene and go find another one that you feel deserves your special touch more.\" \"C\u0027mon, Suarez.\" Consuela tugged on his arm, giving Mac a quelling look. \"Let\u0027s take it outside. Walk it off.\" It took a full moment for him to recall himself, take a deep breath, realize with grim amusement that the cops on the scene were tiptoeing around outside the door, unsettled by the outburst from their usually stoic Oak. Tensions were high. This many murders in such a short time frame meant a lot of pressure on the squad to solve it, and Mac could feel it, see it in the face of every uniform present. He felt it crawling in his own gut as he stared down at another dead kid. He\u0027d spent the past two days at The Zone without Violet, risking the wrath of his pixie, but she was on a twelve-hour shift for the next several days and he wasn\u0027t going to wear her out. He\u0027d turned down several offers to play, evaluating those who offered and knowing they weren\u0027t whom he sought, knowing he was out of the age range anyway. Three FemDoms had brought in twenty-somethings, and he\u0027d had them tailed, but he suspected Violet was right, that whoever their killer was kept them away from The Zone, so the connection was never made. So he watched the FemDoms that trawled, or sat in the shadows watching, and came up with nothing. \"The neighbor remembers a gray Grand Am in the driveway.\" Consuela had returned. \"Lost plate tag. My guess is we\u0027ll get a stolen vehicle report later from one of the downtown neighborhoods, find it stripped and the inside trashed, just like the last two times. I\u0027ve also got some info on the gym connection, a list for you down at the station, if you think you can pull that railroad tie out of your ass long enough to listen to another cop.\" \"Don\u0027t start, Connie. He was out of line.\" \"Suarez\u0027ll do his best on this case, like he does all of them. We\u0027re all frustrated, Mac. He was just blowing it off. He didn\u0027t want this kid to die. I don\u0027t understand this lifestyle choice anymore than he does. Most people don\u0027t. It doesn\u0027t mean we won\u0027t do our jobs.\" \"I know.\" Mac ran a hand over his face, the back of his neck. \"I\u0027ll say I\u0027m sorry. Even buy his daughter the latest Britney CD.\" \"Well, let\u0027s not go crazy.\" Consuela allowed him a small smile, her sharp eyes studying him. \"You may need a vacation after this one yourself. That wasn\u0027t like you, you know. You\u0027re looking a little ragged around the edges.\" \"He\u0027s looking worse.\" He nodded at Edward Turner. \"Are the parents still here?\" \"The father. Mother died when Turner was in his teens. The dad is with the victim\u0027s sister, in the next door neighbor\u0027s kitchen.\" Ten or fifteen minutes of wading through the initial flurry of questions and confused anger of the father, patiently probing through that for anything that might have unconsciously been knowledge of his son\u0027s killer, resulted in very little. Just like the two victims before him, Turner had kept this an aspect of his life his family never suspected existed. \"Why...what kind of person...she didn\u0027t just kill him, she humiliated him.\" Mr. Turner was a spare man, tall and lean. Mac suspected his leanness came not from an ascetic appetite, but as a permanent physical brand left from the death of his wife. He\u0027d seen enough death and the way it affected those left behind to know some always carried it visibly, either through irreparable stress lines around their eyes, a nervous twitch, or a gauntness like this man had. His son had been a strapping kid with wide shoulders, and he didn\u0027t think Edward had gotten that from his mother. Mac nodded. \"Mr. Turner, I need you to think carefully about any friends your son has, and give that contact information to the officer I\u0027ll leave you with when you and I are done talking. That includes any names he might have just mentioned in passing, his regular hangouts, that type of thing. Any very close friends of his will be important, any confidantes to whom he might have told something about more private details of his sexual life.\" \"You think...someone he knew did this? That wasn\u0027t Edward in there. He wasn\u0027t...like that.\" This was the hard part, and Mac kept his eyes steady, his voice calm. \"If it fits with the pattern of the two prior murders we\u0027re investigating, he would have been having a relationship with this woman. It\u0027s not likely he would have brought her to meet you, even mentioned her. Your son was a sexual submissive, a very discreet one.\" Mr. Turner flushed red. \"That\u0027s a lie.\" \"I have no reason to lie to you, sir. He had an active membership at several fetish clubs in Tampa, high-priced, very discreet. He was very careful not to mix this part of his life with the rest of it, to protect his family and career, I\u0027m sure, but I\u0027m thinking there might have been someone to whom he told - \" Mac had lost him, he could tell from the panicked movement of Mr. Turner\u0027s eyes, as a vicious flood of possibilities scattered like bowling pins what little composure the man had been able to collect. He had to shatter their fragile illusion that the submissive posture and props were the act of only one mind. It was the worst aspect of this case, but it had to be done, to be sure his murderess had not been a peripheral part of Edward Turner\u0027s life that had come in contact with the family. The sister sat pale and silent, her hand on her father\u0027s arm, that touch staying with him even as he jerked with impatient, grief-ravaged movements. She was so still that Mac was afraid she might be in shock, and made a mental note to have the EMTs look at her as soon as he and Mr. Turner were done. \"You aren\u0027t going to rub that filthy accusation all over my son\u0027s name. My lawyer - \" \"Mr. Turner.\" Mac deliberately lowered his voice, made sure the man met his gaze, saw the patience and understanding, the lack of threat. \"No one is accusing your son of anything. He\u0027s the victim, a very good man, his life taken away long before it should have happened. We\u0027re trying to find and stop his killer.\" \"But he didn\u0027t ask for this.\" \"No more than any man who takes a lover home to his bed does,\" Mac agreed. \"Mr. Turner, I know this is very difficult, but your understanding of your son\u0027s lifestyle may make you remember things that can help us.\" \"Lifestyle.\" Turner surged up from his chair, knocking it over. The sister flinched, but her fingers had curled into his sweater sleeve and clung to her father\u0027s arm, even as his movements half-yanked her out of the chair. \"My son was not some twisted weak pervert who liked having a woman...beat on him. He was a junior varsity quarterback, and a wrestler. He took care of his sister for four years when my wife died and I had to work two shifts, put off college when he was an honor student with scholarships to go anywhere he wanted to go.\" The man had tears running down his face now and Mac was sure he wasn\u0027t aware of it. \"Saved her from a mugger one night, when there were no cops to be found. Knocked the bastard\u0027s lights out. He wasn\u0027t weak.\" \"No, he wasn\u0027t,\" Mac ignored the lead weight that had settled in his stomach, effectively compressing all his vital organs. \"He was a conscientious man who lived a good life and kept his sexual preferences in the bedroom, a place he thought was safe.\" \"You\u0027re supposed to help. I\u0027m calling my attorney, and if one word of this preposterous story gets out, I swear to God --\" \"You do what you have to do, Mr. Turner,\" Mac took out a card, laid it on the table. \"But remember I\u0027m out there looking for the killer, before she does it to somebody else\u0027s son. If you think of something, you call me.\" After the shocked numbness and the furious denials died away, if the man loved his son, Mac knew he would think it through, try to skirt around the edge of what he couldn\u0027t accept to find a killer\u0027s footsteps. The man swept up the card, flung it at Mac\u0027s face. It was a distraction that he should have seen coming. Turner\u0027s knuckles slammed into his jaw, and then Mac was trying to fend off the man, trying not to strike back and cause him more pain. Several uniforms came to assist, along with the police counselor. The sister sat at the table, her head bowed, her chin pressed to her chest, her shoulders shaking with a grief hard enough to shatter. Mac stood back from the uniforms trying to calm Turner down. As if Turner\u0027s sister was on a separate stage, he watched her fight the pain that, up until this moment, could have been assuaged in the arms of her father or brother. Every sub thought of this scenario, or something like it. That\u0027s why most never took the play outside of a club, not ever. To have one\u0027s sexual preference exposed, one that ninety-five percent of the world considered deviant, to embarrass one\u0027s family, a spouse...it was unthinkable. But when it was a part of a person that couldn\u0027t be denied, it manifested itself one way or another. For most of them, the desire eventually overrode caution. Like most, Mac just hoped never to do anything stupid enough to have something like this happen. But Edward Turner had not been a stupid man. The police counselor gestured, the subtle movement clear. Mac left the room, knowing his value to the family lay elsewhere, out of their sight. Even if he caught the killer, delivered her head to Mr. Turner and his daughter, they would never welcome the sight of him again, a man associated not just with their son\u0027s death, but a truth they never wanted to know. He stepped outside onto the front porch and found his sergeant waiting for him there, leaning against a column. \"Good punch for a guy twice your age.\" Darla straightened, reached up, touched his face. \"I\u0027ve got a pissed off Suarez in the dining room of the murder scene, Detective. You going to take care of that?\" \"I clean up my messes. Is that why you\u0027re here on my crime scene, Sarge? To play daycare manager?\" Her eyes narrowed. \"Careful, Detective. Maybe if the primary could keep his temper under control he wouldn\u0027t be thinking that\u0027s why I\u0027m here. And I\u0027ll remind you,\" her countenance was hard and aloof, telling him he\u0027d definitely stepped over her line, \"that every crime scene that falls in our jurisdiction is my crime scene, as much as yours.\" \"I know. Jesus, Sergeant, I\u0027m sorry.\" And he meant it. Her anger defused as rapidly as his own, and she inclined her head. \"You\u0027re pushing this one too hard, Mac. It\u0027s getting under your skin. But I\u0027m not telling you anything you don\u0027t know. I should have given you some down time. You brought down that serial killer less than a handful of months ago and you haven\u0027t had a vacation since - \" \"I\u0027m fine.\" He waved that away. \"I\u0027m old enough to baby-sit myself, Sarge, don\u0027t worry. When we close this case, I\u0027ll cheerfully abandon the lot of you for a couple weeks in the Keys. Even if there\u0027s a major prison break and the streets of Tampa are swarming with death row inmates.\" \"I\u0027ll hold you to it,\" she responded. \"I guess this one hits pretty close to home, hmm? Hearing everyone say he asked for it.\" From her expression, he could tell she wondered the same thing herself, and what his position on it was. If it had been someone else, someone like Consuela or Suarez, he would have brushed it off, changed the topic. He\u0027d never had any interest in being a salesman for his personal life, but she had gone out on a limb for him, and he owed her at least the answer to her curiosity. \"It gets tedious,\" he admitted. \"He asked for it as much as anyone asks for it who opens himself up to another person, hoping to find a connection.\" Mac glanced back at the door, behind which Mr. Turner and his recriminations lay. \"But my father would have felt the same as him. I was varsity, myself. Was offered a scholarship based on my football skills. I went into law enforcement instead. Most people I know feel like this about D/s. That\u0027s why you always hope to find someone with whom you can finally be who you are. Isn\u0027t that what we all want?\" He said it lightly, wanting to shrug it off, but her eyes told him she wasn\u0027t buying it. Cops never did, but they also knew when to respect the boundaries and back off. He didn\u0027t want to do this now, not with the stench of blood in his nostrils. \"Why are you here, Sarge?\" \"Connie called me before we located you. She felt I needed to see one of the pieces of evidence on the body and talk about it with you directly. She pulled it off before you arrived on scene, handed it over to me when I got here just now.\" Her face unreadable, she lifted the plastic evidence bag that she\u0027d been holding under her arm. It was a folded sheet of paper, standard ruled notebook stock. His murderess was smart enough not to personalize herself with perfumed stationary. In small block letters, only taking up one line in the center of the page, was her message. You\u0027re next. Mac\u0027s brow furrowed. When he shifted, he could see through the kitchen window, where Mr. Turner sat at the table, alone now, face hidden by his hands, shoulders shaking in that harsh way that men who rarely cried did, as if each tear had jagged edges. \"The killer wanted to threaten whoever found the body? That\u0027s new.\" \"No, Mac.\" Darla\u0027s hands closed over his, made him turn the bag over to read the back of the page, the name of the person to whom the message had been addressed. Detective Mac Nighthorse. \"She\u0027s made you, Mac. She knows you\u0027re looking for her, and she\u0027s made it personal.\" Darla Rowe was one hundred percent business now, and Mac knew that look on her face. \"Damn right she has, and she\u0027s going to be sorry for it.\" \"You want to know what our shrink says about her leaving you a note?\" \"I have a feeling you\u0027re going to tell me.\" \"Says she\u0027s gunning for you specifically now. She doesn\u0027t care about being caught. In fact she\u0027s probably hoping it\u0027s going to happen soon, because with this many kills under her belt so quickly, she\u0027s got the pain of a rabid dog driving her. So she doesn\u0027t care if she takes you down right under our noses. In short, Psych says she\u0027s at her most dangerous now. You\u0027ve drawn her out, and she\u0027s pissed as well as challenged. We need to put a man in on the inside with the security team. I know you said you didn\u0027t want that, that you have privacy issues, but now I\u0027m more concerned about keeping you alive.\" He faced her. \"I told you, that wouldn\u0027t work.\" \"She knows who you are now, Mac. You could bring the whole squad in there, and it wouldn\u0027t matter.\" \"Yes, it would. Because she still has sense, and it might make her back off me and take another couple of victims to distract us for awhile. It\u0027s a double-edged sword. If she knows me this well, she knows I\u0027m the genuine article, even if I am a cop. It\u0027s male subs that get her off, rouse the bloodlust. I\u0027m a double treasure to her.\" He waved the bag. \"With this, she\u0027s looking for a one-on-one gunfight. \"And we\u0027re supposed to give her that gunfight?\" \"We\u0027re supposed to make her think we\u0027re giving her that.\" Mac hesitated, then made the decision he hadn\u0027t wanted to make. He had to accept Violet\u0027s offer, and overcome his desire to protect her. He didn\u0027t like her being involved, but she was a cop, had taken the oath just as he had, to protect and serve. It would be an insult to her not to allow her to help. Even more important, it would be a disservice to the three dead men. Whatever resources offered to him, he had to use them. For them. Even so, it was an effort to hand over the card, not snatch it back when Darla reached for it. \"She\u0027s my back up.\" You\u0027re a male chauvinist pig, Mackenzie. \"Yeah, yeah, yeah. Buzz off, sugar,\" he muttered. Darla gave him an odd look, took the card, looked it over. Did a double take. \"You going outside the squad now, Mac?\" She\u0027s already on the inside with me,\" he said, keeping his gaze level with hers. \"She\u0027ll watch my back and she wanted you to have that as an alternate contact. I hope...\" he cleared his throat. \"You\u0027ve respected my privacy, gone above and beyond, but this is my case, my job. She\u0027s volunteering for the duty. I\u0027d hate to see it come back and bite her in the ass.\" \"She got the experience to cover you in something like this?\" \"Four years with state, a couple years before that as a Marine MP. I think she\u0027ll do well enough. What she lacks in direct experience, she\u0027s got in grit.\" \"All right, then.\" She pointed to the bag, \"But this makes me real itchy, Mac. Let\u0027s close this one. At the rate she\u0027s piling up a body count, we\u0027re going to have to move fast to keep the S\u0026M angle out of the news. And the families have enough to deal with as it is.\" \"No argument there.\" \"Detective?\" Mac turned, cursed inwardly as he saw the young woman standing in the doorway. The sister, pale but determined-looking. \"I\u0027m Mara Turner, Edward\u0027s sister.\" She hesitated, then the words tumbled out of her, as if she were forcing them from herself rapidly so she\u0027d get them all out at once before she could rethink the decision. \"I needed to tell you...I knew about... Edward\u0027s preferences. When I was staying at his place once, I found a magazine. We talked and I was open to hearing about it.\" She colored at Mac\u0027s lifted brow. \"No, I\u0027m not into it or anything, not at all, but he was my brother, and I mean, it\u0027s the twenty-first century, you know? He was a good person with a good heart, and I trusted his judgment. He seemed glad to have someone... he trusted, to talk with it about, an open mind that linked him between that world and the one we knew him in. I just...I wanted to tell you that about three weeks ago he told me he\u0027d been seeing someone really special. I think he was even a little in love with her. I told him he should introduce her to Dad, that this was just one aspect of his life. He didn\u0027t, I mean...I take boyfriends home to meet Dad, and we sure as hell don\u0027t talk about our sex life.\" She managed a ghost of a smile that trembled around the edges. \"He said no.\" Her attention drifted over to the house, to the bedroom window behind which her brother lay murdered. \"He said she\u0027d asked him herself, recently, if he was going to introduce her to Dad. Edward told me that he had said no, that he didn\u0027t want to mix that part of his life... he couldn\u0027t take the risk of integrating the two. He was worried he\u0027d hurt her, which is why I guess he called and talked to me about it, because it was bothering him. He cared. He didn\u0027t like hurting people. Then a couple days later when we talked he said she was fine with it, that they were going out this weekend.\" \"Did he describe her? Give a name?\" She shook her head, brushing away the tears that wouldn\u0027t stop running. With a nod of thanks, she accepted the Kleenex Darla handed her from her purse. \"No,\" she sniffled. \"He never told me that, said he had to respect her privacy as carefully as he\u0027d guarded his own. I wish...\" her voice hitched and she turned away. \"I wish that hadn\u0027t mattered so much to him. I wish he were alive.\" Darla moved to put an arm around the girl as she broke down completely again, sobbing. The sergeant murmured to her, cast Mac a quick glance before she guided her back into the house. Mac turned and faced Edward Turner\u0027s home, his eyes hard and hot as fired steel. \"Your little bloodbath is over, sweetheart,\" he said between his teeth. \"You come after me this time. You may take me down, but if I go, you\u0027re going down with me. So help me God, this is your last one.\" He crushed the plastic evidence bag in his hand and headed back down the walkway, to start the painstaking process of going back over the room one more time for every possible clue. \"Mac, Mac!\" Darla was hurrying after him, holding her radio. \"Sister okay?\" \"Fine, fine. It\u0027s not that.\" She stopped at his side, taking a breath. \"When you handed that card to me, I glossed over the name, just focused on the fact she was a trooper. But I know her name. You\u0027ve been here, what? An hour?\" He nodded, his brow furrowed. \"What is it, Sarge?\" The radio beeped and she raised a finger, responded. \"I\u0027m here, Roscoe.\" \"Yeah, Sergeant.\" The radio crackled in her hand. \"I got it for you. The name of that trooper that got shot about a half hour ago.\" Mac stared at Darla. Everything in him stopped. Blood, breath, heart. Darla\u0027s hand reached out, closed on his wrist as they waited three tense seconds for Roscoe to complete his message. \"Violet Siemanski. They\u0027ve got her at Tampa General.\"","sourceLink":"https://allnovel.net/natural-law-nature-of-desire-2/page-17.html","bookId":1907,"book":{"id":1907,"title":"Natural Law (Nature of Desire #2)","description":"Storyline: Natural Law (Nature of Desire #2) Mackenzie \"Mac\" Nighthorse is a highly respected homicide detective and a career cop. There isn\u0027t a dangerous situation that can back him down. However, the personal becomes uncomfortably entangled in the professional when he goes undercover in a high class BDSM club as a male submissive in order to find a Dominatrix who is winning the trust and then murdering her chosen partners. When his path crosses Violet Siemanski\u0027s, he realizes he\u0027s found a Mistress willing to be his ally in finding the murderess. But Violet is also going to shatter Mac\u0027s shields and make him question who he is and what he wants, a challenge more disturbing than any case he\u0027s ever worked.","cover":"https://allnovel.net/images/natural-law-nature-of-desire-2.jpg","author":"Bella Forrest","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/natural-law-nature-of-desire-2.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:21:10 PM"}}
