{"id":87369,"no":4,"title":"Page 4","content":"She didn\u0027t know what to make of him. Tyler had counseled her to keep it light and easy her first night on her own, and here she was, in the deep end of the pool.\n He followed her to the lower level, to the door of the room she\u0027d reserved, a room with polished wood paneling and carved rafter beams, the trappings of a stable for a prize thoroughbred. The large stall area was mounted with a variety of stainless steel polished rings to cross tie at different heights and distances. On a sawhorse made of finished maple with antique hinges, a saddle had been mounted. Bridles, tethers, crops and buggy whips hung on a wall rack, as well as a few things she\u0027d requested provisioned as extras that one wouldn\u0027t normally find in a barn. \"Stand there,\" she pointed to the middle of the floor outside the stall and went to a control panel in the wall. \"I\u0027d like privacy for our first time together,\" she said, watching his face.\n No flicker of disappointment, or of relief. Based on his unassuming mode of dress, she suspected her prize was not an exhibitionist. However, that wasn\u0027t to say he wouldn\u0027t be turned on by being displayed at his Mistress\u0027s command. He might be the type of sub that got turned on by whatever turned his Mistress on. Taking a deep breath with her back turned to him to calm her reaction to the thought, she still felt his intensity like hands running over her neck and shoulders, her bare back, the curves of her ass, the delicate skin of her inner thighs. She could imagine the press of his lips in those places, chaste, light kisses where his mouth would quiver with the restrained desire to open wide and devour her, one taste at a time.\n Some subs - she liked to think of them as bottoms - didn\u0027t care who the Mistress was, as long as they delivered the gratification the sub sought. But the subs for whom the desires of a specific Mistress were the gratification, those subs sought to serve in whatever manner commanded. Some were instinctively protective as well, as if they were reincarnations of palace guards for ancient queens. She thought of the look on Mac\u0027s face when Powell had insulted her. The nasty comment had delivered a blow to her ego, but Mac\u0027s reaction had kept it fully inflated.\n She engaged the darkening feature of the ceiling glass so the club visitors could not watch them. She knew the staff security could still monitor them through the discreetly placed mirrors, but no one else would be privy to this evening\u0027s entertainment.\n \"Mac. That\u0027s your name.\"\n \"Yes, Mistress. If it pleases you.\"\n \"I\u0027m having a hard time finding anything about you that doesn\u0027t please me, Mac.\n What\u0027s your given name?\"\n He hesitated, those silver gray eyes shifting. \"Mackenzie.\"\n \"Mackenzie. I like that.\" She stayed at the wall, watching him, making no attempt to move closer. The air was getting still and warm.\n \"Take off your shirt, Mackenzie. And next time you come into this club to meet me, you\u0027ll take it off at the door.\"\n Mac slipped the buttons of the shirt. Violet watched him, studying the lowered eyes. He was not trembling or hurried, but somehow she felt an explosive tension off of him. If she had to bet, she\u0027d say she made him nervous. Very nervous, but he was very, very good at not showing it.\n Why someone like him was nervous about someone like her, she didn\u0027t know, but she knew D/s went deep into the psyche of each individual, with often unpredictable reactions.\n She wouldn\u0027t let herself fill with doubt or fear of not doing the right thing, or let Jonathan\u0027s mockery come through and unbalance her. Mackenzie might just be being kind with his attentiveness, but even so, she was going to make him wish for another night, and then another.\n Like any art form, if she focused on performance, end results or audience reaction, she\u0027d lose the edge, pull herself out of the spiritual undercurrents driving the sensual process. Nature would take them to the right destination, though she enjoyed having the freedom to play with the right amounts of water, sustenance and light to make Nature\u0027s beauty thrust its way eagerly out of the ground.\n He removed the shirt from his shoulders and she drew in a breath. Speaking of Nature\u0027s beauty. He was as beautiful as she expected. A furred and powerful chest, with that same silver, white and black pelt he had thick on his skull. Sleek muscle, curves and angles that meshed in perfect imperfection. A couple of scars. The hair narrowed down to its delightful indicator point on his flat belly and disappeared into his black jeans, which she noted had a tighter fit now, due to his erection straining the denim. She made an effort to keep her face impassive, not lick her lips and dance for joy as she wanted to do.\n Choosing a soft-bristled grooming brush from the wall, she moved toward him at last. One step, two steps. Her booted heels were loud in the silence between them. He kept his eyes down as she approached, circled behind him and laid a palm on his bare back between his shoulder blades.\n \"Someone trained you well,\" she said, noticing his hands stayed loose, undefensive at his sides. His skin was smooth and hot beneath her touch, but she resisted the urge to tighten her grip. Whether he was advanced level or not, he was a beginner with her as his Mistress, and she knew the importance of establishing the ground rules.\n Plus, she wanted to take it slow, savor these very first touches the way a first kiss was supposed to be savored. One never knew if that first kiss might be the first kiss with a soulmate, such that everything done with him after that point would be the ultimate choice of a lifetime.\n Violet lifted the brush, slid it over his skin, watched the bristles bend and mold over the muscles in his shoulders, his shoulder blades, his back. The bristles were soft, but still worthy of being called a brush, so they made faint trails in his skin, stimulating it.\n \"So what\u0027s your safe word, Mackenzie?\" she asked, passing her hand down the same trail, using her nails a bit.\n \"I don\u0027t use one. If I can\u0027t take it, I don\u0027t deserve you.\" Violet stopped. \"That\u0027s a pretty high risk to take, Mac, with someone you don\u0027t know.\" It genuinely concerned her, for he obviously came to these clubs on his own, and he was not a regular at The Zone.\n \"Nevertheless.\" He kept his gaze on the floor. \"I serve my Mistress\u0027s pleasure, whatever that pleasure might be. I don\u0027t have one, and I don\u0027t want one.\"\n \"I\u0027ll set the rules, Mackenzie. What if I make you watch me while another man fucks me?\"\n He stiffened and she smiled, rubbing her brush down the other shoulder. His skin was getting damp. \"That would bother you, then?\"\n \"Only because I know I could do anything he did for you better.\" Violet pressed her lips together against another smile, even as she felt her knees quake. She\u0027d no doubt he could. His voice alone, its shifts from sensual deference to arrogant impudence, was making her wet.\n \"Arrogant slave.\" She laid down the brush, chose another, this one with stiffer bristles. \"I\u0027ll bet those jeans are getting very uncomfortable.\"\n \"Shall I take them off?\"\n \"Not yet. I like to see your cock straining against them for me. I\u0027m not ready to let you be comfortable.\"\n She loved the feel of his skin beneath her palms, his heated stillness. When she caressed his nape with her long nails, he bent his head forward, making it easier for her to stroke him there.\n A breath drew in his muscles, his buttocks tightening in a very appealing manner as she returned to her brushing, increasing the pressure of her strokes with the stiffer brush, raking his skin, bringing the blood to the surface to sensitize him further. She alternated across, varied from light to hard, so his skin would not get numb to the stimulation. His breathing grew labored. Though she wanted to do so, she didn\u0027t have to look to know his arousal was increasing.\n \"You seem to be getting a bit fractious,\" she murmured. \"Follow me.\" Putting down the brush on a ledge of the stall partition, she lifted two tethers of soft nylon from where they draped over the doors. Turning so she could see him come toward her, she suppressed a shudder of reaction at the sight of that muscled body, lightly perspiring with nerves and heat, the silver eyes, intent with desire. The awkwardness of his gait drew her attention down to his cock, now clearly outlined against the front panel of his jeans.\n \"If you could do anything you wanted to do right now, Mackenzie, what would it be?\"\n The path of his eyes coursed down the front of the velvet dress, but he took another step closer, so close she felt his hand at his side brush her hip. Felt his fingertips take the liberty of caressing the lace top of her thigh high, seeking to trace the bare skin just above it, below her dress\u0027s short hem.\n \"I\u0027d kneel at your feet and eat your pussy until you came in my mouth, your hands clutched in my hair, nails digging into my skin. I\u0027d listen to you scream my name. Mistress.\"\n His fingers inched higher, his eyes gauging the rise in her pulse rate, which she felt beating against her throat as clearly as she knew he could see it.\n \"You need to learn some manners.\" She caught his wrist in a firm grip.\n The tether was similar to the nylon ropes found in a horse barn, only this one had a cuff at the end of it. She fitted it around his wrist. \"Turn outward so your back is facing the back of the stall, and put both arms behind you, crossing your forearms.\" His fingers flexed as she laced the cuffs on his wrists securely, making sure he had blood flow, but tight enough he could feel the restraint, send the message to his mind that it was the first step toward the total domination she intended to exercise over him tonight. As she did the lacing and checked the pressure, her knuckles were brushing the ass hugged by the denim. It was too tempting. She allowed herself to free one hand, close it over the curve of one buttock, grip it hard, enjoy the feel of it flexing tensely under her touch. The fingers of his cuffed hand reached, found her other hand wrapped in the loose end of the tether, and he caressed her palm, seeking a grip.\n She drew out of his reach, wrapped the slack of the ropes around her fingers and tugged him further into the stall. He turned his head, meeting her gaze as she moved him, her palm sliding around to press against his stomach just above his waistband to guide him backwards. There was no escaping the mental comparison of leading a stallion within proximity of a mare, his eyes dangerous and intent on hers.\n Steady, girl. He\u0027s big and strong, and he knows what he\u0027s doing, but you can handle him.\n You know what he needs, even before he does. That\u0027s what a good Mistress did. Break him down to the core, so he was open to her, both finding ultimate completion in a total connection of the mind with the body.\n Tyler\u0027s words, but her pounding heart had a different name for it, which went beyond words to pure feeling.\n For a Mistress like her, it wasn\u0027t about getting off. She knew true Doms were artists who used a variety of methods to break subs down to the bone and drive them to a level of fulfillment they never could have experienced with their emotional and physical shields in place. For such a Master or Mistress, the stimulation came from that successful breakdown of a sub, so that he was completely linked with the Dom\u0027s desires. At its heart, that was what she hungered for, getting the sub she wanted to willingly surrender all to her, more than he even knew he had to offer. She wanted to tame the stallion that could not be tamed.\n \"I didn\u0027t give you permission to meet my gaze,\" she said. \"Face forward and eyes down.\"\n Mackenzie held her eyes one more moment than was appropriate, then shifted his attention to the floor. His bare broad back faced her, the smooth taper to the firm waist just screaming for her touch.\n She threaded the loose ends of the tethers through a ring above her head on the stall wall and drew the ropes tight, drawing his shoulders back and up so that she crossed his arms as close to the elbows as she could, a just short-of-uncomfortable posture that got his attention. It bent his body slightly forward, which she could tell he didn\u0027t like, for it put him off balance. He was going to be a lot more off balance when she was done.\n It was an effective method of restraint, because with his arms crossed nearer to the elbows than the wrists and his arms pulled up at the uncomfortable angle to his shoulders, he could not move back. The lack of slack kept him from moving forward.\n \"I want you uncomfortable, but not in pain,\" she said, testing the ropes, drifting her hand across his back. \"You\u0027ll tell me if you begin to hurt. Answer me.\"\n \"Yes, Mistress,\" he said roughly.\n \"Good.\" She moved around to his front, stepped back five paces and then simply stood a moment, enjoying him. \"You\u0027ve got a beautiful chest,\" she noted. \"Those incredible shoulders, the cords of muscle at the neck. Long thighs, impressive cock.\" Standing in the shadow of his body with her spike heels, she was a bit taller than she wanted to be. She bent over, her back to him, to lift the hem of her short skirt and take down the back zipper of the first boot, well aware that he was seeing her thighs all the way past the top of the thigh high. The posture revealed the elongated almond shape of her pussy in the green satin thong, the base of her ass cheeks.\n The rings clanked as he tested how much slack he had, and she hid a smile when he came up just short, as she knew he would. She unzipped the other boot, stepped out of them and kicked them out of her way, turning before he could get the bright idea to try to use his legs to rub a knee up the seam of her thighs. She wouldn\u0027t put it past him to be so impudent.\n Taking up the brush with stiffer bristles again, she ran it down the center of his chest, tugging the bristles through the curly hair there, down the abdomen, tickling the waistband of his jeans, her fingers playing in the area between denim and hard muscle.\n She placed the brush at the juncture of his shoulder and neck area, and this time brought the brush down over the nipple. The area drew taut immediately, and she felt his muscles clench against the pain as the hard bristles scraped over the sensitive skin.\n She alternated as she had before, going down one side, then the other, letting her fingers trail behind so the harsh scratch was followed by the soft caress of her fingertips, soothing him.\n It also allowed her to note the increased rise and fall of his chest, the thunderous pounding of his heart beneath her palm, the instinctive moistening of his lips, the shift of his body to relieve the pressure between his thighs.\n \"Be still,\" she commanded. \"Keep your eyes down.\" His lids flickered. \"But I like looking at you, Mistress.\" She ran a hand along his jaw, the smoothly clipped line of his beard, wondering how it would feel against her most sensitive areas of skin. \"I\u0027m glad to hear it, but I\u0027ll decide when. Are there things you\u0027re not comfortable doing I should know about?\"\n \"With respect, same answer as before, Mistress. I\u0027ll do all you ask of me, or I\u0027m not worthy to be your slave.\" His gaze briefly flicked up to hers, then quickly back down before she could chastise him. \"You choosing me to serve you, bring you to the highest level of pleasure, those are my only desires.\" It was so close to what she wanted to find in a lover, she barely managed to control the shiver of reaction that went through her vitals at his words. She knew of subs who would let a Dom do anything to them. Most clubs revoked their memberships once they found them, because the wrong Dom would push them past physical and emotional endurance, and could cause them serious physical harm. But Mac didn\u0027t strike her as that type. He had limits in there somewhere, he had just somehow managed to keep Mistresses from running up against them. The strength of her concern surprised her, as did the wave of protectiveness that barbed her words.\n \"That\u0027s stupid, Mackenzie. If I have you gagged and decide to ram a railroad spike up your ass, it\u0027s going to be a little hard for you to change your mind.\"\n \"I trust you\u0027ll do what\u0027s best for me, Mistress. Whatever you feel is appropriate.\"\n A good kick in the ass for being that unsafe. However, she suspected now was not the time for a lecture. Maybe if they spent more time together.\n Whoa, hold on, girl. This might be just a one-night flirtation for him. She knew subs who played 100% in the dungeon, but once they walked out, they didn\u0027t look back.\n They had no plans to pick out curtains with their Mistresses. Ever.\n \"Well, I\u0027m giving you a safe word. Water. You ask for water, I ease off.\"\n \"I\u0027ll die of thirst first.\"\n This time he met her gaze square on, and she felt the impact of it to her toes. He didn\u0027t just look at her; he ravished her. She\u0027d always thought it was a cheesy word, but the way his attention moved over her, dragging her into him, making her weak, made her picture Victorian heroines swooning in a lover\u0027s eager arms. Ravished was exactly the right term for it.\n \"You\u0027ve been a sub for a lot of women, haven\u0027t you, Mackenzie? No, I don\u0027t want an answer to that.\" She placed a finger on his mouth, held it firm there for only a moment, so he\u0027d get the message, but she wouldn\u0027t be putting her sensitive knuckles within prolonged proximity of those clever lips. \"But I don\u0027t think you\u0027ve ever had a true Mistress. You\u0027re still setting the rules, holding up the shields. Let\u0027s start by removing some. The rest of your clothes first.\" That surprised him, she could tell. He hadn\u0027t expected her to move that quickly, and truth be told, she had not intended to do so.\n \"Your shoes,\" she said coolly. \"Toe them off. You don\u0027t expect me to remove your shoes.\"\n \"No, Mistress.\" He awkwardly managed it, using the leverage of the tethers binding him, grunting a little at the increased pain on straining tendons.\n \"And the socks.\"\n He stepped on the toes of his thin dress socks, worked them off his feet. More bare skin. She was eager for all of it, but she kept the pace slow, teasing, as she approached him. As she stepped directly in front of him, she saw the angle would give him an excellent view of her cleavage. There was an incentive to keep his eyes lowered, she thought with satisfaction.\n Violet forced her fingers not to tremble as she reached for the button of his jeans.\n She deliberately let her touch slide over the hard length of him, nearly groaned at the steel heat she felt. \"I hope you\u0027re not one of those who can\u0027t hold back,\" she observed.\n \"You\u0027re pretty hard now. I\u0027m not sure you\u0027ve got the stamina for what I have in mind.\" Mac brushed a smoldering glance over the top of her breasts. \"You\u0027re hard to resist, Mistress, but I think I can please you.\"\n The taunt was there. Oh, he had pride. She delighted in it. She firmed her lips.\n \"We\u0027ll see,\" she said indifferently.\n She slipped the button, took the zipper down. Slow. She was hyper-cognizant of his breath on her neck, the tight tension of his body, the muscles pulled back to restrain his movements. She reached in, slid her hand beneath the waist of his dark underwear, leaving the jeans open in front but otherwise unadjusted, and closed her hand around him.\n He made a noise, a catching of his breath, but she had closed her eyes, inhaling him through all her senses. The powerful organ in her hand, pulsing against her palm, the wetness at the tip like a tiny kiss against her wrist. She was aware, even if he was not, that he had moved impossibly further against his restraints, straining toward her, toward her grip.\n She had small fingers, and she used them to good advantage now, sliding them down his length, finding the base where the curve of his testicles began, her fingers tangling in the soft hair on them. Then back up, caressing him, stroking him, easing her grip, tightening it.\n \"Violet...\" he said. Her head lifted, tilting at an angle because they were so close now, her thigh pressed against his, her lips no more than a finger span apart from his just above her. He had cut himself shaving this morning, she noticed, just a tiny nick on his neck.\n \"Don\u0027t move,\" she said. \"Not an inch.\" She rose up on her toes, placed her lips there, sucking on the closed cut gently, kissing him. Her grip on his cock tightened as she did, and his body quivered against hers, holding back, when she could tell all he wanted to do was disobey.\n Violet took her lips away.\n \"Don\u0027t hurt yourself like that again. I\u0027ll have to shave you,\" she warned. \"I expect you to take care of what\u0027s mine.\" She dug her nails into him, just a bit, and he flinched, but did not twitch under her tight grasp.\n \"What do you want, Mac?\"\n \"Whatever my Mistress wants.\"\n She tightened her grip. \"Don\u0027t patronize me. Tell me what you want.\"\n \"To make you come.\"\n \"Try again.\" She worked her hands beneath his waistband, took the jeans and underwear down to his thighs, freeing his cock and giving her an unimpeded view of his bare, muscular ass. She ran her nails over it, scoring him lightly, then reclaimed his cock, starting a slow rub, up and down his thick, long length.\n \"Mackenzie,\" she measured her tones, matching them to her strokes. \"I\u0027m going to make you come in my hand, and it\u0027s going to be very messy and displeasing to me, if you don\u0027t stop the bullshit and tell the truth.\" He shifted. She might not have caught it, except her knee was pressed against his leg and she felt it, that subtle attempt to change the effectiveness of her strokes with the angle of his body so he would sustain himself, resist her pressure.\n She made the same minor adjustment, followed him, and brought her thumb into action, stroking the tight vein beneath the base of the head.\n \"Violet, stop.\"\n \"I\u0027m sorry, Mac. That\u0027s not the safe word. You\u0027d die of thirst, remember? But you don\u0027t have to die of thirst. Just ask for water.\" In a movement so quick she couldn\u0027t follow it, he dipped his head and fastened his teeth on her throat. \"Why waste it, sugar?\" he muttered around his grip. \"It could be jetting into you, or I could be attending to your pleasure, eating out your pretty cunt.\" His jaw had the strength of a pit bull in truth, and Violet felt a moment of panic when she could not immediately jerk back.\n Making her decision, she hoped it wouldn\u0027t bring security into the room. She swung her head and smacked it against his cheekbone. He let her go with an oath and she tried to focus, because she had hit one of the harder bits of his head with the softer ones of hers. Barring that, she\u0027d been forced to put some power behind it. She was proud that her hand did not pause in its motion, working him even more intently.\n Despite the pain she knew she\u0027d caused him, his body was responding to her demand, focusing on the pleasurable goal happening below his waist.\n He tried to twist away, but with his shoulders raked up, he was limited in how fast he could move, and she stayed easily with him, sensing victory in her hand.\n \"You\u0027ll come for me now, Mackenzie. Spurt yourself into my fingers like a teenager unable to control his hard-on. I can feel it coming. Let go.\" She pulled a kerchief from the top of her stocking, just under the lace top, and hooded him with it as his body began to buck. His seed thickened the vein beneath her fingertips. As a warm trickle of blood slid down her neck where he had bitten her, her own reaction wet her thighs.\n His body lunged forward, the ring bolts clanging harshly against the pull of the tethers. He snarled, his semen shooting forth into the doubled square of cloth. Some of it jetted past the cover, dampening her wrist, and the potent, erotic smell spurred her desire. Violet couldn\u0027t take her attention from his face, watching the battle of a powerful man against his own body, against the emotional vulnerability she had pressed on and forced from him through the uncontrolled physical release.\n The orgasm was fast and intense, and left him shuddering, the wide chest expanding to take in air. \"Whoa, there,\" Violet leaned her body into his to give him some support. He was double her weight in muscle, but the leaning worked, and gave her the excuse to hold him in her arms. She liked the way he felt there, and caressed the line of his back just above his waist, the firm, damp skin. She gave herself a moment, because she liked it so much, then she made herself do what she had to do.\n She released him abruptly. She folded the kerchief over and dropped it on the chair seat. Moving behind him, she loosened one wrist cuff enough that he could free himself.\n \"We\u0027re done,\" she said.\n \"What?\" he straightened.\n \"You can get yourself loose from there.\"\n \"But, Violet, what - \"\n She stopped him with a level look. \"You look me up when you want a Mistress, Mac. Instead of someone to jerk you off, or someone you can jerk around. I\u0027m not interested.\"\n \"What the hell game are you playing?\" he said, his brows drawing over his eyes in a way she was certain would intimidate the hell out of most people. She merely lifted a brow.\n \"I\u0027d ask the same of you, if I cared. You\u0027re good, Mackenzie. You\u0027re very, very good. You\u0027d make almost any Mistress within these walls think you\u0027re playing the game the way it should be played. A little rebelliousness mixed with the charm, the subservience. If I\u0027d wanted a trained pony, I\u0027d have gone to the circus.\"\n \"I don\u0027t know what you\u0027re talking about.\"\n \"Of course you don\u0027t.\" She turned away, picked up her boots and the kerchief. One step to the door. Two steps. Three. Brisk, no dragging, her intention obvious.\n \"Wait.\" She stopped at the door, but did not turn. She just waited.\n \"Don\u0027t leave. Tell me what I\u0027m doing wrong.\"\n She closed her eyes to compose herself, to conceal the quick surge of triumph and lust that the rough, angry confusion in his voice roused in her. There was more to him than met the eye, as she had suspected.\n Rotating on her heel, she faced him, sweeping his delectable body with an expression that did not reveal a trace of how she felt looking at him standing there, the jeans and underwear shoved down to his thighs, his chest bare, the wrists still held in restraints. \"That\u0027s part of what you\u0027re doing wrong. You\u0027re so worried about right and wrong. You\u0027re trying to control the situation, Mackenzie. Who controls this situation?\"\n \"You.\"\n She laughed. \"You\u0027re saying what I want to hear, not what you believe. You, what?\"\n \"You, Mistress.\"\n She took a step forward.\n \"Let me tell you what I expect, Mackenzie. I\u0027m not a dabbler. I\u0027m not a casual one-night trawler. I\u0027m looking for a solid bond, a total commitment. I don\u0027t expect to find it in every man I bring to these rooms. In fact, I don\u0027t expect to find it in most of them, but I choose men interested in finding out. Once I find it, I don\u0027t expect to take it outside this club right away, but it\u0027s what I intend when I do. I want to be some lucky man\u0027s Mistress, and you\u0027re just wasting my time if you\u0027re going to hide.\" She stepped back up to him, until that large body was just over her again, the fury and desire in his eyes cloaking her roused body in heat. \"I want to flay off every inch of your shields, your emotional skin, so I see and know everything you are, every part you hide from the rest of the world. I\u0027m fully capable of it.\"\n \"I don\u0027t know...if I can let you. Get that close.\" A soft sigh broke free, and now she did soften, cupping her hand under his jaw with gentle fingers. \"Bingo. That\u0027s who I\u0027m looking for. The man who tells me what\u0027s happening in his head, what I\u0027m doing to him. Who trusts me, or is at least willing to try. The man who can completely let go to pure sensation and feeling. That\u0027s it, Mackenzie. That\u0027s what I want. You want to run from that, you can. Just don\u0027t waste my time with your act if you\u0027re just here for the turn-on.\"\n \"I\u0027ve got to think about it.\"\n \"So think.\" She turned away from him, though moving back toward the door felt like moving through deep sand, all the muscles of her body screaming in protest. \"I\u0027ll come back here tomorrow between nine and eleven. If you want me, you\u0027ll be in this room, stripped. Nothing on. You put on one of the cock harnesses, tether yourself to that ring in the floor, the minimum amount of slack necessary between it and your cock, your knees spread as wide as you can get them, your hands laced on the back of your head. You stay straight upright in that position until I decide to come down here.\" She looked over her shoulder, cocked a brow at him, stifled a groan of need as she saw his cock hardening again at her words. \"Can you hold a position that long, Mackenzie? How badly do you want to have a Mistress worth having, rather than a playmate?\" \n","sourceLink":"https://allnovel.net/natural-law-nature-of-desire-2/page-4.html","bookId":1907,"book":{"id":1907,"title":"Natural Law (Nature of Desire #2)","description":"Storyline: \n Natural Law (Nature of Desire #2) \n Mackenzie \"Mac\" Nighthorse is a highly respected homicide detective and a career cop. There isn\u0027t a dangerous situation that can back him down. \n However, the personal becomes uncomfortably entangled in the professional when he goes undercover in a high class BDSM club as a male submissive in order to find a Dominatrix who is winning the trust and then murdering her chosen partners. \n When his path crosses Violet Siemanski\u0027s, he realizes he\u0027s found a Mistress willing to be his ally in finding the murderess. But Violet is also going to shatter Mac\u0027s shields and make him question who he is and what he wants, a challenge more disturbing than any case he\u0027s ever worked.\n \n","cover":"https://allnovel.net/images/natural-law-nature-of-desire-2.jpg","author":"Bella Forrest","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/natural-law-nature-of-desire-2.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:21:10 PM"}}
