{"id":20754,"no":53,"title":"chapter 6","content":"Next morning Dick came early into Nicole’s room. “I waited till I heard you up. Needless to say I feel badly about the evening — but how about no postmortems?” \\n\\n \\n\\n “I’m agreed,” she answered coolly, carrying her face to the mirror. \\n\\n \\n\\n “Tommy drove us home? Or did I dream it?” \\n\\n \\n\\n “You know he did.” \\n\\n \\n\\n “Seems probable,” he admitted, “since I just heard him coughing. I think I’ll call on him.” \\n\\n \\n\\n She was glad when he left her, for almost the first time in her life — his awful faculty of being right seemed to have deserted him at last. \\n\\n \\n\\n Tommy was stirring in his bed, waking for café au lait. \\n\\n \\n\\n “Feel all right?” Dick asked. \\n\\n \\n\\n When Tommy complained of a sore throat he seized at a professional attitude. \\n\\n \\n\\n “Better have a gargle or something.” \\n\\n \\n\\n “You have one?” \\n\\n \\n\\n “Oddly enough I haven’t — probably Nicole has.” \\n\\n \\n\\n “Don’t disturb her.” \\n\\n \\n\\n “She’s up.” \\n\\n \\n\\n “How is she?” \\n\\n \\n\\n Dick turned around slowly. “Did you expect her to be dead because I was tight?” His tone was pleasant. “Nicole is now made of — of Georgia pine, which is the hardest wood known, except lignum vit? from New Zealand —” \\n\\n \\n\\n Nicole, going downstairs, heard the end of the conversation. She knew, as she had always known, that Tommy loved her; she knew he had come to dislike Dick, and that Dick had realized it before he did, and would react in some positive way to the man’s lonely passion. This thought was succeeded by a moment of sheerly feminine satisfaction. She leaned over her children’s breakfast table and told off instructions to the governess, while upstairs two men were concerned about her. \\n\\n \\n\\n Later in the garden she was happy; she did not want anything to happen, but only for the situation to remain in suspension as the two men tossed her from one mind to another; she had not existed for a long time, even as a ball. \\n\\n \\n\\n “Nice, Rabbits, isn’t it — Or is it? Hey, Rabbit — hey you! Is it nice? — hey? Or does it sound very peculiar to you?” \\n\\n \\n\\n The rabbit, after an experience of practically nothing else and cabbage leaves, agreed after a few tentative shiftings of the nose. \\n\\n \\n\\n Nicole went on through her garden routine. She left the flowers she cut in designated spots to be brought to the house later by the gardener. Reaching the sea wall she fell into a communicative mood and no one to communicate with; so she stopped and deliberated. She was somewhat shocked at the idea of being interested in another man — but other women have lovers — why not me? In the fine spring morning the inhibitions of the male world disappeared and she reasoned as gaily as a flower, while the wind blew her hair until her head moved with it. Other women have had lovers — the same forces that last night had made her yield to Dick up to the point of death, now kept her head nodding to the wind, content and happy with the logic of, Why shouldn’t I? \\n\\n \\n\\n She sat upon the low wall and looked down upon the sea. But from another sea, the wide swell of fantasy, she had fished out something tangible to lay beside the rest of her loot. If she need not, in her spirit, be forever one with Dick as he had appeared last night, she must be something in addition, not just an image on his mind, condemned to endless parades around the circumference of a medal. \\n\\n \\n\\n Nicole had chosen this part of the wall on which to sit, because the cliff shaded to a slanting meadow with a cultivated vegetable garden. Through a cluster of boughs she saw two men carrying rakes and spades and talking in a counterpoint of Ni?oise and Proven?al. Attracted by their words and gestures she caught the sense: \\n\\n \\n\\n “I laid her down here.” \\n\\n \\n\\n “I took her behind the vines there.” \\n\\n \\n\\n “She doesn’t care — neither does he. It was that sacred dog. Well, I laid her down here —” \\n\\n \\n\\n “You got the rake?” \\n\\n \\n\\n “You got it yourself, you clown.” \\n\\n \\n\\n “Well, I don’t care where you laid her down. Until that night I never even felt a woman’s breast against my chest since I married — twelve years ago. And now you tell me —” \\n\\n \\n\\n “But listen about the dog —” \\n\\n \\n\\n Nicole watched them through the boughs; it seemed all right what they were saying — one thing was good for one person, another for another. Yet it was a man’s world she had overheard; going back to the house she became doubtful again. \\n\\n \\n\\n Dick and Tommy were on the terrace. She walked through them and into the house, brought out a sketch pad and began a head of Tommy. \\n\\n \\n\\n “Hands never idle — distaff flying,” Dick said lightly. How could he talk so trivially with the blood still drained down from his cheeks so that the auburn lather of beard showed red as his eyes? She turned to Tommy saying: \\n\\n \\n\\n “I can always do something. I used to have a nice active little Polynesian ape and juggle him around for hours till people began to make the most dismal rough jokes —” \\n\\n \\n\\n She kept her eyes resolutely away from Dick. Presently he excused himself and went inside — she saw him pour himself two glasses of water, and she hardened further. \\n\\n \\n\\n “Nicole —” Tommy began but interrupted himself to clear the harshness from his throat. \\n\\n \\n\\n “I’m going to get you some special camphor rub,” she suggested. “It’s American — Dick believes in it. I’ll be just a minute.” \\n\\n \\n\\n “I must go really.” \\n\\n \\n\\n Dick came out and sat down. “Believes in what?” When she returned with the jar neither of the men had moved, though she gathered they had had some sort of excited conversation about nothing. \\n\\n \\n\\n The chauffeur was at the door, with a bag containing Tommy’s clothes of the night before. The sight of Tommy in clothes borrowed from Dick moved her sadly, falsely, as though Tommy were not able to afford such clothes. \\n\\n \\n\\n “When you get to the hotel rub this into your throat and chest and then inhale it,” she said. \\n\\n \\n\\n “Say, there,” Dick murmured as Tommy went down the steps, “don’t give Tommy the whole jar — it has to be ordered from Paris — it’s out of stock down here.” \\n\\n \\n\\n Tommy came back within hearing and the three of them stood in the sunshine, Tommy squarely before the car so that it seemed by leaning forward he would tip it upon his back. \\n\\n \\n\\n Nicole stepped down to the path. \\n\\n \\n\\n “Now catch it,” she advised him. “It’s extremely rare.” \\n\\n \\n\\n She heard Dick grow silent at her side; she took a step off from him and waved as the car drove off with Tommy and the special camphor rub. Then she turned to take her own medicine. \\n\\n \\n\\n “There was no necessity for that gesture,” Dick said. “There are four of us here — and for years whenever there’s a cough —” \\n\\n \\n\\n They looked at each other. \\n\\n \\n\\n “We can always get another jar —” then she lost her nerve and presently followed him upstairs where he lay down on his own bed and said nothing. \\n\\n \\n\\n “Do you want lunch to be brought up to you?” she asked. \\n\\n \\n\\n He nodded and continued to lie quiescent, staring at the ceiling. Doubtfully she went to give the order. Upstairs again she looked into his room — the blue eyes, like searchlights, played on a dark sky. She stood a minute in the doorway, aware of the sin she had committed against him, half afraid to come in. . . . She put out her hand as if to rub his head, but he turned away like a suspicious animal. Nicole could stand the situation no longer; in a kitchen-maid’s panic she ran downstairs, afraid of what the stricken man above would feed on while she must still continue her dry suckling at his lean chest. \\n\\n \\n\\n In a week Nicole forgot her flash about Tommy — she had not much memory for people and forgot them easily. But in the first hot blast of June she heard he was in Nice. He wrote a little note to them both — and she opened it under the parasol, together with other mail they had brought from the house. After reading it she tossed it over to Dick, and in exchange he threw a telegram into the lap of her beach pajamas: \\n\\n \\n\\n Dears will be at Gausses to-morrow unfortunately without mother am counting on seeing you. \\n\\n \\n\\n “I’ll be glad to see her,” said Nicole, grimly. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1366/41055.html","bookId":1449,"book":{"id":1449,"title":"Tender is the Night","description":"简介： In Tender is the Night, Fitzgerald distilled much of his tempestuous life with his wife Zelda, and the knowledge of the wrecked, fabulous Fitzgeralds adds poignancy and regret to this tender, supple and poetic portrait. To the just-fashionable French...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1366","creation":"Aug 1, 2019 12:25:09 AM","modification":"Aug 1, 2019 12:25:09 AM"}}
