{"id":70114,"no":14,"title":"Page 14","content":"Steve was afraid he wasn’t the only one who’d noticed Meg’s attire. Both officers looked approvingly in her direction. Steve was about to ask the younger of the two to wipe the grin off his face, but he held his breath and counted backward from ten.\\n\\n He got to five. “Lindsey, go get your mother a coat.”\\n\\n “I don’t have to take orders from you,” the girl snapped.\\n\\n Meg blinked and seemed to realize that despite the robe, such as it was, her nightwear left little to the imagination.\\n\\n In an apparent effort to deflect a shouting match, one officer asked Lindsey a few questions, while the other engaged Steve and Meg in conversation.\\n\\n “You know this man?” he asked Meg.\\n\\n “Yes, of course. His name’s Steve Conlan.”\\n\\n “Steve Conlan.” The officer made note of it on a small pad. “That’s what he said earlier.”\\n\\n Steve pulled out his wallet and flipped it open, silently thrusting it out. The cop glanced at it and nodded.\\n\\n “He didn’t steal my purse, either,” Meg went on.\\n\\n Steve cast the other man an I-told-you-so look, but said nothing.\\n\\n “You went out with Steve behind my back?” Lindsey cried, peering around the second policeman. Her eyes narrowed. “I can’t believe you’d do something like that—after our talk and everything.”\\n\\n Meg cast her a guilty look. “We’ll discuss this later.”\\n\\n But Lindsey wasn’t going to be so easily dissuaded. “After our talk, I really, really thought I was getting through to you. Now I see how wrong I was.”\\n\\n “If you’d give me a chance to explain …” Steve began, wanting to avoid an argument between Meg and her daughter.\\n\\n Static from the police officer’s walkie-talkie was followed by a muffled voice. The two men were obviously being dispatched to another location.\\n\\n “Everything okay here?” the policeman asked Meg.\\n\\n “It’s fine.”\\n\\n “Young lady?”\\n\\n Lindsey folded her arms and pointed her nose toward the night sky. “All I can say is that my mother’s a serious disappointment to me.”\\n\\n “I’m afraid I can’t help you there.”\\n\\n “I didn’t think you could,” she said, shaking her head. “I thought better of her than this—sneaking out at night to see a man of … of low moral fiber.”\\n\\n “Lindsey!”\\n\\n “Why don’t we all go inside and discuss this,” Steve suggested. He felt more than a little ridiculous standing in Meg’s yard, and he was eager to clear the air between Lindsey and him.\\n\\n “I have nothing to say to either of you,” Lindsey said. She marched into the house, with Brenda scurrying behind.\\n\\n Steve watched them stomp off in single file and released a deep breath. He was about to apologize for having made such a mess of things, when Meg whirled around to face him.\\n\\n “I can’t believe you!”\\n\\n Steve ran his fingers through his hair. Meg didn’t seem to grasp that this ordeal hadn’t exactly been a pleasure for him, either.\\n\\n “I apologize, Meg.” He did feel bad about all the trouble he’d caused, but he’d only been trying to help. When he’d found her purse, returning it had seemed the best thing to do. He didn’t want her wondering where it was, and he’d honestly thought he could do it without ending up in jail.\\n\\n “How dare you tell my daughter to get me a coat.”\\n\\n Steve’s head jerked up. His throat tightened with the strength of his anger. “I nearly got myself arrested—thanks to your daughter, I might add—and you’re upset because I objected to you traipsing around in front of the neighborhood half-naked?”\\n\\n Meg opened her mouth and then closed it.\\n\\n “Okay,” he amended, “you are wearing a robe, although it’s not much of one. Neither of those cops could take their eyes off you. I supposed you enjoyed the attention.”\\n\\n “Don’t be ridiculous! I came downstairs as fast as I could, in order to help you.”\\n\\n “You call parading in front of those men like that helping me? All I needed was for you to identify me so I could leave. That’s all.” His words grew louder. He was close to losing his cool and he knew it.\\n\\n “I think you’d better go,” Meg said, pointing in the direction of the street. Steve noticed with satisfaction that her finger shook.\\n\\n “I’m out of here,” he told her, “and not a minute too soon. You might have appreciated the embarrassment I endured trying to do you a favor, but I can see you don’t. Which is fine by me.”\\n\\n “Like you didn’t embarrass me?” she shouted.\\n\\n “You weren’t the one who had a gun pointed at you and a kid claiming you were a menace to society.”\\n\\n “Lindsey was only repeating what you’d told her.” Meg pushed the hair away from her face, using both hands. “This isn’t working.”\\n\\n “Wrong,” he said sharply. “It’s working all too well. You make me crazy, and I don’t like it.”\\n\\n “But … “\\n\\n “If I’m going to get arrested, I want it to be for someone who’s willing to acknowledge the trouble I’ve gone through for her.” Certain he was making no sense whatsoever, Steve stalked over to his car and drove away.\\n\\n Meg squared her shoulders and drew her flimsy robe more tightly around her as she opened the screen door and walked back inside. The exhaust from Steve’s car lingered in the yard, reminding her how angry he’d been when he left.\\n\\n She was angry, too. And confused.\\n\\n It didn’t help to find Lindsey and Brenda sitting in the darkened living room waiting for her.\\n\\n “You should both be in bed,” Meg told them.\\n\\n “We want to talk to you first,” Lindsey announced, her hands folded on her knees.\\n\\n “Not tonight,” she said shortly. “I’m tired and upset.”\\n\\n “You!” Lindsey cried. “Brenda and I are exhausted, but that doesn’t matter. What does is that you broke your word.”\\n\\n “I didn’t promise not to see Steve again,” Meg told her. She’d been careful about that.\\n\\n Meg went back to the door and stood in front of the screen, half hoping Steve would return—not knowing what she’d say or do if he did.\\n\\n “You’ve been sneaking out of the house to see him, haven’t you?”\\n\\n Meg lifted one shoulder in a shrug.\\n\\n “You have!” Lindsey was outraged. “When?”\\n\\n Meg lifted the other shoulder.\\n\\n “Can’t I trust you anymore?”\\n\\n “Lindsey, Steve’s not exactly what he said he was.”\\n\\n “I’ll just bet,” she muttered. “He’s got you fooled, hasn’t he? You’d believe anything he says because that’s what you want to believe. You’re so crazy about this guy you can’t even see what’s right in front of your face.”\\n\\n If she’d been a little less upset herself, Meg might’ve been willing to set the record straight then and there. “We want to talk to you,” Meg told her daughter. “Steve and I, together, and explain everything.”\\n\\n “Never!”\\n\\n “Mrs. Remington, don’t let him fool you,” Brenda threw in dramatically.\\n\\n “Let’s not worry about this now,” she said as defeat settled over her. “It’s late and I have to be at the store early in the morning.”\\n\\n Lindsey stood, her hands clenched at her sides. “I want you to promise me you won’t see him again.”\\n\\n “Lindsey, please.”\\n\\n “If you don’t, Mom, I’ll never be able to trust you again.”\\n\\n “It’s time we had a little talk,” Nancy said, bringing a steaming cup of coffee to the breakfast table. After the night he’d had, the last thing Steve wanted was a tête-à-tête with his troublesome younger sister.\\n\\n “No, thanks.”\\n\\n Nancy left the table, taking the coffee with her.\\n\\n “Hey, I want the coffee.”\\n\\n “Oh.” She brought it back and slipped into the chair across from him. “Something’s bothering you.”\\n\\n “Nothing gets past you, does it?” He almost scalded his mouth in his eagerness to get some caffeine into his system.\\n\\n “Can you tell me what’s wrong?” She stared at him with big brown eyes that suggested she could solve all his problems, if only he’d let her.\\n\\n “No.”\\n\\n “It has to do with that Meg, doesn’t it?”\\n\\n Steve mumbled a noncommittal reply. He didn’t care to discuss Meg Remington just then. What he’d told Meg was the simple truth—she made him crazy. No woman had ever affected him as powerfully as she did. After the way they’d parted, he doubted they’d see each other again, and damn it all, that wasn’t what he wanted.\\n\\n “She’s not the woman for you,” Nancy said, her eyes solemn.\\n\\n “Nancy,” he said in a low voice, “don’t say any more. Okay?”\\n\\n She closed her eyes, shaking her head. “You’re falling in love with her.”\\n\\n “No, I’m not,” he muttered. Cradling the mug in both hands, he tried the coffee again, sipping from the edge to avoid burning his mouth.\\n\\n “Thou protest too much,” she told him, with a sanctimonious sigh. “I’m afraid you’ve made it necessary for me to take matters into my own hands. Someone’s got to look out for your best interests.”\\n\\n Steve lowered the mug and glared at his sister. “What did you do this time?”\\n\\n “Nothing yet. There’s this woman, a widow I met on campus, and I’d like you to get to know her. She’s nothing like Meg, but as far as I’m concerned … “\\n\\n “No!” He wasn’t listening to another word. The last time his sister had roped him into her schemes he’d met a crazy woman with an even crazier daughter. No more.\\n\\n “But Steve … “\\n\\n “You heard me.” The chair made a scraping sound against the tile floor as he stood. “I won’t be home for dinner.”\\n\\n Nancy stood, too. “When will you be back?”\\n\\n Steve regarded her suspiciously. “I don’t know. Why?”\\n\\n “Because the least you can do is meet Sandy.”\\n\\n Steve gritted his teeth. “You invited her to the house?”\\n\\n “Don’t worry—I didn’t mention you. I wanted the two of you to meet casually. She’s nervous about dating again, and I was afraid if I told her about my big, bad brother she’d run in the opposite direction.”\\n\\n “That’s what I’m going to do. If you want to work on anyone’s love life, you might try your own.”\\n\\n “All right, all right,” Nancy said, sounding defeated. “Just stay away from Meg, okay? The woman’s bad news.”\\n\\n Steve’s laugh was humorless. “You’re telling me?”\\n\\n A week passed. Steve refused to dwell on his confrontation with Meg. He didn’t call her and she didn’t phone him, either.\\n\\n He hated to end it all, but he didn’t see any other option.\\n\\n He missed her, though. He tried to tell himself otherwise. Tried to convince himself a man has his pride. Tried not to think about her. \\n\\n","sourceLink":"https://allnovel.net/a-mother-s-wish/page-14.html","bookId":1963,"book":{"id":1963,"title":"A Mother\u0027s Wish","description":"Storyline: Two stories from Debbie Macomber. In \"Wanted, Perfect Partner\" Meg\u0027s teenage daughter, Lindsey, had the nerve to place a personal ad on her behalf - \u0027Wanted: Perfect Partner. I\u0027m dating-shy, divorced and seeking a man with marriage in mind.\u0027 Worse, Steve Conlan, who answered the ad, was perfect, according to Lindsey. Did a teenage matchmaker get it right? \\n In the second story, \"Father\u0027s Day\", Robin Masterton\u0027s young son, Jeff, thinks he needs a dog more than anything in the world. And there just happens to be one next door! But the friendly black Lab belongs to Cole Camden, the unfriendliest man in the neighbourhood. Still, Jeff persists - and ropes his mum in as the persuader. Perhaps there\u0027s a chance he\u0027ll have a dog, and a dad in time for Father\u0027s Day...\\n","cover":"https://allnovel.net/images/a-mother-s-wish.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-mother-s-wish.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:15:09 AM"}}
