{"id":70115,"no":15,"title":"Page 15","content":"And failed.\n Early one afternoon, Nancy came by the shop with a friend. They were on their way to a movie, or so Nancy claimed.\n Nancy smiled a little-sister smile and cheerfully asked Steve if he’d give Sandy an estimate on repairing her fender.\n Sandy was petite. Cute. A little fragile.\n It didn’t take Steve long to figure out that this Sandy was the same one Nancy had wanted him to meet. The widow. The woman who’d save him from Meg’s clutches.\n “Pleased to meet you,” Steve said, wiping his greasy hands on the pink cloth he had tucked in his hip pocket.\n Nancy smiled innocently, looking pleased with herself.\n “I’ll have a written estimate for you by the time you two get back here.”\n “You don’t have to work late again, do you?” Nancy asked, not even attempting to be coy.\n Steve could already see what was coming. His conniving sister was about to wrangle a dinner invitation out of him. One that meant he’d be stuck entertaining Sandy.\n “I’m afraid I’m tied up this evening,” he said stiffly.\n “Oh, darn. I was hoping you could take Sandy and me to dinner.”\n “Sorry,” he said. “Now, if you’ll excuse me … “\n “It was a pleasure to meet you, Mr. Conlan.”\n “The pleasure was mine,” he said and turned away.\n Unfortunately, it didn’t end with Sandy. His sister had several other friends with dented fenders or cracked windshields. They all seemed to need estimates in the days that followed.\n “The next time a woman comes in and asks for me, I’m unavailable,” he told his crew. Steve made sure that on her next visit Nancy would know he didn’t have time for her matchmaking games. He told her as much when she stopped by—alone—a couple of days later.\n “I was only trying to help.”\n “Thanks, but no thanks.” He sat at his desk, making his way through the piles of paperwork stacked in front of him.\n Nancy expelled a sigh. “You aren’t seeing Meg again, are you?”\n His hand tightened around the pen. “That’s none of your business.”\n “Yes, it is! A woman like that could ruin your life.”\n In some ways she already had, but Nancy wouldn’t understand. Whenever he met another woman, Steve found himself comparing her to Meg. Invariably everyone else fell short. Far short. He was miserable without her.\n Nancy left, and Steve leaned back in his chair, studying the phone. All it would take was one call. He wouldn’t have to mention the incident with the police. He could even make a joke of it, maybe buy her a pair of flannel pajamas. The kind that went from her neck to her feet. They’d both laugh, say how sorry they were and put an end to this stalemate.\n Then he’d take her in his arms, hold her and kiss her. This was the part he dwelled on most. The reconciliation.\n “Steve.” Gary Wilcox stuck his head in the office door.\n Steve jerked his attention away from the phone.\n “There’s someone here to see you. A woman.”\n Impatience made Steve’s blood boil. “What did I say earlier? I gave specific instructions to tell any of my sister’s friends that I’m unavailable.”\n “But—”\n “Is that so hard to understand?”\n “Nope,” Gary said without emotion. “I don’t have a problem doing that, if it’s what you really want, but I kinda had the feeling this one’s special.”\n Knowing his foreman had cast an appreciative eye at the widow, Steve suspected it was Sandy who’d dropped by unannounced. “You talk to her.”\n “Me?”\n “Yeah, you.”\n “What am I supposed to say?”\n Steve rubbed a hand down his tired face. Did he have to do everything himself? “I don’t know, just say whatever seems appropriate. I promise you Nancy won’t be sending any more eligible women to the shop.”\n “Nancy didn’t send this one.”\n The pen slipped from Steve’s hands and rolled across the desk. “Who did?”\n “She didn’t say. All I got was her name. Meg Remington. I seem to recall hearing it mentioned a time or two—generally when you were upset.”\n Steve pushed back his chair and slowly stood. His heart reacted with a swift, furious pace. “Meg’s here?”\n “That’s what I’ve been trying to tell you for the last five minutes.”\n Steve sank back into the chair. “Send her in.”\n A mischievous grin danced across Gary’s mouth. “That’s what I thought you’d say.”\n Steve stood, then sat back down and busied himself with things on his desk. He wanted Meg to think he was busy. The minute she walked into the room, he’d set everything aside.\n A full five minutes passed and still she didn’t show up. Steve came out of his office and ran into Gary, who frowned and shook his head. “She’s gone.”\n “Gone?”\n Gary nodded. “The only thing I can figure out is that she must’ve overheard you say you weren’t available and left.”\n Steve muttered a four-letter word and hurried out. He wasn’t sure where he’d find her, but he wasn’t going to let her walk out of his life.\n She wasn’t at the bookstore and he didn’t see her car at home. He tried the grocery store, too, for good measure. Without success.\n It wasn’t until nearly seven that he drove to her house again. That he was willing to confront her daughter was a sign of how desperate he’d become.\n He stood on her front porch and rang the doorbell. Waiting for someone to answer, he buried his hands deep in his pockets. A preventive action, he realized, to keep from reaching for her the instant she appeared.\n “Just a minute,” he heard her call.\n Then the door opened and Meg was standing there.\n His gaze drifted over her. He’d planned to play it cool, casually mention that he was in the neighborhood and heard she’d stopped by the office. Their eyes met, held, and Steve forgot about hiding his feelings. She wore a pretty pale blue summer dress.\n “Hello, Steve.”\n “Hello.”\n The screen door stood between them.\n They continued to stare at each other.\n “Can I come in?” he asked. Pride be damned. It’d been cold comfort in the past two weeks. If he had to apologize, or grovel or beg forgiveness, then so be it. He wanted her back in his life.\n “Of course.” She unlatched the door and pushed it open.\n Steve stepped inside. He could barely breathe, never mind think. Pulling her into his arms didn’t seem appropriate, but that was all he wanted to do.\n “Where’s Lindsey?” he managed to ask.\n Meg’s voice was breathy and uneven. “She’s out for the evening.”\n He needed to touch her. Reaching up, he cupped her cheek in his rough palm. Slowly, Meg closed her eyes and leaned her head into his hand.\n “I had to come here,” he whispered.\n “I’m so sorry. About everything.”\n “Me, too.”\n Unable to wait a second longer, Steve folded her in his arms and brought her mouth to his. Gentleness was beyond him, his hunger as great as any he’d ever known.\n Meg grabbed his shirt as if she needed an anchor, something to secure her during the wild, sensual storm. He backed her against the door.\n Meg gasped, and Steve moved a few inches away. With his hands framing her cheeks, he studied her beautiful face. Her shoulders were heaving, and he realized his own breathing was just as labored.\n He rubbed the pad of his thumb across her moist, swollen lips. The action was unhurried—an apology for his roughness, his eagerness.\n She moaned softly and he kissed her again. Gently. With restraint. Her arms were around his neck, and Steve had never tasted a sweeter kiss.\n “I was going to call,” he told her, burying his face in the slope of her neck. “A thousand times I told myself I’d call. Every minute apart from you was torture.”\n “I wanted to call you, too.”\n “I’m glad ….”\n “You were right,” Meg confessed. “I should’ve been wearing something more … discreet.”\n “I was jealous, pure and simple.” He felt her smile against the side of his face and smiled, too.\n “I would’ve been jealous if the situation had been reversed.”\n “Don’t worry. I didn’t date a single one of the women Nancy arranged for me to meet.”\n Meg jerked back. “What women?”\n “Ah … it’s not important.”\n “It is to me.”\n He knew it would’ve been to him, as well, so he explained. “Nancy felt it was necessary to save me from a loose woman, so she introduced me to some of her friends.”\n “And you refused to go out with them.” Meg sounded pleased.\n “All I want to do is talk to Lindsey. Get things straightened out.”\n “Me, too. But we can’t right now.”\n “So I see.”\n “Hold me,” she said, nestling in his arms. “I don’t want you to leave for a long, long time.”\n Steve planted tiny kisses along the side of her neck, marking his way back to her lips. “When will Lindsey be back?” he whispered.\n “She’s spending the night at Brenda’s.”\n His hold tightened. “Meg,” he said, then kissed her with a hunger he couldn’t deny. “I want to make love to you. There’s a lot we have to discuss before we make that kind of commitment, but we have an opportunity to do that now, don’t we?”\n “Mmm.”\n He kissed her again, pacing himself. “Thank God you dropped in at the office. I don’t know how long it would’ve taken me to come to my senses otherwise.”\n “The office?” Meg repeated, breaking away from him. “I was never at your office.”\n Seven\n “It doesn’t matter if you were at my office or not,” Steve said, kissing Meg again. Slowly. Thoroughly.\n She couldn’t manage even a token resistance, although her mind whirled with questions.\n She was starved for the taste of him. Starved for his touch. Starved for him. The loneliness had been suffocating. Before she’d met Steve, her life had seemed just fine. Then within a matter of weeks she’d realized how empty everything was without him.\n “I’ve missed you so much,” she told him between deep kisses.\n “Me, too.”\n “You should’ve phoned,” she whispered.\n “You, too.”\n “I know.”\n “I’m crazy about you.”\n She was so tempted to throw caution to the wind and make love with this man who excited her so much. Who made her feel alive.\n If ever the moment was right it was now, with Lindsey gone until morning.\n But …\n The questions returned. There’d only been one man in her life, her ex-husband, Lindsey’s father, and by the time they’d divorced Meg had felt like a failure as a wife. Inadequate. Unresponsive.\n “Steve … Steve.” Her fingers were in Steve’s hair as his mouth roamed over her throat. “Stop, please.” \n","sourceLink":"https://allnovel.net/a-mother-s-wish/page-15.html","bookId":1963,"book":{"id":1963,"title":"A Mother\u0027s Wish","description":"Storyline: \n Two stories from Debbie Macomber. In \"Wanted, Perfect Partner\" Meg\u0027s teenage daughter, Lindsey, had the nerve to place a personal ad on her behalf - \u0027Wanted: Perfect Partner. I\u0027m dating-shy, divorced and seeking a man with marriage in mind.\u0027 Worse, Steve Conlan, who answered the ad, was perfect, according to Lindsey. Did a teenage matchmaker get it right? \n In the second story, \"Father\u0027s Day\", Robin Masterton\u0027s young son, Jeff, thinks he needs a dog more than anything in the world. And there just happens to be one next door! But the friendly black Lab belongs to Cole Camden, the unfriendliest man in the neighbourhood. Still, Jeff persists - and ropes his mum in as the persuader. Perhaps there\u0027s a chance he\u0027ll have a dog, and a dad in time for Father\u0027s Day...\n \n","cover":"https://allnovel.net/images/a-mother-s-wish.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-mother-s-wish.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:15:09 AM"}}
