{"id":70129,"no":29,"title":"Page 29","content":"“How about if you and I go rent the movie while your mother and Blackie make the popcorn?”\n Jeff’s blue eyes brightened immediately. “That’d be great, wouldn’t it, Mom?”\n “Sure,” she agreed, and was rewarded by Jeff’s smile.\n Jeff and Cole left a few minutes later. It was on the tip of her tongue to give Cole instructions on the type of movie appropriate for a ten-year-old boy, but she swallowed her concerns, willing to trust his judgment. Standing on the porch, she watched as they climbed inside Cole’s expensive sports car. She pressed her hand to her throat, grateful when Cole leaned over the front seat and snapped Jeff’s seat belt snugly in place. Suddenly Cole looked at her; she raised her hand in farewell, and he did the same. It was a simple gesture, yet Robin felt as if they’d communicated so much more.\n “Come on, Blackie,” Robin said, “let’s go start the popcorn.” The Lab trailed behind her as she returned to the kitchen. She placed a packet of popcorn in the microwave. It was while she was waiting for the kernels to start popping that the words slipped from her mouth.\n “Well, Lenny, what do you think?” Talking to her dead husband came without conscious thought. It certainly wasn’t that she expected him to answer. Whenever she spoke to him, the words came spontaneously from the deep well of love they’d once shared. She supposed she should feel foolish doing it, but so many times over the long years since his death she’d felt his presence. Robin assumed that the reason she talked to him came from her need to discuss things with the one other person who’d loved her son as much as she did. In the beginning she was sure she needed to visit a psychiatrist or arrange for grief counseling, but later she convinced herself that every widow went through this in one form or another.\n “He’s grown so much in the past year, hasn’t he?” she asked, and smiled. “Meeting Cole has been good for Jeff. He lost a child, you know, and I suppose having Jeff move in next door answers a need for him, too.”\n About ten minutes later, she’d transferred the popcorn to a bowl and set out drinks. Jeff and Cole came back with a movie that turned out to be an excellent compromise—a teen comedy that was surprisingly witty and entertaining.\n Jeff sprawled on the carpet munching popcorn with Blackie by his side. Cole sat on the sofa and Robin chose the rocking chair. She removed her shoes and tucked her feet beneath her. She was enjoying the movie; in fact, several times she found herself laughing out loud.\n Cole and Jeff laughed, too. The sounds were contrasting—one deep and masculine, the other young and pleasantly boyish—yet they harmonized, blending with perfect naturalness.\n Soon Robin found herself watching Jeff and Cole more than the movie. The two … no, the three of them had grown comfortable together. Robin didn’t try to read any significance into that. Doing so could prove emotionally dangerous, but the thought flew into her mind and refused to leave.\n The credits were rolling when Cole pointed to Jeff, whose head was resting on his arms, his eyes closed.\n “He’s asleep,” Cole said softly.\n Robin smiled and nodded. She got up to bring the empty popcorn bowl into the kitchen. Cole stood, too, taking their glasses to the sink, then returned to the family room to remove the DVD.\n “Do you want me to carry him upstairs for you?” he asked, glancing down at the slumbering Jeff.\n “No,” she whispered. “When he wakes up in the morning, he’ll think you treated him like a little kid. Egos are fragile at ten.”\n “I suppose you’re right.”\n The silence seemed to resound. Without Jeff, awake and chattering, as a buffer between them, Robin felt clumsy and self-conscious around Cole.\n “It was nice of you to stay,” she said, more to fill the silence than because she had anything important to communicate. “It meant a lot to Jeff.”\n Jeff had told her Cole had an active social life. Heather Lawrence had confirmed it by casually letting it drop that Cole was often away on weekends. Robin wasn’t entirely sure what to think about it all. But if there was a woman in his life, that was his business, not hers.\n “It meant a lot to me, too,” he said, returning the DVD to its case.\n The kitchen and family room, actually quite spacious, felt close and intimate with Cole standing only a few feet away.\n Robin’s fingers were shaking as she placed the bowls and soda glasses in the dishwasher. She tried to come up with some bright and witty comment, but her mind was blank.\n “I should be going.”\n Was that reluctance she heard in his voice? Somehow Robin doubted it; probably wishful thinking on her part. Half of her wanted to push him out the door and the other half didn’t want him to leave at all. But there really wasn’t any reason for him to stay. “I’ll walk you to the door.”\n “Blackie.” Cole called for his dog. “It’s time to go.”\n The Lab didn’t look pleased. He took his own sweet time lumbering to his feet and stretching before trotting to Cole’s side.\n Robin was about to open the door when she realized she hadn’t thanked Cole for getting the movie. She turned, and his dark eyes delved into hers. Whatever thoughts had been taking shape fled like leaves scattering in the wind. She tried to smile, however weakly, but it was difficult when he was looking at her so intently. His gaze slipped to her mouth, and in a nervous movement, she moistened her lips. Before she was fully aware of how it had happened, Cole’s fingers were in her hair and he was urging her mouth to meet his.\n His eyes held hers, as if he expected her to stop him, then they slowly closed and their lips touched. Robin’s eyes drifted shut, but that was the only response she made.\n He kissed her again, even more gently than the first time. Robin moaned softly, not in protest, but in wonder and surprise. It had been so long since a man had kissed her like this. So long that she’d forgotten the wealth of sensations a mere kiss could evoke. Her hands crept to his chest, and her fingers curled into the soft wool of his sweater. Hesitantly, timidly, her lips trembled beneath his. Cole sighed and took full possession of her mouth.\n Robin sighed, too. The tears that welled in her eyes were a shock. She was at a loss to explain them. They slipped down her face, and it wasn’t until then that she realized she was crying.\n Cole must have felt her tears at the same moment, because he abruptly broke off the kiss and raised his head. His eyes searched hers as his thumb brushed the moisture from her cheek.\n “Did I hurt you?” The question was whispered.\n She shook her head vehemently.\n “Then why …?”\n “I don’t know.” She couldn’t explain something she didn’t understand herself. Rubbing her eyes, she attempted to wipe away the evidence. She forced a smile. “I’m nothing if not novel,” she said with brittle cheerfulness. “I don’t imagine many women break into tears when you kiss them.”\n Cole looked as confused as Robin felt.\n “Don’t worry about it. I’m fine.” She wanted to reassure him, but was having too much trouble analyzing her own reactions.\n “Let’s sit down and talk about this.”\n “No,” she said quietly. Adamantly. That was the last thing she wanted. “I’m sorry, Cole. I really am. This has never happened before and I don’t understand it either.”\n “But … “\n “The best thing we can do is chalk it up to a long workweek.”\n “It’s not that simple.”\n “Probably, but I’d prefer to just forget it. Please?”\n “Are you all right?”\n “Emotionally or physically?” She tried to joke, but didn’t succeed.\n “Both.”\n He was so serious, so concerned, that it was all Robin could do not to dissolve into fresh tears. She’d made a world-class fool of herself with this man, not once but twice.\n This man, who had suffered such a tremendous loss himself, was so gentle with her, and instead of helping, that only made matters worse. “I’m sorry, really I am,” she said raggedly, “but perhaps you should go home now.”\n Four\n “You know what I’m in the mood for?” Angela Lansky said as she sat on the edge of Robin’s desk early Monday afternoon.\n “I certainly hope you’re going to say food,” Robin teased. They had shared the same lunch hour and were celebrating a cost-of-living raise by eating out.\n “A shrimp salad,” Angela elaborated. “Heaped six inches high with big fresh shrimp.”\n “I was thinking Chinese food myself,” Robin said, “but, now that you mention it, shrimp salad sounds good.” She opened her bottom drawer and took out her purse.\n Angela was short and enviably thin with thick brown hair that fell in natural waves over her shoulders. She used clips to hold the abundant curls away from her face and looked closer to twenty than the thirty-five Robin knew her to be.\n “I know just the place,” Angela was saying. “The Blue Crab. It’s on the wharf and worth the trouble of getting there.”\n “I’m game,” Robin said.\n They stopped at the bank, then headed for the restaurant. They decided to catch the Market Street cable car to Fisherman’s Wharf and joined the quickly growing line.\n “So how’s the kid doing?” Angela asked. She and her salesman husband didn’t plan to have children themselves, but Angela enjoyed hearing about Jeff.\n “He signed up for baseball through the park program and starts practice this week. I think it’ll be good for him. He was lonely this weekend now that Blackie’s back with Cole.”\n “But isn’t Blackie over at your place as much as before?” Angela asked.\n Robin shook her head. “Cole left early Saturday morning and took the dog with him. Jeff moped around for most of the weekend.”\n “Where’d your handsome neighbor go?”\n “How am I supposed to know?” Robin asked with a soft laugh, hiding her disappointment at his disappearance. “Cole doesn’t clear his schedule with me.”\n The way he’d left—without a word of farewell or explanation—still hurt. It was the kind of hurt that came from realizing what a complete fool she’d made of herself with this worldly, sophisticated man. He’d kissed her and she’d started crying. Good grief, he was probably doing backflips in order to avoid seeing her again.\n “Do you think Cole was with a woman?”\n “That’s none of my business!”\n “But I thought your neighbor said Cole spent his weekends with a woman.”\n Robin didn’t remember mentioning that to Angela, but she obviously had, along with practically everything else. Robin had tried to convince herself that confiding in Angela about Cole was a clever way of thwarting her friend’s matchmaking efforts. Unfortunately, the whole thing had backfired in her face. In the end, the last person she wanted to talk about was Cole, but of course Angela persisted in questioning her.\n “Well?” Angela demanded. “Did he spend his weekend with a woman or not?” \n","sourceLink":"https://allnovel.net/a-mother-s-wish/page-29.html","bookId":1963,"book":{"id":1963,"title":"A Mother\u0027s Wish","description":"Storyline: \n Two stories from Debbie Macomber. In \"Wanted, Perfect Partner\" Meg\u0027s teenage daughter, Lindsey, had the nerve to place a personal ad on her behalf - \u0027Wanted: Perfect Partner. I\u0027m dating-shy, divorced and seeking a man with marriage in mind.\u0027 Worse, Steve Conlan, who answered the ad, was perfect, according to Lindsey. Did a teenage matchmaker get it right? \n In the second story, \"Father\u0027s Day\", Robin Masterton\u0027s young son, Jeff, thinks he needs a dog more than anything in the world. And there just happens to be one next door! But the friendly black Lab belongs to Cole Camden, the unfriendliest man in the neighbourhood. Still, Jeff persists - and ropes his mum in as the persuader. Perhaps there\u0027s a chance he\u0027ll have a dog, and a dad in time for Father\u0027s Day...\n \n","cover":"https://allnovel.net/images/a-mother-s-wish.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-mother-s-wish.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:15:09 AM"}}
