{"id":70104,"no":4,"title":"Page 4","content":"Meg groaned. The time frame of their deception wasn’t what interested her. She was stalling, looking for a way out of this. She could leave a message for Steve at the restaurant, explaining that she couldn’t make it, but that seemed like such a cowardly thing to do. Unfortunately no escape plan presented itself. Brenda was right; it wasn’t Steve’s fault that he’d been duped by a pair of teenagers. It wasn’t her fault, either, but then Lindsey was her daughter. “He’s very nice-looking,” Brenda said. She reached behind her and pulled out a picture from one of the envelopes scattered across Lindsey’s bed. “Here, see what I mean?” Meg swore she heard the girl sigh. “He’s got blue eyes and check out his smile.” Meg took the photo from Brenda and studied it. Her daughter’s friend was right. Steve Conlan was pleasant-looking. His hair was a little long, but that didn’t bother her. He wore a cowboy hat and boots and had his thumbs tucked into his hip pockets as he stared into the camera. “He’s tall, dark and lonesome,” Lindsey said wistfully. “Has he ever been married?” Meg asked, curiosity getting the better of her. “Nope.” This time it was Brenda who supplied the information. “He’s got his own business, same as you, Mrs. Remington. He owns a body shop and he’s been sinking every penny into it.” “What made him place the ad?” she asked the girls. A sudden thought came to her. “He is the one who advertised, isn’t he?” Both girls looked away and Meg’s heart froze. “You mean to say you two advertised for a husband for me?” She spoke slowly, each word distinct. “We got lots of letters, too,” Brenda said proudly. “We went through them all and chose Steve Conlan.” “Don’t you want to know why?” Lindsey prodded. Meg gestured weakly, still too shocked to react. “Steve says he decided to answer your ad because one day he woke up and realized life was passing him by. All his friends were married, and he felt like something important was missing in his life. Then he knew it wasn’t something but someone.” “What about female friends?” Meg asked, thinking he didn’t look like a man who’d have to find companionship in the classifieds. “He said in his letter that …” Lindsey paused and rustled through a sheaf of papers, searching for the right envelope. “Here it is,” she muttered. “He doesn’t have much opportunity to meet single women unless they’ve been in an accident, and generally they’re not in the mood for romance when they’re dealing with a body shop and an insurance company.” Lindsey grinned. “He’s kind of witty. I like that about him.” “He said a lot of women his age have already been married and divorced and had a passel of kids.” This didn’t sound too promising to Meg. “You did happen to mention that I’m divorced, too, didn’t you?” “Of course,” Lindsey insisted. “We’d never lie.” Meg bit her tongue to keep from saying the obvious. “Just think,” Brenda said, “out of all the women who advertised, Steve chose you and we chose him. It’s destiny.” The girls thought she’d feel complimented, but Meg was suspicious. “Surely there was someone younger and prettier, without children, who interested him.” The two girls exchanged a smile. “He liked the fact that you count carbs and fat grams,” Brenda said proudly. So much for their unwillingness to stretch the truth. “You actually told him that?” She closed her eyes and groaned. “What else did you say?” “Just that you’re really wonderful.” “Heroic,” Brenda added. “And you are.” Oh, great. They’d made her sound like a thin Joan of Arc. “You will meet him, won’t you?” Lindsey’s dark eyes pleaded with Meg. “What I should do is march the two of you down to that fancy restaurant and have you personally apologize to him. You both deserve to be grounded until you’re forty.” The girls blinked in unison. “But, Mom … “ “Mrs. Remington … “ Meg raised her hand and stopped them. “I won’t take you to Chez Michelle, and as for the grounding part … we’ll discuss it later.” Two pairs of shoulders sagged with relief. “But I won’t have dinner with Steve Conlan,” she said emphatically. “I’ll go to the restaurant, introduce myself and explain what happened. I’m sure he’ll agree that the best thing to do is skip dinner altogether.” “You’ll wear the dress, won’t you?” Lindsey asked, eyeing the slinky black concoction hanging outside her closet door. “Absolutely not,” Meg said. She refused to even consider it. “But you don’t have anything special enough for Chez Michelle. Just try it on, Mom.” “No. Well … “ “Come on, Mom. Brenda and I want to see how it looks.” An hour later Meg pulled up at Chez Michelle in the very dress she’d sworn she’d never wear. It fit as if it’d been designed just for her, enhancing her figure and camouflaging those stubborn ten pounds. At least that was what Lindsey and Brenda told her. “Hello.” The hostess greeted her with a wide smile. “Table for one?” “I’m … meeting someone,” Meg said, glancing around the waiting area looking for a man who resembled “tall, dark and lonesome” in the photo. No one did. Nor was there a single male wearing a cowboy hat. The only man who looked vaguely like the one in the photograph stood in the corner of the room, leaning indolently against the wall as if he had all the time in the world. He straightened and stared at her. Meg stared back. He reached inside his suit pocket and took out a picture. Meg opened the clasp of her purse and removed the photo the girls had given her. She looked down at it and then up again. He appeared to be doing the same thing. “Meg Remington?” he asked uncertainly. She nodded. “Steve Conlan?” He nodded, too. He wore a suit and tie. A suit and tie. The guy had really gone all out for her. Meg swallowed uncomfortably. He’d invited her to this ultrafancy restaurant expecting to meet the woman who’d exchanged those letters and messages with him. Meg felt her heart settle somewhere in the vicinity of her knees. She couldn’t very well introduce herself and immediately say it had all been a mistake and cancel dinner. Not when he’d gone to so much trouble. “I believe our table is ready,” Steve said, holding out his arm to her. His hand touched her elbow and he addressed the hostess. “We can be seated now.” The woman gave him an odd look, then picked up two huge menus. “This way.” Meg might’ve been wrong, but she thought she heard some reluctance in his voice. Perhaps she was a disappointment to Steve Conlan. After the fitness drill Lindsey and Brenda had put her through, Meg was feeling her advancing age. Pride stiffened Meg’s shoulders. So she hadn’t signed any modeling contracts lately. What did he expect from a thirty-seven-year-old woman? If he wanted to date a woman in her twenties, he shouldn’t have answered her ad. Lindsey’s ad, she corrected. It was all Meg could do not to stop Steve Conlan right then and there and tell him this was as good as it got. Especially in this dress. It was simply gorgeous. Meg knew now the girls had made the perfect choice. She was glad she’d given in to them on this one. Besides, Lindsey was right; she didn’t own anything fancy enough for Chez Michelle. Before she could stop herself she’d agreed to wear it. Soon both girls were offering her fashion advice. They were escorted to a linen-covered table next to the window, which overlooked Elliot Bay and Puget Sound. The moon’s reflection on the water sent gilded light across the surface, and the restaurant’s interior was dimly lit. Meg squinted, barely able to read her menu. She wondered if Steve was having the same problem. Originally she hadn’t intended to have dinner with him. Wouldn’t even now, if he hadn’t gone to so much trouble on her behalf. It seemed crass to drop in, announce it had all been a misguided attempt by her daughter to play matchmaker, ask his forgiveness and speedily disappear. “I believe I’ll have the chicken cordon bleu,” she said, deciding on the least expensive item on the menu. “And please, I insist on paying for my own meal.” It would be unforgivable to gouge him for that as well. “Dinner’s on me,” Steve insisted, setting his menu aside. He smiled for the first time and it transformed his face. He studied her, as if he wasn’t sure what to make of her. “But …” Meg lowered her gaze and closed her mouth. She didn’t know where to start and yet she didn’t know how much longer she could maintain the pretense. “This is all very elegant ….” “Yes,” he agreed, spinning the stem of his water glass between his thumb and index finger. “You look different than your picture.” Meg had no idea why she’d told him that. What she should be doing was explaining about Lindsey and Brenda. “How’s that?” “Your eyes are much bluer and you’ve cut your hair.” He gave a slight grin. “And your picture didn’t do you justice.” Meg hadn’t thought to ask Lindsey which one she’d mailed Steve. “Can I see?” “Sure.” He pulled it out of his pocket and handed it over. Meg took one look and rolled her eyes. She couldn’t believe Lindsey had sent this particular photograph to anyone. It’d been taken just before Christmas a year earlier. She was standing in front of the Christmas tree wearing a white dress that drained all the color from her face. The flash from the camera made her eyes appear red. She looked like she was recovering from a serious ailment. “This is one of the worst pictures ever taken of me,” she said impatiently. “The one of me at the bookstore is much better.” Steve’s brow creased with a frown. “I see. You should’ve sent that one.” Meg realized what she’d said too late. “You’re right, I should have …. How silly of me.” The waitress came and they placed their orders, both declining a drink, Meg to keep down the cost and Steve, no doubt, to hurry the meal along. Once the server had left the table, Meg carefully smoothed the napkin across her lap. “Listen, Steve … “ “Meg … “ They both stopped. “You go first,” he said, gesturing toward her. “All right.” She cocked her head to one side and then the other, going over the words in her mind. “This isn’t easy ….” Steve frowned. “It’s been a pleasure to meet me, but the chemistry just isn’t there and you’d like to let me down gently and be done with it.”","sourceLink":"https://allnovel.net/a-mother-s-wish/page-4.html","bookId":1963,"book":{"id":1963,"title":"A Mother\u0027s Wish","description":"Storyline: Two stories from Debbie Macomber. In \"Wanted, Perfect Partner\" Meg\u0027s teenage daughter, Lindsey, had the nerve to place a personal ad on her behalf - \u0027Wanted: Perfect Partner. I\u0027m dating-shy, divorced and seeking a man with marriage in mind.\u0027 Worse, Steve Conlan, who answered the ad, was perfect, according to Lindsey. Did a teenage matchmaker get it right? In the second story, \"Father\u0027s Day\", Robin Masterton\u0027s young son, Jeff, thinks he needs a dog more than anything in the world. And there just happens to be one next door! But the friendly black Lab belongs to Cole Camden, the unfriendliest man in the neighbourhood. Still, Jeff persists - and ropes his mum in as the persuader. Perhaps there\u0027s a chance he\u0027ll have a dog, and a dad in time for Father\u0027s Day...","cover":"https://allnovel.net/images/a-mother-s-wish.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-mother-s-wish.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:15:09 AM"}}
