{"id":70108,"no":8,"title":"Page 8","content":"He stood in the archway between the entry and her living room, feet braced apart. “You must be Lindsey,” he said gruffly. “I’m Steve.” “You’re Steve?” Lindsey sounded uncharacteristically meek. “Lindsey, this is Steve Conlan,” Meg said, standing next to him. Steve slid his arm around Meg’s waist and planted a noisy kiss on her cheek. He glanced at Lindsey. “I understand you’re the one who got us together. Thanks.” “You’re welcome.” Lindsey’s eyes didn’t so much as flicker. She certainly wasn’t about to let them read her thoughts. “You, uh, don’t look anything like your picture.” Steve refused to take his eyes off Meg. He squeezed her waist again. “The one I sent was taken a while back,” he said. “Before I went to prison.” Lindsey gasped. “Prison?” “Don’t worry, sweetheart. It wasn’t a violent crime.” “What … were you in for?” Lindsey asked, her voice shaking. Steve rubbed the side of his jaw, shadowed by a dark growth of beard. “If you don’t mind, I’d rather not say.” “Sit down, Steve,” Meg said from between gritted teeth. Talk about overkill. Any more of this and everything would be ruined. “Would you care for coffee?” Lindsey asked. Her young voice continued to tremble. “You got a beer?” “It’s not a good idea to be drinking this early in the afternoon, is it?” Meg asked sweetly. Steve sat down on the sofa, balancing his ankle on the opposite knee. He looked around as if he were casing the joint. Meg moved to the silver service. “Coffee or tea?” “Coffee, but add a little something that’ll give it some kick.” Meg poured coffee for him and added a generous dollop of half-and-half. He frowned at the delicate bone china cup as though he wasn’t sure how to hold it. Lindsey sat down on the ottoman, her eyes huge. “I … you never said anything about prison.” “Don’t like to mention it until people have a chance to meet me for themselves. Some of ‘em tend to think the worst of a person when they hear he’s had a felony conviction.” “A … felony.” Lindsey snapped her mouth shut, inhaled deeply, then said in a subdued tone, “I see.” “The flowers are lovely.” Meg fingered a rosebud from the bouquet. Steve grinned. “My probation officer told me women like that sort of thing. Glad to know he was right.” He sipped his coffee and made a slurping sound. “By the way, you’ll be glad to hear I told him about you and me, and he did a background check on you and said it was fine for us to see each other.” “That’s wonderful,” Meg said with enthusiasm that wasn’t entirely faked. Steve set aside the delicate cup and leaned forward, his elbows on his knees. He stared at Lindsey and smiled. “Yup, I got to thank you,” he said. “I realize your mother’s upset with you placing that ad and everything. It’s usually not a good idea to fool someone like that, but I wasn’t being completely honest with you, either, so I guess we’re even.” Lindsey nodded. “Your mother’s one special woman. There aren’t a lot of females who’d be willing to overlook my past. Most women don’t care that I’ve got a heart of gold. Your mama did. We sat down in that fancy restaurant and I took one look at her pretty face and I knew she was the woman for me.” He rubbed the side of his unshaven jaw and laughed. “I do have to tell you, though, that when you suggested Chez Michelle, I was afraid Meg might be too high maintenance for someone like me.” “I’m sorry …” Lindsey floundered with the apology. “I didn’t know.” “Don’t you worry. Your mama was worth every penny of that fancy dinner. Just getting to know her and love her—why, a man couldn’t ask for a prettier gal.” He eyed her as if she were a Thanksgiving feast, then moistened his lips, implying it was all he could do to keep from grabbing her right then and there and kissing her. “Steve …” Meg muttered. “Sorry,” he said, and seemed to pull himself together. “Earl Markham, my probation officer, says I’ve gotta be careful not to rush things. But I look at your beautiful eyes and I can’t help myself.” “Yes, well … “ “You didn’t tell me how good-looking your daughter is,” he said, as though Meg had purposely been holding out on him. “Lindsey’s my pride and joy,” Meg said, beaming her daughter a smile. “I got plenty of friends who wouldn’t mind meeting a good-looking girl like you.” He winked at Lindsey, suggesting that all he needed was one word from her and he’d make the arrangements immediately. “Absolutely not!” Meg said, forgetting this was just a game. “I won’t have you introducing my daughter to your friends.” Steve’s eyes widened with surprise and he held up his right hand, as if taking an oath. “Sorry, I didn’t mean to offend. You don’t want Lindsey dating any of my buddies, fine, I’ll see it never happens.” “Good.” Meg had to acknowledge that Steve was an excellent actor. He almost had her believing him. She suspected that was because he’d turned himself into the man she’d half expected to meet that night. Steve smacked his lips. “I gotta tell you when I first saw Meg in that pretty black dress, my heart went all the way to the floor. She’s the most beautiful woman I’ve seen since I was released.” His eyes softened as his gaze fell on Meg. “Released?” Lindsey squeaked. “From prison,” Steve clarified, his gaze immediately returning to Meg. It would help considerably if he didn’t look so sincere, Meg thought. “Yes, well …” she said, standing. But once she was on her feet, she wasn’t sure what to do. “I’ll bet you want me to take you on that motorcycle ride I been promising you,” Steve said, downing the last of his coffee. “Mom’s going on a motorcycle with you?” Lindsey asked, swallowing visibly. “I’d better change clothes,” Meg said, eager to escape so she could speak to Steve alone. “No need,” Steve said. “You can ride sidesaddle if you want. I brought my Hog. There’s plenty of room, although I gotta tell you, I been dreaming about you sitting behind me, wrapping your arms around my waist. You’ll need to hold on tight, honey, real tight.” His eyes didn’t waver from hers, and the sexual innuendo was unmistakable. “Yes, well …” Either the room had grown considerably warmer or Meg was in deep trouble. Judging by the look of disgust Lindsey cast her, she could see it was the latter. “I think I’ll change into a pair of jeans, if it’s all the same to you.” “Sure,” Steve said, wiping the back of his hand across his mouth. “Just don’t keep me waiting long, you hear?” “I won’t,” she promised. Meg rushed toward the stairs, anxious to get away. Steve reached out to stop her. His hand closed over her shoulder and he brought her into his arms. She gasped in shock. Without giving her time to recover, he lowered his mouth to hers. It was all for show, but that didn’t keep her heart from fluttering wildly. Her stomach muscles tightened at the unexpectedness of his kiss. Her lips parted and she slid her arms tightly around his narrow waist. Steve groaned and Meg was afraid the hunger she felt in him was a reflection of her own. By the time he dragged his lips from hers they were both panting. Speechless, they stared at each other. “I’ll … I’ll be right back,” she managed to whisper. Then she raced up the stairs as if demons were in hot pursuit. On the way she caught a glimpse of Lindsey staring after her, open-mouthed. Four The minute they were alone outside, Meg hit Steve across his upper arm, hurting her hand in the process. Biting her lip, she shook her fingers several times, then clutched her aching hand protectively with the other. “What was that for?” Steve demanded, glaring at her. “You overdid it,” she snapped, barely understanding her own outrage. “I had to convince her I was unsuitable, didn’t I?” Meg bristled. “Yes, but you went above and beyond what we discussed. All that business about me being so beautiful,” she muttered as she walked to the driveway where he’d parked the Harley-Davidson. She climbed onto the leather seat without thinking. “I thought I did a great job,” Steve argued. A smile raised the edges of his mouth. “That’s another thing,” she said, unable to stop looking at him. “Was that kiss really necessary?” “Yes,” he said calmly, but Meg could tell that he didn’t take kindly to her rebuke. “Lindsey needed to see me in action,” he insisted. “You frightened my daughter half out of her wits as it was. There was no need to … “ Steve’s eyes widened, then softened into a smile. “You liked the kiss,” he said flatly. “You liked it and that scared you.” “Don’t be ridiculous! It … it was disgusting.” “No, it wasn’t.” His smile was cocky. He laughed, the timbre low and mildly threatening. “Maybe I should prove how wrong you are.” Meg shifted uncomfortably on the seat. “Let’s get this over with,” she said, feigning boredom. “You’re going to take me out for an hour or so and then drive me back. Right? By the way, where did you get the motorcycle?” He advanced a step toward her. “It’s mine.” “Yours?” He was exactly the kind of man her mother had warned her about, and here she was flirting with danger. He moved a step closer and she held herself rigid. “You don’t know much about men, do you?” he asked, his voice low and husky. “I was married for nearly six years,” she informed him primly. He was close now, too close. She kept her spine stiff and her eyes straight ahead. If the motorcycle was his, it was reasonable to assume the leather jacket belonged to him as well. The persona he’d taken on, the criminal element, might not be too far from the truth. “You haven’t been with a man since, have you?” She felt his breath against her flushed face. “I refuse to answer questions of a personal nature,” she returned, her voice hoarse and low. “You haven’t,” he said confidently. “Look at me, Meg.” “No. Let’s get this ride over with.” “Look at me,” he repeated. She tried to resist, but the words were warm and hypnotic. Against her better judgment, she twisted toward him. “Yes?” she asked, her heart pounding so hard she thought it might leap right through her chest. He wove his hands into her hair and tilted her head back so that she couldn’t avoid staring up at him. His gaze bored relentlessly into hers.","sourceLink":"https://allnovel.net/a-mother-s-wish/page-8.html","bookId":1963,"book":{"id":1963,"title":"A Mother\u0027s Wish","description":"Storyline: Two stories from Debbie Macomber. In \"Wanted, Perfect Partner\" Meg\u0027s teenage daughter, Lindsey, had the nerve to place a personal ad on her behalf - \u0027Wanted: Perfect Partner. I\u0027m dating-shy, divorced and seeking a man with marriage in mind.\u0027 Worse, Steve Conlan, who answered the ad, was perfect, according to Lindsey. Did a teenage matchmaker get it right? In the second story, \"Father\u0027s Day\", Robin Masterton\u0027s young son, Jeff, thinks he needs a dog more than anything in the world. And there just happens to be one next door! But the friendly black Lab belongs to Cole Camden, the unfriendliest man in the neighbourhood. Still, Jeff persists - and ropes his mum in as the persuader. Perhaps there\u0027s a chance he\u0027ll have a dog, and a dad in time for Father\u0027s Day...","cover":"https://allnovel.net/images/a-mother-s-wish.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-mother-s-wish.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:15:09 AM"}}
