{"id":74064,"no":19,"title":"Page 19","content":"“Hey, do you know why these are all stamped with the letters R N W?”\n Ian turns around. Stunned. Looks at me like I’ve just asked him to take his clothes off. “Well, I’ll be damned,” he says. “She speaks.”\n “Of course I speak,” I say, no longer interested in speaking at all.\n Ian passes me another box. Shrugs. “Well, now I know.”\n “Now you do.”\n “The mystery has been solved.”\n “You really didn’t think I could speak?” I ask after a moment. “Like, you thought I was mute?” I wonder what other things people are saying about me around here.\n Ian looks over his shoulder at me, smiles like he’s trying not to laugh. Shakes his head and doesn’t answer me. “The stamp,” he says, “is just regulation. They stamp everything RNW so they can track it. It’s nothing fancy.”\n “But what does RNW mean? Who’s stamping it?”\n “RNW,” he says, repeating the 3 letters like I’m supposed to recognize them. “Reestablished Nations of the World. Everything’s gone global, you know. They all trade commodities. And that,” he says, “is something no one really knows. It’s another reason why the whole Reestablishment thing is a pile of crap. They’ve monopolized the resources of the entire planet and they’re just keeping it all for themselves.”\n I remember some of this. I remember talking to Adam about this when he and I were locked in the asylum together. Back before I knew what it was like to touch him. To be with him. To hurt him. The Reestablishment has always been a global movement. I just didn’t realize it had a name.\n “Right,” I say to Ian, suddenly distracted. “Of course.”\n Ian pauses as he hands me another package. “So is it true?” he asks, studying my face. “That you really have no clue what’s happened to everything?”\n “I know some things.” I bristle. “I’m just not clear on all the details.”\n “Well,” Ian says, “if you still remember how to speak when we get back to Point, maybe you should join us at lunch sometime. We can fill you in.”\n “Really?” I turn to face him.\n “Yeah, kid.” He laughs, tosses me another box. “Really. We don’t bite.”\n TWENTY-THREE\n Sometimes I wonder about glue.\n No one ever stops to ask glue how it’s holding up. If it’s tired of sticking things together or worried about falling apart or wondering how it will pay its bills next week.\n Kenji is kind of like that.\n He’s like glue. He works behind the scenes to keep things together and I’ve never stopped to think about what his story might be. Why he hides behind the jokes and the snark and the snide remarks.\n But he was right. Everything he said to me was right.\n Yesterday was a good idea. I needed to get away, to get out, to be productive. And now I need to take Kenji’s advice and get over myself. I need to get my head straight. I need to focus on my priorities. I need to figure out what I’m doing here and how I can help. And if I care at all about Adam, I’ll try to stay out of his life.\n Part of me wishes I could see him; I want to make sure he’s really going to be okay, that he’s recovering well and eating enough and getting sleep at night. But another part of me is afraid to see him now. Because seeing Adam means saying good-bye. It means really recognizing that I can’t be with him anymore and knowing that I have to find a new life for myself. Alone.\n But at least at Omega Point I’ll have options. And maybe if I can find a way to stop being scared, I’ll actually figure out how to make friends. To be strong. To stop wallowing in my own problems.\n Things have to be different now.\n I grab my food and manage to lift my head; I nod hello to the faces I recognize from yesterday. Not everyone knows about my being on the trip—the invitations to go on missions outside of Omega Point are exclusive—but people, in general, seem to be a little less tense around me. I think.\n I might be imagining it.\n I try to find a place to sit down but then I see Kenji waving me over. Brendan and Winston and Emory are sitting at his table. I feel a smile tug at my lips as I approach them.\n Brendan scoots over on the bench seat to make room for me. Winston and Emory nod hello as they shovel food into their mouths. Kenji shoots me a half smile, his eyes laughing at my surprise to be welcomed at his table.\n I’m feeling okay. Like maybe things are going to be okay.\n “Juliette?”\n And suddenly I’m going to tip over.\n I turn very, very slowly, half convinced that the voice I’m hearing belongs to a ghost, because there’s no way Adam could’ve been released from the medical wing so soon. I wasn’t expecting to have to face him so soon. I didn’t think we’d have to have this talk so soon. Not here. Not in the middle of the dining hall.\n I’m not prepared. I’m not prepared.\n Adam looks terrible. He’s pale. Unsteady. His hands are stuffed in his pockets and his lips are pressed together and his eyes are weary, tortured, deep and bottomless wells. His hair is messy. His T-shirt is straining across his chest, his tattooed forearms more pronounced than ever.\n I want nothing more than to dive into his arms.\n Instead, I’m sitting here, reminding myself to breathe.\n “Can I talk to you?” he says, looking like he’s half afraid to hear my answer. “Alone?”\n I nod, still unable to speak. Abandon my food without looking back at Kenji or Winston or Brendan or Emory so I have no idea what they must be thinking right now. I don’t even care.\n Adam.\n Adam is here and he’s in front of me and he wants to talk to me and I have to tell him things that will surely be the death of me.\n But I follow him out the door anyway. Into the hall. Down a dark corridor.\n Finally we stop.\n Adam looks at me like he knows what I’m going to say so I don’t bother saying it. I don’t want to say anything unless it becomes absolutely necessary. I’d rather just stand here and stare at him, shamelessly drink in the sight of him one last time without having to speak a word. Without having to say anything at all.\n He swallows, hard. Looks up. Looks away. Blows out a breath and rubs the back of his neck, clasps both hands behind his head and turns around so I can’t see his face. But the effort causes his shirt to ride up his torso and I have to actually clench my fingers to keep from touching the sliver of skin exposed low on his abdomen, his lower back.\n He’s still looking away from me when he says, “I really—I really need you to say something.” And the sound of his voice—so wretched, so agonized—makes me want to fall to my knees.\n Still, I do not speak.\n And he turns.\n Faces me.\n “There has to be something,” he says, his hands in his hair now, gripping his skull. “Some kind of compromise—something I can say to convince you to make this work. Tell me there’s something.”\n And I’m so scared. So scared I’m going to start sobbing in front of him.\n “Please,” he says, and he looks like he’s about to crack, like he’s done, like this is it he’s about to fall apart and he says, “say something, I’m begging you—”\n I bite my trembling lip.\n He freezes in place, watching me, waiting.\n “Adam,” I breathe, trying to keep my voice steady. “I will always, a-always love you—”\n “No,” he says. “No, don’t say that—don’t say that—”\n And I’m shaking my head, shaking it fast and hard, so hard it’s making me dizzy but I can’t stop. I can’t say another word unless I want to start screaming and I can’t look at his face, I can’t bear to see what I’m doing to him—\n “No, Juliette—Juliette—”\n I’m backing away, stumbling, tripping over my own feet as I reach blindly for the wall when I feel his arms around me. I try to pull away but he’s too strong, he’s holding me too tight and his voice is choked when he says, “It was my fault—this is my fault—I shouldn’t have kissed you—you tried to tell me but I didn’t listen and I’m so—I’m so sorry,” he says, gasping the words. “I should’ve listened to you. I wasn’t strong enough. But it’ll be different this time, I swear,” he says, burying his face in my shoulder. “I’ll never forgive myself for this. You were willing to give it a shot and I screwed everything up and I’m sorry, I’m so sorry—”\n I have officially, absolutely collapsed inside.\n I hate myself for what happened, hate myself for what I have to do, hate that I can’t take his pain away, that I can’t tell him we can try, that it’ll be hard but we’ll make it work anyway. Because this isn’t a normal relationship. Because our problems aren’t fixable.\n Because my skin will never change.\n All the training in the world won’t remove the very real possibility that I could hurt him. Kill him, if we ever got carried away. I will always be a threat to him. Especially during the most tender moments, the most important, vulnerable moments. The moments I want most. Those are the things I can never have with him, and he deserves so much more than me, than this tortured person with so little to offer.\n But I’d rather stand here and feel his arms around me than say a single thing. Because I’m weak, I’m so weak and I want him so much it’s killing me. I can’t stop shaking, I can’t see straight, I can’t see through the curtain of tears obscuring my vision.\n And he won’t let go of me.\n He keeps whispering “Please” and I want to die.\n But I think if I stay here any longer I will actually go insane.\n So I raise a trembling hand to his chest and feel him stiffen, pull back, and I don’t dare look at his eyes, I can’t stand to see him looking hopeful, even if it’s for only a second.\n I take advantage of his momentary surprise and slackened arms to slip away, out of the shelter of his warmth, away from his beating heart. And I hold out my hand to stop him from reaching for me again.\n “Adam,” I whisper. “Please don’t. I can’t—I c-can’t—”\n “There’s never been anyone else,” he says, not bothering to keep his voice down anymore, not caring that his words are echoing through these tunnels. His hand is shaking as he covers his mouth, as he drags it across his face, through his hair. “There’s never going to be anyone else—I’m never going to want anyone else—”\n “Stop it—you have to stop—” I can’t breathe I can’t breathe I can’t breathe “You don’t want this—you don’t want to be with someone like me—someone who will only end up h-hurting you—”\n “Dammit, Juliette”—he turns to slam his palms against the wall, his chest heaving, his head down, his voice broken, catching on every other syllable—“you’re hurting me now,” he says. “You’re killing me—” \n","sourceLink":"https://allnovel.net/unravel-me-shatter-me-2/page-19.html","bookId":1772,"book":{"id":1772,"title":"Unravel Me (Shatter Me #2)","description":"Storyline: \n Unravel Me (Shatter Me #2) \n tick \n tick \n tick \n tick \n tick \n it\u0027s almost \n time for war. \n Juliette has escaped to Omega Point. It is a place for people like her—people with gifts—and it is also the headquarters of the rebel resistance. \n She\u0027s finally free from The Reestablishment, free from their plan to use her as a weapon, and free to love Adam. But Juliette will never be free from her lethal touch. \n Or from Warner, who wants Juliette more than she ever thought possible. \n In this exhilarating sequel to Shatter Me, Juliette has to make life-changing decisions between what she wants and what she thinks is right. Decisions that might involve choosing between her heart—and Adam\u0027s life.\n \n","cover":"https://allnovel.net/images/unravel-me-shatter-me-2.jpg","author":"Tahereh Mafi","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/unravel-me-shatter-me-2.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:29:24 AM"}}
