{"id":74101,"no":44,"title":"Page 44","content":"“So—what? You were trying to finish him off tonight?” I’m still so confused, trying to make an attempt to refocus the conversation. “Did you hurt him on purpose?” “Not on purpose.” Warner shakes his head. “I didn’t actually know what I was doing. Not at first. I’ve only ever just sensed Energy; I never knew I could take it. But I touched yours simply by touching you—there was so much adrenaline among the group of us that yours practically threw itself at me. And when Kenji grabbed my arm,” he says, “you and I, we were still connected. And I … somehow I managed to redirect your power in his direction. It was quite accidental but I felt it happen. I felt your power rush into me. Rush out of me.” He looks up. Meets my eyes. “It was the most extraordinary thing I’ve ever experienced.” I think I’d fall down if I weren’t already sitting. “So you can take—you can just take other people’s powers?” I ask him. “Apparently.” “And you’re sure you didn’t hurt Kenji on purpose?” Warner laughs, looks at me like I’ve just said something highly amusing. “If I had wanted to kill him, I would have. And I wouldn’t have needed such a complicated setup to accomplish it. I’m not interested in theatrics,” he says. “If I want to hurt someone, I won’t require much more than my own two hands.” I’m stunned into silence. “I’m actually amazed,” Warner says, “how you manage to contain so much without finding ways to release the excess. I could barely hold on to it. The transfer from my body to Kenji’s was not only immediate, it was necessary. I couldn’t tolerate the intensity for very long.” “And I can’t hurt you?” I blink at him, astonished. “At all? My power just goes into you? You just absorb it?” He nods. Says, “Would you like to see?” And I’m saying yes with my head and my eyes and my lips and I’ve never been more terrified to be excited in my life. “What do I have to do?” I ask him. “Nothing,” he says, so quietly. “Just touch me.” My heart is beating pounding racing running through my body and I’m trying to focus. Trying to stay calm. This is going to be fine, I say to myself. It’s going to be fine. It’s just an experiment. There’s no need to get so excited about being able to touch someone again, I keep saying to myself. But oh, I am so, so excited. He holds out his bare hand. I take it. I wait to feel something, some feeling of weakness, some depletion of my Energy, some sign that a transfer is taking place from my body to his but I feel nothing at all. I feel exactly the same. But I watch Warner’s face as his eyes close and he makes an effort to focus. Then I feel his hand tighten around mine and he gasps. His eyes fly open and his free hand goes right through the floor. I jerk back, panicked. I’m tipping sideways, my hands catching me from behind. I must be hallucinating. I must be hallucinating the hole in the floor not 4 inches from where Warner is still sitting on the ground. I must’ve been hallucinating when I saw his resting palm press too hard and go right through. I must be hallucinating everything. All of this. I’m dreaming and I’m sure I’m going to wake up soon. That must be it. “Don’t be afraid—” “H-how,” I stammer, “how did you d-do that—” “Don’t be frightened, love, it’s all right, I promise—it’s new for me, too—” “My—my power? It doesn’t—you don’t feel any pain?” He shakes his head. “On the contrary. It’s the most incredible rush of adrenaline—it’s unlike anything I’ve ever known. I actually feel a little light-headed,” he says, “in the best possible way.” He laughs. Smiles to himself. Drops his head into his hands. Looks up. “Can we do it again?” “No,” I say too quickly. He’s grinning. “Are you sure?” “I can’t—I just, I still can’t believe you can touch me. That you really—I mean”—I’m shaking my head—“there’s no catch? There are no conditions? You touch me and no one gets hurt? And not only does no one get hurt, but you enjoy it? You actually like the way it feels to touch me?” He’s blinking at me now, staring like he’s not sure how to answer my question. “Well?” “Yes,” he says, but it’s a breathless word. “Yes, what?” I can hear how hard his heart is beating. I can actually hear it in the silence between us. “Yes,” he says. “I like it.” Impossible. “You never have to be afraid of touching me,” he says. “It won’t hurt me. It can only give me strength.” I want to laugh one of those strange, high-pitched, delusional laughs that signals the end of a person’s sanity. Because this world, I think, has a terrible, terrible sense of humor. It always seems to be laughing at me. At my expense. Making my life infinitely more complicated all the time. Ruining all of my best-laid plans by making every choice so difficult. Making everything so confusing. I can’t touch the boy I love. But I can use my touch to strengthen the boy who tried to kill the one I love. No one, I want to tell the world, is laughing. “Warner.” I look up, hit with a sudden realization. “You have to tell Castle.” “Why would I do that?” “Because he has to know! It would explain Kenji’s situation and it could help us tomorrow! You’ll be fighting with us and it might come in handy—” Warner laughs. He laughs and laughs and laughs, his eyes brilliant, gleaming even in this dim light. He laughs until it’s just a hard breath, until it becomes a gentle sigh, until it dissolves into an amused smile. And then he grins at me until he’s grinning to himself, until he looks down and his gaze drops to my hand, the one lying limp on my lap and he hesitates just a moment before his fingers brush the soft, thin skin covering my knuckles. I don’t breathe. I don’t speak. I don’t even move. He’s hesitant, like he’s waiting to see if I’ll pull away and I should, I know I should but I don’t. So he takes my hand. Studies it. Runs his fingers along the lines of my palm, the creases at my joints, the sensitive spot between my thumb and index finger and his touch is so tender, so delicate and gentle and it feels so good it hurts, it actually hurts. And it’s too much for my heart to handle right now. I snatch back my hand in a jerky, awkward motion, face flushing, pulse tripping. Warner doesn’t flinch. He doesn’t look up. He doesn’t even seem surprised. He only stares at his now empty hands as he speaks. “You know,” he says, his voice both strange and soft, “I think Castle is little more than an optimistic fool. He tries too hard to welcome too many people and it’s going to backfire, simply because it’s impossible to please everyone.” A pause. “He is the perfect example of the kind of person who doesn’t know the rules of this game. Someone who thinks too much with his heart and clings too desperately to some fantastical notion of hope and peace. It will never help him,” he sighs. “In fact, it will be the end of him, I’m quite sure of it. “But there is something about you,” Warner says, “something about the way you hope for things.” He shakes his head. “It’s so naive that it’s oddly endearing. You like to believe people when they speak,” he says. “You prefer kindness.” He smiles, just a little. Looks up. “It amuses me.” All at once I feel like an idiot. “You’re not fighting with us tomorrow.” Warner is smiling openly now, his eyes so warm. “I’m going to leave.” “You’re going to leave.” I’m numb. “I don’t belong here.” I’m shaking my head, saying, “I don’t understand—how can you leave? You told Castle you’re going to fight with us tomorrow—does he know you’re leaving? Does anyone know?” I ask him, searching his face. “What do you have planned? What are you going to do?” He doesn’t answer. “What are you going to do, Warner—” “Juliette,” he whispers, and his eyes are urgent, tortured all of a sudden. “I need to ask you somethi—” Someone is bolting down the tunnels. Calling my name. Adam. FIFTY-NINE I jump up, frantic, and tell Warner I’ll be right back. I’m saying don’t leave yet, don’t go anywhere just yet I’ll be right back but I don’t wait for his response because I’m on my feet and I’m running toward the lighted hallway and I almost slam right into Adam. He steadies me and pulls me tight, so close, always forgetting not to touch me like this and he’s anxious and he says, “Are you okay?” and “I’m so sorry,” and “I’ve been looking for you everywhere,” and “I thought you’d come down to the medical wing,” and “it wasn’t your fault, I hope you know that—” It keeps hitting me in the face, in the skull, in the spine, this knowledge of just how much I care about him. How much I know he cares about me. Being close to him like this is a painful reminder of everything I had to force myself to walk away from. I take a deep breath. “Adam,” I ask, “is Kenji okay?” “He’s not conscious yet,” he says to me, “but Sara and Sonya think he’s going to be okay. They’re going to stay up with him all night, just to be sure he makes it through in one piece.” A pause. “No one knows what happened,” he says. “But it wasn’t you.” His eyes lock mine in place. “You know that, right? You didn’t even touch him. I know you didn’t.” And even though I open my mouth a million times to say, It was Warner. Warner did it. He’s the one who did this to Kenji, you have to get him and catch him and stop him he is lying to all of you! He’s going to escape tomorrow! I don’t say any of it and I don’t know why. I don’t know why I’m protecting him. I think part of me is afraid to say the words out loud, afraid to make them true. I still don’t know whether or not Warner is really going to leave or even how he’s going to escape; I don’t know if it’s even possible. And I don’t know if I can tell anyone about Warner’s ability yet; I don’t think I want to explain to Adam that while he and the rest of Omega Point were tending to Kenji, I was hiding in a tunnel with Warner—our enemy and hostage—holding his hand and testing out his new power. I wish I weren’t so confused. I wish my interactions with Warner would stop making me feel so guilty. Every moment I spend with him, every conversation I have with him makes me feel like I’ve somehow betrayed Adam, even though technically we’re not even together anymore. My heart still feels so tied to Adam; I feel bound to him, like I need to make up for already having hurt him so much. I don’t want to be the reason for the pain in his eyes, not again, and somehow I’ve decided that keeping secrets is the only way to keep him from getting hurt. But deep down, I know this can’t be right. Deep down, I know it could end badly.","sourceLink":"https://allnovel.net/unravel-me-shatter-me-2/page-44.html","bookId":1772,"book":{"id":1772,"title":"Unravel Me (Shatter Me #2)","description":"Storyline: Unravel Me (Shatter Me #2) tick tick tick tick tick it\u0027s almost time for war. Juliette has escaped to Omega Point. It is a place for people like her—people with gifts—and it is also the headquarters of the rebel resistance. She\u0027s finally free from The Reestablishment, free from their plan to use her as a weapon, and free to love Adam. But Juliette will never be free from her lethal touch. Or from Warner, who wants Juliette more than she ever thought possible. In this exhilarating sequel to Shatter Me, Juliette has to make life-changing decisions between what she wants and what she thinks is right. Decisions that might involve choosing between her heart—and Adam\u0027s life.","cover":"https://allnovel.net/images/unravel-me-shatter-me-2.jpg","author":"Tahereh Mafi","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/unravel-me-shatter-me-2.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:29:24 AM"}}
