{"id":91108,"no":19,"title":"Page 19","content":"“There now, Davey,” Finn crooned as gently as one might try to calm a feral dog. “That’s better, isn’t it? Are you hungry, boy? Want something to eat?” He looked up as Lang returned with two other men. “Lang, grab hold of Davey here,” he said, handing over the control pole. “You two, hold up with Barnes and Mather a minute. They’re not going anywhere. Help Lang put Davey in restraints.” He patted the empty gurney beside Peter’s. “Right here, next to his new roomie.” As the guards hurried to comply, Finn turned his attention to the late Mather’s instrument tray. Humming, he finger-walked the instruments, then selected a hefty, thick scalpel. The metal winked a hard, bright yellow as Finn stooped over Mather’s body. The old woman’s eyes were still jammed open. Her mouth gawped in a slack, surprised O. Finn reached in, reeled out Mather’s tongue, and began to saw. He’s crazy. Peter’s throat convulsed, and then he was rolling his head to one side and vomiting the water he’d just drunk along with a thick gob of sour phlegm and mucus. He gulped air as the room spun. He’s nuts, he’s insane. “There we go,” Finn said. Peter opened his eyes to find Finn standing over the gurney to his right. The boy was firmly tethered in leather restraints. The boy’s chest heaved. His glittery crow’s eyes were fixed on Finn’s glistening, gore-soaked hands. “Care for a bite, Davey?” The boy gasped as the first thick, ruby teardrop splashed to his lips. A mad hunger chased over the boy’s face as he tongued the blood then opened wider, craning his neck so the blood could drip directly into his mouth. To Peter, he looked like a baby bird waiting for its mother to cram a worm down its throat. Peter thought of how he must have looked to Finn as the old man offered him water. There was, in fact, no difference. Then, viper-quick, the boy’s head darted. Finn jerked back just as Davey’s teeth clashed and bit air where Finn’s pinky had been. “Bad boy.” Finn gave the boy’s cheek a quick, hard flick. “No, Davey, no biting.” Snarling, the Changed boy surged again. Finn backhanded him with a punch this time, right below the boy’s eye, and then waited as the guards strapped a wide band of leather across the boy’s forehead. “All right, let’s try again.” Finn sliced off another chunk of Mather’s tongue with the scalpel. It took three more tries and as many punches before Davey let Finn drop the drippy meat into his mouth without snapping at the old man’s fingers. Peter watched as the boy held the morsel in his mouth then worked the meat from cheek to cheek. “Go on.” Finn sounded just like a kindly old grandpa slipping his favorite grandson a Hershey’s Kiss, sure to spoil his appetite, on the sly. Without looking around, he added, “It’s quite interesting, actually. I’ve studied a number of them now. You do realize that the . . . what do you call it? The Change? From my observations, it’s not over yet, boy-o, not by a long shot.” Something turned over in his chest. The Change wasn’t over? The thinking part of his brain had known this was a possibility, but no one in Rule had seen that happen to a Spared. No one’s safe? Peter felt his mind cringing away. No, he’s wrong. I’m Spared. It’s not going to happen to me, or Chris, or any of the other Spared. It’s been too long; it’s been months. That can’t be right. “Do you know what I wonder?” Finn’s face turned a little dreamy. “I wonder what it would be like.” “What?” Peter managed. He slicked his lips. “You mean . . . to Change?” “Yes. Self-awareness is a blessing and a curse, Peter. You know when you’re coming down with a cold. There are signs and symptoms. So what is the Change like? Do you sense it? Would you even know? You must. The dying have this sixth sense when the end is near. Even the insane know when their hold on reality slips. They may lie to themselves, of course, but . . . they know.” “I . . . I d-don’t . . .” He was shaking. His teeth wouldn’t stop chattering. “I don’t c-care. I don’t w-want t-to know. It d-doesn’t matter.” “Oh, but it does, and you should care. To understand your enemy—beat him at his own game—you must allow yourself to inhabit his brain, see with his eyes. Now, this is not to say ‘seen one Chucky, seen them all.’ Oh no. For example, take what happens to a Chucky once he’s completely turned, like our Davey here,” Finn waved a hand at the boy. “A fresh Chucky is an animal. Some stay wild. Others evolve, and some appear to be smarter than others. It’s the bell curve in action, boy-o. Why, I bet there’s a Chucky rocket scientist in the mix, somewhere. Oh, I’d so love to catch a normal kid a good long time before he goes native so I can measure the rate at which he reacquires function. I’m especially interested in the ones turning now. Their course must be so different from the first wave, don’t you agree? And how do they communicate? We know some work together, travel in bands and packs and gangs and tribes and so forth, while others are loners. So are we talking telepathy? Subaudible vocalizations? Scent? Body language? Alone? In combination?” “What are you talking about?” Peter whispered. He was now thoroughly and deeply afraid for the first time since the world went dark. “You want to see if I’m going to Change? I’m not. It’s been too long. You want to know about Rule? You can torture me, but I won’t tell you.” When Finn didn’t reply, Peter said, “For God’s sake, what do you want?” “You mean a smart boy like you can’t figure it out?” Dropping to one knee, Finn used a thumb to pull down Mather’s lower eyelid, then slid the scalpel into the pink tissue tethering Mather’s right eyeball to its socket. He worked the blade, scraping bone. “You disappoint me, Peter. Despite what the movies say, not all Vietnam vets are crazy. Some of us even get to be senators. Me, I’m a student of the natural world. Like Darwin, come to think of it. Evolution, natural selection, survival of the fittest—all unfolding before our eyes. We are the authors of the new origin of species, boy-o.” “What—” Peter was sick with horror. “What are you going to do with me?” “Isn’t it obvious?” Finn said. Mather’s eye dangled from his fingers by a bloody stalk of nerve. “Experiment.” Part 3 - The Short Straw 22 Eight days gone. Alex had kept track, scratching a hash mark into the toe of her right boot with the metal prong of her watchband. Over the past eight days, she figured they’d covered anywhere from fifty to sixty miles. Getting her bearings was a challenge. The days were overcast, the nights starless, and their group kept to the deep woods. But she thought they were moving on a kind of circuit, going first west but looping north. They stopped at regular intervals, too, during which time the Changed hunted, chowed down, caught a little shut-eye. The good news, all things considered, was that she wasn’t dead yet. The bad news: she might draw that short straw, and soon. It all came down to the math. Eight days ago, on that first Saturday morning, the Changed had six Happy Meals to choose from, counting Alex. After all the ruckus, she’d assumed she was next on the menu. Yet it seemed that the Changed—well, Wolf anyway—had different ideas. Although conscious, Spider was still groggy, so Wolf had wandered up and down, eyeing the herd, that gory corn knife in hand. Twice, he lingered over Alex, now trussed between the old lady, Ruby, and the sickly guy whose name, she would discover, was Brian. Wolf ’s eyes touched on her, then flitted away before jumping back. Playing with her? She wasn’t sure. Maybe he was as puzzled as she. Were their experiences similar? Did he feel what she had, that odd sidestep into her consciousness? Could he read her? No, she didn’t think so. During the fight on the snow, she’d surprised Spider— and then she remembered how Wolf had been startled when she let that gob of spit fly. So maybe it doesn’t go both ways. She’d given Wolf a narrow look as he moved down the line, studying each captive. Maybe I can use that somehow. In the end, Wolf had chosen a small woman, tiny and brown as a wren, for that Saturday’s main course. What puzzled and then appalled her was how the woman didn’t struggle or protest. None of the others did either. Instead, they watched, impassively, as Acne and Beretta took the woman out of the line and led her, stumbling, across the snow a short ten yards to where Wolf waited. When they released her, the woman tottered but didn’t fall. She stood, swaying, head down, shoulders slumped. Having replaced his cowl so his face was visible only from the nose down, Wolf waited a long beat, then knotted his fist in the woman’s hair. The little woman let out a small cry as Wolf gave her head a vicious wrench that exposed her throat and made her back arch like a bow. That’s when it hit her. Wolf was going to kill her right there, in front of them. Her stomach tried to crawl into her chest. I can’t watch this. Repulsed, still furious, she looked away. I won’t give them the satisfac— The blow was stunning, a ferocious, open-palmed smack that sent Alex’s head whipping to the right. There was a sharp stab of pain as her teeth clamped her tongue. Her mind hitched, and she tottered, her balance already precarious because her ankles were still hobbled together, and she nearly went down. She was saved only because the sickly guy, Brian, had enough bulk to steady her. “Please.” Brian actually tried pulling away, as if worried that he might give the appearance of being helpful. “Just do what they want.” “Like hell.” Her face felt like a bomb had gone off in her cheek. It was a wonder her jaw wasn’t broken. Panting, she pushed away and looked to see which of the Changed had blindsided her. To her complete lack of surprise, Slash was there and, judging from the loose set of her shoulders, more than happy to let go with another sucker punch. “Listen to Brian, please.” It was the old lady, Ruby, at her other elbow. “Don’t fight them. Just do what they want.”","sourceLink":"https://allnovel.net/shadows-ashes-trilogy-2/page-19.html","bookId":2565,"book":{"id":2565,"title":"Shadows (Ashes Trilogy #2)","description":"Storyline: Shadows (Ashes Trilogy #2) The Apocalypse does not end. The Changed will grow in numbers. The Spared may not survive. Even before the EMPs brought down the world, Alex was on the run from the demons of her past and the monster living in her head. After the world was gone, she believed Rule could be a sanctuary for her and those she’d come to love. But she was wrong. Now Alex is in the fight of her life against the adults, who would use her, the survivors, who don’t trust her, and the Changed, who would eat her alive. Welcome to Shadows, the second book in the haunting apocalyptic Ashes Trilogy: where no one is safe and humans may be the worst of the monsters.","cover":"https://allnovel.net/images/shadows-ashes-trilogy-2.jpg","author":"Ilsa J. Bick","type":"Horror","source":"allnovel","link":"https://allnovel.net/shadows-ashes-trilogy-2.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 5, 2019 5:45:51 PM"}}
