{"id":91119,"no":30,"title":"Page 30","content":"\\n\\n “Hey.” Sharon fished out a bottled water and twisted off the cap. “Better chase that you want it to go down.”\\n\\n “Thanks.” She tipped the bottle to her mouth, wincing a little at the taste. The water smelled of blood and iron and dead Jack—\\n\\n “You okay?” Sharon asked around peanuts.\\n\\n “Sure.” The smell of soggy nuts and sickly sweet raisins was turning her stomach. “It’s just . . .” She gave a hard swallow and felt the antibiotic knuckle its way down her chest. “How can you eat after what happened?”\\n\\n She expected an explosion, but Sharon only swallowed, shrugged, said, “Me starving isn’t going to help that little boy. He’s dead, and I’m sorry about that, but I’m not dead and neither are you. Now get some food in your stomach. You look like shit.”\\n\\n “What do you care if I eat?” Alex gave her a sidelong glance. “If I don’t, it’s just that much more for you, right?”\\n\\n “That’s true, but you’re smarter. If I get hurt, you know what to do. I’m hedging my bets. So here.” Sharon tossed her an MRE. “Eat that before I force it down your gullet like my grandpa did his geese.”\\n\\n “Geese?”\\n\\n “Yeah.” Sharon snorted. “He thought he was going to get rich making that Frenchie food, outta liver?”\\n\\n “Pâté.”\\n\\n “That’s it. He had this big metal tube.” Sharon’s hands bracketed a good foot of air. “About yay long. I had to hold the goose’s head while he shoveled in the grain. Maybe two pounds of feed, four times a day? Poor things, they would struggle and choke . . . used to make me cry. That old man never did get rich neither. He was so impatient he ended up with more geese with busted guts than ones he could carve the livers out of. Near about went broke on that scheme, and good riddance to bad rubbish. But I got in plenty of practice with force-feeding. I don’t think you want to find out just how much.”\\n\\n That, Alex thought, was about as close to an apology as she would ever get from Sharon. Alex’s eyes skimmed the label of the MRE: spaghetti with meat sauce. Just the thought of wormy noodles swimming in red sauce made her stomach lurch. But she forced her trembling fingers to work open the box and pouches. The MRE came with a heater pack, but when she tried adding water, she slopped it onto her jeans.\\n\\n “Whoa, whoa, hang on. Let me do it.” Deftly plucking the MRE and heater pack from Alex, Sharon added water, then slid the MRE into its heater pouch. “You worried about that boy, Daniel? Think they’re carving him up, too?”\\n\\n A bald way to put it, but this was Sharon. “I doubt it. They always make us watch, like they did with . . .” She paused. “I just don’t understand why they haven’t put him here with us. What could they want with him?”\\n\\n “How about information? You heard the boy: ambushing those bastards was his idea. So maybe they think they’ll get more out of him. If I was them, that’s what I’d do. Except”—Sharon’s face puckered in a frown—“I don’t know how. They aren’t exactly the talkative types, you know what I’m saying?”\\n\\n This was true, but Daniel had said something important to the Changed: You said you’d let him go. What had he meant? The Changed made occasional sounds, but they didn’t speak. She didn’t know if they could. Maybe the speech centers in their brains had shorted out. So how could—how did—the Changed say anything to someone who hadn’t become one of them? She understood them, but only sort of and occasionally, and even that was mediated only by smell and those weird slip-slides. What she got was more inference than anything else, which wasn’t the same as an actual exchange of information, and Wolf had never given any indication that he understood her. What she had with the Changed was like a bizarre kind of empathy, like a sixth sense that was growing stronger.\\n\\n Because she was Changing?\\n\\n No. Even as she thought that, she felt her mind working to shove the idea away. No, it’s been too long, and Tom said that when his friend, Jim, began to Change, he got confused; he forgot things.\\n\\n But she already knew that the Change didn’t happen to little kids or older people, and kids hadn’t Changed at the same rate. Some Changed right away, within minutes, on that first day, while others went for days. Which might mean that how you Changed depended on who you were. A boy’s hormones weren’t the same as a girl’s; the brain of a little kid wasn’t the same as that of a fourteen-year-old. Her scrambled mind had about as much in common with a normal person’s as a cat did with an orangutan.\\n\\n Or maybe the Zap had triggered something in the monster. Kincaid said there was no telling if the monster was dead or dormant—or still alive but morphing, maybe even evolving. Organizing itself was how Kincaid put it.\\n\\n But God. The idea of it actually becoming its own thing brought the gooseflesh to her arms, and she felt a shiver work its way up her spine. That was just a little creepy. But it could happen. When she’d been diagnosed, she’d read a ton. Anything by Oliver Sacks she embraced like a bible. So she knew that, for reasons doctors didn’t understand, certain tumors became things: grew their own teeth and skin, sprouted hair and cartilage and eyeballs, like little mini-me’s. Completely freaked her out.\\n\\n Tumors caused seizures, too, especially as more and more of the brain was either taken over by tumor or squished and shoved and elbowed out of the way. Seizures might trigger out-of-body experiences, which were, exactly, what she’d experienced.\\n\\n So, in the end, the only thing her switcheroos might prove was that the monster was sending up a little red flare to signal the end of this particular game: two-minute warning, sweetheart. Which meant her choices about what to do weren’t that different from before this nightmare began back in October, when she’d run off to the Waucamaw: she could stay on the train—go to the very end of the line where those tracks would give out—or jump off.\\n\\n “But I heard of this going on,” Sharon continued.\\n\\n “What?” She was so deep in her own thoughts that she had to work to tease out the thread of their conversation, and then realized she really had no idea what the older woman was talking about. “What going on?”\\n\\n “Bands of kids fighting those monsters. Makes sense when you think about it. The kids who haven’t turned—they’re the only ones fit enough to track the Chuckies. Don’t get me wrong; I can point and shoot, but heading out through the snow, skiing and camping out . . .” Her lips twisted in a wry, self-deprecating grimace as she tugged at a flaccid wattle beneath her jaw, deforming the tired strands of that spiderweb tattoo. “A little too much meat, and a few too many years.”\\n\\n “What about in your group, the people you lived with before?” Alex asked. “Did some of you fight? Were there kids?”\\n\\n Sharon busied herself readying another MRE. “Not really. All our kids—well, grandkids, mostly—they turned. The three who didn’t were practically babies. The rest of us were too busy scrounging around for food and staying warm to worry much about fighting.”\\n\\n All our kids turned. She bit back the urge to grill the old woman on just how that happened and what the signs were. What would it be like to watch your grandchildren Change? What would you do? Kill them? There had to be some adults who just couldn’t pull the trigger, or who wouldn’t give up hope. But then it would be as Larry had said a thousand years ago in the Waucamaw: how do you live with yourself afterward, either way?\\n\\n She chose to leave it alone. “Do you know anything else about kids like Daniel? The ones who are fighting?”\\n\\n “No, but we figured they got to have some older kids like him or adults, if only to teach them how not to blow their heads off. Here.” Sharon handed Alex the cardboard box containing her packet of spaghetti and meatballs. “Eat up while it’s hot.”\\n\\n The cardboard box was soggy and the packet inside just the near side of scalding. Carefully, she tweezed the pouch apart. Fiddleheads of steam unfurled in a stomach-churning stench of hot plastic and stewed tomato. Inside, the noodles shimmered in a slick, oily, copper-colored ooze, like ropy nerves and torn veins in a puddle of old blood.\\n\\n “Something wrong with that spaghetti?” Sharon asked.\\n\\n Maybe I am cooked and stick-in-the-fork done, or pretty close. “No,” Alex said, and shoved in a squelchy mouthful of oily pasta. But I’m not there yet, and when it’s time, it’ll be me that does it, not Spider or Leopard or anyone else.\\n\\n “It’s great.” She chewed those noodles to glue. “Just great.”\\n\\n An hour later, the Changed came for her.\\n\\n 44\\n\\n The reek of sex and booze hit a good hundred yards from the front door of the old Victorian, while she was still shuffling after Slash through the snow. Yup, Saturday night, and time to get down, get dirty, get funky. Not that she’d be partying. She studied Slash’s back as the girl lumbered against the wind. The girl’s scent was more sour than ever but void of useful information. Alex had been mystified until Slash toed the medical supplies Alex had gathered into neat piles.\\n\\n “Looks like they want you to play doctor,” Sharon had observed, then gestured toward the stash of pills. “Leave me a bunch of them painkillers and sleepers, you don’t mind. Just in case Ruby wakes up.”\\n\\n “Sure.” The rest—gauze, bandages, sterile packs of instruments, ointments, a bottle of peroxide—Alex shoveled into a camo pack. “But go easy. Ruby’s pretty small. You don’t want to overdose her.”\\n\\n “Don’t you worry. I’ll take care of both of us. Now you go on and do what you have to. And Alex?” Sharon’s eyes had battened on hers for a long, disconcerting moment. “That boy, Daniel . . . he’s just lost his little brother. He’s got some dark days ahead. No matter what comes down the pike, you stick by him.”\\n\\n She had said something noncommittal, like okay, sure. But what had that been about? She would help Daniel. No problems there. But if they were taking her to Beretta, they had another thing coming. That kid could rot for all she cared. Besides, if she helped them, that brought her one step closer to being them. \\n\\n","sourceLink":"https://allnovel.net/shadows-ashes-trilogy-2/page-30.html","bookId":2565,"book":{"id":2565,"title":"Shadows (Ashes Trilogy #2)","description":"Storyline: Shadows (Ashes Trilogy #2) \\n The Apocalypse does not end. The Changed will grow in numbers. The Spared may not survive. \\n Even before the EMPs brought down the world, Alex was on the run from the demons of her past and the monster living in her head. After the world was gone, she believed Rule could be a sanctuary for her and those she’d come to love. \\n But she was wrong. \\n Now Alex is in the fight of her life against the adults, who would use her, the survivors, who don’t trust her, and the Changed, who would eat her alive. \\n Welcome to Shadows, the second book in the haunting apocalyptic Ashes Trilogy: where no one is safe and humans may be the worst of the monsters.\\n","cover":"https://allnovel.net/images/shadows-ashes-trilogy-2.jpg","author":"Ilsa J. Bick","type":"Horror","source":"allnovel","link":"https://allnovel.net/shadows-ashes-trilogy-2.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 5, 2019 5:45:51 PM"}}
