{"id":91093,"no":4,"title":"Page 4","content":"\\n\\n She drove for Spider, saw the other girl’s flinch and look of utter shock—and that answered an important question. The Changed might read each other, but they could not read her.\\n\\n Breaking from her paralysis, Spider brought the corn knife up and around in a wide, curving arc. At the very last second, Alex flicked her wrist and changed her line of attack, driving for Spider’s chest now instead of her face. Spider tried to adjust, but momentum was her enemy now. The corn knife whizzed past and sliced only air.\\n\\n Alex bulleted into her. The blunt curve of the hook speared Spider’s chest, dead-center and hard enough that Alex felt the impact shiver up her arm and ball in her shoulder. Spider let out a loud ungh, and then she was backpedaling, trying to bring the knife down again. Alex saw the blade coming, and she uncoiled, swinging the pack in a deadly roundhouse, the weight of it like a heavy stone. Her eyes never left the corn knife, and she had just enough time to think how lucky she was that the blade wasn’t double-edged.\\n\\n There was a hollow thud as the pack hammered the girl’s chin. Spider’s head snapped back, and then the girl was spinning away in a swirl of blonde hair and wolf skin. Off-balance, Alex tried to pivot, but the tamped snow was slick. She felt the slide start; fought to regain her balance but couldn’t find it. The snow blurred, rushed for her face as she fell, the hook driving into hard pack. The snow had some give but not a lot, and she screamed as the impact shuddered through bone and wrenched her right shoulder. She lost her grip on the hook, and then she was gasping, on her side: left hand still knotted in her pack; her right hand on fire, the wrist singing with pain, the fingers already numb. Oh God, oh God, is it broken, did I break it . . . where’s Spider, where . . .? She pulled in a frantic, sobbing breath. Her right elbow bawled; she couldn’t move her fingers. Broken or cracked or maybe the nerves, and oh God, where is Spider, where is she?\\n\\n Her head swirled with panic and pain. Both nearly killed her. As it was, she only just felt the attack coming, sensed it before she knew what was happening: a shuffle, the scuff of a boot in snow, a sudden rush of air. She snatched her head back just in time to catch a blur of white and black.\\n\\n Spider: on her feet, rearing up, looming. Her lips curled, baring teeth that seemed very white and impossibly sharp. That girl could tear a person’s throat out with those teeth.\\n\\n Where’s the knife, where’s the knife, where is it? Her eyes jerked to Spider’s right hand. Empty. Nothing there, no knife, no knife, where is it? Had she dropped it? But Spider’s stance was all wrong; she was leading with her right shoulder, shuffling forward, her silver eyes flitting to a spot behind and to Alex’s right. What? The knife was behind her? Alex started to crane around for a peek. If I can get to it first—\\n\\n Then she thought, Wait, leading with her right. She gasped. Left hand . . . she switched hands!\\n\\n Screeching, Spider brought the corn knife down in a vicious, left-handed chop. For a split second, all Alex could do was watch that blade come—and then, at the very last second, shock let her go. Releasing her pack, Alex snatched her left arm out of the blade’s line and tried to roll. The blade cleaved air with a whistle, swishing past her ear to cut snow, the steel so close that Alex smelled the lingering copper of old blood and even the ghost of sweat from the farmer who’d once hacked at thick, stubborn stalks in September when the harvest was done.\\n\\n Alex had the luxury of a half-second to think: Close.\\n\\n And then there was pain, a lot of it, ice and fire roaring up her throat to crash out in a shriek. Twisting, she saw the corn knife buried up to the handle—and blood spraying a crimson starburst. Spider’s knife had sliced a long strip of skin and meaty muscle that now dangled in a grotesque flap from Alex’s left shoulder. Spider’s face, drippy with blood, swam into view, and then Alex saw the knife coming up again—\\n\\n “No!” Still turtled on her back, Alex tucked and kicked and jackhammered her right boot into Spider’s face. There was a splintery, crackly sound. The girl’s head whipped back with a brisk snap, like a crash dummy’s, and her jaws clamped with a dull thock. Spider let out a gargling, bubbling screech.\\n\\n Most important of all, Spider lost her grip on the knife.\\n\\n Knife, knife, the knife, her brain yammered, go for the knife! Alex moved. Rolling, she planted her boots, clawed to her feet. Where’s the knife, where is it? She threw a fast glance left, and there it was, smeary with blood, just a few feet from the skulls.\\n\\n Really, it came down to who was faster.\\n\\n Alex plunged across the snow, her left shoulder still singing, blood slicking her wrist, her heart banging a wild, frenzied beat. Reaching down, she made a grab, felt her fingers curl around the wooden handle, and then she was jamming her right boot into the snow, pivoting, the grinning skulls blurring as she swung around, started to sweep up, elbow cocked, knife in hand—\\n\\n What she saw next stopped her dead.\\n\\n Something round and black and empty as a socket in a sightless skull hung less than six inches from her face.\\n\\n A red fan of horror unfurled in her chest.\\n\\n Nathan’s rifle.\\n\\n And then Spider squeezed the trigger.\\n\\n 3\\n\\n Snick .\\n\\n No boom.\\n\\n A half-second later, she realized she was still alive.\\n\\n A jam? A misfire? There was a round in the breech; Nathan had said so. Whatever. Didn’t matter. She heard Spider suck in a surprised gasp, caught a glimpse of Spider’s eyes going round—\\n\\n Alex’s right hand flashed. The thick blade clanged against the Browning’s barrel, knocking the bore aside. The impact tumbled the knife from her fingers to the snow. No time to sweep it up again; she had to keep the business end of that rifle out of her face. Instead, she sprang for the barrel, got her hands around it, and yanked.\\n\\n Recovering from her surprise, Spider did the smart thing. She didn’t try wrestling the rifle away but drove forward. Scuttling back on her heels, Alex tried keeping her balance, but Spider was strong, with two good arms, and Alex knew this was one battle with gravity she would lose.\\n\\n She teetered, the trees swirling as the world canted and slewed. Spider swept forward with one leg, hooking Alex’s ankles, sending Alex crashing against the pyramid. Pain rocketed up Alex’s spine. She felt the skulls shift as the upper tiers toppled with dull clunks like marbles rattling onto wood. The lower levels, cemented with iced blood and frozen gristle, made for a sturdy, very convenient platform, and Spider knew it. Stiff-arming the rifle, the girl bore down, trying to grind the barrel against Alex’s throat. Spider wasn’t as tall as Alex, but she also wasn’t hurt as badly, and gravity was on her side. Alex’s arms began to shudder as her overstrained muscles weakened. Blood pattered onto her lips and into her eyes from Spider’s ruined nose.\\n\\n All at once, Alex’s elbows gave. She had nothing left. The rifle came down as savagely as a guillotine. She felt a sudden grab of panic as her air cut out and her vision purpled. It was the parking lot all over again, only this time she had no knife and Tom would not come to her rescue. She bucked, but her feet dangled and she had no leverage.\\n\\n So she did the only thing left. She went limp, half by instinct, half by design. Stopped pushing, stopped flailing. Just . . . let go.\\n\\n She heard Spider gasp as the girl fell into her. Quick as a snake, Alex craned, lashed out, and sank her teeth into Spider’s left cheek. Spider jerked, and then she was wailing. The pressure on Alex’s throat was suddenly gone as Spider reared back so far that Alex’s head lifted from the ruined pyramid. But Alex didn’t let go. Sucking air through her teeth, she sawed her jaws from side to side. Alex felt the sudden give as Spider’s skin tore, and then she was into muscle. Spider’s blood, warm and brackish, bubbled into her mouth. Something ripped with a sound like wet cloth tearing in two. Bellowing, Spider stumbled back, one hand with its bracelet of colored rag clapped to her spurting cheek.\\n\\n And Alex had the rifle now.\\n\\n She surged to her feet. Her mouth was filled with Spider’s blood and a meaty chunk of the girl’s cheek. Alex spat, never taking her eyes from the girl, and then she was winding up like a batter and swinging, hard and fast The butt whirred, cleaving air. At the very last second, Spider sensed it coming; flinching, she ducked and made an abortive move to the right, which probably saved her life. The stock smashed into Spider’s left temple with a loud, hollow sound like a heavy butcher’s knife against a cutting board. Spider’s head whipped right as jets of blood flew in long tongues. Spider’s silver eyes rolled up to whites as her knees unhinged, and then the girl collapsed to the snow like a sack of soiled laundry.\\n\\n Dizzy with pain, Alex swayed over the girl. Spider’s face was a mess. Blood painted her jaw, and more streamed from the girl’s nose, fiddleheads of steam curling into the still air where hot blood melted into snow. Spider’s breath came in long, bubbling snores.\\n\\n End it. Alex’s stomach curdled at the taste in her mouth, sour and puckery with dying blood, the raw meat of Spider’s flesh, and the lingering, metallic tang of spent adrenaline. Her throat felt like the neck of a vase, every swallow bright and glassy. A high, whining buzz competed with the boom of her heart, but not so much that she didn’t hear the crunch and squeal of snow and knew: the others were coming for her.\\n\\n Kill Spider at least. Put a bullet in her head and then take one of them in the bargain. Tom wouldn’t go down without a fight, and neither would Chris. Fight, damn you. Don’t make it easy.\\n\\n Her grip tightened on the rifle, but then she remembered something: the look on Spider’s face at the moment the Browning hadn’t fired. The rifle was loaded with .270-caliber Magnum shorts and one already in the breech. She’d seen it herself. If she tried again, the weapon might very well explode in her hands. People died like that, too. She could use the rifle as a club, keep them at bay, but all they had to do was wait for her to tire herself out.\\n\\n Has to be another way. The useless rifle slipped from her fingers. There has to be something I can do. But what? They had superior numbers. From the looks of this place, hers was a scenario they’d watched unfold a hundred times before. Well—she flicked a quick glance at the gurgling Spider—maybe not. Beating Spider hadn’t bought her anything except a little more time. \\n\\n","sourceLink":"https://allnovel.net/shadows-ashes-trilogy-2/page-4.html","bookId":2565,"book":{"id":2565,"title":"Shadows (Ashes Trilogy #2)","description":"Storyline: Shadows (Ashes Trilogy #2) \\n The Apocalypse does not end. The Changed will grow in numbers. The Spared may not survive. \\n Even before the EMPs brought down the world, Alex was on the run from the demons of her past and the monster living in her head. After the world was gone, she believed Rule could be a sanctuary for her and those she’d come to love. \\n But she was wrong. \\n Now Alex is in the fight of her life against the adults, who would use her, the survivors, who don’t trust her, and the Changed, who would eat her alive. \\n Welcome to Shadows, the second book in the haunting apocalyptic Ashes Trilogy: where no one is safe and humans may be the worst of the monsters.\\n","cover":"https://allnovel.net/images/shadows-ashes-trilogy-2.jpg","author":"Ilsa J. Bick","type":"Horror","source":"allnovel","link":"https://allnovel.net/shadows-ashes-trilogy-2.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 5, 2019 5:45:51 PM"}}
