{"id":104024,"no":52,"title":"Page 52","content":"“I like this way of dealing with them much more,” Cormier answered as the carrier accelerated forward. Grinning, Maria answered, “So do I.” The carrier left a large swath of blood, gore and body parts in its wake. The bonfire burned brilliantly against the backdrop of the blue mountains rising above the valley. They had utilized the carrier’s plow to build an enormous bonfire. The Scourge bodies smoldered and the stench of their cooking flesh made Maria’s eyes water. Shocked, she lifted one hand to her eyes. “Denman,” she gasped. Turning, he gazed at her curiously. She pointed to her eyes. Denman gaped at the tears trailing down her cheeks. He reached out and swabbed the corner of her eye with the tip of a finger. Looking around at the remaining squad members, Maria saw they were unaffected by the fire. Denman rubbed the tear between his gloved fingers, then drew out his med-pad. In silence, he scanned her as she waited impatiently. “What’s happening to me?” Maria asked finally. Denman shook his head. “I don’t know. I’m reading miniscule changes but nothing like what Jameson was going through. Should I report this?” Maria pondered his question and abided her instincts. “Not yet.” They were probably a few weeks away from clearing the valley if they could maintain their pace. “Just keep me informed.” Maria relished the feeling of being at a work station doing something other than destroying the Scourge. Maria and the Chief Defender were plotting out the final push against the Scourge. They had numbers from the SWD on how many Scourge the squad was clearing on a daily basis on average and how many remained; therefore, they could estimate how much longer it would take to wipe out the rest of the hordes. Omondi’s image was located in a corner of her work station screen. “It appears we’re looking at two more weeks until completion of the mission.” “The number changed slightly with Jameson out of the picture. He was our most efficient killer.” “We’ll make up for his absence with taking only one hour of torpor a day.” “The last psych exam Denman gave us says we’re all on the verge of mental exhaustion. Can we risk pushing ourselves even harder?” Maria tilted her head so she could see Omondi’s face. It was emotionless as usual. She rarely saw the man smile. “SWD is adamant that we continue around the clock.” Omondi rubbed his chin. “I just don’t know how we can reach their projected end date otherwise. They’re unyielding that we meet that date.” Maria studied the various bits of information displayed on her screen. “Are they certain about the Maelstrom Platforms?” “Yes, they’re going to destroy all the Scrags around the wall once we clear out everything else.” “They want a big final bang, don’t they?” Maria smirked. She could imagine the news vids now. The platform guns destroying the last of the Scourge gathered around the wall. Of course, there would be no vids of the long endless days they had spent destroying the Scourge. “We have our orders.” Omondi studied the numbers on his pad. She could see the weariness around his eyes. “We will soon be done with all of this and it will be just a nightmare to be forgotten.” It was the most human thing he had said in a very long time and Maria was glad to hear it. It was a strange solace that he too was affected by the endless killing. “How are you progressing toward the hydroelectric plant?” “Steadily making progress. I estimate we’ll make it there in the next three days. We had to clear out a massive gathering of Scourge near one of the old subway stations.” “I just don’t understand why we have left the hydroelectric plant until last,” Maria said, tapping her finger lightly on the screen. “With the energy shortages I would expect it to be one of the first places we would clear.” “We started near the gate because that was where our first objective was located,” Omondi answered, lifting his shoulders dismissively. “Any word on Jameson?” She had been putting off asking the question, trying to avoid any topic that might annoy her commanding officer. He was very good at avoiding giving her direct answers. “Psychotic break. His mind had difficulty believing he no longer had to eat. He became obsessed and...” Omondi mimed breaking something in half. “Dr. Curran will be sending Denman some guidelines to help identify any warning signs in the rest of the squad.” The bold-faced lie left Maria stunned, but she managed to maintain a neutral expression. The SWD was either lying to Omondi, or had told him to lie about Jameson’s condition. Certainly the SWD knew that Denman and Maria were intelligent enough to discern that the readings they had taken of Jameson were not the norm. Maria decided to push just a little and see how deep the lies were. “Do they have any theories as to why that one Scrag tried to eat Jameson?” It was if an invisible blast door slammed down between them. Omondi was suddenly an ebony statue staring at her in cold silence. She was very glad he was far away and only an image on her screen. “The Scrags are rabid undead monsters. We cannot assume to know everything about them considering how long we’ve been trapped in the city. Keep that in mind, Vanguard Martinez.” “Yes, sir,” Maria said softly. Denman was watching her from his console. The rest of the squad was in torpor, but she had kept Denman awake. They had both been hoping for answers to Jameson’s condition. There was terse silence for a few more minutes as Omondi transmitted new orders to her console and Maria reviewed them. “We can continue utilizing the carrier for at least a day,” Maria decided. “Once we hit this area there will be too many Scrags to risk it.” “Agreed,” Omondi answered. “We’ll speak again tomorrow night. Dismissed.” The feed was cut off abruptly. Maria sighed wearily. “Do you think he’s lying for them? Or are they lying to him?” Denman asked. Shrugging, Maria settled back in her chair. “I’m not sure about any of this anymore.” Denman rubbed the top of his head, mussing his short brown hair. “We’re doing the right thing clearing the valley.” “I agree.” “But I strongly suspect the SWD didn’t fully understand the modified virus they gave us. We’re their grand experiment.” “Their greatest success so far,” Maria said. “I am concerned about what happened to Jameson and your tears.” “I’m not hungry.” “Not yet. So far all the tests have shown is that the virus is now allowing your body to produce tears and saliva. Nothing else has changed.” “It’s nice not having a dry mouth,” Maria observed, smiling slightly. “But why this change? Why now?” Denman clutched his fist, pressing it to his lips. “This isn’t making sense.” “I’m dreaming.” “What?” “I’ve been dreaming for a week.” He stared at her incredulously. “Are you sure?” “Maybe.” She shrugged. “I feel different when I revive. More alive.” “I should set up a scan for when you enter torpor.” They both started when Maria’s console beeped that there was an incoming message. She answered immediately and was surprised when Dr. Curran’s face filled the screen and not Chief Defender Omondi’s. “Dr. Curran, this is unexpected.” “Vanguard Martinez, I’m glad I caught you before you entered torpor.” Like Dwayne, the doctor appeared to have aged in the last few months. Dark circles shadowed her eyes and the lines around her lips had deepened. “How can I be of service, Dr. Curran?” Maria tried to keep her voice neutral, but a hint of her hostile feelings toward the doctor crept into her words. Dr. Curran gave her a weary, yet sardonic smile. “I am contacting you for a variety of reasons. I should let you know now that we are on an encrypted channel and no one knows I have contacted you directly.” Maria lifted her eyebrows. Questions flitted across her mind, but she opted not to speak, and just listen. It was best to be silent and allow Dr. Curran to say her piece. Maria was far too on edge to be truly civilized. Dr. Curran waited for Maria to speak, but when she didn’t, she plunged ahead. “I am still examining Special Constable Jameson and have fully reviewed the scans and reports you sent me. This was the first I was informed of Special Constable Jameson being attacked and bitten by one of the Scrags.” “I sent a detailed report to the SWD when it occurred,” Maria protested. “As I said,” Dr. Curran said rather crossly, “this is the first I have heard of the attack on Jameson.” “Did you hear about the attack on me?” “Were you bitten?” “No, but the Inferi Anomaly who attacked me tried to bite me. He also spoke. Just like the one who bit Jameson.”","sourceLink":"https://allnovel.net/the-last-bastion-of-the-living/page-52.html","bookId":2486,"book":{"id":2486,"title":"The Last Bastion of the Living","description":"Storyline: The Last Bastion of the Living: A Futuristic Zombie Novel As long as the undead hordes of the Inferi Scourge howl outside the dying city, the last remaining humans struggle to survive inside The Bastion. Vanguard Maria Martinez has lived her entire life within the towering walls. Her only refuge from the overcrowded streets, rolling blackouts, and food shortages is in the arms of Officer Dwayne Reichardt. Then Maria is summoned to meet with a mysterious representative from the Science Warfare Division and is offered the opportunity to finally destroy the Inferi Scourge and reclaim the land and resources in the valley beyond the wall. If she succeeds, the city may be saved. But if she fails, humanity faces extinction…","cover":"https://allnovel.net/images/the-last-bastion-of-the-living.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-last-bastion-of-the-living.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:32:28 PM"}}
