{"id":104027,"no":55,"title":"Page 55","content":"\n “I like it,” Maria said, nodding.\n “The trick is not getting hemmed in.”\n “I think we might have a solution,” McKinney said from behind them.\n Holm held up the compact flamethrower they used to incinerate the bodies. “I say we burn them alive.”\n “She’s kind of a genius,” McKinney said with a grin.\n “If I was a genius, I would have thought of this before.” Holm set the flamethrower down on the floor, kneeling beside it. “We have twenty of these and the fuel for them is stored in this vehicle, right?”\n “You’re thinking of creating bombs?” Maria arched her eyebrows.\n “No, sir. Actually one big flamethrower.” Holm motioned to McKinney, who handed over his flamethrower. She set them side by side. “Like most Bastion weaponry, these are pieces of shit, old as hell and equally clunky. But they were created to store easily and save space.” Holm hooked the flamethrowers together using the clasps that were used to secure them in storage units. “I say we string these babies together, bind them to the top of the carrier and use them to burn anything trying to follow us. That’ll slow them down for sure.”\n Maria grinned slowly. “Cormier can you outrun and outmaneuver a mass of burning Scrags?”\n Cormier smirked. “Hell yeah. I’ve been studying the scans for hours. I know exactly where I need to go. We will not have a repeat of that first day.”\n “Then let’s make this happen!” Maria ordered.\n “Yes, sir!” Holm, McKinney, and Cormier all answered.\n Maria’s work station paged her just in that moment. Leaning over, she opened the feed. To her surprise, Dwayne’s face filled the screen.\n “Vanguard Martinez, we’ve noted that you are en route to the hydroelectric station,” he said crisply.\n “Yes, sir,” Maria answered in a cautious voice.\n Near her, her three squad members looked pensive.\n Dwayne’s expression was pure business and she felt slightly intimidated. It had been a long time since she had interacted with him as her superior officer.\n “And why is that?”\n “Chief Defender Omondi and his squad are pinned down. We’re on our way to rescue them,” Maria answered, sliding into her chair. She wasn’t sure if a reprimand was on the way, but she was ready to kill the feed and disobey him. She would rescue the others.\n “Very good. I’ve been asked to coordinate the rescue effort with you,” Dwayne said, a slight hint of warmth entering his gaze.\n “That’s the best news I’ve heard all day,” Maria said with relief.\n “Let’s discuss logistics and exactly what will be required for this rescue,” Dwayne continued.\n “What’s required is weapons,” Maria said. Sliding the dagger out of her armor, she held it up. “This is not going to hack it against creatures armed with projectile weapons.”\n Lifting his eyebrows, Dwayne inclined his head in agreement. “I’ll see what I can do.”\n Chapter 27\n “The situation is grave,” Dr. Curran said. “Chief Defender Omondi has lost most of his squad and the Anomalies have him trapped. They’ve retreated to the basement shelter, but are now pinned down.”\n The men and women seated around the table, all members of the government, upper echelon of the SWD, and the president’s council, shifted uncomfortably at her words. Dwayne’s own daughter, Caitlyn, was seated behind the Vice President. She was studiously taking down notes and ignoring her father. Dwayne respected his daughter’s professionalism and directed his attention to the doctor seated across the conference table. A holographic image of the hydroelectric station slightly obscured his view, but he didn’t need to see Dr. Curran to know she was afraid. It was in her voice.\n “Is that what we’re calling them now? Anomalies?” Mr. Petersen scoffed.\n “Would you prefer we call them your previous failures?” Dr. Curran answered briskly.\n Mr. Petersen started to retort, but the president said, “Enough squabbling. Keep to the facts at hand, Dr. Curran.” President Cabot’s voice was as stiff as his manner. He was angry, his usually-amicable public face set into a stern expression.\n Mr. Petersen sat back in his chair, but said nothing.\n “Chief Defender Omondi and his squad were our best chance to wipe them out. The Anomalies are a growing danger to this city. The recent breach into the subway tunnels proves this,” Dr. Curran continued. “A breach, I would like to point out, that I was not aware of until today.”\n “You’re told what you need to know,” Mr. Petersen said with a reptilian smile.\n Dwayne had met the man only a few times previously and didn’t care for his manner. Though Mr. Petersen was at the heart of the SWD mission, Lindsey’s deep forays into the SWD system had not revealed one shred of information on Mr. Petersen. That was the perfect reason to fear him. He was most definitely SWD Black Ops.\n “The Inferi Anomalies, as you call them,” the president said, motioning to the hologram, “are only at the hydroelectric plant?”\n “That is uncertain,” Mr. Petersen admitted.\n “They’re congregating there because it’s the most vulnerable access point into the city and they know it,” Dr. Curran said crossly.\n “Why didn’t we clear that area first?” President Cabot glowered at the silent people at the table.\n Again the men and women who held the greatest power in The Bastion averted their eyes and shifted about in their chairs. They were obviously ill at ease with the discussion. There was a desperate aura about them. Perhaps they, too, were terrified of the days to come if the Inferi Boon failed.\n “We didn’t know the Anomalies still existed,” Mr. Petersen said after an uncomfortable pause. “After their last push into the sewers, we killed most of them. We did an inventory of the dog tags collected and all but five were accounted for.”\n “May I point out that this information was kept from me and I am hearing it for the first time now,” Dr. Curran said, her steely gaze fastened on Mr. Petersen.\n “This mission was doomed from the start.” Commandant Pierce’s tone was icy and her dark eyes were cold as she regarded Mr. Petersen. “You kept me and the Castellan out of the planning stages of this mission. We’re only here because you need our help to salvage what is left of your plans.”\n “The SWD’s primary mission is to destroy the Inferi Scourge. Your mission is to protect the city,” Mr. Petersen said in a voice that was slightly on edge. “There was no need to include you in our mission.”\n “Yet you conscripted the best of our people to do the actual dirty work,” Dwayne pointed out.\n “SWD security is also part of the mission. In fact, Chief Defender Omondi’s squad that was nearly destroyed today are all SWD personnel.” Mr. Petersen looked equal parts smug and contrite.\n President Cabot pointed a finger at Mr. Petersen. “I was told that you would have the valley ready for the big final push within the week.”\n “Mr. President, there have been—,” Mr. Petersen started to answer.\n “What is the Constabulary doing to resolve this issue, Castellan?” the president asked, directing his focus to Dwayne. “I understand you were brought in once we lost contact with Chief Defender Omondi.”\n “Vanguard Martinez and her squad, consisting of Constabulary soldiers, are on their way to the hydroelectric station to rescue the Chief Defender and his team,” Dwayne explained. He had spent most of his morning receiving intel from the satellite feeds and observing Maria’s trek across the cleared valley toward the last infested area.\n “Any ideas as to why we lost contact with Chief Defender Omondi?” the president asked.\n “We lost contact with the chief defender’s squad soon after he reported that the Inferi Anomalies had ambushed him and his people at the hydroelectric station. We believe he fell back to the basement shelter after communication became an impossibility.”\n “But we are in communication with Vanguard Martinez?” the president asked.\n “We are.” Dwayne could see that the president was pleased to have direct answers. It was clear that the power struggle between Dr. Curran and Mr. Petersen was annoying the president.\n “Will we have a quick resolution to this issue?”\n Dwayne caught the president’s slight shift in his weight toward him and the commandant. He was starting to freeze out the SWD, which was exactly what Dwayne and Commandant Pierce wanted. “By the time we spoke with Vanguard Martinez, she and her squad were already on their way and had a solid rescue plan.”\n “Vanguard Martinez has requested that we airdrop weapons for them to use against the Inferi Anomalies,” Commandant Pierce added.\n “I would advise against that,” Mr. Petersen interrupted. “We have the Inferi Scourge exactly where we want them for our big…finale. If we send out aircraft now, we could pull the Inferi Scourge out of the range of the Maelstrom Platforms. That would mean we would have to have the Inferi Boon kill off any of the stragglers and—” \n","sourceLink":"https://allnovel.net/the-last-bastion-of-the-living/page-55.html","bookId":2486,"book":{"id":2486,"title":"The Last Bastion of the Living","description":"Storyline: \n The Last Bastion of the Living: A Futuristic Zombie Novel \n As long as the undead hordes of the Inferi Scourge howl outside the dying city, the last remaining humans struggle to survive inside The Bastion. Vanguard Maria Martinez has lived her entire life within the towering walls. Her only refuge from the overcrowded streets, rolling blackouts, and food shortages is in the arms of Officer Dwayne Reichardt. Then Maria is summoned to meet with a mysterious representative from the Science Warfare Division and is offered the opportunity to finally destroy the Inferi Scourge and reclaim the land and resources in the valley beyond the wall. If she succeeds, the city may be saved. \n But if she fails, humanity faces extinction…\n \n","cover":"https://allnovel.net/images/the-last-bastion-of-the-living.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-last-bastion-of-the-living.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:32:28 PM"}}
