{"id":103978,"no":6,"title":"Page 6","content":"His gut told him something was not right, and it took all his willpower not to rush down the steps and into the streets to find Maria. Closing down the screen of his wristlet, Dwayne looked up to see some of the other officers staring at their own orders with perplexed expressions on their faces. Sweat began to bead his forehead, not because of the muggy air, but because he suddenly feared that the Inferi Scourge had finally breached the walls. Chapter 2 The narrow hallway was stiflingly hot and the smell of boiling laundry was strong and acrid. Through the open door of one of the flats, Maria caught sight of two older women stirring a large stainless steel tub on a makeshift stove. Rose Bergman waved to her while Rose Garcia scowled into the mix of soap and water. Maria always thought of the sweet couple as ‘the Roses,’ but she found it easier to call them by their last names. “Be careful on the wall!” Ms. Bergman called out. “Don’t tell her what to do, Rose,” Ms. Garcia snapped. “You’re always so bossy.” “I’m showing concern for her wellbeing, Rose,” Ms. Bergman pouted. Feeling obligated to make an appearance, Maria stepped back into the doorway and waved. “I’ll be fine, Ms. Bergman. Thank you.” The older woman with the unruly silver curls smiled at her sweetly while Ms. Garcia scowled. The couple loved to squabble and Maria found it endearing. Both appeared to be in their sixties and wore their hair long under colorful headscarves. They worked long hours cleaning laundry for most of the people living in the building. Maria paid them in credits while others paid in food and other wares. “We’ll have your laundry ready tonight,” Ms. Garcia informed her. “We’re running a little behind. The blackouts set us back.” “We had to get out the propane stove,” Ms. Bergman explained. “It’s all good. I don’t need my things until tomorrow anyway.” The pungent fumes from the soap were making her eyes water and she suppressed a small cough. “We’ll drop it off at your flat tonight,” Ms. Bergman promised. Pulling out her wallet, Maria fished out a few credits. “Here let me pay you now.” “Oh, we couldn’t,” Ms. Bergman protested. Ms. Garcia plucked the money from Maria’s hand and thrust it into one of the pockets of her heavy apron. “Rose, we can’t!” Ms. Bergman chided her. “Not until we’re done with the job.” “You need your pills,” Ms. Garcia said, her heavily sweating face set with determination. She continued to stir the laundry, ignoring her partner. “It’s fine. Really.” Maria slipped out of the doorway. “You get your pills and I’ll see you tonight.” “Oh, Maria,” Ms. Bergman called out, rushing out after her. “I just wanted to thank you so much for all you’re doing.” “It’s no problem paying early.” “No, no, I meant about the speech last night. It was so wonderful to hear that we’re close to defeating the Scrags. It’s the first time in so long I feel any hope!” Ms. Bergman clutched Maria’s hands in her strong, callused ones. “I keep telling Rose that things will be so much better once the Scrags are gone and we can return to the outside world. I do miss it so.” Swallowing hard, Maria mulled over her words before responding. “We’re just doing our best out there. I do my part. That’s all I can say.” Ms. Bergman’s big blue eyes stared into hers searchingly. “We’re close to winning, aren’t we?” Her voice wavered slightly. Not wanting to see hope die in her sweet friend’s eyes, Maria squeezed her hand. “Of course. Closer and closer every day.” An enormous smile burst onto Ms. Bergman’s round face and she giggled like a girl. “I keep telling Rose that, but she is always so cantankerous.” “I can hear you!” Ms. Garcia called out. “Don’t worry. We’re doing our best,” Maria declared, letting go of the woman’s hand. Clapping her hands, Ms. Bergman rushed back into her apartment. “I told you, Rose! We’re winning!” Turning, Maria hurried down the hall, half-smiling as the two wives continued their argument. The door to the outside was propped open with a broken cement block in a futile attempt to circulate air through the hallway. She stepped out onto the metal staircase that led down to the street and held tightly to the handrail as she descended the creaking stairs. All the buildings in The Bastion had their primary entrances on the second floor. There were no windows or doors on the ground level of any of the buildings as a security precaution. The stairwells were collapsible, which was becoming a hazard as they grew rickety with age and the mechanisms sometimes gave away. Striding into the street, she immediately noted the lack of open stalls along her pathway. Usually people were hawking their wares and services as soon as the sun rose, but with the impending storm rolling over the high mountain summits the businesses would remain closed until it passed. No one could afford a loss of inventory. Most of the citizens of The Bastion were unemployed. Every citizen was provided with a home, rations, and basic living necessities from the city’s wares. Those who were able to find employment fared a little better, able to purchase services and wares with Bastion credits. But there were no opulent homes to save up for, no cars to buy, no luxury goods. Therefore, most of the citizens created their own work like the Roses had done with their laundry services. For the citizens who ran the stalls barter was a way of life. Maria was one of the few able to pay with credits. A drone rolled past her on its narrow treads, its screens flashing scenes of the military firing on the Inferi Scourge. Old footage, Maria noted. Soldiers patrolling the walls were not allowed to fire any of the precious ammunition stores unless absolutely necessary, and patrols outside of the walls didn’t exist. She sidestepped the drone and plunged down a busier side street. It was packed with government officials rushing to the monorail system to catch the train. Usually the final train scheduled to run in the morning was the least packed, but people always ran late during bad weather. The first drops of rain fell as she reached the stairs to the station. Clutching the slick handrail, she pounded up the metal steps. Her long braid felt heavy against her back as she pulled the hood of her gray uniform over her head. As she stepped onto the platform, a hand gripped her arm. She almost jerked away, then realized it was Dwayne. “I thought you left on the earlier train,” she said. Under the brim of his hat, his blue eyes were vivid and full of concern. “All my meetings were canceled for the day.” “Why?” Maria arched an eyebrow. “I’m not certain,” he said in a low voice, pulling her away from the rest of the commuters. “I think something is up.” Maria was startled to feel hope swell within her. “Do you think it’s true then? That we’re close to defeating them?” Dwayne exhaled slowly, then leaned toward her. “I think it may be that we’re not close to defeating them.” Sighing as the spark of hope died within her, Maria nodded her head. “And the president made so many promises last night...” “The brass may be scrambling to make his promises a reality. I’m not sure. I don’t rank high enough to be in the know.” Rain beaded on the visor of his cap, then trickled off. “Why are you going to be late tonight?” “I have a meeting after patrol.” She wanted to tell him it was with the SWD, but she didn’t dare with so many people milling about. Frowning, Dwayne glanced toward the wall. “Just be careful today. Something doesn’t feel right and it’s not just the storm.” The monorail train rushed into the station, gliding to a quiet stop. The doors on the sleek white train slid open and the waiting commuters surged forward. “Whatever is going on, we’ll deal with it,” Maria said. Dwayne smiled slightly. “We will.” Together, they moved toward the train, their shoulders brushing as they walked. Maria wanted to touch his hand or have him wrap his arm around her, but discretion was best. Inside the train, most of the seats were occupied, so she found a corner and grabbed hold of the strap above her head. Dwayne joined her, holding onto the pole beside him. The doors closed with a hiss and the train lurched into motion. The storm raged over the city, sheets of rain falling in great bands. Maria peeked out of the window and saw that most of the streets were empty. Lightning sliced across the sky as thunder rumbled. “It’s right over us now,” Dwayne noted. The buildings of the military complex rose higher than the rest of the city. They were ugly, dreary buildings, with black windows on only a few floors. The complex hugged the high wall and occupied a good portion of the southern part of the city. The government buildings nestled closer to the center were more impressive with sleek glass faces and more ornate styling. The capital building strongly resembled an elongated pyramid. The only ornamental garden in the city surrounded the capital. All the other parks or gardens that had been part of the original design of The Bastion had long been turned into housing complexes after the gate failed and the survivors from the valley had taken refuge inside the walls. As the train swept past the only part of the city Maria found even remotely attractive, she turned her gaze away. The building only reminded her of the president’s speech full of empty promises.","sourceLink":"https://allnovel.net/the-last-bastion-of-the-living/page-6.html","bookId":2486,"book":{"id":2486,"title":"The Last Bastion of the Living","description":"Storyline: The Last Bastion of the Living: A Futuristic Zombie Novel As long as the undead hordes of the Inferi Scourge howl outside the dying city, the last remaining humans struggle to survive inside The Bastion. Vanguard Maria Martinez has lived her entire life within the towering walls. Her only refuge from the overcrowded streets, rolling blackouts, and food shortages is in the arms of Officer Dwayne Reichardt. Then Maria is summoned to meet with a mysterious representative from the Science Warfare Division and is offered the opportunity to finally destroy the Inferi Scourge and reclaim the land and resources in the valley beyond the wall. If she succeeds, the city may be saved. But if she fails, humanity faces extinction…","cover":"https://allnovel.net/images/the-last-bastion-of-the-living.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-last-bastion-of-the-living.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:32:28 PM"}}
