{"id":65142,"no":29,"title":"Page 29","content":"“Hadley is responsible for that?” He pressed his hot face into her back. “Jesus …”\\n\\n “I don’t want to think about it now,” she complained. “Not here. Not while you’re inside me.”\\n\\n Alistair’s open mouth rubbed against her spine, his breathing rough. “I’ll make you forget.”\\n\\n She moaned her relief as he cupped her breasts, her thoughts scattering with the ocean breeze.\\n\\n “But I won’t,” he growled. “I’ll never forget.”\\n\\n Chapter 20\\n\\n Alistair assisted Jessica down from his town carriage and took comfort in the sight of the lump beneath her white glove that betrayed the presence of his ring on her finger. Behind him, the Regmont town house waited. The redbrick home was innocuous to passersby, but it contained something undeniably hazardous to him.\\n\\n He had no notion of what Jessica would do if her sister protested their nuptials. He had no notion of what he would do, since letting her go would kill him.\\n\\n “She only wants my happiness,” Jessica murmured, offering him a reassuring smile from beneath the brim of her straw bonnet. “It may surprise her to learn how wicked my inclinations are, but she won’t object.”\\n\\n He snorted. Clearly he’d lost all ability to keep his emotions hidden when they related to Jessica.\\n\\n Offering his arm, he escorted her up the short steps. He offered his card to the butler when the door opened and swiftly found himself in a cheery yellow parlor. He remained standing while Jessica sat. He was too restless to settle in any one spot and had no intention of lingering once Lady Regmont presented herself. They’d been in port only a few hours, and he had much to attend to. His London staff had been given no warning of his return, and so his home was not yet prepared for his residency. He had a note to pen to his mother, requesting a visit so he could tell her about Jessica. And another to send to Baybury.\\n\\n Impatience spurred him. There was too much to be done between now and when he and Jessica could officially announce their engagement.\\n\\n “Jess!”\\n\\n He looked toward the door as Hester rushed in and found himself speechless. It had been years since he’d seen her, and even then she’d inevitably been with Jessica, who always stole his attention. Still, he was certain Lady Regmont had never been so delicate. He calculated the weeks. She should be five months along by now, or thereabouts, yet her condition wasn’t apparent. She was far too thin and pale, making the rouge staining her cheeks seem unnaturally bright.\\n\\n A chill moved through him. Had she lost the baby?\\n\\n The sisters embraced. The differences between the two were made more apparent by their similarities. Jessica glowed with vitality—her eyes were bright, her lips plumped and reddened by his kisses, her skin flushed a healthy pink by the frequency and vigorousness of his ardor. Hester looked almost ghostly in comparison.\\n\\n “My God,” Hester said breathlessly. “You look so well! I’ve never seen you so fit and happy.”\\n\\n Jessica smiled. “I have Mr. Caulfield to thank for that.”\\n\\n Hester’s verdant gaze moved to Alistair and remained warm. She approached with her hands outstretched. He caught them and lifted the backs to his lips, noting the prominence of blue veins beneath her parchment-like skin. The visible capillaries around her eyes and temples were also concerning.\\n\\n “I owe you a huge debt of gratitude,” she said. “As busy as you must be, it was exceedingly generous of you to look after my sister.”\\n\\n “It was my pleasure,” he murmured, managing a smile. What the devil was wrong with Regmont that he allowed his wife to waste away in such a manner? Especially while carrying his child? If Jessica ever looked so thin and ill, he’d keep her abed and hand-feed her relentlessly, never leaving her side until he was certain she would recover.\\n\\n “How are you faring?” Jessica asked, her gaze meeting Alistair’s over her sister’s shoulder. She looked as worried as he felt.\\n\\n “Famously.” Hester pivoted carefully and moved to the settee. “You must have turned about directly after you arrived.”\\n\\n “What did you expect me to do after I received your letter?”\\n\\n “Wish me happy and enjoy yourself.”\\n\\n Jessica began to tug off her gloves. “I’ve done both, and now I am here.”\\n\\n “I am absolutely fine,” Hester said. “The dratted morning sickness has passed, thank God. I am exhausted much of the time, but the doctor says that is to be expected. Come have a seat, Mr. Caulfield. It’s been ages.”\\n\\n “Thank you, but I cannot stay. I’ve been out of the country for some time and there is much to be done.”\\n\\n “Of course there is.” Her smile faded. “Shame on me for detaining you. I’m grateful you brought my sister to me. Will you be seeing Lord Tarley soon?”\\n\\n “Without a doubt.”\\n\\n “Good. Please send him my best wishes, and know that you already have them.”\\n\\n Jessica set her gloves on the floral-covered seat beside her. “I should like to stay with you a while. I’ve missed you.”\\n\\n “You’re worried about me,” Hester argued. “And you needn’t be.”\\n\\n “My reasons are entirely selfish,” Jessica said smoothly. “Who will help me plan my wedding if not for you?”\\n\\n Hester blinked. “Beg your pardon? Did you say ‘wedding’?”\\n\\n “I did.” Jessica’s mouth curved and she turned to him.\\n\\n Alistair couldn’t look away, not when she regarded him in that manner. Her face was so expressive, her love given so fully and freely. His throat clenched tight.\\n\\n “To Alistair Caulfield!?” Hester cried.\\n\\n He winced inwardly at the pervasive shock in her tone. Then she stood in a rush and hugged him.\\n\\n I told you, Jessica mouthed from across the room, her eyes glinting with moisture.\\n\\n His tension deflated by relief, he hugged Hester back. And felt nothing but bones.\\n\\n After departing the Regmont town house, Alistair headed directly to Remington’s Gentlemen’s Club. He needed a drink, maybe a few.\\n\\n Leaving Jessica behind was damned difficult. Everything would work against them here in London, with multiple forces attempting to drive a wedge between them. When they were together, he felt as if they could manage anything. When they were apart, his driving need made him fear the worst.\\n\\n Striding through the double-door entrance, he crossed the gaming area and entered the great room beyond it, his gaze skimming over faces before spotting an empty seating area in a distant corner. His brother Albert was, unfortunately, not in attendance. The sooner Alistair apprised his family of his betrothal, the sooner he could take the steps required to shut the rest of the world out of his romantic concerns. Once Jessica was his wife, Society and its meddlesome mores and opinions could go to hell. Some institutions were still sacred; what a man did with his wife was no one’s business but his own.\\n\\n As he crossed the room, he became aware of the numerous gazes following him. He gave curt nods to those he did business with and ignored the rest. When he reached the bar, he ordered scotch and asked for quill, ink, and parchment. His membership credentials were verified first, reminding him how long it had been since he last socialized in London. He moved to the quiet seat he’d found earlier and settled into the leather wingback.\\n\\n “Damnation,” he muttered, lifting the tumbler to his lips. He felt the multitude of eyes on him, but couldn’t fathom the interest. He even checked his attire, looking for anything out of place that might attract undue attention.\\n\\n Finding no discernible reason for the curiosity he’d roused, Alistair raked the room with a challenging glance, daring someone to approach him instead of furtively assessing him. To his surprise, some of the gentlemen smiled and waved, as if they were old friends. His sharp-edged wariness fled, replaced by mounting confusion. When a familiar tall, dark figure entered the room, Alistair stood with relief.\\n\\n Michael’s gaze found him. With eyes widened by surprise, he crossed the distance between them with long strides and caught Alistair in a fierce embrace.\\n\\n “Has the world gone mad?” Alistair barked, holding his arm out to prevent spilling scotch down his friend’s back.\\n\\n “How are you?” Michael searched Alistair’s face, then shot a telling glance at the fellow tending the bar.\\n\\n “Alive and kicking.”\\n\\n “Yes, well, there is something to be said for that, is there not?”\\n\\n “Absolutely.”\\n\\n They sat. A moment later a tumbler was set before Michael. “I wasn’t expecting you for another few months, at the earliest,” he said.\\n\\n “That would have been ideal. However, once Lady Tarley learned her sister was in the family way, she desired to come home at once.”\\n\\n Michael inhaled sharply, but said nothing.\\n\\n Alistair took another drink, knowing how it felt to covet another man’s wife. “Lady Regmont sends her regards. In fact, she seemed most concerned that I find you in order to do so.”\\n\\n “Most likely she was thinking that you and I have a great deal in common at this point.”\\n\\n “Because we both love Sheffield women? What are we to do, exchange notes?”\\n\\n Michael stilled. “What did you say?”\\n\\n “Come now. I’ve known how you feel about Jessica’s sibling for many years. Like Jess, your face reveals everything.”\\n\\n “ ‘Jess’ you say? What in bloody hell?” Michael’s glass hit the wood tabletop with a decisive thud. “I pray you haven’t been wool headed enough to play your games with my brother’s widow.”\\n\\n “Never.”\\n\\n Michael exhaled his relief.\\n\\n “However,” Alistair went on, “the games I play with my betrothed are no one’s concern but my own.”\\n\\n “By God, Alistair …” Michael stared for a long moment, then tossed back the contents of his glass in one swallow. He signaled for another. “What do you think you’re doing? Jessica is not the type of woman a man takes lightly. Your station and means, even with marriage, won’t be enough to keep her happy. You will have to be cautious and discreet—”\\n\\n “Or simply steadfast.”\\n\\n “Don’t jest!”\\n\\n “This is no joke to me, Tarley.” Twisting his tumbler back and forth, Alistair surveyed the room again, aware that others would think as Michael did—that Jessica would be better served by another man. “I have loved her since you and I were boys. At the time, I thought she was flawless; the one finely wrought thing in this world that might have a hope of saving my blackened soul.”\\n\\n “Spare me the poetry. Byron, you’re not.”\\n\\n Alistair smiled, his mood softened by thoughts of Jessica. He was about to marry a diamond of the first water, a woman so heartbreakingly perfect for him that he ached just thinking about her. There wasn’t a man in this room who didn’t know her worth, and she was his. “But I’ve since learned it is our defects that make us perfect for one another. I expect to live in monogamous marital bliss for the rest of my days.”\\n\\n “And what does Masterson say about this?”\\n\\n “As if I care what he thinks.”\\n\\n “What of your mother, then?” Michael challenged. “She might view this as an opportunity for you and His Grace to find common ground. Jessica is barren, Alistair. For a certainty.”\\n\\n “I know. I care not.”\\n\\n “You cannot be so vindictive. I know you and your father have never gotten along well, but this is a matter far greater than either of you.”\\n\\n A fresh beverage was set before Michael. Alistair grabbed it for his own and drained it. “Your brain has been addled by overwork,” he said, wiping his mouth.\\n\\n “You must be accountable now for decisions that will impact generations—”\\n\\n “Bloody hell. Let us be clear … Your objection to my marrying Jessica comes not from unsuitability or incompatibility, but from your belief that I have an obligation to spawn?”\\n\\n “Responsibility is a nuisance, is it not?” Michael said with surprising bitterness.\\n\\n “Obviously the stress of your brother’s passing has driven you mad. Damned if I’ll give up the one thing in this world I cannot live without simply to whelp offspring in a pitiful attempt to gain acceptance.”\\n\\n “Whether or not you mend the rift with your father is secondary to honoring your duty to the title.”\\n\\n Alistair was of the mind that walking away might be wise. Otherwise, he was certain he was only seconds away from strangling his oldest friend. While Michael had no knowledge of the circumstances surrounding Alistair’s parentage, he was spouting nonsense nonetheless. “Ensuring the longevity of Masterson’s lineage has never been, nor will it ever be, my duty.”\\n\\n Michael’s head tilted, his gaze narrowing. Suddenly, something akin to horror swept over his features. “My God … You don’t know, do you?”\\n\\n “Alistair Caulfield,” Hester repeated, shaking her head. “I would never have guessed. You two were always so cool and reserved toward one another. I always believed you didn’t much care for him.”\\n\\n Jessica lifted one shoulder in an offhand, slightly sheepish shrug. “He’s changed, but more than that, there are depths to him one cannot see unless he reveals them. And I confess, I always found him physically attractive.”\\n\\n “What woman doesn’t?” Hester leaned forward, as if imparting a great secret. “There is something deliciously wicked about him. Something sinful and decadent. And dear God, he is a man now, so large and strong. More handsome than ever, and he was stunning in his youth! It is difficult not to stare at him.”\\n\\n “I know. I’m horribly besotted. Truly, I have to wed him or I will embarrass myself by making calf-eyes at him.”\\n\\n Her sister straightened and poured more tea. “The way he looks at you is indecent. Have you shagged him yet?” \\n\\n","sourceLink":"https://allnovel.net/seven-years-to-sin-historical-1/page-29.html","bookId":2663,"book":{"id":2663,"title":"Seven Years to Sin (Historical #1)","description":"Storyline: Seven Years to Sin (Historical #1) \\n The longer the resistance… \\n Seven years ago, on the eve of her wedding, proper Lady Jessica Sheffield witnessed a licentious scene no innocent young miss could imagine. Shocked, yet strangely titillated, she’d held her silence regarding scandalous Alistair Caulfield, and walked down the aisle as expected. But through years of serene, unremarkable marriage, Caulfield’s image remained burned into her imagination, fueling very illicit dreams… \\n …the sweeter the reward \\n Alistair ran far from the temptation of the prim debutante with the fire of passion in her eyes–all the way to the West Indies. As a successful merchant, he has little in common with the rakehell youth she knew. But when newly widowed Jessica steps aboard his ship for a transatlantic passage, seven years’ worth of denied pleasures are held in check by nothing more than a few layers of silk–and the certainty that surrender will consume them both…\\n","cover":"https://allnovel.net/images/seven-years-to-sin-historical-1.jpg","author":"Sylvia Day","type":"Historical","source":"allnovel","link":"https://allnovel.net/seven-years-to-sin-historical-1.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:56:27 AM"}}
