{"id":85492,"no":15,"title":"Page 15","content":"“No, you’re not.” Her wry smile faded as she glanced down the street. “Paparazzi,” she said grimly. I followed her gaze and spotted the photographer aiming a camera out of the open passenger window of his car. Gripping her by the elbow, I led her into the building. “If I have to start actually styling my hair every day,” she muttered, “you’re dealing with morning wood on your own.” “Angel,” I tugged her into my side and whispered, “I’d hire a full-time hairdresser for you before I gave up your cunt every morning.” She elbowed me in the ribs. “God, you’re crude, you know that? Some women take offense to that word.” She went ahead of me through the security turnstiles and joined the mass of bodies waiting for the next elevator car. I stood close behind her. “You’re not one of them. However, I might be willing to revise. I recall orifice being a favorite of yours.” “Oh God. Shut up,” she said, laughing. We separated when she exited on the twentieth floor and I went up to Cross Industries without her. I wouldn’t be doing so for long. Someday, Eva would be working with me, helping to build our future as a team. I was debating the myriad avenues to achieving that goal when I rounded the corner on approach to my office. My stride slowed when I saw the willowy brunette waiting by Scott’s desk. I steeled myself to deal with my mother again. Then her head turned and I saw it was Corinne. “Gideon.” She rose gracefully to her feet, her eyes brightening with a look I’d come to recognize, having seen it on Eva’s face. It gave me no pleasure to see that warmth in Corinne’s eyes. Unease slid down my spine, stiffening my back. The last time I had seen her had been shortly after she’d tried to kill herself. “Good morning, Corinne. How are you feeling?” “Better.” She came toward me and I took a step back, causing her to slow and her smile to waver. “Do you have a moment?” I gestured to my office. With a deep breath, she turned and preceded me. I glanced at Scott. “Give us ten.” He nodded, his gaze sympathetic. Corinne walked to my desk and I joined her, hitting the button that closed the door behind us. I kept the glass clear and didn’t remove my jacket, sending her every signal that she shouldn’t settle in for long. “I’m sorry for your loss, Corinne.” Saying the words wasn’t enough, but they were all I could give her. The memories of that night in the hospital would be with me for a while. Her lips whitened. “I still can’t believe it. All these years of trying . . . I thought I couldn’t get pregnant.” She picked up the photo of Eva on my desk. “Jean-François told me you called a couple times asking about me. I wish you’d called me. Or returned my calls.” “I don’t think that’s appropriate, under the circumstances.” She looked at me. Her eyes weren’t the same shade of blue as my mother’s, but they were close, and their sense of style was similar. Corinne’s elegant blouse and trousers were notably like something I’d once seen my mother wear. “You’re getting married,” Corinne said. It wasn’t a question, but I answered anyway. “Yes.” Her eyes closed. “I’d hoped Eva was lying.” “I’m very protective when it comes to her. Tread lightly.” Opening her eyes, she set the picture down hard. “Do you love her?” “That’s none of your business.” “That’s not an answer.” “I don’t owe you one, but if you need to hear it, she’s everything to me.” The tightness of her mouth softened with a quiver. “Would it make a difference if I told you I’m getting divorced?” “No.” I exhaled roughly. “You and I will never be together again, Corinne. I don’t know how many times or in how many ways I can say it. I could never be what you want me to be. You dodged a bullet when you broke our engagement.” She flinched, her hair sliding over her shoulder to flow down to her waist. “Is that what’s keeping us apart? You can’t forgive me for that?” “Forgive you? I’m thankful.” My voice softened when tears filled her eyes. “I don’t mean to be cruel. I can guess how painful this might be. But I didn’t want you to have hope when there isn’t any.” “What would you do if Eva said these things to you?” she challenged. “Would you just give up and walk away?” “It’s not the same.” I raked a hand through my hair, struggling to find the words. “You don’t understand what I have with Eva. She needs me as much as I need her. For both our sakes, I wouldn’t ever give up trying.” “I need you, Gideon.” Frustration made me curt. “You don’t know me. I played a role for you. I let you see only what I wanted you to see, what I thought you could accept.” And in return, I saw only what I wanted to see in her, the girl she’d once been. I had stopped paying real attention long ago, and so I’d failed to see how she had changed. She’d been a blind spot for me, but no longer. She stared at me in shocked silence for a moment. “Elizabeth warned me that Eva was rewriting your past. I didn’t believe her. I’ve never known you to be swayed by anyone, but I guess there’s a first time for everything.” “My mother believes what she wants and you’re welcome to join her.” They were similar in that way, too. Good at believing what they wanted and ignoring any proof to the contrary. It was a revelation to realize I had been comfortable with Corinne because I’d known she wouldn’t pry. I’d been able to fake normalcy with her and she never dug deeper. Eva had changed that for me. I wasn’t normal and I didn’t need to be. Eva accepted me the way I was. I wasn’t going to reveal my past to everyone, but my days of playing along with the lies were over. Corinne reached a hand out to me. “I love you, Gideon. You used to love me, too.” “I was grateful to you,” I corrected. “And I will always be. I was attracted to you, had fun with you, for a time I even needed you, but it would never have worked out between us.” She dropped her hand back to her side. “I would have found Eva eventually. And I would’ve wanted her, given up everything to have her. I would have left you to be with her. The end was inevitable.” Corinne turned away. “Well . . . at least we’ll always be friends.” It was an effort to strip any apology out of my tone. I wouldn’t encourage her. “That won’t be possible. This is the last time you and I will speak to each other.” Her shoulders shook with a ragged indrawn breath, and I turned my head, fighting with discomfort and regret. She’d been important to me once. I would miss her, but not in the way she wanted me to. “What do I have to live for if I don’t have you?” I turned at her question and barely caught her when she ran into me, holding her at bay with a grip on her upper arms. The devastation on her beautiful face got to me before I could process what she’d said. Then it registered. Horrified, I shoved her away. She stumbled back as her heels caught in the carpet. “Don’t put that on me,” I warned, my voice low and hard. “I’m not responsible for your happiness. I’m not responsible for you at all.” “What’s wrong with you?” she cried. “This isn’t you.” “You wouldn’t know.” I went to the door and yanked it open. “Go home to your husband, Corinne. Take care of yourself.” “Fuck you,” she hissed. “You’re going to regret this, and I might be too hurt to forgive you.” “Good-bye, Corinne.” She stared at me for a long minute and then stormed out of my office. “Damn it.” I pivoted, not knowing where to go or what to do, but I had to do something. Anything. I paced. I’d pulled out my smartphone and called Eva before I consciously made the decision to do so. “Mark Garrity’s office,” she began. “Angel.” The one word betrayed my relief at hearing her voice. She was what I needed. Something in me had known that. “Gideon.” She read me immediately, as she so often did. “Is everything all right?” I glanced out at my staff in the distant cubicles getting into the groove of the day. I hit the controls to frost the glass, carving out a moment alone with my wife. I lightened my tone, not wanting to cause her stress. “I miss you already.” She waited a beat before replying, adjusting to my mood. “Liar,” she shot back. “You’re too busy.” “Never. Now, tell me how much you’re missing me.” She laughed. “You’re terrible. What am I going to do with you?” “Everything.” “Damn straight. So what’s up? It’s going to be a busy day and I have to get going.” I went to my desk and studied her photo. My shoulders relaxed. “Just wanted you to know I’m thinking about you.” “Good. Don’t stop. And FYI, it’s nice to hear you not grumpy at work.” It was nice to hear her, period. I’d given up trying to figure out why she affected me the way she did. I just appreciated that she could reset my day. “Tell me you love me.” “Madly. You rock my world, Mr. Cross.” I stared into her laughing eyes, my fingertip brushing lightly over the glass. “You’re the center of mine.” — THE rest of the morning passed swiftly and uneventfully. I was wrapping up a meeting regarding a possible investment in a proposed resort chain when yet another personal interruption showed up. So much for workflow. “You’ve got to fuck up everything, don’t you?” my brother accused, barging into my office with Scott on his heels. With a look, I gave Scott the okay to back out. He shut the door behind him. “Good afternoon to you, too, Christopher.” We shared blood but could not have been less alike. Like his father’s, his hair was wavy and fell somewhere between brown and red. His eyes were a gray mixed with green, while I was most definitely our mother’s son. “Did you forget that Vidal Records is Ireland’s legacy, too?” he snapped, his eyes hard. “I never forget that.” “Then you just don’t give a shit. Your vendetta against Brett Kline is costing us money, damn you. You’re hurting all of us, not just him.” Moving to my desk, I leaned against it and crossed my arms. I should’ve seen it coming, considering how irate Christopher had become at the Times Square launch of the “Golden” video. He wanted Kline and Eva together. More than that, he wanted Eva and me apart. It was the sad truth that I brought out the worst in my brother. The only times he ever acted cruelly or rashly was when he was trying to hurt me. I’d seen him give brilliant speeches, charm people with his natural charisma, and impress board members with his industry savvy, but he never displayed those traits toward me. Frustrated by his unprovoked animosity, I baited him. “I’m assuming you’re going to get to the point soon.” “Don’t play innocent, Gideon. You knew exactly what you were doing when you systematically destroyed every media opportunity Vidal secured for Six-Ninths.” “If those opportunities were centered on Eva, they had no business being pursued to begin with.” “That’s not your decision to make.” His mouth twisted in a scornful smile. “Do you even comprehend the damage you’ve done? Behind the Music has delayed their special because Sam Yimara no longer owns the rights to the footage he compiled of the band’s early years. Diners, Drive-Ins and Dives can’t include Pete’s 69th Street Bar in their San Diego episode, because it’s being demolished before they can film their segment. And Rolling Stone isn’t interested in pursuing their proposed piece on ‘Golden’ since your engagement was announced. The song loses its interest without the happy ending.” “I can get you the footage VH1 wants. Put them in touch with Arash and he’ll take care of it.” “After you remove all traces of Eva? What’s the point?” My brows lifted. “The point is supposed to be Six-Ninths, not my wife.” “She’s not your wife yet,” he shot back, “and that’s your problem. You’re afraid she’s going to go back to Brett. You’re not really her type and we all know it. You can eat her pussy at parties, but what she really likes is blowing rock stars in public—” I was on him before he blinked. My fist hit his jaw; his head jerked back. I caught him with a follow-up left and he stumbled, crashing into the glass wall.","sourceLink":"https://allnovel.net/captivated-by-you-crossfire-4/page-15.html","bookId":1816,"book":{"id":1816,"title":"Captivated by You (Crossfire #4)","description":"Storyline: Captivated By You: by Sylvia Day (Book 4) | Summary \u0026 Analysis This is a Summary \u0026 Analysis. The fourth in a series, Sylvia Day’s novel covers the time between Eva\u0027s and Gideon Cross\u0027 elopement and their official, \"real\" wedding. During this time, only a few close friends know they\u0027re already married. While the novel can be read alone, there are many references to events and characters that occur in previous books; reading this instalment would be a richer experience in the context of the other novels. It is much more sophisticated than a traditional romance. The novel examines how a couple reconciles their powerful sexual attraction and their very complex personal needs. Gideon Cross has everything he wants: the most successful business in the world, amazing looks and a gorgeous wife he loves more than anything. However, because of his horrible nightmares and awful flashbacks to childhood abuse, it is hard for him to enjoy any of it. What\u0027s more, his psychological demons have made him need to control everything and everyone around him, and this need is threatening to drive away the woman he loves. They try to use sex to solve their problems, but it’s even more complicated than they thought. This companion also includes the following: • Book Review • Story Setting Analysis • Story elements you may have missed as we decipher the novel • Details of Characters \u0026 Key Character Analysis • Summary of the text, with some analytical comments interspersed • Discussion \u0026 Analysis of Themes, Symbols… • And Much More! This Analysis of the novel fills the gap, making you understand more while enhancing your reading experience.","cover":"https://allnovel.net/images/captivated-by-you-crossfire-4.jpg","author":"Sylvia Day","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/captivated-by-you-crossfire-4.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:05:51 PM"}}
