{"id":85499,"no":22,"title":"Page 22","content":"My hand slid down her back and rested lightly on the curve of her hip. She’d ditched the shorts in favor of a fitted skirt with a split up the back. I almost wished she hadn’t changed. The shorts had shown off her legs; the skirt showed off her amazing ass. “You need to decide if you want me to answer the question or not,” I said, as we made our way into the club. The music was loud, the amateur singer on the stage louder. Strategic lighting illuminated walkways and tables while still allowing the Manhattan nightscape to dazzle patrons. Air-conditioning pumped out of the walls and floors, cooling the open air to a comfortable temperature. “Is there anything you don’t own in New York?” Arash laughed. “He doesn’t own the D’Argos Regal on Thirty-sixth anymore.” Eva stopped walking, causing Arash to bump into her from behind and send her stumbling. I shot him a glare. Grabbing my arm, Eva yelled over the volume of the crowded club. “You got rid of the hotel?” I looked down at her. The wonder and hope on her face more than made up for the financial hit I’d taken. I nodded. She threw herself at me, her arms twining around my neck. She peppered my jaw with quick, fierce kisses and I smiled, my gaze meeting Arash’s. “And suddenly,” he said, “it all makes sense.” 10 “GOD, THOSE TWO are so sweet,” Shawna said, watching Will and Natalie sing “I Got You, Babe” on the stage. “They’re giving me diabetes.” Manuel stood with his drink. “Excuse me, everyone. I see something interesting.” Gideon’s voice near my ear was laced with amusement. “Say good-bye, angel. We won’t be seeing him again.” I followed his line of sight and saw a pretty brunette giving Manuel a blatant once-over. “Bye, Manuel!” I yelled after him, waving. Then I leaned into Gideon, who was semisprawled on the expensive leather upholstery. “How come all the guys you work with are hot?” “Are they?” he drawled, nuzzling my neck and along the curve of my ear. “Maybe they won’t be working with me much longer.” “Oh God.” I looked up at the starry sky. “Whatever, caveman.” His arm tightened around my hips, tugging me closer so that I was pressed fully against him from knee to shoulder. Joy spread through me. After all the crap we’d been through the day before, it was so awesome to just enjoy each other. Megumi leaned over the low coffee table that filled the center of the rectangular seating area we occupied. Bordered by two sectionals, the VIP section held our entire party comfortably. “When are you getting up there to make fools of yourselves?” she asked. “Um . . . never.” It had taken a few drinks and Cary’s undivided attention to make Megumi comfortable enough to enjoy herself. My best friend had kicked things off with a rousing rendition of “Only the Good Die Young,” and then he’d dragged Megumi up there to sing “(I’ve Had) The Time of My Life.” She’d come back to the table glowing. I owed Cary big-time for taking care of her. Even better, he seemed to have no intention of ditching us to cruise the place for conquests like Manuel had. I was really proud of him. “Come on, Eva,” Steven coaxed. “You picked this place. You have to sing.” “Your sister picked this place,” I shot back, looking to her. Shawna just shrugged innocently. “She’s sung twice!” he countered. I deflected. “Mark hasn’t sung anything.” My boss shook his head. “I’m doing you all a favor, trust me.” “You’re telling me. Squealing tires sound more lyrical than I do!” Arnoldo pushed the tablet with the song choices my way. It was the first time all night he’d made any overture toward me, aside from saying hello at the entrance. He’d spent most of the evening focused on Magdalene and Gage, which I tried not to take as a personal snub. “No fair,” I complained. “You’re all ganging up on me! Gideon hasn’t sung yet, either.” I glanced at my husband. He shrugged. “I’ll go up if you will.” Astonishment widened my eyes. I’d never heard Gideon sing, had never even imagined it. Singers exposed and expressed emotion with their voices. Gideon’s still waters ran very deep. “Hell, you gotta do it now,” Cary said, reaching over to tap the menu open at a random page. My stomach twisted a little. I looked helplessly at the songs in front of me. One jumped out and I stared at it. Taking a deep breath, I stood. “Okay. Just remember, you all asked for this. I don’t want to hear any shit about how bad I suck.” Gideon, who’d risen to his feet when I had, pulled me close and murmured in my ear, “I think you suck excellently, angel.” I elbowed him in the ribs. His low laughter followed me as I made my way to the stage. I loved hearing that sound, loved spending time with him when we forgot our troubles and had fun with people who loved us. We were married, but we still had so much dating to catch up on, so many nights with friends yet to experience. Tonight was just the first of many, I hoped. I regretted threatening the fragile peace with my song choice. But not enough to change my mind. I high-fived Will as he and Natalie passed me on the way back to our group. I could have input my song choice into the tablet at the table, the same way we placed our food and drink orders, but I didn’t want Gideon seeing the title. Plus, I’d noticed that every other party in the place had to wait for their turn in the queue, but our selections were fast-tracked. I was hoping that adding my name to the list in person would buy me some time to build up the courage I needed. I should’ve known better. When I gave the hostess my selection, she typed it into the system and said, “Okay, stay right here. You’re next.” “You’re kidding.” I glanced back at our table. Gideon winked at me. Ooh, he was going to pay for that later. The chick on the stage singing “Diamonds” wrapped it up, and the place exploded into applause. She’d been decent, but really, the live band made up for a lot of faults. They were really good. I had my fingers crossed that they’d be good enough for me, too. I was shaking when I climbed the short steps to the stage. When the loud whistles and cheers erupted from our table, I couldn’t help but laugh despite my nervousness. I gripped the mic in its stand and the beat kicked in immediately. The familiar song, one I loved, gave me the boost I needed to start. Looking at Gideon, I warbled my way through the opening lyrics, telling him he was amazing. Even over the music, I could hear the laughter at my horrible voice. My own table erupted with it, but I had expected that. I’d chosen “Brave.” I had to be it to sing it—that, or crazy. I stayed focused on my husband, who wasn’t laughing or smiling. He just stared intently at my face as I told him via Sara Bareilles’s lyrics that I wanted to see him speak up and be brave. The catchy composition plus the skill of the band backing me began to win over the crowd, who started singing along, more or less. My heart strengthened my voice, giving power to the message meant only for Gideon. He needed to stop holding his silence. He needed to tell his family the truth. Not for me or for them, but for him. When the song ended, my friends surged to their feet in applause and I grinned, energized. I gave a lavish bow and laughed when the strangers at the tables in front of the stage joined in the unearned praise. I knew my strengths. My singing voice certainly wasn’t one of them. “That was fuckin’ awesome!” Shawna shouted when I got back to the table, grabbing me in a fierce hug. “You owned that, girl.” “Remind me to pay you later,” I said dryly, feeling my face heat as the rest of our party kicked in with praise. “You guys are full of it.” “Ah, baby girl,” Cary drawled, his green eyes bright with laughter, “you can’t be good at everything. It’s a relief to know you’re flawed like the rest of us.” I stuck my tongue out at him and picked up the fresh vodka cranberry sitting in front of my spot. “Your turn, lover boy,” Arash goaded, grinning at Gideon. My husband nodded, then looked at me. His face held no hint to his thoughts, and I began to worry. There was no softness on his lips or in his eyes, nothing to give me a clue. And then some idiot started singing “Golden.” Gideon stiffened, his jaw visibly tightening. Reaching for his hand, I gave it a squeeze and felt a bit of relief when he squeezed back. He kissed my cheek and headed to the stage, cutting through the crowd with easy command. I watched him go, seeing other women’s heads turn to follow him. I was biased, of course, but knew for a certainty that he was the most striking man in the room. Seriously, it should be criminal for a man to be that sexy. I looked at Arash and Arnoldo. “Have either of you heard him sing?” Arnoldo shook his head. Arash laughed. “Hell, no. With any luck, he’ll sound like you. Like Cary says, he can’t be good at everything or we’d all have to hate him.” The guy onstage wrapped it up. A moment later, Gideon walked on. For some reason, my heart started pounding as badly as it had when I was up there. My palms grew clammy and I wiped them on my skirt. I was afraid of what it would be like to watch Gideon up there. Much as I hated to think it, Brett was a hard act to follow and hearing “Golden,” even sung by someone who shouldn’t ever have access to a microphone, brought those two worlds too close together. Gideon grabbed the mic and pulled it off the stand as if he’d done the move a thousand times before. The women in the audience went crazy, yelling about how hot he was and making suggestive remarks I chose to ignore. The man was delicious physically, but his commanding, confident presence was the real kicker. He looked like a man who knew how to fuck a woman senseless. And God, did he ever. “This one,” he said, “is for my wife.” With a pointed glance, Gideon signaled the band to start. An instantly recognizable bass beat ratcheted up my pulse. “Lifehouse!” Shawna crowed, clapping her hands. “I love them!” “He’s calling you his wife already!” Megumi yelled, leaning toward me. “How freakin’ lucky are you?” I didn’t glance at her. I couldn’t. My attention was riveted on Gideon as he looked directly at me and sang, telling me in a lusciously raspy voice that he was desperate for change and starving for truth. He was answering my song. My eyes burned even as my heart began to beat with a different rhythm. Had I thought he’d be unemotional? My God, he was killing me, baring his soul in the rough timbre of his voice. “Holy fuck,” Cary said, his eyes on the stage. “The man can sing.” I was hanging by a moment, too, hanging on to every word, hearing his message about chasing after me and falling more in love. I shifted in my seat, turned on beyond bearing. Gideon dominated the attention of everyone in the bar. Of all the voices we’d heard that night, his was truly professional grade. He stood in the single spotlight, feet set a foot apart, dressed elegantly while singing a rock song, and he made it work so well I couldn’t imagine it sung any other way. There was no comparison to Brett, not in Gideon’s delivery or my reaction to it. I was on my feet before I knew it, making my way through the crowd to get to him. Gideon finished the song and the bar went ballistic, cutting off my route to him. I became lost in the crush, too short to see beyond the shoulders around me. He found me, pushing his way through to catch me up in his arms. His mouth claimed mine, kissing me roughly, inciting a new round of catcalls and cheers. In the periphery, I heard the band begin a new song. I practically climbed up Gideon, panting in his ear, “Now!” I didn’t have to explain. Setting me down, he grabbed my hand and led me across the bar and back through the kitchen to the service elevator. I plastered myself against him before the doors closed behind us, but he was pulling out his phone and lifting it to his ear, tilting his head back as my mouth slid feverishly over his throat. “Bring the limo around,” he ordered gruffly, and then the phone was back in his pocket and he was kissing me back with all the passion he’d once kept locked inside. Ravenous, I devoured him, catching his lower lip between my teeth and tasting it with swift lashes of my tongue. He groaned when I pushed him against the elevator’s padded wall, my hands running down his chest to cup the heft of his erection in my palms. “Eva . . . Christ.” We stopped descending and he exploded into movement, grabbing me by the elbow and pushing me ahead of him out the doors with brisk, impatient strides. We exited from a service hallway into the lobby, once again maneuvering through a crowd until we stepped out into the summer night heat. The limo idled in the street.","sourceLink":"https://allnovel.net/captivated-by-you-crossfire-4/page-22.html","bookId":1816,"book":{"id":1816,"title":"Captivated by You (Crossfire #4)","description":"Storyline: Captivated By You: by Sylvia Day (Book 4) | Summary \u0026 Analysis This is a Summary \u0026 Analysis. The fourth in a series, Sylvia Day’s novel covers the time between Eva\u0027s and Gideon Cross\u0027 elopement and their official, \"real\" wedding. During this time, only a few close friends know they\u0027re already married. While the novel can be read alone, there are many references to events and characters that occur in previous books; reading this instalment would be a richer experience in the context of the other novels. It is much more sophisticated than a traditional romance. The novel examines how a couple reconciles their powerful sexual attraction and their very complex personal needs. Gideon Cross has everything he wants: the most successful business in the world, amazing looks and a gorgeous wife he loves more than anything. However, because of his horrible nightmares and awful flashbacks to childhood abuse, it is hard for him to enjoy any of it. What\u0027s more, his psychological demons have made him need to control everything and everyone around him, and this need is threatening to drive away the woman he loves. They try to use sex to solve their problems, but it’s even more complicated than they thought. This companion also includes the following: • Book Review • Story Setting Analysis • Story elements you may have missed as we decipher the novel • Details of Characters \u0026 Key Character Analysis • Summary of the text, with some analytical comments interspersed • Discussion \u0026 Analysis of Themes, Symbols… • And Much More! This Analysis of the novel fills the gap, making you understand more while enhancing your reading experience.","cover":"https://allnovel.net/images/captivated-by-you-crossfire-4.jpg","author":"Sylvia Day","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/captivated-by-you-crossfire-4.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:05:51 PM"}}
