{"id":102872,"no":9,"title":"Page 9","content":"“Did I?”\\n\\n Sipping his coffee, Finn tried to hide his smile, but Carrie saw it and smiled back. “I believe it’s my turn to deal.”\\n\\n Keeping his eyes on her, he slid the deck of cards across the table.\\n\\n Shuffling the cards, Carrie glanced up and smiled ever so sweetly. “Women aren’t stupid, you know.”\\n\\n “I never said they were. Heartless, yes, but a few I’ve happened upon showed meager signs of intelligence.”\\n\\n Carrie suspected he was purposely attempting to bait her. “I’ll add chauvinist to the long list of words that best describe you, Finn Dalton.”\\n\\n “Better word would be realist.”\\n\\n “Oh, puh-leese.” She drawled out the word and laughed despite herself.\\n\\n Finn did, too, and the surprise of hearing his amusement caused her to fumble and lose control of the cards, which scattered across the tabletop.\\n\\n “You should laugh more often,” she said, gathering together the deck.\\n\\n “Really?”\\n\\n “Yes, really.”\\n\\n His eyes shone, and despite his grizzled appearance, she found him strongly appealing. If he were clean shaven and his hair groomed, he might even be considered handsome. She must have been staring at him because he frowned and barked, “What?”\\n\\n “Oh, sorry.” Carrie quickly looked away and dealt the cards.\\n\\n “You’re staring at me.”\\n\\n “I know.”\\n\\n “Why?”\\n\\n This question was harder to answer. She couldn’t very well admit she found him intriguing, and so she said the first thing that came to mind. “I want to remember what you look like, and I doubt you’d let me take your photo.”\\n\\n He immediately frowned. “For that article you intend to write?”\\n\\n Instead of answering, she kept dealing the cards and then waited while he cut the deck.\\n\\n The second game proved they were well matched. Finn won, but not by much.\\n\\n “Tie-breaker?” he asked.\\n\\n “Of course,” she responded. It surprised her how much she enjoyed this mini–battle of the sexes with him.\\n\\n After shuffling the cards, he dealt.\\n\\n “Do you do anything special around the cabin for Christmas?” she asked.\\n\\n Frowning, he glanced at her above his hand. “It isn’t even Thanksgiving yet. Why are you asking about Christmas?”\\n\\n “I guess it’s on my mind. A lot of the stores already have their decorations up.”\\n\\n “You’ve got to be joking.”\\n\\n “I’m not.”\\n\\n He grumbled some. “I suppose you’re the sort of woman who goes all out for Christmas.”\\n\\n “Of course,” she said, as she counted out her score. “Although I live alone, I put up a tree, hang garlands, and decorate with holly. What about you?”\\n\\n He finished counting out his hand. “What about me? If you’re digging for more information for that article, you can stop right now.”\\n\\n “I wasn’t,” she said, groaning. It seemed everything she asked was suspect. “You don’t have a Christmas tree?”\\n\\n “No. Why would I?”\\n\\n Knowing him, he probably didn’t like Christmas at all. “Is it just another day for you and Hennessey?”\\n\\n “For the most part, yes. I’ll sometimes join Sawyer and his family or fly to Fairbanks and spend Christmas Day with friends.”\\n\\n It made Carrie feel better to know he wouldn’t be alone unless that was what he chose. “Good.”\\n\\n “Good?” he repeated.\\n\\n “Yes. I would hate the thought of you spending Christmas alone.”\\n\\n He grinned, as if her comment amused him. “Despite what you think, I enjoy my own company, but I have a real life, too. I live a good part of the time here, but I have a condo … elsewhere.”\\n\\n “You do? But how do you support yourself? I mean, before the book.”\\n\\n “I have all the work I want with the state, checking on the pipeline.” He grimaced, as if he’d said far more than he meant for her to know. “Forget I said that.”\\n\\n She pantomimed zipping her lips closed. There was far more to Finn than she realized. “Listen, this isn’t related to anything I might write, so relax.”\\n\\n They broke for lunch. Finn made sandwiches, which they ate in front of the stove, sitting in the rocking chairs. A glance out the window told her the wind had died down and the snow had stopped.\\n\\n “My mother is probably worried about me,” she said, checking her cell phone. Thankfully, her battery wasn’t dead, but coverage this far north simply wasn’t going to happen. “I told her I’d phone, and I haven’t. Is there any way I can get word to her?”\\n\\n “I have a satellite phone, but it isn’t cheap.”\\n\\n “I’ll be happy to pay whatever the charges are. I won’t talk long.”\\n\\n “Having you out of my hair by tomorrow morning would be payment enough.”\\n\\n Carrie frowned. “Ouch. I thought we were getting along so well, too.”\\n\\n Finn chuckled. “We were almost friends until you whipped me in cribbage.”\\n\\n “Ah, men and their fragile egos.”\\n\\n Finn grumbled something she couldn’t hear, and then he showed her how to operate the phone by his desk. It took a moment for the line to connect, and when it did, her father answered.\\n\\n “Dad, it’s me. I don’t have a lot of time, but I want you to know I’m still in Alaska. Tell Mom I’m doing great and I’ll connect with her once I’m back in Chicago.”\\n\\n “Your mother’s been concerned. You said you’d call.”\\n\\n “I know, Dad. I’ll explain everything when I’m not paying outrageous satellite charges.”\\n\\n “Satellite charges? Where in heaven’s name are you?” Her father was the talker in the family.\\n\\n “Outside of Fairbanks, Alaska.” If she said anything more, her dad would have more questions, and then more after that.\\n\\n “You found him? You found Finn Dalton?”\\n\\n “Dad, I can’t talk now.”\\n\\n “Okay, okay, but I’m going to want a full report once you’re back.”\\n\\n “Will do. Reassure Mom that I’m fine and thank Grandpa for teaching me cribbage.”\\n\\n “What’s that?”\\n\\n “Never mind, I’ll explain later.”\\n\\n They said their farewells, and Carrie ended the call. When she turned around, she was surprised to find Finn had put on his parka and heavy boots.\\n\\n “You’re going somewhere?” she asked, surprised.\\n\\n “The wind has died down and the snow has mostly stopped. I won’t be gone long.” Hennessey was at the door, eager and ready to be on his way.\\n\\n At the door, Finn hesitated. “You’ll be all right for a while by yourself?”\\n\\n “Of course.” It surprised her that he’d asked. Actually, she welcomed the privacy in order to work on the article. The instant he was out the door, she retrieved her computer. It didn’t take her long to organize her thoughts. She’d already gathered more than enough information to write a lengthy piece about him. The rough draft took her the better part of an hour. Feeling good about the piece, which she felt was fair, if not flattering, she tucked her laptop back inside her suitcase, grateful Finn hadn’t returned while she’d had it open.\\n\\n With that out of the way, Carrie soon grew restless and bored, fidgeting, wishing she could talk to Sophie. Had she better planned this trip, she would have brought along her e-reader.\\n\\n Finding little with which to entertain herself, Carrie took out the paper tablet she had with her, found a pair of scissors, and went about cutting large snowflakes. With the sewing kit at the bottom of her purse, she took thread, stood barefoot on a chair, and suspended the flakes from the ceiling until the entire cabin looked like a magical winter wonderland.\\n\\n More than likely Finn wouldn’t appreciate her effort toward Christmas decorations; however, she wasn’t going to let that stop her. Other than keeping her occupied, she hoped this would amuse him.\\n\\n She was standing on the chair in the middle of the cabin, stretching her arms above her head, when the door unexpectedly opened and Finn and Hennessey stepped inside.\\n\\n “What the …”\\n\\n Startled, Carrie lost her balance, and with arms flailing at her sides, she started to topple from her perch on the chair. Seeing her predicament, Finn reacted quickly and instinctively, catching her in midair. Carrie issued a small, breathless gasp as her body was pressed hard against his.\\n\\n For one wild moment all they did was stare at each other. Her pulse raced, and his eyes went directly to her throat as if he could see her reaction. He didn’t release her, and she realized she was glad to be in his arms. It wasn’t a comfortable feeling.\\n\\n His gaze traveled from the throbbing pulse in her neck to her lips, and Carrie’s mouth went dry as his eyes held hers. When did this happen? Another question quickly followed the first—what were they going to do about it? Carrie knew what she wanted. She closed her eyes, expecting, hoping that Finn would kiss her.\\n\\n He didn’t.\\n\\n Gradually he released her, setting her feet down on solid ground. Then he stepped back as though having her this close had burned his senses.\\n\\n “What is this?” he asked, his voice ragged, demanding. He hardly sounded like himself.\\n\\n “What?” Carrie’s own senses became jumbled. Confused. She wasn’t sure what he meant. It sounded as if he was asking about this sudden arc of awareness that vibrated between them. “I …”\\n\\n “This!” He pointed at the ceiling.\\n\\n “Oh, that,” she said, feeling foolish, embarrassed, and relieved. “I thought I’d add a bit of holiday spirit to your cabin.”\\n\\n He frowned.\\n\\n “I can take it down if you want.”\\n\\n His response was a soft snort. “And risk you breaking your fool neck a second time? Leave it.”\\n\\n “I think it looks great.”\\n\\n “You would.”\\n\\n “And you don’t?” she pressed.\\n\\n He didn’t bother to answer, but instead announced, “I’ll put a roast on for dinner.” She stood by while he put together meat, carrots, and onions in a cast-iron pot and placed it in the oven.\\n\\n “What can I do?” she asked, looking to help.\\n\\n “You can peel potatoes if you want.”\\n\\n “I want.”\\n\\n They both seemed eager to put that sensual awkwardness behind them. It was important, she supposed, to ignore the awareness that sprang up so unexpectedly. Finn seemed as determined as she was to pretend it had never happened. Carrie was more than eager to do so, seeing that she’d practically begged him to kiss her. Just thinking about it mortified her. She didn’t know what she’d been thinking, which explained it, because clearly she hadn’t been thinking. Instead, she’d been feeling, and that was dangerous to them both.\\n\\n Within a couple of hours the scent of the roast filled the cabin. As she set the table for dinner, Finn disappeared for a couple minutes and returned with a bottle of red wine.\\n\\n “Do you like wine?” he asked.\\n\\n “Yes, very much.”\\n\\n He set the wine bottle in the middle of the table.\\n\\n “Are we celebrating?” she asked, teasing him. \\n\\n","sourceLink":"https://allnovel.net/starry-night/page-9.html","bookId":2634,"book":{"id":2634,"title":"Starry Night","description":"Storyline: ’Tis the season for romance, second chances, and Christmas cheer with this new novel from Debbie Macomber. \\n Carrie Slayton, a big-city society-page columnist, longs to write more serious news stories. So her editor hands her a challenge: She can cover any topic she wants, but only if she first scores the paper an interview with Finn Dalton, the notoriously reclusive author. \\n Living in the remote Alaskan wilderness, Finn has written a mega-bestselling memoir about surviving in the wild. But he stubbornly declines to speak to anyone in the press, and no one even knows exactly where he lives. \\n Digging deep into Finn’s past, Carrie develops a theory on his whereabouts. It is the holidays, but her career is at stake, so she forsakes her family celebrations and flies out to snowy Alaska. When she finally finds Finn, she discovers a man both more charismatic and more stubborn than she even expected. And soon she is torn between pursuing the story of a lifetime and following her heart. \\n Filled with all the comforts and joys of Christmastime, Starry Night is a delightful novel of finding happiness in the most surprising places.\\n","cover":"https://allnovel.net/images/starry-night.jpg","author":"Debbie Macomber","type":"Christian","source":"allnovel","link":"https://allnovel.net/starry-night.html","creation":"Oct 5, 2019 8:58:57 AM","modification":"Oct 5, 2019 10:16:43 PM"}}
