{"id":40855,"no":1,"title":"EDITOR’S PROSPECTUS","content":"One of the most important decisions a young man is called upon to make relates to the determination of his life-work. It is fraught with serious consequence for him. It involves the possibilities of success and failure. The social order is such that he can best realize his ends by the pursuit of a vocation. It unifies his purposes and endeavors—making them count for most in the struggle for existence and for material welfare. It furnishes steady employment at a definite task as against changeable effort and an unstable task. This makes for superior skill and greater efficiency which result in a larger gain to himself and in a more genuine contribution to the economic world. \n \n But a man’s vocation relates to a much wider sphere than the economic. It is intimately associated with the totality of his interests. It is in a very real sense the center of most of his relations in life. His intellectual interests are seriously dependent upon his vocational career. Not only does the attainment of skill and efficiency call for the acquisition of knowledge and development of judgment, but the leisure that is so essential to the pursuit of those intellectual ends which are a necessary part of his general culture is, in turn, dependent, to a considerable extent, upon the skill and efficiency that he acquires in his vocation. \n \n vi Nor are his social interests less dependent upon his life-work. Men pursuing the same calling constitute in a peculiar sense a great fraternity or brotherhood bound together by common interests and aims. These condition much of his social development. His wider social relationships also are dependent, in a large measure, on the success that he attains in his chosen field of labor. \n \n Even his moral and spiritual interests are vitally centered in his vocation. The development of will, the steadying of purpose, the unfolding of ideals, the cultivation of vocational virtues, such as industry, fidelity, order, honesty, prudence, thrift, patience, persistence, courage, self-reliance, etc.—all of this makes tremendously for his moral and spiritual development. The vocationless man, no matter to what class he belongs, suffers a great moral and spiritual disadvantage. His life lacks idealization and is therefore wanting in unity and high moralization. His changeable task, with its changeable efforts, does not afford so good an opportunity for the development of the economic and social virtues as that afforded the man who pursues a definite life-work. It lacks also that discipline—not only mental, but moral—which the attainment of vocational skill and efficiency involves. \n \n But notwithstanding the important issues involved in a man’s vocational career, little has been done in a practical or systematic way to help our college young men to a wise decision in the determination of theirvii life-work. Commendable efforts are being put forth in our public schools in this direction, but very little, indeed, has been done in this respect in the sphere of higher education. To any one familiar with the struggles of the average college student in his efforts to settle this weighty question for himself, the perplexities, embarrassment, and apparent helplessness are pathetic. This is due largely to his ignorance of the nature of the professions and other vocations which appeal most strongly to the college man. Consequently, he does not know how to estimate his fitness for them. He cannot advise to any extent with his father, because he represents only one vocation. Neither can he advise advantageously with his instructor for he, too, is familiar with the nature of only one profession. \n \n For this reason, a series of books, dealing with the leading vocations, and prepared by men of large ability and experience, capable of giving wise counsel, is a desideratum. Such men are competent to explain the nature and divisions of the particular vocations which they represent, the personal and educational qualifications necessary for a successful pursuit of the same, the advantages and disadvantages, the difficulties and temptations, the opportunities and ideals; thus, in an adequate way, enabling the student to estimate his own fitness for them. They are also able to make valuable suggestions relating to the man’s work after he enters upon his vocation. \n \n viii Fortunately, in the present Series, the Editor has been able to secure the services of some of the most eminent experts in the country to prepare the respective volumes—men of large knowledge and experience, who have attained wide recognition and genuine success in their “callings.” It is a pleasure to be able to place at the command of the many thousands of students in our American colleges the wise counsel of such experienced and distinguished men. \n \n The “Vocational Series” will consist of twelve books written by representatives of different vocations, as follow: \n \n 1. The Young Man and the Law \n \n Hon. Simeon E. Baldwin, LL.D., Professor of Law, Emeritus, Yale University, ex-Governor and ex-Chief Justice of Connecticut \n \n 2. The Young Man and the Ministry \n \n Rev. Charles R. Brown, D.D., LL.D., Dean of the Divinity School, Yale University \n \n 3. The Young Man and Teaching \n \n Professor Henry Parks Wright, Ph.D., LL.D., Professor Emeritus and formerly Dean of Yale College \n \n 4. The Young Man and Medicine \n \n Lewellys F. Barker, M.D., LL.D., Professor of Medicine and Chief Physician, Johns Hopkins University \n \n 5. The Young Man and Journalism \n \n Chester Sanders Lord, M.A., LL.D., formerly Managing Editor, New York Sun \n \n ix 6. The Young Man and Banking \n \n Hon. Frank A. Vanderlip, M.A., LL.D., formerly President of the City National Bank, New York \n \n 7. The Young Man and Business \n \n 8. The Young Man and Mechanical Engineering \n \n Lester P. Breckenridge, M.A., Eng.D., Professor of Mechanical Engineering, Sheffield Scientific School, Yale University \n \n 9. The Young Man and Electrical Engineering \n \n Charles F. Scott, Sc.D., Eng.D., Professor of Electrical Engineering, Sheffield Scientific School, Yale University \n \n 10. The Young Man and Civil Engineering \n \n George F. Swain, LL.D., Professor of Civil Engineering, Harvard University \n \n 11. The Young Man and Farming \n \n L. H. Bailey, M.S., LL.D., formerly Director of College of Agriculture, Cornell University, and Editor of Cyclopedia of American Horticulture, Rural Science Series, Garden Craft Series, Rural Text-Book Series, Cyclopedia of Agriculture, etc. \n \n 12. The Young Man and Government Service \n \n Hon. William Howard Taft, D.C.L., LL.D., ex-President of the United States, and Chief Justice of the United States Supreme Court \n \n E. Hershey Sneath. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1963/56279.html","bookId":735,"book":{"id":735,"title":"The Young Man and Journalism","description":"简介： One of the most important decisions a young man is called upon to make relates to the determination of his life-work. It is fraught with serious consequence for him. It involves the possibilities of success and failure....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1963","creation":"Aug 1, 2019 12:19:14 AM","modification":"Aug 1, 2019 12:19:14 AM"}}
