{"id":18600,"no":20,"title":"CHAPTER XX. WHEN IN DOUBT, PLAY TRUMPS.","content":"Life is a game \n The keenest wins. \n Repute or shame. \n Life is a game; \n We give or claim \n For virtues, sins; \n Life is a game \n The keenest wins \n \n Beaumont was perfectly satisfied with the result of his experiment, as he had discovered the squire\u0027s secret, and had yet succeeded in keeping him in ignorance of his having done so. With the keen intellect of a man accustomed to live by his wits, he had, during his rapid survey of the papers, seen the chances of turning the secret to his own advantage. But to do so he required the co-operation of Patience, and this he was doubtful of obtaining. \n \n She held studiously aloof from him, and since the interview in the churchyard had given no sign that she was aware of his existence. Many men would have been discouraged by this contemptuous silence; but not so Beaumont, who never saw discourtesy in anyone of whom he wanted to make use. Hitherto Patience had been a mere cipher in his eyes; but now, since his discovery of the existence of her son, and since he had learned the jealously-guarded secret of the squire, she suddenly became an important person; for it was through her he hoped to secure his ends--ends calculated to benefit himself alone. \n \n The only way by which he could hope to gain her ear was through her love for their son, hence his explanation on the stairs. Now, after putting away his painting utensils, he lighted a cigarette, and strolled easily along to the housekeeper\u0027s room in order to arrange matters with her. Of the result he had no fear, as he intended to appeal to her motherhood, which appeal, he well knew, would not be neglected by this woman, whose whole life was devoted to her son. Mr. Beaumont was an expert whist-player, and, moreover, admired the game very much. So, in this case, being somewhat doubtful of Patience, yet holding a strong hand, he took an illustration from his favourite game, and said: \n \n \"When in doubt, play trumps.\" \n \n \"It will be a charming game,\" he murmured, as he knocked at the door of the housekeeper\u0027s room, \"she is no mean adversary, and hates me like poison--all the more credit to me if I win--as I mean to.\" \n \n Patience Allerby, in her quiet, grey dress, was sitting silent and statuesque by the window, staring out at the rapidly darkening landscape. When Beaumont entered, she looked coldly at him, but neither rose to receive him nor invited him to sit down. Her visitor, however, was not troubled by any sensitive feeling, so threw himself into a comfortable chair that was near the fire, and coolly went on smoking. \n \n \"I hope you don\u0027t mind my cigarette,\" he said, languidly, \"but I can\u0027t exist without smoking.\" \n \n \"You can\u0027t exist without all sorts of luxuries,\" replied Patience, bitterly, \"you\u0027re not the man to deny yourself anything.\" \n \n \"I had to deny myself a good many things when we were starving in London,\" said Mr. Beaumont, leisurely. \"By the way, I want to speak to you about London.\" \n \n \"And I want to speak to you about the squire,\" she retorted, quickly. \"What were you doing following him upstairs?\" \n \n \"Don\u0027t distress yourself, my good soul,\" said the artist, in a coolly aggravating manner. \"I\u0027ll tell you that later on; meantime, we will talk of Chelsea.\" \n \n \"No.\" \n \n \"Pardon me--yes. Do you remember how we lived there, you and I, and the visions we used to indulge in? I haven\u0027t forgotten it, I assure you, and then Fanny Blake--poor Fanny! she is dead now. I see you gave the boy her surname.\" \n \n \"And what if I did?\" she flashed out fiercely, with a deep frown on her face. \"Could I give him yours--the father who had deserted him? Could I give him mine--the mother to whom his birth was a disgrace?\" \n \n \"A disgrace! I thought you loved him?\" \n \n \"So I do--I love him more than my life; but his birth was a disgrace, and I wish to keep the knowledge from him, please God.\" \n \n \"Was the boy you call Reginald Blake ever christened?\" \n \n \"No.\" \n \n \"Why not?\" \n \n \"Because I could not tell the truth about his birth, and I refused to tell a lie. He was neither christened, nor was his birth registered.\" \n \n \"Then he has no right to the name he bears.\" \n \n \"I know that. Whose fault is it, Basil Beaumont--yours or mine? Why didn\u0027t you make an honest woman of me?\" \n \n \"Because I did not choose to,\" he replied, coolly; \"by the way, has our son been confirmed?\" \n \n \"No.\" \n \n \"Oh,\" he said, sneering, \"I\u0027m sorry he\u0027s not got some religious flavour about him. I wonder, Patience, when you called him Blake, you did not pass him off as Fanny\u0027s son.\" \n \n She arose from her seat in a fury. \n \n \"Do you think I was going to place my sin on Fanny\u0027s shoulders?\" \n \n \"I don\u0027t see why not--Fanny and yourself both came up to London at the same time--the child was born six months after you arrived there--why not call it Fanny\u0027s child?\" \n \n \"There was no reason.\" \n \n \"Not then; but there is now, and a very excellent reason--ten thousand a year.\" \n \n \"What do you mean?\" \n \n \"Simply this, that Reginald Blake, from this time forward, is the son of Fanny Blake and Randal Garsworth.\" \n \n Patience looked at him in surprise, and involuntarily drew back a step, thinking him mad. Beaumont saw this, and laughed mockingly. \n \n \"Don\u0027t be afraid--there\u0027s method in my madness.\" \n \n \"There\u0027s some villainy in it,\" she said, with a hard smile, sitting down near him; \"tell me what you mean, Basil Beaumont, if you intend touching a hair of my son\u0027s head I\u0027ll punish you.\" \n \n \"I intend to give him ten thousand a year, if you won\u0027t be a fool.\" \n \n She smiled coldly, and folded her hands upon her lap. \n \n \"I\u0027m no fool, but I know you--go on, Ananias.\" \n \n Beaumont flung the burnt-out cigarette into the fire with an irritable gesture, and turned his face towards the frigid woman seated before him. \n \n \"Listen to what I\u0027ve got to say,\" he said slowly, \"and then you can do as you please--if you assist me it means money and happiness for our son; if you don\u0027t, I\u0027ll tell him everything, and then leave the village for ever.\" \n \n Patience shivered slightly under the steely glitter of his eyes, and then resumed her cold impassive manner. \n \n \"Brag\u0027s a good dog,\" she said mockingly, \"but he does not bite--go on, I\u0027m all attention.\" \n \n The artist glanced at the door to make sure that it was closed, then drawing his chair closer to that of Patience Allerby, began to talk rapidly, in a low tone of voice. \n \n \"Of course you know the squire is mad--quite mad--he has an idea that his soul will be re-incarnated in another body, and as he is afraid he may be born poor, he has invented a silly scheme by which to become repossessed of his present wealth. I have discovered this scheme--how it does not matter--all I need tell you is, that I have found out all about it--his idea is to pass himself off as his own son.\" \n \n \"But he has no son.\" \n \n \"Of course not, you fool,\" said \"Beaumont impatiently, \"he couldn\u0027t \"carry out his idea if he had; it\u0027s this way, he has made his will, leaving the property to his natural son, who will at some future time--date not fixed, as he cannot tell when he\u0027ll be re-incarnated--go to the lawyers who hold the will and produce, as a proof of his claim to the estate, a letter written to him by his supposed father, also the squire\u0027s seal ring--when he does so, under the terms of the will, he inherits the Garsworth estate.\" \n \n \"I understand, so far; but how does the squire, in a new body, expect to get these papers?\" \n \n \"Oh! he thinks he\u0027ll remember about the affair when he is born again, so he has hidden the papers where he\u0027ll be able to find them--in his new body he\u0027ll simply go and look them up, produce them to the lawyers, and there you are.\" \n \n \"What a foolish idea.\" \n \n \"What a foolish remark, you mean,\" said Beaumont; \"of course it\u0027s foolish, the man is mad. When he dies the papers will remain undisturbed till doomsday--if I choose.\" \n \n \"What do you mean?\" \n \n \"Simply this--as he does not know when or where he\u0027ll be re-incarnated, he has left a number of blanks in the letter.\" \n \n \"Have you seen the letter?\" \n \n \"Of course I have. I know where the paper is hidden--didn\u0027t I tell you I\u0027d discovered his secret. Well, all I\u0027ve got to do is to fill up these blanks--the name of the mother, the place of the supposed son\u0027s birth, and all the rest of it.\" \n \n \"I see. But what have I to do with this?\" \n \n Beaumont arose to his feet and walked angrily to and fro. \n \n \"What an idiot you are, Patience,\" he said irritably. \"Can\u0027t you see? I\u0027m going to fill up the mother\u0027s name as Fanny Blake, and the son\u0027s as Reginald.\" \n \n \"Our son?\" \n \n \"Precisely. Now do you see why I want your help?\" \n \n \"I do, but you shan\u0027t have it.\" \n \n \"Indeed; why not?\" \n \n \"I\u0027m not going to have such a sin on my conscience.\" \n \n \"There\u0027s no sin, you Puritan,\" he said quickly, \"the re-incarnation idea is rubbish; no one will appear to claim the property, so why not give the ten thousand a year to Reginald?\" \n \n \"It would dispossess Miss Una.\" \n \n \"It would do nothing of the sort--under the will Miss Una cannot claim--the lawyers don\u0027t know anything about the re-incarnation theory; all they know is that Squire Garsworth has a son who will appear and prove his claim by the possession of certain papers and a seal ring--until that son appears no one can claim the estate.\" \n \n \"Miss Una could dispute the will on the ground of madness.\" \n \n \"I dare say she could, but she won\u0027t--if Reginald becomes master of Garsworth Grange she will marry him, and will enjoy the property just the same as if she were sole heiress--on the other hand, if he does not become master she\u0027ll have to wait till this non-existent son appears or upsets the will, one of which things will be impossible and the other troublesome.\" \n \n Patience thought for a moment or two and then looked up. \n \n \"How do you know Reginald will marry Una?\" \n \n \"Because I\u0027ve got eyes in my head. The boy is madly in love with her. I\u0027m sure you must see that your helping me to place Reginald in possession of this property will hurt no one and be for the benefit of both Una and your own son.\" \n \n \"I see that, but I fail to see what benefit you obtain from it, and I don\u0027t think you\u0027re the man to work for nothing.\" \n \n \"You\u0027re perfectly right,\" he replied calmly, \"but I\u0027m going to make myself Reginald\u0027s right hand, and when he comes in for the property I can help him to look after the estate.\" \n \n \"And ruin him.\" \n \n \"I won\u0027t ruin him. Why should I want to ruin my own son?\" \n \n \"Bah! don\u0027t talk like that to me.\" \n \n \"Oh well, if you disbelieve in interest, I\u0027ll put it another way. Why should I kill the goose with the golden eggs?\" \n \n \"Yes, that\u0027s more like it,\" she said with a sneer, \"I think your plan is an admirable one, but there\u0027s one obstacle.\" \n \n \"What is it?\" \n \n \"Reginald is an honourable man, and won\u0027t accept any property gained by fraud.\" \n \n Beaumont sighed in a resigned manner, apparently hopeless of explaining matters clearly to this painfully obstinate woman. \n \n \"He\u0027ll never know the property is obtained by fraud, because you will tell him he is the son of Fanny Blake and the squire; he will believe you, and regard himself as the lawful heir.\" \n \n \"Still, he thinks he\u0027s been born in lawful wedlock, and to undeceive him----\" \n \n \"Gives him ten thousand a year,\" interrupted Beaumont coolly. \"Well, what do you say, will you help me?\" \n \n \"I\u0027ll tell you to-morrow.\" \n \n \"Why not to-day?\" \n \n \"Because I don\u0027t trust you, I want to go over the affair in my own mind.\" \n \n Beaumont shrugged his shoulders, put on his hat and lighted another cigarette. \n \n \"Just as you please,\" he said, pausing a moment at the door. \"I\u0027ll call and see you to-morrow; but if you don\u0027t help me in this, I\u0027ll do what I say and tell Reginald everything.\" \n \n When he was gone Patience sat for a long time looking into the fire, evidently pondering deeply. At length she sighed and muttered: \n \n \"I don\u0027t know what to do, I must ask counsel of the Lord.\" \n \n She arose, and having lighted a candle opened the Bible. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1864/53961.html","bookId":826,"book":{"id":826,"title":"The Man with a Secret","description":"简介： It was the high road to the village of Garsworth, wide, deeply rutted, and somewhat grass-grown, with a tall hedge of yellow-blossomed gorse on the one side, and on the other a ragged, broken fence, over which leaned a man absorbed in meditation, his...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1864","creation":"Aug 1, 2019 12:19:37 AM","modification":"Aug 1, 2019 12:19:37 AM"}}
