{"id":18609,"no":29,"title":"CHAPTER XXIX. FROM DR. NESTLEY\u0027S POINT OF VIEW.","content":"So low--so low--yes I am low indeed \n But he thy lover tho\u0027 of high estate \n Will fall to this--I tell thee dainty dame \n The devil even now is at his ear \n Breathing temptations in most subtle guise \n Which soon will lose him all he holds most dear. \n \n The autumn was now nearly over, and it was that bleak, chill season just before winter when the trees, denuded of foliage, seemed to wait for the snow to cover the bare branches which shivered complainingly in the chill wind. Under foot the ground was dark and sodden, overhead the sky dull and lowering, while piercingly cold blasts blew across the lonely marshes and whistled shrilly over the waste moorland. \n \n Dreary and desolate as it had looked in summer time, Garsworth Grange appeared even more dreary and desolate under the sombre-coloured sky. The damp had discoloured the white marble of the statues, which seemed lost amid the surrounding desert of bare trees and dead leaves. It was everlastingly raining, and Una, looking out of the antique windows at the gloomy landscape seen through the driving mists of rain, felt dull and depressed. All day long the winds whistled through the dismal rooms, and the rain ceaselessly dripped from the eaves, so it was hardly to be wondered that both Una and Miss Cassy felt anything but cheerful. \n \n It was now about two months since Reginald had gone up to town, and Una had received frequent letters from him about the way in which everything was being arranged by the lawyers. Of late these letters had become feverish in tone, as if the writer were trying to invest his correspondence with a kind of fictitious gaiety he was far from feeling, and this sudden change of style gave her serious uneasiness. She knew how sensitive Reginald was, and how deeply he had felt the discovery of his real birth, so dreaded lest to banish the spectres which haunted him he should plunge into dissipation. In one of his letters also he had mentioned that he had met Beaumont in town, and as Una learned from the vicar that Dick Pemberton had gone to Folkestone to see his uncle, she felt doubtful as to the wisdom of an inexperienced youth like Reginald being left alone in London with a reckless, man of the world like Beaumont. \n \n She had mistrusted Beaumont when she first met him, but by his fascinating manner he had succeeded in overcoming her repugnance, but now that he was away the influence of his strong personality died out, and she began to dread his power over her lover\u0027s honourable, guileless nature. \n \n \"I wish Reginald would come back at once,\" she said to Miss Cassy, \"and then we could be married, and he would have some one to look after him.\" \n \n \"I\u0027m sure I\u0027ll be glad when you are married,\" whimpered Miss Cassy, whose spirits the lonely life she was leading sadly depressed. \"I\u0027ll go melancholy mad if I stay here--I know I shall. I\u0027m sure that isn\u0027t odd, is it? I feel like what\u0027s-her-name in the Moated Grange, you know--the weary, weary dead thing I mean, and the gloomy flats--not half so nice as the flat we had in town. If we could only go to it again--I feel so shivery.\" \n \n And so Miss Cassy rambled on in a disconnected fashion, one thought suggesting another, while Una sat staring out of the window, with Reginald\u0027s last letter in her hand, wondering what was best to be done. \n \n \"I don\u0027t trust Mr. Beaumont,\" she said at length. \"He is not a good companion for Reginald.\" \n \n \"Oh, my dear,\" said Miss Cassy, picking up the tea-cosy, which she kept by her to put on her head when she felt cold, \"such a charming man--quite a Lord what\u0027s-his-name in his manners.\" \n \n \"His manners are all right, I\u0027ve no doubt,\" returned Una drily, \"but what about his morals?\" \n \n Miss Cassy gave a little girlish scream and extinguished herself with the tea-cosy. \n \n \"What dreadful things you do say, Una,\" she observed in a shocked tone. \"So very odd--quite like Zola, so very French.\" \n \n \"My dear aunty, I know you are one of those people who think that unmarried girls should be absolutely ignorant of such things. I don\u0027t agree with you. There\u0027s no need of them to parade their knowledge of evil, but they cannot help hearing about it, however carefully brought up. I know London is not a good place for a young man with plenty of money, especially when he is so inexperienced as Reginald--besides, Mr. Beaumont is a man of the world, whom I really believe lives by his wits--and if it be a case of his wits against Reginald\u0027s, my dear aunt, I\u0027m afraid poor Reginald will come off worst.\" \n \n \"What\u0027s to be done then?\" said Miss Cassy blankly. \"Do you think if I sent dear Reginald some tracts----\" \n \n \"I don\u0027t think that would be much use,\" interrupted Una laughing. \"No, I\u0027ll go over to Garsworth to see the vicar--he will know what is best to be done. I will show him Reginald\u0027s letter, and I\u0027m sure he will agree with me that it will be wise to withdraw him from Mr. Beaumont\u0027s influence.\" \n \n \"Why doesn\u0027t Mr. Bolby look after him?\" said Miss Cassy indignantly. \n \n \"I daresay Mr. Bolby has got his own business to look after,\" replied Una with a faint sigh; \"besides, he only regards Reginald from a monetary point of view, nothing more--will you come to the vicarage with me, aunt?\" \n \n \"Oh yes, dear,\" cried Miss Cassy with great alacrity, \"the walk will do me good, and I\u0027m so dull--I\u0027ll talk to dear Mrs. Larcher, you know, she\u0027s so odd, but still she\u0027s better than one\u0027s own company, isn\u0027t she, dear?--let us get ready at once--the rain has gone off I see.\" \n \n \"Then let us follow the example of the rain,\" said Una with a laugh, and the two ladies went away to prepare themselves for their walk. \n \n When they sallied forth with heavy cloaks and thick boots, they found that for once the sun had shown his face and was looking through the watery clouds in a somewhat feeble fashion. The ground under foot was wet and spongy, still it was better than being immured in the dreary Grange, and as they walked rapidly along their spirits rose in spite of the depressing influence of the weather. \n \n When they arrived at the bridge after a sharp walk they saw a man leaning over the parapet looking at the cold grey water swirling below. \n \n \"Dear me, Una, how very odd,\" exclaimed Miss Cassy, \"there is Dr. Nestley.\" \n \n \"Dr. Nestley,\" echoed Una rather startled. \"I thought he had gone away last week?\" \n \n \"He was going, but for some reason did not,\" answered Miss Cassy, who by some mysterious means heard all the gossip of the village. \"I hear he is still staying at Kossiter\u0027s--drinking, my dear--oh dreadful--so very odd.\" \n \n By this time they were directly in the centre of the bridge, and hearing footsteps Nestley turned round, showing a wan haggard face with dull bleared eyes filled with mute misery. So ill and desolate did the young man look that Una\u0027s heart smote her as she thought the change was brought about through her refusal to marry him, and though she despised him for his weakness of character in thus being influenced, yet she still felt pity for the helplessness of the poor fellow. Nestley flushed as he recognized the two ladies, then raised his hat and without saying a word turned once more to look at the river. Una felt uneasy as he did so, for a sudden doubt arose in her heart as to whether he did not intend to put an end to his life, so taking a sudden resolution she whispered to Miss Cassy to walk on by herself to the vicarage. \n \n \"I will join you soon,\" she said in a low voice, \"but first I want to speak to Dr. Nestley.\" \n \n \"But it\u0027s so odd,\" objected Miss Cassy, \"really so very--very odd.\" \n \n Nevertheless she made no further objection and trotted away through the village street, leaving Una alone on the bridge with Dr. Nestley. Though the unhappy young man knew that she was still behind him he did not turn round but kept staring dully at the foam-streaked waters of the Gar. \n \n \"Dr. Nestley,\" she said, softly touching him on the shoulder, \"I want to speak to you.\" \n \n He turned sullenly round, though the touch of her gloved hand sent a thrill through his frame, and Una recoiled with an exclamation of pity as she saw what a wreck he was. His face, formerly so fresh-coloured, was now grey and thin, his eyes bleared with dark circles under them, while his nervous lips and shaking hands showed how deeply he had been drinking. Even in his clothes she saw a change, for they were carelessly put on, his linen was dirty and his tie arranged in a slovenly manner--altogether he looked like a man who had entirely lost his self-respect and cared neither for his health nor appearance. \n \n Nestley saw the expression on her face and laughed, a hollow mirthless laugh, which seemed quite in keeping with his wretched appearance. \n \n \"You are looking at your work, Miss Challoner,\" he said bitterly, \"well, I hope you are satisfied.\" \n \n Una\u0027s pride was up in arms at once. \n \n \"You have no right to speak to me in such a manner, sir,\" she said haughtily, looking at him with a proud cold face. \"Do not ascribe your own folly to any fault of mine--that is both weak and unmanly.\" \n \n The wretched creature before her drooped his head before the severe gaze of her eyes. \n \n \"You would not marry me,\" he said weakly, \"you would not save me from myself.\" \n \n \"Am I to go through the world saving men from their own passions?\" she returned scornfully. \"Shame upon you, Dr. Nestley, to take refuge behind such a weak defence. Surely because a woman refuses to marry a man he ought not to lower himself as you have done, and then lay the blame on her instead of himself--you ought to make an end of this folly.\" \n \n \"Just what I was thinking,\" he muttered, glancing at the river. She instinctively guessed what the glance meant, and looked at him, saying: \n \n \"Would you add suicide to the rest of your follies?--that is a coward\u0027s refuge and one not worthy of a clever man like you. Come, Doctor Nestley,\" she continued, laying a kind hand on his shoulder, \"be advised by me. Give up this mad love of drink which is lowering you to the level of the brutes, and go back to your home--then amid your old companions you will soon forget that I ever existed.\" \n \n \"Never! Never!\" he said in a broken voice. \n \n \"Oh yes you will,\" she replied cheerfully. \"Time is a wonderful consoler--besides, Doctor Nestley, I could never have married you, for though you did not know then you know now--I am going to marry Mr. Blake.\" \n \n \"And what difference will that make to you?\" he asked mockingly, lifting his dull eyes to her earnest face. \n \n \"I do not understand you,\" she said coldly, drawing back. \n \n \"Then I can easily explain,\" replied the young man quickly, \"the only difference will be this--you love him, you do not love me--for the rest both Reginald Blake--or shall I call him Garsworth?--and myself will be equal in all else.\" \n \n \"You are talking wildly,\" said Una in an icy tone, \"so I shall leave you--permit me to pass if you please?\" \n \n \"Not till I have had my say,\" he retorted, his eyes growing bright. \"I can wring your proud heart now as you wrung mine then. I saw your look of horror when you looked at me and saw how low I had fallen through drink--in the same way you will look upon your lover when he returns from the guardianship of Basil Beaumont.\" \n \n Una gave a cry of alarm and reeled against the stone parapet of the bridge for support, while a cold hand seemed to clutch at her heart. \n \n \"You have heard of those devils of old who tempted mankind,\" went on Nestley rapidly. \"Yes, you have heard such stories and thought them pious fictions of Catholicism--but it is true, quite true. There are devils of like sort in our midst even now, and Basil Beaumont is one. I knew him in London five years ago when I was a young man just starting in life. I had no vices, I had great talents, I was devoted to my profession and all seemed to promise a fair life. But Beaumont came, devil that he is, in the guise of an angel of light, and ruined me. He beguiled me with his wheedling tongue and specious manners into believing in him. Having gained my confidence he led me to gamble and drink until I sank so low that even he forsook me--yes, forsook the man he had ruined. It was when his fatal influence was withdrawn that I began to recover. I took the pledge, left London and its fascinations and plunged into hard work. For five years I never touched alcohol and things seemed going well with me once more--but I came down here and met him again. I resisted his persuasions for a long time, but on the night you rejected me I was worn out with watching by the bedside of the Squire, and sick with disappointment; he persuaded me to take a glass of wine--it was followed by another--and then--I need not go on, but next morning I found I had lost my self-respect. I gave way to despair, there seemed no hope for me, and now see what I am, and all through Basil Beaumont--I have lost my good name--my money--my position--everything--everything in the world.\" \n \n Sick with horror Una tried to speak, but could only look at him with white lips and a terrified face. Seeing her alarm he resumed his discourse but in a somewhat milder fashion. \n \n \"Your lover has gone to London, and Beaumont is with him. He is the possessor of money. Beaumont will want to handle that money; to do so he will reduce Reginald Blake to a mere cypher. Do you know how he will do it? I will tell you. By fast living--he will reduce your lover to the abject condition I was in, and through him squander the Garsworth money. It does not matter how high Reginald Blake\u0027s principles may be, how pure he desires to live, how temperate he may have been, he is in the power of Basil Beaumont, and, little by little, will be dragged down to the lowest depths of degradation and despair.\" \n \n \"No, no!\" she cried, wildly, \"it cannot be!\" \n \n \"It will be, I tell you--I know Beaumont, you do not--if you would save your lover, get him out of the clutches of that devil, or he will become an object of horror to you as I am.\" \n \n He turned away with a look of despair, and crossing the bridge on to the common, slouched along the muddy road without casting a glance back, while Una, with pale face and tightly-clenched hands, gazed after him with mute agony in her eyes. \n \n \"Oh, great Heaven!\" she moaned, lifting up her wan face to the grey sky, \"if this should be true--it must be true--I can see he is speaking the truth! Reginald to sink to that--no, no! I\u0027ll go and see the vicar. I will tell him all--all! We must save him before it is too late!\" \n \n With feverish impatience she began to walk down the street on her way to the vicarage, intent only on finding some means of saving the man she loved. \n \n And the man who had no woman to save him slouched wearily along the road--a lonely, desolate figure, with only the grey sky above and the grey earth below, with no hope, no peace, no love awaiting him, but only the blank, black shadow of approaching sorrow brooding over his life with sombre wings. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1864/53970.html","bookId":826,"book":{"id":826,"title":"The Man with a Secret","description":"简介： It was the high road to the village of Garsworth, wide, deeply rutted, and somewhat grass-grown, with a tall hedge of yellow-blossomed gorse on the one side, and on the other a ragged, broken fence, over which leaned a man absorbed in meditation, his...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1864","creation":"Aug 1, 2019 12:19:37 AM","modification":"Aug 1, 2019 12:19:37 AM"}}
