{"id":23567,"no":17,"title":"THE CHRISTMAS GIFT.","content":"Heavily, heavily fell the snow, covering the dark-brown earth, already hardened by the frost, with a pure white covering. As the rain falls alike upon the just and upon the unjust; so, too, the snow, God’s kindred messenger, knows no distinction of persons,—visiting all alike, forgetting none, and passing by none. In one of the principal streets of New York stood a boy of some twelve years. His clothing was poor, and too scanty to afford a sufficient protection against the inclemency of the season. Through the visor of his cap, which had become detached in the middle, having a connection only at the[206] two extremities, might be seen his rich brown hair. Notwithstanding the drawback of his coarse and ill-fitting attire, it was evident that he possessed a more than ordinary share of boyish beauty. But just at present his brow is overcast with a shade of anxiety; and his frame trembles with the cold, from which he is so insufficiently shielded. It is a handsome street, that in which he is standing. On either side he beholds the residences of those on whom Fortune has showered her favors. Bright lights gleam from the parlor windows, and shouts of mirth and laughter ring out upon the night. All is joy and brightness and festivity within those palace-homes. The snow-flakes fall idly against the window-panes. They cannot chill the hearts within, nor place a bar upon their enjoyment; for this is Christmas Eve, long awaited, at length arrived.[207] Christmas Eve, around which so many youthful anticipations cluster, has enjoyments peculiarly its own, over which the elements, however boisterous, have no control. Yet, to some, Christmas Eve brings more sorrow than enjoyment,—serving only to heighten the contrast between present poverty and discomfort and past affluence. But all this time we have left our little hero shivering in the street. Cold and uncomfortable as he was, as well as anxious in mind,—for he had lost his way, and knew not how to find it again,—he could not help forgetting his situation, for the time, in witnessing the scene which met his eye, as, for a moment, he stood in front of a handsome residence on the south side of the street. The curtains were drawn aside; so that, by supporting himself on the railing, he had an unobstructed view of the scene within. It was a spacious parlor, furnished in a[208] style elegant, but not ostentatious. In the centre of the apartment was a Christmas-tree, brilliant with tapers, which were gleaming from every branch and twig. Gifts of various kinds were hung upon the tree, around which were gathered a group of three children, respectively of eight, six, and four years. The eldest was a winsome fairy, with sparkling eyes and dancing feet. The others were boys, who were making the most of this rare opportunity of sitting up after nine o’clock. At a little distance stood Mr. Dinsmoor and his wife, gazing with unalloyed enjoyment at the happiness of their children. While Lizzie was indulging in expressions of delight at the superb wax doll which St. Nicholas had so generously provided, her attention was for a moment drawn to the window, through which she distinctly saw the figure of our hero, who, as we have said, had in his eagerness raised[209] himself upon the railing outside, in order to obtain a better view. She uttered an exclamation of surprise. “Why, mother! there’s a boy looking in at the window! Just look at him!” Mrs. Dinsmoor looked in the direction indicated, and saw the little boy, without his perceiving that attention had been drawn towards him. “Some poor boy,” she remarked to her husband, in a compassionate tone, “who loses for a moment the sensation of his own discomfort in witnessing our happiness. See how eagerly he looks at the tree! which no doubt appears like something marvellous to him.” “Why can’t you let him come in?” asked Lizzie, eagerly. “He must be very cold out there, with the snow-flakes falling upon him. Perhaps he would like to have a nearer view of our tree.” “Very well and kindly thought of, my[210] little girl,” said Mr. Dinsmoor, placing his hand for a moment upon her clustering locks. “I will follow your suggestion; but I must do it carefully, or he may be frightened, and run away before he knows what are our intentions.” So speaking, Mr. Dinsmoor moved cautiously to the front door, and opened it suddenly. The boy, startled by the sound, turned towards Mr. Dinsmoor with a frightened air, as if fearing that he would be suspected of some improper motive. “Indeed, sir,” said he, earnestly, “I didn’t mean any harm; but it looked so bright and cheerful inside that I couldn’t help looking in.” “You have done nothing wrong, my boy,” said Mr. Dinsmoor, kindly. “But you must be cold here. Come in, and you will have a chance to see more comfortably than you now do.” The boy looked a little doubtful; for to[211] him, neglected as he had been by the rich and prosperous all his life, it was very difficult to imagine that he was actually invited to enter the imposing mansion before him as a guest. Perhaps Mr. Dinsmoor divined his doubts; for he continued,— “Come: you must not refuse the invitation. There are some little people inside who would be very much disappointed if you should, since it was they who commissioned me to invite you.” “I am sure, sir, I am very much obliged both to them and to you,” said the boy, gratefully, advancing towards Mr. Dinsmoor, of whom he had lost whatever little distrust he had at first felt. A moment afterwards, and the boy stepped within the spacious parlor. To him, whose home offered no attractions, and few comforts, the scene spread before him might well seem a scene of enchantment. [212] “Lizzie,” said Mr. Dinsmoor, “come forward and welcome your guest. I would introduce him to you; but, unluckily, I do not know his name.” “My name is Willie,—Willie Grant,” was the boy’s reply. “Then, Willie Grant, this is Miss Lizzie Dinsmoor, who is, I am sure, glad to see you, since it was at her request that I invited you to enter.” Willie raised his eyes timidly, and bent them for a moment on the singularly beautiful child, who had come forward and frankly placed her hand in his. There is something irresistible in the witchery of beauty; and Willie felt a warm glow crimsoning his cheeks, as for a moment, forgetful of every thing else, he bent his eyes earnestly upon Lizzie. Then another feeling came over him; and, with a look of shame at his scanty and ill-fitting garments, he dropped her hand, and involuntarily[213] shrank back, as if seeking to screen them from sight. Perceiving the movement, and guessing its cause, Mr. Dinsmoor, with a view to dissipate these feelings, led forward Harry and Charlie, the younger boys, and told them to make acquaintance with Willie. With loud shouts of delight, they displayed the various gifts which St. Nicholas had brought them, and challenged his admiration. Every thing was new to Willie. His childhood had not been smiled upon by Fortune; and the costly toys which the boys exhibited elicited quite as much admiration as they could desire. Occupied in this way, his constraint gradually wore off to such a degree that he assisted Charlie and Harry in trying their new toys. Soon, however, the recollection that it was growing late, and that he had yet to find his way home, came to him; and,[214] taking his old hat, he said to Mr. Dinsmoor, in an embarrassed manner,— “My mother will be expecting me home; and I should already have been there, but that I lost my way, and happened to look in at your window, and you were so kind as to let me come in.” “Where does your mother live, my little fellow?” asked Mr. Dinsmoor. “On ? Street.” “Oh! that is not far off. I will myself show you the way, if you will remain a few minutes longer.” Mr. Dinsmoor rang the bell, and ordered a plate of cake and apples, as he conjectured they would not be unacceptable to his little visitor. Meanwhile, Lizzie crept to her mother’s side, and whispered,— “Willie is poor,—isn’t he?” “Yes. What makes you ask?” “I thought he must be, because his[215] clothes look so thin, and patched. Don’t you think he would like a Christmas present, mother?” “Yes, my darling. Have you any thing to give him?” “I thought, mother, perhaps you would let me give him my five-dollar gold-piece. I think that would be better than any playthings. May I give it?” “Yes, my child, if you are really willing. But are you quite sure that you would not regret it afterwards?” “Yes, mother.” And Lizzie ran lightly to the little box where she kept her treasure, quickly brought it forth, and placed it in Willie’s hand. “That is your Christmas present,” said she, gayly. Willie looked surprised. “Do you mean it for me?” he asked, in a half-bewildered tone. “Yes, if you like it.” [216] “I thank you very much for your kindness,” said Willie, earnestly, “and I will always remember it.” There was something in the boy’s earnest tone which Lizzie felt was an ample recompense for the little sacrifice she had made. Mr. Dinsmoor fulfilled his promise, and walked with Willie as far as the street in which he lived, when, feeling sure that he could no longer mistake his way, he left him. Mr. Dinsmoor, whom we have introduced to our readers, was a prosperous merchant, and counted his wealth by hundreds of thousands. Fortunately, his disposition was liberal; and he made the poor sharers with him in the gifts which Fortune had so liberally showered upon him. Notwithstanding the good use which he made of his wealth, he was fated to experience reverses,—resulting, not from his own mismanagement, but from a general[217] commercial panic, which all at once involved in ruin many whose fortunes were large, and whose credit was long established. In a word, Mr. Dinsmoor failed. Eleven years had rolled by since the Christmas night on which our story opens. Lizzie had not belied the promise of her girlhood, but had developed into a radiantly beautiful girl. Already her hand had been sought in marriage; but, as yet, she had seen no one on whom she could look with that affection without which marriage would be a mockery. Charlie and Harry, too,—eleven years had changed them not a little. The boys of four and six had become fine, manly youths of fifteen and seventeen. The eldest had entered college. Harry, however, who was by no means studious, had entered his father’s counting-room. That was a sorrowful night on which Mr.[218] Dinsmoor made known to his afflicted wife the bankruptcy which was inevitable. Still sadder, if possible, was the sale which it enforced of the house which they had so long occupied, the furniture which had become endeared to them by memory and association, and the harsh interruption which loss of fortune put to all their treasured schemes. “My poor boy,” said Mrs. Dinsmoor, sorrowfully, as she placed her hand caressingly on the brown locks of Charlie, the eldest of the two boys, “it will be a hard sacrifice for you to leave the studies to which you are so much attached, and enter a store, as you will be obliged to do.” “Ah! I had not thought of that,” murmured Charlie. “It will, indeed, be a sacrifice; but, mother, I would not care for that, if you could only be spared the trials to which you will be exposed from poverty.” “Thank you for your consideration, my[219] child; but do not fear that I shall not accommodate myself to it. It is a heavy trial; but we must try to think that it will ultimately eventuate in our good.” At the auction of Mr. Dinsmoor’s house and furniture, the whole property, without exception, was knocked off to a young man, who seemed apparently of twenty-two or three years of age. He was able to secure it at a price much beneath its real value; for times were hard, and money scarce, so that he had but few competitors. Mr. Dinsmoor did not hear his name, and the pressure of sad thoughts prevented his making the inquiry. Possession was to be given in one week. Meanwhile, Mr. Dinsmoor sought out a small house in an obscure part of the town, which, in point of elegance and convenience, formed a complete contrast to the one he had formerly occupied. He felt, however, that it would be all his scanty salary as clerk—for[220] he had secured a situation in that capacity—would enable him to afford. Lizzie looked, with a rueful face, at the piano, as a dear friend from whom she must henceforth be separated, it being quite too costly a piece of furniture to be retained in their reduced circumstances. Her proficiency in music, for which she had great taste, made her regret it doubly, since she might with it have added to the resources of the family by giving music lessons. On the last evening in which they were to remain in the old house, their sad thoughts were broken in upon by a ring at the bell. “Can they not even leave us to enjoy the last evening in quiet?” said Charles, half petulantly. Immediately afterwards, there entered a young man, in whom Mr. Dinsmoor recognized the purchaser of the house. “I need not bid you welcome,” said he, smiling faintly, “since you have a better[221] right here now than myself. Had I been told, three months since, that this would be, I would not have believed it; but we cannot always foresee. I shall be prepared to leave to-morrow.” “I shall be better satisfied if you will remain,” said the young man, bowing. “What do you mean?” “Simply, that as this house and furniture are now mine, to do with as I like, I choose to restore you the latter, and offer you the use of the former, rent free, as long as you choose to occupy it.” “Who, then, are you,” asked Mr. Dinsmoor, in increasing surprise, “who can be so kind to utter strangers, with no claim upon you?” “You are mistaken. You have a claim upon me. Shall I tell you what it is? Eleven years ago to-morrow,—for to-morrow is Christmas Day,—a poor boy, who had known none of the luxuries, and but few of[222] the comforts, of life, stood in this street. His mind was ill at ease; for he had lost his way: but, as he walked on, he beheld a blaze of light issuing from a window,—from your window,—and, aroused by curiosity, he looked in. Around a Christmas-tree, brilliant with light, a happy group were assembled. As he stood gazing in, he heard the front door open; and a gentleman came out, and kindly invited him to enter. He did so; and the words of kindness and the Christmas gift with which he departed have not yet left his remembrance. Seven years passed, and the boy’s fortune changed. An uncle, long supposed to be dead, found him out, and, when he actually died, left him the heir of a large amount of wealth. Need I say that I am that boy, and that my name is Willie Grant?” The reader’s imagination can easily supply the rest. Provided with capital by his young friend, Mr. Dinsmoor again embarked in[223] business; and, this time, nothing occurred to check his prosperity. Charlie did not leave college, nor did Lizzie lose her piano. She gained a husband, however, and had no reason to regret the train of events which issued from her Christmas Gift. \n \n","sourceLink":"http://novel.tingroom.com/ertong/2956/81305.html","bookId":433,"book":{"id":433,"title":"Bertha\u0027s Christmas Vision: An Autumn Sheaf","description":"简介： Of all the houses which Martin Kendrick owned, he used the oldest and meanest for his own habitation. It was an old tumble-down building, on a narrow street, which had already lived out more than its appointed term of service, and was no longer fit t...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2956","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
