{"id":75460,"no":28,"title":"Page 28","content":"Enough was enough, Ford decided. The cops had the doll; the cops would investigate. And so far, the cops hadn\u0027t been able to do dick-all about stopping the threats against Cilla.\n They weren\u0027t pranks, they weren\u0027t harassment. They were threats. Dusting the damn doll and the mailbox, asking questions, even determining-if they could-what caliber of bullet had been used wasn\u0027t going to solve the problem. None of those things would prevent that look of shocked horror from covering Cilla\u0027s face the next time.\n Everyone knew there\u0027d be a next time. And the next time, at any time, it could be Cilla instead of a doll.\n Yeah, enough was more than enough.\n He pulled up in front of the Hennessy place. It was somewhere to start, he thought. Maybe it was somewhere to finish. He walked up, banged on the door.\n \"Wasting your time.\" A woman under an enormous straw gardening hat walked over to stand at the picket fence that formed the boundary between houses. \"Nobody\u0027s in there.\"\n \"Do you know where they are?\"\n \"Everybody knows where he is. Locked up.\" She tapped her temple under the brim of the hat, then circled it. \"Tried to kill a woman over on Meadowbrook Road a couple months back. Janet Hardy\u0027s granddaughter-theone who was the little girl in that TV show? You want to talk to him, you\u0027ll have to try Central State Hospital, down in Petersburg. \"\n \"What about Mrs. Hennessy?\"\n \"Haven\u0027t seen a sign of her the last couple weeks. Selling the place, as you can see there.\" She pointed to the Century 21 sign, then slipped a small pair of clippers into a pocket of her gardening belt. Settling in, Ford knew, for a little over-the-fence chat.\n \"She\u0027s had a hard life. Her boy was crippled back when he was a teenager. Died a year or so ago. That husband of hers never had a good word to say to anybody around here. Shouting or shaking his fist at kids for playing too loud, or telling people to mind their own if they offered a helping hand. Me, I\u0027d\u0027ve left him after the boy died, but she stuck. Could be she\u0027s taken off now he\u0027s locked up, but more likely, she\u0027s gone down to Petersburg. Don\u0027t know if anybody\u0027s looked at the house yet. I\u0027m going to hope somebody buys it who knows how to be neighborly.\"\n It was a haul to Petersburg and back, Ford considered. \"I guess you\u0027d have noticed if she moved out. I mean, furniture, luggage.\"\n \"Might have, if I was home.\" She gave Ford a harder measure from under the wide brim of her hat. \"You\u0027re not kin to them, are you?\"\n \"No, ma\u0027am.\"\n \"Well, I can tell you I haven\u0027t seen her or heard a peep out of the house for days now. In fact, I\u0027ve taken to watering what flowers she put in. I can\u0027t stand to watch something die of neglect.\"\n CILLA TRIED to take a page out of Ford\u0027s book and look at the bright side. The bright side could be that a defaced doll in the mailbox did no damage to her property. It cost her nothing but time and stress.\n A bright side could be the police took the whole ugly business very seriously. True, they\u0027d had no luck tracing any of the dolls so far, not when they were sold regularly on eBay or in secondhand and specialty shops, or could have been taken out of someone\u0027s personal collection. But it brought her a measure of comfort to know the police were doing whatever the hell the police did.\n And her crew was pissed off on her behalf. Having people in your corner, even if it was only to express outrage and support, was always a bright side.\n Plus her new countertops and backsplash kicked serious ass. That knocked her level of stress down several notches. The streaks and specks of warm gold, flecks of black and white against rich chocolate brown set off her cabinets. And, Jesus, her copper hardware would just pop. She\u0027d been right, so absolutely right, to go for the waterfall edging. She couldn\u0027t believe how long and hard she\u0027d stressed over that. It gave the counters such presence, such authority.\n Cilla ran her hand over the island as she might a lover\u0027s warm, naked flesh, and all but purred.\n \"Pretty dark, especially with this half acre of the stuff you\u0027ve got in here.\"\n Cilla merely looked over, tipped her head and spoke in the tone she\u0027d use to a naughty little boy. \"Buddy.\"\n His lips twisted, but the attempt to defeat the smile failed. \"I guess it looks all right. Cabinets are nice, anyway. Got a forest of them in here, but having the glass fronts on some breaks it up a little. I\u0027ll get your sinks mounted. Be back tomorrow after they\u0027ve cured to hook up the plumbing, the dishwasher and the faucets. Don\u0027t know why anybody\u0027d want copper for faucets.\"\n \"I\u0027m just crazy that way.\"\n \"Crazy some way. Are you going to help me mount these sinks, or just stand around looking like the canary-eating cat?\"\n While they worked on the first undermount, Buddy whistled through his teeth. A few bars in, Cilla caught herself humming with him.\n \"\u0027I\u0027ll Get By,\u0027\" Cilla said. \"My grandmother\u0027s signature song.\"\n \"Guess the mind wanders to her in here. Got that clamp on there?\"\n \"It\u0027s on.\"\n \"Let\u0027s test the fit then. Second time I put a sink in this place.\"\n \"Really?\"\n \"Put in the one you\u0027re replacing for your grandmother. That\u0027s been going on forty, forty-five years, I expect. Probably time for a new. That\u0027s right, that\u0027s right,\" he murmured. \"That\u0027s a good fit. That\u0027s a good one.\" He marked the location for the mounting clips.\n \"Let\u0027s lift her out.\"\n Cilla gripped the two-by-four clamped to the sink. \"You and your father did a lot of the work around here back then.\"\n \"Still got plenty.\"\n \"You did a lot for Andrew Morrow.\"\n \"That\u0027s a fact. We did all the plumbing for Skyline Development. Thirty-three houses,\" he said, taking out his drill. \"That job made it so I could buy one of those houses. Lived there thirty-seven years come October. A lot of people got their homes because of Drew Morrow. I\u0027ve fixed the johns in most of them.\"\n AFTER THE TWO sinks were mounted, Cilla went outside to hunt up her father. She\u0027d kept him off the scaffolding that morning, conning him into \"doing her a favor\" and painting her shutters.\n It looked as if he was having as much fun running the paint sprayer as he had hanging up three stories. \"Take a break?\" she asked and offered a bottle of water.\n \"Sure can.\" He gave her arm a quick rub. \"How\u0027re you feeling?\"\n \"Better since I got to work. Better yet when I stand staring at my counters with a big, sloppy smile on my face. Something occurred to me when I was working with Buddy. How he and his father did some work here. Dobby did, too. I\u0027m wondering who else who\u0027s working here now, or who I didn\u0027t hire, or who\u0027s retired, might\u0027ve worked on the place when Janet had it. Maybe they\u0027re pissed off because I\u0027m changing it. It\u0027s no crazier than Hennessy trying to run me down for something that happened before I was born.\"\n \"I\u0027d have to think about it. I was a teenager, Cilla. I can\u0027t say I\u0027d have paid much attention.\"\n He took off his hat, ran a hand through his hair. \"There were gardeners, of course. The grounds were a showplace. I\u0027ll ask Charlie if he remembers who she had for that. I do remember she had what you\u0027d call caretakers. A couple who\u0027d look after things when she wasn\u0027t here, which was more than not. They\u0027d open the house up when she was expected, that sort of thing. Mr. and Mrs. Jorganson. They\u0027ve both been gone for years.\"\n \"What about carpentry, electrical, painting?\"\n \"Maybe Carl Kroger. He did a lot of handyman work back then. I\u0027ll ask about that, but I know he retired some years ago. Florida maybe. I only remember that because I went to school with his daughter, and I ended up teaching her daughter. I can\u0027t see Mary Beth Kroger-that\u0027s Marks, now-giving you this kind of trouble.\"\n \"It\u0027s probably a stupid idea. Just another straw grasped at.\"\n \"Cilla, I don\u0027t mean to make it worse, or give you more to worry about, but have you considered that whoever\u0027s doing this has a grudge directed at you? You, not Janet Hardy\u0027s granddaughter?\"\n \"For what? I\u0027m a former child star, a failed adult actress who recorded a couple of moderately successful CDs. My only ties to this area were to her, and you. You, Patty and Angie were literally the only people I knew when I came here. And let\u0027s be honest, I didn\u0027t know any of you that well. I\u0027ve dumped a few hundred thousand into the local economy. I can\u0027t see how that would piss anyone off.\"\n \"You\u0027re right. I know you\u0027re right. It\u0027s the dolls. It\u0027s such a direct strike at you. More than the vandalism, Cilla. Mutilating those dolls, the child you were, seems so much more personal than the rest.\"\n She studied him. \"Are you here to paint, or to keep an eye on me?\"\n \"I can do both. At least until school starts up. The summer\u0027s flown by,\" he said, looking past her. \"I\u0027ll miss being around here, the way I\u0027ve been able to. We\u0027ve made a lot of progress since June.\"\n You and I. She understood the words he didn\u0027t say. \"We have. Despite everything, it\u0027s been the best summer of my life.\"\n FORD WATCHED WHILE Cilla hung shutters her father had painted on the front windows. The scent of the paint hung in the air, along with grass, heat and the dianthus in a big blue pot on the veranda.\n \"I just want to finish this off. You don\u0027t have to hover.\"\n \"I\u0027m not hovering. I\u0027m observing. There\u0027s something satisfying about sitting on a summer day and watching somebody else work.\"\n She spared him a glance as he sat, at ease. \"You know, I could teach you how to set a few screws.\"\n \"Why would I need to do that when I\u0027ve got you?\"\n \"I\u0027ll ignore that since you bought me that very pretty planter. And the steaks you\u0027ve promised to grill-on the grill I assembled.\"\n \"Corn on the cob, too, and tomatoes fresh from the roadside stand. We\u0027ll have ourselves a feast.\"\n She tested the shutter, checked it with her level, then moved to the next.\n \"Before we move to feasting,\" he continued, \"let\u0027s get less pleasant business out of the way. I went by the Hennessy place this morning. She\u0027s not there,\" he added when Cilla glanced back. \"Hasn\u0027t been there, according to her neighbor, for a couple of weeks. One supposition is she went down to Petersburg, to be close to the state hospital where they have him. That\u0027s proved out.\"\n \"How do you know?\"\n \"I called the most likely hotels and motels in the area. She\u0027s registered at the Holiday Inn Express.\"\n \"Aren\u0027t you the clever detective?\" she replied.\n \"Taught the Seeker everything he knows. Or vice versa. Anyway, I considered driving down, but it struck me as a waste of time. It\u0027s better than a hundred miles one way, Cilla. It\u0027s hard to believe she\u0027d drive more than two hundred miles, in what had to be the middle of the night, to pose a doll she\u0027d shot in the damn head in your mailbox. If she wanted to get at you, why move herself so far off when she\u0027s got a house twenty minutes away?\"\n He knew how to put things together, Cilla thought. Into panels that followed a logical line. \"I hate that that\u0027s realistic, that it rings true for me. Because it would be easier, simpler, if it was her. If I can\u0027t believe that, I have to know it\u0027s someone else. That someone else hates me.\"\n She tipped back her cap, idly watched Spock stalking one of his cats in the front yard. \"I\u0027m looking at Buddy today because he\u0027s whistling one of my grandmother\u0027s songs, and I\u0027m thinking, Hey, Buddy, did you happen to start a mad, passionate affair with my grandmother one night when you came by to fix a leak? Or, did she maybe reject your advances in a way that causes you to want to hurt me? I went through that same process with Dobby, who is, yes, entirely too old. But he had a son, and his son has a son. And I was just twisted up enough today to wonder if the very affable Jack was spending time shooting my plastic image because of something-anything-that went on with Janet three and a half decades ago. Or maybe my father had a point, and someone took a vicious and pathological dislike to Katie, and seeks to take revenge on me.\"\n \"Your father thinks you\u0027re being threatened by somebody who hates a TV character?\"\n \"No. Not exactly. He suggested whoever\u0027s doing this has some grudge against me, personally. But that doesn\u0027t make any sense, either.\" She sighed, lowered the screwdriver. \"And because it doesn\u0027t make any sense, none of it, I keep going around in circles, which leaves me dizzy and annoyed. Added to that, I\u0027m going to have dozens of people here in a few days. And I know I\u0027m going to be wondering, even as I pass the potato salad, if that person\u0027s the one. If the person looking at me and smiling, thanking me kindly for the potato salad, would like to shoot me in the head.\"\n He pushed up, walked to her. \"I may have gotten my ass kicked with some regularity as a boy, but that-as my mother liked to say-builds character. The kind of character that means I can say to you, and you can believe me when I say it, nobody, Cilla, nobody is going to hurt you while I\u0027m around.\"\n \"Keeping me from being hurt hasn\u0027t been anyone\u0027s priority up till now. Because of that, I do believe you. I feel safer with you, Ford, than I ever have with anyone.\"\n He kissed her very gently, eased back and said, \"Well?\"\n \"Oh, damn it! I walked right into it. I gave you a damn cue.\" She pulled away, picked up her screwdriver. \"Look, it\u0027s been a really long day. I just don\u0027t want to get into this now.\"\n He simply put a hand under her chin, lifted it until their eyes met.\n \"I don\u0027t know. I don\u0027t know. I haven\u0027t made the lists yet.\"\n He rubbed his thumb over her jawline. \"What lists would that be?\"\n \"My lists, for and against. And if you\u0027re going to push at this point, I\u0027ll warn you that I can rattle off a ten-minute monologue of the againsts. The ones I\u0027ve already given you and more.\"\n \"Give me one of the fors.\" He tightened his grip when she shook her head. \"Just one.\"\n \"You love me. I know that you do, I know that you mean it. But they call it \u0027falling into\u0027 for a reason. It\u0027s the floundering around after you surface, the wondering what the hell you\u0027re doing there and looking for the escape that make the falling-out-of part so horrible. And it\u0027s not a practical for,\" she insisted, when he just smiled and rubbed her jawline. \"One of us has to be practical. What if I said yes, yes, let\u0027s run off to Vegas-as both my grandmother and mother have done before me-and hit The Chapel of Love? What-\"\n \"I\u0027d say you pack, I\u0027ll book the flight.\"\n \"Oh, don\u0027t be ridiculous.\" She tried to be annoyed, but nerves kept jumping in the way. \"You don\u0027t want some tacky Vegas fly-by. You\u0027re serious. You\u0027re serious about friendships, about your work, your family. You\u0027re serious about Star Wars, and your active dislike of Jar Jar Binks-\"\n \"Well, God. Come on, anyone who-\"\n \"You\u0027re serious,\" she continued before he went on a Jar Jar rant, \"about living your life on your terms, and being easygoing doesn\u0027t negate that one bit. You\u0027re serious about what kind of kryptonite is more lethal to Superman.\"\n \"You have to go with the classic green. I told you, the gold can strip Kryptonians\u0027 powers permanently, but-\"\n \"Ford.\"\n \"Sorry. We\u0027ll skip that and go back to Vegas.\"\n \"We\u0027re not going to Vegas. God, you make my head spin. You\u0027re not thinking of a single practicality, of the reality.\"\n \"Test the theory. Give me one.\"\n \"Fine. Fine. Where would we live? Do we flip a coin, ask your Magic 8-Ball. Or maybe we\u0027d-\"\n \"Well, for God\u0027s sake, Cilla, we\u0027d live here. Here,\" he repeated, knocking his knuckles against the wall of the house.\n His instant answer tipped her off balance. \"What about your house? You love your house. It\u0027s a great house. It\u0027s tailor-made for you.\"\n \"Yeah, for me. Not for us. Sure, I love my house, and it\u0027s got a lot of me in it. But it\u0027s just a house for me, and Spock.\" He glanced around in time to see Spock catch and destroy the hated invisible cat. \"He\u0027s happy anywhere. I haven\u0027t poured myself into my place the way you have this one. This is home for you, Cilla. I\u0027ve watched you make it.\" Now he picked up her screwdriver. \"With more than this. A lot more than tools and nails and gallons of paint. It\u0027s your place. I want it to be ours.\"\n \"But...\" But, but, her mind was full of buts. \"What about your studio?\"\n \"Yeah, it\u0027s a great space. You\u0027ll think of something.\" He handed her back the screwdriver. \"Make all the lists you want, Cilla. Love? It\u0027s green kryptonite. It powers out all the rest. I\u0027ll go out back and start the grill.\"\n She stood, stunned, a power tool in her hand, as the screen door slapped shut behind him. And thought: What? Love is kryptonite? She\u0027d think of something?\n How could she understand, much less marry, a man whose mind worked that way? One who could make statements like that, then stroll off to start the grill? Where were his anger, his angst, his annoyance? And to suggest he could give up his place and move into hers without any real thought to where he\u0027d work? It didn\u0027t make any sense. It made no sense at all.\n Of course if she added the home gym off the south side of the house the way she\u0027d been toying with, she could put on a second story, tying that into the existing house. Angle it for a little interest. Tight-winder stairs would work, and be fun to do. It would keep the work spaces entirely separate, give them both privacy. Plus the southern exposure would give a studio excellent light. Then she could...\n Well, God, she realized. She\u0027d thought of something. A damn good something, too, she added and put down her tool to pace the veranda. Having destroyed his quota, Spock trotted up to pace with her.\n The sort of something that would not only work, not only blend in with the existing structure, Cilla realized, but enhance it. Break up the roof line, finish it off with a sweet little balcony. Jib windows for access.\n Damn it, damn it, damn it! Now she could see it. Now she wanted it. She stalked down the steps, around to the south side of the house with Spock bounding happily behind her. Oh yeah, yeah, not only doable, she thought, but it now seemed the house begged for it.\n She jammed her hands into her pockets, and her fingers hit the ring box she carried there. Kryptonite, she thought, pulling it out. That was the trouble, the big trouble. She did understand him. And more terrifying, more wonderful, he understood her.\n Trusted her. Loved her. Believed in her.\n WHEN SHE WALKED to the patio, Ford had the grill smoking. The corn, husks in place, were submerged in a big bowl of water for reasons that eluded her. He\u0027d brought out the wine. The scents of roses, sweet peas, jasmine tangled in the air as he poured her a glass. Sun streamed through the trees, glinted off the pond where Spock wandered to drink.\n For a moment, she thought of the glamour that had once lived there, the colored lights, the beautiful people wafting like perfume over the lawns. Then she thought of him, just him, standing on stones she\u0027d helped place with her own hands, offering her a glass of wine, and a life she\u0027d never believed she could have.\n She stood with him, one hand in her pocket, and took the first sip. \"I have some questions. First, just to get it off my mind, why are you drowning the corn?\"\n \"My mother said to.\"\n \"Okay. If I thought of something, how do you know it\u0027s something you\u0027d want?\"\n \"If I didn\u0027t,\" he said, picking up the conversation as if there had been no break, \"I know how to say I don\u0027t want that. I learned how to do that at an early age, with mixed results. But the odds are, if we\u0027re talking about construction and design, whatever you thought of would work.\"\n \"Next. Could I hurt you?\"\n \"Cilla, you could rip my heart out in bloody pieces.\"\n She understood that, understood he could do the same to her. And wasn\u0027t that a hell of a thing? Wasn\u0027t that a miracle? \"I couldn\u0027t have done that to Steve, or him to me. As much as we loved each other. As much as we still do.\"\n \"Cilla-\"\n \"Wait. One more question. Did you ask me to carry the ring around with me because you hoped it would act as kryptonite, and weaken me over time until I agreed to marry you?\"\n He shifted his feet, took another drink of wine. \"It might have been a factor.\"\n With a nod, she drew her hand out of her pocket, studied the ring sparkling on it. \"Apparently, it works.\"\n His grin flashed, quicksilver delight. But when he moved to her, she slapped a hand on his chest. \"Just hold on.\"\n \"That was my plan.\"\n \"Wait. Wait,\" she said again, softly. \"Everything I said before, it\u0027s true. I\u0027d made up my mind never to get married again. Why go through the process when the odds are so stacked for failure? I failed a lot. Some was my fault, some was just the way it was. Marriage seemed so unnecessary, so hard, so full of tangles that can never really be fully unknotted. It was easy with Steve. We were friends, and we\u0027d always be friends. As much as I love him, it was never hard or scary. There wasn\u0027t any risk, for either of us.\"\n Her throat filled, so much emotion rising up. But she wanted- needed-to get the rest out. \"It\u0027s not like that with you because we\u0027re going to hurt each other along the way. If this screws up, we won\u0027t be friends. If this screws up, I\u0027ll hate you every day for the rest of my life.\"\n \"I\u0027ll hate you more.\"\n \"Why is that absolutely the best thing you could\u0027ve said? We\u0027re not going to Vegas.\"\n \"Okay, but I think we\u0027re missing a real opportunity. How do you feel about backyard weddings?\"\n \"I feel that\u0027s what you had in mind all along.\"\n \"You\u0027re what I had in mind all along.\"\n She shook her head, then laid her hands on his cheeks. \"I\u0027d love a backyard wedding. I\u0027d love to share this house with you. I don\u0027t know how anything that scares me this much can make me so happy.\"\n He took her lips with his, soft, soft, spinning the kiss out in the perfumed air, with the sun streaming through the trees. \"I believe in us.\" He kissed her again, swayed with her. \"You\u0027re the one I can dance with.\"\n She laid her head on his shoulder, closed her eyes.\n THE LITTLE FARM\n 1973\n \"I believed in love,\" Janet said as she sat back on the white silk pillows on the lipstick-pink couch. \"Why else would I have thrown myself into it so often? It never lasted, and my heart would break, or close. But I never stopped opening it again. Again and again. You know that. You\u0027ve read all the books, heard all the stories, and the letters. You have the letters so you know I loved, right to the end.\"\n \"It never made you happy. Not the kind that lasted.\" Sitting cross-legged on the floor, Cilla sorted through photographs. \"Here\u0027s one taken the day you married Frankie Bennett. You\u0027re so young, so happy. And it fell apart.\"\n \"He wanted the star more than the woman. That was a lesson I had to learn. But he gave me Johnnie. My beautiful boy. Johnnie\u0027s gone now. I lost my beautiful boy. It\u0027s been a year, and still I wait for him to come home. Maybe this one will be a boy.\"\n She laid a hand on her belly, picked up a short glass, rattled the ice chilling the vodka.\n \"You shouldn\u0027t drink while you\u0027re pregnant.\"\n Janet jerked a shoulder, sipped. \"They didn\u0027t make such a to-do about it when I was. Besides, I\u0027ll be dead soon anyway. What will you do with all those pictures?\"\n \"I don\u0027t know. I think I\u0027ll pick the ones I like best, have them framed. I want pictures of you in the house. Especially pictures of you at the farm. You were happy here.\"\n \"Some of my happiest moments, some of my most desolate. I gave Carlos-Chavez, my third husband-his walking papers right in this room. We had a vicious fight, almost passionate enough to have me consider taking him back. But I\u0027d had enough. How he hated it here. \u0027Janet,\u0027 he\u0027d say in that Spanish toreador\u0027s voice that seduced me in the first place, \u0027why must we camp out in the middle of nowhere? There isn\u0027t a decent restaurant for miles.\u0027 Carlos,\" she added and lifted her glass, \"he could make love like a king. But outside of bed, he bored me brainless. The problem there was we didn\u0027t spend enough time outside of bed before I married him. Sex is no reason to get married.\"\n \"Ford never bores me. He made me a goddess, and still when he looks at me, he sees me. Too many of them didn\u0027t see you.\"\n \"I stopped seeing me.\"\n \"But in the letters, the letters you kept, he called you Trudy.\"\n \"The last love, the last chance. I couldn\u0027t know. Yet maybe some part of me did. Maybe I wanted to love and be loved by what I\u0027d lost, or given up. For a little while, I could be Trudy again.\" She stroked her fingers over one of the white pillows. \"But that was a lie, too. I could never get her back, and he never saw her.\"\n \"The last chance,\" Cilla repeated with photos spread before her, and Janet on the bright pink couch. \"Why was it the last? You lost your son, and that was horrible and tragic. But you had a daughter who needed you. You had a child inside you. You left your daughter, and that\u0027s haunted her all her life-and I guess it\u0027s haunted me too. You left her, and you ended the child when you ended yourself. Why?\"\n Janet sipped her drink. \"If there\u0027s one thing you can do for me, it would be to answer that question.\"\n \"How?\"\n \"You\u0027ve got everything you need. It\u0027s your dream, for God\u0027s sake. Pay attention.\" \n","sourceLink":"https://allnovel.net/tribute/page-28.html","bookId":2414,"book":{"id":2414,"title":"Tribute","description":"Storyline: \n Cilla McGowan, a former child star, has found a more satisfying life restoring homes. So she comes to Virginia’s Shenandoah Valley to save the dilapidated farmhouse that once belonged to her grandmother—a legendary actress who died of an overdose more than thirty years ago. \n Plunging into the project with gusto, Cilla’s almost too busy and exhausted to notice her neighbor, graphic novelist Ford Sawyer. Determined not to carry on the family tradition of ill-fated romances, Cilla steels herself against Ford’s quirky charm, though she can’t help indulging in a little fantasy. \n But it’s reality that holds its share of dangers for Cilla. A cache of unsigned letters found in the attic points to a mysterious romance in her grandmother’s life—and may be the catalyst for a frightening, violent assault. And if Cilla and Ford are unable to sort out who is targeting her and why, she may, like her world-famous grandmother, be cut down in the prime of her life.\n \n","cover":"https://allnovel.net/images/tribute.jpg","author":"Nora Roberts","type":"Mystery","source":"allnovel","link":"https://allnovel.net/tribute.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 10:35:03 AM"}}
