{"id":75461,"no":29,"title":"Page 29","content":"Crazy. She had to be crazy hosting a party. She didn\u0027t have any furniture, or dishes. She didn\u0027t own a serving spoon. She was at least three weeks out from delivery on her stove and refrigerator. She didn\u0027t own a goddamn rug. Her seating consisted of a single patio set, a couple of cheap plastic chairs and a collection of empty compound buckets. Her cooking tools were limited to a Weber grill, a hot plate and a microwave oven. She had supplies, God knew. A million festive paper plates, napkins, plastic cups and forks and spoons, and enough food-which she didn\u0027t know how to prepare-stuffed into Ford\u0027s refrigerator to feed most of the county. But where were people supposed to eat? \"On the picnic tables my father, your father and Matt are bringing over,\" Ford told her. \"Come back to bed.\" \"What if it rains?\" \"Not calling for rain. There is a thirty-percent chance of hail and locusts, and a ten-percent chance of earthquakes. Cilla, it\u0027s six in the morning.\" \"I\u0027m supposed to marinate the chicken.\" \"Now?\" \"No. I don\u0027t know. I have to check my list. I wrote everything down. I said I\u0027d make crab dip. I don\u0027t know why I said that. I\u0027ve never made crab dip. Why didn\u0027t I just buy it? What am I trying to prove? And there\u0027s the pasta salad.\" She heard the lunacy in the rant, couldn\u0027t stop. \"I took that, too. Eating pasta salad through the years doesn\u0027t mean you can make pasta salad. I\u0027ve been to the doctor through the years. What\u0027s next? Am I going to start doing elective surgery?\" Though it was tempting, he didn\u0027t put the pillow over his head. \"Are you going to lose your mind like this every time you give a party?\" \"Yes. Yes, I am.\" \"Good to know. Come back to bed.\" \"I\u0027m not coming back to bed. Can\u0027t you see I\u0027m dressed? Dressed, pacing, obsessing and postponing the moment when I go downstairs and face that chicken.\" \"All right. All right.\" He pushed himself up in bed, scooped back his hair. \"Did you agree to marry me last night?\" \"Apparently I did.\" \"Then we will go down and face the chicken together.\" \"Really? You\u0027d do that?\" \"I\u0027ll also face the crab dip and the pasta salad with you. Such is the depth of my love, even at six o\u0027clock in the morning.\" Spock rose, yawned, stretched. \"And apparently his. If we poison people, Cilla, we\u0027ll do it together.\" \"I feel better. I know when I\u0027m being a maniac.\" She walked to him, leaned down and kissed his sleepy mouth. \"And I know when I\u0027m lucky to have someone who\u0027ll stick with me through it, right down to the crab dip.\" \"I don\u0027t even like crab dip. Why do people eat stuff like that?\" He gave her a tug, pulling her onto the bed. And rolled on top of her. \"People are always making dips out of odd things. Spinach dip, artichoke dip. Have you ever asked yourself why?\" \"I can\u0027t say I have.\" \"Why can\u0027t they be satisfied with some Cheez Whiz on a cracker? It\u0027s simple. It\u0027s classic.\" \"You can\u0027t distract me with Cheez Whiz.\" She shoved him off. \"I\u0027m going down.\" She tugged her shirt back into place. \"I\u0027m ready.\" IT WASN\u0027T ALTOGETHER horrible or intimidating, Cilla discovered. Not with a partner. Especially when the partner was as clueless as she. It was almost fun. She thought, with some repetition, and a bit more skill, boiling pasta or mincing garlic might slip past the almost and become actual fun. \"I had a Janet dream last night,\" she told him. \"How can the simple tomato come in so many sizes?\" He held up a beefsteak and a handful of grape tomatoes. \"Is it science? Is it nature? I\u0027ll have to do a study on it. What was the dream about?\" \"I guess it was about love, at least on one level. And my subconscious poking around about what it means. Or what it meant to her. We were in the living room of the farm. The walls were my walls-I mean the space was mine, the color of the paint, but she was on that bright pink couch. And I had photographs spread on this glossy white coffee table. Photos I\u0027ve managed to get my hands on, the photos your grandfather took, photos I think I might have just seen in books. Hundreds of them. She was drinking vodka in a short glass. She said it had been a year since Johnnie died, and how she hoped this baby was a boy. She said it was her last chance. Her last love, her last chance. \"It\u0027s so odd. She knew she was going to die soon. Because I knew. I asked her why, why did she do it? Why did she turn away from that last chance and end it all?\" \"What did she say?\" \"That if I could do anything for her, it would be to find that answer. That I had it all in front of me, but I wasn\u0027t paying attention. So I woke up frustrated because, as she said, it\u0027s my dream. If I know something, why don\u0027t I know it?\" Ford took up his assignment of slicing the beefsteak. \"Is it too much to accept she might\u0027ve been too sad, too deep in the dark, and saw it as the only way to end the pain?\" \"No. But I can\u0027t quite make myself believe it. I never fully could, or never fully wanted to. And since I came here, started on the house, I believe it less-and want to believe it less,\" Cilla admitted. \"She found something here. Look at all she took and let go of again. Men, marriages, houses, possessions. She was famous for acquiring and disposing of. But she kept this place, and more, made arrangements so it would remain in the family long after she died. She found something she needed here, something that contented her.\" She looked out the window and watched Spock on his morning rounds. \"She kept the dog,\" Cilla murmured. \"And an old jeep. A stove and refrigerator that were out of date. I think, in a way, this place was real to her. The rest, it\u0027s not. For the smart ones, it\u0027s a job. It\u0027s good work. Fame can be a by-product, but it\u0027s fleeting and fickle and so much of it\u0027s an illusion. She didn\u0027t need the illusion here.\" \"And falling in love here made it more real?\" She looked over, grateful he followed the thread of her thoughts. \"It follows, doesn\u0027t it? The worst thing in her life happened here when Johnnie was killed. An inescapable reality. But she kept coming back, facing it. She didn\u0027t close the place up, or sell it. He called her Trudy, and that\u0027s who she wanted to believe he loved. I think she wanted that last chance, desperately. I think she wanted the baby, Ford. She\u0027d lost one child. How could she, why would she kill herself and end the chance for another?\" \"And if she realized it wasn\u0027t Trudy this guy loved, that that was another illusion?\" \"Men come and go. They always did for her. And I guess I remembered that, resolved that through the dream last night. Her one true love was Johnnie. Her work, too. She passionately loved the work. But Johnnie was hers. My mother always knew that, always knew she didn\u0027t quite hit the same spot. The last love, the last chance? I think it was the child for her. I can\u0027t believe, just can\u0027t, that she\u0027d have killed herself over a love affair that went south.\" \"You said she was drinking in the dream. Vodka.\" \"Her standard.\" When the timer dinged, Cilla hefted the pot of pasta, carried it to the sink to drain into the waiting colander. \"But there weren\u0027t any pills in the dream.\" She stood, watching the steam rise. \"Where were the pills, Ford? I keep circling back to those letters, to the anger in the last few. He didn\u0027t want her in this house. She was a threat to him, an unpredictable woman, a desperate one, pregnant with his child. But she wouldn\u0027t give it up. Not this place, not the child, not the chance. So he took it from her. I keep circling back to that.\" \"If you\u0027re right, proving it would be the next step. We\u0027ve already tried to find out who wrote those letters. I don\u0027t know how many more avenues there might be to take.\" \"I feel like... I feel like we\u0027ve already been down the right one, or close to it. And missed something that was right there. Right there. That I didn\u0027t pay attention, and it slipped by.\" She turned. \"This is my reality now, Ford. You, you and the farm, this life. I found that, I can take that because of her. I owe her. And I owe her more than planting roses and painting and hammering wood. More than bringing this place back as tribute. I owe her the truth.\" \"What you\u0027ve found, and what you take may have started with her. And if you need the truth, I\u0027ll do whatever I can to help you find that. But the farm, what you\u0027ve done here, it\u0027s more than a tribute to Janet Hardy. It\u0027s a tribute to you, Cilla. What you can do, what you\u0027ll work for, what you\u0027ll give. The walls were yours in the dream.\" \"And I haven\u0027t put anything inside it. I talk about it, but I don\u0027t take the step. Not a chair, not a table, beyond what I needed for Steve. I guess I have to fix that.\" He\u0027d been waiting for that. Waiting for that step. \"I\u0027ve got a house full of stuff here. It\u0027s a good start for picking and choosing.\" She walked to him, linked her arms around his neck. \"I pick you. I pick the guy who\u0027ll slice tomatoes with me at seven in the morning because I\u0027m a lunatic. The guy who not only promises to help me, but does. The one who makes me understand I\u0027m the first Hardy woman in three generations lucky enough to be in love with a man who sees me. Let\u0027s pick something, and take it across the road. We\u0027ll put it inside the house so it\u0027s not hers, it\u0027s not mine. So it\u0027s ours.\" \"I vote for the bed.\" She grinned. \"Sold.\" IT WAS RIDICULOUS, of course, for two people who were preparing for a party to leave the work to break down a bed, to haul frame, headboard, footboard, mattress, box spring, bedding downstairs, out to the truck, drive it across the road with a dog in tow. Then reverse the procedure. But Cilla found it not only symbolic, she found it therapeutic. Still, Ford\u0027s suggestion that they try it out in its new place was going too far. Tonight, she told him. Definitely. Their room now, she thought, giving the pillows an extra fluff. Their room, their bed, their house. Their life. Yes, she\u0027d put pictures of Janet in the house, as she\u0027d said in the dream. But there would be other pictures. Pictures of her and Ford, of friends and family. She\u0027d ask her father if he had any of his parents, his grandparents she could copy. She\u0027d repair and refinish the old rocker she\u0027d found in the attic, and she\u0027d buy cheerful, happy dishes, and put Ford\u0027s wonderful roomy couch in their living room. She\u0027d remember what had been, and build toward what could be. Really, hadn\u0027t that always been the purpose? And she\u0027d keep looking for that truth. For Janet, for her mother, for herself. At Ford\u0027s she deserted the field, ducking outside to call Dilly in New York. \"Mom.\" \"Cilla, it\u0027s barely nine in the morning. Don\u0027t you know I need my sleep? I have a show tonight.\" \"I know. I read the reviews. \u0027Mature and polished, Bedelia Hardy comes triumphantly into her own.\u0027 Congratulations.\" \"Well, I could\u0027ve done without the mature.\" \"I\u0027m awfully proud of you, and looking forward to seeing you triumphant in D.C. in a couple of weeks.\" After a brief pause, Dilly said, \"Thank you, Cilla. I don\u0027t know what to say.\" And when her mother went on a long riff about the hard work, the three encores, the curtain calls, the acres of flowers in her dressing room, Cilla just smiled and listened. Dilly was never at a loss for words for long. \"Of course, I\u0027m completely exhausted. But somehow, the energy\u0027s there when I need it most. And Mario\u0027s taking very good care of me.\" \"I\u0027m glad. Mom, Ford and I are getting married.\" \"Who?\" \"Ford, Mom. You met him when you came here.\" \"I can hardly be expected to remember everyone I meet. The tall one? The neighbor?\" \"He\u0027s tall, and he lives across the road.\" \"When did all this happen?\" Dilly demanded, with the first notes of petulance in her voice. \"Why are you marrying him? When you come back to L.A.-\" \"Mom, just listen. Just listen and don\u0027t say anything until I\u0027m done. I\u0027m not going back to L.A. I\u0027m not coming back to the business.\" \"You-\" \"Just listen. This is my home now, and I\u0027m building a life here. I\u0027m in love with an amazing man who loves me back. I\u0027m happy. I\u0027m as happy at this moment as you are when you step out into the lights. I want you to do one thing for me. Just this one thing, just this one time. I want you to say, whether you mean it or not, just say, \u0027I\u0027m happy for you, Cilla.\u0027\" \"I\u0027m happy for you, Cilla.\" \"Thanks.\" \"I am happy for you. I just don\u0027t understand why-\" \"It\u0027s enough, Mom. Just be happy. You don\u0027t have to understand. I\u0027ll see you in a couple of weeks.\" It\u0027s enough, Cilla thought again. Maybe one day there would be more, maybe there wouldn\u0027t. So it was enough. She went back into the house, and to Ford. REINFORCEMENT ARRIVED with platters and bowls, with tables and pounds of ice. Penny dispatched Ford to help unload at the farm before she bustled into the kitchen with Patty, where Cilla agonized over the pasta salad. \"Someone needs to taste it. Ford and I are too emotionally involved with the pasta. We have no objectivity.\" \"It\u0027s so pretty!\" Patty exclaimed. \"Isn\u0027t that a pretty salad, Pen?\" But Penny, whose eagle eyes spotted Cilla\u0027s ring in under three seconds, latched on to Cilla\u0027s hand. \"When?\" \"Last night.\" \"What? What am I missing? Oh God, oh God! Is that what I think it is? Is that it? Oh, let me see!\" Patty crowded in, peered down at the ring. \"It\u0027s just beautiful. It\u0027s just so beautiful. I\u0027m so happy. I\u0027m so happy for both of you.\" No prompting needed from the wings here, Cilla thought as Patty threw her arms around Cilla and dipped them both side to side. \"Didn\u0027t take you long to come to your senses. Let go, Patty, she\u0027s going to be my daughter-in-law.\" Nudging Patty aside, Penny moved in for a hug. \"He\u0027s a very, very good man.\" \"Only the best.\" \"I\u0027m pretty sure you almost deserve him.\" Penny leaned back, all smiles and damp eyes. \"Aren\u0027t they going to make us beautiful grand-babies, Patty?\" \"Oh, well...\" \"We won\u0027t start nagging you about that yet. Much,\" Patty put in. \"First we get to nag you about the wedding. Did you set the date?\" \"No, not really. We just-\" \"It\u0027s too late to take advantage of the fall season. The foliage will peak in about six weeks. And there\u0027s so much to do.\" \"We thought an outdoor wedding, at the farm. Simple,\" Cilla began. \"Perfect.\" Patty counted off on her fingers. \"May, early May, don\u0027t you think? May\u0027s so pretty, and that gives us a comfortable time for all the details. The dress comes first. Everything builds around the dress. We have to go shopping. I can\u0027t wait!\" Patty threw her arms around Cilla again. \"Captain Morrow reporting to the staging area,\" Cathy said as she came in, loaded with bags. \"What\u0027s all this? Has everyone been slicing onions?\" \"No.\" Patty dashed at tears. \"Cilla and Ford. They\u0027re getting married.\" \"Oh!\" Cathy jumbled bags onto the counter, righted one before its contents spilled. She turned, beaming smiles. \"Congratulations! What happy news. When\u0027s the big day?\" \"May, we think,\" Patty told her. \"Don\u0027t we think May? Oh my God, isn\u0027t she going to be the most beautiful bride? An outdoor wedding at the farm. Isn\u0027t that perfect? Imagine the gardens next May.\" \"It\u0027s going to be the event of the year. Simple,\" Penny added with a light in her eyes that told Cilla they might have different definitions of the word. \"We\u0027ll say simply the event of the year.\" \"You two are scaring the girl.\" With a laugh, Cathy put an arm around Cilla\u0027s shoulder. \"She\u0027ll be running for the hills any minute.\" \"No. I\u0027m staying right here. It\u0027s nice,\" Cilla decided. \"We\u0027ll make it the event of the year. In a simple way.\" \"There you go.\" Cathy gave Cilla\u0027s shoulder a squeeze. \"Now, ladies, if we don\u0027t get this particular show on the road, we\u0027re going to have a lot of hungry people, and the disaster of this year on our hands.\" IT WAS so much easier than she\u0027d imagined, and amazingly satisfying. Under the afternoon sun dozens and dozens of people spread around the grounds. They crowded at borrowed picnic tables, perched on the steps, sat at folding card tables on the veranda. They ate and drank, admired the house, the gardens. No one seemed concerned about the lack of furniture and formality. She watched Dobby sitting in a lawn chair he\u0027d brought himself, eating her pasta salad, and felt a ridiculous surge of pride. Her home, she thought, might not be finished, but it was more than ready to welcome people. She joined Gavin while he flipped burgers on the grill. \"How\u0027d you earn the KP?\" \"I gave Ford a break.\" He smiled down at Cilla. \"Practicing being a father-in-law. It\u0027s a good party, Cilla. It\u0027s good to have one here again.\" \"I\u0027m thinking of it as the first annual Labor Day at the farm. Next year, even better.\" \"I like hearing you say that. Next year.\" \"I\u0027m exactly where I want to be. There\u0027s still a lot to do. Still a lot I need to know.\" She drew a breath. \"I talked to Mom this morning.\" \"How is she?\" \"Mature, polished and triumphant, according to the reviews. It\u0027s going to be difficult for her to come here, to the farm, for the wedding. She will, but it\u0027ll be difficult for her. Will it for you?\" \"What do you mean?\" \"Having her here, going through that ritual, the wedding, with her here?\" \"Absolutely not.\" The surprise in his voice brought her comfort. \"It wasn\u0027t all bad times between us, Cilla. It had to end for me to be exactly where I want to be, and, I suspect, for your mother to be mature, polished and triumphant.\" \"Then that\u0027s something to cross off my should-I-worry-about-this list. I want to get married here. It\u0027s our place now, Ford\u0027s and mine. And I like knowing my parents had their first kiss over there. And that my grandmother walked the gardens. That your grandfather plowed those fields. It all trickles down. I\u0027ve wanted that all my life. Look at the house,\" she murmured. \"It\u0027s never looked more right, more real than it does now.\" \"That\u0027s what I want, too. The right, and the real. Did you come here after Johnnie died?\" \"A few times. She seemed to like seeing me. The last was a couple of months before she died. I was doing some summer stock in Richmond. My father was ill, so I came to see him. When I learned she was here, I came by. She seemed better, or she was trying very hard to be. We talked about him, of course. I don\u0027t think he was ever out of her mind. She hadn\u0027t brought anyone with her, not like before when the house always seemed full of people. It was just the two of us for about an hour, in the living room.\" \"On the pink couch with the white satin pillows,\" Cilla added. \"Yes.\" He laughed a little. \"How did you know about that?\" \"I heard about it. Very Doris Day.\" \"I suppose it was. I must have commented on it, because I remember her saying she wanted bright in the house again. It was time for the new and the bright, so she\u0027d had it shipped all the way from L.A.\" He poked at the grilling chicken, flipped a burger. \"She went back the next day, and I went back to Richmond for the rest of the summer. So that would\u0027ve been the last time I saw her. It\u0027s a good image, really. Janet sitting on that pink, Hollywood couch with her dog snoring under the coffee table.\" \"I wonder if I have a picture of her on it. Ford\u0027s grandfather gave me so many pictures. I need to go through them again. If I can find one, I\u0027ll give you a copy. Here, let me have that platter.\" She took the dish Gavin had loaded with burgers, hot dogs, grilled chicken. \"I\u0027ll deliver this to Station Meat, then go find Ford.\" She wended her way through the backyard crowd, around the veranda dwellers and into the kitchen. She saw that Patty or Penny had been through by the stack of empty and freshly washed plates and bowls. Since that brought on some mild guilt, she prepared to wash the pair of serving plates she\u0027d brought in with her instead of just putting them in the sink. It felt good, watching through the kitchen window while she washed up, having this quick moment alone. She saw her father still at the grill, with Ford\u0027s father now, and Brian. Buddy and his wife at a picnic table with Tom and Cathy, and Patty stopping by to chat. There was Matt tossing a ball to his little boy while Josie looked on, the baby tucked in her arm. Penny was right, Cilla realized with a quick laugh. She and Ford would make gorgeous babies. Something to think about. When the phone she had charging on the counter rang, she picked it up with the smile still curving her lips. \"This is Cilla. Why aren\u0027t you here?\" \"Ms. McGowan?\" \"Yes. Sorry.\" \"It\u0027s Detective Wilson. I have some information.\" WHEN FORD CAME IN through the front he saw her standing at the sink, looking out. \"Look at us, being hosts. You washing up, me taking out the trash. I loaded a couple of bags in your truck. One of us needs to hit the dump tomorrow.\" He slipped his arms around her, started to draw her back against him, and felt it immediately. \"What is it?\" He turned her, scanned her face. \"What happened?\" \"Hennessy\u0027s dead. He killed himself. He made a noose out of his own shirt, and-\" He drew her against him now, hard. She trembled first, then held on. \"Oh God, Ford. Oh God.\" \"Some people can\u0027t be saved, Cilla. Can\u0027t be helped.\" \"He never got over it, got past it. What happened to his son. All these years, he had a purpose, and he had his bitterness. But when his son died, all he had was the bitterness.\" \"And it killed him.\" He pulled her back, looking into her eyes to be sure she understood just that. \"It\u0027s the hate that ended him, Cilla.\" \"I\u0027m not blaming myself. I have to keep saying it, keep thinking it, so I won\u0027t. And I\u0027m not. But there\u0027s no denying I was part of it. He made me part of it. I guess that\u0027s another kind of revenge. His poor wife, Ford. She\u0027s lost everything. And horribly, there\u0027s a part of me that\u0027s relieved.\" \"He hurt you, and he tried to do worse. Do you want some time? I can go out, try to wrap things up.\" \"No. No. He did enough.\" She looked back out the window, at the people on her lawn. \"He\u0027s not going to ruin this.\" \"FORD, JUST THE MAN I wanted to see.\" Gavin handed over the spatula and tongs, then picked up the platter. \"Your turn.\" With his free hand, he hefted a beer. \"And mine.\" \"You sure this younger generation knows how to handle the grill?\" Tom asked. \"We can put you guys down,\" Brian responded. \"Anytime, anywhere.\" \"I feel a grill-off coming on. But before we get to that, I need to exploit my future son-in-law. I\u0027d like you to come in and talk to my creative writing students.\" \"Oh. Well. Um.\" \"Actually, we\u0027d like to do a three-part, possibly five-part, program on storytelling through words and art. Our art teacher is very excited by the idea.\" \"Oh,\" Ford repeated, and had Brian laughing. \"He\u0027s getting a flashback of high school, where he was president of the Nerd Club.\" \"Three years of being pantsed and recovering from wedgies.\" \"Matt, Shanna and I saved you when we could.\" \"Not often enough.\" \"I give you my word, your ass will not be exposed or abused on my watch.\" Ford gave Gavin a sour look. \"Can I have an armed escort?\" \"We\u0027ll need to work out the details, the dates, and anything you might want or need. I can talk to you about my end of it. You should contact Sharon, the art teacher. She loves your work, by the way. Let me give you her contact information. Ah...\" He looked at his full hands. \"Got anything to write on, with?\" \"No. Gee, I guess we\u0027ll have to forget the whole thing.\" \"I happen to have something.\" Grinning, Tom pulled a small leather-bound notebook and short pen out of his pocket. \"Sharon, you said?\" Gavin relayed the information, cocked an eye at Ford when he passed him the sheet. \"You do want to marry my daughter, don\u0027t you?\" \"Yeah.\" Trapped, Ford stuffed the paper in his pocket. \"I\u0027m going to deliver this, then I\u0027ll come back and give you the basic overview of what I have in mind.\" \"I should\u0027ve known there\u0027d be strings,\" Ford muttered when Gavin strolled away. \"Get used to it.\" Tom clamped a hand on Ford\u0027s shoulder. \"And now that you\u0027re engaged, and there\u0027s Matt with his lovely family, how long before the last of the Musketeers settles down?\" \"Your turn,\" Ford said gleefully. Brian shook his head. \"You bastard. Under the circumstances, I don\u0027t know why I\u0027m telling you we\u0027re continuing this holiday with poker- guys only-at my place tonight. We\u0027re tapping you for leftover beer and food, Rembrandt.\" \"I suck at poker.\" \"Which is why, even under the circumstances.\" \"I don\u0027t know if-\" \"See?\" Brian pointed at his father. \"She\u0027s already got him by the balls. And you ask me why I\u0027m single.\" \"She doesn\u0027t have me-\" \"Still getting pantsed. Only now by a woman.\" \"Jesus. Remind me why I\u0027m friends with you.\" \"Nine o\u0027clock. Bring beer.\" WITH CONSIDERABLE HELP from friends, cleanup went quickly. Trash was bagged, leftovers tubbed, recyclables binned. A small convoy of the faithful hauled what needed to be hauled back to Ford\u0027s. \"Two households,\" Angie commented, \"and still not quite enough room. What should I do with this pie?\" \"Ford can take it to Brian\u0027s.\" \"I don\u0027t think I\u0027m-\" Cilla cut him off with a look. \"Go, be a man. Get out of my two households for a few hours. I\u0027m fine.\" \"Of course she\u0027s fine.\" Patty sealed a small bowl of leftover three-bean salad. \"Why wouldn\u0027t she be fine? Has something else happened?\" she said when she saw the way Ford glanced at Cilla. \"Is something wrong?\" \"Hennessy killed himself last night. Ford\u0027s worried I\u0027ve taken it too much to heart.\" \"Oh, honey!\" \"It\u0027s that, plus I don\u0027t like leaving you alone.\" \"We\u0027ll stay,\" Patty said immediately. \"We\u0027ll all stay,\" Penny put in. \"We\u0027ll have our own-all women- party.\" \"You will not stay. I don\u0027t need babysitters. I\u0027m going to work on the photos your father gave me,\" she said as she handed a bowl to Ford\u0027s mother. \"A couple of hours of quiet is just what I need. No offense.\" \"But-\" \"And I want to draw up some ideas for the gym and studio addition without you hanging over my shoulder. Go away. I\u0027ll stay here until you get back,\" she added when she saw more arguments in his eyes. \"Brid, Warrior Goddess, requires no bodyguards. Now leave.\" \"Fine. It won\u0027t take me more than a couple hours to lose anyway.\" \"That\u0027s the spirit.\" \"All right, girls, let\u0027s claim our dishes and load it up. I\u0027ll give everyone a ride home since the men have deserted us.\" Penny put her hands on Cilla\u0027s shoulders. \"I\u0027m going to call you tomorrow, and we\u0027re going to set the time and place for you, Patty and me to hold our first Wedding of the Year strategy session.\" \"Should I be afraid?\" \"Very.\" Penny kissed her cheek. \"You\u0027re a good girl.\" Watching the way Penny herded everyone out the door told Cilla she would have a very interesting, and very compatible, mother-in-law. \"Now you,\" she told Ford. \"I can probably lose in an hour.\" \"Stop. I\u0027m tucked in here. No one\u0027s going to bother me. No one has bothered me for some time now. The fact is, Hennessy\u0027s dead, and the media is going to pick up on that. Some of it will start again. I could use a quiet, normal evening before the circus comes to town. And I\u0027m not going to have either of us live worrying about me spending a quiet, normal evening alone. Besides...\" She bent down to scratch Spock. \"I have a bodyguard.\" \"Keep the door locked anyway.\" \"I\u0027ll keep the door locked anyway.\" She gave him a last kiss, then a shove out the door. \"Don\u0027t bet on an inside straight.\" Then shut it, locked it at his back. She turned around, let out a long sigh, then grinned at Spock. \"I thought they\u0027d never leave.\" Content, she walked upstairs for the box of photos.","sourceLink":"https://allnovel.net/tribute/page-29.html","bookId":2414,"book":{"id":2414,"title":"Tribute","description":"Storyline: Cilla McGowan, a former child star, has found a more satisfying life restoring homes. So she comes to Virginia’s Shenandoah Valley to save the dilapidated farmhouse that once belonged to her grandmother—a legendary actress who died of an overdose more than thirty years ago. Plunging into the project with gusto, Cilla’s almost too busy and exhausted to notice her neighbor, graphic novelist Ford Sawyer. Determined not to carry on the family tradition of ill-fated romances, Cilla steels herself against Ford’s quirky charm, though she can’t help indulging in a little fantasy. But it’s reality that holds its share of dangers for Cilla. A cache of unsigned letters found in the attic points to a mysterious romance in her grandmother’s life—and may be the catalyst for a frightening, violent assault. And if Cilla and Ford are unable to sort out who is targeting her and why, she may, like her world-famous grandmother, be cut down in the prime of her life.","cover":"https://allnovel.net/images/tribute.jpg","author":"Nora Roberts","type":"Mystery","source":"allnovel","link":"https://allnovel.net/tribute.html","creation":"Oct 5, 2019 8:58:42 AM","modification":"Oct 5, 2019 10:35:03 AM"}}
