{"id":100768,"no":10,"title":"Page 10","content":"9\n Every supe I\u0027d ever met was in Merlotte\u0027s. Or maybe it just seemed like that, since I was dead tired and wanted to be by myself. The Were pack was there, all in human form and all more or less dressed, to my relief.\n Alcide was in khakis and an unbuttoned shirt in green and blue plaid. It was hard to believe he could run on four legs. The Weres were drinking coffee or soft drinks, and Eric (looking happy and healthy) was having some TrueBlood. Pam was sitting on a barstool, wearing an ash green tracksuit, which she managed to make prim-but-sexy. She had a bow in her hair and beaded sneakers on her feet. She\u0027d brought Gerald with her, a vampire I\u0027d met once or twice at Fangtasia. Gerald looked about thirty, but I\u0027d heard him refer to Prohibition once as if he\u0027d lived through it. What little I knew of Gerald didn\u0027t predispose me to getting closer to him.\n Even in such a company, my entrance with Claudine was nothing short of sensational. In the improved lighting of the bar, I could see that Claudine\u0027s strategically rounded body was packed into an orange knit dress, and her long legs ended in the highest of high heels. She looked like a scrumptious slut, super-sized.\n Nope, she couldn\u0027t be an angel - at least, as I understood angels.\n Looking from Claudine to Pam, I decided it was massively unfair that they looked so clean and appealing. Like I needed to feel unattractive, in addition to being worn out and scared and confused! Doesn\u0027t every gal want to walk into a room side by side with a gorgeous woman who practically has \"I want to fuck\" tattooed on her forehead? If I hadn\u0027t caught a glimpse of Sam, whom I\u0027d dragged into this whole thing, I would\u0027ve turned around and walked right out.\n \"Claudine,\" said Colonel Flood. \"What brings you here?\"\n Pam and Gerald were both staring at the woman in orange intently, as if they expected her to take off her clothes any second.\n \"My girl, here\" - and Claudine inclined her head toward me - \"fell asleep at the wheel. How come you aren\u0027t watching out for her better?\"\n The colonel, as dignified in his civvies as he had been in his skin, looked a little startled, as if it was news to him that he was supposed to provide protection for me. \"Ah,\" he said. \"Uh...\"\n \"Should have sent someone to the hospital with her,\" Claudine said, shaking her waterfall of black hair.\n \"I offered to go with her,\" Eric said indignantly. \"She said it would be too suspicious if she went to the hospital with a vampire.\"\n \"Well, hel-lo, tall, blond, and dead,\" Claudine said. She looked Eric up and down, admiring what she saw. \"You in the habit of doing what human women ask of you?\"\n Thanks a lot, Claudine, I told her silently. I was supposed to be guarding Eric, and now he wouldn\u0027t even shut the door if I told him to. Gerald was still ogling her in the same stunned way. I wondered if anyone would notice if I stretched out on one of the tables and went to sleep. Suddenly, just as Pam\u0027s and Gerald\u0027s had done, Eric\u0027s gaze sharpened and he seemed fixed on Claudine. I had time to think it was like watching cats that\u0027d suddenly spotted something skittering along the baseboards before big hands spun me around and Alcide gathered me to him. He\u0027d maneuvered through the crowd in the bar until he\u0027d reached me. Since his shirt wasn\u0027t buttoned, I found my face pressed against his warm chest, and I was glad to be there. The curly black hair did smell faintly of dog, true, but otherwise I was comforted at being hugged and cherished. It felt delightful.\n \"Who are you?\" Alcide asked Claudine. I had my ear against his chest and I could hear him from inside and outside, a strange sensation.\n \"I\u0027m Claudine, the fairy,\" the huge woman said. \"See?\"\n I had to turn to see what she was doing. She\u0027d lifted her long hair to show her ears, which were delicately pointed.\n \"Fairy,\" Alcide repeated. He sounded as astonished as I felt.\n \"Sweet,\" said one of the younger Weres, a spiky-haired male who might be nineteen. He looked intrigued with the turn of events, and he glanced around at the other Weres seated at his table as if inviting them to share his pleasure. \"For real?\"\n \"For a while,\" Claudine said. \"Sooner or later, I\u0027ll go one way or another.\" No one understood that, with the possible exception of the colonel.\n \"You are one mouthwatering woman,\" said the young Were. To back up the fashion statement of the spiked hair, he wore jeans and a ragged Fallen Angel T-shirt; he was barefoot, though Merlotte\u0027s was cool, since the thermostat was turned down for the rest of the night. He was wearing toe rings.\n \"Thanks!\" Claudine smiled down at him. She snapped her fingers, and there was the same kind of haze around her that enveloped the Weres when they shifted. It was the haze of thick magic. When the air cleared, Claudine was wearing a spangled white evening gown.\n \"Sweet,\" the boy repeated in a dazed way, and Claudine basked in his admiration. I noticed she was keeping a certain distance from the vampires.\n \"Claudine, now that you\u0027ve shown off, could we please talk about something besides you?\" Colonel Flood sounded as tired as I felt.\n \"Of course,\" Claudine said in an appropriately chastened voice. \"Just ask away.\"\n \"First things first. Miss Stackhouse, how is Maria-Star?\"\n \"She survived the ride to the hospital in Clarice. They\u0027re airlifting her to Shreveport, to Schumpert hospital. She may already be on her way. The doctor sounded pretty positive about her chances.\"\n The Weres all looked at one another, and most of them let out gusty noises of relief. One woman, about thirty years old, actually did a little happy dance. The vampires, by now almost totally fixated on the fairy, didn\u0027t react at all.\n \"What did you tell the emergency room doctor?\" Colonel Flood asked. \"I have to let her parents know what the official line is.\" Maria-Star would be their first-born, and their only Were child.\n \"I told the police that I found her by the side of the road, that I didn\u0027t see any signs of a car braking or anything. I told them she was lying on the gravel, so we won\u0027t have to worry about grass that isn\u0027t pressed down when it ought to be.... I hope she got it. She was pretty doped up when I talked to her.\"\n \"Very good thinking,\" Colonel Flood said. \"Thanks, Miss Stackhouse. Our pack is indebted to you.\"\n I waved my hand to disclaim any debt. \"How did you come to show up at Bill\u0027s house at the right time?\"\n \"Emilio and Sid tracked the witches to the right area.\" Emilio must be the small, dark man with huge brown eyes. There was a growing immigrant Mexican population in our area, and Emilio was apparently a part of that community. The spike-haired boy gave me a little wave, and I assumed he must be Sid. \"Anyway, after dark, we started keeping an eye on the building where Hallow and her coven are holed up. It\u0027s hard to do; it\u0027s a residential neighborhood that\u0027s mostly black.\" African-American twins, both girls, grinned at each other. They were young enough to find this exciting, like Sid. \"When Hallow and her brother left for Bon Temps, we followed them in our cars. We called Sam, too, to warn him.\"\n I looked at Sam reproachfully. He hadn\u0027t warned me, hadn\u0027t mentioned the Weres were heading our way, too.\n Colonel Flood went on, \"Sam called me on my cell to tell me where he figured they were heading when they walked out of his bar. I decided an isolated place like the Compton house would be a good place to get them. We were able to park our cars in the cemetery and change, so we got there just in time. But they caught our scent early.\" The colonel glared at Sid. Apparently, the younger Were had jumped the gun.\n \"So they got away,\" I said, trying to sound neutral. \"And now they know you\u0027re on to them.\"\n \"Yes, they got away. The murderers of Adabelle Yancy. The leaders of a group trying to take over not only the vamps\u0027 territory, but ours.\" Colonel Flood had been sweeping the assembled Weres with a cold gaze, and they wilted under his stare, even Alcide. \"And now the witches\u0027ll be on their guard, since they know we\u0027re after them.\"\n Their attention momentarily pulled from the radiant fairy Claudine, Pam and Gerald seemed discreetly amused by the colonel\u0027s speech. Eric, as always these days, looked as confused as if the colonel were speaking in Sanskrit.\n \"The Stonebrooks went back to Shreveport when they left Bill\u0027s?\" I asked.\n \"We assume so. We had to change back very quickly - no easy matter - and then get to our cars. A few of us went one way, a few another, but we caught no glimpse of them.\"\n \"And now we\u0027re here. Why?\" Alcide\u0027s voice was harsh.\n \"We\u0027re here for several reasons,\" the packmaster said. \"First, we wanted to know about Maria-Star. Also, we wanted to recover for a bit before we drive back to Shreveport ourselves.\"\n The Weres, who seemed to have pulled their clothes on pretty hastily, did look a little ragged. The dark-moon transformation and the rapid change back to two-legged form had taken a toll on all of them.\n \"And why are you here?\" I asked Pam.\n \"We have something to report, too,\" she said. \"Evidently, we have the same goals as the Weres - on this matter, anyway.\" She tore her gaze away from Claudine with an effort. She and Gerald exchanged glances, and as one, they turned to Eric, who looked back at them blankly. Pam sighed, and Gerald looked down at his booted feet.\n \"Our nest mate Clancy didn\u0027t return to us last night,\" Pam said. Hard on this startling announcement, she focused once again on the fairy. Claudine seemed to have some overwhelming allure for the vampires.\n Most of the Weres looked like they were thinking that one less vampire was a step in the right direction. But Alcide said, \"What do you think has happened?\"\n \"We got a note,\" Gerald said, one of the few times I\u0027d ever heard him speak out loud. He had a faint English accent. \"The note said that the witches plan to drain one of our vampires for each day they have to search for Eric.\"\n All eyes went to Eric, who looked stunned. \"But why?\" he asked. \"I can\u0027t understand what makes me such a prize.\"\n One of the Were girls, a tan blonde in her late twenties, took silent issue with that. She rolled her eyes toward me, and I could only grin back. But no matter how good Eric looked, and what ideas interested parties might have about the fun to be had with him in bed (and on top of that, the control he had over various vampire enterprises in Shreveport), this single-minded pursuit of Eric rang the \"Excessive\" alarm. Even if Hallow had sex with Eric, and then drained him dry and consumed all his blood - Wait, there was an idea.\n \"How much blood can be got from one of you?\" I asked Pam.\n She stared at me, as close to surprised as I\u0027d ever seen her. \"Let me see,\" she said. She stared into space, and her fingers wiggled. It looked like Pam was translating from one unit of measurement to another. \"Six quarts,\" she said at last.\n \"And how much blood do they sell in those little vials?\"\n \"That\u0027s...\" She did some more figuring. \"Well, that would be less than a fourth of a cup.\" She anticipated where I was heading. \"So Eric contains over ninety-six salable units of blood.\"\n \"How much you reckon they could charge for that?\"\n \"Well, on the street, the price has reached $225 for regular vampire blood,\" Pam said, her eyes as cold as winter frost. \"For Eric\u0027s blood... He is so old....\"\n \"Maybe $425 a vial?\"\n \"Conservatively.\"\n \"So, on the hoof, Eric\u0027s worth...\"\n \"Over forty thousand dollars.\"\n The whole crowd stared at Eric with heightened interest - except for Pam and Gerald, who along with Eric had resumed their contemplation of Claudine. They appeared to have inched closer to the fairy.\n \"So, do you think that\u0027s enough motivation?\" I asked. \"Eric spurned her. She wants him, she wants his stuff, and she wants to sell his blood.\"\n \"That\u0027s a lot of motivation,\" agreed a Were woman, a pretty brunette in her late forties.\n \"Plus, Hallow\u0027s nuts,\" Claudine said cheerfully.\n I didn\u0027t think the fairy had stopped smiling since she\u0027d appeared in my car. \"How do you know that, Claudine?\" I asked.\n \"I\u0027ve been to her headquarters,\" she said.\n We all regarded her in silence for a long moment, but not as raptly as the three vampires did.\n \"Claudine, have you gone over?\" Colonel Flood asked. He sounded more tired than anything else.\n \"James,\" Claudine said. \"Shame on you! She thought I was an area witch.\"\n Maybe I wasn\u0027t the only one who was thinking that such overflowing cheer was a little weird. Most of the fifteen or so Weres in the bar didn\u0027t seem too comfortable around the fairy. \"It would have saved us a lot of trouble if you\u0027d told us that earlier than tonight, Claudine,\" the colonel said, his tone frosty.\n \"A real fairy,\" Gerald said. \"I\u0027ve only had one before.\"\n \"They\u0027re hard to catch,\" Pam said, her voice dreamy. She edged a little closer.\n Even Eric had lost his blank and frustrated mien and took a step toward Claudine. The three vamps looked like chocaholics at the Hershey factory.\n \"Now, now,\" Claudine said, a little anxiously. \"Anything with fangs, take a step back!\"\n Pam looked a bit embarrassed, and she tried to relax. Gerald subsided unwillingly. Eric kept creeping forward.\n Neither of the vampires nor any of the Weres looked willing to take Eric on. I mentally girded my loins. After all, Claudine had awakened me before I could crash my car.\n \"Eric,\" I said, taking three quick steps to stand between Eric and the fairy. \"Snap out of it!\"\n \"What?\" Eric paid no more attention to me than he would to a fly buzzing around his head.\n \"She\u0027s off limits, Eric,\" I said, and Eric\u0027s eyes did flicker down to my face.\n \"Hi, remember me?\" I put my hand on his chest to slow him down. \"I don\u0027t know why you\u0027re in such a lather, fella, but you need to hold your horses.\"\n \"I want her,\" Eric said, his blue eyes blazing down into mine.\n \"Well, she\u0027s gorgeous,\" I said, striving for reasonable, though actually I was a little hurt. \"But she\u0027s not available. Right, Claudine?\" I aimed my voice back over my shoulder.\n \"Not available to a vampire,\" the fairy said. \"My blood is intoxicating to a vampire. You don\u0027t want to know what they\u0027d be like after they had me.\" But she still sounded cheerful.\n So I hadn\u0027t been too far wrong with the chocolate metaphor. Probably this was why I hadn\u0027t encountered any fairies before; I was too much in the company of the undead.\n When you have thoughts like that, you know you\u0027re in trouble.\n \"Claudine, I guess we need you to step outside now,\" I said a little desperately. Eric was pushing against me, not testing me seriously yet (or I\u0027d be flat on my back), but I\u0027d had to retreat a step already. I wanted to hear what Claudine had to tell the Weres, but I realized separating the vamps from the fairy was top priority.\n \"Just like a big petit four,\" Pam sighed, watching Claudine twitch her white-spangled butt all the way out the front door with Colonel Flood close behind her. Eric seemed to snap to once Claudine was out of sight, and I breathed a sigh of relief.\n \"Vamps really like fairies, huh?\" I said nervously.\n \"Oh, yeah,\" they said simultaneously.\n \"You know, she saved my life, and she\u0027s apparently helping us out on this witch thing,\" I reminded them.\n They looked sulky.\n \"Claudine was actually quite helpful,\" Colonel Flood said as he reentered, sounding surprised. The door swung shut behind him.\n Eric\u0027s arm went around me, and I could feel one kind of hunger being morphed into another.\n \"Why was she in their coven headquarters?\" Alcide asked, more angrily than was warranted.\n \"You know fairies. They love to flirt with disaster, they love to role-play.\" The packmaster sighed heavily. \"Even Claudine, and she\u0027s one of the good ones. Definitely on her way up. What she tells me is this: This Hallow has a coven of about twenty witches. All of them are Weres or the larger shifters. They are all vampire blood users, maybe addicts.\"\n \"Will the Wiccans help us fight them?\" asked a middle-aged woman with dyed red hair and a couple of chins.\n \"They haven\u0027t committed to it yet.\" A young man with a military haircut - I wondered if he was stationed at Barksdale Air Force Base - seemed to know the story on the Wiccans. \"Acting on our packmaster\u0027s orders, I called or otherwise contacted every Wiccan coven or individual Wiccan in the area, and they are all doing their best to hide from these creatures. But I saw signs that most of them were heading for a meeting tonight, though I don\u0027t know where. I think they are going to discuss the situation on their own. If they could mount an attack as well, it would help us.\"\n \"Good work, Portugal,\" said Colonel Flood, and the young man looked gratified.\n Since we had our backs to the wall, Eric had felt free to let his hand roam over my bottom. I didn\u0027t object to the sensation, which was very pleasant, but I did object to the venue, which was too darn public.\n \"Claudine didn\u0027t say anything about prisoners who might have been there?\" I asked, taking a step away from Eric.\n \"No, I\u0027m sorry, Miss Stackhouse. She didn\u0027t see anyone answering your brother\u0027s description, and she didn\u0027t see the vampire Clancy.\"\n I wasn\u0027t exactly surprised, but I was very disappointed. Sam said, \"I\u0027m sorry, Sookie. If Hallow doesn\u0027t have him, where can he be?\"\n \"Of course, just because she didn\u0027t see him, doesn\u0027t mean he\u0027s not there for sure,\" the colonel said. \"We\u0027re sure she took Clancy, and Claudine didn\u0027t catch sight of him.\"\n \"Back to the Wiccans,\" suggested the red-haired Were. \"What should we do about them?\"\n \"Tomorrow, Portugal, call all your Wiccan contacts again,\" Colonel Flood said. \"Get Culpepper to help you.\"\n Culpepper was a young woman with a strong, handsome face and a no-nonsense haircut. She looked pleased to be included in something Portugal was doing. He looked pleased, too, but he tried to mask it under a brusque manner. \"Yes, sir,\" he said snappily. Culpepper thought that was cute as hell; I was lifting that directly from her brain. Were she might be, but you couldn\u0027t disguise an admiration that intense. \"Uh, why am I calling them again?\" Portugal asked after a long moment.\n \"We need to know what they plan to do, if they\u0027ll share that with us,\" Colonel Flood said. \"If they\u0027re not with us, they can at least stay out of the way.\"\n \"So, we\u0027re going to war?\" This was from an older man, who seemed to be a pair with the red-haired woman.\n \"It was the vampires that started it,\" the redheaded woman said.\n \"That is so untrue,\" I said indignantly.\n \"Vamp humper,\" she said.\n I\u0027d had worse things said about me, but not to my face, and not from people who intended me to hear them.\n Eric had left the floor before I could decide if I was more hurt or more enraged. He had instantly opted for enraged, and it made him very effective. She was on the ground on her back and he was on top of her with fangs extended before anyone could even be alarmed. It was lucky for the red-haired woman that Pam and Gerald were equally swift, though it took both of them to lift Eric off the redheaded Were. She was bleeding only a little, but she was yelping nonstop.\n For a long second, I thought the whole room was going to erupt into battle, but Colonel Flood roared, \"SILENCE!\" and you didn\u0027t disobey that voice.\n \"Amanda,\" he said to the red-haired woman, who was whimpering as though Eric had removed a limb, and whose companion was busy checking out her injuries in a wholly unnecessary panic, \"you will be polite to our allies, and you will keep your damn opinions to yourself. Your offense cancels out the blood he spilled. No retaliation, Parnell!\" The male Were snarled at the colonel, but finally gave a grudging nod.\n \"Miss Stackhouse, I apologize for the poor manners of the pack,\" Colonel Flood said to me. Though I was still upset, I made myself nod. I couldn\u0027t help but notice that Alcide was looking from me to Eric, and he looked - well, he looked appalled. Sam had the sense to be quite expressionless. My back stiffened, and I ran a quick hand over my eyes to dash away the tears.\n Eric was calming down, but it was with an effort. Pam was murmuring in his ear, and Gerald was keeping a good grip on his arm.\n To make my evening perfect, the back door to Merlotte\u0027s opened once again, and Debbie Pelt walked in.\n \"Y\u0027all are having a party without me.\" She looked at the odd assemblage and raised her eyebrows. \"Hey, baby,\" she said directly to Alcide, and ran a possessive hand down his arm, twining her fingers with his. Alcide had an odd expression on his face. It was as though he was simultaneously happy and miserable.\n Debbie was a striking woman, tall and lean, with a long face. She had black hair, but it wasn\u0027t curly and disheveled like Alcide\u0027s. It was cut in asymmetrical tiny clumps, and it was straight and swung with her movement. It was the dumbest haircut I\u0027d ever seen, and it had undoubtedly cost an arm and a leg. Somehow, men didn\u0027t seem to be interested in her haircut.\n It would have been hypocritical of me to greet her. Debbie and I were beyond that. She\u0027d tried to kill me, a fact that Alcide knew; and yet she still seemed to exercise some fascination for him, though he\u0027d thrown her out when he first learned of it. For a smart and practical and hardworking man, he had a great big blind spot, and here it was, in tight Cruel Girl jeans and a thin orange sweater that hugged every inch of skin. What was she doing here, so far from her own stomping grounds?\n I felt a sudden impulse to turn to Eric and tell him that Debbie had made a serious attempt on my life, just to see what would happen. But I restrained myself yet again. All this restraint was plain painful. My fingers were curled under, transforming my hands into tight fists.\n \"We\u0027ll call you if anything more happens in this meeting,\" Gerald said. It took me a minute to understand I was being dismissed, and that it was because I had to take Eric back to my house lest he erupt again. From the look on his face, it wouldn\u0027t take much. His eyes were glowing blue, and his fangs were at least half extended. I was more than ever tempted to... no, I was not. I would leave.\n \"Bye, bitch,\" Debbie said, as I went out the door. I caught a glimpse of Alcide turning to her, his expression appalled, but Pam grabbed me by the arm and hustled me out into the parking lot. Gerald had a hold of Eric, which was a good thing, too.\n As the two vampires handed us out to Chow, I was seething.\n Chow thrust Eric into the passenger\u0027s seat, so it appeared I was the designated driver. The Asian vamp said, \"We\u0027ll call you later, go home,\" and I was about to snap back at him. But I glanced over at my passenger and decided to be smart instead and get out of there quickly. Eric\u0027s belligerence was dissolving into a muddle. He looked confused and lost, as unlike the hair-trigger avenger he\u0027d been only a few minutes before as you can imagine.\n We were halfway home before Eric said anything. \"Why are vampires so hated by Weres?\" he asked.\n \"I don\u0027t know,\" I answered, slowing down because two deer bounded across the road. You see the first one, you always wait: There\u0027ll be another one, most often. \"Vamps feel the same about Weres and shifters. The supernatural community seems to band together against humans, but other than that, you guys squabble a lot, at least as far as I can tell.\" I took a deep breath and considered phraseology. \"Um, Eric, I appreciate your taking my part, when that Amanda called me a name. But I\u0027m pretty used to speaking up for myself when I think it\u0027s called for. If I were a vampire, you wouldn\u0027t feel you had to hit people on my behalf, right?\"\n \"But you\u0027re not as strong as a vampire, not even as strong as a Were,\" Eric objected.\n \"No argument there, honey. But I also wouldn\u0027t have even thought of hitting her, because that would give her a reason to hit me back.\"\n \"You\u0027re saying I made it come to blows when I didn\u0027t need to.\"\n \"That\u0027s exactly what I\u0027m saying.\"\n \"I embarrassed you.\"\n \"No,\" I said instantly. Then I wondered if that wasn\u0027t exactly the case. \"No,\" I repeated with more conviction, \"you didn\u0027t embarrass me. Actually, it made me feel good, that you felt, ah, fond enough of me to be angry when Amanda acted like I was something stuck to her shoe. But I\u0027m used to that treatment, and I can handle it. Though Debbie\u0027s taking it to a whole different level.\"\n The new, thoughtful Eric gave that a mental chewing over.\n \"Why are you used to that?\" he asked.\n It wasn\u0027t the reaction I\u0027d expected. By that time we were at the house, and I checked out the surrounding clearing before I got out of the car to unlock the back door. When we were safely inside with the dead bolt shot, I said, \"Because I\u0027m used to people not thinking much of barmaids. Uneducated barmaids. Uneducated telepathic barmaids. I\u0027m used to people thinking I\u0027m crazy, or at least off mentally. I\u0027m not trying to sound like I think I\u0027m Poor Pitiful Pearl, but I don\u0027t have a lot of fans, and I\u0027m used to that.\"\n \"That confirms my bad opinion of humans in general,\" Eric said. He pulled my coat off my shoulders, looked at it with distaste, hung it on the back of one of the chairs pushed in under the kitchen table. \"You are beautiful.\"\n No one had ever looked me in the eyes and said that. I found I had to lower my head. \"You are smart, and you are loyal,\" he said relentlessly, though I waved a hand to ask him to quit. \"You have a sense of fun and adventure.\"\n \"Cut it out,\" I said.\n \"Make me,\" he said. \"You have the most beautiful breasts I\u0027ve ever seen. You\u0027re brave.\" I put my fingers across his mouth, and his tongue darted out to give them a quick lick. I relaxed against him, feeling the tingle down to my toes. \"You\u0027re responsible and hardworking,\" he continued. Before he could tell me that I was good about replacing the garbage can liner when I took the garbage out, I replaced my fingers with my lips.\n \"There,\" he said softly, after a long moment. \"You\u0027re creative, too.\"\n For the next hour, he showed me that he, too, was creative.\n It was the only hour in an extremely long day that I hadn\u0027t been consumed with fear: for the fate of my brother, about Hallow\u0027s malevolence, about the horrible death of Adabelle Yancy. There were probably a few more things that made me fearful, but in such a long day it was impossible to pick any one thing that was more awful than the other.\n As I lay wrapped up in Eric\u0027s arms, humming a little wordless tune as I traced the line of his shoulder with an idle finger, I was bone-deep grateful for the pleasure he\u0027d given me. A piece of happiness should never be taken as due.\n \"Thank you,\" I said, my face pressed to his silent chest.\n He put a finger under my chin so I would raise my eyes to his. \"No,\" he said quietly. \"You took me in off the road and kept me safe. You\u0027re ready to fight for me. I can tell this about you. I can\u0027t believe my luck. When this witch is defeated, I would bring you to my side. I will share everything I have with you. Every vampire who owes me fealty will honor you.\"\n Was this medieval, or what? Bless Eric\u0027s heart, none of that was going to happen. At least I was smart enough, and realistic enough, not to deceive myself for a minute, though it was a wonderful fantasy. He was thinking like a chieftain with thralls at his disposal, not like a ruthless head vampire who owned a tourist bar in Shreveport.\n \"You\u0027ve made me very happy,\" I said, which was certainly the truth. \n","sourceLink":"https://allnovel.net/dead-to-the-world-sookie-stackhouse-4/page-10.html","bookId":2194,"book":{"id":2194,"title":"Dead to the World (Sookie Stackhouse #4)","description":"Storyline: \n Dead to the World (Sookie Stackhouse #4) \n Sookie Stackhouse is a cocktail waitress in Bon Temps, Louisiana. She has only a few close friends, because not everyone appreciates Sookie’s gift: she can read minds. That’s not exactly every man’s idea of date bait – unless they’re undead; vampires and the like can be tough to read. And that’s just the kind of guy Sookie’s been looking for. Maybe that’s why, when she comes across a naked vampire, she doesn’t just drive on by. He hasn’t got a clue who he is, but Sookie has: Eric looks just as scary and sexy – and dead – as ever. But now he has amnesia, he’s sweet, vulnerable, and in need of Sookie’s help – because whoever took his memory now wants his life.\n \n","cover":"https://allnovel.net/images/dead-to-the-world-sookie-stackhouse-4.jpg","author":"Charlaine Harris","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/dead-to-the-world-sookie-stackhouse-4.html","creation":"Oct 5, 2019 8:58:26 AM","modification":"Oct 5, 2019 6:55:56 PM"}}
