{"id":9071,"no":14,"title":"Chapter XIV A FRIEND IN NEED","content":"Shortly before nine o’clock that evening, Ashton Sanborn, or Mr. Davis, as he preferred to be known, waved a hand to Bill and Osceola and drove off along the highway. A minute or two later the road swung past the stone wall, fragrant with late honeysuckle, that bounded the Fanely estate. But instead of entering the drive, he kept going straight ahead for several miles. 183 When at last he felt that the lads had been given time enough to reach their destination, he turned the car round at a crossroad and came back, driving slowly. This time he turned in between the stone gate posts that marked the entrance. The bluestone road bed wound like a huge snake through wooded acres, and half a mile from the highway, entered a grove of tall elms that belted broad lawns landscaped with flower gardens and shrubs. The immense grey stone house looked much more like a public institution than a private dwelling. Mr. Davis parked his car before a wide stone terrace. He walked sedately up the steps and rang the doorbell. While he waited he studied the beautiful outer door, intricately fashioned of wrought iron and glass. He could not see into the house, for a curtain was drawn close to the glass on the inside. The door noiselessly opened, and framed in the ornate entrance stood a middle-aged man in evening dress. His left arm was held close to his body by a black silk sling. “Ashton Sanborn!” Mr. Davis peered closely at the man, who now looked as if he would willingly have bitten off his tongue for the ejaculation. But a moment later the recognition was mutual. 184 The secret service man smiled. “Blessed if it isn’t my friend Serge Kolinski! Fancy meeting you here, and without your mustache—no wonder I hardly recognized you!” Mr. Davis advanced with outstretched hand, while the Pole backed away. While Sanborn stared at him, the man glanced furtively over his shoulder into the gloom of the spacious hall. He seemed to be in the grip of some overwhelming fear. Then, wetting his dry lips with the tip of his tongue, he turned to the detective. “Mr. Sanborn—I—you must clear out of here—get away!” His speech now bore no trace of the foreign accent which the girls had mentioned. “You’ve always played the white man to me, Mr. Sanborn—never tried to frame me, or—But clear out, sir—do you hear?” Sanborn laughed shortly. “I thought you knew me better than that, Kolinski.” 185 “Look here, Mr. Sanborn—don’t say I haven’t warned you—don’t say I’ve done you dirt!” Kolinski’s whisper was almost inaudible. Mr. Davis frowned uneasily. The man’s fear was so genuine, his manner so agitated, that the detective felt a creepy feeling touch his spine. He shuddered involuntarily, then pulled himself together. “I’d like to speak to Professor Fanely, Kolinski—” “Don’t do it, Mr. Sanborn, don’t do it—you—” “Show Mr. Ashton Sanborn into the library, Kolinski!” The high-pitched, wheezing voice was cold and toneless, yet held an undercurrent of evil. Kolinski shivered, then placed a trembling forefinger on his lips. “Y-y-yessir.” “Then go to your room. I’ll attend to you later. You talk too much.” 186 Ashton Sanborn followed the thoroughly frightened Kolinski across the wide hall and into the library. It was empty, but a bright fire blazed on the hearth at the other end of the room. Shades were drawn over the windows. The room felt stuffy, and oppressively warm. Kolinski retired without a word. The unseen master’s voice had apparently withered his power of speech. Sanborn stood with his hands clasped behind his back, gazing about the room, waiting for Professor Fanely to appear. The four walls were lined to the ceiling with books, and the place was austerely furnished. Sanborn felt uneasy, not only in Kolinski’s behalf, but somehow obscurely, in his own. There was something sinister in the very atmosphere. The wheezing voice and its unspoken menace echoed in his brain.... 187 Five minutes passed. He wondered if Bill and Osceola were outside the windows, or whether they had been waylaid in the grounds by Fanely’s men. He took out his watch and looked at it. The five minutes extended to ten. Ashton Sanborn began to fret at the delay. But the thought that this discourtesy was probably intentional somewhat curbed his impatience. He sat down in an armchair and pulled out his pipe and tobacco. If Professor Fanely chose to ignore his visit, then old Fanely would have to put up with breach of etiquette on his part. He was just on the point of lighting it, when a gentle, cultured voice spoke immediately behind him. “That’s right, Mr. Sanborn. Make yourself at home!” Ashton Sanborn swung round in his chair. Standing not three feet away, exuding goodwill with a benign smile, and rubbing his hands together, was the biggest man the detective had ever seen. Sanborn was startled, not so much at the man’s presence, but that he had not heard him enter the room. It seemed uncanny that such a huge man could move so quietly. The secret service man jumped to his feet. 188 “Good evening! I called to see Professor Fanely. My card, apparently, is not needed.” “Oh, no, Mr. Sanborn. We—er—have heard of you, although, speaking for myself, I have never, to my knowledge, had the pleasure of seeing you before.” The big fellow stared down on Sanborn from his superior height. “Professor Fanely is not at home, Mr. Sanborn.” “Out?” “Ah! I’m afraid I express myself rather badly. I mean to convey to you that Professor Fanely is indisposed.” “But I thought I heard him speak in the hall a moment ago?” 189 “Oh, no. No, that was certainly not Professor Fanely. Oh, dear me, no.” He laughed—an unpleasant sound, for all its softness. “That was Mr.—but his name does not matter. He is upstairs now, attending to Mr. Kolinski, our estimable butler. You must not place too much reliance on our Kolinski’s chatter, you know. He does not always tell the truth. In fact, to put it bluntly, Mr. Sanborn, Mr. Kolinski is not—er—unfamiliar with the inside of a jail!” “I know that well enough. I’ve been instrumental in sending him up the river twice, myself.” “Oh, dear me! Fancy that, now!” There came a silence, during which Sanborn had the vaguely uncomfortable feeling that a third presence had somehow entered the room. Mechanically he lit his pipe, and, blowing the first mouthful of smoke upward, he carelessly subjected the ceiling to a covert scrutiny. Nothing doing. He stooped and tapped the bowl of his pipe on an ashtray which rested on a small table. No one on the left hand side of the room. He turned round quickly, ostensibly to adjust a cushion on his easy chair. A flutter of a curtain hanging near the door caught his eye. Then he seated himself and leaned back comfortably. 190 “Yes,” he answered the big man’s unspoken inquiry. “That is why I called—to warn you against Kolinski. But as you are already aware of his past delinquencies—well,—” he shrugged his shoulders and stood up. “This is beside the point, now, don’t you think? Perhaps you had better ring for the man so that I may place him under arrest.” “They’ll never bring him in here!” Bill Bolton swung the curtain back and stepped into the room, a revolver grasped in his gloved right hand. “Stick ’em up, Lambert,” he told the big man. “That’s right—stick ’em up and keep ’em up!” “But Bill—” Sanborn began, his eyes on the man called Lambert who had complied with the curt order and was reaching toward the ceiling. 191 Bill shook his head impatiently. “No time for argument, sir. They are on to your visit and don’t intend to let you leave the house alive. Kolinski is their sacrifice in this deal. He’s probably been killed by this time.” “Are you sure about this, Bill? How could you possibly learn—” “We’ve got to hustle,” Bill cut him short. “Explain later. Oh, I’m sure enough, never fear!” A colored rope was attached to the curtain. He disengaged it and tossed it to Sanborn. “Now you—” he indicated Lambert, “take a walk to that chair and sit down.” There was a murderous gleam in Lambert’s eyes as he retreated. He knew, of course, that these two were acting in conjunction, but could not understand these new secret service methods. “Now tie him up. I’ll keep him covered. He’s got a gun. Better relieve him of it. His game was to shoot you just as soon as your back was safely turned.” 192 Ashton Sanborn did as he was told, cheerfully, albeit wonderingly. How Bill could have gained his information and what he was up to now were as yet unsolved mysteries. He took away the man’s gun, a blue-nosed automatic. Then, carefully, he tied Lambert’s arms to the back of the chair and roped his legs securely. “Better lock the door,” was Bill’s next suggestion. “I’ll gag him.” The detective hurried to the door. There was no key in the lock. He clutched the handle—rattled it—pulled—The door did not budge. “What’s up, sir?” Bill’s voice betrayed his apprehension. “Locked!” “Then we’re in for it.” It was not so much the words as the way they were spoken that impressed the secret service man. “But—if it’s trouble, Bill, we must find a way out,” he said calmly. 193 “There is no way. They’re likely to come in on us through that door any minute now.” Bill’s voice was steady, but Sanborn knew he was attempting to conceal his strong excitement. “If the door’s locked on the outside, we’d better barricade it on the inside.” He looked round the room for a suitable means of fortification, and his eyes fell upon the huge Lambert. The man’s face was pale, almost haggard, and beads of sweat stood out upon his forehead. He was afraid. In spite of their potential danger, Sanborn smiled as the thought struck him. “Here, Bill, give me a hand.” Young Bolton immediately saw the possibility. Together the pair dragged the mutely protesting Lambert to the door, and planted him firmly in his chair against the panels. Over two hundred-weight of solid humanity—an effective barrier. “Now then, Bill. Where’s Osceola?” 194 “Outside the window. Or he was.” Bill’s voice was little more than a whisper. “We got here more than ten minutes before you drove up—legged it fast across the grounds, without running into a soul. The windows on this side of the house are too high to see into from the ground. Luckily Osceola spied a ladder leaning against an elm, on the way here, where some tree surgeon had left it, I guess. Anyway, it was just what we wanted, so we hiked over and toted it back. I climbed it and cut a hole in the glass just above the window-catch. I couldn’t see into the room because of the shade, but I could hear, all right. That big goop over there was talking with Professor Fanely. And by the way, there’s absolutely no doubt that old Fanely is the guy we’re after. His voice is the one I heard in the cupola. Osceola recognized it, too. Of course, when I got the piece of glass out of the window, they were in the midst of a conversation. I gathered that you’d been followed to New York today. Evidently they knew nothing about your conference, but the cabinet member was spotted going into the same office where you had been trailed. So, the old bird had figured out just about what did happen in New York. Take it from me, there are no flies on that old fellow! He guessed how you would be sure that he, Fanely, was the kidnapper from Deborah’s description, and how the lad from Washington would laugh at the idea. He even had the hunch that you would show up tonight! And while they were talking, Kolinski came in and said that a phone message had come through from the lodge, and that you were on the way up.” 195 “But I wonder how they guessed my identity?” “Your car license—Kolinski said so. Those things seem to be working for both sides in this business. Kolinski, the poor chap, was scared to death, apparently. The old man had it in for him because he made the initial mistake of dropping that silver cartwheel out of his car, and making it possible for the girls to identify him. But he was only in the room a couple of minutes. When he’d gone, the Professor said that as soon as you came they’d go upstairs. They planned that after Kolinski had ushered you in here, they’d put him out of the way. And the next move was for Lambert to come down here and do the same for you. Of course, old Fanely thought you’d come armed, so he cautioned the big guy to watch his step. If it hadn’t been for that,—well, I guess I’d have been too late.” Bill bit his lip. “I don’t see how the old buzzard imagined he could avoid government suspicion by doing you in, as well as Kolinski—Well, that’s about all of it. When you rang the bell, they went out of here, so I unfastened the window catch and hopped in.” 196 “Good work, Bill. You’re the sort of a chap a man needs on a job like this—” Bill grinned and shook his head. “I’m all right as far as I go, but I guess—“ he motioned toward the barricaded door—“I just didn’t go far enough. But Osceola’s outside somewhere, I thought he’d better stay on watch. So maybe—” 197 There was a knock on the door. They looked at each other and waited. “Well, Lambert? Is the dear Mister Ashton Sanborn, alias Davis—er—non compos—I mean hors de combat?” A pause. “So, my dear Lambert, you have failed, eh?” A fierce menace in the words now. The bound man’s face turned a sickly gray, and Sanborn felt a momentary pity for him. Then they heard whispered instructions outside the door, and the sound of running feet. Sanborn tried a bluff. “Hi! you!—there’s a posse of police surrounding the house!” A cackling laugh that ended in a snarl. “Yes, I saw him go!” 198 “So he got away all right? Thanks very much. He should be back by this time, with about thirty others.” Sanborn listened intently in an effort to ascertain whether or not his shot had gone home. Then—“They are only awaiting my signal.” “Then why not signal, my dear Sanborn?” A second later a shot rang out. Simultaneously a round hole, splintered at the edges, appeared in the upper panel of the door, and a bullet whistled past the detective and buried itself in the opposite wall. The hole in the panel was about two inches above Lambert’s head, and with protruding eyes the wretched man endeavored to shrink into the chair. Bill and Sanborn dropped to all fours and were making for the window, when a second shot was fired. This time it came from outside the house and shattered the lower window sash. Both the detective and young Bolton went flat on the floor. Sanborn beckoned to Bill to move closer. As the lad wriggled over the carpet toward him, the older man spoke to him in a low whisper. 199 “Sorry I got you into this. When they rush the place, start firing. We may be able to fight our way out—one of us, anyway.” “Maybe—but—too bad we’re a good four miles from town. If Osceola got away to telephone the police, it’s going to be a near thing before they get here. But all I want is to get one shot at old Fanely!” As if in reply to his name, the high, wheezing voice spoke again from beyond the door. “You gentlemen in there,” and they heard a horrible chuckle, “will be interested to know that your friend Chief Osceola ran foul of my men, after all. He is now taking a well-earned rest in the lodge. Good night, my dear gentlemen. Pleasant dreams, and may you awake—in heaven!” As if to place a period on this unanswered monologue, another shot splintered through the door panels.","sourceLink":"http://novel.tingroom.com/duanpian/2718/74745.html","bookId":1423,"book":{"id":1423,"title":"Bill Bolton and the Winged Cartwheels","description":"简介： You and I, Bill, said Osceola, are on top of the world and throwing rocks at rainbows! The young Seminole chief, stooping quickly, picked something out of the short grass at the side of the Bolton driveway. A couple of months ago I was a slave in a c...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2718","creation":"Aug 1, 2019 12:25:03 AM","modification":"Aug 1, 2019 12:25:03 AM"}}
