{"id":85071,"no":29,"title":"Page 29","content":"She looks at me doubtfully. “So you paid thousands of dollars of his taxes so that you wouldn’t have to get used to another supervisor? Whatever, Dominic. You can say what you want, but I don’t believe you. You helped him because you wanted to. Because you can see that he’s a decent person and you wanted to help him out. Why can’t you admit that? Why do insist on acting like such an ass?”\\n\\n I shake my head. “Because I am an ass. You need to get used to the idea, Jacey. I’m not going to change.”\\n\\n “Whatever,” she says dismissively, getting to her feet. “I don’t buy it. But I’m tired of talking about it.”\\n\\n She stomps off and I sit for a second, trying to decide whether to go after her or not, when she comes stomping back.\\n\\n “And another thing,” she says before she stops, her eyes widening. She freezes in place, staring at me.\\n\\n “What?” I ask in confusion. “Why are you looking at me like that?”\\n\\n “Don’t move,” she says quietly, looking at something past my shoulder as she takes a tentative step toward me. “Don’t move a muscle, Dom.”\\n\\n That’s when I hear it. An unmistakable rustle of something big behind me. The hairs lift up on the back of my neck and I stare calmly at Jacey.\\n\\n “What is it? Bear?”\\n\\n She shakes her head and the color drains from her face. “Mountain lion. I think. It’s a huge tan cat with really big teeth. It’s just sitting there staring at me, about five feet behind you. What do we do?”\\n\\n I try to think, while at the same time I mentally distance myself from the situation so that I can stay calm. “I don’t think we play dead. That’s for a bear. I’m pretty sure we’re supposed to act intimidating.”\\n\\n “How the hell do we do that?” Jacey hisses, her eyes frozen on the animal behind me. “It’s pretty intimidating itself.”\\n\\n “Well, first, we can’t run,” I tell her as I calmly pivot and slowly look behind me. But when I see the cat, the first thing I want to do is run.\\n\\n To say it’s intimidating is the biggest understatement I’ve heard in a while.\\n\\n The massive cat must weigh as much as I do, and its fangs glisten in the dying sunlight. It stares back at me with golden eyes and it looks almost bored. But then it growls, ever so slightly, enough to let me know that it’s far from bored, enough to send shivers down my spine. It’s very interested in us, even though it remains motionless.\\n\\n “We can’t run, or it will think we’re prey,” I tell Jacey quietly. I take a slow step back, and it growls louder, its golden eyes watching my every movement, tracking me.\\n\\n “Fuck,” I mutter under my breath. “Jacey, go. Walk away slowly and I’ll stay right here. I’ll figure something out.”\\n\\n “Like hell,” Jacey answers snappishly. She waves her arms. “Get out of here, you fucking animal! Go!” Her shouts only seem to amuse the cat and it stares at her with even more interest, its long tail flicking in the air. It moves one large paw, planting it in the red dirt. I suck in a breath.\\n\\n “Jacey, I don’t think that’s helping,” I point out. “It thinks you’re an appetizer.”\\n\\n My heart is pounding by this point, because honestly, for the first time in as long as I remember, I don’t know what to do. All I know is I don’t want to meet my end at the end of those pointy teeth.\\n\\n Jacey shouts louder, and the cat growls menacingly as she bends to pick up a large round rock, a foot in diameter. The cat opens its mouth and roars, a shrill and hoarse sound like a scream. Jacey freezes, and what happens next happens so fast that it’s a blur.\\n\\n The cat roars again, standing up on its hind legs and batting at the air with its paw before it lunges toward me.\\n\\n Jacey shrieks and jumps in front of me, hurling the rock at the giant animal, hitting it squarely in the face. But as she throws it, she trips and sprawls in the red dust directly in front of the giant cat.\\n\\n She’s entirely at its mercy.\\n\\n For a second, my heart stops. I move to shield Jacey from an attack, but the cat turns, shaking its head, as if to clear it from the impact of the rock. It stumbles for a second, then to my surprise, it spins around and retreats, loping off into the distance.\\n\\n I’m frozen for a moment before I scramble to get to Jacey.\\n\\n “What the hell?” I demand. “You could’ve been killed. You don’t go rushing at a wild animal like that!”\\n\\n Jacey stares up at me, her eyes wide and filled with pain. “I didn’t mean to. I tripped. But either way, it worked. The fucking thing is gone, isn’t it?”\\n\\n “What’s wrong?” I ask her quickly. Her eyes are watering and she’s gripping her ankle like she’s never letting go.\\n\\n “My foot,” she says through gritted teeth. “I twisted it. How cliché is that?”\\n\\n Adrenaline is coursing through me and I swallow the acidic taste.\\n\\n “Jacey, you could’ve died. The chopper isn’t coming back for us for another hour. If that thing would’ve attacked you, we might not have made it to a hospital in time. Why the fuck did you do that?”\\n\\n She opens her eyes and shrugs, determined to make it seem like a small deal. “Because it was going to jump on you. It was the only plan I could think of.”\\n\\n “Your plan sucked,” I growl as I grab her up and haul her onto my lap, lifting her foot to examine it. As carefully as I can, I pull her sneaker off. Her foot is already swollen, and it’s turning purple fast.\\n\\n “I don’t know if it’s broken,” I tell her quietly. “It might be. Or it could just be bruised. Either way, it’s going to hurt.”\\n\\n “Going to?” she grimaces, gritting her teeth. “I don’t think I can walk on it.”\\n\\n “I’m sure you can’t.” I eye it. “There’s no way. We’ll just stay right here until our ride comes back. You’ll have to see the Grand Canyon from here. I’m sorry.”\\n\\n “I’m not worried about it,” she answers, nestling back into my arms, molding herself to my chest. “I just hope he doesn’t come back. Oh my god. He sounded like a woman screaming, didn’t he? Holy shit. I’ll never forget that sound.”\\n\\n “Me either,” I admit, looking around. “I don’t see any more lurking around. You scared the shit out of that one. I doubt he’ll be back.” I glance down at her swollen foot and wince. “I wish I’d thought to bring some ibuprofen or something. I’m sorry. God. This is the second time you’ve been hurt because of me.”\\n\\n Something akin to guilt wells up in me, but she shrugs, curling up on my lap. It’s been awhile since someone has lain there for a reason other than sucking my dick. I try not to think about that as I wrap my arms around her and keep her close.\\n\\n She just risked her life for me.\\n\\n I don’t know anyone, other than my parents or Sin or maybe Duncan, who would do that for me. It’s mind-blowing, actually.\\n\\n When the helicopter arrives an hour later, I realize something else startling. I’ve been holding her hand this entire time and I didn’t even know it.\\n\\n Chapter Twenty\\n\\n Jacey\\n\\n My foot throbs like bloody hell as I curl up once again on Dominic’s veranda and soak in the moonlight. Since I can’t move from my seat, I make sure to enjoy the scenery, which consists of Dominic’s perfect ass and chiseled abs. I’ve been staring at both things off and on for the last hour.\\n\\n “Thank you for having a doctor come by,” I tell him once again. “I didn’t even know doctors made house calls anymore.”\\n\\n “People will do anything if you pay them enough,” Dominic answers tiredly, bringing a tray of food through the glass doors. “He’s the doctor we use on set. I’m just glad your ankle isn’t broken.”\\n\\n “Nope,” I reply as cheerfully as I can. “Just bruised. I’ll be good as new in a week or so.”\\n\\n Dominic rolls his eyes. “Are you always this cheerful?”\\n\\n I shake my head. “Hell no. Try waking me up before nine A.M. and you’ll see a whole new level of ugly.”\\n\\n He chuckles, settling back into the cushions. “Do you want to go to bed? You must be tired.”\\n\\n I shake my head. “The pain meds your guy gave me are making me a little sleepy, but I’m sort of too amped up to rest. Can we just talk for a while?”\\n\\n Dominic looks pained. “Oh yeah. My favorite thing to do.”\\n\\n The way he says it makes me laugh and Dominic smiles. “So glad to be a source of amusement to you.”\\n\\n I smile again as the warm breeze lifts the hair away from my face. “Can you help me into the pool? It was so hot and dry out in the canyon that I’d like to get wet.”\\n\\n I left myself wide open for a sexual jab by Dominic, but he ignores it.\\n\\n “Are you sure?” He raises an eyebrow. “The doctor said you should rest your foot.”\\n\\n I shake my head. “He also said it wasn’t broken. Trust me, I’ve got enough pain meds in me to put out a small horse. I’m feeling no pain.” To prove my point, I stand up awkwardly, swaying a bit before I catch my balance. I strip off my shirt, then sit back down to take off my shorts.\\n\\n Dominic doesn’t say anything… he just sits back and watches me, his eyes darkening as I strip off my bra. There’s a million things hidden in his eyes right now, but he doesn’t voice any of them. Instead, he just stands up and gently grabs my arm.\\n\\n “Ready?”\\n\\n I nod, expecting him to help me hobble into the water, but that’s not what he does. Instead, he scoops me up and carries me directly into the pool, pausing only for a second to kick his shoes off at the edge.\\n\\n Other than that, he’s fully clothed.\\n\\n He carries me straight into the water, completely soaking his clothes. I stare at him in shock. “Why didn’t you undress?”\\n\\n He stares down at me, his dark gaze meeting mine. “Jacey, you jumped in front of a cougar for me today. If you say you want to swim, I’m going to drop what I’m doing and carry you into the water.”\\n\\n A weird feeling ripples through me, warm and tingly.\\n\\n “Seriously? That’s all I had to do to impress you? I just had to jump in front of a hungry wild animal? Why didn’t you tell me? I would’ve done it a long time ago.”\\n\\n He throws his head back and laughs, a genuine laugh and his teeth gleam in the dark. He tightens his grip on me for a second, then he lowers me carefully into the water, holding me up as I gingerly set my foot down, then pick it back up and tread water.\\n\\n “Who says you impressed me?” he asks mockingly, treading water in front of me. “I’m only admitting that I owe you. I pay my debts.”\\n\\n I roll my eyes now. “Whatever. I know you’re impressed. And what’s more, you like me. You just don’t want to admit it. You don’t want to admit that I’m a decent person… because you think that the world is only made up of assholes. To admit that I’m not horrible would mess up your deep-seated belief system. I wouldn’t want to do that.”\\n\\n Dom cocks his head, studying me in the night. “I thought you said you weren’t decent?” \\n\\n","sourceLink":"https://allnovel.net/before-we-fall-beautifully-broken-3/page-29.html","bookId":2761,"book":{"id":2761,"title":"Before We Fall (Beautifully Broken #3)","description":"Storyline: Before We Fall (Beautifully Broken #3) \\n Sometimes, one dark moment is all it takes to turn your world black... \\n For 24-year old Dominic Kinkaide, that moment took place on the night of his high school graduation. One dark incident changed him forever. He\u0027s a hardened actor now, famous in the eyes of the world, but tortured in his own. He doesn\u0027t care about much of anything, except for losing himself in the roles that he plays. \\n 23-year old Jacey Vincent doesn\u0027t realize how much her father\u0027s indifference has affected her. She is proof that sometimes it isn\u0027t one specific moment that wrecks a person, but rather it\u0027s an absence of moments. She\u0027s like a bird with a broken wing-strong yet fragile, as she tries to float through life, finding acceptance in the arms of random guys, one after the other... to fill the void that her father left in her. \\n Until she meets Dominic. \\n After jaded Dominic and strong-willed Jacey are thrown together, his secret and her issues create a dark and damaged energy that will soon turn their attraction to each other into an explosive storm. \\n Even though when the clouds have cleared and the dust has settled, both of them are almost obliterated... they\u0027ve learned a priceless lesson. \\n Sometimes, before we fall... we fly.\\n","cover":"https://allnovel.net/images/before-we-fall-beautifully-broken-3.jpg","author":"Courtney Cole","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/before-we-fall-beautifully-broken-3.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 5:04:05 PM"}}
