{"id":85088,"no":46,"title":"Page 46","content":"She kisses me back, angrily, her teeth scraping against mine.\\n\\n “Fine. You need me to vent? Vent to me, Dom. Go ahead. Do it. Vent in me if you need to. I can take it.”\\n\\n Her dark eyes hold a challenge, and suddenly she’s angry too.\\n\\n “You use this darkness, this roughness as a mask, Dom,” she tells me, her brown eyes snapping. “For years, you’ve lingered on the edge of taboo, doing things that most people don’t because that’s what you think you deserve. You confused it for being something you actually like.”\\n\\n “Oh, I like it,” I tell her firmly, pulling her to me roughly and nipping at her neck. There’s a red mark where my teeth were. “Make no mistake about that. I like being rough. I like the pain, Jacey.”\\n\\n I pick her up and shove her against the wall, thrusting my hips into hers as I pin here there, staring into her eyes. “Trust me, I do it because I want to. Not because I’m confused.”\\n\\n I lift her thighs and slam her into the wall again, not too hard, but hard enough to prove my point. My dick is rock hard now, fueled by anger and the feeling of her pussy pressed against it.\\n\\n “You like the pain because it takes your mind off of what really hurts, Dominic,” Jacey says softly. “That’s what you like.”\\n\\n But she kisses me, and her mouth is soft and sweet and it tightens my groin, against my better judgment, against any good that’s left in me.\\n\\n “You don’t want to be with me right now,” I warn her. “Trust me.”\\n\\n Jacey looks me in the eye.\\n\\n “Don’t tell me what I want to do,” she commands softly. “If you can dish it, I can take it.”\\n\\n Fumbling with my jeans, I pull my dick out, shove her skirt up, and thrust into her hard, with no preamble, no foreplay. Her eyes widen, but she takes it without a whimper or a sigh.\\n\\n Pinning her against the wall, I hold her wrists above her head with one hand, squeezing them hard.\\n\\n “Still want to take it?” I growl into her mouth.\\n\\n She nods, her eyes surprisingly glazed over… with lust. “Fuck me,” she says breathlessly as I thrust into her over and over. “I can take it. I want to take it.”\\n\\n So I do.\\n\\n I fuck her hard, I fuck her into the wall, grinding her back into it, an outlet for my ugliness. But as I open my eyes finally, hers are staring into mine.\\n\\n And they’re brown. Not blue.\\n\\n She’s Jacey, not Emma.\\n\\n And all the rage that I’m feeling, it’s not directed at her. The pain that I’m feeling… it’s not because of her.\\n\\n I freeze as the revelation occurs to me. As I realize that she was right. I like pain because it’s an outlet for what I really feel. It’s a vent. And I’m not venting into Jacey.\\n\\n Sliding Jacey off the wall, I carry her to the bed.\\n\\n “I’m sorry,” I whisper to her urgently as I use my knee to open her legs. She lets them fall easily open, and I slide into her, gently this time. “I’m sorry, Jacey.”\\n\\n She closes her eyes and pulls me to her, letting my head rest in the crook of her shoulder. The energy of the room has changed from frenetic to soft, from rough to gentle.\\n\\n I come softly, silently, straining into her, holding her to me.\\n\\n I destroy everyone I touch.\\n\\n I can’t destroy her.\\n\\n Chapter Thirty-One\\n\\n Jacey\\n\\n Dominic might not want to admit it, but I felt his heart break with every movement.\\n\\n I’m quiet as I lie staring at him, and it’s a long time before he opens his eyes. When he does, there’s guilt in them.\\n\\n “I’m sorry,” he says simply. “I’m so sorry, Jacey. I was… angry. At the world, at Sin, at Emma, at you for being right. You were right. I get off on watching people have sex because I can do it without getting involved. I like sexual pain because it distracts me from what really causes me pain. And that’s not you. You don’t cause me pain. I have no right to hold you accountable for something you didn’t do. I’m sorry.”\\n\\n My heart squeezes. “I know,” I tell him softly. “I know.”\\n\\n And I do. I know what it’s like to be so overwhelmed by emotion that you can’t even think straight. I felt the same way the day Jared turned my world upside down.\\n\\n I curl into Dominic’s side and he holds me there, clutched to him.\\n\\n “Where do you think she is?” he muses aloud after a while, staring out the window. “I worry about that sometimes.”\\n\\n I stroke his arm and I know he’s talking about Emma.\\n\\n “I don’t know. I’ve wondered that about the people I love. I like to think that they’re in a better place. That they’re somewhere where tears and pain don’t exist anymore.”\\n\\n “Then they’re in a better place than we are,” Dominic says tiredly.\\n\\n “We can hope,” I answer. “Death is going to come to us all, Dom. It’s up to us how we handle it. It’s hard, I know.”\\n\\n He remains silent, and I grab his hand. He lets me, but I can see his heart’s not in it. His fingers are cold, his eyes are blank.\\n\\n After a few more minutes I turn to him, desperate to make him understand that there’s hope. After having such angry sex, I thought he might feel somewhat better, that it had been an outlet for his rage. And it had been.\\n\\n But now he only seems hopeless.\\n\\n “Dominic, I know you’re pissed at the world. But we’ll get past this. You’ll see that you can trust the people you love. Sometimes they make bad decisions, but we all do. It’s human nature. We’ll get past this.”\\n\\n “Cris knew this the whole fucking time,” Dom answers, staring at me with a black stare. “He could’ve told me years ago. Even though I didn’t want to talk to him, he could’ve figured out a way.”\\n\\n I nod. “I know. He didn’t handle it well. But he feels terrible too. He didn’t know what to do. And he handled it badly. Just like you did. He loved you and Sin both so much that he sacrificed his relationship with you to save your relationship with Sin. I think that says a lot. And if it makes you feel any better, he and Fiona broke up. She was pissed that he didn’t tell someone.”\\n\\n Dominic nods, turning to face the window, turning away from me. I have a feeling that the emotions of the day are just too overwhelming for him to take right now.\\n\\n I understand how that feels. I feel the same way.\\n\\n I wrap my arms around him and press my face to his back, letting my weary eyes close as the weight of the world seems to rest on my eyelids.\\n\\n The silence grows and grows, until eventually Dominic falls asleep. I stay with him for the longest time, holding him tightly. If anyone deserves the oblivion that sleeps brings, he does.\\n\\n He only wakes once, after I have Chinese delivered. He stays awake long enough to eat with me and then he suggests that I sleep in the guest room so that I can get some rest.\\n\\n “I’ll be tossing and turning,” he says wryly. “You’ve already been patient enough with me today. You deserve a break.”\\n\\n I don’t want a break, but I don’t argue.\\n\\n Dominic slips back into the darkened master suite and I close the door to the guest room. If he wants to be alone, I’ll let him be alone.\\n\\n Whatever it takes for him to process this.\\n\\n Chapter Thirty-Two\\n\\n Dominic\\n\\n I try to sleep alone.\\n\\n But strangely, after years of seeking out solitude, it’s the last thing I want now.\\n\\n And I don’t just want anyone… I want Jacey.\\n\\n I look at the clock. Two seventeen A.M. I squeeze my tired eyes closed, then open them again, throwing the covers back as I get out of bed. I pad down to Jacey’s room.\\n\\n She’s sleeping peacefully, her hand curled under her chin. Her eyelids flutter when I climb in beside her, and she turns into me when I wrap my arms around her.\\n\\n Her warmth envelops me, soaking into the cold that has surrounded me for so long.\\n\\n “Thank you for being so good to me,” I whisper to her. For the life of me, I can’t figure out why she would be. I haven’t done anything to deserve it.\\n\\n She sighs sleepily, not answering. Her hands flutter across my chest and down to my waist. It’s answer enough, and just like that, because of the brush of her fingertips, I want her.\\n\\n She lifts her hips and I pull off her underwear. Her mouth meets mine sleepily, hotly. And I slip into her.\\n\\n Her warmth surrounds me and I groan, throwing my head back and losing myself in the sensations… in her.\\n\\n I feel her hands on my back, her fingernails. I hear her moans, her breath. I feel the world exploding, then I fall limply onto her, rolling over so I don’t hurt her.\\n\\n Then we sleep.\\n\\n When I wake, sunshine is pouring into the bedroom, and I blearily look around, trying to see what woke me. My phone buzzes again.\\n\\n My phone.\\n\\n I pick it up and focus on it, finding a text from Sin.\\n\\n You’re my brother and there’s nothing more important than that. I love you. I’ll love you forever. I’m sorry I fucked up.\\n\\n I put the phone back down and close my eyes.\\n\\n Chapter Thirty-Three\\n\\n Jacey\\n\\n I get off the phone with Joe, smiling as I think about how badass he always tries to act, but how soft his heart actually is.\\n\\n I’d explained the situation, in very vague terms, and said that we wouldn’t be back to work until Monday. He was perfectly fine with that. We won’t be in trouble. That’s a relief, because that’s the last thing we need on top of everything else.\\n\\n I tiptoe back into the bedroom and stare at Dom.\\n\\n In sleep, he’s peaceful. Nothing can hurt him when he sleeps, and that’s the reason I’ve let him sleep for two straight days. It’s almost as if his body needed it to absorb the emotional shock that it’s undergone the last few days.\\n\\n At night, I climb into bed and he wraps his arms around me, holding me close. During the day I get up, but I check in on him from time to time. He’s woken up a couple of times for water, but nothing else.\\n\\n As I stand over him, I feel the intense need to protect him from anything else that might hurt him.\\n\\n That’s why when Sin shows up on the doorstep a couple hours later, I’m hesitant to let him in.\\n\\n “I know you’re sorry,” I tell him hesitantly. “I know. But he’s messed up, Sin. He’s been sleeping for two days. I don’t think he’s in a place where he’s ready to talk to you.”\\n\\n Sin stares at me with his doleful rocker stare. “You know, I was right when I told you that you were good for Dominic. Wasn’t I?”\\n\\n I swallow. “Yeah. And if it were up to me, I’d invite you in and you could talk to Dom. But…”\\n\\n “It’s all right.” Dominic’s voice comes from behind me. “Let him in.”\\n\\n I turn around to find Dom sitting on the bottom step, staring at his brother. His hair is mussed, but other than that, you’d never guess he’d just slept for two days.\\n\\n “Are you okay?” I ask softly. He glances at me, and there’s something so potent in his eyes… something powerful and shining.\\n\\n He loves me. He hasn’t said it, but I know it’s true. I swallow as he nods.\\n\\n “Yeah, I’m fine, babe.” He glances at his brother. “I ignored your texts for a reason, Sin. I didn’t want to talk to you.” \\n\\n","sourceLink":"https://allnovel.net/before-we-fall-beautifully-broken-3/page-46.html","bookId":2761,"book":{"id":2761,"title":"Before We Fall (Beautifully Broken #3)","description":"Storyline: Before We Fall (Beautifully Broken #3) \\n Sometimes, one dark moment is all it takes to turn your world black... \\n For 24-year old Dominic Kinkaide, that moment took place on the night of his high school graduation. One dark incident changed him forever. He\u0027s a hardened actor now, famous in the eyes of the world, but tortured in his own. He doesn\u0027t care about much of anything, except for losing himself in the roles that he plays. \\n 23-year old Jacey Vincent doesn\u0027t realize how much her father\u0027s indifference has affected her. She is proof that sometimes it isn\u0027t one specific moment that wrecks a person, but rather it\u0027s an absence of moments. She\u0027s like a bird with a broken wing-strong yet fragile, as she tries to float through life, finding acceptance in the arms of random guys, one after the other... to fill the void that her father left in her. \\n Until she meets Dominic. \\n After jaded Dominic and strong-willed Jacey are thrown together, his secret and her issues create a dark and damaged energy that will soon turn their attraction to each other into an explosive storm. \\n Even though when the clouds have cleared and the dust has settled, both of them are almost obliterated... they\u0027ve learned a priceless lesson. \\n Sometimes, before we fall... we fly.\\n","cover":"https://allnovel.net/images/before-we-fall-beautifully-broken-3.jpg","author":"Courtney Cole","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/before-we-fall-beautifully-broken-3.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 5:04:05 PM"}}
