{"id":90292,"no":13,"title":"Page 13","content":"Holding the heavy gun, Will swept his hand sideways and knocked the golden monkey off his perch, stunning him so that Mrs. Coulter groaned aloud and the monkey\u0027s paw relaxed enough to let the tiny woman struggle free.\n In a moment she leapt up to the rocks, and the man sprang away from Mrs. Coulter, both of them moving as quickly as grasshoppers. The three children had no time to be astonished. The man was concerned: he felt his companion\u0027s shoulder and arm tenderly, and embraced her swiftly before calling to Will.\n \"You! Boy!\" he said, and although his voice was small in volume, it was as deep as a grown man\u0027s. \"Have you got the knife?\"\n \"Of course I have,\" said Will. If they didn\u0027t know it was broken, he wasn\u0027t going to tell them.\n \"You and the girl will have to follow us. Who is the other child?\"\n \"Ama, from the village,\" said Will.\n \"Tell her to return there. Move now, before the Swiss come.\"\n Will didn\u0027t hesitate. Whatever these two intended, he and Lyra could still get away through the window he\u0027d opened behind the bush on the path below.\n So he helped her up and watched curiously as the two small figures leapt on - what? Birds? No, dragonflies, as large as seagulls, which had been waiting in the darkness. Then they darted forward to the cave mouth, where Mrs. Coulter lay. She was half-stunned with pain and drowsy from the Chevalier\u0027s sting, but she reached up as they went past her, and cried:\n \"Lyra! Lyra, my daughter, my dear one! Lyra, don\u0027t go! Don\u0027t go!\"\n Lyra looked down at her, anguished; but then she stepped over her mother\u0027s body and loosened Mrs. Coulter\u0027s feeble clutch from her ankle. The woman was sobbing now; Will saw the tears glistening on her cheeks.\n Crouching just beside the cave mouth, the three children waited until there was a brief pause in the shooting, and then followed the dragonflies as they darted down the path. The light had changed: as well as the cold anbaric gleam from the zeppelins\u0027 floodlights, there was the leaping orange of flames.\n Will looked back once. In the glare Mrs. Coulter\u0027s face was a mask of tragic passion, and her daemon clung piteously to her as she knelt and held out her arms, crying:\n \"Lyra! Lyra, my love! My heart\u0027s treasure, my little child, my only one! Oh, Lyra, Lyra, don\u0027t go, don\u0027t leave me! My darling daughter - you\u0027re tearing my heart - \"\n And a great and furious sob shook Lyra herself, for, after all, Mrs. Coulter was the only mother she would ever have, and Will saw a cascade of tears run down the girl\u0027s cheeks.\n But he had to be ruthless. He pulled at Lyra\u0027s hand, and as the dragonfly rider darted close to his head, urging them to hurry, he led her at a crouching run down the path and away from the cave. In Will\u0027s left hand, bleeding again from the blow he\u0027d landed on the monkey, was Mrs. Coulter\u0027s pistol.\n \"Make for the top of the cliff,\" said the dragonfly rider, \"and give yourself up to the Africans. They\u0027re your best hope.\"\n Mindful of those sharp spurs, Will said nothing, though he hadn\u0027t the least intention of obeying. There was only one place he was making for, and that was the window behind the bush; so he kept his head low and ran fast, and Lyra and Ama ran behind him.\n \"Halt!\"\n There was a man, three men, blocking the path ahead - uniformed - white men with crossbows and snarling wolf-dog daemons - the Swiss Guard.\n \"Iorek!\" cried Will at once. \"Iorek Byrnison!\" He could hear the bear crashing and snarling not far away, and hear the screams and cries of the soldiers unlucky enough to meet him.\n But someone else came from nowhere to help them: Balthamos, in a blur of desperation, hurled himself between the children and the soldiers. The men fell back, amazed, as this apparition shimmered into being in front of them.\n But they were trained warriors, and a moment later their daemons leapt at the angel, savage teeth flashing white in the gloom - and Balthamos flinched: he cried out in fear and shame, and shrank back. Then he sprang upward, beating his wings hard. Will watched in dismay as the figure of his guide and friend soared up to vanish out of sight among the treetops.\n Lyra was following it all with still-dazed eyes. It had taken no more than two or three seconds, but it was enough for the Swiss to regroup, and now their leader was raising his crossbow, and Will had no choice: he swung up the pistol and clamped his right hand to the butt and pulled the trigger, and the blast shook his bones, but the bullet found the man\u0027s heart.\n The soldier fell back as if he\u0027d been kicked by a horse. Simultaneously the two little spies launched themselves at the other two, leaping from the dragonflies at their victims before Will could blink. The woman found a neck, the man a wrist, and each made a quick backward stab with a heel. A choking, anguished gasp, and the two Swiss died, their daemons vanishing in mid-howl.\n Will leapt over the bodies, and Lyra went with him, running hard and fast with Pantalaimon racing wildcat-formed at their heels. Where\u0027s Ama? Will thought, and he saw her in the same moment dodging down a different path. Now she\u0027ll be safe, he thought, and a second later he saw the pale gleam of the window deep behind the bushes. He seized Lyra\u0027s arm and pulled her toward it. Their faces were scratched, their clothes were snagged, their ankles twisted on roots and rocks, but they found the window and tumbled through, into the other world, onto the bone-white rocks under the glaring moon, where only the scraping of the insects broke the immense silence.\n And the first thing Will did was to hold his stomach and retch, heaving and heaving with a mortal horror. That was two men now that he\u0027d killed, not to mention the youth in the Tower of the Angels... Will did not want this. His body revolted at what his instinct had made him do, and the result was a dry, sour, agonizing spell of kneeling and vomiting until his stomach and his heart were empty.\n Lyra watched helpless nearby, nursing Pan, rocking him against her breast.\n Will finally recovered a little and looked around. And at once he saw that they weren\u0027t alone in this world, because the little spies were there, too, with their packs laid on the ground nearby. Their dragonflies were skimming over the rocks, snapping up moths. The man was massaging the shoulder of the woman, and both of them looked at the children sternly. Their eyes were so bright and their features so distinct that there was no doubt about their feelings, and Will knew they were a formidable pair, whoever they were.\n He said to Lyra, \"The alethiometer\u0027s in my rucksack, there.\"\n \"Oh, Will - I did so hope you\u0027d find it - whatever happened. Did you find your father? And my dream, Will - it\u0027s too much to believe, what we got to do, oh, I daren\u0027t even think of it... And it\u0027s safe! You brung it all this way safe for me...\"\n The words tumbled out of her so urgently that even she didn\u0027t expect answers. She turned the alethiometer over and over, her fingers stroking the heavy gold and the smooth crystal and the knurled wheels they knew so well.\n Will thought: It\u0027ll tell us how to mend the knife!\n But he said first, \"Are you all right? Are you hungry or thirsty?\"\n \"I dunno... yeah. But not too much. Anyway - \"\n \"We should move away from this window,\" Will said, \"just in case they find it and come through.\"\n \"Yes, that\u0027s true,\" she said, and they moved up the slope, Will carrying his rucksack and Lyra happily carrying the little bag she kept the alethiometer in. Out of the corner of his eye, Will saw the two small spies following, but they kept their distance and made no threat.\n Over the brow of the rise there was a ledge of rock that offered a narrow shelter, and they sat beneath it, having carefully checked it for snakes, and shared some dried fruit and some water from Will\u0027s bottle.\n Will said quietly, \"The knife\u0027s broken. I don\u0027t know how it happened. Mrs. Coulter did something, or said something, and I thought of my mother and that made the knife twist, or catch, or - I don\u0027t know what happened. But we\u0027re stuck till we can get it mended. I didn\u0027t want those two little people to know, because while they think I can still use it, I\u0027ve got the upper hand. I thought you could ask the alethiometer, maybe, and - \"\n \"Yeah!\" she said at once. \"Yeah, I will.\"\n She had the golden instrument out in a moment and moved into the moonlight so she could see the dial clearly. Looping back the hair behind her ears, just as Will had seen her mother do, she began to turn the wheels in the old familiar way, and Pantalaimon, mouse-formed now, sat on her knee.\n She had hardly started before she gave a little gasp of excitement, and she looked up at Will with shining eyes as the needle swung. But it hadn\u0027t finished yet, and she looked back, frowning, until the instrument fell still.\n She put it away, saying, \"Iorek? Is he nearby, Will? I thought I heard you call him, but then I thought I was just wishing. Is he really?\"\n \"Yes. Could he mend the knife? Is that what the alethiometer said?\"\n \"Oh, he can do anything with metal, Will! Not only armor - he can make little delicate things as well...\" She told him about the small tin box Iorek had made for her to shut the spy-fly in. \"But where is he?\"\n \"Close by. He would have come when I called, but obviously he was fighting... And Balthamos! Oh, he must have been so frightened...\"\n \"Who?\"\n He explained briefly, feeling his cheeks warm with the shame that the angel must be feeling.\n \"But I\u0027ll tell you more about him later,\" he said. \"It\u0027s so strange... He told me so many things, and I think I understand them, too...\" He ran his hands through his hair and rubbed his eyes.\n \"You got to tell me everything,\" she said firmly. \"Everything you did since she caught me. Oh, Will, you en\u0027t still bleeding? Your poor hand...\"\n \"No. My father cured it. I just opened it up when I hit the golden monkey, but it\u0027s better now. He gave me some ointment that he\u0027d made - \"\n \"You found your father?\"\n \"That\u0027s right, on the mountain, that night...\"\n He let her clean his wound and put on some fresh ointment from the little horn box while he told her some of what had happened: the fight with the stranger, the revelation that came to them both a second before the witch\u0027s arrow struck home, his meeting with the angels, his journey to the cave, and his meeting with Iorek.\n \"All that happening, and I was asleep,\" she marveled. \"D\u0027you know, I think she was kind to me, Will - I think she was, I don\u0027t think she ever wanted to hurt me... She did such bad things, but...\"\n She rubbed her eyes.\n \"Oh, but my dream, Will, I can\u0027t tell you how strange it was! It was like when I read the alethiometer, all that clearness and understanding going so deep you can\u0027t see the bottom, but clear all the way down.\n \"It was... Remember I told you about my friend Roger, and how the Gobblers caught him and I tried to rescue him, and it went wrong and Lord Asriel killed him?\n \"Well, I saw him. In my dream I saw him again, only he was dead, he was a ghost, and he was, like, beckoning to me, calling to me, only I couldn\u0027t hear. He didn\u0027t want me to be dead, it wasn\u0027t that. He wanted to speak to me.\n \"And... It was me that took him there, to Svalbard, where he got killed, it was my fault he was dead. And I thought back to when we used to play in Jordan College, Roger and me, on the roof, all through the town, in the markets and by the river and down the Claybeds... Me and Roger and all the others... And I went to Bolvangar to fetch him safe home, only I made it worse, and if I don\u0027t say sorry, it\u0027ll all be no good, just a huge waste of time. I got to do that, you see, Will. I got to go down into the land of the dead and find him, and... and say sorry. I don\u0027t care what happens after that. Then we can... I can... It doesn\u0027t matter after that.\"\n Will said, \"This place where the dead are. Is it a world like this one, like mine or yours or any of the others? Is it a world I could get to with the knife?\"\n She looked at him, struck by the idea.\n \"You could ask,\" he went on. \"Do it now. Ask where it is, and how we get there.\"\n She bent over the alethiometer and her fingers moved swiftly. A minute later she had the answer.\n \"Yes,\" she said, \"but it\u0027s a strange place, Will... So strange... Could we really do that? Could we really go to the land of the dead? But - what part of us does that? Because daemons fade away when we die - I\u0027ve seen them - and our bodies, well, they just stay in the grave and decay, don\u0027t they?\"\n \"Then there must be a third part. A different part.\"\n \"You know,\" she said, full of excitement, \"I think that must be true! Because I can think about my body and I can think about my daemon - so there must be another part, to do the thinking!\"\n \"Yes. And that\u0027s the ghost.\"\n Lyra\u0027s eyes blazed. She said, \"Maybe we could get Roger\u0027s ghost out. Maybe we could rescue him.\"\n \"Maybe. We could try.\"\n \"Yeah, we\u0027ll do it!\" she said at once. \"We\u0027ll go together! That\u0027s exactly what we\u0027ll do!\"\n But if they didn\u0027t get the knife mended, Will thought, they\u0027d be able to do nothing at all.\n As soon as his head cleared and his stomach felt calmer, he sat up and called to the little spies. They were busy with some minute apparatus nearby.\n \"Who are you?\" he said. \"And whose side are you on?\"\n The man finished what he was doing and shut a wooden box, like a violin case no longer than a walnut. The woman spoke first.\n \"We are Gallivespian,\" she said. \"I am the Lady Salmakia, and my companion is the Chevalier Tialys. We are spies for Lord Asriel.\"\n She was standing on a rock three or four paces away from Will and Lyra, distinct and brilliant in the moonlight. Her little voice was perfectly clear and low, her expression confident. She wore a loose skirt of some silver material and a sleeveless top of green, and her spurred feet were bare, like the man\u0027s. His costume was similarly colored, but his sleeves were long and his wide trousers reached to midcalf. Both of them looked strong, capable, ruthless, and proud.\n \"What world do you come from?\" said Lyra. \"I never seen people like you before.\"\n \"Our world has the same problems as yours,\" said Tialys. \"We are outlaws. Our leader, Lord Roke, heard of Lord Asriel\u0027s revolt and pledged our support.\"\n \"And what did you want to do with me?\"\n \"To take you to your father,\" said the Lady Salmakia. \"Lord Asriel sent a force under King Ogunwe to rescue you and the boy and bring you both to his fortress. We are here to help.\"\n \"Ah, but suppose I don\u0027t want to go to my father? Suppose I don\u0027t trust him?\"\n \"I\u0027m sorry to hear that,\" she said, \"but those are our orders: to take you to him.\"\n Lyra couldn\u0027t help it: she laughed out loud at the notion of these tiny people making her do anything. But it was a mistake. Moving suddenly, the woman seized Pantalaimon, and holding his mouse body in a fierce grip, she touched the tip of a spur to his leg. Lyra gasped: it was like the shock when the men at Bolvangar had seized him. No one should touch someone else\u0027s daemon - it was a violation.\n But then she saw that Will had swept up the man in his right hand, holding him tightly around the legs so he couldn\u0027t use his spurs, and was holding him high.\n \"Stalemate again,\" said the Lady calmly. \"Put the Chevalier down, boy.\"\n \"Let go of Lyra\u0027s daemon first,\" said Will. \"I\u0027m not in the mood to argue.\"\n Lyra saw with a cold thrill that Will was perfectly ready to dash the Gallivespian\u0027s head against the rock. And both little people knew it.\n Salmakia lifted her foot away from Pantalaimon\u0027s leg, and at once he fought free of her grasp and changed into a wildcat, hissing ferociously, fur on end, tail lashing. His bared teeth were a hand\u0027s breadth from the Lady\u0027s face, and she gazed at him with perfect composure. After a moment he turned and fled to Lyra\u0027s breast, ermine-shaped, and Will carefully placed Tialys back on the rock beside his partner.\n \"You should show some respect,\" the Chevalier said to Lyra. \"You are a thoughtless, insolent child, and several brave men have died this evening in order to make you safe. You\u0027d do better to act politely.\"\n \"Yes,\" she said humbly, \"I\u0027m sorry, I will. Honest.\"\n \"As for you - \" he went on, turning to Will.\n But Will interrupted: \"As for me, I\u0027m not going to be spoken to like that, so don\u0027t try. Respect goes two ways. Now listen carefully. You are not in charge here; we are. If you want to stay and help, then you do as we say. Otherwise, go back to Lord Asriel now. There\u0027s no arguing about it.\"\n Lyra could see the pair of them bristling, but Tialys was looking at Will\u0027s hand, which was on the sheath at his belt, and she knew he was thinking that while Will had the knife, he was stronger than they were. At all costs they mustn\u0027t know it was broken, then.\n \"Very well,\" said the Chevalier. \"We shall help you, because that\u0027s the task we\u0027ve been given. But you must let us know what you intend to do.\"\n \"That\u0027s fair,\" said Will. \"I\u0027ll tell you. We\u0027re going back into Lyra\u0027s world as soon as we\u0027ve rested, and we\u0027re going to find a friend of ours, a bear. He\u0027s not far away.\"\n \"The bear with the armor? Very well,\" said Salmakia. \"We saw him fight. We\u0027ll help you do that. But then you must come with us to Lord Asriel.\"\n \"Yes,\" said Lyra, lying earnestly, \"oh yes, we\u0027ll do that then all right.\"\n Pantalaimon was calmer now, and curious, so she let him climb to her shoulder and change. He became a dragonfly, as big as the two that were skimming through the air as they spoke, and darted up to join them.\n \"That poison,\" Lyra said, turning back to the Gallivespians, \"in your spurs, I mean, is it deadly? Because you stung my mother, Mrs. Coulter, didn\u0027t you? Will she die?\"\n \"It was only a light sting,\" said Tialys. \"A full dose would have killed her, yes, but a small scratch will make her weak and drowsy for half a day or so.\"\n And full of maddening pain, he knew, but he didn\u0027t tell her that.\n \"I need to talk to Lyra in private,\" said Will. \"We\u0027re just going to move away for a minute.\"\n \"With that knife,\" said the Chevalier, \"you can cut through from one world to another, isn\u0027t that so?\"\n \"Don\u0027t you trust me?\"\n \"No.\"\n \"All right, I\u0027ll leave it here, then. If I haven\u0027t got it, I can\u0027t use it.\"\n He unbuckled the sheath and laid it on the rock, and then he and Lyra walked away and sat where they could see the Gallivespians. Tialys was looking closely at the knife handle, but he wasn\u0027t touching it.\n \"We\u0027ll just have to put up with them,\" Will said. \"As soon as the knife\u0027s mended, we\u0027ll escape.\"\n \"They\u0027re so quick, Will,\" she said. \"And they wouldn\u0027t care, they\u0027d kill you.\"\n \"I just hope Iorek can mend it. I hadn\u0027t realized how much we need it.\"\n \"He will,\" she said confidently.\n She was watching Pantalaimon as he skimmed and darted through the air, snapping up tiny moths like the other dragonflies. He couldn\u0027t go as far as they could, but he was just as fast, and even more brightly patterned. She raised her hand and he settled on it, his long, transparent wings vibrating.\n \"Do you think we can trust them while we sleep?\" Will said.\n \"Yes. They\u0027re fierce, but I think they\u0027re honest.\"\n They went back to the rock, and Will said to the Gallivespians, \"I\u0027m going to sleep now. We\u0027ll move on in the morning.\"\n The Chevalier nodded, and Will curled up at once and fell asleep.\n Lyra sat down beside him, with Pantalaimon cat-formed and warm in her lap. How lucky Will was that she was awake now to look after him! He was truly fearless, and she admired that beyond measure; but he wasn\u0027t good at lying and betraying and cheating, which all came to her as naturally as breathing. When she thought of that, she felt warm and virtuous, because she did it for Will, never for herself.\n She had intended to look at the alethiometer again, but to her deep surprise she found herself as weary as if she\u0027d been awake all that time instead of unconscious, and she lay down close by and closed her eyes, just for a brief nap, as she assured herself before she fell asleep. \n","sourceLink":"https://allnovel.net/the-amber-spyglass-his-dark-materials-3/page-13.html","bookId":2093,"book":{"id":2093,"title":"The Amber Spyglass (His Dark Materials #3)","description":"Storyline: \n The Amber Spyglass(His Dark Materials 3) \n The Amber Spyglass is the third and final novel in the His Dark Materials series, written by English author Philip Pullman, and published in 2000. \n At the end of The Subtle Knife, Marisa Coulter captured Lyra. She has now relocated her to a remote cave to hide her from the Magisterium, who are determined to kill Lyra before she yields to original sin. In order to keep her hidden, Marisa forces Lyra to drink drugged tea that puts her to sleep. While deeply asleep, Lyra dreams that she is in a wasteland (later realized as the land of the dead) talking to her deceased friend Roger Parslow, whom she promises to help. \n In Cittàgazze, two angels, Balthamos and Baruch, tell Will, the bearer of the Subtle Knife, that they are taking him to Lord Asriel. Will refuses to go until Lyra is rescued, to which the two assent. However, they are attacked by a soldier of the archangel Metatron, and Will uses the knife to cut a window into another world to escape. Baruch flies to Lord Asriel to tell him what has happened and to get help.\n \n","cover":"https://allnovel.net/images/the-amber-spyglass-his-dark-materials-3.jpg","author":"Philip Pullman","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-amber-spyglass-his-dark-materials-3.html","creation":"Oct 5, 2019 8:58:20 AM","modification":"Oct 5, 2019 5:40:58 PM"}}
