{"id":9225,"no":18,"title":"KI-YI COYOTE’S STRANGE HIDING PLACE","content":"How Ki-yi Coyote did run when he got out on the Wide Prairie! He thought he would run as fast as possible, and so get out of sight and hide from the two hounds. Sure enough, sly Ki-yi did this very thing. He ran so fast that pretty soon he passed from sight over a little hill, and it certainly looked as if he had escaped. Old Ki-yi thought he had, and as he hid in some tall grass, he chuckled to himself to think how easy it was to get away from his enemies. “I’ll just wait and rest here,” he said. “Ha, ha, ha! I’ll get my rabbit for breakfast yet!” \n \n But Ki-yi Coyote had no more than said that than here came Yappy and the[Pg 96] other hound right on his trail. And they kept coming right on and sniffing and smelling Ki-yi’s tracks until they were so close that Ki-yi had to spring up and run again. Once more he ran fast and hid, but again he was trailed, and again he had to jump up and run. \n \n They kept this up all morning, until Ki-yi Coyote was getting pretty tired. Then, a little later, he was so dreadfully tired that what do you suppose he did? No, he didn’t stop to fight, although cowardly Ki-yi sometimes does do that. He thought about it, but after he had looked back he said to himself, “No, I won’t stop to fight. I’m not quite able to tackle Yappy and that other big hound, too. I’m going to do something else. I’m going where I can rest.” \n \n He ran straight for Mr. Farmer’s corn-crib \n \n And he did. He ran straight for Farmer Roe’s corn crib and squeezed[Pg 97] under it! The dirt was soft and cool under there, and tired Ki-yi stretched out and made himself very comfortable. Then Yappy and his friend ran up to the hole where Ki-yi Coyote had gone under the corn crib, and began barking for all they were worth; and presently Farmer Roe and his boy came out and looked under the corn crib. They were certainly surprised to see Ki-yi hidden under there, and they decided at once that they would try to catch him alive. \n \n The two hounds kept on barking, and Farmer Roe and his boy went right to work fixing something outside; but Ki-yi did not know what they were doing, and he felt pretty safe. \n \n All this time the little creatures of the Big Green Woods had looked on from the edge of the Wide Prairie. Blue Jay was in the very top of the big elm, and he[Pg 98] called down every now and then to tell just what was happening. \n \n When Ki-yi Coyote ran under the corn crib, Doctor Rabbit slipped up pretty close to Farmer Roe’s house. He got a good hiding place in some weeds, where he could see all that happened. \n \n After a while Farmer Roe and his boy got some kind of a box fixed, and this they placed over the hole into which Ki-yi Coyote had run. Then they took the two hounds away and locked them in the barn. Doctor Rabbit slipped back to the woods. \n \n “They’ve got it all fixed to catch Ki-yi alive!” he told the other little creatures of the Big Green Woods. \n \n “How do you know?” they asked in a chorus. \n \n “I heard them say so; and now you just wait and see!” Doctor Rabbit said.[Pg 99] Then he slipped back again to hide in the weeds and watch. \n \n Of course he had to be very careful, because Yappy might come tearing out into the weeds at any moment. But Doctor Rabbit’s eyes are very sharp. He was sure he could see any danger if it came near, so he was not much afraid. \n \n \n","sourceLink":"http://novel.tingroom.com/ertong/2325/65040.html","bookId":591,"book":{"id":591,"title":"Doctor Rabbit and Ki-Yi Coyote","description":"简介： Doctor Rabbit lived in the very biggest tree in the Big Green Woods. He looked after all the other rabbits when they were ill and he doctored quite a number of the other little creatures of the Big Woods too, when they did not feel well. He was so jo...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2325","creation":"Aug 1, 2019 12:18:59 AM","modification":"Aug 1, 2019 12:18:59 AM"}}
