{"id":20094,"no":21,"title":"CHAPTER XXI. WHAT THEY ALL THOUGHT AS THEY WENT HOME.","content":"Lord Hampstead had come to the door to help them into the carriage. \"Lord Hampstead,\" said Mrs. Roden, \"you will catch your death of cold. It is freezing, and you have nothing on your head.\" \"I am quite indifferent about those things,\" he said, as for a moment he held Marion\u0027s hand while he helped her into the carriage. \"Do go in,\" she whispered. Her lips as she spoke were close to his ear,—but that simply came from the position in which chance had placed her. Her hand was still in his,—but that, too, was the accident of the situation. But there is, I think, an involuntary tendency among women to make more than necessary use of assistance when the person tendering it has made himself really welcome. Marion had certainly no such intention. Had the idea come to her at the moment she would have shrank from his touch. It was only when his fingers were withdrawn, when the feeling of the warmth of this proximity had passed away, that she became aware that he had been so close to her, and that now they were separated. Then her father entered the carriage, and Roden. \"Good-night, my lord,\" said the Quaker. \"I have passed my evening very pleasantly. I doubt whether I may not feel the less disposed for my day\u0027s work to-morrow.\" \"Not at all, Mr. Fay; not at all. You will be like a giant refreshed. There is nothing like a little friendly conversation for bracing up the mind. I hope it will not be long before you come and try it again.\" Then the carriage was driven off, and Lord Hampstead went in to warm himself before the fire which Marion Fay had poked. He had not intended to fall in love with her. Was there ever a young man who, when he first found a girl to be pleasant to him, has intended to fall in love with her? Girls will intend to fall in love, or, more frequently perhaps, to avoid it; but men in such matters rarely have a purpose. Lord Hampstead had found her, as he thought, to be an admirable specimen of excellence in that class of mankind which his convictions and theories induced him to extol. He thought that good could be done by mixing the racers and plough-horses,—and as regarded the present experiment, Marion Fay was a plough-horse. No doubt he would not have made this special attempt had she not pleased his eye, and his ear, and his senses generally. He certainly was not a philosopher to whom in his search after wisdom an old man such as Zachary Fay could make himself as acceptable as his daughter. It may be acknowledged of him that he was susceptible to female influences. But it had not at first occurred to him that it would be a good thing to fall in love with Marion Fay. Why should he not be on friendly terms with an excellent and lovely girl without loving her? Such had been his ideas after first meeting Marion at Mrs. Roden\u0027s house. Then he had determined that friends could not become friends without seeing each other, and he had concocted his scheme without being aware of the feelings which she had excited. The scheme had been carried out; he had had his dinner-party; Marion Fay had poked his fire; there had been one little pressure of the hand as he helped her into the carriage, one little whispered word, which had it not been whispered would have been as nothing; one moment of consciousness that his lips were close to her cheek; and then he returned to the warmth of his fire, quite conscious that he was in love. What was to come of it? When he had argued both with his sister and with Roden that their marriage would be unsuitable because of their difference in social position, and had justified his opinion by declaring it to be impossible that any two persons could, by their own doing, break through the conventions of the world without ultimate damage to themselves and to others, he had silently acknowledged to himself that he also was bound by the law which he was teaching. That such conventions should gradually cease to be, would be good; but no man is strong enough to make a new law for his own governing at the spur of the moment;—and certainly no woman. The existing distances between man and man were radically bad. This was the very gist of his doctrine; but the instant abolition of such distances had been proved by many experiments to be a vain dream, and the diminution of them must be gradual and slow. That such diminution would go on till the distances should ultimately disappear in some future millennium was to him a certainty. The distances were being diminished by the increasing wisdom and philanthropy of mankind. To him, born to high rank and great wealth, it had been given to do more perhaps than another. In surrendering there is more efficacy, as there is also more grace, than in seizing. What of his grandeur he might surrender without injury to others to whom he was bound, he would surrender. Of what exact nature or kind should be the woman whom it might please him to select as his wife, he had formed no accurate idea; but he would endeavour so to marry that he would make no step down in the world that might be offensive to his family, but would yet satisfy his own convictions by drawing himself somewhat away from aristocratic blood. His father had done the same when choosing his first wife, and the happiness of his choice would have been perfect had not death interfered. Actuated by such reasoning as this, he had endeavoured in a mild way to separate his sister from her lover, thinking that they who were in love should be bound by the arguments which seemed good to him who was not in love. But now he also was in love, and the arguments as they applied to himself fell into shreds and tatters as he sat gazing at his fire, holding the poker in his hand. Had there ever been anything more graceful than the mock violence with which she had pretended to strike heartily at the coals?—had there ever anything been more lovely than that mingled glance of doubt, of fear, and of friendliness with which she had looked into his face as she did it? She had quite understood his feeling when he made his little request. There had been heart enough in her, spirit enough, intelligence enough, to tell her at once the purport of his demand. Or rather she had not seen it all at once, but had only understood when her hand had gone too far to be withdrawn that something of love as well as friendship had been intended. Before long she should know how much of love had been intended! Whether his purpose was or was not compatible with the wisdom of his theory as to a gradual diminution of distances, his heart had gone too far now for any retracting. As he sat there he at once began to teach himself that the arguments he had used were only good in reference to high-born females, and that they need not necessarily affect himself. Whomever he might marry he would raise to his own rank. For his rank he did not care a straw himself. It was of the prejudices of others he was thinking when he assured himself that Marion would make as good a Countess and as good a Marchioness as any lady in the land. In regard to his sister it was otherwise. She must follow the rank of her husband. It might be that the sores which she would cause to many by becoming the wife of a Post Office clerk ought to be avoided. But there need be no sores in regard to his marriage with Marion Fay. His present reasoning was, no doubt, bad, but such as it was it was allowed to prevail absolutely. It did not even occur to him that he would make an attempt to enfranchise himself from Marion\u0027s charms. Whatever might occur, whatever details there might be which would require his attention in regard to his father or others of the family, everything must give way to his present passion. She had poked his fire, and she must be made to sit at his hearth for the remainder of their joint existence. She must be made to sit there if he could so plead his cause that his love should prevail with her. As to the Quaker father, he thought altogether well of him too,—an industrious, useful, intelligent man, of whose quaint manners and manly bearing he would not be ashamed in any society. She, too, was a Quaker, but that to him was little or nothing. He also had his religious convictions, but they were not of a nature to be affronted or shocked by those of any one who believed that the increasing civilization of the world had come from Christ\u0027s teaching. The simple, earnest purity of the girl\u0027s faith would be an attraction to him rather than otherwise. Indeed, there was nothing in his Marion, as he saw her, that was not conducive to feminine excellence. His Marion! How many words had he spoken to her? How many thoughts had he extracted from her? How many of her daily doings had he ever witnessed? But what did it matter? It is not the girl that the man loves, but the image which imagination has built up for him to fill the outside covering which has pleased his senses. He was quite as sure that the Ten Commandments were as safe in Marion\u0027s hands as though she were already a saint, canonized for the perfection of all virtues. He was quite ready to take that for granted; and having so convinced himself, was now only anxious as to the means by which he might make this priceless pearl his own. There must be some other scheme. He sat, thinking of this, cudgelling his brains for some contrivance by which he and Marion Fay might be brought together again with the least possible delay. His idea of a dinner-party had succeeded beyond all hope. But he could not have another dinner-party next week. Nor could he bring together the guests whom he had to-day entertained after his sister\u0027s return. He was bound not to admit George Roden to his house as long as she should be with him. Without George he could hardly hope that Mrs. Roden would come to him, and without Mrs. Roden how could he entice the Quaker and his daughter? His sister would be with him on the following day, and would, no doubt, be willing to assist him with Marion if it were possible. But the giving of such assistance on her part would tacitly demand assistance also from him in her difficulties. Such assistance, he knew, he could not give, having pledged himself to his father in regard to George Roden. He could at the present moment devise no other scheme than the very simple one of going to Mrs. Roden, and declaring his love for the girl. ****** The four guests in the carriage were silent throughout their drive home. They all had thoughts of their own sufficient to occupy them. George Roden told himself that this, for a long day, must be his last visit to Hendon Hall. He knew that Lady Frances would arrive on the morrow, and that then his presence was forbidden. He had refused to make any promise as to his assured absence, not caring to subject himself to an absolute bond; but he was quite aware that he was bound in honour not to enter the house in which he could not be made welcome. He felt himself to be safe, with a great security. The girl whom he loved would certainly be true. He was not impatient, as was Hampstead. He did not trouble his mind with schemes which were to be brought to bear within the next few days. He could bide his time, comforting himself with his faith. But still a lover can hardly be satisfied with the world unless he can see some point in his heaven from which light may be expected to break through the clouds. He could not see the point from which the light might be expected. The Quaker was asking himself many questions. Had he done well to take his girl to this young nobleman\u0027s house? Had he done well to take himself there? It had been as it were a sudden disruption in the settled purposes of his life. What had he or his girl to do with lords? And yet he had been pleased. Courtesy always flatters, and flattery is always pleasant. A certain sense of softness had been grateful to him. There came upon him a painful question,—as there does on so many of us, when for a time we make a successful struggle against the world\u0027s allurements,—whether in abandoning the delights of life we do in truth get any compensation for them. Would it not after all be better to do as others use? Ph?bus as he touches our trembling ear encourages us but with a faint voice. It had been very pleasant,—the soft chairs, the quiet attendance, the well-cooked dinner, the good wines, the bright glasses, the white linen,—and pleasanter than all that silvery tone of conversation to which he was so little accustomed either in King\u0027s Court or Paradise Row. Marion indeed was always gentle to him as a dove cooing; but he was aware of himself that he was not gentle in return. Stern truth, expressed shortly in strong language, was the staple of his conversation at home. He had declared to himself all through his life that stern truth and strong language were better for mankind than soft phrases. But in his own parlour in Paradise Row he had rarely seen his Marion bright as she had been at this lord\u0027s table. Was it good for his Marion that she should be encouraged to such brightness; and if so, had he been cruel to her to suffuse her entire life with a colour so dark as to admit of no light? Why had her beauty shone so brightly in the lord\u0027s presence? He too knew something of love, and had it always present to his mind that the time would come when his Marion\u0027s heart would be given to some stranger. He did not think, he would not think, that the stranger had now come;—but would it be well that his girl\u0027s future should be affected even as was his own? He argued the points much within himself, and told himself that it could not be well. Mrs. Roden had read it nearly all,—though she could not quite read the simple honesty of the young lord\u0027s purpose. The symptoms of love had been plain enough to her eyes, and she had soon told herself that she had done wrong in taking the girl to the young lord\u0027s house. She had seen that Hampstead had admired Marion, but she had not dreamed that it would be carried to such a length as this. But when he had knelt on the rug between them, leaning just a little towards the girl, and had looked up into the girl\u0027s face, smiling at his own little joke, but with his face full of love;—then she had known. And when Marion had whispered the one word, with her little fingers lingering within the young lord\u0027s touch, then she had known. It was not the young lord only who had given way to the softness of the moment. If evil had been done, she had done it; and it seemed as though evil had certainly been done. If much evil had been done, how could she forgive herself? And what were Marion\u0027s thoughts? Did she feel that an evil had been done, an evil for which there could never be a cure found? She would have so assured herself, had she as yet become aware of the full power and depth and mortal nature of the wound she had received. For such a wound, for such a hurt, there is but one cure, and of that she certainly would have entertained no hope. But, as it will sometimes be that a man shall in his flesh receive a fatal injury, of which he shall for awhile think that only some bruise has pained him, some scratch annoyed him; that a little time, with ointment and a plaister, will give him back his body as sound as ever; but then after a short space it becomes known to him that a deadly gangrene is affecting his very life; so will it be with a girl\u0027s heart. She did not yet,—not yet,—tell herself that half-a-dozen gentle words, that two or three soft glances, that a touch of a hand, the mere presence of a youth whose comeliness was endearing to the eye, had mastered and subdued all that there was of Marion Fay. But it was so. Not for a moment did her mind run away, as they were taken homewards, from the object of her unconscious idolatry. Had she behaved ill?—that was her regret! He had been so gracious;—that was her joy! Then there came a pang from the wound, though it was not as yet a pang as of death. What right had such a one as she to receive even an idle word of compliment from a man such as was Lord Hampstead? What could he be to her, or she to him? He had his high mission to complete, his great duties to perform, and doubtless would find some noble lady as a fit mother for his children. He had come across her path for a moment, and she could not but remember him for ever! There was something of an idea present to her that love would now be beyond her reach. But the pain necessarily attached to such an idea had not as yet reached her. There came something of a regret that fortune had placed her so utterly beyond his notice;—but she was sure of this, sure of this, that if the chance were offered to her, she would not mar his greatness by accepting the priceless boon of his love. But why,—why had he been so tender to her? Then she thought of what were the ways of men, and of what she had heard of them. It had been bad for her to go abroad thus with her poor foolish softness, with her girl\u0027s untried tenderness,—that thus she should be affected by the first chance smile that had been thrown to her by one of those petted darlings of Fortune! And then she was brought round to that same resolution which was at the moment forming itself in her father\u0027s mind;—that it would have been better for her had she not allowed herself to be taken to Hendon Hall. Then they were in Paradise Row, and were put down at their separate doors with but few words of farewell to each other. \"They have just come home,\" said Clara Demijohn, rushing into her mother\u0027s bedroom. \"You\u0027ll find it is quite true. They have been dining with the lord!\"","sourceLink":"http://novel.tingroom.com/duanpian/2737/75371.html","bookId":1384,"book":{"id":1384,"title":"Marion Fay","description":"简介： When Mr. Lionel Trafford went into Parliament for the Borough of Wednesbury as an advanced Radical, it nearly broke the heart of his uncle, the old Marquis of Kingsbury. Among Tories of his day the Marquis had been hyper-Tory,as were his friends, the...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2737","creation":"Aug 1, 2019 12:24:58 AM","modification":"Aug 1, 2019 12:24:58 AM"}}
