{"id":20123,"no":50,"title":"CHAPTER VII. THE GREAT QUESTION.","content":"Neither were the arguments of Mrs. Roden nor the adhesion of Mrs. Vincent of any power in persuading George Roden. He answered his mother gently, kindly, but very firmly. Had anything, he said, been necessary to strengthen his own feeling, it would have been found in his mother\u0027s determination to keep his old name. \"Surely, mother, if I may say so without disrespect, what is sauce for the goose is sauce for the gander.\" At this the mother smiled, kissing her son to show that the argument had been taken in good part. \"In this matter,\" he continued, \"we certainly are in a boat together. If I am a Duke you would be a Duchess. If I am doomed to make an ape of myself at the Post Office, you must be equally ridiculous in Paradise Row,—unless you are prepared to go back to Italy and live your life there.\" \"And you?\" \"I could not live there. How could I earn my bread there? How could I pass my days so as to be in any degree useful? What could be more mean? My uncle, though he has been civil, and to a certain degree generous, would be specially anxious not to see me in public life. You and I together would have just means enough for existence. I should be doomed to walk about the streets of some third-rate Italian town, and call myself by my grand name. Would a life like that satisfy your ambition on my behalf?\" Then she thought of the girl who was in love with him, of the friends whom he had made for himself, of the character which belonged to him, and she was driven to confess that, by whatever name he might be called, he must continue to live an Englishman\u0027s life, and to live in England. Nevertheless, she told herself that the title would not be abolished, because it might be in abeyance. She might, she thought, still live to hear her son called by the name of which she herself had been proud till she had become thoroughly ashamed of the husband who had given it to her. But there were others besides Crocker and Mrs. Vincent, and his mother and Sir Boreas, who were much interested by George Roden\u0027s condition. Mrs. Roden returned home on the 2nd of March, and, as may be remembered, the tidings respecting her son had reached England before she came. By the end of the month many persons were much exercised as to the young man\u0027s future name, and some people of high rank had not only discussed the subject at great length, but had written numerous letters concerning it. It was manifest to Lady Persiflage that no further attempt should now be made to throw obstacles in the way of Lady Frances and her lover. Lady Persiflage had never believed in the obstacles from the first. \"Of course they\u0027ll marry,\" she had said to her one daughter, who was now almost as good as married herself, and equally trustworthy. \"When a girl is determined like that, of course nothing will stop her. My sister shouldn\u0027t have let her meet the young man at first.\" But this had been said before the young man had turned out to be an Italian Duke. Since the news had come Lady Persiflage had been very eager in recommending her sister to discontinue the opposition. \"Make the most of him,\" she had said in one of her letters. \"It is all that can be done now. It is a fine name, and though Italian titles do not count like ours, yet, when they are as good as this, they go for a good deal. There are real records of the Di Crinola family, and there is no manner of doubt but that he is the head of them. Take him by the hand, and have him down at Trafford if Kingsbury is well enough. They tell me he is quite presentable, with a good figure and all that;—by no means a young man who will stand shivering in a room because he doesn\u0027t know how to utter a word. Had he been like that Fanny would never have set her heart upon him. Persiflage has been talking about him, and he says that something will be sure to turn up if he is brought forward properly, and is not ashamed of his family name. Persiflage will do whatever he can, but that can only be if you will open your arms to him.\" Lady Kingsbury did feel that she was called upon to undergo a terrible revulsion of sentiment. Opening her arms to the Duca di Crinola might be possible to her. But how was she to open her arms to Lady Frances Trafford? The man whom she had seen but once might appear before her with his new title as a young nobleman of whose antecedents she was not bound to remember anything. She might seem to regard him as a new arrival, a noble suitor for her stepdaughter\u0027s hand, of whom she had not before heard. But how was she to receive Fanny Trafford, the girl whom she had locked up at K?nigsgraaf, whose letters she had stopped as they came from the Post Office? Nevertheless she consented,—as far at least as her sister was concerned. \"I shall never like Fanny,\" she had said, \"because she is so sly.\" Girls are always called sly by their friends who want to abuse them. \"But of course I will have them both here, as you think it will be best. What they are to live upon Heaven only knows. But of course that will be no concern of mine.\" As a first result of this Lady Persiflage asked George Roden down to Castle Hautboy for the Easter holidays. There was a difficulty about this. How was he to be addressed? Hampstead was consulted, and he, though he was not much in heart just then for the arrangement of such a matter, advised that for the present his friend\u0027s old name should be used. Lady Persiflage therefore wrote to—George Roden, Esq., at the General Post Office. In this letter it was signified that Lord Persiflage was very anxious to make the acquaintance of—Mr. Roden. Lady Persiflage was also very anxious. Lady Persiflage explained that she was aware of,—Well! Lady Frances Trafford was to be at Castle Hautboy, and that she thought might act as an inducement to—Mr. Roden. The letter was very cleverly managed. Though it never once mentioned the grand title it made allusions which implied that the real rank of the Post Office clerk was well known to every one at Castle Hautboy. And though nothing of course was said as to any possible relations between Lord Persiflage as a member of the British Cabinet and the clerk\u0027s uncle as a member of the Italian Cabinet, nevertheless as to this also there were allusions which were intelligible. This letter was altogether very gracious,—such a one as few young men would be able to resist coming from such a person as Lady Persiflage. But the special offer which prevailed with our Post Office clerk was no doubt the promise of the presence of Fanny Trafford. In all the rest, gracious as the words were, there was nothing but trouble for him. It was clear enough to him that Lady Persiflage was on the same side as Crocker. Lady Persiflage would no doubt prefer a Duca di Crinola to a Post Office clerk for Lady Frances. And he could see also that the Secretary of State for Foreign Affairs was on the same side. The Secretary of State would not have expressed a special desire to see him, the Post Office clerk, at Castle Hautboy, and have, as it were, welcomed him to the possession of his brother-in-law\u0027s daughter, had nothing been told of the Duca di Crinola. He heard as much from Lord Hampstead, who advised him to go to Castle Hautboy, and make himself acquainted with Fanny\u0027s family friends. It was all manifest. And as it was all being done in opposition to his own firm resolution, he would not have gone,—but that the temptation was too great for him. Fanny Trafford would be there,—and he was quite open to the charm of the offer which was almost being made to him of Lady Fanny\u0027s hand. He arranged the matter at the office, and wrote to Lady Persiflage accepting the invitation. \"So you\u0027re going to Castle Hautboy?\" said Crocker to him. Crocker was in torments at the time. He had been made to understand that he would be doing quite wrong in calling the Duca \"Your Grace.\" Roden, if a Duke at all, could be only an Italian Duke—and not on that account \"Your Grace.\" This had been explained by Bobbin, and had disturbed him. The title \"Duca\" was still open to him; but he feared Roden\u0027s wrath if he should use it too freely. \"How do you know?\" asked Roden. \"I have been there myself, you know;—and am in the habit of hearing from Castle Hautboy.\" His father was agent on the property, and of course he heard tidings, if not from his father, at any rate from his sisters. \"Yes; I am going to Castle Hautboy.\" \"Hampstead will be there probably. I met Hampstead there. A man in Lord Persiflage\u0027s position will, of course, be delighted to welcome the—the—Duca di Crinola.\" He shrank as though he feared that Roden would strike him—but he uttered the words. \"Of course, if you choose to annoy me, I cannot well help myself,\" said Roden as he left the room. On his first arrival at the Castle things were allowed to go quietly with him. Every one called him \"Mr. Roden.\" Lady Persiflage received him very graciously. Lady Frances was in the house, and her name was mentioned to him with the whispered intimacy which on such occasions indicates the triumph of the man\u0027s position. She made no allusion either to his rank or to his office, but treated him just as she might have done any other suitor,—which was exactly what he wanted. Lord Llwddythlw had come down for his Easter holidays of two days, and was very civil to him. Lady Amaldina was delighted to make his acquaintance, and within three minutes was calling upon him to promise that he would not get himself married before August in consideration for her bevy. \"If I was to lose Fanny now,\" she said, \"I really think I should give it up altogether.\" Then before dinner he was allowed to find himself alone with Fanny, and for the first time in his life felt that his engagement was an acknowledged thing. All this was made very pleasant to him by the occasional use of his proper name. He had been almost ashamed of himself because of the embarrassment which his supposed title had occasioned him. He felt that he had thought of the matter more than it was worth. The annoyances of Crocker had been abominable to him. It was not likely that he should encounter a second Crocker, but still he dreaded he hardly knew what. It certainly was not probable that these people at Castle Hautboy should call him by a name he had never used without consulting him. But still he had dreaded something, and was gratified that the trouble seemed to pass by him easily. Lady Persiflage and Lady Amaldina had both used his legitimate name, and Lord Llwddythlw had called him nothing at all. If he could only be allowed to go away just as he had come, without an allusion from any one to the Di Crinola family, then he should think that the people at Castle Hautboy were very well-bred. But he feared that this was almost too much to hope. He did not see Lord Persiflage till a moment before dinner, when he specially remarked that he was introduced as Mr. Roden. \"Very glad to see you, Mr. Roden. I hope you\u0027re fond of scenery. We\u0027re supposed to have the finest view in England from the top of the tower. I have no doubt my daughter will show it you. I can\u0027t say that I ever saw it myself. Beautiful scenery is all very well when you are travelling, but nobody ever cares for it at home.\" Thus Lord Persiflage had done his courtesy to the stranger, and the conversation became general, as though the stranger were a stranger no longer. When Roden found that he was allowed to give his arm to Lady Frances, and go out and eat his dinner quietly and comfortably without any reference to the peculiarity of his position, he thought that perhaps no further troubles were in store for him. The whole of the next day was devoted to the charms of love and scenery. The spring weather was delightful, and Roden was allowed to ramble about where he pleased with Lady Frances. Every one about the place regarded him as an accepted and recognized lover. As he had never been in truth accepted by one of the family except by the girl herself;—as the Marquis had not condescended even to see him when he had come, but had sent Mr. Greenwood to reject him scornfully; as the Marchioness had treated him as below contempt; as even his own friend Lord Hampstead had declared that the difficulties would be insuperable, this sudden cessation of all impediments did seem to be delightfully miraculous. Assent on the part of Lord and Lady Persiflage would, he understood, be quite as serviceable as that of Lord and Lady Kingsbury. Something had occurred which, in the eyes of all the family, had lifted him up as it were out of the gutter and placed him on a grand pedestal. There could be no doubt as to this something. It was all done because he was supposed to be an Italian nobleman. And yet he was not an Italian nobleman; nor would he allow any one to call him so, as far as it might be in his power to prevent it. His visit was limited to two entire days. One was passed amidst all the sweets of love-making. With the pleasures of that no allusions were allowed to interfere. On the following morning he found himself alone with Lord Persiflage after breakfast. \"Delighted to have had you down here, you know,\" began his lordship. To this Roden simply bowed. \"I haven\u0027t the pleasure of knowing your uncle personally, but there isn\u0027t a man in Europe for whom I have a higher respect.\" Again Roden bowed. \"I\u0027ve heard all about this romance of yours from D\u0027Ossi. You know D\u0027Ossi?\" Roden declared that he had not the honour of knowing the Italian Minister. \"Ah; well, you must know D\u0027Ossi, of course. I won\u0027t say whether he\u0027s your countryman or not, but you must know him. He is your uncle\u0027s particular friend.\" \"It\u0027s only by accident that I know my uncle, or even learnt that he was my uncle.\" \"Just so. But the accident has taken place, and the result fortunately remains. Of course you must take your own name.\" \"I shall keep the name I have, Lord Persiflage.\" \"You will find it to be quite impossible. The Queen will not allow it.\" Upon hearing this Roden opened his eyes; but the Secretary of State for Foreign Affairs looked him full in the face as though to assure him that, though he had never heard of such a thing before, such, in fact, was the truth. \"Of course there will be difficulties. I\u0027m not prepared at the present moment to advise how this should be done. Perhaps you had better wait till Her Majesty has signified her pleasure to receive you as the Duca di Crinola. When she has done so you will have no alternative.\" \"No alternative as to what I may call myself?\" \"None in the least, I should say. I am thinking now in a great measure as to the welfare of my own relative, Lady Frances. Something will have to be done. I don\u0027t quite see my way as yet; but something, no doubt, will be done. The Duca di Crinola will, I have no doubt, find fitting employment.\" Then a little bell was rung, and Vivian, the private secretary, came into the room. Vivian and Roden knew each other, and a few pleasant words were spoken; but Roden found himself obliged to take his departure without making any further protests in regard to Her Majesty\u0027s assumed wishes. About five o\u0027clock that evening he was invited into a little sitting-room belonging to Lady Persiflage up-stairs. \"Haven\u0027t I been very good to you?\" she said, laughing. \"Very good, indeed. Nothing could be so good as inviting me down here to Castle Hautboy.\" \"That was done for Fanny\u0027s sake. But have I said one word to you about your terrible name?\" \"No, indeed; and now, Lady Persiflage, pray go on and be good to the end.\" \"Yes,\" she said, \"I will be good to the end,—before all the people down-stairs. I haven\u0027t said a word of it even to Fanny. Fanny is an angel.\" \"According to my thinking.\" \"That\u0027s of course. But even an angel likes to have her proper rank. You mustn\u0027t allow yourself to suppose that even Fanny Trafford is indifferent to titles. There are things that a man may expect a girl to do for him, but there are things which cannot be expected, let her be ever so much in love. Fanny Trafford has got to become Duchess of Crinola.\" \"I am afraid that that is more than I can do for her.\" \"My dear Mr. Roden, it must be done. I cannot let you go away from here without making you understand that, as a man engaged to be married, you cannot drop your title. Did you intend to remain single, I cannot say how far your peculiar notions might enable you to prevail; but as you mean to marry, she, too, will have rights. I put it to you whether it would be honest on your part to ask her to abandon the rank which she will be entitled to expect from you. Just you think of it, Mr. Roden. And now I won\u0027t trouble you any more upon the subject.\" Not a word more was said on the subject at Castle Hautboy, and on the next day he returned to the Post Office.","sourceLink":"http://novel.tingroom.com/duanpian/2737/75400.html","bookId":1384,"book":{"id":1384,"title":"Marion Fay","description":"简介： When Mr. Lionel Trafford went into Parliament for the Borough of Wednesbury as an advanced Radical, it nearly broke the heart of his uncle, the old Marquis of Kingsbury. Among Tories of his day the Marquis had been hyper-Tory,as were his friends, the...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2737","creation":"Aug 1, 2019 12:24:58 AM","modification":"Aug 1, 2019 12:24:58 AM"}}
