{"id":20128,"no":55,"title":"CHAPTER XII. LORD HAMPSTEAD AGAIN WITH MRS. RODEN.","content":"Weeks had passed by since Lord Hampstead had walked up and down Broad Street with Mr. Fay,—weeks which were to him a period of terrible woe. His passion for Marion had so seized upon him, that it had in all respects changed his life. The sorrow of her alleged ill-health had fallen upon him before the hunting had been over, but from that moment he had altogether forgotten his horses. The time had now come in which he was wont to be on board his yacht, but of his yacht he took no notice whatever. \"I can tell you nothing about it as yet,\" he said in the only line which he wrote to his skipper in answer to piteous applications made to him. None of those who were near and dear to him knew how he passed his time. His sister left him and went up to the house in London, and he felt that her going was a relief to him. He would not even admit his friend Roden to come to him in his trouble. He spent his days all alone at Hendon, occasionally going across to Holloway in order that he might talk of his sorrow to Mrs. Roden. Midsummer had come upon him before he again saw the Quaker. Marion\u0027s father had left a feeling almost of hostility in his mind in consequence of that conversation in Broad Street. \"I no longer want anything on your behalf,\" the Quaker had seemed to say. \"I care nothing now for your name, or your happiness. I am anxious only for my child, and as I am told that it will be better that you should not see her, you must stay away.\" That the father should be anxious for his daughter was natural enough. Lord Hampstead could not quarrel with Zachary Fay. But he taught himself to think that their interests were at variance with each other. As for Marion, whether she were ill or whether she were well, he would have had her altogether to himself. \n \n Gradually there had come upon him the conviction that there was a real barrier existing between himself and the thing that he desired. To Marion\u0027s own words, while they had been spoken only to himself, he had given no absolute credit. He had been able to declare to her that her fears were vain, and that whether she were weak or whether she were strong, it was her duty to come to him. When they two had been together his arguments and assurances had convinced at any rate himself. The love which he had seen in her eyes and had heard from her lips had been so sweet to him, that their savour had overcome whatever strength her words possessed. But these protestations, these assurances that no marriage could be possible, when they reached him second-hand, as they had done through his sister and through the Quaker, almost crushed him. He did not dare to tell them that he would fain marry the girl though she were dying,—that he would accept any chance or no chance, if he might only be allowed to hold her in his arms, and tell her that she was all his own. There had come a blow, he would say to himself, again and again, as he walked about the grounds at Hendon, there had come a blow, a fatal blow, a blow from which there could be no recovery,—but, still, it should, it ought, to be borne together. He would not admit to himself that because of this verdict there ought to be a separation between them two. It might be that the verdict had been uttered by a Judge against whom there could be no appeal; but even the Judge should not be allowed to say that Marion Fay was not his own. Let her come and die in his arms if she must die. Let her come and have what of life there might be left to her, warmed and comforted and perhaps extended by his love. It seemed to him to be certainly a fact, that because of his great love, and of hers, she did already belong to him; and yet he was told that he might not see her;—that it would be better that she should not be disturbed by his presence,—as though he were no more than a stranger to her. Every day he almost resolved to disregard them, and go down to the little cottage in which she was living. But then he remembered the warnings which were given to him, and was aware that he had in truth no right to intrude upon the Quaker\u0027s household. It is not to be supposed that during this time he had no intercourse with Marion. At first there came to be a few lines, written perhaps once a week from her, in answer to many lines written by him; but by degrees the feeling of awe which at first attached itself to the act of writing to him wore off, and she did not let a day pass without sending him some little record of herself and her doings. It had come to be quite understood by the Quaker that Marion was to do exactly as she pleased with her lover. No one dreamed of hinting to her that this correspondence was improper or injurious. Had she herself expressed a wish to see him, neither would the Quaker nor Mrs. Roden have made strong objection. To whatever might have been her wish or her decision they would have acceded. It was by her word that the marriage had been declared to be impossible. It was in obedience to her that he was to keep aloof. She had failed to prevail with her own soft words, and had therefore been driven to use the authority of others. \n \n But at this period, though she did become weaker and weaker from day to day, and though the doctor\u0027s attendance was constant at the cottage, Marion herself was hardly unhappy. She grieved indeed for his grief; but, only for that, there would have been triumph and joy to her rather than grief. The daily writing of these little notes was a privilege to her and a happiness, of which she had hitherto known nothing. To have a lover, and such a lover, was a delight to her, a delight to which there was now hardly any drawback, as there was nothing now of which she need be afraid. To have him with her as other girls may have their lovers, she knew was impossible to her. But to read his words, and to write loving words to him, to talk to him of his future life, and bid him think of her, his poor Marion, without allowing his great manly heart to be filled too full with vain memories, was in truth happiness to her. \"Why should you want to come?\" she said. \"It is infinitely better that you should not come. We understand it all now, and acknowledge what it is that the Lord has done for us. It would not have been good for me to be your wife. It would not have been good for you to have become my husband. But it will I think be good for me to have loved you; and if you will learn to think of it as I do, it will not have been bad for you. It has given a beauty to my life,\" she said, \"which makes me feel that I ought to be contented to die early. If I could have had a choice I would have chosen it so.\" \n \n But these teachings from her had no effect whatever upon him. It was her idea that she would pass away, and that there would remain with him no more than a fair sweet shade which would have but little effect upon his future life beyond that of creating for him occasionally a gentle melancholy. It could not be, she thought, that for a man such as he,—for one so powerful and so great,—such a memory should cause a lasting sorrow. But with him, to his thinking, to his feeling, the lasting biting sorrow was there already. There could be no other love, no other marriage, no other Marion. He had heard that his stepmother was anxious for her boy. The way should be open for the child. It did seem to him that a life, long continued, would be impossible to him when Marion should have been taken away from him. \n \n \"Oh yes;—he\u0027s there again,\" said Miss Demijohn to her aunt. \"He comes mostly on Tuesdays, Thursdays, and Saturdays. What he can be coming about is more than I can guess. Crocker says it\u0027s all true love. Crocker says that the Duca says—\" \n \n \"Bother the Duca,\" exclaimed the old woman. \"I don\u0027t believe that Crocker and George Roden ever exchange a word together.\" \n \n \"Why shouldn\u0027t they exchange words, and they fast friends of five years\u0027 standing? Crocker says as Lord Hampstead is to be at Lady Amaldina\u0027s wedding in August. His lordship has promised. And Crocker thinks—\" \n \n \"I don\u0027t believe very much about Crocker, my young woman. You had better look to yourself, or, perhaps, you\u0027ll find when you have got yourself married that Crocker has not got a roof to cover you.\" \n \n Lord Hampstead had walked over to Paradise Row, and was seated with Mrs. Roden when this little squabble was going on. \"You don\u0027t think that I ought to let things remain as they are,\" he said to Mrs. Roden. To all such questions Mrs. Roden found it very difficult to make any reply. She did in truth think that they ought to be allowed to remain as they were,—or rather that some severance should be made more decided even than that which now existed. Putting aside her own ideas, she was quite sure that Marion would not consent to a marriage. And, as it was so, and must be so, it was better, she thought, that the young people should see no more of each other. This writing of daily letters,—what good could it do to either of them? To her indeed, to Marion, with her fixed purpose, and settled religious convictions, and almost certain fate, little evil might be done. But to Lord Hampstead the result would be, and was, terribly pernicious. He was sacrificing himself, not only as Mrs. Roden thought for the present moment, but for many years perhaps,—perhaps for his future life,—to a hopeless passion. A cloud was falling upon him which might too probably darken his whole career. From the day on which she had unfortunately taken Marion to Hendon Hall, she had never ceased to regret the acquaintance which she had caused. To her thinking the whole affair had been unfortunate. Between people so divided there should have been no intimacy, and yet this intimacy had been due to her. \"It is impossible that I should not see her,\" continued Lord Hampstead. \"I will see her.\" \n \n \"If you would see her, and then make up your mind to part with her,—that I think would be good.\" \n \n \"To see her, and say farewell to her for ever?\" \n \n \"Yes, my lord.\" \n \n \"Certainly not. That I will never do. If it should come to pass that she must go from me for ever, I would have her in my arms to the very last!\" \n \n \"At such a moment, my lord, those whom nature has given to her for her friends—\" \n \n \"Has not nature given me too for her friend? Can any friend love her more truly than I do? Those should be with us when we die to whom our life is of most importance. Is there any one to whom her life can be half as much as it is to me? The husband is the dearest to his wife. When I look upon her as going from me for ever, then may I not say that she is the same to me as my wife.\" \n \n \"Why—why,—why?\" \n \n \"I know what you mean, Mrs. Roden. What is the use of asking \u0027why\u0027 when the thing is done? Could I make it so now, as though I had never seen her? Could I if I would? Would I if I could? What is the good of thinking of antecedents which are impossible? She has become my treasure. Whether past and fleeting, or likely to last me for my life, she is my treasure. Can I make a change because you ask why,—and why,—and why? Why did I ever come here? Why did I know your son? Why have I got a something here within me which kills me when I think that I shall be separated from her, and yet crowns me with glory when I feel that she has loved me. If she must leave me, I have to bear it. What I shall do, where I shall go, whether I shall stand or fall, I do not pretend to say. A man does not know, himself, of what stuff he is made, till he has been tried. But whatever may be my lot, it cannot be altered by any care or custody now. She is my own, and I will not be separated from her. If she were dead, I should know that she was gone. She would have left me, and I could not help myself. As yet she is living, and may live, and I will be with her. I must go to her there, or she must come here to me. If he will permit it I will take some home for myself close to hers. What will it matter now, though every one should know it? Let them all know it. Should she live she will become mine. If she must go,—what will the world know but that I have lost her who was to have been my wife?\" \n \n Even Mrs. Roden had not the heart to tell him that he had seen Marion for the last time. It would have been useless to tell him so, for he would not have obeyed the behest contained in such an assertion. Ideas of prudence and ideas of health had restrained him hitherto,—but he had been restrained only for a time. No one had dared suggest to him that he should never again see his Marion. \"I suppose that we must ask Mr. Fay,\" she replied. She was herself more powerful than the Quaker, as she was well aware; but it had become necessary to her to say something. \n \n \"Mr. Fay has less to say to it even than I have,\" said Hampstead. \"My belief is that Marion herself is the only one among us who is strong. If it were not that she is determined, he would yield and you would yield.\" \n \n \"Who can know as she knows?\" said Mrs. Roden. \"Which among us is so likely to be guided by what is right? Which is so pure, and honest, and loving? Her conscience tells her what is best.\" \n \n \"I am not sure of that,\" said he. \"Her conscience may fill her as well as another with fears that are unnecessary. I cannot think that a girl should be encouraged by those around her to doom herself after this fashion. Who has a right to say that God has determined that she shall die early?\" Mrs. Roden shook her head. \"I am not going to teach others what religion demands, but to me it seems that we should leave these things in God\u0027s hands. That she may doubt as to herself may be natural enough, but others should not have encouraged her.\" \n \n \"You mean me, my lord?\" \n \n \"You must not be angry with me, Mrs. Roden. The matter to me is so vital that I have to say what I think about it. It does seem to me that I am kept away from her, whereas, by all the ties which can bind a man and a woman together, I ought to be with her. Forms and ceremonies seem to sink to nothing, when I think of all she is to me, and remember that I am told that she is soon to be taken away from me.\" \n \n \"How would it be if she had a mother?\" \n \n \"Why should her mother refuse my love for her daughter? But she has no mother. She has a father who has accepted me. I do believe that had the matter been left wholly to him, Marion would now be my wife.\" \n \n \"I was away, my lord, in Italy.\" \n \n \"I will not be so harsh to such a friend as you, as to say that I wish you had remained there; but I feel,—I cannot but feel—\" \n \n \"My lord, I think the truth is that you hardly know how strong in such a matter as this our Marion herself can be. Neither have I nor has her father prevailed upon her. I can go back now, and tell you without breach of confidence all that passed between her and me. When first your name was discussed between us; when first I saw that you seemed to make much of her—\" \n \n \"Make much of her!\" exclaimed Hampstead, angrily. \n \n \"Yes; make much of her! When first I thought that you were becoming fond of her.\" \n \n \"You speak as though there had been some idle dallying. Did I not worship her? Did I not pour out my whole heart into her lap from the first moment in which I saw her? Did I hide it even from you? Was there any pretence, any falsehood?\" \n \n \"No, indeed.\" \n \n \"Do not say that I made much of her. The phrase is vile. When she told me that she loved me, she made much of me.\" \n \n \"When first you showed us that you loved her,\" she continued, \"I feared that it would not be for good.\" \n \n \"Why should it not be for good?\" \n \n \"I will not speak of that now, but I thought so. I thought so, and I told my thoughts to Marion.\" \n \n \"You did?\" \n \n \"I did;—and I think that in doing so, I did no more than my duty to a motherless girl. Of the reasons which I gave to her I will say nothing now. Her reasons were so much stronger, that mine were altogether unavailing. Her resolutions were built on so firm a rock, that they needed no persuasions of mine to strengthen them. I had ever known Marion to be pure, unselfish, and almost perfect. But I had never before seen how high she could rise, how certainly she could soar above all weakness and temptation. To her there was never a moment of doubt. She knew from the very first that it could not be so.\" \n \n \"It shall be so,\" he said, jumping up from his chair, and flinging up his arms. \n \n \"It was not I who persuaded her, or her father. Even you cannot persuade her. Having convinced herself that were she to marry you, she would injure you, not all her own passionate love will induce her to accept the infinite delight of yielding to you. What may be best for you;—that is present to her mind, and nothing else. On that her heart is fixed, and so clear is her judgment respecting it, that she will not allow the words of any other to operate on her for a moment. Marion Fay, Lord Hampstead, is infinitely too great to have been persuaded in any degree by me.\" \n \n \n Nevertheless Mrs. Roden did allow herself to say that in her opinion the lover should be allowed to see his mistress. She herself would go to Pegwell Bay, and endeavour to bring Marion back to Holloway. That Lord Hampstead should himself go down and spend his long hours at the little seaside place did not seem to her to be fitting. But she promised that she would do her best to arrange at any rate another meeting in Paradise Row. \n \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2737/75405.html","bookId":1384,"book":{"id":1384,"title":"Marion Fay","description":"简介： When Mr. Lionel Trafford went into Parliament for the Borough of Wednesbury as an advanced Radical, it nearly broke the heart of his uncle, the old Marquis of Kingsbury. Among Tories of his day the Marquis had been hyper-Tory,as were his friends, the...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2737","creation":"Aug 1, 2019 12:24:58 AM","modification":"Aug 1, 2019 12:24:58 AM"}}
