{"id":20132,"no":59,"title":"CHAPTER XVI. PEGWELL BAY.","content":"July had come and nearly gone before Lord Hampstead again saw Marion Fay. He had promised not to go to Pegwell Bay,—hardly understanding why such a promise had been exacted from him, but still acceding to it when it had been suggested to him by Mrs. Roden, at the request, as she said, of the Quaker. It was understood that Marion would soon return to Holloway, and that on that account the serenity of Pegwell Bay need not be disturbed by the coming of so great a man as Lord Hampstead. Hampstead had of course ridiculed the reason, but had complied with the request,—with the promise, however, that Marion should return early in the summer. But the summer weeks had passed by, and Marion did not return. \n \n Letters passed between them daily in which Marion attempted always to be cheerful. Though she had as yet invented no familiar name for her noble lover, yet she had grown into familiarity with him, and was no longer afraid of his nobility. \"You oughtn\u0027t to stay there,\" she said, \"wasting your life and doing nothing, because of a sick girl. You\u0027ve got your yacht, and are letting all the summer weather go by.\" In answer to this he wrote to her, saying that he had sold his yacht. \"Could you have gone with me, I would have kept it,\" he wrote. \"Would you go with me I would have another ready for you, before you would be ready. I will make no assurance as to my future life. I cannot even guess what may become of me. It may be that I shall come to live on board some ship so that I may be all alone. But with my heart as it is now I cannot bear the references which others make to me about empty pleasures.\" At the same time he sold his horses, but he said nothing to her as to that. \n \n Gradually he did acknowledge to himself that it was her doom to die early,—almost acknowledged to himself that she was dying. Nevertheless he still thought that it would have been fit that they should be married. \"If I knew that she were my own even on her deathbed,\" he once said to Mrs. Roden, \"there would be a comfort to me in it.\" He was so eager in this that Mrs. Roden was almost convinced. The Quaker was willing that it should be so,—but willing also that it should not be so. He would not even try to persuade his girl as to anything. It was his doom to see her go, and he, having realized that, could not bring himself to use a word in opposition to her word. But Marion herself was sternly determined against the suggestion. It was unfitting, she said, and would be wicked. It was not the meaning of marriage. She could not bring herself to disturb the last thoughts of her life, not only by the empty assumption of a grand name, but by the sounding of that name in her ears from the eager lips of those around her. \"I will be your love to the end,\" she said, \"your own Marion. But I will not be made a Countess, only in order that a vain name may be carved over my grave.\" \"God has provided a bitter cup for your lips, my love,\" she wrote again, \"in having put it into your head to love one whom you must lose so soon. And mine is bitter because yours is bitter. But we cannot rid ourselves of the bitterness by pretences. Would it make your heart light to see me dressed up for a bridal ceremony, knowing, as you would know, that it was all for nothing? My lord, my love, let us take it as God has provided it. It is only because you grieve that I grieve;—for you and my poor father. If you could only bring yourself to be reconciled, then it would be so much to me to have had you to love me in my last moments,—to love me and to be loved.\" \n \n He could not but accept her decision. Her father and Mrs. Roden accepted it, and he was forced to do so also. He acknowledged to himself now that there was no appeal from it. Her very weakness gave her a strength which dominated him. There was an end of all his arguments and his strong phrases. He was aware that they had been of no service to him,—that her soft words had been stronger than all his reasonings. But not on that account did he cease to wish that it might be as he had once wished, since he had first acknowledged to himself his love. \"Of course I will not drive her,\" he said to Mrs. Roden, when that lady urged upon him the propriety of abstaining from a renewal of his request. \"Had I any power of driving her, as you say, I would not do so. I think it would be better. That is all. Of course it must be as she shall decide.\" \n \n \"It would be a comfort to her to think that you and she thought alike about all things,\" said Mrs. Roden. \n \n \"There are points on which I cannot alter my convictions even for her comfort,\" he answered. \"She bids me love some other woman. Can I comfort her by doing that? She bids me seek another wife. Can I do that;—or say that I will do it at some future time? It would comfort her to know that I have no wound,—that I am not lame and sick and sore and weary. It would comfort her to know that my heart is not broken. How am I to do that for her?\" \n \n \"No;\"—said Mrs. Roden—\"no.\" \n \n \"There is no comfort. Her imagination paints for her some future bliss, which shall not be so far away as to be made dim by distance,—in enjoying which we two shall be together, as we are here, with our hands free to grasp each other, and our lips free to kiss;—a heaven, but still a heaven of this world, in which we can hang upon each other\u0027s necks and be warm to each other\u0027s hearts. That is to be, to her, the reward of her innocence, and in the ecstacy of her faith she believes in it, as though it were here. I do think,—I do think,—that if I told her that it should be so, that I trusted to renew my gaze upon her beauty after a few short years, then she would be happy entirely. It would be for an eternity, and without the fear of separation.\" \n \n \"Then why not profess as she does?\" \n \n \"A lie? As I know her truth when she tells me her creed, so would she know my falsehood, and the lie would be vain.\" \n \n \"Is there then to be no future world, Lord Hampstead?\" \n \n \"Who has said so? Certainly not I. I cannot conceive that I shall perish altogether. I do not think that if, while I am here, I can tame the selfishness of self, I shall reach a step upwards in that world which shall come next after this. As to happiness, I do not venture to think much of it. If I can only be somewhat nobler,—somewhat more like the Christ whom we worship,—that will be enough without happiness. If there be truth in this story, He was not happy. Why should I look for happiness,—unless it be when the struggle of many worlds shall have altogether purified my spirit? But thinking like that,—believing like that,—how can I enter into the sweet Epicurean Paradise which that child has prepared for herself?\" \n \n \"Is it no better than that?\" \n \n \"What can be better, what can be purer,—if only it be true? And though it be false to me, it may be true to her. It is for my sake that she dreams of her Paradise,—that my wounds may be made whole, that my heart may be cured. Christ\u0027s lesson has been so learned by her that no further learning seems necessary. I fancy sometimes that I can see the platform raised just one step above the ground on which I stand,—and look into the higher world to which I am ascending. It may be that it is given to her to look up the one rung of the ladder by mounting which she shall find herself enveloped in the full glory of perfection.\" \n \n In conversations such as these Mrs. Roden was confounded by the depth of the man\u0027s love. It became impossible to bid him not be of a broken heart, or even to allude to those fresh hopes which Time would bring. He spoke to her often of his future life, always speaking of a life from which Marion would have been withdrawn by death, and did so with a cold, passionless assurance which showed her that he had almost resolved as to the future. He would see all lands that were to be seen, and converse with all people. The social condition of God\u0027s creatures at large should be his study. The task would be endless, and, as he said, an endless task hardly admits of absolute misery. \"If I die there will be an end of it. If I live till old age shall have made me powerless to carry on my work, time will then probably have done something to dim the feeling.\" \"I think,\" he said again;—\"I feel that could I but remember her as my wife—\" \n \n \"It is impossible,\" said Mrs. Roden. \n \n \"But if it were so! It would be no more than a thin threadbare cloak over a woman\u0027s shivering shoulders. It is not much against the cold; but it would be very cruel to take that little from her.\" She looked at him with her eyes flooded with tears, but she could only shake her head in sign that it was impossible. \n \n At last, just at the end of July, there came a request that he would go down to Pegwell Bay. \"It is so long since we have seen each other,\" she wrote, \"and, perhaps, it is better that you should come than that I should go. The doctor is fidgety, and says so. But my darling will be good to me;—will he not? When I have seen a tear in your eyes it has gone near to crush me. That a woman, or even a man, should weep at some unexpected tidings of woe is natural. But who cries for spilt milk? Tell me that God\u0027s hand, though it be heavy to you, shall be borne with reverence and obedience and love.\" \n \n He did not tell her this, but he resolved that if possible she should see no tears. As for that cheerfulness, that reconciliation to his fate which she desired, he knew it to be impossible. He almost brought himself to believe as he travelled down to Pegwell Bay that it would be better that they should not meet. To thank the Lord for all His mercies was in her mind. To complain with all the bitterness of his heart of the cruelty with which he was treated was in his. He had told Mrs. Roden that according to his creed there would be a better world to come for him if he could succeed in taming the selfishness of self. But he told himself now that the struggle to do so had hitherto been vain. There had been but the one thing which had ever been to him supremely desirable. He had gone through the years of his early life forming some Utopian ideas,—dreaming of some perfection in politics, in philanthropy, in social reform, and the like,—something by devoting himself to which he could make his life a joy to himself. Then this girl had come across him, and there had suddenly sprung up within him a love so strong that all these other things faded into littlenesses. They should not be discarded. Work would be wanted for his life, and for hers. But here he had found the true salt by which all his work would be vivified and preserved and made holy and happy and glorious. There had come a something to him that was all that he wanted it to be. And now the something was fading from him,—was already all but gone. In such a state how should he tame the selfishness of self? He abandoned the attempt, and told himself that difficulties had been prepared for him greater than any of which he had dreamed when he had hoped that that taming might be within his power. He could not even spare her in his selfishness. He declared to himself that it was so, and almost owned that it would be better that he should not go to her. \n \n \"Yes,\" she said, when he sat down beside her on her sofa, at an open window looking out on the little bay, \"put your hand on mine, dear, and leave it there. To have you with me, to feel the little breeze, and to see you and to touch you is absolute happiness.\" \n \n \"Why did you so often tell me not to come?\" \n \n \"Ah, why? But I know why it was, my lord.\" There was something half of tenderness, half pleasantry in the mode of address, and now he had ceased to rebel against it. \n \n \"Why should I not come if it be a joy to you?\" \n \n \"You must not be angry now.\" \n \n \"Certainly not angry.\" \n \n \"We have got through all that,—you and I have for ourselves;—but there is a sort of unseemliness in your coming down here to see a poor Quaker\u0027s daughter.\" \n \n \"Marion!\" \n \n \"But there is. We had got through all that in Paradise Row. Paradise Row had become used to you, and I could bear it. But here— They will all be sure to know who you are.\" \n \n \"Who cares?\" \n \n \"That Marion Fay should have a lover would of itself make a stir in this little place;—but that she should have a lord for her lover! One doesn\u0027t want to be looked at as a miracle.\" \n \n \"The follies of others should not ruffle you and me.\" \n \n \"That\u0027s very well, dear;—but what if one is ruffled? But I won\u0027t be ruffled, and you shall come. When I thought that I should go again to our own house, then I thought we might perhaps dispense with the ruffling;—that was all.\" \n \n There was a something in these words which he could not stand,—which he could not bear and repress that tear which, as she had said, would go near to crush her if she saw it. Had she not plainly intimated her conviction that she would never again return to her old home? Here, here in this very spot, the doom was to come, and to come quickly. He got up and walked across the room, and stood a little behind her, where she could not see his face. \n \n \"Do not leave me,\" she said. \"I told you to stay and let your hand rest on mine.\" Then he returned, and laying his hand once again upon her lap turned his face away from her. \"Bear it,\" she said. \"Bear it.\" His hand quivered where it lay as he shook his head. \"Call upon your courage and bear it.\" \n \n \"I cannot bear it,\" he said, rising suddenly from his chair, and hurrying out of the room. He went out of the room and from the house, on to the little terrace which ran in front of the sea. But his escape was of no use to him; he could not leave her. He had come out without his hat, and he could not stand there in the sun to be stared at. \"I am a coward,\" he said, going back to her and resuming his chair. \"I own it. Let there be no more said about it. When a trouble comes to me, it conquers me. Little troubles I think I could bear. If it had been all else in all the world,—if it had been my life before my life was your life, I think that no one would have seen me blench. But now I find that when I am really tried, I fail.\" \n \n \"It is in God\u0027s hands, dearest.\" \n \n \"Yes;—it is in God\u0027s hands. There is some power, no doubt, that makes you strong in spirit, but frail in body; while I am strong to live but weak of heart. But how will that help me?\" \n \n \"Oh, Lord Hampstead, I do so wish you had never seen me.\" \n \n \"You should not say that, Marion; you shall not think it. I am ungrateful; because, were it given me to have it all back again, I would not sell what I have had of you, though the possession has been so limited, for all other imaginable treasures. I will bear it. Oh, my love, I will bear it. Do not say again that you wish you had not seen me.\" \n \n \"For myself, dear,—for myself—\" \n \n \"Do not say it for me. I will struggle to make a joy of it, a joy in some degree, though my heart bleeds at the widowhood that is coming on it. I will build up for myself a memory in which there shall be much to satisfy me. I shall have been loved by her to have possessed whose love has been and shall be a glory to me.\" \n \n \"Loved indeed, my darling.\" \n \n \"Though there might have been such a heaven of joy, even that shall be counted as much. It shall be to me during my future life as though when wandering through the green fields in some long-past day, I had met a bright angel from another world; and the angel had stopped to speak to me, and had surrounded me with her glorious wings, and had given me of her heavenly light, and had spoken to me with the music of the spheres, and I had thought that she would stay with me for ever. But there had come a noise of the drums and a sound of the trumpets, and she had flown away from me up to her own abode. To have been so favoured, though it had been but for an hour, should suffice for a man\u0027s life. I will bear it, though it be in solitude.\" \n \n \"No, darling; not in solitude.\" \n \n \"It will be best so for me. The light and the music and the azure of the wings will so remain with me the purer and the brighter. Oh,—if it had been! But I will bear it. No ear shall again hear a sound of complaint. Not yours even, my darling, my own, mine for so short a time, but yet my very own for ever and ever.\" Then he fell on his knees beside her, and hid his face in her dress, while the fingers of both her hands rambled through his hair. \"You are going,\" he said, when he rose up to his feet, \"you are going whither I cannot go.\" \n \n \"You will come; you will come to me.\" \n \n \"You are going now, now soon, and I doubt not that you are going to joys inexpressible. I cannot go till some chance may take me. If it be given to you in that further world to see those and to think of those whom you have left below, then, if my heart be true to your heart, keep your heart true to mine. If I can fancy that, if I can believe that it is so, then shall I have that angel with me, and though my eyes may not see the tints, my ears will hear the music;—and though the glory be not palpable as is the light of heaven, there will be an inner glory in which my soul will be sanctified.\" After that there were not many words spoken between them, though he remained there till he was disturbed by the Quaker\u0027s coming. Part of the time she slept with her hand in his, and when awake she was contented to feel his touch as he folded the scarf close round her neck and straightened the shawl which lay across her feet, and now and again stroked her hair and put it back behind her ears as it strayed upon her forehead. Ever and again she would murmur a word or two of love as she revelled in the perception of his solicitude. What was there for her to regret, for her to whom was given the luxury of such love? Was not a month of it more than a whole life without it? Then, when the father came, Hampstead took his leave. As he kissed her lips, something seemed to tell him that it would be for the last time. It was not good, the Quaker had said, that she should be disturbed. Yes; he could come again; but not quite yet. \n \n At the very moment when the Quaker so spoke she was pressing her lips to his. \"God keep you and take you, my darling,\" she whispered to him, \"and bring you to me in heaven.\" She noticed not at all at the moment the warm tears that were running on to her own face; nor did the Quaker seem to notice it when Lord Hampstead left the house without saying to him a word of farewell. \n \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2737/75409.html","bookId":1384,"book":{"id":1384,"title":"Marion Fay","description":"简介： When Mr. Lionel Trafford went into Parliament for the Borough of Wednesbury as an advanced Radical, it nearly broke the heart of his uncle, the old Marquis of Kingsbury. Among Tories of his day the Marquis had been hyper-Tory,as were his friends, the...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2737","creation":"Aug 1, 2019 12:24:58 AM","modification":"Aug 1, 2019 12:24:58 AM"}}
