{"id":68887,"no":18,"title":"Page 18","content":"Maybe it\u0027s the weather, Paige thought wearily. It was cold and dreary outside, with a gray driving rain that depressed the spirits. Her day had begun at six o\u0027clock in the morning, and it was filled with constant problems. The hospital seemed tc be full of gomers, all complaining at once. The nurses were surly and careless. They drew blood from the wrong patients, lost X-rays that were urgently needed, and snapped at the patients. In addition, there was a staff shortage because of a flu epidemic. It was that kind of day.\n The only bright spot was the telephone call from Jason Curtis.\n \"Hello,\" he said cheerily. \"Just thought I\u0027d check in and see how all our patients are doing.\"\n \"They\u0027re surviving.\"\n \"Any chance of our having lunch?\"\n Paige laughed. \"What\u0027s lunch? If I\u0027m lucky, I\u0027ll be able to grab a stale sandwich about four o\u0027clock this afternoon. It\u0027s pretty hectic around here.\"\n \"All right. I won\u0027t keep you. May I call you again?\"\n \"All right.\" No harm in that.\n \"Bye.\"\n Paige worked until midnight without a moment to rest, and when she was finally relieved, she was almost too tired to move. She briefly debated staying at the hospital and sleeping on the cot in the on-call room, but the thought of her warm, cozy bed at home was too tempting. She changed clothes and lurched her way to the elevator.\n Dr. Peterson came up to her. \"My God!\" he said. \"Where\u0027s the cat that dragged you in?\"\n Paige smiled wearily. \"Do I look that bad?\"\n \"Worse.\" Peterson grinned. \"You\u0027re going home now?\"\n Paige nodded.\n \"You\u0027re lucky. I\u0027m just starting.\"\n The elevator arrived. Paige stood there half asleep.\n Peterson said gently, \"Paige?\"\n She shook herself awake. \"Yes?\"\n \"Are you going to be able to drive home?\"\n \"Sure,\" Paige mumbled. \"And when I get there, I\u0027m going to sleep for twenty-four hours straight.\"\n She walked to the parking lot and got into her car. She sat there drained, too tired to turn on the ignition. I mustn\u0027t go to sleep here. I\u0027ll sleep at home.\n Paige drove out of the parking lot and headed toward the apartment. She was unaware of how erratically she was driving until a driver yelled at her, \"Hey, get off the road, you drunken broad!\"\n She forced herself to concentrate. I must not fall asleep ... I must not fall asleep. She snapped the radio on and turned the volume up loud. When she reached her apartment building, she sat in the car for a long time before she was able to summon enough strength to go upstairs.\n Kat and Honey were in their beds, asleep. Paige looked at the clock at her bedside. One o\u0027clock in the morning. She stumbled into her bedroom and started to get undressed, but the effort was too much for her. She fell into bed with her clothes on, and in an instant was sound asleep.\n She was awakened by the shrill ringing of a telephone that seemed to be coming from some far-off planet. Paige fought to stay asleep, but the ringing was like needles penetrating her brain. She sat up groggily and reached for the phone. \"H\u0027lo?\"\n \"Dr. Taylor?\"\n \"Yes.\" Her voice was a hoarse mumble.\n \"Dr. Barker wants you in OR Four to assist him, stat.\"\n Paige cleared her throat. \"There must be some mistake,\" she mumbled. \"I just got off duty.\"\n \"OR Four. He\u0027s waiting.\" The line went dead.\n Paige sat on the edge of the bed, numb, her mind clouded by sleep. She looked at the clock on the bedside table. Four-fifteen. Why was Dr. Barker asking for her in the middle of the night? There was only one answer. Something had happened to one of her patients.\n Paige staggered into the bathroom and threw cold water on her face. She looked in the mirror and thought,\n My Godl I look like my mother. No. My mother never looked this bad.\n Ten minutes later, Paige was making her way back to the hospital. She was still half asleep when she took the elevator to the fourth floor to OR Four. She went into the dressing room and changed, then scrubbed up and stepped into the operating room.\n There were three nurses and a resident assisting Dr. Barker.\n He looked up as Paige entered and yelled, \"For Christ\u0027s sake, you\u0027re wearing a hospital gown! Didn\u0027t anyone ever inform you that you\u0027re supposed to wear scrubs in an operating room?\"\n Paige stood there, stunned, jolted wide awake, her eyes blazing. \"You listen to me,\" she said, furiously. \"I\u0027m supposed to be off duty. I came in as a favor to you. I don\u0027t - \"\n \"Don\u0027t argue with me,\" Dr. Barker said curtly. \"Get over here and hold this retractor.\"\n Paige walked over to the operating table and looked down. It was not her patient on the table. It was a stranger. Barker had no reason to call me. He\u0027s trying to force me to quit the hospital. Well, I\u0027ll be damned if I willl She gave him a baleful look, picked up the retractor, and went to work.\n The operation was an emergency coronary artery bypass graft. The skin incision had already been made down the center of the chest to the breastbone, which had been split with an electric saw. The heart and major blood vessels were exposed.\n Paige inserted the metal retractor between the cut sides of the breastbone, forcing the edges apart. She watched as Dr. Barker skillfully opened the pericardial sac, exposing the heart.\n He indicated the coronary arteries. \"Here\u0027s the problem,\" Barkersaid. \"We\u0027re going to do some grafting.\"\n He had already removed a long strip of vein from one leg. He sewed a piece of it into the main artery coming out of the heart. The other end he attached to one of the coronary arteries, beyond the obstructed area, sending the blood through the vein graft, bypassing the obstruction.\n Paige was watching a master at work. If only he weren\u0027t such a bastardl\n The operation took three hours. By the time it was over, Paige was only half conscious. When the incision had been closed, Dr. Barker turned to the staff and said, \"I want to thank all of you.\" He was not looking at Paige.\n Paige stumbled out of the room without a word and went upstairs to the office of Dr. Benjamin Wallace.\n Wallace was just arriving. \"You look exhausted,\" he said. \"You should get some rest.\"\n Paige took a deep breath to control her anger. \"I want to be transferred to another surgical team.\"\n Wallace studied her a moment. \"You\u0027re assigned to Dr. Barker, right?\"\n \"Right.\"\n \"What\u0027s the problem?\"\n \"Ask him. He hates me. He\u0027ll be glad to get rid of me. I\u0027ll go with anyone else. Anyone.\"\n \"I\u0027ll talk to him,\" Wallace said.\n \"Thank you.\"\n Paige turned and walked out of the office. They\u0027d better take me away from him. If I see him again, I\u0027ll kill him.\n Paige went home and slept for twelve hours. She woke up with a feeling that something wonderful had happened, and then she remembered. I don\u0027t have to see the Beast anymore! She drove to the hospital, whistling.\n As Paige was walking down the corridor, an orderly came up to her. \"Dr. Taylor ...\"\n \"Yes?\"\n \"Dr. Wallace would like to see you in his office.\"\n \"Thank you,\" Paige said. She wondered who the new senior surgeon would be. Anybody will be an improvement, Paige thought. She walked into Benjamin Wallace\u0027s office.\n \"Well, you look much better today, Paige.\"\n \"Thanks. I feel much better.\" And she did. She felt great, filled with an enormous sense of relief.\n \"I talked to Dr. Barker.\"\n Paige smiled. \"Thank you. I really appreciate it.\"\n \"He won\u0027t let you go.\"\n Paige\u0027s smile faded. What?\n \"He said you\u0027re assigned to his team and you\u0027ll stay there.\"\n She could not believe what she was hearing. \"But why?\" She knew why. The sadistic bastard needed a whipping girl, someone to humiliate. \"I\u0027m not going to stand for it.\"\n Dr. Wallace said ruefully, \"I\u0027m afraid you have no choice. Unless you want to leave the hospital. Would you like to think about it?\"\n Paige did not have to think about it. \"No.\" She was not going to let Barker force her to quit. That was his plan. \"No,\" she repeated slowly. \"I\u0027ll stay.\"\n \"Good. Then that\u0027s settled.\"\n Not by a long shot, Paige thought. I\u0027m going to find some way to pay him back.\n In the doctors\u0027 dressing room, Ken Mallory was getting ready to make his rounds. Dr. Grundy and three other doctors walked in.\n \"There\u0027s our man!\" Grundy said. \"How are you doing, Ken?\"\n \"Fine,\" Mallory said.\n Grundy turned to the others. \"He doesn\u0027t look like he just got laid, does he?\" He turned back to Mallory. \"I hope you have our money ready. I plan to make a down payment on a little car.\"\n Another doctor joined in. \"I\u0027m buying a whole new wardrobe.\"\n Mallory shook his head pityingly. \"I wouldn\u0027t count on it, suckers. Get ready to pay me off!\"\n Grundy was studying him. \"What do you mean?\"\n \"If she\u0027s a lesbian, I\u0027m a eunuch. She\u0027s the horniest broad I ever met. I practically had to hold her off the other night!\"\n The men were looking at one another, worried.\n \"But you didn\u0027t get her into the sack?\"\n \"The only reason I didn\u0027t, my friends, is because we were interrupted on the way to the bedroom. I have a date with her Saturday night, and it will all be over but the shouting.\" Mallory finished dressing. \"Now, if you gentlemen will excuse me ...\"\n An hour later, Grundy stopped Kat in the corridor.\n \"I\u0027ve been looking for you,\" he said. He looked angry.\n \"Is something wrong?\"\n \"It\u0027s that bastard Mallory. He\u0027s so sure of himself that he\u0027s telling everyone he\u0027s going to get you into bed by Saturday night.\"\n \"Don\u0027t worry,\" Kat said grimly. \"He\u0027s going to lose.\"\n When Ken Mallory picked Kat up Saturday night, she had on a low-cut dress that accentuated her voluptuous figure.\n \"You look gorgeous,\" he said admiringly.\n She put her arms around him. \"I want to look good for you.\" She was clinging to him.\n God, she really wants it. When Mallory spoke, his voice was husky. \"Look, I have an idea, Kat. Before we go out to dinner, why don\u0027t we slip into the bedroom and ...\"\n She was stroking his face. \"Oh, darling, I wish we could. Paige is home.\" Paige was actually at the hospital, working.\n \"Oh.\"\n \"But after dinner ...\" She let the suggestion hang in the air.\n \"Yes?\"\n \"We could go to your place.\"\n Mallory put his arms around her and kissed her. \"That\u0027s a wonderful idea!\"\n He took her to the Iron Horse, and they had a delicious dinner. In spite of herself, Kat was having a wonderful time. He was charming and amusing, and incredibly attractive. He seemed genuinely interested in knowing everything about her. She knew he was flattering her, but he really seemed to mean the compliments he paid her.\n If I didn\u0027t know better ...\n Mallory had hardly tasted his food. All he could think was, In two hours I will be making ten thousand dollars... . In one hour, I will be making ten thousand dollars... . In thirty minutes ...\n They finished their coffee.\n \"Are you ready?\" Mallory asked.\n Kat put her hand over his. \"You have no idea how ready, darling. Let\u0027s go.\"\n They took a taxi to Mallory\u0027s apartment. \"I\u0027m absolutely crazy about you,\" Mallory murmured. \"I\u0027ve never known anyone like you.\"\n And she could hear Grundy\u0027s voice: He\u0027s so sure of himself that he says he\u0027s going to get you into bed by Saturday night.\n When they arrived at the apartment, Mallory paid the taxi driver and led Kat into the elevator. It seemed to Mallory to take forever to get up to his apartment. He opened the door and said eagerly, \"Here it is.\"\n Kat stepped inside.\n It was an ordinary little bachelor\u0027s apartment that desperately needed a woman\u0027s touch.\n \"Oh, it\u0027s lovely,\" Kat breathed. She turned to Mallory. \"It\u0027s you.\u0027\"\n He grinned. \"Let me show you our room. I\u0027ll put some music on.\"\n As he went over to the tape deck, Kat glanced at her watch. The voice of Barbra Streisand filled the room.\n Mallory took her hand. \"Let\u0027s go, honey.\"\n \"Wait a minute,\" Kat said softly.\n He was looking at her, puzzled. \"What for?\"\n \"I just want to enjoy this moment with you. You know, before we ...\"\n \"Why don\u0027t we enjoy it in the bedroom?\"\n \"I\u0027d love a drink.\"\n \"A drink?\" He tried to hide his impatience. \"Fine. What would you like?\"\n \"A vodka and tonic, please.\"\n He smiled. \"I think we can handle that.\" He went over to the little bar and hurriedly mixed two drinks.\n Kat looked at her watch again.\n Mallory returned with the drinks and handed one to Kat. \"Here you are, baby.\" He raised his glass. \"To togetherness.\"\n \"To togetherness,\" Kat said. She took a sip of the drink. \"Oh, my God!\"\n He looked at her, startled. \"What\u0027s the matter?\"\n \"This is vodka!\"\n \"That\u0027s what you asked for.\"\n \"Did I? I\u0027m sorry. I hate vodka!\" She stroked his face. \"May I have a scotch and soda?\"\n \"Sure.\" He swallowed his impatience and went back to the bar to mix another drink.\n Kat glanced at her watch again.\n Ken Mallory returned. \"Here you are.\"\n \"Thank you, darling.\"\n She took two sips of her drink. Mallory took the glass from her and set it on a table. He put his arms around Kat and held her close, and she could feel that he was aroused.\n \"Now,\" Ken said softly, \"let\u0027s make history.\"\n \"Oh, yes!\" Kat said. \"Yes!\"\n She let him lead her into the bedroom.\n I\u0027ve done it! Mallory exulted. I\u0027ve done it. Here go the walls of Jericho! He turned to Kat. \"Get undressed, baby.\"\n \"You first, darling. I want to watch you get un dressed. It excites me.\"\n \"Oh? Well, sure.\"\n As Kat stood there watching, Mallory slowly took his clothes off. First his jacket, then his shirt and tie, then his shoes and stockings, and then his trousers. He had the firm figure of an athlete.\n \"Does this excite you, baby?\"\n \"Oh, yes. Now take off your shorts.\"\n Slowly Mallory let his shorts fall to the floor. He had a turgid erection.\n \"That\u0027s beautiful,\" Kat said.\n \"Now it\u0027s your turn.\"\n \"Right.\"\n And at that moment, Kat\u0027s beeper went off.\n Mallory was startled. \"What the hell ...?\"\n \"They\u0027re calling me,\" Kat said. \"May I use your telephone?\"\n \"Now?\"\n \"Yes. It must be an emergency.\"\n \"Wow? Can\u0027t it wait?\"\n \"Darling, you know the rules.\"\n \"But ...\"\n As Mallory watched, Kat walked over to the telephone and dialed a number. \"Dr. Hunter.\" She listened. \"Really? Of course. I\u0027ll be right there.\"\n Mallory was staring at her, stupefied. \"What\u0027s going on?\"\n \"I have to get back to the hospital, angel.\"\n \"Now?\"\n \"Yes. One of my patients is dying.\"\n \"Can\u0027t he wait until ... ?\"\n \"I\u0027m sorry. We\u0027ll do this another night.\"\n Ken Mallory stood there, buck naked, watching Kat walk out of his apartment, and as the door closed behind her, he picked up her drink and slammed it into the wall. Bitch ... bitch ... bitch ...\n When Kat got back to the apartment, Paige and Honey were eagerly waiting for her.\n \"How did it go?\" Paige asked. \"Was I on time?\"\n Kat laughed. \"Your timing was perfect.\"\n She began to describe the evening. When she came to the part about Mallory standing in the bedroom naked, with an erection, they laughed until tears came to their eyes.\n Kat was tempted to tell them how enjoyable she really found Ken Mallory, but she felt foolish. After all, he was seeing her only so he could win a bet.\n Somehow, Paige seemed to sense how Kat felt. \"Be careful of him, Kat.\"\n Kat smiled. \"Don\u0027t worry. But I will admit that if I didn\u0027t know about that bet ... He\u0027s a snake, but he gives good snake oil.\"\n \"When are you going to see him again?\" Honey asked.\n \"I\u0027m going to give him a week to cool off.\" Paige was studying her. \"Him or you?\"\n Dinetto\u0027s black limousine was waiting outside the hospital for Kat. This time, the Shadow was alone. Kat wished that Rhino were there. There was something about the Shadow that petrified her. He never smiled and seldom spoke, but he exuded menace.\n \"Get in,\" he said as Kat approached the car.\n \"Look,\" Kat said indignantly, \"you tell Mr. Dinetto that he can\u0027t order me around. I don\u0027t work for him. Just because I did him a favor once ...\"\n \"Get in. You can tell him yourself.\"\n Kat hesitated. It would be easy to walk away and not get involved any further, but how would it affect Mike? Kat got into the car.\n The victim this time had been badly beaten, whipped with a chain. Lou Dinetto was there with him.\n Kat took one look at the patient and said, \"You\u0027ve got to get him to a hospital right away.\"\n \"Kat,\" Dinetto said, \"you have to treat him here.\"\n \"Why?\" Kat demanded. But she knew the answer, and it terrified her. \n","sourceLink":"https://allnovel.net/nothing-lasts-forever/page-18.html","bookId":2365,"book":{"id":2365,"title":"Nothing Lasts Forever","description":"Storyline: \n Three young doctors-their hopes, their dreams, their unexpected desires... \n Dr. Paige Taylor: She swore it was euthanasia, but when Paige inherited a million dollars from a patient, the D.A. called it murder. \n Dr. Kat Hunter: She vowed never to let another man too close again-until she accepted the challenge of a deadly bet. \n Dr. Honey Taft: To make it in medicine, she knew she\u0027d need something more than the brains God gave her. \n Racing from the life-and-death decisions of a big major hospital to the tension-packed fireworks of a murder trial, Nothing Lasts Forever lays bare the ambitions and fears of healers and killers, lovers and betrayers.\n \n","cover":"https://allnovel.net/images/nothing-lasts-forever.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/nothing-lasts-forever.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:10:57 AM"}}
