{"id":68897,"no":23,"title":"Page 23","content":"Ci ode Red is an alert that immediately brings all-out medical assistance to try to save the life of a patient. When Lou Dinetto\u0027s heart stopped in the middle of his operation, the operating room Code Red team rushed to give aid.\n Over the public address system Kat could hear, \"Code Red, OR Three... . Code Red ...\" Red rhymes with dead.\n Kat was in a panic. She applied the electroshock again. It was not only his life she was trying to save - it was Mike\u0027s and her own. Dinetto\u0027s body leaped into the air, then fell back, inert.\n \"Try once more!\" Dr. Vance urged.\n We don\u0027t threaten people, doc. We\u0027re telling you. If Mr. Dinetto dies, you and your fucking family are gonna be wiped out.\n Kat turned on the switch and applied the machine to Dinetto\u0027s chest again. Once more his body rose a few inches into the air and then fell back.\n \"Again!\"\n It\u0027s not going to happen, Kat thought despairingly. I\u0027m going to die with him.\n The operating room was suddenly filled with doctors and nurses.\n \"What are you waiting for?\" someone asked.\n Kat took a deep breath and pressed down once again. For an instant, nothing happened. Then a faint blip appeared on the monitor. It faltered a moment, then appeared again and faltered, and then began to grow stronger and stronger, until it became a steady, stabilized rhythm.\n Kat stared at it unbelievingly.\n There was a cheer from the crowded room. \"He\u0027s going to make it!\" someone yelled.\n \"Jesus, that was close!\"\n They have no idea how close, Kat thought.\n Two hours later, Lou Dinetto was off the table and on a gurney, on his way back to intensive care. Kat was at his side. Rhino and the Shadow were waiting in the corridor.\n \"The operation was successful,\" Kat said. \"He\u0027s going to be fine.\"\n Ken Mallory was in deep trouble. It was the last day to make good on his bet. The problem had been growing so gradually that he had hardly been aware of it. From almost the first night, he had been positive that he would have no trouble getting Kat into bed. Trouble? She\u0027s eager it! Now his time was up, and he was facing disaster.\n Mallory thought about all the things that had gone wrong - Kat\u0027s roommates coming in just as she was about to go to bed with him, the difficulty of getting together for a date, Kat\u0027s being called away by her beeper and leaving him standing naked, her cousin coming to town, her oversleeping, her period. He stopped suddenly and thought, Wait a minutel They couldn\u0027t have all been coincidences. Kat was doing this to him deliberately! She had somehow gotten wind of the bet, and had decided to make a fool of him, to play a joke on him, a joke that was going to cost him ten thousand dollars that he didn\u0027t have. The bitchl He was no closer to winning than he had been at the beginning. She had deliberately led him on. How the hell did I let myself get into this! He knew there was no way he could come up with the money.\n When Mallory walked into the doctors\u0027 dressing room, they were waiting for him.\n \"Payoff day!\" Grundy sang out.\n Mallory forced a smile. \"I have until midnight, right? Believe me, she\u0027s ready, fellows.\"\n There was a snicker. \"Sure. We\u0027ll believe you when we hear it from the lady herself. Just have the cash ready in the morning.\"\n Mallory laughed. \"You\u0027d better have yours ready!\"\n He had to find a way. And suddenly he had the answer.\n Ken Mallory found Kat in the lounge. He sat down opposite her. \"I hear you saved a patient\u0027s life.\" \"And my own.\" \"What?\"\n \"Nothing.\"\n \"How would you like to save my life?\"\n Kat looked at him quizzically.\n \"Have dinner with me tonight.\"\n \"I\u0027m too tired, Ken.\" She was weary of the game she was playing with him. I\u0027ve had enough, Kat thought. It\u0027s time to stop. It\u0027s over. I\u0027ve fallen into my own trap. She wished he were a different kind of man. If only he had been honest with her. I really could have cared for him, Kat thought.\n There was no way Mallory was going to let Kat get away. \"We\u0027ll make it an early night,\" he coaxed. \"You have to have dinner somewhere.\"\n Reluctantly, Kat nodded. She knew it was going to be the last time. She was going to tell him she knew about the bet. She was going to end the game. \"All right.\"\n Honey finished her shift at 4:00 P.M. She looked at her watch and decided that she had just enough time to do some quick shopping. She went to the Candelier to buy some candles for the apartment, then to the San Francisco Tea and Coffee Company so there would be some drinkable coffee for breakfast, and on to Chris Kelly for linens.\n Loaded down with packages, Honey headed for the apartment. I\u0027ll fix myself some dinner at home, Honey decided. She knew that Kat had a date with Mallory, and that Paige was on call.\n Fumbling with her packages, Honey entered the apartment and closed the door behind her. She switched on the light. A huge black man was coming out of the\n bathroom, dripping blood on the white carpet. He was pointing a gun at her.\n \"Make one sound, and I\u0027ll blow your fucking head off!\"\n Honey screamed. \n","sourceLink":"https://allnovel.net/nothing-lasts-forever/page-23.html","bookId":2365,"book":{"id":2365,"title":"Nothing Lasts Forever","description":"Storyline: \n Three young doctors-their hopes, their dreams, their unexpected desires... \n Dr. Paige Taylor: She swore it was euthanasia, but when Paige inherited a million dollars from a patient, the D.A. called it murder. \n Dr. Kat Hunter: She vowed never to let another man too close again-until she accepted the challenge of a deadly bet. \n Dr. Honey Taft: To make it in medicine, she knew she\u0027d need something more than the brains God gave her. \n Racing from the life-and-death decisions of a big major hospital to the tension-packed fireworks of a murder trial, Nothing Lasts Forever lays bare the ambitions and fears of healers and killers, lovers and betrayers.\n \n","cover":"https://allnovel.net/images/nothing-lasts-forever.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/nothing-lasts-forever.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:10:57 AM"}}
