{"id":68917,"no":33,"title":"Page 33","content":"Honey looked forward every day to seeing the patient in Room 306. His name was Sean Reilly, and he was a good-looking Irishman, with black hair and black sparkling eyes. Honey guessed that he was in his early forties.\n When Honey first met him on her rounds, she had looked at his chart and said, \"I see you\u0027re here for a cholecystectomy.\"\n \"I thought they were going to remove my gallbladder.\"\n Honey smiled. \"Same thing.\"\n Sean fixed his black eyes on her. \"They can cut out anything they want except my heart. That belongs to you.\"\n Honey laughed. \"Flattery will get you everywhere.\"\n \"I hope so, darlin\u0027.\"\n When Honey had a few minutes to spare, she would drop by and chat with Sean. He was charming and amusing.\n \"It\u0027s worth bein\u0027 operated on just to have you around, little darlin\u0027.\"\n \"You aren\u0027t nervous about the operation, are you?\" she asked.\n \"Not if you\u0027re going to operate, love.\"\n \"I\u0027m not a surgeon. I\u0027m an internist.\"\n \"Are internists allowed to have dinner with their patients?\"\n \"No. There\u0027s a rule against it.\"\n \"Do internists ever break rules?\"\n \"Never.\" Honey was smiling.\n \"I think you\u0027re beautiful,\" Sean said.\n No one had ever told Honey that before. She found herself blushing. \"Thank you.\"\n \"You\u0027re like the fresh mornin\u0027 dew in the fields of Killarney.\"\n \"Have you ever been to Ireland?\" Honey asked.\n He laughed. \"No, but I promise you we\u0027ll go there together one day. You\u0027ll see.\"\n It was ridiculous Irish blarney, and yet ...\n That afternoon when Honey went in to see Sean, she said, \"How are you feeling?\"\n \"The better for seeing you. Have you thought about our dinner date?\"\n \"No,\" Honey said. She was lying.\n \"I was hoping after my operation, I could take you out. You\u0027re not engaged, or married, or anything silly like that, are you?\"\n Honey smiled. \"Nothing silly like that.\"\n \"Good! Neither am I. Who would have me?\"\n A lot of women, Honey thought.\n \"If you like home cooking, I happen to be a great cook.\"\n \"We\u0027ll see.\"\n When Honey went to Sean\u0027s room the following morning, he said, \"I have a little present for you.\" He handed her a sheet of drawing paper. On it was a softened, idealized sketch of Honey.\n \"I love it!\" Honey said. \"You\u0027re a wonderful artist!\" And she suddenly remembered the psychic\u0027s words: You\u0027re going to fall in love. He\u0027s an artist. She was looking at Sean strangely.\n \"Is anything wrong?\"\n \"No,\" Honey said slowly. \"No.\"\n Five minutes later, Honey walked into Frances Gordon\u0027s room.\n \"Here comes the Virgo!\"\n Honey said, \"Do you remember telling me that I was going to fall in love with someone - an artist?\"\n \"Yes.\"\n \"Well, I ... I think I\u0027ve met him.\"\n Frances Gordon smiled. \"See? The stars never lie.\"\n \"Could ... could you tell me a little about him? About us?\"\n \"There are some tarot cards in that drawer over there. Could you give them to me, please?\"\n As Honey handed her the cards, she thought, This is ridiculous! I don\u0027t believe in this!\n Frances Gordon was laying out the cards. She kept nodding to herself, and nodding and smiling, and suddenly she stopped. Her face went pale. \"Oh, my God!\" She looked up at Honey.\n \"What ... what\u0027s the matter?\" Honey asked.\n \"This artist. You say you\u0027ve already met him?\"\n \"I think so. Yes.\"\n Frances Gordon\u0027s voice was filled with sadness. \"The poor man.\" She looked up at Honey. \"I\u0027m sorry ... I\u0027m so sorry.\"\n Sean Reilly was scheduled to have his operation the following morning.\n 8:15 A.M. Dr. William Radnor was in OR Two, preparing for the operation.\n 8:25 A.M. A truck containing a week\u0027s supply of bags of blood pulled up at the emergency entrance to Embarcadero County Hospital. The driver carried the bags to the blood bank in the basement. Eric Foster, the resident on duty, was sharing coffee and a danish with a pretty young nurse, Andrea.\n \"Where do you want these?\" the driver asked.\n \"Just set them down there.\" Foster pointed to a corner.\n \"Right.\" The driver put the bags down and pulled out a form. \"I need your John Hancock.\"\n \"Okay.\" Foster signed the form. \"Thanks.\"\n \"No sweat.\" The driver left.\n Foster turned to Andrea. \"Where were we?\"\n \"You were telling me how adorable I am.\"\n \"Right. If you weren\u0027t married, I\u0027d really go after you,\" the resident said. \"Do you ever fool around?\"\n \"No. My husband is a boxer.\"\n \"Oh. Do you have a sister?\"\n \"As a matter of fact, I do.\"\n \"Is she as pretty as you are?\"\n \"Prettier.\"\n \"What\u0027s her name?\"\n \"Marilyn.\"\n \"Why don\u0027t we double-date one night?\"\n As they chatted, the fax machine began to click. Foster ignored it.\n 8:45 A.M. Dr. Radnor began the operation on Sean Reilly. The beginning went smoothly. The operating room functioned like a well-oiled machine, run by capable people doing their jobs.\n 9:05 A.M. Dr. Radnor reached the cystic duct. A textbook operation up until then. As he started to excise the gallbladder, his hand slipped and the scalpel nicked an artery. Blood began to pour out.\n \"Jesus!\" He tried to stop the flow.\n The anesthesiologist called out, \"His blood pressure just dropped to ninety-five. He\u0027s going into shock!\"\n Radnor turned to the circulating nurse. \"Get some more blood up here, stat!\"\n \"Right away, doctor.\"\n 9:06 A.M. The telephone rang in the blood bank. \"Don\u0027t go away,\" Foster told Andrea. He walked past the fax machine, which had stopped clicking, and picked up the telephone. \"Blood supply.\"\n \"We need four units of Type O in OR Two, stat.\"\n \"Right.\" Foster replaced the receiver and went to the corner where the new blood had been deposited. He pulled out four bags and placed them on the top shelf of the metal cart used for such emergencies. He double-checked the bags. \"Type O,\" he said aloud. He rang for an orderly.\n \"What\u0027s going on?\" Andrea asked.\n Foster looked at the schedule in front of him. \"It looks like one of the patients is giving Dr. Radnor a bad time.\"\n 9:10 A.M. The orderly came into the blood bank. \"What have we got?\"\n \"Take this to OR Two. They\u0027re waiting for it.\"\n He watched the orderly wheel out the cart, then turned to Andrea. \"Tell me about your sister.\"\n \"She\u0027s married, too.\"\n \"Aw ...\"\n Andrea smiled. \"But she fools around.\"\n \"Does she really?\"\n \"I\u0027m only kidding. I have to go back to work, Eric. Thanks for the coffee and danish.\"\n \" Anytime.\" He watched her leave and thought, What a great ass!\n 9:12 A.M. The orderly was waiting for an elevator to take him to the second floor.\n 9:13 A.M. Dr. Radnor was doing his best to minimize the catastrophe. \"Where\u0027s the damned blood?\"\n 9:15 A.M. The orderly pushed at the door to OR Two and the circulating nurse opened it.\n \"Thanks,\" she said. She carried the bags into the room. \"It\u0027s here, doctor.\"\n \"Start pumping it into him. Fast!\"\n In the blood bank, Eric Foster finished his coffee, thinking about Andrea. All the good-looking ones are married.\n As he started toward his desk, he passed the fax machine. He pulled out the fax. It read:\n Recall Warning Alert #687, June 25: Red Blood Cells, Fresh Frozen Plasma. Units CB83711, CB800007. Community Blood Bank of California, Arizona, Washington, Oregon. Blood products testing repeatedly reactive for Antibody HIV Type I were distributed.\n He stared at it a moment, then walked over to his desk and picked up the invoice he had signed for the bags of blood that had just been delivered. He looked at the number on the invoice. The number on the warning was identical.\n \"Oh, my God!\" he said. He grabbed the telephone. \"Get me OR Two, fast!\"\n A nurse answered.\n \"This is the blood bank. I just sent up four units of Type O. Don\u0027t use it! I\u0027m sending up some fresh blood immediately.\" The nurse said, \"Sorry, it\u0027s too late.\"\n Dr. Radnor broke the news to Sean Reilly.\n \"It was a mistake,\" Radnor said. \"A terrible mistake. I would give anything if it had not happened.\"\n Sean was staring at him, in shock. \"My God! I\u0027m going to die.\"\n \"We won\u0027t know whether you\u0027re HIV-positive for six or eight weeks. And even if you are, that does not necessarily mean you will get AIDS. We\u0027re going to do everything we can for you.\"\n \"What the hell can you do for me that you haven\u0027t already done?\" Sean said bitterly. \"I\u0027m a dead man.\"\n When Honey heard the news, she was devastated. She remembered Frances Gordon\u0027s words. The poor man.\n Sean Reilly was asleep when Honey walked into his room. She sat at his bedside for a long time, watching him.\n He opened his eyes and saw Honey. \"I dreamed that I was dreaming, and that I wasn\u0027t going to die.\" \"Sean ...\"\n \"Did you come to visit the corpse?\" \"Please don\u0027t talk that way.\" \"How could this happen?\" he cried. \"Someone made a mistake, Sean.\" \"God, I don\u0027t want to die of AIDS!\"\n \"Some people who get HIV may never get AIDS. The Irish are lucky.\"\n \"I wish I could believe you.\"\n She took his hand in hers. \"You\u0027ve got to.\"\n \"I\u0027m not a praying man,\" Sean said, \"but I sure as hell am going to start now.\"\n \"I\u0027ll pray with you,\" Honey said.\n He smiled wryly. \"I guess we can forget about that dinner, huh?\"\n \"Oh, no. You don\u0027t get out of it that easily. I\u0027m looking forward to it.\"\n He studied her a moment. \"You really mean that, don\u0027t you?\"\n \"You bet I do! No matter what happens. Remember, you promised to take me to Ireland.\" \n","sourceLink":"https://allnovel.net/nothing-lasts-forever/page-33.html","bookId":2365,"book":{"id":2365,"title":"Nothing Lasts Forever","description":"Storyline: \n Three young doctors-their hopes, their dreams, their unexpected desires... \n Dr. Paige Taylor: She swore it was euthanasia, but when Paige inherited a million dollars from a patient, the D.A. called it murder. \n Dr. Kat Hunter: She vowed never to let another man too close again-until she accepted the challenge of a deadly bet. \n Dr. Honey Taft: To make it in medicine, she knew she\u0027d need something more than the brains God gave her. \n Racing from the life-and-death decisions of a big major hospital to the tension-packed fireworks of a murder trial, Nothing Lasts Forever lays bare the ambitions and fears of healers and killers, lovers and betrayers.\n \n","cover":"https://allnovel.net/images/nothing-lasts-forever.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/nothing-lasts-forever.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:10:57 AM"}}
