{"id":86493,"no":22,"title":"Page 22","content":"I pop one after another into my mouth while Derek watches me with those electric blue eyes.\n “You have to try one,” I tell him. Tracie brings a second helping after I’ve devoured the first.\n “No, thanks.”\n “They’re amazing, Derek. Seriously addictive.”\n “Obviously.”\n I lean across the table and hold up a fritter. “Try it. It’s fresh, and has corn in it. Consider it a vegetable, surrounded by tasty goodness.”\n He looks at the fritter, then at me. “You eat it.”\n When I see it’s useless, I pop it into my mouth. No need to waste a good fritter on someone who won’t appreciate it.\n Tracie brings the rest of our meal. Derek takes a bite of chicken and moans. “This is the way chicken should taste.”\n I’m surprised Derek enjoys the chicken as much as he does. He even reaches over and grabs the wing off my plate when I mention that I’m stuffed and can’t eat another bite. It makes me think of Trey and Monika, who share food all the time. Landon and I never shared food.\n Okay. I admit it. This night does feel like a date. When we were on the trampoline holding hands, I couldn’t look him in the eye. Derek has strong, capable hands that mow lawns and fix old sheds with rusty hammers. My heart skipped a beat when he almost fell on top of me on the trampoline and I could feel his body close to mine. When we jumped in sync, I felt a connection. I know it sounds ridiculous, and I’m sure Derek would laugh if I mentioned it, but I could sense when he was going to jump without even having to look at him.\n After dinner, he drives back home.\n I don’t make eye contact when he parks in our driveway, because I might be tempted to lean in and kiss him. “I had a really . . . interesting time tonight.” I don’t want to tell him the truth . . . that tonight was the first night in a long time I forgot to be depressed.\n I’m super confused and emotional. I don’t want to do anything I’ll regret. I open the door, but Derek reaches over to stop me from getting out.\n “Wait!” he says. “I wanted to give you somethin’ . . .” He reaches into the backseat and grabs a football. “Here. It’s signed by the ’92 Dallas Cowboys. It’s even got Aikman’s signature.”\n My fingers trace the signatures. I’m holding a piece of Texas history. “How’d you get this?”\n He shrugs. “My grandmother sent it for my birthday a while back.”\n “This is really cool, Derek. You should keep it.”\n “I want you to have it.”\n I give him a big hug. “Thanks, Cowboy.”\n I intend to pull away immediately, but when he hugs me back I find myself closing my eyes and lingering in his warm embrace. I’ve wanted this. I’ve waited for this. My heart is beating fast and I feel out of breath with his strong hands on my back.\n I lean back slowly. Our gazes lock. His eyes practically shine in the dark.\n His gaze moves down to my lips. “I want to kiss you so bad right now.”\n “Do you usually ask a girl, or do you just do it?”\n “Usually I just do it.”\n The words come out without my brain contemplating the consequences. “So what are you waiting for?”\n The side of his mouth quirks up, but it’s not from cockiness. I think he’s shocked that I haven’t punched him in the face or left the car. I’m challenging him. His hand cups the back of my neck, his thumb slightly caressing my sensitive skin. Oh, I am in so much trouble right now because I want this so bad.\n My breath hitches when Derek leans forward. I wet my lips with the tip of my tongue, eager to see what it feels like to have his lips pressed against mine.\n His breathing is ragged. “Damn, that’s sexy.”\n I smile wide. “You know we shouldn’t play games like this.” My teasing lips are a whisper away from his.\n “I know. This is a really bad idea,” he agrees, but doesn’t seem to want to retreat.\n “You better be as good at this as you think you are.”\n “I’m good, Sugar Pie.”\n I move back just the slightest bit, knowing I should protect myself and run into the house, but I want to continue to play the game. He wants this to be a game, so I’m playing it the only way I know how. I know guys like Derek. They like challenges and the cat and mouse game.\n Time to play the mouse.\n “Wait.” I place a hand on his chest. I feel the muscles beneath his shirt and the fast pounding of his heart. “Our kissing styles probably aren’t compatible.”\n “Try me,” he whispers, then moves in and places slow, thoughtful little kisses on my lips. I fight the urge to moan. Those little kisses are meant to drive me insane. And they are. Damn him!\n “How’s that?” he asks.\n “Umm. . . .”\n His tongue traces the line between my lips.\n “And that?”\n That’s it. I’m definitely going all in for this now. I grab the back of his neck and pull him closer so we’re full-on kissing and my lips are crushing against his and he feels so different and good and my body is starting to turn into liquid fire . . .\n His lips urge mine open. His hot slippery tongue searches for mine. Our tongues mingle in a sexy dance. I like this way too much.\n “I think we’re compatible,” he groans against my mouth.\n “You think?” I’m panting and wanting this to last longer.\n “Maybe we should keep doing it, just to make sure.” His hand reaches up and he slowly slides the ponytail holder out of my hair, which falls around my shoulders. “Hey,” he says. “Why are your eyes closed?”\n I shrug.\n “Look at me, Ashtyn. I don’t want to be some faceless guy.”\n I open my eyes. His lips glisten in the faint light from the porch.\n “You’re like a warrior princess, you know that?” He gently swipes my hair out of my face. “So beautiful.” The moment is too intense and feels so real. It doesn’t feel like a game, even though I know it is. It’s confusing my already raw emotions, which is exactly what he wants.\n “Are you being serious?”\n My question has lots of implications, because if he’s serious, that means the game-playing is over.\n He hesitates, then leans back in the driver’s seat. “You should know me by now. I don’t take anything seriously.”\n “That’s what I thought.”\n “In fact,” he adds, “I was hopin’ you’d let me take a pic of you and me makin’ out so I can post it on the Internet and piss off your ex-boyfriend. How about it?”\n A picture to post on the Internet? I almost got sucked into spilling all my feelings to Derek, when all along this was just a joke to him. I’m the punch line.\n “How about this nondate being officially over.” I push him away and rush out of the car as I vow never to play kissing games with Derek Fitzpatrick again.\n Chapter 29\n Derek\n Well, I’m a certified asshole. I didn’t mean to hook up with Ashtyn. Kissing her felt damn good . . . and made me want to lose control with her. Which is why I made up that idiotic story about posting a picture of us kissing online. I didn’t know any other way to push her far enough away so she’d hate me.\n Ashtyn isn’t just any random girl. She’s Brandi’s sister and a girl who’d never hook up with a guy without thinking that she’d end up in a serious relationship. Her mom left her, her sister left her, her dad might as well have left her. I need her to think I’m an asshole, because no matter what happens between us, I’m leaving soon and I’m not coming back.\n I set the football in front of her bedroom door, knowing it’s a lame peace offering but not knowing what else to do or say. I knew she liked it by the way she studied the Dallas Cowboys’ signatures as if they held some secret football code.\n In the morning, Brandi comes in my room while I’m still half-asleep. She’s wearing shorts and a T-shirt that hugs her pregnant belly. Falkor trots in behind her with a chewed-up football in his mouth. He sits next to my bed and drops the drool-covered, deflated ball. Aikman’s signature is torn in half . . . some of it is missing, probably been swallowed by the beast.\n “He ate it,” I mumble in shock.\n “I know, isn’t that so cute! Ashtyn was tossing it to him this morning in the front yard, teaching him how to play fetch.”\n Shit. Ashtyn really knows how to say fuck you without uttering a word.\n “I have an appointment for an ultrasound next week,” my stepmother says in an excited tone. “I want you to come with me.”\n “No, thanks.”\n “Oh, come on. Since your dad’s not here, I really really want you and Julian to be there.” The woman doesn’t realize that it might be weird for me to go to her ultrasound. “I can take you and Julian out afterward, like . . .” I can practically hear the rusty wheels in her brain turning. “I’ll take you guys, like, apple picking afterward. You’ll love it!”\n “Apple-picking season isn’t until the fall,” I inform her.\n “Oh. Right. We can do something else, then. Something super fun. Super.”\n “How about we just go to lunch.” At least I can be spared having to eat another one of her home-cooked meals. I sit up and try not to stare at her growing belly.\n “Does that mean you’ll go?”\n I look at her pleading face and feel sorry for her. I guess if she were my wife, I’d want someone to go with her. “Yeah, I’ll go.”\n “Thank you, Derek! You’re The Best!” She attempts to sit on the edge of my bed, but loses her balance and almost tumbles off until I reach out to steady her. Giving up on sitting, she stands next to my bed and rests her hands atop her stomach. “So . . . I hear from a little birdie that you got a letter from your grandmother. That’s nice.”\n “Right.” If she knew my grandmother only cared about herself and would probably insult Brandi on sight, I don’t think she’d think it was nice.\n “What did she say?”\n “That she’s joinin’ the circus as the bearded lady.”\n “Really?”\n “No, not really. She’s dyin’ and wants me to visit her in Texas.” She cocks her head. “Is that another joke?” “No joke. I’m gonna visit her.” After last night, I realized Ashtyn is my kryptonite. I feel myself getting too close and need to back off.\n I hear the front door slam. Ashtyn must’ve left for practice and she’s obviously still mad. Two hours later, when she pulls into the driveway in her beat-up car and I’m fixing the broken slats on the shed, I still don’t know what I’m going to say to her.\n She limps into the house. Her hair is in a low ponytail and she’s got grass stains on her pants. She definitely had a rough practice. I tell myself to leave her alone, but I can’t get her off my mind. I find her in the living room soaking her foot in a bucket of ice. Brandi is painting her nails and Julian is sitting next to Ashtyn watching TV.\n “Ashtyn, can we talk?” I ask. \n","sourceLink":"https://allnovel.net/wild-cards-wild-cards-1/page-22.html","bookId":2770,"book":{"id":2770,"title":"Wild Cards (Wild Cards #1)","description":"Storyline: \n Wild Cards (Wild Cards #1) \n After getting kicked out of boarding school, bad boy Derek Fitzpatrick has no choice but to live with his ditzy stepmother while his military dad is deployed. Things quickly go from bad to worse when he finds out she plans to move them back to her childhood home in Illinois. Derek’s counting the days before he can be on his own, and the last thing he needs is to get involved with someone else’s family drama. \n Ashtyn Parker knows one thing for certain--people you care about leave without a backward glance. A football scholarship would finally give her the chance to leave. So she pours everything into winning a state championship, until her boyfriend and star quarterback betrays them all by joining their rival team. Ashtyn needs a new game plan, but it requires trusting Derek—someone she barely knows, someone born to break the rules. Is she willing to put her heart on the line to try and win it all?\n \n","cover":"https://allnovel.net/images/wild-cards-wild-cards-1.jpg","author":"Simone Elkeles","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/wild-cards-wild-cards-1.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:13:54 PM"}}
