{"id":86496,"no":25,"title":"Page 25","content":"The girls introduce themselves and we start talking. Ashtyn steps out of the tent. She doesn’t talk much until the guys who’d been playing ball earlier gather around our campfire. They bring a cooler full of beer. Before long, we’re hosting an all-out bash with music blaring from speakers in someone’s van.\n Ashtyn’s suddenly chatting it up with a bunch of the guys. She’s got all their attention as she relays some story about playing football in the middle of a downpour last season. Ashtyn has power over guys . . . power that has nothing to do with being a football player. She doesn’t flip her hair back or giggle or stick out her breasts to get their attention like normal girls. She’s just . . . Ashtyn.\n “Is Ashtyn your girlfriend?” a girl who introduced herself as Carrie asks.\n I glance across the fire at the girl who drives me nuts, then tell myself to look away and stop caring about what she does.\n “Nope, Ashtyn’s not my girlfriend.” I glance around like I’m about to tell Carrie something super secretive. “She’s actually royalty from Fregolia, a small country in Europe. She wanted to know what it was like to live with the locals in America, so she’s here undercover. I’m her bodyguard.”\n “Ooh.” Carrie glances at my biceps appreciatively, then licks her lips. She leans closer. “You have the most amazing eyes. Where are you from?”\n I bet my left nut that if I say Fregolia, she might very well believe me. “The answer’s kinda complicated.”\n “What do you mean?”\n “I’m from a lot of places.”\n “Ooh, mysterious.” She straightens, seemingly excited to learn about all the places I’ve lived. “Let me guess, then. You must have gotten that sexy drawl from somewhere.”\n I nod. “Alabama. Tennessee. Texas.”\n Carrie touches my bicep and cries out, “Oh, my God! You’re from Texas? What a coincidence! I love Texasians!”\n Chapter 34\n Ashtyn\n After talking and laughing with the guys from the other campsite until my voice is raw, I’m suddenly exhausted. They ask me to play strip poker at their site. I’m not about to play strip poker with anyone, let alone a bunch of guys I just met. I don’t tell them that Derek plays poker, because I don’t want him to play strip poker or any kind of stripping game with those girls he met tonight.\n Derek is talking to some girl by the campfire. He’s been talking to her all night. She’s flirting, giggling, and touching his arm. Derek is definitely interested; I can tell by the way he’s focusing all his attention on her.\n I gather my hockey jersey and toiletries, then walk down the little pathway to take a shower and get ready for bed. I pass Derek and the giggler on the way back to our tent, ignoring them as I unzip the entrance and crawl inside.\n I’m lying on the mattress and hear more giggles. And Derek’s laughter. Ugh, why do I care if Derek wants to hook up with someone else? Because the truth is that I want to be with him. I find myself craving it. I squeeze my eyes shut and try to wipe out the image of Derek and the girl outside. I wish that girl was me.\n What am I thinking? I don’t want a guy who cringes at the thought of having a real relationship instead of a one-night stand. I don’t want a gambler or womanizer. Just like I told him before dinner, I don’t want or need anyone.\n I try to sleep, but I can’t. As if hearing their low whispers isn’t bad enough, through the nylon I see their shadows. Her giggles grate on my nerves because they’re so fake.\n I turn over, put my earbuds in, and listen to music. The light from my iPod gives the tent a dim glow. I take a deep, calming breath . . . but out of the corner of my eye I catch sight of something crawling on the tent—a big spider is right next to my head!\n I scramble to get away from the creepy thing.\n Is it on me?\n Oh, no. I don’t like creepy, crawly spiders with fangs and a bunch of legs and gross, sticky webs. They freak me out.\n It moves closer.\n “Don’t come near me!” I cry out, then whimper for help.\n Within seconds, the front of the tent zips open and Derek appears. “What’s wrong?” he asks, his voice full of concern.\n I point to the offending creature. “There it is!” I moan when it climbs to the top of the tent. “Ewww. Get it away. Smash it. Kill it!”\n “You’re brutal. It’s a spider, Ashtyn. Not a scorpion.”\n He captures it, then sets it free outside.\n “Make sure you put it far away,” I tell him.\n He appears again. “It’s gone. You’re a tough football player. Surely you can handle a little spider.”\n “Surely being a football player has nothing to do with a fear of those eight-legged creepy crawlers, Derek. And that thing wasn’t little. I saw its fangs.”\n “Yeah, right.” He shakes his head. “What did you think, that there’d be no spiders at a campground? We’re in the middle of nature.”\n “I didn’t expect one to be inside my tent,” I tell him. “I read on the Internet that it’s not uncommon for a person to eat a spider while they’re sleeping. I couldn’t go to sleep thinking that thing was about to crawl on my face and stick its fangs into me. This is my space.”\n “Well, it’s gone, so you’re fine now. I’m surprised we haven’t heard from the Happy Camper police. It’s quiet hours after ten, you know.” He grabs his toiletries from his duffel. “Your bed is takin’ up eighty percent of the tent. Where do you suppose I’m gonna sleep?”\n I point to a sliver of space, big enough if he doesn’t move much. “Right there.”\n “You’re kiddin’ me, right?”\n “No.”\n He shakes his head. “We’ll figure it out when I get back.”\n “What about that ugly girl you were talking to?” I ask, trying to hide any trace of jealousy in my voice. “Isn’t she still out there waiting for you?”\n “She wasn’t ugly. And no, she’s not waitin’ for me.”\n “Did you see her pink hair? I mean, seriously. It’s painfully obvious she’s begging for attention.”\n “She’s hot.”\n “Yeah, well, what do you know? I think bacteria from those algae smoothies have invaded your brain.”\n He turns to me. “You jealous I was talkin’ to her?”\n “I’m not jealous. I’m just concerned, but I won’t look out for you anymore if you don’t want me to.”\n “You need to look out for yourself, Ashtyn. Not me.”\n Derek leaves to wash up. My stomach has butterflies knowing that he’ll be sleeping in the tent with me. I don’t want to admit that I want him to want me. But I do. I want him to say that the girl he was talking to tonight was boring and stupid and . . . not me.\n He’s back. The blow-up bed moves as he sits on it. I roll toward the middle . . . toward him.\n “Don’t think you’re sleeping on my bed,” I mumble, scootching back to the edge of the bed and hoping he doesn’t sense that I’m totally aware of the electricity between us. If he’s feeling it, too, he’s masking it.\n “Listen, Sugar Pie, you didn’t leave me any room. We’re sharin’ a bed. You don’t like it,” he says in an annoyed tone, “I have a pocketknife that I’ll be happy to plunge into the mattress.”\n I sit up. “You wouldn’t dare.”\n He reaches into his bag and holds up the knife. “Try me.”\n Unfortunately, I don’t think Derek is the kind of guy to make empty threats. “Fine. You can sleep in the bed, but make sure you stay on your side. Remember our no-touching rule.”\n “Just move over.”\n It’s completely dark. And it’s silent except for our breathing.\n My back is to Derek. I hear him slide his jeans off before he lies down next to me. It’s strangely intimate with just the two of us alone in the tent. Has he slept all night with a girl before? Did he sleep with that girlfriend from Tennessee who cheated on him?\n There’s hardly enough room for both of us on the bed. I keep my body totally straight so we don’t accidentally touch our legs or hands or arms or . . . anything. I have nothing to worry about. While Derek might want to be with me physically because he’s a male, he doesn’t have any desire to hold me and tell me everything in my life will turn out okay.\n That’s what I want from a guy.\n That’s what I need from a guy.\n Suddenly it’s super silent in the tent. Even the crickets are quiet. I’m restless. Silence to me is as annoying as nails on a chalk-board, because when it’s too quiet my mind goes in overdrive. When my mom and Brandi left all those years ago, our house was too silent. All I did was think about what they were doing, why they left, and how awfully lonely I’d become. I filled that void with music, the pounding kind that doesn’t let you think.\n Derek is listening to music with his headphones on. It’s so quiet I can hear the songs. Old music from the ’50s and ’60s softly fills the tent. The songs soothe me. I drift off trying not to think about Derek saving me from the spider. Or sleeping next to me. I remind myself that he’s attracted to girls like the one with the pink-striped hair—someone who knows she’ll never see him again.\n He’d been my hero tonight without realizing it. He’s being my hero now, by driving me to Texas and staying with me tonight instead of going off and hooking up with that girl.\n “Thanks,” I mumble as I drift off, knowing he can’t hear me with his headphones on. It’s nice knowing that at least for tonight I’m protected . . . Derek is here to make sure I’m not attacked by spiders . . . or hounded by thoughts of being abandoned.\n I’m dreaming about Alaska. All I know is that I’m cold and I can’t get warm. I’m stuck in the middle of an iceberg and can’t get loose. I’d do anything to stop shaking. The wind is as cold as a snowstorm. Somehow I magically get off the iceberg. Now I’m walking in the snow, naked, about to freeze to death.\n I’m half-asleep as I turn to find a more comfortable position, barely aware that I’m not in Alaska but sleeping in a tent. I’m cold . . . the temperature has dropped and I’m shaking. My hand rests on something warm. An island of some sort. I move closer to the warmth, cuddling into it.\n “Ashtyn, what’re you doin’?” a deep, masculine voice says.\n Derek. I don’t open my eyes, but I know it’s him. His drawl is unique and undeniable, like warm hot chocolate. I want him to be my protector, just for tonight. If he leaves me, I’ll be all alone.\n I don’t want to be cold and alone. Not tonight.\n In my sleepy state I tell myself I’ll do anything to keep him here with me.\n “Don’t leave me,” I mumble into his chest as I shiver uncontrollably.\n “I won’t.” His arms wrap around me and I feel safe . . . away from the iceberg in my dream and the loneliness in my heart and the pain of losing everyone I ever loved. \n","sourceLink":"https://allnovel.net/wild-cards-wild-cards-1/page-25.html","bookId":2770,"book":{"id":2770,"title":"Wild Cards (Wild Cards #1)","description":"Storyline: \n Wild Cards (Wild Cards #1) \n After getting kicked out of boarding school, bad boy Derek Fitzpatrick has no choice but to live with his ditzy stepmother while his military dad is deployed. Things quickly go from bad to worse when he finds out she plans to move them back to her childhood home in Illinois. Derek’s counting the days before he can be on his own, and the last thing he needs is to get involved with someone else’s family drama. \n Ashtyn Parker knows one thing for certain--people you care about leave without a backward glance. A football scholarship would finally give her the chance to leave. So she pours everything into winning a state championship, until her boyfriend and star quarterback betrays them all by joining their rival team. Ashtyn needs a new game plan, but it requires trusting Derek—someone she barely knows, someone born to break the rules. Is she willing to put her heart on the line to try and win it all?\n \n","cover":"https://allnovel.net/images/wild-cards-wild-cards-1.jpg","author":"Simone Elkeles","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/wild-cards-wild-cards-1.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:13:54 PM"}}
