{"id":18557,"no":3,"title":"CHAPTER III.","content":"DECOROUS black posts, with white tops, on either side of a little avenue, a five-pound trout laid out on the hall door-steps, with some smaller specimens of its kind, a group of anglers admiring these, and a fine, unostentatious rain that nobody paid any attention to—these were our first impressions of the Royal Hotel, Recess. With many injunctions as to her “giddiness” about the head, Sibbie was commended to the care of a stable-boy, and we marched over the corpses of the trout into a little hall in which the smell of wet waterproofs and fishing tackle reigned supreme. Our only information as to the hotels of Connemara had been gathered from a gentleman whose experience dated some thirty years back. He told us that on arriving at the hotel to which fate had{42} consigned him, his modest request for something more substantial than bread and whisky had been received with ill-concealed consternation. A forlorn hope of children was sent forth to find and hunt in a chicken for his dinner; he had watched the search, the chase, the out-man?uvring of the wily victim; he had heard, tempered by a single plank door, its death screech in the kitchen, and he had even gone the length of eating it, when it was at last served up on a kitchen-plate, brown and shrivelled as “She” in her last moments, and boiled with a little hot water as its only sauce. As to the bedrooms, our friend had been almost more discouraging. He said that while he was dining he heard a trampling of feet and the moving of some heavy body in the passage. The door opened, and a feather bed bulged through the narrow doorway into the room, and was spread on the floor by the table. It was then explained that, as he had asked for dinner and a bed, sure there they were for him, and they were elegant clean feathers, and he should have them for eightpence a pound. With{43} some difficulty the traveller made them understand that, though he meant to carry the dinner away with him, he had no such intentions with regard to the bed; and after a more lucid setting forth of his requirements, his host and hostess grasped the position. He was taken into a room which was quite filled by two immense four-post beds, and having been given to understand that one was reserved for domestic requirements, he was offered the other. He was on the point of accepting this couch when a snore arose from its depths. [Image unavailable.] A FISHERMAN AT RECESS. “Ah, sure, that’s only the priest,” said the lady of the house; “and he’s the qui’test man ever ye seen. God bless him! He’ll not disturb ye at all.” This was our friend’s experience, and though possibly it had gained flavour and body with age, it had, at all{44} events, made us look forward with a fearful interest to what might be our lot in Connemara. But the first vision of the long Recess dinner-table dissipated all our hopes of the comic squalor that is endured gladly for the sake of its literary value, and I may admit that the regret with which my cousin and I affected to eat our soup and pursue our dinner through its orderly five or six courses was not altogether sincere. From one point of view it might have been called a fish dinner, as from clear soup, to raspberries one topic alone filled the mouths of the diners—the outwitting of the wiles of trout and salmon. There was a reading-party of Oxford men, their blazers glowing rainbow-hued among the murky shooting coats of the other diners; there were young curates, and middle-aged majors, and elderly gentlemen—to be an elderly gentleman amounts to a profession in itself—and all, without exception or intermission, talked of fish and fishing. Not to talk to the comrade of your travels at a table d’h?te is an admission of failure and incapacity, so much so that{45} rather than sit silent, I would if need were, repeat portions of the Church Catechism to my friend in a low conversational voice. My cousin and I have seldom been forced to this extreme, and on this occasion we kept up the semblance of a cultured agreeability to one another in a manner that surprised ourselves. But the volume of discussion raging round us overwhelmed us in the end. We felt the Academy and the jennet to be alike an impertinence; we faltered and became silent. Opposite to us sat one of the most whole-souled of the elderly gentlemen, with a face of the colour and glossy texture of Aspinall’s Royal Mail red enamel, in vigorous conversation with a callow youth in a pink blazer, one of whose eyes was closed by midge-bites; and, though the general chorus might rise and wane in the long intervals between the courses, their strident bass and piping tenor sustained an unflagging duet. “I assure you, my dear sir,” protested the elderly gentleman, earnestly, with an almost pathetic oblivion{46} of the difference in age between him and his neighbour, “it is not a matter of a fly with these Glendalough trout. I have seen a man fail repeatedly with a certain butcher, and immediately afterwards the same butcher, put pleasantly to a fish, you understand, rose him at once.” “H’m,” returned the Pink Blazer, gloomily, receiving this, to us, surprising statement, with perfect calm, “my experience—and I’ve fished these lakes for years—is that a full-bodied Jock Scott”—but we will not betray our ignorance by trying to expound second-hand the profundities of the Pink Blazer. When they had been given to the world, he hid his little midge-bitten face in a tumbler of shandygaff, while his aged companion gravely continued the argument. There were only two or three other ladies at the table, and they evidently had, by long residence in the hotel, been reduced to assuming an interest in the prevailing topic, which we found hard to believe was genuine. They may, of course, have been enthusiasts, but their looks belied them.{47} Next morning we were awakened by the babble of fishermen in the hall, then the rattle of cars on the gravel told that they had started on their daily business, and when at a subsequent period we came down to breakfast, we found ourselves alone, and the hotel generally in a state of peaceful lethargy. It was, so we had heard excited voices in the hall proclaiming, a splendid day for fishing. This meant that when we looked out of the window we saw two blurred shadows that we believed to be mountains, and heard the rushings of over-fed streams, which, thanks to the mist, were quite invisible. But the hotel weather-glass stood high, and at ten o’clock we were hopeful; at eleven we were despairing; at twelve we were reckless, and we went to our room to get ready for a walk. We have hitherto omitted all reference to one important item of our equipment, and even now, remembering that we were travelling in a proclaimed district, I mention with bated breath the fact that my second cousin insisted on taking an ancient and rusty revolver with her. She had secretly{48} purchased a box of cartridges, weighing several pounds, and at the last moment she had requested me to stow this armoury in the travelling-bag—“In case of mad dogs and things on the road,” she said. The pistol, in its leather case, I consented to, but the tin box of ammunition was intolerable, and we compromised by putting six cartridges into an “Easy Hair Curler” box, which really might have been made for them. So far there had been no occasion to use it, but now, as my cousin struggled into her mackintosh, she remarked tentatively, “Don’t you think this would be a good day for the revolver?” I said I was not much of a judge, but she might bring it if she liked; and having secreted it and a few “easy hair curlers” in her mackintosh pocket, she was ready for the road. We paused in the hall for a last vengeful look at the barometer, which still stood cheerfully at Set Fair (we believe its constructor to have been a confirmed fisherman), and at the door we encountered the two hotel dogs—a large silky black creature of the breed{49} that is generally selected to adorn penwipers, and a smirking fox-terrier, with polite, and even brilliant manners of a certain flashy hotel sort. “Would they come for a walk with the ladies?” said I, my voice assuming the peculiar drivelling tone supposed to be attractive to dogs. [Image unavailable.] THE TWO HOTEL DOGS. The penwiper regarded me with cold amber eyes, and composed itself for slumber. “Come along, then!” I said, still more persuasively adding, as I stepped out into the thick fine mist, “Cats!{50}” The amber eyes closed, and their owner curled into an inky heap with a slumbrous growl; while the fox-terrier, having struck a dashing attitude to keep up his character as a sportsman, affected to believe that the cats I referred to were in the kitchen, and hurried off in that direction. We were snubbed; and we went forth reflecting on the demoralising effect of hotel life. Its ever-changing society and friendships of an hour had turned the penwiper into an ill-mannered cynic, and the fox-terrier into an effete and blasé loafer. Thus moralising, we splashed along the road, past the little post and telegraph office, where you write your telegrams in an arbour of roses, and post your letters between the sprays of clematis, and struck gallantly forward, with the telegraph posts, along the Clifden road. Glendalough lake lay on our left hand, and the bare mountains towered up on our right—at least, we were given to understand by the guide-books and the waiter that they towered, the mist allowing us no opportunity of judging for ourselves. Across the lake we saw the Glendalough{51} hotel among the woods that came down to the water’s edge, and on it—we allude to the lake—were the boats of some of the maniacs who had left their comfortable asylum in the grey of the morning. We did not see them catching any fish; in fact, we have been forced to the conclusion that we had some malign influence on the anglers of Connemara, for, though we have watched them long and often, we have never seen so much as a rise. We left the main road at the end of the lake, and turned into one running in another direction. It was, like every Connemara road, good and level, and in perfect order. Like all the others, too, it disdained fence or protection of any kind, unless an occasional deep ditch or lake on each side can be called a reassurance to the driver. Here and there on the road the little black demon cattle were standing disgustedly about, declining to eat the wet grass among the wetter heather, and concentrating all their attention on us in a manner that, taken in connection with the most villainous expression of countenance, and horns{52} like Malay Krisses, made it advisable to throw stones at them while there was yet time. They at once withdrew, recognising the fact that is early implanted in the mind of every known Irish animal, that sermons in stones are unanswerable. We had got on to a long stretch of bog road, bounded only by the vaguely suggestive mist, and we were beginning to feel the ardour for a long walk awakening in us, when we heard a strange yelping on the road behind us, and looking back, saw a large brindled bulldog advancing out of the mist at a lumbering trot. No one was with him; a short piece of rope hung round his collar, and his aspect altogether was so terrific that my cousin and I again provided ourselves with the national weapon, and stood discreetly aside to let him pass. He instantly stopped and stared at us in what seemed a very threatening manner. “Perhaps he’s mad!” I suggested. “Where’s the gun?” “In my pocket,” returned my cousin in a low voice “and I can’t get it out. It’s stuck.{53}” [Image unavailable.] “NOW!” {54} {55} “Well, you’d better hurry,” I said, “for he’s coming.” The bulldog was moving slowly towards us, uttering strange grunts, and looking excitedly round at the cattle, who were beginning to close in on us and him. My cousin with one strenuous effort ripped the pocket off her mackintosh. “I’ve got it at last!” she panted, putting in a cartridge with trembling fingers and cocking the pistol. “It’s awfully stiff, and I know it throws high, but anyhow, it will frighten him—I don’t really want to hit him.” “For goodness’ sake wait till I get behind you,” I replied. “Now!” There was a report like a cannon, and I saw my cousin’s arm jerk heavenwards, as if hailing a cab. The next moment the cattle were flying to the four winds of heaven, and the bulldog, far from being alarmed or hurt, was streaking through the heather in hot pursuit of the largest cow of the herd. This was a more appalling result than we could{56} possibly have anticipated. Not only had we failed to intimidate, but we had positively instigated him to crime. “He’s used to guns,” I said. “He thinks we are cow-shooting.” “He’s gone to retrieve the game,” replied my cousin in a hollow voice. In another instant the bulldog had overtaken his prey, and the next, our knees tottering under us with horror, we saw him swinging from her nose by his teeth, while her bellowings rent the skies. Back she came down the hill, flinging her head from side to side, while the bulldog adhered with limpet tenacity to her nose, and, jumping the bog-ditch like a hunter, she set off down the road, followed by a trumpeting host of friends and sympathisers who had re-gathered from the mountain-side on hearing her cries. The whole adventure had been forced upon us so suddenly and unexpectedly that we had no time to argue away the illogical feeling that we were responsible for the bulldog’s iniquities. I see now that the sensible thing{57} would have been to have gone and hid about among the rocks till it was all over. But that course did not occur to us till afterwards. As a matter of fact, my cousin crammed the pistol into her uninjured pocket, I filled my hands with stones, and we pursued at our best speed, seeing from time to time above the heaving backs and brandished tails of the galloping cattle the dark body of the bulldog as he was swung into the air over his victim’s head. Suddenly the whole cortége wheeled, and flourished up a bohireen that led to a cottage, and in the quick turn the cow fell on her knees, and lay there exhausted, with the bulldog prone beside her, exhausted too, but still holding on. The presumable owner of the cow arrived on the scene at the same instant that we did. “Call off yer dog!” he roared, in a fearful voice. “He’s not ours!” we panted; “but come on, and we’ll beat him off!” the bulldog’s evident state of collapse encouraging us to this gallantry. The man’s only reply was to pick up a large stone, and heave it at the dog. It struck his brindled ribs{58} a resounding blow, but he was too much blown to bear malice satisfactorily; to our deep relief he crawled to his feet, slunk away past us on to the main road, and, setting off at a limping trot in the direction from which he had come, presently vanished into the mist. The man stooped down and examined the poor cow’s torn and bleeding nose, and she lay, wild-eyed, with heaving sides, at our feet. “That the divil may blisther the man that owns him!” he said; “and if he isn’t your dog, what call have you taking him out to be running my cows?” “We met him on the road,” we protested. “We couldn’t help his following us.” “Aha! thin it’s one of them dirty little fellows of officers that has the fishing lodge below that he belongs to!” said the man. “I heard a shot awhile ago, and ye may b’lieve me I’ll have the law o’ them.” We exchanged guilty glances. “Yes; I heard a shot, too,” I said nervously.{59} “Well, I—a—I think we must be getting on now. It’s getting late, and—a—I hope the cow isn’t very bad. Anyhow”—my voice sinking into the indistinct mumble that usually accompanies the benefaction—“here’s something to get soft food for her till her nose gets well.” The ambition for the long walk was dead. With more hurried good wishes and regrets we wished the man good evening, and so home, much shattered. P.S.—We should like to meet the owner of that bulldog.","sourceLink":"http://novel.tingroom.com/duanpian/3080/85067.html","bookId":964,"book":{"id":964,"title":"Through Connemara in a governess cart","description":"简介： MY second cousin and I came to London for ten days in the middle of last June, and we stayed there for three weeks, waiting for a fine day.We were Irish, and all the English with whom we had hitherto come in contact had impressed upon us that we shou...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3080","creation":"Aug 1, 2019 12:24:02 AM","modification":"Aug 1, 2019 12:24:02 AM"}}
