{"id":18559,"no":5,"title":"CHAPTER V.","content":"IT was nearly four o’clock before we got out of the Ballinahinch avenue on to the Clifden road. A young horse had got loose in the yard just as Sibbie was having her toilet made for the start, and the clattering of hoofs and cracking of whips that ensued had so upset her old-maidish sensibilities, that she refused to leave the stable, till finally, by a noble inspiration on our part, she was backed out of it. She had started from the yard in a state of mingled resentment and terror; even still her ears were fluttering like the wings of a butterfly, and she showed a desire to canter that seemed to us unhealthy. The shrunken oat bag lay at our feet; decidedly she had had more luncheon than was good for her while we were walking ourselves off our legs in the woods of Ballinahinch. The broad lake lay on our left, show{83}ing coldly and mysteriously through the changing swathes of mist, and above us, on our left, the long slopes of bog and heather stretched upwards till they steepened into the dignity of actual mountains. “If I thought the weather could not hear me,” observed my second cousin, “I should say it was going to clear up. It looks almost as if there were sunlight on those children’s petticoats ahead of us.” An enchanting group was advancing to meet us; half-a-dozen or so of children, boys and girls petticoated alike in mellow varieties of the dull red or creamy white Galway flannel, a few cattle wandered in front of them, and in their midst a long-suffering donkey was being ridden by three of them and beaten by the remainder. We were so absorbed in sitting with our heads on one side to better appreciate the artistic unity of the picture that we took no heed of the dangerous forward slant of Sibbie’s ears. No one could have supposed that in her short intimacy with “the quality” she could have already developed a fine-ladyish affectation of horror at the sight of an{84} estimable poor relation; yet so it was. Casting one wild look at the appalling spectacle, she sprang sideways across the road, whirled the trap round, only avoiding the black bog-ditch by a hair’s breadth, and fled at full speed in the direction from which she had just come. My cousin and I were for the moment paralysed by surprise, and by the sudden horrid proximity of the bog-ditch, which was hospitably prepared to take us all in and do for us, and think nothing of it. Sibbie’s strong little brown back was hooped with venomous speed, and her head was out of sight between her forelegs. The telegraph posts were blended into a black streak, the lakes swam past us like thoughts in a dream, it seemed useless to get out to go to her head; obviously, Sibbie was running away. The governess cart quite entered into the spirit of the thing, and leaped and bounded along in a way that—considering its age and profession—we thought very unbecoming. It is perhaps a fa?on de parler to say that I was driving. To put it more accurately, I{85} [Image unavailable.] “HANGING ON EACH TO OUR REIN.” {86} {87} had been driving, and now I was trying very hard to do the opposite. However, after laying the seeds of two blisters in vain, I was ignominiously compelled to hand one rein to my cousin. Hanging on each to our rein, we lay back in the trap, getting a good leverage for our pull over the ridge of the luncheon basket. I shudder to think of the result had those reins broken. Two human Catherine wheels would have been seen revolving rapidly over the stern of the governess-cart, and as for Sibbie—— But the reins were staunch, and though at first a want of unanimity caused us to swing from side to side of the road in a series of vandykes, the combined weight of the expedition slowly told, and Sibbie’s ears were hauled into sight. Back and up they came till they were laid along her back, and her long nose pointed skywards in a fury of helpless protest, while her gallop grudgingly slackened. Of course my hat had blown off early in the proceedings, but nothing else had happened. I handed my rein to my cousin without a word, and got out of the trap.{88} “No doubt this had been extremely amusing,” I said, “but I am going to buckle the reins as low down on this bit as they will go.” And I did so. I hate people who do nothing but laugh on an emergency, simply because they think it looks brave. As I turned Sibbie round I saw, nearly a quarter of a mile away, a child standing by a telegraph post, holding in its hand a white disc that I knew must be my hat, and I also saw with much pleasure that the other children, with the cows and the donkey, had left the road, and were climbing up the hillside. So, with hearts overflowing with a great thanksgiving that “Earl Percy,” i.e., the mail-car and its English tourists, had not “seen our fall,” we drove back again at a cautious jog, Sibbie obviously as much on the look-out as we were for anything that she could reasonably shy at. The girl with the hat was regarded by her with an anguish of suspicion, only allayed by my getting out of the cart while the hat was smuggled in, and leading her—a process which{89} always suggests taking a child by the hand to give it confidence. It was a long way, about six Irish miles, back to the turn that we had been instructed would take us to Letterfrack, and the invalid sunshine had already swaddled itself again in cotton wool and retired for the night. If my second cousin has a failing, it is that she believes herself to possess “an eye for country,” a gift fraught with peril to its possessor. Unfortunately, she had, before starting, studied on a map the relative positions of Ballinahinch, Recess, and Letterfrack, and now that she was face to face with the situation her eye for country flashed fire at the idea of having to traverse two sides of a triangle instead of one, which was pretty much what we were called upon to do. “It is absurd,” she said, hotly, “to go back almost to Recess to go by that ‘new line’ to Letterfrack, when I am almost sure I remember seeing on the Ordnance Map a dear little roadeen that would take us through the mountains somehow on to the Kylemore road.{90}” From the use of the affectionate diminutive “roadeen,” I knew that my cousin was trying to engage my sympathies, and though I tried to steel my heart against the suggestion, there certainly was something attractive in the thought of a short cut. “It ought to be a little further on,” she continued, “by a little lake; and you know it’s getting pretty late now.” I now recognise that this was the moment at which to have stamped upon the scheme, and to have made the time-honoured remark that we had no time for short cuts. But I let it slide by me, and when we reached a narrow, but to all appearance sufficient mountain road, bending plausibly away to the left, we mutually succumbed to its fascinations. For a mile or so it was really very fair. It certainly did occur to me that it might be awkward if we met anything larger than a wheelbarrow, as the governess-cart easily monopolised the space between the usual bog-ditches, but as, so far, the district seemed quite uninhabited, we did not trouble ourselves on that account. The{91} road became steeper and stonier as we advanced, but Sibbie toiled on gallantly, the pride of having run away clearly still working in her and encouraging her in a way no mere whip could have done. The cotton-wool into which the sun had retreated had now covered all the sky, and was wrapping up the mountain tops as if they were jewellery, which, as they were armoured from head to foot in sheets of grey rock, seemed to us unnecessary care. We were getting deeper and deeper into the hills, and the higher we got the heavier the rain became. It felt as though some important heavenly pipe had burst, and we were getting near the scene of the explosion. The three shilling umbrella did its best; it humped its back against the torrent like an old cab-horse, and really kept my second cousin fairly dry. But things were going very badly with the luncheon basket, and, though we did not mention it to each other, the belief in the short cut was dying in us. The road ahead was narrowing in a way not to be accounted for by the laws of perspective; it was{92} becoming suspiciously grassy, and rocks of a size usually met with only in the highest Druidical circles lay about so near to the track that steering was becoming a difficulty. A wild-looking woman, wearing a coarse white flannel petticoat over her red hair instead of a cloak, came paddling along with barefooted indifference to the wet, and stopped to stare at us with a frank and open-mouthed amazement which was not reassuring. “Shall we ask her the way?” I suggested. “It’s no good,” replied my cousin, sombrely; “we must go on now. It’s too narrow to turn round. Let’s get on to those cottages and ask someone there.” (The belief in the short cut here heaved its final groan and expired.) We had climbed to a kind of small plateau in the heart of the hills, and on the farther side of the little indigo lake round which the track wound were a couple of cottages. We beat Sibbie into a trot, and made for the nearer of the two, and the barking of the{93} usual cur having brought a young man out of the house, my cousin proceeded to discourse him. “Are we going right for Kylemore?” “Yo’re not.” “Where does this road lead to?” “To the Widda Joyce’s beyant.” “And is that the end of it? Can’t we get on any farther?” The young man looked at us much as an early Roman might have regarded the Great Twin Brethren. “Bedad I dunno what yerselves is able to do; but there’s no answerable road for a cart whatever.” Our eyes met in dumb despair, but my second cousin still rose above the waves. (This metaphor is most appropriate, as we could not have been much wetter if we had been drowned.) “Where is the nearest hotel?” she asked, with all the severity of an examining Q.C. “Back in Recess. Ye’d be hard set to get there to-night.{94}” “Think now, like a good boy, is there no sort of a place hereabouts where they’d put us up for the one night?” The despairing relapse into the vernacular had its effect. “Well, faith, I wouldn’t say but the Widda Joyce ’d be apt to be able to do it. There was an English gintleman, a Major, that she had there for the fishin’——” In what capacity the English Major was used in the fishing we did not stop to inquire; he might have been employed as a float for all we cared; it was about all we felt ourselves fit for. We did not ask the Widow Joyce if she could take us in. We simply walked into her house and stayed there. We had heard a good deal of the Spanish type of beauty that is said to abound in Connemara, but the Widow Joyce was the first specimen of it that we had seen. A small, pale, refined woman, with large brown eyes, and dark hair tucked shiningly away under a snowy white frilled cap, she heard our story{95} with flattering interest and compassion, and we had hardly finished it before most of her eleven children were started in different directions to prepare things for us and “the pony.” By-the-bye, we noticed that during our travels Sibbie was always given brevet rank, the delicate inference being that we were far too refined and aristocratic to be associated with anything so vulgar as a jennet. A lovely clear fire of turf was burning on the hearth, and Mrs. Joyce hospitably insisted on our each sitting on little stools inside the big fireplace, and roasting there, till the steam of our sacrifice showed how necessary a proceeding it was. In the meantime that sacred place known as “Back-in-the-room” was being prepared for our reception; as far though we should have preferred the kitchen with its clean earth floor and blazing fire, Mrs. Joyce would not hear of our having our dinner there. “Sure the Meejer always ate his vittles back in the room,” she said; and to this supreme precedent we found it necessary to conform.{96} We certainly owed a great deal to the Meejer. It was the Meejer, we discovered, who had broken an air-hole in the hermetically-sealed window. “An’ faith, though he give us the money to put in the glass agin, we never got it done afther. It’s a very backwards place here.” The Meejer’s sense of decorum had prescribed the muslin curtains that shielded the interior from the rude gazer’s eye. The Meejer had compelled the purchase of a jug and basin, and “a beautiful clane pair o’ sheets, that not a one ever slep in but himself.” In fact, what of civilisation there was, was due to his beneficent influence, and we rose up and said that the Meejer was blessed. Our dinner was an admirable meal; a blend of the resources of the luncheon-basket and of Mrs. Joyce; its only drawback being that, forgetful, as she herself admitted, of the precepts of the Meejer, she had put the teapot down “on the coals to dhraw,” and the result was a liquid that would have instantly made me sick, and would have kept my second cousin awake in agony till she died next morning. So we avoided the tea.{97} [Image unavailable.] “SITTING ON LITTLE STOOLS INSIDE THE BIG FIREPLACE.” {98} {99} “Back in the room” was a small whitewashed place with an earthern floor as clean, though not quite as dry, as the one in the kitchen. A big four-poster bed filled one end of it, and a red painted press, a square table, a huge American chest with the washing apparatus on it, and two or three chairs, were the rest of the furnishing. But though the upholstery was of a simple character, it was evident that the decorative sense was not lacking. The walls were lavishly hung with fervidly coloured religious prints; two or three sheets of an illustrated fishing fly-list had a place of honour near the widow’s patron saint over the fireplace, the gorgeous salmon flies being probably regarded by the younger Joyces as portraits of some new kind of angel; and drapery’s adventitious aid was lent by the suspended wardrobe of the family, both male and female, which relieved the severities of the bedposts, and gave a little air of interesting mystery to the corners of the room. Rather more than half the room had a rough ceiling of boards, and near the door we noticed a ladder leading up to the loft thus{100} made. We had felt anxious about the bestowal of the widow and her family, not knowing what duties the four-poster might not be called upon to perform, and as the witching hour of ten o’clock drew nigh, and the low murmur of Joyce discourse still continued, we had made up our minds to ask what the arrangements might be, when there came a tap at the door. “I beg yer honour’s pardon, Miss,” said our hostess’ soft, polite voice, “but would there be any harm in meself and the children goin’ above up to the loft?” We said no, quite the contrary, and after some whispering and giggling outside the door, a procession of Joyces slowly filed up the ladder, headed by the younger sons of the house, and followed by the widow and the daughters. The last pair of stout red legs was hoisted off the ladder, the rustling and pounding overhead gradually subsided, and my second cousin and I found ourselves face to face with the most serious situation—not excepting either the bulldog or the runaway—of the expedition. The fear of interruption had hitherto prevented us from making as thorough inves{101}tigation as we might have wished, and now we “stared at each other with a wild surmise, silent upon a peak in Darien.” Then she said— “I’ll look.” She turned down the bedclothes with a stiff, nervous hand. “They seem pretty clean,” she said at last; “they mayn’t perhaps have been washed very lately, but I think they must have dusted them. I can only see one crumb and a used wax match.” The account was not encouraging, but it might have been worse. Of the sufferings of that night, however, as much cannot be said. After our occupancy of that bed, not one used match, but twenty, might have been collected. In explanation of this circumstance, I will merely quote one line from the charming duet for bass and tenor in The Lily of Killarney— To light the way, to flea my love.","sourceLink":"http://novel.tingroom.com/duanpian/3080/85069.html","bookId":964,"book":{"id":964,"title":"Through Connemara in a governess cart","description":"简介： MY second cousin and I came to London for ten days in the middle of last June, and we stayed there for three weeks, waiting for a fine day.We were Irish, and all the English with whom we had hitherto come in contact had impressed upon us that we shou...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3080","creation":"Aug 1, 2019 12:24:02 AM","modification":"Aug 1, 2019 12:24:02 AM"}}
