{"id":88193,"no":4,"title":"Page 4","content":"And Carmine turned a lot of motherfucking corners.\\n\\n “Yeah, well, you should’ve saved your pennies. Your life would be easier if you would’ve let me rot.”\\n\\n “I bet you truly believe that,” Vincent said, glancing at his watch. “I have to get cleaned up for work. Just remember to ask Dia—”\\n\\n “I already said I heard you. How many times are you going to remind me?”\\n\\n “Until I know you won’t forget.”\\n\\n “Well, I won’t.”\\n\\n “Good,” he said, “because if you do, we’re going to have a problem.”\\n\\n Dia Harper drove an old Toyota, slate gray and missing two hubcaps. She’d bought it with money she earned freelancing, which meant she’d do nearly anything for a few bucks. Shopping, cleaning, passing messages . . . She’d even written a term paper for Carmine for fifty dollars once. A leak in the exhaust system made the car emit strong gas fumes that she tried to cover with a dozen tree-shaped air fresheners. Carmine wouldn’t be caught dead riding in it, but to Dia, the car was the Holy Grail.\\n\\n She was perched on the hood of it in the parking lot that morning when Carmine arrived at school. “I still don’t get it,” she said, shaking her head as soon as he stepped out. “Explain it again.”\\n\\n Carmine leaned against his black Mazda in the spot beside her. “There’s nothing to get. It is what it is.”\\n\\n “What is it?”\\n\\n “Sex,” he said, laughing at the bewildered expression on Dia’s face. Her blue eyes were hidden beneath layers of dark makeup, and she’d added some pink and purple streaks to her short blonde hair since yesterday. She defined eccentric in her mismatched clothes, her new bulky camera hanging by a strap around her neck. Nothing about Dia conformed, which was what had drawn Carmine to her in the first place. Although he was popular, there weren’t many people he considered friends. He felt there were two types of people in the small town of Durante, North Carolina, where they lived—those who wanted him, and those who wished they could be him. Dia was different, though. She was honest and, living in a world surrounded by nothing but lies, Carmine appreciated that.\\n\\n “But why Lisa?” Dia asked, refusing to drop the subject.\\n\\n Carmine looked across the parking lot at where a group of girls had gathered and shrugged when he spotted Lisa Donovan. She had long blonde hair, her body slim and skin darkly tanned. She looked like every other girl in school—nothing to write home about.\\n\\n Not that there was anyone at his home who gave a shit about his life . . .\\n\\n “She’s quick to get naked. Less work for me.”\\n\\n “Gross.” Dia wrinkled her nose. “You need a decent girl to straighten you out.”\\n\\n “I don’t need straightened out,” Carmine said. “Why drown in love when you can have so much fun swimming around in lust?”\\n\\n “But her?” Dia pressed. “Out of everyone in this school, you pick Moanin’ Lisa.”\\n\\n Carmine chuckled, tugging on a chunk of Dia’s colorful hair. “Looks like you’re the painting today, Warhol.”\\n\\n “Hey, I’ll take it,” she said. “Andy Warhol was one of the best.”\\n\\n “He was crazy.”\\n\\n “Maybe, but he was still a genius.” She nodded toward the group of girls. “Which Moanin’ Lisa, clearly, is not. I don’t think she can even string together a sentence. Have you tried to have an intelligent conversation with her? It’s like talking to a brick wall.”\\n\\n “No, we don’t do a lot of talking,” he said. “She’s not so bad from behind with her face shoved into a mattress, though.”\\n\\n Dia shook her head as Carmine laughed again. He had no real interest in Lisa, or any other girl for that matter. But while a relationship was the furthest thing from his mind, he’d realized there were benefits to keeping female company. They might not have been intellectually stimulating, but they did stimulate another part of him . . . often.\\n\\n A silver Audi whipped into the parking lot then, coming to a stop beside them. Dominic hopped out from behind the wheel and Tess, his girlfriend, climbed from the passenger seat. Tess was Dia’s twin sister, but the two couldn’t have been more opposite.\\n\\n They’d all known one another since they moved to the area in elementary school, but the relationship between Dominic and Tess was new. It was strange—the life Carmine had left wasn’t the same one he’d returned to, and he had a hard time adjusting to the change.\\n\\n “What are y’all up to?” Dominic asked.\\n\\n “Trying to get Carmine to see the error of his ways when it comes to Lisa,” Dia said. “It’s not working.”\\n\\n “Can’t say I’m surprised,” Tess said. “No girl with an ounce of self-respect would want him.”\\n\\n “I’m not that bad. I’m rich, popular. I have a sense of humor. I’m good looking, and not to mention I have a really big—” They all groaned loudly before he could finish. He shrugged, thinking he’d summed himself up nicely. “Besides, it’s not like I plan to date her. The only time you’ll catch me asking a girl out is after I’m done with her, and I’m asking her to get out.”\\n\\n “See, that’s why you’ll always be alone,” Tess said. “You only think about yourself.”\\n\\n “So says the vainest bitch alive,” he said. “You better be careful throwing stones in your glass house, Tess. You’re liable to get cut.”\\n\\n “Enough, you two,” Dominic said, stepping between them. “Carmine’s free to do whatever—or whomever—he wants, so get off his back. But, bro, you better watch yourself, threatening my girl.”\\n\\n “I didn’t threaten her. I warned her. She ought to thank me.”\\n\\n Rolling her eyes, Tess stalked off, and Dominic followed behind, calling her name. The routine happened daily: Tess gets mad, stomps away, and Dominic chases her like a dog.\\n\\n Carmine didn’t see the appeal. “He’s pathetic.”\\n\\n “He’s in love.”\\n\\n “If that’s what love does to you, you can definitely count me out.” He couldn’t imagine spending every waking moment of every day with the same person, doing the same shit they did the day before. “That has to be boring.”\\n\\n “And what you do isn’t?”\\n\\n He looked at her incredulously. “You think my life is boring? I get what I want, when I want it. I enjoy my freedom too much to give it away for some bitch.”\\n\\n Dia cringed. “Do you have to use that word?”\\n\\n “What word?”\\n\\n She glared at him but didn’t respond. Carmine knew what word she meant, but he didn’t see the big deal, considering it was just that—a word. Whatever happened to “sticks and stones can break my bones, but words can never hurt me”?\\n\\n The bell rang in the distance, signaling the start of school. “Here comes Moanin’ Lisa,” Dia said, hopping down from her car. “And yeah, a girl would be lucky to have you, Carmine, but not like this. You’re wasting your time, and it’s not worth it. You need to find something that is.”\\n\\n She scurried away before he had a chance to reply.\\n\\n “Hey, handsome,” Lisa said as she approached. She leaned against his car, beaming, but he pulled her away from it. He hated people touching his things. She didn’t notice, though, and ran her hand down his chest, fiddling with the buttons on his shirt. “You look good today.”\\n\\n “Thanks, but you know what would look really good today?”\\n\\n “What?”\\n\\n “Bocchino.” He brushed his pointer finger across her pink glossy lips. “That mouth on me.”\\n\\n A sharp pain ricocheted through Carmine’s head as warmth streamed down the side of his face. Every ounce of rationality left his body in a whoosh. He was bleeding. Again.\\n\\n Unacceptable.\\n\\n A frantic voice rung out, adamantly apologizing, but the words seemed distant as Carmine’s temper dangerously flared. He slammed the locker door that had struck him before pouncing, hurling a boy into another row of lockers, his clenched fist landing straight into his stomach.\\n\\n Someone stepped between them, and Carmine nearly swung again until their eyes connected. Coach Woods towered over him, nostrils flaring. “Principal’s office!”\\n\\n “Me? This is bullshit!”\\n\\n Coach Woods glared at him. “Don’t speak that way in my locker room! I’ll bench you!”\\n\\n As starting quarterback for the varsity football team, Carmine was usually afforded a bit of leniency, but he could tell from his coach’s expression that today was an exception. He grabbed a towel, holding it to his forehead to soak up the trickle of blood as he stormed out.\\n\\n The secretary in the front office barely glanced at Carmine when he busted in, throwing himself down in a chair to impatiently wait. She casually radioed the principal, notifying him someone was waiting. Principal Rutledge came out, merely casting Carmine a look that told him to join him. Carmine took his usual seat in the cracked brown leather chair in the small office, still clutching the towel to his head as he sprawled his legs out in front of him.\\n\\n “What happened this time?” It was a question Principal Rutledge seemed to have asked Carmine every week since his freshman year.\\n\\n “Someone hit me with a locker door.”\\n\\n “Intentionally?”\\n\\n Carmine shrugged. “Might as well have been.”\\n\\n The principal picked up his office phone, dialing a number he’d long ago memorized. Carmine glanced around the small space while he waited. He noticed a new picture frame on top of a filing cabinet with a photo of the man’s daughter, a curvy sophomore with brown hair and hazel eyes.\\n\\n “Your daughter’s looking good these days.”\\n\\n “Leave her alone, Carmine.”\\n\\n He chuckled but didn’t have time to respond before the principal focused on the call. “Dr. DeMarco, Jack Rutledge here . . . Yes . . . I’m doing well, how about you? Yes, well, there was an incident . . . He is injured . . . No, I don’t think the other boy is . . . He’s still in my office . . . No, he hasn’t been seen by the nurse.”\\n\\n Principal Rutledge looked at him. “Do you think you’ll need stitches?”\\n\\n Carmine shrugged, but the man didn’t wait for him to respond. “Yes, we do have a procedure in place for injured students . . . I understand that . . . With all due respect, I don’t think it’s that serious . . . No, you’re right; I’m not a doctor.” He paused, his eyes bulging. “Yes, the school’s insured, but I don’t think this is a case of negligence.”\\n\\n Carmine slowly smirked. Most people didn’t know what type of man his father truly was, but he managed to terrify the shit out of them anyway.\\n\\n “I’ll send him right over.” The principal hung up, eyeing him cautiously. “You need to go to the hospital to be checked out. I should’ve sent you right away. I don’t know what I was thinking.”\\n\\n Carmine stood. “Yeah, I don’t know, either.” \\n\\n","sourceLink":"https://allnovel.net/sempre-forever-1/page-4.html","bookId":2784,"book":{"id":2784,"title":"Sempre (Forever #1)","description":"Storyline: Sempre (Forever #1) \\n THIS IS A STORY ABOUT SACRIFICE . . . DEATH . . . LOVE . . . FREEDOM. THIS IS A STORY ABOUT FOREVER. \\n Haven Antonelli and Carmine DeMarco grew up under vastly different circumstances. Haven, a second-generation slave, was isolated in the middle of the desert, her days full of hard work and terrifying abuse. Carmine, born into a wealthy Mafia family, lived a life of privilege and excess. Now, a twist of fate causes their worlds to collide. Entangled in a web of secrets and lies, they learn that while different on the surface, they have more in common than anyone would think. In a world full of chaos, where money and power rule, Haven and Carmine yearn to break free, but a string of events that began before either of them were born threatens to destroy them instead. \\n Murder and betrayal are a way of life, and nothing comes without a price-especially not freedom. But how much will they have to sacrifice? Can they escape their pasts? And, most of all, what does it mean to be free?\\n","cover":"https://allnovel.net/images/sempre-forever-1.jpg","author":"J.M. Darhower","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/sempre-forever-1.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:25:48 PM"}}
