{"id":72573,"no":17,"title":"Page 17","content":"“That’s nice of you to offer,” Colin said. And it was sorta nice. No quarterback or cornerback or anyone else in any way associated with football had ever invited him to do anything. But Colin thought immediately of the reason he chose Katherine XIX over Marie Caravolli. In this world, Colin figured, you’re best off staying with your kind. “I don’t know how to shoot, though.”\\n\\n “Oh, I bet you’ll bag a hogzilla,” said TOC. Colin glanced over at Hassan, who opened his eyes wide and nodded subtly. For a split second, Colin thought of passing on the hog hunt, but he figured he owed it to Hassan. Part of not being a self-centered asshole, Colin reasoned, is doing things with your friends even when you don’t want to. Even if they could result in the death of a wild hog. “Okay,” Colin said, looking not at TOC but at Hass.\\n\\n And TOC said, “Sounds good. Listen, since y’all is here to look after the store till closing, I’m gonna head off. I gotta meet the boys down at the factory. We’re going bowling.”\\n\\n Now Lindsey put down the magazine. “I like bowling,” she said.\\n\\n “Boys night out, baby.”\\n\\n Lindsey fake-pouted, then smiled, and stood up to kiss TOC good-bye. He leaned across the counter, pecked her on the mouth, and strode out.\\n\\n They closed up the store early and went home, even though Hollis did not like to be interrupted before five-thirty. She was lying on the couch in the living room saying, “We need your help here. If you look at the price point—” and then she saw them walking in and said, “I need to call you back.” She hung up the phone. “Now I’ve told y’all—I work until five-thirty and I can’t be interrupted.”\\n\\n “Hollis, why are you selling land to that guy Marcus?”\\n\\n “That’s none of your business and I’ll thank you not to try and change the subject. Y’all stay out of the house until five-thirty. I’m paying you to work, remember. And Lindsey Lee Wells, I know you weren’t down at Mr. Jaffrey’s house today. Don’t think I don’t find these things out.”\\n\\n “I’ve got a date tonight, so I’ll be skipping dinner,” Hassan interjected.\\n\\n “And I’m taking Colin to dinner,” Lindsey said. “This Colin,” she clarified, her extended pointer finger poking his bicep. Hollis beamed; Colin looked over at Lindsey with equal parts surprise and confusion.\\n\\n “Well, I guess I can do some work this evening with y’all out then,” Hollis said.\\n\\n Colin spent his remaining pre-“date” hours working on the Theorem. Within thirty minutes, he’d nailed K-19. The problem, as it turned out, was not so much bad math as false hope: Colin had been trying to tweak the Theorem to make K-19’s graph look like:\\n\\n In short, he had been counting upon a reunion. He’d been assuming that the Theorem could see into the future, when K-19 would return to him. But the Theorem, he decided, couldn’t take into account its own influence. So then with the same formula he’d worked out before, in the car with Lindsey, 65 Colin managed to get it to reflect his relationship with Katherine XIX up until now:\\n\\n By five o’clock, he was perilously close. He had captured the Katherine roller coaster eighteen times. But what he hadn’t done was quite important—he hadn’t gotten Katherine III on paper, and one cannot take an equation that predicts eighteen out of nineteen Katherines to the Nobel Prize Committee. 66 For the next two hours, he thought of every facet of Katherine III (given name: Katherine Mutsensberger) with the precision and clarity that made his brain so unusual. And yet he could not fix what he came to call the III Anomaly. The equation that correctly predicted the other eighteen came out looking like this:\\n\\n The graph’s smiley-facedness indicated that Colin had not been dumped by III but had dumped her, which was ludicrous. He could remember every-thingabout Katherine III, and the rest of them, too, of course—he remembered everything about everything—and yet something about Katherine III clearly eluded him.\\n\\n As he worked on the Theorem, Colin was so focused that the world outside his notebook seemed not to exist, so he jolted upright in surprise when he heard, from behind him, Lindsey say, “Time for dinner, dude.” He turned around to see her head peeking through the open door. She wore a blue cotton tank top with tight blue jeans, Converse All Stars, and—as if she knew what he liked—no makeup. She looked, well, pretty—even not smiling. Colin glanced down at his jeans and yellow KranialKidz T-shirt. “Don’t dress up on account of me,” Lindsey said, smiling. “We gotta get going, anyway.”\\n\\n They came downstairs just in time to look through the screen door and see Hassan get into Katrina’s SUV. Hassan handed her a sagging pink rose he’d plucked from the mansion’s garden. She smiled, and then they kissed. Lo r d. Colin had seen it with his own eyes: Hassan kissing a girl who had to have been Homecoming Queen.\\n\\n “Was Katrina Homecoming Queen?”\\n\\n “No I was,” Lindsey responded immediately.\\n\\n “Really?”\\n\\n Lindsey pursed her lips. “Well, no, but you don’t have to sound so surprised about it! Katrina was on the Court, though.” She stopped and shouted toward the kitchen, “Hey, Hollis! We’re leaving. We might be back late. Hot sex and all!”\\n\\n “Have fun!” replied Hollis. “Call if you’ll be out past twelve!”\\n\\n They drove downtown, to the gas station/Taco Hell, where they ordered at the drive-thru. They both peered through the accordion window, Lindsey leaning over Colin to catch a glimpse of Hassan and Katrina eating.\\n\\n “She seems to really like him,” Lindsey said. “I mean, I really like him, too. I don’t want to sound mean. I’m just surprised. She usually goes for, um, the dumb, hot ones.”\\n\\n “So she’s like you.”\\n\\n “Watch it. I’m paying for your dinner, after all.”\\n\\n They took their chicken soft tacos and drove off, and finally Colin decided to ask what was going on.\\n\\n “Um, why are we going out for dinner together?”\\n\\n “Well, three reasons. First, because I’ve been thinking about our Theorem and I have a question. How does it work if you’re gay?”\\n\\n “Huh?”\\n\\n “Well it’s all graph-going-up means boy dumps girl and graph-going-down means girl dumps boy, right? But what if they’re both boys?”\\n\\n “It doesn’t matter. You just assign a position to each person. Instead of being ‘b’ and ‘g,’ it could just as easily be ‘b1’ and ‘b2.’ That’s how algebra works.”\\n\\n “Which would explain my C-minus. Okay. Thank God. I was really worried that it would only help the straights, and that’s not much of a Theorem. Reason two is I’m trying to get Hollis to like me, and she likes you, so if I like you, she’ll like me.” Colin was looking at her, confused. “C-minus in algebra; A-plus in coolology. See, popularity is complicated, yo. You have to spend a lot of time thinking about liking; you have to really like being liked, and also sorta like being disliked.” Colin listened intently, nibbling the inside of his thumb. Listening to Lindsey talk about popularity made him feel a little bit of the mysterium tremendum. “Anyway,” she went on, “I need to find out what’s going on with her selling land. That guy Marcus built this cookie-cutter house subdivision south of Bradford. I mean, it’s vomitous. Hollis would never stand for that shit.”\\n\\n “Oh, okay,” Colin said, feeling a bit like a pawn.\\n\\n “And reason three,” Lindsey said, “is I gotta teach you how to shoot so you don’t embarrass yourself.”\\n\\n “Shoot a gun?”\\n\\n “A shotgun. I put one in your trunk this afternoon.” Colin nervously glanced toward the back. “It won’t bite,” Lindsey said.\\n\\n “Where did you get a gun?”\\n\\n “Where did I get it? Smartypants, getting a gun in Gutshot, Tennessee, is easier than getting chlamydia from a hooker.”\\n\\n Twenty minutes later, they were sitting in a grassy field on the edge of a thick f o rested area that, Lindsey said, belonged to Hollis but would soon belong to Marcus. The field, overgrown with wildflowers and the occasional tre sapling, was nonetheless fenced in by an interweaving series of chopped logs.\\n\\n “Why is there a fence?”\\n\\n “Used to be we had a horse named Hobbit that grazed here, but then he died.”\\n\\n “He was your horse?”\\n\\n “Yup. Well, Hollis’s, too. Hollis got him from my father as a wedding present, and then when I was born—six months later—Hollis gave him to me. He was the gentlest horse, Hobbit. I could ride him from the time I was three.”\\n\\n “So are your parents divorced?”\\n\\n “No, not officially. But you know what they say about Gutshot: the population never goes up and never goes down, because every time a woman gets pregnant, a man leaves town.” Colin laughed. “He left when I was one. He calls a couple times a year, but Hollis never makes me talk to him. I don’t know the guy, and I don’t really care to. How ’bout you?”\\n\\n “My parents are still married. I have to call them at the same time every night—in thirty minutes, actually. They’re overprotective, I guess, but normal. We’re really boring.”\\n\\n “You’re not boring. You’ve got to stop saying that, or people will start believing you. Now, about the gun.” Lindsey jumped up and ran back across the field and hurdled the fence. Colin followed her at a more sustainable pace. He did not, as a rule, believe in running. “Pop the trunk,” Lindsey shouted.\\n\\n Colin unlocked the trunk and found a long, double-barreled shotgun with a stained wooden handle. Lindsey picked up the gun, handed it to Colin, and said, “Point it at the sky.” She grabbed a square paper box, and then they marched back, over the fence and across the field.\\n\\n Looking like an expert, Lindsey cracked open the gun, pulled two cylindrical shells from the paper box, and inserted them. “When this shit is loaded, you don’t point it at me, hear?” She snapped the gun shut, held it up to her shoulder, and then carefully handed it over to Colin.\\n\\n She moved behind him and helped him hold the gun against his shoulder. He could feel her breasts against his shoulder blades, her feet by his feet, her stomach against his back. “Tuck it tight against your shoulder,” she said, and he did. “The safety’s here,” she said, reaching up and guiding his hand to a steel switch on the side of the gun. He’d never held a gun before. It felt simultaneously exciting and deeply wrong.\\n\\n “Now when you shoot it,” she said, her breath against the nape of his neck, “you don’t pull the trigger. You just reach in there and you squeeze it. Just squeeze it softly. I’m going to take a step back and then you just squeeze, okay?”\\n\\n “What should I aim at?”\\n\\n “You couldn’t hit the broadside of a barn, so just aim straight ahead.” Colin felt the absence of Lindsey on his back, and then he—ever so softly—squeezed the trigger.\\n\\n The blast hit his ears at the same moment it hit his right shoulder, and the force of the gun caused his arm to pull up and his legs to fall out from under him and he found himself sitting on his ass in a field of wildflowers with the gun pointing to the sky. “Well,” he said. “That was fun.”\\n\\n Lindsey was laughing. “See, that’s why we’re here, so you don’t fall on your ass in front of Colin and Chase and everybody. You’ve got to learn to prepare for that kick.”\\n\\n And so over the course of the next hour, Colin shot the holy living hell out of the oak trees before him, pausing only to reload the gun and call his parents. He shot forty-four shells into the forest, and then, when his right arm was numb and he felt like he’d been punched repeatedly in the shoulder by a champion boxer, he said, “Why don’t you try?” Lindsey shook her head and sat down on the grass. Colin followed her down.\\n\\n “Oh, I don’t shoot guns. I’m terrified of them,” she said.\\n\\n “Are you shitting me?”\\n\\n “No. Plus that’s a ten-gauge. I wouldn’t shoot a ten-gauge for a thousand dollars. They kick like a goddamned mule.”\\n\\n “Then why did—”\\n\\n “Like I said, I don’t want you to look like a pussy.”\\n\\n Colin wanted to continue the conversation but didn’t quite know how, so he lay back and rubbed his sore shoulder. On the whole, Gutshot had been physically unkind to him: a puffy scar above his eye, forty-four distinct shoulder bruises, and of course a still-painful gaping hole in his gut. And yet, somehow, he liked the place.\\n\\n He noticed that she was lying next to him, her arms crossed beneath her head. She kicked at his shin playfully to get his attention. “What?” he asked.\\n\\n “I was thinking about this girl you love so much,” she said. “And this place I love so much. And how that happens. How you can just fall into it. This land Hollis is selling, the thing about it is—well, I’m partly mad because I don’t want there to be some bullshit McMansion subdivision up there, but also partly because my secret hideout is up there.”\\n\\n “Your what?”\\n\\n “My secret hideout. My super, incredibly top secret location that no one on earth knows about.” Lindsey paused and turned her head away from the starstruck sky and toward Colin. “You wanna see it?”\\n\\n The End (of the Middle)\\n\\n “I don’t want to flatter myself,” said Katherine I in between sips of coffee at Café Sel Marie, “but it does feel a little special, that it all began with me.”\\n\\n “Well,” said Colin, who was drinking milk with a shot of coffee in it, “there’s three ways to look at it. Either (1) it’s a massive coincidence that all the girls I ever liked happen to share the same nine letters, or (2) I just happen to think it a particularly beautiful name, or (3) I never got over our two-and-a-half-minute relationship.” \\n\\n","sourceLink":"https://allnovel.net/an-abundance-of-katherines/page-17.html","bookId":2701,"book":{"id":2701,"title":"An Abundance of Katherines","description":"Storyline: Katherine V thought boys were gross \\n Katherine X just wanted to be friends \\n Katherine XVIII dumped him in an e-mail \\n K-19 broke his heart \\n When it comes to relationships, Colin Singleton\u0027s type happens to be girls named Katherine. And when it comes to girls named Katherine, Colin is always getting dumped. Nineteen times, to be exact. \\n On a road trip miles from home, this anagram-happy, washed-up child prodigy has ten thousand dollars in his pocket, a bloodthirsty feral hog on his trail, and an overweight, Judge Judy-loving best friend riding shotgun--but no Katherines. Colin is on a mission to prove The Theorem of Underlying Katherine Predictability, which he hopes will predict the future of any relationship, avenge Dumpees everywhere, and finally win him the girl. Love, friendship, and a dead Austro-Hungarian archduke add up to surprising and heart-changing conclusions in this ingeniously layered comic novel about reinventing oneself.\\n","cover":"https://allnovel.net/images/an-abundance-of-katherines.jpg","author":"John Green","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/an-abundance-of-katherines.html","creation":"Oct 5, 2019 8:59:10 AM","modification":"Oct 5, 2019 10:24:23 AM"}}
