{"id":41895,"no":38,"title":"Chapter 38","content":"MAKING them pens was a distressid tough job, and so was the saw; and Jim allowed the inscription was going to be the toughest of all. That\u0027s the one which the prisoner has to scrabble on the wall. But he had to have it; Tom said he\u0027d GOT to; there warn\u0027t no case of a state prisoner not scrabbling his inscription to leave behind, and his coat of arms. \\n\\n \"Look at Lady Jane Grey,\" he says; \"look at Gilford Dudley; look at old Northumberland! Why, Huck, s\u0027pose it IS considerble trouble? -- what you going to do? -- how you going to get around it? Jim\u0027s GOT to do his inscription and coat of arms. They all do.\" \\n\\n Jim says: \\n\\n \"Why, Mars Tom, I hain\u0027t got no coat o\u0027 arm; I hain\u0027t got nuffn but dish yer ole shirt, en you knows I got to keep de journal on dat.\" \\n\\n \"Oh, you don\u0027t understand, Jim; a coat of arms is very different.\" \\n\\n \"Well,\" I says, \"Jim\u0027s right, anyway, when he says he ain\u0027t got no coat of arms, because he hain\u0027t.\" \\n\\n \"I reckon I knowed that,\" Tom says, \"but you bet he\u0027ll have one before he goes out of this -- because he\u0027s going out RIGHT, and there ain\u0027t going to be no flaws in his record.\" \\n\\n So whilst me and Jim filed away at the pens on a brickbat apiece, Jim a-making his\u0027n out of the brass and I making mine out of the spoon, Tom set to work to think out the coat of arms. By and by he said he\u0027d struck so many good ones he didn\u0027t hardly know which to take, but there was one which he reckoned he\u0027d decide on. He says: \\n\\n \"On the scutcheon we\u0027ll have a bend OR in the dexter base, a saltire MURREY in the fess, with a dog, couchant, for common charge, and under his foot a chain embattled, for slavery, with a chevron VERT in a chief engrailed, and three invected lines on a field AZURE, with the nombril points rampant on a dancette indented; crest, a runaway nigger, SABLE, with his bundle over his shoulder on a bar sinister; and a couple of gules for supporters, which is you and me; motto, MAGGIORE FRETTA, MINORE OTTO. Got it out of a book -- means the more haste the less speed.\" \\n\\n \"Geewhillikins,\" I says, \"but what does the rest of it mean?\" \\n\\n \"We ain\u0027t got no time to bother over that,\" he says; \"we got to dig in like all git-out.\" \\n\\n \"Well, anyway,\" I says, \"what\u0027s SOME of it? What\u0027s a fess?\" \\n\\n \"A fess -- a fess is -- YOU don\u0027t need to know what a fess is. I\u0027ll show him how to make it when he gets to it.\" \\n\\n \"Shucks, Tom,\" I says, \"I think you might tell a person. What\u0027s a bar sinister?\" \\n\\n \"Oh, I don\u0027t know. But he\u0027s got to have it. All the nobility does.\" \\n\\n That was just his way. If it didn\u0027t suit him to explain a thing to you, he wouldn\u0027t do it. You might pump at him a week, it wouldn\u0027t make no difference. \\n\\n He\u0027d got all that coat of arms business fixed, so now he started in to finish up the rest of that part of the work, which was to plan out a mournful inscription -- said Jim got to have one, like they all done. He made up a lot, and wrote them out on a paper, and read them off, so: \\n\\n 1. Here a captive heart busted. 2. Here a poor prisoner, forsook by the world and friends, fretted his sorrowful life. 3. Here a lonely heart broke, and a worn spirit went to its rest, after thirty-seven years of solitary captivity. 4. Here, homeless and friendless, after thirty-seven years of bitter captivity, perished a noble stranger, natural son of Louis XIV. \\n\\n Tom\u0027s voice trembled whilst he was reading them, and he most broke down. When he got done he couldn\u0027t no way make up his mind which one for Jim to scrabble on to the wall, they was all so good; but at last he allowed he would let him scrabble them all on. Jim said it would take him a year to scrabble such a lot of truck on to the logs with a nail, and he didn\u0027t know how to make letters, besides; but Tom said he would block them out for him, and then he wouldn\u0027t have nothing to do but just follow the lines. Then pretty soon he says: \\n\\n \"Come to think, the logs ain\u0027t a-going to do; they don\u0027t have log walls in a dungeon: we got to dig the inscriptions into a rock. We\u0027ll fetch a rock.\" \\n\\n Jim said the rock was worse than the logs; he said it would take him such a pison long time to dig them into a rock he wouldn\u0027t ever get out. But Tom said he would let me help him do it. Then he took a look to see how me and Jim was getting along with the pens. It was most pesky tedious hard work and slow, and didn\u0027t give my hands no show to get well of the sores, and we didn\u0027t seem to make no headway, hardly; so Tom says: \\n\\n \"I know how to fix it. We got to have a rock for the coat of arms and mournful inscriptions, and we can kill two birds with that same rock. There\u0027s a gaudy big grindstone down at the mill, and we\u0027ll smouch it, and carve the things on it, and file out the pens and the saw on it, too.\" \\n\\n It warn\u0027t no slouch of an idea; and it warn\u0027t no slouch of a grindstone nuther; but we allowed we\u0027d tackle it. It warn\u0027t quite midnight yet, so we cleared out for the mill, leaving Jim at work. We smouched the grindstone, and set out to roll her home, but it was a most nation tough job. Sometimes, do what we could, we couldn\u0027t keep her from falling over, and she come mighty near mashing us every time. Tom said she was going to get one of us, sure, before we got through. We got her half way; and then we was plumb played out, and most drownded with sweat. We see it warn\u0027t no use; we got to go and fetch Jim So he raised up his bed and slid the chain off of the bed-leg, and wrapt it round and round his neck, and we crawled out through our hole and down there, and Jim and me laid into that grindstone and walked her along like nothing; and Tom superintended. He could out-superintend any boy I ever see. He knowed how to do everything. \\n\\n Our hole was pretty big, but it warn\u0027t big enough to get the grindstone through; but Jim he took the pick and soon made it big enough. Then Tom marked out them things on it with the nail, and set Jim to work on them, with the nail for a chisel and an iron bolt from the rubbage in the lean-to for a hammer, and told him to work till the rest of his candle quit on him, and then he could go to bed, and hide the grindstone under his straw tick and sleep on it. Then we helped him fix his chain back on the bed-leg, and was ready for bed ourselves. But Tom thought of something, and says: \\n\\n \"You got any spiders in here, Jim?\" \\n\\n \"No, sah, thanks to goodness I hain\u0027t, Mars Tom.\" \\n\\n \"All right, we\u0027ll get you some.\" \\n\\n \"But bless you, honey, I doan\u0027 WANT none. I\u0027s afeard un um. I jis\u0027 \u0027s soon have rattlesnakes aroun\u0027.\" \\n\\n Tom thought a minute or two, and says: \\n\\n \"It\u0027s a good idea. And I reckon it\u0027s been done. It MUST a been done; it stands to reason. Yes, it\u0027s a prime good idea. Where could you keep it?\" \\n\\n \"Keep what, Mars Tom?\" \\n\\n \"Why, a rattlesnake.\" \\n\\n \"De goodness gracious alive, Mars Tom! Why, if dey was a rattlesnake to come in heah I\u0027d take en bust right out thoo dat log wall, I would, wid my head.\" \\n\\n Why, Jim, you wouldn\u0027t be afraid of it after a little. You could tame it.\" \\n\\n \"TAME it!\" \\n\\n \"Yes -- easy enough. Every animal is grateful for kindness and petting, and they wouldn\u0027t THINK of hurting a person that pets them. Any book will tell you that. You try -- that\u0027s all I ask; just try for two or three days. Why, you can get him so in a little while that he\u0027ll love you; and sleep with you; and won\u0027t stay away from you a minute; and will let you wrap him round your neck and put his head in your mouth.\" \\n\\n \"PLEASE, Mars Tom -- DOAN\u0027 talk so! I can\u0027t STAN\u0027 it! He\u0027d LET me shove his head in my mouf -- fer a favor, hain\u0027t it? I lay he\u0027d wait a pow\u0027ful long time \u0027fo\u0027 I AST him. En mo\u0027 en dat, I doan\u0027 WANT him to sleep wid me.\" \\n\\n \"Jim, don\u0027t act so foolish. A prisoner\u0027s GOT to have some kind of a dumb pet, and if a rattlesnake hain\u0027t ever been tried, why, there\u0027s more glory to be gained in your being the first to ever try it than any other way you could ever think of to save your life.\" \\n\\n \"Why, Mars Tom, I doan\u0027 WANT no sich glory. Snake take \u0027n bite Jim\u0027s chin off, den WHAH is de glory? No, sah, I doan\u0027 want no sich doin\u0027s.\" \\n\\n \"Blame it, can\u0027t you TRY? I only WANT you to try -- you needn\u0027t keep it up if it don\u0027t work.\" \\n\\n \"But de trouble all DONE ef de snake bite me while I\u0027s a tryin\u0027 him. Mars Tom, I\u0027s willin\u0027 to tackle mos\u0027 anything \u0027at ain\u0027t onreasonable, but ef you en Huck fetches a rattlesnake in heah for me to tame, I\u0027s gwyne to LEAVE, dat\u0027s SHORE.\" \\n\\n \"Well, then, let it go, let it go, if you\u0027re so bullheaded about it. We can get you some garter-snakes, and you can tie some buttons on their tails, and let on they\u0027re rattlesnakes, and I reckon that \u0027ll have to do.\" \\n\\n \"I k\u0027n stan\u0027 DEM, Mars Tom, but blame\u0027 \u0027f I couldn\u0027 get along widout um, I tell you dat. I never knowed b\u0027fo\u0027 \u0027t was so much bother and trouble to be a prisoner.\" \\n\\n \"Well, it ALWAYS is when it\u0027s done right. You got any rats around here?\" \\n\\n \"No, sah, I hain\u0027t seed none.\" \\n\\n \"Well, we\u0027ll get you some rats.\" \\n\\n \"Why, Mars Tom, I doan\u0027 WANT no rats. Dey\u0027s de dadblamedest creturs to \u0027sturb a body, en rustle roun\u0027 over \u0027im, en bite his feet, when he\u0027s tryin\u0027 to sleep, I ever see. No, sah, gimme g\u0027yarter-snakes, \u0027f I\u0027s got to have \u0027m, but doan\u0027 gimme no rats; I hain\u0027 got no use f\u0027r um, skasely.\" \\n\\n \"But, Jim, you GOT to have \u0027em -- they all do. So don\u0027t make no more fuss about it. Prisoners ain\u0027t ever without rats. There ain\u0027t no instance of it. And they train them, and pet them, and learn them tricks, and they get to be as sociable as flies. But you got to play music to them. You got anything to play music on?\" \\n\\n \"I ain\u0027 got nuffn but a coase comb en a piece o\u0027 paper, en a juice-harp; but I reck\u0027n dey wouldn\u0027 take no stock in a juice-harp.\" \\n\\n \"Yes they would. THEY don\u0027t care what kind of music \u0027tis. A jews-harp\u0027s plenty good enough for a rat. All animals like music -- in a prison they dote on it. Specially, painful music; and you can\u0027t get no other kind out of a jews-harp. It always interests them; they come out to see what\u0027s the matter with you. Yes, you\u0027re all right; you\u0027re fixed very well. You want to set on your bed nights before you go to sleep, and early in the mornings, and play your jewsharp; play \u0027The Last Link is Broken\u0027 -- that\u0027s the thing that \u0027ll scoop a rat quicker \u0027n anything else; and when you\u0027ve played about two minutes you\u0027ll see all the rats, and the snakes, and spiders, and things begin to feel worried about you, and come. And they\u0027ll just fairly swarm over you, and have a noble good time.\" \\n\\n \"Yes, DEY will, I reck\u0027n, Mars Tom, but what kine er time is JIM havin\u0027? Blest if I kin see de pint. But I\u0027ll do it ef I got to. I reck\u0027n I better keep de animals satisfied, en not have no trouble in de house.\" \\n\\n Tom waited to think it over, and see if there wasn\u0027t nothing else; and pretty soon he says: \\n\\n \"Oh, there\u0027s one thing I forgot. Could you raise a flower here, do you reckon?\" \\n\\n \"I doan know but maybe I could, Mars Tom; but it\u0027s tolable dark in heah, en I ain\u0027 got no use f\u0027r no flower, nohow, en she\u0027d be a pow\u0027ful sight o\u0027 trouble.\" \\n\\n \"Well, you try it, anyway. Some other prisoners has done it.\" \\n\\n \"One er dem big cat-tail-lookin\u0027 mullen-stalks would grow in heah, Mars Tom, I reck\u0027n, but she wouldn\u0027t be wuth half de trouble she\u0027d coss.\" \\n\\n \"Don\u0027t you believe it. We\u0027ll fetch you a little one and you plant it in the corner over there, and raise it. And don\u0027t call it mullen, call it Pitchiola -- that\u0027s its right name when it\u0027s in a prison. And you want to water it with your tears.\" \\n\\n \"Why, I got plenty spring water, Mars Tom.\" \\n\\n \"You don\u0027t WANT spring water; you want to water it with your tears. It\u0027s the way they always do.\" \\n\\n \"Why, Mars Tom, I lay I kin raise one er dem mullen-stalks twyste wid spring water whiles another man\u0027s a START\u0027N one wid tears.\" \\n\\n \"That ain\u0027t the idea. You GOT to do it with tears.\" \\n\\n \"She\u0027ll die on my han\u0027s, Mars Tom, she sholy will; kase I doan\u0027 skasely ever cry.\" \\n\\n So Tom was stumped. But he studied it over, and then said Jim would have to worry along the best he could with an onion. He promised he would go to the nigger cabins and drop one, private, in Jim\u0027s coffeepot, in the morning. Jim said he would \"jis\u0027 \u0027s soon have tobacker in his coffee;\" and found so much fault with it, and with the work and bother of raising the mullen, and jews-harping the rats, and petting and flattering up the snakes and spiders and things, on top of all the other work he had to do on pens, and inscriptions, and journals, and things, which made it more trouble and worry and responsibility to be a prisoner than anything he ever undertook, that Tom most lost all patience with him; and said he was just loadened down with more gaudier chances than a prisoner ever had in the world to make a name for himself, and yet he didn\u0027t know enough to appreciate them, and they was just about wasted on him. So Jim he was sorry, and said he wouldn\u0027t behave so no more, and then me and Tom shoved for bed. \\n\\n 　　因此，我和吉姆各自在一个砖块上拼命磨笔，吉姆磨的是那支铜蜡台，我磨的是那把匙子，汤姆开动脑筋想徽章。后来，他说他有了许多好的构思，他几乎不知道该用哪个。等他把徽章的事儿全想好了，就开始完成剩下的那部分工作，也就是要想出一句伤心的题词- 他说他们全留了题词，吉姆也得留一句。他想起来很多，还把它们写到一张纸上，念出来给我们听，题词如下：1 1 这里一颗囚犯的心碎了。\\n\\n 　　2 1 这是一个不幸的囚犯，被世界跟朋友们所遗忘，在苦恼中煎熬着伤心的岁月。\\n\\n 　　3 1 这里一颗孤独的心碎了，一个疲惫的灵魂安息了，他忍受了37 年凄苦的囚禁。\\n\\n 　　4 1 这是一个无名贵族的丧命之处，他无亲无故，经历了37 年辛酸的铁窗生涯，他是路易十四的私生子。\\n\\n 　　汤姆念的时候声音发颤，简直快挺不住了。念完以后，他拿不定主意让吉姆在墙上刻上哪句，它们都是这么好，最后他觉得应该让他统统刻上去。吉姆说要用钉把这一堆废话全刻到木头上得花他一年的时间，再说他还不知道怎么写字；而汤姆说他替他划上底儿，他就照着他的比划刻就行了。后来，他又说：\"你想想看，木头是不行的，地牢里可没木头墙，咱们得把题词凿到石头上。我们去搬块石头。\"吉姆说石头比木头更糟，他说不知得花多久才能凿在石头上，他甭想出去了。可汤姆说他会让我帮他凿。然后他看了看我和吉姆把笔磨得怎样了。这活计烦死了，单调费劲，干起来又慢，我手上磨破的伤口连恢复的机会都没有，我们几乎没什么进展。于是，汤姆说：\"我知道怎么做了。反正我们是得找块石头凿徽章和伤心题词，我们就拿那块石头来个一举两得。锯木厂那边有一块很好的大磨石，而我们很好把它偷回来，在上面划字，而且又能磨笔和锯。\"这个主意不错，而那块磨石也很好，于是我们认为得动手去搬。这时还不到正半夜，我们就向锯木厂跑去，留吉姆一个人干活儿。我们偷出磨石，推着朝前滚，那可真费劲。有时，我们使足了劲推它，却阻止不了它倒着滚，并且每回都险些压住我们。汤姆说等不到我们把它推回家，它就会压死我们当中的一个。我们把它推到半路，就彻底垮了，光是汗水就可以把我们淹死了。我们看到实在不行了，非得回去叫吉姆来不可。于是，他抬起床，把铁链从床腿上褪下去，一圈一圈缠在他脖子上，我们从洞里爬出来，跑到那里，我和吉姆推着那个磨石，让它乖乖地向前走，毫不费劲，汤姆指挥，他比哪个男孩指挥得都棒，他什么事也在行。\\n\\n 　　我们的洞很大，可再大也滚不过去那块磨石。吉姆拿镐，很快就把它挖得足够大了。然后，汤姆拿钉子在上面把那些话划上去，让吉姆开始刻，用钉当凿子，又打斜棚里找了一把铁门闩当锤子用，让他干到那半截蜡烛点完时，才可以去睡觉，还要把磨石藏到他草垫底下，他睡在上面。后来，我们帮他把铁链子套到床腿上，我们也打算去睡觉。可是，汤姆猛地想到了什么，他说：\"你这儿有蜘蛛吗，吉姆？\"\"没有，您哪。谢天谢地，我这儿没，汤姆少爷。\"\"好吧，我们给你弄几只来。\"\"天哪，宝贝儿。我一只也不要。我怕那东西，还不如让响尾蛇呆在我身边呢。\"汤姆想了一两分钟，说：\"是个妙主意。我看有人这么做过，一定有人这么干过，它合乎情理。对，这是个绝妙的好主意。你把它养到哪儿？\"\"养什么呀，汤姆少爷？\"\"哎，响尾蛇呀。\"\"天地良心哪，汤姆少爷！唉，如果真有条响尾蛇爬进这里来，我一刻也不等就用脑袋撞，钻出这木头墙，真的。\"\"哎，吉姆，用不了多久，你就不会怕了。你可以把它养熟呀。\"\"养熟它！\"\"对，十分容易。每一个动物对善意与抚爱都是感激的，它们就是想也想不到伤害一个抚爱它们的人。哪一本书都会告诉你这个道理。你试一试--这是我的全部要求。只试两天。啊，过不了多久，你就能把它养熟，它就会爱你，跟你一起睡，一刻也离不开你，还会让你把它缠在你脖子上，把它的头伸进你的嘴里。\"\"求求您，汤姆少爷，别说这些话啦！我受不了！它会让我准许它的头伸我的嘴里去，为了赏脸，对吗？我让它等上多少年也别想让我去请它。还不止这个，我也不让它跟我一起睡。\"\"吉姆，做事别这样傻。囚犯非得有个小动物当玩意儿，要没有人试过养响尾蛇，你第一个尝试就会得到很大的光荣，这种光荣是你用别的什么办法也得不到的。\"\"唉，汤姆少爷，我宁肯不要这份儿光荣。蛇会把我的下巴给咬掉，那光荣还算什么？不，您哪，我可不干那种事儿。\"\"该死，你连试试都不行吗？我只想叫你试试--要不行，你就不必养下去。\"\"如果我正试的时候，蛇把我给咬了，那可算是罪受够了。汤姆少爷，只要合情理，啥事儿我也愿意做，可要你和哈克弄条响尾蛇放这里叫我养，我就离开，真的。\"\"好吧，算了算了，你这么倔。我们给你弄几条小花蛇吧，你可以在蛇尾巴上拴上几个扣子，就当是响尾蛇，我看这总可以办到。\"\"这个我还能接受，汤姆少爷，不过我跟你说老实话，要是没这种蛇我就活不了，那才真叫该死呢。以前我从来不知道，做个囚犯这么费劲，这么麻烦。\"\"啊，要想做得对，就得这样。你这儿有老鼠吗？\"\"没有，您哪，我没看见过。\"\"好吧，我们给你带几只老鼠。\"\"啊，汤姆少爷，我不要老鼠。这是最让人生厌的东西，人家想睡的时候，它便来打搅，弄得吱吱响，还咬他的脚。我全见过。不要，您哪，要我非得养小动物不可，就给我小花蛇吧，别给我老鼠，它们对我一点用也没有。\"\"可是，吉姆，你非得有不行--他们全有。所以，别大惊小怪了。囚犯没有不跟老鼠在一起的。还没这种先例呢。他们训练老鼠，逗它们玩，教它们把戏，它们就可以和人相处得挺好，跟苍蝇一样。不过你还得给它们演奏音乐。你有东西奏乐吗？\"\"什么都没有。只有一把粗糙的梳子跟一片纸，还有个单簧口琴，不过我想它们不至于对口琴感兴趣吧？\"\"它们会的。它们才不管是什么音乐呢。老鼠听口琴够不错的了。全体动物都喜欢音乐--在监狱里它们对音乐着迷，尤其是悲痛的音乐，口琴你也吹不出别的调儿。它们总对这个感兴趣，它们全钻出来看看你碰上了什么伤心事。对，你能行，你的乐器也很好。在晚上睡觉前，早上起床后，你坐到床上，吹吹口琴，就吹那首《断情》--那首曲子很合适，能把老鼠招过来，比啥都快。等你吹上两分钟，你就会看到所有的老鼠、蛇、蜘蛛，这些东西全都开始为你担心发愁，上你这儿来，它们会蜂拥而至，爬到你身上，玩个高兴痛快。\"\"是啊，它们会的，我想会的，汤姆少爷。可我吉姆会玩成什么样啊？我要是会明白才怪呢。不过我要是非这么做不可，我就做。我看我最好是既能让这些小动物感到满意，还别给这屋子招惹麻烦。\"吉姆对这些事发了许多牢骚，他抱怨让他给老鼠吹口琴，还得逗蛇、蜘蛛这些东西玩儿，上它们高兴，最费事的是他非得拿笔刻题词、写日记等等，弄得他做个囚犯倒比他干什么也麻烦，着急担心又责任重大，说得汤姆对他几乎失去了所有的耐心。他说吉姆被赋予比世界上任何一个囚犯都更多更好的可以成名的机会，可他偏不知道珍惜，这些机会落到他身上，简直是浪费。于是，说得吉姆十分难过，吉姆说他再也不这么埋怨了，我和汤姆这才摸回去睡觉。\\n\\n \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/71/3918.html","bookId":546,"book":{"id":546,"title":"The Adventures of Huckleberry Finn哈克贝里·芬历险记","description":"简介： Adventures of Huckleberry Finn is a book by Mark Twain, first published in England in December 1884 and in the United States in February 1885. Commonly recognized as one of the Great American Novels, the work is among the first in major American ...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1286419638512bd.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/71","creation":"Aug 1, 2019 12:18:56 AM","modification":"Aug 1, 2019 12:18:56 AM"}}
