{"id":41896,"no":39,"title":"Chapter 39","content":"IN the morning we went up to the village and bought a wire rat-trap and fetched it down, and unstopped the best rat-hole, and in about an hour we had fifteen of the bulliest kind of ones; and then we took it and put it in a safe place under Aunt Sally\u0027s bed. But while we was gone for spiders little Thomas Franklin Benjamin Jefferson Elexander Phelps found it there, and opened the door of it to see if the rats would come out, and they did; and Aunt Sally she come in, and when we got back she was a-standing on top of the bed raising Cain, and the rats was doing what they could to keep off the dull times for her. So she took and dusted us both with the hickry, and we was as much as two hours catching another fifteen or sixteen, drat that meddlesome cub, and they warn\u0027t the likeliest, nuther, because the first haul was the pick of the flock. I never see a likelier lot of rats than what that first haul was. \n We got a splendid stock of sorted spiders, and bugs, and frogs, and caterpillars, and one thing or another; and we like to got a hornet\u0027s nest, but we didn\u0027t. The family was at home. We didn\u0027t give it right up, but stayed with them as long as we could; because we allowed we\u0027d tire them out or they\u0027d got to tire us out, and they done it. Then we got allycumpain and rubbed on the places, and was pretty near all right again, but couldn\u0027t set down convenient. And so we went for the snakes, and grabbed a couple of dozen garters and house-snakes, and put them in a bag, and put it in our room, and by that time it was suppertime, and a rattling good honest day\u0027s work: and hungry? -- oh, no, I reckon not! And there warn\u0027t a blessed snake up there when we went back -- we didn\u0027t half tie the sack, and they worked out somehow, and left. But it didn\u0027t matter much, because they was still on the premises somewheres. So we judged we could get some of them again. No, there warn\u0027t no real scarcity of snakes about the house for a considerable spell. You\u0027d see them dripping from the rafters and places every now and then; and they generly landed in your plate, or down the back of your neck, and most of the time where you didn\u0027t want them. Well, they was handsome and striped, and there warn\u0027t no harm in a million of them; but that never made no difference to Aunt Sally; she despised snakes, be the breed what they might, and she couldn\u0027t stand them no way you could fix it; and every time one of them flopped down on her, it didn\u0027t make no difference what she was doing, she would just lay that work down and light out. I never see such a woman. And you could hear her whoop to Jericho. You couldn\u0027t get her to take a-holt of one of them with the tongs. And if she turned over and found one in bed she would scramble out and lift a howl that you would think the house was afire. She disturbed the old man so that he said he could most wish there hadn\u0027t ever been no snakes created. Why, after every last snake had been gone clear out of the house for as much as a week Aunt Sally warn\u0027t over it yet; she warn\u0027t near over it; when she was setting thinking about something you could touch her on the back of her neck with a feather and she would jump right out of her stockings. It was very curious. But Tom said all women was just so. He said they was made that way for some reason or other. \n We got a licking every time one of our snakes come in her way, and she allowed these lickings warn\u0027t nothing to what she would do if we ever loaded up the place again with them. I didn\u0027t mind the lickings, because they didn\u0027t amount to nothing; but I minded the trouble we had to lay in another lot. But we got them laid in, and all the other things; and you never see a cabin as blithesome as Jim\u0027s was when they\u0027d all swarm out for music and go for him. Jim didn\u0027t like the spiders, and the spiders didn\u0027t like Jim; and so they\u0027d lay for him, and make it mighty warm for him. And he said that between the rats and the snakes and the grindstone there warn\u0027t no room in bed for him, skasely; and when there was, a body couldn\u0027t sleep, it was so lively, and it was always lively, he said, because THEY never all slept at one time, but took turn about, so when the snakes was asleep the rats was on deck, and when the rats turned in the snakes come on watch, so he always had one gang under him, in his way, and t\u0027other gang having a circus over him, and if he got up to hunt a new place the spiders would take a chance at him as he crossed over. He said if he ever got out this time he wouldn\u0027t ever be a prisoner again, not for a salary. \n Well, by the end of three weeks everything was in pretty good shape. The shirt was sent in early, in a pie, and every time a rat bit Jim he would get up and write a little in his journal whilst the ink was fresh; the pens was made, the inscriptions and so on was all carved on the grindstone; the bed-leg was sawed in two, and we had et up the sawdust, and it give us a most amazing stomach-ache. We reckoned we was all going to die, but didn\u0027t. It was the most undigestible sawdust I ever see; and Tom said the same. But as I was saying, we\u0027d got all the work done now, at last; and we was all pretty much fagged out, too, but mainly Jim. The old man had wrote a couple of times to the plantation below Orleans to come and get their runaway nigger, but hadn\u0027t got no answer, because there warn\u0027t no such plantation; so he allowed he would advertise Jim in the St. Louis and New Orleans papers; and when he mentioned the St. Louis ones it give me the cold shivers, and I see we hadn\u0027t no time to lose. So Tom said, now for the nonnamous letters. \n \"What\u0027s them?\" I says. \n \"Warnings to the people that something is up. Sometimes it\u0027s done one way, sometimes another. But there\u0027s always somebody spying around that gives notice to the governor of the castle. When Louis XVI. was going to light out of the Tooleries a servantgirl done it. It\u0027s a very good way, and so is the nonnamous letters. We\u0027ll use them both. And it\u0027s usual for the prisoner\u0027s mother to change clothes with him, and she stays in, and he slides out in her clothes. We\u0027ll do that, too.\" \n \"But looky here, Tom, what do we want to WARN anybody for that something\u0027s up? Let them find it out for themselves -- it\u0027s their lookout.\" \n \"Yes, I know; but you can\u0027t depend on them. It\u0027s the way they\u0027ve acted from the very start -- left us to do EVERYTHING. They\u0027re so confiding and mulletheaded they don\u0027t take notice of nothing at all. So if we don\u0027t GIVE them notice there won\u0027t be nobody nor nothing to interfere with us, and so after all our hard work and trouble this escape \u0027ll go off perfectly flat; won\u0027t amount to nothing -- won\u0027t be nothing TO it.\" \n \"Well, as for me, Tom, that\u0027s the way I\u0027d like.\" \n \"Shucks!\" he says, and looked disgusted. So I says: \n \"But I ain\u0027t going to make no complaint. Any way that suits you suits me. What you going to do about the servant-girl?\" \n \"You\u0027ll be her. You slide in, in the middle of the night, and hook that yaller girl\u0027s frock.\" \n \"Why, Tom, that \u0027ll make trouble next morning; because, of course, she prob\u0027bly hain\u0027t got any but that one.\" \n \"I know; but you don\u0027t want it but fifteen minutes, to carry the nonnamous letter and shove it under the front door.\" \n \"All right, then, I\u0027ll do it; but I could carry it just as handy in my own togs.\" \n \"You wouldn\u0027t look like a servant-girl THEN, would you?\" \n \"No, but there won\u0027t be nobody to see what I look like, ANYWAY.\" \n \"That ain\u0027t got nothing to do with it. The thing for us to do is just to do our DUTY, and not worry about whether anybody SEES us do it or not. Hain\u0027t you got no principle at all?\" \n \"All right, I ain\u0027t saying nothing; I\u0027m the servantgirl. Who\u0027s Jim\u0027s mother?\" \n \"I\u0027m his mother. I\u0027ll hook a gown from Aunt Sally.\" \n \"Well, then, you\u0027ll have to stay in the cabin when me and Jim leaves.\" \n \"Not much. I\u0027ll stuff Jim\u0027s clothes full of straw and lay it on his bed to represent his mother in disguise, and Jim \u0027ll take the nigger woman\u0027s gown off of me and wear it, and we\u0027ll all evade together. When a prisoner of style escapes it\u0027s called an evasion. It\u0027s always called so when a king escapes, f\u0027rinstance. And the same with a king\u0027s son; it don\u0027t make no difference whether he\u0027s a natural one or an unnatural one.\" \n So Tom he wrote the nonnamous letter, and I smouched the yaller wench\u0027s frock that night, and put it on, and shoved it under the front door, the way Tom told me to. It said: \n Beware. Trouble is brewing. Keep a sharp lookout. UNKNOWN FRIEND. \n Next night we stuck a picture, which Tom drawed in blood, of a skull and crossbones on the front door; and next night another one of a coffin on the back door. I never see a family in such a sweat. They couldn\u0027t a been worse scared if the place had a been full of ghosts laying for them behind everything and under the beds and shivering through the air. If a door banged, Aunt Sally she jumped and said \"ouch!\" if anything fell, she jumped and said \"ouch!\" if you happened to touch her, when she warn\u0027t noticing, she done the same; she couldn\u0027t face noway and be satisfied, because she allowed there was something behind her every time -- so she was always a-whirling around sudden, and saying \"ouch,\" and before she\u0027d got two-thirds around she\u0027d whirl back again, and say it again; and she was afraid to go to bed, but she dasn\u0027t set up. So the thing was working very well, Tom said; he said he never see a thing work more satisfactory. He said it showed it was done right. \n So he said, now for the grand bulge! So the very next morning at the streak of dawn we got another letter ready, and was wondering what we better do with it, because we heard them say at supper they was going to have a nigger on watch at both doors all night. Tom he went down the lightning-rod to spy around; and the nigger at the back door was asleep, and he stuck it in the back of his neck and come back. This letter said: \n Don\u0027t betray me, I wish to be your friend. There is a desprate gang of cut-throats from over in the Indian Territory going to steal your runaway nigger to-night, and they have been trying to scare you so as you will stay in the house and not bother them. I am one of the gang, but have got religgion and wish to quit it and lead an honest life again, and will betray the helish design. They will sneak down from northards, along the fence, at midnight exact, with a false key, and go in the nigger\u0027s cabin to get him. I am to be off a piece and blow a tin horn if I see any danger; but stead of that I will BA like a sheep soon as they get in and not blow at all; then whilst they are getting his chains loose, you slip there and lock them in, and can kill them at your leasure. Don\u0027t do anything but just the way I am telling you; if you do they will suspicion something and raise whoop-jamboreehoo. I do not wish any reward but to know I have done the right thing. UNKNOWN FRIEND. \n 　　每次一有蛇爬落到她身边，我们就得挨顿打，她还说，要我们再敢把这所房子弄得蛇到处爬，那种揍法儿可就算不上什么了。我并不在乎她揍我，因为揍得并不怎么狠，可我在乎给我们惹的麻烦，还得去再捉一回。不过我们还是捉到了，把其他所有的东西全都弄齐了。当这些动物都拥出来听音乐，向吉姆身边爬过来时，你可从没见过有像吉姆的小屋那么热闹的地方。吉姆不喜欢蜘蛛，蜘蛛也不喜欢吉姆，于是，它们就暗地里跟他捣乱，把他折腾得很够呛。他说床上有老鼠、蛇、磨石，几乎没了睡觉的地方，即使有地方也睡不成，太热闹了，而且还一直热闹，因为它们历来不同时睡觉，而是轮着班；这样，蛇睡着了，老鼠站岗，该老鼠睡了，蛇又跑出来放哨。因此，总会有一帮动物挤在他身子下边，弄得他没地睡。另一帮在他身上演戏，他如果起来换个新地方，蜘蛛又会趁他过去时跟他捣乱。他说这一回他要能出去，决不再当囚犯，开工资也不干。这么一来，三个星期过去了，一切都很顺利。衬衣早就藏在馅饼里送进去了，每回有老鼠咬吉姆一口，他就起床趁那墨水还鲜红就写点儿日记；笔也做好了，题词等都刻在了磨石上；床腿锯成了两截，我们也把锯末吃进肚里了，它叫我们俩肚子疼得要死。我们想，这下都得疼死，可总算没死。这是我见过的最难消化的锯末，汤姆也觉得是这样。不过，书归正传，现在我们终于把事情全都做完了，我们也都累了个半死不活，不过主要还是吉姆。老先生给奥尔良那边的农场写了几回信，让他们来人把逃跑黑人带走，可是，都不见回音。因为压根儿就没有这么个农场。于是，他打算在圣路易斯和新奥尔良的报纸上登领人启事。他一提到圣路易斯的报纸，我直打冷颤，我知道我们再没时间可耽搁了。而汤姆说，现在该写匿名信了。\"什么是匿名信？\"我问。\n 　　\"就是警告人们快要出事了。有时这么做，有时又是另一个做法。可总有人在一边盯梢儿，给城堡司令报信儿。当年，路易十六想从图勒里监狱逃跑时，一个年轻女仆报了信儿。这法子很好，写匿名信也很好。我们就两个办法全用。通常是囚犯的妈妈跟他换衣服，她呆在监狱里，他穿着她的衣服偷跑出去。这个办法我们也要照搬。\"\"可是听着，汤姆，我们干嘛要警告人家说要出事儿呢？让他们自己去察觉吧，这本来就是他们的事情。\"\"是啊，我知道。可你不可能指望他们。他们打一开头就这样--让我们随心所欲地做每一件事。他们对别人放心，自己脑子又笨，根本啥也没注意到。所以，如果我们不报信儿引起他们注意，那就不会有一个人一件事妨碍我们，这样的话，虽然我们费了很大劲，惹了很多事，这次逃跑还是会平淡无奇地过去，一点儿意思也没有--一点儿也不像那么回事儿。\"\"如果换了我呀，汤姆，这可正是我想要的结果。\"\"废话。\" 他说了一声，看上去很讨厌我。我赶忙说：\"我可没想抱怨。反正对你合适，对我也合适。那个女仆你有什么想法？\"\"你来扮她。等到正半夜，你悄悄进屋去偷那个黄脸女仆的长裙。\"\"哎呀，汤姆，第二天早上会惹麻烦的，因为她肯定是仅有那一件。\"\"我知道。你也就用它15 分钟，拿上匿名信，塞进大门底下就可以了。\"\"那好吧，我去。不过我穿自己的衣服去也会一样方便。\"\"那样，你就不像个女仆了，对不对？\"\"是不像，可不论怎么说，也没有人看到我像不像。\"\"那不相干。我们要做的就是要守规矩，不管是不是有人看到我们做过没有。你难道没一点儿原则意识吗？\"\"好啦，我啥也不说了，我就当那个女仆。谁来当吉姆的母亲？\"\"我当。我得从莎丽姨那儿偷件袍子来。\"\"好吧，那你就得一直在小屋里呆到我和吉姆全走掉。\"\"不会太长。我把吉姆的衣服塞满草，放到他床上，代表他母亲换了装，吉姆将那件黑女人的长袍从我身上脱下来，他换上，我们一块儿逃走。一个有风度的囚犯逃走时，应该叫做逃亡。比方说一个国王逃跑时就这么样叫。国王儿子逃跑时也这么叫，不管他是否是私生子，都没样什么两样。\"于是，汤姆写了封匿名信。那个晚上，我把那个黄脸女仆的长裙偷过来，穿到身上，按汤姆的吩咐，把信塞到前门底下。信上写的是：当心。祸在旦夕。务请严防。\n 　　无名的朋友第二天晚上，我们在前门贴了一张画，那是汤姆拿血画的一个骷髅与交叉股骨图。第三天晚上又在后门上贴了张棺材图。我还从没见过哪一家人像他们这样害怕。要是这个地方所有东西的后边、床板底下四处都藏着鬼怪在捉弄他们，又在空气中颤动，他们也只能吓成那样了。要是门\"嘭\"的一响，莎丽姨就会跳起来，\" 哎呀\"一声，要是有东西倒了，她也\"哎呀\"一声跳起来，就连你一不小心碰她一下，只要她没看清，也会那么跳起来。她脸朝哪边都不放心，因为她总是觉得有东西躲在她背后，于是，她总是\"哎呀\"叫着快速转身，还没等转到三分之二，她又转回来，还喊\"哎呀\"。她怕睡觉，可她又不敢坐起来。因此，汤姆说这事效果很好，他说他还没见过哪件事这么让人满意。他说这件事做得对。\n 　　于是他说，现在该上演压轴戏了！因此第二天一大早，天刚蒙蒙亮，我们预备好了另一封信，一时还不知道该拿它怎么办，因为我们听见他们吃晚饭时说，他们想在两个门口都派个黑人通宵守卫。汤姆顺避雷针下去，四下偷看一阵，后门那个黑人睡着了，他把信插在他脖子后边回来了。这封信写的是：请别出卖我，我希望做你们的朋友。有一群胆大妄为、无恶不作的强盗，今天夜里从印第安人居住州过来，要偷你们的那个逃跑黑人，他们一直都在想尽办法吓唬你们，就是为了让你们呆到屋里不打扰他们。我是帮中一员，但是我信教，希望能够脱离这个强盗帮，重新过诚实的生活，而且要揭露这个恶毒阴谋。他们要在正半夜，沿着围墙，从北边偷偷儿下来，拿一把假钥匙，到那个黑人小屋里去弄走他。他们安排在我远处放哨，如果有什么危险就吹响铁喇叭。可我不会这么做，只要他们一进小屋，我就咩咩学羊叫，根本不去吹喇叭。等到他们正在替他卸链子的时候，你们就摸上去把他们锁在小屋里，从从容容把他们打死。切勿轻举妄动，请按我说的做，否则，他们就会产生怀疑，闹个天翻地覆。我不希望得到任何酬谢，只要知道我这件事做得对。\n 　　无名的朋友\n \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/71/3919.html","bookId":546,"book":{"id":546,"title":"The Adventures of Huckleberry Finn哈克贝里·芬历险记","description":"简介： Adventures of Huckleberry Finn is a book by Mark Twain, first published in England in December 1884 and in the United States in February 1885. Commonly recognized as one of the Great American Novels, the work is among the first in major American ...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1286419638512bd.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/71","creation":"Aug 1, 2019 12:18:56 AM","modification":"Aug 1, 2019 12:18:56 AM"}}
