{"id":21636,"no":34,"title":"CHAPTER XV.","content":"Mrs. Thimbleby set a cup full of hot tea and a slice of bread on the table, and glided out of the kitchen in a humble, noiseless way, as if she feared lest the mere sound of her footsteps should be deemed importunate. \n \n \"You have something to say to me?\" asked Powell, still standing opposite to Minnie\u0027s chair. \n \n \"Yes; but first you must take some food. Please to sit down there at the table.\" \n \n Powell shook his head. \"Food disgusts me,\" he said. \"I do not need it.\" \n \n \"That will pain your kind landlady,\" said Minnie, gently. \"She has been so careful to get this refreshment ready for you.\" \n \n Powell sat down. \"I would not pain the good soul for any earthly consideration,\" he answered. \"But if the burthen be laid on me, I must pain her.\" \n \n \"Come, Mr. Powell, no injunction can be laid on you to starve yourself, and grow ill, and be unable to fulfil your duties!\" \n \n After an instant\u0027s hesitation he swallowed some tea, and began to break off small fragments of the bread, which he soaked in the liquid, and ate slowly. \n \n Minnie watched him attentively. The widow had lighted a candle, which, standing on the high mantel-shelf, shed down its pale rays on the preacher\u0027s head and face, the rest of his person being in shadow. Now and again, as he lifted a morsel of bread to his lips, one thin long hand, yellow-white as old ivory, came within the circle of light. His whole countenance appeared to Minnie to have undergone a change since she had seen him last. The features were sharper, the skin more sallow, the lines around the mouth deeper. But the greatest change was in the expression of the eyes. They were wonderfully lustrous, but not with the soft mild lustre which formerly shone in them. They looked startlingly large and prominent; and at times seemed literally to blaze with an inward fire. \n \n \"He is ill and feverish,\" thought Minnie. And then, as she continued to watch him, there came over his face an expression so infinitely piteous, that the sympathetic tears sprang into her eyes when she saw it. It was a pathetic, questioning, bewildered look, like that of a little child that has lost its way, and is frightened. \n \n When he had eaten a few mouthfuls, he asked, \"Who told you that you would find me here?\" \n \n \"Oh, it was not difficult to discover your whereabouts in Whitford, Mr. Powell,\" answered Minnie, smiling with an effort to seem cheerful and at ease. \"Your coming has been spoken of in our little town for weeks past.\" \n \n \"Has it so? Has it so? That is a good hearing. There must be souls ripe for conviction—anxious, inquiring souls.\" \n \n There was a pause. Minnie had expected him to speak of their last interview. But as he made no allusion to it, she opened the subject herself. \n \n \"You remember, Mr. Powell, before you went away from Whitford, giving me a charge—a trust to fulfil for you?\" \n \n He looked at her inquiringly, but did not answer. \n \n \"There was a young member of your flock whose welfare you had greatly at heart. And you thought that I might be able to help her and show her some kindness. I—I have honestly tried to keep the promise I then made to you,\" persisted Minnie, on whom Powell\u0027s strange silence was producing an unpleasant impression. She could not understand it. \"I fancied that you might still feel some anxiety about Rhoda\u0027s welfare——\" \n \n At the sound of that name, Powell seemed moved as if by an electric shock. The change in his face was as distinct, although as momentary, as the change made in a dark bank of cloud by a flicker of summer lightning. \n \n \"You know, of course,\" continued Minnie, \"that the person whose influence you feared is married. And I assure you that, so far as my attentive judgment goes, Rhoda\u0027s peace of mind has not been fatally troubled. She fretted for a while, but is now rapidly regaining her cheerfulness. She even visits rather frequently at Mr. Errington\u0027s house, having, it seems, become a favourite with his wife.\" \n \n David Powell\u0027s head had sunk down on to his breast. He held one hand across his eyes, resting his elbow on the table, and neither moving nor looking up. But it was evident that he was listening. Minnie went on to speak of Rhoda\u0027s improvement. She had always been pretty, but her beauty was now very striking. She had profited by the opportunities of instruction which her father afforded her. She was caressed by the worthiest people in her little world. \n \n Minnie went bravely on—nerved by the sight of that bowed figure and emaciated hand, hiding the eyes—speaking the praises of the girl who had sent many a pang of jealousy into her heart—a jealousy none the less torturing because she knew it to be unreasonable. \"He could never have thought of wretched, crippled me, if there had been no Rhoda Maxfield in the world!\" she had told herself a hundred times. But she tried to fancy that the withering up of the secret romance of her life would have been less hard to bear, had the sacrifice been made in favour of a higher, nobler woman than simple, shallow, slight-hearted Rhoda Maxfield. \n \n Nevertheless, she spoke Rhoda\u0027s praises now ungrudgingly. Nay, more; she believed Powell to be capable of the highest self-sacrifice; she believed that he would welcome a prospect of happiness and security for Rhoda, even though it should shut the door for ever on any lingering hopes he might retain of winning her. So, bracing herself to a strong effort—which seemed to strain not only the nerves, but the very muscles, of her fragile frame as she sat almost upright, grasping the arms of her chair with both hands—she added, \"And, as I know you have that rare gift of love which can rejoice in looking at a happiness it may never share, I will say to you in confidence that I believe Rhoda is honourably sought in marriage by a good man—a man who—it is not needful to speak at length of him\"—indeed, her throat was dry, and her courage desperately at bay—\"but he is a good, high-minded man; one who will value and respect his wife; one who admires and loves Rhoda very fervently.\" \n \n It was magnanimously said. The words, as she uttered them, sounded the knell of her own youth and hope in her ears. \n \n We believe that a beloved one is dead. We have kissed the cold lips. We have kissed the unresponsive hand. Yes; the beloved one is dead. We surely believe it. \n \n But, no! The death-bell sounds, beating with chill, heavy fingers on our very heart-strings, and then we awake to a sudden confirmation of our grief. The bell sings its loud monotone, over roof-tree and grave-stone, piercing through the murmur of busy life in streets and homes, and then we know that we had not hitherto believed; that in some nook and secret fold of heart or brain a wild, formless hope had been lurking that all was not really over. Only the implacable mental clang carries conviction with its vibrations into the broad daylight and the common air, and the tears gush out as if our sorrow were born anew. \n \n Even so felt Minnie Bodkin when she had put her secret thought into words. The speaking of the words could not hasten their fulfilment. But yet it seemed to her as if, in saying them, she had signed some bond—had formally renounced even the solace of a passing fancy that might flit, fairy-bright, into the dimness of her life; had given up the object of her silent passion by a covenant that was none the less stringent because its utterance was simple and commonplace. She was silent, breathing quickly, and lying back against the cushions after the short speech that had cost her so much. \n \n Powell remained quite still for a few seconds. Then suddenly removing the screening hand, the almost intolerable lustre of his eyes broke upon the startled woman opposite to him, as he said, with a strange smile, \"She is safe. She is happy for Time and Eternity. She has been ransomed with a price.\" \n \n \"I knew that you would allow no selfish feeling to sway you,\" returned Minnie, after an instant\u0027s pause. \"I was right in feeling sure that you would generously consider her happiness before your own.\" \n \n But yet she was not satisfied with the result of her well-meant attempt to free Powell\u0027s mind from the anxiety concerning Rhoda, which she believed to have been preying on it. There was something strangely unexpected in his manner of receiving it. Presently Powell looked at her again with a sad, sweet smile. The wild blaze had gone out of his eyes. They were soft and steady as they rested on her now. \n \n \"You are a just and benevolent woman,\" he said. \"You have been faithful. You came hither with the charitable wish to comfort me. I am not ungrateful. But the old trouble has long been dead. I did wrestle with a mighty temptation on her account. My heart burnt very hot within me; the fleshy heart, full of deceit and desperately wicked. But that human passion fell away like a garment, shrivelled and consumed by the great fire of the wrath of God, that put it out as the sun puts out the flame of a taper at noonday. Neither,\" he went on, speaking rather to himself than to Minnie, \"am I concerned for that young soul. No; it is safe. It has been ransomed. I have had answer to prayer, and heard voices that brought me sure tidings in the dimness of the early morning; but these things are hard to be understood. Sometimes, even yet, the old, foolish yearning of the heart seems to awake and stir blindly within me. When you named that name—no lips had uttered it to my ears for many months—there seemed to run a swift echo of it through all the secret places of my soul! But I heard as though one dead should hear the beat of a familiar footfall above his grave.\" \n \n The dusk of evening, the low thrilling tones of the preacher\u0027s voice, the terrible pallor of his face, with its great glittering eyes shining in the feeble rays of the candle, contributed, not less than the strangeness of his words, to oppress Minnie with a sensation of nervous dread. She was not afraid of David Powell, nor of anything that she could see or touch. But vague terrors seemed to be floating in the air. \n \n She started as her eye was caught by a deep, mysterious shadow on the wall. The fire had burnt low, and shed only a dull red glow upon the hearth. The ticking of the old clock appeared to grow louder with every beat, and to utter some ominous warning in an unknown tongue. \n \n All at once a sound of voices and footsteps in the passage broke the spell. The fire cast only commonplace and comprehensible shadows. The clock ticked with its ordinary indifferent tone. The preacher\u0027s pale face ceased to float in a mystical light against the dark background of the curtainless window. The everyday world entered in at the kitchen door in the shape of Mr. Diamond and Rhoda Maxfield. \n \n Of the four persons thus unexpectedly assembled, Minnie was the first to speak. \n \n \"What, Rhoda!\" she cried, in a quiet voice, which revealed much less surprise than she felt. \"What brought you here at this hour?\" \n \n As she spoke she glanced anxiously at Powell, uneasy as to the effect on him of Rhoda\u0027s sudden appearance. But he remained curiously impassible, looking at those present as if they were objects dimly seen afar off. \n \n \"I was coming to drink tea with Mrs. Errington. Mr. Diamond overtook me and Sally in the street. I saw your carriage at the door, and looked in here, hoping that I should find both you and Mrs. Errington in this room, because I know you do not go upstairs.\" \n \n Thus spoke Rhoda, in a soft, tremulous little voice, and with downcast eyes. Diamond came and shook hands with Minnie. He pressed the hand she gave him with unusual warmth and emphasis. His eyes were bright, and there was a glow of pleasure on his face. He believed that his suit was prospering, and he wished to convey some hint of his hopeful anticipations to his sympathising friend Miss Bodkin. Then he turned to Powell, and touched him on the shoulder. \"How are you to-night?\" he asked, in a friendly tone, not without a kind of superior pity. \"I am glad to see that you have been refreshing the inner man. Our friend is too careless of his health, Miss Bodkin. He fasts too long, and too often.\" \n \n Powell smiled slightly, but neither looked at him nor answered him. Going straight to Rhoda he laid his hand on her bright chestnut hair, from which the bonnet she wore had fallen backwards, and looked at her solemnly. Rhoda turned pale and gazed back at him, as if fascinated. Neither of the others spoke or moved. \n \n \"It is true, then,\" said Powell, after a pause, and the low tones of his voice sounded like soft music. \"I have passed through the Valley of the Shadow of Death, and between me and the dwellers under the light of the sun there is a great gulf fixed!\" \n \n He released the bright young head on which his hand had rested, and made as if he would move away. Then, pausing, he said, \"I frightened you long ago—in the other life. Fear no more, Rhoda Maxfield. Be no more disquieted by night or by day. Many are called, but few are chosen, yet you are among the chosen.\" He smiled upon her very sadly and calmly, and went slowly away without looking round. \n \n As soon as he was gone, Rhoda burst into tears. Diamond made an eager step forward as if to take her hand; then stopped irresolutely, and looked anxiously at Minnie. \"She is so sensitive,\" he said half aloud. Minnie was as white as the preacher, and her eyes were full of tears, which, however, she checked from falling by a strong effort of her will. \"I must go,\" she said. \"Rhoda tells me my carriage is here. Will you kindly call my servants?\" He obeyed her, first making his formal little bow; a sign, under the circumstances, that he was not quite in sympathy with his friend, who showed so little sympathy herself for that \"sensitiveness\" which so moved him. However, when, assisted by Jane, Miss Bodkin had made her way to the door, Mr. Diamond stood there bare-headed to help her into the carriage. She put her hand for an instant on his proffered arm as she got into the vehicle. Rhoda came running out after her. \"Good night, Miss Minnie!\" she cried. \n \n Minnie leant back, and seemed neither to see nor hear her. But in an instant she was moved by a generous impulse to put her head out of the window, and say kindly, \"Good night, Rhoda. Come and see me soon.\" \n \n As the carriage began to move away, she saw Diamond tenderly drawing Rhoda\u0027s shawl round her shoulders, and trying to lead her in from the chill of the evening air. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2168/61295.html","bookId":444,"book":{"id":444,"title":"A Charming Fellow","description":"简介： The room was very quiet. The autumn day was fading, and the mingling of twilight and firelight, and the stillness of the scene, were conducive to mute meditation. It was a long, low room, with an uneven floor, a whitewashed ceiling crossed by heavy b...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2168","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
