{"id":21663,"no":61,"title":"CHAPTER XXV. CONCLUSION.","content":"Our tale is almost told. The last words that need saying can be briefly said. When some weeks had passed away, Mrs. Errington received a letter from her son demanding a remittance to be sent forthwith Poste Restante to a little seaport town on the Italian Riviera. He had not during the interval left his mother in absolute ignorance as to what had become of him, but had sent her a few brief lines from London, saying that he had been obliged to leave Whitford in order to escape being put in prison for debt; that his present intention was to go abroad; and that she should hear again from him before long. Algernon had been so quick in his movements that he managed to be in town before the story of Lord Seely\u0027s having cast him off had had time to be circulated amongst his acquaintance there. And he was enabled, as the result of his activity, to obtain from Mrs. Machyn-Stubbs and others several letters of introduction calculated to be of use to him abroad. He was described by Mrs. Machyn-Stubbs as a nephew of Lord Seely and her intimate friend, who was travelling on the Continent to recruit his health after the shock of his wife\u0027s sudden death. He had brought away from Whitford such few jewels belonging to his dead wife as were of any value, and he sold them in London. He furnished himself handsomely with such articles as were desirable for a gentleman of fortune travelling for his pleasure; and allowed the West-end tradesmen, to whom the Honourable John Patrick Price had recommended him during his brilliant London season, to write down against him in their books some very extortionate charges for the same. His outfit being accomplished in this inexpensive manner, he was enabled to travel with as much comfort as was compatible in those days with a journey from London to Calais, and he stepped on to the French shore with a considerable sum of money in his pocket. For a long time the tidings of him that reached Whitford were uncertain and conflicting; then they began to arrive at even wider and wider intervals; and, finally, after Mrs. Errington left the town, they ceased altogether to reach the general world of Whitfordians. The real history of the circumstances which induced Mrs. Errington to leave the home of so many years was known to very few persons. It was this: About a twelvemonth after Algernon\u0027s departure Mrs. Errington made a sudden journey to London; and, on her return, she confided to her old friend, Dr. Bodkin, that she had sold out of the funds nearly the whole sum from which her little income was derived and transmitted it to Algy, who had an absolute need for the money, which she considered paramount. \"But, my dear soul, you have ruined yourself!\" cried the doctor aghast. \"Algernon will repay me, sir,\" replied the poor old woman, drawing herself up with the ghost of her old Ancram grandeur. The upshot was that Dr. Bodkin, in concert with one or two other old friends of her late husband, made some representations on her behalf to Mr. Filthorpe, the wealthy Bristol merchant, who was, as the reader may remember, a cousin of Dr. Errington; and that Mr. Filthorpe benevolently allowed his cousin\u0027s widow a small annuity, which, together with the few pounds that still remained to her of her own, enabled her to live in decent comfort. But she professed herself unable to remain in Whitford, and removed to a cottage in Dorrington, where she had a kind friend in the wife of the head-master of the proprietary school, whom we first presented to the reader as \"little Rhoda Maxfield.\" Mrs. Diamond (as she was now) lived in a very handsome house, and wore very elegant dresses, and was looked upon as a personage of some importance in Dorrington and its vicinity. Her husband had decidedly opposed a proposition she made to him to receive Mrs. Errington as an inmate of his home. But he put no further constraint on Rhoda\u0027s affectionate solicitude about her old friend. And the two women drove together, and sewed together, and talked together; and their talk was chiefly about that exiled victim of unmerited misfortune, Algernon Errington. Rhoda preserved her faith in the Ancram glories. And although she acknowledged to herself that Algernon had treated her badly, he was invested in her mind with some mysterious immunity from the obligations that bind ordinary mortals. A visitor, who was often cordially welcomed at Dorrington by Matthew Diamond, was Miss Chubb. And the kind-hearted little spinster endured a vast amount of snubbing and patronage from her old enemy on the battle-ground of polite society—Mrs. Errington—with much charitable sweetness. Old Max lived to see his daughter\u0027s first-born child; but he was unable to move from his bed for many months before his death. Perhaps it was the period of quiet reflection thus obtained, when the things of this world were melting away from his grasp, which occasioned the addition of a codicil to the old man\u0027s will, that surprised most of his acquaintance. He had settled the bulk of his property on his daughter at her marriage, and, in his original testament, had bequeathed the whole of the residue to her also. But the codicil set forth that his only and beloved daughter being amply provided for, and his son James inheriting the stock, fixtures, and good-will of his flourishing business, together with the house and furniture, Jonathan Maxfield felt that he was doing injustice to no one by bequeathing the sum of three thousand pounds to Miss Minnie Bodkin as a mark of respect and admiration. And he, moreover, left one hundred pounds, free of duty, to \"that God-fearing member of the Wesleyan Society, Richard Gibbs, now living as groom in the service of Orlando Pawkins, Esquire, of Pudcombe Hall;\" a bequest which sensibly embittered the flavour of the sermon preached by the un-legacied Brother Jackson on the next Sunday after old Max\u0027s funeral. Dr. Bodkin still lives and rules in Whitford Grammar School. His wife\u0027s life is brightened by the sight of her Minnie\u0027s increased health and strength. But she has never quite forgiven Matthew Diamond, and has been heard to say that young Mrs. Diamond\u0027s children are the most singularly uninteresting she ever saw! Of Minnie herself, the chronicle hitherto records a life of useful benevolence, undisfigured by ascetic affectation, or the assumption of any pious livery whatever. She keeps her old delight in all the beautiful things of art and nature, and old Max\u0027s legacy has enabled her to enjoy some foreign travel. She is still in the first prime of womanhood, and more beautiful than ever. But, at the latest accounts, poor Mr. Warlock has not been tortured by the spectacle of any successful rival. For his part, he goes on worshipping Miss Bodkin with hopeless fidelity. For a long time Minnie continued to visit David Powell in the lunatic asylum at stated periods. He generally recognised her, and the sight of her seemed to soothe and comfort him. After a while he was pronounced cured, and left the asylum; but his madness returned on him at intervals, and he would voluntarily go and place himself under restraint when he felt the black fit coming. He did not live very long, being assailed by a mortal consumption. But as his body wasted, his mind grew clearer, stronger, and more serene; and before his death Minnie had the satisfaction to hear him profess a humble faith in the Divine Goodness, and a fearless confidence in the mysterious hand that was leading him even as a little child into the shadowy land. There was as large a concourse of people at his burial as had ever thronged to hear his fiery preaching on Whit Meadow. His memory became surrounded by a saintly radiance in the imaginations of the poor. Stories of his goodness and his afflictions, and the final ray of peace which God sent to cheer his last moments, were long retailed amongst the Whitford Methodists. And his grave is still bright with carefully-tended flowers. Of Algernon Errington the strangest rumours were circulated for a time. Some said he had become croupier at a foreign gambling-table; others declared he had married a West Indian heiress with a million of money, and was living in Florence in unheard-of luxury. Others, again, affirmed that they had the best authority for believing that he had gone to the United States, and had appeared on the stage there with immense success. However, the remembrance of him passed away from men\u0027s minds in Whitford within a few years; in London within a few months. But it was a long time before Jack Price left off recounting his final interview with Errington. \"That young Ancram, you know. Captivating way of his own. What? On my honour, the rascal borrowed ten pounds of me. Ready money, sir, down on the nail! Bedad, it was a tour de force, for I never have a shilling in my pocket for my own use. But Ancram would coax the little birds off the bushes, as they say in my part of the world. Principle? Oh, devil a rag of principle in his whole composition. What? I wonder what the deuce has become of him! I give ye my word and honour he was really—really now—a Charming Fellow.\" THE END.","sourceLink":"http://novel.tingroom.com/jingdian/2168/61322.html","bookId":444,"book":{"id":444,"title":"A Charming Fellow","description":"简介： The room was very quiet. The autumn day was fading, and the mingling of twilight and firelight, and the stillness of the scene, were conducive to mute meditation. It was a long, low room, with an uneven floor, a whitewashed ceiling crossed by heavy b...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2168","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
