{"id":6932,"no":39,"title":"Part 6 Chapter 8","content":"When he went into Sonia\u0027s room, it was already getting dark. All day Sonia had been waiting for him in terrible anxiety. Dounia had been waiting with her. She had come to her that morning, remembering Svidrigailov\u0027s words that Sonia knew. We will not describe the conversation and tears of the two girls, and how friendly they became. Dounia gained one comfort at least from that interview, that her brother would not be alone. He had gone to her, Sonia, first with his confession; he had gone to her for human fellowship when he needed it; she would go with him wherever fate might send him. Dounia did not ask, but she knew it was so. She looked at Sonia almost with reverence and at first almost embarrassed her by it. Sonia was almost on the point of tears. She felt herself, on the contrary, hardly worthy to look at Dounia. Dounia\u0027s gracious image when she had bowed to her so attentively and respectfully at their first meeting in Raskolnikov\u0027s room had remained in her mind as one of the fairest visions of her life.\\n\\n Dounia at last became impatient and, leaving Sonia, went to her brother\u0027s room to await him there; she kept thinking that he would come there first. When she had gone, Sonia began to be tortured by the dread of his committing suicide, and Dounia too feared it. But they had spent the day trying to persuade each other that that could not be, and both were less anxious while they were together. As soon as they parted, each thought of nothing else. Sonia remembered how Svidrigailov had said to her the day before that Raskolnikov had two alternatives--Siberia or . . . Besides she knew his vanity, his pride and his lack of faith.\\n\\n \"Is it possible that he has nothing but cowardice and fear of death to make him live?\" she thought at last in despair.\\n\\n Meanwhile the sun was setting. Sonia was standing in dejection, looking intently out of the window, but from it she could see nothing but the unwhitewashed blank wall of the next house. At last when she began to feel sure of his death--he walked into the room.\\n\\n She gave a cry of joy, but looking carefully into his face she turned pale.\\n\\n \"Yes,\" said Raskolnikov, smiling. \"I have come for your cross, Sonia. It was you told me to go to the cross-roads; why is it you are frightened now it\u0027s come to that?\"\\n\\n Sonia gazed at him astonished. His tone seemed strange to her; a cold shiver ran over her, but in a moment she guessed that the tone and the words were a mask. He spoke to her looking away, as though to avoid meeting her eyes.\\n\\n \"You see, Sonia, I\u0027ve decided that it will be better so. There is one fact. . . . But it\u0027s a long story and there\u0027s no need to discuss it. But do you know what angers me? It annoys me that all those stupid brutish faces will be gaping at me directly, pestering me with their stupid questions, which I shall have to answer--they\u0027ll point their fingers at me. . . . Tfoo! You know I am not going to Porfiry, I am sick of him. I\u0027d rather go to my friend, the Explosive Lieutenant; how I shall surprise him, what a sensation I shall make! But I must be cooler; I\u0027ve become too irritable of late. You know I was nearly shaking my fist at my sister just now, because she turned to take a last look at me. It\u0027s a brutal state to be in! Ah! what am I coming to! Well, where are the crosses?\"\\n\\n He seemed hardly to know what he was doing. He could not stay still or concentrate his attention on anything; his ideas seemed to gallop after one another, he talked incoherently, his hands trembled slightly.\\n\\n Without a word Sonia took out of the drawer two crosses, one of cypress wood and one of copper. She made the sign of the cross over herself and over him, and put the wooden cross on his neck.\\n\\n \"It\u0027s the symbol of my taking up the cross,\" he laughed. \"As though I had not suffered much till now! The wooden cross, that is the peasant one; the copper one, that is Lizaveta\u0027s--you will wear yourself, show me! So she had it on . . . at that moment? I remember two things like these too, a silver one and a little ikon. I threw them back on the old woman\u0027s neck. Those would be appropriate now, really, those are what I ought to put on now. . . . But I am talking nonsense and forgetting what matters; I\u0027m somehow forgetful. . . . You see I have come to warn you, Sonia, so that you might know . . . that\u0027s all-- that\u0027s all I came for. But I thought I had more to say. You wanted me to go yourself. Well, now I am going to prison and you\u0027ll have your wish. Well, what are you crying for? You too? Don\u0027t. Leave off! Oh, how I hate it all!\"\\n\\n But his feeling was stirred; his heart ached, as he looked at her. \"Why is she grieving too?\" he thought to himself. \"What am I to her? Why does she weep? Why is she looking after me, like my mother or Dounia? She\u0027ll be my nurse.\"\\n\\n \"Cross yourself, say at least one prayer,\" Sonia begged in a timid broken voice.\\n\\n \"Oh certainly, as much as you like! And sincerely, Sonia, sincerely. . . .\"\\n\\n But he wanted to say something quite different.\\n\\n He crossed himself several times. Sonia took up her shawl and put it over her head. It was the green /drap de dames/ shawl of which Marmeladov had spoken, \"the family shawl.\" Raskolnikov thought of that looking at it, but he did not ask. He began to feel himself that he was certainly forgetting things and was disgustingly agitated. He was frightened at this. He was suddenly struck too by the thought that Sonia meant to go with him.\\n\\n \"What are you doing? Where are you going? Stay here, stay! I\u0027ll go alone,\" he cried in cowardly vexation, and almost resentful, he moved towards the door. \"What\u0027s the use of going in procession?\" he muttered going out.\\n\\n Sonia remained standing in the middle of the room. He had not even said good-bye to her; he had forgotten her. A poignant and rebellious doubt surged in his heart.\\n\\n \"Was it right, was it right, all this?\" he thought again as he went down the stairs. \"Couldn\u0027t he stop and retract it all . . . and not go?\"\\n\\n But still he went. He felt suddenly once for all that he mustn\u0027t ask himself questions. As he turned into the street he remembered that he had not said good-bye to Sonia, that he had left her in the middle of the room in her green shawl, not daring to stir after he had shouted at her, and he stopped short for a moment. At the same instant, another thought dawned upon him, as though it had been lying in wait to strike him then.\\n\\n \"Why, with what object did I go to her just now? I told her--on business; on what business? I had no sort of business! To tell her I was /going/; but where was the need? Do I love her? No, no, I drove her away just now like a dog. Did I want her crosses? Oh, how low I\u0027ve sunk! No, I wanted her tears, I wanted to see her terror, to see how her heart ached! I had to have something to cling to, something to delay me, some friendly face to see! And I dared to believe in myself, to dream of what I would do! I am a beggarly contemptible wretch, contemptible!\"\\n\\n He walked along the canal bank, and he had not much further to go. But on reaching the bridge he stopped and turning out of his way along it went to the Hay Market.\\n\\n He looked eagerly to right and left, gazed intently at every object and could not fix his attention on anything; everything slipped away. \"In another week, another month I shall be driven in a prison van over this bridge, how shall I look at the canal then? I should like to remember this!\" slipped into his mind. \"Look at this sign! How shall I read those letters then? It\u0027s written here \u0027Campany,\u0027 that\u0027s a thing to remember, that letter /a/, and to look at it again in a month--how shall I look at it then? What shall I be feeling and thinking then? . . . How trivial it all must be, what I am fretting about now! Of course it must all be interesting . . . in its way . . . (Ha-ha-ha! What am I thinking about?) I am becoming a baby, I am showing off to myself; why am I ashamed? Foo! how people shove! that fat man--a German he must be--who pushed against me, does he know whom he pushed? There\u0027s a peasant woman with a baby, begging. It\u0027s curious that she thinks me happier than she is. I might give her something, for the incongruity of it. Here\u0027s a five copeck piece left in my pocket, where did I get it? Here, here . . . take it, my good woman!\"\\n\\n \"God bless you,\" the beggar chanted in a lachrymose voice.\\n\\n He went into the Hay Market. It was distasteful, very distasteful to be in a crowd, but he walked just where he saw most people. He would have given anything in the world to be alone; but he knew himself that he would not have remained alone for a moment. There was a man drunk and disorderly in the crowd; he kept trying to dance and falling down. There was a ring round him. Raskolnikov squeezed his way through the crowd, stared for some minutes at the drunken man and suddenly gave a short jerky laugh. A minute later he had forgotten him and did not see him, though he still stared. He moved away at last, not remembering where he was; but when he got into the middle of the square an emotion suddenly came over him, overwhelming him body and mind.\\n\\n He suddenly recalled Sonia\u0027s words, \"Go to the cross-roads, bow down to the people, kiss the earth, for you have sinned against it too, and say aloud to the whole world, \u0027I am a murderer.\u0027\" He trembled, remembering that. And the hopeless misery and anxiety of all that time, especially of the last hours, had weighed so heavily upon him that he positively clutched at the chance of this new unmixed, complete sensation. It came over him like a fit; it was like a single spark kindled in his soul and spreading fire through him. Everything in him softened at once and the tears started into his eyes. He fell to the earth on the spot. . . .\\n\\n He knelt down in the middle of the square, bowed down to the earth, and kissed that filthy earth with bliss and rapture. He got up and bowed down a second time.\\n\\n \"He\u0027s boozed,\" a youth near him observed.\\n\\n There was a roar of laughter.\\n\\n \"He\u0027s going to Jerusalem, brothers, and saying good-bye to his children and his country. He\u0027s bowing down to all the world and kissing the great city of St. Petersburg and its pavement,\" added a workman who was a little drunk.\\n\\n \"Quite a young man, too!\" observed a third.\\n\\n \"And a gentleman,\" someone observed soberly.\\n\\n \"There\u0027s no knowing who\u0027s a gentleman and who isn\u0027t nowadays.\"\\n\\n These exclamations and remarks checked Raskolnikov, and the words, \"I am a murderer,\" which were perhaps on the point of dropping from his lips, died away. He bore these remarks quietly, however, and, without looking round, he turned down a street leading to the police office. He had a glimpse of something on the way which did not surprise him; he had felt that it must be so. The second time he bowed down in the Hay Market he saw, standing fifty paces from him on the left, Sonia. She was hiding from him behind one of the wooden shanties in the market-place. She had followed him then on his painful way! Raskolnikov at that moment felt and knew once for all that Sonia was with him for ever and would follow him to the ends of the earth, wherever fate might take him. It wrung his heart . . . but he was just reaching the fatal place.\\n\\n He went into the yard fairly resolutely. He had to mount to the third storey. \"I shall be some time going up,\" he thought. He felt as though the fateful moment was still far off, as though he had plenty of time left for consideration.\\n\\n Again the same rubbish, the same eggshells lying about on the spiral stairs, again the open doors of the flats, again the same kitchens and the same fumes and stench coming from them. Raskolnikov had not been here since that day. His legs were numb and gave way under him, but still they moved forward. He stopped for a moment to take breath, to collect himself, so as to enter /like a man/. \"But why? what for?\" he wondered, reflecting. \"If I must drink the cup what difference does it make? The more revolting the better.\" He imagined for an instant the figure of the \"explosive lieutenant,\" Ilya Petrovitch. Was he actually going to him? Couldn\u0027t he go to someone else? To Nikodim Fomitch? Couldn\u0027t he turn back and go straight to Nikodim Fomitch\u0027s lodgings? At least then it would be done privately. . . . No, no! To the \"explosive lieutenant\"! If he must drink it, drink it off at once.\\n\\n Turning cold and hardly conscious, he opened the door of the office. There were very few people in it this time--only a house porter and a peasant. The doorkeeper did not even peep out from behind his screen. Raskolnikov walked into the next room. \"Perhaps I still need not speak,\" passed through his mind. Some sort of clerk not wearing a uniform was settling himself at a bureau to write. In a corner another clerk was seating himself. Zametov was not there, nor, of course, Nikodim Fomitch.\\n\\n \"No one in?\" Raskolnikov asked, addressing the person at the bureau.\\n\\n \"Whom do you want?\"\\n\\n \"A-ah! Not a sound was heard, not a sight was seen, but I scent the Russian . . . how does it go on in the fairy tale . . . I\u0027ve forgotten! \u0027At your service!\u0027\" a familiar voice cried suddenly.\\n\\n Raskolnikov shuddered. The Explosive Lieutenant stood before him. He had just come in from the third room. \"It is the hand of fate,\" thought Raskolnikov. \"Why is he here?\"\\n\\n \"You\u0027ve come to see us? What about?\" cried Ilya Petrovitch. He was obviously in an exceedingly good humour and perhaps a trifle exhilarated. \"If it\u0027s on business you are rather early.(*) It\u0027s only a chance that I am here . . . however I\u0027ll do what I can. I must admit, I . . . what is it, what is it? Excuse me. . . .\"\\n\\n (*) Dostoevsky appears to have forgotten that it is after sunset, and that the last time Raskolnikov visited the police office at two in the afternoon he was reproached for coming too late.--TRANSLATOR.\\n\\n \"Raskolnikov.\"\\n\\n \"Of course, Raskolnikov. You didn\u0027t imagine I\u0027d forgotten? Don\u0027t think I am like that . . . Rodion Ro--Ro--Rodionovitch, that\u0027s it, isn\u0027t it?\"\\n\\n \"Rodion Romanovitch.\"\\n\\n \"Yes, yes, of course, Rodion Romanovitch! I was just getting at it. I made many inquiries about you. I assure you I\u0027ve been genuinely grieved since that . . . since I behaved like that . . . it was explained to me afterwards that you were a literary man . . . and a learned one too . . . and so to say the first steps . . . Mercy on us! What literary or scientific man does not begin by some originality of conduct! My wife and I have the greatest respect for literature, in my wife it\u0027s a genuine passion! Literature and art! If only a man is a gentleman, all the rest can be gained by talents, learning, good sense, genius. As for a hat--well, what does a hat matter? I can buy a hat as easily as I can a bun; but what\u0027s under the hat, what the hat covers, I can\u0027t buy that! I was even meaning to come and apologise to you, but thought maybe you\u0027d . . . But I am forgetting to ask you, is there anything you want really? I hear your family have come?\"\\n\\n \"Yes, my mother and sister.\"\\n\\n \"I\u0027ve even had the honour and happiness of meeting your sister--a highly cultivated and charming person. I confess I was sorry I got so hot with you. There it is! But as for my looking suspiciously at your fainting fit--that affair has been cleared up splendidly! Bigotry and fanaticism! I understand your indignation. Perhaps you are changing your lodging on account of your family\u0027s arriving?\"\\n\\n \"No, I only looked in . . . I came to ask . . . I thought that I should find Zametov here.\"\\n\\n \"Oh, yes! Of course, you\u0027ve made friends, I heard. Well, no, Zametov is not here. Yes, we\u0027ve lost Zametov. He\u0027s not been here since yesterday . . . he quarrelled with everyone on leaving . . . in the rudest way. He is a feather-headed youngster, that\u0027s all; one might have expected something from him, but there, you know what they are, our brilliant young men. He wanted to go in for some examination, but it\u0027s only to talk and boast about it, it will go no further than that. Of course it\u0027s a very different matter with you or Mr. Razumihin there, your friend. Your career is an intellectual one and you won\u0027t be deterred by failure. For you, one may say, all the attractions of life /nihil est/--you are an ascetic, a monk, a hermit! . . . A book, a pen behind your ear, a learned research--that\u0027s where your spirit soars! I am the same way myself. . . . Have you read Livingstone\u0027s Travels?\"\\n\\n \"No.\"\\n\\n \"Oh, I have. There are a great many Nihilists about nowadays, you know, and indeed it is not to be wondered at. What sort of days are they? I ask you. But we thought . . . you are not a Nihilist of course? Answer me openly, openly!\"\\n\\n \"N-no . . .\"\\n\\n \"Believe me, you can speak openly to me as you would to yourself! Official duty is one thing but . . . you are thinking I meant to say /friendship/ is quite another? No, you\u0027re wrong! It\u0027s not friendship, but the feeling of a man and a citizen, the feeling of humanity and of love for the Almighty. I may be an official, but I am always bound to feel myself a man and a citizen. . . . You were asking about Zametov. Zametov will make a scandal in the French style in a house of bad reputation, over a glass of champagne . . . that\u0027s all your Zametov is good for! While I\u0027m perhaps, so to speak, burning with devotion and lofty feelings, and besides I have rank, consequence, a post! I am married and have children, I fulfil the duties of a man and a citizen, but who is he, may I ask? I appeal to you as a man ennobled by education . . . Then these midwives, too, have become extraordinarily numerous.\"\\n\\n Raskolnikov raised his eyebrows inquiringly. The words of Ilya Petrovitch, who had obviously been dining, were for the most part a stream of empty sounds for him. But some of them he understood. He looked at him inquiringly, not knowing how it would end.\\n\\n \"I mean those crop-headed wenches,\" the talkative Ilya Petrovitch continued. \"Midwives is my name for them. I think it a very satisfactory one, ha-ha! They go to the Academy, study anatomy. If I fall ill, am I to send for a young lady to treat me? What do you say? Ha-ha!\" Ilya Petrovitch laughed, quite pleased with his own wit. \"It\u0027s an immoderate zeal for education, but once you\u0027re educated, that\u0027s enough. Why abuse it? Why insult honourable people, as that scoundrel Zametov does? Why did he insult me, I ask you? Look at these suicides, too, how common they are, you can\u0027t fancy! People spend their last halfpenny and kill themselves, boys and girls and old people. Only this morning we heard about a gentleman who had just come to town. Nil Pavlitch, I say, what was the name of that gentleman who shot himself?\"\\n\\n \"Svidrigailov,\" someone answered from the other room with drowsy listlessness.\\n\\n Raskolnikov started.\\n\\n \"Svidrigailov! Svidrigailov has shot himself!\" he cried.\\n\\n \"What, do you know Svidrigailov?\"\\n\\n \"Yes . . . I knew him. . . . He hadn\u0027t been here long.\"\\n\\n \"Yes, that\u0027s so. He had lost his wife, was a man of reckless habits and all of a sudden shot himself, and in such a shocking way. . . . He left in his notebook a few words: that he dies in full possession of his faculties and that no one is to blame for his death. He had money, they say. How did you come to know him?\"\\n\\n \"I . . . was acquainted . . . my sister was governess in his family.\"\\n\\n \"Bah-bah-bah! Then no doubt you can tell us something about him. You had no suspicion?\"\\n\\n \"I saw him yesterday . . . he . . . was drinking wine; I knew nothing.\"\\n\\n Raskolnikov felt as though something had fallen on him and was stifling him.\\n\\n \"You\u0027ve turned pale again. It\u0027s so stuffy here . . .\"\\n\\n \"Yes, I must go,\" muttered Raskolnikov. \"Excuse my troubling you. . . .\"\\n\\n \"Oh, not at all, as often as you like. It\u0027s a pleasure to see you and I am glad to say so.\"\\n\\n Ilya Petrovitch held out his hand.\\n\\n \"I only wanted . . . I came to see Zametov.\"\\n\\n \"I understand, I understand, and it\u0027s a pleasure to see you.\"\\n\\n \"I . . . am very glad . . . good-bye,\" Raskolnikov smiled.\\n\\n He went out; he reeled, he was overtaken with giddiness and did not know what he was doing. He began going down the stairs, supporting himself with his right hand against the wall. He fancied that a porter pushed past him on his way upstairs to the police office, that a dog in the lower storey kept up a shrill barking and that a woman flung a rolling-pin at it and shouted. He went down and out into the yard. There, not far from the entrance, stood Sonia, pale and horror- stricken. She looked wildly at him. He stood still before her. There was a look of poignant agony, of despair, in her face. She clasped her hands. His lips worked in an ugly, meaningless smile. He stood still a minute, grinned and went back to the police office.\\n\\n Ilya Petrovitch had sat down and was rummaging among some papers. Before him stood the same peasant who had pushed by on the stairs.\\n\\n \"Hulloa! Back again! have you left something behind? What\u0027s the matter?\"\\n\\n Raskolnikov, with white lips and staring eyes, came slowly nearer. He walked right to the table, leaned his hand on it, tried to say something, but could not; only incoherent sounds were audible.\\n\\n \"You are feeling ill, a chair! Here, sit down! Some water!\"\\n\\n Raskolnikov dropped on to a chair, but he kept his eyes fixed on the face of Ilya Petrovitch, which expressed unpleasant surprise. Both looked at one another for a minute and waited. Water was brought.\\n\\n \"It was I . . .\" began Raskolnikov.\\n\\n \"Drink some water.\"\\n\\n Raskolnikov refused the water with his hand, and softly and brokenly, but distinctly said:\\n\\n \"/It was I killed the old pawnbroker woman and her sister Lizaveta with an axe and robbed them./\"\\n\\n Ilya Petrovitch opened his mouth. People ran up on all sides.\\n\\n Raskolnikov repeated his statement.\\n\\n \\n\\n 他走进索尼娅的住处的时候，已经是暮色苍茫，天快黑了。整整一天，索尼娅一直在异常焦急不安地等着他。她和杜尼娅一起在等着他。杜尼娅想起斯维德里盖洛夫昨天说的话：索尼娅“知道这件事”，从一清早就到她这儿来了。两个女人谈了些什么，以及她们怎样流泪，怎样成了朋友，我们就不详谈了。杜尼娅从这次会晤中至少得到了一点儿安慰：哥哥不会是孤单单的独自一人，因为他来找过她，找过索尼娅，首先向她坦白了自己的事情；当他需要有一个人支持他的时候，他找到了她；不管命运让他去哪里，她都一定会跟着他。杜尼娅并没问过，不过知道，一定会是这样。她甚至怀着尊敬的心情看着索尼娅，起初，杜尼娅对她的这种尊敬心情几乎使索尼娅发窘了。索尼娅甚至差点儿没哭出来：恰恰相反，她认为自己连对杜尼娅看一眼都不配。自从她和杜尼娅在拉斯科利尼科夫那里第一次见面，杜尼娅那样恳切和尊敬地对她行礼，杜尼娅优美的形象就作为她一生中所见到的最完美和不可企及的幻影，永远深深留在了她的心中。\\n\\n 杜涅奇卡终于等得失去耐心，于是离开索尼娅，到她哥哥的住处去等他了，她总觉得，他会先回住处去。只剩下索尼娅独自一人之后，一想到他也许当真会自杀，她立刻感到害怕了，为此心里痛苦不堪。杜尼娅担心的也是这一点。但是一天来她们俩总是争先恐后地举出种种理由互相说服对方，让对方相信，这决不可能，而且当她们在一起的时候，两人都觉得比较放心些。现在，两人刚一分手，无论是这一个，还是另一个，心里都只是想着这一点。索尼娅想起，昨天斯维德里盖洛夫对她说，拉斯科利尼科夫有两条路——弗拉基米尔，或者是……何况她知道，他虚荣，傲慢自大，有很强的自尊心，而且不信上帝。“难道仅仅由于怯懦和怕死，就能使他活下去吗？”最后她绝望地想。这时太阳已经西沉。她愁眉不展地站在窗前，凝望着窗外，但是从这面窗子望出去，只能看到邻家一堵没有粉刷过的墙壁。最后，当她完全相信，这个不幸的人准是已经死了的时候，他走进了她的房间。\\n\\n 一声惊喜的呼喊从她胸中冲了出来。但是凝神注视了一下他的脸，她突然脸色变得惨白。\\n\\n “嗯，是的！”拉斯科利尼科夫冷笑着说，“我是来拿你的十字架的，索尼娅。是你让我到十字路口去；怎么，等到真的要去了，现在你却害怕了吗？”\\n\\n 索尼娅惊愕地瞅着他。她觉得这种语气很怪；不由得打了个寒颤，可是稍过了一会儿，她猜到，这种语气和这些话都是假的。他和她说话的时候，不知为什么眼睛望着角落里，仿佛避免正视她的脸。\\n\\n “你要知道，索尼娅，我考虑过了，大概这样会好些。这儿有一个情况……唉，说来话长，而且也没什么好说的。你知道吗，是什么惹得我发火？使我感到恼怒的是，所有这些愚蠢、凶狠的嘴脸立刻就会围住我，瞪着眼睛直瞅着我，向我提出他们那些愚蠢的问题，对这些问题都得回答，他们还会伸出手指来指着我……呸！你要知道，我不去波尔菲里那里；他让我厌烦了。我最好还是去找我的朋友火药桶中尉，让他大吃一惊，就某一点来说，我也会给他留下深刻的印象。应该冷静一点儿；最近这段时间我肝火太旺了。你相信吗，刚才我几乎用拳头吓唬我妹妹，就只因为她回过头来看了我最后一眼。这种行为是可恶的！唉，我变成什么样了？好吧，十字架呢？”\\n\\n 他仿佛惘然若失。他甚至不能在一个地方站上一分钟，对什么东西都不能集中注意力；他思绪紊乱，百感交集，语无伦次；双手微微发抖。\\n\\n 索尼娅默默地从抽屉里拿出两个十字架，一个柏木的和一个铜的，自己画了个十字，也给他画了个十字，把那个柏木的十字架给他佩戴在胸前。\\n\\n “就是说，这是我背十字架的象征，嘿！嘿！好像到目前为止我受的苦还太少似的！柏木的，也就是普通老百姓的；铜的——这是莉扎薇塔的，你自己佩戴着，—— 让我看看好吗？在那时候……这个十字架戴在她身上吗？我知道两个也像这样的十字架，一个银的和一个小圣像。那时候我把它们扔到老太婆的胸前了。那两个十字架现在刚好可以用得上，真的，我该戴那两个……不过，我一直在胡说八道，把正事都忘了；我有点儿心不在焉！……你要知道，索尼娅，我来，其实是为了预先通知你，让你知道……好，就是这些……我只不过是为这件事才来的。（嗯哼，不过，我想再多说几句。）你不是自己希望我去吗，瞧，现在我就要去坐牢，你的愿望就要实现了；你哭什么呢？你也哭吗？别哭了，够了；唉，这一切让我多么难过啊！”\\n\\n 然而，他还是动了感情；看着她，他的心揪紧了。“这一个，这一个为什么哭呢？”他暗自想，“我是她的什么人？她为什么哭，为什么也像母亲或杜尼娅那样为我准备一切？她将要作我的保姆啊！”\\n\\n “你画个十字，哪怕祈祷一次也好，”索尼娅用发抖的、怯生生的声音请求他。\\n\\n “啊，好吧，你要我画多少次都行！而且是真心诚意的，索尼娅，真心诚意的……”\\n\\n 不过他想说的却是旁的。\\n\\n 他画了好几次十字。索尼娅拿起自己的头巾，披在头上。这是一块德拉德达姆呢的绿色头巾，大概就是马尔梅拉多夫当时提起过的那块“全家公用的”头巾。这个想法在拉斯科利尼科夫的头脑里忽然一闪，不过他没问。真的，他自己已经开始感觉到，他非常心不在焉，不知为什么毫无道理地心烦意乱。这使他感到害怕。索尼娅想和他一道去，这使他突然吃了一惊。\\n\\n “你怎么了！你去哪里？你留下来，你留下来！我一个人去，”他胆怯而恼怒地喊了一声，几乎是气愤地往门口走去。\\n\\n “干吗要有人跟着！”他临出去的时候又含糊不清地说。\\n\\n 索尼娅站在了房屋中间。他甚至没有和她告别，他已经把她给忘了；他心中突然出现了一个起来反抗的、尖刻的疑问。\\n\\n “是这样吗，这一切真的是这样吗？”下楼的时候，他又想，“难道不能再等一等，设法挽救一切……不要去吗？”\\n\\n 可他还是去了。他突然完全意识到，用不着再向自己提出问题了。来到街上以后，他想起，没跟索尼娅告别，她站在房屋中间，披着那块绿色的头巾，由于他那一声叫喊，吓得她连动都不敢动了，于是他停下来，稍站了一下。可是就在这一瞬间，突然有一个想法使他恍然明白过来，——仿佛这个想法一直在等待时机，要让他大吃一惊似的。\\n\\n “喂，刚才我是为什么，为了什么来找她？我对她说：有事；到底有什么事？根本没有什么事！向她宣布，我要去；那又怎样呢？好重要的事情！我是不是爱她呢？不爱，不是吗，不爱？刚才我不是像赶走一条狗一样，把她赶开了吗。我真的是需要她的十字架吗？噢，我堕落到了多么卑鄙的程度！不，我需要的是她的眼泪，我需要看到她那惊恐的神情，需要看看她是多么伤心，多么痛苦！需要至少抓住个什么机会，需要拖延时间，需要看看她！而我竟敢对自己抱着这么大的希望，对自己存有这么多幻想，我是个叫化子，我是个微不足道的人，我是个卑鄙的人，卑鄙的人！”\\n\\n 他顺着运河的沿岸街走着，离他要去的地方已经不远了。但是走到桥边，他站住了，突然转弯上了桥，往干草广场那边走去。\\n\\n 他贪婪地向左右观看，神情紧张地细细端详每样东西，可是无论看什么都不能集中注意力；一切都从他眼前悄悄地溜走了。“再过一个星期，再过一个月，就要把我关在囚车里，从这座桥上经过，押解到什么地方去，到那时候我会怎样看这条运河呢，——要是能记住它就好了？”这个想法在他头脑里忽然一闪。“瞧这块招牌，到那时候我会怎样来看这些字母呢？这上面写的是‘股份公司’，嗯，我要记住这个a，记住a这个字母，过一个月以后再来看它，看这个a：到那时候我会怎样来看它呢？到那时候会有什么感觉，会想什么呢？……天哪，这一切想必是多么平凡，现在我……关心的这一切想必是多么微不足道！当然啦，从某一点来看……这一切想必是很有意思的……（哈——哈——哈！我在想什么啊！）我变成个小孩子了，我自己在跟自己吹牛；我为什么要让自己感到难为情呢？呸，多么拥挤啊！瞧这个胖子，大概是个德国人，——他推了我一下：哼，他知道，他推的是什么人吗？一个抱着小孩的女人在乞讨，她以为我比她幸福，这可真有意思。给她几个钱，解解闷，怎么样呢。哈，口袋儿里还有五个戈比，这是哪儿来的？给，给……拿着吧，老大娘！”\\n\\n “上帝保佑你！”听到了那个女乞丐凄惨的声音。\\n\\n 他走进干草广场。他不高兴、很不乐意碰到人，可是却往人更多的地方走去。他情愿付出一切代价，只要能让他只剩下独自一人；可是他又觉得，连一分钟也不可能只有他独自一个人。有个醉鬼在人群中胡闹：他一直想要跳舞，可总是摔倒。人们围住了他。拉斯科利尼科夫挤进人群里，对着那个醉鬼看了好几分钟，突然短促地、断断续续地哈哈大笑起来。稍过了一会儿，他已经把那个醉鬼忘了，甚至看不见他了，尽管还在看着他。他终于走开了，甚至记不得自己是在什么地方；可是等他走到广场中心，突然一阵感情冲动，有一种心情一下子控制了他，控制了他的整个身心。\\n\\n 他突然想起了索尼娅的话：“你去到十字路口，给人们躬身施礼，吻吻大地，因为你对大地也犯了罪，然后对着全世界大声说：‘我是杀人凶手！’”想起这些话，他不由得浑身发抖了。在这一段时间里，特别是最后几个钟头里，他心中感觉到的那种走投无路的苦恼和担心已经压垮了他，使他的精神崩溃了，所以他情不自禁，急欲抓住这个机会，来体验一下这种纯洁、充实、前所未有的感受。这感情突然爆发，涌上他的心头：心中好似迸发出一颗火星，突然熊熊燃烧起来，烧遍了他的全身。他的心立刻软了，泪如泉涌。他站在那里，突然伏倒在地上……\\n\\n 他跪倒在广场中央，在地上磕头，怀着喜悦和幸福的心情吻了吻这肮脏的土地。他站起来，又跪下去磕头。\\n\\n “瞧，他喝醉了！”他身旁有个小伙子说。\\n\\n 突然听到一阵笑声。\\n\\n “他这是要去耶路撒冷啊，朋友们，在跟孩子们，跟祖国告别，向全世界磕头，在吻京城圣彼得堡和它的土地呢，”一个喝醉的小市民补充说。\\n\\n “小伙子还年轻嘛！”第三个插了一句。\\n\\n “还是个高贵的人呢！”有人声音庄重地说。\\n\\n “如今可分不清谁高贵，谁不高贵。”\\n\\n 所有这些反应和谈话制止了拉斯科利尼科夫，本来“我杀了人”这句话也许就要脱口而出了，这时却突然咽了回去。然而他镇静地忍受住了这些叫喊，并没有左顾右盼，径直穿过一条胡同，往警察分局那个方向走去。路上好像有个幻影在他眼前忽然一闪，但是他并不觉得惊奇；他已经预感到，必然会是这样。他在干草广场上第二次跪下来的时候，扭过头去往左边一看，在离他五十步远的地方看到了索尼娅。她躲在广场上一座板棚后面，不让他看见，这么说，在他踏上这悲痛的行程时，一路上她一直伴随着他！这时拉斯科利尼科夫感觉到，而且彻底明白了，不管命运会让他到什么地方去，现在索尼娅将永远跟着他，哪怕去海角天涯。他的心碎了……\\n\\n 然而他已经来到了决定今后命运的地方……\\n\\n 他相当勇敢地走进了院子。得到三楼上去。“还得上楼，暂时还有时间，”他想。总之，他觉得，到决定命运的那个时刻还远着呢，还有很多时间，很多事情还可以重新考虑一下。\\n\\n 那道螺旋形的楼梯上还是那样丢满了垃圾和蛋壳，那些住房的门还是那样大敞着，又是那些厨房，从厨房里还是那样冒出一股股油烟和臭气。从那天以后，拉斯科利尼科夫没再来过这里。他的腿麻木了，发软了，可是还在往上走。他站下来，停了一会儿，好歇口气，整理一下衣服，这样，进去的时候才会像个人样儿。“可这是为什么？为了什么？”他意识到自己是在做什么以后，突然想。“既然得喝干这杯苦酒，那不反正一样吗？越脏越好。”就在这一瞬间，伊利亚·彼特罗维奇·火药桶中尉的形象在他的想象中突然一闪。“难道真的要去找他吗？不能去找别人？不能去找尼科季姆·福米奇吗？是不是立刻回去，到分局长家里去找他本人呢？至少可以私下里解决……不，不！去找火药桶，火药桶！要喝，那就一下子全都喝下去……”\\n\\n 他浑身发冷，几乎控制不住自己，打开了办公室的门。这一次办公室里的人寥寥无几，里面站着一个管院子的，还有一个平民。警卫都没从隔板后面往外看一眼。拉斯科利尼科夫走进后面一间屋里去了。“也许还可以不说，”这个想法在他头脑里闪了一下。这儿有个穿普通常礼服的司书，坐在一张写字台前，正在抄写什么。角落里还坐着一个司书。扎苗托夫不在。尼科季姆·福米奇当然也不在。\\n\\n “谁也不在吗？”拉斯科利尼科夫问那个坐在写字台前的司书。\\n\\n “您找谁？”\\n\\n “啊——啊——啊！真是闻所未闻，见所未见，可是俄罗斯精神……童话里是怎么说来的……我忘了！您——好！”突然有个熟悉的声音喊道。\\n\\n 拉斯科利尼科夫打了个哆嗦。站在他面前的是火药桶中尉；他突然从第三个房间里走了出来。“这真是命运，”拉斯科利尼科夫想，“他为什么在这儿呢？”\\n\\n “来找我们的？有什么事吗？”伊利亚·彼特罗维奇高声说，（看来他心情好极了，甚至有点儿兴奋。）“如果有事，那您来得早了些。我是偶然在这儿的……不过，我能帮忙。我跟您说实在的……您贵姓？贵姓？对不起……”\\n\\n “拉斯科利尼科夫。”\\n\\n “啊，对：拉斯科利尼科夫！难道您认为我会忘了！请您不要把我看作这样的人……罗季昂·罗……罗……罗季昂内奇，好像是这样吧？”\\n\\n “罗季昂·罗曼内奇。”\\n\\n “对，对——对，罗季昂·罗曼内奇，罗季昂·罗曼内奇！我正要找您谈谈呢。我甚至打听过好多次了。我，跟您说实在的，当时我们那样对待您，从那以后我真心诚意地感到难过……后来人家告诉我，我才知道，您是位年轻作家，甚至是一位学者……而且，可以这么说吧，已经迈出了最初几步……噢，上帝啊！有哪个作家和学者一开始不做出一些异想天开的事情来呢！我和内人——我们俩都尊重文学，内人更是热爱文学！……热爱文学和艺术！一个人只要是高尚的，那么其余的一切都可以靠才能、知识、理智和天才来获得！帽子——譬如说吧，帽子是什么呢？帽子就像薄饼，我可以在齐梅尔曼的帽店里买到它；可是帽子底下保藏着的东西和用帽子掩盖着的东西，我就买不到了！……我，说实在的，甚至想去找您解释解释，可是想，您也许……不过，我还没问：\\n\\n 您是不是真的有什么事？据说，您家里的人来了？”\\n\\n “是的，母亲和妹妹。”\\n\\n “我甚至有幸遇到过令妹，是一位很有教养、十分漂亮的姑娘。说实在的，当时我对您过于急躁，我很遗憾。意料不到的事嘛！因为您晕倒了，当时我就用某种眼光来看您，——可是后来这件事彻底弄清楚了！残暴和盲目的狂热！您的愤慨，我是理解的。也许，是因为家里人来了，您要搬家？”\\n\\n “不，我只不过是……我是顺便来问问……我以为，我可以在这儿找到扎苗托夫。”\\n\\n “啊，对了！你们成了朋友了；我听说了。嗯，扎苗托夫不在我们这儿，——您碰不到他了。是啊，亚历山大·格里戈里耶维奇离开我们这儿了！从昨天起就不在了，调走了……临调走的时候，甚至跟所有的人都大吵了一场……甚至那么不懂礼貌……他只不过是个轻浮的小孩子；本来他很有前途；是啊，您瞧，他们，我们这些卓越的青年人可真怪！他想要参加什么考试，可是只会在我们这儿说空话，吹牛，考试就这么吹了。这可不像，譬如说吧，您，或者拉祖米欣先生，您的朋友！您是搞学术的，失败不会使您迷失方向！在您看来，人生所有这些诱人的玩意儿，可以说——nihilest①，您是个禁欲主义者，僧侣，隐士！……对您来说，书本，夹在耳朵后边的笔，学术研究，——这才是您心灵翱翔的地方！我自己也多多少少……请问您看过利文斯通的笔记吗②？”\\n\\n --------\\n\\n ①拉丁文，意为“什么也不是，等于零。”\\n\\n ②大卫·利文斯通（一八一三——一八七三），英国著名旅行家，非洲考察者。这里可能是指他的《赞比西河游记》（一八六五）。\\n\\n “没有。”\\n\\n “我看过了。不过现在到处都有很多虚无主义者；嗯，这是可以理解的；这是什么样的时代啊，我请问您？不过，我和您……我们，不是吗，当然，我们可不是虚无主义者！请您坦率地回答，开诚布公地！”\\n\\n “不—不是……”\\n\\n “不，您听我说，您跟我可要开诚布公，您别不好意思，就像自己跟自己一样嘛！公务是一回事，……是另一回事……您以为，我是想说友谊吗，不，您没猜对！不是友谊，而是公民和人的感情，人道的感情，对上帝的爱的那种感情。履行公务的时候，我可以是个官方人员，可是我应该永远感到自己是一个公民，是一个人，而且意识到……您刚刚谈到了扎苗托夫。扎苗托夫，他在一家妓院里喝了一杯香槟或者是顿河葡萄酒，于是就照法国人的方式，大闹了一场，出尽了丑，——瞧，这就是您的扎苗托夫！而我，也许可以说，我极端忠诚，有崇高的感情，此外，我还有地位，我有官衔，担任一定的职务！我有妻室儿女。我在履行公民和人的义务，可是，请问，他是个什么人？我是把您看作一位受过教育、品格高尚的人。还有这些接生婆，也到处都是，多得要命①。”\\n\\n 拉斯科利尼科夫疑问地扬起了眉毛。显然，伊利亚·彼特罗维奇是刚刚离开桌边，他的话滔滔不绝，可是空空洞洞，听起来大半好像是些没有任何意义的响声。不过其中有一部分，拉斯科利尼科夫还是勉强听懂了；他疑问地望着他，不知道这一切会怎样收场。\\n\\n “我说的是这些剪短头发的少女②，”爱说话的伊利亚·彼特罗维奇接下去说，“我给她们取了个绰号，管她们叫接生婆，而且认为，这个绰号十分贴切。嘿！嘿！她们拼命钻进医学院，学习解剖学；嗯，请问，要是我病了，我会去请个少女来治病吗？嘿！嘿！”\\n\\n --------\\n\\n ①火药桶中尉蔑视地把“助产士”叫作“接生婆”。保守派的报刊通常都这样攻击女权运动者。十九世纪六十年代，俄国妇女只能从事两种职业：助产士和教师。\\n\\n ②指医学院的女学生，她们都剪短发。这些女学生毕业后都只能作助产士。\\n\\n 伊利亚·彼特罗维奇哈哈大笑，对自己这些俏皮话感到非常满意。\\n\\n “就算这是对于受教育的过分的渴望吧；可是受了教育，也就够了。为什么要滥用呢？为什么要像那个坏蛋扎苗托夫那样，侮辱高贵的人们呢？请问，他为什么要侮辱我？还有这些自杀，出了多少起这样的事啊，——您简直无法想象。都是这样，花完了最后一点儿钱，于是就自杀了。小姑娘，男孩子，老年人……这不是，今天早晨就接到报告，有一位不久前才来到这儿的先生自杀了。尼尔·帕夫雷奇，尼尔·帕夫雷奇！刚才报告的那位绅士，在彼得堡区开枪自杀的那位绅士，他叫什么？”\\n\\n “斯维德里盖洛夫，”另一间屋里有人声音嘶哑、语气冷淡地回答。\\n\\n 拉斯科利尼科夫不由得颤栗了一下。\\n\\n “斯维德里盖洛夫！斯维德里盖洛夫开枪自杀了！”他高声惊呼。\\n\\n “怎么！您认识斯维德里盖洛夫？”\\n\\n “是的……我认识……他是不久前才来的……”\\n\\n “是啊，是不久前来的，妻子死了，是个放荡不羁的人，突然开枪自杀了，而且那么丢脸，简直无法想象……在他自己的笔记本里留下了几句话，说他是在神智清醒的情况下自杀的，请不要把他的死归罪于任何人。据说，这个人有钱。请问您是怎么认识他的？”\\n\\n “我……认识他……舍妹在他家里作过家庭教师……”\\n\\n “噢，噢，噢……这么说，您可以跟我们谈谈他的情况了。\\n\\n 您怕也没料到吧？”\\n\\n “我昨天见过他……他……喝了酒……我什么也不知道。”\\n\\n 拉斯科利尼科夫觉得，好像有个什么东西落到了他的身上，压住了他。\\n\\n “您脸色好像又发白了。我们这儿空气污浊……”\\n\\n “是的，我该走了，”拉斯科利尼科夫含糊不清地说，“请原谅，我打搅了……”\\n\\n “噢，您说哪里话，请常来！非常欢迎您来，我很高兴这样说……”\\n\\n 伊利亚·彼特罗维奇甚至伸过手来。\\n\\n “我只不过想……我要去找扎苗托夫……”\\n\\n “我明白，我明白，您让我非常高兴。”\\n\\n “我……很高兴……再见……”拉斯科利尼科夫微笑着说。\\n\\n 他出去了，他摇摇晃晃。他头晕。他感觉不出，自己是不是还在站着。他用右手扶着墙，开始下楼。他好像觉得，迎面来了个管院子的人，手里拿着户口簿，撞了他一下，上楼往办公室去了；还好像觉得，下面一层楼上有条小狗在狂吠，有个女人把一根擀面杖朝它扔了过去，而且高声惊叫起来。他下了楼，来到了院子里。索尼娅就站在院子里离门口不远的地方，面无人色，脸色白得可怕，神情古怪地，非常古怪地看了看他。他在她面前站住了。她脸上露出某种痛苦的、极为悲痛和绝望的神情。她双手一拍。他的嘴角上勉强露出很难看的、茫然不知所措的微笑。他站了一会儿，冷笑一声，转身上楼，又走进了办公室。\\n\\n 伊利亚·彼特罗维奇已经坐下来，不知在一堆公文里翻寻着什么。刚才上楼来撞了拉斯科利尼科夫一下的那个管院子的人站在他的面前。\\n\\n “啊——啊——啊？您又来了！忘了什么东西吗？……不过您怎么了？”\\n\\n 拉斯科利尼科夫嘴唇发白，目光呆滞，轻轻地向他走去，走到桌前，用一只手撑在桌子上，想要说什么，可是说不出来；只能听到一些毫不连贯的声音。\\n\\n “您不舒服，拿椅子来！这里，请坐到椅子上，请坐！拿水来！”\\n\\n 拉斯科利尼科夫坐到了椅子上，但是目不转睛地盯着露出非常不愉快的惊讶神情的伊利亚·彼特罗维奇的脸。他们两人互相对看了约摸一分钟光景，两人都在等着。水端来了。\\n\\n “这是我……”拉斯科利尼科夫开始说。\\n\\n “您喝水。”\\n\\n 拉斯科利尼科夫用一只手把水推开，轻轻地，一字一顿，然而清清楚楚地说：\\n\\n “这是我在那时候用斧头杀了那个老太婆——那个官太太，还杀了她的妹妹莉扎薇塔，抢了东西。”\\n\\n 伊利亚·彼特罗维奇惊讶得张大了嘴。人们从四面八方跑了过来。\\n\\n 拉斯科利尼科夫把自己的口供又说了一遍……\\n\\n ……\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/shuangyu/281/2633.html","bookId":225,"book":{"id":225,"title":"罪与罚 英文版 Crime and Punishment","description":"简介： Crime and Punishment (Russian: Преступление и наказание Pryestupleniye i nakazaniye) is a novel by the Russian author Fyodor Dostoyevsky. It was first published in the SWiss literary journal The Russian Messenger in tw...","cover":"http://novel.tingroom.com/uploads/110413/1-110413132T1b3.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/281","creation":"Aug 1, 2019 12:18:25 AM","modification":"Aug 1, 2019 12:18:25 AM"}}
