{"id":12397,"no":2,"title":"Chapter 2","content":"Jack was introduced to a room of truly noble proportions, vast and high, with a row of tall windows with round tops, looking down a narrow street to the harbor. In the center was a flat-topped desk as big as a banquet board and behind it sat a man, dwarfed in size by the vastness of his surroundings—but immeasurably increased in significance. The whole place focused in him. Jack\u0027s silken-tongued conductor announced him, and softly withdrew. The man at the desk raised his head and bent a look of strong interest and quizzical amusement on Jack. It was the face of a man well-assured of his place in the world; serene and careless; a man who consorted on equal terms with labor leaders and kings. \"So this is what you\u0027re like!\" he said. The unexpected look of interest and the strange words instead of heartening Jack had the contrary effect. His knees shook under him a little, his mouth went dry. \"Sit down,\" said Mr. Delamare, indicating a chair opposite him. Jack obeyed, walking jerkily like an automaton. \"I suppose you\u0027re wondering why I sent for you?\" \"Yes, sir.\" \"You have no idea?\" \"No, sir.\" \"I will tell you as soon as you have answered a few questions. I must make sure first that I have got hold of the right man.\" He pulled out a drawer, and taking from it a typewritten sheet, read his question from it. \"Your full name?\" \"John Farrow Norman.\" \"Parents living?\" \"Both dead, sir.\" \"Father\u0027s name?\" \"John Goadby Norman.\" \"Mother\u0027s name?\" \"Phoebe Farrow.\" \"Place of your birth?\" \"Cartonsville, New York.\" There were other questions of a similar tenor, and Jack\u0027s answers were apparently satisfactory to Mr. Delamare. He folded the paper, and searched in the drawer for something else. His next question was an odd one. \"Are you wearing your father\u0027s watch?\" \"Why, yes,\" stammered Jack. It was the one article of value that he possessed. He unhooked it from its chain and passed it over. The banker opened the back of the case as if aware of what was to be found there, and the smiling face of Jack\u0027s mother as a bride was revealed. From the drawer he took an old-fashioned cabinet photograph, and compared it with the picture in the watch case. Jack catching sight of the second picture was startled out of his diffidence. \"My mother\u0027s picture! Where did you get that?\" Mr. Delamare showed him the two faces side by side. \"Not the same photograph, but unquestionably the same woman. You may have both now.\" He handed them over. The picture he had taken from the drawer showed Jack\u0027s mother at an earlier period, just graduating into womanhood with all the touching innocence of youth about her. Jack\u0027s eyes filled. \"What does it mean?\" he murmured. \"One more question,\" said Mr. Delamare. \"Give me a brief account of yourself as far back as you can remember.\" Jack did so, wonderingly, and the banker checked his story with another typewritten sheet that he held. \"That will do,\" he said at last. \"I\u0027m satisfied.\" \"How did you learn all this?\" asked Jack. \"I didn\u0027t think anybody in the world was interested what jobs I had or where I lived.\" \"One never knows,\" was the smiling answer. \"Write your name and I\u0027ll tell you.\" Jack obeyed. The banker compared it with a signature he had. \"Now then,\" he said. \"How would you like to be rich?\" Jack stared at him in a daze. Delamare laughed. \"Rich beyond the dreams of avarice! Worth eighty million dollars in fact.\" \"Eighty million!\" muttered Jack stupidly. \"As you sit there this minute you are worth eighty million—perhaps more.\" \"Where—did I get it?\" stammered Jack helplessly. \"Silas Gyde bequeathed you all he possessed.\" Jack\u0027s face was a study in amazement, incredulity—not to say downright alarm. At the sight Mr. Delamare threw back his head and laughed a peal. \"Don\u0027t take it so hard! You\u0027ll live it down!\" \"What was I to Silas Gyde?\" murmured Jack. \"I don\u0027t know the whole story. Mr. Gyde took no man on earth into his confidence. I judge, though, that he was an unsuccessful suitor for your mother. The affair must have cut deep, for he never married.\" \"Eighty million!\" murmured Jack, unable to grasp the idea of such a sum. \"Nearly five million a year; four hundred thousand a month; say thirteen thousand a day.\" The figures had a convincing ring. The color stole back into Jack\u0027s cheeks, and a delicious warmth crept around his heart. He had no great difficulty in believing his good fortune, because he had already pictured it to himself in fancy. His first thought was of Kate. \"I can buy her anything now!\" For a moment or two he found nothing to say. Delamare seeing his eyes become dreamy, smiled again. \"Spending it already, I see!\" Jack blushed and descended to earth. \"Please tell me all about it,\" he said. \"I\u0027ll tell you what I know. As I said, I was not in Mr. Gyde\u0027s full confidence—no man was. Indeed I knew him but slightly. He was a good customer of the bank, but he did everything in his own peculiar way. He rented a large vault from us, and had the locks changed under his own supervision. I believe he kept the major part of his securities there, but he may have other vaults too. \"Some five years or so ago, he came to me saying he wanted to rent a small lock box in our vaults, the kind that we get ten dollars a year for. He was so insistent upon the necessity for secrecy that we allowed him to have it under an assumed name. Another officer of the bank and myself were taken into the secret. Mr. Gyde left me a duplicate key to this box with instructions to open it if ever a day passed without my hearing from him. I believe he used to visit the box himself to make sure that I had not been tampering with it, but his peculiarities were so well known, one didn\u0027t mind that in him. \"Since then, every day of his life he dropped in here, or called me or my secretary on the phone, just to report, he said. In the beginning I often wondered why he had set himself such a task, but as time went on it became a mere form, and at last I forgot how the custom had started. \"When word of his death was brought me day before yesterday, all recollection of the small box had passed from my mind. My secretary brought it back by remarking that the old gentleman\u0027s daily report was now at an end. I found the keys and opened the box. The papers were sealed into the box itself, so that they could not be removed without breaking the wax. Very characteristic of Mr. Gyde. \"The contents consisted of his will; detailed instructions to me how to find you and identify you, and several keys which I was directed to hand you. Here they are. And here is the will, a model of clearness and brevity you see.\" Jack read: \"I, Silas Gyde, being of sound mind and in the full possession of my senses, do hereby devise and bequeath all that I die possessed of to John Farrow Norman, son of John Goadby Norman and Phoebe Farrow, and do appoint the said John Farrow Norman and Walter Delamare, President of the National New York Bank, my executors.\" \"My instructions state,\" Mr. Delamare resumed, \"that the witnesses to the will were two clerks employed by Mr. Gyde at that time. You see he forgot nothing. \"As to those keys, they are for the various doors in Mr. Gyde\u0027s apartment at the Hotel Madagascar. I am told here not to deliver them into any hands but yours, and you are instructed to visit the apartment at once, and alone. Always mysterious, you see. By the way, Mr. Gyde was the sole owner of the Madagascar, and it is therefor now yours.\" \"I suppose there will be lawyers to see, and so on,\" said Jack. \"Mr. Gyde had no personal attorneys. He was always suing and being sued, but he retained a new man for every case. Obviously he has made these arrangements on his own initiative. I expect it will be up to you and me to ferret out his properties. I will have my attorney probate the will. You had better have a lawyer to advise you. Have you any one in mind?\" Jack shook his head. \"Very well, I will give you a note to a friend of mine for whose integrity and ability I will vouch. His name is Hugh Brome. He is young like yourself, and this matter will mean a big thing for him—that is if you have no objection to his youth?\" \"No indeed!\" said Jack. Mr. Delamare wrote a note and handed it over. \"Go and look him over before you commit yourself. If you approve of him the three of us can have a talk here later.\" Jack rose. \"Haven\u0027t you forgotten something?\" asked Mr. Delamare smiling. \"What?\" said Jack blankly. \"Well—some money?\" Jack blushed. \"I didn\u0027t think I could get any yet.\" \"Certainly! As much as you want. Mr. Gyde left a large balance here. Of course I can\u0027t hand that over to you yet, but the bank is prepared to advance you whatever you require. The bank hopes that you will continue to favor it with your patronage.\" More than anything Mr. Delamare had said, this last little sentence made Jack feel like a millionaire. \"Here\u0027s a pocket check book. Make out your check and I\u0027ll send it to the teller with my O.K. You don\u0027t want to go out there yourself for the reporters are lying in wait for you. That\u0027s why I told you to send in an assumed name. They pester the life out of me. As soon as you\u0027re safely out of the way I\u0027ll give out the story and be rid of them.\" Jack took the offered pen and wrote his check, the banker watching him with a smile. At the line for the amount Jack stuck; he thought of a hundred dollars, five hundred, a thousand; higher than a thousand he dared not go. \"Is that too much?\" he asked, gasping a little. \"Not at all!\" said Mr. Delamare, laughing. \"Merely your income for about half an hour!\"","sourceLink":"http://novel.tingroom.com/jingdian/2170/61337.html","bookId":443,"book":{"id":443,"title":"The Substitute Millionaire","description":"简介： On a certain morning, just as on six mornings in the week (barring holidays) and fifty weeks in the year, Jack Norman wormed his way into a crowded subway local at Fiftieth street, and, propping himself against the end of a cross seat, opened his pap...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2170","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
