{"id":80748,"no":19,"title":"Page 19","content":"I believe him, and I don’t know why. I’ve only known him for such a short time, but I can tell by the look in his eyes he means it. And it’s quite clear Paine gets what he wants.\\n\\n “Trust me, Duchess.”\\n\\n “I do.” He pulls me to his chest and holds me tight, that feeling of being home warming me again.\\n\\n A knock at the door pulls us from our embrace.\\n\\n “Who the fuck…” Paine glances over his shoulder to look at the clock on the stove. “It’s almost midnight.”\\n\\n “Booty call?” I half-tease. Who else would show up at his house so late?\\n\\n Paine gives me a stern look. “I told you I never invited a woman back here. Don’t push your luck or I’ll spank your ass.”\\n\\n I wiggle at his words, thinking about him spanking me as he takes me from behind. The image makes everything in my core clench.\\n\\n “My dirty Duchess. You like getting your ass spanked? I’ll have to remember that.”\\n\\n I go to lie and tell him I don’t, but another knock sounds on the door.\\n\\n “I’m fucking coming,” he shouts. “Don’t move.” He shoots me a look, and I stay rooted.\\n\\n I watch as he makes his way to the door, wearing just his underwear. It better not be a woman out there, because I don’t want someone else seeing his boxer briefs hugging his thighs tightly. It’s then I notice all of his tattoos across his arms and chest are on display. I didn’t realize he had so many. He was wearing long sleeves when I first met him, and only a few of the tattoos peeked out at his wrist. I don’t know what it is about his hard side that draws me to him. I’ve never met someone like him before, and men like him don’t run in the same circles as I have all my life. Maybe that’s why I never knew what attraction was until I met him.\\n\\n When the door opens, I hear Paine sounding pissed at whoever it is. “This is private fucking property.” I can’t see around him, his big body filling the door and blocking the view, but I know who it is when a familiar voice speaks.\\n\\n “Where’s my daughter?”\\n\\n “Where she’s supposed to be,” Paine fire backs. I get down off the counter and try to get past him to face my father, not wanting them to go to blows.\\n\\n “I know for a fact she isn’t with her fiancé,” my father says, but it’s clear Scott told him who I was with. There’s no other way my father could possibly know I was here with Paine.\\n\\n “Then you thought wrong because you’re looking at her fucking fiancé.” There’s no missing the possessive tone in Paine’s voice.\\n\\n “Stop it. Both of you.” I finally make it past Paine, ducking under his arm in a quick move, but I don’t get far. He wraps an arm around my waist, pulling me back to his front.\\n\\n The cold night air hits my legs, reminding me I’m only wear Paine’s shirt. Lucky for me, he’s a freaking giant and the thing comes almost to my knees.\\n\\n My dad looks at me in disgust. Like he has room to talk. Not only is he married to a woman five years older than me, but everyone knows he sleeps around on her. I have a feeling she does, too, with the looks she shoots my brother at Thanksgiving dinner.\\n\\n “Put some clothes on. We’re leaving.”\\n\\n “She’s not going anywhere,” Paine answers for me. I don’t know why I’m so intimidated by my father, but I am, and I’m glad to have Paine standing behind me.\\n\\n “Your grandmother got hurt. We had to call the doctor to come out. She’s asking for you, Penny,” my father says, using the nickname for me I haven’t heard in years.\\n\\n “Let me get my things.” I try to break from Paine’s arms, wanting to get to her as soon as possible, but he’s holding tight.\\n\\n “Give us five and we’ll be ready,” Paine says, finally letting me go.\\n\\n “I won’t let him on the property.” My dad’s tone is final, and I know he won’t. He’ll call the police and have Paine thrown in jail.\\n\\n “I don’t go, she doesn’t go.”\\n\\n “I’ll tell your grandmother you couldn’t be bothered then.” My father turns to leave, and I feel so angry at how he always says ‘your’ grandmother, like she’s nothing to him. Like she’s not the mother of his late wife. Like she’s not his mother-in-law.\\n\\n “No, wait!” I yell at him, making him turn to look at me. He has a smirk on his face, which makes the wrinkles around his mouth more prominent. Time hasn’t been good to Dad these past five years. Most of his hair would be gray now if he didn’t dye it. He’s even put on some weight.\\n\\n “Duchess,” Paine says, holding on to my arm. His grip makes it clear he isn’t letting me go.\\n\\n “You asked me to trust you, Paine. Can you trust me? I have to go. I’ll come back.” I look up into his eyes, wanting him to see what I saw moments ago when we were in the kitchen together, talking about the life we wanted.\\n\\n “Don’t count on it,” I hear my father say from behind me, and I can see the tension rolling off Paine.\\n\\n “She’ll be out in a minute.” Paine pulls me into the house, slamming the door behind us. “I don’t like this. I think he’s playing at something.”\\n\\n “Let me check.” Breaking away, I head back to his bedroom where I find my purse, and I pull my phone out to call Law. Paine watches my every move like a hawk while I call my brother. He picks up on the second ring and I get straight to the point. \\n\\n","sourceLink":"https://allnovel.net/mechanic-breeding-2/page-19.html","bookId":1799,"book":{"id":1799,"title":"Mechanic (Breeding #2)","description":"Storyline: Everything was fine until that innocent little rich girl walked into my garage. Since the second I laid my eyes on her, all I\u0027ve wanted to do is get my dirty hands on her pure body. \\n There\u0027s one minor obstacle standing in my way, but I\u0027ve got a plan. All I\u0027ve got to do is claim her, and she’ll be mine forever. \\n Warning: This book is over-the-top, insta-love. There\u0027s nothing but steamy scenes, babies trying to be made, and an obsessed bearded alpha hero claiming a virgin who will be his forever. If you want it hot and dirty, this is it! \\n *whispers* There\u0027s a sweet smutty surprise at the end!\\n","cover":"https://allnovel.net/images/mechanic-breeding-2.jpg","author":"Alexa Riley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/mechanic-breeding-2.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:28:26 PM"}}
