{"id":80758,"no":29,"title":"Page 29","content":"I stopped wearing underwear years ago, getting tired of having them in the way. He always wants me, any time of the day, and I just gave up trying to block him. Instead, I’m almost always in dresses, with no panties, and it’s made for a very happy marriage.\\n\\n It’s not always easy with three kids running around, but when love is important, you make the time. Thankfully, the kids had a slumber party at their cousin’s house last night, so we’re all alone. Law and Joey took them for the night, knowing how much their kids love having them over.\\n\\n Paine licks the inside of my thigh, teasing me before going back to my core. I moan loudly and push back, wanting more. “Stop playing, Paine. Don’t tease me. I’ve got too many hormones right now.”\\n\\n I feel him laugh against me, then his mouth goes to my clit. He eats me out from behind, and I give myself over to him. After just a few knowing strokes of his clever tongue, I’m cumming against his face, the release fast and hot. He knew what I needed, even if I didn’t know to ask for it. That’s what years of being together has done to us.\\n\\n I rest my forehead against my arm on the counter as I feel Paine kiss my legs, loving every inch of me. He runs his hands up my hips, petting me as he flips my dress back down.\\n\\n “Damn, I needed that,” I say as Paine stands up and rubs my back. He always knows exactly how to handle me in the sweetest way. I stay in that position, leaned over with him rubbing me, and I feel all the anxiety of today melt away.\\n\\n I’m lucky I found such an amazing man who loves me unconditionally. He loves me when I’m moody and when I’m being a brat. And best of all, he knows just what to say to pull me out of it. I smile, thinking that he’s pretty damn lucky he’s got me, too.\\n\\n “I’ve got everything taken care of, Duchess. You go sit your pretty ass in the truck and wait for me.”\\n\\n I look over my shoulder and smile at him. I stand up, turning around to give him a kiss. I taste myself on him, and it has me excited, wanting more. Reaching down, I rub his hard cock, but he takes my hand and entwines our fingers together.\\n\\n “That was just for you. We’ll have fun tonight after the kids are in bed.”\\n\\n “Deal,” I say, and turn to walk out of the kitchen. He smacks my ass on my way out, and I turn around, laughing and rubbing the spot he smacked. I grab my bag, going out to the truck and doing what he says.\\n\\n Our lives are loud, and messy, and a little crazy at times. But they’re overflowing with love, and that’s all that matters. When he climbs into the truck and smiles at me, I know I’ve won the husband lottery.\\n\\n BONUS STORY!\\n\\n Joey \u0026 Law\\n\\n Joey\\n\\n Click, click, click, click.\\n\\n “Stop that or you’re going to flood the engine.” I stare over at the Sheriff through his windshield as he tries to start his cruiser. I swear, everywhere I go in this town, there he is. Today it was the diner. I ate lunch there before I needed to get back to the shop, and there he popped up. Like always, he just stared at me, and it confused the ever-loving shit out of me. He’s never spoken to me before, even with all the staring, but then again, I give him a wide berth when I see him. He makes me feel things, things I’ve never felt before, and it would just be better for everyone if those feelings stayed buried.\\n\\n “Just can’t seem to get the damn thing to start.” His deep voice rolls over my skin, making goose bumps break out, even though it’s a good ninety degrees right now.\\n\\n “Hmm. Pop the hood.” I stumble over my words, and he shoots me a smirk. Prick. Probably used to women falling all over him. Not that I can blame them. I’d probably fall all over him, too, if I thought I was his type. Which I’m definitely not.\\n\\n He’s clean-cut in a hard, pretty-boy kind of way. Blond hair, blue eyes, and a thousand-watt smile that comes out easy. He couldn’t be more of a good ol’ boy if he tried. Unfolding himself from his cruiser, he reaches down and pops the hood. I don’t wait for an invitation as I step off the sidewalk and lift the hood.\\n\\n It’s an easy fix if it’s what I think it is. Retrieving my wrench out of my back pocket, I grab the battery cable, giving it a wiggle. It’s loose, just like I thought, so I screw it back on to the battery terminal tightly.\\n\\n “Give that a try.” I straighten and turn around, knocking straight into a wall of chest. The badge clipped to his chest shines bright in my face. “Whoa there, Sheriff. I don’t need you up my ass.”\\n\\n I snap the words, trying to take a step back as his masculine smell invades my senses. God, he smells good. I didn’t know a man could smell that good. Probably because he doesn’t work in an auto shop full of sweaty men all day. Jesus, his smell has me feeling those goose bumps again.\\n\\n “I don’t bite, Josephine.”\\n\\n The use of my name has me glaring at him. No one calls me ‘Josephine.’ Only my mother ever did, and that name died when she did. It’s too intimate for him to be using that name, and I hate how I felt when he said it. It made me feel all feminine and shit. Nope. Not touching that.\\n\\n “Name’s Joey,” I correct him, trying to put a firmness behind my tone. I want him to know I’m not fucking around. But he just shoots me that stupid perfect smile, making my heart flutter. I should take a step back, but I don’t want to seem like I’m intimidated by him. That, and I’m still rather enjoying the smell of him. I grew up with three older brothers who are all in the Air Force now. Surely I can handle one sexy, muscle-bound sheriff. I think. \\n\\n","sourceLink":"https://allnovel.net/mechanic-breeding-2/page-29.html","bookId":1799,"book":{"id":1799,"title":"Mechanic (Breeding #2)","description":"Storyline: Everything was fine until that innocent little rich girl walked into my garage. Since the second I laid my eyes on her, all I\u0027ve wanted to do is get my dirty hands on her pure body. \\n There\u0027s one minor obstacle standing in my way, but I\u0027ve got a plan. All I\u0027ve got to do is claim her, and she’ll be mine forever. \\n Warning: This book is over-the-top, insta-love. There\u0027s nothing but steamy scenes, babies trying to be made, and an obsessed bearded alpha hero claiming a virgin who will be his forever. If you want it hot and dirty, this is it! \\n *whispers* There\u0027s a sweet smutty surprise at the end!\\n","cover":"https://allnovel.net/images/mechanic-breeding-2.jpg","author":"Alexa Riley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/mechanic-breeding-2.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:28:26 PM"}}
