{"id":80766,"no":37,"title":"Page 37","content":"“Who’s asking?” I motion for Jake to pour me another shot. “The Sheriff or Law?”\\n\\n “I’m asking, sweets.”\\n\\n “Then the answer is no. Besides, you don’t like being seen with me in public.” I shrug my shoulders, trying to pretend I don’t give a shit and failing. I can feel the tension in my whole body; I’m practically vibrating.\\n\\n “That’s not fucking true and you know it,” Law snarls, and I can feel him getting closer to me, something I don’t want. He can’t touch me. I won’t be able to hold back the tears if he does, and I won’t give him my tears. I slam back my shot, jumping off the barstool, and I wobble a little. Both Law and Paine jump to steady me.\\n\\n “Don’t fucking touch her,” Law growls at Paine, pulling me towards his body in a possessive hold. I feel the dam inside me start to shake, and it takes everything in me to get my words out without it cracking.\\n\\n “You made your choice. Now live with it.” I try to push past him, but he grabs me by the arm and I turn, shooting all my anger at him. I’ve got to hold on to that anger until I get out of this bar.\\n\\n “You’re too drunk to drive.”\\n\\n I don’t even respond to his words. I just call out Butch’s name. “Butch has me,” I say, hoping that fucking digs into his gut. Law may not want everyone to know we’re together, but I know he doesn’t want to share me. Double standard much?\\n\\n Law clenches his jaw again, but what can he really say? Everyone in the bar is staring at us.\\n\\n “Pick up your phone,” he grits out at me, but I’m having no part of it.\\n\\n “Fuck off.”\\n\\n With that, I grab onto Butch’s arm, and he pulls me closer, probably because he sees the distress on my face.\\n\\n “Get me home, please,” I whisper to him as the tears start to fall.\\n\\n Law\\n\\n “You’re in over your head.” Paine says the words, but I don’t look at him. I keep staring out the door Josephine just walked through, taking a part of me with her. When she hadn’t returned my text messages I got a little worried, but when she sent that last text, it felt like the bottom of my world dropped out from under me.\\n\\n I grit my teeth and clench my fists, trying to get my anger under control. I only have myself to be pissed at. I played this all wrong. The last year of my life has been miserable and fucking lonely, and the last two weeks were the best I’ve never known. I’m not letting it slip through my fingers so easily. One way or another, she’s going to listen to me. “As long as I’m somewhere with her, I’ll take it.” It’s the truth. I’ll take my girl any way I can get her. I may be in over my head with her, but that’s fine with me. I’ll drown in her, and it will be the sweetest death a man could ever ask for.\\n\\n I walk out of the bar and make it in time to see her get into Butch’s car. I know they’re just friends, but fuck does it burn to see him taking care of her. She was hurting when I walked into the bar, and it isn’t Butch she should have been calling out for. No, it should’ve been me. But I fucked up. I want to be the man she runs to when she needs someone to lean on. I’d almost gotten all her trust, only to see it go up in smoke.\\n\\n “Fuck!” I scream out to the empty parking lot before heading to my cruiser. I don’t give it a thought. I flip on the blue lights and the siren, chasing after them.\\n\\n Butch pulls to the side of the road and I follow suit, turning off the siren but leaving the lights on. Butch goes to open his door, probably to argue with me, but I give him the same voice I used on thugs on the streets of Chicago when I worked patrol.\\n\\n “Hands on the wheel and don’t so much as fucking move a finger.” It’s a dick move, using my power for my own ends, but I can’t bring myself to care. There isn’t anything I won’t do to have my sweet Josephine, even pissing a year-old case down the drain. I’ll find another way.\\n\\n I go over to the passenger side, pulling the door open. Reaching in, I pop her seatbelt and pull her out of the car and sling her over my shoulder. She gives me a little bit of a fight, but she’s just so tiny it’s easy to get her under control.\\n\\n Butch hops out of the car and I stop looking at him. I can tell from the indecisive look on his face that he’s debating what he wants to do. He may want to come at me, but I’m still the Sheriff.\\n\\n “You made her cry. I’ve never seen her cry before, Law.”\\n\\n His words are like stones dropping into water. The first impact is brutal, the aftermath rips through my body, reaching to my soul. I did the very thing I was trying to prevent, and now I’m going to lay my cards on the table.\\n\\n “I’m going to fix it,” I tell him, letting all my emotion out in my words. I won’t get any points with Josephine if I knock her best friend out on the side of the highway because she’s not going with him. Over my fucking dead body.\\n\\n “I’m not fucking with you, Law. Fix it or Paine and I will be so far up your ass…”\\n\\n “Butch! What the fuck? You’re just going to let this lying cheating bastard take me?” She starts kicking her feet again, and I slap her ass. I’m trying to get her under control before she tries to buck off my shoulder and I land her ass on the hard blacktop.\\n\\n “Call me in the morning, Joey.” Butch gets back in his car and takes off, but Josephine still yells until she realizes he’s gone.\\n\\n I go to the passenger side of the cruiser and place her on her feet, caging her in. She bucks against me, trying to free herself. She’s hitting at my chest while tears stream down her face. Each verbal blow she lands is a direct hit to my heart. \\n\\n","sourceLink":"https://allnovel.net/mechanic-breeding-2/page-37.html","bookId":1799,"book":{"id":1799,"title":"Mechanic (Breeding #2)","description":"Storyline: Everything was fine until that innocent little rich girl walked into my garage. Since the second I laid my eyes on her, all I\u0027ve wanted to do is get my dirty hands on her pure body. \\n There\u0027s one minor obstacle standing in my way, but I\u0027ve got a plan. All I\u0027ve got to do is claim her, and she’ll be mine forever. \\n Warning: This book is over-the-top, insta-love. There\u0027s nothing but steamy scenes, babies trying to be made, and an obsessed bearded alpha hero claiming a virgin who will be his forever. If you want it hot and dirty, this is it! \\n *whispers* There\u0027s a sweet smutty surprise at the end!\\n","cover":"https://allnovel.net/images/mechanic-breeding-2.jpg","author":"Alexa Riley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/mechanic-breeding-2.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:28:26 PM"}}
