{"id":68237,"no":20,"title":"Page 20","content":"Harald drove along the Copenhagen quayside at sundown. The dirty water of the harbor was an oily gray in daytime, but now it glowed with the reflection of the sunset, a red and yellow sky broken up, by the wavelets, into dabs of color like strokes of a paintbrush.\\n\\n He stopped the motorcycle near a line of Daimler-Benz trucks partly loaded with timber from a Norwegian freighter. Then he saw two German soldiers guarding the cargo. The roll of film in his pocket suddenly felt burning hot against his leg. He put his hand in his pocket and told himself not to be panicky. No one suspected him of any wrongdoing - and the bike would be safe near the soldiers. He parked next to the trucks.\\n\\n The last time he was here he had been drunk, and now he struggled to remember exactly where the jazz club was. He walked along the row of warehouses and taverns. The grimy buildings were transformed, like the dirty water of the harbor, by the romantic glow of the setting sun. Eventually he spotted the sign that read, \"DANISH INSTITUTE OF FOLK SONG AND COUNTRY DANCING.\" He went down the steps to the cellar and pushed the door. It was open.\\n\\n The time was ten o\u0027clock, early for nightclubs, and the place was half-empty. No one was playing the beer-stained piano on the little stage. Harald crossed the room to the bar, scanning the faces. To his disappointment, he did not recognize anyone.\\n\\n The barman wore a rag tied around his head like a gypsy. He nodded warily to Harald, who did not look like the usual type of customer.\\n\\n \"Have you seen Betsy today?\" Harald asked.\\n\\n The barman relaxed, apparently reassured that Harald was just another young man looking for a prostitute. \"She\u0027s around,\" he said.\\n\\n Harald sat on a stool. \"I\u0027ll wait.\"\\n\\n \"Trude\u0027s over there,\" the barman said helpfully.\\n\\n Harald glanced in the direction he pointed and saw a blond woman drinking from a lipstick-stained glass. He shook his head. \"I want Betsy.\"\\n\\n \"These things are very personal,\" said the barman sagely.\\n\\n Harald suppressed a smile at the obviousness of this remark. What could be more personal than sexual intercourse? \"That\u0027s very true,\" he said. Were tavern conversations always stupid?\\n\\n \"A drink while you\u0027re waiting for her?\"\\n\\n \"Beer, please.\"\\n\\n \"Chaser?\"\\n\\n \"No, thanks.\" The thought of aquavit still made Harald feel nauseated.\\n\\n He sipped his beer thoughtfully. He had spent the day brooding over his plight. The presence of police at Arne\u0027s hideout almost certainly meant that Arne had been found out. If by some miracle he had evaded arrest, the only place he might be hiding was the ruined monastery at Kirstenslot; so Harald had driven there and checked. He found the place empty.\\n\\n He had sat on the floor of the church for several hours, alternately grieving at his brother\u0027s fate and trying to figure out what he should do next.\\n\\n If he were to finish the job Arne had started, he had to get the film to London in the next eleven days. Arne must have had a plan for this, but Harald did not know what it was, and could not think of any way to find out. So he had to devise his own.\\n\\n He considered simply putting the negatives in an envelope and mailing them to the British Legation in Stockholm. However, he felt sure all mail for that address was routinely opened by the censors.\\n\\n He did not have the luck to be acquainted with any of the small group of people who traveled legitimately between Denmark and Sweden. He could simply go to the ferry dock in Copenhagen, or the boat train station at Elsinore, and ask a passenger to take the envelope; but that seemed almost as risky as mailing it.\\n\\n He had concluded, after a day of racking his brains, that he had to go himself.\\n\\n He could not do so openly. He would not be given a permit to travel, now that his brother was known to be a spy. He would have to find a clandestine route. Danish ships went to and from Sweden every day. There had to be a way to get on board one and slip off unnoticed on the other side. He could not get a job on a boat - sailors had special identity papers. But there was always underworld activity around docks: smuggling, theft, prostitution, drugs. So he needed to make contact with criminals and find someone willing to smuggle him to Sweden.\\n\\n When the afternoon began to cool, and the tiled floor of the monastery became chilly, he had got back on his motorcycle and returned to the jazz club, in the hope of seeing the only criminal he had ever met.\\n\\n He did not have to wait long for Betsy. He had drunk only half his beer when she arrived. She came down the rear staircase with a man whom, Harald presumed, she had just serviced in a bedroom upstairs. The client had pale, unhealthy skin and a brutally short haircut, and there was a cold sore on his left nostril. He was about seventeen. Harald guessed he was a sailor. He walked quickly across the room and out of the door, looking furtive.\\n\\n Betsy came to the bar, saw Harald, and did a double take. \"Hello, schoolboy,\" she said amiably.\\n\\n \"Hello, princess.\"\\n\\n She tossed her head coquettishly, shaking her dark curls. \"Changed your mind? Want to have a go?\"\\n\\n The thought of having sex with her only minutes after the sailor was vile, but he answered with a joke. \"Not before we\u0027re married.\"\\n\\n She laughed. \"What would your mother say?\"\\n\\n He looked at her plump figure. \"That you need feeding up.\"\\n\\n She smiled. \"Flatterer. You\u0027re after something, aren\u0027t you? You didn\u0027t come back for the watery beer.\"\\n\\n \"As a matter of fact, I need a word with your Luther.\"\\n\\n \"Lou?\" She looked disapproving. \"What do you want with him?\"\\n\\n \"A little problem he may be able to help me with.\"\\n\\n \"What?\"\\n\\n \"I probably shouldn\u0027t tell you - \"\\n\\n \"Don\u0027t be stupid. Are you in trouble?\"\\n\\n \"Not exactly.\"\\n\\n She looked across at the door and said, \"Oh, shit.\"\\n\\n Following her gaze, Harald saw Luther come in. Tonight he was wearing a silk sports coat, very dirty, over an undershirt. With him was a man of about thirty who was so drunk he could hardly stand. Holding the man\u0027s arm, Luther steered him to Betsy. The man stood peering lustfully at her.\\n\\n Betsy said to Luther, \"How much did you take off him?\"\\n\\n \"Ten.\"\\n\\n \"Lying turd.\"\\n\\n Luther handed her a five-crown note. \"Here\u0027s your half.\"\\n\\n She shrugged, pocketed the money, and took the man upstairs.\\n\\n Harald said, \"Would you like a drink, Lou?\"\\n\\n \"Aquavit.\" His manners had not improved. \"What are you after, then?\"\\n\\n \"You\u0027re a man with many contacts along the waterfront.\"\\n\\n \"Don\u0027t bother to butter me up, son,\" Luther interrupted. \"What do you want? A little boy with a nice bum? Cheap cigarettes? Dope?\"\\n\\n The barman filled a small glass with aquavit. Luther emptied it at a gulp. Harald paid and waited until the barman moved away. Lowering his voice, he said, \"I want to go to Sweden.\"\\n\\n Luther narrowed his eyes. \"Why?\"\\n\\n \"Does it matter?\"\\n\\n \"It might.\"\\n\\n \"I\u0027ve got a girlfriend in Stockholm. We want to get married.\" Harald began to improvise. \"I can get a job in her father\u0027s factory. He makes leather goods, wallets and handbags and - \"\\n\\n \"So apply to the authorities for a permit to go abroad.\"\\n\\n \"I did. They turned me down.\"\\n\\n \"Why?\"\\n\\n \"They wouldn\u0027t say.\"\\n\\n Luther looked thoughtful. After a minute he said, \"Fair enough.\"\\n\\n \"Can you get me on a ship?\"\\n\\n \"Anything\u0027s possible. How much money have you got?\"\\n\\n Harald recalled Betsy\u0027s mistrust of Luther a minute ago. \"None,\" he said. \"But I can get some. So, can you arrange something for me?\"\\n\\n \"I know a man I can ask.\"\\n\\n \"Great! Tonight?\"\\n\\n \"Give me ten crowns.\"\\n\\n \"What for?\"\\n\\n \"For going to see this man. You think I\u0027m a free public service, like the library?\"\\n\\n \"I told you, I haven\u0027t got any money.\"\\n\\n Luther grinned, showing his rotten teeth. \"You paid for that drink with a twenty, and got a ten in your change. Give it to me.\"\\n\\n Harald hated to yield to a bully, but he seemed to have no choice. He handed over the note.\\n\\n \"Wait here,\" said Luther, and he went out.\\n\\n Harald waited, sipping his beer slowly to make it last. He wondered where Arne was now. Probably in a cell in the Politigaarden, being interrogated. Perhaps Peter Flemming would do the questioning - espionage was his department. Would Arne talk? Not at first, Harald felt sure. Arne would not crumble immediately. But would he have the strength to hold out? Harald had always felt there was a part of Arne he did not fully know. What if he were tortured? How long would it be before he betrayed Harald?\\n\\n There was a commotion from the back staircase, and Betsy\u0027s latest client, the drunk, fell down the stairs. Betsy followed him, picked him up, and walked him through the door and up the outside steps.\\n\\n She returned with another client, this one a respectable middle-aged man in a gray suit that was old but neatly pressed. He looked as if he had worked all his life in a bank and never got promoted. As they crossed the room, Betsy said to Harald, \"Where\u0027s Lou?\"\\n\\n \"Gone to see a man for me.\"\\n\\n She stopped and came over to the bar, leaving the bank clerk looking embarrassed in the middle of the room. \"Don\u0027t get involved with Lou, he\u0027s a bastard.\"\\n\\n \"I\u0027ve got no choice.\"\\n\\n \"Then take a tip.\" She lowered her voice. \"Don\u0027t trust him a single inch.\" She wagged her finger like a schoolteacher. \"Watch your back, for God\u0027s sake.\" Then she went upstairs with the man in the worn suit.\\n\\n At first Harald felt annoyed with her for being so sure he could not take care of himself. Then he told himself not to be stupid. She was right - he was out of his depth. He had never dealt with people like Luther, and he had no idea how to protect himself.\\n\\n Don\u0027t trust him, Betsy had said. Well, he had only given the man ten crowns. He could not see how Luther could cheat him at this stage, though later he might take a larger sum then fail to deliver.\\n\\n Watch your back. Be prepared for treachery. Harald could not think how Luther could betray him, but were there any precautions he could take? It occurred to him that he was trapped in this bar, with no back door. Maybe he should leave and watch the entrance from a distance. There might be some safety in unpredictable behavior.\\n\\n He swallowed the last of his beer and went out with a wave to the barman.\\n\\n He walked along the quay, in the twilight, to where a big grain ship was tied up with hawsers as thick as his arm. He sat on the domed top of a steel capstan and turned to face the club. He could see the entrance clearly, and he thought he would probably recognize Luther. Would Luther spot him here? He thought not, for he would be hard to see against the dark bulk of the ship. That was good. It put Harald in control. When Luther returned, if all seemed well, Harald would go back into the bar. If he smelled a rat he would vanish. He settled down to wait.\\n\\n After ten minutes, a police car appeared.\\n\\n It came along the quayside very fast, but with no siren. Harald stood up. His instinct was to run, but he realized that would call attention to him, and he forced himself to sit down again and keep very still.\\n\\n The car pulled up sharply outside the jazz club.\\n\\n Two men got out. One, the driver, wore a police uniform. The other was in a light-colored suit. Peering at him in the dim light, Harald recognized the face, and gasped. It was Peter Flemming.\\n\\n The two cops went into the club.\\n\\n Harald was about to hurry away when another figure appeared, slouching along the cobblestones with a familiar gait. It was Luther. He stopped a few yards from the police car and leaned against the wall, like an idle bystander waiting to see what would happen.\\n\\n Presumably he had told the police of Harald\u0027s planned flight to Sweden. No doubt he hoped to be paid for the tip-off. How wise Betsy had been - and what a good thing Harald had acted on her advice.\\n\\n The police came out of the club after a few minutes. Peter Flemming talked to Luther. Harald could hear the voices, for they both spoke angrily, but he was too far away to make out the words. However, it seemed that Peter was reprimanding Luther, who kept throwing his hands in the air in a gesture of helpless frustration.\\n\\n After a while the two policemen drove away, and Luther went inside.\\n\\n Harald walked quickly away, shaken by his narrow escape. He found his motorcycle and drove off in the last of the twilight. He would spend the night in the ruined monastery at Kirstenslot.\\n\\n Then what would he do?\\n\\n Harald told Karen the whole story the following evening.\\n\\n They sat on the floor in the disused church, while evening darkened outside and the draped shapes and boxes around them turned to ghosts in the twilight. She sat with her legs crossed, like a schoolgirl, and hiked the skirt of her silk evening gown above her knees, for comfort. Harald lit her cigarettes, and felt he was becoming intimate with her.\\n\\n He told her about getting into the base on Sande, then pretending to be asleep while the soldier searched his parents\u0027 house. \"You\u0027ve got such nerve!\" she exclaimed. He was pleased by her admiration, and glad she could not see the dampness in his eyes as he told how his father had told a lie to save him.\\n\\n He explained Heis\u0027s deduction that there would be a major air raid at the next full moon, and his reasons for thinking the film had to get to London before then.\\n\\n When he related how a police sergeant had answered the door of Jens Toksvig\u0027s house, she interrupted him. \"I got a warning,\" she said.\\n\\n \"What do you mean?\"\\n\\n \"A stranger came up to me at the railway station and told me the police knew where Arne was. This man was a cop himself, in the traffic department, but he happened to have overheard something, and he wanted to let us know because he was sympathetic.\"\\n\\n \"Didn\u0027t you warn Arne?\"\\n\\n \"Yes, I did! I knew he was with Jens, so I looked Jens up in the phone book then went to his house. I saw Arne and told him what had happened.\"\\n\\n It sounded a bit odd to Harald. \"What did Arne say?\"\\n\\n \"He told me to leave first, and said he was going to get out immediately after me - but obviously he left it too late.\"\\n\\n \"Or your warning was a ruse,\" Harald mused.\\n\\n \"What do you mean?\" she said sharply.\\n\\n \"Maybe your policeman was lying. Suppose he wasn\u0027t sympathetic at all. He might have followed you to Jens\u0027s place and arrested Arne the minute you left.\"\\n\\n \"That\u0027s ridiculous - policemen don\u0027t do things like that!\"\\n\\n Harald realized that once again he had run up against Karen\u0027s faith in the integrity and goodwill of those around her. Either she was credulous or he was unduly cynical - he was not sure which. It reminded him of her father\u0027s belief that the Nazis would not harm Danish Jews. He wished he thought they were right. \"What did the man look like?\"\\n\\n \"Tall, handsome, heavy, red hair, nice suit.\"\\n\\n \"A kind of oatmeal tweed?\"\\n\\n \"Yes.\"\\n\\n That settled it. \"He\u0027s Peter Flemming.\" Harald did not feel bitter toward Karen: she had thought she was saving Arne. She was the victim of a clever ruse. \"Peter is more of a spy than a policeman. I know his family, back on Sande.\"\\n\\n \"I don\u0027t believe you!\" she said hotly. \"You\u0027ve got too much imagination.\"\\n\\n He did not want to argue with her. It pierced his heart to know that his brother was in custody. Arne should never have got involved in deception. There was no slyness in his nature. Harald wondered grievingly if he would ever see his brother again.\\n\\n But there were more lives at stake. \"Arne won\u0027t be able to get this film to England.\"\\n\\n \"What are you going to do with it?\"\\n\\n \"I don\u0027t know. I\u0027d like to take it myself, but I can\u0027t figure out how.\" He told her about the jazz club and Betsy and Luther. \"And perhaps it\u0027s just as well that I can\u0027t get to Sweden. I\u0027d probably be jailed for not having the right papers.\" It was part of the Swedish government\u0027s neutrality agreement with Hitler\u0027s Germany that Danes who traveled illegally to Sweden would be arrested. \"I don\u0027t mind taking a risk, but I need a better-than-even chance of success.\"\\n\\n \"There must be a way - how was Arne going to do it?\"\\n\\n \"I don\u0027t know, he didn\u0027t tell me.\"\\n\\n \"That was silly.\"\\n\\n \"In retrospect, perhaps, but he probably thought the fewer people who knew, the safer he would be.\"\\n\\n \"Someone must know.\"\\n\\n \"Well, Poul must have had a means of communication with the British - but it\u0027s in the nature of these things that they\u0027re kept secret.\"\\n\\n They were silent for a while. Harald felt depressed. Had he risked his life for nothing?\\n\\n \"Have you heard any news?\" he asked her. He missed his radio.\\n\\n \"Finland declared war on the Soviet Union. So did Hungary.\"\\n\\n \"Vultures scenting death,\" Harald said bitterly.\\n\\n \"It\u0027s so maddening to be sitting here helpless while the filthy Nazis are conquering the world. I just wish there was something we could do.\"\\n\\n Harald touched the film canister in his trousers pocket. \"This would make a difference, if I could get it to London in the next ten days. A big difference.\"\\n\\n Karen glanced at the Hornet Moth. \"It\u0027s a pity that thing won\u0027t fly.\"\\n\\n Harald looked at the damaged undercarriage and the torn fabric. \"I might be able to repair it. But I\u0027ve only had one lesson, I couldn\u0027t pilot it.\"\\n\\n Karen looked thoughtful. \"No,\" she said slowly. \"But I could.\" \\n\\n","sourceLink":"https://allnovel.net/hornet-flight/page-20.html","bookId":2680,"book":{"id":2680,"title":"Hornet Flight","description":"Storyline: Ken Follett follows his bestsellers Jackdaws and Code to Zero with an extraordinary novel of early days of World War II... \\n It is June 1941 and the war is not going well for England. Across the North Sea, eighteen-year-old Harald Olufsen takes a shortcut on the German-occupied Danish island of Sande an discovers an astonishing sight that will change the momentum of the war. He must get word to England-except that he has no way to get there. He has only an old derelict Hornet Moth biplane rusting away in a ruined church: a plane so decrepit that it is unlikely ever to get off the ground...even if Harald knew how to fly it.\\n","cover":"https://allnovel.net/images/hornet-flight.jpg","author":"Ken Follett","type":"Thriller","source":"allnovel","link":"https://allnovel.net/hornet-flight.html","creation":"Oct 5, 2019 8:59:04 AM","modification":"Oct 5, 2019 10:07:57 AM"}}
