{"id":42504,"no":16,"title":"CHAPTER XVI GUY FINISHES UP HIS BUSINESS IN LONDON","content":"When Vivian Bell found himself on a railroad train, in the company of his new friends, bound for London, he was like one from whom a heavy burden had been lifted. He became light-hearted and lively. “I am so happy,” he said, impulsively. “I am afraid you have never been very happy at the school,” returned Guy. “No, never! Dr. Musgrave has always been unkind to me,” said Vivian, with a shudder. “He would probably have punished you very severely if we had not made our appearance.” “He would have almost killed me. He was frightfully angry at my running away. How strong your friend is,” he added, looking at August Locke admiringly. August smiled. He was human, and he was pleased with the compliment. “I think I was too much for the doctor,” he said,{131} “but the time was when he had the advantage of me. I have been flogged more than once in my schooldays; but I fancy I deserved it more than you. You don’t look to me like a very bad boy.” “The doctor said I was, but indeed I tried to do my duty. Yet he was always flogging me.” “Rawdon was your friend, was he not?” “Yes; he was my only friend. He was always ready to stand up for me.” “The doctor never flogged him?” “No; I don’t see why, for he wasn’t a model boy, though he was a good friend to me.” “He seemed like a trump. I’m sorry I didn’t tip him. I say, Guy, I mean to send him a couple of guineas, just to show my appreciation of his pluck and friendship for your ward.” “No; it is I who ought to do that.” “We’ll do it together.” For a few days Guy kept Vivian with him at the hotel. He set himself to explore London, visiting all the noted places usually sought by strangers, and this the boy thoroughly enjoyed. Guy determined to give him some pleasure after his long thraldom at school. On the sixth day, in walking up the Strand, he and Vivian were surprised to meet Jim Rawdon. Rawdon saw them first.{132} “Hallo, you two! I was in hopes to meet you,” he said. “But how do you happen to be in London?” asked Guy. “You haven’t run away from school, have you?” “Not exactly; but it amounts to the same thing, except that my father is satisfied with my leaving.” “Tell me all about it.” “Well, it was this way. After you took Bell away the doctor was fearfully cross. He was ashamed to think we boys had seen his downfall, and as you were not there he vented his anger on us. There were never so many boys flogged in the same length of time before.” “Did you receive the money Mr. Locke and myself sent you?” “Yes, and it got me into trouble. You see, the doctor heard of it, and it set him to thinking. Finally he found out, by the help of that sneaking son of his, that I had encouraged Bell to run away. He was almost beside himself with anger, and made up his mind to do what he had never done before; that is, give me a flogging.” “I hope he didn’t do it,” said Guy, hastily. “Listen, and I will tell you all about it. He summoned me before the whole school, and made a short speech. ‘James Rawdon,’ he said, ‘I have{133} spared you heretofore on account of your excellent father, but I find that you aided and abetted your schoolmate Bell to run away in defiance of my rightful authority. Did you, or did you not?’ “‘I did,’ I answered. ‘The boy was so brutally treated that he had good reason to run away.’ “‘I never heard such insolence!’ roared the doctor, his eyes blazing. ‘Take off your jacket!’ “‘Thank you, sir,’ I replied, ‘I’d rather keep it on.’ “He lost all control of himself then, and sprang for me with the whip. My father had told me never to submit to a flogging, so I grabbed for the whip, and we had a struggle for it. “I managed to break his spectacles, and convinced him that I was pretty strong for a boy. But what frightened him most was this—I pulled out a toy pistol from my pocket, and the doctor became pale as a sheet. “‘Put that down, sir!’ he cried. ‘I will dispose of your case to-morrow!’ “That was all I wanted. That very evening I walked to the station and took the cars for London, buying my ticket with the money you sent me. When I told my father what led me to leave the school he told me I had done right, and he sent{134} the doctor a letter which he won’t be very glad to read.” “Dr. Musgrave seems to be a very unwise man,” said Guy. “All the boys are getting dissatisfied,” rejoined Rawdon. “I know four who have written to their fathers to take them away. Dr. Musgrave will soon find himself deserted.” On this point we will anticipate matters a little by saying that Rawdon’s statement proved prophetic. Dr. Musgrave’s temper was so aggravated by what had occurred that he increased his severity to such an extent as to induce a rebellion of the pupils. The directors were finally obliged to take cognizance of the complaints made by parents, and the result was that Dr. Musgrave was removed from the post of head master. He found it impossible to get another position, and was compelled to live, or attempt to live, on the income of a small sum which he had been able to accumulate in his twenty years’ service. His successor was a man of high scholarship and enlightened views, who had assisted Dr. Arnold at Rugby School. Under his charge the school regained its lost popularity. For his humiliation Dr. Musgrave{135} had only himself to thank, but it is doubtful if he fully realized it. A problem now presented itself to Guy, in reference to his ward. What should he do with him? As the boy’s education was incomplete, it seemed desirable that it should be continued. Moreover, in his future plans Guy felt that Vivian’s company would hamper him, besides increasing his responsibility. Jim Rawdon came to his rescue. One morning he called at the hotel where Guy was living, and said: “Why can’t you let Bell go to school with me?” “Where are you going?” asked Guy. “My father will send me to a clergyman who takes but six scholars, and who is highly recommended. He has two vacancies, so there is room for Bell and myself.” “Please give me the clergyman’s name, and I will look the matter up.” Rawdon did so. Guy heard, upon inquiry, such good accounts of the teacher recommended that he decided to send Vivian to him, especially as he found that his young ward was in favor of the plan. This relieved him, and left him ready to carry{136} out any instructions he might receive from his employer in Bombay. It was not long before these instructions came. Going one morning to the banking house, he found a letter from Mr. Saunders. A part of it ran thus: I presume you have visited Milton School, and inquired into the charges brought by my ward Vivian Bell against the head master. If the boy is really ill treated, have no hesitation in removing him. I am not willing that my old friend’s son should be cruelly used. Of my own knowledge I know nothing of Dr. Musgrave, but you will have no difficulty in forming a correct judgment as to his character and methods. I leave it to your discretion to select another school for Vivian, unless the boy’s health should require a journey, in which case you may take him with you to America. This leads me to say that certain matters which I will detail to you in a note of instruction, I wish to have you discuss with my New York agent, Gilbert Frazer, whose address you have. This will make it necessary for you to make a brief visit to New York. I now come to the matter of the pirates’ treasure,{137} which, according to the papers you showed me, is probably concealed on one of the Agalegas Islands. When you first mentioned the matter to me I thought little of it. So many stories are extant about buried treasure, that I was disposed to think this might be entitled to little consideration. But further reflections have led me to think that the treasure may really have an existence. I therefore authorize you to communicate with your old acquaintance, Captain Grover, of the Osprey, with a view to engaging his services on his next trip, in a search for the island. That nothing may interfere with this object, he may report to my agent, Mr. Frazer, who will provide him with a cargo consigned to me. The search for the island will occasion delay, but of this I shall not complain, though another party undoubtedly would. I send you a letter of credit addressed to Mr. Frazer, who will provide you with such funds as you need. Yours truly, John Saunders. A memorandum of instructions accompanied this letter. \n \n","sourceLink":"http://novel.tingroom.com/ertong/2979/82131.html","bookId":344,"book":{"id":344,"title":"In Search of Treasure","description":"简介： I wish I could send you to college, Guy, said Mr. Fenwick, as they sat in the library, reading by the soft light of a student lamp.The speaker was the Rev. Mr. Fenwick, the pastor of a church in Bayport, a few miles from New Bedford, Massachusetts....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2979","creation":"Aug 1, 2019 12:18:37 AM","modification":"Aug 1, 2019 12:18:37 AM"}}
