{"id":42525,"no":37,"title":"CHAPTER XXXVII DIVIDING THE TREASURE","content":"John Saunders sat in his office in Bombay. Before him lay a letter from his New York correspondent, Gilbert Frazer. It ran thus: I have had a call from a boy of sixteen, Guy Fenwick, who showed credentials from you, and appears to have been intrusted with an extraordinary commission. I complied with your instructions and supplied him with the money he called for, as per account inclosed. I hope I have done right. It seemed singular to me that you should have employed as your confidential agent a boy so young. I hope you will excuse the liberty I take in referring to this. There was more of the same tenor. Mr. Saunders read the note with a complacent smile. “I have no doubt Frazer was very much surprised,{290}” he said to himself. “Indeed, I should myself have been surprised had anyone told me a year since that I would have so far trusted so young an agent. But Guy Fenwick is an extraordinary boy, and I still feel that I have made no mistake. “To be sure,” he added, after a pause, “this expedition in search of the pirates’ treasure may be foolish, but even on that I reserve my decision. I shall be interested to hear how Guy makes out.” He was interrupted by the opening of the office door and the sudden entrance of the boy who had been occupying his thoughts. “Guy Fenwick!” he exclaimed, in a tone of evident pleasure. “Yes, Mr. Saunders,” said Guy, with a smile. “Didn’t you expect to see me again?” “Not so soon. What have you to report? Did you find the island?” “Yes, sir; and that was not all.” “You don’t mean to say that you have found the treasure?” “Yes, I do. It is at the door, in charge of three men, and with your permission I will have it brought in.” Without waiting for an answer Guy gave a signal, and three strong men carried in the sailor’s{291} chest which had been unearthed at the island. Guy dismissed the men, and then, unlocking the chest, threw it open, disclosing the treasure. The merchant was dazzled. “This is wonderful!” he ejaculated. “Now, Mr. Saunders,” said Guy, “I have fulfilled my part of the contract. I will leave the treasure with you.” “I will have it appraised and render an account to you, Guy. You will dine with me?” “Thank you, sir; but in the meantime, as I have been confined so long on shipboard, I will go out and take a walk.” It was three days before the examination and appraisal were completed. Then Mr. Saunders announced to his young agent that the value of the treasure was fifty thousand pounds, or two hundred and fifty thousand dollars. “Of this,” he said, “your share is one-half, or one hundred and twenty-five thousand dollars.” “But, sir, you advanced me a thousand pounds!” “I shall make no account of that. You deserve a full half as a reward for your energy and enterprise.” “And I am really worth over a hundred thousand dollars?” said Guy, hardly able to realize his good fortune.{292} “Yes; and if you choose to stay with me I will employ you at a liberal salary.” “Thank you, Mr. Saunders; but I would like a year’s vacation. I want to go home and gladden my father with the good news.” “Certainly. That is only reasonable.” The Osprey, on its return voyage, carried Guy and his two assistants as passengers. He divided ten thousand dollars between Abner Titcomb, Luke Clark, and Captain Forbush, feeling that he was under special obligations to all three, and that he would still be left as rich as he could reasonably desire.","sourceLink":"http://novel.tingroom.com/ertong/2979/82152.html","bookId":344,"book":{"id":344,"title":"In Search of Treasure","description":"简介： I wish I could send you to college, Guy, said Mr. Fenwick, as they sat in the library, reading by the soft light of a student lamp.The speaker was the Rev. Mr. Fenwick, the pastor of a church in Bayport, a few miles from New Bedford, Massachusetts....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2979","creation":"Aug 1, 2019 12:18:37 AM","modification":"Aug 1, 2019 12:18:37 AM"}}
