{"id":73353,"no":12,"title":"Page 12","content":"“Ethan Landry?” Gabby said, a surprised note in her voice. “Why not?” Laurel asked. She looked up and met Emma’s eyes, and Emma felt heat rise to her cheeks. She’d admitted that she liked Ethan when they’d bought Homecoming outfits together last week. And Laurel had seen them snuggling up at the tennis courts. This was an obvious screw-you, perhaps as revenge for Thayer showing up in Sutton’s bedroom. Charlotte twisted her mouth, looking unconvinced. “Ethan? Wouldn’t that be a repeat?” “Yeah, we said no repeats, Laur,” Madeline reminded her. Emma nearly choked on the dry turkey sandwich she’d pulled out of Sutton’s lunch bag. What did that mean? Had they pranked Ethan before? She thought about the Lying Game videos she’d seen on Laurel’s computer. Not a single one involved Ethan. When had this happened? Why hadn’t Ethan told her about it? “It’s technically a repeat, I guess,” Laurel acceded, tapping her lips thoughtfully. “But we never did get him back for ruining our prank on you, Sutton.” She was referring to the night Ethan stumbled upon Charlotte, Madeline, and Laurel blindfolding Sutton and staging a fake strangulation snuff film, the same film that landed on the Internet and led Emma to search for Sutton in the first place. Ethan had thought something terrible was happening to Sutton and intervened to stop it. But he’d told Emma that Sutton had laughed it off and pretended like it was nothing. “And we’ll make sure the prank itself is different.” Madeline popped a grape into her mouth. “You know, Ethan is a pretty good target. He’s so sensitive and emo. He’ll probably, like, cry or something.” “Boo hoo,” Lili lilted. She tapped something into Twitter, her fingers flying. “I think a planning session’s in order,” Madeline said. “My house, tomorrow?” Emma swallowed hard. It felt like everything was racing forward too fast, out of her control. “Shouldn’t we leave Ethan alone?” she blurted, her voice cracking. Everyone turned and stared at her. “Why, Sutton?” Laurel asked, clearly enjoying herself. “Is someone keeping a secret we don’t know about?” Emma gazed around the table at Sutton’s friends, feeling resentful that Laurel had forced her into this position. Laurel was the only person she’d confided in about Ethan— she wasn’t sure if the other girls would understand. Dating Ethan had to be an extremely un-Sutton thing to do, a strange choice after popular Garrett. And what would she tell them? She wasn’t exactly sure what was going on between her and Ethan. It wasn’t like they were boyfriend and girlfriend … yet. Emma snapped the top from her Diet Coke and felt a tiny spray of soda bubbles against her fingertips. “I’m not keeping secrets,” she said smoothly, summoning up her best snooty Sutton voice. “Especially not about Ethan.” It hurt her heart just to say the words. “Well, then, you’ll have no problem pranking Ethan with us,” Laurel said, clapping her hands together in a loud smack. She pointed across the courtyard at Ethan’s straight back. “I do believe, girls, that Mr. Emo Boy is next.” 11 PARTY OF FOUR That night, strains of Laurel’s latest hip-hop ball ad obsession filtered from her bedroom, down the hall, and into Emma’s ears. Emma pushed her index and middle fingers into her temples. What she wouldn’t give for an afternoon with Alex, her best friend from Henderson, listening to Vampire Weekend or any music that didn’t involve “Baby, baby, baby” in the lyrics. She wondered if her twin had shared Laurel’s awful taste in music. For the record, my music taste has always been impeccable. Maybe I couldn’t tick off all the amazing concerts I went to—I’m sure I’d gone to more than a few— but whenever Adele, Mumford \u0026 Sons, or Lykke Li came on the radio, I knew they had to be on my most-played iTunes list. The lyrics came back in haunting chunks, siren voices from my past. “I can’t come, Caleb,” Emma heard Laurel shout over the music. “I told you, we’re going to dinner tonight as a family.” Sighing, Emma rose and made her way to Sutton’s closet and sorted through a row of T-shirts stacked neater than the anally folded T-shirts at the Gap. Sutton had kept everything neatly ordered when it came to her clothes. Emma pulled a turquoise boat-neck tee from the pile, yanked it over her head, and selected a pair of dark denim leggings and metal ic flats to go with it. “Yeah, I know it sucks.” Laurel’s voice vibrated through the walls. “I so don’t want to go. The less time I spend with her, the better.” Emma guessed she was the her to whom Laurel was referring. When she and Laurel had gotten home from tennis practice, Mrs. Mercer had announced that the family was in serious need of bonding time—in other words, Emma and Laurel needed to bury the hatchet—so they were going out for a nice meal at Arturo’s, an expensive restaurant in one of the Tucson resorts. In her past life, Emma most likely would have worked at Arturo’s as a hostess instead of dining there with a family. Emma wished she could tell Mrs. Mercer not to bother with a special let’s-kiss-and-make-up dinner. After the whole let’s-prank-Ethan announcement, she wasn’t sure if she wanted to reconcile with Laurel, either. Another peal of laughter sounded from Laurel’s bedroom. Emma stared at her reflection in the mirror, running a round brush through her hair. Did Caleb know about Laurel’s crush on Thayer? What did he think of her camping out at the Free Thayer petition table, wearing that stupid black T-shirt? Had he signed the petition? And what did Laurel know about Thayer and Sutton, anyway? Once again she thought about Laurel’s vague comment: You got him in trouble! Again. What was she referring to? How could Emma find the answer? “I’ll call you when we get home,” Laurel promised, interrupting Emma’s thoughts. “Bye!” And then the music shut off abruptly, filling the second floor with silence. Emma heard a drawer open and shut, and then Laurel’s door creaked. She saw a shadow pass under Sutton’s door, and then heard Laurel’s voice downstairs in the kitchen, calling out to Mrs. Mercer. Suddenly, an idea came to her. She sprang up from Sutton’s bed and padded into the hall. Laurel’s bedroom door was ajar. Light from a bedside table spilled onto the carpet. Listening to make sure Laurel wasn’t coming back up the stairs, she tiptoed toward the bedroom. Within seconds, she was inside. She pulled the door closed, listening to the lock catch. Laurel’s bedroom was eerily similar to Sutton’s, down to the white bubble chair and the purple pillows on the bed. Emma stepped to the far wall where a recent coll age of tennis team pictures hung next to a calendar of puppies. OCTOBER, the calendar heading read. Laurel had covered the days with notes about homework assignments, tennis matches, and parties. Slowly, quietly, she pulled a lime-green tack from the wall and flipped the calendar pages back to August, which featured three tiny Boxer puppies. Laurel had written FAMILY VACAY in bold letters across the squares marking the first week of the month. Emma’s eyes immediately zoomed toward August thirty-first, the day Sutton vanished. Laurel had drawn a blue heart in the upper right-hand corner of the day. She’d colored the heart in with thick, scrabbling lines, the ink pressed hard into the page. Emma stared at the heart for a moment, unsure what it meant. She flipped to September, staring at the dates marking Nisha Banerjee’s end-of-summer party, the first day of school, the first tennis invitational. Nothing was amiss. But then something on the back side of the August page caught her eye: Pressed into the paper, directly behind the box for the thirty-first, were the initials TV. For Thayer Vega? Emma’s heart picked up speed. Laurel had obviously written the initials first, then covered them up with the solid blue heart. But why? I wish I knew. “What are you doing in here?” Emma let the calendar fall back to October and whipped around to see Laurel standing in the doorway. Her lips were pursed. Her hand was on her jutting hip. She shot across the room and pushed Emma away from her calendar. Emma scrambled for an excuse. “The Haverford match,” she said quickly, pointing to a Friday two weeks in the future. “I just wanted to check the date.” Laurel peered around her desk, as though to make sure nothing was missing or out of place. “With the door closed?” A tiny beat passed, then Emma stood up straighter. “Paranoid much?” she snapped, channeling her inner Sutton. “The air conditioning must have pushed it closed.” Laurel looked like she was going to say something else, but then Mrs. Mercer’s voice sounded at the bottom of the stairs. “Girls? We have to leave now!” “Coming!” Emma trilled, as though she’d done nothing wrong. She swept past Laurel, trying to remain poised, blameless, and aloof. But she could feel Laurel’s eyes searing into her back. I could, too. It was obvious she hadn’t bought Emma’s lie. Mrs. Mercer was standing at the bottom of the stairs, checking her BlackBerry. She smiled at the girls as they walked down the stairs. “You both look lovely,” she said in an eager voice. Probably too eager. Emma knew she was going to be disappointed by tonight’s outcome. Mr. Mercer rounded the corner and jangled a set of keys in the air. He’d changed from hospital scrubs into a pair of wrinkle-free khakis and a salmon-colored button-down, but his eyes looked tired and his hair was mussed. “Ready?” he said a bit breathlessly. “Ready,” Mrs. Mercer echoed. Laurel crossed her arms over her chest sulkily. Emma just shrugged. They walked to Mr. Mercer’s SUV and climbed in. As Emma belted herself into the seat behind Sutton’s mother, Mr. Mercer caught her eye in the rearview mirror. She quickly looked down. Aside from a few run-ins in the hall, she’d hardly spoken to Sutton’s dad since Saturday morning—he’d been working around the clock at the hospital. Now he was staring at her like he knew she was hiding something. As Mr. Mercer hit reverse and pulled into the street, Mrs. Mercer plucked a gold-tone compact from her purse and smoothed on a layer of mauve lipstick. “This weather is so odd for early October,” she chattered. “I can’t think of the last time we expected rain like this.” No one responded. Mrs. Mercer cleared her throat, trying again. “I got that great mariachi band you love for your party, honey,” she said, laying a hand on Mr. Mercer’s arm. “Remember how brilliant they were at the Desert Museum benefit?” “Great,” Mr. Mercer answered in a tepid voice. It seemed like he didn’t really feel like doing family dinner either. Mrs. Mercer fell quiet, looking defeated. I watched them all settle into stony silence. Something about this situation seemed familiar to me. I wondered how many other times my parents had tried whatever means necessary to force Laurel and me to be friends. We’d been close, once—I had glimmers of us spying on our parents together during family vacations, playing a game I’d made up called Runway Model in the basement, and even me teaching Laurel how to hold a tennis racket and hit a decent backhand. But something had happened over the years—","sourceLink":"https://allnovel.net/two-truths-and-a-lie-the-lying-game-3/page-12.html","bookId":2395,"book":{"id":2395,"title":"Two Truths and a Lie (The Lying Game #3)","description":"Storyline: Two Truths and a Lie (The Lying Game #3) Sutton Mercer watches from the afterlife as her long-lost twin, Emma Paxton, takes over her identity to solve her murder. But after ruling out her early leads, Emma still hasn’t found Sutton’s killer. A lot of people wanted her dead—but one name keeps popping up: Thayer Vega. When the gorgeous and mysterious Thayer returns to town, Emma has to move fast to figure out whether he’s back for revenge…or if he already got it. Set in a town where friends can turn into dangerous enemies and everyone harbors dark secrets, The Lying Game is a juicy new series that fans of the #1 New York Times bestselling Pretty Little Liars series—and the hit ABC Family show—will love.","cover":"https://allnovel.net/images/two-truths-and-a-lie-the-lying-game-3.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/two-truths-and-a-lie-the-lying-game-3.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:27:02 AM"}}
