{"id":73372,"no":31,"title":"Page 31","content":"“I mean …” Emma went on, leaving a heavy pause between them, hoping Thayer would let her in on whatever he wasn’t saying. But he just looked at her meaningfully, his eyes small slits.\\n\\n “I should go,” he mumbled finally, and turned toward the store. But a few paces away, he turned and looked back, running a tanned hand over the back of his neck. “Actually, there’s something I’ve been wanting to ask you.” Emma swallowed hard. A few rows over, a car alarm went off. An old man shoved an empty shopping cart into the corral. She stared at Thayer and waited for his question. She hoped she knew the answer.\\n\\n Thayer looked down at his beat-up Converse. “Why didn’t you respond to my notes?”\\n\\n Emma scrambled to think. When he’d referenced his notes, she’d assumed he meant the note someone had stuck on Laurel’s car, warning Emma that Sutton was dead and she needed to play along. But now she realized he must have meant something else.\\n\\n “I emailed you and emailed you,” Thayer continued.\\n\\n “But you never wrote back. Was it because of the accident?\\n\\n Because I broke my leg and wouldn’t be Mr. Athlete anymore?”\\n\\n “It’s not like that at all,” Emma said softly.\\n\\n “Of course it’s not,” I whispered along.\\n\\n Emma’s mind raced, putting together the pieces of what Thayer was saying. Sutton and Thayer did have some sort of secret email correspondence. Of course Sutton wouldn’t have written to him after the last night they saw each other—she was dead. And naturally, when Emma took Sutton’s place, she wouldn’t have known what that covert email address was. “I’m sorry I didn’t contact you,” Emma said. “I would have, if …”\\n\\n “Save it,” Thayer interrupted. He shrugged a shoulder and raised his glance to give her a long stare. “I missed you, Sutton. And I was so angry when you cut me out of your life. You were the only person who understood me. But now you’re acting like you don’t know who I am. I came to your room that night because I wanted to tell you the truth about where I’ve been. I emailed you I was coming, but I guess you didn’t get it. But then you acted all afraid of me. Like I was going to hurt you.”\\n\\n “I know and I’m sorry,” Emma said, her eyes lowered. “I was confused and surprised. And stupid. It was a mistake.”\\n\\n “I just wanted you to listen,” Thayer said. He looked so forlorn that Emma reached out and touched his arm. He didn’t pull away, so she moved a little closer and folded her arms around his shoulders, squeezing tight. At first, Thayer remained stiff and closed-off, but soon he melted into her, burying his head into her neck and running his hands up and down her arms. The movement was so passionate and real. It was glaringly clear to Emma just how much he cared for Sutton.\\n\\n And the ache I felt inside made it glaringly clear just how much I’d cared for him. And how stupid I’d been to let him go. If only I had gone with Laurel to the hospital. If only we had all ridden together, maybe I wouldn’t be dead now.\\n\\n Thayer traced a line from Emma’s shoulder to her wrist before pulling his hand away and looking sheepish. “I shouldn’t be pissed, really,” he said. “You had your reasons for not reading my messages, not writing back. I know I come on strong. I know I get too passionate, blow hot and cold. And I wasn’t telling you everything. You wanted to know what happened to me, and I never told you. But it wasn’t because I didn’t trust you. It was because … well, I was embarrassed.” A sad smile crossed his face. “I went to rehab, Sutton. For alcohol abuse. It was just something I had to do on my own. I was just so angry, all the time. I drank to numb it all, but it just made everything worse.”\\n\\n “Rehab?” Emma blinked. “Are you … okay?”\\n\\n Thayer nodded. “I had an amazing doctor, and it was such a meaningful, helpful experience that I got this.” He rolled up his sleeve and showed her the tattoo on his arm of the eagle in flight.\\n\\n Emma stared at him, thinking of her conversation with Dr. Sheldon’s nurse. “Did you do the whole program?”\\n\\n “Well, I was stuck in the hospital with my leg for a while, and then I left a little before my doctor wanted me to, but I was ready to come back to Tucson. To see you,” Thayer said earnestly. “I’ve told my parents where I was, too. My dad was horrified, of course, but he’s coming around, especially since I’m clean now. He’s even letting me back in the house, though we’ll see how that goes.”\\n\\n “That’s … great,” Emma said slowly, taking it all in.\\n\\n She thought about the SPH website. Emma had just assumed that Thayer was locked up on the psych ward in the hospital, but of course a rehab center could be part of a mental-health facility.\\n\\n “And then there’s this.” Thayer held up the rope bracelet around his wrist, smiling wryly. “Remember how we fought over it because a girl made it? But Sutton, she’s fifty-two years old and has a husband and three kids.” I let out a long breath, remembering the fight Thayer and I had had at Sabino Canyon, the one that had kicked off that weird chain of events. I had felt jealous, sure that Thayer was somewhere cool and interesting without me. If only he had been honest. If only I hadn’t jumped to conclusions.\\n\\n Thayer let out a breath and rested a large hand on the hood of his car. “You know, Sutton, you seem … so different. What’s changed?”\\n\\n Emma licked her bottom lip and tasted Sutton’s watermelon-flavored gloss. No doubt Thayer knew her twin well. A part of her longed to tell him the truth, now that she knew he was innocent. He cared so deeply for her sister that he might help her and Ethan out. But she didn’t know him well enough to trust him with her secret—not yet, anyway.\\n\\n “Nothing’s changed,” she said sadly. “I’m exactly who I always was. I’ve just … grown up a little.” Thayer nodded, even though it looked like he didn’t understand what he was saying. “I guess I’ve grown up, too,” he mumbled. “Rehab and jail will do that to you.” They both stared at each other. Emma wasn’t sure what more there was to say. Shrugging, she gave him a little wave and turned toward the store. When she looked over her shoulder, Thayer was still watching her, maybe hoping she’d come back to him. But she didn’t. She wasn’t Thayer’s to have, and she was with Ethan now.\\n\\n When Emma didn’t return to him, Thayer’s face fell. He looked crushed.\\n\\n I was crushed, too. Thayer didn’t understand why I no longer loved him back. And unless Emma solved my murder, he would never get the answer.\\n\\n 31\\n\\n MEET THE MERCERS\\n\\n That afternoon, Emma sat on the Mercers’ front porch and thumbed through Laurel’s glossy copy of Elle. A faint citrus smell wafted from the neighbor’s lemon tree and the sounds of an ice cream truck jingled from the next street over. One of the tennis-team moms jogged by with her golden retriever and gave Emma a wave just as Ethan’s beat-up Honda pulled to the curb. The engine coughed and sputtered as Ethan turned off the ignition.\\n\\n Emma’s heart gave a tiny flutter as he stepped from the car. Ethan looked nervous as he raised his hand in a wave. At that moment, Mr. Mercer emerged from the garage clutching a white rag covered in black grease stains. He looked up with surprise, but then shrugged and shot Emma a weak smile.\\n\\n Ethan walked up the front steps, noticing Sutton’s dad, too. “Is it okay that I’m here?”\\n\\n “It’s more than okay,” Emma answered. “I told them about us at breakfast.” From now on, there would be no more hiding. They could be friends—and more—out in the open now.\\n\\n Mr. Mercer’s cell phone suddenly bleated loudly.\\n\\n Sutton’s dad, who was pretending to be absorbed in polishing his motorcycle but was clearly watching the interaction between Emma and Ethan, glanced at the caller ID. His face darkened, and he swore loudly. He slipped into the cover of the garage to take the call.\\n\\n “That’s weird,” Emma said, her eyes on the garage.\\n\\n “Maybe it’s a work call.” Ethan forced a grin but Emma could tell he was uncomfortable. “A hospital patient gone haywire.”\\n\\n A car door slammed and an engine growled to life. Mr.\\n\\n Mercer’s Audi reversed down the driveway. Emma waved good-bye to him, but Mr. Mercer didn’t even notice her. His face was drawn as he backed the car onto the street and hit the gas. He swerved, blasting his horn when two boys zoomed by on skateboards. Emma frowned. Maybe that phone call had been a work emergency.\\n\\n “Remind me not to get on that guy’s bad side,” Ethan said, running a hand through his dark hair.\\n\\n He sat next to her, and Emma filled him in on everything she’d found out the night before—it had been too loud and crowded to talk at the party, and they’d had Laurel in the car on the drive home. Ethan’s eyebrows went higher and higher as she explained that Thayer couldn’t have killed Sutton.\\n\\n “Let me get this straight,” Ethan sounded out after Emma finished. “The night Sutton died, someone else hit Thayer with Sutton’s car?”\\n\\n Emma nodded. “It definitely wasn’t Sutton who hit him.\\n\\n Someone must have taken her car and dumped it in the desert. Maybe that person came back and killed Sutton, too.”\\n\\n “So who was it?”\\n\\n “I don’t know. I want to ask Thayer, but it might make me look suspicious if I don’t know.”\\n\\n A gust of air caught the wind chime, and Ethan flinched at the sudden ringing, making Emma smile. “Scared of a little wind?” she teased.\\n\\n “Very funny,” Ethan said, glancing across the lawn. “I am scared that whoever killed Sutton is still out there,” he whispered.\\n\\n “I know,” Emma said, shivering despite the heat. “Me, too.”\\n\\n A frown settled on Ethan’s face. “If it wasn’t Thayer, who could it have been? All signs pointed to him. He made perfect sense. And I still think he’s dangerous.” Emma shrugged. “Even if he’s troubled, he didn’t do it.\\n\\n I suppose that it’s too much to hope the killer has left town?\\n\\n I haven’t heard from him, or her, since the dance.”\\n\\n “Maybe.” Ethan folded his ankle over his knee and glanced sideways at Emma. “But something tells me that’s too good to be true. Whoever it is could still be out there.\\n\\n I’m up for finding the truth if you are.”\\n\\n “Definitely,” Emma whispered. She leaned her cheek on Ethan’s shoulder. He kissed the top of her forehead and she tilted her chin to meet his lips. Ethan returned her kiss, wrapping his arms around her waist and pulling her close.\\n\\n His hand reached up to trace the soft hairs that framed her face. He kissed her softly, his lips fitting perfectly with hers, making Emma want to freeze time. She’d never had a real boyfriend, and now she had something—some one—more amazing than she could have ever imagined.\\n\\n A car pulled into the driveway, and Emma and Ethan broke apart. The car door of a blue BMW opened, and Thayer hoisted himself out. Emma felt Ethan stiffen next to her. \\n\\n","sourceLink":"https://allnovel.net/two-truths-and-a-lie-the-lying-game-3/page-31.html","bookId":2395,"book":{"id":2395,"title":"Two Truths and a Lie (The Lying Game #3)","description":"Storyline: Two Truths and a Lie (The Lying Game #3) \\n Sutton Mercer watches from the afterlife as her long-lost twin, Emma Paxton, takes over her identity to solve her murder. But after ruling out her early leads, Emma still hasn’t found Sutton’s killer. A lot of people wanted her dead—but one name keeps popping up: Thayer Vega. When the gorgeous and mysterious Thayer returns to town, Emma has to move fast to figure out whether he’s back for revenge…or if he already got it. \\n Set in a town where friends can turn into dangerous enemies and everyone harbors dark secrets, The Lying Game is a juicy new series that fans of the #1 New York Times bestselling Pretty Little Liars series—and the hit ABC Family show—will love.\\n","cover":"https://allnovel.net/images/two-truths-and-a-lie-the-lying-game-3.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/two-truths-and-a-lie-the-lying-game-3.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:27:02 AM"}}
