{"id":110321,"no":27,"title":"Page 27","content":"While I\u0027d been pretty confident in telling Seth that Dante had likely skipped town, I nonetheless stopped by his shop the next day. It had never been very prosperous looking to begin with, but now the signs of abandonment were clear. The neon PSYCHIC sign was gone. The blinds were also gone, showing a room even barer than before. The FOR LEASE sign on the door was probably the most telling clue that Dante was gone for good. In the wake of what had happened with Seth, it was hard to know what to think about Dante. My heart almost didn\u0027t have the energy for it. I had cared about him, absolutely. He\u0027d suited my decadent phase, and despite his blackened soul, there were parts of him that were likeable. And above all, it appeared that he\u0027d cared about me, misguided or not. I wasn\u0027t happy about the deal he\u0027d made with Grace, but I was glad he hadn\u0027t been there to face Jerome and Mei\u0027s punishment. No one deserved that, not even Dante. I hoped wherever he was, he\u0027d try to start a new life-maybe one that could lighten his soul a little. I well knew, however, that humans with damned souls rarely recovered. Later that evening, I drove over to Capitol Hill. Peter and Cody were hosting a cocktail party to celebrate Jerome\u0027s return, though I half-suspected they simply wanted to drink away the sorrows of losing the sun. \"How can we celebrate Jerome being back when he\u0027s not even here?\" Tawny wanted to know. She was back to her normal, Amazonian blond self and was holding her martini glass in a precarious way. Peter couldn\u0027t take his eyes off it. I was nursing a gimlet out of politeness. The vampires had gone out of their way to get Grey Goose and fresh lime, but truthfully, I was a little burned out on alcohol. It seemed like I\u0027d been perpetually drunk these last four months. I was not burned out on cigarettes yet, but I was trying very hard to break the habit once more. \"Jerome\u0027s got plenty to keep himself busy,\" I said. \"We\u0027re just drinking in his honor.\" \"But he is staying, right?\" asked Cody. We all turned to Hugh. Like the rest of us, Hugh\u0027d had his abilities restored, and I\u0027d honestly expected him to be a lot happier having his imp vision back. Instead, he seemed very serious, and I could have sworn he was watching me when I wasn\u0027t looking. \"Yep. He and Mei schmoozed the corporate guy pretty good and pulled in enough favors to get backing from others. Cedric and Nanette both swore up and down that no one else was better qualified to run Seattle than him.\" \"Nanette finally caved, huh?\" I swirled the ice around in my glass. \"Of course, knowing Jerome owes her now probably makes her feel secure in her territory.\" Cody shook his head. \"Still. Grace went through an awful lot to try to pull this off, between the Canadians and all the wheeling and dealing. And Dante.\" He shot me an apologetic look that I waved off. \"I don\u0027t know,\" said Peter. He finally seemed convinced that Tawny wasn\u0027t going to ruin his upholstery. \"She\u0027s a middle management demon with so-so power. Doing what she did-seizing the opportunity when she thought Jerome looked weak-was probably the closest she\u0027ll ever get to ruling over an area like this.\" \"What do you mean? Would she be stuck forever? Never have her own domain?\" asked Tawny, frowning. \"She might have eventually gotten assigned control of some nonexistent town in middle America, but I doubt much more.\" Hugh still looked oddly speculative. \"Clearly, she didn\u0027t want to. Neither does Mei, from the looks of it.\" \"So much for it being better to reign in Hell than serve in Heaven,\" I said, pleased with my own wit. \"Of course, I think we\u0027re going to see a lot more in Mei\u0027s career. She might be so-so in power, but she\u0027s got a plan.\" \"Have you noticed how she\u0027s a lot less scary alone?\" asked Cody. \"It was the matching clothes,\" said Peter sagely. \"When they dressed alike, it was too much like those girls from The Shining .\" More laughter and conversation ensued, though I eventually grew quiet and simply listened. Maybe I could be the life of the party, like Seth had said, but this group could do okay without me. I took a certain amount of contentment by being back with them and having our lives returned to normal-such as they were. I could never be human again, but these were the people I wanted to be damned with. At one point, I got up to trade my empty glass for water and discovered Hugh had followed me into the kitchen. He still looked troubled. The others were laughing and talking, providing cover for our conversation. \"What\u0027s going on?\" I asked. \"I thought you\u0027d be happy.\" \"I am, I am,\" he said. \"Believe me, I am. God, that was miserable.\" I couldn\u0027t help a smile. Hugh had hit his stride with being a lesser immortal. He was past the novice stages of Cody and Tawny and could fully reap the benefits of his position. However, he wasn\u0027t old enough to have acquired all the jaded centuries Peter and I had. Out of all of us, I didn\u0027t doubt that Hugh had suffered the most. \"Then what\u0027s going on?\" He hesitated, and again, I was struck by how out of character he was behaving. \"Georgina, has Seth done anything...bad lately? Rob a bank? Cheat on taxes?\" \"Of course not,\" I said, more confused than ever. \"Has he...or well...did he do anything, uh, bad with you?\" To my chagrin, I blushed. You\u0027d think nothing would make a succubus self-conscious, but I still tried to maintain that line between my private and business sex lives. My silent response was enough for Hugh. \"Fuck.\" \"What?\" I asked. \"We did it when I was in stasis. I didn\u0027t take any of his energy. I didn\u0027t shorten his life. And we haven\u0027t done it since Jerome came back. It\u0027s over. He\u0027s back with Maddie.\" Hugh raised an eyebrow. \"Oh?\" \"I realized how impossible it was for us and convinced him to go back to her. I really laid on the guilt.\" Just mentioning what had happened made me ache all over again. \"I\u0027m sure you did,\" Hugh said dryly. \"What do you mean?\" \"Georgina...\" He sighed. \"There\u0027s no easy way to explain this. When I first met Seth, his soul was like...a supernova. It lit up a room. That guy had such a generous spirit, it was insane.\" Had. \"And now?\" The answer was slowly creeping in on me. \"Now, there\u0027s a shadow on him. A stain on his soul. He cheated on Maddie with you...and is back with her, keeping that from her...\" The room started swaying, and I forced myself to focus on Hugh. \"What we did, it wasn\u0027t sleazy. We are...were...in love. It was sweet-that is, it meant something.\" \"Maybe it did, sweetie. Maybe the planets aligned when you made love. But regardless of what happened between you, he wronged her-and he feels it now. That sin is darkening his soul.\" \"How dark?\" I asked, my voice almost a whisper now. \"If he were a hit by a car right now...\" Hugh\u0027s face was both hard and sad. \"He\u0027d head right to Hell.\" \"Oh my God.\" I collapsed back against the counter. \"I didn\u0027t think...didn\u0027t realize...\" Since I hadn\u0027t been a succubus, I hadn\u0027t been thinking like one. I hadn\u0027t worried about shortening his life or exhausting him because there was no need. While I\u0027d known we were both deceiving Maddie and had felt a fair amount of guilt over it, I\u0027d never considered it in terms of damnation. I\u0027d turned off that part of my life, the part of being a succubus that counted and tallied souls-the main part of my job. Which was stupid of me. Humans didn\u0027t need us to sin. They did it all the time on their own and did just as good a job-if not better-than we could. I didn\u0027t have to be a succubus to make Seth sin. I could have been any woman, any woman he\u0027d had an affair with. Sin was subjective, too, and different people would feel it differently. For someone like Seth, doing what he did would leave a harsh mark-and me making him feel guilty about it hadn\u0027t helped. \"This is worse,\" I said. I laughed, but it was the kind of hysterical laughter that could segue to tears at any moment. \"It would have been better if we\u0027d had sex when we were dating. I\u0027d have taken years off his life, but his soul would have stayed pure-and that\u0027s what matters in the long run. Instead, I was so adamant about refusing to do it...and now look. Look what I did.\" Hugh caught my hand and squeezed it. \"I\u0027m sorry.\" \"Is there...is there any way he can undo it?\" \"You know the answer as well as me. Sure, he can eventually swing the pendulum the other way. But it\u0027s hard. Very hard.\" \"He\u0027s a good person,\" I said stoutly. \"Maybe, but that may not be enough anymore.\" \"He\u0027d need a deal with God,\" I muttered. I stared at the floor, studying the tiles absentmindedly. What had I done? How could I have been so stupid? Had I been so blinded by love and lust that I\u0027d been oblivious to the principles that had dictated my immortal vocation these long centuries? \"Georgina,\" Hugh said hesitantly. I looked at him. \"There\u0027s something else...just a heads up. You know this as well as I do. When upright people screw up like this...they do try to rebound in their way. The guilt\u0027s got to be eating him. People like that try to do things to make up for it. Rash things. Something tells me he\u0027ll be like that.\" \"Thanks for the warning,\" I said. \"Though I can\u0027t imagine he\u0027d do something that could make this any worse.\" The imp cut me a look. \"Sweetie, he\u0027s human. Don\u0027t underestimate him.\" Hugh was right. The next day, I went to the condo builder\u0027s office and talked more in-depth with the real estate agent that handled their sales. We chatted for a while and talked numbers, though I still couldn\u0027t shake the feeling that I was doing this without thinking it through. The pictures were nice, the floor plan was nice, and the options were nice. Yet, I didn\u0027t know if this was just some impulsive reaction to the ups and downs in my life. Then, when he took me to the unit itself and showed me the balcony, I knew. It was a beautiful day, one that wasn\u0027t true summer yet but could give us enough hope that winter was just about finished. Puget Sound was deep blue, and the downtown skyline gleamed in the sun against a cloudless sky. To the west, the Olympic Mountains were visible for the first time in over a month, their peaks still heavy with snow. As often happened with this kind of weather, people turned out in droves, treating it like it was high summer. Families came out, shorts came out. This part of Alki didn\u0027t have a true beach-that was at a park a little farther down-but the water was still just a stone\u0027s throw away from my building, separated only by the small road and narrow strip of grass. I watched the waves break against the shore and realized this was where I needed to be. \"I want to make an offer,\" I told him. I knew Maddie would want to know, so I made sure she was the first one I told when I ended up back in Queen Anne later that night. It was early evening, my last day before returning to a real full-time schedule, and I swung by the store to catch her and tell her. Only, she sought me out first, with news of her own. \"Georgina!\" I\u0027d barely entered when she grabbed my arm and pulled me off into the cookbooks. \"Hey,\" I laughed. \"Glad you\u0027re in a good mood. I\u0027ve got news.\" \"Me too!\" Her face was radiant, and after all that had happened, it made me happy to see her like this. I couldn\u0027t help a return grin. \"What\u0027s up?\" She glanced around covertly, then lowered her voice. \"You were right.\" \"About what?\" \"About Seth needing time-about him being preoccupied.\" Oh lord. He\u0027d finally slept with her again, now that things had ended with us. I can\u0027t say I was happy to have this news delivered to me, but for her sake, I was at least glad she could stop worrying. \"Wow, that\u0027s great, Mad-\" \"He was waiting to propose!\" She shot her hand up to my face so quickly that for half a moment, I thought she was going to punch me. But, no, there was no impact-unless you counted the brilliant glitter of the engagement ring dazzling my eyes. \"Oh my God. But it...it\u0027s so soon...\" \"I know,\" she said, breathless from her excitement. \"I can\u0027t believe it. And I mean, yeah, we\u0027ve only been going out for about four months, but Seth says we can have a long engagement, that he just wanted to commit things between us.\" Of course he did. When upright people screw up like this...they do try to rebound in their way. The guilt\u0027s got to be eating him. People like that try to do things to make up for it. Rash things. How could I be surprised? I\u0027d become a succubus because I\u0027d cheated on my husband and been caught. I\u0027d sold my soul in an effort to blot that act out, to make him and everyone else I knew forget me. Why was this any different? \"You don\u0027t think...\" Maddie turned uneasy, once more seeking my approval and advice. \"You don\u0027t think it\u0027s too fast, do you? Have I made a mistake? I mean, even if we wait awhile for the wedding...\" I kept smiling. \"It\u0027s fine, Maddie. There\u0027s no time frame that\u0027s set for everyone. If it\u0027s what feels right to you, then you\u0027ve got to do it.\" Her grin lit back up. \"Oh, thank you. I\u0027m so glad to hear you say that. I mean, I said yes, and I\u0027ve been excited...I just didn\u0027t want it to seem like I was rushing in.\" She glanced back down, admiring the ring. I realized something. \"It\u0027s a diamond.\" She gave me a curious look. \"Of course. Why wouldn\u0027t it be? Most engagement rings are.\" Last year, I\u0027d teased Seth about getting married, and he\u0027d said that if he ever did, he\u0027d give his bride-to-be a ruby because he thought diamonds were ordinary, and getting married was extraordinary. I stared into the stone\u0027s glittering facets, puzzled. \"Did you pick it out? Had you told him you wanted a diamond?\" \"Nope. It had never come up. He just got it for me. Why?\" I shook my head and tried to look happy for her. \"No reason. It\u0027s beautiful. Congratulations.\" I turned to leave. \"I\u0027ll see you tomorrow.\" \"Georgina, wait.\" I paused and looked back. \"What was your news?\" \"Wh-oh. Yeah. I\u0027m buying the place in Alki.\" \"Seriously?\" I swear, she almost seemed more excited about that than the engagement. \"When will it be done?\" \"July.\" \"Oh, wow. That\u0027s great. You could have such great summer parties.\" \"Yep. Let\u0027s hope it gets finished on time.\" She sighed happily and gave me a quick hug. \"Isn\u0027t this a great day? Good news for both of us.\" \"Yeah,\" I agreed. \"Great.\" I walked home, too stunned over the engagement news to process it much. Considering Hugh\u0027s prediction, there wasn\u0027t much to process. I\u0027d convinced Seth that he and I were a fantasy, that he needed to settle into reality and take what good he had with Maddie. Seth had believed me and tried to make it up to her-make it up to himself, even-with this hasty engagement. He was not a rash person usually, but the extreme circumstances had turned him into one. My phone rang about half a block from the store. I could recognize Vancouver\u0027s area code by now, but I didn\u0027t know the number. For all I knew, Evan wanted me to smuggle them some spray paint across the border. To my relief, it was Kristin. \"Hey,\" I said. \"How\u0027s it going?\" \"Fine. Well, better than fine. Great actually.\" There were a few awkward seconds of silence. \"Me and Cedric...we\u0027re...\" The first spark of enthusiasm I\u0027d felt in a while leapt up in me. \"Really? You guys are a...thing?\" \"Yeah.\" There was wonder in her voice, like she could hardly believe it. \"He told me that you were the one who said that he should go out with me.\" \"Oh, well. I...just suggested he was looking in the wrong places.\" \"Georgina, there is no way I can thank you enough for this.\" Her voice was brimming with emotion, something I wouldn\u0027t have thought possible of the businesslike imp. \"This is...I\u0027ve wanted this for so long. Loved him for so long. And he never noticed me until you made him just pause and look. That\u0027s exactly how he said it too. That he\u0027d been so busy chasing everything else that he\u0027d never seen what was in front of him.\" I thought I might get choked up too. \"I\u0027m glad for you, Kristin. Really. You deserve it.\" She laughed. \"Most would say us damned souls don\u0027t deserve anything.\" \"We\u0027re like anyone else, deserving both good and bad. I\u0027m not sure being damned has anything to do with it.\" She was quiet for a moment, and when she spoke again, her voice was low, almost hard to hear. I actually stopped walking and stepped off down a side street to get away from the din of traffic. \"It\u0027s funny you mention that,\" she said slowly. \"Because...well, I did something for you.\" I suddenly had an image of Tim Horton\u0027s donuts showing up on my doorstep. \"Er, that\u0027s really not necessary. I didn\u0027t do that much.\" \"You did, though. To me, at least. And so...I wanted to do something just as big for you. I, uh, went and looked at your contract.\" I caught my breath. \"What?\" \"We\u0027ve had a lot of paperwork to file, and I managed to work in a corporate trip.\" \"Corporate trip\" was a nice way of saying she\u0027d visited the inner offices of Hell. \"Kristin...if you\u0027d been caught...\" \"I wasn\u0027t,\" she said proudly. \"And I found your contract and read it.\" I\u0027d come to a complete stop now. The world around me didn\u0027t exist. \"And?\" \"And...nothing.\" \"What do you mean nothing?\" \"I mean, there\u0027s nothing wrong with the contract. I went over and over it. Everything\u0027s in order.\" \"It can\u0027t be! Niphon was trying so hard to mess with me...to get me recalled. Hugh was certain it meant he was trying to shift attention from the contract.\" \"I don\u0027t know about any of that,\" said Kristin, sounding truly sympathetic. \"All I know is what I read. You sold your soul and took on standard succubus servitude in exchange for every mortal you knew forgetting who you were. That sound right?\" \"Yeah...\" \"That\u0027s what it said. All the language was exactly as it should be.\" I didn\u0027t really have any response, so I gave none. \"Georgina, are you still there?\" \"Yeah...I\u0027m sorry. I just thought...I\u0027d been so certain...\" It had been a foolish hope, that maybe somewhere there was a loophole for me. But then, I seemed to fall for those things all the time, just like I had with Nyx\u0027s dream and the impossible chance of getting pregnant while in stasis. I was as na\u0026iuml;ve as Dante had said. \"Thanks. I really appreciate you looking.\" \"I\u0027m sorry you didn\u0027t get what you wanted. If there\u0027s anything else I can do for you-that doesn\u0027t involve breaking into records-let me know.\" \"Thanks. I will.\" We disconnected, and I stared bleakly at my surroundings, at the quiet residential block I\u0027d stepped off onto. \"There is no way,\" I said out loud, \"that this day can get any worse.\" A rustle behind me made me jump, and I spun around. I had thought I was alone and now felt like an idiot getting caught talking to myself. I saw no one, though. Then, a bush by the sidewalk twitched a little. I took a few steps toward it and knelt down. Yellow eyes peered out at me, followed by a piteous meow. I made the clicking sound that\u0027s universal to cat owners, and after a few moments, my observer emerged. It was a cat, a very scraggly one-and a cat I was pretty sure I\u0027d seen before. It was smaller than Aubrey, maybe younger, and I could see its ribs poking out underneath the fur, which was matted and dirty. When I petted the cat\u0027s head, I noticed a dry texture to the fur that often indicated fleas. The cat seemed unsure of me-but not enough that it ran away. It mostly seemed curious for now, like it was trying to figure me out-and maybe score some food. Which was fine, because I was trying to figure it out too. Clearly, this cat had no owner, or if it did, that ownership needed to be revoked. I studied its yellow eyes and every frail line of its body. The cat looked so different and yet...I was certain it was the one. And in a musing that was worthy of Carter, I suddenly wondered if the universe might not be done with me after all. I let the cat sniff my hand a bit longer, and then I reached out and picked it up. It was a she. She didn\u0027t fight me as I held her to my chest and walked home. In fact, she started purring. Maybe she knew me. Maybe she was just weary of fighting all the time too. When I shouldered open my door, Aubrey\u0027s head immediately jerked up from where she\u0027d been napping. She made no noise, but all the fur on her back stood on end as she studied our new visitor with narrowed eyes. Roman, lying on the couch as usual, also studied us. He looked at the cat, taking in her orange and brown patched coat. Then, he looked up and met my eyes. I\u0027m not sure what he saw, but it made him smile. \"Let me guess. That\u0027s a tortie.\" \"Yes,\" I agreed. \"This is a tortie.\"","sourceLink":"https://allnovel.net/succubus-heat-georgina-kincaid-4/page-27.html","bookId":2057,"book":{"id":2057,"title":"Succubus Heat (Georgina Kincaid #4)","description":"Storyline: Georgina Kincaid Book 4: Succubus Heat Which should be a good thing. But lately, thanks to her foul mood over breaking up with bestselling writer Seth Mortensen, she\u0027s been so wicked that Seattle\u0027s uber-demon Jerome, decides to \"outsource\" Georgina to a rival--and have her spy for him in the process. Being exiled to the frozen north--okay, Vancouver--and leaving Seth in the cozy clutches of his new girlfriend is unpleasant enough. Then Jerome is kidnapped, and all immortals under his control mysteriously lose their powers. One bright spot: with her life-sucking ability gone, there\u0027s nothing to keep Georgina from getting down and dirty with Seth--nothing apart from his girlfriend that is. Now, as the supernatural population starts turning on itself, a newly mortal Georgina must rescue her boss and figure out who\u0027s been playing them--or all hell will break loose. . .","cover":"https://allnovel.net/images/succubus-heat-georgina-kincaid-4.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/succubus-heat-georgina-kincaid-4.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 5, 2019 11:56:55 PM"}}
