{"id":87924,"no":15,"title":"Page 15","content":"Jealousy permeated throughout Katherine’s body as she tried her best to be polite and kind. Her stomach flipped and twisted as she fought off the urge to ask Kylie everything she knew about Austen. She wanted to know what it was like to date him. How it felt to be loved by him. How he treated her. Was he funny? Did he make her laugh? There were parts of her that wanted every tasty morsel of information she could consume.\\n\\n The three meandered toward the overstuffed patio furniture and sat down. “So girls, what’s been going on? Fill me in on everything.” Kylie eyed Katherine, “You still dating that super-hot guy? What was his name? Colton? Colby? Something?”\\n\\n “Cooper,” Katherine snickered.\\n\\n “Yeah, Cooper. So you two still together or what?” Kylie feigned interest.\\n\\n “We’re still together,” Katherine’s tone hitched.\\n\\n “What’s wrong? Trouble in paradise?” Kylie’s asked smugly.\\n\\n “No. It’s just complicated is all,” Taylor shot a look of death at Katherine and kicked her swiftly under the table.\\n\\n “They’re fine, Kylie. Katherine’s just a mental case because her boyfriend is royalty.” Taylor attempted to change the subject.\\n\\n “Maybe he should be dating a girl who can handle that sort of thing,” Kylie arched her brows. “I’ll take him off your hands, Kat, if he’s too much for you.”\\n\\n “I’ll keep that in mind, thanks.” Katherine knew Kylie wasn’t entirely joking.\\n\\n “What about you, Tay?” Kylie turned to look at her. She forced a sweet smile before she asked, “Everything good with Danny?”\\n\\n “No complaints,” Taylor glared.\\n\\n “Oh Taylor, tell her what Danny did.” Katherine longed to shift the focus of Kylie’s questions away from herself.\\n\\n Taylor’s face instantly turned two shades pinker. “Well, my crazy boyfriend told me he loved me for the first time ever. Not only did he tell me loved me, but he screamed it…out loud…in a parking lot filled with people!”\\n\\n Kylie’s mouth fell open as Taylor continued, “I was so embarrassed.”\\n\\n “I would be horrified if any guy ever did that to me,” Kylie snapped in disapproval.\\n\\n “You know what though? It was sweet. And romantic,” Taylor grinned, “So what about you, Kylie? Any guys in your life?”\\n\\n “Oh you know, the usual. I meet a lot of guys at work, but I can’t get the ones I don’t want anymore to go away.” She rolled her eyes and then breathed in quickly, “That’s what I was going to ask you. I almost forgot. What ever happened to that dream guy? Did he ever come back?”\\n\\n Katherine almost threw up and Taylor’s face turned white, “Nope. He’s just gone,” Taylor tried to convince her.\\n\\n “You’re lying,” Kylie called her on it. “I might have believed you if her face didn’t give it away.” She glared at Kat with disgust.\\n\\n “No, really,” Kat shook her head, “he hasn’t come back.”\\n\\n “I don’t even know you that well and I know you’re completely full of it.”\\n\\n Katherine glanced at Taylor for approval and she softly nodded her head.\\n\\n “Okay. He’s been back. A few times,” Katherine admitted.\\n\\n “Really? And it’s the same guy every time?” Kylie asked, intrigued.\\n\\n “Yep, same guy.”\\n\\n “Do you know who he is yet? I mean, is he real?”\\n\\n “I have no idea,” Katherine attempted to lie again.\\n\\n Kylie squinted, “You’re a terrible liar, Kat.” Kylie’s eyes darted between the two girls. “What’s going on? What aren’t you telling me?”\\n\\n Taylor rubbed at her eyes and then stared at Kylie. “Just keep an open mind, okay?”\\n\\n Kylie responded with attitude. “Whatever. What is it?”\\n\\n Katherine was so scared for Kylie’s reaction that she stood up and started to pace back and forth. She assumed Kylie would be incredibly angry, would most likely hate her and probably want to fight her. Kat wasn’t a fighter, so she hoped it didn’t come to that.\\n\\n “Why are you pacing? Sit down.” Kylie barked at Kat. “Which one of you is going to tell me what the hell is going on?” She folded her arms across her chest and tapped her foot against the deck.\\n\\n Katherine shook her head ‘no’ and watched as Taylor took a deep breath. “We figured out who Kat’s dream guy is.”\\n\\n “I gathered that much.” Kylie grumbled, “So, why all the drama? Who is it?”\\n\\n “Austen,” was all Taylor said.\\n\\n “I’m sorry, what did you just say?” Kylie asked through clenched teeth.\\n\\n “It’s Austen, Kyles. He’s the one from her dreams.”\\n\\n “Are you joking? This is a joke right?” Kylie glowered at Katherine and screamed, “He didn’t even know you! Why the hell would you dream about my boyfriend?” Her face reddened as she continued to yell, “I don’t believe you.”\\n\\n “It’s true,” Katherine added. “Kylie, please calm down.”\\n\\n “Don’t,” Kylie whipped her head and narrowed her eyes. “Don’t talk to me. I don’t want to hear anything you have to say.”\\n\\n “Kylie, don’t be like that. It’s not her fault. She had no idea who he was until last night,” Taylor explained.\\n\\n “What happened last night? How do you even know it’s him? How do you know she’s not lying, Taylor?”\\n\\n “She recognized him from a picture in my bedroom. And why would she lie about this?”\\n\\n Kylie’s face twisted in anguish as she wailed, “He was my boyfriend. Not yours! He didn’t love you, he didn’t even know you!” Her eyes tightened with confusion. “Why wouldn’t he come to me?”\\n\\n “I don’t know,” Katherine avoided eye contact.\\n\\n “You’re lying! You do know! Tell me!” Kylie shouted. Talking about Austen like this was too much for her. The pain was too real and the emotions were still raw. To have him come up this way was like ripping a blood-soaked bandage off a two-year-old wound to find it had barely begun to heal.\\n\\n Kylie buried her face in her hands and started to cry tears of disbelief and sadness. “Why wouldn’t he come to me? Doesn’t he love me any more?” Kylie was inconsolable. ”Why did he stop loving me? I haven’t stopped loving him.”\\n\\n Katherine’s heart ached inside her chest. She had never in her life inflicted so much pain on another. She felt completely responsible. She wanted to fix it, but she didn’t know how.\\n\\n “Of course he loves you, Kyles.” Taylor reached her arms around and hugged her from behind. “You were the only girl he ever loved.” She peered into Katherine’s eyes as she spoke those words.\\n\\n Katherine whispered, “I’m so sorry, Kylie. I never meant to hurt you.”\\n\\n Kylie scowled at Kat through her tear-stained face, “I don’t care that you’re sorry. Stay away from me, and stay away from Austen!” She threw Taylor’s arms off of her shoulders and sprinted toward her car.\\n\\n “Kylie, don’t go. Come on,” Taylor bellowed.\\n\\n Once Kylie reached her car, she slammed the door, blasted the stereo and sped away, spinning the tires until they screeched. Taylor gave Katherine a sad look. “Well, that went well.”\\n\\n “I am so sorry, Taylor. I can’t believe all of this is happening.” Katherine wasn’t sorry for meeting Austen. She wasn’t sorry for the dreams. But she was sorry for all the pain it seemed to cause those around her.\\n\\n “She just needs time. It’s a lot to take in, you know?” she met Kat’s sympathizing gaze. “She really loved my brother and I can only imagine that she probably feels left out, or forgotten, or something.”\\n\\n “I just feel terrible that something that makes me so happy makes everyone else so upset.”\\n\\n “Not everyone,” Taylor grinned and Katherine hugged her.\\n\\n Chapter Nine\\n\\n “Was that Kylie who sped out of here this morning?” Taylor’s mom asked curiously.\\n\\n “Yeah. She stopped by, got pissy, and left.”\\n\\n “What happened?” Her mom stopped washing the dishes and peered at the girls.\\n\\n “Nothing happened. You know how Kylie is, Mom.”\\n\\n Mrs. Dailey went back to washing and nodded her head. “She is emotional. Well, I hope you girls patch things up before you head back to school.”\\n\\n “I’m sure we will.”\\n\\n The girls flopped onto Taylor’s bed and Katherine rested her head against the pillow.\\n\\n “Do you think she’ll call you back?” she asked.\\n\\n Taylor hesitated, “I honestly don’t know. It might be awhile before she’s ready to talk to me.”\\n\\n “Have you heard from Danny?” Katherine wanted to think about something happy and Taylor and Danny always made her smile.\\n\\n “Only every twenty minutes,” Taylor joked, and shook her cell phone. “Did you ever respond to Cooper’s text?”\\n\\n “Yeah.”\\n\\n “What’d you say?”\\n\\n “I told him I was having a great time. I hoped he was too and that I’d see him in a few days.”\\n\\n “Hmmm.”\\n\\n “Hmmm, what?” Katherine asked.\\n\\n “You didn’t tell him you missed him back,” Taylor noted.\\n\\n “I must have forgotten,” Katherine smirked.\\n\\n “Uh-huh. Listen, now that your dream guy is my brother it sort of changes things. I mean, I feel invested, or something. But I still don’t want you to blow Cooper off.”\\n\\n “I can’t make any promises,” Katherine admitted.\\n\\n “So then what are you going to do?”\\n\\n “About what?” Kat wondered.\\n\\n “About Cooper. Are you going to tell him?”\\n\\n “I don’t think so; at least, not yet. I don’t see any reason why I should, in all honesty.” She focused her eyes on Taylor.\\n\\n Taylor nodded and said, “No, you’re right. But some day, when you do tell him, I’d love to be a fly on the wall for that conversation.”\\n\\n “When do you think that will be? I mean really? When am I going to have to tell him?”\\n\\n “I think you’ll know. I don’t think there will be any other option. Know what I mean?”\\n\\n Katherine pursed her lips together, “Yeah, you’re probably right.”\\n\\n Taylor yawned before she said, “Goodnight, Kat. Tell my brother ‘hi’ for me.” And then she rolled over and closed her eyes.\\n\\n The comment made Katherine laugh. “Night, Tay.”\\n\\n Katherine walked along the warm grains of sand and kicked at it with her bare feet. She could see their bench in the distance. She saw him even further in the distance. She smiled just knowing he was near. She watched as Austen tossed a stick for Brody to chase.\\n\\n When they could see each other’s faces, their eyes lit up. Austen walked up to her and put his hand on the back of her neck. He bent down slightly and kissed her. It was soft and slow and she hoped he’d never stop. Her mind raced. Her body felt like it might melt through his arms. He pulled away from her and said, “It’s so good to see you.” \\n\\n","sourceLink":"https://allnovel.net/in-dreams-the-dream-1/page-15.html","bookId":2783,"book":{"id":2783,"title":"In Dreams (The Dream #1)","description":"Storyline: In Dreams (The Dream #1) \\n When Katherine Johns starts dreaming about a boy she doesn\u0027t know, her college roommate Taylor is determined to find him. Convinced he must exist, Taylor is relentless... until she finds out exactly WHO the mysterious stranger really is. \\n The realization rocks the girls to their core and sends them down a path of unimaginable heartbreak as they learn to navigate their new reality. \\n Follow Katherine \u0026 Taylor\u0027s journey through love, friendship and tragedy in the first book of this emotionally captivating Young Adult series.\\n","cover":"https://allnovel.net/images/in-dreams-the-dream-1.jpg","author":"J. Sterling","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/in-dreams-the-dream-1.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:25:01 PM"}}
