{"id":87932,"no":23,"title":"Page 23","content":"Katherine did as she was told. The cards felt stiff in her hands and she wasn’t sure if she should shuffle them like a regular card deck, or some other way. She decided to gently insert half the deck into the other half, never letting the cards touch anything but her hands and the air around them.\n “When you feel like you have shuffled enough, place the cards down in front of me. Then cut the deck once, any way you’d like.”\n Katherine glanced back at Sophia who watched the tarot lady with intense curiosity. Kat placed the cards in front of the woman and cut them into two uneven stacks.\n The reader took a deep breath and closed her eyes before placing the split cards on top of one another. She turned over the first card. The dreamer. The woman took a deep breath and then answered someone only she could hear, with a nod of her head.\n The woman looked at Katherine with concern. “You are being haunted in your dreams by a great love. Oh yes, he loves you very much. And you love him as well.”\n Katherine’s heart leapt. Not wanting to give anything away, she maintained her composure.\n The woman continued to speak slowly and with caution. “There is much confusion around this person and...I see that you can’t be with him, or he can’t be with you?” The woman glanced up at Katherine with unease.\n She turned over another card and said, “Oh, but there is another boy who is fighting for your affections. He is handsome and strong and cares for you, too.”\n Katherine freaked out. Never in her life had a reader come so close to her actual reality. “There is much sadness and confusion surrounding you lately.” The woman took a breath. “And a decision will have to be made between these two boys.”\n The woman didn’t look up from the table as she spoke. She focused on the cards before her and the information she seemed to receive. “Your hand will be forced.”\n Katherine hung on to every word that spilled out of the stranger’s mouth. “Yes, unfortunate events will occur, I’m sorry to say. The decision must be made or it will be made for you.”\n “Unfortunate events? What do you mean?” Katherine interrupted, as her voice shook nervously.\n “I’m sorry, child, the cards don’t tell me everything. But I see there will be no other choice.”\n “What do you mean?”\n “When certain events occur, you will have to make a decision. There will be no other way. You will have to choose one.”\n The gray-haired woman shook her head and looked into Katherine’s eyes before saying, “I’m sorry, that’s all the information I’m getting.” She took Katherine’s hand in hers and looked steadily at her palm. “You’ve lived many lives. You’re a very old soul.”\n She peered into Katherine’s eyes. “But you already know this,” the woman smiled warmly.\n Katherine was rattled as she handed the woman a twenty dollar bill, smiled slightly and said, “Thanks.”\n “Did you want a reading as well, dear?” the woman asked Sophia with a smile.\n “I think I’ll pass,” Sophia waved her off, noticing the look on Katherine’s face.\n “Hungry?” Sophia asked.\n Katherine snapped back into reality and looked at her friend’s face before muttering, “Kind of.”\n “Well I’m starved, so you’re coming with.” The girls walked the path toward a small café with outdoor seating. They sat down at a table that faced the water. Katherine stared at the ocean and silently replayed what the woman had told her.\n “What the hell was that? Who are the guys she was talking about? And what about the haunting dreams? That was weird,” Sophia wanted information.\n Katherine couldn’t hide the fact that she was freaked out. She tried her best to play it off. “Well, she was definitely talking about Cooper. He’s the hockey player I told you about.”\n “And the other guy?” Sophia wondered.\n “I don’t know. I think she meant my roommate’s brother. I sort of have a crush on him.” Katherine figured a few white lies wouldn’t hurt. Plus, she had no idea how to explain Austen to Sophia.\n “When she said unfortunate events, that kinda freaked me out.”\n “Me too.”\n “You don’t think you’re going to die or something, do you?” Sophia asked semi seriously.\n “Well…I didn’t.” Katherine was even more worried than before.\n “I’m just saying. She was freaky. Don’t die, k?”\n “I’ll do my best.”\n “Wonder who you’re going to choose?” Sophia smiled and Katherine shrugged her shoulders.\n “Guess we’ll see.” Katherine tried desperately to change the subject. “Tell me all about Arizona.”\n Sophia’s face changed as she talked a mile a minute. She would talk her own shadow’s ear off if she could. The rest of their lunch and walk home were filled with talk of Arizona, fraternities, guys, and parties. They stopped on the corner of their street and hugged goodbye.\n “I’ll call you later,” Sophia said as she walked in the opposite direction.\n “K. Thanks for lunch.”\n Katherine’s house was empty and she was thankful for the quiet. Her phone beeped with the sound of a text message. It was Cooper again. “Hope everything is good. Just thinking about you.”\n “It is. Thanks. Hope you’re well. Tell your parents hello for me.” She longed to tell him so much more, but stopped herself.\n Katherine couldn’t stop thinking about what the tarot reader had said. She sat in her new back yard as the words replayed in her mind.\n She must have dozed off because Austen suddenly appeared next to her.\n “That was some tarot card reading today,” he said as he nuzzled into her.\n She was surprised to see him there, in her back yard, instead of their usual meeting place. “What did she mean, Austen? Do you know? Is something bad going to happen?”\n He hushed her gently to comfort her. “It’s going to be okay. Don’t worry.”\n “Don’t worry? Austen, she said ‘unfortunate events’…those aren’t fun and happy words. Something bad is going to happen.”\n “You don’t know that. She could be wrong.”\n “But she knew about you. And Cooper. And...”\n Austen cut her off, “I know. I heard. But the future can be changed, Katherine.”\n “What do you mean?” she asked.\n “Nothing is set in stone. Events may be headed in one direction at the time, but you can change your course. And that changes your direction.”\n “So then it doesn’t have to happen the way she said?”\n “No,” he said reassuringly.\n “So it can all be changed then?” Katherine breathed in relief.\n “Yes.”\n “Well, that’s good.” She looked into Austen’s eyes and suddenly changed her tone. “How are you?”\n He laughed at the question. “I’m good. How are you?”\n She laughed as well at the absurdity of the question. “Better now, but I have a random question for you.”\n “Shoot.”\n “Have you seen Taylor at all? You know, since I left?”\n He smiled, “Yep.”\n “And? How is she?”\n “She’s fine. She’s Taylor. But she misses you.”\n “I miss her, too,” Katherine glanced downwards.\n “It’s going to be okay, Katherine.” He turned her face so she could watch him speak. “Once you get back to school, everything will be the way it was before.”\n “How do you know that? What if everyone hates me for how I’ve acted?” her eyes started to well up.\n “Listen to me.” She didn’t move. “No one hates you. Do you hear me?” She wanted to believe his words. “No one hates you,” he spoke clearly and slowly.\n “I have been such a jerk to Taylor. And I’ve completely ignored Cooper.”\n “But not since you’ve been back home, right?”\n She shook her head, “No.”\n “See, everything is already getting better.” He smiled at her lovingly.\n “I guess so.”\n “Katherine. When people care about you the way Taylor and Cooper do, it doesn’t take much for them to forgive you. They’re just worried about you. Of course Cooper has no idea what’s going on, so he’s just really confused.”\n It still made Katherine cringe when Austen brought up Cooper’s name. She never understood how he could be so calm about the whole thing. She expected him to hate Cooper, or at least want to hate him. But he didn’t seem to.\n “You’re right,” she said.\n “Finally, something we can both agree on.” He half smiled and she smiled back.\n Her eyes opened to the sound of grocery bags being set on the counter and her mother’s voice calling her name. “I’m out back, Mom.”\n Her mom poked her head out the back door. “I wasn’t sure if you’d be back from the beach yet. How was Sophia?”\n “She’s great. Do you need help?” Katherine started to get up out of the oversized chair.\n “No, no. I’ve got it. You enjoy the yard.”\n Katherine repositioned herself and grabbed her cell phone. She was nervous but relief immediately washed over her when Taylor answered the phone excitedly. They spoke briefly, but it was enough to set Katherine’s worried mind at ease. She apologized again for her behavior and Taylor accepted without hesitation. Austen had been right. It wouldn’t take much to mend their relationship because it hadn’t truly been broken in the first place.\n Katherine felt like she truly knew the meaning of the saying “Distance makes the heart grow fonder” as the days flew into weeks. She missed Taylor’s company every day and she was surprised by how much she genuinely missed Cooper.\n She thought of him often, but never told him. She knew she owed him so much more than a stupid text message after everything that had happened and she wasn’t about to have that conversation over the phone. Everything she needed to tell him needed to be said in person.\n Katherine packed up the last of her things, gave her mom one last hug, and waited as her dad backed up the car.\n “Call me when you land.” Her mother gave her another squeeze that took the breath out of her.\n “You’re going to squeeze me to death, Mom,” Katherine choked out.\n “Have fun at school, but not too much. Get your grades back up.”\n “I will. I promise.” Katherine had reassured her parents many times that her lapse in grades was only temporary and she’d work extra hard to get them back up to where they needed to be.\n “I love you,” her mom said.\n “Love you too, Mom,” Katherine walked toward the car where her father waited.\n Chapter Fourteen\n Taylor picked Katherine up from the airport and when they saw each other, they squealed and then cried.\n “I’m so sorry for the way I acted before break, Taylor.” Katherine felt like a horrible friend. \n","sourceLink":"https://allnovel.net/in-dreams-the-dream-1/page-23.html","bookId":2783,"book":{"id":2783,"title":"In Dreams (The Dream #1)","description":"Storyline: \n In Dreams (The Dream #1) \n When Katherine Johns starts dreaming about a boy she doesn\u0027t know, her college roommate Taylor is determined to find him. Convinced he must exist, Taylor is relentless... until she finds out exactly WHO the mysterious stranger really is. \n The realization rocks the girls to their core and sends them down a path of unimaginable heartbreak as they learn to navigate their new reality. \n Follow Katherine \u0026 Taylor\u0027s journey through love, friendship and tragedy in the first book of this emotionally captivating Young Adult series.\n \n","cover":"https://allnovel.net/images/in-dreams-the-dream-1.jpg","author":"J. Sterling","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/in-dreams-the-dream-1.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:25:01 PM"}}
