{"id":87940,"no":31,"title":"Page 31","content":"Danny moved at the sound and stood up when he saw Cooper’s eyes were open. “Oh man. Good to see you. Don’t ever do that to me again.” Danny hugged his best friend.\\n\\n “Yeah. Sorry about that.” Cooper half smiled.\\n\\n Katherine heard familiar footsteps heading toward her. She sat in the corridor with tears rolling down her face. Austen sat down next to her and kissed her cheek. “Did you hear?”\\n\\n “Every word.” She smiled at him.\\n\\n “So then. I guess I’ll be seeing you around.”\\n\\n “I guess so,” she responded with happiness.\\n\\n Austen stood up to leave. “Austen?” He stopped. “Thank you so much...for saving Cooper’s life...for making mine worth living…for everything.”\\n\\n “You’re welcome. And thank you for loving me.”\\n\\n As he walked away, she opened her eyes.\\n\\n Chapter Nineteen\\n\\n Katherine sat at the foot of Cooper’s bed and waited for him to wake up. Danny and Taylor headed back to the lake house to get some real sleep and pack up their things. Cooper started to stir and he accidentally kicked her.\\n\\n “Sorry,” he said, as he opened his eyes.\\n\\n “Cooper!” She leaned down to kiss his cheek.\\n\\n “Hey there, California,” he smiled at her.\\n\\n “I’m so happy you’re okay.” She couldn’t believe she had almost lost him.\\n\\n “Me too. What a crazy day.”\\n\\n “No kidding.” She wasn’t sure if he remembered anything or not.\\n\\n But when Cooper said, “That Austen is one really great guy,” she knew he remembered everything.\\n\\n “So are you, Cooper Donovan.”\\n\\n …Two Months Later …\\n\\n Cooper skated around the ice as if he had never had to battle for his life. He led his team to the state championships and broke the school record for goals scored in a single game. Katherine cheered like crazy from her seat next to Taylor.\\n\\n The girls waited for the guys to get out of the locker room and Katherine marveled at how perfect her life had turned out. The locker room door opened and out walked her handsome hockey star. He threw his arms around her and kissed her head. “I’m starving. Please tell me you’ll feed me, woman.”\\n\\n She laughed. “I don’t know, you were kind of a showoff tonight on the ice. It’s really rude.”\\n\\n “Rude?” he mocked.\\n\\n “Yeah. There’s a whole team out there, Donovan, geez. Not like you have to go breaking records all on your own. You could let other guys on the team feel like their presence is at least necessary. See? Rude.”\\n\\n “I’ll show you rude.” He picked her up and swung her around while other couples looked on.\\n\\n The entire campus knew what happened that weekend at the lake house, but no one ever mentioned it, at least not directly to them. There were articles about it in various papers and the college had published in-depth interviews with both Katherine and Cooper. But no one other than Taylor and Danny knew the whole truth, the truth that included what Austen had done.\\n\\n “I love you, Katherine Johns.”\\n\\n “And I love you, Cooper Donovan.”\\n\\n He kissed her as Austen’s image popped into her mind. She didn’t flinch or pull away. She simply thought of Austen with love. He smiled at her and her heart felt warm and full.\\n\\n “Everything all right?” Cooper asked, as he pulled away.\\n\\n “It’s perfect,” she said, touching the side of his face.\\n\\n “Tell Austen ‘hi’ for me,” he said, and winked at her.\\n\\n Her mouth fell open in surprise, and she asked, “How’d you know?”\\n\\n He smiled at her as they walked hand in hand toward Dom’s restaurant as Danny and Taylor followed close behind.\\n\\n The End \\n\\n","sourceLink":"https://allnovel.net/in-dreams-the-dream-1/page-31.html","bookId":2783,"book":{"id":2783,"title":"In Dreams (The Dream #1)","description":"Storyline: In Dreams (The Dream #1) \\n When Katherine Johns starts dreaming about a boy she doesn\u0027t know, her college roommate Taylor is determined to find him. Convinced he must exist, Taylor is relentless... until she finds out exactly WHO the mysterious stranger really is. \\n The realization rocks the girls to their core and sends them down a path of unimaginable heartbreak as they learn to navigate their new reality. \\n Follow Katherine \u0026 Taylor\u0027s journey through love, friendship and tragedy in the first book of this emotionally captivating Young Adult series.\\n","cover":"https://allnovel.net/images/in-dreams-the-dream-1.jpg","author":"J. Sterling","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/in-dreams-the-dream-1.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:25:01 PM"}}
