{"id":83149,"no":5,"title":"Page 5","content":"I didn\u0027t know what to say, so I didn\u0027t say a thing. Instead, we stood there until we heard the screen door behind us screech and slam. A minute later a helicopter appeared on the horizon and dipped, its whirling blades sending ripples across the quiet lake before landing somewhere in the forest.\n The wind grew cooler. Macey wrapped her good arm around herself and shivered in the breeze, but she didn\u0027t move from the end of the dock.\n Her name was probably on every newscast in America. It wasn\u0027t hard to imagine that, back in Boston, a room full of interns was buzzing about speeches that had to be rewritten and commercials that had to be recut. The campaign had a new star—a new angle. But all of that felt like another world, so I just stood by my friend and thought for the first time ever that Joe Solomon was wrong about something.\n I hadn\u0027t come away in worse shape than Macey McHenry.\n Not by a long shot.\n Chapter Five\n I know the sounds my school makes—the squeaky steps and creaking doors, the hushed voices during finals week, the noisy chaos of the Grand Hall before dinner. The first day of a new year has a sound all its own, as limos turn down the winding lane and car doors slam, suitcases bang against banisters, and girls squeal and hug hello.\n But the first semester of my junior year…That semester started with a whisper so quiet I almost didn\u0027t hear it.\n \"Is Macey taking the semester off?\" one senior asked another as they stood huddled in the hall outside the library.\n \"I heard they had to amputate Macey\u0027s arm and replace it with a bionic limb that Dr. Fibs made in his lab,\" an eighth grader said when I passed by the door to their common room.\n Gallagher Girls spend their free time scattered throughout the four corners of the world, but that year every girl who returned from summer break brought back the same questions. So I kept moving, roaming the quiet halls like a shadow, right up until the point when I turned the corner and ran into Tina Walters.\n \"Cammie!\" Tina cried, and in the newfound quiet of our school, the word echoed. She threw her arms around me. \"You\u0027re okay!\" she proclaimed, and then she reconsidered. \"You are okay, aren\u0027t you?\"\n \"Yeah, Tina, I\u0027m—\"\n \"Because I heard you killed one of them with a campaign button?\"\n Tina is a teenage girl, and a spy-in-training, and the only daughter of one of the country\u0027s premiere gossip columnists, so it\u0027s not surprising that she has crazy theories. A lot of them. All the time. But in that second, my mind flashed back to the sunny roof. I saw the shadows of the spinning blades, felt the hands that gripped my shoulders, and then heard the pained cry as I jabbed the Winters-McHenry button into a hand wearing a ring that I was sure I\u0027d seen before.\n \"Cam?\" Tina asked, but I just nodded.\n \"Yeah, Tina.\" My throat felt strange, as I said it. \"Something like that.\"\n And then I walked away.\n When you\u0027re known as the Chameleon, sometimes it can feel like your whole life is just an elaborate game of hide-and- seek. Fortunately, I am very good at hiding. Unfortunately, my best friends are very good at seeking.\n \"Cam!\" someone called through the shadows. \"We know you\u0027re in here.\" The voice was soft and Southern, the footsteps so dainty that I knew there could only be one person tiny enough to creep over those particular floorboards without making a sound.\n \"Oh, Cammie,\" Liz practically sang, as she crept down the ancient corridor that (I think) had once been a pretty important part of the Underground Railroad, and had more recently served a far less noble covert purpose.\n \"I thought we\u0027d find you here,\" another voice said. My second roommate pushed her way out of the shadows.\n If possible, I think Liz had gotten even tinier and Bex had gotten even prettier over the summer break. Liz\u0027s blond hair was almost totally white from spending all summer in the sun. Bex\u0027s accent was stronger, like it always is after spending months with her parents in England. (Of course, Bex swore that she\u0027d spent a good portion of that time actually doing surveillance with MI6 in an African nation that shall remain nameless.) Her dark skin glowed and her hair was longer than it had been at the start of the summer.\n \"Isn\u0027t it a tad early in the semester for hiding, darling?\" Bex tried to tease. I tried to smile.\n \"What gave me away?\" I asked.\n \"Irregular dust patterns outside the entrance,\" Bex said. \"You\u0027re getting sloppy.\" And then she stopped. Strong Bex, brave Bex, seemed to recoil when she realized what she\u0027d said- \"I didn\u0027t mean…\"\n \"It\u0027s okay, Bex,\" I told her.\n \"You weren\u0027t sloppy!\" Bex blurted again.\n Then Liz jumped in. \"Everyone\u0027s talking about how great you were—about how, if you hadn\u0027t been there …\" But she didn\u0027t finish, which was just as well. No one wanted to think about how that sentence had to end.\n Bex eased onto one of the overturned crates and boxes that filled the room. \"Have you seen her?\"\n \"Not since the day after. They brought us to Mr. Solomon\u0027s lake house, but then they took her back to her parents.\"\n \"She is coming back,\" Liz asked. \"Isn\u0027t she?\"\n \"I don\u0027t know,\" I said with a shrug.\n \"I mean … they wouldn\u0027t want her to stay with them all the time, would they? They\u0027d want her here, where she\u0027s safe?\"\n \"I don\u0027t know, Liz,\" I said, sharper than I\u0027d meant. \"I mean … I don\u0027t know if she\u0027s coming,\" I said, more softly. \"I don\u0027t know who tried to do this or why or … I just don\u0027t know,\" I whispered again, then turned to look out the tiny circular window.\n \"She invited me.\" Bex\u0027s voice cut through the silence. \"Before the convention, she called our flat and asked me to come, but my mum and dad were home, and I…\" Bex trailed off, not knowing, I guess, that wanting to be with your parents isn\u0027t actually a sign of weakness. \"I should have been there.\" She didn\u0027t sound envious about missing out on a good fight. Instead, she sounded guilty.\n \"Me too,\" Liz said, sinking to the dusty floor. \"When she called, my mom said I could go, but I only had a few days left with my parents, so I said no.\"\n I nodded. We all thought we\u0027d have the better part of a year to spend together, hut in any life—especially a spy\u0027s life—tomorrow is never guaranteed.\n And there you have it—the most important thing any of us had learned over our summer vacation.\n \"Tina Walters says Macey\u0027s parents have hired an ex- Navy SEAL to pose as a Sherpa and hide Macey out in the Himalayas until the election is over,\" Liz offered.\n \"Yeah, well Tina Walters says a lot of things. Tina Walters is usually wrong,\" Bex replied. But I thought about how close Tina had been with her campaign button theory; I remembered that Tina had been saying for years that there was an elite boys\u0027 school for spies, and we\u0027d all thought that was a crazy rumor until last semester when a delegation from the Blackthorne Institute had moved into the East Wing, just a few feet from where we now sat.\n So I looked around the empty dusty space and said, \"Not always.\"\n Last spring, finding out who those boys were and whether or not they could be trusted had seemed like the most important mission of our lives. Charts of surveillance summaries and patterns of behaviors still lined the walls of our former operation headquarters, but the tape was starting to lose its hold. The wires still ran to the East Wing, a reminder of the days when boys from the Blackthorne Institute had seemed like a mission—back when missions had been about getting us ready for the real world; before the real world cornered us on a rooftop in Massachusetts.\n Liz must have followed my gaze and read my mind, because I heard her say, \"Have you heard from…you know…Zach?\"\n I thought back to the swirling images that had filled my mind before I\u0027d blacked out, and almost asked, \"Do hallucinations after a head injury count?\" But I didn\u0027t because A) I may very well have been going crazy. And B) for a Gallagher Girl, \"Boy crazy\" might be the most dangerous kind of crazy there is.\n So instead I turned to look out the window and watched the long line of limousines winding down Highway 10, carrying my classmates back to the safety of our walls.\n It was the same scene I\u0027d witnessed for years—the same cars, the same girls. But in the next instant the scene totally changed. Vans—dozens of them—sped down the highway, skidding into ditches on the side of the road. People bolted out and started adjusting satellite dishes and equipment. Helicopters swarmed around the school.\n \"Oh. My. Gosh,\" I mumbled, still staring, feeling Bex and Liz crowd around the window on either side of me. I looked at my best friends as sirens began screeching through the still, quiet air: \"CODE RED CODE RED CODE RED.\"\n \"What does it mean?\" Liz screamed. Bex and I just smiled.\n \"Macey\u0027s coming home.\"\n Chapter Six\n It doesn\u0027t take a genius to know that the whole world can change in an instant, and as soon as I hurried out of the secret passageway and into the second-floor corridor I could see and hear and feel the difference. For days the halls had felt like a tomb. But now, instead of stone silence, the whole school was on fire (without actually burning, of course).\n Red lights flashed and blurred. To my right, a poster advertising the chance to spend a semester in Paris slid down over a display of secret writing techniques used through the ages (which wasn\u0027t entirely necessary since, this month, it was featuring invisible ink).\n As we ran past the Encryption and Encoding department, I saw the plaque on the door flipping over to read Ivy League Liaison Office.\n Our school was going undercover, pulling on its disguises as deftly as any seasoned operative can do, and as Bex, Liz, and I ran against a current of eighth graders on their way to stand guard outside the Protection and Enforcement barn, I couldn\u0027t help but smile. After all, it had been three hundred and sixty-four days since Macey had come to us during a Code Red. It seemed only fitting that she would come back to us in one.\n But as we ran through the Hall of History, I watched Gillian Gallagher\u0027s sword disappear into the case that holds our deepest treasure, and something hit me: we wouldn\u0027t have a Code Red for Macey,\n We were having a Code Red for Macey and whoever was coming with her.\n The door to my mother\u0027s office eased open. Inside, I saw our headmistress, wearing her best suit and a grim expression. \"I guess we\u0027re ready for our close-ups?\" she was saying.\n As soon as we stepped into the office I heard more voices.\n \"Now America waits for its first glimpse of Macey McHenry, the brave young woman who has so recently been thrust into the spotlight—and into danger.\"\n (Evidently, one of the Code Red precautions for making the headmistress\u0027s office look like a regular school is to add a TV.)\n Bex flipped through channel after channel until we came to the image that made us all freeze.\n \"And here we are,\" a tall correspondent said into a microphone as she strolled down a familiar stretch of Highway 10, \"outside the gates of the Gallagher Academy for Exceptional Young Women, where one exceptional young woman will be returning shortly, after the most traumatic incident of her life. And the question remains: Will these walls be enough to keep Macey McHenry safe?\" \n","sourceLink":"https://allnovel.net/don-t-judge-a-girl-by-her-cover-gallagher-girls-3/page-5.html","bookId":2748,"book":{"id":2748,"title":"Don\u0027t Judge a Girl by Her Cover (Gallagher Girls #3)","description":"Storyline: \n Don\u0027t Judge a Girl by Her Cover (Gallagher Girls #3) \n When Cammie \"The Chameleon\" Morgan visits her roommate Macey in Boston, she thinks she\u0027s in for an exciting end to her summer break. After all, she\u0027s there to watch Macey\u0027s father accept the nomination for vice president of the United States. But when you go to the world\u0027s best school (for spies), \"exciting\" and \"deadly\" are never far apart. Cammie and Macey soon find themselves trapped in a kidnappers\u0027 plot, with only their espionage skills to save them. \n As her junior year begins, Cammie can\u0027t shake the memory of what happened in Boston, and even the Gallagher Academy for Exceptional Young Women doesn\u0027t feel like the safe haven it once did. Shocking secrets and old flames seem to lurk around every one of the mansion\u0027s corners as Cammie and her friends struggle to answer the questions, Who is after Macey? And how can the Gallagher Girls keep her safe? \n Soon Cammie is joining Bex and Liz as Macey\u0027s private security team on the campaign trail. The girls must use their spy training at every turn as the stakes are raised, and Cammie gets closer and closer to the shocking truth.\n \n","cover":"https://allnovel.net/images/don-t-judge-a-girl-by-her-cover-gallagher-girls-3.jpg","author":"Ally Carter","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/don-t-judge-a-girl-by-her-cover-gallagher-girls-3.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:49:30 PM"}}
