{"id":31542,"no":34,"title":"CHAPTER XXXIV. LIFE AT THE CALABOOZA","content":"A FEW days passed; and, at last, our docility was rewarded by some indulgence on the part of Captain Bob. He allowed the entire party to be at large during the day; only enjoining upon us always to keep within hail. This, to be sure, was in positive disobedience to Wilson\u0027s orders; and so, care had to be taken that he should not hear of it. There was little fear of the natives telling him; but strangers travelling the Broom Road might. By way of precaution, boys were stationed as scouts along the road. At sight of a white man, they sounded the alarm! when we all made for our respective holes (the stocks being purposely left open): the beam then descended, and we were prisoners. As soon as the traveller was out of sight, of course, we were liberated. Notwithstanding the regular supply of food which we obtained from Captain Bob and his friends, it was so small that we often felt most intolerably hungry. We could not blame them for not bringing us more, for we soon became aware that they had to pinch themselves in order to give us what they did; besides, they received nothing for their kindness but the daily bucket of bread. Among a people like the Tahitians, what we call \"hard times\" can only be experienced in the scarcity of edibles; yet, so destitute are many of the common people that this most distressing consequence of civilization may be said, with them, to be ever present. To be sure, the natives about the Calabooza had abundance of limes and oranges; but what were these good for, except to impart a still keener edge to appetites which there was so little else to gratify? During the height of the bread-fruit season, they fare better; but, at other times, the demands of the shipping exhaust the uncultivated resources of the island; and the lands being mostly owned by the chiefs, the inferior orders have to suffer for their cupidity. Deprived of their nets, many of them would starve. As Captain Bob insensibly remitted his watchfulness, and we began to stroll farther and farther from the Calabooza, we managed, by a systematic foraging upon the country round about, to make up some of our deficiencies. And fortunate it was that the houses of the wealthier natives were just as open to us as those of the most destitute; we were treated as kindly in one as the other. Once in a while, we came in at the death of a chiefs pig; the noise of whose slaughtering was generally to be heard at a great distance. An occasion like this gathers the neighbours together, and they have a bit of a feast, where a stranger is always welcome. A good loud squeal, therefore, was music in our ears. It showed something going on in that direction. Breaking in upon the party tumultuously, as we did, we always created a sensation. Sometimes, we found the animal still alive and struggling; in which case, it was generally dropped at our approach. To provide for these emergencies, Flash Jack generally repaired to the scene of operations with a sheath-knife between his teeth, and a club in his hand. Others were exceedingly officious in singeing off the bristles, and disembowelling. Doctor Long Ghost and myself, however, never meddled with these preliminaries, but came to the feast itself with unimpaired energies. Like all lank men, my long friend had an appetite of his own. Others occasionally went about seeking what they might devour, but he was always on the alert. He had an ingenious way of obviating an inconvenience which we all experienced at times. The islanders seldom use salt with their food; so he begged Rope Yarn to bring him some from the ship; also a little pepper, if he could; which, accordingly, was done. This he placed in a small leather wallet—a \"monkey bag\" (so called by sailors)—usually worn as a purse about the neck. \"In my opinion,\" said Long Ghost, as he tucked the wallet out of sight, \"it behooves a stranger, in Tahiti, to have his knife in readiness, and his castor slung.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2829/78086.html","bookId":1242,"book":{"id":1242,"title":"Omoo: Adventures in the South Seas","description":"简介： IT WAS the middle of a bright tropical afternoon that we made good our escape from the bay. The vessel we sought lay with her main-topsail aback about a league from the land, and was the only object that broke the broad expanse of the ocean....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2829","creation":"Aug 1, 2019 12:24:42 AM","modification":"Aug 1, 2019 12:24:42 AM"}}
