{"id":31555,"no":47,"title":"CHAPTER XLVII. HOW THEY DRESS IN TAHITI","content":"EXCEPT where the employment of making \"tappa\" is inflicted as a punishment, the echoes of the cloth-mallet have long since died away in the listless valleys of Tahiti. Formerly, the girls spent their mornings like ladies at their tambour frames; now, they are lounged away in almost utter indolence. True, most of them make their own garments; but this comprises but a stitch or two; the ladies of the mission, by the bye, being entitled to the credit of teaching them to sew. The \"kihee whihenee,\" or petticoat, is a mere breadth of white cotton, or calico; loosely enveloping the person, from the waist to the feet. Fastened simply by a single tuck, or by twisting the upper corners together, this garment frequently becomes disordered; thus affording an opportunity of being coquettishly adjusted. Over the \"kihee,\" they wear a sort of gown, open in front, very loose, and as negligent as you please. The ladies here never dress for dinner. But what shall be said of those horrid hats! Fancy a bunch of straw, plaited into the shape of a coal-scuttle, and stuck, bolt upright, on the crown; with a yard or two of red ribbon flying about like kite-strings. Milliners of Paris, what would ye say to them! Though made by the natives, they are said to have been first contrived and recommended by the missionaries\u0027 wives; a report which, I really trust, is nothing but scandal. Curious to relate, these things for the head are esteemed exceedingly becoming. The braiding of the straw is one of the few employments of the higher classes; all of which but minister to the silliest vanity. The young girls, however, wholly eschew the hats; leaving those dowdy old souls, their mothers, to make frights of themselves. As for the men, those who aspire to European garments seem to have no perception of the relation subsisting between the various parts of a gentleman\u0027s costume. To the wearer of a coat, for instance, pantaloons are by no means indispensable; and a bell-crowned hat and a girdle are full dress. The young sailor, for whom Kooloo deserted me, presented him with a shaggy old pea-jacket; and with this buttoned up to his chin, under a tropical sun, he promenaded the Broom Road, quite elated. Doctor Long Ghost, who saw him thus, ran away with the idea that he was under medical treatment at the time—in the act of taking, what the quacks call, a \"sweat.\" A bachelor friend of Captain Bob rejoiced in the possession of a full European suit; in which he often stormed the ladies\u0027 hearts. Having a military leaning, he ornamented the coat with a great scarlet patch on the breast; and mounted it also, here and there, with several regimental buttons, slyly cut from the uniform of a parcel of drunken marines sent ashore on a holiday from a man-of-war. But, in spite of the ornaments, the dress was not exactly the thing. From the tightness of the cloth across the shoulders, his elbows projected from his sides, like an ungainly rider\u0027s; and his ponderous legs were jammed so hard into his slim, nether garments that the threads of every seam showed; and, at every step, you looked for a catastrophe. In general, there seems to be no settled style of dressing among the males; they wear anything they can get; in some cases, awkwardly modifying the fashions of their fathers so as to accord with their own altered views of what is becoming. But ridiculous as many of them now appear, in foreign habiliments, the Tahitians presented a far different appearance in the original national costume; which was graceful in the extreme, modest to all but the prudish, and peculiarly adapted to the climate. But the short kilts of dyed tappa, the tasselled maroes, and other articles formerly worn, are, at the present day, prohibited by law as indecorous. For what reason necklaces and garlands of flowers, among the women, are also forbidden, I never could learn; but, it is said, that they were associated, in some way, with a forgotten heathen observance. Many pleasant, and, seemingly, innocent sports and pastimes, are likewise interdicted. In old times, there were several athletic games practised, such as wrestling, foot-racing, throwing the javelin, and archery. In all these they greatly excelled; and, for some, splendid festivals were instituted. Among their everyday amusements were dancing, tossing the football, kite-flying, flute-playing, and singing traditional ballads; now, all punishable offences; though most of them have been so long in disuse that they are nearly forgotten. In the same way, the \"Opio,\" or festive harvest-home of the breadfruit, has been suppressed; though, as described to me by Captain Bob, it seemed wholly free from any immoral tendency. Against tattooing, of any kind, there is a severe law. That this abolition of their national amusements and customs was not willingly acquiesced in, is shown in the frequent violation of many of the statutes inhibiting them; and, especially, in the frequency with which their \"hevars,\" or dances, are practised in secret. Doubtless, in thus denationalizing the Tahitians, as it were, the missionaries were prompted by a sincere desire for good; but the effect has been lamentable. Supplied with no amusements in place of those forbidden, the Tahitians, who require more recreation than other people, have sunk into a listlessness, or indulge in sensualities, a hundred times more pernicious than all the games ever celebrated in the Temple of Tanee.","sourceLink":"http://novel.tingroom.com/duanpian/2829/78099.html","bookId":1242,"book":{"id":1242,"title":"Omoo: Adventures in the South Seas","description":"简介： IT WAS the middle of a bright tropical afternoon that we made good our escape from the bay. The vessel we sought lay with her main-topsail aback about a league from the land, and was the only object that broke the broad expanse of the ocean....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2829","creation":"Aug 1, 2019 12:24:42 AM","modification":"Aug 1, 2019 12:24:42 AM"}}
