{"id":39657,"no":17,"title":"CHAPTER XVI TWO OPINIONS","content":"Benny arrived at the chalet at a quarter to nine, and was shown immediately into the sitting-room. There he found Lily seated before her writing-table; but she had written no letters, and the note-paper was covered by meaningless hieroglyphics which her pen inscribed ceaselessly. \n \n Men are rarely observant when it is a question of knowing whether a woman is well or ill, and this good-natured engineer was no exception to a common rule. Had anyone called his attention to the extraordinary pallor of Lily\u0027s face, he would have admitted its significance; but, as it was, his desire to resume their conversation of the morning blinded him to the truth. He had come to know if she were ready to return to England; he found her determined upon another purpose altogether. \n \n \"I thought you\u0027d have done dinner by this time, Lady Delayne,\" he explained, \"and so I ventured to come in. It\u0027s a fine night outside, and good for walking. I half expected you to be down with the Palace people. They\u0027re dancing to-night, and they tried to run me in. But I\u0027m too old to prance round with yearlings, and so I told them. I\u0027d sooner drive an airship across the Mediterranean than steer some of the heavy-weights down yonder—yes, a hundred times. But I thought it might be different in your case.\" \n \n She did not smile; her manner arrested his words, and was an omen of her answer. Benny watched her rising from her chair as he would have watched an accusing figure about to approach him. She had discovered the truth—he was sure of it. \n \n \"Mr. Benson,\" she said slowly, \"why did you not deal more generously with me this morning?\" \n \n He did not shrink from it. The question appealed to his manhood, and resolution made him strong. He was glad, moreover, that the hour of suspense had passed; he would keep nothing from her now. \n \n \"I wanted to shield you,\" he rejoined very naturally. \"It was a man\u0027s part to do that. I wanted to keep trouble from you. Now I see my own foolishness. It couldn\u0027t be done, Lady Delayne. The whole place is talking of the affair; you were bound to hear of it. But I did my best, because I wanted to be your friend.\" \n \n She knew that it was true, and his frankness disarmed her. The irony of life had left her with but one friend in the world, and he a man she had seen for the first time a week ago. It needed some resolution to keep her courage in the face of that. \n \n \"It was not friendship to deceive me,\" she said, against her convictions; \"so much might have happened. I am grateful to you, none the less. Will you now tell me all you know?\" \n \n She sat upon a sofa near to him, a lamp behind her, and her face in shadow. He perceived that she breathed heavily; but there was no other overt testimony either of fear or grief. \n \n \"I\u0027ll tell you willingly, every word,\" he rejoined. \"There\u0027s no doubt that Bothand and Co. got out a warrant in England against Sir Luton, and that the Swiss police, acting on instructions from Scotland Yard, traced him here. They sent an officer, Eugène Gaillarde, from Martigny, to ascertain if their man was at Vermala; he watched your husband for a couple of days. I think he may have followed him over from Grindelwald, but I do not know for sure. If they had established his identity, word would have been sent to London; most likely they would have arrested him, and applied for extradition. Anyway, it seems clear that Sir Luton knew he was being followed, and that he resented the fact just in the way such a man would resent it. As bad luck would have it, he seems to have met Gaillarde face to face on the plateau below the hotel. There were words passed between them, and then blows. What precisely befell we shall never know, but I make no doubt that Gaillarde lost his footing and was thrown over. He must have fallen about thirty-five feet and struck the clump of trees at the foot. I saw him there myself, lying stone dead, and that\u0027s how I came to warn your husband. If Sir Luton hadn\u0027t gone away, it would have been a murder charge. We may avoid that if they don\u0027t trace him, and time will put the affair in another light. It would be manslaughter at the worst—though I can\u0027t keep it from you that, whichever it is, it\u0027s bad enough in a country like this. What you and I have to do is to keep the thing black dark while we can. I\u0027ve sent Sir Luton where no police will find him, and if he\u0027s wise he will stay there until the worst has blown over. Then he ought to go to the East for a couple of years. We can tell a tale in the English papers if the truth ever does come out, and he won\u0027t want sympathisers. We hate bureaucrats in our country, and there\u0027s many who will understand just what happened in his case. It would be otherwise if they had taken him and brought the trial on immediately. I had to stop that at any cost—that\u0027s why I sent him into Italy. The same reason lay behind my idea that you should go to England. You are a danger to him here, Lady Delayne, so it seems to me. You are a danger every hour you remain, and if you would save him, you won\u0027t lose an hour in going away. I\u0027m glad that I can tell you so freely, for I couldn\u0027t this morning, much as I wanted to—\" \n \n He paused, a little afraid of his own eloquence. What impression he had made he did not know; but one thing was plain, and that was the woman\u0027s courage. There was no hysterical outburst now, no expression of a vain regret—nothing but a quiet determination which astonished him. \n \n \"I could never forget my obligation to you,\" she began; \"that must be lifelong. You say that I should return to England to save my husband; but surely it would be the wiser thing to remain. If they do not know all the facts, why should they seek Sir Luton Delayne? May we not hope that this question of identity will protect him to the end? Indeed, I am beginning to believe that my first duty is to him, to go to him, Mr. Benson, and to forget! If he were really guilty of a monstrous crime, it would be another thing. But can we believe that he is?—unless passion itself be such a crime. I cannot say that; his sins have been greatly punished, and am I to judge him at such an hour? Not so, surely. I will go to Italy whatever the cost. I feel it is my duty.\" \n \n He was amazed to hear her. His primitive knowledge of woman had prepared him for an issue so very different. She would have been humbled utterly by the disclosure, he thought, overwhelmed and incapable of any clear purpose. And here she was prepared for an act of madness which, whatever its sublimity, must bring down the house of his hopes with a crash. Let her go to Italy and the end might be at hand. Which is to say, that he doubted his own hypothesis, and put little faith in identity as an ally. Had not Sir Luton been followed from Grindelwald? Why, there would be twenty ready to bear witness. \n \n \"My dear lady,\" he said, hardly knowing how to put it to her, \"your wish does you great credit, but do not forget that if you are followed from here to Locarno, it will not take the authorities very long to guess what is going on. Perhaps I was wrong to advise a journey at all. The Swiss police are no fools. They will remember that this English lady came to spend some weeks at Andana; she took a chalet; she appeared to have settled down. Then she goes without warning. Suppose, upon the top of that, they remember that a certain Sir Luton Delayne left Grindelwald in a hurry—don\u0027t you think they are capable of getting at the truth? Why, he might be arrested in the next four-and-twenty hours; and if he were, God help him. No, it would be madness to go—madness to think of it. He\u0027s safe where he is, and there will be just two people in all Europe who share this secret. Let us leave well alone—we have done our best and can do no more.\" \n \n She saw the reason of it, but her distress was very great. All that she had suffered at her husband\u0027s hands went for nothing in the hour of cataclysm. In a way the defects of his character made a new appeal to her: his life might have been so very different; his intellect might have led him so far. And here he was, a veritable outcast, despised by all, a fugitive to be named with contempt, even by the vulgar. \n \n \"I know that you have done your best,\" she said, after some moments of silence, \"but what have I done? Can I justify the story of my own life since I left him—can a woman ever justify herself for leaving a man in the hour of his misfortunes? While the world went well with him, I suffered in silence. Is it possible for me to forget that he is alone, without friends or help? The world would say that his own acts justify me. Should a woman be guided by the world, or by her own conscience? No, indeed, I cannot agree with you; and yet your advice is wise. If they know, there is the end of it. I can do nothing; I must wait and hope. My gratitude to you remains—it will never be told truly, Mr. Benson; it could not be.\" \n \n He shrank from this expression as strong men ever shrink from a verbal recognition of their friendship. It may be that he perceived how much she really suffered, and what it cost her to hide the truth. The danger hovered about them both, and put a spell of its constraint upon their intercourse. In a spirited endeavour to make light of it, he told her that men would not judge Sir Luton hardly; and then he dwelt upon the security of his retreat in a villa upon the shore of Lake Maggiore. Though near to Locarno, its situation was one of some isolation, and it would serve their purpose beyond contention. The old woman who kept it had little English, and no curiosities. Generally speaking, he thought it as safe a haven as they were likely to find anywhere on the Continent, and, as he said, Sir Luton himself would use his eyes, and if there were danger, he would not fail to meet it. In brief, if things fell out as they had been planned, the secret need never pass the doors of the chalet. \n \n She agreed with this, though it was plain that her thoughts centred rather upon her own conception of duty than upon the peril of the situation. Insensibly she turned to the man where a man\u0027s work was to be done, and Benny encouraged her with a pride that burned. Yes, he would be the agent in the matter, if she would but leave it to him. He had no fear of the issue; let him enjoy her confidence and the rest was easy. \n \n \"We must keep his identity out of it,\" he repeated; \"all depends upon that. There is a little gendarme here—the brother of the man who was killed, and he is to be watched. Trust me to do so. I have had my eye on him from the start, and I shall not sleep much until he is on his way to Martigny again. If you see him, beware of the man: a little pale-faced fellow, with a serious air and a mincing manner—not the sort of man you suspect, but one who could be very dangerous. I would say nothing to him—not that he is likely to think of you; but you might meet him accidentally. When he\u0027s done with, the rest will be easy. We shall keep Sir Luton at the shanty for a month; then send him down to Monte Carlo. If they don\u0027t suspect him, the trouble will be over pretty quickly. I hope to God it will be!\" \n \n His optimism was splendid, and fearing a new note, he ended the interview upon it. She might rely upon him to bring her all the news, and meanwhile courage was necessary. When he left her, it was just a quarter-past ten, and he could hear the music at the Palace floating up the mountain-side in a dreamy rhythm which seemed in odd contrast with the secrecy and the fears of that interview. How bravely she had suffered it, and what big promises he had made! If they were not justified, what of it? He had done his best, and she had thanked him. He could almost feel the pressure of her fingers in his great hand now. \n \n He was alone upon the mountain-side and all the glory of the night about him. A flux of stars marked the Palace Hotel, every window of which paid tribute of warm light to the sheen of the spotless snow. Higher up there twinkled the minor constellations of Vermala; while away to the west arc-lamps marked the path to the Park and the slopes whereon the beginners kept carnival. These were the human aspects of the scene, but the majesty and solitude of the mountains remained impregnable, even in the half-lights; and looking out upon them, the man recalled his ambitions, the task he had set himself, and the hope which had deluded him. Would he find inspiration anew because of this thing which had come into his life? \n \n He turned with a sigh, and went on to his own house. A light burned in the workshop, and he discovered Jack and the abbé still at work there, but they put down their tools immediately and watched him with eager eyes. Had the woman spoken? Had she remembered her promise? They were all agog, and their desire to know would not be restrained. \n \n \"Well, Benny, and what did she say, my boy?\" \n \n \"Oh, we had a little talk about everything. What did you expect her to say, Jack?\" \n \n \"Then she didn\u0027t mention the prize?\" \n \n He opened his eyes wide. \n \n \"Why should she mention it?\" \n \n \"Well, you see, she promised to. She wants you to win it. We sent you down there on purpose. Do you mean to say she forgot all about it? How like a woman! And you thought she was interested; eh, Benny? you could have sworn she was.\" \n \n The abbé nodded his head sagely; then he sighed and resumed his work. Benny continued to look at them with wonder. A conspiracy. And she was interested and had forgotten. Well, after all, that was very natural in the circumstances—but if she had remembered! \n \n He did not answer Jack directly; but declaring that he was very tired, went off to bed. When he was gone, the abbé confessed to Jack that \"it was finished,\" and he also laid down his tools. \n \n \"We waste our time,\" he said. \"Your brother has lost interest. It is a pity, for he might have been one of the greatest men of our time.\" \n \n Jack thought so too. He would have given a good deal to have heard that this high and mighty lady was about to quit Andana. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1793/52162.html","bookId":1079,"book":{"id":1079,"title":"White Motley","description":"简介： The New House at Holmswell lies, far back from the road, upon the great highway to Norwich. Local topographers delight to tell you that it is just forty-five miles from that city and five from the Cesarewitch course at Newmarket. They are hardly less...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1793","creation":"Aug 1, 2019 12:24:20 AM","modification":"Aug 1, 2019 12:24:20 AM"}}
