{"id":79434,"no":12,"title":"Page 12","content":"\"Excuse me, Luscious Lips Lara?\" I enunciated politely while trying not to vomit in my mouth. Really, was it necessary for everyone to come up with a stupid ass nickname for themselves? That was the first thing Liz made everyone do when they got here. Come up with a sexual nickname for yourself using the first letter of your first name. And you were only allowed to call each other by those names all night. Luscious Lips Lara, Juicy Jenny, Raunchy Rachel, Tantalizing Tasha …. Who thought up this shit? Oh, that\u0027s right, Liz - my former best friend. The one who decided to start a sex toy business without telling me so she could con me into working for her. She should have let me come up with the names. Twat Face Tasha, Jizzbucket Jenny, Loose Labia Lara…those didn\u0027t make me want to jam a pencil in my eye. Liz finished up the rest of her stupid party while I imagined I was doing anything else but this, like getting a Brazilian wax, water boarded by Navy Seals or my big toe shot off at close range for a gang initiation. Any of those would be preferable to talking with complete strangers about lubrication, nipple clamps and anal beads. I gave her the silent treatment as we drove to the bar an hour later. I was offered an extra shift tonight that I couldn\u0027t pass up and Liz was going to keep me company in between customers. I should just open the car door and throw her out of the moving vehicle for what she did to me tonight, but I didn\u0027t want to ruin someone else\u0027s car if they ran her over. \"You can\u0027t ignore me forever, Claire. Quit being a dick,\" she complained. \"Speaking of dick...really, Liz? Sex toy parties? At what point in our friendship did you think I would EVER want to sell Pocket Pussies for a living? And another thing, Pocket Pussies? What kind of man needs something called a Pocket Pussy? Do men really need to release their seed out into the wild so much that they need to stick a fake vagina in their pocket that they can whip out at a moment\u0027s notice?\" Liz rolled her eyes at me and I resisted the urge to reach over the console and punch her in the vagina. Pussy Punch: when a Twat Tap just isn\u0027t enough. \"Claire, quit being such a drama queen. I don\u0027t expect you to sell my sex toys forever, just until I can hire a few more consultants. Think about it Claire, this is the perfect opportunity for us. What was the one thing you noticed that was missing from this party tonight?\" she asked, turning sideways in her seat to look at me as I got off at the exit for the bar. \"Dignity,\" I replied flatly. \"Funny. Snacks, Claire. Well, good snacks at least. They had bowls of chips and store bought cookies and enough liquor to choke a horse. These are women with money, Liz. Money they don\u0027t mind throwing away on Pocket Pussies for the husbands they don\u0027t want to screw anymore or clitoral stimulators for the \"friend\" they know whose husband has never given them an orgasm. What goes better with sex than chocolate?\" Sex and chocolate. My chocolate. My chocolate-covered yummy goodness that I couldn\u0027t sell as often as I liked because as a single mother working in a bar, it was hard to market yourself. The majority of people I was surrounded by cared more about who was buying the next round than what kind of desserts to have at their next party. \"The building I rented has the potential to be turned into two separate spaces. One of them with a kitchen,\" Liz continued. \"A very large kitchen where you can perform your magic and when women book their parties they can order dessert trays at the same time.\" I took my eyes off of the road long enough to look over and Liz, expecting to see a sarcastic smile on her face and waiting for her to say “Just kidding! Wouldn’t that be great though?” When none of that happened and she just sat there in her seat staring at me expectantly, I blinked back tears that I hadn’t even realized were forming in my eyes. “What are you talking about?” I whispered shakily in the dark car. “Okay so I did something big. Something that’s probably going to piss you off because you’re going to think it’s charity or pity, but really, all I did was get the ball rolling. The rest is up to you,” she explained. “I’ve looked everywhere for a building for my business and everyplace I see is too big or too small and way overpriced. My realtor called me a few weeks ago and told me the owners of Andrea’s Bakery right on Main Street came into some money and wanted to sell their space as quickly as possible, retire and move to Florida. It was like a sign, Claire. The price was right, the location is perfect and it’s exactly what we always dreamed about, minus the whole Justin Timberlake penis time share. With one sheet of drywall, we’ve got enough room for two connecting businesses: my sex toys and your desserts.” I bit my lip to stop myself from crying. I never cried. “But I really wanted to share JT’s penis with you,” I told her with a sad look, trying to take the seriousness out of this situation before I started to ugly cry. No one likes an ugly crier. It’s uncomfortable for all parties involved. After a few minutes of neither one of us saying a word in the dark car, Liz couldn’t take it anymore. “Will you say something already?” I let out a huge breath and tried to calm my racing heart. \"Liz I don\u0027t…I can\u0027t believe you…the money…\" She put her hand on my arm as we pulled into the parking lot of Fosters. \"Don\u0027t turn into a pansy-ass on me just yet. Take some time and think about it. You know the trust fund my grandfather left me has been eating its way through my pocket so we\u0027re not even going to discuss money right now. Talk it over with your dad, come and check out the kitchen at the store and then we\u0027ll talk. In the meantime, you\u0027re going to get your hot little ass in that bar and serve me up some cocktails. I\u0027ve got some new products to test out on Jim after your dad picks Gavin up later,\" she said with a wink before getting out of the car.","sourceLink":"https://allnovel.net/seduction-and-snacks-chocolate-lovers-1/page-12.html","bookId":1853,"book":{"id":1853,"title":"Seduction and Snacks (Chocolate Lovers #1)","description":"Storyline: Warning #1: This book is not to be taken seriously. Do not read this if you don\u0027t have the sense of humor of a 15 year old boy. Do not read this if you ARE a fifteen year old boy. This book is totally crude and inappropriate and uses the word \"vagina\" a lot. No, I mean A LOT. If you don\u0027t think people who are drunk are hilarious, you shouldn\u0027t read this book. You probably shouldn\u0027t read this book if you aren\u0027t drunk yourself. You should probably just put this book down and get drunk. You may think that no one in the world talks like the people in this book, but they do. They are called \"people who are funny and inappropriate\". This book is completely unrealistic; the author is aware of that fact and did it on purpose. 2012 Goodreads Choice Award Nominee - Best Romance Claire is a twenty-something, single mom that grudgingly helps her best friend sell sex toys while she attempts to make enough money to start her own business to give her foul-mouthed, but extremely loveable (when he’s asleep) toddler a better life. When Carter, the one-night-stand from her past that changed her life forever, shows up in her hometown bar without any recollection of her besides her unique chocolate scent, Claire will make it a point that he remembers her this time. With Carter’s undisguised shock at suddenly finding out he has a four-year-old son and Claire’s panic that her stretch marks and slim to none bedroom experience will send the man of her dreams heading for the hills, the pair will do whatever they can to get their happily ever after. Warning #2: contains explicit sex, profanity and enough sarcasm to choke a horse.","cover":"https://allnovel.net/images/seduction-and-snacks-chocolate-lovers-1.jpg","author":"Tara Sivec","type":"Humorous","source":"allnovel","link":"https://allnovel.net/seduction-and-snacks-chocolate-lovers-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:13:45 PM"}}
