{"id":79436,"no":14,"title":"Page 14","content":"The bartender ducked down behind the bar, and I forgot about cats pissing for a minute so I could stand up and lean over as far as I could without the bar stool flying out from under me to see if she needed help.\\n\\n And by \"help\" I meant checking to make sure she wasn\u0027t bleeding and then sitting back down to before the room tilted too far to the left and I made an ass of myself.\\n\\n My good deed ended before it began when a tiny little thing with long blonde hair, who looked strangely familiar, got behind the bar and walked over to the spot I was trying to see and looked down.\\n\\n \"Jesus, butterfingers, are you...\"\\n\\n She was cut off by a hand flying up from behind the bar, latching onto her forearm and yanking her down roughly. She disappeared with a yelp and I shook my head at why women were so weird. And such whores.\\n\\n Fuck you, Tasha. And f**k cats that don\u0027t piss in toilets. And f**k you, Keanu Reeves, and your dog.\\n\\n Drew sat back down next to me and yelled out, \"Yo, bartender!\"\\n\\n The girl with the blonde hair popped up suddenly from behind the bar with her mouth wide open, staring right at me.\\n\\n \"Can we get a couple shots of tequila?\" Drew asked her. She didn\u0027t even look in his direction, just stared at me without even blinking, like we were in some sort of f**king staring contest.\\n\\n I\u0027ll show her. I\u0027m the mother f**king king of staring contests.\\n\\n Drew leaned over and snapped his fingers in front of her face a few times.\\n\\n \"Hellloooo?\"\\n\\n Dammit! I blinked.\\n\\n But she never moved from her spot kneeling behind the bar with just her little head peaking over the top of it. What the f**k was wrong with this woman? She was starting to freak me out.\\n\\n \"Um, tequila please?\" I asked questioningly, enunciating each word as best as my drunken mouth would allow. So really, it came out as \"Ufff, shakira pea?\"\\n\\n A huge psychotic smile broke out on her face and she quickly stood up.\\n\\n \"So what can I get you?\" she asked me brightly, resting her hands on top of the bar and leaning into them.\\n\\n Drew and I slowly turned to face one another. We both shrugged and I turned back to look at her, but not before noticing that Drew was busy tucking his shirt back into his jeans.\\n\\n \"T-e-q-u-i-l-a,\" I said very slowly, wondering if this bartender was drunker than me.\\n\\n Her smile got bigger if that\u0027s even possible.\\n\\n \"Whiskey, coming right up!\"\\n\\n She quickly spun around and immediately tripped over what I assumed was the other bartender still down there picking up broken glass. Blondie caught herself from falling, huffed and reached down to pull the other girl up. There was some swearing, loud whispering and tugging back and forth before she was finally able to pull the other one up roughly. Her long, wavy brown hair hung in a curtain, obscuring her face as she stood there with her head down. More whispering and erratic hand gesturing continued between the two of them, then they each turned and stomped off in the same direction, both of them taking turns smacking the other in the arm as they walked away. My eyes went immediately to the brunette’s ass in the tiny black shorts as she walked away.\\n\\n “I hate to see you go, but I love watching you leave,” I said with a snort.\\n\\n Drew punched me in the arm and I reluctantly looked away from her great ass and long legs before I started drooling.\\n\\n \"So, did you strike out with the waitress?\" I asked him as we waited for whatever it was the chick decided to bring us to drink.\\n\\n \"No, I just f**ked her in the bathroom. She tasted like beef jerky and Captain Morgan. Strange, yet oddly satisfying. She threw up when she came though. She\u0027s got issues.\"\\n\\n \"How in the f**k has your dick not fallen off yet?\" I asked with disgust.\\n\\n \"Don\u0027t be a hater just because you dipped your wick in the same crotch-rot for two years. I like to test the waters, sample the merchandise. Plus, I\u0027ve got a stamp card for the Quickie Mart by my house. One more box of condoms and I get a free twenty ounce of Pepsi.\"\\n\\n The ladies were back with our drinks before I could come up with a clever retort. The short blonde with the staring problem slammed a bottle of Johnnie Walker Blue Label down on the bar, while the other one stood a few feet behind her with her hair still shading her face.\\n\\n \"So boys, what are we drinking to tonight?\"\\n\\n Since she wasn\u0027t staring at me like that creepy clown Pennywise from the movie \"It\" anymore, I figured she wasn\u0027t dangerous.\\n\\n \"If you share a drink with us, I might be inclined to tell you,\" I said with a wink.\\n\\n At least I thought it was a wink. She was looking at me funny, maybe I just squinted really hard. I tried again.\\n\\n Fuck, why was it so hard to f**king wink?\\n\\n \"Is something wrong with your face?\" she asked.\\n\\n I had been out of the game for too long. I couldn\u0027t even get drunk and flirt anymore. I could however, get drunk and look like a stroke victim. I just shook my head and pointed at the shot glasses, signaling her to pour them.\\n\\n \"You\u0027ll have to excuse my friend here,\" Drew said with a pat to my back. \"He\u0027s still morning the loss of a shitty girlfriend and he\u0027s not happy I made him go out instead of sitting at home watching \"Beaches\" and diddling his vagina.\"\\n\\n \"Shut up, dick-fuck,\" I muttered as I grabbed one of the shots the blonde poured.\\n\\n Turning her head, she called to the girl behind her. \"Get your sweet ass up here and do a shot with these lovely gentlemen.\"\\n\\n \"I\u0027m working, Liz. I can\u0027t drink,\" she said, gritting her teeth. \\n\\n","sourceLink":"https://allnovel.net/seduction-and-snacks-chocolate-lovers-1/page-14.html","bookId":1853,"book":{"id":1853,"title":"Seduction and Snacks (Chocolate Lovers #1)","description":"Storyline: Warning #1: This book is not to be taken seriously. Do not read this if you don\u0027t have the sense of humor of a 15 year old boy. Do not read this if you ARE a fifteen year old boy. This book is totally crude and inappropriate and uses the word \"vagina\" a lot. No, I mean A LOT. If you don\u0027t think people who are drunk are hilarious, you shouldn\u0027t read this book. You probably shouldn\u0027t read this book if you aren\u0027t drunk yourself. You should probably just put this book down and get drunk. You may think that no one in the world talks like the people in this book, but they do. They are called \"people who are funny and inappropriate\". This book is completely unrealistic; the author is aware of that fact and did it on purpose. \\n 2012 Goodreads Choice Award Nominee - Best Romance \\n Claire is a twenty-something, single mom that grudgingly helps her best friend sell sex toys while she attempts to make enough money to start her own business to give her foul-mouthed, but extremely loveable (when he’s asleep) toddler a better life. \\n When Carter, the one-night-stand from her past that changed her life forever, shows up in her hometown bar without any recollection of her besides her unique chocolate scent, Claire will make it a point that he remembers her this time. \\n With Carter’s undisguised shock at suddenly finding out he has a four-year-old son and Claire’s panic that her stretch marks and slim to none bedroom experience will send the man of her dreams heading for the hills, the pair will do whatever they can to get their happily ever after. \\n Warning #2: contains explicit sex, profanity and enough sarcasm to choke a horse.\\n","cover":"https://allnovel.net/images/seduction-and-snacks-chocolate-lovers-1.jpg","author":"Tara Sivec","type":"Humorous","source":"allnovel","link":"https://allnovel.net/seduction-and-snacks-chocolate-lovers-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:13:45 PM"}}
