{"id":79444,"no":22,"title":"Page 22","content":"“They suckered me into coming to give you guys a tour of the plant when it\u0027s over and introduce you to your foreman.\"\n \"As long as he leaves me alone and doesn\u0027t ride my ass, we\u0027ll get along just fine,\" Drew said.\n \"I thought you liked it when big, burly men rode your ass,\" I joked.\n \"You must have me confused with you and that new vagina you grew. Remind me again when the last time it was you got laid? Because I\u0027m pretty sure I got my dick wet last night while you barked like a dog and passed out in the parking lot.\"\n \"I don\u0027t think I\u0027d be bragging about tapping some girl\u0027s ass that has a meat-product nickname for her vagina,\" I reminded him.\n \"Yeah, that wasn\u0027t really my finest hour. I\u0027m so disappointed in myself I can practically taste it.\"\n \"Does it taste like se**n?\" I asked.\n \"Fuck you. She wasn\u0027t a dude,\" Drew replied, leaning back in his chair and crossing his arms in front of him.\n \"Jim, please tell me you know some hot girls,\" Drew begged.\n He let out a chuckle. \"You might be in luck boys; my fiancé has a few single friends.\"\n \"Don\u0027t worry about the pu**y here to the right of me,\" Drew said while Jim took a drink of his bottled water. \"He\u0027s been hung up on a one-night-stand he had five years ago with a girl that smelled like Cocoa Puffs.\"\n Jim spit out some of his water and started choking on the rest. Drew had to reach over and pat him on the back. After he recovered, he sat there staring at me funny.\n What the f**k is up with people staring at me lately? Last night at the bar and now today. There was something wrong with the people in this town.\n Just then, one of the supervisors walked in and shoved the sexual harassment video into the machine. Everyone started clapping and cheering as soon as the music started.\n \"Why don\u0027t you guys come over tonight for dinner and some drinks,\" Jim said over the rowdy employees as he started to turn back around to face the front of the room. \"My fiancé can see if you guys are worthy enough for her friends,\" he said with smirk.\n \"Hey, Claire, does this lube really taste like strawberry cheesecake?\"\n \"Um, sure,\" I replied.\n \"Does the Jack Rabbit hit your g-spot or do I need to get something else for that?\"\n \"Are you sure this massage oil candle burns cool? The last time my boyfriend and I tried hot oil his penis got second degree burns.\"\n Kill me. Just kill me right now.\n \"Where exactly do you put the c**k ring on a guy? We must not have put it in the right spot because after a few minutes it got lost in my vagina. That was an awkward emergency room trip, let me tell you.\"\n I\u0027m going to lose my shit if someone asks me one more f**king question that I can\u0027t answer. That\u0027s all anyone has been doing for the last half hour. FUCK! These people need to just buy something already and quit talking to me.\n \"Do you let a guy use a vibrator on you? I\u0027ve heard that\u0027s really hot.\"\n \"Okay look,\" I shouted, holding my hands up so they\u0027d shut their yaps. \"I have zero experience with any of this shit. I\u0027m only doing this as a favor to my friend so I can make some extra money for my new business. I have had exactly one and a half sexual partners in my life and they were both pretty shitty experiences. The first one was in college and we were both completely trashed, I never got his name and he knocked me up. The next one was a friend of mine, and I decided to try it again and see if got any better. His dad had a key to his house and walked in on us two thrusts in, which completely killed any mood that might have been started. I\u0027ve decided that my vagina is cursed. My orgasms have all been self-induced and have never been with anything that required batteries, a special cleaner, instructions or a weapon of mass destruction warning. If you want to place an order, I\u0027ll be in the kitchen. Try the chocolate-covered potato chips.\"\n I turned and stalked out of the room and straight into the kitchen. Where was a giant, gaping hole in the floor to swallow you up when you needed one? Every woman in there was probably talking about what a loser I was and how they were going to tell everyone they knew to never do business with us. Shit, Liz was going to fire me. I was going to have to tell people I got fired from selling dildos. I can\u0027t even sell fake cocks to a room full of horny women. How do you come back from that shit? And on top of it all, I just spilled my deepest, darkest secrets to a room full of strangers.\n \"Oh, honey, you poor thing,\" Jenny said as she hurriedly walked into the kitchen and threw her arms around me. One thing new people learned about me real quick - don\u0027t invade my personal space or you will get punched in the neck.\n I stood there stiff as a board with my arms out to the side. I don\u0027t understand huggers. I really don\u0027t. A nice, solid pat on the back worked just fine.\n \"I\u0027m buying you a Jack Rabbit,\" Jenny proclaimed.\n \"Whoa, no, really that\u0027s okay,\" I tried to argue as I pulled out of the hug. That thing scared the shit out of me. Four speeds, ears and beads that spun around. You should have to get a permit from the city to even power that thing up.\n After several minutes of cajoling, Jenny managed to pull me back into the living room, and after she announced that she was going to buy me a toy, the whole room erupted in agreement. Much to my mortification, all of them began commenting to one another about what they were going to buy me. I had to draw the line when they started talking about throwing me a Vibrator Virgin party. I heard the words penis-shaped ice cubes and penis pasta salad, and I started getting a headache from hell. Any moment now they were all going to join hands and sing Kumbaya to my vagina—my poor, unloved vagina that never knew the pulsating touch of a rubber penis. I\u0027m sorry vagina, I should have taken better care of you, I guess. \n","sourceLink":"https://allnovel.net/seduction-and-snacks-chocolate-lovers-1/page-22.html","bookId":1853,"book":{"id":1853,"title":"Seduction and Snacks (Chocolate Lovers #1)","description":"Storyline: \n Warning #1: This book is not to be taken seriously. Do not read this if you don\u0027t have the sense of humor of a 15 year old boy. Do not read this if you ARE a fifteen year old boy. This book is totally crude and inappropriate and uses the word \"vagina\" a lot. No, I mean A LOT. If you don\u0027t think people who are drunk are hilarious, you shouldn\u0027t read this book. You probably shouldn\u0027t read this book if you aren\u0027t drunk yourself. You should probably just put this book down and get drunk. You may think that no one in the world talks like the people in this book, but they do. They are called \"people who are funny and inappropriate\". This book is completely unrealistic; the author is aware of that fact and did it on purpose. \n 2012 Goodreads Choice Award Nominee - Best Romance \n Claire is a twenty-something, single mom that grudgingly helps her best friend sell sex toys while she attempts to make enough money to start her own business to give her foul-mouthed, but extremely loveable (when he’s asleep) toddler a better life. \n When Carter, the one-night-stand from her past that changed her life forever, shows up in her hometown bar without any recollection of her besides her unique chocolate scent, Claire will make it a point that he remembers her this time. \n With Carter’s undisguised shock at suddenly finding out he has a four-year-old son and Claire’s panic that her stretch marks and slim to none bedroom experience will send the man of her dreams heading for the hills, the pair will do whatever they can to get their happily ever after. \n Warning #2: contains explicit sex, profanity and enough sarcasm to choke a horse.\n \n","cover":"https://allnovel.net/images/seduction-and-snacks-chocolate-lovers-1.jpg","author":"Tara Sivec","type":"Humorous","source":"allnovel","link":"https://allnovel.net/seduction-and-snacks-chocolate-lovers-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:13:45 PM"}}
