{"id":79453,"no":33,"title":"Page 33","content":"Then I remembered the one time in middle school when I put a half-eaten Jolly Rancher on my dresser and somehow it fell into one of the drawers. Three socks, a pencil and a G.I. Joe guy were stuck to it when I found it a month later. Probably wasn\u0027t a good idea to put something like that anywhere near a vagina, especially Claire’s vagina. No harm should ever come to Claire’s vagina. I was probably imagining things, but I swear every time I glanced over at her she looked away quickly. It made me smile to myself thinking that she might be staring at me too. I knew Drew was right. I needed to stop fantasizing about a girl I was never going to see again. It was five years ago for God\u0027s sakes. I was acting like a pu**y, holding on to the tiny bit of information I had on her. For all I know she looks like Sloth from The Goonies now and smells like Drew’s sweaty balls. I tried to forget about her by getting into a relationship with Tasha a couple of months after that frat party. Almost five years later and I was still stuck in the same rut of fantasizing about someone I’d never see again. To be fair though, I should have known from the start that Tasha and I weren’t the best idea. We spent the majority of our time together in some sort of argument or another. She had a jealous streak that bordered on psycho and hated that I didn’t behave the same way if another man glanced in her direction. What I should have done was hold out for someone like Claire. Someone sweet, and funny and smart; someone who didn’t have a whole other side to her like Tasha. Right in front of me was a beautiful woman that made me think dirty thoughts just by watching her breathe. I needed to cut this shit out and take a chance. Aside from the jealousy and fighting, I knew one of the main reasons Tasha and I didn\u0027t last was because I just wasn’t able to give the relationship one-hundred percent because I couldn\u0027t stop wondering if she might still be out there somewhere. That and the fact that Tasha’s vagina had the same slogan as McDonalds: Over ten billion served. I digress. I needed to put a stop to this stupid fixation on some faceless mystery girl who could very well be a figment of my imagination. I needed take a chance on someone who was sitting right here in front of me or I was going to be alone forever. I was too busy contemplating my pathetic life to notice that Claire was no longer across from me and had gotten up to leave. She was already rounding the corner into the foyer when I snapped out of it. I sat there staring at her back (fine, her ass) long enough for Drew to punch me in the arm. He not so subtly nodded his head in the direction she went and suddenly I realized all eyes were on me. They were looking at me like, \"what the f**k are you waiting for?\" Liz narrowed her eyes at me and I\u0027m not gonna lie, I was a little scared of her. I jumped up from the couch and ran out of the room, catching her right as she finished putting her coat on. Circling behind her back, I opened the door and stood next to it. She was surprised by my presence and jumped a little at the sound of my voice and the door opening. I couldn\u0027t tear my eyes away from her. I need to kiss her. I need to kiss her like I need to breathe. What the f**k is this woman doing to me? Before I made a complete ass of myself by drooling or pushing her up against the wall so I could attack her lips, she turned and walked through the door without saying a word to me after I told her I’d walk her to her car. I had an irrational need to spend more time with her. I wanted to learn what made her blush (aside from talk about her vagina), what song was on repeat on her iPod and what her favorite book was. I wanted to hear her say my name. Fuck, I wanted to hear her sigh, shout and scream my name. So, I told her just that. Well, not all of it. I didn\u0027t want her to get a restraining order. I watched the corners of her mouth twitch when I said her name, almost like it made her happy to hear it. For a second, I thought she would just get in the car and peel out of the driveway without answering me. Then she muttered something that I almost didn\u0027t hear over the sound of a car starting next door. The words she spoke force my mouth to drop open and pushed the memory of a dream I had recently to the forefront of my mind. \"Ask me what my favorite movie is.\" She interrupted my thoughts by telling me to call her. By the time I remembered where I knew that quote from, her car had pulled out of the driveway and was speeding down the street. For the next two weeks Claire and I talked every night on the phone. Unfortunately, the plant put me on night shift and overtime for the first few weeks so our schedules never meshed so we could see each other. The only spare time we both had to talk was during my first fifteen minute break around midnight every night. I always apologized to her for calling at such a shitty time but she swore it was absolutely perfect. For the first time in as long as I can remember, I actually looked forward to going to work because I knew I’d get to hear Claire’s voice. Drew, who worked directly across from me on the assembly line, got entirely too much pleasure out of watching me rush to a quiet corner of the plant to make the call. The first time, he asked me where I was going and when I didn’t answer, he followed me the entire way, shouting to every single person that I was calling my parents to tell them I was coming out of the closet. A well-placed punch to the nuts curbed his desire to do that ever again, but people were still coming up to me and patting me on the back in congratulations. For fifteen minutes every single night, Claire and I talked about nothing and everything all at the same time. I told her about growing up with two older brothers who confirmed my belief in the boogey man and had their friends call me and tell me they were Santa Clause and that I would never get another toy again if I didn’t clean their rooms while wearing a pair of their underwear on my head.","sourceLink":"https://allnovel.net/seduction-and-snacks-chocolate-lovers-1/page-33.html","bookId":1853,"book":{"id":1853,"title":"Seduction and Snacks (Chocolate Lovers #1)","description":"Storyline: Warning #1: This book is not to be taken seriously. Do not read this if you don\u0027t have the sense of humor of a 15 year old boy. Do not read this if you ARE a fifteen year old boy. This book is totally crude and inappropriate and uses the word \"vagina\" a lot. No, I mean A LOT. If you don\u0027t think people who are drunk are hilarious, you shouldn\u0027t read this book. You probably shouldn\u0027t read this book if you aren\u0027t drunk yourself. You should probably just put this book down and get drunk. You may think that no one in the world talks like the people in this book, but they do. They are called \"people who are funny and inappropriate\". This book is completely unrealistic; the author is aware of that fact and did it on purpose. 2012 Goodreads Choice Award Nominee - Best Romance Claire is a twenty-something, single mom that grudgingly helps her best friend sell sex toys while she attempts to make enough money to start her own business to give her foul-mouthed, but extremely loveable (when he’s asleep) toddler a better life. When Carter, the one-night-stand from her past that changed her life forever, shows up in her hometown bar without any recollection of her besides her unique chocolate scent, Claire will make it a point that he remembers her this time. With Carter’s undisguised shock at suddenly finding out he has a four-year-old son and Claire’s panic that her stretch marks and slim to none bedroom experience will send the man of her dreams heading for the hills, the pair will do whatever they can to get their happily ever after. Warning #2: contains explicit sex, profanity and enough sarcasm to choke a horse.","cover":"https://allnovel.net/images/seduction-and-snacks-chocolate-lovers-1.jpg","author":"Tara Sivec","type":"Humorous","source":"allnovel","link":"https://allnovel.net/seduction-and-snacks-chocolate-lovers-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:13:45 PM"}}
