{"id":79477,"no":57,"title":"Page 57","content":"She gave me another snide look before turning her gaze back on Carter.\\n\\n \"Wow, it sure didn\u0027t take you long to find some little whore to dip your wick into did it?\" Tasha asked Carter sarcastically.\\n\\n Oh hell no! She did not just call me a whore.\\n\\n I took a step towards her, my hands shaking with the urge to punch that smug look off of her face.\\n\\n \"That\u0027s pretty rich considering I heard you f**ked your way through the phone book when you were with Carter. Your vagina is a giant gaping hole like the one the iceberg left on the titanic. It\u0027s a crime scene in your pants with hundreds of people screaming in horror and trying to jump the f**k off.\"\\n\\n I didn\u0027t even know what I was saying at this point. I was just spouting nonsense because I was pissed. And it looked like I hit the nail on the head - or the vagina. Tasha charged me like a bull. Everyone moved at once. I moved out of the way, Carter, Liz and Jim all got in front of me and grabbed onto Tasha while she screamed about killing me. It turns out, p**n star-slut-ex-girlfriends aren’t so pretty when they have tomato-red faces, spit flying out of their mouths and their limbs are flailing all over the place.\\n\\n Carter finally managed to grab Tasha’s elbow and started pulling her with him over to the front door while she continued to yell insults and death threats at me. Carter made eye contact with me and mouthed ‘I’m sorry’ before he disappeared out the front door with the nut job.\\n\\n I\u0027m not gonna lie, I was a little freaked out. It felt like everyone in the place was looking at me. It was so loud in here, no one had any clue what had just happened, but it still unnerved me. I hated being the center of attention. And I hated how insecure I felt because right now, Carter was outside, alone, with his ex-girlfriend. Granted, she was obviously one window lick away from riding the short bus, but that knowledge did nothing to ease my mind.\\n\\n I let one of the other waitresses know when she walked by that I was going to take a break for a few minutes. Liz pushed me down onto her barstool and Jim stood behind me rubbing my shoulders to try and ease the tension. Neither of them said much. I think they were waiting for me to have a mental breakdown or curl up in the fetal position and suck my thumb. I had never been in any kind of a fight before. I talked a good game but the first time someone came at me I ran the other way. One time in high school, Liz and I were walking through the mall and some crazy emo chick walked by us and slammed her shoulder into mine. Without thinking, I turned and shouted “Stop writing poetry and crying and watch where you’re going!”\\n\\n She stopped dead in her tracks and turned around, along with the rest of her depressed, too-much black eye make-up posse. I quickly stuck the straw of my cherry slush in my mouth and pointed my thumb at Liz.\\n\\n \"What did we miss, kids?\" Drew asked, coming up behind us a few minutes later with his arm around Jenny as the rest of us just stood there staring at the door where Carter had disappeared.\\n\\n I turned around to face him and his shirt that said, \"I shaved my balls for this?\"\\n\\n “Somebody just tried to kill me,” I told him in a horrified voice.\\n\\n “What? Who?” Drew asked.\\n\\n \"Tasha.\" Liz said with disgust.\\n\\n Jenny immediately looked guilty.\\n\\n \"Oh shit! She was here already? Claire, I\u0027m so sorry. Tasha is all my fault.”\\n\\n “What the hell are you talking about? You know that crazy bitch?” Liz asked.\\n\\n “We went to college together and she called me a few weeks ago and said she\u0027d be in town and wanted to get together. That\u0027s why she was at the sex toy party. She was only supposed to stay for that weekend but she decided to stick around longer. I had no idea she knew Carter until a little bit ago. She asked me if I knew Carter and said she was an old friend and wanted to say hi. It wasn’t until after I told her where you guys were going to be tonight that I remembered she used to date a guy named Carter. That\u0027s why we came up here. I really thought we’d get here before her so I could fix this. \"\\n\\n Drew removed his arm from around Jenny and turned to face me, jumping into action.\\n\\n \"Okay, Claire, here\u0027s what we need to do first. Do you know how to throw a punch?\" Drew asked as he grabbed my arms and stared seriously into my eyes.\\n\\n \"What? No. What are you talking about? I\u0027m not going to fight her,\" I said with a roll of my eyes.\\n\\n \"You don’t understand. I’ve known this freak for years. Did she threaten you?\" Drew asked.\\n\\n \"Yeah, that cum dumpster said she\u0027d kick Claire’s ass,\" Liz told him.\\n\\n \"Oh it\u0027s on now! It\u0027s on like Frogger!\" Drew shouted in excitement.\\n\\n \"Don\u0027t you mean Donkey Kong?\" Jim asked as he stood behind Liz and slid his arms around her waist.\\n\\n \"I never really liked Donkey Kong. So it was never on. Frogger just works better for me.\"\\n\\n \"Drew, nothing is going to be on. I have never been in a fight and I\u0027m not going to start now. Carter took her outside and is hopefully telling her to go to hell. Problem solved,\" I said.\\n\\n Drew looked at me in horror. \"Claire, I don\u0027t think you understand the seriousness of this situation. Now, as much as I hate Tasha like a fire burning rash on my dick, she\u0027s still hot. And Claire, you\u0027re a total MILF.\"\\n\\n I looked at him in confusion. \"Drew, what the hell does this have to do with anything?\"\\n\\n \"It\u0027s like you don\u0027t even know me Claire,\" Drew said sadly with a shake of his head.\\n\\n He let go of my arms and stepped back, wiping an imaginary tear from under his eye. \\n\\n","sourceLink":"https://allnovel.net/seduction-and-snacks-chocolate-lovers-1/page-57.html","bookId":1853,"book":{"id":1853,"title":"Seduction and Snacks (Chocolate Lovers #1)","description":"Storyline: Warning #1: This book is not to be taken seriously. Do not read this if you don\u0027t have the sense of humor of a 15 year old boy. Do not read this if you ARE a fifteen year old boy. This book is totally crude and inappropriate and uses the word \"vagina\" a lot. No, I mean A LOT. If you don\u0027t think people who are drunk are hilarious, you shouldn\u0027t read this book. You probably shouldn\u0027t read this book if you aren\u0027t drunk yourself. You should probably just put this book down and get drunk. You may think that no one in the world talks like the people in this book, but they do. They are called \"people who are funny and inappropriate\". This book is completely unrealistic; the author is aware of that fact and did it on purpose. \\n 2012 Goodreads Choice Award Nominee - Best Romance \\n Claire is a twenty-something, single mom that grudgingly helps her best friend sell sex toys while she attempts to make enough money to start her own business to give her foul-mouthed, but extremely loveable (when he’s asleep) toddler a better life. \\n When Carter, the one-night-stand from her past that changed her life forever, shows up in her hometown bar without any recollection of her besides her unique chocolate scent, Claire will make it a point that he remembers her this time. \\n With Carter’s undisguised shock at suddenly finding out he has a four-year-old son and Claire’s panic that her stretch marks and slim to none bedroom experience will send the man of her dreams heading for the hills, the pair will do whatever they can to get their happily ever after. \\n Warning #2: contains explicit sex, profanity and enough sarcasm to choke a horse.\\n","cover":"https://allnovel.net/images/seduction-and-snacks-chocolate-lovers-1.jpg","author":"Tara Sivec","type":"Humorous","source":"allnovel","link":"https://allnovel.net/seduction-and-snacks-chocolate-lovers-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:13:45 PM"}}
