{"id":79497,"no":77,"title":"Page 77","content":"Once we were situated, Gavin looked over his shoulder at Carter.\\n\\n \"Morning, crabby-daddy,\" he said, before turning back to face me and play with my hair.\\n\\n I laughed at that one. Carter did look a little crabby.\\n\\n He just shook his head and laughed right along with me.\\n\\n Gavin\u0027s hand cupped my cheek and he looked seriously into my eyes.\\n\\n \"Hey, Mom,\" he said.\\n\\n I squeezed him tighter and smiled.\\n\\n \"Yeah, baby.\"\\n\\n \"Lemme see your boobs,\" he said.\\n\\n 19. This Patient Needs an Enema, STAT\\n\\n Her mouth was on my penis.\\n\\n We were sitting on the couch after lunch and all I could do was stare at Claire’s mouth over top of Gavin\u0027s head.\\n\\n This is wrong on so many levels.\\n\\n But Jesus f**k, those red, plump lips were wrapped around my penis and I kicked her away. Sure, it was unconsciously but still... I punted her like a football off of my dick. That was like rule number one in sex. Never kick a girl away from your dick if she\u0027s got her mouth there. If her teeth were clamped down on it and she\u0027s whipping it around like a chew toy, that\u0027s another story.\\n\\n I let out a big sigh and turned my attention back to the movie.\\n\\n \"What is this one called again?\" I asked.\\n\\n Gavin was curled up into my side with his feet on Claire’s lap.\\n\\n \"Finding Nemo,\" Gavin mumbled.\\n\\n We watched the movie in silence for a few minutes and I felt like a kid again as I enjoyed the happenings on the screen. It had been a long while since I watched a cartoon.\\n\\n \"Holy shit, did they just kill off that fish\u0027s wife?\" I blurted in shock.\\n\\n \"Yep,\" Gavin replied. \"That big, mean fish ated her.\"\\n\\n He said it so calmly - like it was no big deal that a sweet, loving cartoon fish just got murdered. What the f**k was wrong with this movie? This couldn\u0027t be appropriate for kids. I didn\u0027t think it was appropriate for me.\\n\\n \"Are you sure this is a kid\u0027s movie?\" I asked Claire.\\n\\n She laughed and just shook her head at me.\\n\\n An hour later Gavin was asleep with his head on my lap and Claire was leaning in the opposite direction from me, her elbow on the arm of the couch and her head in her hand.\\n\\n If I had to listen to Nemo calling for \"Daddy\" one more time, I was going to blubber like a baby. I snatched up the remote and turned the movie off.\\n\\n Claire lifted her head off of her hand and gave me a questioning look.\\n\\n \"We need to put another movie in. This is too depressing. They killed off the poor fish\u0027s wife in the first five minutes and then we have to spend the rest of the movie watching that same, poor sap search for his son who ran away. What kind of sick f**ks made this into a kid\u0027s movie?\" I whispered angrily, trying not to wake Gavin up.\\n\\n \"Welcome to the Disney/Pixar School of Hard Knocks,\" she said dryly.\\n\\n I laughed at her comparison.\\n\\n \"Oh come on. There\u0027s no way they\u0027re all like this. I do not remember being horrified by a children\u0027s movie when I was little.\"\\n\\n \"That\u0027s because you were a child. You didn\u0027t understand what was happening at the time, just like Gavin doesn\u0027t really understand. I think they make these kids movies more for adults anyway,\" she explained.\\n\\n I shook my head in disbelief.\\n\\n \"Sorry, but I remember all of the great Disney classics and there is no way you can find anything nightmare-inducing in any of them.\"\\n\\n She raised her eyebrow at me in a challenge.\\n\\n \"Okay fine. Bambi,\" I said.\\n\\n She just laughed.\\n\\n \"Oh please! That\u0027s the easiest one. Bambi’s dad headed for the hills as soon as the stick turned pink. His mom was a single deer, living in low-rent housing in the crack-whore part of the forest where there are gangs of bunnies. His mom gets killed in a drive-by shooting, leaving Bambi alone and forced to grow up much too soon.\"\\n\\n Damn. I forgot about that. It had been a while since I watched Bambi.\\n\\n \"Okay, fine. How about the Little Mermaid? Beautiful sea creature falls in love with the handsome prince.\"\\n\\n Shut up. I had little cousins. And Ariel was hot. Men could spend hours looking at a hot mermaid and wonder just how in the hell he could stick it in her.\\n\\n But seriously, how do mermaids bang?\\n\\n Claire nodded her head, \"Oh yes. Sweet Ariel who has to give up everything, including her identity, for a man. God forbid Prince Eric grows some gills. Nope, Ariel has to give up her friends, her family, her home and her entire life for him. Eric just takes and takes and never gives.\"\\n\\n I racked my brain trying to think of another classic kid\u0027s movie and continued to contemplate the process of f**king a mermaid. Maybe you could just bend a mermaid over a chair and your dick magically finds the hold in the one-legged fin thing.\\n\\n \"Fine, then how about Beauty and the Beast? The most beautiful girl in all the land falls for the beast\u0027s personality instead of his looks. You can\u0027t find anything wrong with that. Plus, it teaches a great lesson.\"\\n\\n I gave her a smug grin.\\n\\n Maybe there was a magic button that made a mermaid\u0027s legs separate long enough to bang her. Ooooooh, like a magic nipple! Push the nipple and watch her spread.\\n\\n \"Wrong,\" she replied. \"A pretty girl with no money falls for a rich, abusive monster. But she loves him so much that she makes excuses for the abuse. ‘Oh that bruise? I tripped down a flight of stairs.’\"\\n\\n She angled her body to face me.\\n\\n \"I could go on all day with these, believe me,\" she said. \"You also can\u0027t forget the awesomeness that is the penis drawn on the original Little Mermaid VHS box cover and the whisper of, \"Kids, take off your clothes,\" in Aladdin.\" \\n\\n","sourceLink":"https://allnovel.net/seduction-and-snacks-chocolate-lovers-1/page-77.html","bookId":1853,"book":{"id":1853,"title":"Seduction and Snacks (Chocolate Lovers #1)","description":"Storyline: Warning #1: This book is not to be taken seriously. Do not read this if you don\u0027t have the sense of humor of a 15 year old boy. Do not read this if you ARE a fifteen year old boy. This book is totally crude and inappropriate and uses the word \"vagina\" a lot. No, I mean A LOT. If you don\u0027t think people who are drunk are hilarious, you shouldn\u0027t read this book. You probably shouldn\u0027t read this book if you aren\u0027t drunk yourself. You should probably just put this book down and get drunk. You may think that no one in the world talks like the people in this book, but they do. They are called \"people who are funny and inappropriate\". This book is completely unrealistic; the author is aware of that fact and did it on purpose. \\n 2012 Goodreads Choice Award Nominee - Best Romance \\n Claire is a twenty-something, single mom that grudgingly helps her best friend sell sex toys while she attempts to make enough money to start her own business to give her foul-mouthed, but extremely loveable (when he’s asleep) toddler a better life. \\n When Carter, the one-night-stand from her past that changed her life forever, shows up in her hometown bar without any recollection of her besides her unique chocolate scent, Claire will make it a point that he remembers her this time. \\n With Carter’s undisguised shock at suddenly finding out he has a four-year-old son and Claire’s panic that her stretch marks and slim to none bedroom experience will send the man of her dreams heading for the hills, the pair will do whatever they can to get their happily ever after. \\n Warning #2: contains explicit sex, profanity and enough sarcasm to choke a horse.\\n","cover":"https://allnovel.net/images/seduction-and-snacks-chocolate-lovers-1.jpg","author":"Tara Sivec","type":"Humorous","source":"allnovel","link":"https://allnovel.net/seduction-and-snacks-chocolate-lovers-1.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:13:45 PM"}}
