{"id":102263,"no":26,"title":"Page 26","content":"“Mom, do you think that was really Santa?” she asked.\\n\\n Savannah exchanged a look with Trace, trying to gauge from his reaction whether her guess about Nate Daniels was correct. Before she could respond, Trace spoke up.\\n\\n “Looked exactly like Santa to me,” he said. “And you said you weren’t going to have presents this Christmas, so who else but Santa would bring them?”\\n\\n “Oh, I have some theories about that,” Savannah muttered under her breath, but she kept her opinion to herself. She might have a few words for Trace later in private, but she was not going to strip that excitement from her daughter’s eyes. “How about breakfast before we open gifts?”\\n\\n “No way!” Hannah protested. “I want to see what’s in the boxes, especially that great big one. Santa could hardly get it up the steps.”\\n\\n “You know that Christmas is about more than presents,” Savannah felt duty-bound to remind her.\\n\\n “I know, Mom, but these are here and some of them are for me. I checked the tags.”\\n\\n “Only some? Who are the others for?”\\n\\n “You, silly. And Trace.”\\n\\n “Me?” Trace said, looking more shocked than he had at any time since this incredible morning had begun.\\n\\n Savannah studied him intently. His surprise seemed genuine. Was it possible he wasn’t behind this? Or at least not all of it? Curious to find out for sure, she acquiesced to Hannah’s pleas and followed her into the living room.\\n\\n “Big box first,” Hannah said, rushing over to it. “Okay?”\\n\\n “Your call,” Savannah agreed.\\n\\n The big box turned out to contain skis and ski boots. Hannah immediately had to try them on. “These are so totally awesome,” she said, then wailed, “but I don’t know how to ski.”\\n\\n “Maybe Santa thought of that,” Trace suggested, his expression innocent.\\n\\n Hannah’s expression brightened at once. She began ripping open her remaining presents in a frenzy, oohing and aahing over each toy, over a new ski jacket and finally over the certificate for ski lessons that came in a deceptively large box.\\n\\n Though a part of Savannah wanted to protest the degree of excess, she couldn’t bring herself to spoil the moment.\\n\\n “Your turn now, Mom,” Hannah said, bringing her a comparatively small box that seemed to weigh a ton.\\n\\n “What on earth?” Savannah said when she tried to lift it. She began carefully removing the wrapping paper until Hannah impatiently ripped the rest away, then tugged at the tape on the box. Inside, nestled in packing chips and tissue paper, was a tool kit, painted a ladylike pink but filled with every conceivable practical tool she could ever possibly need.\\n\\n Her gaze shot to Trace. How had he guessed that she would prefer a gift like this to something totally impractical?\\n\\n “It’s perfect,” she said, her gaze locked with his.\\n\\n “Santa must know you pretty well,” he agreed.\\n\\n “Mom, there’s a huge box here for you, too,” Hannah said, shoving it across the floor.\\n\\n This time she discovered a floor polisher, precisely the kind she would need if she was to keep the inn’s floors gleaming. For most women, an appliance on Christmas morning would have been cause for weeping, but Savannah’s heart swelled with gratitude.\\n\\n “Wait, Mom. There’s something little tucked inside with a note,” Hannah said, her expression puzzled as she handed it to Savannah.\\n\\n At the sight of the jewelry-size package, Savannah’s breath caught in her throat. Her gaze shot to Trace, but he looked as puzzled as Hannah had. Then she caught sight of the handwriting on the envelope. It was Aunt Mae’s.\\n\\n Tears stung Savannah’s eyes as she opened the note.My darling girl,I hope you are happily settled in by now and that you will love your new home as much as I have over the years. I’ve done what I could to be sure you find joy here.Here’s something else I hope will bring you happiness. It belonged to your great-great-grandmother.With all my love to you and Hannah. I wish I could be there with you this morning, but please know that wherever I am, I will always be looking out for you.Mae\\n\\n Savannah sighed and blinked back tears. Finding Mae’s present tucked amid all the others made her question everything. She’d been so sure that Trace had sent them, but now? Recalling Santa’s resemblance to Nate made her wonder if Mae hadn’t been behind this whole magical morning.\\n\\n “Aren’t you going to open it?” Hannah asked, leaning against her and regarding the box with evident fascination.\\n\\n Savannah slipped off the wrapping paper, then lifted the lid of the velvet box. Inside, on a delicate gold chain, was an antique gold cross. The workmanship was exquisite. The gold seemed to glow with a soft light of its own. She could remember Mae wearing this cross every day of her life. She had always said it symbolized faith itself—so fragile yet enduring.\\n\\n She opened the delicate clasp, slipped on the necklace, then fastened it. The gold felt warm against her skin, as if it still held some of Aunt Mae’s body heat. Once more, her eyes turned misty. She felt Trace take her hand and give it a squeeze.\\n\\n “Merry Christmas,” he said quietly.\\n\\n “Wait!” Hannah said. “There’s another box. It’s for you, Trace.”\\n\\n Once more, he looked completely disconcerted. Hannah gave him the present. He handled it gingerly, studying the large, flat box with suspicion.\\n\\n “What does it say on the tag?” Savannah asked, curious herself.\\n\\n “Just Trace,” he said. “No other name.”\\n\\n “Must be from Santa, then,” she teased.\\n\\n He slipped open the paper, then pulled out the box and lifted the lid. The grin that broke over his face was like that of a boy who’d just unexpectedly received his heart’s desire.\\n\\n “What is it?” Savannah asked, trying to peer over his shoulder.\\n\\n “It’s the biggest, mushiest card I could make,” Hannah said, grinning. “And Mrs. Jones took me to get it framed so Trace could hang it on his office wall.”\\n\\n Trace stared at her, looking completely mystified. “But I lost the bet.”\\n\\n “I know,” Hannah said delightedly. “But I could tell you really, really wanted the card, so I made it anyway.” She threw her arms around his neck. “Merry Christmas!”\\n\\n To Savannah’s shock, there was a distinct sheen of tears in Trace’s eyes as he hugged her daughter.\\n\\n “It’s the very best present I ever received,” he told her with such sincerity that Hannah’s whole face lit up.\\n\\n If this didn’t stop, Savannah was going to spend Christmas morning bawling like a baby. She was about to head for the kitchen to start on breakfast, when Trace grabbed her hand and halted her.\\n\\n “Wait. I think there’s one more present for you, Savannah,” he said, pointing Hannah toward a flat box beside the chair where he’d been sitting earlier. “Bring that one to your mom.”\\n\\n The box weighed next to nothing, but when Savannah tore off the paper and looked inside, her mouth dropped open. “Stock certificates?” she asked, turning to Trace. “In Franklin Toys? I can’t possibly accept such a gift from you.”\\n\\n “It’s not from me,” he said firmly. “Not directly, anyway. These were Mae’s shares of the company. She gave me power of attorney to vote them for her during the last weeks of her illness, but she told me I’d know what to do with the shares after her death.” He looked straight into Savannah’s eyes. “I think she would want you to have them.”\\n\\n “But she left me the inn,” Savannah protested. “And Franklin Toys is your company.”\\n\\n He grinned. “I hope you’ll remember that when you vote, but in many ways the company was as much Mae’s as it was mine. She’d want you to have the financial independence those shares can give you.”\\n\\n “But I don’t know anything about running a corporation.”\\n\\n “You can learn,” he said. “Or you can sell the shares back to me, if you’d prefer to have the cash. The choice is yours.”\\n\\n Savannah sat back, still filled with a sense of overwhelming shock and gratitude. And yet…..She studied Trace carefully. “Is this really what you want to do? She gave you her power of attorney, not me. I think she wanted you to control these shares.”\\n\\n “She wanted me to do the right thing with them,” he corrected. “And I think that’s turning them over to you. They’re yours, Savannah. My attorney took care of the transfer yesterday.”\\n\\n Once again, Savannah looked at the certificates. She had no idea what each share was worth in today’s market, but it had to be a considerable amount. The thought that she would never again have to worry about money was staggering.\\n\\n This truly was a season of miracles.\\n\\n Christmas morning had been incredible. It was everything Trace had imagined, from the awe and wonder on Hannah’s face to the amazement on Savannah’s when she’d realized that her financial future was secure. Trace had given the two of them everything he knew how to give. He’d been deeply touched by their gratitude.\\n\\n Somehow, though, it wasn’t enough. He wanted more, but he had no idea how to ask for it, or even if he had the right to, especially after knowing the two of them for such a short time.\\n\\n Struggling with too many questions and too few answers, he wandered into the kitchen where Savannah was just putting the turkey into the oven.\\n\\n She turned at his approach, studied him for a minute, then gave him a hesitant smile. “Everything okay?”\\n\\n “Sure. Why wouldn’t it be?” he asked, feeling defensive.\\n\\n “I’m not sure. You seem as if you’re suddenly a million miles away.”\\n\\n “I’ve got a lot on my mind. In fact, if you don’t need my help right now, I was thinking of taking a walk to try to clear my head.”\\n\\n “Sure,” she said at once. “It’ll be hours before the turkey’s done, and everything else is set to go in the oven once the turkey comes out.” She continued to regard him worriedly. “Want some company?”\\n\\n Trace shook his head. “Not this time. I won’t be gone long,” he said, turning away before the quick flash of hurt in her eyes made him change his mind. How could he possibly think about what to do about Savannah if she was right by his side tempting him?\\n\\n He heard her soft sigh as he strode off, but he refused to look back.\\n\\n Outside, the snow was a glistening blanket of white. The temperature was warmer than it had been, though still below freezing if the bite of wind on his face was anything to go by. He almost regretted the decision to take a lonely walk when he could have been inside in front of a warm fire with Savannah beside him.\\n\\n He headed for the road, then turned toward town. He’d only gone a hundred yards or so when Nate Daniels appeared at the end of his driveway. He was bundled up warmly, an unlit pipe clamped between his teeth. He paused to light the tobacco, then regarded Trace with a steady, thoughtful look.\\n\\n “Mind some company?” he asked, already falling into step beside him.\\n\\n “Did Savannah call you?” Trace asked.\\n\\n “Nope. Why would she do that?” \\n\\n","sourceLink":"https://allnovel.net/that-holiday-feeling-virgin-river-8/page-26.html","bookId":2632,"book":{"id":2632,"title":"That Holiday Feeling (Virgin River #8)","description":"Storyline: That Holiday Feeling (Virgin River #8) \\n by Debbie Macomber , Sherryl Woods, Robyn Carr \\n Silver Bells by Debbie Macomber \\n In this classic story, Debbie brings those Manning men and Manning sisters home for a mistletoe marriage when a single dad finally says \"I do.\" \\n The Perfect Holiday by Sherryl Woods \\n Will bachelor Trace Franklin become a groom-to-be by Christmastime? He sure will ... if Savannah Holiday\u0027s aunt Mae as anything to do with it. \\n Under the Christmas Tree by Robyn Carr \\n When the folks of Virgin River discover a box of adorable puppies under the town\u0027s Christmas tree they call on local vet Nathaniel Jensen for help. But it\u0027s his budding romance with Annie McCarty that really has tongues --- and tails --- wagging!\\n","cover":"https://allnovel.net/images/that-holiday-feeling-virgin-river-8.jpg","author":"Debbie Macomber","type":"Christian","source":"allnovel","link":"https://allnovel.net/that-holiday-feeling-virgin-river-8.html","creation":"Oct 5, 2019 8:58:57 AM","modification":"Oct 5, 2019 10:14:06 PM"}}
