{"id":102279,"no":42,"title":"Page 42","content":"Now that was something he could see Annie doing.\n And to speak of the devil herself, when he pulled up to his house, it was dimly lit from inside and her truck was parked out front. The clock on the car console said two-fifteen. Lord, what was she doing? Half of him was so grateful he could burst, the other half wanted to spank her for staying up so late—he knew she had a long day in the shop ahead of her so that she could be closed the afternoon of the twenty-fourth and all day the twenty-fifth.\n Annie, he had learned, was not afraid of hard work.\n He entered the dimly lit house quietly. His first reaction was surprise, but pleasure quickly followed. On the breakfast bar a thick red candle flickered beside a plate of cookies and a couple of cups. There was chocolate powder in the cups, ready for hot milk to be added. Bows on the chairs, garlands strung around, table decorations, twinkling lights everywhere, and his girl, asleep in front of a fire. He chuckled to himself. Well, hadn’t she been busy.\n It was like really coming home. Holidays meant a lot to her. Her sense of love and family spilled over to everyone around her, and he felt so…..embraced inside, like it was his first Christmas. He smiled to himself. In an important way, it was.\n He took off his boots, belt and jacket in the kitchen. He blew out candles, turned off all but the twinkling tree lights and fireplace, and knelt down by the sofa, softly kissing her beautiful lips.\n “Mmm,” she murmured, half waking. “You’re home. I must’ve fallen asleep.”\n “You were probably exhausted, digging through the storage,” he said with humor in his voice.\n “I’ll put it all away before you get back,” she whispered. “I should go, now you’re home…...”\n “Are you crazy?” he asked. He slipped one arm under her knees, the other behind her back and stood with her in his arms. “We’re going to get some sleep. It’s almost morning, anyway. And this couch isn’t going to do it. I want to hold you. I want to fall asleep with you in my arms. Now close your eyes and your mouth.”\n She hummed and snuggled closer to him. “Everything all right? With the mare?” she asked.\n “It’ll get sorted out. I’ll tell you about it in the morning.” He carried her to his bedroom and laid her gently on the bed. “Do you need the alarm?” he asked her. “I can set it for you.”\n “Nah. I haven’t slept past seven in my life.”\n “Good,” he said. He pulled back the comforter and crawled in, jeans and all, and she did the same. “Come close,” he said. “All I want in life is to feel you against me. Mmm, just like that. Aaah, Annie, my Annie…..”\n Suddenly he knew that even as exhausted as he was, he wasn’t going to sleep. He had a stunning thought—this is what it feels like when you actually fall in love. He’d thought that whole falling-in-love thing was some girl story that guys didn’t experience. He was familiar with being attracted. Oh-ho, was he familiar with that! And of course he had known desire in all sizes, from warm to boiling. Wanting a woman, yes, that was a fairly regular occurrence. But this was all those things mixed together and yet something completely different at the same time.\n He wanted to be only with Annie; if he were allowed one friend for the rest of his life, he would choose her. He wanted to come home to the kind of warmth she could bring to a room. He wanted to crawl in beside her and feel the comfort of her body, which fit so perfectly against his. He didn’t want to be away from her; he wanted her for life.\n He began unbuttoning her blouse. In spite of the fact that she seemed to be asleep, he was undressing her, knowing he shouldn’t. But then he felt her fingers working away at his shirt buttons and he sprang to life, hard and ready. His hands went to the snap on her jeans while hers worked at his. Like choreography, they were slipping each other’s jeans down and off and he pulled her hard against him, his shorts to her dainties. “God,” he said. “God, God, God.”\n She pulled away just enough to shrug out of her shirt and remove her socks. She left the panties for Nate to handle, which he did immediately. “Let me have these,” he said, clutching them in his fist. “Let me keep these for the rest of my life. Can I?”\n She laughed at him and tugged down his boxers. “Sure,” she whispered against his lips. “And you can keep your underwear.”\n He moaned as if in pain, his hand finding a breast. “Why are you wearing a bra?” he asked.\n “Because you’ve been undressing me for five seconds and haven’t gotten to that yet?” she returned. She unsnapped the clasp and it fell apart, just in time for his lips on her breast. He rolled on top of her, probing. “Condom,” she whispered. “Condom, Nate.”\n “Right,” he said. “Got it.” And he leaped out of bed, raced unceremoniously to the master bath, running back to the king-size bed with a packet in his hand, ripping it open as he went. He flopped on the bed and pulled her close. Then he froze. All motion stopped. Their thighs were pressed together, their lips straining toward each other, their hands pulling their bodies closer, and he said, “Annie? Are you ready for this?”\n She didn’t say anything and he couldn’t see her face in the darkness of the room. She took his hand and captured the foil packet. She pulled his hand down between her legs where his fingers could answer his question.\n He moved his hand up her inner thigh, opened her legs a bit, caressed her wonderfully wet folds. “Aaah,” he said once more against her lips.\n “Ready,” she whispered. “Ready.” And then she applied the protection.\n “You know what, Annie?” he said. “Coming home to you, making love to you, it feels like the one thing I’ve always been ready for.”\n “Then let’s not waste any more time,” she said.\n He fell asleep while still inside her, holding her close. Sometime in the night, they roused just enough to make love again. When he awoke in the morning, he was alone. There was a little puppy, whimpering, faint and distant.\n He found her note in the kitchen:Nate—you were so tired, you slept through puppy breakfast, which was noisy. I decided you should sleep. I want you to have the most wonderful time of your life on your trip. I’ll take care of everything while you’re gone and I’ll put away the decorations. And thank you for last night. It was perfect. Love, Annie\n He picked up the note and read it again and again. “It’s awful hard to leave you, Annie,” he whispered. “Especially at Christmas.”\n Nathaniel booked his flights to coordinate with the rest of the group—they were all meeting for breakfast in Miami. From there they would fly together to Nassau. He had to take a commuter from Santa Rosa to San Francisco. That meant a two-hour drive south to pick up the first leg of his trip. From San Francisco he would take a nonstop red-eye to Miami. He would be there in early morning. He’d have breakfast in the airport with his old gang. It brought to mind the breakfasts they’d had together after all-night study sessions, right before a big exam. Then they’d get to the Bahamas early in the day to begin their ten-day vacation.\n He didn’t mind driving, which was a good thing, since his practice had him running around the mountains and valleys of three counties looking after livestock. The drive from Humboldt County to Santa Rosa was beautiful and calm. But rather than enjoy the rolling hills and snow-covered pines and mountains, all he thought about was Annie.\n Before he left Humboldt County, he had called her at her shop. “I’ll be leaving in a couple of hours. Sure you want to let me go without you?” he had asked.\n “This is your trip, Nate. Not mine,” she said. “You planned it, you’ve looked forward to it, you paid for it—now go and enjoy it. I have family things to do. And puppy things. When you get back all the decorations will be put away, the puppies will be distributed to their new homes and you’ll be tanned and rested. And it will be a whole new year.”\n “I hear cell reception is terrible there, but I’ll try to call you while I’m gone,” he said. “I want to see if you have any regrets about turning down an all-expense-paid vacation. And there’s a note for you on the kitchen counter—my hotel info. Call me if you need anything. Anything at all.”\n When he said that, he had been thinking, Me. Call if you need me. Call me if you miss me.\n But Annie had laughed cheerfully. “Now, Nate, what are you going to do if I need something? Catch a flight home? You’ll be on the other side of the country! And you’ll be with your friends—a reunion, Nate. Now stop worrying about stuff you can’t do anything about. Just have fun. Besides, I can manage just about anything.”\n A few weeks earlier Nathaniel had been looking forward to this vacation with such enthusiasm. He’d built a few fantasies about girls in bikinis and low-cut sundresses. He saw himself inviting a beautiful woman out to dinner; maybe he’d be taking some lovely young thing sailing. He envisioned staying up late with his buddies, laughing, drinking and smoking cigars. He figured he’d be needed to rub suntan lotion on a bare female back.\n None of those mental images were working for him now. Now all he could think about was how long the next ten days were likely to be. He hoped he’d at least catch an impressive fish or two. That’s what he’d like to take home to her—a big, mounted sailfish. Maybe they’d hang it over the bed and remember their first Christmas. And their last one apart.\n Annie had laughed brightly while on the phone with Nate, but melancholy stole her laughter away the moment she hung up. She supposed it was a combination of being a little bit tired and sad that he’d be away. She’d been up late decorating his house and baking him those awful-tasting cookies; he just didn’t have the right ingredients on hand, and what he had was far from fresh. Of course she hadn’t slept much in his bed; he’d kept her busy. And so satisfied. He was such a wonderful lover, but instead of leaving her sated, it left her wanting more of him.\n And then she had to get up very early—she had to go home, shower and dress for work and arrange the Christmas gift baskets for the girls in the shop.\n She wondered if he had felt her lips press softly against his before she’d left him. Had he heard her say, “Goodbye, Nate. Be safe. Hurry home”? He hadn’t stirred at all.\n She had been happy to hold him close, warm him and put him to sleep. She wouldn’t mind doing that every day for the rest of her life.\n She knew her mood had plummeted and she didn’t want anyone in the shop noticing, so she grabbed up the appointment book and walked to her small office at the back of the little shop. But sure enough, Pam followed her. Pam stood in the doorway, looking at her.\n “Don’t worry, Annie. He’ll be thrilled to get home to you,” Pam said.\n “Sure. Of course. I didn’t say anything otherwise, did I?”\n “You didn’t have to,” Pam said. “You laughed and joked with him on the phone, but the second you hung up, you got real sober. Serious. Maybe a little worried.” \n","sourceLink":"https://allnovel.net/that-holiday-feeling-virgin-river-8/page-42.html","bookId":2632,"book":{"id":2632,"title":"That Holiday Feeling (Virgin River #8)","description":"Storyline: \n That Holiday Feeling (Virgin River #8) \n by Debbie Macomber , Sherryl Woods, Robyn Carr \n Silver Bells by Debbie Macomber \n In this classic story, Debbie brings those Manning men and Manning sisters home for a mistletoe marriage when a single dad finally says \"I do.\" \n The Perfect Holiday by Sherryl Woods \n Will bachelor Trace Franklin become a groom-to-be by Christmastime? He sure will ... if Savannah Holiday\u0027s aunt Mae as anything to do with it. \n Under the Christmas Tree by Robyn Carr \n When the folks of Virgin River discover a box of adorable puppies under the town\u0027s Christmas tree they call on local vet Nathaniel Jensen for help. But it\u0027s his budding romance with Annie McCarty that really has tongues --- and tails --- wagging!\n \n","cover":"https://allnovel.net/images/that-holiday-feeling-virgin-river-8.jpg","author":"Debbie Macomber","type":"Christian","source":"allnovel","link":"https://allnovel.net/that-holiday-feeling-virgin-river-8.html","creation":"Oct 5, 2019 8:58:57 AM","modification":"Oct 5, 2019 10:14:06 PM"}}
