{"id":84094,"no":13,"title":"Page 13","content":"The rest of the video shoot was a lot less traumatic. Kellan shot his part with the band and finished up his scenes with Sienna-fully clothed, this time. The band footage was amazing. It was like being back at Pete\u0027s as I watched them rock out on the makeshift stage. Kellan was incredible as he poured his heart and soul into the microphone. And even though the audio recording wouldn\u0027t be used for the video, they were spot on each time they played.\\n\\n The remaining bedroom scenes were actually interesting to watch this go round. Now that the painful, naked part of filming was over, I could stomach Sienna being around Kellan, even if she did still feel the need to greet him with a kiss on the cheek. The entire song was essentially one long ode to a romance gone south. Diedrich\u0027s vision of it was Kellan and Sienna reminiscing and arguing about their doomed relationship while walking around the bed where their naked bodies were in the throes of a \"passionate embrace,\" as Diedrich called their sex scene.\\n\\n The passionate part was already in the can, thank God, so they spent an entire day filming the breakup scenes. It was fascinating to watch. Kellan would lean down by one side of the bed, singing his line as he stared at nothing. In the final version, though, he would be staring at the image of himself making out with Sienna. At one point in filming, they had a couple wearing lime green jumpsuits hop into bed and simulate what Kellan and Sienna had done yesterday. It blew my mind that that was actually someone\u0027s job. Then they had Kellan drag his fingers down the Green Sienna\u0027s arm. In the final cut, one version of Kellan would be making out with Sienna, while the other version of him would be longingly running his hand down her arm. If I could look at it without revulsion, the video was going to be haunting and beautiful, much like the song.\\n\\n During the angrier portion of the duet, Kellan and Sienna sang their parts directly to each other, both purposely ignoring the bed in the background, where their entangled bodies would be digitally added later. I had to say, I much preferred watching Kellan sing to Sienna with a sneer on his face than watching him run his tongue over her chin.\\n\\n The song ended with Kellan and Sienna exiting the shot in opposite directions. Diedrich explained that he was going to use the portion of the love scene where Kellan rolls off of Sienna and lays back on the pillows with his eyes tightly shut and his jaw lightly trembling as the last frame of the video. He said the look on Kellan\u0027s face right then was a picture-perfect foreshadowing of the impending breakup, thus creating a never-ending video that could be watched in a continuous loop and still make sense. I would have to take his word on that, but thinking back over the pain on Kellan\u0027s face at that pivotal moment, I knew the scene was going to be emotionally powerful.\\n\\n Looking like a proud father, Nick approached Kellan after the final day of shooting. Patting him on the shoulder, he proclaimed, \"See, now, that wasn\u0027t so bad, was it?\" Not waiting for Kellan to answer, he immediately added, \"This video is going to be smoking hot! Scorch everything else out of the water.\" He rubbed his hands together and I could practically see the heaps of money in his mind.\\n\\n Putting his arm around my shoulder, Kellan held me tight to his side, and said to Nick, \"I\u0027m glad you\u0027re happy with it . . . because I\u0027m never doing anything like that again.\"\\n\\n The smile instantly fell off of Nick\u0027s face. \"Never say never. You\u0027re awfully new in this business.\"\\n\\n His tone implied that Kellan and his band were also replaceable. I disagreed. Their single with Sienna was skyrocketing up the charts, and I was positive their album would do the same when it was released in a couple of weeks.\\n\\n Kellan looked down at me, then back up at Nick. \"No, I\u0027m never filming anything like that again. I\u0027m done. I made a promise, and I\u0027m keeping it. I\u0027ll help you promote the album in any way I can, because I owe that to my band mates, but my wife comes first, and you need to accept that.\"\\n\\n Kellan stared Nick down, and I felt a crackle of tension in the air. Nick didn\u0027t like being told no, but Kellan was done towing the company line. Maybe seeing Kellan\u0027s determination, Nick sniffed, then asked, \"Any way you can?\"\\n\\n Kellan nodded. \"Within reason . . . of course. I won\u0027t let you play with my personal life anymore. I prefer to be private, but I\u0027m not staying quiet. If someone asks me about my relationships, I\u0027m going to give them an honest answer.\" He leaned in, his voice dropping. \"And I reread my contract. I know what my job entails, and I know what I have to do and don\u0027t have to do for you.\"\\n\\n Nick smirked, like he knew something Kellan didn\u0027t know. After another moment, he shrugged and smiled like nothing was wrong. \"Well, it\u0027s good to know where you stand.\"\\n\\n Nick left with Sienna soon afterwards; both of them seemed a little pissy as they hastened off the lot. I felt great. Even when Taskmaster Tory returned and shuffled us off to the airport so the D-Bags could finish promoting their upcoming album, I was pleased. Kellan had put his foot down, he wasn\u0027t staying quiet anymore. I asked him to not mention me specifically, because I did not want that level of attention, but he told everyone who asked that Sienna was no more than a colleague he worked with and he was \"in a relationship.\" Tory really didn\u0027t like that he was answering a question that Nick had given him specific instructions not to answer, but Kellan didn\u0027t care what she thought, or what Nick thought, and only smiled at her when she berated him after every single interview.\\n\\n While the frantic pace of shuffling from one city to the next was chaotic and exhausting, no longer having the strain of filming a provocative music video hovering over our heads was refreshing. It was like a weight had been lifted, and Kellan and I both felt lighter. And since Sienna was starting her own cross-country tour, we probably wouldn\u0027t even see her for a very long time. Eventually the rumors would die off, and I wouldn\u0027t have to hear about how great a couple she and Kellan were. I was looking forward to that day.\\n\\n At the end of the promo tour, the band had a bit of a break before their tour with Justin and Avoiding Redemption started, so we all flew home to Seattle. The last several weeks had been draining, and we all needed to rest and recharge. Being in my own bed had never felt so good; I slept for twelve hours straight the first night back, and Kellan slept even longer.\\n\\n As Nick predicted, their single with Sienna skyrocketed to number one right before the D-Bags\u0027 album dropped-the album debuted at number nineteen. Even though Kellan had talked a big game with Nick, he was a little shocked by the album\u0027s success. I wasn\u0027t. I knew he\u0027d be big once the world knew about him.\\n\\n We all decided to go out to celebrate the band\u0027s success, and when we were in Seattle, there was only one place to go to celebrate-the place that had started it all: Pete\u0027s Bar.\\n\\n Kellan and I held hands as we stared up at the bar sign glowing in the windows. It was almost hard to believe that it was just a little over two years ago that I\u0027d first lain eyes on Kellan here. He\u0027d seemed like such a player, and I suppose he was back then, but there was a surprising amount of depth to this ex-player.\\n\\n As I was reminiscing, Kellan bumped my shoulder. \"Did I ever tell you that I noticed you the second you walked into Pete\u0027s with Denny?\"\\n\\n I looked up at him, surprised. \"Really? While you were playing? With all of those people in the bar?\"\\n\\n Walking backwards, Kellan pulled me toward the double doors to the large, rectangular building. \"Yep. It was like an electric current zipped around the room when you stepped through the doors. Like I knew I\u0027d never be the same from that moment forward.\"\\n\\n He gave me a crooked grin. I rolled my eyes. \"That did not happen. You noticed Denny. I seriously doubt you noticed me.\"\\n\\n Kellan stopped walking, and I stepped into his chest. Being here, in the parking lot of Pete\u0027s with him, felt just as much like home to me as our cozy little love nest up the road. He said, \"I could barely pull my eyes away from you. Just glancing at you made my head feel lighter, made my stomach . . . tingle. Watching you was life-changing.\"\\n\\n I couldn\u0027t help but be moved by his words. Then I remembered his very suggestive performance. I gave him a sly grin. \"And yet, you still managed to mentally undress every female in your audience.\"\\n\\n Kellan laughed as he resumed walking. \"Yeah, okay, I\u0027ll give you that one.\" He cocked a brow at me. \"I did notice you, though. How could I not?\"\\n\\n As I mulled over his question, Griffin stormed in front of us. With as much dramatic flair as he could muster, he burst through the front doors. As I was usually on the inside of the room when Griffin made his grand appearance, it was a little strange for me to walk in after the egomaniac. Kellan let out an amused laugh as he grabbed the swinging door and held it open for me. I kissed him on the cheek as I walked through.\\n\\n The bar erupted into a chaotic melee of cheers, shouts, and whistles. The volume made me cringe. Rachel too, as she walked in with Matt. Within seconds, the boys were surrounded by a cluster of new fans and old regulars. Kate and Jenny gave Rachel and me a warm greeting while the boys were swarmed. Standing away from the guys, by the bar with the girls, I marveled at how familiar and different Pete\u0027s was. This used to be a quiet place of solace for Kellan, but his newfound fame had followed him here, disturbing that peace some. Amid the noise circulating around the front doors, I heard whispers of Sienna\u0027s name while people gave me strange, confused glances. Guess she had followed us here too.\\n\\n I caught up with Rachel, Kate, and Jenny until the hullaballoo around the boys started to dissipate. Then Jenny went over to wrap her arms around Evan. The gentle giant scooped the tiny woman up into a huge hug, holding her thighs as she wrapped her legs around his waist. I heard Evan call her his \"Jujube,\" and smiled at whatever their private joke was.\\n\\n Rachel quietly walked away with Matt as soon as he could politely escape the limelight. Griffin was pulled over to a table of fresh-faced college girls, and eventually only Kellan was left in the swirl of eager and curious patrons.\\n\\n Turning to Rita, I decided to order the boys some beers while I waited for Kellan. Not surprisingly, Rita already had several bottles of their preferred beer on the counter. Nodding over at Kellan, the bleach-blonde asked, \"So what\u0027s really going on with Kellan and Sienna? Because by the looks of that video, that wasn\u0027t their first roll in the hay . . . or their last.\"\\n\\n Surprise washed through me at her question, not because she\u0027d asked it, but because I hadn\u0027t realized the video had been released. That must be why Sienna\u0027s name was being spoken in hushed tones around me. Looking over at Kellan frowning as he scratched his head, I shrugged. \"Don\u0027t believe everything you see.\" I returned my eyes to the appraising bartender. \"He\u0027s barely seen or spoken to Sienna.\"\\n\\n Rita smirked. \"Honey, when he was in his prime, he barely saw or spoke to any of them.\"\\n\\n I lifted my hand to show her my ring. \"We\u0027re still together.\"\\n\\n Rita whistled as she grabbed my hand. \"Damn!\" She glanced over at Kellan. \"Boy does have good taste.\" As I watched the middle-aged woman lick her collagen-injected lips, I didn\u0027t think that was entirely true. There had been points in Kellan\u0027s life when his taste was quite questionable.\\n\\n Once Kellan broke free from the inquisition, he made his way back to the band\u0027s traditional table. Sam had cleared it upon our arrival, and the displaced customers didn\u0027t seem too angry since bona fide rock stars were in their midst. Denny and Abby were at a nearby table having dinner. Kellan yanked their chairs over, making them sit with us, while Abby laughed at the move.\\n\\n Now seated on my right, Denny and I clinked glasses and toasted each other. We took a moment to catch up on our time apart while the boys at the table bragged about the success of their album. Flicking a quick glance at Kellan, Denny leaned over to me and asked, \"You guys still okay?\" His tone was laced with concern.\\n\\n Knowing he\u0027d probably seen the video too, I contained a sigh. \"You mean because of the music video, don\u0027t you? Yeah, I\u0027m fine.\"\\n\\n \"You\u0027ve seen it?\" he asked, his voice hesitant.\\n\\n \"Not the final version . . . but I watched the boys film it.\" The memory of seeing Kellan grinding with Sienna threatened to overtake the present, but I pushed it back. We had a lot to celebrate, and I wanted to enjoy it. I wanted to stay in the moment.\\n\\n \"Oh.\" Denny seemed genuinely shocked. I could understand his reaction. I could only imagine how hot the final video was, and combined with the sordid gossip about Kellan and Sienna running like wildfire across the countryside . . . Well, my being okay with the situation, and even being a watchful participant in the filming of it, must seem a world away from the timid, jealous, and selfish girl I\u0027d been a few years ago.\\n\\n \"I\u0027m sure it looks more intense than it actually was. It was pretty . . . tepid during filming.\" Well, at least for the first few takes, it was.\\n\\n \"Oh,\" Denny said again. \"It\u0027s just . . . very convincing.\"\\n\\n Setting down my drink, I looked over at Kellan on my left. \"We\u0027re great,\" I reiterated to Denny. He nodded, but I could tell by the look in his eye as he glanced at Kellan that he\u0027d ask me again if I was all right. He probably would every time he saw me.\\n\\n Anna showed up when she was finished with work. Wobbling over to our table, she plopped herself on Griffin\u0027s lap. He\u0027d pulled himself away from the coeds\u0027 table once I had started doling out beers. Griffin choosing beer over women had surprised me some, but with the smile on his face as Anna nibbled on his ear, I began to wonder if maybe women didn\u0027t hold the allure for him that they once did; he sure seemed content with my sister wriggling around his privates.\\n\\n As it was a Friday night, Poetic Bliss showed up not too much later and took to the stage. Rain made a huge deal about Kellan being in the audience. While he laughed, she rushed to his table and dragged him to the stage. The awaiting crowd starting screaming with excitement. Holding his hands up, Kellan playfully batted the spunky rocker chick away from him. She dodged his mock blows, holding her hands into little fists; the pleated skirt she wore was so short that I could see the edge of her underwear when she crouched down. Even though I hated that the pair had a history, I had to laugh at the cute display they were putting on.\\n\\n After another minute of playful pretend fighting, Kellan finally caved and grabbed her microphone. Twisting to the crowd, he muttered, \"Hey.\" His one word caused an ear-splitting shriek to rip around the bar. It made my ears ring. Kellan laughed. Holding a hand up, he told the crowd, \"It is so fucking good to be back here at Pete\u0027s!\"\\n\\n More shrieking. My sister held her fingers up to her mouth and whistled. It had always made me a little jealous that she could do that; I couldn\u0027t whistle with my fingers to save my life. Kellan looked out over the bar, his deep blue eyes sparkling. \"You guys mind if the D-Bags take over for a song or two?\"\\n\\n There was no doubt by the crowd\u0027s reaction that they didn\u0027t mind in the slightest. Kellan looked back at the other members of the girl band. They were all nodding, clapping or whistling, willing to share their spotlight. Kellan smiled, then indicated for his band to join him.\\n\\n Griffin wasted no time hopping up out of his seat. He nearly toppled my sister to the ground in his excitement, but Denny caught her and helped her into a chair. She grudgingly thanked him while Matt smacked the back of Griffin\u0027s head. The table next to us chuckled at the familiar sight of the cousins fighting.\\n\\n Once all the boys hopped on stage, the girls handed them their instruments. Griffin frowned as Tuesday handed him her bright pink bass guitar. Blessing handed Matt her teal guitar, while Evan tucked himself behind Meadow\u0027s drums; the band\u0027s logo on the drum had a giant purple flower in the background. The girls shifted to the sides of the stage to give the boys room, while the crowd sniggered over the guys playing such feminine instruments. Rachel got such a bad case of the giggles that she started hiccupping.\\n\\n Shaking his head, Kellan\u0027s amused expression made my heart beat harder. Kellan on stage. Nothing on earth could compare. The crowd agreed with me. Their eruption of noise when Evan started the intro vibrated the windows and created rings of distortion in Anna\u0027s glass of water. Running a hand through his hair, Kellan began to sing a popular D-Bags song. Every one of the old fans in the crowd started singing along, while the new fans continued shrieking.\\n\\n Pulling the microphone from its stand, Kellan began his \"strut.\" It was a seductive back and forth saunter across the front edge of the stage that let every woman watching know that he was aware of them. He locked eyes with every single one of them, giving them half smiles and cocky grins between the words he was singing. At various points along his path, he would stop, put his foot up on a speaker, and lean over to extend his hand to a few fans. They always reached back for him, squealing as their fingertips brushed his.\\n\\n It used to send tiny bolts of jealousy through me, but seeing his amusement and their joy, all I felt was happiness watching him. He had a beautiful, almost symbiotic relationship with his fans; they fed off his energy, he fed off theirs. As the song neared its climax, Kellan stopped in the center of the front of the stage. Face full of playful expectation, he sang the crowd a question, \"Is this all you want?\" They passionately shouted back their answer.\\n\\n When the song ended, the D-Bags immediately moved into another one. I wasn\u0027t sure if they were using a set song lineup, or if Evan just randomly decided which song to start playing next and the rest of them went along without hesitation. They\u0027d been playing together for so long, maybe it was a little bit of both.\\n\\n Their next song was fast and catchy, and Jenny and I dragged Rachel onto the floor to dance with us. Anna joined in, bumping and grinding despite her growing curves. I noticed Denny pulling Abby to the side of the crowd; they danced with bright smiles on their faces-no pain, no jealousy, just peace, which is what I\u0027d always wanted for him.\\n\\n When the song was over, Kellan took a quick bow, thanked the crowds, and then jumped right into the midst of them. He waded through a sea of wandering palms to get to me. Our arms wrapped around each other and eventually the friendly fingers of fans backed off. Kellan gave me a few light kisses as Rain\u0027s voice broke over the microphone. \"Thank you, boys, but it\u0027s the girls\u0027 turn to kick ass now!\"\\n\\n Kellan looked back at her, laughing as they started one of their driving beats. Jenny headed back to work while Rachel slinked off to join Matt at the table. Anna meandered to a stool to sit down. Griffin headed over to nibble on her ear for a while. Denny gave me a small wave as he headed toward the doors with Abby. Kellan and I stayed in the thick crowd, dancing to Poetic Bliss\u0027s infectious beat. It had been a while since I\u0027d danced with Kellan; the boy had moves. Sliding up behind me, he swayed his hips with mine in such a seductive way that I suddenly wanted to stop this public celebration and have a much more private one instead. Breath hot on my neck, he ran his nose up the side of my throat. Closing my eyes, I laid my head on his shoulder and reveled in the feeling of his body against mine. With a soft kiss on my jaw, he said over the music, \"Wanna go somewhere with me?\"\\n\\n Boy, did I ever.\\n\\n His hands slid down my hips, subtly pulling them back into his. I didn\u0027t need to feel his body to know what he was in the mood for, but feeling the outline of him through his jeans sparked a fire in mine. Twisting my head to look at him, I gave him a playful half smile and nodded. His corresponding grin was as devilish as the sudden gleam in his eye.\\n\\n Biting my lip, I tugged him through the crowd of people until we got to the hallway. People tried to stop us as we moved along toward the back room of the bar, where only employees were supposed to go, but I expertly weaved us around them. Sliding around a couple of girls coming out of the bathroom, we slipped into the back room, quickly closing the door behind us.\\n\\n Kellan pressed me into the door, turning the lock on it as he did. \"New lock still works,\" he whispered, leaning in for my mouth. I chuckled as I drew him into me. It might have been the dancing, or the few beers I had, or seeing him on stage, or just the novelty of showing affection for him in public-something we hadn\u0027t been able to do much while on tour for the single-but I desperately wanted him.\\n\\n While our mouths frantically worked together, my fingers slid down his chest to unfasten the button of his jeans. Groaning, his hands started in on mine. As I unzipped his jeans, I looked over his shoulder, just to make sure we were alone. The room was fairly open, I didn\u0027t see anyone hiding anywhere, so I found his lips again and closed my eyes.\\n\\n As Kellan started to shove my pants down my hips, I slipped my hands into his jeans. He was so ready for me, hard and straining against my palm. He whimpered a bit as I squeezed him. My breath was fast as I fed off of the fiery passion I felt from him. It was like he was going to explode if he didn\u0027t have me. I was sure he was already on the edge, and just the slightest touch would send him right over. Remembering something Kellan had said once, to Denny, of all people, I stopped his hands from removing my clothes. He made a noise that sounded close to a growl as his fingers curled around my jeans. Well, we were celebrating, perhaps I should give him a present, something I didn\u0027t typically do for him-but maybe I should, since most guys like it. Or so I\u0027d heard.\\n\\n Pushing him away, I slid my back down the door. Kellan watched me descend with clear confusion on his face. \"Kiera . . . ?\"\\n\\n When I stopped at his waist, he stopped breathing. The look on his face was as clear to me as if he\u0027d begged: Please do what I think you\u0027re going to do. His finger slowly reached down to trace my jaw, and I felt more powerful, more desirable, and more beautiful than I ever had before. Not able to pull myself away from his intense eyes, I adjusted his clothes so he was exposed. The anticipation grew as we stared at each other. Kellan started breathing again, faster than before. He didn\u0027t say anything, didn\u0027t pressure me in any way, just continued to beg me with his eyes. When I noticed he was trembling, maybe fighting back the urge to bring my lips closer to him, I lowered my mouth and took him in. Kellan gasped, then groaned. I heard a thud as his forehead hit the door. I had tasted him before, on several occasions, but usually just a small lick or two when we were both rolling around naked. Nothing like this. Nothing that was so blatantly just for him.\\n\\n As Kellan\u0027s erotic breaths picked up the pace, his hand cupped my cheek. He stroked my skin with his thumb while I did my best to relax as I moved over him. Faster than I thought it would take, I felt him tense and knew he was close. It was a now-or-never sort of moment, and I wasn\u0027t sure what I wanted, but I knew I wanted to satisfy him, and I knew what I would want if the roles were reversed. Kellan had his own thought on the matter, though. Murmuring my name with a light groan, his hand moved to my shoulder and he tried to push me back. I grabbed his hips and pulled him deeper into me. I\u0027d committed to do this, and I would see it through to the end.\\n\\n My aggressive move pushed Kellan over the edge. Crying out, he grabbed the door handle and squeezed it as he released; I could hear the metal rattling in the lock. It was enough to distract me from the taste . . . which wasn\u0027t quite as bad as I\u0027d imagined.\\n\\n After he slowly came down, I adjusted his boxers and slid my way up the door. His head was still resting against the wood, his eyes closed as he breathed in and out of his mouth. His face, his look, his reaction . . . I don\u0027t think I\u0027d ever been so turned on in all my life. Slinging my arms around him, I nestled into his chest.\\n\\n He shifted to bury his head in my neck. \"Holy . . . oh my . . . fuck,\" he muttered.\\n\\n His body sagged against mine and I giggled at his complete lack of coherency. I think I satisfied him. Stroking his back, I whispered, \"Don\u0027t swear.\"\\n\\n He chuckled and shook his head. \"Sorry.\" His voice was groggy, like he\u0027d just woken up.\\n\\n My body was blazing with need, but Kellan was still slumped against the door; he didn\u0027t seem to be in any shape to help me with my situation. And I didn\u0027t really want him to. I loved the fact that I\u0027d completely overwhelmed him, and I wanted this moment to just be about him. Reaching down, I slowly zipped up my pants, then moved my fingers over to zip up his. Still breathing deeply, Kellan pulled back and glanced down when he felt me fastening his jeans.\\n\\n \"What are you doing?\" he asked.\\n\\n Giving him a soft kiss, a kiss that a part of me really wanted to deepen, I told him, \"I\u0027m making you presentable, so we can finish celebrating with our friends.\"\\n\\n Kellan seemed even more confused by my answer. \"But you didn\u0027t . . . don\u0027t you want me to satisfy you?\"\\n\\n Just the inquiring angle of his head made me want to tear off his jeans and beg him to take me against the wall. But smiling at him, I shook my head. \"You did satisfy me.\"\\n\\n Kellan cocked his eyebrow. \"I did? Are you sure? Because you\u0027re usually more vocal when you\u0027re satisfied.\" He gave me a provocative grin.\\n\\n Biting my lip and rubbing my legs together, I debated changing my mind. Pushing him back a smidge, I told him, \"I may not have . . . finished . . . but you definitely made me happy.\" I swept a strand of hair away from his eyes. \"I want to give you this.\" Grabbing the doorknob behind him, I muttered, \"You can return the favor later.\" I could hear him chuckling as I stepped into the hallway.\\n\\n With the tour with Avoiding Redemption starting soon, the D-Bags dropped off of the face of the earth as they hid away with their significant others. I didn\u0027t see or hear from my sister for the next five days. When I wasn\u0027t visiting with old friends in the area-mainly Denny and Cheyenne-Kellan and I spent most of our dwindling free time tangled up in our sheets. I was very happy for my laptop; I could get some much needed work done while spooning with Kellan. And what greater writing inspiration could there be than that?\\n\\n Needing a break from the drama of my past, I closed my manuscript file and started surfing the Internet. Kellan lifted his head from the pillow and kissed my shoulder. \"You finally done with that?\"\\n\\n \"No, I\u0027m just taking a break. And no, you can\u0027t read it yet.\" Smiling, I typed in the name of his song with Sienna-\"Regretfully.\" Maybe I was crazy for wanting to watch it, but the curiosity had been eating away at me ever since Denny had called it \"convincing.\" Sienna wasn\u0027t why I wanted to watch it anyway. I wanted to support Kellan. He\u0027d released his very first video, and I still hadn\u0027t seen it. That didn\u0027t sit right with me.\\n\\n Kellan sat up, the sheet over his chest sliding to his waist. \"Well, good, because I didn\u0027t want to read it right now anyway.\" I gave him a hard look, and he threw on an innocent smile. \"I was finding the ceaseless typing relaxing, though.\" He glanced at the screen and frowned when he noticed what I was about to watch. \"You sure you want to see that?\"\\n\\n There were dozens of titles on the screen that were close matches to what I\u0027d typed in, but a still shot of Kellan\u0027s face was staring at me on the very top of the list. \"No, not really . . . but it\u0027s your first official video. I feel like we should watch it. Maybe it won\u0027t be so bad if we do it together?\"\\n\\n Kellan nodded and grabbed my hand. He tenderly kissed my wedding ring, an apology already on his face. I reached up to stroke his cheek, then turned back to the laptop. It felt hotter as it rested on my legs, like it was slowly burning a hole through the thin sheet covering me.\\n\\n After I clicked on the link for the video, a short ad for perfume started playing. I read some of the comments below the video while I waited. \"Kellan and Sienna are so hot together!\" \"OMG, I love these two!\" \"They need to be together! Are they getting married?\" \"I heard they already were!\" \"OMG, Kell-Sex forever!\"\\n\\n I frowned. Kell-Sex? The fans had already combined their names. Fabulous. And the moniker they\u0027d given them was downright God-awful. Couldn\u0027t they think of something a little more . . . poetic?\\n\\n The video started playing, and I clenched Kellan\u0027s hand. He didn\u0027t complain about how tightly I was gripping him. I could feel his eyes on me as I watched him and Sienna rolling around in a bed together. I\u0027ll admit, it was painful to watch at first, but after a while, I got sucked into the beauty and artistry of the video and I almost forgot that the man cringing in ecstasy was my husband. By the time the video ended, I saw what the fans were attracted to-Kellan and Sienna sizzled on screen.\\n\\n Kellan cleared his throat, and I twisted to look at him. He was searching my face for any clue of what I was thinking. Giving honesty a shot, I told him before he could even ask. \"The two of you look amazing together. I can see why the fans are so in love with the idea.\" Kellan started shaking his head, and I cupped his cheek to stop him. \"Were you really thinking about me throughout that entire thing?\"\\n\\n He nodded, his face intense. \"It was the only way I could get through it.\"\\n\\n My heart swelled as we stared at each other. He really did only have eyes for me. Pushing aside what the world wanted for him, I focused solely on what he wanted, what I wanted. Feeling languid and content, I asked him, \"Kellan Kyle, will you marry me?\"\\n\\n Moving the computer off of my lap, he gave me a teasing smile as he climbed on top of me. \"I thought you\u0027d never ask,\" he murmured, lowering his lips to my neck.\\n\\n \"Is that a yes?\" I asked, giggling.\\n\\n He ground his hips into mine as he brought his lips to my ear. \"With you, it\u0027s always yes.\"\\n\\n As he ran his lips down my skin, I thought about my mother . . . which was sort of a strange thought to have at the moment. But she\u0027d called me that morning asking about wedding invitations; she desperately wanted to get some ordered. She\u0027d tried to hide it over the phone, but I\u0027d heard the uncertainty in her voice as she talked about my future. She wasn\u0027t sure if the wedding was still on. She watched TV. She noticed the magazines at the store. She heard the gossip just as much as I did, and I\u0027m sure she had heard all about how hot and sweaty Kellan and Sienna were getting. If I were her, I\u0027d wonder if Kellan and I were still together too. I\u0027d reassured her that we were still getting married, but I hadn\u0027t given her a firm date.\\n\\n Before Kellan\u0027s lips found their way to my chest, I pushed him back. He looked up at me, eyes blazing with desire. I had to swallow twice before I could remember what I\u0027d wanted to ask him. \"How long is the break in the tour schedule for Christmas?\"\\n\\n Kellan looked over my shoulder, thinking. \"Ah, I\u0027m not sure. Four or five days, maybe a week?\" He looked back at me, a small smile on his face. \"Why?\"\\n\\n Shrugging, I looped my arms around his neck. \"Want to go to a wedding with me in Ohio?\"\\n\\n Rolling to my side, Kellan sat up on his elbow. \"Anyone I know getting married?\" he asked, amusement in his voice.\\n\\n Smiling, I shrugged again. \"Just some annoying wishy-washy girl that half the world hates.\"\\n\\n Kellan raised a brow, then lowered his lips to mine. \"They don\u0027t hate you.\" He chuckled against my lips. \"They don\u0027t even know about you. And you\u0027re not annoying or wishy-washy. At least, not anymore.\"\\n\\n He laughed and I smacked his shoulder. Jerk. Then I frowned. He was right about the \"Kell-Sex forever\" fans not knowing about me. And it was probably a good thing that they didn\u0027t. If they did . . . they would certainly hate me. Kellan kissed the corners of my mouth, erasing the worry lines. \"I would love to marry you in December . . . in Ohio . . . in front of your entire family.\" Pulling back, he gave me a wide grin. \"In front of my family.\"\\n\\n I ran my hand up his chest, fingering his tattoo. \"Can you find out the exact dates of the break? So I can tell my mom?\"\\n\\n He nodded and turned away from me, like he was going to do it right this second. I stopped him by pulling his shoulder back to me. His eyes flashed to mine as I placed a light kiss over his heart. \"Could you do it a little later though?\" I peeked up at him from under my eyelashes. \"I\u0027d like to have sex with you first,\" I matter-of-factly stated. Pride leaked into my smile; I\u0027d asked him for sex unsolicited, and I hadn\u0027t even stumbled over the words.\\n\\n Kellan\u0027s mouth opened in mock surprise. \"Why, Mrs. Kyle, I am shocked at your brazenness.\" Then he beamed at me like I was his star student. His sexual protegee. His sextegee. His lip curved up into a wicked grin. \"I\u0027m also incredibly turned on.\"\\n\\n He started to lean over me, but I pushed him to his back. Kellan laughed as I straddled him, but only for a minute; the sounds that came from him after that were anything but amused. \\n\\n","sourceLink":"https://allnovel.net/reckless-thoughtless-3/page-13.html","bookId":1885,"book":{"id":1885,"title":"Reckless (Thoughtless #3)","description":"Storyline: Reckless (Thoughtless #3) \\n When the band hits it big, Kiera and Kellan must ask themselves: Can their love for each other survive the constant pressures of superstardom? The friendships they\u0027ve formed, the new family they\u0027ve found, and the history they\u0027ve forged will all play a part in helping them navigate the turbulent waters of the band\u0027s exploding popularity. A greedy executive hell-bent on success, a declining pop star looking for an edge, and a media circus that twists lies into truths are just some of the obstacles the lovers will have to overcome if they are going to remain together. Fame comes with a price-but will it cost Kiera and Kellan everything?\\n","cover":"https://allnovel.net/images/reckless-thoughtless-3.jpg","author":"S.C. Stephens","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/reckless-thoughtless-3.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 4:56:27 PM"}}
