{"id":84097,"no":16,"title":"Page 16","content":"I was a bundle of restless energy as I waited for the boys to take the stage. Staples Center. They were playing at Staples Center! This was no small-to-moderately sized venue. This was an arena, and from what I could tell as I snuck a peek at the audience from backstage, it was sold out. I had no idea how many people that equated to, but I was sure it was in the tens of thousands. It boggled my mind.\n Kellan was fine as he lounged in a chair beside me, sipping on a beer; you would think it was just another night at Pete\u0027s from his breezy attitude. As I played with my necklace, yanking the guitar pendant from left to right in a repetitious pattern that was surely weakening the thin chain, Kellan had a lazy conversation with Deacon, the lead singer of Sienna\u0027s other opening act, Holeshot. They\u0027d been the only act until Nick had appropriated the D-Bags from Avoiding Redemption\u0027s tour.\n Kellan\u0027s eyes were amused as he watched me while shooting the shit with Deacon. Since my nerves where slowly eating holes through my stomach, I jumped to my feet and started pacing. Kellan and Deacon both watched me, entertained expressions on their faces. Deacon\u0027s band had a song on the radio too, but it wasn\u0027t doing nearly as well as Kellan\u0027s single with Sienna. Deacon didn\u0027t seem too upset that the D-Bags had been added onto the tour at the last minute, cutting into his set time. If anything, Deacon just seemed happy to have some guys to hang out with. Good thing, since the two bands were sharing a bus for the next several months.\n I watched Kellan and Deacon as they chatted about music. The pair were night-and-day different. Kellan had light brown, shaggy, bed-head hair. Deacon\u0027s was black, and longer than mine, nearly to his waist. Kellan had dark blue eyes, like the evening sky. Deacon\u0027s were so light blue they were almost white. While Kellan kept himself clean-shaven, Deacon had a neatly trimmed goatee. But about music, the two seemed equally matched.\n Luckily, I had plenty of room to pace, and I made the most of it. One thing I\u0027d noticed right away on this tour was that the security here was much tighter than the last one. On that tour, the backstage area had seemed like a frat house-women, booze, and rock and roll. This was a lot more regimented. A group of fans had met with the boys earlier after the sound check. Tory, handler extraordinaire, had been there to give the fans strict instructions on what they could and couldn\u0027t do with the rock stars. While the boys were busy onstage, Tory had barked at the group of radio contest winners like a drill sergeant until they were all docile and submissive. Listening to her go off on them had shocked me, and honestly, her \"rules\" made the whole affair awkward, for Kellan and the fans. In my opinion, if Tory had just let the bands and fans mingle organically like the other tour, it would have been a much more rewarding experience for both parties. She didn\u0027t seem to understand that the boys needed the fans just as much as the fans needed them.\n The only people backstage now were press, staff of the venue, roadies for the tour, and band members. In the dressing room where we were waiting, it was just the three of us. For some reason, the lack of people around was making me even more anxious for Kellan.\n Deacon pointed at me with a long finger. \"Is she always this nervous?\"\n Kellan smiled at me around the beer bottle he held to his mouth. \"Pretty much,\" he answered after he swallowed.\n The door opened to the room, and a man wearing a headset popped his head in and looked at Deacon. \"Show\u0027s starting, sir. You\u0027re up.\"\n Deacon nodded at him, then stood and stretched. \"Catch you guys on the flip side.\"\n Kellan nodded at him, then turned his attention to me once he was gone. \"Would you sit down, please?\"\n I pressed the palms of my hands over my stomach, trying to stop the butterflies from taking flight. \"Aren\u0027t you nervous? Even a little bit?\"\n Kellan took another swig of beer. \"Well, watching you is making me a little nervous.\" Setting his drink down on a nearby table, he patted his lap. \"Come over here and help me relax.\"\n Smirking, I walked over to him. He didn\u0027t have a nervous bone in his body. Not about this, anyway. This, Kellan could do naked in front of a million people and be just fine. There was something seriously wrong with him.\n I straddled his lap, tangling my hands in his hair. Maybe his calm would seep into me, if we got close enough. I placed a light kiss on his lips and Kellan let out a soft laugh. \"There, I feel better already.\"\n Loving the fact that we were surrounded by people and yet completely alone inside this dressing room, I ground my hips into his, and let my soft kiss turn into a deeper one. He let out a low groan and ran his hands up my back, under my shirt. I pressed my chest against his, delighting in the smell of him, musky and manly, the taste of him, slightly bitter from the beer, the feel of him, warm, hard, and yet soft too. Feeling lost and carefree, I let the world around us melt away.\n Kellan\u0027s fingers rubbed my back in soothing patterns while his tongue lightly brushed against mine. Then those tricky fingers of his unhooked my bra. Pulling back, I gave him an admonishing glare; we may be alone for now, but this place wasn\u0027t exactly private. His grin was cocky as he murmured, \"Oops.\"\n As I was reaching around to fix my bra, the door to our room opened again. I leapt off of Kellan\u0027s lap, twisting so that my back was to the far wall; I incorrectly latched the hook of my bra and had to try again. As my cheeks heated to flaming hot, Sienna sauntered into the room.\n Glancing between the two of us, she asked, \"Sorry, did I interrupt something?\"\n Smiling over at me, Kellan told her, \"Don\u0027t worry about it. We\u0027re getting used to it.\"\n Sienna laughed and sat down in a plush chair. \"That\u0027s a story I\u0027d like to hear.\"\n My bra finally back in place, I took a seat beside Kellan. My nerves started returning, and I bounced my heels to dissipate the energy. Holeshot had started to play, and their music filtered through the speakers. They were pretty good. Not as good as the D-Bags, but good. Kellan looked back at Sienna when she asked him, \"You ready for this?\"\n Kellan picked up his beer, showed it to her, then took a swig. \"All set.\" Sienna grinned and shook her head, amused by him; I sort of hated her being amused by him.\n Kellan and Sienna fell into a lively discussion about music. While he didn\u0027t enjoy the games Sienna played, I don\u0027t think he minded her as a person. When she started talking about her parents, Kellan got quiet. Her face void of emotion, Sienna told him, \"They would be screaming in my face right now, if they were still allowed at my shows. A little terrified . . . that\u0027s how they liked to send me out on stage.\"\n Kellan\u0027s expression turned thoughtful. \"I\u0027m sorry you had to go through that.\"\n \"Thank you.\" Sienna reached over and put a hand on his leg. My nerves about the show suddenly vanished as I watched her flirt with him. \"What are your parents like? Warm and fuzzy?\" she asked with a smile.\n Politely, but firmly, Kellan picked up her hand and placed it back on her own lap. She frowned, but didn\u0027t say anything. Leaning back in his chair, Kellan took another drink of his beer. \"No, definitely not.\" Setting his beer down, he shrugged. \"But, I don\u0027t have to worry about them anymore.\"\n I laid my hand on his chest and Kellan smiled down at me. I knew that casual sentence was filled with more pain than Sienna could possibly imagine. I lifted my lips to his, in comfort, and as a reminder to Sienna: He may sympathize with you, but his heart is with me. As Kellan gave me a brief peck, Sienna commented with, \"Family. It\u0027s not all it\u0027s cracked up to be.\"\n Thinking of my flighty sister, over-protective father, and wedding-obsessed mother, I tossed out, \"My family is great.\"\n Sienna\u0027s sad smile turned humoring. \"I\u0027m sure it is.\" Her dark eyes flicked between Kellan and I. \"So, will you two be creating a family of your own? Any kids in your future?\" Her gaze locked onto my stomach.\n Pulling my legs up onto the chair, I hid my body as much as I could. \"Someday, sure.\"\n Kellan bumped my shoulder with his. \"Maybe after we\u0027re officially married.\" He hesitated, then looked up at Sienna. \"Which, just so you know, is happening on December twenty-seventh, when the tour is on break for Christmas.\" Luckily Sienna\u0027s and Justin\u0027s tours were breaking for the holiday at the same time. If I\u0027d had to change the wedding date after Mom had already sent out the invitations, she\u0027d skin me alive.\n Sienna\u0027s lips twitched, but she very smoothly told us, \"Well, I suppose congratulations are in order.\" She looked like she wanted to hug Kellan to congratulate him, but the way Kellan and I were cuddling really wasn\u0027t giving her the opportunity.\n The same man who\u0027d come for Deacon came to usher Kellan onstage. Sienna stood up with Kellan. Extending her elbow to him, she demurely asked, \"Can I show you the way?\" Maybe it was my imagination, but the question seemed laced with dual meaning.\n Kellan didn\u0027t take her elbow, but gave her a polite nod of his head. I followed them out the door, my fingers loosely held in Kellan\u0027s. A group of men and women wearing lanyards sporting the name of one of the local radio stations spotted Sienna instantly. Of course, she wasn\u0027t hard to miss. She was in her stage outfit-a one-piece seventies-inspired jumpsuit littered with rhinestones that sparkled in the lights. It tied around her neck in a halter and had absolutely no back on it; it was so low that I could see the dimples beside her tail bone. And I\u0027d been trying very hard to ignore how deeply cut the V was in the front while we\u0027d been talking in the back room. I\u0027m assuming that a hefty amount of double-sided tape was keeping everything in place.\n \"Sienna! Can we have a quick interview? Maybe some photos?\"\n The bodyguards that seemed to flank Sienna everywhere she went didn\u0027t let the people through until Sienna spoke. \"Sure thing.\"\n \"With Kellan?\" A blonde in super tight jeans asked. The suggestive smile on her face was very unprofessional.\n Kellan jerked his thumb toward the stage. \"Sorry, I have to go.\"\n The blonde pouted at him, holding up a camera. \"Just a quick photo of the happy couple?\"\n Kellan rolled his eyes as he looked back at me. I was standing a little behind him, so the blonde probably couldn\u0027t tell that we were holding hands. Locking eyes with the blonde, he pointed at Sienna and firmly told her, \"We\u0027re not together.\"\n The blonde gave Kellan a knowing smile. It was so clear to me that she was thinking, Got it, you don\u0027t want to talk about your relationship with Sienna yet. Your secret is safe with me. Kellan looked like he wanted to set her straight, but I tugged on his arm. He\u0027d have to point out who I was to effectively set her straight, and I didn\u0027t want to be a part of this spectacle. Besides, the man wearing headphones was frantically waving at us to hurry.\n As we turned away from the press, I noticed Sienna blowing Kellan a kiss. Before we were out of earshot, one of the radio personalities pointed at me and asked, \"Who\u0027s that?\"\n Her smile still bright and charming, Sienna immediately answered, \"Just an old friend of Kellan\u0027s.\" She smirked a bit after she said it, then all of her attention was given to the interviewers.\n Kellan didn\u0027t hear, but I glared daggers into her back, not sure if I should be angry or not. She had called me an old friend when she could have just said \"nobody,\" and left it at that. I just wasn\u0027t sure what to feel for Sienna. One minute she wasn\u0027t so bad, then the next she was just as manipulative as Nick. I couldn\u0027t tell what her deal was.\n Thinking of old friends and sorting through my feelings got me thinking of Denny. The All Access pass around my neck let me go anywhere I wanted backstage, so I took out my cell phone and snapped a few pictures to send to him. Making my way to where I could watch the boys play, I snapped a pic of the massive crowd jumping up and down. Right after I sent the photo with a message that read, Can you believe the size of this crowd? I noticed a huge sign that a fan was holding high in the air-Kell-Sex forever! God, I really hated that nickname.\n Denny texted back while I was looking around the dimly lit arena for more signs. Damn, I\u0027d be crapping my daks if I were him. I suppose he\u0027s not the least bit nervous, though, is he?\n I laughed as I texted back that he was fine. Phlegmatic, even.\n The stage was dark as the lights dramatically danced across the crowd in haphazard patterns. The fans roared in delight and lifted their arms in the air. Then all of the lights simultaneously swung toward the stage, and the mob screamed. Kellan and the boys had stepped out while they weren\u0027t looking. Once the people realized they were standing there, waiting, they went nuts; it was easy to see that the fans were losing their minds over the fact that the D-Bags had been added to the tour. The noise vibrated my chest. I covered my ears as I laughed. From my vantage point, I could see Kellan shaking his head a little bit, completely blown away by the swaying mass of bodies before him. Even though I\u0027d seen him do this a thousand times before, excitement flooded through me as I watched him approach the microphone.\n \"Good evening, Los Angeles!\"\n The answering squeals vibrated my skull. Adjusting the guitar strapped over his chest, Kellan flashed the crowd a panty-dropping grin. I saw someone in the front row fall back into her friends; guess her knees gave away.\n As the rest of the boys got into position, Kellan raised his hand in the air. The crowd silenced . . . sort of. \"We\u0027re the D-Bags, and we\u0027re honored to be playing for you tonight.\" The silence evaporated into shrieking. Kellan put both hands up to quiet them. \"Now, we\u0027re only going to play for you if you\u0027ve been good.\" Unhooking the microphone, he walked up to the edge of the stage and looked down on the crowd at his feet. \"So . . . have you been good?\" he asked, his voice dripping with sensuality.\n The crowd\u0027s response was so loud that I almost didn\u0027t hear Evan start the intro. I was sure that Kellan and the guys only heard it because of the earpieces they were all wearing. Giving the audience a glorious view of his backside, Kellan sauntered back to his microphone stand. Sliding the equipment back into place, Kellan started playing his guitar. It was miked as well, and the twang echoed around the arena.\n They were playing a song that was classic to me, but new to most of the fans here. The crowd ate it up. Kellan\u0027s voice was perfect and powerful; it made a shiver run down my spine. He really was so good at this, so inspiring to watch. As he played, words and storylines filtered through my head. Even though I hated to turn away from Kellan, I decided to not let this creative spark get away from me. As quickly as I could, I dashed away to find some paper. By the time I got back to my spot, the D-Bags had switched songs. Kellan\u0027s guitar was resting near his empty microphone stand, and Kellan was strutting back and forth near the edge of the stage, tantalizing the crowd with his proximity.\n Words were tumbling through my brain as his voice drifted past my ears. Watching a movie play out in my head, I jotted down everything I saw. It was a completely different story I was seeing than the tragedy of my past that I had been working on. Switching to something new brought a huge smile to my lips. Writing was so rewarding. And writing while listening to Kellan perform live was darn near euphoric.\n Kellan found me after his set was over, and I practically leapt into his arms I was so proud of him. He was giddy as he swung me around in a circle. Just like after their other shows, the audience was shouting for the D-Bags, shouting for Kellan. Setting me down, Kellan peeked out over the crowd.\n Evan and Matt were awestruck. Griffin looked like he\u0027d expected nothing less. Smacking Kellan\u0027s shoulder, he told him, \"We gotta give \u0027em an encore.\"\n Kellan looked back at the bassist and shook his head. \"We don\u0027t have time to play another song. It\u0027s Sienna\u0027s show, and she\u0027s big on structure.\"\n Griffin pursed his lips then grabbed Kellan\u0027s arm. \"What the fuck do I care about Sienna?\" Shoving Kellan forward, he smirked, \"It\u0027s our time to shine, baby.\"\n Matt and Evan pushed him forward too. Matt said, \"Just pop your head out and wave.\" As Kellan shrugged, Matt looked back at me and laughed. \"Plug your ears, Kiera.\"\n Grinning at the group as they dashed back onto the stage, I did as Matt suggested. Good thing too. My eardrums may have burst if I hadn\u0027t. A panicked staff member frantically waving his arms at the boys finally got them to come down from their spotlight. They were all laughing as they joined me again. I couldn\u0027t help but be caught up in their excitement.\n Kellan wrapped his arms around my waist as the hollering from the crowd died down. \"We have to stay close by to join Sienna for the final song, but the guys and I were thinking about running across the street to the bar. Wanna come?\"\n A part of me wanted to stay where I was so I could work on the new novel that had sprung to life during Kellan\u0027s performance, but Kellan\u0027s grin was contagious, and there was no way I could say no. Besides, there would be countless live performances in my future to draw inspiration from. As I nodded, Kellan pointed at the notepad I was hugging to my chest. \"Were you writing?\" My emphatic nod continued and he asked, \"While I was singing?\"\n \"You\u0027re very inspiring to watch,\" I stated.\n His face was incredulous as he ran a hand through his slightly damp hair. \"I . . . inspire you?\"\n Stars in my eyes, I sighed, \"Daily.\"\n Kellan looked at me like I\u0027d just grown another head. \"And you say I\u0027m absurd.\" I laughed until he pried the notebook away from me. I tried to snatch it back, but he handed it to the man in a headset who\u0027d retrieved him from the dressing room. \"This is priceless, literary genius, and you need to guard it with your life.\"\n The man\u0027s eyes went wide as he held it close. \"Yes, sir.\" I almost thought he was going to salute us.\n Satisfied, Kellan told him, \"Make sure it ends up inside my guitar case, please.\"\n \"Yes, sir,\" the man said again before he took off.\n \"Did he just call me sir . . . twice?\" Kellan laughed as he slung his arm around my waist.\n I lightly smacked his stomach. \"Don\u0027t let it go to your head.\"\n He looked down at me with a grin. \"Wouldn\u0027t dream of it.\"\n The group of us headed toward the exit after that. Matt and Griffin were leading the way, sneaking around corners like we were robbing the place. \"Are we allowed to leave the arena while the show is going on?\" I asked Kellan.\n He laughed as he looked around. \"We have no idea . . . hence Spy vs. Spy up there.\"\n Avoiding every person that we could, we crept our way to a set of doors marked with an Exit sign. We stealthily made our way down a hallway that Matt said let out by the busses. We weren\u0027t going to the busses, but no one around needed to know that. When we got outside, a guard was stationed outside of the door, keeping an eye on things. The guys nodded at him, walking past like they owned the place. Either the guard recognized them as rock stars, or saw my go-anywhere pass. Either way, he didn\u0027t question any of us as we left the arena. I suppose he was more concerned with people trying to get into the backstage area than people leaving it.\n When we got onto the regular street, that one security guard was the only person who knew we were gone. That sort of freedom gave us all a buzz; there was a lot of giggling and playful ribbing. I loved being included in it. Griffin scoured the street, trying to figure out where we were in relation to the nearest bar while Kellan nudged Matt\u0027s arm. \"You know what time we should be back, right?\" Matt nodded as he tapped the watch on his wrist. I hoped he did. It would not be good if the boys were late.\n Suddenly, Griffin pointed to his right and shouted, \"Bar, ho!\"\n He immediately started sprinting toward his alcoholic haven. Matt and Evan took off after him, both of them laughing. Kellan looked over at me. \"Last one to the bar has to sit by Griffin.\" I darted away before he even finished his sentence.\n I had a serious ache in my side when I stepped on the rubber welcome mat, but my foot came down a half-second before Kellan\u0027s, so I considered that a victory. Hands on my knees, I struggled to catch my breath as I peered up at him. It had been a while since I\u0027d sprinted. \"Beat \u0027cha,\" I panted.\n Kellan was breathing heavier too as he pulled the door open. \"I let you win. I liked the view.\" He winked at me as I ducked inside.\n I expected every sound in the bar to stop when the D-Bags walked in, but nobody here seemed to know who they were. I loved that they still had some anonymity. Kellan was the only one who caused a stir, but I didn\u0027t know if that was recognition, or if it was just his looks that were causing a ripple of whispers to float around the small circular tables.\n Griffin made his way to a table in the back and we followed him. When we all arrived, his face turned oddly serious. \"Same rules as last time.\"\n Matt rolled his eyes while Evan laughed and shrugged. Kellan frowned and glanced at me. \"We\u0027re not playing that game tonight, Griff.\"\n Griffin eyed Kellan up and down. \"Uh, yeah, we are.\" His smile turned arrogant. \"What? Afraid you\u0027ll lose?\"\n Evan turned to Matt. \"When has Kellan ever lost?\"\n Curious, and wondering if I wanted to know what game they routinely played at bars while on tour, I asked, \"What game?\"\n Kellan turned to me. \"It\u0027s stupid . . . Griffin came up with it.\" He said it like Griffin and stupid were synonymous.\n Griffin snorted. \"You\u0027re a pansy. All intimidated \u0027cuz your girlfriend\u0027s here?\"\n \"Wife,\" Kellan corrected.\n \"Whatever, we\u0027re playing. Turn out your pockets.\" He instantly pulled the innards out of his jeans. They were empty.\n Kellan looked over at me and, too curious to say no, I nodded. Kellan turned out his pockets, which were also empty. After all the guys did it, Griffin looked satisfied. \"Good. Now, numbers count as one point, condoms count as five. The person with the least amount of points picks up the tab. The stud with the most gets a shot from everybody . . . and top shelf shit too.\" He pointed at each guy in turn. \"And cheating in any way is grounds for immediate ass-kickery.\" His fingers pointed at his own eyes, then Matt\u0027s. I\u0027m watching you. Matt sighed.\n Still trying to wrap my head around the point system-condoms?-I asked, \"Wait, what game?\"\n Griffin squatted in front of me. \"The dude who fills his pockets with the most chick\u0027s phone numbers wins.\" He said it slowly, like I was already drunk so I couldn\u0027t possibly understand him.\n My eyes widened, and I turned to Kellan with an eyebrow raised. \"And you haven\u0027t ever lost this game?\"\n Kellan lifted his hands in the air. \"Completely unsolicited, I swear.\" I pursed my lips at him and Kellan scratched his head. \"You, uh, want a drink?\"\n I gave him a tight smile. \"Mmm-hmm.\"\n Kellan immediately tucked tail and headed for the bar. I had to laugh a little as he waded through the crowd with his head down. Evan wrapped his arm around my shoulders. \"He really doesn\u0027t ask for any. He doesn\u0027t have to. Girls tend to . . . shove things Kellan\u0027s way.\" His raised his eyebrow, and the ring pierced through it sparkled at me; it nearly matched the amused gleam in his eye. \"Just you watch.\"\n Curious, I turned around to observe my husband. As he waited at the bar for our drinks, he was approached by a couple of girls. They hadn\u0027t talked to him for more than five seconds before one of them was sliding a napkin his way. My jaw dropped. That was so fast! Griffin was apparently just as shocked as I was.\n \"You\u0027ve got to be fucking kidding me!\" He raised his hands in the air. \"You\u0027re a whore!\" he yelled at Kellan. Some girls, maybe thinking he meant them, looked back at Griffin with scowls on their faces. I figured none of them would be approaching him with their numbers tonight.\n Kellan looked back at our table. Seeing my amused smile, Kellan teasingly waved the napkin at Griffin, then stuffed it in his pocket. Griffin\u0027s scowl grew. \"No way that cocksucker\u0027s pulling one over on me again.\" He disappeared into the packed bar, and I had the distinct feeling that every one of his phone numbers would be \"solicited.\" Heavily solicited. Perhaps bribed.\n I knew the game should have disgusted me, but aside from Griffin, none of the guys actively tried to get phone numbers. Their natural good looks and charisma did it for them. Their quickness to laugh and easygoing personalities drew a circle of people around them. It was almost like we were back at Pete\u0027s. I even had to stop myself from clearing off a table once or twice. But, unlike Pete\u0027s, Kellan merely had to walk by a woman to get her to discretely shove a finger in his pocket. He didn\u0027t acknowledge the slip, or the girl, and I began to wonder if maybe I was wrong. Maybe this was exactly like Pete\u0027s and I just didn\u0027t realize it. Maybe Kellan got slipped numbers at our bar back home and I had never noticed. Well, if he did, he was quick to discard them.\n It also helped that all of the guys treated the game as a big joke. Whenever Kellan grabbed a drink at the bar, or went to the bathroom, someone asked him how many names he\u0027d nabbed when he returned. When Griffin sulked his way back to the table with an irritated expression, Matt gave him an exaggerated, sympathetic, \"Ah, no luck?\" to which Griffin responded with grace by flipping him off.\n Drinks and merriment abounded at our table, and I grew to love my decision to roam around the country with D-Bags more and more. When everyone was feeling no pain, the alarm on Matt\u0027s watch went off. We all stared at it for a second, then remembered that there was still a show going on.\n \"Shit, Sienna\u0027s set is almost over. We have to go.\" Matt looked a little panicked as he downed his beer.\n Everyone started to leave the table but Griffin threw his hands out. \"Wait! We need a winner. Pockets.\"\n As I stifled a drunken giggle, I wondered which guy would be breaking the most hearts tonight. My bet was on Kellan. I eagerly leaned into his side, like he was laying down a winning poker hand, not phone numbers from girls. Evan started the process, slapping down a single phone number scrawled on a wadded up piece of paper. \"Just one.\" He shrugged, not really caring.\n Exalted, Griffin tossed down a napkin, a business card, and . . . I swear . . . a section of toilet paper. \"Ha! Three! Read \u0027em and weep.\" He crossed his arms over his chest and glared at Kellan.\n Knowing he had to have way more than that, I nudged him in the ribs. Kellan shook his head at me, then pulled his prizes from his pockets. He had to unfold them all he had so many. \"Uh . . . five,\" he muttered, throwing them on the table.\n Griffin slammed his hand on the table. \"Damn it, Kellan! I fucking hate you.\"\n Evan raised an edge of his lip. \"Just five? Slow night, Kell?\"\n Kellan laughed at Evan, while Griffin muttered, \"Fine, prick, what shot do you want?\"\n \"What about Matt?\" I asked, looking over at the quiet guitarist; he was watching the exchange with a secretive smile on his lips. \"How did you do?\"\n Matt was about to answer when Griffin interrupted. \"Pfffft, no way Matt beat Kellan . . . it\u0027s over.\" He raised a pale eyebrow. \"Unless . . . someone slip you a condom?\"\n Matt slowly shook his head. \"No . . .\" Reaching into his pocket, he slowly pulled out a flat credit-card looking thing. His cheeks brightened with color as he tossed it on the table. \"I got a motel key.\"\n By the whooping and hollering the guys did, you would think Matt had just won the lottery. \"Holy shit!\" Griffin exclaimed. \"That\u0027s an instant win!\" Bouncing on his feet, Griffin grabbed Matt\u0027s shoulders. \"Oh my God, you beat Kellan!\" Turning Matt around, he showcased him to the bar. \"Everybody! This is my cousin right here, and he just dethroned God\u0027s Gift to Women!\" He rubbed Matt\u0027s head with his knuckles while Matt turned about a bazillion shades of red.\n Slipping away from him, Matt hurried out of the bar. Griffin raised his hands. \"Dude? Your shots?\"\n Evan was laughing so hard he had to wipe tears out of his eyes. I couldn\u0027t stop laughing either. When Evan could talk, he mumbled, \"I guess I lost,\" and started reaching for his wallet.\n Kellan stopped him and handed the waitress a folded up one hundred dollar bill, or maybe two of them. I wasn\u0027t sure. \"I got it, Evan.\"\n Evan clapped his shoulder. \"Thanks, Kell,\" then stumbled after Matt and Griffin.\n Kellan grabbed my hand and pulled me after them, leaving the motel key and the stack of phones numbers sitting on the table. It made me smile that not a single member of the band kept any of the numbers . . . not even Griffin. When we got outside, Kellan asked me, \"So, you\u0027re really not mad?\"\n I gave him a sarcastic smile. \"I\u0027m furious.\" Kellan raised an eyebrow at me, and I laughed again. \"It only would have made me mad if Griffin had beat you.\"\n Kellan looked over at where Griffin was announcing to the street that his very embarrassed cousin\u0027s \"balls had just dropped.\" Shaking his head, Kellan murmured, \"Never would have happened.\"\n Under Matt\u0027s insistence, the very buzzed D-Bags stumbled their way back into the arena with me. Getting past the security guard near the back entrance was a little trickier than leaving it had been. It was a different guard than before, and he kept asking for proof that the boys were really in the show. Kellan, Matt, and Evan had their clearances with them, but Griffin had forgotten his. Everyone was too drunk to come up with anything logical sounding; Griffin just kept showing him the pass around my neck, but that only allowed me access. Luckily Deacon was relaxing in the bus, overheard the argument, and grabbed Griffin\u0027s missing credentials for him.\n Once inside, the boys made a beeline for the stage. An overwrought person with a clipboard hurriedly pulled them toward the rear entrance of the stage. Before Kellan disappeared, he grabbed my face and kissed me. The alcohol on his breath was strong; hopefully he remembered all of the words to the duet he was about to do.\n I moved back into my favorite place to watch Sienna announce her special encore to wrap up the evening. The crowd went nuts, already suspecting what it was going to be. Light-headed and giddy, I tried to whistle along with the crowd. It came out flat and airy, more like I was blowing up an inner tube.\n Sienna\u0027s arm swished to the back of the stage. \"Ladies and gents, please put your hands together again for the D-Bags, led by the outstanding Kellan Kyle!\"\n Maybe it was because I was tipsier than before, but the screams seemed extra piercing. The boys hobbled out, only half stumbling as they switched places with Sienna\u0027s band. Kellan walked up to stand beside Sienna, and she grabbed his hand then leaned over to kiss his cheek. I really wished she\u0027d stop doing that. Kellan discretely pulled away from her as he acknowledged the crowd. Wondering if any of the forward girls at the bar tonight realized just whose jeans they\u0027d been shoving their numbers into, I watched Kellan and Sienna start their number-one hit.\n Even though Kellan had stumbled and fallen onto a streetlamp on our walk back to the center, he seemed completely with it as he sang about his imaginary heartbreak. When Sienna stepped to his side to sing her part to him, she was so close I was sure she could smell the fumes wafting from him. Instead of facing the audience, Kellan and Sienna kept the song insular, singing toward each other, virtually ignoring the crowd. It amplified the pain in the song. Flashbulbs went off like crazy, capturing every heated moment. When the song ended, Kellan made like he was going to storm off of the stage, like he was so angry he couldn\u0027t stand to be near her anymore; that matched the way the video ended. Sienna changed it up, though. Grabbing his arm as he walked past, she yanked him into her body. Too drunk to resist, Kellan collided with her. Quickly reaching up, she pulled his head down to hers. Their lips collided next, and then the stage faded to black; only the flashes of cell phones lit up their bodies.\n The response from the crowd was thunderous. I was so stunned, I couldn\u0027t move.\n So much for Sienna respecting Kellan\u0027s wishes.\n Even though I was sure Sienna had mainly kissed him in front of the audience for the photo op, I had the overwhelming sensation that she was also declaring her personal interest in Kellan. Her dramatic affirmation hit me like a wrecking ball in the gut. Well, of course she wanted him. Who wouldn\u0027t? But he was my husband, and she couldn\u0027t have him.\n Knowing I was probably about to get myself kicked off of the tour, I stormed to the rear entrance to the stage where the performers would just now be stepping down. I felt my hands balling into fists and wondered if I was about to clock a superstar. I wanted to. She\u0027d gone too far.\n As I worked my way to the back, Kellan was stomping down the stairs and shoving people out of his way. His face matched my fiery mood. Evan was a step behind him, calling his name. Sienna was on the top of the stairs, her hands on her hips. \"You\u0027re overreacting, love,\" she called after him.\n Lips tight, Kellan closed his eyes. I paused and watched him. That was usually the face he made when he was about to rip someone\u0027s head off. Turning back to Sienna, he pointed up at her. \"I told you, not on the lips!\"\n A sweet smile on her face, Sienna breezed down the stairs past Evan; he tensed as he noticed Kellan\u0027s expression. Sienna stopped at Kellan\u0027s side and put a hand on his rigid arm. \"I got carried away by the heat of the moment. Won\u0027t happen again.\" She shrugged, her long, sleek ponytail bouncing around her shoulders.\n Seeing right though her, I stepped forward. \"Hell right, it won\u0027t happen again!\" Maybe it was the liquid courage in my belly, but I suddenly wanted to give this woman a smackdown. Yeah, definitely the booze talking. \"He doesn\u0027t belong to you!\"\n Someone grabbed my shoulders as I lurched forward. I thought it was Kellan at first, but looking behind me, I saw one of Sienna\u0027s ever-present bodyguards holding me back-Thing 2, I think. Face serene, Sienna stepped in front of me. \"He\u0027s a person, love, so he doesn\u0027t belong to anyone.\"\n She gave everyone watching a cool glance, like all of this drama was beneath her. When her eyes returned to mine, there was fire in the dark depths. \"And in case you didn\u0027t notice, he didn\u0027t exactly pull away from me.\" Her challenging eyes swung to Kellan; his jaw tightened, but he didn\u0027t say anything. Satisfied, Sienna stalked off, and Thing 2 let me go.\n I huffed as I straightened myself. She had a point. I locked eyes with Kellan. The people around us resumed what they were doing now that the mini-fight was over. Evan patted my shoulder as he walked away with the other D-Bags. Matt tore Griffin away. Thankfully, or maybe unthankfully, no one from the media had witnessed the \"lovers\u0027\" spat. I didn\u0027t know what to think of my husband at the moment. Part of me understood-he was a performer, he was on stage, he wouldn\u0027t have made a huge spectacle in front of so many people. The rest of me had Sienna\u0027s words wrapped tight around it like a vice. He hadn\u0027t pulled away. Had he kissed her back?\n Not able to stomach looking at him anymore, I turned on my heel and stumbled away. He was behind me a second later. \"I\u0027m drunk, Kiera. It happened so fast, I didn\u0027t have time to-\"\n Spinning around, I lifted my finger to his face. \"I know!\"\n I turned back around, and he continued following me. \"Then why are you mad?\"\n Sighing, I turned around again. It made me a little dizzy. \"Because I\u0027m drunk too!\"\n When I attempted to spin around again, Kellan grabbed my arm. \"Would you stop walking away from me, please?\" Irritated, I gazed at him as best I could. \"Are you mad at me?\" he pointedly asked.\n My feelings still swirling, I countered with, \"I don\u0027t know. Did you kiss her back?\"\n Kellan\u0027s mouth dropped open, and I saw the struggle in his eyes. He could lie as seamlessly as he could sing. I\u0027d seen him do it. It was one of the many issues that had held back our relationship for so long. It\u0027s hard to trust someone who was so comfortable being duplicitous. But I had absolutely no room to talk on the matter, so I tried really hard to never use that fact against him. We were both capable of horrible things. Which is why honesty was so important to us now.\n Mouth in a firm line, he told me, \"Just for a micro-second.\" As my eyes misted, he started rambling. \"I\u0027m drunk, she caught me off guard. It was instinct. I moved my lips once, just a tiny fraction of an inch, but I didn\u0027t do it again. I pushed her away when I realized what was happening, but the lights had already blacked out by that point.\" He tossed his hands up. \"Griffin\u0027s gotten more action out of me, but I have to say yes to be honest with you.\"\n I wanted to be angry at him, I really did, but I understood him too well, and I was actually sort of proud of him for telling me a painful truth when a white lie would have been so much easier. Sniffling, because it did hurt a little bit, I slung my arms around his neck and pulled him tight.\n \"It\u0027s okay,\" I murmured in his ear, \"I\u0027m not mad at you. I\u0027m mad at her.\"\n His body relaxed against mine. \"So am I.\" \n","sourceLink":"https://allnovel.net/reckless-thoughtless-3/page-16.html","bookId":1885,"book":{"id":1885,"title":"Reckless (Thoughtless #3)","description":"Storyline: \n Reckless (Thoughtless #3) \n When the band hits it big, Kiera and Kellan must ask themselves: Can their love for each other survive the constant pressures of superstardom? The friendships they\u0027ve formed, the new family they\u0027ve found, and the history they\u0027ve forged will all play a part in helping them navigate the turbulent waters of the band\u0027s exploding popularity. A greedy executive hell-bent on success, a declining pop star looking for an edge, and a media circus that twists lies into truths are just some of the obstacles the lovers will have to overcome if they are going to remain together. Fame comes with a price-but will it cost Kiera and Kellan everything?\n \n","cover":"https://allnovel.net/images/reckless-thoughtless-3.jpg","author":"S.C. Stephens","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/reckless-thoughtless-3.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 4:56:27 PM"}}
