{"id":84085,"no":4,"title":"Page 4","content":"I was in the guest room with my mom when Kellan finished in the shower. She was explaining the pros and cons of having an all-white bouquet. Mom was so absorbed in her debate, she didn\u0027t notice Kellan walking into our bedroom with only a tiny towel around his waist. Then again, seeing him wouldn\u0027t have changed the conversation any.\\n\\n For a moment, I wondered if I should ask Kellan to come in here so he could give his opinion on the floral arrangement. I didn\u0027t, though. For one thing, he needed to get ready to go. And secondly, I didn\u0027t think Mom really cared about his opinion. She certainly hadn\u0027t asked him anything about it so far. For some reason, all of the wedding details were being heaped solely on me, like only I had a say.\\n\\n That wasn\u0027t true, though. I didn\u0027t have a say. I\u0027d told Mom multiple times that I wanted a simple, short, private ceremony . . . if I had to have one at all. My impromptu marriage at Pete\u0027s was perfect, and I was fine with going to the courthouse to casually sign the papers that would make it official. Then we could have a small, quiet reception with a few friends and family. Mom wouldn\u0027t hear it, though. She was deadset on a gigantic shindig.\\n\\n Kellan came into the guest room when he was dressed. He was reading something on his phone and grinning ear to ear. Mom stopped telling me that wildflowers weren\u0027t really classy enough for a wedding and looked up at Kellan. The scratch from Joey looked better now that his skin was clean and full of moisture. The red line was unmistakable, though, and Mom looked over at me after spotting it.\\n\\n Ignoring her silent question, I asked Kellan, \"What is it?\"\\n\\n His smile still huge, Kellan tucked his phone in his pocket. \"That was Gavin. His plane is just about ready to take off. He wanted to thank me for meeting with him . . . finally, and let me know that I could visit him anytime I wanted.\" He let out a small laugh and looked at the floor. \"He said he . . . he loves me.\"\\n\\n Kellan peeked up at me and his brows were furrowed, like he couldn\u0027t comprehend why anyone on this earth would love him, especially a parent. Being loved was still a new experience for him. Or at least, accepting the fact that he was loved was new. Kellan had known love-his band certainly loved him, Denny loved him-but Kellan\u0027s view of himself was so skewed for so long, he hadn\u0027t recognized the love right in front of him. It took me entering his life and turning it upside down for him to see it, for him to really feel it. But a lifetime of feeling unwanted was hard to shake, and he still struggled with it on occasion.\\n\\n Standing, I wrapped my arms around his waist. \"Of course he loves you. You\u0027re his son.\"\\n\\n The small smile slipping off of his face, he whispered, \"That doesn\u0027t mean anything.\"\\n\\n My heart breaking, I brushed a damp strand of hair off of his forehead. Leaning up, I murmured into his ear, \"I will always love you, Kellan. Your heart is safe with me.\"\\n\\n Kellan pulled me into a hug and let out a long, shaky breath as he held me. \"Promise?\" he whispered.\\n\\n I squeezed him just a little bit tighter. \"I promise.\" Pulling back, I rested my forehead against his. \"Not loving you isn\u0027t possible. Trust me, I tried.\" Kellan smirked, then gave me a soft kiss. Our tender moment was interrupted by someone clearing their throat. Kellan and I both glanced over at my dad standing in the doorway, watching us.\\n\\n \"Something going on?\" he asked, trying to keep his voice casual. But I could hear an undertone of disgruntlement.\\n\\n Kellan let go of me and shook his head. Answering Dad, he locked gazes with me; the midnight blue depths were warm and untroubled. \"Everything\u0027s fine . . . just getting ready to leave.\"\\n\\n Dad brightened and clapped him on the back. \"Well then, anything I can help you with?\"\\n\\n Kellan chuckled at his answer as he kissed my head. \"No, I\u0027m good, thank you.\"\\n\\n He clapped Dad\u0027s shoulder as he walked around him and back into our room. I raised my hands at my father in disbelief. Seemingly perplexed, Dad glanced back at Mom. \"What? I can\u0027t offer to help my future son-in-law?\"\\n\\n Sooner than I would have liked, the four of us were driving to Pete\u0027s bar. The band was meeting there for their send-off. Kellan refused to let me see him off at the airport anymore. He said watching the plane pull away with him inside was too dramatic.\\n\\n Kellan sighed as he shut off the engine to his beloved Chevelle. He even gave the steering wheel a loving caress before glancing up at me. Eyes narrowing, he handed me the keys with clear reluctance on his face. He opened his mouth to speak, but I beat him to it. \"I know. Be good to her, use the best gas, go slow. I got it.\" I snatched the keys out of his fingers, and Kellan frowned.\\n\\n He cracked open his door. \"We\u0027ll have to see about garaging her when you come join me. I don\u0027t want to leave her alone in the driveway for that long.\"\\n\\n I cringed at his comment and looked back at my dad. I hadn\u0027t told him I was leaving Seattle. Dad\u0027s eyes were as wide as saucers. \"Join him? Join him where?\" he asked me.\\n\\n I quickly opened my door. \"I\u0027ll fill you in later, Dad.\"\\n\\n \"Wait, Kiera . . .\"\\n\\n I shut the door on Dad\u0027s argument. Kellan gave me an apologetic shrug over the top of the car as Dad popped out of the back. \"For how long, Kiera?\"\\n\\n I sighed, really not wanting to discuss it with my parents right at that very moment. Luckily, an excellent distraction pulled up. Griffin\u0027s Vanagon parked in the spot right next to the Chevelle. Anna climbed out of the passenger\u0027s side. She held on to the doorframe like she was going to explode if she moved too fast. The rear door slid open, and Matt hopped out. He waved at us, then extended his hand back into the vehicle and helped his girlfriend, Rachel, out of the van.\\n\\n I still found it hard to believe that Matt and Griffin were related. Matt was more like me: quiet, reserved. Griffin was more like . . . a genuine d-bag. I sometimes wished my sister had hooked up with Matt instead of Griffin. Okay, I often wished that. But Matt was happy with Rachel.\\n\\n Matt greeted me with a courteous nod, then clapped Kellan on the shoulder. Griffin walked around the van to join where our group was congregating behind the vehicles. He sidled up behind Anna, grabbed her hips, and pulled her into him with an unmistakable thrusting motion. Dad\u0027s face turned an unflattering shade of red, and he immediately forgot all about the conversation he\u0027d been trying to have with me.\\n\\n As he walked over to stop Griffin from dry humping his eldest daughter, Evan\u0027s car pulled up. The engine shut off, and both doors opened simultaneously. Hand in hand, Evan and Jenny walked over to where we were gathered.\\n\\n Evan and Jenny were Kellan\u0027s and my best friends. Kellan loved all of his band members, even Griffin in an odd way, but Evan was the one he opened up to the most. The tatted, pierced, and buzz-cut rocker was one of the sweetest men I knew. We\u0027d bonded from the very beginning. Jenny was my closest friend and confidant. She was cute as a button, blond, and perky, the kind of girl men noticed. She also had the biggest heart; her sweetness rivaled her boyfriend\u0027s. Out of all of the couples I knew, Evan and Jenny were the ones I didn\u0027t have to worry about. They were going to make it together; they were too perfect not to.\\n\\n I told Jenny everything, even things I probably shouldn\u0027t tell her. But she\u0027d always accepted me, good and bad, and she\u0027d stuck by my side through all of the ups and downs in my life since I\u0027d moved to Seattle. I was going to really miss Jenny when I was on the road with Kellan.\\n\\n As she approached me, I suddenly realized that I hadn\u0027t told her the good news yet. I was beaming as she and Evan joined us. Her lips compressed when she noticed my elated expression. I usually wasn\u0027t peppy when Kellan left me. I was usually sullen, downcast, depressed . . . a real buzz kill. And I was a little sad about him leaving soon, but my news was too exciting to keep me melancholy. I was bursting at the seams with joy.\\n\\n I didn\u0027t say anything to Jenny, just held up my left hand. She saw my ring and understood immediately. She squealed, startling my parents, and left Evan\u0027s side to wrap her arms around me. We were both hopping up and down while the men looked at us like we had suddenly lost our minds. Curious, Rachel peeked her head over. The girl was shyer than even I was, but she gasped and hugged me too when she figured out what all of the fuss was about. Anna joined our circle, and they all examined my wedding ring. It sparkled in the sunlight, its glimmer matching my cheery disposition.\\n\\n Rachel sighed as she held my hand. \"You\u0027re engaged.\" Her eyes drifted over my shoulder to Matt, before quickly refocusing on my ring.\\n\\n I shook my head. \"No . . . we\u0027re married.\"\\n\\n Jenny snapped her head up. \"What? You got married? Without me?\" Jenny\u0027s hurt expression matched my mother\u0027s, and I was sure I now had two wedding planners.\\n\\n Anna snorted. \"Relax. They exchanged rings at the bar. They\u0027re not really married.\"\\n\\n My parents were a little behind Anna, and I could clearly see a tiny smile form on my dad\u0027s lips. Kellan was next to them, and he frowned at Anna\u0027s assessment of our relationship status. I did too. \"We\u0027re married in our hearts, where it matters. The legal stuff will come later.\"\\n\\n Griffin broke away from a suddenly pale Matt to join our conversation. Just like Anna, he snorted. \"Please, you guys aren\u0027t married.\" He crossed his arms over his chest and glared at Kellan. \"No bachelor party, no marriage. That\u0027s the law.\"\\n\\n I matched Griffin\u0027s posture. \"That is not a law, Griffin.\"\\n\\n He swung his head around to look at me. \"Well, it should be. No T and A, no ball and chain.\" There was an annoying smirk on his face, and I really wanted to smack it off of him. I resisted, though.\\n\\n Anna helped me out by smacking the back of his head. He narrowed his eyes at her. \"What? It\u0027s a fair sacrifice. If you\u0027ve got to be with one chick for the rest of your life, then you should at least get to go out with a bang. Or two. Or three.\"\\n\\n Anna raised a perfectly arched brow. \"Really? Would you want some jackass to do that with our daughter?\" Her hand caressed her belly, and Griffin\u0027s eyes shifted to where his child was peacefully growing.\\n\\n \"Fuck no. I\u0027ll chop the little bastard\u0027s balls off if he tries that kind of shit on my girl,\" he scowled.\\n\\n \"Hmmm.\" Smiling, Anna kissed his cheek and let the conversation die. I could tell Griffin was still pondering what she\u0027d said, though. And he clearly didn\u0027t like the scenario he\u0027d imagined for Kellan when it was applied to his child. I shared a secret smile with my sister. Maybe there was hope for Griffin yet.\\n\\n Our group headed inside the bar to have a congratulatory toast for the band before their taxi arrived to take them to the airport. The night crew wasn\u0027t on yet, but a few familiar faces were around: Hun, Sweetie, Emily, and Troy, the bartender with a never-ending crush on Kellan. He perked up considerably when we walked in together.\\n\\n When we all turned to head to the band\u0027s usual table, I stopped in my tracks. A man I knew very well was sitting at the table, waiting for the band. Denny Harris, the ex-love of my life. Kellan noticed who had my attention and stopped too. Denny stood up, hands casually tucked in the pockets of his jeans.\\n\\n Denny had changed a bit since coming back to Seattle. He seemed older, more mature. There was a confidence in the way he carried himself, and his dark brown eyes simmered with self-assurance. He just seemed to know who he was and what he wanted, and that wasn\u0027t me anymore. He was hopelessly in love with his girlfriend, Abby. It had hurt at first that he\u0027d moved on-but I had too, and I couldn\u0027t be happier for him now.\\n\\n Denny grinned at us as Kellan scoffed in astonishment. We crossed over to him, and Kellan immediately pulled him in for a one-armed hug. \"You came to see me off?\"\\n\\n Denny shrugged. \"You guys are about to hit it big. This might be the last chance I get to see you.\"\\n\\n Kellan looked away, a small smile on his lips. \"I don\u0027t know about that.\" He looked back at Denny. \"But I\u0027m glad you\u0027re here.\"\\n\\n I stepped up to give Denny a hug after the two friends pulled apart. Since I was sure Kellan was still a little uneasy about me being too friendly with Denny, regardless of how many times he\u0027d told me he was fine with our friendship, I kept the hug as brief as politely possible.\\n\\n Denny turned to the other band members once he\u0027d greeted me. As everyone squished around the table, I took a seat catty-corner to Kellan. When Denny was finished congratulating everyone, he took the only empty spot, next to me on the end of the table. Ironically, Denny, Kellan, and I were sitting in the exact same seats as the first time Denny and I had joined the band for a beer.\\n\\n Denny looked over at me as Kellan ordered the table of round of shots. I saw a soulful expression pass over my ex\u0027s face. Maybe he too was pondering how drastically things had changed for us. I raised an eyebrow at him in silent question, and his contemplative mood evaporated. With a slight chuckle, he shook his head and turned to watch Emily approaching our table with our drinks.\\n\\n Kellan was watching me as shot glasses were set in front of everyone. I didn\u0027t feel the twinge of guilt I used to feel when we were all together. Instead, I grabbed Kellan\u0027s hand and kissed his fingers, letting him know that I was his, bound in my soul.\\n\\n Kellan gave me a smile that was loose and easy. He understood. My mom watched the dynamic between the three of us with a crease on her brow. I think it still blew her mind that we were all friends, especially since she now knew exactly what had transpired between Kellan and me.\\n\\n When everyone had their shots-except my sister, of course, who was at the other end of the table staring at a cup of apple juice like it was toxic-we lifted them to make a toast.\\n\\n Matt opened his mouth to speak, but his loudmouthed cousin beat him to it. \"To fame, fortune, and scores of loose women!\" Griffin downed his shot while the rest of us stared at him; Dad glowered, but then again, he usually did around Griffin.\\n\\n When Griffin smacked his empty glass on the table, Matt continued with his toast like nothing had happened. \"To good friends and good music. May we always have both.\"\\n\\n \"Here, here.\" We all clinked glasses, Denny and I stretching across the table to reach Anna and Rachel, then we downed our potent drinks. It burned, but Matt\u0027s well-wishes made the sting worth it.\\n\\n We all talked, reminisced, and enjoyed each other\u0027s company until a sullen Troy walked up to the table. Eyes on Kellan, he told the group, \"Your cab is here.\" My heart sank a little, and I fortified my stomach. Goodbyes were just a way of life with Kellan, and I had to get used to them.\\n\\n Matt glanced at a clock on the wall and smiled; being the pseudo-manager of the group, he had made all of the travel arrangements. Keeping his motley crew on task and on time made him happy. Kellan helped me stand up, and we all headed out to the parking lot. Sure enough, the taxi Matt had arranged for them was there.\\n\\n The band began their goodbyes. Kellan gave me a quick kiss before turning to say goodbye to the people he wasn\u0027t sure when he\u0027d see again. He hugged my mom, shook hands with my dad, and rubbed Anna\u0027s belly. He gave Rachel a friendly hug, lifted Jenny a foot in the air while she giggled, and clapped Troy on the shoulder. Troy\u0027s grin was glorious after that. While Kellan was busy, I said my goodbyes to Evan and Matt. Evan gave me a huge, lung-crushing bear hug, Matt a gentle, reserved squeeze. I kept my distance from Griffin, waving at him from the other side of the group. Then Kellan was standing by my side again.\\n\\n Lacing my fingers with his, he looked over at Denny and extended a hand. \"Watch over my girl for me?\" Denny\u0027s expression blanked as he glanced between Kellan and me. Kellan smirked and added, \"But not too well, okay?\"\\n\\n Denny let out an amused grunt. \"Wouldn\u0027t want that . . .\" He grabbed Kellan\u0027s hand, shaking it firmly. \"Yeah, I\u0027ll keep an eye on her. She\u0027ll be apples.\" I giggled at Denny\u0027s saying and he gave me my favorite goofy grin. But when he released Kellan\u0027s hand, his face turned serious. \"I hope things work out for you, mate.\"\\n\\n Kellan grinned and looked down on me. \"Yeah, me too.\" By the look in Kellan\u0027s eyes, I couldn\u0027t tell whether he meant hitting it big, or not hitting it big. I got the feeling that, as long as we were together, either scenario was fine. Wrapping my arms around his waist, I laid my head on his shoulder.\\n\\n Kellan gave me one final squeeze and whispered, \"See you soon.\" I nodded as I watched him sprint over to his car to get his only piece of luggage-the black case holding his prized guitar. Slinging it over his shoulder, he sauntered back to the taxi. The driver packed it in the trunk for him while Kellan slipped into the backseat. I had to bite my lip to stop the sadness from building. I would join him shortly . . . I could wait.\\n\\n After every band member was tucked into the taxi, it pulled away. Kellan was by the window, and he stuck his hand out of it to wave at me, his wedding ring gleaming in the afternoon sun. Grinning like an idiot, I waved until the taxi turned a corner and disappeared from sight.\\n\\n Denny looked over at me when I let my hand fall to my side. \"So, how\u0027s married life treating you, Kiera?\" His accent wrapped around my name in a wonderful way. Despite how our relationship had changed, the sound of his voice was still fascinating to my ears.\\n\\n I studied his dark eyes, looking for any sign of pain. There didn\u0027t seem to be any as he casually stood beside me. As I considered everything that had happened in the very short span of time since my impromptu wedding, I shrugged. \"Good . . .\" Remembering Joey\u0027s unexpected visit, my voice gave out on me.\\n\\n Denny caught the uncertainty. \"You don\u0027t seem so sure about that.\"\\n\\n A part of me really didn\u0027t want to talk about my marital problems to Denny. After everything that had happened while we were a couple, it felt wrong to confess my hardships. Didn\u0027t I deserve them? But Denny was an exceptional human being, and once he\u0027d forgiven someone, he let go of the pain and resentment and moved on. Well, he tried to anyway. I\u0027d seen him struggle with being around me. I\u0027d heard the pain of betrayal in his voice. But he hadn\u0027t fled. He was still in my life. He was still my friend. And I owed him an honest response.\\n\\n \"There was an incident at the house,\" I muttered, looking back at my parents, who were talking with Anna, Jenny, and Rachel.\\n\\n \"Kellan\u0027s jaw?\" I returned my eyes to Denny. \"You do that?\" he asked.\\n\\n I smirked at him. \"No. His ex-roommate came by . . .\"\\n\\n Denny, his mind a steel trap at times, remembered who she was. \"Joey? The girl who took off after she slept with him?\"\\n\\n A twinge of something awful stirred in my stomach, but I pushed it down. \"Yeah, Joey. Anyway, she came back for her stuff, but I sort of tossed it a while ago. Kellan had to pay her for it.\"\\n\\n \"Well, that seems reasonable, considering it was hers.\" He paused, then added, \"I\u0027m guessing there\u0027s more to the story. What else happened?\"\\n\\n I really didn\u0027t want to tell Denny about this, but I had to tell someone, and aside from Jenny, Denny was my best friend. \"She gave him back their . . . sex tape . . . then made him pay her for it.\"\\n\\n Denny didn\u0027t answer me for a long time. I could tell his mind was spinning, and he wasn\u0027t sure how to answer. As a gust of warm air swirled my hair around me, I wasn\u0027t sure what I wanted him to say. Maybe nothing was best. I stared at my feet and kicked a pebble on the cement while I waited for some sort of response.\\n\\n \"If she gave it back before he paid her . . . then it wasn\u0027t her only copy. You\u0027ll hear from her again,\" he said.\\n\\n My eyes shot up to his. I hadn\u0027t considered that. I knew that other sex tapes were out there, but I hadn\u0027t thought about Joey duping Kellan. She\u0027d brought it to the house to return it before she\u0027d known about me. She\u0027d acted like it was the only copy she\u0027d had, and that she despised Kellan so much that she didn\u0027t want it near her anymore. Of course, maybe that was an act, her way of showing Kellan that she didn\u0027t need him, that he was beneath her. She seemed like the type to hold on to trophies of her conquests, and what greater trophy could she have than video footage? Denny was right; she had multiple copies. She hadn\u0027t ever intended to give Kellan the only recording.\\n\\n Denny looked apologetic and sympathetic. \"I don\u0027t know her so I can\u0027t say for sure, but if he does make it big, I wouldn\u0027t be surprised if she tried to make some money off of it. It could be everywhere someday, Kiera. Sorry.\"\\n\\n Sighing away those future troubles, I told him, \"It\u0027s okay. It doesn\u0027t matter, not really.\" Denny raised an eyebrow at me, and I laughed. The release felt good and lifted a bit of the apprehension from the air. \"She doesn\u0027t have the only movie of him like that, so she won\u0027t get a very good price. Oversaturation and all.\" I wanted to grimace over the thought of multiple sex tapes on the market, but the look on Denny\u0027s face was priceless, and I laughed again.\\n\\n Denny shook his head. \"You have changed.\"\\n\\n I smiled and shrugged, trying to be as okay with this as I could be. Kellan\u0027s life wasn\u0027t private anymore, and parts of it were going to be uncomfortable for both of us. But I knew his heart, and he knew mine, and together we would work through the rough patches.\\n\\n As I pushed away the bad and focused on the good, Denny rolled his eyes. \"I can\u0027t believe he filmed himself.\" Closing his eyes, he added, \"Actually, yeah, I can.\" Denny\u0027s cheeks suddenly flushed with color, and his eyes shot open. There was a clear question in the dark depths, one he didn\u0027t want to ask. But the curiosity was eating at him.\\n\\n Knowing where his head was at, I smacked his shoulder. \"No! I didn\u0027t let him . . . we didn\u0027t . . . No!\" I stammered, not able to put into words that I didn\u0027t-and wouldn\u0027t-make a sex tape with Kellan.\\n\\n Denny chuckled and backed away from me. \"Sorry, it slipped into my head before I could stop it.\"\\n\\n Anna came up to us while Denny laughed even harder. \"What\u0027s going on?\"\\n\\n Anna gave Denny a cool glance, not unfriendly, but not warm either. She still hadn\u0027t gotten over Denny\u0027s vicious attack on Kellan, and, inadvertently, me. Denny straightened, his laughter stopping. \"Nothing. Just catching up.\"\\n\\n Anna narrowed her eyes, like she thought Denny was going to try and woo me away from Kellan or something. I don\u0027t know how many times I\u0027d told her that nothing but friendship was between us, but I don\u0027t think she would ever really believe me. \"I\u0027m going to go, Kiera. I need a nap.\" Her eyes focused solely on me. \"The girls and I are sore.\"\\n\\n I twisted my lip, knowing she was not referring to the child in her belly. \"Yeah, okay.\"\\n\\n As she waddled over to Griffin\u0027s van, Mom and Dad ended their conversation with Jenny and started heading toward me. By the look on Dad\u0027s face, I was sure he wanted to talk to me about my plan to join Kellan.\\n\\n I sighed, and Denny looked at me. \"You ready for them to head home yet?\"\\n\\n I grinned. \"Yeah.\" As I waited for my parents, I pondered telling Denny that I was leaving. I suppose that should be an easier thing to tell him than confessing about Kellan\u0027s sex tape, but somehow, it felt harder.\\n\\n Mom got distracted on her way over to me by a coin on the ground. Mom gathered every coin she could, even pennies. She kept any coin she found that was dated earlier than the seventies. She had dozens of containers at home, full of old currency.\\n\\n While Dad groaned at Mom to let it go, I quickly blurted out what I didn\u0027t really want to say. \"I\u0027m joining Kellan in Los Angeles soon, and then I\u0027m going on tour with him. I\u0027m leaving Seattle.\"\\n\\n Denny\u0027s mouth opened and his face paled. He looked like I\u0027d just socked him in the gut. A ripping pain went through me. I had never left Denny before. He\u0027d always been the one leaving me. As part of my soul ached, I reconsidered my belief that leaving was easier than being left. This didn\u0027t feel easy, and I wasn\u0027t even gone yet.\\n\\n Denny averted his eyes and composed himself. Once he was more or less put back together, he shifted his attention to my parents. A sly grin lightened his face, but not his eyes. \"I remember when we told your dad we were leaving Ohio.\" He looked back at me. \"Good luck. You\u0027ll need it.\"\\n\\n I nodded and rubbed Denny\u0027s shoulder. A moment of grief passed between us. Grief over what we\u0027d had together. Grief over what we\u0027d lost. We were both in a good place now, relationship-wise, but that didn\u0027t mean we\u0027d forgotten, and sometimes missed, what we\u0027d once been.\\n\\n Denny gave me a small, understanding smile that broke my heart a little. As much as I was going to miss Jenny and Anna, I think I was going to miss Denny even more. Not sure if I should confess that to him or not, I gave him as convincing of a smile as I could. \"But I\u0027ll be coming back a lot, to check on Anna, to make sure she\u0027s okay.\"\\n\\n Denny nodded as my parents finally joined us. \"That\u0027s probably a good idea. I would offer to keep an eye on her for you, but, uh . . . you know how she feels about me.\"\\n\\n With my parents in earshot, I only gave Denny a slight nod in response. I didn\u0027t want to talk about why Anna had problems with Denny in front of my parents. They didn\u0027t know what Denny had done, what I\u0027d pushed him to, and I would prefer it if they never knew. Dad would insist I cut Denny out of my life forever, and I didn\u0027t want to. He was part of me.\\n\\n Dad looked exhausted, ready to take a vacation from his vacation. Crossing his arms over his chest, he stood tall and straight and tried to be imposing. \"Kiera, I think we should sit down and have a discussion about you joining Kellan.\" By his expression, it was clear he thought the idea was ridiculous. \"Are you really going to go to Los Angeles? Because I\u0027m not okay with you being in a city that size.\" He paused, then added, \"Surrounded by a bunch of rock stars.\"\\n\\n I smiled at Dad and started to respond, but Jenny overheard Dad and bounded to my side. \"You\u0027re really going down there? To be with them while they record the album?\"\\n\\n I hadn\u0027t had time to tell Jenny about it either. So much had been sprung on me so fast . . . I was still a little dizzy. I grabbed Jenny\u0027s arms and answered her and my dad. \"Kellan really wants me there, and since I\u0027m done with school, I\u0027ve got lots of free time.\"\\n\\n Dad frowned. \"You shouldn\u0027t waste any time before applying for jobs, Kiera. It will look bad on your resume.\"\\n\\n I cringed as I looped my arm around Jenny and held on to her; I suddenly needed her support. \"Um, actually, Dad . . . I\u0027m not going to be applying for a job. When Kellan is done with the album, he\u0027ll be touring again to promote it . . . and I\u0027m going to go with him.\"\\n\\n My voice came out in hushed tones. For a second, the only noise was the traffic zipping down the road. Then Jenny and my father spoke at the same time. Surprisingly, they both said the exact same thing, only in completely different ways.\\n\\n \"No way!\"\\n\\n Jenny\u0027s outburst was an exclamation of surprise; Dad\u0027s was an order. I looked between them both, giving Jenny an excited squeal, and Dad an empathetic smile. \"I know it\u0027s sudden, but it\u0027s what I really want to do.\"\\n\\n Jenny hugged me. In my ear, she told me, \"I am so stinking jealous of you!\" She pulled back, her pale eyes glossy. \"I\u0027m going to miss you . . . but you are going to have so much fun.\"\\n\\n I giggled at her, her energy feeding my own. Then Dad\u0027s voice broke through my joy. \"No, Kiera. That\u0027s not acceptable.\"\\n\\n I looked back at him, my buzz fading. His frown deepened. \"We didn\u0027t put you through four years of school so you could throw it all away to follow some band across the country.\" He said the word band with a sneer, and irritation shot up my spine.\\n\\n I wanted to sullenly tell Dad that my scholarships had paid for the majority of my schooling, that his contribution had been pretty minor in comparison, but that wasn\u0027t really the issue being argued. \"It\u0027s not \u0027some band,\u0027 Dad. It\u0027s my husband\u0027s band.\"\\n\\n Dad rolled his eyes. \"You\u0027re not really married, Kiera.\"\\n\\n I ignored his comment. \"And he needs me with him.\"\\n\\n Dad snorted, like he didn\u0027t believe that, like he believed Kellan preferred to be on his own on the road. But Dad hadn\u0027t seen how hard Kellan\u0027s last tour was on him. True, a lot of the turmoil had been because of his father, but I think a large part was also because of me, because he\u0027d wanted to be with me and couldn\u0027t be. I know that\u0027s how I\u0027d felt about him.\\n\\n Before Dad could voice his objection, I added, \"And besides, I\u0027m not throwing away my education. I\u0027m going to be a writer, and I can do that on the road with Kellan.\"\\n\\n Dad gave me a blank stare. \"A writer? You can\u0027t make a living being a writer.\"\\n\\n Mom elbowed Dad in the ribs, and he glanced over at her. \"What?\"\\n\\n Ignoring him, Mom turned to me. \"I\u0027m sure you\u0027ll do very well, honey. Your father is just concerned about you struggling . . . just in the beginning, of course.\"\\n\\n I frowned at Dad. That wasn\u0027t entirely his objection. Unless I was, say, a journalist writing for a major newspaper, Dad considered writing to be as frivolous as making music. A real job consisted of set hours, a set location, and a set paycheck. Dad liked things he could depend on. I did too, but I also knew that Kellan\u0027s life was about to explode. Dad may not believe it yet, but he would soon. Kellan was too talented for the world not to take notice.\\n\\n Switching my scowl to a placating smile, I assured him, \"Kellan and I will do just fine. You don\u0027t need to worry.\"\\n\\n His irritated expression turned concerned. \"I\u0027ll always worry about you, Kiera.\"\\n\\n My anger softened. Sighing, I released my hold on Jenny and walked over to Dad. Throwing my arms around him, I told him, \"I\u0027ll be fine, and I love you too.\"\\n\\n I heard him sniff as he wrapped his arms around me. I figured then that Dad would eventually come around. He may not ever fully support my decision, but he wouldn\u0027t hold it against me either, just like he didn\u0027t hold Anna\u0027s poor decisions against her. My parents loved us through all of our ups and downs. And while this was a down for them, it was an up for me.\\n\\n Pulling back from Dad, I brightly told him. \"Let\u0027s go home, and I\u0027ll tell you all about it.\"\\n\\n Dad nodded, then sighed. \\n\\n","sourceLink":"https://allnovel.net/reckless-thoughtless-3/page-4.html","bookId":1885,"book":{"id":1885,"title":"Reckless (Thoughtless #3)","description":"Storyline: Reckless (Thoughtless #3) \\n When the band hits it big, Kiera and Kellan must ask themselves: Can their love for each other survive the constant pressures of superstardom? The friendships they\u0027ve formed, the new family they\u0027ve found, and the history they\u0027ve forged will all play a part in helping them navigate the turbulent waters of the band\u0027s exploding popularity. A greedy executive hell-bent on success, a declining pop star looking for an edge, and a media circus that twists lies into truths are just some of the obstacles the lovers will have to overcome if they are going to remain together. Fame comes with a price-but will it cost Kiera and Kellan everything?\\n","cover":"https://allnovel.net/images/reckless-thoughtless-3.jpg","author":"S.C. Stephens","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/reckless-thoughtless-3.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 4:56:27 PM"}}
