{"id":72156,"no":23,"title":"Page 23","content":"Her mom’s cell phone rang, saving Aria from having to explain further. But then she peered out the window and saw Noel’s Escalade parked at the curb, and her stomach clenched. Ella’s advice made perfect sense, but that meant she had to break up with Noel. Swallowing hard, she waved good-bye to Ella, zipped up her denim jacket, and stepped out the door. Her heart broke when she saw Noel’s smiling face through the window. “You look gorgeous, as usual,” he crooned when she opened the door. “Thanks,” Aria mumbled, even though she’d worn her ugliest jeans and a big, bulky sweater that was one of her first knitting projects. She wanted to seem as unattractive as possible to soften the blow. “So where do you want to go?” Noel shifted into drive and pulled away from the curb. “Williams-Sonoma for cooking supplies? I hear next week we’re making popovers.” Aria stared at the passing streetlamps until her vision blurred, keeping her mouth shut. She was afraid that if she said anything, she’d burst into tears. “Okay, not in a Williams-Sonoma mood,” Noel said slowly, turning the steering wheel. “What about that cool coffee bar we found in Yarmouth? Or hey, we could go back to that psychic shop by the train station. Where it all began.” He nudged Aria playfully. He was referring to how they’d bonded at a séance at the shop last year. Aria fiddled with the zipper on her jacket, wishing Noel would just be quiet. “Last-ditch effort,” Noel said cheerfully. “How about we go to Hollis and just get really drunk? Play some darts and beer pong, act like idiots . . .” “Noel, I can’t,” Aria blurted. Noel came to a stop at a light adjacent to a big strip mall. “Can’t what? Drink?” He grinned. “C’mon. I saw you drink plenty in Iceland.” She winced. Iceland just twisted the knife more painfully—it was yet another secret she was keeping. “No, I can’t do . . . this.” Her voice cracked. “Me and you. It’s not working.” A frozen smile appeared on Noel’s face. “Wait. What?” “I’m serious.” She stared at the glowing red clock numbers on the dashboard. “I want to break up.” The light turned green, and Noel wordlessly swerved into the other lane and turned into the strip mall. It was one of those monstrous shopping plazas that contained a Barnes \u0026 Noble superstore, a Target, a warehouse-size wine shop, and a bunch of upscale salons and jewelry boutiques. Noel pulled into a parking space, shut off the engine, and looked at her. “Why?” Aria kept her head down. “I don’t know.” “You’ve got to have some reason. It’s not Klaudia, is it? Because I can’t stand that girl, I swear.” “It’s not Klaudia.” Noel ran his hands over his forehead. “Are you into someone else? That Ezra guy?” Aria shook her head vigorously. “Of course not.” “Then what? Tell me!” There was an imploring, desperate expression on his face. It took everything in Aria’s power not to throw her arms around Noel and tell him she didn’t mean it, but A’s note was branded in her mind. She wouldn’t be responsible for wrecking his family. She needed to get as far away from Noel as possible. She was poison to him. “I’m sorry, but it’s just something I have to do,” she whispered. “I’ll come by tomorrow and get the stuff I left at your house.” Then she reached for the door handle and swung her legs to the pavement. The cold air assaulted her senses. The aroma of brick-oven pizza wafted into her nostrils, turning her stomach. “Aria.” Noel leaned over and caught her arm. “Please. Don’t go.” Aria bit back tears, staring blankly at the shopping cart corral. “There’s nothing more to say,” she said in a dead voice. Then she jumped out of the car, slammed the door hard, and started walking blindly toward the closest store, a Babies “R” Us. Noel called her name again and again, but she kept walking, staring at her boots, breathing in and out, and making sure no cars ran her over. Finally, the Escalade’s engine revved, and the SUV backed up and gunned toward the exit. Beep. Aria’s phone sounded from the bottom of her bag. The screen was lit up as she pulled it out. A new text had come in. Kudos, Aria. No pain, no gain, right? Mwah! —A Aria threw her phone back in her bag, hard. You win, A, she thought, blinking through tears. You win every goddamn time. She was at the curb of the Babies “R” Us by now. A stroller display took up the whole window, and banners of happy, giggling babies decorated the store. Pregnant women cruised the aisles, buying baby bottles, onesies, and diapers. All the happiness she saw felt like a kick in the stomach. She felt the urge to ram a shopping cart into the window and watch the glass shatter around the blissful scene. The automatic doors swished open, and a woman in an expensive-looking black wool coat pushed a cart full of shopping bags down the ramp. She looked just as joyful as the others, though there was something about her expression that looked a little strained. Aria squinted hard, her pulse racing. It was Gayle. But what was she doing here? Stocking up on stuff for when she kidnapped Emily’s baby? Without breaking her stride, Gayle met Aria’s gaze. Her eyebrows shot up, and she winked, seeming pleased with herself. Probably because she’d been the one who’d written the note demanding that Aria and Noel break up. Probably because she saw Aria’s tear-streaked face now and understood that Aria had gone through with it. Because she was A, and she was pulling all the strings. 23 LADIES WHO LUNCHEON Spencer rang the bell at the Ivy House, then stepped back and examined her reflection in the glass next to the door. It was Sunday afternoon, a few minutes after Harper had told her to arrive for the potluck, and she was ready. She’d managed to blow-dry her hair with the shoddy hair dryer at the motel and had done her makeup in the cracked mirror. The iron had worked to press the wrinkles out of the dress she’d brought, and, most importantly, she was holding three pans of gooey, chocolatey pot brownies in her hands. The door flung open, and Harper, dressed in a polka-dotted sheath and high patent-leather heels, gave her a cool smile. “Hi, Spencer. You made it.” “Yep, and I brought brownies.” Spencer proffered the foil pans. “Double chocolate.” With a sprinkling of pot, she wanted to add. Harper looked pleased. “Brownies are perfect. C’mon in.” Spencer figured the potluck would be filled with only desserts—pot brownies, specifically. But when Harper led her into an enormous, state-of-the-art kitchen, complete with a huge, eight-burner Wolf oven, a massive fridge, and an island bigger than the Hastings’ dining room table, there were all sorts of dishes spread out. Quinoa casseroles. Quiche. Baked ziti, steam rising from the tray. There was a large punch bowl full of reddish liquid with apple chunks floating on top. A cheese platter was piled high with Brie, Manchego, and Stilton. She gaped at the spread. How had everyone managed to smuggle drugs into all this stuff? It had been a struggle for Spencer to simply bake the brownies; the oven in the motel’s kitchen had been a godsend. She’d begged the guy on night desk duty to let her use it, mixing up the brownie batch in her ice bucket and crumbling in the pot at the last minute. She’d fallen asleep on the pleather couch in the lobby while they were cooking, waking up only when the buzzer went off. She had no idea if they’d be good or not, but it didn’t matter—she’d done it. Reefer’s admonishing words rushed through her head. Do you really need a stupid club to tell you that you’re cool? But he’d probably said all that disparaging stuff about Ivy because he knew he’d never get into something so prestigious. Loser. “Plates and silverware are that way.” Harper gestured to a table. Spencer hovered over the food, amazed that every single item contained an illegal substance. She didn’t want to eat any of it. She muttered something about not being hungry and followed Harper into the parlor. The room was packed with well-dressed boys in ties and khakis and girls in dresses. Classical music played in the background, and a waitress was wandering around with flutes of mimosa. Spencer overheard conversations about a composer she’d never heard of, nature versus nurture, foreign policy in Afghanistan, and vacationing on St. Barts. This was why she wanted to belong to Ivy—everyone spoke in such smart, informed, adult voices about sophisticated topics. Screw Reefer and his judgmental attitude. Harper had joined Quinn and Jessie. The girls looked at Spencer with surprise, but then gave her a cautious smile and a cordial hello. Everyone sank into a leather couch and resumed their conversation about a girl named Patricia; apparently, her boyfriend had gotten her pregnant over the holiday break. “Is she going to keep the baby?” Harper asked, forking a bite of macaroni salad. Jessie shrugged. “I don’t know. But she’s terrified of telling her parents. She knows they’re going to freak.” Quinn shook her head sympathetically. “Mine would, too.” It was disconcerting that the girls were talking about an issue that was so close to Spencer’s heart. Looking at Emily’s situation objectively, it was crazy that Emily had hidden her pregnancy from almost everyone she knew. It was even crazier that she’d smuggled the baby out of the hospital and left it on someone’s doorstep. Even worse, A—Gayle—had figured out exactly what happened. Was Gayle going to tell? Not just about that, but about everything else they’d done? She stared down at her empty plate, wishing she had something to do with her hands. “Spencer, these are really good,” Harper said, pointing to a brownie she’d cut from one of Spencer’s pans. “Try.” She shoved the brownie toward Spencer’s mouth, but Spencer recoiled. “That’s okay.” “Why? They’re amazing!” Quinn narrowed her eyes. “Unless you’re anti-sugar, too?” The girls were all staring at her so quizzically that Spencer began to feel insecure. She wondered if it was a requirement to eat the food, like an Ivy rite of passage. Maybe she had no choice. “Thanks,” she said, accepting a bite. Harper was right: The brownie was gooey and delicious, and Spencer couldn’t even taste the baked-in pot. Her stomach rumbled in response; she hadn’t eaten since last night. One little brownie wouldn’t hurt, would it? “Okay, you convinced me,” Spencer said, rising from her seat to get a brownie square for herself. When she returned, having eaten almost the whole brownie by the time she sat down again, the girls were talking about how they wanted to make a film to enter into the Princeton Student Film contest. “I want to make one about toy tops, just like Charles and Ray Eames did,” Quinn said. “I was thinking of making a movie about Bethany. Remember how I told you about her? The really fat girl who sits in front of me in Intro to Psych?” Jessie rolled her eyes. “It could be called Girl Who Eats Donuts.”","sourceLink":"https://allnovel.net/stunning-pretty-little-liars-11/page-23.html","bookId":2387,"book":{"id":2387,"title":"Stunning (Pretty Little Liars #11)","description":"Storyline: Stunning (Pretty Little Liars #11) Now a hit ABC Family TV show, Sara Shepard’s #1 New York Times bestselling Pretty Little Liars series continues with Stunning. In the eleventh novel, A is still out there, lurking in the shadows and digging up the liars’ latest secrets... Emily’s reconnecting with an old flame, one baby step at a time. But is she headed toward true love or another bundle of heartache? Spencer’s learning about the highs and lows of campus life on a trip to Princeton. Aria’s seeing a whole new side to Noel’s dad—and it could drive a wedge between her and Noel. And, for better or worse, Hanna’s getting in touch with her inner A. Secret by secret, lie by lie, the girls get tangled in A’s dangerous web. Soon A will have enough ammunition to pull the trigger and end the pretty little liars, once and for all….","cover":"https://allnovel.net/images/stunning-pretty-little-liars-11.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/stunning-pretty-little-liars-11.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:22:42 AM"}}
