{"id":79605,"no":1,"title":"Page 1","content":"PROLOGUE\\n\\n DEATH WASon the cards that day, but would it be ours or the panther\u0027s?\\n\\n Black panthers are really leopards. If you look closely, you can see faint spots blended into their fur. But trust me - unless it\u0027s in a zoo, you don\u0027t ever want to be that close to a panther! They\u0027re one of nature\u0027s greatest killers. They move silently and speedily. In a one-on-one fight they\u0027ll almost always come out on top. You can\u0027t outrun them, since they\u0027re faster than you, and you can\u0027t out-climb them, because they can climb too. The best thing is to stay out of their way completely, unless you\u0027re an experienced big game hunter and have come packing a rifle.\\n\\n Harkat and I had never hunted a panther before, and our best weapons were a few stone knives and a long, round-ended stick that served as a club. Yet there we were, on the edge of a pit which we\u0027d dug the day before, watching a deer we\u0027d captured and were using as bait, waiting for a panther.\\n\\n We\u0027d been there for hours, hidden in a bush, clutching our humble weapons close to our sides, when I spotted something long and black through the cover of the surrounding trees. A whiskered nose stuck out from around a tree and sniffed the air testingly - the panther. I nudged Harkat gently and we watched it, holding our breath, stiff with fright. After a few seconds the panther turned and padded away, back into the gloom of the jungle.\\n\\n Harkat and I discussed the panther\u0027s retreat in whispers. I thought the panther had sensed a trap and wouldn\u0027t return. Harkat disagreed. He said it would come back. If we withdrew further, it might advance fully the next time. So we wriggled backwards, not stopping until we were almost at the end of the long stretch of bush. From here we could only vaguely see the deer.\\n\\n A couple of hours passed. We said nothing. I was about to break the silence and suggest we were wasting our time, when I heard a large animal moving. The deer was jumping around wildly. There was a throaty growl. It came from the far side of the pit. That was great - if the panther attacked the deer from there, it might fall straight into our trap and be killed in the pit. Then we wouldn\u0027t have to fight it at all!\\n\\n I heard twigs snap as the panther crept up on the deer. Then there was a loud snapping sound as a heavy body crashed through the covering over the pit and landed heavily on the stakes we\u0027d set in the bottom. There was a ferocious howl, followed by silence.\\n\\n Harkat slowly got to his feet and stared over the bush at the pit. I stood and stared with him. We glanced at each other. I said uncertainly, \"It worked.\"\\n\\n \"You sound like you didn\u0027t - expect it to,\" Harkat grinned.\\n\\n \"I didn\u0027t,\" I laughed, and started towards the pit.\\n\\n \"Careful,\" Harkat warned. \"It could still be alive.\"\\n\\n Stepping in front of me, he moved off to the left and signalled for me to go right. Raising my knife, I circled away from Harkat, then we slowly closed on the pit from opposite directions.\\n\\n Harkat was a few steps ahead of me, so he saw into the pit first. He stopped, confused. A couple of seconds later, I saw why. A body lay impaled on the stakes, blood dripping from its many puncture wounds. But it wasn\u0027t the body of a panther - it was a red baboon.\\n\\n \"I don\u0027t understand,\" I said. \"That was a panther\u0027s growl, not a monkey\u0027s.\"\\n\\n \"But how did ?\" Harkat stopped and gasped. \"The monkey\u0027s throat! It\u0027s been ripped open! The panther must?\"\\n\\n He got no further. There was a blur of movement in the upper branches of the tree closest to me. Whirling, I caught a very brief glimpse of a long, thick, pure black object flying through the air with outstretched claws and gaping jaws - then the panther was upon me, roaring triumphantly.\\n\\n Death was on the cards that day. \\n\\n","sourceLink":"https://allnovel.net/the-lake-of-souls-the-saga-of-darren-shan-10/page-1.html","bookId":2446,"book":{"id":2446,"title":"The Lake of Souls (The Saga of Darren Shan #10)","description":"Storyline: The Saga of Darren Shan #10: The Lake of Souls \\n The Lake of Souls is the 10th book in The Saga of Darren Shan and is also the first in the 4th and final trilogy in \u0027The Saga\u0027 called The Vampire Destiny Trilogy. It reveals a lot about the character of Harkat Mulds mainly and introduces a new character called Spits Abrams. This book also adds many more questions that will be answered in the next two books. Also, this book is the longest in the series. \\n The Lake of Souls takes place right after Killers of the Dawn, with Mr. Crepsley dead and Steve\u0027s revelation that he is the Lord of the Vampaneze. Darren is unable to cry. He feels numb, but with the help of the bearded lady, Truska, he eventually does so. Mr. Tiny then appears and tells Harkat that if he wants his nightmares (which have returned) to stop, he must walk through a portal that Mr. Tiny makes. Harkat refuses to let Darren go with him. Debbie Hemlock and...\\n","cover":"https://allnovel.net/images/the-lake-of-souls-the-saga-of-darren-shan-10.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-lake-of-souls-the-saga-of-darren-shan-10.html","creation":"Oct 5, 2019 8:58:43 AM","modification":"Oct 5, 2019 4:18:46 PM"}}
