{"id":79627,"no":23,"title":"Page 23","content":"CHAPTER TWENTY-TWO\n EARLY AFTERNOONthe next day. We\u0027d been waiting for the male dragon to go hunting. Ideally, we\u0027d like to have waited until he took one of the females or young dragons with him, but he usually only made short trips when accompanied. Our best bet was to make our move when he was off hunting by himself, in the hope that he wouldn\u0027t return while we were in the valley.\n Finally, near the end of my watch, the dragon unfurled his long wings and took to the sky. I hurried off to alert Harkat and Spits.\n We\u0027d filled the remaining thirty-two globes with liquid from the vial. The vial was still about a third full, and I carried it in my shirt, keeping it in reserve. Harkat and I had divided the globes between us, giving none to Spits, even though he\u0027d argued bitterly for a share. There were two reasons why we kept the globes from him. Firstly, it was our aim to scare off the dragons, not kill them. Neither of us wished to destroy such mystical, marvellous creatures, and we couldn\u0027t trust Spits not to go bomb-happy. The second reason was that we needed him to concentrate on fishing. The pirate had held on to his net, despite all we\u0027d been through - he had it wrapped around his chest - and he was the best qualified to fish for Harkat\u0027s soul. (We weren\u0027t sure what form the souls in the Lake would take, or how we\u0027d recognize Harkat\u0027s, but we\u0027d worry about that when - if! - we got there.)\n \"Ready?\" I asked, crawling out of our makeshift cave, four small globes cradled in my hands.\n \"Ready,\" Harkat said. He was carrying six of the globes - his hands were bigger than mine.\n \"Aaarrr,\" Spits growled, still sour about not being given any bombs. He\u0027d been in a foul mood most of the week, due to the tiny amount of whisky we\u0027d limited him to.\n \"When this is over,\" I tried to cheer him up, \"you can drink all the whisky you like and get steaming drunk, OK?\"\n \"I like the sound o\u0027 that!\" he chuckled.\n \"Are you looking forward to - getting home?\" Harkat asked.\n \"Home?\" Spits frowned, then grinned sickly. \"Aaarrr. \u0027Twill be great. I wish we was there already.\" His eyes shifted nervously and he looked away quickly, as though he\u0027d been caught stealing.\n \"We\u0027ll go in three abreast,\" I told Spits, shuffling to the top of the hill. \"You take the middle. Head straight for the Lake. We\u0027ll protect you.\"\n \"What if the dragons don\u0027t flee from the bombs?\" Spits asked. \"Will ye let \u0027em have it in the gob?\" Spits thought we were crazy for not wanting to blow up the dragons.\n \"We\u0027ll kill them if we have to,\" I sighed. \"But only if there\u0027s no other way.\"\n \"And only after they\u0027ve - eaten you,\" Harkat added, then laughed when Spits cursed loudly at him.\n Forming a line, we checked ourselves one last time. Harkat and I were carrying everything we owned in our pockets, and Spits had his sack slung over his shoulder. Taking deep breaths, we shared crooked grins, then started down into the valley, where the four dragons were waiting.\n A young dragon spotted us first. It was playing with its sibling - the pair often chased each other around the valley, like two overgrown kittens. When it saw us, it drew up short, flapped its wings and screeched warningly. The heads of the female dragons shot up, their hot yellow eyes fierce above their long purple faces.\n The female with the grey head got to her feet, spread her wings, flapped them firmly and soared into the air. She circled around, screeching, then directed her snout at us and zoomed in. I could see her nostrils expanding as she prepared to blow fire.\n \"I\u0027ll deal with this one,\" I called to Harkat, stepping forward and holding up one of the larger globes. I judged my moment finely, waited until the dragon was almost directly overhead, then threw the globe hard into the earth and ducked. It exploded, sending soil and pebbles flying up into the dragon\u0027s face. She screamed with panic and veered sharply away to the left.\n The second female took to the air at the sound of the explosion, and the young dragons followed, adopting a position several metres above their mothers, who hovered side by side.\n While the dragons hung in the air, we hurried towards the Lake of Souls, Harkat and I watching our every footstep, all too aware of the consequences if we stumbled and smashed the deadly globes. Spits was muttering over and over, \"Better be worth it! Better be worth it! Better be ?\"\n The female dragons split up and attacked us on two fronts at the same time, swooping out of the sky like a couple of comets. Harkat and I waited, then threw our globes at the same time, confusing the dragons with loud explosions and blinding geysers of earth and stones.\n The dragons dogged our steps all the way to the Lake, attacking in turn or together every minute or so, only pulling clear when we launched our globes. One of the young dragons tried to join in, but its mother shot a warning streak of fire at it, frightening it back to its previous safe height.\n As we progressed, I realized the dragons were intelligent creatures. After the first few explosions, they no longer flew into the blasts but pulled up short as soon as they saw us lobbing the globes. On a couple of occasions I tried to outfox them by just pretending to toss a globe, but they obviously saw through my ploy and only withdrew when I actually launched one.\n \"They\u0027ll keep coming until we run out of globes!\" I roared at Harkat.\n \"Looks that way!\" Harkat yelled back. \"Have you been keeping track - of how many you\u0027ve used?\"\n \"I think seven or eight.\"\n \"Me too,\" Harkat said. \"That only leaves us with about - half our original supply. Enough to get us to the - Lake - but not to get back!\" \"If we\u0027re going to retreat, we\u0027ll have to do it now,\" I noted.\n To my surprise, Spits answered before Harkat could. \"No!\" he yelled, his face alight. \"We\u0027re too close t\u0027 pull back!\"\n \"Spits seems to be getting into the spirit of the adventure,\" I laughed.\n \"The time he picks to - develop a backbone!\" Harkat snorted in reply.\n We hurried on to the Lake and arrived a couple of minutes later, having used another two globes. The female dragons pulled away when they saw us draw up to the edge of the Lake. They hovered in the air with their children, high above our heads, observing suspiciously.\n Spits was the first to gaze into the water of the Lake of Souls, while Harkat and I kept a watch on the dragons. After a few seconds he fell to his knees and moaned softly. \"It\u0027s beautiful! All I ever dreamt, and more!\"\n Staring over my shoulder to see what he was babbling about, I found myself gazing into murky blue water, in which swam hundreds upon hundreds of shimmering human figures. Their bodies and faces were pale and ill defined, some swelling out and sucking in, almost like a fish puffing itself up and returning to its normal size. Others were squashed into tiny balls or stretched out to impossible lengths. All swam in slow, mournful circles, listless, oblivious to distractions, their blinking eyes or flexing fingers the only signs that they weren\u0027t totally lifeless. A few of the shapes drifted towards the upper levels of the Lake every now and then, but none broke the surface of the water. I got the impression that they couldn\u0027t.\n \"The souls of the dead,\" Harkat whispered. Both of us had turned our backs on the dragons, momentarily captivated by the spectacle of the Lake.\n Most of the figures twisted slowly as they swam, so that their faces revolved in and out of sight. Every face was a picture of loneliness and sorrow. This was a lake of misery. Not agony - nobody seemed to be in pain - just sadness. I was studying the faces, filled with a sense of pity, when I spotted one I knew. \"By the black blood of Harnon Oan!\" I shouted, taking an involuntary step back.\n \"What is it?\" Harkat asked sharply - he thought I\u0027d found the person he used to be.\n \"Murlough!\" It was less than a breath on my lips. The first vampaneze I ever encountered. Consumed by madness, he\u0027d lost control and had been killing people in Mr Crepsley\u0027s home city. We\u0027d tracked him down and Mr Crepsley killed him. The vampaneze looked exactly the way he had when he died, only his purple sheen was muted by the water of the Lake and the depth he was swimming at.\n As I watched, Murlough sunk downwards, slowly dropping from sight into the lower reaches of the Lake. A shiver ran down my spine. I\u0027d never thought to look upon Murlough\u0027s face again. It had dredged up many bad memories. I was lost in thought, transported to the past, reliving those long ago nights, wondering what other souls I might find here. Not Mr Crepsley - Evanna had told me his soul was in Paradise. But what about the first vampaneze I\u0027d killed? Gavner Purl? Arra Sails? Kur?\n \"Beautiful,\" Spits murmured, breaking my train of thought. He looked up at me and his eyes were wet with happy tears. \"The little man in the yellow galoshes told me \u0027twould be like this but I never believedit till now. \"All my dreams would come true\", he said. Now I know he wasn\u0027t lying.\"\n \"Never mind your dreams!\" I snapped, recalling the danger we were in. I put Murlough from my thoughts and spun to keep both eyes on the dragons. \"Get fishing, quick, so we can get out of here!\"\n \"I\u0027ll get fishing, sure enough,\" Spits giggled, \"but if ye thinks I\u0027m leaving this pool o\u0027 sunken treasures, ye\u0027re crazier than them Kulashkas!\"\n \"What do you mean?\" Harkat asked, but Spits didn\u0027t answer immediately, only unravelled his net with measured care and fedit into the still water of the Lake of Souls.\n \"I was considered a prize on thePrince o\u0027 Pariahs ,\" the pirate said softly. \"Nobody cooked as fine a meal as Spits Abrams. The cap\u0027n used to say I was second in importance only t\u0027 Boom Boom Billy, and when Billy blew himself up, I became the most valuable man aboard. Every pirate would\u0027ve sold his mother fer a bowl o\u0027 Spits\u0027s famous stew, or a slice of his delicious roast meat.\"\n \"He\u0027s cracking up!\" I yelled.\n \"I don\u0027t think so,\" Harkat said nervously, studying Spits as he focused on his net, lips drawn back over his teeth, eyes burning with a frightening inner light.\n \"They never asked where the meat came from,\" Spits continued, swishing his net through the water. The souls in the Lake parted and swam around the net automatically, but their glum expressions didn\u0027t change. \"Even when we\u0027d been at sea fer months on end, and all the other supplies had run out, I was able t\u0027 slap up as much meat as they could eat.\"\n The pirate paused and his mouth grew tight with anger. \"When they found out, they said I wasn\u0027t human and didn\u0027t deserve t\u0027 live. But they knew. Deep down, they must\u0027ve guessed, and they went on chewing regardless. \u0027Twas only when a new man caught me and made a fuss that they had to admit it. Hypocrites!\" he roared. \"They was a stinking bunch o\u0027 lying, double-faced hypocrites, fit only t\u0027 roast in the fires o\u0027 hell!\"\n Spits\u0027s face grew crafty and he laughed maniacally, drawing his net out, checking its condition, then lowering it back into the water. \"But since the devil couldn\u0027t be bothered with \u0027em, I\u0027ll treat \u0027em to a fire of me own. Aaarrr! They thought they\u0027d seen the last o\u0027 Spits Abrams when they tossed me overboard. But we\u0027ll see who has the last laugh when they\u0027re draped on a spit, sizzling slowly over my flames!\"\n \"What\u0027s he talking about?\" I croaked.\n \"I think I understand,\" Harkat whispered, then spoke to Spits. \"How many of the people - that you fished from the sea - did youkill ?\"\n \"Most of \u0027em,\" Spits giggled. \"In the heat o\u0027 battle, nobody took any notice of them what jumped overboard. I kept the occasional one alive, t\u0027 show off t\u0027 the cap\u0027n and crew. But I slit the throats o\u0027 most and hid the bodies in the galley.\"\n \"And then you carved them - up, cooked them and served them - to the pirates,\" Harkat said hollowly, and I felt my stomach churn.\n \"What?\" I gasped.\n \"That\u0027s Spits\u0027s big secret,\" Harkat said sickly. \"He was a cannibal and he turned his - crewmates into cannibals too!\"\n \"They loved it!\" Spits howled. \"They\u0027d\u0027ve gone on eating Spits\u0027s grub fer ever and said nowt if that new lad hadn\u0027t walked in on me while I was carving up a nice fat vicar and his wife! After that, they acted disgusted and treated me like a monster.\"\n \"I\u0027ve eaten human flesh,\" Harkat said quietly. \"Little People will eat anything. When I first came back from the dead, my thoughts - weren\u0027t my own, and I ate with the rest. But we only ate the flesh - of those who\u0027d died naturally. We didn\u0027t kill. And we didn\u0027t take pleasure - from it. Youare a monster, even to someone - like me.\"\n Spits sneered. \"Come off it, imp! I know why ye\u0027re really here - t\u0027 feast yer chops on Spits\u0027s stew! Shan boy too!\" His eyes fixed on me and he winked crookedly. \"Ye thought I didn\u0027t know what ye was, but Spits ain\u0027t as dumb as he lets on. Ye\u0027re a bloodsucker! Ye fed from me when ye thought I was asleep. So don\u0027t play the innocents, lads - \u0027twon\u0027t work!\"\n \"You\u0027re wrong, Spits,\" I said. \"I drink blood to survive, and Harkat\u0027s done things in the past that he\u0027s ashamed of. But we aren\u0027t killers or cannibals. We don\u0027t want any part of your unholy feast.\"\n \"We\u0027ll see if ye think that way when ye smell the cooking,\" Spits cackled. \"When yer lips are drooling and yer bellies growling, yell come running, plates out, begging fer a thick, juicy slice o\u0027 thigh.\"\n \"He\u0027s completely out of his mind,\" I whispered to Harkat, then called aloud to Spits. \"Have you forgotten the dragons?We\u0027ll get roasted and eaten if we stand around gabbing!\"\n \"They won\u0027t bother us,\" Spits said confidently. \"The Tiny man told me. He said as long as I stayed within eight feet o\u0027 the Lake, the dragons couldn\u0027t harm me - they can\u0027t come this close. There\u0027s a spell on the Lake. Unless a living person jumps or falls in, the dragons can\u0027t come near.\"\n Spits stopped dragging on his net and gazed at us calmly. \"Don\u0027t ye see, lads? We don\u0027t ever need t\u0027 leave. We can stay here the rest of our lives, fishing fer dinner each day, all the water we can drink. Tiny said he\u0027d drop by if we made it, and promised t\u0027 provide me with pots and material t\u0027 build fires. We\u0027ll have t\u0027 eat our catch raw till then, but I\u0027ve ate humans raw before - not as tasty as when cooked, but ye won\u0027t have cause fer complaint.\"\n \"That\u0027syour dream!\" Harkat hissed. \"Not to return to our world, but to stay - here for ever, fishing for the souls - of the dead!\"\n \"Aaarrr!\" Spits laughed. \"Tiny told me all about it. The souls don\u0027t have bodies in the water - them\u0027s just ghosts that we see. But once they\u0027re dragged on to dry land, they become real, the way they was before they died. I\u0027ll be able t\u0027 kill \u0027em again and carve \u0027em up any way I like. An unending supply - including the souls o\u0027 the cap\u0027n and most o\u0027 the others on thePrince o\u0027 Pariahs ! I can have revenge on top of a full stomach!\"\n There was a heavy thud behind us - the male dragon had returned and set down close to where we were standing. I raised a globe to throw at him, but then I saw that he wasn\u0027t coming any closer. Spits was right about the dragons not being able to approach the Lake.\n \"We can\u0027t let you do it,\" I said. Focusing on Spits, I started walking towards him.\n \"Ye can\u0027t stop me,\" he sniffed. \"If ye don\u0027t want t\u0027 stay, ye can leave. I\u0027ll fish up the imp\u0027s soul and ye can take yer chances with the dragons. But there\u0027s nowt ye can do t\u0027 make me go with ye. I\u0027m staying.\"\n \"No,\" I said. \"We won\u0027t let you.\"\n \"Stay back!\" Spits warned, lowering his net and drawing a knife. \"I like ye both - ye\u0027re decent sorts fer a vampire and an imp! - but I\u0027ll slice the skin clean off yer bones if I have t\u0027!\"\n \"Don\u0027t try, Spits,\" Harkat said, stepping up behind me. \"You\u0027ve seen us in action. You know we\u0027re stronger and faster - than you. Don\u0027t make us hurt you.\"\n \"I ain\u0027t scared o\u0027 ye!\" Spits shouted, backing away, waving his knife at us. \"Ye need me more than I need ye! Unless ye back off, I won\u0027t fish yer soul out, and this\u0027ll all have been fer nowt!\"\n \"I don\u0027t care,\" Harkat said softly. \"I\u0027d rather blow my chance - and die, than leave you here to torment the souls - of the dead and feed upon them.\"\n \"But they\u0027re bad \u0027uns!\" Spits howled. \"These ain\u0027t the souls o\u0027 good people - they\u0027re the souls o\u0027 the lost and damned, who couldn\u0027t get int\u0027 heaven.\"\n \"It doesn\u0027t matter,\" Harkat said. \"We won\u0027t let you - eat them.\"\n \"Crazy pair o\u0027 landlubbers,\" Spits snarled, coming to a halt. \"Ye think ye can rob me o\u0027 the one thing that\u0027s kept me going all these years alone in this hellhole? \u0027Twasn\u0027t enough fer ye t\u0027 rob me o\u0027 me whisky - now ye wants t\u0027 take me meat away too! Well damn ye, demons o\u0027 the dark - damn ye both t\u0027 hell!\"\n With that shrill cry, Spits attacked, slicing wildly with his knife. We had to leap back quickly to avoid being gutted by the raging ex-pirate. Spits raced after us, whooping gleefully, chopping with his knife. \"Gonna slice ye up and cook ye!\" he howled. \"The dead can wait - I\u0027ll feast onyer flesh tonight! I\u0027m gonna see what ye\u0027re made of inside. I never ate a vampire or imp before - \u0027twill make fer an interesting comparison!\"\n \"Spits!\" I roared, ducking out of the way of his knife. \"Stop now and we\u0027ll let you live! Otherwise we\u0027ll have to kill you!\"\n \"Only one man\u0027ll be doing any killing today!\" Spits retorted. \"Spits Abrams, scourge o\u0027 the seas, lord o\u0027 the Lake, sultan o\u0027 chefs, king o\u0027?\"\n Before Spits got any further, Harkat slid inside his stabbing range and grabbed his knife arm. Spits screamed at the Little Person and punched him with his free fist. When that didn\u0027t have any effect, he pulled a whisky bottle out of his sack and prepared to break it over Harkat\u0027s head.\n \"No you don\u0027t!\" I grunted, seizing Spits\u0027s forearm. I squeezed tightly, until I heard bones cracking. Spits screeched painfully, dropped the bottle and spun away from me. I released him and he retreated sharply, breaking free of Harkat\u0027s grip, collapsing on the ground a couple of metres away. \"Quit it!\" I yelled as Spits staggered to his feet and drew another bottle, cradling his injured arm across his chest.\n \"Never!\" he cried. \"I\u0027ve still got one good hand. That\u0027ll be enough t\u0027?\" He stopped when he saw us freeze, our eyes widening. \"What\u0027re ye up t\u0027 now?\" he asked suspiciously. We couldn\u0027t answer, only gaze wordlessly at the space behind him. Spits sensed that we weren\u0027t trying to trick him, and whipped around to see what we were staring at. He found himself gazing up into the fierce cold eyes of the male dragon.\n \"Is that all that\u0027s bothering ye?\" Spits hooted. \"Didn\u0027t I tell ye they couldn\u0027t come next nor near us as long as we stayed ?\"\n He trailed off into silence. He looked down at his feet, then at us, then at the Lake - which was about four or five metres away from where he was standing!\n Spits could have made a run for it, but didn\u0027t. With a bitter smile, he shook his head, spat into the grass, and muttered, \"Aaarrr!\" The dragon opened its mouth wide when Spits said that - as though he\u0027d been awaiting an order - and blew a huge ball of fire over the stranded ex-pirate. Spits disappeared in flames and Harkat and I had to cover our eyes and turn aside from the heat.\n When we looked again, a fiery Spits was stumbling towards us, arms thrashing, face invisible beneath a mask of red flames. If he was screaming, we couldn\u0027t hear him over the crackle of his burning hair and clothes. We lunged out of his way as Spits staggered closer. He continued past us, oblivious to our presence, and didn\u0027t stop until he reached the edge of the Lake of Souls and toppled in.\n Snapping out of our daze, we raced to the Lake in case there was anything we could do to help Spits. But we were too late. He was already deep under water, arms still moving, but weakly. As we watched, the shimmering shades of the dead surrounded the pirates body, as though guiding it on its way. Spits\u0027s arms gradually stopped waving, then his body sunk deeper into the water, until it vanished from sight in the murky gloom of the soul-filled depths.\n \"Poor Spits,\" Harkat croaked. \"That was awful.\"\n \"He probably deserved it,\" I sighed, \"but I wish it could have happened some other way. If only he\u0027d?\"\n A roar stopped the words dead in my throat. My head shot around and I spotted the male dragon, hovering in the air close above us, eyes gleaming. \"Don\u0027t worry,\" Harkat said. \"We\u0027re close to the Lake. It can\u0027t ?\" The words died on his lips and he stared at me, his green eyes filling with fear.\n \"The spell!\" I moaned. \"Spits said it would only last until a living person fell into the Lake! And he was still alive when ?\"\n As we stood trembling, the dragon - no longer bound by the spell - opened his jaws wide and coughed a ball of fire straight at us - meaning to finish us off the same way he\u0027d killed Spits! \n","sourceLink":"https://allnovel.net/the-lake-of-souls-the-saga-of-darren-shan-10/page-23.html","bookId":2446,"book":{"id":2446,"title":"The Lake of Souls (The Saga of Darren Shan #10)","description":"Storyline: \n The Saga of Darren Shan #10: The Lake of Souls \n The Lake of Souls is the 10th book in The Saga of Darren Shan and is also the first in the 4th and final trilogy in \u0027The Saga\u0027 called The Vampire Destiny Trilogy. It reveals a lot about the character of Harkat Mulds mainly and introduces a new character called Spits Abrams. This book also adds many more questions that will be answered in the next two books. Also, this book is the longest in the series. \n The Lake of Souls takes place right after Killers of the Dawn, with Mr. Crepsley dead and Steve\u0027s revelation that he is the Lord of the Vampaneze. Darren is unable to cry. He feels numb, but with the help of the bearded lady, Truska, he eventually does so. Mr. Tiny then appears and tells Harkat that if he wants his nightmares (which have returned) to stop, he must walk through a portal that Mr. Tiny makes. Harkat refuses to let Darren go with him. Debbie Hemlock and...\n \n","cover":"https://allnovel.net/images/the-lake-of-souls-the-saga-of-darren-shan-10.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-lake-of-souls-the-saga-of-darren-shan-10.html","creation":"Oct 5, 2019 8:58:43 AM","modification":"Oct 5, 2019 4:18:46 PM"}}
