{"id":76531,"no":11,"title":"Page 11","content":"\"You\u0027re upset because you killed?\" Duncan asked, unable to keep the astonishment out of his voice. Duncan had to remind himself that Madelyne was only a woman, and the strangest things did seem to upset the weaker sex. He also weighed all that he\u0027d put Madelyne through in the past two days. \"I\u0027ve killed many more,\" he said, thinking to ease her conscience.\\n\\n His plan failed. \"I don\u0027t care if you\u0027ve killed legions of soldiers,\" Madelyne announced. \"You don\u0027t have a soul, so it doesn\u0027t matter how many lives you take.\"\\n\\n Duncan didn\u0027t have a ready answer to that statement. He realized that it was pointless to argue with her. Madelyne was too distraught to think logically, and surely just as exhausted. Why, she was so upset, she couldn\u0027t even raise her voice to him.\\n\\n Duncan cradled her in his arms, tightening his grip until she stopped struggling. With a weary sigh he muttered, more to himself than to her, \"What am I to do with you?\"\\n\\n Madelyne heard him, and her answer was swift. \"I don\u0027t care what you do with me.\" She jerked her head back and looked up at him. Madelyne noticed the jagged cut just below Duncan\u0027s right eye then. She used the cuff of her gown to mop the stream of blood away, but she contradicted her gentle action with angry words. \"You can leave me here, or you can kill me,\" she informed him as she dabbed at the edges of his cut. \"Nothing you do makes any difference to me. You shouldn\u0027t have taken me with you, Duncan.\"\\n\\n \"Your brother came after you,\" Duncan pointed out.\\n\\n \"He did not,\" Madelyne contradicted him. \"He came after you because you destroyed his home. He doesn\u0027t care about me. If you\u0027d only open your mind, I know I could convince you of the truth. But you are too stubborn to listen to anyone. I find it pointless to speak to you. Aye, pointless! I vow I\u0027ll never speak to you again.\"\\n\\n Her tirade took the last of her strength. Madelyne finished cleaning his abrasion as best she could and then sagged against his chest, dismissing him.\\n\\n Lady Madelyne was a paradox. Duncan was nearly undone by the tender way she touched his face when she tried to repair his injury. Duncan didn\u0027t think she had even been aware of what she was doing. He suddenly remembered how Madelyne had faced Gilard when they were back in Louddon\u0027s fortress. Aye, she\u0027d been a contradiction then too. Madelyne had given Gilard a serene look while he shouted his frustration, yet all the while she\u0027d clung to Duncan\u0027s hand.\\n\\n Now she raged at him while she ministered to him. Duncan sighed again. He rested his chin against the top of Madelyne\u0027s head and wondered how in God\u0027s name such a gentle woman could be related to the devil.\\n\\n The numbness was wearing thin. Now that the surge of anger had abandoned her, Madelyne\u0027s thigh began to throb painfully. Her cloak hid the damage from Duncan. She believed he was unaware of her injury and found perverse satisfaction over that fact. It was an illogical reaction but Madelyne couldn\u0027t seem to think with much reason. She was suddenly so tired, so hungry, and in such pain, she couldn\u0027t think at all.\\n\\n The soldiers joined their leader and within minutes they were headed for the Wexton fortress. An hour later it became gritty determination that kept Madelyne from voicing complaint.\\n\\n Duncan\u0027s hand accidentally brushed against her injured thigh. Her cloak and gown offered little cushion against the burning agony. Madelyne held her scream. She slapped his hand away, but the fire from his touch lingered, inflaming the injury to an excruciating level.\\n\\n Madelyne knew she was going to be sick. \"We must stop for a moment,\" she told Duncan. She wanted to scream at him, to weep, too, but she had vowed he wouldn\u0027t destroy what was left of her gentle disposition.\\n\\n Madelyne knew he\u0027d heard her. His nod acknowledged that he had, yet they continued to ride, and after a few more minutes she came to the conclusion he had decided to ignore her request.\\n\\n What an inhuman beast he was! Though it offered her little comfort, she mentally listed all the vile names she wished to yell at him. She summoned up every foul word she could remember, though her vocabulary of crude words was limited. It satisfied her, until she realized she was probably sinking to Duncan\u0027s level. Damn, she was a gentle woman.\\n\\n Her stomach wouldn\u0027t settle. Madelyne remembered her vow never to speak to him again, but she was forced, by circumstances, to repeat her request. \"If you don\u0027t stop, I\u0027m going to be sick all over you.\"\\n\\n Her threat got an immediate reaction. Duncan raised his hand, giving the order to halt. He was off his horse and lifting Madelyne to the ground before she could brace herself in preparation.\\n\\n \"Why are we stopping?\" The question came from Gilard, who had also dismounted and was hurrying over to his brother. \"We\u0027re almost home.\"\\n\\n \"Lady Madelyne,\" Duncan answered, giving Gilard no further information.\\n\\n Madelyne had already begun the torturous walk toward the privacy the trees offered, but she paused when she heard Gilard\u0027s question. \"You can just stand there and wait for me, Gilard.\"\\n\\n It sounded like an order. Gilard raised an eyebrow in surprise, turning to his brother. Duncan was frowning as he watched Madelyne, and Gilard concluded his brother was irritated by the way Madelyne had just spoken to him. \"She has been through an ordeal,\" Gilard rushed out in excuse, lest Duncan decide to retaliate.\\n\\n Duncan shook his head. He continued to watch Madelyne until she had disappeared into the forest. \"Something\u0027s wrong,\" he muttered, frowning as he tried to figure out what was bothering him.\\n\\n Gilard sighed. \"She is ill perhaps?\"\\n\\n \"And, and she threatened to…\" Duncan didn\u0027t finish his comment, but started out after Madelyne.\\n\\n Gilard tried to stay him with his hand. \"Give her some privacy, Duncan. She\u0027ll return to us,\" he said. \"There isn\u0027t anyplace she can hide,\" he reasoned.\\n\\n Duncan shook his brother\u0027s hand away. He\u0027d seen the look of pain in Madelyne\u0027s eyes, noticed, too, the extreme stiffness in her gait. Duncan instinctively knew an unsettled stomach wasn\u0027t the cause. She wouldn\u0027t have favored her right side if that was the case. And if she was about to throw up, she would have run, not walked away from the soldiers. Nay, something was wrong and Duncan meant to find out what it was.\\n\\n He found her leaning against the side of a gnarled oak tree, her head bent. Duncan stopped, not wishing to invade upon her privacy. Madelyne was weeping. He watched as she slowly lifted the cloak away and let it drop to the ground. And then he understood the true reason for her distress. The left side of her gown was shredded to the hem, and soaked with blood.\\n\\n Duncan didn\u0027t realize he\u0027d shouted until Madelyne let out a frightened whimper. She didn\u0027t have the strength to back away from him, nor did she fight him when he forced her hands away from her thigh and knelt down at her side.\\n\\n When Duncan viewed the damage, he was filled with such rage, his hands shook as he pried the garment away. Dried blood made it a slow task. Duncan\u0027s hands were big and awkward and he was trying to be as gentle as possible.\\n\\n The injury was deep, nearly as long as his forearm, and embedded with dirt. It would need to be cleaned and sewn together.\\n\\n \"Ah, Madelyne,\" Duncan whispered, his voice gruff. \"Who did this to you?\"\\n\\n His voice sounded like a warm caress, his sympathy obvious. Madelyne knew she\u0027d start crying again if he showed her any more kindness. Aye, her control would break then, just like one of the brittle branches she was clinging to now.\\n\\n Madelyne wouldn\u0027t allow it. \"I don\u0027t want your sympathy, Duncan.\" She straightened her shoulders and tried to give him a look of dismissal. \"Take your hands off my leg. It isn\u0027t decent.\"\\n\\n Duncan was so surprised by the show of authority, he almost smiled. He glanced up, saw the fire in her eyes. Duncan knew then what she was trying to do. Pride had become her defense. He\u0027d already noticed how Madelyne valued control.\\n\\n Looking back at her injury, he realized there was little to be done about it now. He decided then to let Madelyne have her way.\\n\\n Duncan forced a gruff voice when he stood up and answered her. \"You\u0027ll get no sympathy from me, Madelyne. I\u0027m like a wolf. I don\u0027t suffer human emotions.\"\\n\\n Madelyne didn\u0027t answer him, but her eyes widened over his comment. Duncan smiled and knelt down again.\\n\\n \"Leave me alone.\"\\n\\n \"Nay,\" Duncan replied, his voice mild. He pulled his dagger free and began to cut a long strip of her gown.\\n\\n \"You are ruining my gown,\" Madelyne muttered.\\n\\n \"For God\u0027s sake, Madelyne, your gown is already ruined,\" Duncan answered.\\n\\n With as much tenderness as possible he wrapped the strip of material around her thigh. He was tying a knot, when she shoved against his shoulder.\\n\\n \"You\u0027re hurting me.\" She hated herself for admitting it. Damn, she was going to cry.\\n\\n \"I am not.\"\\n\\n Madelyne gasped, forgetting all about weeping. She was infuriated over his comment. How dare he contradict her! She was the one suffering.\\n\\n \"Your flesh will need needle and thread,\" Duncan remarked.\\n\\n Madelyne slapped his shoulder when he dared shrug over his announcement\\n\\n \"No one is putting a needle to me.\"\\n\\n \"You\u0027re a contrary woman, Madelyne.\" Duncan said as he bent to pick up her cloak. He draped it around her shoulders and then lifted her into his arms, careful to shield her injury.\\n\\n Madelyne instinctively put her arms around his neck. She considered scratching his eyes out because of the terrible way he was treating her. \"You\u0027re the contrary one, Duncan. I\u0027m a sweet-tempered maiden you would try to destroy if I gave you the chance. And I swear to God, this is the last time I\u0027ll speak to you.\"\\n\\n \"Ah, and you\u0027re so honorable you\u0027d never break your word. Isn\u0027t that true, Lady Madelyne?\" he asked as he carried her back to the waiting men.\\n\\n \u0027That is correct,\" Madelyne immediately answered. She closed her eyes and leaned against his chest. \"You have the brains of a wolf, do you know that? And wolves have very small brains.\"\\n\\n Madelyne was too tired to look up to see how he was reacting to her insults. She bristled inside over the way he was treating her, and then realized she should be thankful for his cold attitude. Why, he had made her angry enough to forget her pain. Just as important, his lack of compassion had helped her overcome the urge to break down and weep in front of him. That would have been undignified, crying like an infant, and both her dignity and her pride were cherished cloaks she always wore. It would have been humiliating to lose either. Madelyne allowed herself a little smile, certain Duncan couldn\u0027t see it. He was a foolish man, for he had just saved her pride and didn\u0027t even know it.\\n\\n Duncan sighed. Madelyne had just broken her promise when she spoke to him. He didn\u0027t feel the urge to point that fact out to her, but it made him feel like grinning all the same.\\n\\n He wanted the details from Madelyne, to learn how she\u0027d been injured and by whose hand. In his heart he couldn\u0027t believe one of his own had harmed her, yet Louddon\u0027s men would also try to protect her, wouldn\u0027t they?\\n\\n Duncan decided to wait for his answers. He needed to get his anger under control first. And Madelyne needed care and rest now.\\n\\n It had been difficult to banter with her. Duncan wasn\u0027t a man used to masking his anger. When he was wronged, he attacked. Yet he had understood how close Madelyne was to breaking down. The retelling would upset her now.\\n\\n When they were once again on their way, Madelyne found escape from her pain, snuggled against Duncan\u0027s chest. Her face rested under his chin.\\n\\n Madelyne was feeling safe again. Her reaction to Duncan confused her. In her heart she admitted that he wasn\u0027t anything like Louddon, though she\u0027d take to her deathbed before she told him that. She was still his captive, after all, his pawn to use against her brother. Yet she really didn\u0027t hate him. Duncan was merely retaliating against Louddon, and she was caught in the middle.\\n\\n \"I\u0027ll escape, you know.\"\\n\\n She hadn\u0027t realized she\u0027d spoken the thought aloud until Duncan answered her. \"You will not.\"\\n\\n \"We are home at last,\" Gilard shouted. His gaze was directed on Madelyne. Most of her face was hidden from view, but what he could see showed a very tranquil expression. He thought she might be sleeping and was thankful. In truth, Gilard didn\u0027t know how to proceed with Lady Madelyne now. He was in a damn awkward position. He\u0027d treated her with contempt. And how had she repaid him? Why, she\u0027d actually saved his life. He couldn\u0027t understand why she\u0027d come to his assistance and longed to ask. He didn\u0027t though, because he had a feeling he wouldn\u0027t like her answer.\\n\\n When Gilard saw the walls looming into the sky ahead of them, he nudged his mount ahead of Duncan\u0027s so that he could be the first to enter the lower bailey. By rite and tradition, Duncan chose to be the last of his men to enter the safety provided by the thick stone walls. The soldiers liked this ritual, for it reminded each of them that their overlord placed their lives above his own. Though each man had pledged fealty to Baron Wexton, and each willingly met the call to join him in battle, every one also knew he could depend upon his lord for protection as well.\\n\\n It was an easy alliance. Pride was the root. Aye, each man could also boast of being one of Duncan\u0027s elite soldiers.\\n\\n Duncan\u0027s men were the best-trained soldiers in England. Duncan measured success by inflicting trials ordinary men would have found impossible to meet. His men were considered to be the chosen few, though they numbered near to six hundred in all when an accurate count was taken and all were called to fulfill their forty-day requirement.\\n\\n Their might was revered, whispered about by lesser men, and their feats of remarkable strength recounted without need of exaggeration to liven the telling. The truth was interesting enough.\\n\\n The soldiers reflected the values of their leader, a lord who wielded his sword with far greater accuracy than all challengers. Duncan of Wexton was a man to be frightened of. His enemies had given up trying to discover his weakness. The warrior showed no vulnerability. He didn\u0027t appear to be interested in worldly offerings. No, Duncan had never taken gold as his second mistress as others of his rank had so done. The baron presented no Achilles heel to the outside world. He was a man of steel, or so it was sadly believed by those who wished him harm. He was a man without conscience, a warrior without a heart.\\n\\n Madelyne had little knowledge of Duncan\u0027s reputation. She felt protected in his arms and watched the soldiers file past. She was curious over the way Duncan waited.\\n\\n She turned her attention to the fortress in front of her. The massive structure sat atop a stark hill, without benefit of a single tree to give relief from the severity. A gray stone wall circled the fortress and must have been at least seven hundred feet in width. Madelyne had never seen anything so monstrous. The wall was tall enough to touch the bright moon, or so it seemed to Madelyne. She could see a portion of a circular tower protruding from inside, so tall that the top was hidden from view by heavy clouds. \\n\\n","sourceLink":"https://allnovel.net/honor-s-splendour/page-11.html","bookId":1841,"book":{"id":1841,"title":"Honor\u0027s Splendour","description":"Storyline: This classic medieval romance from New York Times bestselling author Julie Garwood is a fan favorite—a beautiful lady needs rescue from a knight in shining armor, and gets an alpha warrior instead. \\n In the feuding English court, gentle Lady Madelyne suffered the cruel whims of her ruthless brother, Baron Louddon. Then, in vengeance for a bitter crime, Baron Duncan of Wexton—the Wolf—unleashed his warriors against Louddon. Exquisite Madelyne was the prize he catured... but when he gazed upon the proud beauty, he pledged to protect her with his life. In his rough-hewn castle, Duncan proved true to his honor. But when at last their noble passion conquered them both, she surrendered with all her soul. Now, for love, Madelyne would stand fast... as bravely as her Lord, the powerful Wolf who fought for... Honor’s Splendour.\\n","cover":"https://allnovel.net/images/honor-s-splendour.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/honor-s-splendour.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:38:45 AM"}}
