{"id":68700,"no":3,"title":"Page 3","content":"10 Daneel and Giskard, with robotic courtesy, saw Mandamus and his robots off the grounds of the establishment. Then, since they were outside, they toured the grounds, made certain that the lesser robots were in their places, and took note of the weather (cloudy and a bit cooler than seasonal). Daneel said, \"Dr. Mandamus admitted openly that the Settler worlds are now stronger than the Spacer worlds. I would not have expected him to do that.\" Giskard said, \"Nor I. I was certain that the Settlers would increase in strength as compared with the Spacers because Elijah Baley had predicted it many decades ago, but I could see no way of determining when the fact would become obvious to the Auroran Council. It seemed to me that social inertia would keep the Council firmly convinced of Spacer superiority long after that had vanished, but I could not calculate for how long they would continue to delude themselves.\" \"I am astonished that Partner Elijah foresaw this so long ago.\" \"Human beings have ways of thinking about human beings that we have not.\" Had Giskard been human, the remark might have been made with regret or envy, but since he was a robot it was merely factual. He went on. \"I have tried to gain the knowledge, if not the way of thinking, by reading human history in great detail. Surely somewhere in the long tale of human events, there must be buried the Laws of Humanics that are equivalent to our Three Laws of Robotics.\" Daneel said, \"Madam Gladia once told me that this hope was an impossible one.\" \"So that may be, friend Daneel, for though it seems to me such Laws of Humanics must exist, I cannot find them. Every generalization I try to make, however broad and simple, has its numerous exceptions. Yet if such Laws existed and if I could find them, I could understand human beings better and be more confident that I am obeying the Three Laws in better fashion.\" \"Since Partner Elijah understood human beings, he must have had some knowledge of the Laws of Humanics.\" \"Presumably. But this he knew through something that human beings call intuition, a word I don\u0027t understand, signifying a concept I know nothing of. Presumably it lies beyond reason and I have only reason at my command.\" 11 That and memory! Memory that did not work after the human fashion, of course. It lacked the imperfect recall, the fuzziness, the additions and subtractions dictated by wishful thinking and self-interest, to say nothing of the lingerings and lacunae and backtracking that can turn memory into hours-long daydreaming. It was robotic memory ticking off the events exactly as they had happened, but in vastly hastened fashion. The seconds reeled off in nanoseconds, so that days of events could be relived with such rapid precision as to introduce no perceptible gap in a conversation. As Giskard had done innumerable times before, he relived that visit to Earth, always seeking for understanding of Elijah Baley\u0027s casual ability to foresee the future, always failing to find it. Earth! Fastolfe had come to Earth in an Auroran warship, with a full complement of fellow passengers, both human and robot. Once in orbit, however, it was only Fastolfe who took the module in for a landing. Injections had stimulated his immune mechanism and he wore the necessary gloves, coveralls, contact lenses, and nose plugs. He felt quite safe as a result, but no other Auroran was willing to go along as part of a delegation. This Fastolfe shrugged off, since it seemed to him (as he later explained to Giskard) that he would be more welcome if he came alone. A delegation would disagreeably remind Earth of the bad old days (to them) of Spacetown, when Spacers had a permanent base on Earth and directly dominated the world. With him, Fastolfe brought Giskard, however. To have arrived without any robots would have been unthinkable, even for Fastolfe. To have arrived with more than one would have put a strain on the increasingly antirobot Earthmen he hoped to see and with whom he intended to negotiate. To begin with, of course, he would meet with Baley, who would be his liaison with Earth and its people. That was the rational excuse for the meeting. The real excuse was simply that Fastolfe wanted very much to see Baley again; he certainly owed him enough. (That Giskard wanted to see Baley and that he very slightly tightened the emotion and impulse in Fastolfe\u0027s brain to bring that about, Fastolfe had no way of knowing - or even imagining.) Baley was waiting for them at the time of landing and with him was a small group of Earth officials, so that there was a tedious passage of time during which politeness and protocol had its innings. It was some hours before Baley and Fastolfe could get away by themselves and it might not have happened that soon but for Giskard\u0027s quiet and unfelt interference - with just a touch at the minds of the more important of those officials who were distinctly bored. (It was always safe to confine one\u0027s self to accentuating an emotion that already existed. It could almost never bring harm.) Baley and Fastolfe sat in the smallness of a private dining room that was ordinarily available only to high government officials. Food items could be punched out on a computerized menu and were then brought in by computerized carriers. Fastolfe smiled. \"Very advanced,\" he said, \"but these carriers are merely specialized robots. I\u0027m surprised Earth uses them. They are not of Spacer manufacture, surely.\" \"No, they\u0027re not,\" said Baley solemnly. \"Home-grown, so to speak. This is only for use at the top and it\u0027s my first chance, ever, to experience it. I\u0027m not likely to do so again.\" \"You may be elected to high office someday and then experience this sort of thing daily.\" \"Never,\" said Baley. The dishes were put before each of them and the carrier was even sophisticated enough to ignore Giskard, who stood impassively behind Fastolfe\u0027s chair. For a while, Baley ate silently and then, with a certain shyness, he said, \"It is good to see you again, Dr. Fastolfe.\" \"The pleasure is as much mine. I haven\u0027t forgotten that two years ago, when you were on Aurora, you managed to free me of the suspicion of the destruction of the robot Jander and to turn the tables neatly on my overconfident opponent, the good Amadiro.\" \"I still shake when I think of it,\" said Baley. \"And greetings to you, too, Giskard. I trust you haven\u0027t forgotten me.\" \"That would be quite impossible, sir,\" said Giskard. \"Good! Well, Doctor, I trust the political situation on Aurora continues to be favorable. The news here would make it seem so, but I don\u0027t trust Earth analysis of Auroran affairs - \" \"You may - at the moment. My party is in firm control of the Council. Amadiro maintains a sullen opposition, but I suspect it will be years before his people recover from the blow you gave them. But how are things with you and with Earth?\" \"Well enough. - Tell me, Dr. Fastolfe,\" Baley\u0027s face twitched slightly, as though with embarrassment - \"have you brought Daneel with you?\" Fastolfe said slowly, \"I\u0027m sorry, Baley. I did, but I left him back on the ship. I felt it might not be politic to be accompanied by a robot who looked so much like a human being. With Earth as antirobot as it has become, I felt a humanoid robot might seem a deliberate provocation to them.\" Baley sighed. \"I understand.\" Fastolfe said, \"Is it true that your government is planning to prohibit the use of robots within the Cities?\" \"I suspect it will soon come to that, with a period of grace, of course, to minimize financial loss and inconvenience. Robots will be restricted to the countryside, where they are needed for agriculture and mining. There, too, they may eventually be phased out and the plan is to have no robots at all on the new worlds.\" \"Since you mention the new worlds, has your son left Earth yet?\" \"Yes, a few months ago. We have heard from him and he\u0027s arrived at a new world safely, along with several hundred Settlers, as they call themselves. The world has some native vegetation upon it and a low-oxygen atmosphere. Apparently, with time it can be made quite Earthlike. Meanwhile, some makeshift domes have been put up, new Settlers are advertised for, and everyone is busily engaged in terraforming. Bentley\u0027s letters and occasional hyperwave contact are very hopeful, but they don\u0027t keep his mother from missing him badly.\" \"And will you be going there, Baley?\" \"I\u0027m not sure that living on a strange world under a dome is my idea of happiness, Dr. Fastolfe - I haven\u0027t Ben\u0027s youth and enthusiasm but I think I\u0027ll have to in two or three years. In any case, I\u0027ve already given notice to the Department of my intention to emigrate.\" \"I imagine they must be upset over that.\" \"Not at all. They say they are, but they\u0027re glad to get rid of me. I\u0027m too notorious.\" \"And how does Earth\u0027s government react to this drive for expansion into the Galaxy?\" \"Nervously. They do not forbid it altogether, but certainly they are not cooperative. They continue to suspect that the Spacers are opposed to it and will do something unpleasant to stop it.\" \"Social inertia,\" said Fastolfe. \"They judge us according to our behavior of years past. - Surely we have made it plain that we now encourage Earth\u0027s colonization of new planets and that we intend to colonize new planets of our own.\" \"I hope you explain this to our government, then. - But, Dr. Fastolfe, another question on a smaller point. How is - \" And with that, he stalled. \"Gladia?\" said Fastolfe, hiding his amusement. \"Have you forgotten her name?\" \"No, no. I merely hesitated to - to - \" \"She\u0027s well,\" said Fastolfe, \"and living comfortably. She has asked me to remember her to you, but I imagine you need no nudging to recall her to mind.\" \"The fact of her Solarian origin is not used against her, I hope?\" \"No, nor is her role in the undoing of Dr. Amadiro. Rather the reverse. I take care of her, I assure you. - And yet I do not care to allow you to get off the subject altogether, Baley. What if Earth\u0027s officialdom continues to be opposed to immigration and expansion? Could the process continue despite such opposition?\" \"Possibly,\" said Baley, \"but not certainly. There\u0027s substantial opposition among Earthmen generally. It\u0027s hard to break away from the huge underground Cities that are our homes - \" \"Your wombs.\" \"Or our wombs, if you prefer. Going to new worlds and having to live with the most primitive facilities for decades never seeing comfort in one\u0027s own lifetime - that is difficult. When I think of it sometimes, I just decide not to go especially if I\u0027m passing a sleepless night. I\u0027ve decided not to go a hundred times and one day I may just stick to that decision. And if I have trouble when, in a way, I originated the entire notion, then who else is likely to go freely and gladly? Without government encouragement - or, to be brutally frank - without the government shoe applied to the seat of the pants of the population, the whole project may fail.\" Fastolfe nodded. \"I will try to persuade your government. But if I fail?\" Baley said in a low voice, \"If you fail - and if, therefore, our people fail - there remains only one alternative. The Spacers themselves must settle the Galaxy. The job must be done.\" \"And you will be content to see the Spacers expand and fill the Galaxy, while the Earthpeople remain on their single planet?\" \"Not content at all, but it would be better than the present situation of no expansion by either. Many centuries ago, Earthpeople flocked to the stars, established some of the worlds that are now called Spacer worlds, and those first few colonized others. It has been a long time, however, since either the Spacers or Earthpeople have successfully settled and developed a new world. That must not be permitted to continue.\" \"I agree. But what is your reason for wanting expansion, Baley?\" \"I feel that without expansion of some sort, humanity cannot advance. It doesn\u0027t have to be geographical expansion, but that is the clearest way of inducing other kinds of expansion as well. If geographical expansion can be undertaken in a fashion that is not at the expense of other intelligent beings; if there are empty spaces into which to expand; then why not? To resist expansion under such circumstances is to ensure decay.\" \"You see those alternatives, then? Expansion and advancement? Nonexpansion and decay?\" \"Yes, I believe so. Therefore, if Earth refuses expansion, then Spacers must accept it. Humanity, whether in the form of Earthpeople or Spacers, must expand. I would like to see Earthpeople undertake the task, but, failing that, Spacer expansion is better than no expansion at all. One alternative or the other.\" \"And if one expands but not the other?\" \"Then the expanding society will become steadily stronger and the nonexpanding one steadily weaker.\" \"Are you certain of that?\" \"It would be unavoidable, I think.\" Fastolfe nodded. \"Actually, I agree. It is why I am trying to persuade both Earthpeople and Spacers to expand and advance. That is a third alternative, and, I think, the best.\" 12 Memory flickered past the days that followed - incredible mobs of people moving ceaselessly past each other in streams and eddies-racing Expressways being mounted and dismounted - endless conferences with innumerable officials-minds in crowds. Particularly minds in crowds. Minds in crowds so thick that Giskard could not isolate individuals. Mass minds mixing and melting together into a vast pulsating grayness with all that was detectable being the periodic sparks of suspicion and dislike that shot outward every time one of the multitude paused to look at him. Only when Fastolfe was in conference with a few officials could Giskard deal with the individual mind and that, of course, was when it counted. Memory slowed at one point near the end of the stay on Earth, when Giskard could finally maneuver a time alone with Baley again. Giskard adjusted a few minds minimally in order to make certain there would be no interruption for some time. Baley said apologetically, \"I haven\u0027t really been ignoring you, Giskard. I simply haven\u0027t had the opportunity to be alone with you. I don\u0027t rate highly on Earth and I cannot order my comings and goings.\" \"I have, of course, understood that, sir, but we will have some time together now.\" \"Good. Dr. Fastolfe tells me that Gladia is doing well. He may be saying that out of kindness, knowing that that is what I want to hear. I order you to be truthful, however, is Gladia, in fact, doing well?\" \"Dr. Fastolfe has told you the truth, sir.\" \"And you remember, I hope, my request when I last saw you on Aurora that you guard Gladia and protect her from harm.\" \"Friend Daneel and I, sir, are both mindful of your request. I have arranged it so that when Dr. Fastolfe is no longer alive, both friend Daneel and I will become part of Madam Gladia\u0027s establishment. We will then be in an even better position to keep her from harm.\" \"That,\" said Baley sadly, \"will be after my time.\" \"I understand that, sir, and regret it.\" \"Yes, but it can\u0027t be helped and a crisis will come - or may come - even before that and yet still be after my time.\" \"What is it, sir, that you have in mind? What is this crisis?\" \"Giskard, it is a crisis that may arise because Dr. Fastolfe is a surprisingly persuasive person. Or else, there is some other factor associated with him that is accomplishing the task.\" \"Sir?\" \"Every official that Dr. Fastolfe has seen and interviewed now seems to be enthusiastically in favor of emigration. They were not in favor earlier or, if they were, it was with strong reservations. And once the opinion making leaders are in favor, others are sure to follow. This will spread like an epidemic.\" \"Is this not what you wish, sir?\" \"Yes, it is, but it is almost too much what I wish. We shall spread out over the Galaxy - but what if the Spacers don\u0027t?\" \"Why should they not?\" \"I don\u0027t know. I advance it as a supposition, a possibility. What if they don\u0027t?\" \"Earth and the worlds its people settle will then grow stronger, according to what I have heard you say.\" \"And the Spacers will grow weaker. There will, however, be a period of time during which the Spacers will remain stronger than Earth and its Settlers, though by a steadily diminishing margin. Eventually, the Spacers will inevitably become aware of Earthpeople as a growing danger. At that time the Spacer worlds will surely decide that Earth and the Settlers must be stopped before it is too late and it will seem to them that drastic measures will have to be taken. That will be a period of crisis that will determine the entire future history of human beings.\" \"I see your point, sir.\" Baley remained in thoughtful silence for a moment, then said, in very nearly a whisper as though dreading being overheard, \"Who knows of your abilities?\" \"Among human beings only yourself - and you cannot mention it to others.\" \"I know well I can\u0027t. The point is, though, that it is you, not Fastolfe, who has engineered the turnaround that has made every official with whom you\u0027ve come in contact a proponent of emigration. And it is to bring that about that you arranged to have Fastolfe take you, rather than Daneel, to Earth with him - you were essential and Daneel might have been a distraction.\" Giskard said, \"I felt it necessary to keep personnel to a minimum in order to avoid making my task harder by abrading the sensitivities of Earthpeople. I regret, sir, Daneel\u0027s absence. I fully sense your disappointment at not being able to greet him.\" \"Well - \" Baley shook his head. \"I understand the necessity and I rely on your explaining to Daneel that I badly missed him. In any case, I am still making my point. If Earth embarks on a great policy of world settlement and if the Spacers are left behind in the race to expand, the responsibility for that - and therefore for the crisis that will inevitably arise - will be yours. You must, for that reason, feel it your further responsibility to use your abilities to protect Earth when the crisis comes.\" \"I will do what I can, sir.\" \"And should you succeed there, Amadiro - or his followers - may turn on Gladia. You must not forget to protect her, too. \"Daneel and I will not forget.\" \"Thank you, Giskard.\" And they parted. When Giskard, following Fastolfe, entered the module to begin the voyage back to Aurora, he saw Baley once again. This time there was no opportunity to speak to him. Baley waved and mouthed one soundless word: \"Remember.\" Giskard sensed the word and, in addition, the emotion behind it. After that, Giskard never saw Baley again. Never. 13 Giskard had never found it possible to flip through the sharp images of that one visit to Earth, without then following it with the images of the key visit to Amadiro at the Institute of Robotics. It had not been an easy conference to arrange. Amadiro, with the bitterness of defeat heavy upon him, would not exacerbate his humiliation by going to Fastolfe\u0027s establishment. \"Well, then,\" Fastolfe had said to Giskard. \"I can afford to be magnanimous in victory. I will go to him. Besides, I must see him.\" Fastolfe had been a member of the Institute of Robotics since Baley had made possible the crushing of Amadiro and of his political ambitions. In return, Fastolfe had passed over to the Institute all the data for the building and maintenance of humaniform robots. A number had been manufactured and then the project had come to an end and Fastolfe had chafed. It had been Fastolfe\u0027s intention, at first, to arrive at the Institute without any robot companion. He would have placed himself, without protection and (so to speak) naked, into the midst of what was still the stronghold of the enemy\u0027s camp. It would have been a sign of humility and trust, but it would also have been an indication of complete selfconfidence and Amadiro would have understood that. Fastolfe, entirely alone, would be demonstrating his certainty that Amadiro, with all the resources of the Institute at his command, would not dare to touch his single enemy coming carelessly and defenselessly within reach of his fist. And yet in the end, Fastolfe, not quite knowing how, chose to have Giskard accompany him. Amadiro seemed to have lost a little weight since last Fastolfe had seen him, but he was still a formidable specimen; tall and heavyset. He lacked the self-confident smile that had once been his hallmark and when he attempted it at Fastolfe\u0027s entrance, it seemed more like a snarl that faded into a look of somber dissatisfaction. \"Well, Kelden,\" said Fastolfe, making free with the other\u0027s familiar name, \"we don\u0027t see each other often, despite the fact that we have now been colleagues for four years.\" \"Let\u0027s not have any false bonhomie, Fastolfe,\" said Amadiro in a clearly annoyed and low-pitched growl, \"and address me as Amadiro. We are not colleagues except in name and I make no secret - and never have - of my belief that your foreign policy is suicidal for us.\" Three of Amadiro\u0027s robots, large and gleaming, were present and Fastolfe studied them with raised eyebrows, \"You are well protected, Amadiro, against one man of peace together with his single robot.\" \"They will not attack you, Fastolfe, as you well know. But why did you bring Giskard? Why not your masterpiece, Daneel?\" \"Would it be safe to bring Daneel within your reach, Amadiro?\" \"I take it you intend that as humor. I no longer need Daneel. We build our own humaniforms.\" \"On the basis of my design.\" \"With improvements.\" \"And yet you do not use the humaniforms. That is why I have come to see you. I know that my position in the Institute is a name-only thing and that even my presence is unwelcome, let alone my opinions and recommendations. However, I must, as an Institute member, protest your failure to use the humaniforms.\" \"How do you wish me to use them?\" \"The intention was to have the humaniforms open up new worlds into which Spacers could eventually emigrate, after those worlds had been terraformed and made completely habitable, wasn\u0027t it?\" \"But that was something you opposed, Fastolfe, wasn\u0027t it?\" Fastolfe said, \"Yes, I did. I wanted Spacers themselves to emigrate to new worlds and to do their own terraforming. That, however, is not happening and, I now see, is not likely to happen. Let us send the humaniforms, then. That would be better than nothing.\" \"All our alternatives come to nothing, as long as your views dominate the Council, Fastolfe. Spacers will not travel to rude and unformed worlds; nor, it seems, do they like humaniform robots.\" \"You have scarcely given the Spacers a chance to like them. Earthpeople are beginning to settle new planets, even rude and unformed ones. And they do it without robotic help.\" \"You know very well the differences between Earthpeople and ourselves. There are eight billion Earthpeople, plus a large number of Settlers.\" \"And there are five and a half billion Spacers.\" \"Numbers are not the sole difference,\" said Amadiro bitterly. \"They breed like insects.\" \"They do not. Earth\u0027s population has been fairly stable for centuries.\" \"The potential is there. If they put all their heart into emigration, they can easily produce one hundred and sixty million new bodies each year and that number will rise as the new worlds fill up. \"We have the biological capability of producing one hundred million new bodies each year.\" \"But not the sociological capability. We are long-lived, we do not wish ourselves replaced so quickly.\" \"We can send a large portion of the new bodies to other worlds.\" \"They won\u0027t go. We value our bodies, which are strong, healthy, and capable of surviving in strength and health for nearly forty decades. Earthmen can place no value on bodies that wear out in less than ten decades and that are riddled with disease and degeneration even over that short period of time. It doesn\u0027t matter to them if they send out millions a year to certain misery and probable death. In fact, even the victims needn\u0027t fear misery and death, for what else do they have on Earth? The Earthpeople who emigrate are fleeing from their pestilential world knowing well that any change can scarcely be for the worse. We, on the other hand, value our well-wrought and comfortable planets and would not lightly give them up.\" Fastolfe sighed and said, \"I\u0027ve heard all these arguments so often - May I point out the simple fact, Amadiro, that Aurora was originally a rude and unformed world that had to be terraformed into acceptability and that so was every Spacer world?\" Amadiro said, \"And I have heard all your arguments to the point of nausea, but I will not weary of answering them. Aurora may have been primitive when first settled, but Aurora was settled by Earthpeople - and other Spacer worlds, when, not settled by Earthpeople, were settled by Spacers that had not yet outgrown their Earth heritage. The times are no longer suitable for that. What could be done then, cannot be done now.\" Amadiro lifted a corner of his mouth in a snarl and went on, \"No, Fastolfe, what your policy has accomplished has been to begin the creation of a Galaxy that will be populated by Earthmen only, while Spacers must wither and decline. You can see it happening now. Your famous trip to Earth, two years ago, was the turning point. Somehow, you betrayed your own people by encouraging those half-humans to begin an expansion. In only two years there are at least some Earthpeople on each of twenty-four worlds and new ones are being added steadily.\" Fastolfe said, \"Do not exaggerate. Not one of those Settler worlds is truly fit for human occupation yet and won\u0027t be for some decades. Not all are likely to survive and, as the nearer worlds are occupied, the chances for settling farther worlds diminish so that the initial surge will slow down. I encouraged their expansion because I counted on ours as well. We can still keep up with them if we make the effort and, in healthy competition, we can fill the Galaxy together.\" \"No,\" said Amadiro. \"What you have in mind is that most destructive of all policies, a foolish idealism. The expansion is one-sided and will remain so despite anything you can do. The people of Earth swarm unhindered and they will have to be stopped before they get too strong to stop.\" \"How do you propose to do that? We have a treaty of friendship with Earth in which we specifically agree not to stop their expansion into space as long as no planet within twenty light-years of a Spacer world is touched. They have adhered to this scrupulously.\" Amadiro said, \"Everyone knows about the treaty. Everyone also knows that no treaty has ever been kept once it begins to work against the national interests of the more powerful signatory. I attach no value to that treaty.\" \"I do. It will be held to.\" Amadiro shook his head. \"You have touching faith. How will it be held to after you are out of power?\" \"I don\u0027t intend to be out of power for a while.\" \"As Earth and its Settlers grow stronger, the Spacers will grow fearful and, you will not remain long in power after that.\" Fastolfe said, \"And if you tear up the treaty and destroy the Settler worlds and slam the gates shut on Earth, will the Spacers then emigrate and fill the Galaxy?\" \"Perhaps not. But if we decide not to, if we decide we are comfortable as we are, what difference will that make?\" \"The Galaxy will not, in that case, become a human empire.\" \"And if it does not, what then?\" \"Then the Spacers will stultify and degenerate, even if Earth is kept in prison and also stultifies and degenerates.\" \"That is just the claptrap your party puts out, Fastolfe. There is no actual evidence that such a thing would happen. And even if it does, that will be our choice. At least we will not see the barbarian short-lifers fall heir to the Galaxy.\" Fastolfe said, \"Are you seriously suggesting, Amadiro, that you would be willing to see the Spacer civilization die, provided you can prevent Earth from expanding?\" \"I\u0027m not counting on our death, Fastolfe, but if the worst happens, why, yes, to me our own death is a less fearful thing than the triumph of a subhuman disease-riddled set of short-lived beings.\" \"From whom we are descended.\" \"And with whom we are no longer truly related genetically. Are we worms because a billion years ago, worms were among our ancestors?\" Fastolfe, lips pressed together, rose to go. Amadiro, glowering, made no move to stop him. 14 Daneel had no way of telling, directly, that Giskard was lost in memory. For one thing, Giskard\u0027s expression did not change and for another, he was not lost in memory as humans might be. It took no substantial period of time. On the other hand, the line of thought that had caused Giskard to think of the past had caused Daneel to think of the same events, of that past as they had long ago been recounted to him by Giskard. Nor was Giskard surprised at that. Their conversation carried on with no unusual pause, but in a markedly new manner, as though each had thought of the past on behalf of both. Daneel said, \"It might seem, friend Giskard, that since the people of Aurora now recognize that they are weaker than Earth and its many Settler worlds, the crisis that Elijah Baley foresaw has been safely passed.\" \"It might seem so, friend Daneel.\" \"You labored to bring that about.\" \"I did. I kept the Council in Fastolfe\u0027s hand. I did what I could to mold those who, in turn, molded public opinion. \"Yet I am uneasy,\" Giskard said, \"I have been uneasy through every stage of the process, although I endeavored to do no harm to anyone. I have touched - mentally - not one human being who required anything more than the lightest touch. On Earth, I had merely to lighten the fear of reprisal and chose those, particularly, in which the fear was already light and broke a thread that was, in any case, frayed and on the point of breaking. On Aurora, it was reversed. The policy makers here were reluctant to espouse policies that would lead to an exit from their comfortable world and I merely confirmed that and made the sturdy cord that held them a bit stronger. And doing this has immersed me in a constant - if faint turmoil.\" \"Why? You encouraged the expansion of Earth and discouraged the expansion of the Spacers. Surely that is as it should be.\" \"As it should be? Do you think, friend Daneel, that an Earthperson counts for more than a Spacer, even though both are human beings?\" \"There are differences. Elijah Baley would rather see his own Earthpeople defeated than see the Galaxy uninhabited. Dr. Amadiro would rather see both Earth and Spacers dwindle than see Earth expand. The first looks with hope to the triumph of either, the second is content to see the triumph of neither. Should we not choose the first, friend Giskard?\" \"Yes, friend Daneel. So it would seem. And yet how far are you influenced by your feeling of the special worth of your onetime partner, Elijah Baley?\" Daneel said, \"I value the memory of Partner Elijah and the people of Earth are his people.\" \"I see you do. I have been saying for many decades that you tend to think like a human being, friend Daneel, but I wonder if that is necessarily a compliment. Still, though you tend to think like a human being, you are not a human being and, in the end, you are bound to the Three Laws. You may not harm a human being, whether that human being is an Earthman or a Spacer.\" \"There are times, friend Giskard, when one must choose one human being over another. We have been given special orders to protect Lady Gladia. I would be forced, on occasion, to harm a human being in order to protect Lady Gladia and I think that, all things being equal, I would be willing to harm a Spacer just a little in order to protect an Earthperson.\" \"So you think. But in the actual event, you would have to be guided by specific circumstances. You will find you cannot generalize,\" said Giskard. \"And so it is with me. In encouraging Earth and discouraging Aurora, I have made it impossible for Dr. Fastolfe to persuade the Auroran government to sponsor a policy of emigration and to set up two expanding powers in the Galaxy. I could not help but realize that that portion of his labors was brought to nothing. This was bound to fill him with gathering despair and perhaps it hastened his death. I have felt this in his mind and that has been painful. And yet, friend Daneel - \" Giskard paused and Daneel said, \"Yes?\" \"To have not done as I had done might have greatly lowered Earth\u0027s ability to expand, without greatly improving Aurora\u0027s moves in that direction. Dr. Fastolfe would then have been frustrated - in both ways - Earth and Aurora and would moreover have been ousted from his seat of power by Dr. Amadiro. His sense of frustration would have been greater. It was Dr. Fastolfe, during his lifetime, to whom I owed my greatest loyalty and I chose that course of action which frustrated him less, without measurably harming other individuals I dealt with. If Dr. Fastolfe was continually disturbed by his inability to persuade Aurorans - and Spacers generally - to expand to new worlds, he was at least delighted by the activity of the emigrating Earthpeople.\" \"Could you not have encouraged both the people of Earth and of Aurora, friend Giskard, and thus have satisfied Dr. Fastolfe in both respects?\" \"That, of course, had occurred to me, friend Daneel. I considered the possibility and decided it would not do. I could encourage Earthpeople to emigrate by means of a trifling change that would do no harm. To have attempted the same for Aurorans would have required a great enough change to do much harm. The First Law prevented that.\" \"A pity.\" \"True. Think what might have been done if I could have radically altered the mind-set of Dr. Amadiro. Yet how could I have changed his fixed determination to oppose Dr. Fastolfe? It would have been much like trying to force his head to make a one hundred and eighty degree turn. So complete a turnabout of either the head itself or of its emotional content would kill with, I think, equal efficiency. \"The price of my power, friend Daneel,\" Giskard went on, \"is the greatly increased dilemma into which I am constantly plunged. The First Law of Robotics, which forbids injury to human beings, deals, ordinarily, with the visible physical injuries that we can, all of us, easily see and concerning which we can easily make judgments. I, alone, however, am aware of human emotions and of casts of mind, so that I know of more subtle forms of injury without being able to understand them completely. I am forced on many occasions to act without true certainty and this puts a continuing stress on my circuits. \"And yet I feel I have done well. I have carried the Spacers past the crisis point. Aurora is aware of the gathering strength of the Settlers and will now be forced to avoid conflict. They must recognize it to be too late for retaliation and our promise to Elijah Baley is, in that respect, fulfilled. We have put Earth on the course toward the filling of the Galaxy and the establishment of a Galactic Empire.\" They were, at this point, walking back to Gladia\u0027s house, but now, Daneel stopped and the gentle pressure of his hand on Giskard\u0027s shoulder caused the other to stop as well. Daneel said, \"The picture you draw is attractive. It would make Partner Elijah proud of us if, as you say, we have accomplished that. \u0027Robots and Empire,\u0027 Elijah would say and perhaps he would clap me on the shoulder. And yet, as I said, I am uneasy, friend Giskard.\" \"Concerning what, friend Daneel?\" \"I cannot help but wonder if indeed we have actually passed the crisis that Partner Elijah spoke of so many decades ago. Is it, in actual fact, too late for Spacer retaliation?\" \"Why do you have these doubts, friend Daneel?\" \"I have been made doubtful by the behavior of Dr. Mandamus in the course of his conversation with Madam Gladia.\" Giskard\u0027s gaze was fixed on Daneel for a few moments, and in the quiet they could hear leaves rustling in the cool breeze. The clouds were breaking and the sun would make its appearance soon. Their conversation, in its telegraphic fashion, had taken little time and Gladia, they knew, would not yet be wondering at their absence. Giskard said, \"What was there in the conversation that would give you cause for uneasiness?\" Daneel said, \"I have had the opportunity, on four separate occasions, to observe Elijah Baley\u0027s handling of a puzzling problem. On each of those four occasions, I have noted the manner in which he managed to work out useful conclusions from limited - and even misleading - information. I have since always tried, within my limitations, to think as he did.\" \"It seems to me, friend Daneel, you have done well in this respect. I have said you tend to think like a human being. \"You will have noticed, then, that Dr. Mandamus had two matters he wished to discuss with Madam Gladia. He emphasized that fact himself. One was the matter of his own descent, whether from Elijah Baley or not. The second was the request that Madam Gladia see a Settler and report on the event afterward. Of these, the second might be viewed as a matter that would be important to the Council. The first would be a matter of importance only to himself.\" Giskard said, \"Dr. Mandamus presented the matter of his descent as being of importance to Dr. Amadiro as well.\" \"Then it would be a matter of personal importance to two people rather than one, friend Giskard. It would still not be a matter of importance to the Council and, therefore, to the planet generally.\" \"Proceed, then, friend Daneel.\" \"Yet the matter of state, as Dr. Mandamus himself referred to it, was taken up second, almost as an afterthought, and was disposed of almost at once. Indeed, it seemed scarcely something that required a personal visit. It might have been handled by holographic image by any official of the Council. On the other hand, Dr. Mandamus dealt with the matter of his own descent first, discussed it in great detail, and it was a matter that could have been handled only by him and by no one else.\" \"What is your conclusion, friend Daneel?\" \"I believe that the matter of the Settler was seized upon by Dr. Mandamus as an excuse for a personal conversation with Madam Gladia, in order that he might discuss his descent in privacy. It was the matter of his descent and nothing else that truly interested him. - Is there any way you can support that conclusion, friend Giskard?\" Aurora\u0027s sun had not yet emerged from the clouds and the faint glow of Giskard\u0027s eyes was visible. He said, \"The tension in Dr. Mandamus\u0027s mind was indeed measurably stronger in the first part of the interview than in the second. That may serve as corroboration, perhaps, friend Daneel.\" Daneel said, \"Then we must ask ourselves why the question of Dr. Mandamus\u0027s descent should be a matter of such importance to him.\" Giskard said, \"Dr. Mandamus explained that. It is only by demonstrating that he is not descended from Elijah Baley, that his road to advancement is open. Dr. Amadiro, upon whose goodwill he is dependent, would turn against him absolutely if he were a descendant of Mr. Baley.\" \"So he said, friend Giskard, but what took place during the interview argues against that.\" \"Why do you say so? Please continue thinking like a human being, friend Daneel. I find it instructive.\" Daneel said gravely, \"Thank you, friend Giskard. Did you note that not one statement that Madam Gladia made concerning the impossibility of Dr. Mandamus\u0027s descent from Partner Elijah was considered convincing? In every case, Dr. Mandamus said that Dr. Amadiro would not accept the statement.\" \"Yes, and what do you deduce from that?\" \"It seems to me that Dr. Mandamus was so convinced that Dr. Amadiro would accept no argument against Elijah Baley an ancestor that one must wonder why he should have bothered to ask Madam Gladia about the matter. He apparently knew from the start that it would be pointless to do so.\" \"Perhaps, friend Daneel, but it is mere speculation. Can you supply a possible motive for his action, then?\" \"I can. I believe he inquired as to his descent, not to convince an implacable Dr. Amadiro but to convince himself.\" \"In that case, why should he have mentioned Dr. Amadiro at all? Why not simply have said, \u0027I wish to know.\u0027?\" A small smile passed over Daneel\u0027s face, a change of expression of which the other robot would have been incapable. Daneel said, \"Had he said, \u0027I wish to know,\u0027 to Madam Gladia, she would surely have replied that it was none of his business and he would have discovered nothing. Madam Gladia, however, is as strongly opposed to Dr. Amadiro as Dr. Amadiro is to Elijah Baley. Madam Gladia would be sure to take offense at any opinion strongly held by Dr. Amadiro concerning her. She would be furious, even if the opinion were more or less true; how much more, then, if it were absolutely false, as in this case. She would labor to demonstrate Dr. Amadiro to be wrong and would present every piece of evidence needed to achieve that end. \"In such a case, Dr. Mandamus\u0027s cold assurance that each piece of evidence was insufficient would but make her the angrier and would drive her to further revelations. Dr. Mandamus\u0027s strategy was chosen to make certain he would learn the maximum from Madam Gladia and, at the end, he was convinced that he did not have an Earthman as ancestor; at least, not as recently as twenty decades ago. Amadiro\u0027s feelings in this regard were not, I think, truly in question.\" Giskard said, \"Friend Daneel, this is an interesting point of view, but it does not seem to be strongly founded. In what way can we conclude that it is no more than a guess on your part?\" Daneel said, \"Does it not seem to you, friend Giskard, that when Dr. Mandamus ended his inquiry into his descent without having obtained sufficient evidence for Dr. Amadiro, as he would have had us believe, that he should have been distinctly depressed and disheartened? By his own statement, this should have meant he had no chance for advancement and would never gain the position as head of the Institute of Robotics. And yet it seemed to me that he was far from depressed but was, indeed, jubilant. I can only judge by outward appearance, but you can do better. Tell me, friend Giskard, what was his mental attitude at the conclusion of this portion of his conversation with Madam Gladia?\" Giskard said, \"As I look back on it, it was not only jubilant but triumphant, friend Daneel. You are right. Now that you have explained your process of thought, that sensation of triumph I detected clearly marks the accuracy of your reasoning. In fact, now that you have marked it all out, I find myself at a loss to account for my inability to see it for myself.\" \"That, friend Giskard, was, on a number of occasions, my reaction to the reasoning of Elijah Baley. That I could carry through such reasoning on this occasion may be, in part, because of the strong stimulus of the existence of the present crisis. It forces me to think more cogently.\" \"You underestimate yourself, friend Daneel. You have been thinking cogently for a long time. But why do you speak of a present crisis? Pause a moment and explain. How does one go from Dr. Mandamus\u0027s feeling of triumph at not being descended from Mr. Baley to this crisis you speak of?\" Daneel said, \"Dr. Mandamus may have deceived us with his statements concerning Dr. Amadiro, but it may be fair to suppose that it is nevertheless true that he longs for advancement; that he is ambitious to become head of the Institute. Is that not so, friend Giskard?\" Giskard paused a moment, as though in thought, then said, \"I was not searching for ambition. I was studying his mind without particular purpose and was aware of only surface manifestations. Yet there might have been flashes of ambition there when he spoke of advancement. I do not have strong grounds for agreeing with you, friend Daneel, but I have no grounds at all for disagreeing with you.\" \"Let us accept Dr. Mandamus as an ambitious man, then, and see where that takes us. Agreed?\" \"Agreed.\" \"Then does it not seem likely that his sense of triumph, once he was convinced that he was not descended from Partner Elijah, arose from the fact that he felt his ambition could now be served. This would not be so, however, because of Dr. Amadiro\u0027s approval, since we have agreed that the Dr. Amadiro motif was introduced by Dr. Mandamus as a distraction. His ambition could now be served for some other reason.\" \"What other reason?\" \"There is none that arises out of compelling evidence. But I can suggest one as a matter of speculation. What if Dr. Mandamus knows something or can do something that would lead to some huge success; one that would surely make him the next head? Remember that at the conclusion of the search into the manner of his descent, Dr. Mandamus said, \u0027There are powerful methods remaining to me.\u0027 Suppose that is true, but that he could only use those methods if he were not descended from Partner Elijah. His jubilation over having been convinced of his nondescent would arise, then, from the fact that he could now use those methods and assure himself of great advancement.\" \"But what are these powerful methods, friend Daneel?\" Daneel said gravely, \"We must continue to speculate. We know that Dr. Amadiro wants nothing so much as to defeat Earth and force it back to its earlier position of subservience to the Spacer worlds. If Dr. Mandamus has a way of doing this, he can surely get anything he wants out of Dr. Amadiro, up to and including a guarantee of succession to the headship. Yet it may be that Dr. Mandamus hesitates to bring about Earth\u0027s defeat and humiliation unless he felt no kinship to its people. Descent from Elijah Baley of Earth would inhibit him. The denial of that descent frees him to act and that makes him jubilant.\" Giskard said, \"You mean Dr. Mandamus is a man of conscience?\" \"Conscience?\" \"It is a word human beings sometimes use. I have gathered that it is applied to a person who adheres to rules of behavior that force him to act in ways that oppose his immediate self-interest. If Dr. Mandamus feels that he cannot allow himself to advance at the expense of those with whom he is distantly connected, I imagine him to be a man of conscience. I have thought much of such things, friend Daneel, since they seem to imply that human beings do have Laws governing their behavior, at least in some cases.\" \"And can you tell whether Dr. Mandamus is, indeed, a man of conscience?\" \"From my observations of his emotions? No, I was not watching for anything like that, but if your analysis is correct, conscience would seem to follow. - And yet, on the other hand, if we begin by supposing him a man of conscience and argue backward, we can come to other conclusions. It might seem that if Dr. Mandamus thought he had an Earthman in his ancestry a mere nineteen and a half decades ago, he might feel driven, against his conscience, to spearhead an attempt to defeat Earth as a way of freeing himself from the stigma of such descent. If he were not so descended, then he would not be unbearably driven to act against Earth and his conscience would be free to cause him to leave Earth alone.\" Daneel said, \"No, friend Giskard. That would not fit the facts. However relieved he might be at not having to take violent action against Earth, he would be left without a way of satisfying Dr. Amadiro and enforcing his own advance. Considering his ambitious nature, he would not be left with the feeling of triumph you so clearly noted.\" \"I see. Then we conclude that Dr. Mandamus has a method for defeating Earth.\" \"Yes. And if that is so, then the crisis foreseen by Partner Elijah has not been safely passed after all, but is now here.\" Giskard said thoughtfully, \"But we are left with the key question unanswered, friend Daneel. What is the nature of the crisis? What is the deadly danger? Can you deduce that, too?\" \"That I cannot do, friend Giskard. I have gone as far as I can. Perhaps Partner Elijah might have gone farther were he still alive, but I cannot. - Here I must depend upon you, friend Giskard.\" \"Upon me? In what way?\" \"You can study the mind of Dr. Mandamus as I cannot, as no one else can. You can discover the nature of the crisis.\" \"I fear I cannot, friend Daneel. If I lived with a human being over an extended period, as once I lived with Dr. Fastolfe, as now I live with Madam Gladia, I could, little by little, unfold the layers of mind, one leaf after another, untie the intricate knot a bit at a time, and learn a great deal without harming him or her. To do the same to Dr. Mandamus after one brief meeting or after a hundred brief meetings, would accomplish little. Emotions are readily apparent, thoughts are not. If, out of a sense of urgency, I attempted to make haste, forcing the process, I would surely injure him - and that I cannot do.\" \"Yet the fate of billions of people on Earth and billions more in the rest of the Galaxy may depend on this.\" \"May depend on this. That is conjecture. Injury to a human being is a fact. Consider that it may be only Dr. Mandamus who knows the nature of the crisis and carry it through to a conclusion. He could not use his knowledge or ability to force Dr. Amadiro to grant him the headship if Dr. Amadiro could gain it from another source.\" \"True,\" said Daneel. \"That may be well so.\" \"In that case, friend Daneel, it is not necessary to know the nature of the crisis. If Dr. Mandamus could be restrained from telling Dr. Amadiro - or anyone else - whatever it is he knows, the crisis will not come to pass.\" \"Someone else might discover what Dr. Mandamus now knows.\" \"Certainly, but we don\u0027t know when that will be. Very likely, we will have time to probe further and discover more - and become better prepared to play a useful role of our own.\" \"Well, then.\" \"If Dr. Mandamus is to be restrained, it can be done by damaging his mind to the point where it is no longer effective - or by destroying his life outright. I alone possess the ability to injure his mind appropriately, but I cannot do this. However, either one of us can physically bring his life to an end. I cannot do this, either. Can you do it, friend Daneel?\" There was a pause and Daneel finally whispered. \"I cannot. You know that.\" Giskard said slowly, \"Even though you know that the future of billions of people on Earth and elsewhere is at stake?\" \"I cannot bring myself to injure Dr. Mandamus.\" \"And I cannot. So we are left with the certainty of a deadly crisis coming, but a crisis whose nature we do not know, and cannot find out, and which we are therefore helpless to counter.\" They stared at each other in silence, with nothing showing in their faces, but with an air of despair settling somehow over them.","sourceLink":"https://allnovel.net/robots-and-empire-robot-4/page-3.html","bookId":1727,"book":{"id":1727,"title":"Robots and Empire (Robot #4)","description":"Storyline: Robots and Empire (Robot #4) Isaac Asmiov\u0027s classic novel about the decline and fall of Solaria.","cover":"https://allnovel.net/images/robots-and-empire-robot-4.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/robots-and-empire-robot-4.html","creation":"Oct 5, 2019 8:57:54 AM","modification":"Oct 5, 2019 10:10:11 AM"}}
