{"id":74121,"no":10,"title":"Page 10","content":"Woods\\n\\n I stood at my office window and watched as Della’s red car drove away. I could lie to myself and say it was a coincidence that I came to look out the window the same time she was leaving. But I knew her schedule. I knew her shift was over and pathetically I came here to watch her get in her car and leave. I had gotten very little sleep worrying that she would leave without a word after last night.\\n\\n When I had walked into the clubhouse today and she’d come walking up to me calling me Mr. Kerrington and making sure she still had a job I was so damn relieved I hadn’t been able to properly apologize to her before she was walking off.\\n\\n Then I’d decided it was for the best. No need for us to keep pretending there could be more to this. She was cutting me out and I needed to let her do it. For both our sakes. It was the best way to keep me from caving and begging her for something I couldn’t have.\\n\\n The door opened behind me without a knock and I didn’t have to look to see who it was. Only one person would walk into my office without a knock first.\\n\\n “Hello, Dad,” I said without turning around to look at him. I’d idolized him from the time I was a kid. Now, a part of me hated him.\\n\\n “Woods. I came to make sure plans were still firmly in place for tonight. Howard and Samantha will be here tonight. They’re planning on this announcement. Letting Howard Greystone down isn’t something I intend to do.”\\n\\n He knew I didn’t want this but here he was still reasserting the importance of it.\\n\\n “Nothing’s changed.” Those two words went much deeper than I knew he took them. Nothing had changed. He was still controlling things. I still couldn’t stand the idea of being married to Angelina and he still didn’t give a shit.\\n\\n “Good. Your mother is already planning the wedding with Samantha. They’ve been planning this wedding since the two of you were young. This isn’t just securing our future and the success of what your grandfather built; it is also making your mother very happy. She loves Angelina. This will all work out for the best. You’ll see. Left up to your own devices you would have never gotten married.” The amusement in his voice was lost on me. There was nothing humorous about the fact that both my parents expected me to sacrifice my happiness for theirs.\\n\\n “At least someone is happy,” I said without emotion.\\n\\n “When you’re married and sitting in your new office looking out over the eighteenth hole with the title of Vice President on your door, you’ll be happy too. Right now you’re just sulking like a child who isn’t getting his way. I know what you need to be successful and Angelina Greystone is your answer.”\\n\\n I couldn’t look at him. The rage burning a hole in my gut would no doubt be flashing in my eyes. My father’s footsteps moved away from me and the door closed behind him. I wasn’t sure if I’d ever be able to forgive him for this. Or maybe it was me I would never be able to forgive. What man let another control his life? His future?\\n\\n Angelina had almost circled the entire ballroom showing off the ring I’d placed on her finger in front of everyone over an hour ago. She was gushing with excitement and the entire room was buying it. You would think we were madly in love. I wasn’t that good of an actor. I preferred to stand over by the bar and drink shots of whiskey.\\n\\n “She’s a looker. If you’re gonna get hitched at least you picked beauty and money. Surely that’s something. You look ready to murder anyone who gets close to you,” Jace said as he took up the spot beside me at the bar.\\n\\n Angelina was beautiful in a cold classical way. She was elegant and refined and manipulative.\\n\\n “Can’t be happy that I’ve become my dad’s fucking puppet,” I replied and heard the slur in my words. Maybe I’d had too much to drink.\\n\\n “There’s that,” he agreed and picked up my whiskey and finished it off before I could. “Probably need to cut yourself off.”\\n\\n “Probably, but then I’d have to endure this sober.”\\n\\n Jace let out a sigh. “I wasn’t going to bring this up but what happened last night with Della?”\\n\\n I picked up my empty glass and shook it at the bartender. “Nothing,” I lied.\\n\\n Jace smirked. “That’s not what Bethy said. Apparently your shirt was off and your pants were undone.”\\n\\n Hell. Figures Bethy had to tell him the details. “I met Della four months ago. We had a night- a really, really fantastic night. Then she walked back into my life and I lost my damn mind. That’s what happened.”\\n\\n Jace let out a low whistle. “Shit.”\\n\\n He had no idea. This was all shit- the marriage, my father, the job that should be mine without fucking strings. My life was shit. Then there was Della. Sweet, sexy fun Della and I couldn’t touch her. She was off limits to me now. “I don’t think I’m gonna ever forget the taste of her.” My drunken tongue was loose. It was a good thing Jace was the only one standing around to hear me.\\n\\n “The job with your dad is worth all this?” Jace asked. I knew he was thinking I was a weak sonuvabitch. I wasn’t strong enough to break free.\\n\\n “I’m not Tripp. I can’t just leave it all behind. Unlike him I want this life. I want that job. It’s mine, dammit.”\\n\\n Jace nodded and reached out to take the whiskey I’d just been served and was about to down. “I said I was cutting you off. Let’s get you out of here for a few minutes. The cool night air might sober you up enough to go speak to guests and actually act like you want this job you’re willing to let control your life.”\\n\\n I started to follow him. Getting out of here sounded great. “Where’s Bethy?” I asked, looking around for his other half.\\n\\n “She’s with Della in the kitchen working. She didn’t want to come to this tonight and asked if I minded if she worked instead.”\\n\\n Della was in the kitchen? I paused outside the ballroom and looked down the hall toward the door that led to the kitchen. Della was in there. I needed to apologize. Explain. Something.\\n\\n “I need to go find Della. She needs to understand,” I said, turning to head for the kitchen.\\n\\n Jace’s hand clamped down on my shoulder. “No man. That’s a real bad idea. You’re engaged and Della is your employee. Draw a line and stay behind it.”\\n\\n “I already drew the damn line when I put that ring on Angelina’s finger. I just want to explain it to her. She doesn’t understand.” I’d fucked her then I’d told her I was getting engaged and she’d run off. I couldn’t keep picturing the look on her face. It was killing me.\\n\\n “Do you think it’s gonna do any good? What will it accomplish? Leave the girl alone.”\\n\\n He didn’t understand. I shook my head and walked to the kitchen.\\n\\n “I think Tripp likes her. I think she’ll be the reason he comes home. He might not have thought it through when he sent her here but he had other reasons. He’s never let anyone live in his condo before. She’s different.”\\n\\n I stopped. My chest ached and my stomach felt as if it were being twisted. Tripp liked Della? He was free to travel the world with her. He didn’t have responsibilities or goals in life. He just wanted to be. Just like Della.\\n\\n I leaned against the wall and stared at the kitchen doors. What good would explaining this bullshit do? Nothing. It was still the same. I wasn’t the man she was looking for. We wanted two different things out of life and amazing sex didn’t last forever.\\n\\n The doors to the kitchen swung open and my event coordinator, Macy Kemp, came walking out with her hand firmly clasped around Della’s wrist pulling her as she stalked toward me. I opened my mouth to tell her to let Della go but Macy was already talking.\\n\\n “The lead singer is allergic to shellfish. No one told me this, Woods. No one. I would have warned him off the dips and salads if I’d known.” She shook her head and cursed. “He’s just left in an ambulance but the idiot will be fine. I’ve fixed it; so we should be good.” She began walking again and dragged Della behind her. The panicked look on Della’s face snapped me out of my confused tipsy state. I didn’t like seeing Della upset and why the hell was Macy pulling on her like that?\\n\\n “What are you doing with Della?” I demanded.\\n\\n Macy looked at Della and then smiled at me. “We needed a new lead singer. Band can’t play without one. I was in complete disaster mode when I walked in on this one singing in the bathroom while she was washing her hands. The girl can blow.”\\n\\n Not a good choice of words. My slacks suddenly became tighter and Della’s face flushed. I couldn’t look away from her. “You’re singing?” I asked.\\n\\n She shrugged.\\n\\n “Yes, she’s singing. What part of I heard her singing and I need a lead singer didn’t you understand? First, I’ve got to get her changed into something more appropriate. No time. Let your father know the band will start up in ten minutes.” Macy continued on her way and Della followed quickly behind her.\\n\\n “She’s singing at what is basically your engagement party,” Jace said from behind me. I’d forgotten he was standing there.\\n\\n “It’s not my engagement party,” I growled.\\n\\n “You just got engaged and the whole room is talking about your upcoming wedding. So it’s pretty damn close.”\\n\\n “Shut up, Jace.” \\n\\n","sourceLink":"https://allnovel.net/twisted-perfection-perfection-1/page-10.html","bookId":1991,"book":{"id":1991,"title":"Twisted Perfection (Perfection #1)","description":"Storyline: Twisted Perfection (Perfection #1) \\n Life outside of her house was a new experience for Della Sloane. The dark secrets of her past weren’t something she ever intended to share with anyone. They would never understand. No one would ever get close enough to find out. There was always a chance she’d go crazy sooner than they expected… \\n Woods Kerrington had never been one to be attracted to fragile females. They seemed like too much work. He wasn’t in it for the work just the pleasure. A night full of naughty fun had been exactly what was on his mind when he’d laid eyes on the hot little number that didn’t know how to pump gas and needed some help. \\n What he didn’t know was she was as fragile as they came. \\n The carefree girl who spoke her mind and didn’t care what the world thought of her was more breakable than he could ever imagine…\\n","cover":"https://allnovel.net/images/twisted-perfection-perfection-1.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/twisted-perfection-perfection-1.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 10:29:44 AM"}}
