{"id":66046,"no":25,"title":"Page 25","content":"“Lots! We went to Paris. We were supposed to go last Christmas, but then there was a problem with our airline, remember?\n It was on the TV news and everything, so we had to wait until this summer, but that was even better. I have a new wish now.”\n Anne Marie couldn’t remember her daughter ever being this open with someone who was virtually a stranger.\n “What’s your new wish?” Tim asked her.\n “To learn French. I say a new word every day. Baxter knows that Viens ici means come here. ” The dog raised his head and she laughed. “See? The chien understands.”\n “Good for you. Both of you.”\n “I’ve signed her up with a French tutor,” Anne Marie said. She’d found one through Teresa, who seemed acquainted with just about every teacher in the school district. “I’m going to be taking lessons, too.”\n Tim’s eyes softened as he glanced at Anne Marie. “You’re a terrif ic mother,” he said in a low voice.\n “I try.”\n “Do you have a list of wishes?” Ellen demanded.\n “Not yet, but I already know what I’m going to wish for.”\n Anne Marie looked at him suspiciously as Ellen chattered blithely on. “Barbie and Lillie and Elise have wish lists, too,” she was saying.\n “Friends of yours?” Tim asked, turning to Anne Marie. She nodded.\n “Barbie met Mark,” Ellen continued. “He’s in a wheelchair and they’re in love. And Lillie met Hector.”\n “Does she love him, too?”\n “Yes!” Ellen said loudly. “They hold hands in public. ”\n Tim tried to restrain a smile. “Tell me more about your wishes.”\n “Okay.” Ellen’s expression was solemn. “I signed up for karate classes. That was one of my wishes.”\n “How’d it go?”\n Ellen wrinkled her nose. “Too many boys. They can be mean, you know.”\n Tim nodded gravely. “I heard that.”\n “Do you have kids?” she asked.\n His eyes darted to Anne Marie. “Not yet, but I’d really like to be a daddy one day.”\n “A man needs children,” Ellen said with all the wisdom of her nine years.\n “Oh? Why’s that?”\n “Children are important. ”\n Once again Tim glanced at Anne Marie. “I couldn’t agree with you more.”\n “Oh, there’s something else on my list. I nearly forgot. Only…only this wish hasn’t come true yet.”\n “And what would that be?”\n “I want to meet my dad.”\n Anne Marie placed a protective hand on Ellen’s shoulder.\n “Your dad?” he repeated slowly.\n Ellen bent down to scoop up the dog and held him close.\n “Everybody has one, you know.”\n “I know,” Tim said quietly. “Did anyone ever tell you anything about him?”\n Ellen shook her head sadly. “I don’t even have his picture.”\n That was a blessing as far as Anne Marie was concerned.\n “I’m sure he wonders about you, too,” Tim said. “I bet if he knew he had such a lovely little girl, he’d be very happy.”\n “Do you really think so?”\n “I’m positive.”\n Before this could go any further, Anne Marie said, “Ellen, why don’t you play on the swing set while Tim and I visit?”\n “Okay. Can Baxter come with me?”\n “He should probably stay here for now. You can take him on the merry-go-round later, okay?”\n “Okay,” she agreed readily enough, then dashed off to play with the other children.\n “Enough about the father business,” Anne Marie said with barely restrained anger.\n Tim raised both hands in a gesture of surrender. “I didn’t bring it up. She did.”\n “You led her on.”\n “I don’t want to argue, Anne Marie. It’s clear to me that Ellen is curious about her father. That’s the reason you called me in the middle of the night, isn’t it? Ellen asked you questions you couldn’t answer.”\n Anne Marie ignored him.\n “She’s a delightful child,” Tim said, his gaze resting fondly on Ellen.\n No one needed to tell Anne Marie that. Reluctantly she handed over the baggie of hair she’d collected from Ellen’s brush. That was all he required, Tim had said, to establish paternity. He slipped it inside his pocket. “You’ve done a wonderful job with her.”\n “Her grandmother deserves most of the credit. Ellen’s only been with me for a year or so.”\n “Nevertheless, she seems happy and well-adjusted.”\n If he thought he could f latter his way into their lives, he was mistaken. “Thank you,” she said coolly.\n “I appreciate that you allowed me to meet Ellen.” He hesitated. “With your permission I’d like to meet again.”\n She held herself rigid. “When?”\n “Whenever it’s agreeable with you.”\n She looked at him narrowly. “Don’t be so accommodating. It confuses me.”\n He grinned and his smile emphasized the laugh lines around his mouth and beside his eyes. Under any other circumstances she would’ve found him charming and attractive. She couldn’t lower her guard with him, though. Not yet, and maybe not ever.\n “Anne Marie,” he said, his expression serious. “I hope you’ll let me take you both out on another…date.”\n “I’ll consider it.” Anne Marie wasn’t willing to make any promises beyond that.\n “I am your boyfriend, remember? Your sort-of boyfriend, anyway.”\n She scowled at him.\n Ellen had waited her turn for a swing and then joined the other kids, kicking her feet in the air as she soared higher and higher. Children’s laughter rang through the park, and Anne Marie recognized the distinctive sound of her daughter’s high-pitched giggle. After several minutes, Ellen raced back to the fountain. Baxter barked when he saw her, his tail wagging madly. Tim got up as she approached. “It was very nice to meet you, Ellen. And I hope all your wishes come true.”\n “Me, too. Especially the one about my father.” She wrinkled her forehead.\n “What’s the matter? You don’t want to meet him?” Tim asked, obviously bewildered.\n “I do, but I asked Mom what she thought he looked like and she said he probably had big warts on his face.” She giggled again. Tim slid a look toward Anne Marie. “Did she, now? What else did she have to say?”\n “It was a joke,” Anne Marie rushed to add.\n “That he had really big feet.” Ellen raised her leg. “Feet as big as a clown’s.”\n “Personally, I doubt that’s true,” Tim said, squatting so the two of them were at eye level. “My guess is that your father’s a handsome prince who’d like nothing better than to sweep you and your mom off to a magic kingdom.”\n Ellen’s dark eyes rounded with pleasure. “Do you really think so?”\n “Yes, I do.”\n “That would be so cool!”\n “Yes, it would,” Tim agreed and, straightening, he looked at Anne Marie. “Don’t you agree?” he asked. And then he winked at her.\n Chapter 18\n Large or small, all types of women’s bodies are beautiful and I want to give knitters permission to express their beauty through what they make and wear.\n —Joan McGowan-Michael, www.whiteliesdesigns.com and author of Knitting Lingerie Style (2007) Lydia Goetz\n I’d noticed subtle changes in Casey since I’d taken her to see her brother, Lee, last Monday. A week had passed, and she’d begun spending more time with the family, instead of hiding in her bedroom with the door closed.\n Without being asked, she’d set the dining-room table one night. I was pleased—and surprised—but I didn’t dare comment. She started doing her homework at the kitchen table, too. All this had taken place since seeing her brother. His encouragement, and his talk about going to college and getting a job so he could send for her, had given her hope. I prayed everything would work out for Lee and consequently for Casey. Monday night, I served my special meat loaf, from a recipe Margaret had shared with me. She hadn’t gotten it via any of the usual methods today—cookbook, magazine or the Food Channel. Instead, my sister had heard about it at her hairdresser’s. Like Margaret, I’ve discovered that some of the best recipes come by word of mouth. It had certainly proved true in this instance. Her meat loaf had become a family favorite. It was a cool and rainy afternoon and because I was home all day doing housework, I didn’t mind having the oven on, even if it was almost the middle of July.\n I’d been to see my mother earlier that morning, having switched days with Margaret, and then after summer school, Casey had hung around me most of the afternoon instead of attending day camp. I thought she might want to make cookies again, but she declined. She asked if she could bake a cake instead. I agreed, and we found a recipe for an apple upside-down cake in my cherished old Joy of Cooking. It turned out really well, too. Again without being asked, she set the table for dinner and called Brad and Cody once everything was ready.\n “Janice phoned me this afternoon,” Brad said as he loaded his plate with a helping of peas and mashed potatoes, followed by a thick slice of meat loaf.\n Cody’s mother hadn’t contacted them since school was dismissed for the summer. I’d been figuring we’d hear from her sooner or later.\n “She wants to see Cody tomorrow afternoon.” Brad turned to me and then our son.\n “That’s nice,” I said in what I hoped was an encouraging voice.\n “What do you think about seeing your mother, buddy?” Brad asked, ladling gravy over everything on his plate. Cody shrugged. “Do I have to spend the night?”\n “Not unless you want to.”\n Cody seemed torn. “She doesn’t have any computer games and she doesn’t like Chase. Can I see her and hug her and go home again?”\n I hid a smile. Cody was more concerned about being away from his Xbox and his dog than spending time with his mother. And I couldn’t really blame him. Although he was only ten, he knew what Janice was like. He showed her the same level of interest she’d given him.\n Casey frowned as she listened to the exchange. “I thought Lydia was your mother.”\n “She is,” Cody said, smashing peas with his fork and mixing them into his potatoes. “I have two moms.”\n “I married Brad when Cody was eight,” I explained to Casey.\n “Why don’t you have more kids?” she asked.\n I set my fork beside my plate. “As a result of the chemo and radiation used to treat my cancer, I can’t have children.”\n “That’s why you applied for adoption?”\n I nodded. The subject of my infertility wasn’t as painful to me as it’d once been. For years I’d been convinced that even if I found a man willing to live with the uncertainty I faced as a two-time cancer survivor, my inability to bear a child would kill any hope of marriage. And then I’d met Brad Goetz…. I counted my blessings every day. My feelings of inadequacy had diminished because of his unstinting love and support. And since we’d set our adoption plans in motion, I’d been feeling almost serene. \n","sourceLink":"https://allnovel.net/summer-on-blossom-street-blossom-street-6/page-25.html","bookId":1938,"book":{"id":1938,"title":"Summer on Blossom Street (Blossom Street #6)","description":"Storyline: \n Summer on Blossom Street (Blossom Street #6) \n Knitting and life. They\u0027re both about beginnings--and endings. That\u0027s why it makes sense for Lydia Goetz, owner of A Good Yarn on Seattle\u0027s Blossom Street, to offer a class called Knit to Quit. It\u0027s for people who want to quit something--or someone!--and start a new phase of their lives.First to join is Phoebe Rylander. She recently ended her engagement to a man who doesn\u0027t know the meaning of \"faithful, \" and she\u0027s trying to get over him. Then there\u0027s Alix Turner. She and her husband, Jordan, want a baby, which means she \"has\" to quit smoking. And Bryan Hutchinson joins the class because he needs a way to deal with the stress of running his family\u0027s business--not to mention the lawsuit brought against him by an unscrupulous lawyer. \n Life can be as complicated as a knitting pattern. Just ask Anne Marie Roche. She and her adopted daughter, Ellen, finally have the happiness they wished for. And then a stranger comes to her bookstore asking questions. \n Or ask Lydia herself. Not only is she coping with her increasingly frail mother, but she and Brad have unexpectedly become foster parents to an angry, defiant twelve-year-old. \n But as Lydia already knows, when life gets difficult and your stitches are snarled, your friends can \"always\" help!\n \n","cover":"https://allnovel.net/images/summer-on-blossom-street-blossom-street-6.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/summer-on-blossom-street-blossom-street-6.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 9:59:07 AM"}}
