{"id":66028,"no":7,"title":"Page 7","content":"“That’s okay,” Alix said eagerly. They didn’t have much furniture so it wouldn’t take long to move again. No matter how many—or how few—months they had in the house by the lake, it would be worth the inconvenience.\n Jordan didn’t seem to hear her. “In addition to that, there’s no guarantee we’d f ind another apartment as reasonable as this one.”\n “Can’t we trust the Lord to look after the details?” she asked.\n “Doesn’t it feel as if this is meant to be?”\n “Alix, do you know how much work is involved in moving?”\n He had to be joking! She’d moved almost every six months her entire life. Her parents could never manage to pay the rent and still afford booze. Eviction never seemed to faze them; there were always other houses, other neighborhoods. Later, as a foster child, Alix had never lasted long with any family. By sixteen she was essentially on her own.\n “Jordan,” she said, reaching out to take his hand. “I do know all the work involved in moving.”\n He frowned. “I can’t believe you’re serious about this.”\n “But I am! I think it’s a great opportunity.”\n He squeezed her f ingers. “I know you loved Grandma Turner and she loved you, but I didn’t believe you’d actually be willing to move into her house. I mean, because of the distance and the fact that we’d have no guarantees…”\n “What…what about rent?” Their budget was tight because they’d been saving every extra penny for a down payment on a house. Unfortunately, it couldn’t be Sarah Turner’s house with its extensive property. She’d seen the asking price and it was way beyond what they’d be able to afford. Jordan shrugged. “The one advantage is that we’d be living rent-free.”\n Alix threw her arms in the air. “That’s so generous! It’s perfect, Jordan! Just perfect. We’ll be able to save for our own house and when you get your raise, we can put that money aside, too.”\n Another advantage was Sarah’s furniture; much of it was still there. Whatever the family wanted had already been taken. The rest was left for whoever purchased the house.\n “But you have to remember that utilities will be higher, and then there’s the cost of the commute.” He made these sound like monumental issues.\n “I’ll take the bus,” Alix said happily. The house was on a bus route and she could always read or knit while traveling into the city, even if she had to leave extra-early in the morning. The afternoons wouldn’t be so bad. She actually looked forward to riding the bus.\n “I’ll take public transportation, too, but there are certain days I’ll need the car and with the price of gas—”\n “Weren’t you the one who just said we should leave the details to God?” she challenged.\n “No, you did.”\n Alix giggled. “Then I heard it from you f irst.”\n “I never thought you’d go for this,” he said in a wondering tone.\n “Jordan, we were married at the lake house. Aren’t you the romantic one in the family?”\n “Yes, well…”\n “There’s another benef it you’re forgetting,” she whispered seductively.\n “What’s that?”\n “We’ve been talking about me getting pregnant, right?”\n “Right…when you’re ready.”\n That was his subtle reminder that she had to quit smoking f irst.\n “I should be soon. And Jordan, wouldn’t it be wonderful if we conceived our baby in a home that’s been in your family for generations?”\n Jordan’s gaze held hers. “That does sound like a wonderful idea….”\n Alix grinned. “I knew you’d think so.”\n Chapter 5\n Anne Marie Roche\n Anne Marie and Ellen Roche hauled their suitcases up the stairs to the small apartment above Blossom Street Books. The f light from Paris had landed them back in Seattle midafternoon but it felt like the middle of the night to Anne Marie.\n Nine-year-old Ellen had slept for most of the f light, but not Anne Marie. Instead, she’d cradled her daughter with one arm and reveled in each and every precious memory of their twoweek vacation. Even after nearly eight months it seemed unbelievable that she was now legally Ellen’s mother. A few words in front of a judge had made it so. In truth, the judge’s proclamation had been a mere formality. Anne Marie had become Ellen’s mother in her mind, in her heart, long before anything was off icial. Almost a year and a half earlier, on Valentine’s Day, Anne Marie, together with three other widows, had made a list of twenty wishes. One of her wishes was to travel to Paris with someone she loved. That someone had turned out to be Ellen. A number of her wishes had come to pass, and some, like the Paris trip, had taken place in unexpected ways.\n “Can we get Baxter now?” Ellen asked, racing out of her small bedroom, where she’d deposited her suitcase.\n “In a little while.”\n Anne Marie missed her Yorkie, too. Her friend Elise Beaumont— one of the group of Valentine widows—had looked after Baxter these past two weeks. Anne Marie had predicted that by the time they got back, Elise would recognize the benefits of canine companionship.\n “I want to teach Baxter French,” Ellen said. The girl had picked up phrases with surprising ease and was determined not to forget a single word.\n “J’aime la France,” Ellen said.\n “Moi, aussi.” Anne Marie remembered that much French, despite her exhaustion.\n “S’il vous plaît, donne moi quelques bon-bons?” Ellen asked next.\n “No, you can’t have any candy!”\n “Ah, Mom…”\n Anne Marie returned to her unpacking. “Let me put in a load of wash and then we’ll go get Baxter.”\n Ellen went back to her bedroom and f inished unpacking her own suitcase. Then she stored it beneath her bed, which was littered with souvenirs she’d purchased in Paris for herself and special friends.\n Anne Marie was touched by the girl’s generosity. Ellen had spent all the money she’d saved from her allowance on trinkets for her school friends as well as Melissa, Anne Marie’s stepdaughter, and her baby boy.\n After dumping a load of clothes in the washer and setting the dial, Anne Marie called Elise and asked if it would be convenient to collect Baxter. She was told they could come anytime. While she was on the phone she decided to check her voice mail. With pen and pad in hand, she prepared to listen to two weeks’ worth of messages. Among them, as she expected, were a number of calls from real estate agents.\n The time had come to search for a home. The apartment above the bookstore had been f ine when it was just her, but she had a daughter to consider now. Anne Marie had started looking and hoped to f ind a place this summer. With Ellen’s circumstances so changed, she’d delayed the move, wanting the child to feel secure in her new life.\n There were four or f ive calls regarding houses in the neighborhood Anne Marie had chosen. She wanted Ellen to be able to attend the same school. Unfortunately, the homes in that neighborhood were older, and many were badly in need of updating and repairs. Anne Marie would have to pay for the work, and that added extensively to the cost. To her surprise there were a number of hang-ups, as well. She generally didn’t get more than one or two a month, if that. After the third, she began counting and tallied seven. Someone seemed to be trying hard to get hold of her, although she had no idea who it might be.\n Well, no point in worrying about it. Anyone this persistent was bound to try again. However, the fact that this person hadn’t left a message was a bit disconcerting.\n “Is anything wrong?” Ellen murmured as she entered the kitchen.\n “No, of course not. Why do you ask?”\n “You’re frowning,” Ellen said, studying her, sensitive as always to her moods.\n It meant that Anne Marie had to be careful not to overdramatize her emotions. “Everything’s f ine. Now let’s go pick up Baxter,” she said, grabbing Ellen about the waist and tickling her. The girl squealed delightedly.\n Reaching for her purse, Anne Marie followed Ellen, who bounced down the stairs ahead of her.\n Teresa, her full-time employee, looked up when Ellen burst into the bookstore. “I didn’t expect you guys to go out so soon,”\n she commented. She stood behind the cash register, opening the latest order from Ingram’s, a distributor. Cartons of books were stacked behind her, a good indication that business hadn’t slacked off while Anne Marie was away.\n “We’re going to get Baxter,” Anne Marie explained. “We probably won’t be long.”\n “Aren’t you tired?”\n “Exhausted,” Anne Marie told her.\n “Ellen seems raring to go.”\n That wasn’t unusual. But Anne Marie suspected jet lag would catch up with her soon.\n “Can we say hello to Susannah?” Ellen asked.\n “Of course, but remember if she’s with a customer we’ll have to wait.”\n “Okay.” Ellen held the shop door open for her. Susannah had two customers, but when she saw Anne Marie and Ellen, she smiled and waved.\n “Lydia and Margaret don’t look busy,” Ellen said as she peered into the front window of A Good Yarn. Her small hands framed her face and she stared at the sleeping cat. “Whiskers misses Baxter, too, don’t you, Whiskers?” she asked. “Can we go in, Mom?”\n “We can only visit for a few minutes,” Anne Marie cautioned.\n “Elise is waiting and so is Baxter.”\n “Okay.”\n As soon as they walked in, Lydia leaped to her feet. “Anne Marie! Ellen! Welcome home. How was Paris?”\n Anne Marie sighed luxuriously. “Wonderful! Everything I’ve ever imagined and more.”\n Lydia clasped her hands together and smiled warmly. “I knew it would be.”\n “How did the neighborhood survive without us?” Anne Marie teased.\n “It was a lot quieter,” Margaret called from the back of the shop where she sat crocheting. Then she broke into a huge grin. “And a lot less interesting, too.”\n “I think Whiskers missed Baxter,” Lydia said.\n “We’re going to get him right now,” Ellen told her. “I missed Baxter more than anyone.”\n “I’d miss Whiskers, too.” Lydia turned to Anne Marie, her eyes shining. “Listen, do you have a moment?” she asked.\n “Sure,” Anne Marie said. “What’s up?”\n Lydia’s joy was contagious. “Brad and I are going to adopt. We’ve requested an infant.”\n Anne Marie clapped her hands excitedly. “That’s incredible news.”\n “I heard this morning that Brad and I have been approved by the state.”\n “Did you speak with Evelyn Boyle?” She’d been Ellen’s social worker and Anne Marie had come to treasure the other woman, who’d been so instrumental in facilitating the adoption. She’d given Lydia Evelyn’s phone number weeks ago and had been wondering if anything had come of it. \n","sourceLink":"https://allnovel.net/summer-on-blossom-street-blossom-street-6/page-7.html","bookId":1938,"book":{"id":1938,"title":"Summer on Blossom Street (Blossom Street #6)","description":"Storyline: \n Summer on Blossom Street (Blossom Street #6) \n Knitting and life. They\u0027re both about beginnings--and endings. That\u0027s why it makes sense for Lydia Goetz, owner of A Good Yarn on Seattle\u0027s Blossom Street, to offer a class called Knit to Quit. It\u0027s for people who want to quit something--or someone!--and start a new phase of their lives.First to join is Phoebe Rylander. She recently ended her engagement to a man who doesn\u0027t know the meaning of \"faithful, \" and she\u0027s trying to get over him. Then there\u0027s Alix Turner. She and her husband, Jordan, want a baby, which means she \"has\" to quit smoking. And Bryan Hutchinson joins the class because he needs a way to deal with the stress of running his family\u0027s business--not to mention the lawsuit brought against him by an unscrupulous lawyer. \n Life can be as complicated as a knitting pattern. Just ask Anne Marie Roche. She and her adopted daughter, Ellen, finally have the happiness they wished for. And then a stranger comes to her bookstore asking questions. \n Or ask Lydia herself. Not only is she coping with her increasingly frail mother, but she and Brad have unexpectedly become foster parents to an angry, defiant twelve-year-old. \n But as Lydia already knows, when life gets difficult and your stitches are snarled, your friends can \"always\" help!\n \n","cover":"https://allnovel.net/images/summer-on-blossom-street-blossom-street-6.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/summer-on-blossom-street-blossom-street-6.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 9:59:07 AM"}}
