{"id":110832,"no":12,"title":"Page 12","content":"Mason saw it first. He was sitting in front of the lateral viewer taking notes as the ship cruised over the new planet. His pen moved quickly over the graph-spaced chart he held before him. In a little while they\u0027d land and take specimens. Mineral, vegetable, animal-if there were any. Put them in the storage lockers and take them back to Earth. There the technicians would evaluate, appraise, judge. And, if everything was acceptable, stamp the big, black INHABITABLE on their brief and open another planet for colonization from overcrowded Earth. Mason was jotting down items about general topography when the glitter caught his eye. \"I saw something,\" he said. He flicked the viewer to reverse lensing position. \"Saw what?\" Ross asked from the control board. \"Didn\u0027t you see a flash?\" Ross looked into his own screen. \"We went over a lake, you know,\" he said. \"No, it wasn\u0027t that,\" Mason said. \"This was in that clearing beside the lake.\" \"I\u0027ll look,\" said Ross, \"but it probably was the lake.\" His fingers typed out a command on the board and the big ship wheeled around in a smooth arc and headed back. \"Keep your eyes open now,\" Ross said. \"Make sure. We haven\u0027t got any time to waste.\" \"Yes sir.\" Mason kept his unblinking gaze on the viewer, watching the earth below move past like a slowly rolled tapestry of woods and fields and rivers. He was thinking, in spite of himself, that maybe the moment had arrived at last. The moment in which Earthmen would come upon life beyond Earth, a race evolved from other cells and other muds. It was an exciting thought. 1997 might be the year. And he and Ross and Carter might now be riding a new Santa Maria of discovery, a silvery, bulleted galleon of space. \"There!\" he said. \"There it is!\" He looked over at Ross. The captain was gazing into his viewer plate. His face bore the expression Mason knew well. A look of smug analysis, of impending decision. \"What do you think it is?\" Mason asked, playing the strings of vanity in his captain. \"Might be a ship, might not be,\" pronounced Ross. Well, for God\u0027s sake, let\u0027s go down and see, Mason wanted to say, but knew he couldn\u0027t. It would have to be Ross\u0027s decision. Otherwise they might not even stop. \"I guess it\u0027s nothing,\" he prodded. He watched Ross impatiently, watched the stubby fingers flick buttons for the viewer. \"We might stop,\" Ross said. \"We have to take samples anyway. Only thing I\u0027m afraid of is... \" He shook his head. Land, man! The words bubbled up in Mason\u0027s throat. For God\u0027s sake, let\u0027s go down! Ross evaluated. His thickish lips pressed together appraisingly. Mason held his breath. Then Ross\u0027s head bobbed once in that curt movement which indicated consummated decision. Mason breathed again. He watched the captain spin, push and twist dials. Felt the ship begin its tilt to upright position. Felt the cabin shuddering slightly as the gyroscope kept it on an even keel. The sky did a ninety-degree turn, clouds appeared through the thick ports. Then the ship was pointed at the planet\u0027s sun and Ross switched off the cruising engines. The ship hesitated, suspended a split second, then began dropping toward the earth. \"Hey, we settin\u0027 down already?\" Mickey Carter looked at them questioningly from the port door that led to the storage lockers. He was rubbing greasy hands over his green jumper legs. \"We saw something down there,\" Mason said. \"No kiddin\u0027,\" Mickey said, coming over to Mason\u0027s viewer. \"Let\u0027s see.\" Mason flicked on the rear lens. The two of them watched the planet billowing up at them. \"I don\u0027t know whether you can... oh, yes, there it is,\" Mason said. He looked over at Ross. \"Two degrees east,\" he said. Ross twisted a dial and the ship then changed its downward movement slightly. \"What do you think it is?\" Mickey asked. \"Hey!\" Mickey looked into the viewer with even greater interest. His wide eyes examined the shiny speck enlarging on the screen. \"Could be a ship,\" he said. \"Could be.\" Then he stood there silently, behind Mason, watching the earth rushing up. \"Reactors,\" said Mason. Ross jabbed efficiently at the button and the ship\u0027s engines spouted out their flaming gases. Speed decreased. The rocket eased down on its roaring fire jets. Ross guided. \"What do you think it is?\" Mickey asked Mason. \"I don\u0027t know,\" Mason answered. \"But if it\u0027s a ship,\" he added, half wishfully thinking, \"I don\u0027t see how it could possibly be from Earth. We\u0027ve got this run all to ourselves.\" \"Maybe they got off course,\" Mickey dampened without knowing. Mason shrugged. \"I doubt it,\" he said. \"What if it is a ship?\" Mickey said. \"And it\u0027s not ours?\" Mason looked at him and Carter licked his lips. \"Man,\" he said, \"that\u0027d be somethin\u0027.\" \"Air spring,\" Ross ordered. Mason threw the switch that set the air spring into operation. The unit which made possible a landing without then having to stretch out on thick-cushioned couches. They could stand on deck and hardly feel the impact. It was an innovation on the newer government ships. The ship hit on its rear braces. There was a sensation of jarring, a sense of slight bouncing. Then the ship was still, its pointed nose straight up, glittering brilliantly in the bright sunlight. \"I want us to stay together,\" Ross was saying. \"No one takes any risks. That\u0027s an order.\" He got up from his seat and pointed at the wall switch that let atmosphere into the small chamber in the corner of the cabin. \"Three to one we need our helmets,\" Mickey said to Mason. \"You\u0027re on,\" Mason said, setting into play their standing bet about the air or lack of it in every new planet they found. Mickey always bet on the need for apparatus. Mason for unaided lung use. So far, they\u0027d come out about even. Mason threw the switch, and there was a muffled sound of hissing in the chamber. Mickey got the helmet from his locker and dropped it over his head. Then he went through the double doors. Mason listened to him clamping the doors behind him. He kept wanting to switch on the side viewers and see if he could locate what they\u0027d spotted. But he didn\u0027t. He let himself enjoy the delicate nibbling of suspense. Through the intercom they heard Mickey\u0027s voice. \"Removing helmet,\" he said. Silence. They waited. Finally, a sound of disgust. \"I lose again,\" Mickey said. The others followed him out. \"God, did they hit!\" Mickey\u0027s face had an expression of dismayed shock on it. The three of them stood there on the greenish-blue grass and looked. It was a ship. Or what was left of a ship for, apparently, it had struck the earth at terrible velocity, nose first. The main structure had driven itself about fifteen feet into the hard ground. Jagged pieces of superstructure had been ripped off by the crash and were lying strewn over the field. The heavy engines had been torn loose and nearly crushed the cabin. Everything was deathly silent, and the wreckage was so complete they could hardly make out what type of ship it was. It was as if some enormous child had lost fancy with the toy model and had dashed it to earth, stamped on it, banged on it insanely with a rock. Mason shuddered. It had been a long time since he\u0027d seen a rocket crash. He\u0027d almost forgotten the everpresent menace of lost control, of whistling fall through space, of violent impact. Most talk had been about being lost in an orbit. This reminded him of the other threat in his calling. His throat moved unconsciously as he watched. Ross was scuffing at a chunk of metal at his feet. \"Can\u0027t tell much,\" he said. \"But I\u0027d say it\u0027s our own.\" Mason was about to speak, then changed his mind. \"From what I can see of that engine up there, I\u0027d say it was ours,\" Mickey said. \"Rocket structure might be standard,\" Mason heard himself say, \"everywhere.\" \"Not a chance,\" Ross said. \"Things don\u0027t work out like that. It\u0027s ours all right. Some poor devils from Earth. Well, at least their death was quick.\" \"Was it?\" Mason asked the air, visualizing the crew in their cabin, rooted with fear as their ship spun toward earth, maybe straight down like a fired cannon shell, maybe end-over-end like a crazy, fluttering top, the gyroscope trying in vain to keep the cabin always level. The screaming, the shouted commands, the exhortations to a heaven they had never seen before, to a God who might be in another universe. And then the planet rushing up and blasting its hard face against their ship, crushing them, ripping the breath from their lungs. He shuddered again, thinking of it. \"Let\u0027s take a look,\" Mickey said. \"Not sure we\u0027d better,\" Ross said. \"We say it\u0027s ours. It might not be.\" \"Jeez, you don\u0027t think anything is still alive in there, do you?\" Mickey asked the captain. \"Can\u0027t say,\" Ross said. But they all knew he could see that mangled hulk before him as well as they. Nothing could have survived that. The look. The pursed lips. As they circled the ship. The head movement, unseen by them. \"Let\u0027s try that opening there,\" Ross ordered. \"And stay together. We still have work to do. Only doing this so we can let the base know which ship this is.\" He had already decided it was an Earth ship. They walked up to a spot in the ship\u0027s side where the skin had been laid open along the welded seam. A long, thick plate was bent over as easily as a man might bend paper. \"Don\u0027t like this,\" Ross said. \"But I suppose... \" He gestured with his head and Mickey pulled himself up to the opening. He tested each handhold gingerly, then slid on his work gloves as he found some sharp edge. He told the other two and they reached into their jumper pockets. Then Mickey took a long step into the dark maw of the ship. \"Hold on, now!\" Ross called up. \"Wait until I get there.\" He pulled himself up, his heavy boot toes scraping up the rocket skin. He went into the hole too. Mason followed. It was dark inside the ship. Mason closed his eyes for a moment to adjust to the change. When he opened them, he saw two bright beams searching up through the twisted tangle of beams and plates. He pulled out his own flash and flicked it on. \"God, is this thing wrecked,\" Mickey said, awed by the sight of metal and machinery in violent death. His voice echoed slightly through the shell. Then, when the sound ended, an utter stillness descended on them. They stood in the murky light and Mason could smell the acrid fumes of broken engines. \"Watch the smell, now,\" Ross said to Mickey who was reaching up for support. \"We don\u0027t want to get ourselves gassed.\" \"I will,\" Mickey said. He was climbing up, using one hand to pull his thick, powerful body up along the twisted ladder. He played the beam straight up. \"Cabin is all out of shape,\" he said, shaking his head. Ross followed him up. Mason was last, his flash moving around endlessly over the snapped joints, the wild jigsaw of destruction that had once been a powerful new ship. He kept hissing in disbelief to himself as his beam came across one violent distortion of metal after another. \"Door\u0027s sealed,\" Mickey said, standing on a pretzel-twisted catwalk, bracing himself against the inside rocket wall. He grabbed the handle again and tried to pull it open. \"Give me your light,\" Ross said. He directed both beams at the door and Mickey tried to drag it open. His face grew red as he struggled. He puffed. \"No,\" he said, shaking his head. \"It\u0027s stuck.\" Mason came up beside them. \"Maybe the cabin is still pressurized,\" he said softly. He didn\u0027t like the echoing of his own voice. \"Doubt it,\" Ross said, trying to think. \"More than likely the jamb is twisted.\" He gestured with his head again. \"Help Carter.\" Mason grabbed one handle and Mickey the other. Then they braced their feet against the wall and pulled with all their strength. The door held fast. They shifted their grip, pulled harder. \"Hey, it slipped!\" Mickey said. \"I think we got it.\" They resumed footing on the tangled catwalk and pulled the door open. The frame was twisted, the door held in one corner. They could only open it enough to wedge themselves in sideways. The cabin was dark as Mason edged in first. He played his light beam toward the pilot\u0027s seat. It was empty. He heard Mickey squeeze in as he moved the light to the navigator\u0027s seat. There was no navigator\u0027s seat. The bulkhead had been stove in there, the viewer, the table and the chair all crushed beneath the bent plates. There was a clicking in Mason\u0027s throat as he thought of himself sitting at a table like that, in a chair like that, before a bulkhead like that. Ross was in now. The three beams of light searched. They all had to stand, legs spraddled, because the deck slanted. And the way it slanted made Mason think of something. Of shifting weights, of things sliding down... Into the corner where he suddenly played his shaking beam. And felt his heart jolt, felt the skin on him crawling, felt his unblinking eyes staring at the sight. Then felt his boots thud him down the incline as if he were driven. \"Here,\" he said, his voice hoarse with shock. He stood before the bodies. His foot had bumped into one of them as he held himself from going down any further, as he shifted his weight on the incline. Now he heard Mickey\u0027s footsteps, his voice. A whisper. A bated, horrified whisper. \"Mother of God.\" Nothing from Ross. Nothing from any of them then but stares and shuddering breaths. Because the twisted bodies on the floor were theirs, all three of them. And all three... dead. Mason didn\u0027t know how long they stood there, wordlessly, looking down at the still, crumpled figures on the deck. How does a man react when he is standing over his own corpse? The question plied unconsciously at his mind. What does a man say? What are his first words to be? A poser, he seemed to sense, a loaded question. But it was happening. Here he stood-and there he lay dead at his own feet. He felt his hands grow numb and he rocked unsteadily on the tilted deck. \"God.\" Mickey again. He had his flash pointed down at his own face. His mouth twitched as he looked. All three of them had their flash beams directed at their own faces, and the bright ribbons of light connected their dual bodies. Finally Ross took a shaking breath of the stale cabin air. \"Carter,\" he said, \"find the auxiliary light switch, see if it works.\" His voice was husky and tightly restrained. \"Sir?\" \"The light switch-the light switch!\" Ross snapped. Mason and the captain stood there, motionless, as Mickey shuffled up the deck. They heard his boots kick metallic debris over the deck surface. Mason closed his eyes, but was unable to take his foot away from where it pressed against the body that was his. He felt bound. \"I don\u0027t understand,\" he said to himself. \"Hang on,\" Ross said. Mason couldn\u0027t tell whether it was said to encourage him or the captain himself. Then they heard the emergency generator begin its initial whining spin. The light flickered, went out. The generator coughed and began humming and the lights flashed on brightly. They looked down now. Mickey slipped down the slight deck hill and stood beside them. He stared down at his own body. Its head was crushed in. Mickey drew back, his mouth a box of unbelieving terror. \"I don\u0027t get it,\" he said. \"I don\u0027t get it. What is this?\" \"Carter,\" Ross said. \"That\u0027s me!\" Mickey said. \"God, it\u0027s me!\" \"Hold on!\" Ross ordered. \"The three of us,\" Mason said quietly, \"and we\u0027re all dead.\" There seemed nothing to be said. It was a speechless nightmare. The tilted cabin all bashed in and tangled. The three corpses all doubled over and tumbled into one corner, arms and legs flopped over each other. All they could do was stare. Then Ross said, \"Go get a tarp. Both of you.\" Mason turned. Quickly. Glad to fill his mind with simple command. Glad to crowd out tense horror with activity. He took long steps up the deck. Mickey backed up, unable to take his unblinking gaze off the heavy-set corpse with the green jumper and the caved-in, bloody head. Mason dragged a heavy, folded tarp from the storage locker and carried it back into the cabin, legs and arms moving in robotlike sequence. He tried to numb his brain, not think at all until the first shock had dwindled. Mickey and he opened up the heavy canvas sheet with wooden motions. They tossed it out and the thick, shiny material fluttered down over the bodies. It settled, outlining the heads, the torsos, the one arm that stood up stiffly like a spear, bent over wrist and hand like a grisly pennant. Mason turned away with a shudder. He stumbled up to the pilot\u0027s seat and slumped down. He stared at his outstretched legs, the heavy boots. He reached out and grabbed his leg and pinched it, feeling almost relief at the flaring pain. \"Come away,\" he heard Ross saying to Mickey, \"I said, come away!\" He looked down and saw Ross half dragging Mickey up from a crouching position over the bodies. He held Mickey\u0027s arm and led him up the incline. \"We\u0027re dead,\" Mickey said hollowly. \"That\u0027s us on the deck. We\u0027re dead.\" Ross pushed Mickey up to the cracked port and made him look out. \"There,\" he said. \"There\u0027s our ship over there. Just as we left it. This ship isn\u0027t ours. And those bodies. They... can\u0027t be ours.\" He finished weakly. To a man of his sturdy opinionation, the words sounded flimsy and extravagant. His throat moved, his lower lip pushed out in defiance of this enigma. Ross didn\u0027t like enigmas. He stood for decision and action. He wanted action now. \"You saw yourself down there,\" Mason said to him. \"Are you going to say it isn\u0027t you?\" \"That\u0027s exactly what I\u0027m saying,\" Ross bristled. \"This may seem crazy, but there\u0027s an explanation for it. There\u0027s an explanation for everything.\" His face twitched as he punched his bulky arm. \"This is me,\" he claimed. \"I\u0027m solid.\" He glared at them as if daring opposition. \"I\u0027m alive,\" he said. They stared blankly at him. \"I don\u0027t get it,\" Mickey said weakly. He shook his head and his lips drew back over his teeth. Mason sat limply in the pilot\u0027s seat. He almost hoped that Ross\u0027s dogmatism would pull them through this. That his staunch bias against the inexplicable would save the day. He wanted for it to save the day. He tried to think for himself, but it was so much easier to let the captain decide. \"We\u0027re all dead,\" Mickey said. \"Don\u0027t be a fool!\" Ross exclaimed. \"Feel yourself!\" Mason wondered how long it would go on. Actually, he began to expect a sudden awakening, him jolting to a sitting position on his bunk to see the two of them at their tasks as usual, the crazy dream over and done with. But the dream went on. He leaned back in the seat and it was a solid seat. From where he sat he could run his fingers over solid dials and buttons and switches. All real. It was no dream. Pinching wasn\u0027t even necessary. \"Maybe it\u0027s a vision,\" he tried, vainly attempting thought, as an animal mired tries hesitant steps to solid earth. \"That\u0027s enough,\" Ross said. Then his eyes narrowed. He looked at them sharply. His face mirrored decision. Mason almost felt anticipation. He tried to figure out what Ross was working on. Vision? No, it couldn\u0027t be that. Ross would hold no truck with visions. He noticed Mickey staring open-mouthed at Ross. Mickey wanted the consoling of simple explanation too. \"Time warp,\" said Ross. They still stared at him. \"What?\" Mason asked. \"Listen,\" Ross punched out his theory. More than his theory, for Ross never bothered with that link in the chain of calculation. His certainty. \"Space bends,\" Ross said. \"Time and space form a continuum. Right?\" No answer. He didn\u0027t need one. \"Remember they told us once in training of the possibility of circumnavigating time. They told us we could leave Earth at a certain time. And when we came back we\u0027d be back a year earlier than we\u0027d calculated. Or a year later. \"Those were just theories to the teachers. Well, I say it\u0027s happened to us. It\u0027s logical, it could happen. We could have passed right through a time warp. We\u0027re in another galaxy, maybe different space lines, maybe different time lines.\" He paused for effect. \"I say we\u0027re in the future,\" he said. Mason looked at him. \"How does that help us?\" he asked. \"If you\u0027re right.\" \"We\u0027re not dead!\" Ross seemed surprised that they didn\u0027t get it. \"If it\u0027s in the future,\" Mason said quietly, \"then we\u0027re going to die.\" Ross gaped at him. He hadn\u0027t thought of that. Hadn\u0027t thought that his idea made things even worse. Because there was only one thing worse than dying. And that was knowing you were going to die. And where. And how. Mickey shook his head. His hands fumbled at his sides. He raised one to his lips and chewed nervously on a blackened nail. \"No,\" he said weakly, \"I don\u0027t get it.\" Ross stood looking at Mason with jaded eyes. He bit his lips, feeling nervous with the unknown crowding him in, holding off the comfort of solid, rational thinking. He pushed, he shoved it away. He persevered. \"Listen,\" he said, \"we\u0027re agreed that those bodies aren\u0027t ours.\" No answer. \"Use your heads!\" Ross commanded. \"Feel yourself!\" Mason ran numbed fingers over his jumper, his helmet, the pen in his pocket. He clasped solid hands of flesh and bone. He looked at the veins in his arms. He pressed an anxious finger to his pulse. It\u0027s true, he thought. And the thought drove lines of strength back into him. Despite all, despite Ross\u0027s desperate advocacy, he was alive. Flesh and blood were his evidence. His mind swung open then. His brow furrowed in thought as he straightened up. He saw a look almost of relief on the face of a weakening Ross. \"All right then,\" he said, \"we\u0027re in the future.\" Mickey stood tensely by the port. \"Where does that leave us?\" he asked. The words threw Mason back. It was true, where did it leave them? \"How do we know how distant a future?\" he said, adding weight to the depression of Mickey\u0027s words. \"How do we know it isn\u0027t in the next twenty minutes?\" Ross tightened. He punched his palm with a resounding smack. \"How do we know?\" he said strongly. \"We don\u0027t go up, we can\u0027t crash. That\u0027s how we know.\" Mason looked at him. \"Maybe if we went up,\" he said, \"we might bypass our death altogether and leave it in this space-time system. We could get back to the space-time system of our own galaxy and... \" His words trailed off. His brain became absorbed with twisting thought. Ross frowned. He stirred restlessly, licked his lips. What had been simple was now something else again. He resented the uninvited intrusion of complexity. \"We\u0027re alive now,\" he said, getting it set in his mind, consolidating assurance with reasonable words, \"and there\u0027s only one way we can stay alive.\" He looked at them, decision reached. \"We have to stay here,\" he said. They just looked at him. He wished that one of them, at least, would agree with him, show some sign of definition in their minds. \"But... what about our orders?\" Mason said vaguely. \"Our orders don\u0027t tell us to kill ourselves!\" Ross said. \"No, it\u0027s the only answer. If we never go up again, we never crash. We... we avoid it, we prevent it!\" His head jarred once in a curt nod. To Ross, the thing was settled. Mason shook his head. \"I don\u0027t know,\" he said. \"I don\u0027t... \" \"I do,\" Ross stated. \"Now let\u0027s get out of here. This ship is getting on our nerves.\" Mason stood up as the captain gestured toward the door. Mickey started to move, then hesitated. He looked down at the bodies. \"Shouldn\u0027t we...?\" he started to inquire. \"What, what?\" Ross asked, impatient to leave. Mickey stared at the bodies. He felt caught up in a great, bewildering insanity. \"Shouldn\u0027t we... bury ourselves?\" he said. Ross swallowed. He would hear no more. He herded them out of the cabin. Then, as they started down through the wreckage, he looked in at the door. He looked at the tarpaulin with the jumbled mound of bodies beneath it. He pressed his lips together until they were white. \"I\u0027m alive,\" he muttered angrily. Then he turned out the cabin light with tight, vengeful fingers and left. They all sat in the cabin of their own ship. Ross had ordered food brought out from the lockers, but he was the only one eating. He ate with a belligerent rotation of his jaw as though he would grind away all mystery with his teeth. Mickey stared at the food. \"How long do we have to stay?\" he asked, as if he didn\u0027t clearly realize that they were to remain permanently. Mason took it up. He leaned forward in his seat and looked at Ross. \"How long will our food last?\" he said. \"There\u0027s edible food outside, I\u0027ve no doubt,\" Ross said, chewing. \"How will we know which is edible and which is poisonous?\" \"We\u0027ll watch the animals,\" Ross persisted. \"They\u0027re a different type of life,\" Mason said. \"What they can eat might be poisonous to us. Besides, we don\u0027t even know if there are any animals here.\" The words made his lips raise in a brief, bitter smile. And he\u0027d actually been hoping to contact another people. It was practically humorous. Ross bristled. \"We\u0027ll... cross each river as we come to it,\" he blurted out as if he hoped to smother all complaint with this ancient homily. Mason shook his head. \"I don\u0027t know,\" he said. Ross stood up. \"Listen,\" he said. \"It\u0027s easy to ask questions. We\u0027ve all made a decision to stay here. Now let\u0027s do some concrete thinking about it. Don\u0027t tell me what we can\u0027t do. I know that as well as you. Tell me what we can do.\" Then he turned on his heel and stalked over to the control board. He stood there glaring at blank-faced gauges and dials. He sat down and began scribbling rapidly in his log as if something of great note had just occurred to him. Later Mason looked at what Ross had written and saw that it was a long paragraph which explained in faulty but unyielding logic why they were all alive. Mickey got up and sat down on his bunk. He pressed his large hands against his temples. He looked very much like a little boy who had eaten too many green apples against his mother\u0027s injunction and who feared retribution on both counts. Mason knew what Mickey was thinking. Of that still body with the skull forced in. The image of himself brutally killed in collision. He, Mason, was thinking of the same thing. And, behavior to the contrary, Ross probably was too. Mason stood by the port looking out at the silent hulk across the meadow. Darkness was falling. The last rays of the planet\u0027s sun glinted off the skin of the crashed rocket ship. Mason turned away. He looked at the outside temperature gauge. Already it was seven degrees and it was still light. Mason moved the thermostat needle with his right forefinger. Heat being used up, he thought. The energy of our grounded ship being used up faster and faster. The ship drinking its own blood with no possibility of transfusion. Only operation would recharge the ship\u0027s energy system. And they were without motion, trapped and stationary. \"How long can we last?\" he asked Ross again, refusing to keep silence in the face of the question. \"We can\u0027t live in this ship indefinitely. The food will run out in a couple of months. And a long time before that the charging system will go. The heat will stop. We\u0027ll freeze to death.\" \"How do we know the outside temperature will freeze us?\" Ross asked, falsely patient. \"It\u0027s only sundown,\" Mason said, \"and already it\u0027s... minus thirteen degrees.\" Ross looked at him sullenly. Then he pushed up from his chair and began pacing. \"If we go up,\" he said, \"we risk... duplicating that ship over there.\" \"But would we?\" Mason wondered. \"We can only die once. It seems we already have. In this galaxy. Maybe a person can die once in every galaxy. Maybe that\u0027s afterlife. Maybe... \" \"Are you through?\" asked Ross coldly. Mickey looked up. \"Let\u0027s go,\" he said. \"I don\u0027t want to hang around here.\" He looked at Ross. Ross said, \"Let\u0027s not stick out our necks before we know what we\u0027re doing. Let\u0027s think this out.\" \"I have a wife!\" Mickey said angrily. \"Just because you\u0027re not married-\" \"Shut up!\" Ross thundered. Mickey threw himself on the bunk and turned to face the cold bulkhead. Breath shuddered through his heavy frame. He didn\u0027t say anything. His fingers opened and closed on the blanket, twisting it, pulling it out from under his body. Ross paced the deck, abstractedly punching at his palm with a hard fist. His teeth clicked together, his head shook as one argument after another fell before his bullheaded determination. He stopped, looked at Mason, then started pacing again. Once he turned on the outside spotlight and looked to make sure it was not imagination. The light illumined the broken ship. It glowed strangely, like a huge, broken tombstone. Ross snapped off the spotlight with a soundless snarl. He turned to face them. His broad chest rose and fell heavily as he breathed. \"All right,\" he said. \"It\u0027s your lives too. I can\u0027t decide for all of us. We\u0027ll hand vote on it. That thing out there may be something entirely different from what we think. If you two think it\u0027s worth the risk of our lives to go up, we\u0027ll... go up.\" He shrugged. \"Vote,\" he said. \"I say we stay here.\" \"I say we go,\" Mason said. They looked at Mickey. \"Carter,\" said Ross, \"what\u0027s your vote?\" Mickey looked over his shoulder with bleak eyes. \"Vote,\" Ross said. \"Up,\" Mickey said. \"Take us up. I\u0027d rather die than stay here.\" Ross\u0027s throat moved. Then he took a deep breath and squared his shoulders. \"All right,\" he said quietly. \"We\u0027ll go up.\" \"God have mercy on us,\" Mickey muttered as Ross went quickly to the control board. The captain hesitated a moment. Then he threw switches. The great ship began shuddering as gases ignited and began to pour like channeled lightning from the rear vents. The sound was almost soothing to Mason. He didn\u0027t care any more; he was willing, like Mickey, to take a chance. It had only been a few hours. It had seemed like a year. Minutes had dragged, each one weighted with oppressive recollections. Of the bodies they\u0027d seen, of the shattered rocket-even more of the Earth they would never see, of parents and wives and sweethearts and children. Lost to their sight forever. No, it was far better to try to get back. Sitting and waiting was always the hardest thing for a man to do. He was no longer conditioned for it. Mason sat down at his board. He waited tensely. He heard Mickey jump up and move over to the engine control board. \"I\u0027m going to take us up easy,\" Ross said to them. \"There\u0027s no reason why we should... have any trouble.\" He paused. They snapped their heads over and looked at him with muscle-tight impatience. \"Are you both ready?\" Ross asked. \"Take us up,\" Mickey said. Ross jammed his lips together and shoved over the switch that read: Vertical Rise. They felt the ship tremble, hesitate. Then it moved off the ground, headed up with increasing velocity. Mason flicked on the rear viewer. He watched the dark earth recede, tried not to look at the white patch in the corner of the screen, the patch that shone metallically under the moonlight. \"Five hundred,\" he read. \"Seven-fifty... one thousand... fifteen hundred...\" He kept waiting. For explosion. For an engine to give out. For their rise to stop. They kept moving up. \"Three thousand,\" Mason said, his voice beginning to betray the rising sense of elation he felt. The planet was getting farther and farther away. The other ship was only a memory now. He looked across at Mickey. Mickey was staring, open-mouthed, as if he were about ready to shout out \"Hurry!\" but was afraid to tempt the fates. \"Six thousand... seven thousand!\" Mason\u0027s voice was jubilant. \"We\u0027re out of it!\" Mickey\u0027s face broke into a great, relieved grin. He ran a hand over his brow and flicked great drops of sweat on the deck. \"God,\" he said, gasping, \"my God.\" Mason moved over to Ross\u0027s seat. He clapped the captain on the shoulder. \"We made it,\" he said. \"Nice flying.\" Ross looked irritated. \"We shouldn\u0027t have left,\" he said. \"It was nothing all the time. Now we have to start looking for another planet.\" He shook his head. \"It wasn\u0027t a good idea to leave,\" he said. Mason stared at him. He turned away shaking his head, thinking... you can\u0027t win. \"If I ever see another glitter,\" he thought aloud, \"I\u0027ll keep my big mouth shut. To hell with alien races anyway.\" Silence. He went back to his seat and picked up his graph chart. He let out a long shaking breath. Let Ross complain, he thought, I can take anything now. Things are normal again. He began to figure casually what might have occurred down there on that planet. Then he happened to glance at Ross. Ross was thinking. His lips pressed together. He said something to himself. Mason found the captain looking at him. \"Mason,\" he said. \"What?\" \"Alien race, you said.\" Mason felt a chill flood through his body. He saw the big head nod once in decision. Unknown decision. His hands started to shake. A crazy idea came. No, Ross wouldn\u0027t do that, not just to assuage vanity. Would he? \"I don\u0027t...\" he started. Out of the corner of his eye he saw Mickey watching the captain too. \"Listen,\" Ross said. \"I\u0027ll tell you what happened down there. I\u0027ll show you what happened!\" They stared at him in paralyzing horror as he threw the ship around and headed back. \"What are you doing!\" Mickey cried. \"Listen,\" Ross said. \"Didn\u0027t you understand me? Don\u0027t you see how we\u0027ve been tricked?\" They looked at him without comprehension. Mickey took a step toward him. \"Alien race,\" Ross said. \"That\u0027s the short of it. That time-space idea is all wet. But I\u0027ll tell you what idea isn\u0027t all wet. So we leave the place. What\u0027s our first instinct as far as reporting it? Saying it\u0027s uninhabitable? We\u0027d do more than that. We wouldn\u0027t report it at all.\" \"Ross, you\u0027re not taking us back!\" Mason said, standing up suddenly as the full terror of returning struck him. \"You bet I am!\" Ross said, fiercely elated. \"You\u0027re crazy!\" Mickey shouted at him, his body twitching, his hands clenched at his sides menacingly. \"Listen to me!\" Ross roared at them. \"Who would be benefited by us not reporting the existence of that planet?\" They didn\u0027t answer. Mickey moved closer. \"Fools!\" he said. \"Isn\u0027t it obvious? There is life down there. But life that isn\u0027t strong enough to kill us or chase us away with force. So what can they do? They don\u0027t want us there. So what can they do?\" He asked them like a teacher who cannot get the right answers from the dolts in his class. Mickey looked suspicious. But he was curious now, too, and a little timorous as he had always been with his captain, except in moments of greatest physical danger. Ross had always led them, and it was hard to rebel against it even when it seemed he was trying to kill them all. His eyes moved to the viewer screen where the planet began to loom beneath them like a huge dark ball. \"We\u0027re alive,\" Ross said, \"and I say there never was a ship down there. We saw it, sure. We touched it. But you can see anything if you believe it\u0027s there! All your senses can tell you there\u0027s something when there\u0027s nothing. All you have to do is believe it!\" \"What are you getting at?\" Mason asked hurriedly, too frightened to realize. His eyes fled to the altitude gauge. Seventeen thousand... sixteen thousand... fifteen... \"Telepathy,\" Ross said, triumphantly decisive. \"I say those men, or whatever they are, saw us coming. And they didn\u0027t want us there. So they read our minds and saw the death fear, and they decided that the best way to scare us away was to show us our ship crashed and ourselves dead in it. And it worked... until now.\" \"So it worked!\" Mason exploded. \"Are you going to take a chance on killing us just to prove your damn theory?\" \"It\u0027s more than a theory!\" Ross stormed, as the ship fell, then Ross added with the distorted argument of injured vanity, \"My orders say to pick up specimens from every planet. I\u0027ve always followed orders before and, by God, I still will!\" \"You saw how cold it was!\" Mason said. \"No one can live there anyway! Use your head, Ross!\" \"Damn it, I\u0027m captain of this ship!\" Ross yelled, \"and I give the orders!\" \"Not when our lives are in your hands!\" Mickey started for the captain. \"Get back!\" Ross ordered. That was when one of the ship\u0027s engines stopped and the ship yawed wildly. \"You fool!\" Mickey exploded, thrown off balance. \"You did it, you did it!\" Outside the black night hurtled past. The ship wobbled violently. Prediction true was the only phrase Mason could think of. His own vision of the screaming, the numbing horror, the exhortations to a deaf heaven-all coming true. That hulk would be this ship in a matter of minutes. Those three bodies would be... \"Oh... damn!\" He screamed it at the top of his lungs, furious at the enraging stubbornness of Ross in taking them back, of causing the future to be as they saw-all because of insane pride. \"No, they\u0027re not going to fool us!\" Ross shouted, still holding fast to his last idea like a dying bulldog holding its enemy fast in its teeth. He threw switches and tried to turn the ship. But it wouldn\u0027t turn. It kept plunging down like a fluttering leaf. The gyroscope couldn\u0027t keep up with the abrupt variations in cabin equilibrium and the three of them found themselves being thrown off balance on the tilting deck. \"Auxiliary engines!\" Ross yelled. \"It\u0027s no use!\" Mickey cried. \"Damn it!\" Ross clawed his way up the angled deck, then crashed heavily against the engine board as the cabin inclined the other way. He threw switches over with shaking fingers. Suddenly Mason saw an even spout of flame through the rear viewer again. The ship stopped shuddering and headed straight down. The cabin righted itself. Ross threw himself into his chair and shot out furious hands to turn the ship about. From the floor Mickey looked at him with a blank, white face. Mason looked at him, too, afraid to speak. \"Now shut up!\" Ross said disgustedly, not even looking at them, talking like a disgruntled father to his sons. \"When we get down there you\u0027re going to see that it\u0027s true. That ship\u0027ll be gone. And we\u0027re going to go looking for those bastards who put the idea in our minds!\" They both stared at their captain humbly as the ship headed down backwards. They watched Ross\u0027s hands move efficiently over the controls. Mason felt a sense of confidence in his captain. He stood on the deck quietly, waiting for the landing without fear. Mickey got up from the floor and stood beside him, waiting. The ship hit the ground. It stopped. They had landed again. They were still the same. And... \"Turn on the spotlight,\" Ross told them. Mason threw the switch. They all crowded to the port. Mason wondered for a second how Ross could possibly have landed in the same spot. He hadn\u0027t even appeared to be following the calculations made on the last landing. They looked out. Mickey stopped breathing. And Ross\u0027s mouth fell open. The wreckage was still there. They had landed in the same place and they had found the wrecked ship still there. Mason turned away from the port and stumbled over the deck. He felt lost, a victim of some terrible universal prank, a man accursed. \"You said...\" Mickey said to the captain. Ross just looked out of the port with unbelieving eyes. \"Now we\u0027ll go up again,\" Mickey said, grinding his teeth. \"And we\u0027ll really crash this time. And we\u0027ll be killed. Just like those... those...\" Ross didn\u0027t speak. He stared out of the port at the refutation of his last clinging hope. He felt hollow, void of all faith in belief in sensible things. Then Mason spoke. \"We\u0027re not going to crash-\" he said somberly-\"ever.\" \"What?\" Mickey was looking at him. Ross turned and looked too. \"Why don\u0027t we stop kidding ourselves?\" Mason said. \"We all know what it is, don\u0027t we?\" He was thinking of what Ross had said just a moment before. About the senses giving evidence of what was believed. Even if there was nothing there at all... Then, in a split second, with the knowledge, he saw Ross and he saw Carter. As they were. And he took a short shuddering breath, a last breath until illusion would bring breath and flesh again. \"Progress,\" he said bitterly, and his voice was an aching whisper in the phantom ship. \"The Flying Dutchman takes to the universe.\"","sourceLink":"https://allnovel.net/shock/page-12.html","bookId":2545,"book":{"id":2545,"title":"Shock","description":"Storyline: 13 Tales of Sheer Terror","cover":"https://allnovel.net/images/shock.jpg","author":"Richard Matheson","type":"Horror","source":"allnovel","link":"https://allnovel.net/shock.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:08:02 AM"}}
