{"id":34845,"no":21,"title":"XIX ARRAIGNED","content":"Before breakfast, the following morning, Colonel Sharpe sent for Maynadier. \"Sleep did it!\" said the Governor. \"I have made up my mind. I shall give him a chance to explain, and upon his explanation will depend my future course. Whether or not I shall take up the matter of the Marbury money, we will determine later.\" \"It is a wise decision,\" Maynadier agreed. \"I dare not do less out of consideration for my position. He has presented another man\u0027s letters, has taken that other man\u0027s name, has entered this house, and the houses of our friends under false pretenses. In short, he has acted the rogue, and he must bear the consequences.\" \"How can he possibly explain?\" asked Maynadier. \"What justification can there be for his conduct?\" \"None that I can apprehend—but we must not prejudge him; we must give him a chance. I believe the law has a maxim, that every one is presumed innocent until proven guilty. You said, I think, that Marbury was not leaving Annapolis until to-night?\" \"So he told me,\" said Maynadier. [Pg 305] The Governor nodded. \"I have sent for him. When he arrives, we will proceed with the matter—the quicker it is settled the better. It is a nasty business, Maynadier. I like the fellow, too, damn well!—Come in!\" he called, as a knock sounded on the door.—\"Ah, my dear!\" as Miss Stirling\u0027s face appeared, \"what got you up so early?\" \"I am up so early because—Oh! I beg your pardon, Mr. Maynadier. I thought the Governor was alone. I will withdraw——\" \"By no means!\" said Maynadier; \"our business is over, for the time.—Permit me!\" and he stepped to the door. \"Nonsense!\" exclaimed the Colonel. \"She is not going to talk secrets—what is it, Martha—permission to take some of the horses?\" \"No,\" she replied, and glanced, meaningly, at Maynadier—who at once retired. She waited until the door was shut. \"It is this,\" she said. \"That letter, which I gave you last evening—I want it back again.\" The Governor looked his surprise. \"You want it back again?\" he asked. \"Yes—and your promise not to use it. There is nothing to be gained by exposing him, except a scandal, which must, necessarily, drag me in.\" \"You have changed your mind since last night,\" he commented. \"I have,\" she answered. \"In less than two[Pg 306] weeks he will have sailed.—So, let it rest—it will profit nothing.\" He unlocked a drawer, took out Lady Catherwood\u0027s letter, and handed it to her. A glad smile came to her face. \"Thank you, sir! oh, thank you!\" and she bent, and brushed his cheek, lightly, with her lips. He reached up, and drew her down on the arm of his chair. \"And have you no other reason, my dear?\" he asked. \"No!\" with a shake of her pretty head.—\"No other reason.\" He looked at her thoughtfully. \"What were you and Sir Edward—I call him that for want of a better name—talking about last night—out yonder in the moonlight?\" he asked. WHAT WERE YOU AND SIR EDWARD TALKING ABOUT LAST NIGHT \"WHAT WERE YOU AND SIR EDWARD TALKING ABOUT LAST NIGHT?\" HE ASKED. She laughed, a little guiltily—watching his face the while. \"He was making love to me,\" she replied—\"he does it very well, indeed, sir.\" \"So it would seem,\" said the Governor—\"so well, indeed, that you sought at once to regain the Catherwood letter, but, thinking that I had retired, came back the first thing, this morning.\" She flushed, and her eyes went toward the window. \"Just so!\" he said. \"I was sitting there, and saw it all—saw you leave, heard you come to my door and listen, saw you return, a moment, to him—and, now, you come again—and it is for the letter.[Pg 307] You know that he is not Parkington, that he is an impostor—consequently, he must have told you something which explains. What was it?\" \"He acknowledged that he was not Parkington; that he——\" \"I told you, specifically, not to mention the letter to him!\" said the Governor. \"And I obeyed you,\" she answered. \"Not until he had, voluntarily and of his own free will, confessed, did I refer to the letter.\" The Governor beat a tattoo on the table with his finger-tips. \"Who does he say he is?\" he asked, presently. She told him. \"Huh! Doncaster\u0027s son, is he! How does he explain the letters, and the impersonation?\" She told him. When she had finished, he sat silent, pulling at his chin. \"Do you think him serious in his love-making?\" he asked. \"He did me the honor to propose,\" she said. \"Hum!—And do you—care for him?\" \"As much as I shall ever care for any man,\" she answered (thinking of Maynadier). \"Furthermore, it would be an excellent match for me.\" \"An excellent match, if he speaks truly. There are none better, in all England, than the De Lysles.\" [Pg 308] \"He offered to wait, until we got to England, for the wedding.\" \"Hum—that makes something for sincerity, at least.—So, you wish to marry him, my dear?\" \"I think I do,\" she said—\"that is, if he is a De Lysle.\" He shook his head, sadly. \"I am sorry, Martha, to have to injure your prospects, but I must act as the Governor, and it is his duty to call him to account. He has misused the proprietor\u0027s letters, and our hospitality.\" \"But you gave me the letter,\" she expostulated. \"What other proof have you that he is an impostor?\" \"I gave you the letter to relieve you of all participation,\" the Colonel said. \"I do not need it. I have abundant evidence without it, and there may be more, besides.\" She gave a little gasp, and sat up. \"Then I can do nothing?\" she asked. \"Nothing,\" he said, his hand stroking tenderly the dark tresses—\"the matter must go on to its finish. The people of the Province shall not say that I knew he was an impostor, yet did not expose him. I regret it, my dear, but when one takes another\u0027s name, he commits a crime against society which cannot be tolerated.\" \"What shall I tell him?\" she asked. \"Tell him you have the letter, and that the Governor will not use the information it contained.\" [Pg 309] \"That will be the truth,\" she reflected. \"It will,\" he said; \"and, further, you need not go.\" And she, knowing it was useless to argue or implore, kissed him, and went, slowly, the letter of Lady Catherwood clutched tightly in her fingers. She had no opportunity to communicate with Parkington until after breakfast, other than a significant nod, as his eyes sought hers, inquiringly. When the meal was finished, he joined her, and, presently, they sauntered out together. \"I have the letter,\" she said. \"You are a dear!\" he exclaimed. \"And I have, also, the Governor\u0027s promise not to use either it, or the information it contains.\" \"You are a darling!\" bending down, and whispering in her ear. It was a caress, though he touched her not at all. And her heart warmed to him, with a sympathy she had never felt before. Surely, he was handsome, with the handsomeness which a woman loved, a debonairness that was fascinating. \"You have done everything—you have saved me!\" he exclaimed. She plucked a rose; he took it, and drew it through his buttonhole. \"I have done what I can,\" she replied; \"but I have not saved you.\" \"What? the letter!—the information——\" \"Will not be used against you,\" she broke in;[Pg 310] \"but, I fear that the Governor has other evidence, quite as strong and much more convincing.\" His thoughts turned, instantly, to Miss Marbury. She had told—and lost no time in the telling, either, it would seem. He smiled, derisively. Brandon was right. No woman could keep a secret, unless she were vitally concerned in it. \"Well,\" he said, \"I shall stay and face it. At least, they shall not say I ran away. Moreover, they cannot do more than unmask me—and, when the mask is off, they show a De Lysle—and between a De Lysle and a Parkington, even if the former is somewhat scar-marked, there is vast difference. I may not accompany Brandon home; but, when I go, you go with me.\" She put her hand on his arm. \"Prove it, and I will go,\" she said. He took her hand, regardless of who saw, and kissed it with inimitable grace, bowing low over it, the while. \"It is a bargain, my lady!\" he said. \"I accept your own terms. Now, with your permission, I will to Sir Charles Brandon, and take counsel with him.\" As they were returning, a man came rapidly up the esplanade, from the landing, and passed them, at some little distance. \"Is not that Mr. Marbury?\" Miss Stirling asked. Parkington nodded, but did not speak.—[Pg 311]Marbury! The one man who could prove the theft! The man who could identify Long-Sword! Why should he have come to Whitehall—and at this particular time? \"Was he not expected?\" he asked, with assumed carelessness. \"No,\" she replied. \"He likely comes to see the Governor, on business which requires his personal approval.\" \"I think I will hasten to Sir Charles,\" he said, now thoroughly alarmed. Meanwhile, Marbury had been met, as he neared the house, by Maynadier, who had noted his approach. \"What does his Excellency want with me?\" he asked. \"Has it to do with the theft?\" \"It has—with the theft, and something more. We will go in—the Governor awaits you in the drawing-room; he will relate the exact facts.\" \"Mr. Marbury,\" said Colonel Sharpe, laying aside the Gazette he was reading, and offering his guest a chair, \"I have sent for you because I want your aid.\" \"I appreciate the honor, sir,\" replied Marbury, \"but, as I am the only person concerned, I request your Excellency to let the matter rest. Moreover, the money was returned; why should it not be let rest?\" \"I think you do not quite understand the [Pg 312]situation,\" returned the Governor. \"Let me, briefly, outline the facts....\" Marbury listened, in impassive silence. The change of name did not affect him; he knew of another such, much closer home. But the stealing of another\u0027s identity, and the presentation of his letters, were serious matters to the Colonists, and, he admitted, any one who was guilty ought to be exposed. \"I was sure you would see it as we do, Mr. Marbury, when you knew everything!\" said the Governor. \"Yes—the theft from me—if he were the thief—was solely, my affair,\" was the reply; \"this, however, concerns us all. If the one fit into the other, I shall bear my part.\" The Governor struck a bell; the orderly, on duty, entered. \"My compliments to Captain Herford,\" said the Colonel, \"and say, I wish to see him.\" The man saluted and withdrew. In a moment, Captain Herford entered. \"Captain Herford, you will say, to Sir Edward Parkington and to Sir Charles Brandon, that the Governor desires their attendance in the drawing-room. Then, station the guard outside the windows, with two just without the doors. You understand?\" Herford\u0027s heels came together, and his hand rose to his forehead. [Pg 313] \"Yes, your Excellency!\" he replied, with a surprised lift of the eye-brows toward Maynadier. He found Parkington and Brandon together, pacing back and forth on the esplanade. He delivered his message curtly, faced about, and tramped off. These men were not to his liking, and in his official capacity, as his Excellency\u0027s aide-de-camp, it did his small soul good to treat them with scant courtesy. \"Well, it has come!\" said Parkington. Brandon was looking after Herford, with a frown. \"That fellow,\" he observed, \"needs to be taught some civility with a club—a walking stick is not stout enough to be effective.\" \"Never mind Herford,\" smiled Parkington. \"Come and help his Excellency hold court, for my particular benefit.\" Brandon was wearing his sword, and, now, he gave it a hitch forward, so that it lay close to his hand. \"You do not anticipate using it?\" his friend asked. \"I do not know,\" said he, with an ominous shake of the head. \"One can never tell how suddenly the occasion may arise. That is why I am never without it—it has saved my life, a score of times, in the last four years.\" \"We are not flying the Jolly Roger, now,\" Parkington commented. [Pg 314] The other shrugged his shoulders. \"I am not so sure.\" \"You are not in danger.\" \"You forget that Marbury is with the Governor.\" \"He will not recognize you—you, yourself, said so.\" \"That was before you were suspected—I counted on your word to prove my name.\" \"Then do not come with me—do not run the risk!\" urged Parkington. \"No, I must brave it out. To decamp, now, would be useless. I was summoned, I presume, because you vouched for me—but, if I do not respond, that instant they will understand I had good cause for going, and I should be caught ere I had gone a mile. Come on—it is a good game and we will play it out.... You see!\" he said, as they entered the house, pointing to the opposite doorway, through which could be seen the guard parading. \"It were folly to do otherwise.\" Every one was down at the race track, looking at the horses, the house was deserted, save for the servants. Miss Stirling, even, was gone with the rest—Marbury\u0027s coming had delayed the matter, she supposed, and some regard must be paid to the duties of hostess. The two men crossed the entrance and knocked at the drawing-room door, which, contrary to [Pg 315]custom, was closed. Instantly, it was swung open—and the Governor bade them enter. He was standing with his back to the fire-place, his hands behind him, his face grave and thoughtful. He returned, with studied courtesy, their bows of greeting, and motioned for them to be seated. Maynadier, placid and unmoved, was on one side, Marbury, grim-faced but plainly ill at ease, on the other. \"Gentlemen,\" said Colonel Sharpe, \"I regret that it is as the Governor of Maryland, and not as Colonel Sharpe, that I have had to request your presence here, this morning.\" \"We took it, from the formal manner of our summons, that your Excellency wished to confer with us in your official capacity,\" said Parkington, easily. The Governor bowed again. \"Which, being understood,\" said he, \"we can proceed to business.... Sir Edward Parkington, I have received information of such a pertinent character, that I have no other course than to question your identity. I do it with the greatest reluctance—you have been a guest in my house, and in the houses of the prominent men of the Colony—you presented letters, from Lord Baltimore, which were regular, and which entitled you to be received. We are informed, now, that you are not their rightful owner—in other words, that you are an [Pg 316]impostor. What, sir, have you to say in explanation?\" Parkington laughed a little, easy laugh, and brushed a speck of dust from his coat sleeve. \"I have nothing to say,\" he replied.—\"Your Excellency\u0027s information is correct. I am not Sir Edward Parkington.\" The Governor\u0027s jaw closed tight, his face grew very stern, and, for a brief time, he did not answer. \"How did you come into possession of Lord Baltimore\u0027s letters?\" he asked, at length. \"Did you steal them?\" \"No!\" said Parkington, \"unless taking them from a dead man is stealing.\" ... He shrugged his shoulders. \"I will tell you the facts, since you wish to know them.\" He drew out his snuff-box—offered it to the others, with a graceful gesture—took a pinch himself, and told his story. * * * * * * * * * \"And you say that you did this thing in a fit of foolishness?\" the Governor asked, when he had finished. \"Yes—I did not appreciate how difficult it would be to throw off the false identity. That is why I was going home: to regain myself.\" \"Who, in truth, are you?\" asked the Governor. (He did not care to disclose that Miss Stirling had told him.) [Pg 317] \"Roger de Lysle, second son of the Earl of Doncaster,\" was the answer. Maynadier turned and looked at him, with sudden interest—Marbury\u0027s grim visage relaxed a trifle. There was virtue, in those days, in a name. \"Have you the means of proving it?\" said his Excellency—\"any papers—anything, indeed?\" \"My papers were lost when The Sally foundered. But Sir Charles Brandon can attest me.\" The Governor turned, inquiringly, to Brandon, who was sitting somewhat back, and quite within the shadow. \"I can substantiate his statement that he is Doncaster\u0027s son,\" said Brandon. \"I have known the family, intimately, for years.\" As he spoke, Marbury suddenly threw up his head, much as a dog does to the scent, and his sharp eyes glistened. At the end, he arose, and, with never a glance at any one, went out. \"The difficulty is,\" said the Governor, \"that this man (who admits he is an impostor) introduced you. Have you any means of identification?\" \"It is a proper question,\" returned Brandon, promptly. Arising, he took a bundle of papers from his pocket, and handed them to the Governor. The latter examined them, one by one, carefully and slowly. When he had finished, he passed them on to Maynadier. \"They are regular,\" he said, \"but rather old—the [Pg 318]latest is dated more than four years back.\" \"I am Sir Charles Brandon, now, just as well as four years ago!\" he laughed. Then, he explained: \"It is four years since I left England.\" \"And you have not, in that time, had letters from home?\" \"None.\" The Governor nodded, then turned to Maynadier, and the two conversed in low tones. Brandon stretched out his legs and frowned—the talk had stirred old ashes that still smouldered. De Lysle, untroubled and unconcerned, picked up the Gazette, the Governor had been reading, and glanced over it. The first three columns had to do with news, three months old, of the Court and Parliament. He passed them by. The column which did for Boston, and New York and Philadelphia, also, went unread. The stick of Annapolis doings, for the past week, was glanced at, curiously. Then, down at the bottom of the last column, something in larger type, caught his eye. He looked, casually, at it, then looked again—then read it, amazed, and a second time, read it, and the third time. Just at that moment, Marbury re-entered. Brandon turned his head from him, but the former stopped, deliberately peered in his face, and wheeled on the Governor. \"Your Excellency,\" he said, \"it would appear that you have seined for a small fish, and caught[Pg 319] a shark. This man you know, I believe, as Sir Charles Brandon?\" \"He was so introduced,\" returned the Governor, a little surprise showing in his voice; \"and his papers bear him out—albeit, they are some four years old.\" Marbury laughed, scornfully. \"The papers seem to bear out Parkington, too!\" he said. \"However, they may be right enough—he may be Sir Charles Brandon—but—he is, also, Long-Sword the Pirate.\"","sourceLink":"http://novel.tingroom.com/duanpian/3329/91164.html","bookId":379,"book":{"id":379,"title":"The Impostor","description":"简介： Martha Stirling came slowly down the steps into the garden, pausing for a moment, on each step, lest the Governor hear her; then she sped quickly across the lawn, and, bending over, kissed him on the cheek....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3329","creation":"Aug 1, 2019 12:18:41 AM","modification":"Aug 1, 2019 12:18:41 AM"}}
