{"id":35241,"no":16,"title":"Chapter 15: Again At Tezcuco.","content":"Until a late hour in the night, Roger sat talking to Cacama and his family. Although they had heard, from Bathalda, all that had happened from the time of their leaving Tezcuco to their arrival at Tlascala, he had to go over it again. Bathalda had told them that Roger had found a former acquaintance in Malinche, who was all powerful with the white leaders; and Amenche asked many questions concerning her--how Roger had known her before, and for how long; what she was like, and why he applied to her, instead of going straight to the white general. \"You have heard me speak of her before,\" Roger said, in answer to the first question. \"I told you that I had learned your language from a Mexican slave girl, who was one of my attendants during the time I was at Tabasco. She was with me the whole time I was there, and if it had not been for learning the language from her, and conversing with her, I do not know how I should have got through the time. I was sorry to leave her behind, and promised her that, if ever I got rich enough here, I would send and purchase her freedom.\" \"You seem to have taken a strange interest in a slave girl!\" Amenche said. \"It was natural that it should be so, Princess. I was little better than a slave, myself. At any rate I was a prisoner, and naturally took to the one person who was kind to me. We were companions and friends, rather than master and attendant; and directly I heard that she was with Cortez, and had gained great influence with him, I naturally went to her.\" \"Is she very beautiful?\" \"I used not to think her beautiful at all, when we were at Tabasco together; but she has changed greatly during the months that have passed since I saw her. Yes, I think she is certainly beautiful now. But not so beautiful as others I have seen.\" \"But why did you go to her?\" the girl again persisted. \"Because I cannot speak the language of the Spaniards; and it was necessary, for my safety, for them to believe that I am one of themselves, rescued from some Spanish ship cast, by a gale, on their shores when I was a little lad. Had I gone to Cortez direct, he would probably have guessed, from my dress and from my speaking the language, that this was how I came to be here; but had I not seen Malinche before I saw him, she would have recognized me, and would no doubt have told Cortez that she had known me from the time I was cast ashore, near Tabasco, somewhat over two years ago. He would then have known that I could not be a Spaniard, for if so, I could not in so short a time have lost my own language.\" Cacama now interposed, and asked many questions about Tlascala and its people. \"Some of the Tlascalan princes and caziques gave their daughters as wives to the Spaniards, did they not?\" \"Six of them did so,\" Roger replied. \"The ladies were first baptized into the Christian religion, and then married by the priests to as many of the chief leaders of the Spaniards.\" \"And what did you think of that?\" Cacama asked. \"I did not think much about it,\" Roger said; \"for it was no business of mine, but that of the ladies and their friends. It was certainly a politic course, on the part both of Cortez and the Tlascalans, and bound the alliance more closely together. \"But methinks that, upon such work as the Spaniards are engaged in, a man were better without a wife, both for his sake and her own. A man who goes into battle with no one but himself to think of may take joy in the strife; for he knows that, if he falls, it makes no very great matter to anyone. But if he has a wife hard by, who will be left a widow if he is slain, it must be ever present to him while he is fighting; and though he may not fight less stoutly, it must cause him grievous anxiety, and take away the pleasure of fighting.\" \"You have already told us that the white men are good husbands,\" the queen said. \"I do not know that they are in any way better, in that respect, than your own people, Queen Maclutha. There are good and bad--men who treat their wives well, and men who neglect them.\" \"But you told us that they only had one wife, each,\" she said; \"and that even kings are kept to this rule, as well as their humblest subjects.\" \"That is so,\" Roger said. \"One man one wife, whatever his rank. There is no occasion for the palaces of our king to be as extensive as those of Montezuma.\" \"And if these officers who have married here were to return home, and leave their wives behind them, could they not marry again?\" \"No,\" Roger said; \"as the ladies have become Christians, and been married according to the rites of the Church, they could not be lawfully set aside.\" \"And you have no wife in England, Roger Hawkshaw?\" Cacama asked. Roger laughed merrily. \"Why, I was but a boy when I left home; and as far as marriage goes, I am but a boy still. We consider it young enough, if we take a wife at five and twenty; and I lack six years of that, yet.\" \"You are a man,\" Cacama said gravely. \"You are a man in size and strength, and a man in courage; as you well showed, the other day, when you were attacked by numbers of our best soldiers. You are thoughtful and prudent. Years go for nothing. You are a man, and even in years you are not, according to our customs, too young to marry. \"Now, tell me--we have heard much of that bad business at Cholula--tell me, do you think that there was treachery on the part of the people, or was it a mere pretext of the Spaniards to fall upon the inhabitants, and sack the town?\" \"I am sure that treachery was intended,\" Roger said. \"We learned it from three people, a lady and two priests; and the Cholula nobles, themselves, when taxed by Cortez with their intention to fall upon us, admitted that the accusation was true. Besides, the whole people were under arms and ready to attack, and poured out under their leaders to the assault, the moment the first gun told that their intentions were discovered. No, there is no doubt, whatever, that a general destruction of the white men was intended; and although the punishment inflicted was terrible, I cannot say that it was not justified, under the circumstances. \"Moreover, we knew that there was a Mexican army, lying but a short distance away, in readiness to enter the town and join in the attack against us.\" \"It was a terrible error, as well as a crime on the part of the emperor, if it be true that he was concerned in it,\" Cacama said. \"If so, he took no one here into his counsel, but acted wholly on the advice of the priests.\" \"That is where the general considers the danger lies. He would trust the caziques, for men of rank in whatever country are faithful to their word, and do not pretend friendship when they mean hostility. Were Montezuma guided by them, there would be no fear of treachery; but as he has given himself to the priests, and they can, by means of the oracles, persuade him to almost anything, Cortez feels that the danger is great.\" \"Well now, we had better to rest,\" Cacama said, rising. \"You are to start with the first streak of light, so as to be back before the sun is high, and it is long past midnight now. \"Cuitcatl, it would, I think, be well for you to accompany our friend. A rumor may have got abroad that he is again our guest, and those who longed for his blood, before, may long for it again. I would not that he should cross the lake unattended.\" \"I was about to propose doing so,\" the young noble said. \"I know the priests, and can guess that, at present, a white victim is what they most of all desire. Therefore, I will certainly accompany him to Mexico.\" Roger and his Mexican friend were taken across the lake in a canoe, rowed by four strong men. It was one of the private canoes of the palace, without the royal insignia; used for the conveyance of messengers, and built for speed. She took them across to the capital in a very short time and, entering one of the canals, landed them close to the palace occupied by the Spaniards. The sentry at the gate was surprised at the height of the young Aztec chief who approached, and did not recognize him until he spoke. Even then he would not let him pass, until he called an officer. \"I have been absent by the order of the general,\" Roger said. \"I have no doubt it is all right,\" the officer replied, \"but I must take you to him.\" Cortez had only just risen, for the hour was still very early, and the sun was but now showing himself over the mountains to the east. He was taking a cup of chocolate. \"That is all right,\" he said to the officer, as soon as he saw Roger. \"Sancho has been absent upon my orders.\" He then called Malinche from an adjoining room. \"You are back earlier than I expected,\" he said, as soon as the interpreter entered. \"Have you any serious news?\" \"No, General. Cacama is himself friendly. He is unaware of any treacherous designs on the part of the emperor, but admits that the situation is a critical one, and that it is possible the influence of the priests may again induce Montezuma to take a hostile action.\" \"Do you think we could count upon him as an ally?\" \"I think not, sir; although I have not as yet sounded him. Cacama has been very badly treated by Montezuma, and he by no means approves of the emperor\u0027s conduct throughout this matter, but I think that his patriotism would overcome his sense of private wrong. I can tell you more farther on. Cacama has invited me to stay with him, for the present, and I think I might be of more use to you there than here.\" \"I think so, too,\" Cortez said; \"and indeed, you have not yet entered my band regularly, like the rest. It is right that you should have freedom of action, especially as you are the only man among us who knows anything of the Mexicans; for even Marina knows nothing of this side of the mountains.\" \"Don\u0027t you think that you will run great risk in staying there alone?\" Marina asked, on her own account. \"Some danger, no doubt, Malinche; but I shall be on my guard, and Cacama will take precautions for my safety. Even the priests would not venture to seize me in his palace, and the Tezcucans are far less bigoted than the people of this city.\" \"I do not think he will be in much greater danger there than he would be here,\" Cortez said, when these remarks were translated to him. \"We are all in danger. We are sitting on a mine that may explode any minute. The young fellow is sharp witted, and with his knowledge of the language and the people can be trusted to take care of himself. \"Sancho, if anything should happen to us, and you should hear that we have been destroyed, I charge you to carry the news to the coast, and to order in my name that all shall embark on board ship and sail to Cuba. It would be useless to try to maintain a foothold here. Spain would avenge it, and with ampler means than mine carry out the conquest of this country.\" A few minutes later, Roger, having said goodbye to Juan and Pedro, and told them that he might be absent for some time, started to Tezcuco. They had scarcely left the town, when a canoe with six rowers issued from one of the canals and followed in their wake. \"See, they are after us!\" Cuitcatl said, looking back. \"Doubtless the Spanish quarters are closely watched, to see who enter and leave them; and the news that a tall young noble had entered was carried at once to the authorities, and the boat was got in readiness to follow when you left, and see who you were and where you were going. However, they will not overhaul us. I bade the officer in charge of the canoes last night to pick me out four of his best men, and in so light a boat we shall travel as fast as that behind us, although they have two extra hands.\" \"Yes, and they have four sitters,\" Roger said, looking back. \"No doubt they had orders to arrest you, and bring you back. They did not reckon on our speed. The two extra men destroy their chances of coming up to us, altogether. \"Row hard, men. I don\u0027t want that boat to overtake us.\" The paddlers redoubled their exertions, and the light boat almost flew along over the water. For a few minutes those in the canoe behind also did their utmost; but it was plain that they were falling behind, rather than gaining. Then one of the officials stood up, and shouted an order for them to stop. They were some distance behind, but the words could be plainly heard. The Tezcucans looked scared as they heard the words, \"In the name of the Emperor.\" \"Never mind them,\" Cuitcatl said. \"We are acting under the orders of our king. Besides, we are so far away that they cannot be sure their words are heard. If they have any complaint to make they can make it to Cacama, and he will answer them.\" The boat was soon out of hearing of its pursuer, who fell farther and farther behind, and was a good mile away when they landed at Tezcuco. \"Run the boat up and lay her by the side of the others,\" Cuitcatl said to the rowers. \"Then go at once to your homes, and say naught to anyone about the journey you have made. The officials will find out what they want to know as to whom we are, and will care nothing as to who were the individual boatmen who rowed us. Still, it is as well to keep silent. \"Of course, Roger,\" for the lad had asked him to drop the second part of his name, \"it will soon be known that you have returned here. With such numbers of persons in the palace, it cannot be hidden; besides, you are well known, by sight, to most people in the town.\" \"I quite see that, Cuitcatl, and perceive no good in trying in any way to conceal myself. These long legs of mine cannot be got rid of, and tell their story too plainly. However, it makes no difference. I shall be safe in the palace, and shall only go abroad in the daytime. They will not venture to try to carry off, openly, one known to be under Cacama\u0027s protection.\" Cacama, on their return, agreed with Roger that it was of no use to try to conceal his identity; and the lad, after washing the stains from his face and hands, took his accustomed place at the banquet, and was greeted by many of his former acquaintances. After the meal Cacama told him that, having heard from Bathalda of the wonderful shooting he had made with his great bow, he was desirous of seeing it; and that by his orders the forester, who had been sent for the evening before by Cuitcatl, had been directing some of the artisans to manufacture a weapon of similar strength. \"We will go and see how it is getting on,\" he said. Proceeding to the workshops attached to the palace, they found that the bow was finished. It was constructed of a very tough, but elastic, wood. Three slips of this had been placed together and bound with sinews. Bathalda ran forward when he saw Roger, and taking his hand carried it to his forehead. Roger shook the stout fellow\u0027s hand, heartily. \"He is a brave fellow,\" he said to Cuitcatl, who had accompanied them, \"and fought manfully and well. Had he not guarded my back during the fight, I should not be here to tell the tale, now.\" \"We have made the bow according to our instructions,\" the head of the artisans said respectfully to the king; \"but it does not seem to us possible that anyone can use it. Three of us have tried together to string it, but in vain.\" \"It is a good bow,\" Roger said, examining it. \"Do they shoot with weapons like that, over there?\" Cacama asked, nodding in the direction of Mexico. \"No,\" Roger said, \"for the most part they use crossbows, and their bows are much smaller than this. The English are the only people who use bows like this. They are our national weapons, and outside our island there are few, indeed, who can even bend them. As to the stringing, it is knack rather than strength. See here,\" and taking the bow, which was just his own height, he placed his knee against it, bent it and slipped the string into the notch, with ease. Then holding it at arms length, he drew it till the string touched his ear. \"It is a great deal stiffer than that I made before, Bathalda; and is about the strength of those we use at home. Now for the arrows.\" These had been made by another set of men, and were an inch or two over a yard in length, with copper tips. While he was examining them Cacama had taken up the bow, but though a strong and vigorous man for his race, he could bend it but a very short distance. \"It is a wonderful weapon,\" he said, \"and I should not have thought that mortal man, whatever his color, could have used it. Now, let us go down into the practice yard. \"Cuitcatl, do you fetch the queen and her ladies, to look on.\" \"I am no great marksman, Prince,\" Roger said. \"I am perhaps somewhat better than an average shot, but I have seen marksmen who could do feats that I would not even attempt.\" They descended to the piece of ground, where many of the young nobles were engaged in shooting, and in practice with arms. Roger had often been there before, but had carefully abstained from taking any part in the mimic contests; for he knew that men who are beaten sometimes feel malice, and he was anxious to keep on the best terms with all. Cuitcatl had often urged him to try a bout with himself, or others, with the sword; but this, too, he had always declined, and his friend had supposed that he was aware his skill was by no means equal to his strength. But now the Spaniards had proved to the Mexicans the fighting powers of white men, Roger had no longer any reasons for hanging back. As soon as he was seen approaching with Cacama, the Mexicans abandoned their sport, and gathered round. The story of the defeat of a band of Montezuma\u0027s soldiers by the white man had been whispered abroad, and Cuitcatl had mentioned to his friends what he had heard, from Bathalda, of the mighty bow Roger had used; but when they saw the weapon with which he was now provided, their wonder was to a large extent mingled with incredulity. They passed it from hand to hand, tried but in vain to bend it, and murmured among themselves that the thing was impossible. \"What will you have for your mark,\" Cacama asked. \"One of these targets will do well enough,\" he said, pointing to those at which the Mexicans had been shooting. These were boards about five feet six in height, and some fourteen inches in width, presenting the size of a man. They were painted white and supported by a leg hinged behind them. The distance at which the Mexicans had been shooting was about forty yards. Roger stepped a hundred from one of them, and made a mark upon the ground. \"An English archer would laugh at a target like that,\" he said to Cacama, \"but it is nigh three years since I practiced. I have seen men who could with certainty, at this distance, hit a bird the size of a pigeon sitting on the top of that target, twenty times in succession, and think it by no means extraordinary shooting.\" The queen and some of her ladies now appeared upon a terrace looking down into the courtyard. Roger took the bow, fitted an arrow to the string, and drew it to his ear--a murmur of astonishment rising from the Aztecs. There was a pause for a moment, and then the arrow sped. There was a sharp tap as it struck the target, and stood quivering in it just in the center line about four feet from the ground. \"The bow is an excellent one,\" Roger said, and quickly discharged two more arrows, both of which struck within two or three inches of the first. As it was the power of the bow, rather than his own shooting, that Roger wished to exhibit, he now had the target removed a hundred yards farther back, and others placed one on each side of it. At this distance he discharged three more arrows, shooting more carefully than before. All three struck the boards, although at varying heights; and a shout of surprise arose from the lookers on. \"How far will it carry?\" Cacama asked. \"It might carry another hundred yards, but the aim cannot be depended upon at over two hundred yards, even by good shots,\" Roger said. \"Of course, the longer ranges are useful for firing at a body of men. I should say that large tree would be about the extreme range. If you will send two men down to it, I will see whether I can shoot as far. We should not see the arrow from here. Will you tell them to stand one on each side of the tree, but well away from it? There is no saying where the arrow may go, at this distance.\" When two of the attendants had taken their places, twenty or thirty yards from the tree, Roger drew the bow to the fullest and, giving to the arrow the elevation he had been taught, as most suitable for an extreme range, unloosed the string. The arrow, which was of dark wood, glanced through the air. The eye could follow it only a short distance. No sound was heard this time, but in a few seconds the Mexicans were seen running towards the tree. \"Do not touch the arrow,\" Cacama shouted; and then, followed by the crowd, for the numbers had greatly increased, as the news of what was going on had spread through the palace, he walked forward to the tree. The massive stem was more than four feet in diameter, and within a few inches of the center, and at a height of three feet from the ground, the arrow was sticking. The Mexicans were silent with astonishment, mingled with a certain amount of awe, for shooting like this seemed to them to be supernatural. \"And you said you were not a good shot!\" the king said. \"It was a pure accident,\" Roger asserted. \"I might shoot twenty arrows, and not hit the tree again. I had not the least idea that I should do so. I only wished to show you how far a well-made bow would send an arrow, when drawn by an Englishman.\" Cacama ordered the arrow to be left in the tree, and a large stone to be placed at the spot from which Roger had fired. \"They shall remain,\" he said, \"as a memento of this shot. I will introduce, among my people, the custom which you say prevails in your country; and every child shall be bound to practice, daily, with bows and arrows. I do not think that any of our race will ever come to use such a weapon as that, but they may at least learn to bend bows greatly stronger than those we are accustomed to use.\" \"They will doubtless do so,\" Roger said. \"It is a matter of practice, and of strengthening certain muscles of the right arm; for a man far stronger than I am would be unable to bend that bow, had he not been trained to its use from the earliest age. \"I should recommend, Prince, that you not only give the order you have spoken of, but institute a monthly gathering, with prizes for skill, and honors to the best marksmen. In this way all would take an interest in the sport, and it would become as popular, among your youth, as it is with us.\" Again Roger\u0027s bow was passed round. It had seemed to bend so easily, in his hands, that those who had not tried it before could scarce credit its strength, until they had handled it; but even the most powerful men found that they could only draw the arrow a few inches. As they walked towards the terrace, upon which the queen and her ladies were standing, Cuitcatl said: \"I had intended to ask you, Roger, to try a bout of sword play with some of us; but I will not do so now. After what we have seen of the strength of your arm, I should be sorry, indeed, to stand up against you, even with blunted weapons or with sticks; for there would be no resisting a downright blow. The news came to us of the terrible blows struck by the Spaniards, and how they clove through sword, helmet, and head. I scarce credited them before, but now I can well believe them to be true.\" \"Well, Maclutha,\" Cacama said; \"what think you of what you have seen? No wonder those who met with the white men, in battle, said that they had supernatural strength; and that even the sturdy Tlascalans could not resist them. We will have the bow hung up in the armory, with a great gold chain; which shall be the reward of the first man who can, like our friend, draw the arrow to the head.\" \"It is wonderful,\" the queen said; \"and it would be well indeed if, as you say, the youth of Tezcuco could shoot like that.\" Amenche said nothing, but her cheeks were flushed with excitement and pleasure. That evening, when Cacama was conversing alone with Roger, he said: \"My friend, you know that the Tlascalan caziques have given their daughters as wives to some of the Spaniards. I was talking to you of marriage, last night, and what you said about your age was ridiculous. You are a man, and a warrior. I now offer you the hand of my sister Amenche. She loves you, as Maclutha and I have seen for some time. From what you said, I gather that your religion would not regard the ceremony as binding, did she not accept your God; but I do not think she would raise any objection on that score, seeing, as we all do, that your God has proved more powerful than ours.\" Roger was struck with astonishment at the offer. He had regarded marriage as a matter not to be thought of, for many years; and until lately he would have said that, if he ever did marry, it would be the little cousin who had, three years before, said goodbye to him at Plymouth. But of late he had felt the charm of this beautiful little princess; and since the night when she had come down to say farewell to him, in the garden, and he had felt her hand tremble in his, and had seen a tear glisten on her cheek in the moonlight, he had thought a good deal of her. The chances of his ever returning to England were comparatively slight. Dangers of all kinds surrounded him. The Spaniards might be attacked and massacred at any moment, and if so, he would probably share their fate. If, however, he was married to this Mexican princess, and a brother-in-law of the King of Tezcuco, he would be regarded as one of the people. His position would be a high and honorable one, and although his life would be far different from that to which he had hitherto looked forward, it might be a very happy one. He sat in silence for two or three minutes after Cacama had ceased speaking, and then said: \"Forgive me, Prince, for not responding, at once, to an offer so far above my deserts, and of the honor of which I am most deeply sensible. There could be no greater happiness, for a man, than to be the husband of one so fair, and in every way charming, as the Princess Amenche; but your offer came upon me altogether as a surprise. As I have told you, I have hitherto regarded myself as still a lad, and marriage as an event not to be thought of for years; but as you do not regard my youth as an objection, there is no reason why I should do so. \"It is of the future that I rather think. It seems to me, now, that I could be content to settle down for life here, with so charming a wife; but I cannot say that I might always be of that mind. The love of country is strong in every man, and the time might come when, if opportunity offered, I might long to return home to England.\" \"That I have talked over with the queen, and with Amenche, herself,\" Cacama said. \"My sister naturally would be sorry to leave her own country, but if the time came that you should wish to return home, she would not hesitate to make the sacrifice, and to accompany you. A Mexican woman, when she loves, is ready to give up everything.\" For a moment Roger turned the matter rapidly over in his mind, and saw that, even were he disposed to refuse Amenche\u0027s hand, which indeed he was not, it would be almost impossible for him to do so. It would be a deep offense to this friendly prince. It would be a cruel blow to the girl, who had confessed her devotion for him. As to Dorothy, she would have deemed him dead years ago; and should he ever return, he would find that she had long since been married; for the daughters of the wealthy merchant, Diggory Beggs, would not want for suitors. He held out his hand to the prince. \"I accept most gratefully your offer, Cacama, and promise that, so far as in me lies, I will do my best to render your sister happy, and to prove myself worthy of her choice.\" \"I am heartily glad,\" the prince said warmly. \"I love my sister, and I have watched you closely. I believe you to be worthy of her, and I am sure that in you I shall find, not only a friend and a brother, but a wise counselor and a valiant leader of my troops; and that, with your advice, I shall be able to advance my people in the arts of peace as well as war, and perhaps to win back my father\u0027s possessions. \"As to the question of religion, of which you spoke, there is indeed no difficulty. My grandfather, the great Nezahualcoyotl, the wisest and most powerful of our monarchs, did not believe in the Aztec gods. He built a great temple which he dedicated to the Unknown God. Here he worshiped, himself, and did his utmost to induce his subjects to abandon the cruel worship of the Aztec gods. He forbade all sacrifices, even of animals, and permitted only flowers and sweet-scented perfumes to be offered up on the altars. When, after his death, the Aztec power increased, and that of Tezcuco diminished, the people again embraced the cruel faith of the Aztecs. Neither my father nor myself have been strong enough to set ourselves against the priests; but he, as well as I, believed that my grandfather was right, and that the Unknown God is the ruler of the world. My sister has of course, been educated by the priests; but she knows my father\u0027s opinions, and my own. She has a horror of the human sacrifices, and believes that there must be a greater and better God than those who are said to delight in blood. So you need not fear that she will make any difficulty as to accepting what you tell her of the white man\u0027s God. \"Now I will fetch her in to you. I think it will be better to allow a short time to pass, and to see how matters go in Mexico, before announcing to others your approaching marriage. If any misfortune should happen to the Spaniards, I should at once publish the news, and have the ceremony performed without loss of time; proclaiming to the people that, although white, you are not of the same race as the Spaniards. If matters go on well, Montezuma himself will doubtless be present at his niece\u0027s marriage; and I shall, of course, invite Malinzin and all his officers.\" The prince left the room, and in a few minutes returned with his wife, the latter leading Amenche by the hand. \"My friend, Roger Hawkshaw,\" the young king said, gravely; \"I hereby promise to bestow upon you the hand of my sister Amenche. May you find in her a good, loving, and obedient wife.\" \"I, on my part,\" Roger said, taking the girl\u0027s hand, which the queen held out to him, \"promise to be a true and loving husband to her.\" The girl, who had not raised her eyes since she entered the room, looked up at the tall figure with an expression of perfect confidence. \"I will be true and obedient,\" she said softly; \"and will love you all my life.\" \"What do you do next, in your country?\" Cacama asked, with a smile. \"This is how an engagement is sealed, with us,\" Roger said; and drawing the girl up to him, he stooped and kissed her lips. Three days later, as Roger was sitting with Cuitcatl, an attendant entered and said that the king wished to see them, immediately. They hastened to the royal apartment. Cacama was walking up and down, with an angry frown upon his face; while the queen and princess were sitting on the couch, pale and agitated. \"Strange news has come from Mexico,\" Cacama said. \"The white men have seized Montezuma, and are holding him prisoner in their quarters. Did anyone ever hear of such an outrage? Mexico is in a state of consternation, but at present none know what to do.\" \"It seems incredible,\" Roger exclaimed. \"Are you sure of your news?\" \"Quite certain,\" the prince replied. The news was indeed true. Cortez had found his position unbearable. He believed that the attack upon the Spaniards, on the coast, as well as the meditated treachery at Cholula, were the outcome of the emperor\u0027s orders. His native allies had heard rumors, in the town, that the bridges across the canals were all to be raised; in which case the Spaniards would be prisoners in their palace. He was in the Mexican capital, but he had as yet effected nothing towards the conquest of the country. At any moment he might hear of the landing of an expedition from Cuba, that his authority was revoked, and that another was to reap the benefit of all he had done. He therefore called a council of his most trusted officers, and discussed the situation with them. All agreed that some step must, at once, be taken. Some were in favor of starting that night, and making their way out of the city before a sufficient force could be collected to oppose their retreat; while others were of opinion that it were better to retire openly, with the consent of Montezuma, whose conduct since they had reached the city appeared to be most friendly. Cortez pointed out that both these methods would be retreats, and the whole country would probably rise against them. Moreover, even if they reached the coast, they would have sacrificed all they had won by their valor and sufferings. He proposed a measure which astonished even his boldest companions; namely, that they should go to the royal palace, and bring the emperor--by persuasion if possible, by force if necessary--to their quarters, and there hold him as a hostage for their safety. The proposal was agreed to, and on the following morning Cortez asked for an interview with the emperor, which was at once granted. He proceeded to the palace with his principal officers, ordering the soldiers to follow in groups of twos and threes, so as not to attract particular attention. Montezuma began to converse with his usual courtesy, but Cortez roughly cut him short, and charged him with being the author of the attack upon the garrison at the port. Montezuma indignantly denied this, and said that he would send at once, and arrest the author of the attack. Cortez replied that it was necessary, for their safety, that Montezuma should come and reside among them. The emperor was thunderstruck at the proposal; but the soldiers crowded in, loud and threatening words were used, and Montezuma, in fear of his life, gave way. Had he possessed any of the courage with which he was credited, in his youth, he would have called his guards and nobles around him, and died fighting. Having once given in, he assumed the air of having done so voluntarily, and ordered his litter to be brought. In the meantime his attendants, and the nobles who had been present, had spread the news through the city. The Mexicans, catching up their arms, ran to the rescue of their monarch; but the Spaniards closed round the litter and, had a blow been struck, the emperor would doubtless have been murdered. Montezuma exhorted the people to be tranquil, assuring them that he was going willingly; and the Mexicans, accustomed to implicit obedience, and fearing that harm would come to the emperor if a struggle began, drew back and allowed the Spaniards to pass; and Montezuma was conveyed, a prisoner, into the palace occupied by the Spaniards. The act was one of almost unparalleled boldness; but as performed upon a monarch who was the host of his assailants, and with whom they were previously on the most friendly relations, it was an act of treachery, and reflects dishonor upon the fame of Cortez. At the same time, the position occupied by the Spaniards was so strange, and even desperate, as to palliate, though it cannot excuse, such a course of action. There is no reason to believe that Montezuma intended to act treacherously. But he was under the domination of the priests, and had he again changed his mind, as he had already several times done, nothing could have saved the Spaniards from absolute destruction. No honorable man would have acted as Cortez did; but Cortez was a rough soldier, and moreover, firmly held the doctrine, at that time and long afterwards held by the Spaniards in their dealing with those of other religions, that faith need not be kept with heretics and heathen. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3128/86037.html","bookId":896,"book":{"id":896,"title":"By Right of Conquest","description":"简介： On March 3rd, 1516, the trading vessel the Swan dropped anchor at Plymouth. She would in our days be considered a tiny craft indeed, but she was then looked upon as a large vessel, and one of which her owner, Master Diggory Beggs, had good reason to...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3128","creation":"Aug 1, 2019 12:23:48 AM","modification":"Aug 1, 2019 12:23:48 AM"}}
