{"id":38653,"no":25,"title":"CHAPTER XXIV","content":"FREYBERGER, also, had received a telegram that morning, or, at least, the Chief of the Criminal Investigation Department had received it and communicated its contents to him. \\n\\n \\n\\n “You can take the case entirely into your own hands, Freyberger,” he said. “You have certainly done well in it heretofore, the connexion between the two crimes seems to me almost made out, should the Paris people identify the portrait we have sent them as that of the supposedly murdered man, Müller, the connexion will be made certain. Your insight has been very praiseworthy, and if the portrait is identified we can at once place our finger upon the person who, if he is not the author of the crime, we are investigating, is, at least, so bound up in it that his capture must place the whole matter in a clear light. \\n\\n \\n\\n “But will we be any nearer to his arrest? You object to his portrait being published in the papers, yet you know very well the value of that step. \\n\\n \\n\\n “Take a big morning and evening paper; a portrait published in these papers is a portrait, so to speak, placarded on the sky. A million pair of eyes are at once placed at our service.” \\n\\n \\n\\n “Quite so, sir,” replied Freyberger, “I am the last man to undervalue the power of the Press. I quite know that if we were to publish the portrait we should have half a million amateur detectives at our service in half a dozen hours. Unfortunately, it is my firm conviction that in an hour after publication, our man, who is now, I fancy, walking about the world catchable, in the pride of his infernal genius, in an hour, I repeat, he would be uncatchable. He would turn himself into air, into water, into smoke. He would become some one else. He is illusion materialized. \\n\\n \\n\\n “Even if we circulate his portrait amidst the force, within a few hours some man answering his description is sure to be arrested, sure to be released, and the affair will get wind and our Jack-o’-lanthorn will know that some one, not answering the description of Gyde, is being sought for, and he will say to himself ‘they have found out something, they suspect, perhaps they know,’ and he will dive, efface himself, never be seen again. \\n\\n \\n\\n “I believe the use of ordinary methods against this person will be of no avail. We must trust to chance. And I have a strange belief, rather a sort of instinct, that the chance will come to us through the Lefarge case.” \\n\\n \\n\\n He ceased, for at this moment a sergeant knocked at the door, bringing a broad sheet of paper on which was some writing. \\n\\n \\n\\n He handed it to the chief and withdrew. It was a message from Boulogne and read: \\n\\n \\n\\n “Boulogne-sur-Mer. \\n\\n \\n\\n “Have received communication through Hamard. Will be at the Langham Hotel this evening at seven, bringing all evidence with me. \\n\\n \\n\\n Cécile Lefarge.” \\n\\n \\n\\n “The omen is good,” said the chief, with a slight smile. \\n\\n \\n\\n Before Freyberger could reply the door opened and another officer appeared with a message. It was from the prefecture. \\n\\n \\n\\n “Photograph sent by your agent identified as that of Wilhelm Müller, assassinated December 30, 18—, No. 110 Rue de Turbigo. Duplicate of photo has been in this office since the crime was committed.—Legendre, Chief of Identification Bureau, Prefecture of Police.” \\n\\n \\n\\n The chief’s eyes sparkled for a moment with pleasure. The way in which Freyberger had connected and riveted the two cases, the manner in which he had now, with terrible and mathematical certainty, proved Müller, alias Kolbecker, alias Klein, the moving spirit in these two great tragedies, and almost to a certainty the criminal, since Lefarge could have no thinkable connexion with the Gyde case and Gyde no connexion with the Lefarge case; all this pleased his artistic instinct. He said nothing, but simply read the message, handed it to Freyberger, who read it in turn and gave it back. \\n\\n \\n\\n “Thank you, sir,” said Freyberger, “and now, if you will permit me, I will go home. Nothing of importance is likely to happen between now and seven o’clock. I have some pressing business to attend to.” \\n\\n \\n\\n “And what may that business be?” inquired the chief. \\n\\n \\n\\n “Sleep, sir. I have not closed my eyes for forty-eight hours.” \\n\\n \\n\\n “Go and attend to your business, then,” replied the other, “and if anything of vital importance turns up, I will send for you. I am pleased with you, Freyberger, and with the way you have conducted this case. Go and dream you have caught this will-o’-the-wisp, and may your dream turn true.” \\n\\n \\n\\n “I never dream, sir,” replied Freyberger, and, bidding the chief good morning, he departed. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1933/55482.html","bookId":775,"book":{"id":775,"title":"The Cottage on the Fells","description":"简介： WELL, said Comyns, I cant see for the life of me what makes you want to linger on in this benighted hole.There are a great many things in this world we cant see, replied Hellier....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1933","creation":"Aug 1, 2019 12:19:17 AM","modification":"Aug 1, 2019 12:19:17 AM"}}
