{"id":38659,"no":31,"title":"CHAPTER XXX","content":"FREYBERGER had slept scarcely three hours during the night, yet he looked quite fresh. \n \n He had done a tremendous lot of work in the way of putting out nets. \n \n He had as complete a list as could be obtained of the lodging-houses in the neighbourhood, every early morning coffee stall in Kensington and Bayswater had been kept under surveillance, also the newspaper shops. The tube stations at Notting Hill Gate, Holland Park, Shepherd’s Bush, and Queen’s Road, Bayswater, had been watched, and the result, up to this had been the arrest of one man who had easily proved his identity and the fact of his innocence. \n \n The bother was that Klein’s description as to dress could not be given. Only the fact that he was pale, clean-shaven, of the middle height and spoke with a German accent. \n \n “How fortunate,” cried Hellier; “you are the very person I wished most to see.” \n \n “Mr Hellier, I believe,” replied the other, who did not seem at all enthusiastic at the meeting. “What can I do for you?” \n \n “Will you walk a few paces down the street?” \n \n “Certainly.” \n \n “It’s this way,” said Hellier. “I read in the papers this morning of a crime.” \n \n “Which?” \n \n “The murder of Mr Goldberg.” \n \n “Yes, yes.” \n \n “You remember what I said to you last night?” \n \n “Perfectly.” \n \n “Well, it occurred to me that this was the crime we were waiting for.” \n \n “I was unaware that I was waiting for any crime,” said the other. \n \n “Well, you remember my predicting that a crime of this nature would occur?” \n \n “An easy prediction in London, where we have a murder every second day.” \n \n “Not strangulation without an apparent motive.” \n \n “Well, well; what do you wish to say about it?” \n \n “Well, convinced in my own mind that the author of this crime was also the criminal in the Gyde and Lefarge cases, I determined to come up here and look about.” \n \n “To play the r?le of an amateur detective, in short.” \n \n “Yes, but please don’t misunderstand me. My object is not curiosity. I will be frank with you. I love Mademoiselle Lefarge, and I can never hope to marry her till her father’s name is cleared.” \n \n “You wish to marry this lady and cannot do so till her father’s name is cleared. Is that what I understand you to say?” \n \n “Yes.” \n \n “Well, shall I tell you how you can best help to clear her father’s name?” \n \n “Yes.” \n \n “Go home and forget about it all; leave the matter in the hands of professional men who know how to act. Nothing interferes so much with us as interference.” \n \n “Perhaps, but you know chance sometimes gives a clue where intelligence fails to find any. What would you say if I told you that I believed I had seen Klein, the man you are looking for, this morning?” \n \n Freyberger started, but recovered himself instantly. \n \n “I would say that I believed you to be mistaken.” \n \n “Yet I have seen a man whose face closely resembled that portrait you showed us last night.” \n \n “Where?” \n \n “In St Ann’s Road, close to St James’s Road. I strolled along it by chance this morning, after visiting the scene of the murder, and, coming out of one of the houses, I saw this man.” \n \n “Yes?” \n \n “I followed him to the High Street. There he got on to a motor-omnibus and I lost him.” \n \n “You lost him!” \n \n “It was not my fault, for I could not stop the omnibus and there were no cabs.” \n \n “It does not in the least matter,” said Freyberger, in a tone of assumed indifference, “for it was a thousand to one you were mistaken.” \n \n “If that is your opinion,” said Hellier, angry at the other’s tone, “there is no use in our discussing the matter further. I wish you good day.” \n \n “Stay a moment,” said Freyberger. \n \n “Yes.” \n \n “You say you saw this man coming out of a certain house. Can you recognize the house again?” \n \n “Yes.” \n \n “Well, as a matter of form, I will accompany you there.” \n \n Hellier hesitated a moment, then he conquered his sense of pique and turned in the direction of Hammersmith. \n \n They walked, scarcely exchanging a word. Freyberger’s mind was filled with anxiety, expectancy and a sense of deep irritation. \n \n There was something exasperating to him about Hellier. This outsider had already cast so much light on the case; was it destined that he should cast more? \n \n “This is the house,” said Hellier, when they had reached the place. \n \n “Empty,” replied Freyberger, looking over the railings. \n \n It was the only detached residence in the road, all the other houses were semi-detached. \n \n The garden was neglected and the front windows blindless and dusty. \n \n Freyberger opened the gate and, followed by Hellier, walked up the path to the front door. He knocked and rang, but there was no reply. \n \n “Let’s try the back,” said Freyberger; “some people live in the back premises and only keep a hall door for ornament.” \n \n But no one, apparently, lived in the back premises of No. 18 St Ann’s Road. \n \n A glassed-in verandah ran along the whole of the back. \n \n Freyberger tried the verandah door, it was locked. Some green shelves, containing a few empty flower-pots, were visible; against one of the shelves stood a hoe, on the blade of the hoe some dark brown traces of earth proclaimed to the eye of the detective that the instrument had been used quite recently, and not for hoeing but for digging. \n \n “There is no one here,” said Freyberger. \n \n “No one now,” replied Hellier, “but there has been some one.” \n \n “Oh, yes, no doubt; one might say the same of Sodom and Gomorrah, or Pompeii.” \n \n “If Klein has been here, if this is one of his hiding places, he may come back.” \n \n “If,” replied Freyberger. \n \n They were walking back down the garden path. \n \n At the gate Hellier made one last attempt to infect the detective with his own idea. \n \n “Could you not get a search warrant and search the place?” \n \n This remark completely broke Freyberger’s temper down, and the German came out. \n \n “Search warrant! You talk like a child, not like a man. Warrant to search for what? Flower-pots? What I will do in the case I will do. I wish for no interference. I wish you good day.” \n \n He turned to the left, towards Malpas Road. Hellier to the right. \n \n “Fool,” thought Hellier, “pig-headed ass; no matter—wait.” \n \n “Swine-hound,” thought Freyberger; “directing me what to do! Search warrant!” \n \n Freyberger turned the corner, walked a hundred yards down Malpas Road and then came back. \n \n Hellier was not in sight. The detective waited for a moment or two to make sure, and then approached No. 18. \n \n He entered the gate, closed it behind him, and made for the back garden. \n \n Here he stood for a moment, looking about him with eager eyes. Then he began searching about on the ground attentively, as a person searches who has dropped a coin. \n \n There was a fairish sized grass plot, on which the grass was rank and long. A gravelled walk lay round it, and a flowerless flower bed between the walk and the garden wall. \n \n There was no sign of a bootmark anywhere, though the ground was soft and there had been no frost on the previous night. \n \n The gravel was disturbed on the walk leading to the verandah, but that was nothing. \n \n In that portion of the garden where digging was possible there was no sign. Yet the hoe had been used quite recently, and a sure instinct told him that it had not been used in the front garden, where observation was possible, but here, in this place that was overlooked by nothing but blind walls and the back windows of an empty house. \n \n Suddenly his eye was struck by an object upon the flower bed by the rear wall. \n \n A half-withered cabbage leaf. There were withered leaves and to spare in the garden, but this was the only cabbage leaf. Nothing looked more natural or in keeping with the general untidiness of the place. A thousand men hunting for traces would have disregarded it. \n \n Freyberger walked towards it and picked it up. \n \n The bit of ground it had covered had been disturbed. \n \n In a moment, digging with his naked hand, he had unearthed a flat, morocco leather-covered box. He opened it, it was a jewel case and empty. Upon the silk lining of the cover was the name and address: \n \n “Smith and Wilkinson, Regent Street.” \n \n Smith and Wilkinson, Sir Anthony Gyde’s jewellers. \n \n He unearthed another box, and yet another. \n \n The sweat stood out in beads upon his forehead. \n \n There was something in the Gyde case that affected him as he had never been affected before. Perhaps it was some effluence from the obscure and diabolical mind with which he felt himself at war; perhaps it was the extraordinary intricacies of the pursuit, and the foreknowledge that the creature against whom he had pitted himself was at once a demon, a genius and a madman. Perhaps it was on account of all these reasons that, when he unearthed these recent traces, his soul turned in him and a furious hunger and hatred filled his heart. \n \n The hound hates the thing he is pursuing. The lion hates the buck. All hunting is an act of vengeance; not for food alone does the pursuer chase the pursued, but from some old antipathy begotten when the world was young. \n \n At times Freyberger, in his unravelling of the Gyde case, was seized by an overmastering desire to have his hands upon the creature he was pursuing and to drag him to his death. \n \n It is one of the laws of mind that the ferocity of the pursuer increases at each double and shift of the pursued. \n \n Carefully searching with his hands in the soft earth and finding nothing else, Freyberger smoothed the soil, replaced the cabbage leaf and carefully effaced his traces on the gravel of the walk. Then, with the jewel cases in the pocket of his overcoat, he approached the house. \n \n He examined the lock of the verandah door. The affair was so shaky that he could have burst it in with a kick, but violence was the last thing to be used. He drew from his pocket what the thieves of Madrid term a “matadore”; what the Apachés of Paris term a “nightingale”; what an honest man might call a piece of thick wire about a foot long, but of such material as to be fairly easily bent or straightened without danger of fracture. \n \n He bent one end of this piece of wire and introduced it into the lock, just as a surgeon introduces a probe into a sinus. Having explored the mechanism, he drew out the wire, rebent it, introduced it, and with a turn of his wrist opened the door. \n \n Then he carefully pushed the bolt of the lock back, entered and pulled the door to. \n \n There was nothing in the verandah, with the exception of the flower-pots, the hoe, and an old watering pot that had lost its rose. \n \n The door leading into the house gave upon a passage floored with linoleum. On the right lay a room entirely destitute of furniture, on the left a sitting-room decently furnished, with the embers of a fire still smouldering in the grate. \n \n The remains of some food lay upon the table in the middle of the room, also upon the table a copy of The Daily Telegraph of that day. \n \n This, then, was the den of the beast, the home of the demon. Nothing at all pointed to the fact. It was just the sitting-room of a man in somewhat reduced circumstances, an honest man, or a rogue, as the case might be. \n \n There was a tobacco jar on the mantelpiece, and in it tobacco and a bundle of cigarette papers; a pair of old slippers stood beside the armchair on the right of the fireplace. \n \n A pile of newspapers stood in one corner of the room, and in another lay an old valise. \n \n Freyberger opened the valise. There was a suit of clothes in it, nothing else—a frock coat and waistcoat and a pair of trousers. \n \n They were evidently the production of a first class tailor, though the little squares of glazed linen, bearing the customer’s name, which all good London tailors affix to their productions, both under the collar of the coat and inside the strap of the waistcoat, had been removed. \n \n Freyberger returned the things to the valise and replaced it in the corner, then he began a minute inspection of the room. \n \n He examined the pile of newspapers. They were all recent and dating from the day after the murder committed in the Cottage on the Fells. Daily Telegraphs, Daily Mails, Westminster Gazettes, every sort and condition of newspaper, and in each of them was a report, more or less full, more or less varying, of the Gyde mystery. \n \n He returned them to their corner and resumed his search of the room, examining every hole and cranny, lifting the hearthrug and fender, exploring the contents of the trumpery vases on the chimneypiece and finding nothing of much importance, if we except the sheath of a case knife lying behind one of the vases. \n \n He left the room and went upstairs to the bedrooms. They were all empty, clean swept and destitute of anything to hold the eye. \n \n The person he was in pursuit of, if he lived in this house, evidently slept upon the old couch in the sitting-room, and did not trouble much about the conveniences of life. \n \n Freyberger returned to the sitting-room, sat down in the armchair, just as though he were at home, took a cigar from his pocket and lit it. \n \n He was in the tiger’s den. At any moment it was quite within the bounds of possibility that the door might open and the terror, having let himself in by the verandah, enter the room. This was not what made Freyberger feel uneasy, but rather the thought that the unknown might have noticed Hellier following him and taken fright. \n \n Freyberger was quite unarmed; yet, had his sinister opponent entered the room at that moment, he would have arrested him just as he had arrested the Fashion Street murderer, and borne him, without doubt, in the same manner, to justice. \n \n But though absolutely destitute of fear, he was by no means destitute of caution; and as he sat smoking and waiting, he was revolving in his mind the question of calling in help. \n \n That involved leaving the house, and that might involve total failure. \n \n At any moment the quarry might return. He decided to wait. \n \n The door of the room and the door leading to the verandah were open, so that he could easily hear the approach of anyone from the back premises and quite as easily the approach of anyone from the hall door. \n \n It was after half-past two now. The house was deathly still; there was not even the ticking of a clock, the whisper of a breath of wind from the garden outside or the movement of a mouse behind the wainscotings to break the silence. \n \n Occasionally the rumble of a passing vehicle came from the road, nothing more. \n \n It was after three when the watcher suddenly started, sat straight up in the armchair and listened intently. \n \n The front garden gate had been opened and shut with a clang, a step sounded on the gravel and a loud double rap at the hall door brought Freyberger to his feet. \n \n He sprang from the room, came down the passage, undid the chain and bolts of the hall door, unlatched it, flung it open and found on the steps a telegraph boy. \n \n “Gyde?” said the boy, holding out a telegram. \n \n “Yes,” said Freyberger, taking it. \n \n The boy turned and went off whistling, and the detective, having rebolted the door, returned to the sitting-room with the telegram in his hand. \n \n He tore it open. \n \n “Handed in, London Street, Paddington, 2.15. Received, High Street, Kensington, 2.40. \n \n “Be sure to meet me at six.” \n \n That was all; no name, no address. Freyberger sat down in the armchair, with the telegram in his hand; he was thunderstruck. \n \n He reread it, then looked at the envelope. \n \n It was addressed: \n \n “Gyde, 18 St Ann’s Road, Kensington.” \n \n This thing quite upset his calculations. It was addressed simply to “Gyde.” It is not a common name; yet, of course, there were thousands of people of that name beside Sir Anthony. But, taking into account the jewel cases discovered, this telegram could have been sent to no one else but Sir Anthony. \n \n That meant that he was alive. Freyberger was convinced that the man seen by Hellier was Klein. If Gyde were alive, then he must have been staying here at No. 18 St Ann’s Road. Klein had also been staying here. Therefore Gyde and Klein were working in collusion. \n \n That would mean that Sir Anthony Gyde had entered into a partnership with this man, Klein—for what purpose? \n \n For the purpose of murdering some unknown man in a cottage on the Fells of Cumberland, and doing it in such a manner that Klein would appear to be the victim and he, Sir Anthony Gyde, the murderer. \n \n By extension it would mean that Lefarge, long ago, had entered into a similar partnership with Müller. The thing was preposterous. \n \n What, then, was the reason of this telegram? \n \n All at once an explanation of it flashed across Freyberger’s mind. Could it be a “blind?” Could Klein, suspecting Hellier of following him, suspecting a trap of the police, have sent this message? \n \n Freyberger had constructed Klein in his own mind from all sorts of fragments—the two photographs, his handwriting, his methods. The man, if he was a man and not a demon, was a master of subterfuge. \n \n The momentary insanity which had caused him to strangle Mr Goldberg would not in the least interfere with his reason. \n \n “Now,” said Freyberger to himself, “if he noticed Hellier following him, his reasoning would have run like this: \n \n “I left a man dead in a road close by here last night; I came out this morning and was followed by a man who was very much alive and who had something of the cut of a detective. \n \n “No one saw me last night. Why, then, did this man follow me? Can it be that they suspect that I, who was supposed to be murdered in Cumberland, am alive? Can they have circulated my description? It will be safer for me not to go back to No. 18 St Ann’s Road, and, to confuse Messieurs the Police, should they set a trap there, I will send a telegram to Gyde at that address, so that they may be reconfirmed in their idea that Gyde is still in the land of the living and Klein in the land of the dead. \n \n “No one saw me last night but the landlady, and her description will scarcely help the police against me: a tall man with a black beard. \n \n “Oh, damnation!” \n \n Freyberger suddenly leapt to his feet. \n \n “What possessed me! What possessed me to use such a simple artifice in the pursuit of this man, who, whatever else he may be, is half a logician, half a magician? \n \n “When he read that description in The Daily Telegraph this morning, what said he to himself? He said ‘Why this exact description of a man who was not there? \n \n “‘It is either the landlady’s terror that caused her to see what was not, or it is a device of the police. Now the police never use a device like that, which, after all, clouds a case to a certain extent, unless they have some important reason. \n \n “‘Of course, it may be simply due to the terror of the landlady, yet this false description, widely circulated, coupled with the fact that I have been followed, is, to say the least, suspicious.’ \n \n “That would be the line of his argument. Double fool that I was to forget that I was dealing, not with a criminal but a genius in crime. \n \n “This man forgets nothing, foresees everything. \n \n “I have been a fool, and yet—” Freyberger’s face unclouded a bit. “Is there another man in London who would have dug into his plans so deeply as I have done, connected the Lefarge case with the Gyde case and proved him indubitably the prime mover in both? \n \n “A few days ago I knew nothing about this man whom Sir Anthony Gyde is supposed to have murdered. What do I know now? What have I discovered by the aid of my own intelligence? I know his name, his face, his mind in part. I know that he has not been murdered by Gyde; I am almost assured that he has murdered Gyde. \n \n “I know that, under the name of Müller, he was not murdered by Lefarge; I am almost assured that he murdered Lefarge. I know that he is a homicidal maniac, whose pet method is strangulation. \n \n “I know that he has about him Gyde’s jewellery, of which he is sure to try to dispose. I know that he has lived here; I know the address where he lived in Howland Street. But my most important knowledge is the knowledge of the statue and the bent of his mind. \n \n “I have accumulated a mass of evidence that will damn him and crush him whenever I catch him, a mass of evidence that will clear two innocent men and expose to the world’s gaze the greatest and most complete villain that the world has ever beheld. Come, it is not so bad. I have committed a fault; I tried to match him at his own game of subterfuge, and that telegram was my answer. Alas! I am not so clever as he. But I have this in my favour, that I know much about him and he knows nothing about me. \n \n “I have seen his hand, he has not seen mine. \n \n “The question remains, what shall I do now? Remain here or go? Remain by all means, even if I have to remain till to-morrow morning. If he comes back I will seize him. If he does not come back, then I will know definitely that he has taken fright, that he suspects, and that he is, indeed, the murderer of Goldberg.” \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1933/55488.html","bookId":775,"book":{"id":775,"title":"The Cottage on the Fells","description":"简介： WELL, said Comyns, I cant see for the life of me what makes you want to linger on in this benighted hole.There are a great many things in this world we cant see, replied Hellier....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1933","creation":"Aug 1, 2019 12:19:17 AM","modification":"Aug 1, 2019 12:19:17 AM"}}
