{"id":38665,"no":37,"title":"CHAPTER XXXVI","content":"IT was May 9, the day after that on which Mr Davis, away up in Cumberland, had seen what he had seen upon the road to Blencarn. \n \n It had been a glorious day, but the beauty of the weather did not appeal to Freyberger. \n \n The Gyde case had hit him badly; after all his researches and calculations, after all the energy he had spent upon it, it had slipped away and left him. \n \n He had proved so much, yet he had done so little. \n \n That is perhaps the most exasperating thing about detective work. You have your case complete; the whole thing is reasoned out, plotted and planned; you have built round your man a complete structure, a prison that will hold him, you only want one little brick of evidence to complete it; you find your brick, put it in its place, and then open the door of your structure expecting to find your man inside and to lead him out to justice. \n \n He is gone. \n \n The warrant for his arrest is in your pocket; he has been shadowed for days past by your subordinates; he lodged last night at such and such a place and was shaved this morning by such and such a barber; he was having luncheon an hour ago at such and such a café; your subordinate tells you he is still there. You go to find him, and he is gone. \n \n He has scented arrest. \n \n Again, you may have your structure of evidence complete only for the one little brick. \n \n That brick is nowhere to be found. There are a dozen murderers known to the police, a dozen assassins walking the pavements of London convicted in the eyes of justice, yet they are immune. Their tombs are already constructed, but are incomplete, wanting just one, or maybe two, little bricks. \n \n In the words of the police, “No jury would convict.” \n \n In the case of Klein it was different. The case was complete against him of having been a prime mover in the Gyde and Lefarge affairs. Once safely lodged in gaol, Freyberger felt that the whole truth would be extracted from him. What a case it would be! What a triumph for the man who had worked in it and completed it single-handed. Whatever Klein’s diabolical methods might be, Freyberger was certain of one thing—that their extraordinary nature would astonish Europe. \n \n All that had to be done now was to capture this man—and he had vanished. \n \n It will be remembered that Freyberger had objected strongly to the publication of Klein’s photograph. \n \n Even still he upheld this objection, and the chief had not pressed the matter, having much respect for the opinion of his subordinate. But as week followed week, without sign or movement on the part of the man they were after, the patience of the chief began to give. \n \n On the evening of May 9 it snapped. \n \n “We have given him now a very considerable time,” he said, during a conversation with his subordinate. “We have given him a good long rope to hang himself with.” \n \n “Yes, sir,” replied the other, “and I know it has been by my advice.” \n \n “Well, what is your advice now?” \n \n “To give him a little more. Who knows, he may be, even at this moment, making the noose for his own neck.” \n \n “I will give him three days more.” \n \n “Three days?” \n \n “If he does not show himself in that time his portrait and description will be published broadcast. We have waited too long.” \n \n “I am sorry you think that, sir?” \n \n “Oh, I am not casting any reflection on your judgement. I believe with you that this man will efface himself, or try to efface himself, fully, when he sees his portrait in every news-sheet, but there is the chance that he will fail. Besides, Freyberger, I am not sure that the course we have already taken is one absolutely moral.” \n \n “How so, sir?” \n \n “We have refrained from alarming this man.” \n \n “Yes.” \n \n “By doing so we have, well, to put it plainly, given him the incentive to commit another murder.” \n \n “That is what I have been waiting for, sir, and I have no qualms at all in the matter. If this man lives, it is inevitable that he must murder. Far better is it that he should commit one more crime and be taken, than that he should escape now, take warning that he is watched, amend his methods and enter on a new campaign of infamy. \n \n “Besides, it is not at all inevitable that he should commit another murder. An attempt is quite sufficient. His next victim may be more fortunate than Mr Goldberg. His next victim may turn the tables upon him. Who knows? He may fall upon a sheep and find that he has tackled a wolf.” \n \n The chief smiled. \n \n “Look at his past,” he replied. “Old men, women and children were his victims.” \n \n “That is true, but old men sometimes go armed, and women are sometimes heroic, and there is always the chance of a third person coming on the scene.” \n \n “If,” said the other, “in three days from now the man is not arrested I will do what I have said.” \n \n Freyberger bowed, and the interview terminated. \n \n He left the Yard with great depression at his heart. Three days more. It was against all probability that anything would happen during the next three days, unless Providence, watching from above, chose to bring matters to a conclusion. \n \n Freyberger felt, for the first time in his life, discouraged; this discouragement remained with him all night and the next day, which he had to spend at the Central Criminal Court, in connexion with a bank forgery case. \n \n On leaving the Courts very late he repaired to his own rooms, only to find a telegram from the chief desiring his immediate attendance at the Yard. \n \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1933/55494.html","bookId":775,"book":{"id":775,"title":"The Cottage on the Fells","description":"简介： WELL, said Comyns, I cant see for the life of me what makes you want to linger on in this benighted hole.There are a great many things in this world we cant see, replied Hellier....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1933","creation":"Aug 1, 2019 12:19:17 AM","modification":"Aug 1, 2019 12:19:17 AM"}}
