{"id":38635,"no":7,"title":"CHAPTER VI","content":"HE struck into the high road. \\n\\n \\n\\n A frost had set in with the evening, the road was like metal, and the sound of the horse’s hoofs rang upon the air like the sound of a trip-hammer on anvil. \\n\\n \\n\\n A detour of several miles brought him to the main avenue gate of the Hall. \\n\\n \\n\\n A groom was waiting at the steps of the house; he took the horse, which was lathered with foam, and the horseman, without a word, went up the steps. \\n\\n \\n\\n He entered a large galleried hall, hung with armour and trophies of the chase; a great fire blazed cheerily on the immense hearth, and the soft electric light fell upon the Siberian bear-skins, and lit with the light of another age the quaint figures of the dark oak carvings that were there when Charles was King. \\n\\n \\n\\n Sir Anthony Gyde passed across the hall, opened a door, and entered the library. \\n\\n \\n\\n He paced up and down. To-morrow evening at this hour he was due to meet Spain in the person of her Ambassador, and to discuss a loan that had been entrusted to his hands. \\n\\n \\n\\n But he was not thinking of Spain. For the moment the affairs of the world were nothing to him. \\n\\n \\n\\n For the moment his mind was driven into communication with his soul. \\n\\n \\n\\n As he walked up and down, now with his hands in his pockets, now with his arms crossed, his face wore that expression which a face wears when its owner finds himself fronting his fate. \\n\\n \\n\\n The most terrible experience in life is to meet the past, and to find that it is still living. \\n\\n \\n\\n What a helpless, vague, futile country seems the past; just a picture, a voice, a dream. Yet what demons live there, active and in being. \\n\\n \\n\\n Men fear the future, but it is in the past that danger lies. At any moment one of those old vague pictures that lie beyond yesterday, may become animated, and the woman we betrayed in the rose garden, or the brother of the man we killed in the desert, may enter our lives through some unseen door. \\n\\n \\n\\n Gyde, having paced the room for some ten minutes, rang a bell by the mantel and ordered the servant who answered it to summon Gristlethwaite, the land-agent. \\n\\n \\n\\n He was a short, thick-set man, Cumbrian by birth, but with little trace of the accent. \\n\\n \\n\\n Sir Anthony bade him be seated, ordered in cigars and whisky, and plunged into business. \\n\\n \\n\\n He was once more the level-headed business man, the man who could take in the whole details of the management of a big estate in a few hours, pick holes in it, point out errors, and show as deep a knowledge of detail as though he lived there all the year round. \\n\\n \\n\\n It was past dinner-time, but he apparently forgot the fact. \\n\\n \\n\\n After several hours’ conversation and inspection of accounts, Sir Anthony, who was standing with his back to the mantelpiece, suddenly, in the middle of a confabulation about drainage, turned the conversation. \\n\\n \\n\\n “By the way,” he said, “have you seen an artist fellow about here, man in a broad-brimmed hat—” \\n\\n \\n\\n “If he’s the man you mean,” replied the agent, “I believe it’s a man with a German name, Klein, an artist. I let him have Skirle Cottage a month ago.” \\n\\n \\n\\n “Klein,” said the other, in a meditative tone. \\n\\n \\n\\n “He took it for three months,” went on Gristlethwaite. “Paid in advance. He brought some sticks of furniture from Penrith; he’s an ill-looking chap, but his money is good; half-cracked I should think, coming here this time of year.” \\n\\n \\n\\n “He didn’t give you any references.” \\n\\n \\n\\n “No, he paid in advance; I was in two minds about letting him have the place, but since old Lewthwaite’s death it has been lying idle and going to pieces.” \\n\\n \\n\\n “Did you have any conversation with him?” \\n\\n \\n\\n “Yes, sir,” said Gristlethwaite, “and his talk struck me as a bit daft. I cannot remember all he said, but I remember he told he me had lived in Paris and had seen you there.” \\n\\n \\n\\n “What else did he say, try and think. I saw the fellow this evening sketching the stones, and I don’t like the look of him; one never knows in these days what burglars are about.” \\n\\n \\n\\n “Oh, I don’t think he’s anything of that sort,” replied the other, “and I can’t very well remember the words he said, except that he was reckoned a great artist and that he had come down here to complete his masterpiece.” \\n\\n \\n\\n Sir Anthony made that movement of the shoulders of a person who, to use a vulgar expression, feels a goose walking upon his grave. \\n\\n \\n\\n “Well,” he said. “I suppose he has taken the cottage, and we can’t turn him out.” \\n\\n \\n\\n Then he went on conversing about the drainage, at the exact point where he had left off, as though Klein, the cottage, and the masterpiece were things of no account. \\n\\n \\n\\n At ten Gristlethwaite departed. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1933/55464.html","bookId":775,"book":{"id":775,"title":"The Cottage on the Fells","description":"简介： WELL, said Comyns, I cant see for the life of me what makes you want to linger on in this benighted hole.There are a great many things in this world we cant see, replied Hellier....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1933","creation":"Aug 1, 2019 12:19:17 AM","modification":"Aug 1, 2019 12:19:17 AM"}}
