{"id":111236,"no":45,"title":"Page 45","content":"“I don’t care. I swore I would never leave you again, Dr. Warthrop.”\\n\\n “Well, you aren’t. I am leaving you. And Monsieur Rimbaud is being very generous in his offer to look after you.” He lifted my chin with his forefinger and looked deeply into my eyes. “You came for me in England, Will Henry. I give you my word that I will come for you.”\\n\\n And with that, he left.\\n\\n Chapter Thirty-One: “Have You Been Abandoned?”\\n\\n Rimbaud ordered another absinthe. I ordered another ginger ale. We drank and sweated. The air was breathless, the heat intense. Steamers pulled up to the quay. Others pulled out. The tambourines of the coal workers jangled faintly in the shimmering air. The boy came up and asked if we wanted anything for lunch. Rimbaud ordered a bowl of saltah and another absinthe. I said I wasn’t hungry. Rimbaud shrugged and held up two fingers. The boy left.\\n\\n “You have to eat,” Rimbaud said matter-of-factly, his first words since the doctor had left. “In this climate if you don’t eat—almost as bad as not drinking. Do you like Aden?”\\n\\n I replied that I had not seen enough to form an opinion either way.\\n\\n “I hate it,” he said. “I despise it. I have always despised it. Aden is a rock, a terrible rock without a single blade of grass or drop of good water. Half the tanks up in Crater stand empty. Have you seen the tanks?”\\n\\n “Tanks?”\\n\\n “Yes, the Tawila Tanks up above Crater, gied if we wisterns to capture water—very old, very deep, very dramatic. They keep the town from flooding, built around the time of King Solomon—or so they say. The British dug them out, polished them up, a very British thing to do, but they still don’t keep the place from flooding. The local children go swimming up there in the summer and come back down with cholera. They cool off, and then they die.”\\n\\n He looked away. The sea was bluer than his eyes. Lilly’s eyes were closer to the color of the sea, but hers were more beautiful. I wondered why Lilly had suddenly popped into my head.\\n\\n “What is on Socotra?” he asked.\\n\\n I nearly blurted it out: Typhoeus magnificum. I sipped my warm ginger ale to stall for time, frantically—or as frantically as I could in the horrendous heat—trying to think of an answer. Finally I said the only thing I could remember from the doctor’s lecture in the hansom. “Dragon’s Blood.”\\n\\n “Dragon’s Blood? You mean the tree?”\\n\\n I nodded. The ginger ale was flat, but it was wet and my mouth was very dry. “Dr. Warthrop is a botanist.”\\n\\n “Is he?”\\n\\n “He is.” I tried to sound firm.\\n\\n “And if he is a botanist, what are you?”\\n\\n “I am his… I am a junior botanist.”\\n\\n “Are you?”\\n\\n “I am.”\\n\\n “Hmmm. And I am a poet.”\\n\\n The boy returned with two steaming bowls of stew and a plate of flatbread, called khamira, for us to use as a kind of edible spoon, Rimbaud explained. I looked at the brown, oily surface of the saltah and apologized; I had no appetite.\\n\\n “Don’t apologize to me,” Rimbaud said with a shrug. He dove into the stew, his jaw grimly set. Perhaps he hated saltah like he hated Aden.\\n\\n “If you despise it here, why don’t you leave?” I asked him.\\n\\n “Where would I go?”\\n\\n “I don’t know. Someplace else.”\\n\\n “That is very easy to say. And so ironic. That kind of thinking landed me here!”\\n\\n He tore off a piece of khamira and stuffed it into his mouth, chomping with his mouth open, as if he wanted to inflict as much suffering as possible upon the incognizant staple of the land he despised.\\n\\n “A junior botanist,” he said. “Is that what happened to your hand? You were holding a tree limb and his axe slipped?”\\n\\n I tore my eyes away from his disconcerting gaze. “Something like that.”\\n\\n “‘Something like that.’ I like it! I think I shall use it the next time someone asks what happened to my wrist. ‘Something like that.’” He was smiling expectantly, waiting for me to ask. I didn’t ask. He went on. “It happens. C’est la vie. So, would you like to see them?”\\n\\n “See what?”\\n\\n “The tanks! I will take you there.”\\n\\n “The doctor expects me to be here.”\\n\\n “The doctor expects you to be with me. If I go to the tanks, you cannot stay here.”\\n\\n “I’ve seen cisterns before.”\\n\\n “You haven’t seen cisterns like these.”\\n\\n “I don’t want to see them.”\\n\\n “You do not trust me? I won’t push you in, I promise.” He pushed his bowl away, mopped his lips with a piece of bread, and downed the last of his lime green drink. He stood up.\\n\\n “Come. It will be worth the trip. I promise.”\\n\\n He strode off, going into the dining room without a backward glance—another man who assumed others would follow. I watched the terns fishing just beyond the surf and the ships passing Flint Island. I could hear someone singing, a woman or perhaps a young boy; I could not make out the words. If I was gone when he returned, the doctor would not be pleased, to put it mildly. I could picture the fury in his eyes—and that reminded me of another’s eyes, the one who shared that ancient, cold fire, and I finished my ginger ale and went to find Monsieur Rimbaud.\\n\\n I found him standing just outside the front doors. A gharry was pulled up in front of the hotel, and we ducked inside the cab, out of the sun but still very much in the heat, and Rimbaud told the Somali gharry-wallah where we were going, and we rattled toward the quay, riding on top of our shadow.\\n\\n The road ran through a small fishing village of thatched-roof huts clustered along the shore, then turned inland and began to rise. Before us loomed a chaos of bare rocks and towering cliffs, the remnants of a volcano whose cataclysmic explosion had created the deep sea port of Aden—though the peninsula did not remind one so much of creation as it did its opposite. There were no trees, no shrubs, no flowers, no life to speak of anywhere, if you discounted donkeys and humans and carrion, or the occasional rat. The colors of Aden were gray and a brownish, rusty red—gray the rocky bones of the violated earth; red the hardened lava that had bled from it.\\n\\n This was Aden, the land of blood and bones, a great, cauterized wound in the earth where the fist of God had slammed down, thrusting skyward heaps of shattered rock to make the mountains that brooded over the ruined landscape, sullen and lifeless and emptied of all color, except the gray of Gaia’s broken bones and the rusty red of her dried blood.\\n\\n Crater was the oldest and most populated settlement on the peninsula. Described by one writer as “the Devil’s Punch Bowl,” it wasn’t just called Crater; it was a crater, the hollowed-out center of an extinct volcano, surrounded on three sides by jagged mountains. Camp Aden, the British garrison, was located here, along with a sizeable population of Arabs, Parsi, Somalis, Jews, Malaysians, an Indonesians.\\n\\n It took more than an hour to cross the old Arab quarter of town. The narrow streets were crowded with donkey carts and gharries and villagers on foot—though there was none of the hustle and bustle that one finds in New York or London. In Crater there is much activity but little motion, for the town bakes in its punch bowl in the afternoon, when the sun fills the sky directly overhead and the shadows disappear, pinned down beneath your feet. The buildings were as drab as the surrounding countryside, tired-looking, even the newer colonial ones, slumping, it seemed to my eye, like painted gourds rotting in the sun.\\n\\n We bounced along the hot, dusty street until the hot, dusty street came to an abrupt dead end. We had come to the head of Wadi Tawila, the Tawila Valley, where the volcanic heaps of hardened lava and ash reared high their bald heads toward the unforgiving sky. It was the end of civilization and of our gharry ride; we would hike up to the tanks along stone steps that snaked through a mountain defile. Our gharry-wallah said something to Rimbaud in French; I caught the word “l’eau.” Rimbaud shook his head and murmured, “Nous serons bien. Merci.”\\n\\n “You see the problem,” he gasped over his shoulder as I followed him up the steps. “Look behind you. Spread out below in all her infertile glory is the town of Crater. Aden can’t get more than three inches of rainfall a year, but when it rains, it pours! The tanks were built to stop flooding, and to give the British something to do a thousand years later. Almost there.… Around this next bend…”\\n\\n He stepped nimbly around an outcropping, stopped abruptly, and pointed down. We were standing on the lip of a large cone-shaped hole excavated from solid rock, fifty feet across at the top and at least as deep, shining brightly, like marble in the sun.\\n\\n “Well, what do you think?” he asked. His face glistened with sweat, his shirtfront was soaked with it, and his cheeks were ablaze with either excitement or exertion.\\n\\n “It’s a hole.”\\n\\n “No, it’s a very big hole. And a very old hole. See how it shines like marble? That is not marble, though; it’s stucco.”\\n\\n “It’s dry.”\\n\\n “It’s the desert.”\\n\\n “I mean, there’s no water in it.”\\n\\n “This is just one of them. There are dozens all around these hills.”\\n\\n “Are you going to show me all of them?”\\n\\n He stared at me for a moment. In the sunlight his eyes appeared to have no color at all.\\n\\n “Would you like to see my favorite spot in Aden?” he asked.\\n\\n “Is it in the shade?”\\n\\n “It isn’t far, about two hundred meters, and there might be some shade.”\\n\\n “Shouldn’t we be getting back to the hotel? The doctor will be worried about us.”\\n\\n “Why?”\\n\\n “Because he expects to find us there.”\\n\\n “Are you afraid of him?”\\n\\n “No.”\\n\\n “Does he beat you?”\\n\\n “No. Never.”\\n\\n “I see. He just cuts off your fingers.”\\n\\n “I didn’t say that.”\\n\\n “You said something like that.”\\n\\n “I think I’ll go back to the hotel,” I said, turning carefully around; I didn’t want to tumble into the pit.\\n\\n “Wait. I promise it isn’t far, and we can rest there before hiking back down.”\\n\\n “What is it?”\\n\\n “A holy place.”\\n\\n I narrowed my eyes at him suspiciously, and when I did, sweat dripped into my eyes and the world melted a little.\\n\\n “A church?”\\n\\n “Did I say that? No. I said ‘a holy place.’ Come, it is not far. I promise.”\\n\\n We climbed another series of steps that ran along a low stone wall. I looked to my left and saw Crater spread out below us, the white-washed buildings undulating in the blistering heat. At the end of the wall, Rimbaud turned right, and we continued to climb up a wide dirt path that rose steeply toward the cloudless sky. The crunch of our shoes in the volcanic dust, the heaving of air in and out of our lungs—that was the only sound as we labored to the top, where the end of the path met the pale, bled-out blue of the sky. Cresting the hill, we found ourselves at the base of a small plateau five hundred feet above the extinct crater. Another series of steps led up to the top. \\n\\n","sourceLink":"https://allnovel.net/the-isle-of-blood-the-monstrumologist-3/page-45.html","bookId":2548,"book":{"id":2548,"title":"The Isle of Blood (The Monstrumologist #3)","description":"Storyline: The Isle of Blood (The Monstrumologist #3) \\n When Dr. Warthrop goes hunting the \"Holy Grail of Monstrumology\" with his eager new assistant, Arkwright, he leaves Will Henry in New York. Finally, Will can enjoy something that always seemed out of reach: a normal life with a real family. But part of Will can\u0027t let go of Dr. Warthrop, and when Arkwright returns claiming that the doctor is dead, Will is devastated--and not convinced. \\n Determined to discover the truth, Will travels to London, knowing that if he succeeds, he will be plunging into depths of horror worse than anything he has experienced so far. His journey will take him to Socotra, the Isle of Blood, where human beings are used to make nests and blood rains from the sky--and will put Will Henry\u0027s loyalty to the ultimate test.\\n","cover":"https://allnovel.net/images/the-isle-of-blood-the-monstrumologist-3.jpg","author":"Rick Yancey","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-isle-of-blood-the-monstrumologist-3.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:16:52 AM"}}
