{"id":103849,"no":51,"title":"Page 51","content":"Beyond that cold professionalism, Lisa recognized a glimmer of hatred in Kat’s eyes. While not getting the full story concerning what had happened at the North Charleston Fertility Clinic, Lisa understood enough to know whom to blame. Cranston was a monster hiding behind a handsome face. And one with great ambitions. “There should be a signal by now,” Kat said. “But I’m still not getting any reception.” After commandeering the vehicle, Kat had ordered Lisa to turn the SUV around and backtrack along their path. She wanted to reach a phone or get close enough to a cell tower to regain reception. “Some farmhouses off to the right,” Lisa offered. “We can turn in and ask for help.” “They might alert the local authorities. I don’t know who to trust out here.” Lisa remembered Painter expressing the same concern. The Gants owned much of South Carolina. Who knew how far that reach extended into local law enforcement? “Look.” Lisa pointed ahead. “There’s a sign for a turnoff to Orangeburg. Surely that town must get cell signal.” “Head that way,” Kat agreed, but she kept searching around the vehicle, with a suspicious look. Lisa made that turn and traveled a half-mile. Off in the distance, the steeple of a church poked above the tree line. That had to be the town of Orangeburg. Too focused on the horizon, Lisa glided through an intersection with a flashing red light. A small drawbridge crossed a hidden river. A warning gate began to drop across its entrance. She pulled to a stop in front of it. As she waited for the drawbridge to open, Lisa asked, “Anything now?” “Nothing.” In the rearview mirror, Kat’s eyes fixed at the back of Cranston’s head. He’d been unusually quiet for the past five minutes, no further complaints about his wrists. A low rumble announced the raising of the bridge—but then got louder and louder—becoming more like a thumping. Lisa frowned, concerned about the worn mechanics of the old bridge. Kat’s reaction was rougher. She jerked upright and threw her cell phone out the window. She clutched Lisa’s shoulder at the same time. “Get us out of here! Now!” The warning came too late. A sleek military-gray helicopter burst out of hiding from the riverbed to the left. It lofted high over the bridge. Lisa yanked the car into reverse and jammed the gas. She raced backward to the intersection, fishtailed the car a full 180, and was ready to speed off—but the helicopter was faster. The chopper cut them off, plunging out of the sky to block the road. Lisa braked, avoiding a collision with the whirling blades. Rotor wash beat at the Ford’s windshield. A bullhorn roared. “Throw your weapons clear of the vehicle! Exit with your hands up!” To make sure the order was understood, a small gun mounted on the chopper’s underside chattered, and a spate of rounds blasted into the pavement in front of the SUV. Lisa turned to Kat. She shook her head. “Do what they say.” Into that stunned silence, Cranston smiled. “Ladies, you’re not the only ones allowed surprises.” He awkwardly swiveled around. “Back there, I disabled my phone’s cellular receiver and activated an emergency satellite beacon built into the phone.” Turning it into a tracking device, Lisa realized. No wonder Kat jettisoned the phone. Cranston frowned. “Though I have to say the emergency response was faster than I expected. Apparently, my employers truly don’t want you to escape. But why? Who the hell are you?” Kat raised the pistol to his ear. “You’ll never know.” His eyes got huge as the pistol exploded, shattering away half his face. Lisa cringed from the sudden brutality, her ears ringing as Kat tossed the weapon through the window. Still, Lisa heard the fierce whisper that followed. “That was for Amy.” 8:15 P.M. Washington, DC Painter sat in Kat’s chair, rubbing his eyes. The faint smell of jasmine that hung in the air was no longer evident. Maybe it had faded away with everyone bustling in and out of the office, or maybe he’d just become desensitized to the scent. Either way, he felt a nagging sense of loss, a foreboding. You’re just exhausted, he tried to convince himself. Jason and Linus continued their work, searching for any other sightings of the Ford. Painter had played that grainy footage over and over again, watching the shadowy shape shift frame by frame, knowing it was Lisa. He was relieved to find her still alive, but the longer that silence stretched, with no further word on Kat and Lisa’s true fate, the deeper that icy knife twisted in his gut. He forced his eyes to stare once more at the map on the monitor. It displayed South Carolina, along with parts of North Carolina and Georgia. Large swaths of red stood out from the green background. The crimson areas were landholdings of the Gant family. Painter suspected Lisa and Kat were hidden somewhere in that crimson field. Which presented a major challenge. The Gant family had arrived on the shores of the Carolinas a century before the founding of this country, settling in the city of Charles Town, which later became simply Charleston. Wealth and power grew rapidly, channeled through the financial support of the family’s Old World connections in both France and England. As that family grew, so did its reach and influence, branching into universities, governments, military institutions, and banking circles. And much of that wealth turned into land. It was said, back at the turn of the century, that the Gants could ride horseback from one side of the state to the other—from the beaches of Charleston across the low-country counties and up to the Blue Ridge Mountains—all without ever stepping foot off their own property. Today, the Gants could drive a herd of cattle across the state and make that same claim. Painter rubbed his temples, overwhelmed by the wealth and power that opposed his small group. How could they hope to succeed against a force so entrenched? And if the enemy ever did learn Sigma was still investigating them in secret, what would their next response be? He could guess the answer. In 146 B.C., Rome destroyed Carthage by sacking the place, burning the city, enslaving the survivors, and salting the very earth to make sure nothing ever grew there again. Painter expected something worse than that. Jason Carter appeared at his door, ever his shadow. “Director, you asked me to let you know when I finished that special project.” “You’re done? Already?” “On our computer. But I might have to demonstrate.” Painter stood from the chair and relinquished it to Kat’s chief analyst. The kid hurried over and dropped into the seat. He tapped rapidly and brought up the genealogical map of the Gant clan. Painter had asked for his expert assistance at building a more detailed version, one set to his specific parameters. From the very beginning, something had been troubling him about the Gant family tree, a nagging sense that he was missing a vital detail. He began to suspect the problem, but he didn’t know what it signified, or if it meant anything at all. The only way to make sure was to construct a genealogical representation where no detail was left out. He wanted the complete picture—and asked Jason to prepare it. “Here’s the lineage you originally assembled,” Jason said. With a click of the mouse, the three-dimensional schematic of the Gant family tree appeared. Progeny and familial connections formed a monumental tapestry, a weaving and warping of heredity and genealogy that spanned two centuries, back to the founding of the country. It was hard to get reliable records much earlier than that. But apparently not for Jason. “Okay, director, I know what you asked for, but I took the liberty of also searching back another century—just to be thorough.” I want to clone this kid. Painter leaned closer. “And you were still able to expand the search to the sides.” Jason nodded. Painter had spent hours studying that chart, finally gleaning what nagged him. Certain tendrils of the chart showed familial lines that wove in and out of the main genealogical matrix, marking distant cousins marrying back into the family. For such a rich family, it wasn’t unusual, a typical inbreeding of power and blood among aristocrats. But those loose threads in the Gant family’s tapestry troubled him, because there seemed to be too many of them, even for such a rich dynasty, a suspicious fraying of the cloth. Painter couldn’t help but pick at those threads to see what they might reveal. He asked Jason to stretch the genealogical search to the sides of the main family tree, to follow all of those loose threads. He also instructed him to look for new ones, specifically lines of the family that strayed even farther from the fold, farther than merely distant cousins, before diving and returning to the Gant bosom. “Show me,” Painter ordered. “Be prepared. The chart is vast. No individual names will show up, just data points.” “Do it.” Jason tapped a few keys, and that original matrix Painter constructed shrunk to a size of a fist. Names dwindled away to become nodes of a network, stars in a galaxy. Around that galactic core, a hazy corona of new data points and fine lines appeared, scintillating into existence on the screen, surrounding yet incorporated into the whole. Painter brushed his fingertips across the new spiral arms of this galaxy. “And all of these extensions mark where a strand of the family tree shot away from the others—” “Only to eventually return again,” Jason confirmed. “The average deviation was two generations, but a few of those lines broke away for five or six generations. A couple of the prodigal relatives returning to the family were seventeenth or eighteenth cousins. But return they did.” “Like moths around a lamp,” Painter said. “Fluttering out, then diving back in again. Over and over again.” Jason shrugged. “I can probably confirm this is excessive, even for a prominent family like the Gants, but it’ll take time to work up a comparable dynasty. Still, I’m not sure what the significance is.”","sourceLink":"https://allnovel.net/bloodline-sigma-force-8/page-51.html","bookId":1527,"book":{"id":1527,"title":"Bloodline (Sigma Force #8)","description":"Storyline: Bloodline (Sigma Force #8) Galilee, 1025. A cunning Templar knight uncovers a holy treasure: the Bachal Isu — the staff of Jesus Christ — a priceless icon that holds a mysterious and terrifying power that will forever change humanity if unleashed. A millennium later, Somali pirates hijack a yacht off the coast off the Horn of Africa, kidnapping a young pregnant American woman and brutally killing her husband. Painter Crowe and his SIGMA team are enlisted for the top secret rescue mission. The kidnapped woman is Amanda Gant-Bennett, the daughter of U.S. president James Gant. Crowe is more than a little suspicious that the kidnapping masks a far more nefarious plot. In the field, Commander Gray Pierce leads his small team of operatives into the treacherous African jungle to find the missing woman. But what should be a straightforward rescue turns into a fiery ambush and a deadly act of betrayal. As Commander Pierce and his team discover, the hostage is a pawn in a shattering act of terrorism with dark and shocking repercussions. And the danger is only beginning...","cover":"https://allnovel.net/images/bloodline-sigma-force-8.jpg","author":"James Rollins","type":"Adventure","source":"allnovel","link":"https://allnovel.net/bloodline-sigma-force-8.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 10:30:29 PM"}}
