{"id":103866,"no":68,"title":"Page 68","content":"\\n\\n “So you see how steadfastly we believed,” Robert said. “And in the end, we were proven right.”\\n\\n “Right? How?”\\n\\n “The drawing on the staff was knowledge encoded for future generations. Genetic knowledge.” Robert pointed to the other symbol on the door. “That’s when the symbol got changed, transforming the snakes into what they really represented: strands of DNA.”\\n\\n “You’re saying that ancients in the past knew enough about DNA to encode it as snakes on a staff.”\\n\\n “Possibly. Back in the sixties, a scientist named Hayflick determined that man’s natural age could not exceed 120 years. He based that on the number of times a cell could divide.”\\n\\n “I’m familiar with the Hayflick Limit,” Gray said, having studied biophysics.\\n\\n “Then is it mere coincidence that the book of Genesis came to the same conclusion about the limits to a man’s lifetime? To quote from that book of the Bible: His days shall be a hundred and twenty years. The same conclusion as Hayflick’s. Where did that knowledge come from?”\\n\\n “Okay, that’s strange, I admit. But that’s a far cry from saying that the snakes on the staff represent strands of DNA. There are three snakes drawn there. DNA is a double helix.”\\n\\n “Ah, but there’s the rub. The secret of immortality doesn’t lie within two strands, but three, a triple helix. That’s what is written on the staff. It took until the modern age, with the aid of DNA analysis, for us to unravel that mystery.”\\n\\n “How did you do that?”\\n\\n “When our errant knight left with the staff, she killed the previous immortal who possessed it—likely the last of his kind. She spilled his blood, which was preserved on the staff. In his blood, we discovered his white cells possessed triple-helical DNA.”\\n\\n This sharpened Gray’s attention. “Triple-helical DNA?”\\n\\n He was beginning to appreciate the enormity of the revelation here.\\n\\n Robert nodded. “Once genetic science advanced enough to let us decode that third strand, we determined it was actually a viral protein—from a plant virus. The protein was a natural form of peptide nucleic acid, PNA. It infected human cells after someone ate that plant. A side effect of this virus leaping from plant to animal was that it stabilized cells, staved off cellular degeneration, and extended the life spans of the infected dramatically.”\\n\\n Gray pictured the Garden of Eden. “The mythical tree of life.”\\n\\n “Maybe not so mythical after all.”\\n\\n “But I thought you said the plant’s fields were drowned during the Great Flood. How did this guardian come to possess it?”\\n\\n “Apparently, someone had the foresight to stockpile some of the plants, drying them out like tea leaves. From the chronicles of the knight who stole the staff, written on her deathbed, she described a row of Egyptian sarcophagi full of brittle leaves and stems in the crypt. Focused on her goal, she didn’t think anything about it and left it all to burn.”\\n\\n Gray appreciated the irony. “So, like the Eve of old, your knight stole the tree of knowledge, bringing you this cryptic clue about immortality—but she left behind the tree of life.”\\n\\n “So it seems. In the end, we tried to reverse-engineer that viral PNA protein, but it proved no good. Too much degradation. So we had to start from scratch, engineering our own PNA and testing it.”\\n\\n Gray imagined the horrors and abuses involved with that research.\\n\\n Even Robert didn’t sound proud, his voice growing hushed. “But over time, we improved enough to produce the first stable child.”\\n\\n “Amanda’s son.”\\n\\n He nodded. “But that stability ended up to be only temporary. And yet the cost of it was still so high. First, Amanda’s life. Now, my brother’s.” He pointed toward the door. “And soon my grandnephew. It’s too much. I must do what I can to preserve the rest of my family.”\\n\\n They headed across the hall.\\n\\n Robert’s melancholia settled back on his shoulders. “I was a boy when I made my pact with that inner circle of the family, with the Bloodline. I thought what we were doing here was so much larger than any individual life.”\\n\\n Until it hit closer to home.\\n\\n Heavy is the head that wears the crown.\\n\\n And that weight and guilt would only grow when he assumed his brother’s place at the White House, bringing the Bloodline fully into power versus pulling the strings behind James Gant’s back.\\n\\n “Why have you told me all of this?” Gray asked. “Why did you bring me down here?”\\n\\n “So you might understand why a naïve boy might succumb to such a cruelty, but an old man cannot suffer more loss.” Robert turned to him. “I brought you down here so that you could tell the world.”\\n\\n Gray gaped, shocked. The loss of his brother must have been the proverbial straw that broke this camel’s back.\\n\\n But didn’t Robert order that assassination? Or was he as much a puppet on a string as President Gant?\\n\\n For now, Gray had a more important question if the man was folding up his tent. “Why don’t you come forward yourself?”\\n\\n “I’ve suffered enough. I will take those closest to me and vanish, to go where the Lineage cannot find us.” Robert headed away. “I leave the rest on your shoulders.”\\n\\n Gray followed behind him, passing the neighboring bank of mainframes in the other room. If Robert wanted to spill all, then he wanted to know everything.\\n\\n “What’s with the computer servers?” he asked, sensing something important hidden there.\\n\\n Robert glanced disinterestedly in that direction. “If this room is our heart—that’s our brain, our memory. It holds our entire lineage, not just under the Gant name but the others who were lost to the past. All the way back to our rumored beginning.”\\n\\n Gray wanted to hear this. “What beginning?”\\n\\n “The crescent and the star. Our first symbol. Some of our earliest records connect those two symbols to the Canaanite god of human sacrifice.”\\n\\n That’s certainly fitting.\\n\\n “That god was named Moloch, represented by the horns of a cow or the horns of a crescent moon. A closely related god was Rephan, represented by the star. Some of our historians believe our roots go back to the time of Moses, that we were cast out by him for worshipping the crescent and the star.” He glanced back to the staff. “There is a verse from the biblical Acts. ‘You have lifted up the shrine of Moloch and the star of your god Rephan, the idols you made to worship. Therefore I will send you into exile beyond Babylon.’”\\n\\n “So you’re saying you’re the descendants of those exiled idol-worshippers?”\\n\\n “I don’t know. But the Bloodline is ancient, and they still carry on some old Jewish traditions, like—”\\n\\n Beyond the glass wall, the elevator doors opened with a buzz, drawing their attention forward. A familiar figure stepped out. The tall blond woman strode purposefully forward. Those glacial eyes took in the situation with a single cold sweep.\\n\\n Stiff with surprise, Robert strode forward. “Petra? Why … how are you down here?”\\n\\n On the far side of the glass barrier, she stepped to the air lock, typed in a code on the outer door. Thick steel rods locked the room down.\\n\\n Robert rushed forward and tugged on the door handle.\\n\\n Apparently, someone had grown wise to his coming betrayal.\\n\\n Robert stopped tugging, realizing the truth. He called through the glass wall to her. “You’re of the Lineage. Why was I never told?”\\n\\n “We are legion,” she said. “And not all are happy with your stewardship. When we lost the child—a useless thing, really—I contacted those whom I serve, reported what I found here. How you place grief over necessity. Immediate family over the Lineage. You tug and rip against the fabric that has lasted millennia. No more. You are of no further use to the Lineage.”\\n\\n “But I’ve led for so many years.”\\n\\n She smiled, a wicked look, as if scoffing at such a claim. “When the body is strong, the head can be cut off. We will grow a new one and be stronger for it. You are to be set aside. This branch of the Gant clan is to be pruned away, including all the fruit born from it. We will purge the old to make way for the new. With no tears, only purpose.”\\n\\n Robert’s palm, which had been resting against the door, fell away.\\n\\n “The purge will start here. In ten minutes. At three o’clock, an appropriately powerful number. I’ve engaged the fail-safe for both your labs and this vault of ages. This day, the Lineage will shed its past and set its eyes only on the future. Immortality is within grasp. Ultimate power at our doorstep.”\\n\\n Petra bowed, oddly respectful. “Those you love will not suffer,” she said, her eyes fixing at Robert. “Even those you do not believe we know about.”\\n\\n Robert lunged forward and pounded his fist against the glass, his voice breaking. “Stop!”\\n\\n She retreated to the elevator, facing them—though her gaze was directed elsewhere. They were already forgotten.\\n\\n Gray waited for the doors to close, then turned to Robert. “Looks like you’re out of a job.” He tilted his cuffed wrists toward the man. “How about we get these off?”\\n\\n Robert looked both angry and grief-stricken.\\n\\n Been there, Gray thought.\\n\\n As the man undid his cuffs, Gray asked the question he was afraid to know the answer to. “What’s this fail-safe?”\\n\\n Robert’s face went grave. “A thermobaric bomb. One will incinerate the vaults down here. But over at the lab …” He shook his head, looking sick.\\n\\n “What’s going to happen at the lab?”\\n\\n 2:51 P.M.\\n\\n The evacuation alarms echoed across the facility as red warning lights flashed, turning the world shades of crimson.\\n\\n “Sinkhole,” Fielding explained as he shoved papers into a briefcase.\\n\\n “What?” Edward asked, sticking close to the man. Others fled in various directions, grabbing what they could.\\n\\n “A majority of the complex sits above a dry underground lake. Miners at the turn of the century discovered the lake below, fed by an underground river. Later, engineers capped that river during construction, built scaffolding to support the lab over the pit. We’re not in an underground lab.” He snapped his briefcase closed with a note of finality. “We’re on a massive suspension bridge over a yawning pit. And they’re about to blow out that suspension.” \\n\\n","sourceLink":"https://allnovel.net/bloodline-sigma-force-8/page-68.html","bookId":1527,"book":{"id":1527,"title":"Bloodline (Sigma Force #8)","description":"Storyline: Bloodline (Sigma Force #8) \\n Galilee, 1025. A cunning Templar knight uncovers a holy treasure: the Bachal Isu — the staff of Jesus Christ — a priceless icon that holds a mysterious and terrifying power that will forever change humanity if unleashed. \\n A millennium later, Somali pirates hijack a yacht off the coast off the Horn of Africa, kidnapping a young pregnant American woman and brutally killing her husband. Painter Crowe and his SIGMA team are enlisted for the top secret rescue mission. The kidnapped woman is Amanda Gant-Bennett, the daughter of U.S. president James Gant. Crowe is more than a little suspicious that the kidnapping masks a far more nefarious plot. \\n In the field, Commander Gray Pierce leads his small team of operatives into the treacherous African jungle to find the missing woman. But what should be a straightforward rescue turns into a fiery ambush and a deadly act of betrayal. As Commander Pierce and his team discover, the hostage is a pawn in a shattering act of terrorism with dark and shocking repercussions. And the danger is only beginning...\\n","cover":"https://allnovel.net/images/bloodline-sigma-force-8.jpg","author":"James Rollins","type":"Adventure","source":"allnovel","link":"https://allnovel.net/bloodline-sigma-force-8.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 10:30:29 PM"}}
