{"id":103808,"no":8,"title":"Page 8","content":"\\n\\n To keep you safe …\\n\\n And now her baby had fallen into another set of hands, becoming a tool to generate a larger ransom by the pirates. She remembered the Brit’s hungry eyes on her belly as she was taken off the yacht. Here, life was a commodity to buy and sell, even the new life growing in her belly.\\n\\n Oh, Mack, I need you.\\n\\n She closed her eyes, her heart constricting with the last memory of her husband, the fear and love shining in Mack’s eyes. She shied away from the horror that followed, his severed head tossed upon the bed where they’d made such careful love only hours earlier. But she had no time to grieve for her husband.\\n\\n She drew a long, steadying breath, taking in the damp and redolent smell of junipers and wild lavender of the dense forest. Though numb with grief and terror, she had to stay strong. In the South, it was unseemly to be caught sweating in public. On the campaign trail with her father, she had learned to maintain a placid and friendly exterior—even when screaming on the inside. Instead, it was all smiles, handshakes, and warm pats on the back. Even with your enemies … especially with your enemies.\\n\\n So, she continued to cooperate with her captors. Jumping when they said jump, remaining always pliant and obedient. Still, all the while she watched. It was another lesson from her father, his words echoing in her head, explaining the best way to gain the upper hand.\\n\\n Keep your eyes open and your mouth shut.\\n\\n And that’s what she intended to do. So far, the pirates gave no indication they knew she was the president’s daughter. They’d not even questioned her yet. In fact, they’d barely said a word. A grunt here or there, a pantomimed instruction, a few terse orders. Mostly about drinking water.\\n\\n We don’t want anything to happen to your baby.\\n\\n The warning had come from the man seated in the passenger seat up front, the Brit with his thin mustache and impeccable attire. He remained the only consistent presence around her—though he’d ignored her most of the day, bent over a laptop computer attached to a satellite phone and GPS navigation unit.\\n\\n She studied the back of his head, trying to figure him out, searching for a weakness. He tapped at his laptop and the screen changed to a topographic map. She feigned a kink in her back to stretch forward, trying to peek at the screen, to discern some idea of where she was and where they were going. But her guard yanked her back, his hand lingering over her left breast, which was tender and swollen. She slapped his fingers away, which only earned her a lascivious leer.\\n\\n Defeated, she stared sullenly out at the misty forest.\\n\\n Exhaustion and fear had stretched the day’s journey into a blur. At dawn, they’d made landfall at a small coastal town, a booming shantytown of bars, hotels, restaurants, and whorehouses, all serving the pirate trade. And from the number of expensive cars lining newly paved streets and half-constructed villas along the coast, it was plainly a lucrative and thriving business. To protect that industry, militiamen swerved through the streets in Mercedes SUVs, weapons bristling from rolled-down windows, making sure no one attempted to rescue any of their hostages.\\n\\n And there must have been others like her.\\n\\n As their boat had entered into port, she’d spotted numerous captured vessels: fishing trawlers, sailboats, a sleek yacht, and, anchored out in the deeper waters, an oil tanker. They’d only remained in town for less than an hour. There, she was handed over to another pirate gang and put on a hot, poorly ventilated Volkswagen bus out of town.\\n\\n They drove half a day through lands hammered dry and flat by the merciless sun, the featureless landscape only broken by the occasional village of dry huts. They’d stopped only long enough for her to urinate, which was often, and humiliating each time. In the distance, mountains had loomed, seeming to grow higher with each passing mile.\\n\\n Soon it became clear that the broken spine of rocky peaks was their destination. Upon reaching a village nestled in the scrubby foothills, the gang changed yet again, but not before a heated argument ensued, accompanied by a machismo display of shaken weapons and hurled threats. Finally, the Brit had facilitated the exchange of additional funds, bills banded in thick bundles, and Amanda found herself transferred into this old safari vehicle headed into the misty highlands.\\n\\n A metallic snap drew her attention forward as the Brit closed his laptop with an air of finality. The reason became clear. A fiery glow appeared in the forest ahead, turning the wisps of fog into crimson trails threaded through the dark-green jungle. She smelled roasting meat and woodsmoke.\\n\\n With a final haul of fifty yards, the Land Rover broke into an open glade in the jungle. Overhead, camouflage netting masked the camp below, giving the space a cavernous feel. A trio of small bonfires illuminated the hidden glade, along with a few electric lamps on poles.\\n\\n The Land Rover pulled to the side and parked beside a handful of other vehicles. Additionally, a trio of camels, settled for the night, raised their heads to study the newcomers.\\n\\n Likewise, Amanda, her eyes huge, tried to make sense of the camp. A neat circle of military-style tents surrounded a larger structure that looked like a picturesque gabled house, raised on pilings a yard off the ground. Across the front, a quaint wooden porch held a pair of deck chairs draped with mosquito netting. It looked like the jungle home of some African missionary. Furthering that impression, a large bloodred cross decorated one side of the building.\\n\\n But as the Land Rover drew to a halt, the charming illusion evaporated. The house was actually a makeshift tent-cabin, with white tarpaulin stretched over a wooden pole-frame. And the crimson cross was less religious in appearance and more medical, like something borrowed from the American Red Cross. Only this cross had strange markings along its lengths, a twisting and coiling pattern that looked vaguely familiar.\\n\\n Before she could understand what nagged her, the Brit pulled open her door and held out his hand to assist her.\\n\\n “Home sweet home,” he said without any sarcasm in his voice.\\n\\n She climbed out, unsteady, supporting her belly, and searched around. The steady chug of a diesel generator mocked the wild beating of her heart.\\n\\n Men and women climbed out of tents to eye the new arrivals. Most of those faces were black, African, but they didn’t have the starved and desperate look of the pirates. Even the weapons in view looked modern and well-kept.\\n\\n What is going on here?\\n\\n The other faces matched the Brit’s: white, European, professional. This last assessment came from the number of them wearing blue scrubs, like they’d freshly stepped out of a modern hospital for a smoke break.\\n\\n The Brit led her through the circle of tents and toward the makeshift cabin, trailed by her guard. She climbed the steps to the small porch.\\n\\n A spring-loaded door opened as they reached the cabin. A tall woman joined them, her blond hair trimmed into a short, athletic bob. She was young and fresh-faced, as if she just slipped out of a swimsuit ad and into surgical scrubs. Belying that image was the severity of her expression, especially her narrowed eyes. She took in everyone with a single steel-blue glance, barely noting Amanda. Her gaze settled on the Brit.\\n\\n “Everything is ready, Dr. Blake.”\\n\\n Amanda swung toward the Brit, surprised.\\n\\n Doctor …?\\n\\n The man noted her consternation. “I’m sorry. I never did properly introduce myself.” He held out his hand. “Dr. Edward Blake. Ob/gyn.”\\n\\n She didn’t take his hand. Instead, she stared beyond the blonde’s shoulder and into the cabin. A hospital bed rested against the far wall. Beside it stood an IV pole and a bank of monitoring equipment. On the other side, a technician lubricated the transvaginal probe of an ultrasound unit.\\n\\n Dr. Blake seemed to take no offense that Amanda had refused his hand. Instead, he rubbed his palms together.\\n\\n “Okay, then, Mrs. Gant-Bennett. Why don’t we step inside?”\\n\\n Amanda bit back her shock at the mention of her name.\\n\\n He knows who I am …\\n\\n Dr. Blake motioned with his arm. “We should check on how your baby boy is doing after the long journey. We can’t let anything happen to him, can we? He’s much too important.”\\n\\n Amanda backed away in horror, her worst nightmare coming true.\\n\\n Not only did they know who she was, they knew what she carried.\\n\\n “No …”\\n\\n Hands gripped her shoulders from behind and shoved her toward the open door.\\n\\n Please, she prayed. Please someone help me.\\n\\n 5\\n\\n July 1, 8:34 P.M. East Africa Time\\n\\n Boosaaso, Somalia\\n\\n “They’ll take good care of her,” Amur Mahdi promised. “At least for now.”\\n\\n “Why do you say that?” Gray asked.\\n\\n Seichan looked equally doubtful. She was dressed handsomely in jeans and a local guntiino, a bright length of crimson cloth, knotted at the shoulder and draped to the waist. The look must have worked, because Amur kept casting sidelong glances in her direction.\\n\\n Next to her, Kowalski, outfitted in regular street clothes, simply swirled his tea, looking inattentive.\\n\\n The four of them shared a table at a seaside restaurant overlooking the Somali port of Boosaaso. The open-air patio looked out onto the Gulf of Aden, the moonlit harbor crowded with massive ships bearing flags of various Arab states, along with the triangular sails of hundreds of smaller, wooden-keeled dhows.\\n\\n Gray’s team had arrived at the Bender Qassim International Airport outside of Boosaaso forty minutes ago, traveling under the cover of UNHCR, the United Nations refugee agency. The relief group maintained a presence here in Puntland, the northeastern state of Somalia, where most of the country’s lawless pirates operated. Boosaaso was the main crossroads for this region and the best base of operations to begin gathering intelligence.\\n\\n This introductory meeting was with Amur Mahdi—a former pirate turned CIA asset. He was an older man dressed in regional attire, which included loose trousers and a sarong-like kilt, known as a macawiis. He also wore a traditional embroidered cap atop his grizzled hair. The man had lost one leg at the knee several years back, an injury that sidelined him from his former profession as a pirate.\\n\\n The sight of the prosthetic limb reminded Gray of his father, who’d been similarly disabled. A twinge of guilt flared at being half a world away from him, but he fought it down and concentrated on the conversation. \\n\\n","sourceLink":"https://allnovel.net/bloodline-sigma-force-8/page-8.html","bookId":1527,"book":{"id":1527,"title":"Bloodline (Sigma Force #8)","description":"Storyline: Bloodline (Sigma Force #8) \\n Galilee, 1025. A cunning Templar knight uncovers a holy treasure: the Bachal Isu — the staff of Jesus Christ — a priceless icon that holds a mysterious and terrifying power that will forever change humanity if unleashed. \\n A millennium later, Somali pirates hijack a yacht off the coast off the Horn of Africa, kidnapping a young pregnant American woman and brutally killing her husband. Painter Crowe and his SIGMA team are enlisted for the top secret rescue mission. The kidnapped woman is Amanda Gant-Bennett, the daughter of U.S. president James Gant. Crowe is more than a little suspicious that the kidnapping masks a far more nefarious plot. \\n In the field, Commander Gray Pierce leads his small team of operatives into the treacherous African jungle to find the missing woman. But what should be a straightforward rescue turns into a fiery ambush and a deadly act of betrayal. As Commander Pierce and his team discover, the hostage is a pawn in a shattering act of terrorism with dark and shocking repercussions. And the danger is only beginning...\\n","cover":"https://allnovel.net/images/bloodline-sigma-force-8.jpg","author":"James Rollins","type":"Adventure","source":"allnovel","link":"https://allnovel.net/bloodline-sigma-force-8.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 10:30:29 PM"}}
