{"id":80410,"no":31,"title":"Page 31","content":"Verity thought about it. \"I\u0027m not sure. Somewhere along the line I must have made some mental connection between having a kitchen of one\u0027s own and having a home. It\u0027s hard to explain. I guess I began to associate cooking with roots and a sense of permanency.\"\n Tavi did not participate in the conversation as it jumped from the Renaissance to gourmet food and went on to an analysis of a recent film that was making news. Verity made a few attempts to include the quiet woman but Tavi merely smiled politely and ignored them. Tavi\u0027s dark eyes rarely left her employer and Verity couldn\u0027t help noticing the concern reflected in them. Caitlin had more than a paid companion in Tavi, she also had a loyal friend, whether she knew it or not.\n When Caitlin signaled at last that she had had enough of the pool, Tavi moved forward instantly to assist her. She helped the blond artist out of the water, handed her the ebony cane, and quickly dried her.\n Verity caught a glimpse of Caitlin\u0027s withered leg and looked away as Tavi adjusted the terrycloth robe.\n \"It\u0027s all right,\" Caitlin said calmly. \"It happened a long time ago.\"\n \"It must have been terrible for you,\" Verity said quietly.\n Caitlin shrugged as Tavi fastened the brace. \"They told me in the hospital that I was lucky to be alive.\n But everyone has a different definition of luck. I enjoyed our chat this morning, Verity. I shall look forward to another meal or two at the No Bull. Perhaps we could have tea together one afternoon?\"\n Verity nodded happily, again enjoying the pleasant sense of a dawning friendship. It was like that sometimes between two women. Sometimes you just clicked with another person and the friendship sprang into life almost immediately. In this case her sense of compassion was a factor, too. She had the odd feeling that Caitlin needed her friendship. \"I\u0027d like that. Good morning, Caitlin. Tavi. I\u0027ll see you both later.\"\n Tavi gave her a strange, assessing glance and then turned to escort her employer from the baths. There was a distinct tenderness in the grip she had on Caitlin\u0027s arm and in the way her head was bent toward the other woman.\n Verity watched them leave and then decided that she\u0027d indulged herself enough for one day. There was work to be done and sooner or later a man to be faced. She rose from the pool and picked up her towel.\n From now on she was going to bathe nude in the spa pools. Much more relaxing. Verity grinned to herself at the thought. Obviously her night of licentiousness and unmitigated debauchery had thoroughly corrupted her.\n Upstairs in the suite Caitlin had rented, Tavi served tea and yogurt from a room service tray that had been ordered earlier.\n Caitlin sat in the white wicker chair near the window and looked out over the lake as she sipped her unsweetened tea.\n \"Verity Ames is the key, Tavi. I\u0027m certain of it. Everything hinges on her.\"\n \"Perhaps,\" Tavi agreed doubtfully. She poured tea for herself and watched the other woman\u0027s profile as Caitlin stared at the water. There was so much strength in Caitlin, but it was warped and twisted toward only one goal. Tavi was at a loss as to how to alter the direction of her headlong flight toward revenge.\n Sometimes all you could do was be there for someone. Sometimes there was simply nothing else that could be done.\n Tavi had been Caitlin\u0027s only friend for five years, ever since the day she had gone to work for a lonely, isolated artist who needed friendship and love far more than she needed a housekeeper/companion.\n Tavi had seen past the hard surface to the woman beneath it, the woman who lived with constant pain.\n \"No, I\u0027m sure of it. She\u0027s an unexpected bonus. I had no idea we\u0027d find someone like her when we located Quarrel. It\u0027s going to make everything infinitely easier. I\u0027m already beginning to get the germ of an idea.\"\n \"The more people involved, the more dangerous this whole thing will get,\" Tavi pointed out.\n \"True, but I can see no way of manipulating Quarrel without a lever. He\u0027s too free, too independent.\n Originally I considered simply paying him to do the job, but I know now that wouldn\u0027t work. He\u0027d tell me to get lost. There\u0027s nothing I can offer him or use to coerce him.\"\n \"Except Verity?\"\n \"Except Verity. He wants her, Tavi. That was crystal clear last night. The man is as possessive as hell.\n I saw it in his eyes. In fact, I would be willing to bet that he made love to her last night. There was something about her this morning that was not there last evening. I suspect Quarrel staked his claim in bed.\"\n \"It could all be a figment of your imagination.\" Tavi\u0027s cup clattered on its saucer. She finished her tea with trembling ringers. \"You\u0027ve been living with your schemes and plans for so long that you might be fooling yourself into thinking you can actually turn them into reality.\"\n Caitlin\u0027s frown was sharp as she snapped her head around to glare at her companion. \"I found him, didn\u0027t I? I located Quarrel after all this time. You didn\u0027t think I\u0027d get that far, but I did.\"\n Tavi nodded reluctantly, saying nothing.\n Caitlin relaxed and turned back to the view. \"I knew that when I found him I would need some leverage to persuade him to play his role. Verity Ames is that leverage. I know she is.\"\n \"Just because she\u0027s sleeping with him, you think you can use her to manipulate him?\"\n \"It\u0027s not a casual affair,\" Caitlin rasped. \"You didn\u0027t see the look in his eyes last night. I did. There\u0027s no telling how long he will want her. A man\u0027s attention span is apt to be quite short. But for the moment he\u0027s captivated by her, and while he\u0027s in that state he will be easy to maneuver.\"\n \"Why?\"\n \"Because there is a streak of wildness in him,\" Caitlin stated. \"Most of the time he has it under control, but when it appears, he is vulnerable. I saw it the day he gave that lecture at Vincent and I saw it later when he nearly killed a man.\"\n \"Wonderful. Now we\u0027re dealing with a crazy man.\"\n Caitlin shook her head. \"No, far from it. I\u0027ve read the reports on him. He\u0027s definitely not crazy. In fact, he has great strength of mind, otherwise he wouldn\u0027t have survived his talent this long.\"\n \"Caitlin, you don\u0027t know that. You can\u0027t be certain. You\u0027re taking a huge risk.\"\n \"What do I have to lose?\"\n \"You know the answer to that as well as I do. You\u0027ve told me yourself that if you go through with this you\u0027ll never paint again. And if you stop painting I think you might decide to do something very drastic.\"\n \"You\u0027re being morbid.\"\n \"How would you describe your view?\" Tavi demanded tightly. \"You\u0027ve lived for years with no other goals but revenge and your art. If you satisfy your lust for vengeance and simultaneously cease painting, what will you have left?\" \n","sourceLink":"https://allnovel.net/gift-of-gold-gift-1/page-31.html","bookId":1797,"book":{"id":1797,"title":"Gift of Gold (Gift #1)","description":"Storyline: \n Destiny found them, and rapture, wild and free, opened their hearts... \n As she fled to safety in the dark of the Mexican night, Verity Ames could not see the man who had saved her from attack... but he was determined to see her again. Two months later, Jonas Quarrel appeared at her California restaurant. He was a scholar--looking for work as a dishwasher! Yet the stranger on her doorstep was also a man with a special gift and a hidden mission. What was the subtle, mysterious power he exuded? How and why had he found her? All Verity knew was that his lips burned hers, awakening a passion far beyond her fantasies . . . and that soon, she and Jonas would have to face the secret fury that threatened their love.\n \n","cover":"https://allnovel.net/images/gift-of-gold-gift-1.jpg","author":"Jayne Ann Krentz","type":"Romance","source":"allnovel","link":"https://allnovel.net/gift-of-gold-gift-1.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:23:42 PM"}}
