{"id":80454,"no":76,"title":"Page 76","content":"Verity wondered what the view was like from Jonas\u0027s window and smiled to herself as she recalled the annoyance in his eyes when he discovered he\u0027d been given a separate bedroom. Moving into Verity\u0027s Sequence Springs cottage had wrought an interesting change in the man. Jonas had become fiercely territorial in the past few days. Verity was still trying to decide how to adjust to this new, possessive side of her dishwasher-waitperson-handyman. She was also trying to decide how to deal with her reaction to having a lover under her roof. Her emotions were still jumbled in some ways, but diamond bright in others. She spent a lot of time warning herself that the situation was temporary at best and that she shouldn\u0027t allow herself to invest too much emotion in the man or the situation. Jonas had a talent for reading the past but he obviously preferred to ignore his own future. But Jonas showed no signs of wanting to leave Sequence Springs yet, and the more settled in he got, the more Verity began to think in terms of permanence. She was wondering what would happen if Jonas ever found another woman with whom he could \"anchor\" himself, when the door opened almost silently behind her. Verity spun around at the faint creak and saw who stood there. \"Oh, hello, Tavi. You took me by surprise.\" Verity summoned up a bright smile. She got no response. \"I was just admiring the view.\" Tavi looked at her with unhappy, anxious eyes. \"I want to talk to you.\" \"Of course. Have a seat.\" Verity indicated a black leather chair. Tavi ignored it. Her hands twisted together as she spoke. \"What\u0027s going to happen here is wrong, but I don\u0027t know how to stop it. I have done a great deal of thinking about it and I have come to the conclusion that only you can do something about it. You\u0027re the key, just as Caitlin says. That\u0027s why I want to talk to you.\" Verity stared at her. \"I don\u0027t understand what you\u0027re talking about, Tavi. Does this have something to do with Caitlin\u0027s decision to sell Bloodlust?\" \"It has everything to do with it,\" Tavi whispered fiercely. \"She must not sell it. It will be the end of everything. I think it will kill her.\" \"Oh, Tavi, no.\" Verity sighed and sank down onto the chair Tavi had ignored. \"I was afraid of something like this. The morning she told me of her plans, I wondered why she was so obsessed with selling this one last painting and then not painting again. Do you think she means to kill herself?\" \"I don\u0027t think she has thought about anything, including life or death, after the sale of the damned painting.\" Tavi looked at her pleadingly. \"You could stop this whole thing.\" Verity jerked her eyes up in astonishment. \"I could stop it? What on earth are you talking about? What could I possibly do to stop her from selling Bloodlust?\" \"You could take your lover and leave and never come back,\" Tavi whispered. Verity recoiled from the plea in the other woman\u0027s eyes. \"What good would that do?\" she managed to ask in a reasonably steady voice. \"If you leave she will be forced to cancel all her wild plans.\" \"Tavi, be reasonable. There\u0027s nothing to stop her from carrying out the auction without me. At least if I\u0027m here, I\u0027ll be able to talk to her afterward. We\u0027ll know then just how much the sale is going to affect her. You must see there\u0027s no point in forcing me to leave. I can\u0027t do anything for her if I\u0027m not around.\" \"It all hinges on you,\" Tavi rasped. \"Can\u0027t you see? Why do you think she invited you here? You and that man who watches you as if you were gold he must protect at all costs. You don\u0027t really think that under normal circumstances Caitlin would have made friends with someone like yourself? She has no friends except me. She has seduced you in ways you don\u0027t even comprehend. But your lover knows. I can tell by the way he acts around her. He knows she\u0027s dangerous to you but he doesn\u0027t know what to do about it. Only you can do something about it. Take him and leave. Now.\" \"Tavi, I don\u0027t understand any of this. You\u0027re not talking rationally. What is it you think Caitlin wants to do to me?\" The door opened again before Tavi could respond. Jonas stood on the threshold scowling at both women. Tavi glanced at him, turned, and walked swiftly out of the room. Jonas watched her go and then shut the door behind her. \"What was that all about?\" he asked, raising dark eyebrows as he scanned the bedroom. \"I don\u0027t know,\" Verity admitted. \"I think Tavi might be slightly unbalanced, Jonas. She was acting very strange. The one thing that was clear is that she\u0027s concerned for Caitlin. She worries about what Caitlin\u0027s going to do after she sells the painting.\" \"So what?\" Jonas began to prowl the room. \"You\u0027re worried about Caitlin, too. Hell, everyone seems to be worried sick about the poor, eccentric artist who\u0027s obsessed with selling one last painting. Let me tell you something, honey. Evanger is no fool and she\u0027s no innocent eccentric. She\u0027s got something up her sleeve. I can feel it. If you had any sense you\u0027d see it.\" \"Is that right? What do you think she\u0027s up to?\" Verity snapped, irritated. He shrugged his graceful, courtier\u0027s shrug. \"Who knows? It\u0027s probably got something to do with jacking up the price of Bloodlust until it\u0027s high enough to keep her in cocaine for the rest of her life.\" \"Jonas! That\u0027s enough. I don\u0027t want to hear you say anything like that again. Caitlin is no druggie and you know it.\" \"How do I know it?\" He stopped by the bed and stood staring at it with great intensity. \"I\u0027ll tell you something else I don\u0027t like. I don\u0027t like the way she\u0027s split us up tonight.\" \"We\u0027re guests in her home and we\u0027re not married,\" Verity said stonily. \"It\u0027s only natural she\u0027d give us separate rooms. We had separate rooms last time.\" \"This time it\u0027s different between us. You should have told her to put us together,\" he insisted, his attention still on the bed. \"Hell, we\u0027re lovers now. It\u0027s official. We\u0027re even living together.\" \"We\u0027ve been living together for all of a few days. That hardly constitutes a long-term relationship,\" Verity pointed out dryly. \"Be reasonable, Jonas. It would have been embarrassing for me to ask to have you moved into my room, especially when all the arrangements have been made for us to have separate rooms.\" \"You\u0027re embarrassed about having me for a lover?\" Verity pleaded silently with the heavens for forbearance. \"That\u0027s not what I meant and you know it. It\u0027s one of those social situations, Jonas. One does the polite thing. There are still certain proprieties, even in this day and age. One doesn\u0027t contradict the sleeping arrangements provided by one\u0027s hostess.","sourceLink":"https://allnovel.net/gift-of-gold-gift-1/page-76.html","bookId":1797,"book":{"id":1797,"title":"Gift of Gold (Gift #1)","description":"Storyline: Destiny found them, and rapture, wild and free, opened their hearts... As she fled to safety in the dark of the Mexican night, Verity Ames could not see the man who had saved her from attack... but he was determined to see her again. Two months later, Jonas Quarrel appeared at her California restaurant. He was a scholar--looking for work as a dishwasher! Yet the stranger on her doorstep was also a man with a special gift and a hidden mission. What was the subtle, mysterious power he exuded? How and why had he found her? All Verity knew was that his lips burned hers, awakening a passion far beyond her fantasies . . . and that soon, she and Jonas would have to face the secret fury that threatened their love.","cover":"https://allnovel.net/images/gift-of-gold-gift-1.jpg","author":"Jayne Ann Krentz","type":"Romance","source":"allnovel","link":"https://allnovel.net/gift-of-gold-gift-1.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:23:42 PM"}}
