{"id":80387,"no":8,"title":"Page 8","content":"Her feet hurt tonight. A peril of the restaurant business. The weekends were moneymakers but they took a lot of energy. She was never really sorry to see the arrival of Monday. Monday was the one day of the week the No Bull Cafe was closed during the summer and early fall. Soon she would start closing Sunday evenings, too. Winter was a quiet time in Sequence Springs. As Verity let the frothing hot water soothe and relax her weary muscles, she mentally chastised herself for running out of broccoli bisque earlier that evening. Jonas had seemed to think it was no big deal. But then, it wasn\u0027t his restaurant. Nevertheless, he had handled the situation with casual aplomb. He had simply removed the item from the chalkboard that listed the evening\u0027s specials and informed anyone who asked that there hadn\u0027t been enough good broccoli to make more than a limited quantity of soup. That last bit had been a small fib. There had been plenty of excellent broccoli. Verity simply had not properly estimated the amount she would need for Sunday night. Mistakes such as that generally annoyed her. But Jonas\u0027s calm attitude had made it easier for Verity to take the miscalculation more or less in stride tonight. It was almost as if Jonas had somehow shared the responsibility with her. That was a highly unusual sensation for Verity. She was accustomed to assuming all the responsibility for everything that happened in her life. Growing up as Emerson Ames\u0027s daughter had taught Verity how to take responsibility early on. Odd that Jonas had given her the impression she could share with him some of the difficulties of running the No Bull Cafe. From every indication he was just another irresponsible drifter, like her father. A man with too much intelligence and too little personal motivation. The combination of ability and lack of drive never failed to irritate Verity. But Jonas was giving her her money\u0027s worth and more at the No Bull, so she supposed she shouldn\u0027t be too critical. After all, he would soon drift back out of her life the same way he had drifted into it. Men such as Jonas never hung around any one place too long. The realization brought an unexpected rush of unhappiness. She wondered how she could have already gotten used to having Jonas around. It was a dangerous sign. But then, she had known from the beginning that Jonas Quarrel was a dangerous man. She had seen the ghosts in his eyes and she had felt the pull on her senses the first time she had opened the door to him. Instead of slamming that door in his face, she had allowed him to push his way into her serene, carefully controlled life. A wary part of her was beginning to wonder how big a price she would pay for her recklessness. But another part of her was already wondering just how reckless she could be with Jonas Quarrel. She had never asked that question in regard to any other man; had never needed to ask it; had never wanted to ask it. A thrill of anticipation went through her at the thought. Verity fought and failed to suppress it. \"Is this a private party or can the hired help join in?\" Verity\u0027s eyes snapped open at the sound of Jonas\u0027s dark, lazy voice. She blinked and saw him lounging with the grace of a Renaissance courtier against a white stone pillar, two cans of beer cradled in one lean hand. He was wearing his usual outfit of faded jeans and work shirt, but somehow he looked very much at ease in the elegant blue and white spa room. It struck Verity that Jonas had a knack for looking at ease, regardless of his attire or his surroundings. That indefinable air of nonchalance had been a prime goal of every Renaissance aristocrat, she knew. Whole books had been written during those years giving instruction on how to obtain the proper aura of casual power. The man who had it was quietly telling the world that he could and would handle everything that came his way. It betokened a controlled strength that did not need to be flaunted. It was the four-hundred-year-old version of the modem desire to appear cool. She wondered if Jonas had picked up the technique through his studies of Renaissance history or if it just came naturally to him. She strongly suspected the latter. \"The spa is officially closed at this time of night,\" she said rather stiffly. She wasn\u0027t quite sure she wanted to invite him into her private bathing retreat. On the other hand, he was already in the room. \"This is the women\u0027s section, you realize.\" \"I\u0027ll take the risk of getting caught trespassing. I\u0027ve been thrown out of better places than this.\" Jonas smiled faintly and came away from the pillar with a lithe movement. He strolled to the edge of the pool and crouched down near Verity. Then he popped the top off a can of beer and held it out to her. Automatically, Verity reached up to accept the beer. He was just being friendly, she thought. Perhaps he was a little lonesome. She eyed him warily and then thought about how hard Jonas had worked this weekend. \"I\u0027m sure Rick and Laura wouldn\u0027t mind if you used one of the pools,\" Verity said with studied politeness. \"And I guess it really doesn\u0027t matter that this is the women\u0027s section. At this time of night, resort guests aren\u0027t allowed down here. But Rick and Laura have always allowed me to use the place after hours.\" Jonas glanced around at the half-dozen pools in the tiled room. \"I\u0027ll use your pool,\" he announced. He unbuttoned his shirt and tossed it aside. Then he rose and tugged off his low boots. His hands dropped to the buttons of his jeans. Verity took a much larger swallow of the beer than she had intended. She choked as she looked up at the expanse of hair-covered male chest above her. It was obvious that Jonas was every bit as hard and lean and smoothly muscled as she had guessed. \"Uh, didn\u0027t you bring a pair of swimming trunks?\" she asked weakly. \"No.\" He was already stepping out of the jeans, revealing a snug-fitting pair of white briefs. For an instant Verity was half-mesmerized by the full, heavy male shape outlined by the white cotton briefs. Then she jerked her eyes back to her can of beer. She told herself the briefs covered as much as a pair of swimming trunks would. Then she reminded herself that she was twenty-eight years old; too old to be startled by the sight of a man in his shorts. \"The water\u0027s very warm,\" she cautioned thickly. \"Yeah.\" He put one muscled leg into the bubbling pool. \"Feels good.\" He settled down close beside her on the underwater bench. \"Damn good.\" He leaned back and rested his arms along the tiled edge of the pool. One sinewy forearm stretched out behind Verity\u0027s head. She was vividly conscious of its proximity. She was very conscious of the rest of Jonas\u0027s body, too. She considered sidling away from him and decided that that would look silly. The man was tired after a busy night, just as she was. He only wanted some relaxation. She could hardly blame him.","sourceLink":"https://allnovel.net/gift-of-gold-gift-1/page-8.html","bookId":1797,"book":{"id":1797,"title":"Gift of Gold (Gift #1)","description":"Storyline: Destiny found them, and rapture, wild and free, opened their hearts... As she fled to safety in the dark of the Mexican night, Verity Ames could not see the man who had saved her from attack... but he was determined to see her again. Two months later, Jonas Quarrel appeared at her California restaurant. He was a scholar--looking for work as a dishwasher! Yet the stranger on her doorstep was also a man with a special gift and a hidden mission. What was the subtle, mysterious power he exuded? How and why had he found her? All Verity knew was that his lips burned hers, awakening a passion far beyond her fantasies . . . and that soon, she and Jonas would have to face the secret fury that threatened their love.","cover":"https://allnovel.net/images/gift-of-gold-gift-1.jpg","author":"Jayne Ann Krentz","type":"Romance","source":"allnovel","link":"https://allnovel.net/gift-of-gold-gift-1.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:23:42 PM"}}
