{"id":80462,"no":85,"title":"Page 85","content":"\"Are you up here to deliver an opinion on modern art or are you just lost?\" Jonas asked.\n \"Shut up. Throw down that knife. Now.\"\n For an instant Jonas thought the man had guessed about the real blade that hung beneath his cloak.\n Then he realized with a vast sense of relief that the man was referring to the aluminum dagger. Here in the darkness the thing looked amazingly real. Obediently Jonas removed the fake and tossed it aside.\n \"Don\u0027t move.\" The gunman put the flashlight down on a nearby table, making certain it continued to illuminate Jonas. He reached for an object that hung at his hip and flicked a small switch. Then he released it. \"All right, let\u0027s go.\" He picked up the flashlight again and motioned toward the door with the gun.\n \"Go where?\"\n \"Outside. I just alerted Kincaid. He\u0027ll be along in a few minutes. We\u0027ll wait for him at the back of the house.\"\n \"Kincaid\u0027s carrying a pager?\"\n \"You got it. Now move.\"\n Jonas weighed the odds and decided to take a realistic view. There was no way he could get the knife out of its sheath before the gunman pulled the trigger. He turned slowly toward the door.\n \"What about the painting?\" he asked deliberately. If the man hadn\u0027t accomplished what he\u0027d been sent up here to accomplish, finishing the job might provide a distraction.\n \"Forget the painting. I\u0027ll take care of it later.\"\n Jonas glanced at the wall where Bloodlust stood. In the weak glare of the flashlight he could see that the painting was still draped in a white sheet. The intruder must have only recently arrived.\n Jonas and the man behind him made their way slowly down the back stairs. Jonas indulged a few useless fantasies of accidentally encountering another guest or two who might have slipped away from the salon to search for a bathroom, but that proved futile. This part of the house was deadly quiet.\n The gunman knew where he was going. He guided Jonas unerringly out the back door of the house. As they moved outside, Jonas got a clear view of the ski mask that shielded the man\u0027s features. They stood on the steps under the porch roof and waited.\n It had been raining on and off for the past couple of hours but now the drizzle had turned into a steady downpour. The noise of it was a steady hum above the distant sound of the surf.\n Kincaid appeared almost immediately. He stepped through the back door and eyed Jonas with cool satisfaction.\n \"So you got him, Tresslar.\u0027\" he said to the man with the gun. \"Excellent. That proved simple enough and it takes care of the main problem.\"\n Jonas shook his head. \"Your problems are just beginning, Kincaid.\"\n \"No, my friend. They are nearly over. I would like to know a little more about you and where you fit in to this, but I\u0027m afraid I can\u0027t risk taking the time to interrogate you. I don\u0027t want anyone realizing I\u0027ve left the party. Don\u0027t worry, though. I will question the little redhead instead. I\u0027m sure she\u0027ll be able to tell me a great deal about you.\"\n Jonas fought down the cold rage that threatened to swamp him. \"Verity knows nothing about any of this.\"\n Kincaid\u0027s mouth curved faintly and his eyes glittered with an unnatural excitement. \"We shall see.\n One thing is certain, I shall enjoy getting her to tell me what she does know. The experience should prove interesting. There\u0027s a certain sense of delicacy about her, a look of freshness that I find appealing. I have a feeling she will respond well to the stimulus of pain.\"\n \"I\u0027ll kill you if you so much as touch her,\" Jonas promised softly.\n Kincaid\u0027s smile widened. \"Brave words for a man who is about to become a ghost.\" He signaled to the gunman. \"Get rid of him. Don\u0027t use the gun unless it\u0027s absolutely necessary. I would prefer the death to look like an accident. You know what to do.\"\n Tresslar nodded. \"Yeah,\" he said laconically. \"I know what to do. But I didn\u0027t get a chance to check the painting, Kincaid.\"\n \"I\u0027ll take care of it myself later. Right now your priority is to get rid of him before he can cause any further trouble.\" Kincaid opened the back door and went inside the house without a backward glance.\n \"Well, that\u0027s that,\" Tresslar announced. \"Out of sight, out of mind, I guess. Let\u0027s go.\"\n Jonas gave him a thoughtful look. \"Where, exactly, are we going?\"\n \"To a place along the top of the cliffs where the fence is supposed to be broken. Kincaid described it to me. You, my friend, are going to have an accident. You\u0027d had a few drinks, took a little walk outside to get some fresh air, and got too close to the edge of the cliffs. Real sad.\" He lifted the nose of the gun.\n \"Move.\"\n Jonas turned and went slowly down the porch steps. The cold rain drenched his face and hair within seconds but the cloak provided some protection for the rest of him. The only consolation was that the gunman was getting equally wet. The spongy ground made a good excuse for slow progress toward the cliffs.\n \"I said move, Quarrel. I haven\u0027t got all night.\"\n Jonas deliberately stumbled in the mud but Tresslar made no attempt to get close enough to pull his victim back to his feet. He merely hefted the weapon with increasing impatience.\n Jonas got back to his feet on his own. As he did so he slid the knife he had retrieved from its hip sheath into the gathered sleeve of his shirt. Then he undid the fastening of the cloak, as if he intended to discard its doubtful protection.\n \"Leave the fancy little coat alone. It goes over the cliff with you,\" Tresslar said.\n It didn\u0027t take long to reach the cliff edge. Not nearly as long as Jonas would have liked. There was no time to create a distraction or come up with a brilliant plan of action for disarming Tresslar.\n One thing was certain: whatever happened at the top of the cliffs was going to be messy and totally lacking in finesse.\n \"All right, this is the place.\" Tresslar swung the flashlight\u0027s beam along the broken railing at the edge of the cliffs. The unconnected posts jutted out of the wet ground at an odd angle.\n Jonas swung around to face Tresslar, the edge of the cloak gripped in one fist in what he hoped looked like the white-knuckled grasp of a very nervous man. \"You expecting me to jump? If so, you\u0027re in for a long wait.\"\n \"You want a helping hand? Glad to oblige.\" Tresslar reached out and picked up one of the pieces of broken fence railing. Without any warning, he heaved it heavily toward Jonas.\n Under ordinary circumstances, a man would have instinctively stepped back to avoid the length of splintered wood aimed at his head. But a step backward in this case would be a step into the sea.\n Jonas realized what was happening as he saw Tresslar\u0027s arm move, but even so he was vaguely surprised at how difficult it was to stifle the instinct to get out of the way. \n","sourceLink":"https://allnovel.net/gift-of-gold-gift-1/page-85.html","bookId":1797,"book":{"id":1797,"title":"Gift of Gold (Gift #1)","description":"Storyline: \n Destiny found them, and rapture, wild and free, opened their hearts... \n As she fled to safety in the dark of the Mexican night, Verity Ames could not see the man who had saved her from attack... but he was determined to see her again. Two months later, Jonas Quarrel appeared at her California restaurant. He was a scholar--looking for work as a dishwasher! Yet the stranger on her doorstep was also a man with a special gift and a hidden mission. What was the subtle, mysterious power he exuded? How and why had he found her? All Verity knew was that his lips burned hers, awakening a passion far beyond her fantasies . . . and that soon, she and Jonas would have to face the secret fury that threatened their love.\n \n","cover":"https://allnovel.net/images/gift-of-gold-gift-1.jpg","author":"Jayne Ann Krentz","type":"Romance","source":"allnovel","link":"https://allnovel.net/gift-of-gold-gift-1.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:23:42 PM"}}
