{"id":81631,"no":13,"title":"Page 13","content":"So far I\u0027ve cleaned the bathroom, the oven, the refrigerator and vacuumed - twice. It\u0027s after nine and Emily still hasn\u0027t shown up. I\u0027m starting to think that her things are simply a mirage, or maybe she just didn\u0027t want to carry a lot of junk with her.\n Maybe she\u0027s staying with one of her school friends, and she didn\u0027t need her hygiene stuff. Maybe my earlier thought about what she would need to do for money wasn\u0027t that far off the mark. Maybe she\u0027s out doing something dangerous, or worse yet, something has already happened to her. There\u0027s no one but me to know she\u0027s missing. How long do I have to wait before I turn her in as a missing person? I know she has to be missing for at least twenty-four hours, but maybe she\u0027s already been gone for a couple days. Oh, God - what if she\u0027s hurt and lying somewhere. Maybe she only has minutes left and I can\u0027t get to her in time...\n \"Ow!\" I hit my head on the bottom shelf of the linen closet, cleaning the dried and caked shampoo from the floor when the sound of the door closing startles me.\n \"Emily?\" I hope it\u0027s her. If it\u0027s not, I\u0027m going to call the cops and lie and tell them she\u0027s been missing for days. I hear the slapping of tennis shoes against the linoleum, then a thud on the carpet. I turn and look down the hall to see a brown-haired beauty face down on the floor.\n \"Emily? Are you okay?\" I almost - almost - laugh when she looks up at me with her hair tangled in her face.\n \"Ethan, it\u0027s you! It\u0027s really you!\" She scrambles the rest of the way to me on her knees, spitting her hair out of her mouth and hugging me tighter than I can ever remember. Her smile is brighter than a sunny day at the equator. We settle on the couch, still holding on to each other. I can\u0027t seem to let go. I never want to let go.\n \"Where have you been?\" There doesn\u0027t seem to be any anger in her tone. How could she NOT be angry with me?\n I\u0027m ashamed at my answer. \"I drove. I didn\u0027t really go anywhere. I was just running away, Emily.\" I hang my head, embarrassed that I don\u0027t even have a good reason for leaving her.\n \"I know it won\u0027t make any difference now because you probably hate me, but I love you too, Emily. I have since...forever, and I\u0027m sorry I waited so long to tell you. I should have said it to you a week ago instead of running away like the coward I am. But, I can\u0027t hold back any longer without you knowing how I feel about you. I\u0027ve never been in love before, but I\u0027m pretty sure this is what it feels like. I can\u0027t think about anything else but you - how you laugh, the way you comb your hair, the way you smell right after the shower... God!\"\n Something stops my rambling, something soft, warm and moist. Emily\u0027s lips are on mine and her arms are wrapped around my neck. She\u0027s kissing me, and I don\u0027t ever want her to stop.\n Her mouth on mine is awesome! And I think about other things I want her to do with her mouth.\n While there are a hundred synonyms for how kissing Emily feels, the only thing in my head the at the moment is \"woo-hoo\". If I really think about what is actually happening, I\u0027ll make her stop. This is wrong - not the kissing part, but the part where she\u0027s willing to forgive all my sins and just take me back without a second thought. Now that I\u0027m thinking about it...\n Damn it! Now I\u0027m mad. I pull away while her lips linger. \"Emily,\" I sigh, not really knowing where to start. \"We have to talk about this,\" I motion between us. She nods begrudgingly. It\u0027s written all over her face; she thinks I\u0027m going to reject her again.\n \"Look,\" I pull her chin up so her eyes meet mine, \"nothing will change my feelings for you. They haven\u0027t changed in the last few years, and they won\u0027t change in the next few, either. What I have to know, though, is how you are feeling.\"\n She starts shaking her head, telling me not to worry, but that\u0027s precisely the problem. She should be angry with me.\n \"Emily, you should be upset with me. Yell, scream, hit - anything to let me know how you feel!\" I\u0027m almost shouting near the end of my declaration. I pull back and get myself in check before I completely lose it.\n \"Relieved.\"\n \"What?\" It\u0027s a stupid question because I heard perfectly well what she said. It\u0027s a stall tactic on my part.\n \"I\u0027m relieved, Ethan.\"\n \"Why aren\u0027t you-\"\n \"Do you know how many people there have been in my life who I cared about or who cared about me?\"\n I\u0027m pretty sure I know the answer. I\u0027m hoping it\u0027s two, but know for sure it\u0027s one - her mother - but I\u0027m always careful not to bring up LouAnne. I just squeeze her hand, which I\u0027m still holding onto like the piece of wood Leonardo DiCaprio was holding onto after his exit from the Titanic.\n \"Two, Ethan. Two.\"\n Now I\u0027m relieved.\n \"And one of them can\u0027t ever come back, but you did. You came back and I don\u0027t care where you went or what you did. You are here now, safe.\"\n The tremble in her voice as she says, \"what you did,\" tells me she\u0027s a little scared of what - or who - I might have done, so I hope I\u0027m about to put her fears to rest.\n \"I just drove and slept in my car. I ate a few times, but honestly, Emily, the only thing I did was think about you and how much you mean to me. I was an asshole for leaving you. I didn\u0027t take your safety or well-being into account and for that, I\u0027m sorry. You should be upset with me.\"\n \"I was scared, Ethan. At first, I thought maybe you were just blowing off some steam, off figuring out a way to tell me to leave, but when you didn\u0027t come home that first night or the next morning, I started to get worried. Then Margie came by and said you hadn\u0027t shown up for work.\"\n So, this is how Margie knows about Emily.\n \"I wasn\u0027t really sure how much she knew, but I could tell she was surprised to find me here. She was so nice though. I told her how highly you speak of her and how much we appreciated the deal she and her husband gave on the car. Then I lost myself for a little bit and told her about you surprising me and taking me to graduation.\" Emily pauses and smiles, then looks down as if she\u0027s a little embarrassed.\n \"It was nice to have a woman to talk to again. It reminded me a little of my mom.\"\n Emily continues to tell me about Margie coming to the house. She said she cried for a little bit because she didn\u0027t know what to do, that she\u0027d been relying on me for so long. She didn\u0027t know what she would do if I didn\u0027t come home. She also tells me how Margie asked her about a job and what she liked to do. It seems they went to the public library and Emily applied for a position. She can work there part-time and still go to school. Apparently, she works until closing and that\u0027s why she came home so late. Margie also got her a bus pass and rode with her the first time to make sure it was safe.\n There isn\u0027t a bouquet of flowers big enough for Margie right now. \n","sourceLink":"https://allnovel.net/vacant/page-13.html","bookId":1859,"book":{"id":1859,"title":"Vacant","description":"Storyline: \n Ethan Parker gets up every day, surviving the only way he knows how - alone. Orphaned as a child and forced into the child welfare system, he knows better than to depend on anyone but himself. He\u0027s learned trust is a word used all too often, but rarely earned. Ethan believes that his best chance for maintaining a simple and solitary existence is to live by a simple mantra: Don\u0027t get involved. Keep things simple. Take care of yourself! When a young woman moves in next door, Ethan is forced to reevaluate his beliefs. He tries to keep his distance, but his new neighbor\u0027s infectious smile and outlook on life leave him struggling with the decision of living the life he knows, or taking a chance on the unexpected. As Ethan develops a relationship with his new neighbor, Emily, he realizes nothing is simple and learns that life is about more than just surviving... it\u0027s about living.\n \n","cover":"https://allnovel.net/images/vacant.jpg","author":"Evelyn R. Baldwin","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/vacant.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:35:47 PM"}}
