{"id":81621,"no":3,"title":"Page 3","content":"\"I can\u0027t tell you how much I appreciate this, Ethan.\" She\u0027s wrapped tightly in one of my towels, and I feel a... stirring. I wonder if she understands she\u0027s half-naked in front of a stranger. I try not to be obvious in my perusal of her form; her body is small, but her tits are high, round, and a little large for her frame, though no complaints. I briefly wonder what her nipples look like, and lick my lips but catch myself before my ogling turns creepy.\n \"It\u0027s no problem,\" I answer hastily, refusing to look further at her.\n I stop short before making my next statement. No matter how much I tell myself to mind my own business, I can\u0027t seem to help dispensing advice. \"You know, you can\u0027t live without utilities, Emily.\" I wonder where this girl comes from that she thinks living with no water or electricity isn\u0027t a problem; my level of concern is now elevated a notch or two.\n \"I know, but - \" she stops herself. \"Yeah, I know.\"\n I have this feeling that there\u0027s something off here, and I can\u0027t ignore the fact she seems to be without essentials. \"I typically shower in the morning, so if you want to come over at night and shower until you get the utilities turned on, that\u0027s cool.\" I turn away, wanting to give her privacy to dress because she needs to get dressed; I need her to get dressed.\n \"So like, what do you do all day?\" I can hear the snap of the elastic on her panties against her hip as she finishes putting them on. Shit, these duplex units are too small! Or is my hearing that good? I can\u0027t help the thoughts that run through my head. Thinking about her body is a complication I do not need or want. However, chiding myself doesn\u0027t stop me from picturing the slight curve of her hips, her shapely thighs, or perfectly muscled backside.\n \"I go to work,\" I snap, feeling guilty. Seconds later, her voice is right behind me. \"Oh yeah? Where do you work?\" Her tone is light and her remark impulsive. \"I need to get a job.\"\n I turn so we\u0027re face to face and she can see my eyes. Sometimes, emotion seeps out through the eyes. I don\u0027t want her to see any vulnerability in mine. Once you\u0027re seen as weak, people are quick to take advantage.\n \"I work down at the grocery store.\" She smiles and looks down. She doesn\u0027t want me to see her eyes.\n \"That\u0027s really close, so I could walk there. You think they\u0027re hiring?\"\n \"Don\u0027t know.\" I have to keep it uncomplicated. Expanding on my answers will only lead to divulging more than I intend to offer. We stare at each other for a few more seconds before I break the silence. \"Well, I - \"\n \"Oh gosh, I\u0027m sorry. I\u0027ve done it again. You must have to get ready for your day. I come barging in here and ruin your routine!\"\n \"It\u0027s fine; I just have to take a cold shower before work.\" The words are heavy in the air. They aren\u0027t meant as they sound as I\u0027m sure she\u0027s used all the hot water in the small hot water tank, but after thinking about her showering and changing in my bathroom, perhaps a cold shower for another reason isn\u0027t a bad idea.\n \"Yeah, okay. I\u0027ll see you later.\" Great... now, she thinks I\u0027m a pervert.\n I don\u0027t see her for two days. . .\n And for 48 hours, I worry.\n -\n Don\u0027t get involved.\n Keep things simple.\n Take care of yourself!\n DAMN IT!\n It\u0027s 10 p.m., and I can\u0027t stand it anymore. I know something isn\u0027t right. No utilities, no furniture, wears the same clothes, and I can hear her. I hear the sobbing every night through the thin-ass sheetrock.\n \"Emily,\" I say in a slightly raised voice. Fucking non-existent walls.\n \"Yeah?\" she sniffles.\n \"Can I come over?\"\n The pause seems to go on forever before she answers. It\u0027s a \"yes\" mingled with sobs.\n Don\u0027t get involved.\n Keep things simple.\n Take care of yourself!\n It\u0027s too late. . .\n I sit on the edge of her mattress not knowing what to do.\n \"Thanks for coming over. Nights...they\u0027re the hardest.\"\n \"Emily? What\u0027s going on? Tell me the truth. I\u0027m not going to rat you out or anything.\" I chance a look at her face and the fear is evident. I refuse to focus on her in her thread bare tank and panties.\n \"You\u0027re not renting this place, are you?\" I surmise aloud. I think I\u0027ve known this for some time but just didn\u0027t want to admit it. Admitting it makes it real. Making it real means I\u0027m stuck; I can\u0027t walk away now, realizing what I know.\n \"Please! Please don\u0027t tell anyone!\" She\u0027s frantic, on the edge of mania. I scoot closer in hopes of easing her.\n Not too long after I moved into my first group home, the baseball my father gave me when I was seven, got stolen. It was one of the few personal items I owned. A staff from the group home tried to comfort me when I discovered it was missing by hugging me and patting my hair.\n I attempt to mimic the same gestures for Emily, because it\u0027s the only comfort I know. She clings to me like a lost swimmer gripping a buoy in an endless sea. Finally, she quiets and the knot in my stomach comes back. I know I have to find out what\u0027s really going on. I need to press her for more information since it seems I\u0027m intent on helping her.\n \"Tell me.\" \n","sourceLink":"https://allnovel.net/vacant/page-3.html","bookId":1859,"book":{"id":1859,"title":"Vacant","description":"Storyline: \n Ethan Parker gets up every day, surviving the only way he knows how - alone. Orphaned as a child and forced into the child welfare system, he knows better than to depend on anyone but himself. He\u0027s learned trust is a word used all too often, but rarely earned. Ethan believes that his best chance for maintaining a simple and solitary existence is to live by a simple mantra: Don\u0027t get involved. Keep things simple. Take care of yourself! When a young woman moves in next door, Ethan is forced to reevaluate his beliefs. He tries to keep his distance, but his new neighbor\u0027s infectious smile and outlook on life leave him struggling with the decision of living the life he knows, or taking a chance on the unexpected. As Ethan develops a relationship with his new neighbor, Emily, he realizes nothing is simple and learns that life is about more than just surviving... it\u0027s about living.\n \n","cover":"https://allnovel.net/images/vacant.jpg","author":"Evelyn R. Baldwin","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/vacant.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:35:47 PM"}}
