{"id":81622,"no":4,"title":"Page 4","content":"We sit in silence for quite some time, and I can tell she\u0027s nervous about telling me what\u0027s going on. I don\u0027t want to force her. When she\u0027s ready, she\u0027ll let me know. As I wait, I realize it\u0027s the first quiet night I\u0027ve had since she moved in.\n I really don\u0027t want to make assumptions because things aren\u0027t always what they appear. However, as I sit playing protector to this girl, scenarios run rampant through my mind. She has very few clothes. Irregular bathing does not bother her. She is careful, but trusting - not at all shy. She\u0027s young and alone; she has no furniture and no utilities. All evidence points to her being parentless and homeless.\n I can relate.\n Don\u0027t get involved.\n Keep things simple.\n Take care of yourself!\n Don\u0027t get involved.\n Keep things simple.\n Take care of yourself!\n Don\u0027t get involved.\n Keep things simple.\n Take care of yourself!\n No matter how many times I recite the mantra in my head, it\u0027s useless. This life isn\u0027t suited to girls who are alone, no matter how equipped they are to deal with the shit life flings at them. Women are taken advantage of in the blink of an eye when the opportunity is given. I make a mental note to be sure Emily doesn\u0027t suffer the same fate, particularly by my hand. I\u0027m sitting on Emily\u0027s mattress, my head against our shared wall. She\u0027s leaning into my side, quiet, in what I hope is peaceful sleep.\n After thinking this situation over for a while I shake my head, realizing I\u0027ve already talked myself into this, into helping Emily; I find it nearly impossible not to now. Eventually, I drift off with determination and the realization I\u0027ve opened a big-assed can of worms... for both of us.\n Hours later, my inner alarm clock wakes me. There is a little drool on my shoulder and it\u0027s kind of gross. I lay Homeless Girl down on her bare mattress and make note to bring over an extra set of sheets. Who knows where she even got the mattress? I\u0027m sure it\u0027s infested with who-knows-what. I may be poor, but I like clean. There are some things that shouldn\u0027t be bought in used condition. Shoes, underwear, and mattresses quickly spring to mind.\n During my run, I think about the upheaval I\u0027m getting myself into, and the reality of the situation is weighing heavily upon me. As a kid, I was lucky enough to be moved to a safe place where all my basic needs were met. I never had to fend for myself in the physical sense; emotionally, though? That was another story. I run an extra two miles trying to process everything. I decide this is my chance to pay it forward. I ignore my mantra as it only serves to confuse me further at this point. The fact remains I\u0027ve already gotten involved, and I try to rationalize how much trouble one small girl can really be. Part of me feels like it\u0027s none of my business what her personal situations is, but if I\u0027m going to help her, then I want some basic information. She doesn\u0027t have to tell me her life story, but I need to know her circumstances.\n After I get home from work and knock on the bedroom wall, I chuckle to myself thinking it may as well be a shower curtain for all the privacy the thin, flimsy wall provides. I yell, telling homeless neighbor girl I\u0027ve ordered pizza and she should come join me for dinner.\n \"You\u0027re the best! I can\u0027t believe you got us pizza!\" She won\u0027t stop gushing about how nice I am or how \"awesome\" the pizza is. When she came over, she looked a bit skeptical, like she wondered what I wanted from her in return, but I didn\u0027t even want to think about what that might mean.\n Food, clothes, shelter. That\u0027s all...\n As we eat, I try to think of the best way to bring up her state of affairs. I find that being direct is the best solution. I watch as she inhales her third slice of pizza, I rationalize I need to start referring to Emily by name. Calling her Homeless Girl and Neighbor Girl isn\u0027t helpful for either of us. I need to see her as a meaningful person, not a \u0027problem from next door\u0027. Emily needs to hear her name, if for nothing else, so she knows she exists.\n \"So, I have a couple questions. I\u0027ve been thinking about this since last night,\" I pause making sure she is receptive to my inquiry. She nods indicating her permission. \"Question number one: Where are your parents?\" She eyes me quickly, and then takes a bite of pizza, chewing slowly.\n She\u0027s stalling.\n \"I don\u0027t know my dad, and my mom passed away recently,\" she says quietly. I take her answer at face value because I know how difficult the loss of a parent is.\n \"Where were you living before?\"\n This time she\u0027s a little quicker to answer. \"We lived in shelters for a while. Then my mom got sick.\" She takes another bite of her dinner then continues. \"I know how things work. Since I\u0027m almost eighteen, there isn\u0027t too much the state will do for me. I would live in a home for a few months then get tossed out on the street. I figured I might as well get a jump on living, you know?\"\n I wonder how she\u0027s able to be so light-hearted about this. Emily\u0027s smiling which she tends to do on a regular basis. This girl - almost woman - has had some terrible circumstances, yet almost every time I see her, her smile brightens the room. I find her positive outlook on life is rubbing off on me.\n \"My next question was your age, but you\u0027ve already answered that. When do you turn eighteen?\"\n \"In a month,\" she replies. I take several minutes to think about the information she\u0027s just told me while finishing my own slice of pizza. Living in a shelter would explain her lack of inhibition. There is no such thing as privacy when you live with fifty other people. She\u0027s used to being watched.\n \"Hey, I went to the grocery store you work at today and filled out an application. I looked for you, but you must have been on break or something.\" I just nod; I don\u0027t need this complication spilling over to my work. As soon as I think it, though, I regret the thought. I can\u0027t think of Emily as a complication.\n \"They said they weren\u0027t hiring right now, but will let me know if something comes up. On my way home I stopped at the convenience store on Jamison. I found out they are hiring, so if the grocery doesn\u0027t work out, I could do that instead,\" she finishes, and then takes a fourth slice of pizza. I know my face pales, and she doesn\u0027t have a clue why. I have no idea how to tell this girl I don\u0027t even really know, occasionally uses my shower, and who I just referred to as a complication, that I don\u0027t want her to work in a convenience store because Dad was shot in the parking lot of a 7-Eleven. \n","sourceLink":"https://allnovel.net/vacant/page-4.html","bookId":1859,"book":{"id":1859,"title":"Vacant","description":"Storyline: \n Ethan Parker gets up every day, surviving the only way he knows how - alone. Orphaned as a child and forced into the child welfare system, he knows better than to depend on anyone but himself. He\u0027s learned trust is a word used all too often, but rarely earned. Ethan believes that his best chance for maintaining a simple and solitary existence is to live by a simple mantra: Don\u0027t get involved. Keep things simple. Take care of yourself! When a young woman moves in next door, Ethan is forced to reevaluate his beliefs. He tries to keep his distance, but his new neighbor\u0027s infectious smile and outlook on life leave him struggling with the decision of living the life he knows, or taking a chance on the unexpected. As Ethan develops a relationship with his new neighbor, Emily, he realizes nothing is simple and learns that life is about more than just surviving... it\u0027s about living.\n \n","cover":"https://allnovel.net/images/vacant.jpg","author":"Evelyn R. Baldwin","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/vacant.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:35:47 PM"}}
