{"id":88289,"no":18,"title":"Page 18","content":"\\n\\n Genevieve joined him then. He waved a hand toward the bras.\\n\\n “Have you got one up there?” he asked.\\n\\n “No.”\\n\\n “Interesting,” he said.\\n\\n She grinned. “We’re here for the tree,” she explained.\\n\\n “We are?”\\n\\n “There’s a legend that a woman was hanged from that tree.”\\n\\n “Legend?”\\n\\n “She supposedly haunts this place.”\\n\\n “More hauntings?”\\n\\n “Ghosts are all over in Key West,” she said with a shrug. “They say.”\\n\\n “But you’ve never believed in them?” he asked.\\n\\n “No,” she told him.\\n\\n As she spoke, the little girl at the nearby table began shrieking. “No! No, Mommy, no! There’s a lady in there.”\\n\\n “Ashley, shh. Honey, that’s just a story,” the mother said, distressed. “Ashley, please, let me take you in there. We’ll have an accident.”\\n\\n “Excuse me,” Genevieve told Thor, then walked over to the other table and hunkered down. She flashed a smile to the woman. “You need to go to the bathroom, huh?” she said to the little girl. “And you heard the story about the ghost lady who haunts the bathroom, right?”\\n\\n “She tried to hurt a little boy once,” the little girl told her, wide-eyed. “A man told us the story, and how the lady is still in the bathroom.”\\n\\n “Now, think about it,” Genevieve said. “If you were a ghost, would you really want to come back and hang around in the bathroom? Ugh! There are much better places to haunt. I’ve lived here my whole life, and my mom and dad came here with me lots when I was little. I’ve used the bathroom. Your mom will go with you. It will be fine, I promise.”\\n\\n The mother looked at Genevieve gratefully. “We really shouldn’t have let them hear quite so many stories,” she said apologetically.\\n\\n Genevieve laughed. “You’ll be fine, won’t you?” she asked the girl.\\n\\n Ashley laughed suddenly. “Ugh! Who would haunt a bathroom?”\\n\\n Genevieve rose. The woman stood, too, taking her daughter’s hand. “Thank you so much.” She paused. “You people are divers, aren’t you? And you’re the diver.”\\n\\n Genevieve frowned. “I’m a diver,” she murmured.\\n\\n “You were on television.” The woman lowered her voice. “We saw you.”\\n\\n “Oh?”\\n\\n “You saw that body they discovered this morning. In the water. You saw it days ago, but the police divers couldn’t find it—and then it washed up this morning,” the woman said softly.\\n\\n “Mommy!” Ashley tugged at her hand, apparently really ready to go to the bathroom now, ghost or not.\\n\\n “Um…have a lovely time in Key West,” Genevieve said. She spun around, her face pale. She hadn’t touched her drink, and she didn’t reach for it then. “Let’s go,” she said to Thor. “Please.”\\n\\n She was halfway down the block when he caught up with her, even though his strides were long and he moved fast.\\n\\n “Genevieve!”\\n\\n She stopped, turned around and looked at him.\\n\\n “Hey,” he said, taking her by the shoulders. “You knew there were news crews crawling all over the beach this morning!”\\n\\n “I didn’t give anyone an interview saying I’d seen that woman in the water,” she protested.\\n\\n “Then someone else did. Why are you so upset? I mean, you did see her down there. So what’s wrong?”\\n\\n She didn’t answer right away. She just stared with fixed interest at a middle-aged man walking his dog down the street.\\n\\n “I…it shouldn’t be so sensationalized,” she said.\\n\\n “A woman has been murdered,” he said quietly. “That’s serious news. Especially in a place where that isn’t—thankfully—a daily occurrence. People are going to talk.”\\n\\n “We shouldn’t be involved,” she murmured.\\n\\n Gen shook her head. He kept his hands firmly on her shoulders, forcing her to look at him.\\n\\n “Genevieve, it’s tragic, but it all makes sense, and you were right all along. There was a woman in the water.”\\n\\n She stared back at him, and her eyes suddenly held a veiled shield of bitterness. A dry sound, almost a rueful laugh, escaped her. “You don’t understand.”\\n\\n “Understand what?”\\n\\n “I saw a woman in the water.”\\n\\n “Right.”\\n\\n “No, wrong. I saw a woman in the water. But not the same woman!”\\n\\n He stared at her blankly. She wrenched away from him and, nearly running, disappeared into the crowd on Duval Street.\\n\\n 7\\n\\n J ay had been a cop a long time.\\n\\n He’d seen pretty bad stuff. Not much could compare to some of the auto accidents he’d seen on US1.\\n\\n But that afternoon…\\n\\n He’d been the city officer on the scene, while Charlie Grissom had been the lucky one from the county. They’d stood in the cool, antiseptic morgue alongside the medical examiner, Dr. Freeland, while the M.E., brusque and businesslike on all occasions, had pointed out the most important features of the body.\\n\\n The ankles—what remained of them—were given a lot of attention. Despite the many things he had witnessed through the years, Jay felt ill. Maybe it was the smell in the morgue. It was clean, but it had a chemical odor that reeked of death. Maybe it was the fact that the bloated body had filled with gas that was now escaping, and there was no disinfectant on earth that could disguise that fact. Maybe it was the girl’s face, which was now almost a caricature of life. Nothing seemed real, and yet it was painfully real at the same time.\\n\\n “When she went into the water, she was alive,” Dr. Freeland told them. “She drowned. That was her cause of death. She fought the ropes that were holding her down. If you’ll look, you’ll see where the skin on her ankles is ripped. And then there are her fingers. She tried desperately to free herself. I set the rope aside. I’m sure the crime lab will be able to discover something useful about it. This here—” he indicated the torn flesh and white bone at the ankle “—is where she broke free at last.” He gave them a weary grimace. “We all know the sea is a pretty brutal place. The fish ate away at the flesh and the fiber and…that’s how she surfaced.” He stared up at the two men. “Gentlemen, I’d guess, based on the tides, she went into the water off the southwest side of Key West. She was probably in deep water when she went in. It was five to seven days ago.”\\n\\n Freeland had a few more comments for them. They’d scraped her nails, but would have to wait for the lab results. She’d had a sexual encounter shortly before death, whether consensual or not, he couldn’t say from the evidence, but he tended to believe not. However, their perp had protected himself, and they weren’t coming up with any DNA.\\n\\n Freeland looked up at them. “I’ll have more for you in the next few days. I’m sorry to say this, officers, but it looks like you’ve got a murderer on your doorstep.”\\n\\n Jack enjoyed watching the news report over and over again. He thought he looked pretty damned good.\\n\\n He stared up at the screen in the bar. Every imaginable channel had showed footage of the morning’s discovery of the corpse—well, not the corpse itself. They showed the beach, the sheriff’s men, the crime-scene units and the people milling around. They had recorded several tourists’ reactions, the very brief seconds that Marshall had grudgingly given them, and then they showed him. It was great. As he spoke about the fact that one of their divers had actually found the corpse, they had caught a good picture of Genevieve, auburn hair billowing out behind her in the breeze, eyes sad, haunted, as she stared out at the water. The editor who had cut the segment had made good use of the footage. As Jack explained that the sea was an unforgiving resting place, so the killer’s intent to keep her hidden might well have worked, Genevieve, leaning against one of the support beams at the tiki bar, looked as if she might have been a sea goddess herself—or the figurehead from an ancient ship, fearing such a fate herself. He looked good, too, and they’d done a hell of a job making it into something more than a simple murder. Not that a murder was ever really simple. The dive hadn’t actually had a thing to do with the murder. And, cold as it sounded, people died on a daily basis. Even so, murder generated excitement. And he couldn’t help it—he was a publicity hog. He loved it.\\n\\n He didn’t notice at first when Bethany slid into the seat beside him. He hadn’t realized any of the group were still around.\\n\\n “Hey, Jack,” she said lightly.\\n\\n He turned to look at her. She was staring at the television screen. “How sad. Her whole life ahead of her, and she ran into the wrong person. It was hard to tell, but she looked young.”\\n\\n He looked up and felt a little pang. The woman who stared back at him was lovely, with a wistful look in her eyes.\\n\\n “Twenty-five to thirty…I would imagine,” he said. She gave a little shiver, looking back at him. “Jack, do you think she was killed here? In Key West?”\\n\\n “Anything is possible,” he said. “But most likely she was killed up the coast. Probably one of the beautiful people hitting the clubs on Miami Beach. You don’t need to be afraid. You’ve got a pack of he-men around you all the time, right?”\\n\\n Bethany laughed. “Yeah, I guess.” She stared back at the television and shivered again. “I might be hanging pretty close to you guys in the near future.”\\n\\n He set an arm around her shoulders and hugged her. “You can hang with me any time you want, cutie.” She was cute. She and Genevieve had always made a nice complement to each other. One tall and sexy, one small and sweet. In appearance, anyway. He gazed at Bethany with affectionate amusement. She’d had her wild times in high school, just like a lot of kids. But she’d grown into one damned fine woman, and he enjoyed her.\\n\\n “So,” she murmured, nodding a thank-you to Bruce, the evening bartender, as he handed her a light beer, “what have you done all day?” \\n\\n","sourceLink":"https://allnovel.net/the-vision-harrison-investigation-3/page-18.html","bookId":2269,"book":{"id":2269,"title":"The Vision (Harrison Investigation #3)","description":"Storyline: The Vision (Harrison Investigation #3) \\n The gift of sight comes at a dangerous price When Deep Down Salvage begins the hunt for the \"Josephine Marie, \" it seems like any other dive...until Genevieve Wallace sees the vision of a dead woman in the water, her vacant eyes boring into Genevieve\u0027s very soul. Terrified and confused by what she saw, Genevieve is haunted by the memory, but no one -- including her diving partner Thor Thompson -- believes her. When a dead woman washes up on shore, everyone assumes this is Genevieve\u0027s \"vision,\" but Genevieve knows the truth: the dead woman is \"not\" the ghost she saw but another victim of the same brutal killer. \\n Sensing that the threat of death is coming closer, she and Thor are forced to acknowledge that some things can\u0027t be explained, but simply \"are.\" Somehow they have to link a violent past with a present-day mystery or risk losing themselves in an abyss of terror.\\n","cover":"https://allnovel.net/images/the-vision-harrison-investigation-3.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-vision-harrison-investigation-3.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:26:25 PM"}}
