{"id":88294,"no":23,"title":"Page 23","content":"\\n\\n He lay awake while she slept. She was incredible. Hot, bright, electric. He was crazy, letting himself become involved with her. Because she was…\\n\\n Seeing ghosts. And he was being swept into her world as if into a vortex. He was crazy to let this happen, because…\\n\\n Because it was crazy to fall for someone who might be totally insane.\\n\\n There was no way Genevieve regretted what she had done. She had never become involved with anyone lightly, never without feeling something real—except, of course, when she entered into the ridiculous bet with Thor. But even then…as incredibly arrogant and obnoxious as she had found him, she had also found him compelling, even if only sexually at the time. Sadly, she mused, awaking in the morning, still comfortable and ridiculously secure in his arms, she had discovered she found him fascinating, not as arrogant as she had assumed, and not at all obnoxious. She cared about him. Worse, she really liked him and admired him.\\n\\n He had been kind to her last night.\\n\\n Kind? She didn’t want kindness. Although, she mused, they also had incredible chemistry. Which didn’t mean he wasn’t still questioning her sanity. After all, she had literally stripped for him and asked him to bed. Not too many men would have turned her down.\\n\\n So they hadn’t sworn eternal vows. She wouldn’t have wanted such a relationship, anyway. Real involvement meant so much more than sex, a true learning about each other. But…she did care about him. She didn’t want this to be an “I’m afraid and you’re great in bed” situation.\\n\\n But no ghosts had darkened her dreams when she had been with him. She had been completely involved, felt completely protected, even in sleep.\\n\\n He rose. She heard him enter the bathroom, heard the shower start. A few minutes later, he walked out in a towel—damn, he wore a towel well—and strode out to the kitchenette to put coffee on. She rolled out of bed, headed into the shower herself, and emerged in a towel, as well, just in time to be offered a cup of coffee.\\n\\n “Good morning. Are you sorry you’re here?” he asked her.\\n\\n She shook her head. “I came here of my own free will, remember?”\\n\\n “I’m still not sure why,” he told her.\\n\\n She was tempted to ask him if it really mattered so much. She refrained. “Good coffee,” she said instead.\\n\\n “It’s hard to mess up when it comes premeasured,” he said, studying her. He set his cup down and put his hand on her shoulders. “I actually thought you’d try to disappear by first light or something,” he told her.\\n\\n “No,” she said softly.\\n\\n “Should I slip you out somehow, pretend you were never here?” he asked, his voice pleasantly soft, a bit amused.\\n\\n “No. Not unless you don’t want people to know I was here,” she said.\\n\\n That brought a deep smile. She wasn’t sure what it meant.\\n\\n “I do have a lunch date, though. With Bethany. We’re going to see an old friend.”\\n\\n “Ah, yes. The mystic.” He made his voice spooky for the final word.\\n\\n She hoped she kept her tone level and her voice indifferent. “Don’t go telling anyone else, but Audrey is the first to admit she doesn’t see a thing. She does what she does to make money, and apparently she does well. Not a bad business to run in Key West.”\\n\\n He nodded, waiting.\\n\\n “Actually, though,” she admitted ruefully, “I didn’t exactly dress to be seen, and I imagine others are up and about now. Then again, I did walk through town in high-heeled sandals and a nightshirt.”\\n\\n “Ditch the sandals. The nightshirt could just be a bathing suit cover-up,” he told her gravely. “It will be just fine. Or, if you’d rather, you can give me the key and I’ll walk over to your cottage and get whatever you’d like. But first, you might want to tell me why you decided to walk through the streets of Key West in high-heeled sandals and a nightshirt.”\\n\\n She ignored the last. By morning’s light, he seemed taller and far more solid and entirely businesslike—sane, no-nonsense, living in the real world—more so than ever before. And, as she stood there, feeling his eyes on her, his hands on her shoulders, even more arresting. She was startled by the little pang that teased not just her senses but her heart. He was perfect. He loved what she loved. He seemed to have ethics she had never suspected. She wanted to…\\n\\n Sleep with him, yes. But also have breakfast, walk on the beach…curl up to watch a movie, go horseback riding…spend endless time with him.\\n\\n “If you’d go to my cottage for some clothes, that would be really great,” she told him.\\n\\n “All right.”\\n\\n But he was still staring at her. Then he began to smile. And she knew from that smile just what he was feeling. Like a current, the heat of arousal raced through her, quickening her muscles.\\n\\n He took the coffee cup from her, and then she was in his arms again. The towels were lost somewhere before they reached the bed. His every whisper, every move, was erotic. She wondered vaguely if that was simply because he was such an incredible lover, or because it was him. His breath against her flesh was a rapid-fire arousal. The brush of his fingers…the liquid of his kiss. And touching him…each ripple of muscle, pulse and tightness she created in him seemed to deepen her own sense of urgency and desire. In the end there was wildfire, sweet excitement, agony, longing, a climax that was violent and shattering…and the feel of his arms around her, as if she were the most wonderful woman in the world, the most cherished.\\n\\n And then, a soft sigh of regret. “I guess we should try the coffee thing again,” he murmured. He rose; she heard the shower again. She was tempted to rise, to slip in with him.\\n\\n But she had plans for the day, and they were important.\\n\\n Desperate, actually.\\n\\n He emerged, and she was somewhat surprised to see him dress as if for a casual business meeting, wearing black trousers and a short-sleeved tailored shirt. But he had refrained from pressing her, so she decided it wasn’t her business to ask him what he was doing.\\n\\n “Give me the key and tell me what you want, and I’ll try to find it,” he told her.\\n\\n Thirty minutes later, he returned, bringing her a choice of clothing. She thanked him, showered and dressed. He was sipping coffee on the porch when she emerged.\\n\\n “I imagine everyone is going to know we’re having an affair,” he told her, looking out across the sand. “I ran into Jack and Alex when I went to your cottage earlier.” He grinned at her. “They’ll all be talking about us today.”\\n\\n She shrugged. “I don’t mind if you don’t mind.”\\n\\n She was surprised when he studied her gravely. “I seldom, if ever, do anything I’d have to hide,” he told her. “Unless I was asked.” Then his smile returned. “Are we having an affair?”\\n\\n For some reason, the simple question seemed to give her a little thrill, a renewed sense of warmth.\\n\\n “I’d certainly hate to think I wasn’t going to be with you again,” she said softly.\\n\\n “I’ll see you later, then.”\\n\\n She smiled and started across the sand. Then she paused and turned back. “I’ll be at the tiki bar later, I guess.”\\n\\n “I have some things to do today. But I’ll make sure to end up there.”\\n\\n It was frightening to feel such a burst of happiness at his words. But she merely waved casually and started over to Bethany’s cottage.\\n\\n Bethany must have been watching, because the door opened before Genevieve even reached the porch.\\n\\n “Hey,” Bethany said. She was grinning from ear to ear.\\n\\n “Hey.”\\n\\n “That’s all?” Bethany grabbed her by the arm, practically dragging her inside. “‘Hey?’” She took a moment to stare into Genevieve’s eyes. “Oh, my God—you slept with him!”\\n\\n “Bethany—”\\n\\n “Details!”\\n\\n “No way.”\\n\\n “I knew it. I knew it from the first second I saw you two together. It was in the air. I got hot just watching the two of you stare at each other.”\\n\\n “Okay, okay.”\\n\\n “Was he incredible?” Bethany asked eagerly.\\n\\n “Bethany!”\\n\\n “Was he?”\\n\\n “Yes. Now can we go to lunch?”\\n\\n “Lunch? You wound up in his cottage for a night of total abandon, and you’re worried about lunch? I can’t believe you’re actually here.”\\n\\n Genevieve groaned. “Bethany…” She hesitated. “Bethany, I still need help,” she said softly.\\n\\n Bethany sobered instantly, putting her arm around Genevieve and pulling her tight for a minute. “It’s going to be fine. Really. But…wait,” she said, studying Genevieve’s eyes. “Something else happened. Oh, my God! That’s why you wound up at his cottage. You’d gone home, so what happened that made you come back here?”\\n\\n “Nothing happened. I just decided I wanted company.”\\n\\n “You’re a liar.”\\n\\n “I just didn’t like being alone.”\\n\\n Bethany looked at her shrewdly. “Let’s see. You’ve known me all your life. And Victor. And Alex is on our team. Marshall is like, well…he’s practically Uncle Marshall. Hell, you’ve even known Jack since you were a kid. But who did you run to? Thor Thompson.”\\n\\n “Bethany, we have to get going.”\\n\\n “So let’s go. You can give me the details as we walk.”\\n\\n “So you finally got Gen over to your place, huh?” Jack said, grinning. “You should feel privileged. That girl doesn’t play around. She’s seriously discriminating. She is one woman who can pick and choose. But she’s great, huh? Sorry, that’s not from experience. I just remember watching her grow up. She always promised to be extraordinary.”\\n\\n “She is a beautiful woman,” Thor said, regretting the fact that he’d stopped at the tiki bar before taking off. A phone call from Jay had come less than ten minutes after Genevieve had left. He was to meet him at the station at Stock Island in an hour. He was only here because he’d known he could get breakfast fast. But Jack had been here already, savoring an omelet. Victor appeared just as Jack finished speaking. \\n\\n","sourceLink":"https://allnovel.net/the-vision-harrison-investigation-3/page-23.html","bookId":2269,"book":{"id":2269,"title":"The Vision (Harrison Investigation #3)","description":"Storyline: The Vision (Harrison Investigation #3) \\n The gift of sight comes at a dangerous price When Deep Down Salvage begins the hunt for the \"Josephine Marie, \" it seems like any other dive...until Genevieve Wallace sees the vision of a dead woman in the water, her vacant eyes boring into Genevieve\u0027s very soul. Terrified and confused by what she saw, Genevieve is haunted by the memory, but no one -- including her diving partner Thor Thompson -- believes her. When a dead woman washes up on shore, everyone assumes this is Genevieve\u0027s \"vision,\" but Genevieve knows the truth: the dead woman is \"not\" the ghost she saw but another victim of the same brutal killer. \\n Sensing that the threat of death is coming closer, she and Thor are forced to acknowledge that some things can\u0027t be explained, but simply \"are.\" Somehow they have to link a violent past with a present-day mystery or risk losing themselves in an abyss of terror.\\n","cover":"https://allnovel.net/images/the-vision-harrison-investigation-3.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-vision-harrison-investigation-3.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:26:25 PM"}}
