{"id":88319,"no":49,"title":"Page 49","content":"\\n\\n “I called. I said I had business,” he protested.\\n\\n Marshall was a big guy, his size and musculature emphasized by his shaven head and tattoos, but despite that, he looked absolutely terrified.\\n\\n “You sure as hell better explain yourself better than that,” Thor snarled.\\n\\n His fingers were knotted into fists at his sides, and his tone had aroused something in Marshall, too, because suddenly he was bristling, as well. The air filled with a sudden rush of testosterone. She kept her position between the two men, hoping to keep them from coming to blows.\\n\\n “Calm down,” she said, and glanced at each man in turn.\\n\\n Marshall let out a long sigh, lowering his head. “There’s no way I can make you understand. I barely got out with my life.”\\n\\n “What the hell are you talking about?” Thor demanded.\\n\\n “There’s something in the water,” Marshall said. “Something that doesn’t belong there. It tried to drown me,” Marshall said. “It almost succeeded.” He pointed a finger at Genevieve. “It’s all your fault. Why the hell couldn’t you just leave me alone?”\\n\\n Genevieve opened her mouth, but words wouldn’t come.\\n\\n “Marshall, is this you talking—or the Scotch?” Thor asked.\\n\\n “I didn’t start with the Scotch until I encountered whatever the hell is down there.”\\n\\n “What was it?” Thor demanded.\\n\\n “I don’t know,” Marshall said, staring at them defiantly. “I never saw it.”\\n\\n “You’re not making any sense,” Thor said.\\n\\n “You had no right just to disappear. I thought you were one of the best men in the Keys.”\\n\\n “Once,” Marshall said, shuffling his feet.\\n\\n “Please,” Genevieve said. “I don’t understand.”\\n\\n Marshall stared at her, shook his head, winced. “There was something in the water. It kept tugging at me. It dragged me under. Let me up, dragged me under again. There were weird sounds, and…shit, you can’t smell in the water, but I could smell decay. It was trying to kill me. I mean it. I’m not going back there…at least not for a long, long time. Not until someone finds out what it is and kills it or…exorcises it or something. Don’t you understand yet? It was trying to kill me. And you brought it on, Gen. You brought it on when you went down and saw that…whatever.”\\n\\n Thor stared at him, his eyes narrowed. “Don’t blame Genevieve,” he said. “Blame the project, but don’t blame her.” He caught her hand. “Let’s go.”\\n\\n “Let’s go?” she echoed questioningly.\\n\\n “You heard him. He’s not coming back. And we have to go back. Just one word of advice, Marshall—lay off the Scotch. You feel like you can handle things again, you know where we’ll be. Genevieve, let’s go.”\\n\\n They returned to their rented boat. Thor had tied on to Marshall’s with so much haste he’d caused some minor damage to the hull, which they would have to pay for.\\n\\n Either he didn’t notice or he didn’t care.\\n\\n He was obviously struggling to obey the speed limit as they headed back down the river. He stared straight ahead. She went to stand by him.\\n\\n “He’s really terrified,” she murmured. She had worked with Marshall forever. She was angry, disappointed, hurt. But she still found herself defending the man who had been her boss—confident, professional, assured—for so many years. “And honestly, this isn’t like Marshall. I’ve seen him face a million threats and I’ve never seen him cave like this.”\\n\\n Thor didn’t look at her for a moment, but when he did, he smiled ruefully. “I don’t care what a guy looks like. Or a woman, for that matter. We all have some point deep in our psyche where we can be afraid. In Marshall’s case…who the hell knows what went on? But it isn’t your fault. You didn’t cause any of this.” He hesitated, staring straight ahead again. “I don’t believe in ghosts,” he said. Yet, the words were like a line in a script, like something he had said over and over that no longer held any conviction. “But if there were ghosts out there…” He shook his head. “I’ll start over. I don’t think anything intended to harm Marshall. Whatever happened, it just touched that raw edge deep inside where any human being can be vulnerable.” He fell silent again for a second, then offered her another smile. “Hell. We found him. He’s alive and well. We’ll just tell the others that. That he felt he needed some personal time. That’s kind of the truth.”\\n\\n “What if something down there did try to kill him?”\\n\\n “I don’t believe it,” Thor said simply. “I do believe a flesh-and-blood murderer is out there, and because of that, we need to be…not afraid, but wary. I believe that…that there are questions that have to be answered.”\\n\\n She stood next to him, not replying at first. Then she said. “We’ve found Marshall. Now we have to find Audrey.”\\n\\n He was quiet. She knew he was thinking they might never find Audrey, and that, if they did, she might already be dead.\\n\\n They made Genevieve’s house before dark.\\n\\n As they pulled into her driveway, Thor turned on his cell, which immediately began to ring.\\n\\n “Where have you been? I’ve been trying to reach you for hours.” It was Sheridan, and he sounded irritated.\\n\\n “Driving,” Thor said flatly. “What do you want?”\\n\\n “I read another one of the letters, and it’s too damn close to what that reporter rushed ahead and insinuated in the paper. If you’ve been on to something that you haven’t been sharing, you are entirely outside your contractual bounds.”\\n\\n “We’ve given you everything we found,” Thor said.\\n\\n “You have to get back down there,” Sheridan said.\\n\\n “As soon as I have police clearance.”\\n\\n Sheridan let out an irritated snort. “Can they cordon off the ocean? There was no reason for the dive to stop.”\\n\\n “A corpse is a good enough reason for me, Professor. Is there anything else?”\\n\\n “Can you get over here immediately?” he demanded.\\n\\n Thor maintained his temper, grimacing at Genevieve as she arched a brow at him. “I’ll run by. I’ll check with the police first and see if they need more time.”\\n\\n “More time? It’s an ocean, for God’s sake.”\\n\\n Sheridan was probably right; Thor was simply in the mood to buck him.\\n\\n “Are you off to see Sheridan?” Genevieve asked after he’d hung up.\\n\\n “You want to come?”\\n\\n “No,” she said emphatically.\\n\\n “I won’t be long,” he told her.\\n\\n “Just go now, and then you can get back fast. I’m going to call Bethany, find out what everyone is up to, see if they’re meeting later for dinner.”\\n\\n “I’ll go in with you first.”\\n\\n “It’s okay—I threw everyone out and locked the house,” she reminded him.\\n\\n “I’ll go in with you first,” he repeated.\\n\\n She smiled.\\n\\n They went through the same routine they had followed the first time. Thor didn’t really believe anyone was lurking inside, ready to assault Genevieve, but he had a feeling that something was brewing and it was getting closer and closer to an explosion.\\n\\n Her house, as he had expected, was empty.\\n\\n “Sure you don’t want to just come with me?” he asked.\\n\\n “We went through the house, and I’ll be fine,” she assured him.\\n\\n “Don’t go off without me,” he commanded.\\n\\n She shook her head. “I won’t. I’ll be waiting.”\\n\\n She walked him back to the door, smiling. He wasn’t sure why, but he hesitated. He felt as if his breath locked in his throat. He wanted to hold her, to refuse to leave her. He drew her into his arms instead and kissed her tenderly. When he eased his hold, she whispered, “What was that for?”\\n\\n For the fact that I love you…\\n\\n But he didn’t say the words. He wasn’t sure he’d ever before felt the way he did about her now. He had cared about women before, been deeply involved several times.\\n\\n But he’d never been in love, never felt as he did now.\\n\\n “Nothing. I’m going to get moving. Get this over with. It’s been a long day, but you’re right. I’d like to have dinner with the others, find out if anything they found out puts a new light on things. At least we can tell everyone Marshall’s alive and well. In fact, you might as well get started on that right now. We probably should have called earlier. I was just so…”\\n\\n “Mad?”\\n\\n “Yes. And…hell, never mind. I can’t explain it. I’ll hurry.”\\n\\n He didn’t need to explain. He knew she understood. He lifted a hand to her as he walked away and slid behind the wheel once again.\\n\\n She smiled and waved.\\n\\n He turned the key in the ignition, then he almost turned the car back off. Something was nagging at him, but he couldn’t put a finger on it.\\n\\n Reluctantly, he drove away.\\n\\n Genevieve watched Thor go, wondering why she had actually been anxious for him to leave.\\n\\n She locked herself inside, lowering her head pensively.\\n\\n She knew why.\\n\\n She was going to try to summon her ghost, and he wouldn’t understand.\\n\\n How to go about it?\\n\\n She should call Adam Harrison, she thought. She should call him and the others immediately, just as she had told Thor she was going to.\\n\\n But she was feeling the same sense of urgency that had plagued her all day. Yes, they had found Marshall, and Marshall was okay.\\n\\n And Audrey, she somehow knew, was not.\\n\\n Her heart was pounding as she went to the sofa and sat, closing her eyes and doing nothing but concentrating, trying to find out if it was possible to communicate with the dead, with the woman who had sought her out.\\n\\n Please, don’t let Audrey be dead already, she prayed silently.\\n\\n She leaned back and closed her eyes.\\n\\n Tried to relax. To clear her mind. \\n\\n","sourceLink":"https://allnovel.net/the-vision-harrison-investigation-3/page-49.html","bookId":2269,"book":{"id":2269,"title":"The Vision (Harrison Investigation #3)","description":"Storyline: The Vision (Harrison Investigation #3) \\n The gift of sight comes at a dangerous price When Deep Down Salvage begins the hunt for the \"Josephine Marie, \" it seems like any other dive...until Genevieve Wallace sees the vision of a dead woman in the water, her vacant eyes boring into Genevieve\u0027s very soul. Terrified and confused by what she saw, Genevieve is haunted by the memory, but no one -- including her diving partner Thor Thompson -- believes her. When a dead woman washes up on shore, everyone assumes this is Genevieve\u0027s \"vision,\" but Genevieve knows the truth: the dead woman is \"not\" the ghost she saw but another victim of the same brutal killer. \\n Sensing that the threat of death is coming closer, she and Thor are forced to acknowledge that some things can\u0027t be explained, but simply \"are.\" Somehow they have to link a violent past with a present-day mystery or risk losing themselves in an abyss of terror.\\n","cover":"https://allnovel.net/images/the-vision-harrison-investigation-3.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-vision-harrison-investigation-3.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:26:25 PM"}}
