{"id":105476,"no":45,"title":"Page 45","content":"The bartender at the Ski Shack liked what he saw—a good-looking woman in her early twenties, definitely not a working girl or junkie, with midnight hair and a face that looked like it had been exposed to books. At a distance her eyes were gray. They changed to a lovely pale green as she approached the bar and hoisted herself onto a stool three places down from where I sat.\n “Excuse me,” he said and hustled over to her without worrying whether I excused him or not. It took them a long time to decide that the woman wanted a vodka gimlet. Half a minute later, the bartender set the beverage in front of her and asked, “Do you want to run a tab?”\n The woman said she did. I wasn’t surprised that he didn’t charge the drink to the house. After all, business was business.\n “I should card you,” the bartender said.\n “Don’t I look twenty-one?” the woman answered.\n The bartender paused before answering. Perhaps he was distracted by her honeyed voice. The sound of it raised goose bumps on my flesh, and she wasn’t even talking to me.\n “You look like the snow-capped mountains of Tibet,” he said. “You look like the Brazilian rain forest. Like the islands of coral off the shores of New Zealand.”\n “Oh, brother,” I said.\n The bartender turned toward me. From his expression, I doubted that he considered me a scenic wonder. He pointed his finger at the woman and said, “Hold that thought.” To me he said, “What can I do for you?”\n “Tap beer,” I said. He listed some brands. I picked one. He poured the beer quickly and expertly and set it in front of me.\n “I’m investigating an incident that occurred here a while back,” I said. “Were you working here sixteen years ago?”\n It was a silly question, and he quickly told me why.\n “Sixteen years ago I was playing bantam hockey. How ‘bout you?”\n “Probably looking for a job.”\n “I was a Brownie,” the woman said.\n “Brownie?” asked the bartender.\n “A very young Girl Scout.”\n “You don’t look like a Girl Scout.”\n The bartender was flirting now, leaning on the stick, supporting his weight with his elbows. The woman was flirting back. She also put her elbows on the bar and leaned in.\n “You don’t look like a hockey player,” she said.\n “That’s because I still have all my teeth,” he answered, giving her a good look at all of them.\n “Is the owner available?” I asked.\n “Huh? No.” The bartender stepped back from the bar.\n “Do you expect him?”\n “He went out for an early dinner. He should be back in a little bit. Ski. Michael Piotrowski. Everyone calls him Ski. He can answer your questions. Sixteen years ago he was here. Thirty years ago, too.”\n “I’ll wait.”\n The bartender shrugged as if he couldn’t care less what I did just as long as I stopped interrupting him. He turned all of his attention on the woman. For lack of anything better to do, I studied the bar. There weren’t many customers. It was late afternoon, but still too early for the quick-drink-after-work crowd. The few people in the Ski Shack looked like they had been there all day and didn’t plan to leave anytime soon. Some seemed interested in a rerun of a poker tournament on ESPN. The rest didn’t seem to be interested in much of anything. Mostly they looked like people who needed the company of other people, even strangers. It was a phenomenon I understood quite well. When you’re my age and single and essentially unemployed, you tend to spend a lot of time alone. Sometimes you get lonely.\n I flashed on Nina Truhler—she had kept the alone feeling at bay for a long time now. Thinking about her made me regret my date with Benny Rosas. You should be at Rickie’s begging Nina’s forgiveness, not chasing skirts at a U of M art gallery, my inner voice told me.\n “Benny—I bet she hasn’t even voted in three presidential elections yet.”\n “Did you say something?” the bartender asked.\n I pointed at my empty glass, and he refilled it with Summit Ale.\n I forced myself to drink slowly. I had been hitting it too hard the past few days, and if I kept at it—it’s like the man says, if you try to use booze to solve a problem, one day you’re gonna discover that you have two problems. Still, I wasn’t too concerned about it. Especially when I saw my reflection half hidden behind several rows of assorted bottles in the mirror that ran the length of the bar. I had the look of a man who knew what he was doing and was proud of himself for doing it. It was the same look I had when I was a member of the St. Paul Police Department. \n","sourceLink":"https://allnovel.net/dead-boyfriends-mac-mckenzie-4/page-45.html","bookId":2222,"book":{"id":2222,"title":"Dead Boyfriends (Mac McKenzie #4)","description":"Storyline: \n Right up until they put him in jail, McKenzie thought the cops were kidding. After all, he did them a favor by stopping a rookie cop from roughing up a distraught woman at a murder scene. But the next thing Mac knows he\u0027s in jail, missing an important date with his girlfriend and reliving nightmares he thought he\u0027d finally left behind - and he\u0027s vowing payback for all of it. If that means sticking his nose into a crime investigation, well, he\u0027s done it before. \n Only, what appears to be a straightforward case of a cheating boyfriend, his alcoholic girlfriend and an opportune baseball bat proves far more complicated than the police are willing to accept. More disconcerting, as he investigates, Mac finds himself again fighting the influence of a shadowy figure who controls more of what goes on in the Twin Cities than a rational voter would believe. And then there are the unidentified thugs who kill a witness and rough up him and his female lawyer-ally. Soon Mac realizes that the truth of this sordid crime may be as hard to find - and as hard to live with - as the justice he seeks.\n \n","cover":"https://allnovel.net/images/dead-boyfriends-mac-mckenzie-4.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/dead-boyfriends-mac-mckenzie-4.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:45:13 PM"}}
