{"id":105480,"no":49,"title":"Page 49","content":"Another artist exhibited a loop of photographs of ordinary women going about their everyday lives on a computer screen. I couldn’t detect what linked them together except, well, they were all photographs of ordinary women going about their everyday lives. The four walls of the next room each held a single huge photograph of—I’m not making this up—a wall. The walls in the photographs seemed to be from an empty motel room or possibly an efficiency apartment. Three of the walls were blank. The fourth framed a small window and an air conditioner. Taken together I suppose you could argue that the photographs were meant to depict the emptiness of our lives, yet all I saw was a room badly in need of furniture, not unlike my own house. I was beginning to think that Benny had brought me there as a test of character. If I went screaming out of the gallery—and don’t think I hadn’t considered it—then I just wasn’t the man for her. I sucked it up and kept moving, all the while searching for her. I didn’t find Benny, but I did find an exhibit that I actually enjoyed—a series of woodcuts printed on silk. The prints were thirty inches wide and five feet high and hung from the ceiling in pairs, the images overlapping each other. One in particular I found fascinating. Looking at it from the front, I saw a hungry wolf stalking a woman who was on her hands and knees and drinking from a mountain pool. Stepping around and studying it from behind, the woman appeared to be stalking the unsuspecting wolf. After examining it for a few moments, I noticed that the face of the wolf and the woman morphed into one. I discovered a title card that accompanied the wolf-woman. It read PORNO WOLF GIVES ME A STOMACHACHE, B. ROSAS. I decided right then that artists should not be allow to title their own work. An arm looped around my arm. Benny’s voice said, “What do you think?” “Beautiful,” I said. She stepped back and spun in a small circle. Her full red cotton skirt swirled around tanned legs; a black fitted linen jacket embroidered with red flowers was tight around her torso. The jacket had three buttons, but only the middle button was fastened. “I told you I clean up real good,” she said. “Yes, you do. But I meant the silk screen.” I pointed at the wolf-woman. She slugged my arm playfully. “So where are you going to take me?” “Do you like the blues? Big Walter Smith and the Groove Merchants are playing at a barbecue joint in Uptown. Otherwise . . .” “That sounds like fun.” “Good.” I continued to study the silk print. “You really like this piece of junk?” Benny said. “Yes. I like it very much.” “Why?” “I’m not sure. Maybe because it asks questions that demand answers. Who’s the hunter, who’s the prey? It tells a story—I just haven’t worked it out.” “The story could be different for everyone who looks at it,” Benny said. “Isn’t that the definition of art? That it affects us all differently depending on what each of us brings to it?” Benny shrugged. “What about the rest of the show?” “That depends. Do you know these people?” “Most of them.” “Then I think it’s all just swell.” “I think it’s mostly self-indulgent bullshit.” Something in my expression must have convinced her that I was surprised by her announcement. “I’m a skeptic.” Benny was speaking quietly so no one else could hear. “I’m skeptical about the place of visual art in society. Such a very small segment of the population will actually see it, and not necessarily the people I care about. It’s a very insular world, the art world. All of the art in this show—it’s for the artists. We love it, only I’m not sure what everyone else gets out of it. “Personally, I don’t want to have my stuff shown only in museums and galleries to this tiny group of people. I’d rather do stuff for people like me, people who have real lives, if you know what I mean. I want to do stuff for people who might pay two hundred bucks for a piece and take it home and get some pleasure out of owning it.” “Do you have something in the show?” Benny pointed at the silk screens hanging from the ceiling. “How is that possible?” I asked. “Someone has to do it.” “No, I mean—this is wonderful, Benny.” “Thank you.” “It really is.” “Thank you.” “But isn’t this for students?” “Yes, part of their MFA thesis.” “At the risk of being insulting, you’re what, twenty-eight, twenty-nine? How can you be a student?” “I’m thirty-five, and I do not find you insulting in the least.” Which means she could have voted in four presidential elections, my inner voice told me. “It’s a three-or four-year program, and yes, most of the students are much younger,” Benny said. “As for me—I took a few years off after I got my BA and then took the course part-time.” “While working in the sewers of Minneapolis,” I said. “Inspiration is where you find it.” “What are you gong to do now that you have your MFA?”","sourceLink":"https://allnovel.net/dead-boyfriends-mac-mckenzie-4/page-49.html","bookId":2222,"book":{"id":2222,"title":"Dead Boyfriends (Mac McKenzie #4)","description":"Storyline: Right up until they put him in jail, McKenzie thought the cops were kidding. After all, he did them a favor by stopping a rookie cop from roughing up a distraught woman at a murder scene. But the next thing Mac knows he\u0027s in jail, missing an important date with his girlfriend and reliving nightmares he thought he\u0027d finally left behind - and he\u0027s vowing payback for all of it. If that means sticking his nose into a crime investigation, well, he\u0027s done it before. Only, what appears to be a straightforward case of a cheating boyfriend, his alcoholic girlfriend and an opportune baseball bat proves far more complicated than the police are willing to accept. More disconcerting, as he investigates, Mac finds himself again fighting the influence of a shadowy figure who controls more of what goes on in the Twin Cities than a rational voter would believe. And then there are the unidentified thugs who kill a witness and rough up him and his female lawyer-ally. Soon Mac realizes that the truth of this sordid crime may be as hard to find - and as hard to live with - as the justice he seeks.","cover":"https://allnovel.net/images/dead-boyfriends-mac-mckenzie-4.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/dead-boyfriends-mac-mckenzie-4.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:45:13 PM"}}
