{"id":105508,"no":78,"title":"Page 78","content":"Nina set the coffee beans on the bar top. “What brings you out tonight?” she asked. “You know it’s going to rain.” My plan on the drive over was to grovel. Grovel without shame, embarrassment, or pride. Only seeing her in front of me—The Nina I had come to know and love had no respect for groveling. I tried a different approach. “I was thinking. . .” “Yes?” she said. “For the last couple of days all I’ve been thinking about is you, and us, and how much I messed up the other night, because . . .” “Because?” “Because I didn’t tell you what I wanted to tell you, and I’ve been thinking about it ever since.” Nina leaned across the bar. “What did you want to tell me?” she said. I bent toward her, slipped my hand behind her head, and held it there as I kissed her mouth. The kiss wasn’t quick, but I broke it off before it could become something more. “That’s what I wanted to tell you.” I stepped back. I smiled at her. She smiled back, but it lacked the light-up-the-world brilliance that I had hoped for, that I was accustomed to. I had blown it. “I’m sorry,” I said. I took another step backward. “I should go.” “Hey,” Nina said. Then, “Hey,” again. She rounded the bar and closed the distance between us. Her head listed forward, hesitated, then pushed forward again and kept going until her lips were pressed firmly against mine. She kissed me for a long time. The world changed with her kiss. Suddenly, I was an exhausted explorer discovering a new land. I liked it there. I wanted to live there. When our lips parted, she smiled her usual confident smile and said, “I like men who know how to express their feelings.” I hugged her tight and muttered her name a few times. “That’s what I’m talking about,” Jenness announced from behind the bar. We both turned toward her, and she immediately glanced up and down and around, looking anywhere but at us, pretending she wasn’t eavesdropping. It was then that the storm finally broke over St. Paul. Rain fell, intermittently at first, then in torrents. Lightning flashed, thunder roared. “Would you like to stay for the storm?” she asked. I nodded and grinned, a child accepting a special treat. She guided me to an empty table and we both sat. “I want to thank you for not slugging Daniel the other night. I know you wanted to.” “Not in your place,” I said. “Never in your place.” “I know you were angry.” “I wasn’t angry at him. Well, yes, I was angry at him, but mostly I was angry at something else.” “You were angry because I was dating him.” “You have every right to date whomever you wish.” “No, I don’t. After all the time we’ve been together—listen—the only reason I did it, the reason I had dinner with him the first time, was because he had asked when we were at the ball. The man dropped everything to help me out. How could I refuse?” “What about the second time?” “I did it to annoy you,” Nina said. “I saw you parked outside my house, McKenzie. I recognized your car. You were spying on me. That was just plain psycho.” “I know, but. . .” “But what?” “Why did you invite what’s-his-name into your house? Why didn’t you shake hands and say thanks at the door?” “I told you. I saw you parked outside and I wanted to give you something to think about. If you had waited another five minutes, you would have seen me push him out the door.” “Oh.” “Oh,” she said, her tone mocking. “Sorry,” I said. “Why did you do it?” “I was concerned . . .” “Concerned for my safety?” “No, for my safety. There hasn’t been a moment since we met when I wasn’t aware that you could do better than me.” Nina waved a playful finger at my face and smiled. “That was a good line,” she said. “I like it.” “It also has the virtue of being true.” “Ahh, McKenzie. It isn’t true. If you’d been involved with as many men as I have, you would know that.” “How many men . . .?” “Never mind.” “I shouldn’t have been jealous,” I said. “I shouldn’t have given you reason to be jealous.” “I should have realized that you were trying to make me jealous.” “We need to work on our communication skills.” “Talk more.” “Yes. For example . . .” Nina gently stroked my cheek with her fingertips. “Tell me about your face.” “I had a run-in with a guy yesterday, no big deal.” “I think it’s a big deal,” she said. So I told her about it; told her about yesterday and today, told her everything. Except I didn’t tell her about my dream—maybe some other time. And I didn’t tell her about Benny—maybe never. “You take too many chances,” Nina said. “This preoccupation with doing favors for others. Did you ever think of just working with a charity? The American Red Cross is always looking for volunteers.” “You don’t think they take chances?” “Not like you. Besides, they’re actually concerned with helping people.”","sourceLink":"https://allnovel.net/dead-boyfriends-mac-mckenzie-4/page-78.html","bookId":2222,"book":{"id":2222,"title":"Dead Boyfriends (Mac McKenzie #4)","description":"Storyline: Right up until they put him in jail, McKenzie thought the cops were kidding. After all, he did them a favor by stopping a rookie cop from roughing up a distraught woman at a murder scene. But the next thing Mac knows he\u0027s in jail, missing an important date with his girlfriend and reliving nightmares he thought he\u0027d finally left behind - and he\u0027s vowing payback for all of it. If that means sticking his nose into a crime investigation, well, he\u0027s done it before. Only, what appears to be a straightforward case of a cheating boyfriend, his alcoholic girlfriend and an opportune baseball bat proves far more complicated than the police are willing to accept. More disconcerting, as he investigates, Mac finds himself again fighting the influence of a shadowy figure who controls more of what goes on in the Twin Cities than a rational voter would believe. And then there are the unidentified thugs who kill a witness and rough up him and his female lawyer-ally. Soon Mac realizes that the truth of this sordid crime may be as hard to find - and as hard to live with - as the justice he seeks.","cover":"https://allnovel.net/images/dead-boyfriends-mac-mckenzie-4.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/dead-boyfriends-mac-mckenzie-4.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:45:13 PM"}}
