{"id":14237,"no":5,"title":"CHAPTER IV BISHOP CLIFFORD’S THEORY","content":"The theories about the Alfred Jewel which have been noticed hitherto, belong to the crude attempts at interpretation which were evoked by the surprize of the strange discovery in the last decade of the seventeenth century. We come now to a new theory which was broached in our own time by Bishop Clifford, in his Inaugural Address as President of the Somersetshire Arch?ological Society in 1877, when the Annual Meeting of that Society was held at Bridgwater. This theory demands a fuller attention than any 32 of the foregoing, first, because it bears manifest tokens of maturer thought, but further, because there is much curious material woven into its fabric, which gives it independent value. If only for the single fact that it introduces a new explanation of the problematic ‘?stel,’ it ought to quicken the interest of every reader. It will be better on all accounts that the ideas of the author be presented in his own words: Amongst the articles of church furniture used in the middle ages, frequent mention is made of ‘Baculi Cantorum,’ or choir staves. In the year 1222 there were eight such staves in the treasury of Salisbury Cathedral. ‘The staves at Canterbury Cathedral (writes Dr. Rock, Church of our Fathers, vol. ii) were as rich as they were curious, in the year 1315.’ He gives a list of them, and among them are ‘IV baculi de cornu, cum capitibus eburneis’—four staves of horn with ivory handles; others were adorned with gold and silver and precious stones. The use of these staves was to enable the Cantor or master of the choir to point out to the singers and to the readers their places in the book, and so prevent the manuscripts and their illuminations being soiled by the touch of fingers. When the lessons were read, the choirmaster not only pointed out the spot where the lesson commenced, but handed, if necessary, the staff to the lector, that he might use it to guide his eye along the lines in reading. This precaution was not only observed with regard to those beautifully illuminated volumes used for the church services,33 but was equally, if not more so, required in the case of books which were intended for the use of the general public. Most readers required to use their fingers to assist their eyes in following the lines, a practice which, if allowed, would not only soil the manuscripts, but in course of time obliterate them. Therefore when books were intended for public use it was customary to place by them a small staff or pointer for the use of the reader, even as in modern days a paper-knife forms one of the ordinary articles of furniture on a library table. In many instances these little staves or pointers were inserted in the binding of the books themselves, something after the fashion in which pencils are inserted in modern pocket-books. I may seem to be widely departing from Alfred and from Athelney, but you will soon perceive the pertinency of these remarks. Alfred, as you know, did much to encourage learning amongst his subjects, and he was especially anxious that useful works should be translated into English, and copies of them be arranged in public places, where all might gain access to them and read them. To encourage this good and noble work by his example he became himself an author. And he thus describes, in the preface which he wrote to the book he translated, the steps he took to start what I may call the first public reading in England:—‘When I reflected,’ he says, ‘how the knowledge of the Latin tongue had fallen away throughout England, though many still knew how to read English writing, I began in the midst of divers and manifold affairs of this kingdom to turn into English this book (of St. Gregory the Great) which in Latin is named Pastoralis, and in English, The Herdsman’s Book; sometimes word for word, and sometimes34 sense for sense, even as I had been taught by Plegmund my Archbishop, and Asser my Bishop, and Grimbald my Mass-Priest, and John my Mass-Priest. After I had learned of them how I might best understand it, I turned it into English. And I will send a copy to every bishop’s see in my kingdom, and in each book there is an aestel (i.e. a staff) of (the value of) 50 mancusses; and I command, in God’s name, that no man take the staff from the book, nor the book from the minster, seeing that we know not how long there shall be such learned bishops, as now, thank God, there be. Therefore I command that these remain always in their places, unless the bishop have them with him either to lend somewhere, or to have other copies made from them.’ Here, then, we have the explanation of Alfred’s gem. It is the handle of a book-staff or pointer which, like those at Canterbury, and elsewhere, was made of horn (which has perished), the handle itself being of precious and durable materials. The inscription on it bears witness that it was made by Alfred’s order, ‘Aelfred had me worked;’ and this circumstance, taken in conjunction with the costliness of its material and the beauty of its execution, makes it in the highest degree probable that it is one of those aestels which Alfred says were worked by his order, and inserted in the presentation copies of his translation of The Herdsman’s Book, and which were valued at 50 mancusses, or (taking the value of the mancus at 7s. 6d.) ￡18 15s., a large sum for those days. But if so, how came this gem to be found in this neighbourhood? Alfred presented one to each bishop’s see in his kingdom, and there was no bishop’s see in those days in these parts nearer than Sherborne, in Dorsetshire. You will35 have remarked that Alfred in his preface mentions four persons who assisted him in translating the book: Plegmund, Archbishop of Canterbury; Asser, Bishop of Sherborne; the Priest Grimbald, who presided over the school which Alfred had founded for the training of the English youth; and the Priest John, who was placed by Alfred as abbot over the monastery which he founded at Athelney. Copies of the book, each having a book-staff, were sent to Plegmund and Asser, for they both were bishops. Can there be any reasonable doubt that this mark of attention was equally observed in the case of the other two collaborators? More especially as Grimbald was at the head of Alfred’s school, and it was in order to promote English reading that Alfred had undertaken the translation of the book, and John, though not a bishop, was abbot over the monastery which Alfred himself had built in gratitude to God for the victory he had gained. A copy of the book, with the costly aestel in it, was no doubt sent by Alfred to his friend John, at Athelney, as well as to the other three collaborators. The book and the staff were, agreeably to Alfred’s order, preserved in the minster, till, in the days of trouble, (probably at the dissolution of the monastery,) both were hidden out of sight, and for that purpose buried in the grounds of some neighbouring friend at Newton Park, in the hopes of recovering them in better days. As time passed on, the secret of the place where they were hidden died with the man who had hidden them; and when after many years chance revealed the place of the deposit, the book itself and the perishable portion of the staff had rotted away, leaving only the gold and crystal handle, with the words, ‘Aelfred had me worked,’ to tell the tale. This I believe to be the true history of Alfred’s gem. 36 When I visited the Ashmolean Museum at Oxford, in the month of July, I was shown by the courteous Curator, by the side of Alfred’s jewel, a smaller specimen of ancient goldsmith’s work which was dug up a few years ago at Minster Lovel, in Oxfordshire, on the site of an ancient abbey. It is smaller than Alfred’s gem, but, like the latter, it is evidently the handle of a reading-staff. The handle of Alfred’s staff was made of a size that might be conveniently grasped in the hand; the one from Minster Lovel was intended to be held between the finger and thumb. It is smaller and less costly, but the workmanship of the gold is so like the larger one of Alfred as almost to suggest its being the work of the same man. Thus Bp. Clifford would fain persuade us to see in our Jewel the costly handle of a pointing stave. This satisfies the requirement of the socket and rivet, which is a fit provision for the insertion of a fine stave. The only question at this point that could be raised in opposition is, whether the socket is not too small to admit a stave of useful thickness for the purpose contemplated. And as the author of this theory has applied it equally to the Minster Lovel jewel, this objection gains in force, as the rod that could be inserted in that little jewel would be of very doubtful service as a pointer. 37 But when we consider the common elements in the design and workmanship of these two jewels, we are compelled to reject the theory that they were intended as handles to pointers. And first of the design. Both of these jewels have an obverse and a reverse, which in such an instrument would not only be unnecessary and unmeaning, but absolutely inconvenient and detrimental. Both of them are obviously designed to gratify the eye; as objects to be displayed in positions which they are to adorn and beautify. The Alfred Jewel contains the picture of a man in enamel, framed in golden filigree, glazed with crystal, and backed with a plate of gold curiously engraved; the whole composition plainly dictates which side is to be foremost and which end is to be uppermost when it is fixed in the position for which it is intended. Bp. Clifford’s theory cannot be accommodated to these conditions. So much for the design: now as to the materials and workmanship. In both of these jewels the outer surface is filigree work of very fine texture; can it be imagined that this agrees with the suggested use of a handle to38 a choirmaster’s wand, whether we consider the implied defacement of the finest goldsmith’s work, or the galling friction to the musician’s hand? But besides appropriateness of design and workmanship, there is yet another condition to be satisfied, and one which this theory can only meet by means of a roundabout and arbitrary hypothesis. Any interpretation of the Jewel, to be satisfactory, must harmonize naturally and spontaneously with the Alfredian associations of the spot on which it was found. Bp. Clifford has felt this, and he has employed an elaborate machinery to meet it. The place of the find is one that naturally suggests direct and immediate connexion with the goings and comings of the king himself, for it lies near the centre of that region in which he spent some months of acute effort in the most critical juncture of his diversified and adventurous life. If our interpretation harmonize with the associations which are linked to the spot, and through the spot to the Jewel, probability is strengthened while the interest is heightened; but what possibility is there of bringing these39 associations to bear upon a costly book-pointer? If anything so extravagant existed, it might be preserved in the treasury of the minster or in the book-room of the cloister; but it could have no place about the person of a fugitive king and a struggling warrior. Accordingly the author of this theory is compelled to detach the interpretation from the personal history of the king, and to rest his solution of the problem upon a highly speculative assumption combined with the chances and vicissitudes of a later age. The author of this theory has to face the inevitable question—On the supposition that the Alfred Jewel is the handle of a book-pointer, how do you account for its being found in the neighbourhood of Athelney? In preparing to answer this question, he fetches a wide compass, enclosing in his sweep the literary achievements of the king, and seven centuries of the after-time. He begins by recalling Alfred’s acknowledgements to Plegmund, Asser, Grimbald, and John, for their help in his translation of Gregory’s Pastoral Care, and he recites the king’s statement that he would send a copy of40 the translation to each bishop’s see, and with each book an ‘?stel’ worth 50 mancusses. It is an essential part of his theory that the ‘?stel’ was a book-pointer with a costly handle, and moreover that the Alfred Jewel was one of these handles. But there was no bishop’s see at or near Athelney, the nearest being at Sherborne: how then did this relic find its way to Newton Park by Athelney? The answer is that John the Priest became abbot of Alfred’s foundation at Athelney, and that there can be no reasonable doubt that Alfred gave the book and ‘?stel’ not only to Plegmund and Asser, but that he also extended his bounty to Grimbald and John, his two other collaborators[11]. So the Alfred Jewel having thus arrived at Athelney as the handle of a book-pointer, was religiously preserved there until the time of Henry VIII, when it was buried to await better times, and in the course of nature forgotten. My objection to this is not that it is imaginative, but that it is ill suited to its purpose, because it is needlessly cumbrous, and41 because the Jewel can be traced to Athelney by a much simpler and more obvious process. But while I find it impossible to admit Bp. Clifford’s theory as an interpretation of the Alfred Jewel, seeing that this relic absolutely refuses to be classed with the decorated handles of the baculi cantorum, I must add that the question of the ‘?stel’ stands apart. I am by no means prepared to maintain that the explanation of that problem which I have recently offered in Alfred the Great is preferable to Bp. Clifford’s. There is a close affinity between the two explanations; they both rest upon a common basis in the ancient gloss: ‘Indicatorium, ?stel.’ I interpreted the indicatorium to be a light slab, much like a flat ruler, which was to be brought to bear across the page so as to guide the reader’s eye, and perhaps furnish a rest for his fingers. The Latin term would fit a pointer as well as a flat ruler, and perhaps better. It may therefore well be that in the endeavour to interpret the Jewel, Bp. Clifford has incidentally explained that problematical object which king Alfred sent as a fitting accompaniment42 with each of the presentation copies of his version of Gregory’s Pastoral Care. The remark that the pointer might be fitted to the volume by an arrangement like that now in common use for attaching a pencil to a notebook must, I think, be felt to add a certain persuasive concreteness to his suggestion. Only then, if the ‘?stel’ was a book-pointer with a costly handle, that handle was certainly not fashioned after the manner of the Alfred Jewel, or of its natural associate the minor jewel of Minster Lovel—it was not fashioned with obverse and reverse. A subsequent interpretation by Llewellynn Jewitt, F.S.A., appeared in the Reliquary for October, 1879, vol. xx, p. 66:—‘Many, and very curious as well as various, have been the conjectures as to the use or origin of this remarkable jewel, and of the figure intended to be represented upon it, but it is not worth while to here repeat them. The probability, to my mind, is that it simply formed the head of a sceptre, and that just possibly it might have been ultimately given by Alfred to the head of the monastery founded by himself, to be used43 as a pastoral staff or staff of office, as was the crosier in later days. The design and the workmanship are of exquisite beauty, and in all respects the jewel is unsurpassed by any other existing example of Anglo-Saxon art.’ Again, this interpretation, like that of Hearne and others, appears to be excluded by the formation of the Jewel with a front and a back. By the rejection of so many hypotheses the field of choice is narrowed, and our path should be so much the clearer to find the true design and use of the Alfred Jewel. [10] William Joseph Hugh Clifford, second son of the seventh Baron Clifford of Chudleigh, was the Roman Catholic bishop of Clifton from 1857 to 1888. He was a member of the Somerset Arch?ological and Natural History Society, and for many years a constant attendant at the yearly meetings. In 1877 he was President of the Society. His obituary, by Canon Holmes, is in vol. xxxix of the Society’s Proceedings. [11] This machinery for bringing the baculus cantoris to Athelney was first employed in the interest of the stylus theory. See S. Pegge in Arch?ologia ii, quoted above in chapter iii. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3097/85406.html","bookId":947,"book":{"id":947,"title":"The Alfred Jewel An Historical Essay","description":"简介： IT is full fifty years since I began to contemplate the Alfred Jewel with a wonder and curiosity which became a habit. At length, in the latter half of that period, the vague attitude of enquiry began to point in a definite direction, and to exhibit...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3097","creation":"Aug 1, 2019 12:23:58 AM","modification":"Aug 1, 2019 12:23:58 AM"}}
