{"id":11644,"no":8,"title":"Chapter VII. FROM ARTIST TO ARTISAN","content":"“There is nothing impossible to industry.”—Clio, one of the Seven Wise Men of Greece. Until now we have been dealing with revolutionary movements in the political sense, and, indirectly, their effects upon the glove trade. We presently have to consider the great revolution within the industry itself, which came with the introduction of machinery in the nineteenth century, whereby productive labor was completely transformed and glove-making permanently modernized. Early in the nineteenth century, the factory system was firmly established in England. The French, however, held out against the system, in great measure, as might be expected of a people who recently had fought so passionately for individual liberty. Child labor was an evil against which the French economists were vehement in their protestations. Apprenticing the young was an entirely different matter, without doubt, from enslaving children from dawn to dark in mills, where they were compelled to repeat unceasingly some mechanical detail of the process, with very little hope of enlightenment or advancement in their occupation. The French, progressive but not greedy, sought to maintain industry upon a humane basis. With the revival of glove-making at the time of the First Empire, the honored methods of craftsmanship still were in practice. Gloves were made entirely by hand, and the 68glove-maker—whether designer or workman—was, in the true sense, an artist. Patterns, cut from thin boards, were laid on the leather, and the shape traced with lead pencil. These designs were cut out with a pair of long scissors. The parts were then sewed together. In order to keep the stitches uniform, the pieces were placed between a pair of jaws, the holding edges of which were serrated with fine saw teeth; and the sewer by passing the needle forwards and backwards between each of these teeth secured neat, even-length stitches. The embroidery on the backs was done with very great care, and necessarily consumed much time. Although these gloves possessed the charm peculiar to most hand-made articles, the matter of fit was purely accidental, for it depended partly upon the elasticity of the leather and even more upon the skill of the maker. In point of skill no glove workers in the world at that time surpassed those of Grenoble. Relying wholly upon the art of her workmen and the dexterity of her sewing women, the ancient glove city still set the standard of excellence for the rest of Europe—even in the years when she was not in a position to turn out so many gloves, nor sell her product so cheaply, as Paris. Though forced for some time to take secondary place, quantitatively, Grenoble never yielded to her rivals in the matter of quality. If she could not produce the most gloves, she at least would furnish the market with the best gloves. The finest tawed skins to be had were prepared for the Grenoble glovers in the mills at Millau and Annonay. Their value excelled 69that of any skins tawed by foreigners. On this fact, however, the prestige of the Grenoble glove did not rest. These beautiful skins were sent abroad to manufacturers all over Europe, so, in themselves, they did not create a monopoly in favor of the city really responsible for their superiority. No, it was her method of making gloves, the cutting and the sewing of them, which actually distinguished Grenoble. Her workers enjoyed a privileged position in the industry; they were celebrated far and near. Other localities did their best to entice them away; especially did Germany, Piedmont and Switzerland offer inducements, and, whenever possible, strangers would enter the Grenoble shops to spy upon these artists and steal their secrets. But they were never able to carry this far enough to establish any great competition in the international markets. The Grenoble glove continued to be much sought and exceedingly envied. Not able to procure elsewhere gloves of equal beauty, shapeliness and finish, merchants far and wide were obliged to supply themselves from the city of inimitable artists in the Dauphiné; and thus, without the slightest compulsion from the Grenoble manufacturers, these traders stimulated their business and spread their fame. The sewing women, M. Roux tells us, constituted a peculiar source of wealth to the Grenoble industry. Their exquisite handwork defied all rivalry; there were no other such accomplished sewers in all France, nor in any other country. To-day they are still celebrated; but then they formed an exclusive 70factor of Grenoble’s prestige. Apprenticed while young girls, they looked upon glove-making as a career, an art in which they desired to perfect themselves. The traditions of glove-making forebears held them to the ancient metier of the place; and even more than the glovers and the male workers, they met the encroachments of self-seeking foreigners with an intuitive distrust and proud resistance. Under such conditions as these, the glove industry in Grenoble was able to support successfully the extreme vicissitudes of the post-Revolutionary era. Even while the wave of prosperity rolled, now high, now low, in face of other manufacturers it maintained an invincible superiority—none excelled the skill of its handwork. Others were unable to counterfeit this; it could not be imitated; never elsewhere was it equalled. But meanwhile, right at home, unsuspected forces were slowly working, which were destined to prove at the same time propitious and full of danger for the Grenoble glovers. The real revolution was approaching; the great, internal change which was to be the undoing of the old, the uprearing of a new industrial system upon the razed foundations of the old. The days of the craftsman and the artist were numbered. Every genius has his forerunner. About the year 1819, Vallet d’Artois, a French glove manufacturer, invented steel punches in three sizes, each of which would cut, or punch, out of leather two dozen gloves at once. This invention was the first step toward the introduction of modern machinery into 71the glove industry. It multiplied the efficiency of the glove cutter, so far as speed was concerned, twenty-four times. In the same year, the genius who was finally to revolutionize glove-making was barely entering young manhood. Xavier Jouvin has sometimes been called a Parisian. He was born, however, in Grenoble, on the eighth day of December, 1800, in the house in the rue St. Laurent, now bearing the number 57. Jouvin was in Paris as a student in 1817, and he lived there again in 1825. But he never felt at home in the least in the French capital. He was a provincial by tradition, birth and natural inclination; a student and a dreamer whose spirit was nourished by seclusion—by journeying inward and exploring its own solitudes rather than by contact with men and affairs. It seems significant that the first year of the new century should have ushered into the world one of the leading mechanical minds of that epoch. It is also strikingly appropriate that Jouvin should have been a native of Grenoble, since his name, above all others, is identified with the modern industry of glove-making. He was a visionary, whose single need was the necessity of inventing something all his days. He could not see any kind of work going on near him but he must think how he could make it easier by the creation of some mechanical instrument. Without ambition for fortune or for fame, he was only too contented to proscribe his life within apparently narrow limits. Returning from Paris in 1825, he was resolved to enjoy obscurity, the provincial and rural 72environment in which his talent throve; while occupying his mind almost exclusively with the study of mechanical processes necessary to assure exact regularity in cutting gloves. Already this young man had invented a mowing machine, and a planisphere, by means of which, automatically, one could determine the position of the stars for every night in the year. Now, in turning his attention to the problem of regularity of cut in gloves, he was really broaching the great factor which has given modern glove-making its ascendency over the old method—namely, the element of fit. At the outset he perceived the exact terms of the problem which he had set himself to solve. First, he must make a general classification of the different sizes and shapes of hands one meets; secondly, he must ascertain the precise extension of the skin required for the measurements of the hand he wished to fit. By minutely studying hands in the Hospital of Grenoble, Jouvin discovered and wrote out in a rectangle thirty-two different sizes of hands. He furthermore recognized five types—very broad, broad, medium, slender and very slender—each type being divided into two classes. As there were thirty-two sizes for each class, and five types altogether, this made three hundred and twenty different numbers of gloves, which proved more than requisite to the demands of the finest trade. The dies which Jouvin invented and perfected for cutting out these three hundred and twenty different gradations of gloves consisted of the calibre, or glove pattern, and 73the punch, or emporte-pièce, and were made of fine tempered steel blades fastened to a back of cast iron. In making the heavier grades of gloves, the die was struck with a ponderous mallet, cutting only one thickness at a time. By cutting only one piece in this way, the artisan avoided any holes in the skins which might have been made in killing the wild animal or in dressing the leather. The thumbs and gussets, or fourchettes—the strips inserted to form the sides of the fingers—were cut with separate dies from pieces not large enough for the body of the glove, thus utilizing nearly every scrap of the material. As the leather was first placed upon a block to receive the blows of the mallet, this grade of goods came to be called “block cut.” In “table cut” gloves, however, the leather was tranked out on a table and shaped for the size desired. Then, by means of a power press many pairs were cut at once. The nicest part of this process consists in getting the leather in proper shape. Different sizes may be cut with the same pattern by estimating accurately the elasticity of the leather. Jouvin’s calibre is the same by which—under many different systems, of course—all gloves are cut to-day. Jouvin also studied to determine what degrees of pressure the skin will withstand in different parts, in order that, in every case, just the right piece of material should be selected to produce the measurements desired. Expert knowledge of skins is equally important with proper use of utensils in producing an accurately fitting glove. 74In his work Jouvin sought the satisfaction of the scientist and the artist rather than any financial benefit which might have accrued to him from his remarkable system. When he had completed his invention, he hardly realized its pecuniary value; he took out a patent for France, but not for any foreign country. The immediate effect of his achievement was somewhat curious. During Jouvin’s own lifetime his invention not only failed to profit the glovers of his native city, but actually worked them harm. He himself groped his way for several years, in an attempt to find capital and workers which should prove the usefulness of his new method. But the manufacturers scoffed at him. They declared that Jouvin had “vulgarized” glove cutting. The glove cutter was dethroned; he was no longer an artist. A machine did his work, and it was evident that with this machine a good cutter could turn out good gloves from poor skins, while a poor cutter would turn out poor gloves from good skins. The calibre certainly was a mischievous device, and had turned the glove art topsy-turvy! Like any inventor, Jouvin himself was not greatly affected by all this talk, nor by the rebuffs he met whenever he tried to interest business men; for he was absorbed in the possibilities of further improvement upon his invention. He had discovered the calibre in 1834; in 1838—without having drawn a cent of profit thus far—he added the punch, or emporte-pièce, for automatically cutting gloves to measure. In the following year, however, his work suddenly received conspicuous 75public notice. It was rewarded a bronze medal at the Industrial Exposition in Paris. From that moment, Jouvin’s future as a glove manufacturer was assured, for men with money rallied to his support. The first thing the Grenoble glovers knew, Germany, Switzerland and Italy had all seized upon their fellow-citizen’s admirable invention and were turning it to tremendous commercial account. Their outputs were increasing by leaps and bounds. But, in France, one factory only—that of the inventor—worked, while his compatriots stood still for the benefit of foreign competitors to whom the Jouvin system was free, while debarred from French manufacturers under the terms of the patent. Of course, lawsuits against Jouvin arose, as other glovers endeavored to have the broad, general idea of stamping out gloves become domaine public, or public property. But the industry had so far diminished in Grenoble in 1840 that that city was not mentioned as one of the principle producers of gloves. Without doubt, the conservative manufacturers of that town learned their lesson. For, in 1849, the year in which the Jouvin patents expired, they hastened to shake off this decade of depression which had seen them bound hand and foot, while the glove-makers of other lands rapidly eclipsed them in importance; and immediately they installed in their shops the new system. With their unrivalled skill and natural precedence now reinforced by up-to-date mechanical methods, the glovers of Grenoble effected a lightning recovery. Moreover, their misfortunes had 76not been due to the lack of mechanical equipment alone. Financial panic in America had robbed them temporarily of one of their best clients; and the price of skins had risen to an exorbitant figure in France, even while foreigners knew how to get them, without paying a heavy duty, from Grenoble’s own mills at Annonay. These conditions, however, were soon to be righted. But another challenge to the old régime loomed a few years ahead. In 1867, at the Paris Exposition, some Grenoble glovers paused in front of a fragile, little machine, glanced at it with curiosity, and went home without any idea that that modest piece of mechanism was going to cap the work of the calibre; and that shortly the whole world would possess what, for two centuries, had been the fortune and renown of their native city—the ability to sew gloves perfectly. The era of labor-saving, quantity-multiply, and cost-reducing machinery had indeed arrived; and Grenoble, once she realized the full significance of “vulgarizing” her ancient trade, did not lag far behind. She faced and conquered great difficulties in the nineteenth century—notably, the large increase in the “centres” of glove-making, as the trade grew and improved abroad; and also she succeeded in finding a cheap, but good, kid to compete with the German and Italian lambskins which looked so well that they satisfied the taste of the general public. These things she accomplished with the help of modern machinery; for which, in a peculiarly thankless and round-about way, the city owed a 77great debt to one of her own sons. The European glove world paid its tribute to Jouvin in 1851, when the Universal Exposition held in Vienna voted him a Diploma of Honor. A later contribution to the technique of the glove was the modern style of fastener, introduced, about 1855, by M. Raymond of Grenoble. His factory was a valuable addition to the leading industry of that city. Roux gives credit to Raymond for all the various changes and improvements in glove fasteners which we have to-day. The old-fashioned lacing has been completely replaced by the clasp, the neatness and efficiency of which could hardly be bettered. Thus, in the last century, we see virtually every trace of the immemorial methods of glove-making vanish before the swift incursion of modern machinery. A few hand-sewn gloves alone remain to remind us of the days when the couturières, peasant women and girls gathered in groups in cottages on the outskirts of Grenoble, or in the ateliers of the town, to sing as they sewed gloves for the nobility and the gentry of a former time. But the art has gained by the inestimable assets of fit and individuality in gloves: by the great numbers, also, in which gloves to-day are supplied, that we all may delight in wearing them. In respect to Grenoble, moreover, it should be observed that, through all these changes and commercializing influences, she has sacrificed not a whit of her invincible good taste. Against foreign competition and the paralysis which she suffered under the Jouvin 78patent, she had only the superiority of her product to offer—the suppleness of her skins, the elegance of their cut, the beauty of the tints artificially applied, the finish and durability of her sewing. But these were enough to keep her art alive. They still prevail—and in even higher degree—in the gloves of Grenoble makers to-day. In the evolution from artist to artisan, there is little room for regret. Already the glove-workers of France have readjusted very largely to changed conditions within the industry; while the consumer and producer alike may rejoice in the widespread accessibility of the finest gloves in the world.","sourceLink":"http://novel.tingroom.com/duanpian/2791/77260.html","bookId":1292,"book":{"id":1292,"title":"Gloves Past and Present","description":"简介： Most men, apparently, take their gloves for granted. In these days the little refinements of civilization are accepted among us without a thought; but in so doing we lose a great deal of enjoyment which we never were intended to overlook. Least of al...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2791","creation":"Aug 1, 2019 12:24:48 AM","modification":"Aug 1, 2019 12:24:48 AM"}}
