{"id":13921,"no":14,"title":"CHAPTER XIII. CHURCH LIFE. MINOR PERSONALITIES.","content":"These were the days, also, \"before the war\", when expansion was the law of woman\u0027s apparel. The hoop skirt had reached its maximum of periphery. Many colors were mingled on the same dress. The ladies wore \"shoot-the-moon\" bonnets, with small sized flower gardens stuffed inside the brim, between face and frame, and the ribbons necessary for adornment and fastening ran into yard lengths. Besides ribbon on the top of the head gear, there must be great bows on either side of the chin. Many a time I remember seeing the choir singers untie their bonnet strings when they would praise God with the voice and understanding; or, to be more scientific, they unlatched the hook and eye, which really did the business of fastening, the bows being for ornament rather than utility, reminding one of Gothic architecture made of timber in lieu of stone. It was a grand thing, at least one boy thought, to go to a morning or noon wedding within a private house, where at 10 A.M. the windows were shut tight and the gas lighted. The girls were all in voluminous circles of flounced silks. Their bonnets spread out on the bed of the dressing room were veritable parterres, with ribbons half a foot wide and a yard long. \\n\\n \\n\\n Inside the house of God the fripperies of fashion were as rampant then as now. In one stylish family, albeit, according to common rumor of humble origin, whose pew was near ours, but further to the east, there was the father, who was a dandy in his dress. He always sat during the sermon and those parts of the service not calling for a bowed head or the grasping of a hymn book, holding his ridiculous little cane, which had for its handle a lady\u0027s foot carved in ivory. Her toes were always in his mouth, and the diligence with which[108] he sucked that cane impressed a certain boy, who passes over further description, of oiled and perfumed ringlets, amazing necktie or diamond-studded cravat and other vanities of life. I never frankly accepted the statement of Ecclesiastes, until I saw this gentleman\u0027s cane and neck gear. It must be confessed that the amount of time sometimes spent by young men on their neckties, then often three or four inches wide and made to stick out so that the ends were continuous with the shoulders, is a secret not to be told to the present generation lest we corrupt the youth. \\n\\n \\n\\n But the psychical moment to the small boy was when the very stylish daughter of the family aforesaid with her sublunar bonnet, her gorgeous mantilla, her mighty collar of lace and resplendent brooch sailed up the aisle, sending many a black silk hat spinning on its richochetting way before her. When about two fathom\u0027s distance from the pew door, which stood at right angles to the long aisle, she would seize a handful of the various concentric steel circles of her dress, and slightly tilting the metal bands would sail into her pew with as little collision against the wooden sides as possible. Within a busy period, of possibly less than five minutes, she was able to accommodate her crinoline to the dimensions allowed and get her spirit in tune with the sacredness of the hour and place. \\n\\n \\n\\n Nevertheless when in later days, sorrow came to that same daughter, now bereaved and fatherless, she rose by divine grace into a very transfiguration of character, through sisterly and filial devotion. \\n\\n \\n\\n Life is too short to tell of all the oddities and curious situations into which the hoop skirt led its wearer, and one must read Edward Everett Hale\u0027s amusing story of \"The Skeleton in the Closet\", to see what dire mischief these inventions of the evil one were capable of wreaking, even when discarded. They did indeed seem to be indestructible. \\n\\n \\n\\n [109] \\n\\n \\n\\n What glistening starry eyes, what dewy and rosy cheeks, what lovely faces dwelt inside of those bonnets! Even to-day in life\u0027s dusty pathway, sweet influences like the breath of a May morning come back with the happy memories of Sabbath days, that were as \"the bridal of the earth and sky\", with the trees in white blossoms standing as bridesmaids. In memory\u0027s glow the returning vision of youth make what the Deuteronomist calls \"the days of heaven upon earth\". It was in that wonderful training school on Broad street, that so many lovely maidens were taught how, by divine grace, to be noble wives and mothers, and useful women and workers for the coming of the kingdom of heaven, and from which so many alumni went forth, young men to preach the good news of God. On the missionary field, or at home, in bustling cities, or in quiet country charges, many there are who to-day amid monotony and toil, refresh their spirits at the fountains of memory, taking inspiration from the past and its great personality, thanking God and taking courage. \\n\\n \"The traveller owns the grateful sense \\n\\n Of sweetness near, he knows not whence, \\n\\n And pausing takes with forehead bare \\n\\n The benediction of the air.\" \\n\\n \\n\\n They were not all sunny days for \"the pastor\", but rather many a \"dark and cloudy day\", for not all of the seed of the sower fell into good and honest hearts. Too many trusted in themselves and falling, wallowed in the mire. One favorite text and a very sincere utterance of both the Christ\u0027s first John and one of his latest disciples so named, was this: \"I have no greater joy than to hear that my children walk in truth\". When, on the contrary, his quondam church members dishonored their Lord, then \"the pastor\u0027s\" heart was wrung—alas, too often—with anguish. \\n\\n \\n\\n Among memory\u0027s dissolving views is one of a young man[110] who had been brought into the church and for a time gave promise of manly piety and a fruitful Christian career, but, falling into habits of worldly pleasure he seemed to lose in girth of soul as he became larger in body. He once boasted to me of his finely developed muscle, ascribing his physical enlargement and, as he thought, improvement to \"good liquor and good women,\" saying it without a blush, and in such a statement horribly abusing the English language as I knew and felt it. When the war broke out he became captain in a regiment which was made up chiefly of Roman Catholic Irish soldiers from Philadelphia, men as devout in one way as they were reckless in another. In leading them to the charge in their first battle, he noticed not only how their faces turned pale as the spirit conquered the flesh, but also how each man crossed himself, and how, as he described it, the advance of his company into the thick of the fight could be traced by the packs of cards which they threw away. They did not wish to lose their lives, but they relished even less the idea of being found dead with these instruments of pleasure and of evil in their knapsacks. The handsome young captain, after going to moral wreck, was mortally wounded in battle. When his body was brought home and laid in Laurel Hill, I remember the impressive final words of his saddened and disappointed pastor as he committed \"to the care of the Resurrection and the Life\" the relics of a once noble form: \\n\\n \"Alas! there are wrecks on humanity\u0027s sea \\n\\n More awful than any on ocean can be\". \\n\\n \\n\\n Yet the preacher\u0027s burning denunciations of sin and his praise of holiness helped us all to keep step with the Infinite and hold to the right path. Whether in formal discourse or in the reading of a hymn he lost no opportunity to make sinners and false professors uncomfortable and to cheer well doers. \\n\\n \\n\\n [111] \\n\\n \\n\\n Rev. James Crowell, D.D., writes, in 1902: \\n\\n \\n\\n \"I remember going in to hear Rev. Dr. Chambers one Sabbath afternoon, and being much struck with a remark that he made while reading a hymn. It was characteristic of the plain, straightforward way in which he would sometimes rebuke what he thought was wrong among the people. He was reading the hymn \\n\\n \u0027My soul, be on thy guard \\n\\n Ten thousand foes arise,\u0027 \\n\\n \\n\\n and when he came to the last verse, beginning, \\n\\n \u0027Fight on, my soul, till death \\n\\n Shall bring thee to thy God,\u0027 \\n\\n \\n\\n he suddenly laid down the hymn-book and said, \u0027Bring whom? Bring that cruel rum-seller, who sells damnation to his fellow men for the sake of paltry gain? Bring that lazy lounging Christian who was at church this morning, but is now taking a nap in bed, at home, instead of being in the house of God? No!\u0027\" \\n\\n \\n\\n \"Dr. Chambers was very active and prominent in connection with the Noon-day prayer meeting in the old Sansom Street Baptist Church, at the corner of Ninth and Sansom. He attended that meeting with undeviating punctuality, always insisted upon the exercises beginning exactly upon the hour, and upon a strict adherence to the rule which required prayers and remarks to be limited to three minutes. He was an inspiration in that meeting, and by his spirit and his eloquent voice added much to its enthusiasm and success. \\n\\n \\n\\n \"I remember when I was a little boy attending school at the West Chester Academy, an announcement was made at one time that a great temperance meeting was to be held in Everhart\u0027s Grove, a little piece of woods about half a mile[112] from the end of the town. The meeting was held on Saturday afternoon, and going down, with a few of my schoolmates to attend the meeting, upon reaching the outskirts of the town, when yet more than a quarter of a mile distant from the place of meeting in the woods, I heard Dr. Chambers\u0027 clarion voice most distinctly, as he was engaged in speaking. \\n\\n \\n\\n \"He was for many years a leader in aggressive movements in the temperance cause, and by his faithfulness in denouncing those who were engaged in the traffic he did much to promote the interests of that great reform. He was also exceedingly faithful as a pastor in looking after the absentees from worship. It was said that he could always mark those who were absent from the House of God on the Sabbath, and that his rule was on Monday to look them up and ascertain the reason of their absence. He was an earnest and faithful and aggressive worker in the cause of his Master, and by his eloquence and fervor succeeded in retaining his hold upon the large congregation that worshipped in the old church at the corner of Broad and Sansom streets\". \\n\\n \\n\\n I can add to Dr. Crowell\u0027s testimony my own as to Mr. Chambers\u0027s inspiring presence at the union prayer meetings in the Sansom Street Baptist Church for I attended many of them. Once when the hymn \"Oh for a thousand tongues to sing\" had been finished he rose up and told us in a few burning words that we need not pray for \"a thousand tongues\", but that one tongue was enough, if each used his aright. His knowledge of the presence or absence of his parishioners was nearly infallible. Once when a very useful lady member had been absent during several weeks at \"revival\" meetings in another church, her pastor said to her of her absence: \"It was like pouring melted lead down my back\". Mr. Chambers did not believe in extra meetings, but in live ones all the time. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1874/54219.html","bookId":808,"book":{"id":808,"title":"John Chambers","description":"简介： John Chambers was one of the first among popular preachers of the nineteenth century in Philadelphia, and the pastor for fifty years of one congregation....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1874","creation":"Aug 1, 2019 12:19:35 AM","modification":"Aug 1, 2019 12:19:35 AM"}}
