{"id":44699,"no":33,"title":"5th March","content":"Dear Daddy-Long-Legs, \n \n There is a March wind blowing, and the sky is filled with heavy, \n black moving clouds. The crows in the pine trees are making such \n a clamour! It\u0027s an intoxicating, exhilarating, CALLING noise. \n You want to close your books and be off over the hills to race with \n the wind. \n \n We had a paper chase last Saturday over five miles of squashy \n \u0027cross country. The fox (composed of three girls and a bushel or so \n of confetti) started half an hour before the twenty-seven hunters. \n I was one of the twenty-seven; eight dropped by the wayside; \n we ended nineteen. The trail led over a hill, through a cornfield, \n and into a swamp where we had to leap lightly from hummock to hummock. \n of course half of us went in ankle deep. We kept losing the trail, \n and we wasted twenty-five minutes over that swamp. Then up a hill \n through some woods and in at a barn window! The barn doors were all \n locked and the window was up high and pretty small. I don\u0027t call \n that fair, do you? \n \n But we didn\u0027t go through; we circumnavigated the barn and picked up \n the trail where it issued by way of a low shed roof on to the top \n of a fence. The fox thought he had us there, but we fooled him. \n Then straight away over two miles of rolling meadow, and awfully \n hard to follow, for the confetti was getting sparse. The rule is \n that it must be at the most six feet apart, but they were the longest \n six feet I ever saw. Finally, after two hours of steady trotting, \n we tracked Monsieur Fox into the kitchen of Crystal Spring (that\u0027s \n a farm where the girls go in bob sleighs and hay wagons for chicken \n and waffle suppers) and we found the three foxes placidly eating milk \n and honey and biscuits. They hadn\u0027t thought we would get that far; \n they were expecting us to stick in the barn window. \n \n Both sides insist that they won. I think we did, don\u0027t you? \n Because we caught them before they got back to the campus. \n Anyway, all nineteen of us settled like locusts over the furniture \n and clamoured for honey. There wasn\u0027t enough to go round, but Mrs. \n Crystal Spring (that\u0027s our pet name for her; she\u0027s by rights a Johnson) \n brought up a jar of strawberry jam and a can of maple syrup-- \n just made last week--and three loaves of brown bread. \n \n We didn\u0027t get back to college till half-past six--half an hour late \n for dinner--and we went straight in without dressing, and with \n perfectly unimpaired appetites! Then we all cut evening chapel, \n the state of our boots being enough of an excuse. \n \n I never told you about examinations. I passed everything with the \n utmost ease--I know the secret now, and am never going to fail again. \n I shan\u0027t be able to graduate with honours though, because of that \n beastly Latin prose and geometry Freshman year. But I don\u0027t care. \n Wot\u0027s the hodds so long as you\u0027re \u0027appy? (That\u0027s a quotation. \n I\u0027ve been reading the English classics.) \n \n Speaking of classics, have you ever read Hamlet? If you haven\u0027t, \n do it right off. It\u0027s PERFECTLY CORKING. I\u0027ve been hearing about \n Shakespeare all my life, but I had no idea he really wrote so well; \n I always suspected him of going largely on his reputation. \n \n I have a beautiful play that I invented a long time ago when I first \n learned to read. I put myself to sleep every night by pretending \n I\u0027m the person (the most important person) in the book I\u0027m reading \n at the moment. \n \n At present I\u0027m Ophelia--and such a sensible Ophelia! I keep \n Hamlet amused all the time, and pet him and scold him and make him \n wrap up his throat when he has a cold. I\u0027ve entirely cured him \n of being melancholy. The King and Queen are both dead--an accident \n at sea; no funeral necessary--so Hamlet and I are ruling in Denmark \n without any bother. We have the kingdom working beautifully. \n He takes care of the governing, and I look after the charities. \n I have just founded some first-class orphan asylums. If you \n or any of the other Trustees would like to visit them, I shall be \n pleased to show you through. I think you might find a great many \n helpful suggestions. \n I remain, sir, \n Yours most graciously, \n OPHELIA, \n Queen of Denmark. \n \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2106/59755.html","bookId":520,"book":{"id":520,"title":"DADDY-LONG-LEGS 长腿叔叔","description":"简介： 主要讲述了 茱迪从小在孤儿院里长大，年轻的她不得不负担起众多沉重的工作，而不能享受普通女孩子拥有的家庭乐趣。有一天，她的命运被传奇般地改变了，一位自称约翰-史密斯的理事因为她出色的作文而将她送进了大学，她开始了完全不同的生活，她亲昵地叫这位理事长腿叔叔...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2106","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
