{"id":44734,"no":68,"title":"27th August","content":"Dear Daddy-Long-Legs, Where are you, I wonder? I never know what part of the world you are in, but I hope you\u0027re not in New York during this awful weather. I hope you\u0027re on a mountain peak (but not in Switzerland; somewhere nearer) looking at the snow and thinking about me. Please be thinking about me. I\u0027m quite lonely and I want to be thought about. Oh, Daddy, I wish I knew you! Then when we were unhappy we could cheer each other up. I don\u0027t think I can stand much more of Lock Willow. I\u0027m thinking of moving. Sallie is going to do settlement work in Boston next winter. Don\u0027t you think it would be nice for me to go with her, then we could have a studio together? I would write while she SETTLED and we could be together in the evenings. Evenings are very long when there\u0027s no one but the Semples and Carrie and Amasai to talk to. I know in advance that you won\u0027t like my studio idea. I can read your secretary\u0027s letter now: `Miss Jerusha Abbott. `DEAR MADAM, `Mr. Smith prefers that you remain at Lock Willow. `Yours truly, `ELMER H. GRIGGS.\u0027 I hate your secretary. I am certain that a man named Elmer H. Griggs must be horrid. But truly, Daddy, I think I shall have to go to Boston. I can\u0027t stay here. If something doesn\u0027t happen soon, I shall throw myself into the silo pit out of sheer desperation. Mercy! but it\u0027s hot. All the grass is burnt up and the brooks are dry and the roads are dusty. It hasn\u0027t rained for weeks and weeks. This letter sounds as though I had hydrophobia, but I haven\u0027t. I just want some family. Goodbye, my dearest Daddy. I wish I knew you. Judy","sourceLink":"http://novel.tingroom.com/jingdian/2106/59790.html","bookId":520,"book":{"id":520,"title":"DADDY-LONG-LEGS 长腿叔叔","description":"简介： 主要讲述了 茱迪从小在孤儿院里长大，年轻的她不得不负担起众多沉重的工作，而不能享受普通女孩子拥有的家庭乐趣。有一天，她的命运被传奇般地改变了，一位自称约翰-史密斯的理事因为她出色的作文而将她送进了大学，她开始了完全不同的生活，她亲昵地叫这位理事长腿叔叔...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2106","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
