{"id":108783,"no":15,"title":"Page 15","content":"Klaus screamed, a scream that reminded Bonnie of ancient predators, of the sabertooth cat and the bull mammoth. Blood frothed out of his mouth along with the scream, turning that handsome face into a twisted mask of fury.\\n\\n His hands scrabbled at his back, trying to get a grip on the white ash stake and pull it out. But it was buried too deep. The throw had been a good one.\\n\\n \"Damon,\" Bonnie whispered.\\n\\n He was standing at the edge of the clearing, framed by oak trees. As she watched, he took a step toward Klaus, and then another; lithe stalking steps filled with deadly purpose.\\n\\n And he was angry. Bonnie would have run from the look on his face if her muscles hadn\u0027t been frozen. She had never seen such menace so barely held in check.\\n\\n \"Get... away... from my brother,\" he said, almost breathing it, with his eyes never leaving Klaus\u0027s as he took another step.\\n\\n Klaus screamed again, but his hands stopped their frantic scrabbling. \"You idiot! We don\u0027t have to fight! I told you that at the house! We can ignore each other!\"\\n\\n Damon\u0027s voice was no louder than before. \"Get away from my brother.\" Bonnie could feel it inside him, a swell of Power like a tsunami. He continued, so softly that Bonnie had to strain to hear him, \"Before I tear your heart out.\"\\n\\n Bonnie could move after all. She stepped backward.\\n\\n \"I told you!\" screamed Klaus, frothing. Damon didn\u0027t acknowledge the words in any way. His whole being seemed focused on Klaus\u0027s throat, on his chest, on the beating heart inside that he was going to tear out.\\n\\n Klaus picked up the unbroken lance and rushed him.\\n\\n In spite of all the blood, the blond man seemed to have plenty of strength left. The rush was sudden, violent, and almost inescapable. Bonnie saw him thrust the lance at Damon and shut her eyes involuntarily, and then opened them an instant later as she heard the flurry of wings.\\n\\n Klaus had plunged right through the spot where Damon had been, and a black crow was soaring upward while a single feather floated down. As Bonnie stared, Klaus\u0027s rush took him into the darkness beyond the clearing and he disappeared.\\n\\n Dead silence fell in the wood.\\n\\n Bonnie\u0027s paralysis broke slowly, and she first stepped, and then ran to where Stefan lay. He didn\u0027t open his eyes at her approach; he seemed unconscious. She knelt beside him. And then she felt a sort of horrible calm creep over her, like someone who has been swimming in ice water and at last feels the first undeniable signs of hypothermia. If she hadn\u0027t had so many successive shocks already, she might have fled screaming or dissolved into hysterics. But as it was, this was simply the last step, the last little slide into unreality. Into a world that couldn\u0027t be, but was.\\n\\n She\u0027d never seen anybody hurt like this. Not even Mr. Tanner, and he had died of his wounds. Nothing Mary had ever said could help fix this. Even if they\u0027d had Stefan on a stretcher outside an operating room, it wouldn\u0027t have been enough.\\n\\n In that state of dreadful calm she looked up to see a flutter of wings blur and shimmer in the moonlight. Damon stood beside her, and she spoke quite collectedly and rationally.\\n\\n \"Will giving him blood help?\"\\n\\n He didn\u0027t seem to hear her. His eyes were all black, all pupil. That barely leashed violence, that sense of ferocious energy held back, was gone. He knelt and touched the dark head on the ground.\\n\\n \"Stefan?\"\\n\\n Bonnie shut her eyes.\\n\\n Damon\u0027s scared, she thought. Damon\u0027s scared-Damon!-and oh, God, I don\u0027t know what to do. There\u0027s nothing to do-and it\u0027s all over and we\u0027re all lost and Damon is scared for Stefan. He isn\u0027t going to take care of things and he hasn\u0027t got a solution and somebody\u0027s got to fix this. And oh, God, please help me because I\u0027m so frightened and Stefan\u0027s dying and Meredith and Matt are hurt and Klaus is going to come back.\\n\\n She opened her eyes to look at Damon. He was white, his face looking terrifyingly young at that moment, with those dilated black eyes.\\n\\n \"Klaus is coming back,\" Bonnie said quietly. She wasn\u0027t afraid of him anymore. They weren\u0027t a centuries-old hunter and a seventeen-year-old human girl, sitting here at the edge of the world.\\n\\n They were just two people, Damon and Bonnie, who had to do the best they could.\\n\\n \"I know,\" Damon said. He was holding Stefan\u0027s hand, looking completely unembarrassed about it, and it seemed quite logical and sensible. Bonnie could feel him sending Power into Stefan, could also feel that it wasn\u0027t enough.\\n\\n \"Would blood help him?\"\\n\\n \"Not much. A little, maybe.\"\\n\\n \"Anything that helps at all we\u0027ve got to try.\"\\n\\n Stefan whispered, \"No.\"\\n\\n Bonnie was surprised. She\u0027d thought he was unconscious. But his eyes were open now, open and alert and smoldering green. They were the only alive thing about him.\\n\\n \"Don\u0027t be stupid,\" Damon said, his voice hardening. He was gripping Stefan\u0027s hand until his knuckles whitened. \"You\u0027re badly hurt.\"\\n\\n \"I won\u0027t break my promise.\" That immovable stubbornness was in Stefan\u0027s voice, in his pale face. And when Damon opened his mouth again, undoubtedly to say that Stefan would break it and like it or Damon would break his neck, Stefan added, \"Especially when it won\u0027t do any good.\"\\n\\n Only the truth would do. And Stefan was telling the truth.\\n\\n He was still looking at his brother, who was looking back, all that fierce, furious attention focused on Stefan as it had been focused on Klaus earlier. As if somehow that would help.\\n\\n \"I\u0027m not badly hurt, I\u0027m dead,\" Stefan said brutally, his eyes locked on Damon\u0027s. Their last and greatest struggle of wills, Bonnie thought. \"And you need to get Bonnie and the others out of here.\"\\n\\n \"We won\u0027t leave you,\" Bonnie intervened. That was the truth; she could say that.\\n\\n \"You have to!\" Stefan didn\u0027t glance aside, didn\u0027t look away from his brother. \"Damon, you know I\u0027m right. Klaus will be here any minute. Don\u0027t throw your life away. Don\u0027t throw their lives away.\"\\n\\n \"I don\u0027t give a damn about their lives,\" Damon hissed. The truth also, Bonnie thought, curiously unoffended. There was only one life Damon cared about here, and it wasn\u0027t his own.\\n\\n \"Yes, you do!\" Stefan flared back. He was hanging on to Damon\u0027s hand with just as fierce a grip, as if this was a contest and he could force Damon to concede that way. \"Elena had a last request; well, this is mine. You have Power, Damon. I want you to use it to help them.\"\\n\\n \"Stefan...\" Bonnie whispered helplessly.\\n\\n \"Promise me,\" Stefan said to Damon, and then a spasm of pain twisted his face.\\n\\n For uncountable seconds Damon simply looked down at him. Then he said, \"I promise,\" quick and sharp as the stroke of a dagger. He let go of Stefan\u0027s hand and stood, turning to Bonnie. \"Come on.\"\\n\\n \"We can\u0027t leave him...\"\\n\\n \"Yes, we can.\" There was nothing young about Damon\u0027s face now. Nothing vulnerable. \"You and your human friends are leaving here, permanently. I am coming back.\"\\n\\n Bonnie shook her head. She knew, dimly, that Damon wasn\u0027t betraying Stefan, that it was some case of Damon putting Stefan\u0027s ideals above Stefan\u0027s life, but it was all too abstruse and incomprehensible to her. She didn\u0027t understand it and she didn\u0027t want to. All she knew was that Stefan couldn\u0027t be left lying there.\\n\\n \"You\u0027re coming now,\" Damon said, reaching for her, the steely ring back in his voice. Bonnie prepared herself for a fight, and then something happened that made all their debating meaningless. There was a crack like a giant whip and a flash like daylight, and Bonnie was blinded. When she could see through the afterimage, her eyes flew to the flames that were licking up from a newly blackened hole at the base of a tree.\\n\\n Bonnie\u0027s eye darted to him next, as the only other thing moving in the clearing. He was waving the bloody white ash stake he\u0027d pulled out of his own back like a gory trophy.\\n\\n Lightning rod, thought Bonnie illogically, and then there was another crash.\\n\\n It stabbed down from an empty sky, in huge blue-white forks that lit everything like the sun at noon. Bonnie watched as one tree and then another was hit, each one closer than the last. Flames licked up like hungry red goblins among the leaves.\\n\\n Two trees on either side of Bonnie exploded, with cracks so loud that she felt rather than heard it, a piercing pain in her eardrums. Damon, whose eyes were more sensitive, threw up a hand to protect them.\\n\\n Then he shouted \"Klaus!\" and sprang toward the blond man. He wasn\u0027t stalking now; this was the deadly race of attack. The burst of killing speed of the hunting cat or the wolf.\\n\\n Lightning caught him in midspring.\\n\\n Bonnie screamed as she saw it, jumping to her feet. There was a blue flash of superheated gases and a smell of burning, and then Damon was down, lying motionless on his face. Bonnie could see tiny wisps of smoke rise from him, just as they did from the trees.\\n\\n Speechless with horror, she looked at Klaus.\\n\\n He was swaggering through the clearing, holding his bloody stick like a golf club. He bent down over Damon as he passed, and smiled. Bonnie wanted to scream again, but she didn\u0027t have the breath. There didn\u0027t seem to be any air left to breathe.\\n\\n \"I\u0027ll deal with you later,\" Klaus told the unconscious Damon. Then his face tipped up toward Bonnie.\\n\\n \"You,\" he said, \"I\u0027m going to deal with right now.\"\\n\\n It was an instant before she realized he was looking at Stefan, and not her. Those electric blue eyes were fixed on Stefan\u0027s face. They moved to Stefan\u0027s bloody middle.\\n\\n \"I\u0027m going to eat you now, Salvatore.\"\\n\\n Bonnie was all alone. The only one left standing. And she was afraid. But she knew what she had to do.\\n\\n She let her knees collapse again, dropping to the ground beside Stefan. And this is how it ends, she thought. You kneel beside your knight and then you face the enemy.\\n\\n She looked at Klaus and moved so that she was shielding Stefan. He seemed to notice her for the first time, and frowned as if he\u0027d found a spider in his salad. Firelight flickered orange-red on his face.\\n\\n \"No.\"\\n\\n And this is how the ending starts. Like this, so simply, with one word, and you\u0027re going to die on a summer night. A summer night when the moon and stars are shining and bonfires burn like the flames the Druids used to summon the dead.\\n\\n \"Bonnie, go,\" Stefan said painfully. \"Get out while you can.\"\\n\\n \"No,\" Bonnie said. I\u0027m sorry, Elena, she thought. I can\u0027t save him. This is all I can do.\\n\\n \"Get out of the way,\" Klaus said through his teeth.\\n\\n \"No.\" She could wait and let Stefan die this way, instead of with Klaus\u0027s teeth in his throat. It might not seem like much of a difference, but it was the most she could offer.\\n\\n \"Bonnie...\" Stefan whispered.\\n\\n \"Don\u0027t you know who I am, girl? I\u0027ve walked with the devil. If you move, I\u0027ll let you die quickly.\"\\n\\n Bonnie\u0027s voice had given out. She shook her head.\\n\\n Klaus threw back his own head and laughed. A little more blood trickled out, too. \"All right,\" he said. \"Have it your own way. Both of you go together.\"\\n\\n Summer night, Bonnie thought. The solstice eve. When the line between worlds is so thin.\\n\\n \"Say good night, sweetheart.\"\\n\\n No time to trance, no time for anything. Nothing except one desperate appeal. \"Elena!\" Bonnie screamed. \"Elena! Elena!\"\\n\\n Klaus recoiled.\\n\\n For an instant, it seemed as if the name alone had the power to alarm him. Or as if he expected something to respond to Bonnie\u0027s cry. He stood, listening.\\n\\n Bonnie drew on her powers, putting everything she had into it, throwing her need and her call out into the void.\\n\\n And felt... nothing.\\n\\n Nothing disturbed the summer night except the crackling sound of flames. Klaus turned back to Bonnie and Stefan, and grinned.\\n\\n Then Bonnie saw the mist creeping along the ground.\\n\\n No-it couldn\u0027t be mist. It must be smoke from the fire. But it didn\u0027t behave like either. It was swirling, rising in the air like a tiny whirlwind or dust devil. It was gathering into a shape roughly the size of a man.\\n\\n Mist was flowing out of the ground, between the trees. Pools of it, each separate and distinct. Bonnie, staring mutely, could see through each patch, could see the flames, the oak trees, the bricks of the chimney. Klaus had stopped smiling, stopped moving, and was watching too.\\n\\n Bonnie turned to Stefan, unable to even frame the question.\\n\\n \"Unquiet spirits,\" he whispered huskily, his green eyes intent. \"The solstice.\" And then Bonnie understood.\\n\\n They were coming. From across the river, where the old cemetery lay. From the woods, where countless makeshift graves had been dug to dump bodies in before they rotted. The unquiet spirits, the soldiers who had fought here and died during the Civil War. A supernatural host answering the call for help.\\n\\n They were forming all around. There were hundreds of them.\\n\\n Bonnie could actually see faces now. The misty outlines were filling in with pale hues like so many runny watercolors. She saw a flash of blue, a glimmer of gray. Both Union and Confederate troops. Bonnie glimpsed a pistol thrust into a belt, the glint of an ornamented sword. Chevrons on a sleeve. A bushy dark beard; a long, well-tended white one. A small figure, child size, with dark holes for eyes and a drum hanging at thigh level.\\n\\n \"Oh, my God,\" she whispered. \"Oh, God.\" It wasn\u0027t swearing. It was something like a prayer.\\n\\n Not that she wasn\u0027t frightened of them, because she was. It was every nightmare she\u0027d ever had about the cemetery come true. Like her first dream about Elena, when things came crawling out of the black pits in the earth; only these things weren\u0027t crawling, they were flying, skimming and floating until they swirled into human form. Everything that Bonnie had ever felt about the old graveyard-that it was alive and full of watching eyes, that there was some Power lurking behind its waiting stillness -was proving true. The earth of Fell\u0027s Church was giving up its bloody memories. The spirits of those who\u0027d died here were walking again.\\n\\n And Bonnie could feel their anger. It frightened her, but another emotion was waking up inside her, making her catch her breath and clench tighter on Stefan\u0027s hand. Because the misty army had a leader.\\n\\n One figure was floating in front of the others, closest to the place where Klaus stood. It had no shape or definition as yet, but it glowed and scintillated with the pale golden light of a candle flame. Then, before Bonnie\u0027s eyes, it seemed to take on substance from the air, shining brighter and brighter every minute with an unearthly light. It was brighter than the circle of fire. It was so bright that Klaus leaned back from it and Bonnie blinked, but when she turned at a low sound, she saw Stefan staring straight into it, fearlessly, with wide-open eyes. And smiling, so faintly, as if glad to have this be the last thing he saw.\\n\\n Klaus dropped the stake. He had turned away from Bonnie and Stefan to face the being of light that hung in the clearing like an avenging angel. Golden hair streaming back in an invisible wind, Elena looked down on him.\\n\\n \"She came,\" Bonnie whispered.\\n\\n \"You asked her to,\" Stefan murmured. His voice trailed off into a labored breath, but he was still smiling. His eyes were serene.\\n\\n \"Stand away from them,\" Elena said, her voice coming simultaneously to Bonnie\u0027s ears and her mind. It was like the chiming of dozens of bells, distant and close up at once. \"It\u0027s over now, Klaus.\"\\n\\n But Klaus rallied quickly. Bonnie saw his shoulders swell with a breath, noticed for the first time the hole in the back of the tan raincoat where the white ash stake had pierced him. It was stained dull red, and new blood was flowing now as Klaus flung out his arms.\\n\\n \"You think I\u0027m afraid of you?\" he shouted. He spun around, laughing at all the pallid forms. \"You think I\u0027m afraid of any of you? You\u0027re dead! Dust on the wind! You can\u0027t touch me!\"\\n\\n \"You\u0027re wrong,\" Elena said in her wind-chime voice.\\n\\n \"I\u0027m one of the Old Ones! An Original! Do you know what that means?\" Klaus turned again, addressing all of them, his unnaturally blue eyes seeming to catch some of the red glow of the fire. \"I\u0027ve never died. Every one of you has died, you gallery of spooks! But not me. Death can\u0027t touch me. I am invincible!\"\\n\\n The last word came in a shout so loud it echoed among the trees. Invincible... invincible... invincible. Bonnie heard it fading into the hungry sound of the fire.\\n\\n Elena waited until the last echo had died. Then she said, very simply, \"Not quite.\" She turned to look at the misty shapes around her. \"He wants to spill more blood here.\"\\n\\n A new voice spoke up, a hollow voice that ran like a trickle of cold water down Bonnie\u0027s spine. \"There\u0027s been enough killing, I say.\" It was a Union soldier with a double row of buttons on his jacket.\\n\\n \"More than enough,\" said another voice, like the boom of a faraway drum. A Confederate holding a bayonet.\\n\\n \"It\u0027s time somebody stopped it\"-an old man in home-dyed butternut cloth.\\n\\n \"We can\u0027t let it go on\"-the drummer boy with the black holes for eyes.\\n\\n \"No more blood spilled!\" Several voices took it up at once. \"No more killing!\" The cry passed from one to another, until the swell of sound was louder than the roar of the fire. \"No more blood!\"\\n\\n \"You can\u0027t touch me! You can\u0027t kill me!\"\\n\\n \"Let\u0027s take \u0027im, boys!\"\\n\\n \"You can\u0027t kill me! I\u0027m immortal!\"\\n\\n The tornado swept away into the darkness beyond Bonnie\u0027s sight. Following it was a trail of ghosts like a comet\u0027s tail, shooting off into the night sky.\\n\\n \"Where are they taking him?\" Bonnie didn\u0027t mean to say it aloud; she just blurted it out before she thought. But Elena heard.\\n\\n \"Where he won\u0027t do any harm,\" she said, and the look on her face stopped Bonnie from asking any other questions.\\n\\n There was a squealing, bleating sound from the other side of the clearing. Bonnie turned and saw Tyler, in his terrible part-human, part-animal shape, on his feet. There was no need for Caroline\u0027s club. He was staring at Elena and the few remaining ghostly figures and gibbering.\\n\\n \"Don\u0027t let them take me! Don\u0027t let them take me too!\"\\n\\n Before Elena could speak, he had spun around. He regarded the fire, which was higher than his own head, for an instant, then plunged right through it, crashing into the forest beyond. Through a parting of the flames, Bonnie saw him drop to the ground, beating out flames on himself, then rise and run again. Then the fire flared up and she couldn\u0027t see anything more.\\n\\n But she\u0027d remembered something: Meredith-and Matt. Meredith was lying propped up, her head in Caroline\u0027s lap, watching. Matt was still on his back. Hurt, but not so badly hurt as Stefan.\\n\\n \"Elena,\" Bonnie said, catching the bright figure\u0027s attention, and then she simply looked at him.\\n\\n The brightness came closer. Stefan didn\u0027t blink. He looked into the heart of the light and smiled. \"He\u0027s been stopped now. Thanks to you.\"\\n\\n \"It was Bonnie who called us. And she couldn\u0027t have done it at the right place and the right time without you and the others.\"\\n\\n \"I tried to keep my promise.\"\\n\\n \"I know, Stefan.\"\\n\\n Bonnie didn\u0027t like the sound of this at all. It sounded too much like a farewell-a permanent one. Her own words floated back to her: He might go to another place or-or just go out. And she didn\u0027t want Stefan to go anywhere. Surely anyone who looked that much like an angel...\\n\\n \"Elena,\" she said, \"can\u0027t you-do something? Can\u0027t you help him?\" Her voice was shaking.\\n\\n \"I can do something,\" she said. \"But I don\u0027t know if it\u0027s the kind of help he wants.\" She turned back to Stefan. \"Stefan, I can cure what Klaus did. Tonight I have that much Power. But I can\u0027t cure what Katherine did.\"\\n\\n Bonnie\u0027s numbed brain struggled with this for a while. What Katherine did-but Stefan had recovered months ago from Katherine\u0027s torture in the crypt. Then she understood. What Katherine had done was make Stefan a vampire.\\n\\n \"It\u0027s been too long,\" Stefan was saying to Elena. \"If you did cure it, I\u0027d be a pile of dust.\"\\n\\n \"Yes.\" Elena didn\u0027t smile, just went on looking at him steadily. \"Do you want my help, Stefan?\"\\n\\n \"To go on living in this world in the shadows...\" Stefan\u0027s voice was a whisper now, his green eyes distant. Bonnie wanted to shake him. Live, she thought to him, but she didn\u0027t dare say it for fear she\u0027d make him decide just the opposite. Then she thought of something else.\\n\\n \"To go on trying,\" she said, and both of them looked at her. She looked back, chin thrust out, and saw the beginning of a smile on Elena\u0027s bright lips. Elena turned to Stefan, and that tiny hint of a smile passed to him.\\n\\n \"Yes,\" he said quietly, and then, to Elena, \"I want your help.\"\\n\\n She bent and kissed him.\\n\\n Bonnie saw the brightness flow from her to Stefan, like a river of sparkling light engulfing him. It flooded over him the way the dark mist had surrounded Klaus, like a cascade of diamonds, until his entire body glowed like Elena\u0027s.\\n\\n For an instant Bonnie imagined she could see the blood inside him turned molten, flowing out to each vein, each capillary, healing everything it touched. Then the glow faded to a golden aura, soaking back into Stefan\u0027s skin. His shirt was still demolished, but underneath the flesh was smooth and firm. Bonnie, feeling her own eyes wide with wonder, couldn\u0027t help reaching out to touch.\\n\\n It felt just like any skin. The horrible wounds were gone.\\n\\n She laughed aloud with sheer excitement, and then looked up, sobering. \"Elena- there\u0027s Meredith, too-\"\\n\\n The bright being that was Elena was already moving across the clearing. Meredith looked up at her from Caroline\u0027s lap.\\n\\n \"Hello, Elena,\" she said, almost normally, except that her voice was so weak.\\n\\n Elena bent and kissed her. The brightness flowed again, encompassing Meredith. And when it faded, Meredith stood up on her own two feet.\\n\\n Then she went to Damon.\\n\\n He was still lying where he had fallen. The ghosts had passed over him, taking no notice of him. Elena\u0027s brightness hovered over him, one shining hand reaching to touch his hair. Then she bent and kissed the dark head on the ground.\\n\\n As the sparkling light faded, Damon sat up and shook his head. He saw Elena and went still, then, every movement careful and self-contained, stood up. He didn\u0027t say anything, only looked as Elena turned back to Stefan.\\n\\n He was silhouetted against the fire. Bonnie had scarcely noticed how the red glow had grown so that it almost eclipsed Elena\u0027s gold. But now she saw it and felt a thrill of alarm.\\n\\n \"My last gift to you,\" Elena said, and it began to rain.\\n\\n Not a thunder-and-lightning storm, but a thorough pattering rain that soaked everything-Bonnie included-and doused the fire. It was fresh and cool, and it seemed to wash all the horror of the last hours away, cleansing the glade of everything that had happened there. Bonnie tilted her face up to it, shutting her eyes, wanting to stretch out her arms and embrace it. At last it slackened and she looked again at Elena.\\n\\n Elena was looking at Stefan, and there was no smile on her lips now. The wordless sorrow was back in her face.\\n\\n \"It\u0027s midnight,\" she said. \"And I have to go.\"\\n\\n Bonnie knew instantly, at the sound of it, that \"go\" didn\u0027t just mean for the moment. \"Go\" meant forever. Elena was going somewhere that no trance or dream could reach.\\n\\n And Stefan knew it too.\\n\\n \"Just a few more minutes,\" he said, reaching for her.\\n\\n \"I\u0027m sorry-\"\\n\\n \"Elena, wait-I need to tell you-\"\\n\\n \"I can\u0027t!\" For the first time the serenity of that bright face was destroyed, showing not only gentle sadness but tearing grief. \"Stefan, I can\u0027t wait. I\u0027m so sorry.\" It was as if she were being pulled backward, retreating from them into some dimension that Bonnie could not see. Maybe the same place Honoria went when her task was finished, Bonnie thought. To be at peace.\\n\\n But Elena\u0027s eyes didn\u0027t look as if she were at peace. They clung to Stefan, and she reached out her hand toward his, hopelessly. They didn\u0027t touch. Wherever Elena was being pulled was too far away.\\n\\n \"Elena-please!\" It was the voice Stefan had called her with in his room. As if his heart was breaking.\\n\\n \"Stefan,\" Elena called again, but her voice came as if from a long distance. The brightness was almost gone. Then, as Bonnie stared through helpless tears, it winked out.\\n\\n Leaving the clearing silent once again. They were all gone, the ghosts of Fell\u0027s Church who had walked for one night to keep more blood from being spilled. The bright spirit that had led them had vanished without a trace, and even the moon and stars were covered by clouds.\\n\\n Bonnie knew that the wetness on Stefan\u0027s face wasn\u0027t due to the rain that was still splashing down.\\n\\n He was standing, chest heaving, looking at the last place where Elena\u0027s brightness had been seen. And all the longing and the pain Bonnie had glimpsed on his face at times before was nothing to what she saw now.\\n\\n \"It isn\u0027t fair,\" she whispered. Then she shouted it to the sky, not caring who she was addressing. \"It isn\u0027t fair!\"\\n\\n Stefan had been breathing more and more quickly. Now he lifted his face too, not in anger but in unbearable pain. His eyes were searching the clouds as if he might find some last trace of golden light, some flicker of brightness there. He couldn\u0027t. Bonnie saw the spasm go through him, like the agony of Klaus\u0027s stake. And the cry that burst out of him was the most terrible thing she\u0027d ever heard. \"Elena!\" \\n\\n","sourceLink":"https://allnovel.net/the-vampire-diaries-dark-reunion-the-vampire-diaries-4/page-15.html","bookId":2034,"book":{"id":2034,"title":"The Vampire Diaries: Dark Reunion (The Vampire Diaries #4)","description":"Storyline: As a psychic, Bonnie has dreams of Elena in the Other World. But the dreams quickly turn frightening, which then causes the death of one of their friends. A source of power has infiltrated Fells Church, putting its inhabitants in danger. Not knowing what to do, Meredith, Matt, and Bonnie use a summoning spell to call for Stefan and Damon — but whose side is Damon on? This novel greatly expands Bonnie and Meredith as characters. Bonnie takes the leading role as she writes in the diary. She also finds a possible romance with Matt Honeycutt. After some research in the library Stefan realizes Tyler Smallwood is a werewolf. They concoct a plan and lure Tyler into the graveyard. After threatening him, Tyler reveals startling information about the killer.......\\n","cover":"https://allnovel.net/images/the-vampire-diaries-dark-reunion-the-vampire-diaries-4.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-vampire-diaries-dark-reunion-the-vampire-diaries-4.html","creation":"Oct 5, 2019 8:58:16 AM","modification":"Oct 5, 2019 11:25:42 PM"}}
