{"id":27795,"no":8,"title":"CHAPTER VIII. STARTING FOR THE WEST.","content":"T HE next morning they found, to their satisfaction, that the river had sunk nearly a foot. The boat had risen considerably when the cargo had been removed the evening before, and the ropes overhead had been proportionately tightened, so that she now hung so high that the rents were well out of water, and they were able at once to set about the work of repair. There were tools on board, for during their prolonged trips it was often necessary to execute repairs of one kind or other. The flooring-boards were utilised for the repairs, and by evening the holes were closed effectually. The next day the work was strengthened by additional ribs and stringers, a coat of pitch was put on outside and in, and Hiram pronounced the work complete. From time to time the ropes had been loosened as the river continued to fall, although less rapidly, and it was thought well not to put too great a strain upon them. The next morning the plug was again driven into the bottom of the boat, and they set to work to pump and bale her out, and then shifted the cargo back again from the raft. This was not a long job, and at night, after[128] a great washing-up of the cabins, to get rid of the mud that had been left there, they had the satisfaction of taking possession of their old quarters. \"Well, lad,\" Hiram said, when they lighted their pipes after supper, \"I never thought we were coming so well out of that job. With plenty of rice and sugar, not to speak of rum, on board, I didn\u0027t expect we war going to starve, but I thought we might have been weeks and weeks—ay, months, may be—before any one came along, and the thought as came into my mind was as we should have to make a raft and pole along till we got out into the river again. However, here we are, with the boat not much the worse, and everything on board ready for a start in the morning; and it\u0027s thanks to you as we have done it, for I am free to say as I don\u0027t think as I should have hit on this plan as we have carried out. You are a good mate to work with, lad, and no mistake. I don\u0027t wish never to get a better. It\u0027s a pity ye don\u0027t mean to stick to it for good, for I can swar that you would make one of the best hands on the Mississippi, in time.\" The journey down the river was continued next morning. At the first place they stopped at they heard reports of widespread damage, of great tracts submerged, and of danger to life; the river was still at full flood, although it had fallen two feet from its highest level, and the next ten days were spent in rescuing the unfortunate people from the tops of the houses, trees, and patches of rising ground on which they had taken refuge. Then, having done all they were able, and the river having now fallen nearly to its average level, they continued their voyage down to New Orleans. Hiram, in his report of the voyage to his employer,[129] spoke in high terms of Frank\u0027s conduct, and ascribed to his quickness of invention their escape from what seemed likely to be an almost endless detention. \"But I am afraid he has made his last v\u0027yage with me,\" he said; \"he is talking of striking out across the plains to Californy. There was a good talk of gold thar before we started; and last night, after we came in, and went in for a drink and to hear the news, there didn\u0027t seem nothing else to talk about. The young chap was asking all sorts of questions, and I expect he\u0027s off; and I don\u0027t know as I blames him. He\u0027s the sort of fellow to get on. He has plenty of grit; he\u0027s strong and active now, and in a couple of years he will widen out and make a very big man. He\u0027s had a first-rate edication—he don\u0027t talk about it, but one would be blind not to see that—he will make his way wherever he goes, and I don\u0027t blame him for striking out from the river. He likes the river, too; but it ain\u0027t the place for making a fortin, unless you\u0027ve got money at your back, as you have, boss. But I don\u0027t know if he had money, and could go into steamers and such-like, that he would stick to it. \"I don\u0027t know nowt of his history, but I think things must have gone hard with him somehow, and he came out here for excitement more than for making money. But there\u0027s nothing reckless about him; he don\u0027t drink, and he don\u0027t gamble, and it says a lot for a young fellow in New Orleans that he don\u0027t do one or the other. And he can fight, he can; there ain\u0027t no doubt about that. Why, I saw him give the biggest kind of a thrashing to the bully of a lumber camp, where we moored up alongside one night, as ever you seed. The chap was big enough to eat him, but he didn\u0027t have no kind of show. The young[130] un just hit him where he liked, and in five minutes that chap\u0027s face was a thing to see, and the lad never got so much as a scratch. I wouldn\u0027t have thought as a man could have used his hands like that if I hadn\u0027t been thar. I shall be right-down sorry to lose him.\" \"I knew well-nigh when I took him on that he was not likely to stay, Hiram; he said as much. He wanted to get to know something about the ways of the country before he decided upon anything. If all young fellows would do as he did, go to work for a few months, instead of loafing about spending their money, and getting into bad ways, and among bad fellows, it would be better for them; he has only drawn a few dollars for his expenses—when he was down the last time—since he came to work, so he has got a good sum due to him. I will have a talk with him myself. There are a good many parties starting from here and taking the Santa Fé route; but, taking them all in all, I don\u0027t think I should recommend him to hang on to one of them.\" \"No, I should guess they would be a pretty hard lot who would go out from here—gamblers, and horse-thieves, and runaway sailors, and Mexican fighters—neither good to travel with or good to work with; he had better go up and strike from St. Louis.\" \"He had better go higher still, Hiram; there\u0027s a northern route, and I hear a lot of the Western men are making across that. However, I will talk to him.\" That afternoon Frank went into Mr. Willcox\u0027s little office. \"Hiram has been speaking in very high terms of you, and I find that I am indebted to you for the saving of the boat, with what cargo she had on board, which Hiram[131] said he had altogether given up as lost. You seem to have been in a position of very great danger, and to have had an extraordinarily narrow escape of your lives. However, I can understand that you are not content to settle down for life on the Mississippi, but I can tell you that with enterprise, judgment, and steadiness there is fortune to be made here still. I am not surprised that the gold-seeking mania has got hold of you.\" \"It is not so much, sir, the gold-seeking mania as the excitement attending it. I don\u0027t think I particularly care about making money, but I do want the excitement of such a life. I have come out for that, and not, as it is generally called, to make my fortune. The course of my life at home has been upset by circumstances into which I need not enter, and, at any rate for a time, I want action, and excitement. After that, perhaps, I may think of settling down, and what is called making my way.\" \"I can understand your feeling, lad, and will not try to persuade you to stop at this business. And now, what route are you thinking of taking across the continent?\" \"I was thinking of joining a party going direct from here across to Santa Fé.\" \"I don\u0027t think that will be a good plan, lad. The caravans from here are composed, for the most part, of very hard characters, the sort of men who would shoot you for your horse if they took a fancy to it; I would by no means advise you to ally yourself with such men. I can, I think, put you in the way of a better plan than that. I find that a great number of caravans from the West are going by a northern route which crosses the Missouri at a point called Omaha. I have been thinking that this will become an important place, and have made up my mind to[132] freight four or five flats with flour, bacon, and other goods of all sorts, and a frame store, and to go up there and open a business. I shall want a handy man with me at first; I shall take up a storekeeper to leave there in charge, but at first he will want help. If you like to go up in charge of one of the scows, and to stay to help put up the store and set things running, I will give you a hundred dollars, and you can have your passage up for your horse, which I should advise you to buy here. You will get one that will carry you, though of course not much to look at, for about fifty dollars; I know several horse-dealers here, and will get one for you if you like. You had also better get a stout pony to carry your traps and provisions; that will cost about forty dollars. Then you must have a rifle and a Colt. These are absolutely necessary for such a journey, for I hear that the Indians are very troublesome on the plains. These, however, I myself shall have much pleasure in presenting you with, in testimony of the obligation I feel I owe you for saving my boat and goods. The hundred dollars that are due to you, and the hundred that you will further earn at Omaha, will be sufficient for your horses and outfit, which will leave this money which you placed in my hands untouched. You will find that very useful, for you will want to buy a tent and provisions and tools out there, and money to keep you till you hit upon gold. Well, what do you think of my offer?\" \"I am extremely obliged to you, sir; nothing could suit me better. And I am indeed greatly obliged for your kind offer of a rifle and revolver; they will certainly be most necessary, by what one hears of the journey.\" \"You have some other clothes, I suppose?\" \"Yes, sir; I have another suit in my portmanteau.\"[133] \"Very well, put them on, and come back here in an hour\u0027s time. It will be a week before my steamer starts, and you had better come and stop with me till then; it will keep you out of mischief, and I should be glad of your company.\" At the appointed time Frank returned to the office, dressed in the suit of clothes he had brought with him. A light carriage with a pair of horses was standing at the door. \"Ah!\" Mr. Willcox laughed, as he came out, \"I fancy you look more like yourself now.\" Frank took his place in the carriage, Mr. Willcox took the reins, the negro servant sprang up behind, and they were soon rattling through the streets of the town. Mr. Willcox\u0027s house was situated two miles out of the city. It was a large building, with a verandah running round it, and standing in well-kept and handsome grounds; three or four negroes ran out as the carriage drove up. \"Sam, take this gentleman\u0027s portmanteau upstairs, and get a bath ready for him at once, and lay out a suit of white clothes for him. \"We always have a bath before dinner in this country,\" he said to Frank; \"one wants to get rid of the dust of the day. Dinner will be ready in half an hour.\" After enjoying a luxurious bath, and attiring himself in a suit of snowy-white gear, Frank descended to the dining-room. Mr. Willcox was a widower, without children, and they therefore dined alone. As they were sitting over their wine after dinner in the verandah, Frank\u0027s host said, \"I do not wish to be inquisitive, but if you don\u0027t mind[134] telling me, I should like to know why a young fellow like yourself should embark upon a life of adventure.\" Frank had met with such kindness from his employer, that he frankly told him the whole history of the events which had driven him from England. \"It is a singular story,\" the trader said, \"and I own that appearances were against you. Of course I don\u0027t know him, and may be misjudge him altogether, but the only person who appears to me to have had any interest whatever in getting you into disgrace, and causing you to leave the country, is your cousin.\" \"Fred Barkley,\" Frank exclaimed, in surprise; \"I can assure you such an idea never entered my mind; he is not at all a bad fellow, though certainly he is not popular at School.\" \"I should prefer taking the general verdict of the School to yours,\" the trader said; \"boys are seldom far out in their estimate of persons; they have more instinct than men, and a boy is seldom far wrong in his estimate of character. \"The fact that he is generally unpopular is, in my mind, a proof that there is something wrong about this cousin of yours. Then what you tell me, that he refused to lend you the money which would have got you out of your scrape, while he afterwards came forward with twenty pounds to enable you to get away, is another strong point. The advice which he gave you was distinctly bad; for you had much better have remained, and to the last have protested your innocence. Then there is another point. Did I gather from your words that you and he are the nearest relations to the wealthy uncle with whom you lived?\"[135] \"Yes, that is so,\" Frank replied. \"Then, in case of your disgrace, it is by no means improbable that your uncle will leave him the whole of the money. Is that so? \"I have no doubt of it,\" Frank assented. \"Then you see he has a very strong interest in bringing you into discredit. Besides there were only, you say, five people who had any knowledge of this affair, and of your need for the money. None of the other four had the slightest possible interest in bringing you into disgrace; he had a very strong interest, and, take my word for it, your cousin is at the bottom of the whole affair.\" \"I cannot believe it,\" Frank said, rising from his chair and pacing up and down the verandah; \"if I thought so I would return to England by the next ship and have it out with him.\" \"But you have no shadow of proof,\" Mr. Willcox said, \"it is a matter of suspicion only. Even had the idea occurred to you at first, you would only have injured yourself by stating it, for it would have been regarded as a hideous aggravation of your crime to bring such a charge against your cousin unsupported by a shadow of proof. No; now you have taken your line you must go through with it, and trust to time to right you. It is a suspicion only, but you mark my words, if the mystery is ever solved it will be found that your cousin was at the bottom of it.\" Frank spent a very pleasant week at the charming residence of Mr. Willcox. The latter entertained a good deal, and Frank met at his house several of the leading merchants of New Orleans, and acquired a good deal of knowledge of the state of the country. Most of them[136] were incredulous as to the stories of the abundance of gold in California. That gold had been discovered they did not deny; but they were of opinion that the find would be an isolated one, and that ruin would fall upon the crowds who were hastening either across the continent, or by ship via Panama, to the new Eldorado. Several of them tried to dissuade Frank from his intention of going thither, and more than one offered to place him in their counting-houses, or to procure him employment of other kind. Frank, however, was firm, for he was going, not for the sake of making money, but of finding adventure and excitement. He went down every day to the wharf and superintended the loading of the scows, and at the end of ten days he resumed his boatman\u0027s clothes and took his place on one of the scows. Hiram accompanied him, with eight negroes, two for each flat. A tug took them in tow, and they started up the river. Mr. Willcox was to follow by a steamer next day, and would arrive at Omaha some time before them, and have time to choose and buy a lot of land for his store, and to have all in readiness for their arrival. Frank had purchased a strong, serviceable horse for his own riding, and a pony for his baggage, together with blankets and other necessaries for the journey. His mining outfit he decided to get at Sacramento, as, although the cost would be considerable, he did not wish to encumber himself with it on his journey across the plains. The rifle and revolver had been presented him by Mr. Willcox, and he determined to practise steadily with both on his voyage up the river, as his life might depend on his proficiency with his weapons. The voyage up the Mississippi and Missouri was performed[137] without any notable adventure, although in the little-known waters of the upper river the tug ran several times aground. Those on board the flats had but little to do, their duties being confined to pumping out the water when there was any leakage; and the negroes had been taken up more for the purpose of unloading the cargo, carrying it to its destination, and putting up the store, than for any service they could render on the voyage. Frank, who had laid in a large store of ammunition for the purpose, amused himself by practising with his pistol at a bottle towed behind the scow, or with his rifle at floating objects in the stream, in feeding and taking care of his horses, and in listening to many yarns from Hiram. \"I can tell you, lad,\" the latter said one day, when, after passing St. Louis, they had entered the waters of the Missouri, \"thar have been changes on this river since I was a youngster. I was raised at St. Louis, which was not much more than a frontier town in those days, and most of the work lay below; here and there there was a farm on the Missouri, but they got thinner as they got higher up, and long before we got to where we are going it was all Indian country. I used to go up sometimes with traders, but I never liked the job: first, I didn\u0027t like selling \u0027fire-water,\u0027 as they called it, to the Indians, for it made them mad, and brought on quarrels and wars; in the next place, it was a dangerous business. The Indians used to meet the traders at some place they had appointed beforehand, and there would be big feastings; sometimes the traders would come back with the boat loaded up with buffalo robes and skins, and Indian blankets, and such like; once or twice they didn\u0027t come back at all, and it was just a mercy that I didn\u0027t stay behind with them on one of the trips.[138] \"I went up with a trading party to a place somewhere near this Omaha; we had three boats, with six voyageurs in each. I was about five-and-twenty then, and was steersman of one of them. There were four traders; they were in my boat, and they played cards and drank all the way up. One of the boats was a flat—not a flat like this, but just a big flat-bottomed boat,—for they were going, as I understood, to get some good horses from the Indians and take them down to St. Louis. We had pretty hard work getting her along, and a weak crew would never have got her against the stream, though of course we chose a time when the river was low and there wasn\u0027t much stream on. Sometimes we rowed, sometimes we poled, keeping along the shallows and back waters; and, though the pay was good, I wasn\u0027t sorry when we got to the place appointed; not only because the work was hard, but because I didn\u0027t like the ways of them traders, with their gambling, and drinking, and quarrelling. However, they gave up drink the last day, and were sober enough when they landed. \"I don\u0027t know why, but I didn\u0027t think things were going to turn out well. I had heard the traders say as they didn\u0027t mean to come up that part of the country agin, and I knew their goods warn\u0027t of no account, and that they were going to trade off bad stuff on the Indians. The first two days things went on all right; every evening large lots of goods were brought down to the boats, but except when I went up with the others to the traders\u0027 tent to bring the things down I didn\u0027t go about much. It was a large camp, with two or three hundred braves, as they calls \u0027em. I told the men in my boat what I thought of it; but they didn\u0027t think much of[139] what I said, and traded a little on their own account, for it was part of the agreement that each man should be allowed to take up fifty dollars-worth of goods, and have room for what he could get for them. I traded mine away the first day for some buffalo robes, and so hadn\u0027t anything to take me away from the boat. \"The third day the trading was done; there was to be a grand feast that night, and the boats were to start the next morning. Most of the men went up to see the fun, but I persuaded two of my mates in my boat to stop quiet with me. Presently I heard a yell from the camp, which was about three hundred yards away. \u0027That\u0027s mischief,\u0027 says I. I had scarce spoken when there was a yelling fit to make your har stand on end, and I heard pistol-shots. \u0027Quick,\u0027 lads, says I, \u0027catch up a hatchet and stave a hole in the other boats, and push ours a little way out from the bank.\u0027 We warn\u0027t long in doing that, and then we stopped and listened. \"There was a sharp fight going on, that we could hear, and guessed how it must be going when they war twenty to one. Presently the shouting and firing ceased, and then against the sky-line—for they had lots of fires blazing in camp—we saw a crowd of Injuns come rushing down to the river. We shoved the boat off, and took to our oars; they shouted to us, and then fired at us, and shot their arrows, and swarmed down into the other two boats to come after us, and there was a fresh burst of yells when they found that they wouldn\u0027t swim. We didn\u0027t stop to talk, you may be sure, but rowed as hard as we could. \"The night was pretty dark, and though several bullets hit the boat, and a dozen of their arrows fell into it, only one of us had a scratch, and that wasn\u0027t serious. As soon[140] as we war fairly away, we set to work to roll up the buffalo robes and skins into big bales, and lay them along on each side of the boat, so as to form a protection for us from their bullets and arrows; for we guessed they would follow us down, and in many places the river was so shallow they could ride pretty well out to us. They did follow us, on horseback, for the next two days, and shot at us pretty hot at times. Once they rode so far out in the shallows that we dared not pass them; so we dropped anchor above, and took to our rifles, and gave them a pretty sharp lesson, for they lost seven men. After that they didn\u0027t try that game any more, but just followed down in hopes we might stick on a sandbank. I tell you I never looked out so sharp for shallows as I did on that there voyage. \"Fortunately, at the end of the first day a breeze sprang up from the north, and we got up a sail, for we war pretty nigh done, having rowed by turns from the time we pushed off. We war afraid, you see, as they might patch up the other boats and set out after us, though we hoped they mightn\u0027t think of it, for these horse Indians don\u0027t know nothing of river work. They gave it up at last, and we got safely down to St. Louis. What the trouble was about I never heard, for not one of those who had landed ever got away to tell us. I expect it was some trouble about the quality of the goods, and that the Indians got a notion they were being cheated,—which, sure enough, they war.\" \"Was anything done to punish the Indians, Hiram?\" \"Lor\u0027 bless you, who was to punish them? Why, there was scarce a settler then west of the Mississippi. No; if traders went among \u0027em they went among \u0027em at thar[141] own risk; and, I am bound to say, that if the Indians were treated fair, and the men understood thar ways, thar was no great danger. The Indians knew if they killed traders that others wouldn\u0027t come among them, and they wanted goods—guns and powder most of all, but other things too, such as blankets, and cloth as they calls cotton, and hatchets, beads, and other things, and they wanted to trade off thar hosses and buffalo robes, and skins of all kinds. That was the protection the traders had; and it warn\u0027t very often the Indians fell foul of them, except it might be a muss got up over the fire-water. \"When the news came down to St. Louis there was a good deal of talk about it; but it got about that these fellows had been taking up trash, and the general verdict was that it sarved \u0027em right. All the traders on the frontier set their faces agin men who cheated the Indians, not because they cared for the Indians, mark you, but because anything that made bad blood did harm to the trade all over. However, it gave me a bad scare, and it was a good many years before I came up the Upper Missouri again. There\u0027s some men as seems to me to be downright fond of fighting; but I don\u0027t feel like that, anyway. If I get into a hard corner, and have got to fight, then I fights, but I had rather go round the other way if I could. Thar are dangers enough on this river for me; what with snags, and shoals, and storms, they are enough for any reasonable man. Then there are the river pirates; they are worse than all, though it\u0027s some years since we had much trouble with \u0027em.\" \"River pirates, Hiram? I have not heard you say anything about them before. I did not know there were any pirates on these rivers.\"[142] \"Thar used to be, lad, years back, lots of them, and a pretty lively time we used to have on the river.\" \"But what sort of pirates, Hiram?\" \"Well, thar war two sorts, you see, at that time. Five-and-twenty years ago the settlements on the river war a long way apart. You might go fifty miles without seeing a village when you once got past the plantations on the lower river; you may say as this region then was like what Kansas is now. Chaps who had made it too hot for them in the east came out here, and just had to wrestle round for a living. New Orleans is pretty bad now, but it was a sight worse then; and St. Louis was a pretty hard place. Then, too, thar war runaway slaves. So you see, one way or the other, a fellow who wanted to get together a band up to any mischief had not to look far for men. \"Well, as I said, thar war two sorts. Thar war the men who lived away from the river, say in the low country between the Arkansas and the main stream, which was then pretty nigh all swamp and forest; perhaps they had hosses, perhaps not, but mostly they had. Well, one fine morning a dozen of them would ride into one of the villages on the river. Thar wasn\u0027t much to take thar, you know, onless it war fever, and they had enough of that in thar own swamps. They would wait, may be, for a day or two, till a boat came in, and as soon as it had made fast they would cover the men with thar rifles, and just empty it of all it had got—powder, blankets, groceries, and dry goods, and what not—and make off again. I got my cargo lifted, I should say, a dozen times that way. It war onpleasant, but thar was nothing for it; and it warn\u0027t no use making a fuss when you saw half a dozen rifles pinted at you. Why, in the early days of steamers,[143] more than once they got held up, and the fellows went through the passengers and cargo and took what they fancied. \"Well, that was one sort of pirate. The other was what you may call the regular water pirate. They lived on the islands, in among the back-waters, or where-ever thar might be a patch of raised ground among the swamps, and had boats; and they would attack you at night as you war dropping down the stream or poling up the backs. They war wuss nor the others. A sight more nor half of \u0027em war blacks; and good reason why, for the fevers carried off the whites as joined them before they had been thar long. They was a powerful bad lot, and those who fell into thar hands hadn\u0027t much chance of thar lives. The runaway slaves war down on a white man, and he had no marcy to expect at thar hands; besides, they didn\u0027t want no tales told which might scare boats from going near the places where they war hiding. So in general they fust emptied the boats, and then scuttled and sunk them, and cut the throats of all on board. Hundreds of boats war missed in those days, and none ever knew for sartin what had become of them. \"I tell you one had to keep one\u0027s eyes open in those days. We had strong crews, and every man was armed, and a pretty sharp lookout was kept; but for all that thar was places, back-waters, and cuts, and such like, whar I wouldn\u0027t have been stuck in after dark, not for all the money in Orleans. Even in the open river no one was safe from \u0027em, for they got so bold they would go out, four or five boat-loads, and attack in broad daylight; things got so bad that no one dared go up or down, unless it was ten or twelve boats together for protection. It war the[144] steamers as broke \u0027em up; thar ain\u0027t no stopping a steamer, and every one took to being towed up or down. Then the population increased, and regular expeditions war got up to hunt \u0027em down. Altogether it got made too hot for \u0027em, and the game didn\u0027t pay; but for some years, I can tell you, they war a terror to the river.\" \"And were you never attacked, Hiram?\" \"I was chased several times,\" Hiram said; \"but I had a fast boat and a good crew, and we generally had four white men on board then, and plenty of arms. Yes, we had some skirmishes, but it was only once I had a regular set-to with \u0027em, and that war a pretty bad job.\" \"How was it, Hiram?\" \"Well, you see, the river was pretty full, and the wind had been light for some time, and there warn\u0027t no way of making against the main stream; I had waited for three weeks, and me and my mates got sick of it. We had a cargo which was due up the river, and we made up our minds at last that we would push on and take our chance. We had eight negroes, all strong active fellows, armed with cutlasses and old ship muskets, and we four whites had rifles and pistols. We allowed we could make a good fight of it, so we agreed as we would go up the back-waters, so managing as to be able to get out into the stream every night and anchor thar. We shifted the cargo a bit, so as to pile it up round the sides, stowing the rice-bags so as to make a sort of breastwork; then off we started. \"For some days we got along well; the blacks poled thar best, and every evening we just hit a pint where we could go out into the stream agin. Two or three times we fancied we war watched, for we heard the[145] snapping of twigs, and sounds in the thick swamp jungle ahead; but I reckon they thowt better of it when they saw two rifle-barrels peeping out from the sacks on each side, and saw we war ready for a tussle. But one day—it wasn\u0027t very far from the pint where we mended up that boat the other day—we war later than usual; the stream war stronger than we reckoned on, we had run aground two or three times on the mud, and it war getting dark, and we had two miles yet before we got to a place where we could get out into the river. The blacks war working thar hardest; it didn\u0027t need no words from us to keep \u0027em at it, for they knew as well as we did what was the danger, and the boat just flew along that narrow channel.\" \"We war on the watch, with our eyes fixed on the bank, and our ears pretty wide open to catch any sound ahead. All of a sudden a gun was fired close alongside. The blacks gave a yell, and would have jumped down into shelter, only I shouted, \u0027Stick to your poles, men; if you lose them we are done for; there\u0027s no danger, it\u0027s only one man.\u0027 So on we went again, for, luckily, no one was hit. \u0027That\u0027s a signal,\u0027 Bill, says I to one of my mates; \u0027I reckon we shall have trouble afore we are out of this.\u0027 On we went, flying between the bushes, which warn\u0027t fifteen yards apart. Not a sound was heard but the panting of the blacks, the splash of their poles in the water, and a sort of sighing noise behind, as the ripples the boat made as she glided along rustled among the boughs which dipped down into the stream. \"We had got a mile further when we heard a noise. It was much as a pole might make knocked against the side of the boat. I knew thar was mischief now. \u0027Get in your[146] poles, lads,\u0027 I said; \u0027four of you get out oars through the holes we have left for them atween the bags, and put your muskets close at hand; the other four get your muskets, and station yourselves two on each side.\u0027 We went on slowly now; we knew they war ahead of us, and that hurrying wouldn\u0027t do no good, and that we had got to fight anyhow. It might have been five minutes when thar was a flash from the bushes on either side—which we could scarce see in the darkness,—and fully a dozen muskets poured a volley into us, buckshot and ball, as we found on looking over the boat the next morning. It was a good job as we put them rice-bags in place, for I reckon thar wouldn\u0027t have been many of us up to fighting if they hadn\u0027t been thar. We had agreed not to fire back if we war fired at from the wood, for they couldn\u0027t do us much harm thar, and it was best to keep our fire for the boats which they war sure to have as well. \"The moment the volley was fired two boats shot out, one from each side. \u0027Now, give it \u0027em,\u0027 says I. Up we jumped, four on each side, and poured our fire into the boats, which warn\u0027t twelve feet away. The darkies who war rowing had been told what to do, and, to do \u0027em justice, they did it well. Thar was a yell from the boats as we fired, for I reckon every shot told; but the way they had got brought \u0027em on, and their bows struck us just at the same moment. Then at it we went with our pistols as they crowded forward and tried to get on board. It was over in half a minute, for the four blacks had seized their poles, and, shoving them into the boats, two on each side, pushed \u0027em off. \"I have heard pretty tall language on the Mississippi, but I never heard such volleys of cussing as came up from[147] them boats; some of the men blazed away with thar guns, some shouted to others to row alongside, some who war hit yelled and cussed like fiends; and all this time we war lying behind the bags, ramming down fresh charges for the bare life. We gave \u0027em eight more shots before they could cast off the poles and come at us again. This time they came along more on the broadside, and five or six of \u0027em sprang on board; but we war ready with the butts of our rifles, and the blacks with thar cutlasses, and we cleared them off again. The four darkies had stuck to thar poles; one boat was shoved off, and one of the blacks run his pole right through the bottom of the other, and in a minute she went down. \"The other boat didn\u0027t know what had happened, and came up agin; but leaving two of the blacks to chop down any of the fellows in the water who might try to climb aboard, the other ten of us stood up and fought \u0027em fair. Our blood was up now, and our darkies fought like demons. The pirates soon found they had the worst of it, and would have got apart from us if they could; but we jumped into thar boat and fought them thar, and they soon jumped over and made for the bank. Directly it was over they began to fire agin from the shore, and we jumped back into shelter agin in our own boat and manned the four oars agin. We fastened the painter of the boat on to our stern, and towed her behind us, and in another half an hour were out in the stream. It was a toughish fight, I can tell you, while it lasted; two of the blacks and one of my mates had been hit by thar musket-balls, and the rest of us war either gashed by thar knives or had got ugly cracks. However, six of them war lying in the boat when we hauled it alongside; two war stone-dead,[148] the other four had been stunned with the butt ends of the muskets, or cut down by the darkies\u0027 sabres. We took \u0027em down to the next place and handed \u0027em over to the sheriff; and as thar happened to be a lot of boats waiting thar for the wind, you may guess it warn\u0027t many hours afore they tried and hung \u0027em. \"When the chaps heard the particulars, and that we had sunk one boat, besides bringing off another, they guessed as likely enough the pirates war trapped thar; and so they got up a regular expedition, six boats, each with a dozen men. I went back to show \u0027em the place. They brought dogs with them, and hunted through the woods and swamps till they came to the patch of higher ground whar the pirates had got thar huts. Thar were about twenty of \u0027em, mostly negroes, and they fought hard, for thar was no escape, the boat having drifted away after it had sunk. Behind thar war some widish channels, and some of the boats had gone round thar to cut \u0027em off if they took to swimming. They war killed, every man jack, and that put an end to one of the very worst lots of pirates we ever had on the river.\" \"You were lucky to have got out of it so well, Hiram. I suppose that sort of thing is quite over now.\" \"Yes. In course thar are water thieves still, chaps who steal things from the boats if thar is no one with \u0027em, or if you are all asleep below; but thar haven\u0027t been no real pirates for years now—leastways not above New Orleans. Down in the great swamps, by the mouth of the river, thar\u0027s always gangs of runaway slaves, and desperate characters of all sorts, who have got to live somehow. Thar are still boats sometimes missing up the river, which may have been snagged and gone down with all hands,[149] and which may be have comed to thar end some other way. Anyhow, no one thinks much about pirates now, and the river\u0027s quite as safe as the streets of New Orleans. That mayn\u0027t be saying much, perhaps, but it\u0027s good enough. Of course a party might any day take to the swamps and stop up-passing boats, just as they might take to the roads and stop waggons going west; but one doesn\u0027t trouble about things onless they get so as to be what you might call a general danger. \"You can\u0027t go into a bar-room without a risk of getting into a fight with a drunken rowdy; you can\u0027t stop at one of these landing-places but what thar\u0027s a chance of getting into a mess with fellows who come in from the backs for a spree, and one doesn\u0027t look to have these rivers which, one and the other, are tens of thousands of miles long, just kept as free from hard characters as a street in Boston. It\u0027s as good as we can look for at present. Settlement is going on wonderful fast, and, like enough, in another forty years there won\u0027t be any more pirates on the great rivers here than thar are on the seas. Steam and settlements is bound to wipe \u0027em out at last.\" During the last two or three hundred miles of the journey up the Missouri a few settlements only were passed, little villages nestling closely together on the edge of the river, surrounded often by a stockade; for although the Indians were gradually falling back before the advance of the whites, Indian wars were of frequent occurrence, and then the bands of wild horsemen swept down to the Missouri, carrying fire and destruction in their course. In front of every settlement lay a scow or two, used partly for the transportation of the crops, but valuable also as[150] an ark of refuge in case of attack. The shores were low, and shallows and banks abounded in the stream, and sometimes the tug ran aground four or five times in the course of the day. In spite of his practice with his firearms, and Hiram\u0027s talk and stories, Frank began to find the days pass very slowly, and was not a little glad when Hiram pointed out a cluster of huts on the left bank, and said, \"There is Omaha.\" Half an hour later the tug was alongside, and Mr. Willcox was on board. \"I am glad to see you up,\" he said, as the flats were moored to the bank, and Frank stepped ashore and joined him. \"The time has gone slowly here; for though I stayed four days at St. Louis, I have been here nearly a week. There is lots to do, and I am greatly pleased that I went in for it. I wish you could have made up your mind to settle here; you would have made a precious deal better thing of it than you ever will do by digging for gold. However, I know it\u0027s no use talking about that. I have got a capital location on the main street; I bought it off a fool who came up in the steamboat with me, and had made up his mind to sell out and cross the plains. I had an offer for it yesterday at five times the price I gave for it; but, bless you, I wouldn\u0027t have taken twenty times. This is going to be a big place. I am glad you have come for another reason. I am putting up at one of the shanties they call an hotel, but one might as well try to live in the Tower of Babel. There is an uproar day and night; every inch of the floor is taken up for sleeping on, and I have been nearly driven out of my mind. Now I can live on board the tug till she goes down with the empty flats. I am glad I brought up those eight negroes, for there would be the[151] greatest difficulty in hiring hands here; every one seems to have gone stark mad, and to consider every hour\u0027s delay in pushing west as so much loss of a chance of making a fortune.\" For the next fortnight the labour was incessant. Hiram, Frank, and the eight negroes toiled in landing the stores and the framework of the house, and in transporting them to the lot which Mr. Willcox had purchased. Even the engineers of the tug were induced by the high payment Mr. Willcox offered to aid in the work. Several stretchers, or hand-barrows, had been brought up with them, and on these such bales and boxes as were too heavy for one man to carry were transported. The framework of the house was first carried to the site, and four of the negroes who were good carpenters at once began to put it together, so that by the time the last of the goods were brought up the store was ready to receive them. It was a building some sixty feet long by twenty wide, and was divided into two by a partition: the one end, twenty feet in length, was the saleroom; in the other, forty feet long, the bulk of the heavy goods, flour, rice, bacon, hogsheads of sugar, and chests of tea, were stored. There was, in addition, a lean-to, nine feet square, at one end, which was to serve as the habitation of the storekeeper. The assortment of goods was very large. In addition to the stock of provisions, which filled the storeroom nearly up to the roof, were a great quantity of clothing fitted for the rough work of the plains, a large assortment of rifles and pistols, kegs of ammunition, casks of axle-grease, ironwork for waggons, and all the miscellaneous stores, down to needles and thread, which would be likely to be required by the emigrants. As soon as[152] the stores were all safely on shore and housed, the tug started down the river again with the flats; Hiram and six of the negroes accompanied them, two of the latter being retained as assistants to the storekeeper. Between Hiram and Frank there was a very cordial adieu. \"I likes yer, young fellow,\" the boatman said; \"you will make your way, never fear, some day, if you get a chance. Send a line to me, to the charge of the boss, and let me know how things go with you. I shall be gladder than I can tell you to hear as you\u0027re making your way, and I shall be anxious like till I hear as you have got safely over this journey, for they do say as the Indians are playing all sorts of devilry with the caravans. Well, there\u0027s one thing, you are a good shot now; but be careful, lad, and don\u0027t get into no fights if you can keep out of \u0027em.\" Frank remained for another fortnight assisting in the store; by the end of that time things had settled down. They were already doing a very large business, and Mr. Willcox had sent down orders, both to St. Louis and New Orleans, for fresh consignments of stores very greatly exceeding those which he had brought up with him. Three months previously Omaha had been a tiny settlement of a dozen houses, but was rapidly growing into a considerable place. Many stores were rising, but the distance from the inhabited settlements, and the difficulties of carriage, were enormous. The population was, for the most part, a floating one, scores of waggons and vehicles of all sorts arriving every day, while as many departed. This was the last point of civilisation, and here the emigrants generally halted for a few days to rest their weary cattle,[153] and to fill up their stores of provisions for the journey across the wilderness. All believed that a vast fortune awaited them on the other side of the continent, and the most fabulous tales of the abundance of gold were circulated and believed. In some cases the parties consisted only of men who had clubbed together and purchased a waggon, and started, leaving their wives and families behind them. In others they were composed of whole families, who had sold off farms or businesses in the east in the assurance of acquiring a fortune at the gold-diggings. Around the little settlement the plain was dotted with the white tilts of the waggons, mingled with the tents which had been extemporised of sail-cloth, tarpaulins, and blankets.","sourceLink":"http://novel.tingroom.com/duanpian/3159/86709.html","bookId":875,"book":{"id":875,"title":"Captain Bayley\u0027s Heir: A Tale of the Gold Fields of California","description":"简介： CRIPPLE boy was sitting in a box on four low wheels, in a little room in a small street in Westminster; his age was some fifteen or sixteen years; his face was clear-cut and intelligent, and was altogether free from the expression either of disconten...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3159","creation":"Aug 1, 2019 12:23:39 AM","modification":"Aug 1, 2019 12:23:39 AM"}}
