{"id":99962,"no":27,"title":"Page 27","content":"Flavius? I lean in, hardly daring to hope. “Shine a light on his face, will you?”\n Xirol does; there’s a lot of blood, but I have no doubt this is the same asshole who taunted me over lunch so long ago, when I was still filing petitions. I smirk. Who got his just desserts, huh, Flavius? It’s delightful that he’ll serve the cause postmortem.\n “Is this the same Flavius?” Vel asks, familiar with my frustrations.\n “Yep.”\n “If he left ten guarding his home in the city, then seven Imperials will be waiting for us,” Loras muses. “I’ll draw lots for the four who’ll accompany me in the aircar.”\n “Shouldn’t you pick the crew who are best at hand-to-hand?” Zeeka asks. “In case you run into trouble.”\n It’s a logical question, but Loras doesn’t want to rank us. I can see by his expression that he fears creating resentment in the squad. So he narrows his gaze on the young Mareq, and snaps, “Don’t question me, boy.”\n Z brings his long arms forward in a shamed hunch. “Sorry, sir.”\n Loras turns to Vel. “Can you randomize all ten names and have four come up on your handheld screen?”\n Vel’s insulted by the question; his mandible flares, and not in the friendly fashion. “Certainly. Let me finish downloading the dossier on Legate Flavius, and I will attend to it.”\n A few clicks, and the screen lights up with each word, one by one. Bannie. Timmon. Rikir. Eller. The rest of us will be hiking. Farah squares her shoulders, and Loras takes a half step toward her. A nearly imperceptible shake of her head stops him. For a few seconds, his face is naked with regret; he wishes he could disregard the lottery. But she doesn’t go to him. Right now, she’s a soldier, and she can’t give him what he wants…or it will damage morale.\n Mary, do I know how she feels.\n “Vel, you have bravo group,” Loras says.\n “See you on the other side,” Xirol calls, as the aircar powers up.\n Then it’s just the five of us in the dark.\n La’heng Liberation Army signal-jack ad: Profile Three\n ORIANA\n [A girl gazes off-screen at something the viewer cannot see. Then the interviewer speaks.]\n Male voice, off-screen: Can you tell us your story, Oriana?\n Oriana: Of course. [She faces the camera.] Unlike most of my people, I don’t remember my family.\n Male voice: Is that unusual?\n Oriana: A bit. Most of us are born in the provinces, where we’re sworn to a protector. If we’re lucky, he visits once to make sure we’re still breathing; then he returns to his life in the city. I was born in the capital to two La’hengrin servants already bound to one of the noble houses.\n Male voice: But you said you don’t remember your parents.\n Oriana: The master of the house traded me. I don’t know why. He gave my bond to a powerful legate when I was an infant, and I never knew any life other than obedience and servitude. I thought it was natural that I shouldn’t think too much—that I didn’t need an education because the legate had no intention of seeing me trained as a translator, which is the only cerebral work my people are permitted on world. I have heard stories since that others who escaped La’heng have taken other training, always with their masters’ permission—and those masters are never Nicuan.\n Male voice: Have you met your parents?\n Oriana: They died in service. There was an assassination attempt, and they gave their lives so their master could escape.\n Male voice: The La’hengrin cannot defend themselves. How could they help during a fight?\n [Her face falls into deep, sad lines.]\n Oriana: They cannot. But they can die. Sometimes, a few seconds is all a coward needs to flee.\n Voice-over: And that’s who you’re fighting for. Contact the comm code at the bottom of your screen to find workers with the cure.\n CHAPTER 30\n As I move out, the sky opens up. The promised rain spills down over us in a liquid-silver curtain, cold enough that I feel it through my insulated armor.\n I glance over at Zeeka. “Your gear holding up?”\n I fret about him more than I should. Most days I tell myself it’s because he’s cold-blooded, so climates like this one can screw with his physiology. He’d be better off on a tropical world, far away from this war.\n But Z nods, his eyes shining. “Warm as my bunk. I’m good, Jax. You don’t have to worry about me.”\n “Everyone needs a hobby,” I mutter. Mine used to be wondering how I’d die.\n It’s a mystery to me how Z isn’t crazy from grimspace deprivation, but unlike Argus, he took the training without any hint of addiction. That might mean Doc was right all along; the Mareq have the perfect ability to tolerate—and navigate—grimspace. If the Makers had anything to do with their engineering, that makes sense. If the Mareq are a servile race, created by the Makers, then they would have all the genetic markers necessary to make them useful.\n As for me, I’m suffering, as always. Sometimes, when the need gets too much, I consider eating some pills or powder, maybe a shot, but chem won’t solve my problem. It’ll just give me another addiction. So I strangle the feeling until it’s bearable, and I go on, because that’s my job. I lock the pain and the longing up with everything else I want and can’t have right now.\n Like March.\n “The estate is twenty-five klicks that way,” Vel says, pointing.\n “Just a hop in the aircar.” But there’s no rancor in Xirol’s tone.\n Loras chose his companions fairly, even when he wanted to take Farah with him. I have no complaints about the process though it left me marching in the rain. Farah pulls up her hood to keep out the damp, and the rest of us follow suit. Vel takes point with the rest of us in twos. Z ends up beside me, Xirol with Farah.\n In this weather, I estimate four hours, but Vel sets a bruising clip. He’s almost running, like he knows something bad’s waiting for us, as if Loras and the others flew into a trap. I want to ask if his instincts have told him something, but I don’t want the others to overhear. Instead, I resolve to be ready.\n My boots slip and slide over the cold, muddy ground. This is what it was like for March on Nicuan, I think, except it was hot…and it went on for turns, until he snapped. No wonder he’s got a monster inside him.\n Under Vel’s aegis, it only takes us three hours and change to make those klicks, and I’m exhausted when lights glimmer out of the darkness. They shouldn’t have had trouble with the number of centurions present. All should be well. But when Vel raises a hand to motion us to stillness, I press forward, trying to see what he does.\n “What’s the holdup?” Xirol asks. “I’m ready to get out of the rain.”\n In answer, Vel points to the number of aircars parked before the manor. There are five, one of which Loras arrived in, but I don’t see any sign of him. There are no sentries posted outside since it’s a miserable night, but they’re inside.\n “It looks like a house party,” Farah says softly.\n I nod. “Assuming four people per vehicle, that’s an extra sixteen men.”\n “Plus the seven centurions,” Zeeka adds.\n “Loras gave you command, Vel.” Xirol says. “What are our orders?”\n He crouches beyond the range of the lights that illuminate the manor exterior, tapping his handheld. Then he shakes his head. “I cannot get a clear reading. There are devices inside, interfering with the energy emissions.”\n “So we don’t know where they are,” Farah says, her voice taut.\n For her, this must be doubly terrifying. Both her brother and lover have vanished this rainy night. They might be hostages; there might be more centurions on the way. If we’re caught here, it destroys the plan to sub Vel for the legate and makes this detour pointless.\n Plus, we could all die; I’m glad I’m not in charge.\n “If they were outside, they’d have spotted us,” I point out.\n “We must do some recon,” Vel says. “I am the most qualified for the task. Remain here until I return. Stay out of sight.”\n “Shit,” Xirol whispers.\n I feel exactly the same way as Vel slips into the shadows. Intellectually, I know he’s a better hunter than any of us. He knows how to go unseen, how to snag his target, from all those turns as a bounty hunter. But it doesn’t help a lot when you’re squatting in the mud, rain pouring down, and you don’t know what’s going on.\n “What if he doesn’t come back?” Zeeka asks.\n Pain twists through me, nearly making me cry out. Even the idea is devastating. Unthinkable. Somehow, I manage to reply, “Then we move out. We have our orders for the capital. We’ll divide up as directed and carry on.”\n I’m not stupid. If Loras and the others are lost, if Vel doesn’t make it out, then the four of us have no hope of taking out all the centurions inside. Without Loras to drive the war effort—he’s the face of the revolution—I don’t know how it can go forward, but it has to. I won’t let all this work be for nothing. If I can’t do it with my friend, I’ll finish it for him.\n “I have his contacts,” Farah says softly. “I can step in.”\n Those words must feel like razors in her throat. Yet her face remains set and determined, her delicate jaw firm. This woman is worthy of Loras. Mary, I hope he’s all right. This isn’t how it’s supposed to end; he shouldn’t die a martyr for the cause.\n I curl my hands into fists within my gloves. The minutes tick away slowly, feeling more like hours. At last Vel slips back into position, and I fight the urge to hug him. Not appropriate, Jax.\n “I suspect the others arrived after our men,” he reports. “I could find no sign of anything amiss, however, so I do not believe they have been detected.”\n Farah exhales slowly. “So they’re hiding, trapped inside.”\n “We don’t dare use the comm,” I whisper.\n Vel nods, indicating it might give away their hiding spot and get them killed. I made that mistake once. It won’t happen again. Sorry, Doc.\n “We need a diversion,” Zeeka says.\n “Good plan.” Xirol studies the aircars parked before the manor. “One of those would make a nice, big boom.”\n If Sasha were here, we wouldn’t have to lay charges. But he’s just a kid. And when he’s old enough, when March gives him permission to fight, he won’t be on my team anyway. He’s going into the Special Forces unit.\n “I’ll do it,” Zeeka offers.\n Z feels about explosives as I do grimspace; for him, jumping is a job, an exciting one, but not an addiction. He’s lucky in that regard.\n “Allow time for us to get out of sight before you trigger it,” Vel orders. “Set the charges to take out as many of the other vehicles as you can. Then meet us around back. We will enter through the kitchens as they come out to investigate.”\n “What’s our priority inside?” Xirol asks. “Find our people or kill the enemy?”\n As I knew he would, Vel says, “Rescue first. Once we reunite, and our numbers are restored, we can engage.” \n","sourceLink":"https://allnovel.net/endgame-sirantha-jax-6/page-27.html","bookId":1651,"book":{"id":1651,"title":"Endgame (Sirantha Jax #6)","description":"Storyline: \n Endgame (Sirantha Jax #6) \n Regret nothing. \n Sirantha Jax has the J-gene, which permits her to “jump” faster-than-light ships through grimspace. She loves nothing more than that rush, but the star roads have to wait… \n Her final mission takes her to La’heng, a planet subjugated during first contact. Since then, the La’hengrin homeworld has been occupied by foreign conquerors. \n All that’s about to change. \n Now, as part of a grassroots resistance, Jax means to liberate the La’hengrin. But political intrigue and guerrilla warfare are new to her, and this will be the most dangerous game she’s ever played—spies and conspiracies, a war of weapons and hearts, and not everyone is guaranteed to make it out alive...\n \n","cover":"https://allnovel.net/images/endgame-sirantha-jax-6.jpg","author":"Ann Aguirre","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/endgame-sirantha-jax-6.html","creation":"Oct 5, 2019 8:57:50 AM","modification":"Oct 5, 2019 6:47:49 PM"}}
