{"id":105046,"no":15,"title":"Page 15","content":"The room was more crowded than before. During her conversation with the prince, Lydia had been dimly aware of lights passing among the trees and hedges as servants conducted newcomers along the paths from the enormous outer court. Scanning backs, Lydia identified the asymmetrical mauve volutes of her patroness\u0027 gown in the midst of a dark cluster of male suiting. As she approached, she heard the guttural babble of German and made out references to track miles, rolling stock, gauge widths, and Krupps that told her that Lady Clapham had fallen among the businessmen, but in any case Lady Clapham held out her hand to her with the air of a somewhat long-toothed Andromeda greeting a schoolgirl Perseus in ecru lace and pink ribbons.\\n\\n \"My dear Mrs. Asher,\" she cried. \"May I present to you Herr Franz Hindi? Herr Hindi, Mrs. Asher. Now if you\u0027ll please excuse us, Herr Hindi, I promised to introduce Mrs. Asher to Herr Dettmars... You\u0027re a godsend, my dear!\" she added in a low voice as the stout, fair-haired gentleman who had shaken Lydia\u0027s hand was left behind with considerable celerity. \"Such a bore.\" She steered her into one of the smaller rear chambers of the pavilion, just as crowded and if possible more airless than the long front room. \"Do I have the appearance of a woman who will perish if she does not receive accurate information concerning the differences between soft-coal hummer furnaces and hard-coal base burners?\" Lydia paused to study her with mock gravity. \"Turn \u0027round,\" she instructed, and with a straight face the attache\u0027s wife did so.\\n\\n \"Only a little in the back,\" Lydia replied after due consideration.\\n\\n \"I\u0027ll wear a shawl over it, then,\" promised Lady Clapham. \"I am suffocating. Was Prince Razumovsky able to give you any information about your husband, dear?\" Lydia nodded slowly. \"He told me my husband was doing some kind of research, talking to storytellers in the markets. Did he-Dr. Asher, I mean-mention this to you?\"\\n\\n \"That isn\u0027t what brought him to Constantinople, surely?\"\\n\\n \"No,\" Lydia said. \"But he does research in such things wherever he is. He\u0027s a folklorist as well as a linguist.\"\\n\\n Lady Clapham sighed resignedly and poked at her untidy, graying coiffure. \"Well, better than one of those lunatics like my brother, who goes about taking rubbings off tombs. Not even in heathen parts but in places like Wensley Parva and Bath Cathedral. And in hunting season!\" She shook her head wonderingly and picked a cracker of caviar from a servant\u0027s tray as if the man had been a table.\\n\\n \"Yes, he did ask about storytellers. Burnie told him about the old fellow who sits in the street of the brass sellers in the Great Bazaar. Did His Highness offer you his help? I thought so. Just make sure you have Miss Potton with you at all times and you should be quite all right. Where has Miss Potton got to?\"\\n\\n Lydia gazed around the small chamber. Though without her eyeglasses most men in crowds looked alike-except James, of course, whom she would know anywhere under any circumstances, and human Christmas trees like Prince Razumovsky- she could generally spot women by the colors and shapes of their dresses. But there was no sign of the fawn-and-white silk among the crowd, no ink blot of black curls glistening in the sharp yellowish light. She remembered Ysidro remarking last night, I may be somewhere thereabouts, and Margaret\u0027s desire to see him at the reception... And the more so now, to show him her newfound beauty.\\n\\n \"She may have gone into the gardens.\" The image of Margaret, in improbable Georgian panniers and wig, waltzing with Ysidro on the terrace of some dream mansion, floating through her mind.\\n\\n \"She\u0027ll freeze,\" Lady Clapham predicted. \"Oh, my dear, there\u0027s someone I do want to introduce you to... absolutely charming, and such a cut-up...\" She was already starting to lead her toward a man who had just entered the smaller room. Another uniform, this one scarlet, heavily braided with silver and ornamented with, of all things, a leopard skin over the shoulder, set off dark hair and a stance that told her at once, without being near enough to see his face, that he was as handsome as Apollo and knew it. All Adonises, she reflected-or was that Adoni?seemed to stand in the same way. She wondered if anyone had done a study on the subject. Not that anyone but a woman would notice, of course... \"... member of the diplomatic community here and an absolute charmer, even if he\u0027s never going to rock the world with his intellect. Baron Ignace Karolyi...\"\\n\\n \"Excuse me,\" Lydia said hastily. \"I think I see Miss Potton and I really do need to... I\u0027ll be back in one moment...\"\\n\\n \"Really? Where...?\"\\n\\n But she dodged away into the crowd.\\n\\n Fortunately, a doorway connected that room and the other rear chamber of the suite. Lydia ducked through, wove her way to the door leading back into the main salon, and worked back with what speed she could-given a visual range of less than a yard, though the brilliance of the man\u0027s uniform helped in avoiding him- to the double door leading into the colonnade. The cold was sharp. Wishing she\u0027d had time to fetch her cloak, Lydia hurried along the black and white cobbled pavement to the stairway passage in which she\u0027d taken refuge with the prince, and gathered her point-lace train in hand to descend the sloping tunnel to the terrace beyond.\\n\\n Once certain she was out of sight, she pulled her spectacles from her handbag and settled them on her nose.\\n\\n What had been an impression of leafy blackness and swimming spots of color resolved itself suddenly into a sable wonderland of cypress and willow that sloped down to the indigo shimmer of the sea. Bare boughs or somber leaves were illuminated from below by a rainbow lace of colored lamps, which outlined paths and terraces like dim-burning jewels dropped on velvet.\\n\\n To her left the lights traced terraces, stairways, the eaves of pale shut- windowed pavilions in a flickering web of ruby, azure, honey stars... and at the top of a flight of marble steps she saw one star was missing. A lamp had been taken.\\n\\n Margaret. She didn\u0027t know why she was so sure. Gathering her train more firmly, she hastened along the terrace and up those pale steps to the gap in the line of lights.\\n\\n A gem- latticed darkness of marble pavements and low box hedges spread out before her at the top, rimming deep stands of lawn and trees. The pavement led her around to the locked doors of the two pavilions overlooking the lower gardens.\\n\\n Past the second pavilion\u0027s door a low arch of very old bricks pierced the wall, marble steps leading down again, through a vaulted tunnel, to the terraces below.\\n\\n Had Margaret seen Ysidro in the gardens? Or only a shape she thought might be his?\\n\\n She turned back to scan the colonnades, the elaborate pavilions above and behind her, but saw no movement there; neither was there any sight of the pale mousseline de soie dress in the semiwilderness of trees and long grass that lay between her and the sea. She pulled a handkerchief from her bag to shield her fingers from the heat, then picked up another lamp, the brass base beneath the bowl of ruby glass hot through both cloth and glove. One of the innumerable wild cats that lived in the half-deserted shrubberies stared at her for a moment, then poured itself away into the darkness.\\n\\n What am I doing? wondered Lydia, half in disgust, as she descended the marble steps. Two minutes after the handsome Russian prince warns me \"Don\u0027t investigate alone,\" I\u0027m off like the heroine of a cheap thriller...\\n\\n But something about the shadowy darkness of the palace, deserted once the activity around the kiosks had been left behind, filled her with fear for the sake of the younger woman. The sight of Karolyi had shaken her, and she did not think she dared either wait or go back.\\n\\n The red light of the lamp caught in the curves of an iron lion posted in what had been flower beds. On a tangle of overgrown rosebush, Lydia glimpsed white threads where a petticoat hem had caught and been pulled free.\\n\\n There was a door, hidden in the shadows of the three high vaults of ancient brick. It stood open. For a long time Lydia hesitated in the narrow aperture, one hand pressed to the stone jamb, the red-glowing lamp raised to look within.\\n\\n The stagnant pool a few yards behind her seemed to breathe cold over her bare shoulders, an echo of the damp chill that lay before her in the dark.\\n\\n Little did she know, quoted Lydia from the aforesaid cheap thriller, in an effort to push back the dread whispering at her heart, what horrors lay crouched in wait for her.\\n\\n But it was only a stone stairway-used, she thought, but not recently, save for the wet tracks vaguely outlined on the upper step or two.\\n\\n A woman\u0027s slippers.\\n\\n Idiot, idiot, idiot. She wasn\u0027t sure if it was Miss Potton or herself to whom she referred.\\n\\n At the bottom of the stairs, another open door, and a cavern vast and lost in shadows, where the ruby stain of her lamp smudged pillars, incredibly old, rising out of obsidian water to the brick vaulting of the ceiling low overhead. Of course, Lydia thought. All those pools in the gardens had to be watered from somewhere.\\n\\n A walkway stretched along one side of the cistern, vanishing very quickly into darkness. Heart beating hard, hoping she\u0027d find Margaret soon, she started along it.\\n\\n \"This is not a wise thing, mistress.\"\\n\\n Ysidro\u0027s voice was barely louder than a cat\u0027s tread in the dark behind her, but somehow it didn\u0027t startle her. It was as if, for the second or two before he spoke, she knew he was there. Turning, she saw him on the walkway, dressed, as the men at the palace reception had been dressed, in black morning coat and gray- striped trousers, colorless hair framing a dead man\u0027s face.\\n\\n Her breath escaped in a shaky sigh. \"Coming to Constantinople was not a wise thing,\" she said. \"I wondered what you had in that trunk of yours. Did you bring a top hat as well?\"\\n\\n \"It is where I can reach it, should I choose to enter the pavilion.\"\\n\\n He stepped closer and took her hand, guiding her along the path above the sable pool. The light seemed to follow, like a fish in the depths. Cold as she was, his hand on her waist was colder.\\n\\n \"The sultans used to bring the ladies of the harem up this way, when they watched polo or archery from the kiosks on the terrace.\"\\n\\n \"Have you found any trace of her?\"\\n\\n \"She did not pass you, then?\" In the evenness of his voice she read his irritation. He knew whom she meant and what had happened. Then, \"My concentration has been on other matters. It is difficult...\"\\n\\n The uninflected words might have been a complete sentence instead of a broken beginning, but Lydia knew what he stopped himself from saying to her. They stood for a moment face-to-face in the open door of another stair, with the lamp between them, as they had stood in the stairway of his London crypt. The blood- hued light made him more alien still, and she had the curious sensation that if she closed her eyes his features would shift and be no longer the face he was always so careful to show the living, but the face he turned away from mirrors in order not to see himself.\\n\\n \u0027\"It\u0027s my doing.\" She wondered what else she could say. I\u0027m sorry I asked you not to kill innocent strangers on the streets, in the train, in the corners of this palace?\\n\\n In time he said, \"No. My own, for supposing I could have my way without price. I will survive it.\"\\n\\n Another silence. Lydia remembered Margaret\u0027s white breast the night before last when she\u0027d torn open her bodice on the empty street. She had to ask, though she knew it was none of her business. \"Are you drinking her blood?\"\\n\\n \"It would do me no good,\" replied the light voice, but he seemed unsurprised by the question. \"It is the death we need to feed the mind\u0027s power. At this point it were too easy to kill her, did I but taste of her blood.\"\\n\\n I should be afraid of him.\\n\\n And it was her doing.\\n\\n \"It is no easy thing,\" he went on, as if he had read her thought, \"to see myself in the mirror of your honor. Let us hang a shawl before it, as I do the mirrors in my house, and deal with commonplaces as we find them. You\u0027re cold.\"\\n\\n She realized, as he guided her up the long flight, that she was trembling.\\n\\n She had no impression of him leaving her side after they reached the door at the top, but somehow he had a shawl in his hands, heavy silk with a hand like cream as he draped it around her shoulders. \"This is not a safe place to walk.\" He stretched his fingers in the direction of the lamp and in some fashion snuffed the flame without touching it. They passed into a courtyard barely wider than a hall, stairways going up and down into impenetrable night. Dark lay like the seal of death, so that he had to guide her, his fingers tombstone marble through the thin kid of her glove and his.\\n\\n \"I saw her footmarks when I returned to the cistern stair,\" he said. \"They were unclear, and I had to look on the walkway to be sure she had not passed that way going out.\" He paused and added something Lydia knew enough Spanish to identify. \"You chose her because she was stupid,\" she reminded him softly. \"Stupid and loyal. What she feels for you was your doing.\"\\n\\n \"It is one matter to follow a husband whom you know to be walking eyeless and unarmed into treachery.\" They passed into a chamber, crossed layers of dust- thick carpet and ascended a rickety stair to a balcony enclosed by lattice- down another stair and so out again. \"You sought advice in the matter, recognizing your limitations, and his. It is another matter to pursue needlessly one to whom you will be naught but a liability, only to tell him what he already knows.\\n\\n \"This is no safe place, not for her to walk, nor for us to call out, nor to hold aloft lamps that she may see their light.\"\\n\\n \"This is the harem, isn\u0027t it?\" The name conjured images hopelessly romantic to Lydia\u0027s mind, but the room they entered-and indeed, all the rooms along this lightless slit-even unfurnished, seemed poky and cramped in the filtered rays from some other wing of the building. The walls were plain plaster, unpainted, dirty and mildewed. The divans were lumpy and far lower than Lydia had pictured from storybooks, about the thickness of a good mattress. The carpets were threadbare, smelling of mice and rotted perfume.\\n\\n \"I thought the palace hasn\u0027t been used since the fifties.\"\\n\\n \"Not as the Sultan\u0027s residence.\" The voice might almost have been the exhalation of dust from the carpets underfoot. \"It was the center of government until last July. But a part of the old seraglio is where he put women who belonged to his father or his grandfather, or girls who failed to please him. Here they dwell still, with their servants-fewer, but much as they used. In the heyday of this place they slept, four and five to a room, the ones who did not catch his fancy, seeing no one but the eunuchs and each other, seldom even seeing the sun.\"\\n\\n In the almost dark she saw him touch the wall in passing. \"They lived upon opium, many of them; opium and intrigue. The walls here sweat with their pettiness, their boredom, and their tears.\"\\n\\n His eyelids lowered and he tilted his head, listening. \"There,\" he whispered. He guided her with swift and weightless stride down a stair as steep as hell\u0027s abyss and so dark she couldn\u0027t see the steps thereof. Later on, safe in her own bed in Pera, Lydia wondered a little at her absolute trust in him, her willingness to step forward in utter darkness, propelled by his hand. Not, she thought, that Ysidro would have given her any choice.\\n\\n Margaret stood in the midst of a large chamber that once had a sunken pool in its center, now only an oval of shell-edged shadow. Marble lattices covered the windows on three sides; a divan circled the chamber, and slanting squares of light no bigger than tea sandwiches strewed the dirty and mouse-ravaged cushions. The whole room choked of mildew.\\n\\n She had no lamp in her hands now, as if she\u0027d set it down somewhere and left it forgotten. In the checkered glow from the windows her face was blank; behind the thick lenses of her spectacles, her eyes were those of a sleepwalker.\\n\\n She looked beautiful, as she had looked in her dreams.\\n\\n Lydia found herself alone in the tiled entryway looking at Ysidro as he turned Margaret\u0027s head gently, so that he could see the exposed-and unmarked-whiteness of her throat.\\n\\n \"Margharita,\" the vampire whispered. The girl startled like one waking.\\n\\n Then Margaret\u0027s breath drew in a hoarse gasp, and she flung herself on Ysidro, clutching him with desperate, grabby hands. The next second, past his shoulder, she saw Lydia, like some bespectacled, prosaic ghost with her train a cascade of lace over one kid-gloved arm, her shoulders draped in the faded web of an old silk shawl. Margaret backed quickly. \"I... are you all right?\" It wasn\u0027t to Lydia that she spoke.\\n\\n \"Indeed.\" The vampire inclined his head politely. \"Less so than I had been, had I not come back to this place to seek you, however. It were foolish of you to follow me, Margharita, for your reputation\u0027s sake alone, and your safety\u0027s. And mine, and Mistress Asher\u0027s, too, coming to find you here. Now let us return, ere our absence causes remark; and I warn you, do not come after me thus again.\" His voice never rose above its usual even key, nor did its tone change one whit from the polite phrases of his accustomed speech, but Lydia cringed inside as if at sarcasm or curses. Margaret\u0027s cheeks flushed dark and she looked away, and for a moment Lydia had the impression she would have fled, plunging into the unknown labyrinth of the deeper harem, had not Ysidro laid an imperative hand on her arm. Her voice trembled as she looked back at him with tear-filled blue eyes. \"I was only afraid...\"\\n\\n \"Afraid?\" He smiled his chilly smile, manufactured, Lydia guessed, to cover the remainder of his anger. Still, the impact of it was startling, the echo of an astringent charm that had been the living man\u0027s. \"That I should find peril here beyond my capacity, from which you could save me?\" No expression, no inflection; he had been dead, Lydia recalled, a long time. But still she guessed the smallest twinkle of banter, far back in the sulfur-crystal eyes.\\n\\n Margaret didn\u0027t. She only hung her head and snuffled, and suffered Ysidro to take her arm and lead her through the maze to the perilous cistern stair, and thence back along the terrace where the harem ladies had gone to their lord. As they passed through a vast court above a terrace and pool, where shuttered windows hovered tier upon tier above their heads, Lydia thought she saw the glow of a lamp left under one of the ramshackle stairways, and made to turn aside. \"Leave it,\" Ysidro said softly. \"It will only draw those we have little desire to meet.\"\\n\\n Lydia removed her spectacles again and folded the shawl inconspicuously in the cloakroom before reentenng the diplomat-crowded salon. She concentrated, through the remainder of the reception, on avoiding an encounter with the straight, graceful figure in the crimson uniform of the Hungarian Life Guards.\\n\\n \"You watch out for that Razumovsky, mind,\" Lady Clapham said to her as they were getting into the carriages. \"And watch that girl of yours.\"\\n\\n Startled, Lydia turned to regard Margaret, being helped by servants into the embassy coach. Soldiers clustered in the small square, torchlight throwing sharp flares on their rifles, for warning had come of sporadic fighting among the Armenians in Galata that might spread to Stamboul.\\n\\n \"I really don\u0027t think we need worry,\" she said. \"I happen to know her heart is... otherwise engaged.\" To someone, moreover, infinitely more dangerous than a Russian nobleman.\\n\\n \"I mean watch what she says.\" Her Ladyship drew Lydia a little farther back into the darkness of the gate. The shadows of the soldiers wavered drunkenly across the vine- grown brick wall opposite, behind which the silent domes of the Aya Sofia slept in the dark.\\n\\n \"And what you say. Razumovsky isn\u0027t a fool, and he knows perfectly well your husband didn\u0027t come to Constantinople to interview storytellers. That treaty the King signed won\u0027t cut much ice if the Czar sees a chance of getting a point ahead of us, either here or in India.\"\\n\\n Lydia sighed, reassured her hostess and shook her head inwardly as she took Sir Burnwell\u0027s hand to ascend to the coach. At least everyone in the world had cardiovascular systems and endocrine glands, and there wasn\u0027t any argument over those. For a moment she thought longingly of the Radcliffe Infirmary, where things were safe and in their places-was Pickering keeping proper graphs of the long- term weight gain of those subjects? She had no idea what she\u0027d tell the editors of the Journal of Internal Research about her article. I\u0027m sorry, I had to go to Constantinople to rescue my husband from vampires.\\n\\n But without Jamie...\\n\\n She shook her head. She would find him.\\n\\n She had to find him. \\n\\n","sourceLink":"https://allnovel.net/traveling-with-the-dead-james-asher-2/page-15.html","bookId":2490,"book":{"id":2490,"title":"Traveling with the Dead (James Asher #2)","description":"Storyline: Traveling with the Dead (James Asher #2) \\n Down through the deathless centuries, the vampires had drunk human blood for sustenance and for sport. They preyed where they willed, for no mortal humans could resist their unclean powers. But now came the ultimate perversion, the unthinkable: someone was conscripting the vampires into the secret services of a foreign power. \\n No government agency or bureaucrat could control the Undead. The idea was absurd, as Dr. James Asher knew all too well. \\n Years in His Majesty\u0027s service had taught Asher the finer points of espionage. And he knew the secrets of the vampires--a familiarity hard-won in unwilling service to Don Simon Ysidro, oldest and most subtle of the hunters of the London night. What Asher didn\u0027t know was why one of England\u0027s established vampires would risk everything to travel across the European continent at the behest of a ruthless spymaster. \\n But he could see the terrifying potential of such an unholy alliance...\\n","cover":"https://allnovel.net/images/traveling-with-the-dead-james-asher-2.jpg","author":"Barbara Hambly","type":"Horror","source":"allnovel","link":"https://allnovel.net/traveling-with-the-dead-james-asher-2.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:42:25 PM"}}
