{"id":77519,"no":25,"title":"Page 25","content":"‘I don’t like this!’ whispered Elinor. ‘Look at the pair of them. They’re talking to each other as if our matchstick-eating friend can come and go here as he likes!’\n ‘He probably knows they won’t hurt him because we’re bringing them the book!’ Meggie whispered back, never taking her eyes off the two men. The stranger had a couple of dogs with him. German shepherds. They were sniffing Dustfinger’s hands and nuzzling him in the ribs, wagging their tails.\n ‘See that?’ hissed Elinor. ‘Even those dogs treat him as an old friend. Suppose—’\n But before she could say any more Basta opened the driver’s door. ‘Get out, both of you,’ he ordered.\n Reluctantly, Elinor swung her legs out of the car. Meggie got out too and stood beside her. Her heart was thudding. She had never seen a man with a gun before. Well, on TV she had, but not in real life.\n ‘Look, I don’t like your tone!’ Elinor informed Basta. ‘We’ve had a strenuous drive, and we only came to this God-forsaken spot to bring your boss or whatever you call him something he’s been wanting for a long time. So let’s have a little more civility.’\n Basta cast her such a scornful glance that Elinor drew in a sharp breath, and Meggie involuntarily squeezed her hand.\n ‘Where did you pick her up?’ enquired Basta, turning back to Dustfinger, who was standing there looking as unmoved as if none of this had anything at all to do with him.\n ‘She owns that house – you know the one I mean.’ Dustfinger had lowered his voice. but Meggie heard him all the same. ‘I didn’t want to bring her, but she insisted.’\n ‘I can imagine that.’ Basta scrutinised Elinor once again, then turned to Meggie. ‘So this is Silvertongue’s little daughter? Doesn’t look much like him.’\n ‘Where’s my father?’ asked Meggie. ‘How is he?’ These were the first words she had managed to utter. Her voice was hoarse, as if she hadn’t used it for a long time.\n ‘Oh, he’s fine,’ replied Basta, glancing at Dustfinger. ‘Although he’s saying so little at the moment that Leaden-tongue would be more like it.’\n Meggie bit her lip. ‘We’ve come for him,’ she said. Now her voice was high and thin, although she was trying as hard as she could to sound grown-up. ‘We have the book, but we won’t give it to Capricorn unless he lets my father go.’\n Basta turned to Dustfinger again. ‘Something about her does remind me of her father after all. See her lips tighten? And that look! Oh yes, anyone can see they’re related.’ His voice sounded as if he were joking, but there was nothing funny about his face when he looked at Meggie again. It was thin, sharply angular, with close-set eyes. He narrowed them slightly as if he could see better that way. Basta was not a tall man, and his shoulders were almost as narrow as a boy’s, but Meggie held her breath when he took a step towards her. She was afraid of him. She had never been so afraid of anyone before, and it wasn’t because of the shotgun in his hand. He had an aura of fury about him, of something keen and biting—\n ‘Meggie, get the bag out of the boot.’ As Basta was about to grab Meggie, Elinor pushed herself between them. ‘There’s nothing dangerous in it,’ she said crossly. ‘Just what we came here to hand over.’\n By way of answer, Basta pulled the dogs aside, pulling so harshly on their leashes that they yelped out loud.\n ‘Meggie, listen to me!’ whispered Elinor, as they left the car and followed Basta down a steep pathway leading to the lighted windows. ‘Don’t hand over the book until they let us see your father, understand?’\n Meggie nodded, clutching the plastic bag firmly to her chest. How stupid did Elinor think she was? On the other hand, how was she going to hang on to the book if Basta decided to take it away from her? She preferred not to follow this line of thinking through to its conclusion.\n It was a hot, sultry night. The sky above the black hills was sprinkled with stars. The path down which Basta was leading them was stony, and so dark that Meggie could hardly see her own feet, but whenever she stumbled there was a hand to catch her. The hand belonged either to Elinor, walking beside her, or to Dustfinger, who was following as silently as if he were her shadow. Gwin was still in his rucksack, and Basta’s dogs kept raising their noses and sniffing, as if they had picked up the sharp scent of the marten.\n Slowly, they came closer to the lighted windows. Meggie saw old houses of grey, rough-hewn stone, with a pale church tower rising above the rooftops. Many of the houses looked empty as they passed, going down alleys so narrow that Meggie felt they could close in on her. Some of the houses had no roofs, others were little more than a couple of walls partly fallen in. It was dark in Capricorn’s village. Only a few lamps were on in the streets, hanging from masonry arches above the alleyways. At last they reached a small square. The church with the tower they had seen from a distance stood on one side of the square, and not far away, divided from it by a narrow passage, there was a large, two-storey house which did not look at all derelict. This square was better lit than the rest of the village, with four lanterns casting menacing shadows on the paving stones. Basta led them straight to the big house, where more light showed behind three windows on the upper floor. Was Mo in there? Meggie listened to herself as if she could find the answer there, but all her heart would tell her was a tale of fear. Fear and grief.\n 14\n A Mission Accomplished\n ‘The reason there’s no use looking,’ said Mr Beaver, ‘is that we know already where he’s gone!’ Everyone stared in amazement.\n ‘Don’t you understand?’ said Mr Beaver. ‘He’s gone to her, to the White Witch. He has betrayed us all.’\n C.S. Lewis,\n The Lion, the Witch and the Wardrobe\n Hundreds of times since Dustfinger had first told her about him, Meggie had tried to picture Capricorn’s face. She’d thought about it on the way to Elinor’s house when Mo was sitting beside her in the van, and in the huge bed there, and finally on the drive here. Hundreds of times? No, she had tried to imagine it thousands of times, drawing on her ideas of all the villains she had ever read about in books: Captain Hook, crooked-nosed and thin; Long John Silver, a false smile always on his lips; Injun Joe, who had haunted so many of her bad dreams with his knife and his greasy black hair … But Capricorn looked quite different. Meggie soon gave up counting the doors they passed before Basta finally stopped outside one. But she did count the black-clad men. Four of them were standing in the corridors, looking bored. Each man had a shotgun propped against the whitewashed wall beside him. Dustfinger had been right: in their close-fitting black suits they really did look like rooks. Only Basta wore a snow-white shirt, just as Dustfinger had said, with a red flower in the buttonhole of his jacket, a red flower like a warning.\n Capricorn’s dressing gown was red too. He was seated in an armchair when Basta entered the room with the three new arrivals, and a woman was kneeling in front of him cutting his toenails. The chair seemed too small for him. Capricorn was a tall man, and gaunt, as if the skin had been stretched too tight over his bones. His skin was pale as parchment, his hair cut short and bristly. Meggie couldn’t have said if it was grey or very fair. \n","sourceLink":"https://allnovel.net/inkheart-inkworld-1/page-25.html","bookId":2719,"book":{"id":2719,"title":"Inkheart (Inkworld #1)","description":"Storyline: \n Twelve-year-old Meggie learns that her father, who repairs and binds books for a living, can \"read\" fictional characters to life when one of those characters abducts them and tries to force him into service. \n Characters from books literally leap off the page in this engrossing fantasy. Meggie has had her father to herself since her mother went away when she was young. Mo taught her to read when she was five, and the two share a mutual love of books. He can \"read\" characters out of books. When she was three, he read aloud from a book called Inkheart and released characters into the real world. At the same time, Meggie\u0027s mother disappeared into the story. This \"story within a story\" will delight not just fantasy fans, but all readers who like an exciting plot with larger-than-life characters.\n \n","cover":"https://allnovel.net/images/inkheart-inkworld-1.jpg","author":"Cornelia Funke","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/inkheart-inkworld-1.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 3:34:42 PM"}}
