{"id":77534,"no":40,"title":"Page 40","content":"Meggie scratched an ‘E’ in the wall. ‘It doesn’t make any difference,’ she said, stepping back. The Gs in her name looked like nibbled Os. ‘You probably couldn’t have read her back out of it again anyway.’ ‘No, probably not,’ murmured Mo, and went on staring at the ceiling. ‘It’s not your fault,’ said Meggie. She wanted to add: the main thing is you’re with me. The main thing is for Basta never to put his knife to your throat again. I mean, I hardly remember my mother. I only know her from a couple of photographs. But Meggie said none of that, for she knew it wouldn’t comfort Mo, it would probably just make him sadder than ever. For the first time, Meggie had some idea of how much he missed her mother. And for one crazy moment she felt jealous. She scratched an ‘I’ in the plaster – that was an easy letter – then she lowered the key. Footsteps were approaching outside. Elinor put her hand to her mouth when they stopped. Basta pushed open the door, and there was someone behind him. Meggie recognised the old woman she had seen in Capricorn’s house. With a dour expression on her face, she pushed past Basta and put a mug and a thermos jug on the floor. ‘As if I didn’t have enough to do!’ she muttered, before going out again. ‘So now we have to feed up our fine guests too! They might at least be put to work if you have to keep them here.’ ‘Tell that to Capricorn,’ was all Basta replied. Then he drew his knife, smiled at Elinor, and wiped the blade on his jacket. It was getting dark outside, and his snow-white shirt shone in the gathering twilight. ‘Enjoy your tea, Silvertongue,’ he said, relishing the discomfort on Elinor’s face. ‘Mortola’s put so much honey in the jug your mouth will probably stick up with the first sip you take, but your throat will be as good as new tomorrow.’ ‘What have you done with the boy?’ asked Mo. ‘Oh, I think he’s next door to you. Capricorn hasn’t decided what’s to become of him yet. Cockerell will try him out with a little ordeal by fire tomorrow, then we’ll know if he’s any use to us.’ Mo sat up. ‘Ordeal by fire?’ he asked, his voice both bitter and mocking. ‘Well, you can’t have passed that one yourself. You’re even afraid of Dustfinger’s matches.’ ‘Watch your tongue!’ Basta hissed at him. ‘One more word and I’ll cut it out, however precious it may be.’ ‘Oh no, you won’t,’ said Mo, standing up. He took his time over filling the mug with steaming tea. ‘Maybe not.’ Basta lowered his voice, as if afraid of being overheard. ‘But your little daughter has a tongue too, and hers isn’t as valuable as yours.’ Mo flung the mug of hot tea at him, but Basta closed the door so quickly that the mug smashed into the wood. ‘Sweet dreams!’ he called from outside as he shot the bolts. ‘See you in the morning.’ None of them said a word when he was gone, not for a long, long time. ‘Mo, tell me a story,’ Meggie whispered at last. ‘What story do you want to hear?’ he asked, putting his arm round her shoulders. ‘Tell me the one about us being in Egypt,’ she whispered, ‘and we’re looking for treasure and surviving sandstorms and scorpions and all the scary ghosts rising from their tombs to watch over their precious grave goods.’ ‘Oh, that story,’ said Mo. ‘Didn’t I make it up for your eighth birthday? It’s rather a gloomy tale, as far as I remember.’ ‘Yes, very!’ said Meggie. ‘But it has a happy ending. Everything turns out all right, and we come home laden with treasure.’ ‘I wouldn’t mind hearing that one myself,’ said Elinor, her voice unsteady. She was probably still thinking of Basta’s knife. So Mo began to tell his story, without the rustle of pages, without the endless labyrinth of letters. ‘Mo, nothing ever came out of a story you were just telling, did it?’ asked Meggie at one point, suddenly feeling anxious. ‘No,’ he said. ‘For that to happen, it seems that printer’s ink is necessary and someone else needs to have made up the story.’ Then he continued, and Meggie and Elinor listened until his voice had carried them far, far away. Finally, they went to sleep. A sound woke them all. Someone was fiddling with the lock of the door. Meggie thought she heard a muffled curse. ‘Oh no!’ breathed Elinor. She was the first on her feet. ‘They’re coming to take me away! That old woman’s persuaded them! Why feed us up? You, maybe,’ she said, looking frantically at Mo, ‘but why me?’ ‘Go over to the wall, Elinor,’ said Mo as he moved Meggie behind him. ‘Both of you keep well back from the door.’ The lock sprang open with a muffled little click, and the door was pushed just far enough open for someone to squeeze through it. Dustfinger. He cast a last anxious glance outside, then pulled the door shut behind him and leaned against it. ‘So I hear you’ve done it again, Silvertongue!’ he said, lowering his voice. ‘They say the poor boy still hasn’t uttered a sound. I don’t blame him. I can tell you, it’s a horrible feeling suddenly landing in someone else’s story.’ ‘What are you doing here?’ snapped Elinor. But the sight of Dustfinger had actually filled her with relief. ‘Leave him alone, Elinor,’ said Mo, moving her aside and going over to Dustfinger. ‘How are your hands?’ he asked. Dustfinger shrugged. ‘They put cold water on them in the kitchen, but the skin’s still almost as red as the flames that licked at it.’ ‘Ask him what he wants!’ hissed Elinor. ‘And if he’s just come to tell us he can’t do anything about the mess we’re in, then you might as well wring his lying neck!’ By way of answer, Dustfinger tossed her a bunch of keys. ‘Why do you think I’m here?’ he grumbled back, switching off the light. ‘Stealing the car keys from Basta wasn’t easy, and a word of thanks might not be out of place, but we can think about that later. We don’t want to hang about any longer – let’s get out of here.’ Cautiously, he opened the door and listened. ‘There’s a sentry posted up on the church tower,’ he whispered, ‘but the guards are keeping watch on the hills, not the village. The dogs are in their kennels, and even if we do have to deal with them, luckily they like me better than Basta.’ ‘Why should we suddenly trust him?’ whispered Elinor to Mo. ‘Suppose there’s some other devilry behind this?’ ‘I want you to take me with you. That’s my only motive!’ snapped Dustfinger. ‘There’s nothing here for me any more. Capricorn’s let me down. He’s sent the only scrap of hope I still had up in smoke! He thinks he can do what he likes with me. Dustfinger’s only a dog you can kick without fearing he may bite back, but he’s wrong there. He burned the book, so I’m taking away the reader I brought him. And as for you,’ he said, jabbing his burnt finger into Elinor’s chest, ‘you can come because you have a car. No one gets out of this village on foot, not even Capricorn’s men, not with the snakes that infest these hills. But I can’t drive, and so …’","sourceLink":"https://allnovel.net/inkheart-inkworld-1/page-40.html","bookId":2719,"book":{"id":2719,"title":"Inkheart (Inkworld #1)","description":"Storyline: Twelve-year-old Meggie learns that her father, who repairs and binds books for a living, can \"read\" fictional characters to life when one of those characters abducts them and tries to force him into service. Characters from books literally leap off the page in this engrossing fantasy. Meggie has had her father to herself since her mother went away when she was young. Mo taught her to read when she was five, and the two share a mutual love of books. He can \"read\" characters out of books. When she was three, he read aloud from a book called Inkheart and released characters into the real world. At the same time, Meggie\u0027s mother disappeared into the story. This \"story within a story\" will delight not just fantasy fans, but all readers who like an exciting plot with larger-than-life characters.","cover":"https://allnovel.net/images/inkheart-inkworld-1.jpg","author":"Cornelia Funke","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/inkheart-inkworld-1.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 3:34:42 PM"}}
