{"id":77536,"no":42,"title":"Page 42","content":"‘Come on, Elinor!’ whispered Mo. It seemed to be taking her forever to unlock the car door.\n ‘All right, all right!’ she growled back. ‘I just don’t have such nimble hands as our light-fingered friend.’\n Mo put his arm round Meggie’s shoulders as he looked around, but apart from a few stray cats he could see nothing moving in the car park or among the houses. Reassured, he made Meggie get into the back seat. The boy hesitated for a moment, examining the car as if it were some strange animal and he couldn’t be sure whether it was kindly disposed or would swallow him alive, but finally he got in too. Meggie scowled at him and moved as far away from him as possible. Her knee still hurt.\n ‘Where’s the matchstick-eater?’ whispered Elinor. ‘Dammit, don’t tell me the man’s disappeared again.’\n Meggie was the first to spot him. He was stealing over to the other cars. Elinor clutched the steering-wheel as if resisting only with difficulty the temptation to drive off without him. ‘What’s he up to this time?’ she hissed.\n None of them knew the answer. Dustfinger was gone for an excruciatingly long time, and when he came back he was closing a flick-knife.\n ‘What was the idea of that?’ Elinor snapped, when he squeezed into the back seat next to the boy. ‘Didn’t you say we must hurry? And what were you doing with that knife? Not cutting someone open, I hope!’\n ‘Is my name Basta?’ enquired Dustfinger, annoyed, as he forced his legs in behind the driver’s seat. ‘I was slitting their tyres, that’s all. Just to be on the safe side.’ He was still holding the knife.\n Meggie looked at it uneasily. ‘That’s Basta’s knife,’ she said.\n Dustfinger smiled as he put it in his trouser pocket. ‘Not any more. I’d like to have stolen his silly amulet too, but he wears it round his neck even at night, and that would have been too dangerous.’\n Somewhere a dog began to bark. Mo wound down his window and put his head out, looking concerned.\n ‘Believe it or not, it’s only toads making all that racket,’ said Elinor. But what Meggie suddenly heard echoing through the night was nothing like the croaking of toads, and when she looked in alarm through the back window a man was climbing out of one of the parked vehicles, a dusty, dirty white delivery van. It was one of Capricorn’s men. Meggie had seen him in the church. He looked around him with a face still dazed by sleep.\n Before Meggie could stop her, Elinor started the engine, and the man snatched a shotgun from his back and stumbled towards the car. For a moment Meggie almost felt sorry for him – he looked so sleepy and baffled. What would Capricorn do to a guard who fell asleep on duty? But then he aimed the gun and fired it. Meggie ducked her head well below the back of the seat, and Elinor pressed her foot down hard on the accelerator.\n ‘Damn it all!’ she shouted at Dustfinger. ‘Didn’t you see that man when you were slinking about among the cars?’\n ‘No, I didn’t!’ Dustfinger shouted back. ‘Now, drive! Not that way! It’s over there. We must get to the road!’\n Elinor wrenched the steering-wheel around. The boy was huddled down beside Meggie. At every shot he had closed his eyes tight and put his hands over his ears. Were there any guns in his story? Probably not, any more than there were cars. His and Meggie’s heads knocked together as Elinor’s car bumped over the stony track. When it finally reached the road things weren’t much better.\n ‘This isn’t the road we came along!’ cried Elinor. Capricorn’s village loomed over them like a fortress. The houses simply refused to get any smaller.\n ‘Oh yes, it is! But Basta met us further down when we arrived.’ Dustfinger was clinging to the seat with one hand and to his rucksack with the other. A furious chattering came from the bag, and the boy cast it a terrified glance.\n Meggie thought she recognised the place where Basta had met them when they drove past it – it was the hill from which she had seen the village for the first time. Then the houses suddenly disappeared, engulfed by the night, as if Capricorn’s village had never existed.\n There was no guard posted on the bridge, nor at the rusty barrier across the road cutting off the way to the village. Meggie looked back at it until the darkness had swallowed it up. It’s over, she thought. It really is all over.\n The night was clear. Meggie had never seen so many stars. The sky stretched above the black hills like a cloth embroidered with tiny beads. The whole world seemed to consist of hills, like a cat arching its back at the face of the night – no human beings, no houses. No fear.\n Mo turned round and stroked the hair back from Meggie’s forehead. ‘Everything all right?’ he asked.\n She nodded and closed her eyes. Suddenly, all Meggie wanted to do was sleep – if only the pounding of her heart would let her.\n ‘It’s a dream,’ murmured a toneless voice beside her. ‘Only a dream. It’s just a dream. What else can it be?’\n Meggie turned to the boy, who wasn’t looking at her. ‘It has to be a dream!’ he repeated, nodding vigorously as if to encourage himself. ‘Everything looks wrong, false, weird, like in dreams, and now,’ he murmured, turning his head to indicate the surroundings outside, ‘now we’re flying. Or the night is flying past us. Or something.’\n Meggie could almost have smiled. She wanted to tell him it wasn’t a dream, but she was just too tired to explain the whole complicated story. She looked at Dustfinger. He was patting the fabric of his rucksack, probably trying to soothe his angry marten.\n ‘Don’t look at me like that!’ he said when he saw Meggie watching him. ‘You can’t expect me to explain. Your father will have to do that. After all, the poor lad’s nightmare is his fault.’\n Mo’s guilty conscience showed clearly on his face when he turned to the boy. ‘What’s your name?’ he asked. ‘It wasn’t in the—’ But there he broke off.\n The boy looked at him suspiciously, then bowed his head. ‘Farid,’ he said dully. ‘My name is Farid, but I believe it’s unlucky to speak in a dream. You never find your way back if you do.’ He shut his mouth tightly and stared straight ahead, as if to avoid looking at anyone, and said no more. Did he have a mother and father in his story? Meggie couldn’t remember. It had just mentioned a boy, a boy without a name who served a band of thieves.\n ‘It’s a dream,’ he whispered again. ‘Only a dream. The sun will rise and it will all disappear. That’s what it’ll do.’\n Mo looked at him, unhappy and at a loss, like someone who has handled a young bird, knowing it can never return to the nest. Poor Mo, thought Meggie. Poor Farid. But she was thinking of something else too, and she was ashamed of herself for it. Ever since she had seen the lizard crawl out of the golden coins in Capricorn’s church she couldn’t help thinking about it. I wish I could do that, her thoughts had kept saying to her, very quietly. The wish had settled like a cuckoo in the nest of her heart, where it kept fluffing up its plumage and making itself at home, no matter how hard she tried to throw it out. I wish I could do that, it whispered. I’d like to bring them out of books, touch them, all those characters, all those wonderful characters. I want them to come out of the pages and sit beside me, I want them to smile at me, I want, I want, I want … \n","sourceLink":"https://allnovel.net/inkheart-inkworld-1/page-42.html","bookId":2719,"book":{"id":2719,"title":"Inkheart (Inkworld #1)","description":"Storyline: \n Twelve-year-old Meggie learns that her father, who repairs and binds books for a living, can \"read\" fictional characters to life when one of those characters abducts them and tries to force him into service. \n Characters from books literally leap off the page in this engrossing fantasy. Meggie has had her father to herself since her mother went away when she was young. Mo taught her to read when she was five, and the two share a mutual love of books. He can \"read\" characters out of books. When she was three, he read aloud from a book called Inkheart and released characters into the real world. At the same time, Meggie\u0027s mother disappeared into the story. This \"story within a story\" will delight not just fantasy fans, but all readers who like an exciting plot with larger-than-life characters.\n \n","cover":"https://allnovel.net/images/inkheart-inkworld-1.jpg","author":"Cornelia Funke","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/inkheart-inkworld-1.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 3:34:42 PM"}}
