{"id":64121,"no":27,"title":"Page 27","content":"He put a hand on my shoulder, licking his lips nervously. “Can I help you with anything?” he asked in a low voice.\\n\\n I just shook my head, still looking at him. I didn’t remove his hand, didn’t think of it. My mind wasn’t working right. I knew that James wasn’t touching me, but all I could think about were his hands on me.\\n\\n So while I knew that it was Damien’s hand on me, it felt almost as if James was touching me. And besides, it was only my shoulder he was touching. But I was in a state.\\n\\n “Kindly remove that hand, Damien. Shouldn’t you be flying the plane or something?” James asked, stepping into the galley. His voice was cold as ice. I didn’t have to look at his eyes to know that they would be the same.\\n\\n Damien pulled his hand back, eyes wide, looking as though he’d been doing something much worse than just touching my shoulder. He mumbled an agreement, backing off and going into the lavatory.\\n\\n I felt more than saw James moving to me. He plucked my vest from where it hung on an open cabinet, holding it out for me to slip into. I did so without a word, not looking at him.\\n\\n “What was that, Bianca? Do you want him? Explain it to me.” His voice was still so cold. I was intimated and…embarrassed.\\n\\n “I-I don’t want him. I think he was just caught off-guard. And I…I was just distracted, thinking about you. I know he was standing right in front of me, but I couldn’t seem to focus on him.”\\n\\n James gripped my hair at the nape, the only place he touched me, pulling my head back to look up and squarely into his eyes. They were more shuttered than I would have guessed. Whatever he was feeling, I couldn’t have guessed it from his face.\\n\\n “I told you this wasn’t a punishment, Bianca, but it is now.” He pulled my hair hard enough to make me gasp. His voice was strangely blank. “It will be better or worse, depending on your answer. Were you trying to make me jealous by letting him touch you, or are you drawn to him? Do you want him, just a little?”\\n\\n I mulled it over, wanting to give him the most honest answer, dreading the punishment, when it was this overwhelming depravation. “I was too involved with my own thoughts to react to what he was doing. I think I would have reacted, would have pulled away, if he had touched more than my shoulder, but he didn’t, so I didn’t. I just don’t think of him like that.”\\n\\n I was relishing his hands on me, even with this limited contact, as I continued breathlessly. “He doesn’t feel like a threat, and I’ve never even thought about having sex with him. I couldn’t tell you why. I can see that he’s good looking, and I value him as a friend. He’s funny, and charming, and nice, but I’ve only ever had platonic feelings. Perhaps it’s something like how you feel about Frankie. For all I know, he’s another submissive. That may be why I could only see him as a friend.”\\n\\n He studied me for the longest time, his eyes still shuddered, but if I had to guess, I would say that he was feeling hurt and worried.\\n\\n “I like your answer,” he finally said. “I can’t tell if I believe it because I want so desperately to, or because it’s the truth. You’ll still be punished, but I won’t draw it out like I was planning to when I saw his hand on you. Don’t let it happen again.” With that, he walked away.\\n\\n The rest of the flight was long and James wouldn’t so much as spare me a glance. When he deprived me, he deprived me of everything, even his beautiful eyes, and that intense regard that I had come to adore and depend on so helplessly. I hadn’t realized how much I craved even his stare, how it made me feel less empty, less cold. He was the sun, and when he turned away, I felt so cold and empty, so achy and wanting.\\n\\n I hadn’t realized it before. Is that why I was getting this lesson? Had he known the extent of his affect on me, and known how to show me just how much I needed him to want me, needed him to show me.\\n\\n The depravation of his physical affection affected me first, but I thought that the emotional withdrawal from him was by far more devastating. And I wouldn’t have realized it, wouldn’t have realized how generously he had always tended to my emotional needs, until he had set my body on fire and withdrawn from me completely. It was a revelation.\\n\\n He was a generous man. I had never doubted it. But I had never given him credit for being so generous with his emotions and feelings. They were things I never would have realized I needed so desperately until he’d lavished me with them, and then suddenly taken them away. How long would I feel the loss?\\n\\n How long would he put me through purgatory? It had only been hours so far that he had left me wanting, but I didn’t know that I could bear much more of it.\\n\\n I wanted to bask in the sun again.\\n\\n CHAPTER TWENTY-FIVE\\n\\n “We’re going directly to my house,” James told me as he walked with my crew through the airport.\\n\\n He wasn’t touching me, but pulled my bag. He would barely look at me, though his tone and posture seemed relaxed.\\n\\n I had gone past the point of only wanting him to make me come, to ease the ache that traveled from my tortured nipples and directly to my sex. Now I wanted his affection, his attention. I wanted him to hold me. It made me almost angry, that he would make me so needy with so little effort on his part. But even anger didn’t change the wanting.\\n\\n It took me a moment to process his words. We were trailing behind my crew. Melissa cast me sharp glances, as though we were slowing them down. I ignored her. It seemed the best way to deal with her in general.\\n\\n “I could get into trouble for that,” I told him, my voice pitched low. “We’re supposed to ride with the crew to the hotel, and check in there.”\\n\\n “I spoke to Stephan. He looked it up in the manual. The exact wording is, ‘at the discretion of your lead’. Stephan is your lead. He gave you the thumbs up. You’re coming with me.”\\n\\n I didn’t argue, didn’t respond. I wanted to get to his house. I didn’t know what he had planned, but I was sure that the sooner we got there, the sooner this torture would end.\\n\\n I waved goodbye to most of the crew at the curb, only giving Stephan a quick hug and kiss.\\n\\n “Call me if you need anything, Buttercup,” he said into my ear, then let me go.\\n\\n I scooted in close against James, nearly touching hips when we got into his town car.\\n\\n I spoke into his ear, since the privacy screen was down and I didn’t recognize the driver. “This is more than delayed gratification. You’re depriving me of every part of you. You’ll barely look at me.”\\n\\n “Not in the car,” he said, looking out the window and dismissing me.\\n\\n I felt stung.\\n\\n “What is the punishment for touching you?” I asked him after several minutes of complete silence. I was past the point of only wanting to please him. If it was a punishment I could stand, I was willing to risk his displeasure. He had brought me to that point.\\n\\n “A simple one. If you touch me, I won’t touch you,” he said, his tone idle.\\n\\n It was like a slap in the face. I averted my face, tears stinging my eyes. It felt like a rejection, something I’d never experienced even a hint of from James.\\n\\n It was a long and silent drive into Manhattan. The clamps on my nipples were a constant ache. I had resorted to trying to hold perfectly still, since every movement further agitated the sensual torture.\\n\\n I wanted to say mean things to him, hurtful things that might goad him into touching me, but I refrained. I didn’t want to cause him to stay this withdrawn from me. I knew that the more I cooperated, the sooner I would get my James back.\\n\\n Finally, the unfamiliar driver dropped us off in the underground garage I’d been in once before, on my first visit to James’s Manhattan penthouse.\\n\\n He took my suitcase out of the trunk, inclining his head at us. “Sir, Ms. Karlsson. I’ll be here at 9:00 p.m to pick you up for the charity event.”\\n\\n James just nodded, dismissing the man. He pulled my suitcase to the elevator, still barely acknowledging my presence.\\n\\n I lowered my chin, my posture rigid, standing very still in my work heels. My gaze seemed glued to his navy dress shoes. They were sexy. I thought sullenly that even his feet held a sort of elegance.\\n\\n The elevator car arrived, the door sliding open silently. James stepped inside.\\n\\n I hesitated, still just watching his feet, wanting some sign from him that he even remembered my presence.\\n\\n He sighed, the softest sound, and reached a hand to me. I watched, transfixed, as his hand went to the collar of my work shirt. He used one finger to fish out the hoop at my throat. He managed not to touch even an inch of my skin, pulling me forward by just that diamond-studded circle. He led me into the car, keeping his finger crooked into my collar as he slid in his card, pushed the button, and we began to ascend.\\n\\n “My perfect little submissive,” he murmured, and that was all. I sopped up even that little bit of his jaded attention.\\n\\n He led me into his opulent home by that one finger on my collar. I was as lost in the maze of rooms as I had been the first time, as he led me to the kitchen. He only let go of the collar when we encountered an unfamiliar woman prepping food next to the oversized stovetop. She was plump and middle-aged, with light brown hair and kind brown eyes that I noticed the moment she turned to greet us.\\n\\n She smiled. It was a good smile, warm and sweet. “Mr. Cavendish, Ms. Karlsson, good morning. How was your flight?”\\n\\n “Very good, thank you. Bianca, this is Marion. She’s our new housekeeper and cook.”\\n\\n I blinked my eyes a few times, wondering if I was seeing things when she bobbed us a little curtsy. “I’m looking forward to working for you, Ms. Karlsson. It’s nice to finally meet you. Please let me know if you need anything. Anything at all.”\\n\\n I processed their words, the way they both implied that she was somehow working for me. It was a baffling development, but I didn’t comment.\\n\\n “I’m making you vegetable omelets with feta, as you requested, Mr. Cavendish. Is there anything I can do for you?”\\n\\n “We will be in the dining room, Marion. Just serve the omelets when they’re ready. That will be all.”\\n\\n James held the door open for me, and I moved into his grand dining room. He pulled a chair out for me and I sat. He took the seat next to me at the head of the table. He stapled his elegant fingers together on top of the heavy table.\\n\\n I watched those hands as I spoke. “What happened to the other housekeeper?”\\n\\n “I had to let her go. She proved to be…unprofessional. She seemed to think that, because she had worked for me for eight years, she could interfere in my personal life. I found some of her actions and words unacceptable.”\\n\\n I mulled that over for awhile, still watching his hands. Even those hands were like eye candy.\\n\\n “She seemed like an unpleasant woman, though she and Jules appeared to be close,” I said absently.\\n\\n “She was pleasant enough to her.”\\n\\n I watched his hands squeeze together very tightly as I spoke. “Yes. And that was the problem. She let her into my home against my wishes, and then she made the fatal mistake of insulting you, Love. I fired her that night.”\\n\\n I took a deep breath, savoring that light endearment. I was starved for his affection. \\n\\n","sourceLink":"https://allnovel.net/mile-high-up-in-the-air-2/page-27.html","bookId":1927,"book":{"id":1927,"title":"Mile High (Up in the Air #2)","description":"Storyline: Mile High (Up in the Air #2) \\n James and Bianca’s tumultuous story continues in the sequel to In Flight. \\n James has initiated Bianca into a dark and drugging world of passion and pain. He taught her about her own submissive, masochistic nature, and she fell swiftly and deeply in love with the undeniably charming and impossibly beautiful Mr. Cavendish, but a painful misunderstanding and the return of the brutally violent demon of her past have combined to overwhelm Bianca, and, confused and hurt, she pushes him away. \\n It’s been over a month since the shocking attack that hospitalized her, and since she told a distraught James that she needed space, but her feelings haven’t gone away. Even she knew that it was only a matter of time before he would cast his spell on her again…\\n","cover":"https://allnovel.net/images/mile-high-up-in-the-air-2.jpg","author":"R.K. Lilley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/mile-high-up-in-the-air-2.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:52:59 AM"}}
