{"id":64130,"no":36,"title":"Page 36","content":"I blinked at her, trying hard to find another meaning to her words. “Excuse me?” I asked her.\\n\\n I couldn’t mistake how she rubbed against me. “There’s nothing he loves more than dominating two women at once. Hasn’t he mentioned that to you yet? I loved it when he brought other women into the playground with us. And, of course, as his favorite, he brings me back in to play with his new subs.”\\n\\n A wave of nausea hit me, and my fists clenched. I did not want these women to know how they’d affected me, but it was already a struggle, and I knew they weren’t finished.\\n\\n Jolene lowered the sleeveless top of her dress, exposing the perfectly proportioned, overly generous globes of her breasts. I noticed the large silver hoops pierced into her dark red nipples immediately.\\n\\n Her sinfully full lips curved into a sensuous smile. “He only gives these to his favorites. Didn’t you know?\\n\\n Jules shocked me by pressing hard against me from behind and grabbing my wrists in a hard grip. It didn’t even occur to me to struggle at first. A physical threat from these women was the last thing I had expected.\\n\\n Even as Jules moved, Jolene was reaching her arms up around my neck and pressing her soft figure against me. Her petite, small-framed body was much stronger than I could have imagined as she pulled my head down to hers.\\n\\n “Just a taste, Bianca,” she whispered, just before she crushed her soft mouth to mine. I registered that it felt beyond strange to be kissed by such a soft, moist mouth as she moved her lips against mine. I was frozen in shock at the unexpected assault until she thrust her little tongue into my mouth. I began to struggle against the two women holding me in earnest, then. I bit Jolene’s tongue hard enough to make her pull back with a curse.\\n\\n She looked absolutely shocked at my rejection as she stepped away from me, her hand to her mouth.\\n\\n Jules released me at almost the same moment, moving in front of me to join a red-faced Jolene. Jolene’s eyes made a surprisingly quick transformation from shocked to hard and mean as I watched the sensually lovely woman.\\n\\n She pointed a finger at me. “You’re making a mistake, you know. You can’t hope to hold his interest unless you’re willing to be more open-minded. He’s completely insatiable. He needs variety, and if you can’t provide it, he’ll be done with you in a week.” As she spoke, Jules was adjusting Jolene’s top back over her breasts. Her touch on the other woman spoke of familiarity.\\n\\n I glared at both of them. “That’s not happening. If James wants other women, he’s free to have them.\\n\\n I’ll leave him so fast his head will spin. And if you two like women so much, you can have each other.\\n\\n Why even bother with James?”\\n\\n Jolene’s expression didn’t change at all. “You won’t be able to let him go so easily. And he’s impossible to forget. Mark my words, you’ll change your mind about wanting me. I’ll be waiting.” As she spoke, the two women linked their fingers together, a clear sign of their solidarity.\\n\\n Jules gave me a very ‘cat that ate the canary’ smile as they sauntered out of the bathroom. They walked out slowly, as though they hadn’t assaulted me just moments before.\\n\\n I just stood there, staring at the closed door for long moments, completely stunned by the whole deranged exchange. In spite of my resolve not to let Jules cause us problems, the things I had been told had shaken my faith in James, and in our ability to have any kind of a stable relationship. I turned from the closed door to look in the mirror. The sight that met my eyes made me angry. My mouth was smeared with Jolene’s crimson lipstick, and my eyes were wide and scared. I dragged the back of my hand across my mouth, wiping away the offending color.\\n\\n I had forgotten about the bathroom attendant completely. I only recalled her presence as she kindly offered me a towel. I thanked her gratefully, wiping at the red on my lips, trying to erase every trace. It clung to my mouth stubbornly. I hated the color.\\n\\n The bathroom door burst open and a furious James tore inside as though he’d hit it at a dead sprint. He took me in with wild eyes, searching the bathroom as he moved towards me.\\n\\n A drop-dead gorgeous woman hurried in the door behind him. She had streaky blond hair worn down her back in whimsical mermaid waves. She wore a soft gray sheath gown that managed to be both elegant and sexy. It covered her from neck to ankle but did nothing to disguise her spectacular, supermodel figure.\\n\\n I couldn’t spare her much of a glance as James reached me swiftly, cupping a hand at the back of my head, his other hand tilting my chin up to study me.\\n\\n “What happened?” he asked.\\n\\n My hand grabbed his where it held my chin, and his eyes flew to the back of my hand. It was covered in crimson lipstick smears.\\n\\n His eyes moved from my hand to my mouth and back again. “What happened?” he repeated, his tone harsh.\\n\\n “Can’t you guess? Your Exes got their hands on me. The short one doesn’t understand the word no very well,” I told him. My voice came out more coldly than I meant for it to.\\n\\n His hand tightened to a nearly painful grip on my chin. His voice got very quiet, but I heard the panic in it. “They assaulted you?”\\n\\n “Jules held my wrists while Jolene took her top off and forced me to kiss her. Yeah, I guess you could say they assaulted me. They seem to have some sort of routine down for pressuring your women into trying threesomes.” I made my face and voice as expressionless as I could manage. I wanted to see his response and I watched him carefully for it.\\n\\n He cringed, an awful kind of rawness overtaking his face. He pulled me into his chest. “I’m sorry. I should have done a better job of protecting you. I swear I’ll take the necessary steps to make sure nothing like that ever happens again. I just never dreamed they would do something like confront you in a bathroom. And I never imagined they would put their hands on you.”\\n\\n I should have realized that he’d blame himself for it all. I still felt angry and bitter about the entire thing, but even in spite of that, I felt myself wanting to soften towards him.\\n\\n “Bianca, this is Lana. She’s an old friend of mine.” James made the introduction while still holding my face buried in his chest. “She happened in on you being harassed in the bathroom and was kind enough to come get me.”\\n\\n I turned to meet the woman, not missing the clear affection I heard in his voice as he said the woman’s name.\\n\\n The woman was even more stunning than I had realized, as I caught my second glance at her, this time closer up. She gave me a friendly, if very careful, smile. She had the face of a fairytale princess, with eyes so bright a blue they were violet. I wondered if they could have been her real eye color. I had never met anyone with purple eyes before.\\n\\n Her wavy blond hair had every shade of blonde streaked through it as it flowed down her back and around her shoulders like a whimsical cape. Her face was stunning, her features perfectly symmetrical, her eyes big and thickly lashed, her nose tiny and pert, her soft, pouty mouth damn near as pretty as James’s.\\n\\n She stood at eye level with me, which meant she was somewhere between five nine and six feet tall, though I couldn’t say for sure without a good look at the size of her heels. As I studied her, I realized that somehow I recognized this exquisite woman, though I hadn’t a clue how. She was not the type of woman anyone could forget meeting.\\n\\n She saw my brow furrow as I studied her. She seemed to read my thoughts, and grimaced. “You recognize me,” she said with a sigh. Her voice was soft and musical. She shot James an arch look.\\n\\n “James, you’re in the ladies restroom, as you seem to have forgotten. Go wait outside. I’ll help your Bianca freshen up so you two can make your escape. I’ll even make your excuses for you, but you need to get out of this bathroom before you create a scene. Anyone could come in here at any moment.”\\n\\n James kissed the top of my head before heading to the door. He cast me a worried glance but spoke to Lana. “Don’t be long,” he warned.\\n\\n She held out a chair in front of a vanity for me. “Sit down, hon,” she said. I complied, responding automatically to the kindness in her voice. She couldn’t have been more than twenty-six, but she had an almost maternal countenance, in spite of her bombshell looks.\\n\\n I studied her in the mirror, but still couldn’t place her. “What do I know you from?” I asked her finally.\\n\\n She had a huge, if fashionable, handbag, splayed out on the counter, and was digging through it determinedly.\\n\\n She cast me a wry smile. “I had a dismally short stint in modeling a few years ago. I wasn’t suited for it at all, but people occasionally recognize me from some high profile covers I did. I only ever even got the covers because my mother was a supermodel from the eighties.”\\n\\n As she spoke I conjured up a memory of her in a tiny yellow bikini, straddling a surfboard for a very famous cover of Sports Illustrated. My jaw dropped. “You were a supermodel yourself. You don’t model anymore?”\\n\\n She shrugged, her smile turning very self-deprecating. “It’s a fact that I’m much better at working for the family business than I ever was at smiling for the camera.”\\n\\n I studied the fascinating woman, happy for a distraction from the night’s drama. “What’s the family business?”\\n\\n She flashed a charming dimple at me. “Don’t hold it against me, but my family is also in the hotel business. The Middletons are infamous competitors of the Cavendish family. Imagine everyone’s shock when James and I met and became fast friends, over eight years ago.”\\n\\n I wondered if friends could possibly be all that they were. How could two such outrageously good looking people of the opposite sex be strictly friends? Especially if one of them was James… She seemed to read my mind again. Her eyes widened on mine in the mirror and she vehemently shook her head. “We have been strictly friends. We went out to dinner a few times when we first met. I think James was toying with the idea of trying to seduce me, but it never came to that. He’s a man that knows how to read women, and he knew I was unreceptive. And I must tell you, I’m quite relieved at the change I’ve seen in him since he’s met you. I had thought, for the longest time, that James was as broken as me, if for different reasons.”\\n\\n “Broken?” I asked, completely drawn in by her candid manner.\\n\\n She grimaced, but her fairytale lavender eyes quickly smoothed back into a smile. “I’m not usually such an open book, but I can’t seem to help it with you. It makes sense, I suppose. You and I just have to be friends. I adore James, and I adore you on principal just for being the woman to finally make him fall in love.”\\n\\n CHAPTER THIRTY-FOUR\\n\\n I didn’t correct her words, though they made me wince as though she’d hit upon a very tender subject.\\n\\n Instead, I turned the focus back on her. “Why did you say you were broken?”\\n\\n She smiled. It was the saddest smile, unarguably heartbreaking. She just had that effect. What she felt showed on her lovely face, and it was impossible not to feel at least a little of it with her.\\n\\n “Since I can remember, I’ve been in love with a man who can never love me back. In fact, he’s in love with someone else, though it took me a long time to see that. My heart’s never been able to move on, so, much to my parents horror, I seem to be immune to the opposite sex. Even to a man as beautiful as James. \\n\\n","sourceLink":"https://allnovel.net/mile-high-up-in-the-air-2/page-36.html","bookId":1927,"book":{"id":1927,"title":"Mile High (Up in the Air #2)","description":"Storyline: Mile High (Up in the Air #2) \\n James and Bianca’s tumultuous story continues in the sequel to In Flight. \\n James has initiated Bianca into a dark and drugging world of passion and pain. He taught her about her own submissive, masochistic nature, and she fell swiftly and deeply in love with the undeniably charming and impossibly beautiful Mr. Cavendish, but a painful misunderstanding and the return of the brutally violent demon of her past have combined to overwhelm Bianca, and, confused and hurt, she pushes him away. \\n It’s been over a month since the shocking attack that hospitalized her, and since she told a distraught James that she needed space, but her feelings haven’t gone away. Even she knew that it was only a matter of time before he would cast his spell on her again…\\n","cover":"https://allnovel.net/images/mile-high-up-in-the-air-2.jpg","author":"R.K. Lilley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/mile-high-up-in-the-air-2.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:52:59 AM"}}
