{"id":23733,"no":105,"title":"CHAPTER CIV","content":"How the Alcalde Alonso Palomino and Don Antonio de Rivera arrived at the city of Cuzco, and what happened. WE have already related, farther back, how the municipality of Lima ordered the alcalde Alonso Palomino and Don Antonio Rivera to set out and travel, with all speed, to the great city of Cuzco, where they would find Vaca de Castro, and to give him the Ordinances which the accountant Juan de Cáceres had sent from Panamá, that he might decide what course would be best for the Realm. Palomino and Rivera arrived at Cuzco, causing disquiet to those who were inclined for peace, urging that such a calamity as this must not be let pass, for they all knew with what labour these regions had been explored. Vaca de Castro, having seen the Ordinances, and, being a discreet man, in no wise lost patience. On the contrary, he summoned the following citizens to meet in the municipal chamber: Capt. Garcilaso de la Vega, Don Martín de Guzmán, Hernando Bachicao, Juan Julio de Ojeda, Juan Vélez de Guevara, Diego Maldonado. When they had assembled he caused the Ordinances to be read to them in his presence. The officers of the municipality then discussed the matter in session, saying that[372] that city was the headpiece of the Realm and the others should be governed by it. The Emperor, our Lord, being so Christian a prince, it was not seemly to believe that, without hearing their objections, he should wish to deprive them of their property; and that the Ordinances could not be wholly complied with, notwithstanding that they must obey them as coming from their natural King. Vaca de Castro replied with some warmth that they should be silent rather than show such temper, because, since his Majesty had ordered that the Ordinances were to come into force, it had to be done and they must bow to the command, as that of their natural King and Lord. He said, further, that they must wait for the arrival of the Viceroy who, it might be, would consent to submit their petition before the royal presence. Meanwhile, they would not be dispossessed either of their estates or of Indians. Subsequently, the alcalde Palomino, Don Antonio de Rivera, Hernando Bachicao, and Cerme?o and others, according to report, wrote to Gonzalo Pizarro at his estate where he was staying, acquainting him with the Ordinances that had arrived, urging him to stand as the defender of everyone. For, said they, he was the brother of the Governor who opened up these countries and, in times and necessities like the present, gentlemen should show their worth, and the whole Realm would be with him to help and petition against these laws, and would venture their persons and estates in that cause. The letters I mention having been prepared, they were sent with all speed to where Gonzalo Pizarro was staying; and the messenger presently returned to Lima. After these things had occurred Vaca de Castro, with the concurrence of the leading citizens of Cuzco, arranged to send messengers to all the cities and towns in the Realm. They were told to appoint proctors whom they were to send to him to prepare for despatching representatives to Spain, with all possible[373] speed, to inform his Majesty as to what was fitting in the interests of his royal service, and to entreat him to sanction an appeal against some of the Ordinances. When Francisco de Caravajal, who was Sergeant-Major at the battle of Chupas, heard that the Viceroy would soon arrive with the Ordinances, being a man of good understanding and clear judgment (though he afterwards put his talents to so bad a use) he spoke to Vaca de Castro, telling him that he well knew what a loyal friend he [Caravajal] had been to him, as the Governor had always found him ready with his services in all the recent events. He therefore now asked a favour, which was that he might depart for Spain, where he would give the King an account of affairs in Peru, and tell him how poorly the conquistadores had been requited for the great services they had done for his Majesty. Without this, the promulgation of the Ordinances that were coming would be rendered serious and difficult. Vaca de Castro and the officers of the municipality, after considering the matter in council, agreed that Francisco de Caravajal should go on the errand he proposed, and if perchance he should meet Blasco Nú?ez Vela who, it was now generally known, was coming as Viceroy, he was to explain the state of the Realm to him and counsel him to approach it with sentiments of consideration and forbearance, so as to preclude any revival of sedition. There was great excitement among the people throughout the Realm when they heard about the Ordinances. The Spaniards were deeply chagrined, and declared that in the subjugation of this country many had lost their lives, and that to come here they had parted with their properties in Spain; while others, too, had grown old in campaigning in these regions—all without receiving royal pay or any reward except the Indians they held in encomienda, who were now, at their [liege\u0027s] death, to be[374] taken from the widow. In such circumstances what could be expected but that, forced by necessity, they should do ugly things and act against [the dictates of] their honour? And that their children would be left in poverty and their services meet with no recompense? Besides this they said that as for taking away from them the Indians whom they had obtained with so much labour, better were it that they should kill them all. And not only was this question about the Ordinances talked over, but false rumours were spread that all who might be found guilty of having been concerned in previous disturbances would be punished with great severity. The commotion among the people also gave rise to other versions which were all greedily listened to, and flew with great celerity from one place to another nourishing profound discontent and angry passions. Some showed the wounds they had sustained in their campaigns, which made the womenfolk shed many tears, saying that if their husbands were deprived of their estates, where could they themselves go to to maintain their lives with honour, being so far away from Spain? The agitation was greatest in the city of Cuzco, because the news was received there with acute displeasure: insomuch that angry words were bandied about, coming deep from their breasts, some of them violent and boding ill for the King\u0027s service. When Vaca de Castro was informed of what was being said, being anxious to preserve the Realm in peace, tranquillity, and contentment, and to stifle the wild utterances of persons who spoke so freely, he sent for Diego de Silva and Juan Vélez de Guevara (alcaldes) and said to them: \"Go ye through the city, and if ye hear any one speak openly against the King\u0027s service hang such a man at once, without waiting to make a deposition.\" When Diego de Silva and the other alcalde heard the talk that was going on, and learnt about the gatherings, and that the[375] people were firm in their contentions and making common cause to resist, and not obey, the Ordinances, they went relentlessly through the city ordering all to hold their peace, on pain of death; and they warned the principal citizens to have patience, and wait to see what his Majesty would order, and whether the Viceroy would forward the petition against the Laws. To this it is said they answered, that if his Majesty did it to raise money, they and their city would make him a present of five hundred thousand ducats. So Francisco de Caravajal departed from Cuzco, very pleased at quitting Peru at this time, carrying despatches from the Governor Vaca de Castro, and from the people of Cuzco to the municipal authorities of Lima desiring them to write to his Majesty. THE END","sourceLink":"http://novel.tingroom.com/jingdian/1971/56526.html","bookId":729,"book":{"id":729,"title":"The War of Chupas","description":"简介： Pedro de Cieza de Len was, on the whole, the most important historian, and is now the best authority, on ancient Peru, so far as his work has reached us; for he was a great traveller, and an eye-witness of much that he described....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1971","creation":"Aug 1, 2019 12:19:13 AM","modification":"Aug 1, 2019 12:19:13 AM"}}
