{"id":23668,"no":40,"title":"CHAPTER XXXIX","content":"How Pero Alvarez Holguin was received as Captain-General against the party of Chile, and how Gómez de Tordoya was appointed Camp Master, and how they entered the city of Cuzco. AFTER Pero Alvarez Holguin had been fully informed of the events that had occurred in the Realm, and that Gabriel de Rojas was Lieutenant to Almagro in Cuzco, it was agreed that the next step should be to return to that city, and arrest Gabriel de Rojas and the others whom they might find there obeying the call of the men of Chile. With this understanding they got ready to depart. But first they all accepted Pero Alvarez Holguin as their General; and he appointed Gómez de Tordoya as his Camp Master, confirmed Martín de Robles as Ensign-general, and named Castro to be Captain of the Arquebusiers. Having made these arrangements General Pero Alvarez immediately wrote to Captain Pedro Anzures, who had been Lieutenant to the Marquis Pizarro in the town of La Plata, giving that officer to know that he, Pero Alvarez, had been named General to act against the party of Chile, seeing that the disservice that had been done to his Majesty by the outrageous murder of the Marquis was very great. As every knight is bound to show his valour in such times, Don Pedro Anzures was called upon to assemble all the men possible, and join Pero Alvarez Holguin in the city of Cuzco, whither the latter intended to go to collect others. Sancho Perero was sent to La Plata on this embassy. Holguin, with those who were with him, determined to march to Cuzco and enter the city without being expected. He had collected fifty horsemen. Those on foot were ordered by Pero Alvarez to follow without much hurry, until they should reach Cuzco, where endeavour would be[135] made to provide horses for all. He himself, with the fifty horsemen I have mentioned, set out for Cuzco, where Gabriel de Rojas was still Lieutenant for young Almagro. Some of the men of Chile went to Lima with the news that the citizens of Cuzco had sent for Pero Alvarez to come and be made their leader. No small perturbation was caused by their tidings, and by the news of the proceedings of Alonso de Alvarado as we shall show further on. At Cuzco they had news of the gathering of men at Chuquito, and of how Pero Alvarez had turned back from the Chuncho expedition. Gabriel de Rojas placed spies on the road to find out whether Pero Alvarez was coming or not, and what they had decided to do. Pero Alvarez, and his Master of the Camp, Gómez de Tordoya, marched on to reach Cuzco with all possible speed. Although the city was warned of their coming, no resistance was offered; on the contrary, they were written to to enter peacefully, for that Gabriel de Rojas had his appointment in the King\u0027s name, and not from any tyrant whatsoever, and that all were against Don Diego and the party of Chile. The municipality wrote these and other things to Pero Alvarez. Some fled when it was known that Pero Alvarez was coming, that is, those who had been with the Adelantado at Las Salinas. Pero Alvarez and his followers entered the city, making all the noise they could, to lead people to think they were numerous, but without doing violence to or insulting those who were within. Pero Alvarez ordered the municipal officers to meet in Council, with the alcaldes and magistrates, and he was accepted by them as Captain-General in the name of his Majesty. This acceptance was made unwillingly by the municipality because the members of it preferred Gabriel de Rojas. But Pero Alvarez caused the meeting place to be surrounded, and finally they accepted him. The magistrates and alcaldes asked for the accustomed fees, which[136] he would not give, and they were not powerful enough to enforce their claim. Presently, at the sound of trumpets, the act of assumption of office was proclaimed. All the other citizens and inhabitants of the city approved the appointment of Pero Alvarez, and showed themselves glad, because he inspired great hopes, and they shouted through the city, with loud voices, \"Long live the King!\" When it became known that more than sixty Spaniards had quitted Cuzco, Captain Castro was ordered to follow and arrest them. And there went out with him— Juan Alonso Palomino Lope Martín Jerónimo de Soria Diego Manuel Hernando Bachicao Tomás Vázquez Guillada Cerdán and four others. They travelled with such speed that they overtook the fugitives and after meeting with some resistance captured more than forty of them. As it was night time the rest escaped, Captain Castro returning to the city with his prisoners. When Pero Alvarez heard what had occurred, he ordered them to be released and to be allowed to go where they liked, not being treated as prisoners. Don Diego had also been received as Governor at Arequipa. But as Pero Alvarez was now acknowledged as Captain-General in the large city of Cuzco, while waiting for the captain Pedro Anzures de Campo Redondo to come from the town of La Plata and join him, he sent his Serjeant-major, Francisco Sánchez, to Arequipa, to persuade the citizens there to range themselves in the service of the King, for they must know clearly that Don Diego had assumed the government tyrannically and without the royal authority of His Majesty. Sánchez was also ordered to busy himself in collecting arms and men. There had arrived just then at the port of Arequipa one ship out of three or four that left Spain at the cost of the Bishop of Plasencia to[137] explore the Strait of Magallanes. The crews had suffered great hardships, some of the vessels were wrecked, and the captains died. Only this one ship of them all ever reached a port in Peru, and brought a few Spaniards.[81] Pero Alvarez thought they might come and join him. Cristóbal de Hervas was then lieutenant in Arequipa, on behalf of Don Diego. Presently Serjeant-major Francisco Sánchez set out for Arequipa to do what we have said.","sourceLink":"http://novel.tingroom.com/jingdian/1971/56453.html","bookId":729,"book":{"id":729,"title":"The War of Chupas","description":"简介： Pedro de Cieza de Len was, on the whole, the most important historian, and is now the best authority, on ancient Peru, so far as his work has reached us; for he was a great traveller, and an eye-witness of much that he described....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1971","creation":"Aug 1, 2019 12:19:13 AM","modification":"Aug 1, 2019 12:19:13 AM"}}
