{"id":23673,"no":45,"title":"CHAPTER XLIV","content":"How, when the death of the Marquis was known at Plata, they raised the banner of the King, and how the captain Pedro Anzures, and other residents there, set out to join Pero Alvarez Holguin. AT the time of the death of the Marquis, the Captain Pedro Anzures was his lieutenant in the town of Plata. When he set out to penetrate into the country of the Chunchos, as already related, he received such important information respecting the Rio de la Plata and the many populous provinces on its banks that he desired to discover some way into them, which would not be too difficult, by crossing the Andes. From the time when the Marquis appointed him his Lieutenant, he amply showed his valour in his wars with the Indians, and his prudence in maintaining the peaceful relations they had promised to abide by, not consenting that any harm should be done to them. In the rich mines of Porco there were Spaniards who extracted a quantity of silver. Entertaining the desire[152] I have mentioned, to discover that land and great river, Pedro Anzures had gone, with some people, as far as the country of the Juries, which is to the east, to ascertain the character of the country in that direction as a practicable route for penetrating further. In that year, Captain Garcilaso de la Vega and Luis Perdomo were alcaldes of the town of Plata, Pedro de Hinojosa and Diego López de Zú?iga, Francisco de Almendras and Juan de Caravajal were regidores, and Antonio Alvarez was alguazil mayor. A man came to the town as a messenger from Gómez de Tordoya; for Sancho Perero, sent by Pero Alvarez, had not yet arrived. He told the alcaldes the news of the death of the Marquis. They all received it with the very greatest sorrow, and, although they would have liked to keep it secret until the return of Pedro Anzures, they could not do so, for it became known at once to all the inhabitants. They all felt grief that a Governor of the King, and a captain so old in the conquests of the Indies, should have been so barbarously murdered. There was a great excitement among them, for they did not know what course to pursue, nor whether Pedro Anzures would return from his expedition or not. The municipal officers assembled, and after having raised the banner for the king, they agreed to send a messenger to Pedro Anzures begging for his immediate return, as the tidings required it. They sent the news by one Marchena, who travelled quickly until he reached the place where Pedro Anzures was. The latter was deeply grieved, and returned quickly to the town, where several meetings of the municipality were held, but nothing was settled. For the regidores wanted to nominate that righteous cavalier Gonzalo[85] de la Vega as captain, or else Diego de Rojas. But Pedro Anzures maintained that it was his place, because he had been Lieutenant there. At these meetings[153] there were many bickerings, and Pedro Anzures had words with the alcalde Perdomo. Pedro de Hinojosa spoke so well at one of the meetings and with such effect that all determined to think of nothing but the King\u0027s service, and agreed that since Pedro Anzures was a gentleman and a gallant one who had been the Marquis\u0027 Lieutenant, he should be Captain. Pedro Anzures then raised the banner of his Majesty, and delivered it to Alonso de Loaisa as ensign. Before this the captain Garcilaso had gone to the mines at Porco to collect what men and arms might be there, and silver to divide amongst those who were about to go to serve the King. Soon all were in readiness. Sancho Perero, the messenger sent by Pero Alvarez Holguin, then arrived and related to those gentlemen what had taken place, and how Holguin had been chosen General to put down the tyranny of Almagro. Having delivered the letters to Pedro Anzures, he went back with others that were entrusted to him. When those who were to go were ready to start, and mounted on good horses, Pedro Anzures addressed them in a gracious speech, appealing to them to bear in mind that they were gentlemen and servants of the King, and that the evil committed by the men of Chile in tyrannizing over the country was very grave and deserving of severe punishment, which they, as loyal men, must inflict. Having added other observations on the subject, Captain Pedro Anzures left Francisco de Almendras as Chief Justice, Gabriel de Mendoza as alcalde and Antonio Alvarez as alguazil mayor. He then set out from the loyal town with fifty-two horsemen, among whom there went: Garcilaso de la Vega Pedro de Hinojosa Gaspar Rodríguez de Campo Redondo[86] Alonso de Mendoza[154] Juan de Caravajal Diego de Rojas Alonso de Camargo[87] Lope de Mendoza Diego Lope de Zú?iga Diego de Almendras Lope de Mendieta Alonso de Loaisa (ensign) Diego Centeno Luis Perdomo Francisco de Tapia Hernán Nú?ez de Segura Luis de Rivera Alonso Pérez Castillejo Francisco Retamoso Hernando de Aldana Alonso Manjarrés and others to the number I mentioned. They proceeded on their journey until they arrived at the villages \"del Rey,\" whence, leaving the baggage with some people, Captain Pedro Anzures went by way of Hatun-colla to the city of Arequipa, to collect all the men and arms that he could. He got there just when Sergeant-major Francisco Sánchez, was coming in with the men sent by Pero Alvarez Holguin. As the night had not yet run its course nor the day shown any sign of light, and the two parties entered the place one on one side and the other on another, loosening their arquebuses, they well nigh came to blows. They recognized each other in time, however, and were rejoiced. Though some showed themselves neutral in that city others joined the captains in the service of the King without wavering, and took the road with them back to Cuzco. On the way, Loaisa gave up the office of ensign under Pedro Anzures, and Diego Centeno took it over and carried the banner into Chupas. Finally, they all arrived safely at Cuzco. The Captain Pero Alvarez Holguin, with Gómez de Tordoya and the others, gave them a hearty welcome. There was much rejoicing at Cuzco, and all promised obedience to Pero Alvarez, and accepted him as General. He nominated Pedro Anzures as Captain of Lances, with Garcilaso de la Vega.","sourceLink":"http://novel.tingroom.com/jingdian/1971/56458.html","bookId":729,"book":{"id":729,"title":"The War of Chupas","description":"简介： Pedro de Cieza de Len was, on the whole, the most important historian, and is now the best authority, on ancient Peru, so far as his work has reached us; for he was a great traveller, and an eye-witness of much that he described....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1971","creation":"Aug 1, 2019 12:19:13 AM","modification":"Aug 1, 2019 12:19:13 AM"}}
