{"id":23689,"no":61,"title":"CHAPTER LX","content":"How it became known at Guaraz that Vaca de Castro was in the camp of Alonso de Alvarado, and how Captain Castro went thither, and of Vaca de Castro\u0027s going to Guaraz and taking command of the troops there, and of what else happened. \n \n AS the camp at Guaraz was so near to the camp of Alonso de Alvarado the news of what was passing reached there quickly, and Pero Alvarez, with the rest, were greatly pleased. For they had been encamped there many days and were anxious to depart. So they at once made ready to welcome the Governor, and Captain Castro presently set out with a small escort for the place where he was quartered. On arriving in Vaca de Castro\u0027s presence the latter greeted him with much affection, as a relation of his own through the Countess of Lemos,[102] with whom Vaca de Castro also claimed near relationship. \n \n [203] \n \n Captain Pedro Anzures also came out from the camp at Guaraz, by order of Captain Pero Alvarez, because he looked upon him as a very special friend, although there had been some points in dispute between them, too. And Vaca de Castro received Pedro Anzures very cordially. After Pedro Anzures had left Guaraz, Lorenzo de Aldana and Diego Maldonado resolved to go to the Governor and represent Pero Alvarez\u0027s keen desire to serve his Majesty, and advised Alvarez, as he was so near, to go himself and see de Castro. He replied that he would go gladly and that he was ready to start. So, leaving their camp well guarded, they set out for that of Alonso de Alvarado, where the Governor was. When Vaca de Castro heard that Pero Alvarez was coming he was very glad, and some gentlemen went out to welcome him. The Governor showed great love and goodwill when he saw Pero Alvarez, and promised to honour him for the good service he had done for his Majesty, and for the satisfactory results throughout the Realm. Pero Alvarez told him of all that had happened since the time when the banner was raised at Cuzco. Gómez de Tordoya, and Garcilaso de la Vega were also there. After Pero Alvarez had spent one day with Vaca de Castro he returned to his camp, not over pleased, some would have us believe, because it seemed to him that it would have been a fair thing to leave him with the rank of General, seeing he had so truly shown himself to be such a loyal servant of his Majesty. \n \n As soon as Pero Alvarez was gone, the Governor, Vaca de Castro, after taking the opinions of all the principal people who were with him, determined to go to Guaraz, where the banners were to be delivered to him. Although he was anxious to see the camp united, and placed under his command as Governor, yet he remained for three days, resting after his long and fatiguing journeys. After that, accompanied by Alonso de Alvarado and the rest of the[204] people, he set out for the camp of Pero Alvarez Holguin. When they arrived there Holguin came out with all the cavaliers and soldiers he had with him, and gave him the most solemn reception that was possible, quoting the name of the king and declaring that all would serve him with the utmost loyalty until they had wrested the Realm from those who had usurped it, and that they acknowledged and would obey the Governor in the royal name. Having joyously declared these things they fired off their artillery and arquebuses. All the horsemen came fully equipped, with lance in hand, and drew up before the Governor to salute him and welcome him on his arrival. He replied to them very graciously, thanking them for their services to his Majesty; and all made their obeisance together. Taking the royal standard in his hand, Pero Alvarez Holguin then addressed the Governor. He said that when he, and many other cavaliers who were here present, were about to set out for the exploration of the region beyond the Chunchos, they received news of the untoward death of the Marquis and of the great calamity it had brought upon the Realm. Deploring those events they returned to Cuzco, where he, Pero Alvarez, was accepted as Captain-General by all the Spaniards who were there and attended. On being informed that Vaca de Castro was coming, in the King\u0027s name and with his authority, he did not care to risk anything, although his force was increased by those in the lists at Cuzco and was fairly well equipped with arms, artillery, and horses, and with strong wills to chastise the tyranny that had risen up; for it was clear that the evil, if he failed, would be greater than the profits of a success. He had therefore traversed the provinces of Jauja and Bombon as far as to Guaraz, intending to wait there for the Governor\u0027s instructions. \"And since Our Lord,\" he continued, \"hath guided events prosperously, and you are the king\u0027s Governor by[205] virtue of the death of the late Marquis, receive, Sir, the royal standard and the banners which have been raised for this war, under which I and all the cavaliers and soldiers who are here enroll themselves.\" \n \n Vaca de Castro, with very great delight, took the royal standard in his hands, and gave it to Rodrigo de Campo, his captain of the guard, and thus answered Pero Alvarez:—\"You have delivered to me the banners and the men who are here. As you are a knight, and coming from such loyal predecessors as were your ancestors, I expected nothing less.\" He ordered his captain of the guard to keep the standard, because he did not wish to display any other than the one he had ordered to be made at Quito. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1971/56482.html","bookId":729,"book":{"id":729,"title":"The War of Chupas","description":"简介： Pedro de Cieza de Len was, on the whole, the most important historian, and is now the best authority, on ancient Peru, so far as his work has reached us; for he was a great traveller, and an eye-witness of much that he described....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1971","creation":"Aug 1, 2019 12:19:13 AM","modification":"Aug 1, 2019 12:19:13 AM"}}
