{"id":23712,"no":84,"title":"CHAPTER LXXXIII","content":"Of the things that were done in the city of Cuzco by the Governor Vaca de Castro, and of his great avarice and vainglory. \n \n AS soon as Vaca de Castro arrived at the city of Cuzco, he received many visits from the residents there. He was naturally inclined to be arrogant and haughty, and when he found that his party had routed Don Diego\u0027s and won the battle he became inflated with vanity to a degree quite unbefitting the profession to which he belonged. He ordered many gentlemen to attend him as his yeomen of the guard, and with them he spent money splendidly, having grand sideboards loaded with plate and huge candlesticks which might well have been dispensed with. He thought of nothing but amassing wealth, to satisfy his greed. This was a very ugly thing, for whilst his Majesty sent him to administer justice and conduct himself with rectitude, he set about gathering treasure for himself by unlawful means—and it is said that he had great natural skill in the art of acquisition. Indeed, some of his rivals allege that he received presents and bribes for the sale of repartimientos, which ought not, however, to be believed; nor have I been able to find any evidence of it. It is true that he wanted to make the valuable profits from coca his own perquisite, and not leave them open to all as they were before; and he ordered that no one, on pain of severe punishment, was to dare to contract for it from any of the best repartimientos, which he had reserved for himself. From this source and from other Indians he did strive to make money; and in this way, though he got little enjoyment out of it, he amassed great wealth, and he always endeavoured to settle his servants and friends in[296] the best positions. Yet, although Vaca de Castro had the vices of meaningless presumption, vainglory, and avarice, apart from them he was a good governor, and did useful things for the kingdom, all of which I will mention, for I am thereby a friend of truth, and let not anything otherwise ever be thought of me. \n \n Well, returning to our Governor Vaca de Castro, he was busy with affairs appertaining to the government of the Realm, and, with the desire to partition the provinces, he accepted some presents from the native Chiefs. He visited Don Diego de Almagro, Diego Méndez, Juan de Olivas in prison, and the others who were detained. He said to them: \"What utter folly can have induced you to make such a mistake as to rise in rebellion and publicly appear in arms against his Majesty\u0027s service, and to have done other ugly things which are well known?\" The lad Don Diego answered that neither he nor those who had been his defenders had opposed his Majesty\u0027s interests or had any such thought. On the contrary, he always believed that he was working in the King\u0027s behalf, and to assume charge of the province, seeing that he had sufficient warrant to do so, from his nomination as successor to his father the Adelantado, made by virtue of a royal commission. Vaca de Castro retorted by casting contempt on what had been done. After some further talk, he took leave of the prisoners, saying that, notwithstanding they were all condemned to death by the general sentence, he desired that they should beg him for justice, and that they would be freed or condemned as the law might dictate. Having said this, he returned to his house. Don Diego was so afflicted that his feelings could not be more wrought upon, and all felt great sorrow for him. But Caspar Rodríguez and others told Vaca de Castro that he had better behead the lad. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1971/56505.html","bookId":729,"book":{"id":729,"title":"The War of Chupas","description":"简介： Pedro de Cieza de Len was, on the whole, the most important historian, and is now the best authority, on ancient Peru, so far as his work has reached us; for he was a great traveller, and an eye-witness of much that he described....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1971","creation":"Aug 1, 2019 12:19:13 AM","modification":"Aug 1, 2019 12:19:13 AM"}}
