{"id":23722,"no":94,"title":"CHAPTER XCIII","content":"How the natives of those provinces concealed the provisions, and of the want that, it was believed, would be the consequence; also how Diego de Rojas sent messengers to Felipe Gutiérrez. WHEN the natives saw that the Christians were settling in the land without any intention of leaving it, but on the contrary had sent for those who remained in Chiquana, they unanimously determined to conceal the[326] provisions in order that, forced by necessity owing to the hunger they would suffer, they might quit the province. So, all at once and with great promptitude, they worked with such good will that, in a few days, nothing was found but the maize in leaf; for this they could not carry off. The Christians, feeling the want of food, searched for it in all directions, and when Diego de Rojas saw that there was none he took whom he thought necessary with him and, leaving the camp with a sufficient guard, resolved to go out and look for anything they could eat wherever they might find it. First, however, he ordered Pablo de Montemayor to return to Felipe Gutiérrez with all speed, and tell him what straits they were in for food; and that, while he himself was seeking out where the Indians had concealed the supplies, he thought it would be prudent for Gutiérrez to halt until further messengers could be sent him. In order that Montemayor might go in safety, so that the Indians could not do him any harm, they sent to obtain some horsemen from border settlements near the Andes. Diego de Rojas endeavoured with great diligence to find the maize and other eatables hidden by the Indians, but failed to meet with anything whatever. The Spaniards who accompanied Felipe Gutiérrez talked freely against the captains, regretting that Diego de Rojas should have come on by that route, knowing it was the intention of all of them to go towards Chile and the river Arauco. They murmured in such a way that Felipe Gutiérrez feared there would be a mutiny. Montemayor having made good speed on the way they met each other in a village called Irequire, at the end of the valley of Chiquana, and there he delivered the message from Diego de Rojas. Having seen the letter, Gutiérrez regretted the want of provisions, and reflecting that hunger was a lesser evil than that the soldiers should mutiny or kill him, and, moreover, that they were near the high road leading to Chile, he determined not to[327] make all the news public, but to push on with all speed to where Diego de Rojas was, and so they set out at once. When the captain Diego de Rojas could not find any provisions in all those parts, thickly peopled as they were from one end to the other, he received news of another very great province called Concho, and his necessity being so great, he resolved to adventure his person and those of his followers in an effort to find something to eat. Having decided to go there, they succeeded in reaching it in a few days. The fame of the horses had so cowed the Indians that they were stricken with terror and were able to offer but little resistance to the Spaniards, who found plenty of maize and other supplies. Farther on they discovered another settlement where there were many ewes and fowls and ducks. Diego de Rojas had come upon such abundance of provisions that he now regretted having sent to detain Felipe Gutiérrez who, notwithstanding that he encountered some difficulty in the march through the forests, was already very near at hand, on learning which Diego de Rojas was exceedingly glad. It was not long before Diego Gutiérrez and the Camp-master Nicolás de Heredia arrived, and they were received by all with great joy, thanks being given to God that they should thus be united without the loss of a man.","sourceLink":"http://novel.tingroom.com/jingdian/1971/56515.html","bookId":729,"book":{"id":729,"title":"The War of Chupas","description":"简介： Pedro de Cieza de Len was, on the whole, the most important historian, and is now the best authority, on ancient Peru, so far as his work has reached us; for he was a great traveller, and an eye-witness of much that he described....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1971","creation":"Aug 1, 2019 12:19:13 AM","modification":"Aug 1, 2019 12:19:13 AM"}}
