{"id":111256,"no":5,"title":"Page 5","content":"The next morning, I awoke to breathless news from Rosalyn\u0027s servants that her prized dog, Penny, had been attacked. Mrs. Cartwright summoned me to her daughter\u0027s chambers, saying nothing had stopped Rosalyn from crying. I tried to comfort her, but her wracking sobs never abated.\\n\\n The whole time, Mrs. Cartwright kept giving me disapproving glances, as if I should be doing a better job calming Rosalyn.\\n\\n \"Y have me,\" I\u0027d said at one point, if only to\\n\\n ou appease her. At that, Rosalyn had flung her arms around me, crying so hard into my shoulder that her tears left a wet mark on my waistcoat. I tried to be sympathetic, but I felt a stab of annoyance at the way she was carrying on. After all, I\u0027d never carried on like that when my mother had died. Father hadn\u0027t let me.\\n\\n You have to be strong, a fighter, he\u0027d said at the funeral. And so I was. I didn\u0027t cry when, just a week after Mother\u0027s death, our nanny, Cordelia, began absentmindedly humming the French lullaby Mother had always sung. Not when Father took down the portrait of Mother that had hung in the front room. Not even when Artemis, Mother\u0027s favorite horse, had to be put down.\\n\\n \"Did you see the dog?\" Damon asked, as we walked into town together that night to get a drink at the tavern. Now that the dinner where I was to publicly propose to Rosalyn was just days away, we were heading out for a whiskey to celebrate my impending nuptials. At least, that\u0027s what Damon called it, elongating his accent to a flat Charlestonian drawl and wiggling his eyebrows as he said it. I tried to smile as if I thought it was a great joke, but if I began talking, I knew I wouldn\u0027t be able to hold back my dismay about marrying Rosalyn. And there wasn\u0027t anything wrong with her. It was just ... it was just that she wasn\u0027t Katherine.\\n\\n I turned my thoughts back to Penny. \"Y Its es. throat had a gash in it, but whatever the animal was didn\u0027t go for her innards. Strange, right?\" I said as I rushed to keep up with him. The army had made him stronger and faster. \"It\u0027s a strange time, brother,\" Damon said. \"Maybe it\u0027s the Yankees,\" he teased with a smirk.\\n\\n As we walked down the cobblestone streets, I noticed signs affixed to most doorways: A reward of one hundred dollars was being offered to anyone who found the wild animal responsible for the attacks. I stared at the sign. Maybe I could find it, then take the money and buy a train ticket to Boston, or New Y ork, or some city where no one could find me and no one had ever heard of Rosalyn Cartwright. I smiled to myself; that would be something Damon might actually do--he never worried about consequences or other people\u0027s feelings. I was about to point out the sign and ask what he\u0027d do with one hundred dollars when I saw someone frantically waving at us in front of the apothecary.\\n\\n \"Are those the Salvatore brothers?\" a voice called from up the street. I squinted across the twilight and saw Pearl, the apothecary, standing outside her shop with her daughter, Anna. Pearl and Anna were two more victims of the war. Pearl\u0027s husband had died at the Vicksburg siege just last spring. After that, Pearl had found a home in Mystic Falls, and she ran an apothecary that was always busy. Jonathan Gilbert, in particular, was almost always there when I walked by, complaining about some ailment or purchasing some remedy or another. Town gossip was that he fancied her.\\n\\n \"Pearl, you remember my brother, Damon?\" I called as we walked over the square to greet them.\\n\\n Pearl smiled and nodded. Her face was unlined, and a game among the girls was trying to determine how old she was. She had a daughter who was only a few years younger than me, so she couldn\u0027t be that young. \"Y two certainly look\\n\\n ou handsome,\" she said fondly. Anna was the spitting image of her mother, and when they stood side by side, the two looked as if they could be sisters.\\n\\n \"Anna, you look more beautiful each year. Are you old enough to be going to dances yet?\" Damon asked, a twinkle in his eyes. I smiled despite myself. Of course Damon would be able to charm both a mother and a daughter.\\n\\n \"Almost,\" Anna said, her eyes sparkling in anticipation. Fifteen was the age when girls were old enough to stay through dinner and hear the band strike up a waltz.\\n\\n Pearl used a wrought-iron key to lock the apothecary, then turned to face us. \"Damon, can you do me a favor? Can you make sure Katherine gets on tomorrow night? She\u0027s a lovely girl, and, well, you know how people talk about strangers. I knew her in Atlanta.\"\\n\\n \"I promise,\" Damon said solemnly.\\n\\n I stiffened. Was Damon escorting Katherine tomorrow night? I hadn\u0027t thought she\u0027d come to the party, and I couldn\u0027t imagine proposing in front of her. But what choice did I have? Tell Father that Katherine wasn\u0027t invited? Not propose to Rosalyn?\\n\\n \"Have fun tonight, boys,\" Pearl said, breaking me out of my reverie.\\n\\n \"Wait!\" I called, the dinner momentarily forgotten.\\n\\n Pearl turned around, a quizzical expression on her face.\\n\\n \"It\u0027s dark, and there have been more attacks. Would you like us to escort you ladies home?\" I asked.\\n\\n Pearl shook her head. \"Anna and I are strong women. We\u0027ll be fine. Besides ...\" She blushed and glanced around, as if afraid to be overheard. \"I believe Jonathan Gilbert wants to do that for us. But I do thank you for your concern.\"\\n\\n Damon wiggled his eyebrows and let out a low whistle. \"Y know how I feel about strong women,\"\\n\\n ou he whispered.\\n\\n \"Damon. Be appropriate,\" I said, slugging him on the shoulder. After all, he wasn\u0027t on the battlefields anymore. He was in Mystic Falls, a town where people liked to eavesdrop and loved to talk. Had he forgotten so quickly?\\n\\n \"Okay, Auntie Stefan!\" Damon teased, raising his voice in a high lisp. I laughed despite myself and slugged him again on the arm for good measure. The punch was light, but felt good--a way to unleash some of my annoyance that he was able to escort Katherine to the dinner.\\n\\n He good-naturedly slugged me back, and we would have broken out into an all-out brotherly brawl if Damon hadn\u0027t pushed open the wooden door to the Mystic Falls Tavern. We were immediately greeted by an enthusiastic smile from the voluptuous, red-haired barmaid behind the counter. It was clear that Damon had made himself at home here on several occasions.\\n\\n We elbowed our way to the back of the tavern. The room smelled of sawdust and sweat, and men in uniform were everywhere. Some had bandages on their heads, others wore slings, and some hobbled to the counter on crutches. I recognized Henry, a dark-skinned soldier who practically lived at the tavern, drinking whiskey alone in a corner. Robert had told me stories about him: He never socialized with anyone, and no one ever saw him in the light of day. There was talk that maybe he was associated with the attacks, but how could he be, if he was always at the tavern?\\n\\n I peeled my eyes away to take in the rest of the scene. There were older men tightly grouped in a corner, playing cards and drinking whiskey and, in the opposite corner, a few women. I could tell from the rouge on their cheeks and their painted fingernails that they weren\u0027t the types to spend time with our childhood playmates, Clementine Haverford or Amelia Hawke. As we walked past, one of them brushed my arm with her painted fingernails.\\n\\n \"Y like it here?\" Damon pulled out a wooden\\n\\n ou table from the wall, an amused smile on his face.\\n\\n \"I suppose I do.\" I plunked down on the hard wooden bench and surveyed my surroundings once again. Being in the tavern, I felt I\u0027d stumbled into a secret society of men, just one more thing I knew I\u0027d have little chance to discover before I was a married man and expected to be at home every evening. \"I\u0027ll get us some drinks,\" Damon said, making his way to the bar. I watched as he rested his elbows on the counter and easily talked to the barmaid, who tilted her head back and laughed as if he\u0027d said something hilarious. Which he probably had. That\u0027s why all women fell in love with him.\\n\\n \"So, how does it feel to be a married man?\"\\n\\n I turned around to see Dr. Janes behind me. Well into his seventies, Dr. Janes was slightly senile and often loudly proclaimed to anyone who\u0027d listen that his longevity was due exclusively to his prodigious indulgence in whiskey.\\n\\n \"Not married yet, Doctor.\" I smiled tightly, wishing Damon would come back with our drinks.\\n\\n \"Ah, my boy, but you will be. Mr. Cartwright at the bank has been discussing it for weeks. The fair young Rosalyn. Quite a catch!\" Dr. Janes continued loudly. I glanced around, hoping no one had heard.\\n\\n At that moment, Damon appeared and gently set our whiskeys on the table. \"Thank you,\" I said, drinking mine down in one gulp. Dr. Janes hobbled away.\\n\\n \"That thirsty, huh?\" Damon asked, taking a small sip of his own drink.\\n\\n I shrugged. In the past, I\u0027d never kept secrets from my brother. But talking about Rosalyn felt dangerous. Somehow, no matter what I said or felt, I still had to marry her. If anyone heard even an inkling of regret from me, there\u0027d be no end to the talk.\\n\\n Suddenly, a new whiskey appeared in front of me. I glanced up to see the pretty bartender Damon had been talking to standing over our table.\\n\\n \"Y look like you need this. Seems you\u0027ve had out a rough day.\" The barmaid winked one of her green eyes and set the sweating tumbler on the rough-hewn wooden table in front of me.\\n\\n \"Thank you,\" I said as I took a small, grateful sip.\\n\\n \"Anytime,\" the barmaid said, her crinoline skirts swishing over her hips. I watched her retreating back. All the women in the tavern, even those with loose reputations, were more interesting than Rosalyn. But no matter who I glanced at, the only image that filled my mind was Katherine\u0027s face.\\n\\n \"Alice likes you,\" Damon observed.\\n\\n I shook my head. \"You know I can\u0027t look. By the you end of summer, I\u0027ll be a married man. Y ou, meanwhile, are free to do as you please.\" I\u0027d meant it to be an observation, but the words came out as a judgment.\\n\\n \"That\u0027s true,\" Damon said. \"But you do know you don\u0027t have to do something just because Father says so, right?\"\\n\\n \"It\u0027s not that simple.\" I clenched my jaw. Damon couldn\u0027t understand because he was wild and untamable--so much so that Father had entrusted me, the younger brother, with the future of Veritas, a role I now found stifling.\\n\\n A sliver of betrayal shot through me at this thought--that it was Damon\u0027s fault I had to shoulder so much responsibility. I shook my head, as if trying to remove the idea from it, and took another drink of whiskey.\\n\\n \"It\u0027s very simple,\" Damon said, oblivious to my momentary annoyance. \"Just tell him you are not in love with Rosalyn. That you need to find your own place in the world and can\u0027t just follow someone\u0027s orders blindly. That\u0027s what I learned in the army: Y have to believe in what you do. Otherwise, ou what\u0027s the point?\"\\n\\n I shook my head. \"I\u0027m not like you. I trust Father. And I know he only wants the best. It\u0027s just that I wish ... I wish I had more time,\" I said finally. It was true. Maybe I could grow to love Rosalyn, but the thought that I could be married and have a child in just one short year filled me with dread. \"But it\u0027ll be fine,\" I said with finality. It had to be.\\n\\n \"What do you think of our new houseguest?\" I said, changing the subject.\\n\\n Damon smiled. \"Katherine,\" he said, drawing the name into the full three syllables, as if he could taste it on his tongue. \"Now, she\u0027s a girl who\u0027s difficult to figure out, don\u0027t you agree?\"\\n\\n \"I suppose,\" I said, glad that Damon didn\u0027t \"I suppose,\" I said, glad that Damon didn\u0027t know that I was dreaming of Katherine at night, and by day pausing at the door to the carriage house to see if I could hear her laughing with her maid; once I even stopped by the stable to smell the broad back of her horse, Clover, just to see if her lemon and ginger scent had lingered. It hadn\u0027t, and at that moment, in the barn surrounded by the horses, I\u0027d realized how unbalanced I was becoming.\\n\\n \"They don\u0027t make girls like her in Mystic Falls. Do you think she has a soldier somewhere?\" Damon asked.\\n\\n \"No!\" I said, annoyed once again. \"She\u0027s in mourning for her parents. I hardly think she\u0027s looking for a beau.\"\\n\\n \"Of course.\" Damon knit his eyebrows together contritely. \"And I wasn\u0027t presuming anything. But if she needs a shoulder to cry on, I\u0027d be happy to lend it to her.\"\\n\\n I shrugged. Even though I\u0027d brought up the subject, I was no longer sure I wanted to hear what Damon thought of her. In fact, as beautiful as she was, I almost wished that some far-flung relatives from Charleston or Richmond or Atlanta would step forward to invite her to live with them. If she were out of sight, then maybe I could somehow force myself to love Rosalyn.\\n\\n Damon stared at me, and I knew in that moment how miserable I must have looked. \"Cheer up, brother,\" he said. \"The night is young, and the whiskey\u0027s on me.\"\\n\\n But there wasn\u0027t enough whiskey in all of Virginia to make me love Rosalyn ... or forget about Katherine.\\n\\n \\n\\n","sourceLink":"https://allnovel.net/stefan-s-diaries-origins-the-vampire-diaries-1/page-5.html","bookId":2068,"book":{"id":2068,"title":"Stefan\u0027s Diaries: Origins (The Vampire Diaries #1)","description":"Storyline: Origins (The Vampire Diaries: Stefan\u0027s Diaries #1) \\n Set during the Civil War, against a backdrop of grand estates, unimaginable riches, and deadly secrets, three teenagers in Mystic Falls, Virginia enter a torrid love triangle that will span eternity. Brothers Stefan and Damon Salvatore are inseparable until they meet Katherine, a stunning, mysterious woman who turns their world upside down. Siblings turned rivals, the Salvatores compete for Katherine\u0027s affection, only to discover that her sumptuous silk dresses and glittering gems hide a terrible secret: Katherine is a vampire. And she is intent on turning them into vampires so they can live together-forever.\\n","cover":"https://allnovel.net/images/stefan-s-diaries-origins-the-vampire-diaries-1.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/stefan-s-diaries-origins-the-vampire-diaries-1.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 6, 2019 12:18:44 AM"}}
