{"id":98012,"no":20,"title":"Page 20","content":"\"Do any of them have guns?\" she asked, petrified.\\n\\n \"Not likely,\" Arkeley told her. \"They\u0027re weak, and their bodies are soft with decay. If one of them tried to fire a gun the recoil would blow its arm off.\"\\n\\n \"I think we should head back to the house,\" Caxton said, doing her best to keep control of the obvious fear in her voice. She wanted to start screaming for help but that wouldn\u0027t do anyone any good. \"Let\u0027s at least get out of these trees.\" The half-deads were surrounding them on all sides. They were taking their time about pressing the attack and Caxton could imagine why. The assailants wanted to mob the two of them: one on one they couldn\u0027t even get close, but if a crowd of them attacked all at the same time then Caxton and the Fed would be overrun, unable to shoot fast enough to keep all the knife-wielding monsters at bay. Arkeley raised his weapon and fired. A half-dead she hadn\u0027t even seen disintegrated in mid-air. \"We can\u0027t afford to lose them by going too far. But I agree, we\u0027re in unnecessary risk here.\" He turned to face the stream that ran between them and the house. A half-dead stepped out from behind a tree in front of him and he punched it with his free hand hard enough to send it spinning to the leaf-littered ground. Caxton stomped it as she followed close behind.\\n\\n \"Follow my lead,\" he hissed at her. \"If we don\u0027t scare them off, we might just learn something tonight.\"\\n\\n They made it nearly all the way to the water without opposition. At the stream five of the half-deads waited for them, nearly invisible in the darkness. Caxton saw a hatchet come tumbling through the air toward her head and she turned her body just in time for the weapon to tear through her jacket sleeve. If her reflexes hadn\u0027t taken over at just the right moment the hatchet would have collided with her sternum. She put that out of her mind and lifted the shotgun. Her shot destroyed one of the half-deads completely and took an arm off another. Arkeley fired two shots, one after the other, and a pair of them fell down into the water, no more than heaps of old bones.\\n\\n That left only one of them standing and unharmed. It charged them even as they were recovering from their shots, a shovel held above its head in both hands. It squealed in rage as it closed the distance then brought the shovel down hard, blade first, right at Caxton\u0027s shoulder.\\n\\n Her very soul cringed as the shovel bit into her. She felt the impact, first, pain twanging up and down her arm and well into her chest. The blow didn\u0027t stop there, though-she felt the blade of the shovel tear through layer after layer of cloth and finally lodge deep in her skin. Trickles of blood rolled down between her breasts and over the knobs of her spinal column. Her flesh stretched and tore and her muscles screamed in panic as they were wedged open. It felt like she was going to die, that her body was being torn apart.\\n\\n Arkeley took his time, lined up the perfect shot, and blew off what remained of the half-dead\u0027s face.\\n\\n \"Get up,\" he told her.\\n\\n \"I don\u0027t want to alarm you,\" she panted, \"but I think I\u0027m hurt,\" she said, pushing at a tree trunk, getting back to her feet. She hadn\u0027t even realized she\u0027d fallen down. The wound hurt, bad, and she was shivering as she finally stood up and pawed at the torn sleeve of her jacket. \"I think... I think it\u0027s bad.\"\\n\\n \"You\u0027re fine,\" he told her, though he hadn\u0027t even looked at her wound. He stared up and back, at the way they had come. In the trees back there the half-deads were rallying. In a moment they would come running, rolling right over them. \"Walk it off,\" he told her.\\n\\n She thought she might die there, in that dark place, because he wouldn\u0027t take her seriously. She thought she might never see Deanna again. She followed him as he pounded across the stream, her feet getting wet yet again. They felt like frozen chunks of beef. Her breath came fast but without rhythm and she could hear her heart pounding in her chest, louder than the sound of her feet splashing in the water.\\n\\n \"I can\u0027t... I can\u0027t go any further,\" she said. Pain was making her dizzy. He turned, and stared at her, his eyes very thin slits in his face. They didn\u0027t have time to stop like this, she knew it. She was holding him back. He looked right into her and then he said, \"In a second I\u0027m going to ask you if you\u0027re okay. Your answer is extremely important. If you can keep fighting, or at least keep running, you have to say \u0027yes\u0027. Otherwise we have to run away and let them win this one. Now. Are you okay?\"\\n\\n A thickness in her throat kept her from answering one way or another. She managed to shake her head. No, she wasn\u0027t okay. She was hurt, she\u0027d been stabbed with a shovel. She was bleeding to death in the dark with enemies all around. She wasn\u0027t alright at all.\\n\\n The look on his face changed to one of utter unhappiness. Whether he was worried about her or about losing the fight she couldn\u0027t tell in the darkness. \"Then let\u0027s get the hell out of here,\" he told her, and pushed her forward. She dashed up the far bank and right up to the solid stability of the camp. She pressed her good shoulder against the wall and reached up to explore her wound.\\n\\n \"You do that later, when you\u0027re safe,\" Arkeley said, his voice very loud. He tore at her hands and pulled her away from the wall.\\n\\n Arkeley pushed open the front door and shoved her inside. He locked the door and turned around to scan the grim tableau of the main room, with its corpses wired into life-like postures. The barrel of his Glock 23 traversed from left to right before he even switched on the lights.\\n\\n Outside the half-deads screamed for their blood. Where the hell was the sheriff?\\n\\n Where were the cars from Troop J? Caxton started to sit down-she was feeling shaky, as if she might faint-but Arkeley scowled at her and she stayed where she was. They both pivoted around when they heard a noise from the kitchen-something was trying to get in. \"There\u0027s an open window in there,\" she said. The same window she\u0027d looked through when they arrived.\\n\\n He dashed into the kitchen wing and fired two shots. Then he slammed the window shut and bolted it. \"This won\u0027t hold them for long,\" he called. Out on the porch the half-deads started beating at the camp\u0027s walls, pounding to be let in. Their voices called out to her to let them in, to surrender. One of them called out her name and she nearly lost it but she shoved her hands over her ears and slowly regained control. When Arkeley came back into the main room she pointed at the far wing, the bunk room. There was only one window in there, a square vent high up in the wall that let in a few stray beams of moonlight.\\n\\n \"If we go in there we stay in there,\" he said. \"We can barricade the door and it will keep them out for a while. Maybe not long enough.\" He looked up and pointed at a skylight in the pitched ceiling, maybe ten feet up. A length of white rope dangled from its latch, presumably so that someone could open it to catch the breeze on a warm evening. Arkeley shoved a chair underneath the skylight and climbed up to grab the rope. He yanked downward and the skylight fell open. \"Alright, come on,\"\\n\\n \"I can\u0027t.\" Caxton held her injured shoulder and shook her head. \"I can\u0027t climb up there, not like this.\"\\n\\n Arkeley studied her face for a second. Then he grabbed the wrist of her hurt arm and pulled it around in a looping spiral that made her do a little pirouette. Black spots burst inside her eyes. Her brain trembled with the pain.\\n\\n He didn\u0027t seem to think it was so bad. \"If anything was broken that would have made you pass out. Now get up there. I\u0027ll help as much as I can.\"\\n\\n She didn\u0027t want to. She didn\u0027t want to do anything except climb into an ambulance and get pumped full of painkillers. She climbed up on the chair and reached up. She could almost touch the frame of the skylight, but not quite.\\n\\n \"Use the rope,\" he suggested.\\n\\n \"Will it hold my weight?\" she asked.\\n\\n \"I only know one way to find out. Do it already!\"\\n\\n Sucking on her lower lip she wrapped the end of the rope around her fist. Then she jumped up and grabbed onto the frame. The thin metal of the frame dug into her palm and opened up a fresh wound but she managed to not let go. The rope dug into her other hand. She could feel it shredding under her weight but it would hold for the moment. From below Arkeley shoved at her, hard, and suddenly she was outside in the cold, dark air. A few stars shone down and let her see the shingled roof. It looked too steep, as if she would fall if she didn\u0027t hold onto the skylight. She needed to help Arkeley up, though. Turning from the waist, her legs spread out for some minimal purchase, she reached down with her good arm and heaved him upward. He was a lot heavier than she\u0027d expected, or maybe that was just fatigue from her wound.\\n\\n On the way up he brought the rope with him. He pulled the skylight shut. Unless one of the half-deads was seven feet tall there would be no way for them to follow Arkeley onto the roof. They were safe-more or less.\\n\\n In the yard below the half-deads gathered around the front of the camp. Their torn faces were white and vicious in the starlight. \"Come down from there,\" one shouted, its nasty little voice getting on Caxton\u0027s nerves. \"Come down and we\u0027ll talk,\" it said.\\n\\n \"We just want to get to know you a little better, Laura!\"\\n\\n She lifted the shotgun, then thought better. From ten yards away the shot would spread too wide to do much damage, even to a barely-intact half-dead. She reached with her bleeding hand into her jacket and drew her pistol.\\n\\n \"You\u0027re going to be one of us, Laura!\" the half-dead crooned. \"It\u0027s just a matter of time! Our master got inside of you, inside of your brains!\"\\n\\n She lined up her shot but Arkeley stopped her. \"Don\u0027t waste the bullet.\" He pried up one of the shingles from the roof and held it loosely in his hand. It was nearly a foot square and when hurled it flew like a Frisbee. It bounced off the half-dead\u0027s chest but it was enough to make the thing run away howling in terror.\\n\\n \"They\u0027re cowards. You need to learn that. Now,\" he said, \"we can look at your shoulder.\"\\n\\n Caxton could barely balance on the pitched roof but she managed to shrug off her jacket. The cold air chilled her instantly and she started shivering again. \"Am I in shock?\" she asked, remembering a keyword from the first aid course she\u0027d taken at the academy. You were supposed to repeat it every other year but nobody ever checked if you did or not and she\u0027d never gotten around it.\\n\\n He tore at the sleeve of her uniform shirt and exposed her skin to the night air. He touched the wound and his fingers came away bloody. She\u0027d expected that, but then she\u0027d expected them to come away caked in gore. His fingers were barely stained.\\n\\n \"For God\u0027s sake,\" he said, his voice scornful. She yanked away from his hands.\\n\\n \"What? What is it? Tell me!\" she shouted. \"Am I going to die?\"\\n\\n He stared at her in pure disgust. \"That,\" he said, gesturing at the wound on her shoulder, \"isn\u0027t deep enough to kill a house cat. Let me put it this way. Next time you get hurt this badly, don\u0027t even bother telling me,\" he said. \"I can\u0027t believe we threw away a real opportunity because you got a little scratch.\"\\n\\n \"Jesus,\" she said, and turned away from him. \"It felt like I was getting cut in half.\"\\n\\n He only clucked his tongue at her in response. Down in the yard the half-deads laughed at her. She kicked at the shingles until several of them fell away and slid down toward the crowd below. That just made the half-deads laugh harder. \\n\\n","sourceLink":"https://allnovel.net/13-bullets-laura-caxton-vampires-1/page-20.html","bookId":2605,"book":{"id":2605,"title":"13 Bullets (Laura Caxton / Vampires #1)","description":"Storyline: 13 Bullets: A Vampire Tale (Laura Caxton / Vampires #1) \\n Thirteen Bullets takes place in Pennsylvania in the year 2003, in a setting similar to the real world, but where vampires and other supernatural forces are rare but accepted phenomena. It is widely believed that vampires were all but wiped out twenty years ago by Special Deputy Jameson Arkeley. The last vampire still in existence, Justinia Malvern, long imprisoned in a nearly abandoned sanitarium, has somehow managed to bestow her vampiric curse to the outside world and is working to free herself of human confinment. Pennsylvania State Trooper Laura Caxton is assigned to assist Arkeley hunt down the vampires running loose in rural Pennsylvania.\\n","cover":"https://allnovel.net/images/13-bullets-laura-caxton-vampires-1.jpg","author":"David Wellington","type":"Horror","source":"allnovel","link":"https://allnovel.net/13-bullets-laura-caxton-vampires-1.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:30:13 PM"}}
