{"id":97996,"no":4,"title":"Page 4","content":"Part II - Congreve\\n\\n Chapter 4\\n\\n A fool there was and he made his prayer\\n\\n (Even as you and I)\\n\\n To a rag and a bone and a hank of hair\\n\\n (We called her the woman who did not care)\\n\\n But the fool he called her his lady fair.\\n\\n -Rudyard Kipling, The Vampire\\n\\n Twenty years later Pennsylvania State Trooper Laura Caxton pulled apart a road flare until red sparks shot across the leather elbow of her uniform jacket. She dropped the sputtering flare on the road and turned around. She\u0027d felt something behind her, a presence, and on this particular night she had reason to be seriously creeped out.\\n\\n The man behind her wore a tan trench coat over a black suit. His hair the color of a steel wool was cut short and close to his head. He looked to be in pretty good shape but he had to be at least sixty. Maybe seventy. In the flickering light of four in the morning the creases on his face could have been wrinkles or they could have been scars. His eyes were hooded by deep, pouchy lids and his mouth was nothing more than a narrow slot in the bottom half of his face.\\n\\n \"Good evening,\" he said, his voice thick and a little hoarse. His face folded up like a gas station road map. He was smiling, the kind of smile you give a child you don\u0027t particularly like. The smile submerged his tiny eyes entirely. \"You don\u0027t have a badge on your uniform,\" he went on, making it sound like she\u0027d forgotten to wash behind her ears.\\n\\n \"We don\u0027t wear them,\" she told him. This guy was starting to piss her off. \"The State Policeman\u0027s good conduct is the only badge he needs,\" she said, more or less quoting what she\u0027d been taught as a cadet. The black suit and the trench coat gave him away at once-he might as well have had \"FED\" written on his back in big white block letters-but she scanned his chest and found his badge, a five-pointed star in a circle. The badge of the US Marshals Service. \"The Sergeant said he was going to call the FBI,\" she said.\\n\\n \"And they called me, just like they\u0027re supposed to. I only live a few hours away and you could say that I\u0027ve been waiting for this for a very long time. Please, don\u0027t make me wait any longer. When I arrived your sergeant told me to find you. He said you were the last one still here who saw what happened.\"\\n\\n Caxton nodded. She unstrapped her wide-brimmed trooper\u0027s hat and scratched the top of her head. Fatigue and shock were fighting over who got to make her sit down first. So far she\u0027d beaten both of them back. \"I suppose that\u0027s right.\" She held out her hand. Maybe her dislike of this man merely stemmed from how much she disliked this night in general.\\n\\n He didn\u0027t take her hand. He just stood there like both his arms were paralyzed.\\n\\n \"My name is Special Deputy Arkeley, if that\u0027s what you wanted. Can we just get on with this and worry about the civilities later?\"\\n\\n Maybe he was just an asshole. She shrugged and pushed past him, assuming he would probably follow. When she got to the top of the rise she turned around and pointed at the roadblock just in front of the Turnpike onramp. The DUI Enforcement trailer stood in the middle of the road, abandoned for the time being. Orange lights up on sawhorses stabbed at the dark, their light skittering around the dead tree branches that arched over the road. The strobing light made Caxton\u0027s eye sockets ache. \"We\u0027re Troop T. We\u0027re highway patrol for the Turnpike, and that\u0027s all. We were not prepared for this.\" He didn\u0027t look like he cared. She went on. \"Three fellow officers and I were working a standard sobriety check right here. Nothing special, we do this every Saturday night. It was about fifteen minutes past ten and we had three cars lined up for us. Another car, a late model, black luxury vehicle, stopped about fifty feet short of entering the line. The driver hesitated then attempted to perform a u-turn. That\u0027s something we see a lot of. People realize they\u0027re going to fail the tests so they try to evade us. We know how to handle it.\"\\n\\n He stood there as quiet as a church mouse. He was just listening, his posture said. Absorbing whatever she was going to give him. She went on.\\n\\n \"Two units, troopers Wright and Leuski, had been at station in their patrol cars there and there.\" She pointed at where the cars had been waiting on the shoulders of the road. \"They engaged the subject in a classic pincers maneuver and forced him to a stop. At that time he opened the door of his car and rolled out onto the road surface. Before Wright and Leuski could apprehend him he ran to the west, toward that line of trees.\" She pointed again. \"The subject evaded arrest, though not before he left some evidence behind.\"\\n\\n Arkeley nodded. He started walking away from her, toward the subject\u0027s abandoned vehicle. It was a Cadillac, a CTS with a big blocky nose. A little pale mud flecked the running boards and there was a bad scratch down the driver\u0027s side door but otherwise the car was in immaculate condition. It had been left just as it had been abandoned except that its trunk had been opened. Its flashers pulsed mournfully in imitation of the brighter lights up at the roadblock.\\n\\n \"What did your people do then?\" Arkeley asked.\\n\\n Caxton closed her eyes and tried to remember the exact series of events. \"Leuski went after the subject and found the, well, the evidence. He came back and opened the subject vehicle\u0027s trunk believing he had enough in the way of exigent circumstance to warrant an intrusive search. When we saw what was inside we realized this wasn\u0027t just some drunk running away so he didn\u0027t have to face the Intoxilyzer. Wright called it in, just like he was supposed to. We\u0027re Highway Patrol. We don\u0027t handle these kind of criminal matters, we turn that over to the local police.\"\\n\\n Arkeley frowned, which fit his face a lot better than his smile. \"I don\u0027t see any of them here.\"\\n\\n Caxton almost blushed. It was embarrassing. \"This is a pretty rural area. The cops here work weekdays, mostly. Someone\u0027s always supposed to be on call but this late at night the system tends to break down. We have a cellular number for the local guy but he isn\u0027t answering.\"\\n\\n Arkeley\u0027s face didn\u0027t show any surprise. That was alright. Caxton didn\u0027t have the energy left to make excuses for anybody else.\\n\\n \"We put in a call to the county authorities but there was a multi-car pile-up near Reading and the sheriff\u0027s office was tied up. They sent one guy to collect fibers, DNA and prints but he left three hours ago. They\u0027ll have more people here by morning, they said, which leaves us standing watch here all night. The Sergeant noticed this then,\" she said. She indicated the car\u0027s license plate. It was a Maryland tag. \"There was clear evidence of an alleged criminal crossing state borders. And it was bad, pretty much bad enough the Sergeant felt that bringing in the FBI made some sense. Now you\u0027re here.\"\\n\\n Walking around behind the car Arkeley ignored her as he studied the contents of the trunk. She expected him to gag or at least wince but he didn\u0027t. Well, Caxton had met plenty of guys who tried to look tough when they saw carnage. She stepped around to the trunk to stand beside him. \"We think there are three people in there. A man and two children, genders unknown. There\u0027s enough left of the man\u0027s left hand to get prints. We might get lucky there.\"\\n\\n Arkeley kept staring down into the trunk. Maybe he was too shocked to speak. Caxton doubted it. She\u0027d been working highway patrol for three years now and she\u0027d seen plenty of wrecks. Despite the barbarity of the murders and despite the fact that the bodies had been shredded and heavily mutilated, she could honestly say she\u0027d seen worse. For one thing there was no blood in the trunk. Not so much as a drop. It also helped that the faces had been completely obliterated. It made it easier to think of the bodies as something you\u0027d cut up in biology class. It made it easier to not think of them as human beings.\\n\\n After a while Arkeley looked away. \"Alright. This is going to be my case,\" he said. Just like that.\\n\\n \"Now, wait a second-you were brought in as a consultant, that\u0027s all.\"\\n\\n He ignored her. \"Where\u0027s the evidence the subject left behind?\"\\n\\n \"It\u0027s up by the tree line. But goddamnit, tell me what you meant by that. How is this your case?\"\\n\\n He did stop then. He stopped and gave her that nasty smile that made her feel about six years old. He explained it to her in a voice that made her feel about five.\\n\\n \"This is my case because the thing that killed those people in that trunk, the thing that drank their blood, was a vampire. And I\u0027m in charge of vampires.\"\\n\\n \"Come on, be serious. Nobody\u0027s seen a vampire since the Eighties. I mean, there was that one they caught in Singapore two years ago, the one they burned at the stake. But that was a long way from here.\"\\n\\n He might as well not have heard her. He walked up toward the trees then and she had to rush to catch up. He was about four inches taller than she was and he had a longer stride. They pushed a few branches aside and saw that the wild trees grew only a single stand deep, that beyond lay the long perfect rows of a peach orchard, its dormant trees silver and gnarled in the faint moonlight. A wicked-looking five-strand barbed wire fence stretched across their path. They stopped together when they reached the fence. \"There it is,\" she said. She didn\u0027t want to look at it. It was a lot worse than what was in the trunk. \\n\\n","sourceLink":"https://allnovel.net/13-bullets-laura-caxton-vampires-1/page-4.html","bookId":2605,"book":{"id":2605,"title":"13 Bullets (Laura Caxton / Vampires #1)","description":"Storyline: 13 Bullets: A Vampire Tale (Laura Caxton / Vampires #1) \\n Thirteen Bullets takes place in Pennsylvania in the year 2003, in a setting similar to the real world, but where vampires and other supernatural forces are rare but accepted phenomena. It is widely believed that vampires were all but wiped out twenty years ago by Special Deputy Jameson Arkeley. The last vampire still in existence, Justinia Malvern, long imprisoned in a nearly abandoned sanitarium, has somehow managed to bestow her vampiric curse to the outside world and is working to free herself of human confinment. Pennsylvania State Trooper Laura Caxton is assigned to assist Arkeley hunt down the vampires running loose in rural Pennsylvania.\\n","cover":"https://allnovel.net/images/13-bullets-laura-caxton-vampires-1.jpg","author":"David Wellington","type":"Horror","source":"allnovel","link":"https://allnovel.net/13-bullets-laura-caxton-vampires-1.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:30:13 PM"}}
