{"id":98034,"no":43,"title":"Page 43","content":"Part IV - Scapegrace Chapter 43 His thoughts were red thoughts/ and his teeth were white. -Saki, \"Sredni Vashtar\" They had a shower in the back of the local cop shop, with fresh towels and good soap and everything. It wasn\u0027t too surprising-the local chief of police was a woman. Caxton was a little surprised not to find a bathtub, though she supposed that wouldn\u0027t be too professional. She spent a lot longer getting clean than she probably needed to. While disrobing she found Vesta Polder\u0027s charm still hanging around her neck, grimy with her sweat and general dirt. She cleaned it off and held it up to the light and didn\u0027t see anything different than she had before. It was just a spiral of metal, cool to the touch. Whether it had helped her or failed her she had no idea. Maybe that was how such things worked. Maybe it was entirely psychosomatic, or maybe it had been the only thing that saved her from Reyes\u0027 domination. She imagined she would never know. By the time she\u0027d finished cleaning up the paramedics had already arrived to take a look at her. They told her she\u0027d been very lucky, that the broken ribs she complained of were just sprained, and would heal nicely in a week or two. She had a lot of minor lacerations and contusions which they painted with antiseptic and put bandages on and then they went away. Then she dressed up in the street clothes the chief had offered her, which were only a little too big, and sat down in the break room with a yellow legal pad and started trying to write her story down. Caxton had never been very good at long reports. They always made her think of writing papers in her abortive attempt at college. Still, she told the story as plainly as she could, with as much detail as she could remember. She only stopped when Clara arrived. Clara. Caxton had asked specifically for the sheriff\u0027s photographer to come drive her home. She had called Deanna, but mostly just to make sure she was okay. Deanna was still in the hospital and couldn\u0027t come for her. Clara had been her second choice, of course. When Clara came into the break room, though, Caxton knew better, just by way she felt seeing Clara again. She held out one bandaged hand and Clara took it, then came closer and just stood there for a moment before awkwardly leaning down and kissing Caxton on the top of her head. Warmth-stemming from both embarrassment and other causes-spread through Caxton\u0027s face and down her neck. \"We thought you were dead,\" Clara said, her voice a little shaky. \"We looked all night. Somebody called me yesterday morning because... because they thought I would want to know you were missing, and I came right away and joined the search party. We looked everywhere. We even checked out that steel mill but it was all locked up. Oh my God, I looked that place over myself and I didn\u0027t see anything.\" \"Don\u0027t be too hard on yourself,\" Arkeley said. \"They\u0027re masters of concealing their hiding places. They have charms to confuse the mind, especially by moonlight.\" \"He insisted on coming along,\" Clara said. Caxton frowned. She wanted to ask what Clara meant, whether Clara had heard Arkeley\u0027s voice as well, but then the Fed walked into the break room and sat down on the edge of the table. Caxton slowly realized he wasn\u0027t just in her head anymore. It was the real Jameson Arkeley, vampire killer. It was truly weird to see him again. She had internalized him, made his personality part of her self, and it was the only way she had survived being Reyes\u0027 captive. He had come to represent something vital and necessary to her. The flesh-and-blood Arkeley, by comparison, was someone she didn\u0027t necessarily want to see. She sighed. She had so much to tell him, though. So much he had to hear. \"Special Deputy,\" she said, \"I need to make a report to you.\" His face contorted, the wrinkles all running one direction then another as if he couldn\u0027t decide whether to smile or frown. He finally settled on a pained-looking grimace. \"I\u0027ve already got the Cliff\u0027s Notes version. You killed Reyes.\" \"I waited until dawn and then I burned his heart,\" she said. \"Unnecessary understatement is almost as bad as pointless embellishment.\" She stared up at him, her face devoid of any emotion. What she had to say was going to be important to him. \"He tried to make me one of them.\" Nobody moved or spoke after that. Nobody dared break the silence until Arkeley reached up and rubbed the back of his neck with one hand. \"Okay,\" he said. \"Tell me while we drive.\" She expressed her thanks to the local chief and they headed out back to where Clara\u0027s personal vehicle waited. It was a bright yellow Volkswagen, a New Beetle with a flower vase built into the dashboard. It was a lot like Clara herself-tiny, cute, and it came from a whole different world than the one Caxton inhabited. A world she could visit for a while but she\u0027d never be allowed to stay there. The vampires would make sure of it. Caxton crawled into the back while Arkeley took the front passenger seat. His fused vertebrae trumped her sprained ribs, he announced. She leaned forward between the front seats and told him about her ordeal. Clara drove not west, toward Harrisburg, but south-east, back toward Kennett Square. Nobody bothered to tell Caxton why and she was too busy talking to ask. \"He used the Silent Rite on me, or at least that\u0027s what Malvern calls it. Just one of a long list of what she calls orisons. Reyes called it a hechizo.\" She didn\u0027t mention how she\u0027d learned that word, how she\u0027d tortured a half-dead by pulling his fingers off. She didn\u0027t want Clara to ever know about that. \"It\u0027s a spell, or maybe some kind of psychic power. Either way, it\u0027s a violation of the brain. He shoved part of himself in through my eye sockets and took total control of my dreams. He could make me fall asleep against my will and he kept me in and out of the dream state. He showed me a vision of hell, I guess, and waited for me to commit suicide.\" \"Hmph,\" Arkeley said. \"Something you want to add?\" she asked. He glared back at her with eyes wide as if she\u0027d forgotten her place. She supposed she\u0027d never used that tone with him before. It made her want to say \"Hmph\" herself. \"Every vampire I\u0027ve studied killed him-or herself,\" he told her. \"It\u0027s central to the curse. In Europe every suicide was questionable. They used to bury suicides at crossroads, the thinking being that vampires would be lost when they rose and wouldn\u0027t know the way home. In other times, in other places they buried suicides with their heads cut off and turned upside down or fired a bullet through the heart.\" \"A silver bullet?\" Clara asked. \"That\u0027s a myth,\" Arkeley and Caxton said at once. Another opportunity to glare at each other. \"The curse drives you to take your own life. Once it\u0027s in you the thought starts gnawing at you. You start thinking that all your problems would just go away if you were dead. That\u0027s the last step in the change, and it\u0027s necessary. He was very clear on that.\" \"Reyes went through this same process, most likely,\" Arkeley asked, voice neutral, just looking for data. \"And Lares, and Malvern before him.\" Caxton shook her head. \"No. Reyes didn\u0027t require any of the dream magic bullshit. He already wanted to die. Malvern looked into his soul and he said \u0027yes\u0027, just like that. Congreve-that\u0027s the vampire we killed together-took about three hours to convince. Reyes did him and the other one, the one with docked ears. Congreve was a construction worker. That\u0027s why he picked that site for his ambush. He had a master\u0027s degree in Renaissance music but he couldn\u0027t find a job with his degree, so he ended up working construction on a highway project. He hated it, hated everything about his life. Reyes capitalized on that and convinced Congreve to blow his own brains out. It was too hard for her to make happy, healthy people into vampires, so she went looking for real losers. People with nothing to hold them to life.\" \"Jesus,\" Clara sighed. \"I feel that way half the time.\" Arkeley ignored her. \"The other one. With the mangled ears. Do you have a name?\" he asked. Caxton thought about it for a second. She bit her lip. It suddenly occurred to her for no reason at all that Clara trusted her and probably wouldn\u0027t even try to stop her if she just reached forward and grabbed the steering wheel and give it a quick yank to the right. They were driving along the wooded bank of a dry streambed that ran maybe thirty feet down. The New Beetle would crumple like a soda can when it hit the rocks down there. She sat back in her seat and pressed her knuckles against the sides of her head and pushed the thought away. It wasn\u0027t her thought, though it had felt like any of the million other things in her head. It was Reyes, the part of Reyes that had colonized her brain. His curse was still trying to destroy her. \"Scapegrace,\" she said, coughing out the name. She had to fight to make Reyes let it go but once she had the name she had the whole story. \"Kevin Scapegrace. He was sixteen years old. Tall but skinny, too scared of his high school to get decent grades. The kids at school picked on him. One of them, an older boy, raped Kevin in the showers during gym class. Kevin was pretty sure that made him gay and he couldn\u0027t live with himself anymore.\" Caxton\u0027s mouth hardened into a tight snarl. \"He\u0027d swallowed a bottle of aspirin when Reyes found him. Reyes sat with him while the half-deads raided a drugstore. They brought back a bottle of Valium, and Kevin took that, too. Kevin didn\u0027t really understand what he was being offered. He accused Reyes of raping him, too and now he hates what he\u0027s become.\" She looked up and saw Arkeley staring at her. Clara kept glancing back over her shoulder and her eyes were tougher to meet. They were full of confusion and worry and a little fear. \"Reyes told you all that, before you killed him?\" Arkeley asked, softly, as if he knew the answer already. \"No,\" Caxton replied. She suddenly wished Clara wasn\u0027t there. She licked her lips. \"No. After.\" Arkeley nodded patiently. Damn him. He was going to make her say it out loud. He was going to make her say it in front of Clara. \"And how is that possible, Trooper?\" Caxton closed her eyes. \"Because he\u0027s still inside my head.\"","sourceLink":"https://allnovel.net/13-bullets-laura-caxton-vampires-1/page-43.html","bookId":2605,"book":{"id":2605,"title":"13 Bullets (Laura Caxton / Vampires #1)","description":"Storyline: 13 Bullets: A Vampire Tale (Laura Caxton / Vampires #1) Thirteen Bullets takes place in Pennsylvania in the year 2003, in a setting similar to the real world, but where vampires and other supernatural forces are rare but accepted phenomena. It is widely believed that vampires were all but wiped out twenty years ago by Special Deputy Jameson Arkeley. The last vampire still in existence, Justinia Malvern, long imprisoned in a nearly abandoned sanitarium, has somehow managed to bestow her vampiric curse to the outside world and is working to free herself of human confinment. Pennsylvania State Trooper Laura Caxton is assigned to assist Arkeley hunt down the vampires running loose in rural Pennsylvania.","cover":"https://allnovel.net/images/13-bullets-laura-caxton-vampires-1.jpg","author":"David Wellington","type":"Horror","source":"allnovel","link":"https://allnovel.net/13-bullets-laura-caxton-vampires-1.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:30:13 PM"}}
