{"id":10124,"no":1,"title":"PROLOGUE","content":"This book was begun eight years ago; so I have not produced this disagreeable German for the gratification of primitive partisanship aroused by the war. On the other hand, having had him up my sleeve for so long, I let him out at this moment in the undisguised belief that he is very apposite. I am incidentally glad to get rid of him. He has been on my conscience (my conscience as an artist, it is true) for a long time. The myriads of Prussian germs, gases, and gangrenes released into the air and for the past year obsessing everything, revived my quiescent creation. I was moved to vomit Kreisler forth. It is one big germ more. May the flames of Louvain help to illuminate (and illustrate) my hapless protagonist! His misdemeanours too, which might appear too harshly real at ordinary times, have, just now, too obvious confirmations to be questioned. Germany’s large leaden brain booms away in the centre of Europe. Her brain-waves and titanic orchestrations have broken round us for too long not to have had their effect. As we never think ourselves, except a stray Irishman or American, we should long ago have been swamped had it not been for the sea. The habits and vitality of the seaman’s life and this vigorous element have protected us intellectually as the blue water has politically. In Europe Nietzsche’s gospel of desperation, the beyond-law-man, etc., has deeply influenced the Paris apache, the Italian Futurist littérateur, the[x] Russian revolutionary. Nietzsche’s books are full of seductions and sugar-plums. They have made “aristocrats” of people who would otherwise have been only mild snobs or meddlesome prigs; as much as, if not more than, other writings, they have made “expropriators” of what would otherwise merely have been Arsène Lupins: and they have made an Over-man of every vulgarly energetic grocer in Europe. The commercial and military success of Prussia has deeply influenced the French, as it is gradually winning the imagination of the English. The fascination of material power is, for the irreligious modern man, almost impossible to resist. There is much to be said for this eruption of greedy, fleshy, frantic strength in the midst of discouraged delicacies. Germany has its mission and its beauty. We will hope that the English may benefit by this power and passion, without being unnecessarily grateful for a gift that has been bought with best English blood, and which is not as important or unique as the great English gift bestowed centuries ago. As to the Prophet of War, the tone of Nietzsche’s books should have discredited his philosophy. The modern Prussian advocate of the Aristocratic and Tyrannic took everybody into his confidence. Then he would coquet: he gave special prizes. Everybody couldn’t be a follower of his! No: only the minority: that is the minority who read his books, which has steadily grown till it comprises certainly (or would were it collected together) the ungainliest and strangest aristocratic caste any world could hope to see! Kreisler in this book is a German and nothing else. Tarr is the individual in the book, and is at the same time one of the showmen of the author. His private life, however, I am in no way responsible for. The long drawn-out struggle in which we find this young man engaged is illuminated from start to finish by the hero of it. His theory, put in another way, is that an artist requires more energy than civilization provides, or than the civilized mode of life implies: more na?veté,[xi] freshness, and unconsciousness. So Nature agrees to force his sensibility and intelligence, on the one hand, to the utmost pitch, leaving him, on the other, an uncultivated and ungregarious tract where he can run wild and renew his forces and remain unspoilt. Tarr, in his analysis of the anomalies of taste, gives the key to a crowd of other variants and twists to which most of the misunderstandings and stupidities in the deciphering of men are due. He exaggerates his own departure from perfect sense and taste into an unnecessary image of Shame and Disgust, before which he publicly castigates himself. He is a primitive figure, coupled with a modern type of flabby sophistication: that is Bertha Lunkin. The Münich German Madonna stands nude, too, in the market-place, with a pained distortion of the face. Tarr’s message, as a character in a book, is this. Under the camouflage of a monotonous intrigue he points a permanent opposition, of life outstripped, and art become lonely. He incidentally is intended to bring some comfort of analysis amongst less sifted and more ominous perplexities of our time. His message, as he discourses, laughs, and picks his way through the heavily obstructed land of this story, is the message of a figure of health. His introspection is not melancholy; for the strange and, as with his pedagogic wand he points out, hideously unsatisfactory figures that are given ingress to his innermost apartments become assimilated at once to a life in which he has the profoundest confidence. He exalts Life into a Comedy, when otherwise it is, to his mind, a tawdry zone of half-art, or a silly Tragedy. Art is the only thing worth the tragic impulse, for him; and, as he says, it is his drama. Should art, that is some finely-adjusted creative will, suddenly become the drama of the youth infatuated with his maiden, what different dispositions would have to be made; what contradictory tremors would invade his amorous frame; what portions of that frame would still smoulder amorously? These questions Tarr disposes of to his satisfaction. So much by way of warning before the curtain rises. Even if the necessary tragic thrill of misgiving is caused thereby (or are we going to be “shocked” in the right way once again, not in Shaw’s “bloody,” schoolgirl way?), it may extenuate the at times seemingly needless nucleus of blood and tears. P. Wyndham Lewis 1915","sourceLink":"http://novel.tingroom.com/duanpian/2704/74318.html","bookId":1444,"book":{"id":1444,"title":"Tarr","description":"简介： This book was begun eight years ago; so I have not produced this disagreeable German for the gratification of primitive partisanship aroused by the war. On the other hand, having had him up my sleeve for so long, I let him out at this moment in the u...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2704","creation":"Aug 1, 2019 12:25:06 AM","modification":"Aug 1, 2019 12:25:06 AM"}}
