{"id":26025,"no":16,"title":"THE CHRISTIAN WORLD AND THE SECULARIST","content":"(1876.) The Christian World of the 1st inst. has another note on the article on “Some Muslim Laws and Beliefs.” As Mr. Foote responded to the first note on behalf of the Secularist, I, as the author of the obnoxious article, which was mainly mere compilation from the work of a Christian scholar and gentleman, may say a few words on my own behalf in reply to the second, which is as follows:— “A correspondent writes:—In your ‘Notes by the Way’ last week there is a painful, though not unseasonable, quotation from a writer on ‘Muslim Laws and Beliefs.’ This, as coming from a Secularist, is deplorable enough. It is very much more so that the late Viscount Amberley, a son of a veteran statesman, should in his ‘Analysis of Religious Belief,’ which might indeed more justly be termed ‘A Panegyric of all Heathen Beliefs, and a Travesty of that of the Christian,’ have given a like description of the paradise of the Koran, and should have sneeringly told us that the Christian Scriptures, in their pictures of the heavenly life, ‘strangely overlook this enjoyment’ of ‘ever virgins’ never growing old, who are to ‘supply the faithful with the pleasure of love’ (vide Vol. II., p. 200). This is but a specimen of the disdainful and derisive tone with which this writer, who at length leaves himself stranded in a region of the dreariest Atheism, continually speaks of that Book which what he terms ‘the illusions of our younger days’ might have taught him o respect.” I do not doubt that the quotation was painful to the Christian correspondent, since it is always painful to have our lifelong prejudices shocked by those who have never shared them, or who have attained freedom from their yoke. One might give not a few quotations from any number of the Christian World which would be very painful to a pious Muslim. Nor do I doubt that the quotation was not unseasonable, for quotations from the Secularist must always be seasonable in an influential Christian periodical, when they tend to expand the Christian narrowness, and show that there is much to be said in favor of other beliefs. And I admit that, like many other things coming from a Secularist, it must have been deplorable enough to a Christian suckled on the Bible, and assured in his unreflecting ignorance that it is the one true word of the three-in-one true god. But the correspondent finds it very much more deplorable that a son of a veteran statesman should agree with the Secularist—as if the sons of veteran statesmen were naturally expected to be sunk deeper than other persons in the prevailing superstition. The correspondent who, we may presume, has always been taught, and has never doubted, that all heathen beliefs are wholly devilish, and that the Christian belief is wholly divine, thinks that Viscount Amberley’s book is a panegyric of the former and a travesty of the latter. If the unfortunate correspondent had the courage and intelligence to enter upon a real analysis of religious belief, he would soon discover that he and his co-religionists have been all along travestying every form of what they call heathenism. With amusing simplicity he is astonished that Lord Amberley gives a like description of the paradise of the Kur-an to that which I gave in the Secularist, as if he could have been accurate in giving any other, when mine was drawn from one of the most careful and accurate of writers, the Oriental Englishman, unequalled in his knowledge of Arabic literature and life! Why, in the very week following the attack on the Secularist, the Christian World’s twin sister, the Literary World (perhaps incited thereto by its study of our vilified paper), showed that it had been reading or dipping into Lane, by an article on him under the queer title of “A Man of One Book,” he being distinguished for three—“The Manners and Customs of the Modem Egyptians,” the translation of the “Arabian Nights,” with its peerless notes, and the monumental “Arabic Lexicon”; and the said queerly-named article echoed the general praise of his thoroughness and accuracy, and repeated the statement of those who knew him, that he was a deeply pious man. I am not concerned with the defence of Lord Amberley, and shall therefore not follow further the correspondent’s remarks on his book, save to note that a man who says that any such writer “leaves himself stranded in a region of the dreariest Atheism,” proves himself by this one phrase utterly incompetent to study that word or understand its subject matter; and, as ignorant and incapable, had better confine himself to the Sunday-school, the Young Men’s Christian Association, the religious tea-meeting, and street-corner raving. It may be as well to say something on my own account, in addition to the vigorous remarks of Mr. Foote, in reply to the first note of the Christian World, and vindication of the passage it impugned. And first, as to the Book of Revelation, which claims to be prophetic, and stands in our Bible as the work of St. John the Divine. Luther, indeed, who was not afraid to pass an independent judgment, said, “I look upon the revelation as neither apostolic nor prophetic;” but it is received as both by our English Protestants, and continually referred to by them as the record of a genuine and authentic vision. But I assert, without fear of contradiction, that if they had never known it, and some missionary brought home an account of its marvels as belonging to the faith of some Polynesian islanders, they would be filled with wonder and compassion at the monstrous superstitions of those poor heathen barbarians. Yes, Exeter Hall and the readers and writers of the Christian World itself, would assuredly invoke help to enlighten the degraded idolaters who believed in a heaven whose God was to look upon like a jasper and a sardine; in the midst of whose throne, and round about whose throne, were four beasts—a lion, a calf, a man-faced monster, an eagle—each with six wings, and full of eyes before and behind and within; which beasts never rested day nor night from saying, “Holy, holy, holy, Lord God Almighty;” and which, moreover, worshipped a lamb with seven horns and seven eyes—a figment more extravagant than the many-headed and many-armed idols of India. And so with the other enormities of the Apocalypse. Our civilised gentlemen of the Christian World can only believe that they believe these things, because hallowed associations and unreflecting faith blind their judgment to the obvious absurdity of the imagery and the conspicuous non-fulfilment of the prophecy, which again and again claims to announce events then at hand, to come quickly. In the next place I assert that the everlasting monotonous singing of the praises of the lamb, the interminable senseless routine, is not a whit more spiritual, while infinitely less alluring, than the occupations of the Mohammedan Paradise. If it be answered that enlightened Christians have nobler ideas of heaven, I reply that such anticipations are not warranted by the New Testament, and that magnanimous Muslims have also nobler anticipations of paradise, for which there is warrant in the Kur-an. And while on the subject of spirituality, I may remark that the pure monotheism of the Muslim and the Jew is immensely more spiritual, as well as more rational, than the monotritheism of the Christian, which not only deifies a man, but juggles with a so-called mystery that cannot be expressed in words without self-contradiction, cannot be conceived in thought, and, by the confession of its own apologists, defies reason. As to the “hysterical buffoonery,” I have yet to learn that there is anything hysterical in a jolly burst of Rabelaisian laughter. And as to the “poor hollow mockery,” I can assure the writer in the Christian World that the mockery was quite rich, sound and genuine in relation to the Apocalypse of his idolised book and the popular Protestant Moody and Sankey heaven. (By the bye, can anyone inform us whether Mr. Sankey is really a Jew, and not a Christian Jew, as I have heard positively asserted on Hebrew authority?) As to the “blasphemous irreverence” and the “horrible and blasphemous invocation,” I deny the possibility of blasphemy where there is no belief. A man may blaspheme that which he accounts worthy of reverence, because in speaking evil of it he violates his own convictions and holiest feelings. But if for me there is no God, how can I blaspheme him? Speaking contemptuously of him, I but contemn nothing. If the writer in the Christian World were accused of blasphemy for reviling Jupiter and Venus, Brahma and Vishnu, Baal and Moloch, the Goddess of Reason and Mumbo Jumbo, he would reply, I cannot blaspheme false gods, meaning simply gods in whom he has no faith. Just so, I say that I cannot blaspheme the trinity-in-unity of the Christian, which to me is non-existent, absurd, impossible. It would be well for the writers and readers of the Christian World to ponder these things. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3220/87821.html","bookId":706,"book":{"id":706,"title":"Satires And Profanities","description":"简介： Believing as I do that James Thomson is, since Shelley, the most brilliant genius who has wielded a pen in the service of Freethought, I take a natural pride and pleasure in rescuing the following articles from burial in the great mausoleum of the pe...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3220","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
