{"id":23995,"no":1,"title":"Chapter 1","content":"During the dire reign of the terrific Robespierre, and in the dead of night, braving the cold, the darkness and the damps of December, some English passengers, in a small vessel, were preparing to glide silently from the coast of France, when a voice of keen distress resounded from the shore, imploring, in the French language, pity and admission. \\n\\n \\n\\n The pilot quickened his arrangements for sailing; the passengers sought deeper concealment; but no answer was returned. \\n\\n \\n\\n ‘O hear me!’ cried the same voice, ‘for the love of Heaven, hear me!’ \\n\\n \\n\\n The pilot gruffly swore, and, repressing a young man who was rising, peremptorily ordered every one to keep still, at the hazard of discovery and destruction. \\n\\n \\n\\n ‘Oh listen to my prayers!’ was called out by the same voice, with increased and even frightful energy; ‘Oh leave me not to be massacred!’ \\n\\n \\n\\n ‘Who’s to pay for your safety?’ muttered the pilot. \\n\\n \\n\\n ‘I will!’ cried the person whom he had already rebuffed, ‘I pledge myself for the cost and the consequence!’ \\n\\n \\n\\n ‘Be lured by no tricks;’ said an elderly man, in English; ‘put off immediately, pilot.’ \\n\\n \\n\\n The pilot was very ready to obey. \\n\\n \\n\\n The supplications from the land were now sharpened into cries of agony, and the young man, catching the pilot by the arm, said eagerly, ”Tis the voice of a woman! where can be the danger? Take her in, pilot, at my demand, and my charge!’ \\n\\n \\n\\n ‘Take her in at your peril, pilot!’ rejoined the elderly man. \\n\\n \\n\\n Rage had elevated his voice; the petitioner heard it, and called—screamed, rather, for mercy. \\n\\n \\n\\n ‘Nay, since she is but a woman, and in distress, save her, pilot, in God’s name!’ said an old sea officer. ‘A woman, a child, and a fallen enemy, are three persons that every true Briton should scorn to misuse.’ \\n\\n \\n\\n The sea officer was looked upon as first in command; the young man, therefore, no longer opposed, separated himself from a young lady with whom he had been conversing, and, descending from the boat, gave his hand to the suppliant. \\n\\n \\n\\n There was just light enough to shew him a female in the most ordinary attire, who was taking a whispering leave of a male companion, yet more meanly equipped. \\n\\n \\n\\n With trembling eagerness, she sprang into the vessel, and sunk rather than sat upon a place that was next to the pilot, ejaculating fervent thanks, first to Heaven, and then to her assistant. \\n\\n \\n\\n The pilot now, in deep hoarse accents, strictly enjoined that no one should speak or move till they were safely out at sea. \\n\\n \\n\\n All obeyed; and, with mingled hope and dread, insensible to the weather, and dauntless to the hazards of the sea, watchful though mute, and joyful though filled with anxiety, they set sail. \\n\\n \\n\\n In about half an hour, the grumbling of the pilot, who was despotic master of the boat, was changed into loud and vociferous oaths. \\n\\n \\n\\n Alarmed, the passengers concluded that they were chaced. They looked around,—but to no purpose; the darkness impeded examination. \\n\\n \\n\\n They were happily, however, mistaken; the lungs of the pilot had merely recovered their usual play, and his humour its customary vent, from a belief that all pursuit would now be vain. \\n\\n \\n\\n This proved the signal to general liberty of speech; and the young lady already mentioned, addressing herself, in a low voice, to the gentleman who had aided the Incognita, said, ‘I wonder what sort of a dulcinea you have brought amongst us! though, I really believe, you are such a complete knight-errant, that you would just as willingly find her a tawny Hottentot as a fair Circassian. She affords us, however, the vivifying food of conjecture,—the only nourishment of which I never sicken!—I am glad, therefore, that ’tis dark, for discovery is almost always disappointment.’ \\n\\n \\n\\n ‘She seems to be at prayers.’ \\n\\n \\n\\n ‘At prayers? She’s a nun, then, depend upon it. Make her tell us the history of her convent.’ \\n\\n \\n\\n ‘Why what’s all this, woman?’ said the pilot, in French, ‘are you afraid of being drowned?’ \\n\\n \\n\\n ‘No!’ answered she, in the same language, ‘I fear nothing now—it is therefore I am thankful!’ \\n\\n \\n\\n Retreating, then, from her rude neighbour, she gently approached an elderly lady, who was on her other side, but who, shrinking from her, called out, ‘Mr Harleigh, I shall be obliged to you if you will change places with me.’ \\n\\n \\n\\n ‘Willingly;’ he answered; but the young lady with whom he had been conversing, holding his coat, exclaimed, ‘Now you want to have all the stories of those monks and abbesses to yourself! I won’t let you stir, I am resolved!’ \\n\\n \\n\\n The stranger begged that she might not incommode any one; and drew back. \\n\\n \\n\\n ‘You may sit still now, Mr Harleigh,’ said the elderly lady, shaking herself; ‘I do very well again.’ \\n\\n \\n\\n Harleigh bit his lip, and, in a low voice, said to his companion, ‘It is strange that the facility of giving pain should not lessen its pleasure! How far better tempered should we all be to others, if we anticipated the mischief that ill humour does to ourselves!’ \\n\\n \\n\\n ‘Now are you such a very disciple of Cervantes,’ she replied, ‘that I have no doubt but your tattered dulcinea has secured your protection for the whole voyage, merely because old aunt Maple has been a little ill bred to her.’ \\n\\n \\n\\n ‘I don’t know but you are right, for nothing so uncontrollably excites resistance, as grossness to the unoffending.’ \\n\\n \\n\\n He then, in French, enquired of the new passenger, whether she would not have some thicker covering, to shelter her from the chill of the night; offering her, at the same time, a large wrapping coat. \\n\\n \\n\\n She thanked him, but declared that she was perfectly warm. \\n\\n \\n\\n ‘Are you so, faith?’ cried the elderly man already mentioned, ‘I wish, then, you would give me your receipt, Mistress; for I verily think that my blood will take a month’s thawing, before it will run again in my veins.’ \\n\\n \\n\\n She made no answer, and, in a tone somewhat piqued, he added, ‘I believe in my conscience those outlandish gentry have no more feeling without than they have within!’ \\n\\n \\n\\n Encreasing coldness and darkness repressed all further spirit of conversation, till the pilot proclaimed that they were halfway over the straits. \\n\\n \\n\\n A general exclamation of joy now broke forth from all, while the new comer, suddenly casting something into the sea, ejaculated, in French, ‘Sink, and be as nothing!’ And then, clasping her hands, added, ‘Heaven be praised, ’tis gone for ever!’ \\n\\n \\n\\n The pilot scolded and swore; every one was surprised and curious; and the elderly man plumply demanded, ‘Pray what have you thrown overboard, Mistress?’ \\n\\n \\n\\n Finding himself again unanswered, he rather angrily raised his voice, saying, ‘What, I suppose you don’t understand English now? Though you were pretty quick at it when we were leaving you in the lurch! Faith, that’s convenient enough!’ \\n\\n \\n\\n ‘For all I have been silent so long,’ cried the old sea officer, ‘it has not been for want of something to say; and I ask the favour that you won’t any of you take it ill, if I make free to mention what has been passing, all this time, in my mind; though it may rather have the air of a hint than a compliment; but as I owe to being as much in fault as yourselves, I hope you won’t be affronted at a little plain dealing.’ \\n\\n \\n\\n ‘You are mighty good to us, indeed, Sir!’ cried Mrs Maple, ‘but pray what fault have you to charge Me with, amongst the rest?’ \\n\\n \\n\\n ‘I speak of us in a body, Madam, and, I hope, with proper shame! To think that we should all get out of that loathsome captivity, with so little reverence, that not one amongst us should have fallen upon his knees, to give thanks, except just this poor outlandish gentlewoman; whose good example I recommend it to us all now to follow.’ \\n\\n \\n\\n ‘What, and so overturn the boat,’ said the elderly man, ‘that we may all be drowned for joy, because we have escaped being beheaded?’ \\n\\n \\n\\n ‘I submit to your better judgment, Mr Riley,’ replied the officer, ‘with regard to the attitude; and the more readily, because I don’t think that the posture is the chief thing, half the people that kneel, even at church, as I have taken frequent note, being oftener in a doze than in a fit of devotion. But the fear of shaking the boat would be but a poor reason to fear shaking our gratitude, which seems to me to want it abundantly. So I, for one, give thanks to the Author of all things!’ \\n\\n \\n\\n ‘You are a fine fellow, noble Admiral!’ cried Mr Riley, ‘as fine a fellow as ever I knew! and I honour you, faith! for I don’t believe there is a thing in the world that requires so much courage as to risk derision, even from fools.’ \\n\\n \\n\\n A young man, wrapped up in flannels, who had been undisguisedly enjoying a little sneering laugh, now became suddenly grave, and pretended not to heed what was passing. \\n\\n \\n\\n Mrs Maple protested that she could not bear the parade of saying her prayers in public. \\n\\n \\n\\n Another elderly lady, who had hitherto seemed too sick to speak, declared that she could not think of giving thanks, till she were sure of being out of danger. \\n\\n \\n\\n And the young lady, laughing immoderately, vowed that she had never seen such a congress of quizzes in her life; adding, ‘We want nothing, now, but a white foaming billow, or a shrill whistle from Boreas, to bring us all to confession, and surprise out our histories.’ \\n\\n \\n\\n ‘Apropos to quizzes,’ said Mr Riley, addressing the hitherto silent young man, ‘how comes it, Mr Ireton, that we have not had one word from you all this time?’ \\n\\n \\n\\n ‘What do you mean by apr?pos, Sir?’ demanded the young man, somewhat piqued. \\n\\n \\n\\n ‘Faith, I don’t very well know. I am no very good French dictionary. But I always say apr?pos, when I am at a loss how to introduce any thing. Let us hear, however, where you have been passing your thoughts all this time. Are you afraid the sea should be impregnated with informers, instead of salt, and so won’t venture to give breath to an idea, lest it should be floated back to Signor Robespierre, and hodge-podged into a conspiracy?’ \\n\\n \\n\\n ‘Ay, your thoughts, your thoughts! give us your thoughts, Ireton!’ cried the young lady, ‘I am tired to death of my own.’ \\n\\n \\n\\n ‘Why, I have been reflecting, for this last hour or two, what a singular circumstance it is, that in all the domains that I have scampered over upon the continent, I have not met with one young person who could hit my fancy as a companion for life.’ \\n\\n \\n\\n ‘And I, Sir, think,’ said the sea officer, turning to him with some severity, ‘that a man who could go out of old England to chuse himself a wife, never deserves to set foot on it again! If I knew any worse punishment, I should name it.’ \\n\\n \\n\\n This silenced Mr Ireton; and not another word was uttered, till the opening of day displayed the British shore. \\n\\n \\n\\n The sea officer then gave a hearty huzza, which was echoed by Harleigh; while Riley, as the light gleamed upon the old and tattered garments of the stranger, burst into a loud laugh, exclaiming, ‘Faith, I should like to know what such a demoiselle as this should come away from her own country for? What could you be afraid of, hay! demoiselle?’— \\n\\n \\n\\n She turned her head from him in silence. Harleigh enquired, in French, whether she had escaped the general contagion, from which almost all in the boat had suffered, of sickness. \\n\\n \\n\\n She cheerfully replied, Yes! She had escaped every evil! \\n\\n \\n\\n ‘The demoiselle is soon contented,’ said Riley; ‘but I cannot for my life make out who she is, nor what she wants. Why won’t you tell us, demoiselle? I should like to know your history.’ \\n\\n \\n\\n ‘Much obliged for the new fellow traveller you have given us, Mr Harleigh!’ said Mrs Maple, contemptuously examining her; ‘I have really some curiosity myself, to be informed what could put into such a body’s mind as that, to want to come over to England.’ \\n\\n \\n\\n ‘The desire of learning the language, I hope!’ cried Harleigh, ‘for I should be sorry that she knew it already!’ \\n\\n \\n\\n ‘I wish, at least, she would tell us,’ said the young lady, ‘how she happened to find out our vessel just at the moment we were sailing.’ \\n\\n \\n\\n ‘And I should be glad to discover,’ cried Riley, ‘why she understands English on and off at her pleasure, now so ready, and now answering one never a word.’ \\n\\n \\n\\n The old sea officer, touching his hat as he addressed her, said, ‘For my part, Madam, I hope the compliment you make our country in coming to it, is that of preferring good people to bad; in which case every Englishman should honour and welcome you.’ \\n\\n \\n\\n ‘And I hope,’ cried Harleigh, while the stranger seemed hesitating how to answer, ‘that this patriotic benevolence is comprehended; if not, I will attempt a translation.’ \\n\\n \\n\\n ‘I speak French so indifferently, which, however, I don’t much mind,’ cried the Admiral, ‘that I am afraid the gentlewoman would hardly understand me, or else I would translate for myself.’ \\n\\n \\n\\n The stranger now, with a strong expression of gratitude, replied in English, but with a foreign accent, ‘It is only how to thank you I am at a loss, Sir; I understand you perfectly.’ \\n\\n \\n\\n ‘So I could have sworn!’ cried Riley, with a laugh, ‘I could have sworn that this would be the turn for understanding English again! And you can speak it, too, can you, Mistress?’ \\n\\n \\n\\n ‘And pray, good woman,’ demanded Mrs Maple, staring at her, ‘how came you to learn English? Have you lived in any English family? If you have, I should be glad to know their names.’ \\n\\n \\n\\n ‘Ay, their names! their names!’ was echoed from Mrs Maple by her niece. \\n\\n \\n\\n The stranger looked down, and stammered, but said nothing that could distinctly be heard. \\n\\n \\n\\n Riley, laughing again, though provoked, exclaimed, ‘There! now you ask her a question, she won’t comprehend a word more! I was sure how ’twould be! They are clever beings, those French, they are, faith! always playing fools’ tricks, like so many monkies, yet always lighting right upon their feet, like so many cats!’ \\n\\n \\n\\n ‘You must resign your demoiselle, as Mr Riley calls her, for a heroine;’ whispered the young lady to Mr Harleigh. ‘Her dress is not merely shabby; ’tis vulgar. I have lost all hope of a pretty nun. She can be nothing above a house-maid.’ \\n\\n \\n\\n ‘She is interesting by her solitary situation,’ he answered, ‘be she what she may by her rank: and her voice, I think, is singularly pleasing.’ \\n\\n \\n\\n ‘Oh, you must fall in love with her, I suppose, as a thing of course. If, however, she has one atom that is native in her, how will she be choaked by our foggy atmosphere!’ \\n\\n \\n\\n ‘And has our atmosphere, Elinor, no purifying particles, that, in defiance of its occasional mists, render it salubrious?’ \\n\\n \\n\\n ‘Oh, I don’t mean alone the foggy air that she must inhale; but the foggy souls whom she must see and hear. If she have no political bias, that sets natural feelings aside, she’ll go off in a lethargy, from ennui, the very first week. For myself I confess, from my happiness in going forth into the world at this sublime juncture, of turning men into infants, in order to teach them better how to grow up, I feel as if I had never awaked into life, till I had opened my eyes on that side of the channel.’ \\n\\n \\n\\n ‘And can you, Elinor, with a mind so powerful, however—pardon me!—wild, have witnessed....’ \\n\\n \\n\\n ‘Oh, I know what you mean!—but those excesses are only the first froth of the cauldron. When once ’tis skimmed, you will find the composition clear, sparkling, delicious!’ \\n\\n \\n\\n ‘Has, then, the large draught which, in a two years’ residence amidst that combustion, you have, perforce, quaffed, of revolutionary beverage, left you, in defiance of its noxious qualities, still thus....’ He hesitated. \\n\\n \\n\\n ‘Inebriated, you would say, Albert,’ cried she, laughing, ‘if you blushed not for me at the idea. But, in this one point, your liberality, though matchless in every other, is terribly narrowed by adhesion to old tenets. You enjoy not therefore, as you ought, this glorious epoch, that lifts our minds from slavery and from nothingness, into play and vigour; and leaves us no longer, as heretofore, merely making believe that we are thinking beings.’ \\n\\n \\n\\n ‘Unbridled liberty, Elinor, cannot rush upon a state, without letting it loose to barbarism. Nothing, without danger, is suddenly unshackled: safety demands control from the baby to the despot.’ \\n\\n \\n\\n ‘The opening essays here,’ she replied, ‘have certainly been calamitous: but, when all minor articles are progressive, in rising to perfection, must the world in a mass alone stand still, because its amelioration would be costly? Can any thing be so absurd, so preposterous, as to seek to improve mankind individually, yet bid it stand still collectively? What is education, but reversing propensities; making the idle industrious, the rude civil, and the ignorant learned? And do you not, for every student thus turned out of his likings, his vagaries, or his vices, to be new modelled, call this alteration improvement? Why, then, must you brand all similar efforts for new organizing states, nations, and bodies of society, by that word of unmeaning alarm, innovation?’ \\n\\n \\n\\n ‘To reverse, Elinor, is not to new model, but to destroy. This education, with which you illustrate your maxims, does it begin with the birth? Does it not, on the contrary, work its way by the gentlest gradations, one part almost imperceptibly preparing for another, throughout all the stages of childhood to adolescence, and of adolescence to manhood? If you give Homer before the Primer, do you think that you shall make a man of learning? If you shew the planetary system to the child who has not yet trundled his hoop, do you believe that you will form a mathematician? And if you put a rapier into his hands before he has been exercised with foils,—what is your guarantee for the safety of his professor?’ \\n\\n \\n\\n Just then the stranger, having taken off her gloves, to arrange an old shawl, in which she was wrapt, exhibited hands and arms of so dark a colour, that they might rather be styled black than brown. \\n\\n \\n\\n Elinor exultingly drew upon them the eyes of Harleigh, and both taking, at the same instant, a closer view of the little that was visible of the muffled up face, perceived it to be of an equally dusky hue. \\n\\n \\n\\n The look of triumph was now repeated. \\n\\n \\n\\n ‘Pray, Mistress,’ exclaimed Mr Riley, scoffingly fixing his eyes upon her arms, ‘what part of the world might you come from? The settlements in the West Indies? or somewhere off the coast of Africa?’ \\n\\n \\n\\n She drew on her gloves, without seeming to hear him. \\n\\n \\n\\n ‘There!’ said he, ‘now the demoiselle don’t understand English again! Faith, I begin to be entertained with her. I did not like it at first.’ \\n\\n \\n\\n ‘What say you to your dulcinea now, Harleigh?’ whispered Elinor; ‘you will not, at least, yelep her the Fair Maid of the Coast.’ \\n\\n \\n\\n ‘She has very fine eyes, however!’ answered he, laughing. \\n\\n \\n\\n The wind just then blowing back the prominent borders of a French night-cap, which had almost concealed all her features, displayed a large black patch, that covered half her left cheek, and a broad black ribbon, which bound a bandage of cloth over the right side of her forehead. \\n\\n \\n\\n Before Elinor could utter her rallying congratulations to Harleigh, upon this sight, she was stopt by a loud shout from Mr Riley; ‘Why I am afraid the demoiselle has been in the wars!’ cried he. ‘Why, Mistress, have you been trying your skill at fisty cuffs for the good of your nation? or only playing with kittens for your private diversion?’ \\n\\n \\n\\n ‘Now, then, Harleigh,’ said Elinor, ‘what says your quixotism now? Are you to become enamoured with those plaisters and patches, too?’ \\n\\n \\n\\n ‘Why she seems a little mangled, I confess; but it may be only by scrambling from some prison.’ \\n\\n \\n\\n ‘Really, Mr Harleigh,’ said Mrs Maple, scarcely troubling herself to lower her voice as, incessantly, she continued surveying the stranger, ‘I don’t think that we are much indebted to you for bringing us such company as this into our boat! We did not pay such a price to have it made a mere common hoy. And without the least enquiry into her character, too! without considering what one must think of a person who could look out for a place, in a chance vessel, at midnight!’ \\n\\n \\n\\n ‘Let us hope,’ said Harleigh, perceiving, by the down-cast eyes of the stranger, that she understood what passed, ‘that we shall not make her repent her choice of an asylum.’ \\n\\n \\n\\n ‘Ah! there is no fear!’ cried she, with quickness. \\n\\n \\n\\n ‘Your prepossession, then, is, happily, in our favour?’ \\n\\n \\n\\n ‘Not my prepossession, but my gratitude!’ \\n\\n \\n\\n ‘This is true practical philosophy, to let the sum total of good outbalance the detail, which little minds would dwell upon, of evil.’ \\n\\n \\n\\n ‘Of evil! I think myself at this moment the most fortunate of human beings!’ \\n\\n \\n\\n This was uttered with a sort of transport that she seemed unable to control, and accompanied with a bright smile, that displayed a row of beautifully white and polished teeth. \\n\\n \\n\\n Riley now, again heartily laughing, exclaimed, ‘This demoiselle amuses me mightily! she does, faith! with hardly a rag to cover her this cold winter’s night; and on the point of going to the bottom every moment, in this crazy little vessel; with never a friend to own her body if she’s drowned, nor an acquaintance to say a word to before she sinks; not a countryman within leagues, except our surly pilot, who grudges her even life-room, because he’s afraid he shan’t be the better for her: going to a nation where she won’t know a dog from a cat, and will be buffetted from pillar to post, if she don’t pay for more than she wants; with all this, she is the most fortunate of human beings! Faith, the demoiselle is soon pleased! She is, faith! But why won’t you give me your receipt, Mistress, for finding all things so agreeable?’ \\n\\n \\n\\n ‘You would be sorry, Sir, to take it!’ \\n\\n \\n\\n ‘I fear, then,’ said Harleigh, ‘it is only past suffering that bestows this character of bliss upon simple safety?’ \\n\\n \\n\\n ‘Pray, Mr Riley,’ cried Mrs Maple, ‘please to explain what you mean, by talking so freely of our all going to the bottom? I should be glad to know what right you had to make me come on board the vessel, if you think it so crazy?’ \\n\\n \\n\\n She then ordered the pilot to use all possible expedition for putting her on shore, at the very first jut of land; adding, ‘you may take the rest of the company round, wherever you chuse, but as to me, I desire to be landed directly.’ \\n\\n \\n\\n She could not, however, prevail; but, in the panic which had seized her, she grew as incessant in reproach as in alarm, bitterly bewailing the moment that she had ever trusted herself to such an element, such a vessel, and such guides. \\n\\n \\n\\n ‘See,’ said Harleigh, in a low voice to the stranger, ‘how little your philosophy has spread; and how soon every evil, however great, is forgotten when over, to aggravate the smallest discomfort that still remains! What recompence, or what exertion would any one of us have thought too great, for obtaining a place in this boat only a few hours ago! Yet you, alone, seem to have discovered, that the true art of supporting present inconvenience is to compare it with past calamity,—not with our disappointed wishes.’ \\n\\n \\n\\n ‘Calamity!’ repeated she with vivacity, ‘ah! if once I reach that shore,—that blessed shore! shall I have a sorrow left?’ \\n\\n \\n\\n ‘The belief that you will not,’ said he, smiling, ‘will almost suffice for your security, since, certainly, half our afflictions are those which we suffer through anticipation.’ \\n\\n \\n\\n There was time for nothing more; the near approach to land seeming to fill every bosom, for the instant, with sensations equally enthusiastic. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1418/42514.html","bookId":1389,"book":{"id":1389,"title":"The Wanderer 徘徊者","description":"简介： During the dire reign of the terrific Robespierre, and in the dead of night, braving the cold, the darkness and the damps of December, some English passengers, in a small vessel, were preparing to glide silently from the coast of France, when a voice...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1418","creation":"Aug 1, 2019 12:24:59 AM","modification":"Aug 1, 2019 12:24:59 AM"}}
