{"id":24042,"no":48,"title":"Chapter 48","content":"Experience, the mother of caution, now taught Juliet explicitly to make known to her new chief, that she had no view to learn the art of mantua-making as a future trade, or employment; but simply desired to work at it in such details, as a general knowledge of the use of the needle might make serviceable and expeditious: no premium, therefore, could be expected by the mistress; and the work-woman would be at liberty to continue, or to renounce her engagement, from day to day. \\n\\n \\n\\n This agreement offered to her ideas something which seemed like an approach to the self-dependence, that she had so earnestly coveted: she entered, therefore, upon her new occupation with cheerfulness and alacrity, and with a diligence to which the hope, by being useful, to become necessary, gave no relaxation. \\n\\n \\n\\n The business, by this scrupulous devotion to its interests, was forwarded with such industry and success, that she soon became the open and decided favourite of the mistress whom she served; and who repaid her exertions by the warmest praise, and proposed her as a pattern to the rest of the sewing sisterhood. \\n\\n \\n\\n This approbation could not but cheer the toil of one whose mind, like that of Juliet, sought happiness, at this moment, only from upright and blameless conduct. She was mentally, also, relieved, by the local change of situation. She was now employed in a private apartment; and, though surrounded by still more fellow-work-women than at Miss Matson’s, she was no longer constrained to remain in an open shop, in opposition alike to her inclinations and her wishes of concealment; no longer startled by the continual entrance and exit of strangers; nor exposed to curious enquirers, or hardy starers; and no longer fatigued by the perpetual revision of goods. She worked in perfect quietness, undisturbed and uninterrupted; her mistress was civil, and gave her encouragement; her fellow-semptresses were unobservant, and left her to her own reflexions. \\n\\n \\n\\n It is not, however, in courts alone that favour is perilous; in all circles, and all classes, from the most eminent to the most obscure, the ‘Favourite has no friend1!’ The praises and the comparisons, by which Mrs Hart hoped to stimulate her little community to emulation, excited only jealousy, envy, and ill will; and a week had not elapsed, in this new and short tranquillity, before Juliet found that her superiour diligence was regarded, by her needle-sisterhood, as a mean artifice ‘to set herself off to advantage at their cost.’ Sneers and hints to this effect followed every panegyric of Mrs Hart; and robbed approbation of its pleasure, though they could not of its value. \\n\\n \\n\\n Chagrined by a consequence so unpleasant, to an industry that demanded fortitude, not discouragement; Juliet now felt the excess of her activity relax; and soon experienced a desire, if not a necessity, to steal some moments from application, for retirement and for herself. \\n\\n \\n\\n Here, again, she found the mischief to which ignorance of life had laid her open. The unremitting diligence with which she had begun her new office, had advanced her work with a rapidity, that made the smallest relaxation cause a sensible difference in its progress: and Mrs Hart, from first looking disappointed, asked next, whether nothing more were done? and then observed, how much quicker business had gone on the first week. In vain Juliet still executed more than all around her; the comparison was never made there, where it might have been to her advantage; all reference was to her own setting out; and she was soon taught to forgive the displeasure which, so inadvertently, she had excited, when she saw the claims to which she had made herself liable, by an incautious eagerness of zeal to reward, as well as earn, the maintenance which she owed to Mrs Hart. \\n\\n \\n\\n Alas, she thought, with what upright intentions may we be injudicious! I have thrown away the power of obliging, by too precipitate an eagerness to oblige! I retain merely that of avoiding to displease, by my most indefatigable application! All I can perform seems but a duty, and of course; all I leave undone, seems idleness and neglect. Yet what is the labour that never requires respite? What the mind, that never demands a few poor unshackled instants to itself? \\n\\n \\n\\n From this time, the little pleasure which she had been able to create for herself, from the virtue of her exertions, was at an end: to toil beyond her fellow-labourers, was but to provoke ill will; to allow herself any repose, was but to excite disapprobation. Hopeless, therefore, either way, she gave, with diligence, her allotted time to her occupation, but no more: all that remained, she solaced, by devoting to her pen and Gabriella, with whom her correspondence,—her sole consolation,—was unremitting. \\n\\n \\n\\n This unaffected conduct had its customary effect; it destroyed at once the too hardly earned favour of Mrs Hart, and the illiberal, yet too natural enmity of her apprentices; and, in the course of a very few days, Juliet was neither more esteemed, nor more censured, than any of her sisters of the sewing tribe. \\n\\n \\n\\n With the energy, however, of her original wishes and efforts, died all that could reconcile her to this sort of life. The hope of pleasing, which alone could soften its hardships, thus forcibly set aside, left nothing in its place, but calmness without contentment; dulness without serenity. \\n\\n \\n\\n Experience is not more exclusively the guide of our judgment, than comparison is the mistress of our feelings. Juliet now also found that, local publicity excepted, there was nothing to prefer in her new to her former situation; and something to like less. The employment itself was by no means equally agreeable for its disciples. The taste and fancy, requisite for the elegance and variety of the light work which she had quitted; however ineffectual to afford pleasure when called forth by necessity, rendered it, at least, less irksome, than the wearying sameness of perpetual basting, running, and hemming. Her fellow-labourers, though less pert and less obtrusive than those which she had left, had the same spirit for secret cabal, and the same passion for frolic and disguise; and also, like those, were all prattle and confidential sociability, in the absence of the mistress; all sullenness and taciturnity, in her presence. What little difference, therefore, she found in her position, was, that there she had been disgusted by under-bred flippancy; here, she was deadened by uninteresting monotony; and that there, perpetual motion, and incessant change of orders, and of objects, affected her nerves; while here, the unvarying repetition of stitch after stitch, nearly closed in sleep her faculties, as well as her eyes. \\n\\n \\n\\n The little stipend which, by agreement, she was paid every evening, though it occasioned her the most satisfactory, by no means gave her the most pleasant feeling, of the day. However respectable reason and justice render pecuniary emolument, where honourably earned; there is a something indefinable, which stands between spirit and delicacy, that makes the first reception of money in detail, by those not brought up to gain it, embarrassing and painful. \\n\\n \\n\\n During this tedious and unvaried period, if some minutes were snatched from fatiguing uniformity, it was only by alarm and displeasure, through the intrusion of Sir Lyell Sycamore; who, though always denied admission to herself, made frequent, bold, and frivolous pretences for bursting into the workroom. At one time, he came to enquire about a gown for his sister, of which Mrs Hart had never heard; at another, to look at a trimming for which she had had no commission; and at a third, to hurry the finishing of a dress, which had already been sent home. The motive to these various mock messages, was too palpable to escape even the most ordinary observation; yet though the perfect conduct, and icy coldness of Juliet, rescued her from all evil imputation amongst her companions, she saw, with pique and even horrour, that they were insufficient to repress the daring and determined hopes and expectations of the licentious Baronet; with whom the unexplained hint of Sir Jaspar had left a firm persuasion, that the fair object of his views more than returned his admiration; and waited merely for a decent attack, or proper offers, to acknowledge her secret inclinations. \\n\\n \\n\\n Juliet, however shocked, could only commit to time her cause, her consistency, her vindication. \\n\\n \\n\\n Three weeks had, in this manner, elapsed, when the particular business for which Mrs Hart had wanted an odd hand was finished; and Juliet, who had believed that her useful services would keep her employed at her own pleasure, abruptly found that her occupation was at an end. \\n\\n \\n\\n Here again, the wisdom of experience was acquired only by distress. The pleasure with which she had considered herself free, because engaged but by the day, was changed into the alarm of finding herself, from that very circumstance, without employment or home; and she now acknowledged the providence of those ties, which, from only feeling their inconvenience, she had thought oppressive and unnecessary. The established combinations of society are not to be judged by the personal opinions, and varying feelings, of individuals; but by general proofs of reciprocated advantages. If the needy helper require regular protection, the recompensing employer must claim regular service; and Juliet now saw, that though in being contracted but by the day, she escaped all continued constraint, and was set freshly at liberty every evening; she was, a stranger to security, subject to dismission, at the mercy of accident, and at the will of caprice. \\n\\n \\n\\n Thus perplexed and thus helpless, she applied to Mrs Hart, for counsel how to obtain immediate support. Gratified by the application, Mrs Hart again recommended her as a pattern to the young sisterhood; and then gave her advice, that she should bind herself, either to some milliner or some mantua-maker, as a journey-woman for three years. \\n\\n \\n\\n Painfully, again, Juliet attained further knowledge of the world, in learning the danger of asking counsel; except of the candid and wise, who know how to modify it by circumstances, and who will listen to opposing representations. \\n\\n \\n\\n Mrs Hart, from the moment that Juliet declined to be guided wholly by her judgment, lost all interest in her young work-woman’s distresses. ‘If people won’t follow advice,’ she said, ”tis a sign they are not much to be pitied.’ Vainly Juliet affirmed, that reasons which she could not explain, put it out of her power to take any measure so decisive; that, far from fixing her own destiny for three years, she had no means to ascertain, or scarcely even to conjecture, what it might be in three days; or perhaps in three hours; although in the interval of suspense, she was not less an object for present humanity, from the incertitude of what either her wants or her abundance might be in future; vainly she reasoned, vainly she pleaded. Mrs Hart always made the same reply: ‘If people won’t follow advice, ’tis a sign they are not much to be pitied.’ \\n\\n \\n\\n In consequence of this maxim, Juliet next heard, that the small room and bed which she occupied, were wanted for another person. \\n\\n \\n\\n Alas! she thought, how long must we mingle with the world, ere we learn how to live in it! Must we demand no help from the understandings of others, unless we submit to renounce all use of our own? \\n\\n \\n\\n These reflections soon led her to hit upon the only true medium, for useful and safe general intercourse with the mass of mankind: that of avowing embarrassments, without demanding counsel; and of discussing difficulties, and gathering opinions, as matters of conversation; but always to keep in mind, that to ask advice, without a predetermination to follow it, is to call for censure, and to risk resentment. \\n\\n \\n\\n Thus died away in Juliet the short joy of freedom from the controul of positive engagements. \\n\\n \\n\\n Such freedom, she found, was but a source of perpetual difficulty and instability. She had the world to begin again; a new pursuit to fix upon; new recommendations to solicit; and a new dwelling to seek. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1418/42577.html","bookId":1389,"book":{"id":1389,"title":"The Wanderer 徘徊者","description":"简介： During the dire reign of the terrific Robespierre, and in the dead of night, braving the cold, the darkness and the damps of December, some English passengers, in a small vessel, were preparing to glide silently from the coast of France, when a voice...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1418","creation":"Aug 1, 2019 12:24:59 AM","modification":"Aug 1, 2019 12:24:59 AM"}}
