{"id":24070,"no":76,"title":"Chapter 76","content":"Thus, in beautiful scenery, and meditative resignation, with outward quiet, though by no means with internal tranquillity, Juliet had passed about a week, when the wife of the farmer broke rudely into the cottage; bearing in her hand the bonnet of Debby Dyson, which she flung scornfully upon a table. \n \n Angrily, then, reproaching Juliet that she had caused Bet to be taken for that bold hussy, by the higler, she demanded back the exchanged bonnet; declaring, that the girl should never wear one again, to the longest day that she had to live, rather than dress herself up in any thing of Debby Dyson’s. \n \n Turning next to the old cottager, she added, that a good mother would do well not to keep a person used to such light company under her roof; unless she had a mind to bring her daughters-in-law to ruin. \n \n Then, snatching up her girl’s bonnet, she bustled away to look after her evening’s milking; roughly refusing to hearken to any sort of explanation from Juliet, and saying that she never knew any good come of listening to talking; which was no better than idling away time. \n \n Juliet remained confounded; while the tender old cottager shed tears, saying that she had never before had so pretty a companion in her life. But Juliet would not tempt the good woman to defy the persons upon whom her children chiefly depended; and, once more, therefore, she was reduced to make up her little packet. \n \n She entreated of the cottager that, if a letter came for her to the farm, it might be kept till she sent her direction; then doubled the pay of all that she owed for board and lodging; and, kindly taking leave of the old dame, who wept bitterly at the parting; quitted the cottage; and again, in search of a new asylum, became a Wanderer. \n \n Which way to turn, she made no enquiry, wholly ignorant what choice might bring security. \n \n It was the end of August, and still not more than six o’clock in the afternoon. She avoided the high road, in the fear of some unfortunate encounter, and went down a pleasant looking lane; purposing to proceed as far, and as fast, as she could go, while it was yet light; and then to enter some new humble dwelling. \n \n The evening was serene and warm, and occasional openings, through the hedges on either side, presented views so picturesque, that, had her mind been more at ease, they would have rendered her walk delightful. \n \n She crossed various corn-fields, and beautiful meadows; but met with no cottage from which some lounging labourer did not frighten her; till, at length, overtaken by the dusk of the evening, she was fain to turn back, and seek, with whatever apprehension, some lodging, for the night, upon the public road. \n \n But to do this was no longer easy. She mistook what she thought was her direction, and, instead of arriving at the road, found herself upon a broad, open, dreary heath. \n \n She endeavoured to discover the track of some carriage, and succeeded; and followed the mark, till she thought that she perceived a cottage. \n \n She hastened towards it, with all the speed that her wearied limbs would permit; but the expected habitation proved merely a group of Pollards. \n \n She would then have recovered the wheel-track; but the moon became suddenly clouded, a general darkness overspread the face of the country around, and she could discover no kind of path. \n \n She now grew apprehensive that she should pass the night in the open air; with not a human being within hearing, nor any house, nor any succour within reach. What she might have to dread she knew not; but, in a situation so wildly solitary, the very ignorance of what there might be to fear, was intimidating, nay, awful. \n \n The darkness encreased; cautiously and slowly she went on; starting at every breeze, and in continual terrour of meeting some unknown mischief. \n \n She wandered thus for some hours, now sinking into marshy ground, now wounded by rude stones, now upon a soft, smooth plain, and now stung or torn by bushes, nettles, and briars; till she concluded it to be about midnight. A light wind then arose, the clouds were dispersed; and the moon, which, though upon the wane, afforded a gentle, melancholy light, shewed her that she was once again in the midst of the New Forest. \n \n Few sights could have been less welcome; what already she had suffered, and, far more, what she had apprehended, filled her with terrour; and her imagination was fearfully at work, now to bring her to the hut which she had so suspiciously fled; now to the encounter of disorderly young assailants, with no Dash for her protection; now to the attack of lurking thieves, and strolling vagabonds; and now to the danger of being bewildered and lost in the mazes of the Forest. \n \n The last of these evils soon ceased to be a mere phantasm of fear; the wind no sooner was calmed than the moon again was obscured, and all around her was darker, and therefore more tremendous than ever. \n \n She continued to move on, though without knowing whether she were advancing or retrograding. But, ere long, her walk became embarrassed and difficult; her progress was every way obstructed; and her retreat at the same time impeded; and she found herself in a thick wood, of which the deep hanging boughs continually annoyed her face and her limbs; while the unscythed grass, the growth of ages, entangled her feet, and made every step a labour. \n \n Wearied and dejected, she leaned against a tree, and determined to make no further attempt to proceed, till some gleam of dawn should direct her way. \n \n She had not remained long in this position of despondence, ere she discerned, through the trees, at a considerable distance, a dim light. \n \n She concluded that this must proceed from some dwelling; and, feeling instantly revived, re-commenced her journey: yet, presently, she stopt and hesitated,—it might emit from the hut! In the dead of the night there was little probability that any common cottagers would require a light. \n \n Discomfited, discouraged, she again leaned against a tree. \n \n Yet some one might be ill; and the chamber of sickness and danger could no more, in the cottage, than in the palace, be consigned to darkness. She determined, therefore, to approach the spot, and, at break of day, to examine the premises; certain she could not ever mistake, or ever forget, the situation of the hut. \n \n She went forward. \n \n The light, in a few moments, disappeared; but she was not, therefore, led to consider it as a Will with the Wisp, to beguile her to some illusion; for, ere it vanished, it displayed, in passing sideways, a view of a cottage double or treble the length of the dreaded hut. \n \n This was a sight truly consoling; yet, though it happily removed the most terrible of her fears, it awakened new perplexity. The light had been evidently without doors: the suggestion, therefore, of a sick chamber proved unfounded. Yet what, in the middle of the night, could replace it, that was natural, and free from suspicion of evil? \n \n Nevertheless, she moved on; seeking to guide herself by the recollection of the spot which she had transiently seen; till she was startled by a murmuring of human voices. \n \n But for the alarm left upon her mind, by the adventure of the hut, and the pursuit of the wood-cutters, this would have been a sound in which her ears would have rejoiced, as the fore-runner of succour and of safety; for, till then, she had always connected the idea of rusticity with innocence, and of rural life with felicity. But now, she had fatally learnt, that no class, and no station, appropriatively merit trust; and that the poor, like the rich, the humble, like the proud, can only by principle be worthy of confidence: whether that principle be the happy inherent growth of favouring Providence; or the fruit of religion, and cultivated virtue. \n \n But fear and incertitude, though they slackened, did not long stop her progress: the terrour of her lonely situation pointed out to her, indeed, the danger of falling into evil hands; yet peremptorily, at the same time, urged her to seek almost any protection, that might rescue her from the vague horrours of this dark and tremendous solitude. It was, at least, possible that these might be the voices of some unfortunate travellers, belated, or lost, like herself, in the Forest. On, therefore, she glided, till she distinguished three different tones, all of which were male, but none of which sounded either youthful or gay. They spoke so low, that not a word reached her ears; nor could she have caught even a sound, but for the total stillness of the air. That they spoke in whispers, therefore, was certain: Was it from fear? Was it from guilt? \n \n The doubt sufficed to check all project of addressing them; but, as she meant to retreat, she trod upon a broken bough of a tree, which made a crackling noise under her feet, that, she had reason to believe, was heard by the interlocutors, as it was followed by profound silence. \n \n She was now forced to remain immovable; for she felt herself entangled in some of the branches of the bough, and feared that any attempt to dissembarrass herself might cause a new commotion, and point out her position. \n \n She soon became but too certain that she had been heard; for the light re-appeared, and she was sufficiently near to observe, that it had been produced by a dark lanthorn, which she now saw turned round, by a man who was evidently seeking to discover whence the noise made by the bough had issued: she saw, also, that he had two companions; but what was her shock when, presently, in one of them, she perceived the master of the hut! \n \n She now gave herself up as lost! Lost alike from his fear of detection, and his vengeance for her escape. To run away was impossible; she could find no path; she could not even venture to stir a step, lest she should betray her concealment. \n \n They searched, for some time, in different directions; two of them then approached so nearly to the spot upon which she was standing, saying, to each other, that they were sure the sound came from that quarter, that she almost fainted with excess of terrour. But they soon turned off another way; one of them averring that the noise was only from some windfall; and the hut-man replying, in a coarse bass voice, that, if any body were watching, ’twas well they had come no sooner; for he’d defy the sharpest eye living to give a guess, now, at what they had been about. \n \n In this terrible interval, the door of the habitation, of which she had already had a glimpse, was opened by a female; who, depositing a candle upon the threshold, ran up to one of the men, with whom she conversed for a few minutes; after which, saying ‘Good night!’ she re-entered the house; while the men, all three repeating ‘Good night!’ trudged away, and were soon out of hearing. \n \n Juliet now conceived a hope, that a female, left, probably, alone, might, either through kindness or through interest, be made a friend. She disengaged herself, therefore, from her impediments, and gently tapped at the door. \n \n It was immediately opened by the woman, who said, ‘Why now, dear me, what have a forgot?’ but who no sooner saw a stranger, than she screamed aloud, ‘La be good unto me! what been ye come for here, at such an untoward time o’night as this be?’ while some children who were in bed, and suddenly awakened, jumping upon the ground, clang round their mother, and began crying piteously. \n \n Juliet, more affrighted than themselves, uttered the softest petition, for a few hours’ refuge from the dreariness of travelling by night. The woman, then, casting up her hands in wonder, exclaimed, ‘Good la! be you only no other but the good gentlewoman that was so koind to my little dearies?’ \n \n The children, recollecting her at the same moment, loosened their mother to throw their little arms around their guest; skipping and rejoicing, and crying, ‘O dood ady! dood ady! it’s dood ady!’ \n \n This, indeed, was a moment of joy to Juliet, such as life, even at its best periods, can but rarely afford. From fears the most horrible of unknown dangers; and from fatigue nearly insupportable, she found herself suddenly welcomed by trusting kindness. All her dread and scruples, with respect to the Salisbury turnpike hostess, or to any previous reports, were, she now saw, groundless; and she delightedly felt herself in the bosom of security, while encircled in the arms of affectionate and unsuspicious innocence. \n \n The good woman uncovered her hot embers, and put on some fresh wood, to restore the weary traveller from the chill of the night: and brought out of her cupboard a slice of bacon, and the end of a brown loaf of bread: not mingling, with the warmth of her genuine hospitality, one mistrustful enquiry into the reason of her guest’s late wandering, or the cause of her lonely difficulties. \n \n The children with, instinctively, the same sensations, ran about, nearly naked, in search of their homely play-things; persuaded that the ‘dood ady’ would be as pleased as they were themselves, by the sight of the several pieces of broken platter, which they called their tea-things; and a small truss of straw, rolled round with rags, which they denominated their doll. Nor would they return to rest, till Juliet sat down by their side, to tell them some simple stories, of other good boys and girls; while their mother prepared, for the ‘dood ady,’ a bed above stairs. \n \n The thankful happiness of Juliet, at a deliverance so unexpected, so sweet, so soothing, induced her cordially to partake of a repast of which she stood greatly in need; but, before she could mount to the offered chamber, officious doubts and apprehensions broke into the fulness of her contentment, with enquiries: Who might be the men whom she had seen hovering about the house? What might be their business without doors during the dead of the night? What had the man of the hut to do away from his dwelling at such an hour? And why, and for whom, was the good dame herself up so late, without giving any reason for what must necessarily appear so extraordinary? \n \n Bewildered in her ideas, uncertain in her judgment, and fearful how to act, she could not resolve to inhabit a lonely chamber up stairs, at the risk of some fatal surprize, or new danger. She complained of cold, and entreated for leave to sit over the embers; while she begged them, without heeding her, to take their usual repose. \n \n The good woman started not the smallest difficulty; and, placing herself by the side of the children, in less than three minutes, was visited, like themselves, with the soundest sleep. \n \n This woman, thought Juliet, must be as guileless as she is benevolent, unaccountable as are all the circumstances that hang about her; could she, else, with trust thus facile, taste rest thus undisturbed, in presence of a wandering stranger, known to her only by a small and accidental kindness shewn to her children? \n \n Quieted by this example, Juliet herself, leaning her head against the wall, partook of that common, but ever wonderful oblivion, by which life is recruited, sorrow supported, and care assuaged. \n \n With the first sun-beam they all awoke, and Juliet besought her hostess to accompany her to the nearest town. The good woman cheerfully complied with this request, making no other condition than that of demanding the time to dress and breakfast her bantlings, as she never went any where without them. \n \n Juliet then officiated as nurse to the children: and here, again, the wish of obliging, with the talent of being serviceable, so endeared her to the little ones, and made her so agreeable to their parent, that she was earnestly solicited to remain with them a little longer. \n \n ‘But, your husband?’ Juliet then ventured to ask; ‘may I not be in his way?’ \n \n ‘O no,’ the woman answered; ‘a be gone his rounds; and ’t be odds but they do take un, God willing, a week.’ \n \n This was sufficient encouragement for the harassed Juliet joyfully to accept the invitation for remaining with them a few days. She deposited, therefore, her baggage in the no longer rejected up stairs chamber; and, after a few hours of quiet repose, took the entire charge of the children for the rest of the day; not merely to play with and amuse them, but to work for them. And her industry and adroitness soon put their whole little wardrobe in order; and she fashioned their clothing to their little shapes, in a manner so neat and commodious, that all that they possessed appeared to them to be new. \n \n The day following, with the same happy skill, she dedicated her time to the service of the mother; whose entreaties grew more and more urgent, that she would prolong her stay at the cottage. \n \n Far was she from desirous to quit it. With repose so much required, she here found comfort, peace, and affection,—three principal ingredients in the composition of happiness! which her mind, in her uncertainty of the fate awaiting her, was delighted to seize, and eager to requite. \n \n For whomsoever, therefore, and at whatsoever she worked, she sung simple songs, or told simple stories, with invariable good humour and pleasantry, to her little friends, who clung to her with passionate fondness; while their enchanted mother thought that some angel was descended amongst them, in guise of a traveller, to charm and to serve them at once. \n \n To the unhackneyed observation of this good woman, the change of attire in Juliet, since their meeting at Salisbury, offered no sort of food to conjecture; she concluded that to walk about that fine city, had well deserved the best clothes; and that the worst had naturally been put on, afterwards, for economy, upon the road. Juliet found her wholly ignorant of the Salisbury adventure; and filled with innocent gratitude, in concluding that she had been benighted in the Forest, while seeking to find the little dearys whom she had thought so pretty upon the high road. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1418/42623.html","bookId":1389,"book":{"id":1389,"title":"The Wanderer 徘徊者","description":"简介： During the dire reign of the terrific Robespierre, and in the dead of night, braving the cold, the darkness and the damps of December, some English passengers, in a small vessel, were preparing to glide silently from the coast of France, when a voice...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1418","creation":"Aug 1, 2019 12:24:59 AM","modification":"Aug 1, 2019 12:24:59 AM"}}
