{"id":10439,"no":30,"title":"CHAPTER XXX. PROUT GETS A CLUE.","content":"Sergeant Paul Prout was beginning to come to the conclusion that the Corner House mystery would have to be relegated to the long list of crimes concerning which Scotland-yard is fain to be silent. At any rate, the matter was utterly beyond him. Given a clue to work on, no man in the force could display more tenacity and skill. But there was nothing to go upon, and Prout was utterly devoid of imagination. \n \n Of course, there was always the chance of coming on the track obliquely. None knew better than Prout how frequently one crime interlocked with another, and how often in looking for one particular criminal another had been arrested. \n \n He came into the inspector\u0027s office in answer to a summons. Inspector Manton passed over some papers to his subordinate. \n \n \"I want you to read them and act upon them,\" he said. \"You\u0027ll have to put that Corner House business out of your head for a day or two at any rate. It appears that a gang of cosmopolitan swindlers have established their headquarters somewhere in Soho, and by means of using several addresses they are getting a tremendous quantity of goods which they proceed to turn into money. Here is one of their advertisements cut from the Standard. You had better answer it, and get in touch with the fellows that way. But nobody can manage that sort of thing better than you.\" \n \n Prout felt himself quite capable to account for this matter. He proceeded to lay the whole particulars before a friend in the wholesale silver-plate line--just the kind of article the gang of thieves affected--and so procured the genuine address of a genuine trader for the purposes of the capture. \n \n \"I expect you\u0027ll get orders from five or six addresses,\" said Prout. \"If so, send the stuff on, not too much at a time, and ask for references. You\u0027ll get the reference, of course; in other words, Jones and Company, of Gray\u0027s Inn, will recommend Smith and Company, of Market Street. When you get all the references in let me know, because by that means I shall be in possession of every address used by these fellows.\" \n \n To keep the big swindle going on and to avoid awkward mistakes it was necessary for the confederates to meet at intervals. By small purchases at one address or another Prout had pretty well got to know all the gang by sight, and by following one or another he discovered at last where the rendezvous was--a public-house of not too good repute in White Lane, leading off Oxford Street. \n \n Next day a sallow, seedy, broken-down shop assistant sought and obtained a bedroom at the Orange Tree public-house. He seemed to have money, and therefore he was welcome. He hinted that he was \"in trouble\" over some stolen goods from his late employer\u0027s shop, and the Orange Tree received him with open arms. \n \n It was weary work sitting there and pretending to drink, but patience has its reward at last. Gradually the shy swindlers became accustomed to the seedy shop assistant, who even went out of his way to give them hints as to credulous firms. It seemed to Prout that he knew all the gang at last save one. \n \n And this one he particularly wanted to see, because the name was unknown to him. In all the swindlers in London it was the first time Prout had heard of one called \"Frenchy.\" And the particular member of the gang--absent from London on business--seemed to be the leader of them all. Once Frenchy showed himself, Prout would give the sign, and within an hour the gang would be laid by the heels. \n \n He came at length, a little dapper man, with a slight hump between the shoulders, a nose slightly crooked on one side. He appeared to take his warm welcome quite as a matter of course, he discarded a pair of grey suède gloves, and called for a bottle of champagne. \n \n Behind his paper Prout gave a start. Here was a case where the pursuit of one crime led to another. The leader of the gang of thieves had large orange coloured freckles on his hand the same as Prout had seen on the hands of the victim of the Corner House tragedy. \n \n Prout was calm again in an instant. In a dejected way he was looking admiringly at the newcomer. The little man\u0027s English was quite good, but all the same he spoke with an accent that had a strange French flavour about it. \n \n Just on closing time Prout lounged out in his most dejected style, and bought a late paper. \n \n \"Now, look here,\" he said to the man with the papers. \"Those men are to be arrested, but so far away from here as not to give any suspicion of the house being watched. The little dandy chap who just came in is to be left to me. That\u0027s all.\" \n \n Apparently it was quite sufficient. As the gang separated one by one, each was picked up by an officer in plain clothes. The little man in the suede gloves went cautiously on till he came to a working-man\u0027s flat off Gray\u0027s Inn Road, and here for the first time he became conscious that he was being followed. \n \n \"And what do you want with me?\" he asked. \"So, you are the young man who got into trouble over a mistake as to your employer\u0027s goods.\" \n \n \"I want to speak to you for a moment,\" said Prout. \n \n The little man pointed gaily up the stairs. Prout followed him into a room and shut the door. The next instant the small Frenchman was on his back and the handcuffs encircled his wrists. \n \n \"No use making a noise here,\" said Prout coolly. \"It was a good idea of yours to hide yourself amongst respectable working men.\" \n \n The little man struggled silently, furiously. \n \n \"Now, what\u0027s the good of that?\" said Prout in his most soothing voice. \"With these bracelets on you can\u0027t possibly get at the revolver in your hip pocket. I am a police officer, and by this time the whole of your lot are in custody. I\u0027ve got the key of the door in my pocket, and I\u0027m going to search the room.\" \n \n The little man\u0027s language burst out furiously. Nothing less than war between France and England should wipe out this insult to the tricolor. Prout had burst open a desk and was examining the papers there as tranquilly as if he were stone deaf. He came across something presently that caused his eyes to gleam and his heart to beat with a feeling of triumph. \n \n \"Now you can come along with me,\" he said. \"If you like to walk you can, and if you like to pay for a cab I am agreeable. What do you say?\" \n \n The little man elected to have a cab. When Bow Street was reached Prout had the satisfaction of finding that all his birds had been netted. He received the warm congratulations of his inspector modestly. \n \n \"Got your case complete?\" asked the latter. \n \n \"I\u0027ve done more than that, sir,\" said Prout. \"I\u0027ve stumbled on something important relating to that Corner House business. And if you don\u0027t want me any more, I\u0027d like to go and see Mr. Gilbert Lawrence.\" \n \n There was nothing more to be done for the present. Ten minutes later Prout was knocking at the door of Lawrence\u0027s chambers. \n \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2113/59941.html","bookId":519,"book":{"id":519,"title":"The Corner House","description":"简介： A brilliant light streamed from the open doorway of No. 1, Lytton Avenue, making a lane of flame across the pavement, touching pinched gaunt faces that formed a striking contrast to the dazzling scene within. Outside it was cold and wet and sodden, i...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2113","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
