{"id":10450,"no":41,"title":"CHAPTER XLI. PROUT IS INDISCREET.","content":"Heavy as were these blows, a few hours\u0027 sleep braced Leona Lalage for what she knew to be a trying ordeal. By the time that breakfast was a thing of the past she had sketched out a new plan of campaign. The terrible unseen force from behind had driven her from her strong position. In future she would have to recognize the fact that she was hopelessly beaten, and all that she could expect now was to cover up her tracks and prevent the final solution of the mystery. \\n\\n \\n\\n On the whole, an appearance of candour would be best. She would go straight to Prout, who had the Corner House tragedy in hand, and tell him everything, at least everything that Lawrence had found out. She never guessed for a moment that this was exactly what the novelist expected her to do, in fact, he had apparently told all he knew to gain this end. Also, at his suggestion, Isidore had blurted out the fact that Prout had succeeded in laying Leon Lalage\u0027s brother by the heels. \\n\\n \\n\\n On the whole, this would be by far the best thing to do. It was just possible that her fascinations might elicit something further from Prout. Leona Lalage might not have felt quite so easy in her mind had she known that the little snake-headed detective was fresh from a long interview with Lawrence. \\n\\n \\n\\n He was profoundly impressed by the graciousness of his visitor. He even dusted an office chair for her with a clean handkerchief. He seemed a simple sort of man. Leona Lalage had not a high opinion of the police. \\n\\n \\n\\n \"I have come to have a chat with you,\" she said with her most brilliant smile, \"on the subject of the Corner House. They tell me you have made an arrest that by a wonderful chance will have an important bearing on the case.\" \\n\\n \\n\\n Prout grew wooden. His official manner caused Leona to hide a smile. Really, it would be child\u0027s play to get the better of this man. \\n\\n \\n\\n \"I am afraid you are mistaken, madame,\" he said. \\n\\n \\n\\n \"Indeed, no. Mr. Isidore spoke of it quite freely. It appears that a brother of the dead man has come into your hands. Is not that so?\" \\n\\n \\n\\n Prout grudgingly admitted that it was. He was also severe on the indiscretion of certain people. Mr. Isidore ought to know better. The Countess was charmed. Evidently she was going to do exactly as she pleased with this man. Every question that she asked him he contrived to answer in some way that betrayed his knowledge. \\n\\n \\n\\n \"Not that I am asking for sheer curiosity,\" she said gaily. \"You see I am also in a position to throw a little light in a dark place. Do you know that the rest of the missing notes have been in my possession?\" \\n\\n \\n\\n Prout was surprised. Not that he ought to have been surprised after the strange things that had come in his way professionally. The way he conveyed the impression that all this was news to him was artistic. He asked a score of questions, he made voluminous notes solemnly in a large book. \\n\\n \\n\\n \"You have really been of great service to me, madame,\" he said. \"It was very good of you to come and tell me straightforwardly. Now, let us see if we can trace these notes to the possession of the previous holder.\" \\n\\n \\n\\n Leona Lalage intimated that was the only thing she desired for the moment. But at the same time she made it pretty clear to Prout that the thing was impossible. Her keen desire was to show him the impossibility of the proceeding, and induce him to give up any further investigations in that direction. \\n\\n \\n\\n \"You see, I have the good fortune to be exceedingly rich,\" she said, with her most fascinating smile. \"I don\u0027t value money as much as I should. To me it is a mere medium for enjoyment. I gamble, and bet, and all that kind of thing, in fact I generally have a large sum of money in paper in the house. I might have got those notes from a betting man at Ascot, or at Goodwood, or even the card table. But at the same time I\u0027ll try my best to assist you.\" \\n\\n \\n\\n Prout was profuse. He was very anxious over those notes. He had certainly had the good fortune to take into custody one René Lalage, the brother to Leon Lalage, who had been murdered in the Corner House. \\n\\n \\n\\n \"Strange they should be the same name as myself,\" the Countess said. \\n\\n \\n\\n \"Not in the least,\" Prout hastened to reply. \"I find the name is a very common one at Marseilles, and along the Mediterranean generally.\" \\n\\n \\n\\n The Countess smiled. She had risen prepared to take her departure. If she had any knowledge of faces she had made a good impression. \\n\\n \\n\\n \"It seems hardly credible,\" she said. \"I mean the story of the Corner House as told by Dr. Bruce. That Spanish woman, for instance.\" \\n\\n \\n\\n Prout shook his head in a non-committal fashion. He had heard some amazing statements made by suspects in his time, statements so wild that they carried guilt on the face of them. And yet he had personally proved many of these statements to be true. The Countess smiled as she turned to the door. \\n\\n \\n\\n \"I am not very easily impressed,\" she said, \"and as to that Spanish woman--eh, Dr. Bruce must have been taking lessons from Mr. Lawrence.\" \\n\\n \\n\\n \"The woman did exist all the same,\" Prout said innocently. \"In fact, I don\u0027t mind admitting that I\u0027ve got a portrait----\" \\n\\n \\n\\n He paused and looked down. The smile faded from Leona\u0027s face. \\n\\n \\n\\n \"Who told you that it was a portrait of--I mean where did you----\" \\n\\n \\n\\n \"René Lalage. As you are interested, and as you came here to assist me, madame, I don\u0027t mind going so far as to show you the picture. It came from a weekly paper----\" \\n\\n \\n\\n \"I know--I mean, what do I mean?\" the Countess said hoarsely. \"Really I don\u0027t know why I should be so interested.\" \\n\\n \\n\\n Prout took a sheet of paper from his desk and held it up. It was a portrait of a fair Spanish gipsy. The letterpress and border had been cut away. \\n\\n \\n\\n \"What do you think of that?\" Prout asked. \\n\\n \\n\\n Leona Lalage said nothing. She could only look and look in a fascinated way. \\n\\n \\n\\n \"It--it proves nothing,\" she said with an effort, presently. \"A pleasant face. Don\u0027t you think that she is a little like me?\" \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2113/59952.html","bookId":519,"book":{"id":519,"title":"The Corner House","description":"简介： A brilliant light streamed from the open doorway of No. 1, Lytton Avenue, making a lane of flame across the pavement, touching pinched gaunt faces that formed a striking contrast to the dazzling scene within. Outside it was cold and wet and sodden, i...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2113","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
