{"id":10452,"no":43,"title":"CHAPTER XLIII. A SLICE OF LUCK.","content":"Lytton Avenue was quiet for once, and Leona Lalage was glad of it. She said truthfully that she had a splitting headache, so that she was thankful to be alone and lie down on a couch in the drawing-room with the lights lowered and eau de Cologne on her temples. Hetty sat a little way off engaged on some fancywork. It seemed hard to imagine that all this refinement and enviable luxury covered crime and mystery. It was a little before eleven that Balmayne came in. He was very quiet and subdued; he sat and unfolded an evening paper. He shot a sign across to the Countess from a pair of eyes that gleamed like flames. \"I should like a fresh handkerchief, Hetty,\" she said. \"Would you mind?\" Hetty was off at once. Balmayne jumped to his feet. \"You must try and pull yourself together,\" he said. \"There has been an amazing piece of luck. Isidore was dining at the Lotus with Lawrence. We came down the steps together. There was a fire close by, and a hansom backed on to the pavement. To make a long story short, Isidore fainted with the pain of a broken collarbone, and they took him to Charing Cross Hospital.\" \"You took him. In that case I need not ask----\" \"You need not. I didn\u0027t take him personally. I took his keys.\" Leona Lalage was off the sofa directly. She motioned to the door. As Hetty came back the sufferer crossed the room languidly, saying she was going to lie down on her bed. She required no attention, she only wanted to be absolutely quiet. Once upstairs Balmayne followed. There was nobody on the landing. \"Now is your chance,\" he said. \"It is a pretty neat turn of fortune for us. I\u0027ve got the motor round and will meet you at the corner of the street. You had better be disguised.\" \"But I have only one disguise in the house--the old one.\" \"All the better. You are used to that, and carry it off naturally. I have the key not only of the safe but of the street door as well. All you have to do is to proceed to the sitting-room where you have been before and help yourself. Then you can slip into Isidore\u0027s bedroom and lay the keys on the dressing-table. He will imagine that he left them behind when he changed his evening clothes. Are you up to it or not? Really, you look fearfully ill tonight.\" The dark eyes were gleaming in the white face. Despite her racking head and her tired limbs, Leona was gradually summoning back her latent forces. Her hand no longer trembled, the wild beating of her heart was stilled. \"You can rely upon me,\" she whispered. \"I shall not fail you. Too much depends upon my success or failure tonight. Go round and get the motor whilst I slip into my old disguise. The thing can be done swiftly; I can be back here again before anybody knows that I have gone.\" \"Lock your door as a precaution,\" Balmayne whispered. \"I\u0027m going now.\" In the shadows Hetty listened to as much of the talk as she could hear. But nobody was going to leave the house without her knowledge. Behind the hangings in the hall she waited. Her patience was not unduly tried. There was a light footstep presently, a pause as if of precaution, and the Countess came downstairs. Her hair had become blonde, there was a lace shawl over her head, her skirts were short and trim. She flashed across the hall without the slightest sound, and had passed into the street before Hetty deemed it prudent to follow. The girl was taking a terrible risk for the sake of her lover, and she knew it. But she must follow. She did presently, keeping the Spanish figure in sight till the corner of the road was reached. There stood the black motor with its dull sides. The figure of the Countess sprang into it lightly. There was a touch of the lever, a click of metal, and then the swift machine was out of sight like a flash. \"Well, I can do no more at present,\" Hetty told herself. \"I had better go to my room and wait for her return. What a wonderful woman! Half-dead a few minutes ago, and now ready for a desperate errand like this!\" The motor sped on until it came at length to the corner of the street where Isidore\u0027s chambers were situated. It was a very quiet road, and few people were about. Quite calmly and collectedly Leona alighted. \"It\u0027s the fifth house,\" she said. \"I shall trust to chance that the people are in bed. If not, I dare say I shall have a good tale to tell.\" \"Go in and win,\" Balmayne whispered. \"Always back your luck.\" Leona Lalage came to the house at length. So far as she could see no lights were anywhere except in the hall, where there was a faint spot of gas. Everything was going to turn out favourably. Evidently the landlady had gone to bed, or the gas would not be so low. It was easy to pick the latchkey out of the bunch that she held in her hand. The lock turned easily and smoothly, and she was in the hall. Silence everywhere. Evidently the whole household was in bed. There was another tiny crumb of gas burning on the landing, just outside Isidore\u0027s sitting-room door. The door of the room was closed. Leona opened it quietly and boldly and entered. The place was in absolute darkness. Where was she to find the matches, for she had none of her own? She fumbled her way to the fireplace, but could find nothing she required. It seemed to her that she could hear somebody breathing in the room besides herself. But this she put down to the worn and disordered state of her nerves. Ah, there were the matches at last. She could hear them rattling as they fell to the floor. She struck one, and the sudden flare half blinded her. Then she turned all the burners on, and the sudden glitter of it made her start. Really she was a good deal more ill and shaky than she had imagined. Light at last. The blinds were up, but that did not matter. Leona turned and looked round the room. A man, seated in a chair, a dark and gloomy man with brooding eyes, rose and confronted her. \"A strange place to meet,\" he said, \"but we have met at last.\" Leona Lalage strove to speak, but the words froze on her lips. She was face to face with Garrett Charlton!","sourceLink":"http://novel.tingroom.com/jingdian/2113/59954.html","bookId":519,"book":{"id":519,"title":"The Corner House","description":"简介： A brilliant light streamed from the open doorway of No. 1, Lytton Avenue, making a lane of flame across the pavement, touching pinched gaunt faces that formed a striking contrast to the dazzling scene within. Outside it was cold and wet and sodden, i...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2113","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
