{"id":10466,"no":57,"title":"CHAPTER LVII. A WAY OUT.","content":"Leona retorted scornfully that she had no desire for flight. But as for the food that René demanded, it was a different matter. Still, Lytton Avenue had always been an extravagant household, and there might be welcome food here that would have been looked upon with disdain a few days ago. \\n\\n \\n\\n There was nothing in the kitchen, but there were some boxes in the storeroom beyond--a tin or two of sardines and some biscuits. Also in a wine cellar Leona found a flask or two of Chianti. \\n\\n \\n\\n These she handed up to René, who returned to the dining-room with them. His mood had changed for the moment, but Leona was by no means out of danger yet. He might have been trying her all the time, he might be gloating over his vengeance. If she could only get rid of him, only scare him away. \\n\\n \\n\\n She looked round as if seeking inspiration. She found it presently in the housekeeper\u0027s room. Just in front of her was the glitter and sheen of the telephone. The scheme that she wanted came to her like a flash. \\n\\n \\n\\n She closed the door of the room softly and gave a call. It was late at night, the exchange was quiet, and the answer came swiftly. \\n\\n \\n\\n \"Give me number--well, I forget the number,\" she said almost in a whisper. \"I want to be put on to the nearest police-station quick.\" \\n\\n \\n\\n \"Vine Street,\" came the staccato reply. \"Number 107--there you are. You are wanted Vine Street. . . . There you are--speak up.\" \\n\\n \\n\\n A hoarse voice wanted to know what was wrong. But it mattered little what noise the speaker made at the other end of the wire so long as the caller spoke under her breath. She proceeded to explain. \\n\\n \\n\\n \"I\u0027m at No. 1, Lytton Avenue,\" she said, \"Countess Lalage\u0027s, you know. Yes, I am quite aware of the fact that it is an empty house. But there is a lot of stuff here that is worth fetching. In fact, there is somebody in the dining-room now. Are you going to do anything, or shall I give the alarm?\" \\n\\n \\n\\n The gruff voice suggested diplomacy, and promised immediate assistance. The caller had only to lie low and the desired aid should be on hand immediately. With a sense of pride and exultation Leona Lalage hung up the receiver and made her way to the dining-room. \\n\\n \\n\\n Unless some unforeseen event took place she had saved her own life. But all the same there was danger. The police would probably get René, but also they might get her, which was a much more serious matter. She softly opened the catch of the back drawing-room window so that she could reach the garden. \\n\\n \\n\\n René had opened the tin with the point of his knife, and was eating sardines and biscuits in a wolfish way. The Chianti he drank from the bottle. \\n\\n \\n\\n \"That is like a breath of old times,\" he growled, as he finished the flask. \"Let me light a cigarette and then we\u0027ll talk again. I am going to try you high, dear lady. I am going to test your story.\" \\n\\n \\n\\n The old gleam was coming back to his eyes. Leona drew a deep breath. She had half expected this at the time; there was always the chance that this man knew a great deal more than she imagined. But help must be near her by this time, and she could always prevaricate. \\n\\n \\n\\n \"Pooh, I am not afraid,\" she said, with easy contempt. \"Say on, say on.\" \\n\\n \\n\\n \"Ah, I am coming to that fast enough,\" René growled. \"You say that you gave my brother four hundred pounds in gold----\" \\n\\n \\n\\n He paused as he saw Leona listening eagerly, not to himself, but to something outside. She was acting perfectly. There was just a suggestion of alarm in her manner that gave the situation. \\n\\n \\n\\n \"Didn\u0027t you hear something?\" she whispered. \\n\\n \\n\\n René shook his head. He could hear nothing at all. He said so impatiently. It seemed to him that his companion was playing with him. \\n\\n \\n\\n \"You or I, or both of us, are followed,\" she said. \"Come this way. Peep out of the window without lifting the blind. What do you see?\" \\n\\n \\n\\n A policeman, standing rigidly outside the house, making signs with his hands to somebody. A sound of feet creeping down the area steps, the sudden pop and bang of a door forced in by a lever. \\n\\n \\n\\n \"Look to yourself,\" Leona cried, \"they are here. There is a ladder in the garden that leads out to the roof. Never mind me.\" \\n\\n \\n\\n René had no intention of doing anything of the kind. A dim, blue-coated figure stood in the doorway of the dining-room. With one spring René was upon him, and carried him to the floor. There was a groan and a snarl and a snore, and the policeman lay on his back utterly oblivious for the moment. \\n\\n \\n\\n René Lalage raced up the stairs. The house was not familiar to him, but he quite understood the meaning of what Leona had said about the ladder. As to the woman herself, she was quite at home there. She slipped into the back drawing-room, and thence across the hall into the drawing-room. The window catch was unfastened, as she had looked forward to this way out, and an instant later she was in the cool air. She could hear the shouts and yells in the house; presently she heard the cry of a policeman far overhead. René\u0027s means of escape had been discovered, and he was being pursued over the housetops. \\n\\n \\n\\n \"I hope they get him,\" Leona said between her teeth. \"I hope they get him. And may they keep him for the rest of his life.\" \\n\\n \\n\\n She hurried down the garden to the green gate. A little way beyond it was a policeman. No escape that way for the present. The garden was all right, but it would be light in two or three hours. There was a yell from the roof, and then a policeman\u0027s hoarse roaring, saying that he had \"got him.\" The next time Leona looked out the policeman outside the green gate was gone. \\n\\n \\n\\n When and where should Leona go now? She was utterly outcast. If it was possible---- \\n\\n \\n\\n \"It is possible,\" she cried aloud. \"Fool not to have thought of it before. What better hiding-place could I have than in the Corner House!\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2113/59968.html","bookId":519,"book":{"id":519,"title":"The Corner House","description":"简介： A brilliant light streamed from the open doorway of No. 1, Lytton Avenue, making a lane of flame across the pavement, touching pinched gaunt faces that formed a striking contrast to the dazzling scene within. Outside it was cold and wet and sodden, i...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2113","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
