{"id":74920,"no":20,"title":"Page 20","content":"Chapter Twenty\\n\\n Sawyer\\n\\n Banging on the door to Beau’s trailer I mentally cursed him. He’d had to have Ashton so damn bad he snatched her away from me and for what? He’d lost her within seven months. How stupid could one man be?\\n\\n “What the hell Sawyer?” Beau demanded as he opened the door glaring at me as if he had reason to be mad.\\n\\n I shoved past him and slammed his phone down on the beat-up coffee table where I’d once sat and played Go Fish at two o’clock in the morning with Beau while waiting on his mom to get home from work.\\n\\n “You better have a real good reason for this Saw,” he growled, slamming the door behind him.\\n\\n “Ash had your phone,” I replied.\\n\\n Beau looked down at his cell phone on the table and back to me. “So?”\\n\\n The lack of concern was my first hint that we had a big misunderstanding on our hands.\\n\\n “You got a text... from a girl,” I continued and waited for him to look worried or guilty or something.\\n\\n He continued to look confused. The innocence of his lost expression told me all I needed to know. Beau hadn’t cheated on Ash. Thank God. Maybe it wasn’t too late for Lana and me to get to New Orleans today after all.\\n\\n I picked up the phone and handed it to him, “Read the text from Sugar.”\\n\\n Then as if a light went off Beau’s eyes widened and my moment of relief was replaced by disbelief.\\n\\n “Sugar texted me? And Ash read it?”\\n\\n “Yes, you stupid asswipe. Haven’t you learned by now that when you CHEAT you get CAUGHT! Dammit, Beau, how could you do this? She loves you. She’s a complete mess. I found her on my carport bawling her eyes out this morning.”\\n\\n Beau’s face went pale and he grabbed a pair of discarded jeans, jerked them on and turned to run out the door.\\n\\n I followed him, “What the hell are you doing?”\\n\\n “Where is she Saw? Where’s Ash?” he yelled as he ran to his truck.\\n\\n “I’m not telling you where she is. You’ve destroyed her Beau.”\\n\\n Beau stopped and stalked back toward me with an angry snarl on his face. “Sugar is my fucking AUNT. My mother’s baby sister. Now tell me where my girl is before I beat the shit out of you.” His voice had gone from a cold menace to a roar.\\n\\n “Since when do you have an aunt named Sugar? Aunt Honey’s younger sister’s name is Janet,” I yelled back. Not sure what he was trying to do here. I was his brother for crying-out-loud. I knew his family tree.\\n\\n “Yeah, well my mama’s name is Paula, but that ain’t the name she goes by, now is it?”\\n\\n “Janet goes by Sugar?” I asked with relief.\\n\\n “YES! Now where the hell is my girl?”\\n\\n I was pretty sure we’d woken up the entire trailer park.\\n\\n “She’s at home. Go,” I replied and Beau turned and ran to his truck. It roared to life and he spun out of the driveway. I just hoped he didn’t run over anyone on his way to her house because I was willing to bet he wasn’t going to stop if he did.\\n\\n Sinking down onto the steps, I pulled my phone out of my pocket and texted Ash.\\n\\n Me: It isn’t what it looks like. Beau is on his way over. Listen to him. Just so happens Aunt Honey has a younger sister, her name is Sugar. Tell Lana to get ready I’m on my way there to get her.\\n\\n Ashton: Oh no. I made a mess of things. I’m so sorry Sawyer.\\n\\n Me: Not that big of a deal. It got straightened out pretty fast. Watch for Beau. He sped out of here for your house like there was a fire.\\n\\n Ashton: Okay\\n\\n I decided against sending Lana a text. I had a feeling I was probably in trouble because of the last text I’d sent. It didn’t explain things well but I was in a hurry to find Beau and get Ashton calmed down. Showing up and explaining was the best idea.\\n\\n Beau met me at the door of Ashton’s house when I got there. The serious expression on his face surprised me. Surely, he’d been able to clear things up with Ashton. Didn’t she believe him? “Hey, things okay?” I asked, walking up the steps.\\n\\n “That depends on you,” Beau replied.\\n\\n “What?”\\n\\n “Ash is upset but not with me. She’s upset with herself. Running to you when she thought I’d cheated on her was her first reaction. It has always been the three of us. She didn’t think about going to anyone else. She just figured you would know how to fix it. You always did fix the messes we managed to get into. I’m warning you now that if you so much as blame, raise your voice or even look at her wrong when you walk in that house and hear what she has to tell you, that I will take you down. She got upset. She acted on instinct. What happened as a repercussion isn’t her fault.”\\n\\n “What in the hell are you getting at Beau?” I asked, starting to feel anxious as I pushed past him and into the house. Ashton was standing in the kitchen with swollen red eyes and chewing on her bottom lip.\\n\\n “What’s wrong with the two of you?” I asked in confusion. “I’m just here for Lana. Whatever other problems y’all have, I’m out. Fix them yourselves.”\\n\\n “Ohnoohnoohno,” Ashton started muttering. Her worried eyes lifted to look at Beau for help.\\n\\n “Just give it to him, Ash,” Beau encouraged gently.\\n\\n “Give me what?” I demanded. Then my eyes noticed the piece of paper dangling from her right hand.\\n\\n I walked over to her and snatched the paper out of her grasp. Perfectly scripted handwriting covered the page in what appeared to be a letter. Dropping my eyes to the bottom of the page Lana’s signature stood out at me and my heart stopped beating. Nononononono, please God no, I begged silently as I began reading.\\n\\n Ashton,\\n\\n Let me begin by saying, thank you. I needed an escape this summer from the craziness that is my life. You helped make that possible. I needed to talk about my dad and how I felt and you were there for me. No one has ever been there for me before. Knowing someone cared was more precious to me than you could have ever imagined.\\n\\n But, I made the mistake of opening my heart up to someone who clearly could never feel the same about me. I knew Sawyer loved you. I’ve known it since we were kids. I thought maybe just getting his attention for a short time would be enough. It wasn’t.\\n\\n I’ve grown up with two parents who never once thought about me in the choices they made. My emotions weren’t something they concerned themselves with and maybe that is my fault because I didn’t speak up. I just pushed the hurt and anger deep inside me. I wanted to be strong because I knew they were weak. I’m tired of being strong. I’m tired of being second best. I need someone to love me.\\n\\n Staying in Grove isn’t a possible option for me. I let myself hope for too much. I’ve been broken too many times. I can’t stay somewhere near... someone who will eventually destroy me.\\n\\n Please tell your parents thank you for me. I’m sorry I didn’t stick around for goodbyes and explanations but I think you understand why I had to go. You had the right Vincent boy all along. Don’t take him for granted this time. He loves you in a way that I hope to one day inspire in someone. He would give up the world for you. When you have someone that special, that incredible who loves you, don’t let it go. This is your second chance to treasure what you’ve had all your life. Sawyer was always the Vincent boy worth fighting for. He’s the special one.\\n\\n Love,\\n\\n Lana\\n\\n “She doesn’t say where she went? Did she go home? How did she get there?” I was going to throw up. Tears stung my eyes and I swallowed the lump in my throat. I didn’t have time to cry like a damn baby. I needed to find Lana, NOW.\\n\\n Folding the paper neatly, I stuck it in my pocket and pulled out my phone.\\n\\n Her phone went straight to voice mail. Shit.\\n\\n “Did you try calling her? Have you called her mom?” I asked Ashton while trying her number again.\\n\\n “Don’t raise your voice at her. I know you’re upset but remember my warning. And for the record you’re not all that damn special. Just throwing that out there.”\\n\\n I didn’t give a rat’s ass about Beau’s warning. I needed to find Lana. “I’m not raising my voice. I need to find Lana,” I yelled, glaring at him as I slammed my fist against the brick fireplace. The pain wasn’t enough to numb the agony in my chest.\\n\\n “Sawyer, stop! You’re bleeding. Beau, do something,” Ashton’s worried voice sounded like it was coming down a tunnel.\\n\\n “WHERE IS SHE?” I roared, beating my fist against the wall trying to stop the tears blurring my vision. I had to find her. She needed me. Oh God, she needed me.\\n\\n Pressing both my palms flat against the brick, I dropped my head and let the tears roll freely. I’d lost her. I couldn’t lose her. She was so broken and I didn’t even know. I wanted to find her dumbass father and beat his face in until the ache inside me, from her words in that letter, eased. How could they overlook her? How could anyone overlook her?\\n\\n “Sawyer, we’ll find her,” Ashton said as a small choked up sob escaped her. “Beau, he’s crying. I can’t stand this. Do something,” she begged.\\n\\n “Why don’t you give us a minute, Ash?” Beau replied.\\n\\n I heard Beau whisper to Ashton and kiss her before her footsteps faded down the hall.\\n\\n “Man, you’ve got to get a fucking grip. You’re losing it and that shit ain’t gonna help nothing. Plus you’ve got Ash in tears.”\\n\\n He had no right to tell me how to handle this. I’d lost her trying to help him.\\n\\n I pushed myself off the wall and walked away while I wiped the proof of my breakdown from my face.\\n\\n “Look, bro, I get it. You love her. I know that feeling real well. But crying like a fucking pussy ain’t gonna do one bit of good. We have to find her. It takes big boys to do that. Think you can dry up the well and help me think this through?”\\n\\n I froze and dropped my hands to my sides. What had he just said?\\n\\n Turning around I stared at him, “Did you just say, ‘I love her’?”\\n\\n Beau rolled his eyes and crossed his arms over his chest as he leaned against the doorframe. “Really Saw? You gotta ask me that?” He shook his head as if I were the biggest idiot on the planet. “Let me ask you something. When you lost Ash... did you cry? I know we beat each other up and you did a lot of yelling. But did you cry?”\\n\\n “No.”\\n\\n Beau nodded, “Did you want to? Or were you just mad as hell?” I thought back to those weeks after our breakup. I didn’t remember fighting back tears. Not once.\\n\\n “No.”\\n\\n “Didn’t think so. ‘Cause although you loved Ash, she wasn’t the one. When you fall for the one that owns you, she’ll be the only one that has the power to make you cry.” \\n\\n","sourceLink":"https://allnovel.net/the-vincent-brothers-the-vincent-boys-2/page-20.html","bookId":1997,"book":{"id":1997,"title":"The Vincent Brothers (The Vincent Boys #2)","description":"Storyline: The Vincent Brothers (The Vincent Boys #2) \\n Getting a boy to fall head-over-heels in love with you isn’t easy. Especially when he’s been in love with your cousin for as long as you can remember. \\n Lana has lived her life in her cousin’s shadow. Ashton always made perfect grades, had tons of friends, and looks model-perfect. And she’s always had Sawyer Vincent—the only boy Lana’s ever wanted—wrapped around her finger. But now things are different. Lana has a chance to make Sawyer see her, and she’s taking it. If only he’d get over Ashton—because Lana is sick of second-best. \\n Sawyer’s heart is broken. He’s lost his best girl to his best friend. And then Lana comes to town. Ashton’s cousin has always been sweet and soft-spoken, but now she’s drop-dead gorgeous as well. Sawyer doesn’t know if Lana can heal his broken heart, but spending time with her might at least make Ashton jealous. \\n What starts as a carefree fling becomes a lusty game of seduction. Sawyer and Lana may have different motives, but their scintillating hookups are the same kind of steamy. . . .\\n","cover":"https://allnovel.net/images/the-vincent-brothers-the-vincent-boys-2.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-vincent-brothers-the-vincent-boys-2.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 10:33:01 AM"}}
