{"id":74905,"no":5,"title":"Page 5","content":"Chapter Four Sawyer That couldn’t be good. I mentally cursed myself for making such a jackass move. Jerking my truck door open, I started to climb inside when Beau’s truck pulled in behind me. Perfect. Not what I needed right now. I needed to wrap my head around that stupid kiss with Lana. Not face Beau and Ash. Beau’s truck door swung open and he got out with an angry snarl on his face. What was his deal? “Better be a damn good reason you’re parked in Ash’s drive.” Adjusting to Beau being a caveman over a girl had been almost as hard as seeing him with Ash. Beau didn’t do jealous, until Ashton had become his. Now, he was a freaking lunatic. “I just dropped Lana off,” I replied, meeting his angry glare. I wasn’t scared of his stupid tough guy shit. I’d been in more fights with him than I could count. My answer obviously confused him because he raised one eyebrow then turned to look at Ash as she scooted out behind him on the driver’s side. “She’s here?” Ash squealed, jumping down before Beau could catch her. “Remember, I told you Lana was coming tonight,” she beamed up at Beau then frowned and looked over at me. “Why... how did you get her?” Ash was adorable when she was confused. “She was eating dinner at Wings when we stopped in to eat. I offered to give her a ride to save her friend the trip.” Ashton’s frown turned up into a smile again. I liked making her smile—always had. “Thank you! I’m so glad you met up with her.” Ash turned and wrapped her arms around Beau and laid a loud quick kiss on his lips before releasing him and stepping back, “I gotta go see her. I haven’t seen her in months. Call me later.” Beau grabbed her hand and turned it palm up before kissing it and then licking it. Gross, I did not want to see this. “Yeah, I’ll call you when I crawl in bed,” his voice dropped until it was much deeper than normal and I swear I heard Ashton sigh. I’d seen more than I wanted. I started to climb up in my truck. “Sawyer, wait,” Beau’s command stopped me. I really just wanted to leave but he was blocking me in so I couldn’t exactly escape. Ashton ran inside and once she closed the door, Beau turned his gaze toward me. “About tonight. Don’t do that again. It’s been six months and Ashton goes out of her way to be kind to you. You talk to her that way again and I’m gonna kick your ass.” Figures it wasn’t an apology but a threat. But he was right, I had been a jerk to Ashton. I didn’t want to push either of them away. They both knew me better than anyone. They’d been my best friends all my life. We shared a secret and we shared memories. It formed a bond so important that I’d given up Ash without much of a fight in order to preserve. “You’re right. I was a jackass. I’ll apologize to her next time I see her.” Beau seemed appeased. His eyes shifted back to her now lit bedroom window. She and Lana would be inside talking and I wondered if I’d have something else to apologize for the next time I saw her. Because if Lana told her about that kiss then Ash would be pissed. Not because I kissed Lana but because I’d been a complete dick afterwards. “Good,” Beau started to get into his truck and stopped. “Hey you, wanna go play some pool?” “Aunt Honey working?” “Yep.” That meant free beer. I nodded, “Lead the way.” Lana I’d barely made it inside the door when Ashton had come racing inside squealing. She’d made quick work of getting us past her parents and their questions concerning my parents and up to her room. She closed the door and spun around smiling brightly at me. “I am so glad you’re here.” Her long blond hair was hanging loose down her back and her golden tan was already perfect. How did she do that? It had been summer for what now—a week? We shared the same green eyes. That was it. When I was younger, I’d hated her. Not because she was mean but because she looked like a Barbie doll. To retaliate, I’d been the one who was mean. “Me too,” I replied when she plunked down on the bed beside me. Getting away from my mother and her endless griping about my dad was a major relief. They’d been officially divorced now for three months but she still ranted about him daily. “We’re going to have so much fun. Kayla Jenkins’ birthday is tomorrow night and she’s having a huge party at her house. She throws one every year. You’ll love it and get to meet everyone. Then Beau and I have been talking about a camping trip. Maybe for a week up at Cheaha. We’re going to invite Sawyer, since hiking is his thing, and some other people. You, of course, are coming too. Then Leann is at the beach all summer at her grandmother’s beach house. So, I told her we’d come visit her one week.” Forcing a smile was hard but I somehow managed. Pushing Sawyer’s reaction to our kiss as far away from my mind as I could, I put all my focus into talking to Ashton. “That all sounds like fun. I’m game for whatever,” I assured her. Leaning forward she touched my hair and studied my face. Then her face broke into a huge grin, “You’re wearing makeup and your hair is darker and...,” she studied my skirt and top. “You have stylish clothes.” “I decided it was time for a change,” I replied, unable to suppress my smile. “Well, you look hot.” Ashton stood up and started pulling off the cowboy boots she’d been wearing with a black sundress that barely made it halfway to her knees. It was like God had decided to try his hand at making someone perfect and chose Ashton as his experiment. “Sawyer said he brought you home. How was he? I mean, was he in a good mood?” I wasn’t sure how I felt about Ashton still worrying about Sawyer. I hadn’t expected this when I’d planned to spend the summer here. It had been six months since the breakup. Normal people moved on in six months, didn’t they? I mean, she was with Beau now. Shouldn’t everything be water under the bridge at this point? “He, uh, was fine.” Okay, so that was a lie but I wanted to protect him from her. He wouldn’t want Ashton to know he was still affected by her and Beau. She let out a sigh and plopped back down on the bed folding her legs up underneath her and facing me. “Good. He and Beau kind of had some words at the field tonight. I had to jump in Beau’s arms to keep them from tearing it up. That’s why he left and ended up at Wings.” I hadn’t seen them fight since we were kids. Surely, they weren’t fighting over Ashton still. “What happened?” I asked, knowing I probably didn’t want to hear this. “Stupid stuff. Beau didn’t like the way Sawyer spoke to me. It wasn’t a big deal but Beau got real upset and went on the defensive. They still haven’t found a way to handle me being in the middle.” The last time I’d been sitting on her bed talking about the Vincent boys I had told her that she needed to let both of them go. Even then, I knew she wouldn’t be able to. They were so much a part of her life. Beau, especially. “Is Sawyer dating?” I asked, trying to sound as casual as possible. Ashton let out a short laugh, “I wish.” That was odd. He was gorgeous, talented, athletic, polite, and funny—how did someone like him go six months without some girl managing to snag a date? “Not even one date?” Ashton shrugged and pulled her knees up to her chin wrapping her arms around the front of her legs. “I think maybe one or two dates. Not sure. I don’t ask, really. Sawyer still acts weird around me and Beau gets very territorial if I bring up Sawyer. He doesn’t like me talking about him much.” How sad for Sawyer. Ashton had been a big part of his life since they were twelve. Now, he couldn’t really talk to her anymore without Beau standing over them. As much as I wanted Sawyer to be over Ashton, I didn’t like the picture in my head. Sawyer, alone, bothered me. He didn’t deserve that. He’d been so good to both of them. Welcome to the Jungle started blaring and Ashton reached for her cell phone on the table beside the bed. “You cannot already be in bed,” Ashton purred into the phone. It had to be Beau. “Really? Oh, okay, well that’s good. I’m glad the two of you are out together.” My ears perked up and I studied my fingernails trying to appear as if I weren’t completely curious about this conversation. “I love you too. Be careful and remember he doesn’t drink much so get him home safe.” Was Sawyer drinking? With Beau? Ashton smiled, “No, I love you more.” Oh, please. “I’ll keep it beside my pillow. Call me as soon as you get home.” “Yes, we’re catching up,” she lifted her eyes to smile brightly at me. “Okay, love you, bye.” She dropped her phone in her lap and let out a happy sigh. “I know you don’t like how things went down and that Sawyer was hurt but I love Beau so much, Lana. I’d do it all over again if I had to. I hated hurting Sawyer, I really did. I’ve never been so happy. Beau is wonderful.” Her voice went all dreamy and I fought the urge to roll my eyes.","sourceLink":"https://allnovel.net/the-vincent-brothers-the-vincent-boys-2/page-5.html","bookId":1997,"book":{"id":1997,"title":"The Vincent Brothers (The Vincent Boys #2)","description":"Storyline: The Vincent Brothers (The Vincent Boys #2) Getting a boy to fall head-over-heels in love with you isn’t easy. Especially when he’s been in love with your cousin for as long as you can remember. Lana has lived her life in her cousin’s shadow. Ashton always made perfect grades, had tons of friends, and looks model-perfect. And she’s always had Sawyer Vincent—the only boy Lana’s ever wanted—wrapped around her finger. But now things are different. Lana has a chance to make Sawyer see her, and she’s taking it. If only he’d get over Ashton—because Lana is sick of second-best. Sawyer’s heart is broken. He’s lost his best girl to his best friend. And then Lana comes to town. Ashton’s cousin has always been sweet and soft-spoken, but now she’s drop-dead gorgeous as well. Sawyer doesn’t know if Lana can heal his broken heart, but spending time with her might at least make Ashton jealous. What starts as a carefree fling becomes a lusty game of seduction. Sawyer and Lana may have different motives, but their scintillating hookups are the same kind of steamy. . . .","cover":"https://allnovel.net/images/the-vincent-brothers-the-vincent-boys-2.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-vincent-brothers-the-vincent-boys-2.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 10:33:01 AM"}}
