{"id":39516,"no":4,"title":"CHAPTER FOUR OVER THE BARREL","content":"AFTER LUNCHEON -the traditional shrimp cocktail, \u0027native\u0027 snapper with a minute paper cup of tartare sauce, roast prime ribs of beef au jus, and pineapple surprise- it was time for the siesta before meeting Goldfinger at three o\u0027clock for the afternoon session. Mr Du Pont, who had lost a further ten thousand dollars or more, confirmed that Goldfinger had a secretary. \u0027Never seen her. Sticks to the suite. Probably just some chorine he\u0027s brought down for the ride.\u0027 He smiled wetly. \u0027I mean the daily ride. Why? You on to something?\u0027 Bond was non-committal. \u0027Can\u0027t tell yet. I probably won\u0027t be coming down this afternoon. Say I got bored watching -gone into the town.\u0027 He paused. \u0027But if my idea\u0027s right, don\u0027t be surprised at what may happen. If Goldfinger starts to behave oddly, just sit quiet and watch. I\u0027m not promising anything. I think I\u0027ve got him, but I may be wrong.\u0027 Mr Du Pont was enthusiastic. \u0027Good for you, boyo!\u0027 he said effusively. \u0027I just can\u0027t wait to see that bastard over the barrel. Damn his eyes!\u0027 Bond took the elevator up to his suite. He went to his suitcase and extracted an M3 Leica, an MC exposure meter, a K2 filter and a flash-holder. He put a bulb in the holder and checked the camera. He went to his balcony, glanced at the sun to estimate where it would be at about three-thirty and went back into the sitting-room, leaving the door to the balcony open. He stood at the balcony door and aimed the exposure meter. The exposure was one-hundredth of a second. He set this on the Leica, put the shutter at f 11, and the distance at twelve feet. He clipped on a lens hood and took one picture to see that all was working. Then he wound on the film, slipped in the flash-holder and put the camera aside. Bond went to his suitcase and took out a thick book - The Bible Designed to be Read as Literature- opened it and extracted his Walther PPK in the Berns Martin holster. He slipped the holster inside his trouser band to the left. He tried one or two quick draws. They were satisfactory. He closely examined the geography of his suite, on the assumption that it would be exactly similar to the Hawaii. He visualized the scene that would almost certainly greet him when he came through the door of the suite downstairs. He tried his pass-key in the various locks and practised opening the doors noiselessly. Then he pulled a comfortable chair in front of the open balcony door and sat and smoked a cigarette while he gazed out across the sea and thought of how he would put things to Goldfinger when the time came. At three-fifteen, Bond got up and went out on to the balcony and cautiously looked down at the two tiny figures across the square of green baize. He went back into the room and checked the exposure meter on the Leica. The light was the same. He slipped on the coat of his dark blue tropical worsted suit, straightened his tie and slung the strap of the Leica round his neck so that the camera hung at his chest. Then, with a last look round, he went out and along to the elevator. He rode down to the ground floor and examined the shop windows in the foyer. When the elevator had gone up again, he walked to the staircase and slowly climbed up two floors. The geography of the second floor was identical with the twelfth. Room 200 was where he had expected it to be. There was no one in sight. He took out his pass-key and silently opened the door and closed it behind him. In the small lobby, a raincoat, a light camel-hair coat and a pale grey Homburg hung on hooks. Bond took his Leica firmly in his right hand, held it up close to his face and gently tried the door to the sitting-room: It was not locked. Bond eased it open. Even before he could see what he expected to see he could hear the voice. It was a low, attractive, girl\u0027s voice, an English voice. It was saying, \u0027Drew five and four. Completed canasta in fives with two twos. Discarding four. Has singletons in king\u0027s, knaves, nines, sevens.\u0027 Bond slid into the room. The girl was sitting on two cushions on top of a table which had been pulled up a yard inside the open balcony door. She had needed the cushions to give her height. It was at the top of the afternoon heat and she was naked except for a black brassiere and black silk briefs. She was swinging her legs in a bored fashion. She had just finished painting the nails on her left hand. Now she stretched the hand out in front of her to examine the effect. She brought the hand back close to her lips and blew on the nails. Her right hand reached sideways and put the brush back in the Revlon bottle on the table beside her. A few inches from her eyes were the eyepieces of a powerful-looking pair of binoculars supported on a tripod whose feet reached down between her sunburned legs to the floor. Jutting out from below the binoculars was a microphone from which wires led to a box about the size of a portable record player under the table. Other wires ran from the box to a gleaming indoor aerial on the sideboard against the wall. The briefs tightened as she leant forward again and put her eyes to the binoculars. \u0027Drew a queen and a king. Meld of queens. Can meld kings with a joker. Discarding seven.\u0027 She switched off the microphone. While she was concentrating, Bond stepped swiftly across the floor until he was almost behind her. There was a chair. He stood on it, praying it wouldn\u0027t squeak. Now he had the height to get the whole scene in focus. He put his eye to the viewfinder. Yes, there it was, all in line, the girl\u0027s head, the edge of the binoculars, the microphone and, twenty yards below, the two men at the table with Mr Du Font\u0027s hand of cards held in front of him. Bond could distinguish the reds and the blacks. He pressed the button. The sharp explosion of the bulb and the blinding flash of light forced a quick scream out of the girl. She swivelled round. Bond stepped down off the chair. \u0027Good afternoon.\u0027 \u0027Whoryou? Whatyouwant?\u0027 The girl\u0027s hand was up to her mouth. Her eyes screamed at him. \u0027I\u0027ve got what I want. Don\u0027t worry. It\u0027s all over now. And my^jmme\u0027s Bond, James Bond.\u0027 Bond put his camera carefully down on the chair and came and stood in the radius of her scent. She was very beautiful. She had the palest blonde hair. It fell heavily to her shoulders, unfashionably long. Her eyes were deep blue against a lightly sunburned skin and her mouth was bold and generous and would have a lovely smile. She stood up and took her hand away from her mouth. She was tall, perhaps five feet ten, and her arms and legs looked firm as if she might be a swimmer. Her breasts thrust against the black silk of the brassiere. Some of the fear had gone out of her eyes. She said in a low voice, \u0027What are you going to do?\u0027 \u0027Nothing to you. I may tease Goldfinger a bit. Move over like a good girl and let me have a look.\u0027 Bond took the girl\u0027s place and looked through the glasses. The game was going on normally. Goldfinger showed no sign that his communications had broken down. \u0027Doesn\u0027t he mind not getting the signals? Will he stop playing?\u0027 She said hesitatingly, \u0027It\u0027s happened before when a plug pulled or something. He just waits for me to come through again.\u0027 Bond smiled at her. \u0027Well, let\u0027s let him stew for a bit. Have a cigarette and relax,\u0027 he held out a packet of Chesterfields. She took one. \u0027Anyway it\u0027s time you did the nails on your right hand.\u0027 A smile flickered across her mouth. \u0027How long were you there? You gave me a frightful shock.\u0027 \u0027Not long, and I\u0027m sorry about the shock. Goldfinger\u0027s been giving poor old Mr Du Pont shocks for a whole week.\u0027 \u0027Yes,\u0027 she said doubtfully. \u0027I suppose it\u0027s really rather mean. But he\u0027s very rich, isn\u0027t he?\u0027 \u0027Oh yes. I shouldn\u0027t lose any sleep over Mr Du Pont. But Goldfinger might choose someone who can\u0027t afford it. Anyway, he\u0027s a millionaire himself. Why does he do it? He\u0027s crawling with money.\u0027 Animation flooded back into her face. \u0027I know. I simply can\u0027t understand him. It\u0027s a sort of mania with him, making money. He can\u0027t leave it alone. I\u0027ve asked him why and all he says is that one\u0027s a fool not to make money when the odds are right. He\u0027s always going on about the same thing, getting the odds right. When he talked me into doing this,\u0027 she waved her cigarette dt the binoculars, \u0027and I asked him why on earth he bothered, took these stupid risks, all he said was, \"That\u0027s the second lesson. When the odds aren\u0027t right, make them right\u0027\" Bond said, \u0027Well, it\u0027s lucky for him I\u0027m not Pinkertons or the Miami Police Department.\u0027 The girl shrugged her shoulders. \u0027Oh, that wouldn\u0027t worry him. He\u0027d just buy you off. He can buy anyone off. No one can resist gold.\u0027 \u0027What do you mean?\u0027 She said indifferently, \u0027He always carries a million dollars\u0027 worth of gold about with him except when he\u0027s going through the Customs. Then he just carries a belt full of gold coins round his stomach. Otherwise it\u0027s in thin sheets in the bottom and sides of his suitcases. They\u0027re really gold suitcases covered with leather.\u0027 \u0027They must weigh a ton.\u0027 \"He always travels by car, one with special springs. And his chauffeur is a huge man. He carries them. No one else touches them.\u0027 \u0027Why does he carry around all that gold?\u0027 \u0027Just in case he needs it. He knows that gold will buy him anything he wants. It\u0027s all twenty-four carat. And anyway he loves gold, really loves it like people love jewels or stamps or - well,\u0027 she smiled, \u0027women.\u0027 Bond smiled back. \u0027Does he love you?\u0027 She blushed and said indignantly, \u0027Certainly not.\u0027 Then, more reasonably, \u0027Of course you can think anything you like. But really he doesn\u0027t. I mean, I think he likes people to think that we - that I\u0027m - that it\u0027s a question of love and all that. You know. He\u0027s not very prepossessing and I suppose it\u0027s a question of - well - of vanity or something.\u0027 \u0027Yes, I see. So you\u0027re just a kind of secretary?\u0027 \u0027Companion,\u0027 she corrected him. \u0027I don\u0027t have to type or anything.\u0027 She suddenly put her hand up to her mouth. \u0027Oh, but I shouldn\u0027t be telling you all this! You won\u0027t tell him, will you? He\u0027d fire me.\u0027 Fright came into her eyes. \u0027Or something. I don\u0027t know what he\u0027d do. He\u0027s the sort of man who might do anything.\u0027 \u0027Of course I won\u0027t tell. But this can\u0027t be much of a life for you. Why do you do it?\u0027 She said tartly, \u0027A hundred pounds a week and all this,\u0027 she waved at the room,\u0027doesn\u0027t grow on trees. I save up. When I\u0027ve saved enough I shall go.\u0027 Bond wondered if Goldfinger would let her. Wouldn\u0027t she know too much? He looked at the beautiful face, the splendid, unselfconscious body. She might not suspect it, but, for his money, she was in very bad trouble with this man. The girl was fidgeting. Now she said with an embarrassed laugh, \u0027I don\u0027t think I\u0027m very properly dressed. Can\u0027t I go and put something on over these?\u0027 Bond wasn\u0027t sure he could trust her. It wasn\u0027t he who was paying the hundred pounds a week. He said airily, \u0027You look fine. Just as respectable as those hundreds of people round the pool. Anyway,\u0027 he stretched, \u0027it\u0027s about time to fight a fire under Mr Goldfinger.\u0027 Bond had been glancing down at the game from time to time. It seemed to be proceeding normally. Bond bent again to the binoculars. Already Mr Du Pont seemed to be a new man, his gestures were expansive, the half-profile of his pink face was full of animation. While Bond watched, he took a fistful of cards out of his hand and spread them down - a pure canasta in kings. Bond tilted the binoculars up an inch. The big red-brown moon face was impassive, uninterested. Mr Goldfinger was waiting patiently for the odds to adjust themselves back in his favour. While Bond watched, he put up a hand to the hearing aid, pushing the amplifier more firmly into his ear, ready for the signals to come through again. Bond stepped back. \u0027Neat little machine,\u0027 he commented. \"What are you transmitting on?\u0027 \u0027He told me, but I can\u0027t remember.\u0027 She screwed up her eyes. \u0027A hundred and seventy somethings. Would it be mega-somethings?\u0027 \u0027Megacycles. Might be, but I\u0027d be surprised if he doesn\u0027t get a lot of taxicabs and police messages mixed up with your talk. Must have fiendish concentration.\u0027 Bond grinned. \u0027Now then. All set? It\u0027s time to pull the rug away.\u0027 Suddenly she reached out and put a hand on his sleeve. There was a Claddagh ring on the middle finger - two gold hands clasped round a gold heart. There were tears in her voice. \u0027Must you? Can\u0027t you leave him alone? I don\u0027t know what he\u0027ll do to me. Please.\u0027 She hesitated. She was blushing furiously. \u0027And I like you. It\u0027s a long time since I\u0027ve seen someone like you. Couldn\u0027t you just stay here for a little more?\u0027 She looked down at the ground. \u0027If only you\u0027d leave him alone I\u0027d do\u0027 - the words came out in a rush - \u0027I\u0027d do anything.\u0027 Bond smiled. He took the girl\u0027s hand off his arm and squeezed it. \u0027Sorry. I\u0027m being paid to do this job and I must do it. Anyway\u0027 - his voice went flat - \u0027I want to do it. It\u0027s time someone cut Mr Goldfinger down to size. Ready?\u0027 Without waiting for an answer he bent to the binoculars. They were still focused on Goldfinger. Bond cleared his throat. He watched the big face carefully. His hand felt for the microphone switch and pressed it down. There must have been a whisper of static in the deaf aid. Goldfinger\u0027s expression didn\u0027t alter, but he slowly raised his face to heaven and then down again, as if in benediction. Bond spoke softly, menacingly into the microphone. \u0027Now hear me, Goldfinger.\u0027 He paused. Not a flicker of expression, but Goldfinger bent his head a fraction as if listening. He studied his cards intently, his hands quite still. \u0027This is James Bond speaking. Remember me? The game\u0027s finished and it\u0027s time to pay. I have a photograph of the whole set-up, blonde, binoculars, microphone and you and your hearing aid. This photograph will not go to the FBI and Scotland Yard so long as you obey me exactly. Nod your head if you understand.\u0027 The face was still expressionless. Slowly the big round head bent forward and then straightened itself. \u0027Put your cards down face upwards on the table.\u0027 The hands went down. They opened and the cards slid off the fingers on to the table. \u0027Take out your cheque book and write a cheque to cash for fifty thousand dollars. That is made up as follows, thirty-five you have taken from Mr Du Pont. Ten for my fee. The extra five for wasting so much of Mr Du Font\u0027s valuable time.\u0027 Bond watched to see that his order was being obeyed. He took a glance at Mr Du Pont. Mr Du Pont was leaning forward, gaping. Mr Goldfinger slowly detached the cheque and countersigned it on the back.\u0027 \u0027Right. Now jot this down on the back of your cheque book and see you get it right. Book me a compartment on the Silver Meteor to New York tonight. Have a bottle of vintage champagne on ice in the compartment and plenty of caviar sandwiches. The best caviar. And keep away from me. And no monkey business. The photograph will be in the mails with a full report to be opened and acted upon if I don\u0027t show up in good health in New York tomorrow. Nod if you understand.\u0027 Again the big head came slowly down and up again. Now there were traces of sweat on the high, unlined forehead. \u0027Right, now hand the cheque across to Mr Du Pont and say, \"I apologize humbly. I have been cheating you.\" Then you can go.\u0027 Bond watched the hand go across and drop the cheque in front of Mr Du Pont. The mouth opened and spoke. The eyes were placid, slow. Goldfinger had relaxed. It was only money. He had paid his way out. \u0027Just a moment, Goldfinger, you\u0027re not through yet.\u0027 Bond glanced up at the girl. She was looking at him strangely. There was misery and fear but also a look of submissiveness, of longing. \u0027What\u0027s your name?\u0027 \u0027Jill Masterton.\u0027 \u0027Goldfinger had stood up, was turning away. Bond said sharply, \u0027Stop.\u0027 Goldfinger stopped in mid-stride. Now his eyes looked up at the balcony. They had opened wide, as when Bond had first met him. Their hard, level, X-ray gaze seemed to find the lenses of the binoculars, travel down them and through Bond\u0027s eyes to the back of his skull. They seemed to say, \u0027I shall remember this, Mr Bond.\u0027 Bond said softly, \u0027I\u0027d forgotten. One last thing. I shall be taking a hostage for the ride to New York. Miss Masterton. See that she\u0027s at the train. Oh, and make that compartment a drawing-room. That\u0027s all.\u0027","sourceLink":"http://novel.tingroom.com/jingdian/1564/46380.html","bookId":1276,"book":{"id":1276,"title":"007之Goldfinger 金手指","description":"简介： 世界各国突然出现黄金的大量流失,黄金的黑市交易十分兴盛.虽然各国都对金锭做有记号,可是,经过融化重铸后就毫无迹象可寻.政府部门怀疑巨富金手指参与了黑市黄金交易,因为他作为国际商人可以合法拥有并使用大型铸造设备.他在日内瓦拥有一座大银行,各国都有大量黄金储备在...","cover":"http://novel.tingroom.com/file/upload/201605/24/10-51-50-20-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1564","creation":"Aug 1, 2019 12:24:47 AM","modification":"Aug 1, 2019 12:24:47 AM"}}
