{"id":103437,"no":9,"title":"Page 9","content":"Whatever was outside rattled the flap near his toes. Damn, he had forgotten to fasten the door! Sam sprang up in his sleeping bag and snatched the rifle up in his fist. As he swung the rifle back, the flap was torn open. “Sam, are you awake?” Maggie peeked her head under the flap and made a halfhearted effort to knock on the canvas side of the tent. Sam lowered the rifle to his lap, his heart still pounding in his ears. He swallowed hard to clear his throat and forced his voice into a nonchalant tone. “Yeah, I’m up, Maggie. What’s the matter?” “I couldn’t sleep and got to thinking about those etchings. I needed to run something by you.” Sam had some fantasies of Maggie sneaking to his tent in the dead of night, but none of them involved discussing ancient Latin etchings. Still, any nighttime visit from Maggie was welcome. “Okay. Give me a sec’.” Rolling out of his sleeping bag, he slipped his Wranglers over his boxers. With a night this muggy, he wouldn’t normally bother with a shirt, but with Maggie out there, modesty more than comfort mattered. Sam pulled a leather vest over his shoulders. Grabbing his Stetson, he pulled down the zipper to the tent and pushed through into the night. Silver glow from a full moon washed over the camp, paling the four spotlights at the camp’s periphery. He swiped his disheveled hair back from his forehead and trapped it under his hat. Maggie stepped back. She still wore the same khaki pants with a matching vest over a blood-red shirt. The only indication that Maggie had made any effort at relaxing this night was that she had untied her hair from its usual ponytail. Cascades of auburn curls, frosted silver by the night, flowed over her shoulders. Transfixed by the play of moonlight across Maggie’s cheeks and lips, Sam had to search for his voice. “So… what’s up?” As usual, her eyes didn’t seem to see Sam. “It’s that writing on the last band. The bottom one. Those missing words an’ lines. Latin’s a weird language. A single word can change the entire meaning of the message.” “Yeah?” “What if we’re not reading it right? What if one of those missing words or lines negates our translation?” “Maybe it might… but tomorrow we’ll know the truth anyway. When we crack the tomb in the morning, it’ll be intact or it won’t.” A hint of irritation entered her voice. “Sam, I want to know before we open the tomb. Don’t you want to know what the conquistadors really meant to communicate on those bands?” “Sure, but the words are illegible.” “I know, Sam… but that was with just alcohol cleaning.” She looked at him meaningfully. Suddenly Sam knew why Maggie had roused him. He kept his lips clamped tight. Two years ago, he had presented a paper on the use of a phosphorescent dye to detect and bring out the faint written images worn by time on rock and metal. He had been uniformly scoffed at for his idea. “You packed your stuff, didn’t you?” Maggie said. “I don’t know what you’re talking about,” Sam mumbled. He had told no one, not even his uncle, that he had refused to abandon his theory, spending years researching the various viscosities of different dyes and ranges of UV light. He had kept his studies under close wrap, not wanting to humiliate himself until he could test it in the field, try it when no one else was around to ridicule him. Suddenly he realized he was not unlike his uncle in keeping secrets. Maggie’s eyes glowed in the dark. “I read your paper. You found a way to make it work, didn’t you, Sam?” He just stood, unblinking. How had she known? Finally, the shock faded enough for him to speak. “I think I solved it. But I haven’t had a chance to put it through a field trial.” Maggie pointed toward the ruins. “Then it’s about time. The others are already waiting for us by the entrance to the excavation.” She turned to leave. “Others?” Glancing back over her shoulders, Maggie frowned. “Ah sure, Sam… Norman and Ralph. They should be in on this.” “I suppose.” Sam rolled his eyes, preparing himself to be humiliated if he should fail. At least, Philip had not been invited. Sam could not have tolerated failing in front of Mr. Harvard. “Let me grab my bottles and UV light.” As Sam reached for his tent flap, the jungle suddenly erupted in a cacophony of screeches and calls. A thousand birds burst from the canopies around the camp and took to the air. Maggie took a step closer to Sam. “What the hell…?” Sam glanced around, but the rain forest quickly settled back down. “Something must have spooked them.” He listened a bit longer, but only the humming of the generator reached his ears. The jungle lay silent, like a dark stranger staring toward them. Sam studied the forest a moment more, then turned back to his tent. “I’ll get my stuff.” He pushed through the flap and collected the satchel that held his dyes and special ultraviolet handlamp. As he was leaving, his eyes settled on the old Winchester. Instinctively, he grabbed it and slung it over his shoulder, but not before quickly loading a few 44/40 cartridges into the rifle’s magazine and pocketing a cardboard box of spare shells. After years of overnight camps in the Texas wilderness, Sam had learned to be prepared. Crawling out of the tent, he found Maggie’s back to him. She searched the edges of the jungle. “It’s still so bloody quiet,” she said. “It’s like the forest’s holding its breath.” “If we want to test this,” Sam said, anxious to be under way, “we’d better hightail it. Dawn is only a few hours away.” Maggie nodded, reluctantly pulling her gaze away from the jungle. Sam led the way toward the terraced ruins. With the rain forest so subdued, their footsteps on the granite stones seemed unusually loud. Sam found himself walking carefully, afraid of disturbing the silence, as though they were strolling through a graveyard at midnight. He was glad when they finally reached the summit of the Sun Plaza. Light shone up from the excavated shaft. Limned in the light were two shadowy figures—one thin and one wide. Norman and Ralph. They stood apart from one another. The ex-linebacker raised a hand in greeting. He pointed toward the shaft. “Who left the lamps on?” Maggie shook her head as she climbed onto the flat-topped plaza. “I know I switched them off.” She surveyed the ruins around them. “That feckin’ Guillermo probably turned them on during his rounds and left ‘em on. Where is he anyway? I thought he was supposed to be guarding this place.” “He’s probably in the forest watching out for those looters from last night. Maybe he was the one who spooked all those birds.” The jungle remained deathly still. Norman eyed the black forest. “I never liked the dark. I get the willies alone in my darkroom at home.” Ralph teased him with a remarkable rendition of the Twilight Zone theme. Norman pretended not to hear. Sam climbed down first while Maggie and the others followed. Once at the bottom of the ladder, he helped Maggie off the rungs. She turned to him, her head slightly bent, her palm still resting in his. “Did you hear something just then?” Sam shook his head. All he could hear was his own pounding heart. He found his hand squeezing hers. Ralph and Norman joined them. Maggie pulled her hand away, listened for a moment more, then shrugged and took the lead. “Must be those Incan ghosts,” she muttered. “Thanks, Maggie,” Norman said sourly. “That’s just what I wanted to hear when crawling through the ruins at midnight. I already got a bad enough feeling about this.” Ralph again started his Twilight Zone theme. “Bite me, Isaacson,” Norman snapped. “I don’t lean that way, Normie.” “Are you sure? You were a football player, weren’t you? What’s with all that ass slapping and piling on one another?” “Shut up.” “Jesus,” Maggie exclaimed. “Enough from the both of you. I can’t hear a feckin’ thing.” Following behind Maggie, Sam ignored them all, lost in appreciating how Maggie moved as she climbed. Through the thin cotton khakis, her legs were muscled and firm and their shapeliness drew his eyes up her curves. Sam swallowed hard and wiped the dampness from his brow with a handkerchief. She’s a colleague, he had to remind himself. Like the army, his uncle frowned on fraternization while in the field. Unwanted attentions among members could strain a small site. Still, it never hurt to look. As they traversed to the second level of the dig, Sam marveled at his uncle’s revelation. This was once a Moche pyramid! It was hard to believe. Sam ran a palm along the granite stone walls. Ahead, Maggie stopped again, pausing with her hand on the ladder that led to the third level. “Now I know I heard something,” she whispered. “Words… and somethin’ knocking…” Sam strained to hear, but he still heard nothing. He glanced to Ralph and Norman. Both men shook their heads. Norman’s eyes were huge behind his eyeglasses. Sam swung back to Maggie, ready to dismiss her worry, when a scream burst from below, blowing past them like a frightened bird. Maggie turned wide eyes toward Sam. Sam swung the Winchester from his shoulder. Gil studied the metal tiles all around him. The gears of the hidden mechanism ticked and groaned behind the walls. Miguel shared the gold square with him, crowding Gil’s right side. The squat man’s eyes were wide with fear, and words of prayer whispered from his lips. Gil ignored him. No gods would protect them there. Survival was up to them. But Gil was not only interested in survival. His eyes kept drifting to the wealth at the feet of the golden idol. Counting, Gil noted that fifteen rows of tiles lay between him and the statue of the Incan king, and fifteen rows lay behind him. Fifteen meters either way. Too far to jump. He scowled at the trap, sensing that there must be some key to crossing this floor. He turned in a slow circle. The tiles’ pattern was not that of a checkerboard but a complicated crisscrossing pattern of gold and silver squares. It was not unlike some of the geometric patterns found in the work of Incan tapestries and clothing. There was an order, a clue perhaps to a safe course. But what was it?","sourceLink":"https://allnovel.net/excavation/page-9.html","bookId":1525,"book":{"id":1525,"title":"Excavation","description":"Storyline: A team of explorers and a National Geographic photographer unearth the remains of 500 year old Dominican monk. Etched on his cross is a strange message. His secret tells of something wondrous and terrifying waiting to be unearthed.","cover":"https://allnovel.net/images/excavation.jpg","author":"James Rollins","type":"Adventure","source":"allnovel","link":"https://allnovel.net/excavation.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 9:47:14 AM"}}
