{"id":40792,"no":40,"title":"CHAPTER XXXIX. FRONTIER REGIMENTS.","content":"\n The south-west of Transylvania used to form part of the territory called the Milit?r-Grenze (military frontier)—a peculiar institution now extinct, which, interesting as being to some extent of Roman origin, may here claim a few lines of notice. \n \n When the Roman conquerors had taken possession of the countries north of the Danube, they found it necessary to organize a sort of standing rampart of troops to be always at hand, ready to oppose unexpected attacks from the barbarian hordes on the other side. These soldiers, who might be designated as military agriculturists, found their sustenance in cultivating the ground assigned to each of them, and, being always ready on the spot, could be speedily formed in line at the slightest alarm of an enemy. \n \n Similar circumstances caused the Hungarian kings to imitate these institutions, and organize the population of the southern frontier to that purpose, allotting to them the task of protecting the country against the frequent invasions of Turks. Not content, however, with resisting attacks from without, these troops often adopted an offensive line of action, making raids over the frontier to plunder, burn, and massacre in the enemy’s country. The continual state of skirmishing warfare resulting from these arrangements kept up the martial spirit of the population, and many are the legends recorded of doughty deeds accomplished at that time. \n \n After the fall of the Hungarian kingdom in 1526, the noblemen subscribed among themselves to keep up the frontier in the same fashion, often availing themselves of the assistance of these troops in their attempted insurrections against Austria. \n \n But the Hungarian soldiers, who in this somewhat rough school of chivalry had acquired objectionable habits—such, for instance, as that of bringing back their enemies’ heads attached to the saddle-bow whenever they returned from a skirmish—had, despite their evident utility, fallen into bad odor at Vienna; so when the Hungarian nobles themselves lost their independence, these frontier troops were suffered{289} to fall into disorganization. Only after Maria Theresa had ascended the throne, and, having consolidated the Austrian power, obtained for herself and her descendants the irrevocable right to the Hungarian crown, was it thought necessary to reorganize in more regular fashion this living rampart along the frontier, with a view to keeping out the Turks, who were again showing signs of being troublesome. Accordingly, the population of the whole southern frontier, from Poland to the Adriatic, was classified in military companies and regiments, and the ground distributed to the peasants under condition that they and their children should live and die on the spot, their sons inheriting the obligation of serving in like manner as their fathers. \n \n Of these frontier regiments, altogether fourteen in number, six were created in Transylvania. Of these two infantry and one dragoon regiment were recruited from the Wallachian population; the remaining three, two infantry and one hussar, from the Hungarians. \n \n This system was carried out without trouble in the provinces recently reconquered from the Turks, which, being thinly populated, offered greater inducements for fresh settlers; but elsewhere, where there already existed a fixed population of Hungarians and Roumanians, there was much difficulty in establishing it. In former days the peasants had consented to pass their life on horseback in order to protect the frontier; but those days were long since gone by when people found such life to be congenial, and many of the novel conditions imposed by the Austrians were exceedingly distasteful. They did not care to be commanded by German officers, nor to feel themselves amalgamated with the Austrian regular troops, liable to be sent to fight on foreign territory. \n \n Among the Wallachians whole villages emigrated in order to evade these new laws. Those who declined to serve, and were not inclined to leave their homes, were driven from their huts at the point of the bayonet, and replaced by other settlers brought from a distance. Much cruelty was resorted to in order to compel their obedience, the Austrians sparing neither fire nor sword to gain their ends; and the year 1784 in particular was most disastrous to those poor people, who, after all, were only trying to escape from unjustifiable tyranny. Also, a few years later, when some of these troops had risen in insurrection, declaring themselves only obliged to defend the frontier, not to espouse foreign quarrels in which Austria alone had a personal interest, whole regiments were decimated, shot down by the{290} cannon; and the place is still shown where the bodies of the victims of this wholesale butchery repose under two giant hillocks. \n \n From an Austrian point of view, no doubt this institution was a most excellent and practical one; eighty thousand trained men, who cost but little in time of peace, were ready at a moment’s notice for war. Before the officer’s dwelling-house at each station stood a high pole, wound over with ropes of straw and other combustible matter, which was set fire to at the slightest alarm of an enemy. The signal being thus taken up and repeated from station to station, the whole frontier was speedily marked out in a fiery line, and the men collected and in arms in an incredibly short space of time. \n \n When serving against an enemy their pay was equal to that of the regular troops, while in time of peace they received no pay except a few kreuzers per day whenever a soldier was on duty—that is, whenever he had frontier inspection. \n \n On these troops devolved the duty of keeping in order all roads, buildings, etc., within their circuit, and nowhere in Hungary and Transylvania were to be found such excellent, well-kept roads, bridges, and buildings as those within the territory of the military frontier. \n \n The men could not marry without permission of their superiors, their sons being, so to say, enrolled as soldiers before their birth; while daughters could only inherit their share of the father’s land on condition of marrying a soldier. \n \n The lot of those born and bred in this species of military bondage has been pathetically rendered in a Hungarian song, of which I offer a translation: \n The wild wood was my native home, \n Though born unto a soldier’s doom. \n Amid the green leaves sighing, \n And gentle cushats crying, \n My father nurtured me. \n But soon as I, a stripling grown, \n Could sit a horse’s back alone, \n I to the plough remaining, \n My sire must go campaigning \n Against the French afar. \n Drive furrows deeper and more deep! \n Outbursting tears in torrents leap! \n My father ne’er returning, \n My mother pining, yearning, \n Soon wore her life away. \n \n Now we to war to-morrow go; \n The Ruler’s word has bid it so. \n Ah me! ye green leaves sighing, \n And gentle cushats crying, \n When shall I hear you more? \n \n THE ROTHENTHURM PASS. \n \n In former days, when the country was in a state of semi-barbarism, this system answered well enough; the military discipline was in itself an education, and the bribe of becoming landed proprietors induced many, no doubt, to accept the conditions involved. Later on, however, when all peasants obtained possession of the soil they tilled, the tables were turned, and the frontier soldier found himself to be considerably worse off than his neighbor. Likewise, the original reason of these institutions no longer existed; the Ottoman power was rapidly decreasing, and surprises at the frontier were no more to be looked for. The spirit, the adventure, the poetry of warfare (which alone had caused these people to accept their lot) had departed, and they could no longer be induced to let themselves be led to butchery in distant climes to gratify a stranger’s whim. Therefore, in the reorganization of the Austrian army after the disastrous campaign of{292} 1866, these frontier regiments were, like other antiquated institutions, finally abolished, and have left no other trace behind but here and there a ruined watch-tower standing deserted in a mountain wilderness. \n \n Many of the points selected for the erection of these military establishments lay amid the wildest and most beautiful mountain scenery, and for a keen sportsman, or an ardent lover of nature, the lot of an Austrian officer in one of these beautiful wildernesses must have been a very El Dorado. \n \n One of the most beautiful, and from a military point of view, most important, of these military cordon stations was the Rothenthurm Pass (Pass of the Red Tower), so named from the color of a fortress-tower whose ruins may yet be seen beside the road. \n \n This lovely mountain-gorge, traversed by the river Aluta, and to be reached in a pleasant two hours’ drive from Hermanstadt, has been the scene of much cruel strife in by-gone days. Many a time have the wild devastation—bringing hordes poured into the land by this narrow defile; and here it was that in 1493 George Hecht, the burgomaster of Hermanstadt, obtained a signal victory over the Turks, whom he butchered in wholesale fashion, dyeing the river ruddy red, it is said, with the blood of the slain. \n \n Nowadays the river Aluta flows by peaceably enough, and the primitive little inn which stands at the boundary of the two countries offers an inviting retreat to any solitary angler who cares to study the characters of Transylvanian versus Roumanian trout. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2145/60677.html","bookId":480,"book":{"id":480,"title":"The Land Beyond the Forest","description":"简介： In the spring of 1883 my husband was appointed to the command of the cavalry brigade in Transylvania, composed of two hussar regiments, stationed respectively at Hermanstadt and Kronstadta very welcome nomination, as gratifying a long-cherished wish...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2145","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
