{"id":40796,"no":44,"title":"CHAPTER XLIII. THE BRUCKENTHALS.","content":"Among the crooked, irregular houses, low-storied and unpretentious, which form the streets of Hermanstadt, there is one which stands out conspicuous from its neighbors, resembling as it does nothing else in the town. This is the Bruckenthal palace, a stately building which might right well be placed by the side of some of the most aristocratic residences at Vienna, and of which even the Grand Canal at Venice need not be ashamed—but here absolutely out of place and incongruous. Looking like a nobleman amid a group of simple burghers, everything about this building has an air thoroughly aristocratic and grand seignior: the broad two-storied fa?ade richly ornamented, the fantastically wrought iron gratings over the lower windows, the double escutcheon hanging above the stately entrance, even the very garret windows looking out of the high-pitched triple roof, have the appearance of old-fashioned picture-frames which only want to be filled up with appropriate rococo figures. \n \n As we step through the roomy porte-cochère into a spacious court, we glance round half expecting to see a swelling porter or gorgeously attired Suisse prepared to challenge our entrance, and instinctively we fumble in our pocket for our card-case; but no one appears, and all is silent as death. Passing over the grass-grown stones which pave the court, we step through a capacious archway into a second court as large as the first, and surrounded in the same manner by the building running round to form another quadrangle. Here apparently are the stables, as a stone-carved horse’s head above a door at the farther end apprises us, and hither we direct our steps in hopes of finding some stable-boy or groom to guide us, and tell us to whom this vast silent palace belongs. \n \n The stable door is ajar, and we push it open, but pause in astonishment on the threshold, met by the stony stare of countless unseeing{310} eyes. A stable it is undoubtedly, as testify the carved stone cribs and partitioned-off stalls—six stalls on the one side, six on the other, roomy and luxurious, fit only for the pampered stud of a monarch or of an English fox-hunter, but which now, deserted of its rightful occupants, has been usurped by a collection of plaster casts and terra-cotta copies of ancient statues. Where majestic Arabs used formerly to be stabled, now stands a naked simpering Venus, and the Dying Gladiator writhes on the flag-stones once pawed by impatient hoofs. \n \n THE BRUCKENTHAL PALACE.[71] \n \n By-and-by we come across some one, who in a few words gives us the history of the Bruckenthal palace. \n \n Samuel Bruckenthal, of Saxon family, was raised alike to the rank of baron and to the position of governor of Transylvania by the Empress Maria Theresa, this being the first instance of a Saxon being thus distinguished. In this capacity he governed the land for fourteen years, from 1773 to 1787, and much good is recorded of the manner in which he filled his office, and of the benefits he conferred on the land. Baron Samuel Bruckenthal was a special favorite of the great empress, who seems to have overpowered both him and his{311} family with riches and favors of all kinds. Besides this splendid palace (truly magnificent for the country and the time when it was built), and which boasted of a picture-gallery and an exceedingly valuable library, the Bruckenthal family became possessed of extensive landed property, some of which was to belong to them unconditionally, other estates being granted to the family for a period of ninety-nine years, afterwards reverting to the Crown. Likewise, villas and manufactories, summer and winter residences, gardens and hot-houses, which have belonged to them, are to be met with in all directions. \n \n Baron Bruckenthal, who died in 1803, had decreed in his last will, dated 1802, that the gallery and museum he had formed were to be thrown open for the benefit of his Saxon townsmen; while his second heir, Baron Joseph Bruckenthal, further decreed, in a will dated 1867, that in the case of the male line of his family becoming extinct, the palace, inclusive of the picture-gallery, library, etc., should revert to the Evangelical Gymnasium at Hermanstadt, along with the interest of a capital of thirty-six thousand florins, to be expended in keeping up the edifice and adding to the collection. The contingency thus provided for having come to pass a dozen years ago, the directors have appropriated different suites of apartments for various purposes of public utility and instruction. Thus the lofty vaulted stables were found to be conveniently adapted for containing the models for a school of design; while up-stairs the gilded ball-room has been converted into a cabinet of natural history. Here rows of stuffed birds, as well as double-headed lambs, eight-legged puppies, and other such interesting deformities, are ranged on shelves against the crumbling gilt mouldings which run round the room; and tattered remnants of the rich crimson damask once clothing the walls hang rustling against glass jars, in which are displayed the horrid coils of many loathsome reptiles preserved in spirits of wine. Truly a sad downfall for these sumptuous apartments, where high-born dames were wont to glide in stately minuets over the polished floor! \n \n The picture-gallery, opened to the public on appointed days, contains above a thousand pictures, which, filling fifteen rooms, are divided off into the three schools to which they belong—viz., Italian, Dutch, and German. The greater part of these pictures is said to have been purchased from French refugees at the time of the First Revolution, many families having then sought an asylum in Hungary and Transylvania. \n \n {312} \n \n Mr. Boner, in his work on Transylvania, has thought fit to condemn in a wholesale manner the contents of this gallery as “wretched daubs fit only for a broker’s stall,” a verdict as rash as unjust, and which has since been refuted by the opinion of competent judges. Of course, in a small provincial town like Hermanstadt, situated at the extreme east of the Austrian empire, it would be unreasonable to expect to find in a private gallery collected in the eighteenth century priceless chefs-d’?uvres of the kind we travel hundreds of miles to admire in the Louvre or at Dresden. No doubt, also, some of the paintings erroneously attributed to famous masters, such as Rubens or Titian, are but good copies of original works, while the parentage of a good number of others is unknown, or matter for guess-work. Granting all this, however, the wonder is rather, I think, to find such a very presentable collection of paintings of second and third rank in a small country town, among which no intelligent and straightforward connoisseur can fail to pass some hours without both pleasure and profit. \n \n The best picture in the gallery, and the most celebrated, is the portrait of Charles I. of England, and of his wife, Henrietta Maria, by Vandyck, which has brought many Englishmen hither in hopes of purchasing it. \n \n The library, now numbering about forty thousand volumes, is added to each year from part of the legacy attached to the Bruckenthal palace, and is a great boon to the town; for not only does it comprise a comfortable reading-room, to which any one may have gratuitous access, but all sorts of works are freely placed at the disposal of those who wish to study them at home, on condition of signing a voucher by which the party holds himself responsible for loss or damage to the work. \n \n The Bruckenthal library is indeed a great and valuable resource to those banished to this remote corner of the globe, and it is only surprising that more people do not avail themselves of the advantages which permit one to enjoy at home, sometimes for two or three months at a time, several valuable works of history, biography, or science. Some of the editions of older classical authors are most beautifully bound and illustrated with fine copperplates—perfect éditions de luxe, such as one rarely sees nowadays. \n \n Many curious manuscripts, principally relating to the country, are also here to be found; but the gem of the collection, and by far its most interesting and precious object, is a prayer-book of the fifteenth century, which, written on finest vellum, contains six hundred and thirty pages in small quarto, each page being adorned with some of the finest specimens of the illuminated art to be met with anywhere. \n \n The collection of coins is exceedingly remarkable, containing, as it does, abundant specimens of the ancient Greek, Dacian, and Roman coins, which are continually turning up in the soil, as well as of all the various branches of Transylvanian coinage in the Middle Ages. An assemblage of old Saxon ceramic objects, such as jugs and plates, may also be mentioned, as well as samples of old German embroidery, and some exceedingly beautiful pieces of jewellery belonging to the Saxon burgher, and peasant costumes. \n \n The least interesting part of the museum is what is called the African and Japanese Cabinet, hardly deserving such a pompous designation, as the objects it mostly contains (savage weapons, dried alligators, etc., added to the collection some thirty years ago) are by no means more interesting or varied than what one is so tired of beholding in any well-furnished English drawing-room. \n \n There is a legend attached to the Bruckenthal palace which tells us how an old soldier, who had served his emperor faithfully through many years, took his dismission at last, and, with only three coppers in his pocket, prepared to pilger homeward. On his way he was met by an old white-bearded man, who said, “Give me an alms, for all you have is mine.” The soldier replied, “Your gain will not be great, for see, I have got but three kreuzers, but you are welcome to one of them.” Hereupon the old man took one kreuzer, and the soldier proceeded on his way. Soon, however, he was met by another old man, who in like manner demanded an alms, and received a second copper; and this happened again a third time. But when the soldier had thus divested himself of his last coin the third old man thus spoke: “See, I am one and the same as the two old men who begged from you before, and am no other than Christ the Lord. As, therefore, you have been charitable, and have given of the little you had, so will I reward you by granting any boon you choose to ask.” \n \n After the soldier had reflected for a little, he begged for a sack which should have the virtue that, whenever he spoke the words, “Pack yourself in the sack,” man or beast should equally be obliged{314} to creep inside it. “I see,” said the Lord, “that you are a wise man, and do not crave treasures and riches. The sack is yours.” \n \n With this magic sack on his back the soldier wandered on till he reached the town of Hermanstadt. Here he found all the population talking of a ghost in the Bruckenthal palace, which had lately been disturbing the place, and whosoever attempted to pass the night in those rooms was found as a corpse next morning. \n \n On hearing this the veteran went with his sack to old Baron Bruckenthal, and begged for a night’s lodging in those very rooms. In vain the old gentleman warned him of the danger, and prophesied that assuredly he would lose his life. The soldier persisted in his resolution, begging only for the loan of a Bible and two lighted candles. These were given to him, and likewise a copious supper, with wine and roast-meat. However, he ate and drank but sparingly, for he wished to remain wide-awake and sober; but he opened the Bible between the two candles, and read diligently therein. \n \n Shortly before midnight the room began to be unquiet, but the soldier did but read the Bible all the more fervently as the noise increased. Then as twelve o’clock struck there was a sound like the report of a gun, and a leg was seen suspended from the ceiling. \n \n The soldier remained quietly sitting, and said to himself, “Where there is one leg, there must be another too,” and verily a second leg became soon visible beside the first. Quoth the soldier then, “Where there are two legs, there must perforce be body and arms as well,” and without much delay these also made their appearance. Then he said, “A body cannot be without a head,” but hardly had he said the words when the entire figure fell down from the ceiling, and rushing at the soldier, began to strangle him. \n \n Quickly he cried, “Pack yourself in the sack,” and in the self-same instant the ghost was imprisoned, and plaintively begging to be let out again. The soldier at first only permitted the ghost to put out its head, which was quite gray, but it went on begging to be released, and promising to reveal a mighty secret. \n \n Hearing this the soldier opened the sack; but, hardly set free, the spectre again rushed at his throat, so that he had barely time to call out, “Pack yourself in the sack.” \n \n Now, being again in his power, the ghost was forced to confess to the soldier that in these walls there were concealed many barrels containing treasures, and over these it was his mission to watch. It promised{315} to make over in writing a portion of this money to the veteran, and for this purpose begged to have its arms released from the sack in order to sign the document. \n \n This being granted, the ghost a third time attempted the soldier’s life, who, however, used the magic formula once more, and, determined to show no further mercy to his antagonist, cut off the head of the treacherous phantom. \n \n BARON SAMUEL BRUCKENTHAL. \n \n Next morning the inhabitants of Hermanstadt were greatly astonished to find the soldier still alive, and the praise of his valor was in every mouth. Under his directions the walls were now broken open, and within many little barrels were discovered, all containing heavy gold, of which the brave soldier received a handsome portion, sufficient to enable him to live in comfort to the end of his days. \n \n It is to this discovery that many impute the great riches of the{316} Bruckenthal family, and were it not for the valiant soldier the fortune they left behind them would hardly have been so great. \n \n Though the name of Bruckenthal is probably but little known outside Transylvania, and I have failed to find it in several German encyclop?dias, yet here it is a word pregnant with meaning; and people at Hermanstadt are wont to swear by the Bruckenthal palace as the most stable and immutable object within their range of knowledge, just as an Egyptian might swear by the Pyramids or the Sphinx. “May you be lucky as long as the Bruckenthal palace stands,” or “Sooner may the Bruckenthal palace fall down than such and such an event come to pass,” are phrases I have frequently had occasion to hear. \n \n But the memories of the Bruckenthals are not confined to the palace which bears their name. Every vestige of past grandeur or remnant of an extinct luxury, each work of art which comes to light in or about Hermanstadt, may be traced back to this once omnipotent family. If in your country walks you come upon a double row of massive lime-trees, twelve or sixteen perhaps, standing forlorn on the grass, with nothing to explain their presence on a lonely meadow, you are surely informed that these are the last survivors of a stately avenue leading to spacious orangeries in the Bruckenthal time. The orangeries have now disappeared, yet these few old trees linger on with senseless persistency—their snowy blossoms reminding one of powdered heads, their circling branches suggesting wide-hooped skirts setting to each other in the evening breeze, like an ancient quadrille party forgotten in the ball-room, long after the other guests have departed. \n \n If you find an old statue chipped and moss-grown, dreaming away in the shade of a rose-bush which soon will stifle it in thorny embrace, you may take for granted that you are standing on the site of a former Bruckenthal garden. \n \n If in a pawnbroker’s shop you disinter a carved oak chair heavily wreathed in shrouding cobwebs, be sure that it has wandered hither from the old palace on the Ring; and should you chance to espy a rococo mirror, with curiously fretted gold frame, but tarnished and blurred, do not doubt that at some remote period gallant beaux and stately dames of the house of Bruckenthal have mirrored themselves complacently in its surface. \n \n Look closer still in the miscellaneous heap of bric-à-brac which{317} encumbers this same pawnbroker’s back shop, and ten to one you will be able to recognize on some rotting canvas the grim features of old Samuel Bruckenthal himself, or those of his imperial mistress Maria Theresa. \n \n Some of these old portraits, which I passed almost daily in my peregrinations about the town, seemed to look at me so plaintively with their canvas eyes, as though imploring me to release them from their ignoble position, that I had to take pity upon them at last and offer them an asylum in my house. \n \n Few things ever gave me so vivid an impression of the transitory nature of earthly possessions, and the evanescence of power and grandeur, as these scattered relics of an extinct family meeting the eye at every turn; and as the sea of chance was continually casting up some of these shipwrecked treasures, more than one of them happened to drift my way. Thus one day a poor woman brought to my door a delicate little piece of fancy porcelain, which I was glad to purchase for a small sum. About ten inches high, it represents a miniature citron-tree with blossoms and fruit, growing in a gold-hooped tub of exactly the same shape as the wooden cases in which real orange-trees are often planted. An old lady who recollects the vanished days of the Bruckenthal glory recognized this graceful trifle standing on my drawing-room console, and told me that she remembered a whole set of them, pomegranates and citron-trees alternately, with which the table used to be decked out on the occasion of large dinner-parties. \n \n What has become of the many companions of my lonely citron-tree, I wonder? and where are now all the faces that used to meet round that festive board? Tout passe, tout lasse, tout casse! \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2145/60681.html","bookId":480,"book":{"id":480,"title":"The Land Beyond the Forest","description":"简介： In the spring of 1883 my husband was appointed to the command of the cavalry brigade in Transylvania, composed of two hussar regiments, stationed respectively at Hermanstadt and Kronstadta very welcome nomination, as gratifying a long-cherished wish...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2145","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
