{"id":40800,"no":48,"title":"CHAPTER XLVII. JOURNEY FROM HERMANSTADT TO KRONSTADT.","content":"The railway from Hermanstadt to Kronstadt takes us mostly through a rich undulating country, for, leaving the mountains always farther behind us, we near them again only as we approach the end of our journey. Salzburg, or Vizakna as it is named in Hungarian, renowned for its salt-mines, is the first station on the line on leaving Hermanstadt—a melancholy, barren-looking place, seemingly engendered by Nature in one of her most stagnant moods. A wearisome stretch of sandy hillocks, their outlines broken here and there by unsightly cracks and fissures, is all that meets the eye; not a tree or bush to relieve the monotony of the short stunted grass, where starved-looking daisies, and spiritless, emaciated chamomiles, are all the flowers to be seen. No wonder the great white cattle look moody and dissatisfied, as from the sandy cliff above they sullenly gaze down at their own reflections in the dull green waters of the T?k?li Bath. This bath, highly beneficial in cases of acute rheumatism, is nothing more than an old salt-mine dating back to the time of the Romans, and which, through some accident or convulsion of nature, has been flooded. The brine it contains is so strong as to bear up the heaviest bodies and render sinking an impossibility, so that, though of tremendous depth, persons absolutely ignorant of swimming can walk about in it in perfect safety, with head and shoulders well above the surface. There are various other baths in the place, all somewhat weaker than the T?k?li and other salt-mines, which, only worked in winter, yearly furnish some eighty thousand hundred-weight of salt. But the weirdest and gloomiest spot about Salzburg is an old ruined mine, deserted since 1817, and where over three hundred Honved soldiers found their grave in 1849. They fell in battle against the revolutionary Wallachians, and, as the simplest mode of burial, their bodies were thrown down the old shaft, which is over six hundred feet deep and filled with water to about a quarter of its depth. A magnificent echo can be obtained by firing a gun or pistol down{340} the shaft; but it is dangerous to approach the edge, because of earth-slips, for which reason the place is enclosed by a wire railing. However, neither this danger nor the fear of the three hundred ghosts who may well be supposed to haunt the spot is sufficient to restrain the Roumanians from prowling about the place. On fine moonlight nights—as I was told by the revenue officials, whose guard-house is close by—they will let themselves down by ropes to chip off whole sackfuls of salt. Sometimes they are caught in the act by some wide-awake official, who then threatens to cut the rope and send the culprits to rejoin the Honveds below, till the unfortunate wretches are forced to sue for their lives in deadliest fear. The prettiest of the Saxon towns we passed on our way to Kronstadt is Sch?ssburg, situated on the banks of the river. Towers and ramparts peep out tantalizingly from luxurious vegetation, making us long to get out and explore the place; particularly inviting is a steep flight of steps leading to an old church at the top of a hill. It is here that Hungary’s greatest poet, Pet?fi, perished in the battle of Sch?ssburg on the 31st of July, 1849, when the revolted Hungarians, led by the Polish general Bem, were crushed by the superior numbers of the Russian troops come to Austria’s assistance. Pet?fi’s body was never found, nor had any one seen him fall, and for many years periodical reports got afloat in Hungary that the great poet was not dead, but pining away his life in the mines of Siberia. There seems, however, to be no valid reason for believing this tale, and more likely his was one of the many mutilated and unrecognizable corpses which strewed the valley of Sch?ssburg on that disastrous day. SCH?SSBURG. (Reprinted from publication of the Transylvanian Carpathian Society.) To the west of the town we catch sight of a solitary turret perched on the overhanging cliff above the river; it is said to mark the place where a Turkish pacha, besieging the town with his army, was slain by a shot fired from the goldsmiths’ tower. The pacha was buried here sitting on his elephant, and this tower raised above them, while that other tower from whence the shot was fired, held ever since in high honor, was decked out with a golden ceiling. This latter has now fallen into ruin, and the inscription on the pacha’s resting-place has become almost illegible, but the legend still runs in the people’s mouths, and is told in verse as follows: “By Sch?ssburg, on the mountain A turret gray doth stand, {343} And from the heights it gazes Down on the Kokel land. And ne’er a passing wand’rer This turret who doth see, But pauses to inquire here What may its meaning be. “It is a proud remembrance Of doughty deeds and bold. Still faithfully the people Relate this legend old: In by-gone days of trouble Went forth, with sword and brand, A mighty Turkish pacha, To devastate the land. “Thus also would he conquer This ancient Saxon town; But here each man was ready To die for its renown. And there upon the mountain The pacha took his stand, An elephant bestriding, And cimeter in hand. “The mighty Ali Pacha, He swears with curses wild, That by his beard will he destroy The Saxon, chick and child. Then struck the haughty Moslem Full in the breast a ball; With curses yet upon the lip, A death-prey he must fall. “The leaden ball came flying, Full thousand paces two, From out a fortress turret, With deadly aim and true. A sturdy goldsmith was it Who fired this famous shot; The Turkish horde, which seeing, Their courage all forgot. “And panic-struck escaping, Their pacha left to die, The elephant still bestriding, With fixed and glassy eye. Then sallied forth the Saxons As thus the Moslems fled, {344} And gazed on the dead pacha With joy and yet with dread. “They built up Ali Pacha Within that turret gray, From head to foot still armed In battle-field array; His elephant beside him Was buried here as well,[77] And outside an inscription Their history doth tell. “By times a plaintive wailing May here be heard at night; Or chance you to see flitting A phantom figure white, The pacha ’tis, who cannot Find lasting rest, they say, Because ’mid heavy curses His spirit passed away.” Another point of interest we see from the railway is the ruined castle of Marienburg, crowning a bare hill to our right hand, about half an hour before reaching Kronstadt, built by the knights of the Teutonic order during their occupation of the Burzenland in the early part of the thirteenth century. These knights, whose order unites some of the conditions of both Templars and Maltese knights, had been founded in Palestine about the year 1190, for the double purpose of tending wounded crusaders, and, like these, combating the enemies of the Holy Sepulchre. Only Germans of noble birth were admitted as members, under condition of the customary vows of chastity and obedience. They had, however, not been long in existence when their position in Palestine began to grow insecure; and casting about their eyes in search of some more tenable position, they were met half-way by the King of Hungary, Andreas II., who, on his side, was in want of some powerful alliance to secure the eastern provinces of Transylvania against the repeated invasions of the Kumanes. The negotiations between the monarch and the Teutonic order seem to have lasted several years, being finally brought to a conclusion{345} in 1211 in a treaty signed by the King in the presence of eighteen distinguished witnesses. This treaty distinctly sets forth that the part of the country called the Burzenland, and whose boundaries are exactly defined, is bequeathed as an irrevocable gift to the knights of the Teutonic order by the King, who, hoping thereby to obtain pardon of his sins and secure eternal salvation for himself and his ancestors likewise, intrusts to them the defence of the eastern frontier of his kingdom against barbaric invasions. In this document, which is lengthy and involved, are likewise set forth all the rights, obligations, privileges, and restrictions of the said knights. They were exempted from all the usual taxes and tributes to the King, who, however, did not resign his claim to the sovereignty of the land, reserving to himself on all occasions the right of ultimate decision in cases of contested justice. Whatever gold or silver was discovered in the soil was to belong, half to the King, half to the order. Though granting the utmost freedom in all matters relating to trade and commerce, the Hungarian monarch retained the sole right of coinage; and while permitting the knights to erect the wooden fortresses and citadels which were amply sufficient to resist attacks from the barbarians, it was distinctly stipulated that they were not to build castles or fortifications of stone. Barring these few restrictions, the land was to be absolutely their own; and had the knights been wise enough to keep to the compact, no doubt the Teutonic order might yet be flourishing to-day in Transylvania, instead of having been ignominiously expelled after scarce a dozen years’ residence. At first the new arrangement seems to have been most beneficial to the country, for we hear of growing prosperity and of flourishing agriculture and commerce; and many German villages which acknowledged the Teutonic knights as their feudal masters were founded at that time. But the good understanding between King Andreas and the knights was of short duration, for before ten years had elapsed we already read of dissensions cropping up; the knights are accused of extending their boundaries beyond the prescribed limits, of issuing an independent coinage, of building stone castles, and of bribing away German colonists to settle on their own land to the detriment of other provinces—all of which things were distinctly interdicted by the terms of agreement. Many stories, too, are told of their cruel tyranny towards unfortunate serfs—such, for instance, as compelling several hundreds of them to pass whole nights in the marshes round Marienburg,{346} each man armed with a long switch wherewith to flog the troublesome frogs, whose croaking disturbed the slumbers of the holy men up in the castle. King Andreas, who was of a weak, vacillating disposition, was easily persuaded by counsellors antagonistic to the order to revoke the deed of gift, which proclamation was issued in 1221, accompanied by an order to the knights to evacuate the territory and the strongholds they had built. Before, however, this had been effected, the Pope, Honorius III., himself a special protector of the order, intervened, effecting a reconciliation, the result of which was a fresh treaty confirming the previous donation. This renewed deed of gift not only ratified all the terms of the previous document, but actually increased the privileges enjoyed by the knights, granting them among other things the much-coveted right of building stone castles. In spite, however, of some notable victories over the Kumanes in 1224, and the brilliant prospects thereby opened of enlarging their domains, the Teutonic knights were not destined to shine much longer in the land they had thus successfully civilized and made arable. No doubt they hastened their own downfall by the signal short-sightedness of their grand-master, Hermann von Salza, who committed the error of taking upon himself to offer the supremacy of the Burzenland to the Holy See, begging the Pope to enroll this province among the Papal States. Of course the knights had no right thus to dispose of a domain which they only held as subjects of the Hungarian Crown; and though the Pope, as was to be expected, gladly accepted the handsome donation, the King as naturally resented a proceeding which could only be regarded as the blackest high-treason. This time the breach was such as could no longer be bridged over by any attempt at reconciliation. The Teutonic knights had made themselves too many enemies, and especially the King’s eldest son (afterwards Bela IV.) was strenuous in urging his father to eject the order from the land. This sentence was carried out, not without much trouble and bloodshed; for the knights were little disposed to disgorge this valuable possession. Even when at last compelled to turn their backs on Transylvania, which appears to have been about 1225, it was long before they relinquished the hope of ultimately regaining their lost paradise. But all efforts in this direction proved unavailing; for it was decreed that the German knights were to behold the Burzenland no more. {347} CASTLE OF T?RZBURG. I have not been able to obtain any picture of Marienburg, and to the best of my knowledge none such has ever been executed, which is all the more to be lamented, as this interesting ruin, like so many others in the country, bids fair to vanish ere long without leaving any trace behind. In default, therefore, of Marienburg, I offer a picture of the Castle of T?rzburg, another of those seven fortresses raised by the Teutonic knights during their brief but brilliant reign. This castle, lying south of Kronstadt, at the entrance of the similarly named pass, has, however, lost much of its former romantic appearance. Since 1878, when the Hungarian Government thought necessary to guard the frontier against Roumania, it was converted into a soldiers’ barracks; and though no longer used for that purpose, no steps have yet been taken to restore the edifice to its original form by rebuilding the slender turrets of which it had been divested. Shortly before reaching Kronstadt our train came to an unexpected stand-still in the midst of a wide-stretching plain. Some flocks were grazing on either side of the rails, but there was no{348} station or guard-house in sight to explain this unaccountable stoppage, and there seemed to be nothing to suggest an accident, till, stretching our heads out of the window, we saw a group of people bending over a formless mass which lay on the rails some hundred yards to our rear. One of the passengers who happened to be a doctor was hastily summoned to the spot, but he returned shaking his head, for his science could do nothing here. A shepherd lad aged twelve or thirteen had been lying across the rails seemingly asleep in the sun. He lay so flat that the engine-driver had failed to perceive him till the last moment, and then only had seen how a white figure had jumped up in front of the engine, but instantaneously caught by a blow from the engine-fliers, was stricken down to rise no more. Had the boy been asleep or intoxicated, or whether it were an accident or a suicide, none could tell. We were thankful to be far enough from the scene to be spared the sight of the horrible details—how horrible could be guessed from the expression of those who were now slowly returning to resume their places in the train. As we moved away I could only discern how two men were lifting the body from the rails, and how a woman with uplifted arms was running across a field towards them.","sourceLink":"http://novel.tingroom.com/jingdian/2145/60685.html","bookId":480,"book":{"id":480,"title":"The Land Beyond the Forest","description":"简介： In the spring of 1883 my husband was appointed to the command of the cavalry brigade in Transylvania, composed of two hussar regiments, stationed respectively at Hermanstadt and Kronstadta very welcome nomination, as gratifying a long-cherished wish...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2145","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
