{"id":40803,"no":51,"title":"CHAPTER L. UP THE MOUNTAINS.","content":"“When I was young our mountains were still locked up,” I was told by a gentleman native of the place, who accompanied me on my first mountain excursion in Transylvania. “Whoever then wanted to climb hills or to shoot chamois had to travel to Switzerland to do so; and at school they used to teach us that there were no lakes in the country.” \\n\\n \\n\\n THE NEGOI—THE HIGHEST MOUNTAIN IN TRANSYLVANIA, 8250 FEET HIGH.[80] \\n\\n \\n\\n It is, in fact, only within the last half-dozen years that some attempt has been made to unlock the long range of lofty mountains which tower so invitingly over the Transylvanian plains, and render practicable the access to many a wild, rocky gorge and secluded loch hitherto unknown save to wandering Wallachian shepherds. A most praiseworthy institution, somewhat on the principle of the Alpine Club, has been formed, thanks to whose energy suitable guides have been secured and rough shelter-houses erected at favorable points. All this, however, is still in a very primitive state, and the difficulties and inconveniences attending a Transylvanian mountain excursion are yet such as will deter any but very ardent enthusiasts from the attempt. It is not here a question, as in Switzerland, of more or less hard walking or clambering before you can reach a good supper and a comfortable bed. Here the walking is often hard enough, but with this essential difference—that no supper, whether good or bad, can be obtained by any amount of effort; and that the bed, if by good-luck you happen to reach a hut, consists at best of a few rough boards with a meagre sprinkling of straw. You cannot hope to purchase so much{366} as a crust of bread on your way, and the crystal water which gurgles in each mountain ravine is the only beverage you will come across. Everything in the way of food and drink, as well as cooking utensils, knives, forks, cups, and plates, along with rugs and blankets for the night, must be carried about packed on baggage-horses. Therefore, when a party consists of half a dozen members, and when the length of the expedition is to exceed a week, the caravan is apt to assume somewhat imposing proportions. Luckily, in the land beyond the forest prices are still moderate in the extreme, and without rank extravagance one may indulge in the luxury of two horses and one guide apiece. One florin (about 1s. 8d.) being the usual tax for a horse per diem, and the same for a man, the daily outlay thus amounts to five shillings only—a very small investment indeed for the enjoyment to be derived from a peregrination across the mountainous parts of the country. I have no doubt that all true lovers of nature will agree with me in thinking that precisely the rough and gypsy-like fashion in which these excursions are conducted forms their greatest charm, and that beautiful scenery is more thoroughly appreciated undisturbed by any seasoning of French-speaking waiters, table-d’h?te dinners, and wire-rope tram-ways. \\n\\n \\n\\n This way of travelling has, moreover, the incontestable advantage of being select, and escaping the inevitable discords which continually jar upon us when moving in a tourist-frequented country. What beautiful view does not lose half its charm if its foreground be marred by a group savoring of cockneyfied gentility? Which magnificent echoes do not become vulgar when awakened by the shrieking chorus of a band of German students? Does not even a broken wine-bottle or a crumpled sheet of newspaper, betraying the recent presence of some other picnicking party, suffice to ruin miles of the finest landscape to an eye at all fastidious? \\n\\n \\n\\n Here we may walk from sunrise to sunset without meeting other sign of life than some huge bird of prey hovering in mid-air above a lonely valley; and once accustomed to the daily companionship of eagles, one is apt to feel very exclusive indeed, and to regard most other society as commonplace and uninteresting. \\n\\n \\n\\n From the moment we set foot on the wild hill-side, we have left behind us all the mean and petty conditions of every-day life. At least we have no other littlenesses to bear with than what we bring with us ready-made—our own stock-in-trade (which, of course, we cannot{367} get rid of) and that of our chosen companions. Therefore, if I may offer a friendly piece of advice to any would-be mountaineer in these parts, let him look at his friends—not twice, but full twenty times at least—before he contemplates cultivating their uninterrupted society at an altitude of six thousand feet above sea-level. Indeed a Transylvanian mountain excursion is not a thing to be lightly entered upon out of simple gaieté de c?ur, like any other pleasure-trip. It is a serious and solemn undertaking—almost a sort of marriage-bond—when you engage to put up, for better for worse, with any given half-dozen individuals during an equal number of days and nights. Like gold, they must previously have been tried by fire; and you will find very, very few people, even among your dearest friends, who, when weighed in the balance, will not be found wanting in one or other of the many qualifications which go towards making up a thoroughly congenial companion. \\n\\n \\n\\n The pure ozone of these upper regions seems to act like the lens of a powerful microscope, bringing out into strong relief whatever is mean or paltry. Sweetly feminine airs and graces which have so entranced us in the ball-room develop to positive monstrosities when transplanted to the mountain-top; an intellect which amply sufficed for the requirements of small-talk on the promenade or at morning calls shows pitiably barren when brought face to face with the majesty of nature; and a stock of amiability always found equal to the exigencies of conventional politeness very soon runs dry under the unwonted strain of a genuine demand. As in the palace of truth in the fairy tale of Madame de Genlis, nothing artificial can here remain undiscovered. You can as little hope to hide your false chignon while camping-out at night as to conceal the exact quality of your temper; and defects of breeding will leak out as surely as the rain will leak in through the inferior fabric of a cheap water-proof cloak. \\n\\n \\n\\n On the other hand, however, be it said, that many people who in town life have appeared dull and commonplace now rise in value under the action of this powerful microscope; sterling qualities, whose existence we had never suspected, now come to light; and hidden delicacies of thought, which have had no room for expansion in the muggy atmosphere of conventionality, put forth unexpected shoots. \\n\\n \\n\\n Such reflections are, nevertheless, but pointless digressions from the subject in hand, having nothing whatever to do with my own individual experiences; and present company being always excepted, I{368} would have it distinctly understood that we were all amiable, all entertaining, all refined and noble-minded, when in the second week of September we started on one of these excursions—a long-cherished wish of mine whose execution had been hitherto baffled by the difficulty of finding suitable companionship. \\n\\n \\n\\n Our party consisted of four gentlemen and two other ladies besides myself, and a six hours’ drive had taken us from Hermanstadt to the foot of the hills, where horses and guides awaited us—an imposing retinue of fully a dozen steeds and nearly as many men: the former starved, puny-looking animals, weak and spiritless at first sight, but sure-footed as goats and with endless resisting power; the latter wild, uncouth fellows, with rolling black eyes and unkempt elf-locks, attired in coarse linen shirts, monstrous leather belts, and wearing the national opintschen on their feet. \\n\\n \\n\\n Our provisions and utensils were packed, according to the custom of the country, in double sacks made of a sort of rough black-and-white checked flannel, and these, along with our bundles of wraps, secured to the backs of the pack-horses—a somewhat complicated business, as the weight requires to be extremely nicely balanced on either side. It was wonderful to see how much could be piled up upon one small animal, which wellnigh disappeared beneath its bulky freight. \\n\\n \\n\\n While this packing was going on we rested by the river-side, already enjoying a foretaste of the beauties in store for us. Dense beech woods clothed the sides of the valley down to the water’s edge, terminating as usual in a golden fringe of wild sunflowers standing out in broad relief from the dark background; clumps of bright-blue gentians and rosy rock-carnations were sprouting between the stones, and here and there the luxuriant trails of the wild hop hung down till they touched the water; a pair of water-ousels perched on opposite banks were making eyes at each other across the roaring torrent, and the deep quiet pools were occasionally stirred by the leap of a silvery trout. \\n\\n \\n\\n At last we were told that all was ready; so, mounting our riding-horses, we commenced the ascent. The saddles were the usual rough Hungarian wooden ones, only softened by a plaid or rug strapped over. Side-saddles are here useless, as the horses cannot be tightly girthed for climbing, and are not accustomed to the one-sided weight; so the only way to ride with comfort and safety is to imitate the example of the Roumanian queen. A very little contrivance about the{369} costume is all that is necessary in order to sit comfortably on a man’s saddle; but I found the unwonted position rather trying at first, and sought occasional relief by sitting sidewise, using the high wooden prominence in front as the pommel of a lady’s saddle. However, I soon relinquished these experiments, having very nearly come to serious grief from the saddle turning abruptly, which undoubtedly would have landed me on my head had I not extricated myself by a frenzied evolution. After this experience I thought it wiser to tempt fate no further and meekly resign myself to the degradation of a temporary change of sex. \\n\\n \\n\\n On this particular occasion, however, I did not for long tax the powers of my steed, it was so much pleasanter to walk up the mountain-path step by step, and enjoy at close quarters all the wonders of the forest. \\n\\n \\n\\n For upwards of two hours our way led us through splendid beech woods richly carpeted with every species of ferns and mosses, an endless vista of shining gray satin and soft emerald velvet. Then by-and-by the first shy irresolute fir-tree appears on the scene, like a bashful rustic strayed unawares into the presence of royalty. The tall majestic beeches look down contemptuously on the puny intruder; for, like ancient monarchs fallen asleep on their thrones, they do not conceive it possible that their reign should ever come to an end. \\n\\n \\n\\n “What means this rough interloper?” they seem disdainfully to ask, as they nod in the evening breeze. “Are not we the sole lords in these realms? What seeks this insolent upstart in our royal presence?” \\n\\n \\n\\n But scarcely have we gone a hundred paces farther, than again we meet the intruding pine, larger and stronger this time; nor is he alone, for he has brought with him a motley group of his prickly brethren. Onward they press from all sides, impudently sprouting up at the very feet of the indignant beeches—their rough green arms ruthlessly brushing against the delicate gray satin of those shining pillars, trampling down the emerald velvet of the carpet, like revolutionary peasants broken into a palace. \\n\\n \\n\\n The lordly beeches make a last effort to assert their supremacy, but the limits of their kingdom are reached; the sharp wind sweeping over the mountain-top, making them shake with impotent rage, is too keen for their delicate constitutions. They dwindle away, perish, and die, leaving the field to their hardier foe. \\n\\n \\n\\n And now King Pine has it all his own way. Le roi est mort. Vive le roi! A minute ago we had been revelling in the beauties of the beech forest, and now, courtier-like, we find ourselves thinking that the pine woods are more beautiful yet by far. What can be more exquisite than those feathery branches trailing down to the mossy carpet? what more glorious than those straight-grown stems, each one erect and strong, worthy to be the mast of a mighty ship? what scent more intoxicating than the perfume they breathe forth? \\n\\n \\n\\n Our reflections are presently broken in upon by a scramble close at hand. One of our baggage-horses has trod upon an underground wasp’s-nest, which intrusion having been duly resented by the indignant insects, the horse takes to kicking violently, and finally rolls down the wooded incline, scattering our baggage as he goes. Luckily, nothing is lost or damaged, and after a little delay, the fugitive being captured and reladen, we are able to proceed on our way. A little more climbing, and then at last the forest walls unclose, and we stand on an open meadow of short-tufted grass, where is built the rough wood hut which is to give us shelter. To the right and left the pine woods slope upward, their shadowy outlines gradually losing themselves in the fast-gathering twilight; and in front, at a distance of some five hundred yards, is a wall of rock overwashed by a foaming cascade, whose music has been growing on our ears during the last few minutes. \\n\\n \\n\\n The horses are relieved of their respective burdens and set loose to graze; neither hay nor oats has been provided, nor do they expect it. Our Wallachian guides busy themselves in collecting firewood and kindling a large camp-fire, for the triple purpose of cooking the supper, keeping themselves warm, and scaring off possible bears or wolves that may come prowling about at night in quest of a horse. There is here no difficulty in providing firewood enough for a splendid bonfire, and no tree burns with such spirit as a dead fir-tree. \\n\\n \\n\\n It is my duty here to forestall all possible anticipation, by frankly acknowledging that no bear ever did come to disturb us on this occasion. Yet the thought of the shaggy visitor who might at any moment be expected to drop in upon us went a long way towards enhancing the romance of the situation. During our whole stay in the mountains Bruin was like a vague intangible presence hovering around, and causing us delicious thrills of horror at every step. If{371} we plucked a branch of late raspberries on our path, it was with a trembling hand, lest a furry paw should appear at the other side of the bush to claim its rightful property; and we lay down to rest half expecting to be wakened by an angry growl close at hand. Consequently, the raspberries we ate and the sleep we snatched were sweeter far than common raspberries and every-day sleep, feeling, as we almost got to do, as though each had been fraudulently extorted from the bear. \\n\\n \\n\\n Our shelter-hut, roughly put together of boards, consisted of a small entrance-lobby with stamped earth floor, and of one moderate-sized room about six paces long. All down one side, occupying fully half the depth of the apartment, ran a sort of shelf covered with straw, supposed to act as bed, where about a dozen persons might have room lying side by side. A long deal table, a wooden bench, and a row of pegs for hanging up the clothes completed the furniture. Besides the wooden shutters, there were movable glass windows, which were regularly deposited in a hiding-place under the foot-boards, lest they should be wantonly broken by the all-destroying Wallachians. Each authorized guide only is apprised of their place of concealment, to which he is careful to restore them when the party breaks up. \\n\\n \\n\\n This particular shelter-hut is an exceptionally well-built and luxurious one, most such being devoid of windows, and often closed on one side only. \\n\\n \\n\\n By the time we had prepared our supper and cheered ourselves with numerous cups of excellent tea it had grown quite dark, and we were thankful to seek our hard couches. A railway rug spread over the straw-covered boards rendered them quite endurable, and all superfluous coats and jackets were pressed into the pillow service. All of us lay down in our clothes, merely removing the boots; for it is hardly possible to dress too warmly for a night passed in these Carpathian shelter-huts; and despite the day having been so warm as to necessitate the thinnest summer clothing for walking, the nights were piercingly cold, and even a heavy fur sledging-cloak was not superfluous. \\n\\n \\n\\n Though the splash of the water-fall and the tinkling bell of a grazing horse were the only sounds which broke the stillness of the night, yet our unwonted surroundings did not allow of much uninterrupted slumber. But it is surprising to note to what a very minimum the necessary dose of sleep can be reduced on such occasions; the body,{372} renovated as by a magic potion, seems unaccountably delivered from all physical weakness; even the sore throat we had brought with us from the lower world has vanished in the pure atmosphere of the upper regions. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2145/60688.html","bookId":480,"book":{"id":480,"title":"The Land Beyond the Forest","description":"简介： In the spring of 1883 my husband was appointed to the command of the cavalry brigade in Transylvania, composed of two hussar regiments, stationed respectively at Hermanstadt and Kronstadta very welcome nomination, as gratifying a long-cherished wish...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2145","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
