{"id":93902,"no":11,"title":"Page 11","content":"Kaitlyn knew it, she felt certain. But a nagging murmur of dissent was starting in her brain. Mr. Z wouldn\u0027t make the combination that simple. He wouldn\u0027t begin it-or end it-with 1492. Anyone glancing at it would remember. Someone breaking in might try it at random. That was when Kaitlyn had her second brainstorm. Supposing the combination didn\u0027t begin or end with 1492-not all together. The Christmas tree had been in the middle of the ship, so supposing the combination was 14/12/25/92. Or 14/25/12/92. Good heavens, or even 1/12/25/492. Or ... Kaitlyn cut her busy brain off. I\u0027ll think of all the possibilities later. But I\u0027ll try the easy ones first. And I\u0027ll-A guy with a bald head was darting a black-stained tongue at her. Kaitlyn recoiled, then realized it was Jackal Mac. \"What\u0027s the matter? Scared of me?\" Kaitlyn stared into the jackal eyes. \"No,\" she said flatly. \"Then come dance.\" No, Kaitlyn thought. But she was a spy and her most important job was to not get caught until she got the shard to the crystal. Nothing else was important. \"Okay,\" she said, and they danced. She didn\u0027t like the way he moved in on her. Not like slow dancing, he wasn\u0027t trying to hold her, but he kept moving toward her, forcing her to back up. Otherwise his swinging arms and gyrating hips would have made contact. She saw Frost and Gabriel together on the floor. Frost fit right in here; she was wearing a silver baby doll dress and silver ankle boots. She kept brushing against Gabriel\u0027s body as she danced. Well, at least she wasn\u0027t as exposed as that woman wearing a negligee. Or that man painted orange who seemed to be wearing almost nothing. \"Hey, baby! Pay attention!\" Jackal Mac was closing in again. Kaitlyn stepped back and collided with a woman in space-age neon sunglasses. \"Sorry,\" she muttered, inaudibly over the music. She edged away, heading for a deserted space below the bandstand. \"Look, Mac, I\u0027m kind of tired-\" \"Sit down and rest.\" He was backing her farther into the space, below and slightly behind the stage. Kaitlyn tripped over a cord or cable. She couldn\u0027t keep walking backward like this. \"I think I just want something to drink. Would you like something?\" It was strange that her voice was so calm. Because suddenly she was very scared. They were in an isolated little nook here, where the music was loudest. No one from the dance floor could really see them. Certainly no one could hear them. It was smoky and dark and humid and it felt like a trap. \"Yeah, I\u0027m kinda thirsty,\" Jackal Mac said, but he was blocking the way out. His eyes gleamed in the dimness. He had one hand up, resting on the stage, and suddenly Kaitlyn got a whiff of his sweat. Danger. It was like red warning lights flashing in her head, like the sound of sirens. She could feel his mind, cluttered and trashed and nasty as his bedroom. Nasty as the red-haired man had been. \"I\u0027m thirsty, you know, but not for a drink. Gabriel told me how you used to take care of him.\" Not like the red-haired man after all. Jackal Mac had a different aberration. He didn\u0027t want to hurt her body, he wanted to suck her brain out. You bastard, Kaitlyn thought with white-hot fury, but she didn\u0027t mean Jackal Mac. Her hatred was for Gabriel. He\u0027d told this-animal-about what Kait had done for him. The most private moments she\u0027d ever had with anyone. Kaitlyn felt as if she\u0027d been violated already, ripped open for everyone to see. \"What else did Gabriel tell you?\" she said in a voice that was hard and distant and unafraid. Jackal Mac was surprised. His head bobbed, apelike, then his black-stained tongue came out to lick his lips. \"He said you were always chasing him. I guess you like it, huh?\" Sliding his arm down to shoulder level, he moved closer. \"So you gonna make this easy, or what?\" Kaitlyn held her ground. \"You\u0027re not a telepath. I don\u0027t know what you think-\" \"Who says you need to be a telepath?\" Mac laughed. \"This is about energy, pretty girl. We all need energy. Everybody who\u0027s a friend of the crystal.\" The crystal. Of course. Mr. Z\u0027s way of keeping them all in line. It had made them all psychic vampires like Gabriel. And it satisfied them all, provided them with energy . . . unless you were like Jackal Mac and wanted something extra. He wants me to be afraid, Kait thought. He enjoys that, and he\u0027ll like draining my energy best if I\u0027m fighting and screaming. That little extra kick. I hate you, Gabriel. I hate you. But it didn\u0027t prevent her from saying what needed to be said. \"And you think Gabriel\u0027s going to like it if you mess around with me?\" she asked. \"He didn\u0027t like you messing with his room.\" Mac\u0027s eyes took on an almost injured expression. \"I wouldn\u0027t touch Gabriel\u0027s woman,\" he said. \"But that\u0027s Frost now. He was the one who said I should check you out.\" His teeth shone white in the darkness. For an instant, Kaitlyn felt only numb. Gabriel had thrown her to Jackal Mac like a bone. How could she live with that? And then survival instinct took over and she realized that she wouldn\u0027t have to live with it if she didn\u0027t do something fast. Jackal Mac was reaching for her with his blunt, restless hands. She knew the routine. There were several transfer points, but third eye to third eye or lips to spine were best. She would bet that Mac wanted her spine. So relax. Relax and let him get behind you. No, pretend you\u0027re going to cooperate. A part of her mind was yammering at her, insisting that there was a way to yell for help. A vocal scream would be lost in the throbbing music, but she could scream mentally. Gabriel had come the last time; he might come if he thought Mac was killing her. But I won\u0027t scream, she thought, cold washing over her like an icy waterfall. I won\u0027t scream even if he does kill me. I wouldn\u0027t take Gabriel\u0027s help if I knew it would save my life. Gabriel had set this human beast on her. Let Gabriel live with the consequences. Besides, he might hear her screams and just smile. \"Come on,\" Kaitlyn said to Mac, aware she hardly sounded seductive. \"I don\u0027t mind. Just let me get my hair out of the way.\" His hands with their ugly, chewed-up nails hovered in the air. She stepped toward him, but to one side, grasping her hair with one hand, pulling it off her neck, watching his eyes follow her movements greedily. \"Okay and just let me do-this.\" While his eyes were on her bare shoulders, she slammed a heel into his shin. He made a thick, startled sound of surprise and pain, more like a pig than a jackal. He lunged toward her- -but she had kicked the loose cord between his feet. He stumbled, tangled in it. Kaitlyn didn\u0027t wait to see if he recovered his balance or not. She was running. She reached the dance floor, plunged into the crowd. Fell into someone\u0027s arms. A poetic-looking young man wearing a shirt with a large collar and flowing white sleeves. \"Hey-\" Kaitlyn reeled away. Where was Joyce? Nobody else could keep Mac from following her out here, from dragging her back. . . . There. Joyce and Lydia. Kaitlyn wove unsteadily toward them through the crowd. \"Joyce-\" She didn\u0027t get any farther. A roar was beginning behind her. Jackal Mac was parting the crowd like Moses parting the Red Sea. But unlike Moses, he was doing it with fists and elbows, and the Red Sea was getting mad. \"You don\u0027t need to explain,\" Joyce said tightly to Kaitlyn. As Kaitlyn watched, Mac ran into a short woman with lacquered hair. He shoved her aside. A large man wearing chains lunged forward to grab him. \"Here comes Renny,\" Lydia said. Renny appeared with a bottle. Kait couldn\u0027t tell if he was attacking Mac or defending him, but suddenly glasses were flying, people were throwing punches. Jackal Mac picked up a chair and lifted it over his head. Screams split through the music. Hefty men in suits were running in from all directions. \"You girls get out of here,\" Joyce said. Kaitlyn could feel that she was angry and exasperated almost to tears. Here she was, out to celebrate in her pink St. John dress with the rhinestones, and Mac was ruining everything. If Kaitlyn hadn\u0027t known why Joyce was celebrating, she might have felt sorry for her. As it was, she took Lydia\u0027s arm and propelled her toward the Exit sign. Lydia waited until they were in the car to speak. \"What happened?\" Kait shook her head, then leaned her temple against the cool window. Everything inside her was sick and sore. Not from Mac\u0027s attack. From knowing Gabriel had egged him on. And from the hole in the universe where LeShan had been. It\u0027s a filthy world, she thought slowly. But I\u0027m going to do my part to clean it up. And then I\u0027ll never have to look at Gabriel again. I\u0027ll go as far away from here as I can go. It was very late when she heard Joyce bring the others home that night. There was a lot of thudding on the stairs, a lot of banging and laughing and cursing. \"They scare me,\" Lydia said softly from the other bed. \"The way they are. What they can do.\" They scared Kaitlyn, too. She wanted to say something comforting about how things were going to change, but she didn\u0027t dare. Lydia wasn\u0027t evil, but she was weak-and besides, no one was to be trusted. No one. \"Think about something else,\" Kaitlyn said. \"Did you ever find a cow alarm clock around here?\" \"No. A what?\" \"An alarm clock shaped like a cow. It was Lewis\u0027s. It used to go off every morning, this sound like a cowbell and then a voice shouting \u0027Wake up! Don\u0027t sleep your life away!\u0027 And then it would moo.\" Lydia giggled faintly. \"I wish I\u0027d seen that. It sounds-like Lewis.\" \"Actually, it sounded like a cow.\" Kaitlyn could hear Lydia snorting softly in the darkness for a while, then silence. She pulled the covers over her head and went to sleep. The next day she was confronted with a problem. Everyone else was exhausted and lethargic, so Joyce had canceled all testing. She had the day to herself- but she couldn\u0027t figure out how to get in touch with Rob. Call the Diaz house? Not from inside the Institute. Much too risky. And she had no excuse for walking off alone to find a pay phone. She didn\u0027t want to do anything that might look suspicious. But she needed to talk to Rob, to tell him to bring the shard on Monday. She didn\u0027t want to waste any more time. She was sitting at the desk in her room, tapping a pencil and wondering if she dared ask to borrow Lydia\u0027s car, when a noise at the window made her turn around. A kitten. A big kitten, almost a cat. It was pawing at the screen. Kaitlyn almost smiled despite her mood. You funny baby, how did you get all the way up here? she wondered, and went to open the screen. The kitten butted its head against her and rasped her knuckle with a tongue like a furled pink leaf until Kait rubbed the black velveteen fur between its ears. What a funny collar. Way too thick. That must hurt you. . . . It was a piece of paper, wrapped around and around the blue nylon stretch collar and secured with masking tape. A note. Suddenly Kaitlyn\u0027s heart was beating hard. She looked down into the backyard below the window. Nobody in sight. Then she glanced over her shoulder, toward the closed door of the bedroom. Eyes on the door, she pulled at the tape with her fingernails, tearing the note free. The man at the airport and the lady with the pitchfork are dead. The water\u0027s too hot. Meet me at the old rendezvous soon and the dish will run away with the spoon. Pick your time, just let me know. Send a message in a bottle. JL he note was neither addressed nor signed-Rob had thought it less risky that way, Kaitlyn supposed. But she understood what it said. Mereniang was dead, too. LeShan was the man who\u0027d accosted her at the airport, and the first time they\u0027d seen Meren she\u0027d been pitching cow dung. Rob thought Kaitlyn was in too much danger now, and he wanted her to come to the gym, where he\u0027d whisk her away from the Institute permanently. She was supposed to pick a time when she could get away and send a note back. Kaitlyn sat for a moment, rolling the pencil between a sheet out of her sketchbook and began to write in a heavy, determined hand. The hotter the water, the better witches like it. No date today. Same time, same place tomorrow. Bring the magic knife. I\u0027ve done my homework and know my numbers. She hoped Rob would remember Tony saying \"I see you got the magic knife for Marisol.\" And he hoped he would understand that she couldn\u0027t leave now; she knew where the crystal was kept and she knew the combination to get to it. The kitten was nudging her, rolling, asking for pets. Kaitlyn stroked it, then wrapped the note around its collar and taped it securely. She opened the screen and held her breath. Out went the kitten, without a backward glance. Anna must have implanted the suggestions very well. Now, Kaitlyn thought, leaning back. Nothing to do but wait for tomorrow at noon. And hope Rob keeps his date. \"I can\u0027t let you do it alone,\" Rob said. \"But don\u0027t you see? It\u0027s the only possible way.\" \"No,\" Rob said flatly. It was noon on Monday. They were hiding in the gym itself, which seemed safer than the entrance. Kaitlyn looked at Lewis and Anna for help, but they were both looking pretty helpless. As if they couldn\u0027t figure things out. Rob was the one who\u0027d made up his mind. \"I can\u0027t let you take it back to the Institute by yourself. I\u0027m going with you-I\u0027ll sneak in whenever you do.\" He just wasn\u0027t thinking it through. \"But what if we get caught sneaking into the house?\" \"What if you get caught with the crystal? That would be just as bad as being seen with me.\" \"No, it wouldn\u0027t,\" Kaitlyn said, straining to keep her voice patient. \"I can hide the crystal-or at least there\u0027s a chance that I could hide it quick if I heard somebody coming. But I can\u0027t hide you. What am I going to do, stick you under a sofa pillow?\" Rob was trying to be patient, too-she could see and feel it. And he was losing the battle. \"It\u0027s ... just . . . too . . . dangerous,\" he said with slow emphasis. \"Do you really think I\u0027m going to sit around, safe in somebody\u0027s apartment, while you take all the risk? What does that make me?\" \"Smart. Rob, I\u0027m hoping I can get to the crystal today, but that may not be possible. Joyce could have the lab door open; somebody could be sitting in the living room where they can see the secret panel. I may have to wait around for days and watch for my chance. You can\u0027t sit that long in the house with me-or even outside,\" she added, cutting him off. \"Gabriel would feel you there, just like he did before. And then it would be all over; he\u0027s really our enemy now.\" She had thought this through, and she didn\u0027t intend to budge. And she could see Rob knew it. His expression suddenly changed; his jaw set, his mouth straightened into a grim line. A golden blaze sparked in his eyes. He looked, Kaitlyn thought, like a good guy pushed too far. Without a word, he reached for her, grabbed her around the waist. Kaitlyn felt herself lifted, her feet leaving the wooden gym floor. \"I\u0027m sorry, but I\u0027ve had enough,\" he said. \"You\u0027re coming back to the car.\" A few days ago, Kaitlyn might have thought this funny. But now . . . Put me down! The volume of it shocked Rob into loosening his grip. The sheer fury in her eyes kept his mouth shut as Kaitlyn pulled away from him. Anna and Lewis were shocked, too-and frightened. Kaitlyn knew they could feel the anger pouring off her like invisible waves. She stood like a queen, feeling tall and terrible and when she spoke each word came out like a white-hot chip of steel. \"I am not an object, something to be picked up or carried away or passed around. Gabriel thought that\u0027s what I was. He was wrong. You\u0027re both wrong,\" she said to Rob. His hair was tousled, making her. suddenly think of a little boy. His eyes were dark amber and wide. There was utter silence in the gym. \"I am the only one who can decide what will happen to me,\" Kaitlyn went on very quietly. \"No one else. Me. And I\u0027ve already made my decision. I\u0027m going back to that place and I\u0027m going to try to stop them any way I can. Whether you give me the shard or not is your decision, but I\u0027m going back anyway.\" She had never spoken to him like this before, and she could see that he was confounded. Stricken. Kaitlyn tried to make her voice gentler, but she could hear the steel underneath it. \"Rob, don\u0027t you see, this thing is bigger than just us. You\u0027re the one who taught me that things can be bigger than people. You made me want to make a difference. And now I have a chance to do it. Timon died and LeShan died and Mereniang died, and if somebody doesn\u0027t stop the Institute more people are going to die. I have to try and stop that.\" Rob was nodding slowly. He swallowed and said, \"I understand. But if something happened to you-\" \"If something terrible happens to me, then at least I know that / chose it. I went because I decided to go. But you don\u0027t have anything to do with it. ... Do you understand?\" Anna was crying. Lewis was almost crying. And Rob-seemed shocked into submission. He looked at Anna as if that were somehow his final appeal. Anna blinked away tears. Her face was compassionate, sad-and still. Too deep a stillness to be simply resignation. \"Kait\u0027s right,\" she said. \"She\u0027ll go if she says she\u0027ll go. You can\u0027t say for her. Nobody can ever say for somebody else.\" Then Rob looked back at Kait, slowly, and she knew that he was seeing her as an equal for the first time. An equal not just in brains or psychic power or resourcefulness, but in every way, with exactly as much right to risk her life as he had to risk his. Equal and separate. It was as if at that moment they split apart, became two independent creatures. If Rob had ever had a fault in their relationship, it was thinking he had to protect her. And Kaitlyn had encouraged it in a way, by thinking that she needed to be protected. Now, all at once, they were both realizing it wasn\u0027t true. And once Kait knew that, she realized that in the last few minutes she had grown in his eyes. Rob respected her more, even loved her more than ever before ... in a different way. But he was still having a hard time grasping that he was really going to have to stand here and watch her walk away and take the risk herself. So he gave it one last try, not with force, but with entreaty. \"You know, I\u0027ve been wondering if we should maybe wait just a little to use the shard, anyway. It did cure Marisol, you know. You didn\u0027t see that, Kait, but it was wonderful. And there are a lot of other people in that hospital. I was kind of hoping . . .\" He shrugged, his face wistful.","sourceLink":"https://allnovel.net/dark-visions-the-passion-dark-visions-3/page-11.html","bookId":2126,"book":{"id":2126,"title":"Dark Visions: The Passion (Dark Visions #3)","description":"Storyline: The Passion (Dark Visions #3) Kaitlyn Fairchild and her four psychic friends nearly escape from the evil Mr. Zetes - until Gabriel defects to the Institute. Desperate to break the intimacy of their telepathic link, he becomes the enemy and hunter of Kaitlyn\u0027s group. Rob is determined to destroy Gabriel if he has to...but Kait can\u0027t let that happen. On her own, she leaves her friends and returns to the Institute, pretending to join Mr. Zetes. But when her reckless gamble goes wrong, will Gabriel save her - or betray her again? And when the final battle comes, will Kaitlyn choose Rob or Gabriel - light or darkness?","cover":"https://allnovel.net/images/dark-visions-the-passion-dark-visions-3.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/dark-visions-the-passion-dark-visions-3.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:05:07 PM"}}
