{"id":93906,"no":15,"title":"Page 15","content":"\"Hold them!\" Mr. Zetes shouted, and began beating Sasha and Parte King with his cane. \"Hold them all!\n Hold them all!\"\n Kaitlyn heard the savage swishing sound of the cane, and the dull thud of the blows. She saw Gabriel\u0027s face tighten, saw it go grim with purpose. The shard quivered, moved an inch toward the crystal.\n \"Gabriel,\" Mr. Zetes said. \"Think of all your ambitions. You wanted to go to the top. Have everything good. Money, power, position-all the things in life you deserve.\"\n Gabriel was panting, sweat trickling down his temples.\n \"Recognition of your superiority-you\u0027ll never have any of it without me,\" Mr. Z went on frantically. \"What about all that, Gabriel? Everything you always\n wanted?\" Gabriel lifted his head just enough to look Mr. Z in the eye. \"The hell with it.\" Then he gritted his teeth and the shard moved again.\n Mr. Zetes lost control.\n He began to scream, shrill and piercing, and to beat Sasha again. \"Stop him! Stop him! Stop him!\"\n Sasha\u0027s voice rose, too, for the first time since Kaitlyn had seen him. \"Muh-muh! Muhhhh! Muhhhh!\n Mooooootheeerrrr!\"\n Kaitlyn screamed herself then. She was crying wildly, fighting the air.\n Then suddenly the drag disappeared. The air was air again. Everything that happened next happened in an instant, so that Kaitlyn\u0027s mind took it in like a still photograph, receiving the impressions before she could really process them.\n She was moving freely. Sasha had turned to look at Mr. Zetes. She could see Sasha\u0027s face, not white anymore, but red with the fury of a squalling infant. And then Mr. Zetes was flying toward the crystal, flying, as if a giant hand had thrown him. He smashed into it, into its heavy solidity and sword-sharp outcrops at the same instant that Gabriel thrust the shard forward like a rapier.\n It all happened at once. Although Kaitlyn\u0027s body was free there was no time to do anything, only time for one thought, sent out to her mind-mates as she saw the shard stab toward the crystal. With Gabriel still holding it-Protect Gabriel! Put your thoughts-around him-\n The words weren\u0027t very clear, but her intent was. She felt everyone in the web, Rob, Lewis, and Anna, joining with her to help shield Gabriel\u0027s mind from the destruction.\n Mr. Z\u0027s high, keening wail came at the same instant, just as the shard made contact with one translucent facet of the crystal.\n And then-\n There were all sorts of sounds woven together in the great crashing that came next. There was the sound of an axe crashing through glass, and the sound of a sonic boom that rattled the windows. There was the rushing sound of a freight train passing by very close. There was a metallic sound like all the pots and pans in a kitchen falling to a tile floor at once. There was the rumble of thunder and the cracking of ice on a lake. There was a high, thin sound like the screaming of gulls-or maybe that was Mr. Zetes.\n And through all the other sounds, underneath them, Kaitlyn thought she could hear music-the kind of music you think you hear when water is crashing through copper pipes.\n There was light, too. The kind of light you expect to see just before a mushroom-shaped cloud. Kaitlyn\u0027s eyes squeezed shut automatically, and her hand flew up to protect her face, but she saw it through her eyelids.\n Colors that her pastels and ink bottles had never prepared her for. Aureolin yellow with a brightness off the scales. Dragon\u0027s blood crimson spreading into tongues of lava pink fire. Ultraviolet silvery blue.\n They burst like fireworks, sweeping to the edges of her vision, overlapping each other, bright explosion after bright explosion.\n And then they stopped. Kaitlyn saw rainbow afterimages, beautiful fiery lattices printed on her eyelids.\n Very cautiously she opened her eyes, lifting her hand away from her face.\n A cobalt green stain still colored her vision, but she could see again. The great milky crystal was dust on the ground, glassy dust in the shape of a giant stone plant, or a Christmas tree ornament. The largest bits left were pebble size.\n Mr. Zetes, who had been touching the crystal at the moment it shattered, was gone. Just gone. Nothing left but the gold-topped cane that had fallen from his hand.\n Sasha and Parte King were lying still. Their faces were frozen into a look of empty astonishment-not peaceful, but not anguished, either. In her heart, Kaitlyn was sorry she\u0027d called them the human pupae.\n They had been human beings.\n Everyone else was standing pretty much where they had been before the crash. They were all lifting their heads or lowering their hands, staring.\n \"It\u0027s over,\" Lewis whispered finally. \"We did it. It\u0027s over.\"\n Kaitlyn was beginning to realize the same thing. Bri and Renny were gazing around them like sleepwalkers who\u0027d just woken up. Free of the influence of the crystal at last, Kait thought. She looked at Gabriel. He was looking at his hand which had held the shard. The palm was pink, as if he\u0027d been lightly burned.\n \"Did the shard go, too?\" Kaitlyn asked.\n He turned his gray eyes on her, as if startled to hear a voice. Then he looked back at his hand again.\n \"Yes,\" he said, blinking. \"When the crystal did. It felt-I can\u0027t explain it. It was like lightning in my hand. I felt the power go through it. And the power- it felt like Timon. Like Timon and Mereniang and LeShan-all of them. It was as if they were in there, rushing out.\" He looked up again, almost furtively. \"I guess that sounds crazy.\"\n \"No, it doesn\u0027t,\" Rob said, his voice strong. \"It sounds right. I believe you.\"\n Gabriel looked at him, just a look. But after that he held his head up, and the startled, furtive expression was gone.\n Kaitlyn felt something like carbonated water begin to bubble in her veins. \"We did it,\" she said. She looked at each of her mind-mates, and at Lydia, and suddenly she needed to shout. \"You guys, we did it!\" \"I said that already,\" Lewis said with force. And then it was like a roller coaster gathering speed.\n Everybody seemed to feel the need to say it, and then to yell it, and then to yell louder to be heard over the other yells. People began to tell one another and then to hug one another or pound one another on the back to drive the point home. Kaitlyn found herself shaking Lydia and kissing Gabriel. Rob, somehow unchained, was wringing Anna\u0027s long braids.\n Bri and Renny were part of the celebration, punching each other and whooping with gathering intensity.\n Joyce was crying, clutching with one hand at Kaitlyn\u0027s back and whispering something Kait couldn\u0027t hear.\n Lydia was a full member of the winning team, being socked in the arm over and over by Lewis.\n But three people weren\u0027t. Tamsin knelt by the two dead boys on the floor. Her tilted eyes were wet as she gently closed their eyelids.\n And Frost and Jackal Mac were stiff as statues, watching the wild release of energy around them with frightened, hostile eyes. Kaitlyn saw them and raised her arms to Frost.\n \"Come on,\" she said. \"Don\u0027t worry; be happy. Let\u0027s all try to deal with each other, okay?\"\n It wasn\u0027t the warmest invitation, maybe, but Kaitlyn thought that under the circumstances it was pretty generous. But Frost\u0027s pale blue eyes flashed. Jackal Mac\u0027s face turned ugly.\n They looked at each other, then with one accord they rushed for the door. Kaitlyn was too surprised to try to stop them, and\n by the time she recovered, she wasn\u0027t sure she wanted to. The yelling and cheering had died out, and she looked at Rob, who had taken half a step toward the door.\n \"I think we should just let them go,\" she said.\n He glanced back, then nodded slowly. Gabriel and Lewis settled back reluctantly. Kaitlyn could hear running footsteps up above, then the bang of a door.\n Then, silence. In the stillness, Joyce\u0027s whispering could be heard.\n \"I\u0027m so sorry. I\u0027m so sorry for everything.\"\n Kaitlyn turned.\n Joyce\u0027s aquamarine eyes were red-rimmed. Her face was shiny with tears and perspiration, her normally sleek blond hair ruffled like a baby chick\u0027s. Her pink sweat clothes looked damp and bedraggled.\n She also looked like a sleepwalker who has just woken up.\n \"I\u0027m so sorry,\" she whispered. \"The things I\u0027ve done. The terrible things. I... I...\"\n Kaitlyn looked at her helplessly. Then she said, \"Tamsin!\"\n The head with the clustered yellow curls lifted. Tamsin saw Joyce and got up. She looked into Joyce\u0027s face, then she took Joyce by the elbow and led her toward the open door.\n \"The firestones can cast a powerful spell,\" Kait heard her saying softly. \"Their influence can be very strong-and recovery can take a long time. . . .\"\n Kaitlyn was satisfied. Although Tamsin looked younger than Joyce, there was a sort of ageless wisdom and understanding about her. Joyce was listening as they disappeared.\n Kait turned back to find her mind-mates grinning at her.\n Good job, Lewis said, and Anna said, I hope she\u0027s\n okay.\n Bri and Renny were smiling, too. The atmosphere of wild jubilation had quieted, but a kind of dizzy glow remained.\n \"Let\u0027s go upstairs,\" Rob said, taking Kaitlyn\u0027s hand.\n \"Yes, I\u0027d better change.\" Kaitlyn glanced down at the bathing suit and grinned wryly. \"And I\u0027m sure there are things to take care of-God, the police, I guess. We\u0027re going to have to explain all this somehow.\"\n \"I wanna get out of here before that,\" Bri said.\n Kaitlyn looked behind her, held out her free hand to Gabriel. \"Come on, you . . . hero. I want to tell you what I think of you.\"\n \"So do I,\" Rob said, golden eyes warm.\n Gabriel looked at Kaitlyn\u0027s fingers intertwined with Rob\u0027s. He smiled, but Kaitlyn couldn\u0027t feel his happiness in the web anymore.\n \"I\u0027m glad you have her back safe again,\" he said to Rob. He was saying two things with that, Kaitlyn realized.\n Suddenly, some of the dizzy glow faded. \"Please come up with us,\" she said to Gabriel, and he nodded, smiling politely, like a stranger.\n So you\u0027re not a psychic vampire anymore,\" Lewis said to Gabriel as they reached the dining room. \"I mean, nobody is anymore, right? The Fellowship said if the crystal was destroyed, you\u0027d be cured.\"\n Kaitlyn realized that he was chattering deliberately, filling the silence, trying to help in the only way he could. Gabriel smiled at him, wanly grateful, but Kaitlyn could see the pain behind those gray eyes.\n She herself knew that she should be going upstairs, but she couldn\u0027t seem to make herself leave. She had never imagined that a person could go from feeling so gloriously happy to so wretchedly miserable in such an appallingly short time.\n Wretched, and frightened, and sick with pain. I\u0027m being torn in two, she thought, standing in the sunlit dining room and holding Rob\u0027s hand even tighter. I\u0027ll never be whole again; I\u0027ll never be all right. Oh, God, please, please tell me what to do.\n She pulled her hand away from Rob, because even her shields couldn\u0027t contain the pain. She didn\u0027t want him to know.\n Anna slipped a jacket over her shoulders and gave Kaitlyn\u0027s hand a squeeze. Kaitlyn looked at her gratefully, unable to speak.\n Rob was looking a bit lost. \"Well-is anybody hurt?\" he said, glancing around. \"Kaitlyn-?\"\n \"I\u0027m fine. Gabriel\u0027s hand, though . . .\"\n Gabriel, who had just sat down, looked up sharply. \"It\u0027s all right. Just a little burn.\" He had been pushing his sweater sleeve off his forearm, scratching under it absently, but now he pulled it down again.\n \"Let me see. No, I said, let me see.\" Rob clamped Gabriel\u0027s left arm with an unbreakable grip.\n \"No, leave it alone. It\u0027s the other hand!\" Gabriel\u0027s tone was almost as harsh as it had been in the old days, but Kaitlyn detected a note almost of panic underneath.\n \"But I feel something here. Stop fighting and hold still!\" Rob\u0027s voice was equally annoyed. He wrestled the sleeve up by main force-and then stared.\n Gabriel\u0027s pale forearm was covered with ghastly marks. Angry red cuts, their lips curling open and beginning to bleed again with the rough handling. Burns that were turning brown at the edges and still blistered in the middle. They ran all the way from wrist to elbow.\n Kaitlyn felt giddy.\n \"What happened?\" Rob said, with terrible quietness. \"Who did this to you?\" He lifted clear golden eyes to Gabriel\u0027s face, waiting.\n \"Nobody.\" Gabriel looked angry, but somehow relieved, too. \"It just-happened. It happened when the crystal broke.\"\n There was a silence, a heaviness in the web. Lewis frowned, Anna\u0027s lips pulled in at the corners. Bri and Renny had backed off, as if recognizing somehow this wasn\u0027t their business. Rob was looking at Gabriel hard.\n Kaitlyn was trying to blink dancing spots away. She felt she should know what had happened to Gabriel.\n She should know, if she could only think. . . .\n \"Well, relax,\" Rob said finally, evenly. \"I can make it stop hurting so much. Make it heal faster.\"\n He put one hand on Gabriel\u0027s arm above the elbow and held Gabriel\u0027s palm with the other. Kaitlyn could see him feeling with his fingers for transfer points. Gabriel sat, uncharacteristically docile and obedient.\n Rob\u0027s thumb pressed into Gabriel\u0027s palm and he shut his eyes. Through the web, Kaitlyn could feel what he was doing. Sending healing energy through the wounded limb, stimulating Gabriel\u0027s own energy to flow, as well. Golden sparks traveling down Gabriel\u0027s veins, golden mist enveloping the forearm. Kaitlyn felt warmth, and felt Gabriel relaxing as the pain eased, his muscles unclenching.\n With relaxation, barriers go down. Kaitlyn knew that, and she knew that Rob\u0027s healing brought him closer to people. In a minute, she knew that he was doing something else to Gabriel. Probing his mind, looking for something.\n Hey! Gabriel tried to jerk his arm out of the steely grip, head lifting, face furious. But it was too late.\n They stared at each other a long moment, gray eyes and gold locked as they always had been when the two of them did battle. Locked for endless, time-stretching seconds.\n Then Rob\u0027s face changed and he settled back on his heels.\n Gabriel held his hurt arm to his chest protectively, his own expression defensive and defiant.\n \"You did those to your own self,\" Rob said flatly, calmly. Still looking Gabriel in the eyes. \"To . . . stay in contact with Kaitlyn.\" He said the words as if he weren\u0027t exactly sure of their meaning. \"They were doing something to her and you had to talk to her over a long range. So you thought pain would help you call louder.\"\n Gabriel said nothing, but Kaitlyn felt the truth of it. That was what he\u0027d been concealing when he talked to her in the isolation tank. When he gave her his best memories. She\u0027d felt fatigue and some kind of pain, but he\u0027d shielded most of it from her.\n \"You used somebody\u0027s cigar and a piece of broken glass,\" Rob said, with growing confidence. \"And then later you poked at the sores some more to keep awake.\"\n Yes, Kaitlyn thought, feeling it with Rob in the web. She could tell he didn\u0027t exactly understand what the situation was, but that he was sure about one thing.\n \"You love her, don\u0027t you?\" he said to Gabriel.\n Gabriel finally seemed able to break their locked stare. He looked away, at the carpet. His face was bleak.\n \"Yes,\" he said.\n \"More than anything,\" Rob persisted. \"You\u0027d crawl on your belly over broken glass for her. Easy.\"\n \"Yes, damn you,\" Gabriel said. \"Happy now?\"\n Rob looked at Kaitlyn.\n Kaitlyn\u0027s head was swimming, her body racked in so many different directions that she stood still. She couldn\u0027t seem to put a coherent thought together. But on top of everything else, holding her precariously in one niece, was the thought that she mustn\u0027t hurt Rob.\n She loved him too much to hurt him. And she knew that Gabriel\u0027s eyes on her were saying the same thing.\n She now knew that it was possible to love two people at once-because you could love them in different ways. The love she felt for Rob now was a burning tenderness, a knowledge that he was the one who\u0027d taught her it was possible to love, who had melted the ice of her heart. It was strong and gentle and steady, full of admiration and the intimacy of shared likes and dislikes. It was golden and warm like a summer afternoon.\n And if it wasn\u0027t the passion and desperate depth of feeling she had for Gabriel, she never wanted Rob to know.\n But as Rob looked at her, gazing with those clear eyes full of light, she realized that her shields were in tatters around her. She had been awake for two days and in agony or terror for nearly as long. She didn\u0027t have anything left to shield with.\n And she could see, she could feel, that he was seeing right inside her. Rob knew.\n \"Why didn\u0027t you tell me?\" he asked her after a small eternity.\n \"I didn\u0027t-I didn\u0027t feel that way-until-so many-things have happened . . .\" Kaitlyn faltered. Of all things, she wanted to make Rob all right. Although now she saw that her love for him must have been changing for a long time, gradually, she didn\u0027t know how to explain that. \"It\u0027s probably just-I\u0027ll get over it. In a little while\n ...\"\n \"Not that, you won\u0027t,\" Rob said. \"Neither of you. I mean, I sure hope you don\u0027t.\" He sounded as incoherent as Kaitlyn felt, and he kept swallowing. But he went on doggedly, \"Kait, I love you. You know I do. But this isn\u0027t something I can compete with.\" He stepped back. \"I\u0027m not blind. You two belong together.\"\n He looked . . . distressed, Kaitlyn realized vaguely. Distressed, but not devastated. Not ruined for life.\n There was so much more to Rob.\n And, as she watched, Anna moved up and put her hand on his back from behind. Kaitlyn looked at her over Rob\u0027s shoulder.\n Anna smiled tremulously. Her dark eyes were wet but glowing somewhere down inside.\n Suddenly a vast, rushing lightness filled Kaitlyn. As if a huge and heavy weight had been taken off her chest. She stared at Anna, and at the way Rob unconsciously was leaning back against Anna\u0027s arm. And the effervescent bubbles lifted her skyward.\n I just had a precognition, she told Anna silently, a stream of unspoken love and joy. You will be very happy. Your best friend says to go for it.\n Anna\u0027s face was bright, as if someone had set a candle behind it. You\u0027re giving me permission?\n I\u0027m giving you an order!\n Lewis laughed out loud. Then he said, \"Didn\u0027t somebody say something about cleaning up? And how about some food?\"\n Bri and Renny and Lydia seemed to recognize that as a signal. They followed him as he started for the kitchen. Anna tugged at Rob\u0027s arm, gently, to bring him, too.\n Rob looked back, once.\n I\u0027m glad, he told Gabriel, and Kaitlyn could hear the truth in it. I mean, it hurts, but I\u0027m glad for you. Take care of her.\n Then he was gone.\n Slowly, Kaitlyn turned to Gabriel.\n It had occured to her at the last minute that nobody had really asked him. Maybe, even if he loved her, he\u0027d prefer that the feeling go away. Maybe he didn\u0027t want her now that everybody had had a hand in the procedure.\n But Gabriel was looking at her now, and she could see his eyes.\n She had seen those eyes dark with brooding anger and cold as ice, she\u0027d seen his gaze veiled like a spiderweb and shattering like agate under pressure. But she\u0027d never seen them as they were now. Full of wondering joy and disbelief, and an almost frightened awe.\n Gabriel was trying to smile, but the expression kept breaking apart. He was looking at her as if he hadn\u0027t seen her for years and years of searching, and had just now walked into a room and come upon her unexpectedly. As if he wanted to look at every part of her, now that he could do it honestly. \n","sourceLink":"https://allnovel.net/dark-visions-the-passion-dark-visions-3/page-15.html","bookId":2126,"book":{"id":2126,"title":"Dark Visions: The Passion (Dark Visions #3)","description":"Storyline: \n The Passion (Dark Visions #3) \n Kaitlyn Fairchild and her four psychic friends nearly escape from the evil Mr. Zetes - until Gabriel defects to the Institute. Desperate to break the intimacy of their telepathic link, he becomes the enemy and hunter of Kaitlyn\u0027s group. Rob is determined to destroy Gabriel if he has to...but Kait can\u0027t let that happen. On her own, she leaves her friends and returns to the Institute, pretending to join Mr. Zetes. But when her reckless gamble goes wrong, will Gabriel save her - or betray her again? And when the final battle comes, will Kaitlyn choose Rob or Gabriel - light or darkness?\n \n","cover":"https://allnovel.net/images/dark-visions-the-passion-dark-visions-3.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/dark-visions-the-passion-dark-visions-3.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:05:07 PM"}}
