{"id":93897,"no":6,"title":"Page 6","content":"And somehow it worked-or seemed to work. Mr. Z stopped shaking his head regretfully and looked thoughtful. At last he shifted his jaw, drew a deep breath, and nodded.\n \"All right, I\u0027m willing to give her a chance,\" he said. \"I\u0027d like to see a little more penitence in her-some signs of remorse-but I trust your judgment, Joyce. And we could certainly use another remote-viewer.\"\n He turned to give Kaitlyn a benevolent smile. \"You and Lydia go along to dinner. I want a word with Gabriel.\"\n It\u0027s over, Kaitlyn realized. They\u0027re not going to kill me; they\u0027re going to feed me. Her heart was only beginning to return to its normal rate. She tried to hide the trembling in her legs as she followed Lydia.\n But it slowed her down, and before she could get out of the front lab she heard Mr. Z speak to Joyce again.\n \"Give her a chance, but watch her. And have Laurie Frost watch her, too. She\u0027s intuitive; she\u0027ll pick up on anything subversive. And if she finds something. . . you know what to do.\"\n A sigh from Joyce. \"Emmanuel. . . you know what I think about your \u0027final solution\u0027-\"\n \"We\u0027ll send her out on a job soon. That ought to prove something.\"\n \"Kait, are you coming?\" Lydia called from the kitchen.\n Kait went through the door, but dawdled on the other side. Mr. Z was speaking again.\n \"Gabriel, I\u0027m afraid you\u0027ve been careless.\"\n Gabriel\u0027s voice was restrained but defiant. \"About the shard? You haven\u0027t heard\"\n \"Not about that,\" Mr. Zetes said in his unhurried way. \"Joyce explained that to me. But there was a man found half-dead on Ivy Street. He had all the signs of someone drained of life energy. The police have been making inquiries.\"\n \"Oh.\"\n \"Very careless of you to do that in our own neighborhood-and the man might talk.\" Mr. Z\u0027s voice dropped to an icy whisper. \"Next time, finish the job.\"\n Kaitlyn was shivering when Gabriel came through\n the door. She was barely able to give him a smile of gratitude.\n Thanks.\n He shrugged. No problem.\n Dinner started off quietly. Joyce served bacon cheeseburgers, fare that never would have been allowed in the old days. The psychics eyed Kaitlyn from around the long table, but didn\u0027t say much. Kait had the feeling they were biding their time.\n \"So where was everybody this afternoon?\" she asked Lydia, trying for normalcy.\n \"I was in Marin. Riding lessons,\" Lydia said in subdued tones-she never seemed to talk loudly around the other students.\n \"I was asleep,\" Gabriel said lazily.\n No one else answered, including Joyce, who returned to the kitchen. Kaitlyn dropped the subject and ate fries. It was interesting, though-the ones who\u0027d been out were also the ones who would have been involved in testing. Could they have been in San Francisco? In Mr. Z\u0027s house-with the crystal?\n She made a mental note to follow up on the question.\n What Joyce said next might have been coincidence.\n \"So you\u0027ve seen the isolation tank.\"\n Kaitlyn almost inhaled a fry. \"Yes. Have-has anybody really been in that thing?\"\n \"Sure, it\u0027s cool,\" Bri said. She shut her eyes and leaned her head back. \"Cosmic, man! Groooovy.\" Her expression of ecstasy was marred by the fact that her open mouth was full of half-chewed hamburger.\n \"Shut your face, you slut!\" Frost snapped, flicking a pickle chip at her.\n \"Who\u0027s a slut, you bimbo?\" Bri returned cordially, chewing. \"Jimbo bimbo. Mumbo jumbo.\"\n They both laughed: Frost shrilly, Bri gruffly.\n Jackal Mac glared. \"Quit with the freakin\u0027 noise,\" he said brutally. \"You make me sick with that freakin\u0027\n noise.\" He had been eating with fervent single-mindedness, the way Kaitlyn imagined a coyote might eat.\n \"I like to see girls have a good time,\" Renny said. He was eating with finicky precision, gesturing with a french fry. \"Don\u0027t you, Mac?\"\n \"You making fun of me? You making fun of me, man?\"\n Kaitlyn blinked. It was a non sequitur; she didn\u0027t follow Mac\u0027s logic. But it didn\u0027t take logic to read the sudden fury in his slitted eyes.\n He stood up, towering over the table, leaning across to stare at Renny. \"I said, you makin\u0027 fun of me?\" he bellowed.\n Renny let him have it with a hamburger in the face.\n Kaitlyn gaped. The hamburger had been dripping with ketchup and Thousand Island dressing. Renny had thoughtfully removed the bun, so Jackal Mac got the full benefit of the condiments.\n Bri shrieked with laughter. \"What a pitch, what a pitch! Pitch, snitch!\"\n \"Think that\u0027s funny?\" Jackal Mac seized her by the hair and slammed her face into her plate. He began to grind it around and around. The giggles turned to screams.\n Kaitlyn was now gasping. Frost plunged her long nails into a bowl of coleslaw and came out with a juicy handful. She threw it at Mac, but it scattered over the table, hitting Renny, too.\n Renny seized a bottle of Clearly Canadian water- the fizzy kind.\n \"Time to go.\" Gabriel caught Kaitlyn by the arm\n above the elbow and neatly lifted her from the chair out of the way of a burst of carbonated water. Lydia was already scuttling out of the room.\n \"But he\u0027s going to kill her!\" Kaitlyn gasped. Mac was still grinding Bri\u0027s face into the plate.\n \"So?\" Gabriel piloted her toward the kitchen.\n \"No, I mean, really. I think that plate cracked; he\u0027s going to kill her.\"\n \"I said, so?\u0027\"\n There was the sound of shattering glass and Kaitlyn looked back. Jackal Mac had stopped grinding Bri\u0027s face; Renny was now slashing at him with a broken Clearly Canadian bottle.\n \"Oh, my God-\"\n \"Come on.\"\n In the kitchen, Joyce was washing dishes.\n \"Joyce, they\u0027re-\"\n \"It happens every night,\" Joyce said shortly. \"Leave it alone.\"\n \"Every night?\"\n Gabriel stretched, looking bored. Then he smiled. \"Let\u0027s go up to my balcony,\" he said to Kaitlyn. \"I need some air.\"\n \"No, I-I want to help Joyce with the dishes.\" There was no point in trying to deceive him about such a minor thing, so she added, I want to talk to her a minute. I didn\u0027t have time earlier.\n \"Suit yourself.\" Gabriel\u0027s voice was unexpectedly cold; his expression was stony. \"I\u0027ll be busy later.\" He left.\n Kaitlyn didn\u0027t understand why he was angry, but there was nothing to do about it. She was a spy, she had information to gather. Picking up a dish, she said abruptly, \"Joyce, why do you put up with it?\"\n \"With Gabriel? I don\u0027t know, why do you?\"\n \"With them.\" Kaitlyn jerked her chin toward the dining room, where yells and crashes could still be heard.\n Joyce gritted her teeth and scrubbed viciously at a greasy pan with a soap pad. \"Because I have to.\"\n \"No really. Everything\u0027s so crazy now-and it seems like it\u0027s against everything you believe in.\" Kaitlyn was getting incoherent-maybe the scare before dinner was still affecting her. She had the feeling that she should shut up, but instead she blundered on. \"I mean, you seem like the kind of person who really believes in things, and I just don\u0027t understand-\"\n \"You want to know why? I\u0027ll show you!\" With a soapy hand, Joyce seized something that had been on the counter, underneath the Chinese take-out containers.\n It was a magazine, the Journal of Parapsychology.\n \"My name is going to be in this! The lead article. And not just this.\" Joyce\u0027s face was contorted, it reminded Kaitlyn of the way she\u0027d looked when she\u0027d held Gabriel\u0027s bleeding forehead against the crystal, trying to kill him. Overcome by maniacal passion.\n \"Not just this, but in Nature, Science, The American Journal of Psychology, The New England Journal of Medicine,\" Joyce raved. \"Multidisciplinary journals, the most prestigious journals in the world. My name and my work.\"\n Dear God, she\u0027s a mad scientist, Kaitlyn thought. She was almost spellbound by the ranting woman.\n \"And that\u0027s just the beginning. Awards. Grants. A full professorship at the school of my choice. And, incidentally, a little trinket called the Nobel Prize.\"\n Kait thought at first that she was joking. But there was no humor in those glazed aquamarine eyes. Joyce looked as insane as any of the psycho psychics.\n Could he have hit her with the crystal, too? Kaitlyn wondered dazedly. Or could it be some sort of cumulative effect from being around it, like secondhand smoke?\n But she knew that no matter what the crystal had done to warp and magnify the desire, it was Joyce\u0027s desire in the first place. Kaitlyn had finally discovered what made Joyce run; she had just seen into the woman\u0027s soul.\n \"That\u0027s why I put up with it, and why I\u0027m going to put up with anything. So that the cause of science can be advanced. And so I can get what I\u0027m due.\"\n As suddenly as she had grabbed it, Joyce dropped the magazine she\u0027d been shaking in front of Kaitlyn\u0027s eyes. She turned back to the sink.\n \"Now, why don\u0027t you take a walk,\" she said in a voice suddenly gone dull. \"I can wash the dishes by myself.\"\n Numb, Kaitlyn walked out of the kitchen. She avoided the dining room, went through the front lab and up the stairs.\n Gabriel\u0027s door was locked. Well, she should have expected that, really. She\u0027d managed to offend two of the three people who\u0027d championed her tonight. Might as well try for a perfect score, she thought philosophically, and headed for the room she was to share with Lydia.\n But Lydia proved to be impossible to offend or talk to at all. She was in bed with the covers pulled over her head. Whether she was sulking or simply scared, Kaitlyn didn\u0027t know. She wouldn\u0027t come out.\n So moody, Kaitlyn thought.\n It was a very long, very dull evening. Kait listened to the other psychics stagger up to their various rooms, then a TV blared from one room, a stereo from the other. It spoiled Kaitlyn\u0027s concentration for the one thing that might have relaxed her: drawing.\n And this room depressed her. All her possessions had disappeared from it-thrown away when the new students came in. Anna\u0027s raven mask was lying in a corner. Like a piece of garbage. Kait didn\u0027t dare hang it up where it belonged.\n Finally, she decided to take a bath and follow Lydia\u0027s example. She had a long soak, curled up in bed-and then there was nothing to do but think.\n Scenes from the day kept floating through her mind. The face of the red-haired man . . . Gabriel\u0027s face in the dawn light. Mr. Z\u0027s silhouette.\n I\u0027ve got to make plans, she thought. Mysteries to investigate. Ways to find the crystal. But her mind couldn\u0027t focus on one thing, it kept skipping.\n Joyce defended me ... I fooled the fooler. And what convinced her was that Rob and I had broken up ...\n because Rob liked Anna.\n What an idea. How odd. And Gabriel fell for it, too.\n She must be sleepy. Her mind skipped again, her thoughts becoming less and less cohesive. I hope Gabriel isn\u0027t really angry with me. I need him. Oh, God, all the things I said to him . . .\n Was that wrong? To let him think I\u0027m in love with him? But it wasn\u0027t completely a lie. I do care about him. . . .\n As much as I do about Rob?\n It was a heretical thought, and one which jerked her fully awake. She realized she had been half-dreaming.\n But the thought wouldn\u0027t go away.\n In Canada she had discovered that Gabriel loved her. Loved her in a vulnerable, childlike way she could never have believed if she hadn\u0027t seen it, felt it in his mind. He had been completely open to her, so warm, so joyous . . .\n . . . the way he was this morning, her mind whispered.\n But in Canada she hadn\u0027t loved him. Or at least she hadn\u0027t been in love.\n You couldn\u0027t be in love with two people at the same time. You couldn\u0027t. . .\n Could you?\n Suddenly Kaitlyn felt icy cold. Her hands were cold, her face was cold. As if someone had opened a window somewhere inside her and let a glacial wind blow in.\n If I loved Gabriel ... if I loved both of them ...\n How could I choose?\n How could I choose?\n The words were ringing so loudly in her head that she didn\u0027t notice the very real noise in her room. Not until a shadow loomed on the wall beside her.\n Terror swept her. For an instant she thought it was Mr. Z-and then she saw Gabriel beside her bed.\n Oh, Lord, did he hear my thought? She groped for shields, found she didn\u0027t have any. She was burned out.\n But Gabriel was smiling, looking at her from under heavy eyelids. He would never have smiled like that if he had heard. \"Ready to try out the balcony now?\" he asked.\n Kaitlyn looked at him, slowly regaining her composure. He was looking particularly gorgeous, and dangerous as darkness. She felt a magnetic pull drawing her to him.\n But she was exhausted. Unshielded. And she had\n just discovered a crisis within herself that threatened to bring the world crashing down.\n I can\u0027t go with him. It would be insane.\n The magnetic pull only got stronger. She wanted to be held. She wanted him to hold her.\n \"Come on,\" Gabriel whispered, and took her hand. He caressed the palm with his thumb. \"Kiss me, Kait.\"\n Kaitlyn was shaking her head at him. What on earth could the girl mean?\n Gabriel could tell she wanted to come. He\u0027d read the line in some old book somewhere, probably during one of his stints in solitary. \"She trembled at his touch.\" Reading it, he\u0027d sneered-but now he was seeing the real thing. When he reached down to take her hand, Kaitlyn trembled.\n So what was the problem?\n I\u0027m tired, she projected in a whisper.\n Oh, come on. Sitting on a balcony is relaxing.\n He could tell she was going through some struggle. Mad because of the way he\u0027d acted after dinner?\n Or...\n Did it have something to do with what he\u0027d seen this afternoon?\n His mood darkened. Is there something wrong? he asked silkily.\n \"No, of course not,\" she said very quickly. On the other bed a lump under the comforter stirred. Gabriel eyed it with distaste.\n Kaitlyn was getting up. Gabriel\u0027s lip twitched at the sight of her nightgown-it was flannel and tentlike, covering her from throat to ankle. Quite a bit different from Frost, who had pirouetted in front of him dressed in what looked like a transparent red handkerchief the first night he\u0027d met her. She\u0027d made it clear, too, that she didn\u0027t mind if he took the handkerchief off.\n Kaitlyn, by contrast, was holding the neck of her nightgown closed as she briskly walked to his room.\n She paused there to look at the walls. \"You do the graffiti?\"\n He snorted. Mac. He was living here.\n \"And what did he think when you asked him to get out?\"\n Gabriel said nothing, waited until she turned around. Then he gave her one of his most disturbing smiles. I didn\u0027t ask.\n \"Oh.\" She didn\u0027t pursue it. She stepped through the open sliding glass door onto the balcony. \"It\u0027s a nice night,\" she murmured.\n It was\u0027-a soft moonless night, with stars showing between branches of the olive trees. The air was warm, but Kaitlyn had her arms wrapped around herself.\n Gabriel went still.\n Maybe it was the simplest explanation after all. Maybe he\u0027d been wrong about her trembling-or wrong about the reason. Not desire . . . but fear.\n \"Kaitlyn.\" Instinctively, he used words instead of thoughts, giving her the distance she seemed to need.\n \"Kait, you don\u0027t have to ... I mean, you know that, don\u0027t you?\"\n She turned quickly, as if startled. But then she didn\u0027t seem to know what to say. He could search her thoughts-he could sense them even now, like silver fish darting and gliding in clear water-but he wouldn\u0027t\n \u0027t. He would wait for her to tell him.\n She was staring at him, breathing lightly. \"Oh, Gabriel. I do know. And I can\u0027t explain-I\u0027m just... oh, it\u0027s been a hard day.\"\n Then she put her hands over her face. She started to cry, with her hair falling around her, and little quick intakes of breath.\n Gabriel stood transfixed.\n Kaitlyn the indomitable-crying. She did it so seldom that he was too amazed at first to react. When he could move, he could think of only one thing to do.\n He took her in his arms, and Kaitlyn clung to him. Clung tightly-and after a moment lifted a tear-stained face to him.\n The kisses were soft and slow and very passionate. It was strange to do this without touching her mind, but he wasn\u0027t going to be the first to initiate contact. He\u0027d wait for her. Meanwhile, it was a sort of pleasurable agony to restrain himself.\n And it was good just to hold her and touch the softness of her skin. He wanted to hold her hard, not to hurt her but to keep her safe, to show her that he was strong enough to protect her. Her beauty was like fire and strange music, and he loved her.\n And he could love her, because she didn\u0027t belong to anyone else, and she loved him back. She\u0027d given it all up for him.\n For an instant he felt a flicker of guilt at that, but it was swept aside by a fierce desire to hold her closer.\n To be closer. He couldn\u0027t keep himself in check any longer. He reached for her mind, a tendril of thought extending to caress her senses.\n Kaitlyn recoiled. Not just pulling away from his mind, but pulling out of his arms. He could feel her trying to fling up shields against him.\n Leaving him stricken, utterly bewildered, and bereft. Cold because she\u0027d taken all the warmth in the universe away with her.\n Suspicion knifed through him, unavoidable this time.\n What is it you don\u0027t want me to see?\n \"Nothing!\" She was frightened-no, panicked. His suspicion swelled until it was larger than both of them, until it blocked out everything else. He threw words at her like stones.\n \"You\u0027re lying! Don\u0027t you think I can tell?\" He stared at her, controlling his breath, forcing his voice into velvety-iron tones. \"It wouldn\u0027t have something to do with Kessler coming around here this afternoon, would it?\"\n \"Rob-here?\"\n \"Yeah. I felt his mind and tracked him down to the redwood trees out back. You\u0027re telling me you didn\u0027t know?\"\n Her eyes were still wide with surprise-but he saw, and felt, the flash of guilt. And his suspicions were confirmed.\n \"What are you really doing here, Kaitlyn?\"\n \"I told you. I-\"\n \"Stop lying to me!\" Again he had to stop to control himself. When he spoke again his voice was like ice because he was made of ice. \"You didn\u0027t break it off with him, did you? And you\u0027re not here to join us.\n You\u0027re a spy.\"\n \"That\u0027s not true. You won\u0027t even give me a chance-\"\n \"I told them all that I\u0027d seen into your mind-but I never really did. You made sure of that. You did a wonderful job of tricking me.\"\n Her eyes were large and fierce with pain. \"I didn\u0027t trick you,\" she said in a ragged voice. \"And if you think I\u0027m a spy, then why don\u0027t you go tell Joyce? Why don\u0027t you tell them all?\"\n He was calm, now, because a block of ice can\u0027t feel. \"No, I won\u0027t do that. I\u0027ll let you do it to yourself. \n","sourceLink":"https://allnovel.net/dark-visions-the-passion-dark-visions-3/page-6.html","bookId":2126,"book":{"id":2126,"title":"Dark Visions: The Passion (Dark Visions #3)","description":"Storyline: \n The Passion (Dark Visions #3) \n Kaitlyn Fairchild and her four psychic friends nearly escape from the evil Mr. Zetes - until Gabriel defects to the Institute. Desperate to break the intimacy of their telepathic link, he becomes the enemy and hunter of Kaitlyn\u0027s group. Rob is determined to destroy Gabriel if he has to...but Kait can\u0027t let that happen. On her own, she leaves her friends and returns to the Institute, pretending to join Mr. Zetes. But when her reckless gamble goes wrong, will Gabriel save her - or betray her again? And when the final battle comes, will Kaitlyn choose Rob or Gabriel - light or darkness?\n \n","cover":"https://allnovel.net/images/dark-visions-the-passion-dark-visions-3.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/dark-visions-the-passion-dark-visions-3.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:05:07 PM"}}
