{"id":100818,"no":43,"title":"Page 43","content":"I took another awful step. Asher was still crushing me. “They told me it’s only until you have our baby. If you want to keep it. It’s up to you.” “Then what?” Hope—any hope—I needed it. “Then I change you all the way, and take you back as mine,” Anna said, loud enough that the entire room could hear. “Change me now.” I looked over at Raven and the follower he’d brought with him. I didn’t want to go with them, and I didn’t want to be commanded to do things that I couldn’t disobey. Being a vampire with Anna was better than that. “Just change me now.” Anna’s voice was rich with sorrow when she spoke again. “If I change you now, the child dies. Children don’t survive the changing process. Ever.” “Oh.” I swallowed. This was Asher’s and my only chance. Our child’s only chance. Whatever it was, whatever he would become—this was the only way. “I heard stories from the others that were saved. If she could let anything die, we wouldn’t be here,” Raven said drolly. “Just nine months?” I asked Anna. “Eight, if you count time served?” “Until you have the baby,” she said, and then looked to Raven. “I expect you to give her back to me alive.” “Technically, enough of her will be,” Raven said. Asher pressed his forehead to mine. “I’ll watch over you somehow. I’ll make sure you’re all right.” “There’s no prohibition about me killing this man, is there?” Raven asked the air as though it might answer him back. It was just eight months. Eight months and then I’d be free. I could survive anything for eight months, couldn’t I? Couldn’t … we? I kissed Asher fiercely, surprising him with my strength. And he knew my kiss for what it was, a promise and a good-bye. We’d had kisses like this before. We’d lost each other—and we’d found each other again. Things had been perfect for a time. If we were both alive, we could get that back. I twisted my head as if to drink him in, grinding my lips and teeth against his until blood ran between us and found I didn’t mind. “Now,” Raven said, and the sound of his voice was like a snapping leash pulling an unseen collar I wore. “Just eight months,” I whispered, stepping back from Asher. He nodded, his intent turning steel. He could wait eight months—but after that, hell wouldn’t stop Asher from coming to save me and our boy. Anna placed herself in my path and stopped me. “I wish I could tell you that it would be easy, or that Raven would be kind. But it would behoove him to do as I say, or risk my wrath. I am the first of my line, and I already have many followers. I can endlessly make more, and would do so, for the sake of you.” I nodded at her. That was all Raven’s invisible leash would let me do. Pulled by something I couldn’t explain, I was forced to walk to his side. “At last,” he said, and then bowed to the room. “Anna, lovely to be threatened by you, as always. Wolf, get the car.” Raven pulled me outside into the rain. It seemed not to hit him, but I definitely felt myself getting wet. Tears I’d been hiding for Asher’s sake leaked from my eyes. A black car—of course—pulled up, and Raven opened up the back door for me. “Get inside.” I did as I was told, and sat down. I buckled my seat belt, which made Raven laugh. When he was done, Wolf, beside me in the back, pulled out a black velvet hood. “Can’t have you seeing the way to our lair,” he said, sliding it over my head. My hands weren’t trapped at my sides, but there was no point in fighting him—if I did, they would be. A blackness darker than the night or the ocean depths came down. I’d survived, and my child lived, but we weren’t going home.","sourceLink":"https://allnovel.net/deadshifted-edie-spence-4/page-43.html","bookId":2621,"book":{"id":2621,"title":"Deadshifted (Edie Spence #4)","description":"Storyline: Deadshifted (Edie Spence #4) Edie Spence just wanted a vacation. A nice, relaxing, stress free, non-adventure away from the craziness that\u0027s dominated her life since becoming a nurse for paranormal creatures. But from the start, her trip on the Maraschino, a cruise ship bound for Hawaii, has been anything but stress free, especially when Edie\u0027s boyfriend Asher recognizes someone he used to know. Someone from his not-so-nice past. With their lives in the balance, will Edie and Asher be able to save their growing family or will this adventure be their end?","cover":"https://allnovel.net/images/deadshifted-edie-spence-4.jpg","author":"Cassie Alexander","type":"Horror","source":"allnovel","link":"https://allnovel.net/deadshifted-edie-spence-4.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:55:28 PM"}}
