{"id":26528,"no":4,"title":"CHAPTER II. THE DUEL OF PARIS AND MENELAUS.","content":"The battle is set in array, “army against army.” But there is a difference in the bearing of the opposed forces which is very significant, and is probably a note of real character, not a mere stroke of the poet’s art. The Trojan host, after the fashion of Asiatic warfare, modern as well as ancient, move forward to the combat with loud shouts and clashing of weapons. The poet compares their confused clamour to the noise of a flock of cranes on their annual migration. The Greeks, on the other hand, march in silence, with closed ranks, uttering no sound, but “breathing determination.” So, when afterwards they actually close for action, not a sound is heard in their ranks but the voice of the leaders giving the word of command. “You would not think,” says the poet, “that all that mighty host had tongues;” while, in the mixed battalions of the enemy, whose allies are men of many lands and languages, there arises a noisy discordant clamour—“like as of bleating ewes that hear the cries of their lambs.” But while the hostile forces yet await the signal for the battle, Paris springs forth alone from the Trojan ranks. “Godlike” he is in his beauty, and with the{v.i-49} leve of personal adornment which befits his character, he wears a spotted leopard’s hide upon his shoulders. Tennyson’s portrait of him, though in a different scene, is thoroughly Homeric— “White-breasted like a star, Fronting the dawn he moved; a leopard’s skin Drooped from his shoulder, but his sunny hair Clustered about his temples like a god’s.” Advancing with long strides in the space between the armies, he challenges the leaders of the Greeks, one and all, to meet him singly in mortal combat. Menelaus hears the boast. “Like a hungry lion springing on his prey,” he leaps full-armed from his chariot, exulting in the thought that now at last his personal vengeance shall be gratified. But conscience makes a coward of Paris. He starts back—“as a man that sees a serpent in his path”—the godlike visage grows pale, the knees tremble, and the Trojan champion draws back under the shelter of his friends from the gallant hero whom he has so bitterly wronged. The Roman historian Livy—a poet in prose—had surely this passage in his mind when he described Sextus Tarquinius, the dishonourer of Lucretia, quailing, as no Roman of his blood and rank would otherwise have quailed, when young Valerius dashes out from the Roman lines to engage him. The moral teaching of the heathen poet on such points is far higher than that of the medieval romancers with whom he has so many points in common. Sir Tristram of Lyonnois has no such scruples of conscience in meeting King Mark. Lancelot, indeed, will not fight with Arthur; but the very nobility of character with which the unknown author of that striking impersonation has endowed him is in itself the highest{v.i-50} of all wrongs against morality, in that it steals the reader’s sympathies for the wrong-doer instead of for the injured husband. Shakespeare, as is his wont, strikes the higher key. It is the consciousness of guilt which makes Macbeth half quail before Macduff— “Of all men else have I avoided thee: But get thee back—my soul is too much charged With blood of thine already. ...I will not fight with thee.” Paris withdraws into the Trojan ranks, and there encounters Hector. As has been already said, the poet assumes at the outset, on the part of his audience, at least such knowledge of his dramatis person? as to make a formal introduction unnecessary. Hector is the noblest of all the sons of Priam, the shield and bulwark of his countrymen throughout the long years of the war. Achilles is the hero of the Iliad, and to him Homer assigns the palm of strength and valour; but, as is not seldom the case in fiction, the author has painted the rival hero so well that our sympathies are at least as frequently found on his side. We almost share Juno’s feelings against the Trojans when they are represented by Paris; but when Hector comes into the field, our hearts half go over to the enemy. His character will be touched upon more fully hereafter: for the present, it must discover itself in the course of the story. He throws himself in the way of Paris in his cowardly retreat; and in spite of the fraternal feeling which is so remarkably strong amongst Homer’s heroes,—in Hector and his brothers almost as much as in Agamemnon and Menelaus,—shame and disgust at his present poltroonery now mingle themselves with a{v.i-51} righteous hatred of the selfish lust which has plunged his country into a bloody war— “Was it for this, or with such heart as now, O’er the wide billows with a chosen band Thou sailedst, and with violated vow Didst bring thy fair wife from the Apian strand, Torn from the house of men of warlike hand, And a great sorrow for thy father’s head, Troy town, and all the people of the land, By thine inhospitable offence hast bred, Thus for the enemy’s sport, thine own confusion dread? “Lo, now thou cowerest, and wilt not abide Fierce Menelaus—thou hadst known, I ween, Soon of what man thou hast the blooming bride! Poor had the profit of thy harp then been, Vain Aphrodite’s gifts, thy hair, thy mien, He mangling in the dust thy fallen brow. But there is no wrong to the Trojans keen, And they are lambs in Spirit; or else hadst thou Worn, for thine evil works, a cloke of stone ere now.” W. Paris has the grace to admit the justice of his brother’s rebuke. Hector, he confesses, is far the better soldier; only he pleads, with a self-complacency which he never loses, that grace of person, and a smooth tongue, and a taste for music, are nothing less than the gifts of the gods—that, in fact, it is not his fault that he is so irresistible. He ends, however, with an offer which is far more to Hector’s mind. Let open lists be pitched in sight of both armies, and he will engage Menelaus in single combat; Helen and her wealth shall be the prize of victory. It is a proposal at which Hector’s heart rejoices. He checks at once the advancing line of the Trojans, and steps out himself to the front. The Greeks bend their bows at him, but Agamemnon understands his motions, and bids them hold their hands. It is a fair{v.i-52} challenge which the Trojan prince comes to make on behalf of Paris. Menelaus accepts it, in a few plain and gallant words—he is no orator:— “Hear now my answer; in this quarrel I May claim the chiefest share; and now I hope Trojans and Greeks may see the final close Of all the labours ye so long have borne, T’ avenge my wrong at Paris’ hand sustained. And of us two whiche’er is doomed to death, So let him die! the rest depart in peace.” (D.) A truce is agreed upon, to abide the result of this appeal of battle. A messenger from Olympus—Iris, goddess of the Rainbow—comes to warn Helen of the impending duel. And this introduces one of the most beautiful passages in the whole Iliad, to modern taste. Its sentiment and pathos are perfectly level and quiet; but as a natural and life-like yet highly-wrought portrait of a scene in what we may call the social drama, it stands almost without equal or parallel in classical literature. Helen—the fatal cause of the war, the object of such violent passions and such bitter taunts—is sitting pensively in the palace of her royal father-in-law, writing her own miserable story. She is writing it—not in a three-volumed novel, as a lady who had a private history, more or less creditable, would write it now, but—in a golden tapestry, in which more laborious form it was in those days not unfrequent to write sensational biographies. Iris urges her to be present at the show. The whole reads like the tale of some medieval tournament, except that Helen herself is the prize of victory as well as the Queen of Beauty. Attended by her maidens, she goes down to the place where the aged Priam, like the kings of the Old Testa{v.i-53}ment history, “sits in the gate” surrounded by the elders of his city. It is the “Sc?an,” or “left-hand” gate, which opens towards the camp of the enemy, and commands a view of their lines. We have had no word as yet of the marvellous beauty of Helen. There is no attempt to describe it throughout the whole of the poem. But here, in a few masterly touches, introduced in the simplest and most natural manner, Homer does more than describe it, when he tells us its effects. The old men break off their talk as the beautiful stranger draws near. They had seen her often enough before; the fatal face and form must have been well known in the streets and palaces of Troy, however retired a life Helen might well have thought it becoming in her unhappy position to lead. But the fair vision comes upon their eyes with a new and ever-increasing enchantment. They say each to the other as they look upon her, “It is no blame to Greeks or Trojans to fight for such a woman—she is worth all the ten years of war; still, let her embark and go home, lest we and our children suffer more for her.” Even the earliest critics, when the finer shades of criticism were little understood, were forcibly struck with the art of the poet in selecting his witnesses for the defence. The Roman Quintilian had said nearly all that modern taste has since confirmed. He bids the reader mark who gives this testimony to Helen’s charms. Not the infatuated Paris, who has set his own honour and his country’s welfare at nought for the sake of an unlawful passion; not some young Trojan, who might naturally be ready to vow “the world well lost” for such a woman; nor yet any of the vulgar crowd, easily impressed, and always extravagant in its praise or blame; but these{v.i-54} grave and reverend seniors, men of cold passions and calm judgment, fathers whose sons were fighting and falling for this woman’s sake, and even Priam himself, whose very crown and kingdom she had brought in deadly peril. He receives her, as she draws near, with gentle courtesy. Plainly, in his estimation, her unhappy position does not involve necessarily shame or disgrace. This opens one of the difficult questions of the moral doctrine of the Iliad, which can only be understood by bearing in mind the supernatural machinery of the poem. To the modern reader, the character of Helen, and the light in which she is regarded alike by Greeks and Trojans, present an anomaly in morals which is highly unsatisfactory. It is not as if Homer, like the worst writers of the Italian school, set marriage vows at nought, and made a jest of unchastity. Far otherwise; the heathen bard on such points took an infinitely higher tone than many so-called Christian poets. The difficulty lies in the fact that throughout the poem, while the crime is reprobated, the criminal meets with forbearance, and even sympathy. Our first natural impulse with regard to Helen is to look upon her much in the light in which she herself, in one of her bitter confessions, says she is looked upon by the mass of the Trojans:— “Throughout wide Troy I see no friendly eye, And Trojans shudder as I pass them by.” But this feeling, we must remember, arose much more from her being the cause of all the miseries of the siege, than from her having left her Greek husband. Priam and Hector—who have certainly not a lower morality, and a higher nobility and unselfishness, than{v.i-55} the mass of their countrymen—show no such feeling against her; on the contrary, they treat her with scrupulous delicacy and consideration. So also the leaders of the Greek forces betray no consciousness that they are fighting, after all, for a worthless woman; rather, she is a prize to be reclaimed, and Menelaus himself is ready from the first to receive her back again. How is this? Some have understood the poet to represent her abduction from her home to have been forcible—that she was carried off by Paris entirely against her will; but even allowing this (which is not consistent with many passages in the poem), it would not excuse or palliate her voluntary acceptance of such a degraded position throughout the subsequent story. The real explanation is given in a few words by Priam in the scene before us. “Not thee I blame, But to the gods I owe this woful war.” In Homer’s sight, as in Priam’s, she is the victim of Venus. She is “the victim of passion,” only in a more literal and personal sense than we use the expression. Love, lawful or unlawful, was a divine—that is, a supernatural—force, to the mind of the poet. The spells of Venus are irresistible: that fatal gift of beauty is the right by which the goddess takes possession of her, and leads her captive at her evil will. Helen herself feels her own degradation far more deeply, in fact, than any one else seems to feel it; no one uses any expressions about her half so bitter as those which she applies to herself; “shameless,” “bringer of sorrow,” “whose name shall be a by-word and a reproach,” are the terms she uses{v.i-56}— “Oh that the day my mother gave me birth, Some storm had on the mountains cast me forth!” We must judge Homer’s characters with reference to the light of his religious creed—if creed it were—or at least with reference to the supernatural element employed in the Iliad. We shall be safe, then, in seeing Helen through Homer’s eyes. We separate her unconsciously, as he does, from her fault. Look upon that as the poet does, as she does herself, as Priam and Hector and Menelaus do, as her fate, her misfortune, the weird that she has been doomed to dree,—and then, what a graceful womanly character remains! Gentle and daughterlike to the aged Priam, humble and tearful in the presence of her noble and generous brother-in-law Hector, as disdainful as she dares to be to her ignoble lord and lover,—tender, respectful, regretful, towards the gallant husband she has deserted. So she comes in all her grace and beauty, and takes her seat by the old King’s side upon the watch-tower, looking out upon the camp of the Greeks. He bids her tell him the names of such of the kings and chiefs as she can recognise. One there is who seems indeed a “king of men,” by the grace of nature. There are taller warriors in the host; but none of such majestic mien and right royal bearing. It is, indeed, Agamemnon the son of Atreus, as Helen informs him,— “Wide-reigning, mighty monarch, ruler good, And valiant warrior; in my husband’s name, Lost as I am, I called him brother once.” Another chief attracts Priam’s attention, as he strides along in front of the lines. Less in stature than Agamemnon, he is broader in the chest and shoulders. Helen knows him well. It is Ulysses, son of Laertes,{v.i-57} “the man of many wiles;” nursed among the rugged cliffs of his island kingdom of Ithaca, but already a traveller well versed in the ways of men, the stratagems of war, and the counsels of princes. He is recognised, too, now that Helen names him, by some of the Trojan elders; for he, it must be remembered (and Homer assumes that we know it), had accompanied Menelaus in the embassy to demand Helen’s restitution. Old Antenor, now sitting by Priam’s side, well remembers the remarkable stranger, whom he had lodged and entertained as a public guest. The picture he draws of him is one of the most graphic and individual of all Homer’s characters. “For hither when on thine account to treat, Brave Menelaus and Ulysses came, I lodged them in my house, and loved them both, And studied well the form and mind of each. As they with Trojans mixed in social guise, When both were standing, o’er his comrade high With broad-set shoulders Menelaus stood: Seated, Ulysses was the nobler form: Then, in the great assembly, when to all Their public speech and argument they framed, In fluent language Menelaus spoke, In words though few, yet clear; though young in years, No wordy babbler, wasteful of his speech: But when the skilled Ulysses rose to speak, With downcast visage would he stand, his eyes Bent on the ground; the staff he bore, nor back He waved, nor forward, but like one untaught, He held it motionless; who only saw, Would say that he was mad, or void of sense: But when his chest its deep-toned voice sent forth, With words that fell like flakes of wintry snow, No mortal with Ulysses could compare; Then, little recked we of his outward show.” (D.) A third hero catches the eye of the Trojan king, as{58} well he may—a leader like Saul, “taller by the head and shoulders than the rest of the people”—and he asks Helen to name him also. This is Ajax of Crete, son of Telamon, a giant chieftain, “the bulwark of the Greeks,” represented here in the Iliad as easy-tempered and somewhat heavy, as it is the wont of giants to be, degraded by medieval and modern poets into a mere bulk without brains. “Mars’ idiot,” Shakespeare calls him, “who has not so much wit as would stop the eye of Helen’s needle.” Shirley, in his ‘Ajax and Ulysses,’ carries out the same popular notion:— “And now I look on Ajax Telamon, I may compare him to some spacious building; His body holds vast rooms of entertainment, And lower parts maintain the offices; Only the garret, his exalted head, Useless for wise receipt, is filled with lumber.” By the side of Ajax Helen also marks King Idomeneus of Crete, a frequent guest in the palace of Menelaus in happier times; for the court of Sparta, as will be seen hereafter in the Odyssey, was in these heroic days a centre of civilisation and refinement. Two chiefs Helen’s anxious eyes vainly try to discern amongst the crowd of her countrymen,— “My own two brethren, and my mother’s sons, Castor and Pollux; Castor, horseman bold, Pollux, unmatched in pugilistic skill; In Laced?mon have they stayed behind? Or can it be, in ocean-going ships That they have come indeed, but shame to join The fight of warriors, fearful of the shame And deep disgrace that on my name attend?” (D.) Helen’s self-reproachful surmises have not reached the truth. The “Great Twin Brethren,” who had once{v.i-59} already (so the ancient legend said) rescued their beautiful sister in her girlhood from the hands of Theseus, who had been amongst the mighty hunters of the Calydonian boar, and had formed part of the adventurous crew of the Argo, had finished their mortal warfare years before in a raid in Messenia; but to reappear as demigods in Greek and Roman legend,—the spirit horsemen who rallied the Roman line in the great fight with the Latins at the Lake Regillus, the “shining stars” who lighted the sailors on the stormy Adriatic, and gave their names to the ship in which St Paul was cast away. “Back comes the chief in triumph, Who, in the hour of fight, Hath seen the Great Twin Brethren In harness on his right. Safe comes the ship to harbour, Through billows and through gales, If once the Great Twin Brethren Sit shining on the sails.”[15] This picturesque dialogue between Priam and his fascinating guest is interrupted far too soon for the reader’s complete enjoyment—somewhat too abruptly, indeed, for its perfection. One would like to have heard Helen’s estimate of the other leaders of the Greeks; of Diomed, of the lesser Ajax, of Nestor, of Mnestheus the Athenian; and it is hardly possible not to fancy that the scene has been left by the poet incomplete, or that some portion has been lost past recovery. The tragedian ?schylus, who was full of the true Homeric spirit, carried out the idea to what seems its natural completion in a remarkable scene of ‘The Seven Chiefs against Thebes,’ to which we may{v.i-60} hope to introduce our readers more fully hereafter. Euripides, in his ‘Ph?niss?,’ adopts the very same machinery; and Tasso has also imitated the scene in his ‘Jerusalem Delivered,’[16] where he brings Erminia on the walls, pointing out to King Aladine the persons of the most renowned of the besieging knights. The interruption is as little satisfactory to Priam as to the reader. A herald summons the king of Troy to a conference in the mid-space between the city walls and the enemy’s leaguer, in order to ratify the armistice, while Paris and Menelaus decide their quarrel in single combat. The old man mounts his chariot, “shuddering,” as foreboding the defeat and death of his son. Agamemnon and Ulysses on the one side, Priam and Antenor on the other, duly slay the sacrificial lambs, and make joint appeal to Jupiter, the Avenger of oaths, pouring the red wine upon the earth with solemn imprecation, that so may flow forth the heart’s blood of him who on either part shall break the truce. And the god listens as before, but does not accept the appeal. Priam withdraws, for he cannot bear to be a spectator of his son’s peril. Hector and Ulysses, precisely in the fashion of the marshals in the tournaments of chivalry, measure out the lists; the rest of the Greeks lie down on the ground beside their horses and chariots, while the lots are cast which shall first throw the spear. The chance falls to Paris. He throws, and strikes full and fair in the centre of Menelaus’ round shield. But the seasoned bull’s hide turns the point, and it does not penetrate. Next comes the turn of Menelaus. Paris has ventured no appeal to heaven; but the Greek king lifts his voice in prayer to Jupiter for vengeance on{v.i-61} the traitor who has so abused his hospitality, before he poises his long lance carefully and hurls it at his enemy. Right through shield, breastplate, and linen vest goes the good Greek weapon; but Paris leans back to avoid it, and it only grazes him. Menelaus rushes forward, sword in hand, and smites a downright blow on Paris’ crest. But the Trojan helmet proves of better quality than the shield, and the Greek blade flies in shivers. Maddened by his double failure, he rushes on his enemy, and seizing him by the horse-hair crest, drags him off by main strength towards the ranks of the Greeks. But in this extremity the goddess of love comes to the rescue of her favourite. At her touch the tough bullhide strap of Paris’ head-piece, which was all but choking him, breaks, and leaves the empty helmet in the hands of Menelaus. He hurls it amongst his comrades in disappointment and disgust, and rushes once more in pursuit of Paris. But Venus has wrapt him in a mist, and carried him off; and while the son of Atreus rushes like a baffled lion up and down the lists in quest of him, while even the Trojans are aiding in the search, and no man among them would have hidden him—for “they all hated him like black death”—he is safely laid by the goddess in Helen’s chamber. The scene in which she receives him is, like all the rest of her story, a beautiful contradiction. Her first greeting is bitter enough. Either her heart has been indeed with Menelaus in the fight—or at least she would have had her present husband come back from the field, dead or alive, in some more honourable fashion— “Back from the battle? Would thou there hadst died Beneath a warrior’s arm whom once I called{v.i-62} My husband! Vainly didst thou boast erewhile Thine arm, thy dauntless courage, and thy spear, The warlike Menelaus should subdue! Go now again, and challenge to the fight The warlike Menelaus.—Be thou ware! I warn thee, pause, ere madly thou presume With fair-haired Menelaus to contend!” (D.) Brave words! but still, as of old, the fatal spells of Venus are upon her, and Paris’ misadventure in the lists is all too soon condoned. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3061/84585.html","bookId":993,"book":{"id":993,"title":"Ancient Classics for English Readers","description":"简介： It is proposed to give, in these little volumes, some such introduction to the great writers of Greece and Rome as may open to those who have not received a classical educationor in whose case it has been incomplete and fragmentarya fair acquaintance...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3061","creation":"Aug 1, 2019 12:24:07 AM","modification":"Aug 1, 2019 12:24:07 AM"}}
