{"id":74196,"no":2,"title":"Page 2","content":"I retched, but my stomach was empty except for the glass of water, my throat filled with nothing but sand. And still I heaved, throwing up the bile and acid that seemed to be eating away at my core.\\n\\n When I closed my eyes, my head felt like a top, spinning in a place without gravity. When I finally pulled myself to my feet and leaned against the bathroom sink, a light flickered on, and I found myself staring into a face I totally didn’t know. I would have jumped if I’d had the strength, but as it was, all I could do was lean closer.\\n\\n My hair had been shoulder length and dishwater blond my whole life, but right then it was a little past my ears and as black as night. I pulled the nightgown over my head, felt my hair stand on end from the static, and stared at a body I no longer knew.\\n\\n My ribs showed through my skin. My legs seemed longer, leaner. Bruises covered my knees. Red welts circled my wrists. Thick bandages covered most of one arm. But it all paled in comparison to the knot on the side of my head. I touched it gently, and the pain was so sharp that I thought I would be sick again, so I gripped the sink, leaned close to the mirror, and stared at the stranger in my skin.\\n\\n “What did you do?”\\n\\n Everything in my training told me that this was not the time to panic. I had to think, to plan. I thought of all the places I could go, but my mind drifted, wondering about the places I had been. When I moved, the pain shot through one ankle and up my leg, and I knew I would have a hard time running off that mountain.\\n\\n “Here, here,” Mary said, pressing a cool rag to my head. She brought a cup to my lips, made me drink, and then I whispered, “Why did you call me Gillian?”\\n\\n “It was what you kept saying, over and over,” she said. Her Irish accent seemed thicker in the small space. “Why? Isn’t that your name?”\\n\\n “No. I’m Cammie. Gilly is the name of…my sister.”\\n\\n “I see.”\\n\\n My mind swirled with the options of the things I should and shouldn’t do until it finally settled on the only question that mattered.\\n\\n “Mary, is there a telephone?”\\n\\n Mary nodded. “The Mother Superior bought a satellite phone last summer.”\\n\\n Summer.\\n\\n At the Gallagher Academy for Exceptional Young Women, there are typically seventy-six days in our summer vacation. That’s eleven weeks. Just under three months. One quarter of a year. I had allowed myself the summer to search and hunt and hopefully find the truth about why the Circle wanted me. The season had never seemed that long before, but right then it was like a black hole, threatening to suck up everything in my life.\\n\\n “Mary,” I said, gripping the sink tighter and leaning into the light, “there’s someone I need to call.”\\n\\n Chapter Two\\n\\n I can’t say for certain, but I’ve got to admit that if this whole spy thing doesn’t work out, I might seriously consider joining a convent. Really, when you think about it, it’s not that different from life at the Gallagher Academy for Exceptional Young Women.\\n\\n You’ve got old stone walls and an ancient sisterhood, a collection of women who feel the same calling and are all working toward a higher purpose. Oh, and neither place gives you a whole lot of say on your wardrobe.\\n\\n At noon the next day, the Mother Superior said that I could have a pair of shoes, and the sisters lent me a coat. The clothes Mary laid on my bed were clean and neatly mended, but they seemed entirely too small.\\n\\n “I’m sorry but…I don’t think these will fit.”\\n\\n “They ought to,” Mary said with a giggle. “They’re yours.”\\n\\n Mine.\\n\\n I fingered the soft cotton pants and old sweatshirt I would have sworn I’d never seen before. The clothes were worn, lived in, and I didn’t let myself think about all the living I could no longer remember doing.\\n\\n “There,” Mary said, watching me tie the drawstring on the pants that fit my new body perfectly. “I bet you feel just like your old self, now, don’t ya?”\\n\\n “Yes,” I said, and Mary smiled at me so sweetly that I almost felt guilty for the lie.\\n\\n They told me I should rest, that I needed my strength and my sleep, but I didn’t want to wake up again and find it was past Christmas, New Year’s, that my eighteenth birthday had come and gone without my knowledge; so instead I went outside.\\n\\n As I stepped onto the small path that led to the convent door, I knew it was October, but I was unprepared to feel the chill. Snow covered everything. The branches of the trees were heavy overhead, snapping under the weight of the wet white clumps, crashing through the forest. They made a noise that was too loud—like rifle shots in the cold, thin air. I jumped at every sound and shadow, and I honestly didn’t know which was worse—that I couldn’t remember the last four months, or that for the first time in my life I had absolutely no idea which way was north. I kept the convent safely in my sight, terrified of going too far, not knowing how much more lost I could possibly be.\\n\\n “We found you there.” Mary must have followed me, because when I turned, she was behind me. Her strawberry hair was blowing free from her habit as she stood there, staring at a river that raged at the bottom of a rocky, steep ravine. She pointed to the bank. “On the big rock near that fallen tree.”\\n\\n “Was I awake?” I asked.\\n\\n “Barely.” Mary shoved her hands into her pockets and shivered. “When we found you, you were mumbling. Talking crazy.”\\n\\n “What did I say?” I asked. Mary started shaking her head, but something about me must have told her that I wasn’t going to rest until I knew, because she took a deep breath.\\n\\n “‘It’s true,’” the girl said, and shivered again in a way that I knew had nothing to do with the chill. “You said, It’s true. And then you passed out in my arms.”\\n\\n There is something especially cruel about irony. I could recite a thousand random facts about the Alps. I could tell you the average precipitation and identify a half dozen edible plants. I knew so many things about those mountains in that moment—everything but how I’d reached them.\\n\\n Mary studied the river below and then turned her gaze to me. “You must be a strong swimmer.”\\n\\n “I am,” I said, but, skinny and weak as I was, Mary seemed to doubt it. She nodded slowly and turned back to the banks.\\n\\n “The river is highest in the spring. That’s when the snow melts, and the water is so fast—it’s like the river’s angry. It scares me. I won’t go near it. In the winter, everything freezes, and the water’s barely a trickle, all rocks and ice.” She looked at me and nodded. “You’re lucky you fell when you did. Any other time of year and you would have died for sure.”\\n\\n “Lucky,” I repeated to myself.\\n\\n I didn’t know if it was altitude, or fatigue, or the sight of the mountains that loomed around us, but it was harder than it should have been to breathe.\\n\\n “How far is the nearest town?”\\n\\n “There’s a small village at the base of that ridge.” Mary turned and pointed, but her voice was not much more than a whisper when she said, “It’s a long way down the mountain.”\\n\\n Maybe it was the way she stared into the distance, but for the first time, I realized I probably wasn’t the only one who had run away from someone. Something. In my professional opinion, the Alps are an excellent place for hiding.\\n\\n I turned back to the river, scanned the rocky shore and the waters that ran to the valleys below. “Where did I come from?” I whispered.\\n\\n Mary shook her head and said, “God?”\\n\\n It was as good a guess as any.\\n\\n Standing there among the trees and mountains, the river and snow, I knew that I’d climbed almost to the top of the earth. The bruises and blood, however, told me I’d had a long, long fall.\\n\\n “Who are you, Cammie?” Mary asked me. “Who are you really?”\\n\\n And then I said maybe the most honest thing I’d ever uttered. “I’m just a girl who’s ready to go home.”\\n\\n No sooner had I spoken the words than a dull sound rang through the air, drowning out the rushing of the river below. It was a rhythmic, pulsing noise, and Mary asked, “What is that?”\\n\\n I looked up through the swirling snow to the black shadow in the cloudless sky.\\n\\n “That’s my ride.”\\n\\n Chapter Three\\n\\n I know most girls think their mothers are the most beautiful women in the world. Most girls think that, but I’m the only one who’s right. And yet there was something different about the woman who ran toward me, crouching beneath the chopper’s spinning blades. Snow swirled, and the Alps seemed to shudder, but Rachel Morgan wasn’t just my mom in that moment. She wasn’t just my headmistress. She was a spy on a mission, and that mission…was me.\\n\\n She didn’t hesitate or slow; she just threw her arms around me and said, “You’re alive.” She squeezed tighter. “Thank God, you’re alive.” Her hands were strong and warm, and it felt like I might never leave her grasp again. “Cammie, what happened?”\\n\\n “I left,” I said, despite how obvious and silly it must have sounded.\\n\\n Mary was gone, standing with the rest of the sisters, watching the chopper and the reunion from afar. My mother and I were alone as I explained, “People were getting hurt because of me, so I left to find out what the Circle wants from me. I had to find out what happened to Dad—what he knew. What they think I know. So I left.” I gripped my mother’s arms tighter, searched her eyes.\\n\\n “Yesterday I woke up here.”\\n\\n Mom’s hands were wrapped around the back of my neck—her fingers tangled in my hair—holding me steady.\\n\\n “I know, sweetheart. I know. But now I need you to tell me everything you remember.”\\n\\n The chopper blades were spinning, but the whole world was standing still as I told her, “I just did.”\\n\\n Number of hours I slept on the trip back to Virginia: 7\\n\\n Number of hours the trip actually took: 9\\n\\n Number of croissants my mother tried to get me to eat: 6\\n\\n Number of croissants I actually ate: 2 (The rest I wrapped in a napkin and saved for later.)\\n\\n Number of questions anyone asked me: 1 Number of dirty looks my mother gave to prevent the question-asking: 37*\\n\\n *estimated number, due to the aforementioned sleepiness\\n\\n “Cam.” My mother shook my shoulder, and I felt myself sinking lower in the sky. “We’re here.”\\n\\n I would have known that sight anywhere—the black asphalt of Highway 10, the huge stone building on the horizon, surrounded by the high walls and electrified gates that served to shield my sisterhood from prying eyes. I knew that place and those things better than anything else in the world, and yet something felt strange as the helicopter flew across the forest. The trees were ablaze with bright reds and vivid yellows—colors that had no place at the beginning of summer.\\n\\n “What is it, kiddo?”\\n\\n “Nothing.” I forced a smile. “It’s nothing.”\\n\\n Of course, if you’re reading this, you probably already know a lot about the Gallagher Academy; but there’s a fact about my sisterhood that never makes it into the briefings. The truth of the matter is that, yes, we have been training covert operatives since 1865, but the thing that no one realizes until they’ve seen our school for themselves is this: we are a school for girls. \\n\\n","sourceLink":"https://allnovel.net/out-of-sight-out-of-time-gallagher-girls-5/page-2.html","bookId":2402,"book":{"id":2402,"title":"Out of Sight, Out of Time (Gallagher Girls #5)","description":"Storyline: Out of Sight, Out of Time (Gallagher Girls #5) \\n The last thing Cammie Morgan remembers is leaving the Gallagher Academy to protect her friends and family from the Circle of Cavan-an ancient terrorist organization that has been hunting her for over a year. But when Cammie wakes up in an alpine convent and discovers that months have passed, she must face the fact that her memory is now a black hole. The only traces left of Cammie\u0027s summer vacation are the bruises on her body and the dirt under her nails, and all she wants is to go home. \\n Once she returns to school, however, Cammie realizes that even the Gallagher Academy now holds more questions than answers. Cammie, her friends, and mysterious spy-guy Zach must face their most difficult challenge yet as they travel to the other side of the world, hoping to piece together the clues that Cammie left behind. It\u0027s a race against time. The Circle is hot on their trail and willing stop at nothing to prevent Cammie from remembering what she did last summer.\\n","cover":"https://allnovel.net/images/out-of-sight-out-of-time-gallagher-girls-5.jpg","author":"Ally Carter","type":"Mystery","source":"allnovel","link":"https://allnovel.net/out-of-sight-out-of-time-gallagher-girls-5.html","creation":"Oct 5, 2019 8:58:41 AM","modification":"Oct 5, 2019 10:30:07 AM"}}
