{"id":74214,"no":20,"title":"Page 20","content":"She was right, but that didn’t mean I had to say so.\\n\\n “What does this have to do with Zach?”\\n\\n “People go crazy in different ways,” Bex said with a shrug. “Liz took up baking—almost burned her parents’ house to the ground. But Zach…well, the two of you really are a lot alike, because Zach…ran away.”\\n\\n “So…” I thought about the look in the old woman’s eyes, the words echoing in my mind: your young man. “So he might have found me.”\\n\\n I know it sounds weak and all, but the truth is, I had to lie down. Maybe it was the lingering effects of being too thin and too banged up for my own good, but it was more like the words were too heavy for me.\\n\\n “What does that mean?” I stared up at Bex. “What does it mean—that he found me and then…left me? Or I left him…Or—”\\n\\n “He was only gone two weeks and then he came back,” Bex said, almost pleading with me not to jump to terrible conclusions.\\n\\n “But maybe, in the meantime, he’d found me,” I said.\\n\\n “No,” Macey said. “He didn’t.”\\n\\n “You don’t know that,” I told her.\\n\\n “No, but I know boys.” She exhaled a half-laugh. “And I know liars. And when school started, Zach was as in the dark about where you were and where you’d been as anyone.”\\n\\n “We’ve got to call Mom,” I said. “We’ve got to call her and have her ask him where he went.”\\n\\n “We did,” Bex said. There was a strange light in her eyes when she said, “He told us he went looking for you.”\\n\\n “What aren’t you telling me?” I asked, far too tired of secrets.\\n\\n “Nothing,” Macey said, easing onto the mattress beside me. “There is absolutely nothing else you need to know.”\\n\\n She looked totally convincing—sounded totally convincing. But I wasn’t convinced. Maybe it was the spy in me. Or maybe I just didn’t believe anything anymore.\\n\\n Chapter Twenty-four\\n\\n That night, even as I slept, I saw the city streets. They were emptier than I remembered, though. Too dark. Too cold. Something pulled me forward, down a path I didn’t know. And beneath it all, there was a word that kept washing over me, breaking against me like a wave.\\n\\n Cammie.\\n\\n Cammie.\\n\\n Cammie.\\n\\n It was Zach’s voice calling to me through the haze.\\n\\n Cammie.\\n\\n I heard it drawing closer, and so I fled, past closed doors and heavy gates. The fog grew thicker, and I ran.\\n\\n “Cammie, wait!” Zach yelled, but I couldn’t trust the words. Didn’t trust my own mind. There were sirens and horns and the feel of the wind.\\n\\n “Cammie, stop!” he yelled.\\n\\n Another horn. The rush of air.\\n\\n “Cammie!”\\n\\n And then arms grabbed me, pulled me from my feet. I wanted to hit and claw and keep running, but my feet no longer struck the pavement. I tried to toss and turn—to break free—but the covers must have been tangled around me. There was no escape.\\n\\n “No,” I said to myself, panting. “No. No. No.”\\n\\n “Cammie!” Zach’s voice was stronger. I began to shake. “Gallagher Girl, wake up!”\\n\\n “No, no,” I said, certain I could stop the dream. Change it. I was so sure there were answers at the end of that dark walk, and I had to stay there—stay sleeping to find them.\\n\\n “Cammie!”\\n\\n My back slammed into a wall, and only then did I bolt awake.\\n\\n A car horn screamed out. The wind I felt was the rushing air of the passing traffic as Zach held me on a narrow sidewalk.\\n\\n “Cammie, are you okay?” he asked, searching my eyes. “Cammie, wake up,” he shouted, shaking me again. “Tell me you’re okay. Tell me—”\\n\\n “Where am I?” I asked, but then the last day came rushing back to me. I knew where I was, and most of all, who I was supposed to be with. “Zach?”\\n\\n “Cammie, are you hurt?”\\n\\n “Why are you here, Zach? Why aren’t you at school? Why are you…” I remembered Abby’s hushed conversation behind closed doors, the look that had passed between Macey and Bex when I’d asked why my mom couldn’t just ask Zach where he’d gone last summer.\\n\\n “You ran away.” I wasn’t sure if I was talking about now or about last summer. It didn’t really matter.\\n\\n “I was worried about you.” He glanced up and down at the dark street. “Looks like I was right to.”\\n\\n “So you just…left?”\\n\\n Zach huffed. “All the cool kids are doing it.”\\n\\n When he reached for me, I pulled away, started to go back the way I’d come. Then I realized I had no idea which way that was. I was wearing Macey’s shoes and Bex’s jeans and a T-shirt with a tear on the sleeve. My hair was blowing all around my face. Sleep clung to the corners of my eyes, and I had no idea how far I’d wandered through the night.\\n\\n “Cammie, what are you doing—”\\n\\n “I don’t know, okay?” My voice echoed down the street, and I hated those words almost as much as I hated the Circle.\\n\\n “Come on.” Zach gripped my hand. “We’ve got to get you back to Abby before she—”\\n\\n “Were you here with me, Zach?” I couldn’t look at him when I said it. “Last summer…”\\n\\n “What are you talking about, Gallagher Girl?”\\n\\n “I know you left the Baxters’. I know you ran away. And…I know I was in Rome. And I wasn’t alone.”\\n\\n “Someone else was with you?” The first look that filled his face was shock, as if he’d heard me wrong. And then the expression shifted into a simmering rage. “Someone was with you?”\\n\\n “Tell me, Zach.” I don’t know if it was the wind or the adrenaline, but I shivered. “And don’t lie to me.”\\n\\n “I’m not lying!” he snapped, then took a deep breath. “Last summer, I did go looking for you. And when I couldn’t find you, I went looking for my mom. And that’s not exactly something I’m proud of.”\\n\\n When I shivered again, Zach took off his coat and tried to slip it around my shoulders, but I pushed his arm away.\\n\\n “Don’t,” I said.\\n\\n “Listen to me.” He grabbed my arms, holding me there. “I couldn’t find you. And I will never forgive myself for that. Ever.”\\n\\n Another car passed, and a new fear filled Zach’s eyes. The sun was coming up. Light crept over the horizon, and I didn’t want to think about the people who might be trying to find me—both the good guys and the bad. Zach must have thought it too, because he grabbed my hand.\\n\\n “We’re getting you out of here.” He started to pull, but when we passed the opening of a narrow alley, I had to stop.\\n\\n “This way,” I said, pointing down the dark path.\\n\\n “No, Cam, you’re turned around. I followed you for six blocks, and I was the one who was conscious. Trust me, the safe house is—”\\n\\n “I have to go this way,” I said and pulled harder, breaking free.\\n\\n I don’t know how to describe it. I wasn’t in a trance, and I wasn’t afraid, but my feet were finding their own path as if pulled by some invisible string.\\n\\n “Two. One. Nine,” I said, the words drifting through my mind.\\n\\n “I don’t like this position, Gallagher Girl,” Zach said with a glance around the narrow space.\\n\\n “Four. Seven. Six,” I went on.\\n\\n “Come on. We’ve got to get you back to the safe house.”\\n\\n “Two.” The word was barely more than a breath.\\n\\n Zach reached for me, but my hand was already moving, reaching out for the wall on my left, fingers grazing over the mortar until I found a small steel door painted the same color as the stone. I pressed, and the tiny door popped open, revealing a key pad that was hidden inside.\\n\\n I eased forward, needing to touch the pad, tap out a code I hadn’t realized I knew.\\n\\n “Two-one-nine-four-seven-six-two,” I said again, and two feet away, a solid metal door opened like an entrance into another world.\\n\\n I had to go inside. The door was like a magnet, pulling me close. But before I could cross the threshold, the whole world went upside down. Literally.\\n\\n I was dangling over Zach’s shoulder, and he was bolting down the alley, cursing under his breath and warning me he wasn’t in the mood to fight.\\n\\n “But Zach, I—”\\n\\n “I don’t care,” he snapped.\\n\\n He didn’t slow down when I yelled, “Zach, let me go!”\\n\\n In fact, he didn’t stop at all until a tall figure appeared in the alley in front of us, and a voice said, “Cammie? Is that you?”\\n\\n Chapter Twenty-five\\n\\n The last time I’d seen Preston Winters had been the night his father lost the race for president—the night the Circle had come for me the second time. Or so I thought. As I slid from Zach’s shoulder and found my footing, something told me I might have been wrong about that.\\n\\n When Preston sighed and said, “I guess you did come back,” I was certain.\\n\\n Standing there in jogging pants and a T-shirt, with earbuds dangling around his neck, Preston looked taller and…well…hotter than I remembered. Despite the chilly air, sweat beaded on his neck. There was a subtle confidence about him, and something in the way he looked at me was enough to tell me that I was finally face-to-face with the boy who’d been by my side last summer.\\n\\n “Thank goodness you’re okay.” Preston opened his arms and stepped toward me, but Zach lunged between us.\\n\\n “That’s close enough,” he said, and Preston laughed.\\n\\n Yes, actual laughage.\\n\\n Zach, however, didn’t seem to think any of it was funny.\\n\\n “Sorry,” Preston said after a moment. “You must be Zach.” He held out his hand. “I keep forgetting we haven’t been formally introduced. I’m Preston.”\\n\\n But Zach just looked at the hand as if he couldn’t decide whether to shake it or break it, so Preston pulled it slowly back to his side.\\n\\n “Cam told me all about you. But it looks like she hasn’t told you about me.” Preston gave an exaggerated sigh. “I guess the summer didn’t mean anything to you, Cammie. And here I thought I’d made an impression.”\\n\\n There’s something about Preston Winters. He has a sort of self-deprecating manner that all really hot nerds are either born with or acquire over time. He laughed, and I waited for it to trigger some feeling inside of me; but the only memory that came had red-white-and-blue bunting and took place totally within the USA.\\n\\n “So”—he reached for the door I’d just opened and started to walk inside—“I guess you remembered the code?”\\n\\n I wanted to say something, to beg and plead for answers, but all I managed to do was shake my head and admit, “No. I really didn’t.”\\n\\n He turned slowly toward me. Confusion filled his eyes. He didn’t look at me like I was crazy. He looked like he was scared.\\n\\n Of course, it also could have had something to do with the armed man who was barreling down the alley, screaming, “Freeze!” \\n\\n","sourceLink":"https://allnovel.net/out-of-sight-out-of-time-gallagher-girls-5/page-20.html","bookId":2402,"book":{"id":2402,"title":"Out of Sight, Out of Time (Gallagher Girls #5)","description":"Storyline: Out of Sight, Out of Time (Gallagher Girls #5) \\n The last thing Cammie Morgan remembers is leaving the Gallagher Academy to protect her friends and family from the Circle of Cavan-an ancient terrorist organization that has been hunting her for over a year. But when Cammie wakes up in an alpine convent and discovers that months have passed, she must face the fact that her memory is now a black hole. The only traces left of Cammie\u0027s summer vacation are the bruises on her body and the dirt under her nails, and all she wants is to go home. \\n Once she returns to school, however, Cammie realizes that even the Gallagher Academy now holds more questions than answers. Cammie, her friends, and mysterious spy-guy Zach must face their most difficult challenge yet as they travel to the other side of the world, hoping to piece together the clues that Cammie left behind. It\u0027s a race against time. The Circle is hot on their trail and willing stop at nothing to prevent Cammie from remembering what she did last summer.\\n","cover":"https://allnovel.net/images/out-of-sight-out-of-time-gallagher-girls-5.jpg","author":"Ally Carter","type":"Mystery","source":"allnovel","link":"https://allnovel.net/out-of-sight-out-of-time-gallagher-girls-5.html","creation":"Oct 5, 2019 8:58:41 AM","modification":"Oct 5, 2019 10:30:07 AM"}}
