{"id":78593,"no":17,"title":"Page 17","content":"The Orchard, as it turns out, is not part of the Stadium\u0027s farming system. It\u0027s their one and only pub, or at least the closest thing they have to a pub in this new bastion of prohibition. Reaching its entrance requires an arduous vertical journey through the Stadium\u0027s Escheresque cityscape. First, we climb four flights of stairs in a ramshackle housing tower while the residents glare at us through their cracked apartment doors. This is followed by a vertiginous crossing to a neighbouring building - boys on the ground try to look up Nora\u0027s skirt as we wobble over a wire-mesh catwalk strung between the towers\u0027 support cables. Once inside the other building, we plod up three more flights of stairs before finally emerging onto a breezy patio high above the streets. The noise of crowds rumbles through the door at the other end: a wide slab of oak painted with a yellow tree. The place is packed, but the mood is eerily subdued. No shouting, no high-fiving, no woozy requests for phone numbers. Despite the speakeasy secrecy of its obscure location, the Orchard doesn\u0027t serve alcohol. \u0027I ask you,\u0027 Julie says as we push our way through the well-behaved crowds, \u0027is there anything sillier than a bunch of ex-Marines and construction workers drowning their sorrows at a fucking juice bar? At least it\u0027s flask-friendly.\u0027 The Orchard is the first building I\u0027ve seen in this city with some trace of character. All the usual drinking accoutrements are here: dart boards, pool tables, flatscreen TVs with football games. At first I\u0027m amazed to see these broadcasts - does entertainment still exist? Are there still people out there engaging in frivolity despite the times? But then, ten minutes into the third quarter, the images warp like VHS tape and switch to a different game, the teams and scores changing in the middle of a tackle. Five minutes later they switch again, with just a quick stutter to mark the splice. None of the sports fans seem to notice. They watch these abbreviated, eternally looping contests with blank eyes and sip their drinks like players in an historical reenactment. A few of the patrons notice me staring at them and I look away. But then I look back. Something about this scene is burrowing into my mind. A thought is developing like a ghost on a Polaroid. \u0027Three grapefruits,\u0027 Julie tells the bartender, who looks vaguely embarrassed as he prepares the drinks. We settle in on bar stools and the two girls start talking. The music of their voices replaces the jangling classic rock on the jukebox, but then even this fades to a muffled drone. I\u0027m staring at the TVs. I\u0027m staring at the people. I can see the outline of their bones under their muscles. The edges of joints poking up under tight skin. I see their skeletons, and the idea taking shape in my head is something I hadn\u0027t expected: a blueprint of the Boneys. A glimpse into the their twisted, dried-up minds. The universe is compressing. All memory and all possibility squeezing down to the smallest of points as the last of their flesh falls away. To exist in that singularity, trapped in one static state for eternity - this is the Boneys\u0027 world. They are dead-eyed ID photos, frozen at the precise moment they gave up their humanity. That hopeless instant when they snipped the last thread and dropped into the abyss. Now there\u0027s nothing left. No thought, no feeling, no past, no future. Nothing exists but the desperate need to keep things as they are, as they always have been. They must stay on the rails of their loop or be overwhelmed, set ablaze and consumed by the colours, the sounds, the wide-open sky. And so the thought hums in my head, whispering through my nerves like voices through phone lines: what if we could derail them? We\u0027ve already disrupted their structure enough to incite a blind rage. What if we could create a change so deep, so new and astonishing, they would simply break? Surrender? Crumble into dust and ride out of town on the wind? \u0027R,\u0027 Julie says, poking me in the arm. \u0027Where are you? Daydreaming again?\u0027 I smile and shrug. Once again my vocabulary fails me. I\u0027m going to need to find a way to let her into my head soon. Whatever this thing is I\u0027m trying to do, I know it can\u0027t be done alone. The bartender returns with our drinks. Julie grins at me and Nora as we appraise the three tumblers of pale yellow nectar. \u0027Remember how when we were kids, pure grapefruit juice was the tough-guy drink? Like the whiskey of kiddie beverages?\u0027 \u0027Right,\u0027 Nora laughs. \u0027Apple juice, Capri Sun, that stuff was for bitches.\u0027 Julie raises her glass. \u0027To our new friend Archie.\u0027 I lift my glass an inch off the bar and the girls clang theirs down against it. We drink. I don\u0027t exactly taste it, but the juice stings my mouth, finding its way into old cuts in my cheeks, bites I don\u0027t remember biting. Julie orders another round, and when it arrives she hefts her messenger bag onto her shoulder and picks up all three glasses. She leans in close and gives me and Nora a wink. \u0027Be right back.\u0027 With the drinks in hand, she disappears into the bathroom. \u0027What\u0027s . . . she doing?\u0027 I ask Nora. \u0027Dunno. Stealing our drinks?\u0027 We sit there in awkward silence, third-party friends lacking the connective tissue of Julie\u0027s presence. After a few minutes, Nora leans in and lowers her voice. \u0027You know why she said you were my boyfriend, right?\u0027 I shrug one shoulder. \u0027Sure.\u0027 \u0027It didn\u0027t mean anything, she was just trying to deflect attention away from you. If she said you were her boyfriend, or her friend, or anything to do with her, Grigio would\u0027ve grilled the fuck out of you. And obviously if he really looks at you . . . the make-up\u0027s not perfect.\u0027 \u0027I under . . . stand.\u0027 \u0027And by the way, just so you know? That was a pretty big deal that she took you to see her mom today.\u0027 I raise my eyebrows. \u0027She doesn\u0027t tell people that stuff, ever. She didn\u0027t even tell Perry the whole story for like three years. I can\u0027t say exactly what that means for her, but . . . it\u0027s new.\u0027 I study the bar top, embarrassed. A strangely fond smile spreads across Nora\u0027s face. \u0027You know you remind me a little of Perry?\u0027 I tense. I begin to feel the hot remorse boiling up in my throat again. \u0027I don\u0027t know what it is, I mean, you\u0027re sure not the blowhard he was, but you have some of that same . . . sparkle he had when he was younger.\u0027 I should stitch my mouth shut. Honesty is a compulsion that\u0027s damned me more than once. But I just can\u0027t hold it in any more. The words build and explode out of me like an uncontainable sneeze. \u0027I killed him. Ate . . . his brain.\u0027 Nora purses her lips and nods slowly. \u0027Yeah . . . I thought you might have.\u0027 My face goes blank. \u0027What?\u0027 \u0027I didn\u0027t see it happen but I\u0027ve been putting two and two together. It makes sense.\u0027 I look at her, stunned. \u0027Julie . . . knows?\u0027 \u0027I don\u0027t think so. But if she did, I\u0027m pretty sure she\u0027d be okay.\u0027 She touches my hand where it rests on the bar. \u0027You could tell her, R. I think she\u0027d forgive you.\u0027 \u0027Why?\u0027 \u0027Same reason I forgive you.\u0027 \u0027Why?\u0027 \u0027Because it wasn\u0027t you. It was the plague.\u0027 I wait for more. She watches the TV above the bar, pale green light flickering over her dark face. \u0027Did Julie ever tell you about when Perry cheated on her with that orphan girl?\u0027 I hesitate, then nod. \u0027Yeah, well . . . that was me.\u0027 My eyes dart towards the bathroom, but Nora doesn\u0027t seem to be hiding anything. \u0027I\u0027d only been here a week,\u0027 she says. \u0027Didn\u0027t know Julie yet. That\u0027s how I met her, actually. I fucked her boyfriend, and she hated me, and then time passed and a lot happened, and somehow we came out the other side as friends. Crazy, right?\u0027 She upends her glass over her tongue to catch the last drops, then pushes it aside. \u0027What I\u0027m trying to say is, it\u0027s a shitty world and shit happens, but we don\u0027t have to bathe in shit. Sixteen years old, R - my meth-head parents dumped me in the middle of a Dead-infested slum because they couldn\u0027t feed me any more. I wandered on my own for years before I found Citi Stadium, and I don\u0027t have enough fingers to count all the times I almost died.\u0027 She holds up her left hand and wiggles the half-gone finger like a bride-to-be showing off her diamond. \u0027What I\u0027m saying is, when you have weight like that in your life, you have to start looking for the bigger picture or you are gonna sink.\u0027 I peer into her eyes, failing to read her meaning like the illiterate I am. \u0027What\u0027s . . . the bigger picture . . . of me killing Perry?\u0027 \u0027R, come on,\u0027 she says, mock-slapping the side of my head. \u0027You\u0027re a zombie. You have the plague. Or at least you did when you killed Perry. Maybe you\u0027re different now, I sure hope you are, but back then you didn\u0027t know you had choices. This isn\u0027t \"crime\", it\u0027s not \"murder\", it\u0027s something way deeper and more inevitable.\u0027 She taps her temple. \u0027Me and Julie get that, okay? There\u0027s a Zen saying, \"No praise, no blame, just so.\" We don\u0027t care about assigning blame for the human condition, we just want to cure it.\u0027 Julie emerges from the bathroom and sets the drinks on the bar with a sly grin. \u0027Even grapefruit juice can use a little kick sometimes.\u0027 Nora takes a test sip and turns away, covering her mouth. \u0027Holy . . . Lord!\u0027 she coughs. \u0027How much did you put in here?\u0027 \u0027Just a few minis of vodka,\u0027 Julie whispers with girlish innocence. \u0027Courtesy of our friend Archie, and Undead Airlines.\u0027 \u0027Way to go, Archie.\u0027 I shake my head. \u0027Can please . . . stop calling me . . . ?\u0027 \u0027Right, right,\u0027 Julie says. \u0027No more Archie. But what do we toast to this time? It\u0027s your booze, R, you decide.\u0027 I hold the glass in front of me. I sniff it, insisting to myself that I can still smell things besides death and potential death, that I\u0027m still human, still whole. A citrus tang pricks my nostrils. Glowing Florida orchards in summer. The toast that enters my head seems unbearably corny, but it comes out anyway. \u0027To . . . life.\u0027 Nora stifles a laugh. \u0027Really?\u0027 Julie shrugs. \u0027Unbearably corny, but what the hell.\u0027 She raises her glass and clinks it against mine. \u0027To life, Mr Zombie.\u0027 \u0027L\u0027chaim!\u0027 Nora bellows, and drains her glass. Julie drains her glass. I drain my glass. The vodka slams into my brain like a round of buckshot. This time it\u0027s no placebo. The drink is strong and I feel it. I am feeling it. How is that possible? Julie orders another round of grapefruits, then promptly converts them into Greyhounds, and she is generous with the pours. I expect the girls to be as lightweight as I am, since alcohol is contraband here, but I realise it\u0027s probably quite routine to visit the liquor store while out salvaging the city. They quickly outpace me as I sip my second drink, marvelling at the sensations that swirl through my body. The noise of the bar fades and I just watch Julie, the focal point in my blurry composition. She is laughing. A free, unreserved kind of laugh that I don\u0027t think I\u0027ve heard before, throwing her head back and letting it just cascade out of her. She and Nora are recounting some shared memory. She turns to me and says something, inviting me into the joke with a word and a flash of white teeth, but I don\u0027t respond. I just look at her, resting my chin in my hand, my elbow on the bar, smiling. Contentment. Is this what it might feel like? After finishing my drink I feel a pressure in my lower regions, and I realise I have to piss. Since the Dead don\u0027t drink, urination is a rare event. I hope I can remember how to do it. I wobble into the bathroom and lean my forehead against the wall in front of the urinal. I unzip, and I look down, and there it is. That mythical instrument of life and death and first-date back-seat fucking. It hangs limp, useless now, silently judging me for all the ways I\u0027ve misused it over the years. I think of my wife and her new lover, slapping their cold bodies together like poultry in a packing plant. I think of the anonymous blurs in my past life, probably all dead or Dead by now. Then I think of Julie curled next to me in that king-sized bed. I think of her body in that comically mismatched underwear, her breath against my eyes as I study every line in her face, wondering what mysteries lie in the glowing nuclei of her each and every cell. There in the bathroom, surrounded by the stench of piss and shit, I wonder: Is it too late for me? Can I somehow snatch another chance from the skymouth\u0027s grinding teeth? I want a new past, new memories, a new first-handshake with love. I want to start over, in every possible way. When I come out of the bathroom the floor is spinning. Voices are muffled. Julie and Nora are deep in conversation, leaning close and laughing. A man in his early thirties approaches the bar and makes some kind of leering comment to Julie. Nora glares at him and says something that looks sarcastic, and Julie shoos him away. The man shrugs and retreats to the pool table where his friend is waiting. Julie calls out something insulting and the friend laughs, but the man just grins coldly and calls back a retort. Julie looks frozen for a moment, then she and Nora turn their backs to the pool table and Nora starts whispering in Julie\u0027s ear. \u0027What\u0027s . . . wrong?\u0027 I ask, approaching the bar. I can sense both men at the pool table watching me. \u0027Nothing,\u0027 Julie says, but she sounds shaken. \u0027It\u0027s fine.\u0027 \u0027R, could you give us a quick minute?\u0027 Nora asks. I look back and forth between them. They wait. I turn and walk out of the bar, feeling too many things at once. On the patio I slump against the railing, the streets a dizzying seven floors down. Most of the city\u0027s lights are out, but the street lamps flicker and pulse like bioluminescence. Julie\u0027s mini-cassette recorder is an insistent weight in my shirt pocket. I pull it out and stare at it. I know I shouldn\u0027t but I\u0027m . . . I feel like I just need - Closing my eyes, swaying gently with one arm on the railing, I rewind the tape for a moment and press play. \u0027 - really that crazy? Just because he\u0027s . . . whatever he is? I mean, isn\u0027t \"zombie\" just a silly name we - \u0027 I press rewind again and it occurs to me that the gap between the beginning of this entry and the end of the previous one comprises the entire time I\u0027ve known Julie. Every meaningful moment of my life fits inside a few seconds of tape hiss. I press stop, then play. \u0027 - thinks no one knows but everyone knows, they\u0027re just afraid to do anything. He\u0027s getting worse, too. He said he loved me tonight. Actually said those words. Said I was beautiful and I was everything he loved about Mom and if anything ever happened to me he\u0027d lose his mind. And I know he meant it, I know all of that\u0027s really there inside him . . . but the fact that he had to be raging shitfaced drunk to let any of it out . . . it just made the whole thing seem sick. I fucking hated it.\u0027 There is a long pause on the tape. I glance over my shoulder at the bar door, feeling ashamed but desperate. I know these are confidences I should have to earn through months of slow intimacy, but I can\u0027t help myself. I just want to listen to her. \u0027I\u0027ve thought about making a report,\u0027 she continues. \u0027March into the community centre and make Rosy go arrest him. I mean, I\u0027m all for drinking, I love it, but with Dad it\u0027s . . . different. It\u0027s not a celebration for him, it seems like it\u0027s painful and scary, like he\u0027s numbing himself for some horrible medieval surgery. And yeah . . . I know why, and it\u0027s not like I haven\u0027t done worse stuff for the same reasons, but it\u0027s just . . . it\u0027s so . . .\u0027 Her voice wavers and breaks off, and she sniffles hard like a self-rebuke. \u0027God,\u0027 she whispers. \u0027Shit.\u0027 Several seconds of tape hiss. I listen closer. Then the door flies open and I whirl around, tossing the recorder out into the dark. But it\u0027s not Julie. It\u0027s the two men from the pool table. They stumble out the door, jostling each other and laughing through the sides of their mouths as they light up cigarettes. \u0027Hey,\u0027 the one who was talking to Julie calls to me, and he and his friend start ambling in my direction. He\u0027s tall, good-looking, his muscular arms sleeved in tattoos: snakes and skeletons and the logos of extinct rock bands. \u0027What\u0027s up, man? You Nora\u0027s new guy?\u0027 I hesitate, then shrug. They both laugh like I\u0027ve made a dirty joke. \u0027Yeah, who ever knows with that chick, right?\u0027 He punches his friend in the chest while continuing to saunter towards me. \u0027So you know Julie, man? You Julie\u0027s friend?\u0027 I nod. \u0027Known her long?\u0027 I shrug, but I feel a coil inside me tensing. He stops a few feet away from me and leans against the wall, taking a slow drag on his cigarette. \u0027That one used to be pretty wild, too, a few years back. I was her firearms teacher.\u0027 I need to leave. I need to turn around right now and leave. \u0027She got all pure after she started dating that Kelvin kid, but man, for a year or so she was ripe fruit.\u0027 His exhalations form a haze of smoke that stings my dry eyes. \u0027A hundred bucks won\u0027t even buy a pack of cigarettes any more, but it sure went a long way with that bitch.\u0027 I lunge forward and crack his head into the wall. It\u0027s easy, I just palm his face and thrust forward, punching the wall with the back of his skull. I don\u0027t know if I\u0027ve killed him and I don\u0027t care. When his friend tries to grab me I do the exact same to him, two big dents in the Orchard\u0027s aluminium siding. Both men slump to the ground. I wobble my way down the stairs and out onto the catwalk. Some kids leaning on the support cables smoking joints stare at me as I shove past them. Excuse me, I try to say, but I can\u0027t seem to find the syllables. I slide down the four apartment floors and lurch out onto Fairy Street or Tinkerbell Street or whatever the fuck it\u0027s called. I just need to get away from all these people for a minute, collect my thoughts. I\u0027m so hungry. God, I\u0027m starving. After a few minutes of wandering, I\u0027m completely lost and disorientated. A light rain is falling and I\u0027m alone on some dark narrow street. The asphalt glitters black and wet under the crooked street lamps. Up ahead, two guards converse in a rain-flecked cone of light, grunting to each other with the affected toughness of scared boys straining to be men. \u0027. . . out in Corridor 2 all last week, pouring foundations. We\u0027re less than a mile away from Goldman Dome but we\u0027ve barely got a fuckin\u0027 crew any more. Grigio keeps pulling guys off Construction and dumping \u0027em into Security.\u0027 \u0027What about the Goldman crew? How\u0027s their end coming?\u0027 \u0027Goldman is shit. They\u0027re barely out their front door. I\u0027ve been hearing the merger\u0027s in bad shape anyway, thanks to Grigio\u0027s bad diplomacy. Starting to wonder if he even wants the mergers any more, the way he handled Corridor 1. Wouldn\u0027t surprise me if he arranged the collapse himself.\u0027 \u0027You know that\u0027s bullshit. Don\u0027t be spreading that story around.\u0027 \u0027Yeah, well, either way, Construction\u0027s gone to shit since Kelvin got squished. We\u0027re just digging holes and filling \u0027em in.\u0027 \u0027I\u0027d still rather be out building something than playing rent-a-cop in here all night. You get any action out there?\u0027 \u0027Just a couple of Fleshies wandering out of the woods. Pop, pop, game over.\u0027 \u0027No Boneys?\u0027 \u0027Haven\u0027t seen one of them in at least a year. They stick to their hives now\u0027days. Fuckin\u0027 bullshit.\u0027 \u0027What, you like running into those things?\u0027 \u0027Hell of a lot more fun than Fleshies. Fuckers can move.\u0027 \u0027Fun? Are you shitting me? Those things are wrong; I don\u0027t even like touching \u0027em with my bullets.\u0027 \u0027Is that why your hit rate\u0027s one in twenty?\u0027 \u0027Doesn\u0027t even seem like they\u0027re human remains any more, you know? They\u0027re like aliens or something. Creeps the shit out of me.\u0027 \u0027Yeah, well, that\u0027s probably \u0027cause you\u0027re a pussy.\u0027 \u0027Fuck you. I\u0027m going to take a leak.\u0027 The guard disappears into the dark. His partner stands in the spotlight, pulling his parka tighter as the rain comes down. I\u0027m still walking. I\u0027m not interested in these men; I\u0027m looking for a quiet corner where I can close my eyes and gather myself. But as I approach the light, the guard notices me, and I realise there\u0027s a problem. I\u0027m drunk. My carefully studied gait has been replaced by an unsteady stagger. I lumber forward, my head lolling from side to side. I look like . . . exactly what I am. \u0027Halt!\u0027 the guard shouts. I halt. He moves towards me a little. \u0027Step into the light please, sir.\u0027 I step into the light, standing on the very edge of the yellow circle. I try to stand as straight as I can, as motionless as I can. Then I realise something else. The rain is dripping off my hair. The rain is running down my face. The rain is washing away my make-up, revealing the pale grey flesh underneath. I stumble back a step, slightly out of the lamplight. The guard is about five feet away from me. His hand is on his gun. He moves closer and peers at me through slitted eyes. \u0027Have you been drinking alcohol tonight, sir?\u0027 I open my mouth to say, No, sir, absolutely not, just a few glasses of delicious and heart-healthy grapefruit juice with my good friend Julie Cabernet. But the words evade me. My tongue is thick and dead in my mouth, and all that comes out is, \u0027Uhhhnnn . . .\u0027 \u0027What the fuck - \u0027 The guard\u0027s eyes flash wide, he whips out his flashlight and shines it into my grey-streaked face, and I have no choice. I leap out of the shadows and pounce on him, knocking his gun aside and biting down on his throat. His life force rushes into my starved body and brain, soothing the agony of my hideous cravings. I start to tear into him, chewing deltoids and tender abdominals while the blood still pulses through them - but then I stop. Julie stands in the bedroom doorway, watching me with a tentative smile. I shut my eyes and grit my teeth. No. I drop the body to the ground and back away from it. I can no longer hide behind my ignorance. I know now that I have a choice, and I choose to change no matter what the cost. If I\u0027m a thriving branch on the Tree of Death, I\u0027ll drop my leaves. If I have to starve myself to kill its twisted roots, I will. The foetus in my stomach kicks, and I hear Perry\u0027s voice, gentle and reassuring. You won\u0027t starve, R. In my short life I made so many choices just because I thought they were required, but my dad was right: there\u0027s no rulebook for the world. It\u0027s in our heads, our collective human hive-mind. If there are rules, we\u0027re the ones making them. We can change them whenever we want to. I spit out the meat in my mouth and wipe the blood off my face. Perry kicks me in the gut again and I vomit. I lean over and purge myself of everything. The meat, the blood, the vodka. As soon as I straighten up and wipe my mouth, I\u0027m sober. The fuzz is gone. My head is clear as a glossy new record. The guard\u0027s body begins to twitch back to life. His shoulders slowly rise, dragging the rest of his limp parts with them, as if he\u0027s being pinched and pulled upwards by unseen fingers. I need to kill him. I know I need to kill him, but I can\u0027t do it. After the vow I\u0027ve just made, the thought of tearing into this man again and tasting his still-warm blood leaves me paralysed with horror. He shudders and retches, choking and clawing the dirt, straining and dry-heaving, his eyes bulging wide as the grey sludge of new death slithers into them. A wet, wretched groan escapes his mouth, and it\u0027s too much for me. I turn and run. Even in my bravest moment, I am a coward. The rain is in full force. My feet splash in the streets and spatter mud on my freshly washed clothes. My hair hangs in my face like seaweed. In front of a big aluminium building with a plywood cross on the roof, I kneel in a puddle and splash water on my face. I wash my mouth out with dirty gutter run-off and spit until I can\u0027t taste anything. That holy wooden \u0027T\u0027 looms overhead, and I wonder if the Lord might ever find cause to approve of me, wherever and whatever he is. Have you met him yet, Perry? Is he alive and well? Tell me he\u0027s not just the mouth of the sky. Tell me there\u0027s more looking down on us than that empty blue skull. Wisely, Perry doesn\u0027t answer. I accept the silence, I get off my knees, and I keep running. Avoiding street lights, I make my way back to Julie\u0027s house. I curl up against the wall, finding some shelter from the balcony overhead, and I wait there while the rain pounds the house\u0027s metal roof. After what seems like hours, I hear the girls\u0027 voices in the distance, but this time their rhythms stir no joy in me. The dance is a dirge, the music is minor. They run towards the front door, Nora with her denim jacket pulled over her head, Julie with the hood of her red sweatshirt cinched tight on her face. Nora reaches the door first and rushes inside. Julie stops. I don\u0027t know if she sees me in the dark or just smells the fruity stench of my body spray, but something draws her to look around the corner of the house. She sees me huddled in the dark like a scared puppy. She ambles over slowly, her hands stuffed into her sweatshirt pockets. She crouches down and peeks out at me through the narrow opening of her hood. \u0027You okay?\u0027 she says. I nod dishonestly. She sits next to me on the small patch of dry ground and leans against the house. She takes off her hood and lifts the wool beanie underneath to brush wet hair out of her eyes, then pulls it back down. \u0027You scared me. You just disappeared.\u0027 I look at her miserably, but I don\u0027t say anything. \u0027Do you want to tell me what happened?\u0027 I shake my head. \u0027Did you, um . . . did you knock out Tim and his friend?\u0027 I nod. A smile of embarrassed pleasure creeps onto her face, as if I\u0027ve just given her an over-large bouquet of roses or written her a bad love song. \u0027That was . . . sweet,\u0027 she says, holding back a giggle. A minute passes. She touches my knee. \u0027We had fun today, didn\u0027t we? Despite a few sticky moments?\u0027 I can\u0027t smile, but I nod. \u0027I\u0027m a little buzzed. You?\u0027 I shake my head. \u0027Too bad. It\u0027s fun.\u0027 Her smile deepens and her eyes become far away. \u0027You know, I had my first drink when I was eight?\u0027 There is just a faint slur in her voice. \u0027My dad was a big wine buff and him and Mom used to throw tasting parties whenever Dad was between wars. They\u0027d bring all their friends over and pop a prized vintage and get pretty well toasted. I\u0027d sit there in the middle of the couch taking little sips off the half-glass I was allowed and just laugh at all the silly grownups getting sillier. Rosy would get so flushed! One glass and he looked like Santa Claus. He and Dad arm-wrestled on the coffee table once and broke a lamp. It was . . . so great.\u0027 She starts doodling in the dirt with one finger. Her smile is wistful, aimed at no one. \u0027Things weren\u0027t always so grim, you know, R? Dad has his moments, and even when the world fell apart we still had some fun. We\u0027d take little family salvage trips and pick up the most crazy wines you can imagine. Thousand-dollar bottles of \u002797 Dom. Romane Conti just rolling around on the floors of abandoned cellars.\u0027 She chuckles to herself. \u0027Dad would have absolutely lost his shit over those back in the day. By the time we moved here he was kinda . . . muted. But God, we drank some outrageous stuff.\u0027 I\u0027m watching her talk. Watching her jaw move and collecting her words one by one as they spill from her lips. I don\u0027t deserve them. Her warm memories. I\u0027d like to paint them over the bare plaster walls of my soul, but everything I paint seems to peel. \u0027And then Mom ran off.\u0027 She pulls her finger out of the dirt, inspecting her work. She has drawn a house. A quaint little cottage with a smoke cloud in the chimney, a benevolent sun smiling down on the roof. \u0027Dad thought she must have been drunk, hence the alcohol ban, but I saw her, and she wasn\u0027t. She was very sober.\u0027 She is still smiling, as if this is all just easy nostalgia, but the smile is cold now, lifeless. \u0027She came into my room that night and just looked at me for a while. I pretended I was asleep. Then right as I was about to pop up and yell \"boo\" . . . she walked out. So I didn\u0027t get the chance.\u0027 She reaches a hand down to wipe away her drawing, but I touch her wrist. I look at her and shake my head. She regards me silently for a moment. Then she scoots around to face me and grins, inches from my face. \u0027R,\u0027 she says. \u0027If I kiss you, will I die?\u0027 Her eyes are steady. She\u0027s barely drunk. \u0027You said I won\u0027t, right? I won\u0027t get infected? Because I really feel like kissing you.\u0027 She fidgets. \u0027And even if you do pass something to me, maybe it wouldn\u0027t be all bad. I mean, you\u0027re different now, right? You\u0027re not a zombie. You\u0027re . . . something new.\u0027 Her face is very close. Her smile fades. \u0027Well, R?\u0027 I look into her eyes, splashing in their icy waters like a shipwrecked sailor grasping for the raft. But there is no raft. \u0027Julie,\u0027 I say. \u0027I need . . . to show you something.\u0027 She cocks her head with gentle curiosity. \u0027What?\u0027 I stand up. I take her hand and start walking. The night is still except for the primeval hiss of the rain. It drenches the dirt and slicks the asphalt, liquefying the shadows into shiny black ink. I stick to the narrow back-streets and unlit alleys. Julie follows slightly behind me, staring at the side of my face. \u0027Where are we going?\u0027 she asks. I pause at an intersection to retrace the maps of my stolen memories, calling up images of places I\u0027ve never been, people I\u0027ve never met. \u0027Almost . . . there.\u0027 A few more careful glances around corners, furtive dashes across intersections, and there it is. A five-storey house looms ahead of us, tall, skinny and grey like the rest of this skeletal city, its windows flickering yellow like wary eyes. \u0027What the hell, R?\u0027 Julie whispers, staring up at it. \u0027This is . . .\u0027 I pull her to the front door and we stand there in the shelter of the eaves, the roof rattling like military drums in the rain. \u0027Can I . . . borrow your hat?\u0027 I ask without looking at her. She doesn\u0027t move for a moment, then she pulls it off and hands it to me. Over-long and floppy, dark blue wool with a red stripe . . . Mrs Rosso knitted this for Julie\u0027s seventeenth birthday. Perry thought she looked like an elf in it and would start speaking to her in Tolkien tongues whenever she put it on. She called him the biggest nerd she\u0027d ever met, and he agreed, while playfully kissing her throat and - I pull the beanie low over my face and knock a slow waltz on the door, eyes glued to the ground like a shy child. The door opens a crack. A middle-aged woman in sweatpants looks out at us. Her face is puffy and heavily lined, dark bags under bloodshot eyes. \u0027Miss Grigio?\u0027 she says. Julie glances at me. \u0027Hi, Mrs Grau. Um . . .\u0027 \u0027What are you doing out? Is Nora with you? It\u0027s after curfew.\u0027 \u0027I know, we . . . got a little lost on our way back from the Orchard. Nora\u0027s staying at my house tonight but um . . . can we come in for a minute? I need to talk to the guys.\u0027 I keep my head down as Mrs Grau gives me a cursory appraisal. She opens the door for us with an annoyed sigh. \u0027You can\u0027t stay here, you know. This is a foster home, not a flop house, and your friend here is too old for new residency.\u0027 \u0027I know, sorry, we\u0027ll . . .\u0027 She glances at me again. \u0027We\u0027ll just be a minute.\u0027 I can\u0027t endure formalities right now. I brush past the woman and into the house. A toddler peeks around a bedroom door and Mrs Grau glares at him. \u0027What did I tell you?\u0027 she snaps, loud enough to wake the rest of the kids. \u0027Back in bed right now.\u0027 The boy disappears into the shadows. I lead Julie up the staircase. The second storey is identical to the first, except there are rows of pre-adolescents sleeping on the floor on small mats. So many now. New foster homes pop up like processing plants as mothers and fathers disappear, chewed up and swallowed down by the plague. We step over a few tiny bodies on our way to the stairs, and a little girl grasps feebly at Julie\u0027s ankle. \u0027I had a bad dream,\u0027 she whispers. \u0027I\u0027m sorry, honey,\u0027 Julie whispers back. \u0027You\u0027re safe now, okay?\u0027 The girl closes her eyes again. We climb the stairs. The third floor is still awake. Young teens and patch-beard semi-adults sitting around on folding chairs, hunched over desks writing in booklets and flipping through manuals. Some kids snore on stacked bunks inside narrow bedrooms. All the doors are open except one. A group of older boys look up from their work, surprised. \u0027Wow, hey, Julie. How\u0027s it going? You holding up okay?\u0027 \u0027Hey, guys. I\u0027m . . .\u0027 She trails off, and her ellipsis eventually forms a period. She looks at the closed door. She looks at me. Gripping her hand, I move forward and open the door, then shut it behind us. The room is dark except for the faint yellow glow of street lamps through the window. There is nothing in here but a plywood dresser and a stripped bed, with a few pictures of Julie taped to the ceiling above it. The air is stale, and much colder than the rest of the house. \u0027R . . .\u0027 Julie says in a quivery, dangerous voice. \u0027Why the fuck are we here?\u0027 I finally turn to face her. In the yellow dimness, we look like actors in a silent sepia tragedy. \u0027Julie,\u0027 I say. \u0027That theory . . . about why we . . . eat the brain . . .\u0027 She starts to shake her head. \u0027True.\u0027 I look into her reddening eyes a moment longer, then kneel down and open the bottom drawer of the dresser. Inside, under piles of old stamps, a microscope, an army of pewter figurines, there is a stack of paper bound together with red yarn. I lift it out and hand it to Julie. In so many strange and twisted ways, I feel like the manuscript is mine. Like I\u0027ve just handed her my own bloody heart on a platter. I am fully prepared for her to claw it to shreds. She takes the manuscript. She unties the yarn. She stares at the cover page for a full minute, breathing shakily. Then she wipes her eyes and clears her throat. \u0027\"Red Teeth,\"\u0027 she reads. \u0027\"By Perry Kelvin.\"\u0027 She glances down the page. \u0027\"For Julie Cabernet, the only light left.\"\u0027 She lowers the manuscript and looks away for a moment, trying to hide a spasm in her throat, then steels herself and turns the page to the first chapter. As she reads, a faint smile peeks through the tear tracks. \u0027Wow,\u0027 she says, wiping a finger across her nose and sniffling. \u0027It\u0027s actually . . . kinda good. He used to write such dry and detached bullshit. This is . . . cheesy . . . but in a sweet way. More like how he really was.\u0027 She glances at the cover page again. \u0027He started it less than a year ago. I had no idea he was still writing.\u0027 She flips to the last page. \u0027It\u0027s not finished. Cuts off in the middle of a sentence. \"Outmanned and outgunned, certain of death, he kept fighting, because - \"\u0027 She rubs her thumbs into the paper, feeling its texture. She puts it near her face and inhales. Then she closes her eyes, closes the manuscript, and reties the yarn. She looks up at me. I am nearly a foot taller than her and probably sixty pounds heavier, but I feel small and featherweight. Like she could knock me down and crush me with a single whispered word. But she doesn\u0027t speak. She sets the manuscript back in the drawer and gently slides it shut. She straightens up, dries her face with her sleeve, and embraces me, resting her ear against my chest. \u0027Thump-thump,\u0027 she murmurs. \u0027Thump-thump. Thump-thump.\u0027 My hands hang limp at my sides. \u0027I\u0027m sorry,\u0027 I say. With her eyes closed, her voice muffled by my shirt, she says, \u0027I forgive you.\u0027 I raise a hand and touch her straw-gold hair. \u0027Thank you.\u0027 These three phrases, so simple, so primal, have never sounded so complete. So true to their basic meanings. I feel her cheek move against my chest, her zygomaticus major pulling her lips into a faint smile. Without another word, we shut the door on Perry Kelvin\u0027s room and leave his home. We descend the stairs past beleaguered teens, past tossing and turning kids, past deeply dreaming babies, and out into the street. I feel a nudge low in my chest, closer to my heart than my belly, and a soft voice in my head. Thank you, Perry says. I would like to end it here. How nice if I could edit my own life. If I could halt in the middle of a sentence and put it all to rest in a drawer somewhere, consummate my amnesia and forget all the things that have happened, are happening, and are about to happen. Shut my eyes and go to sleep happy. But no, \u0027R\u0027. No sleep of the innocent. Not for you. Did you forget? You have blood on your hands. On your lips. On your teeth. Smile for the cameras.","sourceLink":"https://allnovel.net/warm-bodies-warm-bodies-1/page-17.html","bookId":2434,"book":{"id":2434,"title":"Warm Bodies (Warm Bodies #1)","description":"Storyline: R is having a no-life crisis - he is a zombie. He has no memories, no identity, and no pulse, but he is a little different from his fellow Dead. He may occasionally eat people, but he\u0027d rather be riding abandoned airport escalators, listening to Sinatra in the cozy 747 he calls home, or collecting souvenirs from the ruins of civilization. And then he meets a girl. First as his captive, then his reluctant house guest, Julie is a blast of living color in R\u0027s gray landscape, and something inside him begins to bloom. He doesn\u0027t want to eat this girl - although she looks delicious - he wants to protect her. But their unlikely bond will cause ripples they can\u0027t imagine, and their hopeless world won\u0027t change without a fight.","cover":"https://allnovel.net/images/warm-bodies-warm-bodies-1.jpg","author":"Isaac Marion","type":"Horror","source":"allnovel","link":"https://allnovel.net/warm-bodies-warm-bodies-1.html","creation":"Oct 5, 2019 8:58:43 AM","modification":"Oct 5, 2019 4:09:24 PM"}}
