{"id":6797,"no":14,"title":"Chapter 13 The Facts and the Verdict","content":"“You have, I believe,” said the coroner when the I preliminary questions had been answered, “made an examination of the body which is now lying in the mortuary?” “Yes, I examined that body very thoroughly. It appears to be that of a strongly-built man about five feet ten inches in height. His age was rather difficult to judge, and I cannot say more than that he was apparently between forty and fifty, but even that is not a very reliable estimate. The body had been exposed to such intense heat that the soft tissues were completely carbonized, and, in some parts, entirely burned away. Of the feet, for instance, there was nothing left but white incinerated bone.” “The jury, when viewing the body, were greatly impressed by the strange posture in which it lay. Do you attach any significance to that?” “No. The distortion of the trunk and limbs was due to the shrinkage of the soft parts under the effects of intense heat. Such distortion is not unusual in bodies which have been burned.” “Can you make any statement as to the cause of death?” “My examination disclosed nothing on which an opinion could be based. The condition of the body was such as to obliterate any signs that there might have been. I assume that deceased died from the effects of the poisonous fumes given off by the burning celluloid — that he was, in fact, suffocated. But that is not properly a medical opinion. There is, however, one point which I ought to mention. The neck was dislocated and the little bone called the odontoid process was broken.” “You mean, in effect,” said the coroner, “that the neck was broken. But surely a broken neck would seem to be a sufficient cause of death.” “It would be in ordinary circumstances; but in this case I think it is to be explained by the shrinkage. My view is that the contraction of the muscles and the soft structures generally displaced the bones and broke off the odontoid process.” “Can you say, positively, that the dislocation was produced in that way?” “No. That is my opinion, but I may be wrong. Dr. Thorndyke, who examined the body at the same time as I did, took a different view.” “We shall hear Dr. Thorndyke’s views presently. But doesn’t it seem to you a rather important point?” “No. There doesn’t seem to me to be much in it. The man was alone in the house and must, in any case, have met his death by accident. In the circumstances, it doesn’t seem to matter much what the exact, immediate cause of death may have been.” The coroner looked a little dissatisfied with this answer, but he made no comment, proceeding at once to the next point. “You have given us a general description of the man. Did you discover anything that would assist in establishing his identity?” “Nothing beyond the measurements and the fact that he had a fairly good set of natural teeth. The measurements and the general description would be useful for identification if there were any known person with whom they could be compared. They are not very specific characters, but if there is any missing person who might be the deceased, they might settle definitely whether this body could, or could not, be that of the missing person.” “Yes,” said the coroner, “but that is of more interest to the police than to us. Is there anything further that you have to tell us?” “No,” replied the witness, “I think that is all that I have to say.” Thereupon, when the depositions had been read and signed the witness retired and his place was taken by Thorndyke. “You examined this body at the same time as Dr. Robertson, I think?” the coroner suggested. “Yes, we made the examination together, and we compared the results so far as the measurements were concerned.” “You were, of course, unable to make any suggestion as to the identity of deceased?” “Yes. Identity is a matter of comparison, and there was no known person with whom to compare the body. But I secured, and made notes of, all available data for identification if they should be needed at any future time.” “It was stated by the last witness that there was a dislocation of the neck with a fracture of the odontoid process. Will you explain that to the jury and give us your views as to its significance in this case?” “The odontoid process is a small peg of bone which rises from the second vertebra, or neck-bone, and forms a pivot on which the head turns. When the neck is dislocated, the displacement usually occurs between the first and the second vertebra, and then, in most cases, the odontoid process is broken. In the case of deceased, the first and second vertebrae were separated and the odontoid process was broken. That is to say that deceased had a dislocated neck, or, as it is commonly expressed, a broken neck.” “In your opinion, was the neck broken before or after death?” “I should say that it was broken before death; that, in fact, the dislocation of the neck was the immediate cause of death.” “Do you say positively that it was so?” “No. I merely formed that opinion from con sideration of the appearances of the structures. The broken surfaces of the odontoid process had been exposed to the fire for some appreciable time, which suggested that the fracture had occurred before the shrinkage. And then it appeared to me that the force required to break the process was greater than the shrinkage would account for. Still, it is only an opinion. Dr. Robertson attributed the fracture to the shrinkage, and he is as likely to be right as I am.” “Supposing death to have been caused by the dislocation, what significance would you attach to that circumstance?” “None at all, if the facts are as stated. If the man was alone in the house when the fire broke out, the exact cause of death would be a matter of no importance.” “Can you suggest any way in which the neck might have been broken in the circumstances which are believed to have existed?” “There are many possible ways. For instance, if the man was asleep and was suddenly aroused by the fire, he might have scrambled out of bed, entangled the bedclothes, and fallen on his head. Or again, he might have escaped from the bedroom and fallen down the stairs. The body was found in the cellar. There is no evidence as to where the man was when death took place.” “At any rate, you do not consider the broken neck in any way incompatible with accidental death?” “Not in the least; and, as I said before, Dr. Robertson’s explanation may be the correct one, after all.” “Would you agree that, for the purposes of this inquiry, the question as to which of you is right is of no importance?” “According to my present knowledge and belief, I should say that it is of no importance at all.” This was the sum of Thorndyke’s evidence, and, when he had signed the depositions and returned to his seat, the name of Inspector Blandy was called; where upon that officer advanced to the table and greeted the coroner and the jury with his habitual benevolent smile. He polished off the preliminaries with the readiness born of long experience and then, having, by the coroner’s invitation, seated himself, he awaited the interrogation. “I believe, Inspector,” the coroner began, “that the police are making certain investigations regarding the death of the man who is the subject of this inquiry. Having heard the evidence of the other witnesses, can you give us any additional facts?” “Nothing very material,” Blandy replied. “The inquiries which we are making are simply precautionary. A dead man has been found in the ruins of a burnt house, and we want to know who that man was and how he came to be in that house, since he was admittedly not the tenant of the premises. As far as our inquiries have gone, they have seemed to confirm the statement of Mr. Green that the man was the one referred to by Mr. Haire as Cecil Moxdale. But our inquiries are not yet complete.” “That,” said the coroner, “is a general statement. Could you give us the actual facts on which your conclusions are based?” “The only facts bearing on the identity of deceased have been obtained by an examination of various things found among the ashes of the burned house. The search was made with the greatest care, particularly that for the smaller objects which might have a more personal character. When the larger objects had been removed, the fine ash was all passed through sieves so that nothing should be overlooked. But everything that was found has been preserved for further examination if it should be necessary.” “You must have got a rather miscellaneous collection,” the coroner remarked. “Have you examined the whole lot?” “No. We have concentrated on the small personal articles, and these seem to have yielded all the in formation that we are likely to get, and have practically settled the question of identity. We found, for instance, a pair of cuff-links of steel, chromium plated, on which the initials C.M. were engraved. We also found a clay pipe-bowl in the form of a death’s head which had once had glass eyes and still had the remains of the glass fused in the eye-sockets. This had the initials C.M. scratched deeply on the under-surface of the bowl.” “That was a very significant discovery,” the coroner remarked, “having regard to what Mr. Green told us. Yes?” “There was also a stainless-steel plate which seemed to have belonged to an attaché-case or a suit-case and which had the initials C.M. engraved on it, and a gold watch, of which the case was partly fused, but on which we could plainly make out the initials G.H.” “G.H.,” the coroner repeated. “That, then, would be Mr. Haire’s watch. Isn’t that rather odd?” “I think not, sir,” replied Blandy. “These were Mr. Haire’s rooms, and they naturally contained articles belonging to him. Probably he locked up this valuable watch before going on his travels.” “Did you find any other things belonging to him?” “Nothing at all significant. There was a vice and some tools and the remains of an eight-day clock which apparently belonged to him, and there were some other articles that might have been his, but they were mixed up with the remains of projectors and various things which had probably come from the shop or the stores above. But the small personal articles were the really important ones. I have brought those that I mentioned for your inspection.” Here he produced from his attaché-case a small glass-topped box in which the links, the steel name plate, the death’s-head pipe-bowl, and the half-fused gold watch were displayed on a bed of cotton wool, and handed it to the coroner, who, when he had inspected it, passed it to the foreman of the jury. While the latter and his colleagues were poring over the box, the coroner opened a fresh line of inquiry. “Have you tried to get into touch with Mr. Haire?” he asked. “Yes,” was the reply, “and I am still trying, unsuccessfully up to the present. The address that Mr. Haire gave to Mr. Green was that of Brady \u0026 Co, a firm of retail dealers in photographic materials and appliances. As soon as I got it from Mr. Green, I communicated with the Dublin police, giving them the principal facts and asking them to find Mr. Haire, if they could, and pass on to him the information about the fire and also to find out from him who the man was whose body had been found in the burnt house. “The information that I have received from them is to the effect that they called on Bradys about mid-day on the 19th, but Mr. Haire had already left. They learned that he had made a business call on Bradys on the morning of the 16th, having arrived in Dublin the previous night. He called again on the 18th, and then said that he was going on to Cork, and possibly from there to Belfast. In the interval, it seemed that he had made several calls on firms engaged in the photographic trade, but Bradys had the impression that he had left Dublin on the evening of the 18th. “That is all that I have been able to discover so far, but there should be no great difficulty in tracing Mr. Haire; and even if it should not be possible, he will probably be returning from Ireland quite soon, and then he will be able to give us all the particulars that we want about this man, Cecil Moxdale — if that is his name.” “Yes,” said the coroner, “but it will be too late for this inquiry. However, there doesn’t seem to be any great mystery about the affair. The man’s name was given to us by Mr. Green, and the identity seems to be confirmed by the initials on the articles which were recovered from the ruins; particularly the pipe, which had been described to us by Mr. Green as belonging to Cecil Moxdale. We know practically nothing about the man; but still we know enough for the purpose of this inquiry. It might be expedient to adjourn the proceedings until fuller particulars are available, but I hardly think it is necessary. I suppose, Inspector, you have nothing further to tell us?” “No, sir,” replied Blandy. “I have told you all that I know about the affair.” “Then,” said the coroner, “that completes the evidence; and I think, members of the jury, that there is enough to enable you to decide on your verdict.” He paused for a moment, and then proceeded to read the depositions and secure the signature, and, when this had been done and Blandy had retired to his seat, he opened his brief summing up of the evidence. “There is little that I need say to you, members of the jury,” he began. “You have heard the evidence, all of which has been quite simple and all of which points plainly to the same conclusion. You have to answer four questions: Who was deceased? and where, when, and by what means did he come by his death? “As to the first question, Who was he? The evidence that we have heard tells us no more than that his name was Cecil Moxdale and that he was a cousin of Mr. Gustavus Haire. That is not much, but, still, it identifies him as a particular individual. As to the conclusiveness of the evidence on this point, that is for you to judge. To me, the identity seems to be quite clearly established. “As to the time and place of his death, it is certain that it occurred in the early morning on the 19th of April in the house known as 34, Billington Street, Soho. But the question as to how he came by his death is not quite so clear. There is some conflict of opinion on the part of the two medical witnesses respecting the immediate cause of death. But that need not trouble us; for they are agreed that, whatever might have been the immediate cause of death, the ultimate cause — with which we are concerned — was some accident arising out of the fire. There appears to be no doubt that deceased was alone in the house at the time when the fire broke out; and, that being so, his death could only have been due to some misadventure for which no one other than himself could have been responsible. “There is, indeed, some evidence that he may, himself; have been responsible both for the outbreak of the fire and for his own death. There is a suggestion that he may, in spite of his promise to Mr. Haire, have indulged in the dangerous practice of smoking in bed. But there is no positive evidence that he did, and we must not form our conclusions on guesses or inferences. “That is all that I need say; and with that I shall leave you to consider your verdict.” There was, as the coroner had justly remarked, very little to consider. The facts seemed quite plain and the conclusion perfectly obvious. And that was evidently the view of the jury, for they gave the matter but a few minutes’ consideration, and then returned the verdict to the effect that the deceased, Cecil Moxdale, had met his death by misadventure due to the burning of the house in which he was sleeping.” “Yes,” the coroner agreed, “that is the obvious conclusion. I shall record a verdict of Death by Misadventure.” On this, the Court rose; and, after a few words with the coroner and Robertson, Thorndyke and I, accompanied by Polton (who had been specially invited to attend), took our departure and shaped a course for King’s Bench Walk.","sourceLink":"http://novel.tingroom.com/kehuan/1003/30247.html","bookId":219,"book":{"id":219,"title":"Mr Polton Explains","description":"简介： Told through the eyes of a watchmaker, Dr. Thorndyke is once again facedwith a prickly mystery involving a mysterious fire in a Soho housefilled with supposedly inflammable objects. What transpires is anentertaining and amazing twist, thanks to the e...","cover":"http://novel.tingroom.com/file/upload/201404/01/11-12-39-39-1.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1003","creation":"Aug 1, 2019 12:18:25 AM","modification":"Aug 1, 2019 12:18:25 AM"}}
