{"id":106235,"no":16,"title":"Page 16","content":"Francesco Ragoczy da San Germano Io sono stragnero per sempre ed ancor\u0027; Stragnero della morte, stragnero dell\u0027 amor\u0027. I am a stranger always and ever; Stranger to death, stranger to love. -Francesco Ragoczy Text of a letter from Pietro Delfino, the Superior-Generale of the Camaldolese monks of Santa Maria degli Angioli in Fiorenza, to His Holiness, Innocento VIII, in Roma: With deepest humility and the most profound reverence the Superior-Generale of Santa Maria degli Angioli sues for the gracious attention of the Pope, His Holiness, Innocento VIII, Heir to San Pietro, Vicar of Christ on Earth. I most piously beg to bring to Your Holiness\u0027s attention a situation which has arisen in this Tuscan city of Fiorenza. While it is true in the past that Papal ire has been directed at this city, surely it was out of worldly malice and not holy charity that your predecessor used us so harshly. We have always been sincerely devoted to the True Faith, and mere political concerns are of little importance to sincere Christians, or to such strict monks as we of the Camaldolese Order. It ill becomes a monk to speak against any other man or woman in Orders, and I have searched my soul for sin and error most rigorously, and I beseech Your Holiness to vent the whole weight of Papal wrath upon me if I do this for any reason but the purity of belief and the Glory of God. Your Holiness, there is a prior in Fiorenza, a member of the distinguished Brothers of San Domenico. He is a preacher, and is gathering a very large number of converts around him. He has taken credit for the great misfortune suffered recently by this city, the death of Laurenzo de\u0027 Medici, who, though a worldly man and surely stuffed with sin, at least had the virtue of loving his city and defending it. This prior, then, has taken credit for Laurenzo\u0027s death, not as a murderer, but from having knowledge of that event given directly to him by God. It shames me to tell Your Holiness that there are many sufficiently blind and misled who believe him, and who are struck dumb with terror at his ravings. This is not Christianity, this is not the Way of Christ. Your Holiness, Savonarola is sent to test us, to see if indeed we are weak and faithless enough to be deceived. Though many people wander in error from the Light of the Lord, some have courage to resist the temptations of this godless man. Before Fiorenza is lost to the pagan worship of false prophets, before those souls for whom we pray always have forsaken the salvation which the Son of God purchased so dearly for them, Good Holy Father, intervene here and cast that man from the bosom of the Church, for surely there we nurture a viper who could poison us all. Put him to the test before the Office for the Congregation of the Faith, and see what your good Inquisitors might do. They are his fellow Domenicani. If he is in the right, they will discover it. If he is not, then the secular arm must enforce the penalty for blasphemy, for to speak as if from the Mouth of God and to tell lies is the greatest blasphemy known. Your Holiness, my good Brothers have heard of your recent indisposition. We are giving time to special prayers for your speedy recovery, through the Grace of God, His Son, the Holy Spirit and the Blessed Intervention of the Blessed Virgin. In the name of Christ Who died for us and Who is Risen in Glory, I most humbly submit to your judgment and welcome your chastisement should I be fallen in error. Pietro Delfino Superior-Generale, Camaldolese Santa Maria degli Angioli In Fiorenza on the Feast of the Visitation, July 2, 1492","sourceLink":"https://allnovel.net/the-palace-saint-germain-2/page-16.html","bookId":2497,"book":{"id":2497,"title":"The Palace (Saint-Germain #2)","description":"Storyline: The Palace (Saint-Germain #2) The anticipated paperback release of the second title in Yarbro\u0027s long-running Saint-Germain series featuring immortal vampire Francesco Ragoczy da San Germano. Secluded in his Renaissance Florence palace, he falls for a beautiful courtesan and loses all desire for isolation.","cover":"https://allnovel.net/images/the-palace-saint-germain-2.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-palace-saint-germain-2.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:52:42 PM"}}
