{"id":106256,"no":38,"title":"Page 38","content":"Prior Orlando Ricci opened his hands, a gesture of despair. \"I have done all that I can, Signor Ragoczy. I have had no response from His Holiness, and my authority is neither greater nor lesser than Savonarola\u0027s. But he has usurped the force of the state as well as the leadership of his Order. In the face of that power, I am impotent.\"\\n\\n Ragoczy nodded slowly. \"I see. And there\u0027s nothing else either of us can do?\" He looked up at the ornate beams that crowded the ceiling, almost blocking the view of the vault. \"Can we delay him, even a week?\"\\n\\n \"What good would that do?\" the Francescano asked. \"The week would give him more opportunity to create a climate of approval for his auto-da-fe. And you, if you were strong in your opposition, might make yourself suspect. If he once convinces Fiorenza that heresy is rife in the city and that only the stake will abolish it, then the city will indeed be laid waste with the fire of God\u0027s Wrath, just as he predicted.\" He turned to look toward the altar, framed by tall, thin windows that in the morning were alive with light; but now, with the sun low in the west, a bright smear behind clouds, the whole church seemed drab, forlorn and lifeless.\\n\\n Although it was dangerous to do so, Ragoczy decided to trust the prior of Santa Croce, \"I have heard from... an associate of mine, living in Roma, that Pope Alessandro intends to issue a formal charge of heresy against Savonarola. My information is not official,\" he added as a caution to Orlando Ricci. \"I don\u0027t know if the Pope will make the charge, not wholly. But I have found that my... associate is very reliable.\"\\n\\n \"Heresy?\" If the old Francescano was surprised by the word, it did not reveal itself in his words or his bearing. \"Heresy. At last.\"\\n\\n Ragoczy was silent. \"Do you think we could force a delay? Knowing this?\"\\n\\n The prior of Santa Croce regarded the foreigner in the elegant dark red damask silk. \"Why should it matter to you?\"\\n\\n \"If I\u0027m to be human, I must care about humanity. And I have an obligation to my uncle\u0027s servant.\"\\n\\n Orlando Ricci winced. \"I beg you not to dissemble with me. The fabrication of a nephew will do well enough for most of Fiorenza, but I pray you will be honest with me. I have known you to be Francesco Ragoczy from the day after you returned.\"\\n\\n Ragoczy\u0027s face was guarded, but a tension was winding in him. \"How?\"\\n\\n \"Your voice when you sing. I heard you once or twice when you and Laurenzo would stroll about the streets singing. When you\u0027ve heard as many monks singing flat as I have, you value a voice that is true. And there is a quality to your voice when you sing, a texture that I\u0027ve never heard before or since.\" He laughed once, very sadly. \"The other day I heard you join in a hymn, and I knew.\"\\n\\n \"I hope, good Prior, that others are not so acute.\" After a moment of silence he said, \"What will you do? I am under pain of arrest still. The accusation of diabolism still stands.\"\\n\\n \"My dear Ragoczy, you\u0027ve stood in this church for the last hour and I have not seen you shrink from me, from the altar or any holy thing here. We\u0027ve passed powerful shrines with relics and you have not cried out in pain, nor have burns or welts appeared on your skin. You regard all these things with becoming respect and you do not stink of brimstone. Because of this and because of the source of the accusations against you, I\u0027m reserving my judgment. And I honor you for your courage, whatever you are.\" He turned and said in another voice, \"It\u0027s nearly time for vespers. I must leave you. But come again, as soon as you have confirmation on the Pope\u0027s action. You have my word that I\u0027ll give you what help I can, but it may not be much. There is too much fear and support for Savonarola in Fiorenza and any aid I give must be in secret. On the day Savonarola is cast out as the devil in monk\u0027s robes that he is, I will acknowledge in public all you have done for Fiorenza.\" With that he sketched a blessing in Ragoczy\u0027s general direction before hurrying away through the church.\\n\\n Ragoczy did not linger at Santa Croce. Night was already gathering in the sky, and he had a great deal to do before the next morning, when he would again try to address the Console on Demetrice\u0027s behalf. He was grateful that Ruggiero had arrived at Palazzo San Germano at last, for there were tasks that only Ruggiero could perform for him. His manservant had recovered from the worst of his wounds, though he still limped when he walked. Between that limp and the dark stain on his skin which had been colored with oil of walnuts, he was quite effectively disguised, and at the moment answered to the name of Ferrugio.\\n\\n While Ragoczy paused in la Via della Primavera to speak with a spice merchant, the supposed Ferrugio was vainly attempting to keep a large troop of Militia Christi from ransacking Palazzo San Germano. He shouted to the youths as they pulled a huge, elaborately framed painting of the Triumph of Paris off the wall. The heavy frame cracked as it hit the marble floor, and two of the young men set to work with short knives, slicing through the handsome face of Paris and the opulent curve of Helen\u0027s shoulder.\\n\\n From the landing of the grand staircase four of the Militia Christi searched the elaborate carving for the release of the lock of the hidden chambers rumored to be at the back of the landing. As he watched, Ruggiero was secretly pleased that he had taken the time to be sure that entrance had been locked from the inside.\\n\\n Two more of the young men were racing up the stairs to the gallery on the second floor when Natale appeared, holding a steward\u0027s staff. \"Not one step farther, ragazzi.\" He moved the staff so that it effectively blocked the top of the stairs.\\n\\n The leader of the group glared. \"You must move. It\u0027s our duty to seize vanities.\"\\n\\n \"Not while I\u0027m here to stop you.\" Natale looked as if there were nothing he would like better than to smash a few of the arrogant young men with his thick staff. Smiling, the Militia Christi took the challenge.\\n\\n Even before he reached the main door of Palazzo San Germano, Ragoczy knew something was seriously wrong. Though nearly half a block away, he began to run, his long cloak of tooled red leather flying out behind him like wings.\\n\\n The sound was hideous, a combination of nails pulled from their beds and crockery breaking. Ragoczy paused on the threshold, his face set into grim lines as he saw Ugo conferring with a leader of this troop of publicity sanctioned vandals. Near the top of the stair Natale lay in a heap, a large reddened lump on his forehead. Two of the young men held Ruggiero, mocking his attempts to break away from them.\\n\\n In the middle of the loggia, scattered and broken on the marble floor in addition to the ruined painting were several brass scales and gauges from his measuring room, a small spinettino, a large viol, two T\u0027ang Dynasty jade lions, a bolt of Turkish silk, a few carved rosewood chairs, a number of enameled bowls, and a tied bundle of illuminated music manuscripts. As Ragoczy watched, four more of the young men ran in dragging a large screen of intricately carved wood inlaid with ivory. They tossed this onto the heap, cheering as the delicate wood broke.\\n\\n \"Stop! At once!\" Ragoczy\u0027s command filled the loggia like the tolling of a great bell.\\n\\n It was as if the air had been sliced with an ax. All the young men stopped abruptly, and turned toward the elegant figure in the door. The clatter of broken wood falling on marble seemed horridly loud, and as ominous as the sound of cannon.\\n\\n Ragoczy walked into the silence, cold rage in his penetrating eyes. His jaw tightened as he looked down at the wreckage before him. Then he lifted his gaze to the troop of Militia Christi.\\n\\n Afterward none of them could say why they had been so frightened. Ragoczy was unarmed, a man of no more than medium height, elegant to the point of foppishness. And yet as his dark, luminous eyes met each of theirs in turn, a kind of dread touched them, a sense that Ragoczy\u0027s foreignness was more than a matter of language and geography.\\n\\n The leader of the troop raised his chin. \"We are empowered to eliminate all Vanities-\"\\n\\n \"Be silent.\" The words were soft, almost a whisper, and they stung like a lash.\\n\\n The leader glared defiantly. \"I am Ezechiele Aureliano. Savonarola himself entrusted me-\"\\n\\n \"I said be silent.\" He spoke conversationally and his menace was all the greater. He regarded the two young men holding Ruggiero. \"Release my houseman. Now.\"\\n\\n Shamefaced, confused, the two young men frowned, exchanged bewildered looks, and let go of Ruggiero.\\n\\n \"Ferrugio,\" Ragoczy told him, \"see to Natale.\"\\n\\n Ruggiero nodded and without a word shouldered his way through the young men and climbed the stairs to where Natale lay.\\n\\n No one spoke as Ragoczy walked around the pile in the middle of his floor. He bent and touched one of the spinettino\u0027s keys and the string jangled tunelessly. There was a kind of blind pain in his face at the sound. Next he picked up one of the jade lions. The front right paw was broken off and the right side of the head was smashed, turning the lovely jade cloudy, as if it were a plant touched by frost. Ragoczy stood, holding the jade lion in the crook of his arm. His glance never wavered from the little statue.\\n\\n \"Get out of my house. All of you.\" His words were distant, quiet, terrifying.\\n\\n Most of the young men were glad to obey, sensing that they were escaping a danger far greater than they knew. They went stiffly, a residual fear making them clumsy.\\n\\n But Ezechiele Aureliano stood his ground. \"You have no right to do this. The Militia Chris-\"\\n\\n Ragoczy spun around on him. \"I have no right? I?\" The wrath in his voice, in his eyes was so fierce that Ezechiele Aureliano backed away from it and stumbled as his foot caught against some debris on the stairs. \"You say that, you who caused this... this obscenity!\"\\n\\n Ezechiele scrambled to get away from Ragoczy. He missed his footing once again, but then fled, shouting as he went, \"You\u0027ll regret this, stragnero!\"\\n\\n When the door had crashed shut, Ragoczy stood very still, his hands lovingly, mournfully assessing the damage to the jade lion. At last he put it down on the stair and turned his attention to Ugo, who waited, sullen and defiant, on the landing.\\n\\n \"They\u0027re good Christians,\" Ugo began, ready to defend the Militia Christi and the destruction they had brought to Palazzo San Germano.\\n\\n \"They are pernicious savages.\" His brows flicked together. \"And you are one of them.\"\\n\\n \"I believe with the holy prior of San Marco...\"\\n\\n Ragoczy ignored this entirely. He asked of Ruggiero, who leaned over Natale, \"How is he, Ferrugio?\"\\n\\n \"I don\u0027t think his skull was cracked, but the blow has left a serious bruise.\" Ruggiero stood. \"He\u0027ll have to lie down for a while, and he may need a physician later.\"\\n\\n \"I\u0027ll carry him to his chamber.\" Ragoczy pushed past Ugo, moving fastidiously, as if unwilling that any part of his garment should touch his servant.\\n\\n \"But what about me?\" Ugo demanded as Ragoczy reached Natale.\\n\\n Ragoczy barely glanced back at him. \"You not only permitted, you invited the destruction of my valuables. What would you do, in my position?\"\\n\\n \"I would be grateful that my servants wish to save me from hell.\" This was shouted. The sound was strident and it was obvious that Ugo knew he had gone beyond what could be tolerated.\\n\\n \"Would you? Then you may be grateful that I will not allow you to remain here where there is so much sin and vice. You have until sunrise tomorrow to leave this place. If you are not gone by then, I will send for i Lanzi. Believe this.\" Ragoczy looked away from Ugo, and his icy contempt vanished. \"I\u0027m ashamed. He was harmed in my service.\"\\n\\n Ruggiero seemed not to hear this. \"His chamber is waiting, master. I\u0027d carry him, but I\u0027m not strong enough yet.\" He was embarrassed to admit this, and under the dark dye his skin flushed.\\n\\n \"Never mind.\" Ragoczy bent, then lifted Natale into his arms, carrying him as easily as he would a child. On the stair below, Ugo stifled a gasp, realizing what strength Ragoczy must possess to carry a man larger than himself without noticeable effort.\\n\\n Undecided, Ugo took one hesitant step up the stairs, then changed his mind, fearing what Ragoczy might do to him. He knew now that he had been treated with great forbearance, and that he could not count on Ragoczy\u0027s continued restraint. Until he had seen Ragoczy overwhelm the Militia Christi, he thought he had never seen anyone more compelling and more dangerous than Savonarola. Those traits had attracted him to the little Domenicano, because force fascinated him. Now he had seen someone stronger, much stronger, someone who used that strength with formidable, alien discipline. By comparison, Savonarola\u0027s railing at sin was only childish histrionics. Ugo walked down the stairs, dejected, and could not bring himself to look at the beautiful broken things piled up before him. He hurried away to the cellars, feeling cheated, feeling lost.\\n\\n When Natale was safely in bed, Ragoczy and Ruggiero returned to the loggia. They both were reluctant to sort out what was piled there, but at last Ragoczy dropped to one knee. \"Make a list, Ruggiero. I want a record of what was done.\"\\n\\n \"As you wish, master.\" He studied Ragoczy compassionately, knowing how much Ragoczy loved beautiful things.\\n\\n Ragoczy had retrieved a miniature of a Byzantine prince which looked more like an icon than a portrait. He stared at it, rubbing the archaic face with his thumb. \"Well, at least the Orpheus is safe. I should have put more of this in the hidden rooms.\"\\n\\n \"Don\u0027t chide yourself,\" Ruggiero admonished him.\\n\\n \"Who better? You\u0027d think by now I would have learned...\" He broke off. \"Make the list, old friend. I\u0027m going to find a physician.\" He turned away so that Ruggiero could not see and would not pity his grief.\\n\\n Text of a letter from Germain Ragoczy to i Priori and la Signoria:\\n\\n To you excellent governors of Fiorenza, I, Germain Ragoczy, nephew and heir to the holdings and estate of Francesco Ragoczy da San Germano, am driven by circumstance to address a complaint.\\n\\n The day before yesterday, in the evening, members of the Militia Christi came to Palazzo San Germano and engaged in acts of vandalism to a considerable extent. Attached to this letter is a list of the items they destroyed. Though I am in sympathy with the cause of religion, the callous invasion of private homes cannot be tolerated, no matter what your current laws permit.\\n\\n Some of the items which the young men saw fit to seize and damage or destroy are neither my property nor the property of my uncle, and as they are my responsibility, I am now bound by the law and my conscience to make good on those pieces of art, those musical instruments and those goods that were, in fact, the property of others, most of whom are not, in fact, Fiorenzeni.\\n\\n If you have provisions for restitution of damages, I would appreciate a meeting to decide the amount at your earliest convenience.\\n\\n At this time, I would like to remind you that you have yet to hear my petition for the release of Donna Demetrice Volandrai, who is currently being held at an unknown place on a charge of heresy. Perhaps when you allow me to present my claim for settlement, you would be willing to hear my petition on her behalf.\\n\\n I ask you good Priori to consider my position. I have many obligations to my uncle, not only as his heir, but as benefits the honor of our ancient house. You are anxious to discharge the law equitably; no less am I anxious to see that I accomplish my tasks. Certainly it is to our mutual benefits to settle all these matters as quickly as possible.\\n\\n Be certain that I await your response most eagerly and will place myself entirely at your disposal.\\n\\n Germain Ragoczy\\n\\n At Palazzo San Germano, March 2, 1498 \\n\\n","sourceLink":"https://allnovel.net/the-palace-saint-germain-2/page-38.html","bookId":2497,"book":{"id":2497,"title":"The Palace (Saint-Germain #2)","description":"Storyline: The Palace (Saint-Germain #2) \\n The anticipated paperback release of the second title in Yarbro\u0027s long-running Saint-Germain series featuring immortal vampire Francesco Ragoczy da San Germano. Secluded in his Renaissance Florence palace, he falls for a beautiful courtesan and loses all desire for isolation.\\n","cover":"https://allnovel.net/images/the-palace-saint-germain-2.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-palace-saint-germain-2.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:52:42 PM"}}
