{"id":106259,"no":41,"title":"Page 41","content":"\"What is the meaning of this outrage?\" Ragoczy demanded as he was ushered into the Madonna chapel of Santa Maria Novella. He pulled his arms free of the grasp of the two lancers who had brought him to the old Domenican church and glared into the darkness. Next to the mercenary soldiers his bearing was disturbingly aristocratic, and his indignation was as genuine and legitimate as the medieval frescoes on the far wall. Ragoczy straightened his heavily embroidered sleeveless coat that was worn over a sleeved tunic of stiff green satin. His heeled boots were tooled blue leather and the hat on his short-cropped loose curls was thickly sewn with pearls.\\n\\n Two of the old Domenicani Brothers seated behind the long table set up in the Madonna chapel exchanged worried glances, but the third, a man of little more than twenty, regarded Ragoczy sternly. \"You will be seated. It is for us to ask questions.\"\\n\\n \"I\u0027ll stand,\" Ragoczy said shortly, and looked again at the young Domenicano. Something stirred in his memory. The night of the celebration... what was it? Twelfth Night! The monk before him had been the leader of the followers of Savonarola who had broken into his palazzo and caused such havoc. His face did not change expression, but he realized that he was much more vulnerable than he had thought at first.\\n\\n \"You are Germain Ragoczy, are you not? Heir to the perfidious Francesco Ragoczy da San Germano?\"\\n\\n Ragoczy gave him a haughty stare. \"I would not have put it that way. But Francesco Ragoczy was my uncle and I am his heir. If I am ever allowed to settle his estate.\" This pointed remark was not wasted. The two older Domenicani exchanged looks and one very slightly shook his head.\\n\\n \"When certain matters have been answered to our satisfaction, then the estate will be settled, one way or the other.\" The younger monk rapped out the words.\\n\\n \"And have you already decided what those acceptable answers are? Tell me at once, so I may be prepared to lie to your order.\" Ragoczy folded his arms and waited.\\n\\n The young Domenican Brother said, \"I am Fra Mario Spinnati.\" He studied Ragoczy closely, studying his reaction to this announcement.\\n\\n Ragoczy raised his brows and asked, \"You are willing to tell me who you are? You must be very certain of yourself.\"\\n\\n This was not what Fra Mario had hoped for. He rose to his feet, his breath coming quicker. \"You are wearing blue boots. Boots of tooled leather. With heels.\"\\n\\n Obligingly Ragoczy raised one foot and inspected the boot as if he had never seen it before. \"So I am.\"\\n\\n Fra Mario\u0027s control slipped badly. \"And you were wearing them at the Bonfire of Vanities!\" The sudden shout rang through the old church.\\n\\n \"Very likely,\" Ragoczy agreed, standing on both feet once more.\\n\\n \"You were wearing them then. I know, because you were seen.\"\\n\\n Ragoczy shrugged. \"I wasn\u0027t trying to hide myself.\"\\n\\n \"But why were you there?\" Fra Mario demanded.\\n\\n \"I suppose for the same reason many others were there-to see Botticelli\u0027s paintings for the last time.\" He knew this answer was a dangerous one, but he hoped it might lessen the impact of the accusation he knew was coming.\\n\\n \"The citizens of Fiorenza were there to see an end to Vanity,\" Fra Mario insisted.\\n\\n \"Were they? Then why did so many weep when the paintings burned?\" His eyes met Fra Mario\u0027s with controlled intensity.\\n\\n \"They wept,\" Fra Mario said unsteadily, \"because they were filled with joy. They were free.\" Too late he realized that the foreigner had succeeded once again in putting him on the defensive. He tightened his hands. \"Is that why you stole the paintings?\"\\n\\n \"What paintings?\" Ragoczy asked.\\n\\n \"The Semele and the Persephone.\" The monk\u0027s question was a challenge, and he was clearly waiting for the chance to take up the battle in earnest.\\n\\n \"Are they missing?\" Ragoczy asked.\\n\\n \"You know they are!\"\\n\\n \"You\u0027ve told me.\" Ragoczy saw the slight confusion on the two older monks\u0027 faces and felt relief. The matter was still between Fra Mario and him. \"I\u0027m glad,\" he added thoughtfully, \"that someone had the courage to take them.\"\\n\\n This had all the effect he had hoped it would. Fra Mario took a few hasty steps around the end of the table, his jaw set pugnaciously. \"You say that, foreign dog!\"\\n\\n \"Yes,\" Ragoczy agreed calmly. \"I say it. Because I believe it. And whoever it was, in time the world will be grateful to him.\"\\n\\n \"And would you have taken the paintings?\"\\n\\n Ragoczy knew from this question that Fra Mario was less convinced than he had been. He studied the monk evenly. \"Yes,\" he said at last. \"If I had had the opportunity, I would have made the attempt. But I would have tried to take the Jupiter and Io instead of the Semele.\" His eyes never wavered from Fra Mario\u0027s face, and his candor perplexed the Domenicano.\\n\\n One of the older monks interrupted at this point. \"Signor\u0027 Ragoczy,\" he said in a surprisingly strong voice, \"I am Fra Stanislao. I would like to ask you a few questions.\"\\n\\n \"Of course,\" Ragoczy said, recognizing a far more dangerous opponent in the old monk than Fra Mario had been. \"I will do my best to speak truthfully.\"\\n\\n Fra Stanislao nodded noncommittally. \"You say you are the heir of Francesco Ragoczy?\"\\n\\n \"I am.\"\\n\\n \"Do you have proof of that?\"\\n\\n \"I have a patent of arms which should be familiar to you: the eclipse, winged erect on a silver field. I have also letters from my uncle, and a document from two Hieronomiani Brothers, reporting the death of my uncle and giving his last Will.\" There were few of the Hieronomiani Brothers in Italia, for their strength was greatest in Spain. The assumption would be that Francesco Ragoczy had gone into Spain or perhaps Portugal. \"I believe he was in the company of an alchemist of his acquaintance, a Magister Branco.\"\\n\\n Fra Stanislao nodded again. \"Are you willing to produce these documents?\"\\n\\n Ragoczy sighed as one much put upon. \"I have been trying to show someone at la Signoria my documents since first I arrived in Fiorenza. If your examination of them would hurry the conclusion of the settlement of my claim, let me send word to my houseman Ferrugio and he will bring the documents to you.\"\\n\\n If this assertion impressed Fra Stanislao, nothing in his manner or expression revealed it. \"That may be for later.\" He glanced at a parchment in front of him. \"Now, this matter about Donna Demetrice Volandrai. You have been seeking to secure her release.\"\\n\\n \"I have been,\" Ragoczy agreed, his senses suddenly very alert. \"My uncle specifically bade me see that Donna Demetrice was given housing and a pension of her own in return for her service to him. He charged me with the task of seeing that she was protected and provided for.\"\\n\\n \"But she stands accused of heresy,\" Fra Stanislao pointed out mildly.\\n\\n \"It is a crime to which she has not, as I understand it, yet confessed. And it may be that her tuition from my uncle in the science of alchemy has contributed to her accusation. Until she is condemned, I would dishonor the memory of my uncle to abandon Donna Demetrice.\" He stood somewhat straighter and let his accent become stronger and harsher. \"I do not know how it is in Fiorenza, but in my Transylvanian mountains, when the honor of your name and your family is in your hands, you are doubly damned if you betray either.\"\\n\\n At last there was a reaction from Fra Stanislao, the merest touch of anger in his voice and the abrupt way in which he put down the parchment. \"Honor is Part of Christian life. And I hear that you are a Christian. A Catholic, in fact.\"\\n\\n Ragoczy nodded slightly. \"I am. I attend Mass regularly, as I am certain you know.\" He decided to take a certain risk. \"Is it only Fra Mario who thinks I have stolen Botticelli\u0027s paintings, or do you agree with him?\"\\n\\n Fra Stanislao frowned. The foreigner had anticipated his question and he was thrown off stride. \"I have reserved judgment so far.\"\\n\\n \"If you wish, search Palazzo San Germano. The Militia Christi have already, but it may be that they overlooked something in their eagerness to destroy my uncle\u0027s treasures.\" His voice was louder and his brow darkened. \"But I ask that if you desire another search, that someone be sent who will supervise those young men, so that more will not be damaged.\"\\n\\n \"You sound angry, Signor Ragoczy,\" Fra Mario said smugly.\\n\\n \"I am angry. So would you be if you had seen the wanton destruction that was brought to my house.\" Ragoczy stepped nearer the table where the Domenicani waited. \"Do you want to search the house?\"\\n\\n Fra Stanislao made a gesture of dismissal. \"If you are so willing to have us there, the pictures must be elsewhere.\"\\n\\n \"What?\" Ragoczy demanded, and looked at the monks with a kind of arrogance. \"I see. If I will not allow you to search Palazzo San Germano, it is because I have the paintings there. If I do allow you to search, it is because I have the paintings somewhere else. That condemns me no matter what I say and makes it unnecessary for you to ask such questions of a Fiorenzan. Foreigners are better suspects, are we not?\" He half-turned from the table, indignant.\\n\\n \"It\u0027s not your foreignness,\" Fra Mario insisted, ignoring the warning gesture from Fra Stanislao. \"We know you\u0027re mixed up in this somehow. You were seen near the paintings. You were talking with Botticelli.\"\\n\\n \"I haven\u0027t denied it,\" Ragoczy said, relieved. \"He had asked me to return to him a painting my uncle had bought from him a few years ago. I made a search for it and could not find it. I told him so. I also told him I was glad that it wouldn\u0027t have to burn.\" He decided to take another chance. \"I tried to look at the pictures before they were consumed, but the Militia Christi had a tight guard on them. Only Domenicani were allowed to handle the works. So I watched from as close as I was permitted to stand.\" He knew that several of the Militia Christi members would testify to that if they were ever asked. And luckily no one had seen him in his hiding place when he pulled the Domenican habit over his own clothes.\\n\\n Reluctantly Fra Stanislao nodded. \"So we understand. But one of the young men claimed to have seen a monk wearing blue tooled leather-heeled boots.\"\\n\\n Ragoczy\u0027s laughter was startling, and Fra Stanislao crossed himself to protect himself from the impiety of it. \"I beg your forgiveness, good Domenicani,\" Ragoczy said when he could speak. \"But the thought of a monk in my shoes...\" He let his mirth possess him again. \"It\u0027s ridiculous. I admit that I stood very near one or two of the monks who searched through the paintings, and it is possible that someone looking quickly might have seen my boots near the feet of one of the Brothers. But to think anything else...\" He mastered his laughter this time.\\n\\n Fra Stanislao regarded him coldly. \"It is possible that the young man was mistaken.\" He fingered the parchment, his face revealing nothing. \"The auto-da-fe is to take place on the tenth. Today is the sixth. Tomorrow or the day after, Donna Demetrice will be examined by members of our Order, to determine if there has been heresy committed. She has maintained that there was none in her initial examination, but the examination was not rigorous.\"\\n\\n Ragoczy turned cold. \"What do you mean, not rigorous?\"\\n\\n \"I mean,\" Fra Stanislao informed him in his most deliberate manner, \"that so far she has been threatened only. She has refused to answer us. So it will be necessary to submit her to the Question.\"\\n\\n The Question, as Ragoczy knew well, meant some form of torture. He did not betray his dread as he lifted his brows again. \"I should think her oath would be enough.\"\\n\\n This time Fra Stanislao shook his head regretfully. \"You don\u0027t understand. The Devil is cunning and his ways are devious. You have never met this woman, you don\u0027t know what she might be capable of doing. For the salvation of her soul, her body must suffer. For the glory of God, she must accept chastisement and confess the truth.\"\\n\\n This cool recitation brought a smile to Fra Mario\u0027s lips and he turned to Ragoczy. \"When the Question is finished, if she has proven innocent, she will be released to your care.\"\\n\\n \"How does she prove herself innocent?\" Ragoczy asked, knowing the answer.\\n\\n \"She dies, foreigner. She dies.\"\\n\\n But this was too much for Fra Stanislao. \"It is enough that she demonstrate her innocence under Question. If she dies, it is proof of her redemption. But if she lives and convinces us, then it will be a simple matter to see that she is restored to you. If, of course, she is found to be guilty, she will burn on the tenth, with the other heretics.\"\\n\\n Ragoczy gazed down at the Domenicani Brothers. \"Tell me, of those you have in prison who are accused of heresy, how many have demonstrated their innocence and lived?\"\\n\\n Fra Mario answered the question, with relish. \"None. But there are eleven of the accused yet to be examined.\"\\n\\n \"I see. How convenient.\" Ragoczy stepped back. \"Well, good Domenicani, what now? Are you proposing to accuse me of heresy, to be sure of my compliance with your plans? Are you going to insist that I stole Botticelli\u0027s paintings? Or are you going to send for my documents, and find out whether or not I am who I say I am?\"\\n\\n Fra Stanislao\u0027s mouth was a tight line, and he spoke as if the words were painful. \"Time enough for your proof after the auto-da-fe. But you must understand our position, and our concern for our city and the state of your soul. We are assigning a guard to you, who will stay with you until we decide what is to be done. If you make any attempt to escape or to trick your guard, we will know that you are not what you claim, and we will order you arrested and imprisoned.\"\\n\\n Ragoczy\u0027s eyes glittered unpleasantly. \"I see. Just as you condemn me if I don\u0027t allow you to search my house and condemn me if I do, you guard me, and if I accept the guard I must betray my house and name and oath, but if I refuse the guard, I convict myself of heresy and am dishonored. Very neat, good Brothers.\" He looked around the empty church, staring out of the elaborate screen of the Madonna chapel.\\n\\n Not one of the monks seemed to hear the sarcasm in his words. Fra Stanislao was unperturbed as he said, \"The whole matter will be resolved in a few days, Signor Ragoczy. You might as well accept things as they are with a good grace. Fra Sansone\"-he signaled for the Domenicano to approach-\"will be your guard.\"\\n\\n Fra Sansone deserved his name. He was tall, broad-shouldered and muscular in a way that not even the Domenican habit could disguise. He acknowledged Fra Stanislao and turned a passively hostile gaze on Ragoczy.\\n\\n \"Fra Sansone,\" Ragoczy said politely. \"I will do my humble best to make you comfortable. If that is not also a sin?\" he added, addressing his remark to Fra Stanislao.\\n\\n The old monk had little humor left in him. \"You will do yourself and Donna Demetrice a great service if you treat this man with as much circumspection as possible. Fra Sansone was once part of the secular arm of the church. He still has great capacity for such tasks.\" By which Fra Stanislao meant that Fra Sansone had been a torturer. \"I trust you understand me, Ragoczy.\"\\n\\n \"I understand,\" Ragoczy answered grimly.\\n\\n \"In that case, you may leave. We will speak again on the eleventh.\" Fra Stanislao motioned to his companions.\\n\\n \"And in the meantime? How will I know what has become of Donna Demetrice? How will I know how I must defend myself, if there are accusations laid against me?\" His indignation was no longer feigned.\\n\\n \"On the eleventh, Ragoczy,\" Fra Mario said, enjoying his power over the foreigner. \"I fought your uncle once. He wasn\u0027t as big a man as you are, but he fought well. It would be a pleasure to compare your abilities.\"\\n\\n Ragoczy did not answer this provocation. Instead he looked at Fra Stanislao. \"And I suppose I cannot confess or attend Mass until the eleventh?\"\\n\\n \"That is correct,\" the old Domenicano said, no longer interested in Ragoczy.\\n\\n \"And if I object?\" He leaned against the table, putting his weight onto his hands. \"Answer me, good Brothers. What if I should object?\"\\n\\n Fra Stanislao met his eyes levelly. \"Then you will accuse yourself of heresy. And your fate will be the same as that of all heretics. You will die at the stake and your ashes will be scattered to the four winds. Until the eleventh, Signor Ragoczy.\"\\n\\n Text of a letter from Pope Alessandro VI to Girolamo Savonarola:\\n\\n To the irreligious and disobedient excommunicant Girolamo Savonarola in Fiorenza, His Holiness Alessandro VI issues final warnings.\\n\\n We are distressed to learn that you, in your pride and all-devouring vanity, have chosen to defy the See of San Pietro and Holy Church. Though you are excommunicant, you persist in celebrating Mass and administering the Sacraments, which not only damns you the more, but condemns those who in misguided trust receive these sacred things from your blasphemer\u0027s hands.\\n\\n Therefore, we have begun a Process against you, which will demonstrate that in your continued and unrepentant rebellion against us, you are guilty of the most pernicious heresy, and for that you will suffer the ultimate penalty, both in this world and in the world that is to come.\\n\\n But God is merciful and is more delighted with the return of the strayed sheep than in the faithful flock. Were it not for this, the Process would be served without warning and without opportunity for you to recant and abjure your impious ways. We would betray the trust of San Pietro if we allowed such a course to be followed. Therefore, you will have one week to repent in public for your disobedience and continued defiance of our Bull and our Interdict. Your repentance must be sincere, your confession complete and you must publish it abroad for all the world to read. Then you must surrender yourself to the Superior Generale of the Domenicani, and from him learn in which monastery you will serve as immured anchorite.\\n\\n On this, the feast day of San Tommaso Aquino, you would do well to think of his example and to accept the judgment of the Church. By this act you would spare your congregation much suffering and much terrible doubt. You will keep them from greater sin, and for that, much will be forgiven you.\\n\\n We will learn of your compliance with rejoicing. Or we will strike you down with the full weight of the Church Militant and the Will of God.\\n\\n Alessandro VI\\n\\n Pontifex Maximus\\n\\n See of San Pietro\\n\\n Roma, the feast day of San Tommaso Aquino, the 7th day of March, 1498 \\n\\n","sourceLink":"https://allnovel.net/the-palace-saint-germain-2/page-41.html","bookId":2497,"book":{"id":2497,"title":"The Palace (Saint-Germain #2)","description":"Storyline: The Palace (Saint-Germain #2) \\n The anticipated paperback release of the second title in Yarbro\u0027s long-running Saint-Germain series featuring immortal vampire Francesco Ragoczy da San Germano. Secluded in his Renaissance Florence palace, he falls for a beautiful courtesan and loses all desire for isolation.\\n","cover":"https://allnovel.net/images/the-palace-saint-germain-2.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-palace-saint-germain-2.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:52:42 PM"}}
