{"id":7921,"no":14,"title":"CHAPTER XIV. A FASHIONABLE BOARDING-HOUSE.","content":"When Tom\u0027s head emerged from the yellow and turbid waters, he caught sight of the young man, and struck out for him. Grasping him by the arm, he succeeded, with considerable difficulty, in holding him up till a small boat near by picked both up. \"Whew!\" sputtered Tom, spitting out some of the water which he had involuntarily taken into his mouth. The young man rescued looked about him stupidly. \"What made you jump into the river?\" asked the boatman. \"I was drunk,\" said the young man, frankly, upon whom the shock of the falling into the water had produced a favorable effect. \"It\u0027s lucky this boy was near and jumped after you, or you might have been drowned before I got to you.\" The young man turned and looked earnestly at Tom. \"So you jumped after me?\" he said. \"I feel as if I did,\" answered Tom. \"I\u0027m as wet as a drowned rat.\" \"You\u0027re a brave boy.\" \"Thank you,\" said Tom, modestly. \"But I can swim so well that it didn\u0027t take much courage.\" \"I can\u0027t swim a stroke.\" \"Then you\u0027d better not jump into the water again.\" \"I don\u0027t mean to,\" said the young man, smiling. \"Where did you learn to swim?\" \"In the East river.\" \"Where\u0027s that?\" \"New York.\" \"Look here, gentlemen, where do you want to be carried?\" asked the boatman. \"Back to Cincinnati. I\u0027ll pay you for your trouble,\" said the young man. \"I was goin\u0027 on an explorin\u0027 expedition to Kentucky,\" said our hero. \"You are too wet; you must take another day.\" \"It ain\u0027t any wetter on one side of the river than the other.\" \"Do you live in Kentucky?\" \"No.\" \"In Cincinnati?\" \"Yes; I\u0027ve lived there a day or two.\" \"You must change your clothes, or you will get cold.\" \"I haven\u0027t got any clothes except what I\u0027ve got on.\" The young man looked rather surprised at this, since Tom had on a good suit, and appeared to be in good circumstances. \"Then,\" said he, promptly, \"I shall take you home with me, and lend you one of my suits.\" \"It would fit me too much,\" said Tom, laughing. \"Never mind. We will stay in the house till your clothes are dry. What do you say?\" \"All right,\" said Tom. \"I\u0027m agreeable.\" When they came to the Ohio side of the river the two got off. The young man was so well over his fit of drunkenness that he walked quite steadily, showing no trace of it in his gait. \"I live a mile and a half away,\" he said, \"but it will be better to walk, as we shall be less liable to take cold in our wet clothes. Or, do you feel tired?\" \"Not a bit,\" said Tom. \"I\u0027m used to walkin\u0027. My coachman don\u0027t have much to do.\" \"You\u0027re a genius,\" said the young man. \"I\u0027m glad to hear it,\" said Tom. \"If I\u0027m a fair specimen, geniuses don\u0027t know much.\" \"At any rate, you are not such a fool as I am.\" \"Are you a fool?\" \"Any man is a fool that gets drunk.\" \"I don\u0027t know but you\u0027re right,\" said Tom. \"What makes you do it?\" \"Because I\u0027m a fool. That\u0027s all the reason I can give. I\u0027m too weak to resist temptation.\" \"I never was drunk but once,\" said Tom. \"I don\u0027t want to be again.\" \"How did that happen?\" \"A sailor invited me into a bar-room, and got me to drink. I felt as if my head would burst open the next morning.\" \"So you didn\u0027t get drunk again?\" \"No, I got enough of it.\" \"What is your name?\" asked the young man, interested. \"Gilbert Grey.\" \"Do you live in this city?\" \"I\u0027m goin\u0027 to.\" \"I wish you would come and live with me.\" \"What for?\" \"Because, though you are younger, you know how to take care of yourself. I think you would take care of me, too.\" \"If you pay me good wages,\" said Tom, \"I\u0027m willin\u0027 to be your guardian.\" \"I am in earnest,\" said the young man. \"It would do me good to have some one help me keep straight.\" \"How many times a week would you want me to jump into the water after you?\" asked our hero, jocularly. \"Because I\u0027d want to keep a good stock of dry clothes on hand; or maybe I might wear a bathin\u0027 suit all the time.\" \"I sha\u0027n\u0027t try that again,\" said the other, smiling; \"I don\u0027t like it well enough.\" By this time they reached a handsome brick house, in a fine street. \"This is where I board,\" said the young man. \"Come in.\" He rang the bell, and a servant answered the summons. She looked surprised at the appearance of the pair, both showing signs of the wetting they had received. \"We met with an accident, Bridget,\" explained the young man, \"or rather I tumbled into the water and this boy jumped after me.\" \"Faith you look like it, Mr. Mordaunt,\" said Bridget. \"Will I tell Mrs. White?\" \"Yes. Ask her if she can send us up some hot coffee in about twenty minutes. I am afraid, if we don\u0027t have some hot drink, we will take cold.\" \"All right, sir.\" A hasty glance satisfied Tom that it was a first-class boarding-house. The hall was handsomely furnished, and when, on reaching the head of the stairs, his companion led the way into a spacious room, with a chamber connecting, our young hero saw a rich carpet, elegant furniture, a handsome collection of books, and some tasteful pictures upon the walls. It was evident that Mr. Mordaunt was possessed of ample means. \"Now—by the way, I\u0027ve forgotten your name, yet——\" \"Gilbert Grey. Some call me Tom, for short.\" \"Now, Gilbert, make yourself at home. The best thing we can do is to strip at once, and put on dry clothes.\" He went to a wardrobe and brought out two suits of clothes, also a supply of under-clothing. \"There,\" said he, \"go ahead and change your clothes.\" Tom followed directions obediently, while his companion was similarly employed. Of course, it was necessary to wash, also. The clothes were too large for him, but still not much, as he was a well-grown boy, and Mr. Mordaunt was by no means large. \"How do you like the looks?\" asked the young man, as Tom surveyed himself in a handsome mirror. \"I expect it\u0027s me, but I ain\u0027t certain,\" said Tom. \"It\u0027ll take me some time to grow to these clothes.\" \"They are rather big, that\u0027s a fact,\" said the young man, smiling. \"When the servant comes up with the coffee, we\u0027ll send down our suits to be dried. Will your friends feel anxious about you?\" \"There\u0027s one will, I expect,\" said Tom. \"Who is that—your mother?\" \"No; it\u0027s my intimate friend, Maurice Walton. He can\u0027t bear me out of his sight, or in it, either.\" Mordaunt laughed. \"So he\u0027s very devoted, is he?\" \"You bet he is.\" Here there was a knock at the door. \"Come in,\" called Mordaunt. Bridget entered with a waiter, on which were a coffee-pot, some cups and saucers, sugar, etc., beside a plate of sandwiches. \"Thank you, Bridget,\" said Mordaunt. \"I see you understood what was wanted. Now, if you\u0027ll take down them wet clothes and dry them for us, we will be much obliged.\" \"I\u0027ll do it, Mr. Mordaunt,\" said the willing handmaiden. \"Now, Gilbert, sit down, and we\u0027ll have a good cup of coffee apiece,\" said Mordaunt. \"You\u0027re hungry, are you not?\" \"Bathin\u0027 in such a big tub gave me an appetite,\" said Tom; \"but I wouldn\u0027t like to get up an appetite that way every day.\" \"Nor I. It\u0027s too much trouble, not to speak of the danger. How do you find the coffee?\" \"Tip-top.\" \"It\u0027s a good deal better than wine, eh?\" \"That\u0027s so.\" \"Now, Gilbert, while we are taking lunch I have a little plan to propose to you.\" \"All right. I\u0027m ready.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/3019/83480.html","bookId":262,"book":{"id":262,"title":"Tom, The Bootblack or, The Road to Success","description":"简介： How do you feel this morning, Jacob? asked a boy of fifteen, bending over an old man crouched in the corner of an upper room, in a poor tenement-house, distant less than a quarter of a mile from the New York City Hall....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3019","creation":"Aug 1, 2019 12:18:28 AM","modification":"Aug 1, 2019 12:18:28 AM"}}
