{"id":7922,"no":15,"title":"CHAPTER XV. TOM CHANGES HIS BOARDING-HOUSE.","content":"\"Where are you boarding?\" Mordaunt began. \"At the Ohio Hotel. But I don\u0027t mean to stay. I\u0027m lookin\u0027 out some first-class boardin\u0027-house, where they don\u0027t charge mor\u0027n five dollars a week.\" \"You haven\u0027t found one yet?\" \"No.\" \"Come here and room with me.\" \"Don\u0027t you pay but five dollars?\" \"Rather more,\" said Mordaunt, laughing. \"I only get five dollars a week for my valuable services,\" said Tom. \"I pay that for board, and get my clothes with the balance. If I hadn\u0027t a fortune of ten dollars to fall back upon, I\u0027d have to go without.\" \"Is that really the way you are situated?\" asked Mordaunt, seriously. \"Yes.\" \"Then,\" said the young man, \"come and board with me, and it sha\u0027n\u0027t cost you a cent. I\u0027ll have another bed put into the bedroom, and we\u0027ll make ourselves as comfortable as we can.\" \"Do you mean it?\" asked Tom, incredulously. \"Certainly.\" \"And you\u0027ll pay my board for the sake of my agreeable society?\" \"Just so,\" answered his companion. \"Then you\u0027re a tip-top feller, and I won\u0027t refuse such a good offer.\" \"Good! That\u0027s settled, then,\" said the young man, with satisfaction. \"Now I\u0027ll tell you my reasons for making you such an offer. I am an orphan, and with no near relations, except an uncle in Canada, with whose family I am little acquainted. I inherited from my father, who died just as I reached the age of twenty-one, a fortune of one hundred thousand dollars.\" \"Whew!\" said our hero; \"that\u0027s a big pile of money.\" \"It was too large for me. It took away my ambition and energy; and though for two years I have been in a law office, pretending to study law, I have wasted my time in drinking among unworthy companions. The fact is, I am of a sociable disposition, and I found my room lonely. Now I want to turn over a new leaf, give up drinking, and devote myself more to study.\" \"I want to study, too,\" said Tom. \"I\u0027m as ignorant as a horse. I\u0027ll have to study some evenings.\" \"I\u0027ll teach you,\" said Mordaunt. \"We\u0027ll spend our evenings that way, instead of in bar-rooms.\" \"All right,\" said our hero. \"That suits me. But I ought not to let you pay my board.\" \"I can well afford it. My money is securely invested, and brings me in six thousand dollars a year clear.\" \"I shall have to work from now till I\u0027m a gray-haired old patriarch before I earn six thousand dollars,\" said Tom, comically. Mordaunt laughed. \"I hope it isn\u0027t so bad as that,\" he said. \"Well, do you agree?\" \"To come here as your guardian?\" \"Yes, if you put it in that way.\" \"You are very kind to me,\" said our hero, changing his tone and speaking earnestly. \"I am a poor boy, and don\u0027t know much. I\u0027m afraid you\u0027ll be ashamed of introducing me to your friends.\" \"Friends! I have no friends that care for me. They care for my money, and are jolly enough; but, if I needed help, they wouldn\u0027t give it. I don\u0027t know why it is, but I like you. You saved my life this morning, and I would rather have you live with me than any one I know. So, when your clothes are dry, go round to the hotel, and bring your trunk here.\" \"I haven\u0027t got any trunk,\" said Tom. \"I wouldn\u0027t have any use for one. I\u0027ve got a carpet-bag.\" \"Very well. Bring that. Now you must do me a favor.\" \"All right. Only if it\u0027s to lend you a hundred dollar bill, I\u0027m afraid I couldn\u0027t do it.\" \"I hope some time you will be rich enough to grant such favor; but that isn\u0027t the favor I meant.\" \"What is it?\" \"You must let me buy you some more clothes.\" Tom was about to object, but Mordaunt continued: \"Remember, I\u0027ve got more money than I know what to do with. I owe you something for the wetting I exposed you to.\" \"I won\u0027t resist very hard,\" said Tom. \"I s\u0027pose you want your guardian to look respectable.\" Later in the day, when their clothes were dry, Mordaunt took Tom to a fashionable clothing store, and bought him two suits of clothes, of handsome cloth and stylish cut, and, in addition, purchased him a sufficient stock of under-clothing. He also ordered a trunk to be sent up to the room. Then, it being time, they went home to supper. Mordaunt had already spoken to Mrs. White about receiving our hero as a boarder. Of course she was very ready to do so. Tom felt, at first, a little embarrassed, but this feeling soon wore away. He was not a guest, but a boarder, and was addressed by the landlady and the boarders as Mr. Grey. He came near laughing the first time he was called by this name, but soon got used to it. It was a first-class boarding-house. There were some dozen boarders, all of ample means. As Tom looked around him, and remembered that only a short time previous he had been a New York street-boy and bootblack, he could hardly believe that the change was permanent. \"What would they think if they knowed what I was?\" he thought. Next to him at table sat an elderly young lady, who was not in the habit of receiving attentions from gentlemen of marriageable age, and was therefore inclined to notice those more youthful. \"Do you like the opera, Mr. Grey?\" she asked. \"Do you?\" asked Tom, who had never heard an opera in his life. New York bootblacks seldom attend such classic entertainments. They prefer the old Bowery entertainments. \"I dote upon it,\" said Miss Green, enthusiastically. \"So do I,\" said Tom, much to Mordaunt\u0027s amusement. \"What is your favorite opera?\" asked Miss Green. \"I haven\u0027t got any favorite,\" said Tom, who thought this the best answer, as he did not know the name of any. \"I think Trovatore splendid.\" \"It\u0027s tip-top.\" \"That\u0027s a gentleman\u0027s word,\" said Miss Green, laughing. \"I am glad you agree with me. Do you sing yourself?\" \"A little,\" said Tom. \"Shall I come and sing under your window to-night?\" There was a general laugh at this offer. \"Oh, do!\" said Miss Green. \"Do you often serenade ladies?\" \"I used to, but I had to give it up.\" \"Why, Mr. Grey?\" \"Because it was taken for a cat-concert, and people used to throw bottles at me. I couldn\u0027t stand that.\" \"I\u0027ll promise not to throw any bottles at you, Mr. Grey.\" \"I\u0027ll let you know when I\u0027m comin\u0027,\" said Tom. \"My voice ain\u0027t in order just at present. When it is, I\u0027ll do my best to keep you awake.\" \"Really, Gilbert,\" said Mordaunt, when they had left the table, and returned to their room, \"you got up quite a flirtation with Miss Green. It will be a good match for you. She\u0027s got money, and isn\u0027t more than twice as old as you are.\" \"But when I got to be fifty she\u0027d be a hundred,\" said Tom. \"I guess I\u0027ll leave her for you.\" \"She has tried her fascinations on me already,\" said Mordaunt; \"but she soon concluded there wasn\u0027t any chance, and gave it up. She\u0027ll be wanting you to take her to the opera, as you dote upon it so much.\" \"The only opera house I ever went to was in the Bowery.\" \"That\u0027s what I thought. Now, how shall we spend the evening?\" \"Suppose we take a walk, and then come and study.\" \"A good plan. What would you like to study?\" \"I can\u0027t read or write very well. I don\u0027t know much.\" \"We will stop at a bookstore on our way and buy such books as you want. Then I\u0027ll give you lessons.\" While walking, a flashily-dressed young man recognizing Mordaunt, stepped up and slapped him on the shoulder. \"Come and play a game of billiards, Mordaunt,\" he said. \"I can\u0027t, Dacres. I\u0027ve got an engagement with my friend here.\" \"Sorry for it. Won\u0027t he come, too?\" \"No; he\u0027s young. I don\u0027t care to take him among such wild fellows as you.\" \"The last time I played billiards with Dacres he won a hundred dollars of me,\" said Mordaunt, as they passed on. \"It might have been so to-night; but, now I have your company, I am safe.\" On reaching home Tom spent an hour and a half in study, Mordaunt assisting him. The young man became interested in his task, and went to bed much better satisfied with himself. \n \n","sourceLink":"http://novel.tingroom.com/ertong/3019/83481.html","bookId":262,"book":{"id":262,"title":"Tom, The Bootblack or, The Road to Success","description":"简介： How do you feel this morning, Jacob? asked a boy of fifteen, bending over an old man crouched in the corner of an upper room, in a poor tenement-house, distant less than a quarter of a mile from the New York City Hall....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3019","creation":"Aug 1, 2019 12:18:28 AM","modification":"Aug 1, 2019 12:18:28 AM"}}
