{"id":7928,"no":21,"title":"CHAPTER XXI. A CONSPIRACY.","content":"James Grey continued to follow Maurice Walton and his companion until his patience was nearly exhausted. At length, just as the city clocks were striking ten, Baker said: \"Well, Walton, I must bid you good-night.\" \"Won\u0027t you walk home with me? It isn\u0027t far out of your way.\" \"Can\u0027t do it to-night. The fact is, I want to see the governor before he retires. I\u0027m hard up, and shall try to get a ten-dollar bill out of him.\" \"I wish you success. As to being \u0027hard up,\u0027 I can sympathize with you. Couldn\u0027t you ask him for an extra ten for me?\" \"I would if there was any chance of getting it, but I\u0027m afraid my own chance is slim enough.\" \"If I only got Grey\u0027s salary, I wouldn\u0027t ask favors of anybody; but how is a fellow to get along on ten dollars a week?\" \"Just so. Well, good-night.\" \"Good-night.\" Baker walked off, and Maurice Walton walked on by himself. He had taken but a few steps when Mr. Grey, quickening his pace, laid his hand upon his shoulder. \"Mr. Walton,\" said he. Maurice turned quickly. \"You must excuse the liberty I have taken in addressing you, being a stranger; but I heard you, when in conversation with the young man who has just left you, mention the name of Gilbert Grey.\" \"Yes, sir, I mentioned his name,\" said Maurice. \"Do you know him?\" \"I have spoken with him, but I know very little about him. I judge that you do.\" \"We are in the same store,\" said Maurice; \"but we are not intimate friends.\" \"I infer that you do not like him?\" \"No, I don\u0027t.\" \"Nor do I.\" Probably Mr. Grey could not have said anything more likely to win young Walton\u0027s confidence than this frank expression of dislike. \"The fact is,\" continued Mr. Grey, \"I suppose I may speak to you in confidence?\" \"Oh! certainly, sir,\" said Maurice, eagerly, for he anticipated hearing something to Gilbert\u0027s disadvantage. \"Then,\" said Mr. Grey, in a low tone, \"I look upon him as an impostor.\" \"You do?\" repeated young Walton. \"What makes you think so?\" \"I don\u0027t like to speak openly in the street. Can you give me an hour, or even half an hour of your time, or is it necessary for you to go home at once?\" \"Where are you stopping, sir?\" \"At the Burnet House.\" \"I think I can spare half an hour. It is near by.\" \"Thank you. I will endeavor to make the interview a profitable one for you. I am going to ask a service of you, and I am willing to pay handsomely for it.\" Upon a young man \"hard up,\" as Maurice was, this suggestion was not thrown away. \"I shall be glad to help you, sir,\" he said, quickly. \"Come with me, then. I will defer saying more till we are seated in my room at the hotel.\" In less than five minutes they were so seated. By the gaslight Maurice got a fair view of his companion, and was led to wonder who he was. \"Mr. Walton,\" said the older man, \"it is only fair that I should give you an equal advantage with myself. I know your name. You do not know mine. Let me introduce myself as James Grey.\" \"Formerly in business in this city?\" \"The same.\" \"The uncle of Gilbert Grey?\" \"So he says.\" It was impossible to mistake the tone in which these words were spoken. \"Is he not really your nephew?\" asked Maurice, in surprise. James Grey shrugged his shoulders. \"He pretends to be; but I believe him to be an impostor.\" \"What makes you think so? Why should he pretend to be related to you?\" asked Maurice, excited and eager. \"Because I am rich, and he has entered into a plot to extort money from me. I can make clear his design very briefly. He pretends that he is the son of my elder brother. If this be true, then the property which I possess, or a large part of it, properly belongs to him.\" \"But, if it isn\u0027t true, how can he make such a claim?\" \"My brother\u0027s only son disappeared when a mere boy, and, though his body was not found, there is reason to believe that he fell into the Ohio river and was drowned. At about the same time, a clerk in my employ purloined a sum of money and fled. This boy has heard of these two incidents, and, cunningly putting them together, comes forward with a trumped-up story to the effect that this clerk, Jacob Morton, was hired to carry off my nephew, in order that, the true heir being out of the way, I might succeed to my brother\u0027s money. It is ridiculous, and yet it is cunningly devised.\" \"I always thought he was artful,\" said Maurice. \"You are quite right there. He has an astonishing amount of artfulness and unblushing impudence. But I have not told you all. He produces a paper professing to be written by this Jacob Morton, who, he says, is dead, asserting all that he claims.\" \"Do you think he wrote it himself?\" \"Either that, or he has met this clerk somewhere, and they have devised a plan for jointly enriching themselves at my expense. If this is the case, and the paper was really written by Jacob Morton, the man is probably still alive, but keeping himself somewhere in concealment.\" \"What a bold attempt at fraud!\" exclaimed Maurice, who was completely duped by his companion\u0027s plausible statements. \"Is it not? Now I want to ask you, who know him well, what your opinion of him is. Do you look upon him as honest and straightforward?\" \"No, I don\u0027t. He\u0027s just artful enough to be up to some such game. He\u0027s deceived Mr. Ferguson, and made him think there is no one like him, so that there is no chance for me. He gets twice the salary that I do, although I have been in the business as long as he.\" \"And yet you look as if you had a good business turn,\" said Mr. Grey, with skillful flattery. \"I know as much of business as he does. I am sure of that.\" \"Mr. Ferguson must be a weak man to be so easily duped. If it were my case, he wouldn\u0027t find it so easy to impose upon me.\" \"I don\u0027t know how he does it, but he has cut me out entirely. Mr. Ferguson won\u0027t hear a word against his favorite.\" \"You are unfortunate, but we are in the same position there. He has conspired to keep you down, and he is now plotting to extort money from me by his preposterous claims.\" \"Do you think he stands any chance?\" \"No. But if he produces this paper of his, he might bring a suit against me which would be annoying. You know there are some people who are always ready to believe the worst, and I dare say he would convince some that his claims were just, and that I had acted fraudulently. Now that would be unpleasant to me, though I should be certain to win at law.\" \"Of course. What are you going to do about it, Mr. Grey?\" \"To ask your assistance, for which I shall be ready to pay.\" \"But what can I do?\" asked Maurice, in some astonishment. \"I will tell you,\" said James Grey, hitching his chair nearer that of his young visitor; \"but, of course, you will keep my confidence?\" \"Certainly.\" \"The whole strength of his case lies in this forged paper. Let me get possession of that, and he can do nothing.\" \"I see.\" \"Now you know where he boards, probably?\" \"Yes.\" \"Can\u0027t you contrive to get access to his room, search for the paper—very likely it is in his trunk—and, when obtained, bring it to me? I am ready to give a hundred dollars for it.\" \"I don\u0027t know,\" said Maurice, slowly. \"I am afraid it would be difficult.\" \"But by no means impossible. I will give you ten dollars now, and that you may keep, whether you succeed or not. If you succeed, you shall have a hundred dollars besides. Do you agree?\" As he spoke he held a ten-dollar bill out temptingly. It was a temptation that Maurice Walton, with but fifty cents in his pocket, could not resist. He wanted money sorely. Besides, he had a chance to win a hundred dollars additional, and this would enable him to gratify several wishes which had hitherto seemed unattainable. \"I will do my best,\" he said, holding out his hand for the money. There was a quiet flash of triumph in the cold, gray eye of his older companion, as he placed the bill in Maurice\u0027s hands. \"I need not caution you to be secret,\" he said. \"I shall not say a word to any one,\" answered young Walton. James Grey rubbed his hands gleefully, as Walton left the room. \"The scheme promises well,\" he soliloquized. \"My worthy nephew, I may checkmate you yet.\"","sourceLink":"http://novel.tingroom.com/ertong/3019/83487.html","bookId":262,"book":{"id":262,"title":"Tom, The Bootblack or, The Road to Success","description":"简介： How do you feel this morning, Jacob? asked a boy of fifteen, bending over an old man crouched in the corner of an upper room, in a poor tenement-house, distant less than a quarter of a mile from the New York City Hall....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3019","creation":"Aug 1, 2019 12:18:28 AM","modification":"Aug 1, 2019 12:18:28 AM"}}
