{"id":7932,"no":25,"title":"CHAPTER XXV. MAURICE BETRAYS HIMSELF.","content":"\"In this way,\" answered Mr. Ferguson. \"Your uncle did not register his name at the Burnet House till after his encounter with you in the street. Probably his reason for changing his hotel was to prevent your examining the register of the one at which he was previously staying, and so ascertaining his real residence. The same motive would lead him to give the wrong address in the new hotel.\" \"Yes, sir; that seems likely, but how is that going to help me?\" \"You must try to ascertain where he formerly stopped. Go to the principal hotels, and examine their registers for a fortnight back. Probably that will cover all the time in which your uncle is likely to have arrived.\" \"Yes, I see,\" said Gilbert, brightening up. \"It is a good plan, and I think it will succeed.\" \"I hope so, for your sake.\" Gilbert lost no time in following out his employer\u0027s suggestion. First, he went to the Gibson House; but he examined the books to no purpose. He looked back as far as twenty days, but could not find the name of James Grey. \"He can\u0027t have stopped at this hotel,\" he said to himself. Next he went to the Spencer House. It occurred to him that possibly his uncle\u0027s name might be recognized, so he asked the clerk: \"Has a gentleman named James Grey stopped with you lately?\" \"Grey? I believe so,\" said the clerk, after a moment\u0027s reflection. \"He left us about a week since.\" \"Yes, it is the same,\" said Gilbert, eagerly. \"Was he here long?\" \"Only two or three days.\" This, of course, made the examination easy. In point of fact, ten days back Gilbert found recorded on the books: James Grey, Clayton, Illinois. \"Clayton, Illinois,\" repeated Gilbert; \"that\u0027s a place I never heard of. I wonder where it is? It can\u0027t be much of a place. Can you tell me in what part of Illinois Clayton is?\" he inquired of the clerk. \"Never heard of it,\" said that official, indifferently. \"Clayton, Illinois?\" said a gentleman who had just come up to leave his key. \"I can tell you where it is.\" \"Where, sir?\" \"It is a small town on the Mississippi river, north of Alton—I should think about thirty or forty miles. I never was there, but I\u0027ve passed it while ascending the river on a steamboat.\" \"Thank you, sir,\" said our hero. As may be supposed, he was not a little elated at his discovery. In spite of James Grey\u0027s prudent precautions, his nephew felt that he had not been shrewd enough. St. Louis had not answered the purpose. The insignificant place where he had supposed himself safe from pursuit, was now known, and Gilbert determined that there should be no cessation of hostilities. He was resolved to follow up the attack, and force his uncle to do him justice. Meanwhile Maurice Walton could not but observe that something was going on. He noticed Gilbert\u0027s absence from the store, and his frequent interviews with Mr. Ferguson, and rightly inferred that they had something to do with James Grey. \"I wonder if he has found out the loss of the paper?\" he thought. \"He must have discovered it, and that\u0027s why he is in such a flutter. If it\u0027s spoilt his chances, so much the better. I owe him a grudge, and, if I\u0027ve put a spoke in his wheel, I shall be glad.\" One incident, having its effect upon the narrative, has not yet been recorded. When James Grey left the hotel, carpet-bag in hand, he chanced to meet Maurice, just before he took a hack to the depot. An idea flashed upon him that Maurice might be useful to him as a spy upon his nephew, and might be engaged to watch and give him timely notice of his movements. He therefore paused, and Maurice perceived that he wished to speak with him. \"Good-day, sir,\" he said. \"Good-day. I am glad to meet you, for I have something to say to you. That paper you brought me was not the right one.\" \"Not the right one?\" repeated Maurice, in alarm, for he thought Mr. Grey was about to demand back the hundred dollars, which he would have been very sorry to surrender. \"No; the rascal had been cunning enough to put the original in Mr. Ferguson\u0027s safe, and leave only a copy in his trunk. The paper you brought me was the copy.\" \"Does Gilbert say so?\" \"Yes.\" \"Perhaps he lies.\" \"So I thought; but the date on the paper confirms his story.\" \"It wasn\u0027t my fault. I think I earned the money.\" \"You can keep it. I have no intention of asking it back; but I shall want to employ you further.\" \"To get the paper from the safe?\" \"Can you do it?\" \"I am afraid not. If I were caught doing it, I should be dismissed, and perhaps arrested.\" \"If you succeed, I will give you another hundred dollars.\" \"I should like the money.\" \"Watch for a good chance. You may be able to do it unobserved.\" \"Are you going to leave the city?\" \"Yes, I leave at once.\" \"Suppose I get the paper—what shall I do with it?\" \"Send it by mail to my address.\" \"Where is that, sir?\" \"Can I rely upon you not to communicate it to Gilbert Grey? It would do him a great deal of good.\" \"Then I certainly won\u0027t tell him,\" said Maurice, decidedly. Knowing the state of feeling between Maurice and his nephew, Mr. Grey felt satisfied with this assurance. \"I don\u0027t want you even to put it on paper,\" he continued. \"Gilbert might get hold of it. You can remember it without.\" \"Very well, sir.\" \"It is Clayton, Illinois, to the north of Alton, on the river. Now, can you remember Clayton?\" \"I will think of Henry Clay.\" \"That will be a good reminder. As to the State, you are not very likely to forget that. Now, if you find the paper, inclose it in an envelope, and mail it to James Grey, Clayton, Illinois. As soon as I receive it, I will send you, or bring you, a hundred dollars.\" \"Very well, sir; I will try, but I am not sure whether I shall succeed. It\u0027s harder than the other job.\" \"Are you suspected of that?\" \"I don\u0027t think so.\" \"That is not all. I shall want to learn about the fellow\u0027s movements. He may be planning some conspiracy, of which it is important that I should be apprised. Now, you are in the same office, and likely to know what is going on.\" \"Yes, sir.\" \"I want you to watch carefully, and, whenever you learn anything worthy my knowing, write me immediately, to the address I have given you. See if you remember it.\" \"Clayton, Illinois.\" \"For every letter containing information of value, I will send you ten dollars. I shall not write direct from Clayton, lest the letter be seen, but I will manage to have my letters posted from St. Louis. That is where Gilbert supposes I am living.\" \"Perhaps you had better direct to my boarding-place, and not to the store.\" \"A good suggestion. Give me your address.\" James Grey took it down in his memorandum book. \"I believe that is all,\" he said. \"Remain faithful to my interests,\" he added, \"and I will take care you do not regret it.\" \"I shall not regret it, if it interferes with Gilbert Grey.\" \"If you are his enemy, you cannot harm him more than by devoting yourself to my service.\" \"I will do it.\" James Grey now hurried away, and Maurice went back to the store. He thought himself unsuspected of the theft of the paper, but he did not long remain so, and it was through his own imprudence that it happened. The black mustache which he had used as a disguise he thrust carelessly in his vest pocket. One day in the store, in drawing out his watch-key, the mustache came too, and dropped on the floor. Maurice stooped hastily to pick it up, but not till Gilbert had seen it. The latter at once remembered the servant\u0027s description of the young man who called for his opera-glass. \"How long have you had that mustache, Maurice?\" he asked, pointedly. \"I bought it yesterday,\" muttered Maurice, in confusion. \"I thought you might have had it longer,\" said Gilbert, quietly. Maurice did not answer. \"Now I know who stole the paper,\" thought our hero. \"I must be on my guard against him.\" He said nothing further; but Maurice knew that he was suspected, and it only incensed him the more against his fellow-clerk. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/3019/83491.html","bookId":262,"book":{"id":262,"title":"Tom, The Bootblack or, The Road to Success","description":"简介： How do you feel this morning, Jacob? asked a boy of fifteen, bending over an old man crouched in the corner of an upper room, in a poor tenement-house, distant less than a quarter of a mile from the New York City Hall....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3019","creation":"Aug 1, 2019 12:18:28 AM","modification":"Aug 1, 2019 12:18:28 AM"}}
