{"id":82861,"no":21,"title":"Page 21","content":"Gemma had dosed off for a few minutes when the horizon was pink with the promise of the sun. While she was sleeping, the mage must have slipped out. When she opened her eyes he was gone, although the gold thread was still there, wound around a spindle.\\n\\n Gemma’s body creaked and ached as she pushed herself off the ground—a most uncomfortable sleeping position—and approached the spinning wheel.\\n\\n She held her breath, releasing it only when she reached out to touch the metallic thread. It was real, and it was most assuredly gold—or at least close enough that no one would know the difference.\\n\\n “Not a hallucination then,” Gemma said, turning to the window to greet the sun with a tame smile. Her future was still dark, but she would survive the day, which was more than she hoped for. With extra time, she could gather better escape tools.\\n\\n Gemma was crouched in front of the spinning wheel, eyeing it with escape plans in mind, when she heard voices in the hallway. The door thudded and clanked as it was unlocked and unbarred. Gemma had just enough time to hide her bent fork and dull knife in her skirts before the door opened.\\n\\n King Torgen stood in the doorway. His bloodshot eyes were immediately drawn to the gold thread.\\n\\n “She can?” someone said out in the hallway. A handsome young man Gemma recognized as Prince Toril peered over his father’s shoulder. The prince was…horrified. He looked from the gold to his father, dismay twisting his face.\\n\\n “Gemma Kielland. Well done,” King Torgen said, a delighted smile crawling across his face as he stormed into the room.\\n\\n Gemma nervously backed up until she hit the wall before she stooped in a curtsey.\\n\\n “You have indeed managed to spin flax into gold,” King Torgen said, caressing the costly thread. “Just as I asked.”\\n\\n Gemma curtsied again rather than risk speaking.\\n\\n “You will do it again.”\\n\\n “What, My Lord?” Gemma said. She wasn’t surprised but fear and disappointment still shot through her like an arrow.\\n\\n “Guards, take her back to the dungeons. We will begin preparations for her next task,” King Torgen said, smiling cruelly at Gemma.\\n\\n “Yes, My Lord,” the guards standing outside the room murmured. They organized themselves around Gemma and escorted her out of the room and down the hallway.\\n\\n She was surprised when the guard captain fell in step with her.\\n\\n “I won’t ask how you did it,” he said, staring straight ahead. “But I pray, miss, that you can do it again.”\\n\\n “We shall see,” Gemma grimly said. “Prince Toril looked…displeased,” she said as they turned a corner and headed down the wretched spiral staircase that would take them to the dungeons.\\n\\n “Yah. He managed to nearly talk King Torgen into releasing you.”\\n\\n Gemma stopped walking. “He what?”\\n\\n “Prince Toril was pushing for your release. He almost had it, too, until King Torgen saw the gold.”\\n\\n Gemma pinched her eyes shut. She would have been free? If the mage hadn’t done this impossible task, she would be free to go.\\n\\n “…Miss?” the captain said.\\n\\n Or would she? The King was stubborn. It was likely he would come after her again as soon as Prince Toril’s back was turned.\\n\\n I can still survive this. The mage really did save me, Gemma decided.\\n\\n “You can’t do it a second time, can you?” the captain said.\\n\\n Gemma squared her shoulders and lifted her chin. “No,” she said. “But we’ll see who’s crowned the victor.”\\n\\n “Pardon?”\\n\\n “It is nothing, sir,” Gemma said, walking again. She was quiet until they reached the dungeons.\\n\\n “We can move you to a more comfortable cell. The first one has a straw pallet. Take her there,” the captain told his men.\\n\\n Realizing Lady Linnea would have a harder time finding her if she moved cells, Gemma was quick to say, “Please, I would prefer to return to my original cell. If you don’t mind, sir,” she said.\\n\\n “Are you certain? You would be more comfortable,” the captain said.\\n\\n “I’m positive, but thank you.”\\n\\n The captain shrugged and nodded to his men, who escorted Gemma farther down the cell block.\\n\\n “Why did you let the…stranger into my room last night?” Gemma asked when they stopped outside her cell.\\n\\n “What?”\\n\\n “Didn’t you allow a visitor inside?” Gemma asked.\\n\\n “Miss, if you go missing, my life and the lives of my men are forfeit. I pity you, but neither I nor my men would allow someone in your room while you were spinning. Did something happen?”\\n\\n “No, I apologize. It must have been a dream,” Gemma said.\\n\\n “Of course,” the captain said. He opened the dungeon door and bowed his head when Gemma slipped inside. “Someone will bring you breakfast shortly,” he said.\\n\\n “Thank you.”\\n\\n The captain nodded and closed the dungeon door with a clank.\\n\\n Gemma shivered at the scratch marks and blood splattering the back of the dungeon door. She picked up her stool and put it under the window before climbing it. She stood on her tip-toes to peer outside. \\n\\n","sourceLink":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4/page-21.html","bookId":1805,"book":{"id":1805,"title":"Rumpelstiltskin (Timeless Fairy Tales #4)","description":"Storyline: When 17-year-old Gemma, a seamstress, is ordered by the insane King Torgen to spin straw into gold or be put to death, she knows her life is forfeit. Unwilling to give up, Gemma tries to escape her prison, earning her the respect of the mysterious mage, Stil. Stil offers to complete the impossible task…for a price. \\n Greedy and unsatisfied, King Torgen demands more and more straw to be spun into gold, and decrees that he will “reward” Gemma by marrying her. With death or marriage to a crazed king clouding her future, Stil offers Gemma a bargain that seems too good to be true. \\n Will Gemma’s trust in Stil be her downfall, or will he defy the entire country to save her?\\n","cover":"https://allnovel.net/images/rumpelstiltskin-timeless-fairy-tales-4.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:45:31 PM"}}
