{"id":82866,"no":26,"title":"Page 26","content":"The captain didn’t reply. Instead, he let go of Foss and reached out to help Gemma stand. He held her arm while walking her back to her cell—Gemma wasn’t sure if it was because he was supporting her or keeping her from running away. When they reached Gemma’s cell, Gemma slipped inside. She picked up her stool and set it in a corner. “Is he alright?” Gemma asked, gesturing to her untouched breakfast tray. “He is uninjured,” the captain said, reaching for the cell door. “I’m sorry,” he said. “I would let you go if…I’m sorry.” Gemma sat on her stool. “There’s nothing to apologize for. You are not the one who has imprisoned me,” she said. The captain was silent as he studied Gemma for a few moments longer before he shut the cell door with an ominous clank. Gemma flinched, but held herself together. The brief escape made the dungeon feel even colder and darker. The stench made her stomach roll, and the silence was suffocating. “If I got out once, I can do it again. I will just have to make certain I do it so no one can be blamed,” she vowed. “Gemma. Gemma, I am a genius, and you must tell me that,” Lady Linnea called, almost falling over the wall above Gemma’s cell. “Buying up the flax has worked marvelously—even if that idiot Prince Toril almost ruined it all by having the flax sent to the palace. A chicken has more sense than him. He is—what’s wrong?” Lady Linnea said when she realized Gemma wasn’t responding. “Hm? Nothing. Sorry, I was sleeping,” Gemma lied, unfolding from the corner into which she was pressed. She moved the stool so it was beneath the window and stood on it, looking straight up at her friend. “Really?” Lady Linnea said doubtfully. “You look pretty dreadful.” “How did you hide the purchased flax from King Torgen?” Gemma asked. (It was easier to distract Lady Linnea than to lie outright to her. The beautiful lady was observant, and it was likely that she would haul off and hit Gemma if she knew Gemma had the chance to escape and chose to returned to her cell.) “Oh! It was brilliant. I ordered straw to be bought, and we spread it on top of the cart of flax fibers!” Lady Linnea beamed. “Prince Toril got the stable servants to agree not to tell King Torgen,” she grudgingly added. “I see,” Gemma said. “I brought you something,” Lady Linnea said, reaching for something out of sight. “Here,” she said, passing a small hand hatchet through the window grate. “It’s not very sharp, but it was the only one I found that I thought could fit through the bars,” Lady Linnea said. “Thank you,” Gemma said. She smiled as she ran a finger along the axe-head. “This will be useful.” “Also, I thought you might have to bribe someone at some point, so take this,” Lady Linnea said, shoving her fingers through the grille to offer Gemma a plain, gold ring. “I cannot take your jewelry, My Lady,” Gemma said. “Pft, this old thing? I received it at party in Loire. Means nothing to me—it’s too small for my fingers anyway. Take it, I’ll never wear it,” Lady Linnea said, wriggling her fingers to wave the ring in Gemma’s face. Gemma stared at Lady Linnea for a few moments before reluctantly taking the ring. “Thank you, My Lady,” she said before Lady Linnea pulled her hand back through the bars. “You’re welcome. Oh! One more thing. An old lady told me to give you this,” Lady Linnea said, stuffing a small pouch through the bars. “An old woman?” Gemma asked after the pouch nearly fell on her face. She caught the pouch and opened it. Inside was a number of sewing needles carefully jabbed into a piece of fleece. “She approached me when I was walking in our garden with Mama and called me a blood thirsty barbarian! Thankfully, Mama was talking with Jentine and didn’t hear.” “Ah, it was Grandmother Guri,” Gemma said, brushing the needles with her forefinger. “Grandmother Guri? The woman who taught you to sew?” “Yes.” Lady Linnea made a tisking noise. “It’s a shame she didn’t tell me as much. I would love to converse with such an interesting woman.” “She is unusual in that way,” Gemma said, studying the needles. “So why did she give you…sewing needles?” Lady Linnea asked, pressing her face against the ceiling-window grate so she could have a better look. “I don’t know. Did she say anything?” “No. Perhaps she meant for you to use them as lock picks?” Gemma slid the needles back in the pouch. “I don’t think they’re they right shape, My Lady.” “You can always try. Anyway, I’ve got to go. Mama is getting suspicious. She tried forcing me to take lessons again today, but Papa said I didn’t have to. He feels bad about leaving you—as he should,” Lady Linnea snorted like an antsy horse. “Thank you for the hatchet and ring, and for delivering the needles,” Gemma said. “Of course. I will see you soon. Be well!” Lady Linnea said before she darted from Gemma’s sight.","sourceLink":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4/page-26.html","bookId":1805,"book":{"id":1805,"title":"Rumpelstiltskin (Timeless Fairy Tales #4)","description":"Storyline: When 17-year-old Gemma, a seamstress, is ordered by the insane King Torgen to spin straw into gold or be put to death, she knows her life is forfeit. Unwilling to give up, Gemma tries to escape her prison, earning her the respect of the mysterious mage, Stil. Stil offers to complete the impossible task…for a price. Greedy and unsatisfied, King Torgen demands more and more straw to be spun into gold, and decrees that he will “reward” Gemma by marrying her. With death or marriage to a crazed king clouding her future, Stil offers Gemma a bargain that seems too good to be true. Will Gemma’s trust in Stil be her downfall, or will he defy the entire country to save her?","cover":"https://allnovel.net/images/rumpelstiltskin-timeless-fairy-tales-4.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:45:31 PM"}}
