{"id":82891,"no":51,"title":"Page 51","content":"“What? No. A normal fire does the job,” Stil said, closing the tent flap. He cleared his throat. “I’m home, you finicky thing. Stop playing games and open up,” he said before smacking a side of the tent.\n Gemma winced, fearing it would collapse under the abuse, but when Stil lifted the tent flap, it opened up into a large parlor. It contained a marble fireplace with a cheerfully crackling fire, two padded settees, two arm chairs, piles of cushions, and a short table not more than two feet high that held a silver tea set.\n “Sorry, someone must have been creeping around here—it was guarding itself. We can check Pricker Patch’s teeth later to find out if he ate the intruder,” Stil said, stepping aside so Gemma could enter first.\n Gemma hesitantly crawled through the narrow opening, into the elegant room. She winced when she set her snow covered feet on the immense, red, patterned rug that covered the ground.\n Stil’s tastes were perfectly expressed by the room.\n The wood on the settees and the armchairs, as well as the legs of the table, were ornately carved and stained such a deep, rich brown-red color they glowed. The walls were some sort of plaster, but there were moldings where it met the plaster ceiling and the wooden floor.\n Gold candlesticks, welded to resemble unfurling vines and flowers, were bolted to wall. They held bee’s wax candles that scented the air with sweet honey.\n Gold-leafed instruments, a tapestry, and paintings hung from the wall. Even the frames were of the highest quality.\n As Gemma looked around the room with big eyes, she realized Stil hadn’t been thoughtlessly bemoaning the loss of great craftsmanship. And he was obviously an extremely talented, well-paid craftmage.\n “Home at last,” Stil said, thoughtlessly trekking snow across his costly carpet and dumping his cloak and belongings on one of the fine settees. “What’s wrong?” he asked Gemma as he kicked off his boots.\n Gemma gripped her borrowed silk bag that held the wool cape she was making for the craftmage. “Nothing,” she said. “It’s beautiful.”\n Stil smiled as he combed his silky black hair with his fingers. “Thank you. With my vocation, you think I would be sick of looking at crafted goods and merchandise, but I’ve learned it’s important to stock my place with the best. It feeds my soul,” he said, groaning when he stretched his arms above his head. “You must be an ice block. Come. You’ll want to use the bath, I assume,” Stil said, leading the way through a great door.\n “The what?” Gemma asked, carefully shedding her footwear and cloak at the door before trailing after Stil. She stopped at the threshold of the room the craftmage had entered.\n The bathroom was just as beautiful and over-the-top as the parlor.\n The bathtub was immense. Gemma suspected Pricker Patch—if he could be goaded into going down on his knees—could comfortably bathe in it. There were gold, brocade curtains that could be pulled around the tub for privacy, a chandelier, several gold-framed mirrors, a well-padded arm chair, and two white vanities accented with gold.\n An iron grid was built above a fire. The grid was laden with rocks, which the flickering flames licked, heating the rocks.\n “Spend as long as you want,” Stil said, pulling a rope. To Gemma’s astonishment, part of the ceiling pulled down, and water rushed from it, filling the tub. “I have business I must attend to in the rest of the house. When you’re finished, go back to the parlor—there will be tea and refreshments waiting for you,” Stil said, releasing the rope—cutting off the water—and using a pair of tongs to remove stones from the fire. He dropped them into the tub—making steam hiss whenever a rock hit the water.\n “I’ll find something for you to wear—you must be sick of your uniform by now—and leave it by the door, but here is a robe and towels. Explore. Use anything you want here. I don’t know what I have, sorry,” Stil said.\n “Thank you,” Gemma said.\n Stil smiled and pushed Gemma’s hair-band—which had fallen low over her eyebrows—up with two fingers. “Of course. I will leave you to it. You look dead on your feet. Enjoy,” he said, leaving the room with a flourish.\n Gemma hesitatingly made use of the bathroom. She felt far too self-conscious to do more than cast a wondering eye at the various bottles, bath salts, perfumes, creams, and scrubs lined up on one of the vanities.\n The bathwater was warm and restored feeling to Gemma’s numb fingers and toes. It was a delight to wash off the bits of dungeon grime she had been wearing for the past few weeks, but she moved quickly, feeling like an intruder in a lady’s private powder room. \n","sourceLink":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4/page-51.html","bookId":1805,"book":{"id":1805,"title":"Rumpelstiltskin (Timeless Fairy Tales #4)","description":"Storyline: \n When 17-year-old Gemma, a seamstress, is ordered by the insane King Torgen to spin straw into gold or be put to death, she knows her life is forfeit. Unwilling to give up, Gemma tries to escape her prison, earning her the respect of the mysterious mage, Stil. Stil offers to complete the impossible task…for a price. \n Greedy and unsatisfied, King Torgen demands more and more straw to be spun into gold, and decrees that he will “reward” Gemma by marrying her. With death or marriage to a crazed king clouding her future, Stil offers Gemma a bargain that seems too good to be true. \n Will Gemma’s trust in Stil be her downfall, or will he defy the entire country to save her?\n \n","cover":"https://allnovel.net/images/rumpelstiltskin-timeless-fairy-tales-4.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:45:31 PM"}}
