{"id":82897,"no":57,"title":"Page 57","content":"“No. I sew for other people, not myself. That is the way it has always been,” Gemma said. “I wonder if it has to do with that blasted sense of sacrifice you have. You sew for other people—hah!” Stil said, shaking his head. “I will have to introduce you to my fellow craftmages. They will love you, and you will never have to worry again about money. You practically can spin straw into gold—that is, you can make an item normally useless into a priceless treasure,” Stil snorted. Gemma shrugged, not quite believing his praise. “Thank you, Gemma. You have given me something so valuable it cannot be fathomed,” Stil said, dragging his eyes from the cloak. “Thank you for all your help…and for using your magic on my behalf,” Gemma said. Stil’s eyes glowed as a soft, tender smile stole across his lips. He crossed the room to stand in front of her. He slid an arm around her, scooping her against her chest, and he lowered his face—his lips, more correctly—towards her. Gemma came to a realization. Stil quite possibly found her attractive. The incoming kiss told Gemma he might actually find her more than attractive; he perhaps even liked her, or fancied her. She immediately rejected the idea. It was preposterous. Magic users never fell in love with civilians. There was the occasional heart-breaking love story, where a mage or enchanter fell in love with a princess or some such nonsense, but they were rare. No. Magic users loved other magic users. It was the rule. Gemma, paralyzed where she stood, waited for Stil to back off to declare it all a joke. When he was so close, she could feel his breath on her lips, Gemma exploded backwards. “No,” she said, shaking a finger at Stil as if he were a miscreant dog. “What?” Stil asked, tilting his head. “Whatever you’re doing, NO.” Stil tilted his head in the other direction. “What do you think I’m doing?” he asked, taking a step towards Gemma. Gemma rushed to put the settee in between them. “You,” she said, “are…I don’t know.” “I think you do know.” “No, I don’t,” Gemma said, shaken by the ordeal. Mages didn’t go around almost kissing people. It just wasn’t done. Wars could be started that way! “You are a smart girl. Try to figure it out. I think you will find there is one easy conclusion.” “Except that conclusion is impossible,” Gemma squeaked, scared out of her usual indifference when Stil stepped around the settee. Gemma circled it to keep it between herself and the mage. “Why is it so impossible that I should love you—,” “NO!” Gemma shouted. “Oh, come now. You can’t really think I am doing this because I’m a flirt,” Stil chuckled before he lunged around the settee. Frightened by the throaty noise, Gemma fled to the far side of the room, scampering behind the second settee. “Mages don’t fall in love with normal people!” “In your defense, you are not normal,” Stil said, strolling across the parlor. “You…are,” Gemma struggled for a moment. “Blinded by your, ah, inaccessibility to other mages. What you’re feeling isn’t real.” “Gemma.” Gemma was starting to get a better hold on herself and was able to bring down the octave of her voice. “I thought you were acting oddly. The fine clothes and the bedroom, accompanying me to the border instead of sending me on my way like any proper storybook magician. Clearly, you are under some sort of mental strain,” Gemma said, faking out Stil to make him circle around the settee again, leaving her to flee in the opposite direction. When she was safe on the other side of the settee, she smoothed her dress and lifted her chin. “Love affairs between mages and seamstresses just aren’t done,” she finished primly before leaping out of the way when Stil tried to pounce on her. “Gemma.” “What?” “Why else do you think I demanded your firstborn child as a payment for spinning?” Stil said, carefully enunciating the words. Gemma blinked. “I don’t understand.” “If I didn’t love you, why would I want your firstborn?” “To be a house-servant? I don’t know! Magic folk are all eccentric. We did establish that I don’t want children, so it hardly matters,” Gemma said. “It matters because my required payment means if you ever change your mind, I will be your child’s father.” Gemma screwed up her face. “You are the most ridiculous mage—,” her words died on her lips as she recalled Stil’s odd wording. She hadn’t paid much attention—mostly because she didn’t particularly want children, and the idea of getting married was so far off and unlikely after all she went through it wasn’t like it mattered. But the wording. He had said, “Your firstborn child will be mine.” Gemma narrowed her eyes. “You,” she growled. Stil’s eyebrows popped up. “So, now you’re mad?”","sourceLink":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4/page-57.html","bookId":1805,"book":{"id":1805,"title":"Rumpelstiltskin (Timeless Fairy Tales #4)","description":"Storyline: When 17-year-old Gemma, a seamstress, is ordered by the insane King Torgen to spin straw into gold or be put to death, she knows her life is forfeit. Unwilling to give up, Gemma tries to escape her prison, earning her the respect of the mysterious mage, Stil. Stil offers to complete the impossible task…for a price. Greedy and unsatisfied, King Torgen demands more and more straw to be spun into gold, and decrees that he will “reward” Gemma by marrying her. With death or marriage to a crazed king clouding her future, Stil offers Gemma a bargain that seems too good to be true. Will Gemma’s trust in Stil be her downfall, or will he defy the entire country to save her?","cover":"https://allnovel.net/images/rumpelstiltskin-timeless-fairy-tales-4.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:45:31 PM"}}
