{"id":82846,"no":6,"title":"Page 6","content":"“It’s real,” Otto said after biting it.\n “Gemma,” Peder said. “Gave it to her mother—woman can’t hide a thing from me. I’m too smart,” Peder said. He tried to point to his forehead but instead almost jabbed himself in the eye.\n “And how did Gemma come by this great fortune?” Big Tim—a stooped older man who used to be the size of a baby giant but had shrunk in his old age—asked.\n “She finished a dress for her great mistress,” Peder said, rolling his eyes. “‘Parrently the lady liked it so much she gave it to her on top of room and board.”\n “A gold coin for a dress?” Small Tim thundered.\n “Yep,” Peder said. “Where’s my honey wine?”\n Otto cast the drunkard a look of pity. “Are you sure you do not want to keep it? I doubt Lady Linnea would often repeat such kindness.”\n “Nope! Gemma’s getting paid every time now. Some other noble tried hiring her, but the Lovlands like Gemma so much they said they would pay if she stayed,” Peder said, propping his elbows up on the bar. “Now, my honey wine!”\n The floor creaked and groaned as Otto disappeared in a back room.\n “What do you think Gemma really does for the nobles?” asked Alf—a squinty-eyed man who had an unfortunate resemblance to a weasel.\n “I already said she makes dresses,” Peder said, his forehead creasing.\n “It is well known that Gemma is the personal seamstress for Lady Linnea,” Big Tom attested.\n “You can’t know for certain,” Alf said, eagerly leaning forward. “The young lady rarely leaves her house, so nobody’s ever seen these great dresses Gemma is said to make.”\n “Stop trying to cause trouble, Alf,” another bar patron warned in a rumbling voice, giving a meaningful glance to the four royal guards who were seated around a table at the back of the room.\n “I ain’t causing no trouble!” Alf said. “I’m just saying sweet Gemma might not be the dressmaker she’s lauded to be.”\n “Don’t you be doubting my daughter,” Peder declared as Otto set his bottle of honey wine in front of him. He ignored the cup Otto presented him with and took a swig directly from the bottle. “She’s a good girl. I think,” Peder said, blinking as he tried to make his rusty mind work.\n “Maybe she’s filling Lady Linnea’s ears with gossip about us common folk,” Alf said.\n Peder started to complain, but he was already taking another swig of his wine, which sufficiently distracted him.\n Small Tim, taking pity on the girl who wasn’t present to defend herself, shook his shaggy head. “I’ve known Gemma since she was a wee girl. Gemma wouldn’t carry tales. If she’s not making dresses, it’s likely she’s being paid to keep the poor Lady Linnea company. The lady has been cooped up for the past few years. She must feel like a stall-bound horse.”\n “Gemma makes dresses,” Big Tim said, firmly. “My granddaughter Sissel works at the Lovland house, and she’s seen what Gemma makes. She’s a talented girl.”\n “I won’t believe her talent until I see it with my own eyes,” Alf said.\n “Of course she’s talented!” Peder said, smacking his honey wine on the bar with more force than necessary. “She’s my daughter! She’s so talented, the Lovlands paid her gold coin to stay,” Peder said, waving a finger at Alf.\n “Like I would believe the words of a drunkard,” Alf said with a contemptuous sneer.\n “My Gemma has more talent in one hand than you have in your whole self, Alf Skeie!” Peder said. “Why, she’s so talented she could work for the King himself!”\n “Peder, settle down, and enjoy your drink,” Small Tim said, glancing at the soldiers’ table.\n Alf rolled his eyes. “You’re farting with your mouth, Peder.”\n “You!” Peder roared.\n “Peder, be quiet, you fool,” Big Tim hissed “No! Not when someone doubts my fortunes!” Peder said.\n “I was insulting your daughter,” Alf said.\n “That, too!” Peder said. “Gemma could turn rags into the finest linen. She’ll make me rich!”\n “You’re just an old, drunk fool with a beggar daughter,” Alf said.\n “What did you call me?” Peder shouted, staggering into a standing position and knocking a stool over.\n The rest of the bar patrons quieted down and looked to see what trouble was brewing.\n “You are just jealous. My daughter is so talented she could, she could…she could spin straw into gold!” Peder declared.\n Alf snorted and opened his mouth to reply, when a stranger clamped a strong hand on his shoulder.\n “What,” Alf started, turning around.\n A tall man stood behind him. He wore a plain, black cloak with the hood pulled up. Alf couldn’t see much of the man’s face, but he was harpooned by the man’s odd-colored eyes and strong grip. The stranger held himself like a competent man—or worse, someone important.\n “A drunkard may utter foolishness in his inebriation, but it is a spiteful fool who goads him on. Shut your mouth, or I will shut it for you in retribution for ruining my evening,” the stranger said. \n","sourceLink":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4/page-6.html","bookId":1805,"book":{"id":1805,"title":"Rumpelstiltskin (Timeless Fairy Tales #4)","description":"Storyline: \n When 17-year-old Gemma, a seamstress, is ordered by the insane King Torgen to spin straw into gold or be put to death, she knows her life is forfeit. Unwilling to give up, Gemma tries to escape her prison, earning her the respect of the mysterious mage, Stil. Stil offers to complete the impossible task…for a price. \n Greedy and unsatisfied, King Torgen demands more and more straw to be spun into gold, and decrees that he will “reward” Gemma by marrying her. With death or marriage to a crazed king clouding her future, Stil offers Gemma a bargain that seems too good to be true. \n Will Gemma’s trust in Stil be her downfall, or will he defy the entire country to save her?\n \n","cover":"https://allnovel.net/images/rumpelstiltskin-timeless-fairy-tales-4.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:45:31 PM"}}
