{"id":82902,"no":62,"title":"Page 62","content":"“If you are not yet twenty-five, and if Lady Enchantress Angelique met you with her master when you were twelve or thirteen, you must be freshly out of the Conclave school,” Gemma observed.\\n\\n “And now you are accusing me of being a green mage! No. I went through the schooling system quite quickly and finished my apprenticeship by the time I was eighteen,” Stil said, his voice wry but at a much lower volume.\\n\\n “Impressive. You must be the genius the Lady Enchantress says you are.”\\n\\n Stil ran a hand through his feathered, black hair—it was short again—and sighed. “I don’t know about genius. I would reserve that word for people like Angelique’s master enchanter, Evariste. It is true, though, that I am the most gifted craftmage in the past few decades. Possibly the century. Which isn’t quite as impressive as it sounds. Craft magic is useful for luxuries—protection charms in jewelry, clothes spelled to dazzle, that kind of thing—and for everyday work—like wagon wheels spelled to last extra long or wood furniture charmed to resist fire.”\\n\\n “But when one reaches your level, your usefulness expands,” Gemma guessed.\\n\\n Stil reluctantly nodded. “I can place higher-level charms and magic into objects, and I am one of a few living craftmages who can spell weapons.”\\n\\n Gemma narrowed her eyes. “If others can spell weapons, why would Angelique call you a genius?”\\n\\n Stil made a face at Gemma. “I don’t like to boast,” he said, “but I can bespell weapons faster with higher spells and at a greater rate than anyone else. I could spend a day spelling a hundred weapons to hold lightning magic. The other mages would take an hour just to produce one or two.”\\n\\n “So, you could outfit an army,” Gemma said.\\n\\n Stil shrugged. “If I chose to. Most members of nobility are unaware of that particular skill of mine. They treasure me for spelled jewelry and clothes.”\\n\\n “But it would explain why you are being hunted.”\\n\\n Stil blinked. “What?”\\n\\n “If you could supply spelled weapons for an entire army in a matter of days, that would make you a great threat.”\\n\\n “To…?”\\n\\n “To this plague of darkness you spoke of. You said Angelique’s master was done away with by the masterminds, yes? Wouldn’t it be plausible that they know of your abilities and realized that if war is declared, your skills would give us a significant advantage?” Gemma asked.\\n\\n Stil was a frozen statue. He didn’t blink, even when Gemma shifted, attempting to untangle her chair from his.\\n\\n “You are right,” he said. “Gemma, you are brilliant!”\\n\\n Gemma shrugged. “I’m not sure how you missed it before.”\\n\\n Stil abruptly stood, pushing his chair away. “I need to tell Angelique this. I hadn’t thought of the possibility of actual war, but if they are planning for it, there is much to be done,” he said before glancing down at Gemma. “Don’t think our conversation about my love for you is over.”\\n\\n Gemma raised an eyebrow. “I expect you will come to your senses eventually.”\\n\\n Stil chuckled and swooped in, quickly kissing Gemma on her cheek. “Sleep well. Thank you, darling.”\\n\\n “I am not your darling!” Gemma said to his retreating back.\\n\\n The mage only laughed and disappeared through the door.\\n\\n Gemma scrubbed at her cheek and tried a tart. “Delicious,” she said, scrubbing her cheek harder when she could feel her face heating up. She cast an apprehensive look at the door through which Stil had disappeared and shook her head. “He will learn. No mage would love a poor seamstress with a drunk for a father. It’s just not possible.”\\n\\n Chapter 15\\n\\n “Are you sure you do not want to ride Pegasus with me, Gemma? The border is but a short distance away. We are nearly there,” Angelique said, seated on her unusual mount.\\n\\n The equine—Gemma found it difficult to call it a horse—had a horse-like body structure and face, but its shape was oddly fathomless thanks to its fur. The animal looked like a portion of the night sky was removed to fashion its body, for it was blue-black like night, and there were star formations dappling its hide. Eerily, its mane and tail were not made of strands of hair, but more closely resembled black and blue flames.\\n\\n “I’m fine, thank you,” Gemma said, laying a hand on Pricker Patch’s neck for reassurance.\\n\\n The glowering donkey ignored the touch and plowed forward through the light dusting of snow.\\n\\n “Don’t pet him too much, Gemma, or Pricker Patch will be too deliriously happy to eat tonight,” Stil said, adjusting his cape—the cape Gemma made for him.\\n\\n Gemma eyed the stoic donkey whose expression hadn’t budged. “I doubt that.”\\n\\n “Stil is right,” Angelique said from the back of her unnatural mount. “I have never seen Pricker Patch so content before,” she said as her dress changed into the same deep blue/purple color as the sky was taking on while the sun sank farther over the horizon. \\n\\n","sourceLink":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4/page-62.html","bookId":1805,"book":{"id":1805,"title":"Rumpelstiltskin (Timeless Fairy Tales #4)","description":"Storyline: When 17-year-old Gemma, a seamstress, is ordered by the insane King Torgen to spin straw into gold or be put to death, she knows her life is forfeit. Unwilling to give up, Gemma tries to escape her prison, earning her the respect of the mysterious mage, Stil. Stil offers to complete the impossible task…for a price. \\n Greedy and unsatisfied, King Torgen demands more and more straw to be spun into gold, and decrees that he will “reward” Gemma by marrying her. With death or marriage to a crazed king clouding her future, Stil offers Gemma a bargain that seems too good to be true. \\n Will Gemma’s trust in Stil be her downfall, or will he defy the entire country to save her?\\n","cover":"https://allnovel.net/images/rumpelstiltskin-timeless-fairy-tales-4.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:45:31 PM"}}
