{"id":82905,"no":65,"title":"Page 65","content":"Gemma pet Pricker Patch.\\n\\n “No complaints? I am already gaining ground,” Stil said, smiling.\\n\\n “I am nothing but a phase,” Gemma said. “When we rejoin the rest of the continent, you will forget Verglas and everything related to it.”\\n\\n “I won’t,” Stil said. “And I will be level with you: I find your complete lack of faith in my fidelity hurtful.”\\n\\n “You are a mage—a very wealthy one, I might add,” Gemma said.\\n\\n “I’m still a human, Gemma. I still have a heart and breathe like a man. See?” Stil said, plucking her mittened hand off Pricker Patch and sliding it under his black, wool cape.\\n\\n Gemma couldn’t feel his heartbeat, but she felt his chest rise and fall with each breath he took.\\n\\n “Is it me?” Stil asked, his eyes narrowed, his head tilted. “Am I lacking in some way? Is it something about me?”\\n\\n Gemma shook her head once.\\n\\n “Then what is it?”\\n\\n Gemma lifted her icy eyes to meet Stil’s searing blue gaze. “My life has taught me that I cannot expect happy endings.”\\n\\n No sooner were the words out of Gemma’s mouth than a piercing scream flooded the air.\\n\\n Gemma whipped around, pulling her hand from Stil’s grasp. “That was Angelique,” she said.\\n\\n “Impossible. Angelique must already be at least two miles from here. There isn’t a horse alive than can keep pace with Pegasus,” Stil said.\\n\\n “That was her voice,” Gemma argued. “I haven’t known her for long, and even I recognized it as hers.”\\n\\n By the dim light the starfire shed, Gemma could see the unease in Stil’s eyes. He was worried about her.\\n\\n “Let’s investigate,” Gemma said.\\n\\n “You’re staying here,” Stil said.\\n\\n “No,” Gemma said. “You said the rider is taken care of. There is no danger.”\\n\\n “There is less danger, but it hasn’t all disappeared. Verglas is still crawling with soldiers,” Stil argued.\\n\\n “Angelique’s scream was surely past the border. We’re wasting time,” Gemma said.\\n\\n “It may be a trap,” Stil said.\\n\\n “I can bet you it’s a trap,” Gemma agreed. “But are you willing to chance it that Angelique is unharmed?”\\n\\n Still inhaled and fussed with his sleeves as he thought. “Fine. Let me grab supplies from inside, and we can go,” he said, disappearing into the tent.\\n\\n Gemma picketed Pricker Patch to a tent pole and dragged the water to his side. “Be good. Guard the camp,” she said.\\n\\n The donkey flicked an ear but kept eating his hay.\\n\\n “Ready,” Stil said, reappeared with a length of rope hanging from his elbow. “Would you put out your starfire? I would prefer to approach the situation undetected.”\\n\\n “Sure,” Gemma said, shaking the starfire to clear away the light. When it stopped glowing, she slipped it back in a pocket on the side of her cape. It clinked like glass when it landed on several other starfires.\\n\\n “Come here,” Stil said, holding his cape out after pulling up his hood.\\n\\n Gemma frowned. “It’s not going to cover both of us.”\\n\\n “It will,” Stil promised. When he dropped the cloth over Gemma, she felt warmer—as though she were standing with her back to the fire—and was able to see through the black silk lining and wool cape as if it were made of gauze even though she knew it wasn’t.\\n\\n “Is this the invisibility you mentioned to Angelique?”\\n\\n “It is,” Stil affirmed. “We still leave a scent to track, not to mention foot prints, but it is better than nothing.”\\n\\n “How far away did the scream sound?” Gemma asked.\\n\\n “I’m not certain. I imagine it is over the Loire border, though,” Stil said, guiding them through the trees so they stayed in the shadows but didn’t brush any foliage or greenery to give away their position. Looking back, Gemma could occasionally see their footprints if the moonlight landed just so, but it was dark, and they were creeping soundlessly. She doubted anyone would see their path.\\n\\n They moved slowly, creeping their way closer and closer in the direction from which they heard the scream. They had nearly turned the wrong way when they heard the scream again.\\n\\n “Angelique,” Stil whispered.\\n\\n Though she couldn’t see his face, Gemma felt all of Stil’s muscles stiffen in worry.\\n\\n “You must really care for her,” Gemma whispered. Her slowness to speak was gone, burned away by the concern lining Stil’s face.\\n\\n “It’s not what you think,” Stil said. “Or maybe it was when I first met her and was enrolled in the Conclave’s school. She saved me, you know? But I haven’t thought of her in that way in years,” Stil said. “I outgrew it.”\\n\\n “Like you will outgrow me,” Gemma said.\\n\\n “No,” Stil said, his voice soft and patient. “I was a child back then. Now, I am a grown man. My love for you is far different and far greater.” \\n\\n","sourceLink":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4/page-65.html","bookId":1805,"book":{"id":1805,"title":"Rumpelstiltskin (Timeless Fairy Tales #4)","description":"Storyline: When 17-year-old Gemma, a seamstress, is ordered by the insane King Torgen to spin straw into gold or be put to death, she knows her life is forfeit. Unwilling to give up, Gemma tries to escape her prison, earning her the respect of the mysterious mage, Stil. Stil offers to complete the impossible task…for a price. \\n Greedy and unsatisfied, King Torgen demands more and more straw to be spun into gold, and decrees that he will “reward” Gemma by marrying her. With death or marriage to a crazed king clouding her future, Stil offers Gemma a bargain that seems too good to be true. \\n Will Gemma’s trust in Stil be her downfall, or will he defy the entire country to save her?\\n","cover":"https://allnovel.net/images/rumpelstiltskin-timeless-fairy-tales-4.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:45:31 PM"}}
