{"id":82920,"no":80,"title":"Page 80","content":"“Maybe…but I don’t think that’s what she really wants,” Gemma said.\\n\\n “I see,” Stil said. He kissed Gemma’s lower jaw. “Is there nothing I can say that will change your mind?”\\n\\n “Does it bother you that much?” Gemma asked.\\n\\n “I will miss you fiercely, but I won’t begrudge you this time. I only wish I could stay with you,” Stil said.\\n\\n “You can’t?” Gemma asked.\\n\\n “The fight against darkness,” Stil sighed. “I have to leave tomorrow with Angelique. It is cruel to part from you so soon, but I’m afraid I don’t have a choice.”\\n\\n “I trust you,” Gemma said.\\n\\n “And I will wait for you. When can I return for you?” Stil asked, pulling Gemma closer.\\n\\n “In a year?”\\n\\n “A month.”\\n\\n “Eight months, no less.”\\n\\n “A month and a day.”\\n\\n The pair bantered for some time before they finally agreed that Stil would come for Gemma in early summer, or sooner if she wrote to him.\\n\\n “I feel I should have you negotiate with merchants for any purchases I need. Arguing with you is tiresome,” Gemma frowned.\\n\\n “Good,” Stil said, pressing his cheek to Gemma’s head. “I will miss you,” he repeated.\\n\\n “I’m sure that lock of my hair you have tucked away somewhere will aid the pain in your heart,” Gemma dryly said.\\n\\n “I was wondering if you would pick up on that,” Stil said.\\n\\n “Mmhmm. There wasn’t really a price to your magic, was there?”\\n\\n “There is, but only for pieces of magic I deliberately perform for a person. The thimble wouldn’t have counted,” Stil admitted.\\n\\n “You are a hack,” Gemma said.\\n\\n “It could be worse. I could have made you play the question game with me.”\\n\\n Gemma raised her eyebrows in an expression of apathy, but she couldn’t help but laugh when Stil soundly kissed her again.\\n\\n The pair settled on the settee and laughed and chatted late into the night, petting the transformed hellhound and enjoying each other’s presence. (They did stop to hold a brief celebration when Angelique returned and Stil told the enchantress in training that he finally won Gemma over.)\\n\\n Gemma rested her head on Stil’s chest and listened to his heartbeat. “You have to go tomorrow,” she said.\\n\\n “I know.”\\n\\n “I wish you didn’t.”\\n\\n Stil kissed the top of Gemma’s head. “Me too, Gemma. Me too.”\\n\\n Chapter 19\\n\\n In spring, the wedding all of Verglas had waited for was finally held.\\n\\n The bride was beautiful, dressed in a gorgeous white dress—the likes of which had never been seen before. The groom was a dashing figure, waiting patiently for his bride with a smile as she walked down the aisle of the same cathedral that, months ago, had witnessed a battle.\\n\\n The crowd gathered on this spring day was very different from those gathered for King Torgen’s and Gemma’s near-wedding. Today, the witnesses wore smiles and waved small replicas of the Verglas flag. The citizens of Ostfold were particularly overjoyed, and they cheered and hollered with abandon as the bride joined the groom on the dais.\\n\\n “Stick a quill in my head and call me a rooster, but that savage miss of yours looks right beautiful today. You did fine work on that dress of hers,” Grandmother Guri said, elbowing Gemma and speaking loudly to be heard over the joyous cheers of their fellow civilians.\\n\\n “Lady Linnea has always been beautiful,” Gemma loyally said, watching her close friend curtsey to the priest and her future husband—King Toril.\\n\\n “Perhaps, but she doesn’t look so false,” Grandmother Guri agreed, “like her expression is carved from marble.”\\n\\n “Yes,” Gemma said, smiling fondly as her eyes rested on the beautiful but serviceable dagger strapped to Lady Linnea’s waist.\\n\\n In the middle of winter, after he was crowned King and had ruled for a little time alone, King Toril—to the shock of no civilians and all Verglas nobles—asked Lady Linnea to marry him. Lady Linnea put aside all of her dreams of meeting military leaders and studying foreign armies to say yes, only to be surprised when King Toril modestly asked her to take charge of the Verglas military once they were married—which would, of course, mean she would need to travel and observe what other countries were doing and, most importantly, answer the summons of nations from the Commanding General of Loire, Prince Severin.\\n\\n That particular request shocked everyone—except for those who lived near Grandmother Guri and pressed close to the walls of her house when, for one week straight, King Toril called upon the legendary seamstress, Gemma Kielland, and sought her advice.\\n\\n He is one of the few men who could understand her, and she will make his reign even better, Gemma thought, smiling at the pair.\\n\\n “I wasn’t sure the bumpkin could tame her, but he managed,” Grandmother Guri said, as if she could hear Gemma’s thoughts. \\n\\n","sourceLink":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4/page-80.html","bookId":1805,"book":{"id":1805,"title":"Rumpelstiltskin (Timeless Fairy Tales #4)","description":"Storyline: When 17-year-old Gemma, a seamstress, is ordered by the insane King Torgen to spin straw into gold or be put to death, she knows her life is forfeit. Unwilling to give up, Gemma tries to escape her prison, earning her the respect of the mysterious mage, Stil. Stil offers to complete the impossible task…for a price. \\n Greedy and unsatisfied, King Torgen demands more and more straw to be spun into gold, and decrees that he will “reward” Gemma by marrying her. With death or marriage to a crazed king clouding her future, Stil offers Gemma a bargain that seems too good to be true. \\n Will Gemma’s trust in Stil be her downfall, or will he defy the entire country to save her?\\n","cover":"https://allnovel.net/images/rumpelstiltskin-timeless-fairy-tales-4.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/rumpelstiltskin-timeless-fairy-tales-4.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:45:31 PM"}}
