{"id":98170,"no":12,"title":"Page 12","content":"\"Corner table, Cat,\" called Graevis Chilichunk, the barkeep and proprietor of Fellowship Way, reputedly the finest inn in all the great city of Palmaris. Fellowship Way, or the Way, as it was commonly called, was not a large establishment, boasting only a dozen small, private rooms and a single common bedroom in the upstairs guest quarters, and a tavern that could hold no more than a hundred, and that with most folks standing. But Graevis, a fat, balding man, perpetually smiling, full of laughter and cheer and with the warmest of hearts, had made the place the best of the cheapest, so to speak. The noble visitors to Palmaris mostly stayed at the more haughty establishments, those near or within the duke\u0027s castle, but for those who knew, for the lesser merchants and the frequent wanderers, there was no better place in the world than Fellowship Way. In the Way, a single piece of silver would get you a hot meal, and a mere smile, whether you were a paying customer or not, would coax from Graevis or from most of the other usual patrons or workers a marvelous tale. In the Way the hearth was always blazing, the beds were always soft, and the song was always loud.\n The young woman sighed deeply, paused a moment, then consciously worked hard to erase the perpetual frown from her face as she made her way to the three men calling her from the corner table. She was aware of their eyes upon her as she approached; always the men looked at her that way. She was in her mid-teens, but had the shapely body of a woman five years older. She was not tall, just four inches above five feet, but that only made her golden hair appear even thicker and longer. She brushed at it and shook it as she crossed the room, for with her sweat and the grease from the meal she had just helped prepare, it clung uncomfortably to her neck.\n \"Ah, the pretty lady!\" one of the men cooed. \"Be a good girl for me,\" he added, winking lewdly.\n The young woman -- Cat-the-Stray, she was called by the folk of the Way -- tried unsuccessfully to hide her scowl. She caught herself quickly, though, and covered it with a smirk she thought must have appeared, at least a little, as a smile. Not that the seated drunk was even looking at her face; his eyes never seemed to angle quite that high.\n Another deep breath steadied her. She thought of Graevis, dear Graevis, the man who had rescued her from a past she could not remember, the man who had taken in a broken little girl and, with his warm smile and warm heart, helped her to heal, at least enough so that she had become functional once again. Out of the corner of her eye, she noticed the movements, a dance they seemed, of Pettibwa Chilichunk, Graevis\u0027 boisterous wife. When she had first come to know the woman, Cat had thought her simple. Pettibwa was forever laughing, dancing with her tray from one table to the next. She got pinched at every stop, hugged by every patron who left at night, but she never seemed to care. Indeed, Pettibwa loved every moment of it. If she had a free hand when a man pinched her on her ample buttocks, she would pinch him right back; often she would grab a man along the path of her table-to-table dance and sweep him with her across the room. And it was all done in such good fun that neither Graevis nor any suitor of her unsuspecting dance partner ever seemed to care.\n It took grim Cat a long while to learn the truth of Pettibwa. The woman was not simple, far from it. Pettibwa just had an unrivaled love of life and of other people.\n Cat loved her -- as much as she had loved her own mother, she believed, for though she could not remember her own mother, she couldn\u0027t imagine loving anyone more. Sometimes that thought only made the young woman even sadder than usual.\n She took the order from the three -- no surprise here, just three more mugs of the cheapest ale -- then turned to the bar. She stopped short when the winker gave her rump a solid slap, and she stood there, suffering their laughter. She wanted to turn and lay him out flat on the floor, and anyone who had witnessed Cat\u0027s temper knew that she could have done it easily enough, but her eyes met the gaze of Graevis, soaking in his smile. By all his motions -- bobbing head, sparkling brown eyes -- he was silently telling her to let it pass.\n Not that Graevis wouldn\u0027t protect her. He had taken her in, heart and soul, and loved her at least as much as he loved his own son, the surly Grady. No man would ever take advantage of Cat while Graevis drew breath -- and Pettibwa, too, for that matter -- but in the Way, a slap on the rump was not to be made into a big deal, especially not considering the everyday actions of the boisterous proprietress.\n The young woman didn\u0027t look back as she made her way across the crowded floor to get the drinks.\n \"Take it as a compliment, me deary,\" Pettibwa remarked in her \"commoner accent,\" as she strolled to the bar beside her adopted daughter.\n \"I shall have to wash my dress in the morning,\" Cat-the-Stray replied, her speech not as stilted as the older woman\u0027s, though it hinted at her four years with the Chilichunks.\n \"Bah, ye\u0027re always so serious!\" Pettibwa replied, pinching the young woman\u0027s cheek. \"Sure\u0027n ye\u0027ve come to know the feelings ye stir in menfolk.\"\n The young woman blushed and looked away.\n \"No, ye\u0027re not a pretty one, now are ye?\" Pettibwa cooed with smiling sarcasm, stroking Cat\u0027s hair. \"If only ye\u0027d smile, me girl, then all the world\u0027d be smiling back at ye.\"\n The young woman closed her eyes and felt the gentle, unthreatening stroke on her hair. Had her mother done it that way? She sensed that her hair had been much shorter then, back when she was young and all the world seemed a great adventure, back when the devils were just fireside stories to make, your skin tingle or imagined demons upon whom children could wage war.\n The moment ended all too soon, Cat-the-Stray tuning back to the bustle of the lively room about her. She offered a meek smile and a nod to Pettibwa, who returned them with a wink. The older woman collected her tray and rushed away, blending into the continuing party just a step from the bar.\n \"If he\u0027s to bother ye, ye just be letting me know about it,\" Graevis said to her as he put the three ales in front of her. \"Ye\u0027re not to play with him if ye\u0027re not wanting to.\"\n Cat-the-Stray nodded and smiled weakly again. She knew that Graevis spoke truthfully; she, and not the patrons, was in control in here. But she knew, too, the atmosphere of the Way, and the last thing in the world the young woman wanted was to make things difficult for Graevis and Pettibwa, her saviors.\n She took up her tray and weaved across the room, getting back to the corner table with hardly a drop spilled. Master Wink-and-Slap twisted his face at her again and gave a breathless burst of laughter, his throat no doubt numb from the drink. \"Might that we be getting together when the hearth\u0027s burning low,\" he stated more than asked. \"I\u0027ve a gold piece to be rid of.\"\n Again that hoarse laughter, this time accompanied by the other two.\n Cat ignored it and methodically placed the mugs on the table.\n \"Two gold, then, and ye best be worth it,\" the dirty man offered, and when Cat continued to ignore him, he roughly grabbed her by the arm.\n Her other hand came across, hooked his thumb, and bent it back over his wrist so quickly that the man, senses blurred by drink, hardly understood what was happening. Suddenly he was off balance, and then he was sitting on the floor, the pretty barmaid gliding out of reach. His friends howled with glee.\n Cat suffered his insults, but couldn\u0027t dismiss the realization that Pettibwa would have handled it differently, better. Pettibwa would have proclaimed that two gold was an insult to a woman of her talents, and might have gone on to insist that she would never bed a man, no matter the money, who did not understand the meaning of the word \"bath.\"\n Pettibwa would have extracted herself delicately, subtly, turning the joke back on the rude man, making him the fool but with such cunning that he probably wouldn\u0027t even realize it until she was across the room.\n Now, the man continued sputtering. Cat caught the word \"whore,\" and then she was not surprised to see Graevis, several of the other regulars in tow, crossing the room, their faces suddenly grim.\n Cat suffered the inevitable apology, the insincere man only offering it at the end of his twisted arm. The young woman pointedly turned away then, not wanting to watch as Graevis none too gently threw the drunk out into the street, and then. pushed his two wretched friends out behind him.\n Perhaps worst of all for the young woman were the host of other eager young men ready to defend her honor, offering everything from a thrashing of the man to his very life. One in particular, handsomely dressed and well groomed, with light brown eyes that sparkled with intelligence and a calm demeanor that hinted at good breeding, nodded the young woman\u0027s way and smiled slightly, an invitation for Cat to name him as her champion. She eyed the young man for a long moment -- the way he sat, the way he moved -- and she had no doubt that he was well trained in the use of the slender sword that hung comfortably at his hip. On a single word from her, he would thrash all three of the drunks to within an inch of their lives.\n Cat knew it, and knew that many others would have defended her as well. That should have come as a compliment, but Cat-the-Stray hated being the center of attention, hated the patronizing, the would-be heroes, who, with the sole exception of Graevis, wanted exactly the same thing as the bounced drunk. Their course was more gentlemanly, less straightforward, but. their goal through honor, Cat knew; was precisely the same as the drunk had attempted through offered gold.\n She worked for another hour, and when her smile did not return, Graevis graciously bade her to take an early night. Cat resisted, fearing that her leaving would only put more work on Pettibwa\u0027s shoulders, but the older woman pooh-poohed that notion and almost forced Cat through the side door, into the family\u0027s private chambers. Cat looked back appreciatively, and over Pettibwa\u0027s large round shoulder, she saw again the handsome well-dressed young man, watching her go, lifting his glass of wine in apparent toast to her.\n She scurried away, suddenly uncomfortable.\n All the bustle of the common room disappeared as soon as the heavy door was closed, leaving the young woman in happy solitude -- almost, for a moment later, she noticed that Grady Chilichunk was in the house, moving about his little room.\n Cat sighed again; the last thing she wanted now was to spend any time near Grady. He was a handsome man of thirty years, nearly twice Cat\u0027s age, with sharp brown eyes. Physically, by all accounts, he was the image of his father in Graevis\u0027 younger days, but by Cat\u0027s estimation, Grady could not have been more different than Graevis in temperament. Since her first days in the house, Grady had made the young woman uncomfortable. Not in a lewd way, like the drunk in the bar, or even in a teasing way, like the handsome young man. In four years, Grady had never once looked at the flowering young woman lustfully. To Cat-the-Stray, his adopted sister, he was always polite, too polite. Stiff even, and as the young woman had grown wiser to the ways of the world, she came to understand that Grady saw her as a threat to what he considered his rightful inheritance.\n It wasn\u0027t that Grady honestly cared for Fellowship Way. He was hardly ever in the place. He liked the money the establishment brought in, though, and the young woman already understood that if Graevis and. Pettibwa left Fellowship Way to her, even partially, Grady would not be pleased.\n \"What are you doing in here?\" he asked, coming from his room. His proper speech rang in sharp contrast to the street dialect of his parents. Grady saw himself as above that lowly station, Cat understood. He fancied himself an important man, and frequented the more expensive establishments near the duke\u0027s castle, and had even been in the castle on many occasions. It struck Cat that he must know the well-dressed gentleman in the bar; perhaps the man had even come to the Way on Grady\u0027s invitation.\n \"Have you no work?\" he snapped at her.\n Cat-the-Stray bit her lip, not liking his condescending tone. \"I\u0027ve done more this one night than you have in the last two seasons,\" she replied.\n Grady glared at her. \"Some were made to work in life,\" he began evenly, \"others to live and enjoy.\"\n Cat decided that it wasn\u0027t worth arguing. She shook her head, tossed her apron to the back of a nearby chair, gathered up her cloak, and headed out into the Palmaris night.\n A chill breeze was blowing off the gulf, moaning as it wound its way past the many two- and three-story houses of the great city. Palmaris was second in size in all the Kingdom of Honce-the-Bear only to Ursal, the throne seat, further upriver, though neither were reputedly as populous as the great, crowded cities of the southern kingdom of Behren. To Cat-the-Stray, who had grown up on the edge of the Wilderlands, in a village where ten people together was considered a crowd, the place had, at first, been overwhelming. Even now, after nearly four years in Palmaris, when she knew every street, where to go, where to avoid, and when the dark image of the great Masur Delaval and the smell of brine and the wind filled with crisp wetness had become very familiar to her, she could not consider the place her home. Even now, surrounded by the love of the Chilichunks, the place was not home; could never replace the fleeting image of a cabin that she held so dear. She loved Graevis and Pettibwa, even Grady, but they were not, could not be, her parents, and Grady would never take the place of a true friend she sensed that she had once known.\n Cat-the-Stray winced as the thoughts careened back in time. She had blocked away so much, could only remember, fleeting images, a certain look, a kiss that she wasn\u0027t even sure had really happened. And the name, all the names, were gone from her mind -- that was the worst thing\u0027 of all! She could not remember her friend\u0027s name, could not remember her own name!\n \"Cat-the-Stray,\" she whispered distastefully into the cold night air, watching the mist of her breath float away, and wishing the title would go with it. It had been given to her affectionately, she knew, and with all sympathy for her pitiful predicament, and so she had not argued.\n The young woman made her way around the back of the inn, down a dark alley that inspired no fear, and up a gutter, to the one section of Fellowship Way\u0027s roof that was not slanted. The lights of Palmaris spread wide before her, the lights of the night sky wide above her. This was her secret place, her place of contemplation. She came up here as often as her duties allowed to be alone with her memories, to try to piece together who she was and where she had come from.\n She remembered wandering into a village, dirty and wounded, covered in soot and blood. She remembered the tender manner in which she had been brought in, followed by relentless questions that she could not answer. Then came the long journey, tagging along with a merchant caravan that had swapped crafted items to the people of the small frontier village in exchange for pelts and great trees that would be used as masts for the sailing ships built in Palmaris. Graevis Chilichunk had bin on that caravan, coming north to the Wilderlands to, pick up some very special wine, boggle by name. He had taken to the poor lost girl -- he was the one who had given the girl the name of Cat-the-Stray -- and the villagers had been more than willing to part with the orphan and with many of their own weaker folk, since they were in fear of a raid similar to the one that had sacked the neighboring settlement, Cat\u0027s settlement.\n Cat rested back against a sooty chimney, the warm bricks taking a bit of the bite from the night chill.\n Why couldn\u0027t she remember the name of her village or of the one where Graevis had found her? On several occasions, she had started to ask Pettibwa and Graevis about it, but every time she had stopped short, some part of her fearing to remember. Neither of her adopted parents pressed her to remember; Cat had overheard them talking one night, making a pact that they would let the girl heal in her own time. \"Perhaps she will never remember,\" Pettibwa had said. \"Perhaps that would be better.\"\n \"And she\u0027s got her new name now,\" Graevis agreed. \"Though if I\u0027d\u0027ve thinked it would stick, I\u0027d\u0027ve chosen differently!\"\n And they laughed, and it was not in any way an insult to the girl, just their joy at being able to help one so in need.\n Cat loved them with all her heart. Now, though, she was beginning to think it was time for her to figure out who she was and where she, had come from. She looked up at the sky. Some streaks of clouds had moved in, giving a different perspective to those stars still visible. It was often possible to look at familiar things in a different way, Cat realized. She let the night canopy absorb her, used it to filter back through the painful barriers. She had seen this sky all her life and used that commonality to recall another place.\n She remembered running up a forested slope, looking back to her village, nestled in a sheltered vale, and then turning her gaze above it, to the southern sky, to the faint colors of the Halo.\n \"The Halo,\" Cat-the-Stray muttered, and she realized that she had not seen the phenomenon since she had come to Palmaris. Her face screwed up with concern. Did such a thing as the Halo even exist, or was her memory a mere fantasy?\n If it did exist, then her memory was correct, then she had found yet another image of her lost life.\n She considered going back into the Way and inquiring about this Halo right then, but her concentration was broken by a sharp, metallic sound.\n Somebody was climbing up the gutter.\n Cat did not get overalarmed -- until she saw a familiar dirty face come over the edge of the roof.\n \"Ah, me lovely,\" said the drunk from the bar. \"So ye come up here to meet with me.\"\n \"Be on your way,\" Cat warned, but the man rolled up over the edge of the roof and started to rise.\n \"Oh, I\u0027ll be having me way,\" he said, and then Cat heard yet another man coming up the gutter, and realized she was in trouble. They had followed her, all three, and she knew well enough what they meant to do to her.\n Quick as her namesake, the young woman leaped across and put her knee heavily into the drunk\u0027s chest, knocking him flat to the roof. She slapped away his grabbing hands, then slugged him twice in the face.\n Then she was up, meeting the second intruder with a foot in his face as his head came above the roof edge. His head snapped back; he started to say something in protest, and Cat kicked him again, right in the jaw.\n With a groan, he fell away into the blackness, dropping heavily atop the last of the three, then both of them going down hard to the cobblestones. Two kicks and two down, but it had taken too long. Even as Cat started to turn back for the first, the drunk\u0027s arms came about her and locked about her chest, squeezing her tight.\n She felt his hot breath on her neck, smelled the stench of the cheap ale. \"There, there, me pretty one,\" he whispered. \"If ye\u0027re not to fight me, yell like it all the more:\"\n He nibbled her earlobe, or tried to, but she snapped her head back hard into his face, stunning him.\n The one memory that Cat-the-Stray held completely from her past was not an image or a name, but a feeling, a deep frustrated rage. She let that memory out now, on the roof of Fellowship Way in Palmaris. She let all the tears and all the unanswered screams come out, channeled them into a level of violence that the drunk could not have foreseen.\n Her hands raked at his arms; she stuck one arm between her torso and the drunk\u0027s arm, and let her legs fall out from under her, twisting and squirming.\n \"Might be more the fun if ye fight!\" the drunk squealed, but he wasn\u0027t paying attention and had let the young woman get her face close to his clenched hands.\n Cat-the-Stray clamped her teeth over one of his knuckles and bit him hard.\n \"Ah, ye whore!\" he yelled, and lifted his other hand to pound her.\n But he had broken his grip, and Cat turned and ducked, accepting the blow across the back of her shoulders, not even feeling it through the turmoil of her emotions. She came around and up and right back in, clawing at his face, raking for his eyes. He pulled her hands out wide, and she used the opening to head- butt him again.\n She tore her hands free and grabbed him by the hair. He punched her hard on the side of the head, but she only loosed a feral scream, and tugged down hard with both her hands, while she jumped and curled one leg. She heard the crack of bone as her knee connected with his face. He shot back up straight, then fell over backward, but Cat was not done with him.\n She came in hard, screaming all the while, driving her knee into his throat.\n \"Enough!\" he whined, gagged. \"I\u0027ll let ye be.\"\n That wasn\u0027t the point; Cat would not let him be. She hit him a score of heavy blows; she kicked him, she bit him, she clawed him. Finally, battered and bleeding from a dozen wounds, he managed to get to his feet and he ran headlong to the ledge and dove right over it.\n Following across the roof, Cat noticed that there was a light below in the alley. She came to the edge, expecting one of the man\u0027s companions to be coming up the gutter, and hoping that to be the case.\n She stopped, taken fully by surprise. The drunk lay very still, groaning softly, blood running from his many wounds and from the side of his broken head. The man she had kicked from the gutter was down as well, sitting against the building wall across the alley, one hand supporting him, the other clutching his shin. The leg had splintered in the fall; Cat could see the jagged edge of a bone poking through the skin.\n The third drunk was up, hands high above his head and facing the wall directly below Cat, a sword\u0027s pointed tip tight against the middle of his back.\n \"I heard a scream,\" said the handsome man from the Way, the one with the sparkling light brown eyes, the one with the purest white smile. \"I took my leave soon after you departed,\" he explained, \"figuring there was nothing left in the place worth watching.\"\n Cat felt the blood rushing to her face.\n \"Some hero I prove to be,\" the man said, bringing his sword back in a salute to the young woman. \"By my eyes, it seems as if I saved these three!\"\n Cat-the-Stray had no idea what to respond to the gallant man. Her rage bubbled away, and she turned from the alley, walking back into the solitude of the darkened rooftop.\n After a few uncomfortable minutes, the man called up to her, but before she could answer, she heard a commotion as several others, Graevis among them, came rushing into the alley.\n Cat-the-Stray didn\u0027t want to face them. She was embarrassed, she was ashamed, and she just wanted to be left alone: That was not possible, she realized, nor could she slip down the other side of the building without having half of Palmaris searching frantically for her. She took a deep breath and moved to the gutter, then down, meeting the eyes of no one, falling into the bosom of Pettibwa as soon as she spotted the woman, and whispering for Pettibwa to please take her to her room. \n","sourceLink":"https://allnovel.net/the-demon-awakens-the-demonwars-saga-1/page-12.html","bookId":2167,"book":{"id":2167,"title":"The Demon Awakens (The DemonWars Saga #1)","description":"Storyline: \n The Demon Awakens (The DemonWars Saga #1) \n In THE DEMON AWAKENS, bestselling author R. A. Salvatore creates an astonishing new world for readers to explore--and an intrepid hero to lead the way: Elbryan Wynden, who must confront the dark tides of destiny in his epic search for justice and peace . . . \n A great evil has awakened in the land of Corona, a terrible demon determined to spread death and misery. His goblin armies and fearsome giants ravage the settlements of the frontier, and in the small village of Dundallis their merciless attack leaves behind two shattered orphans: Pony and her lifelong friend, the youth Elbryan. Taken in by elves, Elbryan is raised to become a formidable ranger--a fateful role that will lead him into harrowing confrontation. \n Meanwhile, on a far-off island, a shower of gemstones will fall onto the black sand shores. These heaven-sent stones carry within them an incredible power--the key to all that is good in the world and all that is evil, and it is up to one young monk to liberate them from the corrupt monastery that harvests them. Pray that they don\u0027t fall into the wrong, clawed hands . . .\n \n","cover":"https://allnovel.net/images/the-demon-awakens-the-demonwars-saga-1.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-demon-awakens-the-demonwars-saga-1.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:30:59 PM"}}
