{"id":98175,"no":17,"title":"Page 17","content":"Elbryan\u0027s fifth summer in Andur\u0027Blough Inninness was among the very best times in all his young life. He was no more a boy but a young and strong man, with all traces of his youth gone except for a mischievous streak Tuntun feared he would never be rid of. He continued his ritual with the milk-stones, running out eagerly each morning, attacking the task with pride, for he could see the difference the continual exercise had made on his tall, graceful form. His legs were long and covered with muscle, and his arms had grown huge, each muscle clearly defined. When Elbryan bent his fist forward and flexed, he couldn\u0027t put his other hand -- and his hands were not small by human standards! -- halfway around the bulging forearm.\\n\\n But even with all that mass, there was nothing awkward about the young man. He danced with the elves, he fought with the elves, he skipped along the winding trails of Andur\u0027Blough Inninness: His light brown hair had grown long, to his shoulders, but he kept it clean and neatly trimmed, pushed back from his face, which he still kept clean shaven.\\n\\n He was welcomed in every elven ritual now -- in every dance, in every celebration, in every hunt -- but still, perhaps more than ever, Elbryan felt alone. It wasn\u0027t that he craved human companionship; he continued to fear that thought greatly. It was simply Elbryan\u0027s realization of how different he was from these creatures, and not just in stature. They had taught him to view the world as an elf might, with utter freedom and often more veiled in imagination than reality. Elbryan found that he could not possibly maintain such a stance. His sense of order was simply too strong, his sense of right and wrong too keenly developed. He expressed that sentiment to Juraviel one quiet afternoon, he and the elf out on a long walk, talking of the plants and animals.\\n\\n Juraviel stopped in his tracks and stared at the young man. \"Could you expect differently?\" he asked simply.\\n\\n It wasn\u0027t the wording but the way Juraviel spoke that offered Elbryan comfort. For the first time, he realized that perhaps the elves were not expecting him to be as one of them.\\n\\n \"We are showing you a different way to view the world about you,\" Juraviel explained, \"one that will aid you in your journeys and trials. We are giving you tools that will put you above your kin.\"\\n\\n \"Why?\" Elbryan asked simply. \"Why was I chosen for these gig?\"\\n\\n \"Blood of Mather,\" Juraviel replied, a phrase the young man had heard all too often, usually derisively, from Tuntun. \"Mather was your uncle, your father\u0027s oldest brother.\"\\n\\n As he spoke, Elbryan found his mind drifting back to a specific place and moment, a time nearly five years previous, when he had stood on the ridge outside of Dundalis, Pony beside him, looking up at the glowing Halo. Though his mind conjured that image, that feeling, and placed him squarely within that space and time, he remained alert to Juraviel\u0027s every word.\\n\\n \"He died very young, so it was believed by your father and the others of the Wyndon family.\"\\n\\n \"I remember --\" Elbryan stopped short. He didn\u0027t know what he remembered. He had a feeling that his father had mentioned a lost older brother, Mather perhaps, and it must have been so, because Elbryan now knew he had heard that name before he had ever met with the Touel\u0027alfar.\\n\\n \"The boy Mather was nearly killed,\" Juraviel went on. \"We found him in the woods, mauled by a bear, and brought him to Caer\u0027alfar. It took him some time to heal, but he was strong, as is the way of your heritage. Afterward, we could have let him return to his family, but many months had passed and the Wyndons, by all the reports of our scouts, had moved along.\"\\n\\n The elf paused, as if wondering how he should proceed. \"In centuries past,\" he began solemnly, \"our peoples were not so secluded. Elves and humans lived near each other, often trading stories and goods and sometimes living together in a single community. There were even marriages, two that I know written of, between elf and human, though few offspring ever came from such unions.\"\\n\\n \"What drove our peoples apart?\" Elbryan asked, for he thought that the world, particularly concerning his race, was a more tragic place for the change.\\n\\n Juraviel chuckled. \"You have been in Andur\u0027Blough Inninness for five years,\" he replied. \"Have you noticed the absence, of anything?\"\\n\\n Elbryan crinkled his brow. What could possibly be missing from so enchanted a place as this?\\n\\n \"Children,\" Juraviel prompted at length. \"Children,\" he repeated, his voice low. \"We are not like humans. I might live a millennium -- I am nearly halfway to that point already -- and sire no more than one, or perhaps two, children.\"\\n\\n Juraviel paused again, and it seemed to Elbryan as if a cloud passed over the elf\u0027s angular features. \"Three centuries ago, the dactyl awakened,\" he said\\n\\n \"Dactyl?\" Elbryan asked.\\n\\n \"Demon,\" Juraviel clarified. He turned away from Elbryan, walked to the edge of a small clearing, and lifted his head to the heavens and his voice in song.\\n\\n \"When the eyes of sentries turn inward, When the hearts of men covet, When love is lost to lust. When the ways of merchants turn cheating, When the legs of women bow, When gain is ill not just. Then look ye men to darkness. Then see the smoke-filled sky. Then feel the rumble \u0027neath your feet And know \u0027tis time to die. So turn your swords away from kin Your hatred far from kind, And see the charge of goblin and dwarf To which lust has left you blind. Thus find your hearts and enemies true And all ill ways forsake And know the time for righteousness! The dactyl has come awake!\"\\n\\n Many images flitted through Elbryan\u0027s imagination as Juraviel sang: scenes of war and terror, scenes so very much like Dundalis on that awful day when the goblins came. By the time Juraviel finished, the young man\u0027s cheeks were wet with tears, and Juraviel\u0027s were as well, Elbryan noted when the elf turned back to him.\\n\\n \"Dactyl is the name we give to it,\" Juraviel said softly, \"though truthfully the awakening of the demon is more an event of the whole world than of a specific being. It is our own folly -- that of human and in times long past, of elf -- that allows the dark creature to walk the earth.\"\\n\\n \"And when the demon awakens, then there is war,\" Elbryan reasoned from the song. \"Like the battle that claimed my family.\"\\n\\n Juraviel shrugged and shook his head. \"Often there are such battles when humans and goblins live near. each other,\" he explained. \"On the wide seas, sailing ships often meet the low boats of powries, with predictable results.\"\\n\\n Elbryan nodded; he had heard of the fierce powries and their reputation for destroying human ships.\\n\\n \"It was three centuries ago when the dactyl last awakened,\" Juraviel said. \"At that time, I and my people traded openly with humans. We were many more. Many more, though not as many as the humans. Co\u0027awille, Endwar,\u0027 we call that horrible time, for four of every five elves were killed.\" He sighed resignedly. \"And since we do not procreate prolifically . . . \"\\n\\n \"You had to run away,\" Elbryan reasoned. \"For the very survival of your race, you had to seclude yourself from the other races.\"\\n\\n Juraviel nodded and seemed pleased by the perceptive reasoning. \"And so we came to Andur\u0027Blough Inninness,\" he said, \"and to other such places of mystery. Aided by the holy humans and their precious gifts, the magical stones, we made these places our own, secluded and veiled from the eyes of the wider world. Know that the dactyl was defeated in that time long past after great cost, but gone, too, was our time in this world. And so we live on, here and there, under blankets of cloud, under cover of darkness. Our numbers are small; we cannot afford to be known, even to the humans whom we consider our friends.\"\\n\\n \"Some of you do,\" Elbryan remarked, thinking of Tuntun.\\n\\n \"Even Tuntun,\" Juraviel replied with a laugh. But his smile did not last. \"She is jealous of what you have.\"\\n\\n \"I?\".\\n\\n \"Freedom,\" Juraviel went on. \"The world is open to you, but not to Tuntun. She does not hate you.\"\\n\\n \"I will believe that right up until the next time we spar,\" Elbryan replied, drawing a laugh from his elven friend.\\n\\n \"She fights hard,\" Juraviel admitted. \"And on you, she is particularly strict. Is that not proof that she is your friend?\"\\n\\n Elbryan stuck a blade of grass between his teeth and considered the viewpoint.\\n\\n \"Tuntun knows that your life may be difficult,\" Juraviel finished. \"She desires you to be properly prepared.\"\\n\\n \"For what?\"\\n\\n \"Ah, that is the question,\" Juraviel answered, his finger pointing into the air, his eyebrows arched. \"Though we have forsaken the ways and places of the humans, we have not forsaken your race. It is we, the elves of Caer\u0027alfar, who train those known as rangers, the protectors, usually of people who have no idea they need protecting.\"\\n\\n Elbryan shook his head; he had never heard of rangers, except for occasional references by the elves.\\n\\n \u0027Mather was a ranger,\" said Juraviel, \"one of the finest. For near to forty years he kept a line a hundred miles long secure from goblins and fomorian giants alike. His list of victories is far too long to be recited here, if we had a week to spare.\"\\n\\n Elbryan felt a strange sense of family pride. He remembered again that morning on the ridge, viewing the Halo, hearing the name of Mather distinctly within his mind.\\n\\n \"And so you shall be,\" Juraviel finished. \"Elbryan the Ranger.\"\\n\\n The elf nodded, then walked away. Elbryan understood that his lesson was at its end and understood, too, that this lesson might have been the most important of all during his time in Andur\u0027Blough Inninness.\\n\\n \"There, do you feel it?\"\\n\\n Belli\u0027mar Juraviel held his hand up, begging silence, then shifted his sensitive bare feet about on the stone face. A moment later, feeling the subtle vibrations running clearly into him through his toes, he gave a grim nod.\\n\\n \"Many miles north and west,\" Tallareyish remarked, looking that way as if he expected some vast horde of darkness to be charging down toward Andur\u0027Blough Inninness.\\n\\n \"Lady Dasslerond has been told?\" Juraviel asked.\\n\\n \"Of course,\" an elf by the name of Viellain, one of the oldest in Caer\u0027alfar, answered. \"And scouts have gone out. There are reports of a trench, a great upheaval, not twenty miles beyond our valley.\"\\n\\n Juraviel looked to the north, to the wild lands beyond his elven home and far beyond the settlements of any humans. \"Do you know this place?\" he asked of Viellain.\\n\\n \"It should not be so hard to find,\" Tallareyish answered quickly, as eager as Juraviel to glimpse the evidence. The pair looked at Viellain, their expressions revealing much.\\n\\n \"The scouts will pass by the trench, if there is indeed such a marker, then continue far to the north,\" the old elf explained. \"Thus they shall not return to Caer\u0027alfar for many days.\"\\n\\n \"But Lady Dasslerond should be informed,\" Tallareyish reasoned, guessing that Viellain, usually a stickler for rules, was coming around to their way of thinking.\\n\\n \"We can reach this place and return before the sun has set tomorrow,\" Juraviel said, \"if we can find it.\"\\n\\n \"The birds will know,\" Viellain assured him. \"Always, the birds know.\"\\n\\n The glade was strangely quiet this night, with no elves in the area -- or at least none showing themselves, for Elbryan had been around the Touel\u0027alfar long enough to realize that a host of sprites could be within a dozen paces and even he, now so attuned to the forest, would not suspect it unless they chose to make their presence known.\\n\\n Still, he was fairly certain that he was alone this night, except for his opponent, standing in the shadows across the way.\\n\\n The young man held his breath when the elf came out into the moonlight.\\n\\n Tuntun.\\n\\n Elbryan clutched his staff and set his heels. He had not battled Tuntun in many weeks; he was determined now to give the upstart elf a bit of a surprise.\\n\\n \"I shall not stop beating you until you cry out my name,\" Tuntun taunted, moving to the center and twirling her longer pole, the size of an elven sword, in a circle, while her second weapon, a stick fashioned as a dirk, worked in tighter circles over her fingers. Around and around the weapons went, reminding Elbryan of her uncanny dexterity. Tuntun could roll four coins at a time on each of her hands; she could juggle a dozen daggers, or even flaming brands, effortlessly.\\n\\n But that quickness and precision would not be enough, Elbryan told himself. Not this time.\\n\\n He stalked in, his staff horizontal before him, right hand palm up, left palm down. Normally, the combatants would speak the rules before a match, but with these two there was little need for such ceremony: After all these years, Tuntun and Elbryan understood each other perfectly; between these two, there were no rules.\\n\\n Elbryan went into a crouch, and Tuntun wasted no time in going on the attack, sending her sword straight ahead. Elbryan let go of his staff with his left hand, turned his right hand over, then back. The overhand parry deflected the stabbing blade, but the second attempt, the undersweeping slap designed to send the elf\u0027s sword flying up high, was far too slow to catch up to Tuntun\u0027s retracting movement.\\n\\n Elbryan caught the staff again with his left hand, holding steady, his defenses set.\\n\\n But then he surprised Tuntun. Fighting logic said that he, with the heavier weapon and more lumbering moves, should have allowed Tuntun the initial attacks, playing black on the chessboard. Any offensive mistake would leave Elbryan dangerously vulnerable to the elf\u0027s darting blades,\\n\\n But on the young man came anyway, pressing furiously. He started with an overhand, underhand parry sweep again, but instead of catching the staff with his left hand as it came swishing back to horizontal, he turned his right hand over once more. Halfway through the next sweep, Elbryan\u0027s powerful forearm flexed tight, catching the pole in mid-swing, and he brought its low end snapping in against his side, catching it under his right. arm, then lowering and thrusting its tip like a spear.\\n\\n Tuntun, almost expecting the attack from this man who so hated her, was not caught by surprise. She backed through the first swishes, then ducked under the thrust, crossing sword and dagger in an X above her head to keep the pole harmlessly high. She expected then to find an opening for a counter but had to stay defensive as she realized the young man wasn\u0027t yet through with his surprisingly adept routine.\\n\\n Elbryan brought the pole right back in, before Tuntun\u0027s crossed blades could shift it to either side. Then he sent it straight out a second time, cutting short the thrust as the elf predictably ducked. He brought the leading end of the pole up and back over his head, launching the pole into an immediate spin, catching it again in his left hand after it went once around, then stepping forward forcefully. Now firmly held in both hands, his staff made a second twirl, then came arching diagonally toward the ground, toward Tuntun.\\n\\n The elf squealed and threw her sword out to the side, blade vertical, its tip nearly touching the ground. The staff smacked it with all the young man\u0027s considerable weight and strength behind it, and Tuntun went flying backward; skipping and hopping, even flapping her gossamer wings, to absorb the tremendous shock.\\n\\n Elbryan smiled grimly and came on, twirling and swinging, poking, stabbing, thrusting -- anything to keep the elf moving backward and off her balance.\\n\\n His success was partly gained by surprise. Soon the cunning elf had a new and more respectful measure of him, and her parries -- and the distance she kept between herself and her opponent -- became more appropriate.\\n\\n And so they fought, evenly matched, for a long while, poles sometimes slapping together so rapidly that it occurred to Elbryan that, if they had some kindling, they might light a fire from friction alone! Each scored minor hits, each felt minor stings, but neither seemed to gain the advantage as the minutes continued to slip by.\\n\\n Inevitably the hits, particularly on Elbryan, became more substantial as weariness caused some sloppy defensive posturing. Tuntun was tiring, too, Elbryan knew, and if he could land but one solid blow, the fight might be at its end.\\n\\n Elbryan slashed across in front of him and felt his staff smacked once, twice, perhaps a half dozen times before he even completed the pass. One solid blow, indeed, he thought, but landing that hit would prove no easy task!\\n\\n That point came clearer a split second later, as the last of Tuntun\u0027s sword parries hit hard enough to force his staff out just wide enough for the elf to dart straight ahead and sting the fingers of Elbryan\u0027s trailing hand with her dirk.\\n\\n He needed something new, something Tuntun had not seen from him and could not expect. Something daring, even desperate, like the shadow dive Tallareyish had used to defeat him.\\n\\n Tuntun was growing more confident, he realized. She felt she had his measure.\\n\\n She was ripe for the plucking.\\n\\n A series of swipes, stabs, and forward strides put Elbryan in the desired position. He shifted back on his heels, reading the elf\u0027s next attack perfectly and easily sliding too far away for the small sword to reach.\\n\\n Then he came ahead in a rush, hands apart and holding firm, swiping the staff across left to right in front of him, up high so that Tuntun could not stop it and had to duck it.\\n\\n She did, perfectly, but Elbryan kept his staff moving, letting go with his left hand and using his right merely to keep the staff\u0027s turn intact and balanced. He caught the weapon mid-pole, again in his left hand, an overhand grasp as it came around his back and swiped it across in the same direction, this time with only the one hand and using his hip, the back half of the staff still behind it, for leverage.\\n\\n Again Tuntun -- though surprised the second swing had come the same way and not on the predictable backhand -- managed to dodge, this time rolling around the tip of the pole, turning a complete spin back to her right.\\n\\n But Elbryan wasn\u0027t more than half done. As his staff came sweeping around to horizontal in front of him, he caught it in his right hand, quickly flipped his left hand under the weapon, then stepped ahead and to the left in swift pursuit and launched the third swipe, again left to right, by pulling his right hand in while thrusting his left out.\\n\\n Tuntun\u0027s only avenue of escape was straight down to the ground, and so she took it unceremoniously.\\n\\n Elbryan did not check the flying momentum, continuing his own spin and letting the staff fly out to its full extension, catching it down low in both hands, as he might have held a club in his younger days when at play smacking rocks far into the air.\\n\\n Around he went, all the way around, though he knew that it was dangerous to turn his back for even a split second on one as swift as Tuntun. He yelled out as he came back to face her, dropping to one knee, swiping low with all his strength.\\n\\n The staff swished harmlessly through the air. Tuntun was gone!\\n\\n The man\u0027s mind whirled through the possibilities, all jumbled with the horror that he had erred, that he was about to get clobbered. He realized immediately that Tuntun could not have stepped left or right without his noticing and certainly couldn\u0027t have gone low under the cut with him dropping to one knee.\\n\\n That left only one possibility, an escape borne on translucent wings.\\n\\n As his swing crossed before him, Elbryan turned his left shoulder down and fell into a roll that left him on his back in the grass. He pulled with all his great strength, tearing out the staff\u0027s momentum, halting its flow and turning it perpendicular to the ground.\\n\\n Down came Tuntun, her wing-fluttering hop exhausted, her sword pointed below her, leading. She had meant to pounce right upon stupid Elbryan\u0027s back, driving her wooden practice sword into the back of his neck. How her blue eyes widened when she saw the pole\u0027s tip come up to meet her descent!\\n\\n She batted futilely with her sword, then, that failing, tried to stab down at Elbryan. Her breath came out in a rush as she plopped down hard, the staff\u0027s butt end secure against the ground, its tip stabbing hard into her chest between her lowest ribs.\\n\\n She held there for a long moment, up high on the eight-foot pole, her sword nowhere near supine Elbryan. She dropped the sword -- unintentionally, Elbryan knew, for it fell harmlessly to the side -- so the young man graciously pulled the pole out straight so Tuntun wouldn\u0027t fall off balance to either side. She landed on her feet, skittered back away from the weapon, but soon fell, gasping desperately for breath.\\n\\n Elbryan, his weapon dropped, was at her side in a moment. He thought himself foolish as he neared the unpredictable Tuntun, expecting that she would find the strength to drive her dirk into his face, thus claiming a draw.\\n\\n But Tuntun had no such strength. She couldn\u0027t even talk, and her dirk, like her sword before it, slipped uselessly from her weakened hand. Elbryan knelt beside her, his arm about her shoulders, comforting her.\\n\\n \"Tuntun,\" he repeated over and over, for he feared she was hurt, that she might die out here in the practice glade with no one near her except this man she so despised.\\n\\n But finally she was breathing somewhat steadily again. She looked up at Elbryan, sincere admiration in her eyes. \"Fairly won,\" she congratulated. \"I thought . . . you had over . . . stepped . . . your ability, but your recovery . . . was truly remarkable.\"\\n\\n Tuntun nodded and rose unsteadily, then walked from the glade, leaving Elbryan kneeling in the grass.\\n\\n He hardly knew how to react. After so many long months, he had scored his first win.\\n\\n The row of trees, short and wide apples, ran almost perfectly straight, then jumped back a dozen feet, up a ridge twice an elf\u0027s height, and continued on straight again from there. The upheaval was recent, that much was perfectly clear, for the soil on the torn side of the ridge was loose and deep brown, pocked here and there by a root, but with no fresh, aboveground growth. Something had reached into the middle of this line of apple trees and simply pulled back a third of the row.\\n\\n \"This is one of Brother Allarbarnet\u0027s groves,\" remarked Tallareyish. The other two nodded their agreement, for Allarbarnet, a wandering monk of St. Precious Abbey of Palmaris, was not unknown to them or to any reasoning creature of Corona. He had wandered the lands -- the Wilderlands and not the civilized regions of his birth -- more than a century before, planting lines of apple seeds in hope that his fruit would encourage the people of the kingdom of Honce- the-Bear to explore the wider world. Brother Allarbarnet -- the canonization process for the man had already begun, and the abbots expected that he would be sainted within the decade -- had not lived to see his dream realized; indeed, it had not yet been realized, but many of his groves had grown and flourished. Unknown to the humans, Brother Allarbarnet had been named an elf-friend, and had often been aided by the elves or by the rangers the elves had trained. So these three knew of the man and his work, knew of his groves, and knew that they were always planted in straight lines.\\n\\n What, then, had so altered this one?\\n\\n There could be only one answer, for no living creature, not even one of the great dragons of the north, could so tear this amount of ground in such an even, tidy manner.\\n\\n \"Earthquake,\" Juraviel muttered, but even given his grim demeanor, his melodic voice could sound only a bit ominous.\\n\\n \"From that direction,\" Tallareyish agreed, pointing to the north in the direction, they all knew, of the wastelands of old, a tom and battered mountainous region known as the Barbacan.\\n\\n \"Not so unusual an event,\" Viellain reminded the pair. \"Quakes happen in all times.\"\\n\\n Juraviel understood his fellow\u0027s reasoning and knew the elf was speaking those words for his sake mostly. For Juraviel\u0027s anxiety was clearly etched on his fine features -- how could it have been otherwise when he had been speaking to his protege Elbryan about this very subject not a week\u0027s time past?\\n\\n Viellain was right, Juraviel knew logically. Earthquakes and thunderstorms, swirling tornadoes, even exploding volcanoes, were more often than not natural events. Perhaps it was coincidence.\\n\\n Perhaps, but Juraviel knew, too, that such events might accompany a larger and darker phenomenon, that earthquakes that could tear the earth as here, that goblin raids upon villages, like the one that had orphaned Elbryan not five years before, might signal something evil indeed.\\n\\n He looked to the north again, peering hard just above the horizon. If the day had been clearer, his keen eyes might have spotted something, some flicker, some-confirmation. For now, the elf could only worry.\\n\\n Had the dactyl awakened? \\n\\n","sourceLink":"https://allnovel.net/the-demon-awakens-the-demonwars-saga-1/page-17.html","bookId":2167,"book":{"id":2167,"title":"The Demon Awakens (The DemonWars Saga #1)","description":"Storyline: The Demon Awakens (The DemonWars Saga #1) \\n In THE DEMON AWAKENS, bestselling author R. A. Salvatore creates an astonishing new world for readers to explore--and an intrepid hero to lead the way: Elbryan Wynden, who must confront the dark tides of destiny in his epic search for justice and peace . . . \\n A great evil has awakened in the land of Corona, a terrible demon determined to spread death and misery. His goblin armies and fearsome giants ravage the settlements of the frontier, and in the small village of Dundallis their merciless attack leaves behind two shattered orphans: Pony and her lifelong friend, the youth Elbryan. Taken in by elves, Elbryan is raised to become a formidable ranger--a fateful role that will lead him into harrowing confrontation. \\n Meanwhile, on a far-off island, a shower of gemstones will fall onto the black sand shores. These heaven-sent stones carry within them an incredible power--the key to all that is good in the world and all that is evil, and it is up to one young monk to liberate them from the corrupt monastery that harvests them. Pray that they don\u0027t fall into the wrong, clawed hands . . .\\n","cover":"https://allnovel.net/images/the-demon-awakens-the-demonwars-saga-1.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-demon-awakens-the-demonwars-saga-1.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:30:59 PM"}}
