{"id":98188,"no":30,"title":"Page 30","content":"They gave him but two stones: a smooth yellow-hued sunstone and a cabochon garnet, a carbuncle, the deepest shade of red. The former, among the most valued stones at St.-Mere-Abelle, could protect the man from almost any stone magic, could kill all magic in an entire area and render all spells useless within it, and the latter, the seeking stone, could show him the way to magic. Thus was Brother Justice equipped to find and destroy Avelyn.\n He set out from the abbey one dark and dreary morning, riding an ash-gray mare, not swift of hoof but long in heart. The horse could go for many hours, and Brother Justice, so focused on the completion of his vital task, pushed her to her limits.\n He traveled first to Youmaneff, the village where Avelyn Desbris had been born, some three hundred miles from St.-Mere-Abelle. He went to the small cemetery on the hill outside the place first, found the stone raised in memory of Annalisa Desbris, and noted with some satisfaction that the name of Jayson Desbris had not been added.\n \"You have come to tell me of my son Avelyn?\" the old man asked as soon as Brother Justice, his brown robes marking him as an Abellican monk, knocked at his door.\n The simple question, asked so very sincerely, put the monk on edge.\n \"Is he dead?\" Jayson asked fearfully.\n \"Should he be?\" Brother Justice retorted.\n The old man blinked many times, then shook his. head. \"Forgive my lack of manners,\" he bade the visitor, moving to the side of the door and sweeping his hand, an invitation for the monk to enter. Brother Justice did so, his head bowed to hide his cruel smile.\n \"I had only assumed that a visit from a man of St.-Mere-Abelle would be to give tidings of Avelyn,\" Jayson explained. \"And since the visit was not from Avelyn --\"\n \"Where is Avelyn?\" The monk\u0027s tone was flat and cold, a snapping question that sent Jayson back on his heels and had the hair on his neck standing on end.\n \"You would know better than I,\" the old man replied quietly. \"Is he not at the monastery?\"\n \"You know of his long journey?\" the monk asked sharply.\n Jayson shook his head, and Brother Justice sensed that he was truly confused.\n \"I last saw my son in the fall of God\u0027s Year 816,\" Jayson explained, \"when I handed him into the care of St.-Mere-Abelle, into the arms of God.\"\n Brother Justice found he believed every word, and that fact only made him all the more angry. He had hoped for information from Jayson Desbris, a direction to take that he might end this foul business quickly and efficiently. But Avelyn had apparently not come home, or at least, had not made contact with his father. Now the monk was torn, not knowing whether he should kill the old man, erasing any trace of his pursuit of Avelyn should he come home, or simply brush away any sense of misgivings Jayson might hold, putting the visit in a more congenial light.\n That would not work, Brother Justice realized, for if Avelyn did come home and learn of a visit from a monk, then he would know that this had been no social call. Still, to slay the old man might make things even more complicated, for then he would be marked by the local officials and perhaps even hunted.\n There was one other way.\n \"I fear to tell you that your son is dead,\" he said with as much conviction as he could muster -- and that was not considerable.\n Jayson leaned heavily on a table, and seemed suddenly very much older indeed.\n \"He fell from the abbey walls,\" Brother Justice went on, \"into All Saints Bay. We have not recovered his body.\"\n \"Then why did you come here with questions as to his whereabouts?\" came a sharp question from the side of the room. A large man, perhaps ten years older than Brother Justice, stormed into the room, his dark brown eyes filled with outrage.\n Brother Justice hardly paid the man any heed -- at least outwardly. He kept his focus on Jayson and tried to cover his previous questions. \"Avelyn has taken his long journey,\" the monk said quietly, and that reference, put in terms of a spiritual flight, slowed the mounting anger in Avelyn\u0027s brother Tenegrid.\n \"He is with God now,\" Brother Justice finished.\n Tenegrid came right up to the monk, glaring down at the shorter man. \"But you never found his body,\" he reasoned.\n \"The fall is too great,\" Brother Justice said quietly. He had his hands in front of him, buried within his voluminous sleeves. They were not clasped, rather, his right hand was cupped, fingers set tight, forearm muscles twitching from the strain.\n \"Be gone from this house!\" Tenegrid commanded. \"Foul messenger who comes and taunts with questions before speaking the truth!\" It was an obviously misplaced anger, an expression of pain and with no real resentment aimed at Brother Justice. Tenegrid was wounded as much by the sight of his grief-stricken father as by the news of his brother\u0027s death. Brother Justice understood this, though he hardly sympathized.\n Still, the vicious monk would have let it go, but then Tenegrid made a dangerous mistake.\n \"Be gone!\" he repeated, and he put his hand on the stocky man\u0027s strong shoulder and started to push him toward the door. Faster than his eyes could follow, Brother Justice\u0027s cupped hand snapped up and out to the right, striking Tenegrid squarely across the throat. The man fell away a couple of staggering steps, grabbed the back of a chair for support, and then fell over anyway, the chair tumbling down about him.\n It took considerable willpower for Brother Justice, his blood so hot for the kill, to turn away for the door. He wanted to vent his rage on this brother of foul Avelyn, wanted to rip the man\u0027s head right off before his father\u0027s eyes and then slowly murder the father as well. But that would not be prudent, would likely make his course to Avelyn, the grandest prize of all, much more difficult.\n \"We of St.-Mere-Abelle are sorry for your loss,\" he said to Jayson Desbris.\n The old man incredulously looked up from his son, who was still lying on the floor holding his wounded throat and gasping for breath, to see the monk depart.\n The one obvious lead fruitless, Brother Justice had to turn to his magic, to the carbuncle, a stone also called Dragon Sight for its ability to detect things magical. He rode out of Youmaneff\n shortly thereafter, finding no magical emanations in or about the pitiful village. This was worse than a cold trail, Brother Justice realized, for this was no trail at all.\n The world seemed wide indeed.\n His first contact with magic came a few days later on the open road when he happened by a merchant caravan. One of the merchants had a stone -- and admitted as much when Brother Justice cornered him alone inside his covered carriage. It was merely a diamond chip, useful for saving the candles and oil on long journeys.\n The monk was soon again back on the road, riding steadily and making a general course to the north. The largest city in Honce-the-Bear was Ursal, so that, he figured, might be a good place to start. Brother Justice knew the pitfalls, though. Many merchants in Ursal likely possessed stones; the monastery was not averse to selling them. His garnet would lead him down a hundred different avenues, to one dead end after another. But still, considering the limited range of the Dragon Sight stone -- it could not locate magic more than a few hundred feet away -- Brother Justice would have more of a chance in a confined city than in the vast open spaces of central and northern Honce-the- Bear.\n He wasn\u0027t a third of the way to Ursal, though, when his course took a different direction, when the trail suddenly heated up.\n It happened purely by chance in a hamlet too small even to have a name, a place a certain \"mad friar\" had passed through only a few weeks before on his way to Dusberry on the Masur Delaval. The reaction of the inhabitants to Brother Justice\u0027s brown robes tipped the monk off to the fact that he was not the first Abellican monk to come through this place recently. People sighed when he walked in, seemed fearful at first, and then, as if recognizing that he was a different man than they had originally feared, they sighed again, this time in obvious relief.\n When questioned, they were all too ready to give an account of the \"mad friar\" who had visited their village, offering portents of doom and starting a wild fight in the tavern. One man showed Brother Justice a broken arm, still far from healed.\n \"Not good business for the church, I\u0027m thinking,\" the man offered, \"to have one o\u0027 yer own wandering about hurting folks!\"\n \"More than a few folk have turned away from St. Gwendolyn of the Sea since the fight,\" the bartender of the tavern added.\n \"This monk was of St. Gwendolyn?\" Brother Justice asked, recognizing the name of the monastery, a secluded fortress nestled high on a rocky bluff, perhaps two days\u0027 ride to the east.\n The man with the broken arm shrugged noncommittally, then turned to the bartender, who likewise had no answers.\n \"He wore robes akin to yer own,\" the bartender remarked.\n Brother Justice wanted desperately to inquire if the man carried any magical stones, if there was any magic about him at all, but he realized that these two would not likely have held back such information if they had it, and he didn\u0027t want to tip his hand too much to anyone, fearing that Avelyn would be all the more difficult to find if he realized he was being hunted.\n So the monk got a description, and though it was not an exact image of the Avelyn Desbris he had known, it was enough to hold his curiosity. So, suddenly, he had a description, a title -- \"the mad friar\" -- and a direction, the folk of the hamlet uniformly insisting the monk had gone down the western road with his companion, a beautiful young woman of about twenty years, close beside him.\n The trail was warm, and it led Brother Justice from town to town, across the countryside to Dusberry on the Masur Delaval. He picked up even more clues as he went, for in one skirmish in a bar this mad friar had, apparently sent a pair of men flying with a blue shock.\n Graphite.\n Less than a month after he had set out from the tiny hamlet, confident that he was steadily gaining on this rogue monk, Brother Justice walked through the fortified gates of Palmaris.\n Only two short days later, Brother Justice used his Dragon Sight stone to detect the use of strong magic, coming from the northeastern quarter of the city, the high ground of rich houses overlooking the Masur Delaval. Convinced that his prey was in reach, a lion staring down the face of an old and weary zebra, the monk rushed through the streets, through the crowded marketplace, knocking over more than one surprised person. He was a bit apprehensive when he got to the gates of the indicated house, a huge structure of imported materials: smooth white marble from the south, dark wooden beams from the Timberlands, and an assortment of garden artwork that could only have come from the galleries of the finest sculptors in Ursal. Brother Justice\u0027s first thought was that Avelyn had hired on with this obviously wealthy merchant, perhaps to perform some necessary feat with the stones, perhaps merely as a court jester. The fierce monk tried to hold hard to that hope, for, logically, he could not dismiss his doubts. Would Avelyn, who held the stones as most sacred, rent out their powers? Only in emergency, Brother Justice realized, and since Avelyn could not have been in Palmaris for more than a couple of weeks, this was not likely a familiar house to him.\n That left another possibility, one the monk did not wish to entertain. He went over the gate easily, lighting down in the front yard without a whisper of sound. There were many hedges and high bushes; he could get to the door without drawing notice from within or from the wide street behind him.\n He understood his error before he had gone a dozen paces when he heard the growl of a sentry dog.\n Brother Justice spat a curse and saw the animal, a massive, muscled beast, black and brown with a huge bony skull and wide jaw full of gleaming white teeth. The dog hesitated only a moment, taking full measure of the man, then came on in a dead run, lips curled back to show Brother Justice those awful teeth with every stride.\n The monk crouched low, bent his legs, and tightened his muscles, measuring the dog\u0027s swift approach. The beast came in fast and hard, but just as it was about to leap for the man\u0027s throat, Brother Justice confused it by jumping high into the air, curling his legs under him.\n The dog skidded to a stop, its momentum too great for it to effectively change its angle of attack, and then Brother Justice came down hard on its back, kicking both his legs straight down as he descended.\n The dog\u0027s legs splayed wide; it gave one yelp, then lay still, its back broken, its lungs collapsing.\n The monk, convinced that the animal could not cry out any further warnings, walked on toward the house. He decided to take a straightforward approach and went right to the front door, knocking hard with the large brass knocker, another imported and sculpted item, he knew, this one in the shape of a leering, stretched face.\n As soon as he saw the handle begin to turn, the monk lifted one foot and went into a spin, timing it perfectly so that his foot connected with the door just as it began to open. The man on the other side, a servant, flew to the floor as the door swung wide and Brother Justice entered.\n \"Your master?\" the monk asked flatly.\n The stunned man stammered, taking too long for the impatient monk\u0027s comfort.\n \"Your master?\" Brother Justice demanded again, grabbing the man by the collar and lifting him to his feet.\n \"He is indisposed,\" the man replied, at which Brother Justice slapped him hard across the face, then clutched him on the neck, a grip that left no doubt in the man\u0027s mind that this intruder could rip out his throat with hardly an effort. The man pointed toward a door across the foyer.\n Brother Justice dragged him along. He let go before he reached the door, though, tossing the poor servant to the floor as he felt the first waves of intrusion, magical intrusion, an attack aimed his way and corning from within the room.\n The monk quickly took out his yellow sunstone, falling immediately into its defensive magic. The attack was fairly strongthough he would have expected more from powerful Brother Avelyn -- but the sunstone was among the most potent of all the stones of St.-Mere-Abelle, its defenses even more complete than the chrysoberyl more commonly used, and its power was more tightly focused than any other, a simple shield against magic. In an instant, a yellowish glow surrounded the monk, and the waves of intrusion were halted.\n The monk snarled in defiance and kicked at the heavy door. It jolted but did not open. He kicked again and again, repeatedly slamming the lock, until finally, the wood of the jamb gave way, the door flying wide to reveal a portly man, richly dressed, standing behind a large oaken desk, a loaded crossbow in hand.\n \"You have one shot,\" Brother Justice said evenly, striding directly into the room, his eyes locked on those of the merchant. \"One shot, and if it does not kill me, I will torture you to a slow death.\"\n The man\u0027s hands trembled; Brother Justice knew that without even looking at them. He saw the merchant flinch as a line of sweat rolled from his brow into one eye, saw the man chewing his lip.\n \"Not another step!\" the merchant said with all the courage he could muster.\n Brother Justice stopped and smiled wickedly. \"Can you kill me?\" he asked. \"Is this the end you desire?\"\n \"I desire only to defend what is mine,\" the merchant replied.\n \"I am no enemy.\"\n The merchant stared at him incredulously.\n \"I had thought you to be another,\" Brother Justice said calmly, turning his back on the merchant to close the door as tightly as the shattered jamb would allow. He sneered at the curious servants gathering in the hall to keep them at bay. \"I am hunting a dangerous fugitive, one who employs the magic of the stones,\" he explained, turning back to the merchant, a disarming look on his face. \"I had not thought that any but he would be so powerful with the magic.\" Brother Justice did well to hide his wicked grin as the crossbow slipped down.\n \"I am always ready to lend aid to those of St. Precious,\" the merchant declared.\n Brother Justice shook his head. \"St.-Mere-Abelle,\" he corrected. \"I have traveled the breadth of Honce-the-Bear in my most vital quest. I had thought it to be at its end. Forgive my entrance; my Father Abbot will reimburse you for all the cost.\"\n The merchant waved his hand, his face brightening at the mention of the man. \"How fares old Markwart?\" he asked, his tone one of familiarity.\n Again the monk restrained his feeling of outrage that this man -- this simple, pitiful, wretched merchant could speak of Father Abbot Markwart as if he were the man\u0027s equal. Obviously he had dealt with Markwart -- where else would he have garnered so powerful a stone? -- but Brother Justice understood the relationship between the merchants and the abbey far more clearly than did the merchants. Father Abbot Markwart was always willing to take their money, but never in exchange for honest respect.\n \"Perhaps, then, I can help you with your quest,\" the merchant offered. \"Ah, but where are my manners? I am Folo Dosindien, Dosey to my friends, to your Father Abbot! You must be hungry or perhaps in need of a drink.\" He lifted his hand and started to call out, but Brother Justice cut him short.\n \"I require nothing,\" he assured the merchant.\n \"Nothing but help in your search, perhaps,\" the man said teasingly.\n The monk tilted his head, somewhat intrigued. The man had at least one powerful stone -- he knew that and suspected it to be hematite. Many things could be accomplished with such a stone.\n \"I seek a fellow monk,\" Brother Justice explained. \"He is known as the mad friar.\"\n The merchant shrugged; the name obviously meant nothing to him. \"He is in Palmaris?\"\n \"He came through, at least,\" the monk explained, \"not more than two weeks previous.\"\n The merchant sat down behind his desk, his features tightening with concentration. \"If he travels, if he is an outlaw, then likely he would have sought out the lowlier regions of the southern docks,\" he reasoned. He looked up at the monk, his expression resigned. \"Palmaris is a large place.\"\n Brother Justice did not blink.\n \"I have offered my name,\" the man prompted.\n \"I have no name to offer,\" replied Brother Justice, and the tension grew once more, instantly emanating from the monk\u0027s cold stare.\n Dosey cleared his throat.\" \"Yes,\" he said. \"I wish that I had more answers to give to one of Markwart\u0027s underlings.\"\n Brother Justice narrowed his eyes, not appreciating the sentiment, the way the foolish merchant tried to dominate him by referring to his superior in such familiar terms.\n \"But there is a place,\", the merchant whispered, coming forward suddenly in his chair, \"where one might get answers. Answers to any question. in all the world.\"\n Brother Justice had no idea where this conversation was going, had no idea what to make of the man\u0027s sudden, almost maniacal expression.\n \"But not until we have dined,\" Dosey said, falling back in his chair. \"Come, then, I will set for you a table unrivaled in Palmaris, that you might return to St.-Mere-Abelle with kind words for Markwart\u0027s dear old merchant friend.\"\n Brother Justice played along, and, indeed, the merchant Dosey was not exaggerating. His servants -- the man Brother Justice had dropped to the foyer floor and three women, one undeniably beautiful -- brought in course after course of the finest cuts of meat and the sweetest fruits. Juicy lamb and thick cuts of venison buried in brown sauces and mushrooms, oranges that exploded in a shower of juice as soon as the integrity of their peels was breached, and large, round, yellow melons that the monk had never before seen but that were sweeter than anything he had ever tasted.\n He ate and he drank, neither to excess, and when the meal was over, some two hours later, he again sat quietly and let the merchant guide the conversation.\n The man rambled on and on, telling mostly stories of his dealings with the various monasteries of Honce-the-Bear, even with St. Brugalnard in faraway Alpinador. Brother Justice knew that he was supposed to be impressed, and he worked hard to pretend that he was as the minutes dragged on into yet another hour. Dosey interrupted, his tales only for an occasional belch; so lost was he in his own sense of importance that he hardly bothered to gauge the monk\u0027s reaction. Brother Justice figured that the man was accustomed to dealing with people in need of or with great desire for his wealth, and, thus, he could ramble on and on to an attentive though captive, audience. Such were the trappings of power that Dosey did not realize what an ultimate bore and ridiculous buffoon he truly was.\n But Brother Justice needed the merchant, as well, or at least it seemed plausible that the man might aid the monk in his all-important quest. That alone held the monk at the table long after the sun had set.\n Finally, so suddenly that the surprise shook the monk from his almost dreamlike state of boredom, Dosey announced that it was time to get some answers and that these things were better done in the dark.\n The mysterious tone of his voice set the monk on his guard, though, in truth, Brother Justice really didn\u0027t expect much from the merchant. Perhaps the fool Dosey would use his hematite to invade the bodies of several innkeepers from the lowlier sections of the city, using their forms to inquire about the mad friar.\n The pair went back to Dosey\u0027s study, to the great oaken desk. Dosey had his manservant retrieve a second chair, placing it at the desk\u0027s side, and then he bade the monk to sit and relax.\n \"I could go,\" the merchant offered, and then he shook his head, as if not liking that notion, almost as if he were afraid of that thought.\n Brother Justice made no move at all to reply, no verbal or body language to let the man know that he was even the least bit intrigued.\n \"But perhaps you should see for yourself,\" the merchant went on, a wry smile on his face as he spoke. \"Would you like to go?\" he asked.\n \"Go?\"\n \"For your answers.\"\n \"I know not of this place of which you speak,\" Brother Justice admitted. \"You have a stone, that much I know.\"\n \"Oh, much more than a simple stone,\" Dosey teased. He reached under the lapel of his fine gray jacket and produced a pin, a large broach, and held it out for Brother Justice to see. Now the monk could not fully hide his interest. The central stone of the broach was a hematite, as he had suspected, an oval of liquid gray, deep and smooth. Encircling it, set in the yellow gold, were a series of small, clear, round crystals. Brother Justice did not immediately recognize them, for they might have been several different types, but he sensed that they were indeed magical, in some way tied to the powers of the hematite.\n \"My own design,\" Dosey bragged. \"The fun of the stones is in combining their powers, is it not?\"\n The fun, Brother Justice silently echoed, hating this man and the irreverence with which he spoke of something so sacred. \"This broach presents a, combination not known to me,\" the monk admitted.\n \"Simple clear-crystal quartz,\" Dosey explained, running his finger about the large broach\u0027s edge. \"For distant sight.\"\n A stone of divining, Brother Justice then realized, and he was beginning to catch on. With the clear quartz, a man could send his vision across the miles; perhaps combining that with the spiritwalking of the hematite . . .\n \"With this, you can go to a place to find your answers,\" Dosey promised, \"a place that only I know of. The home of a friend, a powerful friend indeed, one that would impress your Markwart, to be sure!\"\n Brother Justice hardly noted the familiar reference to the Father Abbot this time, so caught up was he in the implications. His intrigue was fast shifting to trepidation now, as he got the distinct feeling that he had stumbled on to something potentially dangerous. He recalled Dosey\u0027s fearful expression when he hinted that he would make the journey, a mixture, it seemed, of the sheerest horror and the highest titillation. What manner of being could so inspire such a reaction? What, then, lay at the end of this spirit journey?\n A shudder coursed up the monk\u0027s spine. Perhaps the monastery should reconsider its practice of selling stones to fools like Dosey.\n The thought flew away in an instant, for this monk, this Brother Justice, had been trained to be unable to hold long to any ill feelings, any questions at all, concerning the decisions of his superiors.\n \"Go,\" Dosey bade him, handing over the broach. \"Let the stone guide you. It knows the way.\"\n \"Am I to possess the body of another?\"\n \"The stone knows the way.\" It was spoken simply, calmly, and, somehow wickedly. That part of Brother Justice, that small flicker of memory that recalled his life as Quintall, recognized Dosey\u0027s expression as that of an older boy pressing a youngster to mischief.\n He took the broach, felt its power in his hand, eyeing Dosey cautiously all the while. His physical body would be vulnerable while spirit-walking, he knew, but he doubted that Dosey would strike against one of Markwart\u0027s emissaries. Even if he did attack, Brother Justice, already using the hematite, figured that he would have little trouble possessing the merchant\u0027s body. And Dosey likely knew the same thing, and that understanding, the monk decided, would give him the insurance he needed.\n So Brother Justice sat back in the chair, closed his eyes, and let the magic of the broach engulf him. He visualized the hematite as a dark liquid pool and he waded in slowly, letting the physical world dissipate into gray nothingness. Then his body and spirit were apart, two separate entities. The monk looked about the room from this new perspective, but his eyes could not remain fixed on anything but the clear stones surrounding that hematite. They pulled at him as forcefully as anything he had ever felt, a compulsion too great to ignore. Doubts about the wisdom of his choice, about the wisdom of selling such powerful stones to fools, flapped up about him, flashes of dark wings that beat at the will of the powerful monk.\n He was sinking, ever sinking, into that crystal glare, away from the room, away from his corporeal body and the fool Dosey.\n And then he was flying, faster than thought, across the miles. Time and distance warped. It seemed as if an hour went by, but then as if only a second had passed; what appeared as an infinite plain was crossed by a single step. On and on Brother Justice flew, north to the Timberlands, to the Wilderlands, across great lakes and deep forests, and then to mountains, towering peaks.\n So many times he thought he would collide with jags of stone only to watch them rush under him at the last possible second. He had never imagined such an attunement of stone magic, that these crystals could be so focused in their divination. It was something dangerous and beyond his understanding -- and he knew as much about the stones as any man alive, with, as far as he knew, the exceptions of only Father Abbot Markwart and Avelyn Desbris!\n He crossed the range into a huge, high valley, a great plateau ringed by the towering mountains. Below him, massed like ants, were the campsites of armies. He wanted to go lower, to distinguish the individual forms, to see what force had gathered in such unbelievable numbers, but the compelling crystals would not let him out of their grasp. He flew on above the plateau to a singular, smoking mountain, its southern face tree covered, but with two black arms reaching down, reaching out to encompass the gathered armies.\n Brother Justice nearly swooned, his senses overwhelmed by the sheer speed at which his spirit entered a series of connecting narrow tunnels. Every breakneck turn jolted him, though his physical form was hundreds of miles away. Every dip and sudden rise blurred his vision, scrambled his thoughts.\n He came up fast on a pair of great bronze doors, inlaid with a myriad of designs and symbols. They opened but a crack, and through that tiny space flew his disembodied spirit into a huge chamber lined by stone columns that resembled gigantic sculpted warriors. He soared through their twin lines, his attention stolen as he approached the far end of the chamber, a raised dais, and a creature whose strength was beyond anything Brother Justice had ever known, whose emanations of power and of evil mocked life itself.\n The flight stopped, leaving Brother Justice standing right before the dais. He considered his own form, for normally spiritwalkers were invisible. Not in here, though. The monk could see himself, as he appeared within his corporeal trappings, except that he was a singular shade of gray and translucent, so that he could look right through his form to see the gray stone beneath his feet.\n But that spectacle couldn\u0027t hold Brother Justice\u0027s attention for any length of time, not with this huge monstrosity leering at him from on high. What monster was this? the monk wondered as he studied the reddish skin and black eyes, the bat wigs, horns, and claws. What manifestation of hell had come to walk the material world? What demon?\n The questions spiraled into a singular line of thought, a singular fear that threatened to break the monk\u0027s very mind. He knew! From his lessons, years of religious training, years of his masters imparting the fears of that which opposed their God.\n He knew!\n You have destroyed the fool Dosey, then, the creature telepathically imparted to the monk, and have stolen his treasure. The instant that last thought ended, Brother Justice felt an intrusion that he could not deny, a sudden scouring of his brain, of his identity, his intentions. Sheer revulsion saved him, catapulted his spirit out of that terrible place like a slingshot snapping back through the tunnels, across the plateau, above the swarming soldiers that he knew then were an army of evil, across the mountains and then the forests, the lakes, careening all the way back to Palmaris, to the merchant\u0027s study, and back into his body so suddenly that the physical form nearly toppled over.\n \"Do you know now?\" Dosey asked him even as his eyes blinked open.\n Brother Justice looked into that maniacal expression and saw the result of contact with such a creature clearly etched on Dosey\u0027s face. He wanted to shake the man and ask him what he had done, what he had awakened -- but it was far beyond that, Brother Justice realized before he ever uttered a word. The man had passed the point of redemption and had perhaps awakened a dangerous curiosity in the demon.\n Up came the monk\u0027s hands, locking fast on Dosey\u0027s throat. Dosey grabbed at the monk\u0027s wrists, tugging futilely, trying to cry for help, scream, anything. The muscles on Brother Justice\u0027s arms stood taut and too strong to fight. The monk drove the feeble merchant to his knees and held fast long after the struggling stopped, long after the merchant\u0027s arms fell slack at his sides.\n His mind whirling with outrage and fear, Brother Justice stalked about the house, finding the servants and the merchant\u0027s family.\n He left long after midnight, battling his confusion with a wall of sheer anger. The broach was in his pocket, the house of Folo Dosindien was dead. \n","sourceLink":"https://allnovel.net/the-demon-awakens-the-demonwars-saga-1/page-30.html","bookId":2167,"book":{"id":2167,"title":"The Demon Awakens (The DemonWars Saga #1)","description":"Storyline: \n The Demon Awakens (The DemonWars Saga #1) \n In THE DEMON AWAKENS, bestselling author R. A. Salvatore creates an astonishing new world for readers to explore--and an intrepid hero to lead the way: Elbryan Wynden, who must confront the dark tides of destiny in his epic search for justice and peace . . . \n A great evil has awakened in the land of Corona, a terrible demon determined to spread death and misery. His goblin armies and fearsome giants ravage the settlements of the frontier, and in the small village of Dundallis their merciless attack leaves behind two shattered orphans: Pony and her lifelong friend, the youth Elbryan. Taken in by elves, Elbryan is raised to become a formidable ranger--a fateful role that will lead him into harrowing confrontation. \n Meanwhile, on a far-off island, a shower of gemstones will fall onto the black sand shores. These heaven-sent stones carry within them an incredible power--the key to all that is good in the world and all that is evil, and it is up to one young monk to liberate them from the corrupt monastery that harvests them. Pray that they don\u0027t fall into the wrong, clawed hands . . .\n \n","cover":"https://allnovel.net/images/the-demon-awakens-the-demonwars-saga-1.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-demon-awakens-the-demonwars-saga-1.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:30:59 PM"}}
