{"id":82050,"no":112,"title":"Page 112","content":"His hand was holding hers…\\n\\n Filled with a feeling that was part joy, part awe, and part reverence, he gazed down at the woman who had just sent him to unparalleled heights of desire and unequalled depths of satisfaction. Her eyes fluttered open, and he tried to smile, to tell her that he loved her, but his chest was constricted with emotion, and there was an unfamiliar lump in his throat as he looked at their clasped hands on the pillow.\\n\\n He had never held a woman\u0027s hand at a time like this in his life.\\n\\n He had never thought of it.\\n\\n He had never wanted to.\\n\\n Until now.\\n\\n Sheridan felt his hand tighten on hers and sensed instinctively what he was looking at with that strange expression of tenderness on his handsome face. Weak from the passion they\u0027d shared, it took an effort to move her right hand from his nape and to put it on the pillow beside her face, where he could reach it. His long fingers slid over her palm and then twined with hers, closing tightly.\\n\\n Stephen bent his head and kissed her lips, their bodies joined, their hands clasped. He closed his eyes, swallowed, and tried to tell her again what he felt, to explain that he\u0027d never known there were feelings like this, but the emotions were still too raw, and he was still out of breath. All he could manage to say was, \"Until you…\"\\n\\n She understood. He knew she did, because her hands tightened convulsively on his and she turned her face and kissed his fingers.\\n\\n Epilogue\\n\\n Seated in the drawing room at Montclair amidst exquisite furnishings that had once occupied European palaces, surrounded by all the trappings of his wealth and position, Stephen Westmoreland looked up at the gilt-framed portraits of his ancestors that lined the silk-panelled walls, and he wondered if they\u0027d had as much trouble as he was having trying to be alone with his bride of two days.\\n\\n Above the fireplace mantel, the first Earl of Langford looked down at him from atop a mighty black warhorse, a visored helmet under his arm, his cloak swirling behind him. He looked like the sort of man who would have tossed his knights into the moat to get rid of them if they didn\u0027t have sense enough to leave him alone in his castle with his new bride.\\n\\n On the wall across from Stephen, the second Earl of Langford reclined in front of his fire with two of his knights. His wife was seated nearby, surrounded by women working on a tapestry. The second earl had a more civilized look than his father, Stephen decided. That ancestor would have been more likely to send his knights on a trumped-up errand and then order his drawbridge pulled up.\\n\\n Bored with studying his ancestors, Stephen turned his head slightly and indulged in the more pleasurable occupation of studying his wife who was seated across from him, surrounded by his mother, his brother, Whitney, and Nicholas DuVille. Mentally, he tipped her chin up and kissed her while, with his free hand, he teased the shoulder of her lemon gown off, slipping it down her arm, then cupped her full breast and deepened the kiss. He was trailing a kiss down the side of her neck, working slowly to the nipple he wanted to kiss, when he realized Nicholas DuVille was watching him with a look that was both amused and knowing. Stephen was spared the embarrassment of blushing like an errant schoolboy by the arrival of Hodgkin, whom he\u0027d retrieved from exile yesterday, and who walked to his side. \"Excuse me, my lord,\" Hodgkin said, \"but you have guests.\"\\n\\n \"Who are they?\" Stephen said irritably, swallowing the impulse to tell the old man to pitch the new arrivals into the lake—since he had no nice, deep moat with which to dispose of them—and then to bar the gates at the entrance to the estate.\\n\\n Hodgkin lowered his voice and whispered. As he explained the situation, Stephen\u0027s annoyance gave way to resignation that he would have to see Matthew Bennett, who\u0027d evidently just returned from America—and then to puzzlement that Bennett had evidently brought people with him. \"Excuse me,\" he said to his guests, who were too absorbed in a discussion of Sherry\u0027s housekeeping decisions to notice he was leaving. His wife noticed, however. She stopped listening to advice on the running of a large household and looked up at him with a smile that said she, too, wished they were alone.\\n\\n Matthew Bennett launched into his explanation before Stephen was clear into his study. \"I apologize for my untimely arrival, my lord,\" the solicitor said. \"Your butler explained that you were newly wed and not receiving visitors, but your instructions when I left for America were that I was to locate Miss Lancaster\u0027s relatives and escort them back to England at once. Unfortunately, Miss Lancaster\u0027s only living relative—her father—died before I reached the Colonies.\"\\n\\n \"I know,\" Stephen said. \"I received a letter that was intended for Burleton and it contained that information. Since she had no other relatives, who did you bring back with you?\"\\n\\n The solicitor looked defensive and a little harassed. \"You see, Miss Lancaster was travelling with a paid companion, a young woman by the name of Sheridan Bromleigh, who was expected to return at once to America. No word has been heard from Miss Bromleigh, and her aunt—a Miss Cornelia Faraday—was most insistent that a search be instituted all over England to discover her whereabouts. Unfortunately, Miss Faraday did not feel she could rely upon either you or myself to handle that search. She was most insistent about accompanying me back to England in order to supervise it herself.\"\\n\\n During one of their two nights alone together, Sheridan had told him about the aunt who had partially raised her and about the father who had disappeared without a word several years ago. Now, it looked as if he would be able to give Sherry an unexpected \"wedding gift.\" The fact that he was obviously acquiring another houseguest rankled, but it was compensation enough to know how happy she was going to be. \"Excellent!\" Stephen said with a smile.\\n\\n \"I hope you feel that way when you meet the lady,\" Bennett said wearily. \"She is quite—determined—to locate her niece.\"\\n\\n \"I think I can handle that with surprising speed,\" Stephen said with a smile of anticipation over the scene which was sure to unfold in the drawing room in a few minutes. \"I know exactly where Miss Bromleigh is.\"\\n\\n \"Thank God!\" Bennett said wearily. \"Because Miss Bromleigh\u0027s father, who\u0027d been missing for four years, returned while I was in America. He and his friends were every bit as worried about her—and every bit as determined to see that you did what needed to be done to ensure she was safely returned to them.\"\\n\\n \"Miss Bromleigh is very safe,\" Stephen assured him with a grin. \"She is not, however, going to be \u0027returned\u0027 to them.\" \\n\\n","sourceLink":"https://allnovel.net/until-you-westmoreland-saga-3/page-112.html","bookId":1803,"book":{"id":1803,"title":"Until You (Westmoreland Saga #3)","description":"Storyline: Sheridan Bromleigh had spent most of her early life as a happy vagabond with her unruly American father and his vagrant friends. Then, given over to the care of a strict maiden aunt, she was taught to be a lady - poor but genteel - and finally a teacher. When she was hired to act as chaperone to a pretty but spoilt heiress travelling to England to join an aristocratic fiance, Sheridan was delighted. Now, at last, she could visit her family\u0027s country. But somehow everything went wrong. \\n For Miss Charise Lancaster, not over-gifted with intelligence, eloped with a stranger before she could meet her suitor. And Sheridan was left with the horrid task of telling Lord Burleton she had somehow misplaced his bride. As she gazed at the tall, confident man before her, her courage failed. She was doubly shocked when she heard his news. Lord Burleton, a drunkard and a wastrel, had been killed the night before. At which point fate took over. Sheridan was knocked unconscious on the quayside, and recovered to find herself in the handsome stranger\u0027s care, not knowing who she was. \\n It was to be the beginning of a dazzling, witty, dramatic, and romantic sequence of events in which every possible confusion was to take place.\\n","cover":"https://allnovel.net/images/until-you-westmoreland-saga-3.jpg","author":"Judith McNaught","type":"Historical","source":"allnovel","link":"https://allnovel.net/until-you-westmoreland-saga-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:36:12 PM"}}
