{"id":81981,"no":42,"title":"Page 42","content":"\"Charming,\" the Frenchman said with a tranquil smile. \"And unique, I suspect. Based on what I have witnessed, I cannot believe Stephen is immune to her attractions.\" Satisfied that he\u0027d gathered all the support he could have hoped, Hugh looked at Clayton Westmoreland, the one member of the group who he knew could, and would, put a stop to any sort of intervention if he didn\u0027t agree. \"Your grace?\" he invited. The duke gave him a steady look, and said one word, very clearly and very distinctly: \"No.\" \"No?\" \"Whatever you\u0027re thinking, forget it. Stephen will not welcome our interference in his personal life.\" Oblivious to his wife\u0027s swift intake of breath as she started to argue, he said, \"Furthermore, the entire situation he is in with Miss Lancaster is already impossibly complicated and fraught with deceit.\" \"But you do like her, don\u0027t you?\" Whitney put in a little desperately. \"Based on what little I know of her,\" Clayton emphasized, \"I like her very well. However, I am also thinking of her best interests. It would be wise if we all remember that when she recovers her memory and realizes that Stephen was responsible for her fiancé\u0027s death, and that he has been lying to her about everything since then, she is not going to like him nearly so well. In fact, she is unlikely to think very well of any of us, when that day arises.\" \"It\u0027s likely she will be embarrassed and angry when she first realizes she\u0027d never set eyes on Stephen until last week,\" Dr. Whitticomb conceded. \"However, even before she was out of danger, she showed great concern for Stephen. Kept asking me not to let him worry, and so forth. I think that shows a remarkable understanding—the sort that could enable her to see very quickly why we all had to lie to her.\" \"As I said before,\" Clayton said firmly, \"Stephen will not welcome our interference in his personal life. If anyone in the family feels the need to try to dissuade him from finding her a husband or to influence him in her favor in any way, then it should be done openly. Today. After that, the matter should be left to Stephen and Miss Lancaster and fate.\" Surprised when there was no objection from his wife, Clayton turned to tease her about her uncharacteristic acquiescence, but she was frowning at DuVille, who, in turn, seemed to be vastly amused about something. He was wondering about that silent exchange when Stephen strode swiftly into the study. 23 \"Sherry is safely out of hearing and out of the house,\" Stephen announced as he carefully closed the study doors behind him. \"I\u0027m sorry to have kept you waiting, but you were all more prompt than I anticipated.\" Walking over to his desk, he sat down behind it, passed a cursory glance over his accomplices, who were seated in a semicircle in front of the desk, and went directly to the point. \"Rather than getting mired down in the minor complications and details of sending Sherry out into Society,\" he said in a cordial, but businesslike tone, \"let\u0027s go directly to the subject of prospective husbands. Did you bring your lists of acquaintances who might serve the purpose?\" A rustling followed as the women searched their reticules and Whitticomb reached into his pocket to extract the lists they had prepared that morning at his instruction. His mother leaned forward and handed her folded sheet of writing paper to him, but she pointed out a major encumbrance. \"Without a dowry, Miss Lancaster is at a terrible disadvantage, no matter how desirable she might be. If her father isn\u0027t the man of means that you suspect—\" \"I\u0027ll provide a generous dowry,\" Stephen said as he unfolded the notepaper. He glanced at the first few names on the list, and his reaction veered from horror to hilarity. \"Lord Gilbert Reeves?\" he repeated, looking at her. \"Sir Frances Barker? Sir John Teasdale? Mother, Reeves and Barker must be fifty years older than Sherry. And Teasdale\u0027s grandson was at university with me. These men are ancient.\" \"Well, I\u0027m ancient!\" she protested defensively. \"You said we were to list any unmarried acquaintances for whom we could personally vouch, and that\u0027s what I did.\" \"I see your point,\" Stephen said, struggling to keep his face straight. \"While I look over the other lists, perhaps you could concentrate on some younger men of good reputation with whom you are not quite so personally acquainted?\" When she nodded agreeably, Stephen turned to his sister-in-law and smiled as he reached for her list. His smile faded, however, as he looked down the long list of names. \"John Marchmann?\" he said with a frown. \"Marchmann is a compulsive sportsman. If Sherry was ever going to see him, she\u0027d have to slog down every stream in Scotland and England and spend the rest of her life in the hunting field.\" Whitney managed a look of innocent confusion. \"He is exceedingly handsome, however, and he is also very amusing.\" \"Marchmann?\" Stephen repeated incredulously. \"He\u0027s terrified of women! The man still blushes in the company of a pretty girl, and he\u0027s nearly forty!\" \"Nevertheless, he is very kind and very nice.\" Stephen nodded absently, looked at the next name, and then at her. \"The Marquis deSalle won\u0027t do at all. He\u0027s a habitual womanizer, not to mention a complete hedonist.\" \"Perhaps,\" Whitney graciously conceded, \"but he does have charm, wealth, and an excellent address.\" \"Crowley and Wiltshire are both too immature and hot-tempered for her,\" he said, studying the two names. \"Crowley isn\u0027t too bright, but his friend Wiltshire is a complete bacon-brain. They dueled a few years ago and Crowley shot himself in the foot.\" Oblivious to her startled giggle, he added disgustedly, \"A year later they decided to settle another argument on the field of honor, and Wiltshire shot a tree.\" Bending a reproving look on his laughing sister-in-law, he added, \"It wasn\u0027t funny. The ball from Crowley\u0027s pistol ricocheted off the tree and hit Jason Fielding, who\u0027d raced out there to try to stop them. If it hadn\u0027t wounded Jason in the right arm, Crowley probably wouldn\u0027t have walked away in one piece. If Sherry married either one of them, they\u0027d manage to make her a widow by their own hand, mark my word.\" He looked at the next two names and then scowled at her. \"Warren is a mincing fop! Serangley is a dead bore. I can\u0027t believe you think these men are eligible suitors for anyone, let alone an intelligent, sensible young woman.\" For the next ten minutes, Stephen dismissed every name on the list for a variety of reasons that seemed very sound to him, but he began to have the annoying feeling that the group gathered around the desk was finding his rejection of suitor after suitor amusing.","sourceLink":"https://allnovel.net/until-you-westmoreland-saga-3/page-42.html","bookId":1803,"book":{"id":1803,"title":"Until You (Westmoreland Saga #3)","description":"Storyline: Sheridan Bromleigh had spent most of her early life as a happy vagabond with her unruly American father and his vagrant friends. Then, given over to the care of a strict maiden aunt, she was taught to be a lady - poor but genteel - and finally a teacher. When she was hired to act as chaperone to a pretty but spoilt heiress travelling to England to join an aristocratic fiance, Sheridan was delighted. Now, at last, she could visit her family\u0027s country. But somehow everything went wrong. For Miss Charise Lancaster, not over-gifted with intelligence, eloped with a stranger before she could meet her suitor. And Sheridan was left with the horrid task of telling Lord Burleton she had somehow misplaced his bride. As she gazed at the tall, confident man before her, her courage failed. She was doubly shocked when she heard his news. Lord Burleton, a drunkard and a wastrel, had been killed the night before. At which point fate took over. Sheridan was knocked unconscious on the quayside, and recovered to find herself in the handsome stranger\u0027s care, not knowing who she was. It was to be the beginning of a dazzling, witty, dramatic, and romantic sequence of events in which every possible confusion was to take place.","cover":"https://allnovel.net/images/until-you-westmoreland-saga-3.jpg","author":"Judith McNaught","type":"Historical","source":"allnovel","link":"https://allnovel.net/until-you-westmoreland-saga-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:36:12 PM"}}
