{"id":82000,"no":61,"title":"Page 61","content":"Stephen put his toe against the panel to stop her. \"I think you should consider making an exception.\" Her disdainful face appeared in the wedge of light between the jamb and the edge of the door. \"We do not make exceptions, sirrah!\" She saw who he was, and a look of comical disbelief momentarily shattered her expression of stony hauteur. \"Langford, is that you?\" \"Of course it is, now open the door,\" Stephen commanded quietly. \"You cannot come in.\" \"Letty,\" he said with strained patience, \"do not make me resort to unpleasant reminders of times when you\u0027ve invited me in to less appropriate places than this one—and with your poor husband practically within earshot.\" She opened the door, but placed herself in the opening. Stephen contemplated the efficacy of lifting her by the shoulders and moving her out of his way while she implored in a fierce whisper, \"Stephen, for God\u0027s sake, be reasonable! I cannot let you in. The other patronesses will have my head if I do.\" \"They will kiss you on both cheeks for making an exception in my case,\" he said flatly. \"Only think of the boost in attendance you\u0027ll have tomorrow, when it\u0027s learned that I was actually lured to this boring assembly of virtuous innocents for the first time in fifteen years.\" She hesitated, weighing the obvious truth of that against the peal that was likely to be rung over her head by the other patronesses before she could explain her motivations. \"Every eligible male in London will want vouchers to get in, so that he can see for himself what female could possibly have been exquisite enough to lure you here.\" \"Exactly,\" Stephen said sardonically. \"You\u0027ll have so many eligible men inside that you\u0027ll have to lay in an extra supply of warm lemonade and bread and butter.\" She was so delighted with the possibility of receiving credit for all the splendid matches made during her season as patroness, that she overlooked his disdainful slurs on the hallowed halls of Almack\u0027s, its refreshments, and its occupants. \"Very well. You may come in.\" The evening had not been the disaster Sherry had feared it would be. She had danced and been made to feel quite welcome. In fact, with a few uncomfortable exceptions, the evening had been very pleasant, but she had remained tense and expectant until a few minutes ago, when the clock finally indicated the hour of eleven. Now that the possibility of the Earl of Langford\u0027s appearance was eliminated, she felt incredibly disappointed, but she refused to succumb to anger or rejection. She\u0027d sensed he wasn\u0027t enthusiastic about coming here, and it was foolish to expect him to inconvenience himself for her. That would have implied some sort of concern or caring for her that she now accepted he simply did not have. Whitney and his mother had been wrong. Determined not to let thoughts of him occupy one more moment of her evening, she concentrated on the conversation of the young ladies and their mamas who were standing in a circle with her, talking among themselves, but politely including her. Most of the girls were younger than she, and very amiable, if not particularly given to intelligent discourse. They were however amazingly well-informed on the income, prospects, and lineage of every bachelor in the room, and she had only to look twice at a male to have them—or their mamas and chaperones—lean aside and obligingly share all their knowledge. The deluge of data confused Miss Charity and alternately embarrassed and amused Sherry. The Duchess of Clermont, a stern elderly lady who was introducing her granddaughter, another American named Dorothy Seaton, tipped her head toward a handsome young man who\u0027d asked Sherry for the honor of a second dance, and warned, \"I would not show young Makepeace more than the briefest civility, were I you. He is only a baronet, and his income is a mere five thousand.\" Nicholas DuVille, who\u0027d spent most of the evening in the card room, heard that as he returned to Sherry\u0027s side. Leaning down, he said in a low amused voice, \"You look quite terribly embarrassed, chérie. Amazing, is it not, that a country that prides itself on its refined manners has no compunction at all in discussing such things.\" The musicians who\u0027d paused briefly for refreshments were returning to their instruments, and music began to fill the ballroom. \"Miss Charity looks exhausted,\" Sherry said, raising her voice to be heard above the increasing volume of music and conversation. Miss Charity heard her name and looked up sharply. \"I am not weary, my dear child. I am exceedingly vexed with Langford for not making his appearance as he promised, and I intend to scold him soundly for treating you so shabbily!\" All around them heads were beginning to turn and conversations were dropping off, then escalating to frantic whispers, but Sherry was blissfully unaware of the cause. \"It doesn\u0027t signify, ma\u0027am. I\u0027ve done perfectly well without him.\" Miss Charity was not soothed. \"I do not remember being this annoyed in the last thirty years! And if I could remember all of the last thirty years, I\u0027m still certain I wouldn\u0027t remember being this annoyed!\" Beside them the Duchess of Clermont stopped eavesdropping on Charity Thornton\u0027s irate monologue, and she glanced up, her gaze riveting on something across the room. \"I cannot believe my own eyes!\" she burst out. Hectic conversations were erupting all around them, and she leaned sideways, raising her voice to be heard above it all as she commanded her granddaughter, \"Dorothy, attend to your hair and gown. This is a chance you may never have again.\" That gruff order drew Sherry\u0027s attention to Dorothy who had obediently reached up to pat her coiffure into place as were half the debutantes in Sherry\u0027s range of view. Those who weren\u0027t checking their hair were smoothing their skirts. Debutantes who weren\u0027t already lining up with their partners on the dance floor were making a mass exodus toward the retiring room, and they were also patting and smoothing on the way. \"What is happening?\" she asked, lifting quizzical eyes to Nicki, who was blocking her view. His gaze shifted over the blondes and brunettes, registering heightened color of cheeks and eager gazes, and without bothering to look over his shoulder, he said, \"Either a fire has broken out in the middle of the dance floor, or else Langford has just arrived.\" \"It can\u0027t be him! It\u0027s after eleven and the doors are locked.\" \"Nevertheless, I would wager a small fortune that Langford\u0027s the cause. The hunting instincts of the female of the species are at a fever pitch, which means prime prey is in sight. Shall I look round and see?\" \"Try not to be obvious about it.\" He complied, turned back around, and confirmed it. \"He\u0027s stopped to greet the patronesses.\"","sourceLink":"https://allnovel.net/until-you-westmoreland-saga-3/page-61.html","bookId":1803,"book":{"id":1803,"title":"Until You (Westmoreland Saga #3)","description":"Storyline: Sheridan Bromleigh had spent most of her early life as a happy vagabond with her unruly American father and his vagrant friends. Then, given over to the care of a strict maiden aunt, she was taught to be a lady - poor but genteel - and finally a teacher. When she was hired to act as chaperone to a pretty but spoilt heiress travelling to England to join an aristocratic fiance, Sheridan was delighted. Now, at last, she could visit her family\u0027s country. But somehow everything went wrong. For Miss Charise Lancaster, not over-gifted with intelligence, eloped with a stranger before she could meet her suitor. And Sheridan was left with the horrid task of telling Lord Burleton she had somehow misplaced his bride. As she gazed at the tall, confident man before her, her courage failed. She was doubly shocked when she heard his news. Lord Burleton, a drunkard and a wastrel, had been killed the night before. At which point fate took over. Sheridan was knocked unconscious on the quayside, and recovered to find herself in the handsome stranger\u0027s care, not knowing who she was. It was to be the beginning of a dazzling, witty, dramatic, and romantic sequence of events in which every possible confusion was to take place.","cover":"https://allnovel.net/images/until-you-westmoreland-saga-3.jpg","author":"Judith McNaught","type":"Historical","source":"allnovel","link":"https://allnovel.net/until-you-westmoreland-saga-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:36:12 PM"}}
