{"id":82007,"no":69,"title":"Page 69","content":"\"And for once,\" Clayton chuckled, watching Charity Thornton\u0027s satisfied expression as she kept a close watch on the dance floor, \"the object of your attentions has a chaperone who does not seem to be overcome with joy to have you nearby.\" Stephen heard that, but an idea was taking shape that suited him perfectly, an idea that would also immediately undo whatever damage to Sherry\u0027s reputation her own chaperone had just done. \"I heard Nicki DuVille finds her very out-of-the-ordinary,\" Rutherford commented, lifting his glass of champagne to his lips. \"Enough so that he actually went to Almack\u0027s too. Gossip has it that the two of you stood off to the side, holding up the same pillar, when you couldn\u0027t get close enough to the young lady because of her other beaux. That must have been a sight,\" Rutherford continued, his shoulders shaking with mirth. \"You and DuVille both at Almack\u0027s and on the same night. Two wolves in a roomful of cubs. Where is Nicki, by the by?\" Rutherford added, idly searching across a sea of six hundred faces. \"Nursing his broken heart, I hope,\" Stephen replied, putting his idea into action. \"DuVille?\" Rutherford said, laughing again. \"That is almost as difficult to imagine as the two of you at Almack\u0027s. Why would he have a broken heart?\" With a mocking lift of his brows and an amused smile, Stephen replied, \"Because the object of his affections has just agreed to marry another.\" \"Really?\" he said, fascinated and looking at Makepeace with new respect as he danced with Sherry. \"You can\u0027t mean Makepeace. Tell me all that beauty won\u0027t be wasted on that young pup.\" \"She\u0027s not marrying Makepeace.\" \"Then who is she marrying?\" \"Me.\" His face went from shock, to delight, to comic anticipation. Gesturing with his glass to the entire ballroom, he added, \"Would you consider letting me announce it tonight? I would love to see their faces when they hear the news.\" \"I\u0027d consider it.\" \"Excellent!\" he said, sending a censorious look at Whitney Westmoreland as he added, \"If you recall, your grace, I once tried to announce your betrothal, but you had some maggot in your head that night about wanting to keep it secret.\" That seemingly innocent remark caused her husband and brother-in-law to cast her matched looks of amused admonishment for having rebelled against marrying her husband in ways that had wreaked havoc all over London. \"Stop it, both of you,\" Whitney said with an embarrassed laugh. \"Do you ever intend to let me forget it?\" \"No,\" said her husband with a tender grin. Sherry was standing by Stephen\u0027s side for the first time in an hour, enjoying the friendly conversation of his friends, when Lord Rutherford abruptly detached himself from the group. She saw him wend his way through the crowd toward the orchestra, but she paid it no heed until the music rose to an imperative crescendo, then died completely in the classic musical call for attention. Conversations broke off and surprised guests slowly turned, looking about for the cause of the odd occurrence. \"Ladies and gentlemen,\" Stephen\u0027s friend said in a surprisingly carrying voice, \"I have the very great honor of announcing an important betrothal tonight, before it is formally announced in the paper—\" Sherry looked around, as did many of the guests, wondering who the newly engaged couple might be, and in her curiosity, she overlooked the tender amusement in Lord Westmoreland\u0027s smile as he watched her study the crowd alertly, trying to guess. \"I know this particular betrothal will come as a vast relief to many of the bachelors in this ballroom, who will be thankful to have this gentleman finally out of their way. Ah, I see I have aroused your curiosity,\" he said, obviously enjoying his role as he looked around at hundreds of faces alive with amused curiosity. \"In view of that, I think I\u0027ll prolong your suspense a moment longer and instead of telling you the names of the parties, I will ask them to do me the honor of performing their first formal duty as future husband and wife, by Officially opening our ball.\" He left the vacant dance floor, accompanied by murmurs and laughter, but no one was looking at him. As the orchestra leader signalled a waltz and the music began to fill the room, everyone was scanning the crowd and even looking suspiciously at one another. \"What a wonderful way to announce an engagement,\" Sherry confided to her amused future in-laws. \"I am very glad you approve,\" Stephen said, covering her hand with his and slowly leading her to the edge of the dance floor—so that she could have a better view, Sherry presumed. But when they were there, and the music continued to flow and soar in its rich tempo, he stepped slightly in front of her, blocking her view. \"Miss Lancaster,\" he said quietly, pulling her attention to him when she was trying to see around him. \"Yes?\" Sherry said, smiling at the inexplicable amusement in his eyes. \"May I have the honor of the next dance?\" There was no time for stage fright, no time to react at all, because his arm was already sliding around her waist, drawing her forward, then whirling her off the sidelines and onto the dance floor. The moment the crowd realized who was leading off the dance, laughter and cheers exploded in the room, building to a deafening roar. Overhead, crystal chandeliers glittered and gleamed with fifty thousand candles while the mirrored walls reflected a couple dancing alone beneath them—a tall, dark-haired man who waltzed with easy grace, his arm possessively encircling a young woman in an ivory gown. Sherry saw their reflection in the mirrors, sensed the heady, romantic magic of the moment, and she lifted her gaze to his. Somewhere in the depths of those knowing blue eyes smiling down at her, she saw another sort of romantic magic sparking to life… something deep and profound and silent. It held her captive, promising her something… asking… inviting. I love you, she thought. His arm tightened around her waist, as if he\u0027d heard her and had liked the sound of it. And then she realized she\u0027d said it aloud. On the balcony above the ballroom, the Dowager Duchess of Claymore looked down upon the couple and smiled with pleasure, already thinking of the splendid grandchildren they would have. She wished her husband could have been with her, watching his son with the woman who was going to share his life. Robert would have approved of Sherry, she thought. Unconsciously rubbing her thumb over the marriage ring Robert had slid on her finger nearly four decades before, Alicia tenderly watched their son waltzing with his affianced bride, and she could almost feel Robert standing at her side. \"Look at them, my love,\" she whispered to him in her heart. \"He\u0027s so like you, Robert, and she reminds me so much of me in little ways.\" Alicia could almost feel Robert\u0027s hand slide around her waist as he leaned down, and his smiling voice whispered in her ear, \"In that case, my sweet, Stephen is going to have his hands full.\"","sourceLink":"https://allnovel.net/until-you-westmoreland-saga-3/page-69.html","bookId":1803,"book":{"id":1803,"title":"Until You (Westmoreland Saga #3)","description":"Storyline: Sheridan Bromleigh had spent most of her early life as a happy vagabond with her unruly American father and his vagrant friends. Then, given over to the care of a strict maiden aunt, she was taught to be a lady - poor but genteel - and finally a teacher. When she was hired to act as chaperone to a pretty but spoilt heiress travelling to England to join an aristocratic fiance, Sheridan was delighted. Now, at last, she could visit her family\u0027s country. But somehow everything went wrong. For Miss Charise Lancaster, not over-gifted with intelligence, eloped with a stranger before she could meet her suitor. And Sheridan was left with the horrid task of telling Lord Burleton she had somehow misplaced his bride. As she gazed at the tall, confident man before her, her courage failed. She was doubly shocked when she heard his news. Lord Burleton, a drunkard and a wastrel, had been killed the night before. At which point fate took over. Sheridan was knocked unconscious on the quayside, and recovered to find herself in the handsome stranger\u0027s care, not knowing who she was. It was to be the beginning of a dazzling, witty, dramatic, and romantic sequence of events in which every possible confusion was to take place.","cover":"https://allnovel.net/images/until-you-westmoreland-saga-3.jpg","author":"Judith McNaught","type":"Historical","source":"allnovel","link":"https://allnovel.net/until-you-westmoreland-saga-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:36:12 PM"}}
