{"id":82022,"no":84,"title":"Page 84","content":"\"I said,\" Clayton recited, \"that I wanted to discuss Sheridan Bromleigh with him. I told him that I believe she goes to the opera specifically to see him.\"\\n\\n \"And then what happened?\"\\n\\n \"Nothing happened. He got up and walked out.\"\\n\\n \"That\u0027s all? He didn\u0027t say anything?\"\\n\\n \"As a matter of fact he did. He said that, out of respect for our mother, he would ignore the temptation to resort to physical violence against my person, but that if I ever brought up Sheridan Bromleigh\u0027s name to him again, I should not depend on his ability to exercise similar restraint.\"\\n\\n \"He actually said that?\"\\n\\n \"Not in exactly those words,\" Clayton said with grim irony. \"Stephen\u0027s were shorter and more—colorful.\"\\n\\n \"Well, he can\u0027t threaten me. There must be something I could do.\"\\n\\n \"Have you considered prayer? A pilgrimage? Sorcery?\" Despite his light tone, he wanted her to let matters rest, and she could see that he did. When she didn\u0027t smile, he put his cup onto the saucer and leaned back in his chair, frowning a little. \"You\u0027re absolutely determined to get involved in this, no matter what Stephen says or I say, is that it?\"\\n\\n She hesitated, and then nodded. \"I have to try. I keep remembering the expression on Sheridan\u0027s face when she looks at him in the opera, and the way she was looking at him at the Rutherfords\u0027 ball. And Stephen looks more haggard and grim each time I see him, so being apart isn\u0027t doing either of them any good.\"\\n\\n \"I see,\" he said, studying her face with a reluctant smile lurking at the corners of his mouth. \"Is there anything I can say to persuade you it\u0027s a mistake?\"\\n\\n \"I\u0027m afraid not.\"\\n\\n \"I see.\"\\n\\n \"I may as well confess—I\u0027ve contacted Matthew Bennett to ask him to have his firm make inquiries about where she is. I can\u0027t do anything to bring them together until I can find her.\"\\n\\n \"I\u0027m surprised you didn\u0027t decide to hire a lackey during the intermission to follow her home from the opera, and then have Bennett\u0027s firm make inquiries.\"\\n\\n \"I didn\u0027t think of it!\"\\n\\n \"I did.\"\\n\\n His voice had been so unemotional, his expression so marvelously bland, that it took a moment for the true import of those two words to register. When they did, she felt the familiar fierce surge of love that had grown stronger over the four years of their marriage. \"Clayton,\" she said. \"I love you.\"\\n\\n \"She\u0027s working as a governess for a baronet and his family,\" he informed her. \"Surname is Skeffington. Three children. I\u0027ve never heard of them. Bennett has their direction.\"\\n\\n Whitney put her teacup down and stood up, intending to send a note to the solicitor\u0027s firm at once, asking for all the information they had.\\n\\n \"Whitney?\"\\n\\n She turned in the doorway of the morning room. \"My lord?\"\\n\\n \"I love you too.\" She smiled at him in answer, and he waited a moment before issuing a serious warning: \"If you persist in your determination to bring them face to face, be very cautious how you handle this, and be prepared for Stephen to leave the moment he sees her. You should also be prepared for the possibility that he will not forgive you for this, not for a very long time. Think carefully before you take steps you may sorely regret.\"\\n\\n \"I will,\" she promised.\\n\\n Clayton watched her leave and slowly shook his head, knowing damned well she wasn\u0027t going to waste time in contemplation and inaction. It simply was not in her nature to watch life happen and not wade in. It was, he decided wryly, one of the things he most loved about her.\\n\\n He did not, however, expect her to act as swiftly as she did.\\n\\n \"What\u0027s that?\" he asked late that same afternoon as he strolled past the salon and saw her sitting at a rosewood secretary, thoughtfully brushing the feathered end of a quill against her cheek while she studied a sheet of paper in her hand.\\n\\n She looked up as if she\u0027d been far away, and then smiled swiftly. \"A guest list.\"\\n\\n The frenetic activities of the Season were finally winding to a close, and they\u0027d both been looking forward to returning to the peace and serenity of the country for the summer, so Clayton was naturally surprised she was evidently planning to entertain. \"I thought we were going back to Claymore the day after tomorrow.\"\\n\\n \"We are. This party is three weeks off—it\u0027s a birthday party for Noel. Nothing too large, of course.\"\\n\\n Over her shoulder, Clayton glanced at her list and muffled a laugh as he read the first item aloud, \" \u0027One small elephant, safe for children to touch—\u0027 \"\\n\\n \"I was thinking of a circus theme, with clowns and jugglers and such, with all the festivities and meals taking place on the lawn. That\u0027s so much more relaxed, and the children will be able to enjoy everything right alongside with the adults.\"\\n\\n \"Isn\u0027t Noel a little young for all this?\"\\n\\n \"He needs the society of other children.\"\\n\\n \"I thought that was the reason he spends every day with the Fieldings\u0027 and the Thorntons\u0027 children when we come to London.\"\\n\\n \"Oh, it is,\" she said, giving him a breezy smile. \"Stephen volunteered to give Noel\u0027s party at Montclair when I told him about it today.\"\\n\\n \"Having been to enough parties in the last six weeks to last a lifetime, I rather wish you\u0027d have let him,\" he joked. \"As Noel\u0027s uncle and godfather, it\u0027s Stephen\u0027s prerogative to have his country house overrun with parents who\u0027ll stay for a week and expect to be entertained, children\u0027s party or no.\"\\n\\n \"I suggested Stephen give your mother\u0027s sixtieth birthday ball at Montclair instead, and let us have Noel\u0027s birthday party at Claymore. Since her birthday is only three days after Noel\u0027s, that seemed the best plan.\"\\n\\n \"Clever girl,\" Clayton replied, instantly reversing his opinion of who ought to have the party. \"Mother\u0027s ball will be a huge crush.\"\\n\\n \"Our party will be small—a few carefully chosen guests with their children and governesses.\"\\n\\n As she spoke, Clayton glanced idly at the sheet of paper near her wrist and his eyes riveted on the name Skeffington. He straightened, and when he spoke, his voice was filled with amused irony. \"Interesting guest list.\"\\n\\n \"Isn\u0027t it?\" she replied with an incorrigible smile. \"Five couples whose absolute discretion we can depend upon, no matter what they see or hear, and who already know most of the situation. And the Skeffingtons.\"\\n\\n \"And their governess, of course.\"\\n\\n Whitney nodded. \"Of course. And the beauty of the plan is that Sheridan won\u0027t be able to leave, no matter how badly she wishes, because she works for the Skeffingtons.\" \\n\\n","sourceLink":"https://allnovel.net/until-you-westmoreland-saga-3/page-84.html","bookId":1803,"book":{"id":1803,"title":"Until You (Westmoreland Saga #3)","description":"Storyline: Sheridan Bromleigh had spent most of her early life as a happy vagabond with her unruly American father and his vagrant friends. Then, given over to the care of a strict maiden aunt, she was taught to be a lady - poor but genteel - and finally a teacher. When she was hired to act as chaperone to a pretty but spoilt heiress travelling to England to join an aristocratic fiance, Sheridan was delighted. Now, at last, she could visit her family\u0027s country. But somehow everything went wrong. \\n For Miss Charise Lancaster, not over-gifted with intelligence, eloped with a stranger before she could meet her suitor. And Sheridan was left with the horrid task of telling Lord Burleton she had somehow misplaced his bride. As she gazed at the tall, confident man before her, her courage failed. She was doubly shocked when she heard his news. Lord Burleton, a drunkard and a wastrel, had been killed the night before. At which point fate took over. Sheridan was knocked unconscious on the quayside, and recovered to find herself in the handsome stranger\u0027s care, not knowing who she was. \\n It was to be the beginning of a dazzling, witty, dramatic, and romantic sequence of events in which every possible confusion was to take place.\\n","cover":"https://allnovel.net/images/until-you-westmoreland-saga-3.jpg","author":"Judith McNaught","type":"Historical","source":"allnovel","link":"https://allnovel.net/until-you-westmoreland-saga-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:36:12 PM"}}
