{"id":74681,"no":22,"title":"Page 22","content":"BLAIRE\\n\\n Rush still wasn’t back. He hadn’t answered my calls or texts. I’d been at the doctor for over four hours and he hadn’t once checked in with me. My baby was okay but the doctor said that I needed to rest, drink more fluids, and eliminate stress. The next step would be bed rest if I didn’t comply with this. Staying here and dealing with Nan wasn’t going to help me. I had to leave.\\n\\n I glanced at my phone to make sure I hadn’t missed a call since the last time I’d checked it three minutes ago. I was trying not to worry about Rush. I needed to decrease my stress. My baby needed me to.\\n\\n Harlow had been so quiet in the car. I knew she didn’t know what to say. Rush had never shown up or called. She’d tried to call him too. Her silence had been what I needed. I didn’t want to talk about it.\\n\\n Going back to Rosemary didn’t sound appealing. Right now I wanted distance from Rush too. Rosemary would just make me miss him and think about him. A knock on my door broke into my thoughts and I opened it. Dean was standing on the other side looking tired.\\n\\n “Rush called Kiro and he let him know that he’s called Georgianna to come here. We should be expecting her soon. Not sure how long it will take her to get here or where she was to begin with. I just thought you might want a heads up that the wicked queen was on her way here.”\\n\\n Rush had called Kiro was all that I heard. The rest didn’t matter. “When did Rush call him?” I asked.\\n\\n “An hour or so ago I guess. He just told me.”\\n\\n Rush was fine. He had his phone. He was just choosing not to respond to me. Once again I was faced with the brutal truth that Nan was more important. I nodded and closed the door.\\n\\n I scrolled through my list of contacts until I found my dad’s number. He answered on the second ring.\\n\\n “Blaire?” His surprised voice only reminded me of how little I called him. I could hear the wind from his boat.\\n\\n “Daddy. I need to get away. Can I come visit?” I asked refusing to cry. I had made a call like this once before and although he had let me down in the end I’d thought I had found real happiness. I wasn’t so sure anymore.\\n\\n “Of course. What’s wrong?”\\n\\n “I just can’t take it anymore. I need somewhere to think.”\\n\\n “You come to the Key West airport and I’ll be there waiting on you. Just let me know when your plane will land.”\\n\\n “Okay, I’ll call you with the info as soon as I know. Thank you.”\\n\\n “Don’t thank me. I’m your Dad. It’s what I’m here for.”\\n\\n I squeezed my eyes tightly closed and hung up the phone. I was really going to leave Rush. My heart was breaking at the thought. I went to the Delta app on my phone and found the first flight out of LAX headed to Atlanta. I’d have a layover there before I got on a plane for Key West. After booking my flight, I packed my clothes quickly and called for a cab.\\n\\n I knew that the grownup thing to do would be to leave Rush a note but I was too mad at him right now. I’d text him later. Maybe after he decided that returning my phone call was important.\\n\\n No one saw me as I left the house and climbed into the cab. I was thankful. I didn’t want to explain myself. I shouldn’t have to. \\n\\n","sourceLink":"https://allnovel.net/forever-too-far-too-far-3/page-22.html","bookId":1995,"book":{"id":1995,"title":"Forever Too Far (Too Far #3)","description":"Storyline: Forever Too Far (Too Far, #3; Rosemary Beach, #3) \\n Rush promised her forever... but promises can be broken. \\n Torn between his love for his family and his love for Blaire, Rush has to find a way to save one without losing the other. In the end one has to be more important. Letting go isn’t easy. \\n Blaire believed in her fairytale... but no one can live in a fantasy. \\n Her love for Rush and desire to have a family keep her believing that they can find a way for this to work. Until she has to make the right decision for her and the baby. Even if it breaks her heart. \\n Can they find the forever that they both want or has it all just gone... too far?\\n","cover":"https://allnovel.net/images/forever-too-far-too-far-3.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/forever-too-far-too-far-3.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 10:31:59 AM"}}
