{"id":74691,"no":32,"title":"Page 32","content":"RUSH I had waited at the bottom of the steps as each person came down after taking her the gifts I sent up. When her father had gone up I’d known I couldn’t wait around this time. I had to get outside. I wanted to be the one taking the gifts up to her but she’d been adamant that I couldn’t see her before the wedding. Standing under the pergola covered in ivy and white roses on the sand between my house and the gulf I waited with the minister on one side and Grant on the other side. “You nervous?’ Grant asked. “That she’s gonna decide not to walk down that aisle? Yes,” I replied. Grant laughed and shook his head. “That’s not what I meant.” “One day you’ll understand. And when you do I’m going to laugh my ass off.” “Not a chance in hell,” he replied. Bethy appeared under the pink roses, which meant that Blaire was waiting behind her. I picked up the hidden wireless microphone that I’d had the sound guy strategically place for me and put it on my lapel. Then I reached behind the flowers and picked up my guitar. It had been years since anyone had seen me touch this thing. I could only imagine what was going through their heads. Only my dad knew what was going on because he’d helped me with the chords. “What’re you doing?” Grant whispered. The disbelief in his voice as he figured out the answer all on his own was obvious. I didn’t need to tell him. As soon as Bethy was in her place I stepped in front of the minister and looked directly down the aisle. When Blaire appeared the music would begin. I’d gone over everything with the sound team thoroughly. When she stepped forward on her father’s arm her eyes locked with mine and then went wide in surprise. She had been supposed to walk down the aisle to “I Won’t Give Up” by Jason Mraz. But I hadn’t wanted another man singing to her. Not today. I wanted her walking to me while I sang the words written just for her when she walked down the aisle to gift me with my world. “Well, uh, I haven’t been one much for singing... well you know, in front of people... but I figured after all we’ve been through... this would be a good time to say what I’ve always wanted to say. Blaire, I love you girl... to the moon and back.” I watched as she stood frozen looking at me. The entire place faded away and all I could see was Blaire. When you first looked at me I forgot to breathe that moment marked my hardened heart I vowed never to leave And the touch of your skin healed something deep within that left me wanting more of you the less I got the more it grew Oh I couldn’t help from falling, falling for you So I’m standing here, oh girl you know After all that we’ve been through we couldn’t let it go and as long as I’m alive, in your eyes I’ll stare holding you so close I’ll solemnly swear that I have fallen too far that I have fallen too far, too far for you. For you When I finally found you I finally found me that day I won’t soon forget the reason for it all I’ll give you a new name nothing in life will be the same the story is now complete our life and love is all we need ‘Cause I couldn’t help from falling falling for you So I’m standing here oh girl you know After all we’ve been through we couldn’t let it go and as long as I’m alive, in your eyes I’ll stare holding you so close I’ll solemnly swear that I have fallen too far, that I have fallen too far too far for you My heart is beating begging for you this night will be a dream come true so fall, fall, fall into my arms So I’m standing here oh girl you know After all that we’ve been through we couldn’t let it go That I have fallen too far That I have fallen too far That I have fallen too far too far for you, yeah For you... (Fallen Too Far- the wedding song by Rush Finlay is available for purchase on iTunes.) When I played the last line I quickly pulled the guitar strap over my head and handed it to Grant. Blaire didn’t wait for any direction from the minister before she threw herself in my arms with a sob. “That was beautiful,” she said against my chest. “Not as beautiful as you are,” I replied, holding her against me. She let out a small laugh. “I didn’t know you could do that,” she said, pulling back to look up at me. “I’m full of all kinds of exciting surprises,” I assured her and winked. “Alright you two. Let me give the girl away first,” Abe said, reaching for Blaire’s arm and pulling her back to his side with an amused grin. Abe kissed his daughter’s cheek then looked at me. “I’d tell you how special she is but you already know that. Because you do is the only reason I can hand her over to you. I asked you to be the man I couldn’t be, and you did as I asked. Not for me but for her. I couldn’t be prouder of the woman she’s become and the man she’s chosen to spend her life with.” He took Blaire’s hand and placed it in mine. Then he turned to take his seat. I slipped her hand into the crook of my arm as we turned around to face the minister. She jumped beside me and looked down at her stomach with a smile. I slipped my arm around her waist and placed my hand on her stomach as our baby moved. This was mine. HARLOW (yes, you read that right too.) I could feel him looking at me again. I wished he would stop. Since he’d stalked off cursing a blue streak and left me standing in my hiding place at the rehearsal party, all he did was stare at me. I hated being stared at. I was ready to go home but I knew Dean was enjoying himself. I was going to see if I could get an earlier flight out. I didn’t want to stay until tomorrow. I crossed my legs again and studied my hands. No one really spoke to me and I couldn’t blame them. I was boring. I never knew what to say. I was afraid to say anything. I always had been. I’d learned it was better to keep quiet than to say something stupid. It was easier to blend into the background when guys who looked like Grant Carter didn’t stare at you constantly. I couldn’t figure out why he was staring at me. That was the craziest thing. I knew why he was upset. When you’re quiet people forget you’re around and they talk about stuff in front of you that really isn’t your business. I’d heard Nan talking on the phone to Grant several times. I also knew that as nice of a guy as Rush was his stepbrother wasn’t. Any guy who dated someone like Nan had to be equally screwed up. I just wished he wasn’t so freaking hot. That was something I should have been prepared for. Nan was gorgeous and even though she was a raging bitch she attracted all men. Any guy that she was in a relationship with had to be equally beautiful. And oh my, was he. Very. Even the long hair that he had tucked behind his ears was attractive. Those blue eyes of his had been piercing. It had taken two words from him and I’d become a blubbering mess. Which wasn’t hard to do. I did that often. The chair beside me scraped across the floor and I jerked my gaze up to see Grant sitting down entirely too close to me. Not good. So not good. What was his deal? “I’m sorry about last night,” he snapped at me. I tensed and managed to nod my head. Okay, so he was sorry. Fine. Now he could leave and stop looking at me. “Come on, Harlow, say something. Give me more than a nod,” he said, sounding exasperated. I wasn’t sure why I should exasperate him. I hadn’t done anything to him. I’d tried to stay away from him and ignore his constant staring. Even during the wedding he’d found me among the other guests and he hadn’t looked away from me the entire time. “Is it just me or do you not talk to anyone? I haven’t seen you chatting it up with the other guests.” Even though I didn’t like him and I sure didn’t like his choice in females, I also didn’t want him thinking I was an idiot. He’d go tell Nan and she’d have something else to make fun of me about. “I’m not good in crowds,” I explained. He seemed to relax some when I spoke. “This bunch is overwhelming. Can’t say I blame you.” I forced a smile. It wasn’t a big one but it was the best I could do. I didn’t do fake well. I never had. “You don’t like me, do you?” He was obviously very observant too. I could lie to be polite. I’d been taught by my grandmother that if I couldn’t say anything nice not to say anything at all. “I don’t like Nan,” I replied honestly. That wasn’t polite but it was true. Instead of getting defensive, Grant burst out laughing. Not a quiet amused laugh but a fully belly laugh like I was a great comedian. I watched him and hated him all the more for being attractive when he laughed. It wasn’t fair. I didn’t want to think anything about him was attractive. “I’m sorry,” he said, wiping his eyes and grinning at me. “But that was not what I was expecting to come out of that sweet mouth of yours. Damn, that was funny.” I didn’t think it was funny at all. Did he think I was joking? “I don’t think you’re alone in that, beautiful. Most people would agree with you. Especially the attendants at this wedding.” I didn’t respond. He obviously liked her. “Since you aren’t going to elaborate, I’m going to assume that you aren’t talking to me because I dated Nan and you don’t like her.” I shrugged. Not exactly. It was more than that. Telling him was once again rude and I shouldn’t be rude. But it was either be rude or let him think I was a mute. I didn’t want him to make fun of me to Nan. I got enough of it from her. “Anyone who dates Nan can’t have any redeeming qualities. Or any qualities that I’d be interested in getting to know better. I don’t like wasting my time with those I know I’ll never speak with again.” That had come out harsher than I meant for it to. Damn honesty. Grant winced. I was acting like a bitch myself. I accused Nan of being one and I was behaving just as badly. I couldn’t do that. I didn’t want to be that. “Look, that didn’t come out right. I’m sorry. What I meant to say is that I don’t like Nan. At all. I can’t see why anyone who isn’t related to her would even put up with her. The fact you not only put up with her but dated her tells me that you and I would never be friends. I’m sorry. I don’t want to sound like a bitch because I’m really a nice person. I just try to stay away from mean people. Nan is the epitome of mean so that leads me to believe you are mean as well. Mean people stick together.” I stopped because I was making this worse. Standing up, I gave him an apologetic smile that didn’t have to be forced this time because I really did feel bad for spewing from the mouth just now. I tended to do that when I tried to talk too much. Before he could say anything else I bolted. I was going to go tell Rush and Blaire goodbye and go to the airport and wait to get on an earlier flight. I would just stay the night at the airport if I had to. At least this way Grant Carter couldn’t find me.","sourceLink":"https://allnovel.net/forever-too-far-too-far-3/page-32.html","bookId":1995,"book":{"id":1995,"title":"Forever Too Far (Too Far #3)","description":"Storyline: Forever Too Far (Too Far, #3; Rosemary Beach, #3) Rush promised her forever... but promises can be broken. Torn between his love for his family and his love for Blaire, Rush has to find a way to save one without losing the other. In the end one has to be more important. Letting go isn’t easy. Blaire believed in her fairytale... but no one can live in a fantasy. Her love for Rush and desire to have a family keep her believing that they can find a way for this to work. Until she has to make the right decision for her and the baby. Even if it breaks her heart. Can they find the forever that they both want or has it all just gone... too far?","cover":"https://allnovel.net/images/forever-too-far-too-far-3.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/forever-too-far-too-far-3.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 10:31:59 AM"}}
