{"id":74697,"no":38,"title":"Page 38","content":"RUSH\\n\\n He was perfect. I counted all ten toes and fingers while Blaire kissed each one. He was also so damn tiny. I hadn’t realized babies were so little.\\n\\n “We have to decide on a name now,” Blaire said, looking up at me after she finally managed to get our son to latch on and nurse.\\n\\n We had thrown around several ideas over the past three months but nothing had seemed right. Blaire had said it was hard to name someone you’d never seen so we agreed to wait until he was born to name him.\\n\\n “I know. We’ve seen him now. We need to give him a name. What are you thinking?” I asked her hoping to God she didn’t suggest Abraham Dean again. I loved my dad but I wasn’t naming my kid after him.\\n\\n “I think he looks like a Colton,” she said, smiling down at him. I wasn’t a fan of that name.\\n\\n “You still against River?” I asked.\\n\\n She smiled up at me. “I want to put Rush in his name but if we name him River we can’t. River Rush or Rush River sounds silly.”\\n\\n I’d forgotten she was trying to use my name too. I wasn’t going to argue with her. I liked the idea of my son having my name. “What about Cash? Cash Rush!” I teased and she bit down on her lip to keep from giggling and scaring him.\\n\\n “What about Nathan we could call him Nate?” she asked. He stopped sucking and let go to look up at her as if she’d called his name. I guess we’d come to a decision.\\n\\n “Nathan Rush Finlay has a good ring to it,” I agreed.\\n\\n She beamed up at me happily and bent her head down to kiss his nose. “Hello Nate. Welcome to the world.”\\n\\n I wanted to hold him but he looked like he had decided to go to sleep instead of socializing. Blaire lifted him up and laid him on her shoulder and patted his back softly. I stood there and watched in amazement. This was mine. My family. And they were perfect.\\n\\n When Blaire was satisfied with her attempt at burping him she wrapped him up tightly in his blanket and looked over at me. “It’s your turn, Daddy. I need to rest. My eyes feel heavy.”\\n\\n I reached for him and took my son from his mother’s arms. Holding him up close against my chest I inhaled his sweet baby smell. “Come on little guy. Let’s go get comfortable over there and see if we can’t find some basketball to watch on television.”\\n\\n Nate slept contentedly in my arms and Blaire had gone to sleep pretty quickly after she handed him over to me. I could stay in this room with these two like this forever. Just having them close to me and knowing they were safe made everything okay.\\n\\n A soft knock at the door broke into my thoughts. I turned to see the door ease open and several blue balloons enter before I saw Bethy’s head behind them. She’d stayed out as long as she could.\\n\\n “Okay, Dad, I realize you’re enjoying yourself but you have to share. Both grandfathers are in the waiting room waiting patiently,” she whispered after glancing over to see Blaire sleeping.\\n\\n “I don’t want to disturb Blaire. She’s exhausted. I’ll bring the baby to the nursery window. Have everyone meet me there.”\\n\\n Bethy looked over at the baby longingly. I knew she wanted to hold him but I wasn’t ready yet. I wasn’t so sure she wouldn’t drop him. I wasn’t so sure I could trust anyone to hold him. Snuggling him closer against me I wondered how the hell I was supposed to just let people come to my house and hold my kid.\\n\\n “The nurse said y’all named him Nathan Rush. I like it,” she said.\\n\\n “We’re gonna call him Nate.”\\n\\n She nodded and then headed back out to tell everyone where to go. I didn’t mind showing them Nate through the safety of a window but I wasn’t going to let them all breathe on him and touch him. Too many germs. He was too little for that shit. He needed some more meat on him before he had to deal with germs.\\n\\n I stepped into the nursery and checked in with a nurse. I explained that I was there to show the baby to family members through the glass. When she turned and saw Dean standing at the window her mouth dropped open.\\n\\n “Ohmygod. The Finlay baby is related to Dean Finlay? Slacker Demon’s Dean Finlay?”\\n\\n I nodded. “Yeah. It’s his grandson and I really need to show Nate here to his grandfather.”\\n\\n She hurried to make a path for me and followed me to the window so she could gape at my dad. Dean, however, was completely focused on Nate. He held up his thumb and winked at me. Abe had tears in his eyes and nodded his head. Grant was right there beside my dad grinning at Nate. Bethy was was gushing over my boy and Jace was nodding his head in agreement.\\n\\n Jimmy pushed his way through the crowd to get a look at him and put his hand on his hips and beamed at Nate. Then he looked at me and gave me the nod of approval. This was our extended family. We might not have siblings or mothers here with us but we had people who loved us and who would love Nate.\\n\\n “Do you think I could get Dean’s autograph?” the nurse asked from beside me.\\n\\n “Go on out there and ask him. You’re catching him in a really good mood,” I told her before turning and taking Nate back to his momma. \\n\\n","sourceLink":"https://allnovel.net/forever-too-far-too-far-3/page-38.html","bookId":1995,"book":{"id":1995,"title":"Forever Too Far (Too Far #3)","description":"Storyline: Forever Too Far (Too Far, #3; Rosemary Beach, #3) \\n Rush promised her forever... but promises can be broken. \\n Torn between his love for his family and his love for Blaire, Rush has to find a way to save one without losing the other. In the end one has to be more important. Letting go isn’t easy. \\n Blaire believed in her fairytale... but no one can live in a fantasy. \\n Her love for Rush and desire to have a family keep her believing that they can find a way for this to work. Until she has to make the right decision for her and the baby. Even if it breaks her heart. \\n Can they find the forever that they both want or has it all just gone... too far?\\n","cover":"https://allnovel.net/images/forever-too-far-too-far-3.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/forever-too-far-too-far-3.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 10:31:59 AM"}}
