{"id":6727,"no":36,"title":"EDDARD","content":"He found Littlefinger in the brothel’s common room, chatting amiably with a tall, elegant womanwho wore a feathered gown over skin as black as ink. By the hearth, Heward and a buxom wenchwere playing at forfeits. From the look of it, he’d lost his belt, his cloak, his mail shirt, and his rightboot so far, while the girl had been forced to unbutton her shift to the waist. Jory Cassel stood besidea rain-streaked window with a wry smile on his face, watching Heward turn over tiles and enjoyingthe view. \n \n Ned paused at the foot of the stair and pulled on his gloves. “It’s time we took our leave. Mybusiness here is done.” \n \n Heward lurched to his feet, hurriedly gathering up his things. “As you will, my lord,” Jory said. \n \n “I’ll help Wyl bring round the horses.” He strode to the door. \n \n Littlefinger took his time saying his farewells. He kissed the black woman’s hand, whispered somejoke that made her laugh aloud, and sauntered over to Ned. “Your business,” he said lightly, “orRobert’s? They say the Hand dreams the king’s dreams, speaks with the king’s voice, and rules withthe king’s sword. Does that also mean you fuck with the king’s—” \n \n “Lord Baelish,” Ned interrupted, “you presume too much. I am not ungrateful for your help. Itmight have taken us years to find this brothel without you. That does not mean I intend to endure yourmockery. And I am no longer the King’s Hand.” \n \n “The direwolf must be a prickly beast,” said Littlefinger with a sharp twist of his mouth. \n \n A warm rain was pelting down from a starless black sky as they walked to the stables. Ned drew upthe hood of his cloak. Jory brought out his horse. Young Wyl came right behind him, leadingLittlefinger’s mare with one hand while the other fumbled with his belt and the lacings of his trousers. \n \n A barefoot whore leaned out of the stable door, giggling at him. \n \n “Will we be going back to the castle now, my lord?” Jory asked. Ned nodded and swung into thesaddle. Littlefinger mounted up beside him. Jory and the others followed. \n \n “Chataya runs a choice establishment,” Littlefinger said as they rode. “I’ve half a mind to buy it. \n \n Brothels are a much sounder investment than ships, I’ve found. Whores seldom sink, and when theyare boarded by pirates, why, the pirates pay good coin like everyone else.” Lord Petyr chuckled at hisown wit. \n \n Ned let him prattle on. After a time, he quieted and they rode in silence. The streets of King’sLanding were dark and deserted. The rain had driven everyone under their roofs. It beat down onNed’s head, warm as blood and relentless as old guilts. Fat drops of water ran down his face. \n \n “Robert will never keep to one bed,” Lyanna had told him at Winterfell, on the night long agowhen their father had promised her hand to the young Lord of Storm’s End. “I hear he has gotten achild on some girl in the Vale.” Ned had held the babe in his arms; he could scarcely deny her, norwould he lie to his sister, but he had assured her that what Robert did before their betrothal was of nomatter, that he was a good man and true who would love her with all his heart. Lyanna had onlysmiled. “Love is sweet, dearest Ned, but it cannot change a man’s nature.” \n \n The girl had been so young Ned had not dared to ask her age. No doubt she’d been a virgin; thebetter brothels could always find a virgin, if the purse was fat enough. She had light red hair and apowdering of freckles across the bridge of her nose, and when she slipped free a breast to give hernipple to the babe, he saw that her bosom was freckled as well. “I named her Barra,” she said as the child nursed. “She looks so like him, does she not, milord? She has his nose, and his hair …” \n \n “She does.” Eddard Stark had touched the baby’s fine, dark hair. It flowed through his fingers likeblack silk. Robert’s firstborn had had the same fine hair, he seemed to recall. \n \n “Tell him that when you see him, milord, as it … as it please you. Tell him how beautiful she is.” \n \n “I will,” Ned had promised her. That was his curse. Robert would swear undying love and forgetthem before evenfall, but Ned Stark kept his vows. He thought of the promises he’d made Lyanna asshe lay dying, and the price he’d paid to keep them. \n \n “And tell him I’ve not been with no one else. I swear it, milord, by the old gods and new. Chatayasaid I could have half a year, for the baby, and for hoping he’d come back. So you’ll tell him I’mwaiting, won’t you? I don’t want no jewels or nothing, just him. He was always good to me, truly.” \n \n Good to you, Ned thought hollowly. “I will tell him, child, and I promise you, Barra shall not gowanting.” \n \n She had smiled then, a smile so tremulous and sweet that it cut the heart out of him. Riding throughthe rainy night, Ned saw Jon Snow’s face in front of him, so like a younger version of his own. If thegods frowned so on bastards, he thought dully, why did they fill men with such lusts? “Lord Baelish,what do you know of Robert’s bastards?” \n \n “Well, he has more than you, for a start.” \n \n “How many?” \n \n Littlefinger shrugged. Rivulets of moisture twisted down the back of his cloak. “Does it matter? Ifyou bed enough women, some will give you presents, and His Grace has never been shy on thatcount. I know he’s acknowledged that boy at Storm’s End, the one he fathered the night Lord Stanniswed. He could hardly do otherwise. The mother was a Florent, niece to the Lady Selyse, one of herbedmaids. Renly says that Robert carried the girl upstairs during the feast, and broke in the weddingbed while Stannis and his bride were still dancing. Lord Stannis seemed to think that was a blot on thehonor of his wife’s House, so when the boy was born, he shipped him off to Renly.” He gave Ned asideways glance. “I’ve also heard whispers that Robert got a pair of twins on a serving wench atCasterly Rock, three years ago when he went west for Lord Tywin’s tourney. Cersei had the babeskilled, and sold the mother to a passing slaver. Too much an affront to Lannister pride, that close tohome.” \n \n Ned Stark grimaced. Ugly tales like that were told of every great lord in the realm. He couldbelieve it of Cersei Lannister readily enough … but would the king stand by and let it happen? TheRobert he had known would not have, but the Robert he had known had never been so practiced atshutting his eyes to things he did not wish to see. “Why would Jon Arryn take a sudden interest in theking’s baseborn children?” \n \n The short man gave a sodden shrug. “He was the King’s Hand. Doubtless Robert asked him to seethat they were provided for.” \n \n Ned was soaked through to the bone, and his soul had grown cold. “It had to be more than that, orwhy kill him?” \n \n Littlefinger shook the rain from his hair and laughed. “Now I see. Lord Arryn learned that HisGrace had filled the bellies of some whores and fishwives, and for that he had to be silenced. Smallwonder. Allow a man like that to live, and next he’s like to blurt out that the sun rises in the east.” \n \n There was no answer Ned Stark could give to that but a frown. For the first time in years, he foundhimself remembering Rhaegar Targaryen. He wondered if Rhaegar had frequented brothels; somehowhe thought not. \n \n The rain was falling harder now, stinging the eyes and drumming against the ground. Rivers ofblack water were running down the hill when Jory called out, “My lord,” his voice hoarse with alarm. \n \n And in an instant, the street was full of soldiers. \n \n Ned glimpsed ringmail over leather, gauntlets and greaves, steel helms with golden lions on thecrests. Their cloaks clung to their backs, sodden with rain. He had no time to count, but there were tenat least, a line of them, on foot, blocking the street, with longswords and iron-tipped spears. \n \n “Behind!” he heard Wyl cry, and when he turned his horse, there were more in back of them, cuttingoff their retreat. Jory’s sword came singing from its scabbard. “Make way or die!” \n \n “The wolves are howling,” their leader said. Ned could see rain running down his face. “Such asmall pack, though.” \n \n Littlefinger walked his horse forward, step by careful step. “What is the meaning of this? This is the Hand of the King.” \n \n “He was the Hand of the King.” The mud muffled the hooves of the blood bay stallion. The lineparted before him. On a golden breastplate, the lion of Lannister roared its defiance. “Now, if truth betold, I’m not sure what he is.” \n \n “Lannister, this is madness,” Littlefinger said. “Let us pass. We are expected back at the castle. \n \n What do you think you’re doing?” \n \n “He knows what he’s doing,” Ned said calmly. \n \n Jaime Lannister smiled. “Quite true. I’m looking for my brother. You remember my brother, don’tyou, Lord Stark? He was with us at Winterfell. Fair-haired, mismatched eyes, sharp of tongue. A shortman.” \n \n “I remember him well,” Ned replied. \n \n “It would seem he has met some trouble on the road. My lord father is quite vexed. You wouldnot perchance have any notion of who might have wished my brother ill, would you?” \n \n “Your brother has been taken at my command, to answer for his crimes,” Ned Stark said. \n \n Littlefinger groaned in dismay. “My lords—” \n \n Ser Jaime ripped his longsword from its sheath and urged his stallion forward. “Show me yoursteel, Lord Eddard. I’ll butcher you like Aerys if I must, but I’d sooner you died with a blade in yourhand.” He gave Littlefinger a cool, contemptuous glance. “Lord Baelish, I’d leave here in some hasteif I did not care to get bloodstains on my costly clothing.” \n \n Littlefinger did not need to be urged. “I will bring the City Watch,” he promised Ned. TheLannister line parted to let him through, and closed behind him. Littlefinger put his heels to his mareand vanished around a corner. \n \n Ned’s men had drawn their swords, but they were three against twenty. Eyes watched from nearbywindows and doors, but no one was about to intervene. His party was mounted, the Lannisters on footsave for Jaime himself. A charge might win them free, but it seemed to Eddard Stark that they had asurer, safer tactic. “Kill me,” he warned the Kingslayer, “and Catelyn will most certainly slayTyrion.” \n \n Jaime Lannister poked at Ned’s chest with the gilded sword that had sipped the blood of the last ofthe Dragonkings. “Would she? The noble Catelyn Tully of Riverrun murder a hostage? Ithink … not.” He sighed. “But I am not willing to chance my brother’s life on a woman’s honor.” \n \n Jaime slid the golden sword into its sheath. “So I suppose I’ll let you run back to Robert to tell himhow I frightened you. I wonder if he’ll care.” Jaime pushed his wet hair back with his fingers andwheeled his horse around. When he was beyond the line of swordsmen, he glanced back at hiscaptain. “Tregar, see that no harm comes to Lord Stark.” \n \n “As you say, m’lord.” \n \n “Still … we wouldn’t want him to leave here entirely unchastened, so”—through the night and therain, he glimpsed the white of Jaime’s smile—“kill his men.” \n \n “No!” Ned Stark screamed, clawing for his sword. Jaime was already cantering off down thestreet as he heard Wyl shout. Men closed from both sides. Ned rode one down, cutting at phantoms inred cloaks who gave way before him. Jory Cassel put his heels into his mount and charged. A steel-shod hoof caught a Lannister guardsman in the face with a sickening crunch. A second man reeledaway and for an instant Jory was free. Wyl cursed as they pulled him off his dying horse, swordsslashing in the rain. Ned galloped to him, bringing his longsword down on Tregar’s helm. The jolt ofimpact made him grit his teeth. Tregar stumbled to his knees, his lion crest sheared in half, bloodrunning down his face. Heward was hacking at the hands that had seized his bridle when a spearcaught him in the belly. Suddenly Jory was back among them, a red rain flying from his sword. “No!” \n \n Ned shouted. “Jory, away!” Ned’s horse slipped under him and came crashing down in the mud. \n \n There was a moment of blinding pain and the taste of blood in his mouth. \n \n He saw them cut the legs from Jory’s mount and drag him to the earth, swords rising and falling asthey closed in around him. When Ned’s horse lurched back to its feet, he tried to rise, only to fallagain, choking on his scream. He could see the splintered bone poking through his calf. It was the lastthing he saw for a time. The rain came down and down and down. \n \n When he opened his eyes again, Lord Eddard Stark was alone with his dead. His horse movedcloser, caught the rank scent of blood, and galloped away. Ned began to drag himself through themud, gritting his teeth at the agony in his leg. It seemed to take years. Faces watched from candlelit windows, and people began to emerge from alleys and doors, but no one moved to help. \n \n Littlefinger and the City Watch found him there in the street, cradling Jory Cassel’s body in hisarms. \n \n Somewhere the gold cloaks found a litter, but the trip back to the castle was a blur of agony, andNed lost consciousness more than once. He remembered seeing the Red Keep looming ahead of himin the first grey light of dawn. The rain had darkened the pale pink stone of the massive walls to thecolor of blood. \n \n Then Grand Maester Pycelle was looming over him, holding a cup, whispering, “Drink, my lord. \n \n Here. The milk of the poppy, for your pain.” He remembered swallowing, and Pycelle was tellingsomeone to heat the wine to boiling and fetch him clean silk, and that was the last he knew. \n \n \n","sourceLink":"http://novel.tingroom.com/kehuan/1029/30951.html","bookId":217,"book":{"id":217,"title":"冰与火之歌：权力的游戏 A Game of Thrones","description":"简介： 故事主要发生在一个架空的大陆：维斯特洛上的七大王国。维斯特洛是一片大约有南美洲那么大的大陆，有可以上溯到12000年前的悠久历史。在那里每一个季节通常持续数年。这片大陆的原住民是森林之子。森林之子与大自然和谐共处，并且使用魔法。先民们最早期的武士带着青铜...","cover":"http://novel.tingroom.com/file/upload/201405/13/14-32-50-41-1.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1029","creation":"Aug 1, 2019 12:18:25 AM","modification":"Aug 1, 2019 12:18:25 AM"}}
