{"id":85878,"no":26,"title":"Page 26","content":"\"What\u0027s that?\" Sergeant B-S asks me in the courtyard, before we\u0027re ordered to march out. He\u0027s pointing at my pillow, which I\u0027m clutching to my chest. \"My special pillow. I can\u0027t sleep without it.\" He shakes his head. \"No. Zis is not beseder --not okay. Put it back\" Well, it was worth a try. Luckily he can\u0027t see the wip-ies hidden in our fatigue pockets. I set my pillow back on my mattress and hurry back to Sergeant B-S and the rest of my unit. I\u0027m not risking another fall like I had on the night of our run, so I find myself in a slow jog next to Miranda. \"Are we friends again?\" She glances at me as we jog side by side. \"Yeah. I was always your friend, Amy. I just got upset for a stupid reason.\" \"Because Nathan was pretending to be my boyfriend? I\u0027m sorry, Miranda. I know you like Nathan as more than a friend. It was insensitive of me to think you wouldn\u0027t care that I made a deal with him to get Avi jealous.\" \"It\u0027s okay. I know Nathan likes Tori. Girls like me never get a guy. Seriously, I tried to hit on Nimrod a few nights ago and he didn\u0027t even notice.\" That\u0027s not a shocker, considering he\u0027s gay. \"I hear he\u0027s already dating someone,\" I say. \"What about Noah?\" \"Colorado Noah?\" \"Yeah,\" I say, feeling her out. \"He\u0027s such a teddy bear, isn\u0027t he?\" \"You mean chubby.\" \"I mean nice. Like you.\" \"Yeah, he\u0027s nice.\" I nudge Miranda and smile. \"Give up on Nathan, Miranda. Now don\u0027t get mad at me for saying this, but I think you\u0027ve been crushing on Nathan for so long because you\u0027re afraid to like someone who might actually like you back. You\u0027re stalling.\" \"You\u0027re acting like a therapist, Amy.\" \"I\u0027ve been to enough of them to know what I\u0027m talking about. Open your eyes to new people.\" I point to Noah, who\u0027s up ahead giving encouragement to our unit, telling us to keep going even though we\u0027re tired. \"He helped me on the range today,\" she tells me. I give myself an inner high five for instigating that little moment. \"We jog slowly beside each other, neither of us saying anything for a while. It could be because we\u0027re panting from the jog... or it could be because my words are sinking in. \"Thanks, Amy,\" Miranda says eventually. \"You\u0027re welcome.\" We finally get to our destination, which is a makeshift campground in the middle of the Negev desert. I can just sense the Israeli scorpions and snakes waiting for a taste of American blood. It\u0027s dark already, but the billions of stars in the sky brighten the night. I look up, wondering if Avi is looking at those same stars. I miss him so much I ache inside, but I\u0027m trying to stay positive and strong. I\u0027ve got to admit it\u0027s tough to be running and setting other people up when the love of my life, the guy who makes me want to be a better person, isn\u0027t with me. Ronit tells us to sit in a big circle. She passes out cans of what looks like fancy dog food. \"What is this?\" I ask her as I lift off the top. \"Dinner.\" \"Dinner?\" \"It\u0027s called Loof.\" Oh, no! Loof! I remember the bathroom wall with the words Beware of the Loof. \"Don\u0027t we have pita? Or hummus?\" I ask her. Listen, those are Israeli staples. \"No. It\u0027s Loof or nothing tonight. This is what the soldiers eat on missions and in desert training. Remember, this isn\u0027t a spa.\" I examine the muddy brown substance. \"Do you eat it with a fork or a spoon?\" \"Whichever you want,\" Ronit tells me. I look at my friends, all sniffing their own processed chunk of food/meat passing as a meal. I have to admit it smells like pasteurized liver, if there is such a thing. I admit I\u0027ve never eaten liver before, even the chopped liver my dad made a couple of times. But it\u0027s Israel, so at least I know it\u0027s kosher and has been blessed by a rabbi. \"Plug your nose and eat the Loof,\" Noah suggests. \"Then it\u0027s not so bad.\" I watch as he scoops out a chunk of the stuff and chows down. My friends are looking at me for direction. Should we follow in Mr. Positive/No Expectations\u0027 footsteps or starve? I could reveal that I brought my own provisions-- KifKafi --in the pockets of my pants. They\u0027ve probably melted, but melted KifKafi are probably better than Loof any day of the week. But we\u0027re soldiers now. And Israeli soldiers eat Loof, no matter how bad it is. I plug my nose with my fingers, scoop out a chunk, and eat it. \"Mmm. Yummy.\" \"Really?\" Jess asks. \"No, not really. It\u0027s absolutely disgusting. But we\u0027re Jewish warrior women, right?\" Jess nods. Miranda nods. Even Tori nods. \"Right!\" they say in unison. We look at Nathan. \"Don\u0027t look at me. I\u0027m no warrior woman. I\u0027m not eating it.\" Tori takes a tester bite from her little can. Miranda and Jess do, too. We all eat the Loof as if it\u0027s a rite of passage. \"Nathan, don\u0027t be a loser. Eat it,\" Tori says, tossing him a fork. Not wanting at provoke Tori\u0027s wrath, even Nathan chows down. He\u0027s a warrior too, after all. A truck with a pile of sleeping bags in the back is waiting for us. We\u0027re instructed to grab one and find a spot on the ground to sleep. Tori, who I haven\u0027t had a chance to talk to in a while, comes up to me. \"So how\u0027s your grandma?\" she asks. \"Alive. I think she\u0027s okay, at least for now.\" I see a bandage on her neck that wasn\u0027t there when I left the base two days ago. \"What happened?\" I ask, pointing to it. \"You promise you won\u0027t laugh?\" \"I promise.\" Tori says, \"I got stung. By a worker bee.\" I suppress a laugh. \"I thought you said they don\u0027t sting.\" \"Obviously I got my facts wrong. Subject over.\" Time to start a new subject. I crane my head, looking for Nathan. Ronit is handing him a small shovel. Gross-- he\u0027s about to dig himself a hole to poop in. He\u0027s probably about to Poop the Loof. I shudder thinking about it. \"Listen,\" I tell Tori. \"Nathan broke up with me.\" \"It probably had something to do with you staring at that guy Avi all the time,\" she says. \"No. It had something to do with you.\" She looks at me like I\u0027m crazy. \"Me?\" \"Yeah. Nathan likes you. He thinks you\u0027re pretty and fun...when you\u0027re not glaring, sneering, or insulting everyone.\" Tori places her sleeping bag on the ground next to mine. \"Nathan isn\u0027t my type,\" she says. \"Why not? Sure, he\u0027s a pain in the ass most of the time. But he\u0027s funny. And smart. And cute. And, to be honest, he\u0027s the best guy friend a girl could ever ask for. He\u0027s just about perfect.\" Tori looks over at Nathan, coming back with the poop shovel. \"Not interested.\" I wave Nathan over to us. He tries to act cool as he says, \"Hey. What\u0027s up? Mind if I sleep with you guys? I mean, uh, sleep next to you guys.\" As he lays down his sleeping bag, head-to-head with Tori\u0027s with hope in his eyes, I tell him the truth. \"Tori says you\u0027re not her type.\" Tori nods to Nathan, emphasizing my statement. \"Did you tell her I was good in bed?\" he asks. I. Can\u0027t. Believe. He. Said. That. Tori\u0027s eyebrows go up. \"You guys had sex? she asks me, just as Jessica lays her sleeping bag alongside ours. Oh, man. I\u0027m the one who\u0027s gonna need the poop shovel now for the flying bullshit about to come out of my mouth. I say a silent prayer for God to forgive me for lying. \"Yeah. Nathan is better than... better than... better than eating a black olive without the pit.\" Nathan looks at me as if I\u0027m a total mashed potato. Jess shakes her head in disbelief. I couldn\u0027t think of anything else to say. I hate olives in general, so having sex with Nathan has got to be better than eating olives, with or without the pits. Tori gives him one of her sneers. \"I think I\u0027ll take a pass,\" she says tardy. \"Give me a chance,\" Nathan responds quickly. \"Why should I?\" Nathan kneels next to her and a sincere look washes over his face. \"Because for some reason I\u0027ve been itching to put a smile on your face since I met you.\" \"Nobody can do that.\" \"Won\u0027t you let me try?\" I see Tori\u0027s face softening. \"You can try, but I guarantee it won\u0027t work.\" \"Ooh, I love a challenge.\" Nathan slides into his sleeping bag and rests his chin on his fists, facing Tori. \"Are you gonna watch me sleep?\" she asks, trying to sound annoyed. I notice she\u0027s not sneering, which is a good sign. \"Yeah. Watching you helps me think up lyrics to my next song. After boot camp, I\u0027ll take out my guitar and sing it to you.\" Tori wipes at her eyes. Obviously nobody\u0027s ever done anything like that for her. She needs Nathan, whether she believes it or not. And he needs her. I look around for Miranda. She\u0027s usually with us, but we\u0027re all settled and she\u0027s nowhere to be seen. I finally see her in a deep conversation with someone a few yards away--Noah. He\u0027s smiling at her. And laughing. I slide into my own sleeping bag (after opening it and checking for snakes and scorpions) and bring George II inside it with me. George is cold on my unshaved legs, the hard metal of the barrel reminding me where we are and why we\u0027re here. Once again I think of Avi, and what military exercises he\u0027s been pulled off base to do. \"Are you wearing your bra?\" Jess whispers. \"Yeah. Aren\u0027t you?\" \"The wire was poking into my side, so I took it off and shoved it to the bottom of the sleeping bag. Remind me to reach down and get it in the morning.\" My bra isn\u0027t at all comfortable to sleep in, but I\u0027m keeping it on. I put a sports bra on before we left, which I\u0027m perfectly aware makes me look like I have a monoboob shelf in front of me. But it does the job of smashing my boobs down and together so they\u0027re not bobbing up and down like a buoy in Lake Michigan when we run. Bouncing boobs is not an option. Of course, squished boobs are not the most comfortable way to sleep. But whatever. I\u0027m smelly from not showering, I don\u0027t have my favorite pillow, the sweat between my squished boobs is itchy, and I\u0027ve got a metal rifle named George II in the sleeping bag with me. The old Amy would whine and complain. The new and improved Amy sucks it up. As I lie here sucking it up, trying to sleep but with my eyes wide open, I glance over at Tori. I see her hand sneak out to tentatively touch Nathan\u0027s. He weaves his fingers through hers without saying a word and they fall asleep holding hands. Which only reminds me of last night, when Avi and I fell asleep holding hands. Argh. I can\u0027t sleep. All I can think about as I look up at the twinkling stars above me is Avi. \"I can count every single rock under me,\" Jess whispers. \"How do they expect us to sleep?\" Now that Jess mentions it, I can feel every rock and pebble under my own body. \"Maybe if we clear out the big ones it won\u0027t be as bad,\" I say, reaching under my sleeping bag for the big rock sticking into my backside. Jess whimpers as she shuffles her body around. \"Ouch. Remind me never to complain about my life back in Chicago.\" \"And remind me to appreciate my dad more. He probably had to sleep like this all the time when he was an Israeli commando,\" I say. \"But the stars are so cool. Why don\u0027t we see as many stars back home?\"","sourceLink":"https://allnovel.net/how-to-ruin-your-boyfriend-s-reputation-how-to-ruin-3/page-26.html","bookId":2766,"book":{"id":2766,"title":"How to Ruin Your Boyfriend\u0027s Reputation (How to Ruin #3)","description":"Storyline: How to Ruin Your Boyfriend\u0027s Reputation (How to Ruin #3) Amy Nelson-Barak, 17, is back in this third installment about a Jewish-American teen learning how to live and love in peace. She signs up for 10 days of training with the Israel Defense Force as soon as she finds out that her long-distance boyfriend, Avi, will be on base as well. But things turn out to be different from what she\u0027d hoped for. She sleeps in a bunk bed underneath coils that look ready to give way, she\u0027s being worked to the bone, and the bathrooms are hardly up to her standards. Worst of all, Avi doesn\u0027t seem remotely thrilled that she\u0027s there. Is something going on between him and a fellow soldier? Strong, beautiful, and able to be with Avi all the time, Liron is everything Amy wants to be. Even though the plot is predictable, readers can\u0027t help but get drawn in by Amy\u0027s fun way of telling her story, and they learn a lot about Israeli teens\u0027 mandatory military service. Elkeles catches new readers up to speed in no time.","cover":"https://allnovel.net/images/how-to-ruin-your-boyfriend-s-reputation-how-to-ruin-3.jpg","author":"Simone Elkeles","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/how-to-ruin-your-boyfriend-s-reputation-how-to-ruin-3.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 5:09:17 PM"}}
