{"id":6370,"no":54,"title":"Part 15 Chapter 5","content":"乘车来到火车站、我们还有十二分钟。我还不敢就同菲尔莫告别。我觉得，尽管迷糊了，到了最后一分钟他仍有可能跳下车跑回吉乃特身边去。任何事情都会叫他改变主意，哪怕是一恨稻草呢。于是我拽着他过了街来到一家酒馆里，我说，“现在你再喝一杯茵香酒—最后一杯，我来付钱……付你的钱。”\n When we rolled up to the station we had still about twelve minutes to kill. I didn\u0027t dare to say good bye to him yet. At the last minute, rattled as he was, I could see him jumping off the train and scooting back to her. Anything might swerve him. A straw. So I dragged him across the street to a bar and I said: \"Now you\u0027re going to have a Pernod – your last Pernod and I\u0027m going to pay for it… with your dough.\"\n \n 　　听了这话他不安地瞧了我一眼，他喝了一大口茴香酒，然后像一条受伤的狗一样扭过头来。他说，“我也知道不该把那些钱都托付给你，可是……可是……唉，算了，你看着办吧。我不想让她自杀，就是这。”\n Something about this remark made him look at me uneasily. He took a big gulp of the Pernod and then, turning to me like an injured dog, he said: \"I know I oughtn\u0027t to trust you with all that money, but… but… Oh, well, do what you think best. I don\u0027t want her to kill herself, that\u0027s all.\"\n \n 　　“自杀，她不是那种人！若相信这话，你就一定是自己想的太多了。至于钱。尽管我不愿意给她，我还是答应你直接去邮局电汇给她。我不会多装一分钟的。”正说着我瞅见一个旋转货架上摆着几张明信片，我抓了一张—是绘有埃菲尔铁塔的—叫他在上面写几个字。“告诉她你现在已经在航行中了。告诉她你爱她，一到美国就会打发人来接她……去邮局时我用气压传送把它发出，今晚我就去看她。你放心，一切都会好的。”\n \"Kill herself?\" I said. \"Not her! You must think a hell of a lot of yourself if you can believe a thing like that. As for the money, though I hate to give it to her, I promise you I\u0027ll go straight to the post office and telegraph it to her. I wouldn\u0027t trust myself with it a minute longer than is necessary.\" As I said this I spied a bunch of post cards in a revolving rack. I grabbed one off – a picture of the Eiffel Tower it was – and made him write a few words. \"Tell her you\u0027re sailing now. Tell her you love her and that you\u0027ll send for her as soon as you arrive… I\u0027ll send it by pneumatique when I go to the post office. And tonight I\u0027ll see her. Everything\u0027ll be Jake, you\u0027ll see.\"\n \n 　　一边说我们一边又过街来到火车站，还有两分钟就要开车了，我现在觉得保险了，在大门口我拍拍他的背，指指火车。我没有同他握手，他的口水会流我一身的。我只是说，“快点！车马上要开了！”说完我转身拔腿就走，甚至没有回头看一眼他是否上了车。我不敢看。\n With that we walked across the street to the station. Only two minutes to go. I felt it was safe now. At the gate I gave him a slap on the back and pointed to the train. I didn\u0027t shake hands with him – he would have slobbered all over me. I just said: \"Hurry! She\u0027s going in a minute.\" And with that I turned on my heel and marched off. I didn\u0027t even look round to see if he was boarding the train. I was afraid to.\n \n 　　把他匆匆送走这一阵，我从来没有想到这一下我也就摆脱他了。我向他许诺了很多事情，可那只是为了叫他别再嚷嚷。说起去见吉乃特，我同他一样缺乏勇气，自己就先吓坏了。一切发生得这么迅捷，简直不可能完全把握住这局面的关键。我在甜蜜的昏沉中步行离开车站，手里捏着那张明信片。我靠在一根灯柱上读了上面的话，这封信写得有点荒谬。我又读了一遍，以便弄确实自己没有在做梦，然后就把它撕了，扔进了阴沟。\n I hadn\u0027t thought, all the while I was bundling him off, what I\u0027d do once I was free of him. I had promised a lot of things – but that was only to keep him quiet. As for facing Ginette, I had about as little courage for it as he had. I was getting panicky myself: Everything had happened so quickly that it was impossible to grasp the nature of the situation in full. I walked away from the station in a kind of delicious stupor – with the post card in my hand. I stood against a lamppost and read it over. It sounded preposterous. I read it again, to make sure that I wasn\u0027t dreaming, and then I tore it up and threw it in the gutter.\n \n 　　我忐忑不安地四下里望望，半心半意地预备看到吉乃特举着战斧朝我追来。没有人跟着我，我便懒洋洋地朝拉斐特广场走去。正如我早先说过的，这天很美。天上悬着一朵朵淡淡的松软白云，随风飘荡，帆布遮日篷也在啪啪扑动。巴黎在我眼里从来还没有像这天这么美，我几乎有点儿后悔把那个可怜的家伙送走了。在拉斐特广场，我面朝教堂坐下凝视着钟塔，它不是一座了不起的建筑，不过它蓝色的钟面总叫我为之着迷。今天它比以往更蓝，我简直无法把目光从上面移开。\n I looked around uneasily, half expecting to see Ginette coming after me with a tomahawk. Nobody was following me. I started walking leisurely toward the Place Lafayette. It was a beautiful day, as I had observed earlier. Light, puffy clouds above, sailing with the wind. The awnings flapping. Paris had never looked so good to me; I almost felt sorry that I had shipped the poor bugger off. At the Place Lafayette I sat down facing the church and stared at the clock tower; it\u0027s not such a wonderful piece of architecture, but that blue in the dial face always fascinated me. It was bluer than ever today. I couldn\u0027t take my eyes off it.\n \n 　　除非菲尔莫发疯发得厉害，给吉乃特写信说明一切，她永远也不会知道发生了什么事情。即使她知道他留给她两千五百法郎，她也无法证明这一点，我始终可以说这是菲尔莫臆想出来的。一个不戴帽子就走掉的疯家伙也会编造出两千五百法郎和别的东西来。我在纳闷，到底有多少钱？我的衣袋都被钱的重量拉得坠下来了，我把它全掏出来细细数了一遍，一共是两干八百七十五法郎零三十五生丁，比我预计的还多。七十五法郎零三十五生丁必须花掉，我要一个整数，要整整两千八百法郎。正在这时我看到一部出租车开到了路边，一个女人双手抱着一只白狮子狗从车上下来，那狗在朝她的绸裙子上撒尿。带着一条狗去兜风这个主意使我大为恼怒，我暗暗对自己说，我一点儿不比她的狗差。我朝司机打个手势，叫他拉我穿过波伊思公园。他想知道确切的地址，我说，“随便哪儿。穿过波伊思，围着它兜一圈。不用快，我不急着上哪儿去。”我靠在后座上，让路边的房屋嗖嗖掠过，还有参差不齐的屋顶、烟囱顶、涂上颜色的墙、小便池、叫人头晕眼花的十字路口。路过“圆顶”时我想去撒泡尿，由于说不上下面会出现什么情况，我叫司机等着。我这还是平生头一回撒尿时叫出租车等着。这样会浪费多少钱？不太多。有了兜里那些钱，我能花得起钱叫两辆出租车等我。我仔细看看四周，可是没有看见什么值得一看的东西。我要的是新鲜的、没有人动过的、来自阿拉斯加或维尔京群岛的、干净、新鲜、带股天然芳香的皮肤。不用说，走来走去的女人中没有这样的。我并不非常失望，也不大在乎是否找得到。要紧的是永远别太着急，到时一切自然都会有的。\n 　　Unless he were crazy enough to write her a letter, explaining everything, Ginette need never know what had happened. And even if she did learn that he had left her 2,500 francs or so she couldn\u0027t prove it. I could always say that he imagined it. A guy who was crazy enough to walk off without even a hat was crazy enough to invent the 2,500 francs, or whatever it was. How much was it, anyhow?, I wondered. My pockets were sagging with the weight of it. I hauled it all out and counted it carefully. There was exactly 2,875 francs and 35 centimes. More than I had thought. The 75 francs and 35 centimes had to be gotten rid of. I wanted an even sum – a clean 2,800 francs. Just then I saw a cab pulling up to the curb. A woman stepped out with a white poodle dog in her hands; the dog was peeing over her silk dress. The idea of taking a dog for a ride got me sore. I\u0027m as good as her dog, I said to myself, and with that I gave the driver a sign and told him to drive me through the Bois. He wanted to know where exactly. \"Anywhere,\" I said. \"Go through the Bois, go all around it – and take your time, I\u0027m in no hurry.\" I sank back and let the houses whizz by, the jagged roofs, the chimney pots, the colored walls, the urinals, the dizzy carrefours. Passing the Rond Point I thought I\u0027d go downstairs and take a leak. No telling what might happen down there. I told the driver to wait. It was the first time in my life I had let a cab wait while I took a leak. How much ran you wast a that way? Not very much. With what I had in my pocket I could afford to have two taxis waiting for me. I took a good look around but I didn\u0027t see anything worth while. What I wanted was something fresh and unused – something from Alaska or the Virgin Islands. A clean fresh pelt with a natural fragrance to it. Needless to say, there wasn\u0027t anything like that walking about. I wasn\u0027t terribly disappointed. I didn\u0027t give a fuck whether I found anything or not. The thing is, never to be too anxious. Everything comes in due time.\n \n 我们驶过凯旋门，几个游览者在无名英雄纪念墓附近游荡。穿过波伊思时我看着所有坐在高级轿车里出风头的阔娘儿们，她们呼啸而过，仿佛有一个目的地似的。毫无疑问，这样是要显得有身价，叫世人看看她们的罗尔斯一罗伊斯和希斯帕诺?苏扎斯高级轿车跑得多么平稳，而我心里却比任何一辆罗尔斯-罗伊斯更加平稳舒服，像天鹅绒一样平滑。天鹅绒的皮层，天鹅绒的脊柱，还有天鹅绒的轮轴润滑油。啊！真是一件美妙的事情—口袋里装着钱，像喝醉酒的水手一样半个小时就把它挥霍光。你会觉得这个世界都是你的，而最妙的是，你不知道拿它怎么办才好。你可以坐在车里让里程表疯了一样猛转，可以让风吹过头发，可以停下喝一杯，可以大方地付小费，还可以摆臭架子，好像天天都如此生活。不过你却无法酝酿一场革命，你也无法把肚子里的脏东西都冲洗出来。\n We drove on past the Arc de Triomphe. A few sightseers were loitering around the remains of the Unknown Soldier. Going through the Bois I looked at all the rich cunts promenading in their limousines. They were whizzing by as if they had some destination. Do that, no doubt, to look important – to show the world how smooth run their Rolls Royces and their Hispano Suizas. Inside me things were running smoother than any Rolls Royce ever ran. It was just like velvet inside. Velvet cortex and velvet vertebrae. And velvet axle grease, what! It\u0027s a wonderful thing, for half an hour, to have money in your pocket and piss it away like a drunken sailor. You feel as though the world is yours. And the best part of it is, you don\u0027t know what to do with it. You can sit back and let the meter run wild, you can let the wind blow through your hair, you can stop and have a drink, you can give a big tip, and you can swagger off as though it were an everyday occurrence. But you can\u0027t create a revolution. You can\u0027t wash all the dirt out of your belly.\n \n 　　来到欧特伊门时我叫司机朝塞纳河开，我在德塞夫勒桥那儿下车沿河步行朝欧特伊高架桥走去。河流在这儿仅有一条小溪那么宽，树木都生长到河堤上了。河水是绿的，水面非常平静，尤其是在靠近彼岸处。不时有一只大平底船突突驶过，穿紧身游泳衣的人们站在草地上晒太阳。每一件物体都显得很近，都在颤动，都在同强烈的光线一起振动。\n When we got to the Porte d\u0027Auteuil I made him head for the Seine. At the Pont de Sèvres I got out and started walking along the river, toward the Auteuil Viaduct. It\u0027s about the size of a creek along here and the trees come right down to the river\u0027s bank. The water was green and glassy, especially near the other side. Now and then a scow chugged by. Bathers in tights were standing in the grass sunning themselves. Everything was close and palpitant, and vibrant with the strong light.\n \n 　　经过一个设有座席、供应啤酒的花园时，我看到一群骑自行车的人围坐在一张桌子边。我在附近找了一个座位，叫了半升啤酒。听着他们喋喋不休的闲扯，我一刹那间又想到了吉乃特，仿佛看见她在屋里来回顿脚、扯自己的头发、像野兽一样又哭又嚎。我看见菲尔莫的帽子放在帽架上，心想不知我穿上他的衣服合适不合适，我尤其喜欢他那件插肩袖大衣。哈，现在他准上路了，再过一会儿船就会在他脚下晃动。英语！他想听到人们说英语。多么古怪的念头！\n Passing a beer garden I saw a group of cyclists sitting at a table. I took a seat nearby and ordered a demi. Hearing them jabber away I thought for a moment of Ginette. I saw her stamping up and down the room, tearing her hair, and sobbing and bleating, in that beastlike way of hers. I saw his hat on the rack. I wondered if his clothes would fit me. He had a raglan that I particularly liked. Well, by now he was on his way. In a little while the boat would be rocking under him. English! He wanted to hear English spoken. What an idea!\n \n 　　我突然又想到，若是想走，我自己也可以回美国。这是扩头一次碰到这样一个天赐良机，我问自己，“你想走吗？”没有回答，我的思绪又转到其他事情上去了，转向大海和大洋彼岸，离开它时我回头最后看了它一眼，看见摩天大楼在一片雪花中渐渐消失。现在我又看见这些摩天大楼赫然耸立在眼前，同我离开时一样，阴森森的。我看到光线从它们的肋骨间透出，看到从哈莱姆到炮台公园的整个纽约展现在眼前，看到被蚂蚁般的人群堵塞的街道，看到高架铁道上的车呼啸而过，看到人流涌到剧院。我隐约想到，不知我妻子现在怎样了。\n Suddenly it occurred to me that if I wanted I could go to America myself. It was the first time the opportunity had ever presented itself. I asked myself – \"do you want to go?\" There was no answer. My thoughts drifted out, toward the sea, toward the other side where, taking a last look back, I had seen the skyscrapers fading out in a flurry of snowflakes. I saw them looming up again, in that same ghostly way as when I left. Saw the lights creeping through their ribs. I saw the whole city spread out, from Harlem to the Battery, the streets choked with ants, the elevated rushing by, the theaters emptying. I wondered in a vague way what had ever happened to my wife.\n \n 　　平静地想过这一切后，我变得非常安详了。塞纳河在这儿静静地绕过群山，它喜爱这片浸透往事的土地，因而不论一个人的思绪漫游到何处，他永远不会把这条河同人类的活动分开。\n After everything had quietly sifted through my head a great peace came over me. Here, where the river gently winds through the girdle of hills, lies a soil so saturated with the past that however far back the mind roams one can never detach it from its human background.\n \n 　　天啊，黄金般的祥和气氛在我眼前闪现，只有一个患神经病的人才想掉头走开。塞纳河这样静悄悄地流淌，人们几乎注意不到它的存在。它一直躺在那儿，宁静而又谦和，像人身上流动的一条大动脉。在笼罩在身上的美妙祥和气氛中，我似乎已经爬上了一座高山的山顶，在一段短暂的时间内我可以放眼四周，领略这番风景蕴涵的意义。\n Christ, before my eyes there shimmered such a golden peace that only a neurotic could dream of turning his head away. So quietly flows the Seine that one hardly notices its presence. It is always there, quiet and unobtrusive, like a great artery running through the human body. In the wonderful peace that fell over me itseemed as if I had climbed to the top of a high mountain; for a little while I would be able to look around me, to take in the meaning of the landscape.\n \n 　　人类是一些古怪的动植物。从远处看他们显得微不足道，走到近处他们又显得丑恶、刻毒。他们最需要的是周围有足够的空间—比时间更多的空间。\n Human beings make a strange fauna and flora. From a distance they appear negligible; close up they are apt to appear ugly and malicious. More than anything they need to be surrounded with sufficient space – space even more than time.\n \n 　　太阳正在落下。我觉得这条河正从我身上流过—它的过去、它年代久远的土壤和多变的气候。群山轻柔地束缚着它，因而它的流向早已确定。\n The sun is setting. I feel this river flowing through meits past, its ancient soil, the changing climate. The hills gently girdle it about: its course is fixed.\n \n \n","sourceLink":"http://novel.tingroom.com/mingren/242/330.html","bookId":205,"book":{"id":205,"title":"北回归线 Tropic Of Cancer","description":"简介： Tropic of Cancer is a novel by Henry Miller, first published in 1934 by the Obelisk Press in Paris, France. Its publication in 1961 in the United States by Grove Press led to an obscenity trial that was one of several that tested American la...","cover":"http://novel.tingroom.com/uploads/allimg/110308/1-11030Q30G90-L.jpg","type":"双语小说","link":"http://novel.tingroom.com/mingren/242","creation":"Aug 1, 2019 12:18:23 AM","modification":"Aug 1, 2019 12:23:23 AM"}}
