{"id":68340,"no":17,"title":"Page 17","content":"“That’s no way to live, Will,” Gates said. “Right, guys?” The nearby Saints cheered in response. “Usually I’m the reckless one, but you all make me feel like a librarian,” Will said. “No, you’ve got it wrong,” Gates said. “We believe that when good fortune comes our way, that we have a responsibility to enjoy it as much as possible.” “Responsibility to what?” “Not to what, to who. To our friends that didn’t make it this far. All of us have lost people that were close to us. Boyfriends, girlfriends …” Saints around the table nodded in solemn confirmation. “I had two brothers and three sisters when this all started, and now, y’know, it’s just me,” Gates said. Gates rubbed his eyes, like the memory had just given him a headache. Poor bastard, Will thought, Gates probably had to watch it happen too. He couldn’t imagine how terrible that was. The image of David’s corpse drying up in their living room popped into Will’s head and his mood sank. “You have to enjoy life for them,” Gates said. “Out there, any day could be your last. Hell, it’s no different in here. You gotta enjoy the good times while you still have the chance. Like tonight. We have each other, no one is shooting at us, and we have some vodka. I want to have a good time!” More cheers through the room. “My brother died,” Will said. He was surprised how the words fell so easily out of his mouth. He hadn’t said it out loud before. Gates’s demeanor grew more serious. “That was David? The one from your story?” Will nodded. “Somebody pour Will another drink.” A Saint girl placed collapsible camping cups in front of Will and Gates, with an inch of vodka at the bottom of each. Gates raised his cup. “To David,” Gates said to the room. The room said it back, and the sound of thirty-odd strangers saying David’s name together took Will’s breath away. All the sadness, all the love Will felt for his brother came rushing to the surface. Gates saw the effect the toast had on Will. He gripped Will’s shoulder firmly and stared at him, his red eye unblinking. “You’re all right man, you’re good,” Gates said. Gates’s encouragement actually helped to steady Will. “You mind giving me a minute?” Will said. “Sure, man. Of course.” Gates got up and walked off. Will picked up his cup. The idea that the best way he could mourn David was to enjoy his life as much as he could was intoxicating, and he really hoped was true. He raised his cup into the air. “This one’s for you, David,” Will said to himself. He downed his drink. As the night continued, they fed him more vodka. Someone gave him a pill and said it was a muscle relaxant. He ate three peanut butter and jelly sandwiches, and a whole sleeve of water crackers. Will’s world began to blur and lose shape. He remembered playing a game of monkey-in-the-middle with an empty pistol, where it was him and Gates tossing the gun over Fowler’s head. He remembered talking a lot of shit, to a lot of people. He ran his mouth about how they shouldn’t trust Zachary. He told them about P-Nut’s weakness for girls, how he was a fiend for them. He told them all sorts of stuff. It was nice to talk to anyone at all, and he didn’t give a damn what he was saying. Life had been so shitty to him lately that he felt he’d earned this night of drinking and partying and not giving a fuck. At some point near the end of the night, the girl with the baby chick hair was sitting in his lap. He couldn’t remember when she had sat down, how long she had been there, or what they had been talking about so far. But her warm weight felt good on his leg, and he wanted to keep squeezing the softness of her waist forever. The party was still in full swing, but Gates wasn’t with him anymore. “I have another McKinley question,” baby chick said. “Lay it on me,” Will said. Baby chick looked around with a hint of mischief in her eyes. She leaned in close, and for a moment Will thought she was going to kiss him, but she leaned further in until her mouth was by his ear, and whispered, “Where do you get condoms?” He turned his head until his lips grazed the tender skin of her earlobe. She smelled like baby shampoo. “The Sluts trading post is the easiest place,” Will whispered. She drew her head back and smiled. “You want to see my room?” “Yes,” he said. The baby chick girl took his hand and pulled him away from the table. He fell on his face immediately. The world had tilted and no one had told him. He heard her laughing, at least he thought it was her. The cool concrete floor felt amazing against his cheek. Somewhere, in a dark room, the baby chick kissed him. She pushed him onto a bed and laid herself onto his body. Her tongue met his. Salty-sweet lips. “Take off my shirt,” she whispered. He went for it. His hands grabbed cotton and he pulled. With the room spinning all around him, it was far more difficult than he thought, but he managed to get that shirt off of her. What was underneath her shirt was so much softer than cotton. He wished he could see it straight. “You’re fun,” she whispered in his ear. And that was the last thing Will remembered. 15 LUCY STARED AT A PILE OF BROKEN GLASS on the floor below her. She was in a push-up position, and she was naked. A circle of Sluts stood around her, shouting. “Fifteen …,” Lucy said as she lowered herself toward the glass. She barely pushed her way back up. Her fully extended arms quaked. “Again! Push, you little bitch!” someone shouted at her. It was day seven of Naked Week. The Sluts had told her for days that she didn’t stand a chance, that she’d never make it this far. They said eleven girls had died during Naked Week, and they were now stuffed in random locker graves through the school. It was all Lucy had been thinking about for days, her naked body hanging dead in a five-by-one metal box. Half of her had thought about running. No, most of her had. She was sick of living like this. It had been endless, pointless abuse. She was Cinderella to sixty-three evil stepsisters. They all picked on her. She survived on only oatmeal which, most of the time, they threw at her. They slapped her, tripped her, purposefully spilled shit on floors she’d just cleaned and made her clean it again. There wasn’t a day where they hadn’t mocked her naked body, poured cold water on her, or flicked her nipples when they caught her off guard. She’d told herself all kinds of excuses to stay along the way, but the one she repeated the most was that she’d wanted this. She’d signed up of her own free will because she’d wanted to be like these girls. Tough. Unafraid. Sluts all had this odd way of smiling, like they were wearing an invisible suit of armor that made them invincible, and they were amused that you didn’t know about it. Actually, it was Violent’s smile. Everyone else just seemed to copy her. Lips wore it too. She crouched in front of Lucy, planting her hands on her knees and shoving her face forward like a lip-less gargoyle. “You better start pushing or I’m gonna shove your face in that glass,” she said. “No boys will smile at you then,” another Slut said. “You better hit sixteen! I’ve been dealing with this ‘fifteen’ bullshit for a week now!” Lips screamed. Lucy’s arms were blazing with pain. Her waist was rapidly sagging down. Lips stood up. “Pathetic!” She wasn’t going to give Lips the satisfaction of giving up. The pile of clear glass shards glinted underneath her. Jagged spires pointed up at her eyes. Curved shards from broken bottles waited for her face, ready to plunge through her cheeks if her head were to come crashing down. Lucy bent her elbows. She felt her chest muscles pull tight and blossom with pain. She tried to stop her descent, but realized immediately that she could only push hard enough to slow it, not stop it. Blades of glass crept toward her face. All of a sudden, Lucy’s muscles shut down. Her smooth cheeks, the tender skin of her lips, the thin membrane of her eyelids, it all plummeted toward the mound of glass knives. She felt something yank on the back of her hair. Her naked body slapped down onto the floor, but the hair-puller kept Lucy’s head cocked all the way back, and Lucy’s face stayed out of the glass pile except for a single shard that pricked the skin of her chin. She was able to do half a push-up, enough to get a knee under her and get on all fours. She rolled to the side and saw that it was Lips who had held her hair. “You’ll never get any stronger, will you?” Lips said, disgusted. Lips kicked the shard pile at her. Lucy barely had time to cover her face. She felt stings of pain all over her forearms, stomach, and thighs. She lowered her arms from her face. Glass shards were all around her. Dots of blood popped up all over her bare body, and those dots began to swell into little round berries of blood, before succumbing to gravity, and dripping down her skin. “Take her to the freezer,” Lips said to the other Sluts. Lucy could see her breath. It came out in foggy huffs, lit blue by the single bare bulb above her. Her body hadn’t stopped shaking for the entire four hours that she’d been locked in the kitchen’s walk-in freezer. She knew why Lips had locked her in there. It was the last day of Naked Week, and that vindictive cow wanted to squeeze as much suffering into the remaining hours as she could. This was almost the end. As soon as they let her out of this ice box, it would all be over. Lips would have to eat her words. She will have proved herself. All Lucy had done in the past week was work, get yelled at, get pushed around, flinch about every five minutes, and eat oats off the floor. She couldn’t believe she’d endured it all. They had to respect her after this, she’d taken all they could dish out. As miserable as she felt now, with her blood running cold, and her teeth chattering uncontrollably, she was impressed with herself. She never would have imagined she could handle all this.","sourceLink":"https://allnovel.net/the-saints-quarantine-2/page-17.html","bookId":1723,"book":{"id":1723,"title":"The Saints (Quarantine #2)","description":"Storyline: The Saints (Quarantine #2) Nothing was worse than being locked in—until they opened the door... McKinley High has been a battle ground for eighteen months since a virus outbreak led to a military quarantine of the school. When the doors finally open, Will and Lucy will think their nightmare is finished. But they are gravely mistaken. As a new group of teens enters the school and gains popularity, Will and Lucy join new gangs. An epic party on the quad full of real food and drinks, where kids hookup and actually interact with members of other gangs seemed to signal a new, easier existence. Soom after though, the world inside McKinley takes a startling turn for the worse, and Will and Lucy will have to fight harder than ever to survive.","cover":"https://allnovel.net/images/the-saints-quarantine-2.jpg","author":"Lex Thomas","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-saints-quarantine-2.html","creation":"Oct 5, 2019 8:57:54 AM","modification":"Oct 5, 2019 10:08:29 AM"}}
