{"id":68353,"no":30,"title":"Page 30","content":"The Harley engine grumbled behind him. “You go ahead without me. I’ll catch up, man,” Will said. “What, just me?” Gates said. “You can’t party without your boyfriend?” Lucy said. Ooohs erupted all around. Gates took a step toward her, and the Sluts broke through the crowd to flank Lucy. Knives out. Will kept his eyes locked on Lucy. It was clear that this wasn’t what she wanted either. “Whoa, easy,” Will said. “No need for trouble, now. Let’s chill out, put the weapons away.” Will gave Gates a stern look to make sure he was on board with this plan. It was the first time he’d ever stood up to Gates so directly. The anger in Gates’s face scared Will more than the fifteen-odd blades pointed at him. But in a blink, it vanished. Gates went full smile. He stepped back. He threw his arms up in the air dramatically. “Anybody looking for fun, follow me!” Gates shouted. Gates mounted the bike and gunned it, roaring away. The crowd closed the gap behind him with cheers, and partying resumed again. Will turned to face Lucy. Neither of them spoke as the party swirled around them. Will felt at peace standing next to her. “Should we talk?” Will said. The tension eased from Lucy’s face. She seemed like she was about to nod, but some Nerd with a pompadour stepped up beside her. “We’re gonna hit the slip ’n’ slide,” the Nerd said to Lucy. Will looked him up and down. “That sounds good. Why don’t you get lost?” “What’d you say?” the Nerd said. “Bartholomew,” Lucy said quick, stepping between them. “Give me a minute, okay?” The Nerd glared at Will, then walked away, shaking his head. “Bartholemew, huh? Your friend has a stupid name.” She didn’t react. “Is this part of your new Slut personality? No laughing?” Lucy twisted her face into a sneer. “No. We were all laughing our asses off a few minutes ago. When you showed up on a motorcycle.” “Oof,” Will said with a nod. “Pretty respectable party though,” Lucy said. Will shrugged. “I had to come up with some way to get you to show up and talk to me again.” “Yeah, right,” she said and rolled her eyes. “I knew the best Lucy bait was pizza.” Lucy laughed. Finally a sign that things between them weren’t actually as bad as they looked, and that they didn’t have to keep acting like they were enemies. “So, really,” Will said. “Why did you go Slut?” “Are you really asking, or is this a set up for a joke?” “I’ll get back to you on the joke, but I gotta be honest, I’m still getting used to the red. I did not see that coming. Like ever.” “You got a problem with it?” “I guess not. So, what do you do, just sit around all day cutting the crotch out of your jeans?” Will said, cracking up. “Oh, I see,” Lucy said. “You still think you’re funny!” She pointed at his duct-taped torso. “Good thing you’ve never grown any body hair or it might hurt to take that tape off.” “Damn! Slut Lucy doesn’t mess around.” “No, she doesn’t.” Lucy held his stare. This was new. She didn’t look away, or do something cute to break the awkward moment. This new Slut Lucy was right at home with the tension. “I miss you,” Will said. Lucy faltered. Will’s emotion seemed to make her nervous. Bart walked over from the spot where he’d been standing, ten feet away. “Lucy, we should get going if you’re done talking to … this dude,” Bart said. “Beat it, Jebediah,” Will said. “It’s Bart,” Bart said. “Bartholomew,” Lucy said. “Right, whatever. Don’t you have a barn to raise or something?” “Will, stop,” Lucy said. “Why? It’s my party, and this big lump is messing up our vibe.” “Yeah, well we’re on a date,” Lucy said. “I’ll see you later, Will.” She walked off with Bart. Bart put his arm around her, and she looked happy to let him. Will watched her red hair disappear in the crowd. It made no sense. The whole school loved him. Why couldn’t she? Will kicked the dirt. He’d started the night feeling invincible, but a few minutes with Lucy, and it was like she had taken a giant ice cream scoop to his middle, and left a gaping hole behind. 25 HILARY HAD COME TO SEE P-NUT. They’d been secretly flirting for almost a year. Anytime he was near, and Sam wasn’t around, P-Nut would wink at her, and blow her kisses, or steal a few moments with her at the market to tell her exactly how he would make love to her. At first, she was offended that he thought he was worthy of her. But he never gave up. And eventually, the fact that he was the only boy to ever approach her like that, when he knew full well Sam would wage war on the Skaters for it, started to turn her on. Now that she was looking for a new boy, P-Nut was first on her list. She stood in the Skater’s headquarters, the old administrative offices, with a crew of Pretty Ones. P-Nut balanced on the top rung of an aluminum folding ladder above her. “Hand me that hammer, will ya, perfect?” P-Nut said. He had the ball of one foot on the rung, his other leg extended out to the side, keeping his balance. He wasn’t wearing a shirt. P-Nut never wore a shirt. Hilary picked the hammer up from the floor and handed it up to him. He could have grasped it by the head, but he reached further, just to touch her hand. “Thanks,” he said. In his other hand, he held a noose that was tied around the neck of a full-size, fully dressed, department store male mannequin. P-Nut hammered the end of the noose into the ceiling, defying gravity by staying on the ladder, and giving a Hilary an anatomy lesson of all the muscles of his torso in the process. The mannequin twisted and turned by the neck, his perfect face frozen in a white-toothed smile. Its hands were reaching out, with open palms, as if it meant no harm. P-Nut gave the nail one last solid whack, then hopped down to the floor. “What’s that for?” Hilary asked. “To practice hitting people while you skate past them. Usually we use a duffel bag full of water bottles as a target, but that Gates dude got this for us.” Gates. Everybody loved to talk about him like he was God’s gift to McKinley, but Hilary prided herself on her taste. She knew the difference between a boy that was built to last, and one that was a fad. Gates didn’t smell like a winner to her. He’d burn out, or screw up, or do something wrong, and he’d end up going down hard. “A mannequin?” she said up to P-Nut. “That’s all you asked for?” “One of the things.” He took Hilary’s hand by the fingertips like she imagined French boys did. “And now I got you here. What more could a boy want?” “Are you serious?” she said, rolling her eyes. “Hilary. I live for you,” he said with a straight face. She giggled. She couldn’t help it. No one really talked like that. “You got no idea how honored I am to have Hilary Bowden in the house.” “Stop it,” she said, wanting him to go on. “You want the tour?” “Dying for it.” P-Nut put his hand on her lower back and led her forward. Very low on her lower back actually, closer to upper ass. He did it with complete confidence. She decided to let him. This had to go right, because too much had already gone wrong. She’d gone to George Diaz, a Varsity she thought she could build into something. He had the potential to lead Varsity as long as Hilary was pulling the strings. She told him how easy it would be to overthrow Terry, but he was hearing none of it, and said it would only make them look weaker in front of the whole school if they threw out another leader. George still wanted to fool around with her, of course, but she told him she has a rule against hooking up with bald guys. That shut George up. His hair was already thinning, and he was only seventeen. As Hilary walked past a row of administrative offices, P-Nut indicated the last one. “Here’s our skate shop,” he said. “If you ever feel the need to ride, I will personally make your deck.” “Very generous of you.” Inside the room, Skaters were building skateboard decks on tables. The decks of their boards were broken pieces of wood from drop palets, desks, and other furniture. They ground them down to acceptable shapes with an array of customized tools. Others were hacking at the top surface of more finished boards with sharpened cafeteria knives, to give the surfaces more grip. In the corner, a worried Skater with all of his head shaved but a black sideways mohawk that went from ear to ear instead of front to back, stood watch as a Skater girl with a smiley face shaved into her head screwed one of his trucks into his new deck. He clutched his other truck by the wheels and held it to his chest. Hilary and P-Nut neared the end of the hallway. “Don’t know if you ever got a chance to see the college resource library when it was … normal, but we kinda tricked it out,” P-Nut said. He opened the door to a room that was centered around the giant half-pipe. They’d bashed through the ceiling into the room above. Two Skaters dropped in from the room above and crisscrossed across the half-pipe’s smooth linoleum tile surface. Hilary watched one soar into the air, past the old ceiling and the guts of the missing floor, up into the classroom above, where the Skaters had hung a blackboard vertically from the ceiling. When he reached the pinnacle of his jump, the Skater slapped a sticker on the hanging blackboard, not quite as high as the highest sticker, and dropped back down into the pipe. Skaters watching on both floors cheered his effort. The blackboard swung wildly from the brown and white extension cords that tethered it to the ceiling. The second Skater fell near the bottom, hit his head, and lay on his stomach, not moving. Other kids rushed to help.","sourceLink":"https://allnovel.net/the-saints-quarantine-2/page-30.html","bookId":1723,"book":{"id":1723,"title":"The Saints (Quarantine #2)","description":"Storyline: The Saints (Quarantine #2) Nothing was worse than being locked in—until they opened the door... McKinley High has been a battle ground for eighteen months since a virus outbreak led to a military quarantine of the school. When the doors finally open, Will and Lucy will think their nightmare is finished. But they are gravely mistaken. As a new group of teens enters the school and gains popularity, Will and Lucy join new gangs. An epic party on the quad full of real food and drinks, where kids hookup and actually interact with members of other gangs seemed to signal a new, easier existence. Soom after though, the world inside McKinley takes a startling turn for the worse, and Will and Lucy will have to fight harder than ever to survive.","cover":"https://allnovel.net/images/the-saints-quarantine-2.jpg","author":"Lex Thomas","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-saints-quarantine-2.html","creation":"Oct 5, 2019 8:57:54 AM","modification":"Oct 5, 2019 10:08:29 AM"}}
