{"id":10672,"no":14,"title":"XIII BRER FOX, BRER RABBIT, AND KING DEER\u0027S DAUGHTER","content":"Notwithstanding Brother Rabbit\u0027s success with the drum, the little boy was still inclined to refer to Mr. Benjamin Ram and his fiddle; but Uncle Remus was not, by any means, willing that such an ancient vagabond as Mr. Ram should figure as a hero, and he said that, while it was possible that Brother Rabbit was no great hand with the fiddle, he was a drummer, and a capital singer to boot. Furthermore, Uncle Remus declared that Brother Rabbit could perform upon the quills,[16] an accomplishment to which none of the other animals could lay claim. There was a time, too, the old man pointedly suggested, when the romantic rascal used his musical abilities to win the smiles of a nice young lady of quality—no less a personage, indeed, than King Deer\u0027s daughter. As a matter of course, the little boy was anxious to hear the particulars, and Uncle Remus was in nowise loath to give them. [59]\"W\u0027en you come ter ax me \u0027bout de year en day er de mont\u0027,\" said the old man, cunningly arranging a defence against criticism, \"den I\u0027m done, kaze de almanick w\u0027at dey got in dem times won\u0027t pass muster deze days, but, let \u0027lone dat, I \u0027speck dey ain\u0027t had none yit; en if dey is, dey ain\u0027t none bin handed down ter Remus. \"Well, den, some time \u0027long in dar, ole Brer Fox en Brer Rabbit got ter flyin\u0027 \u0027roun\u0027 King Deer daughter. Dey tells me she \u0027uz a monst\u0027us likely gal, en I \u0027speck may be she wuz; leas\u0027ways, Brer Fox, he hanker atter \u0027er, en likewise Brer Rabbit, he hanker atter \u0027er. Ole King Deer look lak he sorter lean todes Brer Fox, kaze ter a settle man like him, hit seem lak dat Brer Fox kin stir \u0027roun\u0027 en keep de pot a-b\u0027ilin\u0027, mo\u0027 speshually bein\u0027s he de bigges\u0027. Hit go on dis a-way twel hardly a day pass dat one er de yuther er dem creeturs don\u0027t go sparklin\u0027 \u0027roun\u0027 King Deer daughter, en it got so atter w\u0027ile dat all day long Brer Rabbit en Brer Fox keep de front gate a-skreakin\u0027, en King Deer daughter ain\u0027t ska\u0027cely had time fer ter eat a meal vittels in no peace er min\u0027. \"In dem days,\" pursued Uncle Remus, in a tone of unmistakable historical fervor, \"w\u0027en a creetur go a-courtin\u0027 dey wa\u0027n\u0027t none er dish yer bokay doin\u0027s mix\u0027 up \u0027longer der co\u0027tship, en dey ain\u0027t cut up no capers like folks does now. Stidder scollopin\u0027 \u0027roun\u0027 en bowin\u0027 en scrapin\u0027, dey des go right straight atter de gal. Ole Brer Rabbit, he mouter had some bubby-blossoms[17] wrop up in his hankcher, but mostly him en Brer Fox \u0027ud des drap in on King Deer daughter en \u0027gin ter cas\u0027 sheep-eyes at \u0027er time dey sot down en cross der legs.\" \"En I bet,\" said \u0027Tildy, by way of comment, and looking as though she wanted to blush, \"dat dey wa\u0027n\u0027t \u0027shame\u0027, nuther.\" \"Dey went \u0027long dis a-way,\" continued Uncle Remus, \"twel it \u0027gun ter look sorter skittish wid Brer Rabbit, kaze ole King Deer done good ez say, sezee, dat he gwine ter take Brer Fox inter de [60]fambly. Brer Rabbit, he \u0027low, he did, dat dis ain\u0027t gwine ter do, en he study en study how he gwine ter cut Brer Fox out. \"Las\u0027, one day, w\u0027iles he gwine thoo King Deer pastur\u0027 lot, he up wid a rock en kilt two er King Deer goats. Wen he git ter de house, he ax King Deer daughter whar\u0027bouts her pa, en she up\u0027n say she go call \u0027im, en w\u0027en Brer Rabbit see \u0027im, he ax w\u0027en de weddin\u0027 tuck place, en King Deer ax w\u0027ich weddin\u0027, en Brer Rabbit say de weddin\u0027 \u0027twix\u0027 Brer Fox en King Deer daughter. Wid dat, ole King Deer ax Brer Rabbit w\u0027at make he go on so, en Brer Rabbit, he up\u0027n \u0027spon\u0027 dat he see Brer Fox makin\u0027 monst\u0027us free wid de fambly, gwine \u0027roun\u0027 chunkin\u0027 de chickens en killin\u0027 up de goats. \"Ole King Deer strak he walkin\u0027-cane down \u0027pon de flo\u0027, en \u0027low dat he don\u0027t put no \u0027pennunce in no sech tale lak dat, en den Brer Rabbit tell \u0027im dat ef he\u0027ll des take a walk down in de pastur\u0027 lot, he kin see de kyarkiss er de goats. Ole King Deer, he put out, en bimeby he come back, en he \u0027low he gwine ter settle marters wid Brer Fox ef it take \u0027im a mont\u0027. \"Brer Rabbit say he a good frien\u0027 ter Brer Fox, en he ain\u0027t got no room ter talk \u0027bout \u0027im, but yit w\u0027en he see \u0027im \u0027stroyin\u0027 King Deer goats en chunkin\u0027 at his chickens, en rattlin\u0027 on de palin\u0027s fer ter make de dog bark, he bleedz ter come lay de case \u0027fo\u0027 de fambly. \"\u0027En mo\u0027n dat,\u0027 sez ole Brer Rabbit, sezee, \u0027I\u0027m de man w\u0027at kin make Brer Fox come en stan\u0027 right at de front gate en tell you dat he is kill dem goat; en ef you des wait twel ter-night, I won\u0027t ax you ter take my wud,\u0027 sezee. \"King Deer say ef Brer Rabbit man \u0027nuff ter do dat, den he kin git de gal en thanky, too. Wid dat, Brer Rabbit jump up en crack he heels tergedder, en put out fer ter fine Brer Fox. He ain\u0027t git fur \u0027fo\u0027 he see Brer Fox comin\u0027 down de road all primp up. Brer Rabbit, he sing out, he did:— \"\u0027Brer Foxy, whar you gwine?\u0027 [61]\"En Brer Fox, he holler back:— \"\u0027Go \u0027way, Rab; don\u0027t bodder wid me. I\u0027m gwine fer ter see my gal.\u0027 \"Brer Rabbit, he laugh \u0027way down in his stomach, but he don\u0027t let on, en atter some mo\u0027 chat, he up\u0027n say dat ole King Deer done tell \u0027im \u0027bout how Brer Fox gwine ter marry he daughter, en den he tell Brer Fox dat he done promise King Deer dat dey\u0027d drap \u0027roun\u0027 ter-night en gin \u0027im some music. \"\u0027En I up\u0027n tole \u0027im,\u0027 sez Brer Rabbit, sezee, \u0027dat de music w\u0027at we can\u0027t make ain\u0027t wuth makin\u0027,—me wid my quills, en you wid yo\u0027 tr\u0027angle.[18] De nex\u0027 motion we makes,\u0027 sezee, we\u0027ll hatter go off some\u0027rs en practise up on de song we\u0027ll sing, en I got one yer dat\u0027ll tickle um dat bad,\u0027 sez Brer Rabbit, sezee, \u0027twel I lay dey\u0027ll fetch out a hunk er dat big chicken-pie w\u0027at I see um puttin\u0027 in de pot des now,\u0027 sezee. \"In a \u0027casion lak dis, Brer Fox say he de ve\u0027y man w\u0027at Brer Rabbit huntin\u0027, en he \u0027low dat he\u0027ll des \u0027bout put off payin\u0027 he call ter King Deer house en go wid Brer Rabbit fer ter practise on dat song. \"Den Brer Rabbit, he git he quills en Brer Fox he git he tr\u0027angle, en dey went down on de spring branch, en dar dey sing en play, twel dey git it all by heart. Ole Brer Rabbit, he make up de song he own se\u0027f, en he fix it so dat he sing de call, lak de captain er de co\u0027n-pile, en ole Brer Fox, he hatter sing de answer.\"[19] At this point Uncle Remus paused to indulge in one of his suggestive chuckles, and then proceeded:— \"Don\u0027t talk \u0027bout no songs ter me. Gentermens! dat \u0027uz a funny song fum de wud go. Bimeby, w\u0027en dey practise long time, dey gits up en goes \u0027roun\u0027 in de neighborhoods er King Deer house, en w\u0027en night come dey tuck der stan\u0027 at de front gate, en atter all got still, Brer Rabbit, he gun de wink, en dey broke loose wid der music. Dey played a chune er two on de quills en tr\u0027angle, en den [62]dey got ter de song. Ole Brer Rabbit, he got de call, en he open up lak dis:— \"\u0027Some folks pile up mo\u0027n dey kin tote, En dot w\u0027at de marter wid King Deer goat,\u0027 en den Brer Fox, he make answer:— \"\u0027Dat\u0027s so, dat\u0027s so, en I\u0027m glad dat it\u0027s so!\u0027 Den de quills en de tr\u0027angle, dey come in, en den Brer Rabbit pursue on wid de call:— \"\u0027Some kill sheep en some kill shote, But Brer Fox kill King Deer goat,\u0027 en den Brer Fox, he jine in wid de answer:— \"\u0027I did, dat I did, en I\u0027m glad dat I did!\u0027 En des \u0027bout dat time King Deer, he walk outer de gate en hit Brer Fox a clip wid his walkin\u0027-cane, en he foller it up wid \u0027n\u0027er\u0027n, dat make Brer Fox fa\u0027rly squall, en you des better b\u0027lieve he make tracks \u0027way fum dar, en de gal she come out, en dey ax Brer Rabbit in.\" \"Did Brother Rabbit marry King Deer\u0027s daughter, Uncle Remus?\" asked the little boy. \"Now, den, honey, you\u0027re crowdin\u0027 me,\" responded the old man. \"Dey ax \u0027im in, en dey gun \u0027im a great big hunk er chicken-pie, but I won\u0027t make sho\u0027 dat he tuck\u0027n marry de gal. De p\u0027int wid me is de way Brer Rabbit run Brer Fox off fum dar.\" \n \n","sourceLink":"http://novel.tingroom.com/ertong/2808/77594.html","bookId":505,"book":{"id":505,"title":"Nights With Uncle Remus","description":"简介： It had been raining all day so that Uncle Remus found it impossible to go out. The storm had begun, the old man declared, just as the chickens were crowing for day, and it had continued almost without intermission. The dark gray clouds had blotted ou...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2808","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
