{"id":7547,"no":31,"title":"Chapter 31","content":"31:1 [hgb] 耶 和 华 晓 谕 摩 西 说 ， \\n\\n [kjv] And the LORD spake unto Moses, saying, \\n\\n [bbe] And the Lord said to Moses, \\n\\n 31:2 [hgb] 看 哪 ， 犹 大 支 派 中 ， 户 珥 的 孙 子 ， 乌 利 的 儿 子 比 撒 列 ， 我 已 经 提 他 的 名 召 他 。 \\n\\n [kjv] See, I have called by name Bezaleel the son of Uri, the son of Hur, of the tribe of Judah: \\n\\n [bbe] I have made selection of Bezalel, the son of Uri, by name, the son of Hur, of the tribe of Judah: \\n\\n 31:3 [hgb] 我 也 以 我 的 灵 充 满 了 他 ， 使 他 有 智 慧 ， 有 聪 明 ， 有 知 识 ， 能 作 各 样 的 工 ， \\n\\n [kjv] And I have filled him with the spirit of God, in wisdom, and in understanding, and in knowledge, and in all manner of workmanship, \\n\\n [bbe] And I have given him the spirit of God and made him wise and full of knowledge and expert in every sort of handwork, \\n\\n 31:4 [hgb] 能 想 出 巧 工 ， 用 金 ， 银 ， 铜 制 造 各 物 ， \\n\\n [kjv] To devise cunning works, to work in gold, and in silver, and in brass, \\n\\n [bbe] To do all sorts of delicate work in gold and silver and brass; \\n\\n 31:5 [hgb] 又 能 刻 宝 石 ， 可 以 镶 嵌 ， 能 雕 刻 木 头 ， 能 作 各 样 的 工 。 \\n\\n [kjv] And in cutting of stones, to set them, and in carving of timber, to work in all manner of workmanship. \\n\\n [bbe] In cutting stones for framing, and to do every form of woodwork. \\n\\n 31:6 [hgb] 我 分 派 但 支 派 中 ， 亚 希 撒 抹 的 儿 子 亚 何 利 亚 伯 与 他 同 工 。 凡 心 里 有 智 慧 的 ， 我 更 使 他 们 有 智 慧 ， 能 作 我 一 切 所 吩 咐 的 ， \\n\\n [kjv] And I, behold, I have given with him Aholiab, the son of Ahisamach, of the tribe of Dan: and in the hearts of all that are wise hearted I have put wisdom, that they may make all that I have commanded thee; \\n\\n [bbe] And I have made selection of Oholiab with him, the son of Ahisamach, of the tribe of Dan; and in the hearts of all who are wise I have put the knowledge to make whatever I have given you orders to have made; \\n\\n 31:7 [hgb] 就 是 会 幕 和 法 柜 ， 并 其 上 的 施 恩 座 ， 与 会 幕 中 一 切 的 器 具 ， \\n\\n [kjv] The tabernacle of the congregation, and the ark of the testimony, and the mercy seat that is thereupon, and all the furniture of the tabernacle, \\n\\n [bbe] The Tent of meeting, and the ark of the law, and the cover which is on it, and all the things for the tent, \\n\\n 31:8 [hgb] 桌 子 和 桌 子 的 器 具 ， 精 金 的 灯 台 和 灯 台 的 一 切 器 具 并 香 坛 ， \\n\\n [kjv] And the table and his furniture, and the pure candlestick with all his furniture, and the altar of incense, \\n\\n [bbe] And the table with its vessels, and the holy light-support with all its vessels, and the altar for the burning of spices, \\n\\n 31:9 [hgb] 燔 祭 坛 和 坛 的 一 切 器 具 ， 并 洗 濯 盆 与 盆 座 ， \\n\\n [kjv] And the altar of burnt offering with all his furniture, and the laver and his foot, \\n\\n [bbe] And the altar of burned offerings with all its vessels, and the washing-vessel with its base, \\n\\n 31:10 [hgb] 精 工 作 的 礼 服 ， 和 祭 司 亚 伦 并 他 儿 子 用 以 供 祭 司 职 分 的 圣 衣 ， \\n\\n [kjv] And the cloths of service, and the holy garments for Aaron the priest, and the garments of his sons, to minister in the priest\u0027s office, \\n\\n [bbe] And the robes of needlework, the holy robes for Aaron and for his sons, for their use when acting as priests, \\n\\n 31:11 [hgb] 膏 油 和 为 圣 所 用 馨 香 的 香 料 。 他 们 都 要 照 我 一 切 所 吩 咐 的 去 作 。 \\n\\n [kjv] And the anointing oil, and sweet incense for the holy place: according to all that I have commanded thee shall they do. \\n\\n [bbe] And the holy oil, and the perfume of sweet spices for the holy place; they will do whatever I have given you orders to have done. \\n\\n 31:12 [hgb] 耶 和 华 晓 谕 摩 西 说 ， \\n\\n [kjv] And the LORD spake unto Moses, saying, \\n\\n [bbe] And the Lord said to Moses, \\n\\n 31:13 [hgb] 你 要 吩 咐 以 色 列 人 说 ， 你 们 务 要 守 我 的 安 息 日 ， 因 为 这 是 你 我 之 间 世 世 代 代 的 证 据 ， 使 你 们 知 道 我 耶 和 华 是 叫 你 们 成 为 圣 的 。 \\n\\n [kjv] Speak thou also unto the children of Israel, saying, Verily my sabbaths ye shall keep: for it is a sign between me and you throughout your generations; that ye may know that I am the LORD that doth sanctify you. \\n\\n [bbe] Say to the children of Israel that they are to keep my Sabbaths; for the Sabbath day is a sign between me and you through all your generations; so that you may see that I am the Lord who makes you holy. \\n\\n 31:14 [hgb] 所 以 你 们 要 守 安 息 日 ， 以 为 圣 日 。 凡 干 犯 这 日 的 ， 必 要 把 他 治 死 ， 凡 在 这 日 作 工 的 ， 必 从 民 中 剪 除 。 \\n\\n [kjv] Ye shall keep the sabbath therefore; for it is holy unto you: every one that defileth it shall surely be put to death: for whosoever doeth any work therein, that soul shall be cut off from among his people. \\n\\n [bbe] So you are to keep the Sabbath as a holy day; and anyone not honouring it will certainly be put to death: whoever does any work on that day will be cut off from his people. \\n\\n 31:15 [hgb] 六 日 要 作 工 ， 但 第 七 日 是 安 息 圣 日 ， 是 向 耶 和 华 守 为 圣 的 。 凡 在 安 息 日 作 工 的 ， 必 要 把 他 治 死 。 \\n\\n [kjv] Six days may work be done; but in the seventh is the sabbath of rest, holy to the LORD: whosoever doeth any work in the sabbath day, he shall surely be put to death. \\n\\n [bbe] Six days may work be done, but the seventh day is a Sabbath of complete rest, holy to the Lord; whoever does any work on the Sabbath day is to be put to death. \\n\\n 31:16 [hgb] 故 此 ， 以 色 列 人 要 世 世 代 代 守 安 息 日 为 永 远 的 约 。 \\n\\n [kjv] Wherefore the children of Israel shall keep the sabbath, to observe the sabbath throughout their generations, for a perpetual covenant. \\n\\n [bbe] And the children of Israel are to keep the Sabbath holy, from generation to generation, by an eternal agreement. \\n\\n 31:17 [hgb] 这 是 我 和 以 色 列 人 永 远 的 证 据 ， 因 为 六 日 之 内 耶 和 华 造 天 地 ， 第 七 日 便 安 息 舒 畅 。 \\n\\n [kjv] It is a sign between me and the children of Israel for ever: for in six days the LORD made heaven and earth, and on the seventh day he rested, and was refreshed. \\n\\n [bbe] It is a sign between me and the children of Israel for ever; because in six days the Lord made heaven and earth, and on the seventh day he took his rest and had pleasure in it. \\n\\n 31:18 [hgb] 耶 和 华 在 西 乃 山 和 摩 西 说 完 了 话 ， 就 把 两 块 法 版 交 给 他 ， 是 神 用 指 头 写 的 石 版 。 \\n\\n [kjv] And he gave unto Moses, when he had made an end of communing with him upon mount Sinai, two tables of testimony, tables of stone, written with the finger of God. \\n\\n [bbe] And when his talk with Moses on Mount Sinai was ended, he gave him the two stones of the law, two stones on which was the writing made by the finger of God. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/zongjiao/7/425.html","bookId":246,"book":{"id":246,"title":"Exodus出埃及记（双语小说）","description":"简介： Now these are the names of the children of Israel, which came into Egypt; every man and his household came with Jacob. Reuben, Simeon, Levi, and Judah, \u0026a...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/zongjiao/7","creation":"Aug 1, 2019 12:18:26 AM","modification":"Aug 1, 2019 12:23:56 AM"}}
