{"id":72414,"no":11,"title":"Page 11","content":"I’m short of breath, tripping over the ridiculously long sari, but I don’t want to stop moving. I’m afraid that Maddie is dead and that once we stop moving we’ll realize she’s not breathing; she’s so small, her limbs like dark limp weeds hanging over Lilac’s arms.\n We’re past Madame’s gardens now. The grass is waist-high and unruly. Lilac stops and sinks to her knees. “Bring the light over,” she tells me, gasping for breath. I kneel too and hold the lantern over us.\n Maddie’s chest rises and falls. And now that I’m close enough, I can hear her little whimpers and moans.\n “Shh,” Lilac coos, and lays her daughter in the grass. “It’s okay, baby. It’s all right.” Lilac unbuttons the front of Maddie’s threadbare dress, and I wonder how it is that nobody in this place ever wears coats. I suppose the smoke and Jared’s machine have something to do with it, because now that we’re far from Madame’s smoke and the lights of the broken carnival, I’m realizing how cold I am.\n Lilac runs her fingers over her daughter’s ribs and arms, cringing when she causes a cry of pain. She is mumbling angry profane things about Madame, and I see tears brimming in her dark eyes.\n Maddie looks at me, irises the color of moonlight on snow. Almost not enough blue in them to make them stand out from the whites. I want to look away—Maddie’s stares always unnerve me—but I can’t. It’s true that malformed children frighten me; I always stayed away from them in the lab where my parents worked. There’s something faraway about their faces, as though they live in a world the rest of us can’t see. There’s even a popular theory that they can see ghosts.\n Right now, though, Maddie’s eyes are right here. She sees me, and I see her. I see that she’s in pain, that she’s frightened. “We aren’t very different,” I whisper. “Are we?”\n Maddie closes her eyes in a long blink, and then looks back to her mother. Lilac gingerly buttons her daughter’s dress back up. “I could kill that woman,” she says.\n “Has she done this before?” I ask.\n “Not like this,” Lilac says. “Never like this.”\n “It’s cold,” I say. “Let me go back and get blankets, at least.”\n Lilac shakes her head. “Jared will be here,” she says.\n It turns out that she’s right. Within minutes we see the shadowy figure lumbering toward us through the weeds. There’s gauze wrapped clumsily around his upper arm. He has brought blankets and gauze and liquid-filled bottles that look like props out of Vaughn’s basement. “I grabbed what I could in a hurry,” he tells Lilac. “How is she? Is anything broken?”\n The two of them talk in low voices, Maddie between them all lit up in the lantern light. She’s propped herself up on one trembling elbow, and Jared is prying apart her eyelids, checking her pupils.\n I stay out of the light, watching, worrying about Gabriel, whom I’ve left alone in that distant sphere of smoke and bright lights and music. I have to get to him. I have to get us both out of here, now that I can see how dangerous Madame is.\n Before I realize I’ve moved, I’m up and walking.\n Jared says, “Where are you going?”\n Lilac says, “Come back here. Are you out of your mind?”\n But their voices are too small and far away to stop me. I hoped before, stupidly, that playing by Madame’s rules would give me an opportunity to escape. Just as I played by Vaughn’s rules when I was trying to escape my marriage to Linden. But I could never have predicted the evil that chars those two souls. The bodies Vaughn collects. The maniacal delight in Madame’s eyes as she closed in on Maddie for the deathblow.\n I see it now.\n There are no rules. It’s survival of the fittest.\n I break into a run, and I hear someone crashing after me through the weeds.\n “Stop.” The whisper is hot and angry. “Stop.\n “Stop!”\n An arm latches around my waist, lifting me off the ground.\n “I can’t leave him there,” I cry. “You don’t understand!”\n I struggle to get out of Jared’s grip. His arm is thick and as heavy as iron. I raise my elbow and manage to jab him—hard—in the gunshot wound. He drops me, cursing, and I hit the ground running. But he grabs the scarf of my sari in his fist and reels me in, and I can’t break free.\n “Just listen,” he growls. “You want to help that boy? If Madame catches you right now, you won’t be of any use to him. You’ll never get away.”\n I yank the fabric from his hands and bristle, indignant, but I know he’s right.\n “Did you know?” I say. “Did you know that she was planning to sell me?”\n “I don’t pay attention to how she does business. But I do know this: If she sees you, she will not let you get away again. There’s something about you that she thinks will make her a lot of money.”\n “I don’t care what she thinks. I have to get him out of there,” I say. “Let her try and stop me.”\n There’s so much anger in me that I can feel it buzzing through my blood. I know I’m not being rational. I know that my rage won’t transform me into something stronger and greater than what I am. I know that I am in over my head, that I’ve taken Gabriel down with me. But all I can do at this point is try.\n Somewhere behind me Lilac is calling out to Jared, saying that something is wrong, that Maddie’s coughing blood. She’s in a panic, telling him to come and help her, to quit worrying about me. And she’s right. He knows it.\n “Don’t be stupid,” he tells me. But the only stupid thing would be to stand around not trying to fix anything.\n Jared goes his way, and I go mine.\n Gabriel is half-awake in the green tent, his eyes wild and blue. When he sees me, he struggles to regain awareness. “They injected me with something,” he says, slurring the words. “‘Time to die,’ they said. The horses all began to blur.”\n Madame must have been planning this. Incapacitate Gabriel so that he would have no way of saving me. Sell me off to the highest bidder.\n I’m kneeling in the entrance. The wind is howling behind me, as though Madame herself has conjured it. I am certain she is running toward us, and then it will all be over. I don’t know how, but it will be over.\n “We have to go,” I say, reaching for him.\n He struggles to his feet and says, “Hurry up. We have no time.”\n The wind is screaming.\n No. It’s not the wind.\n The girls. Madame’s girls are screaming.\n Chapter 7\n I HEARD SOMEONE running toward me. This much I remember. I turned and saw Madame, white hair all undone and wild around her. In the light of all the lanterns, bits of it were blond. She had her arm raised. A knife, I thought. She was going to pierce my heart. It was going to be the end.\n But the thing glinting in her hand was too small for that. Slim and silver. I couldn’t quite place it until she jabbed it into my shoulder.\n A syringe. The word appeared in front of my eyes, before the darkness swept over it like waves.\n Now there is something coming back to me. A pulse. The sound of breathing. Muttering.\n Something brushes against my hand, and bit by bit I can feel my body materializing. But I can’t quite open my eyes. Not yet. “It’s done,” a voice says. A voice that’s dark and baritone. Jared. “She’s dead.”\n Are they talking about me? Maybe I am dead. Maybe that syringe was full of poison, and now my spirit is trapped in my own corpse somehow. Will I feel myself burning in the incinerator?\n “Let me see the body,” Madame says. “Maybe the dress can be spared.”\n “I put her—it—in the incinerator, Madame. It was upsetting Lilac.”\n “Bah!” Madame says. “It is her own fault.” Her own vault. “Should have let me drown that useless girl when she was born.”\n No, they aren’t talking about me. I can still feel my heart beating, and it sinks when I realize what has happened. Madame and Jared are talking about Maddie. Maddie is dead. Incinerated.\n How quickly the topic changes, though. Madame is more interested in Jared’s gunshot wound, fussing that it may become infected and she cannot afford the medication.\n “Where is that stupid girl?” Madame says. “She is good with treating wounds.”\n “Give her time to grieve,” Jared says.\n “Nonsense . . .”\n Their voices fade. I feel myself slipping away.\n When I wake up again, I can curl my fingers into a fist. In the dream I was holding something important, but now I can’t remember what it was. I am only aware of the emptiness I feel gripping nothing.\n I’m able to open my eyes, and everything is yellow. Buttercups, I think. They sprouted up in my mother’s garden one year, an unexpected surprise. She’d been experimenting with seeds and compost. “Look,” she told me, crouching down. I was so small back then—small enough that I could pretend to be lost in that garden, which didn’t seem as big after my mother died. The sunlight burned my exposed shoulders. I dug my fingers into the cold earth, probing for worms. I liked dangling them, liked the way they retracted and expanded their beige-pink bodies between my fingers.\n “Buttercups,” my mother said. Buttery, rubbery little flowers were coming up in the dirt.\n My brother was sword-fighting with a stick nearby, parrying and stabbing at the air. “They’re just weeds,” he said.\n I hear the wind. The yellow undulates over and around me, and I realize with despair that I’m in one of Madame’s tents.\n I don’t quite have the strength to raise my head; the edges of my vision are smeared, but I am aware of someone breathing beside me. A hand brushing against mine. A voice whispering my name. It sounds exhausted and terrified.\n Gabriel. I try to answer him, but my lips won’t move.\n “Shut your eyes,” he whispers. “Someone’s coming.”\n I do, but I can still see all that yellow in my eyelids. Someone opens the tent, letting in a burst of cold air, but my body doesn’t shiver. I can feel the cold in a detached sort of way.\n “She can’t keep them like this.” Lilac’s voice. “Look at them. They’ll die.”\n “She wants to be rid of the boy by tonight.” Jared’s voice is even more menacing and dark now that he’s talking softly. “She has another buyer coming to look at the girl.”\n I try to concentrate on what’s being said. I know it’s important. But my brain won’t cooperate. I’m phasing in and out of darkness. \n","sourceLink":"https://allnovel.net/fever-the-chemical-garden-2/page-11.html","bookId":1762,"book":{"id":1762,"title":"Fever (The Chemical Garden #2)","description":"Storyline: \n Fever (The Chemical Garden #2) \n Rhine and Gabriel have escaped the mansion, but danger is never far behind. \n Running away brings Rhine and Gabriel right into a trap, in the form of a twisted carnival whose ringmistress keeps watch over a menagerie of girls. Just as Rhine uncovers what plans await her, her fortune turns again. With Gabriel at her side, Rhine travels through an environment as grim as the one she left a year ago - surroundings that mirror her own feelings of fear and hopelessness. \n The two are determined to get to Manhattan, to relative safety with Rhine’s twin brother, Rowan. But the road there is long and perilous - and in a world where young women only live to age twenty and young men die at twenty-five, time is precious. Worse still, they can’t seem to elude Rhine’s father-in-law, Vaughn, who is determined to bring Rhine back to the mansion...by any means necessary. \n In the sequel to Lauren DeStefano’s harrowing Wither, Rhine must decide if freedom is worth the price - now that she has more to lose than ever.\n \n","cover":"https://allnovel.net/images/fever-the-chemical-garden-2.jpg","author":"Lauren DeStefano","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/fever-the-chemical-garden-2.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:23:42 AM"}}
