{"id":106381,"no":35,"title":"Page 35","content":"I did, holding nothing back. I wanted her to have as much information as she needed.\n Jillian sighed and rose from her chair. She walked slowly around the desk, picked up a long blue pen, and began twirling it slowly with the thumb and fingers of her right hand. She sat on the corner of the desk, just inches from where I was sitting.\n “I don’t know, McKenzie. Didn’t you once tell me that I couldn’t hypnotize you? That I couldn’t hypnotize anyone who resists? That only weak-minded people could be hypnotized?”\n I stared at the pen.\n “Didn’t you tell me it had nothing to do with intellect and everything to do with emotions?” I asked her. “That the people easiest to hypnotize were those whose emotions were near the surface?”\n “That pretty much leaves you out, doesn’t it, McKenzie?”\n “Maybe.”\n “We tried this once before.”\n “I remember.”\n “Do you remember that we talked about the colors of the rainbow?”\n “Yes.”\n “I asked you to say them out loud.”\n “Yes.”\n “Blue’s a rainbow color, isn’t it, McKenzie?”\n “Yes.”\n “Like the blue of this pen.”\n “Yes.”\n “Close your eyes and tell me if you can still see the blue.”\n “I can see it.”\n “Does it make you feel relaxed?”\n “Yes.”\n “Keep looking at the blue. Do you feel like you want to sleep?”\n “Yes.”\n “To help you sleep, think of the rainbow. Name the colors to yourself one by one. Start with red. When you get to blue, you’ll be fully asleep.”\n “Yes.”\n “Have you reached blue?”\n “Yes.”\n “Do you want to remember something you’ve forgotten?”\n “Yes.”\n “Do you want to remember going to Frank Crosetti’s house?”\n “Yes.”\n “Remember what happened when you went to Frank Crosetti’s house. Remember it out loud. Start with Frank Crosetti pointing a shotgun at you.”\n “I was frightened.”\n “What happened next?”\n “I heard a car. A man is driving a car up the driveway. He is driving very fast.”\n “Do you see the car clearly?”\n “Yes.”\n “Describe the car.”\n “It’s a Ford Mustang convertible. 2002 or 2003. The top is up.”\n “What color is the car?”\n “Yellow.”\n “What is the license plate number?”\n I rattled off six digits.\n “Remember the rainbow, McKenzie?”\n “Yes.”\n “Go through the colors again. When you get to the color blue, you will wake up feeling rested and you’ll remember everything you told me.”\n “Yes.”\n “McKenzie?”\n “Yes.”\n “What is the real reason you stopped seeing me?”\n “You’re not a nice person. You were kind to me, but you were rude to everyone else, to your receptionists, to waiters, parking lot attendants, ushers, to a lot of people.”\n “Start naming the rainbow colors to yourself.”\n When I reached blue, I opened my eyes and found Jillian hovering above me. She had written the license plate number of the yellow Mustang on a sheet of her stationery.\n “Here.”\n I took the sheet.\n I said, “I’m sorry, Jill.”\n She said, “Get out of my office, McKenzie.”\n In some cities—New York and New Orleans come to mind—a sizable percentage of civil servants figure they earn their paychecks just by showing up in the morning. Actually doing work, that costs extra. And if you expect service with a smile, forgetaboutit. But in Minnesota, there is no culture of baksheesh. Most government employees here are happy to assist you. Some will actually go beyond their job descriptions to be helpful and will ask for nothing in return except a simple thank-you, and even that’s not required.\n Take the woman at Minnesota Driver and Vehicles Services in the Town Square Building in downtown St. Paul, for example. She seemed delighted to furnish me with both a Record Request form and the requisite Intended Use of Driver License and Motor Vehicle Information form. She even helped me massage the language I used to complete the section labeled “Explain How You Intend to Use Record Information”—“Owner of vehicle with above license plate number caused damage to rental car; requester would like information to present to rental car company.” When time came to pay for the service, she said, “I’m sorry,” before requesting the $4.50 fee.\n In return, she gave me the name Penelope Joan Glass, 839 47th Avenue, Hilltop, Minnesota, as well as Penelope’s vital statistics—height 5’ 8”, weight 125, eyes blue, hair blonde—and her phone number, date of birth, vehicle identification number, and driver’s license number. I could’ve requested Penelope’s driving record, too, but that cost extra.\n I felt a flush of accomplishment as I wrote down the information in my notebook. I was doing some real detecting and it felt good, like the tingle you get when you exercise seldom-used muscles. But I was left with a question.\n “Where in hell is Hilltop?”\n “I’m afraid I don’t know,” the woman said. “I have a map you can borrow …” \n","sourceLink":"https://allnovel.net/tin-city-mac-mckenzie-2/page-35.html","bookId":2224,"book":{"id":2224,"title":"Tin City (Mac McKenzie #2)","description":"Storyline: \n Mac McKenzie is rich. So rich that he\u0027s left his job as a Twin Cities police officer and spends his time doing favors large and small for friends. So when an old Marine buddy of his father\u0027s calls with a request Mac takes the time to help him out. And it is one of the stranger favors he\u0027s ever been asked: the elderly Mr. Mosley, a beekeeper, wants Mac to find out why his bees are suddenly dying in droves. \n Mac does some digging and before long turns up a hornet\u0027s nest of trouble in the person of Frank Crosetti, a new neighbor on the property abutting Mosley\u0027s bees. What started out as an innocent investigation into some unregulated pesticide quickly turns lethal. Crosetti sticks around long enough to make some very specific threats, then disappears into the wind leaving behind a vicious rape, a lifeless body, and a very angry McKenzie bursting for someone to blame. \n With only the faintest of trails to follow and a suspicious group of federal agents gunning for him, Mac dives underground, taking only a stash of cash and a small arsenal with him on his undercover mission. Before long Mac\u0027s deep in the forgotten corners of Minneapolis sniffing for any sign of Crosetti, unable to rest until he gets results. Combining engaging humor and wit with action-packed storytelling, Edgar Winner David Housewright\u0027s second Mac McKenzie novel is clever, compelling, and thoroughly enjoyable.\n \n","cover":"https://allnovel.net/images/tin-city-mac-mckenzie-2.jpg","author":"David Housewright","type":"Thriller","source":"allnovel","link":"https://allnovel.net/tin-city-mac-mckenzie-2.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 10:52:58 PM"}}
