{"id":71458,"no":2,"title":"Page 2","content":"Ian leaned against the bike racks. “Did I hear you saying you know where a piece of the Time Capsule flag is?” Ali’s cheeks pinkened. “Why, is someone jealous?” She shot him a saucy grin. Ian shook his head. “I’d keep it down, if I were you. Someone might try and steal your piece from you. It’s part of the game, you know.” Ali laughed, as if the idea was incomprehensible, but a wrinkle formed between her eyes. Ian was right—stealing someone’s piece of the flag was perfectly legal, etched in the Time Capsule Official Rule Book that Principal Appleton kept in a locked drawer of his desk. Last year, a ninth-grade goth boy had stolen a piece that was dangling out of a senior crew member’s gear bag. Two years ago, an eighth-grade band girl had snuck into the school’s dance studio and stolen two pieces from two beautiful, thin ballerinas. The Stealing Clause, as it was known, leveled the playing field even more—if you weren’t smart enough to figure out the clues that would allow you to find the pieces, then maybe you were cunning enough to snag one from someone’s locker. Spencer gazed at Ali’s perturbed expression, a thought slowly forming in her mind. I should steal Ali’s piece of the flag. More than likely, everyone else in sixth grade would simply let Ali find the piece completely unfairly, and no one would dare to take it away from her. Spencer was tired of Ali getting everything handed to her so easily. The same idea formed in Emily’s mind. Imagine if I stole it from Ali, she thought, shuddering with an unidentifiable emotion. What would she say to Ali if she trapped her alone? Could I steal it from Ali? Hanna bit an already nubby fingernail. Only…she’d never stolen anything in her life. If she did, would Ali invite Hanna into her circle? How awesome would it be to steal it from Ali? Aria thought too, her hand still moving over her sketchbook. Imagine, a Typical Rosewood dethroned…by someone like Aria. Poor Ali would have to go searching for another piece by actually reading the clues and using her brain for once. “I’m not worried,” Ali broke the silence. “No one would dare steal it from me. Once I get the piece, it’s going to be on me at all times.” She gave Ian a suggestive wink, and with a flip of her skirt, she added, “The only way someone is going to get it from me is if they kill me first.” Ian leaned forward. “Well, if that’s what it takes.” A muscle under Ali’s eye twitched, and her skin paled. Naomi Zeigler’s smile wilted. There was a chilly grimace on Ian’s face, but then he flashed an irresistible I’m just kidding smile. Someone coughed, making Ian and Ali look over. Ali’s brother, Jason, was walking straight up to Ian from the high school steps. His mouth tight and his shoulders hunched, Jason looked like he had overheard. “What did you just say?” Jason stopped less than a few feet from Ian’s face. A crisp wind blew a few stray golden hairs up off his forehead. Ian rocked back and forth in his black Vans. “Nothing. We were just fooling around.” Jason’s eyes darkened. “You sure about that?” “Jason!” Ali hissed, indignant. She stepped between them. “What’s up your butt?” Jason glared at Ali, then at the Time Capsule flyer in her hand, then back at Ian. The rest of the crowd exchanged confused glances, not sure whether this was a fake fight or something more serious. Ian and Jason were the same age, and both played varsity soccer. Maybe this was a pissing contest because Ian had stolen Jason’s opportunity for a goal in yesterday’s game against Pritchard Prep. When Ian didn’t answer, Jason smacked his arms to his sides. “Fine. Whatever.” He wheeled around, stomped to a black, late-sixties sedan that had pulled into the bus lane, and slumped in the passenger seat. “Just go,” he said to the driver as he slammed the car door. The car sputtered to life, coughed up a cloud of noxious-smelling exhaust, and squealed away from the curb. Ian shrugged and sauntered away, grinning victoriously. Ali ran her hands through her hair. For a split second, her expression seemed a little off, like something had slipped out of her control. But it quickly passed. “Hot tub at my house?” she chirped to her posse, looping her elbow around Naomi’s. Her friends followed her to the woods behind the school, a shortcut back to her house. A now-familiar piece of paper peeked out of the side pocket of Ali’s yellow satchel. Time Capsule Starts Tomorrow, it said. Get ready. Get ready, indeed. A few short weeks later, after most of the Time Capsule pieces were found and buried, the members of Ali’s inner circle changed. All of a sudden, the regulars were ousted, and others took their places. Ali had found four new BFFs—Spencer, Hanna, Emily, and Aria. None of Ali’s new friends questioned why she’d chosen them out of the entire sixth grade class—they didn’t want to jinx things. Now and then, they thought about pre-Ali moments—how miserable they’d been, how lost they’d felt, how certain that they’d never mean anything at Rosewood Day. They thought about specific moments, too, including that day Time Capsule was announced. Once or twice they recalled what Ian had said to Ali, and how uncharacteristically worried Ali had seemed. Very little fazed her, after all. For the most part, they shrugged off thoughts like that—it was more fun to think about their future than dwell on the past. They were now the girls of Rosewood Day, and with that came a lot of thrilling responsibility. They had a lot of good times to look forward to. But maybe they shouldn’t have forgotten that day so quickly. And maybe Jason should’ve tried a bit harder to keep Ali safe. Because, well, we all know what happened. Just a short year and a half later, Ian made good on his promise. He killed Ali for real. 1 DEAD AND BURIED Emily Fields leaned back on the chestnut brown leather couch, picking at the chlorine-dried skin around her thumb. Her old best friends, Aria Montgomery, Spencer Hastings, and Hanna Marin, sat next to her, sipping Godiva hot chocolate from striped ceramic mugs. They were all in Spencer’s family’s media room, which was filled with state-of-the-art electronics, a seven-foot movie screen, and surround-sound speakers. A large basket of Baked Tostitos sat on the coffee table, but none of them had touched it. A woman named Marion Graves was perched on the checkered love seat across from them, a flattened, folded-up trash bag on her lap. While the girls were in ratty jeans, cashmere sweats, or, in Aria’s case, a beat-up denim miniskirt over a pair of tomato red long johns, Marion was in an expensive-looking deep blue wool blazer and matching pleated skirt. Her dark brown hair shone, and her skin smelled of lavender moisturizer. “Okay.” Marion smiled at Emily and the others. “Last time we met, I asked you guys to bring in certain items. Let’s put them all on the coffee table.” Emily offered a pink patent leather change purse with a swirly E monogram on the pocket. Aria reached into her yak-fur tote and pulled out a creased, yellowed drawing. Hanna tossed out a folded-up piece of paper that looked like a note. And Spencer carefully laid down a black-and-white photograph along with a frayed blue rope bracelet. Emily’s eyes filled with tears—she recognized the bracelet instantly. Ali had made one for each of them the summer after The Jenna Thing happened. It was supposed to bind them together in friendship, to remind them never to tell that they’d been the ones who’d accidentally blinded Jenna Cavanaugh. Little did they know that the real Jenna Thing was a secret Ali was keeping from them, not something they all were keeping from the rest of the world. It turned out that Jenna had asked Ali to set off the firework and blame it on her stepbrother, Toby. This fact was one of the many heartbreaking things they’d discovered about Ali after she’d died. Emily swallowed hard. The leaden ball that had been lodged in the middle of her chest since September began to throb. It was the day after New Year’s. School started again tomorrow, and Emily prayed this semester would be a little less action-packed than the last. Practically the minute she and her old friends stepped through Rosewood Day’s stone archway to start eleventh grade, each had received mysterious notes from someone known simply as A. At first, they all thought—in Emily’s case, hoped—that A might be Alison, their long-lost best friend, but then workers found Ali’s body in a cemented-over hole in Ali’s old backyard. The notes continued, prying deeper and deeper into their darkest secrets, and two dizzying months later, they found out that A was Mona Vanderwaal. In middle school, Mona had been a Fear Factor–obsessed dork who spied on Emily, Ali, and the others during their regular Friday-night sleepovers, but once Ali disappeared, Mona transformed into a queen bee—and became Hanna’s best friend. This fall, Mona had stolen Alison’s diary, read all the secrets Ali had written about her friends, and set out to destroy their lives just as she believed Emily, Ali, and the others had ruined hers. Not only had they teased her, but sparks from the firework that blinded Jenna had burned Mona, too. The night Mona plunged to her death down Falling Man Quarry—almost bringing Spencer with her—the police also arrested Ian Thomas, Ali’s super-secret older boyfriend, for Ali’s murder. Ian’s trial was set to start at the end of that week. Emily and the others would have to testify against him, and while getting up on the witness stand was going to be a million times scarier than when Emily had had to sing a solo part at the Rosewood Day Holiday Concert, at least it would mean the ordeal would really, truly be over. Because all of that was way too much for four teenage girls to handle, their parents had decided to call in professional help. Enter Marion, the very best grief counselor in the Philadelphia area. This was the third Sunday Emily and her friends had met with her. This particular session was dedicated to the girls letting go of the many horrible things that had happened. Marion smoothed her skirt over her knees as she looked at the objects they’d laid on the table. “All of these things remind you of Alison, right?” Everyone nodded. Marion shook open a black garbage bag. “Let’s put everything in here. After I leave, I want you girls to bury it in Spencer’s backyard. This ritual will symbolize laying Alison to rest. And with her, you’ll be burying all the harmful negativity that surrounded your friendship with her.” Marion always peppered her speech with New Age phrases like harmful negativity and the spiritual need for closure and confronting the grieving process. Last session, they’d had to chant, Ali’s death is not my fault, again and again, and drink stinky green tea that was supposed to “cleanse” their guilt chakras. Marion urged them to chant things into the mirror, too, stuff like, A is dead and never coming back, and, No one else wants to hurt me. Emily longed for the mantras to work—what she wanted more than anything in the entire world was for her life to be normal again. “Okay, everyone up,” Marion said, holding out the trash bag. “Let’s do this.” They all stood. Emily’s bottom lip quivered as she eyed the pink change purse, a gift from Ali when they’d become friends in sixth grade. Maybe she should’ve brought something else to this purging session, like one of Ali’s old school pictures—she had a million copies of those. Marion fixed her eyes on Emily and nudged her chin toward the bag. With a sob, Emily dropped the change purse in.","sourceLink":"https://allnovel.net/wicked-pretty-little-liars-5/page-2.html","bookId":2382,"book":{"id":2382,"title":"Wicked (Pretty Little Liars #5)","description":"Storyline: Wicked (Pretty Little Liars #5) In idyllic Rosewood, Pennsylvania, four very pretty girls just can\u0027t help but be bad. . . . Hanna will do anything to be Rosewood\u0027s queen bee. Spencer\u0027s digging up her family\u0027s secrets. Emily can\u0027t stop thinking about her new boyfriend. And Aria approves a little too strongly of her mom\u0027s taste in men. Now that Ali\u0027s killer is finally behind bars, the girls think they\u0027re safe. But those who forget the past are condemned to repeat it. And they should know by now that I\u0027m always watching. . . .","cover":"https://allnovel.net/images/wicked-pretty-little-liars-5.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/wicked-pretty-little-liars-5.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:20:09 AM"}}
