{"id":16889,"no":32,"title":"Letter XV.","content":"In answer to your questions: (1) Clothes and astral form. Answer.—You are incorrect in assuming that clothes have no astral form. Everything in nature has its double on other planes, the facts being that nothing visible in matter or space could be produced without such a basis. The clothes are seen as well as the person because they exist on the astral plane as well as he. Besides this, the reason why people are seen on the astral plane with clothes of various cut and colour, is because of the thought and desire of the person, which clothes him thus. Hence a person may be seen in the astral light wearing there a suit of clothes utterly unlike what he has on, because his thought and desire were on another suit, more comfortable, more appropriate, or what not. (2) What can true and earnest Theosophists do against the Black Age or Kali Yuga? Answer.—Nothing against it but a great deal in it; for it is to be remembered that the very fact of its being the iron or foundation age gives opportunities obtained in no other. It is only a quarter as long as the longest of the other ages, and it is therefore crammed four times as full of life and activity. Hence the rapidity with which all things come to pass in it. A very slight cause produces gigantic effects. To aspire ever so little now will bring about greater and more lasting effects for good than at any other time. And similarly evil intent has greater powers for evil. These great forces are visibly increased at the close of certain cycles in the Kali Yuga. The present cycle, which closes Nov. 17th, 1897-Feb. 18th, 1898, is one of the most important of any that have been. Opportunities for producing permanent effects for good in themselves and in the world as a whole, are given to Theosophists at the present time, which they may never have again if these are scattered.","sourceLink":"http://novel.tingroom.com/jingdian/1908/54932.html","bookId":918,"book":{"id":918,"title":"Letter That Have Helped Me","description":"简介： In the Path for May, 1887, we find these words: We need a literature, not solely for highly intellectual persons, but of a more simple character, which attempts to appeal to ordinary common-sense minds who are really fainting for such moral and menta...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1908","creation":"Aug 1, 2019 12:23:52 AM","modification":"Aug 1, 2019 12:23:52 AM"}}
