{"id":16863,"no":6,"title":"Letter V.","content":"Dear Jasper: I wish I could answer your letter as you ought to have it done. But I feel my inability. However, our duty is to never consider our ability, but to do what comes to be done in whatever way we can, no matter how inadequate the work appears to others. When we stop to consider our weakness, we think, by comparison, of how another would do it. Our only right is in the act itself. The consequences are in the great Brahm. So I will just say what comes. I feel the sadness in your letter, but know that you will rebound from that. Do not let the sadness of knowledge create despair; that sadness is less than the joy of Truth. Abstract Truth, even, has necessarily in it all the mercy there is in the whole. Its sternness is only a reflection from our own imperfections, which make20 us recognize the stern aspect alone. We are not the only ones to suffer upon the Path. Like ourselves, Masters have wept, though They do not now weep. One of them wrote some years ago: \"Do you suppose we have not passed through many times worse trials than you now think you are in?\" The Master often seems to reject and to hide his (spiritual) face, in order that the disciple may try. On the doors and walls of the temple the word \"Try\" is written. (\"The Brothers\" is a better designation than Mahatmas or Masters.) Along the path of the true student is sadness, but also there is great joy and hope. Sadness comes from a more just appreciation of the difficulties in one\u0027s way, and of the great wickedness of the individual and collective heart of man. But look at the great fountain of hope and of joy in the consideration that the Brothers exist, that They were men too; They had to fight the fight; They triumphed, and They work for those left after Them. Then beyond Them are \"the Fathers,\" that is, the spirits of \"just men made perfect,\" those Who lived and worked for humanity ages ago and Who are now out of our sphere, but Who nevertheless still influence us in that Their spiritual forces flow down upon this earth for all pure souls. Their immediate influence is felt by Masters, and by us through the latter. Now, as you say, it is all Faith; but what is Faith? It is the intuitional feeling—\"that is true.\" So formulate to yourself certain things as true that you feel to be true, and then increase your faith in them. Don\u0027t be anxious. Don\u0027t get \"maddened.\" Because in the fact that you are \"maddened\" (of course in the metaphorical sense) is found the proof that you are anxious. In a worldly sense it is perhaps well to be anxious about a highly important matter, but in occultism it is different, for the Law takes no account of our projects and objects, or our desire to be ahead or behind. So, if we are anxious, we raise a barrier against21 progress, by perturbation and straining harshly. You wrote to B. that what is his, is his. Then the converse is true; what is not, is not. Why don\u0027t you take your own medicine?","sourceLink":"http://novel.tingroom.com/jingdian/1908/54906.html","bookId":918,"book":{"id":918,"title":"Letter That Have Helped Me","description":"简介： In the Path for May, 1887, we find these words: We need a literature, not solely for highly intellectual persons, but of a more simple character, which attempts to appeal to ordinary common-sense minds who are really fainting for such moral and menta...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1908","creation":"Aug 1, 2019 12:23:52 AM","modification":"Aug 1, 2019 12:23:52 AM"}}
