{"id":7791,"no":30,"title":"CHAPTER XXIX. THE ESCAPE FROM THE CAVE.","content":"Dr. Mackey turned away to consult with the guerrillas, and Jack and his companions were left to themselves for the best part of half an hour. \\n\\n \\n\\n The surgeon was evidently much disturbed over something, and Jack caught the words, \"must leave the country,\" and \"I will send the money,\" spoken to the guerrilla captain. \\n\\n \\n\\n \"Can it be possible that he intends to leave the States?\" mused our hero. \"Well, we can easily get along without him. But I would like to know more of that fortune.\" \\n\\n \\n\\n At length Dr. Mackey came to him and sat down by his side. \\n\\n \\n\\n \"So you thought to escape me, did you?\" he began. \\n\\n \\n\\n \"Do you blame me?\" questioned our hero, as coolly as he could. \\n\\n \\n\\n \"Not exactly. But I want to warn you that it won\u0027t pay to try to escape again. I have given the soldiers orders to shoot you down, if you attempt it.\" \\n\\n \\n\\n \"In that case they must be outlaws, not soldiers, Dr. Mackey.\" \\n\\n \\n\\n \"They know how to obey orders.\" \\n\\n \\n\\n \"Again I demand to know what you are going to do with me.\" \\n\\n \\n\\n \"If you wish to know so much, I will tell you. I am going to take you out of the country.\" \\n\\n \\n\\n \"To where?\" \\n\\n \\n\\n \"That you will learn after we are on shipboard.\" \\n\\n \\n\\n \"Then you intend to take me away from America?\" \\n\\n \\n\\n \"Yes.\" \\n\\n \\n\\n \"Are you going to take me to Europe?\" \\n\\n \\n\\n \"As I said before, you\u0027ll learn your destination when you are on shipboard.\" \\n\\n \\n\\n \"Supposing I won\u0027t go with you?\" \\n\\n \\n\\n \"If you won\u0027t go peaceably, I\u0027ll have to use force, that\u0027s all.\" \\n\\n \\n\\n \"You mean you\u0027ll drug me, or something like that?\" \\n\\n \\n\\n \"Never mind the details. You\u0027ll go with me, and that ends it. Moreover, you\u0027ll do just as I want you to.\" \\n\\n \\n\\n \"When do you intend to take me away?\" \\n\\n \\n\\n \"That will depend upon circumstances. Probably to-morrow night, or the next day.\" \\n\\n \\n\\n \"What of my companions?\" \\n\\n \\n\\n \"Old Ben shall go with us.\" \\n\\n \\n\\n \"And Columbus?\" \\n\\n \\n\\n \"Is that the nigger\u0027s name?\" \\n\\n \\n\\n \"Yes. Columbus Washington.\" \\n\\n \\n\\n \"The guerrillas will take care of him.\" \\n\\n \\n\\n \"Do you mean to say they will shoot him?\" \\n\\n \\n\\n \"What if they do? Niggers don\u0027t count in this world.\" \\n\\n \\n\\n \"I think you are a monster, Dr. Mackey!\" exclaimed our hero, in horror. \"To kill a negro is as much murder as to kill anyone else.\" \\n\\n \\n\\n \"I won\u0027t discuss the subject. The question is, will you go along peacefully with me?\" \\n\\n \\n\\n \"I will not. You have no right to abduct me in this fashion.\" \\n\\n \\n\\n \"I have a right to do as I please with my own son.\" \\n\\n \\n\\n \"Again I say I am not your son. Do you know what I think? I think you are nothing but a swindler—a rascal who wishes to use me as a tool, in order to get hold of some fortune coming to me or to somebody else.\" \\n\\n \\n\\n Dr. Mackey glared at Jack for a moment, then leaped forward and struck our hero a cruel blow in the face. \\n\\n \\n\\n \"That for your impudence!\" he cried wrathfully. \"After this, keep a civil tongue in your head.\" \\n\\n \\n\\n The blow made Jack\u0027s blood boil, but he was helpless to resent it. \"You are a coward, to hit me when I am tied like this,\" he said. \"But some day, Dr. Mackey, I may be able to square accounts, and then you had better beware.\" \\n\\n \\n\\n One of the guerrillas now came forward to consult with the surgeon, and Jack was left with the other prisoners, to meditate over what had been said and done. \\n\\n \\n\\n \"He\u0027s de wust rascal wot I eber seen,\" whispered Old Ben sympathetically. \"Wot a pity he wasn\u0027t shot down in de fust battle wot he eber got into!\" \\n\\n \\n\\n \"He wants to take us both out of the country, Ben.\" \\n\\n \\n\\n \"Wot, away from ole South Carolina?\" \\n\\n \\n\\n \"Yes—on a trip on the ocean.\" \\n\\n \\n\\n \"I don\u0027t want to go, Massah Jack.\" \\n\\n \\n\\n \"No more do I; but how can we help ourselves?\" \\n\\n \\n\\n \"I wish dis niggah could git free, Massah Jack.\" \\n\\n \\n\\n \"We must try our best to escape to-night. If we don\u0027t do it to-night, I reckon our last chance will be gone.\" \\n\\n \\n\\n \"Ise willin\u0027 ter do all I kin,\" answered Old Ben, and the other negro said the same. \\n\\n \\n\\n With the setting of the sun over the mountains a strong breeze sprang up, and presently the sky was obscured by heavy clouds. Dr. Mackey had gone off half an hour before. \\n\\n \\n\\n \"We\u0027re in fer a heavy storm,\" Jack heard one of the guerrillas say. \"It\u0027s a good thing we can crawl into the cave when it comes.\" \\n\\n \\n\\n \"If they come in here our chances of escape will be slim,\" thought our hero. \\n\\n \\n\\n The approaching storm made it very dark in the cave, and during this time he worked with energy at his bonds. \\n\\n \\n\\n At last he was free, and without making any noise he rolled over and released Old Ben and Columbus Washington. \\n\\n \\n\\n Suddenly there was a shout from outside. \\n\\n \\n\\n A guerrilla on guard had discovered a man on the trail, with two horses loaded with store goods. \\n\\n \\n\\n \"Here\u0027s a chance fer a haul!\" was the cry. \\n\\n \\n\\n The guerrillas ran outside, and soon the majority of them were making after the traveler. \\n\\n \\n\\n Only two were left on guard, and one of these was more than half overcome by the liquor he had imbibed. \\n\\n \\n\\n \"Now is our chance!\" whispered Jack, as he tiptoed his way to the cave entrance. \"Ben, you and I will pounce upon that man with the gun. Columbus, you silence the fellow sitting on the rock. We must not let them cry for aid.\" \\n\\n \\n\\n The negroes understood the plan, and in a moment more the party of three were upon the guerrillas. While Jack seized the gun of the one, Old Ben caught him from behind and placed a large hand over his mouth. \\n\\n \\n\\n \"Silence, on your life!\" said Jack, and leveled the gun at the rascal\u0027s head. The man understood and, when allowed to breathe, said not a word. \\n\\n \\n\\n To capture the half tipsy sentinel was likewise easy, and after both were disarmed they were ordered to enter the cave. \\n\\n \\n\\n \"If you make the least outcry we\u0027ll come back and shoot you,\" said Jack. \\n\\n \\n\\n Then he motioned to the two negroes, and all three set off on a run down the mountain side. They heard a rifle shot to the right, and consequently moved to the left. \\n\\n \\n\\n The storm now burst over the mountains in all of its fury, with vivid flashes of lightning and sharp cracks of thunder. As they proceeded they heard the distant falling of one tree or another, as the giants of the forest were laid low by the elements. \\n\\n \\n\\n \"I dun rackon da won\u0027t follow us in dis yeah storm,\" remarked Old Ben, as they stopped after a while, to catch their breath. \"Da will be fo\u0027 gittin\u0027 back to de cabe an\u0027 stayin\u0027 dar.\" \\n\\n \\n\\n \"I hope that traveler escaped them,\" answered Jack. \"But those gun-shots sounded dubious.\" \\n\\n \\n\\n \"De gorillas ought all to be hung!\" came from Columbus Washington. \"Da aint no sodgers, no matter if da do w\u0027ar a uniform.\" \\n\\n \\n\\n \"They are outlaws, pure and simple,\" answered Jack. \"But come, we must go on. Ben, how far are we from home, do you calculate?\" \\n\\n \\n\\n \"Six or seben miles, Massah Jack.\" \\n\\n \\n\\n \"Then we have a good, stiff walk before us.\" \\n\\n \\n\\n \"Do yo\u0027 t\u0027ink yo\u0027 can walk dat far, Massah Jack, in dis awful storm?\" \\n\\n \\n\\n \"I can, unless the rain sets in harder. I am anxious to get back, you know.\" \\n\\n \\n\\n \"I don\u0027t blame yo\u0027 fo\u0027 dat, Massah Jack. De folks will be mighty glad to see yo\u0027, too,\" answered Old Ben. \\n\\n \\n\\n On they went through the darkness, Old Ben following the trail with the keenness of a sleuth-hound. But it was far from a pleasant journey, as Jack soon discovered, as he stumbled along over dirt and rocks and through the dripping bushes. He was soaked to the skin, and the rawness of the air caused him to shiver. \\n\\n \\n\\n The downpour was now extra heavy, and they had to come to a halt under some trees, in order to get their breath again. The wind was blowing strongly and it was directly in their faces. \\n\\n \\n\\n \"How many miles have we made, Ben?\" asked Jack. \\n\\n \\n\\n \"Not more dan t\u0027ree, Massah Jack?\" \\n\\n \\n\\n \"Then we have nearly four still to cover.\" \\n\\n \\n\\n \"Yes, Massah Jack, an\u0027 wery hard roads, too, ober Hallack\u0027s hill.\" \\n\\n \\n\\n \"If there was a cabin handy, I would go in for a rest of an hour or two. The storm may let up.\" \\n\\n \\n\\n \"Da is a cabin down de trail, on de bend.\" \\n\\n \\n\\n \"Then let us stop there.\" \\n\\n \\n\\n So it was arranged, and soon they gained the cabin, which was deserted, the owner having joined the soldiers a year before, and his wife and children being with some relatives in the town. \\n\\n \\n\\n It was easy to get into the cabin, and once inside they started to make themselves as comfortable as possible. \\n\\n \\n\\n But they had not been in the place over half an hour when voices outside filled them with fresh alarm. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/3023/83647.html","bookId":258,"book":{"id":258,"title":"Young Captain Jack","description":"简介： In its original shape Mr. Alger intended this tale of a soldier\u0027s son for a juvenile drama, and it is, therefore, full of dramatic situations. But it was not used as a play, and when the gifted author of so many boys\u0027 books had laid aside his pen for...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3023","creation":"Aug 1, 2019 12:18:28 AM","modification":"Aug 1, 2019 12:18:28 AM"}}
