{"id":7766,"no":5,"title":"CHAPTER IV. ON BOARD THE WRECK.","content":"\"Jack, what shall we do now?\" asked Marion, as with a blanched face she gazed into the empty boat. \"Wait—the oars may be close at hand,\" he replied. \"I will make a search.\" \"And so will I. Oh, we must find them!\" They ran up and down the rocky shore, looking far and near for the oars, but without success. Presently they came to a halt, out of breath with running. \"Gone, sure enough!\" groaned the boy. \"What a pickle we are in now!\" \"We can\u0027t stay here, Jack.\" \"We\u0027ll have to stay here, Marion, unless I can find the oars or make substitutes.\" \"How are you going to make substitutes?\" \"I might take some planks from the wreck.\" \"But you have no tools.\" \"I have a stout jack-knife.\" \"It will take a long time, and see, it is already beginning to rain.\" Marion was right, the rain had started, and as it grew heavier they withdrew to the shelter of the wreck. \"I wouldn\u0027t mind staying here until the shower was over, only I wouldn\u0027t want mother to worry about us,\" went on Marion, when they were safe under cover. \"That\u0027s just it. But we do not know if she is home yet.\" The rain soon increased, while the thunder rolled in the distance. But they felt fairly safe in the cabin of the wreck, and sat down on a bench running along one of the walls. \"This looks as if it was going to keep up all night,\" observed Jack, an hour later, after another look at the sky from the top of the companion way. \"Oh, you don\u0027t mean we\u0027ll have to remain here all night!\" exclaimed Marion. \"Perhaps, Marion.\" \"But I do not wish to remain in such a place all night.\" \"Are you afraid of ghosts?\" and Jack gave a short laugh. \"No, Jack; but you\u0027ll admit it isn\u0027t a very nice place.\" \"I know that. But that isn\u0027t the worst of it.\" \"Not the worst of it?\" \"No. You must remember that we have nothing to eat or to drink here.\" \"That is true, but I do not feel much like eating or drinking just now.\" \"Yes, but you\u0027ll be hungry and thirsty before morning, Marion.\" \"Perhaps. We can drink rain water, if we wish.\" Another hour passed and the storm grew more violent. The lightning flashed across the sky and lit up the wreck from end to end. Then a blackness as of night followed. \"We could not row ashore now, even if we had oars,\" observed Marion, as she listened to the howling of the wind. \"You are right, Marion. My, how it does blow!\" Suddenly, the sounds of footsteps on the deck of the wreck reached their ears. \"Somebody is coming!\" said Jack, and looked up the companion way. \"Why, it\u0027s Old Ben!\" He was right; it was Ben the fisherman who had put in an appearance, market basket in hand. \"Marion! Jack! Am dat yo\u0027?\" came in an anxious voice. \"Yes, Ben!\" cried both. \"What brought you?\" continued the boy. \"I dun thought yo\u0027 was a-wantin\u0027 ob Ole Ben,\" grinned the colored man. \"I seed yo\u0027 rowin\u0027 off an\u0027 I didn\u0027t see yo\u0027 cum back, so I says to myself, \u0027Da is stuck fast on de wreck.\u0027 An\u0027 den I says, \u0027Da aint got nuffin to eat.\u0027 So ober I comes, an\u0027 wid a basketful of good t\u0027ings from de plantation.\" And he held up the market basket. He was soaked from the rain, and the water ran from his clothing in a stream. \"Ben, you are a jewel!\" burst out Marion and patted his wet coat-sleeve affectionately. At this the old negro grinned broadly. He had always been a privileged character on the Ruthven plantation, and being set free had not ended his affection for his former mistress and her children. \"It was very kind to come over,\" said Jack. \"Does mother know we are here?\" \"I dun left word dat I was comin\u0027 ober an\u0027 dat I thought yo\u0027 was yeah, sah,\" answered Ben. He had brought all the good things necessary, along with plates, cups, knives and forks, and soon had the spread ready for them. Then he went off to another part of the wreck to wring out his wet garments. \"It was very nice of Old Ben to come to us,\" said Marion, while eating. \"It must have been no easy matter to row from the shore to the rocks.\" \"Ben is as good a boatman as there is in these parts, Marion. It was kind, and he ought to be rewarded for it.\" \"Mamma will reward him, beyond a doubt.\" The storm kept increasing in violence, and before the strange meal was disposed of the thunder and lightning were almost incessant. Ben had brought a candle along—knowing the darkness inside of the wreck—and this was all the light they possessed, outside of what Nature afforded. Ben was just putting the dishes back into the basket when there came an extra heavy flash of lightning, followed immediately by a rending clap of thunder which almost paralyzed Marion and Jack. There was a strange smell in the air, and both found their blood tingling in a manner that was new to them. \"The wreck—it\u0027s been struck by lightning!\" gasped Jack, when he could speak. \"Dat\u0027s a fac\u0027!\" came from Old Ben. \"It was jess like de crack ob doom, wasn\u0027t it?\" He ran on deck, and Jack followed him, with Marion on the bottom of the companion way, not knowing whether to go up or remain below. The bolt had struck the wreck near the stern, ripping off a large part of the woodwork, and had passed along to one side. Just below the deck line a lively fire was starting up. \"De wrack am gwine to be burnt up at las\u0027!\" ejaculated Old Ben. \"We has got to git out, Massah Jack!\" \"Come, Marion!\" called back the boy. \"It\u0027s too bad we\u0027ve got to go out in the rain, but I reckon we can be thankful that our lives have been spared.\" \"Yes, we can be thankful,\" answered the girl. \"Oh, what a dreadful crack that was! I do not believe I shall ever forget it.\" She came on deck all in a tremble, and with the others hurried to the bow of the wreck. It was much easier to climb down than to climb up, and soon all three stood upon the rocks below, where the driving rain pelted them mercilessly. \"I t\u0027ink I can find yo\u0027 a bettah place dan dis to stay,\" said Old Ben. \"Come down to de shoah,\" and he led the way to where he had left his boat. With Jack\u0027s assistance the craft was hauled out of the water and turned upside down between two large rocks, and then the three crawled under the temporary shelter. Thus the night passed, and by morning the storm cleared away. Looking toward the wreck they saw that only a small portion of the upper deck had been burned away, the rain having put the fire out before it gained great headway. It did not take Old Ben and Jack long to launch the former\u0027s craft again, and this done, they all entered and the fisherman started to row them to the mainland. Jack\u0027s boat was taken in tow. \"That was certainly quite an adventure,\" observed Jack, as they landed. \"Marion, I reckon you don\u0027t want another such.\" \"No, indeed!\" replied the girl, with a shiver. \"I don\u0027t believe I\u0027ll ever go over to the old wreck again.\" \"It\u0027s a wondah dat wreck aint busted up long ago,\" put in Old Ben. \"It\u0027s a wonder the poor people around here haven\u0027t carried off the wreckage for firewood, Ben,\" said Jack. \"Da is afraid to do dat, Massah Jack—afraid some ob de sailors wot was drowned might haunt \u0027em.\" \"I see. Well, I don\u0027t think the wreck will last much longer,\" and with these words Jack turned away to follow Marion to the plantation mansion, to interview his foster mother concerning the particulars of the past. Little did the lad dream of what an important part that old wreck was to play in his future life.","sourceLink":"http://novel.tingroom.com/ertong/3023/83622.html","bookId":258,"book":{"id":258,"title":"Young Captain Jack","description":"简介： In its original shape Mr. Alger intended this tale of a soldier\u0027s son for a juvenile drama, and it is, therefore, full of dramatic situations. But it was not used as a play, and when the gifted author of so many boys\u0027 books had laid aside his pen for...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3023","creation":"Aug 1, 2019 12:18:28 AM","modification":"Aug 1, 2019 12:18:28 AM"}}
