{"id":7769,"no":8,"title":"CHAPTER VII. A SETBACK FOR ST. JOHN.","content":"\"Now see what you have done!\" roared St. John, as soon as he could scramble from the bushes. His face was scratched in several places and his coat was torn at one elbow. \"It was your fault as much as mine,\" retorted Jack. \"No such thing. You had no right to pitch into me.\" \"And you had no right to call me names.\" \"My horse has run away,\" stormed the young man. \"So I see.\" \"If he is lost or hurt you\u0027ll be responsible.\" \"He is running toward home. I reckon he\u0027ll be all right.\" \"What am I to do?\" \"That\u0027s your lookout.\" \"Get down and let me ride your pony home.\" \"I will do no such thing!\" cried Jack. The little steed was very dear to him. \"Do you expect me to walk?\" \"You can suit yourself about that, St. John. Certainly I shan\u0027t carry you,\" and Jack began to move off. \"Stop! don\u0027t leave me like this.\" \"You are not much hurt. Do you want to continue the fight?\" \"I don\u0027t calculate to fight a mere boy like you. Some day I\u0027ll give you a good dressing down for your impudence.\" \"All right; when that time comes, I\u0027ll be ready for you,\" returned Jack coolly, and without further words he rode away. Standing in the middle of the road, St. John Ruthven shook his fist after the youth. \"I hate you!\" he muttered fiercely. \"And I\u0027ll not allow you to come between me and my aunt\u0027s property, remember that!\" But the words did not reach Jack, nor were they intended for his ears. There was a spring of water not far away, and going to this St. John washed his face and his hands. Then he combed his hair with a pocket-comb he carried, and brushed his clothing as best he could. He was more hurt mentally than physically, and inwardly boiled to get even with our hero. Left to himself, he hardly knew what to do. He was satisfied that his horse would go home as Jack had said, but he was in no humor to follow the animal. \"I\u0027ve a good mind to call on Aunt Alice and tell her what a viper he is,\" he said to himself. \"Perhaps I can get her to think less of him than she does—and that will be something gained.\" He walked slowly toward the plantation. When he came within sight of the garden he saw Marion in a summerhouse, arranging a bouquet of flowers which she had just cut. The sight of his cousin put his heart in a flutter and made him think of the talk he had had with his mother. Why should he not propose to her at once? The sooner the better, to his way of thinking. That Marion might refuse him hardly entered his head. Was he not the best \"catch\" in that neighborhood? \"How do you do, Marion?\" he said, as he strode up to the summerhouse. \"Why, St. John, is that you?\" returned the girl. \"I did not see you riding up.\" \"I came on foot,\" he went on, as he came in and threw himself on a bench. \"It\u0027s warm, too.\" \"It is warm. Shall I send for some refreshments?\" \"No, don\u0027t bother just now, Marion. I came over to see you alone.\" \"Alone?\" she said in some surprise. \"Yes, alone, Marion. I have something very important to say to you.\" She did not answer, but turned away to fix the bouquet. \"Can you guess what I wish to say?\" he went on awkwardly. \"I haven\u0027t the remotest idea, Cousin St. John.\" \"I want to tell you how much I love you, Cousin Marion.\" \"Oh!\" \"Don\u0027t think that I speak from sudden impulse. I have loved you for years, but I wished to wait until you were old enough to listen to me.\" \"And you think I am old enough now?\" she said, with a faint smile. \"Mamma thinks me quite a girl still.\" \"You are old enough to marry, if you wish, Marion.\" \"Marry?\" She laughed outright. \"Oh, St. John, don\u0027t say that. Why, I don\u0027t intend to marry in a long, long time—if at all.\" His face fell, and he bit his lip. Certainly this was not the answer he had expected. \"But I want you!\" he burst out, still more awkwardly. \"I want to—to protect you from—er—from Jack.\" \"Protect me from Jack?\" \"Yes, Marion. You know what he is, a mere nobody.\" \"Jack is my brother.\" \"He is not, and you know it.\" \"He is the same as if he were my brother, St. John.\" \"Again I say he is not. He is a mere upstart, and he will prove a snake in the grass unless you watch him. Your mother made a big mistake when she adopted him.\" \"There may be two opinions upon that point.\" \"He knows your mother is rich. Mark my word, he will do all he can, sooner or later, to get her property away from her.\" \"I will not believe evil of Jack.\" \"You evidently think more of him than you do of me!\" sneered the spendthrift, seeing that he was making no headway in his suit. \"I do not deny that I think the world and all of Jack. He is my brother in heart, if not in blood—and I will thank you to remember that after this,\" went on Marion in a decided tone. \"You will learn of your mistake some time—perhaps when it is too late.\" \"Jack is true to the core, and as brave as he is true. Why, he would go to the war if mamma would give her consent.\" At this St. John Ruthven winced. \"Well—er—I would go myself if my mother did not need me at home,\" he stammered. \"She must have somebody to look after the plantation. We can\u0027t trust the niggers.\" \"Many men have gone to the front and allowed their plantations to take care of themselves. They place the honor of their glorious country over everything else.\" \"Well, my mother will not allow me to go—she has positively forbidden it,\" insisted St. John, anxious to clear his character. This statement was untrue; he had never spoken to his mother on the subject, thinking she might urge him to go to the front. His plea that he must look after the plantation was entirely of his own making. \"Supposing we should lose in this struggle—what will become of your plantation then?\" At this St. John grew pale. \"I—I hardly think we will lose,\" he stammered. \"We have plenty of soldiers.\" \"But not as many as the North has. General Lee could use fifty thousand more men, if he could get them.\" \"Well, I shall go to the front when I am actually needed, Marion; you can take my word on that. But won\u0027t you listen to what I have told you about my feeling for you?\" \"No, St. John; I am too young to fall in love with anybody. I shall at least wait until this cruel war is over.\" \"But I can hope?\" She shook her head. Then she picked up her bouquet. \"Will you come up to the house with me?\" \"Not now, Marion. Give my respects to my aunt and tell her I will call in a day or two again. And, by the way, Marion, don\u0027t let her think hard of me because of Jack. I desire only to see to it that the boy does not do you mischief.\" \"As I said before, I will listen to nothing against dear Jack, so there!\" cried Marion, and stamping her foot, she hurried toward the house. St. John Ruthven watched her out of sight, then turned and stalked off toward the roadway leading to his home. \"She evidently does not love me as I thought,\" he muttered to himself. \"And I made a mess of it by speaking ill of Jack. Confound the luck! What had I best do now? I wish I could get that boy out of the way altogether, I really do.\"","sourceLink":"http://novel.tingroom.com/ertong/3023/83625.html","bookId":258,"book":{"id":258,"title":"Young Captain Jack","description":"简介： In its original shape Mr. Alger intended this tale of a soldier\u0027s son for a juvenile drama, and it is, therefore, full of dramatic situations. But it was not used as a play, and when the gifted author of so many boys\u0027 books had laid aside his pen for...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3023","creation":"Aug 1, 2019 12:18:28 AM","modification":"Aug 1, 2019 12:18:28 AM"}}
