{"id":111689,"no":23,"title":"Page 23","content":"Was this why Dumbledore would no longer meet Harry\u0027s eyes? Did he expect to see Voldemort staring out of them, afraid, perhaps, that their vivid green might turn suddenly to scarlet, with catlike slits for pupils? Harry remembered how the snakelike face of Voldemort had once forced itself out of the back of Professor Quirrell\u0027s head and ran his hand over the back of his own, wondering what it would feel like if Voldemort burst out of his skull.\n He felt dirty, contaminated, as though he were carrying some deadly germ, unworthy to sit on the Underground train back from the hospital with innocent, clean people whose minds and bodies were free of the taint of Voldemort ... he had not merely seen the snake, he had been the snake, he knew it now ...\n A truly terrible thought then occurred to him, a memory bobbing to the surface of his mind, one that made his insides writhe and squirm like serpents.\n What\u0027s he after, apart from followers?\n Stuff he can only get by stealth ... like a weapon. Something he didn\u0027t have last time.\n I\u0027m the weapon, Harry thought, and it was as though poison were pumping through his veins, chilling him, bringing him out in a sweat as he swayed with the train through the dark tunnel. I\u0027m the one Voldemort\u0027s trying to use, that\u0027s why they\u0027ve got guards around me everywhere I go, it\u0027s not for my protection, it\u0027s for other people\u0027s, only it\u0027s not working, they can\u0027t have someone on me all the time at Hogwarts ... I did attack Mr. Weasley last night, it was me. Voldemort made me do it and he could be inside me, listening to my thought\u0027s right now--\u0027\n \u0027Are you all right, Harry, dear?\u0027 whispered Mrs. Weasley, leaning across Ginny to speak to him as the train rattled along through its dark tunnel. \u0027You don\u0027t look very well. Are you feeling sick?\u0027\n They were all watching him. He shook his head violently and stared up at an advertisement for home insurance.\n \u0027Harry, dear, are you sure you\u0027re all right?\u0027 said Mrs. Weasley in a worried voice, as they walked around the unkempt patch of grass in the middle of Grimmauld Place. \u0027You look ever so pale ... are you sure you slept this morning? You go upstairs to bed right now and you can have a couple of hours of sleep before dinner, all right?\u0027\n He nodded; here was a ready-made excuse not to talk to any of the others, which was precisely what he wanted, so when she opened the front door he hurried straight past the trolls-leg umbrella stand, up the stairs and into his and Ron\u0027s bedroom.\n Here, he began to pace up and down, past the two beds and Phineas Nigellus\u0027s empty picture frame, his brain teeming and seething with questions and ever more dreadful ideas.\n How had he become a snake? Perhaps he was an Animagus ... no, he couldn\u0027t be, he would know ... perhaps Voldemort was an Animagus ... yes, thought Harry, that would fit, he would turn into a snake of course ... and when he\u0027s possessing me, then we both transform ... that still doesn\u0027t explain how I got to London and back to my bed in the space of about five minutes ... but then Voldemort\u0027s about the most powerful wizard in the world, apart from Dumbledore, it\u0027s probably no problem at all to him to transport people like that.\n And then, with a terrible stab of panic, he thought, but this is insane--if Voldemort\u0027s possessing me, I\u0027m giving him a clear view into the Headquarters of the Order of the Phoenix right now! He\u0027ll know who\u0027s in the Order and where Sirius is ... and I\u0027ve heard loads of stuff I shouldn\u0027t have, everything Sirius told me the first night I was here ...\n There was only one thing for it: he would have to leave Grimmauld Place straightaway. He would spend Christmas at Hogwarts without the others, which would keep them safe over the holidays at least ... but no, that wouldn\u0027t do, there were still plenty of people at Hogwarts to maim and injure. What if it was Seamus, Dean or Neville next time? He stopped his pacing and stood staring at Phineas Nigellus\u0027s empty frame. A leaden sensation was settling in the pit of his stomach. He had no alternative: he was going to have to return to Privet Drive, cut himself off from other wizards entirely.\n Well, if he had to do it, he thought, there was no point hanging around. Trying with all his might not to think how the Dursleys were going to react when they found him on their doorstep six months earlier than they had expected, he strode over to his trunk, slammed the lid shut and locked it, then glanced around automatically for Hedwig before remembering that she was still at Hogwarts--well, her cage would be one less thing to carry--he seized one end of his trunk and had dragged it halfway towards the door when a snide voice said, \u0027Running away, are we?\u0027\n He looked around. Phineas Nigellus had appeared on the canvas of his portrait and was leaning against the frame, watching Harry with an amused expression on his face.\n \u0027Not running away, no,\u0027 said Harry shortly, dragging his trunk a few more feet across the room.\n \u0027I thought,\u0027 said Phineas Nigellus, stroking his pointed beard, \u0027that to belong in Gryffindor house you were supposed to be brave? It looks to me as though you would have been better off in my own house. We Slytherins are brave, yes, but not stupid. For instance, given the choice, we will always choose to save our own necks.\u0027\n \u0027It\u0027s not my own neck I\u0027m saving,\u0027 said Harry tersely, tugging the trunk over a patch of particularly uneven, moth-eaten carpet right in front of the door.\n \u0027Oh, I see,\u0027 said Phineas Nigellus, still stroking his beard, \u0027this is no cowardly flight--you are being noble.\u0027\n Harry ignored him. His hand was on the doorknob when Phineas Nigellus said lazily, \u0027I have a message for you from Albus Dumbledore.\u0027\n Harry span round.\n \u0027What is it?\u0027\n \u0027\"Stay where you are.\" \u0027\n \u0027I haven\u0027t moved!\u0027 said Harry, his hand still upon the doorknob. \u0027So what\u0027s the message?\u0027\n \u0027I have just given it to you, dolt,\u0027 said Phineas Nigellus smoothly. \u0027Dumbledore says, \"Stay where you are.\"\u0027\n \u0027Why?\u0027 said Harry eagerly, dropping the end of his trunk. \u0027Why does he want me to stay? What else did he say?\u0027\n \u0027Nothing whatsoever,\u0027 said Phineas Nigellus, raising a thin black eyebrow as though he found Harry impertinent.\n Harry\u0027s temper rose to the surface like a snake rearing from long grass. He was exhausted, he was confused beyond measure, he had experienced terror, relief, then terror again in the last twelve hours, and still Dumbledore did not want to talk to him!\n \u0027So that\u0027s it, is it?\u0027 he said loudly. \u0027\"Stay where you are\"? That\u0027s all anyone could tell me after I got attacked by those dementors, too! Just stay put while the grown-ups sort it out, Harry! We won\u0027t bother telling you anything, though, because your tiny little brain might not be able to cope with it!\u0027\n \u0027You know,\u0027 said Phineas Nigellus, even more loudly than Harry, \u0027this is precisely why I loathed being a teacher! Young people are so infernally convinced that they are absolutely right about everything. Has it not occurred to you, my poor puffed-up popinjay, that there might be an excellent reason why the Headmaster of Hogwarts is not confiding every tiny detail of his plans to you? Have you never paused, while feeling hard-done-by, to note that following Dumbledore\u0027s orders has never yet led you into harm? No.No, like all young people, you are quite sure that you alone feel and think, you alone recognise danger, you alone are the only one clever enough to realise what the Dark Lord may be planning--\u0027\n \u0027He is planning something to do with me, then?\u0027 said Harry swiftly.\n \u0027Did I say that?\u0027 said Phineas Nigellus, idly examining his silk gloves. \u0027Now, if you will excuse me, I have better things to do than listen to adolescent agonising ... good-day to you.\u0027\n And he strolled to the edge of his frame and out of sight.\n \u0027Fine, go then!\u0027 Harry bellowed at the empty frame. \u0027And tell Dumbledore thanks for nothing!\u0027\n The empty canvas remained silent. Fuming, Harry dragged his trunk back to the foot of his bed, then threw himself face down on the moth-eaten covers, his eyes shut, his body heavy and aching.\n He felt as though he had journeyed for miles and miles ... it seemed impossible that less than twenty-four hours ago Cho Chang had been approaching him under the mistletoe ... he was so tired ... he was scared to sleep ... yet he did not know how long he could fight it ... Dumbledore had told him to stay ... that must mean he was allowed to sleep ... but he was scared ... what if it happened again?\n He was sinking into shadows ...\n It was as though a film in his head had been waiting to start. He was walking down a deserted corridor towards a plain black door, past rough stone walls, torches, and an open doorway on to a flight of stone steps leading downstairs on the left ...\n He reached the black door but could not open it... he stood gazing at it, desperate for entry ... something he wanted with all his heart lay beyond ... a prize beyond his dreams ... if only his scar would stop prickling ... then he would be able to think more clearly ...\n \u0027Harry,\u0027 said Ron\u0027s voice, from far, far away, \u0027Mum says dinners ready, but she\u0027ll save you something if you want to stay in bed.\u0027\n Harry opened his eyes, but Ron had already left the room.\n He doesn\u0027t want to be on his own with me, Harry thought. Not after what he heard Moody say.\n He supposed none of them would want him there any more, now that they knew what was inside him.\n He would not go down to dinner; he would not inflict his company on them. He turned over on to his other side and, after a while, dropped back off to sleep. He woke much later, in the early hours of the morning, his insides aching with hunger and Ron snoring in the next bed. Squinting around the room, he saw the dark outline of Phineas Nigellus standing again in his portrait and it occurred to Harry that Dumbledore had probably sent Phineas Nigellus to watch over him, in case he attacked somebody else.\n The feeling of being unclean intensified. He half-wished he had not obeyed Dumbledore ... if this was how life was going to be for him in Grimmauld Place from now on, maybe he would be better off in Privet Drive after all.\n Everybody else spent the following morning putting up Christmas decorations. Harry could not remember Sirius ever being in such a good mood; he was actually singing carols, apparently delighted that he was to have company over Christmas. Harry could hear his voice echoing up through the floor in the cold drawing room where he was sitting alone, watching the sky growing whiter outside the windows, threatening snow, all the time feeling a savage pleasure that he was giving the others the opportunity to keep talking about him, as they were bound to be doing. When he heard Mrs. Weasley calling his name softly up the stairs around lunchtime, he retreated further upstairs and ignored her.\n Around six o\u0027clock in the evening the doorbell rang and Mrs. Black started screaming again. Assuming that Mundungus or some other Order member had come to call, Harry merely settled himself more comfortably against the wall of Buckbeak\u0027s room where he was hiding, trying to ignore how hungry he felt as he fed dead rats to the hippogriff. It came as a slight shock when somebody hammered hard on the door a few minutes later.\n \u0027I know you\u0027re in there,\u0027 said Hermione\u0027s voice. \u0027Will you please come out? I want to talk to you.\u0027\n \u0027What are you doing here?\u0027 Harry asked her, pulling open the door as Buckbeak resumed his scratching at the straw-strewn floor for any fragments of rat he may have dropped. \u0027I thought you were skiing with your mum and dad?\u0027\n \u0027Well, to tell the truth, skiing\u0027s not really my thing,\u0027 said Hermione. \u0027So, I\u0027ve come here for Christmas.\u0027 There was snow in her hair and her face was pink with cold. \u0027But don\u0027t tell Ron. I told him skiing\u0027s really good because he kept laughing so much. Mum and Dad are a bit disappointed, but I\u0027ve told them that everyone who is serious about the exams is staying at Hogwarts to study. They want me to do well, they\u0027ll understand. Anyway,\u0027 she said briskly, \u0027let\u0027s go to your bedroom, Ron\u0027s mum has lit a fire in there and she\u0027s sent up sandwiches.\u0027\n Harry followed her back to the second floor. When he entered the bedroom, he was rather surprised to see both Ron and Ginny waiting for them, sitting on Ron\u0027s bed.\n \u0027I came on the Knight Bus,\u0027 said Hermione airily, pulling off her jacket before Harry had time to speak. \u0027Dumbledore told me what had happened first thing this morning, but I had to wait for term to end officially before setting off. Umbridge is already livid that you lot disappeared right under her nose, even though Dumbledore told her Mr. Weasley was in St. Mungo\u0027s and he\u0027d given you all permission to visit. So ...\u0027\n She sat down next to Ginny, and the two girls and Ron all looked up at Harry.\n \u0027How\u0027re you feeling?\u0027 asked Hermione.\n \u0027Fine,\u0027 said Harry stiffly.\n \u0027Oh, don\u0027t lie, Harry,\u0027 she said impatiently. \u0027Ron and Ginny say you\u0027ve been hiding from everyone since you got back from St. Mungo\u0027s.\u0027\n \u0027They do, do they?\u0027 said Harry, glaring at Ron and Ginny. Ron looked down at his feet but Ginny seemed quite unabashed.\n \u0027Well, you have!\u0027 she said. \u0027And you won\u0027t look at any of us!\u0027\n \u0027It\u0027s you lot who won\u0027t look at me!\u0027 said Harry angrily.\n \u0027Maybe you\u0027re taking it in turns to look, and keep missing each other,\u0027 suggested Hermione, the corners of her mouth twitching.\n \u0027Very funny,\u0027 snapped Harry, turning away.\n \u0027Oh, stop feeling all misunderstood,\u0027 said Hermione sharply. \u0027Look, the others have told me what you overheard last night on the Extendable Ears--\u0027\n \u0027Yeah?\u0027 growled Harry, his hands deep in his pockets as he watched the snow now falling thickly outside. \u0027All been talking about me, have you? Well, I\u0027m getting used to it.\u0027\n \u0027We wanted to talk toyou, Harry,\u0027 said Ginny, \u0027but as you\u0027ve been hiding ever since we got back--\u0027\n \u0027I didn\u0027t want anyone to talk to me,\u0027 said Harry, who was feeling more and more nettled.\n \u0027Well, that was a bit stupid of you,\u0027 said Ginny angrily, \u0027seeing as you don\u0027t know anyone but me who\u0027s been possessed by You-Know-Who, and I can tell you how it feels.\u0027\n Harry remained quite still as the impact of these words hit him. Then he wheeled round.\n \u0027I forgot,\u0027 he said.\n \u0027Lucky you,\u0027 said Ginny coolly.\n \u0027I\u0027m sorry,\u0027 Harry said, and he meant it. \u0027So ... so, do you think I\u0027m being possessed, then?\u0027\n \u0027Well, can you remember everything you\u0027ve been doing?\u0027 Ginny asked. \u0027Are there big blank periods where you don\u0027t know what you\u0027ve been up to?\u0027\n Harry racked his brains.\n \u0027No,\u0027 he said.\n \u0027Then You-Know-Who hasn\u0027t ever possessed you,\u0027 said Ginny simply. \u0027When he did it to me, I couldn\u0027t remember what I\u0027d been doing for hours at a time. I\u0027d find myself somewhere and not know how I got there.\u0027\n Harry hardly dared believe her, yet his heart was lightening almost in spite of himself.\n \u0027That dream I had about your dad and the snake, though--\u0027\n \u0027Harry, you\u0027ve had these dreams before,\u0027 Hermione said. \u0027You had flashes of what Voldemort was up to last year.\u0027\n \u0027This was different,\u0027 said Harry, shaking his head. \u0027I was inside that snake. It was like I was the snake ... what if Voldemort somehow transported me to London--?\u0027\n \u0027One day,\u0027 said Hermione, sounding thoroughly exasperated, \u0027you\u0027ll read Hogwarts: A History, and perhaps it will remind you that you can\u0027t Apparate or Disapparaie inside Hogwarts. Even Voldemort couldn\u0027t just make you fly out of your dormitory, Harry.\u0027\n \u0027You didn\u0027t leave your bed, mate,\u0027 said Ron. \u0027I saw you thrashing around in your sleep for at least a minute before we could wake you up.\u0027\n Harry started pacing up and down the room again, thinking. What they were all saying was not only comforting, it made sense ... without really thinking, he took a sandwich from the plate on the bed and crammed it hungrily into his mouth.\n I\u0027m not the weapon after all, thought Harry. His heart swelled with happiness and relief, and he felt like joining in as they heard Sirius tramping past their door towards Buckbeak\u0027s room, singing \u0027God Rest Ye, Merry Hippogriffs\u0027 at the top of his voice.\n How could he have dreamed of returning to Privet Drive for Christmas? Sirius\u0027s delight at having the house full again, and especially at having Harry back, was infectious. He was no longer their sullen host of the summer; now he seemed determined that everyone should enjoy themselves as much, if not more than they would have done at Hogwarts, and he worked tirelessly in the run-up to Christmas Day, cleaning and decorating with their help, so that by the time they all went to bed on Christmas Eve the house was barely recognisable. The tarnished chandeliers were no longer hung with cobwebs but with garlands of holly and gold and silver streamers; magical snow glittered in heaps over the threadbare carpets; a great Christmas tree, obtained by Mundungus and decorated with live fairies, blocked Sirius\u0027s family tree from view, and even the stuffed elf-heads on the hall wall wore Father Christmas hats and beards.\n Harry awoke on Christmas morning to find a stack of presents at the foot of his bed and Ron already halfway through opening his own, rather larger, pile.\n \u0027Good haul this year,\u0027 he informed Harry through a cloud of paper. \u0027Thanks for the Broom Compass, it\u0027s excellent; beats Hermione\u0027s--she got me a homework planner--\u0027\n Harry sorted through his presents and found one with Hermione\u0027s handwriting on it. She had given him, too, a book that resembled a diary except that every time he opened a page it said aloud things like: \u0027Do it today or later you\u0027ll pay!\u0027\n Sirius and Lupin had given Harry a set of excellent books entitled Practical Defensive Magic and its Use Against the Dark Arts, which had superb, moving colour illustrations of all the counter-jinxes and hexes it described. Harry flicked through the first volume eagerly; he could see it was going to be highly useful in his plans for the DA. Hagrid had sent a furry brown wallet that had fangs, which were presumably supposed to be an anti-theft device, but unfortunately prevented Harry putting any money in without getting his fingers ripped off. Tonks\u0027s present was a small, working model of a Firebolt, which Harry watched fly around the room, wishing he still had his full-size version; Ron had given him an enormous box of Every-Flavour Beans, Mr. and Mrs. Weasley the usual hand-knitted jumper and some mince pies, and Dobby a truly dreadful painting that Harry suspected had been done by the elf himself. He had just turned it upside-down to see whether it looked better that way when, with a loud crack, Fred and George Apparated at the foot of his bed.\n \u0027Merry Christmas,\u0027 said George. \u0027Don\u0027t go downstairs for a bit.\u0027\n \u0027Why not?\u0027 said Ron.\n \u0027Mum\u0027s crying again,\u0027 said Fred heavily. \u0027Percy sent back his Christmas jumper.\u0027\n \u0027Without a note,\u0027 added George. \u0027Hasn\u0027t asked how Dad is or visited him or anything.\u0027\n \u0027We tried to comfort her,\u0027 said Fred, moving around the bed to look at Harry\u0027s portrait. \u0027Told her Percy\u0027s nothing more than a humungous pile of rat droppings.\u0027\n \u0027Didn\u0027t work,\u0027 said George, helping himself to a Chocolate Frog. \u0027So Lupin took over. Best let him cheer her up before we go down for breakfast, I reckon.\u0027\n \u0027What\u0027s that supposed to be, anyway?\u0027 asked Fred, squinting at Dobbys painting. \u0027Looks like a gibbon with two black eyes.\u0027\n \u0027It\u0027s Harry!\u0027 said George, pointing at the back of the picture, \u0027says so on the back!\u0027\n \u0027Good likeness,\u0027 said Fred, grinning. Harry threw his new homework diary at him; it hit the wall opposite and fell to the floor where it said happily: \u0027If you\u0027ve dotted the \"i\"s and crossed the \"t\"s then you may do whatever you please!\u0027\n They got up and dressed. They could hear the various inhabitants of the house calling \u0027Merry Christmas\u0027 to one another. On their way downstairs they met Hermione.\n Thanks for the book, Harry,\u0027 she said happily. \u0027I\u0027ve been wanting that New Theory of Numerology for ages! And that perfume\u0027s really unusual, Ron.\u0027\n \u0027No problem,\u0027 said Ron. \u0027Who\u0027s that for, anyway?\u0027 he added, nodding at the neatly wrapped present she was carrying.\n \u0027Kreacher,\u0027 said Hermione brightly.\n \u0027It had better not be clothes!\u0027 Ron warned her. \u0027You know what Sirius said: Kreacher knows too much, we can\u0027t set him free!\u0027\n \u0027It isn\u0027t clothes,\u0027 said Hermione, \u0027although if I had my way I\u0027d certainly give him something to wear other than that filthy old rag. No, it\u0027s a patchwork quilt, I thought it would brighten up his bedroom.\u0027\n \u0027What bedroom?\u0027 said Harry, dropping his voice to a whisper as they were passing the portrait of Sirius\u0027s mother.\n \u0027Well, Sirius says it\u0027s not so much a bedroom, more a kind of--den,\u0027 said Hermione. \u0027Apparently he sleeps under the boiler in that cupboard off the kitchen.\u0027\n Mrs. Weasley was the only person in the basement when they arrived there. She was standing at the stove and sounded as though she had a bad head cold as she wished them \u0027Merry Christmas\u0027, and they all averted their eyes.\n \u0027So, is this Kreacher\u0027s bedroom?\u0027 said Ron, strolling over to a dingy door in the corner opposite the pantry. Harry had never seen it open.\n \u0027Yes,\u0027 said Hermione, now sounding a little nervous. \u0027Er ... I think we\u0027d better knock.\u0027\n Ron rapped on the door with his knuckles but there was no reply.\n \u0027He must be sneaking around upstairs,\u0027 he said, and without further ado pulled open the door. \u0027Urgh!\u0027\n Harry peered inside. Most of the cupboard was taken up with a very large and old-fashioned boiler, but in the foot of space underneath the pipes Kreacher had made himself something that looked like a nest. A jumble of assorted rags and smelly old blankets were piled on the floor and the small dent in the middle of it showed where Kreacher curled up to sleep every night. Here and there among the material were stale bread crusts and mouldy old bits of cheese. In a far corner glinted small objects and coins that Harry guessed Kreacher had saved, magpie-like, from Sirius\u0027s purge of the house, and he had also managed to retrieve the silver-framed family photographs that Sirius had thrown away over the summer. Their glass might be shattered, but still the little black-and-white people inside them peered up at him haughtily, including--he felt a little jolt in his stomach--the dark, heavy-lidded woman whose trial he had witnessed in Dumbledore\u0027s Pensieve: Bellatrix Lestrange. By the looks of it, hers was Kreacher\u0027s favourite photograph; he had placed it to the fore of all the others and had mended the glass clumsily with Spellotape.\n \u0027I think I\u0027ll just leave his present here,\u0027 said Hermione, laying the package neatly in the middle of the depression in the rags and blankets and closing the door quietly. \u0027He\u0027ll find it later, that\u0027ll be fine.\u0027\n \u0027Come to think of it,\u0027 said Sirius, emerging from the pantry carrying a large turkey as they closed the cupboard door, \u0027has anyone actually seen Kreacher lately?\u0027\n \u0027I haven\u0027t seen him since the night we came back here,\u0027 said Harry. \u0027You were ordering him out of the kitchen.\u0027\n \u0027Yeah ...\u0027 said Sirius, frowning. \u0027You know, I think that\u0027s the last time I saw him, too ... he must be hiding upstairs somewhere.\u0027\n \u0027He couldn\u0027t have left, could he?\u0027 said Harry. \u0027I mean, when you said \"out\", maybe he thought you meant get out of the house?\u0027\n \u0027No, no, house-elves can\u0027t leave unless they\u0027re given clothes. They\u0027re tied to their family\u0027s house,\u0027 said Sirius.\n \u0027They can leave the house if they really want to,\u0027 Harry contradicted him. \u0027Dobby did, he left the Malfoy\u0027s\u0027 to give me warnings two years ago. He had to punish himself afterwards, but he still managed it.\u0027\n Sirius looked slightly disconcerted for a moment, then said, \u0027I\u0027ll look for him later, I expect I\u0027ll find him upstairs crying his eyes out over my mother\u0027s old bloomers or something. Of course, he might have crawled into the airing cupboard and died ... but I mustn\u0027t get my hopes up.\u0027\n Fred, George and Ron laughed; Hermione, however, looked reproachful.\n Once they had eaten their Christmas lunch, the Weasleys, Harry and Hermione were planning to pay Mr. Weasley another visit, escorted by Mad-Eye and Lupin. Mundungus turned up in time for Christmas pudding and trifle, having managed to \u0027borrow\u0027 a car for the occasion, as the Underground did not run on Christmas Day. The car, which Harry doubted very much had been taken with the consent of its owner, had been enlarged with a spell like the Weasleys\u0027 old Ford Anglia had once been. Although normally proportioned outside, ten people with Mundungus driving were able to fit into it quite comfortably. Mrs. Weasley hesitated before getting inside--Harry knew her disapproval of Mundungus was battling with her dislike of travelling without magic--but, finally, the cold outside and her children\u0027s pleading triumphed, and she settled herself into the back seat between Fred and Bill with good grace.\n The journey to St Mungo\u0027s was quite quick as there was very little traffic on the roads. A small trickle of witches and wizards was creeping furtively up the otherwise deserted street to visit the hospital. Harry and the others got out of the car, and Mundungus drove off around the corner to wait for them. They strolled casually towards the window where the dummy in green nylon stood, then, one by one, stepped through the glass.\n The reception area looked pleasantly festive: the crystal orbs that illuminated St. Mungo\u0027s had been coloured red and gold to become gigantic, glowing Christmas baubles; holly hung around every doorway; and shining white Christmas trees covered in magical snow and icicles glittered in every corner, each one topped with a gleaming gold star. It was less crowded than the last time they had been there, although halfway across the room Harry found himself shunted aside by a witch with a satsuma jammed up her left nostril.\n \u0027Family argument, eh?\u0027 smirked the blonde witch behind the desk. \u0027You\u0027re the third I\u0027ve seen today ... Spell Damage, fourth floor.\u0027\n They found Mr Weasley propped up in bed with the remains of his turkey dinner on a tray on his lap and a rather sheepish expression on his face.\n \u0027Everything all right, Arthur?\u0027 asked Mrs. Weasley, after they had all greeted Mr. Weasley and handed over their presents.\n \u0027Fine, fine,\u0027 said Mr. Weasley, a little too heartily. \u0027You--er--haven\u0027t seen Healer Smethwyck, have you?\u0027\n \u0027No,\u0027 said Mrs Weasley suspiciously, \u0027why?\u0027\n \u0027Nothing, nothing,\u0027 said Mr. Weasley airily, starting to unwrap his pile of gifts. \u0027Well, everyone had a good day? What did you all get for Christmas? Oh, Harry-- this is absolutely wonderful!\u0027 For he had just opened Harry\u0027s gift of fuse-wire and screwdrivers.\n Mrs. Weasley did not seem entirely satisfied with Mr. Weasley\u0027s answer. As her husband leaned over to shake Harry\u0027s hand, she peered at the bandaging under his nightshirt.\n \u0027Arthur,\u0027 she said, with a snap in her voice like a mousetrap, \u0027you\u0027ve had your bandages changed. Why have you had your bandages changed a day early, Arthur? They told me they wouldn\u0027t need doing until tomorrow.\u0027\n \u0027What?\u0027 said Mr Weasley, looking rather frightened and pulling the bed covers higher up his chest. \u0027No, no--it\u0027s nothing--it\u0027s--I--\u0027\n He seemed to deflate under Mrs. Weasley\u0027s piercing gaze.\n \u0027Well--now don\u0027t get upset, Molly, but Augustus Pye had an idea ... he\u0027s the Trainee Healer, you know, lovely young chap and very interested in ... um ... complementary medicine ... I mean, some of these old Muggle remedies ... well, they\u0027re called stitches, Molly, and they work very well on--on Muggle wounds--\u0027\n Mrs. Weasley let out an ominous noise somewhere between a shriek and a snarl. Lupin strolled away from the bed and over to the werewolf, who had no visitors and was looking rather wistfully at the crowd around Mr. Weasley; Bill muttered something about getting himself a cup of tea and Fred and George leapt up to accompany him, grinning.\n \u0027Do you mean to tell me,\u0027 said Mrs. Weasley, her voice growing louder with every word and apparently unaware that her fellow visitors were scurrying for cover, \u0027that you have been messing about with Muggle remedies?\u0027\n \u0027Not messing about, Molly, dear,\u0027 said Mr. Weasley imploringly, \u0027it was just--just something Pye and I thought we\u0027d try--only, most unfortunately--well, with these particular kinds of wounds--it doesn\u0027t seem to work as well as we\u0027d hoped--\u0027\n \u0027Meaning?\u0027\n \u0027Well ... well, I don\u0027t know whether you know what--what stitches are?\u0027\n \u0027It sounds as though you\u0027ve been trying to sew your skin back together,\u0027 said Mrs. Weasley with a snort of mirthless laughter, \u0027but even you, Arthur, wouldn\u0027t be that stupid --\u0027\n \u0027I fancy a cup of tea, too,\u0027 said Harry, jumping to his feet.\n Hermione, Ron and Ginny almost sprinted to the door with him. As it swung closed behind them, they heard Mrs. Weasley shriek, \u0027WHAT DO YOU MEAN, THAT\u0027S THE GENERAL IDEA?\u0027\n \u0027Typical Dad,\u0027 said Ginny, shaking her head as they set off up the corridor. \u0027Stitches ... I ask you ...\u0027\n \u0027Well, you know, they do work well on non-magical wounds,\u0027 said Hermione fairly. \u0027I suppose something in that snake\u0027s venom dissolves them or something. I wonder where the tearoom is?\u0027\n \u0027Fifth floor,\u0027 said Harry, remembering the sign over the welcomewitch\u0027s desk.\n They walked along the corridor, through a set of double doors and found a rickety staircase lined with more portraits of brutal-looking Healers. As they climbed it, the various Healers called out to them, diagnosing odd complaints and suggesting horrible remedies. Ron was seriously affronted when a medieval wizard called out that he clearly had a bad case of spattergroit.\n \u0027And what\u0027s that supposed to be?\u0027 he asked angrily, as the Healer pursued him through six more portraits, shoving the occupants out of the way.\n \u0027 \u0027Tis a most grievous affliction of the skin, young master, that will leave you pockmarked and more gruesome even than you are now--\u0027\n \u0027Watch who you\u0027re calling gruesome!\u0027 said Ron, his ears turning red.\n \u0027--the only remedy is to take the liver of a toad, bind it tight about your throat, stand naked at the full moon in a barrel of eels\u0027 eyes--\u0027\n \u0027I have not got spattergroit!\u0027\n \u0027But the unsightly blemishes upon your visage, young master--\u0027\n \u0027They\u0027re freckles!\u0027 said Ron furiously. \u0027Now get back in your own picture and leave me alone!\u0027\n He rounded on the others, who were all keeping determinedly straight faces.\n \u0027What floor\u0027s this?\u0027\n \u0027I think it\u0027s the fifth,\u0027 said Hermione.\n \u0027Nah, it\u0027s the fourth,\u0027 said Harry, \u0027one more--\u0027\n But as he stepped on to the landing he came to an abrupt halt, staring at the small window set into the double doors that marked the start of a corridor signposted SPELL DAMAGE. A man was peering out at them all with his nose pressed against the glass. He had wavy blond hair, bright blue eyes and a broad vacant smile that revealed dazzlingly white teeth.\n \u0027Blimey!\u0027 said Ron, also staring at the man.\n \u0027Oh, my goodness,\u0027 said Hermione suddenly, sounding breathless. \u0027Professor Lockhart.\u0027\n Their ex-Defence Against the Dark Arts teacher pushed open the doors and moved towards them, wearing a long lilac dressing gown.\n \u0027Well, hello there!\u0027 he said. \u0027I expect you\u0027d like my autograph, would you?\u0027\n \u0027Hasn\u0027t changed much, has he?\u0027 Harry muttered to Ginny, who grinned.\n \u0027Er--how are you, Professor?\u0027 said Ron, sounding slightly guilty. It had been Ron\u0027s malfunctioning wand that had damaged Professor Lockhart\u0027s memory so badly that he had landed in St. Mungo\u0027s in the first place, though as Lockhart had been attempting to permanently wipe Harry and Ron\u0027s memories at the time, Harry\u0027s sympathy was limited.\n \u0027I\u0027m very well indeed, thank you!\u0027 said Lockhart exuberantly, palling a rather battered peacock-feather quill from his pocket. \u0027Now, how many autographs would you like? I can do joined-up writing now, you know!\u0027\n \u0027Er--we don\u0027t want any at the moment, thanks,\u0027 said Ron, raising his eyebrows at Harry, who asked, \u0027Professor, should you be wandering around the corridors? Shouldn\u0027t you be in a ward?\u0027\n The smile faded slowly from Lockhart\u0027s face. For a few moments he gazed intently at Harry, then he said, \u0027Haven\u0027t we met?\u0027\n \u0027Er ... yeah, we have,\u0027 said Harry. \u0027You used to teach us at Hogwarts, remember?\u0027\n \u0027Teach?\u0027 repeated Lockhart, looking faintly unsettled. \u0027Me? Did I?\u0027\n And then the smile reappeared upon his face so suddenly it was rather alarming.\n \u0027Taught you everything you know, I expect, did I? Well, how about those autographs, then? Shall we say a round dozen, you can give them to all your little friends then and nobody will be left out!\u0027\n But just then a head poked out of a door at the far end of the corridor and a voice called, \u0027Gilderoy, you naughty boy, where have you wandered off to?\u0027\n A motherly-looking Healer wearing a tinsel wreath in her hair came bustling up the corridor, smiling warmly at Harry and the others.\n \u0027Oh, Gilderoy, you\u0027ve got visitors! How lovely, and on Christmas Day, too! Do you know, he never gets visitors, poor lamb, and I can\u0027t think why, he\u0027s such a sweetie, aren\u0027t you?\u0027\n \u0027We\u0027re doing autographs!\u0027 Gilderoy told the Healer with another glittering smile. \u0027They want loads of them, won\u0027t take no for an answer! I just hope we\u0027ve got enough photographs!\u0027\n \u0027Listen to him,\u0027 said the Healer, taking Lockhart\u0027s arm and beaming fondly at him as though he were a precocious two-year-old. \u0027He was rather well known a few years ago; we very much hope that this liking for giving autographs is a sign that his memory might be starting to come back. Will you step this way? He\u0027s in a closed ward, you know, he must have slipped out while I was bringing in the Christmas presents, the door\u0027s usually kept locked ... not that he\u0027s dangerous! But,\u0027 she lowered her voice to a whisper, \u0027he\u0027s a bit of a danger to himself, bless him ... doesn\u0027t know who he is, you see, wanders off and can\u0027t remember how to get back ... it is nice of you to have come to see him.\u0027\n \u0027Er,\u0027 said Ron, gesturing uselessly at the floor above, \u0027actually, we were just--er--\u0027\n But the Healer was smiling expectantly at them, and Ron\u0027s feeble mutter of \u0027going to have a cup of tea\u0027 trailed away into nothingness. They looked at each other helplessly, then followed Lockhart and his Healer along the corridor.\n \u0027Let\u0027s not stay long,\u0027 Ron said quietly.\n The Healer pointed her wand at the door of the Janus Thickey Ward and muttered, \u0027Alohomora.\u0027 The door swung open and she led the way inside, keeping a firm grasp on Gilderoy\u0027s arm until she had settled him into an armchair beside his bed.\n \u0027This is our long-term residents\u0027 ward,\u0027 she informed Harry, Ron, Hermione and Ginny in a low voice. \u0027For permanent spell damage, you know. Of course, with intensive remedial potions and charms and a bit of luck, we can produce some improvement. Gilderoy does seem to be getting back some sense of himself; and we\u0027ve seen a real improvement in Mr. Bode, he seems to be regaining the power of speech very well, though he isn\u0027t speaking any language we recognise yet. Well, I must finish giving out the Christmas presents, I\u0027ll leave you all to chat.\u0027\n Harry looked around. The ward bore unmistakeable signs of being a permanent home to its residents. They had many more personal effects around their beds than in Mr Weasley\u0027s ward; the wall around Gilderoy\u0027s headboard, for instance, was papered with pictures of himself, all beaming toothily and waving at the new arrivals. He had autographed many of them to himself in disjointed, childish writing. The moment he had been deposited in his chair by the Healer, Gilderoy pulled a fresh stack of photographs towards him, seized a quill and started signing them all feverishly.\n \u0027You can put them in envelopes,\u0027 he said to Ginny, throwing the signed pictures into her lap one by one as he finished them. \u0027I am not forgotten, you know, no, I still receive a very great deal of fan mail ... Gladys Gudgeon writes weekly ... I just wish I knew why ...\u0027 He paused, looking faintly puzzled, then beamed again and returned to his signing with renewed vigour. \u0027I suspect it is simply my good looks ...\u0027\n A sallow-skinned, mournful-looking wizard lay in the bed opposite staring at the ceiling; he was mumbling to himself and seemed quite unaware of anything around him. Two beds along was a woman whose entire head was covered in fur; Harry remembered something similar happening to Hermione during their second year, although fortunately the damage, in her case, had not been permanent. At the far end of the ward flowery curtains had been drawn around two beds to give the occupants and their visitors some privacy.\n \u0027Here you are, Agnes,\u0027 said the Healer brightly to the furry-faced woman, handing her a small pile of Christmas presents. \u0027See, not forgotten, are you? And your son\u0027s sent an owl to say he\u0027s visiting tonight, so that\u0027s nice, isn\u0027t it?\u0027\n Agnes gave several loud barks.\n \u0027And look, Broderick, you\u0027ve been sent a pot plant and a lovely calendar with a different fancy hippogriff for each month; they\u0027ll brighten things up, won\u0027t they?\u0027 said the Healer, bustling along to the mumbling man, setting a rather ugly plant with long, swaying tentacles on the bedside cabinet and fixing the calendar to the wall with her wand. \u0027And--oh, Mrs. Longbottom, are you leaving already?\u0027\n Harry\u0027s head span round. The curtains had been drawn back from the two beds at the end of the ward and two visitors were walking back down the aisle between the beds: a formidable-looking old witch wearing a long green dress, a moth-eaten fox fur and a pointed hat decorated with what was unmistakeably a stuffed vulture and, trailing behind her looking thoroughly depressed--Neville.\n With a sudden rush of understanding, Harry realised who the people in the end beds must be. He cast around wildly for some means of distracting the others so that Neville could leave the ward unnoticed and unquestioned, but Ron had also looked up at the sound of the name \u0027Longbottom\u0027, and before Harry could stop him had called out, \u0027Neville!\u0027\n Neville jumped and cowered as though a bullet had narrowly missed him.\n \u0027It\u0027s us, Neville!\u0027 said Ron brightly, getting to his feet. \u0027Have you seen--? Lockhart\u0027s here! Who\u0027ve you been visiting?\u0027\n \u0027Friends of yours, Neville, dear?\u0027 said Neville\u0027s grandmother graciously, bearing down upon them all.\n Neville looked as though he would rather be anywhere in the world but here. A dull purple flush was creeping up his plump face and he was not making eye contact with any of them.\n \u0027Ah, yes,\u0027 said his grandmother, looking closely at Harry and sticking out a shrivelled, clawlike hand for him to shake. \u0027Yes, yes, I know who you are, of course. Neville speaks most highly of you.\u0027\n \u0027Er--thanks,\u0027 said Harry, shaking hands. Neville did not look at him, but surveyed his own feet, the colour deepening in his face all the while.\n \u0027And you two are clearly Weasleys,\u0027 Mrs. Longbottom continued, proffering her hand regally to Ron and Ginny in turn. \u0027Yes, I know your parents--not well, of course--but fine people, fine people ... and you must be Hermione Granger?\u0027\n Hermione looked rather startled that Mrs. Longbottom knew her name, but shook hands all the same.\n \u0027Yes, Neville\u0027s told me all about you. Helped him out of a few sticky spots, haven\u0027t you? He\u0027s a good boy,\u0027 she said, casting a sternly appraising look down her rather bony nose at Neville, \u0027but be hasn\u0027t got his father\u0027s talent, I\u0027m afraid to say.\u0027 And she jerked her head in the direction of the two beds at the end of the ward, so that the stuffed vulture on her hat trembled alarmingly.\n \u0027What?\u0027 said Ron, looking amazed. (Harry wanted to stamp on Ron\u0027s foot, but that sort of thing is much harder to bring off unnoticed when you\u0027re wearing jeans rather than robes.) \u0027Is that your dad down the end, Neville?\u0027\n \u0027What\u0027s this?\u0027 said Mrs. Longbottom sharply. \u0027Haven\u0027t you told your friends about your parents, Neville?\u0027\n Neville took a deep breath, looked up at the ceiling and shook his head. Harry could not remember ever feeling sorrier for anyone, but he could not think of any way of helping Neville out of the situation.\n \u0027Well, it\u0027s nothing to be ashamed of!\u0027 said Mrs. Longbottom angrily. \u0027You should be proud, Neville, proud!They didn\u0027t give their health and their sanity so their only son would be ashamed of them, you know!\u0027\n \u0027I\u0027m not ashamed,\u0027 said Neville, very faintly, still looking anywhere but at Harry and the others. Ron was now standing on tiptoe to look over at the inhabitants of the two beds.\n \u0027Well, you\u0027ve got a funny way of showing it!\u0027 said Mrs. Longbottom. \u0027My son and his wife,\u0027 she said, turning haughtily to Harry, Ron, Hermione and Ginny, \u0027were tortured into insanity by You-Know-Who\u0027s followers.\u0027\n Hermione and Ginny both clapped their hands over their mouths. Ron stopped craning his neck to catch a glimpse of Neville\u0027s parents and looked mortified.\n \u0027They were Aurors, you know, and very well respected within the wizarding community,\u0027 Mrs Longbottom went on. \u0027Highly gifted, the pair of them. I--yes, Alice dear, what is it?\u0027\n Neville\u0027s mother had come edging down the ward in her nightdress. She no longer had the plump, happy-looking face Harry had seen in Moody\u0027s old photograph of the original Order of the Phoenix. Her face was thin and worn now, her eyes seemed overlarge and her hair, which had turned white, was wispy and dead-looking. She did not seem to want to speak, or perhaps she was not able to, but she made timid motions towards Neville, holding something in her outstretched hand.\n \u0027Again?\u0027 said Mrs Longbottom, sounding slightly weary. \u0027Very well, Alice dear, very well-- Neville, take it, whatever it is.\u0027\n But Neville had already stretched out his hand, into which his mother dropped an empty Drooble\u0027s Best Blowing Gum wrapper.\n \u0027Very nice, dear,\u0027 said Neville\u0027s grandmother in a falsely cheery voice, patting his mother on the shoulder.\n But Neville said quietly, \u0027Thanks, Mum.\u0027\n His mother tottered away, back up the ward, humming to herself. Neville looked around at the others, his expression defiant, as though daring them to laugh, but Harry did not think he\u0027d ever found anything less funny in his life.\n \u0027Well, we\u0027d better get back,\u0027 sighed Mrs. Longbottom, drawing on long green gloves. \u0027Very nice to have met you all. Neville, put that wrapper in the bin, she must have given you enough of them to paper your bedroom by now.\u0027\n But as they left, Harry was sure he saw Neville slip the sweet wrapper into his pocket.\n The door closed behind them.\n \u0027I never knew,\u0027 said Hermione, who looked tearful.\n \u0027Nor did I,\u0027 said Ron rather hoarsely.\n \u0027Nor me,\u0027 whispered Ginny.\n They all looked at Harry.\n \u0027I did,\u0027 he said glumly. \u0027Dumbledore told me but I promised I wouldn\u0027t tell anyone ... that\u0027s what Bellatrix Lestrange got sent to Azkaban for, using the Cruciatus Curse on Neville\u0027s parents until they lost their minds.\u0027\n \u0027Bellatrix Lestrange did that?\u0027 whispered Hermione, horrified. \u0027That woman Kreacher\u0027s got a photo of in his den?\u0027\n There was a long silence, broken by Lockhart\u0027s angry voice.\n \u0027Look, I didn\u0027t learn joined-up writing for nothing, you know!\u0027 \n","sourceLink":"https://allnovel.net/harry-potter-and-the-order-of-the-phoenix-harry-potter-5/page-23.html","bookId":2072,"book":{"id":2072,"title":"Harry Potter and the Order of the Phoenix (Harry Potter #5)","description":"Storyline: \n Harry Potter and the Order of the Phoenix (Harry Potter #5) \n \n Grade 4 Up-Harry has just returned to Hogwarts after a lonely summer. Dumbledore is uncommunicative and most of the students seem to think Harry is either conceited or crazy for insisting that Voldemort is back and as evil as ever. Angry, scared, and unable to confide in his godfather, Sirius, the teen wizard lashes out at his friends and enemies alike. The head of the Ministry of Magic is determined to discredit Dumbledore and undermine his leadership of Hogwarts, and he appoints nasty, pink-cardigan-clad Professor Umbridge as the new Defense Against the Dark Arts teacher and High Inquisitor of the school, bringing misery upon staff and students alike. This bureaucratic nightmare, added to Harry\u0027s certain knowledge that Voldemort is becoming more powerful, creates a desperate, Kafkaesque feeling during Harry\u0027s fifth year at Hogwarts. The adults all seem evil, misguided, or simply powerless, so the students must take matters into their own hands. Harry\u0027s confusion about his godfather and father, and his apparent rejection by Dumbledore make him question his own motives and the condition of his soul. Also, Harry is now 15, and the hormones are beginning to kick in. There are a lot of secret doings, a little romance, and very little Quidditch or Hagrid (more reasons for Harry\u0027s gloom), but the power of this book comes from the young magician\u0027s struggles with his emotions and identity. Particularly moving is the unveiling, after a final devastating tragedy, of Dumbledore\u0027s very strong feelings of attachment and responsibility toward Harry. Children will enjoy the magic and the Hogwarts mystique, and young adult readers will find a rich and compelling coming-of-age story as well.\n \n","cover":"https://allnovel.net/images/harry-potter-and-the-order-of-the-phoenix-harry-potter-5.jpg","author":"J.K. Rowling","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/harry-potter-and-the-order-of-the-phoenix-harry-potter-5.html","creation":"Oct 5, 2019 8:58:19 AM","modification":"Oct 6, 2019 12:27:42 AM"}}
