{"id":111694,"no":31,"title":"Page 31","content":"Ron\u0027s euphoria at helping Gryffindor scrape the Quidditch cup was such that he couldn\u0027t settle to anything next day. All he wanted to do was talk over the match, so Harry and Hermione found it very difficult to find an opening in which to mention Grawp. Not that either of them tried very hard; neither was keen to be the one to bring Ron back to reality in quite such a brutal fashion. As it was another fine, warm day, they persuaded him to join them in revising under the beech tree at the edge of the lake, where they had less chance of being overheard than in the common room. Ron was not particularly keen on this idea at first--he was thoroughly enjoying being patted on the back by every Gryffindor who walked past his chair, not to mention the occasional outbursts of \u0027Weasley is our King\u0027--but after a while he agreed that some fresh air might do him good.\\n\\n They spread their books out in the shade of the beech tree and sat down while Ron talked them through his first save of the match for what felt like the dozenth time.\\n\\n \u0027Well, I mean, I\u0027d already let in that one of Davies\u0027s, so I wasn\u0027t feeling all that confident, but I dunno, when Bradley came towards me, just out of nowhere, I thought--you can do this! And I had about a second to decide which way to fly, you know, because he looked like he was aiming for the right goalhoop-- my right, obviously, his left--but I had a funny feeling that he was feinting, and so I took the chance and flew left--his right, I mean--and--well--you saw what happened,\u0027 he concluded modestly, sweeping his hair back quite unnecessarily so that it looked interestingly windswept and glancing around to see whether the people nearest to them--a bunch of gossiping third-year Hufflepuffs--had heard him. \u0027And then, when Chambers came at me about five minutes later--What?\u0027 Ron asked, having stopped mid-sentence at the look on Harry\u0027s face. \u0027Why are you grinning?\u0027\\n\\n \u0027I\u0027m not,\u0027 said Harry quickly, and looked down at his Transfiguration notes, attempting to straighten his lace. The truth was that Ron had just reminded Harry forcibly of another Gryffindor Quidditch player who had once sat rumpling his hair under this very tree. \u0027I\u0027m just glad we won, that\u0027s all.\u0027\\n\\n \u0027Yeah,\u0027 said Ron slowly, savouring the words, \u0027we won.Did you see the look on Chang\u0027s face when Ginny got the Snitch right out from under her nose?\u0027\\n\\n \u0027I suppose she cried, did she?\u0027 said Harry bitterly.\\n\\n \u0027Well, yeah-- more out of temper than anything, though ...\u0027 Ron frowned slightly. \u0027But you saw her chuck her broom away when she got back to the ground, didn\u0027t you?\u0027\\n\\n \u0027Er--\u0027 said Harry.\\n\\n \u0027Well, actually ... no, Ron,\u0027 said Hermione with a heavy sigh, putting down her book and looking at him apologetically. \u0027As a matter of fact, the only bit of the match Harry and I saw was Davies\u0027s first goal.\u0027\\n\\n Ron\u0027s carefully ruffled hair seemed to wilt with disappointment. \u0027You didn\u0027t watch?\u0027 he said faintly, looking from one to the other. \u0027You didn\u0027t see me make any of those saves?\u0027\\n\\n \u0027Well--no,\u0027 said Hermione, stretching out a placatory hand towards him. \u0027But Ron, we didn\u0027t want to leave--we had to!\u0027\\n\\n \u0027Yeah?\u0027 said Ron, whose face was growing rather red. \u0027How come?\u0027\\n\\n \u0027It was Hagrid,\u0027 said Harry. \u0027He decided to tell us why he\u0027s been covered in injuries ever since he got back from the giants. He wanted us to go into the Forest with him, we had no choice, you know how he gets. Anyway ...\u0027\\n\\n The story was told in five minutes, by the end of which Ron\u0027s indignation had been replaced by a look of total incredulity.\\n\\n \u0027He brought one back and hid it in the Forest?\u0027\\n\\n \u0027Yep,\u0027 said Harry grimly.\\n\\n \u0027No,\u0027 said Ron, as though by saying this he could make it untrue. \u0027No, he can\u0027t have.\u0027\\n\\n \u0027Well, he has,\u0027 said Hermione firmly. \u0027Grawp\u0027s about sixteen feet tall, enjoys ripping up twenty-foot pine trees, and knows me,\u0027 she snorted, \u0027as Hermy.\u0027\\n\\n Ron gave a nervous laugh.\\n\\n \u0027And Hagrid wants us to ... ?\u0027\\n\\n \u0027Teach him English, yeah,\u0027 said Harry.\\n\\n \u0027He\u0027s lost his mind,\u0027 said Ron in an almost awed voice.\\n\\n \u0027Yes,\u0027 said Hermione irritably, turning a page of Intermediate Transfiguration and glaring at a series of diagrams showing an owl turning into a pair of opera glasses. \u0027Yes, I\u0027m starting to think he has. But, unfortunately, he made Harry and me promise.\u0027\\n\\n \u0027Well, you\u0027re just going to have to break your promise, that\u0027s all,\u0027 said Ron firmly. \u0027I mean, come on ... we\u0027ve got exams and we\u0027re about that far--\u0027 he held up his hand to show thumb and forefinger almost touching \u0027--from being chucked out as it is. And anyway ... remember Norbert? Remember Aragog? Have we ever come off better for mixing with any of Hagrid\u0027s monster mates?\u0027\\n\\n \u0027I know, it\u0027s just that--we promised,\u0027 said Hermione in a small voice.\\n\\n Ron smoothed his hair flat again, looking preoccupied.\\n\\n \u0027Well,\u0027 he sighed, \u0027Hagrid hasn\u0027t been sacked yet, has he? He\u0027s hung on this long, maybe he\u0027ll hang on till the end of term and we won\u0027t have to go near Grawp at all.\u0027\\n\\n The castle grounds were gleaming in the sunlight as though freshly painted; the cloudless sky smiled at itself in the smoothly sparkling lake; the satin green lawns rippled occasionally in a gentle breeze. June had arrived, but to the fifth-years this meant only one thing: their OWLs were upon them at last.\\n\\n Their teachers were no longer setting them homework; lessons were devoted to revising those topics the teachers thought most likely to come up in the exams. The purposeful, feverish atmosphere drove nearly everything but the OWLs from Harry\u0027s mind, though he did wonder occasionally during Potions lessons whether Lupin had ever told Snape that he must continue giving Harry Ooclumency tuition. If he had, then Snape had ignored Lupin as thoroughly as he was now ignoring Harry. This suited Harry very well; he was quite busy and tense enough without extra classes with Snape, and to his relief Hermione was much too preoccupied these days to badger him about Occlumency; she was spending a lot of time muttering to herself, and had not laid out any elf clothes for days.\\n\\n She was not the only person acting oddly as the OWLs drew steadily nearer. Ernie Macmillan had developed an irritating habit of interrogating people about their revision practices.\\n\\n \u0027How many hours d\u0027you think you\u0027re doing a day?\u0027 he demanded of Harry and Ron as they queued outside Herbology, a manic gleam in his eyes.\\n\\n \u0027I dunno,\u0027 said Ron. \u0027A few.\u0027\\n\\n \u0027More or less than eight?\u0027\\n\\n \u0027Less, I s\u0027pose,\u0027 said Ron, looking slightly alarmed.\\n\\n \u0027I\u0027m doing eight,\u0027 said Ernie, puffing out his chest. \u0027Eight or nine. I\u0027m getting an hour in before breakfast every day. Eights my average. I can do ten on a good weekend day. I did nine and a half on Monday. Not so good on Tuesday--only seven and a quarter. Then on Wednesday--\u0027\\n\\n Harry was deeply thankful that Professor Sprout ushered them into greenhouse three at that point, forcing Ernie to abandon his recital.\\n\\n Meanwhile, Draco Malfoy had found a different way to induce panic.\\n\\n \u0027Of course, it\u0027s not what you know,\u0027 he was heard to tell Crabbe and Goyle loudly outside Potions a few days before the exams were to start, \u0027it\u0027s who you know. Now, Father\u0027s been friendly with the head of the Wizarding Examinations Authority for years--old Griselda Marchbanks--we\u0027ve had her round for dinner and everthing ...\u0027\\n\\n \u0027Do you think that\u0027s true?\u0027 Hermione whispered in alarm to Harry and Ron.\\n\\n \u0027Nothing we can do about it if it is,\u0027 said Ron gloomily.\\n\\n \u0027I don\u0027t think it\u0027s true,\u0027 said Neville quietly from behind them. \u0027Because Griselda Marchbanks is a friend of my gran\u0027s, and she\u0027s never mentioned the Malfoy\u0027s.\u0027\\n\\n \u0027What\u0027s she like, Neville?\u0027 asked Hermione at once. \u0027Is she strict?\u0027\\n\\n \u0027Bit like Gran, really,\u0027 said Neville in a subdued voice.\\n\\n \u0027Knowing her won\u0027t hurt your chances, though, will it?\u0027 Ron told him encouragingly.\\n\\n \u0027Oh, I don\u0027t think it will make any difference,\u0027 said Neville, still more miserably. \u0027Gran\u0027s always telling Professor Marchbanks I\u0027m not as good as my dad ... well ... you saw what she\u0027s like at St. Mungo\u0027s ...\u0027\\n\\n Neville looked fixedly at the floor. Harry, Ron and Hermione glanced at each other, but didn\u0027t know what to say. It was the first time Neville had acknowledged that they had met at the wizarding hospital.\\n\\n Meanwhile, a flourishing black-market trade in aids to concentration, mental agility and wakefulness had sprung up among the fifth- and seventh-years. Harry and Ron were much tempted by the bottle of Baruffio\u0027s Brain Elixir offered to them by Ravenclaw sixth-year Eddie Carmichael, who swore it was solely responsible for the nine \u0027Outstanding\u0027 OWLs he had gained the previous summer and was offering a whole pint for a mere twelve Galleons. Ron assured Harry he would reimburse him for his half the moment he left Hogwarts and got a job, but before they could close the deal, Hermione had confiscated the bottle from Carmichael and poured the contents down a toilet.\\n\\n \u0027Hermione, we wanted to buy that!\u0027 shouted Ron.\\n\\n \u0027Don\u0027t be stupid,\u0027 she snarled. \u0027You might as well take Harold Dingle\u0027s powdered dragon claw and have done with it.\u0027\\n\\n \u0027Dingle\u0027s got powdered dragon claw?\u0027 said Ron eagerly.\\n\\n \u0027Not any more,\u0027 said Hermione. \u0027I confiscated that, too. None of these things actually work, you know.\u0027\\n\\n \u0027Dragon claw does work!\u0027 said Ron. \u0027It\u0027s supposed to be incredible, really gives your brain a boost, you come over all cunning for a few hours--Hermione, let me have a pinch, go on, it can\u0027t hurt--\u0027\\n\\n \u0027This stuff can,\u0027 said Hermione grimly. \u0027I\u0027ve had a look at it, and it\u0027s actually dried doxy droppings.\u0027\\n\\n This information took the edge off Harry and Ron\u0027s desire for brain stimulants.\\n\\n They received their examination timetables and details of the procedure for OWLs during their next Transfiguration lesson.\\n\\n \u0027As you can see,\u0027 Professor McGonagall told the class as they copied down the dates and times of their exams from the blackboard, \u0027your OWLs are spread over two successive weeks. You will sit the theory papers in the mornings and the practice in the afternoons. Your practical Astronomy examination will, of course, take place at night.\\n\\n \u0027Now, I must warn you that the most stringent anti-cheating charms have been applied to your examination papers. Auto-Answer Quills are banned from the examination hall, as are Remembralls, Detachable Cribbing Cuffs and Self-Correcting Ink. Every year, I am afraid to say, seems to harbour at least one student who thinks that he or she can get around the Wizarding Examinations Authority\u0027s rules. I can only hope that it is nobody in Gryffindor. Our new--Headmistress--\u0027 Professor McGonagall pronounced the word with the same look on her face that Aunt Petunia had whenever she was contemplating a particularly stubborn bit of dirt \u0027--has asked the Heads of House to tell their students that cheating will be punished most severely--because, of course, your examination results will reflect upon the Headmistress\u0027s new regime at the school--\u0027\\n\\n Professor McGonagall gave a tiny sigh; Harry saw the nostrils of her sharp nose flare.\\n\\n \u0027--however, that is no reason not to do your very best. You have your own futures to think about.\u0027\\n\\n \u0027Please, Professor,\u0027 said Hermione, her hand in the air, \u0027when will we find out our results?\u0027\\n\\n \u0027An owl will be sent to you some time in July,\u0027 said Professcr McGonagall.\\n\\n \u0027Excellent,\u0027 said Dean Thomas in an audible whisper, \u0027so we don\u0027t have to worry about it till the holidays.\u0027\\n\\n Harry imagined sitting in his bedroom in Privet Drive in six weeks\u0027 time, waiting for his OWL results. Well, he thought dully, at least he would be sure of one bit of post that summer.\\n\\n Their first examination, Theory of Charms, was scheduled for Monday morning. Harry agreed to test Hermione after lunch on Sunday, but regretted it almost at once; she was very agitated and kept snatching the book back from him to check that she had got the answer completely right, finally hitting him hard on the nose with the sharp edge of Achievements in Charming.\\n\\n \u0027Why don\u0027t you just do it yourself?\u0027 he said firmly, handing the book back to her, his eyes watering.\\n\\n Meanwhile, Ron was reading two years\u0027 worth of Charms notes with his fingers in his ears, his lips moving soundlessly; Seamus Finnigan was lying flat on his back on the floor, reciting the definition of a Substantive Charm while Dean checked it against The Standard Book of Spells, Grade 5; and Parvati and Lavender, who were practising basic Locomotion Charms, were making their pencil-cases race each other around the edge of the table.\\n\\n Dinner was a subdued affair that night. Harry and Ron did not talk much, but ate with gusto, having studied hard all day. Hermione, on the other hand, kept putting down her knife and fork and diving under the table for her bag, from which she would seize a book to check some fact or figure. Ron was just telling her that she ought to eat a decent meal or she would not sleep that night, when her fork slid from her limp fingers and landed with a loud tinkle on her plate.\\n\\n \u0027Oh, my goodness,\u0027 she said faintly, staring into the Entrance Hall. \u0027Is that them? Is that the examiners?\u0027\\n\\n Harry and Ron whipped around on their bench. Through the doors to the Great Hall they could see Umbridge standing with a small group of ancient-looking witches and wizards. Umbridge, Harry was pleased to see, looked rather nervous.\\n\\n \u0027Shall we go and have a closer look?\u0027 said Ron.\\n\\n Harry and Hermione nodded and they hastened towards the double doors into the Entrance Hall, slowing down as they stepped over the threshold to walk sedately past the examiners. Harry thought Professor Marchbanks must be the tiny, stooped witch with a face so lined it looked as though it had been draped in cobwebs; Umbridge was speaking to her deferentially. Professor Marchbanks seemed to be a little deaf; she was answering Professor Umbridge very loudly considering they were only a foot apart.\\n\\n \u0027Journey was fine, journey was fine, we\u0027ve made it plenty of times before!\u0027 she said impatiently. \u0027Now, I haven\u0027t heard from Dumbledore lately!\u0027 she added, peering around the Hall as though hopeful he might suddenly emerge from a broom cupboard. \u0027No idea where he is, I suppose?\u0027\\n\\n \u0027None at all,\u0027 said Umbridge, shooting a malevolent look at Harry, Ron and Hermione, who were now dawdling around the foot of the stairs as Ron pretended to do up his shoelace. \u0027But I daresay the Ministry of Magic will track him down soon enough.\u0027\\n\\n \u0027I doubt it,\u0027 shouted tiny Professor Marchbanks, \u0027not it Dumbledore doesn\u0027t want to be found! I should know ... examined him personally in Transfiguration and Charms when he did NEWTs ... did things with a wand I\u0027d never seen before.\u0027\\n\\n \u0027Yes ... well ...\u0027 said Professor Umbridge as Harry, Ron and Hermione dragged their feet up the marble staircase as slowly as they dared, \u0027let me show you to the staff room. I daresay you\u0027d like a cup of tea after your journey.\u0027\\n\\n It was an uncomfortable sort of an evening. Everyone was trying to do some last-minute revising but nobody seemed to be getting very far. Harry went to bed early but then lay awake for what felt like hours. He remembered his careers consultation and McGonagall\u0027s furious declaration that she would help him become an Auror if it was the last thing she did. He wished he had expressed a more achievable ambition now that exam time was here. He knew he was not the only one lying awake, but none of the others in the dormitory spoke and finally, one by one, they fell asleep.\\n\\n None of the fifth-years talked very much at breakfast next day, either: Parvati was practising incantations under her breath while the salt cellar in front of her twitched; Hermione was rereading Achievements in Charming so fast that her eyes appeared blurred; and Neville kept dropping his knife and fork and knocking over the marmalade.\\n\\n Once breakfast was over, the fifth- and seventh-years milled around in the Entrance Hall while the other students went off to lessons; then, at half past nine, they were called forwards class by class to re-enter the Great Hall, which had been rearranged exactly as Harry had seen it in the Pensieve when his father, Sirius and Snape had been taking their OWLs; the four house tables had been removed and replaced instead with many tables for one, all facing the staff-table end of the Hall where Professor McGonagall stood facing them. When they were all seated and quiet, she said, \u0027You may begin,\u0027 and turned over an enormous hour-glass on the desk beside her, on which there were also spare quills, ink bottles and rolls of parchment.\\n\\n Harry turned over his paper, his heart thumping hard--three rows to his right and four seats ahead Hermione was already scribbling--and lowered his eyes to the first question: a) Give the incantation and b) describe the wand movement required to make objects fly.\\n\\n Harry had a fleeting memory of a club soaring high into the air and landing loudly on the thick skull of a troll ... smiling slightly, he bent over the paper and began to write.\\n\\n \u0027Well, it wasn\u0027t too bad, was it?\u0027 asked Hermione anxiously in the Entrance Hall two hours later, still clutching the exam paper. \u0027I\u0027m not sure I did myself justice on Cheering Charms, I just ran out of time. Did you put in the counter-charm for hiccoughs? I wasn\u0027t sure whether I ought to, it felt like too much--and on question twenty-three--\u0027\\n\\n \u0027Hermione,\u0027 said Ron sternly, \u0027we\u0027ve been through this before ... we\u0027re not going through every exam afterwards, it\u0027s bad enough doing them once.\u0027\\n\\n The fifth-years ate lunch with the rest of the school (the four house tables had reappeared for the lunch hour), then they trooped off into the small chamber beside the Great Hall, where they were to wait until called for their practical examination. As small groups of students were called forwards in alphabetical order, those left behind muttered incantations and practised wand movements, occasionally poking each other in the back or eye by mistake.\\n\\n Hermione\u0027s name was called. Trembling, she left the chamber with Anthony Goldstein, Gregory Goyle and Daphne Greengrass. Students who had already been tested did not return afterwards, so Harry and Ron had no idea how Hermione had done.\\n\\n \u0027She\u0027ll be fine, remember she got a hundred and twelve per cent on one of our Charms tests?\u0027 said Ron.\\n\\n Ten minutes later, Professor Flitwick called, \u0027Parkinson, Pansy--Patil, Padma--Patil, Parvati--Potter, Harry.\u0027\\n\\n \u0027Good luck,\u0027 said Ron quietly. Harry walked into the Great Hall, clutching his wand so tightly his hand shook.\\n\\n \u0027Professor Tofty is free, Potter,\u0027 squeaked Professor Flitwick, who was standing just inside the door. He pointed Harry towards what looked like the very oldest and baldest examiner who was sitting behind a small table in a far corner, a short distance from Professor Marchbanks, who was halfway through testing Draco Malfoy.\\n\\n \u0027Potter, is it?\u0027 said Professor Tofty, consulting his notes and peering over his pince-nez at Harry as he approached. \u0027The famous Potter?\u0027\\n\\n Out of the corner of his eye, Harry distinctly saw Malfoy throw a scathing look over at him; the wine-glass Malfoy had been levitating fell to the floor and smashed. Harry could not suppress a grin; Professor Tofty smiled back at him encouragingly.\\n\\n \u0027That\u0027s it,\u0027 he said in his quavery old voice, \u0027no need to be nervous. Now, if I could ask you to take this egg cup and make it do some cartwheels for me.\u0027\\n\\n On the whole, Harry thought it went rather well. His Levitation Charm was certainly much better than Malfoy\u0027s had been, though he wished he had not mixed up the incantations for Colour Change and Growth Charms, so that the rat he was supposed to be turning orange swelled shockingly and was the size of a badger before Harry could rectify his mistake. He was glad Hermione had not been in the Hall at the time and neglected to mention it to her afterwards. He could tell Ron, though; Ron had caused a dinner plate to mutate into a large mushroom and had no idea how it had happened.\\n\\n There was no time to relax that night; they went straight to the common room after dinner and submerged themselves in revision for Transfiguration next day; Harry went to bed with his head buzzing with complex spell models and theories.\\n\\n He forgot the definition of a Switching Spell during his written paper next morning but thought his practical could have been a lot worse. At least he managed to Vanish the whole of his iguana, whereas poor Hannah Abbott lost her head completely at the next table and somehow managed to multiply her ferret into a flock of flamingos, causing the examination to be halted for ten minute; while the birds were captured and carried out of the Hall.\\n\\n They had their Herbology exam on Wednesday (other than a small bite from a Fanged Geranium, Harry felt he had done reasonably well); and then, on Thursday, Defence Against the Dark Arts. Here, for the first time, Harry felt sure he had passed. He had no problem with any of the written questions and took particular pleasure, during the practical examination, in performing all the counter-jinxes and defensive spells right in front of Umbridge, who was watching coolly from near the doors into the Entrance Hall.\\n\\n \u0027Oh, bravo!\u0027 cried Professor Tolty, who was examining Harry again, when Harry demonstrated a perfect boggart banishing spell. \u0027Very good indeed! Well, I think that\u0027s all, Potter ... unless ...\u0027\\n\\n He leaned forwards a little.\\n\\n \u0027I heard, from my dear friend Tiberius Ogden, that you can produce a Patronus? For a bonus point ... ?\u0027\\n\\n Harry raised his wand, looked directly at Umbridge and imagined her being sacked.\\n\\n \u0027Expecto patronum!\u0027\\n\\n His silver stag erupted from the end of his wand and cantered the length of the Hall. All of the examiners looked around to watch its progress and when it dissolved into silver mist Professor Tofty clapped his veined and knotted hands enthusiastically.\\n\\n \u0027Excellent!\u0027 he said. \u0027Very well, Potter, you may go!\u0027\\n\\n As Harry passed Umbridge beside the door, their eyes met. There was a nasty smile playing around her wide, slack mouth, but he did not care. Unless he was very much mistaken (and he was not planning on telling anybody, in case he was), he had just achieved an \u0027Outstanding\u0027 OWL.\\n\\n On Friday, Harry and Ron had a day off while Hermione sat her Ancient Runes exam, and as they had the whole weekend in front of them they permitted themselves a break from revision. They stretched and yawned beside the open window, through which warm summer air was wafting as they played wizard chess. Harry could see Hagrid in the distance, teaching a class on the edge of the Forest. He was trying to guess what creatures they were examining--he thought it must be unicorns, because the boys seemed to be standing back a little--when the portrait hole opened and Hermione clambered in, looking thoroughly bad-tempered.\\n\\n \u0027How were the Runes?\u0027 said Ron, yawning and stretching.\\n\\n \u0027I mis-translated ehwaz,\u0027 said Hermione furiously. \u0027It means partnership, not defence,I mixed it up with eihwaz.\u0027\\n\\n \u0027Ah well,\u0027 said Ron lazily, \u0027that\u0027s only one mistake, isn\u0027t it, you\u0027ll still get--\u0027\\n\\n \u0027Oh, shut up!\u0027 said Hermione angrily. \u0027It could be the one mistake that makes the difference between a pass and a fail. And what\u0027s more, someone\u0027s put another Niffler in Umbridge\u0027s office. I don\u0027t know how they got it through that new door, but I just walked past there and Umbridge is shrieking her head off--by the sound of it, it tried to take a chunk out of her leg--\u0027\\n\\n \u0027Good,\u0027 said Harry and Ron together.\\n\\n \u0027It is not good!\u0027 said Hermione hotly. \u0027She thinks it\u0027s Hagrid doing it, remember? And we do not want Hagrid chucked out!\u0027\\n\\n \u0027He\u0027s teaching at the moment; she can\u0027t blame him,\u0027 said Harry, gesturing out of the window.\\n\\n \u0027Oh, you\u0027re so naive sometimes, Harry. You really think Umbridge will wait for proof?\u0027 said Hermione, who seemed determined to be in a towering temper, and she swept off towards the girls\u0027 dormitories, banging the door behind her.\\n\\n \u0027Such a lovely, sweet-tempered girl,\u0027 said Ron, very quietly, prodding his queen forward to beat up one of Harry\u0027s knights.\\n\\n Hermione\u0027s bad mood persisted for most of the weekend, though Harry and Ron found it quite easy to ignore as they spent most of Saturday and Sunday revising for Potions on Monday, the exam which Harry had been looking forward to least--and which he was sure would be the downfall of his ambitions to become an Auror. Sure enough, he found the written paper difficult, though he thought he might have got full marks on the question about Polyjuice Potion; he could describe its effects accurately, having taken it illegally in his second year.\\n\\n The afternoon practical was not as dreadful as he had expected, it to be. With Snape absent from the proceedings, he found that he was much more relaxed than he usually was while making potions. Neville, who was sitting very near Harry, also looked happier than Harry had ever seen him during a Potions class. When Professor Marchbanks said, \u0027Step away from your cauldrons, please, the examination is over,\u0027 Harry corked his sample flask feeling that he might not have achieved a good grade but he had, with luck, avoided a fail.\\n\\n \u0027Only four exams left,\u0027 said Parvati Patil wearily as they headed back to Gryffindor common room.\\n\\n \u0027Only!\u0027 said Hermione snappishly. \u0027I\u0027ve got Arithmancy and it\u0027s probably the toughest subject there is!\u0027\\n\\n Nobody was foolish enough to snap back, so she was unable to vent her spleen on any of them and was reduced to telling off some first-years for giggling too loudly in the common room.\\n\\n Harry was determined to perform well in Tuesday\u0027s Care of Magical Creatures exam so as not to let Hagrid down. The practical examination took place in the afternoon on the lawn on the edge of the Forbidden Forest, where students were required to correctly identify the Knarl hidden among a dozen hedgehogs (the trick was to offer them all milk in turn: Knarls, highly suspicious creatures whose quills had many magical properties, generally went berserk at what they saw as an attempt to poison them); then demonstrate correct handling of a Bowtruckle; feed and clean out a Fire Crab without sustaining serious burns; and choose, from a wide selection of food, the diet they would give a sick unicorn.\\n\\n Harry could see Hagrid watching anxiously out of his cabin window. When Harry\u0027s examiner, a plump little witch this time, smiled at him and told him he could leave, Harry gave Hagrid a fleeting thumbs-up before heading back to the castle.\\n\\n The Astronomy theory paper on Wednesday morning went well enough. Harry was not convinced he had got the names of all Jupiter\u0027s moons right, but was at least confident that none of them was inhabited by mice. They had to wait until evening for their practical Astronomy; the afternoon was devoted instead to Divination.\\n\\n Even by Harry\u0027s low standards in Divination, the exam went very badly. He might as well have tried to see moving pictures on the desktop as in the stubbornly blank crystal ball; he lost his head completely during tea-leaf reading, saying it looked to him as though Professor Marchbanks would shortly be meeting a round, dark, soggy stranger, and rounded off the whole fiasco by mixing up the life and head lines on her palm and informing her that she ought to have died the previous Tuesday.\\n\\n \u0027Well, we were always going to fail that one,\u0027 said Ron gloomily as they ascended the marble staircase. He had just made Harry feel rather better by telling him how he had told the examiner in detail about the ugly man with a wart on his nose in his crystal ball, only to look up and realise he had been describing his examiner\u0027s reflection.\\n\\n \u0027We shouldn\u0027t have taken the stupid subject in the first place,\u0027 said Harry.\\n\\n \u0027Still, at least we can give it up now.\u0027\\n\\n \u0027Yeah,\u0027 said Harry. \u0027No more pretending we care what happens when Jupiter and Uranus get too friendly.\u0027\\n\\n \u0027And from now on, I don\u0027t care if my tea-leaves spell die, Ron, die--I\u0027m just chucking them in the bin where they belong.\u0027\\n\\n Harry laughed just as Hermione came running up behind them. He stopped laughing at once, in case it annoyed her.\\n\\n \u0027Well, I think I\u0027ve done all right in Arithmancy,\u0027 she said, and Harry and Ron both sighed with relief. \u0027Just time for a quick look over our star-charts before dinner, then ...\u0027\\n\\n When they reached the top of the Astronomy Tower at eleven o\u0027clock, they found a perfect night for stargazing, cloudless and still. The grounds were bathed in silvery moonlight and there was a slight chill in the air. Each of them set up his or her telescope and, when Professor Marchbanks gave the word, proceeded to fill in the blank star-chart they had been given.\\n\\n Professors Marchbanks and Tofty strolled among them, watching as they entered the precise positions of the stars and planets they were observing. All was quiet except for the rustle of parchment, the occasional creak of a telescope as it was adjusted on its stand, and the scribbling of many quills. Half an hour passed, then ar hour; the little squares of reflected gold light flickering on the: ground below started to vanish as lights in the castle windows were extinguished.\\n\\n As Harry completed the constellation Orion on his chart, however, the front doors of the castle opened directly below the parapet where he was standing, so that light spilled down the stone steps a little way across the lawn. Harry glanced down as he made a slight adjustment to the position of his telescope and saw five or six elongated shadows moving over the brightly lit grass before the doors swung shut and the lawn became a sea of darkness once more.\\n\\n Harry put his eye back to his telescope and refocused it, now examining Venus. He looked down at his chart to enter the planet there, but something distracted him; pausing with his quill suspended over the parchment, he squinted down into the shadowy grounds and saw half a dozen figures walking over the lawn. If they had not been moving, and the moonlight had not been gilding the tops of their heads, they would have been indistinguishable from the dark ground on which they walked. Even at this distance, Harry had a funny feeling he recognised the walk of the squattest of them, who seemed to be leading the group.\\n\\n He could not think why Umbridge would be taking a stroll outside after midnight, much less accompanied by five others. Then somebody coughed behind him, and he remembered that he was halfway through an exam. He had quite forgotten Venus\u0027s position. Jamming his eye to his telescope, he found it again and was once more about to enter it on his chart when, alert for any odd sound, he heard a distant knock which echoed through the deserted grounds, followed immediately by the muffled barking of a large dog.\\n\\n He looked up, his heart hammering. There were lights on in Hagrid\u0027s windows and the people he had observed crossing the lawn were now silhouetted against them. The door opened and he distinctly saw six sharply defined figures walk over the threshold. The door closed again and there was silence.\\n\\n Harry felt very uneasy. He glanced around to see whether Ron or Hermione had noticed what he had, but Professor Marchbanks came walking behind him at that moment and, not wanting to look as though he was sneaking looks at anyone else\u0027s work, Harry hastily bent over his star-chart and pretended to be adding notes to it while really peering over the top of the parapet towards Hagrid\u0027s cabin. Figures were now moving across the cabin windows, temporarily blocking the light.\\n\\n He could feel Professor Marchbanks\u0027s eyes on the back of his neck and pressed his eye again to his telescope, staring up at the moon though he had marked its position an hour ago, but as Professor Marchbanks moved on he heard a roar from the distant cabin that echoed through the darkness right to the top of the Astronomy Tower. Several of the people around Harry ducked out from behind their telescopes and peered instead in the direction of Hagrid\u0027s cabin.\\n\\n Professor Tofty gave another dry little cough.\\n\\n \u0027Try and concentrate, now, boys and girls,\u0027 he said softly.\\n\\n Most people returned to their telescopes. Harry looked to his left. Hermione was gazing transfixed at Hagrid\u0027s cabin.\\n\\n \u0027Ahem--twenty minutes to go,\u0027 said Professor Tofty.\\n\\n Hermione jumped and returned at once to her star-chart; Harry looked down at his own and noticed that he had mis-labelled Venus as Mars. He bent to correct it.\\n\\n There was a loud BANG from the grounds. Several people cried \u0027Ouch!\u0027 when they poked themselves in the face with the ends of their telescopes as they hastened to see what was going on below.\\n\\n Hagrid\u0027s door had burst open and by the light flooding out of the cabin they saw him quite clearly, a massive figure roaring and brandishing his fists, surrounded by six people, all of whom, judging by the tiny threads of red light they were casting in his direction, seemed to be attempting to Stun him.\\n\\n \u0027No!\u0027 cried Hermione.\\n\\n \u0027My dear!\u0027 said Professor Tofty in a scandalised voice. \u0027This is an examination!\u0027\\n\\n But nobody was paying the slightest attention to their star-charts any more. Jets of red light were still flying about beside Hagrid\u0027s cabin, yet somehow they seemed to be bouncing off him; he was still upright and still, as far as Harry could see, fighting. Cries and yells echoed across the grounds; a man yelled, \u0027Be reasonable, Hagrid!\u0027\\n\\n Hagrid roared, \u0027Reasonable be damned, yeh won\u0027 take me like this, Dawlish!\u0027\\n\\n Harry could see the tiny outline of Fang, attempting to defend Hagrid, leaping repeatedly at the wizards surrounding him until a Stunning Spell caught him and he fell to the ground. Hagrid gave a howl of fury, lifted the culprit bodily from the ground and threw him; the man flew what looked like ten feet and did not get up again. Hermione gasped, both hands over her mouth; Harry looked round at Ron and saw that he, too, was looking scared. None of them had ever seen Hagrid in a real temper before.\\n\\n \u0027Look!\u0027 squealed Parvati, who was leaning over the parapet and pointing to the foot of the castle where the front doors had opened again; more light was spilling out on to the dark lawn and a single long black shadow was now rippling across the lawn.\\n\\n \u0027Now, really!\u0027 said Professor Tofty anxiously. \u0027Only sixteen minutes left, you know!\u0027\\n\\n But nobody paid him the slightest attention: they were watching the person now sprinting towards the battle beside Hagrid\u0027s cabin.\\n\\n \u0027How dare you!\u0027 the figure shouted as she ran. \u0027How dare you!\u0027\\n\\n \u0027It\u0027s McGonagall!\u0027 whispered Hermione.\\n\\n \u0027Leave him alone! Alone,I say!\u0027 said Professor McGonagall\u0027s voice through the darkness. \u0027On what grounds are you attacking him? He has done nothing, nothing to warrant such--\u0027\\n\\n Hermione, Parvati and Lavender all screamed. The figures around the cabin had shot no fewer than four Stunners at Professor McGonagall. Halfway between cabin and castle the red beams collided with her; for a moment she looked luminous and glowed an eerie red, then she lifted right off her feet, landed hard on her back, and moved no more.\\n\\n \u0027Galloping gargoyles!\u0027 shouted Professor Tofty, who also seemed to have forgotten the exam completely. \u0027Not so much as a warning! Outrageous behaviour!\u0027\\n\\n \u0027COWARDS!\u0027 bellowed Hagrid; his voice carried clearly to the top of the tower, and several lights flickered back on inside the castle. \u0027RUDDY COWARDS! HAVE SOME O\u0027 THAT-- AN\u0027 THAT--\u0027\\n\\n \u0027Oh my--\u0027 gasped Hermione.\\n\\n Hagrid took two massive swipes at his closest attackers; judging by their immediate collapse, they had been knocked cold. Harry saw Hagrid double over, and thought he had finally been overcome by a spell. But, on the contrary, next moment Hagrid was standing again with what appeared to be a sack on his back--then Harry realised that bangs limp body was draped around his shoulders.\\n\\n \u0027Get him, get him!\u0027 screamed Umbridge, but her remaining helper seemed highly reluctant to go within reach of Hagrid\u0027s fists; indeed, he was backing away so fast he tripped over one of his unconscious colleagues and fell over. Hagrid had turned and begun to run with Fang still hung around his neck. Umbridge sent one last Stunning Spell after him but it missed; and Hagrid, running full-pelt towards the distant gates, disappeared into the darkness.\\n\\n There was a long minute\u0027s quivering silence as everybody gazed open-mouthed into the grounds. Then Professor Tofty\u0027s voice said feebly, \u0027Um ... five minutes to go, everybody.\u0027\\n\\n Though he had only filled in two-thirds of his chart, Harry was desperate for the exam to end. When it came at last he, Ron and Hermione forced their telescopes haphazardly back into their holders and dashed back down the spiral staircase. None of the students were going to bed; they were all talking loudly and excitedly at the foot of the stairs about what they had witnessed.\\n\\n \u0027That evil woman!\u0027 gasped Hermione, who seemed to be having difficulty talking due to rage. \u0027Trying to sneak up on Hagrid in the dead of night!\u0027\\n\\n \u0027She clearly wanted to avoid another scene like Trelawney\u0027s,\u0027 said Ernie Macmillan sagely, squeezing over to join them.\\n\\n \u0027Hagrid did well, didn\u0027t he?\u0027 said Ron, who looked more alarmed than impressed. \u0027How come all the spells bounced off him?\u0027\\n\\n \u0027It\u0027ll be his giant blood,\u0027 said Hermione shakily. \u0027Its very hard to Stun a giant, they\u0027re like trolls, really tough ... but poor Professor McGonagall ... four Stunners straight in the chest and she\u0027s not exactly young, is she?\u0027\\n\\n \u0027Dreadful, dreadful,\u0027 said Ernie, shaking his head pompously. \u0027Well, I\u0027m off to bed. Night, all.\u0027\\n\\n People around them were drifting away, still talking excitedly about what they had just seen.\\n\\n \u0027At least they didn\u0027t get to take Hagrid off to Azkaban,\u0027 said Ron. \u0027I \u0027spect he\u0027s gone to join Dumbledore, hasn\u0027t he?\u0027\\n\\n \u0027I suppose so,\u0027 said Hermione, who looked tearful. \u0027Oh, this is awful, I really thought Dumbledore would be back before long, but now we\u0027ve lost Hagrid too.\u0027\\n\\n They traipsed back to the Gryffindor common room to find it full. The commotion out in the grounds had woken several people, who had hastened to rouse their friends. Seamus and Dean, who had arrived ahead of Harry, Ron and Hermione, were now telling everyone what they had seen and heard from the top of the Astronomy Tower.\\n\\n \u0027But why sack Hagrid now?\u0027 asked Angelina Johnson, shaking her head. \u0027It\u0027s not like Trelawney; he\u0027s been teaching much better than usual this year!\u0027\\n\\n \u0027Urnbridge hates part-humans,\u0027 said Hermione bitterly, flopping down into an armchair. \u0027She was always going to try and get Hagrid out.\u0027\\n\\n \u0027And she thought Hagrid was putting Nifflers in her office,\u0027 piped up Katie Bell.\\n\\n \u0027Oh, blimey,\u0027 said Lee Jordan, covering his mouth. \u0027It\u0027s me who\u0027s been putting the Nifflers in her office. Fred and George left me a couple; I\u0027ve been levitating them in through her window.\u0027\\n\\n \u0027She\u0027d have sacked him anyway,\u0027 said Dean. \u0027He was too close to Dumbledore.\u0027\\n\\n \u0027That\u0027s true,\u0027 said Harry, sinking into an armchair beside Hermione\u0027s.\\n\\n \u0027I just hope Professor McGonagall\u0027s all right,\u0027 said Lavender tearfully.\\n\\n \u0027They carried her back up to the castle, we watched through the dormitory window,\u0027 said Colin Creevey. \u0027She didn\u0027t look very well.\u0027\\n\\n \u0027Madam Pomfrey will sort her out,\u0027 said Alicia Spinnet firmly. \u0027She\u0027s never failed yet.\u0027\\n\\n It was nearly four in the morning before the common room cleared. Harry felt wide awake; the image of Hagrid sprinting away into the dark was haunting him; he was so angry with Umbridge he could not think of a punishment bad enough for her, though Ron\u0027s suggestion of having her fed to a box of starving Blast-Ended Skrewts had its merits. He fell asleep contemplating hideous revenges and arose from bed three hours later feeling distinctly unrested.\\n\\n Their final exam, History of Magic, was not to take place until that afternoon. Harry would very much have liked to go back to bed after breakfast, but he had been counting on the morning for a spot of last-minute revision, so instead he sat with his head in his hands by the common-room window, trying hard not to doze off as he read through some of the three-and-a-half-feet-high stack of notes that Hermione had lent him.\\n\\n The fifth-years entered the Great Hall at two o\u0027clock and took their places in front of their face-down examination papers. Harry felt exhausted. He just wanted this to be over, so that he could go and sleep; then tomorrow, he and Ron were going to go down to the Quidditch pitch--he was going to have a fly on Ron\u0027s broom--and savour their freedom from revision.\\n\\n \u0027Turn over your papers,\u0027 said Professor Marchbanks from the front of the Hall, flicking over the giant hour-glass. \u0027You may begin \u0027\\n\\n Harry stared fixedly at the first question. It was several seconds before it occurred to him that he had not taken in a word of it; there was a wasp buzzing distractingly against one of the high windows. Slowly, tortuously, he at last began to write an answer.\\n\\n He was finding it very difficult to remember names and kept confusing dates. He simply skipped question four (In your opinion, did wand legislation contribute to, or lead to better control of, goblin riots of the eighteenth century?), thinking that he would go back to it if he had time at the end. He had a stab at question five (How was the Statute of Secrecy breached in 1749 and what measures were introduced to prevent a recurrence?) but had a nagging suspicion that he had missed several important points; he had a feeling vampires had come into the story somewhere.\\n\\n He looked ahead for a question he could definitely answer and his eyes alighted upon number ten: Describe the circumstances that led to the formation of the International Confederation of Wizards and explain why the warlocks of Liechtenstein refused to join.\\n\\n I know this, Harry thought, though his brain felt torpid and slack. He could visualise a heading, in Hermione\u0027s handwriting: The formation of the International Confederation of Wizards ... he had read those notes only this morning.\\n\\n He began to write, looking up now and again to check the large hour-glass on the desk beside Professor Marchbanks. He was sitting right behind Parvati Patil, whose long dark hair fell below the back of her chair. Once or twice he found himself staring at the tiny golden lights that glistened in it when she moved her head slightly, and had to give his own head a little shake to clear it.\\n\\n ... the first Supreme Mugwump of the International Confederation of Wizards was Pierre Bonaccord, but his appointment was contested by the wizarding community of Liechtenstein, because--\\n\\n All around Harry quills were scratching on parchment like scurrying, burrowing rats. The sun was very hot on the back of his head. What was it that Bonaccord had done to offend the wizards of Liechtenstein? Harry had a feeling it had something to do with trolls ... he gazed blankly at the back of Parvati\u0027s head again. If he could only perform Legilimency and open a window in the back of her head and see what it was about trolls that had caused the breach between Pierre Bonaccord and Liechtenstein ...\\n\\n Harry closed his eyes and buried his face in his hands, so that the glowing red of his eyelids grew dark and cool. Bonaccord had wanted to stop troll-hunting and give the trolls rights ... but Liechtenstein was having problems with a tribe of particularly vicious mountain trolls ... that was it.\\n\\n He opened his eyes; they stung and watered at the sight of the blazing white parchment. Slowly, he wrote two lines about the trolls, then read through what he had done so far. It did not seem very informative or detailed, yet he was sure Hermione\u0027s notes on the Confederation had gone on for pages and pages.\\n\\n He closed his eyes again, trying to see them, trying to remember ... the Confederation had met for the first time in France, yes, he had written that already ...\\n\\n Goblins had tried to attend and been ousted ... he had written that, too ...\\n\\n And nobody from Liechtenstein had wanted to come ...\\n\\n Think, he told himself, his face in his hands, while all around him quills scratched out never-ending answers and the sand trickled through the hour-glass at the front ...\\n\\n He was walking along the cool, dark corridor to the Department of Mysteries again, walking with a firm and purposeful tread, breaking occasionally into a run, determined to reach his destination at last ... the black door swung open for him as usual, and here he was in the circular room with its many doors ...\\n\\n Straight across the stone floor and through the second door ... patches of dancing light on the walls and floor and that odd mechanical clicking, but no time to explore, he must hurry ...\\n\\n He jogged the last few feet to the third door, which swung open just like the others ...\\n\\n Once again he was in the cathedral-sized room full of shelves and glass spheres ... his heart was beating very fast now ... he was going to get there this time ... when he reached number ninety-seven he turned left and hurried along the aisle between two rows ...\\n\\n But there was a shape on the floor at the very end, a black shape moving on the floor like a wounded animal ... Harry\u0027s stomach contracted with fear ... with excitement ...\\n\\n A voice issued from his own mouth, a high, cold voice empty of any human kindness ...\\n\\n \u0027Take it for me ... lift it down, now ... I cannot touch it ... but you can ...\u0027\\n\\n The black shape on the floor shifted a little. Harry saw a long-fingered white hand clutching a wand rise at the end of his own arm ... heard the high, cold voice say \u0027Crucio!\u0027\\n\\n The man on the floor let out a scream of pain, attempted to stand but fell back, writhing. Harry was laughing. He raised his wand, the curse lifted and the figure groaned and became motionless.\\n\\n \u0027Lord Voldemort is waiting ...\u0027\\n\\n Very slowly, his arms trembling, the man on the ground raised his shoulders a few inches and lifted his head. His face was bloodstained and gaunt, twisted in pain yet rigid with defiance ...\\n\\n \u0027You\u0027ll have to kill me,\u0027 whispered Sirius.\\n\\n \u0027Undoubtedly I shall in the end,\u0027 said the cold voice. \u0027But you will fetch it for me first, Black ... you think you have felt pain thus far? Think again ... we have hours ahead of us and nobody to hear you scream ...\u0027\\n\\n But somebody screamed as Voldemort lowered his wand again; somebody yelled and fell sideways off a hot desk on to the cold stone floor; Harry awoke as he hit the ground, still yelling, his scar on fire, as the Great Hall erupted all around him. \\n\\n","sourceLink":"https://allnovel.net/harry-potter-and-the-order-of-the-phoenix-harry-potter-5/page-31.html","bookId":2072,"book":{"id":2072,"title":"Harry Potter and the Order of the Phoenix (Harry Potter #5)","description":"Storyline: Harry Potter and the Order of the Phoenix (Harry Potter #5) \\n \\n Grade 4 Up-Harry has just returned to Hogwarts after a lonely summer. Dumbledore is uncommunicative and most of the students seem to think Harry is either conceited or crazy for insisting that Voldemort is back and as evil as ever. Angry, scared, and unable to confide in his godfather, Sirius, the teen wizard lashes out at his friends and enemies alike. The head of the Ministry of Magic is determined to discredit Dumbledore and undermine his leadership of Hogwarts, and he appoints nasty, pink-cardigan-clad Professor Umbridge as the new Defense Against the Dark Arts teacher and High Inquisitor of the school, bringing misery upon staff and students alike. This bureaucratic nightmare, added to Harry\u0027s certain knowledge that Voldemort is becoming more powerful, creates a desperate, Kafkaesque feeling during Harry\u0027s fifth year at Hogwarts. The adults all seem evil, misguided, or simply powerless, so the students must take matters into their own hands. Harry\u0027s confusion about his godfather and father, and his apparent rejection by Dumbledore make him question his own motives and the condition of his soul. Also, Harry is now 15, and the hormones are beginning to kick in. There are a lot of secret doings, a little romance, and very little Quidditch or Hagrid (more reasons for Harry\u0027s gloom), but the power of this book comes from the young magician\u0027s struggles with his emotions and identity. Particularly moving is the unveiling, after a final devastating tragedy, of Dumbledore\u0027s very strong feelings of attachment and responsibility toward Harry. Children will enjoy the magic and the Hogwarts mystique, and young adult readers will find a rich and compelling coming-of-age story as well.\\n","cover":"https://allnovel.net/images/harry-potter-and-the-order-of-the-phoenix-harry-potter-5.jpg","author":"J.K. Rowling","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/harry-potter-and-the-order-of-the-phoenix-harry-potter-5.html","creation":"Oct 5, 2019 8:58:19 AM","modification":"Oct 6, 2019 12:27:42 AM"}}
