{"id":63147,"no":11,"title":"Page 11","content":"\"Yes?\"\n \"According to the computer, she hadn\u0027t paid anything since May. But her charges were low, so she still hadn\u0027t exceeded the amount of deposit.\"\n \"I see.\"\n \"If she\u0027ll supply us with her current address, we can forward the balance due to her. She may not want to be bothered, it only comes to four dollars and thirty-seven cents.\"\n I told her that was probably low on Paula\u0027s list of priorities. \"There\u0027s one other thing you could help me with,\" I said. \"Could you tell me the exact date when she requested termination of service?\"\n \"Just a moment,\" she said, and I waited. \"That was July twentieth,\" she said.\n That sounded wrong, and I checked my notebook to make sure. I was right- Paula had paid rent for the last time on the sixth, Florence Edderling had entered the room and found it empty on the fifteenth, and Georgia Price moved in on the eighteenth. That meant Paula would have waited a minimum of five days after quitting the premises before calling to have her telephone cut off. If she waited that long, why call at all? And, if she was going to call, why not provide a forwarding address?\n \"That doesn\u0027t square with my figures,\" I said. \"Is it possible that she requested termination earlier and it took a few days before the order was carried out?\"\n \"That\u0027s not how it works. When we receive a disconnect order, we put it through right away. We don\u0027t have to send somebody out to disconnect, you know. We do it electronically from a distance.\"\n \"That\u0027s strange. She\u0027d already vacated the premises.\"\n \"Just a minute. Let me punch it up on the screen again and see what it says.\" I didn\u0027t have a long wait. \"According to this,\" she said, \"the phone was still in service until we received instructions to disconnect on 7/20. Of course there\u0027s always the possibility of computer error.\"\n I had a cup of coffee and read through my notebook. Then I put through a collect call to Warren Hoeldtke at his auto showroom. I said, \"I\u0027ve run into a minor inconsistency here. I don\u0027t think it amounts to anything, but I want to check it out. What I\u0027d like to get from you is the date of your last telephone call to Paula.\"\n \"Let me see. It was sometime in late June, and-\"\n \"No, that was the last time you talked with her. But you called her several times after that, didn\u0027t you?\"\n \"Yes, and we were ultimately advised that the service had been disconnected.\"\n \"But first there were some calls where you reached her answering machine. I want to know when the last one of those went through.\"\n \"I see,\" he said. \"Gee. I\u0027m afraid I haven\u0027t got that kind of memory. It was toward the end of July when we took our trip, and right after we got back we called and learned the phone was disconnected, so that would have been the middle of last month. I think I told you all that.\"\n \"Yes.\"\n \"But as for our last call when we got the machine, that would have been before we left for the Black Hills, but I wouldn\u0027t be able to tell you the date.\"\n \"You\u0027ve probably got a record.\"\n \"Oh?\"\n \"Do you keep your phone bills?\"\n \"Of course. My accountant would have a fit if I didn\u0027t. Oh, I see. I was thinking there would be no record of a call if we didn\u0027t get through to her, but of course if the machine answered it would be a complete call. So it would be on our statement.\"\n \"That\u0027s right.\"\n \"I don\u0027t have the paid bills here, I\u0027m afraid. My wife will know right where they are, though. Do you have my home phone number?\" I said I did. \"Let me call her first,\" he said, \"so she\u0027ll have everything at hand when you call.\"\n \"While you\u0027re at it, tell her I\u0027ll be calling collect. I\u0027m at a pay phone.\"\n \"That\u0027s no problem. In fact, I have a better idea. Give me the number of the pay phone and she can call you.\"\n I was calling from a phone on the street and I didn\u0027t want to relinquish possession of it. After he rang off I stood there still holding the receiver to my ear so that I would look as though I were using the phone. I allowed a little time for Hoeldtke to reach his wife and another few minutes for her to thumb through her file of paid phone bills. Then, still holding the receiver to my ear, I hung one hand on the hook so she\u0027d be able to get through to me when she called. A couple of times someone would linger a few yards away, waiting to use the phone when I got off it. Each time I turned and said apologetically that I expected to be a while.\n The phone rang, though not before I\u0027d begun to tire of my little exercise in street theater. I said hello, and a confident female voice said, \"Hello, this is Betty Hoeldtke, and I\u0027m calling for Matthew Scudder.\" I identified myself and she said that her husband had told her what I was trying to determine. \"I have the July statement in front of me,\" she said. \"It shows three calls to Paula. Two of them were two-minute calls and one was three minutes. I was just now trying to imagine how it could have taken three minutes to leave a message asking her to call us, but of course first we would have had to listen to her message, wouldn\u0027t we? Although I sometimes think the phone company\u0027s computers bill you for more minutes than you actually stay on the phone.\"\n \"What were the dates of the calls, Mrs. Hoeldtke?\"\n \"July fifth, July twelfth, and July seventeenth. And I looked up the June calls, and the last time we spoke with Paula was June the nineteenth. That\u0027s on our statement because she would call us and we would call her back.\"\n \"Your husband told me about the code you used.\"\n \"I feel a little funny about it, although we weren\u0027t really cheating the phone company out of anything. But it always seems-\"\n \"Mrs. Hoeldtke, what was the date of the last call to Paula?\"\n \"July seventeenth. She usually called on a Sunday, and July fifth when we first called and got the machine was a Sunday, and then the twelfth was a week later, and the seventeenth, let me see- twelve thirteen fourteen fifteen sixteen seventeen, Sunday Monday, Tuesday Wednesday, Thursday Friday- the seventeenth would have been a Friday, and-\"\n \"You reached her answering machine on the seventeenth of July.\"\n \"We must have, because that was the three-minute conversation. I probably left a longer message than usual to tell her that we were leaving for the Dakotas the middle of next week, and to please call us before we left.\"\n \"Let me make some notes,\" I said, and jotted down what she\u0027d told me in my notebook. Something didn\u0027t add up. All it very likely meant was that somebody\u0027s records were wrong, but I would spend as much time as I had to ironing out the inconsistency, like a bank teller working three hours overtime to search out a ten-cent discrepancy.\n \"Mr. Scudder? What happened to Paula?\"\n \"I don\u0027t know, Mrs. Hoeldtke.\"\n \"I\u0027ve had the most awful feeling. I keep having the thought that she\u0027s-\" The pause stretched. \"Dead,\" she said.\n \"There\u0027s no evidence of that.\"\n \"Is there any evidence that she\u0027s alive?\"\n \"She seems to have packed up and left her room under her own power. That\u0027s a favorable sign. If she\u0027d left her clothes in the closet I\u0027d be less optimistic.\"\n \"Yes, of course. I see what you mean.\"\n \"But I can\u0027t get much sense of where she may have gone, or what her life might have been like during the last few months she lived on West Fifty-fourth Street. Did she give any indication of what she was doing? Did she mention a boyfriend?\"\n I asked other questions in that vein. I couldn\u0027t draw anything much out of Betty Hoeldtke. After a while I said, \"Mrs. Hoeldtke, one of my problems is I know what your daughter looks like but I don\u0027t know who she is. What did she dream about? Who were her friends? What did she do with her time?\"\n \"With any of my other children that would be a much easier question to answer. Paula was a dreamer, but I don\u0027t know what it was that she dreamed. In high school she was the most normal and average child you could imagine, but I think that was just because she wasn\u0027t ready yet to let her own light shine. She was hiding who she was, and maybe from herself as well.\" She sighed. \"She had the usual high school romances, nothing very serious. Then at Ball State I don\u0027t think she had a real boyfriend after Scott was killed. She kept-\"\n I interrupted to ask who Scott was and what had happened to him. He was her boyfriend and unofficial fiancй during her sophomore year, and he\u0027d lost control of his motorcycle on a curve.\n \"He was killed instantly,\" she remembered. \"I think something changed in Paula when that happened. She had boys she was friendly with after that, but that was when she got really interested in theater and the boys were friends of hers from the theater department. I don\u0027t think there was much question of romance. The ones she spent the most time with, my sense was that they weren\u0027t interested in romance with girls.\"\n \"I see.\"\n \"I worried about her from the day she left for New York. She was the only one who left, you know. All my others stayed nearby. I kept it hidden, I didn\u0027t let on to her, and I don\u0027t think Warren had any idea how I worried. And now that she\u0027s dropped off the face of the earth-\"\n \"She may turn up just as abruptly,\" I offered.\n \"I always thought she went to New York to find herself. Not to be an actress, it never seemed that important to her. But to find herself. And now my fear is that she\u0027s lost.\"\n I had lunch at a pizza stand on Eighth Avenue. I got a thick square of the Sicilian and shook a lot of crushed red pepper onto it and ate it standing up at the counter, washing it down with a small Coke. It seemed quicker and more predictable than, say, walking down to the Druid\u0027s Castle and finding out for myself what toad-in-the-hole was.\n There was a noon meeting Tuesdays at St. Clare\u0027s Hospital, and I remembered that Eddie had mentioned it as one he want to fairly regularly. I got there late but stayed right through to the prayer. He didn\u0027t show up.\n I called my hotel to see if there were any messages. Nothing.\n I don\u0027t know what made me go looking for him. Cop instinct, maybe. I\u0027d been expecting to see him at St. Paul \u0027s the night before and hadn\u0027t. He could have changed his mind about doing his fifth step with me, or might simply have wanted more time to weigh the idea, and might have stayed away from the meeting to avoid encountering me before he was ready. Or he might have decided he wanted to watch something on television that night, or gone to another meeting, or for a long walk.\n Still, he was an alcoholic and he\u0027d been troubled, and those conditions could have inclined him to forget all the fine reasons he knew for staying away from a drink. Even if he\u0027d started drinking, that was no call for me to go after him. The only time to help somebody is when he asks for it. Until then, the best thing I could do for him was leave him alone.\n Maybe I was just tired of trying to cut the cold trail of Paula Hoeldtke. Maybe I went looking for Eddie because I figured he\u0027d be easy to find.\n Even so, it took some doing. I knew what street he was on but I didn\u0027t know the building, and I didn\u0027t much feel like going door-to-door trying to read the nameplates on doorbells and mailboxes. I checked a phone book to see if he was still listed in spite of his phone having been disconnected. I couldn\u0027t find him.\n I called an Information operator and identified myself as a police officer and made up a shield number. That\u0027s a misdemeanor, but I don\u0027t suppose it\u0027s the sort of thing you can go to hell for. I wasn\u0027t asking her to do anything illegal, just trying to get her to do me a favor she\u0027d probably have denied a civilian. I told her I was trying to find a listing a year or two old. It wasn\u0027t in her computer, but she found an old White Pages and looked it up for me. \n","sourceLink":"https://allnovel.net/out-on-the-cutting-edge-matthew-scudder-7/page-11.html","bookId":2325,"book":{"id":2325,"title":"Out on the Cutting Edge (Matthew Scudder #7)","description":"Storyline: \n Out on the Cutting Edge (Matthew Scudder #7) \n It isn\u0027t called Hell\u0027s Kitchen for nothing - a gritty landscape of dark doorways and dirty alleys inhabited by crack addicts and the homeless. For Matt Scudder, it\u0027s a city gone mad, but a city he can\u0027t leave as he\u0027s been hired to find missing would-be actress Paula Hoeldtke.\n \n","cover":"https://allnovel.net/images/out-on-the-cutting-edge-matthew-scudder-7.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/out-on-the-cutting-edge-matthew-scudder-7.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:49:58 AM"}}
