{"id":13846,"no":18,"title":"LETTER XVII. THE PLEASURES OF THE SENSES.","content":"Nature has decreed, that each one of our senses should be a source of pleasure. But if we seek our enjoyment, only in physical sensations, the same stern arbiter has enacted, that our capability of pleasure should soon be exhausted, and that, palled and disgusted, we should die without having known true happiness.[38] \n \n Exactly in proportion as pleasures are less associated with the mind, their power to give us any permanent satisfaction is diminished. On the contrary, they become vivid and durable, precisely in the degree in which they awaken and call forth moral ideas. They become celestial, when they connect the past with the present, the present with the future, and the whole with heaven. \n \n In proportion as we scrutinize the pleasures of the senses, we shall always find their charm increasing in[130] the same degree, as losing, if I may so say, their physical stain, they rise in the scale of purification, and become transformed, in some sense, to the dignity of moral enjoyments. \n \n I look at a painting: it represents an old man, a child, a woman giving alms, and a soldier, whose attitude expresses astonishment. I admire the fidelity, the truth and coloring of the picture; and my eye is intensely gratified. But remaining ignorant of the subject, I go away, and the whole shortly vanishes from my memory. I see it again; and am now struck with the inscription at the bottom, ‘Date obolum Belisario.’ I remember an interesting passage of history. A crowd of moral images throng upon my spirit: I soften to tenderness; and I comprehend the affecting lesson, which the artist is giving me. I review the painting, again and again; and thrill at the view of the blind warrior, and of the child holding out his helmet to receive alms. \n \n When we travel, those points of view in the landscape which long fix our eye, are those which awaken ideas of innocence and peace; affecting the heart with associations connected with the morning of our life; or ideas of that power and immensity, which move and elevate the soul. The paintings of nature, as well as those of men, are thus capable of being embellished by moral associations. In travelling, I perceive a delightful isle embosomed in a peaceful lake. While I contemplate it, with the simple pleasure excited by a charming landscape, I am told that it is inhabited by a happy pair, who were long crossed and separated; but who wore out the persevering opposition of fortune; and are now living there in the innocence and peace of the first tenants[131] of paradise. How different an interest the landscape now assumes! I behold the happy pair, without care or regret, sheltered from jealous observation, enjoying the dream of their happy love, gratefully contemplating the Author of the beautiful nature around them, and elevating their love and their hearts, as a sacrifice to HIM. \n \n Sites, which, in themselves, have no peculiar charm, become most beautiful as soon as they awaken touching remembrances. Suppose yourself cast by misfortune on the care of a stranger in a strange land. He attempts to dispel your dejection, and says, ‘these countries are hospitable, and nature here puts forth all her opulence; come, and enjoy it with us.’ The gay landscapes, which spread before you, all assume the appearance of strangers; and offer no attractions. But while your eye traverses the scenery with indifference, you see blue hills melting into the distant horizon. No person remarks them, but yourself. They resemble the mountains of your own country, the scenes upon which your infant view first rested. You turn away to conceal the new emotions, and your eyes are filling with tears. You continue to gaze fondly on those hills, dear to memory. In the midst of a rich landscape, they are all that interests you. You return to review them every day, and demand of them their treasured remembrances and illusions,—the dearest pleasures of your exile.[39] \n \n All the senses would offer me examples, in illustration of this idea. Deprive the pleasures of physical love of moral associations, which touch the heart, and you take from it all that elevates the enjoyment above that of the lowest animals. Else, why do modesty, innocence, the expression of unstained chastity, and the[132] graces of simplicity possess such enchanting attractions? The truth, that there exists in love a charm stronger than physical impulse, is not unknown even to women of abandoned manners. The most dangerous of all those in this unhappy class, are they, who, not relying on their beauty, feign still to possess, or deeply to regret those virtues, which they have really cast away. \n \n There are useful duties upon this subject, which I should find it difficult to present in our language. In proportion as the manners of a people reach the extreme refinement of artifice and corruption, their words become chaste. It is a final and sterile homage rendered to modesty. \n \n The last delights which imagination can add to the pleasures of love, are not to be sought in those vile places where libertinism is an art. We must imagine the first wedded days of a young and innocent pair, whose spirits are blended in real affection, in similar tastes, pursuits and hopes, who realize those vague images which they had scarcely allowed before to float across their mind. \n \n They who seek in the pleasures of taste only physical sensations, degrade their minds and finish their useless existence in infirmity and brutal degradation. The pleasures of taste should only serve to render the other enjoyments more vivid, the imagination more brilliant, and the pursuits of life more easy and pleasant.—All objects should present themselves under a gay aspect. A happy veil should shroud those pains which have been, or are to be endured. Even the wine cup, more powerful than the waters of Lethe, should not only procure forgetfulness of the past, but embellishment of the future. \n \n [133] \n \n The pleasures derived from odors are only vivid, when they impart to the mind a fleeting and vague exaltation. If the orientals indulge a passion for respiring perfumes, it is not solely to procure pleasurable physical sensations. An embalmed atmosphere exalts the senses, and disposes the mind to pleasant revery, and paints dreams of paradise upon the indolent imagination. \n \n Were I disposed to present the details of a system upon this subject, the sense of hearing would offer me a crowd of examples. The brilliant and varied accents of the nightingale are ravishing. But what a difference between hearing the melody from a cage, and listening to the song at the noon of night, when a cool and pure air refreshes the lassitude of the burning day, and we behold objects by the light of the moon, and hear the strains of the solitary bird poured from her free bower! \n \n A symphony, the sounds of which only delight the ear, would soon become wearying. If it have no other determinate expression, it ought, at least, to inspire revery, and produce an effect not unlike that of perfumes upon the orientals. \n \n Suppose we have been at an opera, got up with all the luxury of art. Emotions of delight and astonishment rapidly succeed each other, and we believe it impossible to experience new sensations of pleasure. In returning home, we chance to hear in the distance, through the stillness of night, a well remembered song of our infancy, that was sung to us by some one dear to our memory. It is at once a music exciting more profound emotion, than all the strains of art which we so recently thought could not be surpassed. The remembrances of infancy and home rush upon the spirit, and[134] efface the pompous spectacle, and the artificial graces of execution.[39a] \n \n Observations to the same effect might be multiplied without end. If you desire pleasures, fertile in happy remembrances, if you wish to preserve elevation of mind and freshness of imagination, choose, among the pleasures of the senses, only those which associate with moral ideas. Feeble, when separated from the alliance of those ideas, they become fatal when they exclude them. To dare to taste them, is to sacrifice happiness to pleasures which are alike ephemeral and degrading. It is to resemble him, who should strip the tree of its flowers, to enjoy their beauty. He loses the fruits which would have followed, and scarcely casts his eye on the flowers before they have faded. \n \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2052/58479.html","bookId":573,"book":{"id":573,"title":"The Art of Being Happy","description":"简介： The text, upon which the following observations and comments are based, does not assume to be a literal translation of the celebrated work of Droz. The original is strongly idiomatic; and the author has carried an uncommon talent of being laconic som...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2052","creation":"Aug 1, 2019 12:18:57 AM","modification":"Aug 1, 2019 12:18:57 AM"}}
