{"id":34943,"no":4,"title":"CHAPTER IV. THE FLOATING BATTERIES.","content":"THE blow so suddenly and effectually levelled at the Spaniards seems for a time to have paralyzed their energies. But about the beginning of December they recovered themselves to some extent, and the besieged could see a large body of their men busily engaged in making fascines, with a view to the reconstruction of their batteries. It was also ascertained that the allied Governments of France and Spain had determined upon concentrating in front of Gibraltar a force which should render resistance impossible; that several French regiments were to be despatched to the assistance of the besieging army; and the conduct of the operations entrusted to the Duke of Crillon, who had recently gained a high reputation by his conquest of Minorca. Meantime, General Elliot and his officers main{71}tained their composure. Every precaution was taken against surprise; and the weak points of the fortifications, as indicated by the enemy’s fire, were assiduously strengthened. But before resuming our narrative of the siege, we must pause to record an example of that generous courtesy which sometimes relieves the horrors of war. Among the Spanish officers taken prisoner was one Baron von Helmstadt, an ensign in the Walloon Guards. He was dangerously wounded in the knee, and when the English surgeons informed him that amputation was necessary, he resolutely refused to submit to it. The operation, he said, was seldom successful in Spain; and for himself, he was then engaged to be married to a lady, and would rather risk his life than present himself before his betrothed in a mutilated condition. Apprised of this dangerous effusion of a false sentiment, General Elliot visited the baron, and used every argument to dissuade him from adhering to so rash a determination. His lady-love, said the general, very sensibly, would not esteem him the less for having received an honourable wound in the service of his country. As to the operation being fatal, he could assure him that the contrary{72} was the case; he knew that the English surgeons were almost always successful; and, for his better assurance, he introduced into his chamber several “mutilated convalescents.” The governor’s generous attention had so great an influence on the baron, that he consented to the operation, which was performed with great skill, and resulted most favourably. As the baron’s lady-love would doubtless have considered a lover with one leg better than no lover at all, we are convinced she would often have blessed General Elliot for his chivalrous interposition, but that, unfortunately, the baron afterwards died of some internal disease. The New-Year’s Day of 1782, says our historian, was remarkable for an action of gallantry which is worthy of being rescued from oblivion. An officer of artillery at one of the batteries observing a shell whizzing its way towards his post, got behind a traverse for protection. This he had scarcely done before the shell fell into the traverse, and instantly entangled him in the rubbish. A soldier named Martin, seeing his distress, bravely risked his own life to save his officer, and ran to extricate him. His efforts proving useless, he called for assistance; and another soldier joining him, they succeeded in [Image unavailable.] MAP OF GIBRALTAR AT THE TIME OF THE GREAT SIEGE. (From an Old Engraving.) [Larger view] [Largest view] {73} extricating their officer. Almost at the same moment the shell burst, and levelled the traverse to the ground. For this courageous action, Martin was deservedly rewarded and promoted. The defenders of the Rock now watched with intense interest the preparations of the enemy, in whose lines the greatest activity was visible. They could note the almost daily arrival of fresh troops, until the whole shore of the Bay, from Carteia to the heights of San Roque, was covered with tents. Thousands of workmen, under cover of night, pushed the approaches nearer and nearer to the beleaguered fortress. Heavy guns bristled from every point of vantage, and hour after hour poured out their fell contents of shot and shell. It was obvious, too, that the huge men-of-war at Algesiras were being equipped as batteries of a new and formidable character. The eagerness of the besiegers was stimulated by the arrival in their camp of two French princes of the blood, the Count of Artois and the Duke of Bourbon; the enemies of Great Britain everywhere turned their attention towards the great fortress which, as they confidently believed, would soon cease to be occupied by her soldiers.{74} It may not be uninteresting if we borrow from Captain Drinkwater’s pages a record of the operations of a few days, with the view of giving the reader some idea of the incidents which characterize the course of a great siege:— The 1st of March, he says, a flag of truce went to the enemy, in answer to one from them some days before. The Spanish officer who received the packet informed us that Fort St. Philip, in Minorca, had surrendered on the 5th of February. The succeeding day, a “carcass” set fire to the enemy’s 13-gun battery, which continued blazing for two hours. On their attempting to extinguish the fire, we plied them so briskly, that several were killed and most of them driven from their work; but their usual gallantry at last prevailed. This is an honourable tribute to an enemy who fought with considerable courage and perseverance. At night they raised a place d’armes at the western extremity of their 13-gun battery; these defensive works demonstrating that they were determined to provide as much as possible against another sortie. The following night they repaired the damage done by the fire. The carpenters of the navy, on the 4th, laid the keel of one of the new gun{75}boats. The 6th, six rows of tents, ten in each row, were pitched in the rear of the second line of the enemy’s camp, near the horse-barrack. A large party was also employed in making a road from the beach to the barrack, and others were engaged in landing shells and different ordnance. These, with other appearances, showed that the enemy were in earnest in their prosecution of the siege. On the other hand, General Elliot unweariedly engaged the garrison in repairing, and putting in the best order of defence, the upper batteries and other works which had suffered from the storm of fire directed against them. On the 8th, the enemy raised one face of the eastern redoubt several fascines in height. The day following, Lieutenant Cuppage, of the Royal Artillery, was dangerously wounded on the Royal battery, from a splinter of a small shell, which burst immediately after being discharged from the rock gun above and in the rear of the Royal battery; this was the second accident of the same nature. On the 11th a frigate and xebec passed to the west, with six topsail vessels, supposed to be part of the late Minorca garrison. On the night of the 13th the enemy traced out a work within the western place d’armes of the{76} St. Carlos Battery, apparently with an intention of extending the epaulement. The firing on both sides was now considerably increased; that from the enemy amounted to about five hundred rounds in the twenty-four hours. In the course of the 25th a shot drove through the embrasures of one of the British batteries, took off the legs of two men, one leg of another, and wounded a fourth man in both legs; so that “four men had seven legs taken off and wounded by one shot.” The boy who was usually posted on the works where a large party was employed, to inform the men when the enemy were directing their guns towards them, had been chiding them for their disregard of his warnings, and had just turned his head towards the hostile lines, when he observed this shot on its dreadful path, and called to them to beware. Unfortunately, his caution was too late; the shot entered the embrasure, with the fatal result we have described. It is strange that this boy should have been so keen-sighted as to distinguish the enemy’s shot almost immediately after it quitted the gun. But another boy in the garrison possessed an equal, if not a superior sharpness of vision. Passing on to the 11th of April, we find that on{77} that day the garrison obtained information as to the exact nature of the preparations which were being made for conquering their stubborn resistance. They learned that the Duke of Crillon was in command, with twenty thousand French and Spanish troops, in addition to those who had previously formed the besieging force; that the besieging operations were directed by Monsieur d’Ar?on, an eminent French engineer; and that Admiral Don Buonaventura Moreno was prepared to support the attack with ten men-of-war, besides gunboats, mortar boats, floating batteries, and other vessels. Next day the enemy’s cannonade was of a peculiar character; from six in the morning until sunset a single gun or mortar was discharged every two or three minutes. Our British soldiers remarked that, as the day was the anniversary of the bombardment, the Spaniards were probably keeping it with prayer and fasting, and the minuteguns were intended to express their sorrow at the expenditure during the past twelvemonth of so many barrels of powder and rounds of cartridges without any result! On the 28th of May the enemy sent in a flag of truce. Before the object of it was known, the governor remarked to the officers near him that{78} he supposed the duke had arrived, and had sent to summon the garrison to surrender. His reply, he said, would be brief, “No—no;” and he hoped his officers would support him. The summons, however, was not made, and the laconic answer, therefore, was not given. But it is due to the Duke of Crillon to record his courtesy. He wrote to General Elliot to acquaint him with the arrival of the French prince, and in their name to express their high estimation of his courage and character. The letter was accompanied by a present of fresh fruits and vegetables, with ice, game, and other luxuries for the use of his staff. He knew, said the duke, that the governor lived wholly upon vegetables, and if informed of the description he preferred, he would furnish a daily supply. The governor replied in suitable terms; but while accepting the Spanish commander’s gifts, begged of him to send no more, as he made it a point of honour to share with the meanest of his fellow-soldiers both want and plenty. In planning a combined attack by land and sea upon the Rock, the besiegers felt it was necessary to guard against the destruction of the naval force by the batteries of the fortress before it could get near enough to render any service. But how was the{79} fire of the English guns to be silenced? It occurred to M. d’Ar?on that what was wanted was a number of fireproof batteries, which could take up and maintain a position in the Bay, regardless of the cannonade delivered against them by the garrison. In the construction of these floating castles M. d’Ar?on exhausted all his ingenuity. There were ten of them, each armed with fifteen heavy guns, and their structure was as follows:—On the larboard side they were six or seven feet thick, made of green timber, bolted and cased with cork, iron, and raw hides. Inside they were lined with a bed of wet sand, and in case they should nevertheless take fire, currents of water were poured through them by a system of pumps and channels, so that, should any red-hot shot pierce the vessel and open up any one of the ducts, the water would pour forth instantly and extinguish the flames. As an additional protection, each tower was covered with a slanting bomb-proof roof, capable of being raised or lowered at pleasure, by means of machinery, from which, it was calculated, the balls would glide harmlessly into the sea. In fact, the devices for the protection of the besiegers seem to have been more numerous and more skilful than those for the attack of the besieged. We{80} must add that these ponderous floating batteries were masted and rigged, so as to sail like frigates. It must not be thought that General Elliot had made no provision against the coming storm. He was a man fertile in expedients, and it would appear that his engineer-officers were as able as they were zealous; so that at all the exposed points new works of great strength were thrown up, and the fortifications were everywhere repaired and put in order. A fleet of gunboats was got ready in the Bay; a body of Corsicans, under the leadership of a nephew of the celebrated Paoli, had arrived to offer their services; and some vessels loaded with ammunition had run the blockade, and refilled the magazines of the fortress. The garrison reposed the most absolute confidence in their commander, and after so protracted a siege had come to think of themselves as invincible. Nor was their confidence lessened by the news which reached them of Admiral Rodney’s great victory over a French fleet in the West Indies. For some time the governor had looked on very calmly at the new works raised by the Spaniards across the isthmus and along the shore, but as they had been pushed forward to an inconvenient position, he thought the moment had come for administering [Image unavailable.] LARBOARD AND STARBOARD SIDES OF A SPANISH BATTERING-SHIP. (From on Old Engraving.) Page 70. {81} a stern rebuke. He therefore opened upon them a cannonade of red-hot shot, which in a few hours involved the greater portion in names. This contemptuous demonstration so annoyed the Duke of Crillon, that, though his lines were incomplete, he ordered a general bombardment. It began with a volley of about sixty shells from the mortar boats; then all his artillery, numbering one hundred and seventy pieces of heavy calibre, joined in the feu d’enfer; while nine line-of-battle ships hurled their broadsides as they sailed along the sea-front. The attack was repeated on the following day, in the hope apparently of terrifying the garrison by revealing the formidable nature of the preparations made for their destruction. While the air echoed with the hurtling missiles, the astonished soldiers saw through the occasional gaps in the smoke-clouds a vast press of sail coming up from the westward; it proved to be the combined fleets of France and Spain. Such an accumulation of force, by land and sea, could not fail to surprise, though it did not alarm, Elliot and his veterans. The armada, beneath which, to use the expression of an old poet, “the waters groaned,” consisted of 47 sail of the line, and 10 battering-ships, regarded{82} as impregnable and invincible, carrying 212 guns, besides frigates, xebecs, bomb-ketches, cutters, gun and mortar boats, and smaller craft for disembarking men. On the land-side the batteries and works were of the most formidable character, mounting 200 pieces of heavy ordnance, and protected by an army of nearly 40,000 men, under the command of a general of experience and ability, and animated by the presence of two princes of the royal blood of France, with other eminent personages, and many of the Spanish grandees. No such naval and military combination had been attempted in Europe since the days of the Armada; and it was not unnatural that the Spaniards should anticipate from it a decisive triumph. They seem, however, to have put their faith more particularly in the battering-ships; and so great an enthusiasm was excited, that to hint at their possible failure was considered a mark of treason. General Elliot was in nowise shaken from his usual calmness by this tremendous display of force. His garrison at this time (September 1782) numbered about 7500 men, of whom 400 were in hospital. These he distributed so as to guard most efficiently the points at which the enemy’s attack would probably{83} be delivered. The fortifications were carefully examined, and additional works erected wherever they could be of service. Though the Spaniards poured on the garrison an incessant storm of shot and shell, the governor, in order to husband his resources, permitted but little firing in return, except when it was necessary to silence or destroy some particular battery. The troops under his command were few in number, it is true, but they were veterans, inured to war, who had been long accustomed to the effects of artillery, and gradually prepared to meet the supreme ordeal that now awaited them. His subordinates were officers of approved courage, intelligence, and discretion; eminent “for all the accomplishments of their profession,” and enjoying the entire confidence of the men under their orders. And the spirits of all were animated by the ease with which former attacks had been defeated, as well as by the success attending some recent experiments of firing red-hot shot, which, on this occasion, would enable them, they hoped, “to bring their labours to a period, and relieve them from the tedious cruelty of another vexatious blockade.” In critical circumstances, men, the sagest and coolest, are apt to be influenced by trivial incidents,{84} which they convert into good or evil omens; and such is especially the case when life and liberty are the stakes for which they are about to contend. As the British soldiers, from the summit of their famous Rock, looked out upon the crowd of masts which gathered in the Bay, it was generally reported among them that their arrival was occasioned by the pressure of a British fleet in hot pursuit. Suddenly a loud cheer was raised, and all exclaimed that the British admiral was certainly in their rear, as a flag for a fleet in sight was waving, they said, from the Signal-post. Hope beamed radiant on every countenance; but a revulsion succeeded when the signal suddenly disappeared. The guard at the signal-station afterwards informed them that the supposed flag was really an eagle, which, after several evolutions, had perched for a few minutes on the westernmost pole, and then spread its broad wings to the eastward. Though less superstitious, says the historian gravely, than the ancient Romans, many could not help accepting it as a favourable omen; and the prognostication, happily, was fully justified by the events of the succeeding day. The grand attack took place on the 13th of{85} September. Shortly after nine in the morning, the ten battering-ships took up their several positions in admirable order: the admiral, in a two-decker, dropping anchor about nine hundred yards off the King’s Bastion, and the others successively falling into their places to the right and left of the flag-ships; the most distant being about 1100 or 1200 yards from the garrison. General Elliot reserved his fire until the first ship anchored, and then began a well-directed cannonade. The enemy occupied about ten minutes in their man?uvres; after which they returned our fire, and the stress of battle waxed fast and furious. The air was darkened by the clouds of smoke which rose from shore and sea, while the rattle of shot and the whirr of shells seemed to silence the very echoes. Four hundred pieces of the heaviest artillery were discharging their murderous missiles simultaneously, until one might have thought that all the thunders of heaven were let loose. After a few hours’ cannonade, our soldiers found that the battering-ships were fully as formidable as they had been represented. “Our heaviest shells,” says Drinkwater, “often rebounded from their tops, whilst the 32-pound shot seemed incapable of making{86} any visible impression upon their hulls. Frequently we flattered ourselves they were on fire; but no sooner did any smoke appear, than, with admirable intrepidity, men were observed applying water, from their engines within, to those places whence the smoke issued. These circumstances, with the prodigious cannonade which they maintained, gave us reason to imagine that the attack would not be so soon decided as, from our success against their land-batteries, we had fondly expected. Even the artillery themselves, at this period, had their doubts of the effect of the red-hot shot, which began to be used about twelve, but were not general till between one and two o’clock.” The ordnance portable furnaces for heating shot being too few to supply the demands of the artillery when the battle reached its culmination, huge fires of wood were kindled in the corners of the nearest buildings, in which the shot were speedily prepared for use. Our soldiers jocularly termed these supplies “roasted potatoes.” At first the enemy’s cannon were too much elevated, but about noon they obtained the range, and their firing was powerful, and skilfully directed. The casualties then became numerous, particularly on those batteries north of the King’s Bastion, which [Image unavailable.] VIEW OF THE GRAND ATTACK UPON GIBRALTAR, SEPTEMBER 13, 1782. (From a Drawing by Lieutenant Sandby of the 12th Regiment.) Page 84. {87} were exposed to a cross-fire from the Spanish land-fortifications. Our gunners, however, disregarded this attack, and concentrated all their efforts on the battering-ships, the steady opposition which they offered inciting the British to a boundless resentment. The fire of the garrison increased, if that were possible, in intensity. Every man served the guns as if he were aiming at some personal enemy. From all quarters rained incessant showers of hot balls, carcasses, and shells of every description; and as the masts of several of the ships went by the board, and the rigging of all hung in shreds and tatters, the hopes of the garrison began to revive. For some hours, however, it was difficult to say whether the attack or the defence would prevail. The wonderful construction of the floating batteries apparently defied the heaviest ordnance that the garrison could bring to bear upon them. In the afternoon, however, a considerable change was apparent, and the besieged observed with delight that the flag-ship and the admiral’s second were on fire, and that on board several of the vessels an evident confusion prevailed. Their cannonade slackened rapidly towards the evening; and about seven or eight o’clock it almost ceased. Various{88} signals were thrown up from the suffering ships, and rockets were discharged to inform their friends of their distressed condition. As night came on, says Botta, the flames defied the most anxious efforts of the Spaniards to extinguish them; and the disorder which reigned on board the burning batteries soon communicated itself to the whole line. To the diminished fire of the enemy the garrison returned a cannonade which seemed actually to increase in rapidity and power. It was maintained throughout the night. At one in the morning the two ships already named were in flames. The others speedily caught fire, either from the effects of the red-hot balls, or, as the Spaniards pretended, because they set them on fire, when they had lost all hope of saving them. The light and glow of this tremendous conflagration illuminated the entire Bay, as well as the sombre Rock, and assisted the British gunners to point their artillery with the utmost precision. The trouble and despair of the enemy now reached a climax. The Spaniards hastened to send off all their boats, which surrounded the floating batteries, in order to save their crews; an operation accomplished with much coolness and courage, in spite of the peril attending it.{89} For not only was it necessary to brave the British fire, but to incur the greatest risk in approaching the burning vessels. Never, perhaps, says a writer, did a more horrible or deplorable spectacle present itself to the eyes of men. The deep darkness that shrouded the distant earth and sea, vividly contrasted with the columns of flame that rose upwards from the blazing wrecks; and the shrieks of the victims were heard even above the roar of the incessant cannonade. Brigadier Curtis, who, with his brigade, was encamped at Europa, finding that the moment had come for bringing into operation his little flotilla of twelve gunboats, each of which carried an 18 or 24-pounder in its bow, drew them up in such a manner as to take the floating batteries in flank. This cross-fire compelled the relieving boats to retire. As morning dawned, Curtis pushed forward, and captured a couple of launches loaded with men. These boats attempted to escape, but surrendered after a shot had killed and wounded several on board. The horror of the scene was now almost too great to witness. The daylight showed a piteous spectacle: in the midst of the flames appeared the unhappy Spaniards, who with loud shrieks implored{90} compassion, or flung themselves into the waves. Some, on the point of drowning, clung with frenzied grasp to the sides of the burning ships, or to any floating spar which came within their reach, while, in the depth of their despair, they implored the compassion and succour of the victors. Moved by a sight so painful, the English, says Botta, listened to humanity alone, and ceasing their fire, occupied themselves solely with the rescue of their enemies; a proceeding the more generous on their part, as it exposed them to the most imminent hazard. Curtis, in particular, covered himself with glory, and freely risked his own life to save that of his fellow-creatures. He led his boats up to the burning, smoking hulks, to assist the poor wretches on the point of falling victims to the fire or the waves. Climbing on board the battering-ships, with his own hands he helped down the Spaniards, who loaded him with words of gratitude. While he and his men were thus generously engaged, the flames reached the magazine of one of the battering-ships to the northward, and about five o’clock it blew up, with a crash which seemed to shake the very Rock. A quarter of an hour later, another, in the centre of the line, met with a similar fate. The burning{91} wreck of the latter was hurled in every direction, and involved the British gunboats in serious danger; one was sunk, but happily the crew were saved. A hole was forced through the bottom of the brigadier’s boat, his coxswain killed, the strokesman wounded, and for some time the crew were enveloped in a cloud of smoke. After this incident the brigadier deemed it prudent to retire under cover of the Rock, to avoid the peril arising from further explosions. On his return, however, he approached two more of the ships, and finally landed nine officers, two priests, and three hundred and thirty-four private soldiers and seamen, all Spaniards,—who, with one officer and eleven Frenchmen who had “floated in” the preceding evening, brought up the total number saved to three hundred and fifty-seven. Many of these, who were severely, and some even dreadfully wounded, were immediately removed to the hospital, and attended with the utmost carefulness. Notwithstanding all the heroic efforts of Curtis and his men, on board the burning ships many victims were left to perish. “The scene at this time was as affecting as during the previous hostilities it had been terrible and tremendous. Men crying from amidst the flames for pity and{92} assistance; others, on board those ships where the fire had made little progress, imploring relief with the most expressive gestures and signs of despair; whilst several, equally exposed to the dangers of the opposite element, trusted themselves, on various parts of the wreck, to the chance of paddling ashore.” A Spanish felucca, probably with the view of taking on board these unfortunates, approached from the shore; but the garrison suspecting her of a design to set on fire one of the comparatively uninjured battering-ships, by a brisk cannonade compelled her to retreat. Of the six ships still in flames, three blew up before eleven o’clock; the other three burned down to the water’s edge, the magazines having been wetted by the enemy before they abandoned them. On one of the latter waved the admiral’s flag; it perished with the ship. The besieged hoped to secure the remaining two batteries as trophies of their victory; but one of them suddenly burst out into flames, and blew up with a tremendous crash; and as it was found impracticable to preserve the other, it was destroyed in the afternoon. Such was the fate of the “floating castles” which had been constructed with so{93} much labour, and from which so different a result had been anticipated. It is interesting to remember that during the heat of the struggle General Elliot’s post was the King’s Bastion; and it is a curious circumstance, not unworthy of record, that when General Boyd, some years previously, had laid the first stone, with the usual ceremonies, he observed,—“This is the first stone of a work which I name the ‘King’s Bastion.’ May it be as gallantly defended as I know it will be ably executed; and may I live to see it resist the united efforts of France and Spain.” Of the courage, patience, and perseverance displayed by the garrison during this arduous struggle, as of the skill and energy of the artillerists, it is impossible to speak in terms of too high praise; and the name of “Gibraltar” is rightly blazoned as a title to honour on the flags of the regiments who served in the famous siege. The enemy’s principal objects of attack are recorded to have been the King’s Bastion, and the line of fortifications extending to the north of the Orange Bastion. To silence the former important{94} post, they employed their largest ships, while the others endeavoured to effect a breach in the curtain extending to Montague’s Bastion. Had they succeeded in this attempt, their grenadiers, it is said, were to have stormed the garrison under cover of the combined fleets. The prisoners inveighed against their officers for having described the floating batteries as invulnerable, and promised that ten sail of the line should support them, as well as all the gun and mortar boats. They had been led to believe that the garrison would not be able to discharge many rounds of hot balls; their astonishment, therefore, was very great, when they found them discharged with as much ease and regularity as cold shot. The loss sustained by the Spaniards was never officially made known; but a moderate estimate puts it at 2000 killed, wounded, and taken prisoners. On the other hand, the casualties of the garrison were very few, and it is surprising that so tremendous a cannonade should have entailed so small a loss of life. The number of the killed was sixteen only; eighteen officers, sergeants, and rank and file were wounded. The damage done to the fortifications was equally inconsiderable, and, by the activity of the artillery, the whole of the sea{95}-line, before night on the 14th, was repaired and put in complete order. While the garrison could bring to bear no more than 80 cannon, 7 mortars, and 9 howitzers, the enemy employed no fewer than 328 pieces of heavy ordnance. The English gunners expended upwards of 8300 rounds, more than half of which were hot shot, and 716 barrels of powder. Of the quantity of ammunition wasted by the enemy, we possess no particulars. The following is given by Drinkwater as a correct list of those unfortunate battering-ships which so fatally belied the hopes of their inventors:[3]— {96} The Pastora: 21 guns in use, 10 in reserve, 760 men,—Rear-Admiral Buonaventura Moreno. The Tailla Piedra: 21 guns in use, 10 in reserve, 760 men,—Prince of Nassau-Sieghen. The Paula Prima: 21 guns in use, 10 in reserve, 760 men,—Don Gayetana Langara. El Rosario: 19 guns in use, 10 in reserve, 700 men,—Don Francisco Xavier Munos. The San Christoval: 18 guns in use, 10 in reserve 650 men,—Don Frederico Gravino. The Principe Carlos: 11 guns in use, 4 in reserve, 400 men,—Don Antonio Basurta. The San Juan: 9 guns in use, 4 in reserve, 340 men,—Don Joseph Angeler. The Paula Secunda: 9 guns in use, 4 in reserve, 340 men,—Don Pablo de Cosa. The Santa Anna: 7 guns in use, 4 in reserve, 300 men,—Don Joseph Goicocchea. Los Dolores: 6 guns in use, 4 in reserve, 250 men,—Don Pedro Sanchez. In all, ten ships (five two-deckers, and five one-decker), with 142 guns in use, 70 in reserve, and 5260 men. A movement took place among the enemy, on the afternoon of the 14th, which gave rise to apprehensions that the attack was to be renewed. The batteries, therefore, were kept fully manned, and the shot-heating furnaces ready lighted, in case that an attempt should be made to storm the fortress. It afterwards transpired that such a project had been spoken of, but put aside by the Duke of [Image unavailable.] THE KING’S BASTION, AND OLD MOORISH CASTLE. Page 93. {97} Crillon, who was of opinion that it could end only in the destruction of both the army and the fleet. They contented themselves, therefore, with maintaining a vigorous cannonade from the land-works, and during the remainder of the month they expended daily from 1000 to 2000 rounds. General Elliot, meanwhile, having had convincing proof of the efficacy of red-hot shot, caused kilns for heating them to be erected at various convenient points. They were large enough to heat about one hundred balls in an hour and a quarter; and were a great improvement on the furnaces and grates used for the same purpose on the memorable 13th of September. During the following days a westerly wind prevailed, and numerous dead bodies were thrown ashore, as also many articles of more or less value which had floated about the Bay after the destruction of the battering-ships. Among these were large wax tapers, such as are used on the Roman Catholic altars; cases of salt provisions; and ammunition boxes, each containing ten rounds of powder in linen cartridges. From the captured wrecks which did not blow up were obtained considerable pieces of cedar and mahogany; and “the governor,” it is recorded, “had a handsome set of tables made for the Convent (the holes in the cedar, where the fire had penetrated, being filled up with sound wood, cut in various figures, forming a beautiful contrast with the burned part), which will serve as a standing monument of the transactions of that glorious day. ”","sourceLink":"http://novel.tingroom.com/duanpian/2717/74728.html","bookId":1424,"book":{"id":1424,"title":"Gibraltar and its Sieges","description":"简介： THE year 1704 was the year of Blenheim, that wonderful victory of Marlboroughs which dissipated Lewis the Fourteenths dreams of universal empire. As stars are extinguished in the light of dawn, so in the lustre of this great triumph Englands minor su...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2717","creation":"Aug 1, 2019 12:25:03 AM","modification":"Aug 1, 2019 12:25:03 AM"}}
