{"id":34945,"no":6,"title":"PART II. Gibraltar as it Was and Is. CHAPTER I. GENERAL DESCRIPTION.","content":"THE Atlantic is connected with the Mediterranean, as everybody knows, by a narrow channel of irregular configuration, the Strait of Gibraltar, which flows between the Rock of Gibraltar on the north, and the Rock of Ceuta, backed by the strange mass of Mons Abyla, or Apes’ Hill, on the south. \n \n Gibraltar was anciently called Calpe; and Calpe and Abyla were the legendary Herculis Column?, or “Pillars of Hercules,” which marked the limit of the mythical hero’s conquests, and formed the supposed boundary of the Western world. The fable originated doubtlessly in the fact that the sun, or Hercules, to the navigators of the Mediterranean, sets behind these imposing promontories, dipping below “the rim of ocean” as if to disappear for ever! \n \n The first Greek author who mentions the famous Pillars is the poet Pindar. He speaks of them as the point to which the renown of his heroes extended, beyond which no mortal, whether wise or foolish, could advance. As thus in his 3rd Olympic:— \n “As water’s vital stream all things surpass, \n As gold’s all-worshipped ore \n Holds amid fortune’s stores the highest class; \n So to that distant shore, \n To where the pillars of Alcides rise, \n Fame’s utmost boundaries, \n Theron, pursuing his successful way, \n Hath deckt with glory’s brightest ray \n His lineal virtues. Farther to attain, \n Wise and unwise, with me despair, th’ attempt were vain.” \n \n In the time of Herodotus they formed a perfectly familiar position; and they did not long remain the ne plus ultra of human enterprise, the Ph?nician mariners sailing far beyond them, and reaching the coast of Britain. Even in the days of Strabo, however, a good deal of confusion prevailed in the minds of men respecting these Pillars. He tells us that some supposed them to be islands, others rocky headlands; both rising sheer out of the sea like{118} colossal columns. Others expected to find them indicated by cities, or columns, or statues, erected either by Hercules himself as the proud memorials of his westward conquest, or by the Tyrian seamen, dedicated to their tutelary god to commemorate the farthest limit of their discoveries. Later writers indulged in various conjectures. Pliny records the myth that Hercules rent asunder the rocks which had previously divided the Mediterranean from the ocean; while another legend asserted that he had narrowed the strait in order to exclude the sea-monsters which had hitherto forced their way from the ocean into the Mediterranean. \n \n \n \n Let us turn from ancient fables to modern facts. The voyager who now approaches the Strait sees on the one hand the picturesque coast of Spain, with its green slopes and mountains of purple splendour, and on the other the low sandy shores of Africa, suddenly broken up by the heights of Ceuta. Gibraltar towers before him a narrow promontory of rock, facing the sea with gloomy precipices, and connected with the mainland by a low sandy isthmus. The Bay is on the western side of the promontory, which there assumes a striking and romantic appearance. Along the whole face of the lofty cliff, tier after tier, stretch ranges of formidable batteries, with the town of Gibraltar lying sheltered at the northern end. From every nook and every coign of vantage bristle heavy cannon. The midway slope, from the town to the summit of the great Rock, is occupied by white barracks and pleasant villas, which rest in the shadow of leafy groves. The eastern side, however, is one unbroken mass of precipice, relieved by none of those indications of peaceful civilization. \n \n The three principal points of the rocky ridge to which we have alluded, are the Rock Mortar, north, 1350 feet; the Signal, in the centre, 1276 feet; the Sugar-loaf Point, south, 1439 feet. The length of this ridge, which consists of limestone, completely honeycombed with caverns, is about two miles and three-quarters, with an average breadth of one half to three-quarters of a mile, and a circumference of about seven miles. \n \n The north face of the Rock overlooks the sandy isthmus of the Neutral Ground; but at the north-west angle a line of fortifications separates it from the shore. To the south a rapid slope extends from Sugar-loaf Point to the oval-shaped platform of{120} Windmill Hill, below which the steep crags of Europa extend into the sea. At the north-west corner of the Rock the town is defended by the formidable Lower Lines; and thence a continuous series of defensive works stretches along the western front, and round the southern side of the Rock, until terminated by precipitous and inaccessible heights. This grand range of batteries, bastions, and ravelins is now armed with upwards of one thousand guns. \n \n To the west lies the Bay, which measures nearly eight miles and a half in length, and upwards of five in breadth; its circuit being between thirty and forty miles. On its western curve, facing the town of Gibraltar, is situated the Spanish town of Algesiras. It boldly indents the shore on the north of the famous Strait, which extends, we may add, from Cape Spartel to Ceuta, on the African coast, and Cape Trafalgar to Europa Point, on the Spanish side. Its length is about thirty-six miles, its average breadth from fifteen to twenty. \n \n \n \n The voyager, as his ship passes under the Rock, comes to regard it as one immense mass of fortifications, which Nature seems specially to have constructed for the reception of artillery. Batteries frown on its precipitous sides; batteries crown its rugged summit; batteries line the water’s edge; and batteries project audaciously even into the very sea. Such is the Old Mole, or “Devil’s Tongue,” which played so famous a part in the celebrated siege, and received from the Spaniards its expressive though certainly too emphatic appellation. Half-way up the slope may be seen the walls of the old Moorish castle. To the right, the irregular buildings of the town, “of all imaginable shapes and colours,” are clustered in picturesque variety at the foot of the precipices. To complete the picture, the Bay is studded with numerous craft, from the stately man-of-war and the great India-bound steamer, to the smart-looking felucca which spreads its lateen-sails to the Mediterranean breeze. \n \n On landing, the traveller pushes his way through a motley crowd, crosses the double enceinte, ditches, and drawbridge, and enters the market-place, an open area surrounded by barracks, four, five, and six stories high. Here are to be seen a throng of interesting characters: Algerians and Morocco merchants, with half-naked legs, slippered feet, their shoulders wrapped in their large white bernouse,{122} and their head crowned with the turban or tarbouche; Jews, with venerable beards, black robes, and pointed bonnets; the turbaned Moors, with loose flowing robes, and vests and trousers of crimson cloth; and Spanish peasants, with velvet breeches and leggings of embroidered leather, and the navaja, or knife, thrust into their tight crimson sash. Among these the English soldier winds his way, neat, erect, and clean-shaven, as on parade in St. James’s Park; or the Spanish lady lightly treads, her face concealed by her black silk mantilla, and her hand fluttering the inevitable fan. \n \n Gibraltar has no public buildings of architectural importance; it is essentially a garrison town, a fortified post, in which art and beauty are subordinated to the useful. Except, indeed, at one spot, the Garden, or Alameda—one of the most charming promenades in the world—which extends from the sea-wall to the base of the precipices, formerly known as the “Red Sands.” Here blooms a garden which is truly “a miracle.” The sub-tropical flora is displayed in all its magnificent variety. A forest of aloe and cactus, of cistus and sweet-scented broom, clothes the rugged flanks and steep declivities of the mountain, if such it may be called. The winding alleys creep in and out of masses of rose-trees and flowering geraniums; while tall pines, huge mimosas, arbutes, and pepper-plants spread a pleasant shade around. Through these thick screens of verdure a glimpse is here and there obtained of the mast-studded harbour, and the shining waters of the Bay, and the azure hills beyond. Is it possible to conceive of a spot more enchanting? The great defect in landscapes on the border of the sea is, as a French writer remarks, the want of greensward and leafy trees. But here these charms are combined; the richness of a beautiful vegetation blends with the transparency of a sunny sky, and the sapphire light of a sea like that of Naples, to form a picture of supreme attraction. \n \n \n \n The town of Gibraltar is of limited extent, and the peculiar nature of its position prevents it from enlarging itself in any direction. Its two or three long streets run parallel to the sea-lines, and are intersected at right angles by numerous narrow squalid lanes, which ascend the precipitous acclivity by flights of rugged steps, called “Ramps.” The general aspect of the town reminds the visitor of Landport; but these lanes resemble the wynds in{124} the “Old Town” of Edinburgh. “Toilsomely clambering to the top of the Ramps, we find,” says Bartlett, “still narrower lanes parallel to those below, resting on the bare hillside, but the houses having a fine look-out, and being often half buried in shrubbery and creepers, and peeping down upon the confused bee-hive below. Crouching thus, as it does, at the foot of the hot and arid rock, with its streets and alleys closely jammed together for want of room to expand, the town of Gibraltar is in summer excessively close and oppressive, and at no time can it be, we should imagine, an agreeable place of residence; for not only are its habitations confusedly huddled together, but for the most part exceedingly ill built and unsuitable to the climate.” This unfavourable opinion, however, is not confirmed by every traveller; and, as a matter of fact, for some months in the year the climate of Gibraltar is anything but unhealthy. \n \n Byron called Valletta, the principal port of Malta, a “military hothouse;” but the term is much more applicable to Gibraltar, where the principal ornaments are cannon, and half the population soldiers or soldiers’ wives, or soldiers’ purveyors. If not the pomp and circumstance of war, at least its more prosaic side is everywhere visible. At every corner parties are{125} relieving guard; the patrol pace the crowded streets to the ear-splitting music of fife and drum; watches are regulated, morning and evening, by gun-fire; the gates are closed at a certain hour; peaceable amateurs sketching bits of the Rock are ferociously challenged by suspicious sentinels; you cannot move a step without abundant evidence that you are in a fortified town, where reigns an unrelaxing vigilance. Yet it is not without its semi-humourous, semi-picturesque aspects, such as Thackeray has drawn with his accustomed distinctness. Suppose, he says, all the nations of the earth to send suitable ambassadors to represent them at Wapping or Portsmouth Point, with each under its own national signboard and language, its appropriate house of call, and your imagination may figure the Main Street of Gibraltar. There the Jews predominate, and Moors abound; and from the “Jolly Sailor,” or the brave “Horse Marine,” where the people of our nation are drinking British beer and gin, you hear choruses of “Garryowen” or “The girl I left behind me;” while through the lattices of the Spanish wine-shops come the clatter of castanets and the jingle and moan of Spanish guitars and ditties. “It is a curious sight at evening, this thronged street,{126} with the people, in a hundred different costumes, bustling to and fro under the coarse glare of the lamps: swarthy Moors, in white or crimson robes; dark Spanish smugglers in tufted hats, with gay silk handkerchiefs round their heads; fuddled seamen from men-of-war or merchantmen; porters, Gallician or Genoese; and, at every few minutes’ interval, little squads of soldiers tramping to relieve guard at some one of the innumerable posts in the town.” \n \n Thackeray refers in a similar strain to the Garden, or Alameda, which we have just described. It is, he owns, and he might well have said more, a beautiful walk; of which the vegetation has been as laboriously cared for as the tremendous fortifications which flank it on either side. On the one hand rises the vast Rock, with its interminable works of defence; on the other shines Gibraltar Bay, out on which, from the terraces, immense cannon are perpetually looking, surrounded by plantations of cannon-balls and beds of bomb-shells, sufficient, one would think, to blow away the whole peninsula. The horticultural and military mixture is, he continues, very queer: here and there temples and rustic summer-seats have been raised in the garden, but from among the flower-pots you are sure to see a great mortar peeping; and amidst the aloes and geraniums stalks a Highlander, in green petticoat and scarlet coat. Fatigue-parties are seen winding up the hill, and busy about the endless cannon-ball plantations; awkward squads drill in every open space; and sentries are marching to and fro perpetually. Yet the scene, says Thackeray, is always beautiful; especially at evening, when the people are sauntering along the walks, and the moon pours its light on the waters of the Bay and the hills and the twinkling white houses of the opposite shore. Then the place becomes quite romantic: it is too dark to see the dust on the dried leaves; the intrusive cannon-balls have for a while subsided into the shade; the awkward squads are at rest; even the loungers have retired,—the fan-flirting Spanish ladies, the sallow black-eyed children, and the trim white-jacketed dandies. From some craft nestling on the quiet waters comes the sound of fife or song; or a faint cheer from yonder black steamer at the Mole, which is bound on some nocturnal voyage. You forget the squalor and motley character of the town, and deliver yourself up entirely to romance. The sentries pacing in the moonlight look like feudal{128} knights of old; and there is music in the old historic challenge, “Who goes there?” \n \n “‘All’s well,’” says Thackeray with humorous exaggeration, “is very pleasant when sung decently in tune, and inspires noble ideas of duty, courage, and danger; but when you have it shouted all the night through, accompanied by a clapping of muskets in a time of profound peace, the sentinel’s cry becomes no more romantic to the hearer than it is to the sandy Connaught-man or the barelegged Highlander who delivers it. It is best to read about wars comfortably in ‘Harry Lorrequer’ or Scott’s novels, in which knights shout their war-cries, and jovial Irish bayoneteers hurrah, without depriving you of any blessed rest. Men of a different way of thinking, however, can suit themselves perfectly at Gibraltar; where there is marching and counter-marching, challenging and relieving guard all the night through. And this all over the huge Rock in the darkness; all through the mysterious zigzags, and round the dark cannon-ball pyramids, and along the vast rock-galleries, and up to the topmast flag-staff, where the sentry can look out over two seas, poor fellows are marching and clapping muskets, and crying, ‘All’s well,’ dressed in cap and feather, in place of{129} honest nightcaps best befitting the decent hours of sleep.” \n \n Every visitor to Gibraltar makes a point of ascending to the Signal Station, though the climb is somewhat arduous, and the higher we ascend the more rugged and rocky becomes the winding path. It must be owned, however, that the view from the summit repays one for the fatigue of the ascent. From this point is clearly seen the ridge-like character of the Rock, dividing it into two steep declivities, which vary considerably in their character. On the east, as we have already said, nothing is visible but an inaccessible precipice; on the west, the slope is more gradual, is broken into terraces, and descends to a narrow level running parallel with the shore, where cluster the houses of the town and the villas on its outskirts, with batteries and other defensive works stretching right away to Europa Point. \n \n Immediately at the foot of the Rock observe the New Mole and the Dockyard. The works which protect the sea-front of the town extend to this point, where they are strengthened by the comparatively new batteries, Victoria and Albert, and the sunken zigzag, poetically named the “Snake{130} in the Grass.” Beyond lies the sheltered nook of Rosier Bay, where ships of the line frequently drop anchor; on the high ground above are situated the Naval Hospital and Barracks. The terraces of Europa and Windmill Hill next come in sight, with an apparently endless series of barracks, forts, magazines, officers’ residences, bastions, curtains, and batteries. Across the Strait the eye rests upon the Spanish fortress of Ceuta, and the mountain-chain which extends from Tetuan to Tangier. \n \n The visitor may prolong his excursion to the ruins of O’Hara’s Tower, above Europa Point. It was built by Governor O’Hara as a belvedere, and forms a picturesque object. Thence, the descent of the eastern side of the Rock is accomplished by a staircase known as “the Mediterranean Steps,” which winds and bends and twists around precipice after precipice, and from point to point, with the Rock above and the blue expanse of the Mediterranean below. The silence and solitude of the spot produce a deep impression on the mind, which seems to enter here into an intimate communion with Nature. We forget the works of man and the purpose for which the grim Rock is so stoutly held; when, on turning a sudden angle, we see, at the \n \n extremity of a small platform, and in a situation inaccessible if not invisible from below, a solitary but formidable gun, commanding Catalan Bay and the Neutral Ground. At a short distance is another, but of less calibre. This singular recess is known as the Mediterranean Battery. \n \n \n \n So much for the Rock itself. Let us now invite the reader to accompany us on an excursion to Carteia. We pass through the Lower Lines, which to the unmilitary eye appear absolutely impregnable, and enter upon the sandy isthmus of the Neutral Ground. A survey of the works at this point of access to the mainland convinces us that the Spaniards are justified in calling it the Boca del Fuego, or “Mouth of Fire.” The narrow causeway which crosses the artificial morass can be blown away at once by the fortress guns. But even if an enemy overcame this obstacle, he would find himself confronted by a line of strong batteries, stretching from the foot of the Rock to the sea, and at the same time exposed to the cross-fire of three or four rows of guns, placed in tiers along that side of the precipice. As we continue our way along the Neutral Ground, we observe that military science{132} has done its utmost to render it impassable by a hostile force. Willis’s Batteries are planted on a bold crag, half-way up the Rock, so as to be able to sweep the isthmus with a withering fire; and the rugged front of the Rock yawns with fissures,—los diantes de la vieja, or “the old lady’s teeth,”—from each of which frown the black muzzles of heavy guns; while, in addition, the Old Mole, or “Devil’s Tongue,” projects its threatening mass into the sea. \n \n The isthmus is a sandy level, with patches of grass and vegetables, two parallel lines of British and Spanish sentinels, barracks of a squalid character for the Spanish soldiery, and still more squalid hovels for Spanish peasants. Here the ruins of Fort St. Philip remind us of the former existence of Spanish military works of a formidable character. Philip V. erected in 1751 two advanced forts, now heaps of shattered masonry; one called after his tutelar saint, Felipe, the other after Santa Barbara, the patroness of the Spanish artillery. They were so strong, says Ford, that when the French advanced, in the Peninsular War, the modern Spaniards, being unable even to destroy them, called in the aid of our British engineers, under Colonel Harding, by \n \n whom they were effectually dismantled. This is at least un fait accompli, and they never ought to be allowed to be rebuilt, adds Ford, since to raise works before a fortress is a declaration of war; and as Buonaparte’s announced intention was to take Gibraltar, Sir Colin Campbell (afterwards Lord Clyde) was perfectly justified in clearing them away, even without leave or license from the Spaniards. It was fortunate for many Spaniards that Campbell effected this work of destruction, for thus General Ballasteros was saved from annihilation, when the French pursued him and his undisciplined mob of troops, by skulking under our guns. Yet no sooner was Ferdinand VII. replaced on the throne of Spain by British arms, than this man urged him to reconstruct the lines as both dangerous and offensive to England. Thereupon said General Don to the Spanish commander at Algesiras, “If you begin, I will fire a gun; if that won’t do, I shall fire another; and if you persevere, you shall have a broadside from the galleries.” So the lines were never rebuilt. \n \n \n \n Carteia was in old days a Ph?nician colony, situated at the point where the river Guadaranque{134} enters Gibraltar Bay, and forms a small but sheltered port. The Ph?nicians called it Melcarthes, in honour of their tutelary god, the African Hercules; and for centuries it flourished as the emporium of a very extensive commerce. Having fallen into the hands of the Romans, it was renamed Carteia; and it is mentioned in the annals of the Second Punic War as an important naval station, and the scene of a great sea-fight, in which L?lius defeated the Carthaginian Hadherbal, B.C. 206. Thirty-five years later, the Roman senate assigned it as a place of residence to upwards of four thousand men, the offspring of Roman soldiers and Spanish women, who had been manumitted by the pr?tor L. Canubius. They amalgamated with such of the inhabitants as chose to remain, and their city was declared a Latina colonia libertinorum. Such is Livy’s statement. \n \n During the desperate civil war in Spain, Carteia seems to have been the naval headquarters of Cneius Pompeius, who fled thither after his severe defeat at Munda, but was compelled to abandon it through the disaffection of a large portion of its inhabitants, B.C. 45. Betaking himself to the forests, he was discovered by his pursuers. Weary and desperate,{135} he flung himself at the foot of a tree, where he was speedily overtaken, and killed after a miserable struggle. \n \n At the death of Julius C?sar, Sextus Pompeius collected his adherents at Carteia, from which he marched at the head of six legions. This is the last incident of any importance in its history. It appears gradually to have sunk into decay; its port was forsaken, its commerce disappeared. After the Moorish invasion its masses of masonry were used as a quarry for the erection of the Torre de Carthagena, and the Spaniards afterwards pillaged them for their town of San Roque. Hence its remains are now of small extent. Corn grows upon the site of the once populous and wealthy city; and the ruins of its theatre are the only memorials of its glory. \n \n The city walls may also be traced; they ran parallel with the river, and then crossed the high ground to the sea-shore. The ancient harbour was within the river-mouth, the entrance to which is now obstructed by a bar. It is very narrow, and easily rendered impracticable for hostile ships. Livy records that when Varus, Pompey’s admiral, was defeated off the Rock by Didius, he withdrew{136} to the harbour of Carteia, and fixed a number of anchors or grapnels across its mouth. Against these the ships of Didius struck, when they attempted to enter; and by this simple expedient Varus saved his entire fleet from destruction. Two hundred years ago the ancient mole, with its solid Roman work, was almost entire; and the ruins of many splendid buildings still existed. No statues or art-relics have been found; but as Carteia was allowed the privilege of a mint, the coins dug up have been numerous and interesting. \n \n An extensive tunny-fishery formerly existed at Carteia. \n \n \n \n Returning to Gibraltar, we find that there are still two or three of its “lions” to be inspected. We have visited neither St. Martin’s Cave nor the Galleries. \n \n The former is reached by a path not to be recommended to any but the firm of foot and clear of brain. It passes the Jews’ Cemetery, and then climbs the eastern side of the Rock, until it reaches a craggy buttress, which overhangs a tremendous abyss, and commands a fine view of the southern precipices. Standing there, the adventurous \n \n spectator takes in a panorama of the Strait from Europa Point to Ceuta, with the lighthouse rearing its white tower on the wave-washed promontory, and the white surf of the Atlantic breaking in ripples on the Mediterranean current. \n \n Still following up the hazardous path, we find that it skirts the brink of a steep stony slope, descending from the precipice down to the very water’s edge,—“a truly perilous spot, where a single slip over the loose pebbles must send us rolling several hundred feet, into the Mediterranean.” It is said that a boy of Gibraltar, who had conceived the idea of revenging himself on a schoolfellow, induced him and two other boys to visit in his company the famous cave. As they approached this dangerous spot, he exclaimed, “We are four that go up, but only three will come down!” and hastened to fulfil his prediction by hurling his victim into the sea below. \n \n Having passed the slope, we creep on our hands and knees through a gap in the rock, and, a short distance beyond, come upon a narrow ledge, which proves to be the threshold of the cavern in question. Along this ledge we ascend to a small oval platform, and thence enter within the gray obscurity of the cave.{138} \n \n Here is a description of its principal features by an accurate observer:— \n \n The roof is encrusted with pendent stalactites, and supported by stalactitic pillars, some of which are solid and massy, others so slender and delicate that they might have been the work of fairy hands. In the deepest recesses, a still pool of water, formed by the constant percolation through the rocky vault, vividly reflects the fantastic objects above and around it. “The perilousness of the access, the deep seclusion of the site, hung half-way up a precipice 1400 feet high, with the inaccessible rock above and the murmuring sea below, make this cavern as it were a temple, erected by the hand of Nature herself, for the lonely enthusiast who delights to worship her in her most hidden solitudes. We continued to wander about, fascinated by the strange beauty of the spot; and, loath to leave it, lingered until the declining beams of the sun warned us that we had to return by a path which it would be difficult, if not dangerous, to retrace in the obscurity of twilight. Almost dazzled as we emerged into open day, we stood a moment beneath the dark arched entry, to look out upon the expanse of sea, glowing in the sun, with a few white feluccas catching its declining beams; and{139} then creeping cautiously down the narrow ledge by which we had ascended, began to wend our way towards home.” \n \n \n \n To the Galleries the best route is by Willis’s Batteries, which were finished in 1732, and, from their commanding position, proved exceedingly annoying to the Spaniards in the Great Siege. The execution done was so serious, that it led them to form a plan for mining and blowing them up. They began their operations at the top of a slope, above the Moorish ruins of the Devil’s Tower, on the north side of the Rock; but while burrowing through the solid mass were overheard by a watchful sentinel. He gave the alarm, and the works were quickly destroyed by the besieged. Having reached a narrow terrace about half-way up the northern angle, the visitor, as he surveys its face, discerns a long series of cave-like openings, from which protrude the black muzzles of cannon, so pointed as to command the Neutral Ground below. Through an iron gate he now enters into the upper galleries, which were excavated during the Great Siege, and lead to the Windsor Galleries, likewise provided with port-holes, as it were, and thence proceeds by an irregular path to St. Georg{140}e’s Hall. This is excavated in a mass of rock, which externally resembles a projecting dome, and here at the eastern angle corresponds with the craggy platform of Willis’s Batteries at the western. Its dimensions are considerable, and on more than one occasion it has been used as a banqueting-chamber. Lord Nelson was entertained here prior to the battle of Trafalgar. \n \n We now take leave of Gibraltar, its town, its fortifications, its Alameda, its rock-hewn batteries, repeating the fine sonnet of Archbishop Trench:— \n \n \n GIBRALTAR. \n “England! we love thee better than we know; \n And this I learned when, after wanderings long \n ’Mid people of another stock and tongue, \n I heard again thy martial music blow, \n And saw thy gallant children to and fro \n Pace, keeping ward at one of these huge gates \n Which like twin giants watch the Herculean straits. \n When first I came in sight of that brave shore, \n It made my very heart within me dance \n To think that thou thy proud foot shouldst advance \n Forward so far into the mighty sea. \n Joy was it and exultation to behold \n Thine ancient standard’s rich emblazonry, \n A glorious picture by the wind unrolled.” \n \n It is, doubtless, with such feelings as these described by the poet that most Englishmen will gaze upon the famous Rock; though there are not \n \n \n wanting philanthropists to remind us that it rightfully belongs to Spain, and that our possession of it is an insult to a friendly power. Had we surrendered it, however, it would probably have been seized by France; and it is not so much for our own interests we hold it as for those of Europe. While the British flag waves from its summit, it is a sign and symbol that the Mediterranean will be the free highway of all nations. \n \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2717/74730.html","bookId":1424,"book":{"id":1424,"title":"Gibraltar and its Sieges","description":"简介： THE year 1704 was the year of Blenheim, that wonderful victory of Marlboroughs which dissipated Lewis the Fourteenths dreams of universal empire. As stars are extinguished in the light of dawn, so in the lustre of this great triumph Englands minor su...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2717","creation":"Aug 1, 2019 12:25:03 AM","modification":"Aug 1, 2019 12:25:03 AM"}}
