[{"id":2213,"title":"Memnoch the Devil (The Vampire Chronicles #5)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eMemnoch the Devil (The Vampire Chronicles #5) \u003c/p\u003e\n \u003cp\u003eThe fifth volume of Rice\u0027s Vampire Chronicles is one of her most controversial books. The tale begins in New York, where Lestat, the coolest of Rice\u0027s vampire heroes, is stalking a big-time cocaine dealer and religious-art smuggler--this guy should get it in the neck. Lestat is also growing fascinated with the dealer\u0027s lovely daughter, a TV evangelist who\u0027s not a fraud. Lestat is also being stalked himself, by some shadowy guy who turns out to be Memnoch, the devil, who spirits him away. From here on, the book might have been called Interview with the Devil (by a Vampire). It\u0027s a rousing story interrupted by a long debate with the devil. Memnoch isn\u0027t the devil as ordinarily conceived: he got the boot from God because he objected to God\u0027s heartless indifference to human misery. Memnoch takes Lestat to heaven, hell, and throughout history.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/memnoch-the-devil-the-vampire-chronicles-5.jpg","author":"Anne Rice","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2214,"title":"The Vampire Armand (The Vampire Chronicles #6)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eThe Vampire Armand (The Vampire Chronicles #6) \u003c/p\u003e\n \u003cp\u003eArmand until now has played a small role in the Vampire Chronicles. Here he assumes center stage, relating his five hundred years of life to fledgling vampire David Talbot, who plays amanuensis to Armand as he did to Lestat ... It\u0027s not just the epic plot but Rice\u0027s voluptuary worldview that\u0027s the main attraction ... Elegant narrative has always been her hallmark ... Rice is equally effective in showing how Armand eventually loses his religion and becomes \"the vagabond angel child of Satan,\" living under Paris cemeteries and foundling the Grand Guignol-ish Theatre des Vampires. In the twentieth century, a rehabilitated Armand regains faith but falls in love with two children who save his life. By the conclusion of Armand, the pupil has become the mentor.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/the-vampire-armand-the-vampire-chronicles-6.jpg","author":"Anne Rice","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2215,"title":"Merrick (The Vampire Chronicles #7)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eMerrick (The Vampire Chronicles #7) \u003c/p\u003e\n \u003cp\u003eJust when you thought it was safe for a bloodsucker to go out in the dark in New Orleans, along comes Merrick Mayfair, a sultry, hard-drinking octoroon beauty whose voodoo can turn the toughest vampire into a marionette dancing to her merry, scary tune. In Merrick, Anne Rice brings back three of her most wildly popular characters--the vampires Lestat and Louis and the dead vampire child Claudia--and introduces them to the world of her Mayfair Witches book series. It is Louis who brings about the collision of the fang and voodoo universes. Louis made Claudia a vampire in Rice\u0027s classic Interview with the Vampire, in which she was destroyed, and now he\u0027s obsessed with raising her ghost to make amends and seek guidance from the beyond.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/merrick-the-vampire-chronicles-7.jpg","author":"Anne Rice","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2432,"title":"Bag of Bones","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eFour years after the sudden death of his wife, forty-year-old bestselling novelist Mike Noonan is unable to write and plagued by vivid nightmares set at the Maine summerhouse he calls Sara Laughs. Mike reluctantly returns to the lakeside getaway and finds his beloved Yankee town held in the grip of a vindictive millionaire, Max Devore, who is trying to take his three-year-old granddaughter away from her widowed young mother, Mattie. As Mike is drawn into Mattie\u0027s struggle -- and begins to fall in love with her -- he is also drawn into the mystery of Sara Laughs, now the site of ghostly visitations and escalating terrors. What do the forces that have been unleashed here want of Mike Noonan?\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/bag-of-bones.jpg","author":"Stephen King","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2433,"title":"Carrie","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eA modern classic, Carrie introduced a distinctive new voice in American fiction — Stephen King. The story of misunderstood high school girl Carrie White, her extraordinary telekinetic powers, and her violent rampage of revenge, remains one of the most barrier-breaking and shocking novels of all time. Make a date with terror and live the nightmare that is...Carrie\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/carrie.jpg","author":"Stephen King","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2434,"title":"Warm Bodies (Warm Bodies #1)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eR is having a no-life crisis - he is a zombie. He has no memories, no identity, and no pulse, but he is a little different from his fellow Dead. He may occasionally eat people, but he\u0027d rather be riding abandoned airport escalators, listening to Sinatra in the cozy 747 he calls home, or collecting souvenirs from the ruins of civilization. And then he meets a girl. First as his captive, then his reluctant house guest, Julie is a blast of living color in R\u0027s gray landscape, and something inside him begins to bloom. He doesn\u0027t want to eat this girl - although she looks delicious - he wants to protect her. But their unlikely bond will cause ripples they can\u0027t imagine, and their hopeless world won\u0027t change without a fight.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/warm-bodies-warm-bodies-1.jpg","author":"Isaac Marion","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2435,"title":"The Forbidden Game: The Chase (The Forbidden Game #2)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eJenny and her friends are dealing with the aftermath of the events of the first book. No one believes them about their friend\u0027s death and the paper house is still missing. When they finally find the paper house it is ripped to shreds and they don\u0027t know if Julian was released or not. All is soon reveled and they begin a new deadly game where Jenny\u0027s friends are disappearing one by one. This book wasn\u0027t nearly as good as the first one. The first half of the book is pretty dull. The action does pick up but it\u0027s barley enough to make up for the first half. I did like how we got to know the characters better but I didn\u0027t like how little Julian there was. The book kind of struck me as a filler book but I\u0027m sure the last in the series will be much better.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/the-forbidden-game-the-chase-the-forbidden-game-2.jpg","author":"L.J. Smith","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2436,"title":"Necroscope (Necroscope #1)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eHarry is an English youth in school, and strange things occur as he grows up, such as a sudden increased intellect in mathematics, and the ability to fight beyond his experience after a teacher is killed. Eventually he marries his childhood sweetheart, Brenda, who slowly realizes there is more to her now-successful writer husband: that he can speak to the dead, whose collective consciences remain behind, at the location of dying.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/necroscope-necroscope-1.jpg","author":"Brian Lumley","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2437,"title":"Necroscope IV: Deadspeak (Necroscope #4)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eSeveral years after his return to earth Harry Sr. is trouble by nightmares of resurgent Vampires. These nightmares are messages from the dead who he is unable to communicate with when awake due to the actions of Harry Jr. Separately E-Branch is investigating drug smuggling in the Mediterranean when two of its agents are assaulted. One is vampirized and the other rendered insane. Harry Sr\u0027s new girlfriend, Sandra, herself secretly a member of E-Branch plays a pivotal role in bringing Harry into the mix. She had been assigned to watch him and if possible restore his powers and reports to the head of E-Branch on his status. Unknown to everyone the E-branch head is a sleeper agent for the Russian E-Branch/KGB community.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/necroscope-iv-deadspeak-necroscope-4.jpg","author":"Brian Lumley","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2438,"title":"The Vampire\u0027s Assistant (The Saga of Darren Shan #2)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eThe Saga of Darren Shan #2 : The Vampire\u0027s Assistant \u003c/p\u003e\n \u003cp\u003eThe story begins with the main protagonist of the last adventure, Darren Shan, and his guardian Larten Crepsley moving in for a drink of blood from an ex-scout. Darren is beginning to cope with life as a vampire\u0027s assistant though he still refuses to drink human blood and hates his companion, Mr. Crepsley, for turning him into a half vampire which has led him to faking his own death. Although he is far stronger than any human, and a shotput world champion, as he discovers, he is still finding it hard to adjust to his new life. His unchallenged strength causes him to be alone, as he can not make any human friends without breaking their hands. Larten teaches Darren all about vampirism and sometimes is shown regreting for blooding Darren and decides to take him to the Cirque du Freak.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/the-vampire-s-assistant-the-saga-of-darren-shan-2.jpg","author":"Darren Shan","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2439,"title":"Tunnels of Blood (The Saga of Darren Shan #3)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eThe Saga of Darren Shan #3: Tunnels of Blood \u003c/p\u003e\n \u003cp\u003eThis story introduces Gavner Purl, a full vampire, an old friend of Mr. Crepsley. Gavner Purl is a Vampire General. Gavner Purl is shocked to discover Darren a half-vampire. Mr. Crepsley wants to talk to Gavner Paul alone in secrecy. After the meeting, Gavner walks with Darren for a while, revealing to him that Mr. Crepsley was a Vampire General and was about to be invested as a Vampire Prince, who is a leader of the Vampire Clan. He also lets slip that Mr. Crepsley is going to leave the Cirque and finally binds Darren to secrecy regarding all these facts. A day or so later, Mr. Crepsley does inform Darren that he must leave and Darren has to accompany him to some place. He suggests that Evra can come with Darren as if on a \"vacation\" and to help him keep Darren out of mischief as Mr. Crepsley pointed out incidents regarding Madam Octa and Sam Grest.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/tunnels-of-blood-the-saga-of-darren-shan-3.jpg","author":"Darren Shan","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2440,"title":"Vampire Mountain (The Saga of Darren Shan #4)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eThe Saga of Darren Shan #4: Vampire Mountain \u003c/p\u003e\n \u003cp\u003eOn the journey are Darren Shan, two of the Little People, and Mr. Crepsley; they also run into Mr. Crepsley\u0027s old friend, Gavner Purl in a way station. The way station is a place where vampires rest while ascending the treacherous path to Vampire Mountain , where Darren and Mr. Crepsley see two broken coffins and vampire blood. Here Gavner Purl jokingly tries to kidnap Darren in the waystation and surprise the party. Mr. Crepsley, alert and unknowing of the man\u0027s identity nearly kills Gavner.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/vampire-mountain-the-saga-of-darren-shan-4.jpg","author":"Darren Shan","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2441,"title":"Trials of Death (The Saga of Darren Shan #5)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eThe Saga of Darren Shan #5: Trials of Death \u003c/p\u003e\n \u003cp\u003eThe main character, Darren Shan, takes part in the Trials of Initiation. The trials are a series of tasks that vampires used to have to do to prove themselves to the Princes. Now it is only used for vampires who want to become a general or that want to show their strength, but Darren Shan has to endure the trials because Mr. Crepsley said so and Darren chooses to stand up for his mentor and friend. Darren must randomly choose five numbered stones from a bag to determine the trials he must take part in. The first of his five selected trials is The Aquatic Maze, which is a maze that fills steadily with water in 17 minutes while Darren has to get through while dragging a rock half his weight. The second trial is The Path of Needles, which is a run from one end of a room to the other barefoot across stalagmites...\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/trials-of-death-the-saga-of-darren-shan-5.jpg","author":"Darren Shan","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2442,"title":"The Vampire Prince (The Saga of Darren Shan #6)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eThe Saga of Darren Shan #6: The Vampire Prince \u003c/p\u003e\n \u003cp\u003eThe book carries on from when Darren Shan was falling down a huge waterfall in Trials of Death, and he must make his way back to Vampire Mountain, while avoiding Kurda Smahlt and his accomplices. He runs into a pack of wolves, Streak and Rudi - the two wolves he knew from an earlier encounter. These wolves help him make his way back to Vampire Mountain safely. He must find a way to inform the Vampire Princes (the leaders of the vampires) of Kurda\u0027s treachery before they crown him a fellow Prince. Kurda\u0027s treason includes hiding Vampaneze inside the mountain, preparing to murder the Princes and attempting to gain control of the Stone of Blood (a powerful stone that can be used to locate any vampire who has touched it) with which he would force the vampires to join the Vampaneze and become a single clan once more.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/the-vampire-prince-the-saga-of-darren-shan-6.jpg","author":"Darren Shan","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2443,"title":"Hunters of the Dusk (The Saga of Darren Shan #7)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eThe Saga of Darren Shan #7: Hunters of the Dusk \u003c/p\u003e\n \u003cp\u003eIn the seventh book of this series, not long into his years as a Prince, Darren is once again visited by Desmond Tiny (the creator of vampires and Little People). He explains that the three hunters must find and hunt down the Vampaneze Lord if they have any hopes to win the war. He announces that two of them are Darren and Mr. Crepsley, but the third one they must find on their way. The hunters are told by Mr. Tiny that they will cross paths with the Lord of the Vampaneze four times throughout their quest, and have only those four chances to destroy him.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/hunters-of-the-dusk-the-saga-of-darren-shan-7.jpg","author":"Darren Shan","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2444,"title":"Allies of the Night (The Saga of Darren Shan #8)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eThe Saga of Darren Shan #8: Allies of the Night \u003c/p\u003e\n \u003cp\u003eAllies of the Night is the eighth book of The Saga of Darren Shan by Darren Shan. It is part of the Vampire War Trilogy, which comprises three books: Hunters of the Dusk, Allies of the Night and Killers of the Dawn. It was first published in Great Britain by HarperCollins in 2002. It was then published in the Vampire War Trilogy in 2005. Darren, Harkat, and Mr. Crepsley go to Mr. Crepsley\u0027s hometown once again to investigate if Vampaneze had set up territories there. But soon after their arrival Darren is discovered by the police and forced to attend school. He has trouble with most of his subjects as he only has a middle school education, but luckily his English teacher is Debbie, his old girlfriend from his first visit to this city.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/allies-of-the-night-the-saga-of-darren-shan-8.jpg","author":"Darren Shan","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2445,"title":"Killers of the Dawn (The Saga of Darren Shan #9)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eThe Saga of Darren Shan #9: Killers of the Dawn \u003c/p\u003e\n \u003cp\u003eKillers of the Dawn is the ninth book in The Saga of Darren Shan by Darren Shan. It is also the third book in the Vampire War trilogy. Mr. Crepsley, Darren, and Harkat go into the tunnels, where they find Vancha. they arm with weapons carelessly discarded by the Vampaneze and seek out Steve, steve calls the rest of the Vampaneze. There is a battle between the two sides vampaneze and vampires, and soon they face the Vampaneze Lord. The Vampaneze Lord says that he and Mr. Crepsley must fight one another alone with no help from anyone. The Vampaneze and Vampires stop their fighting at last Mr. Crepsley kills the Vampaneze Lord, but Steve jumps onto his back and causes him to fall over the cliff, where he is hanging over the pit of flaming stakes with Steve.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/killers-of-the-dawn-the-saga-of-darren-shan-9.jpg","author":"Darren Shan","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2446,"title":"The Lake of Souls (The Saga of Darren Shan #10)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eThe Saga of Darren Shan #10: The Lake of Souls \u003c/p\u003e\n \u003cp\u003eThe Lake of Souls is the 10th book in The Saga of Darren Shan and is also the first in the 4th and final trilogy in \u0027The Saga\u0027 called The Vampire Destiny Trilogy. It reveals a lot about the character of Harkat Mulds mainly and introduces a new character called Spits Abrams. This book also adds many more questions that will be answered in the next two books. Also, this book is the longest in the series. \u003c/p\u003e\n \u003cp\u003eThe Lake of Souls takes place right after Killers of the Dawn, with Mr. Crepsley dead and Steve\u0027s revelation that he is the Lord of the Vampaneze. Darren is unable to cry. He feels numb, but with the help of the bearded lady, Truska, he eventually does so. Mr. Tiny then appears and tells Harkat that if he wants his nightmares (which have returned) to stop, he must walk through a portal that Mr. Tiny makes. Harkat refuses to let Darren go with him. Debbie Hemlock and...\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/the-lake-of-souls-the-saga-of-darren-shan-10.jpg","author":"Darren Shan","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2447,"title":"Lord of the Shadows (The Saga of Darren Shan #11)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eThe Saga of Darren Shan #11: Lord of the Shadows \u003c/p\u003e\n \u003cp\u003eLord Of The Shadows is the eleventh book in The Saga of Darren Shan series by the author Darren Shan. It is also the second book in the Vampire Destiny trilogy. Along with the Cirque Du Freak, Darren Shan returns to his home town, the place where it all began. While the Cirque Du Freak rests at an old abandoned football stadium, Darren walks through his old home. After spotting his sister, Annie, living a happy life with her son at their old house, Darren decides not to disturb them. One night before the freak show starts a boy shows up hoping to get a ticket to attend the freak show. The boy, Darius, asks many question and acts strangely leaving Harkat and Darren curious. After meeting up with Tommy Jones at that night\u0027s freak show, Darren\u0027s childhood friend, now a world famous soccer star; Darren seems that his experience returning might be a good one...\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/lord-of-the-shadows-the-saga-of-darren-shan-11.jpg","author":"Darren Shan","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2448,"title":"Sons of Destiny (The Saga of Darren Shan #12)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eThe Saga of Darren Shan #12: Sons of Destiny \u003c/p\u003e\n \u003cp\u003eAfter Darren was told by Steve that Darius is also Darren\u0027s nephew, Darren couldn\u0027t bear to kill him. He was later shown taking Darius back to his house and there he also revealed his true identity to Annie, his sister. Darren also told Annie that Darius was blooded by Steve as a Vampaneze and he would kill everyone he feeds from. Annie was told about the life and history of Darren. Darren blooded Darius so he wouldn\u0027t have to kill as a Vampaneze and becomes a vampire instead. Darren, Alice Burgess, and Vancha would have to prepare for a break in at the stadium to save their friends and the Cirque performers...\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/sons-of-destiny-the-saga-of-darren-shan-12.jpg","author":"Darren Shan","type":"Horror","link":"http://www.cunovel.com/books/","category":{"id":2,"name":"Horror","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}}]
