{"id":95877,"no":11,"title":"Page 11","content":"It was time to minimize damage. It was time to renew contacts. It was time to expect more from myself.\n I had lost the hustle, the nerve, the shit it took to keep myself standing in the spotlight. My desire to be part of the Scene shrank—I was exhausted by it all. My life—my name—had been rendered a repetitive, unfunny punch line and I was sick of eating it. Celebrity was a life lived in code—it was a place where you constantly had to decipher what people wanted from you, and where the terrain was slippery and a world where ultimately you always made the wrong choice. What made everything less and less bearable was that I had to keep quiet about this because I knew no one else who could sympathize (maybe Jay McInerney, but he was still so lost inside it all that he never would have understood) and once I grasped that I was totally alone, I realized, only then, that I was in serious trouble. My wistful attitude about fame and drugs—the delight I took in feeling sorry for myself—had turned into a hard sadness, and the future no longer looked even remotely plausible. Just one thing seemed to be racing toward me: a blackness, a grave, the end. And so during that terrible year there were the inevitable 12-step programs, the six different treatment centers, the endless second chances, the fourth intervention, the unavoidable backsliding, the multiple relapses, the failed recoveries, the sudden escape to Las Vegas, the tumble into the abyss and, finally, the flameout.\n I ultimately called Jayne. She listened. She made an offer. She held out a hand. I was so shocked that I broke into tears. What I was being given—I understood immediately—was extremely rare: a second chance with someone. I was briefly reluctant at first, but there was one factor overriding everything: no one else wanted me.\n And because of this I instantly rebounded. I got clean in May, signed a huge contract for a new novel with a reluctant Knopf and an insistent ICM in June and then moved into Jayne’s newly built mansion in July. We married later that month in a private ceremony at City Hall with only Marta, her assistant, as a witness. But Jayne Dennis was a well-known actress and “somehow” the news leaked. Immediately the National Enquirer ran an article on Jayne’s “spectacularly bad luck in love” and listed all of her ill-fated relationships (when had she dated Matthew McConaughey? Billy Bob Thornton? Russell Crowe? Who in the hell was Q-Tip?) before asking its readers, “Why is Jayne Dennis with a man who let her down so cruelly?” Comparisons were made to Anjelica Huston and Jack Nicholson, to Jerry Hall and Mick Jagger. A clinical psychologist hypothesized that famous women were no different from nonfamous women when it came to bad choices in relationships. “You can be beautiful and successful and still be attracted to a loser,” the clinical psychologist was quoted as saying, adding that “beautiful women are often geek magnets.” The article went on about my “crude insensitivity” and “refusal to disavow the comments made about Keanu Reeves’s role” in all of this. One anonymous source offered, “The novelty of dating a skunk must be arousing—she must really crave a challenge.” A “close friend” of Jayne’s was quoted as saying, “Marrying Bret Easton Ellis was one of the leading dumb choices of the new century.”\n Damage control. We sat for a Talk magazine profile (titled “Cad or Catch?”) in which Jayne defended me and I repented. The article detailed the years I’d spent mired in drugs and alcohol, though I said I was now reformed. “Vicious false things have been said about Bret,” Jayne offered. When prodded by Jayne I “indignantly” added, “Yeah, I’m bitter about them as well.” Jayne went on to lament: “This business can be so hard on relationships that I’ve lost a lot of self-confidence” and “I think nice guys—whatever that means—were so intimidated by me that the men I dated weren’t usually very caring.” The writer noted the “sidelong glance” Jayne gave me. The writer noted my “grim countenance” and did not seem to believe me when I said, “I always try to be in the moment when I’m with my kids—I’m really devoting my life to fatherhood.” (The journalist failed to notice how darkly amused I was by everything at this point in my newly sober life: a crestfallen expression, the smear of blood on a hand, the heart that had stopped beating, the cruelty of children.) This writer had his own pop-psychology take on matters: “Famous women are known for sabotaging themselves because they don’t feel they deserve what they have” and “It takes character to resist a cad, and celebrities definitely do not have stronger than average character.” The writer also asked me questions along the lines of “Some reviewers have doubts about your sincerity—how do you respond?” and “Why did you pass out at the Golden Globe Awards last year?” But Jayne kept coming through with sound bites like “Bret is my source of strength,” to which an unnamed friend responded, “That’s a joke. Let’s face it, the reason Jayne married Bret Ellis is all about low self-esteem. She deserves better than a professional frat boy, okay? Ellis is a complete hoser.” Another unnamed friend was quoted as saying, “Bret wouldn’t even escort her to prenatal care appointments! We’re talking about a guy who smoked Thai sticks in taxicabs.” Jayne admitted that being attracted to “bad boys” had been an addiction and that their “unpredictability” gave her a rush. “Hey, I’m an interesting date,” I’m somehow quoted as saying. Another anonymous source: “I think she’s with Bret because Jayne’s a fixer-upper—she has convinced herself that a good guy’s in there.” Another nameless source disagreed and put it more succinctly: “He’s. A. Dick.” My own conclusion was “Jayne makes my life complete—I’m a grateful guy.” The article ended—shockingly, I thought—with: “Good luck, Jayne.” \n","sourceLink":"https://allnovel.net/lunar-park/page-11.html","bookId":2592,"book":{"id":2592,"title":"Lunar Park","description":"Storyline: \n \u0027Lunar Park\u0027 confounds one expectation after another, passing through comedy and mounting psychological and supernatural horror toward an astonishing resolution - about love and loss, fathers and sons - in what is surely the most powerfully original and moving novel of an extraordinary career.\n \n","cover":"https://allnovel.net/images/lunar-park.jpg","author":"Bret Easton Ellis","type":"Horror","source":"allnovel","link":"https://allnovel.net/lunar-park.html","creation":"Oct 5, 2019 8:58:54 AM","modification":"Oct 5, 2019 6:15:16 PM"}}
