{"id":95978,"no":112,"title":"Page 112","content":"Apparently I specified by typing in “Midland County.”\\n\\n This narrowed the list considerably.\\n\\n Supposedly I checked out a few Web sites, but I don’t remember doing so.\\n\\n Supposedly I “decided” on Robert Miller’s Northeastern Paranormal Society.\\n\\n I sent a drunken e-mail. I left my cell number as well as the number at the Four Seasons.\\n\\n According to the writer: Jayne called from Toronto at 5:45 after speaking to Marta, who told her what happened at the house. I have no recollection of this.\\n\\n Also according to the writer: Jayne was sipping coffee while having her makeup done.\\n\\n My wife thought I was overreacting and she appreciated it.\\n\\n Your wife is a fool, the writer murmured.\\n\\n You said, trying to control your slurring, “We’ll be here until you get back—I just want to make sure the kids are safe.”\\n\\n You did not have an answer for Jayne when she asked you, “Safe from what?”\\n\\n Hadn’t you once wanted to “see the worst”? the writer asked me. Didn’t you once write that somewhere?\\n\\n I might have. But I don’t want to anymore.\\n\\n It’s too late, the writer said.\\n\\n 26. the meeting\\n\\n Robert Miller called the cell phone I held in my hand as I slept. The ringing was so muffled that it was the vibration that woke me. I automatically flipped the phone open and said “Yes” without checking to see who it was. The conversation was brief. I was barely paying attention because I was lying in a bed in a strange hotel room and it was nine o’clock in the morning and from where I was squinting through my open door I could see Marta dressing Sarah for school while Robby sat in front of a TV with his uniform already on, both of them seemingly unfazed—an image that had the gauzy quality of a clichéd dream. Someone was telling me over the phone that he had received an e-mail and had typed in my name on Google (the writer reminded me that this suggestion was his idea, and I had sent it along in order to legitimize myself) and that he believed I was, in fact, the man I claimed to be. He told me my “case” was intriguing to him. The voice suggested we meet at the Dorseah Diner in Pearce. The voice gave me an address that I scribbled down. And then last night came back. This happened when Robert Miller asked me to bring a diagram of 307 Elsinore Lane so I could point out where the “major haunting sites” were located within the house. We agreed to meet at ten o’clock.\\n\\n I had grabbed about three hours of dreamless sleep, and as I hobbled into the sitting room wearing only boxer shorts and a white T-shirt stained with droplets of red wine I tried smiling for the kids but the smile and the concerned, subsequent “Hey, how’s everything this morning?” were nonsense: Robby seemed relaxed and Sarah was blank-faced—until they both saw my bruise. Marta noticed the questions the bruise was raising—the memories of last night began trembling around the children—and immediately Marta made small talk about how she had called a cab from the lobby of the hotel last night that took her back to Elsinore Lane so she could pick up her car (and I panicked and had to restrain myself from asking if she went into the house and what color was it now?) so I could use the Range Rover today, and I thanked her. (She had also contacted Rosa to explain that her services would not be needed until Ms. Dennis got back from Toronto.) I asked the kids how they were again. Robby shrugged and tried to smile sincerely as he pulled his eyes away from my face. “Okay, I guess.” Sarah was, luckily, lost in her meds and had trouble pulling on a sweater. Marta would take the kids to school—regardless of last night, they needed the return of routine—and bring them back to the hotel late that afternoon. Marta said this firmly, as if she expected disagreement, but since Jayne had made this demand there was nothing I could do to alter it. Both Sarah and Robby wanted to visit Victor in the kennel before heading to Buckley, and Marta assured them they could. I wanted Marta to deal with the kids since I was clearly in no shape to do so. My assumption was that the longer they stayed away from me, the better off they were. After everyone left I got up the nerve to look at my face in a mirror. I gasped.\\n\\n The Dorseah Diner in Pearce sat off a bleak section of the interstate where the surrounding land was dead and flat—except for the huge eucalyptus trees that had burst up from the ground—trees that I was positive hadn’t existed the day before. (I estimated the diner was about five miles from the field where the doll had been discarded and killed the horse.) The diner was small and had a gravel parking lot consisting of maybe twelve spaces that were empty at ten o’clock on the sixth of November. Only six booths lined the plate-glass windows, with twelve blue and white stools rimming the counter, where the only customer sat: an old man in a raincoat, reading the local paper. I fell into a booth that seemed the farthest away from everything and ordered a cup of coffee, ignoring the frayed menu the waitress placed in front of me. I was wearing sunglasses and a baseball cap I had picked up at the gift shop in the hotel lobby, and sweatpants and the stained T-shirt under a Kenneth Cole leather jacket. The side of my face ached from the bruise, and I had to be careful about my lip since it felt like it was on the verge of splitting. I was hungover, and my body was sore and battered, and I kept chewing Klonopin in the hope it would take effect. I glanced back at the field because it was watching me, and in the distance I noticed haystacks and beyond the haystacks a line of palm trees swayed. \\n\\n","sourceLink":"https://allnovel.net/lunar-park/page-112.html","bookId":2592,"book":{"id":2592,"title":"Lunar Park","description":"Storyline: \u0027Lunar Park\u0027 confounds one expectation after another, passing through comedy and mounting psychological and supernatural horror toward an astonishing resolution - about love and loss, fathers and sons - in what is surely the most powerfully original and moving novel of an extraordinary career.\\n","cover":"https://allnovel.net/images/lunar-park.jpg","author":"Bret Easton Ellis","type":"Horror","source":"allnovel","link":"https://allnovel.net/lunar-park.html","creation":"Oct 5, 2019 8:58:54 AM","modification":"Oct 5, 2019 6:15:16 PM"}}
