{"id":95886,"no":20,"title":"Page 20","content":"After I did two huge bumps from my own gram I wanted to show off my new bike.\\n\\n “Hey, Jayster—check it out. The Yamaha Y2F-RI. A hundred and fifty-two horsepower. Top speed: a hairsbreadth under a hundred and seventy miles per hour,” I purred.\\n\\n “How much?”\\n\\n “Only ten grand.”\\n\\n “Well spent. What happened to the Ducati?”\\n\\n “Had to sell it. Jayne thought it was giving Robby bad ideas. And my argument that the kid doesn’t care about anything proved totally useless.”\\n\\n “Like father, like—”\\n\\n “Start panting with eagerness and just do the f**king coke.”\\n\\n Jay did a bump and then paused, grimacing. A moment passed.\\n\\n “What’s the matter?” I asked.\\n\\n “Actually, this baking powder is cut with way too much laxative.”\\n\\n “Oops, wrong stuff.” I took the heavily cut junk from Jay, refolded the packet and handed him a proper gram.\\n\\n “Where’s your guy, your dealer?” he asked, still grimacing, licking his lips.\\n\\n “Um, back at the college. Why?” I asked. “And please don’t take a dump in our garage.”\\n\\n “So your refund for that shit is unlikely?” he asked, opening the fresh packet. “Suck-ah!”\\n\\n “That crap’s for wastoids who can’t tell the difference—I just gave you the real stuff.”\\n\\n “You’re so cheap,” he muttered. He did two bumps and flung his head back and then smiled slowly and said, “Now, that’s much better.”\\n\\n “Anything for a bud.”\\n\\n “So, really, how is married life?” he asked, lighting a Marlboro and easing into coke chat. “The wife, the kids, the posh suburbs?”\\n\\n “Yeah, the tragedy’s complete, huh?” I laughed hollowly.\\n\\n “No, really.” Jay seemed mildly interested.\\n\\n “Marriage is great,” I said, opening my own packet again. “Unlimited sex. Laughs. Oh yeah, and continuous companionship. I think I’ve got this down to a science.”\\n\\n “And the ubiquitous student in the bathroom?”\\n\\n “Just part of the package here at Casa Ellis.” I did another bump and then bummed a cigarette.\\n\\n “No, seriously—who is she?” he asked, lighting it. “I hear today’s college women are ‘prodigious.’ ”\\n\\n “Prodigious? Is that really what you heard?”\\n\\n “Well, I read it in a magazine. It was something I wanted to believe.”\\n\\n “The Jayster. Always a dreamer.”\\n\\n “I am so relieved. I knew the whole suburban scene was a great idea for you. By the way,” he said, gesturing at a plastic skeleton hanging from a rafter, “is this how the house normally looks?”\\n\\n “Yeah, Jayne loves it.”\\n\\n He paused. “And you’re still sleeping on the couch?”\\n\\n “It’s a guest bedroom and it’s just a phase—but, wait, how did you know?”\\n\\n He just inhaled on his cigarette, debating whether to tell me something.\\n\\n “Jay?” I asked. “Why do you think I’m sleeping in the guest bedroom?”\\n\\n “Helen told me that Jayne said something about you having bad dreams.”\\n\\n Relieved to have an out, I said, “I’m not having any dreams at all.”\\n\\n Jay’s expression led me to believe that this was not all he’d been told.\\n\\n “Look, we’re in couples counseling,” I admitted. “It helps.”\\n\\n Jay took this in. “You’re in couples counseling.” He considered this as I nodded. “After three months of marriage? That does not bode well, my friend.”\\n\\n “Hey, earth to Jayster! We’ve known each other for almost twelve years, man. It’s not like we met last July and just decided to elope.” I paused. “And how in the hell did you know I’m sleeping in the guest room?”\\n\\n “Um, Bretster, Jayne called up Helen.” He stopped, did another bump. “Just thought I’d warn you.”\\n\\n “Oh, Jesus, why would Jayne call up your wife?” I tried to toss off this question casually but shuddered with coke-induced paranoia instead.\\n\\n “She’s worried that you’re using again, and I guess”—Jay made a gesture—“she’s wrong . . . right?”\\n\\n “Haven’t we outgrown all this tired irony? Weren’t we supposed to give up acting twenty-two forever?”\\n\\n “Well, you’re wearing a marijuana T-shirt at your own Halloween party, where you just were making out with a coed in the bathroom, so the answer to that, my friend, is a definite nope.” \\n\\n","sourceLink":"https://allnovel.net/lunar-park/page-20.html","bookId":2592,"book":{"id":2592,"title":"Lunar Park","description":"Storyline: \u0027Lunar Park\u0027 confounds one expectation after another, passing through comedy and mounting psychological and supernatural horror toward an astonishing resolution - about love and loss, fathers and sons - in what is surely the most powerfully original and moving novel of an extraordinary career.\\n","cover":"https://allnovel.net/images/lunar-park.jpg","author":"Bret Easton Ellis","type":"Horror","source":"allnovel","link":"https://allnovel.net/lunar-park.html","creation":"Oct 5, 2019 8:58:54 AM","modification":"Oct 5, 2019 6:15:16 PM"}}
