{"id":95906,"no":40,"title":"Page 40","content":"“I don’t think you are.”\n “Why not?”\n “Because you haven’t mentioned him once since you’ve been here.”\n 7. robby’s room\n Marta was in the kitchen making dinner, stir-frying vegetables in an aluminum wok, while the kids were upstairs getting dressed for trick-or-treating. It was dark out now but on the drive from Dr. Kim’s back to the house I noticed parents were already walking their costumed children through the town’s neighborhoods as dusk approached, which I took as a sinister reminder of the missing boys and which moved me to stop at a liquor store and buy a bottle of Groth Sauvignon Blanc and a magnum of Ketel One, and once I was safely ensconced in my office I poured half the wine into an oversized coffee cup and hid both bottles beneath my desk (my furniture was still rearranged). I wandered around the house with nothing to do. Passing the bowl of mini Nutri-Grain bars on a table by the front door, I went outside. Someone had already lit the jack-o’-lanterns. Victor was lying on the lawn. When he gave me a cursory look I gave one back and then picked up a Frisbee and threw it at the dog. It landed near where he was lying. He glanced at it contemptuously, then lifted his head and looked over at me as if I were a fool before nudging the orange disc away with his snout.\n Back in the house I moved through the living room and noticed that the furniture had been placed back in its original position. Yet I still felt like I was viewing the room from an unfamiliar angle. The carpet looked darker, shaggier, the pale beige now morphing into something that bordered on teal or green—and the morning’s vacuuming still hadn’t cleaned up the footprints that were embedded in it. I kicked lightly at one of them—it was large and ash-colored—and was trying to smooth out the carpeting with the toe of my loafer when from upstairs I suddenly heard Jayne shout, “You’re not going as Eminem!” and a door slammed. I took a Klonopin, finished my wine, poured myself the rest of the bottle and carefully walked upstairs to Robby’s room to see if he was okay.\n As I approached his door I saw the scratches he had mentioned that morning. They were clustered near the bottom of the door, and though they weren’t the deep grooves I had anticipated, the paint had been clawed off and I thought it was probably just Victor trying to gain entry. No one from the party had been upstairs, but then I flashed on Sarah’s torn pillow and fleetingly thought that maybe Robby had made the scratches himself—a hostile gesture, something to garner attention, whatever—until I realized that this didn’t seem like something Robby would ever do; he was far too passive and enervated to pull off a stunt like that. And then I flashed back on the Terby and the ripped pillow again. The kids were unreliable—their meds were proof of that. Plus Robby had recently switched antidepressants. Luvox had now been added for the anxiety attacks that had plagued him since he was six, and which had increased in intensity since I arrived—and who really knew what the side effects were? His physician had assured us that except for mild gastrointestinal problems there weren’t any, but that’s what they always say, and anyway, without the drugs Robby couldn’t sit still. Without the meds he wouldn’t have been able to visit the planetarium. Without the Ritalin he couldn’t have cruised the mall earlier in the week for a costume. I almost tripped over a skateboard as I entered his room, but the TV’s volume was so high that Robby, who was sitting on the bed, didn’t notice.\n Robby’s room had a space-age theme: planet and comet and moon decals were pasted all over the walls suggesting that you were now floating within a night black sky somewhere deep in space. The carpet revealed itself to be a Martian landscape, impressively detailed with canyons and fissures and craters. Spheres made of glass beads dangled from a glittering, savage-looking asteroid that hung from the ceiling above a king-sized art deco bed fitted with a stylish comforter. Along with the ubiquitous Beastie Boys and Limp Bizkit posters were those of various moons: Jupiter’s Io and Saturn’s Titan and the massive rifts of Uranus’s Miranda. The room also contained a minifridge, brightly colored lamps, a leather sofa and a stereo, and one entire wall was a stark black-and-white photo mural of a deserted skate park. Video game cartridges were scattered across the floor in front of the wide-screen TV, now hooked up to PlayStation 2 amid a pile of Simpsons and South Park DVDs. There was a stack of new Tommy Hilfiger shirts on his bed. Japanese action figures lined the bookshelves, which contained mostly wrestling magazines and the entire Harry Potter series, and above the shelves was a large bronze painting of the zodiac. The remains of a Starbucks iced chai sat next to a giant translucent moon that glowed from the computer—Robby’s screensaver. \n","sourceLink":"https://allnovel.net/lunar-park/page-40.html","bookId":2592,"book":{"id":2592,"title":"Lunar Park","description":"Storyline: \n \u0027Lunar Park\u0027 confounds one expectation after another, passing through comedy and mounting psychological and supernatural horror toward an astonishing resolution - about love and loss, fathers and sons - in what is surely the most powerfully original and moving novel of an extraordinary career.\n \n","cover":"https://allnovel.net/images/lunar-park.jpg","author":"Bret Easton Ellis","type":"Horror","source":"allnovel","link":"https://allnovel.net/lunar-park.html","creation":"Oct 5, 2019 8:58:54 AM","modification":"Oct 5, 2019 6:15:16 PM"}}
