{"id":95916,"no":50,"title":"Page 50","content":"It was silent in the car—except for the Backstreet Boys—as that day came rushing back and I forced myself to forget about it while I cruised onto the interstate. “Daddy, why don’t you work?” Sarah now asked. She was making satisfied smacking sounds after swallowing each Skittle. “Well, I do work, honey.” “Why don’t you go to an office?” “Because I work at home.” “Why?” “Because I’m a stay-at-home dad,” I answered calmly. “Hey, where are we? A cocktail party?” “Why?” “Please don’t do this now, honey, okay?” “Why do you stay at home?” “Well, I work at the college too.” “Daddy?” “Yes, honey?” “What’s a college?” “A place I go to teach singularly untalented slackers how to write prose.” “When do you go?” “On Wednesdays.” “But is that work?” “Work puts people in bad moods, honey. You don’t really want to work. In fact you should avoid work.” “You don’t work and you’re in a bad mood.” Robby had said this. Tensing up, I glanced at him in the rearview mirror. He was staring out the window, his chin in his hand. “How do you know I’m in a bad mood?” I asked. He didn’t say anything. I realized the answer to that question required an elaboration that Robby wasn’t capable of. I also realized: Let’s not go there. “I think I come off as a pretty happy guy,” I said. A long, horrible pause. “I’m very lucky,” I added. Sarah considered this. “Why are you lucky, Daddy?” “Well, you guys are very lucky too. You lead very lucky lives. In fact you’re even luckier than your dad.” “Why, Daddy?” “Well, Daddy has a very hard life. Daddy would like snack time. Daddy would like to take a nap. Daddy would like to go to the playground.” I could see in the rearview mirror that Robby had clamped his hands over his ears. We were passing a waterslide that had closed for the season when Sarah shouted, “I want to go on the waterslide!” “Why?” It was my turn to ask. “Because I wanna slide down it!” “Why?” “Because it’s fun,” she said with less enthusiasm, confused at being on this side of the questioning. “Why?” “Because . . . I like it?” “Why do you—” “Will you stop asking her why?” Robby said fervently, pleading. I quickly glanced in the rearview mirror at Robby, who looked stricken. I averted my gaze to where the Backstreet Boys CD was spinning. “I don’t know why you kids listen to this crap,” I mumbled. “I should buy you some CDs. Make you listen to something decent. Springsteen, Elvis Costello, The Clash . . .” “Who in the hell is Elvis Costello?” We had pulled off the interstate and were heading toward the mall on Ophelia Boulevard when Robby asked this and when I slowed down for a stop sign I saw Aimee Light’s BMW pull out of the Whole Foods parking lot on the other side of the road. And I could see that someone was in the passenger seat. And that it was a man. Robby’s comment about Elvis Costello, the stop sign, spotting Aimee’s car, realizing that she was driving with a man—all this happened within the space of a few seconds, almost simultaneously. I immediately made a U-turn and started trailing them. Sarah was lip-synching to the Backstreet Boys when suddenly she whirled around in her seat. “Daddy, where are we going?” “We’re going to the mall, honey.” “But this isn’t the way to the mall.” “Just sit back and appreciate your father’s driving skills.” “But Daddy, where are we going?” “I’m just curious about something, honey.” She was driving. She was laughing. I was directly behind them and she was laughing. And then she reached over and touched the side of his face. At the next light (three blocks in which I heard nothing but her laughter and saw only the back of a white BMW) she kissed him. I immediately had to resist the urge to press down on the horn. I wanted to pull over next to them. I wanted to see who the guy—my rival—was. But the boulevard was crowded and I couldn’t pull next to her in either lane. I don’t remember if the kids were saying anything to me (I had blocked them out) as I reached for my cell phone and dialed her number (I had planned to do this at the mall anyway while the kids were watching the movie) and—even in this panicked, jealous state—I experienced the pang of guilt I always felt dialing Aimee Light’s number because I had it memorized yet had trouble remembering the number of the house in which I lived.","sourceLink":"https://allnovel.net/lunar-park/page-50.html","bookId":2592,"book":{"id":2592,"title":"Lunar Park","description":"Storyline: \u0027Lunar Park\u0027 confounds one expectation after another, passing through comedy and mounting psychological and supernatural horror toward an astonishing resolution - about love and loss, fathers and sons - in what is surely the most powerfully original and moving novel of an extraordinary career.","cover":"https://allnovel.net/images/lunar-park.jpg","author":"Bret Easton Ellis","type":"Horror","source":"allnovel","link":"https://allnovel.net/lunar-park.html","creation":"Oct 5, 2019 8:58:54 AM","modification":"Oct 5, 2019 6:15:16 PM"}}
