{"id":95929,"no":63,"title":"Page 63","content":"At the top of the stairs I turned. It was dark in the hall leading to the master bedroom, and it was silent. But my eyes soon adjusted, and the corridor took on a purplish tint. The strength it took to walk through that hall came solely from a rising panic.\n “Hello?” I called out into the darkness, my voice vibrating hoarsely. “Hello?”\n I kept saying this as I moved down the hall toward the door at the end of it.\n A sconce flickered and then dimmed as I passed it.\n Another one followed suit.\n And then I heard something. A shuffling sound. It came from behind the door of the master bedroom.\n And from where I was standing in the middle of the darkened hallway, I saw, in the gap below the door, the band of light go black.\n And then I heard giggling.\n I moaned. The giggling continued from behind the door.\n But it was giggling disconnected from humor.\n The sconces had stopped flickering, and the only light in the hallway was the moon flooding through the large window that looked over the backyard. I could see Victor sitting on his haunches, staring intently at the house, as if he was standing watch (But against what?), and behind the dog was the field, which in the moonglow resembled a flat silver sheet.\n The giggling turned into a high-pitched squeal.\n I blindly made my way toward the master bedroom; I couldn’t see anything. I was letting the wall I was leaning against guide me toward it. I was only a couple steps away when I heard the door opening.\n “Hello? Who is it? Hello?” My voice was toneless. I reached under my shirt for the gun.\n The squealing had stopped.\n In the darkness the door opened and something rushed out.\n It was padding toward me but I couldn’t see anything.\n “Hey!” I yelled, then it leapt into the air and flew by me.\n I spun around, flailing at it.\n And then the door to Robby’s room slammed shut.\n I was now holding the gun by my side and felt my way in the darkness, once again relying on the wall, until I was at Robby’s door.\n “Mr. Ellis?” I heard Wendy call. “What’s going on? You’re frightening the kids.”\n “Call the police,” I shouted, making sure the thing in Robby’s room could hear me. “Call 911 now, Wendy. Just do it!”\n “Dad?” This was Robby.\n “It’s okay, Robby, everything is okay. Just get outside.” I tried to keep my voice from wavering.\n I breathed in and slowly opened Robby’s door.\n The room was completely dark except for the screen-saver moon glowing from the computer. The window looking onto Elsinore Lane was open.\n I thought I sensed movement in the room and about four steps inside I heard something breathing raggedly.\n “Who are you?” I shouted. Fear was crawling through me. I had no idea what to do. “I have a f**king gun,” I shouted uselessly. (That you don’t know how to use, I could imagine the thing chuckle, mocking me.)\n I backed up and ran my free hand up and down the wall until I found the light switch.\n And that was when something bit me on the palm of the hand that was reaching for the light switch. There was a hissing noise, then a stinging sensation in my hand.\n I shouted involuntarily and flicked on the lights.\n Holding the gun in my outstretched hand, I swept it across the room.\n The only thing that moved was the Terby, which had landed on the floor and lurched forward before tilting over onto its side, its strange eyes fixed on me.\n It was lying next to a small dead mouse that had been gutted.\n But there was nothing else in the room. And I almost broke down with relief.\n I swallowed hard and slowly moved to the open window.\n When I heard the screeching of tires I ran toward it.\n Outside on Elsinore Lane, the cream-colored 450 SL disappeared around the corner onto Bedford Street.\n I stumbled down the staircase and out the front door, where Wendy and Robby and Sarah were now standing, dumbstruck. Wendy reached down and picked Sarah up and held her tightly, a protective gesture.\n “Did you see that car?” I was panting and suddenly realized I was going to be sick. I turned away from them and leaned over and vomited onto the lawn. Sarah started crying. I vomited again—this time more violently—in spasms. I wiped my mouth with the back of the hand holding the gun, trying to regain my composure.\n “Did you see anybody get into that car?” I asked again. I was still panting.\n Robby stared at me with disgust and walked back into the house.\n “You’re crazy!” he shouted before I heard him furiously burst into tears. \n","sourceLink":"https://allnovel.net/lunar-park/page-63.html","bookId":2592,"book":{"id":2592,"title":"Lunar Park","description":"Storyline: \n \u0027Lunar Park\u0027 confounds one expectation after another, passing through comedy and mounting psychological and supernatural horror toward an astonishing resolution - about love and loss, fathers and sons - in what is surely the most powerfully original and moving novel of an extraordinary career.\n \n","cover":"https://allnovel.net/images/lunar-park.jpg","author":"Bret Easton Ellis","type":"Horror","source":"allnovel","link":"https://allnovel.net/lunar-park.html","creation":"Oct 5, 2019 8:58:54 AM","modification":"Oct 5, 2019 6:15:16 PM"}}
