{"id":95932,"no":66,"title":"Page 66","content":"Or so I told myself. Because I knew better. I knew what had happened last night.\n Last night was the reality.\n Yet in order to move on I needed to rationalize the things I had seen to prove to myself that I wasn’t losing my mind. It took an immense amount of concentration and balance to pivot back and forth between the illusory and what you knew without a doubt was true and real, and you had to hope that you wouldn’t unravel somewhere on that trail that connected the two. So I told myself things on November third. I needed to do this because another day was waiting for me, and if I was going to get through it with any semblance of sanity I would have to deny last night. Cut the following from the work-in-progress: The character I had created, a monster, had escaped from a novel. Convince yourself that he had not been in the house last night. (The cream-colored Mercedes was trickier because of the California plates.) Pretend that the Terby hadn’t bitten you (despite the presence of a small scab on my palm) and that the detective who had stopped by on Saturday was full of ominous and confused bullshit. Invent a new chapter heading, “The Night That Never Happened.” Tell yourself it was all a dream. Last night I dreamt that by the light of the pool I saw the Terby tottering by the chrysanthemum bush, delicately feeding on an orange flower. Last night I dreamt this image when I roamed the house in my sleep, checking the locks on every door and window. I dreamt that the doll had somehow escaped from Sarah’s arms and made its way into the backyard. Last night I dreamt that the sounds I’d heard in the hallway coming from behind the door of the master bedroom were those of a child weeping. Last night I dreamt that another squirrel lay gutted on the deck, its intestines pulled from its stomach, its head missing. Last night I dreamt I hadn’t been at that wedding in Nashville where I first saw Robby, and where he took my hand in his and whispered sshhh because there was something he wanted to show me underneath the hedges in a hotel garden. And I dreamt the gentle slope of the lawn we moved across and our shadows tracking along the grass below us, and I dreamt that Robby’s forward motion was carrying me with him, just as I had dreamt the same hand of my father’s when I had guided him toward a bank of palm trees in Hawaii to show him the same lizard Robby had tried to show me and which didn’t exist in Nashville either. Because of this dreaming, the equilibrium required to get through the day returned. Because of this erasure the day was so much easier. I was gliding through it—partly because I was exhausted from lack of sleep (that night I hadn’t gotten closer than an uncomfortable doze) and the Xanax I kept popping, and partly because the writer had convinced me that everything was normal even though I knew the day’s surface tranquility was something brief, the respite from a nearing and total darkness.\n My original plan that Monday was to keep out of sight until Jayne and I left for Buckley at seven that night. But there was no need to hide since the kids were at school and Jayne was training at the gymnasium in town for the reshoots. Once the house was empty (except for Rosa vacuuming the footprints that did not exist) I needed to occupy myself, so I inspected things.\n First, I casually looked through the newspapers to see if there was any more information about the missing boys.\n There was not.\n I also looked for anything pertaining to what Donald Kimball had told me.\n There was not.\n When I entered the master bedroom I found nothing (but what was I looking for? what clues does a phantom leave?), and as I stood by the window I opened the venetian blinds and stared into the Allens’ yard and, for a brief moment, thought I saw myself lying on that chaise longue, looking back up at myself. It was only a flash, but suddenly I was that silhouette from last night, the shadow that I had dreamt. (In the same flash I had suddenly become that boy sitting next to Aimee Light in her BMW.) I moved around the room, replicating the shadow’s movements, wondering what it had been looking for. Nothing seemed to be missing from my closet or drawers, and there were no visible footprints on the carpet (though in my dreams they were in the living room and they were now in my office as well). I finally moved toward Robby’s door and, yet again, hesitated before stepping in. The scratches were still in the bottom right-hand corner and they needed to be painted over and\n (I hate you. How many times had I said that to my father? Never. How many times had I wanted to? Thousands.)\n the mouse was gone, I told myself, because I had dreamt it, and the room didn’t contain a single detail or clue or reminder of what I had dreamt in there last night. Boxes half-filled with old clothes for the Salvation Army sat in front of Robby’s closet. The moon continued pulsing on the screen saver. \n","sourceLink":"https://allnovel.net/lunar-park/page-66.html","bookId":2592,"book":{"id":2592,"title":"Lunar Park","description":"Storyline: \n \u0027Lunar Park\u0027 confounds one expectation after another, passing through comedy and mounting psychological and supernatural horror toward an astonishing resolution - about love and loss, fathers and sons - in what is surely the most powerfully original and moving novel of an extraordinary career.\n \n","cover":"https://allnovel.net/images/lunar-park.jpg","author":"Bret Easton Ellis","type":"Horror","source":"allnovel","link":"https://allnovel.net/lunar-park.html","creation":"Oct 5, 2019 8:58:54 AM","modification":"Oct 5, 2019 6:15:16 PM"}}
