{"id":95935,"no":69,"title":"Page 69","content":"I sighed and leaned against the wall. “No. Not really. No, Nadine. I don’t.”\\n\\n “Why not?” She seemed activated by my admission, and the indignation in her voice seemed based not on drunkenness but on fear. “The point, Bret, the point is”—and now she breathed in and made a muffled, sullen sound—“the point is that no one is taking them anywhere.”\\n\\n I nodded thoughtfully, as if mulling this over, and then said, “Sorry, but that just really doesn’t resonate, Nadine.”\\n\\n “The point . . .”—she was now openly scornful—“the point is that you need to know this . . .” She reached down next to the granite bench and I was shocked to see her pick up a near-empty bottle of wine. Nadine had actually stolen a bottle of the Stonecreek Chardonnay from the reception and was nursing it in the dark courtyard of her children’s school. She carefully poured what was left of it into her plastic cup. I might have laughed if it hadn’t been for my growing concern that the vines were coiling around us. Suddenly, I was afraid. I was losing the signal of the dream. And I realized that Nadine’s behavior was motivated not by alcohol but by a specific anxiety that was spiraling out of control. “The point is”—she took a sip and pursed her lips—“that none of them are ever coming back.”\\n\\n “Nadine, I think we need to find Mitchell, okay?” was all I could say.\\n\\n “Mitchell, Bret, is standing next to your wife while Principal Cameron takes advantage of a photo op.” The way Nadine said this opened something up while failing to clarify anything—all it did was add confusion. Suddenly, in the phrasing of the sentence, and the way she had pushed down on certain words, all of our relationships were rearranged. The dream was slipping away.\\n\\n Nadine sipped her wine and kept staring at something invisible in the darkness. The vines rustled around us. I kept trying to avoid her face and then made an attempt to stand up. Nadine had been quiet for so long that I didn’t think she would notice, but her hand shot out once I made my move and she gripped my forearm, pulling me back to her. She was staring at me now—her eyes bleeding with fear—and I had to turn away. That dream I had constructed so carefully was melting. I had to leave Nadine before it vanished totally, before it was consumed by someone else’s madness. It was becoming Nadine’s dream now, but the urgency in which she was relaying it to me had the horrible texture of truth. As I sat back down she said in a rushed whisper, “I think they’re leaving us.”\\n\\n I didn’t say anything. I swallowed hard and went cold.\\n\\n “Ashton collects information about the boys.” Nadine was still gripping my forearm and she was staring at me and she kept nodding. “Yes. There’s a file on his computer, and he didn’t know I found it. He collects information about the boys”—she breathed in and swallowed rapidly—“and he trades it with his friends . . .”\\n\\n “This is really none of my business, Nadine.”\\n\\n “But it is, Bret. It’s very much your business.”\\n\\n “Why is it my business, Nadine?”\\n\\n I suddenly hated her for what she was confessing to me and again I wanted to walk away, but I couldn’t. She lowered her voice and glanced around the courtyard to see if there was anything in the darkness listening to us, almost as if there was a risk associated in confessing this to me.\\n\\n “Because Robby is one of the boys he’s trading this information with.”\\n\\n I paused for breath. Everything started wasting away at that point.\\n\\n “What are you talking about, Nadine?” I tried pulling my arm from her grasp.\\n\\n “You don’t understand, Bret”—she was almost panting—“there are hundreds of pages devoted to those boys that Ashton has downloaded.”\\n\\n I could feel her trembling as I tore my arm free and turned away.\\n\\n “He e-mails them, Bret.” Nadine said this so loudly that it echoed in the empty courtyard.\\n\\n “He e-mails who?” I couldn’t stop myself. I had to ask.\\n\\n “He’s sending e-mails to those boys.”\\n\\n I stopped pulling away and then, forced by fear, slowly turned to face her.\\n\\n “He knew . . . some of the boys who disappeared?” I asked.\\n\\n Nadine stared at me. I felt that if she said yes, everything would collapse.\\n\\n “No,” she said. “He didn’t know any of them.”\\n\\n I sighed. “Nadine . . .” I started wearily.\\n\\n “But he e-mailed them after they disappeared,” Nadine whispered. “That’s what I couldn’t understand. He e-mailed them after they disappeared.” \\n\\n","sourceLink":"https://allnovel.net/lunar-park/page-69.html","bookId":2592,"book":{"id":2592,"title":"Lunar Park","description":"Storyline: \u0027Lunar Park\u0027 confounds one expectation after another, passing through comedy and mounting psychological and supernatural horror toward an astonishing resolution - about love and loss, fathers and sons - in what is surely the most powerfully original and moving novel of an extraordinary career.\\n","cover":"https://allnovel.net/images/lunar-park.jpg","author":"Bret Easton Ellis","type":"Horror","source":"allnovel","link":"https://allnovel.net/lunar-park.html","creation":"Oct 5, 2019 8:58:54 AM","modification":"Oct 5, 2019 6:15:16 PM"}}
