{"id":19742,"no":1,"title":"PREFACE","content":"TO THE FIRST AMERICAN EDITION (PUBLISHED BY WILEY \u0026 PUTNAM IN 1845). You have here, my good friends, sundry moral and entertaining stories, invented by the monks of old, and used by them for amusement, as well as for instruction; from which the most celebrated poets, of our own and other lands, have condescended to draw their plots. The improvements and refinements of this age will naturally lead you to condemn as absurdities, many of the incidents with which these tales abound. Considering the knowledge of the present day, you are justified in so doing. But I pray you to bear in mind that few qualities are more dependent on time, than probability and improbability. When you read these tales, you must, for the time, retrace your steps to the age in which they were written; and though the tale may seem absurd to us of this day, yet if it was calculated to impress the ivminds of those for whom it was invented, and to whom it was told, its merit was great, and therefore deserving of due praise. A giant or a magician was as probable to the people of the middle ages, as electricity to us. I pray you bear this in mind whilst you judge of these tales. Romantic fiction pleases all minds, both old and young: the reason is this, says an old Platonist, “that here things are set down as they should be; but in the true history of the world, things are recorded indeed as they are, but it is but a testimony that they have not been as they should be. Wherefore, in the upshot of all, when we shall see that come to pass, that so mightily pleases us in the reading the most ingenious plays and heroic poems, that long afflicted Virtue at last comes to the crown, the mouth of all unbelievers must be stopped.” To the work of the ingenious Mr. Swan, the only translator of these stories that I know of in this country, I am indebted for my first introduction to these old tales; and I cannot conclude these few words without thanking him for having often lightened my labors by his close and admirable versions. G. B. December, 1844.","sourceLink":"http://novel.tingroom.com/duanpian/2793/77291.html","bookId":1290,"book":{"id":1290,"title":"Tales from the Gesta Romanorum","description":"简介： You have here, my good friends, sundry moral and entertaining stories, invented by the monks of old, and used by them for amusement, as well as for instruction; from which the most celebrated poets, of our own and other lands, have condescended to dr...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2793","creation":"Aug 1, 2019 12:24:48 AM","modification":"Aug 1, 2019 12:24:48 AM"}}
