{"id":19746,"no":5,"title":"CHAPTER IV.","content":"Modern Conversions of the Old Tales—The Three Black Crows—King Lear—The Emperor of Rome and his Three Daughters—The Merchant of Venice—The Three Caskets. “What a mine must these tales of the old monks have been to writers of every age,” said Herbert, as the friends returned to their old book for the fourth evening. “The purloiners of gems from their writings have been innumerable, and of all ages. Gower, Lydgate, Chaucer, Shakspeare, of olden days; and in our own times, Parnell, Schiller, Scott, and Southey have been indebted to the didactic fictions of the old monks for many a good plot and many an effective incident.” “As the old monks themselves were indebted to the earlier legends of other lands, the traditions of their own convent, or the meagre pages of an old chronicle.” “Even the veteran joker, Mr. Joe Miller, has been indebted to the Gesta for one of his standard tales,” said Lathom; “The Three Black Crows dates back to the middle ages.” “The moral, however, was hardly so polite as that now attached to the story; for the monk boldly headed his tale with this inscription: “‘Of women who not only betray secrets and lie fearfully.’” 59“Pray let us hear the original Joe Miller,” said Thompson. “Here then you have,” replied Lathom, “the original— “Tale that will raise the question, I suppose, What can the meaning be of three black crows?” THE THREE BLACK CROWS. Once upon a time, there lived two brothers, the one a cleric, the other a layman. The former was always saying that no woman could keep a secret, and as his brother was married, he bade him test the truth of this assertion on his own wife. The layman agreed; and one night, when they were alone, he said, with a sorrowful face, to his spouse: “My dear wife, a most dreadful secret hangs over me; oh that I could divulge it to you; but no, I dare not; you never could keep it, and, if once divulged, my reputation is gone.” “Fear not, love,” rejoined the wife; “are we not one body and one mind? Is not your advantage my benefit, and your injury my loss?” “Well, then,” said the husband, “when I left my room this morning a deadly sickness came upon me, and after many a pang, a huge black crow flew out of my mouth, and, winging its way from the room, left me in fear and trembling.” 60“Is it possible?” asked the wife; “yet why should you fear, my life? be thankful rather that you have been freed from so noxious and troublesome an occupant.” Here the conversation ended. As soon as it was day, up got the wife, with her thoughts full of the black crow, and hastened to a neighbor’s house. “Dear friend,” said she, “can I trust you with a secret?” “As with your life,” rejoined the confidante. “Oh, such a marvellous accident happened to my husband!” “What? what?” asked the anxious friend. “Only last night, he felt deadly sick, and, after a great deal of pain, two black crows flew out of his mouth, and took wing from the room.” Away went the wife home, with her mind disburthened of the awful secret; whilst her friend hastened to her next neighbor, and retailed the story, only with the addition of one more crow. The next edition of the legend rose to four; and at last, when the story had gone round the gossips of the village, a flock of forty crows were reported to have flown from the poor man’s mouth; and there were not a few who remembered seeing the black legion on the wing from the man’s window. The consequence of all this 61was, that the poor husband found himself saddled with the very questionable reputation of a wizard, and was obliged to call together the village, and explain to them the true origin of the fable. On this his wife and her confidantes were overwhelmed with ridicule and shame, and the men of the village were the more impressed with the truth of the cleric’s maxim. “Did the old monk attempt a further interpretation of his ungallant fable?” asked Herbert. “Undoubtedly,” replied Lathom. “The unfortunate husband typified the worldly man, who, thinking to do one foolish act without offence, falls into a thousand errors, and has, at last, to purge his conscience by a public confession.” “Let us now pass on to Shakspeare’s plagiarisms,” said Herbert. “Improvements—new settings of old jewels, which only heighten their lustre—not plagiarisms,” replied Lathom. “King Lear dates back to the Gesta. Theodosius of Rome occupies the place of the British king; his child Theodosia is Shakspeare’s Cordelia.” THE EMPEROR OF ROME AND HIS THREE DAUGHTERS. Theodosius was emperor of Rome, mighty in power, and wise in counsel. He had no son, but three daughters, whom he loved exceedingly. Now when they were come of full 62age, the emperor called unto him the eldest and said: “How much lovest thou me?” “More than mine ownself,” replied the eldest. “It is good,” rejoined her father; “thou shalt be rewarded for thy love.” So he married her unto a neighboring king of great power and wealth. Then he sent for his second daughter, and asked her the same question. “Even as I do myself,” was the reply. At this the emperor was well pleased, and he kissed his child, and said: “I will reward thee for this thy love.” So he married her unto one of the greatest nobles of his realm. At last he sent for his youngest daughter, and when she was come into his presence, he asked her likewise how much she loved him. Theodosia bowed her head, and bent her knee to her father, as she mildly replied: “Even as my father deserveth.” Then was the emperor hurt with her reply, and he said: “Lovest thou me no more than this? thy reward shall be less than thy sisters.” So he married her unto a poor but good lord, who was one of the lesser nobles of his kingdom. Time passed away, misfortune came upon the emperor, and his kingdom was all but taken from him by the king of Egypt. Then said he 63to himself: “I will appeal to my children.” So he wrote to his eldest daughter for aid. “My lord, the king, I have here a letter from my father,” said the eldest daughter to her husband, “he asketh help of us in his misfortunes.” “Is it not just that we should aid him?” replied the king; “we will raise an army, and go and fight for him.” “Nay, my lord,” rejoined his wife, “consider the expense; send my father five knights to keep him company in his wanderings.” “Alas, alas!” said the aged emperor when he read his eldest child’s answer, “in her was my chief trust; she, that loved me more than herself, hath done only this much, how then shall I trust the other two?” Then wrote he to the second daughter, who, when she read her father’s letter, advised her husband to grant him food, lodging, and raiment, during the time of his need. The emperor was sore grieved at this reply. “Now have I tried my two daughters, and have found them wanting, let me try the third,” so he wrote to his youngest child. When the messenger brought the emperor’s letter to Theodosia, she wept sorely as she read how that her father was driven from his capital, and was become a wanderer in his own kingdom. Then went she to her husband and said: 64“Oh, my dear lord, by thy love towards me, succor me in this great distress; my father is driven from his capital by the king of Egypt, and even now wanders up and down his own kingdom, homeless and unattended.” “As thou wiliest, Theodosia,” replied the noble, “so will I do.” “Gather then a great army, raise again my father’s banner, and go, my lord, fight for my father’s throne, and under God’s blessing thou shalt conquer.” Gladly the noble obeyed the wishes of his wife; gladly did he summon his retainers and friends, and raise the royal standard. His example was all that was required; numbers flocked to the royal standard, for they wished well to the emperor, but lacked a leader. Then led he his forces against the king of Egypt, and long and fierce was the battle; but at length the emperor’s friends prevailed, the Egyptian was driven from the land, and the emperor reseated on his throne. It was a happy day for his people when Theodosius reascended his throne: round him stood all his nobles, and on his right hand his youngest daughter, and on his left her noble husband, to whom he was indebted for his restoration. Before his footstool stood his other children and their husbands, and sought to do him homage. But the emperor 65forbade them, and turning to his nobles he said: “The child that loved me but as I deserved, hath succored me in this my time of trouble; the twain that professed to love me more abundantly, have failed in the trial God ordained to them and to me. I pray ye, my nobles and knights, to ratify this my wish. When I die, let the kingdom pass to her and to her husband, for she succored her father and her country; but for these other two, let them go hence.” And the nobles and knights with one accord said: “It is well said; be it so.” “Is the Merchant of Venice among the list of plots borrowed from the Gesta?” asked Herbert. “It is inscribed as a debtor to two tales: to the one, for the incident of the bond; to the other, for that of the three caskets.” “I thought,” said Frederick Thompson, “the incident of Shylock’s bond came from the Italian of Fiorentino, a novelist of the fourteenth century.” “It is found there, and is generally translated from his work in the preface to the play, but is also found, in almost the same words, in the English Gesta, in the story of Selestinus, the Wise Emperor, who had a Fair Daughter.” “You claim also the incident of the Three Caskets.” “I claim one form of it for my old monks in the story of The Carpenter and the Owner of the Lost Treasure, and another form in the tale found in the English Gesta of the emperor Anselmus.” 66“What is the legend of the carpenter?” asked Herbert. “He is supposed to have found some gold, and to be doubting whether he should restore it to its owner, whom chance has led to the carpenter’s cottage in his inquiries after his lost treasure. To satisfy his mind he makes three cakes; one he fills with earth, another with bones, and the third has a piece of gold within it. On giving his guest the choice, the traveller is led by the weight to choose the one full of earth, and claiming a portion of that containing bones, should the first not satisfy his hunger, he gives the lightest to his host. Thus convinced that the man does not deserve his lost treasure, the carpenter drives him from his hut, and distributes the money to the poor.” “This is but a slight hint,” said Herbert; “the choice is exactly contrary to that of the play.” “In the latter story, whether original or copied, the choice is identical with that in the Merchant of Venice. The moral the writer intended to read was the deceitfulness of outward appearances.” “The old proverb,” suggested Thompson, “all is not gold that glitters.” “I will read now the form of the story in the English Gesta.” THE TALE OF THE THREE CASKETS. Centuries have passed since Anselmus reigned in Rome, whose empress was the fair daughter of the king of Jerusalem, and gracious in the sight of every man. Long had they lived happily together, but were not blest with a child, to comfort their lives, and to inherit their 67power and honors. And it came to pass that as the emperor walked in his garden, he bethought him of the constant wars of the king of Ampluy, his neighbor, who ceased not to trouble him, because he had no son to defend his dominions. And as he walked and mused, he looked on the moon, and fell into a trance, and dreamed a dream, how that the morning was very bright, and the moon looked paler on the one side than on the other. And then there flew towards him a bird of two colors; two beasts came and stood by the bird, and warmed the little creature with their heat. And lo, other beasts, mighty and terrible, came, and bowed themselves before the little bird, and went their way; and then followed these many other birds of bright plumage and sweet song, and they sang pleasantly, and waked the emperor. Anselmus was troubled with his dream, and he called for his wise men, his nobles, and his counsellors, and told them of his vision, and sought from them the interpretation of his dream. When the wise men, the nobles, and the counsellors had considered of these things, they spoke cheerfully unto the king. “Sire,” said they, “the vision betokens good to the empire, its glory shall be clearer than it is. The loss of color in the moon prefigures the loss of strength to our empress when a child 68is born unto you. The little bird is this child, our prince. The two beasts that warmed him, are the good and the great of our empire, who will give of their substance to sustain and cherish their prince. And whilst the other nations, mighty and strong, shall bow down before him, as the beasts did in the vision, so shall our people rejoice and sing with exceeding joy, as the birds sang sweetly and pleasantly in thy dream. Such, O king, is the interpretation of the vision.” Exceeding glad was the emperor at these words, and his joy was the more increased when a son was born unto him, according to the words of the wise men. When the king of Ampluy heard of the birth of the prince, he was afraid, remembering the wrong he had done to Anselmus, and foreseeing the vengeance he would experience from the prince when he should come of age and lead the armies of his father. So he turned his mind to peace, and wrote humbly unto the emperor. When Anselmus read the king’s letter he replied in peaceful terms, and promised him his protection and friendship, if he would give securities for his conduct, and acknowledge his sovereignty by a small tribute. King Ampluy read the emperor’s letter to his council, and prayed their counsel as touching 69the matter. Then said the counsellors: “The emperor’s words are good, and to be obeyed. As for the surety that he asks; is there not to our lord one daughter, a maiden fair and goodly withal, and is there not to the emperor one son, a noble prince? Contract, therefore, marriage between thy child and his, that there may be a perpetual peace.” The king obeyed the advice of his counsellors; he wrote their words unto the emperor, who received them gladly, and the marriage contract was signed. So the king sent his child by sea to the emperor’s court. The ship was a great ship, with fair masts, and able pilots, glittering with gay pennants and costly ornaments, and it bore a goodly company of nobles, knights, and titled dames, with many and rich presents to do honor to the marriage of the maiden and the prince. And it came to pass that as they sailed towards Rome, a storm rose, and drove the ship hither and thither over the waves, until she brake against a rock, and sank into the waters. And all they that were in her were drowned, save the daughter of the king, who put her trust in God and was saved. At length the storm abated, and the ship, broken and helpless, rose from beneath the waves and floated. But, lo, a great whale followed after the ship, to swallow up it 70and the maiden. So the maiden struck a light, and lighted a fire, that terrified the whale, which dared not to approach the ship for fear of the fire. At break of dawn, she fell asleep, for she was weary of watching; and as she slept, the fire ceased for want of fuel, and the whale came and devoured the maiden. When she awoke, darkness was around her on every side, for she was in the belly of the whale; but she feared not, but struck with the stone until the fire came, and thrust with a knife into the sides of the whale, that he made towards the shore, for he felt that he was wounded. In that country dwelt a noble, a servant of the emperor, who for his recreation walked on the shore the time the whale was making towards the land. When he saw the monster, he turned homeward, summoned his servants, and returning to the shore fought with the whale until it was sore wounded and like to die. And even as they smote the fish, the maiden cried with a loud voice from within the whale: “Mercy, gentle friends; mercy on me, for I am a king’s daughter.” Wondering greatly at these words, the noble hauled the fish ashore, and opening the side of the whale, released the lady from her prison. And when he heard her story, he pitied her 71sore, and took her to his own castle to comfort her until he could convey her to the court of the emperor. When Anselmus heard of the maiden’s safety, he rejoiced greatly, and came to her, and had compassion on her. “Fair maiden,” said the emperor, “sorely as thou hast been tried, and great woe as thou hast suffered for the love of my son, still must thou endure another trial ere thou be proclaimed worthy to be his wife! Let the caskets be brought hither.” Then the king’s servants brought three caskets. The first was of pure gold, richly set about with precious stones; but within was full of dead men’s bones. On this was inscribed: “WHOSO CHOOSETH ME SHALL FIND WHAT HE DESERVETH.” The second casket was made of fine silver, filled with earth and worms; and its inscription was: “WHOSO CHOOSETH ME SHALL FIND THAT WHICH HIS NATURE DESIRETH.” But the last vessel was made of lead, and without was dull and useless; but within were precious stones. On this casket was written: “WHOSO CHOOSETH ME SHALL FIND THAT WHICH GOD HATH DISPOSED FOR HIM.” Then said the emperor: “Maiden, look on these three vessels, they be rich vessels; if thou choose that wherein is profit to thee and to 72others, then thou shalt marry my son; but if thou choose that in which is no profit to thee or to others, then in peace return to thy father.” The king’s daughter lifted up her hands to God, and prayed for his grace in the hour of her trial. First she looked upon the golden casket, and as she read the words of its inscription, she said: “Full, precious, and gay, art thou, O casket, but I know not what is within; therefore, dear lord, I choose not this.” Then looked she on the silver casket, and its inscription, “Whoso chooseth me shall find that which his nature desireth.” “Alas!” said the maiden, “I know not what is herein; but this I know, that I shall therein find that which my nature desireth, even the wickedness of the flesh. Casket of silver, I will have none of thee.” Lastly she looked on the leaden casket. “Poor art thou, O casket, to look upon, and yet thy inscription giveth comfort; thou promisest, ‘that which God hath disposed’; and God never disposeth any thing harmful; by his permission, I take thee, O casket.” Then cried the emperor: “Well done, thou fair and good maiden; open thy casket, for it is full of precious gifts. Well hast thou chosen.” Then appointed he the day of the wedding; and the maiden and the prince were married 73with great solemnity, and with much honor among all the nation lived they until their lives’ end. “Your title is, I think, perfected,” said Herbert. “And yet there are those that can put in an earlier claim,” said Lathom. “An earlier claim; how far back then would you carry it?” “Nearly to the eighth century; one link between the East and the West. Damascenus, the Greek monk, who wrote the spiritual romance of Barlaam and Josaphat, makes the hermit Barlaam, late the king of a brother monarch, who commanded four chests to be made, two covered with gold, and two overlaid with pitch, and bound with common cords. In the former he placed dead men’s bones, in the latter jewels, gold, and precious ointments. He then gave his courtiers the choice; and when they chose the golden coffers, the king said: ‘I anticipated your decision, for ye look with the eyes of sense. To discern the good or evil that lies within, we must look with the eyes of the mind.’ Then he opened the chests, and showed his courtiers their error.” “It is that kind of tale that would be most acceptable to all writers,” said Herbert. “The general use they have made of it, in one form or other, is evidence of its popularity. Boccaccio has dressed it up under the story of The King and Signor Rogiero, and Gower has versified it, filling the unlucky chest with earth, stone, and rubbish, instead of men’s bones. To-morrow evening, I will give you some more instances of this kind of conversion of the old monks’ stories.”","sourceLink":"http://novel.tingroom.com/duanpian/2793/77295.html","bookId":1290,"book":{"id":1290,"title":"Tales from the Gesta Romanorum","description":"简介： You have here, my good friends, sundry moral and entertaining stories, invented by the monks of old, and used by them for amusement, as well as for instruction; from which the most celebrated poets, of our own and other lands, have condescended to dr...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2793","creation":"Aug 1, 2019 12:24:48 AM","modification":"Aug 1, 2019 12:24:48 AM"}}
