{"id":19750,"no":9,"title":"CHAPTER VIII.","content":"Southey’s Thalaba—The Suggestions of the Evil One—Cotonolapes, the Magician—The Garden of Aloaddin—The Old Man of the Mountain—The Assassins—Their Rise and Fall—Gay’s Conjurer—Sir Guido, the Crusader—Guy, Earl of Warwick. “Are you going to give us a specimen of the late Laureate’s conversions,” said Thompson, “that you borrowed my Southey?” “Even so—to claim for the magic garden of Aloaddin, the gem of the sixth book of Thalaba, at least a Latin form, if it must not be regarded as a striking instance of my Eastern theory.” “Southey did not come to your book for this idea; he was content with the apparently historical account of Purchas in his Pilgrims, or the more elaborate description of the notorious Mandeville,” rejoined Thompson. “I am very much at a loss to appreciate your account,” said Herbert, “as Southey, Purchas, and Mandeville are nearly all equally unknown to me.” “The best means of showing the progress of the story and its conversion by the poet,” said Lathom, “will be to commence with the old monk’s very short version; let that be followed by Mandeville, and that veritable author by Southey’s description. The monk’s tale is, 121 “THE SUGGESTIONS OF THE EVIL ONE.” There was a celebrated magician who had a vast castle surrounded by a very beautiful garden, in which grew flowers of the most fragrant smell, and fruits not only fair to look upon but most delicious to the taste. In short, it was a garden of Paradise; no one was allowed to see its glories, or taste its pleasures, but fools or personal enemies of the magician. When the gate was opened to any one, great was his wonder and delight; and few who entered ever wished to return. Nay, the pleasures they there enjoyed so affected their minds, that they yielded forthwith to the will of the magician, and were ready to resign to him every thing that they had. To the fools this garden appeared to be Paradise itself: its flowers and its fruits they looked upon as of immortal growth, and regarded themselves as chosen from among the inhabitants of the world as the happy possessors of the land. Beyond this they gave not one thought. Day and night they revelled in pleasure, and surrendered their minds and their bodies to lawless gratifications. At last the day of reckoning came, and the magician prepared to reap the fruits of his 122scheme. Their inheritances once placed in his power, he waited but for some moment when his victim was steeped in sensual intoxication, and then fell upon him and slew him. Thus, by his fictitious Paradise, he acquired great wealth and power. “I admire the moderation of your old monk,” said Thompson, “in not assigning a particular locality to his magician’s paradise. Purchas and Mandeville are not so moderate; the former puts Aloaddin’s abode in the northeast parts of Persia, and Mandeville locates him in the island of Milsterak, a portion of the kingdom of Prester John.” “No bad illustration,” said Herbert, “of the difference between a writer who tells a fiction as a fiction, and one who records it with the intention of making his readers believe it to be true.” “Great particularity as to time, place, and persons is the sure mark of a mendacious traveller,” remarked Lathom; “both Purchas and Mandeville have altered the object of the magician’s plot; making it his means of destroying his enemies, by persuading his victims that death in his service was only a step to a more beautiful paradise. I will read Mandeville’s tale of “COTONOLAPES, THE MAGICIAN.” In the isle of Pentexoire, that is in the land of Prester John, is a great isle, long and broad, and men call that isle Milsterak. There was a man there that was called Cotonolapes; he was full rich, and had a fair castle on a hill, and 123strong, and he made a wall all about the hill right strong and fair; within he had a fair garden, wherein were many trees bearing all manner of fruits that he might find, and he had planted therein all manner of herbs of good smell, and that bare flowers, and there were many fair wells, and by them were made many halls and chambers well dight with gold and azure, and he had made there divers stories of beasts and birds, that sung and turned by engine and orbage as they had been quick; and he had in his garden all things that might be to man solace and comfort; he had also in that garden maidens within the age of fifteen years, the fairest that he might find, and men children of the same age, and they were clothed with cloth of gold, and he said that they were angels; and he caused to be made certain hills, and inclosed them about with precious stones of jasper and crystal, and set in gold and pearls, and other manner of stones; and he had made a conduit under the earth, so that when he would, the walls ran sometimes with milk, sometimes with wine, sometimes with honey, and this place is called Paradise; and when any young bachelor of the country, knight or esquire, cometh to him for solace and disport, he leadeth them into his paradise and showeth them these things, as the songs of 124birds, and his damsels and wells; and he did strike divers instruments of music in a high tower that might be heard, and said they were angels of God, and that place was Paradise that God had granted to those who believe, when he said thus: Dabo vobis terram fluentem lacte et melle; that is to say, I shall give you land flowing with milk and honey. And then this rich man made these men drink a manner of drink of which they were drunken; and he said to them, if they would die for his sake, when they were dead they should come to his paradise, and they should be of the age of those maidens, and should dwell always with them, and he should put them in a fairer paradise, where they should see God in joy and in his majesty: and then they granted to do that he would, and he bade them go and slay such a lord, or a man of the country that he was wroth with, and that they should have dread of no man. And if they were slain themselves for his sake, he should put them in his paradise when they were dead. And so went these bachelors to slay great lords of the country, and were slain themselves in hope to have that paradise; and thus he was avenged of his enemies through his desert; and when rich men of the country perceived this cautel and malice, and the will of this Cotonolapes, they gathered them together 125and assailed the castle, and slew him, and destroyed all his goods and his fair places and riches that were in his paradise; and the place of the walls there is yet, and some other things, but the riches are not, and it is not long ago since it was destroyed. “The variation made by this worthy story-teller seems to me to be an incorporation of the history of the Assassins,” said Herbert. “Perhaps their ‘Old Man of the Mountain,’ as the chief of the Assassins was called, may have given rise to the entire fable,” rejoined Lathom. “Now, Thompson, read the poet’s conversion.” THE GARDEN OF ALOADDIN. —Thalaba stood mute, And passively receiv’d The mingled joy which flowed in every sense. Where’er his eye could reach, Fair structures, rainbow hued, arose; And rich pavilions through the opening woods Gleam’d from their waving curtains sunny gold; And winding through the verdant vale Went stream of liquid light, And fluted cypresses rear’d up Their living obelisks; And broad-leaved plane-trees, in long colonnades, 126O’erarched delightful walks, Where round their trunks the thousand tendrill’d vine Wound up, and hung the trees with greener wreaths, And clusters not their own. Wearied with endless beauty, did his eyes Return for rest? beside him teems the earth With tulips like the ruddy evening streak’d. And here the lily hangs her head of snow; And here amid her sable cup Shines the red eye spot, like one brightest star, The solitary twinkle of the night; And here the rose expands Her paradise of leaves. Then on his ear what sounds Of harmony arose! Far music and the distance-mellow’d song From bowers of merriment; The waterfall remote: The murmuring of the leafy groves, The single nightingale. * ? ? ? * ? ? ? * ? ? ? * ? ? ? * And oh what odors the voluptuous vale Scatters from jasmine bowers, From yon rose wilderness, From cluster’d henna, and from orange groves. * ? ? ? * ? ? ? * ? ? ? * ? ? ? * 127Full of the bliss, yet still awake To wonder, on went Thalaba: On every side the song of mirth, The music of festivity, Invite the passing youth. Wearied at length with hunger and with heat, He enters in a banquet room; Where round a fountain’s brink On silken carpets sat the festive train. Instant, through all his frame Delightful coolness spread; The playing fount refresh’d The agitated air; The very light came cool through silvering panes Of pearly shell, like the pale moonbeam tinged. “I think I must stop here,” said Thompson, “though the entire book seems but the poet’s amplification of the tale of Mandeville.” “The more I think on the subject, the more certain I feel that the Assassins of the eleventh century are the origin, if not of your tradition, at least of the tales of Purchas and Mandeville,” said Herbert. “I know too little of their history, to agree with you or not; surely, theirs was a purely political association,” answered Lathom. “Their original and avowed object was the placing a caliph of the race of Ismael on the throne of Bagdad; but their sacred doctrines are supposed to have embraced a wider sphere, and are known to have been converted into the means of private revenge by the adept, who 128afterwards became known as the ‘old man of the mountain.’” “Where did the old man reign?” asked Thompson. “On the mountain of Alamoot, in the north of Persia. The Vulture’s Rest, as its name imported, was not unlike the hill of Cotonolapes, or the Castle of the Magician of the Gesta. There Hassan ben Sabah gathered round him an independent society of seven degrees, with himself as their head, by the title of Sheikh of the Mountain.” “What was the date of that event?” “Within a few years of the close of the eleventh century,” replied Herbert. “His seven degrees commenced with the three grand priors, under him, the practical rulers of the society. Then came the dais, or initiated ministers; and fourthly, the refeeks, or companions. Below these were the fedavees, or devoted, who were followed by the laseeks, the aspirants, the novices of European orders. The profane, the common people, formed the last of the seven orders of the Assassins.” “The mysteries, I suppose, were not revealed to any below the third class?” remarked Lathom. “No, the dais were alone acquainted with these; what they were, besides implicit obedience to their chief, and the principle of interpreting the Koran allegorically, it is impossible to discover. By the rest of the society, the text of the Koran was to be observed in its strict letter. The fedavees were, however, the support of the society. They were composed, too often, of youths stolen from their parents, and educated in such a system as recognized the sheikh as omnipotent, and impressed on them the moral and religious duty of obeying his commands.” “From this order, then, the common idea of the Assassins arose?” said Lathom. “Undoubtedly,” rejoined Herbert. “They were led to look to his mandates as direct from heaven, and as impossible 129to be evaded. They were clothed in white, with red bonnets and girdles, and armed with sharp daggers; but when a secret and dangerous mission was imposed, the disguises of the fedavees were appropriated to the task enjoined.” “Is any thing known of their initiatory ceremonies?” “But little; Marco Polo, indeed, gives us a curious account of the garden of Alamoot bearing a very strong likeness to that of Aloaddin, whither the fedavee was borne under the influence of opiates, before being sent on any important mission; and where, on awakening, he found himself surrounded with every earthly pleasure. This, he was persuaded, is but a foretaste of the joys of paradise, which were to be the reward of his faithful performance of the mission. And thus buoyed up, the fedavees confronted danger in every form, and executed the commands of their chief in despite of countless difficulties.” “Their name, I suppose, is but the corruption of that of their leader, Hassan,” remarked Thompson. “Here doctors disagree,” replied Herbert; “some are content with this origin; whilst others, explaining the visions in the garden of Alamoot as the effects of an intoxicating herb, derive the name of the society from hashish, the opiate of hemp-leaves, supposed to have been so freely used by the sheikh in deluding his victims.” “How long did this strange society exist?” asked Lathom. “After a time they divided into two branches; the eastern one remaining at Alamoot, whilst the western spread into Syria. Both branches became too powerful and dangerous to be endured. After repeated attempts, the eastern branch was destroyed by the Monguls, about a century and a half after its foundation; whilst the western branch lasted only fourteen years longer, and 130fell about 1270, under the power of the Mamluke sultans of Egypt.” “It was far easier to root out their strongholds than their principles,” remarked Lathom. “It was so found by their conquerors: the mountains of Syria, especially, gave shelter to many of the society, and the tenets of the order are still believed to linger among a branch of the Koords. But come, we are wandering from our tales, and if we do not leave off our remarks Lathom will close the evening without another specimen of the old story-teller.” “We have not yet heard the moral of the magician’s garden,” said Thompson. “The application is plain,” replied Lathom: “the magician is the world; the luxuries and beauties of his garden are the world’s rewards and riches; worldly people think that they have grasped its gifts; anon, they open their hands, and find them empty.” “But a short application, though over true,” remarked Herbert. “I have rather condensed the old monk, and perhaps wrongly, as the latter part of his moral reminds me strongly of a passage in Gay’s fables. ‘The conjurer,’ says the old monk, ‘puts down a dish, but places nothing in it. Then he begins to prate and mock the spectators with fair words and long speeches. Soon he inquires of them: What is in the dish? they look, and it is full of pennies. These he distributes among the bystanders; with thanks they receive his gifts, and eagerly close their hands on them; anon, they open their hands, and lo, there is nothing.’” “You allude,” said Herbert, “to Gay’s lines, where he describes his conjurer performing his tricks. “‘Trick after trick deludes the train, He shakes his bag, and shows all fair, His fingers spread, and nothing there, 131Then bids it rain with showers of gold; And now his ivory eggs are told.’” “Hardly so much,” replied Lathom, “as the four lines where he says of FORTUNE: “‘A purse she to the thief exposed; At once his ready fingers closed. He opes his fist, his treasure’s fled, He sees a halter in its stead.’ And now,” continued Lathom, “now for the original of Guy, Earl of Warwick.” “The original of a romance, that was a celebrated piece in the time of Chaucer, and usually sung to the harp at Christmas dinners and bridals, is indeed a curiosity,” remarked Herbert. “But how comes Sir Guy in the Latin stories?” said Thompson; “does not Bishop Percy say it was of English growth?” “I cannot resolve the difficulty,” answered Lathom; “we must admit that it was in French before the end of the thirteenth century; when it came into its Latin dress, must depend on that most difficult of all points, the date and authorship of my volume of stories. But come from where he will, you have here the story of the Champion of Warwick.” SIR GUIDO, THE CRUSADER. Centuries have gone by since the court of the king of England was adorned by two valorous knights named Guido and Tyrius. Many a hard battle had they fought side by side against the enemies of their king, for the sake of the smiles of the fair ladies to whom they had dedicated themselves. After several 132years of brilliant deeds of daring and numerous perils, Sir Guido married the lady of his devotions. Happy were the early days of his marriage, for the knight and the lady loved each other greatly. One night Sir Guido saw a vision, as it were an angel of God talking with him, and he was afraid. Then said the angel: “Why weepest thou, Sir Guido? arise, put on thy arms, and fight for the holy cross.” “Verily, Lord,” replied Sir Guido, “much and often have I fought.” “Yes,” replied the angel, “much, often, and valiantly hast thou fought for the love of woman; now fight for the love of God, the glory of the holy cross. Contend against God’s enemies, as thou hast against those of men.” With these words the vision faded away, and Sir Guido knew that he was called to battle in the Holy Land against the infidels. Then he turned to his wife and said: “Felicia, we must part, but for a time; I am called to the Holy Land to fight under the banner of the cross.” “Alas! alas! my lord,” replied Felicia, clasping her husband in her arms and weeping hot tears upon his neck; “alas! and wilt thou leave me? death were to be preferred; then welcome death.” 133As she spoke she snatched up a dagger that lay beside her, and would have killed herself had not Sir Guido wrenched it from her grasp. “Felicia,” said the knight, “be comforted; I am vowed to go to the Holy Land; bear with it, my love; it is but for a time; be comforted.” “God’s will be done,” murmured the lady. “Take this ring, and as often as you look upon it, in happiness or in misery, in joy or in woe, think of Felicia.” Sir Guido gathered together his vassals, and his friend, Sir Tyrius, added his to those of Sir Guido, and thus combined they marched for the Holy Land, and journeyed by land and not by sea until they came to the borders of Dacia, a Christian country overrun by the infidels. “Brother,” said Sir Guido, “go thou to the king of the country, and with thy good sword rescue his kingdom from the power of the Saracen; I will proceed to the Holy Land, and when the foes of God are vanquished will rejoin you here, and so together we will return to England.” “Even as you wish,” said Sir Tyrius; “I will await your return here.” Thus did the friends separate. Sir Guido reached the Holy Land, and fought valiantly against the Saracens. Many and dire were his conflicts with the infidels, but in all of them he 134bore aloft the cross, and in his hands it never bowed before the crescent. Every one spoke of his deeds of arms, of his charity, and of his kindness; the minstrels made songs of his exploits, and spread his fame over the whole Christian world. Sir Tyrius, too, was successful in Dacia; by his aid the king regained his throne, and the infidels were driven from the kingdom. Rewards and thanks followed his successes; the king regarded him as the preserver of his throne, and considered no rewards too great or too good for the Christian warrior. The rewards of the good are ever sources of envy to the wicked. So was it at the court of the Dacian king. The prosperity of Sir Tyrius was gall and wormwood to a knight of Dacia, Sir Plebeus, who, until the coming of this stranger, had been looked upon as the greatest warrior of the Dacian people. To envy succeeded hatred, to hatred falsehood. Treason, he insinuated was in the mind of Tyrius; he aspired to the crown which he had recovered from the infidel. Alas! how easily do we credit falsehood, how readily do we believe that every one is as wicked as ourselves. The king believed the words of Plebeus. He called his preserver before him, charged him with treason, and upbraided him with ingratitude. 135“Go,” said he, “leave my court. I have honored thee much, I would have honored thee yet more. Now I give thee thy life in return for the valiant blows you struck for me; go in peace, but in poverty.” “Miserable creature that I am,” murmured Sir Tyrius; “whither shall I flee in this my abject poverty?” Sadly and slowly he wandered on, his eyes cast down, his hands crossed upon his breast. At last he sat down by the way-side. “Friend,” said a tall pilgrim, whose careworn look showed how long he had been journeying, “friend, whence comest thou?” “Father,” replied Tyrius, “I am of Rome; years have I lived in this land, and now I seek another home. Years have passed since my companion parted with me but a few miles from here; he sought the Holy Land, and whether he be dead or alive I know not.” “Friend,” replied the palmer, “I am wearied; suffer me, by the memory of your friend, I pray you, suffer me to repose my head on your knees, that I may sleep awhile.” Tyrius pitied the poor pilgrim, and acceded to his request. The palmer’s cloak was drawn over his face, so that he could distinguish but a portion of his features. As the palmer slept, of a sudden a weasel, 136small and white, leapt from out of his mouth, and ran to a neighboring hill-side, where it entered a small hole; after a time the creature returned, and appeared to enter into the mouth of the sleeping man. At that moment the palmer awoke. “Friend,” said he to Tyrius, “I have dreamed a strange dream. Methought a weasel, small, and white as snow, ran from out my mouth to a hole in yonder hill, and thence returning, re-entered my open mouth.” “Father,” replied Tyrius, “it was no dream; so did it appear to me also, as I sat and watched you. What the weasel did in yonder hill I cannot conjecture.” “Come, let us arise and look, peradventure we may find some good treasure.” “Even as I thought,” continued the palmer, when they entered the hole in the hill-side, that led to a large cave; “see, a dragon dead, and filled with gold; the treasure he was thus guarding is our own; ay, too, a sword. What do we read on its bright blade? ‘By me shall Guido overcome the enemies of Tyrius.’” “Alas, Guido,” said Tyrius, “where art thou, O my friend?” “Come,” said the palmer, “we will divide the treasures; to you the piles of gold and jewels; to me this sword.” 137“To thee the sword of Guido!” exclaimed Tyrius; “nay.” “To me the sword of Guido,” said the pilgrim, interrupting the knight in his words, and gradually raising the cowl of his dress from off his face. “Yes, to me, Tyrius.” “Guido, my friend, my brother!” cried the knight, as he looked on the pilgrim’s features. “And have we met, my brother? It is enough, O my brother!” and the tears came in the eyes of both. “Courage, courage, Tyrius; weep not, for I will do battle with your enemy; with this sword will I beat down thy foes; do you go to your own home, and leave me to deal with your traducers.” The friends embraced and parted. Tyrius went to his home with his treasure, and Guido repaired to the Dacian king’s palace. “Who art thou, and from whence?” asked the porter, as Sir Guido knocked at the king’s gate. “A humble pilgrim from the holy sepulchre.” “Enter, father, I crave thy blessing,” said the porter, as he knelt before Sir Guido. “Thou hast it, my son; peace be on thee and this house; I seek the king.” The king sat at meat, and all his nobles were round him. 138“Is the Holy Land at peace?” inquired the king, as the pilgrim entered. “At peace, my lord; the holy sepulchre is delivered from the infidel.” “Ho, give place; sit, father; bring wine and bread. Father, hast thou heard of a Christian knight named Guido?” “Both heard and seen him, my lord: we have eaten of the same bread, and shared the same couch.” “What say they of the Christian kings?” “They say the Dacian king has regained his kingdom and crown by the aid of a brave knight of Rome, whom he promoted to great honor and riches.” “They say true, sir pilgrim,” said the king, on whose brow an angry spot began to show. “They further say, that thou, O king, hast driven away this good and brave knight, seduced by the malice of one Plebeus, who has poisoned your royal ear with his falsehoods.” “False pilgrim,” cried Plebeus, who stood by the king’s chair; “false pilgrim, thou utterest lies that thou darest not to defend with thy life. That Tyrius was a traitor; he would have dethroned our king.” “Sir knight,” replied Guido, “I have both spoken the truth, and dare prove it; if thou art Sir Plebeus, and sayest Tyrius was a traitor; 139go to, thou art a liar, and by the king’s leave I will prove thy falsehood on thy body.” “It is well,” said the king; “let the wager of battle decide the truth, and God defend the right.” “Give me, my lord, such arms as be necessary for the field, and the ordeal of battle shall prove the truth. Save this sword, I have no armor.” “Be it so as you desire; to-morrow, at noon, we will see this combat. Daughter, to thy care I commit this pilgrim knight; see that he be forthcoming by to-morrow’s noon.” It was a bright day when the lists were prepared for the contest; before the hour appointed drew nigh, all the population of the royal city poured towards the scene of the approaching combat. Some trusted to the known prowess of the Dacian knight; others sided with the pilgrim, speculated upon who he was, and wished him success for the sake of Tyrius. “Haste thee, haste thee, sir pilgrim knight,” said the king’s daughter, “thy adversary even now stands in the lists, and exclaims: ‘False pilgrim! why tarriest thou?’” Sir Guido hastened to put on his armor, and to gird his sword about him. At noon the king entered the lists, the combatants took oath to the justice of their quarrel, and prepared to engage. 140Long and arduous was the battle; Guido pressed upon his adversary so fiercely that he thirsted almost to death. “Good pilgrim,” he said, “if thou wilt courteously permit me to quench my thirst this once, I will do the like to thee, shouldst thou require it of me.” “I consent,” replied Guido. His thirst thus quenched, Plebeus renewed the combat with redoubled animation. At length Guido also thirsted, and claimed of his adversary his promise. “Go to, fool! you shall taste no water but by the strong hand,” replied the Dacian. “By the strong hand then,” rejoined Guido, “be it so.” With these words he made towards the water, guarding himself with his shield. As soon as he gained the edge of the pond he jumped in, drank freely of the water, and rushed out refreshed and reinvigorated against his treacherous foe. His prowess and his courage alike deserted the Dacian, and he turned and fled. At that moment the king threw down his sceptre, and the combat closed for that day. The king’s daughter led the knight to his chamber, bound up his wounds, tended him softly, prepared his evening meal, and smoothed his bed with her own hands: a deep sleep soon 141came over Sir Guido, for he was wearied with the exertions of the combat. “My sons,” said Plebeus to the seven stout warriors that called him father, “my sons, if to-morrow’s sun sees yonder pilgrim in the lists, I die; never yet did I meet so stout an opponent.” “Fear not, sir,” replied they all, “we will take care of the pilgrim.” Sir Guido slept heavily; at midnight his chamber door was carefully opened, and the sons of Plebeus crept into his room. “He sleeps soundly,” whispered the eldest, “how shall we dispose of him? if we slay him here as he sleeps, what are we but dead men on the morrow?” “Does not the sea flow beneath the window?” asked one of the sons. “Yes, but if we touch him he will wake.” “Nay, let us take him bed and all and throw him into the sea.” Sir Guido slept on, and knew not what was plotting against him. It was midnight, and the moon shone brightly on the sea. A fisherman beneath the wall of the Dacian king’s palace was casting his nets, when a sudden splash in the water arrested his attention. “Halloa!” said he to himself, “what villany is this? a bed floating on the sea, 142and a man on it; ho, friend! ho, I say! awake, or be drowned!” “Where am I?” exclaimed Sir Guido, as he awoke with the fisherman’s clamor. “Help; friend,—I am sinking: I am the pilgrim that fought yesterday in the lists—thanks—thanks,” he continued, as he reached the fisherman’s boat; “but how got I here?” “I hardly know: just now I heard a splash, looked round, and by the moon’s light saw you and your bed floating on the water.” “Ah! well, the treachery has failed, good friend; to-morrow will confound the traitors.” The morrow came in fair and bright; again the people hastened to the lists, eager to see the issue of this wondrous combat. The king was seated, the lists were ready, and the heralds sounded. Then stept forth Sir Plebeus with his visor up, and a fair and smiling countenance. “My lord the king,” said the Dacian champion, as he bowed before the king’s throne, “I demand the combat with the pilgrim.” “It is well, Sir Plebeus—ho, herald! go to my daughter, and demand of her the pilgrim knight.” “The princess is even now coming to the royal presence,” replied the herald, as the crowd formed a lane, through which the king’s 143daughter was seen approaching her father’s throne, with a meek and sorrowful aspect. “My child,” said the Dacian king, “where is the pilgrim knight, the champion of Sir Tyrius? We await his coming forth.” “Father, and dear lord,” replied the maiden, “I know not whither he is gone; but last night I left him in deep sleep in his chamber, and now neither he nor his bed whereon he slept are to be found.” “Cowardly boaster!” exclaimed Sir Plebeus, “dares he not meet me in the list? The coward has fled.” “That is not so, my lord,” exclaimed a poor man in the crowd; “he has not fled.” “Ah! how sayest thou?” “Even now he sleeps at my hut; last night I found him floating on his bed beneath the palace wall; I took him into my boat, and he is safe.” “Thou hast done well; summon him to the list. Sir Plebeus, you shall not be disappointed of your combat. See, even now your adversary comes. Now, marshals, arm the stranger.” “Nay, my good lord,” said the Dacian knight, “press not on the pilgrim; I pray you, my lord, give him time to recruit his strength.” “Not for a minute, sir knight,” exclaimed the pilgrim as he entered the lists and hastened 144to don his armor; “not for a minute—I have much to reckon with you: remember last night.” The combat was short: each knight struck twice without fatal effect; the pilgrim’s third blow ended the battle, and the Dacian rolled on the ground a headless corpse. “Sir Pilgrim,” said the king, as he knelt before the throne, “God has defended the right; even now have I been told of the treachery of that senseless corpse, and of the villany of his sons towards thee; they now are going to their reward—to death. Come, sir knight, for thy sake I restore Sir Tyrius, renew his honors, and add to them those which you so steadfastly refuse. One boon I ask before you leave our court and our kingdom: disclose thy name; let me and my people know to whom they owe the punishment of a traitor and the defence of their best friend, their former preserver.” “My lord,” replied the pilgrim, “my name is not unknown to you; I am the knight of the Holy Land—the Guido of whom men speak.” Loud were the exclamations with which that famous name was hailed by the assembled Dacians, as their king fell on the pilgrim’s neck and embraced him as a brother. Seven years had passed since Guido left his castle and sailed for the Holy Land. Day by 145day did Felicia minister to the poor and bestow alms on every applicant, with this one request, that they would pray for the safety of her husband, Sir Guido, and that once more before her death she might rejoice in his presence. Felicia stood at her castle gate, and the inner court-yard was filled with her poor pensioners. One by one she accosted them and bade her almoner give to each his accustomed alms. Her young son ran by his mother’s side. “Mother, dear mother,” said the child, as he heard Felicia commend Sir Guido to the prayers of the poor men, “is it not my father for whom you ask these poor people to pray?” “Yes, my child; seven years have passed since he left me; but a few months had we been married before God summoned him to the Holy Land, and he took the cross and went against the infidel.” As she thus spoke to her son, Felicia drew nigh to a tall pilgrim who stood apart from the rest of the poor people. She gave him the alms, and asked of him his prayers for her husband’s return. Low bowed the pilgrim his head, but not a word did he speak as the lady passed onwards. Her son followed after Felicia; as he passed the pilgrim, he bowed himself forward and embraced the youth. “God give thee grace,” said he with a trembling 146voice, “God give thee grace to do his will.” “Thanks, father, for thy blessing,” said Felicia; “can I do aught to reward thy good wishes?” “Lady,” said the pilgrim in a low, stifled voice, “I crave the small hermitage below the eagle’s rock; there let me live and die.” “Ha!” exclaimed Felicia, “the eagle’s rock; art thou of this place, good father, that thou knowest the name so well?” “I was of thy people once, fair lady; now I am God’s poor servant.” “Be it as thou desirest; go, father, and pray for this house and its long-lost master.” Those who could see the pilgrim’s face saw the tears start in his eyes as he accepted Felicia’s gift and turned towards his lonely hermitage. Many years did he live there, many a time did he come to the castle yard, and his daily companion was Felicia’s child, Sir Guido’s son. Day after day did he talk to him of adventures of knights in the Holy Land, of those that had fallen fighting for the sepulchre, and those who had passed through the fiery ordeal of that expedition. At last death came upon him. “Dear boy,” said he to Sir Guido’s son, “take this ring to thy mother, and bid her, if 147she would see me ere I die, come hither quickly.” “Mother, dear mother,” said the youth when he entered Felicia’s chamber, “the good pilgrim is sorely ill; he sends you this ring, and bids you see him ere he die.” Felicia cast one look upon the ring. “Haste, haste, my child!” she exclaimed, “it is my lord’s, your father’s ring; come, come to the forest!” Quickly as she rushed to the hermitage, she found but the dead body of her husband. “Woe, woe is me!” she exclaimed, casting herself on the cold corpse, “woe, woe is me! where are now my alms? My husband asked charity of me and I knew him not; thy father talked with thee, my child, he embraced thee, and thou knewest him not. O Guido! thou didst look upon thy wife, and didst not tremble; thou didst look upon thy child, and kissed him, and blessed him; alas, alas! my husband.” “I should be loth to agree with Percy, that so beautiful a tale should have been resigned to children,” said Herbert, as soon as Lathom had concluded his version of the old tale. “No wonder that the pilgrimage of the warrior was such a favorite with all nations, as to be claimed by nearly all as peculiarly their own,” said Thompson. “It was very early translated into French, and is alluded 148to in a Spanish romance, written somewhere about 1430. But now, that, as the old ballad says, “‘The story is brought to an end, Of Guy, the bold baron of price, And of the fair maid Felice,’ we will conclude our evening with some account of its applications, as intended by the monk. Sir Guido was symbolical of our Saviour, Felicia of the soul, and Tyrius of man in general. By the weasel was meant the prophets, and especially the Baptist, as prophesying the coming of the Saviour. The mountain is the world, the dead dragon the old law of Moses, and the gold within it the Ten Commandments. The sword represented authority, the seven deadly sins were symbolized in the sons of Plebeus, and the good fisherman was the representative of the Holy Spirit.” “There remains one character yet unexplained—the king’s daughter,” remarked Herbert. “The explanation of her duties is peculiar to the religion of the age in which the tale was written; the Roman Catholic easily recognized in the king’s daughter the Virgin Mary.” “Come, Herbert, we are over our time; to work; goodnight.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2793/77299.html","bookId":1290,"book":{"id":1290,"title":"Tales from the Gesta Romanorum","description":"简介： You have here, my good friends, sundry moral and entertaining stories, invented by the monks of old, and used by them for amusement, as well as for instruction; from which the most celebrated poets, of our own and other lands, have condescended to dr...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2793","creation":"Aug 1, 2019 12:24:48 AM","modification":"Aug 1, 2019 12:24:48 AM"}}
