{"id":68684,"no":42,"title":"Page 42","content":"They were travelling at high speed on the Autostrada del Sole, the freeway to Naples. They had been driving in silence for the last half hour, each preoccupied with his own thoughts.\\n\\n Pier broke the silence. \"How long would you like to stay at my mother\u0027s house?\" she asked.\\n\\n \"Three or four days, if that\u0027s all right.\"\\n\\n \"That will be fine.\"\\n\\n Robert had no intention of staying there for more than one night, two at the most. But he kept his plans to himself. As soon as he found a ship that was safe, he would be on his way out of Italy.\\n\\n \"I\u0027m looking forward to seeing my family,\" Pier said.\\n\\n \"You have just one brother?\"\\n\\n \"Yes. Carlo. He is younger than me.\"\\n\\n \"Tell me about your family, Pier.\"\\n\\n She shrugged. \"There is not much to tell. My father worked at the docks all his life. A crane fell on him and killed him when I was fifteen. My mother was ill, and I had to support her and Carlo. I had a friend at Cinecitta studios and he got me bit parts. They paid very little and I had to sleep with the assistant director. I decided I could make more money on the streets. Now I do a little of both.\" There was no self-pity in her voice.\\n\\n \"Pier ... are you sure your mother won\u0027t object to your bringing a stranger home?\"\\n\\n \"I am sure. We are very close. Mother will be happy to see me. Do you love her very much?\"\\n\\n Robert glanced over at her in surprise. \"Your mother?\"\\n\\n \"The woman you were talking to on the telephone in the restaurant - Susan.\"\\n\\n \"What makes you think I love her?\"\\n\\n \"The tone of your voice. Who is she?\"\\n\\n \"A friend.\"\\n\\n \"She is very lucky. I wish I had someone who cared for me like that. Is Robert Bellamy your real name?\"\\n\\n \"Yes.\"\\n\\n \"And are you a commander?\"\\n\\n That was more difficult to answer. \"I\u0027m not sure, Pier,\" he said. \"I used to be.\"\\n\\n \"Can you tell me why Interpol is after you?\"\\n\\n He said carefully, \"It\u0027s better if I don\u0027t tell you anything. You could be in enough trouble just being with me. The less you know the better.\"\\n\\n \"All right, Robert.\"\\n\\n He thought about the strange circumstances that had brought the two of them together. \"Let me ask you something. If you knew that there were aliens coming down to earth in spaceships, would you panic?\"\\n\\n Pier studied him a moment. \"Are you serious?\"\\n\\n \"Very.\"\\n\\n She shook her head. \"No. I think it would be exciting. Do you believe such things exist?\"\\n\\n \"There\u0027s a possibility,\" he said cautiously.\\n\\n Pier\u0027s face lit up. \"Really? Do they have real ... I mean ... are they built like men?\"\\n\\n Robert laughed. \"I don\u0027t know.\"\\n\\n \"Does this have anything to do with why the police are after you?\"\\n\\n \"No,\" Robert said quickly. \"Nothing.\"\\n\\n \"If I tell you something, will you promise not to be angry with me.\"\\n\\n \"I promise.\"\\n\\n When she spoke, her voice was so low he could hardly hear her. \"I think I am falling in love with you.\"\\n\\n \"Pier ...\"\\n\\n \"I know. I am being foolish. But I have never said that to anyone before. I wanted you to know.\"\\n\\n \"I\u0027m flattered, Pier.\"\\n\\n \"You\u0027re not making fun of me?\"\\n\\n \"No. I\u0027m not.\" He looked at the gas gauge. \"We\u0027d better find a filling station soon.\"\\n\\n They came to a service station fifteen minutes later. \"We\u0027ll fill the tank here,\" Robert said.\\n\\n \"Fine,\" Pier smiled. \"I can call my mother and let her know that I am bringing home a handsome stranger.\"\\n\\n Robert drove up to the gas pump and said to the attendant, \"Fate il pieno, per favore.\"\\n\\n \"Si, signore.\"\\n\\n Pier leaned over and gave Robert a kiss on the cheek. \"I will be right back.\"\\n\\n Robert watched her walk into the office and get change for the telephone. She\u0027s really very pretty, Robert thought. And intelligent. I must be careful not to hurt her.\\n\\n Inside the office, Pier was dialling. She turned to smile and wave at Robert. When the operator came on, Pier said, \"Get me Interpol. Subito!\" \\n\\n","sourceLink":"https://allnovel.net/the-doomsday-conspiracy/page-42.html","bookId":2363,"book":{"id":2363,"title":"The Doomsday Conspiracy","description":"Storyline: OPERATION DOOMSDAY \\n ... ACTIVE ... \\n Commander Robert Bellamy of US Naval Intelligence is dispatched on a top secret mission. A weather balloon carrying sensitive military information has crashed in Switzerland. Bellamy must locate the ten witnesses to the incident so that they can be sworn to secrecy. \\n But as he conducts his search Bellamy begins to suspect that he, too, is being hunted, by an unknown lethal force that what he was told about the balloon was only one part of an almost unbelievable happening... \\n From Washington to Zurich, Rome and Paris, the story unfolds to reveal Bellamy\u0027s past why the women he loves the most cannot return his love, why his friends become his deadly enemies, and why the world must never learn the incredible secret hidden on the Swiss Alps...\\n","cover":"https://allnovel.net/images/the-doomsday-conspiracy.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-doomsday-conspiracy.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:09:30 AM"}}
