{"id":43502,"no":25,"title":"JEYPOOR","content":"Broad streets crossing each other at right angles; houses, palaces, archways flanked by towers, and colonnades, all alike covered with pink-washed plaster decorated with white. And all the buildings have the hasty, temporary appearance of a town run up for an exhibition to last only a few months. \\n\\n \\n\\n There is a never-ending traffic of elephants, baggage-camels, and vehicles with shouting drivers; and on the ground are spread heaps of fruit, baskets for sale, glass baubles and weapons. In all the pink and white throng not an European dress is to be seen, not even one of the vile compounds adopted by the baboo, a striped flannel jacket over the dhoti. Men and women alike wear necklaces of flowers, or flowers in their hair; the children are gaudy with trinkets and glass beads. \\n\\n \\n\\n The Rajah\u0027s residence, of plaster like the rest of the town, is pink too outside, but the interior is aggressive with paint of harsh colours. In the living rooms is shabby furniture, gilt chairs turned one over the other, as on the day after a ball. The curtains over the doors and windows are of silk,[Pg 214] but frayed and threadbare. In the shade of a marble court with carved columns, clerks are employed in counting money—handsome coins stamped with flowers and Indian characters, laid out in rows. They count them into bags round which soldiers mount guard. \\n\\n \\n\\n Outside the palace is a large garden, devoid of shade, with pools of water bowered in flowers and shrubs that shelter myriads of singing birds. At the end of the park is a tank full of crocodiles. A keeper called the brutes, and they came up facing us in a row, their jaws open to catch the food which the Rajah amuses himself by throwing to them. \\n\\n \\n\\n In the bazaar a light, glossy cheetah was being led round for an airing. The beast had on a sort of hood of silk stuck with peacock\u0027s feathers, which its keeper pulled down over its eyes when it saw a prey on which it was eager to spring; and with its eyes thus blinded, it would lick the hand that gave it an anna with a hot tongue as rough as a rasp. \\n\\n \\n\\n A salesman of whom I had bought several things, wishing to do me a civility, called a tom-tom player, who was to escort me home rapping on his ass\u0027s[Pg 215] skin; and when I declined very positively, the poor man murmured with a piteous, crushed look: \\n\\n \\n\\n \"What a pity that the sahib does not like music!\" \\n\\n \\n\\n All about the town of pink plaster, in the dust of the roads and fields, are an endless number of dead temples—temples of every size and of every period; and all deserted, all empty; even those that are uninjured look like ruins. \\n\\n \\n\\n And for an hour as we drove along towards Amber, the old town deserted in favour of modern Jeypoor, the same succession of temples wheeled past. The crenated walls enclose three hills, one of them crowned by a fortress, to defend erewhile the white palace mirrored in the waters of an artificial lake. \\n\\n \\n\\n All round the Rajah\u0027s palace crowds a town of palaces, mosques, and temples dedicated to Vishnu; and outside the walls, on a plain lying between the hills of Amber, is another town, still thick with ruins amid the forest of encroaching trees. And it is all dead, deserted, dust-coloured, unspeakably sad, with the sadness of destruction and desertion in the midst of a landscape gorgeous with flowers and groves. In the palace of Amber, guides make a good[Pg 216] business of showing us the public rooms, baths, and bedrooms, all restored with an eye to the tourist. In the gardens, heavy with perfume, the trees display swinging balls of baked earth full of holes, which protect the ripening fruit from the monkeys; a whole tribe of them scampered off at our approach, and went to torment the peacocks that were solemnly promenading a path, and that presently flew away. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2137/60438.html","bookId":483,"book":{"id":483,"title":"Enchanted India","description":"简介： The air is heavy with indefinable perfume. We are already coasting the Indian shore, but it remains invisible, and gives no sign but by these gusts of warmer air laden with that inscrutable aroma of musk and pepper. A lighthouse to port, which we hav...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2137","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
