{"id":88838,"no":19,"title":"Page 19","content":"\"The hunt of your lives,\" Hunter Redfern said. Hewas standing handsome and erect, smiling easily. The nobles were gathered around him, and Maggieeven saw some familiar faces in the crowd.\n That rough man from Delos\u0027s memories-the one who grabbed his arm, she thought dreamily. And the woman who put the first binding spell on him.\n They were crowded in the courtyard, their faceseager. The first pale light was just touching thesky-not that the sun was visible, of course. But it was enough to turn the clouds pearly and cast aneerie, almost greenish luminescence over thescene below.\n \"Twohumans,a witch, and a renegade prince,\"Hunter proclaimed. He was enjoying himself hugely, Maggie could tell. \"You\u0027ll never have another chance at prey like this.\"\n Maggie gripped Delos\u0027s hand tightly.\n Shewasfrightened butatthesame time strangely proud. If the nobles around Hunter wereexpecting their prey to cower or beg, they were going to be disappointed.\n They were alone, the four of them, in a littleempty space in the square. Maggie and Aradia and Jeanne in their slave clothes, Delos in his leggingsand shirtsleeves. A little wind blew and stirredMaggie\u0027s hair, but otherwise they were perfectly still.\n Aradia, of course, was always dignified. Just nowher face was grave and sad, but there was no sign of anger or fear in it. She stood at her full height,her huge clear eyes turned toward the crowd, as if they were all welcome guests that she had invited.\n Jeanne was more rumpled. Her red hair was disheveled and her tunic was wrinkled, but there wasa grim smile on her angular face and a wild battlelight in her green eyes. She was one prey that wasgoing to fight, Maggie knew.\n Maggie herself was doing her best to live up tothe others. She stood astall as she could, knowing she would never be asimpressive as Aradia, or as devil-may-care as Jeanne, but trying at least to look asif dying came easy to her.\n Delos was magnificent.\n In his shirtsleeves, he was more of a prince thanHunter Redfern would ever be. He looked at thecrowd of nobles who had all promised to be loyalto him and were now thirsting for his blood-and he didn\u0027t get mad.\n He tried to talk to them.\n \"Watch what happens here,\" he said, his voicecarrying easily across the square. \"And don\u0027t forgetit. Are you really going to follow a man who cando this to his own great-grandson? How long is itgoing to be before he turns on you?Before you findyourselves in front of a pack of hunting animals?\"\n \"Shut him up,\" Hunter said. He tried to say it jovially, but Maggie could hear thefuryunderneath.\n And the command didn\u0027t seem to make much sense. Maggie could see the nobles looking at each other-who was supposed to shut him up, and how?\n \"There are some things thatt have to be stopped,\"\n Delos said. \"And this man is one of them. I admitit, I was willing to go along with him-but that was because I was blind and stupid. I know betternow-and I knew better before he turned againstme. You all know me. Would I be standing here,willing to give up my life for no reason?\"\n There was the tiniest stirring among the nobles.\n Maggie looked at them hopefully-and then herheart sank.\n They simply weren\u0027t used to thinking for themselves, or maybe they were used to thinking only of themselves. But she could tell there wasn\u0027t material for a rebellion here.\n And the slaves weren\u0027t going to be of any help,either. The guards had weapons, they didn\u0027t. Theywere frightened, they were unhappy, but this kind of hunt was something they\u0027d seen before. Theyknew that it couldn\u0027t be stopped.\n \"This girl came to us peacefully, trying to keepthe alliance between witches and vampire,\" Deloswas saying, his hand on Aradia\u0027s shoulder. \"And inreturn we tried to kill her. I\u0027m telling you rightnow, that by spilling her innocent blood, you\u0027re allcommitting a crime that will come back to hauntyou.\"\n Another little stirringamong women, Maggie thought. Witches, maybe?\n \"Shut him up,\" Hunter said, almost bellowing it.\n And this time he seemed to be saying it to a specific person. Maggie followed his gaze and saw Sylvia near them.\n \"Some beasts have to be muzzled before they canbe hunted,\" Hunter said, looking straight at Sylvia.\"So take care of it now. The hunt is about to begin.\"\n Sylvia stepped closer to Delos, a little uneasily.He stared back at her levelly, as if daring her towonder what he\u0027d do when she got nearer.\n \"Guards!\" Hunter Redfern said, sounding tired.\n The guards moved in. They had two differentkinds of lances, a distant part of Maggie\u0027s mindnoted. One tipped with metal-that must be for humans and witches-and one tipped with wood.\n For vampires, she thought. If Delos wasn\u0027t careful, he might get skewered in the heart before thehunt even began.\n \"Now shut his lying mouth,\" Hunter Redfernsaid.\n Sylvia took her basket off her arm.\n \"In the new order after the millennium, we\u0027llhave hunts like this every day,\" Hunter Redfernwas saying, trying to undo the damage that hisgreat-grandson had done. \"Each of us will have a city of humans to hunt. A city of throats to cut, acity of flesh to eat.\"\n Sylvia was fishing in her basket, not afraid tostand close to the vampire prince since he was surrounded by a forest of lances.\n \"Sylvia,\" Aradia said quietly.\n Sylvia looked up, startled. Maggie saw her eyes,the color of violets.\n \"Each of us will be a prince-\" Hunter Redfernwas saying.\n \"Sylvia Weald,\" Aradia said.\n Sylvia looked down. \"Don\u0027t talk to me,\" she whispered. \"You\u0027re notI\u0027m not one of you anymore.\"\n \"All you have to do is follow me,\" Hunter wassaying.\n \"Sylvia Weald,\" Aradia said. \"You were born awitch. Your name means the greenwood, the sacred grove. You are a daughter of Hellewise, andyou will be until you die. You are my sister.\"\n \"I am not,\" Sylvia spat.\n \"You can\u0027t help it. Nothing can break the bond.In your deepest heart you know that. And asMaiden of all the witches, and in the name of Hellewise Hearth-Woman, I adjure you: remove your spell from this boy.\"\n It was the strangest thing-but it didn\u0027t seem tobe Aradia who said it. Oh, it was Aradia\u0027s voice, allright, Maggie thought, and it was Aradia standingthere. But at that moment she seemed to be fusedwith another form-a sort of shining aura allaround her. Someone who was part of her, butmore than she was.\n It looked, Maggie thought dizzily, like a tallwoman with hair as pale as Sylvia\u0027s and largebrown eyes.\n Sylvia gasped out, \"Hellewise ... .\"Her own violeteyes were huge and frightened.\n Then she just stood frozen.\n Hunter was ranting on. Maggie could hear himvaguely, but all she could see was Sylvia, the shudders that ran through Sylvia\u0027s frame, the heavingof Sylvia\u0027s chest.\n Appeal to their true hearts,Maggie thought.\n \"Sylvia,\" she said. \"I believe in you.\"\n The violeteyes turned toward her, amazed.\n \"I don\u0027t care what you did to Miles; Maggie said.\"I know you\u0027re confused-I know you were unhappy. But now you have a chance to make upfor it. You can do something-something importanthere. Something that will change the world.\"\n \"Rivers of blood,\" Hunter was raving. \"And noone to stop us. We won\u0027t stop with enslaving thehumans. The witches are our enemies now. Thinkof the power you\u0027ll feel when you drink their lives!\"\n \"If you let this Wild Power be killed, you \u0027I! beresponsible for the darkness coming,\" Maggie said.\"Only you. Because you\u0027re the only one who canstop it right now.\"\n Sylvia put a trembling hand to her cheek. Shelooked as if she were about to faint.\n \"Do you really want to go down in history as the\n one who destroyed the world?\" Maggie said.\n \"As Maiden of all the witches ...\"Aradia said.And another, deepervoiceseemed to follow on hers like anecho , As Mother o f all the witches ...\"And in the name of Hellewise . .\n And in the name of my children...\n \"As you are a Hearth-Woman ...\"\n As you are my own daughter, a true Hearth\n Woman ...\n \"I adjure you!\"Aradia said, and her voice rangout in double tones so clearly that it actuallystopped Hunter in midtirade.\n It stopped everyone. For an instant there was absolutely no sound in the courtyard. Everyone wa: looking around to see where the voice had come from.\n Sylvia was simply staring at Aradia.\n Then the violet eyes shut and her entire bodyshivered in a sigh.\n When she spoke it was on the barest whisper of breath, and only someone as close as Maggie wa:could have heard her.\n \"As a daughter of Hellewise, I obey.\"\n And then she was reaching for Delos\u0027s arm, ancDelos was reaching toward her. And Hunter wa: shouting wildly, but Maggie couldn\u0027t make out thewords. She couldn\u0027t make out Sylvia\u0027s words, ei.ther, but she saw her lips move, and she saw the slender pale fingers clasp Delos\u0027s wrist.\n And saw the lance coming just before it piercecSylvia\u0027s heart.\n Then,as if everything came into focus at once\n she realized what Hunter had been shouting in i\n voice so distorted it was barely recognizable. \"Kill her! Kill her!\" And that\u0027s just what they\u0027d done, Maggie thoughther mind oddly clear, evenasa wave of horror andpity seemed to engulf her body. The lance wen right through Sylvia. It knocked her backwardaway from Delos, and blood spurted all over thefront of Sylvia\u0027s beautiful green dress.\n And Sylvia looked toward Hunter Redfern andsmiled. This time Maggie could read the words orher lips.\n \"Too late.\"\n Delos turned. There was red blood on his whiteshirthis own, Maggie realized. He\u0027d tried to getin the way of the guard\u0027s killing Sylvia. But nowhe had eyes only for his greatgrandfather.\n \"It stops here!\"\n She had seen the blue fire before, but never likethis. The blast was like a nuclear explosion. Itstruck where Hunter Redfern was standing with hismost loyal nobles around him, and then it shot upinto the sky in a pillar of electric blue. And it wenton and on, from sky to earth and back again, as ifthe sun were falling in front of the castle. \n","sourceLink":"https://allnovel.net/night-world-black-dawn-night-world-8/page-19.html","bookId":2081,"book":{"id":2081,"title":"Night World : Black Dawn (Night World #8)","description":"Storyline: \n Black Dawn (Night World Book 8) \n Maggie Neely is a short, spunky sixteen-year-old with auburn hair and an iron will. When her brother turns up missing, she’s determined to find him. But she never suspects that the trail will lead her into the most secret heart of the Night World, a kingdom where no outsider has stepped in five hundred years. The kingdom is ruled by the young vampire prince Delos…who keeps all humans as slaves. When Delos falls in love with Maggie, he frees her and demands that she join him in his life of dark pleasure. He’s handsome, he’s romantic – Maggie can hardly resist him. But did he kill Maggie’s brother? And who are the strange people searching the kingdom for a Wild Power? Maggie won’t give up until she learns the truth – even if it means destroying Delos and his secret land. If he doesn’t destroy her firs...\n \n","cover":"https://allnovel.net/images/night-world-black-dawn-night-world-8.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/night-world-black-dawn-night-world-8.html","creation":"Oct 5, 2019 8:58:19 AM","modification":"Oct 5, 2019 5:31:27 PM"}}
