{"id":34707,"no":10,"title":"Chapter 9","content":"Descendants of Mutineers—Cannibalism—I play a Violin Overture at what I fear is a Cannibalistic Feast—A Samoan Chief’s Philosophy—Musings Before I proceed I will tell you about the crew of the Bounty just as I heard it from the lips of one of the descendants of the old mutineers whom I have awhile back spoken of. The Bounty left England considerably more than a hundred years ago, and made a voyage to the South Seas, calling at the Isle of Tahiti. No one knows exactly what the mutiny was about; anyway there certainly was a mutiny and the crew cast the Captain and one or two officers adrift, then ran the ship ashore in the Pacific and hid themselves in the Isles among the savage Tahitian men and women. The latter being beautiful to look upon, the sailors took them to wife, and with my knowledge of seafaring men of my own day I can assure you that they did not grieve much over their exile and thoroughly enjoyed themselves. The Government sent out a search for them and some of them got collared and were taken home to England and executed. The remainder, who had gone off to another Isle taking their wives with them, eluded their pursuers, lived and ended their lives on the Isle of “Pitcairn” and left behind them hundreds of 87half-caste children, who turned out to be anything but what one would have expected, being an intelligent and upright race. It appears that the mutineers went in for debauchery; fought over each other’s wives, and even their comrades’ daughters as the years rolled by. Eventually they all died excepting Adams, the mutineer ring-leader, who, seeing all his old comrades dead, grew pious and remorseful over his wild career, and being king of the Island race brought the whole family up to be strictly upright and honest in all their ways, and he succeeded too; and there they are out there to-day in the South Seas, happy and industrious. By the irony of fate old Adams proved to be the best and most successful missionary that ever reared a brood in the South Seas, and all men who have been that way will agree with all I have said and tell you that even to this generation the Island children of those parts are brave sailors, and their faces resemble the long dead lineaments of those sailors of long ago, and most of the families have English names, such as Johnson, Noble, etc. I am now going to tell you about cannibalism in the Pacific Islands just as I saw it and heard of it. Of course, a lot has been written on the subject by many travellers, but you may be interested to know my views and experiences on this gruesome but interesting matter. I knew two Islanders who still hungered after the flesh of man; they were not the true natives of Samoa, for the Samoans were not at all addicted to 88cannibalism. One night they listened to me as I sat playing the violin under the shade of some banyan-trees, and invited me into the forest village to their den. Well, when I arrived inside their snug little homestead I noticed a grizzled old man and woman nibbling away at the remains of a thigh bone of some departed enemy whom they had roasted and eaten. As I looked across at them sitting there enjoying that awful meal they swiftly hid the bone behind them. The man was a simple-looking fellow; his shrunken gleaming eyes gazed kindly upon me, but I could not conjure up in my heart much love for him, especially when he grinned and revealed his yellowish front teeth that had chewed up the remains of who knows who? Some missing white trader, or someone of his own race, or even a missionary with M.A. after his name. They were very fond of missionaries, as I’ve heard that they eat well, being nicely nourished, and not being addicted to too much drink they have not the rum-flavour that traders have had who have met the awful fate of supplying the cannibalistic festive board with meat. I felt rather nervous as I caught sight of that awful remainder of departed woe, but I took good care not to let them see that I had noticed, as they knew what would happen to them if they were found out, and consequently, I being at that moment in their power, they might have thought it advisable to put an end to my existence and make me into provisions for their secret larder! I was very young, white and tender in those days and would have eaten well. 89I am quite sure these remarks of mine may make you think I treat such things as cannibalism lightly, but it is not so; good and bad are comparative, and when I sit here and write and see life with sadder and more earnest eyes I simply think what a lucky fellow I was not to have been born in the South Seas. Had my parents been South Sea Islanders, and I born in Fiji instead of Kent, doubtless someone would have already recorded in their autobiography my own cannibalistic revels and terrible sins, for I am adventurous and wayward enough now with all the advantages of birth and education—so what would I have been if I had crept into the world and seen the first light and heard the first sounds in some Fijian moonlit forest? And you too, reader, what would you have been? Probably both happier than we are now—who knows? Well, I looked over at that grim couple and smiled pleasantly to let them see I had noticed nothing, and as I spoke to them and the woman picked her teeth with her finger and nearly choked as she swallowed the mouthful that she sought to conceal, and said, “No savee,” I heard a noise outside in the forest and they both jumped up. I looked outside and saw a group of the savages passing along through the forest. It was already twilight, yet I could see most of their swarthy faces distinctly and I at once recognised an old Tongan friend of mine whom I had long since thought had gone back to Tonga. The four of us left the den and went across the clearing and met the group as they hurried along, dragging 90behind them a heavy load. What I am going to tell you is absolute truth, and I will tell you the details just as I saw them with my own eyes. That load which they dragged behind them was a body, and they were off into the forest depth bound for the grand cannibalistic feast! As I came up to them they all looked startled and frightened and made as though to go for me, and I believe now that I look back that had not my Tongan friend appealed on my behalf I should have been immediately killed. I had my fiddle with me, and they looked upon my violin as some kind of enchanter, some spirit of the dead, and after a hurried consultation, standing there under the trees with fierce faces and frizzly heads, muttering in guttural tones, they all turned toward me, and one said, “Ova lu-lu,” and made signs that I should follow them into the forest and play music to them, their intention being not to kill me but to entice me on with them so that I could not return and give them away, and so I was commandeered. At that moment I had not the slightest suspicion that the load that bumped behind them, tightly wrapped up, as it parted the tall grasses and flowers as they hurried along, was the dead body of some fallen enemy, otherwise I am quite sure that I should have made a bolt for it, but possibly my slow comprehension saved my life, for however fast I ran I doubt if I could have out-run a South Sea savage. How well do I remember that terrible journey through the forest, as overhead sang the trade-wind 91in the palms and giant trees, and the sunset died away and the mysterious glooms around became deeper mysteries. Hot and dejected I followed those stalwart bare men, twenty behind me and twenty in front, as their naked feet hurried in single file toward the terrible “place” where that “thing” was to be cooked! And I, the hired musician, trembled as the hot breath of the tall savage just behind me blew down my neck as he dragged his burden along on that sweltering hot night. I have played the violin in many ball-rooms and fêtes since that long-ago night, but never once have I played without that terrible picture (which I am now going to tell you of) rising before my eyes. It seemed miles to me before they stopped. Great heaven, they were dressed up for the occasion! Some of them were smeared with whitish stuff, and three of them—women!—were got up like idols. One was a young and attractive-looking type of South Sea womanhood. She walked two ahead of me and I remember her well as she did not look so fierce as the others and the thought came to my mind that I could look to her for sympathy if they wanted to kill me. Women are women the world over, and down in my heart I blessed the soft curves of that female frame as she moved along in front of me, turning her head from time to time to gaze steadfastly into my eyes. Several times I thought of making a sudden dive into the forest. If I had done so I feel quite sure the reader would never have read this autobiography. 92In between two great plateaux they stopped and the chief that led them gave two bird-like calls among the hills, and presently the bush parted gently and out poked frizzly heads. More of them to attend that feast! One was a terrible-looking fellow; his head looked like a huge coco-nut with fat lips on it and a tuft of quills on the top. He glared at me and spoke viciously to the others. How my heart thumped! I felt my face turn grey and my lips go dry as I gave a sickly smile to that awful man to let him see that I was perfectly agreeable to all that they were doing and to all that they might do, and in an inspiration I started to play the fiddle and laughed hysterically. I do not mind telling you that I was in a terrible funk and to this day I do not like the look of men who have coco-nut-shaped heads, so horrified and cowed was I by that chief who muttered to the others and swayed his club to and fro and several times half lifted it as though to brain me! And all this I am telling you is so terribly true that I don’t know how to proceed with all that happened, whether to describe my feelings or what my eyes saw. But there, whoever you are, you can place yourself in my predicament, and if you have a good imagination feel a faint echo of my despair of that night of long ago. Overhead hung the bright moon in the vault of night as the busy hands of that fierce tribe gathered and piled up the wood fire as in the hot embers frizzled the “Long Pig.” There are some details of cooking odours which I must leave out. I cannot 93describe all, it was too hellish to describe. Round and round that terrible fire they whirled like some ghastly nightmare of the dead in hell, lifting their chins skywards and chanting thanksgiving to their ancient gods, and I heard the rattle of the threaded shells that adorned the bodies of the wild women as they too sang in shrill voices. I played away as fast as I could on my violin the repeated intervals of those minor strains, keeping time to that terrible dance, the perspiration pouring down my face as I tore away at the only two strings on my instrument. There they were, a ring of swarthy faces around me, as they suddenly stopped all hushed as the nightbird in the forest said “Wail-wail-tu-tu-wail-wail,” and they started on their haunches to devour their “meal.” And as the forest wind blew the dying, flickering firelight over their faces I thought I would presently awake from some ghastly nightmare, so terrible was the sight and so unreal-looking were the surroundings conjured up in my own brain by the knowledge of what that big dish joint consisted of, for they themselves as they sat there swallowing away looked quite innocent and peaceful, and they even offered up a prayer to their gods in devoted thanks for that supper, just the very same as tiny white children who put their hands together and thank God for their feast of the poor murdered four-legged creatures of the field. I pretended to join in the prayer and muttered out some noises, but I could not under any pretence eat. I really think that I would have died sooner than eat of that 94joint. How I got out of it I don’t know, but I did, and I put down my escape to the quantity of diners at the festivity and their greediness. As I sat there in that den of the forest I thought of my people in England, in a respectable London suburban home, calmly going about their household duties, singing and playing the piano, and the afternoon “At Home,” small talk and whispering, while I sat on a little dead tree stump in the South Sea Isle with my heart thumping like a funeral march drum, as about fifty naked savage cannibals gnawed the bones of that inhuman and yet human feast! I thought of my father’s offices in London, as he sat editing the adventurous books for that publishing house wherefrom sprang out to the hands of the schoolboys the Highway Men, Red Indians and Spring Heeled Jacks, etc.,[2] that fired the heads of the boys of my schooldays with the mad adventurous spirit to go to sea and seek adventure in far lands, and I cursed these books, for it was through them that I was sitting there, wondering every moment if those terrible men would suddenly take a fancy to me, knock my skull in and prepare me for the next meal! 2. Work which was very distasteful to my father. He, having a refined literary taste, was a critic of poetry, and wrote several critical works, including Shelley and his Writings. But no such thing happened. As soon as they had finished they all crept silently away into the forest to their several homes to sleep off the effects of that orgy. They were men of the interior, and 95even the true Samoans do not agree with cannibalism, but the Island was in a fever then; they had been prepared for war some time before and those cannibals had come over from some other group. I took my first opportunity and leapt away into the wooded country and arrived next day at Hornecastle’s hut. I kept my mouth closed, for had I told of that terrible night they would have known that I had split and I should have been doomed; and so I followed the good old proverb that “a still tongue shows a wise head.” And I was pleased that I did hold my tongue, for while I was drinking in a saloon in Apia with Hornecastle, the night following my terrible fright and dread of being eaten, a German started cursing and told us how he had hung a prize pig up in his store and, when he went in the morning, to cut it up for joints, he found it missing; the natives had stolen it, and crept into the forest, and probably roasted it and had a glorious feast, and as I listened to his details I started to wonder if the load that my friends of the night before had dragged through the forest to the midnight feast could have possibly been his stolen pig!—and all the horror of that secret feast the outcome of my own suspicions. I said nothing, and to this day my suspicions each way are equal. Thank goodness that under the influence of education and the work of the missionaries the terrible appetite which I have just described has 96long since died out. The white man in the South Seas has done that much good. You must remember that I am writing under the still clinging atmosphere that my mind inhaled when I was a lad, of an age when we are apt to look upon those who are mediators with the Supreme as men who are, or should be, very different to other men, and consequently their natural failings were greatly magnified to my onlooking eyes. And so my remarks and musings, considered from this aspect, do not treat harshly the men who went out to the South Seas to reform their brethren, but simply show the futility, the uselessness of mortals attempting to reform, to better the spiritual conditions of those who are born of Mother Earth as they themselves are. After all we are all of us only like little children clambering and crying at the skirts of creation, some with white faces and some with black faces, and if the black-faced children, in their innocence, laugh and cry over their little idol-dolls and are pleased with them, why should the white-faced children try to steal their dolls and smash the lot up and make them unhappy by offering them an idol in exchange which they cannot see and which is too big for them to carry if they could see it. And moreover, what more do the white children know than the black ones? I knew a Samoan chief who was a kind of philosopher of his race, and I was much struck by his remarks and wisdom as he used to sit squatting by his hut and talk to me of the old days. He was not 97a true-blooded Samoan, but came from the Marquesan group and had once been a king before the heavy tramp of civilisation came his way. He would tell me wonderful tales of his time, many of which, when I think of them now, seem almost incredible, but they were true enough and some day I intend to devote my time to writing them down for publication. They alluded a good deal to cannibalistic orgies and terrible battles for the love of the women of those times, wild dances round their monstrous idols, idols that sang and voiced forth terrible prophecies, that made the warriors of those Isles do most outrageous things to their enemies and to their children and daughters. As he sat there squatting and told me many things I would turn “all chicken flesh,” as people say, and watch his grim wrinkled face and twinkling eyes reveal the smouldering passions that flamed in the dark age of his time. Under the influence of that old king’s memories I wrote the following poem just as he would have written it, and approved of it too if he could only see it; in fact it is just what he really said, word for word, but I have rhymed it in my own way. Let him shout on, pass me the full nut-bowl, I’m old, would I trust to his wretched creed? I, with my fifty gods, that soothe my soul, Must fail them all—trust to one god—indeed! Look you—I’m wise, a dead white man is dead Should he offend his Heav’n while ’neath the sun—And we?—well, at the worst, when our soul’s fled, If fifty fail, we’ve still his Mighty One! 98He’d steal our souls, curse him, his lying race Claimed my blue seas and this my ancient isle! Remember well do I that first white face That blessed my head, with hand t’wards heaven did smile, Pah! I believed that grin!—had I known then Those eyes gazed from the spirit heart of Hell I’d slain him!—faith, ’tis true these strange white men One virtue have when cooked—yes, they eat well! Pass me the bowl, time ’tis to grieve, at most, When in sick dying eyes the last stars sleep. We’ve won our battles too, enjoyed the roast Of what sweet foes! ’tis even so we reap Sweet vengeance! They, those prating white men skunks, Our wives defiled, our land made one vile hell; Cursed missionaries, and traders on night-drunks— Ah! I’ve a tale, when dead, their God to tell! He’s dead now and the day is not far off when the whole race will have passed away before the tramp of the Western whites, vanished for ever, for all men know that as soon as the white race creeps into the household of the dark race of the South Seas race extinction commences, and so the Fijians, Marquesans, Samoans, Tongans, indeed all the original inhabitants of the South Sea Isles, are diminishing before the civilisation and Christianising work of the whites, which means annihilation of the brown race and brings before us the inevitable thought that it would have been better for the race and its posterity for the Islanders to have eaten all the whites instead of cohabiting with them. But it is too late, they are now completely in the power of the “great white hand,” as I heard an old chief express it, and soon the half-caste of Chinese, niggers, exconvicts 99and the ne’er-do-wells of the Australian cities will tramp over the graves of the dead men and women who sang by forest huts and danced by the glimmering fires in the days when the white surfs ran up the shores singing into foams and silence. Personally I do not believe that the drastic change to other conditions has anything to do with the diminishing population of the varied races of the South Seas, and all men who have experienced life in those clinics know that rum and syphilis, putrefying the milk of the South Sea babies, and the preventives to motherhood are the sole causes of race extinction, and these causes have of course been introduced by the whites and all the other semi-civilised races. I am simply stating facts as I know them, and I have not the slightest idea in my mind that railing against those evils will better things; indeed to attempt to better the conditions might lead to more disastrous complications, like the sailor who went down into the hold of the ship’s magazine to find where the leak was, struck a match and blew the ship up. And so things are best left as they are; as useless to attempt to change them as to seek to revise a man’s temperament. I myself have made many attempts to change my own temperament, but I think till I die I shall dream and dream and always be under the control of that unfortunate impulse that does the very thing which at that particular time I should not have done. How often do we embrace with affectionate trust our enemy and scorn the advice of our best friend! And so the world jogs along, 100always busy righting the wrongs of life and more often than enough writing beautiful epitaphs on the tombstones of men who cannot read them. Such is my experience of life, and I have been obliged to be pretty observant and have not travelled this world over without noticing the special points that influence existence. It is really wonderful how observant some men are and how unobservant other men are. I knew a man who had done nothing but roam his life away over the seven seas to the mountain peaks of the world. “What is Rio like?” I said, “and the Amazon?” “All right I guess,” he answered. “What’s it like in Pekin?” I ventured to ask again. “All right I guess,” was the growled reply as he squirted out of his grizzly mouth an eggcupful of tobacco juice. I probed him all ways to get a glimpse of his views of the world and experience, but never got him beyond the “all right I guess.” Another time I came across a young fellow who had passed through the same places like a race-horse. “What’s Rio like?” I asked him. At once his face lit up and we had to hold him down as the flood of description he poured into our ears overwhelmed us. So you see it’s a matter of the observant temperament that makes the tale-teller and it’s ridiculous for anyone to think that a man has to camp on the top of a mountain or up a palm-tree for twenty years before he can describe the surrounding country or the height and character of the tree. Nature is very easy to scan and appreciate; it’s only men and women that it takes years to understand thoroughly, and then you may be wrong.","sourceLink":"http://novel.tingroom.com/duanpian/2786/77164.html","bookId":1306,"book":{"id":1306,"title":"Sailor and beachcomber","description":"简介： In the following chapters, wherein I have endeavoured to write down my experiences at sea, in Australia and on the South Sea Islands, I have not gone beyond the first four or five years of my life abroad, but later on I hope to do so, if I get the ch...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2786","creation":"Aug 1, 2019 12:24:50 AM","modification":"Aug 1, 2019 12:24:50 AM"}}
