{"id":34710,"no":13,"title":"Chapter 12","content":"Tramping the South Sea Bush—Native Homes, Scandal and Jealousy—Samoan Children—Samoan Girls attired in European Cast-off Clothes—Another South Sea Chief I think that you might like to hear something of the suburban life in the South Sea Islands, of the native villages inland, and so I will now tell you of my strolls and visits to Marano’s hut and his wife “Taloffora.” One morning quite alone I set out to go inland to the village of Safata. It was a lovely morning; I walked along under the tamanu-trees that skirted the borders of the forest where thousands of screaming parakeets passed over by the seashore, disturbing the tropical silence as they wheeled away. Before starting on the main track I made my way down to the beach to have a swim in the cool waters and refresh myself. I was then several miles from Upolu, and as I crept from the forest and gazed shoreward, where by the palms shone a lagoon, I suddenly surprised a covey of native girls who were all having their morning bath. Some were still in the water and others on the shore; all of them, of course, perfectly nude. I shall never forget how some of them ran up the shore to get their “ridis” while others modestly bent themselves in the shallow waters, their heads and chins just poking out, 121watching their opportunity to bolt up the shore. This they did one after the other, their brown legs splashing out as they raced to the palm-trees, each plucking a big leaf to hold in front of her for modesty’s sake. There they stood in a huddled group just as God’s first thought had moulded them, the jungle grass brushing to their knees, in their hair the lovely wild red flowers plucked from the plants around them, their rows of pearly teeth gleaming as they smiled. I tramped enviously onward. I was very happy that day. Somehow the scent of the sea-winds stirring the forest flowers intoxicated my brain as I trudged along and I felt as though I and those forest trees had been friends for ages. There is nothing under the heavens like a South Sea forest to make the atmosphere of true poetry, to lift you out of and above your fleshy self, and as I tramped along I sang to myself through sheer delirium of happiness. Before the sun had climbed over the western hills I arrived at “Safata” and old Marmona’s wife came from her hut door with her big mouth open so wide with welcome and astonishment that I saw the brown roof and her three back teeth. “Marmona!” she shouted with delight as she called for her husband, “White man’s,” “Siva,” and across the track from behind the scattered shed-like huts of the village that stood beneath the palms and South Sea bamboo-trees came running Marmona, my old friend, whom I had got acquainted with in Apia. He was delighted to see that I had my fiddle 122with me and though he was getting old he clapped his hands and started chanting and did a double shuffle round me as the native girls came running across the clearings to see the white man. Round me they stood gazing into my face in regiments, their thick dark hair smothered in grass; some wore hibiscus flowers stuck behind their pretty brown ears, others a palm leaf twisted hat-shape to fit their curly heads, others were perfectly naked excepting for a tiny strip of tappa-cloth tied round the thighs into a bow at the back and in front a large blushing hibiscus blossom. It was a sweltering hot afternoon and by their huts sat the Samoan parents watching their “Fainetoa” (little children) play. Some of them were very old, dark, hairless-headed grandfathers and grandmothers, and they all sat cross-legged, each on a little mat. Marmona led me up to a group of them and introduced me with pride, very much the same as an English draper would introduce an earl who suddenly claimed his friendship, to his tradesmen acquaintances, for I was a white man, and moreover my violin-playing made me something of a god in his eyes. I fully appreciated his great impression of me, saluted the village folk in lordly style and smacked Marmona familiarly on the back afterwards, and he nearly fainted with sheer pride and delight as the awestruck village élite followed us across the cleared patch towards his hut, where his wife Taloffora was busily laying the cloth on the ground for dinner. Her back stuck high up 123as she stooped and stirred the hot baked fish food and plantains, all got ready especially for me, and I sat there cross-legged on the special visiting mat and thoroughly enjoyed that meal. As I was sitting munching away, thinking how peaceful everything was in that native village, I suddenly heard a loud jabbering in a hut close by. It was a jealous neighbour of Mr and Mrs Marmona’s; they had long since been at loggerheads with my friend and his family, and now to see me there dining with them had riled them till their jealousy knew no bounds, and to make things worse old Madam Taloffora kept talking loudly to me in her own language as she walked round me filling my platter up with more hot fish. I could not understand all that she was saying, but I guessed she was having “one off” her jealous neighbour. Crash! came a coco-nut from the enemy’s hut and caught my hostess a terrible whack on that back part which the South Sea Islanders often reveal when they stoop. With a yell she placed her skinny fingers on the insulted part, and then the outraged husband came rushing under the palms towards her and gazed up into her face. She jabbered hysterically and the old fellow’s brown-skinned face shrunk into a map of scheming wrinkles that denoted intense concentration on the way for the best and speediest revenge! For the brown man is much the same as the white man—he believes all his wife tells him, never dreaming that she is possibly the cause of the whole trouble. Often 124the tribes of those wild lands meet in bloodthirsty warfare, kings are dethroned, queens murdered and unmentionable cruelties occur through no greater cause than that a woman was spitefully jealous of another woman’s tappa waist sash! I knew old Marmona’s wife well, and in truth I could have sworn that she had scandalised the irate owner of the hand that had shied the coco-nut; anyway the deed was done, and I was at my wit’s end to know what to do to avert disaster. As quickly as possible I appealed to the old chap and by many signs and deftly used Samoan words I let him see that the best way to have revenge was not to imitate the injury, but to let me smile on and treat him and his wife with lordly respect. He was a clever old fellow and quickly fathomed the depths of my meaning, and I was so delighted to see how things were going that when he fetched the hut oil pot out in his hand, which the South Sea Islanders always keep ready for bruises, I myself held it as that wretched old scandalous wife stooped and he applied the lotion with his tender hand, and across the track, under the palms through a small hut door, gleamed the envious jealous eyes of the woman who had thrown the coco-nut. Had I not appeased the murderous wrath of my host and hostess they would have attacked that hut and the friends of each would have taken sides and a pitched battle commenced, which would in all probability have ended in the taking of my life. Evidently the jealous neighbour thought she had been sufficiently revenged, 125for with the cessation of Mrs Marmona’s groans the feud ceased. Samoans are not given to vendetta vindictiveness, and mortal enemies by day are often great friends by night; and so it was in this case, for that night, as I played the fiddle, the enemy crept from her camp, sneaked through the circles of native girls and boys who sat all around delighted as they watched me, and fell into the arms of my hostess, each wailing loudly as I played away. Two grim-looking aged chiefs of many past battles chanted some old idol song as their friends sat round with frizzly heads and merry eyes listening to the awful noise. They sang in any key but the one I was trying to accompany them in, but it did not matter—they were all happy enough and so were the audience as they listened and smoked at their ease, tired after working on the yam plantations or on the buildings that were being erected for German Government officials far away by the beach. In the huts hard by I heard the poor brown kiddies being spanked as they were put to bed screaming with disappointment that they must sleep while the chiefs sang and the funny white man scraped the spirit wood with the magic long thin finger, for that was the way those natives described my violin and bow. I shall never forget the strangeness of those times in those primeval forests and native villages. As the moon sailed overhead that night after the concert had ceased I carefully hid my violin in my 126hostess’s hut and took a stroll around under the shadow of the palms. Among the yellow bamboos I saw the native girls in the arms of the Samoan youths, their eyes shining in the moonlight, while the innocent old mothers and fathers squatting cross-legged by their huts smoked peacefully away, thinking those very lovers were fast asleep in the next hut bedroom. Low-caste Native Girl As I strolled by with Marmona by my side they each saluted us with the exclamation of “Talafa!” and “Good white mans.” In the branched moonlit forest by the narrow pathways that lead from house to house, I saw dark figures pass; they were the natives passing and repassing along the silent forest tracks as they hurried each to his home in the woods or other distant villages. Many of them had stayed late in the village where I was staying, and suddenly remembering the domestic establishment, their lonely hut in the forest afar and the waiting wife, they one by one went off running at full speed, and often in those lonely South Sea hills you could hear yells and excited jabberings as the wretched wife screamed and the semi-savage husband endeavoured to explain the why and wherefore of his lateness. Indeed the traveller in the South Seas invariably is astonished by the sameness of the native and the European character. As men say, “civilisation is only skin deep,” and very often so is the difference between the white and brown man. I particularly noticed the manners of those who had better clothes on than their neighbours. They 129would walk along with a trader’s cast-off long-tailed shirt flapping behind them and gaze with a scorn-like glance upon their brown brothers who wore only a native “ridi,” and the native girls nearly burst with pride and vanity as they creep from their hut attired in a red sash only, a banana-leaf hat and white flower behind their ear, and others with a yellow pair of high-heeled shoes on and a white woman’s cast-off night-shirt. The traders call in at the villages and bring all kinds of cast-off European clothing, which they exchange with the natives for copra, yarns and many other things, and so you often are surprised by suddenly meeting a native creeping from the forest wearing some lady’s under-garments, or a pretty Samoan girl attired in a sailor’s cast-off pants, cut off close to the thighs and buttoning under her pretty curved chin! The women struck me as being very industrious. They sit for hours and hours singing and making cloth stuff out of leaves and bark which they keep hammering and weaving. By their side lies the stupendous bamboo stick which every now and again they swiftly lift up and strike their children over the heads with—as they keep pestering them with questions and mischief the whole time that they are working, the bamboo rod gives forth a hollow sound on the tiny native skull, and seems to have no effect beyond checking the infantile activity for a few minutes, after which the mothers, without ceasing the song which is always flowing from their lips, lift the bamboo and strike once 130again. Out of the forest into the village often come the quick-footed youths and maidens with small baskets full of jumping fish which they have been catching down on the shore side in the lagoons and in the sea, and as they go along the tiny baby urchins run from under their mothers’ legs, steal the fish through cracks in the basket and eat them “all alive O.” Round some of the hut dens sit the old stagers of other days, stalwart old men, brown as mahogany, their naked limbs striped with tattoo marks and scarred with spear wounds. Squatting under the shade of the palms they tell the younger men of ancient battles and of the old idols and the wonderful things those idols foretold and how it all came to pass. Those old warriors still believed in the old heathen gods, and when they were dubious about anything crept away into the forest depths and consulted some monstrous armless wooden image, rotting away in secrecy, staring with a big boss eye as it had stared for years through the shadows of the forest, till the superstitious chief crept behind the ancient tree trunks up to it and fell on his knees, lifted his hands and chanted the prayers of his heart to its wooden outstretched ears. There was one aged chief in that village who looked as though he were a thousand years old; he had arched eye sockets and so deep were his eyes set that you seldom saw them, excepting now and again when a tiny gleam of the sunlight struck across his face through the palms as he spoke and 131lifted his head and finger skyward, telling of cannibalistic feasts of long ago. One of his ears was missing; he had once been hideous, but age had softened the wicked features and expressions down, and his wrinkled brown parchment-like face expressed only a death-like awfulness, and made you feel as though you saw life, distorted and wretched, gazing through a human skull which death had long since claimed but which would not die. That wretched old chief told me that he could remember quite well the first white man who had visited his Island, and as he gazed upon me I saw a gleam sparkle out from his hidden eyes and I instinctively wondered what might have happened to that white brother of mine who had fallen into the clutches of that fearful cannibal when he was lusty, strong, glowing with hunger and lust of blood. I do not think he was a Samoan. Many of the older inhabitants of those days were chiefs from other Isles who had fallen through some great tribal battle or had committed some crime and so sought the refuge of another Island where they could dwell in safety, away from the hot vengeance of their own people. I stayed for two nights with Marmona and his wife; they made me up a soft bed in one of their spare huts, but I did not sleep very well for my brain had an annoying knack of starting to think whenever I was left alone. As it happened it was a good thing that I was sleepless on those two nights. As I lay the second night turning over and over on my matting bed, I got so sick of it that I arose and 132lit a cigarette, and without standing up I pulled myself towards the hole that served as a door, and pushing the sacking back I gazed out on to the moonlit village. The winds were all asleep and the shadows of the tropic trees and palms thrown by the moonlight on the wattle huts and roofs of the sleeping village lay perfectly still, and it all seemed as though it were some tremendous painted picture of a tropic South Sea village done in glimmering silver oils. As I gazed I felt that I was the only living creature in that ghost-like sleeping village, and then to my surprise a shadow moved across the moonlit patch, almost just opposite my hut door. Turning my head quickly I saw the frizzly head of a Samoan poke up out of the jungle ferns to the right of me. In a moment I dodged back and watched with one of my eyes fixed to a crack in my bedroom wall; my heart began to beat rapidly, for on all-fours he slowly moved along, stirring the grass aside silently with snake-like stealth as he came straight towards my hut! Every now and again he stopped and looked around to see if all was silent and unperceived. I began to feel in a terrible state of mind, and looking round I swiftly caught hold of an old club to protect myself with, for I saw that it was my sleeping place that his eye was on! He looked a great strong fellow and for a moment I wondered if I should wait and see what it all meant or go to the door and let him see that I had seen him, but extreme funk sent curiosity to the devil and I put my head out of the hut door and shouted Hallo! For 133a part of a second his eyes stared astonished, and then like a startled kangaroo he arose on his feet with one hop and ran off with the swiftness of a race-horse. Marmona and I talked it over next day and we both agreed that my midnight visitor was an envious thief, who was after my violin and thought to steal it from my hut whilst I slept. As I have told you before, the whole of the Pacific Islanders are born thieves, and I noticed that as Marmona told me his suspicions and waxed indignant over that midnight thief his own dark eyes gave one avaricious gleam as he caught sight of my violin, which he would have stolen in five seconds if he had thought I should never suspect him. For the brown men are no better than the whites, and will, in due course, all be virtuous and honest, valuing their neighbour’s opinion more than the article which their hearts long to steal. When I look back and think of the native villages and the peace, with no police patrolling the village road with truncheons and bull’s-eye lanterns to quell the courage of the evil-doer, I really believe the South Sea Island heart is not half so evil as it has been painted, and though I have travelled the South Sea villages, mixed with the native men and women, drank and laughed with them, separated them in their childish squabbles, I have never seen their women creeping about with smashed noses or swollen lips and blackened eyes, as I have seen the women of the white men on the cold streets of London Town. 134The morning after my night fright I intimated to Marmona that I must leave the village, and he arranged to go with me with the idea of showing me the way through the forest to the village of Maffo, as far as I can remember that was the name, but so many of the village names were similar and extraordinary that I cannot be certain of my exactness in pronouncing them now. It was situated near to the sea. Mrs Marmona almost embraced me as I bade her farewell, and I held up her hand, bowed and gently kissed it in courtly fashion. I then did likewise to her late enemy who stood beside her; for I knew that had I not done so trouble would crop up as soon as Marmona and I were out of sight. Old Marmona’s daughter, whom I have not mentioned before, but who nevertheless was a great deal by my side during that visit, came forward and gave me a beautiful native-made comb from her hair, and by the way she gave it I should think that it was the greatest compliment that a native girl can pay a youth. I kissed her hand twice and with sorrow in my heart waved my hands as I passed away into the forest. Poor old Marmona crept along in front carrying my portmanteau, which was a large silk handkerchief that held my violin and bow, a small tooth-comb, brush, and a clean shirt. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2786/77167.html","bookId":1306,"book":{"id":1306,"title":"Sailor and beachcomber","description":"简介： In the following chapters, wherein I have endeavoured to write down my experiences at sea, in Australia and on the South Sea Islands, I have not gone beyond the first four or five years of my life abroad, but later on I hope to do so, if I get the ch...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2786","creation":"Aug 1, 2019 12:24:50 AM","modification":"Aug 1, 2019 12:24:50 AM"}}
