{"id":34717,"no":20,"title":"Chapter 19","content":"Father Damien and the Leper Girl, as told to me by Raeltoa the Samoan I will now tell you of one of those missionaries who were sincere in their faith, unselfish in their ambition and moreover suffered in sympathy over the sorrows of the sick. In a village home about eight miles inland from Apia, I had the good fortune to come across a pure-blooded Polynesian who was a poet and musician. I think I stayed with him for about five or six weeks, but in that little time we became the best of friends. I well remember his intelligent brown eyes gazing delightedly around as I played the violin to him and his pretty daughter, a child of eight years, as she sat on a mat by the door and clapped her little brown hands with hysterical pleasure at the sweet noise of the “piddle,” as she called my fiddle. I would extemporise a chanting accompaniment to his native compositions as he sat beside me, and his wife sang away in the shadows of the homestead, like a wild bird. She, too, had a beautiful face; her eyes were very earnest-looking. They had four children altogether, and as I sat by night in their snug little room, I could see the four little brown heads lying fast asleep in a row in the next room, all stretched out on one large sleeping mat. 220Raeltoa, for that was his name, was a Catholic and had known Father Damien, who lived and died just about that time on Molokai, the leper island of the Hawaiian Group. As a boy he had lived with Damien in Honolulu, and had been a servant to him, and so I heard first hand from Raeltoa little incidents of Damien’s life and character, the man who has since those days become famous the world over for his devotion to the lepers and who sacrificed his own life so that he could minister to their needs and brighten their lives of living death with the hope of another life beyond their own loathsome existence. All lepers were searched for and caught as though they were escaped convicts, and then exiled for ever to Molokai, a bare lonely isle of the Pacific, whereon they lived in wretched huts, wailing their days away as the dreadful scourge ate deeper into their wasting bodies. One by one as the months and years crept by they died and were buried by the solitary missionary Damien, who lived alone with them and buried thousands with his own hands. Eventually he contracted the dreadful scourge himself and died, but not till he had caught the ear of civilisation afar and had vastly improved the conditions of the leper isle and built better huts and made the lepers more contented with their lot. Well, as I was saying, Raeltoa knew him well, and told me that, though Damien was very morose and would get at times into a terrible rage with him, he was a good master and would treat him and all the natives who were under his care as 221though they were his own children, “and he most true to God,” said Raeltoa, as the tears crept into his eyes over old memories. Then he told me how Damien would sit up all night long “talking to great God playing and playing” (meaning praying). It appeared that Raeltoa had a relative who had signs of leprosy. She was a Samoan girl of about twenty years of age, and when the Government announced that all the lepers were to be exiled to Molokai she was broken-hearted, for she was “nice happy and much love my brother,” said Raeltoa. One night, about three months after the search parties had been in force, she came to Raeltoa’s home, and flinging her arms about him, wailed and appealed to him to save her. The tears were in the Samoan’s eyes as he told me all this. It appeared that a jealous woman, who was also in love with the man that the poor leper girl loved, had told the missionaries or the authorities that Loloa, for that was her name, had signs of the leprosy patch on her shoulders, and so they were after her. For several weeks she had been hiding in the forest, trembling and frightened out of her life, till at last, hungry and nearly dead with grief, she suddenly appeared at Raeltoa’s home. He had hidden her for several days, and then she agreed to go with him to Damien and ask for his protection. One night, with Raeltoa, she came out into the forest, almost resigned to her fate—for it had come to her ears that her lover was paying attention to the woman who had put the leper-hunters on her track, and now she felt that she had 222nothing much to live for—and the poor forsaken leper girl took the risk and appeared in the doorway of Damien’s room at midnight with her one true friend by her side. In her childish native language, she told Damien the truth as he sat in his hut, gazing steadily in front of him, for it was his duty to give her up to the authorities. As she knelt before him with uplifted hands, her eyes made more beautiful through the earnestness of despair, Damien still gazed upon her as though fascinated by her sorrow and helpless loveliness, and then he bade her rise, and told Raeltoa to take her home again, and hide her before he was tempted to do that which he ought to do. So Raeltoa took her away again and Damien and he built her a little hut by the forest, where she could be isolated and cared for, “and she was there for many many moons,” said Raeltoa to me, as I listened. “And what happened then?” I asked Raeltoa, and he bowed his head and said: “Loloa was happy, and she loved the white missionary, ‘Father Damien,’ more than she loved the man whom her rival had stolen from her, and so she was happy,” and as he said this he sighed and dropped his eyes, and I knew that he had also loved the beautiful leper girl Loloa. “And what became of Loloa?” I asked again. “They came one night when all was silent, excepting the sighing of the coco-palms by the voice of the sea. I was alone at my home dreaming, when I heard the scream far off in the forest, and I knew 223then that they had found her, and they took her away, and I never saw her again, and Father Damien prayed for many days and many nights and did eat of no food, and I saw the white missionary cry, and cry, to himself many times, and a long time after he too went to Molokai and one year after Loloa died and Damien buried her,” and saying this the Samoan placed his arm gently round his wife, who had sat listening in a wondering way. She could not understand all the language which we were speaking in, but she nestled closer to him as he spoke, for his manner was earnest, and his eyes had tears in them. I also was touched, for I knew I had heard the sad truth of a terrible drama of life, and I saw it all in vivid mental flashes as Raeltoa eagerly told me the secret of his heart and the truth that he had known, and I read the affection and compassion in his eyes for the woman he had loved and the splendid friendship for the man who had befriended her in her terrible sorrow, and who afterwards shared her fate, and lies buried near her on the lonely leper Isle of Molokai. I am glad that now, years after, I am able to tell to the world through my book that which I heard from the lips of Raeltoa the Samoan.[7] 7. Raeltoa lived at Honolulu for eight years before he returned to Samoa with his parents. I made his little daughter “Damien,” for he had called her after the leper missionary, a small violin and bow. I sat all day over the job, and made it from a cigar-box, and fixed two wire strings on it. It was not much of a success, but the child and 224parents were delighted, and as the tiny brown girl toddled about with nothing on, grinding away mimicking me, as she pulled the stick to and fro over the strings, I was very much amused and pleased that I had done it, but I was extremely sorry after, for the poor mite became fond of me and followed me into the forest, and as I lifted her up to carry her over a fallen tree, my foot slipped and, falling with her in my arms, I broke her leg. I was in a terrible state as I carried her home to Raeltoa. As tenderly as I could I held her, and when I took her into the hut I told them what had happened. Instead of them both flying at me in a rage, as I thought they would surely do, they both quickly reassured me, and Raeltoa went to Apia, got a German doctor, and in a fortnight she was rapidly recovering, and I would often sit by her and pick at the fiddle-strings and amuse her. I taught her to say several English words which she soon picked up and laughed delightedly as she repeated them over and over again. Raeltoa would take me away to the coco-nut plantations where he worked, and the natives collected and dried the heaps of copra which was bought by the traders and taken away to Australia. The scenery round his home was very beautiful. The slopes by Vaea Mountain ran down to his homestead, thickly covered with jungle, mangroves, guavas and bananas, banyan and many other tropical trees, the names of which I did not know. There were at that time several other bungalows 225hard by, wherein lived married native couples and some of the white traders with Samoan wives. They were the real old beachcombers and “black-birders” who had made and were still making good incomes by stealing natives, and selling them to the stealthy slavers that called in Apia harbours presumably for cargoes of copra, but really for natives, whom they enticed on board by splendid promises of a glorious sea-trip. They baited their promises with spoonfuls of condensed milk and cabin-biscuits, and while the natives stood on deck smacking their lips with delight, up went the anchor, and before the wretched natives realised what it was to really leave their native land, they were powerless and far at sea. I’ve seen many a Samoan mother rocking herself to and fro wailing and lamenting the loss of her bonny son and very often lamenting the loss of a daughter too. Raeltoa and I went to the top of Vaea Mountain once; when you are half-way up you can look right across Apia and see the beautiful bay and farther across the sea. The jungle at some parts was so thick that we had to cut our way through it. I found some pretty tropical bird-nests, and as we climbed up the frigate birds flew over our heads. We eventually got to the top of the seaward side, right up against the sky. It was very silent and beautiful, almost noiseless, excepting for a bird singing now and again in the big-leafed dark green scrub that grew thickly just below. I did not dream as I stood up there that I was standing on the spot 226which was to be the silent and beautiful tomb of the man who was living miles away down by the river that ran seaward, for that is where R.L.S. lived in his secluded home, “Vailima.” I am sure that no poet who ever lived has found such a grand silent spot for his long rest as R.L.S. found on the top of that mountain that stands for ever staring seaward. I often look up at the moon on stormy nights under other skies, and fancy I see it shining over Vailima Mountain, dropping its silver tide over that lonely tomb, and on the jungle and forest trees of the slopes all around, and over the highways of the sea where now thunder the mail steamers bound for South America. It was about that time that I made the acquaintance of a gentleman named Joyce, who had been a chemist in Sydney. He was a remarkable-looking old fellow and was touring for his health. He had small grey quick eyes, and a monstrous beard, and having no hair on his head he had managed in a most clever way to lift his heavy grey side whiskers up over his eyes and on to his bald head, so that when his hat was on the whiskers protruded and looked as though they were genuine locks in large quantity under his hat.","sourceLink":"http://novel.tingroom.com/duanpian/2786/77174.html","bookId":1306,"book":{"id":1306,"title":"Sailor and beachcomber","description":"简介： In the following chapters, wherein I have endeavoured to write down my experiences at sea, in Australia and on the South Sea Islands, I have not gone beyond the first four or five years of my life abroad, but later on I hope to do so, if I get the ch...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2786","creation":"Aug 1, 2019 12:24:50 AM","modification":"Aug 1, 2019 12:24:50 AM"}}
