{"id":34720,"no":23,"title":"Chapter 22","content":"I leave the South Sea for Australia—Arrive in Sydney—I get hard up and take a Partnership in a Flower Seed Business—The Stockman’s Daughter Ethel—I meet an old-fashioned Australian Bushman—He gives me a Night’s Lodging—I meet with Queensland Blacks—Alone in the Bush—Brisbane With regret I now leave the South Seas and once more start off on my wanderings accompanied by my modest and faithful friend who always sang happily or sadly in response to my own feelings—my violin. Hornecastle was sorry to see me go. He and several comrades saw me off as the anchor went up and I sailed away. I felt sad enough, for I had seen some strange times and a good deal of life in those lovely Isles of the Pacific. I can still see the outrigged canoes following our ship across the bay out to sea; they were filled with Samoans waving their hands and crying bitterly as their departing relatives, all huddled round me on the deck, sobbed loudly as they too waved their farewells, wiping their eyes with their hands and tail ends of their scanty clothes, old sailor shirts and cast-off European underclothes. It was a sad sight to see them moaning by the ship’s rail and those who saw them off paddling away to keep in sight as long as possible—daughters and sons, fathers and mothers, bobbing about in the sunset water, some with their babies perched on their 251backs, as the ship’s screw thundered full speed ahead and they faded away. Those emigrants were innocent Islanders, who I have no doubt had been promised fine rewards to entice them to leave their native Isle for a term of three years, where to go I did not know. Some of the sailors said their destination was New Guinea, others the Queensland sugar plantations; anyhow I am quite sure the best of the bargain was not on their side. One of the women made an attempt to leap over the ship’s side and escape, but her friends held her back, but they all continued to wail and howl like children as they fully realised that they were really off on the big ship bound for other lands! Some of them lay on the deck flat on their bellies, beating it with their hands; the elder men gazed with tears in their eyes across the wake at their home-staying friends, till the following canoes and their native shores died away. I doubt if many of them ever saw their native Isle again. I hope they did. They were stuffed down in the forepeak just by the fo’c’sle all together, women and men. In a few days they were all themselves again, pattering along the decks singing away, cursing the cook’s life as they took their food to him to cook, bread-fruit, stuff which he baked for them in the galley, also jams which tasted something like dried-up baked turnips. I shall never forget the surprise of those Samoans as we entered Sydney Harbour. As soon as Circular Quay came in sight round the bend they lost control of themselves completely, 252waving their arms about in their excitement pointing to the big buildings, opening their mouths, showing their white teeth and shining eyes agog, just like little children at their first Lord Mayor’s Show. Two days after I met them walking down George Street dressed up in robes and sandals, all close together looking at the shops. They stay in Sydney a few days and then they are shipped off to their final destination. I was glad to be in Sydney again, where I met chief-mate Poppy, who afterwards was an officer on one of the clipper ships whereon I too voyaged. He was a fine fearless sailor, square built, and had merry grey eyes. I spent a lot of time with him for I had a little cash left and took things easy for a few days.[8] I went to the post office and found two letters from home and some cash. I immediately wrote to England asking forgiveness for not writing before and assured them all that I was getting on well. I forget now what I really said in that letter, but I know that I gave myself a leg-up, as they say, and did a bit of blowing on my own account. Anyway whether all I said was true or not it made them happy and I was very pleased also when the reply came telling me how proud they all were at my success in life, and two or three pages of good advice how to keep the success going. 8. Mr Poppy later became captain on a clipper ship, and was lost with all hands off Cape Horn. Ah! dear English people, do not believe all the 253wonderful things you hear from your children abroad. Did you hear the real truth you would not call round on your relatives reading that letter over and over till your voice got husky, but it may be that you would sit on your bed and weep your heart out. I’ve seen your successful sons, have sat by them in the dirty lodging-house attic and watched them write those things that made you happy. I have also been their solitary visitor in the hospital as they died of disease and then I have sent the last letter home and felt too wretched to write home myself. Of course some do get on and do very well, but some of the adventurous boys are weak with their passions, and so go to the wall. I could say a good deal on this subject, but I will leave it for someone else. But while I am on the subject I must say it would be well if fathers took their sons aside and told them of those temptations and the awful results before they sent them across the world alone. I will tell you this much—hundreds of fine young fellows have found themselves stranded in the colonial cities, slept out, got into bad company and yielding to the temptations of despair have never been heard of again for five or even ten years, as most of the Australian gaols are away in the bush many miles up country and the prison notepaper arriving in England would tell the tale. So time goes on and the bright English lad, the pride of the school and the mother’s joy, emerges from the gaol door, embittered by confinement, his only comrades the convicts who were released before him and whom he 254naturally seeks in sympathy and so becomes that which he never in his wildest dreams dreamed of becoming. But I must not get into the habit of moralising over the downfalls and temptations that meet the emigrant youth who arrives in the colonies as I did, expecting to see a workless world and a life before him of charming adventure. So I will proceed with my own immediate experiences. I am by nature very lazy while I have got money in my pocket, and this failing impeded my progress in the times I am telling you about. Nevertheless I enjoyed myself, went up George Street and purchased a good rig-out, and then went round sight-seeing and very soon I was on my beam ends again. I was lucky enough to fall in with an English fellow who lodged with me in a side street out at “The Glebe.” He and I became good comrades and as soon as he got to understand my position and dubious future he took me also into his confidence and we eventually became partners in the flower seed business which he carried on from an office in “The Royal Arcade.” It sounds a big address, but it was only a small office. I think the rent was eight shillings a week. In that little office we packed up the flower seeds together and I myself blossomed into a real business youth once again, but it was not half as lonely as that teashop of mine which I have told you about. Off we would go each morning out into Sydney suburbs, each with a little bag crammed to the brim with choice seeds of English flowers. I at once 255wrote home a letter pouring over with enthusiasm about my dreams of future wealth, coming from a prosperous business, but the hard work soon began to tell on my temperament, and my resolution to get on in the world by doing work oozed away as I perspired at the doors of the wooden houses out in Burwood and Paramatta, while my chum stood illustrating to the open-mouthed colonial women the height and beauty of the flowers that would glorify their gardens if they bought our seed. Well, to cut it short, my comrade went off to Melbourne to some relatives and handed me over the whole show. This turn of affairs renewed my old trust in the business, and though I was sorry to lose my friend I bucked up and kept on with the business. Indeed, it was my only hope; my best clothes were in pawn, also my violin. I went next morning to the office and filled up hundreds of bags with seed which I thought corresponded with the flowers illustrated upon them and off I went, taking a book with me full of the names of customers, and very soon I ingratiated myself into their favour and they all promised to deal with me as they had done with my comrade. How it all happened I don’t know, but I had made a mistake and placed a hundredweight of turnip and cabbage seed into the choice flower packets, and when I went off to Paramatta, my best district, a week or so after, I was met at the doors by irate men and women who swore that I had deliberately played a trick upon them, and when I 256arrived at the house of a nursery garden manager who had bought a whole year’s stock from me and found that the whole of the specially laid flower beds were producing nothing else but cabbages and turnips, I had to fly for my life. One old woman raced after me down the Paramatta main road swearing that she would do for me; by Jove, I did run as she waddled shouting far behind! And that was the end of the flower seed business. All of those people knew my business address, as it was on the packets in large crimson lettering, so I crept into the office early next morning, packed the scales up, locked the door and bolted off. The scales were the only things in the office that I could raise money on and I sold them for fifteen shillings and that same day I took a berth on a coaster for Brisbane. I think it took three days to get round. I was delighted to see the old place again. I had taken my violin out of pawn and the day after I arrived I went away up country and got a job on a ranch about fifty miles from Cooktown, and there I blossomed into a real “boundary rider,” as they call them out there. My boss was an Irishman, his wife was English, and a dear creature she was too. There was an old Chinaman working for them and he got fearfully jealous of me as soon as I became a favourite with the girls, for Kelly, that was my boss’s name, had three daughters and one son. I did not like the son, he was a grumpy ignorant chap, and I had as little to do with him as possible. Ethel, the eldest daughter, and I became good 257friends and I taught her to play the violin; she was not what the world would call good-looking, but I saw something in her face that put good looks in the shade. She had fine grey eyes, and one evening when we were sitting by the homestead in the bush, and the parrots were settling to roost in the gums and orange-trees around us, I leaned over her to show her how to hold the violin bow in professional style, and she gazed up at me with an earnest look, and before I could help myself I held her closely to me and kissed her. She blushed and we forgot all about the violin practice and many were the nights that she and I went out into the beautiful bushlands together and I made her happy. I knew that she loved me; her mother was in the secret and gave me every encouragement, and though I got to hate the monotony of bush life I put up with it all gladly so as to keep near that simple bush girl. I thank God that I did too, for the first great sorrow of my life came out of my affection for her. Suddenly she became sick; to our horror she developed typhoid fever and I was the last to kiss her dead face. I cannot tell you any more about it even after all these years; a part of my heart is in that lonely bush grave away across the world in Queensland. I was terribly cut up over that sorrow, and though that homestead of the bush became more lonesome to me than ever, I stayed on for nearly two months for the sake of the stockman’s wife whom I became very fond of as she knew my feelings and I knew hers. I am not ashamed to tell you 258that when at last I wished her good-bye I broke down and kissed her as a boy would his mother. I often wrote to her afterwards and I have some of her letters now, and beautiful letters they are too. I did not care much where I went at that time. On an old Australian hack I rode away intending to go to Cooktown so that I could get round to Brisbane, but the spirit of adventure was in my blood and I altered my course and left the track and travelled north-west. I had a good swag of provisions made up for me by the stockman’s wife, and so I felt secure as far as food was concerned as I rode over the scrub-covered rolling hills of that lonely country. That night I made a fire just to keep me company and camping there alone with the birds and trees around me I slept with my heart in that bush grave. Homestead Scene, Queensland Next morning I rose early and started off again and before sunset I came across a shanty wherein lived an old bushman. He was very kind to me and asked me to stay the night, which I did. I slept on a trestle bed by him in the one dingy small room. He was an old man, and as the moonlight crept through the small window-pane and revealed his sleeping face I noticed that he had lost all his teeth, and every time he breathed his lips would puff out and then go inwards, making a ghostly chanting noise at regular intervals throughout the whole night. I got quite nervous and never slept a wink till daylight crept across the tree-tops outside and a kind of sweet reality stole over the hut-bedroom as 261I closed my weary eyes and slumbered, but only for about ten minutes, for he had slept well and waking up with the light he started to make a deuce of a row, chopping wood. I left early that morning and from that day to this I have never slept with toothless old men. He was a real Australian bushman, I could tell that by his conversation, which consisted of about twelve words during my stay, the longest sentence of all was the first at our meeting by his hut door when he looked at me for a minute and then said, “Want some tucker?” meaning food. “Yes, thanks,” I answered, and when I had eaten up ravenously all he put before me he sat and smoked by the door, and after an hour’s silence said, “Turn in?” Again I answered “Yes,” and when I left in the morning he simply said, “Good luck, chum,” and closed the door on me. This sounds a bit far-fetched, but it’s true enough! Through living in the bush they all get taken that way and almost forget their own language and look upon you as a nuisance if you ask more than one question a day. Once more on my own, as they say out there, I started off. It was sweltering hot. I did my best to keep in the shelter of the tall gum forest that covered the hills for miles around me, and seeing no more signs of houses about the whole day I began to consider it would be best for me to alter my course and make for Cooktown as I originally intended doing. I did so, and camping on the steeps that night I saw a ring of smoke curling up almost 262opposite to the side of the slope whereon I had camped. Leading my horse I went over the rim of the hill expecting to see a homestead, and as I looked down a swarm of black awful-looking faces huddled around a bush fire looked up at me with startled eyes. I had stumbled across a camp of the roving Queensland blacks! There they sat, black, pot-bellied, nude women and men, some of them holding short clay pipes between their thick protruding lips. I had heard that they were quite harmless, and so I bravely walked down the slopes and introduced myself. The head of the band was a stalwart ferocious-looking fellow and tried to speak to me. “White fella all lone,” he said. I shook my head and said “No,” at the same time pointing behind me over the hills so as to let him think that I was not alone. There is nothing like being too careful with blacks; they are harmless enough, so I had heard, but I did not want to give them a chance to profit over their old instincts. There are even white men in lonely bush lands who would crack you over the head if their exchequer was getting low and the addition of another man’s would make the outlook brighter, and so I was wise in my answer. I shall never forget the sight of those aboriginals and their startled eyes as, squatting there, some huddled in dirty Government blankets, they watched their meal cooking, which consisted of green frog and fat lizards that bubbled and squeaked in the glowing fire ash. One fat, awful-looking 263woman asked me in broken English if “white man got baccy.” I felt relieved to think I could do her a good turn, and quickly gave her a small piece of ship’s plug tobacco, which she snatched out of my hand without a word of thanks. They were all nearly naked; there were four women and about a dozen men and they all continued to stare up at me as I stood by them, their bright dark eyes shining through their thick matted hair. The old woman to whom I had given the tobacco quickly tore it up with her long fingers and sat there with her chin on her knees puffing at her short clay pipe, her lips dribbling and smacking together like the flapping wet sails of a becalmed ship as she puffed away. It was terribly hot, and as the sunset died away behind the gum clump on the skyline I took off my coat and vest and kept only my pants on, tied the legs of my horse so that she would not roam too far off and sat down by those wild bush blacks and taking my violin out of my swag I started to play a jig. Their eyes lit up at once with wonder and I was obliged to let them all carefully examine the instrument. They looked inside of it, turned the pegs and even smelt it, but could not understand where the music came from, and the one baby that clung by its mother looked at me as though it would have a fit each time that I started to play. They had no idea of melody but a good idea of time, and all started to move their bodies to and fro as I extemporised a strain which I thought would suit the occasion. One old fellow with extraordinary 264thin legs and a big protruding belly started off in one of their native dances. Up went his legs skyward and once or twice he almost turned a somersault, and his shadow in the moonlight mimicked him on the slope side as its head bobbed out of the gum-tree tops that towered just over him. I did not like the idea of sleeping with them, so I packed my violin in my swag and pointed to the hills and intimated to them by nods and signs that I must go and join my comrades, and off I went over the slope, and as soon as I thought I was clear away from them I camped at the bottom of a steep gully and, tired out, I fell asleep. When I awoke the sun was blazing through the trees at the side of the gully height, and I sat up, and looking round I missed my swag. Running to the top of the slope I looked around; my horse too had vanished. As quickly as I could hurry along I went down to where I had left the blacks. There was the fire ash and round it a circle of naked foot prints, but not a sign of them in sight. They had crept over the hills while I had slept and stolen my swag and horse and left me standing alone in that wild country perfectly helpless with nothing on but a pair of pants! I gazed like one in a dream on those footprints and the camp fire ash. I was terribly thirsty and at once started off to find water. I was soon successful and on my knees I blew the scum off the creek pool and drank. I don’t know how I got through that day, but I did, and before nightfall 265I had reached a wooden house on top of a hill. I crawled round to the side door and knocked. A young girl opened it and seeing me in such a state quickly slammed it and the stockman came rushing to the door to see what was the matter, a gun in his hand, and if I hadn’t been quick, as it was nearly dark, I really think I should have been shot. I soon explained matters to him and he proved a kind fellow, gave me an old suit and I stayed there for three weeks and helped him to build an outhouse. He paid me well and I arrived back in Brisbane with nearly five pounds in my pocket. I had had enough of the Australian bush and made up my mind to get employment in the towns. Before my money had gone again I started to look for work, but only succeeded in getting a job in a restaurant in Queen’s Street. My duty was to wash the dishes and wait on the customers. It was not at all in my line, and I could not get any sleep. The first night was an unpleasant one; my bed was one of a number in a dirty top room and up till about two in the morning the door would keep opening as those who were partially sober carried in men who were blind drunk and placed them on the beds by me. I sat up in my bed utterly miserable and watched one red-nosed, black-bearded besotted-looking man drivel at the mouth, swear and groan as he made vain attempts to get his boots off, and once or twice he looked round at me with an idiot-like stare and said, “Hello, maish, s-how are you?” and bending towards me affectionately, 266tumbled on the floor. And another one in the far corner would often stick his head out of the dirty sheets and shout, “Wash’s the time?” So no one will blame me when I tell you that I crept downstairs at daybreak and bolted. About a week after I was covered with a tremendous rash and was the most miserable youth in Australia. I took a motherly woman into my confidence and I soon got rid of them: bugs and fleas are real comrades compared to those terrible things that I took away with me when I left that restaurant bedroom. I can assure you that I never worked in a restaurant again and even now I am nervous in the presence of drunken men whom I do not know well. Hornecastle was bad enough, but there was something about him that inspired confidence as well as disgust. I always found the motherly women were my best friends when I was in trouble, for though I had not got a cent they generally took me in and waited till I obtained employment. I suppose they saw that I was young and respectable, and in the colonies, in those days, there were hundreds of young fellows on their beam ends who were trying to make a way for themselves, and as they always paid up at the first opportunity these women generally had faith in the derelicts that tramped about the towns of “the land of the golden fleece” looking for work. I got a job in a furniture warehouse and stayed there for quite three months until business got slack. I being a new hand received the “sack.” My roaming instincts took me down to the wharf and I 267was in with the seafaring men again, heard once more the wonderful tales of adventure on the seas and in far countries, but I was not quite so interested as I had previously been, for I too had seen a bit of the world and no longer believed all that those sea-beaten old salts told me. Nevertheless I liked their companionship; they were so frank and jovial in their narratives. I came across two or three of the men whom I had known when I was first stranded in Brisbane and several of us got a job painting the side of a large sailing ship that lay alongside. I slept on board with the crew in the fo’c’sle and got in with a young German who had worked his way out at “a shilling a month” and had not got the pluck to leave the ship, and so intended to work his passage back to London. Influenced by me, however, he altered his mind and stayed behind. He was a steady fellow, older than I was, I think about twenty years of age. He had one failing which I well remember: he was always running after the girls and thought of little else. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2786/77177.html","bookId":1306,"book":{"id":1306,"title":"Sailor and beachcomber","description":"简介： In the following chapters, wherein I have endeavoured to write down my experiences at sea, in Australia and on the South Sea Islands, I have not gone beyond the first four or five years of my life abroad, but later on I hope to do so, if I get the ch...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2786","creation":"Aug 1, 2019 12:24:50 AM","modification":"Aug 1, 2019 12:24:50 AM"}}
