{"id":22461,"no":3,"title":"CHAPTER II THE PEOPLE","content":"Let us first take the people as a whole. \n \n I am aware in the first place that there are some who will object that the Indian peoples are not a whole. \"There is no Indian people,\" they will say. \"There are innumerable races, tribes, castes, diffused over a continent. They have nothing in common, neither language nor religion, nor habits nor ideals. You cannot talk of the people as a whole.\" \n \n Yet they have one thing in common; they have a common humanity. Religions, castes and races are but clothes. Beneath them lies humanity. And humanity is always the same in essence because it is one Soul striving towards one object, though in many different ways and in various stages of attainment. \n \n I will show this by one instance. It is said, for example, that the instinctive feeling of an Oriental towards women is different from that of Europe; the West respects women, and the East does not do so. This is proved to you by their habits, by polygamy, by polyandry, by, for instance, the habit of a man walking in front and the woman behind. These customs, you are told, disclose the Oriental attitude as different from ours and as differing in various parts of the East. \n \n They do not do so. \n \n The instinctive feeling of men to women is the same everywhere; it is an invariable emotion. Customs hide it, disguise it, and sometimes almost kill it; they never alter it. \n \n A Burman walks in front of his wife because in the very recent past, everywhere in Burma, and in most places even now, the advance was the place of difficulty. There were no roads, only paths through jungle or across the fields. There were thorny creepers to be cut back, streams and mud puddles to be forded, cattle and buffaloes to be driven away, snakes to be killed, and the nasty, snapping pariah dogs to be kept at a distance. No woman could or would go in front. The man goes in front from courtesy and carries a chopper, the woman follows with the bundle. It is their courtesy. If this habit continues when the necessity has passed, that is simply because a custom once established is, East or West, hard to break. See what Yoshio Markino says about this same custom in Japan. \n \n Polyandry was due to restriction of the means of subsistence, limiting the population and so necessitating the exposure of girl children; occasional polygamy—for it is always only occasional, exceptional—is an imperfection of humanity, universal East or West. In the East they try to make the best of it by acknowledging it; the West hides it and pretends it does not exist. That is a difference of treatment, not of fact. \n \n If you want to know the true instinctive feeling of men to women in the East you will find it not in laws, customs, or religions, but in the literature. Read their folk-tales, their love-stories, those which warm the hearts of boys and girls, of men and women, aye even of the old, those that rising from the heart appeal unto the heart. Their ideals are our ideals—one woman and one man; and I think sometimes they come nearer their realisation than we do. We pretend more, but pretence is not reality. \n \n If this be true of love, the mother of all emotions, it is true of all the others. Their circumstances being different they must find different ways of reaching towards their ideals, but the ideals are the same. \n \n Therefore all the Indian peoples have a common humanity; and more, they have a great many circumstances in common. They are all, for instance, mainly agricultural; they are all in a very similar stage of evolution—the village community stage; they are all poor, they are all natural and simple; they are all under our rule. These are more potent influences than religion or race if they are allowed to have their sway. \n \n Then as to races, I do not think, for instance, that races in India are much more mixed than in Italy. Think of the races there are all grouped under the name Italian: there are Roman, Etruscan, Greek, Saracen, Norman, Goth—who shall say how many more? And in Great Britain I cannot count them. \n \n Therefore, because in this book I am speaking of the real humanity hid beneath the clothes, the bonds, the chains of conventions and of customs, of religions and belief, I can speak of the Indian peoples as one people. Details differ enormously, but details do not ever affect principles, only the method of their application. And creeds, faiths, laws, and customs pass; humanity remains. \n \n The Indian people, then, over whom we established our government accepted it, and helped us to establish it. They wanted peace. For two centuries or more they had been torn with wars, with insurrections, with internal anarchy, and with their consequences. They wanted rest, to plough, to sow, to reap, to trade in peace. We gave them that. They wanted Courts Criminal and Civil that were not corrupt. We gave them honest Judges. They wanted facilities for trade—roads, posts, and such things—which we provided. They could expand and use some of their energies. \n \n But the field was a narrow one. Men are not born to sow and reap and trade alone. They have other emotions which seek for outlet, other energies which require a vent. Man is gregarious, and he is so made that he cannot fully develop himself except in larger and again larger communities. To reach his full stature in any way he must develop in all ways. He must feel himself part of ever greater organisms, the village first, the district and the nation—finally of humanity. \n \n But in India all this is impossible. Except the village there is no community that exists even in name, and we have injured, almost destroyed, even that. Thus an Indian has no means of growth. He cannot be a citizen of anything at all. Half his sympathies and abilities lie entirely fallow, therefore he cannot fully develop the other half. A man is a complete organism, and if you keep half in inaction you affect the other half too. A man is not a worse but a better merchant, or lawyer, or landowner, or soldier, because he is interested in his locality, his community, his nation. It gives him wider views, makes him more tolerant, more humane, more wise. Man as a unit is a poor thing, physically, morally, and intellectually. Ability is the product of communities, of men formed into organisms, not of individuals. Each man in himself has no duty but to himself; to own a duty to a community he must be part of the community; to a government he must have a place in the government; to a nation he must be part of the nation. But in India there is no nation, no community at all, save very weakened village communities. As far as the Indian is concerned no larger community exists. And I have already pointed out that India has no place in the organism of government. \n \n It is the slowly growing consciousness of an energy that has no outlet, of a desire for advance in every direction, that causes the unrest. In some ways the educated classes feel it most. Elsewhere they see men of their class cultivating their patriotism, increasing that sense of being and working for others, of being valuable to the world at large, showing capacity for leading, ruling, thinking, advancing in a thousand ways, while none of it is for them. They want to express the genius of their races in wider forms than mere individuality, but they are not able to do so. They want a national science and literature and law; they cannot have it. No individual as an individual can achieve anything. Not till he feels he is a cell in a greater and more enduring life can he develop. But this is not for India. \n \n It is a piece of advice often addressed to India when she expresses her desire for some share in her government that she should first reform herself socially and intellectually. The status of women in zenanas and harems, infant marriage, the sad condition of widows, the degradation of caste, polygamy, the fanaticism of religions, are, she is told, to be mended before she can show herself fit for self-government in any form. Only to a free people can self-government be safely entrusted, and she is so wrapped up in prejudice and ignorance that she is unfit for any freedom. \"Mend your divisions first; reform yourself, and we will see what we can do.\" \n \n Such advice comes from ignorance alone. It is but another instance of that Phariseeism that has become so common with us. It is impossible for individuals to reform themselves, however much they may wish to do so. For an individual to reform, his whole environment must be reformed as well. For example, take widow remarriage. How can widows remarry in comfort till the whole structure of Hindu convention is changed? Not one individual nor a million individuals can break a convention. There is a strong feeling, as we know, amongst Hindus against this and many other conventions that stifle them, but every effort to break these chains has failed. Why? Because to break fetters bound upon society by religion or convention takes the combined effort of society, and even then it is difficult. The inertia of peoples is a deadly difficulty to overcome. \n \n But we have not allowed the collective instinct any opportunity of developing. There are no nuclei; there is nothing to draw the people together. \n \n Take again the differences created by races, religions, castes. It is the interest of the priests to maintain these differences and exaggerate them. Religions never reform themselves. What influence is there to soften them? None that I ever heard of. \n \n But self-governing institutions do tend to remove them. In the village communal life they are to a considerable extent ignored. The organism of the village, when healthy and free, forces men to disregard artificial barriers of this sort and meet on common ground for common business. Solidarity comes from the sense of the necessity for solidarity in order to get on. Its possibility is soon manifest. \n \n But where in India is there any influence tending towards this end? The barriers of caste increase and grow, as naturally they must do. There is no rapprochement between Hindu and Mohammedan, but on the contrary the gulf is widened. It must be so. And if Government makes the fatal error of adopting the motto \"Divide et impera,\" if it in ever so slight a fashion identifies itself with one caste, race, or religion above another, then it is near the end of all things. But to the development of self-government the effacement of these divisions would be necessary, and in the pursuit of an eagerly coveted ideal they could pass and disappear. No other influence can do it. Again history shows this clearly. It was this influence in England that rendered Catholic emancipation possible and had brought creeds politically together. Did we in England live still under an aristocracy as we did a hundred years ago the divisions between Catholic and Protestant, Churchman and Dissenter, Christian and Agnostic, would still be as sharp as they were. These artificial barriers of creed and race give way only under the pressure of a stream of national life. That is beginning already to flow in India; be ours the task to help it flow in true and widening channels so that it may become a great river, fertilising all things. Now the main idea seems to be to dam it up, and so cause it to flood and to destroy. \n \n I hope that what I say will not be misunderstood. I do not for a moment mean that political organisms should or could be used for social reform. That is quite impossible. Any such attempt would wreck the organism, which, as an organism, must pursue only its legitimate ends. \n \n But I say, and all history is at one with me, that suitable free institutions do cultivate and bring out the faculty for freedom, and demonstrate that in all matters it is necessary. \n \n Again, consider this: the laws concerning marriage, divorce, adoption, and inheritance, whether of Mohammedan, Hindu, or Buddhist, are petrified. With changing circumstances, changes in these laws become of the first necessity; yet as things are now no change is possible. Take the ten million Buddhists in Burma. Their laws of marriage are contained in the Dhammathats, which are derived from the laws of Menu, and are I don\u0027t know how old. Now there is this that is good about them: they were codified when India was free, before the night of religious bigotry descended upon it. They are, therefore, based not upon religious ideas, but upon custom which was based on experience. The spirit therefore is excellent, it is common-sense; it is not the pretension of an ideal long before the ideal is universally possible, but a common-sense recognition of human nature as it is, and the necessity of doing your best with it. They are the only marriage laws in the world framed by common sense and not religion. Men and women are free and equal. But although their base is excellent they were framed for a very different environment from what obtains now. And again, there are two or more codes, and they differ in details. There is nothing the people want more than a rectification and consolidation of their laws, with registration of marriage, the power to make wills, and other matters. They are always expressing this necessity because the present laws of inheritance handicap them against other races. They cannot make wills, and the law of inheritance is so vague that when a rich man dies litigation almost always ensues. The estate is dissipated in law-costs and the heirs ruined. \n \n But who is going to draft the new laws? Not Government. Once bit twice shy, and the Government of Madras had a try at that in Malabar. There was urgent necessity there for some system of marriage registration, so Government appointed a Commission which recorded quantities of evidence, and framed a Report, on which an Act was passed. It was supposed to be absolutely according to the wishes of the people. I have not been in Malabar since the Act was passed, but one friend has told me that three marriages were registered under it. Another friend told me that this is a wild exaggeration, and that only one marriage was registered under it, just that the people might say they had not rejected the Act without trying it. However this may be, the Act is a dead letter. It was bound to fail. The people find the laws of Government already too stringent, interfering too much, and too inhuman, even where they deal with matters outside the home. They will never allow an alien Government a footing inside the house. They know Government has destroyed the village; they fear it will destroy the family. Therefore Government holds its hand. It cannot do otherwise. For even if it could frame an Act in accordance with the wishes of the people, that Act could not be enforced. And it cannot discover the wishes of the people, because the people themselves don\u0027t know. The opinion of no matter how many individuals is no true guide. Because, to justify a new Act of inheritance, not individual opinion but joint opinion must be known. They are not the same. Ten men as individuals will tell you one thing; these ten men as a community would tell you a different thing. This is a fact in psychology I shall have to refer to again later. It is undoubted. \n \n Now the joint opinion of Burmese society as to the proposed change cannot be gauged, because it does not exist. There are no Burmese communities to evolve any common idea. Therefore the archaic laws must remain as they are. \n \n Thus throughout India all progress of all sorts is barred; can you wonder that there is unrest from this one cause alone? \n \n And this feeling goes down to the very lowest ranks as an unnameable, unanalysable fever and unhappiness; you see it everywhere. \n \n Then there is more than this. A system of government and law that was bearable when we were weak is unbearable when stronger. What gives you help when young becomes a fetter as you grow. It bites into the flesh like cords too tightly drawn, and in India instead of being loosed they have been drawn more tightly year by year. \n \n It is not only that the people have grown bigger, but the bonds of government have grown narrower. It has grown more of a machine, less human than it was, less human year by year, until sometimes now it is almost inhuman in its rigid formalism. The bonds cut into her flesh; India wants to grow, to rise—but cannot. How could it be but that she should show unrest? \n \n India wants to get on; we bar the way, so India feels unrest. \n \n Now if you will consider this unrest you will admit that it is not a bad symptom but a good one; it is a sign of an increasing life. Neither is it uncomplimentary to us that it should have arisen. It is the greatest compliment our rule could have. A hundred and fifty years ago—even, perhaps, fifty years ago—India could not have felt this. She was exhausted, weary, wanting peace. We gave her peace, and so she has grown strong and overcome her weariness. That is our doing. No one else could have done that. We gave her a complete rest cure. We said, \"Keep still, and eat and drink; we will do all the thinking—the ruling that has to be done. Do not be afraid, for we can do it well. Have confidence. Get back your nerves and strength. We will look after you.\" \n \n We did. How well we did it history tells. We did not spare ourselves. I do not say we acted from any altruistic motives. I do not say we have not made mistakes. But we did it. The task was great; the greatest, perhaps, the world has seen. \n \n India is rested, and she wakes, she moves. Why are we angry? Should we not feel proud? \n \n Can we not give her a hand, and say, \"Rise up and try to walk. I will hold your hand at first, till you are stronger. Then when you are grown you shall walk free, beside me, as my daughter whom I have brought up\"? \n \n I see continual denunciations of the unrest in India. Why? I see continual regrets that the past is passed—but why? Continual threats are breathed towards India. Why? \n \n For myself, I hail it as the happiest omen that could be. It has unfortunate exhibitions sometimes; that is partly our fault, I fear, because we do not recognise that the past is gone for ever. India has grown, and we forget. We give no outlet to these true energies that have developed. India was our patient; now she is recovering shall we make of her a subject, or a daughter? She must be one or other, or leave us altogether, for the past is passed. \n \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2705/74368.html","bookId":1443,"book":{"id":1443,"title":"The Passing of Empire","description":"简介： Most people when they talk of India, most books when they treat of India, are concerned with its differences from the rest of the world. It is the appearance and the dress of its peoples, their customs and habits, their superstitions and religions, t...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2705","creation":"Aug 1, 2019 12:25:06 AM","modification":"Aug 1, 2019 12:25:06 AM"}}
