{"id":22464,"no":6,"title":"CHAPTER V CRIMINAL LAW","content":"Let us turn now from the personnel of government to its methods, from its men to its laws, from the motive power to the machine it works, or which more often now works government. The first subject that comes naturally to our view is the prevention and suppression of crime, for in point of time that precedes all else. When you are conquering a country, after the soldiers have partly done their work and the civil power comes in, its first care is to create and maintain peace. It organises a police and appoints magistrates. Thus in point of time the Criminal Courts are the first to be organised and criminal law to be laid down, and they are the foundation-stone on which all else is built. And they remain always the most important of the functions of government. If they work well, then there is a good beginning made, but if ill, then the outlook is bad. If what should be Courts of Justice cease in the opinion of the people to be so, then is the very foundation-stone of your rule dissolving. The whole edifice is undermined; it is not founded on a rock, but on something that decays, which soon will give way and let down everything. Let us go back therefore to the beginning, and see how things worked then. The laws were few, were crude, were often bad. It must be remembered that a hundred years ago the penal laws in England were the most savage, the most useless, the most wicked the world has ever seen. The law in India could not therefore be expected to be very good. But previous to our rule there was no law at all generally. And these bad laws of ours came to the people through the medium of personalities who were for the most part intelligent and sympathetic. Moreover, there was nothing like the number of cases then as now. The system now obliges all cognisable crime to be reported even if petty in its nature. In those days very little crime was reported, it was dealt with by the village communities and never known to the Courts. There were few pleaders; and a trial was really what it ought to be, an inquiry into facts by a magistrate desiring to know them. The question of personality came in a great deal, and whatever may be alleged of the ordinary district courts of those days, they were human, they really tried to be Courts of Justice, they tried to understand. The people respected them. If they did not respect the law, at all events they respected the magistrate who tried to do his best with it. They had an admiration for his personality which went a long way. Now that is all changed. The law has been greatly improved. It has been codified by trained legists; Lord Macaulay and Sir James Stephen were two of them, and it is up to the standard of European codes. But, on the other hand, it has been made absolute. There is a reign of law now, and there is no person in the world who does not hate law when he sees it. The personality that softened it in the old days has been ruled out. The High Courts supervise all work and reduce it to a dead level of uniformity. There is even a fixed scale of punishment sometimes. On revision, cases are rejudged on the written evidence alone. Of course, the case cannot be altered on revision, but the magistrate can be admonished—and he is. All humanity is eliminated. Therefore the Courts are despised and hated by the people, who misuse them in every way they can. Let us look into this matter. In the first place, let me explode a common fallacy. It is frequently said that Oriental people do not dislike crime, that they condone it, that they have low standards in matters of current morality. Therefore they are not anxious to have crime brought to justice as we are. They are a bad lot, and the criminal being but a trifle worse than the average they sympathise with him. All that is wicked nonsense. Standards in the East are the same as they are elsewhere. The people dislike crime as much as we do. But they think our laws and Courts are not calculated to reduce crime, and they have good reason for so thinking. Moreover, they distinguish between the sinner and his sin—we don\u0027t. There lies the difference. Let us consider, therefore, the Courts and their relation to the people. I confine myself to the province of Burma which I know best, but there is little difference between it and other provinces in these matters. The law is uniform, the procedure uniform, and what differences exist are due to interference of the High Courts acting within the law. In the Indian Penal Code are laid down definitions of the various offences; what it is that constitutes theft, or robbery, or murder. It was drawn out by skilled and able men from the experience of all civilised nations. It is not, of course, perfect; no code could be that or near it, but it is good. With most of it the people have no quarrel. A theft is the same anywhere, and so is a murder. With one point, however, they profoundly disagree, and that is the classification of offences. Theft, no matter how trivial, is an offence against the State, is not compoundable, and is cognisable by the police; whereas an assault, no matter how severe, unless it causes grievous hurt, is the opposite. It is a purely private matter, with which the police have no business. If the sufferer wants to prosecute he must do so himself; pay his own expenses and engage his own pleader, or go without. This is a difference that offends his own instinct. Just take two cases. Your servant steals a little silver ornament, a few rupees you left about; or some hungry loafer takes some fruit off your tree. You may not forgive him, you may not overlook it. You are bound by law to tell the police and get the offender arrested and convicted. By the petty theft public morality has been outraged, and you must assist morality to vindicate itself. You have no option. If you do not tell the police, you are \"compounding a felony,\" and may be punished. Having told the police you will have no further trouble. They will get up the case, look up evidence, summon the witnesses, prosecute the case, and you will be paid for giving evidence. The thief will be sent to gaol. But if your enemy meets you in the fields, knocks you down, rolls you in the dust, dishonours and abases you in your own esteem and before all who know of it, public morality is not offended. It is of no use going to the police-station; they will not listen to you, they will not prosecute, nor take any notice. If you desire justice you must go yourself to Court, pay to have a petition written, pay for a stamp, get an advocate and pay him, pay for summonses to witnesses, spend, say, three or four pounds, and eventually your enemy may be fined five shillings, of which you, if lucky, may get two as compensation. You may, if you like, at any time withdraw your complaint, if, for instance, your enemy apologises to you or compensates you. Now these are not selected cases, exaggerated cases, nor unusual cases. They are common, and in both cases the instincts of the people are outraged. They are not sordid-minded. A petty theft is not to them a very serious thing. They put a higher value on their personal dignity and self-respect than on a trifling piece of property. To them, therefore, all this is wrong. Theft is never a very deadly offence, and if of small things is easily forgiven. But they may not forgive. If the police hear of it, they must give evidence against the culprit—or must lie. They lie. Who blames them? The concealment of thefts, the refusal to report them to the police, the subsequent refusal to give evidence, are common. Is theirs the fault? On the other hand, as it is impossible in the Courts to get any satisfaction for an assault, the hot-tempered Burman seeks revenge in other ways. The Court fails him, so he takes the law into his own hands. He will waylay, will stab, will sometimes murder. Then Government grieves over the large number of serious-hurt cases and wonders what causes them. The wily Madrassi or Bengali coolie gets square in a different way. The injured complainant goes off straight to the police-station and there describes the assault more or less correctly. This, of course, he knows will not help him, so he adds as follows: \"During the assault a rupee dropped out of my pocket, and when A had finished battering me he picked up the rupee and went off with it.\" This makes the offence \"theft,\" which is cognisable by the police, who go off and arrest B and lock him up. Of course, at the trial the experienced magistrate detects the truth, firmly disbelieves the rupee, and convicts A of an assault only. But B is quite satisfied. Has not A been locked up for a week? The perspective therefore of the Indian Penal Code is wrong. It is taken from English law, which is also wrong, that is, opposed to common sense. How it arose I know, but this is not the place to enter into that. Therefore the very definition and classification of offences are repugnant to the people, and are themselves causes of evasion: the Indian Penal Code itself is wrong. But that is nothing to the wrong-headedness of the Criminal Procedure Code. For whereas the Penal Code only partly offends the people, the Court procedure is wrong from top to bottom. Its very foundation principle is wrong. What is its principle of a trial? Is it a means of finding out the truth? Is it an impartial inquiry into what has happened? Not in the least. A trial is a duel. It is the lineal descendant of the duels of the Middle Ages. The place is changed, it is a Court and not a field; weapons are witnesses and tongues, not swords nor spears; the parties fight by champions, not in person, and the umpire is called a judge, but the principle is the same. Take any criminal trial. On one side is the Crown prosecutor, on the other the advocate of the accused. They fight. All through the case they fight. The prosecutor calls his witnesses, asks them only the questions the answers to which will help his case. The other champion cross-examines, bullies, confuses them, tries to make them contradict themselves, drags in irrelevant matter, and tries to destroy what the other side has built. When the defence is on, the state of affairs is reversed. Neither wants the truth, and only the truth, and all the truth. Each plays to win, and that alone. If either knows evidence which would help the other side he suppresses it. The judge is almost helpless. He has to take what is given. He sees lacunae in the evidence, he cannot fill them. He can\u0027t get down from off the bench and go out into the country finding evidence for himself. He knows that every witness brought before him has been tutored—not directly perhaps, but indirectly by suggestion, by question, by influence. The case is cooked before it reaches him, and therefore hopeless. He knows he never finds out the exact truth about any single thing. How should he? He knows and sees that witnesses are lying. He knows the reason, because it is a duel, and they are, on one side or another, fighting for vengeance, fighting for liberty. He knows that though they are a singularly truthful people outside, yet inside, their consciences absolve them from the necessity of truth because the Court is so constituted as not to be a place for an inquiry into truth, but the arena of a duel. He sees cases bought and sold. A clever barrister or advocate will secure an acquittal where a cheaper man would fail. That is notorious everywhere. Otherwise how do great barristers come by their big fees? Clients do not pay for nothing. A barrister is worthy of his hire. The poor man loses and the rich man wins. The poor man goes to gaol, the rich is acquitted or gets a light sentence. So it happens everywhere. The exact truth of a case is never known. For twenty years I was a magistrate and judge. I tried hundreds of cases and I did my best with each. But I never once reached my own standard of understanding. What is that standard? Not that of Courts of Appeal who generally upheld my cases. My standard was this: Do I know enough of the case to write a story embodying it if I wanted to? I never did. For the standard of truth that goes to even the slightest story is very far beyond what is required or possible in even the most carefully heard case. Now this is not an edifying state of things. It is not edifying anywhere, and I have often heard remarks about it in England from men who happened into a court of law to hear a case. To judges, lawyers, and barristers this view of the proceedings does not occur, because they have been brought up to it, and therefore their minds are locked as far as really appreciating it goes. In India and Burma it is even less edifying. I have often heard Burmans talk of it. \"Here on one side are the police, trained men, with all the power and resource of a great Government behind them, trying to get a conviction. They have gone about the country, searched out evidence, tested it, summoned it, and displayed it to its best effect in Court. On the other side is a poor devil of a villager who has been locked up while the police were free; who is poor, who is ignorant, who if he can afford a pleader at all can only afford a very indifferent one. His case is not presented at all, or is very badly presented. True, the case has to be clearly proved or he is acquitted, but the same facts may wear very different colours, according to whether the whole truth is known or only a half. The magistrate does his best, but he can only act on the evidence. The police want a conviction because otherwise their records are bad and promotion is stopped. Do you wonder that sympathy is often with the accused?\" So I have often been asked; and I don\u0027t wonder. I often felt that way myself. When a man first falls into an offence his immediate instinct is to confess to somebody. That is true of all the world. In Burma at the beginning he used to confess to the Court. He was sorry for his offence, he wanted to make the best of it, wanted help to reform. He wanted understanding. He thought the Court wanted to know the truth and he would do all he could to help. But he very soon found the uselessness of this. He got no understanding, no sympathy, only conviction and a vindictive punishment. Naturally he reflected, and pleaders and people who knew the Courts helped him to reflect. \"Fight it out. At worst you can but lose and be no worse off than if you confessed. Why tell the truth? No one expects you to. If you have confessed withdraw your confession. Say you were tortured. A trial is a fight, with the judge as umpire. Do your best. Remember that, even if your offence be a very small one, if it is a cognisable offence you will be ruined for life if convicted.\" That is the advice he gets. Who will doubt but that, our Courts being what they are, it is sound as a rule? So, because it is a fight he won\u0027t confess; he plays for the big stake—acquittal; and sometimes this acts disastrously too. I will tell a case in point—one I tried myself. A man was accused of maiming a bullock. It had trespassed into his Indian-corn field, and had been found there afterwards hamstrung, and had to be destroyed. It was proved that accused was in the field when the bullock wandered in. It was also proved that accused\u0027s chopper was found close to the maimed bullock, covered with blood. Accused had run away and had only been arrested some days later. Now the malicious maiming of a valuable bullock is a serious offence. Its seriousness partly depends on the value of the animal. The case was quite clearly proved though no one actually saw the offence committed. The defence of the accused was a futile alibi. He had a pleader who arranged this. The evidence for the prosecution seemed quite clear, and I did not see how I could avoid convicting the man of the grave offence. Yet somehow I was not quite happy in my mind. I believed the prosecution was substantially true, but that they had been piling it on a good deal. So before adjourning the case till next day to give me time to write the judgment, I said to the accused: \"I don\u0027t believe your alibi. You can see for yourself it has no sense. But maybe if you told me your side of the story it might not look so bad for you as it does now.\" He looked at me, hesitated, looked at his pleader, then all of a sudden he did bring the whole story out. And as he told it, though it did not in any way invalidate the evidence for the prosecution, it did put the matter in quite a new light. In the first place, the cattle, of which the bullock was one, had been wilfully driven into his field to annoy him and cause him loss. In the second place, he had not deliberately cut the bullock; when he saw the cattle coming through the six-foot-high corn towards him he had in a passion thrown his chopper at the dimly seen moving mass of cattle. Then he had dodged out of their way. When he found afterwards what damage he had done he ran away in a fright. I found there was evidence to support what he said—for instance, he had gone straight home and told his father before he ran away—so he got off with a small fine. He might have got two years. But unless he had confessed I could never have guessed that there was quite another version of the facts. Now I have often suspected this state of affairs. The substance of the prosecution is clear, but there might be extenuating circumstances. The accused however fights it to the last and will admit nothing. On the evidence I could but take a gloomy view; for, remember, all cases are subject to revision by the High Court, who simply read through the written evidence and are not able to appreciate the subtle effect of tone and manner in witnesses, which tell more sometimes than their words. I have said that the people have no respect for the Courts because they have lost all respect for the magistrate or judge. In himself he may be worthy of all confidence; but when on the bench he is not himself, he is a mouthpiece of the law, or an umpire; he is not a living force. When you lie in Court you do not deceive a human being who is doing his best for you and others; you only try to counterbalance the injustice of the law by a little judicious weighting of the scales. A man who will tell you the truth as individual to individual will commit perjury before you in Courts and think nothing of it. In fact, he lies at the other side, and doesn\u0027t consider you at all. He does it to try to get justice, or what he thinks is justice, in place of law, which otherwise is all he would get. I have often been told this, and I notice the same in England. Truth is a relationship of persons; in a Court now the only persons are the two opponents; the judge is only a sort of machine to weigh evidence. As man to man I have found Orientals as truthful as Englishmen. In twenty-six years\u0027 experience I do not remember ever having been told a deliberate lie as man to man. But in the Courts you are not a man, you are an official, and even as an official your hands are tied. The parties have no direct relationship with you. Their relationship is with each other—just as in a duel or a prize-fight the relationship is between party and party, and the umpire is only the onlooker, who may or may not see most of the game. In law he usually sees less because Justice is blind. I am aware that the bandage over the eyes of Justice is supposed to render her just, not discriminating between rich and poor; it does the reverse, of course. And until Justice opens her eyes again to discriminate what is put into her scales she will remain the mock she now is. In a previous book I have discussed the question of veracity in this connection, and lest anyone should object that what I say is true only of the Burmese I will add this story, which is of a well-known official in the North-West in his younger days. He was inquiring into a Revenue case, and incidentally an Indian gentleman gave him certain information. The official thought this so important that he summoned the Indian to Court, where, much to the Englishman\u0027s surprise, the Indian as a witness gave a totally different story. They met again, however, later, and the official asked the Indian gentleman what he meant by going back on his words like that. The latter smiled, hesitated, and then the wisdom of experience spoke to the altruism of ignorance in these words: \"Sahib,\" he said, \"you are very young.\" How the Courts are generally regarded by the people can best be illustrated by giving an account of a dramatic entertainment I witnessed once. The Burmese are fond of the drama. They have old dramas, and they have new dramas up to date—satires for the most part. The play I saw was of the latter. The company was a well-known one, which had toured almost all the province, and its most famous piece was that I witnessed—I forget the name. The scene was supposed to be the office of a lawyer, barrister, or advocate, and there was a native clerk. To him entered a would-be litigant. The clerk listens to him for a few minutes and then asks him if he has brought any money. The client says \"No.\" The clerk rises in indignation and the client is hustled out. He returns with a bag of money. The clerk then listens and the client explains his case. The clerk demands if there is any evidence. The client is puzzled and asks what evidence is required. The clerk then tells him slowly and distinctly: you must have a man to swear to this, another to swear to that, a third to swear to something else. The client remonstrates, saying he doubts if he can get so much evidence. The clerk then tells him that if he cannot get the evidence demanded his master will not take up his case. \"But,\" says the client indignantly, \"it is a true case.\" \"What does that matter?\" asks the clerk cynically. \"No Court cares—or can tell if it did care—whether your case is true or not. It can only tell if you have evidence or not. If you can\u0027t get the evidence your case may be the truest in the world, but that won\u0027t help you.\" The client then wants his money back, but the clerk clings to the bag and the client is again thrown out. The play was a long one, and I can only give a résumé of parts of it. The client goes looking for witnesses in the village. He gets hold of one man and says: \"Come and give evidence.\" \"But I saw nothing,\" says the villager. \"And,\" says the client indignantly, \"would you let me, an old friend, lose what you know is a right cause just because you didn\u0027t happen to see a trifle like that? What does it matter if you didn\u0027t actually see it? It did happen. I am not asking you to tell a lie or invent anything.\" So he gets his witnesses and takes them to the clerk. The clerk takes down their statements. The last scene is in Court, and the client\u0027s advocate appears to plead for him. He does so with a tongue two feet in length. But still he loses his case, for the advocate on the other side has a tongue three feet long. That this play was the success it proved to be shows clearly that the audience saw nothing unnatural in it. In fact, they relished it immensely. The magistrate was a stuffed figure.","sourceLink":"http://novel.tingroom.com/duanpian/2705/74371.html","bookId":1443,"book":{"id":1443,"title":"The Passing of Empire","description":"简介： Most people when they talk of India, most books when they treat of India, are concerned with its differences from the rest of the world. It is the appearance and the dress of its peoples, their customs and habits, their superstitions and religions, t...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2705","creation":"Aug 1, 2019 12:25:06 AM","modification":"Aug 1, 2019 12:25:06 AM"}}
