{"id":64421,"no":34,"title":"Page 34","content":"\"Violence draws them. I had some drawn to me that way, but they were never the sort of woman I cared for.\" He thought about that for a moment. Then he said, \"If he had a son, he\u0027d have no love for me.\"\\n\\n \"When did Paddy die?\"\\n\\n \"Ah, Jesus, it\u0027s hard to remember. I can\u0027t be sure of the year. \u0027Twas after Kennedy was shot, I remember that much. But not long after. The following year, I\u0027d say.\"\\n\\n \"1964.\"\\n\\n \"\u0027Twas in the summer.\"\\n\\n \"Thirty-three years ago.\"\\n\\n \"Ah, you\u0027ve a great head for mathematics.\"\\n\\n \"That would fit, you know. The man I saw was somewhere in his thirties.\"\\n\\n \"There was never any talk of Paddy having a son.\"\\n\\n \"Maybe she kept it quiet, whoever she was.\"\\n\\n \"And told the boy.\"\\n\\n \"Told the boy who his father was. And maybe told him who killed him.\"\\n\\n \"So that he grew up hating me. Well, don\u0027t they grow up in Belfast hating the English? And don\u0027t the Proddy kids grow up hating the Holy Father? \u0027Fuck the Queen!\u0027 \u0027Nah, nah, fuck the Pope!\u0027 Fuck \u0027em both, I say, or let \u0027em fuck each other.\" He drew out his pocket flask and sweetened his coffee. \"They grow into good haters if you teach them early enough. But where the hell has he been all these years? He\u0027s spit and image of his father. If I\u0027d ever laid eyes on him I\u0027d have known him in an instant.\"\\n\\n \"I saw how you reacted to the sketch.\"\\n\\n \"I knew him at a glance, and I\u0027d have known him as quick in the flesh. Anyone who knew the father would recognize the son.\"\\n\\n \"Maybe he grew up outside of the city.\"\\n\\n \"And nursed his hatred all these years? Why would he leave it so long?\"\\n\\n \"I don\u0027t know.\"\\n\\n \"I could imagine him coming for me in his young manhood,\" he said. \"\u0027When boyhood\u0027s fire was in my blood\u0027- you know that song?\"\\n\\n \"It sounds familiar.\"\\n\\n \"That\u0027s when you\u0027d think he\u0027d have done it, when boyhood\u0027s fire was in his blood. But he\u0027s well past thirty, he\u0027d have to be, and boyhood\u0027s fire is nothing but dying embers. Where the hell\u0027s he been?\"\\n\\n \"I\u0027ve some ideas.\"\\n\\n \"Have you really?\"\\n\\n \"A few,\" I said. \"I\u0027ll see where I can get with it tomorrow.\" I looked at my watch. \"Well, later today.\"\\n\\n \"Detective work, is it?\"\\n\\n \"Of a sort,\" I said. \"It\u0027s a lot like searching a coal mine for a black cat that isn\u0027t there. But I can\u0027t think what else to do.\"\\n\\n I was home and in bed before sunrise, up and showered and shaved before noon. TJ had had a good night, and was sitting up in front of the television set, wearing navy blue chinos and a light blue denim shirt. He\u0027d told Elaine he had clean clothes in his room, but she\u0027d insisted on buying him an outfit at the Gap. \"Said she didn\u0027t want to invade my privacy,\" he said, rolling his eyes.\\n\\n I brought him up to speed and let him have another look at the man I\u0027d come to think of as Paddy Jr., whatever his name might turn out to be. I was hoping there was a computerized shortcut to the task at hand.\\n\\n \"The Kongs could probably do it,\" he said, \"if we knew where they at, an\u0027 if they still into that hackin\u0027 shit. An\u0027 if the records you talkin\u0027 about\u0027s computerized.\"\\n\\n \"They\u0027re city records,\" I said, \"and they\u0027re over thirty years old.\"\\n\\n \"Be the thing for them to do. Have some people sit down an\u0027 input all their files. Be a real space saver, \u0027cause you can fit a whole filing cabinet on a floppy.\"\\n\\n \"It sounds like too much to hope for,\" I said. \"But if Vital Statistics has all their old files on computer, I wouldn\u0027t even have to hack into their system. There\u0027s an easier way.\"\\n\\n \"Bribery?\"\\n\\n \"If you want to be a tightass about it,\" I said. \"I prefer to think of it as going out of your way to be nice to people, and having them be nice in return.\"\\n\\n The clerk I found was a motherly woman named Elinor Horvath. She was nice to begin with and got even nicer when I palmed her a couple of bills. If only the records in question had been in computerized files, she could have found them for me in nothing flat. As TJ had explained it to me, all she would have to do was sort each pertinent database by Name of Father. Then you could just shuffle through the F\u0027s and see exactly who had been sired by someone named Farrelly.\\n\\n \"All our new records are computerized,\" she told me, \"and we\u0027re working our way backward, but it\u0027s going very slowly. In fact it\u0027s not really going at all, not after the last round of budget cuts. I\u0027m afraid we\u0027re not a high-priority division, and the old records aren\u0027t high priority for us.\"\\n\\n That meant it had to be done the old-fashioned way, and it was going to require more time than Mrs. Horvath could possibly devote to it, no matter how nice a guy I was. The money I gave her got me ensconced in a back room where she brought me file drawers full of birth certificates filed in the City of New York starting January 1, 1957. I couldn\u0027t believe he was over forty, not from the glimpse I\u0027d had of him, nor could I imagine he\u0027d been more than seven years old when Paddy got the chop. According to what I knew about the father, by then the son would have had enough neglect or abuse or both to have been spared a passion for revenge.\\n\\n That gave me my starting date, and I\u0027d decided I\u0027d go all the way to June 30, 1965. The killing of Paddy Farrelly, which Mick recalled as having taken place during the summer, might have occurred as late as the end of September, and the darling boy himself might have been conceived that very day, for all I knew. It all seemed unlikely, but you could say that about the whole enterprise.\\n\\n It was slow work, and if you sped up out of boredom you ran the risk of missing what you were looking for. The records were in chronological order, and that was the sole organizational scheme. I had to scan each one, looking first at the child\u0027s name on the top line, then at the father\u0027s name about halfway down. I was looking for Farrelly in either place.\\n\\n I was fortunate, I suppose, in that it wasn\u0027t a common name. Had the putative father been, say, Robert Smith or William Wilson, I\u0027d have had a harder time of it. On the other hand, every time I hit some inapplicable Smith or Wilson I\u0027d have at least had the illusion that I was coming close. I didn\u0027t hit any Farrellys, neither father nor child, and that made me question what I was doing.\\n\\n It was mindless work. A retarded person could have performed it as well as I, and possibly better. My mind tended to wander, it almost had to, and that can lead to a sort of mental snow-blindedness, where you cease to see what you\u0027re looking at.\\n\\n One thing that struck me, wading through this sea of names, was the substantial proportion of children who had different last names from their fathers, or no father listed at all. I wondered what it meant when the mother left the line blank. Was she reluctant to put the man\u0027s name down? Or didn\u0027t she know which name to choose?\\n\\n I was close to losing heart, and then Mrs. Horvath turned up with a cup of coffee and a small plate of Nutter Butter cookies, and the next file drawer. She was out the door before I could thank her. I drank the coffee and ate the cookies, and an hour later I found what I was looking for.\\n\\n The child\u0027s name was Gary Allen Dowling, and he\u0027d been born at ten minutes after four in the morning on May 17, 1960, to Elizabeth Ann Dowling, of 1104 Valentine Avenue in the Bronx.\\n\\n The father\u0027s name was Patrick Farrelly. No middle name. Either he didn\u0027t have one or she didn\u0027t know it.\\n\\n In myths and fairy tales, just knowing an adversary\u0027s name is in itself empowering. Look at Rumpelstiltskin.\\n\\n So I felt I was getting somewhere when I hit the street with Gary Allen Dowling\u0027s birth certificate copied in my notebook, but all I really had was the first clue in a treasure hunt. I was better off than when I started, but I was a long way from home.\\n\\n I bought a Hagstrom map of the Bronx at a newsstand two blocks from the Municipal Building and studied it at a lunch counter over a cup of coffee, wishing I had a few more of those Nutter Butter cookies to go with it. I found Valentine Avenue, and it was up in the Fordham Road section, and not far from Bainbridge Avenue.\\n\\n I thought I might be able to save myself a trip, so I invested a quarter in a call to Andy Buckley. His mother answered and said he was out, and I thanked her and hung up without leaving a name. I was annoyed for a minute or two, because now I was stuck with a long subway ride and rush hour was already in its preliminary stages. But suppose he\u0027d been in? I could send him to Valentine Avenue, and he could establish in a few minutes what I was already reasonably certain of- i.e., that Elizabeth Ann Dowling no longer lived there, if in fact she ever had, and neither did her troublesome son. But he wouldn\u0027t ask the questions I would ask, wouldn\u0027t knock on doors and try to find someone with a long memory and a loose tongue.\\n\\n The house was still standing, as I thought it probably would be. This wasn\u0027t a part of the Bronx that had burned or been abandoned during the sixties and seventies, nor was it one where there\u0027d been a lot of tearing-down and rebuilding. 1107 Valentine turned out to be a narrow six-story apartment house with four apartments to the floor. The names on the mailboxes were mostly Irish, with a few Hispanic. I didn\u0027t see Dowling or Farrelly, and would have been astonished if I had.\\n\\n One of the ground-floor apartments housed the super, a Mrs. Carey. She had short iron-gray hair and clear unflinching blue eyes. 1 could read several things in them and cooperation wasn\u0027t one of them.\\n\\n \"I don\u0027t want to get off on the wrong foot with you,\" I said. \"So let me start by saying I\u0027m a private investigator. I\u0027ve got nothing to do with the INS and very little respect for them, and the only tenants of yours I\u0027m interested in lived here thirty-some years ago.\"\\n\\n \"Before my time,\" she said, \"but not by much. And you\u0027re right, INS was my first thought, and as little love as you may have for them I assure you it\u0027s more than my own. Who would it be you\u0027re asking after?\"\\n\\n \"Elizabeth Ann Dowling. And she may have used the name Farrelly.\"\\n\\n \"Betty Ann Dowling. She was still here when I came. Her and that brat of a boy, but don\u0027t ask me his name.\"\\n\\n \"Gary,\" I said.\\n\\n \"Was that it? My memory\u0027s not what it was, though why I should remember them at all I couldn\u0027t say.\"\\n\\n \"Do you remember when they left?\"\\n\\n \"Not offhand. I started here in the spring of 1968. God help us, that\u0027s almost thirty years.\"\\n\\n I said something about not knowing where the time goes. Wherever it went, she said, it took your whole life with it.\\n\\n \"But I raised a daughter,\" she said, \"on my own after my Joe died. I got the apartment and a little besides for managing this place, and I had the insurance money. And now she\u0027s living in a beautiful home in Yonkers and married to a man who makes good money, although I don\u0027t like the tone he takes with her. But that\u0027s none of my business.\" She collected herself, looked at me. \"And none of yours either, is it? Oh, come on in. You might as well have a cup of tea.\"\\n\\n Her apartment was clean and cheery and neat as a pin. No surprise there. Over tea she said, \"She was a widow too, to hear her tell it. I held my tongue, but I know she was never married. It\u0027s the sort of thing you can tell. And she had these fanciful stories about her husband. How he was with the CIA, and was killed because he was going to reveal the real story of what happened in Dallas. You know, when Kennedy was shot.\" \\n\\n","sourceLink":"https://allnovel.net/everybody-dies-matthew-scudder-14/page-34.html","bookId":2332,"book":{"id":2332,"title":"Everybody Dies (Matthew Scudder #14)","description":"Storyline: Everybody Dies (Matthew Scudder #14) \\n Matt Scudder is finally leading a comfortable life. The crime rate\u0027s down and the stock market\u0027s up. Gentrification\u0027s prettying-up the old neighborhood. The New York streets don\u0027t look so mean anymore. \\n Then all hell breaks loose. \\n Scudder quickly discovers the spruced-up sidewalks are as mean as ever, dark and gritty and stained with blood. He\u0027s living in a world where the past is a minefield, the present is a war zone, and the future\u0027s an open question. It\u0027s a world where nothing is certain and nobody\u0027s safe, a random universe where no one\u0027s survival can be taken for granted. Not even his own. \\n A world where everybody dies.\\n","cover":"https://allnovel.net/images/everybody-dies-matthew-scudder-14.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/everybody-dies-matthew-scudder-14.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:54:03 AM"}}
