{"id":64424,"no":37,"title":"Page 37","content":"\"A true son of the father, then. Say the mother\u0027s name again.\"\n \"Elizabeth Dowling.\"\n \"I\u0027ve known a share of Dowlings over the years, but I don\u0027t recall an Elizabeth.\"\n \"The woman in the Bronx called her Betty Ann. She was living there when the baby was born, and she may have been living there or nearby all along.\"\n \"I wonder how Paddy met her. It could have been at a dance. That was how you used to meet Irish girls, at a dance on a Saturday night.\" He had a faraway look in his eye. \"I never knew her, and I doubt she ever knew me. But she must have known of me, and known it was myself put Paddy out of her life and his own. If the cow\u0027d had any sense she\u0027d have thanked God for the favor I did her. Instead she made a hero out of him and a villain out of me, and brought the boy up to kill me.\"\n \"I guess he always liked killing,\" I said. \"He had no practical reason to kill those people in the store. All that did was turn up the heat. It pretty much guaranteed he\u0027d get caught and do substantial time. He killed them because he wanted to.\"\n \"The same with Kenny and McCartney.\"\n \"And the same when the Vietnamese he met in prison sprayed bullets all over your bar, and his other prison buddy tossed a bomb. Moon\u0027s name is Virgil Gafter, incidentally, suspected of a couple of felony-related homicides, but it was an assault charge that put him in Attica.\"\n \"You learned a lot in that prison.\"\n \"Everybody does,\" I said. \"Some of them learn to live within the laws, and the rest learn to be better at breaking them.\"\n \"I think the cops know Chilton Purvis did the shooting at the Chinese restaurant,\" I said. \"They\u0027d have found out the same way I did. Word got around, and somebody with a badge heard it from one of his snitches. And I think they went looking for Purvis and found him dead in his room on Tapscott Street, unless he\u0027d already been picked up and they found him in the morgue.\"\n \"And that\u0027s why they came looking for you?\"\n \"That\u0027s why,\" I said. \"If they don\u0027t know Purvis was the shooter, his death is just another homicide, presumably black-on-black, presumably drug related. Two men shoot each other and one walks away from it. But now they\u0027ve got someone with a motive to kill Purvis.\"\n \"Namely yourself.\"\n \"They also found a blood trail,\" I said, \"so the reasoning would be that Purvis and I shot each other and I fled the scene. I\u0027ll bet they checked hospitals, and I\u0027ll bet when Wister showed up with his warrant he expected to find me in bed and bandaged up. Failing that, he\u0027d have liked to find a.38 that would match the bullets they dug out of Purvis.\"\n \"What happens when they catch up with you?\"\n \"I can\u0027t worry about that now. The funny thing is the blood might clear me. Because I didn\u0027t get so much as a scratch when Purvis and I traded shots, and there\u0027s no way they\u0027ll get a DNA match between my blood and TJ\u0027s. If they try to match the blood to him, well, that\u0027s a different story, but they\u0027d have to think of it, and I\u0027m not sure they will.\"\n \"I gather we\u0027re going to the Bronx.\"\n \"That\u0027s less remarkable than some of your feats of detection,\" he said, \"as we\u0027re nearly there.\"\n \"Where are we going?\"\n \"Perry Avenue.\"\n \"Where Tom lives.\"\n He nodded. \"You\u0027ll remember we dropped him there, after the trouble at Grogan\u0027s.\"\n Trouble in the Irish sense. In America, trouble is something a kid has learning algebra. In Ireland it can be a bit more dramatic.\n I said, \"Because you couldn\u0027t reach him on the phone?\"\n \"He\u0027s a lodger in an old woman\u0027s house. Has a room and kitchen privileges, and can watch television in the parlor of an evening. Takes his meals there, breakfast and dinner, if he\u0027s there to eat them.\"\n \"So?\"\n \"The phone is hers,\" he said, \"and she\u0027s always home to answer it. And today it rang unanswered every time I called.\"\n \"She couldn\u0027t have stepped out?\"\n \"She never does. She has the arthritis, and it\u0027s a bad case of it. It keeps her at home.\"\n \"And when she needs something from the market…\"\n \"She calls the corner store and they deliver. Or Tom goes for her.\"\n \"There\u0027s probably an explanation.\"\n \"I fear there is,\" he said, \"and I fear I know what it is.\"\n I didn\u0027t say anything. He stopped for a red light, looked both ways, and drove on through it. I tried not to imagine what might happen if a cop pulled us over.\n He said, \"I\u0027ve a feeling.\"\n \"I gathered as much.\"\n \"I\u0027ve surely told you what my mother said.\"\n \"That you\u0027ve got a sixth sense.\"\n \"Second sight is what she called it, but I\u0027d say it amounts to the same thing, a sixth sense or the second sight. \u0027Twas herself I got it from. When my brother Dennis went to Vietnam, we both knew we\u0027d seen him alive for the last time.\"\n \"And that\u0027s the second sight?\"\n \"I hadn\u0027t finished.\"\n \"I\u0027m sorry.\"\n \"One day she calls me over. Mickey, says she, I saw your baby brother last night, and all robed in white he was. And I turned white myself, for hadn\u0027t I heard Dennis\u0027s voice in my ear that morning. I\u0027m all right, Mickey, says he. You needn\u0027t worry about me, says he. And not that day but the day after she got the telegram.\"\n I felt a chill. I get hunches and feelings, and I\u0027ve learned to trust them in my work, though I don\u0027t let them keep me from getting out and knocking on doors. I believe in intuition, and in ways of knowing the mind knows nothing of. Still, stories like that give me a chill.\n \"I had a feeling before I called his house. Before the first time that it rang and went unanswered.\"\n \"And I gather the feeling persisted.\"\n \"It did.\"\n \"But you waited until you reached me before heading up here.\"\n \"You or Andy. You were the first I reached. But you\u0027d be wondering why I didn\u0027t go on my own.\" He was silent for a moment. \"It\u0027s an answer does me no credit,\" he said. \"It\u0027s for fear of what I might find, of what I know I\u0027ll find. I don\u0027t want to come upon it alone.\"\n \"You\u0027ve got your gun?\"\n \"You gave me two,\" I said, \"and I\u0027ve got them both.\"\n \"Good job she hid the one where the cops wouldn\u0027t find it. In the basement, was it?\"\n \"In our storage bin down there. Even if they\u0027d known it existed, I don\u0027t think their warrant would have covered it.\"\n \"Ah, she\u0027s a smart one,\" he said. \"That was quick thinking.\"\n \"You don\u0027t know the half of it,\" I said, and told him about her trick with *69.\n \"So that\u0027s why she took the phone off the hook. And he left you a message? Was it Paddy\u0027s boy himself?\"\n \"I don\u0027t think so. The voice sounded familiar, and I think it was the fellow I took the gun away from. Donnie Scalzo, that would be.\"\n \"From Bensonhurst, wasn\u0027t it? Another nationality heard from.\"\n \"But I may have heard Dowling\u0027s voice,\" I said, and told him of the last phone call before I left the apartment, with a soft voice saying hello, and then telling someone else that there was no one there.\n \"You wouldn\u0027t think he\u0027d have a soft voice.\"\n \"You wouldn\u0027t. And his voice seemed familiar to me, and I don\u0027t know why it would.\"\n \"When would you have heard him before?\"\n \"I don\u0027t think I ever did, and I wish this voice had had more to say, because there was something familiar about it and I can\u0027t say what or why. Unless it was just that it sounded Irish.\"\n \"Irish,\" he said.\n \"There was a hint of brogue.\"\n \"Well, Farrelly and Dowling, that\u0027s Irish on both sides. You could say he came by it honestly. Paddy had nothing you\u0027d call a brogue. I\u0027ve the Irish way of talking, but that\u0027s my mother\u0027s doing. Some lose it and some don\u0027t, and I never did.\" His eyes narrowed. \"A hint of brogue. A familiar voice, a hint of brogue.\"\n \"I\u0027ll trace the call tomorrow,\" I said, \"and clear up some of the mystery.\"\n The house on Perry Avenue was self-standing, a little two-story box on a small lot. The lawn in front was brown in spots, but neatly mowed. I suppose a neighborhood kid took care of it for the old woman, or maybe Tom ran a mower over it once or twice a week. It wouldn\u0027t take him long. Then he\u0027d go in and have a beer, and she\u0027d thank him for doing such a nice job.\n We parked two doors away, right next to a fire hydrant. I pointed it out, and Mick said nobody\u0027d be around to ticket us at that hour, much less to tow the car. And we wouldn\u0027t be on the premises for long, anyway.\n Nor were we. We went up the walk to the front door and knocked and rang the bell. The door was wood, set with a window divided into four mullioned panes, and he didn\u0027t wait long at all before drawing the gun from his belt and using the butt of it to break out one of the panes. He reached through the opening, turned the knob, and let us in.\n I\u0027d smelled death through the broken window and walked in the door to see it close up. The old woman, her gray hair thinning and her legs hugely swollen, sat in her wheelchair in the front room, her head hanging to one side, her throat cut. The whole front of her was soaked with her blood, and there were flies buzzing in it.\n Mick let out an awful groan at the sight of her, and crossed himself. I hadn\u0027t seen him do that before.\n We found Tom Heaney in the kitchen, lying on the floor, with gunshot wounds in the chest and temple. There was a heel mark on his face, as if he\u0027d been kicked or stepped on. His eyes were wide open.\n So was the refrigerator door. I could picture Tom standing at the open refrigerator, helping himself to a beer or the makings of a sandwich. Or maybe the hard work of murder had built an appetite in one of the killers, and he\u0027d stopped for a snack on the way out.\n Mick bent over and closed Tom\u0027s eyes. He straightened up and closed his own for a moment. Then he nodded shortly to me and we got out of there.\n \"Ah, \u0027tis I again, Mrs. Buckley, disturbing you one more time. Has he returned yet, do you know? Ah, that\u0027s good.\" He covered the cell phone mouthpiece with his hand. \"She\u0027s getting him,\" he said.\n We were in the car, parked on the opposite side of Bainbridge Avenue from the Buckley house. We\u0027d taken a roundabout route to get here, with Mick turning up one street and down another almost at random, the big Caprice making its way through the Bronx like an elephant lumbering through high grass. Neither of us talked while he drove, and the silence was heavy in the roomy old car, heavy and thick. There\u0027d been too many deaths and it felt as though they were in there with us, all those mean acts of murder, the bodies heaped in the back seat, the souls displacing the air itself.\n Now he said, \"Andy, good man. Your own car\u0027s right across the street from you and us inside it waiting for you.\"\n He folded the phone, put it back in his pocket. \"He\u0027ll be a minute,\" he said. \"It\u0027s a relief to find him at home.\"\n \"Yes.\"\n \"I\u0027ll tell you,\" he said, \"it was relief enough when she answered. His mother. Now that the bastards are after killing old ladies.\"\n I watched the door across the street, and in a matter of minutes Andy came through it, wearing a plaid shirt and blue jeans with the cuffs folded up and carrying his leather jacket. At the curb he stopped long enough to put the jacket on, then trotted on across the street. Mick got out and Andy sat behind the wheel. I got out as well and sat in back, and Mick walked around the car and got in front next to Andy. \n","sourceLink":"https://allnovel.net/everybody-dies-matthew-scudder-14/page-37.html","bookId":2332,"book":{"id":2332,"title":"Everybody Dies (Matthew Scudder #14)","description":"Storyline: \n Everybody Dies (Matthew Scudder #14) \n Matt Scudder is finally leading a comfortable life. The crime rate\u0027s down and the stock market\u0027s up. Gentrification\u0027s prettying-up the old neighborhood. The New York streets don\u0027t look so mean anymore. \n Then all hell breaks loose. \n Scudder quickly discovers the spruced-up sidewalks are as mean as ever, dark and gritty and stained with blood. He\u0027s living in a world where the past is a minefield, the present is a war zone, and the future\u0027s an open question. It\u0027s a world where nothing is certain and nobody\u0027s safe, a random universe where no one\u0027s survival can be taken for granted. Not even his own. \n A world where everybody dies.\n \n","cover":"https://allnovel.net/images/everybody-dies-matthew-scudder-14.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/everybody-dies-matthew-scudder-14.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:54:03 AM"}}
