{"id":64432,"no":45,"title":"Page 45","content":"\"Not long.\"\\n\\n \"And they might keep it for a good long while, especially if we took care to leave it with a full tank of gas. Of course if they had a flat tire, and went looking for the spare…\"\\n\\n \"God, what a thought.\"\\n\\n \"Ah, it\u0027s a hard old world if you can\u0027t laugh, and even if you can. Do you know what I think I\u0027ll do? I\u0027ll wipe the fucker free of prints, as it\u0027s full of mine after all the use I\u0027ve given it this past week. And then I\u0027ll take it over to the piers and run it into the river, with the windows rolled down so it\u0027ll sink and stay sunk. Can they get fingerprints off a car hauled out of the water?\"\\n\\n \"There was a time when they couldn\u0027t,\" I said, \"but they probably can by now. I think they can just about lift them off motes of dust dancing in a beam of light.\"\\n\\n \"I\u0027ll wipe it good,\" he said, \"before I shove it off the edge. Just to be sure.\"\\n\\n After a moment I said, \"What\u0027ll you tell his mother?\"\\n\\n \"That he had to go away,\" he said without hesitation, \"on a dangerous mission, and that it might be awhile before she heard from him. That should hold her for the few years she\u0027s got left in the world. She has cancer, you know.\"\\n\\n \"I didn\u0027t.\"\\n\\n \"Poor thing. I\u0027ll pray for her, and him too, once they\u0027ve taught me how.\"\\n\\n \"Pray for all of us,\" I said.\\n\\n I rode up in the elevator, used my key in the lock. By the time I had the door open she was standing in front of me, wearing a black robe I\u0027d bought for her. It had white and yellow flowers on it, and tiny butterflies.\\n\\n \"You\u0027re all right,\" she said. \"Thank God.\"\\n\\n \"I\u0027m fine.\"\\n\\n \"TJ\u0027s sleeping on the couch,\" she said. \"I was going to bring dinner over to him but he insisted he could come over for it, and then I wouldn\u0027t let him go home. I was afraid, but I don\u0027t know who I was afraid for, him or me.\"\\n\\n \"Either way, you\u0027re both all right.\"\\n\\n \"And you\u0027re all right, and thank God. It\u0027s over, isn\u0027t it?\"\\n\\n \"Yes, it\u0027s over.\"\\n\\n \"Thank God. And what about Mick? Is Mick all right?\"\\n\\n \"He had a premonition,\" I said, \"and that\u0027s a story in itself, but it turns out he\u0027s got a touch of astigmatism in his third eye, because he\u0027s fine. In fact you could say he\u0027s never been better.\"\\n\\n \"And everybody else?\"\\n\\n I said, \"Everybody else? Everybody else is dead.\"\\n\\n \"I\u0027ll remind you,\" Ray Gruliow said, \"that Mr. Scudder is here of his own volition, and that he\u0027ll answer only those questions I\u0027m willing for him to answer.\"\\n\\n \"Which means he won\u0027t say a goddamn thing,\" George Wister said.\\n\\n And that turned out to be pretty close to the truth. There were half a dozen cops in the room, Joe Durkin and George Wister and two guys from Brooklyn Homicide and two others whose function was never explained to me. I didn\u0027t much care who they were, because all they could do was sit there while I said essentially nothing.\\n\\n They had no end of questions, though. They wanted to know what I knew about Chilton Purvis, whom they\u0027d linked to the murder of Jim Faber as a result of information received, which meant that somebody\u0027s snitch had indeed come up with the news. They didn\u0027t have any evidence to support the snitch\u0027s word, however, and so far they hadn\u0027t been able to find an eyewitness to the Lucky Panda shooting who would look at Purvis\u0027s body and ID him as the shooter.\\n\\n I couldn\u0027t help them out. Anyway, I figured it was their own fault. If they\u0027d coached their witness properly he\u0027d have given them what they wanted.\\n\\n Maybe one or both of the unidentified men in the room were from the Bronx, because there were questions about Tom Heaney and Mary Eileen Rafferty, which turned out to be the name of Tom\u0027s landlady. Tom, I learned, had been shot with bullets from two different guns, and none of the slugs matched any of the bullets retrieved in any of the other homicides in question, although one matched up to a bullet dug out of a corpse in SoHo in 1995. Since most of the players had spent that year in Attica, I figured the gun had some old history attached to it.\\n\\n All in all, I didn\u0027t really give them anything, and I didn\u0027t pay close attention, either. I just sat there and watched Ray, and I didn\u0027t open my mouth unless he gave me a nod. And he didn\u0027t do that very often.\\n\\n I suppose we were there for about an hour, and then Wister lost it a little and said something nasty, and Ray had been waiting for that. \"That\u0027s it,\" he said, getting to his feet \"We\u0027re out of here.\"\\n\\n \"You can\u0027t do that,\" Joe said.\\n\\n \"Oh, really? Just watch us.\"\\n\\n \"And kiss your license goodbye,\" Wister said. \"I got papers on my desk, formal request for the state to pull your ticket, with all the reasons laid out to make it real easy for them. You walk out of here and I fill out the rest of it and toss it right in the mail.\"\\n\\n \"And there\u0027ll be a hearing,\" Ray said, \"and you\u0027ll be subpoenaed, which I know you fellows just love. And by the time the dust settles he\u0027ll have his license back, along with a whole lot of newspaper coverage to make him look like a hero.\"\\n\\n \"He won\u0027t look like a hero,\" Joe said. \"He\u0027ll look like a fucking criminal is all he\u0027ll look like. Which more and more is what he\u0027s been looking like anyway.\"\\n\\n \"That\u0027s enough,\" Ray said.\\n\\n \"No it\u0027s not, it\u0027s nowhere near enough. Matt, what the hell\u0027s the matter with you? You\u0027ll lose your license.\"\\n\\n I said, \"You know something? I don\u0027t care if I do.\"\\n\\n \"Don\u0027t say another word,\" Ray said.\\n\\n \"No,\" I said, \"I\u0027ll say this much, and I\u0027m saying it to you as much as to them. They can do what they want, and if the state rescinds my license that\u0027s fine. You could fight it, and maybe we\u0027d win, but it\u0027s not worth the bother.\"\\n\\n \"You don\u0027t know what you\u0027re talking about,\" Joe said.\\n\\n \"I know I got along fine without a license for over twenty years,\" I said. \"I don\u0027t know what the hell made me ever think I needed it. Maybe I make a few more dollars with it than without it, but I always made enough. I never missed a meal, and back when I drank I never lacked the price of the next drink. You want to pull my license? Go right ahead. What the hell do I care?\"\\n\\n We walked out of the station house and down the steps, and when we were out of earshot Ray said, \"They\u0027ll get your license pulled, and I\u0027ll get it back. Not a problem.\"\\n\\n \"No,\" I said. \"Thanks, but I wasn\u0027t just sounding off. I mean what I said. We\u0027ll let it go, and the hell with it.\"\\n\\n \"You never needed it in the first place,\" Elaine assured me. \"What, so you can work for a few more lawyers? And they can bill a little higher for your services? The hell with that.\"\\n\\n \"Exactly my point.\"\\n\\n \"Besides,\" she said, \"we know the real reason you got the license. You wanted to be respectable. And it\u0027s like all those folks on the Yellow Brick Road, baby. You were respectable all along.\"\\n\\n \"No,\" I said. \"I wasn\u0027t, and I\u0027m still not. But the license didn\u0027t change anything.\"\\n\\n And that would be a good place to leave it, except there\u0027s a little more to the story. Like everything else, it\u0027s not over till it\u0027s over.\\n\\n That was in September, and in mid-December we got a Christmas card with a return address on Staten Island. It said Season\u0027s Greetings instead of Merry Christmas, no doubt in deference to the Jewish vegetarian he\u0027d once given a ham to, and inside, beneath an unexceptionable printed message, he\u0027d written God\u0027s love to you both and signed it Mick.\\n\\n Elaine said she was sure he\u0027d sign it Fr. Michael F. Ballou, S. J. I said he was with the Thessalonians, not the Jesuits, and she said goyim is goyim.\\n\\n Then in late April TJ mentioned that he\u0027d passed Grogan\u0027s and had seen a Dumpster at the curb and a construction crew hard at work. I said evidently there\u0027d be a Korean greengrocer in there before long.\\n\\n And then a week later the phone rang, and Elaine answered it and came to tell me I\u0027d never guess who it was.\\n\\n \"I bet it\u0027s Father Mick,\" I said.\\n\\n \"Ah, Jaysus,\" she said, \"and get along with ye, and haven\u0027t the wee folk gifted ye with the second sight your own self?\"\\n\\n \"Begorrah,\" I said.\\n\\n I picked up the phone and he invited me to come down and see how the work was progressing. \"Of course it\u0027s impossible to get it so it looks old,\" he said, \"and there are bullet holes they want to cover up, and they ought to be left as they are. There\u0027s history to them.\"\\n\\n I went over there, and for all of that they seemed to be doing a good job, and getting it more right than not. I said I gathered this meant he was back in business.\\n\\n \"I am,\" he said.\\n\\n \"You said you\u0027d stay there until they kicked you out.\"\\n\\n \"Ah. Well, they didn\u0027t do that. They\u0027d never do that.\" He took a drink from his silver flask. \"They\u0027re lovely men,\" he said. \"The nicest men I\u0027ve ever met in my life. And they were so good as to let me take my time to realize for myself that I didn\u0027t belong there. I half wish I did, but I don\u0027t, and they allowed me to see as much.\"\\n\\n \"And here you are.\"\\n\\n \"And here I am,\" he agreed. \"And glad to be back, and are you glad to have me?\"\\n\\n \"Damn glad,\" I said, \"and so\u0027s Elaine. We missed you.\"\\n\\n His story, as I said early on, his story far more than mine. But how could you ever get him to tell it? \\n\\n","sourceLink":"https://allnovel.net/everybody-dies-matthew-scudder-14/page-45.html","bookId":2332,"book":{"id":2332,"title":"Everybody Dies (Matthew Scudder #14)","description":"Storyline: Everybody Dies (Matthew Scudder #14) \\n Matt Scudder is finally leading a comfortable life. The crime rate\u0027s down and the stock market\u0027s up. Gentrification\u0027s prettying-up the old neighborhood. The New York streets don\u0027t look so mean anymore. \\n Then all hell breaks loose. \\n Scudder quickly discovers the spruced-up sidewalks are as mean as ever, dark and gritty and stained with blood. He\u0027s living in a world where the past is a minefield, the present is a war zone, and the future\u0027s an open question. It\u0027s a world where nothing is certain and nobody\u0027s safe, a random universe where no one\u0027s survival can be taken for granted. Not even his own. \\n A world where everybody dies.\\n","cover":"https://allnovel.net/images/everybody-dies-matthew-scudder-14.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/everybody-dies-matthew-scudder-14.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:54:03 AM"}}
