{"id":64392,"no":5,"title":"Page 5","content":"I did the math. \"Ten thousand dollars,\" I said, \"in round numbers. That\u0027s enough to make it worth stealing.\"\n \"Indeed it is. Why do you think we stole it in the first place? Though we didn\u0027t feel the need to kill anyone.\"\n \"If it wasn\u0027t somebody who just happened to be there,\" I went on, \"then either somebody followed McCartney and Kenny or else they had the place staked out and waited for somebody to come and open up. But what sense does that make?\"\n There was an opened bottle of whiskey on his desk. He uncapped it, looked around for a glass, then took a short drink straight from the bottle.\n \"I need to know,\" he said.\n \"And you want me to find out for you.\"\n \"I do. It\u0027s your line of work, and I\u0027d be entirely useless at it myself.\"\n \"So it would be up to me to learn what happened, and who was responsible.\"\n \"It would.\"\n \"And then I would turn the information over to you.\"\n \"What are you getting at, man?\"\n \"Well, I\u0027d be delivering a death sentence, wouldn\u0027t I?\"\n \"Ah,\" he said.\n \"Unless you\u0027re planning on bringing the police into it.\"\n \"No,\" he said. \"No, I wouldn\u0027t regard it as a police matter.\"\n \"I didn\u0027t think so.\"\n He put a hand on the bottle but left it where it stood. He said, \"You saw what they did to those two lads. Not just the bullets but a beating as well. It\u0027s no more than justice for them to pay for it.\"\n \"Rough justice, when you mete it out yourself.\"\n \"And isn\u0027t most justice rough justice?\"\n I wondered if I believed that. I said, \"My problem\u0027s not in the action you take. My problem\u0027s being a part of it.\"\n \"Ah,\" he said. \"I can understand that.\"\n \"What you do is up to you,\" I said, \"and I\u0027d be hard put to recommend an alternative. You can\u0027t go to the cops, and it\u0027s late in life for you to start turning the other cheek.\"\n \"It would go against the grain,\" he allowed.\n \"And sometimes a person can\u0027t turn the other cheek,\" I said, \"or walk away and leave it to the cops. I\u0027ve been there myself.\"\n \"I know you have.\"\n \"And I\u0027m not sure I chose the right course, but I seem to have been able to live with it. So I can\u0027t tell you not to pick up a gun, not when I might do the same thing myself in your position. But it\u0027s your position, not mine, and I don\u0027t want to be the one who points the gun for you.\"\n He thought that over, nodded slowly. \"I can see the sense in that,\" he said.\n \"Your friendship is important to me,\" I said, \"and I\u0027d bend what principles I have for the sake of it. But I don\u0027t think this situation calls for it.\"\n His hand found the bottle again, and this time he drank from it. He said, \"Something you said, that it might have been men acting on impulse. Lads with a storage bin of their own, seeing a chance for a fast dollar.\"\n \"It\u0027s certainly a possibility.\"\n \"Suppose you were to look into that side of it,\" he said evenly. \"Suppose you did what you do, asked your questions and made your notes, and learned enough to rule that possibility in or out.\"\n \"I don\u0027t understand.\"\n He went over to the wall and leaned against it, looking at one of the hand-colored steel engravings mounted there. He has two groups of them, three scenes of County Mayo in Ireland, where his mother was born, and three others showing his father\u0027s birthplace in the south of France. I don\u0027t know which ancestral home he was looking at now, and I doubt he was seeing it.\n Without turning around he said, \"I believe I have an enemy.\"\n \"An enemy?\"\n \"The same. And I don\u0027t know who he is or what he wants.\"\n \"And you think this was his doing.\"\n \"I do. I believe he followed those boys to the storage shed, or got there first and lay in wait for them. I believe the whiskey he stole was the least of it. I believe he was more intent on shedding blood than in stealing ten thousand dollars\u0027 worth of stolen whiskey.\"\n \"There have been other incidents,\" I guessed.\n \"There have,\" he said, \"unless it\u0027s my imagination. It could be I\u0027ve turned into an old maid, checking the cupboards, looking under the bed. Perhaps that\u0027s all it is. That, or else I\u0027ve an enemy and a spy.\"\n I have a license now, issued by the State of New York. I got it awhile ago when one of my lawyer clients told me, not for the first time, that he\u0027d be able to give me more work if I were licensed. I\u0027ve worked a lot for lawyers lately, and more than ever since I picked up the license.\n But I haven\u0027t always had a license, and I haven\u0027t worked exclusively for members of the legal profession. I had a pimp for a client once. Another time, I worked for a drug trafficker.\n If I could work for them, why couldn\u0027t I work for Ballou? If he was good enough to be my friend, if he was good enough to sit up all night with, why couldn\u0027t he be my client?\n I said, \"You\u0027d have to tell me how to find the place.\"\n \"And what place would that be?\"\n \"E-Z Storage.\"\n \"We were just there.\"\n \"I wasn\u0027t paying attention once we got out of the tunnel. I\u0027ll need directions. And you\u0027d better let me have a key for the padlock.\"\n \"When do you want to go? Andy can drive you.\"\n \"I\u0027ll go by myself,\" I said. \"Just tell me how to get there.\"\n I jotted down the directions in my notebook. He proffered the roll of bills, his eyebrows raised, and I told him to put his money away.\n He said this was business, that he was a client like any other, that he expected to pay. I said I\u0027d be spending a couple of hours asking questions that most likely wouldn\u0027t lead anywhere. When the job was done, when I\u0027d done as much as I felt comfortable doing, I\u0027d tell him what I\u0027d learned and how much he owed me.\n \"And don\u0027t your clients usually pay you something in advance? Of course they do. Here\u0027s a thousand dollars. Take it, man, for Jesus\u0027 sake! It won\u0027t obligate you to do anything you don\u0027t want to do.\"\n I knew that. How could money obligate me more than friendship had? I said, \"You don\u0027t have to pay in advance. I probably won\u0027t earn all this.\"\n \"Little enough you\u0027d have to do. My lawyer gets as much every time he picks up the telephone. Take it, put it in your pocket. What you don\u0027t earn you can always give back.\"\n I put the bills in my wallet, wondering why I\u0027d even bothered to argue. Years ago an old cop named Vince Mahaffey told me what to do when somebody gave me money. \"Take it,\" he\u0027d said, \"and put it away, and say thank you. You could even touch your cap if you\u0027re wearing one.\"\n \"Thanks,\" I said.\n \"It\u0027s I should be thanking you. Are you certain you don\u0027t want someone to drive you?\"\n \"I\u0027m positive.\"\n \"Or I can let you have the use of a car, and you can drive yourself.\"\n \"I\u0027ll get there.\"\n \"Now I\u0027ve hired you, I\u0027d best leave you alone, eh? Just let me know if you need anything.\"\n \"I will.\"\n \"Or if you learn anything. Or if you determine there\u0027s nothing to be learned.\"\n \"Either way,\" I said, \"it shouldn\u0027t take more than a day or two.\"\n \"Whatever it takes. I\u0027m glad you took the money.\"\n \"Well, you pretty much insisted on it.\"\n \"Ah, we\u0027re a fine pair of old fools,\" he said. \"You should have taken the money without an argument. And for my part, I should have let you refuse it. But how could I do that?\" His eyes caught mine, held them. \"Suppose some wee fucker kills me before you finish the job. How would I feel then? I\u0027d hate to die owing you money.\"\n I was up a little before noon, and by one o\u0027clock I had picked up an Avis car and found my way to E-Z Storage. I spent the afternoon there. I talked to the man in charge, one Leon Kramer, who started out wary and turned into Chatty Cathy before he was done.\n Elaine rents a storage cubicle in a warehouse a few blocks west of our apartment- she stores artwork and antiques there, the overflow from her shop- but the system at the E-Z facility in New Jersey was different, and a good deal more casual. We have to sign in and out whenever we visit our bin, but E-Z, unattended at night and offering twenty-four-hour access, can\u0027t attempt anything like that level of security. A sign over Kramer\u0027s desk insisted in large print that all storage was entirely at the customer\u0027s risk, and he made the point himself three times in the first five minutes I spent with him.\n So there were no records kept of comings and goings, and nothing stronger than the tenant\u0027s own padlock to keep others out of his storage bin.\n \"They want to be able to come here any hour of the day or night,\" Kramer said. \"Their brother-in-law needs to store some stuff, they can hand him the key without worrying did they put his name on a list of persons authorized to have access. They don\u0027t want to sign in each time, clip on a security badge, fill out a lot of forms. What we got here is more convenience than security. Nobody\u0027s renting one of our bins to stash the crown jewels. Anything really important or valuable\u0027s gonna go in your safe deposit box at the bank. What we get is your mother\u0027s dining room set and the files from Dad\u0027s old office, before you went and put him in the home. All the stuff you\u0027d keep in the attic, except you sold the house and moved to a garden apartment.\"\n \"Or things you\u0027d just as soon not keep around the house,\" I suggested.\n \"Now that I wouldn\u0027t know about,\" he said, \"and I wouldn\u0027t want to know. All I need to know\u0027s your check cleared the first of the month.\"\n \"A man\u0027s storage space is his castle.\"\n He nodded. \"With the exception that you can live in a castle, and you can\u0027t live here. There\u0027s a lot of other things you can do. We call it storage, but it\u0027s not all storage. You see that sign, \u0027Rooms 4 Rent\u0027? That\u0027s what we\u0027re offering, the extra room your house or apartment hasn\u0027t got. I got tenants\u0027ll store a boat here, boat motor and trailer, \u0027cause they got no room to garage it where they live. Others, the room\u0027s their workshop. They set up their tools and do woodworking, work on their car, whatever. Only thing you can\u0027t do is move in and live here, and that\u0027s not my rule, it\u0027s the county\u0027s, or the township\u0027s, whatever. No living. Not that people don\u0027t try.\"\n I\u0027d shown him my business card and explained that I was working for a tenant of his who\u0027d had some goods disappear. He didn\u0027t want to make it a police matter until he\u0027d ruled out the possibility of employee pilferage. That was probably what it was, Kramer said. Somebody who already had a key, went and made himself the boss\u0027s silent partner.\n By the time I left him I had a list of the tenants on the side of the building where John Kenny and Barry McCartney had been shot to death. I\u0027d fumbled my way to a pretext- maybe another customer had seen or heard something- and Kramer went along, either to get rid of me or because we were old friends by then. Ballou\u0027s cubicle, I noted, was officially leased to someone named J. D. Reilly, with an address in Middle Village, in Queens.\n I had a sandwich and fries at a diner across the road, asked a few questions there, then returned to E-Z Storage and used Mick\u0027s key to have another look at the murder scene. I could still detect all the odors I\u0027d smelled the night before, but they were fainter now.\n I\u0027d brought a broom and dustpan, and I swept up the broken glass and dumped the shards into a brown paper bag. There was a reasonably good chance that one of those chunks of glass held an identifiable fingerprint, but so what? Even if it did, and even if I found it, what good would it be to me? A single print will nail a suspect, but it won\u0027t produce a suspect out of thin air. For that you need a full set of fingerprints, and you also need official access to federal records. What I had was useless from an investigative standpoint, and would be useful only when a suspect was in custody and a case was being made against him. \n","sourceLink":"https://allnovel.net/everybody-dies-matthew-scudder-14/page-5.html","bookId":2332,"book":{"id":2332,"title":"Everybody Dies (Matthew Scudder #14)","description":"Storyline: \n Everybody Dies (Matthew Scudder #14) \n Matt Scudder is finally leading a comfortable life. The crime rate\u0027s down and the stock market\u0027s up. Gentrification\u0027s prettying-up the old neighborhood. The New York streets don\u0027t look so mean anymore. \n Then all hell breaks loose. \n Scudder quickly discovers the spruced-up sidewalks are as mean as ever, dark and gritty and stained with blood. He\u0027s living in a world where the past is a minefield, the present is a war zone, and the future\u0027s an open question. It\u0027s a world where nothing is certain and nobody\u0027s safe, a random universe where no one\u0027s survival can be taken for granted. Not even his own. \n A world where everybody dies.\n \n","cover":"https://allnovel.net/images/everybody-dies-matthew-scudder-14.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/everybody-dies-matthew-scudder-14.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:54:03 AM"}}
