{"id":1593,"no":15,"title":"Chapter 15 Young Rome","content":"At the hour named by Heliodora, Basil set forth alone and rode by unfrequented ways towards the street on the Quirinal named Alta Semita. A sense of shame forbade him to make known even to his slaves whither he was going. He kept repeating to himself that it was for the last time; and perhaps a nobler motive would have withheld him altogether, had not the story told by Marcian of his ‘rival’s’ insolent menace rankled in him and urged him to show that he felt no fear. Chance led him past the little church of St. Agatha, which belonged to the Arians; it helped him to fix his thoughts upon Veranilda, and silently he swore that no temptation should prevail against the fidelity due to his beloved. Not far from the Thermae of Constantine, and over against that long-ruined sanctuary of ancient Rome, the Temple of Quirinus, he drew rein at a great house with a semicircular portico of Carystian columns, before which stood a bronze bull, the ornament of a fountain now waterless; on either side of the doorway was a Molossian hound in marble. A carriage and a litter waiting here showed that Heliodora had visitors. This caused Basil to hesitate for a moment but he decided to enter none the less. At his knock he was at once admitted, and a slave was sent to look after his horse. Few houses in Rome contained so many fine works of ancient sculpture as this, for its master had been distinguished by his love of such things in a time when few cared for them. Some he had purchased at a great price; more than one masterpiece he had saved from oblivion amid ruins, or from the common fate of destruction in a lime-kiln. Well for him had he been content to pass his latter years with the cold creations of the sculptor; but he turned his eyes upon consummate beauty in flesh and blood, and this, the last of his purchases, proved the costliest of all. The atrium was richly adorned. A colossal bust of Berenice faced the great head of an Amazon, whilst numerous statues, busts, and vases stood between the pillars; mosaics on the floor represented hunting scenes, the excellence of the work no less than its worn condition showing it to be of a time long gone by. Following his conductor, Basil passed along a corridor, and into a peristyle with a double colonnade. In the midst of a little garden, planted with flowering shrubs, rose the statue which its late owner had most prized, an admirable copy of the Aphrodite of Cnidos; it stood upon a pedestal of black basalt and was protected by a light canopy with slender columns in all but transparent alabaster. Round about it were marble seats, and here, shielded from the sun by little silken awnings, sat Heliodora and her guests. At once Basil became aware of the young Vivian, whose boyish form (he was but some eighteen years old) lounged among cushions on the seat nearest to Heliodora, his eyes fixed upon her beauty in a languishing gaze, which, as soon as he beheld the new comer, flashed into fierceness. The others were two women, young and comely, whose extravagant costume and the attitudes in which they reclined proved them suitable companions of the lady of the house. Whilst yet at some distance, Basil had heard a feminine voice rising to shrillness, and as he approached the group he found a discussion going on which threatened to become more than vivacious. The shrill speaker he had met here before, who she was, he knew not, save that she bore the name of Muscula. ‘You—you—you!’ this lady was exclaiming contemptuously. ‘You say this, and you say that! Mother of God! What do you know about racing? When were you last in the circus at Constantinople? At eight years old you once told me. You have a good memory if you can remember as far back as that!’ She shrieked a laugh, which no one else joined in. Heliodora, to whom the speech was addressed, affected to smile as in lofty tolerance of infantine pettishness. At this moment Basil stepped up to her, and kissed her hand; As though for contrast with Muscula’s utterance, she greeted him in the softest tone her voice could compass, inviting him with a gesture to take a place at her side, or rather at her feet, for she was reclining on a long couch. Heliodora’s robe was of hyacinth blue, broidered in silver thread with elaborate designs. Bracelets, chains, and rings shone about her in the wonted profusion. Above the flat coils of her hair lay a little bunch of grapes between two vine leaves, wrought in gold, and at her waist hung a dagger, the silver sheath chased with forms of animals. Standing behind her the little Anglian slave Laetus gently fanned her with a peacock’s tail, or sprinkled her with perfume from a vial; the air was heavy with Sabaean odours. ‘Ah, here is lord Basil!’ pursued Muscula with a mischievous glance at Vivian. ‘He has lived at Constantinople lately—not thirty or forty years ago. Tell us, sweet lord’—she bent towards him with large, rolling eyes—‘was it not Helladius who won for the Greens when Thomas the Blue was overturned and killed?’ ‘For all I know it may have been,’ replied Basil carelessly; he had scarce heard the question. ‘I swear you are wrong, Muscula,’ put in the third lady. ‘The lord Basil cares naught for such things, and would not contradict you lest you should scratch his face—so dangerous you look, much more like a cat than a mouse. By the beard of Holy Peter! should not Heliodora know, who, though she is too young to remember it herself, has heard of it many a time from her father. You think too much of yourself, O Muscula, since you ate crumbs from the hands of Bessas.’ The boy Vivian gave a loud laugh, rolling on his cushions. ‘O witty Galla!’ he exclaimed. ‘Crumbs from the hand of Bessas. Say on, say on; I love your spicy wit, O Galla! Cannot you find something sharp, for the most grave, the most virtuous Basil?’ ‘Hold your saucy tongue, child,’ said Heliodora with a pouting smile. ‘But it is true that Muscula has won advancement. One doesn’t need to have a very long memory to recall her arrival in Rome. There are who say that she came as suckling nurse in a lady’s train, with the promise of marriage to a freedman when her mistress’s baby was weaned. That is malice, of course; poor Muscula has had many enemies. For my part, I have never doubted that she was suckling her own child, nor that its father was a man of honourable name, and not a slave of the Circus stables as some said.’ Again Vivian rolled on the cushions in mirth, until he caught Basil’s eye as it glanced at him with infinite scorn. Then he started to a sitting posture, fingered the handle of his dagger, and glared at Heliodora’s neighbour with all the insolent ferocity of which his face was capable. This youth was the son of a man whose name sounded ill to any Roman patriot,—of that Opilio, who, having advanced to high rank under King Theodoric, was guilty of frauds, fell from his eminence, and, in hope of regaining the king’s favour, forged evidence of treachery against Boethius. His attire followed the latest model from Byzantium: a loose, long-sleeved tunic, descending to the feet, its hue a dark yellow, and over that a long mantle of white silk, held together upon one shoulder by a great silver buckle in the form of a running horse; silken shoes, gold embroidered, with leather soles dyed purple; and on each wrist a bracelet. His black hair was short, and crisped into multitudinous curls with a narrow band of gold pressing it from the forehead to the ears. ‘Oh, look at little Vivian!’ cried Muscula. ‘He has the eyes of an angry rat. What vexes him? Is it because he saw Basil touch Heliodora’s slipper?’ ‘If I had!’ sputtered the boy. ‘By the devil, if I had!’ ‘Oh, he affrights me!’ went on the mocking woman. ‘Heliodora, stroke his curls, and give him a kiss, I beseech you. Who knows what dreadful thing may happen else?’ ‘I have had enough of this,’ said Galla, rising with a careless laugh. ‘Your house has been intolerable, most dear Heliodora, since you made friends with Muscula. Why you did, I’m sure I don’t know; but for my part I take a respectful leave, noble lady, until I hear that this mouse of the Palatine has ceased to amuse you with its pretty pranks. May I never be saved if she is fit company for women who respect themselves.’ ‘Why such hurry, O chaste Galla!’ exclaimed Muscula. ‘Is your husband at home for once? I can answer for it he is not there very often; the wiser man he.’ ‘Slap her face, Galla,’ cried Vivian. ‘At her! She will run before you.’ Galla moved as if to act upon this advice, but the voice of Heliodora, peremptory, resonant, checked her step. ‘None of that! Get you gone, both of you, and try conclusions if you will in the open street. Off! Pack! By the Virgin Mother, if you linger I will have you flung out of doors.’ In her amazement and indignation, Galla rose to the tips of her feet. ‘This to me!’ she screamed. ‘To me, the only woman of noble birth and honest life who still remained your friend! Wanton! witch! poisoner!’ Basil sprang up and walked aside, overcome with shame at the scene enacted before him, and fearing it would end in ignoble violence. He heard Muscula’s shriek of laughter, a shout of anger from Vivian, and the continued railing of Galla; then, ere he had taken a dozen steps, a hand touched him, and Heliodora’s voice sounded low at his ear. ‘You are right, dear Basil. Only an accident prevented me from being alone at your hour. Forgive me. We will go apart from these base-tongued creatures.’ But almost in the same moment sounded another voice, that of Muscula, who had sprung after them. ‘Sweet lord Basil,’ she murmured at his ear, ‘a moment’s patience, for I have that to say which is worth your hearing.’ Heliodora stepped aside. Pale with fury, she held herself in an attitude of contemptuous indifference. ‘Speak and have done!’ exclaimed Basil harshly. ‘But a word, Illustrious. I know well why you are here. Not for this woman’s painted cheeks and essence-soaked hair: you had enough of that long ago. You come because she pretends to know a secret which concerns you nearly. It was to discover this secret that she sought friendship with me. But do not imagine, sweet lord, that I tell all I know to Heliodora. I have played with her curiosity and fooled her. From me she has learnt nothing true. Even if she desired to tell you the truth—and be sure she does not—she could only mislead you.’ Basil was standing between the two women, his eyes on the ground. Had he watched Heliodora at this moment, he would have understood the sudden start with which Muscula sprang nearer to him as if for protection. ‘I alone,’ she continued, in a voice not so subdued but that Heliodora could hear every word. ‘I alone can discover for you what you wish to know. Give yourself no more trouble in suing to a woman of whom you are weary—a woman evil and dangerous as a serpent. When you choose to seek me, dear lord, I will befriend you. Till that day, fare you well, and beware of other things than the silver-hilted dagger—which she would draw upon me did she dare. But she knows that I too have my little bosom friend—’ she touched her waist—‘though it does not glitter before every eye.’ Therewith Muscula turned and tripped off, looking back to laugh aloud before she disappeared in the corridor. Galla was already gone, half persuaded, half threatened away by Vivian, who now stood with knitted brows glaring at Basil. ‘I must get rid of this boy,’ said Heliodora to her companion. ‘In a moment we shall be alone.’ Basil was held from taking curt leave only by Vivian’s insolent eyes; when Heliodora moved, he stepped slowly after her. ‘Your company is precious, dear Vivian,’ he heard her say, ‘but you must not spoil me with too much of it. Why did you not go away with Galla, whose wit so charms you, and whose husband is so complaisant? There, kiss my little finger, and say good-bye.’ ‘That shall be when it pleases me,’ was Vivian’s reply. ‘To-day I have a mind to sup with you, Heliodora. Let that intruder know it; or I will do so myself.’ Heliodora had the air of humouring a jest. Putting forth a hand, she caught the stripling’s ear and pinched it shrewdly. ‘Little lord,’ she said, ‘you take too large a liberty.’ Whereto Vivian replied with a pleasantry so broad and so significant that Heliodora’s cheek fired; for she saw that Basil stood within hearing. ‘Nay, I must be brief with you, young monkey!’ she exclaimed. ‘Away! When I am at leisure for your tricks I will send for you. Be off!’ ‘And leave you with that . . .?’ cried the other, using a villainous word. Hereupon Basil addressed him. ‘Whether you stay or go, foul mouth, is naught to me. I am myself in haste to be gone, but I will not leave you without a lesson by which, perchance, you may profit.’ As he uttered the last word, he dealt Vivian such a buffet on the side of the head with his open hand that the youngster staggered. The result of this, Basil had well foreseen; he stood watchful, and in an instant, as a dagger gleamed before his eyes, grasped the descending arm that wielded it. Vivian struggled furiously, but was overcome by the other’s strength. Flung violently to the ground, his head struck against the edge of a marble seat, and he lay senseless. Heliodora looked on with the eyes with which she had often followed a fight between man and beast in the amphitheatre. Pride, and something more, lit up her countenance as she turned to Basil. ‘Brave generous!’ she exclaimed, her hands clasped against her bosom. ‘Not even to draw your dagger! Noble Basil!’ ‘Have him looked to,’ was the reply; ‘and console him as you choose. Lady, I bid you farewell.’ For a moment Heliodora stood as though she would let him thus depart. Basil was nearing the entrance to the corridor, when she sprang after him. Her arms were about his neck; her body clung against his; she breathed hotly into his eyes as she panted forth words, Latin, Greek, all burning with shameless desire. But Basil was not thus to be subdued. The things that he had heard and seen, and now at last the hand-to-hand conflict, had put far from him all temptation of the flesh; his senses were cold as the marbles round about him. This woman, who had never been anything to him but a lure and a peril, whom he had regarded with the contempt natural in one of his birth towards all but a very few of her sex, now disgusted him. He freed himself from her embrace with little ceremony. ‘Have I deceived you?’ he asked. ‘Have I pretended to come here for anything but my own purpose, which you pretended to serve?’ Heliodora stood in a strange attitude, her arms thrown back, her body leaning forward—much like some fierce and beautiful animal watching the moment to spring. ‘Do you believe what that harlot said?’ she asked in a thick voice. ‘Enough of it to understand my folly in hoping to learn anything through you. Let us part, and think of each other no more.’ She caught his arm and put her face close to his. ‘Leave me thus, and your life shall pay for it.’ Basil laughed scornfully. ‘That cockerel,’ he replied, pointing to Vivian, who was just stirring, ‘sent me a message this morning, that if I valued my life I should not come here. I heed your threat no more than his.’ They looked into each other’s eyes, and Heliodora, deep read in the looks of men, knew that her desire was frustrate. ‘Go then,’ she said. ‘Go quickly, lest the boy pursue you His second aim might be surer.’ Basil deigned no reply. He went into the vestibule, waited there until his horse was brought up, and rode away. His head bent, scarce noting the way he took, he found himself at the entrance to Trajan’s Forum. Here he checked his horse, and seemed to be contemplating that scene which for centuries had excited the wonder and the awe of men. But when he rode on over the grass-grown pavement, he was as little observant of the arches, statues, galleries, and of that great column soaring between Basilica and Temple, as of the people who moved hither and thither, sparse, diminutive. Still brooding, he came into the Via Lata and to the house of Marcian. Marcian, said the porter, was closeted with certain visitors. ‘Make known to him,’ said Basil, ‘that I would speak but a word in private.’ They met in the atrium. Marcian smiled oddly. ‘If you come to tell me what you have heard this afternoon,’ he whispered, ‘spare your breath. I know it already.’ ‘How can that be?’ ‘I have seen an angry woman. Angry women are always either very mischievous or very useful. In this case I hope to make use of her. But I can tell you nothing yet, and I would that you were far from Rome. Could I but persuade you to be gone, dear Basil.’ ‘I need no more persuading,’ replied the other, with sudden resolve. ‘If it be true that I am free to leave the city, I go hence tomorrow.’ Marcian’s face lighted up. ‘To Asculum, then?’ ‘Since here I have no hope. Can I trust you, Marcian?’ he added, grasping his friend’s hand. ‘As yourself—nay, better.’ ‘Then, to Asculum.’","sourceLink":"http://novel.tingroom.com/mingren/1396/41783.html","bookId":54,"book":{"id":54,"title":"Veranilda","description":"简介： Seven years long had the armies of Justinian warred against the Goths in Italy. Victor from Rhegium to Ravenna, the great commander Belisarius had returned to the East, Carrying captive a Gothic king....","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/1396","creation":"Aug 1, 2019 12:18:13 AM","modification":"Aug 1, 2019 12:18:13 AM"}}
