{"id":106465,"no":14,"title":"Page 14","content":"At the middle of the afternoon of the second day on the road away from Delhi, Timur-i ordered Sanat Ji Mani into a covered wagon. \"You are like the white-skinned ones, whose eyes are red; you burn,\" he announced. \"You shall not have to ride in the sun. I need you able to work, foreigner, or my men will kill you and leave your body for the carrion birds to feast upon. Let him be put out of the light.\" He motioned to his nearest lieutenants. \"Give him to the jugglers and tumblers and fools. They will look after him. He will be no danger to them.\" With that he set his sturdy pony cantering away. Sanat Ji Mani looked up through pain-clouded eyes at the hardfaced officers who tugged him off his mount and slung him over the rump of one of their small, tough horses, then took his saddlebags of medicaments and rode without speaking to the rear of the line of troops and wagons, dust swirling around them as thick as smoke; it was a long way to the last of the wagons, and the officers kept their horses to a brisk trot. The block of wood attached to his foot bounced heavily with each step the horses took, sending a dull, gnawing pain up Sanat Ji Mani\u0027s leg; the small supply of native earth in the sole of his left boot provided little anodyne against his hurts. It was almost sunset and the army would make camp soon; he welcomed the coming dark with an eagerness that was almost passion. \"Djerat!\" one of the officers shouted. \"Djerat, come!\" He drew his horse alongside a large wagon surmounted by a fully rigged tent; the wagon was pulled by six mules and was driven by a woman covered in dark-red, curling hair. \"What do you want?\" the driver demanded in a high, sweet voice. \"Timur-i wishes you to carry this foreigner with you. He is reputed to be a healer, so look after him well. He is to come to no harm. And keep his supplies with him.\" The second officer laughed. \"I will catch his horse and bring him to your wagon to be tied to the rear. You may have a use for him.\" \"Can this foreigner not ride?\" the woman asked. \"He can, but the sun has left him blackened and blistered,\" said the first. \"Look for yourself.\" He reached out and caught his hand in Sanat Ji Mani\u0027s hair, lifting his head to show the driver the extent of the burns on his face. \"Is it Timur-i\u0027s wish that he ride with us? With us? Why us? You say it is Timur-i who orders us to-\" The woman sounded surprised and a bit anxious, and as she pulled her wagon out of the immediate line of horses and vehicles, she added, \"Are we to be paid for this?\" as she pulled her team to a stop. \"In favor,\" said the second officer. \"Come. Help us get him into your tent.\" He pulled up his horse and swung out of the saddle. Djerat sighed. \"I am with child,\" she reminded the two officers. \"I will call Tulsi to help you-she is strong and capable.\" Before they could approve this, Djerat raised her voice. \"Tulsi! Tulsi! Come here! These men need your help.\" Sanat Ji Mani was lowered to the ground, protesting weakly that he could stand on his own. \"I will get into the wagon, officers, and I will recover.\" The taller of the two men shook his head. \"You are burned badly, foreigner. Let the woman aid you.\" The shorter officer handed down Sanat Ji Mani\u0027s sack of medicaments and tools. \"Here. You must keep this with you.\" Before Sanat Ji Mani could take it in hand, a muscular young woman of diverse heritage, with short-cut brown hair and grey-green, almond-shaped eyes, appeared in the opening of the tent. She wore leggings and a short caftan, all in red-orange silk. \"I will take that,\" she said, jumping down from the driver\u0027s seat and landing with a forward somersault that left her standing almost directly in front of the dismounted officer. \"He looks frightful,\" she said. \"I will heal,\" Sanat Ji Mani muttered through cracked lips as he reminded himself that the road to Baghdad had been much worse. \"Perhaps,\" said Tulsi, making a face. \"The backs of your hands are black and oozing.\" \"I will heal,\" Sanat Ji Mani repeated, raising his voice as much as possible. He could not see Tulsi very clearly, but he found himself reminded of Tishtry, thirteen hundred years gone in the Roman Arena. Tulsi regarded Sanat Ji Mani with distaste. \"I do not want to touch him,\" she admitted, batting the air with her hand as a particularly dense wave of dust surged over them. \"But I suppose I must.\" \"I can stand,\" Sanat Ji Mani said. \"And you can fall over, too, no doubt,\" said Tulsi. She looked at the two officers. \"How long has he worn Timur-i\u0027s stirrup?\" she asked, indicating the staple. \"Six weeks,\" said the taller officer. \"He has mended well. There was no festering.\" \"Then maybe he is a healer,\" said Tulsi, sighing before she stepped forward and wedged her shoulder under Sanat Ji Mani\u0027s left arm. \"We will look after him. He will ride in the tent and his burns will fade. You may report to Timur-i that we have him in hand.\" She turned carefully, making sure Sanat Ji Mani did not drag his stapled foot. \"We are going to the rear of the wagon, stranger. There is a way into the tent there.\" She steadied him, holding out her free hand. \"Give me his things.\" The taller officer reached down and picked up Sanat Ji Mani\u0027s bag and handed it to her. \"There. See he improves.\" He vaulted back into the saddle, gathered up his reins, then, with his comrade, set their horses cantering toward the head of the line once again. \"Come, stranger,\" Djerat called out. \"We must join the march again.\" \"I am bringing him, Djerat,\" said Tulsi, carefully making her way toward the rear of the wagon, balancing Sanat Ji Mani against her side. \"The stirrup hurts?\" \"The sunburn is worse,\" Sanat Ji Mani told her, trying to smile without success. As terrible as he felt, in some remote part of himself, he was alert to Avasa Dani, far away, and undergoing a change of her own; this provided him a little distraction from his present affliction, and he concentrated on it for the relief it brought. \"No doubt,\" she said as they reached the end of the wagon. \"I am going to fetch steps for you. Lean on the wheel,\" she said, and slid out from under his arm. Sanat Ji Mani staggered two steps to the large rear wheel and sagged against it, glad of the wedge of shadow the tent above him provided; once inside, he promised himself to rest and let his body work its cure. The passing wagons and horses of Timur-i\u0027s army sounded like constant thunder in his ears, and he longed for silence. Tulsi appeared in an opening in the back of the tent, a two-step stool in her hand; she dropped out of the wagon and set this in place. \"I will help you climb. Start on the stirrup first. It will lift you a little higher.\" \"Very well,\" said Sanat Ji Mani, and stumbled into the sunlight. It took him longer to get up the steps than he had anticipated, and he had been glad of Tulsi\u0027s assistance. As he half-stepped, half-fell into the tent, he whispered his thanks as he stretched out on a pile of folded carpets, his bag under his shoulder. \"Plenty of time for that when you are well,\" said Tulsi as she pulled the steps into the wagon and called out, \"Djerat! Go!\" The wagon lurched forward as the mules were put into motion again and the wagon was guided back into the river of vehicles moving along the Sultan\u0027s Road toward Lahore. It was well into the night when Sanat Ji Mani awoke, his body aching and his hunger intense. He sat up, trying to remember where he was. As he tried to move his legs the events of the afternoon came back to him, and he put his hands to his eyes as if to shut out the knowledge; he was in a wagon inside a tent, and all around him Timur-i\u0027s army was camped. On the other side of the wagon two figures slept, one on a narrow, footed bed, the other on a pallet of thick-woven pads of yak-hair; Sanat Ji Mani recognized the haircovered driver on the bed and Tulsi on the pallet. These two women, he realized, were part of the entertainers who traveled with Timur-i\u0027s army, and as such, never saw combat. He shifted his posture to be more comfortable and stared down at his hands, the darkness offering only slight impediment to his vision; the skin was still cracked but it was beginning to heal, and the blackened crust would fall off in a day or two if he stayed out of the sun. \"Stranger?\" Tulsi\u0027s sleepy voice startled Sanat Ji Mani, and he looked up abruptly. \"I am awake,\" he said softly. \"You slept long,\" she said, keeping her voice low. \"For which I thank you,\" he said. He looked up at the night sky through the opening in the tent\u0027s rear flap. \"We are half-way to morning. Do not let me rob you of your sleep.\" She scrubbed her hand through her hair. \"That is a nice thing to say, that you thank me.\" \"Why; you have done me a service and I am grateful,\" he said. \"Most people do not ...\" She let her words trail off into a yawn. \"Do you want anything out of your sack, to put on your skin?\" \"No,\" he said. \"My skin will recover now I am out of the sun.\" He paused. \"Will you permit me to ride inside this tent tomorrow?\" \"While your skin is burned and cracked? Most certainly. Timur-i expects that of us, to keep you with us until you recover.\" She yawned again. \"Timur-i may expect it, but you are the one providing the shelter,\" Sanat Ji Mani pointed out, and fell silent for a short while. Then, \"You have helped me,\" he said. \"You talk funny,\" she told him as she rubbed the sleep from her eyes. \"Old-fashioned, like my grandmother.\" Sanat Ji Mani did his best to soothe her. \"I learned your language long ago.\" \"It sounds like it,\" she said. \"Your teacher must have been old, too.\" She giggled. On her narrow bed, Djerat began to snore. \"Old enough,\" said Sanat Ji Mani, recalling the blind musician in Karakhorum who had taught him, almost two centuries before. Tulsi stretched, lithe as a cat, and sat up. \"Some of the men speak the language of the Turks,\" she said as if she disapproved. \"Timur-i Lenkh\u0027s father is a Turk,\" Sanat Ji Mani pointed out. \"His mother is Mongol, and he rules from the power of the Jagatai, not the Balas.\" Her lips pursed in disapproval. \"I would guess that Timur-i rules from his own power,\" said Sanat Ji Mani, his voice gentle. Tulsi looked at him. \"Perhaps,\" she allowed after a long moment\u0027s thought. She got onto her knees. \"Why do you help him?\" \"I have no wish to be hacked into pieces,\" Sanat Ji Mani said as honestly as he could. \"But you are a foreigner and a captive,\" she said. \"As long as I am, it would be wise to be useful, would it not.\" He let her consider her answer; when she did not speak, he went on, \"I will do what he requires of me to the full extent of my capabilities, not entirely because I want his favor, but in part because I have pride in my skills. I do not want to fail Timur-i because I do not want to fail myself.\" She stifled a laugh. \"You are as bad as I am.\" He smiled, and this time it worked. \"You take pride in your skills, too.\" \"Of course. I earn my living through them,\" she said, and considered him. \"I suppose you do, too.\" \"Upon occasion,\" he agreed. \"Yes; you have not always treated the sick-you seem too prosperous, and your manner is too elevated.\" She moved a little closer to him. \"Are you a grand prince, cast out of your kingdom, or a leader of men who has been betrayed? Or were you the betrayer?\" She considered the last and added, almost to herself, \"No, I do not think so. Perhaps another of your family was a betrayer and you have paid the price.\" \"Nothing quite so exciting, I fear,\" he said, glancing at Djerat to be sure the hirsute woman was still asleep. \"But there must be some mystery. You are from the West, yet you were found in Delhi.\" She stared at him eagerly. \"How is that possible?\" \"Men from the West travel,\" said Sanat Ji Mani. \"Not as far as Delhi, most of them, but some have gone all the way to China.\" He thought back to his days in Lo-Yang and wondered how this curious young woman would respond to knowing he had taught in China in the years before Jenghiz Khan invaded from the north. \"You, too, have a tale to tell, by the look of you.\" \"Nothing remarkable,\" she said quietly. \"Still, I would like to hear it. You are inquisitive; so am I.\" His eyes held hers, compelling an answer. Tulsi lowered her voice to just above a whisper. \"My father came from Kiev in Lithuania-or so he said. He trained bears. My mother was a contortionist, from Shang-tu. They met in Samarkand. I was born there. I was given my name by a fortune-teller from Budaun: Tulsi Kil. All those in our troupe were named by him, for luck.\" \"Samarkand is Timur-i\u0027s city,\" Sanat Ji Mani said. \"Yes.\" She waited, a frown growing between her brows. \"Well?\" He studied her face. \"What do you wish to know?\" \"Where you come from, of course, and how you happen to be here.\" She made an impatient gesture. \"Oh.\" He leaned back, wondering how much he should tell her. \"I am not from Delhi, as you have said. I am from the West.\" \"That is obvious,\" she said. \"I knew that before you told me anything. You have heard what I think of you. How have I erred?\" \"I am from mountains far to the west of here, called the Carpathians. Just at present, Hungary and Wallachia rule the region where I was born. I am an exile.\" Nothing that Timur-i had heard from Josha Dar would contradict that, Sanat Ji Mani knew. \"You are a captive of Timur-i Lenkh,\" she corrected him, sounding weary. \"We are all his captives, one way or another.\" \"True enough,\" Sanat Ji Mani said. \"But captive or not, I am still an exile.\" Tulsi smiled a little. \"You are more than that. I can see it in your face.\" Sanat Ji Mani touched the peeling skin of his forehead. \"If you can see anything but this burn, you astonish me.\" \"You know what I mean,\" she said with a chuckle. \"You are not so hidden as you think.\" There was something in her remark that struck him deeply. \"Why do you think I am trying to hide?\" \"I have not discerned that yet,\" she admitted. \"In time I will.\" She stretched again. \"You may want to remain awake, but I do not. We must be moving again at first light or Timur-i will kill us for being stragglers.\" She lay back on her pallet and pulled the two rough-woven blankets up to her throat. \"Keep guard, stranger.\" \"I will,\" Sanat Ji Mani assured her. She raised her head to look at him. \"I believe you,\" she said, and turned away to rest, her head on her outstretched arm. He went to where the mules were tied and had the first sustenance he had had in days; it was little enough, but it gave him some strength, and he began his restoration, patting the mule on the neck, saying to the animal, \"It was not enough to harm you, and it has revived me.\" He limped back to the wagon, moving faster than he had before. Morning saw them on the road again, the army moving at a steady pace toward the River Indus. Mounted soldiers rode back and forth along the line, keeping all the carts and wagons together, allowing none of them to fall behind. Djerat sat on the driver\u0027s seat and managed the reins with the easy competence of long practice; she paid no attention to Sanat Ji Mani and Tulsi, who remained under cover of the tent. As the day wore on, the wind picked up and soon, both Tulsi and Sanat Ji Mani were busy keeping the tent tied to its wooden frame; it proved a difficult task and made the two of them work increasingly harder as the afternoon brought stronger gusts of hot, dry air from the south-west. \"The stay is torn!\" Tulsi shouted as a flap of cloth pulled away from its moorings; the tent sang like the sail of a ship as the wind took gleeful hold of it. Sanat Ji Mani went to her side, a length of braided silk cord in his hand. \"Here. This will hold,\" he said as he caught the tattered stay and pulled the flap against the frame, knotting the cord to the end of the tent fabric. \"This will tighten the more it is pulled.\" He had learned it from Roman sailors when he had crossed the Oceanus Britannicus the first time in the company of the troops of Julius Caesar. Tulsi examined the knot skeptically. \"I will check it later,\" she said, and went to secure the rear opening once more. Fine, silky grit filled the air and scoured everything in its path. \"The mules will have harness sores tonight.\" \"I have a medicament that may help them,\" Sanat Ji Mani volunteered. \"When we have stopped at the end of the day, I will tend to them.\" And, he added to himself, he would have the chance to take a little blood from the mules again-not enough to weaken them, but sufficient to sustain him for a time; the lack of a supply of his native earth, and having just one boot to keep it in was beginning to take a toll on him. Without blood or his native earth he would soon fall into a stupor and waken from it only for ravenous appetite. \"Will you treat animals as well as men?\" Tulsi asked in some surprise. \"If it is necessary, of course I will.\" He took hold of one of the stays holding the ceiling of the tent and refastened it to the frame. \"When this storm is past, the stays will all need to be resewn. Otherwise, they will snap in the next hard blow.\" Half-standing in the moving wagon with a thick wooden block under his right foot was no easy trick, but Sanat Ji Mani was still strong enough to manage. \"I suppose you will help me?\" Tulsi said, making no excuse for her sarcasm. \"Yes, if my hands are no longer too burned. I know how to use a needle.\" He was pleased to see her surprise. \"I am not an incompetent, Tulsi Kil. I have learned a few things in my travels.\" \"So you may have,\" she conceded, and tucked in a portion of the lining of the tent that the wind was attempting to tease out of the rear flap. It was an enervating afternoon, and by the time the order came to stop for the night, everyone was worn-out; the horses and mules all drooped with fatigue, and many of the men and animals were irritable with fatigue. Only the wind capered on, lively as ever. \"I hate dust,\" said Djerat as she attempted to remove it from her hair using a small ivory comb; her thick, curly hair was standing up and sparking, and every effort to tend it brought another crackle. \"Use one of the mules\u0027 brushes,\" Sanat Ji Mani recommended, his manner kindly and his tone polite. \"You will have less trouble.\" Djerat stared at him. \"I may have hair all over me,\" she said slowly and with immense dignity, \"but I am not yet an animal.\" \"I never thought so,\" Sanat Ji Mani said at once, trying to undo any slight she may have assumed, \"but I think the brushes for the mules might get the dust out with less discomfort than a comb: it is what they are designed to do.\" Tulsi was laying a campfire in anticipation of the evening meal; this suggestion claimed her attention. \"He may have an idea, Djerat.\" \"Do you take his part?\" Djerat countered sharply. \"He is a stranger. I am your travel companion. And this is my wagon.\" \"He also has offered something useful. Try the brushes. If they do not get rid of the dust, you can always go back to combing.\" Tulsi went to the wagon and pulled out a box of rough planking, containing the brushes, picks, and salves used on the mules. She took out the smallest of the brushes and tossed it to Djerat. \"There. See if it works.\" Grudgingly Djerat took the brush and, beginning on her forearm, began to ply its stiff bristles along the grain of her hair. \"It is quicker,\" she conceded. \"I will help you as soon as the fire is going,\" Tulsi said, and glanced at Sanat Ji Mani. He took her meaning. \"I will start the fire. You may help Djerat, if you like.\" Tulsi smiled. \"Yes. Another good idea.\" Sanat Ji Mani went to the stack of wood and dried dung that Tulsi had piled up. He took flint-and-steel from the small wallet hanging from his belt and gathered up a small mound of wood scraps and dried bark. Cupping his hands to keep out the worst of the wind, he struck the flint with the steel and saw a spark leap; the third one caught, and a tiny spot of flame poked out of the kindling. Using a small stone, Sanat Ji Mani shoved the kindling inside the stack of fuel, and watched as it began to burn in earnest. \"There,\" he said as he rose awkwardly to his feet, trying to balance on his uneven footing. \"There will be supper shortly,\" said Djerat, her tone a bit more cordial. \"You can have a share.\" \"Thank you, but I will fend for myself,\" Sanat Ji Mani said. \"Among my people, it is considered improper to ... to feed with more than one person.\" \"An odd tradition,\" said Djerat, shrugging. \"If you do not want to eat with us, so be it. Feed or starve as you like.\" She signaled to Tulsi. \"Bring the pot. There are goats being slaughtered tonight and I will go get our share.\" Tulsi did as she was ordered, returning with a good-sized metal cauldron in her arms. \"Here,\" she said as she handed it to Djerat. \"Good. You tend the fire and I will go get our meat. Bring the rice and the onions and a good measure of water so we may get to cooking as soon as I return.\" Djerat swung away and was about to go off to the center of camp for their rations of goat when Sanat Ji Mani claimed her attention once more. \"If you do not mind, I will examine your mules and see they have no injuries from the dust. I can treat them if they do; I will check their hooves, too, in case of any trouble-\" Before he could go on, she gave him a curt response. \"Do as you like.\" Saying that, she toddled off, the pot held clasped to her front like an enormous, metallic pregnancy. \"You must not mind her,\" Tulsi said from her place beside the fire, which she was building up by adding small, cut branches to it. \"Djerat has not often been shown anything but mockery, and that makes her doubt courtesy. She is not accustomed to accommodating strangers, and she is-she wants to guard me from harm.\" \"Ah,\" said Sanat Ji Mani as he went to take grooming brushes from the box Tulsi had opened. \"Have you need of guarding?\" \"Sometimes. Not very often. The soldiers get drunk now and then, and they do not-\" She broke off. \"They are allowed to drink?\" Sanat Ji Mani asked. \"I have been told followers of the Prophet do not drink.\" Brushes in hand, he walked back to the line to which the mules were tethered. \"Not wine. But mare\u0027s milk that has fermented is another matter, or so Timur-i has been told by his teachers.\" If Tulsi thought this was an odd interpretation of Islamic law, nothing in her voice or manner revealed it. Sanat Ji Mani reached the mules and stood still while they took stock of him. Then he moved toward the first one and began to brush his neck, working down and back. Dust flew from his coat in plumes and the mule dropped his head, ears flopping in satisfaction. Brushing the close-cropped mane proved a bit more difficult, but the mule did not protest the care. Sanat Ji Mani continued back and down until he had brushed off the rear legs and the scruffy tail; he had found four abrasions from where the harness and dust had worn away hair and skin, leaving a small scab on the pale coat. \"I\u0027ll treat that later,\" he promised the animal before moving to the next in line. By the time Djerat came back with her allocation of goat, Sanat Ji Mani was working on the fifth mule. He was prepared to bring his medicaments to tend the hurts as soon as the grooming was done, and he reported as much to Djerat. \"Do as you must,\" she said, setting down the pot next to the fire. \"Tulsi, bring the onions. Why haven\u0027t you fetched them before now? Quickly. I want to eat before the night is half-gone.\" \"I will,\" said Tulsi, and went to get the strings of onions from the wagon. \"So,\" said Djerat, glowering in Sanat Ji Mani\u0027s direction. \"You fancy her.\" \"I admire her, certainly; I admire you,\" he said as he completed his work on the fifth mule and moved on to the sixth. \"Because you like this pelt?\" she scoffed. \"No; I can see you are taken with her. I warn you she will not have congress with you. She is a tumbler and her living depends on her abilities. She will not risk starvation or death for a length of hot flesh in her woman\u0027s portal.\" \"I would not ask it of her,\" said Sanat Ji Mani, brushing the chest of the sixth mule. Djerat laughed unpleasantly. \"All men pledge that, and all of them lie.\" \"Tulsi is coming,\" Sanat Ji Mani warned, and fell silent as Djerat busied herself putting rice and water into the pot. \"Here are the onions,\" said Tulsi, glancing from Djerat to Sanat Ji Mani and back again as if sensing something in the air between them; she said nothing but as she handed the onions to Djerat, the older woman seized her arm. \"What is it?\" \"You trust too readily. You must remember what happened to your parents, child,\" Djerat implored her. Tulsi went pale and took a step back, pulling herself free of Djerat\u0027s grip. \"I never forget that. Never.\" Sanat Ji Mani watched this exchange with curiosity mixed with concern as he busied himself grooming the sixth mule: whatever message Djerat sought to give, he doubted it was to his benefit; he would have to proceed with care in all he did, for he was certain he would be under intense scrutiny from now until he left Timur-i Lenkh\u0027s army. Text of a letter from Rogerian to Sanat Ji Mani, written in the Latin of Imperial Rome, sent from Alexandria to the Red Sea and carried on the Sea Maiden to Chaul; never delivered. To my master, known as Sanat Ji Mani, residing at Delhi in the Delhi Sultanate in the Street of Brass Lanterns, the greetings of Rogerian from Alexandria in the Mameluke Empire of Egypt. I have claimed your house in this city, and have paid such fees as have been assessed against it to the authorities of the Mamelukes. I will remain in this place for five years, and if you have not reached here by the end of that time, I will go on to Rome, to the estate of Atta Olivia Clemens where I shall remain for another five years. Do not ask me to wait longer than that: if Saxony and Spain taught me nothing else, they showed me the folly of delaying a search for you too many years. The house is in need of repairs which I have authorized, and which should be completed within the year. In the meantime, I have paid the laborers as you would want them to be paid, and I will provide bonuses for early completion of their work. When you arrive here, the house will be to your liking. I have also commissioned masons to build an athanor for your use-the old one has fallen to ruin and would not be safe to use. I have taken the three jars of gold from the hiding place in the garden well, and if I must, I will take another three to continue to support this household and pay the authorities the various taxes they impose. I have taken care to conceal my explorations of the well, going into it only late at night; I am sure I have not roused the curiosity of anyone in this part of the city in doing this, just as you would require were you here to make such decisions yourself. Rustam Iniattir has made a place for himself and his household in the city of Fustat, a place convenient for merchants and where his faith is not as condemned as it might be in other cities. He is working at setting up more caravans, and I am providing him with funds in your name, with the assurance that you will continue your ventures with him when you arrive here. He is considering sending one of his sons here to Alexandria, but that will require more money than he can spare, and he will not permit me to pay for such an establishment, for he fears becoming too indebted to you. He may change his mind in a year or so, and I have informed him that the offer for such support will not be withdrawn. As regards Avasa Dani, I have much to report: shortly after we arrived here in Alexandria she was taken with a fever that, in a matter of ten days, killed her. As you must be aware, she woke to your life two nights later, and I have endeavored to help her to meet the demands of what has happened to her. She has informed me that she will not remain in this house now that she is a vampire, and she is seeking some means of making her way in the world that will not endanger her or you. I have tried to persuade her that you would prefer she stay here until you come, but she will have none of it. She is a married woman and her first loyalty must always be to her husband, although she will never see him again in this life, even though he may again come to Delhi. For that reason alone she is unwilling to accept your hospitality now that she has changed. She is aware of your blood-bond, and has said that she seeks no stronger connection than what you have already. I have not been able to find a convincing argument to put before her in this regard, and therefore I have offered her such money as she may need to establish herself as she wishes. You would want her to have what she seeks, I know, and to that end, I will strive to accommodate whatever demands she may have in days to come. I have not yet informed Rustam Iniattir of Avasa Dani\u0027s death, in case he should visit here and find her apparently living. I do not know when I will tell him, or what, precisely, I shall say, but for the time being, it is just as well that he continue to believe that she is alive. It will be less awkward to maintain the fiction than to explain her presence if he has been informed of her death. There is fear in the Mameluke Empire that Timur-i will once again come westward and strike at the city of Damascus and perhaps make another attempt on Jerusalem. If he should succeed in these places, everyone is afraid that all the Nile will be open to his army. According to what we hear in Alexandria, Timur-i turned westward after sacking Lahore; I hope that is true, and that he did not, in the end, try to reach Delhi, or, that if he did, you have found some way to leave the city before he arrived. If that is the case, this letter may never reach you, but it may be just as well, for it would mean you are safe. Do not worry for your holdings here: I will look after them, and after Villa Ragoczy outside of Rome as well if I must journey there. I will prepare a copy of this letter and place it in the secured niche behind the ovens in the kitchen where you will know to look for it, and copies of any others I may write to you from time to time. I trust you will look to your safety while you are still in Delhi, and will travel here as swiftly as ship and caravan will bring you. Rogerian On the 29th day of January in the Christian year 1399 at Alexandria","sourceLink":"https://allnovel.net/a-feast-in-exile-saint-germain-14/page-14.html","bookId":2500,"book":{"id":2500,"title":"A Feast In Exile (Saint-Germain #14)","description":"Storyline: A Feast In Exile (Saint-Germain #14) A Feast in Exile draws readers back to the time when the Mongol hordes of Timur (known in the West as Tamerlane) swept across fourteenth-century India and Asia. Delhi\u0027s civilized veneer crumbles along with its walls. Foreigners, which the vampire Saint-Germain-here called Sanat Ji Mani-surely is, lose their positions, homes, wealth, and sometimes their lives, if they cannot escape the falling city. Before he can flee Delhi, Sanat Ji Mani must ensure the safety of Avasa Dani, his beautiful ward, who has been abandoned by her husband. Sanat Ji Mani\u0027s love has awakened Avasa Dani\u0027s every sense; even she will become a vampire upon her death, but she finds no terror in this fate. Avasa Dani and Rojire, Sanat Ji Mani\u0027s servant, successfully make their way out of Delhi, but Sanat Ji Mani himself is trapped. His life is bought by his skills with medicine, but, at Timur\u0027s command, he must travel-by day, and exposed to the sun-with the conqueror\u0027s army. Crippled and unable to escape, he knows that his vampire nature will soon be revealed, and then... Avasa Dani, with a worried Rojire at her side, considers her options as a woman without a visible male protector in a land and time ruled by men. While one of Sanat Ji Mani\u0027s allies searches desperately for the missing vampire, Saint-Germain and a young acrobat, with whom he has escaped from Timur\u0027s forces, make their slow and painful way to freedom. The journey changes them both forever.","cover":"https://allnovel.net/images/a-feast-in-exile-saint-germain-14.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/a-feast-in-exile-saint-germain-14.html","creation":"Oct 5, 2019 8:58:47 AM","modification":"Oct 5, 2019 10:56:49 PM"}}
